{"adult":false,"backdrop_path":null,"belongs_to_collection":null,"budget":0,"genres":[],"homepage":"http://www.eikon-film.de/produktionen/details/die-letzte-schlacht-christliche-fundamentalisten-in-den-usa.html","id":60864,"imdb_id":"","original_language":"en","original_title":"Die Letzte Schlacht - Christliche Fundamentalisten in den USA","overview":"A co-production of the ZDF / Eikon Media and epo film in collaboration with Arte, developed with the support of the MEDIA Programme of the European Union, the Discovery Master School 2006 and the Evangelical Church of Germany  If the media is talk of fundamentalists is meant basically Islamism. \"The Final Battle\" but not from the Islamic but the Christian fundamentalism in the United States. As in the Islamic equivalent of the Christian fundamentalists follow a political ideology that uses religious language. Their expected target: a Christian nation, based on the laws of the Bible literally designed. They fight with all their might to enforcing their morals in politics and society.  What makes this diverse movement in the US for so many people so attractive?  In the documentary \"The Final Battle\" Claudia Wilke analyzed in four stages means by which the Christian fundamentalists have managed to become one of the most influential social and political powers.","popularity":0.003063,"poster_path":"/9MbyPCpBfcSophCgyQSclMlf6fk.jpg","production_companies":[{"name":"Eikon Film","id":1946}],"production_countries":[{"iso_3166_1":"DE","name":"Germany"}],"release_date":"2008-05-24","revenue":0,"runtime":0,"spoken_languages":[],"status":"Released","tagline":"","title":"The Final Battle - Christian Fundamentalists in the USA","video":false,"vote_average":0.0,"vote_count":0,"credits":{"cast":[],"crew":[]},"release_dates":{"results":[{"iso_3166_1":"DE","release_dates":[{"certification":"0","iso_639_1":"","note":"","release_date":"2008-05-24T00:00:00.000Z","type":3}]}]},"alternative_titles":{"titles":[]},"translations":{"translations":[{"iso_639_1":"en","iso_3166_1":"US","name":"English","english_name":"English"}]},"keywords":{"keywords":[]}}