{"response":{"meta":{"hits":14,"time":12,"offset":10},"docs":[{"web_url":"http:\/\/www.nytimes.com\/2013\/01\/17\/sports\/ncaabasketball\/maryland-defeats-nc-state.html","snippet":"Alex Len dropped in a missed shot with 0.9 of a second left, giving host Maryland a stunning 51-50 victory over No. 14 North Carolina State....","lead_paragraph":"Alex Len dropped in a missed shot with 0.9 of a second left, giving host Maryland a stunning 51-50 victory over No. 14 North Carolina State.","abstract":"Maryland beats North Carolina State, 51-50, in men's college basketball.","print_page":"22","blog":[],"source":"The New York Times","multimedia":[],"headline":{"main":"Maryland Defeats N.C. State","print_headline":"Maryland Defeats N.C. State","content_kicker":"Sports Briefing | College Basketball"},"keywords":[{"rank":"1","is_major":"Y","value":"Basketball (College)","name":"subject"},{"rank":"2","is_major":"Y","value":"North Carolina State University","name":"organizations"},{"rank":"3","is_major":"Y","value":"University of Maryland","name":"organizations"}],"pub_date":"2013-01-17T00:00:00Z","document_type":"article","news_desk":"Sports","section_name":"Sports","subsection_name":"College Basketball","byline":{"contributor":"","person":[],"original":"By THE ASSOCIATED PRESS","organization":"THE ASSOCIATED PRESS"},"type_of_material":"Brief","_id":"50f7b15700315214fbb8567d","word_count":"82","slideshow_credits":null},{"web_url":"http:\/\/fifthdown.blogs.nytimes.com\/2013\/01\/17\/quirks-of-the-game-for-coaches-a-tough-road-back-to-super-bowl\/","snippet":"The list of coaches who made it - win or lose -- to the Super Bowl with more than one team remains shorter than the similar list in the other sports....","lead_paragraph":null,"abstract":"The list of coaches who made it - win or lose -- to the Super Bowl with more than one team remains shorter than the similar list in the other sports.","print_page":null,"blog":[],"source":"The New York Times","multimedia":[{"width":75,"url":"images\/2013\/01\/18\/sports\/basketball\/18walsh\/18walsh-thumbStandard.jpg","height":75,"subtype":"thumbnail","legacy":{"thumbnailheight":"75","thumbnail":"images\/2013\/01\/18\/sports\/basketball\/18walsh\/18walsh-thumbStandard.jpg","thumbnailwidth":"75"},"type":"image"}],"headline":{"main":"Quirks of the Game: For Coaches, a Tough Road Back to Super Bowl","kicker":"The Fifth Down"},"keywords":[{"rank":"1","name":"persons","value":"Ewbank, Weeb"},{"rank":"2","name":"persons","value":"Harbaugh, Jim"},{"rank":"3","name":"persons","value":"Johnson, Jimmy"},{"rank":"4","name":"persons","value":"Manning, Peyton"},{"rank":"1","name":"organizations","value":"Denver Broncos"},{"rank":"2","name":"organizations","value":"National Basketball Assn"},{"rank":"3","name":"organizations","value":"National Football League"},{"rank":"4","name":"organizations","value":"Oakland Raiders"},{"rank":"5","name":"organizations","value":"Washington Redskins"},{"rank":"1","name":"subject","value":"Coaches and Managers"},{"rank":"2","name":"subject","value":"Football"},{"rank":"3","name":"subject","value":"Super Bowl"}],"pub_date":"2013-01-17T14:36:43Z","document_type":"blogpost","news_desk":null,"section_name":"Sports","subsection_name":"Pro Football","byline":{"person":[{"organization":"","role":"reported","firstname":"Stuart","rank":1,"lastname":"MILLER"}],"original":"By STUART MILLER"},"type_of_material":"Blog","_id":"50f855fe00315214fbb85933","word_count":"1105","slideshow_credits":null},{"web_url":"http:\/\/rendezvous.blogs.nytimes.com\/2013\/01\/17\/iht-quick-read-jan-17\/","snippet":"Hostages taken in Algeria; German gold to return home; 787s grounded; Art Basel expands to Hong Kong; a determined archaeologist in Turkey; basketball goes to London....","lead_paragraph":null,"abstract":"Hostages taken in Algeria; German gold to return home; 787s grounded; Art Basel expands to Hong Kong; a determined archaeologist in Turkey; basketball goes to London.","print_page":null,"blog":[],"source":"The New York Times","multimedia":[{"width":600,"url":"images\/2013\/01\/17\/business\/Goldjp\/Goldjp-articleLarge.jpg","height":370,"subtype":"xlarge","legacy":{"xlargewidth":"600","xlarge":"images\/2013\/01\/17\/business\/Goldjp\/Goldjp-articleLarge.jpg","xlargeheight":"370"},"type":"image"},{"width":75,"url":"images\/2013\/01\/17\/business\/Goldjp\/Goldjp-thumbStandard.jpg","height":75,"subtype":"thumbnail","legacy":{"thumbnailheight":"75","thumbnail":"images\/2013\/01\/17\/business\/Goldjp\/Goldjp-thumbStandard.jpg","thumbnailwidth":"75"},"type":"image"}],"headline":{"main":"IHT Quick Read: Jan. 17","kicker":"IHT Rendezvous"},"keywords":[],"pub_date":"2013-01-17T02:31:29Z","document_type":"blogpost","news_desk":null,"section_name":"World","subsection_name":null,"byline":{"person":[],"original":"By THE INTERNATIONAL HERALD TRIBUNE","organization":"THE INTERNATIONAL HERALD TRIBUNE"},"type_of_material":"Blog","_id":"50f7b1ed00315214fbb856a1","word_count":"516","slideshow_credits":null},{"web_url":"http:\/\/www.legacy.com\/Link.asp?I=LS000162419217","snippet":"GUND--George, a native of Cleveland and long-time San Francisco resident, died this morning at his home in Palm Springs with his wife Iara Lee, son George, brother Gordon and sister-in- law Lulie at his side. He was 75. Mr. Gund was a lifetime hoc...","lead_paragraph":"<!-- GEORGE  GUND -->GUND--George, a native of Cleveland and long-time San Francisco resident, died this morning at his home in Palm Springs with his wife Iara Lee, son George, brother Gordon and sister-in- law Lulie at his side. He was 75. Mr. Gund was a lifetime hockey enthusiast, film lover, cowboy, fisherman, gardener, avid art collector and philanthropist. He had an adventurous and restless spirit. He loved to travel and was rarely in one time zone or place for more than a couple of days. He made friends all over the world. Everyone loved his infectious zest for life, devilish smile, mumbling speech and his distinctive eyebrows. It was said that \"catching George was like lassoing a cloud\" or that \"he was an artist with the world as his canvas.\" He had an amazing curiosity about life, you could find him tending his fruit trees, studying calligraphy in Japan, watching a film, attending a hockey game or scouting trip, playing Santa on the ice in San Jose, sitting around a campfire listening to cowboys recite poetry, fishing with his brothers and friends, playing with his sons and grandkids or making films and traveling with his wife Iara to destinations around the world. He never sat still. He was a free spirit who was always on the move. Part of a distinguished family known for its wide ranging philanthropy, Mr. Gund was a trustee of the George Gund Foundation, a Cleveland based organization created by his father in 1952 and known for its support of innovative community and national programs. And internationally, he supported many educational, human rights and peace with justice programs in conjunction with his wife, Iara Lee. He served on many boards including the National Museum of the American Indian, George Gustav Heye Center in New York City, the Musical Arts Foundation (Cleveland Orchestra) and the Western Folklife Center in Elko, Nevada. He was also a member of the Sierra Club National Advisory Board. In addition, he served as the longtime chair of the San Francisco Film Society, presenter of the San Francisco International Film Festival, a founder of the Cleveland Cinematheque, and a board member of the Cleveland Film Festival. He was a trustee of the U.C. Berkeley Art Museum and Pacific Film Archive, a trustee of the Sundance Institute, and a member of The International Council of The Museum of Modern Art and MOMA NY's Committee on Film. Mr. Gund's love of film started in the 1970's, when he began importing and distributing Eastern European films and encouraging independent film production in the United States. Throughout his life he was a constant fixture at film festivals all over the world, seeing multiple films each day and sitting with filmmakers in the evenings to hear their stories. In 2011 the San Francisco Film Society paid tribute to Mr. Gund for his more than 40 years of unwavering support and leadership of the organization and The George Gund Award was inaugurated and will be given periodically to a member of the film community for their outstanding and unique contributions to the advancement and enhancement of the art of cinema. Mr. Gund's enthusiasm for the game of hockey spanned many decades as a National Hockey League owner. His love of hockey began on a neighborhood pond in Cleveland, was refined at eastern boarding schools and Case Western Reserve University where as a student he founded the school's first ice hockey team. He was a supporter of the U.S. Olympic Hockey Team and a sponsor and board member of the USA Hockey Foundation. He was instrumental in building an indoor rink in Sun Valley and starting senior, junior and women's ice hockey programs. In 1975 he acquired minority interests in the NHL's California Golden Seals, and when the team moved to Cleveland in 1976, his brother Gordon joined him in purchasing the team and the franchise operated for two years as the Cleveland Barons. In 1978, the Gunds merged the Barons with the Minnesota North Stars. In 1990, George recognized an opportunity to fulfill his vision to bring a team back to the Bay Area, where he had always believed an NHL team could flourish under the right circumstances. The Gunds sold their interest in the North Stars and were awarded an NHL expansion franchise, which was soon after named the San Jose Sharks and began play in the 1991-92 season. In 1996 Mr. Gund was awarded the Lester Patrick Award for his outstanding contributions and efforts on behalf of amateur and professional hockey and in 1999 received the prestigious Jofa Titan\/USA Hockey Distinguished Achievement Award. He also co-owned the NBA Cleveland Cavaliers basketball team and its parent company Nationwide Advertising Services (NAS) with his brother Gordon from 1983 until 2005. Mr. Gund was a collector of Asian zen art and Western and Northwest Coast Indian Art. He was a longtime Board member of The Western Folklife Center which is dedicated to exploring, presenting and preserving the diverse and dynamic cultural heritage of the American West. The National Cowboy Poetry Gathering is its annual showcase event bringing together cowboy poets from all over the world. Mr. Gund was the son of George and Jessica Roesler Gund. He is survived by his wife Iara Lee, son George Gund IV, his two grandchildren, his siblings Gordon, (Lulie), Graham (Ann), Geoffrey (Sarah), Agnes and Louise, his ex wife Theo Gund and several nieces and nephews. He was predeceased by his son Greg in 2005. The family requests that, in lieu of flowers, donations be made to one of the following charities: San Francisco Film Society, Western Folklife Center, Sierra Club Foundation, National Museum of the American Indian or USA Hockey Foundation. A Celebration of the Life of George Gund is schedule for January 25th at 2pm at Grace Cathedral, 1100 California Street, San Francisco.<br><br>\n ","abstract":null,"print_page":null,"blog":[],"source":"The New York Times","multimedia":[],"headline":{"main":"Paid Notice: Deaths  GUND, GEORGE "},"keywords":[],"pub_date":"2013-01-17T01:28:28Z","document_type":"article","news_desk":"Classified","section_name":"Paid Death Notices","subsection_name":null,"byline":null,"type_of_material":"Paid Death Notice","_id":"5213e53038f0d8740ac8da3f","word_count":"968","slideshow_credits":null}]},"status":"OK","copyright":"Copyright (c) 2013 The New York Times Company.  All Rights Reserved."}