{"data":{"movies":[{"title":"No Way Out","originalTitle":"","year":"1950","releaseDate":"195010","directors":[{"name":"Joseph L. Mankiewicz","id":"nm0000581"}],"writers":[{"name":"Joseph L. Mankiewicz","id":"nm0000581"},{"name":"Lesser Samuels","id":"nm0760488"}],"runtime":"106 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmQ3NjM3MjUtZDQyNS00ODBmLTg4MjYtY2NmNDFiMjhhOThhL2ltYWdlXkEyXkFqcGdeQXVyNjQzNDI3NzY@._V1.jpg","countries":["USA"],"languages":["English","American Sign Language"],"genres":["Crime","Drama","Film-Noir","Thriller"],"plot":"The Biddle brothers, shot while robbing a gas station, are taken to the prison ward of the County Hospital; Ray Biddle, a rabid racist, wants no treatment from black resident Dr. Luther Brooks. When brother John dies while Luther tries to save him, Ray is certain it's murder and becomes obsessed with vengeance. But there are black racists around too, and the situation slides rapidly toward violence.","simplePlot":"A black doctor is assigned to treat two racist White, robbery suspects who are brothers, and when one dies, it causes tension that could start a race riot.","actors":[{"actorName":"Richard Widmark","urlProfile":"http://www.imdb.com/name/nm0001847","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MjgwODQ3M15BMl5BanBnXkFtZTcwMjIxMjUyNA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 December 1914","placeOfBirth":" Sunrise Township, Minnesota, USA","birthName":"Richard Weedt Widmark","height":"5' 10\" (1.78 m)","bio":"Richard Widmark established himself as an icon of American cinema with his debut in the 1947 film noir Kiss of Death (1947) in which he won a Best Supporting Actor Academy Award nomination as the killer \"Tommy Udo\". Kiss of Death (1947) and other noir thrillers established Widmark as part of a new generation of American movie actors who became stars in the post-World War II era. With fellow post-War stars Kirk Douglas and Robert Mitchum, Widmark brought a new kind of character to the screen in his character leads and supporting parts: a hardboiled type who does not actively court the sympathy of the audience. Widmark was not afraid to play deeply troubled, deeply conflicted, or just down right deeply corrupt characters. After his debut, Widmark would work steadily until he retired at the age of 76 in 1990, primarily as a character lead. His stardom would peak around the time he played the U.S. prosecutor in Judgment at Nuremberg (1961) as the 1950s segued into the 1960s, but he would continue to act for another 30 years. Richard Weedt Widmark was born in Sunrise Township, Minnesota, to Ethel Mae (Barr) and Carl Henry Widmark. His father was of Swedish descent and his mother of English and Scottish ancestry. He has said that he loved the movies from his boyhood, claiming \"I've been a movie bug since I was 4. My grandmother used to take me\". The teen-aged Widmark continued to go to the movies, and was thrilled by Dracula (1931) and Frankenstein (1931). \"I thought Boris Karloff was great\", Widmark said. Although he loved the movies and excelled at public speaking while attending high school, Widmark attended Lake Forest College with the idea of becoming a lawyer. However, he won the lead role in a college production of, fittingly enough, the play \"Consellor-at-Law\", and the acting bug bit deep. After taking his bachelor of arts degree in 1936, he stayed on at Lake Forest as the Assistant Director of Speech and Drama. However, he soon quit the job and moved to New York to become an actor and, by 1938, he was appearing on radio in \"Aunt Jenny's Real Life Stories\". He made his Broadway debut in 1943 in the play \"Kiss and Tell\", and continued to appear on stage in roles that were light years away from the tough cookies he would play in his early movies. After World War II, he was signed by 20th Century Fox to a seven-year contract. After seeing his screen-test for the role of \"Tommy Udo\", 20th Century Fox boss Darryl F. Zanuck insisted that the slight, blonde Widmark - no one's idea of a heavy, particularly after his stage work - be cast as the psychopath in Kiss of Death (1947), which had been prepared as a Victor Mature vehicle. Even though the role was small, Widmark stole the picture. 20th Century Fox's publicity department recommended that exhibitors market the film by concentrating on thumbing the tub for their new anti-hero. \"Sell Richard Widmark\" advised the studio's publicity manual that an alert 20th Century Fox sent to theater owners. The manual told local exhibitors to engage a job-printer to have \"Wanted\" posters featuring Widmark's face to be printed and pasted up. He won a Golden Globe and an Oscar nod for the part, which lead to an early bout with typecasting at the studio. Widmark played psychotics in The Street with No Name (1948) and Road House (1948), and held his own against new Fox superstar Gregory Peck in the William A. Wellman's Western, Yellow Sky (1948), playing the villain, of course. When he finally pressured the studio to let him play other parts, his appearance as a sailor in Down to the Sea in Ships (1949) made headlines: \"Life\" magazine's March 28, 1949 issue featured a three-page spread of the movie, headlined, \"Widmark the Movie Villain Goes Straight\". He was popular, having captured the public imagination, and before the decade was out, his hand and footprints were immortalized in concrete in the court outside Grauman's Chinese Theatre in Hollywood. The great director Elia Kazan cast Widmark in his thriller Panic in the Streets (1950) not as the heavy - that role went to Jack Palance - but as the physician who tracks down Palance, who has the plague, in tandem with detective Paul Douglas. Widmark was establishing himself as a real presence in the genre that later would be hailed as \"film noir\". Having proved he could handle other roles, Widmark didn't shy away from playing heavies in quality pictures. The soon-to-be-blacklisted director Jules Dassin cast him in one of his greatest roles, as the penny-ante hustler \"Harry Fabian\" in Night and the City (1950). Set in London, Widmark's Fabian manages to survive in the jungle of the English demimonde, but is doomed. Widmark was masterful in conveying the desperation of the criminal seeking to control his own fate but who is damned, and this performance also became an icon of film noir. In that same year, he appeared in Oscar-winning writer-director Joseph L. Mankiewicz's No Way Out (1950) as a bigot who instigates a race riot. As the 1950s progressed, Widmark played in Westerns, military vehicles, and his old stand-by genre, the thriller. He appeared with Marilyn Monroe (this time cast as the psycho) in Don't Bother to Knock (1952) and made Pickup on South Street (1953) that same year for director Samuel Fuller. His seven-year contract at Fox was expiring, and Zanuck - who would not renew the deal - cast him in the Western Broken Lance (1954) in a decidedly supporting role, billed beneath not only Spencer Tracy but even Robert Wagner and Jean Peters. The film was well-respected, and it won an Oscar nomination for best screenplay for the front of Hollywood 10 blacklistee Albert Maltz. Widmark left Fox for the life of a freelance, forming his own company, \"Heath Productions\". He appeared in more Westerns, adventures and social dramas, and pushed himself as an actor by taking the thankless role of \"The Dauphin\" in Otto Preminger's adaptation of George Bernard Shaw's Saint Joan (1957), a notorious flop that didn't bring anyone any honors, neither Preminger, his leading lady Jean Seberg or Widmark. In 1960, he was appearing in another notorious production, John Wayne's ode to suicidal patriotism, The Alamo (1960), with the personally liberal Widmark playing \"Jim Bowie\" in support of the very-conservative Wayne's \"Davy Crockett\". Along with character actor Chill Wills, Widmark arguably was the best thing in the movie. In 1961, Widmark acquitted himself quite well as the prosecutor in producer-director Stanley Kramer's Judgment at Nuremberg (1961), appearing with the Oscar-nominated Spencer Tracy and the Oscar-winning Maximilian Schell, as well as with superstar Burt Lancaster and acting genius Montgomery Clift and the legendary 'Judy Garland' (the latter two winning Oscar nods for their small roles). Despite being showcased with all this thespian-firepower, Widmark's character proved to be the axis on which the drama turned. A little later, Widmark appeared in two Westerns directed by the great John Ford, with co-star James Stewart in Two Rode Together (1961) and as the top star in Ford's apologia for Indian genocide, Cheyenne Autumn (1964). On Two Rode Together (1961), Ford feuded with Jimmy Stewart over his hat. Stewart insisted on wearing the same hat he had for a decade of highly successful Westerns that had made him one of the top box office stars of the 1950s. Both he and Widmark were hard-of-hearing (as well as balding and in need of help from the makeup department's wig-makers), so Ford would sit himself far away from them while directing scenes and then give them directions in a barely audible voice. When neither one of the stars could hear their director, Ford theatrically announced to his crew, that after over 40 years in the business, he was reduced to directing two deaf toupees. It was testimony to the stature of both Stewart and Widmark as stars that this was as far as Ford's baiting went, as the great director could be extraordinarily cruel. Widmark continued to co-star in A-pictures through the 1960s. He capped off the decade with one of his finest performances, as the amoral police detective in Don Siegel's gritty cop melodrama Madigan (1968). Watching \"Madigan\", one can see Widmark's characters as a progression in the evolution of what would become the late 1960s nihilistic anti-hero, such as those embodied by Clint Eastwood in Siegel's later Dirty Harry (1971). Im the 1970s, he continued to make his mark in movies and, beginning in 1971, in television. In movies, he appeared primarily in supporting roles, albeit in highly billed fashion, in such films as Sidney Lumet's Murder on the Orient Express (1974), Robert Aldrich's La dernière lueur du crépuscule (1977), and Stanley Kramer's The Domino Killings (1977). He even came back as a heavy, playing the villainous doctor in Coma (1978). In 1971, in search of better roles, he turned to television, starring as the President of the U.S. in the TV movies Vanished (1971). His performance in the role brought Widmark an Emmy nomination. He resurrected the character of \"Madigan\" for NBC, in six 90-minute episodes that appeared as part of the rotation of \"NBC Wednesday Mystery Movie\" for the Fall 1972 season. Widmark was married for 55 years to playwright Jean Hazlewood, from 1942 until her death in 1997 (they had one child, Anne, who was born in 1945). He lived quietly and avoided the press, saying in 1971, \"I think a performer should do his work and then shut up\". \"Los Angeles Times\" critic Kevin Thomas thought that Widmark should have won an Oscar nomination for his turn in When the Legends Die (1972), playing a former rodeo star tutoring 'Frederic Forrest'. It is surprising to think that Kiss of Death (1947) represented his sole Oscar nomination, but with the rise of the respect for film noir around the time his career began tapering off in 70s, he began to be reevaluated as an actor. Unlike Bogart, who did not live to see his reputation flourish after his death, well before he retired, Widmark became a cult figure.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MjgwODQ3M15BMl5BanBnXkFtZTcwMjIxMjUyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001847","name":"Richard Widmark","nicknames":["Dick"],"idIMDB":"nm0001847"},"actorId":"nm0001847","character":"Ray Biddle","urlCharacter":"http://www.imdb.com/character/ch0397815","main":true},{"actorName":"Linda Darnell","urlProfile":"http://www.imdb.com/name/nm0001105","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA4NDA1NTA1OV5BMl5BanBnXkFtZTYwNTA5NzU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 October 1923","placeOfBirth":" Dallas, Texas, USA","birthName":"Monetta Eloyse Darnell","height":"5' 4\" (1.63 m)","bio":"Linda Darnell, one of five children of a postal clerk, grew up fast. At 11, she was modeling clothes, giving her age as 16. At 13, she was appearing on the stage with little theater groups. Her mother encouraged her to audition when Hollywood talent scouts came to Dallas. She went to California and when the studio found out how young she really was, she was sent home and told to come back when she was 15. Her fourth film, Star Dust (1940), was based on this real life experience. It was Star Dust (1940) that Darnell was watching the night of April 9, 1965, at the home of her former secretary, located in Glenview, Illinois, a suburb of Chicago. The house caught on fire in the early hours of the next morning and Darnell died that afternoon in Cook County Hospital. The character she played in one of her best known roles, Forever Amber (1947) survived the London fire, the plague and the perils of being the mistress of the English king, Charles II.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA4NDA1NTA1OV5BMl5BanBnXkFtZTYwNTA5NzU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001105","name":"Linda Darnell","nicknames":["Tweedles"],"idIMDB":"nm0001105"},"actorId":"nm0001105","character":"Edie Johnson","urlCharacter":"http://www.imdb.com/character/ch0397816","main":true},{"actorName":"Stephen McNally","urlProfile":"http://www.imdb.com/name/nm0573640","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzY4NmJkYTktOGJlNi00YmQwLWIyMjUtYzEwODljNDU2Y2Q0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1911","placeOfBirth":" New York City, New York, USA","birthName":"Horace Vincent McNally","height":"5' 11½\" (1.82 m)","bio":"\"B\" actor Stephen McNally forsook a thriving career as a practicing attorney in the late 1930s when he made the decision to switch gears and pursue acting, which he did avidly. He began his career on stage using his real name of Horace McNally and earned minor status in World War II-era films as both a minor hero and heavy. In 1946 his career took a boost when he changed his stage name to Stephen McNally and carved out a niche as both villains and \"tough guy\" heroes. He was notably despicable in the Jane Wyman starrer Johnny Belinda (1948) and in Winchester '73 (1950) with James Stewart. His heroes fell into such secondary adventures as City Across the River (1949) and Air Cadet (1951). McNally continued duking it out with the leads in other 1950s fare, often for Universal Pictures, such as No Way Out (1950), Battle Zone (1952), the somewhat bizarre Don Siegel western The Duel at Silver Creek (1952), A Bullet Is Waiting (1954), Violent Saturday (1955), Tribute to a Bad Man (1956) and Johnny Rocco (1958). In the long run he proved much more interesting when his character had little redeeming qualities. He starred in a couple of TV series following his wave of movie-making but none of them really stuck and his name never became etched into the minds of audiences.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzY4NmJkYTktOGJlNi00YmQwLWIyMjUtYzEwODljNDU2Y2Q0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0573640","name":"Stephen McNally","nicknames":["Steve"],"idIMDB":"nm0573640"},"actorId":"nm0573640","character":"Dr. Dan Wharton","urlCharacter":"http://www.imdb.com/character/ch0397817","main":true},{"actorName":"Sidney Poitier","urlProfile":"http://www.imdb.com/name/nm0001627","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0OTE3MzQ2Nl5BMl5BanBnXkFtZTcwMDc2MDc1NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1927","placeOfBirth":" Miami, Florida, USA","birthName":"Sidney L. Poitier","height":"6' 2½\" (1.89 m)","bio":"A native of Cat Island, The Bahamas (though born in Miami during a mainland visit by his parents), Poitier grew up in poverty as the son of farmers Evelyn (Outten) and Reginald James Poitier, who also drove a cab. He had little formal education and at the age of 15 was sent to Miami to live with his brother, in order to forestall a growing tendency toward delinquency. In the U.S., Poitier first experienced the racial chasm that divides the country, a great shock to a boy coming from a society with a majority of African descent. A determination to find and create opportunities for African-Americans was born in him because of the poor treatment he received on the streets of Miami. At 18, he went to New York, did menial jobs and slept in a bus terminal toilet. A brief stint in the Army as a worker at a veteran's hospital was followed by more menial jobs in Harlem. An impulsive audition at the American Negro Theatre was rejected so forcefully that Poitier dedicated the next six months to overcoming his accent and performance ineptness. On his second try, he was accepted. He was spotted in a rehearsal and given a bit part in a Broadway production of \"Lysistrata,\" for which he got excellent reviews. By the end of 1949, he was having to choose between leading roles on stage and an offer to work for Darryl F. Zanuck in the film No Way Out (1950). Poitier's performance as a doctor treating a white bigot got him plenty of notice and led to more roles, each considerably more interesting and prominent than most African American actors of the time were getting. Nevertheless, the roles were still less interesting and prominent than those white actors routinely obtained. But seven years later, after turning down several projects he considered demeaning, Poitier got a number of roles that catapulted him into a category rarely if ever achieved by an African American man of that time, that of starring leading man. One of the films, The Defiant Ones (1958), gave Poitier his first Academy Award nomination as Best Actor. Five years later, he won the Oscar for Lilies of the Field (1963), the first African American to win for a leading role. Poitier maintained activity on stage, on screen, and in the burgeoning Civil Rights movement. His roles in Guess Who's Coming to Dinner (1967) and To Sir, with Love (1967) were for their time landmarks in the breaking down of social barriers between African Americans and whites, and Poitier's talent, conscience, integrity, and inherent likability placed him on equal footing with the white stars of the day. He took on directing and producing chores in the Seventies, achieving success in both arenas. Although he has reduced the frequency of his roles in recent years, he remains one of the most respected and beloved figures in American cinema of the twentieth century.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0OTE3MzQ2Nl5BMl5BanBnXkFtZTcwMDc2MDc1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001627","name":"Sidney Poitier","idIMDB":"nm0001627"},"actorId":"nm0001627","character":"Dr. Luther Brooks","urlCharacter":"http://www.imdb.com/character/ch0397818","main":true},{"actorName":"Mildred Joanne Smith","urlProfile":"http://www.imdb.com/name/nm0809394","urlPhoto":"","biography":{"dateOfBirth":"16 May 1921","placeOfBirth":" Struthers, Ohio, USA","bio":"Mildred Joanne Smith was born on May 16, 1921 in Struthers, Ohio, USA. She was an actress, known for No Way Out (1950) and Quite Contrary (1953). She was married to David Andrew Hepburn. She died on July 19, 2015 in White Plains, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0809394","name":"Mildred Joanne Smith","idIMDB":"nm0809394"},"actorId":"nm0809394","character":"Cora Brooks","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harry Bellaver","urlProfile":"http://www.imdb.com/name/nm0068772","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzY1Nzg2NTM3M15BMl5BanBnXkFtZTgwMzY3ODc5MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1905","placeOfBirth":" Hillsboro, Illinois, USA","birthName":"Enricho Bellaver","bio":"Harry Bellaver was born on February 12, 1905 in Hillsboro, Illinois, USA as Enricho Bellaver. He is known for his work on Naked City (1958), Another World (1964) and From Here to Eternity (1953). He was married to Gertrude Dudley Vaughan Smith. He died on August 8, 1993 in Nyack, New York, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzY1Nzg2NTM3M15BMl5BanBnXkFtZTgwMzY3ODc5MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0068772","name":"Harry Bellaver","idIMDB":"nm0068772"},"actorId":"nm0068772","character":"George Biddle","urlCharacter":"http://www.imdb.com/character/ch0397820","main":true},{"actorName":"Stanley Ridges","urlProfile":"http://www.imdb.com/name/nm0725897","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjhkOTA0YzgtMDUyMC00ZTg2LTkyMjAtYWM4MWFlNmU0MGY4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 July 1890","placeOfBirth":" Southampton, Hampshire, England, UK","bio":"Born in England in 1891, Stanley Ridges would become a protégé of Beatrice Lillie, a star of musical comedies, and spent a great many years learning and honing his craft on the stage. He eventually would make his way over to America, and become a romantic leading man on Broadway. His first film appearance was in Success (1923), but his film career would not begin to take off until he was 43 in Crime Without Passion (1934) opposite Claude Rains. Stanley found himself cast in character roles, as his graying hair put his romantic leading man days at an end. Despite this he was well cast in the horror film Black Friday (1940) opposite Boris Karloff as a beloved professor who becomes the innocent victim of a shooting. To save him Karloff's character transplants part of the brain of the criminal who shot Stanley's character. Stanley goes on to steal the film, doing a Jekyll-and-Hyde act going from the beloved professor to the crass and uncouth criminal. Ridges would be cast in other memorable films, including The Sea Wolf (1941), Sergeant York (1941), To Be or Not to Be (1942) and The Suspect (1944). His last film would be The Groom Wore Spurs (1951) with Ginger Rogers, before passing away in April of that year.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjhkOTA0YzgtMDUyMC00ZTg2LTkyMjAtYWM4MWFlNmU0MGY4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0725897","name":"Stanley Ridges","idIMDB":"nm0725897"},"actorId":"nm0725897","character":"Dr. Sam Moreland","urlCharacter":"http://www.imdb.com/character/ch0397821","main":true},{"actorName":"Dots Johnson","urlProfile":"http://www.imdb.com/name/nm0424987","urlPhoto":"","biography":{"dateOfBirth":"3 February 1913","placeOfBirth":" Baltimore, Maryland, USA","birthName":"Hylan Johnson","bio":"Dots Johnson was born on February 3, 1913 in Baltimore, Maryland, USA as Hylan Johnson. He was an actor, known for Paisan (1946), No Way Out (1950) and The Joe Louis Story (1953). He died on August 22, 1986 in New York City, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0424987","name":"Dots Johnson","idIMDB":"nm0424987"},"actorId":"nm0424987","character":"Lefty Jones","urlCharacter":"http://www.imdb.com/character/ch0397822","main":true}],"seasons":[],"idIMDB":"tt0042792","urlIMDB":"http://www.imdb.com/title/tt0042792","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":"20","month":"12","year":"1949","remarks":null},"filmingDates":null,"copyrightHolder":"Twentieth Century-Fox Film Corporation, Inc. (original), U.S. Copyright LP518, 16 August 1950"},"technical":{"runtime":["1 hr 46 min (106 min)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["2,923 m (12 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.5","filmingLocations":[{"location":"USA"}],"rated":"APPROVED","awards":[{"award":"Academy Awards, USA 1951","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Writing, Story and Screenplay","names":[{"name":"Joseph L. Mankiewicz","id":"nm0000581","role":null},{"name":"Lesser Samuels","id":"nm0760488","role":null}]}]}]},{"award":"National Board of Review, USA 1950","titlesAwards":[{"titleAwardOutcome":"Won NBR Award","categories":[{"category":"Top Ten Films","names":[]}]}]},{"award":"Writers Guild of America, USA 1951","titlesAwards":[{"titleAwardOutcome":"Nominated WGA Award (Screen)","categories":[{"category":"The Robert Meltzer Award (Screenplay Dealing Most Ably with Problems of the American Scene)","names":[{"name":"Joseph L. Mankiewicz","id":"nm0000581","role":null},{"name":"Lesser Samuels","id":"nm0760488","role":null}]}]}]}],"votes":"3,046","type":"Movie","companyCreditsSimple":[{"idCompany":"co0000756","name":"Twentieth Century Fox Film Corporation"}],"keywords":{"keywords":["racism","riot","doctor","hospital","black doctor","race riot","autopsy","tumor","spinal tap","shot in the leg","facial scar","criminal","sambo","black versus white","fooling a guard","planning a murder","deaf and dumb","preventing a murder","false confession to murder","false confession","prostitute","sign language","african american slur","african american surgeon","poverty","race relations","racist prisoner","anti racism","gasoline station robbery","skirt","scarf","siren","radio","bleeding","tourniquet","flare gun","broken door","kidnapping","surprise attack","spit in the face","smoking","shot in the arm","scandal","racial violence","racial slur","punched in the face","mute villain","injured leg","husband wife relationship","hostage","handcuffs","flare","fight","false accusation","extreme pain","ex husband ex wife relationship","deputy sheriff","death of brother","deaf mute","crutch","chain","brother brother relationship","brother sister relationship","bank robber","african american","accused of murder","revenge","racial prejudice"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:21:33"}}