{"data":{"movies":[{"title":"Lone Wolf McQuade","originalTitle":"","year":"1983","releaseDate":"19830415","directors":[{"name":"Steve Carver","id":"nm0142587"}],"writers":[{"name":"B.J. Nelson","id":"nm0625160"},{"name":"H. Kaye Dyal","id":"nm0245576"}],"runtime":"107 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2NDE1NDY5OF5BMl5BanBnXkFtZTcwODI3NDk0NA@@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Action","Crime","Drama","Romance","Thriller","Western"],"plot":"The archetypical renegade Texas Ranger wages war against a drug kingpin with automatic weapons, his wits and martial arts after a gun battle leaves his partner dead. All of this inevitably culminates a martial arts showdown between the drug lord and the ranger, and involving the woman they both love.","simplePlot":"The archetypical renegade Texas Ranger wages war against a drug kingpin with automatic weapons, his wits and martial arts after a gun battle leaves his partner dead. All of this inevitably ... ","actors":[{"actorName":"Chuck Norris","urlProfile":"http://www.imdb.com/name/nm0001569","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NjY3NzgyM15BMl5BanBnXkFtZTcwODI4OTEzNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 March 1940","placeOfBirth":" Ryan, Oklahoma, USA","birthName":"Carlos Ray Norris","height":"5' 10\" (1.78 m)","bio":"Chuck Norris is familiar to fans worldwide as the star of action films such as The Hitman (1991), The Delta Force (1986) and Delta Force 2: The Colombian Connection (1990). He also starred in Missing in Action (1984) and its sequels, Firewalker (1986) and Sidekicks (1992). He was an executive producer of Walker, Texas Ranger (1993) as well as the star. Chuck Norris was born in Ryan, Oklahoma, to Wilma (Scarberry) and Ray Norris, who was a truck driver, mechanic, and bus driver. The eldest of three children, he helped his mother raise his two younger brothers in Torrance, CA, where his family moved when he was 12. Norris attended North Torrance High School from its inception in September, 1955 until his graduation in June, 1958. He is one of several storied alumni from the school. Other NHS alumni include Bob Hite (1943-1981), who was the lead singer of \"Canned Heat,\" Chris Demaria, who was a professional baseball player in the Kansas City Royals and Milwaukee Brewers organizations, Chris Mortensen, an analyst with ESPN, Hip-Hop DJ \"Key-Kool\" (Kikuo Nishi), and Wee-Man (Jason Acuna) of \"JackAss fame.\" Norris joined the Air Force after graduating from high school. During a stint in Korea, he began to study the Asian martial art of Tang Soo Do. After returning home, he worked for Northrop Aviation and moonlighted as a karate instructor. Two years later he was teaching full-time and running a number of martial-arts schools. His students included Steve McQueen, Priscilla Presley and the Osmonds. Norris's fight career lasted from 1964-1974. Norris started off by losing his first three tournaments but, by 1966, he was almost unbeatable. Among the numerous titles he won were The National Karate Championships (1966), All-Star Championships (1966), World Middleweight Karate Championship (1967), All-American Karate Championship (1967), Internationals (1968), World Professional Middleweight Karate Championship (defeating Louis Delgado on 24 November 1968), All-American Championship (1968), National Tournament of Champions (1968), American Tang Soo Championship, and the North American Karate Championship. Norris compiled a fight record of 65-5 with wins over champions Joe Lewis, Skipper Mullins, Arnold Urquidez, Ronald L. Marchini, Victor Moore, Louis Delgado, and Steve Sanders. Of the five men to beat Norris, three were Allen Steen, Joe Lewis, and Norris's last career defeat to Louis Delgado in 1968. Norris retired as undefeated Professional Full-Contact Middleweight Champion in 1974. Norris, who was urged to get into acting by his friend Steve McQueen, skillfully incorporates his martial-arts knowledge into his series and feature film projects, stressing action and technique over violence. He is the author of the books \"The Secret of Inner Strength\" and \"The Secret Power Within - Zen Solutions to Real Problems\". He works for many charities, including the Funds for Kids, Veterans Administration National Salute to Hospitalized Veterans, the United Way, Make-a-Wish Foundation and KickStart, a nonprofit organization he created to help battle drugs and violence in schools. He also starred in the television movie Blood In, Blood Out (1993), broadcast on CBS. He lives on a ranch when not filming.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NjY3NzgyM15BMl5BanBnXkFtZTcwODI4OTEzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001569","name":"Chuck Norris","nicknames":["Ground Chuck"],"idIMDB":"nm0001569"},"actorId":"nm0001569","character":"J.J. McQuade","urlCharacter":"http://www.imdb.com/character/ch0123216","main":true},{"actorName":"David Carradine","urlProfile":"http://www.imdb.com/name/nm0001016","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MDM1NjcwOV5BMl5BanBnXkFtZTYwNzUwMDIz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 December 1936","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"John Arthur Carradine","height":"6' (1.83 m)","bio":"David Carradine was born in Hollywood, California, the eldest son of legendary character actor John Carradine, and his wife, Ardanelle Abigail (McCool). He presided over an acting family that included brothers Keith Carradine and Robert Carradine as well as his daughters Calista Carradine and Kansas Carradine, and nieces Ever Carradine and Martha Plimpton. He was born in Hollywood and educated at San Francisco State College, where he studied music theory and composition. It was while writing music for the Drama Department's annual revues that he discovered his own passion for the stage, joining a Shakespearean repertory company and learning his craft on his feet. After a two-year stint in the army, he found work in New York as a commercial artist and later found fame on Broadway in \"The Deputy\" and \"The Royal Hunt of the Sun\" opposite Christopher Plummer. With that experience he returned to Hollywood, landing the lead in the short-lived TV series Shane (1966) before being tapped to star opposite Barbara Hershey in Martin Scorsese's first Hollywood film, Boxcar Bertha (1972). The iconic Kung Fu (1972) followed, catapulting Carradine to superstardom for the next three years, until he left the series to pursue his film career. That career included more than 100 feature films, a couple of dozen television movies, a whole range of theater on and off Broadway and another hit series, Kung Fu: The Legend Continues (1992). Carradine received the Best Actor Award from the National Board of Film Review as well as a Golden Globe nomination for his portrayal of Woody Guthrie in Hal Ashby's Bound for Glory (1976), and he won critical acclaim for his work as Cole Younger in The Long Riders (1980). \"Kung Fu\" also received seven Emmy nominations in its first season, including one for Carradine as Best Actor. In addition, he won the People's Prize at the Cannes Film Festival's \"Director's Fortnight\" for his work on Americana (1981), and a second Golden Globe nomination for his supporting role in North and South (1985). Among his other notable film credits were Gray Lady Down (1978), Mean Streets (1973), Bird on a Wire (1990), The Long Goodbye (1973), The Serpent's Egg (1977) and Circle of Iron (1978). He returned to the screen in what could be his greatest performance, playing the title role in Quentin Tarantino's Kill Bill: Vol. 1 (2003) and Kill Bill: Vol. 2 (2004), for which he received his fourth Golden Globe nomination. He also continued his devotion to music, and recorded some 60 tracks in various musical genres and sang in several movies. He made his home in Los Angeles with his fifth wife Annie, her four children and their two dogs. Found dead after a strangulation/masturbation session went wrong in Bangkok, Thailand, on June 3, 2009, aged 72.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MDM1NjcwOV5BMl5BanBnXkFtZTYwNzUwMDIz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001016","name":"David Carradine","nicknames":["Mr. Cool"],"idIMDB":"nm0001016"},"actorId":"nm0001016","character":"Rawley Wilkes","urlCharacter":"http://www.imdb.com/character/ch0146391","main":true},{"actorName":"Barbara Carrera","urlProfile":"http://www.imdb.com/name/nm0000324","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTk1MzUxNF5BMl5BanBnXkFtZTYwOTk1ODc0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1945","placeOfBirth":" Bluefields, Nicaragua","birthName":"Barbara Kingsbury","height":"5' 8\" (1.73 m)","bio":"Barbara Carrera was born Barbara Kingsbury on December 31, 1945 in Bluefields, Nicaragua. This stunning former model became best known for her screen performances playing a sinister femme fatale. In doing so, she has achieved minor cult status and has quite a loyal fan base. The tall and tanned Carrera first cropped up in minor roles taking advantage of her exotic features in The Master Gunfighter (1975), Embryo (1976) and The Island of Dr. Moreau (1977). She broke through with mainstream North American audiences playing Clay Basket in the miniseries Centennial (1978). She sizzled on screen with Armand Assante as the sexy villainous doctor in I, the Jury (1982), was the love interest of Texas Ranger Chuck Norris in Lone Wolf McQuade (1983) and gave her best performance to date as assassin Fatima Blush opposite Sean Connery in Never Say Never Again (1983) and then as Emma Coe in the miniseries Emma: Queen of the South Seas (1988). Carrera has most recently been seen guest starring in the popular television series That '70s Show (1998) and Judging Amy (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTk1MzUxNF5BMl5BanBnXkFtZTYwOTk1ODc0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000324","name":"Barbara Carrera","idIMDB":"nm0000324"},"actorId":"nm0000324","character":"Lola Richardson","urlCharacter":"http://www.imdb.com/character/ch0220095","main":true},{"actorName":"Leon Isaac Kennedy","urlProfile":"http://www.imdb.com/name/nm0411531","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NTg0MzYwMV5BMl5BanBnXkFtZTYwNTEyOTAz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1949","placeOfBirth":" Cleveland, Ohio, USA","height":"6' 3\" (1.91 m)","bio":"Leon Isaac Kennedy was born on January 1, 1949 in Cleveland, Ohio, USA. He is an actor and producer, known for Lone Wolf McQuade (1983), Body and Soul (1981) and Penitentiary (1979). He has been married to Lolita Armbrister since 1995. He was previously married to Jayne Kennedy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NTg0MzYwMV5BMl5BanBnXkFtZTYwNTEyOTAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0411531","name":"Leon Isaac Kennedy","nicknames":["The Lover"],"idIMDB":"nm0411531"},"actorId":"nm0411531","character":"Jackson","urlCharacter":"http://www.imdb.com/character/ch0220096","main":true},{"actorName":"Robert Beltran","urlProfile":"http://www.imdb.com/name/nm0000296","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIyODA3MjI3NF5BMl5BanBnXkFtZTgwODIyNjU2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1953","placeOfBirth":" Bakersfield, California, USA","birthName":"Robert Adame Beltran","height":"5' 10½\" (1.79 m)","bio":"Robert Adame Beltran was born in Bakersfield, California. He is the seventh of ten children, of Mexican-Native American ancestry, though Robert describes his heritage as Latindio. After finishing high school, he attended Fresno State College, where he graduated with a degree in theater arts. Beltran landed his first film role in Luis Valdez's Zoot Suit (1981) in 1981. One year later, he landed the role of Raoul in Paul Bartel's Eating Raoul (1982). Other appearances included Gaby: A True Story (1987), Nixon (1995) and another Paul Bartel film, Scenes from the Class Struggle in Beverly Hills (1989) among others. In the theater, he has appeared in productions for Luis Valdez's El Teatro Campesino, the LA Theater Center, the California Shakespeare Festival and others. Robert founded and serves as co-artistic director of the East LA Classic Theater Group, with a staff of professional actors. There, he played Hamlet and served as co-producer as well as director. Robert appeared in A Midsummer Night's Dream; King Henry IV; A Touch of the Poet; and The Price, among others. In 1995, he got the part of Commander Chakotay on Star Trek: Voyager (1995). At that time, he received a Nosotros Golden Eagle Award as best actor in a television series. Robert supports National Down Syndrome Society and lives in Los Angeles, California. In his political activity, Robert Beltran has engaged over recent years in a series of classical drama workshops mainly on Shakespeare with the LaRouche Youth Movement of the Democratic Party as well as participating in several Schiller Institute conferences speaking on the subject of classical drama, most recently on his 2003 staging of Clifford Odets' 1948 play \"The Big Knife\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIyODA3MjI3NF5BMl5BanBnXkFtZTgwODIyNjU2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000296","name":"Robert Beltran","idIMDB":"nm0000296"},"actorId":"nm0000296","character":"Kayo","urlCharacter":"http://www.imdb.com/character/ch0220097","main":true},{"actorName":"L.Q. Jones","urlProfile":"http://www.imdb.com/name/nm0428618","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MzQzNDQ3NV5BMl5BanBnXkFtZTcwNzMzNzQwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 August 1927","placeOfBirth":" Beaumont, Texas, USA","birthName":"Justice Ellis McQueen Jr.","height":"6' (1.83 m)","bio":"Tall, sandy haired, mustachioed actor from Texas born Justus McQueen, who adopted the name of the character he portrayed in his first film, Battle Cry (1955). Jones, with his craggy, gaunt looks, first appeared in minor character roles in plenty of WWII films including The Young Lions (1958), The Naked and the Dead (1958), Hell Is for Heroes (1962) and Battle of the Coral Sea (1959). However, 1962 saw him team up with maverick director Sam Peckinpah for the first of Jones' five appearances in his films. Ride the High Country (1962) saw Jones play one of the lowlife Hammond brothers. Next he appeared alongside Charlton Heston in Major Dundee (1965), then Peckinpah cast him, along with his real-life friend Strother Martin, as one of the scummy, murderous bounty hunters in The Wild Bunch (1969). Such was the chemistry between Jones and Martin that Peckinpah teamed them again the following year in The Ballad of Cable Hogue (1970), and Jones' final appearance in a Peckinpah film was in another western, Pat Garrett & Billy the Kid (1973). Two years later Jones directed the cult post-apocalyptic film A Boy and His Dog (1975) starring a young Don Johnson. He has continued to work in Hollywood, and as the lines on his craggy face have deepened, he turns up more frequently as crusty old westerners, especially in multiple TV guest spots. He turned in an interesting performance as a seemingly good ol' boy Nevada cowboy who was actually a powerful behind-the-scenes player in state politics who leaned on Robert De Niro's Las Vegas mob gambler in Martin Scorsese's violent and powerful Casino (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MzQzNDQ3NV5BMl5BanBnXkFtZTcwNzMzNzQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0428618","name":"L.Q. Jones","idIMDB":"nm0428618"},"actorId":"nm0428618","character":"Dakota","urlCharacter":"http://www.imdb.com/character/ch0220098","main":true},{"actorName":"Dana Kimmell","urlProfile":"http://www.imdb.com/name/nm0454011","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExMDg1OTU1ODBeQTJeQWpwZ15BbWU3MDExNTQ5MTQ@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1959","placeOfBirth":" Texarkana, Arkansas, USA","height":"5' 4\" (1.63 m)","bio":"Dana Kimmell was born on October 26, 1959 in Texarkana, Arkansas, USA. She is known for her work on Friday the 13th Part III (1982), Lone Wolf McQuade (1983) and Days of Our Lives (1965). She has been married to John Anderson since September 18, 1982. They have four children. She was previously married to Mark Plambeck.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExMDg1OTU1ODBeQTJeQWpwZ15BbWU3MDExNTQ5MTQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0454011","name":"Dana Kimmell","idIMDB":"nm0454011"},"actorId":"nm0454011","character":"Sally McQuade","urlCharacter":"http://www.imdb.com/character/ch0220099","main":true},{"actorName":"R.G. Armstrong","urlProfile":"http://www.imdb.com/name/nm0035866","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3MDYyMjcwNl5BMl5BanBnXkFtZTcwMDE1NTUxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 April 1917","placeOfBirth":" Birmingham, Alabama, USA","birthName":"Robert Golden Armstrong Jr.","height":"6' 3\" (1.91 m)","bio":"A golden career was reflected in his name. Robert Golden Armstrong (\"Bob\" to his friends) was born in Birmingham, Alabama on April 7, 1917. He attended the University of North Carolina at Chapel Hill. While there, he was frequently performing on stage with the Carolina Playmakers. After graduating, R.G. headed to New York, where his acting career really took off. In 1953, along with many of his Actors Studio buddies, he was part of the cast of \"End As a Man\" -- this became the first play to go from off-Broadway to Broadway. The following year, R.G. got his first taste of movies, appearing in Garden of Eden (1954). However, he returned to New York and the live stage. He received great reviews for his portrayal of Big Daddy in the Broadway production of \"Cat On a Hot Tin Roof\" in 1955. In 1958, R.G. took the plunge to Hollywood -- he appeared in two movies, a television series, and did numerous guest appearances on television series that year, usually in Westerns such as The Rifleman (1958), Have Gun - Will Travel (1957) and Zane Grey Theater (1956), among others. He would go on to appear in 80 movies and three television series in his career, and guest-starred in 90 television series, many of them Westerns, often as a tough sheriff or a rugged land baron. R.G. was a regular cast member in the television series T.H.E. Cat (1966), playing tough, one-handed Captain MacAllister. During the filming of Steel (1979) in Kentucky, watching the mammoth Kincaid Tower being built, he made some good friends in the cast: \"You become a family on the set,\" he said in an interview at the time. Even though he had a long, versatile career, the younger generation knows him as the demonic Lewis Vandredi (pronounced VON-drah-dee), who just would not let the main characters have a good night's sleep on the television series Friday's Curse (1987). Finally retiring after six successful decades in show business -- his last film appearance was Purgatory (1999) -- R.G. and his lovely wife Mary Craven were mostly just enjoying life in California, and still traveled and vacationed in Europe occasionally. His upbeat, fun-loving personality made him a delight for all who come in contact with him. R.G. Armstrong died at age 95 of natural causes in Studio City, California on July 27, 2012.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3MDYyMjcwNl5BMl5BanBnXkFtZTcwMDE1NTUxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0035866","name":"R.G. Armstrong","nicknames":["Bob"],"idIMDB":"nm0035866"},"actorId":"nm0035866","character":"T. Tyler","urlCharacter":"http://www.imdb.com/character/ch0220100","main":true},{"actorName":"Jorge Cervera Jr.","urlProfile":"http://www.imdb.com/name/nm0148940","urlPhoto":"","biography":{"bio":"Jorge Cervera Jr. is an actor and director, known for ¡Three Amigos! (1986), Real Women Have Curves (2002) and Lone Wolf McQuade (1983).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0148940","name":"Jorge Cervera Jr.","idIMDB":"nm0148940"},"actorId":"nm0148940","character":"Jefe","urlCharacter":"http://www.imdb.com/character/ch0220101","main":true},{"actorName":"Sharon Farrell","urlProfile":"http://www.imdb.com/name/nm0268331","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NTU4NTUzOF5BMl5BanBnXkFtZTcwNjUxOTM2NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 December 1940","placeOfBirth":" Sioux City, Iowa, USA","birthName":"Sharon Forsmoe","height":"5' 5\" (1.65 m)","bio":"Sharon Farrell was born on December 24, 1940 in Sioux City, Iowa, USA as Sharon Forsmoe. She is an actress, known for Can't Buy Me Love (1987), Night of the Comet (1984) and It's Alive (1974). She was previously married to Dale Trevillion, Steve Salkin, John Boyer, Ron De Biasio and Andrew Prine.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NTU4NTUzOF5BMl5BanBnXkFtZTcwNjUxOTM2NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0268331","name":"Sharon Farrell","idIMDB":"nm0268331"},"actorId":"nm0268331","character":"Molly","urlCharacter":"http://www.imdb.com/character/ch0220102","main":true},{"actorName":"Daniel Frishman","urlProfile":"http://www.imdb.com/name/nm0295878","urlPhoto":"","biography":{"dateOfBirth":"22 July 1946","placeOfBirth":" San Francisco, California, USA","birthName":"Daniel Bernard Frishman","bio":"Daniel Frishman was born on July 22, 1946 in San Francisco, California, USA as Daniel Bernard Frishman. He is an actor, known for Star Wars: Episode VI - Return of the Jedi (1983), The Ewok Adventure (1984) and Lone Wolf McQuade (1983).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0295878","name":"Daniel Frishman","idIMDB":"nm0295878"},"actorId":"nm0295878","character":"Falcon","urlCharacter":"http://www.imdb.com/character/ch0220103","main":true},{"actorName":"William Sanderson","urlProfile":"http://www.imdb.com/name/nm0761836","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NjIxMjMwN15BMl5BanBnXkFtZTcwMDk1NzgzOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 January 1944","placeOfBirth":" Memphis, Tennessee, USA","height":"5' 8\" (1.73 m)","bio":"Prolific and versatile character actor William Sanderson was born on January 10, 1944, in Memphis, Tennessee. His mother was an elementary school teacher and his father was a landscape designer. William served two years in the US Army. Following his military service he attended Southern Methodist University. He earned both a BBA degree and a JD law degree from Memphis State University. William went to New York to try his luck as an actor. He studied his craft with Herbert Berghof and William Hickey. Sanderson began his acting career in off-Broadway stage productions and appeared in several independent pictures. He gave a superbly lively and intense performance as vicious racist and escaped convict Jessie Lee Kane in the brutal exploitation feature Fight for Your Life (1977). William was likewise marvelous as gentle toymaker J.F. Sebastian in the fantastic science-fiction cult favorite Blade Runner (1982). He has played his fair share of loathsome bad guys (he refers to these particular characters as \"prairie scum\"), such as nasty lout Calvin in Raggedy Man (1981), lowlife hick Lee Dollarhide in Coal Miner's Daughter (1980) and weaselly criminal Snow in Lone Wolf McQuade (1983). Not surprisingly, considering his distinctive Southern drawl, he has also appeared in such westerns as the comedy Wagons East (1994), Crossfire Trail (2001), Monte Walsh (2003), Andersonville (1996), Gods and Generals (2003) and the acclaimed TV mini-series Lonesome Dove (1989) (one of several projects in which Sanderson has acted alongside Tommy Lee Jones). Sanderson gave a lovely and touching portrayal in a rare lead role as emotionally dysfunctional recovering alcoholic ukulele minstrel Stanley Myer in the poignant indie drama Stanley's Gig (2000). He achieved his greatest popularity, however, as flaky backwoodsman Larry on the hit sitcom Newhart (1982) on which he uttered the memorable catchphrase, \"I'm Larry. This is my brother Darryl and this is my other brother Darryl.\" More recently Sanderson had a terrific role as conniving hotel proprietor E.B. Farnum on the sensationally gritty cable western TV series Deadwood (2004). Among the TV shows William has done guest spots on are The Practice (1997), The Pretender (1996), ER (1994), The X-Files (1993), Walker, Texas Ranger (1993), Les anges de la ville (1993), Matlock (1986), Babylon 5 (1994), Married with Children (1987), The Twilight Zone (1985), Knight Rider (1982), Coach (1989), The Dukes of Hazzard (1979) and Starsky and Hutch (1975). He has also done voices for numerous cartoon characters, radio commercials and books on tape. Outside of his substantial film and TV credits, William has acted on stage in productions of such plays as \"The Taming of the Shrew,\" \"When Ya Comin' Back, Red Ryder?,\" \"Insect Comedy,\" \"To Kill a Mockingbird,\" \"Dutchman,\" \"Fishing,\" \"Authentic Life of Billy the Kid,\" \"Tobacco Road,\" and \"Scotch Rocks.\" William Sanderson lives in Burbank, California, with his wife Sharon Wix.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NjIxMjMwN15BMl5BanBnXkFtZTcwMDk1NzgzOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0761836","name":"William Sanderson","nicknames":["Bill"],"idIMDB":"nm0761836"},"actorId":"nm0761836","character":"Snow","urlCharacter":"http://www.imdb.com/character/ch0220104","main":true},{"actorName":"John Anderson","urlProfile":"http://www.imdb.com/name/nm1365829","urlPhoto":"","biography":{"bio":"John Anderson is an actor, known for Lone Wolf McQuade (1983), The Spreading Ground (2000) and In the Company of Spies (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1365829","name":"John Anderson","idIMDB":"nm1365829"},"actorId":"nm1365829","character":"Burnside","urlCharacter":"http://www.imdb.com/character/ch0220105","main":true},{"actorName":"Robert Arenas","urlProfile":"http://www.imdb.com/name/nm0034300","urlPhoto":"","biography":{"bio":"Robert Arenas is an actor, known for Lone Wolf McQuade (1983).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0034300","name":"Robert Arenas","idIMDB":"nm0034300"},"actorId":"nm0034300","character":"Gas Station Attendant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tommy Ballard","urlProfile":"http://www.imdb.com/name/nm0050679","urlPhoto":"","biography":{"bio":"Tommy Ballard is an actor, known for Lone Wolf McQuade (1983).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0050679","name":"Tommy Ballard","idIMDB":"nm0050679"},"actorId":"nm0050679","character":"Colonel","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0085862","urlIMDB":"http://www.imdb.com/title/tt0085862","business":{"budget":{"money":"$5,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$4,295,300","country":"USA","day":"17","month":"04","year":"1983","remarks":""}],"gross":[{"money":"$12,232,628","country":"USA","day":"08","month":"05","year":"1983","remarks":""},{"money":"$11,077,091","country":"USA","day":"01","month":"05","year":"1983","remarks":""},{"money":"$8,700,990","country":"USA","day":"24","month":"04","year":"1983","remarks":""},{"money":"$4,295,300","country":"USA","day":"17","month":"04","year":"1983","remarks":""},{"money":"SEK","country":"3,512,495","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":[{"money":"$691,521","country":"USA","day":"08","month":"05","year":"1983","remarks":"884 Screens"},{"money":"$1,542,618","country":"USA","day":"01","month":"05","year":"1983","remarks":"884 Screens"},{"money":"$2,919,711","country":"USA","day":"24","month":"04","year":"1983","remarks":""},{"money":"$4,295,300","country":"USA","day":"17","month":"04","year":"1983","remarks":""}],"admissions":[{"money":"1,083,382","country":"West","day":null,"month":null,"year":null,"remarks":null}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"23","month":"06","year":"1982","remarks":null},null],"copyrightHolder":"© MCMLXXXIII Orion Pictures Corporation"},"technical":{"runtime":["1 hr 47 min (107 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Lenses and Panaflex Cameras by Panavision"],"laboratory":["Consolidated Film Industries (CFI), Hollywood (CA), USA (processing)","DeLuxe, Hollywood (CA), USA (prints)"],"filmLength":["2,815 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm (Eastman 5384)"]},"rating":"6.3","filmingLocations":[{"location":"El Paso, Texas, USA"}],"rated":"PG","awards":[],"votes":"8,385","type":"Movie","companyCreditsSimple":[{"idCompany":"co0010403","name":"1818"},{"idCompany":"co0062794","name":"Lone Wolf McQuade Associates"},{"idCompany":"co0070015","name":"Topkick Productions"}],"keywords":{"keywords":["texas","texas ranger","drugs","weapon","martial arts","fbi agent","fbi","gun battle","showdown","wolf","gun","tae kwon do","judo","final showdown","police shootout","midget","wheelchair","pipe smoking","cigarette smoking","punched in the face","mother daughter relationship","hostage","kidnapping","factory","held at gunpoint","father daughter relationship","rescue","exploding body","interrogation","police brutality","u.s. mexico border","interracial relationship","love triangle","horse track","revenge","kickboxing","exploding building","exploding truck","exploding car","police station","police captain","atf agent","revolver","shotgun","buried alive","foot chase","pistol","machine gun","rifle","desert","hand to hand combat","attempted rape","death of boyfriend","martial artist","hand grenade","disobeying orders","turbo charged","tough girl","tough guy","tough cop","shot to death","dark hero","pump action shotgun","roundhouse kick","chase","ambush","hitman","beer drinking","alcoholic","six shooter","disarming someone","bar brawl","captive","dark comedy","modern western","cowboy","cowboy boots","cowboy hat","cowboy shirt","death of girlfriend","action hero","hero","kicked in the face","buddy cop","gunslinger","blood spatter","blood","shot in the chest","shot in the head","shot in the back","gun fu","massacre","uzi","sawed off shotgun","bar fight","shot with an arrow","ex marine","two man army","horse","rodeo","beer","one man army","trailer","mexican","horse thief","car chase","mexico","bulldozer","explosion","sniper rifle","machete","airplane","cigar smoking","fistfight","brawl","silencer","bazooka","tank","shootout","baseball bat","kung fu","karate","man kills woman","man hits woman","beating","torture","violence","cult film","animal in title","switchblade","arms smuggling","police","helicopter","hijacking","crossbow","death of friend","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 05:52:17"}}