{"data":{"movies":[{"title":"The Importance of Being Earnest","originalTitle":"","year":"1952","releaseDate":"19521231","directors":[{"name":"Anthony Asquith","id":"nm0002190"}],"writers":[],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQyMTUxMzA2OV5BMl5BanBnXkFtZTcwNTk2OTAyMQ@@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Comedy","Drama"],"plot":"Jack Worthing and Algernon Moncrieff are two men that are both pretending to be someone they are not.","simplePlot":"When Algernon discovers that his friend, Ernest, has created a fictional brother for whenever he needs a reason to escape dull country life, Algernon poses as the brother, resulting in ever increasing confusion.","actors":[{"actorName":"Michael Redgrave","urlProfile":"http://www.imdb.com/name/nm0714878","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI0OTM1MTA3MF5BMl5BanBnXkFtZTcwNzEyNTUyOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 March 1908","placeOfBirth":" Bristol, England, UK","birthName":"Michael Scudamore Redgrave","height":"6' 3\" (1.91 m)","bio":"Sir Michael Redgrave was of the generation of English actors that gave the world the legendary John Gielgud, Ralph Richardson and Laurence Olivier, Britain three fabled \"Theatrical Knights\" back in the days when a knighthood for thespian was far more rare than it is today. A superb actor, Redgrave himself was a charter member of the post-Great War English acting pantheon and was the sire of an acting dynasty. He and his wife, Rachel Kempson, were the parents of Vanessa Redgrave, Corin Redgrave and Lynn Redgrave and the grandparents of Natasha Richardson, Joely Richardson and Jemma Redgrave.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI0OTM1MTA3MF5BMl5BanBnXkFtZTcwNzEyNTUyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0714878","name":"Michael Redgrave","nicknames":["Red Redgrave"],"idIMDB":"nm0714878"},"actorId":"nm0714878","character":"Ernest Worthing","urlCharacter":"http://www.imdb.com/character/ch0017917","main":true},{"actorName":"Richard Wattis","urlProfile":"http://www.imdb.com/name/nm0915077","urlPhoto":"","biography":{"dateOfBirth":"25 February 1912","placeOfBirth":" Wednesbury, Staffordshire, England, UK","birthName":"Richard Cameron Wattis","height":"5' 10\" (1.78 m)","bio":"A balding, bespectacled, bird-like British comic actor, Richard Wattis was an invaluable asset to any UK comedy film or TV programme for nearly thirty years. Much associated with the Eric Sykes TV series for the latter part of his career. He was often seen in officious roles, such as snooty shop managers, secretaries and policemen. He was working right up to his sudden death from a heart attack in 1975.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0915077","name":"Richard Wattis","idIMDB":"nm0915077"},"actorId":"nm0915077","character":"Seton","urlCharacter":"http://www.imdb.com/character/ch0057526","main":true},{"actorName":"Michael Denison","urlProfile":"http://www.imdb.com/name/nm0219221","urlPhoto":"","biography":{"dateOfBirth":"1 November 1915","placeOfBirth":" Doncaster, Yorkshire, England, UK","birthName":"John Michael Terence Wellesley Denison","bio":"One of the finest exponents of the art of light comedy acting, Michael Denison enjoyed a highly successful career both on stage and screen. He and his wife, actress Dulcie Gray, appeared in over 100 West End shows and their marriage, which lasted nearly sixty years, was regarded as one of the happiest in British show business. Denison was born in Doncaster, the son of a paint manufacturer, and was brought up by aunt and her husband. He was educated at Harrow and Magdalen College, where he read modern languages. He trained for the stage at Webber Douglas School in London where he met and married Dulcie Gray in 1939. During World War Two, he served in the Royal Intelligence Corps and, by the time he had returned to the theatre, his wife was already a major film star in Britain. She secured him a role in the 1947 film My Brother Jonathan (1948). The following year, they appeared together in La montagne de verre (1949), which became an international hit. Throughout the 1950s and 1960s, the couple were rarely off the West End stage where they attracted a loyal following. Denison appeared solo with great success in the TV series Boyd Q.C. (1956) (1956-63). He appeared on Broadway in Oscar Wilde's, \"An Ideal Husband\", and, shortly before he died, he and his wife appeared in a two-hander production \"Curtain Up\" in a London fringe theatre. Denison published two volumes of memoirs, \"Overture and Beginners\" (1973) and \"Double Act\" (1985). He also contributed many entries to the Dictionary of National Biography. He and Dulcie Gray were appointed CBE in 1983.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0219221","name":"Michael Denison","idIMDB":"nm0219221"},"actorId":"nm0219221","character":"Algernon Moncrieff","urlCharacter":"http://www.imdb.com/character/ch0017919","main":true},{"actorName":"Walter Hudd","urlProfile":"http://www.imdb.com/name/nm0399648","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGE3MGI2YTQtNDA5My00NTg3LThjMmMtNzFiZDQxZTkzZGYzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1897","placeOfBirth":" London, England, UK","birthName":"Frederick Walter Hudd","bio":"Walter Hudd was born on February 20, 1897 in London, England as Frederick Walter Hudd. He was an actor and writer, known for The Importance of Being Earnest (1952), 'I Know Where I'm Going!' (1945) and Elephant Boy (1937). He died on January 20, 1963 in London.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGE3MGI2YTQtNDA5My00NTg3LThjMmMtNzFiZDQxZTkzZGYzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0399648","name":"Walter Hudd","idIMDB":"nm0399648"},"actorId":"nm0399648","character":"Lane","urlCharacter":"http://www.imdb.com/character/ch0093067","main":true},{"actorName":"Edith Evans","urlProfile":"http://www.imdb.com/name/nm0262725","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMzE5NTMzM15BMl5BanBnXkFtZTcwMzc3MTUzOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1888","placeOfBirth":" Pimlico, London, England, UK","birthName":"Edith Mary Evans","height":"5' 7\" (1.7 m)","bio":"Edith Evans was the greatest actress on the English stage in the 20th century, treading the boards for over half-a-century. She made her professional stage debut in 1912 and excelled in both classic and modern roles in the West End of London and on Broadway, as well as the Shakespeare Memorial Theatre at Stratford-upon-Avon and the Old Vic. She was made a Dame Commander of the Most Excellent Order of the British Empire (the equivalent of a knighthood) in 1946. Laurence Olivier has written in his memoirs that Evans's power on stage began to falter in the early 1960s, as her memory dimmed with age. It was about this time that she made a transition to the screen, after generally ignoring the medium for the first two decades of talking films. (After making her movie debut in 1915, Evans appeared in no films at all between 1916 and 1949, when she came back to the screen in support of a young Richard Burton in Emlyn Williams's Women of Dolwyn (1949).) In the 1950s, she had made memorable appearances in film in The Queen of Spades (1949), The Importance of Being Earnest (1952), Fred Zinnemann's The Nun's Story (1959) (1959), and in Tony Richardson's film version of John Osborne's Look Back in Anger (1959), but it was her performance as Miss Western in Richardson's Oscar-winning Best Picture Tom Jones (1963) that established her as a major film presence. She won her first Oscar nomination for \"Tom Jones\", and her second the following year for The Chalk Garden (1964). She won a Golden Globe and the New York Film Critics Circle Award as Best Actress for her performance as the frightened old lady in Bryan Forbes's The Whisperers (1967). The role also brought her a 1967 Oscar nomination for Best Actress, though she lost the trophy to Katharine Hepburn, who had recently lost her long-time lover Spencer Tracy and rode a wave of Hollywood sentiment to victory. Dame Edith Evans continued to act in films until her death, though the material generally was beneath her great talent. She died on October 14, 1976, at the age of 88.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMzE5NTMzM15BMl5BanBnXkFtZTcwMzc3MTUzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0262725","name":"Edith Evans","idIMDB":"nm0262725"},"actorId":"nm0262725","character":"Lady Bracknell","urlCharacter":"http://www.imdb.com/character/ch0017914","main":true},{"actorName":"Joan Greenwood","urlProfile":"http://www.imdb.com/name/nm0339343","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MTE0OTQ1Nl5BMl5BanBnXkFtZTcwNjQ5NDAxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1921","placeOfBirth":" Chelsea, London, England, UK","birthName":"Joan Mary W. Greenwood","height":"5' 0½\" (1.54 m)","bio":"Joan Greenwood, of the plummy feline voice, was born in the well-to-do London section of Chelsea, the daughter of renowned portrait painter Sydney Earnshaw Greenwood (1887-1949). Dancing from the age of eight, she took ballet lessons and later enrolled at the Royal Academy of Dramatic Art (RADA). Graduating at age 18, Joan made her theatrical debut in Molière's \"Malade Imaginaire\" at the Apollo Theatre. Performing some time later in Clare Boothe Luce's \"The Women\", she was noticed by Leslie Howard, who cast the diminutive lass as his leading lady in his wartime flag waver The Gentle Sex (1943). From this time onward, Joan began to alternate between stage and screen, comedy and drama. She worked during the London Blitz and toured with the Entertainment National Service Association (ENSA). The theatre saw her in classical plays with the Donald Wolfit Company, ranging from George Bernard Shaw's \"Heartbreak House\" to William Shakespeare's \"Hamlet\" (as Ophelia), and Henrik Ibsen's \"Hedda Gabler\". On screen she gave a strong, sensitive performance in Eric Ambler's psychological thriller The October Man (1947). She was also effectively cast opposite Stewart Granger as the fragile, conflicted Sophie Dorothea, imprisoned in a loveless marriage, in Basil Dearden's period romance Saraband (1948). Above all, she is fondly remembered for a trio of classic Ealing comedies, conveying a measure of eroticism while remaining quintessentially \"correct\" and \"properly British\". She purred her way through Kind Hearts and Coronets (1949) (as the beguiling, but manipulative Sibella) and as Scottish Peggy Macroon she taunted straight-laced Basil Radford in Whisky Galore (1949). She was Lady Caroline Lamb in The Bad Lord Byron (1949) and she dutifully undermined idealistic, naive inventor Sidney Stratton (Alec Guinness) in The Man in the White Suit (1951). In between her two other major screen roles--Gwendolen Fairfax in The Importance of Being Earnest (1952) and lascivious Lady Bellaston in Tom Jones (1963)--Joan had a brief spell in Hollywood, paired again with Stewart Granger for Fritz Lang's gothic period melodrama Moonfleet (1955). She did not enjoy the experience. Eschewing the trimmings of Hollywood stardom, she opted instead for the uncomplicated life at Ealing, where actors \"washed their hair in buckets\" and lived on \"toasted sandwiches, chocolates and soup\". Joan Greenwood died of a heart attack on February 28, 1987, less than a week before her 66th birthday.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MTE0OTQ1Nl5BMl5BanBnXkFtZTcwNjQ5NDAxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0339343","name":"Joan Greenwood","idIMDB":"nm0339343"},"actorId":"nm0339343","character":"Gwendolen Fairfax","urlCharacter":"http://www.imdb.com/character/ch0017912","main":true},{"actorName":"Dorothy Tutin","urlProfile":"http://www.imdb.com/name/nm0878302","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwMTcxNDMwNl5BMl5BanBnXkFtZTgwODEyNzI0MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1930","placeOfBirth":" London, England, UK","height":"5' 4½\" (1.64 m)","bio":"Dame Dorothy Tutin's esteemed company of peers included other remarkable dames, including Judi Dench and Maggie Smith. Unlike these others, Dorothy had limited screen time over the years and would develop the respect but not the stardom afforded the other two outside the realm of the theatre. Dorothy was born in London on April 8, 1930, the daughter of John and Adie Evelyne (Fryers) Tutin. Educated at St. Catherine's, she studied for the stage at PARADA and RADA, making her debut performance as \"Princess Margaret\" in \"The Thistle and the Rose\" on September 6, 1949. In the early 1950s, she joined both the Bristol and London Old Vic companies where she rose in stature with secondary roles in \"As You Like It\", \"The Merry Wives of Windsor\", \"Henry V\" and \"Much Ado About Nothing\". She later demonstrated her versatility outside the classics when she originated the role of \"Sally Bowles\" in \"I Am a Camera\" in 1954 and later played \"Jean Rice\" in \"The Entertainer\" in 1957. Great promise was held for Dorothy after an auspicious film debut as \"Cecily Cardew\" in the classic Oscar Wilde play The Importance of Being Earnest (1952). Despite sterling film portrayals of \"Polly Peachum\" opposite Laurence Olivier's \"Macheath\" in The Beggar's Opera (1953) and \"Lucie Manette\" in a remake of A Tale of Two Cities (1958) with Dirk Bogarde, Dorothy abruptly left the cinema to return to the comforts of a live stage. She continued to play all the illustrious Shakespearean femmes (Juliet, Desdemona, Rosalind, Ophelia, Portia, Cressida) during her excursions with the Shakespeare Memorial Theatre and Royal Shakespeare companies, and won the coveted Evening Standard award for her \"Viola\" in \"Twelfth Night\" in 1960. During this time, she returned to the role of \"Polly Peachum\", this time on stage, in 1963, and won acclaim for her \"Queen Victoria\" in \"Portrait of a Queen\" in 1965. She took the role to Broadway in 1968 and won a Tony nomination. In the 1970s, she appeared in everything from Harold Pinter plays to \"Peter Pan\". Though her film and TV output was limited, the performances Dorothy gave during these sporadic occasions were nothing less than astonishing. Included among these triumphs has to be her \"Anne Boleyn\" opposite Keith Michell as one of The Six Wives of Henry VIII (1970), and \"Goneril\" in Laurence Olivier's heralded adaptation of King Lear (1983). In a rare and rather bizarre moment on film, she top-lined one of Ken Russell's quirky biopics of the 1970s, the flop-turned-cult classic Savage Messiah (1972), in which she played a Polish noblewoman married to the much younger sculptor, \"Henri Gaudier-Brzeska\". In later years, Dorothy enhanced several costumed TV movies with an always fascinating grande dame eloquence. An intriguing \"Desiree Armfeldt\" in \"A Little Night Music\" in 1989 and both an Evening Standard and Laurence Olivier Award winner for her superlative work in \"A Month in the Country\", Dorothy took her final curtain in a revival of \"The Gin Game\" opposite Joss Ackland in 1999. Honored with the title \"Commander of the British Empire\" in 1967, she was made a \"Dame\" for her services to the theatre in the 2000 New Year Honors. Diagnosed with leukemia, Dame Dorothy died on August 6, 2001, at the Edward VII Hospital in London. She was survived by her actor husband (since 1963) Derek Waring and their two children, Amanda Waring and Nick Waring, both of whom are actors. Daughter Amanda, in fact, occasionally appeared as younger versions of her mother on TV during the 1990s and went on to gain a bit of fame for herself as a musical \"Gigi\". Her husband died in 2007.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwMTcxNDMwNl5BMl5BanBnXkFtZTgwODEyNzI0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0878302","name":"Dorothy Tutin","idIMDB":"nm0878302"},"actorId":"nm0878302","character":"Cecily Cardew","urlCharacter":"http://www.imdb.com/character/ch0017908","main":true},{"actorName":"Margaret Rutherford","urlProfile":"http://www.imdb.com/name/nm0751983","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWUwMWY4ZmQtMzVlZi00ODAwLWExYzItMmU3MDFiNzAxYTMyL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 May 1892","placeOfBirth":" Balham, London, England, UK","birthName":"Margaret Taylor Rutherford","height":"5' 5\" (1.65 m)","bio":"One is always at pains to locate a reference to Margaret Rutherford which does not characterize her as either jut-chinned, eccentric or both. But such, taken together, made for the charm of the woman. The combination of those most mundane of attributes has led some to suggest that she was made for the role of Agatha Christie's indomitable sleuth, Jane Marple, whom Rutherford portrayed in four films between 1961 and 1964 plus in an uncredited film cameo in The Alphabet Murders (1965). Rutherford began her acting career first as a student at London's Old Vic, debuting on stage in 1925. In 1933, she first appeared in the West End at the not-so-tender age of 41. She had her screen debut in 1936 portraying Miss Butterby in the Twickenham-Wardour production of Hideout in the Alps (1936). In summer 1941, Noël Coward's Blithe Spirit opened on the London stage, with Coward himself directing. Appearing as Madame Arcati, the genuine psychic, was Rutherford, in a role in which Coward had earlier envisaged her and which he then especially shaped for her. She would carry her portrayal of Madame Arcati to the screen adaptation, David Lean's Blithe Spirit (1945). Not only would this become one of Rutherford's most memorable screen performances - with her bicycling about the Kentish countryside, cape fluttering behind her - but it would establish the model for portraying that pseudo-soothsayer forever thereafter. Despite Rutherford's appearances in more than 40 films, it is as Madame Arcati and Miss Jane Marple that she will best be remembered.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWUwMWY4ZmQtMzVlZi00ODAwLWExYzItMmU3MDFiNzAxYTMyL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0751983","name":"Margaret Rutherford","idIMDB":"nm0751983"},"actorId":"nm0751983","character":"Miss Prism","urlCharacter":"http://www.imdb.com/character/ch0017913","main":true},{"actorName":"Miles Malleson","urlProfile":"http://www.imdb.com/name/nm0539942","urlPhoto":"","biography":{"dateOfBirth":"25 May 1888","placeOfBirth":" Croydon, Surrey, England, UK","birthName":"William Miles Malleson","bio":"Actor, playwright and screenwriter Miles Malleson's list of credits reads like a history of British cinema in the first half of the 20th century. Born in Croydon in Surrey, he attended Brighton College in Sussex before studying at Cambridge University with the intention of becoming a schoolmaster. However, he opted instead for the stage and went into repertory theatre in Liverpool and then onto the Royal Academy of Dramatic Art (RADA) in London. He wrote his first play in 1913 and, in contrast to the characters he often portrayed on screen, held socially progressive views which were often reflected in his work. His output included two plays about the First World War, \"D Company\" and \"Black Eill\", and one about the Tolpuddle Martyrs. He also worked as a screenwriter on two documentaries for Paul Rotha, Land of Promise (1946) and \"World of Plenty\". His most prolific period as a screenwriter was in the 1930s and 1940s, initially on historical subjects like Nell Gwyn (1934), Rhodes (1936), and Victoria the Great (1937). In many of these films he also began appearing in supporting roles, and from the mid-'30s onwards he found himself in increasing demand as an actor as well as a writer. Over the next 30 years he appeared in nearly 100 films, featuring in everything from Alfred Hitchcock thrillers and Ealing comedies to Hammer horrors. Usually cast as a befuddled judge or a doddering old doctor, academic or other local eccentric, he first caught audiences' imagination as the hearse driver in the Ealing chiller compendium Dead of Night (1945), after which he began to get bigger and better parts. He was particularly memorable as the philosophical hangman in Kind Hearts and Coronets (1949), Canon Chasuble in The Importance of Being Earnest (1952), Dr. McAdam in Folly to Be Wise (1952), the barrister Grimes in Brothers in Law (1957) and as Windrush Sr. in Private's Progress (1956) and I'm All Right Jack (1959). Towards the end of his career he continued to appear in cameo roles in comedy films, and made several appearances in Hammer horror films including Horror of Dracula (1958) and The Hound of the Baskervilles (1959), before failing eyesight forced him into retirement in his late 70s.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0539942","name":"Miles Malleson","idIMDB":"nm0539942"},"actorId":"nm0539942","character":"Canon Chasuble","urlCharacter":"http://www.imdb.com/character/ch0045276","main":true},{"actorName":"Aubrey Mather","urlProfile":"http://www.imdb.com/name/nm0558434","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGJmZmMxMDUtMjc3NS00Njc4LTg0NWItMTg5ODE2MWY5NGYwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 December 1885","placeOfBirth":" Minchinhampton, Gloucestershire, England, UK","bio":"Aubrey Mather was born on December 17, 1885 in Minchinhampton, Gloucestershire, England. He was an actor, known for The House of Fear (1945), Ball of Fire (1941) and The Song of Bernadette (1943). He died on January 16, 1958 in London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGJmZmMxMDUtMjc3NS00Njc4LTg0NWItMTg5ODE2MWY5NGYwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0558434","name":"Aubrey Mather","idIMDB":"nm0558434"},"actorId":"nm0558434","character":"Merriman","urlCharacter":"http://www.imdb.com/character/ch0017918","main":true}],"seasons":[],"idIMDB":"tt0044744","urlIMDB":"http://www.imdb.com/title/tt0044744","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"COPYRIGHT MCMLII BY BRITISH FILM MAKERS LIMITED (on print)"},"technical":{"runtime":["1 hr 35 min (95 min)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Color (Colour by) (Technicolor)"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":["Technicolor (colour by)"],"filmLength":["2,617.95 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.7","filmingLocations":[{"location":"Pinewood Studios, Iver Heath, Buckinghamshire, England, UK"}],"rated":"NOT RATED","awards":[{"award":"BAFTA Awards 1953","titlesAwards":[{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Most Promising Newcomer to Film","names":[{"name":"Dorothy Tutin","id":"nm0878302","role":null}]}]}]},{"award":"Venice Film Festival 1952","titlesAwards":[{"titleAwardOutcome":"Won International Award","categories":[{"category":"Best Production Design","names":[{"name":"Carmen Dillon","id":"nm0226973","role":null}]}]},{"titleAwardOutcome":"Nominated Golden Lion","categories":[{"category":"","names":[{"name":"Anthony Asquith","id":"nm0002190","role":null}]}]}]}],"votes":"4,288","type":"Movie","companyCreditsSimple":[{"idCompany":"co0546727","name":"J. Arthur Rank Organisation"},{"idCompany":"co0103191","name":"British Film-Makers"},{"idCompany":"co0103187","name":"Javelin Films"}],"keywords":{"keywords":["handbag","mistaken identity","marriage","love","love triangle","etiquette","cerebral","19th century","based on play"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:11:06"}}