{"data":{"movies":[{"title":"An Eye for an Eye","originalTitle":"","year":"1981","releaseDate":"19810814","directors":[{"name":"Steve Carver","id":"nm0142587"}],"writers":[{"name":"James Bruner","id":"nm0116145"},{"name":"James Bruner","id":"nm0116145"}],"runtime":"106 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjMzMTliZDYtNzNiZC00MWQ1LTgyYTMtMGQ2ZDIzOThjMTRmL2ltYWdlXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Crime","Thriller"],"plot":"Sean Kane is forced to resign from the San Francisco Police Department's Narcotics Division when he goes berserk after his partner is murdered. He decides to fight alone and follows a trail of drug traffickers into unexpected high places.","simplePlot":"Sean Kane is forced to resign from the San Francisco Police Department's Narcotics Division when he goes berserk after his partner is murdered. He decides to fight alone and follows a trail... ","actors":[{"actorName":"Chuck Norris","urlProfile":"http://www.imdb.com/name/nm0001569","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NjY3NzgyM15BMl5BanBnXkFtZTcwODI4OTEzNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 March 1940","placeOfBirth":" Ryan, Oklahoma, USA","birthName":"Carlos Ray Norris","height":"5' 10\" (1.78 m)","bio":"Chuck Norris is familiar to fans worldwide as the star of action films such as The Hitman (1991), The Delta Force (1986) and Delta Force 2: The Colombian Connection (1990). He also starred in Missing in Action (1984) and its sequels, Firewalker (1986) and Sidekicks (1992). He was an executive producer of Walker, Texas Ranger (1993) as well as the star. Chuck Norris was born in Ryan, Oklahoma, to Wilma (Scarberry) and Ray Norris, who was a truck driver, mechanic, and bus driver. The eldest of three children, he helped his mother raise his two younger brothers in Torrance, CA, where his family moved when he was 12. Norris attended North Torrance High School from its inception in September, 1955 until his graduation in June, 1958. He is one of several storied alumni from the school. Other NHS alumni include Bob Hite (1943-1981), who was the lead singer of \"Canned Heat,\" Chris Demaria, who was a professional baseball player in the Kansas City Royals and Milwaukee Brewers organizations, Chris Mortensen, an analyst with ESPN, Hip-Hop DJ \"Key-Kool\" (Kikuo Nishi), and Wee-Man (Jason Acuna) of \"JackAss fame.\" Norris joined the Air Force after graduating from high school. During a stint in Korea, he began to study the Asian martial art of Tang Soo Do. After returning home, he worked for Northrop Aviation and moonlighted as a karate instructor. Two years later he was teaching full-time and running a number of martial-arts schools. His students included Steve McQueen, Priscilla Presley and the Osmonds. Norris's fight career lasted from 1964-1974. Norris started off by losing his first three tournaments but, by 1966, he was almost unbeatable. Among the numerous titles he won were The National Karate Championships (1966), All-Star Championships (1966), World Middleweight Karate Championship (1967), All-American Karate Championship (1967), Internationals (1968), World Professional Middleweight Karate Championship (defeating Louis Delgado on 24 November 1968), All-American Championship (1968), National Tournament of Champions (1968), American Tang Soo Championship, and the North American Karate Championship. Norris compiled a fight record of 65-5 with wins over champions Joe Lewis, Skipper Mullins, Arnold Urquidez, Ronald L. Marchini, Victor Moore, Louis Delgado, and Steve Sanders. Of the five men to beat Norris, three were Allen Steen, Joe Lewis, and Norris's last career defeat to Louis Delgado in 1968. Norris retired as undefeated Professional Full-Contact Middleweight Champion in 1974. Norris, who was urged to get into acting by his friend Steve McQueen, skillfully incorporates his martial-arts knowledge into his series and feature film projects, stressing action and technique over violence. He is the author of the books \"The Secret of Inner Strength\" and \"The Secret Power Within - Zen Solutions to Real Problems\". He works for many charities, including the Funds for Kids, Veterans Administration National Salute to Hospitalized Veterans, the United Way, Make-a-Wish Foundation and KickStart, a nonprofit organization he created to help battle drugs and violence in schools. He also starred in the television movie Blood In, Blood Out (1993), broadcast on CBS. He lives on a ranch when not filming.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NjY3NzgyM15BMl5BanBnXkFtZTcwODI4OTEzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001569","name":"Chuck Norris","nicknames":["Ground Chuck"],"idIMDB":"nm0001569"},"actorId":"nm0001569","character":"Sean Kane","urlCharacter":"http://www.imdb.com/character/ch0123231","main":true},{"actorName":"Christopher Lee","urlProfile":"http://www.imdb.com/name/nm0000489","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMjU5NDA0NV5BMl5BanBnXkFtZTYwMTUwMzI0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 May 1922","placeOfBirth":" Belgravia, London, England, UK","birthName":"Christopher Frank Carandini Lee","height":"6' 5\" (1.96 m)","bio":"Sir Christopher Frank Carandini Lee was perhaps the only actor of his generation to have starred in so many films and cult saga. Although most notable for personifying bloodsucking vampire, Dracula, on screen, he portrayed other varied characters on screen, most of which were villains, whether it be Francisco Scaramanga in the James Bond film, The Man with the Golden Gun (1974), or Count Dooku in Star Wars: Episode II - Attack of the Clones (2002), or as the title monster in the Hammer Horror film, The Mummy (1959). Lee was born in 1922 in London, England, where he and his older sister Xandra were raised by their parents, Contessa Estelle Marie (Carandini di Sarzano) and Geoffrey Trollope Lee, a professional soldier, until their divorce in 1926. Later, while Lee was still a child, his mother married (and later divorced) Harcourt George St.-Croix (nicknamed Ingle), who was a banker. Lee's maternal great-grandfather was an Italian political refugee, while Lee's great-grandmother was English opera singer Marie (Burgess) Carandini. After attending Wellington College from age 14 to 17, Lee worked as an office clerk in a couple of London shipping companies until 1941 when he enlisted in the Royal Air Force during World War II. Following his release from military service, Lee joined the Rank Organisation in 1947, training as an actor in their \"Charm School\" and playing a number of bit parts in such films as Corridor of Mirrors (1948). He made a brief appearance in Laurence Olivier's Hamlet (1948), in which his future partner-in-horror Peter Cushing also appeared. Both actors also appeared later in Moulin Rouge (1952) but did not meet until their horror films together. Lee had numerous parts in film and television throughout the 1950s. He struggled initially in his new career because he was discriminated as being taller than the leading male actors of his time and being too foreign-looking. However, playing the monster in the Hammer film The Curse of Frankenstein (1957) proved to be a blessing in disguise, since the was successful, leading to him being signed on for future roles in Hammer Film Productions. Lee's association with Hammer Film Productions brought him into contact with Peter Cushing, and they became good friends. Lee and Cushing often than not played contrasting roles in Hammer films, where Cushing was the protagonist and Lee the villain, whether it be Van Helsing and Dracula respectively in Horror of Dracula (1958), or John Banning and Kharis the Mummy respectively in The Mummy (1959). Lee continued his role as \"Dracula\" in a number of Hammer sequels throughout the 1960s and into the early 1970s. During this time, he co-starred in The Hound of the Baskervilles (1959), and made numerous appearances as Fu Manchu, most notably in the first of the series The Face of Fu Manchu (1965), and also appeared in a number of films in Europe. With his own production company, Charlemagne Productions, Ltd., Lee made Nothing But the Night (1973) and To the Devil a Daughter (1976). By the mid-1970s, Lee was tiring of his horror image and tried to widen his appeal by participating in several mainstream films, such as The Private Life of Sherlock Holmes (1970), The Three Musketeers (1973), The Four Musketeers: Milady's Revenge (1974), and the James Bond film The Man with the Golden Gun (1974). The success of these films prompted him in the late 1970s to move to Hollywood, where he remained a busy actor but made mostly unremarkable film and television appearances, and eventually moved back to England. The beginning of the new millennium relaunched his career to some degree, during which he has played Count Dooku in Star Wars: Episode II - Attack of the Clones (2002) and as Saruman the White in the Lord of the Rings trilogy. Lee played Count Dooku again in Star Wars: Episode III - Revenge of the Sith (2005) and as Johnny Depp's character's father in the Tim Burton film, Charlie and the Chocolate Factory (2005). On 16 June 2001, he was created a Commander of the Order of the British Empire in recognition of his services to drama. He was created a Knight Bachelor on 13 June 2009 in the Queen's Birthday Honours List for his services to drama and charity. In addition he was made a Commander of the Order of St John on 16 January 1997. Lee died at the Chelsea and Westminster Hospital on 7 June 2015 at 8:30 am after being admitted for respiratory problems and heart failure, shortly after celebrating his 93rd birthday there. His wife delayed the public announcement until 11 June, in order to break the news to their family","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMjU5NDA0NV5BMl5BanBnXkFtZTYwMTUwMzI0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000489","name":"Christopher Lee","nicknames":["Chris"],"idIMDB":"nm0000489"},"actorId":"nm0000489","character":"Morgan Canfield","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Roundtree","urlProfile":"http://www.imdb.com/name/nm0745780","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMjIzOTUyMV5BMl5BanBnXkFtZTYwMjA2MDQ3._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1942","placeOfBirth":" New Rochelle, New York, USA","height":"6' 2\" (1.88 m)","bio":"Richard Roundtree was a leading man in many \"blaxploitation\" movies in the 1970s. He is best known for his role as John Shaft in Shaft (1971), and starred in its two sequels as well. As the 1970s and 1980s progressed he starred more in low-budget movies. He was in a few occasional high-profile, if a tad offbeat, films. Among his more notable work in that period were Escape to Athena (1979), City Heat (1984) and the socially conscious but badly received Game for Vultures (1979). Roundtree has been active in movies these days. He became popular again in the 1990s with his role in Se7en (1995), and was well received for reprising his role as the classic hero, and Samuel L. Jackson's uncle, in the 2000 remake of the film that made him a star, Shaft (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMjIzOTUyMV5BMl5BanBnXkFtZTYwMjA2MDQ3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0745780","name":"Richard Roundtree","idIMDB":"nm0745780"},"actorId":"nm0745780","character":"Capt. Stevens","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matt Clark","urlProfile":"http://www.imdb.com/name/nm0164273","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTIzODUzODI3NF5BMl5BanBnXkFtZTcwOTI5MDYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 November 1936","placeOfBirth":" Washington, District of Columbia, USA","bio":"Born In Washington, D.C., Matt grew up in Arlington, Va. Son of Frederick W. Clark, a boat builder and cabinet maker, and Theresa (Costello) Clark, owner and director of a private school in Arlington. Following a two-year stint in the army, Matt attended George Washington University, but dropped out to join a local Washington, D.C. theatre group. He moved to New York in the mid-50's and studied acting at the HB Studio with Herbert Berghof, William Hickey and Frank Naughton. After working at the famous Living Theater and starring in several off-Broadway plays, he moved to California to begin his film career. Matt has appeared in more than 50 feature films, in addition to countless television movies and TV series. He is the director of the film, Da (1988), starring Bernard Hughes, Martin Sheen, and his old acting teacher, Bill Hickey. Matt is father of 4 children: Matthias Clark (musician), Jason Clark (producer), Seth Clark (film editor) and Aimée Clark (producer).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTIzODUzODI3NF5BMl5BanBnXkFtZTcwOTI5MDYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0164273","name":"Matt Clark","idIMDB":"nm0164273"},"actorId":"nm0164273","character":"Tom McCoy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mako","urlProfile":"http://www.imdb.com/name/nm0538683","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDYzODA3Nl5BMl5BanBnXkFtZTcwMDA0MjEzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1933","placeOfBirth":" Kobe, Japan","birthName":"Makoto Iwamatsu","height":"5' 4\" (1.63 m)","bio":"Born in Japan, Mako was living there with his grandparents while his parents studied art in the United States, when Japan and the U.S. went to war in 1941. His parents remained in the U.S., working for the Office of War Information, and, at the cessation of the conflict, were granted U.S. residency by Congress. Mako joined his parents in New York and studied architecture. He entered the U.S. Army in the early 1950s and acted in shows for military personnel, discovering a talent and love for the theatre. He abandoned his plans to become an architect and instead enrolled at the famed Pasadena Community Playhouse in California. Following his studies there, he appeared in many stage productions and on television. In 1966, he won an Academy Award nomination as Best Supporting Actor for his first film role, as the coolie Po-Han in The Sand Pebbles (1966). Only occasionally since have his roles reached the level of his talents, but he has worked steadily in feature films ever since. He appeared on Broadway in the leading role in Stephen Sondheim's \"Pacific Overtures\" and he co-founded and served as artistic director for the highly-acclaimed East-West Players theatre company in Los Angeles. After a long battle and illness from cancer, he passed away on the twenty first of July in 2006, at the age of 72. He was survived by his wife, Shizuko Hoshi, who co-starred in episodes of M*A*S*H (1972), as well, and his children and grand-children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDYzODA3Nl5BMl5BanBnXkFtZTcwMDA0MjEzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0538683","name":"Mako","idIMDB":"nm0538683"},"actorId":"nm0538683","character":"James Chan","urlCharacter":"http://www.imdb.com/character/ch0509785","main":true},{"actorName":"Maggie Cooper","urlProfile":"http://www.imdb.com/name/nm0178232","urlPhoto":"","biography":{"dateOfBirth":"25 March 1955","placeOfBirth":" USA","bio":"Maggie Cooper was born on March 25, 1955 in the USA. She is an actress, known for An Eye for an Eye (1981), Divorce Wars: A Love Story (1982) and Space Academy (1977). She has been married to Gary A. Adelson since March 5, 1983.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0178232","name":"Maggie Cooper","idIMDB":"nm0178232"},"actorId":"nm0178232","character":"Heather Sullivan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rosalind Chao","urlProfile":"http://www.imdb.com/name/nm0001034","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzYyMDc0ODc4MF5BMl5BanBnXkFtZTcwMDY3NTExOA@@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 September 1957","placeOfBirth":" Anaheim, California, USA","birthName":"Jialíng Zhào","height":"5' 6\" (1.68 m)","bio":"Rosalind Chao was born on September 23, 1957 in Anaheim, California, USA as Jialíng Zhào. She is an actress, known for What Dreams May Come (1998), I Am Sam (2001) and Freaky Friday (2003). She has been married to Simon Templeman since 1989. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzYyMDc0ODc4MF5BMl5BanBnXkFtZTcwMDY3NTExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001034","name":"Rosalind Chao","idIMDB":"nm0001034"},"actorId":"nm0001034","character":"Linda Chan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Professor Toru Tanaka","urlProfile":"http://www.imdb.com/name/nm0849048","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NzU0NzQ4OV5BMl5BanBnXkFtZTcwNzM0NzU2NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 January 1930","placeOfBirth":" Honolulu, Hawaii, USA","birthName":"Charles Kalani","height":"6' 2\" (1.88 m)","bio":"Built like the proverbial Patton tank, Professor Toru Tanaka was arguably the successor to Harold Sakata as the archetypal Asian henchman who possessed incredible strength, and clobbered those foolish enough to tangle with him. Born Charles Kalani, he was a successful wrestler and served for over ten years in the US Armed Forces attaining the rank of sergeant. Tanaka first appeared playing a Japanese sumo wrestler on the TV series Little House on the Prairie, however his first film role pitched him as an insidious villain in the chop socky An Eye for an Eye (1981) in which he faces down Chuck Norris before being kicked through a large table. In total, Tanaka appeared in only 23 films including appearing alongside Arnold Schwarzenegger twice in The Running Man (1987) and Last Action Hero (1993). Appearing in The Perfect Weapon (1991) with 6th degree Kempo black belt, Jeff Speakman, Tanaka comes to a fiery end courtesy of an LPG tank!! In reality, Tanaka was far removed from his own screen persona, and was known to be a kind & generous man to all who knew him. He passed away in August, 2000 from heart failure.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NzU0NzQ4OV5BMl5BanBnXkFtZTcwNzM0NzU2NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0849048","name":"Professor Toru Tanaka","idIMDB":"nm0849048"},"actorId":"nm0849048","character":"The Professor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stuart Pankin","urlProfile":"http://www.imdb.com/name/nm0659573","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjQ3NDEwM15BMl5BanBnXkFtZTcwMTQxNjg0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1946","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"5' 7\" (1.7 m)","bio":"A familiar face on both the big and small screen, comic character actor Stuart Pankin is a five-time nominated, CableAce Award winner for HBO's award-winning series \"Not Necessarily The News.\" He is well-known for providing the voice of Earl Sinclair, the blustery father, on the Emmy award-winning \"Dinosaurs.\" (He sang on, and composed two songs for, the Disney album \"Dinosaurs: The Big Songs\", and performed Earl on the \"Dinosaurs: Classic Tales\" tape release.) Best-known film (member: AMPAS) credits include \"Honey We Shrunk Ourselves\" (the first live action made-for-video feature), \"The Hollywood Knights,\" \"Mannequin on the Move,\" \"The Dirt Bike Kid,\" \"Second Sight,\" \"Encounter in the Third Dimension\" and \"Misadventures in 3-D\" (IMAX 3-D movies) as the live Professor, and voice of the adorable animated robot. A series regular on nine prime time television productions and pilots (member: ATAS), he has guest starred on over 300 television shows. He has also provided many cartoon voices for the popular series \"Animaniacs,\" \"Batman,\" \"Superman,\" \"Aladdin,\" \"Lilo and Stitch\" and \"Darkwing Duck.\" On stage, Stuart has performed with the New York Shakespeare Festival, the Brooklyn Academy of Music Repertory Company, the American Place Theatre, the Repertory Company of Lincoln Center, and the Folger Shakespeare Theatre, with \"The Winter's Tale\" \"The Inspector General,\" \"Bartholomew Fair\" and \"The Three Sisters\" among his favorites. He created the roles of Reuben and Queen Victoria in the New York premiere of Andrew Lloyd Weber's \"Joseph and the Amazing Technicolor Dreamcoat.\" He starred in over thirty-five Off Broadway, summer, and regional theatre productions. Stuart starred in, co-wrote and co-executive produced the Stuart Pankin Cinemax Comedy Experiment (\"Hump!\" the musical comedy version of \"Richard III\"), in which he played five roles, and sang his own original music. The Electronic Retail Association nominated him for Best Celebrity Presenter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjQ3NDEwM15BMl5BanBnXkFtZTcwMTQxNjg0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0659573","name":"Stuart Pankin","idIMDB":"nm0659573"},"actorId":"nm0659573","character":"Nicky LaBelle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Terry Kiser","urlProfile":"http://www.imdb.com/name/nm0435218","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjcwMjAyOF5BMl5BanBnXkFtZTgwMDg5NjQ2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 August 1939","placeOfBirth":" Omaha, Nebraska, USA","bio":"Excellent, prolific and dependable character actor Terry Kiser was born in Omaha, Nebraska. Terry attended the University of Kansas on both football and dramatic scholarships. He graduated with a degree in Industrial Engineering and worked for three years in this profession in his hometown of Omaha. Kiser also acted in some 50 plays around this same time. Terry then moved to New York and studied his craft at the Actors Studio, where he was mentored by legendary Method acting teacher Lee Strasberg. Following several gigs in television commercials, he made his film debut as a preacher in the film Rachel, Rachel (1968). Although often cast as sleazy and unlikable scoundrels, Terry has shown on occasion that he can portray more sympathetic parts with equal skill and conviction. Kiser gave an especially strong and engaging performance in a rare substantial starring role in the little seen drama Lapin 360 (1972). Best known as the deceased, but still active Bernie Lomax in the hilarious \"Weekend at Bernie's\" films, Terry's other memorable roles include Chuck Norris' ill-fated cop partner Dave Pierce in the exciting An Eye for an Eye (1981), shady businessman Freddy Barrett in the entertaining science fiction disaster film Starflight: The Plane That Couldn't Land (1983), petty worthless hoodlum Jesse Hardwick in the superior horror anthology opus From a Whisper to a Scream (1987), sneaky psychiatrist Dr. Crews in Friday the 13th Part VII: The New Blood (1988), and the evil Count Gunther Spretzle in Mannequin: On the Move (1991). Kiser had a recurring part on the daytime soap opera The Doctors (1963). Among the many television series Terry has done guest spots on are Will & Grace (1998), Walker, Texas Ranger (1993), Baywatch Nights (1995), Dream On (1990), The Golden Girls (1985), L.A. Law (1986), Hunter (1984), Murder, She Wrote (1984), Riptide (1984), Knight Rider (1982), The Fall Guy (1981), Magnum, P.I. (1980), Hill Street Blues (1981), CHiPs (1977), Diff'rent Strokes (1978), All in the Family (1971), Maude (1972), Hawaii Five-O (1968), The Bionic Woman (1976), The Six Million Dollar Man (1974), and Baretta (1975). In addition to his film and television work, Kiser has acted on stage in the Broadway plays \"God's Favorite\" (Terry received a Tony Award nomination for his performance in this Neil Simon comedy), \"Shelter\", \"The Castro Complex\", and \"Paris Is Out!\". Terry won both an Obie and a Theater World Award for his exemplary acting in the dramatic play \"Fortune and Men's Eyes\". Terry currently resides in Austin, TX and co-founded the premiere acting school The Actors Arena.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjcwMjAyOF5BMl5BanBnXkFtZTgwMDg5NjQ2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0435218","name":"Terry Kiser","idIMDB":"nm0435218"},"actorId":"nm0435218","character":"Dave Pierce","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mel Novak","urlProfile":"http://www.imdb.com/name/nm0636893","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NDc5MjM0OV5BMl5BanBnXkFtZTgwNDIzNTg4MzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1942","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"Mi'lan Mrdjenovich","height":"6' 2\" (1.88 m)","bio":"Martial arts legend and quintessential action movie villain Mel Novak has battled a who's who of legendary Hollywood heroes and is best known as the iconic Stick the Assassin in Bruce Lee's Game of Death. He has also starred in Black Belt Jones opposite Jim Kelly, The Ultimate Warrior opposite Yul Brenner, Eye for an Eye opposite Chuck Norris, Christopher Lee and Richard Roundtree, Tom Horn opposite Steve McQueen and more recently in Gregory Hatanaka's Samurai Cop 2: Deadly Vengeance opposite Bai Ling. Mel also stars in the ensemble cast of Thomas J. Churchill's upcoming film Checkpoint opposite William Forsythe, Bill Goldberg, Fred \"The Hammer\" Williamson and Kenny Johnson. Mel has also acted in Garry Marshall's films such as Exit to Eden opposite Dan Aykroyd and Rosie O'Donnell and Dear God opposite Greg Kinnear and Tim Conway. Ever the noted martial arts movie villain, Mel has had the opportunity to be directed by legendary filmmaker Robert Clouse (Enter the Dragon) several times. His first appearance was a villainous role, where he portrayed a Nazi opposite Jerry Lewis in Which Way to the Front. His first villainous TV role was as a hit man opposite Mike Connors and Abe Vigoda in the classic series Mannix. This role was also his first kill. While he is the ultimate villain on screen, in real life, he is a true hero. Mel is also inducted into the Martial Arts Hall of Fame. He has been bestowed with numerous awards for his acting work as well as humanitarian awards for all his numerous charitable endeavors. He has been volunteering on Skid Row for over 30 years and has counseled prisoners at the most dangerous prisons in the country and has also volunteered with the Special Olympics.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NDc5MjM0OV5BMl5BanBnXkFtZTgwNDIzNTg4MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0636893","name":"Mel Novak","nicknames":["Milan Mrdjenovich"],"idIMDB":"nm0636893"},"actorId":"nm0636893","character":"Tony Montoya","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dorothy Dells","urlProfile":"http://www.imdb.com/name/nm0217525","urlPhoto":"","biography":{"dateOfBirth":"16 July 1928","placeOfBirth":" Salt Lake City, Utah, USA","bio":"Dorothy Dells was born on July 16, 1928 in Salt Lake City, Utah, USA. She is known for her work on Coups pour coups (1990), An Eye for an Eye (1981) and Brain Smasher... A Love Story (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0217525","name":"Dorothy Dells","idIMDB":"nm0217525"},"actorId":"nm0217525","character":"Cab Driver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dov Gottesfeld","urlProfile":"http://www.imdb.com/name/nm0331892","urlPhoto":"","biography":{"bio":"Dov Gottesfeld is known for his work on Tales from the Darkside (1983), Past Tense (1994) and Swamp Thing (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0331892","name":"Dov Gottesfeld","idIMDB":"nm0331892"},"actorId":"nm0331892","character":"Doctor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rick Prieto","urlProfile":"http://www.imdb.com/name/nm0697438","urlPhoto":"","biography":{"dateOfBirth":"1945","placeOfBirth":" USA","height":"5' 10\" (1.78 m)","bio":"Rick Prieto was born in 1945 in the USA. He is known for his work on Braddock: Missing in Action III (1988), Delta Force 2: The Colombian Connection (1990) and An Eye for an Eye (1981). He is married to Beth. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0697438","name":"Rick Prieto","idIMDB":"nm0697438"},"actorId":"nm0697438","character":"Stark","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sam Hiona","urlProfile":"http://www.imdb.com/name/nm0386110","urlPhoto":"","biography":{"bio":"Sam Hiona is an actor, known for Invasion of the Body Snatchers (1978), Thursday (1998) and Shoot to Kill (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0386110","name":"Sam Hiona","nicknames":["Sammy"],"idIMDB":"nm0386110"},"actorId":"nm0386110","character":"Ambler","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0082350","urlIMDB":"http://www.imdb.com/title/tt0082350","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"424,756","country":"West","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 46 min (106 min)","1 hr 37 min (97 min) (25 fps) (TV) (Germany)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Consolidated Film Industries (CFI), Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"5.5","filmingLocations":[{"location":"Alcatraz Prison, Alcatraz Island, San Francisco Bay, California, USA"}],"rated":"R","awards":[],"votes":"2,718","type":"Movie","companyCreditsSimple":[{"idCompany":"co0055946","name":"Adams Apple Film Company"},{"idCompany":"co0103429","name":"South Street Films"},{"idCompany":"co0047885","name":"Wescom Barber International"}],"keywords":{"keywords":["police","undercover","death","fight","drugs","informant","male protagonist","bare breasts","dead woman","neck breaking","dead woman with eyes open","murder of reporter","woman's neck broken","asian woman murdered","police officer killed","dead woman in morgue","carnage","combat","gun","gun sau","gun kata","gun duel","gun battle","bullet ballet","gun fu","blood splatter","blood","smashing a window","punching","slow motion scene","slow motion falling","kicking","spontaneous human combustion","police shootout","cult film","rooftop chase","dirty cop","showdown","ak 47","karate chop","karate kick","martial arts master","martial artist","uzi","beretta","drive by shooting","traitor","crushed to death","foot chase","fighting","disarming someone","opening action scene","warrior","chop socky","death of girlfriend","broken arm","gangster","rage","gunfight","shootout","helicopter","brutality","duel","action hero","hero","ambush","m 16","violence","wisecrack humor","crime lord","machine gun","semiautomatic pistol","hand to hand combat","pistol","one against many","one man army","kicked in the leg","kicked in the face","punched in the stomach","punched in the mouth","punched in the face","punched in the ribs","roundhouse kick","taekwondo","wrestler","wrestling","set up","fistfight","brawl","tough cop","tough guy","forced retirement","detective","ex cop","female stockinged foot","triad","murder","brothel","dog","invincible henchman","hitman","subway","student mentor relationship","telephone box","organized crime","ship","revenge","heroin","surveillance","tv station","chase","swat team","flashback","chinatown san francisco","vengeance","san francisco california","martial arts","television reporter","drug trafficking","crooked cop","death of friend","independent film","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:46:36"}}