{"data":{"movies":[{"title":"Hullabaloo","originalTitle":"","year":"1940","releaseDate":"19401025","directors":[{"name":"Edwin L. Marin","id":"nm0547446"}],"writers":[{"name":"Bradford Ropes","id":"nm0740622"},{"name":"Val Burton","id":"nm0123754"}],"runtime":"78 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmYzNmQyNDQtNmMxYS00NjQ2LWFjMmYtOWQwZGFiZjU3OWFmXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Musical","Romance"],"plot":"A movie musical centered on merrily befogged Merriweather's attempt to restore his career - all while reuniting with his three children (from his three alimony-seeking ex-wives!).","simplePlot":"A movie musical centered on merrily befogged Merriweather's attempt to restore his career - all while reuniting with his three children (from his three alimony-seeking ex-wives!).","actors":[{"actorName":"Frank Morgan","urlProfile":"http://www.imdb.com/name/nm0604656","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMTc0MzQ2OV5BMl5BanBnXkFtZTcwMzI5NTkxNA@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1890","placeOfBirth":" New York City, New York, USA","birthName":"Francis Philip Wuppermann","height":"5' 8\" (1.73 m)","bio":"Jovial, somewhat flamboyant Frank Morgan (born Francis Wuppermann) will forever be remembered as the title character in The Wizard of Oz (1939), but he was a veteran and respected actor long before he played that part, and turned in outstanding performances both before and after that film. One of 11 children of a wealthy manufacturer, Morgan followed his older brother, Ralph Morgan (born Raphael Wuppermann) into the acting profession, making his Broadway debut in 1914 and his film debut two years later. Morgan specialized in playing courtly, sometimes eccentric or befuddled but ultimately sympathetic characters, such as the alcoholic telegraph operator in The Human Comedy (1943) or the shop owner in The Shop Around the Corner (1940). He was nominated for an Academy Award for Best Actor for The Affairs of Cellini (1934). Frank Morgan died at age 59 of a heart attack on September 18, 1949 in Beverly Hills, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMTc0MzQ2OV5BMl5BanBnXkFtZTcwMzI5NTkxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0604656","name":"Frank Morgan","idIMDB":"nm0604656"},"actorId":"nm0604656","character":"Frankie Merriweather","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Virginia Grey","urlProfile":"http://www.imdb.com/name/nm0340706","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjhhYjZkNzYtNzdmYS00YjlkLWI2MmQtZmRlYThmYzgxZjAzL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1917","placeOfBirth":" Los Angeles, California, USA","height":"5' 5\" (1.65 m)","bio":"Born into a show-business family--her father was a director and her mother was a film cutter--Virginia Grey made her film debut at age 10 as Eva in Uncle Tom's Cabin (1927). After a few more films as a child actress, she left the business to finish her schooling. Returning to films as an adult in the 1930s, she started out getting extra work and bit parts, but soon graduated to speaking roles and was eventually signed to a contract by MGM. The studio gave her leading parts in \"B\" pictures and supporting roles in \"A\" pictures. She left MGM in 1942 and went out on her own, working at almost every studio in Hollywood. She worked steadily in both films and TV, and retired from the business in 1970.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjhhYjZkNzYtNzdmYS00YjlkLWI2MmQtZmRlYThmYzgxZjAzL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0340706","name":"Virginia Grey","idIMDB":"nm0340706"},"actorId":"nm0340706","character":"Laura Merriweather","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dan Dailey","urlProfile":"http://www.imdb.com/name/nm0197314","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NDQ0Mzg4N15BMl5BanBnXkFtZTYwMjQ2MjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 December 1915","placeOfBirth":" New York City, New York, USA","birthName":"Daniel James Dailey","height":"6' 3\" (1.91 m)","bio":"Born in New York City, Dan Dailey started his career in vaudeville, later making his Broadway debut in the stage version of \"Babes in Arms\". When signed to MGM, the studio initially casted him as a Nazi in The Mortal Storm (1940). The studio realized their mistake and cast him in musical films, thereafter. Then, after serving in World War II, Dailey later returned to acting to make more musicals.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NDQ0Mzg4N15BMl5BanBnXkFtZTYwMjQ2MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0197314","name":"Dan Dailey","idIMDB":"nm0197314"},"actorId":"nm0197314","character":"Bob Strong","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Billie Burke","urlProfile":"http://www.imdb.com/name/nm0000992","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMjczNzk0NV5BMl5BanBnXkFtZTYwODI3MjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 August 1884","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Mary William Ethelbert Appleton Burke","height":"5' 2½\" (1.59 m)","bio":"Billie Burke was born Mary William Ethelbert Appleton Burke on August 7, 1885 in Washington, D.C. Her father was a circus clown, and as a child she toured the United States and Europe with the circus (before motion pictures and after the stage, circuses were the biggest form of entertainment in the world). One could say that Billie was bred for show business. Her family ultimately settled in London, where she was fortunate to see plays in the city's historic West End, and decided she wanted to be a stage actress. At age 18, she made her stage debut and her career was off and running. Her performances were very well received and she became one of the most popular actresses to grace the stage. Broadway beckoned, and since New York City was now recognized as the stage capital of the world, it was there she would try her luck. Billie came to New York when she was 22 and her momentum did not stop. She appeared in numerous plays and it was only a matter of time before Hollywood came calling, which is exactly what happened. She made her film debut in the lead role in Peggy (1916). The film was a hit, but then again most films were, as the novelty of motion pictures had not worn off since The Great Train Robbery (1903) at the turn of the century. Later that year, she appeared in Gloria's Romance (1916). In between cinema work, she would take her place on the stage because not only was it her first love, but she had speaking parts. Billie considered herself more than an actress--she felt she was an artist, too. She believed that the stage was a way to personally reach out to an audience, something that could not be done in pictures. In 1921, she appeared as Elizabeth Banks in The Education of Elizabeth (1921), then she retired. She had wed impresario Florenz Ziegfeld Jr. of the famed Ziegfeld Follies and, with investments in the stock market, there was no need to work. What the Ziegfelds did not plan on was \"Black October\" in 1929. Their stock investments were wiped out in the crash, which precipitated the Great Depression, and Billie had no choice but to return to the screen. Movies had become even bigger than ten years earlier, especially since the introduction of sound. Her first role of substance was as Margaret Fairlfield in A Bill of Divorcement (1932). As an artist, she loved the fact that she had dialog, but she had to work even harder because her husband had died the same year as her speaking debut - and work she did. One of her career highlights came as Mrs. Millicent Jordan in David O. Selznick's Dinner at Eight (1933), co-starring Lionel Barrymore, Wallace Beery, John Barrymore and Jean Harlow - heady company to be sure, but Billie turned in an outstanding performance as Mrs. Jordan, the scatterbrained wife of a man whose shipping company is in financial trouble and who was trying to get someone to loan his company money to help stave off disaster. Her character loved to give dinner parties because a dinner affair at the Jordans had a reputation among New York blue-blood society as the highlight of the season. With all the drama and intrigue going on around her, her main concern is that she is one man short of having a full seating arrangement. The film was a hit and once again Billie was back on top. In 1937, she had one of her most fondly remembered roles in Topper (1937), a film that would ultimately spin off two sequels, and all three were box-office hits. In 1938, Billie received her first and only Academy Award nomination for her portrayal of Emily Kilbourne in Merrily We Live (1938). This was probably the best performance of her screen career, but she was destined to be immortalized forever in the classic The Wizard of Oz (1939). At 54 years of age - and not looking anywhere near it - she played Glinda, the Good Witch of the North. The 1940s saw Billie busier than ever--she made 25 films between 1940 and 1949. She made only six in the 1950s, as her aging became noticeable. She was 75 when she made her final screen appearance as Cordelia Fosgate in John Ford's Western Sergeant Rutledge (1960). Billie retired for good and lived in Los Angeles, California, where she died at age 85 of natural causes on May 14, 1970.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMjczNzk0NV5BMl5BanBnXkFtZTYwODI3MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000992","name":"Billie Burke","idIMDB":"nm0000992"},"actorId":"nm0000992","character":"Penny Merriweather","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nydia Westman","urlProfile":"http://www.imdb.com/name/nm0922851","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NjA0NDQ3N15BMl5BanBnXkFtZTgwOTQ5Njc3MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 February 1902","placeOfBirth":" New York City, New York, USA","birthName":"Nydia Eileen Westman","bio":"This adorable character actress tended to play older than she really was on stage, screen and TV. Petite and quite pretty in her youth, Nydia Westman was born in 1902 to vaudevillian parents, actor-composer Theodore Westman and actress-playwright Lily Wren, and was thrust into the limelight at an early age as part of the family act (\"Troubles of Joy\"). Her younger brother, Theodore Westman Jr., was also an actor/writer who died tragically at a very young age in 1927. In her teens, Nydia grew in experience on the Orpheum, Ziegfeld and Keith circuits, and later made her Broadway debut with the comedy \"Pigs\" in 1924. A mainstay throughout the late 1920s, other prominent NY theater roles include \"Two Girled Wanted\" (1926), \"Jonesy\" (1929) and \"Lysistrata\" (1930). With the advent of sound, films soon became a viable medium for her as well. She began her movie career in 1932 featured in two dramas, Strange Justice (1932) and Manhattan Tower (1932) and, while she appeared in plenty more heavier material, including Success at Any Price (1934), Craig's Wife (1936) and The Gorgeous Hussy (1936), it was comedy that became her forte, lending cute and flighty foil support in Ladies Should Listen (1934) with Cary Grant, The Cat and the Canary (1939) with Bob Hope, The Remarkable Andrew (1942) with William Holden, and The Late George Apley (1947) with Ronald Colman, among others. Elsewhere, she gave her usual sparkle in the glossy musicals Sweet Adeline (1934), in which she joined Irene Dunne and others in the title song, Pennies from Heaven (1936), Hullabaloo (1940), The Chocolate Soldier (1941) and Hers to Hold (1943), playing assorted friends, maids, gossips and society types. In the post WWII years, Nydia veered away from filming and concentrated instead on stage and TV work. On Broadway, she appeared in \"The Madwoman of Chaillot\" (1948), \"The Emperor's New Clothes\" (1953) and \"The Sleeping Prince\" (1956), and went on to win an Obie Award for her off-Broadway eccentrics in Samuel Beckett's \"Endgame\" (1958). On TV, the small, round matron was featured in a number of showcase-type dramas and comedies and was a fluttery, twinkle-eyed delight on such programs as The Donna Reed Show (1958), Perry Mason (1957), The Addams Family (1964), The Munsters (1964), F Troop (1965), Family Affair (1966) and Bewitched (1964). She also appeared with relative frequency on the revamped Dragnet 1967 (1967) series in the 1960s. Nydia died of cancer in 1970 and was survived by her daughter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NjA0NDQ3N15BMl5BanBnXkFtZTgwOTQ5Njc3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0922851","name":"Nydia Westman","idIMDB":"nm0922851"},"actorId":"nm0922851","character":"Lulu Perkins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ann Morriss","urlProfile":"http://www.imdb.com/name/nm0607357","urlPhoto":"","biography":{"dateOfBirth":"5 August 1919","placeOfBirth":" Tampa, Florida, USA","birthName":"Dorothy Ann Morriss","height":"5' 9\" (1.75 m)","bio":"Ann Morriss was born on August 5, 1919 in Tampa, Florida, USA as Dorothy Ann Morriss. She was an actress, known for The Women (1939), Broadway Melody of 1940 (1940) and Jack Pot (1940). She was married to Edwin L. Marin. She died on June 30, 1994 in Bellevue, Washington, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0607357","name":"Ann Morriss","idIMDB":"nm0607357"},"actorId":"nm0607357","character":"Wilma Norton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Donald Meek","urlProfile":"http://www.imdb.com/name/nm0576083","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NzgzMDAyM15BMl5BanBnXkFtZTcwNjQxMjMxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 July 1878","placeOfBirth":" Glasgow, Scotland, UK","height":"5' 4\" (1.63 m)","bio":"On British and Australian stage before coming to the USA in 1912, he played more than 800 roles, starting with Sir Henry Irving at age 8. He first appeared in the US at Castle Square Theatre, Boston, in 1912, and made his New York debut in 1917 in \"Going Up\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NzgzMDAyM15BMl5BanBnXkFtZTcwNjQxMjMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0576083","name":"Donald Meek","idIMDB":"nm0576083"},"actorId":"nm0576083","character":"Mr. Clyde Perkins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Reginald Owen","urlProfile":"http://www.imdb.com/name/nm0654239","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMDA5NzcxOV5BMl5BanBnXkFtZTcwMTc4ODMxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 August 1887","placeOfBirth":" Wheathampstead, Hertfordshire, England, UK","birthName":"John Reginald Owen","height":"6' (1.83 m)","bio":"Born August 5th, 1887 in England, Reginald Owen was probably Hollywood's busiest character actor - making more than 80 films. He was educated in England at Sir Herbert Tree's Academy of Dramatic Arts. Owen excelled and made his professional debut also in England at the age of 18. He came to New York in the early 1920s and started working on Broadway by 1924. He left New York in 1928 and moved to Hollywood, hoping to make it in films. In 1929, he landed his first role in The Letter. In 1932 he played Dr. Watson in Sherlock Holmes. Although, he didn't get many leading roles, he did get to work with some of Hollywood's most beautiful leading ladies like, Jean Harlow, Joan Crawford, Jeanette MacDonald (Owen's personal favorite), Barbara Stanwyck and Elizabeth Taylor. Owen continued to work into his 70s and 80s making family classics, such as Mary Poppins (1964) and Bedknobs and Broomsticks (1971). He died in 1972 at the ripe age of 85 of natural causes.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMDA5NzcxOV5BMl5BanBnXkFtZTcwMTc4ODMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0654239","name":"Reginald Owen","idIMDB":"nm0654239"},"actorId":"nm0654239","character":"'Buzz' Foster","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Holland","urlProfile":"http://www.imdb.com/name/nm0390636","urlPhoto":"","biography":{"dateOfBirth":"27 December 1909","placeOfBirth":" Norfolk, Virginia, USA","bio":"Charles Holland was born on December 27, 1909 in Norfolk, Virginia, USA. He was an actor, known for Hullabaloo (1940), Youth Will Be Served (1940) and The Big Store (1941). He died on November 7, 1987 in Amsterdam, Noord-Holland, Netherlands.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0390636","name":"Charles Holland","idIMDB":"nm0390636"},"actorId":"nm0390636","character":"Singing Bellhop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leni Lynn","urlProfile":"http://www.imdb.com/name/nm0528748","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE4ZDQ1MDAtODZiYS00MzJlLWFmYzgtZjNiZDY0ZTA1YjQ1XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 May 1923","placeOfBirth":" Waterbury, Connecticut, USA","birthName":"Angelina Ciofani","bio":"Leni Lynn was born on May 3, 1923 in Waterbury, Connecticut, USA as Angelina Ciofani. She was an actress, known for Babes in Arms (1939), Give Me the Stars (1945) and Heaven Is Round the Corner (1944). She was married to Bernard Hoffer, Albert Landry, Douglas Duke and Thomas Hopkin. She died on January 1, 2010 in Croton-on-Hudson, New York, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE4ZDQ1MDAtODZiYS00MzJlLWFmYzgtZjNiZDY0ZTA1YjQ1XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0528748","name":"Leni Lynn","idIMDB":"nm0528748"},"actorId":"nm0528748","character":"Judy Merriweather","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Virginia O'Brien","urlProfile":"http://www.imdb.com/name/nm0639877","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMjYzMTg0OF5BMl5BanBnXkFtZTcwNDU5OTIyNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1919","placeOfBirth":" Los Angeles, California, USA","birthName":"Virginia Lee O'Brien","height":"5' 6½\" (1.69 m)","bio":"Known to classic film fans by various nicknames--including Miss Deadpan, Frozen Face, and Miss Ice Glacier--this statuesque, dark-haired singer/actress carved a unique niche for herself on stage and screen by the hilarious Sphinx-like way she delivered a song. The daughter of the captain of detectives of the Los Angeles Police Department, Virginia Lee O'Brien became interested in music and dance at an early age (it didn't hurt her career chances that her uncle was noted film director Lloyd Bacon). Her big show-business break came in 1939 after she secured a singing role in the L.A. production of the musical/comedy \"Meet the People\". On opening night, when time came for her solo number, Virginia became so paralyzed with fright that she sang her song with a wide-eyed motionless stare that sent the audience (which thought her performance a gag) into convulsions. Demoralized, Virginia left the stage only to soon find out that she was a sensation. Signed by MGM in 1940, she deadpanned her way to acclaim and immense popularity with appearances in some of the studio's most memorable musicals including Thousands Cheer (1943), The Harvey Girls (1946), Till the Clouds Roll By (1946), Ziegfeld Follies (1945), Panama Hattie (1942), Ship Ahoy (1942), Meet the People (1944) and Du Barry Was a Lady (1943), performing inimitable renditions of such classic songs as \"The Wild Wild West\" (from The Harvey Girls), \"A Fine Romance\" (from Till the Clouds Roll By (1946)), \"It's a Great Big World\" (from The Harvey Girls (1946)), \"Poor You\" (from Ship Ahoy (1942)), and \"Say We're Sweethearts Again\" (from Meet the People (1944)). Although too often relegated to featured songs and small supporting roles, she still managed to become an audience favorite by the sheer force of her personality, polished vocals and way with a comic quip. The latter ability is especially apparent in one of her last MGM films, Merton of the Movies (1947), in which she co-starred with Red Skelton. In 1948, after 17 memorable screen appearances for MGM, the studio unceremoniously dropped her from its roster. She returned to films only twice more after her termination from MGM, in Universal's Francis in the Navy (1955) and Disney's Gus (1976), preferring to focus her energies on television and the stage, where she delighted audiences for three more decades. In the 1980s the still youthful beauty toured the country in a one-woman show and recorded a live album at the famed Masquers Club entitled, \"A Salute to the Great MGM Musicals\". One of her last significant stage appearances came in 1984 as Parthy Ann in the Long Beach Civic Light Opera's production of \"Showboat\", with Alan Young. She remained in semi-retirement in a large home in Wrightwood, California, for most of her later years until her death at the Motion Picture Country Hospital in Woodland Hills in January, 2001.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMjYzMTg0OF5BMl5BanBnXkFtZTcwNDU5OTIyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0639877","name":"Virginia O'Brien","nicknames":["\"Miss Red Hot Frozen Face\""],"idIMDB":"nm0639877"},"actorId":"nm0639877","character":"Virginia Ferris","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Curt Bois","urlProfile":"http://www.imdb.com/name/nm0092290","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWM2NzNmZTctYjJkNi00YjBjLWIyMjgtNjMyMWYxNDZlZmI0XkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 April 1901","placeOfBirth":" Berlin, Germany","bio":"Curt Bois was born on April 5, 1901 in Berlin, Germany. He was an actor and director, known for Casablanca (1942), Wings of Desire (1987) and Das Boot ist voll (1981). He was married to Dagmar and Hedy Ury. He died on December 25, 1991 in Berlin.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWM2NzNmZTctYjJkNi00YjBjLWIyMjgtNjMyMWYxNDZlZmI0XkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0092290","name":"Curt Bois","idIMDB":"nm0092290"},"actorId":"nm0092290","character":"Armand Francois","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sara Haden","urlProfile":"http://www.imdb.com/name/nm0352774","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGZlOGJkODMtZGJiYS00MzEzLTk4OWItNTA1YTA3MzgyZjE4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1899","placeOfBirth":" Galveston, Texas, USA","birthName":"Catherine Haden","height":"5' 6½\" (1.69 m)","bio":"Sara Haden was born on November 17, 1899 in Galveston, Texas, USA as Catherine Haden. She was an actress, known for The Shop Around the Corner (1940), The Bishop's Wife (1947) and Woman of the Year (1942). She was married to Richard Abbott. She died on September 15, 1981 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGZlOGJkODMtZGJiYS00MzEzLTk4OWItNTA1YTA3MzgyZjE4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0352774","name":"Sara Haden","idIMDB":"nm0352774"},"actorId":"nm0352774","character":"'Sue' Merriweather","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Larry Nunn","urlProfile":"http://www.imdb.com/name/nm0638067","urlPhoto":"","biography":{"dateOfBirth":"23 August 1925","placeOfBirth":" Marshfield, Oregon, USA","birthName":"Richard Larry Nunn","bio":"Larry Nunn was born on August 23, 1925 in Marshfield, Oregon, USA as Richard Larry Nunn. He was an actor, known for The Major and the Minor (1942), Strike Up the Band (1940) and Men of Boys Town (1941). He died on October 20, 1974 in Venice, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0638067","name":"Larry Nunn","idIMDB":"nm0638067"},"actorId":"nm0638067","character":"'Terry' Merriweather","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barnett Parker","urlProfile":"http://www.imdb.com/name/nm0662065","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWQzNzMxZmYtYTY2ZS00YjI4LTgwMzgtNzc1YWU4MmNkZjZlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1886","placeOfBirth":" Batley, Yorkshire, England, UK","birthName":"William Barnett Parker","bio":"Within the British colony of expatriate actors in Hollywood during the 1930's, Barnett Parker was among the most stereotypical. Harrowgate College-educated, straight-backed, balding and well-intoned, Parker caricatured a multitude of unctuous, stiff-upper-lip butlers, man-servants or waiters, though his performances could, at times, verge on the brink of being camp. When driven to frustration his characters commonly resorted to incoherent twitter or wild gesticulation. Parker was trained under Marie Tempest and George Alexander in England. He first acted on Broadway at the Lyceum Theatre as Wilfred Tavish in Arthur Wing Pinero's \"The \"Mind the Paint\" Girl\" in 1912. He was well served with further roles in hit plays like \"Hobson's Choice\" (1915), \"Artists and Models\" (1924) and \"The Red Robe\" (1928). He was at first prone to reject film offers, professing to favor acting on stage. Nonetheless, the celluloid medium eventually beckoned, enticing him to sign with the East Coast-based studio Thanhouser in 1915. He worked in films during the daytime (while treading the boards at night) and quickly landed a plum role as a weak socialite, rescuing Gladys Hulette in Prudence, the Pirate (1916). He was seldom thereafter afforded the opportunity for heroic acts. During the 1930's, he was primarily in demand for small roles as dandified or 'silly ass' Britishers, giving value for money in films like Mr. Deeds Goes to Town (1936), Personal Property (1937), Live, Love and Learn (1937) and Broadway Melody of 1938 (1937). Looking rather older than his years, Barnett Parker died at the Cedars of Lebanon Hospital in Los Angeles after multiple heart attacks on August 5, 1941.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWQzNzMxZmYtYTY2ZS00YjI4LTgwMzgtNzc1YWU4MmNkZjZlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0662065","name":"Barnett Parker","idIMDB":"nm0662065"},"actorId":"nm0662065","character":"Samuel Stephens","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0032614","urlIMDB":"http://www.imdb.com/title/tt0032614","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"21","month":"08","year":"1940","remarks":null},{"money":null,"country":null,"day":"17","month":"09","year":"1940","remarks":null}],"copyrightHolder":"Loew's Incorporated; 29 October 1940; LP10046"},"technical":{"runtime":["1 hr 18 min (78 min) (USA)"],"soundMix":["Mono (Western Electric Sound System)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["(9 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.0","filmingLocations":[{"location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA"}],"rated":"PASSED","awards":[],"votes":"138","type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"}],"keywords":{"keywords":["manhattan new york city","empire state building manhattan new york city","one word title","husband wife relationship","ex husband ex wife relationship","widow","wedding","voice imitation","sponsor","singer","show business","radio broadcasting","phonograph","panic","orchestra conductor","new york city","marriage","long lost relative","hoax","golfer","financial crisis","father daughter relationship","divorce","dancer","butler","braggart","audition","amusement park","alimony","actor"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 22:32:27"}}