{"data":{"movies":[{"title":"Close Encounters of the Third Kind","originalTitle":"","year":"1977","releaseDate":"19771214","directors":[{"name":"Steven Spielberg","id":"nm0000229"}],"writers":[{"name":"Steven Spielberg","id":"nm0000229"}],"runtime":"137 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1NjE5NjQxN15BMl5BanBnXkFtZTgwMjYzMzQxMDE@._V1.jpg","countries":["USA"],"languages":["English","French","Spanish","Hindi"],"genres":["Drama","Sci-Fi"],"plot":"Two parallel stories are told. In the first, a group of research scientists from a variety of backgrounds are investigating the strange appearance of items in remote locations, primarily desert regions. In continuing their investigation, one of the lead scientists, a Frenchman named Claude Lacombe, incorporates the Kodály method of music education as a means of communication in their work. The response, in turn, at first baffles the researchers, until American cartographer David Laughlin deciphers the meaning of the response. In the second, electric company lineman and family man Roy Neary and single mother Jillian Guiler are among some individuals in Muncie, Indiana who experience some paranormal activity before some flashes of bright lights in the sky, which they believe to be a UFO. Roy becomes obsessed with what he saw, unlike some others, especially in some form of authority, who refuse to acknowledge their belief that it was a UFO in not wanting to appear crazy. That obsession ...","simplePlot":"After an encounter with U.F.O.s, a line worker feels undeniably drawn to an isolated area in the wilderness where something spectacular is about to happen.","actors":[{"actorName":"Richard Dreyfuss","urlProfile":"http://www.imdb.com/name/nm0000377","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMjIzMjM2NV5BMl5BanBnXkFtZTcwNDAxMDY0Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1947","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Richard Stephen Dreyfus","height":"5' 5\" (1.65 m)","bio":"Richard Dreyfuss is an American leading man, who has played his fair share of irritating pests and brash, ambitious hustlers. He was born Richard Stephen Dreyfus in Brooklyn, New York, to Geraldine (Robbins), an activist, and Norman Dreyfus, a restaurateur and attorney. His paternal grandparents were Austro-Hungarian Jewish immigrants, and his mother's family was Russian Jewish. Richard Dreyfuss worked his way up through bit parts (The Graduate (1967), for one) and TV before gaining attention with his portrayal of Baby Face Nelson in John Milius' Dillinger (1973). He gained prominence as a college-bound young man in American Graffiti (1973) and as a nervy Jewish kid with high hopes in L'apprentissage de Duddy Kravitz (1974). By the latter part of the 1970s Dreyfuss was established as a major star, playing leads (and alter-egos) for Steven Spielberg in two of the top-grossing films of the that decade: Jaws (1975) and Close Encounters of the Third Kind (1977). He won a Best Actor Oscar in his first romantic lead as an out-of-work actor in The Goodbye Girl (1977). Dreyfuss also produced and starred in the entertaining private eye movie The Big Fix (1978). After a brief lull in the early 1980s, a well-publicized drug problem and a string of box-office disappointments (The Competition (1980), Whose Life Is It Anyway? (1981), The Buddy System (1984)), a clean and sober Dreyfuss re-established himself in the mid-'80s as one of Hollywood's more engaging leads. He co-starred with Bette Midler and Nick Nolte in Paul Mazursky's popular Down and Out in Beverly Hills (1986). That same year he provided the narration and appeared in the opening and closing \"bookends\" of Rob Reiner's nostalgic Stand by Me (1986). He quickly followed that with Nuts (1987) opposite Barbra Streisand, Barry Levinson's Tin Men (1987) in a memorable teaming with Danny DeVito and Stakeout (1987) with Emilio Estevez. Dreyfuss continued working steadily through the end of the 1980s and into the 1990s, most notably in Mazursky's farce Moon Over Parador (1988), Spielberg's Always (1989), Postcards from the Edge (1990) and Rosencrantz & Guildenstern Are Dead (1990). He appeared as a member of an ensemble that included Holly Hunter, Gena Rowlands and Danny Aiello in the romantic comedy Once Around (1991) and as a pop psychiatrist, the author of several successful self-help books, who is driven to the edge by nutcase Bill Murray in the popular comedy What About Bob? (1991). Dreyfuss has also remained active in the theater (\"Death and Maiden\", 1992) and on TV. He returned to features in the adaptation of Neil Simon's play Lost in Yonkers (1993) and followed with a supporting turn as the querulous political opponent in The American President (1995). Dreyfuss received some of the best notices of his career as a determined, inspiring music teacher coping with a deaf son and the demands of his career in Mr. Holland's Opus (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMjIzMjM2NV5BMl5BanBnXkFtZTcwNDAxMDY0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000377","name":"Richard Dreyfuss","idIMDB":"nm0000377"},"actorId":"nm0000377","character":"Roy Neary","urlCharacter":"http://www.imdb.com/character/ch0007632","main":true},{"actorName":"François Truffaut","urlProfile":"http://www.imdb.com/name/nm0000076","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwMTg1NTc1OV5BMl5BanBnXkFtZTYwOTI5MDM2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 February 1932","placeOfBirth":" Paris, France","birthName":"François Roland Truffaut","height":"5' 6\" (1.68 m)","bio":"François began to assiduously go to the movies at 7. He was also a great reader but not a good pupil. He left school at 14 and started working. In 1947, aged 15, he founded a film club and met André Bazin, a French critic, who becomes his protector. Bazin helped the delinquent Truffaut and also when he was put in jail because he deserted the army. In 1953, he published his first movie critiques in \"Les Cahiers du Cinema.\" In this magazine, Truffaut and some of his friends as passionate as he is, became defender of what they call the \"author policy\". In 1954, as a test, Truffaut directed his first short film. Two years afterwords, in 1956, he assisted Roberto Rossellini with some later abandoned projects. The year 1957 was an important one for him: he married Madeleine Morgenstern, the daughter of an important film distributor, and founded his own production company \"Les Films du Carrosse\"; named after Jean Renoir's The Golden Coach (1952) (Le Carosse d'or). He also directed Les Mistons (1957), considered as the real first step of his cinematographic work. The other big year was 1959: the huge success of his first full-length film The 400 Blows (1959) (Les quatre cents coups) was the beginning of the New Wave, a new way of making movies in France. This was also the birth year of his first daughter Laura Truffaut. From 1959 until his death, François Truffaut's life and films are mixed up. Let's only note he had two other daughters Eva Truffaut (b. 1961) and Josephine (b. 1982 of French actress Fanny Ardant). Truffaut was the most popular and successful French film director ever. His main themes were passion, women, childhood and faithfulness.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwMTg1NTc1OV5BMl5BanBnXkFtZTYwOTI5MDM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000076","name":"François Truffaut","nicknames":["Le Petit Caporal","La Truffe"],"idIMDB":"nm0000076"},"actorId":"nm0000076","character":"Claude Lacombe","urlCharacter":"http://www.imdb.com/character/ch0007634","main":true},{"actorName":"Teri Garr","urlProfile":"http://www.imdb.com/name/nm0000414","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0ODg1Mjc0N15BMl5BanBnXkFtZTYwOTU3NzQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 December 1947","placeOfBirth":" Lakewood, Ohio, USA","birthName":"Terry Ann Garr","height":"5' 7\" (1.7 m)","bio":"Teri Garr can claim a career in show business by birthright. She was born in Lakewood, Ohio, the daughter of Eddie Garr (born Edward Leo Gonnoud), a Broadway stage and film actor, and Phyllis Garr (née Emma Schmotzer), a dancer. Her maternal grandparents were Austrian, and her father was of Irish descent. While she was still an infant, her family moved from Hollywood to New Jersey but, after the death of her father when she was 11, the family returned to Hollywood, where her mother became a wardrobe mistress for movies and television. While Garr's dancing can be seen in nine Elvis Presley movies, her first speaking role in motion pictures was in the 1968 feature Head (1968), starring The Monkees. In the 1970s she became well established in television with appearances on shows such as Star Trek (1966), It Takes a Thief (1968) and McCloud (1970), and became a semi-regular on The Sonny and Cher Show (1976) as Cher's friend, Olivia. Garr has since risen to become one of Hollywood's most versatile, energetic and well-recognized actresses. She has starred in many memorable films, including Young Frankenstein (1974), Oh, God! (1977), Close Encounters of the Third Kind (1977), Mr. Mom (1983), After Hours (1985) and her Academy Award-nominated performance for Best Supporting Actress in Tootsie (1982). Other film roles include The Black Stallion (1979), One from the Heart (1981), The Escape Artist (1982), Firstborn (1984), Let It Ride (1989), Full Moon in Blue Water (1988), Out Cold (1989), Short Time (1990), Waiting for the Light (1990), Mom and Dad Save the World (1992), Perfect Alibi (1995), Ready to Wear (1994) and A Simple Wish (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0ODg1Mjc0N15BMl5BanBnXkFtZTYwOTU3NzQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000414","name":"Teri Garr","idIMDB":"nm0000414"},"actorId":"nm0000414","character":"Ronnie Neary","urlCharacter":"http://www.imdb.com/character/ch0007633","main":true},{"actorName":"Melinda Dillon","urlProfile":"http://www.imdb.com/name/nm0227039","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3ODM4MzAyNl5BMl5BanBnXkFtZTcwODUwODYzNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1939","placeOfBirth":" Hope, Arkansas, USA","birthName":"Melinda Rose Dillon","height":"5' 8\" (1.73 m)","bio":"Melinda Dillon was born October 13, 1939, in Hope, Arkansas, to Norine and W.S Dillon. She attended Hyde Park High School. Melinda started in improvisational comedy, and stage acting before she made her feature-film debut as an eccentric neighbor of Catherine Deneuve's in The April Fools (1969). After a seven year absence, she returned to film with appearances in Bound for Glory (1976). And in Steven Spielberg's Close Encounters of the Third Kind (1977). She played a mother coping with the alien abduction of her son. Her performance in the film earned her an Oscar nomination. Four years later, she earned a second Oscar nomination for her performance as an emotionally disturbed woman who provided an alibi for a suspect in Sydney Pollack's Absence of Malice (1981). Her warmth fostered two mother roles in the whimsical comedies A Christmas Story (1983) and Harry and the Hendersons (1987). Melinda made strong impressions as Savannah Wingo, Nick Nolte's on-screen mentally disturbed, poet sister whose attempted suicide serves as the catalyst in Barbra Streisands The Prince of Tides (1991). And in Paul Thomas Anderson's Magnolia (1999). She played the role of Rose Gator.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3ODM4MzAyNl5BMl5BanBnXkFtZTcwODUwODYzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0227039","name":"Melinda Dillon","idIMDB":"nm0227039"},"actorId":"nm0227039","character":"Jillian Guiler","urlCharacter":"http://www.imdb.com/character/ch0007635","main":true},{"actorName":"Bob Balaban","urlProfile":"http://www.imdb.com/name/nm0000837","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODkzNTMxNF5BMl5BanBnXkFtZTcwNzk5ODk4Mw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 August 1945","placeOfBirth":" Chicago, Illinois, USA","birthName":"Robert Elmer Balaban","height":"5' 5\" (1.65 m)","bio":"Bob Balaban was born on August 16, 1945 in Chicago, Illinois, USA as Robert Elmer Balaban. He is an actor and director, known for Close Encounters of the Third Kind (1977), Moonrise Kingdom (2012) and The Grand Budapest Hotel (2014). He has been married to Lynn Grossman since April 1, 1977. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODkzNTMxNF5BMl5BanBnXkFtZTcwNzk5ODk4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000837","name":"Bob Balaban","idIMDB":"nm0000837"},"actorId":"nm0000837","character":"David Laughlin","urlCharacter":"http://www.imdb.com/character/ch0007636","main":true},{"actorName":"J. Patrick McNamara","urlProfile":"http://www.imdb.com/name/nm0573688","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMjg4MTcyOF5BMl5BanBnXkFtZTcwNjgxNjI2OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"J. Patrick McNamara is an actor, known for Close Encounters of the Third Kind (1977), Bill & Ted's Excellent Adventure (1989) and Blow Out (1981).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMjg4MTcyOF5BMl5BanBnXkFtZTcwNjgxNjI2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0573688","name":"J. Patrick McNamara","idIMDB":"nm0573688"},"actorId":"nm0573688","character":"Project Leader","urlCharacter":"http://www.imdb.com/character/ch0219986","main":true},{"actorName":"Warren J. Kemmerling","urlProfile":"http://www.imdb.com/name/nm0447230","urlPhoto":"","biography":{"dateOfBirth":"4 January 1924","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Warren Joseph Kemmerling","height":"6' 3\" (1.91 m)","bio":"After graduating from St. Louis University in 1947 and serving a hitch in the Marines, Warren Kemmerling began his acting career in the theater. A fine singer, Kemmerling debuted on Broadway in 1953 \"Me and Juliet\". After six years in musicals which included Rogers and Hammerstein's \"Anchors Aweigh,\" Kemmerling decided to try his hand in Hollywood. He spent the next thirty-odd years as a supporting player, mainly in television, making several appearances in such as \"Gunsmoke\", \"Bonanza\", \"Ironside\", and \"The Macahans(How the West Was Won - Wanted: Luke Macahan). His most notable appearance is probably as Lyndon Johnson on the 1978 miniseries \"King\". Kemmerling is also well-known for serving 18 years on the Board of Directors of the Screen Actor's Guild, where he was a leading advocate of benefits for actors. After his death in 2005, Kemmerling was posthumously paid a tribute at the Screen Actors Guild awards that year.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0447230","name":"Warren J. Kemmerling","idIMDB":"nm0447230"},"actorId":"nm0447230","character":"Wild Bill","urlCharacter":"http://www.imdb.com/character/ch0219992","main":true},{"actorName":"Roberts Blossom","urlProfile":"http://www.imdb.com/name/nm0089348","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwMDkwNTkwMV5BMl5BanBnXkFtZTcwODIxMzYwOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 March 1924","placeOfBirth":" New Haven, Connecticut, USA","birthName":"Roberts Scott Blossom","height":"6' 1\" (1.85 m)","bio":"Roberts Blossom was a marvelously quirky, talented, and versatile character actor who was especially adept at portraying cantankerous old oddballs. Born in 1924 in New Haven, Connecticutt, Blossom graduated from the prestigious Asheville School in 1941 and attended Harvard. Roberts initially planned on being a therapist, but eventually changed his mind and decided to become an actor instead. He made his film debut in the bizarre and little seen independent feature \"The Sin of Jesus\" (1961). It wasn't until he was in his late forties and early fifties that Blossom really hit his stride acting in motion pictures. Roberts gave a truly remarkable and unforgettable performance as demented middle-aged backwoods lunatic Ezra Cobb in the creepy horror cult favorite \"Deranged\" (1974). Other memorable film roles include an ill-fated elderly patient in \"The Hospital\" (1971), a sickly soldier in \"Slaughterhouse Five\" (1972), Paul Le Mat's ornery father in \"Citizen's Band\" (1977), a farmer who saw Bigfoot once in \"Close Encounters of the Third Kind\" (1977), a venerable old felon in \"Escape from Alcatraz\" (1979), a kindly next door neighbor in \"Home Alone\" (1990), and a grumpy small town judge in \"Doc Hollywood\" (1991). Blossom did guest spots on such TV shows as \"Northern Exposure,\" \"The Twilight Zone,\" \"The Equalizer,\" \"Moonlighting,\" \"Amazing Stories,\" and \"Naked City.\" Moreover, Blossom was also a poet (he released some of his dramatic poems on video) and a playwright who won four Obies and a Show Business Award. After retiring from acting, Roberts settled in Berkeley, California and wrote poetry. He died at age 87 in Santa Monica, California on July 8, 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwMDkwNTkwMV5BMl5BanBnXkFtZTcwODIxMzYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0089348","name":"Roberts Blossom","idIMDB":"nm0089348"},"actorId":"nm0089348","character":"Farmer","urlCharacter":"http://www.imdb.com/character/ch0219995","main":true},{"actorName":"Philip Dodds","urlProfile":"http://www.imdb.com/name/nm0230164","urlPhoto":"","biography":{"bio":"Philip Dodds is an actor, known for Close Encounters of the Third Kind (1977).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0230164","name":"Philip Dodds","idIMDB":"nm0230164"},"actorId":"nm0230164","character":"Jean Claude","urlCharacter":"http://www.imdb.com/character/ch0217817","main":true},{"actorName":"Cary Guffey","urlProfile":"http://www.imdb.com/name/nm0346533","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MTE1NDIyM15BMl5BanBnXkFtZTYwNDY4MjU2._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 May 1972","placeOfBirth":" Douglasville, Georgia, USA","bio":"Cary Guffey was born on May 10, 1972 in Douglasville, Georgia, USA. He is an actor, known for Close Encounters of the Third Kind (1977), Faut pas pousser! (1980) and Le shérif et les extraterrestres (1979). He has been married to Michelle Quillen Guffey since April 5, 1997. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MTE1NDIyM15BMl5BanBnXkFtZTYwNDY4MjU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0346533","name":"Cary Guffey","idIMDB":"nm0346533"},"actorId":"nm0346533","character":"Barry Guiler","urlCharacter":"http://www.imdb.com/character/ch0007637","main":true},{"actorName":"Shawn Bishop","urlProfile":"http://www.imdb.com/name/nm0084191","urlPhoto":"","biography":{"bio":"Shawn Bishop is known for his work on Close Encounters of the Third Kind (1977), Coming in Out of the Rain (1993) and Ladies in Waiting (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0084191","name":"Shawn Bishop","idIMDB":"nm0084191"},"actorId":"nm0084191","character":"Brad Neary","urlCharacter":"http://www.imdb.com/character/ch0007639","main":true},{"actorName":"Adrienne Campbell","urlProfile":"http://www.imdb.com/name/nm0132176","urlPhoto":"","biography":{"bio":"Adrienne Campbell is an actress, known for Close Encounters of the Third Kind (1977).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0132176","name":"Adrienne Campbell","idIMDB":"nm0132176"},"actorId":"nm0132176","character":"Silvia Neary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Justin Dreyfuss","urlProfile":"http://www.imdb.com/name/nm0237846","urlPhoto":"","biography":{"dateOfBirth":"3 July 1969","placeOfBirth":" Los Angeles County, California, USA","bio":"Justin Dreyfuss was born on July 3, 1969 in Los Angeles County, California, USA. He is an actor, known for Close Encounters of the Third Kind (1977) and Munchies (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0237846","name":"Justin Dreyfuss","idIMDB":"nm0237846"},"actorId":"nm0237846","character":"Toby Neary","urlCharacter":"http://www.imdb.com/character/ch0007638","main":true},{"actorName":"Lance Henriksen","urlProfile":"http://www.imdb.com/name/nm0000448","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkwOTMyMDEzN15BMl5BanBnXkFtZTcwMjk4NTUyMg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1940","placeOfBirth":" New York City, New York, USA","birthName":"Lance James Henriksen","height":"5' 10¼\" (1.79 m)","bio":"An intense, versatile actor as adept at playing clean-cut FBI agents as he is psychotic motorcycle-gang leaders, who can go from portraying soulless, murderous vampires to burned-out, world-weary homicide detectives, Lance Henriksen has starred in a variety of films that have allowed him to stretch his talents just about as far as an actor could possibly hope. He played \"Awful Knoffel\" in the TNT original movie Evel Knievel (2004), directed by John Badham and executive produced by Mel Gibson. Henriksen portrayed \"Awful Knoffel\" in this project based on the life of the famed daredevil, played by George Eads. Henriksen starred for three seasons (1996-1999) on Millennium (1996), Fox-TV's critically acclaimed series created by Chris Carter (The X-Files (1993)). His performance as Frank Black, a retired FBI agent who has the ability to get inside the minds of killers, landed him three consecutive Golden Globe nominations for \"Best Performance by a Lead Actor in a Drama Series\" and a People's Choice Award nomination for \"Favorite New TV Male Star\". Henriksen was born in New York City. His mother, Margueritte, was a waitress, dance instructor, and model. His father, James Marin Henriksen, who was from Tønsberg, Norway, was a boxer and merchant sailor. Henriksen studied at the Actors Studio and began his career off-Broadway in Eugene O'Neill's \"Three Plays of the Sea.\" One of his first film appearances was as an FBI agent in Sidney Lumet's Dog Day Afternoon (1975), followed by parts in Lumet's Network (1976) and Prince of the City (1981). He then appeared in Steven Spielberg's Close Encounters of the Third Kind (1977) with Richard Dreyfuss and François Truffaut, Damien: Omen II (1978) and in Philip Kaufman's The Right Stuff (1983), in which he played Mercury astronaut Capt. Wally Schirra. James Cameron cast Henriksen in his first directorial effort, Piranha Part Two: The Spawning (1981), then used him again in The Terminator (1984) and as the android Bishop in the sci-fi classic Aliens (1986). Sam Raimi cast Henriksen as an outrageously garbed gunfighter in his quirky western Mort ou vif (1995). Henriksen has also appeared in what has developed into a cult classic: Kathryn Bigelow's Near Dark (1987), in which he plays the head of a clan of murderous redneck vampires. He was nominated for a Golden Satellite Award for his portrayal of Abraham Lincoln in the TNT original film The Day Lincoln Was Shot (1998). In addition to his abilities as an actor, Henriksen is an accomplished painter and potter. His talent as a ceramist has enabled him to create some of the most unusual ceramic artworks available on the art market today. He resides in Southern California with his wife Jane and their five-year-old daughter Sage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkwOTMyMDEzN15BMl5BanBnXkFtZTcwMjk4NTUyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000448","name":"Lance Henriksen","idIMDB":"nm0000448"},"actorId":"nm0000448","character":"Robert","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Merrill Connally","urlProfile":"http://www.imdb.com/name/nm0174919","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyZWJhZDMtNDcyYS00YjgzLTg4ZjMtMjQxNTk0NTJlYTM4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1921","placeOfBirth":" Floresville, Texas, USA","bio":"Merrill Connally was born on April 9, 1921 in Floresville, Texas, USA. He was an actor, known for Close Encounters of the Third Kind (1977), Rush (1991) and The Sugarland Express (1974). He died on September 4, 2001 in Floresville.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyZWJhZDMtNDcyYS00YjgzLTg4ZjMtMjQxNTk0NTJlYTM4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0174919","name":"Merrill Connally","idIMDB":"nm0174919"},"actorId":"nm0174919","character":"Team Leader","urlCharacter":"http://www.imdb.com/character/ch0221341","main":true}],"seasons":[],"idIMDB":"tt0075860","urlIMDB":"http://www.imdb.com/title/tt0075860","business":{"budget":{"money":"$20,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$15,693,175 (USA)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"$116,395,460 (USA)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"$9,083,988","country":"USA","day":"18","month":"12","year":"1977","remarks":""},{"money":"SEK","country":"8,608,254","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":[{"money":"$5,379,460","country":"USA","day":"18","month":"12","year":"1977","remarks":"272 Screens"}],"admissions":[{"money":"3,115,787","country":"France","day":"31","month":"12","year":"1978","remarks":""},{"money":"3,270,032","country":"Spain","day":"31","month":"12","year":"1978","remarks":""},{"money":"3,330,000 (West","country":"Germany","day":"31","month":"12","year":"1978","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"16","month":"05","year":"1976","remarks":null},null],"copyrightHolder":"Copyright ©1977. 1980 Columbia Pictures Industries, Inc. All Rights Reserved"},"technical":{"runtime":["2 hr 12 min (132 min) (special edition)","2 hr 15 min (135 min) (original)","2 hr 17 min (137 min) (collector's edition)"],"soundMix":["70 mm 6-Track (70 mm prints)","Dolby (35 mm prints)"],"color":["Color (Metrocolor)"],"aspectRatio":["2.20 : 1 (70 mm prints)","2.35 : 1"],"camera":["Panavision Panaflex, Panavision C-Series and Super High Speed Lenses"],"laboratory":["Metrocolor, Culver City (CA), USA"],"filmLength":["1,000 m (8 mm)","3,695 m (Sweden)"],"negativeFormat":["35 mm (Eastman 100T 5247)","65 mm (Eastman 100T 5254)"],"cinematographicProcess":["Panavision (anamorphic)","Super Panavision 70 (special effects)"],"printedFilmFormat":["35 mm","70 mm (blow-up)","8 mm"]},"rating":"7.7","metascore":"92","filmingLocations":[{"location":"Mobile Civic Center, Civic Center Drive, Mobile, Alabama, USA"}],"rated":"PG","awards":[{"award":"Academy Awards, USA 1978","titlesAwards":[{"titleAwardOutcome":"Won Oscar","categories":[{"category":"Best Cinematography","names":[{"name":"Vilmos Zsigmond","id":"nm0005936","role":null}]}]},{"titleAwardOutcome":"Won Special Achievement Award","categories":[{"category":"","names":[{"name":"Frank E. Warner","id":"nm0912466","role":null}]}]},{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Actress in a Supporting Role","names":[{"name":"Melinda Dillon","id":"nm0227039","role":null}]},{"category":"Best Director","names":[{"name":"Steven Spielberg","id":"nm0000229","role":null}]},{"category":"Best Art Direction-Set Decoration","names":[{"name":"Joe Alves","id":"nm0023469","role":null},{"name":"Daniel A. Lomino","id":"nm0518561","role":null},{"name":"Phil Abramson","id":"nm0009055","role":null}]},{"category":"Best Sound","names":[{"name":"Robert Knudson","id":"nm0461702","role":null},{"name":"Robert Glass","id":"nm0321915","role":null},{"name":"Don MacDougall","id":"nm0532013","role":null},{"name":"Gene S. Cantamessa","id":"nm0134481","role":null}]},{"category":"Best Film Editing","names":[{"name":"Michael Kahn","id":"nm0434883","role":null}]},{"category":"Best Effects, Visual Effects","names":[{"name":"Roy Arbogast","id":"nm0033405","role":null},{"name":"Douglas Trumbull","id":"nm0874320","role":null},{"name":"Matthew Yuricich","id":"nm0951046","role":null},{"name":"Gregory Jein","id":"nm0420478","role":null},{"name":"Richard Yuricich","id":"nm0951047","role":null}]},{"category":"Best Music, Original Score","names":[{"name":"John Williams","id":"nm0002354","role":null}]}]}]},{"award":"Golden Globes, USA 1978","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Motion Picture - Drama","names":[]},{"category":"Best Director - Motion Picture","names":[{"name":"Steven Spielberg","id":"nm0000229","role":null}]},{"category":"Best Screenplay - Motion Picture","names":[{"name":"Steven Spielberg","id":"nm0000229","role":null}]},{"category":"Best Original Score - Motion Picture","names":[{"name":"John Williams","id":"nm0002354","role":null}]}]}]},{"award":"BAFTA Awards 1979","titlesAwards":[{"titleAwardOutcome":"Won BAFTA Film Award","categories":[{"category":"Best Production Design/Art Direction","names":[{"name":"Joe Alves","id":"nm0023469","role":null}]}]},{"titleAwardOutcome":"Nominated Anthony Asquith Award for Film Music","categories":[{"category":"","names":[{"name":"John Williams","id":"nm0002354","role":null}]}]},{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best Cinematography","names":[{"name":"Vilmos Zsigmond","id":"nm0005936","role":null}]},{"category":"Best Direction","names":[{"name":"Steven Spielberg","id":"nm0000229","role":null}]},{"category":"Best Film","names":[]},{"category":"Best Film Editing","names":[{"name":"Michael Kahn","id":"nm0434883","role":null}]},{"category":"Best Screenplay","names":[{"name":"Steven Spielberg","id":"nm0000229","role":null}]},{"category":"Best Sound","names":[{"name":"Gene S. Cantamessa","id":"nm0134481","role":null},{"name":"Robert Knudson","id":"nm0461702","role":null},{"name":"Don MacDougall","id":"nm0532013","role":null},{"name":"Robert Glass","id":"nm0321915","role":null},{"name":"Stephen Katz","id":"nm0441858","role":null},{"name":"Frank E. Warner","id":"nm0912466","role":null},{"name":"Richard Oswald","id":"nm0652651","role":null},{"name":"David M. Horton","id":"nm0395585","role":null},{"name":"Sam Gemette","id":"nm0312559","role":null},{"name":"Gary S. Gerlich","id":"nm0314416","role":null},{"name":"Chester Slomka","id":"nm0806153","role":null},{"name":"Neil Burrow","id":"nm0123229","role":null}]},{"category":"Best Supporting Actor","names":[{"name":"François Truffaut","id":"nm0000076","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best DVD Special Edition Release","names":[]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2002","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best DVD Classic Film Release","names":[]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1978","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best Director","names":[{"name":"Steven Spielberg","id":"nm0000229","role":null}]},{"category":"Best Music","names":[{"name":"John Williams","id":"nm0002354","role":null}]}]},{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Science Fiction Film","names":[]},{"category":"Best Actor","names":[{"name":"Richard Dreyfuss","id":"nm0000377","role":null}]},{"category":"Best Actress","names":[{"name":"Melinda Dillon","id":"nm0227039","role":null}]},{"category":"Best Writing","names":[{"name":"Steven Spielberg","id":"nm0000229","role":null}]},{"category":"Best Supporting Actress","names":[{"name":"Teri Garr","id":"nm0000414","role":null}]},{"category":"Best Make-Up","names":[{"name":"Bob Westmoreland","id":"nm0922886","role":null},{"name":"Thomas R. Burman","id":"nm0122207","role":null},{"name":"Carlo Rambaldi","id":"nm0708058","role":null}]},{"category":"Best Special Effects","names":[{"name":"Douglas Trumbull","id":"nm0874320","role":null}]}]}]},{"award":"American Cinema Editors, USA 1978","titlesAwards":[{"titleAwardOutcome":"Nominated Eddie","categories":[{"category":"Best Edited Feature Film","names":[{"name":"Michael Kahn","id":"nm0434883","role":null}]}]}]},{"award":"Awards of the Japanese Academy 1979","titlesAwards":[{"titleAwardOutcome":"Nominated Award of the Japanese Academy","categories":[{"category":"Best Foreign Language Film","names":[]}]}]},{"award":"David di Donatello Awards 1978","titlesAwards":[{"titleAwardOutcome":"Won David","categories":[{"category":"Best Foreign Film (Miglior Film Straniero)","names":[{"name":"Steven Spielberg","id":"nm0000229","role":null}]}]}]},{"award":"Directors Guild of America, USA 1978","titlesAwards":[{"titleAwardOutcome":"Nominated DGA Award","categories":[{"category":"Outstanding Directorial Achievement in Motion Pictures","names":[{"name":"Steven Spielberg","id":"nm0000229","role":null}]}]}]},{"award":"Golden Screen, Germany 1979","titlesAwards":[{"titleAwardOutcome":"Won Golden Screen","categories":[{"category":"","names":[]}]}]},{"award":"Grammy Awards 1979","titlesAwards":[{"titleAwardOutcome":"Won Grammy","categories":[{"category":"Best Album of Original Score Written for a Motion Picture or Television Special","names":[{"name":"John Williams","id":"nm0002354","role":null}]}]}]},{"award":"Hugo Awards 1978","titlesAwards":[{"titleAwardOutcome":"Nominated Hugo","categories":[{"category":"Best Dramatic Presentation","names":[{"name":"Steven Spielberg","id":"nm0000229","role":"director, screenplay"}]}]}]},{"award":"International Film Music Critics Award (IFMCA) 1998","titlesAwards":[{"titleAwardOutcome":"Won FMCJ Award","categories":[{"category":"Best Re-Release of a Previously Existing Score","names":[{"name":"Arista","id":"nm4191630","role":null}]}]}]},{"award":"Korean Association of Film Critics Awards 1983","titlesAwards":[{"titleAwardOutcome":"Won Korean Association of Film Critics Award","categories":[{"category":"Best Foreign Film","names":[{"name":"Steven Spielberg","id":"nm0000229","role":null}]}]}]},{"award":"Motion Picture Sound Editors, USA 1978","titlesAwards":[{"titleAwardOutcome":"Won Golden Reel Award","categories":[{"category":"Best Sound Editing - Sound Effects","names":[]}]}]},{"award":"National Board of Review, USA 1977","titlesAwards":[{"titleAwardOutcome":"Won NBR Award","categories":[{"category":"Top Ten Films","names":[]}]},{"titleAwardOutcome":"Won Special Citation","categories":[{"category":"","names":[]}]}]},{"award":"National Film Preservation Board, USA 2007","titlesAwards":[{"titleAwardOutcome":"Won National Film Registry","categories":[{"category":"","names":[]}]}]},{"award":"National Society of Film Critics Awards, USA 1977","titlesAwards":[{"titleAwardOutcome":"2nd place NSFC Award","categories":[{"category":"Best Director","names":[{"name":"Steven Spielberg","id":"nm0000229","role":null}]}]},{"titleAwardOutcome":"3rd place NSFC Award","categories":[{"category":"Best Film","names":[]}]}]},{"award":"New York Film Critics Circle Awards 1977","titlesAwards":[{"titleAwardOutcome":"3rd place NYFCC Award","categories":[{"category":"Best Film","names":[]},{"category":"Best Director","names":[{"name":"Steven Spielberg","id":"nm0000229","role":null}]}]}]},{"award":"Online Film & Television Association 2010","titlesAwards":[{"titleAwardOutcome":"Won OFTA Film Hall of Fame","categories":[{"category":"Motion Picture","names":[]}]}]},{"award":"Writers Guild of America, USA 1978","titlesAwards":[{"titleAwardOutcome":"Nominated WGA Award (Screen)","categories":[{"category":"Best Drama Written Directly for the Screen","names":[{"name":"Steven Spielberg","id":"nm0000229","role":null}]}]}]}],"votes":"146,318","type":"Movie","companyCreditsSimple":[{"idCompany":"co0050868","name":"Columbia Pictures Corporation"},{"idCompany":"co0103338","name":"EMI Films"},{"idCompany":"co0288298","name":"EMI Films"}],"keywords":{"keywords":["ufo","vision","close encounter of the third kind","mothership","alien","spacecraft","obsession","cartographer","single mother","indiana","lifting someone into the air","outer space","first contact","rural setting","pursuit","pickup truck","mother son reunion","mother son relationship","husband wife relationship","father son relationship","family relationships","air traffic control","seti","small town","car chase","air traffic controller","blockbuster","tollbooth","helicopter","airplane","mashed potatoes","alien abduction","wyoming","sculpture","devil's tower","steamship","globe","evacuation","blackout","sunburn","playing with food","translator","gas mask","ohio","television news","famous score","police chase","sandstorm","utility employee","mongolia","india","conspiracy","animate toy","chase","frustration","alien contact","desert","military","epic","message from outer space","self transcendence","english subtitles in original","seminar","garbage truck","quarantine","clothes on shower","mexico","chimney","radio telescope","railway station","shaving cream","marital separation","cattle","press conference","starship model","cartoon on tv","six word title","alien invasion","watching tv","chapel","organ","car accident","model train","astronaut","off road","forest","brushing teeth","railroad crossing","motel","spanking","xylophone","fireplace"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:44:13"}}