{"data":{"movies":[{"title":"Starman","originalTitle":"","year":"1984","releaseDate":"19841214","directors":[{"name":"John Carpenter","id":"nm0000118"}],"writers":[{"name":"Bruce A. Evans","id":"nm0262595"},{"name":"Raynold Gideon","id":"nm0317279"}],"runtime":"115 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BODg5ODI0NzM5M15BMl5BanBnXkFtZTgwNDk5MjQxMDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Romance","Sci-Fi"],"plot":"Jenny Hayden never did get over the death of her husband. So when an alien life form decides to model \"himself\" on the husband, Jenny is understandably confused if not terrified. The alien, or Starman, as he is called, has a deadline to meet, and kidnaps Jenny in order to meet it.","simplePlot":"An alien takes the form of a young widow's husband and asks her to drive him from Wisconsin to Arizona. The government tries to stop them.","actors":[{"actorName":"Jeff Bridges","urlProfile":"http://www.imdb.com/name/nm0000313","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU1NjM4MDYzMl5BMl5BanBnXkFtZTcwMjIwMjMyMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 December 1949","placeOfBirth":" Los Angeles, California, USA","birthName":"Jeffrey Leon Bridges","height":"6' 1\" (1.85 m)","bio":"Jeffrey Leon Bridges was born on December 4, 1949 in Los Angeles, California, the son of well-known film and TV star Lloyd Bridges and his long-time wife Dorothy Dean Bridges (née Simpson). He grew up amid the happening Hollywood scene with big brother Beau Bridges. Both boys popped up, without billing, alongside their mother in the film The Company She Keeps (1951), and appeared on occasion with their famous dad on his popular underwater TV series Sea Hunt (1958) while growing up. At age 14, Jeff toured with his father in a stage production of \"Anniversary Waltz\". The \"troublesome teen\" years proved just that for Jeff and his parents were compelled at one point to intervene when problems with drugs and marijuana got out of hand. He recovered and began shaping his nascent young adult career appearing on TV as a younger version of his father in the acclaimed TV- movie Silent Night, Lonely Night (1969), and in the strange Burgess Meredith film Le 3eme oeil (1970). Following fine notices for his portrayal of a white student caught up in the racially-themed Halls of Anger (1970), his career-maker arrived just a year later when he earned a coming-of-age role in the critically-acclaimed ensemble film The Last Picture Show (1971). The Peter Bogdanovich- directed film made stars out off its young leads (Bridges, Timothy Bottoms, Cybill Shepherd) and Oscar winners out of its older cast (Ben Johnson, Cloris Leachman). The part of Duane Jackson, for which Jeff received his first Oscar-nomination (for \"best supporting actor\"), set the tone for the types of roles Jeff would acquaint himself with his fans -- rambling, reckless, rascally and usually unpredictable). Owning a casual carefree handsomeness and armed with a perpetual grin and sly charm, he started immediately on an intriguing 70s sojourn into offbeat filming. Chief among them were his boxer on his way up opposite a declining Stacy Keach in Fat City (1972); his Civil War-era conman in the western Bad Company (1972); his redneck stock car racer in The Last American Hero (1973); his young student anarchist opposite a stellar veteran cast in Eugene O'Neill's The Iceman Cometh (1973); his bank-robbing (also Oscar-nominated) sidekick to Clint Eastwood in Thunderbolt and Lightfoot (1974); his aimless cattle rustler in Rancho Deluxe (1975); his low-level western writer who wants to be a real-life cowboy in Hearts of the West (1975); and his brother of an assassinated President who pursues leads to the crime in Winter Kills (1979). All are simply marvelous characters that should have propelled him to the very top rungs of stardom...but strangely didn't. Perhaps it was his trademark ease and naturalistic approach that made him somewhat under appreciated at that time when Hollywood was run by a Dustin Hoffman, Robert De Niro and Al Pacino-like intensity. Neverthless, Jeff continued to be a scene-stealing favorite into the next decade, notably as the video game programmer in the 1982 science-fiction cult classic TRON (1982), and the struggling musician brother vying with brother Beau Bridges over the attentions of sexy singer Michelle Pfeiffer in The Fabulous Baker Boys (1989). Jeff became a third-time Oscar nominee with his highly intriguing (and strangely sexy) portrayal of a blank-faced alien in Starman (1984), and earned even higher regard as the ever-optimistic inventor Preston Tucker in Tucker: The Man and His Dream (1988). Since then Jeff has continued to pour on the Bridges magic on film. Few enjoy such an enduring popularity while maintaining equal respect with the critics. The Fisher King (1991), American Heart (1992), Fearless (1993), The Big Lebowski (1998) (now a cult phenomenon) and The Contender (2000) (which gave him a fourth Oscar nomination) are prime examples. More recently he seized the moment as a bald-pated villain as Robert Downey Jr.'s nemesis in Iron Man (2008) and then, at age 60, he capped his rewarding career by winning the elusive Oscar, plus the Golden Globe and Screen Actor Guild awards (among many others), for his down-and-out country singer Bad Blake in Crazy Heart (2009). Bridges next starred in TRON: Legacy (2010), reprising one of his more famous roles, and received another Oscar nomination for Best Actor for his role in the Western remake True Grit (2010). In 2014, he co-produced and starred in an adaptation of the Lois Lowry science fiction drama The Giver (2014). Jeff has been married since 1977 to non-professional Susan Geston (they met on the set of Rancho Deluxe (1975)). The couple have three daughters, Isabelle (born 1981), Jessica (born 1983), and Hayley (born 1985). He hobbies as a photographer on and off his film sets, and has been known to play around as a cartoonist and pop musician. His ancestry is English, and smaller amounts of Scots-Irish (Northern Irish), Irish, Swiss-German, and German.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU1NjM4MDYzMl5BMl5BanBnXkFtZTcwMjIwMjMyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000313","name":"Jeff Bridges","nicknames":["The Dude"],"idIMDB":"nm0000313"},"actorId":"nm0000313","character":"Starman","urlCharacter":"http://www.imdb.com/character/ch0017380","main":true},{"actorName":"Karen Allen","urlProfile":"http://www.imdb.com/name/nm0000261","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NjgyMjQwMF5BMl5BanBnXkFtZTcwNzkwMjE3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 October 1951","placeOfBirth":" Carrollton, Illinois, USA","birthName":"Karen Jane Allen","height":"5' 5\" (1.65 m)","bio":"Karen Jane Allen was born in Carrollton, rural southern Illinois, to Patricia (Howell), a teacher, and Carroll Thompson Allen, an FBI agent. Karen spent her first 10 years traveling around the country with her parents and two sisters. She was always \"the new girl in school\". Acting did not really cross Karen's mind until her early 20s when she saw a 'Jerry Grotowski' theater production that impressed her so much she instantly decided to give it a shot. She trained as a classical actress and enrolled at the Actors Studio and with Lee Strasberg in New York. During this period she made several student films and directed and acted in several plays. In 1976 she made her first film appearance in the award-winning small film, The Whidjitmaker (1976). Her first major film role came as \"Katy\" in 1978's National Lampoon's Animal House (1978) which became one of the biggest hits of the year, obtained \"classic\" status and launched a whole host of young \"hot\" stars. However, shortly after Animal House (1978) opened Karen was struck by a rare and dangerous eyesight condition called Kerato Conjunctivitis. Luckily, the condition subsided and Karen could continue her dramatic rise to the top. Lead roles in cult favorites like The Wanderers (1979) and the controversial thriller Cruising - La Chasse (1980) followed, as did smaller parts as in Woody Allen's Manhattan (1979). However, it was her performance in Rob Cohen's A Small Circle of Friends (1980), as well as her previously mentioned turn in Animal House (1978), that caught the eye of a certain Steven Spielberg. He then cast her as the feisty heroine and Harrison Ford's co-star in his big budget blockbuster Raiders of the Lost Ark (1981), which became a huge hit in 1981-82 and is regarded by many as the greatest action adventure film ever made. Strangely, following the huge success of Raiders of the Lost Ark (1981) Karen chose to spend over two years out of the limelight - concentrating on smaller, more personal projects. She won a major award for her performances on Broadway, won critical acclaim for her creation of \"Abra\" in the hugely successful ABC production of East of Eden (1981) and had parts in two smaller films: Alan Parker's Shoot the Moon (1982) and Split Image (1982) co-starring James Woods and Peter Fonda. She returned to the mainstream in 1984 with Until September (1984) and the hugely successful Starman (1984) co-starring Jeff Bridges and directed by John Carpenter (of Halloween (1978) fame), but once again decided to leave the limelight for a couple of years doing more stage-work and some troubled 'indie' films. While Karen has worked almost constantly since then giving notable performances in Paul Newman's screen adaptation of The Glass Menagerie (1987), the Christmas hit Scrooged (1988)and Steven Soderbergh's underrated King of the Hill (1993), she has not been able to scale the same dizzy heights as the early 1980's hits. Most of her lead roles in feature films since Starman (1984) have not been that well received (Animal Behavior (1989), Ghost in the Machine (1993) and The Turning (1992) among them). However, she has been seen to good effect on TV in films like Challenger (1990) in which she portrayed tragic schoolteacher \"Christa McAuliffe\" and All the Winters That Have Been (1997), co-starring Richard Chamberlain. She has also made 'special guest star appearances' on such shows as Law & Order (1990), Knots Landing (1979), Alfred Hitchcock Presents (1985), and several TV movies including Seule contre tous (1996) and Secret Weapon (1990). She also played the lead in the CBS series The Road Home (1994). Karen Allen was married to soap star Kale Browne (with whom she co-starred in 'Til There Was You (1997)) in 1988 and they have a son Nicholas. Apart from acting Karen Allen is also an accomplished singer, songwriter and musician (she played in a band with Kathleen Turner, and recorded a duet with Jeff Bridges for the Starman (1984) soundtrack album). She also writes plays, screenplays and poetry, owns her own Astranga Yoga enterprise and spends time at her Berkshire Mountains farm or Upper Westside Manhattan townhouse. The classically trained actress also has a screenplay called \"Second Coming, The\", which is about to be made into a movie. Most recently she stars opposite Peter Coyote in The Basket (1999) and the blockbuster The Perfect Storm (2000) in which she co-stars with George Clooney, Mark Wahlberg and Diane Lane. In addition to these, she is working on Shaka Zulu: The Citadel (2001) and recently made an independent film, In the Bedroom (2001). Karen Allen is undoubtedly one of the most talented, ambitious and versatile actresses of the last 20 years. In many ways her own choices to \"go back to theater and smaller projects\" are the only things that have really stopped her being a major, major star. Karen was voted one of the most beautiful women in the world in 1983, and is a naturally attractive lady - who often plays characters significantly younger than herself. She also often plays unglamorous types - and there is no one better at portraying real, human, and wholly believable people.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NjgyMjQwMF5BMl5BanBnXkFtZTcwNzkwMjE3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000261","name":"Karen Allen","idIMDB":"nm0000261"},"actorId":"nm0000261","character":"Jenny Hayden","urlCharacter":"http://www.imdb.com/character/ch0017381","main":true},{"actorName":"Charles Martin Smith","urlProfile":"http://www.imdb.com/name/nm0001747","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDMxMDk2M15BMl5BanBnXkFtZTcwMzcxODYzMw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 October 1953","placeOfBirth":" Van Nuys, California, USA","height":"5' 5\" (1.65 m)","bio":"Charles Martin Smith is an American film actor, writer, and director. Born in Van Nuys, California, Smith was discovered by a talent agent while acting in a school play, usually a rare occurrence. After a few years of working in film, he landed the role of Terry \"The Toad\" Fields in George Lucas' 1973 film, American Graffiti (1973). The sequel, More American Graffiti (1979), did not have the success of the original, but he gained notice in The Buddy Holly Story (1978), Never Cry Wolf (1983) and the successful Starman (1984). Smith's career continued mainly in supporting roles, but he received good reviews for his work in The Untouchables (1987). While his career was largely unremarkable in the 1990s after appearing in less successful films, such as Speechless (1994) and I Love Trouble (1994), Smith turned in a well-regarded performance in the TV miniseries Larry McMurtry's Streets of Laredo (1995) and a minor role in the big budget Deep Impact (1998). He was also one of the directors of the TV series Space: Above and Beyond (1995), as well as the director of the initial episode (\"Welcome to the Hellmouth\") that launched the hit TV series Buffy the Vampire Slayer (1997). Since the mid-1990s, Smith has increasingly focused on his work behind the camera. He directed the feature film Air Bud (1997) (Disney), and two TV miniseries for Hallmark Entertainment, Roughing It (2002) and Icon (2005). He also wrote and directed the feature film, The Snow Walker (2003), for Lion's Gate Films, based on a story by Farley Mowat (Never Cry Wolf (1983)), which marked a return to the Arctic for Smith. He then wrote and directed the feature film Stone of Destiny (2008), for Infinity Features and Odeon Sky, the true story of four young Scottish students who broke into Westminster Abbey in London to take back a sacred Scottish relic. The film stars Charlie Cox, Kate Mara and Robert Carlyle, and was nominated for Best Picture by the Scottish BAFTAS. He now resides in Canada and continues to add to production, directing, acting, and writing credits in a career that has spanned over 35 years. His next film, Dolphin Tale (2011), for Alcon (The Blind Side (2009)) and Warner Brothers, which he also wrote and directed, stars Harry Connick Jr., Ashley Judd, Morgan Freeman, and Winter, the dolphin, who plays herself in the film. The movie is scheduled to be released Sept. 23, 2011 by WB.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDMxMDk2M15BMl5BanBnXkFtZTcwMzcxODYzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001747","name":"Charles Martin Smith","idIMDB":"nm0001747"},"actorId":"nm0001747","character":"Mark Shermin","urlCharacter":"http://www.imdb.com/character/ch0028237","main":true},{"actorName":"Richard Jaeckel","urlProfile":"http://www.imdb.com/name/nm0001395","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNDk3OTkxOV5BMl5BanBnXkFtZTcwNjY0MjYwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1926","placeOfBirth":" Long Beach, Long Island, New York, USA","birthName":"Richard Hanley Jaeckel","height":"5' 7\" (1.7 m)","bio":"Stocky tough-guy character actor Richard Jaeckel remains one of Hollywood's most prolific supporting stars. Born in Long Island, New York, on October 10, 1926, Jaeckel's family moved to Los Angeles when he was still in his teens. After graduation from Hollywood High School, Jaeckel was discovered by a casting director while working as a mailboy for 20th Century-Fox. Although he had some reluctance to act, Jaeckel accepted a key part in the war epic Guadalcanal Diary (1943) and remained in films for over 50 years, graduating from playing baby-faced teenagers (like Dick Clark, Jaeckel never seemed to age) to gunfighters and hired killers with ease. From 1944-48 he served in the US Navy, and after his discharge he co-starred in Sands of Iwo Jima (1949) with John Wayne. Jaeckel's other notable roles in films include one of a trio of GIs accused of raping a German girl in Town Without Pity (1961)--a standout performance--and The Dirty Dozen (1967) as tough MP Sgt. Clyde Bowren, who goes along on the mission to keep an eye on the prisoners he's trained, a role he reprised in a made-for-TV sequel in 1985. Jaeckel also received an Academy Award nomination as Best Supporting Actor for his funny but tragic performance in Sometimes a Great Notion (1970). Although he appeared in over 70 films, he was very active in television series such as Frontier Circus (1961), Banyon (1971), Firehouse (1974), Salvage 1 (1979), At Ease (1983), Spenser: For Hire (1985) and Supercarrier (1988). From 1991-94 he played Lt. Ben Edwards on the hit series Baywatch (1989). He passed away after a three-year battle with melanoma cancer on June 14, 1997, at the Motion Picture and Television Hospital in Woodland Hills, California. Jaeckel was 70 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNDk3OTkxOV5BMl5BanBnXkFtZTcwNjY0MjYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001395","name":"Richard Jaeckel","nicknames":["Jake"],"idIMDB":"nm0001395"},"actorId":"nm0001395","character":"George Fox","urlCharacter":"http://www.imdb.com/character/ch0017383","main":true},{"actorName":"Robert Phalen","urlProfile":"http://www.imdb.com/name/nm0679606","urlPhoto":"","biography":{"dateOfBirth":"10 May 1937","placeOfBirth":" San Francisco, California, USA","bio":"Robert Phalen was born on May 10, 1937 in San Francisco, California, USA. He is an actor, known for Halloween (1978), Starman (1984) and Three Days of the Condor (1975).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0679606","name":"Robert Phalen","idIMDB":"nm0679606"},"actorId":"nm0679606","character":"Major Bell","urlCharacter":"http://www.imdb.com/character/ch0030103","main":true},{"actorName":"Tony Edwards","urlProfile":"http://www.imdb.com/name/nm0250415","urlPhoto":"","biography":{"height":"5' 10\" (1.78 m)","bio":"Tony Edwards is an actor, known for Starman (1984), Star Trek IV: The Voyage Home (1986) and Hot Shots! Part Deux (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0250415","name":"Tony Edwards","idIMDB":"nm0250415"},"actorId":"nm0250415","character":"Sergeant Lemon","urlCharacter":"http://www.imdb.com/character/ch0030624","main":true},{"actorName":"John Walter Davis","urlProfile":"http://www.imdb.com/name/nm0204897","urlPhoto":"","biography":{"dateOfBirth":"17 December 1951","placeOfBirth":" Los Angeles, California, USA","bio":"John Walter Davis was born on December 17, 1951 in Los Angeles, California, USA. He is an actor, known for Starman (1984), Altered States (1980) and Tango & Cash (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0204897","name":"John Walter Davis","idIMDB":"nm0204897"},"actorId":"nm0204897","character":"Brad Heinmuller","urlCharacter":"http://www.imdb.com/character/ch0032080","main":true},{"actorName":"Ted White","urlProfile":"http://www.imdb.com/name/nm0925500","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjVlMDMzODItMzQ0NC00MWRhLWE0MTAtNDJmNzgzYjU4NjY3XkEyXkFqcGdeQXVyNTAyNDQ2NjI@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 January 1926","placeOfBirth":" Texas, USA","height":"6' 4\" (1.93 m)","bio":"Ted White was born on January 25, 1926 in Texas, USA. He is known for his work on Gone in Sixty Seconds (2000), TRON (1982) and Major League (1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjVlMDMzODItMzQ0NC00MWRhLWE0MTAtNDJmNzgzYjU4NjY3XkEyXkFqcGdeQXVyNTAyNDQ2NjI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0925500","name":"Ted White","idIMDB":"nm0925500"},"actorId":"nm0925500","character":"Deer Hunter","urlCharacter":"http://www.imdb.com/character/ch0033594","main":true},{"actorName":"Dirk Blocker","urlProfile":"http://www.imdb.com/name/nm0088781","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWUyOGM1NjYtMDE5Mi00ZTRiLTlmNTUtZWZkOGZmNjM5YmZkL2ltYWdlXkEyXkFqcGdeQXVyNDExMDM5Mjk@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1957","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Dennis Dirk Blocker","height":"5' 7\" (1.7 m)","bio":"Dirk Blocker was born on July 31, 1957 in Hollywood, Los Angeles, California, USA as Dennis Dirk Blocker. He is an actor, known for Brooklyn Nine-Nine (2013), Poltergeist (1982) and Starman (1984). He has been married to Danielle Aubuchon since November 3, 1990.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWUyOGM1NjYtMDE5Mi00ZTRiLTlmNTUtZWZkOGZmNjM5YmZkL2ltYWdlXkEyXkFqcGdeQXVyNDExMDM5Mjk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0088781","name":"Dirk Blocker","idIMDB":"nm0088781"},"actorId":"nm0088781","character":"Cop #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"M.C. Gainey","urlProfile":"http://www.imdb.com/name/nm0301370","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTYyOTM1Njc1N15BMl5BanBnXkFtZTcwOTQwMzgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 January 1948","placeOfBirth":" Jackson, Mississippi, USA","birthName":"Mike Connor Gainey","height":"6' 2½\" (1.89 m)","bio":"M.C. Gainey was born on January 18, 1948 in Jackson, Mississippi, USA as Mike Connor Gainey. He is an actor, known for Tangled (2010), Django Unchained (2012) and Beerfest (2006). He has been married to Kim since May 2, 2002.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTYyOTM1Njc1N15BMl5BanBnXkFtZTcwOTQwMzgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0301370","name":"M.C. Gainey","idIMDB":"nm0301370"},"actorId":"nm0301370","character":"Cop #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sean Stanek","urlProfile":"http://www.imdb.com/name/nm0822119","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjIyMDU4MDA2MV5BMl5BanBnXkFtZTgwMzg1MTM3MDE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"bio":"As a young man Sean was raised in the circus as an acrobat. He belonged to The Seven Alexander's teeterboard act, his father and mother served as the founders of the group. Sean having lived a storybook childhood managed to take this experience into the realm of storytelling. After retiring from the circus he became an actor and worked for many years in film and television In Los Angeles. Along with an actors sensibility his motivation to delve into the truth of what he directs is what he continually strives for in his work with actors. Sean comes from the feature film world where he directed his first feature film after being inspired by James Cameron while working with Mr. Cameron as a VFX coordinator on \"Titanic.\" Sean's first film, \" A Crack in the Floor\" which he wrote and co-directed, stars Gary Busey and Mario Lopez. He wrote, directed and operated as DP on his second film , \"Played\" for Lions Gate Films. \"PLAYED\", featured a star studded cast, Val Kilmer, Gabriel Bryne ,Vinnie Jones, and Bruno Kirby. Sean won Best Screenplay for \"Played\" at the Malibu Film Festival in 2007. Being a tech geek Sean served as motion capture producer for Sony Imageworks on \"Monster House\" and Robert Zemeckis', \"Beowulf.\" Sean, inspired and challenged by the growing technology went on to direct motion capture performance cinematics and voice over on the following triple \"A\" title video games for Xbox360, PS3 and PS Vita games; Splinter Cell: Conviction, Infamous 2, Unit 13. He also technical directed the Uncharted series for PS3 as well as Killzone 3 and Socom's Navy Seals games to mention a few. He continues to direct in this medium. Sean is always seeking new opportunities to tell stories by not limiting himself to one medium.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjIyMDU4MDA2MV5BMl5BanBnXkFtZTgwMzg1MTM3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0822119","name":"Sean Stanek","idIMDB":"nm0822119"},"actorId":"nm0822119","character":"Hot Rodder","urlCharacter":"http://www.imdb.com/character/ch0041222","main":true},{"actorName":"George 'Buck' Flower","urlProfile":"http://www.imdb.com/name/nm0002668","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjcyNTU0MDI5NF5BMl5BanBnXkFtZTcwOTI1MzYyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 October 1937","placeOfBirth":" Milton-Freewater, Oregon, USA","bio":"There aren't many actors who can claim that they appeared in everything from innocuous family features to sexy soft-core smut to popular television programs to various horror, science fiction, and exploitation movies as well as worked behind-the-scenes on a slew of films in assorted production capacities throughout the course of their careers. The exceptionally talented and versatile George \"Buck\" Flower did all this and more during a remarkably busy, diverse, and impressive career that spanned 35 years and over a 100 movies as a character actor alone. Flower was born on October 28, 1937, in the Blue Mountains of Eastern Oregon. He enlisted in the army as a teenager and enrolled at Eastern Oregon College following his military service. Flower then moved to California and attended Pasadena City College. He soon became a member of the repertory theater group The Inspiration Players and stayed with the group for twelve years. The theater company toured Alaska and all 48 continental United States. Flower first started acting in movies in the early 1970s in the blithely lowbrow soft-core outings Country Cuzzins (1970), Below the Belt (1971), and The Dirty Mind of Young Sally (1973) for legendary trash flick filmmaker Harry H. Novak. Portly and grizzled, with a rumpled face, a scraggly beard, an engagingly rough-around-the-edges demeanor, and a deep, thick, heavy drawling rumble of a throaty voice, Flower was often cast as grubby bums, sloppy drunks, grouchy old guys, and scruffy rednecks. Among the notable directors Flower appeared in countless films for are Matt Cimber, Jim Wynorski, Don Edmonds (he's in the first two notoriously nasty \"Ilsa\" movies acting under the alias C.D. LaFleure), William Lustig, Bill Rebane, David DeCoteau, Bethel Buckalew, Jack Starrett, Nick Phillips, Anthony Hickox, and Fred Olen Ray. Flower achieved his greatest popularity with his terrific contributions to a handful of John Carpenter features: he's an ill-fated fisherman in The Fog (1980); a bum in Escape from New York (1981); a crusty cook in Starman (1984); excellent as the rags-to-riches bum Drifter in They Live (1988); another bum in the \"Unleaded\" segment of the horror anthology Body Bags (1993); and a boozy high school janitor in Village of the Damned (1995). Flower's other memorable roles include the cantankerous forest-dwelling hermit Boomer in the \"Wilderness Family\" pictures, a detective in The Witch Who Came from the Sea (1976), a corrupt vice cop in The Candy Tangerine Man (1975), a machete-brandishing lunatic in Drive In Massacre (1976), an irascible old coot in Relentless (1989), a senile janitor in Sorority Babes in the Slimeball Bowl-O-Rama (1988), the stern patriarch of a mountain family in Pumpkinhead (1988), a grouchy handyman in Cheerleader Camp (1988), a gregarious railroad worker in The Alpha Incident (1978), a homeless man on a park bench in Back to the Future (1985) (Flower reprised this part in the first sequel), an ill-kept hick in A Small Town in Texas (1976), a peppery camp caretaker in Berserker (1987) and a hillbilly hunter in Skeeter (1993). Flower had guest spots on the TV shows The Dukes of Hazzard (1979), Flo (1980), NYPD Blue (1993), ER (1994), and Dr. Quinn, Medicine Woman (1993). In addition to his substantial acting credits, Flower also was the casting director for The Witch Who Came from the Sea (1976) and Tiger Man (1983), served as a producer on such features as Hell's Belles (1995), Takin' It Off Out West (1995), The Night Stalker (1986), and Up Yours (1979), handled second unit director chores on The Lonely Lady (1983), Bare Knuckles (1977), and Teenage Innocence (1973), and even co-wrote the scripts for such movies as Wooly Boys (2001), Party Plane (1991), Death Falls (1991), In Search of a Golden Sky (1984), Joyride to Nowhere (1977), Drive In Massacre (1976), and Teenage Seductress (1975). He's the father of actress/costume designer Verkina Flower. George \"Buck\" Flower died of cancer at age 66 on June 18, 2004. Although the \"Buck\" may have sadly stopped, George \"Buck\" Flower's extraordinary cinematic legacy shall continue to live on and entertain film fans all over the world for all eternity. Author: woodyanders","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjcyNTU0MDI5NF5BMl5BanBnXkFtZTcwOTI1MzYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002668","name":"George 'Buck' Flower","nicknames":["Buck"],"idIMDB":"nm0002668"},"actorId":"nm0002668","character":"Cook","urlCharacter":"http://www.imdb.com/character/ch0261082","main":true},{"actorName":"Russ Benning","urlProfile":"http://www.imdb.com/name/nm0072161","urlPhoto":"","biography":{"bio":"Russ Benning is an actor, known for Starman (1984).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0072161","name":"Russ Benning","idIMDB":"nm0072161"},"actorId":"nm0072161","character":"Scientist","urlCharacter":"http://www.imdb.com/character/ch0261090","main":true},{"actorName":"Ralph Cosham","urlProfile":"http://www.imdb.com/name/nm0181851","urlPhoto":"","biography":{"dateOfBirth":"1936","placeOfBirth":"","bio":"Ralph Cosham was born in 1936. He was an actor, known for The Elder Scrolls IV: Oblivion (2006), Starman (1984) and The Pelican Brief (1993). He died on September 30, 2014 in Reston, Virginia, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0181851","name":"Ralph Cosham","idIMDB":"nm0181851"},"actorId":"nm0181851","character":"Marine Lieutenant","urlCharacter":"http://www.imdb.com/character/ch0045287","main":true},{"actorName":"David Wells","urlProfile":"http://www.imdb.com/name/nm0920169","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MDM0NzgyMF5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1951","placeOfBirth":" USA","bio":"David Wells, actor in Los Angeles for 35 years, is known for his varied and eccentric characters, whether it be the recent recurring Father Pete, the pedophile priest on Shameless, to the time traveling Mr. Quiche opposite Jeff Daniels in The Grand Tour, to the grave-digging Milton in House. Buffy the Vampire Slayer fans know him as the iconic \"cheese man\" character. A veteran of over 50 films and 100 plus television appearances, career highlights include George C. Scott and Jack Lemmon's Inherit The Wind, Michael Douglas' Basic Instinct, and Eddie Murphy's Beverly Hills Cop. Wells is also a film and theatre producer. He produced and starred in the feature film, Elephant Sighs, co-starring Ed Asner. For several years, Wells co-owned the Third Stage Theatre in Burbank, where he co-produced several theatre productions and housed many of famed playwright Justin Tanner's comedies. As an acting teacher, Wells has taught such students as Tobey Maguire, Mila Kunis, Jenna Elfman, Gage Golightly, Brighid Fleming, R.J. Mitte, etc.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MDM0NzgyMF5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0920169","name":"David Wells","idIMDB":"nm0920169"},"actorId":"nm0920169","character":"Fox's Assistant","urlCharacter":"http://www.imdb.com/character/ch0044704","main":true}],"seasons":[],"idIMDB":"tt0088172","urlIMDB":"http://www.imdb.com/title/tt0088172","business":{"budget":{"money":"$22,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"AUD","country":"1,035,000","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1984/\">1984</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 55 min (115 min)"],"soundMix":["70 mm 6-Track (70 mm prints)","Dolby (35 mm prints)"],"color":["Color (Metrocolor)"],"aspectRatio":["2.20 : 1 (70 mm prints)","2.35 : 1"],"camera":["Lenses and Panaflex Cameras by Panavision"],"laboratory":["MGM Laboratories Inc., Culver City (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm","70 mm (blow-up)"]},"rating":"7.0","metascore":"71","filmingLocations":[{"location":"Manchester, Tennessee, USA"}],"rated":"PG","awards":[{"award":"Academy Awards, USA 1985","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Actor in a Leading Role","names":[{"name":"Jeff Bridges","id":"nm0000313","role":null}]}]}]},{"award":"Golden Globes, USA 1985","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Performance by an Actor in a Motion Picture - Drama","names":[{"name":"Jeff Bridges","id":"nm0000313","role":null}]},{"category":"Best Original Score - Motion Picture","names":[{"name":"Jack Nitzsche","id":"nm0006217","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1985","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best Actor","names":[{"name":"Jeff Bridges","id":"nm0000313","role":null}]}]},{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Science Fiction Film","names":[]},{"category":"Best Actress","names":[{"name":"Karen Allen","id":"nm0000261","role":null}]}]}]},{"award":"Young Artist Awards 1986","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Family Motion Picture Drama","names":[]}]}]}],"votes":"34,702","type":"Movie","companyCreditsSimple":[{"idCompany":"co0050868","name":"Columbia Pictures Corporation"},{"idCompany":"co0072491","name":"Industrial Light & Magic (ILM)"},{"idCompany":"co0042549","name":"Delphi II Productions"}],"keywords":{"keywords":["alien","spacecraft","arizona","wisconsin","crater","widow","escape","message","scientist","outer space","seti","military","army","road trip","cigar","dying","running","violence","sex scene","human alien","kiss","target practice","small town","bittersweet","lightning","rainstorm","heavy rain","shape shifting alien","wallet","rescue","urination","black comedy","hunter","long take","gas bomb","fugitive","on the run","bilingualism","revenge","rifle","beating","punched in the chest","punched in the face","brawl","fight","character's point of view camera shot","subjective camera","photo album","fireplace","pay phone","corpse","wrench","surrealism","car crash","trucker","car chase","police chase","dumb police","trailer home","police officer","soldier","u.s. army","singing in a car","car radio","flask","cook","map","news report","infertility","miracle","marble","baby","indian reservation","native american","deception","decoy","watching tv","norad","bus","sergeant","major","general","slot machine","missile","fighter jet","forest fire","woods","forest","resurrection","back from the dead","christ allegory","one word title","fear","tragic ending","race against time","tearjerker","fire","exploding truck","explosion","crash landing","home movie","photograph","deoxyribonucleic acid","home invasion","supernatural power","shape shifting","suspense","vinyl","orb","flying saucer","alien contact","ufo","white house","washington d.c.","senator","politician","cigar smoking","laboratory","sheriff","state trooper","impersonation","held at gunpoint","desert","male rear nudity","bare butt","shot in the back","pistol","machine gun","shotgun","deer","waitress","pickup truck","truck stop","southern accent","redneck","american midwest","fish out of water","product placement","1980s","cult director","voyager spacecraft","voyager golden record","male full back nudity","bare chested male","social commentary","driving","road movie","first contact","cherry pie","electronic music score","sex with alien","police","male nudity","cigarette smoking","restroom","police car","motel","gas station","fistfight","diner","dead animal","car accident","apple pie","las vegas nevada","obscene finger gesture","train","roadblock","grief","healing gift","chase","helicopter","hitchhiking","riding a freight train","surprise ending","kissing while having sex","american muscle","saturn the planet","cult film","tv"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 16:11:42"}}