{"data":{"movies":[{"title":"The Arrival","originalTitle":"","year":"1991","releaseDate":"199104","directors":[{"name":"David Schmoeller","id":"nm0227187"}],"writers":[{"name":"Kevin Daniel Ljoka","id":"nm0515531"}],"runtime":"103 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGFlZmU4MDYtZWUwZS00MzJhLWFkNDgtMDU0NmU4NzBiN2UyXkEyXkFqcGdeQXVyMTEyMDcwNw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Sci-Fi"],"plot":"When an old man witnesses a strange meteor land, he finds himself growing younger, but his renewed youth has a price; he must kill or die. He is a vampire, but it is not blood he needs to satisfy his cravings. A series of murders in which several women are brutally slain leads the police on a confusing chase across several states.","simplePlot":"An old man, who has been near a fallen meteor, starts to get younger and younger, with a terrible thirst for blood.","actors":[{"actorName":"John Saxon","urlProfile":"http://www.imdb.com/name/nm0768334","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjE1NTk3Ml5BMl5BanBnXkFtZTcwOTAzMjg0NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 August 1935","placeOfBirth":" Brooklyn, New York, USA","birthName":"Carmine Orrico","height":"5' 10½\" (1.79 m)","bio":"John Saxon has appeared in nearly 200 roles in the movies and on television in a more-than half-century-long career that has stretched over seven decades since he made his big screen debut in 1954 in uncredited small roles in It Should Happen to You (1954) and George Cukor's A Star Is Born (1954). Born Carmine Orrico on August 5, 1936 in Brooklyn, New York, the son of Italian immigrants Antonio Orrico and Anna (née Protettore), he studied acting with Stella Adler after graduating from New Utrecht High School. He was discovered by talent agent Henry Willson, the man most famous for creating and representing Rock Hudson (as well as a stable of \"beefcake\" male stars and starlets), who signed him up after he saw Saxon's picture on the cover of a magazine. Willson brought the 16-year-old to Southern California, changed his name to John Saxon, and launched his career. Saxon made his television debut on Richard Boone's series Medic (1954) in 1955 and got his first substantial (and credited) role in Running Wild (1955), playing a juvenile delinquent. In the Esther Williams vehicle The Unguarded Moment (1956) (one of her rare dramatic roles), the film's marketing campaign spotlighted him, trumpeting the movie as \"Co-starring the exciting new personality John Saxon.\". By 1958, he seemed to have established himself as a supporting player in A-List pictures, being featured in Blake Edwards's comedy This Happy Feeling (1958) headlined by Debbie Reynolds and Vincente Minnelli's The Reluctant Debutante (1958) with Rex Harrison and Sandra Dee. In the next five years, he worked steadily, including supporting roles in John Huston's The Unforgiven (1960), the James Stewart comedy Mr. Hobbs Takes a Vacation (1962) and Otto Preminger's The Cardinal (1963) while having first billing in the B-movies Cry Tough (1959) and War Hunt (1962). Fluent in Italian, he made his first pictures in Italy in the period, Agostino (1962) and Mario Bava's Evil Eye (1963). Despite his good work with major directors, he failed to succeed as a star. By 1965, he was appearing in the likes of Blood Beast from Outer Space (1965), albeit, top-billed. A more emblematic picture was Sidney J. Furie's The Appaloosa (1966), in which he appeared in Mexican bandito drag as the man who steals the horse of Marlon Brando, another Stella Adler student. The \"ethnic-looking\" Saxon would reprise the role, of sorts, in John Sturges Joe Kidd (1972) in support of superstar Clint Eastwood. In those less politically correct times, many an Italian-American with a dark complexion would be relied on to play Mexicans, Native Americans and other \"exotic\" types like Mongols. Saxon played everything from an Indian chief on Bonanza (1959) to Marco Polo on The Time Tunnel (1966). From 1969 to 1972 season, he was a star of the television series The Bold Ones: The New Doctors (1969), playing the brilliant surgeon Theodore Stuart. When the series ended, he took one of his most famous roles when Bruce Lee demurred over casting Rod Taylor as he was too tall. A black belt in karate, Saxon appeared as Roper in Opération dragon (1973). He has continued to play a wide variety of roles on television and in motion pictures ever since.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjE1NTk3Ml5BMl5BanBnXkFtZTcwOTAzMjg0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0768334","name":"John Saxon","idIMDB":"nm0768334"},"actorId":"nm0768334","character":"Agent Mills","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joseph Culp","urlProfile":"http://www.imdb.com/name/nm0191679","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NTA1NTYxN15BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 January 1963","placeOfBirth":" Los Angeles, California, USA","bio":"Actor and filmmaker Joseph Culp was born in Los Angeles, the son of actor Robert Culp. He began acting in school plays at the age of nine. He trained as an actor in both New York and Los Angeles under various teachers, including Stella Adler, Herbert Berghof, Uta Hagen, Arthur Sherman, Kenneth MacMillan and John Lehne. Joseph Culp has been working in theatre, film and television since 1982. He recently produced, directed, co-wrote and co-starred in the feature film Welcome to the Men's Group (2016) which stars Timothy Bottoms and Stephen Tobolowsky. He also produced and co-starred in the short Voice of Life (2013) by Norwegian director Knut Erik Jensen. Culp produced and starred in the award-winning feature film, The Reflecting Pool (2008), the first investigative drama to challenge the official story of 9/11. Directed by Jarek Kupsc. Joseph Culp won international critical acclaim for his performance in Hunger (2001), an adaptation of Nobel laureate Knut Hamsun's 1890 masterpiece, written and directed by Maria Giese. In \"Hunger\" Culp co-produced and stars as \"Charlie Pontus\", a lonely screenwriter living on the brink of physical and spiritual starvation in Los Angeles. At the San Francisco IndieFest \"Hunger\" film received \"Pick of the Pack\" from the San Francisco Examiner, saying, \"Joseph Culp's agreeable performance makes this one a champion!\" SF Indie Fest wrote, \"Joseph Culp's exquisitely naked performance and writer/director Giese ragged, guerrilla-video style add immeasurably to the bracing austerity of the film charging it with all the primitive beauty of an ancient Russian icon painting\". Hunger (2001) is the first digital film made of a classic work of literature, the first American version of a Knut Hamsun novel, and was shot guerrilla-style on the streets of Los Angeles on a budget not exceeding $10,000. \"Hunger\" won Best Feature at the 2007 Moondance International Film Festival and Best Underground Film at the 2007 FAIF Festival. Culp's other film credits include starring roles in Alan J. Pakula's Dream Lover (1986), Monte Hellman's Iguana (1988), The Arrival (1991), the lead in the action thriller Assault on Dome 4 (1996) Culp is known to comic fans as the first actor ever to play \"Doctor Doom\" in the first film version of Marvel Comics' series The Fantastic Four (1994). He co-starred with Laurie Metcalf in The Secret Life of Houses (1994) on PBS, and for Mexican director María Novaro' (Danzón (1991)) in her tale of Mexican border life, Le jardin de l'Eden (1994). He co-starred with John Savage in the sci-fi film Firestorm (1997) and was featured in HBO's Full Eclipse (1993), Ron Howard's Apollo 13 (1995), Mario Van Peebles' Baadasssss! (2003), and Panther (1995) and the western Los Locos (1997). He appeared with Mia Kirshner, Jean-Hugues Anglade and Connie Nielsen in the noir-thriller Innocents (2000), directed by Gregory Marquette, and starred opposite Ray Wise and Sonya Smith in the award-winning sci-fi comedy Cyxork 7 (2006), directed by John Huff. His many television appearances include House (2004) ER (1994), Star Trek: Deep Space Nine (1993), Highway to Heaven (1984) and movies-for-TV such as Project: Tinman (1990), Blue Bayou (1990) and A Doctor's Story (1984). He co-starred with Richard Thomas in Hallmark's Wild Hearts (2006). Culp notably appeared in a recurring role as \"Archie Whitman\", the depression-era father of Jon Hamm's \"Don Draper\" in the critically acclaimed AMC series Mad Men (2007). Joseph Culp directed the short film \"Traces\" (2011) which held premieres at Nordkapp Film Festival in Norway, Palm Springs International ShortFest, Tucson Film & Music Festival, and Hollywood Film festival. In addition to working in film and television, Joseph Culp has continued a commitment to the theater. In 2004, he starred in the New York stage premiere of \"Foul Shots\", by Raymond J. Barry and Barry's \"Awake in a World That Encourages Sleep\" (2011-2012) in both New York and Los Angeles. Theatre credits include \"Summer and Smoke\", directed by the late Kenneth MacMillan; opposite Ron Leibman in \"Children of Darkness\" at The Actor's Studio, and \"A Wilder Evening - Six Short Works by Thornton Wilder\", which he produced and directed and performed. He received a Drama Logue award for his performance as a rebel Irish coal miner in Jason Miller's \"Nobody Hears a Broken Drum\" in Los Angeles. Joseph Culp is the founder of the Los Angeles-based \"Walking Theatre Group/Workshop\" (since 1992) where he performs as an actor, writer and director as well as conducting ongoing research in the training and practice of the \"Walking-In-Your-Shoes\" transpersonal technique and its use in creative process. He co-founded the Walking-In-Your-Shoes body/mind technique WIYS, which combines aspects of intuitive movement and spontaneous empathy. The workshop is open to the public and supports theater and film artists developing new material. The script for the 9/11 feature, \"The Reflecting Pool\", was developed in the workshop. Joseph acted and directed his own adaptations of two short stories by Franz Kafka, \"The Judgment\" and \"In the Penal Colony\", which he performed with the Walking Theatre Group. He directed an evening with the Walking Theatre Group - \"Welcome to the Great Beyond\", where the audience participated in a public demonstration and exploration of the \"Walking-In-Your-Shoes\" transpersonal process. Joseph also directed group shows of new work from the Walking Theatre Workshop, \"Reclamation (series 1-5)\". \"Winter Walks\" and \"Food for Thought\". His original musical-play \"The Hound (An American Poem)\" about a spiritual journey on the Greyhound Bus was developed with the Walking Theatre Group at the Electric Lodge in Venice, CA. He is working on a book about the \"Walking\" technique for use in related workshops and groups. He is married to Lauren Culp and has two children, Jackson Culp and Sedona Culp.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NTA1NTYxN15BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0191679","name":"Joseph Culp","idIMDB":"nm0191679"},"actorId":"nm0191679","character":"Young Max Page","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robin Frates","urlProfile":"http://www.imdb.com/name/nm0292328","urlPhoto":"","biography":{"bio":"Robin Frates is an actress, known for Puppetmaster (1989), Man's Best Friend (1993) and The Arrival (1991).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0292328","name":"Robin Frates","idIMDB":"nm0292328"},"actorId":"nm0292328","character":"Connie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Sampson","urlProfile":"http://www.imdb.com/name/nm0760203","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2ODg4ODgyMV5BMl5BanBnXkFtZTgwNzMyMTM0MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 May 1933","placeOfBirth":" Los Angeles, California, USA","birthName":"Robert Leroy Sampson","bio":"Robert Sampson was born on May 10, 1933 in Los Angeles, California, USA as Robert Leroy Sampson. He is an actor, known for Re-Animator (1985), The Dark Side of the Moon (1990) and Robot Jox (1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2ODg4ODgyMV5BMl5BanBnXkFtZTgwNzMyMTM0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0760203","name":"Robert Sampson","idIMDB":"nm0760203"},"actorId":"nm0760203","character":"Max Page","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Geoff Hansen","urlProfile":"http://www.imdb.com/name/nm0360800","urlPhoto":"","biography":{"bio":"Geoff Hansen was an actor and cinematographer, known for Miracles & Other Wonders (1992), Humble Pie (2007) and Silent Night, Deadly Night (1984). He died on April 2, 2015 in Layton, Utah, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0360800","name":"Geoff Hansen","idIMDB":"nm0360800"},"actorId":"nm0360800","character":"Clark","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danna Garen","urlProfile":"http://www.imdb.com/name/nm0307206","urlPhoto":"","biography":{"bio":"Danna Garen is an actress, known for The Arrival (1991), Killing Time (1984) and Tomboy (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0307206","name":"Danna Garen","idIMDB":"nm0307206"},"actorId":"nm0307206","character":"Susan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danny Fendley","urlProfile":"http://www.imdb.com/name/nm0271748","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NzY3NjU3NF5BMl5BanBnXkFtZTcwNjgwNzQzMQ@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"bio":"Danny Fendley is an actor and producer, known for Buy Sell Kill: A Flea Market Story (2004), Demolition Highway (1996) and Compelling Evidence (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NzY3NjU3NF5BMl5BanBnXkFtZTcwNjgwNzQzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0271748","name":"Danny Fendley","idIMDB":"nm0271748"},"actorId":"nm0271748","character":"Jeff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ami Rothschild","urlProfile":"http://www.imdb.com/name/nm0745280","urlPhoto":"","biography":{"bio":"Ami Rothschild is known for her work on The Arrival (1991), Lookwell (1991) and We All Fall Down (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0745280","name":"Ami Rothschild","idIMDB":"nm0745280"},"actorId":"nm0745280","character":"Sunny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kim Sill","urlProfile":"http://www.imdb.com/name/nm0206174","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNDcyODg3Ml5BMl5BanBnXkFtZTcwNDI0MTUwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 December 1963","placeOfBirth":" Tifton, Georgia, USA","birthName":"Kimberly Dawn Dawson","height":"5' 8\" (1.73 m)","bio":"Kim Sill was born on December 8, 1963 in Tifton, Georgia, USA as Kimberly Dawn Dawson. She is an actress and producer, known for Sexual Intrigue (2000), Maui Heat (1996) and Carnal Fate (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNDcyODg3Ml5BMl5BanBnXkFtZTcwNDI0MTUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0206174","name":"Kim Sill","idIMDB":"nm0206174"},"actorId":"nm0206174","character":"Leslie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Amy Lemmon","urlProfile":"http://www.imdb.com/name/nm1824963","urlPhoto":"","biography":{"bio":"Amy Lemmon is an actress, known for The Arrival (1991).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1824963","name":"Amy Lemmon","idIMDB":"nm1824963"},"actorId":"nm1824963","character":"Tina","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Bach","urlProfile":"http://www.imdb.com/name/nm0045320","urlPhoto":"","biography":{"bio":"Jason Bach is an actor, known for The Arrival (1991).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0045320","name":"Jason Bach","idIMDB":"nm0045320"},"actorId":"nm0045320","character":"Dr. Johnson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brad Mills","urlProfile":"http://www.imdb.com/name/nm0589927","urlPhoto":"","biography":{"bio":"Brad Mills is an actor, known for The Arrival (1991).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0589927","name":"Brad Mills","idIMDB":"nm0589927"},"actorId":"nm0589927","character":"Michael","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stuart Gordon","urlProfile":"http://www.imdb.com/name/nm0002340","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzOTU4ODExOV5BMl5BanBnXkFtZTYwMjkwMTE0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 August 1947","placeOfBirth":" Chicago, Illinois, USA","bio":"Stuart Gordon started his film directing career in 1985. After graduating from Lane Technical High School, Gordon worked as a commercial artist apprentice prior to enrolling at the University of Wisconsin in Madison. Unable to get into the film classes, he enrolled in an acting class and ended up majoring in theater. In 1968, he directed a psychedelic adaptation of Peter Pan as a political satire. He was arrested on obscenity charges and Gordon dropped out of the university. He and his wife Carolyn formed the Organic Theater and moved the group to Chicago. The Organic performed their work on and off-Broadway, in Los Angeles, and toured Europe. Among their productions were the world premiere of David Mamet's \"Sexual Perversity in Chicago,\" which launched Mamet's playwriting career, the improv-based comedy \"Bleacher Bums,\" which ran for over ten years in Los Angeles, and the hospital comedy E/R (1984), which became a TV series produced by Norman Lear. He joined with Brian Yuzna and Charles Band's Empire Pictures to create the company's first major hit, Re-Animator (1985), based on the story by H.P. Lovecraft, which won a Critics' Prize at the Cannes Film Festival. Gordon then helmed another Lovecraft adaptation From Beyond (1986) and tackled the murderous Dolls (1987) followed by Robot Jox (1989). Gordon co-created the story for Honey, I Shrunk the Kids (1989) a major hit for Disney. The same year, he directed the remake and more graphic version of The Pit and the Pendulum (1991). Other works include Fortress (1992), and the screenplay for The Dentist (1996) and Body Snatchers (1993), which he co-wrote with long-time writing partner Dennis Paoli. In 2001, Gordon returned to the H.P. Lovecraft territory with Dagon (2001), and in 2003, directed King of the Ants (2003) about a housepainter-turned-hit man, and brought the David Mamet play Edmond (2005) to the screen. He contributed to the horror anthology series Masters of Horror (2005) with the episode \"Dreams in the Witch House,\" based on a short story by H.P. Lovecraft. He returned to the series in 2007 with the episode \"The Black Cat,\" based on Edgar Allan Poe's story. And in 2008, he directed \"Eater\" for the NBC series Fear Itself (2008). He is also known for frequently murdering his wife, actress 'Carolyn Purdy-Gordon' in many of his films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzOTU4ODExOV5BMl5BanBnXkFtZTYwMjkwMTE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002340","name":"Stuart Gordon","idIMDB":"nm0002340"},"actorId":"nm0002340","character":"Biker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dean Minerd","urlProfile":"http://www.imdb.com/name/nm0591177","urlPhoto":"","biography":{"bio":"Dean Minerd is a producer and actor, known for The Real Housewives of Orange County (2006), Yo Momma (2006) and Camp Out (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0591177","name":"Dean Minerd","idIMDB":"nm0591177"},"actorId":"nm0591177","character":"Hank","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Brochtrup","urlProfile":"http://www.imdb.com/name/nm0110514","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0ODcwNzY1Nl5BMl5BanBnXkFtZTcwNjk3MzI3OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 March 1963","placeOfBirth":" Inglewood, California, USA","birthName":"William Brochtrup","height":"6' 1½\" (1.87 m)","bio":"Bill Brochtrup was raised in Tacoma, Washington, attending New York University's Tisch School of the Arts and NYU. he has proven his acting talent in a variety of roles on TV, film and on the stage. His first television role was in the series Hot Pursuit (1984) and he went on to appear in such series as Dharma & Greg (1997), Picket Fences (1992) and Murder, She Wrote (1984). Bill's movie credits include Vorace (1999), in which he starred opposite Robert Carlyle and Guy Pearce. He was originally cast for just two episodes of NYPD Blue (1993) during the show's second season. However, when his splendid portrayal of \"P.A.A. John Irvin\" won over the show's producers and audience alike, he was invited to reprise the very same role in comedy series Public Morals (1996). In 1998, Bill returned to \"NYPD Blue\" as Irvin, who continues to be a much-loved character.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0ODcwNzY1Nl5BMl5BanBnXkFtZTcwNjk3MzI3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0110514","name":"Bill Brochtrup","idIMDB":"nm0110514"},"actorId":"nm0110514","character":"Ace","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0099059","urlIMDB":"http://www.imdb.com/title/tt0099059","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"14","month":"02","year":"1990","remarks":null},null],"copyrightHolder":"© 1990 Del Mar Entertainment"},"technical":{"runtime":["1 hr 43 min (103 min) (Canada)"],"soundMix":["Ultra Stereo"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["FotoKem Laboratory, Burbank (CA), USA (processing)"],"filmLength":null,"negativeFormat":null,"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"4.1","filmingLocations":[{"location":"Fallbrook, California, USA"}],"rated":"R","awards":[{"award":"Mystfest 1991","titlesAwards":[{"titleAwardOutcome":"Nominated Best Film","categories":[{"category":"","names":[{"name":"David Schmoeller","id":"nm0227187","role":null}]}]}]}],"votes":"230","type":"Movie","companyCreditsSimple":[{"idCompany":"co0231763","name":"Rapid Film Group"},{"idCompany":"co0026344","name":"Del Mar Entertainment"}],"keywords":{"keywords":["old man","blood","vampire","outer space","estrogen","comet","drug","stakeout","parrot","trailer park","nightclub","prostitute","pimp","grandfather grandson relationship","san diego california","nurse","motorcycle","library","agent","fbi","nightmare","robbery","father son relationship","cult director","alien","pepsi","pepsi cola","independent film","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:33:36"}}