{"data":{"movies":[{"title":"Opération dragon","originalTitle":"Enter the Dragon","year":"1973","releaseDate":"19730819","directors":[{"name":"Robert Clouse","id":"nm0167195"}],"writers":[{"name":"Michael Allin","id":"nm0021363"}],"runtime":"102 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDczMzAwNzAtMzY2My00NmNkLThjYjgtYjI2ZTAzYmUxMzhjXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","countries":["Hong Kong","USA"],"languages":["English","Cantonese"],"genres":["Action","Crime","Drama","Thriller"],"plot":"Enter the Dragon revolves around the three main characters. Lee, a man recruited by an agency to investigate a tournament hosted by Han, since they believe he has an Opium trade there. Roper and Williams are former army buddies since Vietnam and they enter the tournament due to different problems that they have. Roper is on the run from the Mafia due to his gambling debts, while Williams is harassed by racist police officers and defends himself from them and uses the car for his getaway. It is a deadly tournament that they will enter on an island. Lee's job is to get the other two out of there alive.","simplePlot":"A martial artist agrees to spy on a reclusive crime lord using his invitation to a tournament there as cover.","actors":[{"actorName":"Bruce Lee","urlProfile":"http://www.imdb.com/name/nm0000045","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMTg4NDkzMV5BMl5BanBnXkFtZTYwMjU4Nzc2._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 November 1940","placeOfBirth":" San Francisco, California, USA","birthName":"Lee Jun Fan","height":"5' 7½\" (1.71 m)","bio":"Bruce Lee remains the greatest icon of martial arts cinema and a key figure of modern popular media. Had it not been for Bruce Lee and his movies in the early 1970s, it's arguable whether or not the martial arts film genre would have ever penetrated and influenced mainstream North American and European cinema and audiences the way it has over the past four decades. The influence of East Asian martial arts cinema can be seen today in so many other film genres including comedies, action, drama, science fiction, horror and animation.....and they all have their roots in the phenomenon that was Bruce Lee. Lee was born \"Lee Jun Fan\" November twenty-seventh 1940 in San Francisco, the son of Lee Hoi Chuen, a singer with the Cantonese Opera. Approximately one year later the family returned to Kowloon in Hong Kong and at the age of five years, a young Bruce begins appearing in children's roles in minor films including The Birth of Mankind (1946) and Fu gui fu yun (1948). At the age of 12, Bruce commenced attending La Salle College. Bruce was later beaten up by a street gang, which inspired him to take up martial arts training under the tutelage of \"Sifu Yip Man\" who schooled Bruce in wing chun kung fu for a period of approximately five years. This was the only formalized martial arts training ever undertaken by Lee. The talented & athletic Bruce also took up cha-cha dancing and, at the age of 18, won a major dance championship in Hong Kong. However, his temper and quick fists got him in trouble with the Hong Kong police on numerous occasions. His parents suggested that he head off to the United States. Lee landed in San Francisco's Chinatown in 1959 and worked in a close relative's restaurant. He eventually made his way to Seattle, Washington, where he enrolled at university to study philosophy and found the time to practice his beloved kung fu techniques. In 1963, Lee met Linda Lee Cadwell (aka Linda Emery) (later his wife) and also opened his first kung fu school at 4750 University Way. During the early half of the 1960s, Lee became associated with many key martial arts figures in the USA, including kenpo karate expert Ed Parker and tae kwon do master Jhoon Rhee. He made guest appearances at notable martial arts events including the Long Beach Nationals. Through one of these tournaments Bruce met Hollywood hair-stylist Jay Sebring who introduced him to T.V. producer William Dozier. Based on the runaway success of Batman (1966), Dozier was keen to bring the cartoon character of The Green Hornet to T.V. and was on the lookout for an East Asian actor to play the Green Hornet's sidekick, Kato. Around this time Bruce also opened a second kung fu school in Oakland, California and relocated to Oakland to be closer to Hollywood. Bruce's screen test was successful, and The Green Hornet (1966) starring Van Williams aired in 1966 with mixed success. His fight scenes were sometimes obscured by unrevealing camera angles, but his dedication was such that he insisted his character behave like a perfect bodyguard, keeping his eyes on whoever might be a threat to his employer except when the script made this impossible. The show was surprisingly terminated after only one season (twenty-six episodes), but by this time Lee was receiving more fan mail than the show's nominal star. He then opened a third branch of his kung fu school in Los Angeles and began providing personalized martial arts training to celebrities including film stars Steve McQueen and James Coburn as well as screenwriter Stirling Silliphant. In addition he refined his prior knowledge of wing chun and incorporated aspects of other fighting styles such as traditional boxing and Okinawan karate. He also developed his own unique style \"Jeet Kune Do\" (Way of the Intercepting Fist). Another film opportunity then came his way as he landed the small role of a stand over man named \"Winslow Wong\" who intimidates private eye James Garner in Marlowe (1969). Wong pays a visit to Garner and proceeds to demolish the investigator's office with his fists and feet, finishing off with a spectacular high kick that shatters the light fixture. With this further exposure of his talents, Bruce then scored several guest appearances as a martial arts instructor to blind private eye James Franciscus on the TV series Longstreet (1971). With his minor success in Hollywood and money in his pocket, Bruce returned for a visit to Hong Kong and was approached by film producer Raymond Chow who had recently started \"Golden Harvest\" productions. Chow was keen to utilize Lee's strong popularity amongst young Chinese fans, and offered him the lead role in The Big Boss (1971), (aka \"The Big Boss\", aka Fists Of Fury\"). In it, Lee plays a distant cousin coming to join relatives working at an ice house, where murder, corruption, and drug-running lead to his character's adventures and display of Kung-Fu expertise. The film was directed by Wei Lo, shot in Thailand on a very low budget and in terrible living conditions for cast and crew. However, when it opened in Hong Kong the film was an enormous hit. Chow knew he had struck box office gold with Lee and quickly assembled another script entitled The Chinese Connection (1972) (aka \"Fist Of Fury\", aka \"The Chinese Connection\"). The second film (with a slightly bigger budget) was again directed by Wei Lo and was set in Shanghai in the year 1900, with Lee returning to his school to find that his beloved master has been poisoned by the local Japanese karate school. Once again he uncovers the evil-doers and sets about seeking revenge on those responsible for murdering his teacher and intimidating his school. The film features several superb fight sequences and, at the film's conclusion, Lee refuses to surrender to the Japanese law and seemingly leaps to his death in a hail of police bullets. Once more, Hong Kong streets were jammed with thousands of fervent Chinese movie fans who could not get enough of the fearless Bruce Lee, and his second film went on to break the box office records set by the first! Lee then set up his own production company, Concord Productions, and set about guiding his film career personally by writing, directing and acting in his next film, The Way of the Dragon (1972) (aka \"Return of The Dragon\"). A bigger budget meant better locations and opponents, with the new film set in Rome, Italy and additionally starring hapkido expert Ing-Sik Whang, karate legend Robert Wall and seven-time U.S. karate champion Chuck Norris. Bruce plays a seemingly simple country boy sent to assist at a cousin's restaurant in Rome and finds his cousins are being bullied by local thugs for protection. By now, Lee's remarkable success in East Asia had come to the attention of Hollywood film executives and a script was hastily written pitching him as a secret agent penetrating an island fortress. Warner Bros. financed the film and also insisted on B-movie tough guy John Saxon starring alongside Lee to give the film wider appeal. The film culminates with another show-stopping fight sequence between Lee and the key villain, Han, in a maze of mirrors. Shooting was completed in and around Hong Kong in early 1973 and in the subsequent weeks Bruce was involved in completing overdubs and looping for the final cut. Various reports from friends and coworkers cite that he was not feeling well during this period and on July twentieth 1973 he lay down at the apartment of actress Betty Ting Pei after taking a head-ache tablet and was later unable to be revived. A doctor was called and Lee was taken to hospital by ambulance and pronounced dead that evening. The official finding was death due to a cerebral edema, caused by a reaction to the head-ache tablet. Fans world-wide were shattered that their virile idol had passed at such a young age, and nearly thirty thousand fans filed past his coffin in Hong Kong. A second, much smaller ceremony was held in Seattle, Washington and Bruce was laid to rest at Lake View Cemetary in Seattle with pall bearers including Steve McQueen, James Coburn and Dan Inosanto. Opération dragon (1973) was later released in the mainland United States, and was a huge hit with audiences there, which then prompted National General films to actively distribute his three prior movies to U.S. theatres... each was a box office smash. Fans throughout the world were still hungry for more Bruce Lee films and thus remaining footage (completed before his death) of Lee fighting several opponents including Dan Inosanto, Hugh O'Brian and Kareem Abdul-Jabbar was crafted into another film titled Le jeu de la mort (1978). The film used a look-alike and shadowy camera work to be substituted for the real Lee in numerous scenes. The film is a poor addition to the line-up and is only saved by the final twenty minutes and the footage of the real Bruce Lee battling his way up the tower. Amazingly this same shoddy process was used to create Game of Death II (1981) (A.K.A. \"Game of Death II\"), with a look-alike and more stunt doubles interwoven with a few brief minutes of footage of the real Bruce Lee. Tragically his son Brandon Lee, an actor and martial artist like his father, was killed in a freak accident on the set of The Crow (1994). Bruce Lee was not only an amazing athlete and martial artist but he possessed genuine superstar charisma and through a handful of films he left behind an indelible impression on the tapestry of modern cinema.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMTg4NDkzMV5BMl5BanBnXkFtZTYwMjU4Nzc2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000045","name":"Bruce Lee","idIMDB":"nm0000045"},"actorId":"nm0000045","character":"Lee","urlCharacter":"http://www.imdb.com/character/ch0038067","main":true},{"actorName":"John Saxon","urlProfile":"http://www.imdb.com/name/nm0768334","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjE1NTk3Ml5BMl5BanBnXkFtZTcwOTAzMjg0NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 August 1935","placeOfBirth":" Brooklyn, New York, USA","birthName":"Carmine Orrico","height":"5' 10½\" (1.79 m)","bio":"John Saxon has appeared in nearly 200 roles in the movies and on television in a more-than half-century-long career that has stretched over seven decades since he made his big screen debut in 1954 in uncredited small roles in It Should Happen to You (1954) and George Cukor's A Star Is Born (1954). Born Carmine Orrico on August 5, 1936 in Brooklyn, New York, the son of Italian immigrants Antonio Orrico and Anna (née Protettore), he studied acting with Stella Adler after graduating from New Utrecht High School. He was discovered by talent agent Henry Willson, the man most famous for creating and representing Rock Hudson (as well as a stable of \"beefcake\" male stars and starlets), who signed him up after he saw Saxon's picture on the cover of a magazine. Willson brought the 16-year-old to Southern California, changed his name to John Saxon, and launched his career. Saxon made his television debut on Richard Boone's series Medic (1954) in 1955 and got his first substantial (and credited) role in Running Wild (1955), playing a juvenile delinquent. In the Esther Williams vehicle The Unguarded Moment (1956) (one of her rare dramatic roles), the film's marketing campaign spotlighted him, trumpeting the movie as \"Co-starring the exciting new personality John Saxon.\". By 1958, he seemed to have established himself as a supporting player in A-List pictures, being featured in Blake Edwards's comedy This Happy Feeling (1958) headlined by Debbie Reynolds and Vincente Minnelli's The Reluctant Debutante (1958) with Rex Harrison and Sandra Dee. In the next five years, he worked steadily, including supporting roles in John Huston's The Unforgiven (1960), the James Stewart comedy Mr. Hobbs Takes a Vacation (1962) and Otto Preminger's The Cardinal (1963) while having first billing in the B-movies Cry Tough (1959) and War Hunt (1962). Fluent in Italian, he made his first pictures in Italy in the period, Agostino (1962) and Mario Bava's Evil Eye (1963). Despite his good work with major directors, he failed to succeed as a star. By 1965, he was appearing in the likes of Blood Beast from Outer Space (1965), albeit, top-billed. A more emblematic picture was Sidney J. Furie's The Appaloosa (1966), in which he appeared in Mexican bandito drag as the man who steals the horse of Marlon Brando, another Stella Adler student. The \"ethnic-looking\" Saxon would reprise the role, of sorts, in John Sturges Joe Kidd (1972) in support of superstar Clint Eastwood. In those less politically correct times, many an Italian-American with a dark complexion would be relied on to play Mexicans, Native Americans and other \"exotic\" types like Mongols. Saxon played everything from an Indian chief on Bonanza (1959) to Marco Polo on The Time Tunnel (1966). From 1969 to 1972 season, he was a star of the television series The Bold Ones: The New Doctors (1969), playing the brilliant surgeon Theodore Stuart. When the series ended, he took one of his most famous roles when Bruce Lee demurred over casting Rod Taylor as he was too tall. A black belt in karate, Saxon appeared as Roper in Opération dragon (1973). He has continued to play a wide variety of roles on television and in motion pictures ever since.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjE1NTk3Ml5BMl5BanBnXkFtZTcwOTAzMjg0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0768334","name":"John Saxon","idIMDB":"nm0768334"},"actorId":"nm0768334","character":"Roper","urlCharacter":"http://www.imdb.com/character/ch0013143","main":true},{"actorName":"Jim Kelly","urlProfile":"http://www.imdb.com/name/nm0446485","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI4MTM5NjU5Nl5BMl5BanBnXkFtZTcwNzY5Mzg3OQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1946","placeOfBirth":" Paris, Kentucky, USA","birthName":"James Milton Kelly","height":"6' 2\" (1.88 m)","bio":"With his funky Afro hairstyle, super cool attitude and superb karate skills, Jim Kelly was instantly identifiable, and one of the top martial arts film stars of the early 1970s. After appearing in a minor film role, Kelly's second screen effort was as one of the invited guests to the deadly Han's Island in Opération dragon (1973). Kelly quickly cropped up in several more martial arts influenced \"blaxploitation\" films including Three the Hard Way (1974), Golden Needles (1974) and Black Belt Jones (1974), with its interesting fight finale in a soap filled car wash! He then appeared in several other action films of the late seventies, however since 1980, Kelly has only cropped up in two minor roles. A talented athlete, winning ranked titles both in tennis and karate, Jim Kelly was an integral part of the African-American & martial arts cinematic explosion of the 1970s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI4MTM5NjU5Nl5BMl5BanBnXkFtZTcwNzY5Mzg3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0446485","name":"Jim Kelly","idIMDB":"nm0446485"},"actorId":"nm0446485","character":"Williams","urlCharacter":"http://www.imdb.com/character/ch0038799","main":true},{"actorName":"Ahna Capri","urlProfile":"http://www.imdb.com/name/nm0135622","urlPhoto":"","biography":{"dateOfBirth":"6 July 1944","placeOfBirth":" Budapest, Hungary","birthName":"Anna Marie Nanasi","bio":"Beautiful, buxom, and shapely blonde bombshell Ahna Capri was born Anna Marie Nanasi on July 6, 1944 in Budapest, Hungary. Capri moved with her family to America when she was a child and started acting in television series at age 11. She made her film debut at age 13 in the Western Outlaw's Son (1957). Ahna achieved her greatest enduring popularity as the enticing Tania in the martial arts cult classic Opération dragon (1973). Capri gave an excellent and impressive performance as country singer Rip Torn's snobbish, annoyed girlfriend Mayleen Travis in Payday (1973). Ahna's other memorable movie roles include the terrified Nicky in the creepy Devil-worship horror winner The Brotherhood of Satan (1971), feisty wildlife photographer Terry Pendrake in Piranha (1972), and luscious assassin Londa Wyeth in the Crown International exploitation romp The Specialist (1975). Among the many television series Capri has done guest spots on are Mrs. Columbo (1979), Baretta (1975), Kojak (1973), Police Story (1973), Cannon (1971), Mannix (1967), Ironside (1967), Adam-12 (1968), Mod Squad (1968), The Invaders (1967), The Wild Wild West (1965), I Spy (1965), The Man from U.N.C.L.E. (1964), Branded (1965), Leave It to Beaver (1957) and Maverick (1957). A longtime resident of the San Fernando Valley, Ahna was involved in a fatal traffic accident in North Hollywood on August 9, 2010 when a five-ton truck collided with her car. After spending more than a week in a coma on life support at a hospital, Ahna Capri passed away with family members at her side at age 66 on August 19, 2010.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0135622","name":"Ahna Capri","idIMDB":"nm0135622"},"actorId":"nm0135622","character":"Tania","urlCharacter":"http://www.imdb.com/character/ch0038977","main":true},{"actorName":"Kien Shih","urlProfile":"http://www.imdb.com/name/nm0793384","urlPhoto":"","biography":{"dateOfBirth":"1 January 1913","placeOfBirth":" Shígang Village, Panyu, Guangdong, China","birthName":"Wing-Cheung Shek","bio":"Kien Shih was born on January 1, 1913 in Shígang Village, Panyu, Guangdong, China as Wing-Cheung Shek. He is known for his work on Opération dragon (1973), La danse du lion (1980) and Hong Kong 1941 (1984). He died on June 3, 2009 in Hong Kong, China.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0793384","name":"Kien Shih","idIMDB":"nm0793384"},"actorId":"nm0793384","character":"Han","urlCharacter":"http://www.imdb.com/character/ch0038976","main":true},{"actorName":"Robert Wall","urlProfile":"http://www.imdb.com/name/nm0908378","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyOTE0NjY4M15BMl5BanBnXkFtZTYwODk4MzE3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 August 1939","placeOfBirth":" California, USA","height":"6' (1.83 m)","bio":"Robert Wall was born on August 22, 1939 in California, USA. He is known for his work on Opération dragon (1973), The Way of the Dragon (1972) and Le jeu de la mort (1978). He has been married to Lillian Prescott since November 16, 1968. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyOTE0NjY4M15BMl5BanBnXkFtZTYwODk4MzE3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0908378","name":"Robert Wall","idIMDB":"nm0908378"},"actorId":"nm0908378","character":"Oharra","urlCharacter":"http://www.imdb.com/character/ch0038979","main":true},{"actorName":"Angela Mao","urlProfile":"http://www.imdb.com/name/nm0544547","urlPhoto":"","biography":{"dateOfBirth":"20 September 1950","placeOfBirth":" Taiwan","birthName":"Mao Lin Ying","height":"5' 5\" (1.65 m)","bio":"Angela Mao was born as Mao Ching Ying in 1950 as the third of eight children to a family of entertainers for the Peking Opera House. She had a successful career as a Chinesa Opera actress, where her flexibility and martial arts first developed. She was discovered by film producer Raymond Chow who made her a star. Then, she trained in hapkido, and felt attracted to the new kung fu style, on demand by Hong Kong producers. Her career, if not long, was impressive, as she was one of the first women to make that sort of break-through in the film industry, until then reserving the fights and acrobatics to men. She played Bruce Lee's sister in Opération dragon (1973), and she also worked with Jackie Chan several times when he was a newcomer. In 1974, she fell in love and married Kelly Lai Chen. She retired from films in 1983, when her son George King was born. She moved to Queens, New York in 1993 and eventually opened several Chinese restaurants that she runs with her son and daughter-in-law: Mama King, Nan Bei Ho, New Mei Hua, Guo Ba Inc. She usually declines interviews, because she wanted to lower her profile for the sake of her marriage. However, in 2016, she gave a reluctant interview to the \"New York Times\" while feeding her baby granddaughter in one of her restaurants, with her son and daughter-in-law acting as her translators. She said that she still has fans who show up to her restaurants just to see her, but that fame was never as important as taking care of her family.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0544547","name":"Angela Mao","nicknames":["Lady Whirlwind","Lady Kung Fu"],"idIMDB":"nm0544547"},"actorId":"nm0544547","character":"Su Lin","urlCharacter":"http://www.imdb.com/character/ch0038978","main":true},{"actorName":"Betty Chung","urlProfile":"http://www.imdb.com/name/nm0161184","urlPhoto":"","biography":{"bio":"Betty Chung is known for her work on Opération dragon (1973), Xiao yun que (1965) and Chun huo (1970).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0161184","name":"Betty Chung","idIMDB":"nm0161184"},"actorId":"nm0161184","character":"Mei Ling","urlCharacter":"http://www.imdb.com/character/ch0128058","main":true},{"actorName":"Geoffrey Weeks","urlProfile":"http://www.imdb.com/name/nm0917315","urlPhoto":"","biography":{"bio":"Geoffrey Weeks was a Hong Kong based radio host with Hong Kong's Television and Radio's Radio 3 station. Sadly, he passed away a few weeks after filming of Enter the Dragon was completed. His only other film acting role was an uncredited role in That Man Bolt playing a bank employee.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0917315","name":"Geoffrey Weeks","idIMDB":"nm0917315"},"actorId":"nm0917315","character":"Braithwaite","urlCharacter":"http://www.imdb.com/character/ch0192916","main":true},{"actorName":"Bolo Yeung","urlProfile":"http://www.imdb.com/name/nm0001866","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGU4YmFlMjctM2ZiNC00YjBmLTgwYzItODliYTRjNWYyOWNhXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1946","placeOfBirth":" Canton, China","birthName":"Yang Sze","height":"5' 7\" (1.7 m)","bio":"Bolo Yeung was born in China. He began his martial arts training at the age of 10. Growing up he took an interest in bodybuilding. Later he became know as Chinese Hercules after becoming Mr. Hong Kong bodybuilding champion. He held the title for ten years. Because of his impressively muscular physique he was chosen for several bad guy movie roles, with which his first big break came alongside the legendary Bruce Lee in the 1973 movie Enter the Dragon, where he played the role of 'Bolo'. They were really close friends. Since then Bolo Yeung has appeared in countless martial arts movies, to date, also working on two movies with \"The Muscles from Brussels\"-Jean-Claude Van Damme in Bloodsport and Double Impact. Now Bolo still looks great and still regularly trains at his local gym. Martial Arts and Bodybuilding is an integral part of his life and career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGU4YmFlMjctM2ZiNC00YjBmLTgwYzItODliYTRjNWYyOWNhXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001866","name":"Bolo Yeung","nicknames":["The Beast from the East","The Chinese Hercules"],"idIMDB":"nm0001866"},"actorId":"nm0001866","character":"Bolo","urlCharacter":"http://www.imdb.com/character/ch0028301","main":true},{"actorName":"Peter Archer","urlProfile":"http://www.imdb.com/name/nm0033717","urlPhoto":"","biography":{"dateOfBirth":"8 July 1943","placeOfBirth":" Queensland, Australia","birthName":"Peter Ian Archer","bio":"Peter Archer was born on July 8, 1943 in Queensland, Australia as Peter Ian Archer. He was an actor, known for Opération dragon (1973), Blood and Steel: Making 'Enter the Dragon' (2004) and The Path of the Dragon (1998). He was married to Sandra Webster and Hazel Lo. He died on April 13, 2000 in Sydney, New South Wales, Australia.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0033717","name":"Peter Archer","idIMDB":"nm0033717"},"actorId":"nm0033717","character":"Parsons","urlCharacter":"http://www.imdb.com/character/ch0192917","main":true},{"actorName":"Li Jen Ho","urlProfile":"http://www.imdb.com/name/nm0378420","urlPhoto":"","biography":{"bio":"Li Jen Ho is an actor, known for Opération dragon (1973), Les coolies en ont ras le bol (1973) and L'ombre enchanteresse (1960).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0378420","name":"Li Jen Ho","idIMDB":"nm0378420"},"actorId":"nm0378420","character":"Old Man","urlCharacter":"http://www.imdb.com/character/ch0192919","main":true},{"actorName":"Marlene Clark","urlProfile":"http://www.imdb.com/name/nm0164262","urlPhoto":"","biography":{"dateOfBirth":"19 December 1949","placeOfBirth":" New York City, New York, USA","bio":"Lovely, sultry and charismatic Marlene Clark was born December 19, 1949, in Los Angeles, California. Her father was a bus driver and her mother worked in a factory. Marlene grew up in New York City's Harlem area, and went to junior college in Tennessee. She was a speech major at the City College of New York. She first started acting in plays in college. She was working as a fashion model before making her film debut with a small part in For Love of Ivy (1968). Marlene has had minor uncredited bit roles in Midnight Cowboy (1969) and Putney Swope (1969). She gave an outstanding performance as the enticing but dangerous Ganja in Ganja & Hess (1973). Other memorable parts include pesky government agent Kim in Slaughter (1972). the ill-fated Mariane Hargis in Beware! The Blob (1972), the very sexy titular reptilian demonic seductress in Night of the Cobra Woman (1972), the foxy Caroline in The Beast Must Die (1974) and the affluent Caroline in The Baron (1977). She had a recurring role as Lamont Sanford's fiancé Janet Lawson on the hit sitcom Sanford and Son (1972). In addition, she has made guest appearances on episodes of such TV shows as Marcus Welby, M.D. (1969), Bonanza (1959), Mod Squad (1968), Highway to Heaven (1984) and Head of the Class (1986). Clark was married to Billy Dee Williams from 1968 to 1971. More recently she has done interviews and commentaries on DVD releases of the films \"Ganja & Hess\" and \"The Baron.\"","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0164262","name":"Marlene Clark","idIMDB":"nm0164262"},"actorId":"nm0164262","character":"Secretary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Allan Kent","urlProfile":"http://www.imdb.com/name/nm0448651","urlPhoto":"","biography":{"bio":"Allan Kent is an actor and editor, known for Opération dragon (1973), Pretty Woman (1990) and Runaway Bride (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0448651","name":"Allan Kent","idIMDB":"nm0448651"},"actorId":"nm0448651","character":"Golfer","urlCharacter":"http://www.imdb.com/character/ch0192920","main":true},{"actorName":"William Keller","urlProfile":"http://www.imdb.com/name/nm0445792","urlPhoto":"","biography":{"bio":"William Keller is an actor and writer, known for Opération dragon (1973), Invasion of the Bee Girls (1973) and The Samaritans (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0445792","name":"William Keller","idIMDB":"nm0445792"},"actorId":"nm0445792","character":"L.A. Cop","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0070034","urlIMDB":"http://www.imdb.com/title/tt0070034","business":{"budget":{"money":"$850,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"HKD 3,307,526","country":"Hong","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1973/\">1973</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 42 min (102 min)","1 hr 39 min (99 min) (theatrical) (USA)","1 hr 26 min (86 min) (VHS release) (USA)"],"soundMix":["DTS (re-release)","Dolby Digital (re-release)","Mono (original release)","SDDS (re-release)"],"color":["Color (Technicolor)"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex 35 IIC, Panavision C-Series and Angenieux Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":["2,325 m (Sweden, cut version)","2,450 m (Sweden, uncut version)","2,110 m (Sweden, cut version)"],"negativeFormat":["35 mm (Eastman 100T 5254)"],"cinematographicProcess":["Panavision"],"printedFilmFormat":["35 mm"]},"rating":"7.7","filmingLocations":[{"location":"Aberdeen Harbour, Aberdeen, Hong Kong, China"}],"rated":"R","awards":[{"award":"National Film Preservation Board, USA 2004","titlesAwards":[{"titleAwardOutcome":"Won National Film Registry","categories":[{"category":"","names":[]}]}]}],"votes":"80,456","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."},{"idCompany":"co0594597","name":"Concord Productions"}],"keywords":{"keywords":["tournament","martial arts","shaolin","island","monk","temple","gambling","shaolin monk","prostitution","revenge","death","martial arts tournament","opium","martial artist","collector","factory","drugs","bodyguard","police officer","crime lord","british","spy","suicide","hong kong","prison island","girl in panties","white panties","panties","claw fight","asian","massaging back with feet","foot closeup","camera shot of feet","female bare feet","bo staff","duel","combat","hand to hand combat","claw","disarming someone","nunchucks","martial arts master","fistfight","action hero","impalement","broken mirror","brawl","bell 205 helicopter","hands tied behind back","nunchuck","alarm","underground installation","stealth","house cat","applause","laughing","six pack abs","slow motion action scene","glass shard","bowing","pulling hair","con game","knocked out","sparring","whispering","headphones","bird cage","sumo wrestling","animal fight","chinese junk","ghetto","kicked in the crotch","hitting a woman","scuba diver","toe tag","evil man","top secret","ninja","noodles","chopsticks","sabotage","metal hand","prosthetic arm","blade","stick fight","security guard","psychopath","rescue","mannequin","hostage","jail cell","drug manufacturing","rope","neck breaking","beaten to death","hidden room","museum","kicked in the stomach","kicked in the face","head butt","punched in the stomach","punched in the face","thrown through wall","investigation","breaking bottle","drug addict","henchman","sex slave","tough guy","strong man","warrior","honor","bare chested male","scorpion","eating insect","banquet","beach","stealing a car","police brutality","african american","afro","fight","businessman","secretary","vietnam veteran","violence","dog","self mutilation","forced suicide","hoodlum","thug","foot chase","death of sister","cemetery","nonlinear timeline","slum","harbor town","cigarette smoking","knife","boat","ship","corpse","british intelligence","government agent","film projector","taxi","intelligence officer","prologue","master apprentice relationship","training","martial arts school","animal in title","sole black character dies cliche","star died before release","good versus evil","tattoo","praying mantis","golf","chamber of horrors","hero","psychotronic","nunchaku","grindhouse","chop socky","hall of mirrors","mentor","spy hero","spear","prostitute","los angeles california","jeet kune do","helicopter","handgun","guillotine","espionage","china","cat","california","black belt","kung fu","b movie","cobra","secret lab","brothel","blood","betting","prosthetic limb","secret headquarters","racial slur","flashback","snake","secret agent","mirror","murder","drug lord","heroin","human experimentation","showdown","undercover","rebellion","imprisonment","cult film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:28:15"}}