{"data":{"movies":[{"title":"Play Girl","originalTitle":"","year":"1941","releaseDate":"19410307","directors":[{"name":"Frank Woodruff","id":"nm0940453"}],"writers":[{"name":"Jerome Cady","id":"nm0128332"},{"name":"Jerome Cady","id":"nm0128332"}],"runtime":"75 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQxMTE4OGItMmJjMS00ZTEwLTg5ODItODQ3MDIxMTIzNjRkXkEyXkFqcGdeQXVyMzU0NzkwMDg@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"The fascinating Grace Herbert has many years' experience as a professional gold-digger. Her finances at a low ebb, she finds her mature beauty less effective than of yore, and takes on impoverished 19-year-old Ellen Daley as an apprentice: \"between your youth and my spirit, we can do it.\" The initially reluctant Ellen soon gets the hang of it. But after the cowboy she falls for proves to be a wealthy rancher, she feels an odd reluctance to mix business with pleasure...","simplePlot":"The fascinating Grace Herbert has many years' experience as a professional gold-digger. Her finances at a low ebb, she finds her mature beauty less effective than of yore, and takes on ... ","actors":[{"actorName":"Kay Francis","urlProfile":"http://www.imdb.com/name/nm0290215","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MjQxMTI1OF5BMl5BanBnXkFtZTgwNjg2NTQzMjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 January 1905","placeOfBirth":" Oklahoma City, Oklahoma, USA","birthName":"Katherine Edwina Gibbs","height":"5' 9\" (1.75 m)","bio":"Kay Francis is possibly the biggest of the 'forgotten stars' from Hollywood's Golden Era, yet, for a while in the 1930s, she ranked as one of the most popular actresses, tagged the 'Queen of Warner Brothers', by 1935 earning a yearly salary of $115,000 (compared to Bette Davis with $18,000). The daughter of actress Katherine Clinton and businessman Joseph Gibbs, Kay did not start her working life in show business but sold real estate and arranged extravagant parties for wealthy socialites. Following her marriage in 1922 to James Dwight Francis, son of a moneyed family, Kay adopted the surname Francis. Her first acting job was in a modernised version of 'Hamlet' (as the Player Queen) in 1925, performing as Katharine Francis. She appeared as Marjorie Grey in the melodrama \"Crime\" (1927) and in the Ring Lardner play \"Elmer the Great\" (1928), produced by George M. Cohan and starring Walter Huston as Elmer Kane. On the strength of her stage work, Kay was screen-tested by Paramount and subsequently offered a contract (1929-31). A brief affair with writer / director Edmund Goulding (some time around April 1928) may also have been a contributing factor. She had a bit in the first Marx Brothers outing, The Cocoanuts (1929), and then graduated to playing sophisticated seductresses opposite stars like William Powell and Ronald Colman. She appeared in the Lubitsch comedy Trouble in Paradise (1932), though unhappy about being billed below Miriam Hopkins in the picture. One of her best early films was the comedy/drama One Way Passage (1932), playing a gravely-ill baroness opposite Powell's gentleman burglar, a doomed romance interlaced with witty dialogue described by a reviewer as 'spilled cocktail and love at first sight'. Paramount, at the time well-stocked with female stars but experiencing financial problems, decided to let Kay move to Warner Brothers, where she would remain for the rest of the decade. A tall, attractive, grey-eyed brunette with undeniable style and poise, she soon acquired a reputation as Hollywood's 'best dressed woman', wearing the most glamorous gowns designed by great studio costumers like Orry-Kelly, Travis Banton and Adrian. Particularly female audiences often flocked to see Kay Francis pictures simply to appreciate her sumptuous wardrobe. For her part, Kay spent a lot of time and effort on collaborative efforts with costume designers to select the right clothes for the parts she played. Dorothy Jeakins believed, that Kay possessed an 'innate sense of style'. By the mid-1930s, Kay earned $5,250 per week and was voted by Variety as Hollywood's sixth most popular star. Numerous magazine articles were written about every detail of her life and in and off the studio lot. She had major hits with I Found Stella Parish (1935) and Confession (1937), which were excellent money-spinners for the studio. While much was made at the time and since of her famous lisp, this had not hitherto been a significant detriment to Kay's career. At least, not until her falling out with the studio executives who thought her salary too excessive. The tight control the studio exercised over the roles she played on screen caused her to file a lawsuit against Warner Brothers, trying to escape her contract. It had all started to go wrong for her, when she was assigned the role of 'women's picture star', effectively typecasting her in sentimental melodramas, earnest biopics (The White Angel (1936), and three handkerchief tearjerkers like My Bill (1938), her script filled with Rs and Ls as chastisement for bucking the system. Though she still managed to give several good performances, the writing was on the wall. By the end of the decade, the 'Queen of Warner Brothers' mantle had passed on to Bette Davis. During the mid-1940s, Kay co-produced several B-movies as vehicles for herself at Monogram, then made a brief return to stage work, acting in summer stock before retiring permanently in 1952. She spent the remainder of her life in virtual seclusion in New York and in her estate near Falmouth, Cape Cod. She left some of her estate (in excess of one million dollars) to an organisation training guide dogs for the blind, Seeing Eye Inc. Her surviving personal papers are accessible at the Wesleyan University Cinema Archives.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MjQxMTI1OF5BMl5BanBnXkFtZTgwNjg2NTQzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0290215","name":"Kay Francis","idIMDB":"nm0290215"},"actorId":"nm0290215","character":"Grace Herbert","urlCharacter":"http://www.imdb.com/character/ch0492936","main":true},{"actorName":"James Ellison","urlProfile":"http://www.imdb.com/name/nm0255199","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDdmMjcwMTEtYzQ3Zi00YjBhLTk1MTgtZTU5Yjg0ODVkMTA1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 May 1910","placeOfBirth":" Guthrie Center, Iowa, USA","birthName":"James Ellison Smith","height":"6' 2\" (1.88 m)","bio":"American light leading man, primarily of Westerns, James Ellison was born James Ellison Smith in Guthrie Center, Iowa, in 1910. He grew up on a ranch in Valier, Montana, where he learned the skills that would stand him in good stead as a movie cowboy. His family moved to Los Angeles when he was a young man, and it was there that he first became interested in the theatre. He studied at the Pasadena Playhouse briefly, traveled to New York (and by some accounts played some minor roles in productions of the visiting Moscow Art Theatre, probably as a supernumerary), then returned to California where he was spotted by a Warner Bros. talent scout at a production of the Beverly Hills Little Theatre. He played a number of bit parts for Warners and MGM before landing the plum part of Hopalong Cassidy's sidekick Johnny Nelson in Paramount's wildly successful series. Ellison played Nelson for eight films between the years 1935 and 1937, also playing in other films in between. Although he was a supporting player in the Hopalong films, his name was strangely billed in the same size and format as veteran actor and matinee idol William Boyd's. Although not confirmed, the reason for this oddity is thought to be because the character Johnny Nelson was very prominent in the Hopalong Cassidy book series. In 1936 he was plucked by Cecil B. DeMille for the role of Buffalo Bill Cody in De Mille's epic Western The Plainsman (1936) opposite Gary Cooper. De Mille reportedly hated Ellison's performance and wanted to ensure that Ellison never had as good a part in quite as good a film ever again. In the late 1930s and 1940s Ellison did follow up with quite a number of romantic leads in a wide variety of films, from musicals and light mysteries, with such co-stars as Maureen O'Hara (They Met in Argentina (1941)), Jimmy Stewart and Ginger Rogers (Vivacious Lady (1938)) to the cult horror classic I Walked with a Zombie (1943). In 1950 Ellison returned to westerns, this time as the lead (along with his Hopalong replacement and longtime friend Russell Hayden) in a series of 11 westerns featuring them as two frontier lawmen, Lucky (Hayden) and Shamrock (Ellison). In the late 1950s, Ellison retired from movies and became a successful real estate broker. He died in 1993, as the result of a fall in which he broke his neck, at the age of 83.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDdmMjcwMTEtYzQ3Zi00YjBhLTk1MTgtZTU5Yjg0ODVkMTA1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0255199","name":"James Ellison","nicknames":["Jimmy"],"idIMDB":"nm0255199"},"actorId":"nm0255199","character":"Thomas Elwood Dice","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mildred Coles","urlProfile":"http://www.imdb.com/name/nm0171328","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTVjMDMyNDgtZDI1Yi00OTM4LTgzOTItOWY2M2Y1MWY0MzZiXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1920","placeOfBirth":" Los Angeles County, California, USA","birthName":"Mildred Blanche Coles","bio":"Mildred Coles was a former beauty queen and a Western character actress. Her favorite film was - Oklahoma Badlands (1948) which starred Alan \"Rocky\" Lane.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTVjMDMyNDgtZDI1Yi00OTM4LTgzOTItOWY2M2Y1MWY0MzZiXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0171328","name":"Mildred Coles","nicknames":["Milly"],"idIMDB":"nm0171328"},"actorId":"nm0171328","character":"Ellen Daley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nigel Bruce","urlProfile":"http://www.imdb.com/name/nm0115558","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MzAyMjQwNV5BMl5BanBnXkFtZTgwNzM2MjcyMjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1895","placeOfBirth":" Ensenada, Baja California, Mexico","birthName":"William Nigel Ernle Bruce","height":"6' (1.83 m)","bio":"Nigel was, from the beginning, typecast as bumbling English aristocrats, military types or drawing room society snobs and, within the narrow parameters of his range, he was very, very good at playing these parts. Nigel Bruce was born in Mexico, where his father, Sir William W. Bruce, worked as an engineer. His family was part of English aristocracy, ever since Charles I. bestowed a baronetcy upon them in 1629 (William's older brother Michael held the hereditary title). Nigel was educated in England at Grange, Stevenage and Abingdon. His first job was at a stockbroker's firm. During World War I, he served in the British Army (like his future co-star, Basil Rathbone) where he received a serious leg wound and was for some time confined to a wheelchair. Following his discharge, he turned to acting in 1919, but it wasn't until ten years later that he achieved a breakthrough in Noël Coward's 'This was a Man' on Broadway. Then followed the performance which was to set the standard for all his later work in Hollywood: the 1931 comedy \"Springtime for Henry\". On the strength of his performance as Johnny Jelliwell, Fox offered Nigel the opportunity to reprise his role in the 1934 movie. Soon after that, Nigel was cast to star as British detective Bertram Lynch in a minor thriller, Murder in Trinidad (1934). The contemporary New York Times Review (May 16,1934) was skeptical about the film's merit, but found Nigel's performance 'compelling'. After that followed a gallery of endearingly stereotypical 'Britishers': Squire Trelawny in Robert Louis Stevenson's classic Treasure Island (1934), the Prince of Wales in The Scarlet Pimpernel (1934), Professor Holly in She (1935) and Sir Benjamin Warrenton in The Charge of the Light Brigade (1936). All, without exception, were roles in which Nigel felt perfectly at home. In 1939, he teamed up with Basil Rathbone for the first two Holmes/Watson movies, The Hound of the Baskervilles (1939) and The Adventures of Sherlock Holmes (1939), filmed at 20th Century Fox. Both films had an authentic period feel for Victorian England and the chemistry between the two stars was just right. Three years later, Rathbone was contractually obliged to make a further series of twelve Holmes pictures at Universal, again co-starring Nigel as Dr. Watson. Unfortunately, these films were incongruously set in the 1940's, often poorly written and irritatingly riddled with sermonizing wartime propaganda. Poor old Nigel had suddenly regressed from being 'my friend and colleague' to bumbling, feet shuffling comedy relief. In between filming the Sherlock Holmes series, Nigel portrayed his lovable self in two Hitchcock classics Rebecca (1940) (as Major Giles Lacy) and Suspicion (1941) (as 'Beaky'). A prominent member of the resident English colony in Hollywood, Nigel Bruce at one time captained the cricket club established by fellow actor and compatriot C. Aubrey Smith in 1932 (other members included P.G. Wodehouse, Boris Karloff, Ronald Colman and David Niven).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MzAyMjQwNV5BMl5BanBnXkFtZTgwNzM2MjcyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0115558","name":"Nigel Bruce","nicknames":["Willie"],"idIMDB":"nm0115558"},"actorId":"nm0115558","character":"William McDonald Vincent","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Margaret Hamilton","urlProfile":"http://www.imdb.com/name/nm0002121","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMDc3NTgzMF5BMl5BanBnXkFtZTgwNDIyNzIwMjE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 December 1902","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Margaret Brainard Hamilton","height":"5' (1.52 m)","bio":"Margaret Hamilton was Born December 9, 1902 in Cleveland, Ohio to Jennie and Walter Hamilton. She later attended Hathaway Brown School in Shaker Heights, Ohio, and practiced acting doing children's theater while a Junior League of Cleveland member. Margaret had already built her resume with several performances in film before she came to her most memorable and astronomically successful role, Almira Gulch/ The Wicked Witch of the West in The Wizard of Oz (1939). The character is considered to be one of the screen's greatest and most memorable villains of all time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMDc3NTgzMF5BMl5BanBnXkFtZTgwNDIyNzIwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002121","name":"Margaret Hamilton","nicknames":["Maggie"],"idIMDB":"nm0002121"},"actorId":"nm0002121","character":"Josie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Katharine Alexander","urlProfile":"http://www.imdb.com/name/nm0018540","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg3Njk5MDktYmQ1Ni00MDgwLWE3ZDAtNWRlZGQwN2Y0NTUwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 September 1898","placeOfBirth":" Fort Smith, Arkansas, USA","bio":"Katherine (also called Katharine) Alexander, an excellent character actress, had been born in 1897 to a mother who was part Cherokee and to a father who farmed land on Indian territory. And yet she was never given the part of a native American in the course of her thirty-five-year acting career. Often a society lady, at times a suffering wife or a dignified mother, she was nearly always all-American. At ease in the register of drama and tragedy as well as in that of comedy, Katherine Alexander was a talented and versatile performer who alternated theater and cinema throughout a highly respectable career. An artist she was bound to be but rather a concert one than a thespian. Her mother, a frustrated musician herself, had indeed seen to it that she receive a formal musical education and young Katherine proved gifted at the violin. And she was indeed giving a violin recital when producer Samuel Goldwyn, who needed an actress who could play the violin for a play he was producing, noticed the young lady and hired her for the role. Miss Alexander, who had not yet turned twenty, realized that she much preferred acting to music playing and that was the beginning of a fruitful career on stage first and alternately on the boards and on the big screen as soon as the cinema started talking. A leading lady on Broadway (where she delivered the lines of such distinguished playwrights as Arthur Schnitzler, Robert E. Sherwood or Philip Barry),she was soon seen as an indispensable supporting actress in Hollywood movies. She was always reliable and competent and did not pale by the side of great stars like Greta Garbo (the wife of Garbo's lover in The Painted Veil (1934)), Bette Davis (the wife of a lawyer in love with Davis in That Certain Woman (1937) ; Miss Trask in Now, Voyager (1942)), Cary Grant (Mrs. Morton in In Name Only (1939)) or John Barrymore (Miss Billow in The Great Man Votes (1939). Katherine Alexander's shining hour came in 1949, two years before she retired, when she embodied Linda Loman, the no-nonsense wife of pathetic salesman Paul Muni in the London production of Arthur Miller's \"Death of a Salesman\". After such a triumph, she decided to give up her career and for thirty years on, she enjoyed a happy second life until her death in early 1981.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg3Njk5MDktYmQ1Ni00MDgwLWE3ZDAtNWRlZGQwN2Y0NTUwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0018540","name":"Katharine Alexander","idIMDB":"nm0018540"},"actorId":"nm0018540","character":"Mrs. Dice","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"G.P. Huntley","urlProfile":"http://www.imdb.com/name/nm0403139","urlPhoto":"","biography":{"dateOfBirth":"26 February 1904","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Bruce Timothy Huntley","height":"6' 0½\" (1.84 m)","bio":"G.P. Huntley was born on February 26, 1904 in Boston, Massachusetts, USA as Bruce Timothy Huntley. He was an actor, known for The Charge of the Light Brigade (1936), They Died with Their Boots On (1941) and Beau Geste (1939). He was married to Mildred Lillard. He died on June 26, 1971 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0403139","name":"G.P. Huntley","idIMDB":"nm0403139"},"actorId":"nm0403139","character":"Van Payson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kane Richmond","urlProfile":"http://www.imdb.com/name/nm0725122","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQxMjY4ODE2MV5BMl5BanBnXkFtZTYwNzI3ODY4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 December 1906","placeOfBirth":" Minneapolis, Minnesota, USA","birthName":"Fred Bowditch","height":"6' (1.83 m)","bio":"Kane Richmond was born on December 23, 1906 in Minneapolis, Minnesota, USA as Fred Bowditch. He was an actor, known for Spy Smasher (1942), Haunted Harbor (1944) and Double Cross (1941). He was married to Marion Burns. He died on March 22, 1973 in Corona Del Mar, Newport Beach, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQxMjY4ODE2MV5BMl5BanBnXkFtZTYwNzI3ODY4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0725122","name":"Kane Richmond","idIMDB":"nm0725122"},"actorId":"nm0725122","character":"Don Shawhan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stanley Andrews","urlProfile":"http://www.imdb.com/name/nm0003224","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWU1MDI4NjYtNGNkYy00ODgzLTgyOWQtZGIxMTVhNWMzNDM4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1891","placeOfBirth":" Chicago, Illinois, USA","birthName":"Stanley Andrzejewski","height":"5' 10\" (1.78 m)","bio":"Stanley Andrews was born on August 28, 1891 in Chicago, Illinois, USA as Stanley Andrzejewski. He was an actor, known for Meet John Doe (1941), The Ox-Bow Incident (1943) and Vengeance Valley (1951). He died on June 23, 1969 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWU1MDI4NjYtNGNkYy00ODgzLTgyOWQtZGIxMTVhNWMzNDM4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003224","name":"Stanley Andrews","idIMDB":"nm0003224"},"actorId":"nm0003224","character":"Joseph Shawhan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Selmer Jackson","urlProfile":"http://www.imdb.com/name/nm0414038","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MDg4MzczNV5BMl5BanBnXkFtZTgwNzk2MDU1MzE@._V1._CR81,91,609,827_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 May 1888","placeOfBirth":" Lake Mills, Iowa, USA","birthName":"Selmer Adolph Jackson","bio":"Selmer Jackson was born on May 7, 1888 in Lake Mills, Iowa, USA as Selmer Adolph Jackson. He was an actor, known for The Grapes of Wrath (1940), Autumn Leaves (1956) and The Ape (1940). He was married to Estil S. Jackson. He died on March 30, 1971 in Burbank, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MDg4MzczNV5BMl5BanBnXkFtZTgwNzk2MDU1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0414038","name":"Selmer Jackson","idIMDB":"nm0414038"},"actorId":"nm0414038","character":"Fred Dice","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marek Windheim","urlProfile":"http://www.imdb.com/name/nm0934699","urlPhoto":"","biography":{"dateOfBirth":"8 April 1895","placeOfBirth":" Warsaw, Poland, Russian Empire [now Warsaw, Mazowieckie, Poland]","bio":"Marek Windheim was born on April 8, 1895 in Warsaw, Poland, Russian Empire. He was an actor, known for Holiday Inn (1942), Something to Sing About (1937) and Hi Diddle Diddle (1943). He died on December 1, 1960 in New York City, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0934699","name":"Marek Windheim","idIMDB":"nm0934699"},"actorId":"nm0934699","character":"Dr. Alonso Corivini","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0032916","urlIMDB":"http://www.imdb.com/title/tt0032916","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"RKO Radio Pictures, Inc. (original), U.S. Copyright LP10473, 14 February 1941), (onscreen notice date, 1940, is incorrect)"},"technical":{"runtime":["1 hr 15 min (75 min)"],"soundMix":["Mono (RCA Sound System)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.1","filmingLocations":[],"rated":"PASSED","awards":[],"votes":"202","type":"Movie","companyCreditsSimple":[{"idCompany":"co0041421","name":"RKO Radio Pictures"}],"keywords":{"keywords":["cowboy","gold digger","lake placid","b movie","wipe","wainscoting","tycoon","teenager","taxi","suit and tie","source music","society woman","smoking","skyscraper","sconce","reference to little red riding hood","radio broadcast","orchestra","orchestral music score","orchestra conductor","montage","manipulation","kiss","florida","fireplace","fade to black","decolletage","deception","conductor","con trick","classical music","skiing","chicago illinois","new york city","breach of promise","maid","mother son relationship","marriage proposal","concert","miami florida","cattleman","self sacrifice","steam bath","moral reformation","engagement","jewelry","extortion","texan","millionaire"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:24:09"}}