{"data":{"movies":[{"title":"Le dernier Tango à Paris","originalTitle":"Ultimo tango a Parigi","year":"1972","releaseDate":"19730207","directors":[{"name":"Bernardo Bertolucci","id":"nm0000934"}],"writers":[{"name":"Bernardo Bertolucci","id":"nm0000934"},{"name":"Bernardo Bertolucci","id":"nm0000934"}],"runtime":"129 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2I5ODUxYjMtMmJjYy00NjJjLWE5YWYtNWJkYjBiNzJjOTMyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["France","Italy"],"languages":["English","French"],"genres":["Drama"],"plot":"While looking for an apartment, Jeanne, a beautiful young Parisienne, encounters Paul, a mysterious American expatriate mourning his wife's recent suicide. Instantly drawn to each other, they have a stormy, passionate affair, in which they do not reveal their names to each other. Their relationship deeply affects their lives, as Paul struggles with his wife's death and Jeanne prepares to marry her fiance, Tom, a film director making a cinema-verite documentary about her.","simplePlot":"A young Parisian woman meets a middle-aged American businessman who demands their clandestine relationship be based only on sex.","actors":[{"actorName":"Marlon Brando","urlProfile":"http://www.imdb.com/name/nm0000008","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDYyMDE5OF5BMl5BanBnXkFtZTcwNjgyNTEzNA@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 April 1924","placeOfBirth":" Omaha, Nebraska, USA","birthName":"Marlon Brando Jr.","height":"5' 9\" (1.75 m)","bio":"Marlon Brando is widely considered the greatest movie actor of all time, rivaled only by the more theatrically oriented Laurence Olivier in terms of esteem. Unlike Olivier, who preferred the stage to the screen, Brando concentrated his talents on movies after bidding the Broadway stage adieu in 1949, a decision for which he was severely criticized when his star began to dim in the 1960s and he was excoriated for squandering his talents. No actor ever exerted such a profound influence on succeeding generations of actors as did Brando. More than 50 years after he first scorched the screen as Stanley Kowalski in the movie version of Tennessee Williams' A Streetcar Named Desire (1951) and a quarter-century after his last great performance as Col. Kurtz in Francis Ford Coppola's Apocalypse Now (1979), all American actors are still being measured by the yardstick that was Brando. It was if the shadow of John Barrymore, the great American actor closest to Brando in terms of talent and stardom, dominated the acting field up until the 1970s. He did not, nor did any other actor so dominate the public's consciousness of what WAS an actor before or since Brando's 1951 on-screen portrayal of Stanley made him a cultural icon. Brando eclipsed the reputation of other great actors circa 1950, such as Paul Muni and Fredric March. Only the luster of Spencer Tracy's reputation hasn't dimmed when seen in the starlight thrown off by Brando. However, neither Tracy nor Olivier created an entire school of acting just by the force of his personality. Brando did. Marlon Brando, Jr. was born on April 3, 1924, in Omaha, Nebraska, to Marlon Brando, Sr., a calcium carbonate salesman, and his artistically inclined wife, the former Dorothy Julia Pennebaker. \"Bud\" Brando was one of three children. His ancestry included English, Irish, German, Dutch, French Huguenot, Welsh, and Scottish; his surname originated with a distant German immigrant ancestor named \"Brandau\". His oldest sister Jocelyn Brando was also an actress, taking after their mother, who engaged in amateur theatricals and mentored a then-unknown Henry Fonda, another Nebraska native, in her role as director of the Omaha Community Playhouse. Frannie, Brando's other sibling, was a visual artist. Both Brando sisters contrived to leave the Midwest for New York City, Jocelyn to study acting and Frannie to study art. Marlon managed to escape the vocational doldrums forecast for him by his cold, distant father and his disapproving schoolteachers by striking out for The Big Apple in 1943, following Jocelyn into the acting profession. Acting was the only thing he was good at, for which he received praise, so he was determined to make it his career - a high-school dropout, he had nothing else to fall back on, having been rejected by the military due to a knee injury he incurred playing football at Shattuck Military Academy, Brando Sr.'s alma mater. The school booted Marlon out as incorrigible before graduation. Acting was a skill he honed as a child, the lonely son of alcoholic parents. With his father away on the road, and his mother frequently intoxicated to the point of stupefaction, the young Bud would play-act for her to draw her out of her stupor and to attract her attention and love. His mother was exceedingly neglectful, but he loved her, particularly for instilling in him a love of nature, a feeling which informed his character Paul in Le dernier Tango à Paris (1972) (\"Last Tango in Paris\") when he is recalling his childhood for his young lover Jeanne. \"I don't have many good memories,\" Paul confesses, and neither did Brando of his childhood. Sometimes he had to go down to the town jail to pick up his mother after she had spent the night in the drunk tank and bring her home, events that traumatized the young boy but may have been the grain that irritated the oyster of his talent, producing the pearls of his performances. Anthony Quinn, his Oscar-winning co-star in Viva Zapata! (1952) told Brando's first wife Anna Kashfi, \"I admire Marlon's talent, but I don't envy the pain that created it.\" Brando enrolled in Erwin Piscator's Dramatic Workshop at New York's New School, and was mentored by Stella Adler, a member of a famous Yiddish Theatre acting family. Adler helped introduce to the New York stage the \"emotional memory\" technique of Russian theatrical actor, director and impresario Konstantin Stanislavski, whose motto was \"Think of your own experiences and use them truthfully.\" The results of this meeting between an actor and the teacher preparing him for a life in the theater would mark a watershed in American acting and culture. Brando made his debut on the boards of Broadway on October 19, 1944, in \"I Remember Mama,\" a great success. As a young Broadway actor, Brando was invited by talent scouts from several different studios to screen-test for them, but he turned them down because he would not let himself be bound by the then-standard seven-year contract. Brando would make his film debut quite some time later in Fred Zinnemann's The Men (1950) for producer Stanley Kramer. Playing a paraplegic soldier, Brando brought new levels of realism to the screen, expanding on the verisimilitude brought to movies by Group Theatre alumni John Garfield, the predecessor closest to him in the raw power he projected on-screen. Ironically, it was Garfield whom producer Irene Mayer Selznick had chosen to play the lead in a new Tennessee Williams play she was about to produce, but negotiations broke down when Garfield demanded an ownership stake in \"A Streetcar Named Desire.\" Burt Lancaster was next approached, but couldn't get out of a prior film commitment. Then director Elia Kazan suggested Brando, whom he had directed to great effect in Maxwell Anderson's play \"Truckline Café,\" in which Brando co-starred with Karl Malden, who was to remain a close friend for the next 60 years. During the production of \"Truckline Café\", Kazan had found that Brando's presence was so magnetic, he had to re-block the play to keep Marlon near other major characters' stage business, as the audience could not take its eyes off of him. For the scene where Brando's character re-enters the stage after killing his wife, Kazan placed him upstage-center, partially obscured by scenery, but where the audience could still see him as Karl Malden and others played out their scene within the café set. When he eventually entered the scene, crying, the effect was electric. A young Pauline Kael, arriving late to the play, had to avert her eyes when Brando made this entrance as she believed the young actor on stage was having a real-life conniption. She did not look back until her escort commented that the young man was a great actor. The problem with casting Brando as Stanley was that he was much younger than the character as written by Williams. However, after a meeting between Brando and Williams, the playwright eagerly agreed that Brando would make an ideal Stanley. Williams believed that by casting a younger actor, the Neanderthalish Kowalski would evolve from being a vicious older man to someone whose unintentional cruelty can be attributed to his youthful ignorance. Brando ultimately was dissatisfied with his performance, though, saying he never was able to bring out the humor of the character, which was ironic as his characterization often drew laughs from the audience at the expense of Jessica Tandy's Blanche Dubois. During the out-of-town tryouts, Kazan realized that Brando's magnetism was attracting attention and audience sympathy away from Blanche to Stanley, which was not what the playwright intended. The audience's sympathy should be solely with Blanche, but many spectators were identifying with Stanley. Kazan queried Williams on the matter, broaching the idea of a slight rewrite to tip the scales back to more of a balance between Stanley and Blanche, but Williams demurred, smitten as he was by Brando, just like the preview audiences. For his part, Brando believed that the audience sided with his Stanley because Jessica Tandy was too shrill. He thought Vivien Leigh, who played the part in the movie, was ideal, as she was not only a great beauty but she WAS Blanche Dubois, troubled as she was in her real life by mental illness and nymphomania. Brando's appearance as Stanley on stage and on screen revolutionized American acting by introducing \"The Method\" into American consciousness and culture. Method acting, rooted in Adler's study at the Moscow Art Theatre of Stanislavsky's theories that she subsequently introduced to the Group Theatre, was a more naturalistic style of performing, as it engendered a close identification of the actor with the character's emotions. Adler took first place among Brando's acting teachers, and socially she helped turn him from an unsophisticated Midwestern farm boy into a knowledgeable and cosmopolitan artist who one day would socialize with presidents. Brando didn't like the term \"The Method,\" which quickly became the prominent paradigm taught by such acting gurus as Lee Strasberg at the Actors Studio. Brando denounced Strasberg in his autobiography \"Songs My Mother Taught Me\" (1994), saying that he was a talentless exploiter who claimed he had been Brando's mentor. The Actors Studio had been founded by Strasberg along with Kazan and Stella Adler's husband, Harold Clurman, all Group Theatre alumni, all political progressives deeply committed to the didactic function of the stage. Brando credits his knowledge of the craft to Adler and Kazan, while Kazan in his autobiography \"A Life\" claimed that Brando's genius thrived due to the thorough training Adler had given him. Adler's method emphasized that authenticity in acting is achieved by drawing on inner reality to expose deep emotional experience Interestingly, Elia Kazan believed that Brando had ruined two generations of actors, his contemporaries and those who came after him, all wanting to emulate the great Brando by employing The Method. Kazan felt that Brando was never a Method actor, that he had been highly trained by Adler and did not rely on gut instincts for his performances, as was commonly believed. Many a young actor, mistaken about the true roots of Brando's genius, thought that all it took was to find a character's motivation, empathize with the character through sense and memory association, and regurgitate it all on stage to become the character. That's not how the superbly trained Brando did it; he could, for example, play accents, whereas your average American Method actor could not. There was a method to Brando's art, Kazan felt, but it was not The Method. After A Streetcar Named Desire (1951), for which he received the first of his eight Academy Award nominations, Brando appeared in a string of Academy Award-nominated performances - in Viva Zapata! (1952), Julius Caesar (1953) and the summit of his early career, Kazan's On the Waterfront (1954). For his \"Waterfront\" portrayal of meat-headed longshoreman Terry Malloy, the washed-up pug who \"coulda been a contender,\" Brando won his first Oscar. Along with his iconic performance as the rebel-without-a-cause Johnny in The Wild One (1953) (\"What are you rebelling against?\" Johnny is asked. \"What have ya got?\" is his reply), the first wave of his career was, according to Jon Voight, unprecedented in its audacious presentation of such a wide range of great acting. Director John Huston said his performance of Marc Antony was like seeing the door of a furnace opened in a dark room, and co-star John Gielgud, the premier Shakespearean actor of the 20th century, invited Brando to join his repertory company. It was this period of 1951-54 that revolutionized American acting, spawning such imitators as James Dean - who modeled his acting and even his lifestyle on his hero Brando - the young Paul Newman and Steve McQueen. After Brando, every up-and-coming star with true acting talent and a brooding, alienated quality would be hailed as the \"New Brando,\" such as Warren Beatty in Kazan's Splendor in the Grass (1961). \"We are all Brando's children,\" Jack Nicholson pointed out in 1972. \"He gave us our freedom.\" He was truly \"The Godfather\" of American acting - and he was just 30 years old. Though he had a couple of failures, like Désirée (1954) and The Teahouse of the August Moon (1956), he was clearly miscast in them and hadn't sought out the parts so largely escaped blame. In the second period of his career, 1955-62, Brando managed to uniquely establish himself as a great actor who also was a Top 10 movie star, although that star began to dim after the box-office high point of his early career, Sayonara (1957) (for which he received his fifth Best Actor Oscar nomination). Brando tried his hand at directing a film, the well-reviewed One-Eyed Jacks (1961) that he made for his own production company, Pennebaker Productions (after his mother's maiden name). Stanley Kubrick had been hired to direct the film, but after months of script rewrites in which Brando participated, Kubrick and Brando had a falling out and Kubrick was sacked. According to his widow Christiane Kubrick, Stanley believed that Brando had wanted to direct the film himself all along. Tales proliferated about the profligacy of Brando the director, burning up a million and a half feet of expensive VistaVision film at 50 cents a foot, fully ten times the normal amount of raw stock expended during production of an equivalent motion picture. Brando took so long editing the film that he was never able to present the studio with a cut. Paramount took it away from him and tacked on a re-shot ending that Brando was dissatisfied with, as it made the Oedipal figure of Dad Longworth into a villain. In any normal film Dad would have been the heavy, but Brando believed that no one was innately evil, that it was a matter of an individual responding to, and being molded by, one's environment. It was not a black-and-white world, Brando felt, but a gray world in which once-decent people could do horrible things. This attitude explains his sympathetic portrayal of Nazi officer Christian Diestl in the film he made before shooting One-Eyed Jacks (1961), Edward Dmytryk's filming of Irwin Shaw's novel The Young Lions (1958). Shaw denounced Brando's performance, but audiences obviously disagreed, as the film was a major hit. It would be the last hit movie Brando would have for more than a decade. One-Eyed Jacks (1961) generated respectable numbers at the box office, but the production costs were exorbitant - a then-staggering $6 million - which made it run a deficit. A film essentially is \"made\" in the editing room, and Brando found cutting to be a terribly boring process, which was why the studio eventually took the film away from him. Despite his proved talent in handling actors and a large production, Brando never again directed another film, though he would claim that all actors essentially direct themselves during the shooting of a picture. Between the production and release of One-Eyed Jacks (1961), Brando appeared in Sidney Lumet's film version of Tennessee Williams' play \"Orpheus Descending\", The Fugitive Kind (1960) which teamed him with fellow Oscar winners Anna Magnani and Joanne Woodward. Following in Elizabeth Taylor's trailblazing footsteps, Brando became the second performer to receive a $1-million salary for a motion picture, so high were the expectations for this re-teaming of Kowalski and his creator (in 1961 critic Hollis Alpert had published a book \"Brando and the Shadow of Stanley Kowalski). Critics and audiences waiting for another incendiary display from Brando in a Williams work were disappointed when the renamed The Fugitive Kind (1960) finally released. Though Tennessee was hot, with movie versions of Cat on a Hot Tin Roof (1958) and Suddenly, Last Summer (1959) burning up the box office and receiving kudos from the Academy of Motion Picture Arts & Sciences, The Fugitive Kind (1960) was a failure. This was followed by the so-so box-office reception of One-Eyed Jacks (1961) in 1961 and then by a failure of a more monumental kind: Mutiny on the Bounty (1962), a remake of the famed 1935 film. Brando signed on to Mutiny on the Bounty (1962) after turning down the lead in the David Lean classic Lawrence of Arabia (1962) because he didn't want to spend a year in the desert riding around on a camel. He received another $1-million salary, plus $200,000 in overages as the shoot went overtime and over budget. During principal photography, highly respected director Carol Reed (an eventual Academy Award winner) was fired, and his replacement, two-time Oscar winner Lewis Milestone, was shunted aside by Brando as Marlon basically took over the direction of the film himself. The long shoot became so notorious that President John F. Kennedy asked director Billy Wilder at a cocktail party not \"when\" but \"if\" the \"Bounty\" shoot would ever be over. The MGM remake of one of its classic Golden Age films garnered a Best Picture Oscar nomination and was one of the top grossing films of 1962, yet failed to go into the black due to its Brobdingnagian budget estimated at $20 million, which is equivalent to $120 million when adjusted for inflation. Brando and Taylor, whose Cleopatra (1963) nearly bankrupted 20th Century-Fox due to its huge cost overruns (its final budget was more than twice that of Brando's Mutiny on the Bounty (1962)), were pilloried by the show business press for being the epitome of the pampered, self-indulgent stars who were ruining the industry. Seeking scapegoats, the Hollywood press conveniently ignored the financial pressures on the studios. The studios had been hurt by television and by the antitrust-mandated divestiture of their movie theater chains, causing a large outflow of production to Italy and other countries in the 1950s and 1960s in order to lower costs. The studio bosses, seeking to replicate such blockbuster hits as the remakes of The Ten Commandments (1956) and Ben-Hur (1959), were the real culprits behind the losses generated by large-budgeted films that found it impossible to recoup their costs despite long lines at the box office. While Elizabeth Taylor, receiving the unwanted gift of reams of publicity from her adulterous romance with Cleopatra (1963) co-star Richard Burton, remained hot until the tanking of her own Tennessee Williams-renamed debacle Boom! (1968), Brando from 1963 until the end of the decade appeared in one box-office failure after another as he worked out a contract he had signed with Universal Pictures. The industry had grown tired of Brando and his idiosyncrasies, though he continued to be offered prestige projects up through 1968. Some of the films Brando made in the 1960s were noble failures, such as The Ugly American (1963), The Appaloosa (1966) and Reflections in a Golden Eye (1967). For every \"Reflections,\" though, there seemed to be two or three outright debacles, such as Bedtime Story (1964), Morituri (1965), The Chase (1966), A Countess from Hong Kong (1967), Candy (1968), The Night of the Following Day (1968). By the time Brando began making the anti-colonialist picture Burn! (1969) in Colombia with Gillo Pontecorvo in the director's chair, he was box-office poison, despite having worked in the previous five years with such top directors as Arthur Penn, John Huston and the legendary Charles Chaplin, and with such top-drawer co-stars as David Niven, Yul Brynner, Sophia Loren and Taylor. The rap on Brando in the 1960s was that a great talent had ruined his potential to be America's answer to Laurence Olivier, as his friend William Redfield limned the dilemma in his book \"Letters from an Actor\" (1967), a memoir about Redfield's appearance in Burton's 1964 theatrical production of \"Hamlet.\" By failing to go back on stage and recharge his artistic batteries, something British actors such as Burton were not afraid to do, Brando had stifled his great talent, by refusing to tackle the classical repertoire and contemporary drama. Actors and critics had yearned for an American response to the high-acting style of the Brits, and while Method actors such as Rod Steiger tried to create an American style, they were hampered in their quest, as their king was lost in a wasteland of Hollywood movies that were beneath his talent. Many of his early supporters now turned on him, claiming he was a crass sellout. Despite evidence in such films as The Appaloosa (1966) and Reflections in a Golden Eye (1967) that Brando was in fact doing some of the best acting of his life, critics, perhaps with an eye on the box office, slammed him for failing to live up to, and nurture, his great gift. Brando's political activism, starting in the early 1960s with his championing of Native Americans' rights, followed by his participation in the Southern Christian Leadership Conference's March on Washington in 1963, and followed by his appearance at a Black Panther rally in 1968, did not win him many admirers in the establishment. In fact, there was a de facto embargo on Brando films in the recently segregated (officially, at least) southeastern US in the 1960s. Southern exhibitors simply would not book his films, and producers took notice. After 1968, Brando would not work for three years. Pauline Kael wrote of Brando that he was Fortune's fool. She drew a parallel with the latter career of John Barrymore, a similarly gifted thespian with talents as prodigious, who seemingly threw them away. Brando, like the late-career Barrymore, had become a great ham, evidenced by his turn as the faux Indian guru in the egregious Candy (1968), seemingly because the material was so beneath his talent. Most observers of Brando in the 1960s believed that he needed to be reunited with his old mentor Elia Kazan, a relationship that had soured due to Kazan's friendly testimony naming names before the notorious House Un-American Activities Committee. Perhaps Brando believed this, too, as he originally accepted an offer to appear as the star of Kazan's film adaptation of his own novel, The Arrangement (1969). However, after the assassination of Martin Luther King, Brando backed out of the film, telling Kazan that he could not appear in a Hollywood film after this tragedy. Also reportedly turning down a role opposite box-office king Paul Newman in a surefire script, Butch Cassidy and the Sundance Kid (1969), Brando decided to make Burn! (1969) with Pontecorvo. The film, a searing indictment of racism and colonialism, flopped at the box office but won the esteem of progressive critics and cultural arbiters such as Howard Zinn. He subsequently appeared in the British film The Nightcomers (1971), a prequel to \"Turn of the Screw\" and another critical and box office failure. Kazan, after a life in film and the theater, said that, aside from Orson Welles, whose greatness lay in filmmaking, he only met one actor who was a genius: Brando. Richard Burton, an intellectual with a keen eye for observation if not for his own film projects, said that he found Brando to be very bright, unlike the public perception of him as a Terry Malloy-type character that he himself inadvertently promoted through his boorish behavior. Brando's problem, Burton felt, was that he was unique, and that he had gotten too much fame too soon at too early an age. Cut off from being nurtured by normal contact with society, fame had distorted Brando's personality and his ability to cope with the world, as he had not had time to grow up outside the limelight. Truman Capote, who eviscerated Brando in print in the mid-'50s and had as much to do with the public perception of the dyslexic Brando as a dumbbell, always said that the best actors were ignorant, and that an intelligent person could not be a good actor. However, Brando was highly intelligent, and possessed of a rare genius in a then-deprecated art, acting. The problem that an intelligent performer has in movies is that it is the director, and not the actor, who has the power in his chosen field. Greatness in the other arts is defined by how much control the artist is able to exert over his chosen medium, but in movie acting, the medium is controlled by a person outside the individual artist. It is an axiom of the cinema that a performance, as is a film, is \"created\" in the cutting room, thus further removing the actor from control over his art. Brando had tried his hand at directing, in controlling the whole artistic enterprise, but he could not abide the cutting room, where a film and the film's performances are made. This lack of control over his art was the root of Brando's discontent with acting, with movies, and, eventually, with the whole wide world that invested so much cachet in movie actors, as long as \"they\" were at the top of the box-office charts. Hollywood was a matter of \"they\" and not the work, and Brando became disgusted. Charlton Heston, who participated in Martin Luther King's 1963 March on Washington with Brando, believes that Marlon was the great actor of his generation. However, noting a story that Brando had once refused a role in the early 1960s with the excuse \"How can I act when people are starving in India?\", Heston believes that it was this attitude, the inability to separate one's idealism from one's work, that prevented Brando from reaching his potential. As Rod Steiger once said, Brando had it all, great stardom and a great talent. He could have taken his audience on a trip to the stars, but he simply would not. Steiger, one of Brando's children even though a contemporary, could not understand it. When James Mason' was asked in 1971 who was the best American actor, he had replied that since Brando had let his career go belly-up, it had to be George C. Scott, by default. Paramount thought that only Laurence Olivier would suffice, but Lord Olivier was ill. The young director believed there was only one actor who could play godfather to the group of Young Turk actors he had assembled for his film, The Godfather of method acting himself - Marlon Brando. Francis Ford Coppola won the fight for Brando, Brando won - and refused - his second Oscar, and Paramount won a pot of gold by producing the then top-grossing film of all-time, The Godfather (1972), a gangster movie most critics now judge one of the greatest American films of all time. Brando followed his iconic portrayal of Don Corleone with his Oscar-nominated turn in the high-grossing and highly scandalous Le dernier Tango à Paris (1972) (\"Last Tango in Paris\"), the first film dealing explicitly with sexuality in which an actor of Brando's stature had participated. He was now again a Top-Ten box office star and once again heralded as the greatest actor of his generation, an unprecedented comeback that put him on the cover of \"Time\" magazine and would make him the highest-paid actor in the history of motion pictures by the end of the decade. Little did the world know that Brando, who had struggled through many projects in good faith during the 1960s, delivering some of his best acting, only to be excoriated and ignored as the films did not do well at the box office, essentially was through with the movies. After reaching the summit of his career, a rarefied atmosphere never reached before or since by any actor, Brando essentially walked away. He would give no more of himself after giving everything as he had done in Le dernier Tango à Paris (1972)\", a performance that embarrassed him, according to his autobiography. Brando had come as close to any actor to being the \"auteur,\" or author, of a film, as the English-language scenes of \"Tango\" were created by encouraging Brando to improvise. The improvisations were written down and turned into a shooting script, and the scripted improvisations were shot the next day. Pauline Kael, the Brando of movie critics in that she was the most influential arbiter of cinematic quality of her generation and spawned a whole legion of Kael wanna-bes, said Brando's performance in Le dernier Tango à Paris (1972) had revolutionized the art of film. Brando, who had to act to gain his mother's attention; Brando, who believed acting at best was nothing special as everyone in the world engaged in it every day of their lives to get what they wanted from other people; Brando, who believed acting at its worst was a childish charade and that movie stardom was a whorish fraud, would have agreed with Sam Peckinpah's summation of Pauline Kael: \"Pauline's a brilliant critic but sometimes she's just cracking walnuts with her ass.\" Probably in a simulacrum of those words, too. After another three-year hiatus, Brando took on just one more major role for the next 20 years, as the bounty hunter after Jack Nicholson in Arthur Penn's The Missouri Breaks (1976), a western that succeeded neither with the critics or at the box office. Following The Godfather and Tango, Brando's performance was disappointing for some reviewers, who accused him of giving an erratic and inconsistent performance. In 1977, Brando made a rare appearance on television in the miniseries Roots: The Next Generations (1979), portraying George Lincoln Rockwell; he won a Primetime Emmy Award for Outstanding Supporting Actor in a Miniseries or a Movie for his performance. In 1978, he narrated the English version of Raoni (1978), a French-Belgian documentary film directed by Jean-Pierre Dutilleux and Luiz Carlos Saldanha that focused on the life of Raoni Metuktire and issues surrounding the survival of the indigenous Indian tribes of north central Brazil. Later in his career, Brando concentrated on extracting the maximum amount of capital for the least amount of work from producers, as when he got the Salkind brothers to pony up a then-record $3.7 million against 10% of the gross for 13 days work on Superman (1978). Factoring in inflation, the straight salary for \"Superman\" equals or exceeds the new record of $1 million a day Harrison Ford set with K-19: The Widowmaker (2002). He agreed to the role only on assurance that he would be paid a large sum for what amounted to a small part, that he would not have to read the script beforehand, and his lines would be displayed somewhere off-camera. Brando also filmed scenes for the movie's sequel, Superman II, but after producers refused to pay him the same percentage he received for the first movie, he denied them permission to use the footage. Before cashing his first paycheck for Superman (1978), Brando had picked up $2 million for his extended cameo in Francis Ford Coppola's Apocalypse Now (1979) in a role, that of Col. Kurtz, that he authored on-camera through improvisation while Coppola shot take after take. It was Brando's last bravura star performance. He co-starred with George C. Scott and John Gielgud in La formule (1980), but the film was another critical and financial failure. Years later though, he did receive an eighth and final Oscar nomination for his supporting role in A Dry White Season (1989) after coming out of a near-decade-long retirement. Contrary to those who claimed he now only was in it for the money, Brando donated his entire seven-figure salary to an anti-apartheid charity. He then did an amusing performance in the comedy The Freshman (1990), winning rave reviews. He portrayed Tomas de Torquemada in the historical drama 1492: Christophe Colomb (1992), but his performance was denounced and the film was another box office failure. He made another comeback in the Johnny Depp romantic drama Don Juan DeMarco (1994), which co-starred Faye Dunaway as his wife. He then appeared in The Island of Dr. Moreau (1996), co-starring Val Kilmer, who he didn't get along with. The filming was an unpleasant experience for Brando, as well as another critical and box office failure. Brando had first attracted media attention at the age of 24, when \"Life\" magazine ran a photo of himself and his sister Jocelyn, who were both then appearing on Broadway. The curiosity continued, and snowballed. Playing the paraplegic soldier of The Men (1950), Brando had gone to live at a Veterans Administration hospital with actual disabled veterans, and confined himself to a wheelchair for weeks. It was an acting method, research, that no one in Hollywood had ever heard of before, and that willingness to experience life.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDYyMDE5OF5BMl5BanBnXkFtZTcwNjgyNTEzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000008","name":"Marlon Brando","nicknames":["Bud","Mr Mumbles"],"idIMDB":"nm0000008"},"actorId":"nm0000008","character":"Paul","urlCharacter":"http://www.imdb.com/character/ch0018164","main":true},{"actorName":"Maria Schneider","urlProfile":"http://www.imdb.com/name/nm0773932","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODE3Njg0MF5BMl5BanBnXkFtZTcwMjgyNTEzNA@@._V1_UY44_UX32_AL_.jpg","biography":{"dateOfBirth":"27 March 1952","placeOfBirth":" Paris, France","birthName":"Marie Christine Gélin","height":"5' 6\" (1.68 m)","bio":"Maria Schneider was born on March 27, 1952 in Paris, France as Marie Christine Gélin. She was an actress, known for Le dernier Tango à Paris (1972), The Passenger (1975) and Memoirs of a French Whore (1979). She died on February 3, 2011 in Paris.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODE3Njg0MF5BMl5BanBnXkFtZTcwMjgyNTEzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0773932","name":"Maria Schneider","idIMDB":"nm0773932"},"actorId":"nm0773932","character":"Jeanne","urlCharacter":"http://www.imdb.com/character/ch0018165","main":true},{"actorName":"Maria Michi","urlProfile":"http://www.imdb.com/name/nm0585170","urlPhoto":"","biography":{"dateOfBirth":"14 May 1921","placeOfBirth":" Rome, Lazio, Italy","bio":"First a typist at a law firm, young Maria Michi then became an usherette at Teatro Quattro Fontane in Rome. She was in the right place to become an actress, for was soon noticed and given small parts in the company of Sergio Stofano and Diana Torreri during the 1942-1943 season. Her first major assignment was in the revue 'Con un palmo di naso' with 'Toto' and Anna Magnani. Her companion at that time was screenwriter Sergio Amidei, which was another chance, since he introduced her to Roberto Rossellini. Hence a breathtaking debut for the beautiful young actress who appeared in two masterpieces of Italian neorealism on the run: Open City (in which she was the two-faced fiancée of a resistant) and Paisan (where she was the moving Francesca, an ordinary girl turned prostitute due to the postwar circumstances). Her next films paled by comparison and Maria Michi, disappointed by the turn of her career, quit the movie world for no less than thirteen years. During this period she married Prince Augusto Torlonia and returned to the theatre. She made her comeback in 1960 and for fifteen years Maria Michi, now a very good mature character actress, appeared in small parts in good movies signed Claude Chabrol, Bernardo Bertolucci, Peter Del Monte and Mauro Bolognini. She also did worthwhile radio and television work. She retired in 1976 and died too young at the age of fifty-eight.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0585170","name":"Maria Michi","idIMDB":"nm0585170"},"actorId":"nm0585170","character":"Rosa's Mother / La mère de Rosa","urlCharacter":"http://www.imdb.com/character/ch0456993","main":true},{"actorName":"Giovanna Galletti","urlProfile":"http://www.imdb.com/name/nm0302815","urlPhoto":"","biography":{"dateOfBirth":"27 June 1916","placeOfBirth":" Bangkok, Thailand","bio":"Giovanna Galletti was born on June 27, 1916 in Bangkok, Thailand. She was an actress, known for Le dernier Tango à Paris (1972), Rome, ville ouverte (1945) and The Big Red One (1980). She died on April 21, 1992 in Rome, Lazio, Italy.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0302815","name":"Giovanna Galletti","idIMDB":"nm0302815"},"actorId":"nm0302815","character":"Prostitute / La prostituée","urlCharacter":"http://www.imdb.com/character/ch0456992","main":true},{"actorName":"Gitt Magrini","urlProfile":"http://www.imdb.com/name/nm0536507","urlPhoto":"","biography":{"dateOfBirth":"3 October 1914","placeOfBirth":" Zoagli, Liguria, Italy","birthName":"Rosa Chiari Solari","bio":"Gitt Magrini was born on October 3, 1914 in Zoagli, Liguria, Italy as Rosa Chiari Solari. She was a costume designer and actress, known for Le dernier Tango à Paris (1972), The Conformist (1970) and 1900 (1976). She died on July 10, 1977 in Rome, Lazio, Italy.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0536507","name":"Gitt Magrini","idIMDB":"nm0536507"},"actorId":"nm0536507","character":"Jeanne's Mother / La mère de Jeanne","urlCharacter":"http://www.imdb.com/character/ch0456991","main":true},{"actorName":"Catherine Allégret","urlProfile":"http://www.imdb.com/name/nm0021691","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTllMDU1NDktNGQ4MC00ZjE2LWIwMDEtZjRiNGY3OTE1OWY4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 April 1946","placeOfBirth":" Neuilly-sur-Seine, Seine [now Hauts-de-Seine], France","bio":"Catherine Allégret was born on April 16, 1946 in Neuilly-sur-Seine, Seine [now Hauts-de-Seine], France. She is an actress and writer, known for La Vie en Rose (2007), Navarro (1989) and Le dernier Tango à Paris (1972). She has been married to Maurice Vaudaux since May 28, 1984. They have one child. She was previously married to Jean-Pierre Castaldi.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTllMDU1NDktNGQ4MC00ZjE2LWIwMDEtZjRiNGY3OTE1OWY4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0021691","name":"Catherine Allégret","idIMDB":"nm0021691"},"actorId":"nm0021691","character":"Catherine","urlCharacter":"http://www.imdb.com/character/ch0456990","main":true},{"actorName":"Luce Marquand","urlProfile":"http://www.imdb.com/name/nm0549656","urlPhoto":"","biography":{"bio":"Luce Marquand is an actress, known for Le dernier Tango à Paris (1972), Une journée bien remplie ou Neuf meurtres insolites dans une même journée par un seul homme dont ce n'est pas le métier (1973) and Défense de savoir (1973).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0549656","name":"Luce Marquand","idIMDB":"nm0549656"},"actorId":"nm0549656","character":"Olympia","urlCharacter":"http://www.imdb.com/character/ch0456989","main":true},{"actorName":"Marie-Hélène Breillat","urlProfile":"http://www.imdb.com/name/nm0106925","urlPhoto":"","biography":{"dateOfBirth":"2 June 1947","placeOfBirth":" Talence, Gironde, France","bio":"Marie-Hélène Breillat was born on June 2, 1947 in Talence, Gironde, France. She is an actress, known for Le dernier Tango à Paris (1972), Dracula and Son (1976) and Tapage nocturne (1979).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0106925","name":"Marie-Hélène Breillat","idIMDB":"nm0106925"},"actorId":"nm0106925","character":"Monique","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Catherine Breillat","urlProfile":"http://www.imdb.com/name/nm0106924","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NzIyMDEwMF5BMl5BanBnXkFtZTYwNjMxMTk2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 July 1948","placeOfBirth":" Bressuire, Deux-Sèvres, France","bio":"Catherine Breillat is a Paris based filmmaker and writer who became famous for her distinctively personal films on sexuality, gender trouble and sibling rivalry. Accused of being a \"porno auteuriste\", Breillat allowed for an unbiased view of sexuality and extended the language of mainstream movies. She is also a best-selling novelist and wrote her first novel, L'Homme Facile, at the age of 17. Breillat acted in Bernardo Bertolucci's Le dernier Tango à Paris (1972) and wrote the screenplay for Maurice Pialat's movie Police (1985) . Since her first own film A Real Young Girl (1976), which was released 23 years after its shooting, Breillat explored critically as well as in an innovative way the perceptions imposed on female sexuality, related family and coming of age issues.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NzIyMDEwMF5BMl5BanBnXkFtZTYwNjMxMTk2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0106924","name":"Catherine Breillat","idIMDB":"nm0106924"},"actorId":"nm0106924","character":"Mouchette","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dan Diament","urlProfile":"http://www.imdb.com/name/nm0224576","urlPhoto":"","biography":{"bio":"Dan Diament is an actor, known for Le dernier Tango à Paris (1972).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0224576","name":"Dan Diament","idIMDB":"nm0224576"},"actorId":"nm0224576","character":"TV Sound Engineer / L'ingénieur du son","urlCharacter":"http://www.imdb.com/character/ch0456984","main":true},{"actorName":"Catherine Sola","urlProfile":"http://www.imdb.com/name/nm0812568","urlPhoto":"","biography":{"dateOfBirth":"19 January 1941","placeOfBirth":" Saint-Jean-de-Maurienne, France","bio":"Catherine Sola was born on January 19, 1941 in Saint-Jean-de-Maurienne, France. She was an actress, known for Le dernier Tango à Paris (1972), Stand-by (2000) and Le premier homme (2011). She was married to Alain d'Hénaut. She died on September 12, 2014 in Périgueux, Dordogne, France.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0812568","name":"Catherine Sola","idIMDB":"nm0812568"},"actorId":"nm0812568","character":"TV Script Girl / La script-girl","urlCharacter":"http://www.imdb.com/character/ch0456985","main":true},{"actorName":"Mauro Marchetti","urlProfile":"http://www.imdb.com/name/nm0545578","urlPhoto":"","biography":{"dateOfBirth":"1946","placeOfBirth":" Naples, Campania, Italy","bio":"Mauro Marchetti was born in 1946 in Naples, Campania, Italy. He is known for his work on Apocalypse Now (1979), Cemetery Man (1994) and Le dernier empereur (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0545578","name":"Mauro Marchetti","idIMDB":"nm0545578"},"actorId":"nm0545578","character":"TV Cameraman / Le cameraman","urlCharacter":"http://www.imdb.com/character/ch0456987","main":true},{"actorName":"Jean-Pierre Léaud","urlProfile":"http://www.imdb.com/name/nm0529543","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NTA2MTQyMF5BMl5BanBnXkFtZTcwNDQ0MzA5Ng@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 May 1944","placeOfBirth":" Paris, France","height":"5' 7\" (1.7 m)","bio":"Jean-Pierre Léaud is not everybody's cup of tea for sure, but will remain an important name in film history. As an actor he can be adored or hated for exactly the same reasons: he is one of those rare players that directors let improvise his dialogue, which gets on certain viewers' nerves while it fascinates others. The same is true for his very personal staccato diction and elocution and his many mannerisms, the most obvious one being his way to run his hand through his long hair. But there is no denying Léaud is not just another actor, whether you love him or are allergic to him. The son of actress Jacqueline Pierreux and scriptwriter/assistant director Pierre Léaud, Jean-Pierre started acting very early. Indeed, he was only thirteen when he first appeared on a screen, playing a small role in a swashbuckling film directed by veteran Georges Lampin \"la Tour, prends garde!\" (1957). And he was still only fourteen when he answered an ad placed in a newspaper by François Truffaut, who was seeking a young actor able to play Antoine Doinel, a troubled adolescent, in his first feature film \"The 400 blows\". Jean-Pierre was tested among a hundred other candidates and proved so amazingly spontaneous and so gifted for improvisation that not only was he hired but he would go on to play the role in four subsequent Truffaut semi-autobiographies concluding with \"Love on the run\" (1978), a unique experience indeed. Thanks to Truffaut he was introduced to the other stars of the French New Wave, mainly Jean-Luc Godard for whom he would appear in eight films and one TV film, and gradually became their icon. Not too sure about his acting talents, he planned to become a director (which he actually did only once) and worked as an assistant to Truffaut and Godard. But his success both as Truffaut's alter ego and as the leftist movie makers' spokesman encouraged him to go on playing rather than directing. \"Masculin Féminin\" (1966) by Godard even earned him an Award for Best Actor at the Berlin Film Festival. An ardent leftist militant himself, he worked with equally committed directors, including abroad. He was in Italian Pasolini's \"Porcile\" (1968), in Polish Skolimovski's \"Dialog 20-40-60\" (also '68) Brazilian Carlos Diegues' Os herdeiros (1970) and Glauber Rocha's Der Leone have sept cabeças (1971). Bertolucci also hired him for \"Last tango in Paris\" starring Marlon Brando (who so petrified Léaud that he could not play his scenes alongside him), but this one was filmed in Paris. This busy period ended after an excellent role in a classic art movie in the French style: Jean Eustache's \"La maman et la putain\". In the late seventies and throughout the eighties Léaud worked irregularly, mainly on television, occasionally giving a crazy performance in a mainstream film, as was the case in Josiane's Balasko crime comedy \"Les keufs\", for which he got a César nomination. But he made an exciting comeback in the nineties when several \"new New Wave\" directors hired Léaud to pay homage to their elders. Among them French movie makers such as Olivier Assayas, Danièle Dubroux , Serge Le Péron or Bertrand Bonello and foreigners like Finnish Aki Käurismäki and Taiwanese Tsai Ming-Liang. A second youth for eternally young, rebellious, ill-at-ease, annoyingly romantic,touchingly annoying Jean-Pierre Léaud, whose round face staring at the camera in the last shot of \"The 400 blows\" will never be forgotten.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NTA2MTQyMF5BMl5BanBnXkFtZTcwNDQ0MzA5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0529543","name":"Jean-Pierre Léaud","idIMDB":"nm0529543"},"actorId":"nm0529543","character":"Tom - un cinéaste, le fiancé de Jeanne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Massimo Girotti","urlProfile":"http://www.imdb.com/name/nm0320988","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MDgzMDg4MF5BMl5BanBnXkFtZTYwOTA2NTA3._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 May 1918","placeOfBirth":" Mogliano, Marche, Italy","bio":"Manly, chiseled, exceedingly handsome, very agile Massimo Girotti was an engineering student and polo/swimming star before entering films in 1939. He began auspiciously in serious leads, most notably Roberto Rossellini's Desire (1946), Luchino Visconti's Les amants diaboliques (1943) and Vittorio De Sica's La porte du ciel (1945), while his physical stature and all-round athletism were put to good use in actioneers such as Sins of Rome (1953) in which he played the pre-Kirk Douglas slave-turned-leader role of Spartacus. By the 60s, however, Girotti was reduced to support roles in swashbuckling adventure and badly-dubbed sand-and-spear spectacles, appearing only occasionally in well-mounted films of quality, such as Pier Paolo Pasolini's Teorema (1968), Bernardo Bertolucci's Le dernier Tango à Paris (1972) and Visconti's L'innocent (1976). He died only a few weeks before the release of his last film, Ferzan Ozpetek's Facing Windows (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MDgzMDg4MF5BMl5BanBnXkFtZTYwOTA2NTA3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0320988","name":"Massimo Girotti","idIMDB":"nm0320988"},"actorId":"nm0320988","character":"Marcel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Schommer","urlProfile":"http://www.imdb.com/name/nm0774731","urlPhoto":"","biography":{"bio":"Peter Schommer is an actor, known for Le dernier Tango à Paris (1972).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0774731","name":"Peter Schommer","idIMDB":"nm0774731"},"actorId":"nm0774731","character":"TV Assistant Cameraman / L'assistant-opérateur","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0070849","urlIMDB":"http://www.imdb.com/title/tt0070849","business":{"budget":{"money":"$1,250,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$45,000,000 (worldwide)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"SEK","country":"2,704,423","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1973/\">1973</a>"},{"money":"$21,000,000 (Worldwide)","country":"except","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1972/\">1972</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 9 min (129 min)","2 hr 7 min (127 min) (R-rated) (USA)","4 hr 10 min (250 min) (rough cut)"],"soundMix":["Mono"],"color":["Color (Technicolor)"],"aspectRatio":["1.75 : 1"],"camera":["Mitchell BNCR"],"laboratory":["Technicolor, USA"],"filmLength":["3,533 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.1","metascore":"77","filmingLocations":[{"location":"26 rue Vavin, Paris 6, Paris, France"}],"rated":"R","awards":[{"award":"Academy Awards, USA 1974","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Actor in a Leading Role","names":[{"name":"Marlon Brando","id":"nm0000008","role":null}]},{"category":"Best Director","names":[{"name":"Bernardo Bertolucci","id":"nm0000934","role":null}]}]}]},{"award":"Golden Globes, USA 1974","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Motion Picture - Drama","names":[]},{"category":"Best Director - Motion Picture","names":[{"name":"Bernardo Bertolucci","id":"nm0000934","role":null}]}]}]},{"award":"BAFTA Awards 1974","titlesAwards":[{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best Actor","names":[{"name":"Marlon Brando","id":"nm0000008","role":null}]}]}]},{"award":"David di Donatello Awards 1973","titlesAwards":[{"titleAwardOutcome":"Won Special David","categories":[{"category":"","names":[{"name":"Maria Schneider","id":"nm0773932","role":null},{"name":"Cari genitori","id":"tt0068338","role":null}]}]}]},{"award":"Directors Guild of America, USA 1974","titlesAwards":[{"titleAwardOutcome":"Nominated DGA Award","categories":[{"category":"Outstanding Directorial Achievement in Motion Pictures","names":[{"name":"Bernardo Bertolucci","id":"nm0000934","role":null}]}]}]},{"award":"Golden Goblets, Italy 1973","titlesAwards":[{"titleAwardOutcome":"Won Golden Goblet","categories":[{"category":"Best Director (Migliore Regista)","names":[{"name":"Bernardo Bertolucci","id":"nm0000934","role":null}]}]}]},{"award":"Golden Screen, Germany 1974","titlesAwards":[{"titleAwardOutcome":"Won Golden Screen","categories":[{"category":"","names":[]}]}]},{"award":"Grammy Awards 1974","titlesAwards":[{"titleAwardOutcome":"Nominated Grammy","categories":[{"category":"Album of Best Original Score Written for a Motion Picture","names":[{"name":"Gato Barbieri","id":"nm0053658","role":null}]}]}]},{"award":"Italian National Syndicate of Film Journalists 1973","titlesAwards":[{"titleAwardOutcome":"Won Silver Ribbon","categories":[{"category":"Best Director (Regista del Miglior Film)","names":[{"name":"Bernardo Bertolucci","id":"nm0000934","role":null}]}]}]},{"award":"National Society of Film Critics Awards, USA 1974","titlesAwards":[{"titleAwardOutcome":"Won NSFC Award","categories":[{"category":"Best Actor","names":[{"name":"Marlon Brando","id":"nm0000008","role":null}]}]},{"titleAwardOutcome":"2nd place NSFC Award","categories":[{"category":"Best Film","names":[]}]},{"titleAwardOutcome":"Nominated NSFC Award","categories":[{"category":"Best Actress","names":[{"name":"Maria Schneider","id":"nm0773932","role":null}]}]}]},{"award":"New York Film Critics Circle Awards 1974","titlesAwards":[{"titleAwardOutcome":"Won NYFCC Award","categories":[{"category":"Best Actor","names":[{"name":"Marlon Brando","id":"nm0000008","role":null}]}]}]}],"votes":"39,052","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026336","name":"Les Productions Artistes Associés"},{"idCompany":"co0013844","name":"Produzioni Europee Associati (PEA)"}],"keywords":{"keywords":["apartment","sex standing up","sex in bed","older man younger woman relationship","sexual intercourse","attempted rape","mother daughter relationship","grief","french prostitute","lust","erotica","controversy","sex talk","sadness","rage","nudity","famous score","anger","film within a film","self discovery","tango","sex between cousins","dance hall","sex with food","prostitute","paris france","hotel","cage elevator","balcony","assault","filmmaker","female removes her clothes","black panties","female full frontal nudity","female masturbation","no panties","female pubic hair","pubic hair","panties","nipples","female rear nudity","elevator","female nudity","rough sex","american expatriate","suicide","woman","street","room","death","director","sex scene","jazz score","rear entry sex","sex on floor","female removes her dress","mini dress","fondling","breasts","scantily clad female","cleavage","sex with a stranger","harmonica","masturbation","promiscuity","woman in bathtub","leg spreading","erotic 70s","place name in title","wrath","telephone","telephone call","restaurant","falling from height","dead woman","dancing","crying","city","bridge","bitterness","bathtub","apartment building","father daughter relationship","widow","widower","subway station","restroom","phone booth","dentures","cuckold","anonymous sex","chewing gum","city name in title","butter","obsessive love","wedding dress","mother in law","electra complex","broom","rat","rainstorm","premarital sex","obsession","murder","mooning","marriage proposal","loss of wife","loss of daughter","filmmaking","dating","dance contest","cheating on one's boyfriend","chase","breakup","wake","blockbuster","tragedy","promiscuous woman","lifting skirt","upskirt","anal sex","male rear nudity","fingering","male nudity","female frontal nudity"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:32:17"}}