{"data":{"movies":[{"title":"The Big Circus","originalTitle":"","year":"1959","releaseDate":"19590705","directors":[{"name":"Joseph M. Newman","id":"nm0628149"}],"writers":[{"name":"Irwin Allen","id":"nm0000740"},{"name":"Charles Bennett","id":"nm0071657"}],"runtime":"109 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTdlYWVlOWUtOGU0Yy00NzcxLWJhN2MtYzY3NGY4YzY3ZDA1XkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama"],"plot":"After splitting with his longtime business partner, Hank Whirling is about to take his big top circus on tour. He manages to get a loan and some investment money but has to take on one of their employees, Randy Sherman, to keep an eye on the finances. Sherman immediately hires a new press agent, Helen Harrison, over Hank's objections. After a series of accidents, they soon realize that they have a saboteur in the company. With financial problems increasing, Whirling looks to take the the show to New York City before his former partner Jules Borman can get his circus there. He realizes that he'll need a lot of publicity and trapeze and high wire artist Zach Colino agrees to walk the wire across Niagara Falls. After the circus train is sabotaged - killing Zach's wife and several others - they race to Niagara Falls to complete the high wire act but Zach may not be up it. The saboteur working for Borman bides his time and is planning another death.","simplePlot":"A circus owner tries to keep his financially troubled circus on the road, despite the efforts of a murderous saboteur who has decided that the show must not go on.","actors":[{"actorName":"Victor Mature","urlProfile":"http://www.imdb.com/name/nm0001514","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTEwODM0MjA0Nl5BMl5BanBnXkFtZTYwNDU1MzM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 1913","placeOfBirth":" Louisville, Kentucky, USA","birthName":"Victor John Mature","height":"6' 2\" (1.88 m)","bio":"American leading man Victor John Mature was born in Louisville, Kentucky, to Clara P. (Ackley) and Marcellus George Mature, a cutler and knife sharpener. His father, born Marcello Gelindo Maturi in Pinzolo, Trentino, was Italian, and his mother was of Swiss-German and German descent. Mature worked as a teenager with his father as a salesman for butcher supplies. Hoping to become an actor, he studied at the Pasadena Playhouse in California. He auditioned for Gone with the Wind (1939) for the role ultimately played by his fellow Playhouse student, George Reeves. After achieving some acclaim in his first few films, he served in the Coast Guard in World War II. Mature became one of Hollywood's busiest and most popular actors after the war, though rarely was he given the critical respect he often deserved. His roles in John Ford's My Darling Clementine (1946) and in Henry Hathaway's Kiss of Death (1947) were among his finest work, though he moved more and more frequently into more exotic roles in films like Samson and Delilah (1949) and The Egyptian (1954). Never an energetic actor nor one of great artistic pretensions, he nevertheless continued as a Hollywood stalwart both in programme and in more prominent films like The Robe (1953). More interested in golf than acting, his appearances diminished through the 1960s, but he made a stunning comeback of sorts in a hilarious romp as a very Victor Mature-like actor in Neil Simon's After the Fox (1966). Golf eventually took over his activities and, after a cameo as Samson's father in a TV remake of his own \"Samson and Delilah\" (Samson and Delilah (1984)), he retired for good. Rumors occasionally surfaced of another comeback, most notably in a never-realized remake of Red River (1948) with Sylvester Stallone, but none came to fruition. He died of cancer at his Rancho Santa Fe, California, home in 1999.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTEwODM0MjA0Nl5BMl5BanBnXkFtZTYwNDU1MzM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001514","name":"Victor Mature","nicknames":["Beautiful Hunk of Man","The Hunk"],"idIMDB":"nm0001514"},"actorId":"nm0001514","character":"Henry Jasper 'Hank' Whirling","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Red Buttons","urlProfile":"http://www.imdb.com/name/nm0000999","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MDI4ODY1NF5BMl5BanBnXkFtZTYwMjczNTc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1919","placeOfBirth":" New York City, New York, USA","birthName":"Aaron Chwatt","height":"5' 6\" (1.68 m)","bio":"Composer, actor, comedian and author, he joined ASCAP in 1963 and wrote several popular songs (which he often personally performed), including \"Strange Things Are Happening\" and \"The Ho-Ho Song\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MDI4ODY1NF5BMl5BanBnXkFtZTYwMjczNTc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000999","name":"Red Buttons","idIMDB":"nm0000999"},"actorId":"nm0000999","character":"Randy Sherman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rhonda Fleming","urlProfile":"http://www.imdb.com/name/nm0281766","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5NzIzMjIzMDReQTJeQWpwZ15BbWU2MDg1MTkxNg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1923","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Marilyn Louis","height":"5' 6\" (1.68 m)","bio":"A native-born Californian, Rhonda Fleming attended Beverly Hills public and private schools. Her mother, Effie Graham, was a famous model and actress in New York. She has a son (Kent Lane), two granddaughters (Kimberly and Kelly) and four great-grandchildren (Wagner, Page, Lane and Cole). She has appeared in over 40 films, including David O. Selznick's Spellbound (1945), directed by Alfred Hitchcock; Jacques Tourneur's Out of the Past (1947); and Robert Siodmak's The Spiral Staircase (1946). She later got starring roles in such classics as A Connecticut Yankee in King Arthur's Court (1949), Gunfight at the O.K. Corral (1957), Home Before Dark (1958), Pony Express (1953), Slightly Scarlet (1956), While the City Sleeps (1956) and The Big Circus (1959). While she was always a competent actress, she was more renowned for her exquisite beauty, and the camera absolutely adored her. One time a cameraman on one of her films remarked on how he was so struck by her beauty that, as a gag, he intentionally tried to photograph her badly; he was astonished to discover that no matter how deliberately he botched it, she still came out looking ravishing. Among her co-stars over the years were Gregory Peck, Robert Mitchum, Kirk Douglas, Charlton Heston, Glenn Ford, Burt Lancaster, Bob Hope, Bing Crosby, Rock Hudson and Ronald Reagan (with whom she made four films). In addition to motion pictures, Fleming made her Broadway debut in Clare Boothe Luce's \"The Women\", essayed the role of \"Lalume\" in \"Kismet\" at the Los Angeles Music Center and toured as \"Madame Dubonnet\" in \"The Boyfriend\". She made her stage musical debut in Las Vegas at the opening of the Tropicana Hotel's showroom. Later she appeared at the Hollywood Bowl in a one-woman concert of Cole Porter and Irving Berlin compositions. She also starred in a national ten-week concert tour with Skitch Henderson, featuring the music of George Gershwin. She has guest-starred on numerous television series, including Wagon Train (1957), Police Woman (1974), The Love Boat (1977), Last Hours Before Morning (1975) and a two-hour special of McMillan & Wife (1971). Waiting for the Wind (1990) reunited her with former co-star Robert Mitchum. In private life she resides in Century City, California, and was married for 23 years to Ted Mann, a producer and chairman of Mann Theatres, until his death in January 2001. She is a member and supporter of Childhelp USA, ARCS (Achievement Rewards For College Scientists); a Life Associate of Pepperdine University; a Lifetime Member of the Freedoms Foundation at Valley Forge; a Founding Member of the French Foundation For Alzheimer Research; a Benefactor of the Los Angeles Music Center: and a Member of the Center's Blue Ribbon Board of Directors. She is a Member of the Advisory Board of Olive Crest Treatment Centers for Abused Children and serves as a Board of Directors Trustee of World Opportunities International. Along with her husband she helped build the Jerusalem Film Institute in Israel. She also is a member of the Board of Trustees of The UCLA Foundation and a member of the Board of Advisors of the Revlon/UCLA Women's Health Research Program. In addition, she created at the City of Hope Hospital The Rhonda Fleming Mann Research Fellowship to further advance research and treatment associated with women's cancer. In 1991, she and her husband established the Rhonda Fleming Mann Clinic for Women's Comprehensive Care at UCLA Medical Center. This clinic provides a full range of expert gynecologic and obstetric care to women. Since 1992, she has devoted her time to a second facility at UCLA - the Rhonda Fleming Mann Resource Center for Women with Cancer, which opened in early 1994. This Center is the fulfillment of her vision to create a safe, warm place where women cancer patients and their families might receive the highest quality psychosocial and emotional care as well as assistance with the complex practical problems that arise with cancer. In August 1997, the Center opened \"Reflections\", a unique retail store and consultation suite that carries wigs, head coverings, breast prostheses and other items to help men, women and children deal with the physical appearance changes brought on by cancer and its treatments. The staffs of the clinic, center and store are guided by her belief that caring, compassion, communication and commitment are essential components of the healing process.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5NzIzMjIzMDReQTJeQWpwZ15BbWU2MDg1MTkxNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0281766","name":"Rhonda Fleming","nicknames":["The Queen of Technicolor","Marilyn Lane"],"idIMDB":"nm0281766"},"actorId":"nm0281766","character":"Helen Harrison","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kathryn Grant","urlProfile":"http://www.imdb.com/name/nm0335497","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwOTY0NjAxMV5BMl5BanBnXkFtZTcwODYzNDQyNA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 November 1933","placeOfBirth":" Houston, Texas, USA","birthName":"Olive Kathryn Grandstaff","bio":"A pert, vivacious and absolutely stunning brunette, the former Kathryn Grant (nee Olive Kathryn Grandstaff) is now known publicly as Kathryn Crosby. She was born in the Deep South in 1933 and appeared on stage from age 3. A graduate of the University of Texas and a student nurse at one point, she found her way into films via the beauty pageant circuit. The fresh-faced hopeful soon rose through the standard starlet ranks from unbilled parts to chipper \"sis\" types and decorative love interests alongside filmdom's top male stars. She appeared opposite Richard Kiley in The Phenix City Story (1955), Tony Curtis in Mister Cory (1957), Jack Lemmon in Operation Mad Ball (1957), James Stewart in Anatomy of a Murder (1959) and Victor Mature in The Big Circus (1959), among others. Her best known role, however, was as the princess-in-distress in the special effects-laden epic fantasy The 7th Voyage of Sinbad (1958), which has since reached semi-cult status. For the most part, however, Kathryn was unchallenged as an actress and she retired rather uneventfully after marrying singer Bing Crosby in 1957. They had three children, including actress Mary Crosby of Dallas (1978) fame. Seemingly content with family life, she, along with her children, dutifully appeared opposite her husband singing and lightly joking in his many popular Christmas-special presentations and even hosted a couple of syndicated TV series, but that was about it. After Bing's death in 1977, however, she slowly involved herself in acting again, appearing every now and then on stage in such productions as \"Same Time, Next Year\", \"Charley's Aunt\" and a revival of the musical \"State Fair\" in 1996. In addition to authoring two sets of memoirs (\"Bing and Other Things\" and \"My Life with Bing\"), Kathryn annually hosts the Crosby Gold Tournament in Winston-Salem, North Carolina.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwOTY0NjAxMV5BMl5BanBnXkFtZTcwODYzNDQyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0335497","name":"Kathryn Grant","idIMDB":"nm0335497"},"actorId":"nm0335497","character":"Jeannie Whirling","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vincent Price","urlProfile":"http://www.imdb.com/name/nm0001637","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1OTEyNzcyNl5BMl5BanBnXkFtZTYwMTgwOTU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 May 1911","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Vincent Leonard Price Jr.","height":"6' 4\" (1.93 m)","bio":"Actor, writer, and gourmet, Vincent Leonard Price, Jr. was born in St Louis, Missouri, to Marguerite Cobb (Wilcox) and Vincent Leonard Price, Sr., president of the National Candy Company. He traveled through Europe, studied at Yale and became an actor. He made his screen debut in 1938, and after many minor roles, he began to perform in low-budget horror movies such as House of Wax (1953), achieving his first major success with House of Usher (1960). Known for his distinctive, low-pitched, creaky, atmospheric voice and his quizzical, mock-serious facial expressions, he went on to star in a series of acclaimed Gothic horror movies, such as Pit and the Pendulum (1961) and The Abominable Dr. Phibes (1971). He abandoned films in the mid-1970s, going on to present cooking programs for television - he wrote \"A Treasury of Great Recipes\" (1965) with his second wife, Mary Grant - but had two final roles in The Whales of August (1987) and Edward Scissorhands (1990). He also recorded many Gothic horror short stories for the spoken-word label Caedmon Records. Vincent Price died at age 82 of lung cancer and emphysema on October 25, 1993.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1OTEyNzcyNl5BMl5BanBnXkFtZTYwMTgwOTU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001637","name":"Vincent Price","nicknames":["The King of the Grand Guignol","The Merchant of Menace","The Renaissance Man"],"idIMDB":"nm0001637"},"actorId":"nm0001637","character":"Hans Hagenfeld","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gilbert Roland","urlProfile":"http://www.imdb.com/name/nm0738042","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY3NTU4NDUzMl5BMl5BanBnXkFtZTYwMjM1ODU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 December 1905","placeOfBirth":" Juarez, Chihuahua, Mexico","birthName":"Luis Antonio Dámaso de Alonso","height":"5' 10\" (1.78 m)","bio":"Luis Antonio Damaso de Alonso, later known as Gilbert Roland, was born in 1905 in Mexico. Following his parents to the USA, he did not become the bullfighter he had dreamed of being but became an actor instead. His Mexican roots, his half macho half romantic ways, his handsome virile figure helped him land roles in movies from the early twenties to 1982. A long and varied career in which Roland was in turns an extra, a matinée idol (Armand Duval in Camille (1926)), a Latin Lover, a star of English-speaking films made in Hollywood in the early 1930s, a Mexican bandit in B-Movies, The Cisco Kid in a series of six popular Westerns, a brilliant character in major A movies (John Huston's We Were Strangers (1949), Vincente Minnelli's The Bad and the Beautiful (1952); Anthony Mann's Thunder Bay (1953), John Ford's Cheyenne Autumn (1964)), a sinister character in Spaghetti Westerns... When he retired in 1982, twelve years before he died, he could be satisfied. His career had spanned six decades, the coming of sound had not ended it, he had played in all kinds of movies, he had held the most beautiful women in his arms, and maybe the most important thing, he had been given the opportunity to show his acting talents. Not every actor can boast such a life achievement.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY3NTU4NDUzMl5BMl5BanBnXkFtZTYwMjM1ODU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0738042","name":"Gilbert Roland","nicknames":["Amigo"],"idIMDB":"nm0738042"},"actorId":"nm0738042","character":"Zach Colino","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Lorre","urlProfile":"http://www.imdb.com/name/nm0000048","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MzM0ODQwOV5BMl5BanBnXkFtZTYwMjYwNjI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 June 1904","placeOfBirth":" Rózsahegy, Austria-Hungary [now Ruzomberok, Slovakia]","birthName":"László Löwenstein","height":"5' 3½\" (1.61 m)","bio":"As a youth Peter Lorre ran away from home, worked as a bank clerk and, after stage training in Vienna, made his acting debut in Zurich. He remained unknown, traveling for several years and acting in Germany, Austria and Switzerland, until Fritz Lang cast him as the psychopathic child killer in M (1931). After several more films in Germany, Lorre left as the Nazis came to power, going to Paris, London and, in 1935, Hollywood. He played Raskolnikov in Crime and Punishment (1935) and a series of Mr. Moto movies during the late 1930s. He began his pairing with Sydney Greenstreet as Joel Cairo in The Maltese Falcon (1941), continued in Casablanca (1942) and seven other films during the early 1940s. In Germany he wrote, directed and starred in L'homme perdu (1951). After that, somewhat heavier, he played in a string of not-so-stellar efforts, one exception being his role as a clown in The Big Circus (1959). He died the year he made his last movie, playing a stooge in Jerry Lewis' The Patsy (1964).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MzM0ODQwOV5BMl5BanBnXkFtZTYwMjYwNjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000048","name":"Peter Lorre","nicknames":["Lazzy","Europe's One Man Chamber of Horrors"],"idIMDB":"nm0000048"},"actorId":"nm0000048","character":"Skeeter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Nelson","urlProfile":"http://www.imdb.com/name/nm0625287","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODE5ODAyOV5BMl5BanBnXkFtZTcwNjMxNTIzNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 October 1936","placeOfBirth":" New York City, New York, USA","birthName":"David Oswald Nelson","bio":"David Nelson was born 24 October 1936, New York, New York to Ozzie Nelson and Harriet Nelson. He attended Hollywood High School. David was a film producer in Newport Beach and also directed several episodes of The Adventures of Ozzie & Harriet (1952). He started his own commercial production company. David had two boys by ex-wife, June Blair. Daniel Blair Nelson was born on August 20, 1962 and James Eric Nelson was born June 8, 1966 (both in Burbank, California at St. Joseph's Hospital) He married Yvonne O'Connor Huston in 1975, adopting her three children. His stepdaughter Teri Nelson was once married to game show host Chuck Woolery. His twin nephews Matthew and Gunnar perform as The Nelsons. Matthew Nelson also performs with Red37 and Gunnar Nelson is a radio host. Nephew Sam Nelson sings in h is orange and Niece Tracy Nelson is an accomplished actress.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODE5ODAyOV5BMl5BanBnXkFtZTcwNjMxNTIzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0625287","name":"David Nelson","nicknames":["Dave"],"idIMDB":"nm0625287"},"actorId":"nm0625287","character":"Tommy Gordon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adele Mara","urlProfile":"http://www.imdb.com/name/nm0544711","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmU3MTcwOGItZjNlZi00YTUyLWI2YTctZTM3YzRlOTNkZDY2XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1923","placeOfBirth":" Highland Park, Michigan, USA","birthName":"Adelaide Delgado","bio":"Born Adelaide Delgado in 1925, Spanish-American Adele Mara was a singer/dancer with Xavier Cugat and His Orchestra in Detroit by the age of 15. Cugat took the beautiful, brown-eyed brunette to New York where she was spotted by a Columbia talent scout and signed in 1942. There she played brisk leading ladies in a series of standard, uneventful \"B\" films including Vengeance of the West (1942) with Tex Ritter and Alias Boston Blackie (1942) starring Chester Morris. A couple of years later she was transformed into a sexy platinum blonde pin-up after signing up with Republic Studios. She kept herself quite busy there predominantly cast as senorita-types opposite cowboy stars Roy Rogers in Bells of Rosarita (1945) and Gene Autry in Twilight on the Rio Grande (1947). She was also fetching fodder in crime dramas including Blackmail (1947) and Web of Danger (1947) and a pleasant diversion in adventure pictures such as Wake of the Red Witch (1948) with John Wayne and The Avengers (1950). Arguably her best parts would come with Angel in Exile (1948) and Sands of Iwo Jima (1949), the latter again starring Duke Wayne. Seldom was she given the chance to prove her acting talents, however, and her film career waned in the early 1950s. Her last screen appearance would be in The Big Circus (1959) with Victor Mature. Adele subsequently moved into TV and was featured in a number of guest spots, primarily in westerns. She eventually settled down to raise a family after her marriage to TV mogul Roy Huggins who produced many hit shows including 77 Sunset Strip (1958) and Maverick (1957). She would appear as a guest in a number of them. The couple had three sons. Huggins died in 2002.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmU3MTcwOGItZjNlZi00YTUyLWI2YTctZTM3YzRlOTNkZDY2XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0544711","name":"Adele Mara","idIMDB":"nm0544711"},"actorId":"nm0544711","character":"Maria 'Mama' Colino","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Howard McNear","urlProfile":"http://www.imdb.com/name/nm0573830","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MjU3ODQwNl5BMl5BanBnXkFtZTcwNDA2ODcxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1905","placeOfBirth":" Los Angeles, California, USA","birthName":"Howard Terbell McNear","bio":"Although Los Angeles native Howard McNear had a long career on radio and in films, he will forever be remembered for his memorable - and scene-stealing - portrayal of Floyd the Barber in the long-running The Andy Griffith Show (1960) (actor Don Knotts once said that playing Floyd wasn't much of a stretch for McNear, as his real personality was pretty much like Floyd to begin with). McNear started his career in radio, where he played Doc Adams in \"Gunsmoke\" for many years. In films he often played congressmen, hotel managers or other such figures, although he did on occasion play villains. While working on the \"Andy Griffith Show\" he suffered a massive stroke. After he recuperated he had trouble using his arms and legs, and when he returned to work on the show he was always seen either in a close-up or sitting down (often in a chair outside the barber shop while chatting with Barney and Andy). He died in 1969 in Hollywood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MjU3ODQwNl5BMl5BanBnXkFtZTcwNDA2ODcxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0573830","name":"Howard McNear","idIMDB":"nm0573830"},"actorId":"nm0573830","character":"Mr. Lomax","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Watts","urlProfile":"http://www.imdb.com/name/nm0915114","urlPhoto":"","biography":{"dateOfBirth":"30 October 1912","placeOfBirth":" Clarksville, Tennessee, USA","bio":"Charles Watts was born on October 30, 1912 in Clarksville, Tennessee, USA. He was an actor, known for An Affair to Remember (1957), Giant (1956) and The Spirit of St. Louis (1957). He died on December 13, 1966 in Nashville, Tennessee.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0915114","name":"Charles Watts","idIMDB":"nm0915114"},"actorId":"nm0915114","character":"Jonathan T. Nelson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steve Allen","urlProfile":"http://www.imdb.com/name/nm0006752","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0NjEzNTYwOV5BMl5BanBnXkFtZTYwMjE0NzQ2._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 December 1921","placeOfBirth":" New York City, New York, USA","birthName":"Stephen Valentine Patrick William Allen","height":"6' 3\" (1.91 m)","bio":"Steve Allen was born on December 26, 1921 in New York City, New York, USA as Stephen Valentine Patrick William Allen. He was an actor, known for I've Got a Secret (1952), What's My Line? (1950) and Great Balls of Fire! (1989). He was married to Jayne Meadows and Dorothy Goodman. He died on October 30, 2000 in Encino, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0NjEzNTYwOV5BMl5BanBnXkFtZTYwMjE0NzQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006752","name":"Steve Allen","idIMDB":"nm0006752"},"actorId":"nm0006752","character":"Steve Allen","urlCharacter":"http://www.imdb.com/character/ch0550145","main":true}],"seasons":[],"idIMDB":"tt0052626","urlIMDB":"http://www.imdb.com/title/tt0052626","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"12","month":"01","year":"1959","remarks":null},null],"copyrightHolder":"© COPYRIGHT MCMLIX SARATOGA PRODUCTIONS, INC. ALL RIGHTS RESERVED"},"technical":{"runtime":["1 hr 49 min (109 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Color (Technicolor)"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["Technicolor"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["CinemaScope (as CinemaScope®)"],"printedFilmFormat":["35 mm"]},"rating":"6.3","filmingLocations":[],"awards":[{"award":"Laurel Awards 1960","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Laurel","categories":[{"category":"Top Action Drama","names":[]}]}]}],"votes":"473","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023951","name":"Allied Artists Pictures"},{"idCompany":"co0064339","name":"Irwin Allen Productions"},{"idCompany":"co0321691","name":"Saratoga-Vic Mature Productions"}],"keywords":{"keywords":["circus","press agent","trapeze","bank loan","falling from height","circus tent","ringmaster","lion","clown","circus performer","murder"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:45:36"}}