{"data":{"movies":[{"title":"Cavalry Scout","originalTitle":"","year":"1951","releaseDate":"19510513","directors":[{"name":"Lesley Selander","id":"nm0782947"}],"writers":[{"name":"Daniel B. Ullman","id":"nm0880489"},{"name":"Thomas W. Blackburn","id":"nm0085648"}],"runtime":"78 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc1NWJlY2ItZjYyZS00YTU4LTg0YTgtNjc0NTZhOGY3MjQ5XkEyXkFqcGdeQXVyNDcxNDkxMjA@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Western"],"plot":"Kirby Frye, a former Confederate officer but now a Union Cavalry scout, is sent into Montana territory to locate and retrieve three Gatling Guns stolen from the U.S. Arsenal by outlaws believed to have taken them west to sell to the Soiux and Cheyenne. The trail leads him to Red Bluff where, aided by Claire Corville, he and the audience discover together and real quick like that Martin Gavin, a supposedly-honest operator of a freight line, has the guns and intends to exchange them to the Indians for furs.","simplePlot":"Kirby Frye, a former Confederate officer but now a Union Cavalry scout, is sent into Montana territory to locate and retrieve three Gatling Guns stolen from the U.S. Arsenal by outlaws ... ","actors":[{"actorName":"Rod Cameron","urlProfile":"http://www.imdb.com/name/nm0131713","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTNiZTFhOTYtZmJjOC00NWUwLWFjY2UtNDljNmI2Y2UwYmM2L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 December 1910","placeOfBirth":" Calgary, Alberta, Canada","birthName":"Nathan Roderick Cox","height":"6' 5\" (1.96 m)","bio":"The well-worn phrase \"Tall in the saddle\" is certainly one easy way of describing (and perhaps pigeon-holing) leathery, wiry-framed 1940s and early 1950s western film star Rod Cameron, although he proved quite capable in crime stories, horrors and even swing-era musicals. The 6'4\" Canadian-born actor was born Nathan Roderick Cox on December 7, 1910, and raised in Alberta. Once his aspirations of becoming a Royal Canadian Mountie passed, he decided to seek fame and fortune as an actor in New York and initially grabbed some work as a laborer on the Holland Tunnel project in Manhattan. When no progress was made acting-wise, he moved to California where he made his \"debut\" in an unbilled bit in one of Bette Davis' scenes in The Old Maid (1939). Upon release, however, he discovered his bit in the scene had been deleted. Cameron found a slight \"in\" (as in \"stand-in\") with Paramount Pictures for such stars as Fred MacMurray while managing to find himself sparingly used in other Paramount films. To supplement his income he also played leading man in the studio's screen tests for starlet wanna-bes and his athleticism paid off playing stunt double for such established cowboy icons as Buck Jones. Cameron toiled as a bit player for quite some time and appeared insignificantly in such classics as Christmas in July (1940) and North West Mounted Police (1940) (where he fulfilled his early wish by playing a Mountie!). Occasionally he would find a noticeable secondary role, in such lesser films as The Monster and the Girl (1941), The Forest Rangers (1942) and as Jesse James in The Remarkable Andrew (1942). Cameron's banner year was 1943, when he finally broke out of the minor leagues and into the major ranks. His breakout screen role was as clench-jawed Agent Rex Bennett, out to bring down the foreign enemy and save the world, in the Republic serial cliffhangers G-men vs. the Black Dragon (1943) and Secret Service in Darkest Africa (1943). From there he was signed by Universal to appear in a flurry of low-budget westerns with Fuzzy Knight as his comic sidekick. Aside from the rough-hewn heroics he was paid to display, he would occasionally show a softer side for the ladies, such as with fellow Canadian Yvonne De Carlo in Salome Where She Danced (1945), Frontier Gal (1945) and River Lady (1948). Seldom would he venture outside the action genre, however, one of the few times being his role as a symphony conductor in Swing Out, Sister (1945). For the most part he remained rooted in westerns and the only variance within that realm was the occasional black-hatted bad guy. Among Cameron's many dusty showcases (more often than not made at Republic or Universal), Brimstone (1949), Stampede (1949), Dakota Lil (1950) and San Antone (1953) are worth a good look. Cameron never found his Stagecoach (1939) or Shane (1953), a vehicle that might have held him even \"taller\" in the saddle, but between 1953 and 1955 he was still ranked \"top 5\" box-office. In the 1950s Cameron found time to settle into a couple of syndicated TV series. Both City Detective (1953) and State Trooper (1956) lasted a couple of seasons. He also guested on the more popular western series, such as Bonanza (1959), Laramie (1959) and The Virginian (1962). When his movie career began to fade in the early 1960s, he went to Spaain for a few spaghetti westerns and appeared in a couple of low-budget westerns such as Requiem for a Gunfighter (1965) and The Bounty Killer (1965), which was noticed more for reuniting sagebrush stars from yesteryear than for its high quality. He also played an aging rodeo star who dies early in the story in the biopic Evel Knievel (1971). The only serious tabloid scandal he ever found himself in was when he divorced wife Angela Alves-Lico (1950-1960) and then immediately married his ex-wife's mother, Dorothy, who was a few years older than him. An extended battle with cancer finally claimed the 72-year-old actor in 1983 at a Gainesville, Georgia, hospital.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTNiZTFhOTYtZmJjOC00NWUwLWFjY2UtNDljNmI2Y2UwYmM2L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0131713","name":"Rod Cameron","idIMDB":"nm0131713"},"actorId":"nm0131713","character":"Kirby Frye","urlCharacter":"http://www.imdb.com/character/ch0509732","main":true},{"actorName":"Audrey Long","urlProfile":"http://www.imdb.com/name/nm0518879","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2E3MmM1YzUtNzY0Mi00M2ZlLTlkY2MtYWYwNWVmNjgzYTNmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 April 1922","placeOfBirth":" Orlando, Florida, USA","height":"5' 8½\" (1.74 m)","bio":"Audrey Long was born on April 14, 1922 in Orlando, Florida, USA. She was an actress, known for Desperate (1947), Born to Kill (1947) and Tall in the Saddle (1944). She was married to Leslie Charteris and Edward Rubin. She died on September 19, 2014 in Virginia Water, Surrey, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2E3MmM1YzUtNzY0Mi00M2ZlLTlkY2MtYWYwNWVmNjgzYTNmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0518879","name":"Audrey Long","idIMDB":"nm0518879"},"actorId":"nm0518879","character":"Claire Conville","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim Davis","urlProfile":"http://www.imdb.com/name/nm0204824","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MTc2NzMzNl5BMl5BanBnXkFtZTcwNzI4MDgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 August 1909","placeOfBirth":" Edgerton, Missouri, USA","birthName":"Marlin Davis","height":"6' 2½\" (1.89 m)","bio":"Tall, rangy Jim Davis spent much of his early career in westerns, mainly at Republic Pictures. The Missouri-born and -raised Davis' relaxed, easygoing manner and Southern drawl easily fit most moviegoers' image of the cowboy, and Republic put him in a ton of them over the years (the fact that, unlike a lot of movie cowboys, he looked right at home on a horse didn't hurt, either). He alternated between good-guy and villain roles, one of his better ones being that of the devious, murderous fur trapper working for Kirk Douglas' competition in The Big Sky (1952). He is best known, however, for his role as Ewing family patriarch Jock in the long-running TV series Dallas (1978).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MTc2NzMzNl5BMl5BanBnXkFtZTcwNzI4MDgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0204824","name":"Jim Davis","idIMDB":"nm0204824"},"actorId":"nm0204824","character":"Lieutenant Spauldiing","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Millican","urlProfile":"http://www.imdb.com/name/nm0589641","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjA5NGI2NmEtNjVjYy00ODUyLTliNzQtZjAxMjY1OTJhYjA3XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1910","placeOfBirth":" Palisades, New Jersey, USA","bio":"James Millican was born on February 17, 1910 in Palisades, New Jersey, USA. He is known for his work on Winchester '73 (1950), The Man from Laramie (1955) and Strategic Air Command (1955). He was married to Dorothy Eleanor Griffith. He died on November 24, 1955 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjA5NGI2NmEtNjVjYy00ODUyLTliNzQtZjAxMjY1OTJhYjA3XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0589641","name":"James Millican","idIMDB":"nm0589641"},"actorId":"nm0589641","character":"Martin Gavin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Arness","urlProfile":"http://www.imdb.com/name/nm0000790","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNjQ4MzA4Ml5BMl5BanBnXkFtZTcwNTk1Nzg0NQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1923","placeOfBirth":" Minneapolis, Minnesota, USA","birthName":"James King Aurness","height":"6' 7\" (2.01 m)","bio":"American leading man famed as the star of one of the longest-running shows in U.S. television history, Gunsmoke (1955). Born of Norwegian heritage (the family name, Aurness, had formerly been Aursness) in Minneapolis, Minnesota to Rolf and Ruth Duesler Aurness. His father was a traveling salesman of medical supplies and his mother later became a newspaper columnist. James attended West High School in Minneapolis. Although he appeared in school plays, he had no interest in performing, and dreamed instead of going to sea. After high school, he attended one semester at Beloit College before receiving his draft notice in 1943. He entered the army and trained at Camp Wheeler, Georgia, before shipping out for North Africa. After landing at Casablanca, Arness joined the 3rd Infantry Division in time for the invasion of Anzio. Ten days after the invasion, Arness was severely wounded in the leg and foot by German machine-gun fire. His wounds, which plagued him the rest of his life, resulted in his medical discharge from the army. While recuperating in a Clinton, Iowa hospital, he was visited by his younger brother Peter (later to gain fame as actor Peter Graves), who suggested he take a radio course at the University of Minnesota. James did so, and a teacher recommended him for a job as an announcer at a Minneapolis radio station. Though seemingly headed for success in radio, he followed a boyhood friend's suggestion and went with the friend to Hollywood in hopes of getting work as film extras. He studied at the Bliss-Hayden Theatre School under actor Harry Hayden, and while appearing in a play there was spotted by agent Leon Lance. Lance got the actor a role as Loretta Young's brother in The Farmer's Daughter (1947). The director of that film, H.C. Potter, recommended that he drop the \"u\" from his last name and soon thereafter the actor was officially known as James Arness. Little work followed this break, and Arness became something of a beach bum, living on the shore at San Onofre and spending his days surfing. He began taking his acting career more seriously when he began to receive fan mail following the release of the Young picture. He appeared in a production of \"Candida\" at the Pasadena Community Playhouse, and married his leading lady, Virginia Chapman. She pressed him to study acting and to work harder in pursuit of a career, but Arness has been consistent in ascribing his success to luck. He began to get small roles with frequency, often, due to his size, villainous characters. Most notable among these was that of the space alien in The Thing from Another World (1951). While playing a Greek warrior in a play, Arness was spotted by agent Charles K. Feldman, who represented John Wayne. Feldman introduced Arness to Wayne, who put the self-described 6' 6\" actor under personal contract. Arness played several roles over the next few years for and with Wayne, whom he considered a mentor. In 1955, Wayne recommended Arness for the lead role of Matt Dillon in the TV series Gunsmoke (1955). (Contrary to urban legend, Wayne himself was never offered the role.) Arness at first declined, thinking a TV series could derail his growing film career, but Wayne argued for the show, and Arness accepted. His portrayal of stalwart marshal Dillon became an iconic figure in American television and the series, on the air for twenty seasons, is, as of 2008, the longest-running dramatic series in U.S. television history. Arness became world-famous and years later reprised the character in a series of TV movies. After the surprising cancellation of \"Gunsmoke\" in 1975, Arness jumped immediately into another successful (though much shorter-lived) Western project, a TV-movie-miniseries-series combination known as \"How The West Was Won.\" A brief modern police drama, McClain's Law (1981), followed, and Arness played his mentor John Wayne's role in Red River (1988), a remake of the Wayne classic. Following the aforementioned \"Gunsmoke\" TV movies (the last in 1994, when Arness was 71), Arness basically retired. His marriage to Virginia Chapman ended in divorce in 1960. They had three children together, one of whom, Jenny Lee, died a suicide in 1975. Arness subsequently married Janet Surtrees in 1978.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNjQ4MzA4Ml5BMl5BanBnXkFtZTcwNTk1Nzg0NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000790","name":"James Arness","nicknames":["Jim","Jimmy"],"idIMDB":"nm0000790"},"actorId":"nm0000790","character":"Barth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Doucette","urlProfile":"http://www.imdb.com/name/nm0234732","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNTY5ODQwNV5BMl5BanBnXkFtZTYwMTUyNTAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 January 1921","placeOfBirth":" Brockton, Massachusetts, USA","birthName":"John Arthur Doucette","height":"5' 9\" (1.75 m)","bio":"Stocky, balding American character actor with a rich, deep voice, equally adept at Western bad guys and Shakespeare. He began his career in films in minor roles, primarily as gangland henchmen, and progressed to become widely familiar as a figure in a variety of dramas and occasional comedies. Although a stalwart and reliable supporting player, he was not of a type to essay leading roles in films, but remained a well-respected actor whose face, if not name, is familiar to a generation of film and television viewers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNTY5ODQwNV5BMl5BanBnXkFtZTYwMTUyNTAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0234732","name":"John Doucette","idIMDB":"nm0234732"},"actorId":"nm0234732","character":"Varney","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William 'Bill' Phillips","urlProfile":"http://www.imdb.com/name/nm0680883","urlPhoto":"","biography":{"dateOfBirth":"1 June 1908","placeOfBirth":" Washington, District of Columbia, USA","bio":"William 'Bill' Phillips was born on June 1, 1908 in Washington, District of Columbia, USA. He was an actor and writer, known for Detective Story (1951), Thirty Seconds Over Tokyo (1944) and Till the Clouds Roll By (1946). He was married to Eve Phillips. He died on June 27, 1957 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0680883","name":"William 'Bill' Phillips","idIMDB":"nm0680883"},"actorId":"nm0680883","character":"Sergeant Hal Wilkins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Chase","urlProfile":"http://www.imdb.com/name/nm0153679","urlPhoto":"","biography":{"dateOfBirth":"11 April 1902","placeOfBirth":" Huntington, Long Island, New York, USA","birthName":"Guy Alden Chase","height":"6' 3\" (1.91 m)","bio":"Stephen Chase was born on April 11, 1902 in Huntington, Long Island, New York, USA as Guy Alden Chase. He was an actor, known for The Blob (1958), When Worlds Collide (1951) and The Little Colonel (1935). He died on April 1, 1982 in Santa Monica, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0153679","name":"Stephen Chase","idIMDB":"nm0153679"},"actorId":"nm0153679","character":"Colonel Drumm","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rory Mallinson","urlProfile":"http://www.imdb.com/name/nm0540047","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzY3YjE5YTQtNWE1Yi00ODY5LTgxMTctZmE3NDRkYTNmMjZjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 October 1913","placeOfBirth":" Atlanta, Georgia, USA","birthName":"Charles Joseph Mallinson","height":"6' (1.83 m)","bio":"Rory Mallinson was born on October 27, 1913 in Atlanta, Georgia, USA as Charles Joseph Mallinson. He was an actor, known for Dark Passage (1947), Possessed (1947) and Pride of the Marines (1945). He was married to Eileen D. McNulty and Helen Mallinson. He died on March 26, 1976 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzY3YjE5YTQtNWE1Yi00ODY5LTgxMTctZmE3NDRkYTNmMjZjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0540047","name":"Rory Mallinson","idIMDB":"nm0540047"},"actorId":"nm0540047","character":"Corporal","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eddy Waller","urlProfile":"http://www.imdb.com/name/nm0909040","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmVjNzI1ZmEtZGMzOS00ZTczLWE2MGQtZjhmYThmMGVkODUwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 June 1889","placeOfBirth":" Chippewa Falls, Wisconsin, USA","bio":"Eddy Waller worked in vaudeville and the theater before he entered movies in 1936. Within a few years he was being cast in character parts. In the 1940s he would be a mainstay in the westerns of Republic Pictures and would work with just about every cowboy actor from Tim Holt to Rocky Lane. With Lane, Eddy's billing would be as high as second, as he played grizzly old prospector Nugget Clark, adding the comic relief to a picture with such pearls as \"He is as square as the day is long\". The \"B\" western finally died out in the 1950s, and so did Eddy's career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmVjNzI1ZmEtZGMzOS00ZTczLWE2MGQtZjhmYThmMGVkODUwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0909040","name":"Eddy Waller","idIMDB":"nm0909040"},"actorId":"nm0909040","character":"General William Sherman","urlCharacter":"http://www.imdb.com/character/ch0030518","main":true},{"actorName":"Frank Wilcox","urlProfile":"http://www.imdb.com/name/nm0928207","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4Nzk0NDMwOV5BMl5BanBnXkFtZTcwNjQ1NDAyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 March 1907","placeOfBirth":" DeSoto, Missouri, USA","birthName":"Frank Reppy Wilcox","height":"6' 3\" (1.91 m)","bio":"American character actor in scores of films after substantial stage experience. He was born in DeSoto, Missouri, but raised in Atchison, Kansas. The son of a railroad worker and law clerk (some publicity material states the father was a physician, but family and census records show otherwise), he wavered between various careers including oil exploration, but found his way after an introduction to the stage with the Atchison Civic Theatre and Kansas City Civic Theatre. He briefly attended the University of Kansas (where he was a fraternity brother of future newsman John Cameron Swayze). He moved from Kansas to California in 1930, where he lived with his grandparents and worked in the lemon groves near Pomona prior to opening a tire-repair shop in that city. He also helped found a theatre company in Pomona. He joined the Pasadena Community Playhouse, where he was spotted by a Warner Bros. talent scout looking for someone with a resemblance to Henry Clay, for the Warners short film The Monroe Doctrine (1939). He signed with Warners as a contract player and was thereafter virtually never without work. He played in an enormous number of films over the next three decades, mostly in small supporting roles. He was equally adept at playing businessmen, attorneys, or historical figures, and was a familiar face on screen and on television for his entire career, though most people would have been unable to identify him by name. Perhaps his greatest fame came in the TV role of oil company president John Brewster on The Beverly Hillbillies (1962). During the last years of his life, he was co-owner of a popular restaurant/bar in Encino, California, called The Oak Room. Wilcox died in 1974.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4Nzk0NDMwOV5BMl5BanBnXkFtZTcwNjQ1NDAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0928207","name":"Frank Wilcox","idIMDB":"nm0928207"},"actorId":"nm0928207","character":"Matson","urlCharacter":"http://www.imdb.com/character/ch0508291","main":true},{"actorName":"Cliff Clark","urlProfile":"http://www.imdb.com/name/nm0163785","urlPhoto":"","biography":{"dateOfBirth":"10 June 1889","placeOfBirth":" New York City, New York, USA","bio":"Cliff Clark was born on June 10, 1889 in New York City, New York, USA. He was an actor, known for The Grapes of Wrath (1940), The Stratton Story (1949) and The Men (1950). He was married to Stella Delauries. He died on February 8, 1953 in Hollywood, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0163785","name":"Cliff Clark","idIMDB":"nm0163785"},"actorId":"nm0163785","character":"Colonel George Deering","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0043391","urlIMDB":"http://www.imdb.com/title/tt0043391","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 18 min (78 min)","1 hr 10 min (70 min) (West Germany)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Color (Cinecolor)"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":["Cinecolor, USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.0","filmingLocations":[{"location":"Keen Camp - State Highway 74, Mountain Center, San Jacinto Mountains, California, USA"}],"rated":"APPROVED","awards":[],"votes":"76","type":"Movie","companyCreditsSimple":[{"idCompany":"co0025996","name":"Monogram Pictures"}],"keywords":{"keywords":["scout","arsenal","cavalry","gatling gun","cavalry scout","american indian","native american","weapon","usa","u.s. cavalry","u.s. army","treachery","survivor","store","storekeeper","sitting bull","sioux tribe","sioux chief","saloon","low budget film","kidnapping","kidnapper","investigator","investigation","indian war","indian chief","indian attack","hostage","henchman","held at gunpoint","fort","duplicity","double cross","deception","dancehall girl","damsel in distress","dakota","crazy horse","civilian","cheyenne tribe","cheyenne indian","barroom","b western","b movie","action hero","1870s","gunrunner","horse","army","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 05:52:10"}}