{"data":{"movies":[{"title":"Moscow Laughs","originalTitle":"Vesyolye rebyata","year":"1934","releaseDate":"19350324","directors":[{"name":"Grigori Aleksandrov","id":"nm0017893"}],"writers":[{"name":"Grigori Aleksandrov","id":"nm0017893"},{"name":"Nikolay Erdman","id":"nm0258755"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgxMzIwNzc1NF5BMl5BanBnXkFtZTgwNDg5OTczMzE@._V1.jpg","countries":["Soviet Union"],"languages":["Russian"],"genres":["Comedy","Musical"],"plot":"Merry Fellows was the first Soviet musical comedy. Set in Odessa and Moscow in the 1930's. Shepherd Kostya Potekhin (Utyosov) is mistaken for an international concert star. He falls in love with Anyuta (Orlova) and plays the \"star\" for her. In a cascade of comic musical numbers he becomes the leader of a Jazz-Band and gives a hilarious show at the Odessa Music Hall. Now he is destined to perform at the Bolshoi Theatre in Moscow.","simplePlot":"Merry Fellows was the first Soviet musical comedy. Set in Odessa and Moscow in the 1930's. Shepherd Kostya Potekhin (Utyosov) is mistaken for an international concert star. He falls in love... ","actors":[{"actorName":"Leonid Utyosov","urlProfile":"http://www.imdb.com/name/nm0882607","urlPhoto":"","biography":{"dateOfBirth":"21 March 1895","placeOfBirth":" Odessa, Kherson Governorate, Russian Empire [now Ukraine]","birthName":"Lazar' Iosifovich Vasbein","bio":"Leonid Utyosov was a popular singer and band-leader in the Soviet Union who is best known for the leading role in 'Vesyolyye rebyata' (1934). He was born Lazar Iosifovich Weissbein on March 21, 1895, in Odessa, Russian Empire (now Odesa, Ukraine). His father was a small business owner and his mother was a homemaker. Young Utyosov studied violin and attended the Faig School of Commerse in Odessa, then dropped out of school and became an actor. At age 15 he joined Borodanov Circus troupe as an acrobat. In 1911 he began his acting career as a stand up comedian in Kremenchug. In 1912 he returned to Odessa and changed his artistic name to Leonid Utyosov. In 1913 he joined the troupe of K. Rosanov and also performed with Rishelyevsky Theatre. In 1917 Utyosov won a singing competition in Gomel, then he formed his first band for a tour in Moscow. There he got a regular gig at the \"Hermitage Theatre\" and established himself as a popular singer in Moscow. In 1919 Utyosov made his film debut as Lawyer Zarudny in 'Leitenant Shmidt - borets za svobodu' (aka... Lieutenant Schmidt - a freedom fighter). During the 1920s and 1930s Utyosov and his jazz-band toured in Leningrad, Riga, Kiev, Odessa, and in Europe. In 1923 Utyosov settled with his family in Leningrad (St. Petersburg). There he had a steady gig at the Music Hall and at Palace-Theatre and also performed on stage of \"Svoboda-teatr\" (Theatre of Freedom). At that time Leningrad (than called Petrograd) became the center for experimental arts where many talented friends of Utyosov's came from Odessa, Kiev and other places. Utyosov joined their experiments in music and film; he also had many choices of hiring good musicians for his growing band. In 1928, on a concert tour in Europe, Utyosov first experienced a taste of American jazz when he attended performances of the legendary Jack Hilton Big Band and then the Ted Lewis & His Orchestra. Utyosov was very impressed with the sound and style of the American bands, and immediately after that experience he updated his own band and directed a new show. Leonid Utyosov premiered his new show, titled \"Tea-Jazz\" ( aka.. Theatrical Jazz Show), on the International Women's Day on March 8, 1929, at the Leningrad Maly Opera House. It was a smashing success and became the talk of the town in Leningrad, triggering a string of successful tours and events in Moscow and across Russia. Utyosov and his jazz-band mastered many popular music styles and incorporated the spirit and beat of the American jazz and Argentinean tango, as well as the intimacy of French chanson and lyrical finesse of Italian songs, Ukrainian dances, Jewish folk music, and Russian lullabies among other international styles blended into their public performances. Utyosov also acted as a fine stand-up comedian during his shows. In the 1930s Utyosov and his jazz-band were having a regular gig as a dancing band at the Marble Hall of the Kirov Palace of Culture in Leningrad (St. Petersburg). At that time Leonid Utyosov and the Utyosov jazz-band gained tremendous popularity and became established as the first choice entertainers in Leningrad and Moscow for major events and celebrations. In Leningrad Utyosov met composer Isaak Dunayevsky, and that meeting led to their fruitful collaboration in film. He starred as Kostya Potekhin opposite Lyubov Orlova in _Vesyolyye rebyata (1934)_ (aka... Jolly Fellows), which became a box-office hit in the 30s. The film introduced a variety of popular music to general public in the Soviet Union, which was a closed society and lacked the exposure to such popular styles as Jazz and Tango, among others. Utyosov's collaboration with composers Isaak Dunayevsky and Nikita Bogoslovsky produced many well known Russian songs, such as 'Shalandy' (aka..Boats Full of Mullet), 'U samovara ya i moya Masha' (aka.. Me and My Masha at the Samovar), 'Mishka-odessit' (aka... Mishka from Odessa), 'Marsh veselykh rebyat' (aka.. March of the Jolly Fellows), Temnaya Noch\" (aka.. Dark Is the Night), 'Lyubimy gorod' (aka... Beloved City) and others, were admired by people of several generations in Russia and internationally, becoming best selling hits in numerous live and studio recordings. During the Second World War, Utyosov made numerous performances for soldiers at the front-lines as well as for the wounded in hospitals. He also donated money for building airplanes to fight the Nazis. During the late 1940s and early 50s, when many artists in the Soviet Union were attacked by the Communist Party under dictatorship of Joseph Stalin. Utyosov was censored and banned from public performances. His song 'Shalandy' and other music had been banned for several years until 1956 when the \"Thaw\" was initiated by Nikita Khrushchev. During the 50s, 60s, and 70s, Utyosov made hundreds of concert performances before sold-out audiences across the Soviet Union and abroad. His jazz-band became a school for many young musicians who apprenticed under Utyosov and became visible in the Soviet show-biz milieu. Utyosov was designated People's Artist of the USSR, and received awards and decorations for his contribution to music and film in the Soviet Union. Leonid Utyosov died of natural causes on March 9, 1982, in Moscow, and was laid to rest in Novodevichy Cemetery in Moscow, Russia. Leonid Utyosov was memorialized in numerous works of art and literature; in 2000 an impressive monument was opened in his native city of Odessa.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0882607","name":"Leonid Utyosov","idIMDB":"nm0882607"},"actorId":"nm0882607","character":"Kostya Potekhin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lyubov Orlova","urlProfile":"http://www.imdb.com/name/nm0650144","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgyYzFmNjItNjNjYi00ZDBiLWJjOTUtMmZkMGNkYmFiMzJkXkEyXkFqcGdeQXVyMTc4MzI2NQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 1902","placeOfBirth":" Zvenigorod, Moscow Governorate, Russian Empire [now Moscow Oblast, Russia]","birthName":"Lyubov Petrovna Orlova","height":"5' 2¼\" (1.58 m)","bio":"Lyubov Orlova was a Russian film star of the 1930s who enjoyed the sympathy of Joseph Stalin. She was born Lyubov Petrovna Orlova on January 29, 1902 in Zvenigorod, a suburb of Moscow, Russia. Her father, Petr Orlov, was an officer in the Russian Imperial Army, her mother, Evgenia Sukhotina, belonged to Russian Landed Gentry. Through her parents, Orlova was a descendant from the old Russian aristocratic family of Prince Orlov, and was also related to Count Leo Tolstoy, for whom she sang along with the popular Russian basso Feodor Chaliapin Sr. in 1909. From 1919 to 1922 Orlova studied piano and singing at the Moscow Conservatory, but she did not graduate. From 1922-1926, Orlova studied dancing and choreography at the Moscow Theatre College. Then she worked on stage with director Vladimir Nemirovich-Danchenko at the Moscow Musical Theatre of Stanislavsky. In 1926 Orlova married Andrei Berezin, a prominent Soviet opposition politician. He was arrested in 1930, and was imprisoned for many years; this tragedy caused Orlova a severe depression and she had problems with alcohol. Orlova was seen on stage by many influential people in Moscow. After losing her husband she had other relationships before she met director Grigori Aleksandrov. He was looking for an actress to co-star opposite Leonid Utyosov in 'Moscow laughs'. The film became a big success in the 30s Soviet Union. Orlova became Aleksandrov's mistress. Eventually Alrksandrov divorced from his wife and married Orlova, who became the leading star of the Soviet film industry before the Second World War. Joseph Stalin liked Orlova very much and promoted her to the title of Honorable Actress of Russian Federation in January of 1935. Stalin was probably in a good mood, when he offered Orlova to make her wish come true. She asked about the fate of her first husband. Stalin was surprised. Soon Orlova was called to visit the Lubyanka office of NKVD (KGB). There she was told that her ex-husband is alive in prison and that she may see him, and even join him in his cell. She was scared and humbled and left quietly. Later, in 1949 her ex-husband was diagnosed with cancer, released from prison and died in Lithuania at the home of his mother. Stalin made Orlova the regular guest at his lavish drinking parties in Moscow. She became addicted to alcohol and was severely criticized by the official paper 'Sovetskoe Iskusstvo' (The Soviet Art). Director Aleksandrov managed to save his wife from her alcohol addiction by threatening to abort her film career. She obeyed and quit drinking. Her films 'Tsirk' (aka.. Circus 1936), 'Volga-Volga' (1938), and 'Svetly Put' (aka.. The Shining Path 1940, aka.. Tanya) were hugely successful. 'Svetly Put' was originally titled 'Cinderella' by the author Viktor Ardov, but Stalin ordered the title to be changed to 'The Shining Path'. Stalin's control over the Soviet film industry was absolute. For her leading roles in 'Volga-Volga' and 'Svetly Put' Orlova was personally awarded by Joseph Stalin with the State Stalin Prize. At the beginning of the Nazi invasion of Russia during the Second World War, both Orlova and Aleksandrov were filming in Riga, Latvia. They narrowly escaped from the advancing Nazi armies and rushed to Moscow. There Aleksandrov served at the regular night watch during Luftwaffe air raids and bombings. He was severely wounded by a bomb explosion in September of 1941, and suffered from spinal trauma for the rest of his life. In the fall of 1941 Orlova and Aleksandrov were evacuated from Moscow to Baku, Azerbaijan. There they made a film 'Odna Semya' (A Family 1943) which was banned by the Soviet Censorship Committee. The official reason for banning the innocent film was its lacking of propaganda about the fight of the Soviet people against the Nazi invasion. Orlova was known to be immune from gossips and rumors. She was also known as a faithful wife to Aleksandrov. Though she worked mainly in his films, she also occasionally worked in films made by other directors. She was never allowed by her director-husband Aleksandrov to be kissed in a film, with one exception made for actor Andrei Tutyshkin in 'Volga-Volga'. Her characters were sexy in a way acceptable by the rigid Soviet censorship under Stalin. One scene from the film 'Vstrecha na Elbe' (Meeting on the Elbe 1949) was ordered by Stalin to be deleted, because Stalin criticized the half-naked girls dancing to American Jazz music while celebrating the Victory. However, Stalin kept the uncensored original for himself, and later Stalin showed this scene at his home theatre to Aleksandrov and other guests. Stalin liked the scene, but banned it from being seen by millions of viewers in the Soviet Union. From 1930 to the end of her life, Orlova has a rare medical problem - she suffered from sensitivity to daylight, which she developed after the stressful arrest of her first husband. She also suffered from severe insomnia and depended on various medications. She was spending much time at her home behind shielded windows. Her later work with Aleksandrov, such as in 'Russki suvenir' (Russian Souvenir 1960) was a flop. Her last stage performance was in Leningrad, in 1963, after that she was not seen on stage. Her last film with Aleksandrov, 'Skvorets i Lira' (1973), was not released upon Orlova's insistence, because she was shocked with her own looks in the film. Lyubov Orlova was the first Russian film star to use plastic surgeries in her later years. At that time she refused to be photographed, and was hiding from public. She died of pancreatic cancer on January 26, 1975, and three days later, on her 73rd birthday, she was laid to rest in Novodevichy Cemetery in Moscow, Russia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgyYzFmNjItNjNjYi00ZDBiLWJjOTUtMmZkMGNkYmFiMzJkXkEyXkFqcGdeQXVyMTc4MzI2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0650144","name":"Lyubov Orlova","idIMDB":"nm0650144"},"actorId":"nm0650144","character":"Anyuta - the Housemaid","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mariya Strelkova","urlProfile":"http://www.imdb.com/name/nm0834225","urlPhoto":"","biography":{"dateOfBirth":"1908","placeOfBirth":"","birthName":"Mariya Pavlovna Strelkova","bio":"Mariya Strelkova was born in 1908 as Mariya Pavlovna Strelkova. She was an actress, known for Moscow Laughs (1934), Holiday of St. Jorgen (1930) and An Hour with Chekhov (1929). She died in 1962.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0834225","name":"Mariya Strelkova","idIMDB":"nm0834225"},"actorId":"nm0834225","character":"Yelena - Child of the Foreign Trade Union","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yelena Tyapkina","urlProfile":"http://www.imdb.com/name/nm0878688","urlPhoto":"","biography":{"dateOfBirth":"10 May 1900","placeOfBirth":" Moscow, Russian Empire [now Russia]","birthName":"Yelena Alekseyevna Tyapkina","bio":"Yelena Tyapkina was born on May 10, 1900 in Moscow, Russian Empire as Yelena Alekseyevna Tyapkina. She was an actress, known for Moscow Laughs (1934), War and Peace (1966) and L'arc-en-ciel (1944). She died on November 9, 1984 in Moscow, Russian SFSR, USSR.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0878688","name":"Yelena Tyapkina","idIMDB":"nm0878688"},"actorId":"nm0878688","character":"Anyuta's Stepmother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fyodor Kurikhin","urlProfile":"http://www.imdb.com/name/nm0475714","urlPhoto":"","biography":{"dateOfBirth":"8 January 1882","placeOfBirth":" St. Petersburg, Russian Empire [now Russia]","birthName":"Fyodor Nikolayevich Kurikhin","bio":"Fyodor Kurikhin was born on January 8, 1882 in St. Petersburg, Russian Empire as Fyodor Nikolayevich Kurikhin. He was an actor, known for Moscow Laughs (1934), Tsirk (1936) and Baltic Deputy (1937). He died on January 19, 1951 in Moscow, RSFSR, USSR.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0475714","name":"Fyodor Kurikhin","idIMDB":"nm0475714"},"actorId":"nm0475714","character":"Mortician","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arnold Arnold","urlProfile":"http://www.imdb.com/name/nm7672865","urlPhoto":"","biography":{"dateOfBirth":"13 September 1898","placeOfBirth":" Kiev, Kiev Governorate, Russian Empire [now Kyiv, Ukraine]","birthName":"Arnold Grigorevich Barskiy","bio":"Arnold Arnold was born on September 13, 1898 in Kiev, Kiev Governorate, Russian Empire as Arnold Grigorevich Barskiy. He was an actor, known for Moscow Laughs (1934), La nouvelle Babylone (1929) and Devushka speshit na svidanie (1936). He died on June 19, 1969 in Moscow, RSFSR, USSR.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7672865","name":"Arnold Arnold","idIMDB":"nm7672865"},"actorId":"nm7672865","character":"Conductor from Paraguay","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Erdman","urlProfile":"http://www.imdb.com/name/nm0947572","urlPhoto":"","biography":{"bio":"Robert Erdman is an actor, known for Moscow Laughs (1934) and The Patriots (1933).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0947572","name":"Robert Erdman","idIMDB":"nm0947572"},"actorId":"nm0947572","character":"German music teacher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marya Ivanovna","urlProfile":"http://www.imdb.com/name/nm0412127","urlPhoto":"","biography":{"bio":"Marya Ivanovna is an actress, known for Moscow Laughs (1934).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0412127","name":"Marya Ivanovna","idIMDB":"nm0412127"},"actorId":"nm0412127","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0025946","urlIMDB":"http://www.imdb.com/title/tt0025946","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Grading Dimension Pictures [US]"},"technical":{"runtime":["1 hr 36 min (96 min)"],"soundMix":["Mono","Dolby Digital"],"color":["Color (HDCAM)","Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["2,577 m (11 reels)"],"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.2","filmingLocations":[],"awards":[{"award":"Venice Film Festival 1934","titlesAwards":[{"titleAwardOutcome":"Nominated Mussolini Cup","categories":[{"category":"Best Foreign Film","names":[{"name":"Grigori Aleksandrov","id":"nm0017893","role":null}]}]}]}],"votes":"650","type":"Movie","companyCreditsSimple":[{"idCompany":"co0293350","name":"Grading Dimension Pictures"},{"idCompany":"co0011410","name":"Moskinokombinat"}],"keywords":{"keywords":["taking off shoes","camera shot of feet","foot closeup","female stockinged foot","stockings"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:13:56"}}