{"data":{"movies":[{"title":"The Red Tent","originalTitle":"Krasnaya palatka","year":"1969","releaseDate":"19710922","directors":[{"name":"Mikhail Kalatozov","id":"nm0435563"}],"writers":[{"name":"Richard DeLong Adams","id":"nm0011302"},{"name":"Ennio De Concini","id":"nm0208086"}],"runtime":"158 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTUyYWYyZmMtNjMyOC00ZmY3LWE1NjktNzY0YTJhZTAyNGU5XkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1.jpg","countries":["Soviet Union","Italy"],"languages":["Russian","Italian","English"],"genres":["Adventure","Drama"],"plot":"The commander of a failed 1928 Arctic airship expedition is remembering the events of the \"Italia\" airship flight, crash and subsequent rescue efforts. The \"ghosts\" of people involved in the events appear in his memories to assist him in determining his guilt in the affair. The reminiscences are mixed with the real action: the flight of the \"Italia\", the air rescue operation from Kings Bay airfield, the expedition of the \"Krassin\" ice-breaker. A sort of human touch is added by the ever beautiful C.C. playing Malmgren's girlfriend.","simplePlot":"Torn by personal guilt Italian General Umberto Nobile reminisces about his 1928 failed Arctic expedition aboard the airship Italia.","actors":[{"actorName":"Sean Connery","urlProfile":"http://www.imdb.com/name/nm0000125","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcwNTM4MzctYjQzMi00NTA2LTljYWItNTYzNmE1MTYxN2RlXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1930","placeOfBirth":" Edinburgh, Scotland, UK","birthName":"Thomas Sean Connery","height":"6' 2\" (1.88 m)","bio":"Sean Connery is best known for portraying the character James Bond, starring in seven Bond films between 1962 and 1983. In 1988, Connery won the Academy Award for Best Supporting Actor for his role in The Untouchables (1987). His film career also includes such films as Marnie (1964), The Name of the Rose (1986), The League of Extraordinary Gentlemen (2003), Indiana Jones and the Last Crusade (1989), The Hunt for Red October (1990), Highlander (1986), Murder on the Orient Express (1974), DragonHeart (1996) and The Rock (1996). Connery has been polled as \"The Greatest Living Scot\" and \"Scotland's Greatest Living National Treasure\". In 1989, he was proclaimed \"Sexiest Man Alive\" by People magazine, and in 1999, at age 69, he was voted \"Sexiest Man of the Century\". Thomas Sean Connery was born on August 25, 1930 in Fountainbridge, Edinburgh, Scotland. His mother, Euphemia McBain (née McLean), was a cleaning lady, and his father, Joseph Connery, was a factory worker and truck driver. He has a brother, Neil Connery, who works as a plasterer in Edinburgh. He is of Irish and Scottish descent. Before going into acting, Sean had many different jobs, such as a milkman, lorry driver, a laborer, artist's model for the Edinburgh College of Art, coffin polisher and bodybuilder. He also joined the Royal Navy, but was later discharged because of medical problems. At the age of 23, he had a choice between becoming a professional footballer or an actor, and even though he showed much promise in the sport, he chose acting and said it was one of his more intelligent moves. No Road Back (1957) was Sean's first major movie role, and it followed by several Tv-movies such as Anna Christie (1957), Macbeth (1961) and Anna Karenina (1961) and guest appearances on TV-series, and also films such as Hell Drivers (1957), Another Time, Another Place (1958), Darby O'Gill and the Little People (1959), The Frightened City (1961). In 1962 he appeared in The Longest Day (1962) with a host of other stars. Connery's breakthrough came in the role of secret agent James Bond. He was reluctant to commit to a film series, but understood that if the films succeeded his career would greatly benefit. He played the character in the first five Bond films: Dr. No (1962), From Russia with Love (1963), Goldfinger (1964), Thunderball (1965), and You Only Live Twice (1967) - then appeared again as Bond in Diamonds Are Forever (1971) and Never Say Never Again (1983). All seven films were commercially successful. James Bond, as portrayed by Connery, was selected as the third-greatest hero in cinema history by the American Film Institute. Connery's selection for the role of James Bond owed a lot to Dana Broccoli, wife of producer \"Cubby\" Broccoli, who is reputed to have been instrumental in persuading her husband that Connery was the right man. James Bond's creator, Ian Fleming, originally doubted Connery's casting, saying, \"He's not what I envisioned of James Bond looks\", and \"I'm looking for Commander Bond and not an overgrown stunt-man,\" adding that Connery (muscular, 6' 2\", and a Scot) was unrefined. Fleming's girlfriend told him that Connery had the requisite sexual charisma, and Fleming changed his mind after the successful Dr. No (1962) premiere. He was so impressed, he created a half-Scottish, half-Swiss heritage for Bond in the later novels. Connery's portrayal of Bond owes much to stylistic tutelage from director Terence Young, polishing the actor while using his physical grace and presence for the action. Lois Maxwell, who played Miss Moneypenny, related that, \"Terence took Sean under his wing. He took him to dinner, showed him how to walk, how to talk, even how to eat.\" The tutoring was successful; Connery received thousands of fan letters a week, and the actor became one of the great male sex symbols of film. During the filming of Thunderball (1965), Connery's life was in danger in the sequence with the sharks in Emilio Largo's pool. He had been concerned about this threat when he read the script. Connery insisted that Ken Adam build a special Plexiglas partition inside the pool, but, despite this, it was not a fixed structure and one of the sharks managed to pass through it. He had to abandon the pool immediately. Connery was forced to wear a toupee during each of the Bond movies because he had started balding at the age of 17. This didn't prevent Connery from being cast in roles, although it became more noticeable in his later years. In 2005, From Russia with Love was adapted by Electronic Arts into a video game, titled From Russia with Love (2005), which featured all-new voice work by Connery as well as his likeness, and those of several of the film's supporting cast. After and during the success of the Bond-films he has maintained a successful career as an actor and has appeared in films, including Alfred Hitchcock's Marnie (1964), The Hill (1965), Murder on the Orient Express (1974), The Man Who Would Be King (1975), The Wind and the Lion (1975), Time Bandits (1981), Highlander (1986), The Name of the Rose (1986), The Untouchables (1987) (which earned him an Oscar for best actor in a supporting role), Indiana Jones and the Last Crusade (1989), The Hunt for Red October (1990), Rising Sun (1993), The Rock (1996), Finding Forrester (2000), and The League of Extraordinary Gentlemen (2003). Sean married actress Diane Cilento in 1962 and they had a son, Jason Connery, born on January 11, 1963, he followed in his father's footsteps and also became an actor. The marriage ended in divorce in 1973. In 1975 he married Micheline Roquebrune and they have stayed married, they have no children together. He is also a grandfather. His son, Jason and his ex-wife, actress Mia Sara had a son, Dashiell Quinn Connery, in 1997.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcwNTM4MzctYjQzMi00NTA2LTljYWItNTYzNmE1MTYxN2RlXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000125","name":"Sean Connery","nicknames":["Big Tam"],"idIMDB":"nm0000125"},"actorId":"nm0000125","character":"Roald Amundsen","urlCharacter":"http://www.imdb.com/character/ch0044187","main":true},{"actorName":"Claudia Cardinale","urlProfile":"http://www.imdb.com/name/nm0001012","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MTM4MTEzNV5BMl5BanBnXkFtZTYwNDExMzQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 April 1938","placeOfBirth":" Tunis, French Protectorate Tunisia [now Tunisia]","birthName":"Claude Joséphine Rose Cardinale","height":"5' 6¼\" (1.68 m)","bio":"Like many other female Italian film stars, Claudia Cardinale's entry into the business was by way of a beauty pageant. She was 17 years old and studying at the Centro Sperimentale in Rome when she entered a beauty contest, which resulted in her getting a succession of small film roles. Her earthy interpretations of Sicilian women got her noticed by Italian producers, and the combination of her beauty, dark, flashing eyes, explosive sexuality and genuine acting talent virtually guaranteed her stardom. After Careless (1962) she rose to the front ranks of Italian cinema, and became an international star in Federico Fellini's classic 8½ (1963) with Marcello Mastroianni. American audiences may best remember her from her starring role in Sergio Leone's Once Upon a Time in the West (1968).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MTM4MTEzNV5BMl5BanBnXkFtZTYwNDExMzQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001012","name":"Claudia Cardinale","idIMDB":"nm0001012"},"actorId":"nm0001012","character":"Nurse Valeria","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hardy Krüger","urlProfile":"http://www.imdb.com/name/nm0473228","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MTUwMzk0MF5BMl5BanBnXkFtZTcwMjg0NjAzNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 April 1928","placeOfBirth":" Wedding, Berlin, Germany","birthName":"Franz Eberhard August Krüger","bio":"At thirteen years, German-born and raised Hardy Kruger became a member of the \"Hitler Jugend\" (Hitler Youth), as did all 13-year-old boys in Germany then. The purpose of the organization was to prepare the boys for military service. At age 15, Hardy made his film debut in a German picture (Young Eagles (1944)), but his acting career was interrupted when he was drafted into the German army in 1944 at age 16 and posted to an infantry regiment. Years later, Hardy related how he \"hated that [Nazi] uniform.\" During the filming of A Bridge Too Far (1977) in which he portrayed a Nazi general, he wore a top-coat over his S.S. uniform between takes so as \"not to remind myself of my childhood in Germany during W.W.II.\" It is said that during his war years, Hardy was captured and taken prisoner by U.S. forces but attempted to escape thrice, the third time successfully. After the war Hardy returned to acting, and eight years later was \"discovered\" by foreign film distributor J. Arthur Rank, which promptly cast him in three British pictures practically filmed back-to-back: The One That Got Away (1957), Bachelor of Hearts (1958) and Chance Meeting (1959), in which he appeared simply as a foreigner and not a German, as was usually the case. Following the release of these films Hardy's career took off. Despite anti-German sentiment that still prevailed in postwar Europe, Hardy, described as \"ruggedly handsome\" and a \"blond heartthrob\", became an international favorite, paving the way to his first American role as co-star with John Wayne in the Tanganyika-shot wildlife adventure Hatari! (1962). Hardy was so taken aback by the beauty of the land that he bought the film's location and built a small home for himself and a small bungalow hotel for tourists to see the animals. Hunting was forbidden on the property, and later a cattle farm was started with the meat being sold to local hotels. Hardy described his home there as \"a sort of African Walden where I can get away from the world from time to time.\" The business aspects of his property were shut down in 1979, however, due to political unrest. The country (now Tanzania) had closed its borders, effectively killing the tourism industry. Fluent in English, French and German, Hardy found himself in much demand by British, French, American and German producers and became more selective in his scripts. \"I'd rather sit out a picture than take a role I don't think is right for me\" he would later say.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MTUwMzk0MF5BMl5BanBnXkFtZTcwMjg0NjAzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0473228","name":"Hardy Krüger","idIMDB":"nm0473228"},"actorId":"nm0473228","character":"Aviator Lundborg","urlCharacter":"http://www.imdb.com/character/ch0527527","main":true},{"actorName":"Peter Finch","urlProfile":"http://www.imdb.com/name/nm0002075","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDMzMjM2Ml5BMl5BanBnXkFtZTYwNjQwMTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 September 1916","placeOfBirth":" South Kensington, London, England, UK","birthName":"Frederick George Peter Ingle-Finch","height":"5' 9\" (1.75 m)","bio":"Despite being one of the finest actors of his generation, Peter Finch will be remembered as much for his reputation as a hard-drinking, hell-raising womanizer as for his performances on the screen. He was born in London in 1916 and went to live in Sydney, Australia, at the age of ten. There, he worked in a series of dead-end jobs before taking up acting, his film debut being in the mediocre comedy The Farmer Goes to Town (1938). He made his stage debut as a comedian's stooge in 1939. Laurence Olivier spotted him and persuaded him to return to Britain to perform classic roles on the stage. Finch then had an affair with Olivier's wife, Vivien Leigh. Despite being married three times, Finch also had highly-publicized affairs with actresses Kay Kendall and Mai Zetterling. Finch soon switched to film after suffering appalling stage fright. As a screen actor, he won five BAFTA awards and his talent was beyond doubt. His two finest roles, the only two for which he received Oscar nominations, were as the homosexual Jewish doctor in Sunday Bloody Sunday (1971) and as the \"mad prophet of the air-waves\" in Network (1976). He died a couple of months before being awarded the Oscar for Best Performance by an Actor in a Leading Role in Network (1976) and was the first actor to have won the award posthumously.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDMzMjM2Ml5BMl5BanBnXkFtZTYwNjQwMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002075","name":"Peter Finch","nicknames":["Finchie"],"idIMDB":"nm0002075"},"actorId":"nm0002075","character":"Gen. Umberto Nobile","urlCharacter":"http://www.imdb.com/character/ch0527526","main":true},{"actorName":"Massimo Girotti","urlProfile":"http://www.imdb.com/name/nm0320988","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MDgzMDg4MF5BMl5BanBnXkFtZTYwOTA2NTA3._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 May 1918","placeOfBirth":" Mogliano, Marche, Italy","bio":"Manly, chiseled, exceedingly handsome, very agile Massimo Girotti was an engineering student and polo/swimming star before entering films in 1939. He began auspiciously in serious leads, most notably Roberto Rossellini's Desire (1946), Luchino Visconti's Les amants diaboliques (1943) and Vittorio De Sica's La porte du ciel (1945), while his physical stature and all-round athletism were put to good use in actioneers such as Sins of Rome (1953) in which he played the pre-Kirk Douglas slave-turned-leader role of Spartacus. By the 60s, however, Girotti was reduced to support roles in swashbuckling adventure and badly-dubbed sand-and-spear spectacles, appearing only occasionally in well-mounted films of quality, such as Pier Paolo Pasolini's Teorema (1968), Bernardo Bertolucci's Le dernier Tango à Paris (1972) and Visconti's L'innocent (1976). He died only a few weeks before the release of his last film, Ferzan Ozpetek's Facing Windows (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MDgzMDg4MF5BMl5BanBnXkFtZTYwOTA2NTA3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0320988","name":"Massimo Girotti","idIMDB":"nm0320988"},"actorId":"nm0320988","character":"Romagna, Rescue Coordinator","urlCharacter":"http://www.imdb.com/character/ch0527966","main":true},{"actorName":"Luigi Vannucchi","urlProfile":"http://www.imdb.com/name/nm0889274","urlPhoto":"","biography":{"dateOfBirth":"25 November 1930","placeOfBirth":" Caltanissetta, Sicily, Italy","height":"6' 2¾\" (1.9 m)","bio":"Luigi Vannucchi was born on November 25, 1930 in Caltanissetta, Sicily, Italy. He is known for his work on Le Sauvage (1975), The Red Tent (1969) and Year One (1974). He was married to Franca Cuoghi. He died on August 29, 1978 in Rome, Lazio, Italy.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0889274","name":"Luigi Vannucchi","idIMDB":"nm0889274"},"actorId":"nm0889274","character":"Capt. Zappi","urlCharacter":"http://www.imdb.com/character/ch0527529","main":true},{"actorName":"Mario Adorf","urlProfile":"http://www.imdb.com/name/nm0000728","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDliNTUxZDgtYzVlOS00NzQ2LTk4NjUtZTM5NWNkNDM4N2VjL2ltYWdlXkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 September 1930","placeOfBirth":" Zurich, Switzerland","height":"5' 10\" (1.78 m)","bio":"Mario Adorf, a tell-tale name indeed. Mario calls to mind the actor's Italian roots (his father was a Calabrian surgeon) whereas Adorf reveals his German origins (his mother was a radiologist from the German region Eifel). As for the full name Mario Adorf it echoes to perfection the international character of this living legend's long career. Born in 1930, Mario Adorf was still studying drama at the famous Otto Falkenberg School in Munich when he landed his first role in the first installment of the \"O8/15\" series in 1954. It was a small part but it didn't go unnoticed and got him new roles in German films, the most remarkable of which being that of Bruno Lüdke, the mentally retarded serial killer in Robert Siodmak's 1957 masterpiece \"Nachts, wenn der Teufel kam\". It earned him his first prize (the German Film Award of the outstanding young actor of 1958). After this Mario Adorf's career turned international. His Mediterranean looks, his rugged face, his dark oily frizzy hair and his volubility made him an ideal villain in European-made westerns, spy or mafia films. These flicks - made in the 1960s - were mostly just commercial and Adorf hammed his parts but he did it so brilliantly that he alone made them watchable. From the 1970s on, the quality of his films improved and Adorf could lend his remarkable acting talents to more ambitious works such as \"Il Delitto Matteotti\", in which he was a striking Mussolini, or \"Die Blechtrommel\", where he was terrifying as a boorish grocer contaminated by Nazism. The list of great directors he worked with is impressive: Robert Siodmak, Volker Schlöndorff, Wolgang Staudte, Michel Deville, Dino Risi, Mikhaïl Kalatozov, Luigi Comencini, Peter Fleischmann, Billy Wilder, John Frankenheimer, Claude Chabrol, Fassbinder... Likewise he served many a great author, either in the theatre (Shakespeare, Tennessee Williams, Richard Nash) or the big or small screen (Grass, Böll, Schnitzler, Heny Miller, Joseph Conrad, Gorky, Patrick Süskind...). He also sang and wrote books (five novels and one memoir). Hyperactive for more than fifty-five years now, Mario Adorf, still in fine form at the age of seventy-eight, is still ... hyperactive!","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDliNTUxZDgtYzVlOS00NzQ2LTk4NjUtZTM5NWNkNDM4N2VjL2ltYWdlXkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000728","name":"Mario Adorf","idIMDB":"nm0000728"},"actorId":"nm0000728","character":"Biagi, Radio Operator","urlCharacter":"http://www.imdb.com/character/ch0527531","main":true},{"actorName":"Eduard Martsevich","urlProfile":"http://www.imdb.com/name/nm0554340","urlPhoto":"","biography":{"dateOfBirth":"29 December 1936","placeOfBirth":" Tbilisi, Georgian SSR [now Republic of Georgia]","birthName":"Eduard Yevgenyevich Martsevich","bio":"Eduard Martsevich was born on December 29, 1936 in Tbilisi, Georgian SSR as Eduard Yevgenyevich Martsevich. He was an actor, known for The Red Tent (1969), War and Peace (1966) and Kazino (1992). He died on October 12, 2013 in Moscow, Russia.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0554340","name":"Eduard Martsevich","idIMDB":"nm0554340"},"actorId":"nm0554340","character":"Finn Malmgren, Meteorologist","urlCharacter":"http://www.imdb.com/character/ch0527528","main":true},{"actorName":"Grigoriy Gay","urlProfile":"http://www.imdb.com/name/nm0301452","urlPhoto":"","biography":{"dateOfBirth":"14 March 1920","placeOfBirth":"","bio":"Grigori Gaj was a Russian actor of a special talent for playing sophisticated characters in stage and in film. During the 1950s-1970s he was a permanent member of the legendary troupe of Bolshoi Drama Theatre (BDT) in St. Petersburg (Leningrad). Gaj made a stage career under directorship of Georgi Tovstonogov at the BDT. There his stage partners were such stars as Oleg Basilashvili, Tatyana Doronina, Kirill Lavrov, Alisa Freyndlikh, Lyudmila Makarova, Svetlana Kryuchkova, Zinaida Sharko, Natalya Tenyakova, Emma Popova, Elena Popova, Olga Volkova, Valentina Kovel, Innokentiy Smoktunovskiy, Oleg Borisov, Vladislav Strzhelchik, Yefim Kopelyan, Sergey Yurskiy, Yevgeni Lebedev, Ivan Palmu, Pavel Luspekayev, Nikolay Trofimov, Georgiy Shtil, Pavel Pankov, Mikhail Volkov, Leonid Nevedomsky, Vsevolod Kuznetsov, Vadim Medvedev, Yuriy Demich, Gennadiy Bogachyov, Andrey Tolubeev, and many other remarkable Russian actors.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0301452","name":"Grigoriy Gay","idIMDB":"nm0301452"},"actorId":"nm0301452","character":"Samoilovich, Captain of Krassin Russian Icebreaker","urlCharacter":"http://www.imdb.com/character/ch0527530","main":true},{"actorName":"Nikita Mikhalkov","urlProfile":"http://www.imdb.com/name/nm0586482","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNjY4ODI5Ml5BMl5BanBnXkFtZTcwNDAyMTg2OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 October 1945","placeOfBirth":" Moscow, RSFSR, USSR [now Russia]","birthName":"Nikita Sergeevich Mikhalkov","height":"6' 1½\" (1.87 m)","bio":"Nikita Mikhalkov is the son of the famous communist poet Sergey Mikhalkov, who wrote the lyrics of the Soviet national anthem and had strong connections to the Communist Party. Nikita Mikhalkov's mother, Natalya Petrovna Konchalovskaya, was also a poet and daughter of famous painter Pyotr Petrovich Konchalovsky and his wife Olga Vasilievna Surikova, and by her the great granddaughter of another great painter Vasily Surikov. And then last, but not least, Nikita Mikhalkov is the brother of Andrey Konchalovskiy, also a distinguished film director who, unlike Nikita, has worked in the USA. Not only did Mikhalkov direct the Academy Award-winning film \"Burnt by the Sun\" but he is also well-known as a versatile actor, having appeared in over 40 films, including the role of the Russian Tsar Alexander III in his own \"The Barber of Siberia\" (1998). Mikhalkov has an impressively long list of wins at the most prestigious film festivals, like Cannes, Venice, Moscow or Karlovy Vary. Following his movie's Oscar win for Best Foreign Language Film, Nikita Mikhalkov won a parliamentary seat in the then Prime Minister Victor Chernomyrdin's party. He is always in the spotlight, especially in Moscow, where he resides.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNjY4ODI5Ml5BMl5BanBnXkFtZTcwNDAyMTg2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0586482","name":"Nikita Mikhalkov","idIMDB":"nm0586482"},"actorId":"nm0586482","character":"Chuknovsky, Icebreaker Pilot","urlCharacter":"http://www.imdb.com/character/ch0527967","main":true},{"actorName":"Nikolai Ivanov","urlProfile":"http://www.imdb.com/name/nm0412064","urlPhoto":"","biography":{"dateOfBirth":"22 January 1943","placeOfBirth":" Tikhvin, Leningrad Oblast, RSFSR, USSR","bio":"Nikolai Ivanov was born on January 22, 1943 in Tikhvin, Leningrad Oblast, RSFSR, USSR. He is an actor, known for The Red Tent (1969), Samoubiystvo (1981) and Vechnyy zov (1973).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0412064","name":"Nikolai Ivanov","idIMDB":"nm0412064"},"actorId":"nm0412064","character":"Kolka, Amateur Radioman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Boris Khmelnitskiy","urlProfile":"http://www.imdb.com/name/nm0451699","urlPhoto":"","biography":{"dateOfBirth":"27 June 1940","placeOfBirth":" Ussuriysk, Primorsky Krai, Russian SFSR, USSR [now Russia]","birthName":"Boris Alekseevich Khmelnitsky","bio":"Boris Khmelnitsky was a popular Russian actor of film and theatre and a member of the legendary Taganka company under directorship of Yuri Lyubimov. He was born Boris Alekseevich Khmelnitsky on June 27, 1940, in Ussuriisk, a small town near Vladivostok in the Far East of the Soviet Union. His father, Aleksei Khmelnitsky, was a ranking officer in the Soviet Red Army who was manager of several Army clubs in the USSR. Young Khmelnitsky was brought up in a rather privileged environment; since childhood, he studied literature, arts, and music, and enjoyed a special atmosphere of his father's circle. He studied music at Lvov College of Music, graduating in 1961 as orchestral conductor, then studied acting at Shchukin Theatrical school in Moscow, graduating in 1966 as an actor. In 1966, he made his film debut in 'Kto vernetsa - dolyubit' by director Leonid Osyka. Khmelnitsky shot to popularity with roles in _Sofiya Perovskaya (1967)_ by director Lev Arnshtam, and in _Krasnaya palatka (1970)_. In the USSR, he was best known as Robin Hood in The Arrows of Robin Hood (1976), and later reprized the role in The Ballad of the Valiant Knight Ivanhoe (1983). From 1964 to 1984 Khmelnitsky was a member of the troupe under directorship of Yuri Lyubimov at the Taganka Theatre company in Moscow. There his stage partners were Vladimir Vysotskiy, Leonid Filatov, Venyamin Smekhov, Alla Demidova, Zinaida Slavina, Ivan Dykhovichnyy, Boris Galkin, Aleksandr Porokhovshchikov, Valeriy Zolotukhin, Natalya Sayko, Nikolay Gubenko, Zhanna Bolotova, Nina Shatskaya, Leonid Yarmolnik, and other notable Russian actors. During the 60s and 70s, Khmelnitsky played leading roles in Taganka productions, such as 'Pugachev' and 'Master i Margarita', a stage adaptation of the eponymous book by Mikhail A. Bulgakov. He also wrote music for several Taganka productions. Boris Khmelnitsky enjoyed recognition in the former Soviet Union, and was part of the intellectual milieu known as \"the 60s generation.\" He was designated People's Actor of Russia (2000). He died of a chronic illness on February 16, 2008, and was laid to rest next to his parents in Kuntsevskoe cemetery in Moscow, Russia. He is survived by his ex-wife Marianna Vertinskaya and their daughter Darya Khmelnitskaya.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0451699","name":"Boris Khmelnitskiy","idIMDB":"nm0451699"},"actorId":"nm0451699","character":"Viglieri","urlCharacter":"http://www.imdb.com/character/ch0527533","main":true},{"actorName":"Yuriy Solomin","urlProfile":"http://www.imdb.com/name/nm0813272","urlPhoto":"","biography":{"dateOfBirth":"18 June 1935","placeOfBirth":" Chita, Russian SFSR, USSR [now Russia]","birthName":"Yuri Mefodyevich Solomin","bio":"Yuri Solomin is an acclaimed Russian stage and film actor and director, internationally best known for his work with director Akira Kurosawa in the leading role as Arseniev in Russian-Japanese film Dersu Uzala (1975). He was born Yuri Mefodievich Solomin on June 18, 1935, in Chita, Siberian Russia, Soviet Union. His father, Mefodi Viktorovich, was a cellist and violinist, his mother, Zinaida Ananievna, was a mezzo-soprano; both parents taught classical music at the House of Pioneers in Chita. In 1953, after graduating from Chita high school, young Yuri Solomin moved to Moscow. There he attended Shchepkin Theatrical School, studied acting under Vera Pashennaya, graduating in 1957 as an actor. That same year he became permanent member of the troupe at the Academic Maly Theatre in Moscow. Since 1988, Solomin has been Artistic Director of the Maly Theatre. He also was Russian Minister of Culture from 1990 to 1992. Yuri Solomin played over 50 roles in films and on television, and also played about 60 roles in stage productions. He was elected president of Association of Russian Theatres, was designated People's Actor of the USSR, and received numerous awards and decorations from both the Soviet and Russian governments. He is living in Moscow, Russia.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0813272","name":"Yuriy Solomin","idIMDB":"nm0813272"},"actorId":"nm0813272","character":"Troiani","urlCharacter":"http://www.imdb.com/character/ch0527536","main":true},{"actorName":"Yuriy Vizbor","urlProfile":"http://www.imdb.com/name/nm0900413","urlPhoto":"","biography":{"dateOfBirth":"20 June 1934","placeOfBirth":" Moscow, RSFSR, USSR [now Russia]","birthName":"Yury Iosifovich Vizbor","bio":"Yuriy Vizbor was born on June 20, 1934 in Moscow, RSFSR, USSR as Yury Iosifovich Vizbor. He was an actor and writer, known for July Rain (1967), You and Me (1971) and The Red Tent (1969). He died on September 17, 1984 in Moscow, RSFSR, USSR [now Russia].","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0900413","name":"Yuriy Vizbor","idIMDB":"nm0900413"},"actorId":"nm0900413","character":"Behounek","urlCharacter":"http://www.imdb.com/character/ch0527534","main":true},{"actorName":"Donatas Banionis","urlProfile":"http://www.imdb.com/name/nm0052023","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3NzgwNDU2Ml5BMl5BanBnXkFtZTgwNDIyOTIwOTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1924","placeOfBirth":" Kaunas, Lithuania","height":"5' 9\" (1.75 m)","bio":"Donatas Banionis was a popular Lithuanian actor known for Niekas nenorejo mirti (1966), Myortvyy sezon (1968), and Solaris (1972). He was born Donatas Juozas Banionis on April 28, 1924, in Kaunas, Lithuania. His mother, Blazhaitite-Banionene Ona, was a homemaker. His father, Juozas Banionis, was a tailor who took part in the Russian Revolution of 1917, was wounded in the Russian Civil War, then became a political prisoner, and briefly emigrated to Brasil during the 1920s. Young Banionis was raised with his elder sister during the years of Lithuanian independence before WWII. In 1941 Donatas Banionis was hired by the famous Lithuanian theatrical director Juozas Miltinis and became an actor at the newly formed Panevezys Drama Theatre. He studied acting under Juozas Miltinis and graduated from the Panevezys Acting Studio in 1945. In 1947 Banionis made his film debut: he appeared in a cameo role in 'Marite' (1947). His first major film work was the role of adventurer Daus in 'Adomas nori buti zmogumi' (Adam Wants to Be a Man 1959) by director Vytautas Zalakevicius. Long before becoming an acclaimed actor Banionis tried to escape from the Soviet Union at the end of the Second World War; but he failed to join his Lithuanian compatriots when they fled the Soviets. Soon the Iron curtain became impenetrable from either side. However, in 1970, as a member of an official Soviet delegation, he made his first visit to the Lithuanian community in Chicago. Then Banionis, being already a famous actor, came to realize that his former compatriots earned their good living and nice homes by working very hard from very poor beginnings. At that time, Banionis enjoyed a highly privileged life as a top film-star in the Soviet Union. He was awarded the State Prize in 1975, and was received by such Soviet leaders as Leonid Brezhnev and Mikhail Gorbachev. Banionis earned critical acclaim for his role of Vaitkus in 'Niekas nenorejo mirti' (Nobody Wanted to Die, 1966) by director Vytautas Zalakevicius. A powerful film, it was even dubbed the \"Lithuanian Seven Samurai.\" Banionis' tragical character Vaitkus is the undecided one among the Lithuanian \"brothers in the woods\", who are fighting against the Soviets after the end of the Second World War. Banionis demonstrated his range as a comedian in the comic role of a priest in 'Beregis avtomobilya' (Watch Out for the Automobile, 1966) by director Eldar Ryazanov. Banionis' sweet character blends well with the stellar ensemble of actors, such as Innokentiy Smoktunovskiy, Oleg Efremov, Andrey Mironov, Anatoliy Papanov, Evgeniy Evstigneev, Georgi Zhzhyonov, and other Russian film stars. Donatas Banionis is a refined intellectual actor with effortless style. His mastery of timing, his powerful silence, and his reserved energy shines in his major film-works; such as in 'King Lear' (1969) by Grigori Kozintsev, in 'Solaris' (1972) by Andrei Tarkovsky, in 'Goya - oder Der arge Weg der Erkenntnis' (1971) by director Konrad Wolf, in 'Begstvo mistera Mak-Kinli' by director Mikhail Shvejtser, in 'Beethoven - Days in a Life' (1976) by director Horst Seemann, and in other films. One of his memorable film-works is the character of a Russian spy 'Ladeinikov' in 'Myortvy Sezon' (The Dead Season, 1968) by director Savva Kulish. That film role provided Banionis with an auspicious connection. In 2004, the actor had a meeting with the Russian President Vladimir Putin. Mr. Putin confirmed that he made up his mind to become an intelligence officer after seeing Banionis in the role of a Russian spy. In his later works Donatas Banionis constitutes the link between cinema of the past and contemporary Lithuanian film. He showed reserved and convincing work in the role of 'The old man' in 'Kiemas' (Courtyard, 1999), a reflective film about a Lithuanian father and his family's depressing fate in the 1970's Soviet Union. He worked with director Aleksandr Buravskiy in 'Attack on Leningrad' (2006), a film about the historic siege during the Second World War; where his acting partners are Gabriel Byrne, Mira Sorvino, Aleksandr Abdulov, Kirill Lavrov, Mikhail Efremov and others. During his acting career spanning over sixty five years, Donatas Banionis played over 50 roles in film and on television. He also played over 100 stage roles, mainly at the Panevezys Juozas Miltinis' Drama Theatre. Banionis was designated People's Actor of the USSR (1974), and People's actor of the Lithuanian Republic (1973). He is Chevalier of the Order of the Lithuanian Grand Duke Gediminas. Donatas Banionis lived in the city of Panevezys, Lithuania. He was Honorable Citizen of Panevezys (1999). Actor died of heart related problems on 4th of September 2014 in Panevezys, Lithuania. He was ninety years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3NzgwNDU2Ml5BMl5BanBnXkFtZTgwNDIyOTIwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0052023","name":"Donatas Banionis","idIMDB":"nm0052023"},"actorId":"nm0052023","character":"Mariano","urlCharacter":"http://www.imdb.com/character/ch0527532","main":true}],"seasons":[],"idIMDB":"tt0067315","urlIMDB":"http://www.imdb.com/title/tt0067315","business":{"budget":{"money":"$10,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":[{"money":"91,963 (France)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"855,964 (Spain)","country":"","day":null,"month":null,"year":null,"remarks":null}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["2 hr 38 min (158 min) (Russia)","2 hr 1 min (121 min) (International) (USA)"],"soundMix":["70 mm 6-Track (70 mm prints)","Mono (35 mm prints)"],"color":["Color (Technicolor)"],"aspectRatio":["1.66 : 1 (international version) (cropped)","2.20 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["70 mm"],"cinematographicProcess":["Sovscope 70"],"printedFilmFormat":["35 mm (international version)","70 mm"]},"rating":"7.1","filmingLocations":[{"location":"Soviet Union"}],"rated":"G","awards":[{"award":"Golden Globes, USA 1972","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best English-Language Foreign Film","names":[]}]}]},{"award":"Italian National Syndicate of Film Journalists 1970","titlesAwards":[{"titleAwardOutcome":"Nominated Silver Ribbon","categories":[{"category":"Best Producer (Migliore Produttore)","names":[{"name":"Franco Cristaldi","id":"nm0188053","role":null}]}]}]}],"votes":"1,397","type":"Movie","companyCreditsSimple":[{"idCompany":"co0024010","name":"Mosfilm"},{"idCompany":"co0033761","name":"Vides Cinematografica"}],"keywords":{"keywords":["rescue operation","cold weather","arctic","crash","epic","hypothermia","ham radio","hero","scientific experiment","freeze","color in title","zeppelin","airplane","1920s","trial","leadership","icebreaker","courage","arctic exploration","survival","based on true story"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:28:42"}}