{"data":{"movies":[{"title":"The Big Timer","originalTitle":"","year":"1932","releaseDate":"19320310","directors":[{"name":"Edward Buzzell","id":"nm0125636"}],"writers":[{"name":"Robert Riskin","id":"nm0728307"},{"name":"Dorothy Howell","id":"nm0397963"}],"runtime":"72 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTRiZWViNjAtOTAwMC00YWVjLWFlYjctNWNkODkwNzYwN2MyXkEyXkFqcGdeQXVyNTY4NjI2OTA@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Sport"],"plot":"An up and coming boxer ( Ben Lyon) runs into problems when he takes on a women fight manager (Constance Cummings). Ben Lyon is once again playing with Tom Dugan [They co-starred in \"The Hot Heiress\"(1931)]. This one is directed by Edward Buzzell. 74 minutes.","simplePlot":"An up and coming boxer ( Ben Lyon) runs into problems when he takes on a women fight manager (Constance Cummings). Ben Lyon is once again playing with Tom Dugan [They co-starred in \"The Hot... ","actors":[{"actorName":"Ben Lyon","urlProfile":"http://www.imdb.com/name/nm0528908","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1MzMxNzI3N15BMl5BanBnXkFtZTgwMjM0OTg0MzE@._V1._CR145,182,713,952_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 February 1901","placeOfBirth":" Atlanta, Georgia, USA","height":"6' (1.83 m)","bio":"Ben Lyon was your average boyish, easy-going, highly appealing film personality of the Depression-era 1930s. Although he never rose above second-tier stardom, he would enjoy enduring success both here and in England. Born Ben Lyon, Jr. in Atlanta, Georgia, the future singer/actor was the son of a pianist-turned-businessman and youngest of four. Raised in Baltimore, he started performing in amateur productions as a teen before earning marquee value on Broadway opposite such stars as Jeanne Eagels. Hollywood took notice of the baby-faced charmer and soon Ben was ingratiating filmgoers opposite silent film's most honored leading ladies. He appeared with Pola Negri in Lily of the Dust (1924), Gloria Swanson in Wages of Virtue (1924), Barbara La Marr in The White Moth (1924), Mary Astor in The Pace That Thrills (1925) and Claudette Colbert, in her only silent feature, in For the Love of Mike (1927). He advanced easily into talkies and was particularly noteworthy as the dashing hero in Howard Hughes' Hell's Angels (1930), in which Ben actually piloted his own plane (Ben had trained as a pilot during WWI) and filmed some of the airborne scenes for Hughes himself. That same year was also a banner year for him in his personal life after marrying Paramount Pictures film star Bebe Daniels, with whom he had appeared in Alias French Gertie (1930). As both of their movie careers started to decline, the talented twosome decided to work up a husband-and-wife music hall and vaudeville act. They took their show to England and became a hit at the London Palladium. At one point he served in the U.S. Army Air Force and rose to the rank of Lt. Colonel in charge of Special Services for the U.S. Air Corps in England. Soldiers, sailors and airmen (from 1939) listened to Ben and Bebe weekly on the air waves with their popular, long-running BBC broadcast \"Hi, Gang!\" The couple remained in England throughout WWII performing on stage and doing their valid part to entertain and honor the troops. After a brief postwar stay in Hollywood in 1946, where Ben had taken an executive position with Fox, the couple returned to England and headlined another popular 1950s radio show, \"Life with the Lyons,\" which spawned two family-styled films that included children Barbara Lyon and Richard Lyon. In the early 1960s Bebe suffered multiple strokes and left the limelight, passing away in 1971. Ben remarried (to former actress Marian Nixon) and settled in the US, where he died in 1979 of a heart attack while on vacation.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1MzMxNzI3N15BMl5BanBnXkFtZTgwMjM0OTg0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0528908","name":"Ben Lyon","idIMDB":"nm0528908"},"actorId":"nm0528908","character":"Cooky Bradford","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Constance Cummings","urlProfile":"http://www.imdb.com/name/nm0191870","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDNmOTQ0ZDItNWUwOC00Zjc0LThmZTUtMjc3MGExYzEwY2QwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 May 1910","placeOfBirth":" Seattle, Washington, USA","birthName":"Constance Halverstadt","height":"5' 4\" (1.63 m)","bio":"Coming from a musical family - her mother was a concert soprano - Constance Cummings made her show business debut in 1926 in regional stock theater, and by 1928 had appeared in her first Broadway play. Her success in the theater resulted in an invitation to Hollywood, where she went 1931. Although she played in more than 20 films, she was never really comfortble in Hollywood nor satisfied with the parts she was getting, and in 1934 she left for England, UK. She continued her stage and film career there. but few of those films ever made it back to the U.S.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDNmOTQ0ZDItNWUwOC00Zjc0LThmZTUtMjc3MGExYzEwY2QwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0191870","name":"Constance Cummings","idIMDB":"nm0191870"},"actorId":"nm0191870","character":"Honey Baldwin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thelma Todd","urlProfile":"http://www.imdb.com/name/nm0865298","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5Mjk4ODc5MF5BMl5BanBnXkFtZTgwODQyNjc3MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1906","placeOfBirth":" Lawrence, Massachusetts, USA","height":"5' 4\" (1.63 m)","bio":"Thelma Todd was born in Lawrence, Massachusetts, an industrial city near the New Hampshire state line. She was a lovely child with good academic tendencies, so much so that she decided early on to become a schoolteacher. After high school she went on to college but at her mother's insistence entered several beauty contests (apparently her mother wanted her to be more than just a \"schoolmarm\"). Thelma was so successful in these endeavors that she entered on the state level and won the title of \"Miss Massachusetts\" in 1925 and went on to the \"Miss America\" pageant. Although she didn't win, the pageant afforded her a chance to be seen been by talent scouts looking for fresh new faces to showcase in films. She began appearing in one- and two-reel shorts, mostly comedy, which showcased her keen comic timing and aptitude for physical comedy (unusual in such a beautiful woman). She had been making shorts for Hal Roach when she was signed to Paramount Pictures. Her first film--at 21 years of age--was as Lorraine Lane in 1927's Fascinating Youth (1926), a romantic comedy, which was Paramount's showcase vehicle for its new stars. Thelma received minor billing in another film that year, God Gave Me Twenty Cents (1926). The next year she starred with Gary Cooper and William Powell in the western Nevada (1927). That year also saw her in three more films, with The Gay Defender (1927) being the most notable. It starred Richard Dix in the role of a man falsely accused of murder. As the 1920s closed, Thelma began getting parts in more and more films. In 1928 and 1929 alone she was featured in 20 pictures, and not just comedies--she also did dramas and gothic horror films. Unlike many silent-era stars whose voices didn't fit their image or screen persona, Thelma's did. She had a bright, breezy, clear voice with a pleasant trace of a somewhat aristocratic, but not snobbish, New England accent and easily made the transition to sound films. In 1930 she added 14 more pictures to her resume, with Dollar Dizzy (1930) and Follow Thru (1930) being the most notable. The latter was a musical with Thelma playing a rival to Nancy Carroll for the affections of Buddy Rogers. It was a box-office hit, as was the stage production on which it was based. The following year Thelma appeared in 14 more films, among them Let's Do Things (1931), Speak Easily (1932), The Old Bull (1932) and On the Loose (1931). Her most successful film that year, however, was the Marx Brothers farce Monkey Business (1931). While critics gave the film mixed reviews, the public loved it. In 1932 Thelma appeared in another Marx Brothers film directed by Norman Z. McLeod, Horse Feathers (1932). She also starred in This Is the Night (1932), a profitable film which featured Cary Grant in his first major role. In 1934 Thelma made 16 features, but her career would soon soon come to a grinding halt. In 1935 she appeared in such films as Twin Triplets (1935) and The Misses Stooge (1935), all showcasing her considerable comic talents. She also proved to be a savvy businesswoman with the opening of \"Thelma Todd's Sidewalk Cafe,\" a nightclub/restaurant that catered to show business people. It also, unfortunately, attracted some shady underworld types as well, and there were rumors that they were trying to take over her club and use it as a gambling establishment in order to fleece the wealthy Hollywood crowd. According to these stories, Thelma and her boyfriend, director Roland West, wouldn't sell their establishment once they found out what the gangsters had in mind, thereby incurring the enmity of people it was not a good idea to become enemies of. Whether the stories were true or not, on December 16, 1935, Thelma was found dead in her car in her garage in Los Angeles. Her death was ruled a suicide owing to carbon monoxide poisoning. She was only 29 years old. At the time, as today, many felt that her death was actually a murder connected to the goings-on at her club, a theory that was lent credence by the fact that no one who knew her had ever seen her depressed or morose enough to worry about her committing suicide. Another factor that aroused suspicion was that her death was given a cursory investigation by the--at the time--notoriously corrupt Los Angeles County District Attorney's Office and the case was quickly and unceremoniously closed. Her death has remained a controversial one even to this day. Three films she made before her death weren't released until the following year: Hot Money (1936), An All American Toothache (1936), and The Bohemian Girl (1936). The latter saw her quite substantial role cut down so much that she was barely glimpsed in the picture. Thelma had made an amazing 115 films in such a short career, and her beauty and talent would no doubt have taken her right to the top if it hadn't been for her untimely demise.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5Mjk4ODc5MF5BMl5BanBnXkFtZTgwODQyNjc3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0865298","name":"Thelma Todd","nicknames":["The Ice Cream Blonde","Hot Toddy"],"idIMDB":"nm0865298"},"actorId":"nm0865298","character":"Kay Mitchell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Dugan","urlProfile":"http://www.imdb.com/name/nm0240836","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjc3NjU0NjUtZjhkNy00MDJmLTkyNjEtNWY3NDJmNzJlOGUzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1889","placeOfBirth":" Dublin, Ireland","birthName":"Marie V. Ingle","bio":"Prolific Irish character actor Thomas J. Dugan was born in Dublin on New Year's Day 1889. At a young age, his family moved to Philadelphia, where Dugan attended high school. He had a good tenor voice so, after leaving school, he decided to pursue a career in show business. Before appearing on stage, Dugan performed in minstrel and traveling medicine shows that were popular at the time. He played in musical comedies in New York City and vaudeville theaters such as Earl Carroll's Vanities before eventually becoming a comedian on Broadway. Dugan began his acting career in 1927 with roles in some obscure silent movies. He was lucky enough to be cast in Lights of New York (1928), the very first feature film with all synchronous dialogue (The Jazz Singer (1927) was the first movie to use audible dialogue, but it still used title cards). His best-known films are Ernst Lubitsch's satirical World War II comedy To Be or Not to Be (1942) and the Gene Kelly/Frank Sinatra/Esther Williams musical Take Me Out to the Ball Game (1949). Over the years, Dugan appeared in more than 260 films, appearing on silver screens frequently until a road accident in California took his life on March 7, 1955. He was 66 years old at the time of his death.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjc3NjU0NjUtZjhkNy00MDJmLTkyNjEtNWY3NDJmNzJlOGUzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0240836","name":"Tom Dugan","idIMDB":"nm0240836"},"actorId":"nm0240836","character":"Catfish","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Emmett O'Connor","urlProfile":"http://www.imdb.com/name/nm0640495","urlPhoto":"","biography":{"dateOfBirth":"18 March 1885","placeOfBirth":" Milwaukee, Wisconsin, USA","bio":"Stalwart Irish-American character actor Robert Emmet O'Connor, who was born on March 18, 1885, in Milwaukee, Wisconsin. He made his bones performing in circuses and in vaudeville. He made his Broadway debut in the musical \"Fritz in Tammany Hall\" at the Herald Square Theatre on October 16, 1905, ultimately appearing in 13 musical comedies and operettas on the Great White Way through 1930 (he also appeared in four straight plays during that period, mostly comedies such as \"The Old Soak\" during the 1922-23 season). After 1930, he never appeared on Broadway again, focusing instead on his movie career. He made his movie debut in 1920 in the Harold Lloyd comedy short His Royal Slyness (1920), directed by Hal Roach. He made six comedies for the Hal Roach Studios in the years 1920-21, including one more Harold Lloyd vehicle, Never Weaken (1921), before taking a five-year hiatus from films. He returned in the Thomas Meighan drama, Tin Gods (1926), directed by Allan Dwan, then spent the next 24 years acting in movies. In 1930, he went back to the Roach Studio to support Laurel and Hardy in two Spanish language shorts, then moved over to Warner Bros. as a bit player. He played the Irish bootlegger Paddy Ryan in the classic The Public Enemy (1931) in support of fellow Irish-American James Cagney, and appeared in another classic, Mystery of the Wax Museum (1933). He then settled into being typecast as Irish cops. After he moved on to MGM, the typecasting led to one of his most famous roles: the plain-clothes detective in pursuit of the Marx Brothers in A Night at the Opera (1935). During the 1940s, still under contract player to MGM, he was kept busy, appearing in every genre, including the \"Our Gang\" comedies. His last film role was as the Paramount Studios' guard who remembers Norma Desmond in Sunset Boulevard (1950). He virtually retired from his acting career at the age of 65, though he made some television appearances in the 1950s. Robert Emmett O'Connor died on September 4, 1962, of injuries sustained in a fire. He was 77 years old.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0640495","name":"Robert Emmett O'Connor","idIMDB":"nm0640495"},"actorId":"nm0640495","character":"Dan Wilson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charley Grapewin","urlProfile":"http://www.imdb.com/name/nm0335788","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyODYwMTMzNzNeQTJeQWpwZ15BbWU3MDI5NjM2MDg@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 December 1869","placeOfBirth":" Xenia, Ohio, USA","birthName":"Charles Ellsworth Grapewin","height":"5' 7½\" (1.71 m)","bio":"This old codger film favorite, born in 1869 (some reports say 1875), got into the entertainment field at an early age, first as a circus performer (aerialist and trapeze artist). When acting sparked his interest, he worked in a series of stock companies while writing stage plays that he himself could star in. He married actress Anna Chance around the turn of the century, and they remained a devoted couple until her death 47 years later. They had no children. Charley came into his own in films at the ripe old age of 60 as the ultimate humorous, toothless character in a range of films with rustic settings. Notable movies include The Petrified Forest (1936) with Leslie Howard and Humphrey Bogart, The Good Earth (1937) with Paul Muni and Luise Rainer, and They Died with Their Boots On (1941) with Errol Flynn. However, his best-remembered parts were as huggable Uncle Henry in the classic The Wizard of Oz (1939), ornery Grandpa Joad, who refused to leave the homestead in The Grapes of Wrath (1940), Inspector Queen in the Ellery Queen whodunits that ran from 1940 through 1942, and the amiable ne'er-do-well Jeeter Lester in Tobacco Road (1941). A soft, humorous presence who seemed frail around the edges, he was a thorough delight, his folksy presence gracing over 100 films. He died in 1956.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyODYwMTMzNzNeQTJeQWpwZ15BbWU3MDI5NjM2MDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0335788","name":"Charley Grapewin","idIMDB":"nm0335788"},"actorId":"nm0335788","character":"Pop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Russell Hopton","urlProfile":"http://www.imdb.com/name/nm0394477","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2RiMDAzMzUtMzE0My00NTViLWE4NDQtYzcxNDY2Y2I1MzVhXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 February 1900","placeOfBirth":" New York City, New York, USA","height":"5' 11\" (1.8 m)","bio":"Russell Hopton was born on February 18, 1900 in New York City, New York, USA. He was an actor and director, known for 'G' Men (1935), Death from a Distance (1935) and I'm No Angel (1933). He died on April 7, 1945 in North Hollywood, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2RiMDAzMzUtMzE0My00NTViLWE4NDQtYzcxNDY2Y2I1MzVhXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0394477","name":"Russell Hopton","idIMDB":"nm0394477"},"actorId":"nm0394477","character":"Sullivan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Miller","urlProfile":"http://www.imdb.com/name/nm1053550","urlPhoto":"","biography":{"bio":"Jack Miller is an actor, known for Oh, Mama! (1928), The Devoted Ape (1910) and At It Again (1928).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1053550","name":"Jack Miller","idIMDB":"nm1053550"},"actorId":"nm1053550","character":"Scrappy Martin","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0022682","urlIMDB":"http://www.imdb.com/title/tt0022682","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"coptright MCMXXXII Columbia Pictures Corporation (on print); © Columbia Pictures Corporation; 10 March 1932; LP2886 (in copyright registry)"},"technical":{"runtime":["1 hr 12 min (72 min)"],"soundMix":["Mono (Western Electric System)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["(7 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.1","filmingLocations":[{"location":"Oregon, USA"}],"rated":"PASSED","awards":[],"votes":"207","type":"Movie","companyCreditsSimple":[{"idCompany":"co0050868","name":"Columbia Pictures Corporation"}],"keywords":{"keywords":["manhattan new york city","wedding ring","wedding cake","unemployment","sock on the jaw","socialite","regeneration","party","panhandling","new york city","marriage","madison square garden manhattan new york city","infidelity","gym","gold coin","fistfight","fight manager","employment agency","double cross","diner","dancing","courtroom","counter man","charity","birthday","automobile accident","accidental death","melodrama","boxing"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 00:18:18"}}