{"data":{"movies":[{"title":"The First Power","originalTitle":"","year":"1990","releaseDate":"19900406","directors":[{"name":"Robert Resnikoff","id":"nm0720352"}],"writers":[{"name":"Robert Resnikoff","id":"nm0720352"}],"runtime":"98 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzI2OTAxNl5BMl5BanBnXkFtZTcwMzQxNzYxMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Horror","Thriller"],"plot":"A killer is given the gas chamber after committing several demonic murders. His spirit is released and given power by the Devil. Now the cop that caught him before must find a way to do it again.","simplePlot":"Dedicated L.A. police detective and a female psychic are trying to stop a demonic serial killer who was given the powers of resurrection, teleportation and possession.","actors":[{"actorName":"Lou Diamond Phillips","urlProfile":"http://www.imdb.com/name/nm0001617","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NTgwMTQzMl5BMl5BanBnXkFtZTcwMjAzNTM4Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1962","placeOfBirth":" Subic Bay Naval Base, Olongapo City, Zambales, Philippines","birthName":"Lou Diamond Upchurch","height":"6' 1\" (1.85 m)","bio":"Lou Diamond Phillips was born on February 17, 1962 in Subic Bay Naval Base, Olongapo City, Zambales, Philippines as Lou Diamond Upchurch. He is an actor, known for Courage Under Fire (1996), La Bamba (1987) and Longmire (2012). He has been married to Yvonne Boismier Phillips since August 16, 2007. They have one child. He was previously married to Kelly Phillips and Julie Cypher.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NTgwMTQzMl5BMl5BanBnXkFtZTcwMjAzNTM4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001617","name":"Lou Diamond Phillips","idIMDB":"nm0001617"},"actorId":"nm0001617","character":"Russell Logan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tracy Griffith","urlProfile":"http://www.imdb.com/name/nm0341615","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMjYxMzQyNF5BMl5BanBnXkFtZTYwOTA0MzEz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 October 1965","placeOfBirth":" New York City, New York, USA","bio":"Tracy Griffith was born to Peter Griffith and his second wife Nanita Greene Samuels on October 19, 1965 in New York City. She joined half-sister Melanie Griffith and two years later, her brother Clay A. Griffith joined the family of entertainers. She wanted to follow the footsteps of her half sister, Melanie and had a minor role in her film, Fear City (1984) in the role of Sandra Cook. She went to many acting schools and did some theatre, as well as TV guest appearances. She eventually won a supporting role in The Good Mother (1988) which was directed by Leonard Nimoy. Then she got her first major role of Marcia Holland in a direct-to-video slasher film known as Sleepaway Camp III: Teenage Wasteland (1989). She then won roles in bigger films and movies of the week, including The First Power (1990), The Finest Hour (1992) and Their Second Chance (1997). She also played Kelly Monroe in a short-lived soap called The Monroes (1995). She is also a musician and a professional sushi chef, and concentrates mainly on this, these days. She also wrote two cookbooks. On September 17, 2011, she married Mark Daley, President of Polo Ralph Lauren.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMjYxMzQyNF5BMl5BanBnXkFtZTYwOTA0MzEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0341615","name":"Tracy Griffith","idIMDB":"nm0341615"},"actorId":"nm0341615","character":"Tess Seaton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeff Kober","urlProfile":"http://www.imdb.com/name/nm0462116","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2NTI4OTgzMl5BMl5BanBnXkFtZTgwMDU0NzA4NjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1953","placeOfBirth":" Billings, Montana, USA","height":"5' 11¼\" (1.81 m)","bio":"Jeff Kober, a native of Billings, Montana, was born on December 18, 1953. Not satisfied with being a rancher, Kober relocated to the L.A. area in his twenties with the desire to become an actor. His first appearance on the small screen was a non-billed role in the 1980s series V (1984). Kober went on to supporting roles in the highly acclaimed Vietnamese War drama China Beach (1988) and the short-lived, but now-cult horror series Kindred: The Embraced (1996). Following these series, Kober has guested on some of the most popular television series of the day. They include Law & Order: Special Victims Unit (1999), CSI: Crime Scene Investigation (2000), ER (1994), 24 (2001), The Closer (2005) and Criminal Minds (2005). Kober's big screen career began with the film Out of Bounds (1986), in which he played the first of his signature nefarious characters - \"Roy Gaddis\", a small-time drug dealer with murderous inclinations. This role led to more film opportunities in The First Power (1990), Tank Girl (1995) (a comedic turn), Defining Maggie (2002), World Without Waves (2004), and the remake of The Hills Have Eyes II (2007), among others. Never one to balk at taking a chance in the acting field, Kober has also appeared in several short independent films - the Academy Award-winning Session Man (1991) and, most recently, Lucid (2006), another film that has garnered a number of awards at independent film festivals across the country. He has done extensive stage work, most prominently, as \"the father\" in Jenny Sullivan's autobiographical work \"J For J\" and \"Defying Gravity\". Being a creature of diverse talents, Kober is also a noted artist (he was responsible for the paintings attributed to his character \"Daedalus\" on Kindred: The Embraced (1996) and is the c/o author of \"Art That Pays: The Emerging Artist's Guide to Making a Living\" along with Adele Slaughter. On the personal front, Kober is twice divorced (Rhonda Talbot, Kelly Cutrone) and the father of one son. He has, at present, finished work on The Hills Have Eyes II (2007) (set for release in March 2007)-in the role of \"Col. Lincoln Redding\". Kober's next film, Multiple (2008), is in post-production.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2NTI4OTgzMl5BMl5BanBnXkFtZTgwMDU0NzA4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0462116","name":"Jeff Kober","idIMDB":"nm0462116"},"actorId":"nm0462116","character":"Patrick Channing","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mykelti Williamson","urlProfile":"http://www.imdb.com/name/nm0932112","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MDY1NzU4Ml5BMl5BanBnXkFtZTcwMzYyNDUyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1957","placeOfBirth":" Saint Louis, Missouri, USA","birthName":"Michael T. Williamson","height":"6' 2\" (1.88 m)","bio":"Perhaps best remembered for his touching performance as \"Bubba\" opposite Tom Hanks in the Academy Award-winning Forrest Gump (1994), Mykelti Williamson is one of the most sought-after actors in Hollywood, who has been steadily honing his craft since he first began acting professionally at the age of 18. This past fall Williamson starred as Lt. Philip Gerard, the hardnosed detective determined to recapture escaped convict Dr. Richard Kimble (Tim Daly) in CBS' update of the classic 1960's action series The Fugitive (2000). The son of an Air Force Staff Sergeant (father) and certified public accountant (mother), Williamson was born in St. Louis, MO, and began performing on the stage at the age of 9. Like many youngsters, he was enamored with the concept of television, and thought that the images he was seeing on the small screen were reality. It wasn't until his mother put him in a church play that he realized that what the people on the small screen were doing was performing. He was instantly hooked. At the age of 15, Williamson and his family settled in Los Angeles. A superb athlete, he excelled at both football and basketball, but the acting bug led him to quit sports and dance with the cheerleading squad, much to the chagrin of his coaches. Following graduation, Williamson began acting professionally, making appearances on television shows such as Starsky and Hutch (1975), Hill Street Blues (1981) and China Beach (1988), among others. He made his film debut in the Walter Hill-directed feature Streets of Fire (1984), opposite Diane Lane, Michael Paré and Willem Dafoe. He would subsequently appear in the feature The First Power (1990) with Lou Diamond Phillips, Miracle Mile (1988) with Anthony Edwards and Mare Winningham, Number One with a Bullet (1987), Wildcats (1986) and Free Willy (1993). Following his critically acclaimed performance in Forrest Gump (1994), Williamson starred in Forest Whitaker's Waiting to Exhale (1995); partnered with Al Pacino in Michael Mann's Heat (1995); Sauvez Willy 2 (1995), and starred alongside Nicolas Cage in Con Air (1997). Williamson was also seen in Mike Nichols' political drama Primary Colors (1998) (a cameo appearance which he did as a personal favor to Nichols and John Travolta) and Three Kings (1999), opposite George Clooney, Mark Wahlberg and Ice Cube. In 1996 Williamson returned to television when he starred opposite Delroy Lindo and Blair Underwood in the critically acclaimed HBO telefilm Soul of the Game (1996) and received rave reviews for his stirring portrayal of legendary Negro League baseball legend Josh Gibson. Williamson also starred in Buffalo Soldiers (1997) for TNT and 12 Angry Men (1997) for Showtime, as well as starring in the cable network's series The Hoop Life (1999). On stage Williamson starred with Samuel L. Jackson, D.B. Sweeney, Ellis Williams, Matt McGrath and Richard Reilly in Clark Gregg's (\"What Lies Beneath\") 1995's ensemble drama \"Distant Fires\", which earned the cast a prestigious L.A. Theatre Award. An avid sports fan and devoted family man, Williamson enjoys restoring classic cars and rodeoing in his free time. He currently lives in Los Angeles with his wife and two of his three daughters. Named by his grandfather for 'Spirit' or 'Silent Friend' in the language of Blackfeet Indians, Mykelti Williamson has quietly built a reputation in Hollywood as one of the most consistently proven actors in the business, delivering stirring and honest performances that always capture audiences.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MDY1NzU4Ml5BMl5BanBnXkFtZTcwMzYyNDUyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0932112","name":"Mykelti Williamson","idIMDB":"nm0932112"},"actorId":"nm0932112","character":"Detective Oliver Franklin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elizabeth Arlen","urlProfile":"http://www.imdb.com/name/nm0035151","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4ODU1MDkxOF5BMl5BanBnXkFtZTgwNTcyMjA1MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1964","placeOfBirth":"","height":"5' 4\" (1.63 m)","bio":"Elizabeth Arlen is an American actress and writer who was born on October 31,1955. An ageless beauty with the face and figure of a woman decades younger, on-screen and off, it doesn't take long to find yourself under her spell. She possesses an intensity, sharp wit, a penchant for bucking traditional gender roles, and a wild spark of passion for life that's evident in her every action. An empathetic, self-aware woman with a compelling personality and a strong voice; Arlen is all this, and more. Arlen was born Elizabeth Faye Arlen on the Camp Lejune Marine base to a Jewish father and Catholic mother, who met in New York at Syracuse University. Her parents moved to Los Angeles when Elizabeth was three. She was raised on North Amalfi Drive in Pacific Palisades, where her next door neighbor was Leonard Freeman, creator and producer of the original Hawaii Five-0 series. In the neighborhood lived Norman Felton, Jerry Paris, director Martin Ritt, and around the corner resided her father's best friend, Rod Serling. Despite growing up in the presence of Hollywood elite, Arlen didn't consider becoming involved in the entertainment industry until her college years. She credits her parents for her well-rounded sensibilities and education. Her father, Harold Arlen, was a prominent psychoanalyst, who was once portrayed by Karl Malden in Patty Duke's autobiographical film Call Me Anna. Her mother, Mary Arlen, was an accomplished and talented painter and sculptor. Her parents encouraged her to seek knowledge and experience activities she was interested in from a very early age. Never coddled, she was taught to fight her own battles and solve her own conflicts even as a child. Several times in her teens and early college years, talent scouts attempted to recruit Arlen, but her father refused to let her sign any contracts. She was raised on the principle that a college education was more important than anything else. In addition to being a great student, Arlen enjoyed athletics from a young age. She played basketball in elementary school and went on to become a sprinter in high school. It was much earlier in life, however, that her interest in both sports and acting would appear. Arlen started ballet at four, and was on stage at age six, when she performed in a ballet recital at the Santa Monica Civic Auditorium. In elementary school she would often re-enact scenes from movies for her friends on the playground at recess. Arlen was a natural performer from the start. The first time she thought she might enjoy acting was at age fifteen, when Arlen and her parents attended a production of Shakespeare's \"As You Like It\" with The Royal Shakespeare Company at Stratford-Upon-Avon. She was captivated by the performance, and thought, \"I can do that.\" As a teen, however, she most wanted to follow a career path in law or psychology. Though she would soon fall into acting as a hobby, Arlen initially never intended to pursue it professionally. She was elected student body president in high school, and was very interested in politics. Arlen dreamed of fighting for human rights in her work. That strong sense of right and wrong, just and unjust, is still a vital and overt component of her personality today. She began her studies at UCLA at the age of sixteen to major in Psychology. In the summer after her first year of college, at seventeen, Arlen was chosen for the lead role of Lisa in a production of David and Lisa, whose character suffered from Dissociative Identity Disorder (split personality). It was in that production she met David Madden, who was playing a supporting role. She would later marry Madden and spend the next twenty-eight years with him. Arlen had such a great experience with David and Lisa, and received such rave reviews, that she decided to apply to the drama department at UCLA. Her earliest inspiration, and the actor whose work most influenced her to pursue acting professionally, was Al Pacino. She was mesmerized by his iconic performances in Serpico, The Godfather sagas, and Dog Day Afternoon. While attending UCLA, Arlen appeared on Days of Our Lives, and studied acting in earnest for many years at the university, the Lee Strasberg Institute, and with teachers Joan Darling, Milton Katselas, and the legendary stage director, Jose Quintero. Quintero once said of Arlen, \"She's a bottomless well of emotion, you can pull and pull and pull from her and she will never tire.\" Even today, Arlen becomes passionate when she talks about how exhilarating it was to work with Quintero. She graduated from UCLA with a BA in Theater Arts and a minor in Psychology. Arlen approached acting as an opportunity to explore the psyches of the characters she would inhabit. \"From a psychological standpoint,\" she once said, \"you're on the outside, looking in. As an actor, you immerse yourself until you become the character, and are on the inside, looking out.\" \"It's fascinating how your rhythms organically change while you're preparing for a role. As you start to transform into the character; you begin to walk differently, your speech patterns alter, you start to unconsciously dress the way the character would. It's this subtle process of morphing that overtakes you in the most natural form.\" Elizabeth Arlen describes herself as a method actor who took the task of becoming the character very seriously. In his personal blog, writing about the filming of The Kid, director Jon Turteltaub said of Arlen, \"She's a fantastic actress, but she's not really onscreen that much. However, what she was doing off-camera was everything. Her off-camera performance carried Bruce [Willis] through. He relied really heavily on her to bring him to whatever emotional place he wanted to go. Again, it shows that no matter how small the role, a great actor can make a huge contribution.\" After graduating college, Arlen began her acting career wholeheartedly in the theater. In addition to performing in various Los Angeles-based theater productions, she also joined Theatre West, an internationally acclaimed non-profit arts organization in Hollywood, whose members have included Richard Dreyfuss, Carroll O'Connor, Harold Gould, Beau Bridges, and Martin Landau. While working in the theater, she enjoyed alternating between dramatic and comedic characters. It wasn't long before Arlen got her first film role, which was a small scene with Dudley Moore and Albert Brooks in Unfaithfully Yours (1984). Following Unfaithfully Yours, she scored a series of progressively larger roles in films such as Bachelor Party with Tom Hanks (1984), and in the same year, Amy Heckerling cast Arlen as Michael Keaton's teenage girlfriend in Johnny Dangerously. She went on to play Rochelle, a rape victim in the somber film The Ladies Club. She followed this with a silly role in Moving Violations, after which Joel Schumacher cast her as Libby, Mare Winningham's sister, in St. Elmo's Fire. She was again picked by Amy Heckerling to play Mrs. Garland, the amorous newlywed in National Lampoon's European Vacation (1985). Arlen was next cast as the harried, overwhelmed E.R. nurse with Richard Pryor in Critical Condition (1987). Her talent eventually led to more significant roles. She was cast in an ensemble comedy for Paramount called The Whoopee Boys, which centers on a group of misfits attending a charm school to learn manners (directed by John Byrum). She played Shelley, the flipped-out ex-acid-head and semi-reformed ax-murderess. Arlen felt strongly about the shortage and insignificance of women's roles, so she occasionally requested to audition for parts that were originally written for males. Shelley was supposed to be a man, but Arlen pushed to read for the part at her audition. She was positively reviewed for the role. Duane Byrge of the Hollywood Reporter Film Review wrote, \"Arlen gives off a softly perfect loony glint as the Lizzie Borden etiquette learner.\" From her slew of comedic roles, Bernie Brillstein's company suggested Arlen for a regular on Saturday Night Live. Arlen was flown to New York and put up at the Berkshire to audition. Having fallen in love with making movies and married to a man who had to remain in Los Angeles, she was very hesitant about moving to New York. She \"threw\" her audition, and still considers that moment to be one of the biggest mistakes she made in her acting career. Soon after this, Arlen went in to read for a female supporting role in a comedy called Traxx, written and produced by the late Gary DeVore. While she was there, she requested to audition for the role of a male character: an out-of-control lawyer representing the scum of the town for the ACLU; bigger-than-life, broad and bombastic. They laughed so hard at Arlen's audition, DeVore practically fell off the couch. They gave Arlen the role, altering nothing but the character's name -- from Malcolm to Madeline. Though her character was ultimately cut due to a change in story line later in filming, DeVore called Arlen after the film was released to tell her he thought her performance was magnificent, and was saddened she was not in the final version. After Traxx, Arlen won the coveted role of Elaine Wells in the dramatic DOA for Touchstone, playing the doctor and friend of Dennis Quaid who gives him the dreaded news he has less than forty-eight-hours left to live. Later that year, she was cast by Anthony Perkins to play Arlene, Joe Alaskey's best friend in Lucky Stiff, and in 1990 she co-starred in the gritty supernatural thriller, The First Power, starring Lou Diamond Phillips. She played Sister Marguerite, the nun who teams up with Phillips to capture a serial killer who's come back from the dead, and in the process ends up getting possessed, herself. While shooting The First Power, the cinematographer of the film, Theo Van de Sande suggested Arlen for the lead in his wife, Michele Ohayon's, first American short film called Salamander. Arlen gave a gripping dramatic performance about a wallflower who finds her strength and power through her sexuality. Her versatility as an actress, and her excellence in both true-to-life dramatic roles and far-out comedic characters, allowed her to land a wide range of characters, and she played each of them with equal skill and intensity. In 1994, Arlen starred in an Interscope movie released on Lifetime that was directed by David Madden called A Part of the Family. The story revolves around a woman with a repressed past who brings her husband home to meet her family for the first time. Madden cast his wife in his directorial debut because, knowing her capabilities as an actress, he was confident he could rely on her to deliver what he needed. This proved to be a wise decision. At Madden's request, Arlen ended up looping (dubbing in ADR) the five-year-old child who plays her character in flashback throughout the film. She also improvised a gut-wrenching monologue, the climax of the film, on the last day of shooting to replace footage Madden shot the night before without her in it, that didn't work. It was one of the few scenes in the movie that she originally wasn't scripted to be in. Working again with Madden, she had a cameo playing Jim Belushi's close friend, Dee Harris, the ballistic specialist in Separate Lives. In 1999, Arlen played one of the leads in the TV movie for Showtime, In The Company Of Spies, with Tom Berenger and Ron Silver; about a group of brainy specialists in the CIA think tank who are brought together to help retrieve a captured agent in North Korea and obtain the vital information he gathered. The film was written by Roger Towne and directed by Tim Matheson. The premiere for the film was held at the CIA headquarters in Langley, and was the first (and currently only) film the CIA has ever approved about the Agency. In 2000, Jon Turteltaub offered Arlen the part of Bruce Willis's young, thirty-something mother in The Kid, who was dying of cancer in the flashback sequences in the film. While she was filming, her father died of terminal cancer, and The Kid was the last film Arlen did before her life took a sharp turn. After landing a succession of roles and garnering highly positive reviews that gave every indication of a long, vibrant acting career, she seemed to disappear. Though she stopped acting altogether, Arlen was only absent from the public eye. During this period, she continued working with various screenwriters and producers in script development, which allowed her the time she needed to focus on the tumult in her personal life. Day-to-day existence took center stage as she struggled through a string of personal tragedies. The death of her father moved to the forefront of her life, even as she found herself hospitalized with a nearly fatal case of Peritonitis. In a very Hollywood-esque \"eleventh hour\" scenario, the doctor on call performed emergency surgery and managed to save her life, against the odds. It was during her recovery that she and her husband separated. The heartbreak of her divorce from Madden was followed closely by her mother's death and years of a difficult and lengthy probate litigation around her parents' estate, which resulted in estrangement from her family. As Arlen came to terms with her losses, she began to see a shift in her perspective. She reconsidered what it meant to be an actress, a lover, and an intelligent, dynamic woman in today's world. She began to write, and as her thoughts flowed, she found her grief gave strong focus to the things that mattered most. From her well of insights and observations, Arlen created a book she hopes will help other women find fulfillment in love. Through this highly personal work, Elizabeth Arlen emerged, transformed and renewed. In her upcoming book, (Title TBA), Arlen channels the knowledge and emotion borne of her own obstacles and experiences into an enlightening, humorous, and cathartic journey to better understanding what makes relationships work. When asked what the future holds, Arlen says, \"When you have come close to dying, you're reminded how short life is, and inevitably want to do something purposeful. I'm focused on moving forward with my book, because I really hope it will inspire women to pursue satisfying relationships and bring genuine love back into their lives.\" Whatever Elizabeth Arlen chooses to do, one thing is certain: like she, it will be memorable.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4ODU1MDkxOF5BMl5BanBnXkFtZTgwNTcyMjA1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0035151","name":"Elizabeth Arlen","nicknames":["Liz"],"idIMDB":"nm0035151"},"actorId":"nm0035151","character":"Sister Marguerite","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dennis Lipscomb","urlProfile":"http://www.imdb.com/name/nm0513731","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMDMwNjQ3MF5BMl5BanBnXkFtZTcwMDgwNDYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 March 1942","placeOfBirth":" Westbury, New York, USA","height":"6' 1\" (1.85 m)","bio":"Leading and supporting actor Dennis Lipscomb has been appearing in films since the early eighties. Trained as a Shakespearian stage actor, Lipscomb first starring role was the lead in Union City (1980), a film about the 1930s with mobsters and Nazi criminals. After co-starring in Love Child (1982), he took other lead roles in the ghost story Eyes of Fire (1983) and the thriller, Retribution (1988) in 1988. But Lipscomb's more significant roles have included him in supporting parts in major motion pictures including WarGames (1983), A Soldier's Story (1984), Crossroads (1986), The First Power (1990), and Steven Seagal's action hit film Piège en haute mer (1992).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMDMwNjQ3MF5BMl5BanBnXkFtZTcwMDgwNDYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0513731","name":"Dennis Lipscomb","idIMDB":"nm0513731"},"actorId":"nm0513731","character":"Commander Perkins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carmen Argenziano","urlProfile":"http://www.imdb.com/name/nm0034492","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzdkZWJjNWUtODczNC00NGRhLTllN2QtMzU2N2NkZDI3OTc2XkEyXkFqcGdeQXVyMjc3Njc5NDQ@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 October 1943","placeOfBirth":" Sharon, Pennsylvania, USA","birthName":"Carmen Antimo Argenziano","height":"5' 10\" (1.78 m)","bio":"Carmen Argenziano was born on October 27, 1943 in Sharpsville, Pennsylvania, as Carmen Antimo Argenziano. He is an actor known for his work on hundreds of films and TV series throughout his fifty year career. He was in The Accused, Stand And Deliver, The Godfather: Part II, Identity, and many more, including James Franco's production of Don Quixote, playing the title character. He played the memorable and well loved character Jacob Carter in the TV series Stargate SG1. He is a Lifetime Member of The Actors Studio.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzdkZWJjNWUtODczNC00NGRhLTllN2QtMzU2N2NkZDI3OTc2XkEyXkFqcGdeQXVyMjc3Njc5NDQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0034492","name":"Carmen Argenziano","idIMDB":"nm0034492"},"actorId":"nm0034492","character":"Lieutenant Grimes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Julianna McCarthy","urlProfile":"http://www.imdb.com/name/nm0565197","urlPhoto":"","biography":{"dateOfBirth":"17 August 1929","placeOfBirth":" Erie, Pennsylvania, USA","bio":"Julianna McCarthy was born on August 17, 1929 in Erie, Pennsylvania, USA. She is an actress, known for Starship Troopers (1997), Fantômes contre fantômes (1996) and Bundy (2002). She was previously married to Michael Constantine.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0565197","name":"Julianna McCarthy","idIMDB":"nm0565197"},"actorId":"nm0565197","character":"Grandmother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nada Despotovich","urlProfile":"http://www.imdb.com/name/nm0221631","urlPhoto":"","biography":{"dateOfBirth":"24 April 1967","placeOfBirth":" New York City, New York, USA","height":"5' 5\" (1.65 m)","bio":"Nada Despotovich was born on April 24, 1967 in New York City, New York, USA. She is an actress, known for Jerry Maguire (1996), Moonstruck (1987) and Jingle All the Way (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0221631","name":"Nada Despotovich","idIMDB":"nm0221631"},"actorId":"nm0221631","character":"Bag Lady","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sue Giosa","urlProfile":"http://www.imdb.com/name/nm0320448","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDY1NWU5OTctZThkNS00N2VkLThiOTUtNDJjZTBiNmMzYThiXkEyXkFqcGdeQXVyNjU1MjEwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 November 1953","placeOfBirth":" Connecticut, USA","height":"5' 8\" (1.73 m)","bio":"Susan Giosa is an award-winning stage actress. Originally working under the name Sue Giosa, she has been billed as Susan Giosa since 1992. A native New Yorker, Susan is married to comedian, Glenn Hirsch and has a daughter, Zoe. She is also a highly respected acting teacher and coach in Los Angeles who trained extensively with renowned acting teacher, Larry Moss.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDY1NWU5OTctZThkNS00N2VkLThiOTUtNDJjZTBiNmMzYThiXkEyXkFqcGdeQXVyNjU1MjEwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0320448","name":"Sue Giosa","idIMDB":"nm0320448"},"actorId":"nm0320448","character":"Carmen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clayton Landey","urlProfile":"http://www.imdb.com/name/nm0484707","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MzcxODA0NV5BMl5BanBnXkFtZTgwMzMyNjA2MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"After 40 plays, 40 films, 180 TV episodes, and 85 commercials Clayton stopped counting. He has been a professional performer, actor, director, producer, writer and teacher for over 40 years. Recent film credits include Sully, Camera Store and A Sunday Horse. On Television he starred as Roger Barrow in the first season of 1st and Ten, the first scripted half hour comedy original series on HBO. He has had recurring roles in ten other TV series including 3 seasons as attorney James Westmont on Knots Landing and 1 year as the evil Gregory on Days of Our Lives. Other shows with multiple episodes include: Dynasty, Walker, Texas Ranger, Without a Trace, and Stargate: Atlantis and most recently If Loving You Is Wrong. As well as starring in the pilot for Used Cars and Guest Starring in the pilot SNOOPS his favorite Guest Starring roles include Becker, Designing Women, Star Trek: Deep Space Nine and JAG. Known to jokingly say his film career goes from A-Z (Assault of The Killer Bimbos to Zombie Strippers) his over 40 films and movies for television include favorites Norma Rae, Fatal Beauty, Pump Up the Volume and The Cisco Kid. His work has been represented at the Cannes (She's So Lovely) , Sundance (Shadow Hours) and Venice (The Reluctant Fundamentalist) Film Festivals. Norma Rae, Clayton's first feature, was named in 2011 to The Library of Congress National Film Registry. It is, however, (sad but) true that more people have probably seen him get sucked down the drain in The Blob than in any other role. He has appeared in over 40 theatrical productions in New York, Los Angeles, Atlanta and Dallas. He received a Drama-Logue Award, an LA Weekly Award, a Maddy, a Garland Award and a Los Angeles Drama Critics Circle nomination for his performance as Luther Adler in the critically acclaimed production of Names at the Matrix Theater in Los Angeles. He recreated the role the following season in the Off-Broadway production. He also received a Drama-Logue for producing the multi-award winning Andrea's Got Two Boyfriends. His training includes a BA in Drama from the University of Houston and Masters classes with Stella Adler, Marlon Brando and Darryl Hickman. He teaches Scene Study For The Working Actor at the Alliance Theater and Get The F**k Out of Your Head at The Rob Mello Studio. Clayton is Chair of The Muriel Moore/Danny Nelson SAG-AFTRA Conservatory. He served two terms on the Atlanta Local SAG-AFTRA Board, one as Secretary. Clayton is proud to be the voice of the Kennesaw State University Marching Owls in NCAA Division I football. He is happily married to World Ranked and record holding Masters Swimmer Leslie Landey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MzcxODA0NV5BMl5BanBnXkFtZTgwMzMyNjA2MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0484707","name":"Clayton Landey","idIMDB":"nm0484707"},"actorId":"nm0484707","character":"Mazza","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hansford Rowe","urlProfile":"http://www.imdb.com/name/nm0746525","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4ODcwOTg3NF5BMl5BanBnXkFtZTYwMzI5MDEz._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1924","placeOfBirth":" Richmond, Virginia, USA","bio":"Hansford Rowe was born on May 12, 1924 in Richmond, Virginia, USA. He is an actor, known for Another World (1964), Dante's Peak (1997) and Three Days of the Condor (1975).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4ODcwOTg3NF5BMl5BanBnXkFtZTYwMzI5MDEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0746525","name":"Hansford Rowe","idIMDB":"nm0746525"},"actorId":"nm0746525","character":"Father Brian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Philip Abbott","urlProfile":"http://www.imdb.com/name/nm0008041","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4Nzg2ODA2Ml5BMl5BanBnXkFtZTgwNjM4NTM2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 March 1924","placeOfBirth":" Lincoln, Nebraska, USA","birthName":"Philip Abbott Alexander","height":"5' 10\" (1.78 m)","bio":"Phillip Abbott was born March 21, 1924 in Lincoln Nebraska, USA as Phillip Abbott Alexander. He was an actor and director known for The F.B.I. (1965), General Hospital (1963)and Sweet Bird of Youth (1962). He was married only once to Jane Dufrayne. They had two sons and a daughter. He died on February 23, 1998 (age 73) in Tarzana, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4Nzg2ODA2Ml5BMl5BanBnXkFtZTgwNjM4NTM2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0008041","name":"Philip Abbott","idIMDB":"nm0008041"},"actorId":"nm0008041","character":"Cardinal","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Gale","urlProfile":"http://www.imdb.com/name/nm0301834","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkyNDAzMTAtZmI2Zi00MGIyLTg2OWItY2I5NThjZThkNDgwXkEyXkFqcGdeQXVyNTAyNDQ2NjI@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 October 1936","placeOfBirth":" Wimbledon, England, UK","birthName":"David Quentin Gale","height":"6' 1½\" (1.87 m)","bio":"Tall, thin and distinguished character actor David Quentin Gale was born on October 2, 1936 in Wimbledon, England. Gale began his acting career on the New York stage in the late 50s. He first started acting in both movies and television in the early 70s. With his gaunt face, lean build, and intense and imposing screen presence, David was usually cast as extremely wicked and hateful villains. Gale achieved his greatest enduring cult cinema popularity with his marvelously robust and inspired portrayal of the icy, ruthless, and arrogant mad scientist Dr. Carl Hill in Stuart Gordon's terrific horror splatter gem \"Re-Animator.\" He reprised this part in the enjoyable sequel \"Bride of Re-Animator.\" David's other memorable roles include demented pop psychologist TV show host Dr. Anthony Blakely in \"The Brain;\" at his deliriously wired and wacky best as batty CEO Carter Brown in \"Syngenor,\" and evil corporate head Fulton Balcus in \"The Guyver.\" Gale had recurring parts on the TV shows \"The Secret Storm,\" \"The Edge of Night,\" \"One Life to Live,\" and \"Search for Tomorrow.\" Among the TV series he made guest appearances on episodes of are \"Kojak,\" \"Ryan's Hope,\" \"Hart to Hart,\" \"The Dukes of Hazzard,\" \"Tales from the Darkside,\" \"L.A. Law,\" \"Dallas,\" and \"Knots Landing.\" Moreover, David also had a lengthy and impressive stage career: He not only acted in Broadway stage productions of the classic plays \"Of Mice and Men\" and \"Sweet Bird of Youth,\" but also acted in Off-Broadway stage productions of such plays as \"Elizabeth the Queen,\" \"Joe Egg,\" \"The Trial,\" \"Orpheus Descending,\" and \"Anthony and Cleopatra.\" Gale was married and had a son. David died of complications from open heart surgery on August 18, 1991 in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkyNDAzMTAtZmI2Zi00MGIyLTg2OWItY2I5NThjZThkNDgwXkEyXkFqcGdeQXVyNTAyNDQ2NjI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0301834","name":"David Gale","idIMDB":"nm0301834"},"actorId":"nm0301834","character":"Monsignor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"J. Patrick McNamara","urlProfile":"http://www.imdb.com/name/nm0573688","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMjg4MTcyOF5BMl5BanBnXkFtZTcwNjgxNjI2OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"J. Patrick McNamara is an actor, known for Close Encounters of the Third Kind (1977), Bill & Ted's Excellent Adventure (1989) and Blow Out (1981).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMjg4MTcyOF5BMl5BanBnXkFtZTcwNjgxNjI2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0573688","name":"J. Patrick McNamara","idIMDB":"nm0573688"},"actorId":"nm0573688","character":"Priest","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0099578","urlIMDB":"http://www.imdb.com/title/tt0099578","business":{"budget":{"money":"$10,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1989/\">1989</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 38 min (98 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Camera and Lenses"],"laboratory":["DeLuxe, USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.7","filmingLocations":[{"location":"912 East 3rd Street, Los Angeles, California, USA"}],"rated":"R","awards":[],"votes":"2,758","type":"Movie","companyCreditsSimple":[{"idCompany":"co0031772","name":"Interscope Communications"},{"idCompany":"co0020346","name":"Nelson Entertainment"}],"keywords":{"keywords":["detective","teleportation","resurrection","female psychic","police detective","possession","serial killer","psychic","police","murder","gas chamber","good versus evil","psycho killer","satanist","dagger","ambiguous ending","demonic possession","car crash","jumping from height","knife","crashing through a window","cat","supernatural power","murder of a policewoman","fight","homicide investigation","blood","mass murderer","human monster","bloody violence","violence","knife murder","axe murderer","nightmare","axe murder","psycho thriller","terror","rampage","police officer killed","killing spree","villain","maniac","murderer","psychopathic killer","demon","psychopath","evil man","dead woman on ground","dead woman with eyes open","dead policewoman","naked dead woman","nude woman murdered","off screen murder","pentagram","immortality","revolver","priest","policeman","police officer","pistol","nun","monsignor","los angeles california","lieutenant","handgun","commander","catholic","catholicism","catholic priest","cardinal the priest","antichrist","death row","satanism","evil spirit","independent film","title spoken by character","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:38:05"}}