{"data":{"movies":[{"title":"Poltergeist II: The Other Side","originalTitle":"","year":"1986","releaseDate":"19860523","directors":[{"name":"Brian Gibson","id":"nm0001270"}],"writers":[{"name":"Mark Victor","id":"nm0896131"},{"name":"Michael Grais","id":"nm0334457"}],"runtime":"91 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDYwODU0MTgxNl5BMl5BanBnXkFtZTcwMzkzODM1NA@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror"],"plot":"The Freeling family move in with Diane's mother in an effort to escape the trauma and aftermath of Carol Anne's abduction by the Beast. But the Beast is not to be put off so easily and appears in a ghostly apparition as the Reverend Kane, a religeous zealot responsible for the deaths of his many followers. His goal is simple - he wants the angelic Carol Anne; but the love of her family and the power of psychic Tangina once again unite, along with an elderly native American, to fight for her life.","simplePlot":"The Freeling family have a new house, but their troubles with supernatural forces don't seem to be over.","actors":[{"actorName":"JoBeth Williams","urlProfile":"http://www.imdb.com/name/nm0001851","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NTk2MzQ3OF5BMl5BanBnXkFtZTcwNjcxNzM0Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 December 1948","placeOfBirth":" Houston, Texas, USA","birthName":"Margaret JoBeth Williams","height":"5' 8\" (1.73 m)","bio":"The product of a musical family, Margaret JoBeth Williams was born in Houston, Texas, to Frances Faye (Adams), a dietitian, and Fredric Roger Williams, a wire/cable company manager and opera singer. Her father encouraged her early interest in theater during high school. She made her professional debut at age 18 in a Houston-based musical production, then studied at Brown University in Providence, Rhode Island, with the intentions of becoming a child psychologist. The acting bug hit her again, however, and she decided to pursue theater after receiving her B.A. in English in 1970. Working intensely to lose her Texas twang, her early training came as a member of the Trinity Repertory Company, where she stayed for two-and-a-half years. In New York the lovely Jobeth became a daytime regular in the mid-1970s on both Somerset (1970) and in a vixenish role on Guiding Light (1952) before making a brief but memorable impact in a highly popular film at the end of the decade. In the Dustin Hoffman starring film Kramer vs. Kramer (1979), Jobeth plays Hoffman's gorgeous sleepover who gets caught stark naked by his young, precocious son (Justin Henry) the following morning. She also impressed on the stage with major roles in \"Moonchildren\" and \"A Coupla White Chicks Sitting Around Talking.\" Her star maker would could in the form of the strong-willed mother of three who fights to save her brood from home-invading demons in Steven Spielberg's humongous critical and box-office hit Poltergeist (1982), which also made a major star out of movie husband Craig T. Nelson. Officially in the big leagues now, she joined the star ensemble cast of The Big Chill (1983), and appeared opposite Nick Nolte in Teachers (1984). Disappointing outcomes in the lackluster sequel Poltergeist II: The Other Side (1986) and the intriguing but overlooked American Dreamer (1984) prodded her to search for more challenging work on TV. It is the small screen, in fact, that has particularly shown off the range of Jobeth's talent over the years, particularly in domestic drama. Cast in some of the finest TV-movies served up, Jobeth won deserved Emmy nominations for her real-life mother of an ill-fated missing child in Adam (1983) and real-life surrogate mother in Baby M (1988). Other monumental mini-movie efforts include her nurse in the apocalyptic drama The Day After (1983); her magnetic performance opposite Terry Kinney as an adulterous worshiper and minister who carry out plans to kill their respective spouses in the gripping suspense show Murder Ordained (1987); alcoholic James Woods' long-suffering wife in My Name Is Bill W. (1989); a social worker trying to reach a deaf girl in Breaking Through (1996); and the overbearing mother whose son turns to drugs in Trapped in a Purple Haze (2000). She continues to balance both film and TV projects into the millennium. Behind the scenes she was nominated for an Academy Award for her directorial debut of Showtime's On Hope (1994)and continues to seek out other directing projects. It doesn't hurt being married to a director for encouragement. She and John Pasquin, who directed her in the film Jungle 2 Jungle (1997) and on the short-lived TV series Payne (1999), have two children. More recent film roles include playing Drew Barrymore's mom in Fever Pitch (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NTk2MzQ3OF5BMl5BanBnXkFtZTcwNjcxNzM0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001851","name":"JoBeth Williams","idIMDB":"nm0001851"},"actorId":"nm0001851","character":"Diane Freeling","urlCharacter":"http://www.imdb.com/character/ch0010402","main":true},{"actorName":"Craig T. Nelson","urlProfile":"http://www.imdb.com/name/nm0005266","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0ODQwMDU1OV5BMl5BanBnXkFtZTcwMDkxNTE2Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1944","placeOfBirth":" Spokane, Washington, USA","birthName":"Craig Theodore Nelson","height":"6' 3½\" (1.92 m)","bio":"Craig T. Nelson was born on April 4, 1944 in Spokane, Washington, USA as Craig Theodore Nelson. He is an actor and producer, known for The Incredibles (2004), Coach (1989) and Poltergeist (1982). He has been married to Doria Cook-Nelson since 1987. He was previously married to Robin McCarthy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0ODQwMDU1OV5BMl5BanBnXkFtZTcwMDkxNTE2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005266","name":"Craig T. Nelson","nicknames":["Fish","Coach"],"idIMDB":"nm0005266"},"actorId":"nm0005266","character":"Steve Freeling","urlCharacter":"http://www.imdb.com/character/ch0010400","main":true},{"actorName":"Heather O'Rourke","urlProfile":"http://www.imdb.com/name/nm0001576","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU3Mzc3MjMyNl5BMl5BanBnXkFtZTcwOTkwOTkxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 December 1975","placeOfBirth":" San Diego, California, USA","birthName":"Heather Michele O'Rourke","height":"4' 8\" (1.42 m)","bio":"Heather Michele O'Rourke was born on December 27, 1975 in Santee, San Diego, California, to Kathleen, a seamstress, and Michael O'Rourke, a construction worker. She had German, Danish, English, and Irish ancestry. Heather entered American cinematic pop-culture before first grade. She was sitting alone in the MGM Commissary waiting for her mother when a stranger approached her asking her name. \"My name is Heather O'Rourke,\" she said. \"But you're a stranger, and I can't talk to you\". When her mother returned, the stranger introduced himself as Steven Spielberg. She failed her first audition when she laughed at a stuffed animal Spielberg presented her with. He thought she was just too young (she had just turned five), and he was actually looking for a girl at least 6 years old, but he saw something in her and asked her to come in a second time with a scary story book. He asked her to scream a lot. She screamed until she broke down in tears. The next day at the commissary, Spielberg told her and her family, \"I don't know what it is about her, but she's got the job.\" She instantly became a star overnight and was easily recognized at her favorite theme park, Disneyland, and everywhere in California. In the years that followed, Heather was a familiar face on TV in Happy Days (1974) (1982-1983), Webster (1983) (1983-1984), and The New Leave It to Beaver (1983) (1986-1987), three shows in which she had recurring roles. In 1986, the highly anticipated sequel to her first movie, Poltergeist (1982), Poltergeist II: The Other Side (1986) debuted in theaters; it was her riveting performance in this film that cemented her a place in Hollywood history. In January 1987, Heather began to have flu-like symptoms and her legs and feet swelled. She was taken to Kaiser Hospital, and they confirmed it was only the flu, but when symptoms continued, they diagnosed her as having Crohn's Disease, a chronic inflammation of the intestine. She was on medication throughout the filming of her next project, Poltergeist III (1988), and her cheeks were puffy in some scenes. She never complained during filming and did not appear sick to fellow cast members. When filming was completed in June, Heather and her family went on a road trip from Chicago, to New Orleans, to Orlando and all the way back to Lakeside where they lived at the time. Heather was well until January 31, 1988, Super Bowl Sunday. She was unable to keep anything in her stomach and crawled into bed with her parents that night, saying that she didn't feel well. The next morning, February 1, sitting at the breakfast table, she couldn't swallow her toast or Gatorade. Her mother noticed her fingers were blue and her hands were cold. Kathleen called the doctor's and was getting ready to put her clothes on when Heather fainted on the kitchen floor. When the paramedics came in, Heather insisted that she was \"really okay\" and was worried about missing school that day. In the ambulance, Heather suffered cardiac arrest and died on the operating table at 2:43 p.m. at the tender age of 12. Of all her achievements, Heather was proudest of being elected student body president of her 5th grade class in 1985.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU3Mzc3MjMyNl5BMl5BanBnXkFtZTcwOTkwOTkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001576","name":"Heather O'Rourke","nicknames":["Bernie","Heath"],"idIMDB":"nm0001576"},"actorId":"nm0001576","character":"Carol Anne Freeling","urlCharacter":"http://www.imdb.com/character/ch0010401","main":true},{"actorName":"Oliver Robins","urlProfile":"http://www.imdb.com/name/nm0732319","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNDA0OTU5Nl5BMl5BanBnXkFtZTcwMzI5MDAxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1971","placeOfBirth":"","height":"5' 9\" (1.75 m)","bio":"Oliver began his career in the film industry at the age of ten, starring in Steven Spielberg's \"Poltergeist.\" After acting in various film and television roles, he moved behind the camera. At the age of fifteen, he wrote, directed and produced The Crystal, which won first prize at the French \"Les Mesnil-le-Roi\" Film Festival. Upon graduating from the University of Southern California Film School's Production Program, he wrote, directed and produced close to fifty industrial, short and feature films. His feature teen comedies, \"Dumped\" and \"Wild Roomies,\" both were released to DVD internationally in all world markets. Additionally, the Hallmark Channel recently produced Oliver's screenplay \"You've Got A Friend,\" which aired to the best ratings ever for a June original movie premiere in the history of the network. Oliver will also direct Treasure Entertainment's \"Prom Date,\" another teen comedy scheduled to go into production in mid 2010.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNDA0OTU5Nl5BMl5BanBnXkFtZTcwMzI5MDAxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0732319","name":"Oliver Robins","idIMDB":"nm0732319"},"actorId":"nm0732319","character":"Robbie Freeling","urlCharacter":"http://www.imdb.com/character/ch0010407","main":true},{"actorName":"Zelda Rubinstein","urlProfile":"http://www.imdb.com/name/nm0748289","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MzQwNjY3NV5BMl5BanBnXkFtZTcwMjA4MjUxMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 May 1933","placeOfBirth":" Pittsburgh, Pennsylvania, USA","height":"4' 3\" (1.3 m)","bio":"A marvelously quirky and distinctive 4' 3\" character actress, with a larger-than-life presence on film and TV, Zelda Rubinstein gave up a long and stable career in the medical field as a lab technician in order to strive for something more self-fulfilling as middle age settled in. At the age of 45, the feisty lady gave up the comfort of a stable paycheck and attempt an acting career, a daunting task for anyone but especially someone of her stature and type. Within a few years, she had beaten the odds and became a major movie celebrity thanks to one terrific showcase in a Steven Spielberg horror classic. In the process, she served as an inspiration to all the \"little people\" working in Hollywood who are forced to toil in cruel and demeaning stereotypes. Zelda May Rubinstein was born on May 28, 1933 in Pittsburgh, Pennsylvania, to Dolores and George Rubinstein, who were Polish Jewish immigrants. Zelda was the youngest of three children, and the only \"little person\" in the family. Her childhood and teenage years were decidedly difficult in terms of coping with her \"interesting variation,\" which was caused by a pituitary gland deficiency. With no designs on acting at the time, she went the normal route of college and received a scholarship to study at the University of Pittsburgh. She earned her degree in bacteriology and worked for a number of years as a lab technician in blood banks. In 1978, Zelda, in a pursuit of something more creative in her life, abandoned her cushy but mundane job and threw herself completely into acting. She made her movie debut as one of the little people in the Chevy Chase slapstick comedy Under the Rainbow (1981). It all came together so quickly with her second film Poltergeist (1982) in the scene-stealing role of Tangina, the saucy, self-confident, prune-faced \"house cleaner\" with the whispery, doll-like voice who is brought in to rid a suburban home of demonic possession. Co-writer/producer Spielberg claims he designed the psychic role specifically for a \"little person\". The film became an instant summertime hit and Zelda created absolute magic and wonderment with the testy role, receiving some of the movie's best reviews. The character actress went on to appear in the two \"Poltergeist\" sequels. The \"Poltergeist\" movie projects were eventually dubbed \"cursed\" due to the untimely deaths of some of its performers, particularly two of the three children of film parents Craig T. Nelson and JoBeth Williams. 22-year-old Dominique Dunne was slain in 1982 by a jealous ex-boyfriend only a few months after the first film's release, and angelic little Heather O'Rourke, age 12, died of an intestinal obstruction just months before Poltergeist III (1988) made it to the screen. Although Zelda would not find a role quite up to the standards and popularity of Tangina, her subsequent career remained surprisingly active with a number of weird parts woven into both comedies and chillers -- often variations of her eccentric Tangina role. She played a mental patient in the Frances Farmer biopic Frances (1982), which showcased Jessica Lange in the Oscar-nominated title role; a squeaky-shoed organist in John Hughes sweet-sixteen comedy classic Sixteen Candles (1984) co-starring \"Brat Pack\"ers Molly Ringwald and Anthony Michael Hall; the demented mom in the gruesome, Spanish-made horror-thriller Anguish (1987) [aka Anguish], which has since reached cult status; a mentor witch in the comic fantasy Teen Witch (1989); a hermit in a National Lampoon-based slapstick Last Resort (1994); a betting clerk in the sci-fi adventure Timemaster (1995); an ill-fated nun in the thriller Little Witches (1996), and; a theatre director in the flick Critics and Other Freaks (1997). Into the millennium, she made some odd, slapdash appearances in such minor fare as Maria & Jose (2000), Wishcraft (2002), Cages (2005)_, Angels with Angles (2005), Unbeatable Harold (2006) and Southland Tales (2006). In her last film, she furthered her horror icon status with a small cameo in the slim-budgeted indie Behind the Mask: The Rise of Leslie Vernon (2006) that also featured Robert Englund of \"Freddy Krueger\" fame. Zelda also found an \"in\" doing voiceovers, her doll-like tones ideal for cartoons and such, and in commercials promoting such items as Skittles candy. She enjoyed extended popularity on TV with a regular series role on the first couple of seasons of Picket Fences (1992). Her character later was killed off in a freakish accident (fell into a freezer!). In her last years she narrated, and \"Exorcist\" child star Linda Blair hosted, TV's Scariest Places on Earth (2000). The actress also appeared on stage in such productions as \"Deathtrap\" (as a psychic, of course), \"To Kill a Mockingbird,\" \"Suddenly, Last Summer,\" \"The Slab Boys\" and \"Black Comedy\". She also appeared as Yente in a production of \"Fiddler on the Roof\". An outspoken social activist, Zelda was a staunch advocate for the rights of little people who formed the nonprofit Michael Dunn Memorial Repertory Theater Company in Los Angeles in 1985. The actress gained additional attention and respect, if not popularity (her career suffered for a time as a result), as an early and outspoken HIV/AIDS activist. As the poster mom for AIDS awareness, she valiantly appeared in a series of maternal newspaper/billboard advertisements imploring her gay son to practice safe sex. The series of ads ran from the mid-to-late 1980s. Zelda also participated in the first AIDS Project Los Angeles AIDS Walk and attended the 25th Anniversary Walk on October 12, 2009. A couple of months before her death on January 27, 2010, Zelda suffered a heart attack. Complications set in (kidney and lung failure) and she passed away at age 76 on January 27, 2010, at Barlow Respiratory Hospital in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MzQwNjY3NV5BMl5BanBnXkFtZTcwMjA4MjUxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0748289","name":"Zelda Rubinstein","idIMDB":"nm0748289"},"actorId":"nm0748289","character":"Tangina Barrons","urlCharacter":"http://www.imdb.com/character/ch0010404","main":true},{"actorName":"Will Sampson","urlProfile":"http://www.imdb.com/name/nm0760225","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMzA4NjcyMl5BMl5BanBnXkFtZTcwMTAyNTUyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 September 1933","placeOfBirth":" Okmulgee, Oklahoma, USA","height":"6' 7\" (2.01 m)","bio":"A Native American actor of the Creek Nation, Sampson's \"big break\" came from his memorable role in One Flew Over the Cuckoo's Nest (1975) opposite Jack Nicholson. He was also starred opposite Clint Eastwood in the western The Outlaw Josey Wales (1976). He had supporting roles in Orca (1977), The White Buffalo (1977) and Fish Hawk (1979). In 1986, he co-starred in Poltergeist II: The Other Side (1986) as a Native American shaman. He died of complications from kidney failure and malnutrition during heart and lung replacement surgery in 1987 and was buried on the reservation where he grew up.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMzA4NjcyMl5BMl5BanBnXkFtZTcwMTAyNTUyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0760225","name":"Will Sampson","idIMDB":"nm0760225"},"actorId":"nm0760225","character":"Taylor","urlCharacter":"http://www.imdb.com/character/ch0162231","main":true},{"actorName":"Julian Beck","urlProfile":"http://www.imdb.com/name/nm0065191","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzE0NTU0ODU5N15BMl5BanBnXkFtZTcwNzgwMDU2NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1925","placeOfBirth":" New York City, New York, USA","height":"5' 10½\" (1.79 m)","bio":"A bold, innovative, avant-garde figure in theatre who helped revolutionized the style of playwriting and acting in the 1950s and 1960s, actor/writer/producer/directer Julian Beck was certainly a odd-looking sort with his baleful, hollow eyes, stark and skullish features and near-bald dome capped by long fringes of stringy hair along the side. He could have easily given inspiration to the creepy look Richard O'Brien gave his bizarre character in \"The Rocky Horror Show.\" Born in the Washington Heights section of Manhattan in New York City, Julian was the son of Irving, a businessman, and Mabel Lucille (Blum) Beck. Educated at the College of the City of New York, he briefly attended Yale University, but then abandoned it to pursue writing and art. An abstract expressionist painter in the 1940s, his life's destiny was forever changed after meeting his future wife, actress/writer/director Judith Malina, in 1943. His passions swiftly centered around the likes of hers -- the theatre -- and together they co-founded The Living Theatre in 1947, which would base itself in New York City. Their subsequent contributions propelled the off-off-Broadway movement and the vision of performance art. Julian would continue to work with the Living Theater up until his death nearly forty years later. The group strongly reflected the ideals of another theatre revolutionary, Antonin Artaud (1896-1948), who embraced the Theatre of Cruelty and sought to jar its audiences out of their own complacency. The plays were presented in various venues, chiefly in the couple's own home when it couldn't financial keep up a theatre space. The Living Theatre also spread its philosophy throughout the world, performing extensively in non-traditional places such as street corners and prisons. In one performance piece, from Jack Gelbert's \"The Connection,\" the drama about drug addiction had its actors playing junkies and wandering about the audience shouting expletives while demanding money for a fix. They were among the first to import the plays of Bertolt Brecht and Jean Cocteau, as well as modernist poets such as T.S. Eliot and Gertrude Stein. Their productions could be undeniably repelling or imaginative and often involved collective improvisation. It took on an anarcho-pacifist point of view while celebrating the uninhibited use of drugs, hallucinogens, crude language and anything else under the kitchen sink in order to send home its political intent or shock effect. One of their their most controversial works was \"Paradise Now\" (1968), a free-form denouncement of American life that involved nudity and audience participation. Other productions include \"The Brig\" (1963), \"In the Jungle of the Cities\" (1960), The Brig (1963), \"Frankenstein\" (1968) and Antigone (1968). Their work often led to their frequent arrests for anything from indecent exposure to drug possession. The Living Theater moved out of New York for a time in 1974 due to tax problems and a sensationalistic trial that Beck and Malina lost. Besides his theatre work, Beck published several volumes of poetry reflecting his left-wing, anarchist beliefs, two non-fiction books and a handful of experimental and mainstream films. His intense, imposing acting style was captured vividly in films, such as his sadistic gangster in The Cotton Club (1984) and his creepy, spectral stranger in Poltergeist II: The Other Side (1986), a rare major role that ended up becoming his final movie. Diagnosed with stomach cancer in 1983, he died at Mount Sinai Hospital in New York City while filming the afore-mentioned movie at the age of 60 on September 14, 1985. He was survived by his wife, a brother, and two children, Garrick and Isha.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzE0NTU0ODU5N15BMl5BanBnXkFtZTcwNzgwMDU2NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0065191","name":"Julian Beck","idIMDB":"nm0065191"},"actorId":"nm0065191","character":"Kane","urlCharacter":"http://www.imdb.com/character/ch0062196","main":true},{"actorName":"Geraldine Fitzgerald","urlProfile":"http://www.imdb.com/name/nm0280242","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzNDIyODU1M15BMl5BanBnXkFtZTcwMTUyNzAzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 November 1913","placeOfBirth":" Greystones, County Wicklow, Ireland","birthName":"Geraldine Mary Fitzgerald","height":"5' 3\" (1.6 m)","bio":"Geraldine Fitzgerald was the only actress to appear as both Laurence Olivier's wife and Rodney Dangerfield's mother-in-law, which surely qualifies her as running the gamut (if not the gauntlet, in the latter case) of A to Z for co-starring with cinema immortals. The Irish lass appeared in many masterpieces of Hollywood's Golden Age, including Wuthering Heights (1939) and Dark Victory (1939), to say nothing of her late-career screen work in the blue-collar white-trash classic, Easy Money (1983). She was born in Dublin, Ireland, on November 24, 1913, and made her theatrical debut at her hometown's Gate Theater in 1932. She appeared in English films from 1934 to 1937 before emigrating to New York City, where she acted with Orson Welles (who had appeared at the Gate when he was all of 16 years old as a protégé of Micheál MacLiammóir). In 1938 she made her Broadway debut with Welles' Mercury Theater in their production of George Bernard Shaw's \"Heartbreak House,\" but her connection with Welles was sundered when she was signed by a Warner Bros. talent scout and decamped to Hollywood. Her first American film turned out to be a masterpiece. Her portrayal of Isabella, the wife of Olivier's Heathcliff in William Wyler's \"Wuthering Heights\" brought her a Best Supporting Actress Oscar nomination in her very first role in Tinseltown. She followed that up with a supporting turn in the Bette Davis three-hankie tearjerker \"Dark Victory.\" Other major films she appeared in at Warner Bros. were Shining Victory (1941), The Gay Sisters (1942) and Watch on the Rhine (1943), but her career was stymied by a rebellious streak. Like Warner Bros. divas Davis and Olivia de Havilland, Fitzgerald refused roles she disliked and was put on suspension by the studio. Unlike Davis and de Havilland, however, she never won an Oscar, nor did she ever become a star. She matured into a character actress, appearing in a wide variety of quality movies, including Ten North Frederick (1958), The Pawnbroker (1964), Rachel, Rachel (1968) and Harry and Tonto (1974). In later years she appeared in several hit comedies, among them Arthur (1981). Fitzgerald appeared on Broadway and off-Broadway in many plays, including revivals of the works of Irish-American playwright Eugene O'Neill (I)'; she was Mary Tyrone in a 1971 off-Broadway production of \"Long Day's Journey into Night\" opposite Robert Ryan and was in the 1977 Broadway revival of \"A Touch of the Poet\" with Jason Robards. She also appeared earlier that year on Broadway in the Pulitzer Prize- and Tony Award-winning play \"The Shadow Box.\" The previous year she had performed in her own cabaret act for a one-week engagement on Broadway, which she then revived in New York nightclubs as \"Streetsongs.\" In addition to singing, she would reminisce about her life. Later, she received Tony Award and Drama Desk nominations for directing \"Mass Appeal,\" a play about Catholic priests. Geraldine Fitzgerald died in New York City on July 19, 2005, of complications from Alzheimer's disease. She was 91 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzNDIyODU1M15BMl5BanBnXkFtZTcwMTUyNzAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0280242","name":"Geraldine Fitzgerald","idIMDB":"nm0280242"},"actorId":"nm0280242","character":"Gramma-Jess","urlCharacter":"http://www.imdb.com/character/ch0162230","main":true},{"actorName":"John P. Whitecloud","urlProfile":"http://www.imdb.com/name/nm0925638","urlPhoto":"","biography":{"bio":"John P. Whitecloud is an actor, known for Poltergeist II: The Other Side (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0925638","name":"John P. Whitecloud","idIMDB":"nm0925638"},"actorId":"nm0925638","character":"Old Indian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Noble Craig","urlProfile":"http://www.imdb.com/name/nm0185971","urlPhoto":"","biography":{"bio":"Noble Craig is an actor, known for Big Trouble in Little China (1986), Poltergeist II: The Other Side (1986) and A Nightmare on Elm Street 5: The Dream Child (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0185971","name":"Noble Craig","idIMDB":"nm0185971"},"actorId":"nm0185971","character":"Vomit Creature","urlCharacter":"http://www.imdb.com/character/ch0162233","main":true},{"actorName":"Susan Peretz","urlProfile":"http://www.imdb.com/name/nm0673403","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NzQ3MDA2OV5BMl5BanBnXkFtZTcwNTk1NTYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 March 1940","placeOfBirth":" New York City, New York, USA","bio":"Susan Peretz was born on March 2, 1940 in New York City, New York, USA. She was an actress, known for Dog Day Afternoon (1975), Poltergeist II: The Other Side (1986) and Babes (1990). She died on August 27, 2004 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NzQ3MDA2OV5BMl5BanBnXkFtZTcwNTk1NTYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0673403","name":"Susan Peretz","idIMDB":"nm0673403"},"actorId":"nm0673403","character":"Daughter","urlCharacter":"http://www.imdb.com/character/ch0162234","main":true},{"actorName":"Helen Boll","urlProfile":"http://www.imdb.com/name/nm0093043","urlPhoto":"","biography":{"dateOfBirth":"11 March 1929","placeOfBirth":" Kitchener, Ontario, Canada","birthName":"Helen Mary Boll","bio":"Helen Boll was born on March 11, 1929 in Kitchener, Ontario, Canada as Helen Mary Boll. She was an actress, known for Dumb & Dumber (1994), Poltergeist II: The Other Side (1986) and Frankenweenie (1984). She died on January 3, 1995 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0093043","name":"Helen Boll","idIMDB":"nm0093043"},"actorId":"nm0093043","character":"Mother","urlCharacter":"http://www.imdb.com/character/ch0162235","main":true},{"actorName":"Kelly Jean Peters","urlProfile":"http://www.imdb.com/name/nm0676541","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NzQ5ODkxNl5BMl5BanBnXkFtZTcwMDQ1NjUzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 July 1940","placeOfBirth":" Columbus, Ohio, USA","bio":"Kelly Jean Peters was born on July 2, 1940 in Columbus, Ohio, USA. She is an actress, known for Little Big Man (1970), Poltergeist II: The Other Side (1986) and The Bachelor (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NzQ5ODkxNl5BMl5BanBnXkFtZTcwMDQ1NjUzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0676541","name":"Kelly Jean Peters","idIMDB":"nm0676541"},"actorId":"nm0676541","character":"Young Jess","urlCharacter":"http://www.imdb.com/character/ch0162230","main":true},{"actorName":"Jaclyn Bernstein","urlProfile":"http://www.imdb.com/name/nm0077064","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWNjYjViZGQtODZmNy00ZmQyLWIyZWMtYjBiNWZlMjY1MDdiXkEyXkFqcGdeQXVyMjc3MTk2NTk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 August 1978","placeOfBirth":" Los Angeles, California, USA","birthName":"Jaclyn Rose Bernstein","height":"5' 3\" (1.6 m)","bio":"Jaclyn Bernstein was born on August 15, 1978 in Los Angeles, California, USA as Jaclyn Rose Bernstein. She is known for her work on The Golden Girls (1985), Family Ties (1982) and Dumb & Dumber (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWNjYjViZGQtODZmNy00ZmQyLWIyZWMtYjBiNWZlMjY1MDdiXkEyXkFqcGdeQXVyMjc3MTk2NTk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0077064","name":"Jaclyn Bernstein","nicknames":["Jackie"],"idIMDB":"nm0077064"},"actorId":"nm0077064","character":"Young Diane","urlCharacter":"http://www.imdb.com/character/ch0010402","main":true},{"actorName":"Robert Lesser","urlProfile":"http://www.imdb.com/name/nm0504342","urlPhoto":"","biography":{"dateOfBirth":"22 October 1942","placeOfBirth":" New York City, New York, USA","bio":"Robert Lesser was born on October 22, 1942 in New York City, New York, USA. He is known for his work on Die Hard (1988), Godzilla (1998) and End of Days (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0504342","name":"Robert Lesser","idIMDB":"nm0504342"},"actorId":"nm0504342","character":"Kane's People","urlCharacter":"http://www.imdb.com/character/ch0162239","main":true}],"seasons":[],"idIMDB":"tt0091778","urlIMDB":"http://www.imdb.com/title/tt0091778","business":{"budget":{"money":"$19,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$12,700,000","country":"USA","day":"26","month":"05","year":"1986","remarks":""}],"gross":[{"money":"SEK","country":"2,888,657","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1985/\">1985</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 31 min (91 min)","2 hr 10 min (130 min) (original cut)"],"soundMix":["Dolby"],"color":["Color (Metrocolor)"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":["2,489 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm"]},"rating":"5.7","filmingLocations":[{"location":"1589 Homewood Dr., Altadena, California, USA"}],"rated":"PG-13","awards":[{"award":"Academy Awards, USA 1987","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Effects, Visual Effects","names":[{"name":"Richard Edlund","id":"nm0249430","role":null},{"name":"John Bruno","id":"nm0116497","role":null},{"name":"Garry Waller","id":"nm0909045","role":null},{"name":"Bill Neil","id":"nm0624666","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1987","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Horror Film","names":[]},{"category":"Best Special Effects","names":[{"name":"Richard Edlund","id":"nm0249430","role":null}]}]}]},{"award":"BMI Film & TV Awards 1987","titlesAwards":[{"titleAwardOutcome":"Won BMI Film Music Award","categories":[{"category":"","names":[{"name":"Jerry Goldsmith","id":"nm0000025","role":null}]}]}]},{"award":"Razzie Awards 1987","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Supporting Actress","names":[{"name":"Zelda Rubinstein","id":"nm0748289","role":null}]}]}]},{"award":"Young Artist Awards 1987","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Exceptional Performance by a Young Actress Starring in a Feature Film - Comedy or Drama","names":[{"name":"Heather O'Rourke","id":"nm0001576","role":null}]}]}]}],"votes":"20,104","type":"Movie","companyCreditsSimple":[{"idCompany":"co0174838","name":"Freddie Fields Productions"},{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"}],"keywords":{"keywords":["native american","friends who live together","vomiting","alternate dimension","grotesque","cave","slime","worm","cultist","life force","clairvoyant","sweat","hypnotism","haunting","nightmare","shamanism","spiritualism","medicine man","flashback","ritual","little girl","rite","charm","rain","rose","doll","lance","braids","skeleton","blonde girl","evil preacher","1980s","religious fanaticism","tequila","braces","sequel","possession","giant worm","car trouble","alcoholism","beast","reverend","apparition","death","psychic","burial ground","little person","watching tv","suburb","time","space","chain","revulsion","creature","scream","pipe","lantern","bathtub","garage","religion","cavern","researcher","fire","photograph","lodge","pain","cult","roadside cafe","station wagon","thunder","lightning","pet shop","dancing","singing","drawing","metamorphosis","medium","listening to radio","transformation","soul","eagle","evil","entity","shaman","diner","hair curlers","panic","tradition","reference to the los angeles dodgers","baseball","dream sequence","manifestation","stepladder","graveyard","pet dog","police officer","pickup truck","canyon","little boy","campfire","valley","trance","countryside","magic","tent","anger","cactus","grief","toy","desert","shopping","drummer","song","blonde","garden","skull","hard hat","badge","flashlight","pit","fear","spirit","supernatural power","afterlife","child's point of view","dysfunctional family","kidnapping","rescue","psychic power","hallucination","clergy","stop motion","demon","ghost","cemetery","chainsaw","old man","haunted house","poltergeist","changeling","midget"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:11:02"}}