{"data":{"movies":[{"title":"Tales of Manhattan","originalTitle":"","year":"1942","releaseDate":"19420924","directors":[{"name":"Julien Duvivier","id":"nm0245213"}],"writers":[{"name":"Ben Hecht","id":"nm0372942"},{"name":"Ferenc Molnár","id":"nm0597175"}],"runtime":"118 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTgxMjc0ODc1Nl5BMl5BanBnXkFtZTgwNjEwMzQwMjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama","Romance"],"plot":"An actor, Paul Orman, is accidentally told that his new, custom made tail coat has been cursed and it will bring misfortune to all who wear it. As the 4 succeeding wearers of the coat discover, misfortune can often lead to truth.","simplePlot":"A formal tailcoat that gets passed from one owner to another affects each life in a significant way.","actors":[{"actorName":"Charles Boyer","urlProfile":"http://www.imdb.com/name/nm0000964","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU0MzQ3ODU1Ml5BMl5BanBnXkFtZTcwNjc5NTYwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1899","placeOfBirth":" Figeac, Lot, France","height":"5' 9\" (1.75 m)","bio":"Charles Boyer studied philosophy before he went to the theater where he gave his debut in 1920. Although he had at first no intentions to pursue a career at the movies (his first movie was L'homme du large (1920) by Marcel L'Herbier) he used his chance in Hollywood after several filming stations all over Europe. In the beginning of his career his beautiful voice was hidden by the silent movies but in Hollywood he became famous for his whispered declarations of love (like in movies with Greta Garbo, Marlene Dietrich or Ingrid Bergman). In 1934 he married Pat Paterson, his first and (unusual for a star) only wife. He was so faithful to her that he decided to commit suicide two days after her death in 1978.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU0MzQ3ODU1Ml5BMl5BanBnXkFtZTcwNjc5NTYwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000964","name":"Charles Boyer","nicknames":["The Latin Lover"],"idIMDB":"nm0000964"},"actorId":"nm0000964","character":"Paul Orman","urlCharacter":"http://www.imdb.com/character/ch0496401","main":true},{"actorName":"Rita Hayworth","urlProfile":"http://www.imdb.com/name/nm0000028","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxOTk1NTQ1M15BMl5BanBnXkFtZTcwMjI1MDAwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 October 1918","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Margarita Carmen Cansino","height":"5' 6\" (1.68 m)","bio":"Spanish dancer Eduardo Cansino's daughter Margarita studied dancing beginning in her girlhood. At age 12, the mature-looking Rita joined Eduardo's stage act, in which she was spotted three years later by Fox studio head Winfield R. Sheehan, leading to her first studio contract and film debut at age 16 in Dante's Inferno (1935). Fox dropped her after five small roles, but expert, exploitative promotion by her first husband Edward Judson soon brought Rita a new contract at Columbia Pictures, where studio head Harry Cohn changed her surname to Hayworth and approved raising her hairline by electrolysis. After 13 mainly minor roles, Columbia lent her to Warner Bros. for her first big success, The Strawberry Blonde (1941); her splendid dancing with Fred Astaire in You'll Never Get Rich (1941) made her a star. In person Rita was shy, quiet and unassuming; only when the cameras rolled did she turn on the explosive sexual charisma that in Gilda (1946) made her a superstar. To Rita, though, domestic bliss was a more important, if elusive, goal, and in 1949 she interrupted her career for marriage - unfortunately an unhappy one almost from the start - to the playboy Prince Aly Khan. Her films after her divorce from Khan include perhaps her best straight acting performances, Miss Sadie Thompson (1953) and They Came to Cordura (1959). Beginning in 1960 (age 42), early onset of Alzheimer's disease (undiagnosed until 1980) limited Rita's ability. The last few roles in her 60-film career were increasingly small. Almost helpless by 1981, Rita was cared for by her daughter Yasmin Khan until her death at age 68.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxOTk1NTQ1M15BMl5BanBnXkFtZTcwMjI1MDAwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000028","name":"Rita Hayworth","nicknames":["The Love Goddess"],"idIMDB":"nm0000028"},"actorId":"nm0000028","character":"Ethel Halloway","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ginger Rogers","urlProfile":"http://www.imdb.com/name/nm0001677","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgwNjE4MDkzMV5BMl5BanBnXkFtZTYwNjQ5NjQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1911","placeOfBirth":" Independence, Missouri, USA","birthName":"Virginia Katherine McMath","height":"5' 4½\" (1.64 m)","bio":"Ginger Rogers was born Virginia Katherine McMath in Independence, Missouri on July 16, 1911. Her mother, known as Lelee, went to Independence to have Ginger away from her husband. She had a baby earlier in their marriage and he allowed the doctor to use forceps and the baby died. She was kidnapped by her father several times until her mother took him to court. Ginger's mother left her child in the care of her parents while she went in search of a job as a scriptwriter in Hollywood and later to New York City. Mrs. McMath found herself with an income good enough to where she could send for Ginger. Lelee became a Marine in 1918 and was in the publicity department and Ginger went back to her grandparents in Missiouri. During this time her mother met John Rogers. After leaving the Marines they married in May, 1920 in Liberty, Missouri. He was transferred to Dallas and Ginger (who treated him as a father) went too. Ginger won a Charleston contest in 1925 (age 14) and a 4 week contract on the Interstate circuit. She also appeared in vaudeville acts which she did until she was 17 with her mother by her side to guide her. Now she had discovered true acting. She married in March, 1929, and after several months realized she had made a mistake. She acquired an agent and she did several short films. She went to New York where she appeared in the Broadway production of \"Top Speed\" which debuted Christmas Day, 1929. Her first film was in 1929 in A Night in a Dormitory (1930). It was a bit part, but it was a start. Later that year, Ginger appeared, briefly in two more films, A Day of a Man of Affairs (1929) and Campus Sweethearts (1930). For awhile she did both movies and theatre. The following year she began to get better parts in films such as Office Blues (1930) and The Tip-Off (1931). But the movie that enamored her to the public was Gold Diggers of 1933 (1933). She did not have top billing but her beauty and voice was enough to have the public want more. One song she popularized in the film was the now famous, \"We're in the Money\". Also in 1933 she was in 42nd Street (1933). She suggested using a monocle and this also set her apart. In 1934, she starred with Dick Powell in Twenty Million Sweethearts (1934). It was a well received film about the popularity of radio. Ginger's real stardom occurred when she was teamed with Fred Astaire where they were one of the best cinematic couples ever to hit the silver screen. This is where she achieved real stardom. They were first paired in 1933's Flying Down to Rio (1933) and later in 1935's Roberta (1935) and Top Hat (1935). Ginger also appeared in some very good comedies such as Bachelor Mother (1939) and Fifth Avenue Girl (1939) both in 1939. Also that year she appeared with Astaire in The Story of Vernon and Irene Castle (1939). The film made money but was not anywhere successful as they had hoped. After that studio executives at RKO wanted Ginger to strike out on her own. She made several dramatic pictures but it was 1940's Kitty Foyle (1940) that allowed her to shine. Playing a young lady from the wrong side of the tracks, she played the lead role well, so well in fact, that she won an Academy Award for her portrayal. Ginger followed that project with the delightful comedy, Tom, Dick and Harry (1941) the following year. It's a story where she has to choose which of three men she wants to marry. Through the rest of the 1940s and early 1950s she continued to make movies but not near the caliber before World War II. After Oh, Men! Oh, Women! (1957) in 1957, Ginger didn't appear on the silver screen for seven years. By 1965, she had appeared for the last time in Harlow (1965). Afterward, she appeared on Broadway and other stage plays traveling in Europe, the U.S. and Canada. After 1984, she retired and wrote an autobiography in 1991 entitled, \"Ginger, My Story\" which is a very good book. On April 25, 1995, Ginger died of natural causes in Rancho Mirage, California. She was 83.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgwNjE4MDkzMV5BMl5BanBnXkFtZTYwNjQ5NjQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001677","name":"Ginger Rogers","nicknames":["Feathers"],"idIMDB":"nm0001677"},"actorId":"nm0001677","character":"Diane","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Henry Fonda","urlProfile":"http://www.imdb.com/name/nm0000020","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTEwNjQ2ODQ4Nl5BMl5BanBnXkFtZTYwMzEwMTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1905","placeOfBirth":" Grand Island, Nebraska, USA","birthName":"Henry Jaynes Fonda","height":"6' 1½\" (1.87 m)","bio":"Henry Jaynes Fonda was born in Grand Island, Nebraska, to Elma Herberta (Jaynes) and William Brace Fonda, who worked in advertising and printing. His recent ancestry included Dutch, English, and Scottish. Fonda started his acting debut with the Omaha Community Playhouse, a local amateur theater troupe directed by Dorothy Brando. He moved to the Cape Cod University Players and later Broadway, New York to expand his theatrical career from 1926 to 1934. His first major roles in Broadway include \"New Faces of America\" and \"The Farmer Takes a Wife\". The latter play was transferred to the screen in 1935 and became the start-up of Fonda's lifelong Hollywood career. The following year he married Frances Seymour Fonda with whom he had two children: Jane Fonda and Peter Fonda, also to become screen stars (his granddaughter is actress Bridget Fonda). He is most remembered for his roles as Abe Lincoln in Young Mr. Lincoln (1939), Tom Joad in The Grapes of Wrath (1940), for which he received an Academy Award Nomination, and more recently, Norman Thayer in On Golden Pond (1981), for which he received an Academy Award for Best Actor in 1982. Henry Fonda is considered one of Hollywood's old-time legends and was friend and contemporary of James Stewart, John Ford and Joshua Logan. His movie career which spanned almost 50 years is completed by a notable presence in American theater and television.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTEwNjQ2ODQ4Nl5BMl5BanBnXkFtZTYwMzEwMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000020","name":"Henry Fonda","nicknames":["One-Take Fonda","Hank"],"idIMDB":"nm0000020"},"actorId":"nm0000020","character":"George","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Laughton","urlProfile":"http://www.imdb.com/name/nm0001452","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzOTQ0MTMzNF5BMl5BanBnXkFtZTYwNzkyNjI2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 July 1899","placeOfBirth":" Victoria Hotel, Scarborough, Yorkshire, England, UK","height":"5' 8\" (1.73 m)","bio":"Charles Laughton was born in Scarborough, North Riding of Yorkshire, England, to Eliza (Conlon) and Robert Laughton, hotel keepers of Irish and English descent. He was educated at Stonyhurst, Royal Academy of Dramatic Art (received gold medal). His first appearance on stage was in 1926. Laughton formed own film company, Mayflower Pictures Corp., with Erich Pommer, in 1937. He became and American citizen 1950. A consummate artist, Laughton achieved great success on stage and film, with many staged readings (particularly of George Bernard Shaw) to his credit. Laughton died in Hollywood, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzOTQ0MTMzNF5BMl5BanBnXkFtZTYwNzkyNjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001452","name":"Charles Laughton","idIMDB":"nm0001452"},"actorId":"nm0001452","character":"Charles Smith","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edward G. Robinson","urlProfile":"http://www.imdb.com/name/nm0000064","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzcwMzU5Nl5BMl5BanBnXkFtZTYwNTkwMjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1893","placeOfBirth":" Bucharest, Romania","birthName":"Emmanuel Goldenberg","height":"5' 7\" (1.7 m)","bio":"Edward G. Robinson arrived in the United States at age ten, and his family moved into New York's Lower East Side. He took up acting while attending City College, abandoning plans to become a rabbi or lawyer. The American Academy of Dramatic Arts awarded him a scholarship, and he began work in stock, with his new name, in 1913. Broadway was two years later; he worked steadily there for 15 years. His work included \"The Kibitzer\", a comedy he co-wrote with Jo Swerling. His film debut was a small supporting part in the silent The Bright Shawl (1923), but it was with the coming of sound that he hit his stride. His stellar performance as snarling, murderous thug Rico Bandello in Little Caesar (1931)--all the more impressive since in real life Robinson was a sophisticated, cultured man with a passion for fine art--set the standard for movie gangsters, both for himself in many later films and for the industry. He portrayed the title character in several biographical works, such as Dr. Ehrlich's Magic Bullet (1940) and A Dispatch from Reuter's (1940). Psychological dramas included Flesh and Fantasy (1943), Double Indemnity (1944), The Woman in the Window (1944)and Scarlet Street (1945). Another notable gangster role was in Key Largo (1948). He was \"absolved\" of allegations of Communist affiliation after testifying as a friendly witness for the House Un-American Activities Committee during the McCarthy hysteria of the early 1950s. In 1956 he had to sell off his extensive art collection in a divorce settlement and also had to deal with a psychologically troubled son. In 1956 he returned to Broadway in \"Middle of the Night\". In 1973 he was awarded a special, posthumous Oscar for lifetime achievement.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzcwMzU5Nl5BMl5BanBnXkFtZTYwNTkwMjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000064","name":"Edward G. Robinson","nicknames":["Eddie","Manny"],"idIMDB":"nm0000064"},"actorId":"nm0000064","character":"Avery L. 'Larry' Browne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Robeson","urlProfile":"http://www.imdb.com/name/nm0732079","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MzYyODEyMl5BMl5BanBnXkFtZTYwODcyMDI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1898","placeOfBirth":" Princeton, New Jersey, USA","birthName":"Paul LeRoy Bustill Robeson","height":"6' 3\" (1.91 m)","bio":"This handsome, eloquent and highly charismatic actor became one of the foremost interpreters of Eugene O'Neill's plays and one of the most treasured names in song during the first half of the twentieth century. He also courted disdain and public controversy for most of his career as a staunch Cold War-era advocate for human rights. While the backlash of his civil rights activities and left-wing ideology left him embittered and practically ruined his career, he remains today a durable symbol of racial pride and consciousness. Born in Princeton, New Jersey, on April 9, 1898, Paul LeRoy Bustill Robeson and his four siblings (William, Benjamin, Reeve, Marian) lost their mother, a schoolteacher, in a fire while quite young (Paul was only six). Paul's father, a humble Presbyterian minister and former slave, raised the family singlehandedly and the young, impressionable boy grew up singing spirituals in his father's church. Paul was a natural athlete and the tall (6'3\"), strapping high school fullback had no trouble earning a scholarship to prestigious Rutgers University in 1915 at age 17 -- becoming only the third member of his race to be admitted at the time. He excelled in football, baseball, basketball, and track and field, graduating as a four-letter man. He was also the holder of a Phi Beta Kappa key in his junior year and was a selected member of their honorary society, Cap and Skull. Moreover, he was the class valedictorian and in his speech was already preaching idealism. Paul subsequently played professional football to earn money while attending Columbia University's law school, and also took part in amateur dramatics. During this time he met and married Eslanda Cardozo Goode in 1921. She eventually became his personal assistant. Despite the fact that he was admitted to the New York bar, Paul's future as an actor was destined and he never did practice law. His wife persuaded him to play a role in \"Simon the Cyrenian\" at the Harlem YMCA in 1921. This was followed by his Broadway debut the following year in the short-lived play \"Taboo\", a drama set in Africa, which also went to London. As a result, he was asked to join the Provincetown Players, a Greenwich Village theater group that included in its membership playwright Eugene O'Neill. O'Neill personally asked Paul to star in his plays \"All God's Chillun Got Wings\" and \"The Emperor Jones\" in 1924. The reaction from both critics and audiences alike was electrifying...an actor was born. In 1925 Paul delivered his first singing recital and also made his film debut starring in Body and Soul (1925), a rather murky melodrama that nevertheless was ahead of its time in its depictions of black characters. Although Robeson played a scurrilous, corrupt clergyman who takes advantage of his own people, his dynamic personality managed to shine through. Radio and recordings helped spread his name across foreign waters. His resonant bass was a major highlight in the London production of \"Show Boat\" particularly with his powerful rendition of \"Ol' Man River.\" He remained in London to play the role of Shakespeare's \"Othello\" in 1930 (at the time no U.S. company would hire him), and was again significant in a highly controversial production. Paul caused a slight stir by co-starring opposite a white actress, Peggy Ashcroft, who played Desdemona. Around this time Paul starred in the landmark British film Borderline (1930), a silent film that dealt strongly with racial themes, and then returned to the stage in the O'Neill play \"The Hairy Ape\" in 1931. The following year he appeared in a Broadway revival of \"Show Boat\" again as Joe. In the same production, the noted chanteuse Helen Morgan repeated her original 1927 performance as the half-caste role of Julie, but the white actress Tess Gardella played the role of Queenie in her customary blackface opposite Robeson. Robeson spent most of his time singing and performing in England throughout the 1930s. He also was given the opportunity to recapture two of his greatest stage successes on film: The Emperor Jones (1933) and Show Boat (1936). In Britain he continued to film sporadically with Sanders of the River (1935), Song of Freedom (1936), King Solomon's Mines (1937), Dark Sands (1937) and The Proud Valley (1940) in important roles that resisted demeaning stereotypes. During the 1930s he also gravitated strongly towards economics and politics with a burgeoning interest in social activism. In 1934 he made the first of several trips to the Soviet Union and outwardly extolled the Russian way of life and their lack of racial bias. He was a popular figure in Wales where he became personally involved in their civil rights affairs, notably the Welsh miners. Developing a marked leftist ideology, he continued to criticize the blatant discrimination he found so prevalent in America. The 1940s was a mixture of performance triumphs and poignant, political upheavals. While his title run in the musical drama \"John Henry\" (1940), was short-lived, he earned widespread acclaim for his Broadway \"Othello\" in 1943 opposite José Ferrer as Iago and Uta Hagen as Desdemona. By this time, however, Robeson was being reviled by much of white America for his outspoken civil rights speeches against segregation and lynchings, particularly in the South. A founder of the Progressive Party, an independent political party, his outdoor concerts sometimes ignited violence and he was now a full-blown target for \"Red Menace\" agitators. In 1946 he denied under oath being a member of the Communist Party, but steadfastly refused to refute the accusations under subsequent probes. As a result, his passport was withdrawn and he became engaged in legal battles for nearly a decade in order to retrieve it. Adding fuel to the fire was his only son's (Paul Jr.) marriage to a white woman in 1949 and his being awarded the Stalin Peace Prize in 1952 (he was unable to receive it until 1958 when his passport was returned to him). Essentially blacklisted, tainted press statements continued to hound him. He began performing less and less in America. Despite his growing scorn towards America, he never gave up his American citizenship although the anguish of it all led to a couple of suicide attempts, nervous breakdowns and a dependency on drugs. Europe was a different story. The people continued to hold him in high regard as an artist/concertist above reproach. He had a command of about 20 languages and wound up giving his last acting performance in \"Othello\" on foreign shores -- at Stratford-on-Avon in 1959. While still performing in the 1960s, his health suddenly took a turn for the worse and he finally returned to the United States in 1963. His poet/wife Eslanda Robeson died of cancer two years later. Paul remained in poor health for pretty much the rest of his life. His last years were spent in Harlem in near-total isolation, denying all interviews and public correspondence, although he was honored for speaking out against apartheid in South Africa in 1978. Paul died at age 77 of complications from a stroke. Among his many honors: he was inducted into the College Football Hall of Fame in 1995; he received a Grammy Lifetime Achievement Award in 1998; was honored with a postage stamp during the \"Black Heritage\" series; and both a Cultural Center at Penn State University and a high school in Brooklyn bear his name. In 1995 his autobiography \"Here I Stand\" was published in England in 1958; his son, Paul Robeson Jr., also chronicled a book about his father, \"Undiscovered Paul Robeson: An Artist's Journey\" in 2001.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MzYyODEyMl5BMl5BanBnXkFtZTYwODcyMDI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0732079","name":"Paul Robeson","nicknames":["Robey"],"idIMDB":"nm0732079"},"actorId":"nm0732079","character":"Luke","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ethel Waters","urlProfile":"http://www.imdb.com/name/nm0914083","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NjkwMzM4NF5BMl5BanBnXkFtZTYwMTkxNjI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1896","placeOfBirth":" Chester, Pennsylvania, USA","bio":"The child of a teenage rape victim, Ethel Waters grew up in the slums of Philadelphia and neighboring cities, seldom living anywhere for more than a few weeks at a time. \"No one raised me, \" she recollected, \"I just ran wild.\" She excelled not only at looking after herself, but also at singing and dancing; she began performing at church functions, and as a teenager was locally renowned for her \"hip shimmy shake\". In 1917 she made her debut on the black vaudeville circuit; billed as \"Sweet Mama Stringbean\" for her tall, lithe build, she broke through with her rendition of \"St. Louis Blues\", which Waters performed in a softer and subtler style than her rivals, Ma Rainey and Bessie Smith. Beginning with her appearances in Harlem nightclubs in the late 1920s, then on the lucrative \"white time\" vaudeville circuit, she became one of America's most celebrated and highest-paid entertainers. At the Cotton Club, she introduced \"Stormy Weather\", composed for her by Harold Arlen: she wrote of her performance, \"I was singing the story of my misery and confusion, the story of the wrongs and outrages done to me by people I had loved and trusted\". Impressed by this performance, Irving Berlin wrote \"Supper Time\", a song about a lyncing, for Waters to perform in a Broadway revue. She later became the first African-American star of a national radio show. In middle age, first on Broadway and then in the movies, she successfully recast herself as a dramatic actress. Devoutly religious but famously difficult to get along with, Waters found few roles worthy of her talents in her later years.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NjkwMzM4NF5BMl5BanBnXkFtZTYwMTkxNjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0914083","name":"Ethel Waters","nicknames":["Sweet Mama Stringbean"],"idIMDB":"nm0914083"},"actorId":"nm0914083","character":"Esther","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eddie 'Rochester' Anderson","urlProfile":"http://www.imdb.com/name/nm0026655","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNTI5NzU0OV5BMl5BanBnXkFtZTcwMDM2ODU0Mw@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1905","placeOfBirth":" Oakland, California, USA","birthName":"Edmund L. Anderson","bio":"The son of a minstrel and circus tightrope walker, Eddie Anderson developed a gravel voice early in life which would become his trademark to fame. He joined his older brother Cornelius as members of \"The Three Black Aces\" during his vaudeville years, singing for pennies in the hotel lobby. He eventually moved his way up to the Roxy and Apollo theaters in New York, which led to the Los Angeles Cotton Club in the west. He began to appear in films, typically in servile bits, his best being the featured role of \"Noah\" in The Green Pastures (1936). He continued in that vein until a chance pairing with comedy star Jack Benny on his radio program in 1937 put him on the map. He only had a bit part on Benny's Easter show as a Pullman porter, but his scratchy voice, superb timing and comic reaction to Benny's banter earned him a fixed spot. He then was heard as Benny's personal valet, Rochester Van Jones, and the role became so popular that he became billed as Eddie \"Rochester\" Anderson. In between radio assignments, he found the time to appear in both film drama and comedies, including You Can't Take It with You (1938), Kentucky (1938), Jezebel (1938), and three with Benny - Man About Town (1939), Buck Benny Rides Again (1940) and Love Thy Neighbor (1940). After the films Brewster's Millions (1945) and The Show-Off (1946), Anderson concentrated on his partnership with Jack Benny, following him into television and working with him for a total of 23 years. He returned to the screen for It's a Mad Mad Mad Mad World (1963) but ill health eventually forced him into retirement. He died of long-standing heart problems in 1977.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNTI5NzU0OV5BMl5BanBnXkFtZTcwMDM2ODU0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0026655","name":"Eddie 'Rochester' Anderson","nicknames":["Rochester"],"idIMDB":"nm0026655"},"actorId":"nm0026655","character":"Rev. Lazarus","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thomas Mitchell","urlProfile":"http://www.imdb.com/name/nm0593775","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTcwNjAwMDI2M15BMl5BanBnXkFtZTcwNDMyNTUwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1892","placeOfBirth":" Elizabeth, New Jersey, USA","birthName":"Thomas John Mitchell","height":"5' 10\" (1.78 m)","bio":"Thomas Mitchell was one of the great American character actors, whose credits read like a list of the greatest films of the 20th century: Lost Horizon (1937); Stagecoach (1939); The Hunchback of Notre Dame (1939); Mr. Smith Goes to Washington (1939); Gone with the Wind (1939); It's a Wonderful Life (1946) and High Noon (1952). His portrayals are so diverse and convincing that most people don't even realize that one actor could have played them all. He won a Best Supporting Actor Oscar in 1940 for his role as the drunken Doc Boone in John Ford's Stagecoach (1939).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTcwNjAwMDI2M15BMl5BanBnXkFtZTcwNDMyNTUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0593775","name":"Thomas Mitchell","nicknames":["Tommy"],"idIMDB":"nm0593775"},"actorId":"nm0593775","character":"John Halloway","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eugene Pallette","urlProfile":"http://www.imdb.com/name/nm0657874","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5Nzk5NzA2NF5BMl5BanBnXkFtZTcwNTI1MDQxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1889","placeOfBirth":" Winfield, Kansas, USA","birthName":"Eugene William Pallette","height":"5' 9\" (1.75 m)","bio":"Gargantuan-bellied, frog-voiced character actor who was a staple in forties movies. After World War II his ultra-right-wing political views fuelled his 'bomb' paranoia and he bought a property in Oregon which he turned into a well-stocked compound in case the Russians attacked. Many of his old Hollywood friends, including Clark Gable, visited him there (some came to hunt and fish) but the property was later sold.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5Nzk5NzA2NF5BMl5BanBnXkFtZTcwNTI1MDQxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0657874","name":"Eugene Pallette","idIMDB":"nm0657874"},"actorId":"nm0657874","character":"Luther","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cesar Romero","urlProfile":"http://www.imdb.com/name/nm0003110","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NjE3ODgzOV5BMl5BanBnXkFtZTcwMDMyOTkxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 February 1907","placeOfBirth":" New York City, New York, USA","birthName":"Cesar Julio Romero Jr.","height":"6' 3\" (1.91 m)","bio":"Tall, suave and sophisticated Cesar Romero actually had two claims to fame in Hollywood. To one generation, he was the distinguished Latin lover of numerous musicals and romantic comedies, and the rogue bandit The Cisco Kid in a string of low-budget westerns. However, to a younger generation weaned on television, Romero was better known as the white-faced, green-haired, cackling villain The Joker of the camp 1960s TV series Batman (1966), and as a bumbling corporate villain in a spate of Walt Disney comedies, such as chasing a young Kurt Russell in the fun-packed The Computer Wore Tennis Shoes (1969). Fans and critics alike agreed that Romero was a major talent who proved himself an enduring and versatile star in an overwhelming variety of roles in a career as an actor, dancer and comedian that lasted nearly 60 years. Cesar Romero was born of Cuban parents in New York City in February 1907. He attended the Collegiate School and Riverdale Country School before working as a ballroom dancer. He first appeared on Broadway in the 1927 production of Lady Do, and then in the stage production of Strictly Dishonorable. His first film role was in The Shadow Laughs (1933), after which he gave strong performances in The Devil Is a Woman (1935) and in the Shirley Temple favorite, Wee Willie Winkie (1937). Critics and fans generally agree that Romero's best performance was as the Spanish explorer Cortez in Captain from Castile (1947). However, he also shone in the delightful Julia Misbehaves (1948) and several other breezy and lighthearted escapades. In 1953 he starred in the 39-part espionage TV serial Passport to Danger (1954), which earned him a considerable income due to a canny profit-sharing arrangement. Although Romero became quite wealthy and had no need to work, he could not stay away from being in front of the cameras. He continued to appear in a broad variety of film roles, but surprised everyone in Hollywood by taking on the role of \"The Joker\" in the hugely successful TV series Batman (1966). He refused to shave his trademark mustache for the role, and close observation shows how the white clown makeup went straight on over his much loved mustache! The appearances in Batman were actually only a small part of the enormous amount of work that Romero contributed to television. He guest-starred in dozens of shows, including Rawhide (1959), 77 Sunset Strip (1958), Zorro (1957), Fantasy Island (1977) and Murder, She Wrote (1984). However, it was The Joker for which his TV work was best remembered, and Romero often remarked that for many, many years after Batman ended, fans would stop him and ask him to chuckle and giggle away just like he did as The Joker. Romero always obliged, and both he and the fans just loved it! With a new appeal to a younger fan base, Romero turned up in three highly popular Disney comedies: The Computer Wore Tennis Shoes (1969), Now You See Him, Now You Don't (1972) and The Strongest Man in the World (1975) as corrupt but inept villain A.J. Arno. Throughout the remainder of the 1980s Romero remained busy, and even at 78 years of age the ladies still loved his charm, and he was cast as Jane Wyman's love interest in the top-rated prime-time soap opera Falcon Crest (1981), playing Peter Stavros from 1985 to 1987. Although Romero stopped acting in 1990, he remained busy, regularly hosting classic movie programs on cable television. A talented and much loved Hollywood icon, he passed away on New Year's Day 1994, at the age of 86.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NjE3ODgzOV5BMl5BanBnXkFtZTcwMDMyOTkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003110","name":"Cesar Romero","nicknames":["Butch","The Latin Lover","The Latin from Manhattan"],"idIMDB":"nm0003110"},"actorId":"nm0003110","character":"Harry Wilson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gail Patrick","urlProfile":"http://www.imdb.com/name/nm0665850","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmE0ZmI5YWUtM2YwNy00MGY3LTg4YjUtOTIyOTRkYmJiZjIxXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1911","placeOfBirth":" Birmingham, Alabama, USA","birthName":"Margaret LaVelle Fitzpatrick","height":"5' 7\" (1.7 m)","bio":"Cold, calculating and hard-as-nails is probably the best definition of Gail Patrick's femmes on the 30s and 40s silver screen, and the actress herself was no softie in real life. The tall, slender, patrician beauty was born with the equally stately-sounding name Margaret LaVelle Fitzpatrick in Birmingham, Alabama, on June 20, 1911. She received a B.A. and was a dean of women at her alma mater, Howard College, for a time. She was studying pre-law at the University of Alabama at the time she, by happenstance, became a finalist in a nationwide contest for a Paramount film role (which she did not get). This led her to going to Hollywood and, despite her loss, the studio wound up offering her a studio contract at $50 a week (she managed to finagle her way to $75). After the usual grooming in bit parts, Gail moved stealthily up the ladder to featured roles in a wide assortment of genres including the fantasy Death Takes a Holiday (1934), the melodramatic thriller The Crime of Helen Stanley (1934), the musical Mississippi (1935) and the easy comedy Early to Bed (1936). Just as quickly she began essaying the occasional co-star or leading lady -- that of a woman lawyer in Disbarred (1939) and a romantic diversion in the Zane Grey western adaptations of Wagon Wheels (1934) and Wanderer of the Wasteland (1935). She was most identified, however, in manipulative second leads while usually tangling with the star femme as the \"other woman,\" haughty socialite or scheming villainess. Gail participated grandly in three well-known film classics. In the screwball comedy My Man Godfrey (1936), she was at odds with Carole Lombard as a spoiled, treacherous sister; in Stage Door (1937), she engaged in some marvelous cat fights with Ginger Rogers as a cynical wannabe actress, and in My Favorite Wife (1940) she played Cary Grant's exacting second wife who must contend with the reappearance of his first, supposedly dead wife Irene Dunne. Gail exuded wit, confidence, assertiveness and elegance in all her characters, nothing less, and her male co-stars were the sturdiest assortment Hollywood could offer -- Bing Crosby, Randolph Scott, Richard Dix, John Howard, Preston Foster, Dean Jagger and George Sanders. In 1947, she did an abrupt about-face and left her highly respectable career following her third marriage. After involving herself successfully in clothes design, she became (as Gail Patrick Jackson) executive producer of the Perry Mason (1957) TV series (1957-1966), alongside producer and husband (Thomas) Cornwell Jackson, who was a literary agent to author/creator Erle Stanley Gardner. The courtroom \"whodunnit\" was a long and highly successful run. She and Jackson divorced in 1969, and one of her few failures in life was in her attempt to revive the series with The New Perry Mason (1973) in 1973, but Monte Markham was a mighty pale comparison to Raymond Burr in the title role and the show quickly tanked. Divorced three times, she and Mr. Jackson had two adopted children. She was married to fourth husband John Velde Jr., at the time of her death in 1980 of leukemia. She was 69.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmE0ZmI5YWUtM2YwNy00MGY3LTg4YjUtOTIyOTRkYmJiZjIxXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0665850","name":"Gail Patrick","idIMDB":"nm0665850"},"actorId":"nm0665850","character":"Ellen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roland Young","urlProfile":"http://www.imdb.com/name/nm0950019","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MjE4MDYyNl5BMl5BanBnXkFtZTcwNTIwNzAyOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 November 1887","placeOfBirth":" London, England, UK","height":"5' 6\" (1.68 m)","bio":"Best remembered for the many meek characters he played -- think Cosmo Topper, of the screwball classic ­­Topper (1937) -- this balding, short, yet distinguished actor was born in London, England, to an architect and his wife. Young was educated at Sherborne College and London University and trained as an actor at the Royal Academy of Dramatic Art. He made his London stage debut in 1908, moved to the United States a few years later, made his New York debut (in \"Hindle Wakes\") in 1912, and became a fixture on Broadway. Young performed equally well in farce and drama; standout credits included \"John Gabriel Borkman\" (1915), \"The Seagull\" (1916), \"A Doll's House\" (1918), \"Rollo's Wild Oat,\" \"Hedda Gabler\" (1923), and \"The Last of Mrs. Cheyney\" (1927). He also joined the the Washington Square Players. Young became a U.S. citizen in 1918 and served in the Army during WW I. He appeared in a few silent films after his discharge, including Sherlock Holmes (1922), in which he played an amusingly hesitant Dr. Watson to John Barrymore's sleuth. His first talking film was The Unholy Night (1929), directed by Lionel Barrymore, but Young didn't really come into his own in Hollywood until the screwball comedies of the 1930s, for which he seemed tailor-made. With his patrician air, tidy mustache, and fumbling-yet-dry delivery, Young did his share of scene-stealing in New Moon (1930), as Count Strogoff; The Squaw Man (1931), as Sir John Applegate; David Copperfield (1935), in a rare villainous role as Uriah Heap; The Man Who Could Work Miracles (1936), as the timorous clerk with God-like powers; and Ruggles of Red Gap (1935), as the inebriated Earl of Burnstead who loses his valet (Charles Laughton) in a poker game. So good was he in Topper (1937) that he earned an Oscar nomination, which is rare for a comic actors. An experienced radio performer as well, Young starred in a mid-1940s broadcast of \"Topper\" and appeared with Cornelia Otis Skinner in the 1945 serial \"William and Mary.\" Married twice, Young died of natural causes at age 65, in New York City, on June 5, 1953.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MjE4MDYyNl5BMl5BanBnXkFtZTcwNTIwNzAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0950019","name":"Roland Young","idIMDB":"nm0950019"},"actorId":"nm0950019","character":"Edgar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marion Martin","urlProfile":"http://www.imdb.com/name/nm0552744","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5Njg2NDQzMV5BMl5BanBnXkFtZTgwOTc5MTM4MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1908","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Marion Suplee","height":"5' 6½\" (1.69 m)","bio":"Dubbed \"Hollywood's blonde menace,\" brassy, curvaceous Marion Martin (born Marion Suplee) was the daughter of a well-to-do Bethlehem Steel executive and reared in Main Line society. She attended exclusive schools until the family fortune was wiped out in the stock market crash of 1929. Forced to work, she found employment as a chorine in one of Earl Carroll's New York stage revues. Florenz Ziegfeld Jr. got a gander at the dazzling beauty and signed her to replace Gypsy Rose Lee in his Follies of 1933 wearing little but \"a feather and some beads.\" After a few other fetching Broadway appearances, she was signed by Universal in 1938 and adopted the stage name of Marion (or sometimes Marian) Martin. At first superfluously put in short films, she received her big break in Sinners in Paradise (1938), a downed-plane-on-a-desert-island adventure which emphasized her physical attributes. Quickly pigeonholed as a stripper, chorus girl or brazen, gold-digger type, her feline roles actually belied her off-camera personality as a shy, intelligent and chic lady. In the 1940s Marion played sexy foils to the Marx Brothers and dug up a few support roles in mostly secondary features. Her career, never rising above the \"B\"-level ranks, pretty much ended by the 1950s. She happily retired in 1951 and found stability in marriage, donating much of her time to charitable causes. She died in 1985.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5Njg2NDQzMV5BMl5BanBnXkFtZTgwOTc5MTM4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0552744","name":"Marion Martin","idIMDB":"nm0552744"},"actorId":"nm0552744","character":"'Squirrel'","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0035415","urlIMDB":"http://www.imdb.com/title/tt0035415","business":{"budget":{"money":"$1,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 58 min (118 min)","2 hr 7 min (127 min) (restored)"],"soundMix":["Mono (Western Electric Mirrophonic Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["3,329 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.4","filmingLocations":[{"location":"20th Century Fox Studios - 10201 Pico Blvd., Century City, Los Angeles, California, USA"}],"rated":"UNRATED","awards":[{"award":"National Board of Review, USA 1942","titlesAwards":[{"titleAwardOutcome":"Won NBR Award","categories":[{"category":"Best Acting","names":[{"name":"Edward G. Robinson","id":"nm0000064","role":null}]}]}]}],"votes":"1,375","type":"Movie","companyCreditsSimple":[{"idCompany":"co0000756","name":"Twentieth Century Fox Film Corporation"}],"keywords":{"keywords":["tail coat","lawyer","reunion","composer","anthology","chauffeur","frenchman","circumstantial evidence","soup kitchen","homeless person","derelict","reference to anton dvorak","reference to richard strauss","reference to franz liszt","second hand shop","saloon","reference to igor stravinsky","symphony orchestra","maestro","top hat","class reunion","dickie","reference to moses","wecot","casino","reference to fred allen","gun collection","roulette","organ","reference to j. p. morgan","disbarment","reference to william shakespeare","alcoholic","drunkenness","play within a play","reference to noah's ark","quote from hamlet","reference to eve","shakespearean quotation","biblical quote","valet","bowery mission","big game hunter","prospective groom","tenant farmer","stage actor","fiance fiancee relationship","manhattan new york city","waldorf astoria hotel manhattan new york city","bowery manhattan new york city","thief","husband wife relationship","whistling","transformation","tailor","scarecrow","reverend","prayer","poverty","playboy","pawnbroker","new york city","mock trial","mistress","love","jealousy","infidelity","gunshot wound","extramarital affair","engagement","duplicity","conductor","clothes","christmas eve","bachelor party","audition","love letter","robbery","attempted murder","affair","curse","homelessness"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 19:36:14"}}