{"data":{"movies":[{"title":"All That Heaven Allows","originalTitle":"","year":"1955","releaseDate":"19551209","directors":[{"name":"Douglas Sirk","id":"nm0802862"}],"writers":[{"name":"Peg Fenwick","id":"nm0272128"},{"name":"Edna L. Lee","id":"nm0497209"}],"runtime":"89 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTAzZmI5ODgtYzYzZS00ZDQxLTk5NDItNzY3YjdhYjE3Nzk3XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Romance"],"plot":"Cary Scott is a widow with two grown children. She's been leading a quiet life since her husband died, socializing with a small circle of friends. Her children no longer live with her full-time but come home every weekend. She's not unhappy but also doesn't realize how bored she is. Her friend Sara Warren encourages he to get a television set to keep her company but she doesn't want that either. She develops a friendship with Ron Kirby who owns his own nursery and comes every spring and fall to trim her trees. Ron is much younger than she and their friendship soon turns to love. Her circle of friends are surprised that she is seeing such a younger man and she might be prepared to overlook that - Ron certainly doesn't care about the differences in their ages - but when her son and daughter vehemently object, she decides to sacrifice her own feelings for their happiness. Over time however, she realizes that her children will be spending less and less time with her as they pursue their ...","simplePlot":"An upper-class widow falls in love with a much younger, down-to-earth nurseryman, much to the disapproval of her children and criticism of her country club peers.","actors":[{"actorName":"Jane Wyman","urlProfile":"http://www.imdb.com/name/nm0943837","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNDg3NDI3MV5BMl5BanBnXkFtZTYwNTc0NDU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1917","placeOfBirth":" St. Joseph, Missouri, USA","birthName":"Sarah Jane Mayfield","height":"5' 5½\" (1.66 m)","bio":"Jane Wyman was born Sarah Jane Mayfield on January 5, 1917, in St. Joseph, Missouri (she was also known later as Sarah Jane Fulks). When she was only eight years old, and after her parents filed for divorce, she lost her father prematurely. After graduating high school she attempted, with the help of her mother, to break into films, but to no avail. In 1935, after attending the University of Missouri, she began a career as a radio singer, which led to her first name change to Jane Durrell. In 1936 she signed a contract with Warner Bros. Pictures and that led to another name change, the more familiar one of Jane Wyman. Under that name she appeared in \"A\" and \"B\" pictures at Warners, including two with her future husband, Ronald Reagan: Brother Rat (1938) and its sequel, Brother Rat and a Baby (1940). In the early 1940s she moved into comedies and melodramas and gained attention for her role as Ray Milland's long-suffering girlfriend in The Lost Weekend (1945). The following year she was nominated for a Best Actress Oscar for her role as Ma Baxter in The Yearling (1946), and won the coveted prize in 1949 as deaf-mute rape victim Belinda MacDonald in Johnny Belinda (1948). She followed that with a number of appearances in more prestigious films, such as Alfred Hitchcock's Stage Fright (1950), Frank Capra's Here Comes the Groom (1951), Michael Curtiz's The Story of Will Rogers (1952) and the first movie version of The Glass Menagerie (1950). She starred opposite Bing Crosby in the musical Just for You (1952). She was Oscar-nominated for her performances in The Blue Veil (1951) and Magnificent Obsession (1954). She also starred in the immensely popular So Big (1953), Lucy Gallant (1955), All That Heaven Allows (1955) and Miracle in the Rain (1956). In addition to her extensive film career, she hosted TV's Jane Wyman Presents The Fireside Theatre (1955) and starred in most of the episodes of the show, which ran for three seasons. She came back to the big screen in Holiday for Lovers (1959), Pollyanna (1960) and her final film, How to Commit Marriage (1969). Although off the big screen, she became a presence on the small screen and starred in two made-for-TV movies, including The Incredible Journey of Doctor Meg Laurel (1979). In early 1981, in the 49th year of her career, she won the role of conniving matriarch Angela Channing Erikson Stavros Agretti in the movie \"The Vintage Years\", which was the unaired pilot for the prime-time soap opera Falcon Crest (1981), later in the year. For nine seasons she played that character in a way that virtually no other actress could have done, and became the moral center of the show. The show was a ratings winner from its debut in 1981, and made stars out of her fellow cast members Robert Foxworth, Lorenzo Lamas, Abby Dalton and Susan Sullivan. At the end of the first season the story line had her being informed that her evil son, played by David Selby, had inherited 50% of a California newspaper company, and the conflicts inherent in that situation led to even bigger ratings over the next five years. Wyman was nominated six times for a Soap Opera Digest Award, and in 1984 she won the Golden Globe for Best Performance by an Actress in a TV Series Drama. By the show's eighth season, however, she was emotionally drained and the strain of constantly working to keep up the quality of a hit show took its toll on her. In addition, there was friction on the set among cast members. All of these events culminated in her departure from the show after the first two episodes of the ninth season (her character was hospitalized and slipped into a coma) for health reasons. After a period of recuperation, she believed that she had recovered enough to guest-star in the last three episodes of the season (her doctor disagreed, but she did it anyway). She then guest-starred as Jane Seymour's mother on Dr. Quinn, Medicine Woman (1993) and three years later appeared in Wild Bill: Hollywood Maverick (1995). In the late 1990s she purchased a home in Rancho Mirage, California, where she lived in retirement. Her daughter, Maureen Reagan (who died in August 2001), was a writer who also involved herself in political issues and organized a powerful foundation. Also, she placed her 3200-sq.-ft. Rancho Mirage condominium on the market. Jane Wyman died at the age of 90, at her Palm Springs, California home, on September 10, 2007, having long suffered from arthritis and diabetes. It was reported that Wyman died in her sleep of natural causes at the Rancho Mirage Country Club.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNDg3NDI3MV5BMl5BanBnXkFtZTYwNTc0NDU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0943837","name":"Jane Wyman","nicknames":["Button Nose","Minnie Mouse","Janie"],"idIMDB":"nm0943837"},"actorId":"nm0943837","character":"Cary Scott","urlCharacter":"http://www.imdb.com/character/ch0012409","main":true},{"actorName":"Rock Hudson","urlProfile":"http://www.imdb.com/name/nm0001369","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNDgyNjUyNV5BMl5BanBnXkFtZTYwNTEyNDQ2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1925","placeOfBirth":" Winnetka, Illinois, USA","birthName":"Roy Harold Scherer Jr.","height":"6' 5\" (1.96 m)","bio":"Rock Hudson was born Roy Harold Scherer, Jr. in Winnetka, Illinois, to Katherine (Wood), a telephone operator, and Roy Harold Scherer, an auto mechanic. He was of German, Swiss-German, English, and Irish descent. His parents divorced when he was eight years old. He failed to obtain parts in school plays because he couldn't remember lines. After high school he was a postal employee and during WW II served as a Navy airplane mechanic. After the war he was a truck driver. His size and good looks got him into movies. His name was changed to Rock Hudson, his teeth were capped, he took lessons in acting, singing, fencing and riding. One line in his first picture, Fighter Squadron (1948), needed 38 takes. In 1956 he received an Oscar nomination for Giant (1956) and two years later Look magazine named him Star of the Year. He starred in a number of bedroom comedies, many with Doris Day, and had his own popular TV series McMillan & Wife (1971). He had a recurring role in TV's Dynasty (1981) (1984-5). He was the first major public figure to announce he had AIDS, and his worldwide search for a cure drew international attention. After his death his long-time lover Marc Christian successfully sued his estate, again calling attention to the homosexuality Rock had hidden from most throughout his career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNDgyNjUyNV5BMl5BanBnXkFtZTYwNTEyNDQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001369","name":"Rock Hudson","nicknames":["Roy","Leroy","Rock Pyle","Fitz","Mr Beefcake"],"idIMDB":"nm0001369"},"actorId":"nm0001369","character":"Ron Kirby","urlCharacter":"http://www.imdb.com/character/ch0012413","main":true},{"actorName":"Agnes Moorehead","urlProfile":"http://www.imdb.com/name/nm0001547","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MDQ5ODE3M15BMl5BanBnXkFtZTcwODk5ODcyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 December 1900","placeOfBirth":" Clinton, Massachusetts, USA","birthName":"Agnes Robertson Moorehead","height":"5' 4\" (1.63 m)","bio":"Of Irish/English ancestry, Agnes was born near Boston, the daughter of a Presbyterian minister (her mother was a mezzo-soprano) who encouraged her to perform in church pageants. Aged three, she sang 'The Lord is my Shepherd' on a public stage and seven years later joined the St. Louis Municipal Opera as a dancer and singer for four years. In keeping with her father's dictum of finishing her education first (then doing whatever she wished to do with her career), Agnes attended Muskingum College (Ohio) and, subsequently, the University of Wisconsin, where she graduated with an M.A. in English and public speaking, later adding a doctorate in literature from Bradley University to her resume. When her family moved to Reedsburg, Wisconsin, where her father had a pastorate, Agnes taught public school English and drama for five years. In between, she went to Paris to study pantomime with Marcel Marceau. In 1928, she began studies at the American Academy for Dramatic Arts and graduated with honors the following year. In order to supplement her income , Agnes had turned to radio early on. She had her first job in 1923 as a singer for a St. Louis radio station. Her love for that medium remained with her all her life, and, from the 1930's to the 1950's, she appeared on numerous serials, dramas and children's programs. She was Min Gump in \"The Gumps\" (1934), the 'dragon lady' in \"Terry and the Pirates\" (1937), Margot Lane of classic comic strip fame in \"The Shadow\", Mrs.Danvers in \"Rebecca\" and the bed-ridden woman about to meet her end in \"Sorry, Wrong Number\" . Acting on the airwaves was so important to her that she would insist on its continuation as a precondition of a later contract with MGM. Significantly, through her radio work on \"The Shadow\"and \"March of Time\" in 1937, she met and befriended fellow actor Orson Welles. Welles soon invited her to join him and Joseph Cotten as charter members of his Mercury Theatre on the Air. Agnes was involved in the famous \"War of the Worlds\" broadcast of 1938, which attracted nationwide attention and resulted in a lucrative $100,000 per picture deal with RKO in Hollywood. The Mercury players (the other principals were Ray Collins, Everett Sloane, Paul Stewart and George Coulouris) packed up and went west. An ebullient and versatile character actress, Agnes was impossible to typecast: she could play years older than her age, appear as heroine or villainess, tragedienne or comedienne. In her first film, the iconic Citizen Kane (1941) she played the titular character's mother. She received her greatest critical acclaim for her emotive second screen performance, as Aunt Fanny Minafer, in The Magnificent Ambersons (1942). In addition to being voted the year's best female performer by the New York Film Critics, she was also nominated for an Academy Award. Through the years, Agnes would be nominated three more times: for her touching portrayal of the jaded but sympathetic Baroness Conti in Mrs. Parkington (1944); for her role as the title character's Aunt Aggie in Johnny Belinda (1948) and for playing Velma, the hard-boiled, suspicious housekeeper of Bette Davis in Hush...Hush, Sweet Charlotte (1964), co-starring her old friend Joseph Cotten. Other notable film appearances included Jane Eyre (1943), with Orson Welles, The Woman in White (1948) as Countess Fusco), The Lost Moment (1947) (as a 105-year old woman) and Dark Passage (1947), a classic film noir in which she had third billing behind Humphrey Bogart and Lauren Bacall as the treacherous , malevolent Madge Rapf. She had a rare starring role in the campy horror flick The Bat (1959), giving (according to the New York Times of December 17) 'a good, snappy performance'. On Broadway, she appeared in several noted plays, such as \"All the King's Men\" and \"Candlelight\". She enjoyed success with \"Don Juan in Hell\", touring nationally, the first time (1951-2) with Charles Laughton and Cedric Hardwicke, the second time (receiving fewer critical plaudits) with Ricardo Montalban and Paul Henreid in 1973. She also starred with Joseph Cotten in \"Prescription Murder\" (1962), which, while not a great critical success was much liked by audiences and introduced a famous detective named Lieutenant Columbo. From 1954, she also toured the U.S. and Europe with her own a one-woman show, entitled \"The Fabulous Redhead\". Agnes performed numerous times on television before landing the role of Endora on Bewitched (1964). One particularly interesting part came her way through the director Douglas Heyes, who remembered her from \"Sorry, Wrong Number\", and cast her in the starring - and indeed, only role in The Twilight Zone: The Invaders (1961) episode, \"The Invaders\". As the lonely old woman confronted by tiny alien invaders in her remote farmhouse, Agnes never utters a single word, cleverly acting her scenes as a pantomime of unspoken terror. Of course, the genial Agnes Moorehead has been immortalized as Elizabeth Montgomery's flamboyant witch-mother, Endora, though that was not a role the actress wished to be remembered for, in spite of several Emmy Award nominations. Indeed, she had considered the whole witchcraft theme to be too far-fetched and was somewhat taken aback by the show's huge popularity. Agnes had a special clause inserted in her contract which limited her appearances to eight out of twelve episodes, giving her the opportunity to work on other projects. Commenting on the acting profession in one of her many interviews (New York Times, May 1, 1974), she found the key to success in being \" sincere in your work \" and to \"just go right on whether audiences or critics are taking your scalp off or not\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MDQ5ODE3M15BMl5BanBnXkFtZTcwODk5ODcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001547","name":"Agnes Moorehead","nicknames":["The Lavender Lady","Aggie","Madame Mauve","Bobby"],"idIMDB":"nm0001547"},"actorId":"nm0001547","character":"Sara Warren","urlCharacter":"http://www.imdb.com/character/ch0550227","main":true},{"actorName":"Conrad Nagel","urlProfile":"http://www.imdb.com/name/nm0619261","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NjcwNzc5NF5BMl5BanBnXkFtZTgwNTYxMTU1MzE@._V1._CR107,140,547,730_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 March 1897","placeOfBirth":" Keokuk, Iowa, USA","birthName":"John Conrad Nagel","height":"6' (1.83 m)","bio":"Conrad Nagel was born on March 16, 1897 in Keokuk, Iowa, USA as John Conrad Nagel. He was an actor, known for All That Heaven Allows (1955), The Silver Theatre (1949) and The Divorcee (1930). He was married to Michael Coulson Smith, Lynn Merrick and Ruth Helms. He died on February 24, 1970 in New York City, New York, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NjcwNzc5NF5BMl5BanBnXkFtZTgwNTYxMTU1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0619261","name":"Conrad Nagel","nicknames":["Prince Consort"],"idIMDB":"nm0619261"},"actorId":"nm0619261","character":"Harvey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Virginia Grey","urlProfile":"http://www.imdb.com/name/nm0340706","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjhhYjZkNzYtNzdmYS00YjlkLWI2MmQtZmRlYThmYzgxZjAzL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1917","placeOfBirth":" Los Angeles, California, USA","height":"5' 5\" (1.65 m)","bio":"Born into a show-business family--her father was a director and her mother was a film cutter--Virginia Grey made her film debut at age 10 as Eva in Uncle Tom's Cabin (1927). After a few more films as a child actress, she left the business to finish her schooling. Returning to films as an adult in the 1930s, she started out getting extra work and bit parts, but soon graduated to speaking roles and was eventually signed to a contract by MGM. The studio gave her leading parts in \"B\" pictures and supporting roles in \"A\" pictures. She left MGM in 1942 and went out on her own, working at almost every studio in Hollywood. She worked steadily in both films and TV, and retired from the business in 1970.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjhhYjZkNzYtNzdmYS00YjlkLWI2MmQtZmRlYThmYzgxZjAzL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0340706","name":"Virginia Grey","idIMDB":"nm0340706"},"actorId":"nm0340706","character":"Alida Anderson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gloria Talbott","urlProfile":"http://www.imdb.com/name/nm0847993","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGRkMDY2MzAtOTdiNS00M2Q1LWE2MzgtYWE1MjMzOWQ4MWEwL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 February 1931","placeOfBirth":" Glendale, California, USA","birthName":"Gloria Maude Talbott","bio":"Gloria Talbott was born in the Los Angeles suburb of Glendale, a city co-founded by her grandfather. Growing up in the shadows of the Hollywood studios, her interests inevitably turned to acting, with the result that she participated in school plays and landed small parts in films such as \"Maytime\" (1937), \"Sweet and Lowdown\" (1943) and \"A Tree Grows in Brooklyn\" (1945). After leaving school, she started her own dramatic group and played \"arena\"-style shows at various clubs. After a three-year hiatus (marriage, motherhood and divorce), Talbott resumed her career, working extensively in both TV and films. Her sister is actress Lori Talbott.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGRkMDY2MzAtOTdiNS00M2Q1LWE2MzgtYWE1MjMzOWQ4MWEwL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0847993","name":"Gloria Talbott","idIMDB":"nm0847993"},"actorId":"nm0847993","character":"Kay Scott","urlCharacter":"http://www.imdb.com/character/ch0012415","main":true},{"actorName":"William Reynolds","urlProfile":"http://www.imdb.com/name/nm0721999","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMDA1NjI1Ml5BMl5BanBnXkFtZTgwMDIwMTQ2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 December 1931","placeOfBirth":" Los Angeles, California, USA","height":"6' (1.83 m)","bio":"William de Clerq Reynolds, born in Los Angeles, began his film career in 1951, one year after his marriage to Molly Sinclair. The handsome actor portrayed many authority figures, both in the movies and on television. He managed to display a wide emotional range, as evidenced by his tour-de-force performance as \"Lt. Fitzgerald\" in the 12 February 1960 episode of The Twilight Zone (1959), episode The Twilight Zone: The Purple Testament (1960). Reynolds also had a close relationship with Jack Webb. He had the lead role in Pete Kelly's Blues (1959), and had a memorable guest spot as \"Sgt. William Riddle\" on Dragnet 1967 (1967). His last role was on the Webb-produced series, Project U.F.O. (1978). His greatest success was as \"Special Agent Tom Colby\" (1967-1973) on The F.B.I. (1965).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMDA1NjI1Ml5BMl5BanBnXkFtZTgwMDIwMTQ2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0721999","name":"William Reynolds","idIMDB":"nm0721999"},"actorId":"nm0721999","character":"Ned Scott","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Drake","urlProfile":"http://www.imdb.com/name/nm0236866","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDdhODA5MjgtODcyOS00YjM0LWE4Y2QtZDE2MDhkZTQ3NWRlXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 October 1917","placeOfBirth":" New York City, New York, USA","birthName":"Charles Rupert","height":"6' 2\" (1.88 m)","bio":"Personable actor Charles Drake was born Charles Ruppert on October 2, 1917, in New York City. He graduated from Nichols College in 1937 and initially became a salesman before switching to acting in 1939 and appearing in little theater productions. He changed his stage name to the more suitable Charles Drake and in the late 1930s managed to snag a contract with Warner Brothers. Drake started apprenticing in small, often unbilled roles in what would become enduring WWII-era classics: The Hunchback of Notre Dame (1939), The Maltese Falcon (1941), The Man Who Came to Dinner (1942), Now, Voyager (1942), Sergeant York (1941), and Yankee Doodle Dandy (1942), but did not rise suitably in billing rank during that time. Military service interrupted his career in 1943, but he returned to Hollywood within a couple of years sans his Warner's contract. Following a slight lull in the freelancing department, he was finally picked up by Universal and actually found better work in still somewhat standardized roles. He played Dr. Sanderson in Harvey (1950), the villain in You Never Can Tell (1951), and Shelley Winters' cowardly boyfriend in Winchester '73 (1950), among others. He also became a top supporting player in the westerns and war pics of Audie Murphy, who became a good friend offstage. In 1955, Drake turned to television as one of the stock-company players on Robert Montgomery Presents (1950) and a couple of years later became the host of the weekly British TV espionage series Rendezvous (1957). Although he played in over 80 films (mostly dramatic fare) between the years 1939 and 1975, he did not become a star. He continued on as a rather unobtrusive character actor in the 1960s and appeared in such innocuous fare as Tammy Tell Me True (1961) and Valley of the Dolls (1967) (as suitor Kevin Gilmore), while showing up occasionally as assorted high-rankers in such films as The Arrangement (1969) and The Seven Minutes (1971). He finished off his career on TV before retiring. Drake died in 1994 at age 76.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDdhODA5MjgtODcyOS00YjM0LWE4Y2QtZDE2MDhkZTQ3NWRlXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0236866","name":"Charles Drake","idIMDB":"nm0236866"},"actorId":"nm0236866","character":"Mick Anderson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hayden Rorke","urlProfile":"http://www.imdb.com/name/nm0740718","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4ODQxOTU2M15BMl5BanBnXkFtZTcwNjIxOTgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 October 1910","placeOfBirth":" Brooklyn, New York, USA","birthName":"William Henry Rorke","height":"5' 11\" (1.8 m)","bio":"Hayden Rorke was best known as the ever suspicious \"Dr. Alfred E. Bellows\" on the 1960s TV series, I Dream of Jeannie (1965). Born in Brooklyn, New York, Rorke was educated at the American Academy of Dramatic Arts, and he began his stage career in the 1930s with the Hampden Theatrical Company. A veteran of numerous Broadway shows, he made his film debut in the musical, This Is the Army (1943), while in the service during World War II. His films included: An American in Paris (1951), Pillow Talk (1959) and When Worlds Collide (1951). A familiar face on TV during the 1950s, Rorke appeared on numerous shows including: The Twilight Zone (1959), Perry Mason (1957), Broken Arrow (1956) and Cheyenne (1955). His final appearance was reprising the role of \"Dr. Bellows\" in the TV movie: I Dream of Jeannie... Fifteen Years Later (1985).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4ODQxOTU2M15BMl5BanBnXkFtZTcwNjIxOTgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0740718","name":"Hayden Rorke","idIMDB":"nm0740718"},"actorId":"nm0740718","character":"Dr. Dan Hennessy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jacqueline deWit","urlProfile":"http://www.imdb.com/name/nm0223190","urlPhoto":"","biography":{"dateOfBirth":"26 September 1912","placeOfBirth":" Los Angeles, California, USA","birthName":"Wilhelmina deWit","height":"5' 7\" (1.7 m)","bio":"Jacqueline deWit was born on September 26, 1912 in Los Angeles, California, USA as Wilhelmina deWit. She was an actress, known for All That Heaven Allows (1955), Harper (1966) and The Snake Pit (1948). She died on January 7, 1998 in Los Angeles.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0223190","name":"Jacqueline deWit","nicknames":["Jacqueline deWit"],"idIMDB":"nm0223190"},"actorId":"nm0223190","character":"Mona Plash","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leigh Snowden","urlProfile":"http://www.imdb.com/name/nm0811357","urlPhoto":"","biography":{"dateOfBirth":"23 June 1929","placeOfBirth":" Memphis, Tennessee, USA","birthName":"Martha Lee Estes","bio":"The Tennessee-born Snowden (real name: Martha Lee Estes) was a movie actress and model who first made a splash on the Jack Benny TV show, sashaying across the stage at the San Diego Naval base. Twenty thousand sailors gave the curvy sweater-clad starlet a standing ovation that made headlines in \"Variety\", and every talent scout in Hollywood was on Snowden's trail the very next morning. Three days later, she was hired to make her film debut in director Robert Aldrich's obtuse crime classic Kiss Me Deadly (1955) (Aldrich expanded her role and gave her featured billing). In January 1955, she signed a seven-year contract with Universal Studios, beginning by playing up her Dixie drawl in their glossy soap opera All That Heaven Allows (1955). Other movies include Francis in the Navy (1955), The Creature Walks Among Us (1956) and the Bridey Murphy-inspired I've Lived Before (1956). In September 1956, Snowden married Dick Contino, a big-name singer/accordion player, and a few years later she retired from acting. Mother to five children from two marriages, she died of cancer at age 51.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0811357","name":"Leigh Snowden","idIMDB":"nm0811357"},"actorId":"nm0811357","character":"Jo-Ann Grisby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Donald Curtis","urlProfile":"http://www.imdb.com/name/nm0193321","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYzMjgyODIzM15BMl5BanBnXkFtZTgwMjkxNzQ3MTE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1915","placeOfBirth":" Cheney, Washington, USA","birthName":"Curtis Donald Rudolf","height":"6' 4\" (1.93 m)","bio":"Donald Curtis was born on February 27, 1915 in Cheney, Washington, USA as Curtis Donald Rudolf. He was an actor, known for Spellbound (1945), The Ten Commandments (1956) and Earth vs. the Flying Saucers (1956). He was married to Dorothy M. Gessel. He died on May 22, 1997 in Desert Hot Springs, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYzMjgyODIzM15BMl5BanBnXkFtZTgwMjkxNzQ3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0193321","name":"Donald Curtis","idIMDB":"nm0193321"},"actorId":"nm0193321","character":"Howard Hoffer","urlCharacter":"http://www.imdb.com/character/ch0012417","main":true},{"actorName":"Alex Gerry","urlProfile":"http://www.imdb.com/name/nm0314778","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NDM2NjE0Ml5BMl5BanBnXkFtZTgwNzc1NjczMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 October 1904","placeOfBirth":" Manhattan, New York, USA","birthName":"Alexander Gerry","bio":"Alex Gerry was born on October 6, 1904 in Manhattan, New York, USA as Alexander Gerry. He was an actor, known for Funny Face (1957), Pillow Talk (1959) and The Bellboy (1960). He was married to Toni Gerry. He died on May 18, 1993 in Ventura County, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NDM2NjE0Ml5BMl5BanBnXkFtZTgwNzc1NjczMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0314778","name":"Alex Gerry","idIMDB":"nm0314778"},"actorId":"nm0314778","character":"George Warren","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nestor Paiva","urlProfile":"http://www.imdb.com/name/nm0656980","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU1NTMzODgxOF5BMl5BanBnXkFtZTgwMzQzNTQ1MjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 June 1905","placeOfBirth":" Fresno, California, USA","birthName":"Nestor Caetano Paiva","bio":"Veteran character actor Nestor Paiva had one of those nondescript ethnic mugs and a natural gift for dialects that allowed him to play practically any type of foreigner. Born in Fresno, California, he graduated from the University of California at Berkeley and developed an interest in performing while hooking up with college theatrics. Making his debut in a production of \"Antigone,\" he played in a Los Angeles production of \"The Drunkard\" for 11 years, finally leaving the show as his workload grew in number and importance in the mid-40s. Film buffs remember him as the main villain, \"The Scorpion\" in the wartime classic serial \"Don Winslow of the Coast Guard\" (1943). In hundreds of film and TV roles from 1938-67 and in an overall career that spanned 40 years, the bald, dark and bulky Paiva played everything from Spaniards, Greeks, Russians and Portuguese to Italians, Indians, Arabs and even African-Americans (the latter on radio). Some were shifty, others excitable, many quite hilarious...and many of them undeserving and small. He died in 1966.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU1NTMzODgxOF5BMl5BanBnXkFtZTgwMzQzNTQ1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0656980","name":"Nestor Paiva","idIMDB":"nm0656980"},"actorId":"nm0656980","character":"Manuel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Forrest Lewis","urlProfile":"http://www.imdb.com/name/nm0507189","urlPhoto":"","biography":{"dateOfBirth":"5 November 1899","placeOfBirth":" Knightstown, Indiana, USA","bio":"Forrest Lewis was born on November 5, 1899 in Knightstown, Indiana, USA. He was an actor, known for All That Heaven Allows (1955), The Absent Minded Professor (1961) and Man's Favorite Sport? (1964). He died on June 2, 1977 in Burbank, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0507189","name":"Forrest Lewis","idIMDB":"nm0507189"},"actorId":"nm0507189","character":"Mr. Weeks","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0047811","urlIMDB":"http://www.imdb.com/title/tt0047811","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"06","month":"01","year":"1955","remarks":null},null],"copyrightHolder":"© Copyright MCMLV by Universal Pictures Company, Inc. All Rights Reserved"},"technical":{"runtime":["1 hr 29 min (89 min)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Color (Eastmancolor and Technicolor)"],"aspectRatio":["2.00 : 1"],"camera":null,"laboratory":["Technicolor, USA (print by) (as Technicolor)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.7","filmingLocations":[{"location":"Circle Drive, Backlot, Universal Studios - 100 Universal City Plaza, Universal City, California, USA"}],"rated":"NOT RATED","awards":[{"award":"National Film Preservation Board, USA 1995","titlesAwards":[{"titleAwardOutcome":"Won National Film Registry","categories":[{"category":"","names":[]}]}]}],"votes":"9,811","type":"Movie","companyCreditsSimple":[{"idCompany":"co0021358","name":"Universal International Pictures (UI)"}],"keywords":{"keywords":["widow","tree","country club","television","new england","gossip","title based on poem","reference to thoreau","suburb","older woman younger man relationship","wound","star crossed lovers","reputation","neighbor","nature","mother son relationship","mother daughter relationship","middle class","melodrama","gardner","family disapproval","engagement","compassion","class differences","bachelor","mill","may december romance","lobster","hunting","home renovation","falling from height","deer","age difference","christmas"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:54:27"}}