{"data":{"movies":[{"title":"The Blues Brothers","originalTitle":"","year":"1980","releaseDate":"19800620","directors":[{"name":"John Landis","id":"nm0000484"}],"writers":[{"name":"Dan Aykroyd","id":"nm0000101"},{"name":"John Landis","id":"nm0000484"}],"runtime":"133 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzdhOTJmYmQtMmE0OS00ZDMyLWFkZDItZmZmMGJlNGUyNjNhXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Comedy","Crime","Music","Musical"],"plot":"After the release of Jake Blues from prison, he and brother Elwood go to visit \"The Penguin\", the last of the nuns who raised them in a boarding school. They learn the Archdiocese will stop supporting the school and will sell the place to the Education Authority. The only way to keep the place open is if the $5000 tax on the property is paid within 11 days. The Blues Brothers want to help, and decide to put their blues band back together and raise the the money by staging a big gig. As they set off on their \"mission from God\" they seem to make more enemies along the way. Will they manage to come up with the money in time?","simplePlot":"Jake Blues, just out from prison, puts together his old band to save the Catholic home where he and brother Elwood were raised.","actors":[{"actorName":"John Belushi","urlProfile":"http://www.imdb.com/name/nm0000004","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MDcwODczOV5BMl5BanBnXkFtZTYwMTk5NzM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 January 1949","placeOfBirth":" Chicago, Illinois, USA","birthName":"John Adam Belushi","height":"5' 8\" (1.73 m)","bio":"John Belushi was born in Chicago, Illinois, USA, on January 24, 1949, to Agnes Demetri (Samaras) and Adam Anastos Belushi, a restaurant owner. His father was an Albanian immigrant, from Qytezë, and his mother was also of Albanian descent. He grew up in Wheaton, where the family moved when he was six. Though a young hellion in grade school, John became the perfect all-American boy during his high school years where he was co-captain of the Wheaton Central High School football team and was elected homecoming king his senior year. He also developed an interest in acting and appeared in the high school variety show. Encouraged by his drama teacher, John decided to put aside his plans to become a football coach to pursue a career in acting. After graduation in 1967, John performed in summer stock in rural Indiana in a variety of roles from \"Cardinal Wolsey\" in \"Anne of a Thousand Days\" to a comic detective in \"Ten Little Indians\". In the fall of his freshman year at the University of Wisconsin at Whitewater, John changed his image into a bad-boy appearance by growing his hair long and began to have problems with discipline and structure of attending classes. Dropping out of Wisconsin, John spent the next two years at the College of DuPage, a junior college a few miles from his parents' Wheaton home, where his father began persuading him to become a partner in his restaurant, but John still preferred acting. While attending DuPage, John helped found the \"West Compass Players\", an improv comedy troupe patterned after Chicago's famous \"Second City\" ensemble. In 1971, John made the leap to \"Second City\" itself where he performed in various on-stage comic performances with others, who included Harold Ramis and Joe Flaherty. John loved his life at \"Second City\" where he performed six nights a week, perfecting the physical \"gonzo\" style of comedy he later made famous. A year later, John and his live-in girlfriend from his high school years, Judith Belushi-Pisano, moved to New York because John had joined the cast of National Lampoon's Lemmings, an off-Broadway rock musical revue that was originally booked for a six-week run but played to full crowds for nearly 10 months. In 1973, John was hired as a writer for the syndicated National Lampoon's Radio Hour which became the National Lampoon Show in 1975. John's big break came that same year when he joined the ground-breaking TV variety series Saturday Night Live (1975) which made him a star. The unpredictable, aggressively physical style of humor that he began on \"Second City\" flowered on SNL. In 1978, while still working on Saturday Night Live (1975), John appeared in the movie Goin' South (1978) which starred and was directed by Jack Nicholson. It was here that director John Landis noticed John and decided to cast him in his movie National Lampoon's Animal House (1978). John's minor role as the notorious, beer-swilling \"Bluto\" made it a box-office smash and the year's top grossing comedy. Despite appearing in only a dozen scenes, John's performance stole the movie, which portrays college fraternity shenanigans at a small college set in the year 1962. In 1979, John along with fellow SNL regular Dan Aykroyd quit the series to pursue movie projects. John and Dan Aykroyd appeared in minor roles in Steven Spielberg's financially unsuccessful 1941 (1979) and, the following year, in John Landis' The Blues Brothers (1980). Around this time, John's drug use began escalating. Cocaine, which was ubiquitous in show-business circles in the 1970's, became his drug of choice. After he first experimented with cocaine in the mid 1970s, John almost immediately became addicted to it. His frequent cocaine sniffing binges became a source of friction between him and Judy, whom he married in 1976. John's love for blues and soul music inspired the \"Blues Brothers\". He and Aykroyd first appeared as Joliet Jake and Elwood Blues, a pair of white soul men dressed in black suits, skinny ties, fedora hats and Rayban sunglasses, as a warm-up act before the telecasts of Saturday Night Live (1975). Building on the success of their acts and the release of their album \"A Briefcase Full of Blues\", John and Dan Aykroyd starred in the movie, which gave John a chance to act with his favorite musical heroes including Ray Charles, James Brown and Aretha Franklin. Although John's reputation for being an off-screen party animal is legendary, his generous side is less well known. Using some of his money, he bought his father a ranch outside San Diego for him to live. John helped set up some of his Chicago friends with their own businesses and even financially helped his younger brother, Jim Belushi, who followed his older brother's path to both \"Second City\" and Saturday Night Live (1975). In 1981, John appeared in the movie Continental Divide (1981), playing a hard-nosed Chicago newspaperman who finds romance in Colorado with eagle expert Blair Brown. That same year, John and Dan Aykroyd appeared again in the movie Neighbors (1981), which gave them a chance to reverse roles, with John playing a straight-arrow family man whose life is turned upside down when a wild family man (Aykroyd) moves in next door. In January 1982, John began work on the screenplay for another movie to be titled \"Noble Rot\". Also, John had checked into a bungalow at the Chateau Marmont, a popular celebrity hotel in Los Angeles. John's drug use had been steadily increasing for over a year now, which alarmed his wife and friends, but he continued to promise Judy that he would quit someday. On March 5, 1982, John Belushi was found dead in his hotel room at the age of 33. The local coroner gave the cause of death as a lethal injection of cocaine and heroin. Several years later, John's drug dealing/drug user companion during his final weeks, Cathy Smith, was tried and sentenced to three years in prison for supplying John with the drugs. Close friend James Taylor sang \"That Lonesome Road\" at a memorial service at Martha's Vineyard cemetery where John was buried.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MDcwODczOV5BMl5BanBnXkFtZTYwMTk5NzM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000004","name":"John Belushi","nicknames":["America's Guest"],"idIMDB":"nm0000004"},"actorId":"nm0000004","character":"'Joliet' Jake Blues","urlCharacter":"http://www.imdb.com/character/ch0151620","main":true},{"actorName":"Dan Aykroyd","urlProfile":"http://www.imdb.com/name/nm0000101","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MDA3NTg0NF5BMl5BanBnXkFtZTYwMzM5ODgz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 July 1952","placeOfBirth":" Ottawa, Ontario, Canada","birthName":"Daniel Edward Aykroyd","height":"6' 1\" (1.85 m)","bio":"Daniel Edward Aykroyd was born on July 1, 1952 in Ottawa, Ontario, Canada, to Lorraine Hélène (Gougeon), a secretary from a French-Canadian family, and Samuel Cuthbert Peter Hugh Aykroyd, a civil engineer who advised prime minister Pierre Trudeau. Aykroyd attended Carleton University in 1969, where he majored in Criminology and Sociology, but he dropped out before completing his degree. He worked as a comedian in various Canadian nightclubs and managed an after-hours speakeasy, Club 505, in Toronto for several years. He worked with Second City Stage Troupe in Toronto and started his acting career at Carleton University with Sock'n'Buskin, the campus theater/drama club. Married to Donna Dixon since 1983, he has two daughters. His parents are named Peter and Lorraine and his brother Peter Aykroyd is a psychic researcher. Dan received an honorary Doctorate from Carleton University in 1994 and was made a Member of the Order of Canada in 1998.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MDA3NTg0NF5BMl5BanBnXkFtZTYwMzM5ODgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000101","name":"Dan Aykroyd","nicknames":["Danny"],"idIMDB":"nm0000101"},"actorId":"nm0000101","character":"Elwood Blues","urlCharacter":"http://www.imdb.com/character/ch0001881","main":true},{"actorName":"James Brown","urlProfile":"http://www.imdb.com/name/nm0113768","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNjg2MTk1Ml5BMl5BanBnXkFtZTYwNTE0NjYz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 May 1933","placeOfBirth":" Barnwell, South Carolina, USA","birthName":"James Joseph Brown","height":"5' 6\" (1.68 m)","bio":"James Brown was born on May 3, 1933 in Barnwell, South Carolina, USA as James Joseph Brown. He was married to Tomirae Brown, Adrienne Rodriguez, Deidre Jenkins and Velma Warren. He died on December 25, 2006 in Atlanta, Georgia, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNjg2MTk1Ml5BMl5BanBnXkFtZTYwNTE0NjYz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0113768","name":"James Brown","nicknames":["The Godfather of Soul","The Minister of the New New Super Heavy Funk","The Hardest Working Man in Show Business","Soul Brother Number One","Mr. Dynamite","The Godfather of Funk","Mr Please Please Please"],"idIMDB":"nm0113768"},"actorId":"nm0113768","character":"Reverend Cleophus James","urlCharacter":"http://www.imdb.com/character/ch0001949","main":true},{"actorName":"Cab Calloway","urlProfile":"http://www.imdb.com/name/nm0130572","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5OTMyNjQ5MF5BMl5BanBnXkFtZTcwODM1MDQwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1907","placeOfBirth":" Rochester, New York, USA","birthName":"Cabell Calloway III","height":"5' 10\" (1.78 m)","bio":"Bandleader, songwriter (\"Minnie the Moocher\", \"Are You Hep to That Jive?\"), composer, singer, actor and author, educated at Crane College. While studying law, he sang with the band The Alabamians, and took over the group in 1928. He led The Missourians orchestra, then organized and led his own orchestra, playing at hotels, theaters and nightclubs throughout the US, and making many records. He joined the cast of the touring company of \"Porgy and Bess\", which performed across the USA and Europe between 1952 and 1954. When that ended, he founded a quartet. Joining ASCAP in 1942, he collaborated musically with Jack Palmer, Buck Ram, Andy Gibson, Clarence Gaskill, Irving Mills and Paul Mills. His other popular song compositions include \"Lady With the Fan\", \"Zaz Zuh Zaz\", \"Chinese Rhythm\", \"Are You In Love With Me Again?\", \"That Man's Here Again\", \"Peck-A-Doodle-Doo\", \"I Like Music\", \"Rustle of Swing\", \"Three Swings and Out\", \"The Jumpin' Jive\", \"Boog It\", \"Come on with the Come-on\", \"Silly Old Moon\", \"Sunset\", \"Rhapsody in Rhumba\", \"Are You All Reet?\", \"Hi-De-Ho Man\", \"Levee Lullaby\", \"Let's Go, Joe\", \"Geechy Joe\", and \"Hot Air\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5OTMyNjQ5MF5BMl5BanBnXkFtZTcwODM1MDQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0130572","name":"Cab Calloway","nicknames":["The \"King of Hi-De-Ho\""],"idIMDB":"nm0130572"},"actorId":"nm0130572","character":"Curtis","urlCharacter":"http://www.imdb.com/character/ch0001963","main":true},{"actorName":"Ray Charles","urlProfile":"http://www.imdb.com/name/nm0153124","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5Nzk0NDcyMV5BMl5BanBnXkFtZTYwNDg3OTU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 September 1930","placeOfBirth":" Albany, Georgia, USA","birthName":"Raymond Charles Robinson","height":"5' 9\" (1.75 m)","bio":"A tragic fate may have given this visionary a heightened sensitivity, perception, awareness, even expansion to his obvious musical gifts that he may have never touched upon had he not suffered from his physical affliction. Whatever it was, Ray Charles revolutionized American music and was catapulted to legendary status by the time he died in Beverly Hills at age 73. Born to Aretha and Baily Robinson, an impoverished Albany, Georgia, family that moved to Greenville, Florida while he was still an infant. It was not a cause for joy and celebration. His father soon abandoned the family and his baby brother, George Robinson, drowned in a freak washtub accident. Ray himself developed glaucoma at the age of five and within two years had lost his sight completely. A singer in a Baptist choir, he developed a love and feel for rhythms and studied music at the State School for Deaf and Blind Children, showing which brought out his talent and ear for playing various instruments, including the piano and clarinet. An orphan by his early teens, Ray joined a country band at age 16 called The Florida Playboys. He moved to Seattle in 1948 where he and Southern guitarist Gossady McGee formed the McSon Trio. With an emphasis on easy-styled jazz, Ray also played in bebop sessions on the sly. He departed from the McSon Trio and signed with Los Angeles-based Swing Time Records, becoming the pianist for rhythm and blues great Lowell Fulson and his band. Atlantic Records eventually picked him up. Along the road he would add composer, writer and arranger to his formidable list of talents. Ray's first R&B hit was \"Confession Blues\" in Los Angeles in 1949. In 1951, he had his first solo chart buster with \"Baby Let Me Hold Your Hand\". His amazing versatility and raw, soulful delivery quickly caught on with audiences and helped put Atlantic Records on the map. Hits like \"Mess Around\", \"Things I Used to Do\", \"A Fool for You\", \"I've Got a Woman\", \"Drown in My Own Tears\", and especially \"What'd I Say\" in 1959, pushed gospel and R&B to a wider crossover audience. He made a move into the country music arena--unheard of for a black singer--in the 1960s, doing soulful spins on Hank Williams and Eddy Arnold tunes. In 1960, he left Atlantic and signed with ABC-Paramount. Under ABC-Paramount, hits poured out during this peak time with \"I Can't Stop Loving You\", \"Hit the Road Jack\", \"Busted\" and his beloved signature song \"Georgia On My Mind\". His landmark 1962 album \"Modern Sounds in Country and Western Music\" brought a new swinging style to country music. From there, he traveled a mainstream route--from interpreting songs from The Beatles (\"Eleanor Rigby\") to appearing in \"Diet Pepsi\" ads (\"You Got the Right One, Baby, Uh-huh!\"). He also showed up sporadically in films, playing himself in the movie Ballad in Blue (1965) and guest-starring in The Blues Brothers (1980) with Dan Aykroyd and John Belushi. A television musical variety favorite with his trademark dark sunglasses and dry humor, he worked alongside such musical legends as Ella Fitzgerald and Barbra Streisand on their very special evenings of song. It is hard to believe that with everything he accomplished, Ray also had to deal with a longstanding heroin problem. In the mid-1960s, he was arrested for possession of heroin and marijuana and revealed that he had been addicted for nearly two decades. By 1965, he had completely recovered. The man who lived life on the edge was divorced twice and had 12 children both in and outside his marriages. At the time of his death from liver disease in 2004, he was working on a recording project of duets with such performers as Willie Nelson, Bonnie Raitt, B.B. King, Elton John and Norah Jones. This collaboration entitled \"Genius Loves Company\" led to an incisive win at the Grammy Awards--eight posthumous trophies including \"Album of the Year\" and \"Record of the Year\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5Nzk0NDcyMV5BMl5BanBnXkFtZTYwNDg3OTU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0153124","name":"Ray Charles","nicknames":["The Genius of Soul","Brother Ray","The High Priest"],"idIMDB":"nm0153124"},"actorId":"nm0153124","character":"Ray","urlCharacter":"http://www.imdb.com/character/ch0001939","main":true},{"actorName":"Aretha Franklin","urlProfile":"http://www.imdb.com/name/nm0291349","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MTUwNzg5M15BMl5BanBnXkFtZTYwNzQ1NjU1._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 March 1942","placeOfBirth":" Memphis, Tennessee, USA","birthName":"Aretha Louise Franklin","height":"5' 5\" (1.65 m)","bio":"Several Grammy award wins, the first women to be inducted into the Rock And Roll Hall Of Fame, and dubbed as the Queen Of Soul. Aretha Louise Franklin was born in Memphis, Tennessee, USA. Aretha was born to parents, Barbra Singers homemaker, and Clarence Franklin a baptist minster. Aretha Franklin started to sing due to her father being a minister. Clarence Franklin was one of the most respected and prominent ministers in the country, because of this she grew up surrounded by local and national celebrities. Franklin learned how to play piano by ear and soon understood the correct tones and pitches needed for songs. Aretha Franklin released her first single at the age of 18, under Columbia Records, it reached number ten on the BillBoard charts and her first record was released in January of 1961. Aretha Franklin while working for the label managed to score two more R&B hits, Operation Heartbreak and Won't Be Long. However the people at Columbia Records often felt they didn't understand the direction Aretha wanted to go with her music, and felt they ultimately failed to bring out the potential she had. Franklin in 1966 signed a contract with Atlantic Records, this would be where she released her first legendary single with the label called, Respect written by The King Of Soul, Otis Redding. With this single, Franklin would trigger a new vocal skill called, \"call and response\". This new skill with backup singer would help liven many of her singles. While being signed with Atlantic Records what followed was three additional top ten hits, Baby I Love You, A Natural Women,and Chain Of Fools. Franklin would also win her first two Grammy awards while being associate with Atlantic Records, and eight consecutive Grammys for best female R&B vocal category. Franklin had not only achieved her dream of becoming a musical sensation but stood out as a significant person in the civil rights movement for her single with Otis Redding, Respect. The song helped send a message to Americans of equality,peace,and justice. In the sixties Franklin continued to release Pop hits such as Think, I Say A Little Prayer, and Ain't No Way. After these amazing hits to many listeners she was seen as The Queen Of Soul. In the 1970's she started releasing more gospel hits such as Don't Play That Song,Rocksteady, and Daydreaming. It was foreseeable that Franklin would soon stumble upon a masterpiece which would be the best selling gospel album of all time, which she did in 1972 with her album, Amazing Grace. In the mid 70's even though she was releasing hit songs, she soon began to lose touch with her soul-pop audiences due to the disco genre making it's entrance into mainstream music. In 1979 she released an album in order to gain the audience of disco lovers called, La Diva. La Diva sold less than 50,000 copies and was marked as the lowest point in Franklin's career. In June,10,1979 her father, Clarence Franklin was shot by a mugger, this left Clarence Franklin in a comma for five years and Aretha decided to move back to Detroit to take care of her father. Clarence Franklin died on July,27,1984. In 1980 along with several other musicians such as Ray Charles and James Brown, Aretha Franklin appeared in the hit-movie, The Blues Brothers. In 1982 she soon returned to the R&B top ten charts with her hit album, Jump To It featuring Luther Vandross. It sold more than 600,000 copies and was gold-certified managing to stay on number one for seven weeks. AIn 1985 Franklin released an album which featured an unique never before heard element of rock. The album was called \"Who's Zoomin Who?\" and soon went on to receive platinum certified success. The album also featured a hit-song with George Michael called, I Know You Were Waiting For Me and the album went on to sell more than one million copies. In 1987, Aretha Franklin sang the theme song to the sitcom created by Bill Cosby, A Different World. In 1989 she released a pop album which featured Elton John,James Brown, The Four Tops, Kenny G,and Whitney Houston called Through The Storm. In 1992 Aretha Franklin sang the song Someday We'll All Be Free to the soundtrack to the biopic movie, Malcolm X. Aretha Franklin in 1993 sang at Bill Clinton's inauguration. Franklin at a slower rate in the mid-late 90's continued to release albums and singles working with new artists such as BabyFace,Jermaine Dupri,Sean \"P Diddy\" Combs,and Lauryn Hill along with her label, Arista Records. In 2003, she had ended the 23 year relationship with being apart of the Arista label and opened her own label called, Aretha. Franklin released her first album on the label called, A Woman Falling Out Of Love in 2011, it marked her fifty years in show business. Aretha Franklin will be known as one of the most influential singers of all time, Aretha Franklin will not only be seen as a tremendous singer but as an activist who talked about the world through her music, and used music as the tool for truth, justice, and soul.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MTUwNzg5M15BMl5BanBnXkFtZTYwNzQ1NjU1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0291349","name":"Aretha Franklin","nicknames":["The Queen of Soul"],"idIMDB":"nm0291349"},"actorId":"nm0291349","character":"Mrs. Murphy","urlCharacter":"http://www.imdb.com/character/ch0001954","main":true},{"actorName":"Steve Cropper","urlProfile":"http://www.imdb.com/name/nm0188936","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NzM5MjQ2OF5BMl5BanBnXkFtZTYwODAxOTM1._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 October 1941","placeOfBirth":" Willow Springs, Missouri, USA","birthName":"Stephen Lee Cropper","height":"6' 1\" (1.85 m)","bio":"If not the most influential guitarist in the Memphis soul music scene, Steve Cropper is definitely near the top. He was a member of 'Booker T & the M.G.s', wrote songs for and performed with Otis Redding, Aretha Franklin and Sam & Dave (he's the Steve referred to when they say \"Play it, Steve!\" in \"Soul Man\"). Booker T's band, including Cropper, was enlisted as the backup band for Blues Brothers John Belushi and Dan Aykroyd in both of the \"Blues Brothes\" movies.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NzM5MjQ2OF5BMl5BanBnXkFtZTYwODAxOTM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0188936","name":"Steve Cropper","nicknames":["The Colonel"],"idIMDB":"nm0188936"},"actorId":"nm0188936","character":"Steve 'The Colonel' Cropper","urlCharacter":"http://www.imdb.com/character/ch0053261","main":true},{"actorName":"Donald Dunn","urlProfile":"http://www.imdb.com/name/nm0242551","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyODM5MTU0MF5BMl5BanBnXkFtZTcwNTI5ODM3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 November 1941","placeOfBirth":" Memphis, Tennessee, USA","bio":"Donald Dunn was born on November 24, 1941 in Memphis, Tennessee, USA. He was married to June. He died on May 13, 2012 in Tokyo, Japan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyODM5MTU0MF5BMl5BanBnXkFtZTcwNTI5ODM3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0242551","name":"Donald Dunn","nicknames":["Duck"],"idIMDB":"nm0242551"},"actorId":"nm0242551","character":"Donald 'Duck' Dunn","urlCharacter":"http://www.imdb.com/character/ch0001981","main":true},{"actorName":"Murphy Dunne","urlProfile":"http://www.imdb.com/name/nm0242886","urlPhoto":"","biography":{"dateOfBirth":"22 June 1942","placeOfBirth":" Chicago, Illinois, USA","bio":"Murphy Dunne was born on June 22, 1942 in Chicago, Illinois, USA. He is an actor, known for The Blues Brothers (1980), Glengarry Glen Ross (1992) and The Mothman Prophecies (2002). He is married to Kristine. They have one child.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0242886","name":"Murphy Dunne","idIMDB":"nm0242886"},"actorId":"nm0242886","character":"Murphy 'Murph' Dunne","urlCharacter":"http://www.imdb.com/character/ch0001979","main":true},{"actorName":"Willie Hall","urlProfile":"http://www.imdb.com/name/nm0356226","urlPhoto":"","biography":{"dateOfBirth":"8 August 1950","placeOfBirth":" Memphis, Tennessee, USA","bio":"Willie Hall was born on August 8, 1950 in Memphis, Tennessee, USA. He is an actor, known for The Blues Brothers (1980), Black Snake Moan (2006) and Blues Brothers 2000 (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0356226","name":"Willie Hall","idIMDB":"nm0356226"},"actorId":"nm0356226","character":"Willie 'Too Big' Hall","urlCharacter":"http://www.imdb.com/character/ch0001984","main":true},{"actorName":"Tom Malone","urlProfile":"http://www.imdb.com/name/nm0540519","urlPhoto":"","biography":{"dateOfBirth":"16 June 1947","placeOfBirth":" Hattiesburg, Mississippi, USA","height":"6' 3\" (1.91 m)","bio":"Tom Malone was born on June 16, 1947 in Hattiesburg, Mississippi, USA. He is known for his work on Saturday Night Live (1975), Sister Act (1992) and A Very Murray Christmas (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0540519","name":"Tom Malone","idIMDB":"nm0540519"},"actorId":"nm0540519","character":"Tom 'Bones' Malone","urlCharacter":"http://www.imdb.com/character/ch0047111","main":true},{"actorName":"Lou Marini","urlProfile":"http://www.imdb.com/name/nm0547678","urlPhoto":"","biography":{"dateOfBirth":"13 May 1945","placeOfBirth":" Charleston, South Carolina, USA","bio":"Graduated at a small school named Fairless High School which is in Navarre, Ohio where he was known as Lou Marini Jr. His dad Lou Marini wrote the school's alma mater. Later a graduate of North Texas State University.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0547678","name":"Lou Marini","idIMDB":"nm0547678"},"actorId":"nm0547678","character":"'Blue Lou' Marini","urlCharacter":"http://www.imdb.com/character/ch0053262","main":true},{"actorName":"Matt Murphy","urlProfile":"http://www.imdb.com/name/nm0614506","urlPhoto":"","biography":{"dateOfBirth":"27 December 1929","placeOfBirth":" Sunflower, Mississippi, USA","birthName":"Matthew Murphy","bio":"Born in Sunflower, Mississippi, in 1929, Matt \"Guitar\" Murphy is known as one of the most respected sidemen in the blues. He has played on albums and in concerts for everyone from Memphis Slim and James Cotton to 'Bobby Blue Bland' and Junior Parker (he even made an appearance in The Blues Brothers (1980)). Unlike many sidemen, however, he cut very few records on his own, and it wasn't until 1990 that he released his first album, \"Way Down South\".","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0614506","name":"Matt Murphy","idIMDB":"nm0614506"},"actorId":"nm0614506","character":"Matt 'Guitar' Murphy","urlCharacter":"http://www.imdb.com/character/ch0001978","main":true},{"actorName":"Alan Rubin","urlProfile":"http://www.imdb.com/name/nm0747999","urlPhoto":"","biography":{"dateOfBirth":"11 February 1943","placeOfBirth":" Brooklyn, New York City, New York, USA","bio":"Alan Rubin was born on February 11, 1943 in Brooklyn, New York City, New York, USA. He is known for his work on Saturday Night Live (1975), The Blues Brothers (1980) and The Wiz (1978). He was married to Mary Moreno Rubin. He died on June 8, 2011 in Manhattan, New York City.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0747999","name":"Alan Rubin","idIMDB":"nm0747999"},"actorId":"nm0747999","character":"Alan 'Mr. Fabulous' Rubin","urlCharacter":"http://www.imdb.com/character/ch0001985","main":true},{"actorName":"Carrie Fisher","urlProfile":"http://www.imdb.com/name/nm0000402","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4ODU5MDY4MV5BMl5BanBnXkFtZTgwODY1MjQ5MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 October 1956","placeOfBirth":" Burbank, California, USA","birthName":"Carrie Frances Fisher","height":"5' 1\" (1.55 m)","bio":"Carrie Frances Fisher was born on October 21, 1956 in Beverly Hills, Los Angeles, California, to singers/actors Eddie Fisher and Debbie Reynolds. She was an actress and writer, and is known for Star Wars: Episode IV - A New Hope (1977) (aka Star Wars: Episode IV - A New Hope (1977)), Star Wars: Episode V - The Empire Strikes Back (1980) and Star Wars: Episode VI - Return of the Jedi (1983). Fisher is also known for her book, \"Postcards From The Edge\", and Fisher wrote the screenplay for the movie from her novel. Carrie Fisher and talent agent Bryan Lourd have a daughter, Billie Lourd (Billie Catherine Lourd), born on July 17, 1992.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4ODU5MDY4MV5BMl5BanBnXkFtZTgwODY1MjQ5MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000402","name":"Carrie Fisher","idIMDB":"nm0000402"},"actorId":"nm0000402","character":"Mystery Woman","urlCharacter":"http://www.imdb.com/character/ch0001882","main":true}],"seasons":[],"idIMDB":"tt0080455","urlIMDB":"http://www.imdb.com/title/tt0080455","business":{"budget":{"money":"$27,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$4,858,152","country":"USA","day":"22","month":"06","year":"1980","remarks":"594 Screens"}],"gross":[{"money":"$4,858,152","country":"USA","day":"22","month":"06","year":"1980","remarks":""},{"money":"$115,229,890 (Worldwide)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"SEK","country":"5,374,647","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":[{"money":"$4,858,152","country":"USA","day":"22","month":"06","year":"1980","remarks":"594 Screens"}],"admissions":[],"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":[{"money":null,"country":null,"day":"01","month":"02","year":"1980","remarks":null},null],"copyrightHolder":"1980 Universal City Studios, Inc."},"technical":{"runtime":["2 hr 13 min (133 min)","2 hr 28 min (148 min) (extended) (USA)"],"soundMix":["4-Track Stereo (magnetic prints)","Mono (optical prints)"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Panaflex"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":["3,650 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["70 mm (UK release)","D-Cinema (2012 re-release)","35 mm"]},"rating":"7.9","filmingLocations":[{"location":"1623 S. 51st Court, Cicero, Illinois, USA"}],"rated":"R","awards":[{"award":"Motion Picture Sound Editors, USA 1981","titlesAwards":[{"titleAwardOutcome":"Won Golden Reel Award","categories":[{"category":"Best Sound Editing - Sound Effects","names":[]}]}]}],"votes":"148,900","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"}],"keywords":{"keywords":["parolee","band","money","catholic","prison","singer","police","taxes","nun","crowd","mob","highway travel","roadtrip","joy","m 16","threatened with a gun","jilted lover","jilted woman","record executive","musical number","musical performance","harmonica","male in women's restroom","gas station attendant","alcohol","out of gas","city","bare chested male","meeting in a sauna","wearing sunglasses at night","wearing sunglasses inside","usa","american nazi","raising money","needing money","lack of money","money problems","dispute","beer bottle","black suit","civic center chicago","farce","shooting at the camera","quitting a job","musical group","band the musical group","laughter","truck explosion","gas station explosion","building explosion","ex boyfriend ex girlfriend relationship","calumet city illinois","pay phone","three word title","italian american","redemption","friendship","music producer","running out of gas","englishwoman abroad","convenience store","sabotage","amateur radio","ham radio","attempted robbery","female bartender","tattoo","factory","luger","priest","motel","american flag","bowler hat","race against time","construction site","on the run","deception","pipe smoking","cigar smoking","cigarette smoking","whip","chef","handcuffs","flood","warehouse","drum kit","guitar","trumpet","protest","swastika","preacher","divine intervention","ballroom","hotel","phone booth","southern accent","black comedy","sniper rifle","sniper","shotgun","cameo","montage","revenge","anti hero","ex convict","f word","release from prison","blockade","flare","wristwatch","car rollover","police car","car pileup","police vigilantism","revolver","pistol","axe","fire truck","firefighter","ambulance","police station","police officer","state trooper","u.s. army","soldier","buddy","on the road","road trip","record player","detonator","blowtorch","group of friends","song","singing","runaway","gasoline","mass destruction","destruction","sidewalk","rocket launcher","explosion","escape","running","shooting","car crash","smiling","dangerous driving","talking while driving","car driving","looking at the camera","singing to the camera","firearm pointed at the camera","violence","man with glasses","written and directed by cast member","1980s","nazi paraphernalia","church","body odor","catholic orphanage","carsploitation","car crashes into a building","illinois","guard","blindness","polished fingernails","mystery woman","used condom","unpaid taxes","tuxedo","toast","toaster","toaster oven","sunglasses","street music","stairs","running through a plate glass window","rock concert","rifle","record contract","prisoner","prison guard","poster","piano","parole","organ","office","office building","maitre d'","machine gun","loudspeaker","loan","jumping off a bridge","janitor","jailhouse","husband wife relationship","guitar man","government worker","government official","glass","flamethrower","fiancee","fancy restaurant","ex fiancee","desk","dedication","country and western","chicken","champagne","cash","car","canadian","cafe","brother brother relationship","broken window","broken glass","bridge","bottle","blind man","bikini","beer","beach","barbecue","automatic weapon","attempted murder","assault","assault rifle","arrest","roman catholic","catholic church","funny nazi","falling down stairs","racial slur","obscene finger gesture","blockbuster","spurned woman","concert","music store","holiday inn","lounge singer","soul music","restaurant","swat team","tunnel","wagner ride of the valkyries","8 track","car chase","car accident","traffic violation","roadhouse","jumping into water","neo nazi","chicago illinois","bomb","country music","drawbridge","reckless driving","police chase","white supremacist","elevator","wrigley field","impersonation","el train","building collapse","sauna","diner","chase","based on sketch comedy","blues music","winnebago","car stunt","picasso sculpture chicago","dancing","orphanage","falling from height","gas station","shopping mall","cult film","bar","based on tv series","condom","character name in title","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:23:59"}}