{"data":{"movies":[{"title":"Hi-Riders","originalTitle":"","year":"1978","releaseDate":"197805","directors":[{"name":"Greydon Clark","id":"nm0163990"}],"writers":[{"name":"Greydon Clark","id":"nm0163990"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNjczOTEwMl5BMl5BanBnXkFtZTYwNDU0Njg5._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Crime","Drama"],"plot":"A couple scam a Hi-Rider out of some cash during a drag race, and when he refuses to pay, they track him down to the gang's hideout. Lucky for them the leader is a good, reasonable guy, and the couple start hanging out with the gang. However, after a fatal collision of the son of the \"big man in town\" during a race, the gang has to fight for their lives against the man's legion of hillbillies.","simplePlot":"Story of a group of drag races and the young boy and girl who join them.","actors":[{"actorName":"Mel Ferrer","urlProfile":"http://www.imdb.com/name/nm0002072","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0Njc1MzI4MF5BMl5BanBnXkFtZTcwODk0NDg5Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1917","placeOfBirth":" Elberon, New Jersey, USA","birthName":"Melchior Gaston Ferrer","height":"6' 3\" (1.91 m)","bio":"Actor/director/producer Mel Ferrer was born Melchor Gaston Ferrer on August 25, 1917, in Elberon, New Jersey. The son of a Cuban-born surgeon and a Manhattan socialite, he went to prep school and attended Princeton University. From the age of 15 he worked in summer stock. After Princeton he became an editor on a small Vermont newspaper and wrote a children's book, \"Tito's Hats.\" He became a chorus dancer on Broadway in 1938 in two musicals and made his New York debut as an actor two years later. After a bout with polio he started in radio as a disc jockey in Texas and Arkansas and rose to producer-director of top-rated shows for NBC in New York. He made a modest debut as a director at Columbia with the low-budget The Girl of the Limberlost (1945), then returned to acting on Broadway to star in Lillian Smith's \"Strange Fruit.\" He was John Ford's assistant on The Fugitive (1947). Ferrer made his screen acting debut in Lost Boundaries (1949). He is best remembered for the role of the lame puppeteer in Lili (1953) and as Prince Andrei in War and Peace (1956). He directed Claudette Colbert in The Secret Fury (1950) and Audrey Hepburn - his wife at the time - in Green Mansions (1959). Ferrer produced the hit Wait Until Dark (1967), also with Hepburn. In the following year, the couple separated and ultimately divorced. Since 1960 had been producing and acting mainly in Europe.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0Njc1MzI4MF5BMl5BanBnXkFtZTcwODk0NDg5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002072","name":"Mel Ferrer","idIMDB":"nm0002072"},"actorId":"nm0002072","character":"Sheriff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen McNally","urlProfile":"http://www.imdb.com/name/nm0573640","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzY4NmJkYTktOGJlNi00YmQwLWIyMjUtYzEwODljNDU2Y2Q0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1911","placeOfBirth":" New York City, New York, USA","birthName":"Horace Vincent McNally","height":"5' 11½\" (1.82 m)","bio":"\"B\" actor Stephen McNally forsook a thriving career as a practicing attorney in the late 1930s when he made the decision to switch gears and pursue acting, which he did avidly. He began his career on stage using his real name of Horace McNally and earned minor status in World War II-era films as both a minor hero and heavy. In 1946 his career took a boost when he changed his stage name to Stephen McNally and carved out a niche as both villains and \"tough guy\" heroes. He was notably despicable in the Jane Wyman starrer Johnny Belinda (1948) and in Winchester '73 (1950) with James Stewart. His heroes fell into such secondary adventures as City Across the River (1949) and Air Cadet (1951). McNally continued duking it out with the leads in other 1950s fare, often for Universal Pictures, such as No Way Out (1950), Battle Zone (1952), the somewhat bizarre Don Siegel western The Duel at Silver Creek (1952), A Bullet Is Waiting (1954), Violent Saturday (1955), Tribute to a Bad Man (1956) and Johnny Rocco (1958). In the long run he proved much more interesting when his character had little redeeming qualities. He starred in a couple of TV series following his wave of movie-making but none of them really stuck and his name never became etched into the minds of audiences.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzY4NmJkYTktOGJlNi00YmQwLWIyMjUtYzEwODljNDU2Y2Q0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0573640","name":"Stephen McNally","nicknames":["Steve"],"idIMDB":"nm0573640"},"actorId":"nm0573640","character":"Mr. Lewis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Darby Hinton","urlProfile":"http://www.imdb.com/name/nm0385976","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMjIzODEzNl5BMl5BanBnXkFtZTgwNDk3Nzg2MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 August 1957","placeOfBirth":" Santa Monica, California, USA","birthName":"Edgar Raymond Darby Hinton","bio":"Darby Hinton made his acting debut at the age of 6months and as a child actor appeared in many commercials, films, tv series.He attended high school at the American School in Lugano, Switzerland, and then went to college on the World Campus Afloat Institute for Shipboard Education.This was a cruise ship that traveled the world to study different societies.He returned to California to continue his studies at Pepperdine University while continuing to make tv appearances.One of Darby's great interests is the martial arts, and he is skilled in the JKD concept of fighting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMjIzODEzNl5BMl5BanBnXkFtZTgwNDk3Nzg2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0385976","name":"Darby Hinton","idIMDB":"nm0385976"},"actorId":"nm0385976","character":"Mark","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ralph Meeker","urlProfile":"http://www.imdb.com/name/nm0576127","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDUyMTg5MjA2MF5BMl5BanBnXkFtZTcwNzUxMjMxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 November 1920","placeOfBirth":" Minneapolis, Minnesota, USA","birthName":"Ralph Rathgeber","height":"6' 1\" (1.85 m)","bio":"Burly American character actor Ralph Meeker first acted on stage at his Alma mater, Northwestern University, alongside other budding performers Charlton Heston and Patricia Neal. He graduated as a music major, because his dean had discouraged him from pursuing a theatrical career. Ignoring that advice, Meeker nevertheless moved to New York to study method acting and performing in local stock companies. After being injured during a brief wartime stint with the navy and consequently discharged from active duty, Meeker went overseas to play his part in entertaining the troops as a member of the USO. He finally 'arrived' on Broadway in 1945 and was given small roles in two plays produced by 'Jose Ferrer (I)', making his debut in \"Strange Fruit\". He was still relatively unknown in 1947 when he replaced Marlon Brando as Stanley Kowalski in \"A Streetcar Named Desire\" two years later, giving a commanding and critically acclaimed performance. After playing Kowalski in the touring company of 'Streetcar', Meeker was further noticed for his part in the original production of \"Mister Roberts\" . As a result, he had several European motion picture offers and selected to play the role of an army sergeant in Teresa (1951), co-starring Pier Angeli. That same year, he was in another continental drama, shot on location in Switzerland, Four in a Jeep (1951). After a two-year sojourn at MGM, Meeker returned to Broadway to star as the swaggering, likeable, larger-than-life rogue Hal Carter, in William Inge's play \"Picnic\" on Broadway. His performance was not only highly praised by reviewers like Brooks Atkinson, but also won him the New York Critics Circle Award. In later years, Meeker claimed to have spurned Columbia's offer of reprising his role on screen because he disdained being shackled by a studio contract. In any case, the prize role went to William Holden and Meeker was consigned (with the odd exception) to playing hard- nosed guys on either side of the law - or bullies with a yellow streak - as a supporting actor over the next thirty years. He did, however, leave his mark with several top-notch performances. One of his best early screen roles was that of the disgraced ex-Union officer Roy Anderson in Anthony Mann's brilliant revenge western The Naked Spur (1953). As one of four men stripped of humanity by greed and hatred (the others were James Stewart, Robert Ryan and Millard Mitchell), Ralph Meeker gave a convincing portrayal of a cynical and callous opportunist. Meeker's defining role was that of Mike Hammer in Kiss Me Deadly (1955). The film was unusual, in that Hammer was played, unlike any private detectives of previous films noir, as a basically unsavoury character - one of the first of the anti-heroes which began to appear in films of the 1960's. Under the direction of Robert Aldrich, Meeker's characterisation as Mike Hammer effectively contrasted a smooth, handsome facade with an undercurrent of arrogance, unmitigated ruthlessness and greed. When the film was released, it ran into censorship trouble, the Kefauver Commission labelling it the Number One Menace to American Youth for 1955. While \"Kiss Me Deadly\" acquired a cult following over the years, it certainly failed to advance the career of Ralph Meeker. He did, however, manage to get second billing for the part of Corporal Paris, one of three World War I French infantry men randomly selected for execution (because their regiment had refused a suicidal mission), in Stanley Kubrick's harrowing anti-war drama Paths of Glory (1957). He gave another finely etched performance through his character's gradual deterioration from swaggering bravado to abject fear. Also that year, Meeker played a snarling, Indian-hating Yankee officer in Run of the Arrow (1957) and co-starred as Jane Russells unlikely kidnapper in the failed Norman Taurog comedy The Fuzzy Pink Nightgown (1957). In between numerous television appearances during the 1960's, Meeker returned to the stage as member of the Lincoln Centre Repertory Theatre, where he was reunited with Elia Kazan (who had directed him in 'Streetcar') to act in Arthur Miller's play \"After the Fall\" (1964-65). He also worked with Robert Aldrich again, playing George 'Bugs' Moran (who Meeker allegedly resembled), the Chicago mobster whose gang was wiped out by 'Al Capone (I)' in The St. Valentine's Day Massacre (1967). After the decline of the studio system, Meeker found much gainful employment in television and even had his own syndicated series, Not for Hire (1959), playing a tough Honolulu investigator. However, the show came up against the similarly themed Hawaiian Eye (1959) and only ran to 39 episodes. Meeker then guest-starred on numerous other shows and had noteworthy roles as, among others, a boorish tycoon who discovers a prehistoric amphibious creature in The Outer Limits (1963) episode \"The Tourist Attraction\"; an ex-cop turned derelict in Ironside (1967) ('Price Tag: Death Details'); and FBI agent Bernie Jenks in the TV pilot of The Night Stalker (1972). Add to that a gallery of snarling or harassed law enforcers from The Girl on the Late, Late Show (1974) to Brannigan (1975) and episodes of Harry O (1973), The Rookies (1972) and Police Story (1973). Ralph Meeker remained a much- in-demand character actor until his death of a heart attack in August 1988.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDUyMTg5MjA2MF5BMl5BanBnXkFtZTcwNzUxMjMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0576127","name":"Ralph Meeker","idIMDB":"nm0576127"},"actorId":"nm0576127","character":"Mike","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Neville Brand","urlProfile":"http://www.imdb.com/name/nm0104507","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNzUyNzA3M15BMl5BanBnXkFtZTcwMTMyODg0NA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 August 1920","placeOfBirth":" Griswold, Iowa, USA","height":"5' 10\" (1.78 m)","bio":"Neville Brand joined the US Army in 1939, bent on a career in the military. It was while he was in the army that he made his acting debut, in Army training films, and this experience apparently changed the direction of his life. Once a civilian again, he used his GI Bill education assistance to study drama with the American Theater Wing and then appeared in several Broadway plays. His film debut was in Port of New York (1949). Among his earliest films was the Oscar-winning Stalag 17 (1953). His heavy features and gravelly voice made Brand a natural tough guy (and he wasn't just a \"movie\" tough guy--he was among the most highly decorated American soldiers in World War II, fighting in the European Theater against the Germans). \"With this kisser, I knew early in the game I wasn't going to make the world forget Clark Gable,\" he once told a reporter. He played Al Capone in The George Raft Story (1961), The Scarface Mob (1959), and TV's The Untouchables (1959). Among his other memorable roles are the sympathetic guard in Birdman of Alcatraz (1962) and the representative of rioting convicts in Riot in Cell Block 11 (1954). Perhaps his best-known role was that of the soft-hearted, loud-mouthed, none-too-bright but very effective Texas Ranger Reese Bennett of Backtrack! (1969), Three Guns for Texas (1968), and TV's Laredo (1965).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNzUyNzA3M15BMl5BanBnXkFtZTcwMTMyODg0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0104507","name":"Neville Brand","idIMDB":"nm0104507"},"actorId":"nm0104507","character":"Red","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Diane Peterson","urlProfile":"http://www.imdb.com/name/nm0677119","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4OTA0OTQ3M15BMl5BanBnXkFtZTcwMTQyMzE2OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Diane Peterson is known for her work on Titanic (1997), The Green Hornet (2011) and Universal Soldier (1992).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4OTA0OTQ3M15BMl5BanBnXkFtZTcwMTQyMzE2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0677119","name":"Diane Peterson","idIMDB":"nm0677119"},"actorId":"nm0677119","character":"Lynn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wm. J. Beaudine","urlProfile":"http://www.imdb.com/name/nm1568936","urlPhoto":"","biography":{"dateOfBirth":"29 October 1950","placeOfBirth":" Chicago, Illinois, USA","height":"5' 11\" (1.8 m)","bio":"Wm. J. Beaudine was born on October 29, 1950 in Chicago, Illinois, USA. He was an actor, known for Hi-Riders (1978). He died on February 4, 2016 in Tucson, Arizona, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1568936","name":"Wm. J. Beaudine","idIMDB":"nm1568936"},"actorId":"nm1568936","character":"T.J.","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karen Fredrik","urlProfile":"http://www.imdb.com/name/nm0292995","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2NjI0MjY4NV5BMl5BanBnXkFtZTcwNzU3MDk2Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Karen Fredrik is an actress, known for General Hospital (1963), Days of Our Lives (1965) and Sunset Cove (1978).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2NjI0MjY4NV5BMl5BanBnXkFtZTcwNzU3MDk2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0292995","name":"Karen Fredrik","idIMDB":"nm0292995"},"actorId":"nm0292995","character":"Angie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roger Hampton","urlProfile":"http://www.imdb.com/name/nm0359047","urlPhoto":"","biography":{"dateOfBirth":"12 April 1945","placeOfBirth":" California, USA","birthName":"Roger Allen Hampton","bio":"Roger Hampton was born on April 12, 1945 in California, USA as Roger Allen Hampton. He was an actor, known for Halloween II (1981), Critters (1986) and Mulligans! (1997). He died on September 15, 2012 in California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0359047","name":"Roger Hampton","idIMDB":"nm0359047"},"actorId":"nm0359047","character":"Billy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brad Rearden","urlProfile":"http://www.imdb.com/name/nm0714087","urlPhoto":"","biography":{"bio":"Brad Rearden is an actor, known for The Terminator (1984), A Family Upside Down (1978) and The Silent Scream (1979).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0714087","name":"Brad Rearden","idIMDB":"nm0714087"},"actorId":"nm0714087","character":"Toad","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carl LaBove","urlProfile":"http://www.imdb.com/name/nm0479633","urlPhoto":"","biography":{"bio":"Carl LaBove is an actor and producer, known for Jumpin' Jack Flash (1986), Em & Me (2004) and Hi-Riders (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0479633","name":"Carl LaBove","idIMDB":"nm0479633"},"actorId":"nm0479633","character":"Freddie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Donovan O'Donnell","urlProfile":"http://www.imdb.com/name/nm0640812","urlPhoto":"","biography":{"bio":"Michael Donovan O'Donnell is known for his work on Dick Tracy (1990), Vixen! (1968) and Satan's Cheerleaders (1977).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0640812","name":"Michael Donovan O'Donnell","idIMDB":"nm0640812"},"actorId":"nm0640812","character":"Gas Station Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dee Cooper","urlProfile":"http://www.imdb.com/name/nm0177979","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjAyZDAxODUtMGJkZi00ZjE2LWE3M2ItMzU2MWE2YTNiY2UyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1920","placeOfBirth":" Muleshoe, Texas, USA","bio":"Dee Cooper was born on May 25, 1920 in Muleshoe, Texas, USA. He is known for his work on Breaker! Breaker! (1977), Pioneer Justice (1947) and Return of the Lash (1947). He died on December 14, 1989 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjAyZDAxODUtMGJkZi00ZjE2LWE3M2ItMzU2MWE2YTNiY2UyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0177979","name":"Dee Cooper","idIMDB":"nm0177979"},"actorId":"nm0177979","character":"Lewis' Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Littlejohn","urlProfile":"http://www.imdb.com/name/nm0514724","urlPhoto":"","biography":{"height":"5' 9\" (1.75 m)","bio":"Gary Littlejohn is known for his work on The Mask (1994), Jay and Silent Bob Strike Back (2001) and The Naked Gun 2½: The Smell of Fear (1991).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0514724","name":"Gary Littlejohn","idIMDB":"nm0514724"},"actorId":"nm0514724","character":"Lewis' Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lily Rabin","urlProfile":"http://www.imdb.com/name/nm4024139","urlPhoto":"","biography":{"bio":"Lily Rabin is an actress, known for Hi-Riders (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4024139","name":"Lily Rabin","idIMDB":"nm4024139"},"actorId":"nm4024139","character":"Mushroom Lily","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0076140","urlIMDB":"http://www.imdb.com/title/tt0076140","business":{"budget":{"money":"$125,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex 35 BL, Todd-AO Lenses"],"laboratory":["Movielab, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Todd-AO 35"],"printedFilmFormat":["35 mm"]},"rating":"5.4","filmingLocations":[{"location":"Van Nuys Boulevard, Van Nuys, Los Angeles, California, USA"}],"rated":"R","awards":[],"votes":"112","type":"Movie","companyCreditsSimple":[{"idCompany":"co0006962","name":"World Amusement Company"}],"keywords":{"keywords":["race","death","manhunt","hot rod","cruising","automobile accident","1970s","speed","small community","murder","automobile","revenge","small town","drag racing","independent film","carsploitation"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:11:52"}}