{"data":{"movies":[{"title":"Le jardinier","originalTitle":"Trädgårdsmästaren","year":"1912","releaseDate":"19121017","directors":[{"name":"Victor Sjöström","id":"nm0803705"}],"writers":[{"name":"Mauritz Stiller","id":"nm0830249"}],"urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjM0ZWUxNGItM2FkNC00YmZjLTkyMmItMDcwZTI0ZWEwODVmL2ltYWdlXkEyXkFqcGdeQXVyMjUyNDk2ODc@._V1.jpg","countries":["Sweden"],"languages":[],"genres":["Drama"],"plot":"A gardener runs a nursery. His son has fallen in love with the daughter of one of the workers at the nursery. The gardener, who has a good eye for daughter, runs furiously son out of the house. One day the gardener violates the girl. He then sends her and her father away, so that he will not be revealed.","simplePlot":"A gardener runs a nursery. His son has fallen in love with the daughter of one of the workers at the nursery. The gardener, who has a good eye for daughter, runs furiously his son out of the house.","actors":[{"actorName":"Victor Sjöström","urlProfile":"http://www.imdb.com/name/nm0803705","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMzk0OTQ2Ml5BMl5BanBnXkFtZTcwNjg5MDI2NQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 September 1879","placeOfBirth":" Silbodal, Värmlands län, Sweden","birthName":"Victor David Sjöström","height":"5' 11\" (1.8 m)","bio":"Victor Sjöström was born on September 20, 1879, and is the undisputed father of Swedish film, ranking as one of the masters of world cinema. His influence lives on in the work of Ingmar Bergman and all those directors, both Swedish and international, influenced by his work and the works of directors whom he himself influenced. As a boy Sjöström was close to his mother, who died during childbirth when he was seven years old. Biographers see this truncated relationship as being essential to the evolution of his dramatic trope of strong-willed, independent women in his films. He was masterful at eliciting sensitive performances from actresses, such as that of Lillian Gish in his American classic The Wind (1928). The teenaged Sjöström loved the theater, but after his education he turned to business, becoming a donut salesman. Fortunately for the future of Swedish cinema, he was a flop as a salesman, and turned to the theater, becoming an actor and then director. The Swedish film company Svenska Bio hired him and fellow stage director Mauritz Stiller to helm pictures, and from 1912-15 he directed 31 films. Only three of them survive (it is estimated that approximately 150,000 films, or 80% of the total silent-era production, has been lost). He directed Ingeborg Holm (1913), considered the first classic of Swedish cinema. Despite the exigencies of working in an industrial art form, most Svenska Bio films of this period are embarrassments in an artistic sense--turgid melodramas, absurd romances and shaggy dog-style comedies--and there is no reason to think that the director didn't helm his share of such fare. Even taking that into account, Sjöström managed to develop a personal style. The reason he became internationally famous (and wooed by Hollywood) was the richness of his films, which were full of psychological subtleties and natural symbolism that was integrated into the works as a whole. He dealt with such major themes as guilt, redemption and the rapidly evolving place of women in society. His 1920 film La charrette fantôme (1921) (a.k.a. \"Thy Soul Shall Bear Witness\") was an internationally acclaimed masterpiece, and Goldwyn Pictures hired him to direct Name the Man (1924) (Goldwayn was folded into Metro-Goldwyn-Mayer in 1924, where he worked until shortly after the advent of sound). Sjöström's name was changed to \"Victor Seastrom\" (a phonetic pronunciation in a country with limited word fonts), and he became a major American director, a pro-to David Lean, who was renowned for balancing artistic expression with a concern for what would play at the box office. His first MGM film was the Lon Chaney melodrama He Who Gets Slapped (1924). It was not only a critical success but a huge hit, getting the new studio off onto a sound footing. He was highly respected by MGM chief Louis B. Mayer and by production head Irving Thalberg, who shared Sjöström's concerns with art that did not exclude profit. Sjöström became one of the most highly paid directors in Hollywood, reaching his peak at the end of the silent era (when the silent film reached its maturation as an art form) with two collaborations with Lillian Gish: The Scarlet Letter (1926) and \"The Wind\" (1926), his last masterpiece. He departed Hollywood for Sweden after A Lady to Love (1930), returning one last time to helm Under the Red Robe (1937) for 20th Century-Fox, and although he made two movies in Sweden in the intervening years, his career as a director basically ended with the sound era. He returned to his first avocation, acting in Swedish films, in the 1930s, '40s and '50s. In his later years he was a mentor to Ingmar Bergman and gave a remarkable performance in Bergman's masterpiece \"Wild Strawberries\" (1957), for which he won the National Board of Review's Best Actor Award. In his professional life he was a workaholic, and in his private life was reticent about his films and his fame and remained intensely devoted to his wife Edith Erastoff and his family. Victor Sjöström died on January 3, 1960, at the age of 80.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMzk0OTQ2Ml5BMl5BanBnXkFtZTcwNjg5MDI2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0803705","name":"Victor Sjöström","idIMDB":"nm0803705"},"actorId":"nm0803705","character":"The Gardener","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gösta Ekman","urlProfile":"http://www.imdb.com/name/nm0252472","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDg3NTYxNDkxOF5BMl5BanBnXkFtZTcwMzg3MDkwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1890","placeOfBirth":" Stockholm, Stockholms län, Sweden","birthName":"Frans Gösta Viktor Ekman","bio":"Generally spoken of as Swedish theater's most legendary stage actor, Gösta Ekman enjoyed a prolific stage career during his short life, becoming the first real star of Swedish theater. His boyish good looks attracted both sexes, helping to create a massive cult following and elevating him to the status of a living legend. Combined with a beautiful voice and a powerful stage presence, Ekman was able to captivate his audiences.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDg3NTYxNDkxOF5BMl5BanBnXkFtZTcwMzg3MDkwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0252472","name":"Gösta Ekman","idIMDB":"nm0252472"},"actorId":"nm0252472","character":"The Gardener's son","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lili Beck","urlProfile":"http://www.imdb.com/name/nm0064949","urlPhoto":"","biography":{"dateOfBirth":"29 December 1885","placeOfBirth":" Copenhagen, Denmark","birthName":"Lili Beck","bio":"Lili Beck was born on December 29, 1885 in Copenhagen, Denmark. She was an actress, known for Saved in Mid-Air (1912), Dolken (1916) and Sonad skuld (1915). She was married to Martellius Lundqvist, Victor Sjöström, Erik Magnussen and Hakon Ahnfelt-Rønne. She died on January 20, 1939 in Århus, Denmark.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0064949","name":"Lili Beck","idIMDB":"nm0064949"},"actorId":"nm0064949","character":"Young Woman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gunnar Bohman","urlProfile":"http://www.imdb.com/name/nm0092083","urlPhoto":"","biography":{"dateOfBirth":"1 September 1882","placeOfBirth":" Gothenburg, Västra Götalands län, Sweden","birthName":"Karl Gunnar Boman","bio":"Gunnar Bohman was born on September 1, 1882 in Gothenburg, Västra Götalands län, Sweden as Karl Gunnar Boman. He was an actor, known for Le jardinier (1912), Ungkarlsparadiset (1931) and Lyckobarnen (1926). He died on January 6, 1963.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0092083","name":"Gunnar Bohman","idIMDB":"nm0092083"},"actorId":"nm0092083","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Ekman","urlProfile":"http://www.imdb.com/name/nm0252476","urlPhoto":"","biography":{"dateOfBirth":"15 November 1880","placeOfBirth":" Stockholm, Stockholms län, Sweden","bio":"John Ekman was born on November 15, 1880 in Stockholm, Stockholms län, Sweden. He was an actor and director, known for The Outlaw and His Wife (1918), Vers la joie (1950) and La charrette fantôme (1921). He died on November 22, 1949 in Karlstad, Värmlands län, Sweden.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0252476","name":"John Ekman","idIMDB":"nm0252476"},"actorId":"nm0252476","character":"The General","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mauritz Stiller","urlProfile":"http://www.imdb.com/name/nm0830249","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWU4OTFmM2MtMTg1MC00MmI2LTg2N2EtNjVkNmVmYTAxYjhhXkEyXkFqcGdeQXVyMTc4MzI2NQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 July 1883","placeOfBirth":" Helsinki, Finland","birthName":"Moshe Stiller","bio":"Moshe \"Mauritz\" Stiller, born July 17, 1883, in Helsinki, Finland, was a director, writer and actor. He began his artistic activity in the theatre, as an actor at 16. Mauritz Stiller portrayed 87 roles from 1899-1916 and directed 16 productions 1911-28. Together with Viktor Sjöström ( director, actor, writer) he was recruited in 1912 as director/actor to the Swedish film industry by Charles Magnusson at AB Svenska Biografteatern. Mauritz Stiller's films was instantly successful. During his first year he directed six feature films. \"Herr Arnes pengar\" (1919), \"Erotikon\" (1920) and \"Gösta Berlings saga\" (1923) are three cornerstones of Swedish film production. In \"Gösta Berlings saga\" Greta Garbo, 18 years old, made her first major role. Greta Garbo and Mauritz Stiller came to be best friends and allies forever. Stiller introduced Garbo to the German audience in 1925, before the two sailed of to the USA to make \"The Temptress\" for Paramount/Irving Thalberg in 1926. Mauritz Stiller directed 51 feature films and appeared as an actor in seven productions from 1912-1927. At 1:05 am Nov 8, 1928, Mauritz Stiller died in Stockholm, after undergoing numerous surgeries, an abscess of a lung ended a great artist's life.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWU4OTFmM2MtMTg1MC00MmI2LTg2N2EtNjVkNmVmYTAxYjhhXkEyXkFqcGdeQXVyMTc4MzI2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0830249","name":"Mauritz Stiller","nicknames":["Mosje"],"idIMDB":"nm0830249"},"actorId":"nm0830249","character":"Passenger","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0002544","urlIMDB":"http://www.imdb.com/title/tt0002544","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":null,"soundMix":["Silent"],"color":["Black and White"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.4","filmingLocations":[{"location":"Nacka, Stockholms län, Sweden"}],"awards":[],"votes":"118","type":"Movie","companyCreditsSimple":[{"idCompany":"co0088098","name":"Svenska Biografteatern AB"}],"keywords":{"keywords":["banned film","prostitute","rape","formerly lost film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:16:26"}}