{"data":{"movies":[{"title":"Breakfast at Tiffany's","originalTitle":"","year":"1961","releaseDate":"19611005","directors":[{"name":"Blake Edwards","id":"nm0001175"}],"writers":[{"name":"Truman Capote","id":"nm0001986"},{"name":"George Axelrod","id":"nm0043480"}],"runtime":"115 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg3NTI2NzU2NF5BMl5BanBnXkFtZTcwMjQxMTQ5OQ@@._V1.jpg","countries":["USA"],"languages":["English","Portuguese"],"genres":["Comedy","Drama","Romance"],"plot":"Holly Golightly is a flighty Manhattan party girl, who expects \"money for the powder room as well as for cab fare\" for her companionship. She has even gotten a lucrative once weekly job to visit notorious convict Sally Tomato in Sing Sing, she needing to report back to Sally's lawyer the weather report that Sally tells her as proof of her visits with him in return for payment. Her aspirations for glamor and wealth are epitomized by the comfort she feels at Tiffany's, the famous high end jewelry retailer where she believes nothing can ever go wrong. Her resolve for this wealth is strengthened, if not changed slightly in focus, upon news from home. Into Holly's walk-up apartment building and thus her life is Paul Varjak, a writer who Holly states reminds her of her brother Fred, who she has not seen in years and who is currently enlisted in the army. The two quickly become friends in their want for something outside of their current lot. Paul's situation is closer to Holly's than he ...","simplePlot":"A young New York socialite becomes interested in a young man who has moved into her apartment building.","actors":[{"actorName":"Audrey Hepburn","urlProfile":"http://www.imdb.com/name/nm0000030","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MTY3NTQyMF5BMl5BanBnXkFtZTYwMTk2MzQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 May 1929","placeOfBirth":" Ixelles, Belgium","birthName":"Audrey Kathleen Ruston","height":"5' 7\" (1.7 m)","bio":"Audrey Hepburn was born Audrey Kathleen Hepburn-Ruston on May 4, 1929 in Brussels, Belgium. She was a blue-blood and a cosmopolitan from birth. Her mother, Ella van Heemstra, was a Dutch baroness; Audrey's father, Joseph Victor Anthony Hepburn-Ruston, was born in Úzice, Bohemia, of English and Austrian descent, and worked in business. After her parents divorced, Audrey went to London with her mother where she went to a private girls school. Later, when her mother moved back to the Netherlands, she attended private schools as well. While she vacationed with her mother in Arnhem, Netherlands, Hitler's army took over the town. It was here that she fell on hard times during the Nazi occupation. Audrey suffered from depression and malnutrition. After the liberation, she went to a ballet school in London on a scholarship and later began a modeling career. As a model, she was graceful and, it seemed, she had found her niche in life--until the film producers came calling. In 1948, after being spotted modeling by a producer, she was signed to a bit part in the European film Dutch in Seven Lessons (1948). Later, she had a speaking role in the 1951 film, Young Wives' Tale (1951) as Eve Lester. The part still wasn't much, so she headed to America to try her luck there. Audrey gained immediate prominence in the US with her role in Roman Holiday (1953) in 1953. This film turned out to be a smashing success, and she won an Oscar as Best Actress. This gained her enormous popularity and more plum roles. In contrast to the \"sex goddesses\" of the silver screen, Audrey Hepburn had a more wholesome beauty and an aura of innocence and class about her which gained her many devoted fans. Roman Holiday (1953) was followed by another similarly wonderful performance in the 1957 classic Funny Face (1957). Sabrina (1954), in 1954, for which she received another Academy nomination, and Love in the Afternoon (1957), in 1957, also garnered rave reviews. In 1959, she received yet another nomination for her role in The Nun's Story (1959). Audrey reached the pinnacle of her career when she played Holly Golightly in the delightful film Breakfast at Tiffany's (1961)in 1961. For this she received another Oscar nomination. She scored commercial success again in the espionage caper Charade (1963). One of Audrey's most radiant roles was in the fine production of My Fair Lady (1964) in 1964. Her co-star, Rex Harrison, once was asked to identify his favorite leading lady. Without hesitation, he replied, \"Audrey Hepburn in 'My Fair Lady.'\" After a couple of other movies, most notably Two for the Road (1967), she hit pay dirt and another nomination in 1967's Wait Until Dark (1967). By the end of the sixties, after her divorce from actor Mel Ferrer, Audrey decided to retire while she was on top. Later she married Dr. Andrea Dotti. From time to time, she would appear on the silver screen. One film of note was Robin and Marian (1976), with Sean Connery in 1976. In 1988, Audrey became a special ambassador to the United Nations UNICEF fund helping children in Latin America and Africa, a position she retained until 1993. She was named to People's magazine as one of the 50 most beautiful people in the world. Her last film was Always (1989) in 1989. Audrey Hepburn died on January 20, 1993 in Tolochnaz, Switzerland, from appendicular cancer. She had made a total of 31 high quality movies. Her elegance and style will always be remembered in film history as evidenced by her being named in Empire magazine's \"The Top 100 Movie Stars of All Time.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MTY3NTQyMF5BMl5BanBnXkFtZTYwMTk2MzQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000030","name":"Audrey Hepburn","nicknames":["Edda van Heemstra"],"idIMDB":"nm0000030"},"actorId":"nm0000030","character":"Holly Golightly","urlCharacter":"http://www.imdb.com/character/ch0011553","main":true},{"actorName":"George Peppard","urlProfile":"http://www.imdb.com/name/nm0000577","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1OTczNDE2NF5BMl5BanBnXkFtZTcwMTY5Mzg3Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1928","placeOfBirth":" Detroit, Michigan, USA","birthName":"George William Peppard Jr.","height":"6' (1.83 m)","bio":"Handsome and elegant George Peppard occasionally displayed considerable talent through his career, but was too often cast in undemanding action roles. Following Broadway and television experience, he made a strong film debut in The Strange One (1957). He started getting noticed when he played Robert Mitchum's illegitimate son in the popular melodrama Home from the Hill (1960). He then established himself as a leading man, giving arguably his most memorable film performance as Audrey Hepburn's love interest in Breakfast at Tiffany's (1961). Seen by the studios as a promising young star, Peppard was subsequently cast in some of the major blockbusters of the early/mid-1960s: How the West Was Won (1962), The Victors (1963), The Carpetbaggers (1964) and Operation Crossbow (1965). He reached the peak of his popularity in another such lavish production, The Blue Max (1966), in which he effectively played an obsessively competitive German flying officer during World War I. However, by the late 1960s, he seemed to settle as a tough lead in more average, often hokum, adventures, including House of Cards (1968), Cannon for Cordoba (1970) and The Groundstar Conspiracy (1972). In the early 1970s, his declining popularity was temporarily boosted thanks to the television series Banacek (1972). With his film roles becoming increasingly uninteresting, he acted in, directed and produced the drama Five Days from Home (1978), but the result was rather disappointing. In the mid-1980s, he again obtained success on television as Colonel John \"Hannibal\" Smith, the cigar-chomping leader of The A-Team (1983). George Peppard died at age 65 of pneumonia on May 8, 1994 in Los Angeles, California. He is buried alongside his parents in Northview Cemetary in Dearborn, Michigan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1OTczNDE2NF5BMl5BanBnXkFtZTcwMTY5Mzg3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000577","name":"George Peppard","idIMDB":"nm0000577"},"actorId":"nm0000577","character":"Paul Varjak","urlCharacter":"http://www.imdb.com/character/ch0011554","main":true},{"actorName":"Patricia Neal","urlProfile":"http://www.imdb.com/name/nm0623658","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjk3OTkwN15BMl5BanBnXkFtZTYwMDM5NDM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 January 1926","placeOfBirth":" Packard, Kentucky, USA","birthName":"Patricia Louise Neal","height":"5' 8½\" (1.74 m)","bio":"Patricia Neal, the Oscar- and Tony Award-winning actress, was born Patricia Louise Neal in Packard, Kentucky. Her father managed a coal mine and her mother was the daughter of the town doctor. She grew up in Knoxville, where she attended high school. She was first bit by the acting bug at the age of 10, after attending an evening of monologues at a Methodist church. She subsequently wrote a letter to Santa Claus, telling him, \"What I want for Christmas is to study dramatics\". She won the Tennessee State Award for dramatic reading while she was in high school. She apprenticed at the Barter Theater in Abingdon, Virginia when she was 16-years-old, between her junior and senior years in high school. After studying drama for two years at Northwestern University, she headed to New York City and landed the job as an understudy in The Voice of the Turtle (1947). It was the producer of the play that had her change her name from Patsy to Patricia. After replacing Vivian Vance in the touring company of \"Turtle\", she won a role in a play that closed in Boston and then appeared in summer stock. She won the role of the teenage \"Regina\" in Lillian Hellman's play, Another Part of the Forest (1948), for which she won a Tony Award in 1947. Subsequently, she signed a seven-year contract with Warner Bros. In the first part of her film career, her most impressive roles were in The Fountainhead (1949), opposite Gary Cooper, with whom she had three-year-long love affair, and in director Robert Wise's sci-fi classic, The Day the Earth Stood Still (1951), which she made at 20th Century-Fox. Warners hadn't been thrilled with her and let her go before her contract was up, so she signed with Fox. Her film career stagnating, she returned to Broadway and achieved the success that eluded her in films, appearing in the revival of Hellman's play, The Children's Hour (1961), in 1952. She met and married the writer, Roald Dahl, in 1953, and they would have five children in 30 years of marriage. In 1957, she had one of her finest roles in Elia Kazan's parable about the threat of mass-media demagoguery and home-grown fascism in A Face in the Crowd (1957). Before she had appeared in the movie, Neal had taken over the role of \"Maggie\" in Tennessee Williams' Cat on a Hot Tin Roof (1958), the Broadway smash that had been directed by Kazan. Returning to the stage, she appeared in the London production of Williams' Suddenly, Last Summer (1959) and co-starred with Anne Bancroft in the Broadway production of The Miracle Worker (1962). After appearing in Breakfast at Tiffany's (1961), she had what was arguably her finest role, as Alma the housekeeper, in Hud (1963) opposite Paul Newman. The film was a hit and Neal won the Best Actress Oscar. In 1965, she suffered a series of strokes that nearly killed her. She was filming John Ford's film, 7 Women (1966), at the time, and had to be replaced by Anne Bancroft (who would later take a role she turned down, \"Mrs. Robinson\" in The Graduate (1967)). Neal was pregnant at the time. She underwent a seven-hour operation on her brain and survived, later delivering her fifth child. She underwent rehabilitation supervised by her husband. She had turned down The Graduate (1967) as she had not recovered fully from her stroke. When she returned to the screen, in 1968 in The Subject Was Roses (1968), she suffered from memory problems. According to her director, Ulu Grosbard, \"The memory element was the uncertain one. But when we started to shoot, she hit her top level. She really rises to the challenge. She has great range, even more now than before\". She received an Oscar nomination for her work. Subsequently, new acting roles equal to her talent were sparse. She did receive three Emmy nominations, the first for originating the role of \"Olivia Walton\" in the 1971 TV movie The Homecoming: A Christmas Story (1971), that gave birth to the TV show The Waltons (1971). Patricia Neal died on August 9, 2010 in Edgarton, Massachusetts from lung cancer. She was 84 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjk3OTkwN15BMl5BanBnXkFtZTYwMDM5NDM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0623658","name":"Patricia Neal","idIMDB":"nm0623658"},"actorId":"nm0623658","character":"2E Failenson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Buddy Ebsen","urlProfile":"http://www.imdb.com/name/nm0001171","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNzM2OTM5OF5BMl5BanBnXkFtZTYwODIxNDI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 April 1908","placeOfBirth":" Belleville, Illinois, USA","birthName":"Christian Rudolph Ebsen Jr.","height":"6' 3\" (1.91 m)","bio":"Buddy Ebsen began his career as a dancer in the late 1920s in a Broadway chorus. He later formed a vaudeville act with his sister Vilma Ebsen, which also appeared on Broadway. In 1935 he and his sister went to Hollywood, where they were signed for the first of MGM's Eleanor Powell movies, Broadway Melody of 1936 (1935). While Vilma retired from stage and screen shortly after this, Buddy starred in two further MGM movies with Powell. Two of his dancing partners were Frances Langford in Born to Dance (1936) and Judy Garland in Broadway Melody of 1938 (1937). They were a little bit taller than Shirley Temple, with whom he danced in Captain January (1936). MGM studio chief Louis B. Mayer offered him an exclusive contract in 1938, but Ebsen turned it down. In spite of Mayer's warning that he would never get a job in Hollywood again, he was offered the role of the scarecrow in The Wizard of Oz (1939). Ebsen agreed to change roles with Ray Bolger, who was cast as the Tin Man. Ebsen subsequently became ill from the aluminum make-up, however, and was replaced by Jack Haley. He returned to the stage, making only a few pictures before he got a role in the Disney production of Davy Crockett: King of the Wild Frontier (1955). After this, he became a straight actor, and later won more fame in his own hit series, The Beverly Hillbillies (1962) and Barnaby Jones (1973).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNzM2OTM5OF5BMl5BanBnXkFtZTYwODIxNDI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001171","name":"Buddy Ebsen","idIMDB":"nm0001171"},"actorId":"nm0001171","character":"Doc Golightly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Martin Balsam","urlProfile":"http://www.imdb.com/name/nm0000842","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwOTE4MjMxM15BMl5BanBnXkFtZTcwMDc5MDg5Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 November 1919","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"Martin Henry Balsam","height":"5' 7\" (1.7 m)","bio":"Martin Henry Balsam was born on November 4, 1919 in the Bronx, New York City, to Lillian (Weinstein) and Albert Balsam, a manufacturer of women's sportswear. He was the first-born child. His father was a Russian Jewish immigrant, and his mother was born in New York, to Russian Jewish parents. Martin caught the acting bug in high school where he participated in the drama club. After high school, he continued his interest in acting by attending Manhattan's progressive New School. When World War II broke out, Martin was called to service in his early twenties. After the war, he was lucky to secure a position as an usher at Radio City Music Hall in New York City. By 1947, he was honing his craft at the Actors Studio, run at that time by Elia Kazan and Lee Strasberg. His time at the Actors Studio in New York City allowed him training in the famous Stanislavsky method. Despite his excellent training, he had to prove himself, just like any up and coming young actor. He began on Broadway in the late 1940s. But, it was not until 1951 that he experienced real success. That play was Tennessee Williams' \"The Rose Tattoo\". After his Broadway success, he had a few minor television roles before his big break arrived when he joined the cast of On the Waterfront (1954). In the 1950s, Martin had many television roles. He had recurring roles on some of the most popular television series of that time, including The United States Steel Hour (1953), The Philco-Goodyear Television Playhouse (1948), Goodyear Playhouse (1951) and Studio One in Hollywood (1948). In 1957, he was able to prove himself on the big-screen once again, with a prominent role in 12 Angry Men (1957), directed by Sidney Lumet and starring Henry Fonda. All of Martin's television work in the 1950s did not go to waste. While starring on an episode of Alfred Hitchcock Presents (1955), Hitchcock was so impressed by his work, that he offered him a key supporting role of Detective Milton Arbogast in Psycho (1960). His work with Hitchcock opened him up to a world of other acting opportunities. Many strong movie roles came his way in the 1960s, including parts in Breakfast at Tiffany's (1961), Cape Fear (1962) and The Carpetbaggers (1964). One of the proudest moments in his life was when he received an Academy Award for Best Supporting Actor for A Thousand Clowns (1965). It was soon after that he began accepting roles in European movies. He soon developed a love for Italy, and lived there most of his remaining years. He acted in over a dozen Italian movies and spent his later life traveling between Hollywood and Europe for his many roles. After a career that spanned more than fifty years, Martin Balsam died of natural causes in his beloved Italy at age 76. He passed away of a heart attack at a hotel in Rome called Residenza di Repetta. He was survived by his third wife Irene Miller and three children, Adam, Zoe and Talia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwOTE4MjMxM15BMl5BanBnXkFtZTcwMDc5MDg5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000842","name":"Martin Balsam","nicknames":["The Bronx Barrymore"],"idIMDB":"nm0000842"},"actorId":"nm0000842","character":"O.J. Berman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"José Luis de Vilallonga","urlProfile":"http://www.imdb.com/name/nm0897808","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTJiYjVlMjQtNTlkMi00OGNmLTk0YjEtNzhhYzZhMDM3ODZiXkEyXkFqcGdeQXVyMTI3MDk3MzQ@._V1_UY44_CR19,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 1920","placeOfBirth":" Madrid, Spain","birthName":"José Luis de Vilallonga y Cabeza de Vaca","height":"6' 6\" (1.98 m)","bio":"José Luis de Vilallonga was born on January 29, 1920 in Madrid, Spain as José Luis de Vilallonga y Cabeza de Vaca. He was an actor and writer, known for Breakfast at Tiffany's (1961), Darling (1965) and Juliet of the Spirits (1965). He was married to Begoña Aranguren, Syliane Stella, Essylt-Priscilla Scott-Ellis and Sylianne Stella. He died on August 30, 2007 in Andratx, Mallorca, Balearic Islands, Spain.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTJiYjVlMjQtNTlkMi00OGNmLTk0YjEtNzhhYzZhMDM3ODZiXkEyXkFqcGdeQXVyMTI3MDk3MzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0897808","name":"José Luis de Vilallonga","idIMDB":"nm0897808"},"actorId":"nm0897808","character":"José da Silva Pereira","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John McGiver","urlProfile":"http://www.imdb.com/name/nm0569410","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjUzNzkwOV5BMl5BanBnXkFtZTcwNDczMTMxOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1913","placeOfBirth":" New York City, New York, USA","birthName":"John Irwin McGiver","height":"5' 11\" (1.8 m)","bio":"John Irwin McGiver came to acting relatively late in life. He held a B.A. and Masters degrees in English from Fordham, Columbia and Catholic Universities and spent his early years teaching drama and speech at Christopher Columbus High School in the Bronx. He had an early flirt with the acting profession in 1938 as actor/director for the Irish Repertory Theatre but found his weekly income of $26.42 insufficient to live on. He enlisted the next year and saw action during World War II, fighting with the U.S. 7th Armored Division in Europe (including the Battle of the Bulge). When he was demobbed after six years in the army, he held the rank of captain. He returned to teaching drama, with occasional forays into off-Broadway acting. In 1947, he married Chicago scenic designer Ruth Shmigelsky and settled down to live in a converted 19th century former Baptist church. There are conflicting stories as to how McGiver ended up becoming a film and television actor, but it happened sometime after one of his part-time acting performances in September 1955, either through the offices of an old University classmate, turned stage producer, or through the persuasive abilities of an agent from the Music Corporation of America. In any case, the portly, balding, owl-like and precisely-spoken McGiver quickly developed an inimitable style as a comic (and occasionally serious) actor on television and in films. He was most memorable as the obtuse landscape contractor in The Gazebo (1959), a pompous jewelry salesman in Breakfast at Tiffany's (1961) and an inept twitcher in Mr. Hobbs Takes a Vacation (1962). He also played \"Mr. Sowerberry\" in a television version of The DuPont Show of the Month: Oliver Twist (1959) and starred in his own (sadly short-lived) TV show, Many Happy Returns (1964) as the complaints manager of a department store. His dramatic roles included a senator in The Manchurian Candidate (1962) and, on television, the corrupt mayor in The Front Page (1970), plus a rare villainous role in the TV episode The Man from U.N.C.L.E.: The Birds and the Bees Affair (1966). Among his numerous guest starring roles on television, he was at his best as the self-absorbed \"Roswell Flemington\", who learns a moral lesson in The Twilight Zone: Sounds and Silences (1964) (1964).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjUzNzkwOV5BMl5BanBnXkFtZTcwNDczMTMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0569410","name":"John McGiver","idIMDB":"nm0569410"},"actorId":"nm0569410","character":"Tiffany's Salesman","urlCharacter":"http://www.imdb.com/character/ch0303709","main":true},{"actorName":"Dorothy Whitney","urlProfile":"http://www.imdb.com/name/nm0926286","urlPhoto":"","biography":{"dateOfBirth":"31 October 1933","placeOfBirth":" New York City, New York, USA","birthName":"Dorothy Myrtle Whitney","height":"5' 11\" (1.8 m)","bio":"Dorothy Whitney was born on October 31, 1933 in New York City, New York, USA as Dorothy Myrtle Whitney. She was an actress, known for Breakfast at Tiffany's (1961) and Oh... Rosalinda!! (1955). She was married to Richard Bell Coney and Ramon Bieri. She died on January 25, 1977 in Reno, Nevada, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0926286","name":"Dorothy Whitney","idIMDB":"nm0926286"},"actorId":"nm0926286","character":"Mag Wildwood","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stanley Adams","urlProfile":"http://www.imdb.com/name/nm0011366","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1ODQ1MzY2MF5BMl5BanBnXkFtZTcwNzMyNTUxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 April 1915","placeOfBirth":" New York City, New York, USA","bio":"Stocky character actor Stanley Adams had a relatively minor career in motion pictures, with the possible exception of his baby-faced millionaire Rusty Trawler of Breakfast at Tiffany's (1961) fame. Otherwise, he played innumerable minor ethnic villains, bartenders and avuncular, fast-talking characters, known in the credits only by their first names. In other words, most of his roles were rather small. On television, conversely, he proved himself quite a scene-stealer, particularly in the 1960's and early 70's, when his face appeared on just about every major show. He was at his best as pool hustler Sure-shot Wilson in an episode of The Odd Couple (1970), Rollo, a quirky time-traveling scientist on The Twilight Zone (1959), and - famously - as 'asteroid detecting', tribble dealing galactic entrepreneur Cyrano Jones on Star Trek (1966). Alas, he was also a space carrot named Tybo on Lost in Space (1965).... His suicide in April 1977 has been attributed to severe depression as a result of a back injury, sustained earlier in the decade. Apart from the obvious pain, it would almost certainly have limited his employment opportunities.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1ODQ1MzY2MF5BMl5BanBnXkFtZTcwNzMyNTUxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0011366","name":"Stanley Adams","idIMDB":"nm0011366"},"actorId":"nm0011366","character":"Rusty Trawler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elvia Allman","urlProfile":"http://www.imdb.com/name/nm0021519","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MDM1MTAzNF5BMl5BanBnXkFtZTcwMzk2NjcxMw@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 September 1904","placeOfBirth":" Enochville, North Carolina, USA","birthName":"Elvia Beatrice Allman","bio":"Elvia Allman was born on September 19, 1904 in Enochville, North Carolina, USA as Elvia Beatrice Allman. She was an actress, known for Breakfast at Tiffany's (1961), The Nutty Professor (1963) and The Prince and the Pauper (1990). She was married to Jerome Laveck Bayler, Charles (\"C.C.\") Pyle and Wesley Benton Tourtellotte. She died on March 6, 1992 in Santa Monica, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MDM1MTAzNF5BMl5BanBnXkFtZTcwMzk2NjcxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0021519","name":"Elvia Allman","idIMDB":"nm0021519"},"actorId":"nm0021519","character":"Librarian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alan Reed","urlProfile":"http://www.imdb.com/name/nm0715284","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMzY0NjI1Nl5BMl5BanBnXkFtZTcwNjk2NzYxOA@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 August 1907","placeOfBirth":" New York City, New York, USA","birthName":"Theodore Bergman","bio":"Character player Alan Reed was a strong, burly presence on film and TV but he would be better remembered in the long run for his equally strong, distinctive voice. He gave vocal life to the prehistoric cartoon character Fred Flintstone on the prime-time TV series The Flintstones (1960) in the 1960s, and it is this direct association that has kept his name alive long after his passing. Reed even thought up and introduced the Flintstonian catchphrase \"Yabba dabba doo!\" for his beloved animated character. After majoring in journalism at Columbia University, the New York born-and-bred actor went on to an acting career at the Provincetown Playhouse. His vocal talents were immediately discovered and he turned to radio, becoming a prime announcer for that medium. A master of over 22 foreign dialects, he also worked steadily on Broadway with the Theatre Guild. On radio, he billed himself under his real name of Teddy Bergman for comedy parts and under the name Alan Reed for dramatic work. Reed was featured on the best radio shows of the time including \"The Shadow,\" \"The Fred Allen Show,\" \"Life with Luigi\" (which he later took to TV), and \"My Friend Irma.\" In films, he had a comic Runyonesque appeal and played in such fare as The Redhead and the Cowboy (1951), Emergency Wedding (1950), and Here Comes the Groom (1951). His more dramatic roles came with The Postman Always Rings Twice (1946) and The Desperate Hours (1955). One of his most unusual parts was his portrayal of Pancho Villa in Viva Zapata! (1952) starring Marlon Brando. He also supplied the voice of \"Boris\" in Disney's La belle et le clochard (1955). The popular animated series and various offshoots made up most of his later work after The Flintstones (1960) premiered in the early 1960s. Reed died following an extended illness in 1977.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMzY0NjI1Nl5BMl5BanBnXkFtZTcwNjk2NzYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0715284","name":"Alan Reed","nicknames":["Teddy"],"idIMDB":"nm0715284"},"actorId":"nm0715284","character":"Sally Tomato","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Beverly Powers","urlProfile":"http://www.imdb.com/name/nm0694500","urlPhoto":"","biography":{"dateOfBirth":"7 August 1939","placeOfBirth":" Los Angeles, California, USA","birthName":"Beverly Jean Montgomery","bio":"Beverly Powers was born on August 7, 1939 in Los Angeles, California, USA as Beverly Jean Montgomery. She is an actress, known for Breakfast at Tiffany's (1961), The Comedy of Terrors (1963) and Brides of Blood (1968).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0694500","name":"Beverly Powers","idIMDB":"nm0694500"},"actorId":"nm0694500","character":"Nightclub Stripper","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Claude Stroud","urlProfile":"http://www.imdb.com/name/nm0835140","urlPhoto":"","biography":{"dateOfBirth":"27 March 1907","placeOfBirth":" Kaufman, Texas, USA","bio":"Claude Stroud was born on March 27, 1907 in Kaufman, Texas, USA. He was an actor, known for Breakfast at Tiffany's (1961), All About Eve (1950) and Love Me or Leave Me (1955). He was married to Gloria Brewster and Thelma White. He died on October 16, 1985 in Santa Monica, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0835140","name":"Claude Stroud","idIMDB":"nm0835140"},"actorId":"nm0835140","character":"Sid Arbuck","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Orangey","urlProfile":"http://www.imdb.com/name/nm1248838","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5ODE5MDM3NF5BMl5BanBnXkFtZTcwNjQ3MDgyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Orangey the Cat is the only feline double-winner of the Patsy Award, the animal kingdom's equivalent of the Oscar. The Patsy Award is given out by the American Humane Association's Hollywood branch and stands for Picture Animal Top Star of the Year. Orangey won his first Patsy for his cinema debut in Rhubarb (1951), playing the eponymous baseball team-owning cat in the 1951 film. Ten years later, he won his second Patsy, playing \"Cat\" in Breakfast at Tiffany's (1961), a homeless feline described as a \"poor slob without a name\" by Holly Golightly (Audrey Hepburn), whom he visits. Orangey, who sometimes was billed as Rhubarb the Cat, was an orange-colored tabby trained by the famous animal trainer Frank Inn, known for such famous critter thespians as the pig who played Arnold Ziffel on Green Acres (1965) and Higgins the Dog, who appeared in the TV series \"Petticoat Junction\" (1964) (TV)_ and originated the role of Benji in the movies. Both Arnold and Higgins were Patsy winers. Frank Inn's critters won a total of 40 Pasty Awards during his career. Other films that Orangey the Cat appeared in during his 15 year career, include The Incredible Shrinking Man (1957), Gigot (1962), and Village of the Giants (1965). Orangey's longest gig was a recurring role as Minerva the Cat in the TV series Our Miss Brooks (1952) from 1952 through 1958.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5ODE5MDM3NF5BMl5BanBnXkFtZTcwNjQ3MDgyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1248838","name":"Orangey","idIMDB":"nm1248838"},"actorId":"nm1248838","character":"Cat","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mickey Rooney","urlProfile":"http://www.imdb.com/name/nm0001682","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NjA4MDU0MV5BMl5BanBnXkFtZTYwMDI0MzQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 September 1920","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Joseph Yule Jr.","height":"5' 2\" (1.57 m)","bio":"Mickey Rooney was born Joe Yule Jr. on September 23, 1920 in Brooklyn, New York. He first took the stage as a toddler in his parents vaudeville act at 17 months old. He made his first film appearance in 1926. The following year, he played the lead character in the first Mickey McGuire short film. It was in this popular film series that he took the stage name Mickey Rooney. Rooney reached new heights in 1937 with A Family Affair, the film that introduced the country to Andy Hardy, the popular all-American teenager. This beloved character appeared in nearly 20 films and helped make Rooney the top star at the box office in 1939, 1940 and 1941. Rooney also proved himself an excellent dramatic actor as a delinquent in Boys Town (1938) starring Spencer Tracy. In 1938, he was awarded a Juvenile Academy Award. Teaming up with Judy Garland, Rooney also appeared in a string of musicals, including Babes in Arms (1939) the first teenager to be nominated for an Oscar for Best Actor in a leading role, Strike Up the Band (1940), Babes on Broadway (1941), and Girl Crazy (1943). He and Garland immediately became best of friends. \"We weren't just a team, we were magic,\" Rooney once said. During that time he also appeared with Elizabeth Taylor in the now classic National Velvet (1944). Rooney joined the service that same year, where he helped to entertain the troops and worked on the American Armed Forces Network. He returned to Hollywood after 21 months in Love Laughs at Andy Hardy (1946), did a remake of a Robert Taylor film, The Crowd Roars (1932) called Killer McCoy (1947) and portrayed composer Lorenz Hart in Words and Music (1948). He also appeared in Breakfast at Tiffany's (1961), starring Audrey Hepburn and George Peppard. Rooney played Hepburn's Japanese neighbor, Mr. Yunioshi. A sign of the times, Rooney played the part for comic relief which he later regretted feeling the role was offensive. He once again showed his incredible range in the dramatic role of a boxing trainer with Anthony Quinn and Jackie Gleason in Requiem for a Heavyweight (1962). In the late 1960s and 1970s Rooney showed audiences and critics alike why he was one of Hollywood's most enduring stars. He gave an impressive performance in Francis Ford Coppola's 1979 film The Black Stallion (1979), which brought him an Academy Award nomination as Best Actor in a Supporting Role. He also turned to the stage in 1979 in Sugar Babies with Ann Miller, and was nominated for a Tony Award. During that time he also portrayed the Wizard in The Wonderful Wizard of Oz with Eartha Kitt at New York's Madison Square Garden, which also had a successful run nationally. Rooney appeared in four television series': The Mickey Rooney Show (1954) (1954-1955), a comedy sit-com in 1964 with Sammee Tong called Mickey, One of the Boys in 1982 with Dana Carvey and Nathan Lane, and The New Adventures of the Black Stallion (1990) from 1990-1993. In 1981, Rooney won an Emmy Award for his portrayal of a mentally challenged man in Bill (1981). The critical acclaim continued to flow for the veteran performer, with Rooney receiving an honorary Academy Award \"in recognition of his 60 years of versatility in a variety of memorable film performances\". More recently he has appeared in such films as Night at the Museum (2006) with Ben Stiller and The Muppets (2011) with Amy Adams and Jason Segel. Rooney's personal life, including his frequent trips to the altar, has proved to be just as epic as his on-screen performances. His first wife was one of the most beautiful women in Hollywood, actress Ava Gardner. Mickey permanently separated from his eighth wife Jan in June of 2012. In 2011 Rooney filed elder abuse and fraud charges against stepson Christopher Aber and Aber's wife. At Rooney's request, the Superior Court issued a restraining order against the Aber's demanding they stay 100 yards from Rooney, as well as Mickey's other son Mark Rooney and Mark's wife Charlene. Just prior, Rooney mustered the strength to break his silence and appeared before the Senate in Washington D.C. telling of his own heartbreaking story of abuse in an effort to live a peaceful, full life and help others who may be similarly suffering in silence. Rooney requested through the Superior Court to permanently reside with his son Mark Rooney, who is a musician and Marks wife Charlene, an artist, in the Hollywood Hills. He legally separated from his eighth wife in June of 2012. Ironically, after eight failed marriages he never looked or felt better and finally found happiness and peace in the single life. Mickey, Mark and Charlene focused on health, happiness and creative endeavors and it showed. Mickey Rooney had once again landed on his feet reminding us that he was a survivor. Rooney died on April 6th 2014. He was taking his afternoon nap and never woke. One week before his death Mark and Charlene surprised him by reunited him with a long lost love, the racetrack. He was ecstatic to be back after decades and ran into his old friends Mel Brooks and Dick Van Patten.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NjA4MDU0MV5BMl5BanBnXkFtZTYwMDI0MzQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001682","name":"Mickey Rooney","nicknames":["The Mick","The Mickster"],"idIMDB":"nm0001682"},"actorId":"nm0001682","character":"Mr. Yunioshi","urlCharacter":"http://www.imdb.com/character/ch0243345","main":true}],"seasons":[],"idIMDB":"tt0054698","urlIMDB":"http://www.imdb.com/title/tt0054698","business":{"budget":{"money":"$2,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1960/\">1960</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 55 min (115 min)"],"soundMix":["Mono"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Technicolor"],"filmLength":null,"negativeFormat":["35 mm (Eastman 50T 5250)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.7","metascore":"76","filmingLocations":[{"location":"167 East 71st Street, Manhattan, New York City, New York, USA"}],"rated":"NOT RATED","awards":[{"award":"Academy Awards, USA 1962","titlesAwards":[{"titleAwardOutcome":"Won Oscar","categories":[{"category":"Best Music, Original Song","names":[{"name":"Henry Mancini","id":"nm0000049","role":"music"},{"name":"Johnny Mercer","id":"nm0006197","role":"lyrics"}]},{"category":"Best Music, Scoring of a Dramatic or Comedy Picture","names":[{"name":"Henry Mancini","id":"nm0000049","role":null}]}]},{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Actress in a Leading Role","names":[{"name":"Audrey Hepburn","id":"nm0000030","role":null}]},{"category":"Best Writing, Screenplay Based on Material from Another Medium","names":[{"name":"George Axelrod","id":"nm0043480","role":null}]},{"category":"Best Art Direction-Set Decoration, Color","names":[{"name":"Hal Pereira","id":"nm0673134","role":null},{"name":"Roland Anderson","id":"nm0027380","role":null},{"name":"Sam Comer","id":"nm0173754","role":null},{"name":"Ray Moyer","id":"nm0610455","role":null}]}]}]},{"award":"Golden Globes, USA 1962","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Motion Picture - Comedy","names":[]},{"category":"Best Actress - Comedy or Musical","names":[{"name":"Audrey Hepburn","id":"nm0000030","role":null}]}]}]},{"award":"Bambi Awards 1962","titlesAwards":[{"titleAwardOutcome":"3rd place Bambi","categories":[{"category":"Best Actress - International","names":[{"name":"Audrey Hepburn","id":"nm0000030","role":null}]}]}]},{"award":"David di Donatello Awards 1962","titlesAwards":[{"titleAwardOutcome":"Won David","categories":[{"category":"Best Foreign Actress (Migliore Attrice Straniera)","names":[{"name":"Audrey Hepburn","id":"nm0000030","role":null}]}]}]},{"award":"Directors Guild of America, USA 1962","titlesAwards":[{"titleAwardOutcome":"Nominated DGA Award","categories":[{"category":"Outstanding Directorial Achievement in Motion Pictures","names":[{"name":"Blake Edwards","id":"nm0001175","role":null}]}]}]},{"award":"Grammy Awards 1962","titlesAwards":[{"titleAwardOutcome":"Won Grammy","categories":[{"category":"Best Soundtrack Album or Recording or Score from Motion Picture or Television","names":[{"name":"Henry Mancini","id":"nm0000049","role":null}]},{"category":"Record of the Year","names":[{"name":"Henry Mancini and His Orchestra","id":"nm1852928","role":null}]},{"category":"Song of the Year","names":[{"name":"Henry Mancini","id":"nm0000049","role":"composer"},{"name":"Johnny Mercer","id":"nm0006197","role":"lyricist"},{"name":"Henry Mancini and His Orchestra","id":"nm1852928","role":"performer"}]},{"category":"Best Instrumental Arrangement","names":[{"name":"Henry Mancini","id":"nm0000049","role":null}]},{"category":"Best Performance by an Orchestra - for Other Than Dancing","names":[{"name":"Henry Mancini","id":"nm0000049","role":null}]}]},{"titleAwardOutcome":"Nominated Grammy","categories":[{"category":"Album of the Year","names":[{"name":"Henry Mancini","id":"nm0000049","role":"Artist"},{"name":"Audrey Hepburn","id":"nm0000030","role":"Artist"}]}]}]},{"award":"Laurel Awards 1962","titlesAwards":[{"titleAwardOutcome":"Won Golden Laurel","categories":[{"category":"Top Song","names":[{"name":"Johnny Mercer","id":"nm0006197","role":null},{"name":"Henry Mancini","id":"nm0000049","role":null}]}]},{"titleAwardOutcome":"3rd place Golden Laurel","categories":[{"category":"Top Comedy","names":[]},{"category":"Top Musical Score","names":[{"name":"Henry Mancini","id":"nm0000049","role":null}]},{"category":"Top Female Comedy Performance","names":[{"name":"Audrey Hepburn","id":"nm0000030","role":null}]}]}]},{"award":"National Film Preservation Board, USA 2012","titlesAwards":[{"titleAwardOutcome":"Won National Film Registry","categories":[{"category":"","names":[]}]}]},{"award":"Online Film & Television Association 2013","titlesAwards":[{"titleAwardOutcome":"Won OFTA Film Hall of Fame","categories":[{"category":"Motion Picture","names":[]}]}]},{"award":"Satellite Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Satellite Award","categories":[{"category":"Best Classic DVD","names":[]}]}]},{"award":"Writers Guild of America, USA 1962","titlesAwards":[{"titleAwardOutcome":"Won WGA Award (Screen)","categories":[{"category":"Best Written American Comedy","names":[{"name":"George Axelrod","id":"nm0043480","role":null}]}]}]}],"votes":"130,821","type":"Movie","companyCreditsSimple":[{"idCompany":"co0074967","name":"Jurow-Shepherd"}],"keywords":{"keywords":["writer","typewriter ribbon","manhattan new york city","urban setting","tiffany and co. manhattan new york city","drunkenness","social climber","animal in cast credits","racial stereotype","negative asian stereotype","ethnic stereotype","apartment","party","neighbor","female protagonist","1960s","threat to call the police","photograph in newspaper","character appears on front page of a newspaper","character appears in newspaper","prison visitation","woman smoking cigarette","cigarette smoking","pet cat","being followed","taxi ride","yellow cab","sunglasses","wearing sunglasses inside","talking loud in library","new york public library","fifth avenue manhattan new york city","caucasian actor playing asian character","kissing in the rain","typewriter","central park manhattan new york city","prostitution","love triangle","jewel","gold digger","taxi","secret past","paparazzi","nickname","name change","extramarital affair","dime store","brazilian","arrest","famous score","new york city","cat","prison","fire escape","shoplifting","writing","based on novel","yellowface","bare chested male","kept man","woman","scene at a window","kiss","three word title","newspaper headline","police station","police arrest","ginger cat","book as a gift","alley","cult film","satire","infatuation","comedy of manners","blockbuster","revolving door","book","veterinarian","telephone box","telegram","strip club","singing","ring","rainstorm","police","film producer","millionaire","melodrama","mask","loss of brother","los angeles california","library","language learning","knitting","jewelry store","japanese","interior decorator","earplug","crime boss","cracker jack","code","check","champagne","bus station","brushing teeth","broken engagement","break up","bathroom","bar","annulment","apostrophe in title","thinness"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:31:47"}}