{"data":{"movies":[{"title":"2010: The Year We Make Contact","originalTitle":"2010","year":"1984","releaseDate":"19841207","directors":[{"name":"Peter Hyams","id":"nm0001382"}],"writers":[{"name":"Arthur C. Clarke","id":"nm0002009"},{"name":"Peter Hyams","id":"nm0001382"}],"runtime":"116 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzOTk4NTcyOV5BMl5BanBnXkFtZTgwOTE4NjkzMTE@._V1.jpg","countries":["USA"],"languages":["English","Russian"],"genres":["Adventure","Mystery","Sci-Fi","Thriller"],"plot":"In this sequel to 2001: A Space Odyssey, a joint American- Soviet expedition is sent to Jupiter to discover what went wrong with the U.S.S. Discovery against a backdrop of growing global tensions. Among the mysteries the expedition must explain are the appearance of a huge black monolith in Jupiter's orbit and the fate of H.A.L., the Discovery's sentient computer. Based on a novel written by Arthur C. Clarke.","simplePlot":"A joint U.S.-Soviet expedition is sent to Jupiter to learn what happened to the Discovery.","actors":[{"actorName":"Roy Scheider","urlProfile":"http://www.imdb.com/name/nm0001702","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2ODY5ODg4OTdeQTJeQWpwZ15BbWU2MDUzOTM3Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1932","placeOfBirth":" Orange, New Jersey, USA","birthName":"Roy Richard Scheider","height":"5' 9\" (1.75 m)","bio":"Lean, angular-faced and authoritatively spoken lead / supporting actor Roy Scheider obviously never heard the old actor's axiom about \"never appearing with kids or animals\" lest they overshadow your performance. Breaking that rule did him no harm, though, as he achieved pop cult status by finding, fighting and blowing up a 25-foot-long Great White shark (nicknamed \"Bruce\") in the mega-hit Jaws (1975) and then electrocuting an even bigger Great White in the vastly inferior Jaws 2 (1978). Athletic Scheider was born in November 1932 in Orange, New Jersey, to Anna (Crosson) and Roy Bernhard Scheider, a mechanic. He was of German and Irish descent. A keen sportsman from a young age, he competed in baseball and boxing (his awkwardly mended broken nose is a result of his foray into Golden Gloves competitions). While at college, his pursuits turned from sports to theater and he studied drama at Rutgers and Franklin and Marshall. After a stint in the military, Scheider appeared with the New York Shakespeare Festival and won an \"Obie Award\" for his appearance in the play \"Stephen D.\" His film career commenced with the campy Z-grade horror cheesefest The Curse of the Living Corpse (1964), and he then showed up in Star! (1968), Paper Lion (1968), Stiletto (1969) and Puzzle of a Downfall Child (1970). In 1971 he really came to the attention of film audiences with his role in the Jane Fonda thriller Klute (1971) and then as Det. Buddy Russo (scoring his first Oscar nomination) alongside fiery Gene Hackman in the crime drama The French Connection (1971). His performance as a tough street cop in that film led him into another tough cop role as NYC Det. Buddy Manucci in the underappreciated The Seven-Ups (1973), which features one of the best car chase sequences ever put on film. In the early 1970s the Peter Benchley novel \"Jaws\" was a phenomenal best-seller, and young director Steven Spielberg was chosen by Universal Pictures to direct the film adaptation, Jaws (1975), in which Scheider played police chief Brody and shared lead billing with Robert Shaw and Richard Dreyfuss in the tale of a New England seaside community terrorized by a hungry Great White shark. \"Jaws\" was a blockbuster, and for many years held the record as the highest-grossing film of all time. Scheider then turned up as the shady CIA agent brother of Dustin Hoffman in the unnerving Marathon Man (1976) and in the misfired William Friedkin-directed remake of The Wages of Fear (1953) titled Sorcerer (1977), before again returning to Amity to battle another giant shark in Jaws 2 (1978). Seeking a change from tough cops and hungry sharks, he took the role of womanizing, drug-popping choreographer Joe Gideon, the lead character of the semi-autobiographical portrayal of director Bob Fosse in the sparkling All That Jazz (1979). It was another big hit for Scheider (and another Oscar nomination), with the film featuring a stunning opening sequence to the tune of the funky George Benson number \"On Broadway\", and breathtaking dance routines including the \"Airotica\" performance by the glamorous Sandahl Bergman. Returning to another law enforcement role, Scheider played a rebellious helicopter pilot in the John Badham conspiracy / action film Blue Thunder (1983), a scientist in the sequel to 2001: A Space Odyssey (1968) simply titled 2010: The Year We Make Contact (1984), a cheating husband who turns the tables on his blackmailers in 52 Pick-Up (1986), a cold-blooded hit man in Cohen and Tate (1988) and a CIA operative in the muddled and slow-moving The Russia House (1990). The versatile Scheider was then cast as the captain of a futuristic submarine in the relatively popular TV series SeaQuest 2032 (1993), which ran for three seasons. Inexplicably, however, Scheider had seemingly, and slowly, dropped out of favor with mainstream film audiences, and while he continued to remain busy, predominantly in supporting roles (generally as US presidents or military officers), most of the vehicles he appeared in were B-grade political thrillers such as État d'urgence (1997), Executive Target (1997), Chain of Command (2000) and Red Serpent (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2ODY5ODg4OTdeQTJeQWpwZ15BbWU2MDUzOTM3Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001702","name":"Roy Scheider","idIMDB":"nm0001702"},"actorId":"nm0001702","character":"Dr. Heywood Floyd","urlCharacter":"http://www.imdb.com/character/ch0002894","main":true},{"actorName":"John Lithgow","urlProfile":"http://www.imdb.com/name/nm0001475","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzUyNDkzNF5BMl5BanBnXkFtZTcwNTMwNTU5MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 October 1945","placeOfBirth":" Rochester, New York, USA","birthName":"John Arthur Lithgow","height":"6' 4\" (1.93 m)","bio":"If \"born to the theater\" has meaning in determining a person's life path, then John Lithgow is a prime example of this truth. He was born in Rochester, New York, to Sarah Jane (Price), an actress, and Arthur Washington Lithgow III, who was both a theatrical producer and director. John's father was born in Puerto Plata, Dominican Republic, where the Anglo-American Lithgow family had lived for several generations. John moved frequently as a child, while his father founded and managed local and college theaters and Shakespeare festivals throughout the Midwest of the United States. Not until he was 16, and his father became head of the McCarter Theater in Princeton New Jersey, did the family settle down. But for John, the theater was still not a career. He won a scholarship to Harvard University, where he finally caught the acting bug (as well as found a wife). Harvard was followed by a Fulbright scholarship to study at the London Academy of Music and Dramatic Art. Returning from London, his rigorous dramatic training stood him in good stead, and a distinguished career on Broadway gave him one Tony Award for \"The Changing Room\", a second nomination in 1985 for \"Requiem For a Heavyweight\", and a third in 1988 for \"M. Butterfly\". But with critical acclaim came personal confusion, and in the mid 1970s, he and his wife divorced. He entered therapy, and in 1982, his life started in a new direction, the movies - he received an Academy Award nomination for his portrayal of Roberta Muldoon in The World According to Garp (1982). A second Oscar nomination followed for Terms of Endearment (1983), and he met a UCLA economics professor who became his second wife. As the decade of the 1990s came around, he found that he was spending too much time on location, and another career move brought him to television in the hugely successful series 3rd Rock from the Sun (1996). This production also played a role in bringing him back together with the son from his first marriage, Ian Lithgow, who has a regular role in the series as a dimwitted student.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzUyNDkzNF5BMl5BanBnXkFtZTcwNTMwNTU5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001475","name":"John Lithgow","nicknames":["Jiggles"],"idIMDB":"nm0001475"},"actorId":"nm0001475","character":"Dr. Walter Curnow","urlCharacter":"http://www.imdb.com/character/ch0002893","main":true},{"actorName":"Helen Mirren","urlProfile":"http://www.imdb.com/name/nm0000545","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MzY2ODU2MV5BMl5BanBnXkFtZTcwOTQ3ODY4OQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1945","placeOfBirth":" Chiswick, London, England, UK","birthName":"Helen Lydia Mironoff","height":"5' 4\" (1.63 m)","bio":"Dame Helen Mirren was born in Queen Charlotte's Hospital in West London. Her mother, Kathleen Alexandrina Eva Matilda (Rogers), was from a working-class English family, and her father, Vasiliy Petrovich Mironov, was a Russian-born civil servant, from Kuryanovo, whose own father was a diplomat. Mirren attended St. Bernards High School for girls, where she would act in school productions. After high school, she began her acting career in theatre working in many titles, all the way up to Broadway.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MzY2ODU2MV5BMl5BanBnXkFtZTcwOTQ3ODY4OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000545","name":"Helen Mirren","nicknames":["Popper"],"idIMDB":"nm0000545"},"actorId":"nm0000545","character":"Tanya Kirbuk","urlCharacter":"http://www.imdb.com/character/ch0002892","main":true},{"actorName":"Bob Balaban","urlProfile":"http://www.imdb.com/name/nm0000837","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODkzNTMxNF5BMl5BanBnXkFtZTcwNzk5ODk4Mw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 August 1945","placeOfBirth":" Chicago, Illinois, USA","birthName":"Robert Elmer Balaban","height":"5' 5\" (1.65 m)","bio":"Bob Balaban was born on August 16, 1945 in Chicago, Illinois, USA as Robert Elmer Balaban. He is an actor and director, known for Close Encounters of the Third Kind (1977), Moonrise Kingdom (2012) and The Grand Budapest Hotel (2014). He has been married to Lynn Grossman since April 1, 1977. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODkzNTMxNF5BMl5BanBnXkFtZTcwNzk5ODk4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000837","name":"Bob Balaban","idIMDB":"nm0000837"},"actorId":"nm0000837","character":"Dr. R. Chandra","urlCharacter":"http://www.imdb.com/character/ch0002895","main":true},{"actorName":"Keir Dullea","urlProfile":"http://www.imdb.com/name/nm0001158","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczODgxNDU1NV5BMl5BanBnXkFtZTYwMzQxOTI2._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 May 1936","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Keir Atwood Dullea","height":"6' 1\" (1.85 m)","bio":"Tall, slim, remote and boyishly handsome, one of Keir Dullea's most arresting features is his pale blue eyes, which featured in a number of watershed films of the 1960s. A major, up-and-coming film star from the \"Camelot\" years straight through the turbulent era of the U.S.-Viet Nam War, he never quite reached international fame. His shining star may have suffered a power outage into the next decade, but he persevered quite well on T.V. and (especially) the stage in a career now surpassing five decades. Dullea, who was born in Cleveland, Ohio, is the son of two book-store owners, and he was raised in New York's Greenwich Village section. He graduated from George School in Pennsylvania and attended both Rutgers and San Francisco State before deciding to pursue summer stock and regional theatre. Attending the Neighborhood Playhouse, he made his New York City acting debut in a production of \"Sticks and Bones\" in 1956. His first big break came with the pilot program of the Route 66 (1960) series, and he proceeded to find other TV roles in Naked City (1958), Checkmate (1960) and various dramatic programs. Following stage work in \"Season of Choice\" (1959) and \"A Short Happy Life\" (1961), Dullea made an auspicious film debut in a leading role with The Hoodlum Priest (1961), playing a troubled street gang member who crosses paths with Don Murray's determined minister. The young actor's characters from then on seemed to walk a dangerous tight-rope of emotions, and his apparent versatility at such a young age led him to a number of other psychologically scarred portrayals. Tending to play men younger than he really was, none were more disturbed than his haphephobic adolescent David (Dullea was twenty-six at the time) in the deeply felt love story David and Lisa (1962). Paired beautifully with Janet Margolin's schizophrenic Lisa, Dullea won the Golden Globe Award for \"Most Promising Male Newcomer.\" In the World War II military drama The Thin Red Line (1964)he played an edgy, nervous-eyed private who is pushed to his murderous brink by a brutal sergeant on Guadacanal. In Bunny Lake Is Missing (1965) Dullea portrayed the incestuous brother of Carol Lynley, who may or may not figure into the disappearance of Lynley's child. Keir also costarred as the mysterious intruder who inserts an emotional wedge between gay lovers Anne Heywood and Sandy Dennis in the ground-breaking film about homosexuals, Le renard (1967). Topping that off, Dullea played the salacious Marquis De Sade himself in a relatively tame, internationally flavored production of De Sade (1969). The apex of his film career, however, came with his lead role in Stanley Kubrick's epic science-fiction film, 2001: A Space Odyssey (1968), as the astronaut Dr. David Bowman. In the realm of stage acting, Keir made his debut on Broadway in 1967 with \"Dr. Cook's Garden\" costarring Burl Ives, and Dullea won some \"flower power\" stardom two years later as a sensitive young blind man who attempted to wriggle free of his protective, overbearing mother. His character also pursues love with a free-spirited girl, played by Blythe Danner, in the play \"Butterflies Are Free.\" By the time the movie of this story was released in 1972 both stars had been replaced by Goldie Hawn and Edward Albert. Dullea next went abroad to seek film work in England and in Canada, but with lukewarm results. He continued to show his odd-man-out appeal on the Broadway stage as \"Brick\" in 1970, and in the Broadway revival of \"Cat on a Hot Tin Roof\" in 1974, acting along with Elizabeth Ashley as \"Maggie,\" and in the black comedy \"P.S. Your Cat Is Dead!\" one year later. In the years since then, Dullea has acted steadily on the stage in New York City, and in U.S. regional theatres, in productions of \"Sweet Prince,\" \"The Seagull\" and \"The Little Foxes,\"among others. His cinematic roles since 1970 have included another \"mysterious stranger\" in The Next One (1984), and he also reprised his \"David Bowman\" role in 2010: The Year We Make Contact (1984), the sequel to \"2001: A Space Odyssey.\" Dullea has had four wives: his first was actress Margot Bennett, and he and his third wife, Susie Fuller (whom he met during the British performances of \"Butterflies are Free\" in London), cofounded the Theater Artists Workshop of Westport in 1983. Dullea, Fuller and her two children resided in London for quite a while. After Fuller's death in 1998, Dullea married for the fourth time in 1999 to actress Mia Dillon, who is best known for portraying the character \"Babe\" in in the play, \"Crimes of the Heart\" in New York City. Just a few weeks later they appeared together in the play \"Deathtrap.\" Dullea has worked infrequently in television roles. Among his more recent work in movies has been the role of a senator in The Good Shepherd (2006), along with Matt Damon and Angelina Jolie, which was directed by Robert De Niro.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczODgxNDU1NV5BMl5BanBnXkFtZTYwMzQxOTI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001158","name":"Keir Dullea","idIMDB":"nm0001158"},"actorId":"nm0001158","character":"Dave Bowman","urlCharacter":"http://www.imdb.com/character/ch0002896","main":true},{"actorName":"Douglas Rain","urlProfile":"http://www.imdb.com/name/nm0706937","urlPhoto":"","biography":{"dateOfBirth":"13 March 1928","placeOfBirth":" Winnipeg, Manitoba, Canada","birthName":"Douglas James Rain","bio":"Douglas Rain was born on March 13, 1928 in Winnipeg, Manitoba, Canada as Douglas James Rain. He is an actor, known for 2001: A Space Odyssey (1968), 2010: The Year We Make Contact (1984) and Festival (1960).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0706937","name":"Douglas Rain","idIMDB":"nm0706937"},"actorId":"nm0706937","character":"HAL 9000","urlCharacter":"http://www.imdb.com/character/ch0002900","main":true},{"actorName":"Madolyn Smith Osborne","urlProfile":"http://www.imdb.com/name/nm0001750","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQyNjA1MjYwMF5BMl5BanBnXkFtZTgwOTE5NTc3MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1957","placeOfBirth":" Albuquerque, New Mexico, USA","birthName":"Madolyn Smith","bio":"Madolyn Smith Osborne was born on January 1, 1957 in Albuquerque, New Mexico, USA as Madolyn Smith. She is an actress, known for 2010: The Year We Make Contact (1984), Funny Farm (1988) and Urban Cowboy (1980). She has been married to Mark Osborne since 1988. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQyNjA1MjYwMF5BMl5BanBnXkFtZTgwOTE5NTc3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001750","name":"Madolyn Smith Osborne","idIMDB":"nm0001750"},"actorId":"nm0001750","character":"Caroline Floyd","urlCharacter":"http://www.imdb.com/character/ch0002898","main":true},{"actorName":"Dana Elcar","urlProfile":"http://www.imdb.com/name/nm0253020","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NjkwMzc4Nl5BMl5BanBnXkFtZTcwNTY1MTYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1927","placeOfBirth":" Ferndale, Michigan, USA","birthName":"Ibson Dana Elcar","height":"6' (1.83 m)","bio":"Dana Elcar was born on October 10, 1927 in Ferndale, Michigan, USA as Ibson Dana Elcar. He was an actor and director, known for MacGyver (1985), The Sting (1973) and Guiding Light (1952). He was married to Marianne Torrance, Margaret \"Peggy\" Romano and Katherine Frances Mead. He died on June 6, 2005 in Ventura, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NjkwMzc4Nl5BMl5BanBnXkFtZTcwNTY1MTYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0253020","name":"Dana Elcar","idIMDB":"nm0253020"},"actorId":"nm0253020","character":"Dimitri Moisevitch","urlCharacter":"http://www.imdb.com/character/ch0002897","main":true},{"actorName":"Taliesin Jaffe","urlProfile":"http://www.imdb.com/name/nm0043552","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMjY3NTcwMV5BMl5BanBnXkFtZTgwNzY0NzI3MTE@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 January 1977","placeOfBirth":" Los Angeles, California, USA","birthName":"Taliesin Axelrod Jaffe","bio":"Taliesin Jaffe was born on January 19, 1977 in Los Angeles, California, USA as Taliesin Axelrod Jaffe. He is an actor and writer, known for 2010: The Year We Make Contact (1984), Mr. Mom (1983) and Beck: Mongolian Chop Squad (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMjY3NTcwMV5BMl5BanBnXkFtZTgwNzY0NzI3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0043552","name":"Taliesin Jaffe","idIMDB":"nm0043552"},"actorId":"nm0043552","character":"Christopher Floyd","urlCharacter":"http://www.imdb.com/character/ch0002903","main":true},{"actorName":"James McEachin","urlProfile":"http://www.imdb.com/name/nm0533013","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NjQyNDc5Ml5BMl5BanBnXkFtZTgwNDQ5MDc1MjE@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 May 1930","placeOfBirth":" Rennert, North Carolina, USA","birthName":"James McEachin","bio":"James McEachin was born on May 20, 1930 in Rennert, North Carolina. At the age of 18 he joined the US Armed Forces and served in the Korean War earning many medals of valor to include the Purple Heart and Silver Star. After leaving the military he spent time as a policeman and then fireman before moving to California and becoming a record producer. After a short stint in the music industry McEachin went into acting and spent many years in film and television. Not yet content he took time away from acting to become an award-winning author and maker of audio books. In 2005 McEachin was appointed as a US Army Reserve Ambassador and spends his free time speaking to soldiers, veterans and America. In late 2006 he produced the film-short Old Glory, a film short for the soldier, veteran and patriot in us all. In 2008 McEachin opened his one-man play, Above the Call; Beyond the Duty at the John F. Kennedy Center, Washington, DC and his since played Casa Manana, Ft. Worth, TX, Brentwood Theater, Los Angeles, CA, and Merle Reskin Theatre, Chicago, IL. McEachin is married with three grown children and resides in So Cal.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NjQyNDc5Ml5BMl5BanBnXkFtZTgwNDQ5MDc1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0533013","name":"James McEachin","idIMDB":"nm0533013"},"actorId":"nm0533013","character":"Victor Milson","urlCharacter":"http://www.imdb.com/character/ch0002902","main":true},{"actorName":"Mary Jo Deschanel","urlProfile":"http://www.imdb.com/name/nm0221044","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MzY4Njk3OF5BMl5BanBnXkFtZTcwOTk1MDQ4Nw@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 November 1945","placeOfBirth":" Los Angeles, California, USA","birthName":"Mary Josephine Weir","height":"5' 2\" (1.57 m)","bio":"Mary Jo Deschanel was born on November 25, 1945 in Los Angeles, California, USA as Mary Josephine Weir. She is an actress, known for The Patriot (2000), The Right Stuff (1983) and 2010: The Year We Make Contact (1984). She has been married to Caleb Deschanel since July 8, 1972. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MzY4Njk3OF5BMl5BanBnXkFtZTcwOTk1MDQ4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0221044","name":"Mary Jo Deschanel","idIMDB":"nm0221044"},"actorId":"nm0221044","character":"Betty Fernandez, Bowman's Wife","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elya Baskin","urlProfile":"http://www.imdb.com/name/nm0059946","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMzk3OTU5OV5BMl5BanBnXkFtZTcwMjIxMDM5MQ@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 August 1950","placeOfBirth":" Riga, USSR [now Latvia]","birthName":"Elya Zalmanovich Baskin","bio":"Elya Baskin is a Russian-American Latvian actor known for his work on Spider-Man 2 (2004), The Name of the Rose (1986) and Spider-Man 3 (2007). He has been married to Marina since 1995. They have one child. He has ultimately become one of the most popular choices whenever a Russian is needed in a TV-episode or a major movie production due to his ancestry and accent, best known for his roles in the films Air Force One, October Sky and Thirteen Days. He is known for the TV Show True Blue. Elya Baskin was born on August 11, 1950 in Riga, USSR [now Latvia] as Elya Zalmanovich Baskin, the son of Zalman Baskin and Frieda Baskin, a Russian Jewish family. He attended and is a graduate of Moscow's prestigious Theatre and Variety Arts College and won a Festival of Young Actors Award at the Moscow Comedy Theatre; Baskin was virtually assured of a successful career in the Soviet Union. About his choice of profession in the former USSR he said: \"In Russia, being an actor when it was still the Soviet Union was one of the most prestigious professions. It was like being a doctor here. You had to graduate from one of very few theatre schools, which were all four-year colleges. Without the degree, nobody would hire you. We worked very hard because we wanted to get through the four years and get the diploma, but after you graduate and go to the theatre, the actors don't work like actors work here. That's what fascinated me more than anything else here, how professional people were, how hard they worked, and how much harder it was to get work. In Russia we were always taught that we had the best theatre schools, but when I came here and started to work, I saw how wrong we were. You really have to be the best to get the part here.\" Then he built a formidable reputation on the European stage. Baskin immigrated to the United States in 1976 when pre-perestroika emigration rules were relaxed in 1976 and he came to Hollywood, although he spoke no English. About the change from stage to screen work, he said: \"In Moscow, theatre was my passion, my love, and I did very little television and film. Once I came here, I thought that because of the language barrier -I didn't know that you don't loop the films like we do in Europe- I'll try to pursue TV and films. For some reason I lost interest in theatre. Film work became so much more fascinating, the whole building of the character, no continuity, the whole camera aspect. Those are the things that really fascinated me. The language was the biggest challenge. Instead of concentrating on the development of the character, you're thinking about your mouth, about putting your tongue in the right position so people can understand you. I've worked for 20 years, and I will never be able to do a role in English like I would do it in my native tongue, and I know it. Of course, with the years it becomes easier, and more often than not I'm cast as a character with an accent.\" Tall, instantly identifiable Eastern European actor Elya Baskin fit the bill in Hollywood for ethnic character portrayals, especially characters with a Slavic background and an amiable demeanor; he also frequently exhibited a slightly zany undercurrent that became something of a trademark. About his being stereotyped casted, he said: \"I feel that, of course, I'm stereotyped. But what can you do? I can't imagine that some director would cast me as a sheriff from Alabama. But you can do exactly what you said: With every character, they're different people, and it's up to you what you do with them. This is your challenge. It doesn't matter how limited your piece of the pie that you can use, you always try to do the best that you can. How can I be upset for not being cast as a Southern sheriff? That's what you call acting; you try to utilize whatever you can to be a different person every time.\" He achieved his international breakthrough, however, at the hands of Hollywood giant Paul Mazursky, who cast him opposite Robin Williams as the clownish Russian circus performer Anatoly in the masterful serio-comedy Moscow on the Hudson (1984) where the actor's birdlike arm-flapping became one of the film's most poignant and memorable images. An additional collaboration with Mazursky followed, the 1989 smash Enemies: A Love Story; in the meantime, Baskin began to rack up a litany of roles in additional A-list projects, including 2010: The Year We Make Contact (1984), Vice Versa (1988), and Love Affair (1994). The Pickle (1993) re-teamed Baskin and Mazursky for a third occasion; unfortunately, it failed to match the critical or commercial success of its predecessors. Baskin remained in full flower through the end of the following decade, with a memorable comedic turn as Vladimir on the sitcom Mad About You and prominent roles in the big-screen projects Spider-Man 3 and The Dukes (both 2007). And, of course, he has continued playing guest roles in TV series like The West Wing, Alias, The Closer, Criminal Minds, Heroes and Cold Case. About being an actor, he said: \"This is the strangest, most dangerous, insecure, and wonderful life. I wouldn't choose anything else [other than this]\". He emigrated to the United States in 1976 and became a United States citizen on April 1, 1985. He is married to Marina Baskin since 1995. They have one child, a daughter named Michelle Baskin.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMzk3OTU5OV5BMl5BanBnXkFtZTcwMjIxMDM5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0059946","name":"Elya Baskin","idIMDB":"nm0059946"},"actorId":"nm0059946","character":"Maxim Brajlovsky","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Saveliy Kramarov","urlProfile":"http://www.imdb.com/name/nm0469434","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjJjOWU5ZDgtNzExZS00YThlLWI4NDItNzVmMzhjYzliYWY5XkEyXkFqcGdeQXVyNjMwOTA1MDM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1934","placeOfBirth":" Moscow, Russian SFSR, USSR [now Russia]","birthName":"Savely Viktorovich Kramarov","height":"5' 6½\" (1.69 m)","bio":"A Russian comedian who gave up a successful film career in his homeland for religious freedom and bit parts in the United States. He made 42 films in the former Soviet Union before he was allowed to leave in the early 1980's.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjJjOWU5ZDgtNzExZS00YThlLWI4NDItNzVmMzhjYzliYWY5XkEyXkFqcGdeQXVyNjMwOTA1MDM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0469434","name":"Saveliy Kramarov","idIMDB":"nm0469434"},"actorId":"nm0469434","character":"Dr. Vladimir Rudenko","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Oleg Rudnik","urlProfile":"http://www.imdb.com/name/nm0748890","urlPhoto":"","biography":{"bio":"Oleg Rudnik is an actor, known for 2010: The Year We Make Contact (1984), Moscow on the Hudson (1984) and Company Business (1991).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0748890","name":"Oleg Rudnik","idIMDB":"nm0748890"},"actorId":"nm0748890","character":"Dr. Vasili Orlov","urlCharacter":"http://www.imdb.com/character/ch0002905","main":true},{"actorName":"Natasha Shneider","urlProfile":"http://www.imdb.com/name/nm0794636","urlPhoto":"","biography":{"dateOfBirth":"22 May 1956","placeOfBirth":" Riga, Latvian SSR, USSR","bio":"Natasha Shneider was born on May 22, 1956 in Riga, Latvian SSR, USSR. She was married to Alain Johannes. She died on July 2, 2008 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0794636","name":"Natasha Shneider","nicknames":["Natasha Kapustin"],"idIMDB":"nm0794636"},"actorId":"nm0794636","character":"Irina Yakunina","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0086837","urlIMDB":"http://www.imdb.com/title/tt0086837","business":{"budget":{"money":"$28,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$7,393,361","country":"USA","day":"11","month":"07","year":"2012","remarks":"1,126 Screens"}],"gross":[{"money":"SEK","country":"1,727,340","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1984/\">1984</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 56 min (116 min)"],"soundMix":["70 mm 6-Track (70 mm prints)","Dolby (35 mm prints)"],"color":["Color (Metrocolor)"],"aspectRatio":["2.20 : 1 (70 mm prints)","2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Metrocolor, USA"],"filmLength":["3,184 m (Sweden, 35 mm)","3,980 m (Sweden, 70 mm)","710 m (8 mm)"],"negativeFormat":["65 mm (special effects)","35 mm"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm","70 mm (blow-up)","8 mm (anamorphic)"]},"rating":"6.8","filmingLocations":[{"location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA"}],"rated":"PG","awards":[{"award":"Academy Awards, USA 1985","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Art Direction-Set Decoration","names":[{"name":"Albert Brenner","id":"nm0107447","role":null},{"name":"Rick Simpson","id":"nm0801173","role":null}]},{"category":"Best Costume Design","names":[{"name":"Patricia Norris","id":"nm0635876","role":null}]},{"category":"Best Sound","names":[{"name":"Michael J. Kohut","id":"nm0463489","role":null},{"name":"Aaron Rochin","id":"nm0734099","role":null},{"name":"Carlos Delarios","id":"nm0216467","role":null},{"name":"Gene S. Cantamessa","id":"nm0134481","role":null}]},{"category":"Best Effects, Visual Effects","names":[{"name":"Richard Edlund","id":"nm0249430","role":null},{"name":"Neil Krepela","id":"nm0470878","role":null},{"name":"George Jenson","id":"nm0421453","role":null},{"name":"Mark Stetson","id":"nm0828078","role":null}]},{"category":"Best Makeup","names":[{"name":"Michael Westmore","id":"nm0922878","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1985","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Science Fiction Film","names":[]},{"category":"Best Costumes","names":[{"name":"Patricia Norris","id":"nm0635876","role":null}]},{"category":"Best Special Effects","names":[{"name":"Richard Edlund","id":"nm0249430","role":null}]}]}]},{"award":"Hugo Awards 1985","titlesAwards":[{"titleAwardOutcome":"Won Hugo","categories":[{"category":"Best Dramatic Presentation","names":[{"name":"Peter Hyams","id":"nm0001382","role":"screenplay/director"},{"name":"Arthur C. Clarke","id":"nm0002009","role":"based on the novel by"}]}]}]}],"votes":"42,722","type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"}],"keywords":{"keywords":["monolith","computer","stars","space","year 2010","sequel","2010s","spaceship setting","friends who live together","message from outer space","one word title","trapped in space","moon","ancient astronaut","space expedition","digit in title","author cameo","director also cinematographer","aerobraking","year in title","second part","sunset","egyptian pyramid","cult film","eiffel tower paris","television news","space exploration","russian","radio telescope","presumed dead","new mexico","marriage","lincoln memorial washington d.c.","hyperventilation","ghost ship","father son relationship","engineer","deceit","correspondence","coma","calculator","american","sequel to cult favorite","washington d.c.","cryonics","outer space","spacewalk","astronaut","hospital","nasa","joint mission","stasis","artificial intelligence","jupiter the planet","cosmonaut","creator creation relationship","spacecraft","cold war","cryogenics","dolphin","white house","death of friend","based on novel","number in title","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 09:00:45"}}