{"data":{"movies":[{"title":"Copacabana","originalTitle":"","year":"1947","releaseDate":"19470530","directors":[{"name":"Alfred E. Green","id":"nm0337586"}],"writers":[{"name":"László Vadnay","id":"nm0883017"},{"name":"László Vadnay","id":"nm0883017"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MTM0NDU0Nl5BMl5BanBnXkFtZTcwNDYxNDIyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Musical"],"plot":"Talent agent Lionel Devereaux sells his girlfriend/client Carmen Novarro to New York City's famous Copacabana nightclub as a Latin-American singer/dancer and, pressed for another act, he sells her again, this time with a blonde wig and Moroccan veil, as a French singer...for the same presentation. The wear and tear on Carmen, changing back-and-forth between numbers, leaves to a heated exchange of words between the performer and her fiancé agent. This leads to the disappearance of Carmen's alter ego, which arouses suspicions by the management...and the police.","simplePlot":"Agent has his only client pose as both a French chanteuse and Brazilian bombshell to fool nightclub owner.","actors":[{"actorName":"Groucho Marx","urlProfile":"http://www.imdb.com/name/nm0000050","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3OTA3NDA0NV5BMl5BanBnXkFtZTYwNzUzMzQ2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 October 1890","placeOfBirth":" New York City, New York, USA","birthName":"Julius Henry Marx","height":"5' 7½\" (1.71 m)","bio":"The bushy-browed, cigar-smoking wise-cracker with the painted-on moustache and stooped walk was the leader of The Marx Brothers. With one-liners that were often double entendres, Groucho never cursed in any of his performances and said he never wanted to be known as a dirty comic. With a great love of music and singing (The Marx Brothers started as a singing group), one of the things Groucho was best known for was his rendition of the song \"Lydia the Tattooed Lady.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3OTA3NDA0NV5BMl5BanBnXkFtZTYwNzUzMzQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000050","name":"Groucho Marx","idIMDB":"nm0000050"},"actorId":"nm0000050","character":"Lionel Q. Devereaux","urlCharacter":"http://www.imdb.com/character/ch0113822","main":true},{"actorName":"Carmen Miranda","urlProfile":"http://www.imdb.com/name/nm0000544","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA5NjExODc4OF5BMl5BanBnXkFtZTYwNzYwMTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1909","placeOfBirth":" Marco de Canavezes, Portugal","birthName":"Maria do Carmo Miranda da Cunha","height":"5' (1.52 m)","bio":"Carmen Miranda was born Maria do Carmo Miranda da Cunha on February 9, 1909, near Porto, Portugal, in the town of Marco de Canavezes. Not long after her birth her family moved to Brazil, where her father was involved in the produce business. The family settled in the then-capital city of Rio de Janeiro. After leaving school, Carmen got a job at a local store, and often began singing on the job. Before long she was discovered and got a singing job on a local radio station. She ultimately got a recording contract with RCA. By 1928 she was a genuine superstar in Brazil. As with other popular singers of the era, she eventually made her way into the film world. She made her debut in the Brazilian documentary A Voz do Carnaval (1933). Two years later she appeared in her first feature film, Alô, Alô, Brasil (1935). However. it was Estudantes (1935) that seemed to solidify Carmen in the minds of the Brazilian movie audiences. Now they realized she could act as well as sing. Although there was three years between \"Alo, Alo Carnaval\" and Banana-da-Terra (1939), Carmen continued to churn out musical hits in Brazil. The latter film would be the last in her home country. In late 1939 Carmen arrived, with much fanfare in the press, in New York City. She was now ready to capture Americans' hearts with her talent. She appeared in some musical revues on Broadway and, just as everyone thought, was a huge hit. In 1940 Carmen was signed to appear in the Twentieth Century-Fox production Down Argentine Way (1940), with Betty Grable and Don Ameche. The only complaint that critics had was the fact that Carmen was not on the screen enough. In 1941 she was, again, teamed with Ameche in addition to Alice Faye in That Night in Rio (1941). The film was extremely popular with the theater patrons. Her unique songs went a long way in making her popular. It was after Week-End in Havana (1941) that American cartoon artists began to cash in on Carmen's ever-growing popularity. In the 1930s and 1940s cartoons were sometimes shown as a prelude to whatever feature film was showing. Sure enough, the cartoon version of Carmen came wriggling across the screen, complete with her trademark fruit hat and wide, toothy grin. In 1942 Carmen starred in Springtime in the Rockies (1942) with Betty Grable and Cesar Romero, both of whom she had worked with before. It was shortly after this that America began adopting her style of dress as the latest fad. 1944 saw her in three films: Something for the Boys (1944), Four Jills in a Jeep (1944) and Greenwich Village (1944). The first two did well at the box-office, but the last one left a lot to be desired. It was her last busy year in film. Carmen made one film each in 1945, '46, '47 and '48. After that she didn't make a film for two years, until Nancy Goes to Rio (1950), a production for MGM. Once again didn't make a film for several years, returning with Scared Stiff (1953). She did stay busy, singing on the nightclub circuit and appearing on the relatively new medium of television. However, \"Scared Stiff\" was her final performance on the silver screen. On August 4, 1955, she suffered a heart attack, although she didn't realize it at the time, during a video taping of The Jimmy Durante Show (1954). She went home after attending a party. Early the next morning, on August 5, Carmen suffered a fatal heart attack. She was just 46 years old. Her body was flown to her adopted country of Brazil, where her death was declared a period of national mourning.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA5NjExODc4OF5BMl5BanBnXkFtZTYwNzYwMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000544","name":"Carmen Miranda","nicknames":["The Brazilian Bombshell","A Pequena Notável"],"idIMDB":"nm0000544"},"actorId":"nm0000544","character":"Carmen Navarro / Mlle Fifi","urlCharacter":"http://www.imdb.com/character/ch0482591","main":true},{"actorName":"Steve Cochran","urlProfile":"http://www.imdb.com/name/nm0168215","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGZmZGEwNTItZGJhYy00OTgyLWJiMzYtYzk1OGI3NGZlMzFmXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1917","placeOfBirth":" Eureka, California, USA","birthName":"Robert Alexander Cochran","height":"6' (1.83 m)","bio":"Born Robert Alexander Cochran, son of a California lumberman, he worked mostly in the theatre before landing a contract with Samuel Goldwyn in 1945. His debut was Wonder Man (1945) with Virginia Mayo and Danny Kaye. From 1949 to 1952, he was signed to Warner Brothers, then started up his own production company. In 1965 he sailed off in his yacht to Guatemala to look for suitable filming locations, but died of a lung infection before reaching land.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGZmZGEwNTItZGJhYy00OTgyLWJiMzYtYzk1OGI3NGZlMzFmXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0168215","name":"Steve Cochran","idIMDB":"nm0168215"},"actorId":"nm0168215","character":"Steve Hunt","urlCharacter":"http://www.imdb.com/character/ch0510252","main":true},{"actorName":"Andy Russell","urlProfile":"http://www.imdb.com/name/nm0750991","urlPhoto":"","biography":{"dateOfBirth":"16 September 1919","placeOfBirth":" Los Angeles, California, USA","birthName":"Andrés Rabago","bio":"Born in Los Angeles to Mexican immigrant parents, Andy Russell, who took his professional name from one of his idols, Russ Columbo, acheived his greatest U.S. popularity in the 1940s. As with Columbo and Bing Crosby before him, he started out singing with Gus Arnheim's orchestra at the Cocoanut Grove, but, at only 13, he was so young that Arnheim had to become his legal guardian to permit him to travel out of state. Possessed of a romantic baritone voice, he sang songs in English and Spanish, his biggest hit being \"Besame Mucho\" (Capitol: 1945). In the early 1950s, he re-located to Mexico, where he remained a major star until his death. He remained a U.S. citizen, however, and still made appearences in the U.S. from time to time.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0750991","name":"Andy Russell","idIMDB":"nm0750991"},"actorId":"nm0750991","character":"Andy Russell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gloria Jean","urlProfile":"http://www.imdb.com/name/nm0419849","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjc0Y2UxNDMtYThjOC00YzAzLWFkMGQtMTFkMjU2NWU1NTM3XkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 April 1926","placeOfBirth":" Buffalo, New York, USA","birthName":"Gloria Jean Schoonover","bio":"Gloria Jean Schoonover was born on April 14, 1926 in Buffalo, New York. Her family moved to Scranton, Pennsylvania shortly after that; this is where Gloria spent the early part of her childhood. Her father owned a music store, while her mother, who had been a bareback rider in a circus, took care of Gloria and her three siblings. Gloria's singing ability was discovered at a young age, and by age five she was singing in the Scranton area. At age twelve, Gloria was taken to an audition by Universal director Joe Pasternak, who was looking for a new child singer to replace studio icon Deanna Durbin, who was being steered into adult and ingénue roles. Although hundreds of Shirley-Temple-perfect girls competed, the natural-looking Gloria was chosen, and she and her mother were soon on their way to Hollywood. In 1939, Gloria made her first film: \"The Under-Pup\", which made her an instant hit with moviegoers. Happy with their young coloratura soprano, Universal cast her in \"If I Had My Way\", which co-starred Bing Crosby. Following that was what many consider Gloria's best movie: \"A Little Bit of Heaven\". Following this was a co-starring role with W.C. Fields in \"Never Give a Sucker an Even Break\", which is the most seen of her movies today. At this point in 1941, Gloria was at the pinnacle of her career, and one would imagine that her star would soar. Unfortunately, it didn't work that way. Gloria had outgrown her Little Miss Fixit roles (as had Durbin a few years earlier), but Durbin was in command of the older-girl roles for the better pictures. At a loss for what to do with Jean, Universal moved her to the \"Hepcat\" movies, which appealed to the teenagers of that day. \"What's Cooking\", \"Get Hep to Love\", \"When Johnny Comes Marching Home\", and \"It Comes Up Love,\" were all shot in 1942. \"Mr. Big,\" and \"Moonlight in Vermont\" followed in 1943. All of the above were stock B films which appealed to teenagers of the time. Gloria (as did many Universal stars) had a few seconds on-screen in the war-effort picture, \"Follow the Boys\", in 1944. After that came a rather good picture \"Follow My Rhythm\" with Mel Torme, who became a close friend. Then, in \"Ghost Catchers\", she was teamed with popular comedians Ole Olsen and Chic Johnson. The rather forgettable \"Reckless Age\" was next, its main distinction being that it was the first movie in which Gloria played a more mature role. Gloria was to star in one of four episodes of the Julien Duvivier's \"Flesh and Fantasy,\" alongside such stars as Edward G. Robinson, Charles Boyer, and Barbara Stanwyck. But the movie was deemed to be too long, and Gloria's segment was cut out. Some awful footage was added, and the end result was \"Destiny\". Gloria's performance was given rave reviews, but the movie itself met with modest success. Following this, Gloria did three more films at Universal: \"I'll Remember April\", \"River Gang\", and \"Easy to Look at\". At this point, upon the (bad) advice of her agent, Gloria decided not to renew her contract at Universal, opting instead to go on tour. The tour did not work out as well as expected, and Gloria returned to the Hollywood in 1947, but she found virtually nobody interested in her services. Groucho Marx gave her a minor role in his picture \"Copacabana\". This appearance ultimately landed her four more roles in: \"I Surrender, Dear\", \"Manhattan Angel\", \"An Old Fashioned Girl\" and \"There's a Girl in My Heart\". As the 1950's began, television was taking off in popularity. Gloria made several singing shorts that were aired during television's early days. Other than that and a few guest appearances on TV series, Gloria's acting career was virtually finished. She appeared in the forgettable \"Air Strike\" in 1955 and she worked in a couple of movies that were never released. Jerry Lewis found her working as a restaurant hostess and gave her a part in his movie \"The Ladies' Man\", which was meant to re-launch her career. Unfortunately, her scenes were cut from the final release. Gloria married shortly after that movie, a short-lived marriage which happily produced a son. At that point, Gloria virtually retired from the screen. She went to work for Redken (a cosmetics firm) until her retirement in 1993. Gloria was reintroduced to a limelight of sorts by the magic of Ebay, where her movies (many of which are in the public domain) were being sold. Through the help of her sister Bonnie (who handled the computer end of things: Gloria didn't do \"Windows\"), Gloria got onto Ebay herself, selling copies of the movies she appeared in, as well as signed photographs (copies of old publicity shots) of herself. Spurred by the popularity of these, Gloria published her autobiography \"Gloria Jean: A Little Bit of Heaven\" in 2005. After her sister Bonnie's death in 2007, Gloria moved to Hawaii, where she now lives with her son and his family.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjc0Y2UxNDMtYThjOC00YzAzLWFkMGQtMTFkMjU2NWU1NTM3XkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0419849","name":"Gloria Jean","idIMDB":"nm0419849"},"actorId":"nm0419849","character":"Anne Stuart","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Abel Green","urlProfile":"http://www.imdb.com/name/nm0337578","urlPhoto":"","biography":{"dateOfBirth":"3 June 1900","placeOfBirth":" New York City, New York, USA","bio":"Editor and theatrical trade reporter ('Variety'), songwriter, composer, editor, author and producer. He organized theatrical news coverage of European and South American capitols, and edited Variey since 1933. He co-authored and produced the Philco-Variety Hall of Fame. Joining ASCAP in 1952, his chief musical collaborators were Jesse Greer, Pat Ballard, Fletcher Henderson and Al Stillman. His popular-song compositions include \"Variety Stomp\", \"Variey Is the Spice of Life\", \"Who's Who Are You?\", \"Encore\", \"Humming Waters\" and \"Blue Baby\".","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0337578","name":"Abel Green","idIMDB":"nm0337578"},"actorId":"nm0337578","character":"Abel Green","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Louis Sobol","urlProfile":"http://www.imdb.com/name/nm0811844","urlPhoto":"","biography":{"dateOfBirth":"10 August 1896","placeOfBirth":" Yelizavetgrad, Kherson Governorate, Russian Empire [now Kirovohrad, Ukraine]","bio":"Louis Sobol was born on August 10, 1896 in Yelizavetgrad, Kherson Governorate, Russian Empire. He was an actor and producer, known for Copacabana (1947), The Radio Murder Mystery (1933) and Peeking Tom (1933). He was married to Peggy Antman Strohl and Lee Cantor. He died on February 8, 1986 in New York City, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0811844","name":"Louis Sobol","idIMDB":"nm0811844"},"actorId":"nm0811844","character":"Louis Sobol","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Earl Wilson","urlProfile":"http://www.imdb.com/name/nm0933350","urlPhoto":"","biography":{"dateOfBirth":"3 May 1907","placeOfBirth":" Rockford, Ohio, USA","birthName":"Harvey Earl Wilson","bio":"Earl Wilson was born on May 3, 1907 in Rockford, Ohio, USA as Harvey Earl Wilson. He was an actor and writer, known for Stage Entrance (1951), The Bob Hope Christmas Special (1968) and Cavalcade of Broadway: Village Barn (1950). He was married to Rosemary Lyons. He died on January 16, 1987 in Yonkers, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0933350","name":"Earl Wilson","idIMDB":"nm0933350"},"actorId":"nm0933350","character":"Earl Wilson","urlCharacter":"http://www.imdb.com/character/ch0241909","main":true},{"actorName":"The De Castro Sisters","urlProfile":"http://www.imdb.com/name/nm5668187","urlPhoto":"","biography":{"bio":"The De Castro Sisters is an actress, known for Copacabana (1947), Thrills of Music: Miguelito Valdez and Orchestra (1949) and The Helen Morgan Story (1957).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5668187","name":"The De Castro Sisters","idIMDB":"nm5668187"},"actorId":"nm5668187","character":"Singing Trio","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Raul Reyes","urlProfile":"http://www.imdb.com/name/nm1066408","urlPhoto":"","biography":{"bio":"Raul Reyes is an actor, known for Copacabana (1947), Freddie Martin & His Orchestra (1935) and Texaco Star Theatre (1948).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1066408","name":"Raul Reyes","idIMDB":"nm1066408"},"actorId":"nm1066408","character":"Rhumba Dancer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eva Reyes","urlProfile":"http://www.imdb.com/name/nm1066407","urlPhoto":"","biography":{"bio":"Eva Reyes was an actress, known for Copacabana (1947), Freddie Martin & His Orchestra (1935) and Texaco Star Theatre (1948). She died on March 20, 1970 in Miami, Florida, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1066407","name":"Eva Reyes","idIMDB":"nm1066407"},"actorId":"nm1066407","character":"Rhumba Dancer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ralph Sanford","urlProfile":"http://www.imdb.com/name/nm0762596","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTVjY2ZhNTYtMTFkYS00OTFhLWIzNjQtZjY5NWE2OGRjNjZiXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 May 1899","placeOfBirth":" Springfield, Massachusetts, USA","bio":"Born on May 21, 1899 in Springfield, Massachusetts, veteran character actor Ralph Sanford came from a theatrical family. His parents were in the business, although not as actors. An actor and stage manager on the Broadway stage in the early years of his career, Sanford appeared in such productions as \"Half a Widow\" (1927), \"The Constant Sinner\" (1931) and \"Between Two Worlds\" (1934). He began his screen work in 1937 at Vitaphone Pictures working in shorts, as a burly foil to such established two-reeler comics as Shemp Howard, Roscoe 'Fatty' Arbuckle and Fritz Feld. He found steady employment in primarily unbilled bits (truck driver, guard, etc.), notably for Paramount. He upgraded to occasional featured parts in such films as Undercover Agent (1939), Wildcat (1942), A Night for Crime (1943) and My Pal Trigger (1946), but for the most part he was utilized solely in \"tough guy\" parts. He would play minor roles for other studios as well, usually typed as a two-bit gangster or hassled cop. He continued his busy schedule throughout the 1950s with TV work and had a recurring part as Jim \"Dog\" Kelly on Hugh O'Brian's The Life and Legend of Wyatt Earp (1955) series for the 1958-59 season. The heavyset actor died at the age of 64, succumbing to a heart ailment on June 20, 1963.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTVjY2ZhNTYtMTFkYS00OTFhLWIzNjQtZjY5NWE2OGRjNjZiXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0762596","name":"Ralph Sanford","idIMDB":"nm0762596"},"actorId":"nm0762596","character":"Liggett","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Igor Dega","urlProfile":"http://www.imdb.com/name/nm0214623","urlPhoto":"","biography":{"dateOfBirth":"9 January 1916","placeOfBirth":" Russian Empire","birthName":"Igor De Navrotsky","bio":"Igor Dega was born on January 9, 1916 in the Russian Empire as Igor De Navrotsky. He was an actor, known for Copacabana (1947), My Wild Irish Rose (1947) and Cuban Pete (1946). He was married to Ann Dvorak. He died on July 5, 1976 in Burbank, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0214623","name":"Igor Dega","idIMDB":"nm0214623"},"actorId":"nm0214623","character":"Dance Specialty","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kay Marvis","urlProfile":"http://www.imdb.com/name/nm0329831","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzMzNmY5MDEtZGUxMC00NDVlLTkwZWQtZWZmYmU4OWZkOTY3L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 August 1923","placeOfBirth":" New Jersey, USA","birthName":"Catherine Dittig","bio":"Kay Marvis was born on August 29, 1923 in New Jersey, USA as Catherine Dittig. She was an actress, known for Copacabana (1947), Kid Dynamite (1943) and Block Busters (1944). She was married to Groucho Marx and Leo Gorcey. She died on April 9, 2000 in Mendocino County, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzMzNmY5MDEtZGUxMC00NDVlLTkwZWQtZWZmYmU4OWZkOTY3L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0329831","name":"Kay Marvis","nicknames":["Kay"],"idIMDB":"nm0329831"},"actorId":"nm0329831","character":"Cigarette Girl / Finale Performer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Merle McHugh","urlProfile":"http://www.imdb.com/name/nm0570473","urlPhoto":"","biography":{"bio":"Merle McHugh is an actress, known for Copacabana (1947) and Living in a Big Way (1947).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0570473","name":"Merle McHugh","idIMDB":"nm0570473"},"actorId":"nm0570473","character":"Copa Girl","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0039277","urlIMDB":"http://www.imdb.com/title/tt0039277","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"22","month":"10","year":"1946","remarks":null},{"money":null,"country":null,"day":"22","month":"01","year":"1947","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 32 min (92 min)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.3","filmingLocations":[{"location":"Samuel Goldwyn Studios - 7200 Santa Monica Boulevard, West Hollywood, California, USA"}],"rated":"PASSED","awards":[],"votes":"932","type":"Movie","companyCreditsSimple":[{"idCompany":"co0386613","name":"Beacon Productions (III)"}],"keywords":{"keywords":["singer","nightclub","performer","police","new york city","song","talent agent","suspect","wig","show business","performance","gangster","fiance fiancee relationship","tambourine","fish as food","usa","seal","stock footage","newspaper","trio","showgirl","reporter","cigarette smoking","fiancee","spanish accent","sister sister relationship","place name in title","reference to alice faye","investigator","elevator","police detective","slang","1940s","reference to cupid","peanut","cigarette girl","orchestra","microphone","desk clerk","dressing room","reference to betty grable","orchestra leader","daydream","spanish","dancer","hotel","vaudeville","man with glasses","hat check girl","reference to claudette colbert","detective","cheap hotel","reference to rita hayworth","turkey as food","singing","borough name in title","magazine","egg","reference to sam goldwyn","reference to abraham lincoln","reference to david o selznick","dancing","sleeping on the job","one word title","animal actor","monkey","french accent","gossip columnist","clerk","reference to greer garson","entertainer","trained seal","reference to leo mccarey","unable to pay","reference to jane russell","cigar smoking","dual role","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 07:54:32"}}