{"data":{"movies":[{"title":"Giant","originalTitle":"","year":"1956","releaseDate":"19561124","directors":[{"name":"George Stevens","id":"nm0828419"}],"writers":[{"name":"Edna Ferber","id":"nm0272209"},{"name":"Fred Guiol","id":"nm0347451"}],"runtime":"201 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWQ3ZmZhMmQtODQyMS00Y2Q0LThlOTAtM2NiMDMyNDdlYmQ0L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Drama","Western"],"plot":"Texan rancher Bick Benedict visits a Maryland farm to buy a prize horse. Whilst there he meets and falls in love with the owner's daughter Leslie, they are married immediately and return to his ranch. The story of their family and its rivalry with cowboy and (later oil tycoon) Jett Rink unfolds across two generations.","simplePlot":"Sprawling epic covering the life of a Texas cattle rancher and his family and associates.","actors":[{"actorName":"Elizabeth Taylor","urlProfile":"http://www.imdb.com/name/nm0000072","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTc5MDg0OF5BMl5BanBnXkFtZTgwODE4NjMzNDE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1932","placeOfBirth":" Hampstead, London, England, UK","birthName":"Elizabeth Rosemond Taylor","height":"5' 2\" (1.57 m)","bio":"Elizabeth Rosemond Taylor was considered one of the last, if not the last, major star to have come out of the old Hollywood studio system. She was known internationally for her beauty, especially for her violet eyes, with which she captured audiences early on in her youth and kept the world hooked on with since. Taylor was born on February 27, 1932 in London, England. Although she was born an English subject, her parents, Sara Sothern (née Sara Viola Warmbrodt) and Francis Lenn Taylor, were Americans, art dealers from St. Louis, Missouri (her father had gone to London to set up a gallery). Her mother had been an actress on the stage, but gave up that vocation when she married. Elizabeth lived in London until the age of seven, when the family left for the US when the clouds of war began brewing in Europe in 1939. They sailed without her father, who stayed behind to wrap up the loose ends of the art business. The family relocated to Los Angeles, where Mrs. Taylor's own family had moved. Mr. Taylor followed not long afterward. A family friend noticed the strikingly beautiful little Elizabeth and suggested that she be taken for a screen test. Her test impressed executives at Universal Pictures enough to sign her to a contract. Her first foray onto the screen was in There's One Born Every Minute (1942), released when she was ten. Universal dropped her contract after that one film, but Elizabeth was soon picked up by MGM. The first production she made with that studio was Lassie Come Home (1943), and on the strength of that one film, MGM signed her for a full year. She had minuscule parts in her next two films, The White Cliffs of Dover (1944) and Jane Eyre (1943) (the former made while she was on loan to 20th Century-Fox). Then came the picture that made Elizabeth a star: MGM's National Velvet (1944). She played Velvet Brown opposite Mickey Rooney. The film was a smash hit, grossing over $4 million. Elizabeth now had a long-term contract with MGM and was its top child star. She made no films in 1945, but returned in 1946 in Courage of Lassie (1946), another success. In 1947, when she was 15, she starred in Life with Father (1947) with such heavyweights as William Powell, Irene Dunne and Zasu Pitts, which was one of the biggest box office hits of the year. She also co-starred in the ensemble film Little Women (1949), which was also a box office huge success. Throughout the 1950s, Elizabeth appeared in film after film with mostly good results, starting with her role in the George Stevens film A Place in the Sun (1951), co-starring her good friend Montgomery Clift. The following year, she co-starred in Ivanhoe (1952), one of the biggest box office hits of the year. Her busiest year was 1954. She had a supporting role in the box office flop Beau Brummell (1954), but later that year starred in the hits The Last Time I Saw Paris (1954) and Elephant Walk (1954). She was 22 now, and even at that young age was considered one of the world's great beauties. In 1955 she appeared in the hit Giant (1956) with James Dean. Sadly, Dean never saw the release of the film, as he died in a car accident in 1955. The next year saw Elizabeth co-star with Montgomery Clift in Raintree County (1957), an overblown epic made, partially, in Kentucky. Critics called it dry as dust. In addition, Clift was seriously injured during the film, with Taylor helping save his life. Despite the film's shortcomings and off-camera tragedy, Elizabeth was nominated for an Academy Award for her portrayal of Southern belle Susanna Drake. However, on Oscar night the honor went to Joanne Woodward for The Three Faces of Eve (1957). In 1958 Elizabeth starred as Maggie Pollitt in Cat on a Hot Tin Roof (1958). The film received rave reviews from the critics and Elizabeth was nominated again for an Academy Award for best actress, but this time she lost to Susan Hayward in I Want to Live! (1958). She was still a hot commodity in the film world, though. In 1959 she appeared in another mega-hit and received yet another Oscar nomination for Suddenly, Last Summer (1959). Once again, however, she lost out, this time to Simone Signoret for Room at the Top (1959). Her Oscar drought ended in 1960 when she brought home the coveted statue for her performance in BUtterfield 8 (1960) as Gloria Wandrous, a call girl who is involved with a married man. Some critics blasted the movie but they couldn't ignore her performance. There were no more films for Elizabeth for three years. She left MGM after her contract ran out, but would do projects for the studio later down the road. In 1963 she starred in Cleopatra (1963), which was one of the most expensive productions up to that time--as was her salary, a whopping $1,000,000. The film took years to complete, due in part to a serious illness during which she nearly died. This was the film where she met her future and fifth husband, Richard Burton (the previous four were Conrad Hilton, Michael Wilding, Michael Todd--who died in a plane crash--and Eddie Fisher). Her next films, The V.I.P.s (1963) and The Sandpiper (1965), were lackluster at best. Elizabeth was to return to fine form, however, with the role of Martha in Who's Afraid of Virginia Woolf? (1966). Her performance as the loudmouthed, shrewish, unkempt, yet still alluring Martha was easily her finest to date. For this she would win her second Oscar and one that was more than well-deserved. The following year, she and Burton co-starred in La mégère apprivoisée (1967), again giving winning performances. However, her films afterward were box office failures, including Reflections in a Golden Eye (1967), Les comédiens (1967) Boom! (1968) (again co-starring with Burton), Secret Ceremony (1968), The Only Game in Town (1970), X, Y and Zee (1972), Hammersmith Is Out (1972) (with Burton again), Ash Wednesday (1973), Night Watch (1973), The Driver's Seat (1974), The Blue Bird (1976) (considered by many to be her worst), A Little Night Music (1977), and Winter Kills (1979) (a controversial film which was never given a full release and in which she only had a small role). Since then, she has appeared in some movies, both theatrical and made-for-television, and a number of television programs. In February 1997, Elizabeth entered the hospital for the removal of a brain tumor. The operation was successful. As for her private life, she divorced Burton in 1974, only to remarry him in 1975 and divorce him, permanently, in 1976. She had two more husbands, U.S. Senator John Warner and construction worker Larry Fortensky, whom she met in rehab. In 1959, Taylor converted to Judaism, and continued to identify herself as Jewish throughout her life, being active in Jewish causes. Upon the death of her friend, actor Rock Hudson, in 1985, she began her crusade on the behalf of AIDS sufferers. In the 1990s, she also developed a successful series of scents. In her later years, her acting career was relegated to the occasional TV-movie or TV guest appearance. Elizabeth Taylor died on March 23, 2011 in Los Angeles, from congestive heart failure. Her final resting place is Forest Lawn Memorial Park, in Glendale, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTc5MDg0OF5BMl5BanBnXkFtZTgwODE4NjMzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000072","name":"Elizabeth Taylor","nicknames":["Liz","Kitten"],"idIMDB":"nm0000072"},"actorId":"nm0000072","character":"Leslie Benedict","urlCharacter":"http://www.imdb.com/character/ch0018727","main":true},{"actorName":"Rock Hudson","urlProfile":"http://www.imdb.com/name/nm0001369","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNDgyNjUyNV5BMl5BanBnXkFtZTYwNTEyNDQ2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1925","placeOfBirth":" Winnetka, Illinois, USA","birthName":"Roy Harold Scherer Jr.","height":"6' 5\" (1.96 m)","bio":"Rock Hudson was born Roy Harold Scherer, Jr. in Winnetka, Illinois, to Katherine (Wood), a telephone operator, and Roy Harold Scherer, an auto mechanic. He was of German, Swiss-German, English, and Irish descent. His parents divorced when he was eight years old. He failed to obtain parts in school plays because he couldn't remember lines. After high school he was a postal employee and during WW II served as a Navy airplane mechanic. After the war he was a truck driver. His size and good looks got him into movies. His name was changed to Rock Hudson, his teeth were capped, he took lessons in acting, singing, fencing and riding. One line in his first picture, Fighter Squadron (1948), needed 38 takes. In 1956 he received an Oscar nomination for Giant (1956) and two years later Look magazine named him Star of the Year. He starred in a number of bedroom comedies, many with Doris Day, and had his own popular TV series McMillan & Wife (1971). He had a recurring role in TV's Dynasty (1981) (1984-5). He was the first major public figure to announce he had AIDS, and his worldwide search for a cure drew international attention. After his death his long-time lover Marc Christian successfully sued his estate, again calling attention to the homosexuality Rock had hidden from most throughout his career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNDgyNjUyNV5BMl5BanBnXkFtZTYwNTEyNDQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001369","name":"Rock Hudson","nicknames":["Roy","Leroy","Rock Pyle","Fitz","Mr Beefcake"],"idIMDB":"nm0001369"},"actorId":"nm0001369","character":"Jordan 'Bick' Benedict Jr.","urlCharacter":"http://www.imdb.com/character/ch0018729","main":true},{"actorName":"James Dean","urlProfile":"http://www.imdb.com/name/nm0000015","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NTgzMTkzNl5BMl5BanBnXkFtZTYwMTQwNjI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1931","placeOfBirth":" Marion, Indiana, USA","birthName":"James Byron Dean","height":"5' 8\" (1.73 m)","bio":"James Byron Dean was born February 8, 1931 in Marion, Indiana, to Mildred Marie (Wilson) and Winton A. Dean, a farmer turned dental technician. His mother died when Dean was nine, and he was subsequently raised on a farm by his aunt and uncle in Fairmount, Indiana. After grade school, he moved to New York to pursue his dream of acting. He received rave reviews for his work as the blackmailing Arab boy in the New York production of Gide's \"The Immoralist\", good enough to earn him a trip to Hollywood. His early film efforts were strictly small roles: a sailor in the Dean Martin and Jerry Lewis overly frantic musical comedy Sailor Beware (1952); a GI in Samuel Fuller's moody study of a platoon in the Korean War, Fixed Bayonets! (1951) and a youth in the Piper Laurie-Rock Hudson comedy Has Anybody Seen My Gal (1952). He had major roles in only three movies. In the Elia Kazan production of John Steinbeck's East of Eden (1955) he played Cal Trask, the bad brother who could not force affection from his stiff-necked father. His true starring role, the one which fixed his image forever in American culture, was that of the brooding red-jacketed teenager Jim Stark in Nicholas Ray's Rebel Without a Cause (1955). George Stevens' filming of Edna Ferber's Giant (1956), in which he played the non-conforming cowhand Jett Rink who strikes it rich when he discovers oil, was just coming to a close when Dean, driving his Porsche Spyder race car, collided with another car while on the road near Cholame, California on September 30, 1955. He had received a speeding ticket just two hours before. At age 24, James Dean was killed almost immediately from the impact from a broken neck. His very brief career, violent death and highly publicized funeral transformed him into a cult object of apparently timeless fascination.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NTgzMTkzNl5BMl5BanBnXkFtZTYwMTQwNjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000015","name":"James Dean","nicknames":["Jimmy Dean","\"One-Speed Dean\"","JD"],"idIMDB":"nm0000015"},"actorId":"nm0000015","character":"Jett Rink","urlCharacter":"http://www.imdb.com/character/ch0018728","main":true},{"actorName":"Carroll Baker","urlProfile":"http://www.imdb.com/name/nm0004647","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2ODk4MDk4MV5BMl5BanBnXkFtZTYwMDcwMTM2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 May 1931","placeOfBirth":" Johnstown, Pennsylvania, USA","height":"5' 5\" (1.65 m)","bio":"Carroll Baker was born Karolina Piekarski on May 28, 1931 in Johnstown, Pennsylvania, the daughter of a traveling salesman. She attended community college for a year and then worked as a dancer and magician's assistant. After a brief marriage, she had a small part in Easy to Love (1953), did TV commercials, and had a bit part on Broadway. She studied at the Actors Studio and was married to director Jack Garfein (one daughter, Blanche Baker). Warner Brothers, sensing a future Marilyn Monroe, cast her in Giant (1956), Baby Doll (1956) (Oscar nomination for her thumb-sucking role), The Carpetbaggers (1964) and Harlow (1965) (title role). Moving to Italy, she made films there and in England, Germany, Mexico and Spain . After returning to American films, she married Donald Burton in 1982 and resided in Hampstead, London in the 1980s. They remained together until Burton's death from emphysema in their home in Cathedral City, California in 2007.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2ODk4MDk4MV5BMl5BanBnXkFtZTYwMDcwMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004647","name":"Carroll Baker","idIMDB":"nm0004647"},"actorId":"nm0004647","character":"Luz Benedict II","urlCharacter":"http://www.imdb.com/character/ch0179433","main":true},{"actorName":"Jane Withers","urlProfile":"http://www.imdb.com/name/nm0936730","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNjQ5MDM4Ml5BMl5BanBnXkFtZTYwNjM2MjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 April 1926","placeOfBirth":" Atlanta, Georgia, USA","bio":"During the early times of the Depression when life was more famine than feast, child stars became the blue plate special of the day, served up by Hollywood to help nourish a nation besieged with troubles. Following 20th Century-Fox monumental success with Shirley Temple in the early 1930s, every studio was out searching for its own precocious little commodity who could pack 'em in the aisles despite the lean times. While Paramount whipped up \"Little\" Mitzi Green, MGM offered Jackie Cooper in the hopes of finding a similar box office jingle. Wildly talented Janie Withers fit the bill, too, and although she earned pint-sized prominence just like the others, it was also for Temple's Fox Studios. As such, Jane remained somewhat of a side course to Temple's main dish (what child star didn't?) throughout much her young \"B\" level reign. Nevertheless, she became a major bright star in her own right. The freckled, dark-haired hellraiser was born in Atlanta, Georgia, on April 12, 1926. The daughter of Walter and Lavinia Ruth Withers, her parents wasted no time in prodding little Jane quickly into the world of entertainment. Jane was a natural--performing by the time she could walk and talk. By age three, she was taking singing and dancing lessons and at age 4, was starring on her own radio program in Atlanta. A spot-on mimic, she was simply uncanny when it came to impersonating the superstars of her day (W.C. Fields, Marie Dressler, Charles Chaplin) and was a veteran pint-sized performer by the time her family moved to Los Angeles after her father was transferred by his company. Jane was enrolled in Lawlor's Professional School and was soon modeling in shows, entertaining at benefits and making the usual rounds of the studios nabbing extra work while waiting for that one big film break. She found it at age 8 when she won the plum role of the spoiled, obnoxious, doll-ripping, bicycle-riding brat who terrorizes sweet Shirley Temple in Twentieth Century-Fox's Bright Eyes (1934). The infamy earned Jane a sweet contract at Fox and for the next seven years she did it her way as the tyke star of close to 50 \"B\" level films. Where Shirley was cuddly and ultra huggable, brunette-banged Jane was fun, rambunctious and full of kinetic energy--a scrappy little tomboy who could take on any boy at any time. Her lively vehicles took full advantage of her talents for impersonating movie stars, too. Her first major success came in the form of the title role in Ginger (1935) in which Jane imitated the balcony scene from Romeo and Juliet and was rewarded by the studio with a contract of $125 weekly for six months. Her singing and dancing skills were utilized in such vehicles as This Is the Life (1935) and Paddy O'Day (1936). As the star, she was toned down, of course, from the all-out brat she played against Temple. Jane kept filmgoers entertained throughout the late 1930s with pictures like Pepper (1936) and Angel's Holiday (1937), in which she did an hilarious impression of Martha Raye. She ended 1937 with a bang when she was named one of Motion Picture's Poll's \"Top Ten\" (#6) box office favorites. Guess who was #1? The early 1940s would tell the story as to whether Jane could survive the dreaded awkward teen transition that haunted every popular child star. She received her first screen kiss at age 13 in Boy Friend (1939) and was singled out for her work in The Ritz Brothers' Pack Up Your Troubles (1939), but Jane's antics simply didn't play as well and the studio began to lose interest. In fact, both Shirley and Jane felt the pressures of growing up and Darryl F. Zanuck let both of them go in July of 1942. Jane signed a three-year picture deal with Republic Pictures with lukewarm results. Her best dramatic role at that time came with The North Star (1943). In 1947, the same year as her last picture of the decade, Jane married a wealthy Texas oil man, William Moss, and had three children by him--William, Wendy, and Randy. The marriage was not a happy one and lasted only six years. She also was suffering from rheumatoid arthritis. In 1955, she remarried, this time to Kenneth Errair, one-quarter of the harmonizing group \"The Four Freshmen.\" They had two children, Ken and Kendall Jane. At the same time, she attempted a Hollywood comeback. While studying directing at the USC film school, she met producer/director George Stevens who cast her in an enviable character role in the epic-sized Giant (1956) supporting Rock Hudson, Elizabeth Taylor, and James Dean. Other film roles followed with The Right Approach (1961) and Captain Newman, M.D. (1963). It was TV, however, that would turn Jane into a wealthy woman as a friendly household pitchwoman. Her decades-long job as the dress-downed Josephine the Plumber pushing Comet cleanser made her one popular gal when working in films became a non-issue. From time to time she would make guest appearances on such fun, lightweight shows as The Munsters (1964), The Love Boat (1977), Murder, She Wrote (1984), and Hart to Hart (1979). Known for her strong spiritualism and charitable contributions, Jane's buoyant, indefatigable nature is still, at age 80+, highly infectious. These days she has not only done voiceover work for Disney's animated features but is still popping up here and there for interviews and convention signings--as bright-eyed and bushy-tailed as she was in her childhood heyday. A widow in 1968, (her second husband perished in a June 14th plane crash in California), she also lost one of her five children, Randy, to cancer when he was only 33.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNjQ5MDM4Ml5BMl5BanBnXkFtZTYwNjM2MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0936730","name":"Jane Withers","idIMDB":"nm0936730"},"actorId":"nm0936730","character":"Vashti Snythe","urlCharacter":"http://www.imdb.com/character/ch0179434","main":true},{"actorName":"Chill Wills","urlProfile":"http://www.imdb.com/name/nm0932629","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGFlYzEzOGMtMTUyNS00ZDA5LThhNTgtOGIzMTdlMzllNjRkL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1902","placeOfBirth":" Seagoville, Texas, USA","birthName":"Theodore Childress Wills","height":"6' 2\" (1.88 m)","bio":"Colorful character actor of American Westerns. Named \"Chill\" as an ironic comment on his birth date being the hottest day of 1903. A musician from his youth, he performed from the age of 12 with tent shows, in vaudeville, and with stock companies. While performing in vaudeville in Kansas City, he married ballet dancer Betty Chappelle, with whom he had two children. He formed a musical group, Chill Wills and His Avalon Boys. During an appearance at the Trocadero in Hollywood, they were spotted by an RKO executive, subsequently appearing as a group in several low-budget Westerns. After a prominent appearance with The Avalon Boys as both himself and the bass-singing voice of Stan Laurel in Way Out West (1937), Wills disbanded the group and began a solo career as a usually jovial (but occasionally sinister) character actor, primarily in Westerns. His delightful portrayal of Beekeeper in The Alamo (1960) won him an Academy Award nomination for Best Supporting Actor, but his blatant and embarrassing campaign for the Oscar cost him the award and subjected him to a great deal of humiliation -- and probably cost the film a number of awards as well. His wife died in 1971, and he remarried, to Novadeen Googe, in 1973. He continued to work in films and television, usually in roguishly lovable good-ol'-boy parts, up until his death in 1978.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGFlYzEzOGMtMTUyNS00ZDA5LThhNTgtOGIzMTdlMzllNjRkL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0932629","name":"Chill Wills","idIMDB":"nm0932629"},"actorId":"nm0932629","character":"Uncle Bawley","urlCharacter":"http://www.imdb.com/character/ch0018731","main":true},{"actorName":"Mercedes McCambridge","urlProfile":"http://www.imdb.com/name/nm0564790","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyMTc3MDQ3MzVeQTJeQWpwZ15BbWU2MDI1NTkyNg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 March 1916","placeOfBirth":" Joliet, Illinois, USA","birthName":"Carlotta Mercedes Agnes McCambridge","height":"5' 3\" (1.6 m)","bio":"Mercedes McCambridge is a highly-talented radio performer who won a best supporting Actress Oscar for her film debut. Mercedes McCambridge was born in Joliet, Illinois, to Marie (Mahaffry) and John Patrick McCambridge, a farmer. She was of mostly Irish (with a small amount of English and German) ancestry. Despite a career full of supporting roles, she later became something of a cult figure. Her memorable voice-over for the demon child in The Exorcist (1973) has secured her place in movie history. Ironically, she took Warner Bros. to court over her being uncredited for the role, which was probably the most important in the film. Mercedes enjoyed a quiet retirement starting from the early 1980s. She was a special guest star at the 70th Annual Anniversary Academy Awards in 1998 along with many other Oscar winners. Mercedes also made special television appearances to discuss her role in The Exorcist (1973) at the 30th Anniversary of the films release. She died in La Jolla in California on 2nd March 2004 from natural causes.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyMTc3MDQ3MzVeQTJeQWpwZ15BbWU2MDI1NTkyNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0564790","name":"Mercedes McCambridge","nicknames":["Mercy"],"idIMDB":"nm0564790"},"actorId":"nm0564790","character":"Luz Benedict","urlCharacter":"http://www.imdb.com/character/ch0018730","main":true},{"actorName":"Dennis Hopper","urlProfile":"http://www.imdb.com/name/nm0000454","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNTQ5Nzg0OF5BMl5BanBnXkFtZTcwMDE2MDE4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 May 1936","placeOfBirth":" Dodge City, Kansas, USA","birthName":"Dennis Lee Hopper","height":"5' 9\" (1.75 m)","bio":"With an amazing cinematic career of more than five decades, Dennis Hopper was a multi-talented and unconventional actor/director, regarded by many as one of the true \"enfants terribles\" of Hollywood. Hopper was born on May 17, 1936 in Dodge City, Kansas, to Marjorie Mae (Davis) and James Millard Hopper. The young Hopper expressed interest in acting from a young age and first appeared in a slew of 1950s television series, including Medic (1954), Cheyenne (1955) and Sugarfoot (1957). His first film role was in Johnny Guitar (1954), which was quickly followed by roles in Rebel Without a Cause (1955), Giant (1956) and Gunfight at the O.K. Corral (1957). Hopper actually became good friends with James Dean and was shattered when Dean was killed in a car crash on September 30, 1955. Hopper portrayed a young Napoléon Bonaparte (!) in the star-spangled The Story of Mankind (1957) and regularly appeared on screen throughout the 1960s, often in rather undemanding parts, usually as a villain in westerns such as True Grit (1969) and Hang 'Em High (1968). However, in early 1969, Hopper, fellow actor Peter Fonda and writer Terry Southern, wrote a counterculture road movie script and managed to scrape together $400,000 in financial backing. Hopper directed the low-budget film, titled Easy Rider (1969), starring Fonda, Hopper and a young Jack Nicholson. The film was a phenomenal box-office success, appealing to the anti-establishment youth culture of the times. It changed the Hollywood landscape almost overnight and major studios all jumped onto the anti-establishment bandwagon, pumping out low-budget films about rebellious hippies, bikers, draft dodgers and pot smokers. However, Hopper's next directorial effort, The Last Movie (1971), was a critical and financial failure, and he has admitted that during the 1970s he was seriously abusing various substances, both legal and illegal, which led to a downturn in the quality of his work. He appeared in a sparse collection of European-produced films over the next eight years, before cropping up in a memorable performance as a pot-smoking photographer alongside Marlon Brando and Martin Sheen in Francis Ford Coppola's Vietnam War epic Apocalypse Now (1979). He also received acclaim for his work in both acting and direction for Garçonne (1980). With these two notable efforts, the beginning of the 1980s saw a renaissance of interest by Hollywood in the talents of Dennis Hopper and exorcising the demons of drugs and alcohol via a rehabilitation program meant a return to invigorating and provoking performances. He was superb in Rumble Fish (1983), co-starred in the tepid spy thriller The Osterman Weekend (1983), played a groovy school teacher in My Science Project (1985), was a despicable and deranged drug dealer in River's Edge (1986) and, most memorably, electrified audiences as foul-mouthed Frank Booth in the eerie and erotic David Lynch film Blue Velvet (1986). Interestingly, the offbeat Hopper was selected in the early 1980s to provide the voice of \"The StoryTeller\" in the animated series of \"Rabbit Ears\" children's films based upon the works of Hans Christian Andersen! Hopper returned to film direction in the late 1980s and was at the helm of the controversial gang film Colors (1988), which was well received by both critics and audiences. He was back in front of the cameras for roles in Super Mario Bros. (1993), got on the wrong side of gangster Christopher Walken in True Romance (1993), led police officer Keanu Reeves and bus passenger Sandra Bullock on a deadly ride in Speed (1994) and challenged gill-man Kevin Costner for world supremacy in Waterworld (1995). The enigmatic Hopper has continued to remain busy through the 1990s and into the new century with performances in The Night We Called It a Day (2003), The Keeper (2004) and Land of the Dead - Le territoire des morts (2005). As well as his acting/directing talents, Hopper was a skilled photographer and painter, having had his works displayed in galleries in both the United States and overseas. He was additionally a dedicated and knowledgeable collector of modern art and has one of the most extensive collections in the United States. Dennis Hopper died of prostate cancer on May 29, 2010, less than two weeks after his 74th birthday.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNTQ5Nzg0OF5BMl5BanBnXkFtZTcwMDE2MDE4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000454","name":"Dennis Hopper","idIMDB":"nm0000454"},"actorId":"nm0000454","character":"Jordan Benedict III","urlCharacter":"http://www.imdb.com/character/ch0179435","main":true},{"actorName":"Sal Mineo","urlProfile":"http://www.imdb.com/name/nm0000543","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2Nzc2NTUxOF5BMl5BanBnXkFtZTcwNjU2ODAyMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 January 1939","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"Salvatore Mineo Jr.","height":"5' 6\" (1.68 m)","bio":"Salvatore (Sal) Mineo Jr. was born to Josephine and Sal Sr. (a casket maker), who emigrated to the U.S. from Sicily. His siblings were Michael, Victor and Sarina. Sal was thrown out of parochial school and, by age eight, was a member of a street gang in a tough Bronx neighborhood. His mother enrolled him in dancing school and, after being arrested for robbery at age ten, he was given a choice of juvenile confinement or professional acting school. He soon appeared in the theatrical production \"The Rose Tattoo\" with Maureen Stapleton and Eli Wallach and as the young prince in \"The King and I\" with Gertrude Lawrence and Yul Brynner. At age 16 he played a much younger boy in Six Bridges to Cross (1955) with Tony Curtis and later that same year played Plato in James Dean's Rebel Without a Cause (1955). He was nominated for Best Supporting Actor for his performance in this film and again for his role as Dov Landau in Exodus (1960). Expanding his repertoire, Mineo returned to the theatre to direct and star in the play \"Fortune and Men's Eyes\" with successful runs in both New York and Los Angeles. In the late 1960s and 1970s he continued to work steadily in supporting roles on TV and in film, including Dr. Milo in Escape from the Planet of the Apes (1971) and Harry O (1973). In 1975 he returned to the stage in the San Francisco hit production of \"P.S. Your Cat Is Dead\". Preparing to open the play in Los Angeles in 1976 with Keir Dullea, he returned home from rehearsal the evening of February 12th when he was attacked and stabbed to death by a stranger. A drifter named Lionel Ray Williams was arrested for the crime and, after trial in 1979, convicted and sentenced to life in prison for the murder, but was paroled in 1990. Although taken away far too soon, the memory of Sal Mineo continues to live on through the large body of TV and film work that he left behind.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2Nzc2NTUxOF5BMl5BanBnXkFtZTcwNjU2ODAyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000543","name":"Sal Mineo","nicknames":["The Switchblade Kid","Jr"],"idIMDB":"nm0000543"},"actorId":"nm0000543","character":"Angel Obregón II","urlCharacter":"http://www.imdb.com/character/ch0092993","main":true},{"actorName":"Rod Taylor","urlProfile":"http://www.imdb.com/name/nm0001792","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMTY0MTExNl5BMl5BanBnXkFtZTgwNTUxNjU5MzE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 January 1930","placeOfBirth":" Sydney, New South Wales, Australia","birthName":"Rodney Sturt Taylor","height":"5' 10\" (1.78 m)","bio":"Suave and handsome Australian actor who came to Hollywood in the 1950s, and built himself up from a supporting actor into taking the lead in several well-remembered movies. Arguably his most fondly remembered role was that as George (Herbert George Wells), the inventor, in George Pal's spectacular The Time Machine (1960). As the movie finished with George, and his best friend Filby Alan Young seemingly parting forever, both actors were brought back together in 1993 to film a 30 minute epilogue to the original movie! Taylor's virile, matinée idol looks also assisted him in scoring the lead of Mitch Brenner in Alfred Hitchcock's creepy thriller The Birds (1963), the role of Jane Fonda's love interest in Sunday in New York (1963), the title role in John Ford's biopic of Irish playwright Sean O'Casey in Young Cassidy (1965), and a co-starring role in The Train Robbers (1973) with John Wayne. Taylor also appeared as Bette Davis future son-in-law in the well-received film The Catered Affair (1956). He also gave a sterling performance as the German-American Nazi Major trying to fool James Garner in 36 Hours (1964). Later Taylor made many westerns and action movies during the 1960s and 1970s; however, none of them were much better than \"B pictures\" and failed to push his star to the next level. Aditionally, Taylor was cast as the lead in several TV series including Bearcats! (1971), Masquerade (1983), and Outlaws (1986); however, none of them truly ignited viewer interest, and they were canceled after only one or two seasons. Most fans would agree that Rod Taylor's last great role was in the wonderful Australian film The Picture Show Man (1977), about a traveling side show bringing \"moving pictures\" to remote towns in the Australian outback.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMTY0MTExNl5BMl5BanBnXkFtZTgwNTUxNjU5MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001792","name":"Rod Taylor","idIMDB":"nm0001792"},"actorId":"nm0001792","character":"Sir David Karfrey","urlCharacter":"http://www.imdb.com/character/ch0179436","main":true},{"actorName":"Judith Evelyn","urlProfile":"http://www.imdb.com/name/nm0263393","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGZlMGUwNDMtOTAxYi00MThmLTliZjctZDE1NGY4ZWE2NTZlL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 March 1913","placeOfBirth":" Seneca, South Dakota, USA","birthName":"Evelyn Morris","bio":"Judith Evelyn was born on March 20, 1913 in Seneca, South Dakota, USA as Evelyn Morris. She was an actress, known for Rear Window (1954), Giant (1956) and The Tingler (1959). She was married to Andrew Allan. She died on May 7, 1967 in New York City, New York, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGZlMGUwNDMtOTAxYi00MThmLTliZjctZDE1NGY4ZWE2NTZlL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0263393","name":"Judith Evelyn","idIMDB":"nm0263393"},"actorId":"nm0263393","character":"Mrs. Nancy Lynnton","urlCharacter":"http://www.imdb.com/character/ch0179437","main":true},{"actorName":"Earl Holliman","urlProfile":"http://www.imdb.com/name/nm0391096","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMTQ1NjI5MV5BMl5BanBnXkFtZTcwMzE0MDMxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1928","placeOfBirth":" Delhi, Louisiana, USA","birthName":"Henry Earl Holliman","height":"6' (1.83 m)","bio":"Louisiana-born actor Earl Holliman, after a stint in the Navy, studied at UCLA and the Pasadena Playhouse before earning his break in the Martin/Lewis comedy Scared Stiff (1953). He gained clout after portraying a variety of young, manly characters in rugged westerns and war drama, ranging from dim and/or good-natured to overly impulsive and/or threatening. He won a Golden Globe for his support performance as a girl-crazy brother in The Rainmaker (1956), holding his own against stars Burt Lancaster and Katharine Hepburn. He distinguished himself in a number of \"A\" grade films around the same time, including Broken Lance (1954) with Spencer Tracy, Gunfight at the O.K. Corral (1957), again with Lancaster, Giant (1956) with Elizabeth Taylor and Rock Hudson, Visit to a Small Planet (1960), again with Jerry Lewis, Summer and Smoke (1961) with Geraldine Page and The Sons of Katie Elder (1965) with John Wayne. When the film offers started drying up in the 60s, he found TV a more welcoming medium, scoring in a number of westerns. His virile stance was perfect for a series of crime yarns. It all culminated with a four-year stint as the macho partner to sexy Angie Dickinson in Police Woman (1974), a role that helped make him a household name. Holliman operated the Fiesta Dinner Theatre for many years in San Antonio, Texas.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMTQ1NjI5MV5BMl5BanBnXkFtZTcwMzE0MDMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0391096","name":"Earl Holliman","idIMDB":"nm0391096"},"actorId":"nm0391096","character":"'Bob' Dace","urlCharacter":"http://www.imdb.com/character/ch0179438","main":true},{"actorName":"Robert Nichols","urlProfile":"http://www.imdb.com/name/nm0629711","urlPhoto":"","biography":{"dateOfBirth":"20 July 1924","placeOfBirth":" Oakland, California, USA","bio":"A native of Oakland, California, Robert Nichols got his start as an entertainer in the Army during World War II. After his discharge, he attended London's Royal Academy of Dramatic Art while working as a song-and-dance man at the Players Theater (Victorian music hall). Hollywood director Howard Hawks, visiting London, cast Nichols in a small part in his 1949 comedy I Was a Male War Bride (1949); Nichols' scene was shot in Germany. Relocating to Hollywood, he appeared in dozens of additional features before tiring of the succession of \"elderly juvenile\" roles and moving back to England, where he worked on the stage and in films. A subsequent move to New York yielded yet more stage-work while his wife, Jennifer Nichols, became one of the movies' top wardrobe supervisors there. In more recent years, Nichols has been \"on the road\" with productions of \"A Funny Thing Happened on the Way to the Forum\", \"Anything Goes\" and \"Ragtime\".","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0629711","name":"Robert Nichols","idIMDB":"nm0629711"},"actorId":"nm0629711","character":"Mort 'Pinky' Snythe","urlCharacter":"http://www.imdb.com/character/ch0179439","main":true},{"actorName":"Paul Fix","urlProfile":"http://www.imdb.com/name/nm0280707","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODA0OTIzOF5BMl5BanBnXkFtZTcwMTg4MzI4Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 March 1901","placeOfBirth":" Dobbs Ferry, New York, USA","birthName":"Peter Paul Fix","height":"6' (1.83 m)","bio":"Paul Fix, the well-known movie and TV character actor who played \"Marshal Micah Torrance\" on the TV series The Rifleman (1958), was born Peter Paul Fix on March 13, 1901 in Dobbs Ferry, New York to brew-master Wilhelm Fix and his wife, the former Louise C. Walz. His mother and father were German immigrants who had left their Black Forest home and arrived in New York City in the 1870s. (The name \"Fix\" is of Latin/Germanic origin, and is derived from St. Vitus and means \"animated\" or \"vital\"). Besides Peter Paul, the Fix family consisted of two girls and three boys, the youngest of whom was six years older than the future actor. Peter Paul's childhood was a happy one. He and his family lived on the 200-acre property on which the Manilla Anchor Brewery, where his father was brew-master, was situated. Such was the importance of Fix to the brewery that when he died at the age of 62 on the eve of America's entry into the First World War (two years after his 54-year old wife had died), the brewery closed. The orphaned Peter Paul, who kept to himself a lot and had a vivid imagination, was sent to live with his married sisters, first one who lived nearby in Yonkers, and then to another in Zanesville, Ohio. The just-turned-17-year-old Peter Paul Fix joined the U.S. Navy on March 12, 1918, and spent his state-side service time during World War I in Newport, Rhode Island and Charleston, South Carolina. He first tread the boards as an actor while a sailor stationed in Newport, when the baby-faced salt (who looked much younger than his age) was one of six gobs chosen to play female roles in the Navy Relief Show \"HMS Pinafore\". The Navy staging of the Gilbert and Sullivan operetta was a big hit and chalked up a run of several weeks in Providence and Boston. Fix was assigned as an able-bodied seaman to the troopship U.S.S. Mount Vernon, which was torpedoed by a German U-boat off the coast of France but did not sink as it was run aground. The rest of Fix's naval career was less exciting, and he was demobilized on September 5, 1919. After his discharge, Fix went back to his girlfriend Frances (Taddy) Harvey, whom he had left behind in Zanesville. He and Taddy were married in 1922 and they moved to California as Fix had always wanted to live in a warm climate. Fix and his bride settled in Hollywood, not so much because he had set ideas about becoming an actor but because he didn't know what he wanted to do with the rest of his life. He liked writing and acting in local plays, and soon became friends with the fellow tyro actor Clark Gable, who was his own age. Fix and Gable were discovered by the stage actress Pauline Frederick, who hired them to be members of her touring troupe that traveled by train the length of the West Coast putting on plays. In all, Fix - who had informally renamed himself Paul Peter - appeared in 20 plays with Gable. Paul Fix had one of his earliest acting roles on celluloid in the mid-1920s, appearing in a silent Western starring William S. Hart. The Western genre eventually would become the one he was most identified with. He played uncredited bit parts and small roles in silents before getting his first credited role in an early talkie (which was part-silent and part-talking), The First Kiss (1928), which starred future Hollywood superstar Gary Cooper and the dame that drove King Kong ape, Fay Wray. In all, Fix appeared in 300-400 films. The Western programmers of the silent and early talkie days could be shot in less than a week. In 1925, Taddy gave birth to their daughter Marilyn Carey, who eventually would marry Harry Carey Jr., the son of one of the first great Western superstars. They would have three more children and become part of the extended family gathered around the director John Ford. In his career, Paul Fix would appear with another Western legend, John Wayne, in 26 films, starting in 1931 with Three Girls Lost (1931). Urged on by Loretta Young, Fix became an acting coach for the young actor, and Wayne later paid him back when he became a star by having Fix appear in his movies. (The Duke also was a part of the close-knit group that collected around John Ford). With the Duke's patronage, the kinds of roles that Fix played changed. He had been typed as villains in the 1930s but, in the 40s, he began assaying a better class of character. Paul Fix was also a screenwriter, and is credited as the writer on three films: Tall in the Saddle (1944), Ring of Fear (1954) and The Notorious Mr. Monks (1958). His favorites parts included playing the stricken passenger in the John Wayne picture The High and the Mighty (1954), Elizabeth Taylor's father in George Stevens' classic Giant (1956), the grandfather of the eponymous The Bad Seed (1956) and the judge in To Kill a Mockingbird (1962). His last screen appearance was in the Brooke Shields movie Wanda Nevada (1979), but he is most famous for appearing in the recurring role of \"Marshal Micah Torrance\" in the popular Western TV series The Rifleman (1958). As of 1981, the 80-year old Fix was still getting mail from all over the world from \"Rifleman\" fans. Paul Fix died October 14, 1983 of kidney failure. He was survived by his daughter Marilyn Carey and son-in-law Harry \"Dobe\" Carey, three grandchildren and several great-grandchildren.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODA0OTIzOF5BMl5BanBnXkFtZTcwMTg4MzI4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0280707","name":"Paul Fix","idIMDB":"nm0280707"},"actorId":"nm0280707","character":"Dr. Horace Lynnton","urlCharacter":"http://www.imdb.com/character/ch0179440","main":true},{"actorName":"Alexander Scourby","urlProfile":"http://www.imdb.com/name/nm0780038","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU1MTc0Mjk0NV5BMl5BanBnXkFtZTgwMDE4OTg0MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1913","placeOfBirth":" Brooklyn, New York, USA","height":"5' 10½\" (1.79 m)","bio":"The possessor of one of stage, screen, radio and audiocassette's most distinguished vocal instruments, actor Alexander Scourby received his training via Shakespearean roles in the 1930s and perfected his trade on dramatic radio serials in the 1940's. The noted actor/narrator was born in Brooklyn, New York on November 13, 1913 to Greek immigrants and attended public and private schools in Brooklyn. Interested in writing, he was a co-editor of his high school magazine and yearbook and studied journalism briefly at West Virginia University at Morgantown. A passion for acting was sparked after joining a campus theater group. He apprenticed at Eva Le Gallienne's Civic Repertory Theatre and made his professional debut in a walk-on in \"Liliom\". Scourby's first role on Broadway was in Leslie Howard's production of \"Hamlet\" in which he took the part of the Player King. In 1937, he began making use of his vocal prowess working with the American Foundation for the Blind's Talking Book program. He played Rosencrantz in Maurice Evans' presentation of \"Hamlet\" in 1937 and went on to appear with Evans in \"Henry IV, Part I\" and \"Richard II\". Scourby began working in radio in 1939 and, by the early 1940's, he was playing running parts in five of the serial dramas. Included was the voice of Superman's father on that popular radio show. Other Broadway plays included \"A Flag Is Born\", \"Crime and Punishment\", \"Detective Story\", \"Darkness at Noon\", \"Saint Joan\" with Uta Hagen, \"A Month in the County\" and \"Tovarich\" with Vivien Leigh, in which he ably displayed his flair for urbane villainy. Thoughout the 1950's, Scourby worked in television drama. As a narrator, he had few peers. He narrated the acclaimed documentary \"Victory at Sea\" in 1954 and would voice many popular Bible stories. Classical novel audiocassettes such as \"Ship of Fools\" and \"War and Peace\" were acclaimed due to his vocal accompaniments. Long married to stage and soap opera actress Lori March, he appeared with her as husband and wife during the 1970's in The Secret Storm (1954). They had a daughter, Alexandra, born in 1944. Scourby died in 1985 at age 71.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU1MTc0Mjk0NV5BMl5BanBnXkFtZTgwMDE4OTg0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0780038","name":"Alexander Scourby","idIMDB":"nm0780038"},"actorId":"nm0780038","character":"Old Polo","urlCharacter":"http://www.imdb.com/character/ch0179441","main":true}],"seasons":[],"idIMDB":"tt0049261","urlIMDB":"http://www.imdb.com/title/tt0049261","business":{"budget":{"money":"$5,400,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$5,649","country":"USA","day":"22","month":"09","year":"1996","remarks":"1 Screen"}],"gross":[{"money":"$169,928","country":"USA","day":"20","month":"10","year":"1996","remarks":""},{"money":"$140,211","country":"USA","day":"13","month":"10","year":"1996","remarks":""},{"money":"$93,472","country":"USA","day":"06","month":"10","year":"1996","remarks":""},{"money":"$36,655","country":"USA","day":"29","month":"09","year":"1996","remarks":""},{"money":"$5,649","country":"USA","day":"22","month":"09","year":"1996","remarks":""}],"weekendGross":[{"money":"$18,689","country":"USA","day":"20","month":"10","year":"1996","remarks":"18 Screens"},{"money":"$26,343","country":"USA","day":"13","month":"10","year":"1996","remarks":"14 Screens"},{"money":"$43,388","country":"USA","day":"06","month":"10","year":"1996","remarks":"14 Screens"},{"money":"$27,734","country":"USA","day":"29","month":"09","year":"1996","remarks":"3 Screens"},{"money":"$5,649","country":"USA","day":"22","month":"09","year":"1996","remarks":"1 Screen"}],"admissions":[{"money":"3,723,209 (France)","country":"","day":null,"month":null,"year":null,"remarks":null}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"21","month":"05","year":"1955","remarks":null},{"money":null,"country":null,"day":"11","month":"10","year":"1955","remarks":null}],"copyrightHolder":"©Copyright MCMLVI by Giant Productions (on print); Giant Productions; 24 November 1956; LP9719 (in copyright registry)"},"technical":{"runtime":["3 hr 21 min (201 min)"],"soundMix":["Mono (RCA Sound Recording)"],"color":["Color (WarnerColor)"],"aspectRatio":["1.66 : 1"],"camera":null,"laboratory":["Warner Bros. Studio Laboratory, USA"],"filmLength":["5,535 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.7","filmingLocations":[{"location":"Arizona, USA"}],"rated":"APPROVED","awards":[{"award":"Academy Awards, USA 1957","titlesAwards":[{"titleAwardOutcome":"Won Oscar","categories":[{"category":"Best Director","names":[{"name":"George Stevens","id":"nm0828419","role":null}]}]},{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Picture","names":[{"name":"George Stevens","id":"nm0828419","role":null},{"name":"Henry Ginsberg","id":"nm0320102","role":null}]},{"category":"Best Actor in a Leading Role","names":[{"name":"James Dean","id":"nm0000015","role":null}]},{"category":"Best Actor in a Leading Role","names":[{"name":"Rock Hudson","id":"nm0001369","role":null}]},{"category":"Best Actress in a Supporting Role","names":[{"name":"Mercedes McCambridge","id":"nm0564790","role":null}]},{"category":"Best Writing, Best Screenplay - Adapted","names":[{"name":"Fred Guiol","id":"nm0347451","role":null},{"name":"Ivan Moffat","id":"nm0595573","role":null}]},{"category":"Best Art Direction-Set Decoration, Color","names":[{"name":"Boris Leven","id":"nm0505227","role":null},{"name":"Ralph S. Hurst","id":"nm0403644","role":null}]},{"category":"Best Costume Design, Color","names":[{"name":"Moss Mabry","id":"nm0531117","role":null},{"name":"Marjorie Best","id":"nm0078968","role":null}]},{"category":"Best Film Editing","names":[{"name":"William Hornbeck","id":"nm0394962","role":null},{"name":"Philip W. Anderson","id":"nm0027295","role":null},{"name":"Fred Bohanan","id":"nm0091980","role":null}]},{"category":"Best Music, Scoring of a Dramatic or Comedy Picture","names":[{"name":"Dimitri Tiomkin","id":"nm0006323","role":null}]}]}]},{"award":"Golden Globes, USA 1957","titlesAwards":[{"titleAwardOutcome":"Won Golden Globe","categories":[{"category":"Most Promising Newcomer - Female","names":[{"name":"Carroll Baker","id":"nm0004647","role":null},{"name":"Baby Doll","id":"tt0048973","role":null}]}]},{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Motion Picture - Drama","names":[]},{"category":"Best Director","names":[{"name":"George Stevens","id":"nm0828419","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best DVD/Blu-Ray Collection","names":[{"name":"East of Eden","id":"tt0048028","role":null},{"name":"Rebel Without a Cause","id":"tt0048545","role":null},{"name":"James Dean: Forever Young","id":"tt0472115","role":null},{"name":"George Stevens: A Filmmaker's Journey","id":"tt0087322","role":null}]}]}]},{"award":"David di Donatello Awards 1957","titlesAwards":[{"titleAwardOutcome":"Won David","categories":[{"category":"Best Foreign Production (Migliore Produzione Straniera)","names":[{"name":"Jack L. Warner","id":"nm0912491","role":null}]}]}]},{"award":"Directors Guild of America, USA 1957","titlesAwards":[{"titleAwardOutcome":"Won DGA Award","categories":[{"category":"Outstanding Directorial Achievement in Motion Pictures","names":[{"name":"George Stevens","id":"nm0828419","role":null},{"name":"Joseph E. Rickards","id":"nm0725455","role":"assistant director plaque"}]}]}]},{"award":"National Film Preservation Board, USA 2005","titlesAwards":[{"titleAwardOutcome":"Won National Film Registry","categories":[{"category":"","names":[]}]}]},{"award":"New York Film Critics Circle Awards 1956","titlesAwards":[{"titleAwardOutcome":"2nd place NYFCC Award","categories":[{"category":"Best Film","names":[]}]},{"titleAwardOutcome":"3rd place NYFCC Award","categories":[{"category":"Best Screenplay","names":[{"name":"Fred Guiol","id":"nm0347451","role":null},{"name":"Ivan Moffat","id":"nm0595573","role":null}]}]}]},{"award":"Online Film & Television Association 2016","titlesAwards":[{"titleAwardOutcome":"Won OFTA Film Hall of Fame","categories":[{"category":"Motion Picture","names":[]}]}]},{"award":"Photoplay Awards 1957","titlesAwards":[{"titleAwardOutcome":"Won Gold Medal","categories":[{"category":"","names":[]}]}]},{"award":"Writers Guild of America, USA 1957","titlesAwards":[{"titleAwardOutcome":"Nominated WGA Award (Screen)","categories":[{"category":"Best Written American Drama","names":[{"name":"Fred Guiol","id":"nm0347451","role":null},{"name":"Ivan Moffat","id":"nm0595573","role":null}]}]}]}],"votes":"27,527","type":"Movie","companyCreditsSimple":[{"idCompany":"co0117169","name":"George Stevens Productions"}],"keywords":{"keywords":["epic","ranch","rancher","land","texas","oil","children","rivalry","love","friend","ranch hand","oil tycoon","maryland","racism","horse","cattle","oil wealth","horseback riding","texas tech university","state flag","jeans","death of horse","man horse relationship","black horse","rearing horse","woman horse relationship","rider horse relationship","death of a horse","death of cast member","lead actor's last film","money","landowner","christmas present","animal husbandry","book","military draft","u.s. soldier","architectural model","oil well","hotel desk clerk","parade","filing one's fingernails","diving","bride and groom","band","knocking over a table","twin","matron of honor","pregnancy","crying","family saga","harvard university","thanksgiving","organ","rear ending a car","diner","mother in law son in law relationship","organ player","american flag","punched in the face","death of sister","mirror","truck","jukebox","wedding ceremony","hotel","innocence lost","cigar smoking","burial","priest","nurse","nouveaux riches","knocked out","racist","reference to carrie nation","calf head","subjective camera","blood","senator","food","applause","railway station","cook","pony","military funeral","marital problem","jingle bells","flowers","father in law son in law relationship","airport","water","calf","christmas","graveyard","riding accident","private plane","prayer","bronc riding","branding","candle","wind","eyeglasses","barbecue","comanche tribe","judge","banquet","covered in oil","newlywed","reference to joan of arc","lamb","song","tax","beauty salon","brother sister relationship","equal rights","wake","tax exemption","wedding cake","animal abuse","telephone call","baby","reading","world war two","restaurant","millionaire","neighbor","mexican wedding","coffin","merry christmas","drinking","fainting","elopement","drunkenness","wet back","bar","cemetery","redemption","segregation","cat","lipstick on face","sports car","letter","actress","christmas stocking","waitress","mud","passing out","newspaper","roundup","rattlesnake","servant","tears","kiss","minister","uncle","honeymoon","train","car","catholic church","fox hunt","dinner bell","static electricity","roast turkey","oil gusher","singer","beating","toy doctor kit","catholic","bassinette","diving board","coca cola","star spangled banner","tea","bequest","premed student","birth","jealousy","drink","crucifix","toy piano","fight","microphone","montage","busboy","wine cellar","tumbleweed","waiter","oil truck","wildcatter","rain","bourbon","wristwatch","pipe smoking","power","women's rights","americana","businessman","dance caller","redhead","beauty operator","marital separation","swimming","thunder","babysitting","wealth","beauty queen","interracial marriage","listening to a radio","convertible","half breed","business","squaw","sick child","soldier","ice cream","tiara","airplane","breaking a mirror","draft notice","social reform","sister sister relationship","tennis","knocked over counter","reference to paul revere","slot machine","boys' choir","silent night","clock","cafe","calf roping","reference to franklin d roosevelt","singing","immigrant","reference to geronimo","speech","reading in bed","thunderstorm","dog","gun salute","papoose","pearl harbor","turkey the bird","doctor","twin beds","lunch counter","face bandage","handshake","coffee","sheep","policeman","grandmother grandson relationship","grandfather grandson relationship","fistfight","aunt niece relationship","thrown from a horse","teenage girl","teenage boy","square dancing","spanish language","rifle","ranching","radio news","prejudice","politics","party","older woman younger man relationship","older man younger woman relationship","oil field","oil derrick","oil company","migrant worker","mexican american","love triangle","last will and testament","eaddress","illness","hospital","horse riding accident","horse ranch","homesickness","friendship","family relationships","falling in love","dust","death","dallas texas","coyote","cowboy hat","cowboy boots","cigarette smoking","christmas tree","cattle ranch","buying land","bull","birthday","aging","african american","oil rig","oil industry","drilling for oil","star died before release","husband wife relationship","one word title","rise and fall","race relations","interracial romance","swimming pool","young love","sudden wealth","mother son relationship","mother daughter relationship","melodrama","marriage proposal","mansion","love at first sight","loss of sister","hispanic","funeral","father son relationship","father daughter relationship","famous score","brawl","birthday party","assault","blockbuster","unrequited love","racial prejudice","1930s","biracial","marriage","class differences","social criticism","wedding","ethnic slur","1940s","racial discrimination","sexism","1920s","death of son","death of friend","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:46:09"}}