{"data":{"movies":[{"title":"The Amazing Mr. Blunden","originalTitle":"","year":"1972","releaseDate":"1974","directors":[{"name":"Lionel Jeffries","id":"nm0420383"}],"writers":[{"name":"Lionel Jeffries","id":"nm0420383"},{"name":"Antonia Barber","id":"nm0053348"}],"runtime":"99 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDZjNmRkOTctMzU5Ny00ZTQzLWE1MjktOTA4ZDczYmUyZTk0XkEyXkFqcGdeQXVyNjg4MzMwNjA@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Family","Mystery","Fantasy"],"plot":"A mysterious, very old solicitor Mr. Blunden visits Mrs. Allen and her young children in her squalid, tiny Camden Town flat and makes her an offer she cannot refuse. The family become the housekeepers to a derelict country mansion in the charge of the solicitors. One day the children meet the spirits of two other children who died in the mansion nearly a hundred years previously. The children prepare a magic potion that allows them to travel backwards in time to the era of the ghost children. Will the children be able to help their new friends and what will happen to them if they do??","simplePlot":"A mysterious, very old solicitor Mr. Blunden visits Mrs. Allen and her young children in her squalid, tiny Camden Town flat and makes her an offer she cannot refuse. The family become the ... ","actors":[{"actorName":"Graham Crowden","urlProfile":"http://www.imdb.com/name/nm0189561","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NDczMTA2N15BMl5BanBnXkFtZTcwMzEzMTgwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1922","placeOfBirth":" Edinburgh, Scotland, UK","birthName":"Clement Graham Crowden","height":"6' 3\" (1.91 m)","bio":"The imposing Scottish character actor Graham Crowden was one of the most recognizable and reliable British screen actors who worked for over half a century. He was the third of four children of a Scottish Presbyterian classics teacher. His first job was in a tannery in Edinburgh. He joined the Royal Scots Youth Battalion in 1940, but was invalided out after being accidentally shot by his own platoon sergeant. After studies at Edinburgh Academy, he worked for the stage in 1944 as student assistant stage manager at the Memorial Theatre in Stratford-upon-Avon. This was followed by repertory experience in Dundee, Glasgow, Nottingham and with the Bristol Old Vic. A prolific actor at the Royal Court from the mid-1950's, and later with the Royal Shakespeare Company and Laurence Olivier's National Theatre. Tall and possessed of an incisive manner, resonant voice and larger-than-life personality, Crowden was at his best in eccentric portrayals as mad scientists or flawed men-of-the-cloth. One of his most memorable film appearances was as the maniacal chief surgeon in Lindsay Anderson's Britannia Hospital (1982). In television, he turned down the role of Doctor Who (1963) in 1974 but later appeared in it opposite Tom Baker, who had been cast as the Doctor instead, to give the series one of its most memorably over-the-top villains. He also achieved success in later life in television comedies such as A Very Peculiar Practice (1986) and opposite Stephanie Cole in Waiting for God (1990). He continued to act until shortly before his death.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NDczMTA2N15BMl5BanBnXkFtZTcwMzEzMTgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0189561","name":"Graham Crowden","idIMDB":"nm0189561"},"actorId":"nm0189561","character":"Mr. Clutterbuck","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dorothy Alison","urlProfile":"http://www.imdb.com/name/nm0019704","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjdiOTZlZDYtMjNjMS00ZTEwLWI4ZmYtY2QxMWY3YWFkODUxXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1925","placeOfBirth":" Broken Hill, New South Wales, Australia","birthName":"Dorothy Dickson","bio":"Dorothy Alison was born on April 4, 1925 in Broken Hill, New South Wales, Australia as Dorothy Dickson. She was an actress, known for See No Evil (1971), A Cry in the Dark (1988) and The Nun's Story (1959). She was married to Leslie Linder. She died on January 17, 1992 in London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjdiOTZlZDYtMjNjMS00ZTEwLWI4ZmYtY2QxMWY3YWFkODUxXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0019704","name":"Dorothy Alison","idIMDB":"nm0019704"},"actorId":"nm0019704","character":"Mrs. Allen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Benjamin Smith","urlProfile":"http://www.imdb.com/name/nm5552467","urlPhoto":"","biography":{"bio":"Benjamin Smith is an actor, known for The Amazing Mr. Blunden (1972).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5552467","name":"Benjamin Smith","idIMDB":"nm5552467"},"actorId":"nm5552467","character":"Benjamin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stuart Lock","urlProfile":"http://www.imdb.com/name/nm0516704","urlPhoto":"","biography":{"bio":"Stuart Lock is an actor and production manager, known for The Amazing Mr. Blunden (1972), Scramble (1970) and Big Zapper (1973).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0516704","name":"Stuart Lock","idIMDB":"nm0516704"},"actorId":"nm0516704","character":"Thomas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Deddie Davies","urlProfile":"http://www.imdb.com/name/nm0203671","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGQ3ZGU2YTYtYTI1Ny00ODBiLTg1YmYtZThkYmQ4OWFlNjE3L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 March 1938","placeOfBirth":" Bridgend, Wales, UK","birthName":"Gillian Nancy Davies","height":"5' 1\" (1.55 m)","bio":"Deddie Davies was born on March 2, 1938 in Bridgend, Wales as Gillian Nancy Davies. She was an actress, known for Pride (2014), The Railway Children (1970) and The Rag Trade (1977). She was married to Paddy Ward. She died on December 21, 2016 in the UK.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGQ3ZGU2YTYtYTI1Ny00ODBiLTg1YmYtZThkYmQ4OWFlNjE3L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0203671","name":"Deddie Davies","idIMDB":"nm0203671"},"actorId":"nm0203671","character":"Meakin, Mrs. Wickens' Servant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Lodge","urlProfile":"http://www.imdb.com/name/nm0517084","urlPhoto":"","biography":{"dateOfBirth":"19 August 1921","placeOfBirth":" Rochester, Kent, England, UK","birthName":"David William Frederick Lodge","height":"6' (1.83 m)","bio":"David Lodge was born on August 19, 1921 in Rochester, Kent, England as David William Frederick Lodge. He was an actor, known for The Return of the Pink Panther (1975), A Shot in the Dark (1964) and Two Way Stretch (1960). He was married to Marilyn Garcia. He died on October 18, 2003 in Denville Hall, Northwood, Hillingdon, London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0517084","name":"David Lodge","idIMDB":"nm0517084"},"actorId":"nm0517084","character":"Mr. Wickens","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Madeline Smith","urlProfile":"http://www.imdb.com/name/nm0809184","urlPhoto":"","biography":{"dateOfBirth":"2 August 1949","placeOfBirth":" Hartfield, Sussex, England, UK","height":"5' 6\" (1.68 m)","bio":"Shapely, dark haired British actress who appeared in a number of sensual film and TV roles that showcased her beauty. She is probably best recognizable as Miss Caruso, the beautiful young Italian agent sleeping with James Bond in the opening of Live and Let Die (1973) whose blue dress zipper meets its match in Bond's magnetic watch. Prior to this, she had worked with Roger Moore in an early TV appearance and he recommended her for the role.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0809184","name":"Madeline Smith","idIMDB":"nm0809184"},"actorId":"nm0809184","character":"Bella","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Villiers","urlProfile":"http://www.imdb.com/name/nm0898376","urlPhoto":"","biography":{"dateOfBirth":"29 September 1933","placeOfBirth":" London, England, UK","birthName":"James Michael Hyde Villiers","height":"6' 4\" (1.93 m)","bio":"Character actor James Villiers was of an aristocratic background - you could half tell, not only from his sardonic looks and precisely modulated voice, but from the roles he played. More often than not, he was typecast as a snobbish, supercilious upper-class twit, effete weakling or comic second-string villain. A graduate of RADA (Royal Academy of Dramatic Art), his first major appearance on stage was in a 1954 West End production of \"Toad of Toad Hall\". During the following years, he expanded his repertoire at the Old Vic with performances of William Shakespeare's \"Julius Caesar\" and \"Richard III\", also touring on Broadway. During his extensive theatrical career, he acted in plays by Noël Coward (including a critically-acclaimed performance in \"Private Lives\" in 1972), Oscar Wilde and George Bernard Shaw, and, just prior to his death, played \"Mr. Brownlow\" in \"Oliver!\" at the London Palladium. In the 1960's, James Villiers was featured in several films by Joseph Losey, most notably These Are the Damned (1962). One of his most convincing roles was as one of the parents of a 10-year old boy threatened by a homicidal Bette Davis in The Nanny (1965). He was also featured in several horror movies, such as Blood from the Mummy's Tomb (1971) and the Amicus production of Asylum (1972), reverting to his best plummy-voiced form. On television, he was perfectly cast as \"Professor Higgins\" in BBC Play of the Month: Pygmalion (1973); a 1973 adaptation which co-starred Lynn Redgrave as \"Eliza Doolittle\". One of his earlier successes was in the 1969 BBC period drama, The First Churchills (1969), in the part of \"King Charles II\" (whom he was said to have resembled). One of the most British of actors, Villiers died of cancer in West Sussex in January 1998.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0898376","name":"James Villiers","idIMDB":"nm0898376"},"actorId":"nm0898376","character":"Uncle Bertie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Diana Dors","urlProfile":"http://www.imdb.com/name/nm0002047","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNDgzNjU4MF5BMl5BanBnXkFtZTYwNzcyODU2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 October 1931","placeOfBirth":" Swindon, Wiltshire, England, UK","birthName":"Diana Mary Fluck","height":"5' 5½\" (1.66 m)","bio":"Diana Dors was born Diana Mary Fluck on October 23, 1931 in Swindon, Wiltshire, England. She and her mother both nearly died from the traumatic birth. Because of the trauma, her mother lavished on Diana anything and everything she wanted--clothes, toys and dance lessons were the order of the day. Diana's love of films began when her mother took her to the local movies theaters. The actresses on the screen caught Diana's attention and she said, herself, that from the age of three she wanted to be an actress. She was educated in the finest private schools, much to the chagrin of her father (apparently he thought private education was a waste of money). Physically, Diana grew up fast. At age 12, she looked and acted much older than what she was. Much of this was due to the actresses she studied on the silver screen and Diana trying to emulate them. She wanted nothing more than to go to the United States and Hollywood to have a chance to make her place in film history. After placing well in a local beauty contest, Diana was offered a role in a thespian group (she was 13). The following year, Diana enrolled at the London Academy of Music and Dramatic Arts (LAMDA) to hone her acting skills. She was the youngest in her class. Her first fling at the camera was in Code of Scotland Yard (1947). She did not care that it was a small, uncredited role; she was on film and at age 16, that's all that mattered. That was quickly followed by Dancing with Crime (1947), which consisted of nothing more than a walk-on role. Up until this time, Diana had pretended to be 17 years old (if producers had known her true age, they probably would not have let her test for the role). However, since she looked and acted older, this was no problem. Diana's future dawned bright in 1948, and she appeared in no less than six films. Some were uncredited, but some had some meat to the roles. The best of the lot was the role of Charlotte in the classic Oliver Twist (1948). Throughout the 1950s, she appeared in more films and became more popular in Britain. Diana was a pleasant version of Marilyn Monroe, who had taken the United States by storm. Britain now had its own version. Diana continued to play sexy sirens and kept seats in British theaters filled. She really came into her own as an actress. She was more than a woman who exuded her sexy side, she was a very fine actress as her films showed. As the 1960s turned into the 1970s, she began to play more mature roles with an effectiveness that was hard to match. Films such as Craze (1974), Swedish Wildcats (1972), The Amorous Milkman (1975) and Three for All (1975) helped fill out her resume. After filming Steaming (1985), Diana was diagnosed with cancer, which was too much for her to overcome. The British were saddened when word came of her death at age 52 on May 4, 1984 in Windsor, Berkshire, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNDgzNjU4MF5BMl5BanBnXkFtZTYwNzcyODU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002047","name":"Diana Dors","nicknames":["The Siren of Swindon","The Hurricane in Mink","The English Marilyn Monroe","The Blonde Bombshell"],"idIMDB":"nm0002047"},"actorId":"nm0002047","character":"Mrs. Wickens the Housekeeper","urlCharacter":"http://www.imdb.com/character/ch0481926","main":true},{"actorName":"Rosalyn Landor","urlProfile":"http://www.imdb.com/name/nm0484961","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzOTUzMjEwOV5BMl5BanBnXkFtZTgwMTI5NDg0MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 October 1958","placeOfBirth":" Hampstead, London, England, UK","bio":"Rosalyn Landor was born in Hampstead, London, in October 1958; and was sought- after as a child actress. During her teens, she attended the Royal Ballet School for two years before completing her education at Tolworth Girls School, near Kingston-upon-Thames, Surrey, where she studied to A-level. After leaving school at the age of nineteen, Rosalyn entered the retail trade, working first at Royal Copenhagen Porcelain in Bond Street, London, then at Libertys of Regent Street. She made her West End stage debut in 1987. Rosalyn went to America in the late 1980s, and lives in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzOTUzMjEwOV5BMl5BanBnXkFtZTgwMTI5NDg0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0484961","name":"Rosalyn Landor","idIMDB":"nm0484961"},"actorId":"nm0484961","character":"Sara Latimer","urlCharacter":"http://www.imdb.com/character/ch0131794","main":true},{"actorName":"Marc Granger","urlProfile":"http://www.imdb.com/name/nm0335066","urlPhoto":"","biography":{"dateOfBirth":"12 July 1962","placeOfBirth":"","bio":"Marc Granger was born on July 12, 1962. He is an actor, known for The Amazing Mr. Blunden (1972), The 100 Greatest Family Films (2005) and Follyfoot (1971).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0335066","name":"Marc Granger","idIMDB":"nm0335066"},"actorId":"nm0335066","character":"Georgie Latimer","urlCharacter":"http://www.imdb.com/character/ch0131796","main":true},{"actorName":"Garry Miller","urlProfile":"http://www.imdb.com/name/nm0588366","urlPhoto":"","biography":{"bio":"Garry Miller is an actor, known for Jamie (1971), Every Home Should Have One (1970) and The Amazing Mr. Blunden (1972).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0588366","name":"Garry Miller","idIMDB":"nm0588366"},"actorId":"nm0588366","character":"Jamie Allen","urlCharacter":"http://www.imdb.com/character/ch0131793","main":true},{"actorName":"Lynne Frederick","urlProfile":"http://www.imdb.com/name/nm0292802","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNDk4NzQ2MF5BMl5BanBnXkFtZTgwMDQ2NjIwMjE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 July 1954","placeOfBirth":" Hillingdon, Middlesex, England, UK","birthName":"Lynne Maria Frederick","height":"5' 2½\" (1.59 m)","bio":"Lynne Frederick was a promising and ascending British actress of the 1970s. For ten years she captivated movie goers with her perfect combination of girl next door beauty, an angelic smile, an ethereal charm, and a classic fairy tale princess look that was all put into one gifted package. Although best remembered as the fourth and final wife of British comedian, Peter Sellers, Frederick has started gaining a cult following in recent years. Before there was Kate Winslet and Emma Watson, there was Lynne Frederick; the original English Rose. Lynne Wagner Harding Frederick was born in Hillingdon, Uxbridge, United Kingdom to Iris and Andrew Frederick on July 25, 1954. Frederick's father walked out of her life when she was no more than two years of age and she was raised by her grandmother and mother, who worked for Thames Television. Growing up Lynne attended Notting Hill and Ealing High School, and originally intended to become a teacher of physics and mathematics with no intentions of working in Hollywood. In much the same manner as Marilyn Monroe and Lana Turner, Frederick was plucked from obscurity when a talent agent discovered her in a shop and invited her to an audition. Despite no previous experience (in theater, commercials, or films) Frederick got her very first acting job at her first audition. Her debut role came in the 1970 British-American apocalyptic science fiction film, No Blade of Grass (1970). Her next, and more prestigious role, came as Tsar Nicholas's second eldest daughter, Tatiana, in the 1971 Oscar winning British biographical film, Nicholas and Alexandra (1971). In her next film, Henry VIII and His Six Wives (1972), she played another royal figure, the ill-fated fifth wife of Henry VIII, Catherine Howard. Her adaptation as Howard made Tudor cinema history as Frederick was the first actress to portray Howard in a historically accurate and sympathetic point of view. She continued in films with a supporting role in the now cult film, Vampire Circus (1972). Her most well-known screen role came in the 1972 family film, The Amazing Mr. Blunden (1972). For this role she garnered the very first London Evening Standard British Film Award for 'Best New coming Actress'. She followed in films with the 1974 science fiction thriller, Phase IV (1974), for which she was required to appropriate an American accent. Although not a success during its initial release, Phase IV gained a cult following in the years that followed due to its airings on late night television. Frederick co-starred with the Italian Casanovian actor, Fabio Testi, in two films back-to-back as his love interest. The first was the very graphic Italian spaghetti western The Four of the Apocalypse... (1975) which was followed by Red Coat (1975). Frederick then starred in two romantic Spanish films, El vicio y la virtud (1975) and Largo retorno (1975). But her acting credits were not limited to just movies. She also had a long running television career starring in various shows and films made for television. Frederick returned to the horror film scene with her leading role in the 1976 slasher film Schizo (1976). A year later she married fellow actor, Peter Sellers, and would make her final theatrical role alongside him in The Prisoner of Zenda (1979). Lynne Frederick and Peter Sellers relationship was good in the early stages but eventually turned destructive and tempestuous. Their marriage was often tampered with rumors of Frederick being a gold digger, drug use by both parties, and Sellers health issues. Much public scrutiny fell upon Frederick for marrying the much older Sellers, and she often became the target for negative press and tabloids. Further controversy followed after Sellers tragic death on July 24, 1980 (one day before Fredericks twenty sixth birthday) when Frederick was named the beneficiary of nearly his entire will and estate while his children (whom Sellers had never gotten along with and had been estranged from for many years) had gotten hardly anything. Despite pleas from Sellers friends, Frederick did not give Sellers children any further settlements due to her rocky relationship with them. It was then that the whole British public and film industry turned against Frederick, and she was no longer able to find work in Hollywood. Despite the blacklisting that followed Sellers death, Frederick was very protective of his name and reputation. She even won £1 million in a lawsuit against the makers of the Trail of the Pink Panther (1982), a film of Sellers released posthumously, claiming the film tarnished her late husband's memory. Frederick further added to the controversy when she remarried to British media personality, David Frost, six months after Sellers death. The marriage ended in divorce after seventeen months. Following her divorce from Frost, Frederick fled from Britain to America where she met surgeon and heart specialist, Barry Unger, whom she married on Christmas Day in 1982. The following year Frederick bore her only child, Cassie Unger, whom she had a very close relationship with. Her marriage to Unger ended in divorce in 1991. In the later years of her life, Frederick resided in Los Angeles, California where she lived in a spacious house with her daughter, whom she had joint custody of, and they spent most of their days hanging out by the family pool or cooking meals together. In the final years of her life, Lynne Frederick's health spiraled downward as she struggled with alcoholism and bouts of depression. Rumors of chronic drug addiction, clinical depression, failed rehab treatments, and suicide attempts where common news and tabloid reports of Frederick in the later years. The wear and tear of the struggles in life took an obvious tole on her appearance as her weight ballooned, her face became sunken and bloated, and her hair now cropped short and vitiated. Rumor has it that when the paparazzi stood outside her house attempting to get photos of Frederick, there where several occasions where she would walk past them unnoticed as the photographers did not recognize her drastically different appearance in contrast to that of the beautiful English rose that once stole the scenes of films she starred in. On the morning of April 27, 1994, Frederick's lifeless body was discovered by her mother, Iris, in her home. Immediately following Frederick's death, the media engaged in a firestorm of negative press accusing Frederick of being an alcoholic and cocaine addict. They even went as far as reporting her cause of death due to cocaine and alcohol binging. Although the exact cause of Frederick's death has never been disclosed to the public, the common belief is that she died of alcoholism. A year after Frederick's death, her mother revealed in an interview with 'Hello Magazine' that her daughters death had been brought about by natural causes due to a seizure in her sleep, although this has been disputed by some people. For many years, Lynne Frederick's legacy remained poisoned and she was seldom ever talked about. But in recent years, her films have resurfaced to a new generation of cinema buffs where she has been given a whole new fan base and cult following. Many classic movie followers have been taken by her beauty and fallen in love with her.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNDk4NzQ2MF5BMl5BanBnXkFtZTgwMDQ2NjIwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0292802","name":"Lynne Frederick","nicknames":["Lynnie","English Rose","Lynne Sellers","Sellers Widow"],"idIMDB":"nm0292802"},"actorId":"nm0292802","character":"Lucy Allen","urlCharacter":"http://www.imdb.com/character/ch0131792","main":true},{"actorName":"Laurence Naismith","urlProfile":"http://www.imdb.com/name/nm0619802","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwODU2MTE3Nl5BMl5BanBnXkFtZTgwNjY3MDYyMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 December 1908","placeOfBirth":" Thames Ditton, Surrey, England, UK","birthName":"Lawrence Johnson","bio":"The British charactor actor Laurence Naismith was a Merchant Marine seaman before becoming an actor. He made his London stage debut in 1927 in the chorus of the musical \"Oh, Boy.\" Three years later, he joined the Bristol Repertory and remained with them until the outbreak of World War II. After serving nine years in the Royal Artillery (with the final rank of Acting Battery Commander), Naismith returned to the stage and also made his film debut. His seafaring background came in handy in a number of film roles, including the steamboat captain in Mogambo (1953), Dr. Hawkins in Boy on a Dolphin (1957), the captain of the Titanic in A Night to Remember (1958), and the First Sea Lord in Sink the Bismarck! (1960). Naismith also made numerous television appearances, including the recurring roles of Judge Fulton on \"The Persuaders\" (1971) and Father Harris on \"Oh Father\" (1973) .","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwODU2MTE3Nl5BMl5BanBnXkFtZTgwNjY3MDYyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0619802","name":"Laurence Naismith","idIMDB":"nm0619802"},"actorId":"nm0619802","character":"Mr. Blunden","urlCharacter":"http://www.imdb.com/character/ch0131791","main":true},{"actorName":"Erik Chitty","urlProfile":"http://www.imdb.com/name/nm0158364","urlPhoto":"","biography":{"dateOfBirth":"8 July 1907","placeOfBirth":" Dover, Kent, England, UK","height":"5' 5\" (1.65 m)","bio":"Erik Chitty was born on July 8, 1907 in Dover, Kent, England. He was an actor, known for Doctor Zhivago (1965), Please Sir! (1968) and A Bridge Too Far (1977). He was married to Hester Bevan (actress). He died on July 22, 1977 in London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0158364","name":"Erik Chitty","idIMDB":"nm0158364"},"actorId":"nm0158364","character":"Mr. Claverton","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0068200","urlIMDB":"http://www.imdb.com/title/tt0068200","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"05","month":"06","year":"1972","remarks":null},null],"copyrightHolder":"© MCMLXXII The Hemdale Group Limited"},"technical":{"runtime":["1 hr 39 min (99 min)"],"soundMix":["Mono"],"color":["Color (Eastmancolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.0","filmingLocations":[{"location":"Hedgerley, Buckinghamshire, England, UK"}],"rated":"G","awards":[],"votes":"795","type":"Movie","companyCreditsSimple":[{"idCompany":"co0056805","name":"Hemdale"},{"idCompany":"co0071303","name":"Hemisphere Productions"}],"keywords":{"keywords":["children","solicitor","mansion","housekeeper","potion","ghost","curtain call","magical potion","kid outsmarts adult","guardian","hearing voices","pub","attempted murder","child in peril","horror for children","ghostly voice","ghost story","cruelty","master servant relationship","flashback","breaking the fourth wall by talking to the audience","husband wife relationship","waving goodbye","saying goodbye","end credits roll call","scene during end credits","upper class","breaking the fourth wall","boy","girl","little girl","little boy","teenage girl","death by fire","close up of eyes","wink","bearded man","portrait","painting","murder plot","burning building","saved from a fire","drainpipe","climbing a drain pipe","single mother","widow","churchyard","loss of parents","stepmother stepson relationship","evil uncle","ghost girl","ghost boy","old dark house","vase","time paradox","back in time","inheritance","mole on face","garden","class differences","newlywed","uncle nephew relationship","uncle niece relationship","legal guardian","mother in law son in law relationship","visiting a grave","lost in time","contraction in title","marriage","child protagonist","gravestone","graveyard","church","sick child","prayer","saving a life","redemption","self sacrifice","house fire","abandoned house","derelict building","old house","brother sister relationship","mother daughter relationship","mother son relationship","child neglect","padlock","locked in a room","1810s","orphan","coffin","death of parents","horse and carriage","bus","1910s","19th century","20th century","haunting","seeing dead people","relocation","city country contrast","moving","writing on fogged window","library","ghost child","new job","job offer","law office","lawyer","london england","caretaker","manor house","british","country estate","written by director","england","baby","sister","brother","child","servant","four word title","year 1818","year 1918","uncle","grave","cemetery","family relationships","period in title","abbreviation in title","time travel","rescue","fire","haunted house","based on novel","independent film","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:30:23"}}