{"data":{"movies":[{"title":"Adventure in Sahara","originalTitle":"","year":"1938","releaseDate":"19381115","directors":[{"name":"D. Ross Lederman","id":"nm0496505"}],"writers":[{"name":"Maxwell Shane","id":"nm0788058"},{"name":"Samuel Fuller","id":"nm0002087"}],"runtime":"60 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzJlNDYxZTQtMzljYy00NzNkLTlmOTYtZjY3NjlkZWY5Nzc0XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Romance"],"plot":"Agadez is a lonely French outpost baking under the desert sun and commanded by the cruel and oppressive Captain Savatt (). To it comes, at his own request, Legionnaire Jim Wilson ( soon followed by his fiancée, Carla Preston (), who has been tracing him from post to post. Legionnaires seize the fort and turn Savitt loose in the Arab-haunted desert with only a fraction of the water and food needed to get back to civilization. But Savitt gets through and returns to the fort at the head of an avenging troop of men. But Arabs surround Savitt and his men, and the mutineers, knowing that to leave the fort and aid them means their own death...","simplePlot":"Agadez is a lonely French outpost baking under the desert sun and commanded by the cruel and oppressive Captain Savatt (). To it comes, at his own request, Legionnaire Jim ... ","actors":[{"actorName":"Paul Kelly","urlProfile":"http://www.imdb.com/name/nm0446769","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTNjMzUzOWUtOTU5YS00NzJkLWI1MDgtM2I2Y2MwZDc1YTdmXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1899","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Paul Michael Kelly","height":"5' 11\" (1.8 m)","bio":"In retrospect, actor Paul Kelly may have had more high drama in his off-camera life than he did in his rich stage and screen life. How many Broadway and/or Hollywood actors have survived career-wise after serving a prison term for manslaughter? Kelly, whose drive, ambition and talent were undeniably strong, managed to do just that. Lean, reddish-haired, athletically-inclined Irish-Catholic Paul Michael Kelly grew up on the tough streets of Brooklyn, New York, born August 9, 1899, the ninth of ten children. Father Michael owned a bar called Kelly's Cafe. He died while Paul was still quite young and the entire clan was required to pitch in financially. Young Paul, who wound up making his Broadway debut at age 8 in \"The Grand Army Man\", did quite well for his family. His father's establishment was located very close to the Vitagraph Studios and the studio used to borrow furniture from the saloon for their sets. As partial repayment (at the request of his mother), the studio would use Paul for some of their one-reel silents. The boy eventually became the resident moppet at the studio (from 1911 on), appearing with such top matinée heavyweights as Maurice Costello and Constance Talmadge. He went on to play the son in \"The Jarr Family\" series of one-reel adventures starring Harry Davenport as the patriarch. Paul managed to transition into teen and young adult roles alternating between theater and movie assignments. Hit Broadway shows included \"Little Women\" (1916), Booth Tarkington's \"Seventeen\" (1918) and the highly popular \"Penrod\" starring Helen Hayes (also 1918). On celluloid he was romantically paired with Mary Miles Minter in the silent classic Anne of Green Gables (1919) and the success of that film moved him into even higher contention. The early 20s continued to be fruitful for Paul especially behind the theater footlights where he joined such esteemed leading ladies as Doris Kenyon in \"Up the Ladder\" (1922) and Blanche Yurka in \"The Sea Woman\" (1925). Movies also beckoned with The Great Adventure (1921), The New Klondike (1926), Slide, Kelly, Slide (1927) and Special Delivery (1927). Paul was certainly on the right track as he broached out-and-out stardom. It was the love of a woman in the form of actress Dorothy Mackaye, however, that temporarily proved his undoing. Paul met Dorothy and her husband, Ziegfeld Follies song-and-dance man Ray Raymond (1888-1927), while playing in New York and the three became fast friends and party-hearty cronies. They reconnected again years later when all had moved to Hollywood to pursue film. Dorothy's shaky marriage, primarily due to Raymond's chronic drinking and prone to violence, put Paul in a sympathetic mode with the battered Dorothy, which abruptly evolved into a torrid love affair. By April 16, 1927, the couple's cover had been blown wide open and, on that day, escalated into violence when the two men duked it out for the affections of Dorothy. The inebriated Ray came out the definite loser in the fight and died a few days later of a brain hemorrhage reportedly from his pummeling; his acute alcoholism was later figured in as a contributing factor to his death. The tabloids had a field day. Paul was convicted of manslaughter and sentenced to one to ten years in prison; Dorothy was also sentenced as an accessory after the fact and for alleged concealment of facts involving her husband's death (she tried to convince police that he died of \"natural causes\"). She was eventually released on bond after serving ten months; Paul was paroled in August of 1929 for \"good behavior\" after serving 25 months. Paul and Dorothy's strong bond survived the entire ordeal and in 1931 they married after Paul's parole board permitted it. Surprisingly, Paul was not shunned by Broadway. He took his first post-prison Broadway curtain call in a 1930 musical revue and went on to appear in the short-lived play \"Bad Girl\" (1930) opposite Sylvia Sidney. Within the next two years he appeared in \"Hobo\", \"Just to Remind You\", \"Adam Had Two Sons\", and \"The Great Magoo\". Although none were hits, he was firmly establishing himself once again. Hollywood didn't desert him either although he was now relegated to \"B\" supporting roles with an occasional starring part thrown in for good measure. The virile, thin-lipped actor with trademark jut jaw and iron resolve received consistently good notices for his hard-boiled parts, including Broadway Thru a Keyhole (1933), The President Vanishes (1934) and Song and Dance Man (1936). More high drama entered the picture when wife Dorothy was killed in a car accident in January of 1940. The grieving widower with one child in tow (he adopted Dorothy's child, Valerie Raymond, whose name was changed to Mimi Kelly) and became quite a workaholic to quell the pain. In such films as The Flying Irishman (1939), The Roaring Twenties (1939), Invisible Stripes (1939), Queen of the Mob (1940), The Howards of Virginia (1940), Wyoming (1940), Mystery Ship (1941), Mr. and Mrs. North (1942), Tarzan's New York Adventure (1942), The Story of Dr. Wassell (1944), San Antonio (1945), The Cat Creeps (1946) and Crossfire (1947), Paul gave a number of sharp, potent portrayals, freelancing often as either an unyielding police official or sadistic bad guy. He found love again on the film set of Flight Command (1940) and married one of the film's bit part players Claire Owen (née Zona Mardelle Zwicker) in January of 1941. She subsequently retired from acting and went on to survive him. Career satisfaction came with his work on Broadway. During the 1947-1948 season, he was nominated and won a Tony Award (tying with Henry Fonda and Basil Rathbone) for his performance in \"Command Decision\", and earned the Donaldson and Variety Critic's awards to boot. In 1950 he went on to earn further acclaim for originating the part of Frank Elgin, the alcoholic actor in Clifford Odets' classic drama \"The Country Girl\" also starring Uta Hagen. Not a big enough movie draw, he lost both of these prestigious parts on film to Clark Gable and Bing Crosby, respectively. Paul made do by also finding plentiful work on standard TV drama in the 1950s. After suffering a heart attack in 1953, the 57-year-old character actor was stricken again on Election Day, November 6, 1956, this time fatally, just after returning home from voting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTNjMzUzOWUtOTU5YS00NzJkLWI1MDgtM2I2Y2MwZDc1YTdmXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0446769","name":"Paul Kelly","idIMDB":"nm0446769"},"actorId":"nm0446769","character":"Jim Wilson","urlCharacter":"http://www.imdb.com/character/ch0506999","main":true},{"actorName":"C. Henry Gordon","urlProfile":"http://www.imdb.com/name/nm0330059","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWM3NDdhNGQtNzEwZi00MDkwLWI5YWUtNTI1ZTc4ZWU2OWEyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 June 1884","placeOfBirth":" New York City, New York, USA","birthName":"Henry Racke","height":"5' 11\" (1.8 m)","bio":"Although he occasionally played honest police officials or army officers, New York-born C. Henry Gordon excelled at playing oily, duplicitous villains, whether gangsters, businessmen or evil rulers. Among the many evildoers he portrayed, his most memorable would have to be the murderous Surat Khan, who massacred prisoners, women and children, in the classic Errol Flynn swashbuckler The Charge of the Light Brigade (1936).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWM3NDdhNGQtNzEwZi00MDkwLWI5YWUtNTI1ZTc4ZWU2OWEyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0330059","name":"C. Henry Gordon","idIMDB":"nm0330059"},"actorId":"nm0330059","character":"Capt. Savatt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lorna Gray","urlProfile":"http://www.imdb.com/name/nm0336790","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMzg2OTEwMF5BMl5BanBnXkFtZTgwNjI1OTgwMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1917","placeOfBirth":" Grand Rapids, Michigan, USA","birthName":"Virginia Pound","bio":"Born Virginia Pound, Lorna Gray was \"discovered\" by a Columbia Pictures agent while modeling in a fashion show. She was given a screen test, and Columbia was impressed enough to sign her to a contract (it was at this time that she was given the name \"Lorna Gray\", which she kept until 1945, when she changed it to \"Adrian Booth\"). She was put in the studio's B unit, occasionally loaned out to Republic or Monogram, and when not making features was used in Columbia's comedy shorts, supporting such performers as The Three Stooges and Buster Keaton (where she actually acquitted herself quite well). She left Columbia and began her long career with Republic Pictures in 1941, appearing in westerns, thrillers, horror pictures and especially the serials in which the studio specialized. She married actor David Brian in 1948, and after making films for a few more years, retired from the screen in 1951.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMzg2OTEwMF5BMl5BanBnXkFtZTgwNjI1OTgwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0336790","name":"Lorna Gray","idIMDB":"nm0336790"},"actorId":"nm0336790","character":"Carla Preston","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Fiske","urlProfile":"http://www.imdb.com/name/nm0279963","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNzg5ZmMtYmIwNS00NWZkLTljZGUtMjY2NGE1NWZhNTZlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1889","placeOfBirth":" Griggsville, Missouri, USA","bio":"Robert Fiske was born on October 20, 1889 in Griggsville, Missouri, USA. He was an actor, known for Religious Racketeers (1938), Black Dragons (1942) and The Green Archer (1940). He died on September 12, 1944 in Sunland, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNzg5ZmMtYmIwNS00NWZkLTljZGUtMjY2NGE1NWZhNTZlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0279963","name":"Robert Fiske","idIMDB":"nm0279963"},"actorId":"nm0279963","character":"Lt. Dumond","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marc Lawrence","urlProfile":"http://www.imdb.com/name/nm0492908","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNzM5ODQ4MF5BMl5BanBnXkFtZTcwMjE4ODExOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1910","placeOfBirth":" New York City, New York, USA","birthName":"Max Goldsmith","height":"5' 10\" (1.78 m)","bio":"American character actor who specialized in underworld types, despite a far greater range. A native of the Bronx, Lawrence participated in plays in school, then attended the City College of New York. In 1930, he was accepted into Eva Le Gallienne's company, where he became friendly with another young actor, one day to be known as John Garfield. The two appeared in a number of plays, both with Le Galliene's company and with the highly-politicized Group Theatre, before Lawrence was given a film contract with Columbia Pictures. His scarred complexion and brooding appearance made him a natural for heavies, and he played scores of gangsters and mob bosses over the next six decades. Nevertheless, he could turn in fine performances in very different kinds of roles as well, such as his bewildered mountain boy in The Shepherd of the Hills (1941). Following the Second World War, as anti-Communist fervor gripped America, Lawrence found himself under scrutiny for his political leanings. When called before the House Un-American Activities Committee, he admitted he had once been a member of the Communist Party. The Committee broke down his resolve and he named the names of other Party members. He was blacklisted and departed for Europe, where he continued to make films, often in leading roles. Following the demise of the blacklist, he returned to America and resumed his position as a familiar and talented purveyor of gangland types. A writer and director as well, Lawrence has remained active in his ninth decade.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNzM5ODQ4MF5BMl5BanBnXkFtZTcwMjE4ODExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0492908","name":"Marc Lawrence","idIMDB":"nm0492908"},"actorId":"nm0492908","character":"Poule","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dick Curtis","urlProfile":"http://www.imdb.com/name/nm0193318","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWZiMmQ3YzQtNmU2My00ZDg3LTliZDctYjkzZmQzZjgyN2UyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 May 1902","placeOfBirth":" Newport, Kentucky, USA","birthName":"Richard Dye","height":"6' 3\" (1.91 m)","bio":"Tall, hulking character actor Dick Curtis spent years at Columbia Pictures menacing everyone from cowboy star Charles Starrett to the slapstick team of The Three Stooges. Curtis, unlike many movie villains, showed a genuine flair for comedy--especially physical comedy--in his many appearances in the studio's two-reelers and could do a double-take, a pratfall, take a pie in the face, a finger-poke to the eyes or a crowbar on the top of the head with the best of them. Although much of his career was spent at Columbia, where he specialized in western villains, he can also be seen as one of the crewmen who set out to rescue Fay Wray from the clutches of the giant ape in the original King Kong (1933). He died in Hollywood of pneumonia in 1952.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWZiMmQ3YzQtNmU2My00ZDg3LTliZDctYjkzZmQzZjgyN2UyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0193318","name":"Dick Curtis","idIMDB":"nm0193318"},"actorId":"nm0193318","character":"Karnoldi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stanley Brown","urlProfile":"http://www.imdb.com/name/nm0114692","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzcwZTczNTktNTZmMy00M2MwLWE5MjUtZTI2MGY3ODZlMGY4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1914","placeOfBirth":" Calgary, Alberta, Canada","bio":"Stanley Brown was born on August 18, 1914 in Calgary, Alberta, Canada. He was an actor, known for Sing, Neighbor, Sing (1944), The Man with Nine Lives (1940) and Hitchhike to Happiness (1945). He was married to Lorraine McCall and Ruth F. Brown. He died on September 29, 2001 in West Los Angeles, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzcwZTczNTktNTZmMy00M2MwLWE5MjUtZTI2MGY3ODZlMGY4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0114692","name":"Stanley Brown","idIMDB":"nm0114692"},"actorId":"nm0114692","character":"René Malreaux","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Al Bridge","urlProfile":"http://www.imdb.com/name/nm0108653","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjI0OGUxMDctNmFmYy00NjU3LWJmNjYtNDkyYThmY2JhY2IwXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 February 1891","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Alfred Morton Bridge","bio":"American character actor, a fixture both in Westerns and in the comedies of Preston Sturges. Although frequently billed as \"Alan\" Bridge, he was born Alfred Morton Bridge in Philadelphia, Pennsylvania in 1891 (not as \"Alford\" Bridge in 1890, as his tombstone erroneously states), he and his sister, future actress Loie Bridge, were raised by their mother Loie and her second husband, butcher Wilmer Shinn. Following service as a corporal in the U.S. Army infantry in the first World War, Bridge joined a theatrical troupe which also included several of his relatives. The 1920 census showed him on tour in Kansas City, Missouri. He dabbled in writing and in 1930 sold a script to a short film, Her Hired Husband (1930). He followed this with a B-Western script, God's Country and the Man (1931), in which he made his film debut as an actor. For the next quarter century, he managed the atypical achievement of maintaining a career in both B-Westerns and in bigger dramatic and comedy features. Ten films for director Preston Sturges represent probably his most familiar contribution to Hollywood history. Bridge also appeared frequently on television until his death in 1957 at 66.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjI0OGUxMDctNmFmYy00NjU3LWJmNjYtNDkyYThmY2JhY2IwXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0108653","name":"Al Bridge","nicknames":["Alfred Bridge","Alford Morton Bridge","Alan L. Bridge","Alan Morton Bridge"],"idIMDB":"nm0108653"},"actorId":"nm0108653","character":"Cpl. Dronov","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ray Bennett","urlProfile":"http://www.imdb.com/name/nm0071986","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDJmNjdjMDItZjJkYi00ZGEyLWE3NTAtNzQ0NDAxMGQ2NGM3XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 March 1895","placeOfBirth":" Portland, Oregon, USA","birthName":"Raphael Fabian Bennett","bio":"After spending his childhood in San Francisco, Bennett eventually moved to Los Angeles and was residing in Beverly Hills by 1930. From the onset, he had close ties to the acting profession, his mother (Ella Costillo Bennett) being a celebrated drama critic and author. His first acting was in stock and his entry to films was via stunt work. Throughout his career he was variously billed either as \"Ray' or (for better productions) as 'Raphael' Bennett. When he eventually graduated to speaking parts -- which varied in size from small to medium -- it was generally as hard-bitten desperadoes or assorted sneaky henchmen in westerns and serials. On luckier occasions he got to play the lead villain. The majority of his appearances were for Poverty Row outfits like Republic or Monogram. The life of a small part contract player could not have been an easy one. The 1940 census had Ray working for six weeks in 1939, earning a meagre $1250. In between filming, Ray tried his hand at writing dramatic novels with a historical setting. At least one of his unpublished manuscripts (\"The Shelter of the Cloth\") is still held as part of the UCLA Library Special Collections. He never married and died from a long-standing heart affliction in December 1957 at the age of 62.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDJmNjdjMDItZjJkYi00ZGEyLWE3NTAtNzQ0NDAxMGQ2NGM3XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0071986","name":"Ray Bennett","idIMDB":"nm0071986"},"actorId":"nm0071986","character":"Ladoux","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles R. Moore","urlProfile":"http://www.imdb.com/name/nm0601023","urlPhoto":"","biography":{"dateOfBirth":"23 April 1893","placeOfBirth":" Chicago, Illinois, USA","birthName":"Charles Randolph Moore","bio":"Charles R. Moore was born on April 23, 1893 in Chicago, Illinois, USA as Charles Randolph Moore. He was an actor, known for Sullivan's Travels (1941), The Little Foxes (1941) and The Palm Beach Story (1942). He died on July 20, 1947 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0601023","name":"Charles R. Moore","idIMDB":"nm0601023"},"actorId":"nm0601023","character":"Gungadin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dwight Frye","urlProfile":"http://www.imdb.com/name/nm0296859","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMjg5NTc3M15BMl5BanBnXkFtZTYwNjI2ODU2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1899","placeOfBirth":" Salina, Kansas, USA","birthName":"Dwight Iliff Fry","height":"5' 6½\" (1.69 m)","bio":"An extremely versatile character actor and originator of several memorable characterizations in the horror film genre, Dwight Frye had a notable theatrical career in the 1920s, moving from juvenile parts to leads before entering film. A favorite actor of Broadway theatrical producer-director Brock Pemberton, he originated the part of \"the Son\" in his hit 1922 production of Luigi Pirandello's \"Six Characters in Search of an Author.\" Pemberton would continue to employ Frye in Broadway productions throughout the decade. Cast with Bela Lugosi in a 1926 production of \"The Devil and the Cheese,\" he ultimately appeared in at least two Lugosi films. Despite (or perhaps because of) his memorable, impassioned portrayals of real estate agent-cum-madman Renfield in Tod Browning's Dracula (1931) and Fritz the sadistic hunchbacked lab assistant in James Whale's Frankenstein (1931), the industry seemed determined to typecast Frye, and his film career would be marked with frustration. The Crime of Doctor Crespi (1935) offered him billing second only to that of villain Erich von Stroheim, but all too soon he was consigned to playing a lackluster array of crazies, spies, red herrings, grasping heirs and bit parts. He occasionally returned to the stage in comedies, musicals, and thrillers such as \"Night Must Fall\" and a stage version of \"Dracula.\" Frye was perplexed to find that his versatility in the theatre went unnoticed in Hollywood, where he was relegated to lunatic roles and often had his parts severely cut. Indeed, in Son of Frankenstein (1939) his role was deemed as unnecessary when an abrupt switch was made from Technicolor to black and white after his scenes were shot. Frye, a devout Christian Scientist, had concealed a heart condition from his friends and family. After the outbreak of WWII, unable to enlist, he worked nights (between films and local theatre productions) as a draftsman for the Lockheed Aircraft Co. An uncanny physical resemblance to then-Secretary of War Newton Baker led his to being signed to a substantial role in Wilson (1944), directed by Henry King, based on the life of U.S. President Woodrow Wilson, but Frye succumbed to a heart attack on a crowded bus a few days after being cast while returning home from a movie with his son. He was buried at Forest Lawn Cemetery in Glendale, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMjg5NTc3M15BMl5BanBnXkFtZTYwNjI2ODU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0296859","name":"Dwight Frye","idIMDB":"nm0296859"},"actorId":"nm0296859","character":"Gravet - 'The Jackal'","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stanley Andrews","urlProfile":"http://www.imdb.com/name/nm0003224","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWU1MDI4NjYtNGNkYy00ODgzLTgyOWQtZGIxMTVhNWMzNDM4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1891","placeOfBirth":" Chicago, Illinois, USA","birthName":"Stanley Andrzejewski","height":"5' 10\" (1.78 m)","bio":"Stanley Andrews was born on August 28, 1891 in Chicago, Illinois, USA as Stanley Andrzejewski. He was an actor, known for Meet John Doe (1941), The Ox-Bow Incident (1943) and Vengeance Valley (1951). He died on June 23, 1969 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWU1MDI4NjYtNGNkYy00ODgzLTgyOWQtZGIxMTVhNWMzNDM4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003224","name":"Stanley Andrews","idIMDB":"nm0003224"},"actorId":"nm0003224","character":"Col. Rancreux","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0029841","urlIMDB":"http://www.imdb.com/title/tt0029841","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":"06","month":"10","year":"1938","remarks":null},"filmingDates":null,"copyrightHolder":"Columbia Pictures Corporation of California, Ltd., 21 November 1938, LP8431"},"technical":{"runtime":["1 hr (60 min)"],"soundMix":["Mono (Western Electric Mirrophonic Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.0","filmingLocations":[],"rated":"APPROVED","awards":[],"votes":"97","type":"Movie","companyCreditsSimple":[{"idCompany":"co0050868","name":"Columbia Pictures Corporation"}],"keywords":{"keywords":["violence","suicide","solitary confinement","held at gunpoint","french foreign legion","court martial","sahara desert","mutiny","revenge"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 06:24:30"}}