{"data":{"movies":[{"title":"Exterminator 2","originalTitle":"","year":"1984","releaseDate":"19840914","directors":[{"name":"Mark Buntzman","id":"nm0120602"}],"writers":[{"name":"Mark Buntzman","id":"nm0120602"},{"name":"William Sachs","id":"nm0755197"}],"runtime":"89 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWE1MGIyODItYzI3MC00Y2MzLWE4MjItZTE0MWQyOWNjYTE4XkEyXkFqcGdeQXVyMzM4MjM0Nzg@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Crime","Drama","Thriller"],"plot":"The flamethrower-wielding vigilante John Eastland returns to rid New York of a drug lord and his gang.","simplePlot":"The flamethrower-wielding vigilante John Eastland returns to rid New York of a drug lord and his gang.","actors":[{"actorName":"Robert Ginty","urlProfile":"http://www.imdb.com/name/nm0320180","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMTc1MDM0NF5BMl5BanBnXkFtZTcwMDUwMzcyMQ@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 November 1948","placeOfBirth":" New York City, New York, USA","birthName":"Robert Winthrop Ginty","height":"6' 1\" (1.85 m)","bio":"Born in New York, rugged, virile, hard-looking action star Robert Ginty initially sought a career in music, becoming involved in several rock bands from age 16 on. During this stage he actually got to play and hang out with several rock legends, including Jimi Hendrix, Janis Joplin, Carlos Santana and John Lee Hooker. In the 1970s, however, he switched gears and gave acting a try. Trained at the Neighborhood Playhouse and the Actors Studio for a time, he eventually found himself thriving in the regional theater circuit. Harold Prince brought him to Broadway as his assistant after seeing him perform William Shakespeare's works in New Hampshire. Eventually Hollywood beckoned and Ginty journeyed to the western shore, where he found frequent work as a strong-armed player on TV action. Finding a steady role on Black Sheep Squadron (1976) and bit parts in Bound for Glory (1976) and Two-Minute Warning (1976), he made his biggest impression as Bruce Dern's pal in Coming Home (1978). Around the time he was appearing in the series The Paper Chase (1978), Robert won his first film action lead in The Exterminator (1980), which became a surprising box-office hit. Soon Ginty was on a roll, emulating Clint Eastwood and Sylvester Stallone as a high-action anti-hero. He formed his own production company that distributed his vehicles both here and abroad. Most were crudely made on very limited budgets, but he has nevertheless done quite well for himself as a writer/producer/director, especially overseas, with such assembly-line fare as Gold Raiders (1982), which was filmed in Thailand; Cop Target (1990), which was shot in France; and the sequel to his first big hit, Exterminator 2 (1984). Ginty did not slow down into the late 1990s, performing producing and directing chores on such shows as China Beach (1988), Xena: Warrior Princess (1995), Nash Bridges (1996), Charmed (1998) and Tracker (2001). He has also been a viable presence as a director on the experimental theater scene, particularly in Europe. He directed a rap/hip-hop musical version of Anthony Burgess' \"A Clockwork Orange\" to fine reviews. Married three times, Robert Ginty died of cancer at age 60 and was survived by third wife Michelle and two children: Marissa (by actress Lorna Patterson) and James Francis Ginty (by wife Francine Tacker).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMTc1MDM0NF5BMl5BanBnXkFtZTcwMDUwMzcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0320180","name":"Robert Ginty","nicknames":["The Paper Chase Guy"],"idIMDB":"nm0320180"},"actorId":"nm0320180","character":"John Eastland","urlCharacter":"http://www.imdb.com/character/ch0055820","main":true},{"actorName":"Mario Van Peebles","urlProfile":"http://www.imdb.com/name/nm0005522","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MzgwOTA1NV5BMl5BanBnXkFtZTYwODI5NjM1._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 January 1957","placeOfBirth":" Mexico City, Distrito Federal, Mexico","height":"5' 10\" (1.78 m)","bio":"Mario Van Peebles is a highly regarded director, actor, producer and writer. His directorial skills can be seen in the retelling of the epic mini-series \"Roots\" starring Forest Whitaker and Matthew Goode. Van Pebbles has directed award-winning shows such as the recent hit \"Empire\" and \"The Last Ship,\" as well as \"Sons of Anarchy,\" \"Lost,\" \"Damages,\" and \"Boss.\" As an actor Van Peebles has credits are as equally impressive. An independent filmmaker to his core, Van Pebbles grew up watching Melvin Van Peebles, his maverick filmmaker father. A true master craftsman in his own right, Van Peebles is defined as a director, screenwriter, playwright, novelist and composer; known for funding his own work. His many talents can be seen in films like his directorial breakout hit \"New Jack City,\" \"Posse\" and \"Panther;\" plus Michael Mann's Oscar® nominated \"Ali,\" in which he received critical acclaim for his role as real life minister and human rights activist Malcom X; the multi-award-winning \"Cotton Club\" written and directed by Francis Ford Coppola; Clint Eastwood's \"Heartbreak Ridge;\" and several projects with Ava DuVernay. Throughout his career, Van Peebles has brought challenging, compelling material to the screen, including his hip hop coming-of-age film \"We the Party,\" for which he wrote, directed and produced; his documentary short \"Bring You're a Game;\" and, of course, \"Baadasssss!\" This was Van Peebles' odyssey about the making of his father's groundbreaking film \"Sweet Sweetback's Baadasssss Song\" and was one of Ebert and Roeper's ten best movies of the year for 2004. As a director, Van Pebbles has affected unusually strong performances from his fellow actors. They often remark that he creates a collaborative climate where they feel free to do their best work. He believes his background as an actor helps him approach the actor's character development process internally. Conversely, he believes being a director has made him a more trusting, nuanced actor. Being able to do both is like creative crop rotation for Van Peebles. Not many directors get the privilege of being directed by other strong filmmakers. Acting for others is still \"super exciting\" to him. In 1994, Hofstra University awarded Van Peebles an honorary doctorate of humane letters. After earning a Bachelor of Arts in Economics from Columbia University, Van Peebles spent two years working at New York's Department of Environmental Protection before moving to Hollywood to try his hand at acting writing and directing. In addition to directing and acting in features, Van Peebles is passionate about supporting education and eco-consciousness through media. With his reality show, Mario's Green House, he teamed up with his five children and his father to chronicle the Van Peebles family's often-humorous attempts to raise their eco-consciousness as they try to go green in Hollywood. Green \"We never got to the full green, more like Olive green,\" jokes Van Peebles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MzgwOTA1NV5BMl5BanBnXkFtZTYwODI5NjM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005522","name":"Mario Van Peebles","nicknames":["stone","Chip"],"idIMDB":"nm0005522"},"actorId":"nm0005522","character":"X","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Deborah Geffner","urlProfile":"http://www.imdb.com/name/nm0311708","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2OTEwNDc1NV5BMl5BanBnXkFtZTgwNTMzMTM3NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 August 1952","placeOfBirth":" Pittsburgh, Pennsylvania, USA","height":"5' 8\" (1.73 m)","bio":"Deborah Geffner is an actress, writer, director, singer, dancer, filmmaker, coach, animal-lover, and mom. She is best recognized for her role in Bob Fosse's Oscar-winning film All That Jazz (1979). You've seen her on TV in ER (1994), Grey's Anatomy (2005), Monk (2002), and Criminal Minds (2005), among others, and in films such as Living Out Loud (1998), Infestation, and Exterminator 2 (1984). Deborah's passion is telling stories. She has loved acting ever since the age of five when she filled in for the little boy who got the measles on opening night of the Caucasian Chalk Circle at Carnegie Mellon. She got to say lines, fence with boys and eat cookies on stage. And at the end everyone applauded for her! (What could be better?!) Later engagements included 2 ½ years on Broadway in the original run of \"A Chorus Line\", the Broadway revival of \"Pal Joey\" and \"Accomplice\" at the Pasadena Playhouse. While in New York, Deborah studied at Juilliard, at HB Studios and with great teachers: Larry Moss, Sam Schacht, then in Los Angeles with Peggy Feury, Peter Flood, The Groundlings, and the wonderful Richard Seyd. Soon after moving to LA, she was cast as a series regular in the pilot \"Century Hill\" and in the TV-movie Legs (1983). She starred as a Radio City Music Hall Rockette in Manhattan with one of her idols Gwen Verdon. It was there, on the day after Valentine's Day, that her boyfriend flew to New York and proposed to her in the middle of the Brooklyn Bridge after a snowstorm. They are still married. After a break to raise two bizarre, sweet and fascinating daughters, she returned to acting full time and started writing, directing, and producing. She considers directing very relaxing. After living with teenagers, she finds it refreshing to have people actually listen to her. She has made three award-winning short films to date, and directed three plays which got rave reviews. The last was chosen for Best Of Fringe in the 2012 Hollywood Fringe Festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2OTEwNDc1NV5BMl5BanBnXkFtZTgwNTMzMTM3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0311708","name":"Deborah Geffner","idIMDB":"nm0311708"},"actorId":"nm0311708","character":"Caroline","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frankie Faison","urlProfile":"http://www.imdb.com/name/nm0265670","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1Mjk3NDg5MV5BMl5BanBnXkFtZTcwNzI2ODQ1MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1949","placeOfBirth":" Newport News, Virginia, USA","height":"6' 2\" (1.88 m)","bio":"Frankie Faison was born on June 10, 1949 in Newport News, Virginia, USA. He is an actor, known for The Silence of the Lambs (1991), Hannibal (2001) and The Wire (2002). He has been married to Jane Mandel since December 26, 1988. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1Mjk3NDg5MV5BMl5BanBnXkFtZTcwNzI2ODQ1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0265670","name":"Frankie Faison","idIMDB":"nm0265670"},"actorId":"nm0265670","character":"Be Gee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott 'Slo-motion' Randolph","urlProfile":"http://www.imdb.com/name/nm0709865","urlPhoto":"","biography":{"bio":"Scott 'Slo-motion' Randolph is an actor, known for Exterminator 2 (1984) and Miami Vice (1984).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0709865","name":"Scott 'Slo-motion' Randolph","idIMDB":"nm0709865"},"actorId":"nm0709865","character":"Eyes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Reggie Rock Bythewood","urlProfile":"http://www.imdb.com/name/nm0090066","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMTIxNDE3ODdeQTJeQWpwZ15BbWU3MDg4OTI5NDc@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 July 1965","placeOfBirth":" Bronx, New York, USA","bio":"Reggie Rock Bythewood grew up in the Bronx, New York where it was against the law not be a Yankee fan. Bythewood, a law-abiding Yank fan, boxed as a teenager and went to the High School of Performing Arts as a drama major. He received a BFA in theater from Marymount Manhattan College. After acting in a John Sayles film called, The Brother From Another Planet, he was inspired to write and direct. Bythewood formed a theater company with some friends called, The Tribe, which produced plays written and directed by Bythewood. Bythewood moved to Los Angeles to pursue a career in screen-writing and became one of the first members of Disney's prestigious Writers Fellowship Program. From there, he was hired as a writer on the hit NBC comedy series, \"A Different World\" where he met his future wife, Gina Prince-Bythewood (a Dodgers fan). He went on to write and produce Dick Wolf's drama series \"New York Undercover.\" After attending the Million Man March, Bythewood wrote the screenplay for Spike Lee's indie film, \"Get On The Bus.\" Bythewood was also one of the film's investors. Bythewood made his feature film directorial debut on the acclaimed indie flick, \"Dancing in September.\" It was acquired by HBO and became an HBO original movie. Bythewood has also written and directed \"Biker Boyz,\" the documentary, \"Daddy's Girl,\" the ESPN 30-for-30 documentary, \"One Night In Vegas\" and \"Gun Hill,\" the two hour pilot for BET. He also did the rewrites for the Fox Searchlight film, \"Notorious\" and was awarded written by credit along with the film's initial writer, Cheo Hodari Coker. Bythewood resides in southern California with his wife, filmmaker, Gina Prince-Bythewood, and their two sons, who both happen to love the Yankees.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMTIxNDE3ODdeQTJeQWpwZ15BbWU3MDg4OTI5NDc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0090066","name":"Reggie Rock Bythewood","idIMDB":"nm0090066"},"actorId":"nm0090066","character":"Spider","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bruce Smolanoff","urlProfile":"http://www.imdb.com/name/nm0810554","urlPhoto":"","biography":{"bio":"Bruce Smolanoff is an actor and producer, known for Mortal Thoughts (1991), My Elena (2009) and Requiem for a Dream (2000). He has been married to Emilie McDonald since September 16, 2006. They have one child.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0810554","name":"Bruce Smolanoff","idIMDB":"nm0810554"},"actorId":"nm0810554","character":"Red Rat","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Buntzman","urlProfile":"http://www.imdb.com/name/nm0120601","urlPhoto":"","biography":{"bio":"David Buntzman is an actor, known for Exterminator 2 (1984), Histoires d'Amérique: Food, Family and Philosophy (1989) and Identity Crisis (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0120601","name":"David Buntzman","idIMDB":"nm0120601"},"actorId":"nm0120601","character":"Head Mafioso","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kenny Marino","urlProfile":"http://www.imdb.com/name/nm1222818","urlPhoto":"","biography":{"dateOfBirth":"29 December 1943","placeOfBirth":"","bio":"Kenny Marino was born on December 29, 1943. He was an actor, known for Prince of the City (1981), Death Wish 3 (1985) and Exterminator 2 (1984). He died on September 27, 2010 in Jersey City, New Jersey, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1222818","name":"Kenny Marino","idIMDB":"nm1222818"},"actorId":"nm1222818","character":"Tony","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Derek Evans","urlProfile":"http://www.imdb.com/name/nm0262709","urlPhoto":"","biography":{"bio":"Derek Evans is an actor, known for Exterminator 2 (1984) and The Edge of Night (1956).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0262709","name":"Derek Evans","idIMDB":"nm0262709"},"actorId":"nm0262709","character":"Squealer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Irwin Keyes","urlProfile":"http://www.imdb.com/name/nm0450815","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzOTAwNjMyMl5BMl5BanBnXkFtZTYwMDk2MTEz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 March 1952","placeOfBirth":" New York City, New York, USA","height":"6' 1\" (1.85 m)","bio":"Large (6'1\"), affable, and commanding character actor Irwin Keyes was born on March 16, 1952 in New York City. Keyes grew up in Amityville, New York and graduated from Amityville Memorial High School in 1970. He acted in his first play \"The Lower Depths\" by Maxim Grody while attending college. Frequently cast as likable lugs, brutish goons, and imposing authority figures, Irwin acted in a diverse array of movies in such genres as horror (\"Friday the 13th,\" \"Guilty as Charged,\" \"House of 1000 Corpses\"), comedy (\"The Private Eyes,\" \"Zapped!;\" hilarious as Wheezy Joe in \"Intolerable Cruelty\"), thriller (\"Dream Lover\"), science fiction (both \"Oblivion\" pictures), and action (\"The Warriors,\" \"The Exterminator\" and its sequel). Keyes achieved his greatest enduring popularity with his recurring role as endearingly oafish bodyguard Hugo Majelewski on the hit sitcom \"The Jeffersons.\" Among the TV shows that Irwin made guest appearances on are \"Laverne & Shirley,\" \"Police Squad!,\" \"Moonlighting,\" \"Married with Children,\" \"thirtysomething,\" \"Growing Pains,\" \"Tales from the Crypt,\" and \"CSI: Crime Scene Investigation.\" Moreover, Keyes not only acted in TV commercials and music videos (he was very touching as a struggling down on his luck actor in the music video for \"Good Enough\" by Prozak), but also did voice overs for video games. Irwin lived in Los Angeles, California and continued to act with pleasing regularity right up until his death at age 63 on July 8, 2015.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzOTAwNjMyMl5BMl5BanBnXkFtZTYwMDk2MTEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0450815","name":"Irwin Keyes","idIMDB":"nm0450815"},"actorId":"nm0450815","character":"Monster","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Louis King","urlProfile":"http://www.imdb.com/name/nm0455215","urlPhoto":"","biography":{"bio":"Robert Louis King is an actor, known for Exterminator 2 (1984) and America (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0455215","name":"Robert Louis King","idIMDB":"nm0455215"},"actorId":"nm0455215","character":"Philo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arye Gross","urlProfile":"http://www.imdb.com/name/nm0343325","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU2MjM2NjY4MV5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 March 1960","placeOfBirth":" Los Angeles, California, USA","height":"5' 8\" (1.73 m)","bio":"Extremely gifted character actor whose face is readily familiar to the public but they can often not remember why. He tends to turn minor supporting roles into perfect studies in human frailty, strength, passion, avarice or anything else demanded by the role. Born on March 17, 1960, in Los Angeles, Arye Gross attended the University of California at Irvine and went on to study acting at the Conservatory at South Coast Repertory. He then became a member of the South Coast Repertory resident company for three years. This was followed by a year with El Teatro Campesino under the direction of Luis Valdez. Gross has appeared in a number of stage productions with a variety of companies in the Los Angeles area, including LATC, Pasedena Playhouse, Odyssey Theater Ensemble, MET Theater and Stages Theater Center. Gross' extensive stage credits include \"La Bete\" for the Stages Theatre Center, \"Room Service\" for the Pasadena Playhouse, \"Three Sisters\" for the Los Angeles Theatre Center, \"Taming of the Shrew\" and \"Much Ado About Nothing\" for the Grove Shakespeare Festival, \"Troillus and Cressida\" for the Globe Playhouse and \"Screwball\" and \"Let's Play Two\" for the South Coast Repertory Theatre. His tour de force as the lackey sent to fetch famed singer Dixie Leonard (Bette Midler) for a TV show in For the Boys (1991) provided what would have been an otherwise mediocre film with all its pivotal moments upon which the story would turn. The most important growth of a character in that film turns out to be that of his who goes from a \"go-fer\" to his own man as a result of his tender encounter with Dixie as she tells him her life story. However, as usual, his performance appeared a seamless part of the whole. In another era, a great character actor such as Gross would be more widely appreciated and celebrated. Many viewers will recall his appearance as the wronged husband in Minority Report (2002) which demanded a change from a loving family man to a betrayed husband falling victim to murderous rage all within a few minutes time. Simply superb.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU2MjM2NjY4MV5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0343325","name":"Arye Gross","idIMDB":"nm0343325"},"actorId":"nm0343325","character":"Turbo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Janet Rotblatt","urlProfile":"http://www.imdb.com/name/nm0744725","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMTU4MTI5Nl5BMl5BanBnXkFtZTYwMTcxMDky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Janet Rotblatt is an actress, known for The Craft (1996), Ruthless People (1986) and Heart and Souls (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMTU4MTI5Nl5BMl5BanBnXkFtZTYwMTcxMDky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0744725","name":"Janet Rotblatt","idIMDB":"nm0744725"},"actorId":"nm0744725","character":"Mom","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steffen Zacharias","urlProfile":"http://www.imdb.com/name/nm0951597","urlPhoto":"","biography":{"dateOfBirth":"11 April 1927","placeOfBirth":" Germany","bio":"Steffen Zacharias was born on April 11, 1927 in Germany. He was an actor, known for They Call Me Trinity (1970), Ace High (1968) and Even Angels Eat Beans (1973). He died on June 6, 1989 in North Hollywood, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0951597","name":"Steffen Zacharias","idIMDB":"nm0951597"},"actorId":"nm0951597","character":"Pop","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0087229","urlIMDB":"http://www.imdb.com/title/tt0087229","business":{"budget":null,"openingWeekend":[{"money":"$1,204,197","country":"USA","day":"16","month":"09","year":"1984","remarks":"535 Screens"}],"gross":[{"money":"$3,739,406","country":"USA","day":"21","month":"10","year":"1984","remarks":""},{"money":"$3,053,629","country":"USA","day":"14","month":"10","year":"1984","remarks":""},{"money":"$2,225,011","country":"USA","day":"08","month":"10","year":"1984","remarks":""},{"money":"$2,131,764","country":"USA","day":"30","month":"09","year":"1984","remarks":""},{"money":"$1,950,185","country":"USA","day":"23","month":"09","year":"1984","remarks":""},{"money":"$1,204,197","country":"USA","day":"16","month":"09","year":"1984","remarks":""}],"weekendGross":[{"money":"$385,777","country":"USA","day":"21","month":"10","year":"1984","remarks":"262 Screens"},{"money":"$772,523","country":"USA","day":"14","month":"10","year":"1984","remarks":"480 Screens"},{"money":"$98,164","country":"USA","day":"08","month":"10","year":"1984","remarks":"98 Screens"},{"money":"$75,250","country":"USA","day":"30","month":"09","year":"1984","remarks":"101 Screens"},{"money":"$400,002","country":"USA","day":"23","month":"09","year":"1984","remarks":"302 Screens"},{"money":"$1,204,197","country":"USA","day":"16","month":"09","year":"1984","remarks":"535 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 29 min (89 min)"],"soundMix":["Stereo"],"color":["Color (TVC)"],"aspectRatio":["1.85 : 1"],"camera":["Arriflex Cameras and Lenses"],"laboratory":["TVC Laboratories, New York, USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"3.9","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[],"votes":"1,465","type":"Movie","companyCreditsSimple":[{"idCompany":"co0044937","name":"Cannon Group"},{"idCompany":"co0159707","name":"Golan-Globus Productions"}],"keywords":{"keywords":["gang","drugs","vigilante","new york","second part","person on fire","new york city","exploding car","1980s","nightclub","bar","brutality","vigilantism","loss of loved one","tough guy","one man army","anti hero","action hero","warehouse","street gang","garbage truck","dancer","exploitation","vigilante justice","sequel to cult favorite","psychotronic","grindhouse","cult film","flamethrower","murder","mafia","sequel","violence","city","revenge","execution","independent film","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:40:53"}}