{"data":{"movies":[{"title":"The Deadly Companions","originalTitle":"","year":"1961","releaseDate":"1961","directors":[{"name":"Sam Peckinpah","id":"nm0001603"}],"writers":[{"name":"Albert Sidney Fleischman","id":"nm0281520"},{"name":"Albert Sidney Fleischman","id":"nm0281520"}],"runtime":"93 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MDc3MDAzN15BMl5BanBnXkFtZTcwMjAzMzU1MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Western"],"plot":"The Civil War Yankee sergeant Yellowleg saves the cheater Turkey from hanging after a card game, and together with Turk's gunslinger buddy Billy Keplinger, they ride together to Gila City with the intention of heisting a bank. Yellowleg has a scar on the head from a man that tried to scalp him and he has been on the trail of his attacker for five years. When other bandits rob a store, Yellowleg shoots at the outlaws and accidentally kills the son of the cabaret dancer Kit Tilden and the grieving woman decides to bury her son in the town of Siringo in Apache country where her husband is buried. Yellowleg Enlists Billy and Turkey to escort Kitty and the coffin through the dangerous land.","simplePlot":"Ex-army officer accidentally kills a woman's son, tries to make up for it by escorting the funeral procession through dangerous Indian territory.","actors":[{"actorName":"Maureen O'Hara","urlProfile":"http://www.imdb.com/name/nm0000058","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2OTA0ODA4MV5BMl5BanBnXkFtZTYwNjIwNzQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 August 1920","placeOfBirth":" Ranelagh, County Dublin, Ireland, UK [now Ranelagh, Dublin, Republic of Ireland]","birthName":"Maureen FitzSimons","height":"5' 7½\" (1.71 m)","bio":"In America, the early performing arts accomplishments of young Maureen FitzSimons (who we know as Maureen O'Hara) would definitely have put her in the child prodigy category. However, for a child of Irish heritage surrounded by gifted parents and family, these were very natural traits. Maureen made her entrance into this caring haven on August 17, 1920, in Ranelagh (a suburb of Dublin), Ireland. Her mother, Marguerita Lilburn FitzSimons, was an accomplished contralto. Her father, Charles FitzSimons, managed a business in Dublin and also owned part of the renowned Irish soccer team \"The Shamrock Rovers\". Maureen was the second of six FitzSimons children - Peggy, Florrie, Charles B. Fitzsimons, Margot Fitzsimons and James O'Hara completed this beautiful family. Maureen loved playing rough athletic games as a child and excelled in sports. She combined this interest with an equally natural gift for performing. This was demonstrated by her winning pretty much every Feis award for drama and theatrical performing her country offered. By age 14 she was accepted to the prestigious Abbey Theater and pursued her dream of classical theater and operatic singing. This course was to be altered, however, when Charles Laughton, after seeing a screen test of Maureen, became mesmerized by her hauntingly beautiful eyes. Before casting her to star in Jamaica Inn (1939), Laughton and his partner, Erich Pommer, changed her name from Maureen FitzSimons to \"Maureen O'Hara\" - a bit shorter last name for the marquee. Under contract to Laughton, Maureen's next picture was to be filmed in America (The Hunchback of Notre Dame (1939)) at RKO Pictures. The epic film was an extraordinary success and Maureen's contract was eventually bought from Laughton by RKO. At 19, Maureen had already starred in two major motion pictures with Laughton. Unlike most stars of her era, she started at the top, and remained there - with her skills and talents only getting better and better with the passing years. Maureen has an enviable string of all-time classics to her credit that include the aforementioned \"The Hunchback of Notre Dame\", How Green Was My Valley (1941), Miracle on 34th Street (1947), Sitting Pretty (1948), The Quiet Man (1952), The Parent Trap (1961) and McLintock! (1963). Add to this the distinction of being voted one of the five most beautiful women in the world and you have a film star who was as gorgeous as she was talented. Although at times early in her career Hollywood didn't seem to notice, there was much more to Maureen O'Hara than her dynamic beauty. She not only had a wonderful lyric soprano voice, but she could use her inherent athletic ability to perform physical feats that most actresses couldn't begin to attempt, from fencing to fisticuffs. She was a natural athlete. In her career Maureen starred with some of Hollywood's most dashing leading men, including Tyrone Power, John Payne, Rex Harrison, James Stewart, Henry Fonda, Brian Keith, Sir Alec Guinness and, of course, her famed pairings with \"The Duke\" himself, John Wayne. She starred in five films with Wayne, the most beloved being The Quiet Man (1952). In addition to famed director John Ford, Maureen was also fortunate to have worked for some other great directors in the business: Alfred Hitchcock, William Dieterle, Henry Hathaway, Henry King, Jean Renoir, John M. Stahl, William A. Wellman, Frank Borzage, Walter Lang, George Seaton, George Sherman, Carol Reed, Delmer Daves, David Swift, Andrew V. McLaglen and Chris Columbus. In 1968 Maureen found much deserved personal happiness when she married Charles Blair. Gen. Blair was a famous aviator whom she had known as a friend of her family for many years. A new career began for Maureen, that of a full-time wife. Her marriage to Blair, however, was again far from typical. Blair was the real-life version of what John Wayne had been on the screen. He had been a Brigadier General in the Air Force, a Senior Pilot with Pan American, and held many incredible record-breaking aeronautic achievements. Maureen happily retired from films in 1973 after making the TV movie The Red Pony (1973) (which won the prestigious Peabody Award for Excellence) with Henry Fonda. With Blair, Maureen managed Antilles Airboats, a commuter sea plane service in the Caribbean. She not only made trips around the world with her pilot husband, but owned and published a magazine, \"The Virgin Islander\", writing a monthly column called \"Maureen O'Hara Says\". Tragically, Charles Blair died in a plane crash in 1978. Though completely devastated, Maureen pulled herself together and, with memories of ten of the happiest years of her life, continued on. She was elected President and CEO of Antilles Airboats, which brought her the distinction of being the first woman president of a scheduled airline in the United States. Maureen now lives quite happily in retirement in a home near her grandson and his family in Boise, Idaho. Fortunately, she was coaxed out of retirement several times - once in 1991 to star with John Candy in Only the Lonely (1991) and again, in 1995, in a made-for-TV movie, The Christmas Box (1995) on CBS. In the spring of 1998, Maureen accepted the second of what would be three projects for Polson Productions and CBS: Cab to Canada (1998) - and, in October, 2000, The Last Dance (2000). On November 4, 2014 Maureen was honored by a long overdue Oscar for \"Lifetime Achievement\" at the annual Motion Picture Arts and Sciences Governors Awards. Maureen O'Hara is still absolutely stunning, with that trademark red hair, dazzling smile and those huge, expressive eyes. She has fans from all over the world of all ages who are utterly devoted to her legacy of films and her persona as a strong, courageous and intelligent woman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2OTA0ODA4MV5BMl5BanBnXkFtZTYwNjIwNzQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000058","name":"Maureen O'Hara","nicknames":["Big Red","The Pirate Queen","The Queen of Technicolor"],"idIMDB":"nm0000058"},"actorId":"nm0000058","character":"Kit Tildon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian Keith","urlProfile":"http://www.imdb.com/name/nm0001417","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA1MzAwOTM2NF5BMl5BanBnXkFtZTYwNTk1MjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 November 1921","placeOfBirth":" Bayonne, New Jersey, USA","birthName":"Robert Keith Richey Jr.","height":"6' 0½\" (1.84 m)","bio":"Son of character actor Robert Keith and stage actress Helena Shipman. He grew up on the road with his parents while they toured in plays. First appeared at age 3 in film Pied Piper Malone (1924) with his father. Began acting in radio programs and on stage before World War II. Joined the Marines and served as a machine gunner. Returned to Broadway stage after the war and branched out into television and film. Worked as an extra in several films before achieving speaking roles and subsequent stardom.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA1MzAwOTM2NF5BMl5BanBnXkFtZTYwNTk1MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001417","name":"Brian Keith","idIMDB":"nm0001417"},"actorId":"nm0001417","character":"Yellowleg","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steve Cochran","urlProfile":"http://www.imdb.com/name/nm0168215","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGZmZGEwNTItZGJhYy00OTgyLWJiMzYtYzk1OGI3NGZlMzFmXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1917","placeOfBirth":" Eureka, California, USA","birthName":"Robert Alexander Cochran","height":"6' (1.83 m)","bio":"Born Robert Alexander Cochran, son of a California lumberman, he worked mostly in the theatre before landing a contract with Samuel Goldwyn in 1945. His debut was Wonder Man (1945) with Virginia Mayo and Danny Kaye. From 1949 to 1952, he was signed to Warner Brothers, then started up his own production company. In 1965 he sailed off in his yacht to Guatemala to look for suitable filming locations, but died of a lung infection before reaching land.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGZmZGEwNTItZGJhYy00OTgyLWJiMzYtYzk1OGI3NGZlMzFmXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0168215","name":"Steve Cochran","idIMDB":"nm0168215"},"actorId":"nm0168215","character":"Billy Keplinger","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chill Wills","urlProfile":"http://www.imdb.com/name/nm0932629","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGFlYzEzOGMtMTUyNS00ZDA5LThhNTgtOGIzMTdlMzllNjRkL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1902","placeOfBirth":" Seagoville, Texas, USA","birthName":"Theodore Childress Wills","height":"6' 2\" (1.88 m)","bio":"Colorful character actor of American Westerns. Named \"Chill\" as an ironic comment on his birth date being the hottest day of 1903. A musician from his youth, he performed from the age of 12 with tent shows, in vaudeville, and with stock companies. While performing in vaudeville in Kansas City, he married ballet dancer Betty Chappelle, with whom he had two children. He formed a musical group, Chill Wills and His Avalon Boys. During an appearance at the Trocadero in Hollywood, they were spotted by an RKO executive, subsequently appearing as a group in several low-budget Westerns. After a prominent appearance with The Avalon Boys as both himself and the bass-singing voice of Stan Laurel in Way Out West (1937), Wills disbanded the group and began a solo career as a usually jovial (but occasionally sinister) character actor, primarily in Westerns. His delightful portrayal of Beekeeper in The Alamo (1960) won him an Academy Award nomination for Best Supporting Actor, but his blatant and embarrassing campaign for the Oscar cost him the award and subjected him to a great deal of humiliation -- and probably cost the film a number of awards as well. His wife died in 1971, and he remarried, to Novadeen Googe, in 1973. He continued to work in films and television, usually in roguishly lovable good-ol'-boy parts, up until his death in 1978.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGFlYzEzOGMtMTUyNS00ZDA5LThhNTgtOGIzMTdlMzllNjRkL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0932629","name":"Chill Wills","idIMDB":"nm0932629"},"actorId":"nm0932629","character":"Turk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Strother Martin","urlProfile":"http://www.imdb.com/name/nm0001510","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NDU1MjMyMF5BMl5BanBnXkFtZTcwMDg0MjYwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1919","placeOfBirth":" Kokomo, Indiana, USA","birthName":"Strother Douglas Martin Jr.","height":"5' 7\" (1.7 m)","bio":"American character actor who achieved considerable fame in the last decade of his life. A native of Kokomo, Indiana, Strother Martin Jr. was the youngest of three children of Strother Douglas Martin, a machinist, and Ethel Dunlap Martin. His family moved soon after his birth to San Antonio, Texas, but quickly returned to Indiana. Strother Jr. grew up in Indianapolis and in Cloverdale, Indiana. He excelled at swimming and diving, and at 17 won the National Junior Springboard Diving Championship. He attended the University of Michigan as diving team member. He served in the U.S. Navy as a swimming instructor in World War II. Nicknamed \"T-Bone\" Martin for his diving style, his 3rd place finish in the adult National Springboard Diving Championships cost him a place on the 1948 Olympic team. He moved to California to become an actor, but worked in odd jobs and as a swimming instructor to Marion Davies and the children of Charles Chaplin. He found work as a swimming extra in several films and as a leprechaun on a local children's TV show, \"Mabel's Fables.\" Bit parts came his way, leading to television work with Sam Peckinpah, which led to a lifelong relationship. He also found memorable roles for John Ford and by the 1960s was a familiar face in American movies. With Cool Hand Luke (1967) in 1967 came new acclaim and a place among the busiest character actors in Hollywood. He worked steadily and in substantial roles throughout the 1970s and seemed at the peak of his career when he died suddenly of a heart attack in 1980.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NDU1MjMyMF5BMl5BanBnXkFtZTcwMDg0MjYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001510","name":"Strother Martin","idIMDB":"nm0001510"},"actorId":"nm0001510","character":"Parson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Will Wright","urlProfile":"http://www.imdb.com/name/nm0942926","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NDM4MTg2M15BMl5BanBnXkFtZTYwMzI4Njgy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1894","placeOfBirth":" San Francisco, California, USA","birthName":"William Henry Wright","bio":"One of those familiar character actors who seems to have been born old, Will Wright specialized in playing crusty old codgers, rich skinflints, crooked small-town politicians and the like. A former newspaper reporter in San Francisco, he switched careers and entered vaudeville, then took to the stage. He ventured from acting to producing, and staged shows on Broadway as well as other cities, eventually making his way to Hollywood. He appeared in over 100 films and did much TV work, including a recurring role on The Andy Griffith Show (1960). Although his hunched-over figure, craggy face and somewhat sour disposition made it seem like he started out his 20+-year career as an old man, he was actually only 68 when he died of cancer in Hollywood in 1962.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NDM4MTg2M15BMl5BanBnXkFtZTYwMzI4Njgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0942926","name":"Will Wright","idIMDB":"nm0942926"},"actorId":"nm0942926","character":"Doctor Acton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James O'Hara","urlProfile":"http://www.imdb.com/name/nm0510181","urlPhoto":"","biography":{"dateOfBirth":"11 September 1927","placeOfBirth":" Dublin, Ireland","birthName":"James FitzSimons","bio":"James O'Hara was born on September 11, 1927 in Dublin, Ireland as James FitzSimons. He was an actor, known for The Quiet Man (1952), Suddenly! (1954) and The Driller Killer (1979). He died on December 3, 1992 in Glendale, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0510181","name":"James O'Hara","idIMDB":"nm0510181"},"actorId":"nm0510181","character":"Cal, General Store","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter O'Crotty","urlProfile":"http://www.imdb.com/name/nm0640573","urlPhoto":"","biography":{"dateOfBirth":"14 April 1907","placeOfBirth":" Manitoba, Canada","birthName":"Peter Crotty","bio":"Peter O'Crotty was born on April 14, 1907 in Manitoba, Canada as Peter Crotty. He was an actor and writer, known for The Deadly Companions (1961), Night of the Lepus (1972) and Vendetta (1950). He died on January 8, 1987 in Tucson, Arizona, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0640573","name":"Peter O'Crotty","idIMDB":"nm0640573"},"actorId":"nm0640573","character":"Mayor of Hila City","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Billy Vaughan","urlProfile":"http://www.imdb.com/name/nm0891145","urlPhoto":"","biography":{"dateOfBirth":"3 March 1947","placeOfBirth":" Tucumcari, New Mexico, USA","birthName":"Billy Scott Vaughan","bio":"Billy Vaughan was born on March 3, 1947 in Tucumcari, New Mexico, USA as Billy Scott Vaughan. He is an actor, known for The Deadly Companions (1961) and The Pat Boone-Chevy Showroom (1957). He has been married to Susan Vaughan since May 23, 1987.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0891145","name":"Billy Vaughan","nicknames":["Bill"],"idIMDB":"nm0891145"},"actorId":"nm0891145","character":"Mead Tildon Jr.","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0054795","urlIMDB":"http://www.imdb.com/title/tt0054795","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"© Copyright MCMLXI Carousel Productions,Inc. (on print)"},"technical":{"runtime":["1 hr 33 min (93 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Color (Pathé-Color)"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision (anamorphic) (filmed in)"],"printedFilmFormat":["35 mm"]},"rating":"6.1","filmingLocations":[{"location":"Sonoran Desert, Arizona, USA"}],"rated":"APPROVED","awards":[],"votes":"1,521","type":"Movie","companyCreditsSimple":[{"idCompany":"co0541408","name":"Pathé America"},{"idCompany":"co0392951","name":"Carousel Productions (III)"}],"keywords":{"keywords":["revenge","escort","coffin","scar","blond boy","street shootout","ghost town","mission","apache tribe","bow and arrow","indian attack","skinny dipping","horse and wagon","native american","double barreled shotgun","held at gunpoint","child shot","runaway horse","mother son relationship","bank robber","capture","burial","posse","graveyard","widow","journey","cave","pursuit","travois","ruins","campfire","stagecoach","rattlesnake","encampment","drunkenness","corpse","scream","grief","showgirl","anger","gambling","spurs","little boy","gunfight","tears","saloon girl","mayor","face slap","church service","doctor","bartender","prayer","singing","parson","fistfight","harmonica","cactus","six gun","card cheat","playing cards","bar","frontier town","saloon","noose","desert","boy","single mother","shootout","dead child","death of child","based on novel","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:15:16"}}