{"data":{"movies":[{"title":"Dream a Little Dream","originalTitle":"","year":"1989","releaseDate":"19890303","directors":[{"name":"Marc Rocco","id":"nm0733692"}],"writers":[{"name":"Daniel Jay Franklin","id":"nm0291398"},{"name":"Daniel Jay Franklin","id":"nm0291398"}],"runtime":"114 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1OTk0MTY5OF5BMl5BanBnXkFtZTcwMjU4MzQyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama","Romance"],"plot":"The lives of a crusty old scientist and a bratty, teen Michael-Jackson-wannabe are about to intersect in a paranormal way. Coleman Ettinger seeks to break down the door of reality through studied dreaming; Bobby Keller wants Lainie Diamond, the girlfriend of his high school friend Joel, a handsome school jock. As Coleman persuades his wife Gena to join his experiments, an accident knocks their bodies out of existence, along with Bobby's consciousness. Coleman's consciousness winds up in Bobby's body while Gena's ends up buried and asleep inside Lainie's. Only when sleeping can Coleman contact Bobby and elicit his help in putting things back, except that Bobby smugly prefers limbo over his aggravated life as a modern teenager.","simplePlot":"An accident puts the consciousness of an elderly dream researcher into the body of a bratty teenager. The problem? The kid prefers dreamworld limbo to real life.","actors":[{"actorName":"Jason Robards","urlProfile":"http://www.imdb.com/name/nm0001673","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NDI3NDM4Nl5BMl5BanBnXkFtZTYwMjEwNjM2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1922","placeOfBirth":" Chicago, Illinois, USA","birthName":"Jason Nelson Robards Jr.","height":"5' 8½\" (1.74 m)","bio":"Powerful and highly respected American actor Jason Nelson Robards, Jr. was born in Chicago, Illinois, to Hope Maxine (Glanville) and stage and film star Jason Robards Sr. He had Swedish, English, Welsh, German, and Irish ancestry. Robards was raised mostly in Los Angeles. A star athlete at Hollywood High School, he served in the U.S. Navy in World War II, where he saw combat as a radioman (though he is not listed in official rolls of Navy Cross winners, despite the claims some -- not he -- have made. Neither was he at Pearl Harbor during the Dec. 7, 1941 attack, his ship being at sea at the time.) Returning to civilian life, he attended the American Academy of Dramatic Arts and struggled as a small-part actor in local New York theatre, TV and radio before shooting to fame on the New York stage in Eugene O'Neill's \"The Iceman Cometh\" as Hickey. He followed that with another masterful O'Neill portrayal, as the alcoholic Jamie Tyrone in \"Long Day's Journey Into Night\" on Broadway. He entered feature films in The Journey (1959) and rose rapidly to even greater fame as a film star. Robards won consecutive Academy Awards for Best Supporting Actor for All the President's Men (1976) and Julia (1977), in each case playing real-life people. He continued to work on the stage, winning continued acclaim in such O'Neill works as \"Moon For the Misbegotten\" and \"Hughie.\" Robards died of lung cancer in 2000.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NDI3NDM4Nl5BMl5BanBnXkFtZTYwMjEwNjM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001673","name":"Jason Robards","idIMDB":"nm0001673"},"actorId":"nm0001673","character":"Coleman Ettinger","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Corey Feldman","urlProfile":"http://www.imdb.com/name/nm0000397","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDg0OTE0MV5BMl5BanBnXkFtZTcwNDY4OTg3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1971","placeOfBirth":" Chatsworth, California, USA","birthName":"Corey Scott Feldman","height":"5' 5\" (1.65 m)","bio":"Corey Scott Feldman began his career at the age of three, starring in a Clio Award-winning McDonald's commercial and has sustained a 35-year career as a steadily working actor, with more than 80 films under his belt. Corey began his career in guest-starring roles on television series such as Mork & Mindy (1978), Alice (1976) and Eight Is Enough (1977), before landing a regular part on the sitcom, The Bad News Bears (1979). In the same year, Feldman made his big screen debut in Time After Time (1979). Over the next few years, Feldman continued making guest appearances in many television shows and, in 1981, Feldman supplied the voice of \"Young Copper\", in Disney's The Fox and the Hound (1981). Friday the 13th: The Final Chapter (1984) launched Feldman's career in the horror genre with the role of the main character, \"Tommy Jarvis\", as a child. He reprised that role in Friday the 13th: A New Beginning (1985). Feldman then began a series of appearances in blockbuster films such as Gremlins (1984), The Goonies (1985) and Stand by Me (1986). In 1987, Feldman won the Jackie Coogan Award for Stand by Me (1986), and appeared in the legendary cult classic film, The Lost Boys (1987), alongside Jason Patric and Kiefer Sutherland. In 1988, he won the Young Artist Award for Best Young Actor in a Horror Motion Picture for his performance in The Lost Boys (1987). In 1989, Feldman appeared in The 'Burbs (1989), along with Tom Hanks and Carrie Fisher, and also provided the voice of \"Donatello\" for Teenage Mutant Ninja Turtles (1990), which holds the biggest box office for an independent feature in history and also marked his thirteenth number-one box office hit in a row. Feldman then took time off to focus on his personal life and returned to the film world with appearances is Loaded Weapon 1 (1993), Maverick (1994) and Teenage Mutant Ninja Turtles III (1993). He was a regular on the CBS series, Dweebs (1995), followed by a starring role in the Richard Donner, Robert Zemeckis, Joel Silver-produced Bordello of Blood (1996) for Universal. In 1996, Feldman directed his first film, Busted (1997). In 2002, Feldman appeared in the comedy, Dickie Roberts: Former Child Star (2003), for which he wrote and performed a song for the soundtrack, shortly followed by an opportunity to work with Wes Craven on Cursed (2005). In 2004, Feldman was honored with a Former Child Star Lifetime Achievement Award. 2006 found him receiving the best actor award at the Luxemburg Film Festival for his performance in The Birthday (2004), a film that he feels to be his finest work to date. The Eyegore Awards honored Feldman with an award for Legendary Work in Horror Films in 2007. The hit show, The Two Coreys (2007), not only starred Feldman, but he also executive produced two seasons, as well as Lost Boys: The Tribe (2008). He starred in Terror Inside (2008) in 2008, for which he won the Crystal Reel Best Actor Award, and Feldman is executive producing and starring in Lost Boys: The Thirst (2010), which begins shooting in late 2009. Other current work, releasing in 2009, includes: Operation Belvis Bash (2013) and Lucky Fritz (2009). Now a husband, father and environmentalist, Feldman is focused on his career as an adult. Nurturing a growing music career with four albums and five sound tracks, he has toured North America twice with his band, \"The Truth Movement\". Off-screen, Feldman is a spokesperson for PETA (People for the Ethical Treatment of Animals), the world's largest animal rights organization, and the Amie Karen Cancer Fund, as well as a supporter of environmental charity, Global Green. In 2009, he was presented with The Paws of Fame Award from Wildlife Waystation for his exemplary work in support of animal rights.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDg0OTE0MV5BMl5BanBnXkFtZTcwNDY4OTg3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000397","name":"Corey Feldman","nicknames":["Core","Feldog"],"idIMDB":"nm0000397"},"actorId":"nm0000397","character":"Bobby Keller / Coleman Ettinger","urlCharacter":"http://www.imdb.com/character/ch0046096","main":true},{"actorName":"Piper Laurie","urlProfile":"http://www.imdb.com/name/nm0001453","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTEwMzg5MDU2N15BMl5BanBnXkFtZTcwMDY5NDQ5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 January 1932","placeOfBirth":" Detroit, Michigan, USA","birthName":"Rosetta Jacobs","height":"5' 4½\" (1.64 m)","bio":"Piper Laurie was born Rosetta Jacobs in Detroit, Michigan, on January 22, 1932, to Charlotte Sadie (Alperin) and Alfred Jacobs, a furniture dealer. Her father was a Polish Jewish immigrant and her mother was of Russian Jewish descent. Her father moved the family to Los Angeles, California, when she was 6-years-old. Rosetta was a pretty red-haired little girl, but very shy, so her parents sent her to weekly elocution lessons. In addition to her lessons in Hebrew school, she studied acting at a local acting school, and this eventually led to work at Universal Studios. Universal had signed her as a contract player when she was only 17-years-old, and changed her screen name to Piper Laurie. She was cast in the movie, Louisa (1950), and became very close friends with her costar, Ronald Reagan. She was then cast in Francis Goes to the Races (1951) with Donald O'Connor, Son of Ali Baba (1952) with Tony Curtis, and Ain't Misbehavin' (1955) with Rory Calhoun. The studio tried to enhance her image as an ingénue with press releases stating that she took milk baths and ate gardenia petals for lunch. Although she was making $2,000 per week, her lack of any substantial roles discouraged her so much that by 1955 when she received another script for a Western and \"another silly part in a silly movie\", she dropped the script in the fireplace, called her agent and told him she didn't care if they fired her, jailed her or sued her. From there, she went to New York City to study acting, and worked on live television, starring in The Hallmark Hall of Fame version of \"Twelfth Night\" (1957), \"The Days of Wine and Roses\" (1958) with Cliff Robertson, which debuted on Playhouse 90 on October 2, and as \"Kirsten\" in the Playhouse 90 version of \"Winterset\" (1959). In 1961, she got the part of Paul Newman's crippled girlfriend in the classic film, The Hustler (1961). She was nominated for an Academy Award for Best Actress for that role of \"Sarah Packard\". That same year, she was interviewed by a writer/reporter for the New York Herald Tribune, Joe Morgenstern. She liked his casual dress and lifestyle and, 9 months later, they were married. When she did not receive any substantial acting offers after The Hustler (1961), she retreated with her husband to Woodstock, New York, where she pursued domestic activities such as baking (her grandfather's trade) and raising her only daughter, Anne, born in 1971. In 1976, she accepted the role of \"Margaret White\", the eccentric religious zealot mother of a shy young psychic girl named Carrie (1976), played by Sissy Spacek. Piper received her second supporting Oscar nomination for this role. She and her husband divorced in 1981, she moved to Southern California and obtained many film and television roles. She got a third Oscar nomination for her role as \"Mrs. Norman\" in Children of a Lesser God (1986), and won an Emmy that same year for her acting in Promise (1986), a television movie with James Garner and James Woods. She has appeared in more than 60 films, from 1950 to the present. Ms. Laurie has appeared in many outstanding television shows from \"The Best of Broadway\" in 1954, to roles on \"Playhouse 90\" in 1956, roles on St. Elsewhere (1982), Murder, She Wrote (1984), Matlock (1986), Beauty and the Beast (1987), ER (1994), Diagnosis Murder (1993) and Frasier (1993). Her daughter, Anne Grace, has made her a grandmother, and though she lives in Southern California, she frequently visits her daughter in New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTEwMzg5MDU2N15BMl5BanBnXkFtZTcwMDY5NDQ5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001453","name":"Piper Laurie","nicknames":["Rosie"],"idIMDB":"nm0001453"},"actorId":"nm0001453","character":"Gena Ettinger","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Meredith Salenger","urlProfile":"http://www.imdb.com/name/nm0001694","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyMDkyNTk0OF5BMl5BanBnXkFtZTYwODgzNTgy._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1970","placeOfBirth":" Malibu, California, USA","birthName":"Meredith Dawn Salenger","height":"5' 3\" (1.6 m)","bio":"Meredith Salenger was born and raised in Malibu, California, the daughter of Dottie, an interior designer, and Gary Salenger, a dentist. As a child, she enjoyed performing in front of her family and friends. When she was eight years old, her mother took her to an acting class and Meredith found her calling. Her first role was a small part as a \"singing and dancing orphan\" in the feature film Annie (1982), directed by John Huston. Then came Meredith's first starring role in the Disney film, The Journey of Natty Gann (1985), which was the first American movie to win the gold award at the Moscow Film Festival. This film also garnered Meredith \"Best Actress in a Drama\" at the Youth in Film Awards for her wonderful portrayal of the tomboyish Natty Gann. After starring in four more films by the time she was eighteen years old, Meredith left Hollywood for Harvard to further her education. From 1988 until 1992, Salenger attended the university and graduated cum laude with a degree in Psychology which proved she was not only beautiful and talented, but extremely intelligent. Upon her return to Hollywood, Meredith resumed her acting career. Her recent credits include: Lake Placid (1999), The Third Wheel (2002), and an independent film called My Best Friend's Wife (2001). Salenger has appeared in several other independent films including My Apocalypse (2008) and Sparkle and Charm (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyMDkyNTk0OF5BMl5BanBnXkFtZTYwODgzNTgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001694","name":"Meredith Salenger","idIMDB":"nm0001694"},"actorId":"nm0001694","character":"Lainie Diamond","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harry Dean Stanton","urlProfile":"http://www.imdb.com/name/nm0001765","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDYyMTQ2Ml5BMl5BanBnXkFtZTYwMjU2NjE0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 July 1926","placeOfBirth":" West Irvine, Kentucky, USA","height":"5' 8\" (1.73 m)","bio":"Prolific character actor Harry Dean Stanton's drooping, weather-beaten appearance and superb acting talent have been his ticket to appearing in over 100 films, and 50 TV episodes. Stanton was born in West Irvine, Kentucky, to Ersel (Moberly), a cook, and Sheridan Harry Stanton, a barber and tobacco farmer. Stanton served as a cook in the U.S. Navy during World War II, and was on board an LST during the Battle of Okinawa. He then returned to the University of Kentucky to appear in a production of \"Pygmalion\", before heading out to California and honing his craft at the prestigious Pasadena Playhouse. Stanton then toured around the United States with a male choir, worked in children's theater, and then headed back to California. His first role on screen was in the tepid movie Tomahawk Trail (1957), but he was quickly noticed and appeared regularly in minor roles as cowboys and soldiers through the late 1950s and early 1960s. His star continued to rise and he received better roles in which he could showcase his laid-back style, such as in Cool Hand Luke (1967), Kelly's Heroes (1970), Dillinger (1973), The Godfather: Part II (1974), and in Alien (1979). It was around this time that Stanton came to the attention of director Wim Wenders, who cast him in his finest role yet as Travis in the moving Paris, Texas (1984). Next indie director Alex Cox gave Stanton a role that really brought him to the forefront, in the quirky cult film Repo Man (1984). Stanton was now heavily in demand, and his unique look got him cast as everything from a suburban father in the mainstream Pretty in Pink (1986) to a soft-hearted, but ill-fated, private investigator in Wild at Heart (1990) and a crazy yet cunning scientist in Escape from New York (1981). Apart from his film performances, Stanton is also an accomplished musician, and \"The Harry Dean Stanton Band\" and their unique spin on mariachi music have been playing together for well over a decade. They have toured internationally to rave reviews. Stanton became a cult figure of cinema and music and when Debbie Harry sang the lyric \"I want to dance with Harry Dean...\" in her 1990s hit \"I Want That Man\", she was talking about him. As he moved into the time in his life when most other people would be calling it a day, Harry Dean Stanton has remained consistently active on screen, most recently appearing in films including Fear and Loathing in Las Vegas (1998), The Green Mile (1999) and The Man Who Cried (2000). A true gem amongst character actors, and with an on screen presence capable of adding that something extra to any production.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDYyMTQ2Ml5BMl5BanBnXkFtZTYwMjU2NjE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001765","name":"Harry Dean Stanton","idIMDB":"nm0001765"},"actorId":"nm0001765","character":"Ike Baker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Corey Haim","urlProfile":"http://www.imdb.com/name/nm0000433","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NTM1MTExOF5BMl5BanBnXkFtZTcwMTYwODMyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 December 1971","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Corey Ian Haim","height":"5' 7\" (1.7 m)","bio":"Corey Haim was born in Toronto, Ontario, to Judy Haim, an Israeli-born data processor, and Bernie Haim, a Canadian-born clothing sales representative. He has a sister, Carol, and a half-brother, Daniel. His family is Jewish. Haim broke into the film industry in 1984, playing a young child caught up in a family war in the movie Firstborn (1984). The following year, he starred in the TV movie A Time to Live (1985), for which he received a Young Artist Award, and Silver Bullet (1985). Lucas (1986), in which he starred alongside Charlie Sheen, showed his acting abilities, but was not a big hit. In 1987, he had a breakthrough when he played one of the major roles in Joel Schumacher's The Lost Boys (1987). He later starred in the films License to Drive (1988) and Dream a Little Dream (1989), but his output during the nineties onwards was disappointing. He died suddenly on March 10, 2010.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NTM1MTExOF5BMl5BanBnXkFtZTcwMTYwODMyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000433","name":"Corey Haim","nicknames":["Space Ace","The Haimster"],"idIMDB":"nm0000433"},"actorId":"nm0000433","character":"Dinger","urlCharacter":"http://www.imdb.com/character/ch0046097","main":true},{"actorName":"Susan Blakely","urlProfile":"http://www.imdb.com/name/nm0086806","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzNTIzMjQzM15BMl5BanBnXkFtZTgwNDk3MTQyMDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1948","placeOfBirth":" Frankfurt am Main, Hesse, Germany","bio":"She stands out easily in a crowd with her wholesome beauty, knock-out figure and dazzling smile. Ever-radiant TV and film resident Susan Blakely found success on several paths she chose for herself over the years -- first as a model, then as an award-winning actress on TV and, finally, as a jewelry designer. The trim and trendy blonde also enhanced a mild stream of popular films during the 1970s and 1980s. Born in Frankfurt, Germany, she is the daughter of U.S. Army Colonel Lawrence Blakely. While growing up, she traveled extensively throughout the world with her family including Korea, Hawaii and, finally, Texas. Following a year of study at the University of Texas, Susan moved to New York and managed to secure a place for herself as a high-priced magazine and TV ad model. At the same time, she was encouraged to try her hand at acting and studied at the Neighborhood Playhouse. Married in 1969 to lawyer and screenwriting hopeful Todd Merer, she chanced a move to Hollywood to seek her fame and fortune. Billed initially as Susie Blakely, she was cast in small, capricious, deb-like turns in such films as Savages (1972) (her debut) and The Way We Were (1973). Her first popular movie role came about surrounded by a high-and-mighty all-star cast in Irwin Allen's epic disaster The Towering Inferno (1974), as the spoiled princess-like daughter of unscrupulous skyscraper builder William Holden and wife of callous, pretty-boy opportunist Richard Chamberlain. Lightweight as the role was, Susan willingly accepted the challenge of proving herself in Hollywood as more than just another starlet with a gorgeous face. She did...and more...by earning a Golden Globe and Emmy nomination for her exceptional work as \"Julie Prescott\" in the acclaimed TV mini-series epic Rich Man, Poor Man (1976) with Peter Strauss and Nick Nolte vying for her attention. It was star-making turns for all three leads. This monumental acting opportunity kicked off a highly rewarding career in TV mini-movies, playing an array of flawed but fascinating and newsworthy ladies, including Hitler mistress Eva Braun opposite Anthony Hopkins in Le bunker (1981); tormented actress Frances Farmer in Will There Really Be a Morning? (1983); political wife Joan Bennett Kennedy in The Ted Kennedy Jr. Story (1986); and crime attorney Leslie Abramson in Honor Thy Father and Mother: The True Story of the Menendez Murders (1994). Challenging roles continued to pour in that belied her pretty-girl image -- ranging from drug addicts to a housewife who changes into a werewolf! Less in the acting limelight these days, Susan nevertheless accomplished an award-winning turn in the low-profile film Hungry Hearts (2002), then starred on stage in the 2006 world premiere of \"Diva!\" at the La Jolla Playhouse. In recent years, she has broadened her horizons once again as a semi-precious jewelry designer...and once again she has met with great success. Divorced from her first husband in the 1970s, Susan remarried in 1982. Her present husband, media consultant, litigation and political adviser Steve Jaffe, has also reaped rewards as a film and television producer. Many of his projects have included Susan -- the afore-mentioned Frances Farmer TV biography, the TV-movie A Cry for Love (1980), and the film Russian Holiday (1992) [aka Russian Roulette]. They reside in the Beverly Hills area.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzNTIzMjQzM15BMl5BanBnXkFtZTgwNDk3MTQyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0086806","name":"Susan Blakely","idIMDB":"nm0086806"},"actorId":"nm0086806","character":"Cherry Diamond","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William McNamara","urlProfile":"http://www.imdb.com/name/nm0001530","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODEwMDg5MDk0MV5BMl5BanBnXkFtZTgwMzM4NTY3NjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 March 1965","placeOfBirth":" Dallas, Texas, USA","birthName":"William West McNamara","height":"5' 10\" (1.78 m)","bio":"William McNamara studied at the Lee Strasberg Theatre and Film Institute and has since notched up over sixty-five film and TV appearances. One of his first roles was that of Joel in the teen movie Dream a Little Dream (1989) with Corey Feldman and Corey Haim. He followed this up with the Bette Midler film Stella (1990). It was during the nineties, however, that William - arguably - turned out some of his best performances. He gave a great performance as Derek Wolfe Jr in the Ernest R. Dickerson manhunt thriller Surviving the Game (1994), in which he worked with a cast of talented veteran actors including F. Murray Abraham, Gary Busey, Rutger Hauer, and John C. McGinley. That same year he was again teamed with Gary Busey - and Tom Berenger - in the Navy comedy Chasers (1994), directed by Dennis Hopper. His most prized - and chilling - role, though, is that of Peter Foley the copycat serial killer in the psychological thriller Copycat (1995). The film also starred Sigourney Weaver, Dermot Mulroney, and jazz musician Harry Connick Jr.. He appeared with Andrew McCarthy and John Stockwell in Stag (1997), and made his way towards the millennium opposite Gabriel Byrne in the World War II drama The Brylcreem Boys (1998). William's first feature film role was in acclaimed cult horror director Dario Argento's slasher classic, Opera (1987). But don't fear: the actor is actually a kind spiritualist and an avid animal rights activist, putting much time, energy, and money into the plight of the dolphins and small whales off the shores of Japan. In addition William involves himself in animal rescue in general, Kundalini, and Yoga! Like Henry Rollins, his co-star in Time Lapse (2001), William McNamara gets his own hands dirty while 'actively' pursuing causes that are close to his heart.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODEwMDg5MDk0MV5BMl5BanBnXkFtZTgwMzM4NTY3NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001530","name":"William McNamara","nicknames":["Billy"],"idIMDB":"nm0001530"},"actorId":"nm0001530","character":"Joel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matt Adler","urlProfile":"http://www.imdb.com/name/nm0012208","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwODY4OTExNV5BMl5BanBnXkFtZTcwMzMyMDk5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 December 1966","placeOfBirth":" Los Angeles, California, USA","height":"5' 7½\" (1.71 m)","bio":"Matt Adler was born on December 8, 1966 in Los Angeles, California, USA. He is known for his work on Flight of the Navigator (1986), Chronicle (2012) and Ice Age: Dawn of the Dinosaurs (2009). He has been married to Laura San Giacomo since 2000. He was previously married to Ria Pavia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwODY4OTExNV5BMl5BanBnXkFtZTcwMzMyMDk5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0012208","name":"Matt Adler","idIMDB":"nm0012208"},"actorId":"nm0012208","character":"Dumas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victoria Jackson","urlProfile":"http://www.imdb.com/name/nm0414130","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzJkNjNiMzUtZGZiYS00OWRiLWEyYmYtZDM5MDkzNTg2YmI4XkEyXkFqcGdeQXVyMTQxNTEyNDc@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 August 1959","placeOfBirth":" Miami, Florida, USA","height":"5' 4½\" (1.64 m)","bio":"Victoria was raised in a Bible-believing, piano-playing, gymnastic home with no TV. Her dad was a gym coach so she competed in gymnastics from age 5 to l8. Was a cheerleader and a homecoming queen. Attended Florida Bible College; received gymnastic scholarship to Furman University, attended Auburn University one year and ended up in Hollywood, California via summer-stock in Alabama, where she met Johnny Crawford (of The Rifleman (1958) fame). Crawford put her in his night club act, and later sent her a one-way ticket to the show-biz capital. Supporting herself as a cigarette girl and as a typist at the American Cancer Society, and waitress at a retirement hotel, she performed stand-up comedy for 2 years until The Tonight Show Starring Johnny Carson (1962) put her act (which consisted of her doing a handstand while reciting poetry) on national TV. Following her 22 appearances with Johnny, she starred in many movies and TV shows, most notably, Saturday Night Live (1975). In 1991, she re-united with her high school sweetheart, married him, and moved to Florida, where he's a police helicopter pilot. As a mother of two, homemaking is her priority now, but she's always available to perform... if the price is right! She just recorded a children's album, called \"Ukelele Lady\", by Choo Choo Records, available in record stores now. She's compiling an album of her original songs, i.e. \"I Am Not A Bimbo\", and \"Where Do You Draw the Line Between Love and Adultery?\", to sell on the Internet. Recently, she has guest-starred on sitcoms such as The Naked Truth (1992) and also on The 700 Club (1966).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzJkNjNiMzUtZGZiYS00OWRiLWEyYmYtZDM5MDkzNTg2YmI4XkEyXkFqcGdeQXVyMTQxNTEyNDc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0414130","name":"Victoria Jackson","idIMDB":"nm0414130"},"actorId":"nm0414130","character":"Kit Keller","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alex Rocco","urlProfile":"http://www.imdb.com/name/nm0733678","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MTMyNTkxOF5BMl5BanBnXkFtZTcwMDA4NTAzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 February 1936","placeOfBirth":" Cambridge, Massachusetts, USA","birthName":"Alessandro Federico Petricone Jr.","height":"6' (1.83 m)","bio":"Tough and volatile-looking Italianate character actor Alex Rocco was born in Boston and spent time training with such notable teachers as Leonard Nimoy and Jeff Corey to curb his thick Boston accent. In Hollywood from 1963, he worked as a bartender during the lean years and began his TV career in the late 60s. Slowly, he came to show sly, lethal menace in \"big city\" films and, in the next decade, notably played Las Vegas syndicate boss Moe Green who gets a bullet in the eye during the violent \"christening sequence\" of Mario Puzo's Oscar-winning The Godfather (1972). Finding a comfortable niche playing various swarthy-looking cronies, hoods and cops, he made a distinct impression when he switched to TV comedy and, in the late 80s, won an Emmy for The Famous Teddy Z (1989) during the 1989-1990 season. Other comedy series such as Sibs (1991) and The George Carlin Show (1994) came and went with over 400 TV appearances racked up so far. Recurring roles on The Simpsons (1989) and The Facts of Life (1979) (as Nancy McKeon's father) has kept him alive, as well. Rocco has appeared in two films helmed by his son, screenwriter and director Marc Rocco: Scenes from the Goldmine (1987) and Dream a Little Dream (1989). Other memorably flashy film roles include The Friends of Eddie Coyle (1973), Freebie and the Bean (1974), The Stunt Man (1980), Lady in White (1988), Get Shorty (1995) and Just Write (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MTMyNTkxOF5BMl5BanBnXkFtZTcwMDA4NTAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0733678","name":"Alex Rocco","nicknames":["Bobo"],"idIMDB":"nm0733678"},"actorId":"nm0733678","character":"Gus Keller","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ria Pavia","urlProfile":"http://www.imdb.com/name/nm0667632","urlPhoto":"","biography":{"dateOfBirth":"8 October 1967","placeOfBirth":" Ohio, USA","bio":"Ria was born in Ohio, but doesn't remember much of the State because six months later, her family moved back to Rochester, NY. She grew up in the city that produces Kodak film and lots of snow. Next, she and her two brothers and parents relocated to South Carolina. She wasn't crazy about the pace of the South, so she opted for boarding school, attending Interlochen Arts Academy, a performing arts school in Michigan. After graduating, she moved to Los Angeles to attend UCLA as a Theater Arts Major. Soon after enrolling, she was accepted into the prestigious Screen Actors Guild not after performing Shakespeare, but by doing gymnastics in a tampon commercial. This big career break motivated her to pursue acting full time. Before long, she landed numerous roles in television shows and film. A couple of the films Ria has appeared in have won awards, including Baby Steps (winner - '99 OutFest Los Angeles, best short narrative)and Mr. October (winner - student academy award). She has also appeared in dozens of commercials, as well as performing onstage at several venues in Los Angeles and at the Aspen Comedy Festival.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0667632","name":"Ria Pavia","idIMDB":"nm0667632"},"actorId":"nm0667632","character":"Maureen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lala Sloatman","urlProfile":"http://www.imdb.com/name/nm0806080","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkzNDEzNzU0OF5BMl5BanBnXkFtZTcwMzQ1MDkwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 October 1970","placeOfBirth":" Winter Park, Florida, USA","birthName":"Lala Cassandra Sloatman","bio":"Lala Sloatman was born Lala Cassandra Sloatman in Winterpark, Florida on October 12, 1970. The name Lala is Hawiian for Laura and Lala is named after her grandmother, Laura who was born in Hawaii, and still lives there. She has one younger brother, John Sloatman IV, who is 12 years her junior.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkzNDEzNzU0OF5BMl5BanBnXkFtZTcwMzQ1MDkwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0806080","name":"Lala Sloatman","idIMDB":"nm0806080"},"actorId":"nm0806080","character":"Shelley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Laura Lee Norton","urlProfile":"http://www.imdb.com/name/nm0636248","urlPhoto":"","biography":{"bio":"Laura Lee Norton is an actress, known for Wild Hearts Can't Be Broken (1991) and Dream a Little Dream (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0636248","name":"Laura Lee Norton","idIMDB":"nm0636248"},"actorId":"nm0636248","character":"Marge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Ward","urlProfile":"http://www.imdb.com/name/nm0911631","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NzMyMzUzOV5BMl5BanBnXkFtZTcwOTU1MTEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 May 1970","placeOfBirth":" Andrews Air Force Base, Maryland, USA","height":"5' 11\" (1.8 m)","bio":"John Ward was lured into show business at the age of 12 when his younger sister, Jennifer, was named the photo double and stand-in for Drew Barrymore in Stephen King's Firestarter (1984), which was shot in his native Wilmington, NC. This gave him the acting bug, leading to several small acting roles over the years. In 1998 he made his directorial debut with Enchanted (1998), a film he also wrote, produced and starred in. It went on to cult status on cable, airing to this day. From there, he continued to write and direct feature films, with 11 to date. In 2013, he wrote, produced and directed Heart of the Country (2013) based upon the 2012 novel of the same name Ward also authored. He serves as President of Bay Ridge Films, Inc.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NzMyMzUzOV5BMl5BanBnXkFtZTcwOTU1MTEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0911631","name":"John Ward","idIMDB":"nm0911631"},"actorId":"nm0911631","character":"Derek","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0097236","urlIMDB":"http://www.imdb.com/title/tt0097236","business":{"budget":null,"openingWeekend":[{"money":"$2,830,000","country":"USA","day":"05","month":"03","year":"1989","remarks":"1,019 Screens"}],"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1988/\">1988</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 54 min (114 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panaflex Cameras and Lenses by Panavision"],"laboratory":["FotoKem Laboratory, Burbank (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.9","filmingLocations":[{"location":"New Hanover High School - 1307 Market Street, Wilmington, North Carolina, USA"}],"rated":"PG-13","awards":[],"votes":"5,049","type":"Movie","companyCreditsSimple":[{"idCompany":"co0108893","name":"Lightning Pictures"}],"keywords":{"keywords":["dream","teenager","best friend","high school","gym","switching bodies","body switching","body transformation","teen movie","mirror","drugged drink","school dance","thug","top hat","dancing","cane","flag football","sheep","change of personality","knocked unconscious","bicycle","running","face slap","trespassing","bedroom","theater","air guitar","sunglasses","cigarette smoking","repetition in title","first part","surrealism","underage drinking","smoking","single mother","gun","gay slur","body swap","child as an adult","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 06:01:48"}}