{"data":{"movies":[{"title":"The Breakfast Club","originalTitle":"","year":"1985","releaseDate":"19850215","directors":[{"name":"John Hughes","id":"nm0000455"}],"writers":[{"name":"John Hughes","id":"nm0000455"}],"runtime":"97 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTM5N2ZmZTMtNjlmOS00YzlkLTk3YjEtNTU1ZmQ5OTdhODZhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama"],"plot":"Beyond being in the same class at Shermer High School in Shermer, Illinois, Claire Standish, Andrew Clark, John Bender, and Allison Reynolds have little in common, and with the exception of Claire and Andrew, do not associate with each other in school. In the simplest and in their own terms, Claire is a princess, Andrew an athlete, John a criminal, Brian a brain, and Allison a basket case. But one other thing they do have in common is a nine hour detention in the school library together on Saturday, March 24, 1984, under the direction of Mr. Vernon, supervising from his office across the hall. Each is required to write a minimum one thousand word essay during that time about who they think they are. At the beginning of those nine hours, each, if they were indeed planning on writing that essay, would probably write something close to what the world sees of them, and what they have been brainwashed into believing of themselves. But based on their adventures during that ...","simplePlot":"Five high school students meet in Saturday detention and discover how they have a lot more in common than they thought.","actors":[{"actorName":"Emilio Estevez","urlProfile":"http://www.imdb.com/name/nm0000389","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY2MDM3MDc1OV5BMl5BanBnXkFtZTcwMTQxOTkyOA@@._V1._SX2000_CR15,79,609,709_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1962","placeOfBirth":" New York City, New York, USA","height":"5' 6½\" (1.69 m)","bio":"Emilio Estevez was born on May 12, 1962, in New York City. He is the eldest son of actor Martin Sheen, who at the time was just breaking into the business. His mother, Janet Sheen (née Templeton), was a former New York art student who had met Emilio's father right after he had moved to Manhattan. Martin and Janet had three other children, Charlie Sheen, Renée Estevez, and Ramon Estevez, all of whom became actors. His father is of half Spanish and half Irish descent, and his mother, whose family is from Kentucky, has English and Scottish ancestry. He lived on Manhattan's Upper West Side until his family relocated to Malibu in 1968. Before graduating from Santa Monica High School in 1980, Estevez had already had a small role as a messenger boy in Apocalypse Now (1979), that was ultimately cut from the film. Though his father had opted to use the stage name \"Sheen\" over his more ethnic birth name \"Estevez,\" Emilio chose to retain the family name, hoping to avoid riding his father's coattails. He also thought the double \"E\" set of initials was \"pretty.\" He appeared in a few TV movies, the first of which was Seventeen Going on Nowhere (1980), before making his big-screen debut opposite Matt Dillon in 1982's Tex (1982). A part in The Outsiders (1983) followed, and Estevez made his first big splash as the punk rocker Otto in the cult classic Repo Man (1984). Originally cast as Bender (The Criminal) in the seminal John Hughes flick The Breakfast Club (1985), Estevez took the part of Andrew (The Athlete) instead after Hughes could find no one else to fill the role. Another ensemble film, St. Elmo's Fire (1985) came next. Then Estevez made his screen-writing debut with That Was Then... This Is Now (1985), a film in which he also starred. He then starred in the Stephen King thriller Maximum Overdrive (1986), but the film was a failure. The ambitious young actor added directing to his palette with Wisdom (1987) in 1986, but the film was universally panned and struck out at the box office. Estevez quickly rebounded with hits like Stakeout (1987) and Young Guns (1988), as well as their subsequent sequels. He tried his hand at directing again with Men at Work (1990) before taking on one of his most famous roles as Coach Gordon Bombay in The Mighty Ducks (1992). The enormously popular Disney film spawned sequels and an NHL hockey team of the same name, but Estevez was interested in making weighter films. He agreed to make a brief appearance in D3: The Mighty Ducks (1996) in exchange for Disney helping him finance and distribute another effort as actor-director, The War at Home (1996). Though smiled on by critics, The War at Home (1996) received a paltry distribution by Disney and thus went largely unseen. A devastated Estevez considered quitting the business but has ultimately continued to work in films, including a fourth effort as director and star, Rated X (2000), which co-starred brother Charlie Sheen and was a selection at the Sundance Film Festival. In 2006, Bobby (2006), a film about the assassination of Senator Robert F. Kennedy that Estevez wrote, directed, and acted in, premiered at the Venice Film Festival and received a seven-minute standing ovation.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY2MDM3MDc1OV5BMl5BanBnXkFtZTcwMTQxOTkyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000389","name":"Emilio Estevez","idIMDB":"nm0000389"},"actorId":"nm0000389","character":"Andrew Clark","urlCharacter":"http://www.imdb.com/character/ch0139110","main":true},{"actorName":"Paul Gleason","urlProfile":"http://www.imdb.com/name/nm0322339","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc1MzYwNjE1Nl5BMl5BanBnXkFtZTYwMDAyMTkz._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 May 1939","placeOfBirth":" Jersey City, New Jersey, USA","birthName":"Paul Xavier Gleason","height":"6' 0½\" (1.84 m)","bio":"Character actor Paul Gleason was adept at playing tough guys and white collar sleazebags, making his film debut in Winter A-Go-Go (1965). He made a name for himself portraying these unlikeable characters. A native of Jersey City, New Jersey, Gleason studied extensively at the Actor's Studio in New York City in the mid-60s with Lee Strasberg (his mentor) and was seen in a handful of Roger Corman productions before landing a a three-year role on the TV soap opera All My Children (1970). He appeared in over 60 films, with key roles in Trading Places (1983), Die Hard (1988), Miami Blues (1990), Boiling Point (1993) and Van Wilder: Party Liaison (2002). However, he is perhaps best remembered for his role as the no-nonsense principal \"Richard Vernon\" in The Breakfast Club (1985). He also guest-starred in numerous television series, including Hill Street Blues (1981), Dawson's Creek (1998) and Friends (1994). Gleason passed away of mesothelioma, a rare form of lung cancer at a Burbank, California hospital on May 29th 2006 at the age of 67.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc1MzYwNjE1Nl5BMl5BanBnXkFtZTYwMDAyMTkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0322339","name":"Paul Gleason","idIMDB":"nm0322339"},"actorId":"nm0322339","character":"Richard Vernon","urlCharacter":"http://www.imdb.com/character/ch0007032","main":true},{"actorName":"Anthony Michael Hall","urlProfile":"http://www.imdb.com/name/nm0001309","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MjM2MjAyM15BMl5BanBnXkFtZTcwMjQ2NjQwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 April 1968","placeOfBirth":" West Roxbury, Massachusetts, USA","birthName":"Michael Anthony Thomas Charles Hall","height":"6' 2\" (1.88 m)","bio":"Anthony Michael Hall was born in West Roxbury, Massachusetts. His parents are Mercedes Hall, an actress-blues and jazz singer, and Larry Hall, who owned an auto body shop. His stepfather is a show-business manager. His sister, Mary Christian, is also a performer. He has Irish and Italian ancestry. Hall's given name was Michael Anthony Thomas Charles Hall, but he adopted the Anthony Michael moniker upon finding that another Michael Hall was already a member of the Screen Actors' Guild. Hall began acting in commercials at the age of seven, and his breakthrough role was as Rusty Griswold in National Lampoon's Vacation (1983) alongside Chevy Chase and Beverly D'Angelo. Following the success of National Lampoon's Vacation (1983), Hall entered the defining period of his career, starring in three John Hughes classics: Sixteen Candles (1984), The Breakfast Club (1985) and Weird Science (1985). Wanting to avoid being typecast, Hall turned down roles in two subsequent 1986 Hughes films, Pretty in Pink (1986) and Ferris Bueller's Day Off (1986). His early television credits include the Emmy Award-winning \"The Gold Bug\", in which he played the young Edgar Allan Poe, as well as the TV movie Rascals and Robbers: The Secret Adventures of Tom Sawyer and Huck Finn (1982), and specials \"The Body Human\" and \"Orphans, Waifs and Wards\". On stage, he appeared in the Lincoln Center Festival's production of \"St. Joan of the Microphone\". Following a one-year stint on Saturday Night Live (1975), excessive drinking and partying threatened to sidetrack Hall's career. However, he was able to regain control and has been sober since 1990, the year he played the role of Jim in Edward Scissorhands (1990). After a series of minor roles in the 1990s, he starred as Microsoft chairman Bill Gates in the television movie Pirates of Silicon Valley (1999). Since that time, Hall has focused on television work, including an 81-episode run on Stephen King's The Dead Zone (2002), but has managed to take on film projects as well, including the role of Mike Engel in The Dark Knight (2008). In addition to acting, Hall has also pursued his musical talents, as songwriter and lead singer of his band, Hall of Mirrors, which was formed in 1998. Hall helps at-risk youth via the Anthony Michael Hall Literacy Club and lives in Los Angeles, Caifornia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MjM2MjAyM15BMl5BanBnXkFtZTcwMjQ2NjQwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001309","name":"Anthony Michael Hall","idIMDB":"nm0001309"},"actorId":"nm0001309","character":"Brian Johnson","urlCharacter":"http://www.imdb.com/character/ch0139111","main":true},{"actorName":"John Kapelos","urlProfile":"http://www.imdb.com/name/nm0438127","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMjU0OTM0Nl5BMl5BanBnXkFtZTcwNTk5Nzg3OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 March 1956","placeOfBirth":" London, Ontario, Canada","birthName":"John Thomas Kapelos","height":"6' (1.83 m)","bio":"John Kapelos was born on March 8, 1956 in London, Ontario, Canada as John Thomas Kapelos. He is an actor and producer, known for The Shape of Water (2017), Justified (2010) and The Breakfast Club (1985).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMjU0OTM0Nl5BMl5BanBnXkFtZTcwNTk5Nzg3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0438127","name":"John Kapelos","idIMDB":"nm0438127"},"actorId":"nm0438127","character":"Carl","urlCharacter":"http://www.imdb.com/character/ch0217889","main":true},{"actorName":"Judd Nelson","urlProfile":"http://www.imdb.com/name/nm0000555","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3ODUwODQ5OV5BMl5BanBnXkFtZTcwMTUzNzQyMg@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 November 1959","placeOfBirth":" Portland, Maine, USA","birthName":"Judd Asher Nelson","height":"5' 10\" (1.78 m)","bio":"Born in Portland, Maine to attorney Leonard Nelson and his wife, Merle Nelson, (attorney and state assemblywoman), Judd attended St. Paul's preparatory school in Concord, New Hampshire before majoring in philosophy at the prestigious Haverford College in Pennsylvania. The acting bug bit when he went to watch a friend's audition and was obliged to audition in order to stay. He won the role. After graduation, Judd headed for New York City and the Stella Adler Conservatory where he was believable in the role as the \"street-smart Eddie Keaton\" in the comedy Making the Grade (1984). Judd's next film role was as the stodgy ROTCer, Phil Hicks, in the ensemble comedy Fandango (1985). Important and diverse roles in the brat-pack films The Breakfast Club (1985) and St. Elmo's Fire (1985) quickly followed. With his privileged upbringing, Judd could have brought the right degree of preppy-smarmyness, (ala James Spader), to any number of vapid roles, but his intense stare and dark smoldering looks gave him a hint of danger which added to his credibility in films like the Billionaire Boys Club (1987), From the Hip (1987) and New Jack City (1991). While Judd's career has been peppered with under-promoted films and poorly-written TV appearances, critics have not been overly kind to this misunderstood actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3ODUwODQ5OV5BMl5BanBnXkFtZTcwMTUzNzQyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000555","name":"Judd Nelson","idIMDB":"nm0000555"},"actorId":"nm0000555","character":"John Bender","urlCharacter":"http://www.imdb.com/character/ch0007031","main":true},{"actorName":"Molly Ringwald","urlProfile":"http://www.imdb.com/name/nm0000208","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4MzM1NTkxNF5BMl5BanBnXkFtZTgwMzA4NTk3MjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 February 1968","placeOfBirth":" Roseville, California, USA","birthName":"Molly Kathleen Ringwald","height":"5' 8\" (1.73 m)","bio":"Molly Ringwald was born in Roseville, California, to Adele Edith (Frembd), a chef, and Robert Ringwald, a blind jazz pianist. Her ancestry includes German, English, and Swedish. She released an album at the age of 6 entitled, \"I Wanna Be Loved By You, Molly Sings\". She is the youngest daughter of Bob Ringwald, the blind jazz pianist. At age five she starred in a stage production of \"Alice in Wonderland\", playing the dormouse.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4MzM1NTkxNF5BMl5BanBnXkFtZTgwMzA4NTk3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000208","name":"Molly Ringwald","idIMDB":"nm0000208"},"actorId":"nm0000208","character":"Claire Standish","urlCharacter":"http://www.imdb.com/character/ch0007029","main":true},{"actorName":"Ally Sheedy","urlProfile":"http://www.imdb.com/name/nm0000639","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MzY0NTU3OF5BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1962","placeOfBirth":" New York City, New York, USA","birthName":"Alexandra Elizabeth Sheedy","height":"5' 5\" (1.65 m)","bio":"Ally Sheedy was born in New York City, to Charlotte (Baum), a press agent and writer, and John J. Sheedy, Jr., an advertising executive. She is of Russian Jewish (mother) and Irish (father) descent. While at New York's Bank Street School, 12-year-old Ally Sheedy wrote about a mythical encounter between Queen Elizabeth I and an inquisitive mouse. The result, \"She Was Nice to Mice\", was published by McGraw-Hill and became an instant best seller. Although it proved a springboard to an acting career, Sheedy's strongest memories of childhood remain those of \"dancing and doing plays\". From six until fourteen, she danced with the American Ballet Theatre and, during summers at Fire Island, she'd \"get a bunch of kids together and stage shows on back lawns and porches\". When she discovered that to stay with dancing meant staying with starvation diets, she shifted her focus to acting for good. Meanwhile, her book brought her requests from several publications. The Village Voice asked her to review movies and the New York Times wanted her to review children's books. The assignment she accepted was from Ms. Magazine, which requested an article about her mother and herself. It was an appearance on \"The Mike Douglas Show (1961) to promote her book, however, that brought Sheedy work as a performer. Signed by an agent who caught the show, she was sent out on television commercials, immediately. Only 15 at the time, she also performed off-Broadway and on a series of after-school specials. The day she turned 18, Sheedy packed her bags and headed for Los Angeles, where she enrolled in the drama department at USC, and soon landed roles in the television drama The Best Little Girl in the World (1981), The Day the Loving Stopped (1981), Splendor in the Grass (1981) and Homeroom (1981) and played a recurring character on Hill Street Blues (1981). The strength of her performances led directly to her film debut as Sean Penn's naive-but-knowing girlfriend, \"J.C.\", in Bad Boys (1983). That same year (1983), she starred as Matthew Broderick's zany partner in WarGames (1983). After starring as Rob Lowe's would-be romantic interest in Oxford Blues (1984), the withdrawn adolescent of The Breakfast Club (1985) and Gene Hackman's adoring daughter in Twice in a Lifetime (1985), Sheedy played her first fully-adult role in St. Elmo's Fire (1985), the 1985 hit about college friends.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MzY0NTU3OF5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000639","name":"Ally Sheedy","idIMDB":"nm0000639"},"actorId":"nm0000639","character":"Allison Reynolds","urlCharacter":"http://www.imdb.com/character/ch0007030","main":true},{"actorName":"Perry Crawford","urlProfile":"http://www.imdb.com/name/nm0186929","urlPhoto":"","biography":{"bio":"Perry Crawford is an actor, known for The Breakfast Club (1985) and Joe vs. Joe (2017).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0186929","name":"Perry Crawford","idIMDB":"nm0186929"},"actorId":"nm0186929","character":"Allison's Father","urlCharacter":"http://www.imdb.com/character/ch0217890","main":true},{"actorName":"Mary Christian","urlProfile":"http://www.imdb.com/name/nm0160053","urlPhoto":"","biography":{"dateOfBirth":"1978","placeOfBirth":"","birthName":"Mary Christian Chestaro","bio":"Mary Christian was born in 1978 as Mary Christian Chestaro. She is an actress, known for The Breakfast Club (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0160053","name":"Mary Christian","idIMDB":"nm0160053"},"actorId":"nm0160053","character":"Brian's Sister","urlCharacter":"http://www.imdb.com/character/ch0007034","main":true},{"actorName":"Ron Dean","urlProfile":"http://www.imdb.com/name/nm0212939","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MTc5MjE3OF5BMl5BanBnXkFtZTcwNzg1MjQyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Ron Dean is a character actor with over thirty years of film and television roles to his credit. This multi-talented actor, with a \"tough guy\" demeanor, has masterfully played nasty villains to hard, authoritative individuals (often as cops and military officials). Ron Dean has played in several notable films with many of Hollywood's biggest names in the business. Roles include notable '90s films The Fugitive (1993) starring Harrison Ford and Tommy Lee Jones and next in The Client (1994), again starring Tommy Lee Jones. Television roles include an episode on Murder, She Wrote (1984), Frasier (1993), ER (1994), Chicago Hope (1994), NYPD Blue (1993), The West Wing (1999), CSI: Crime Scene Investigation (2000), Without a Trace (2002), Numb3rs (2005), Cold Case (2003) and Still Standing (2002). Most notably during the latter part of the 2000s, Ron Dean appeared in The Dark Knight (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MTc5MjE3OF5BMl5BanBnXkFtZTcwNzg1MjQyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0212939","name":"Ron Dean","idIMDB":"nm0212939"},"actorId":"nm0212939","character":"Andy's Father","urlCharacter":"http://www.imdb.com/character/ch0217891","main":true},{"actorName":"Tim Gamble","urlProfile":"http://www.imdb.com/name/nm0303816","urlPhoto":"","biography":{"bio":"Tim Gamble is an actor, known for The Breakfast Club (1985), The Untouchables (1987) and Chicago Cab (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0303816","name":"Tim Gamble","idIMDB":"nm0303816"},"actorId":"nm0303816","character":"Claire's Father","urlCharacter":"http://www.imdb.com/character/ch0217892","main":true},{"actorName":"Fran Gargano","urlProfile":"http://www.imdb.com/name/nm0307331","urlPhoto":"","biography":{"bio":"Fran Gargano is an actress, known for The Breakfast Club (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0307331","name":"Fran Gargano","idIMDB":"nm0307331"},"actorId":"nm0307331","character":"Allison's Mom","urlCharacter":"http://www.imdb.com/character/ch0217893","main":true},{"actorName":"Mercedes Hall","urlProfile":"http://www.imdb.com/name/nm0355900","urlPhoto":"","biography":{"dateOfBirth":"1948","placeOfBirth":" Massachusetts, USA","bio":"Mercedes Hall was born in 1948 in Massachusetts, USA. She is an actress, known for The Breakfast Club (1985), Dear God (1996) and The Doberman Gang (1972).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0355900","name":"Mercedes Hall","idIMDB":"nm0355900"},"actorId":"nm0355900","character":"Brian's Mom","urlCharacter":"http://www.imdb.com/character/ch0217894","main":true}],"seasons":[],"idIMDB":"tt0088847","urlIMDB":"http://www.imdb.com/title/tt0088847","business":{"budget":{"money":"$1,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$5,107,599","country":"USA","day":"18","month":"02","year":"1985","remarks":""}],"gross":[{"money":"$38,121,485","country":"USA","day":"12","month":"05","year":"1985","remarks":""},{"money":"$37,139,870","country":"USA","day":"05","month":"05","year":"1985","remarks":""},{"money":"$36,043,495","country":"USA","day":"28","month":"04","year":"1985","remarks":""},{"money":"$34,881,362","country":"USA","day":"21","month":"04","year":"1985","remarks":""},{"money":"$33,535,351","country":"USA","day":"14","month":"04","year":"1985","remarks":""},{"money":"$31,655,496","country":"USA","day":"07","month":"04","year":"1985","remarks":""},{"money":"$29,302,418","country":"USA","day":"31","month":"03","year":"1985","remarks":""},{"money":"$27,057,980","country":"USA","day":"24","month":"03","year":"1985","remarks":""},{"money":"$23,587,186","country":"USA","day":"17","month":"03","year":"1985","remarks":""},{"money":"$19,149,143","country":"USA","day":"10","month":"03","year":"1985","remarks":""},{"money":"$14,839,440","country":"USA","day":"03","month":"03","year":"1985","remarks":""},{"money":"$10,176,115","country":"USA","day":"24","month":"02","year":"1985","remarks":""},{"money":"$5,107,599","country":"USA","day":"18","month":"02","year":"1985","remarks":""},{"money":"SEK","country":"3,339,564","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":[{"money":"$756,510","country":"USA","day":"12","month":"05","year":"1985","remarks":"423 Screens"},{"money":"$811,200","country":"USA","day":"05","month":"05","year":"1985","remarks":"480 Screens"},{"money":"$832,390","country":"USA","day":"28","month":"04","year":"1985","remarks":"494 Screens"},{"money":"$1,012,648","country":"USA","day":"21","month":"04","year":"1985","remarks":"559 Screens"},{"money":"$1,279,122","country":"USA","day":"14","month":"04","year":"1985","remarks":"631 Screens"},{"money":"$1,675,040","country":"USA","day":"07","month":"04","year":"1985","remarks":"722 Screens"},{"money":"$1,528,300","country":"USA","day":"31","month":"03","year":"1985","remarks":"580 Screens"},{"money":"$2,412,857","country":"USA","day":"24","month":"03","year":"1985","remarks":"904 Screens"},{"money":"$3,318,400","country":"USA","day":"17","month":"03","year":"1985","remarks":""},{"money":"$3,298,436","country":"USA","day":"10","month":"03","year":"1985","remarks":""},{"money":"$3,622,950","country":"USA","day":"03","month":"03","year":"1985","remarks":""},{"money":"$4,263,383","country":"USA","day":"24","month":"02","year":"1985","remarks":""},{"money":"$5,107,599","country":"USA","day":"18","month":"02","year":"1985","remarks":""}],"admissions":[],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"28","month":"03","year":"1984","remarks":null},null],"copyrightHolder":"Copyright © MCMLXXXV by Universal City Studios, Inc. All Rights Reserved (on print)"},"technical":{"runtime":["1 hr 37 min (97 min)"],"soundMix":["Dolby"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panaflex Cameras and Lenses by Panavision"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":["2,656 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm (Eastman 5384)"]},"rating":"7.9","metascore":"62","filmingLocations":[{"location":"Maine North High School - 9511 Harrison Street, Des Plaines, Illinois, USA"}],"rated":"R","awards":[{"award":"MTV Movie Awards 2005","titlesAwards":[{"titleAwardOutcome":"Won Silver Bucket of Excellence Award","categories":[{"category":"","names":[{"name":"Anthony Michael Hall","id":"nm0001309","role":null},{"name":"Judd Nelson","id":"nm0000555","role":null},{"name":"Molly Ringwald","id":"nm0000208","role":null},{"name":"Ally Sheedy","id":"nm0000639","role":null}]}]}]},{"award":"National Film Preservation Board, USA 2016","titlesAwards":[{"titleAwardOutcome":"Won National Film Registry","categories":[{"category":"National Film Preservation Board","names":[]}]}]}],"votes":"273,377","type":"Movie","companyCreditsSimple":[{"idCompany":"co0062005","name":"A&M Films"},{"idCompany":"co0079774","name":"Channel Productions"},{"idCompany":"co0005073","name":"Universal Pictures"}],"keywords":{"keywords":["high school","antihero","teenage rebellion","teenage angst","brat pack","detention","teen movie","huis clos","f word","1980s","frustration","argument","coming of age","chicago illinois","teenage girl","teenage boy","self acceptance","jock","student athlete","geek","anger","exposed underwear","library","office","high school student","shermer illinois","musical sequence in non musical work","coming of age film","one day","high school girl","high school boy","cult following","teen comedy","teenage","teenager","suburb","laughter","black comedy","reference to john lennon","reference to barry manilow","three word title","single set production","air duct","practical joke","risk","high school teacher","teacher","virginity","hiding under a table","discussion","rage","school locker","cult film","hidden","hallway","running","escape","dysfunctional family","revelation","view under table","director cameo","dance","teen angst","pot smoking","electronic music score","self esteem","opposites attract","confrontation","earring","threat","insult","locker","virgin","teacher student relationship","peer pressure","marijuana","falling from height","conformity","attempted school shooting","rejection","jealousy","abusive father","wrestler","sushi","suicidal","self discovery","sandwich","prank","misfit","loner","lipstick","kleptomania","juvenile delinquent","janitor","drug humor","defiance","dandruff","dancing","confession","compulsive liar","bully","boredom","basketball","obscene finger gesture","makeover","gay slur","popularity","principal","troubled teen","independent film","title spoken by character","panties","scantily clad female","joke","song","kiss","car","book","white panties","pink panties","imagination","upskirt"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:30:33"}}