{"data":{"movies":[{"title":"Wild Thing","originalTitle":"","year":"1987","releaseDate":"19870417","directors":[{"name":"Max Reid","id":"nm0717361"}],"writers":[{"name":"Larry Stamper","id":"nm0821911"},{"name":"John Sayles","id":"nm0000626"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MzMwNDUwMl5BMl5BanBnXkFtZTcwNTMwMzg4NA@@._V1.jpg","countries":["Canada","USA"],"languages":["English"],"genres":["Action","Drama","Thriller"],"plot":"A child witnesses drug dealers murder his parents. He escapes and grows up wild in the city's slums. Years later he emerges to help the residents of the area who are being terrorized by street gangs and drug dealers.","simplePlot":"A child witnesses drug dealers murder his parents. He escapes and grows up wild in the city's slums. Years later he emerges to help the residents of the area who are being terrorized by street gangs and drug dealers.","actors":[{"actorName":"Robert Knepper","urlProfile":"http://www.imdb.com/name/nm0460694","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTBlZmM0NTItNWFmYS00ODk1LWEzMTgtNjczMDI3MjY1ZDQ5XkEyXkFqcGdeQXVyNTg3MTgxMTc@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1959","placeOfBirth":" Fremont, Ohio, USA","birthName":"Robert Lyle Knepper","height":"5' 10\" (1.78 m)","bio":"Robert Knepper, the son of a veterinarian, was born in Fremont, Ohio, and was raised in Maumee (near Toledo). When he was growing up, his mother worked in the props department for the community theater, and because of her involvement, he became interested in acting. Robert began his career in theater in his hometown before majoring in theater at Northwestern University. He has performed in over one hundred professional theatrical productions around the world. He is a resident of Southern California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTBlZmM0NTItNWFmYS00ODk1LWEzMTgtNjczMDI3MjY1ZDQ5XkEyXkFqcGdeQXVyNTg3MTgxMTc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0460694","name":"Robert Knepper","nicknames":["Rob"],"idIMDB":"nm0460694"},"actorId":"nm0460694","character":"Wild Thing / de: Asphalt Kid","urlCharacter":"http://www.imdb.com/character/ch0107317","main":true},{"actorName":"Kathleen Quinlan","urlProfile":"http://www.imdb.com/name/nm0000599","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0ODIwNTk4OV5BMl5BanBnXkFtZTgwMzk3OTk4NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1954","placeOfBirth":" Pasadena, California, USA","birthName":"Kathleen Denise Quinlan","height":"5' 5\" (1.65 m)","bio":"Kathleen Quinlan was born in Pasadena, California, the only child of Josephine (Zachry), a military supply supervisor, and Robert Quinlan, a television sports director. She grew up in Mill Valley, Ca, and got her break in acting when George Lucas came to her high school to cast for his movie American Graffiti (1973). She followed up her one-line role four years later with Lifeguard (1976), and then several roles in the late 1970s and 1980s. Her breakthrough performance came in 1977, as Deborah in I Never Promised You a Rose Garden (1977). She was nominated for an Academy Award in 1995 for Apollo 13 (1995). She starred in the TV series Family Law (1999), but her contract stipulated that she cannot work later than 6 pm, so she can be home with her husband, She currently works in Film and Television (2015). Bruce Abbott, son Tyler Abbott (b. October 17, 1990), and stepson Dalton Abbott (b. October 4, 1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0ODIwNTk4OV5BMl5BanBnXkFtZTgwMzk3OTk4NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000599","name":"Kathleen Quinlan","idIMDB":"nm0000599"},"actorId":"nm0000599","character":"Jane","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Davi","urlProfile":"http://www.imdb.com/name/nm0001108","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNDE5ODM5N15BMl5BanBnXkFtZTgwMzA1Nzc1ODE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 June 1951","placeOfBirth":" Astoria, Queens, New York City, New York, USA","birthName":"Robert John Davi","height":"6' 2\" (1.88 m)","bio":"Robert Davi is an award-winning actor, screenwriter, director, producer and jazz vocalist. From his portrayal of the opera singing baddie in \"The Goonies\" and one of the most popular James Bond villains Franz Sanchez in \"Licence to Kill\" to FBI Special Agent Big Johnson in\" Die Hard\" or Al Torres in \"Showgirls\" to most recently Leo Marks in \"The Iceman \" Robert Davi is one of the film industry's most recognized tough guys . He has also starred in the small screen in hit shows like Profiler, Stargate Atlantis, Criminal Minds and CSI . With over 140 film and TV credits he has frightened us , romanced us ,made us cry or split our seams laughing . He is also one of the top vocalists of our day in interpreting the Great American Songbook, thrilling audiences by playing top venues like the Venetian in Las Vegas where he headlines or for 10,000 people at the Harry Chapin Theater in East Meadow ,Long Island or the Orleans in Vegas where he gave 3 sellout shows with Don Rickles. His debut album Davi Sings Sinatra- On the Road to Romance produced by Phil Ramone shot to number 6 for more than several weeks on Billboard's Jazz Charts. In his early acting years, Davi attended Hofstra University on a drama scholarship. He then moved to Manhattan, New York where he studied with the legendary acting coach Stella Adler, who became his mentor. Davi became a lifetime member of the Actors Studio, where he studied with acting teacher Lee Strasberg. Always perfecting his craft, Davi studied under Sandra Seacat, Larry Moss, Milton Katselas, Martin Landau, Mala Powers and George Shdanoff, the creative partner and collaborator with Michael Chekhov. Robert Davi was born in Astoria, Queens, to Maria (Rulli) and Sal Davi. His father was an Italian immigrant and his mother was of Italian descent. Davi was introduced to film when he was cast opposite Frank Sinatra in the telefilm, \"Contract on Cherry Street.\" Later, his work as a Palestinian terrorist in the award-winning television movie, \"Terrorist on Trial: The United States vs. Salim Ajami\" brought him critical acclaim and caught the eye of legendary James Bond producer Albert R. Broccoli and writer Richard Maibaum, who cast Davi as Colombian drug lord and lead villain Franz Sanchez in the Bond film \"Licence to Kill.\" Today, Davi is one of the top Bond villains of all time ranking at the top on many lists. Davi also received critical acclaim within the industry for his provocative portrayal of Bailey Malone in \"Profiler.\" The show struck a chord with audiences, paving the way for such shows as \"CSI: Crime Scene Investigation,\" \"Without a Trace,\" \"Law & Order: Criminal Intent,\" \"Criminal Minds\" and many others. In 2004, Davi joined the cast of television's \"Stargate: Atlantis,\" which earned Davi many science fiction fans. He has also shown his comedic strength in films such as \"The 4th Tenor\" with Rodney Dangerfield and \"The Hot Chick,\" produced by Rob Schneider and Adam Sandler. Having appeared in more than 100 motion pictures, some of Davi's most notable film credits span 30 years and include cult-classics and blockbuster hits with roles as Jake Fratelli in \"The Goonies,\" Max Keller in \"Raw Deal,\" Special Agent Big Johnson in \"Die Hard,\" Al Torres in \"Showgirls,\" Leo Marks in \"The Iceman\" with Michael Shannon, Winona Ryder, Ray Liotta, Chris Evans and James Franco, and most recently, with Sylvester Stallone and Arnold Schwarzenegger among a large A-list cast in \"Expendables 3.\" He has worked with such directors as Steven Spielberg, Richard Donner, Blake Edwards, John McTiernan, Paul Verhoeven and Patrick Hughes. In addition, he has worked on film projects with acting talent such as Marlon Brando, Roberto Benigni, Bruce Willis, Clint Eastwood, Christopher Walken, Benicio Del Toro, Danny Glover and Catherine Zeta Jones, to name a few. In 2007, Davi produced, directed, co-wrote, and starred in \"The Dukes,\" which tells the story of a once-successful Doo Wop group who fall on hard times. The film won nine awards including the coveted Coup de Coeur award. Davi was also awarded Best First-time Director and Best Screenplay in the Monte Carlo Festival of Comedy by the legendary director Ettore Scola where Prince Albert presented him with the awards. Davi was the only first-time director in the Premiere Section of the International Rome Film Festival along with Sean Penn, Robert Redford, Sidney Lumet, Julie Taymor and others. In October of 2011, Davi released his debut album, Davi Sings Sinatra: On the Road to Romance (produced by Grammy award-winning producer Phil Ramone) to rave reviews. Within weeks of its highly anticipated release, the album soared onto Billboard Magazine's Top 10 Jazz Chart taking the number 6 spot for several weeks. In response to the release, the legendary Quincy Jones stated, \"As FS would say, 'Koo, Koo.' Wow! I have never heard anyone come this close to Sinatra's sound - and still be himself. Many try, but Robert Davi has the voice, tone, the flavor and the swagger. What a surprise. He absolutely touched me down to my soul and brought back the essence and soul of Ol' Blue Eyes himself.\" In support of the album release, Davi is touring the U.S. with his live stage show, receiving standing ovations. He has performed at The Venetian Resort Hotel Casino in Las Vegas for a three-night engagement, the Thousand Oaks Civic Arts Plaza with a 55-piece orchestra, the National Italian-American Foundation's (NIAF) special tribute to the 25th anniversary of its Lifetime Achievement Award to Frank Sinatra at the Washington Hilton in D.C., the Soboba Casino in San Jacinto, Calif., with David Foster at the Beverly Hilton, and in August of 2013, at Long Island's Eisenhower Park for more than 10,000 people. In November of 2013, Davi released the Christmas single, \"New York City Christmas.\" Besides working in film, television, and music and raising his five children, four dogs and two cats, Davi keeps busy volunteering his time with such charities as The Dream Foundation, Exceptional Children's Foundation, Heart of a Child Foundation, the Los Angeles County Sheriff's Youth Foundation, The Humane Society of the United States, Heart of a Horse, NIAF, The Order 'Sons of Italy' in America (OSIA), and UNICO . Since its inception in 1998, Davi has been the National Spokesperson for i-Safe America, which is regarded by many internet experts as the most complete internet safety program in the country and is available in grades K-12 in all 50 U.S. states. Among his numerous awards for career achievement and community involvement, Davi has received the George M. Estabrook Distinguished Service Award from the Hofstra University Alumni Association (past recipients include Francis Ford Coppola and William Safire). In 2000, Davi was awarded the FBI's Man of the Year Award in Los Angeles. In 2004, Davi was named KNX radios' \"Citizen of the Week\" for saving a young girl from a fire in her home. The same year, he also received the Sons of Italy's Royal Court of the Golden Lion Award, including a $20,000 donation to a foundation in which he is involved. In addition, he received the 2004 STEP Award (Science, Technology and Education Partnership). In 2007, Davi was awarded a Lifetime Achievement Award from the Italian Board of Governors in New York, where New York State recognized his value as an artist and community leader. In 2008, he received the Italo-Americano Award from the Capri-Hollywood Festival. In 2011, Davi was awarded the \"Military Order of the Purple Heart\" (MOPH) Special Recognition Award for dedication and service honoring America's service members, veterans, and their families. In June of 2013, Davi was honored with a star on the Italian Walk of Fame in Toronto, Canada. Davi is on The Steering Committee for George Washington University's Homeland Security Policy Institute and is the only entertainer among 28 members, which consists of mainly Senators and former heads of the FBI and CIA. Davi has developed Civilian Patrol 93, which is at Homeland Security, where a lesson plan is being written.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNDE5ODM5N15BMl5BanBnXkFtZTgwMzA1Nzc1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001108","name":"Robert Davi","idIMDB":"nm0001108"},"actorId":"nm0001108","character":"Chopper","urlCharacter":"http://www.imdb.com/character/ch0107318","main":true},{"actorName":"Maury Chaykin","urlProfile":"http://www.imdb.com/name/nm0001999","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NjA2NDg5Nl5BMl5BanBnXkFtZTcwOTMxNzkyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 July 1949","placeOfBirth":" Brooklyn, New York, USA","birthName":"Maury Alan Chaykin","height":"6' 1\" (1.85 m)","bio":"The award-winning Canadian-American character actor Maury Chaykin was born on July 27, 1949 in Brooklyn, New York, the son of Professor Irving J. Chaykin and his wife Clarice. Irving Chaykin, an American citizen, taught accountancy at the City College of New York. The former Clarice Bloomfield, his mother, was born in Winnipeg, raised in Montreal, and educated at the Beth Israel Hospital nursing school in Newark, New Jersey. Because of his parents, Maury held dual Canadian and American citizenship. He was raised in New York City but moved to Toronto after graduating from the State University of New York, Buffalo, where he studied drama. His uncle, George Bloomfield, made his name in Canada as a movie and television writer, director and producer. Maury would later star in two theatrical movies, one TV movie and 14 TV episodes directed by his uncle. Maury made his debut in the 1975 Canadian film Me (1975). In his 35-year-long career, he appeared in over 150 parts in films and TV series shot in Canada and the U.S. He was best known for his eccentric role as Kevin Costner's commanding officer in the Oscar-winning Dances with Wolves (1990), three films of Atom Egoyan, including De beaux lendemains (1997), and his role as Nero Wolfe on cable TV. (His uncle George Bloomfield directed some of the Nero Wolfe episodes.) He won a Genie Award, the Canadian equivalent of the Oscar, as Best Supporting Actor for his performance as a has-been rock star in Whale Music (1994) and two Gemini Awards, the Canadian equivalent of the Emmy. Recently, he had a semi-recurring role as a movie producer based on Harvey Weinstein in the cable-TV series Entourage (2004) and a regular role on the Canadian TV series Less Than Kind (2008). Chaykin was suffering from kidney disease in the last years of his life. He died on his 61st birthday, July 27, 2010, at Toronto General Hospital, surrounded by members of his family. He was married to the Canadian actress Susannah Hoffmann, by whom he had a daughter, Rose.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NjA2NDg5Nl5BMl5BanBnXkFtZTcwOTMxNzkyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001999","name":"Maury Chaykin","idIMDB":"nm0001999"},"actorId":"nm0001999","character":"Jonathan Trask","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Betty Buckley","urlProfile":"http://www.imdb.com/name/nm0000990","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MTQyMzU1Nl5BMl5BanBnXkFtZTcwOTQ4MDU3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 July 1947","placeOfBirth":" Fort Worth, Texas, USA","birthName":"Betty Lynn Buckley","height":"5' 6\" (1.68 m)","bio":"Betty Buckley was born in Big Spring, Texas to Betty Bob and Ernest Buckley. She attended Texas Christian University (TCU) in Fort Worth. She was crowned \"Miss Fort Worth\" in 1966, and was runner-up in the Miss Texas competition. While Betty has always been a product of Broadway, the roles in which she played before-the-camera are mesmerizing. She made her film debut appearance in Brian De Palma's Carrie (1976). She played the part of Miss Collins, the title-character's nurturing and concerned teacher. She went on to play Sondra Walker, Harrison Ford's on-screen wife in Roman Polanski's Frantic (1988), Suzanne Fitzgerald, the on-screen birth mother of prisoner Ryan O'Reily in HBO's Oz (1997), and the ever-so-creepy Mrs. Jones in M. Night Shyamalan's The Happening (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MTQyMzU1Nl5BMl5BanBnXkFtZTcwOTQ4MDU3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000990","name":"Betty Buckley","idIMDB":"nm0000990"},"actorId":"nm0000990","character":"Leah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Guillaume Lemay-Thivierge","urlProfile":"http://www.imdb.com/name/nm0501168","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTFmODk2YTgtYTBhMS00MzgxLWFlNjYtOTBmZDJiN2IxY2ZkXkEyXkFqcGdeQXVyNjY5MjE0MDc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 February 1976","placeOfBirth":" St.-Jerome, Québec, Canada","height":"5' 6\" (1.68 m)","bio":"Guillaume Lemay-Thivierge was born on February 28, 1976 in St.-Jerome, Québec, Canada. He is an actor and assistant director, known for Absolute Race (2007), The 3 L'il Pigs (2007) and Frisson des collines (2011). He was previously married to Mariloup Wolfe.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTFmODk2YTgtYTBhMS00MzgxLWFlNjYtOTBmZDJiN2IxY2ZkXkEyXkFqcGdeQXVyNjY5MjE0MDc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0501168","name":"Guillaume Lemay-Thivierge","idIMDB":"nm0501168"},"actorId":"nm0501168","character":"Wild Thing","urlCharacter":"http://www.imdb.com/character/ch0107317","main":true},{"actorName":"Robert Bednarski","urlProfile":"http://www.imdb.com/name/nm0066130","urlPhoto":"","biography":{"bio":"Robert Bednarski is an actor, known for No Blame (1988), To Save the Children (1994) and Wild Thing (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0066130","name":"Robert Bednarski","idIMDB":"nm0066130"},"actorId":"nm0066130","character":"Wild Thing","urlCharacter":"http://www.imdb.com/character/ch0107317","main":true},{"actorName":"Clark Johnson","urlProfile":"http://www.imdb.com/name/nm0424800","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNjc3MzQwOV5BMl5BanBnXkFtZTYwNTQ0NTc3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1954","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"6' 2\" (1.88 m)","bio":"Clark Johnson was born on September 10, 1954 in Philadelphia, Pennsylvania, USA. He is an actor and director, known for Homicide: Life on the Street (1993), The Wire (2002) and Alpha House (2013). He was previously married to Heather Salmon.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNjc3MzQwOV5BMl5BanBnXkFtZTYwNTQ0NTc3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0424800","name":"Clark Johnson","idIMDB":"nm0424800"},"actorId":"nm0424800","character":"Winston","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sean Hewitt","urlProfile":"http://www.imdb.com/name/nm0382086","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MjQyOTA1Ml5BMl5BanBnXkFtZTgwNzIzNzE1NzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Sean Hewitt is an actor and producer, known for Crimson Peak (2015), Battlefield Earth (2000) and Thinner (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MjQyOTA1Ml5BMl5BanBnXkFtZTgwNzIzNzE1NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0382086","name":"Sean Hewitt","idIMDB":"nm0382086"},"actorId":"nm0382086","character":"Father Quinn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Theo Caesar","urlProfile":"http://www.imdb.com/name/nm0008826","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxNDU1MTYwM15BMl5BanBnXkFtZTgwNjYwNzM2NDE@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 July 1973","placeOfBirth":" New York City, New York, USA","birthName":"Theodore Eric Abner","height":"5' 3\" (1.6 m)","bio":"Theo Caesar is the head of 90210 Talent Agency and the Agency's primary Theatrical Agent. He joined the agency as a talent rep in 2009. Theo's journey into the entertainment industry began at the age of 12 when he became a child actor and landed a role in \"Police Academy 3: Back In Traning\". The South Bronx, NY native went on to star in several film, television, print and theater productions from New York to California and even Canada. At the age of 16, his family relocated to Virginia Beach, VA. He took up an interest in music and began interning at a recording studio called \"TMH (The Music House)\". Before long, the studio owner, David Velazquez, taught Theo how to engineer and produce recordings of his own, making him the head engineer and business manager of the studio. In his early twenties, he entered into a business partnership with David and they began a production company called \"QSL Entertainmentt\". Theo started a hip hop group named \"Black Reign\" with his friends Shante \"L.U.V.\" Holland and Donshay \"Big Qweezy\" Gregory. Over time, Velazquez decided to take a different direction in business and turned over the majority of his interest in QSL and TMH over to the trio. They went on to sell thousands of CDs throughout the East Coast and perform regularly over a ten year span which even led them to win the 2005 Blendzville Award for Best Independent Label in Hampton Roads, VA. In 2005, Theo joined Studio Center Total Production as a voice over talent and began doing radio and television commercials for entities such as McDonalds, Church's Chicken and Carmax, as well as others. He decided to try his hand at the acting game once again and moved to Los Angeles in January of 2007. Once there, opportunities on the business side of entertainment began to unfold at neck-breaking speed. He met casting director/producer, Ann Ross and writer/director, Tim White, who showed him the ropes of the other side of the movie game. After working with them on their film, \"Gurdian\", he decided to form his own company, TEAM Casting and Production, LLC.. Within his first year in CA, Theo dove into several positions in the industry from acting to casting to talent management and film production. He was approached by his brother-in-law, entertainment lawyer Christopher Brown of Brown & Rosen, LLC in Boston, MA, to seek out aspiring producers looking for financing for film and TV projects. Their first successful venture was for promotion and advertising funds for the Bill Duke directed, 20th Century Fox project, \"Cover\" through producers Kenneth Dixon and Gus Blackmon. All around, this dynamic hustler is a go-getter fit for the nickname.... The O Mazing!!","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxNDU1MTYwM15BMl5BanBnXkFtZTgwNjYwNzM2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0008826","name":"Theo Caesar","nicknames":["The O Mazing","Sho"],"idIMDB":"nm0008826"},"actorId":"nm0008826","character":"Rasheed","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cree Summer","urlProfile":"http://www.imdb.com/name/nm0838588","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4MzA5NDI2MF5BMl5BanBnXkFtZTcwMjcwMTQyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 July 1969","placeOfBirth":" Los Angeles, California, USA","birthName":"Cree Summer Francks","height":"5' 3\" (1.6 m)","bio":"Cree Summer was born on July 7, 1969 in Los Angeles, California, USA as Cree Summer Francks. She is an actress, known for Inspector Gadget (1983), A Different World (1987) and Tiny Toon Adventures (1990). She is married to Angelo Pullens. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4MzA5NDI2MF5BMl5BanBnXkFtZTcwMjcwMTQyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0838588","name":"Cree Summer","idIMDB":"nm0838588"},"actorId":"nm0838588","character":"Lisa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shawn Levy","urlProfile":"http://www.imdb.com/name/nm0506613","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTkyNjk4MTM0NF5BMl5BanBnXkFtZTcwNTA4MTQ5Mw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 July 1968","placeOfBirth":" Montreal, Quebec, Canada","bio":"Shawn Levy was born on July 23, 1968 in Montreal, Quebec, Canada. He is a producer and director, known for Stranger Things (2016), Real Steel (2011), and the Night at the Museum franchise. He is the founder and principal of 21 Laps Entertainment. He is married to Serena Levy and they have four daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTkyNjk4MTM0NF5BMl5BanBnXkFtZTcwNTA4MTQ5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0506613","name":"Shawn Levy","idIMDB":"nm0506613"},"actorId":"nm0506613","character":"Paul","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ron Torchia","urlProfile":"http://www.imdb.com/name/nm0867872","urlPhoto":"","biography":{"bio":"Ron Torchia is an actor, known for Wild Thing (1987), Dead Silent (1999) and Karmina 2 (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0867872","name":"Ron Torchia","idIMDB":"nm0867872"},"actorId":"nm0867872","character":"Hud","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christine Jones","urlProfile":"http://www.imdb.com/name/nm0427755","urlPhoto":"","biography":{"bio":"Christine Jones is an actress, known for General Hospital (1963), One Life to Live (1968) and Another World (1964). She has been married to Thomas H. Libscomb since August 22, 1981.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0427755","name":"Christine Jones","idIMDB":"nm0427755"},"actorId":"nm0427755","character":"Laurie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Austern","urlProfile":"http://www.imdb.com/name/nm0042307","urlPhoto":"","biography":{"bio":"Robert Austern is an actor, known for The Carpenter (1988), Wild Thing (1987) and Un long chemin (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0042307","name":"Robert Austern","idIMDB":"nm0042307"},"actorId":"nm0042307","character":"Wiz","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0094325","urlIMDB":"http://www.imdb.com/title/tt0094325","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"11","month":"08","year":"1986","remarks":null},{"money":null,"country":null,"day":"20","month":"09","year":"1986","remarks":null}],"copyrightHolder":"1987 Atlantic Productions, Inc."},"technical":{"runtime":["1 hr 32 min (92 min) (Brazil)","1 hr 32 min (92 min) (USA)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"5.2","filmingLocations":[{"location":"Montréal, Québec, Canada"}],"rated":"PG-13","awards":[],"votes":"458","type":"Movie","companyCreditsSimple":[{"idCompany":"co0146284","name":"Atlantic Productions"},{"idCompany":"co0062655","name":"Filmline International"}],"keywords":{"keywords":["drug dealer","volkswagen bus","urban legend","tarzan","social worker","new york city","loss of parents","hitchhiker","ghetto","feral child","date rape","crooked cop","bag lady","death of mother","death of father","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:53:38"}}