{"data":{"movies":[{"title":"Poltergeist III","originalTitle":"","year":"1988","releaseDate":"19880610","directors":[{"name":"Gary Sherman","id":"nm0792446"}],"writers":[{"name":"Gary Sherman","id":"nm0792446"},{"name":"Brian Taggert","id":"nm0846532"}],"runtime":"98 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjZjMWMwZTEtZjFjNy00M2Y1LWJmMWYtNjFjZjJiNGNiYzc1XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Thriller"],"plot":"Carol Anne has been sent to live with her Aunt and Uncle in an effort to hide her from the clutches of the ghostly Reverend Kane, but he tracks her down and terrorises her in her relatives' appartment in a tall glass building. Will he finally achieve his target and capture Carol Anne again, or will Tangina be able, yet again, to thwart him?","simplePlot":"Carol Anne is staying with her aunt in a highrise building, and the supernatural forces that have haunted her previously follow her there.","actors":[{"actorName":"Tom Skerritt","urlProfile":"http://www.imdb.com/name/nm0000643","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzY3Mjk5MTMyMl5BMl5BanBnXkFtZTYwMjUxMTc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1933","placeOfBirth":" Detroit, Michigan, USA","birthName":"Thomas Roy Skerritt","height":"6' (1.83 m)","bio":"Lean, ruggedly handsome leading man and supporting actor whose \"outdoor\" looks have improved with age, Tom Skerritt attended Wayne State University and UCLA, and was first noticed in a UCLA production of \"The Rainmaker\" before making his movie debut in War Hunt (1962). However, he spent most of the next decade in television, regularly appearing in Combat! (1962), The Virginian (1962), Gunsmoke (1955) and 12 O'Clock High (1964). Skerritt's next big break was appearing alongside Donald Sutherland and Elliott Gould in Robert Altman's biting satire MASH (1970). Several other film roles quickly followed, before he landed the plum role of Capt. Dallas of the ill-fated commercial towing vehicle Nostromo in the creepy sci-fi epic Alien (1979). Skerritt turned up again in another thriller playing a cop hunting a serial killer in the eerie The Dead Zone (1983), as a Navy Officer Flight instructor in Top Gun (1986) , in the six-chick flick Steel Magnolias (1989), and then as the poster boy for a \"Guess\" Jeans ad campaign utilizing his mature, weather-beaten features. Skerritt didn't neglect his TV background and reappeared on the small screen in Cheers (1982), The China Lake Murders (1990) and picked up an Emmy in 1994 for his performance as Sheriff Brock in the superb series Picket Fences (1992). Skerritt has remained continually busy for the past decade, contributing natural, entertaining and reliable performances in TV series, made-for-TV movies and major theatrical releases. He recreated the role of Will Kane in the TV production of High Noon (2000), and appeared alongside Bruce Willis in the mercenary war drama Tears of the Sun (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzY3Mjk5MTMyMl5BMl5BanBnXkFtZTYwMjUxMTc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000643","name":"Tom Skerritt","idIMDB":"nm0000643"},"actorId":"nm0000643","character":"Bruce Gardner","urlCharacter":"http://www.imdb.com/character/ch0010399","main":true},{"actorName":"Nancy Allen","urlProfile":"http://www.imdb.com/name/nm0000262","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MjU5MzIxOV5BMl5BanBnXkFtZTcwMTM2NTgwMw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 June 1950","placeOfBirth":" New York City, New York, USA","birthName":"Nancy Anne Allen","height":"5' 6\" (1.68 m)","bio":"Nancy Anne Allen was the daughter of a police lieutenant from Yonkers, New York. At a young age, she trained for a dancing career at the High School of Performing Arts, and then attended Jose Quintano's School for Young Professionals. In dozens of television commercials from the age of 15, Nancy made her first film appearance in The Last Detail (1973) with Jack Nicholson. Three years later, she set the standard for all future \"bitch-goddess teenagers\" as Chris Hargensen in Stephen King's Carrie (1976), taken to the big screen by director Brian De Palma. Nancy then married De Palma in 1979. She next appeared in Steven Spielberg's I Wanna Hold Your Hand (1978); for the next few years, she appeared only in De Palma's films: Home Movies (1979), Dressed to Kill (1980), and she starred with John Travolta in Blow Out (1981). After her divorce from De Palma in 1984, Nancy's film opportunities were supposedly narrowed, but then she surprised the whole world in 1987 when she performed as Officer Anne Lewis in the sci-fi cult film RoboCop (1987), along with Peter Weller. Here, she set another standard as a tough but at the same time feminine policewoman, whose sex would not interfere with her actions. After the success of RoboCop, she performed as Patricia Gardner in the second sequel in the Poltergeist series. She came back in RoboCop 2 (1990) and in order to get more involved with the character Nancy Allen learned martial arts and police training for real. She returned again in RoboCop 3 (1993), though her co-star Peter Weller did not this time. In 1993, Nancy joined several other veteran stars in Acting on Impulse (1993), and married co-star Craig Shoemaker, in the same year. A few years later, she divorced Craig and some time after she married again. Later, she appeared in some diverse films: Dusting Cliff 7 (1997) Secret of the Andes (1998), Circuit (2001), and she had a guest appearance in Steven Soderbergh's Out of Sight (1998). Her last performance was for the television series Law & Order: Special Victims Unit (1999), in the episode \"Escape\" aired on December 2, 2003. Allen has recently appeared in several documentaries about her most famous films: Acting 'Carrie' (2001), _DVD BackStory: RoboCop (2001)_, The Making of 'Dressed to Kill' (2001), DVD _ET True Hollywood Stories: The Curse of Poltergeist (2002)_. Interested in projecting the image of a strong but at the same time feminine woman, she managed to get away from the victim roles she was always offered, she also was able to get away from the stereotype of the beautiful but dumb woman in most action films. She is an environmentalist that traded her Volvo car for an Hybrid car in order to set the example. She is also an activist against breast Cancer along with her friend actress Wendie Jo Sperber, who created the foundation WeSpark. Her last appearance on television was on the Inside E! story of her co-star John Travolta and the A&E Biography of Travolta - both appearances in 2004. Nowadays, Nancy Allen lives a quiet life along with her family and friends somewhere in the United States.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MjU5MzIxOV5BMl5BanBnXkFtZTcwMTM2NTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000262","name":"Nancy Allen","nicknames":["The Scream Queen","The Queen of Horror"],"idIMDB":"nm0000262"},"actorId":"nm0000262","character":"Patricia Wilson-Gardner","urlCharacter":"http://www.imdb.com/character/ch0175559","main":true},{"actorName":"Heather O'Rourke","urlProfile":"http://www.imdb.com/name/nm0001576","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU3Mzc3MjMyNl5BMl5BanBnXkFtZTcwOTkwOTkxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 December 1975","placeOfBirth":" San Diego, California, USA","birthName":"Heather Michele O'Rourke","height":"4' 8\" (1.42 m)","bio":"Heather Michele O'Rourke was born on December 27, 1975 in Santee, San Diego, California, to Kathleen, a seamstress, and Michael O'Rourke, a construction worker. She had German, Danish, English, and Irish ancestry. Heather entered American cinematic pop-culture before first grade. She was sitting alone in the MGM Commissary waiting for her mother when a stranger approached her asking her name. \"My name is Heather O'Rourke,\" she said. \"But you're a stranger, and I can't talk to you\". When her mother returned, the stranger introduced himself as Steven Spielberg. She failed her first audition when she laughed at a stuffed animal Spielberg presented her with. He thought she was just too young (she had just turned five), and he was actually looking for a girl at least 6 years old, but he saw something in her and asked her to come in a second time with a scary story book. He asked her to scream a lot. She screamed until she broke down in tears. The next day at the commissary, Spielberg told her and her family, \"I don't know what it is about her, but she's got the job.\" She instantly became a star overnight and was easily recognized at her favorite theme park, Disneyland, and everywhere in California. In the years that followed, Heather was a familiar face on TV in Happy Days (1974) (1982-1983), Webster (1983) (1983-1984), and The New Leave It to Beaver (1983) (1986-1987), three shows in which she had recurring roles. In 1986, the highly anticipated sequel to her first movie, Poltergeist (1982), Poltergeist II: The Other Side (1986) debuted in theaters; it was her riveting performance in this film that cemented her a place in Hollywood history. In January 1987, Heather began to have flu-like symptoms and her legs and feet swelled. She was taken to Kaiser Hospital, and they confirmed it was only the flu, but when symptoms continued, they diagnosed her as having Crohn's Disease, a chronic inflammation of the intestine. She was on medication throughout the filming of her next project, Poltergeist III (1988), and her cheeks were puffy in some scenes. She never complained during filming and did not appear sick to fellow cast members. When filming was completed in June, Heather and her family went on a road trip from Chicago, to New Orleans, to Orlando and all the way back to Lakeside where they lived at the time. Heather was well until January 31, 1988, Super Bowl Sunday. She was unable to keep anything in her stomach and crawled into bed with her parents that night, saying that she didn't feel well. The next morning, February 1, sitting at the breakfast table, she couldn't swallow her toast or Gatorade. Her mother noticed her fingers were blue and her hands were cold. Kathleen called the doctor's and was getting ready to put her clothes on when Heather fainted on the kitchen floor. When the paramedics came in, Heather insisted that she was \"really okay\" and was worried about missing school that day. In the ambulance, Heather suffered cardiac arrest and died on the operating table at 2:43 p.m. at the tender age of 12. Of all her achievements, Heather was proudest of being elected student body president of her 5th grade class in 1985.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU3Mzc3MjMyNl5BMl5BanBnXkFtZTcwOTkwOTkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001576","name":"Heather O'Rourke","nicknames":["Bernie","Heath"],"idIMDB":"nm0001576"},"actorId":"nm0001576","character":"Carol Anne Freeling","urlCharacter":"http://www.imdb.com/character/ch0010401","main":true},{"actorName":"Zelda Rubinstein","urlProfile":"http://www.imdb.com/name/nm0748289","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MzQwNjY3NV5BMl5BanBnXkFtZTcwMjA4MjUxMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 May 1933","placeOfBirth":" Pittsburgh, Pennsylvania, USA","height":"4' 3\" (1.3 m)","bio":"A marvelously quirky and distinctive 4' 3\" character actress, with a larger-than-life presence on film and TV, Zelda Rubinstein gave up a long and stable career in the medical field as a lab technician in order to strive for something more self-fulfilling as middle age settled in. At the age of 45, the feisty lady gave up the comfort of a stable paycheck and attempt an acting career, a daunting task for anyone but especially someone of her stature and type. Within a few years, she had beaten the odds and became a major movie celebrity thanks to one terrific showcase in a Steven Spielberg horror classic. In the process, she served as an inspiration to all the \"little people\" working in Hollywood who are forced to toil in cruel and demeaning stereotypes. Zelda May Rubinstein was born on May 28, 1933 in Pittsburgh, Pennsylvania, to Dolores and George Rubinstein, who were Polish Jewish immigrants. Zelda was the youngest of three children, and the only \"little person\" in the family. Her childhood and teenage years were decidedly difficult in terms of coping with her \"interesting variation,\" which was caused by a pituitary gland deficiency. With no designs on acting at the time, she went the normal route of college and received a scholarship to study at the University of Pittsburgh. She earned her degree in bacteriology and worked for a number of years as a lab technician in blood banks. In 1978, Zelda, in a pursuit of something more creative in her life, abandoned her cushy but mundane job and threw herself completely into acting. She made her movie debut as one of the little people in the Chevy Chase slapstick comedy Under the Rainbow (1981). It all came together so quickly with her second film Poltergeist (1982) in the scene-stealing role of Tangina, the saucy, self-confident, prune-faced \"house cleaner\" with the whispery, doll-like voice who is brought in to rid a suburban home of demonic possession. Co-writer/producer Spielberg claims he designed the psychic role specifically for a \"little person\". The film became an instant summertime hit and Zelda created absolute magic and wonderment with the testy role, receiving some of the movie's best reviews. The character actress went on to appear in the two \"Poltergeist\" sequels. The \"Poltergeist\" movie projects were eventually dubbed \"cursed\" due to the untimely deaths of some of its performers, particularly two of the three children of film parents Craig T. Nelson and JoBeth Williams. 22-year-old Dominique Dunne was slain in 1982 by a jealous ex-boyfriend only a few months after the first film's release, and angelic little Heather O'Rourke, age 12, died of an intestinal obstruction just months before Poltergeist III (1988) made it to the screen. Although Zelda would not find a role quite up to the standards and popularity of Tangina, her subsequent career remained surprisingly active with a number of weird parts woven into both comedies and chillers -- often variations of her eccentric Tangina role. She played a mental patient in the Frances Farmer biopic Frances (1982), which showcased Jessica Lange in the Oscar-nominated title role; a squeaky-shoed organist in John Hughes sweet-sixteen comedy classic Sixteen Candles (1984) co-starring \"Brat Pack\"ers Molly Ringwald and Anthony Michael Hall; the demented mom in the gruesome, Spanish-made horror-thriller Anguish (1987) [aka Anguish], which has since reached cult status; a mentor witch in the comic fantasy Teen Witch (1989); a hermit in a National Lampoon-based slapstick Last Resort (1994); a betting clerk in the sci-fi adventure Timemaster (1995); an ill-fated nun in the thriller Little Witches (1996), and; a theatre director in the flick Critics and Other Freaks (1997). Into the millennium, she made some odd, slapdash appearances in such minor fare as Maria & Jose (2000), Wishcraft (2002), Cages (2005)_, Angels with Angles (2005), Unbeatable Harold (2006) and Southland Tales (2006). In her last film, she furthered her horror icon status with a small cameo in the slim-budgeted indie Behind the Mask: The Rise of Leslie Vernon (2006) that also featured Robert Englund of \"Freddy Krueger\" fame. Zelda also found an \"in\" doing voiceovers, her doll-like tones ideal for cartoons and such, and in commercials promoting such items as Skittles candy. She enjoyed extended popularity on TV with a regular series role on the first couple of seasons of Picket Fences (1992). Her character later was killed off in a freakish accident (fell into a freezer!). In her last years she narrated, and \"Exorcist\" child star Linda Blair hosted, TV's Scariest Places on Earth (2000). The actress also appeared on stage in such productions as \"Deathtrap\" (as a psychic, of course), \"To Kill a Mockingbird,\" \"Suddenly, Last Summer,\" \"The Slab Boys\" and \"Black Comedy\". She also appeared as Yente in a production of \"Fiddler on the Roof\". An outspoken social activist, Zelda was a staunch advocate for the rights of little people who formed the nonprofit Michael Dunn Memorial Repertory Theater Company in Los Angeles in 1985. The actress gained additional attention and respect, if not popularity (her career suffered for a time as a result), as an early and outspoken HIV/AIDS activist. As the poster mom for AIDS awareness, she valiantly appeared in a series of maternal newspaper/billboard advertisements imploring her gay son to practice safe sex. The series of ads ran from the mid-to-late 1980s. Zelda also participated in the first AIDS Project Los Angeles AIDS Walk and attended the 25th Anniversary Walk on October 12, 2009. A couple of months before her death on January 27, 2010, Zelda suffered a heart attack. Complications set in (kidney and lung failure) and she passed away at age 76 on January 27, 2010, at Barlow Respiratory Hospital in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MzQwNjY3NV5BMl5BanBnXkFtZTcwMjA4MjUxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0748289","name":"Zelda Rubinstein","idIMDB":"nm0748289"},"actorId":"nm0748289","character":"Tangina Barrons","urlCharacter":"http://www.imdb.com/character/ch0010404","main":true},{"actorName":"Lara Flynn Boyle","urlProfile":"http://www.imdb.com/name/nm0001223","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MzY3OTY3OF5BMl5BanBnXkFtZTYwNDkxOTI0._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 March 1970","placeOfBirth":" Davenport, Iowa, USA","height":"5' 6\" (1.68 m)","bio":"Lara Flynn Boyle was born in Davenport, Iowa on March 24, 1970 to 21-year old Sally Boyle. For Sally and young Lara, money was not plentiful so Sally was required to work three jobs in addition to raising baby Lara by herself. Since Lara was mostly around Sally, they developed a bond that still binds Lara and Sally today. Until recently, Sally lived with Lara. Now they only live 10 minutes away from each other. Growing up, Lara had many struggles including dyslexia and a learning disability. Still, she could not let that get to her and she knew she had to be strong. She finally graduated, and, the day after doing so, she and her mother, Sally, moved. They drove on what would be \"the road to fame\". She soon landed roles in movies like Poltergeist III (1988) and Wayne's World (1992). Since then, she has become a prolific actress on both the small screen and the big screen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MzY3OTY3OF5BMl5BanBnXkFtZTYwNDkxOTI0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001223","name":"Lara Flynn Boyle","nicknames":["L.F."],"idIMDB":"nm0001223"},"actorId":"nm0001223","character":"Donna Gardner","urlCharacter":"http://www.imdb.com/character/ch0010398","main":true},{"actorName":"Kipley Wentz","urlProfile":"http://www.imdb.com/name/nm0921142","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MDM0ODIwNl5BMl5BanBnXkFtZTYwMDMyMzEz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Kipley Wentz is an actor and editor, known for Poltergeist III (1988), Forever for Now (2004) and Much Ado (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MDM0ODIwNl5BMl5BanBnXkFtZTYwMDMyMzEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0921142","name":"Kipley Wentz","idIMDB":"nm0921142"},"actorId":"nm0921142","character":"Scott","urlCharacter":"http://www.imdb.com/character/ch0175560","main":true},{"actorName":"Richard Fire","urlProfile":"http://www.imdb.com/name/nm0278626","urlPhoto":"","biography":{"dateOfBirth":"12 November 1945","placeOfBirth":" Paterson, New Jersey, USA","bio":"Richard Fire was born on November 12, 1945 in Paterson, New Jersey, USA. He was a writer and actor, known for Henry: Portrait of a Serial Killer (1986), The Borrower (1991) and E/R (1984). He died on July 8, 2015.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0278626","name":"Richard Fire","idIMDB":"nm0278626"},"actorId":"nm0278626","character":"Dr. Seaton","urlCharacter":"http://www.imdb.com/character/ch0175561","main":true},{"actorName":"Nathan Davis","urlProfile":"http://www.imdb.com/name/nm0205213","urlPhoto":"","biography":{"dateOfBirth":"22 May 1917","placeOfBirth":" Chicago, Illinois, USA","bio":"Nathan Davis was born on May 22, 1917 in Chicago, Illinois, USA. He was an actor, known for Risky Business (1983), Holes (2003) and Chain Reaction (1996). He was married to Metta Davis. He died on October 15, 2008 in Chicago.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0205213","name":"Nathan Davis","idIMDB":"nm0205213"},"actorId":"nm0205213","character":"Reverend Henry Kane","urlCharacter":"http://www.imdb.com/character/ch0062196","main":true},{"actorName":"Roger May","urlProfile":"http://www.imdb.com/name/nm0562116","urlPhoto":"","biography":{"bio":"Roger May is an actor, known for An Adventure in Space and Time (2013), Poltergeist III (1988) and Horatio Hornblower: The Duel (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0562116","name":"Roger May","idIMDB":"nm0562116"},"actorId":"nm0562116","character":"Burt","urlCharacter":"http://www.imdb.com/character/ch0175562","main":true},{"actorName":"Paul Graham","urlProfile":"http://www.imdb.com/name/nm0334245","urlPhoto":"","biography":{"bio":"Paul Graham is an actor, known for Poltergeist III (1988) and Pirate Movie (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0334245","name":"Paul Graham","idIMDB":"nm0334245"},"actorId":"nm0334245","character":"Martin Moyer","urlCharacter":"http://www.imdb.com/character/ch0175563","main":true},{"actorName":"Meg Weldon","urlProfile":"http://www.imdb.com/name/nm0919741","urlPhoto":"","biography":{"dateOfBirth":"May1969","placeOfBirth":" Winnetka, Illinois, USA","birthName":"Margaret Helen Weldon","bio":"Meg Weldon was born in May 1969 in Winnetka, Illinois, USA as Margaret Helen Weldon. She is an actress, known for Poltergeist III (1988) and Meet the Applegates (1990). She has been married to Daniel Wickstrom since December 9, 2000.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0919741","name":"Meg Weldon","idIMDB":"nm0919741"},"actorId":"nm0919741","character":"Sandy","urlCharacter":"http://www.imdb.com/character/ch0175564","main":true},{"actorName":"Stacy Gilchrist","urlProfile":"http://www.imdb.com/name/nm0318367","urlPhoto":"","biography":{"dateOfBirth":"April1970","placeOfBirth":" Buffalo Grove, Illinois, USA","birthName":"Stacy Anne Gilchrist","bio":"Stacy Gilchrist was born in April 1970 in Buffalo Grove, Illinois, USA as Stacy Anne Gilchrist. She is an actress, known for Poltergeist III (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0318367","name":"Stacy Gilchrist","idIMDB":"nm0318367"},"actorId":"nm0318367","character":"Melissa","urlCharacter":"http://www.imdb.com/character/ch0175565","main":true},{"actorName":"Joey Garfield","urlProfile":"http://www.imdb.com/name/nm0307274","urlPhoto":"","biography":{"bio":"Joey Garfield is an actor and director, known for Ferris Bueller's Day Off (1986), Poltergeist III (1988) and Breath Control: The History of the Human Beat Box (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0307274","name":"Joey Garfield","idIMDB":"nm0307274"},"actorId":"nm0307274","character":"Jeff","urlCharacter":"http://www.imdb.com/character/ch0175566","main":true},{"actorName":"Christian Murphy","urlProfile":"http://www.imdb.com/name/nm1281996","urlPhoto":"","biography":{"bio":"Christian Murphy is an actor, known for Poltergeist III (1988), Clinic E (1996) and Beyond Our Control (1968).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1281996","name":"Christian Murphy","idIMDB":"nm1281996"},"actorId":"nm1281996","character":"Dusty","urlCharacter":"http://www.imdb.com/character/ch0175567","main":true},{"actorName":"Roy Hytower","urlProfile":"http://www.imdb.com/name/nm0405338","urlPhoto":"","biography":{"bio":"Roy Hytower is an actor, known for U.S. Marshals (1998), Poltergeist III (1988) and Novocaine (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0405338","name":"Roy Hytower","idIMDB":"nm0405338"},"actorId":"nm0405338","character":"Nathan","urlCharacter":"http://www.imdb.com/character/ch0175568","main":true}],"seasons":[],"idIMDB":"tt0095889","urlIMDB":"http://www.imdb.com/title/tt0095889","business":{"budget":{"money":"$10,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$4,344,308","country":"USA","day":"10","month":"06","year":"1988","remarks":""}],"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1987/\">1987</a>"},{"money":"<a","country":"href=\"/date/03-15/\">15","day":null,"month":null,"year":"","remarks":"<a href=\"/date/03-18/\">18 March</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 38 min (98 min)"],"soundMix":["Dolby"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panaflex Camera and Lenses by Panavision"],"laboratory":["Technicolor"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"4.6","filmingLocations":[{"location":"Francis W. Parker School - 330 W. Webster Ave. Chicago, Illinois, USA"}],"rated":"PG-13","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1990","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Zelda Rubinstein","id":"nm0748289","role":null}]}]}]},{"award":"Razzie Awards 1989","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Supporting Actress","names":[{"name":"Zelda Rubinstein","id":"nm0748289","role":null}]}]}]}],"votes":"13,781","type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"}],"keywords":{"keywords":["mirror","building","gifted child","two way mirror","cracked mirror","father daughter relationship","brother sister relationship","aunt niece relationship","child","freezer","laughter","death","panic","scream","toy","life force","insanity","beast","alternate dimension","puddle","pursuit","search","guard","running","microphone","dimension","security","manifestation","swimming","monitor","surveillance camera","explosion","sprinkler","garage","fire","gasoline","preacher","medium","babysitter","school teacher","phonograph record","record player","teenage boy","icicle","maintenance man","sculpture","renovation","high rise","series","reference to pablo picasso","window cleaner","ice","hysteria","energy","anger","entity","airliner","rage","apparition","evil","ice skates","spirit","lake","classroom","tears","student","reference to houdini","doctor","school","escalator","flashlight","exhibit","japanese","clairvoyant","esp","blonde","fear","little girl","1980s","lifting someone into the air","urban setting","surrealism","haunting","afterlife","midget","psychic power","teenage girl","high school","uncle niece relationship","swimming pool","shower","psychologist","psychiatrist","possession","elevator","cousin cousin relationship","child in peril","art gallery","terror","supernatural power","revenge","good versus evil","ghost","demon","demonic possession","chicago illinois","bishop","apartment","girl","third part","psychic","skyscraper","hypnosis","sequel","old man","evil spirit","poltergeist"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:01:23"}}