{"data":{"movies":[{"title":"The Desert Fox: The Story of Rommel","originalTitle":"","year":"1951","releaseDate":"19511017","directors":[{"name":"Henry Hathaway","id":"nm0368871"}],"writers":[{"name":"Nunnally Johnson","id":"nm0425913"},{"name":"Desmond Young","id":"nm0949476"}],"runtime":"88 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTRiZDM1MTYtOGU2YS00YWJkLWFjNWMtYWJjOTNjNzhlY2VkL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjQzNDI3NzY@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Biography","Drama","War"],"plot":"This biopic follows Rommel's career after the Afrika Korps, including his work on the defenses of Fortress Europe as well as his part in the assassination attempt on Hitler, and his subsequent suicide.","simplePlot":"The story of the final years of the respected World War II German general, Erwin Rommel.","actors":[{"actorName":"James Mason","urlProfile":"http://www.imdb.com/name/nm0000051","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NDQxOTQzNl5BMl5BanBnXkFtZTYwNDAxMDI2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 May 1909","placeOfBirth":" Huddersfield, Yorkshire [now in Kirklees, West Yorkshire], England, UK","birthName":"James Neville Mason","height":"5' 11\" (1.8 m)","bio":"James Mason was a great English actor of British and American films. He was born in Yorkshire, and attended Marlborough and Cambridge, where he discovered acting on a lark, and abandoned a planned career as an architect. Following work in stock companies, he joined the Old Vic under the guidance of Sir Tyrone Guthrie and of Alexander Korda, who gave Mason at least one small film role in 1933, but fired him a few days into shooting. Mason remained in the theatre becoming a prominent stage actor, meanwhile getting first small, then rapidly larger roles in \"quota quickies\", minor films made to accommodate laws mandating a certain percentage of films shown in Britain to be British-made. Mason's talent for playing protagonists of a decidedly hard-bitten or melancholy stripe brought him from these minor films to a position as one of Britain's major film stars of the 1940s. When, late in that decade, he came to America, he played somewhat more glamorous or heroic roles than he had been accustomed to in Britain, but he remained a dynamic and intelligent force on the screen. His tendency to take any job offered led him to have many unworthy credits on his resume but, throughout his career, he remained a respected and powerful figure in the industry. His mellifluous voice and an uncanny ability to suggest rampant emotion beneath a face of absolute calm made him a fascinating performer to watch. He died of a heart attack in 1984 at his home in Switzerland.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NDQxOTQzNl5BMl5BanBnXkFtZTYwNDAxMDI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000051","name":"James Mason","idIMDB":"nm0000051"},"actorId":"nm0000051","character":"Field Marshal Erwin Johannes Rommel","urlCharacter":"http://www.imdb.com/character/ch0028619","main":true},{"actorName":"Cedric Hardwicke","urlProfile":"http://www.imdb.com/name/nm0362567","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNDcwNTYxNF5BMl5BanBnXkFtZTcwNTgwNjAxOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 February 1893","placeOfBirth":" Lye, Worcestershire, England, UK","birthName":"Cedric Webster Hardwicke","height":"5' 9\" (1.75 m)","bio":"Sir Cedric Hardwicke, one of the great character actors in the first decades of the talking picture, was born in Lye, England on February 19, 1893. Hardwicke attended the Royal Academy of Dramatic Art and made his stage debut in 1912. His career was interrupted by military service in World War I, but he returned to the stage in 1922 with the Birmingham Repertory Theatre, distinguishing himself as Caesar in George Bernard Shaw's Caesar and Cleopatra, which was his ticket to the London stage. For his distinguished work on the stage and in films, he was knighted by King George V in 1934, a time when very few actors received such an honor. Hardwicke first performed on the American stage in 1936 and emigrated to the United States permanently after spending the 1948 season with the Old Vic. Hardwicke's success on stage and in films and television was abetted by his resonant voice and aristocratic bearing. Among the major films he appeared in were Les Misérables (1935), Stanley and Livingstone (1939), The Hunchback of Notre Dame (1939), Suspicion (1941), A Connecticut Yankee in King Arthur's Court (1949), and The Ten Commandments (1956). His last film was The Pumpkin Eater (1964) in 1964. Cedric Hardwicke died on August 6, 1964 in New York City, New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNDcwNTYxNF5BMl5BanBnXkFtZTcwNTgwNjAxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0362567","name":"Cedric Hardwicke","nicknames":["Butch","Badger"],"idIMDB":"nm0362567"},"actorId":"nm0362567","character":"Dr. Karl Strolin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jessica Tandy","urlProfile":"http://www.imdb.com/name/nm0001788","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NjUyODQzNV5BMl5BanBnXkFtZTcwNzA5ODgwMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1909","placeOfBirth":" Stoke Newington, London, England, UK","birthName":"Jessie Alice Tandy","height":"5' 4\" (1.63 m)","bio":"A beloved, twinkly blue-eyed doyenne of stage and screen, actress Jessica Tandy's career spanned nearly six and a half decades. In that course of time, she enjoyed an amazing film renaissance at age 80, something unheard of in a town that worships youth and nubile beauty. She was born Jessie Alice Tandy in London in 1909, the daughter of Jessie Helen (Horspool), the head of a school for mentally handicapped children, and Harry Tandy, a traveling salesman. Her parents enrolled her as a teenager at the Ben Greet Academy of Acting where she showed immediate promise. She was 16 when she made her professional bow as Sara Manderson in the play \"The Manderson Girls\", and was subsequently invited to join the Birmingham Repertory Theatre. Within a couple of years, Jessica was making a number of other debuts as well. Her first West End play was in \"The Rumour\" at the Court Theatre in 1929; her Gotham bow was in \"The Matriarch\" at the Longacre Theatre in 1930; and her initial film role was as a maid in The Indiscretions of Eve (1932). Jessica married British actor Jack Hawkins in 1932 after the couple had met performing in the play \"Autumn Crocus\" the year before. They had one daughter, Susan, before parting ways after eight years of marriage. An unconventional beauty with slightly stern-eyed and sharp, hawkish features, she was passed over for leading lady roles in films, thereby focusing strongly on a transatlantic stage career throughout the 1930s and 1940s. She grew in stature while enacting a succession of Shakespeare's premiere ladies (Titania, Viola, Ophelia, Cordelia). At the same time, she enjoyed personal successes elsewhere in such plays as \"French Without Tears\", \"Honour Thy Father\", \"Jupiter Laughs\", \"Anne of England\" and \"Portrait of a Madonna\". And then she gave life to Blanche DuBois. When Tennessee Williams' masterpiece \"A Streetcar Named Desire\" opened on Broadway on December 3, 1947, Jessica's name became forever associated with this entrancing Southern belle character. One of the most complex, beautifully drawn, and still sought-after femme parts of all time, she went on to win the coveted Tony award. Aside from introducing Marlon Brando to the general viewing public, \"Streetcar\" shot Jessica's marquee value up a thousandfold. But not in films. While her esteemed co-stars Brando, Kim Hunter and Karl Malden were given the luxury of recreating their roles in Elia Kazan's stark, black-and-white cinematic adaptation of A Streetcar Named Desire (1951), Jessica was devastatingly bypassed. Vivien Leigh, who played the role on stage in London and had already immortalized another coy, manipulative Southern belle on celluloid (Scarlett O'Hara), was a far more marketable film celebrity at the time and was signed on to play the delusional Blanche. To be fair, Leigh was nothing less than astounding in the role and went on to deservedly win the Academy Award (along with Malden and Hunter). Jessica would exact her revenge on Hollywood in later years. In 1942, she entered into a second marriage with actor/producer/director Hume Cronyn, a 52-year union that produced two children, Christopher and Tandy, the latter an actor in her own right. The couple not only enjoyed great solo success, they relished performing in each other's company. A few of their resounding theatre triumphs included the \"The Fourposter\" (1951), \"Triple Play\" (1959), \"Big Fish, Little Fish (1962), \"Hamlet\" (he played Polonius; she played Gertrude) (1963), \"The Three Sisters (1963) and \"A Delicate Balance.\" They supported together in films too, their first being The Seventh Cross (1944). In the film The Green Years (1946), Jessica, who was two years older than Cronyn, actually played his daughter! Throughout the 1950s, they built up a sturdy reputation as \"America's First Couple of the Theatre.\" In 1963, Jessica made an isolated film appearance in Alfred Hitchcock's classic The Birds (1963). Low on the pecking order at the time (pun intended), Hitchcock gave Jessica a noticeable secondary role and Jessica made the most of her brittle scenes as the high-strung, overbearing mother of Rod Taylor who witnesses horror along the California coast. It was not until the 1980s that Jessica (and Hume, to a lesser degree) experienced a mammoth comeback in Hollywood. Alongside Hume she delighted movie audiences in such enjoyable fare as Honky Tonk Freeway (1981), The World According to Garp (1982), Cocoon (1985) and *batteries not included (1987). In 1989, however, octogenarian Jessica was handed the senior citizen role of a lifetime as the prickly Southern Jewish widow who gradually forms a trusting bond with her black chauffeur in the genteel drama Driving Miss Daisy (1989). Jessica was presented with the Oscar, Golden Globe and British Film Awards, among others, for her exceptional work in the film that also won \"Best Picture\". Deemed Hollywood royalty now, she was handed the cream of the crop in elderly film parts and went on to win another Oscar nomination for Fried Green Tomatoes (1991) a couple of years later. Jessica also enjoyed some of her biggest stage hits (\"Streetcar\" notwithstanding) during her twilight years, earning two more Tony Awards for her exceptional work in \"The Gin Game\" (1977) and \"Foxfire\" (1982). Both co-starred her husband Hume and both were beautifully transferred by the couple to television. Diagnosed with ovarian cancer in 1990, Jessica bravely continued working with Emmy-winning distinction on television. She died of her illness on September 11, 1994. Her last two films, Nobody's Fool (1994) and Camilla (1994), were released posthumously.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NjUyODQzNV5BMl5BanBnXkFtZTcwNzA5ODgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001788","name":"Jessica Tandy","idIMDB":"nm0001788"},"actorId":"nm0001788","character":"Frau Lucie Marie Rommel","urlCharacter":"http://www.imdb.com/character/ch0176054","main":true},{"actorName":"Luther Adler","urlProfile":"http://www.imdb.com/name/nm0012204","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2Mjk3MDIyMV5BMl5BanBnXkFtZTgwOTEwNDI2MTE@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 May 1903","placeOfBirth":" New York City, New York, USA","birthName":"Lutha Adler","height":"5' 7\" (1.7 m)","bio":"The actor and Broadvway director Luther Adler was born into a Yiddish theatrical dynasty. One of the six children born to Jacob P. and Sara Adler, he made his debut in the world in New York City on May 4, 1903, originally billed as Lutha J. Adler. His full siblings Charles, Jay, Julia, and Stella (the famous acting teacher) as well as his half-siblings Celia and Abram Adler all appeared on Broadway, and his father Jacob, the biggest star of the Yiddish-language theater, was considered one of the great American actors. The Yiddish theater was an important cultural venue in the days when the millions of Jewish immigrants in the greater metropolitan New York area spoke Yiddish as their first (and sometimes only) language. People who trained and appeared in the Yiddish theater were instrumental in the development of the modern American theater and film, and some, including Sidney Lumet, are still active in the 21st century. It was in this cultural milieu that Luther and his siblings got their grounding in acting and the theater. Jacob Adler owned and operated his own stage in New York's Lower East Side, and Luther began appearing in the family productions at the age of five with the Adler production of \"Schmendrick.\" He made his official debut as an actor at the age of 13 at his father's theater and his Broadway debut at the the age of 18.  Billed as Lutha Adler, he appeared in the Provincetown Players' production of Theodore Drieser's \"The Hand of the Potter\" in December 1921 at the Provincetown Playhouse, Adler's first Broadway hit was \"Humoresque\" in 1923, and he appeared regularly in top productions throughout the '20s, including \"Street Scene\" (1929) and \"Red Dust\" (1929). Along with his sister 'Stella Adler\", Luther Adler was one of the original members of the Group Theatre acting company, which was formed in 1931 by Harold Clurman (his future brother-in-law), Cheryl Crawford, and Lee Strasberg. Others who would make their bones in the company were Elia Kazan, Julius \"John\" Garfield, Howard Da Silva, Franchot Tone, John Randolph, Will Geer, Clifford Odets and Lee J. Cobb. The Group Theatre was dedicated to bringing realism to the American stage and was instrumental in introducing the Stanislavsky technique into American acting. Most members were leftists if not communists, and the collective wanted to produce plays dealing with social issues. For the Groupe Theatre, Adler appeared in \"Night Over Taos\" (1932), \"Success Story\" (1933), \"Alien Corn\" (1933) and two seminal works of the American stage written by Odets: \"Awake and Sing!\" (1935) and \"Golden Boy\" (1937). He played opposite leading ladies Katharine Cornell in \"Alien Corn\" (1933), his sister Stella in \"Gold Eagle Guy \"(1934), \"Awake and Sing!\" and \"Paradise Lost\" (both 1935), and Frances Farmer in \"Golden Boy\" (1937). His appearance as the urban ethnic boxer Joe Bonaparte in Odets' \"Golden Boy\" arguably was his greatest role, but when the film was made in 1939, he was passed over for the improbably cast Wlliam Holden, a white-bread WASP. Although Adler appeared in many motion pictures, his reputation would remain primarily that of a stage actor. Adler became a director on Broadway in 1942, though his first staging, \"They Should Have Stayed in Bed\", was a flop, lasting but 11 performances. He next directed Ben Hecht's pro-Israel propaganda play \"A Flag is Born\" in 1946, starring the great Paul Muni, a graduate of the Yiddish theater, and newcomer Marlon Brando, an Irish-American born-Protestant who had been trained by his sister Stella. The play, which raised money for Jewsh refugees from the Holocaust seeking sanctuary in Palestine, was a hit, running for 120 performances. He also directed \"Angel Street\" (1955) and \"A View from the Bridge\" (1960). He last appeared on Broadway as a replacement in the long running \"Fiddler on the Roof.\" Adler made his movie debut in 1937 with \"Lancer Spy,\" but he never became a star in that medium. His best roles like \"Golden Boy\" and \"Humoresque\" were taken by other actors, including Group Theatre alumnus John Garfield. He had memorable supporting turns in the noir classic \"D.O.A.\" (1950), in Joseph Losey's remake of \"M \"(1951), in Paul Muni's last film \"The Last Angry Man\" (1959), in the Holocaust drama \"The Man in the Glass Booth\" (1974), and as Paul Newman's mobster uncle in \"Absence of Malice\" (1981). He also worked frequently on television. From 1938 until 1947, Adler was married to the actress Sylvia Sidney. They had one child, a son, Jacob. Luther Adler died in Kutztown, Pennsylvania on December 8, 1984. He was 81 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2Mjk3MDIyMV5BMl5BanBnXkFtZTgwOTEwNDI2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0012204","name":"Luther Adler","idIMDB":"nm0012204"},"actorId":"nm0012204","character":"Adolf Hitler","urlCharacter":"http://www.imdb.com/character/ch0027857","main":true},{"actorName":"Everett Sloane","urlProfile":"http://www.imdb.com/name/nm0806041","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MTY1NzY2Ml5BMl5BanBnXkFtZTcwOTI5NDYwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1909","placeOfBirth":" New York City, New York, USA","height":"5' 7\" (1.7 m)","bio":"Everett Sloane, the actor most known for playing Mr. Bernstein in Orson Welles classic Citizen Kane (1941) as a member of Welles' Mercury Players, was born in New York, New York on October 1, 1909. Sloane was bitten by the acting bug quite early, and first went on-stage when he was seven years old. After high school, he attended the University of Pennsylvania but soon dropped out to pursue an acting career, joining a theatrical stock company. However, he was discouraged by poor personal reviews and returned to New York City, where he worked as a runner on Wall Street. After the Stock Market Crash of October 1929, Sloane turned to radio for employment as an actor. His voice won him steady work, and he even became the voice of Adolf Hitler on \"The March of Time\" serials. He made his Broadway debut in 1935 as part of George Abbott's company, in \"Boy Meets Girl,\" which was followed by another play for Abbott, \"All That Glitters\" in 1938. Eventually, he joined Welles' Mercury Theatre, appearing in the 1941 stage production of Richard Wright's \"Native Son,\" directed by Welles. However, before that Broadway landmark, Welles had cast Sloane as Mr. Bernstein in his first feature film, which ensured Sloane's immortality in the cinema. (Sloane would remain a Mercury Player until 1947, when he appeared as Bannister in Welles' The Lady from Shanghai (1947).) Outside his two memorable supporting roles for Welles, Sloane's reputation rests on his portrayal Walter Ramsey, a ruthless corporate executive trying to crush another executive, in the TV and screen versions of Rod Serling's Patterns (1956). According to Jack Gould's January 17, 1955, \"New York Times\" review of the TV program, which debuted on Ponds Theater (1953): \"In the role of Ramsey, Mr. Sloane was extraordinary. He made a part that easily might have been only a stereotyped 'menace' a figure of dimension, almost of stature. His interpretation of the closing confrontation speech was acting of rare insight and depth.\" Sloane was nominated for an Emmy in 1956 for the performance. In addition to his movie work, Sloane appeared extensively on TV as an actor, directed several episodic-TV programs, and did voice over work for the cartoon series The Dick Tracy Show (1961) and Jonny Quest (1964). Plagued with failing eye sight, a depressed Sloane quit acting and eventually took his life at the age of 55.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MTY1NzY2Ml5BMl5BanBnXkFtZTcwOTI5NDYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0806041","name":"Everett Sloane","idIMDB":"nm0806041"},"actorId":"nm0806041","character":"Gen. Wilhelm Burgdorf","urlCharacter":"http://www.imdb.com/character/ch0042426","main":true},{"actorName":"Leo G. Carroll","urlProfile":"http://www.imdb.com/name/nm0001991","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA3MzE0NDE3MF5BMl5BanBnXkFtZTcwNzA2MjYwOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 October 1886","placeOfBirth":" Weedon Bec, Northamptonshire, England, UK","birthName":"Leo Gratten Carroll","height":"5' 10\" (1.78 m)","bio":"One of the most indispensable of character actors, Leo G. Carroll was already involved in the business of acting as a schoolboy in Gilbert & Sullivan productions. Aged 16, he portrayed an old man in 'Liberty Hall'. In spite of the fact, that he came from a military family, and , perhaps, because of his experience during World War I, he decided against a military career in order to pursue his love of the theatre. In 1911, he had been a stage manager/actor in 'Rutherford and Son' and the following year took this play to America. Twelve years later, Leo took up permanent residence in the United States. His first performance on Broadway was in 'Havoc' (1924) with Claud Allister, followed by Noël Coward's 'The Vortex' (1925, as Paunceford Quentin). Among his subsequent successes on the stage were 'The Green Bay Tree' (1933) as Laurence Olivier's manservant, 'Angel Street' (aka 'Gaslight',1941) as Inspector Rough, and the 'The Late George Apley' (title role). The latter, a satire on Boston society, opened in November 1944 and closed almost exactly a year later. A reviewer for the New York times, Lewis Nichols, wrote \"His performance is a wonderful one. The part of Apley easily could become caricature but Mr.Carroll will have none of that. He plays the role honestly and softly.\" The play was filmed in 1947, with Ronald Colman in the lead role. Leo's film career began in 1934. He was cast, to begin with, in smallish parts. Sometimes they were prestige 'A pictures', usually period dramas, such as The Barretts of Wimpole Street (1934) and Wuthering Heights (1939). Leo was a consummate method actor who truly 'lived' the parts he played, and, as a prominent member of Hollywood's British colony, attracted the attention of Alfred Hitchcock. Indeed, the famous director liked him so much, that he preferred him to any American actor to play the part of a U.S. senator in Strangers on a Train (1951). A scene stealer even in supporting roles, Leo G. Carroll lent a measure of 'gravitas' to most of his performances, point in case that of the homicidal Dr. Murchison in Spellbound (1945) (relatively little screen time, but much impact !) and the professor in North by Northwest (1959). On the small screen, Leo lent his dignified, urbane presence and dry wit to the characters of Cosmo Topper and Alexander Waverly, spymaster and boss of Napoleon Solo and Ilya Kuryakin in The Man from U.N.C.L.E. (1964), the part for which he is chiefly remembered. Leo G. Carroll appeared in over 300 plays during his career and the stage remained his preferred medium. He once remarked \"It's brought me much pleasure of the mind and heart. I owe the theatre a great deal. It owes me nothing\" (NY Times, October 19,1972).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA3MzE0NDE3MF5BMl5BanBnXkFtZTcwNzA2MjYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001991","name":"Leo G. Carroll","idIMDB":"nm0001991"},"actorId":"nm0001991","character":"Field Marshal Gerd von Rundstedt","urlCharacter":"http://www.imdb.com/character/ch0015596","main":true},{"actorName":"George Macready","urlProfile":"http://www.imdb.com/name/nm0534317","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4OTQ1MzAyN15BMl5BanBnXkFtZTcwOTc3NTIxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 August 1899","placeOfBirth":" Providence, Rhode Island, USA","birthName":"George Peabody Macready Jr.","height":"6' 1\" (1.85 m)","bio":"George Macready--the name probably doesn't ring any bells for most but the voice would be unmistakable. He attended and graduated from Brown University and had a short stint as a New York newspaperman, but became interested in acting on the advice of colorful Polish émigré classical stage director Richard Boleslawski, who would go on to Hollywood to direct some notable and important films, including Rasputin and the Empress (1932)--the only film in which siblings John Barrymore, Ethel Barrymore and Lionel Barrymore appeared together--and Clive of India (1935) with Ronald Colman. Perhaps acting was meant for Macready all along--he claimed that he was descended from 19th-century Shakespearean actor William Macready. In 1926 Macready made his Broadway debut in \"The Scarlet Letter\". His Broadway career would extend to 1958, entailing 15 plays--mainly dramas but also some comedies--with the lion's share of roles in the 1930s. His Shakespearean run included the lead as Benedick in \"Much Ado About Nothing\" (1927), \"Macbeth\" (1928) and \"Romeo and Juliet\" (1934), with Broadway legend Katharine Cornell. He co-starred with her again in \"The Barretts of Wimpole Street\" and with with Helen Hayes in \"Victoria Regina\" twice (1936 and 1937). Macready's aquiline features coupled with distinctive high-brow bottom-voiced diction and superior, nose-in-the-air delivery that could be quickly tinged with a gothic menace made him perfect as the cultured bad guy. Added to his demeanor was a significant curved scar on his right cheek, remnant of a car accident in about 1919--better PR that it was a saber slash wound from his dueling days as a youth. He did not turn to films until 1942 and did not weigh-in fully committed until 1944, with a host of both well-crafted and just fair movies until the end of World War II. When he went all in, though, he excelled as strong-willed authoritarian and ambitious, murderous--but well-bred--villains. Among his better roles in that period were in The Seventh Cross (1944), The Missing Juror (1944), Counter-Attack (1945) and My Name Is Julia Ross (1945) with a young Nina Foch. Averaging six or more films per year throughout the 1940s, he appeared not only in dramas and thrillers, but also period pieces and even some westerns. His standout role, however--and probably the one he is best remembered for--was the silver-haired, dark-suited and mysteriously rich Ballin Mundson in Gilda (1946), who malevolently inserted himself into the lives of smoldering Rita Hayworth and moody Glenn Ford. By the early 1950s he had sampled the waters of early TV. He had many appearances on such anthology series as Four Star Playhouse (1952), The Ford Television Theatre (1952) and Alfred Hitchcock Presents (1955), among others. He became a familiar presence in episodic TV series beginning in 1954. He made the rounds of most of the hit shows of the period, including a slew of westerns, including such obscure series as The Texan (1958) and The Rough Riders (1958). He was familiar to viewers of crime dramas--such as Perry Mason (1957)--and such classic sci-fi and horror series as Thriller (1960), The Outer Limits (1963) and Night Gallery (1969). He did some 200 TV roles altogether, but still continued his film appearances. He assayed what many consider his best role as the ambitious French Gen. Paul Mireau, a fanatic and martinet whose lust for fame and glory leads to the deaths of hundreds of French soldiers in a senseless frontal attack on heavily fortified German lines in Stanley Kubrick classic antiwar film Paths of Glory (1957). Macready's performance stood out in a film brimming with standout performances, from such veterans as Kirk Douglas, Adolphe Menjou, Ralph Meeker and Timothy Carey. The film was even more striking when it turns out that it was based on a true incident. Macready stayed busy into the 1960s, mainly in TV roles. He had a three-year run as Martin Peyton in the hit series Peyton Place (1964), the first prime-time soap opera and a launching pad for many a young rising star of the time. His film roles became fewer, but there were some good ones--the Yul Brynner adventure period piece Taras Bulba (1962) and a meaty role as an advisor to US Prlesident Fredric March attempting to stop a coup by a right-wing general played by Burt Lancaster in the gripping Seven Days in May (1964). His next-to-last film appearance was as a very human Cordell Hull, Secretary of State, in Universal's splashy, big-budget but somewhat uneven story of Pearl Harbor, Tora! Tora! Tora! (1970). Another role that stands out in his career is a one-in-a-kind film which you would not expect to find George Macready--Blake Edwards' uproarious comedy -The Great Race (1965)_. Macready shined in one of the film's several subplots, this one a spoof of the \"Ruritanian\" chestnut \"The P Prizoner of Zenda\", in which the racers find themselves in the middle of palace intrigue in a small European monarchy. Macready played a general trying to stave off a coup by using Professor Fate (Jack Lemmon, who is a double for the drunken ruler. Macready held his own with such comedy veterans as Lemmon, Tony Curtis, Natalie Wood and a host of others. To top it of, Macready gets involved in one of the great pie fights in film history, and takes one right in the kisser! In real life George Macready was as cultured as he appeared to be on-screen. He was a well-regarded connoisseur of art, and he and a fellow art devotee--and longtime friend--opened a very successful Los Angeles art gallery together during World War II. As far as the villain roles went, Macready was grateful for the depth they allowed him through his years as both film and television actor. \"I like heavies,\" he once said, and to that he added with a philosophic twinkle, \"I think there's a little bit of evil in all of us.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4OTQ1MzAyN15BMl5BanBnXkFtZTcwOTc3NTIxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0534317","name":"George Macready","idIMDB":"nm0534317"},"actorId":"nm0534317","character":"Gen. Fritz Bayerlein","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Boone","urlProfile":"http://www.imdb.com/name/nm0095524","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE4Njk2MzMzOF5BMl5BanBnXkFtZTYwODEwMTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 June 1917","placeOfBirth":" Los Angeles, California, USA","birthName":"Richard Allen Boone","height":"6' (1.83 m)","bio":"Richard Allen Boone was born in Los Angeles, California, to Cecile Lillian (Beckerman) and Kirk Etna Boone, a wealthy corporate lawyer. His maternal grandparents were Russian Jewish immigrants, while his father was descended from a brother of frontiersmen Daniel Boone and Squire Boone. Richard was a college student, boxer, painter and oil-field laborer before ending up in the U.S. Navy during World War II. After the war he used the G.I. Bill to study acting with the Actor's Studio in New York. Serious and methodical, Boone debuted on Broadway in the play \"Medea\". Other plays followed, as did occasional TV work. In 1950 20th Century-Fox signed him to a contract and he made his screen debut in Halls of Montezuma (1951), playing a Marine officer. Tall and craggy, Boone was continually cast in a number of war and western movies. He also tackled roles such as Pontius Pilate in The Robe (1953) and a police detective in Vicki (1953). In 1954 he was cast as Dr. Konrad Styner in the pioneering medical series Medic (1954), which was a critical but not a ratings success. This role lasted for two years, but in the meantime, he continued to appear in westerns and war movies. In 1957 he played Dr. Wright, who treats Elizabeth for her memory lapses, in Lizzie (1957). It was also in that year that Boone was cast in what is his best-known role, the cultured gunfighter Paladin in the highly regarded western series Have Gun - Will Travel (1957). Although a gun for hire, Paladin was usually a moral one, did the job and lived at the Hotel Carlton in San Francisco. Immensely popular, the show made Boone a star. The series lasted six years, and in addition to starring in it, Boone also directed some episodes. He still kept busy on the big screen during the series' run, appearing as Sam Houston in the John Wayne epic The Alamo (1960), and as a weary cavalry captain fighting Indians in A Thunder of Drums (1961). After Have Gun - Will Travel (1957) ended in 1963, Boone hosted a dramatic anthology series, The Richard Boone Show (1963), but it was not successful. Boone moved to Hawaii for the next seven years. During this time he made a few Westerns, including the muscular Rio Conchos (1964), but he was largely absent from the screen. In the 1970s he moved to Florida, and resumed his film and TV career with a vengeance. In 1972 he again appeared on television in the Jack Webb-produced series Hec Ramsey (1972) (years before he had played a police captain in Webb's first \"Dragnet\" film, Dragnet (1954)). Based on a real man, Hec was a tough, grizzled old frontier sheriff at the turn of the 20th century who, late in life, has studied the newest scientific theories of crime detection. His new boss, a much younger man, doesn't always approve of Hec, his nonconformist style or his new methods. The series lasted for two years. Boone continued working until the end of the decade but died from throat cancer in 1981.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE4Njk2MzMzOF5BMl5BanBnXkFtZTYwODEwMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0095524","name":"Richard Boone","nicknames":["Dick"],"idIMDB":"nm0095524"},"actorId":"nm0095524","character":"Capt. Hermann Aldinger","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eduard Franz","urlProfile":"http://www.imdb.com/name/nm0291829","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MDcyMTk3MV5BMl5BanBnXkFtZTcwNTg1MDQxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1902","placeOfBirth":" Milwaukee, Wisconsin, USA","birthName":"Eduard Franz Schmidt","bio":"Born Eduard Franz Schmidt in Milwaukee, WI, this stern-faced character actor had originally planned to be a commercial artist, but a stint with a local theatrical troupe set him on the road to an acting career. In 1925 he moved to New York City and joined up with a Greenwich Village theatrical group. He returned to Wisconsin in the early 1930s and rejoined his old theatrical company, The Wisconsin Players. He accepted a position with the St. Louis Municipal Opera in 1944 and performed in many different operettas until 1947, when he headed to Hollywood. It didn't take him long to find work, and he was soon appearing in such films as The Magnificent Yankee (1950) and The Ten Commandments (1956), and even did a turn in an interesting low-budget horror flick, The Four Skulls of Jonathan Drake (1959). All through his film career, however, he kept his hand in the theater, and also had an extensive list of television credits.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MDcyMTk3MV5BMl5BanBnXkFtZTcwNTg1MDQxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0291829","name":"Eduard Franz","idIMDB":"nm0291829"},"actorId":"nm0291829","character":"Col. Klaus von Stauffenberg","urlCharacter":"http://www.imdb.com/character/ch0031768","main":true},{"actorName":"Desmond Young","urlProfile":"http://www.imdb.com/name/nm0949476","urlPhoto":"","biography":{"dateOfBirth":"1892","placeOfBirth":"","bio":"Desmond Young was born in 1892. He is known for his work on The Desert Fox: The Story of Rommel (1951). He died on June 27, 1966 in Sark, Channel Islands, UK.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0949476","name":"Desmond Young","idIMDB":"nm0949476"},"actorId":"nm0949476","character":"Himself, Lt. Col. Desmond Young","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0043461","urlIMDB":"http://www.imdb.com/title/tt0043461","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Copyright MCMLI by Twentieth Century-Fox Film Corporation - All Rights Reserved."},"technical":{"runtime":["1 hr 28 min (88 min)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Black and White (archive footage)","Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["2,494 m (9 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.0","filmingLocations":[{"location":"Yuma, Arizona, USA"}],"rated":"APPROVED","awards":[],"votes":"4,454","type":"Movie","companyCreditsSimple":[{"idCompany":"co0000756","name":"Twentieth Century Fox Film Corporation"}],"keywords":{"keywords":["assassination attempt","charged with treason","amphibious landing","naval bombardment","time bomb","reference to alexander von falkenhausen","reference to carl friedrich goerdeler","reference to ludwig beck","reference to hermann goering","reference to albert kesselring","north american b 25 mitchell","reference to carl heinrich von stulpnagel","aerial bombardment","reference to bernard montgomery","lockheed c 60a lodestar","mine detector","artillery barrage","battle of el alamein","thompson sub machine gun with box magazine","british commando","mediterranean sea","reference to dwight d. eisenhower","reference to winston churchill","tobruk","afrika corps","reference to goering","london england","british military","rhine river","nazi occupied france","eastern front","cherbourg normandy","beach landing","nazi germany","d day","reference to napoleon","tabletop map","reference to martin bormann","reference to heinrich himmler","stuttgart germany","iron cross","berlin germany","field marshal montgomery","military strategy","husband wife relationship","father son relationship","wehrmacht","prisoner of war","murder","plot to kill hitler","world war two","stauffenberg bomb plot"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 07:55:18"}}