{"data":{"movies":[{"title":"The Toy","originalTitle":"Le jouet","year":"1976","releaseDate":"19761208","directors":[{"name":"Francis Veber","id":"nm0891554"}],"writers":[{"name":"Francis Veber","id":"nm0891554"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MjM4MzQ4NF5BMl5BanBnXkFtZTgwMDAzODk1MDE@._V1.jpg","countries":["France"],"languages":["French"],"genres":["Comedy"],"plot":"When François, a journalist, is touring a big store for an article, he is chosen by the son of the owner, Rambal-Cochet, as his new toy. All afraid of the despotic industrialist who is also the newspaper's owner, François is forced to agree to this masquerade. Becoming the friend of the child, he induces him, who wants to make a newspaper, to unveil publicly the real tyrannical way of life of his father.","simplePlot":"When François, a journalist, is touring a big store for an article, he is chosen by the son of the owner, Rambal-Cochet, as his new toy. All afraid of the despotic industrialist who is also... ","actors":[{"actorName":"Pierre Richard","urlProfile":"http://www.imdb.com/name/nm0007069","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MTEyMjU2NF5BMl5BanBnXkFtZTYwNjYzMzU0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 August 1934","placeOfBirth":" Valenciennes, Nord, France","birthName":"Pierre-Richard Maurice Charles Léopold Defays","height":"5' 10\" (1.78 m)","bio":"Certainly one of France's supreme farceurs in the classic tradition, comedian Pierre Richard was born to an uppercrust family with an embarrassing riches of middle names as he was christened Pierre Richard Maurice Charles Leopold Defays. Working and building up his trade at the Paris Music Hall in the early years, he appeared in small movie roles thoughout most of the 60s. In the 70s, however, he aimed his genius directly towards film and succeeded beyond the wildest expectations. Directing and co-writing many of his slapstick vehicles, his characters often have taken on an hilariously guileless persona and, coupled with his innate gift for klutzy physical comedy, have become an audience favorite for nearly four decades. His superior work in The Daydreamer (1970) and The Troubles of Alfred (1972) was immediately recognized and this led to the international crossover hit The Tall Blond Man with One Black Shoe (1973) in which Richard played a naive, innocent concert musician plucked by chance to become a superspy on a top secret mission. A potent association in the 1960s and 1970s with actor/producer/director Yves Robert and the 1980s with writer/director Francis Veber and actor Gerard Depardieu produced several comedy classics: Alexander (1967), The Return of the Tall Blond Man with One Black Shoe (1974), The Goat (1981), Les Comperes (1983) and The Fugitives (1986). Many of Richard's classic comedies, including The Toy (1976), have spawned Hollywood remakes and imitations, though most pale compared to the originals.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MTEyMjU2NF5BMl5BanBnXkFtZTYwNjYzMzU0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0007069","name":"Pierre Richard","idIMDB":"nm0007069"},"actorId":"nm0007069","character":"François Perrin","urlCharacter":"http://www.imdb.com/character/ch0027590","main":true},{"actorName":"Michel Bouquet","urlProfile":"http://www.imdb.com/name/nm0099677","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTU1MTc0M15BMl5BanBnXkFtZTcwNjMwMjUxOQ@@._V1_UY44_CR20,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 November 1925","placeOfBirth":" Paris, France","height":"5' 7¾\" (1.72 m)","bio":"Michel Bouquet is an actor born in the 14th arrondissement of Paris on the 6 November 1925. His father, Georges Bouquet, was a World War One veteran and a wine-maker. His mother Marie was a milliner. He had three older brothers: Georges, Bernard and Serge. Michel's father was always a shadowy figure in his life: having been deeply affected by the war, he used to talk very little and developed a very distant and estranged relationship with his sons. When he was 7 years old, Michel was sent to the \"École Privée Catholique Fénelon\", a Catholic boarding school located inside a 17th century hunting lodge in Vaujours. He would keep very unpleasant memories of this period his entire life, describing it as \"seven years of darkness and loneliness\". Being used to receive corporal punishment or other cruel and unusual forms of penalty for absurd reasons -like keeping his arms crossed in a supposedly insolent way- and to be bullied by older boys, Michel chose to withdraw into himself and dream of exciting, picaresque adventures far away from the school. This approach to life would help him developing his trademark interiorized acting style. Repelled by studying, he actually used to enjoy being put in detention, so that he didn't have to mingle with the other boys: the adult Bouquet would later call his younger self \"a sweet kid with an anarchic touch\". In 1939, Michel came home for the summer with a mediocre school study certificate. He would however never return to the boarding school, since France and England declared war to Germany on the 3rd September. Georges Senior was immediately sent to the front and made a prisoner in Pomerania shortly after. Bernard went to war as well while Georges Jr. had already been sent to a religious school in Carthage. On the 14th June 1940 the German troops entered Paris and Marie soon decided to relocate to Lyon with her two remaining sons. They moved with Michel's paternal aunt, Marguerite. Marie didn't want to be a weight for her sister-in-law, so she spurred her sons to find some work to do. Michel became an errand boy in a bakery: having been toughened by his stay at the boarding school, he now felt ready to help his mother facing the adversities of life and raising the family. When the armistice between France and Germany was signed, Marie and her sons returned to Paris. Michel tried several new jobs in this period, including warehouseman, dental laboratory technician and delivery man in a bank. He was soon, however, to find his real vocation in life. Marie was a great theatre lover and had the habit to bring Michel to see operas, comic operas or great classic plays. He immediately realized that he wanted to be an actor when he saw the legendary Comédie-Française luminary Maurice Escande playing Louis XV in a stage production of \"Madame Quinze\". So, in May 1943, he decided to look Escande's address on the phone book and, on a Sunday morning, he went to visit him at his place while Marie was attending church. Young Bouquet introduced himself to the actor by telling him that he wanted to work on the stage. Escande asked him if he had memorized a piece to recite. Michel tried the nose monologue from \"Cyrano\", but the theatre veteran asked him if he hadn't learnt any other thing that suited his physical appearance better. So he started to recite a few verses from Alfred de Musset's \"La Nuit de Décembre\" instead. After hearing a couple lines only, Escande realized that the young man standing before him possessed enormous gifts and decided to immediately bring him to one of his classes at the Edouard-VII Theatre. There, Michel was allowed to finish the \"Nuit de Décembre\" monologue in a room full of people. Many students were ready to leave the class with a look of indifference, but Escande reproached them, telling them that they should have better listened to Michel and learnt a lesson from him. Although moved to tears, Michel managed to finish his piece. The great Maurice Escande had named him an actor. At the end of the lesson, Escande brought Michel home and convinced Marie that he had to pursue a stage career. Bouquet began to learn scenes from many important plays in order to be admitted to the CNSAD (the Paris Conservatoire). When the day of the exam at the Théâtre de l'Odéon finally came, he already knew that only 7 students out of 300 would have been accepted. For his test, he had studied the monologue from Alfred de Vigny's \"Chatterton\" and one of Smerdiakov's dialogues from Jacques Copeau's \"The Brothers Karamazov\". The same day, someone else was going to audition in front of the same jury: it was an elegant young man wearing camel, who possessed, in Bouquet's eyes, a certain charm à la Gary Cooper. It was the soon to become legendary Gérard Philipe, who had already made a couple of appearances in acclaimed stage productions and completed his first screen role in Les petites du quai aux fleurs (1944). He was going to play a scene from De Musset's \"Fantasio\". Bouquet immediately noticed that Philipe projected a great sense of self-confidence, something he himself had always lacked, since he had many perplexities about his physical appearance (he was skeletal at the time) and modest cultural background. At the exam, Philipe and Bouquet managed to scrape through as sixth and seventh respectively. Michel can't even remember who were the five students that were admitted before them, since their careers never went anywhere. He became the pupil of the accomplished stage actress Béatrix Dussane, who had heard some great things about him from Escande and used all of her powers to have him getting admitted. Bouquet's first stage roles were Damis in Molière's \"Tartuffe\" and Robespierre in Romain Rolland's \"Danton\". It was an interesting and indicative starting point to his career, considering that Molière is the author he will always be most associated with and that he would play \"The Incorruptible\" on several future occasions. After having played roles in \"Première Étape\" and \"Le Voyage de Thésée\", he made his first important professional encounter: writer and playwright Albert Camus had witnessed many of his auditions at the \"Théâtre de l'Odéon\" and he had been so impressed by his skills to offer him the role of Scipio in his upcoming production of \"Caligula\", which starred Philipe in the title role. Bouquet said that he could do 30 shows only, as he had already signed on to appear in a production of \"La Celestine\" under Jean Meyer's direction. Camus accepted his conditions since he wanted him to play the role so much. \"Caligula\" was the only Philipe-Bouquet collaboration, but Michel would go on to see Gérard on stage many times and always kept huge admiration for him along with very fond memories of their relationship. Bouquet's next stage credits were three Jean Anouilh plays directed by André Barsacq (who had personally recommended him to the author): the moderately successful, Shakespeare-inspired \"Romeo and Jeannette\", \"Le Rendez-Vous de Senlis\" and \"L'Invitation au château\". In the first one, Bouquet provided support to stage legends Jean Vilar and María Casares and the \"Combat\" critic wrote that he towered on the entire cast. Although he was initially irritated by a negative comment made by Michel about the pacing of the play, Anouilh went on to work with the actor on many other occasions. After having made his screen debut as an assassin in the obscure Brigade criminelle (1947), Bouquet was given the role of a tubercular patient in the acclaimed Monsieur Vincent (1947), which was scripted by the author. And a couple of years later, he found his first memorable screen role in another Anouilh-penned movie: Maurice, the twisted (but not evil at heart) brother of the title character in the suggestive and atmospheric Pattes blanches (1949), another remarkable entry by the talented, but often neglected Jean Grémillon. As his character is first seen walking the docks at night, one can already feel a great leading man \"allure\" à la Jean-Louis Barrault around the emaciated young actor. Interviewed in 2013, Bouquet still remembers this role as one of his favourites. The same year he appeared in Henri-Georges Clouzot's Manon (1949), which was diminished by Cécile Aubry's performance as the title heroine. For the rest of the 40's and entire 50's, Bouquet mainly kept collaborating on the stage with Anouilh, Camus and his former \"Romeo and Jeannette\" co-star Jean Vilar, who directed him in several productions, notably Shakespeare's \"Henry IV\" (as Prince Hal) and \"Richard II\" (as the Duke of Aumerie), Molière's \"Dom Juan\" (as Pierrot) and Georg Büchner's \"Danton's Death\" (as another prominent figure of the French Revolution, Saint-Just). Bouquet really liked Vilar for his talent to pick up his actors. He actually thought that an actor's director should be a person with a great eye for spotting talent and the skill to cast the right person in the right role, but that his input should end there. He didn't enjoy to have his directors telling him to play a part or trying to over-impose their view on the character upon his own. That never happened with Vilar. Anouilh wrote another great role for Bouquet in 1956: the title character in \"Pauvre Bitos ou le Dîner de têtes\". Bitos is a poor man's Robespierre, a little politician in Post-war France who wants to obtain power even if he doesn't possess the means to do it. The author had created the role specifically for the actor because he had expressed the interest to play \"the Incorruptible\" once more. In 1951, Bouquet was also seen as Dany Robin's opportunistic brother (again called Maurice) in Anouilh's second (and final) directed feature, Deux sous de violettes (1951), a (mostly) cynical, anti-bourgeois drama. His other film roles from this period include the dim-witted King Louis X in the Dumas adaptation Tower of Lust (1955) and a Russian revolutionary in the Romy Schneider vehicle Adorable Sinner (1959). He also borrowed his incredible voice to Alain Resnais's hugely acclaimed Holocaust documentary Night and Fog (1956). On the Parisian stage, he tried his hand at directing: first it was a production of \"Chatterton\" (where he starred with his wife of the time, Ariane Borg), then a revival of George Bernard Shaw's \"Heartbreak house\" (where Borg was co-director). The shows weren't lauded and he never tried to follow this path again. In TV, he was finally allowed to play Robespierre again in an episode of Stellio Lorenzi's historical series, La caméra explore le temps (1957). The program was focused on the trial of Marie Antoinette and Bouquet's screen time was consequently limited, but there's still enough ground to make a case about the actor being the definitive incarnation of the complex French politician. Bouquet had always been fascinated with the character, imagining him as constantly living in a state of great anguish and anxiety since he probably thought not to possess the cunning of a Mirabeau or the orator skills of a Danton and knew that everyone in those times was expendable. Sympathizing with what \"the Incorruptible\" must have been feeling in his short, turbulent life, Bouquet created a well-rounded and appropriately indecipherable figure, finding the perfect balance between the cover of impassibility and the neurotic nature of the character. In addition to this, he played the ill-fated King Charles I and Napoleon's jailer, Sir Hudson Lowe, in his two other appearances in Lorenzi's program. Bouquet's stage work kept offering him a lot of professional satisfactions in the 60's: he expanded his repertoire to 'Eugene Ionesco''s Theatre of the Absurd (his association with the author will also be career-defining) and to several other authors. He was now living an important phase in the history of French theatre, as it was during those years that the stars of the Parisian stage were beginning to discover the great English-language playwrights. In 1965, productions of Harold Pinter's \"The Lover\" and \"The Collection\" were staged simultaneously and featured the same, exceptional trio of stars, as Bouquet was teamed up with the brilliant Jean Rochefort and the sublime Delphine Seyrig. Still, it was rare for Michel to feel completely fulfilled, neither in his professional or personal life. His marriage with Ariane had been a mistake (as she had proved, according to his recollections, to be a gold-digging harpy) and he had never managed to re-establish any emotional connection with his father since he had returned from the front. A great perfectionist, he also used to have an unreasonable lot of quarrels with his own performances: he felt that his rather ordinary appearance and modest height didn't give him enough 'gravitas' to be a great dramatic actor, was equally skeptical about the quality of his comedic turns and believed that his talents were probably better suited to a genre in the middle, \"the dramatic comedy\". He often helped himself to get past these dark moments with big quantities of alcohol. One day, after a performance of \"The Collection\", a single meeting would make his existence change for the better: stage actress Juliette Carré approached him to pay a lot of sincere and heartfelt compliments to his acting in the play. Shortly after, Michel put an end to his marriage with Ariane and, even if it would take years to get an official divorce, he immediately started a family with Juliette and the two sons she had from a previous relationship, Frédéric and Sylvie. Juliette proved to be the perfect mate for Michel in life- as she could understand his introverted nature and accept that he was a solo player- and ideal sparring partner on the stage. He stated himself that he never felt so much at ease at playing opposite anyone as he did with her. In 1965, Bouquet played both on stage and TV a third important member of the French Revolution: Fouquier-Tinville in L'accusateur public (1965). But his golden period as a film actor was about to start. His juicy role as a perverse abbey in Les amitiés particulières (1964) had already raised his interest in cinema. Now, two of the most representative directors of the French New Wave were to cross their paths with his. His performance as the chief villain in Le Tigre se parfume à la dynamite (1965) marked his first collaboration with Claude Chabrol. Unfortunately the film belongs to the long list of bad titles the director did for rather obscure reasons. Bouquet and Chabrol's next journey together was equally unexciting as the thespian's comedic skills were wasted in the supposedly ironic spy story La route de Corinthe (1967), a sub-par product not much dissimilar from the silliest episodes of The Avengers (1961) and The Man from U.N.C.L.E. (1964). Luckily, the two men would soon team up again for a better cause. In the mean time, Bouquet kept himself busy by appearing in a couple movies made by the way more consistent François Truffaut. In 1968 he played the role of Coral in The Bride Wore Black (1968) opposite the great Jeanne Moreau in one of her signature roles. The unforgettable masterpiece that would inspire Quentin Tarantino's \"Kill Bill\" movies sees Moreau's Julie Kohler eliminating with extreme prejudice all the men responsible for the death of her husband. As the second target, Bouquet is the male actor who shines the most. Truffaut enjoyed mocking the actor's melancholic/tormented characterization of Coral, thinking that he should have been more casual and less serious. So he decided to play a mean prank on him when he called him back one year later to support Jean-Paul Belmondo and a mono-expressive Catherine Deneuve in the fine Mississippi Mermaid (1969). Bouquet has a couple of scenes in the film as the implacable sleuth Comolli. On the morning of the shooting, he found out that Truffaut had completely changed all his dialogue, something that took him completely off guard. This didn't prevent him from making the most of his little screen time anyway. The same year, he would also find one of his most iconic roles in one of Chabrol's best movies, La femme infidèle (1969). It was the first time he was paired with the director's glacial wife and muse, Stéphane Audran. Like in the case of every other Chabrol-Bouquet-Audran collaboration, Michel provided the acting, while Stéphane just added her very beautiful (but equally motionless) face to the proceedings. Known for his explosive presence on the stage, Bouquet favoured, as a film actor, a performing style all about subtleties and psychological introspection: he once said that \"stage acting is like the work of an ascensionist; screen acting is like the work of a speleologist\". Belonging to that rare breed of actors à la Jean-Louis Trintignant, able to express a world of emotions by simply raising an eyebrow, Bouquet gave a superlative performance as cuckolded husband Charles Desvallees in Chabrol's classic, making his transaction from boring bourgeois type to passionate murderer well-timed, impeccably constructed and absolutely believable and managing at the same time to inject enough humour into his characterization to make the role somehow sympathetic. Chabrol had written the role specifically for him and Bouquet got to admire his working method enormously, later calling him a great actor's director and crediting him for having offered him the possibility to give one of his best performances. Audran's ice maiden act proved somewhat functional to the nature of her character (the bored and adulterous Hélène) and she didn't ruin the movie this time around. The same can't unfortunately be said about the trio's next collaboration, the uneven The Breach (1970). As ex-dancer Hélène Régnier, Stéphane gave one of her very worst performances, walking through the movie without showing any trace of emotion not even when witnessing her little son being thrown around the room by her mentally deranged husband or waiting for the doctors to tell her about his condition. Michel (as Hélène's father-in law Ludovic, a despicable man ready to do everything to prevent her from getting custody of the child), Jean-Pierre Cassel (in the thankless, psychologically absurd role of private eye Paul Thomas) and frequent Chabrol collaborators and great actors Jean Carmet and Michel Duchaussoy formed the rescue team that should have made up for the huge void at the centre of the movie, but the flawed screenplay was conspiring against the success of 'La Rupture' as much as Audran's performance and the end result was rather disappointing. Bouquet's film career had now taken full flight and, between 1970 and 71, he found several roles that truly showcased his talents. He played a ruthless inspector avenging the death of his partner in The Cop (1970) and a mobster lawyer in the Jean-Paul Belmondo-Alain Delon collaboration Borsalino (1970) (although his role was largely left in the editing room when the movie was originally released, something that made him very distrustful of commercial cinema). One year later, he played a slimy sycophant in Harry Kümel's authorial horror Malpertuis (1971) and found an even better role in another remarkable revenge movie, Countdown (1971). The movie is centered around Serge Reggiani's character, a criminal who, after his release from prison, plans to get revenge on his former associates for having betrayed him. The spectacular supporting cast includes Bouquet, Jeanne Moreau, Simone Signoret and Charles Vanel. Michel got to play the lion's role as a one-eyed villain, constantly wearing black, involved in a mental game of chess with Reggiani for the entire movie. Similarities with 'La Mariée était en noir' are strong and made even more evident by the presence of Moreau and Bouquet. Michel rounded off the year by giving outstanding performances in two Molière plays for TV, Tartuffe (1971) (where he was perfectly matched scene by scene by Delphine Seyrig) and Le malade imaginaire (1971), and playing another of his best film roles, Charles Masson in the vintage Chabrol Just Before Nightfall (1971). The movie is arguably the director's deepest and most complex reflection about the twisted, dark urges hidden in the meanders of human psyche, as repressed bourgeois Charles kills his lover for apparently no reason. Bouquet was simply mesmerizing in the part and owned every celluloid frame of the movie, making the viewer feel the character's torment on every moment and perfectly follow his inner path (from his sense of guilt to his desire to be punished): all of this in the subtlest, least showy way as possible. As his wife Hélène, Audran did near to nothing in the film: in the scene where Bouquet confesses his crime to her, Chabrol just filmed her reaction from behind (therefore releasing her from any acting duty) and, when he has his thrilling final monologue about his wish to atone, she just listens to him, completely frozen, and restricts herself to put a hand on her mouth once he announces his intention to give himself up. \"Juste avant la nuit\" was released in the UK only in 1973 and BAFTA hit an all-time low by ignoring Bouquet's performance, but bestowing a Best Actress Award to Audran for her minimal work in the movie added to her supporting turn in The Discreet Charm of the Bourgeoisie (1972) (where she was easily the least talented main player). Galvanized by the quality of his recent body of film work, Bouquet took a 5 years break from the stage (the longest he ever did) to do more movies. Unfortunately, most of the roles he found in this period proved totally unworthy of his skill: Bons baisers... à lundi (1974) (one of Michel Audiard's several dismal attempts at directing) was particularly unremarkable. Nadine Trintignant's Défense de savoir (1973) put together such wonderful performers as Bouquet, Jean-Louis Trintignant, Bernadette Lafont, Juliet Berto and Charles Denner and couldn't make an interesting use of any of them. It was clear to Michel that things couldn't go on like this and that's the reason he headed back to theatre so soon. His other film roles that stand out in the 70's are a detestable policeman in Two Men in Town (1973) with Delon and Jean Gabin, a ruthless newspaper director and unsentimental father in The Toy (1976), a sculptor pretending to go blind in Vincent mit l'âne dans un pré (et s'en vint dans l'autre) (1975) and particularly a drug lord in Alain Corneau's bizarre, but ultimately involving sci-fi feature, France société anonyme (1974). Despite having always publicized his lack of athletic skills, he gave a great lesson in physical acting in the latter. He also started to direct his talents towards the small screen and Gabriel Axel offered him the possibility of giving two particularly memorable performances. The first was as painter Rembrandt van Rijn in La ronde de nuit (1978). The second was in the Balzac adaptation Le curé de Tours (1980) as the backstabbing Abbey Troubet, a vile man who ruins the life of Jean Carmet's passive title character with the help of a deliciously serpentine Suzanne Flon. He also appeared in Les nuits révolutionnaires (1989) (a mini-series set during the French Revolution) and played Ebenezer Scrooge in a 1984 version of \"A Christmas Carol\", winning a 7 d'or (a French Emmy) for his performance. His stage work from the 80's include playing Harpagon in \"the Miser\"- which invited the comment 'Whoever hasn't seen Bouquet in The Miser hasn't seen The Miser'- and appearing in a Chabrol-directed production of Strindberg's \"The Dance of Death\", which was later filmed. A stage production of \"Macbeth\" opposite his wife was very unsuccessful and he bode farewell to Shakespeare for good. Bouquet's most important film achievement from this decade is undoubtedly playing the immortal role of Inspector Javert in Robert Hossein's Les misérables (1982) (released both as a 4 part mini-series and feature film). Although this version (like nearly every other) couldn't completely do justice to the spirit of Hugo's novel, the portrayals of the main characters are arguably definitive, from Lino Ventura's interpretation of Jean Valjean to Jean Carmet's César-winning performance as Thénardier and of course Bouquet's ascension to King of Javerts. Michel was fiercer and more menacing than Charles Vanel in the 1934 version, possessed the \"physique du rôle\" that the larger than life Charles Laughton lacked in the 1935 film, was infinitely subtler than the likes of Hans Hinrich and Robert Newton were in their respective outings, had more scope to express himself than the well-cast Anthony Perkins and Geoffrey Rush had in their mediocre vehicles and any comparison between his work and Russell Crowe's acting/singing performance in the 2012 musical would almost be sadistic. Many people in France strictly associate Bouquet with this part. His second most notable film role from the 80's is a creepy notary in Chabrol's poorly paced and constructed Poulet au vinaigre (1985), which was Jean Poiret's first outing as Inspector Lavardin. Apart from acting, Bouquet was very busy teaching the craft at the CNSAD during those years. Despite his modest studies, he had gradually become an immensely cultured man within the decades, having traveled a lot and grown a great interest towards literature, music and the figurative arts. These interests were also the reason that lead him to play real-life artists on several occasions. Bouquet was seldom seen on the silver screen in the 90's, but, when he was, he most certainly lingered in memory. In 1991 he appeared in the much lauded Toto le héros (1991) as the oldest incarnation of the title character. The movie starts with little Thomas dealing with all the adversities of life by dreaming of an alter ego living all kinds of exciting adventures (something reminiscent of what Michel himself had gone through during his childhood) to eventually see him turning into an unhappy, disenchanted man ready to do the most extreme and unimaginable thing to get even with the rival of a lifetime. Bouquet also borrowed his voice to actor Jo De Backer, who played his younger adult self. His performance helped him cementing his status as a crucial figure of European cinema and won him the EFA (European Film Award) for Best Actor. The same year he also played painter Laubin Baugin in Corneau's best movie, Tous les matins du monde (1991), while in 1993 he narrated Chabrol's well-made documentary L'oeil de Vichy (1993) (a compilation of official newsreels originally broad casted in Nazi-occupied France). Bouquet's theatre highlights from this period include playing for the first time King Bérenger I in Ionesco's \"Exit the King\" (his portrayal of the character remains one of his most celebrated triumphs) and appearing alongside the great Philippe Noiret in Bertrand Blier's \"Les Côtelettes\". His performance in this play won him his first Molière (France's prestigious stage award founded in 1987). Even greater things were waiting for Bouquet in the 2000s: he accepted very few roles, but they were the best any actor could dream of. Having seen a performance of \"Les Côtelettes\" on the Parisian stage, Italian novelist and occasional director Roberto Andò chose him to play the role of writer Tomasi di Lampedusa in his very interesting feature The Prince's Manuscript (2000). Having now reached the apex of his acting technique and maturity, Bouquet gave the first of a series of absolutely essential performances. Although he somehow regretted that he couldn't cast an Italian actor in the role, Andò stated that he couldn't possibly imagine the Lampedusa role played by anyone else. In 2001, Bouquet was given the complex, multi-dimensional role of estranged father Maurice in Anne Fontaine's noteworthy How I Killed My Father (2001). Michel had a great understanding of the central relationship between his own character and Charles Berling's bitter son as it mirrored in some ways the one he had with his own father, to whom he had started to feel a bit closer long after his death. Inspired by Fontaine's direction (he credits her for having taught him a more relaxed approach to characters), the actor gave life to a rather sinister, but eventually very poignant figure. At age 76 he was nominated for his first César and won it. In 2003, Blier turned his stage success into a major feature with Les côtelettes (2003) and recast Noiret and Bouquet in their original roles, a man who has trouble defecating and a mysterious character who must help him doing it. Although the movie is pretentious and often off-colour, the central performances of the two acting giants are all to be savored. Michel's next film appearance was as the title role in L'après-midi de monsieur Andesmas (2004), an adaptation of the Marguerite Duras novel by the same name. He was already familiar with the text, but he had always found it to be a bit unclear, albeit impressive. He had, however, far less difficulties in penetrating the deeper meanings of the story once he read the script by the movie's director, Michelle Porte, who had started her career as a second assistant director to Duras herself in Baxter, Vera Baxter (1977). The film follows Monsieur Andesmas, who has just bought a house for his daughter, as he waits for the arrival of a mysterious businessman, Michel Arc, who never shows up. This shadowy character can be interpreted as a representation of many things: Bouquet saw him as an emissary of death as he imagined Monsieur Andesmas' afternoon to be his last one. The actor had all the vital characteristics of the quintessential Duras protagonist, being multi-layered, introvert and provided with the impeccable diction and thousand vocal inflections that are indispensable to give power to the great author's affecting, literary lines of dialogue. Aided by an excellent Miou-Miou as Michel Arc's wife, he gave one of his most touching performances and one that appears to follow a recent pattern: all his latest movies seem to deal with the theme of the end of life, either in an explicit or a veiled way. He carried on this tradition when he next appeared in The Last Mitterrand (2005), playing President Mitterrand when death's approaching him. An unusually good biopic, the film showed a more private dimension and different image of Mitterrand, so that Bouquet didn't really have to live up to people's common perception of the President: consequently, he managed to give a very complex and involving portrayal of a man opposed to the sheer exercise in mimicry and acting virtuosity that one usually expects from this kind of picture. Again he was heart-breaking, again he received a César nomination and again he won. After this new triumph, Bouquet grew more and more selective of film roles, basically declining every script that was sent to him. Like in the case of Mesdames Fontaine and Porte, it was again a duo of female directors, Swiss actresses Stéphanie Chuat and Véronique Reymond, to win his attention. Having eventually managed to find Bouquet's phone number (he doesn't have an agent), the two girls offered him the leading male role in their debut feature film, the little gem The Little Bedroom (2010). Bouquet adored the script and was pleasantly surprised that such young ladies could have written a story that was such a beautiful reflection on old age. He consequently played the role of Edmond, a sad, lonely man who gets treated with neglect by his son and progressively develops a warm relationship with his carer (Florence Loiret Caille). He again put body and soul in a project meant to give dignity to the last days on earth of a common man. During the course of the decade, Bouquet also kept to assiduously work on the stage, notably in revivals of \"Exit the King\", \"The Imaginary Invalid\" and the \"Miser\", all directed by Jacques Werler. He received splendid support by wife Juliette in the first two, which were filmed. His incredible performance as Bérenger in the Ionesco play will forever help people who never had the honor of seeing him on the stage to understand what kind of chameleon he was as a theatrical actor. He won his second Molière for his work in this production. Still going strong, Bouquet was last seen on the silver screen as Pierre-Auguste Renoir in Renoir (2012), an account of the relationship between the great painter and his son Jean, the future genius of cinema. Michel thought that Gilles Bourdos's script possessed the necessary grace to speak about some rather obscure themes. He had always considered painting the most sublime of arts and, while studying the Renoir character, he found himself relating to his \"nature-immersed\" side above all. Although not as Bouquet-centered as one would have wished it to be, the film still offered the great thespian the possibility to shine and won him a third César nomination for Best Actor. In addition to this, director Élie Chouraqui recently announced his intention to adapt for the screen Fabrice Humbert's novel 'L'Origine de la Violence' with Bouquet in the role of the protagonist's grandfather. It's certainly something to look forward. Despite having announced his retirement from the stage world in 2011, Bouquet couldn't keep his word, as his bond to the theatre in general and 'Exit the King' in particular proved to be just too strong: in 2013 he did a special performance of the play during the prestigious Ramatuelle festival and, in early 2014, brought the production back to the Parisian stage for a limited season. Now a veritable national treasure of France, Michel Bouquet can consider himself proud and satisfied of his career like very few can. Probably no other actor of his generation could find equally memorable film roles in the new millennium. Having appeared in at least one play a year in the 70 years period between 1944 and 2014 (with very few breaks in between), he has put together one of the most impressive stage resumes ever. And not many can say to be as respected as he is by the public, the critics and their peers. Those who never had the possibility to see the master thespian on the stage will probably be left with a bitter regret, but, considering that he still doesn't appear ready to say goodbye to the planches for good, they may still have a chance.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTU1MTc0M15BMl5BanBnXkFtZTcwNjMwMjUxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0099677","name":"Michel Bouquet","idIMDB":"nm0099677"},"actorId":"nm0099677","character":"Pierre Rambal-Cochet","urlCharacter":"http://www.imdb.com/character/ch0280072","main":true},{"actorName":"Fabrice Greco","urlProfile":"http://www.imdb.com/name/nm0337451","urlPhoto":"","biography":{"bio":"Fabrice Greco is an actor, known for The Toy (1976) and Les Jouets du Président (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0337451","name":"Fabrice Greco","idIMDB":"nm0337451"},"actorId":"nm0337451","character":"Eric Rambal-Cochet","urlCharacter":"http://www.imdb.com/character/ch0025160","main":true},{"actorName":"Jacques François","urlProfile":"http://www.imdb.com/name/nm0291979","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjVmN2ViMDMtMzdkOC00OGEyLWJiNDctNDI5MmIzOGZmMzE5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1920","placeOfBirth":" Paris, France","birthName":"Henri Jacques Daniel Paul François","bio":"Jacques François was born on May 16, 1920 in Paris, France as Henri Jacques Daniel Paul François. He is known for his work on The Day of the Jackal (1973), The Toy (1976) and The Troops & Troop-ettes (1982). He was married to Madeleine Delavaivre. He died on November 25, 2003 in Paris.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjVmN2ViMDMtMzdkOC00OGEyLWJiNDctNDI5MmIzOGZmMzE5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0291979","name":"Jacques François","idIMDB":"nm0291979"},"actorId":"nm0291979","character":"Blénac","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Daniel Ceccaldi","urlProfile":"http://www.imdb.com/name/nm0147561","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDhlYzc5MGItNTIyYy00OGI2LTk1MDctNmQ3ZmE2NmRmNTQ5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 July 1927","placeOfBirth":" Meaux, Seine-et-Marne, France","birthName":"Daniel Jacques Ceccaldi","bio":"Daniel Ceccaldi was born on July 25, 1927 in Meaux, Seine-et-Marne, France as Daniel Jacques Ceccaldi. He was an actor and writer, known for The Soft Skin (1964), Stolen Kisses (1968) and Chloe in the Afternoon (1972). He died on March 27, 2003 in Paris, France.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDhlYzc5MGItNTIyYy00OGI2LTk1MDctNmQ3ZmE2NmRmNTQ5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0147561","name":"Daniel Ceccaldi","idIMDB":"nm0147561"},"actorId":"nm0147561","character":"Le père de famille","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Gérard","urlProfile":"http://www.imdb.com/name/nm0350785","urlPhoto":"","biography":{"dateOfBirth":"1 December 1926","placeOfBirth":" Marseille, Bouches-du-Rhône, France","birthName":"Naubar Agjenor","bio":"Charles Gérard was born on December 1, 1926 in Marseille, Bouches-du-Rhône, France as Naubar Agjenor. He is an actor and director, known for Happy New Year (1973), The Crook (1970) and The Toy (1976).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0350785","name":"Charles Gérard","nicknames":["Charlot"],"idIMDB":"nm0350785"},"actorId":"nm0350785","character":"Le photographe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michel Aumont","urlProfile":"http://www.imdb.com/name/nm0042104","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjY2NTUxM15BMl5BanBnXkFtZTYwNDk4NTg3._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 October 1936","placeOfBirth":" Paris, France","bio":"Michel Aumont was born on October 15, 1936 in Paris, France. He is an actor, known for Un dimanche à la campagne (1984), The ComDads (1983) and Le placard (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjY2NTUxM15BMl5BanBnXkFtZTYwNDk4NTg3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0042104","name":"Michel Aumont","idIMDB":"nm0042104"},"actorId":"nm0042104","character":"Le directeur du magasin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Suzy Dyson","urlProfile":"http://www.imdb.com/name/nm0246052","urlPhoto":"","biography":{"bio":"Suzy Dyson is an actress, known for The Toy (1976), Les grandes conjurations: Le coup d'état du 2 décembre (1979) and Le journal (1979).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0246052","name":"Suzy Dyson","idIMDB":"nm0246052"},"actorId":"nm0246052","character":"Madame Rambal-Crochet","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gérard Jugnot","urlProfile":"http://www.imdb.com/name/nm0432040","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNTgzMTI0OF5BMl5BanBnXkFtZTcwMjc4MDEwMg@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 May 1951","placeOfBirth":" Paris, France","height":"5' 7\" (1.7 m)","bio":"Gérard Jugnot was born on May 4, 1951 in Paris, France. He is an actor and writer, known for The Chorus (2004), Faubourg 36 (2008) and Une époque formidable... (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNTgzMTI0OF5BMl5BanBnXkFtZTcwMjc4MDEwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0432040","name":"Gérard Jugnot","idIMDB":"nm0432040"},"actorId":"nm0432040","character":"Pignier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michel Robin","urlProfile":"http://www.imdb.com/name/nm0732220","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQ1NTUxOTg3OV5BMl5BanBnXkFtZTcwMDY0MzU5Ng@@._V1_UY44_CR21,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1930","placeOfBirth":" Reims, Marne, France","birthName":"Michel Jacques François Robin","bio":"Michel Robin was born on October 13, 1930 in Reims, Marne, France as Michel Jacques François Robin. He is an actor, known for Amélie (2001), A Very Long Engagement (2004) and Farewell, My Queen (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQ1NTUxOTg3OV5BMl5BanBnXkFtZTcwMDY0MzU5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0732220","name":"Michel Robin","idIMDB":"nm0732220"},"actorId":"nm0732220","character":"Le domestique","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michèle Sand","urlProfile":"http://www.imdb.com/name/nm0761187","urlPhoto":"","biography":{"bio":"Michèle Sand is an actress, known for The Toy (1976), Don Juan (Or If Don Juan Were a Woman) (1973) and And Now My Love (1974).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0761187","name":"Michèle Sand","idIMDB":"nm0761187"},"actorId":"nm0761187","character":"Nicole Perrin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alix Mahieux","urlProfile":"http://www.imdb.com/name/nm0536929","urlPhoto":"","biography":{"bio":"Alix Mahieux is an actress and writer, known for The Discreet Charm of the Bourgeoisie (1972), Le fantôme de la liberté (1974) and The Toy (1976). She was previously married to André Cerf.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0536929","name":"Alix Mahieux","idIMDB":"nm0536929"},"actorId":"nm0536929","character":"La gouvernante","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lyne Chardonnet","urlProfile":"http://www.imdb.com/name/nm0152820","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NjY4NTQ1NF5BMl5BanBnXkFtZTgwNjc0NTM1NTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1943","placeOfBirth":" Paris, France","birthName":"Lyne Catherine Jeanne Chardonnet","bio":"One could have thought Lyne Chardonnet had been blessed by the gods and would live a long successful happy life. For she really had everything to make it. A wasp-waisted blond-haired girl of radiant beauty, with a good drama training, she should have become a movie star and she would have been one if she had been born twenty years before, that is before the French New Wave set new standards, when ingénues like her were still in demand. Well, she WAS given one or two parts which gave her the opportunity to shine, such as the Jacotte she nicely portrayed in Michel Deville's elegant 'Benjamin' alongside Pierre Clémenti as virgin Benjamin and Michel Piccoli as his mentor (1967), or tragic Marie Vetsera's younger sister in Terence Young's version of 'Mayerling' (1968). However, despite this encouraging debut, roles soon dwindled to next to nothing: a few brief appearances as a blond hostess, a blond secretary or even as a (blond?) nun! Lyne Chardonnet sure deserved better. She had born in Paris in the last years of World War II to a fakir, Léopold Chardonnet, and his wife, Ellen Shapiro, of Irish origin. At the age of five, Lyne was already taking dancing lessons. After graduating from high school she studied drama at the Conservatoire de Paris, with prestigious teachers (Henri Rollan, Fernand Ledoux and Robert Manuel). She left the place equipped with a classic comedy and a modern comedy prize. She started her acting career in 1965 in front of the cameras of Alain Resnais, for whom she played a role she would later have to repeat over and over again, that of the pretty blonde. From then on she was busy working hard in the movies, on television (her best part being Herminie in the series 'Les gens de Mogador') and at the theater (where contrary to the cinema, she was always given rewarding parts in plays by Musset, Rostand, Labiche and many others). She married twice, once (very very briefly) with Paul-Loup Sulitzer, the best-seller writer, and the second time (more happily) with writer-actor-director Jacques Cortal. They had a daughter together, Léa, born in 1974. Lyne worked and worked and she was doing fine (at least on TV and on the boards) when the gods decided to abandon her. In 1980, whereas she was only 36 she suddenly died of liver cancer. Two months beforehand, she was still active, completing her scenes in the TV movie 'Le mystère de Saint Charlu'. Léa was only six and Jacques, her faithful life companion, was annihilated. He later devoted two films to her memory, a short 'Le dernier jour' and much later (2002), a feature-length fictionalized version of her final days 'Quand je vois le soleil'.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NjY4NTQ1NF5BMl5BanBnXkFtZTgwNjc0NTM1NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0152820","name":"Lyne Chardonnet","idIMDB":"nm0152820"},"actorId":"nm0152820","character":"Mlle Blond","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lyvia D'Alche","urlProfile":"http://www.imdb.com/name/nm0194944","urlPhoto":"","biography":{"bio":"Lyvia D'Alche is known for her work on Fanfan (1993), A Few Days with Me (1988) and Le soulier magique (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0194944","name":"Lyvia D'Alche","idIMDB":"nm0194944"},"actorId":"nm0194944","character":"L'hôtesse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yves Barsacq","urlProfile":"http://www.imdb.com/name/nm0058246","urlPhoto":"","biography":{"dateOfBirth":"17 June 1931","placeOfBirth":" Paris, France","bio":"Yves Barsacq was born on June 17, 1931 in Paris, France. He is known for his work on Les aventures de Tintin (1991), Love and Death (1975) and Fantastic Planet (1973). He died on October 4, 2015 in Albenga, Liguria, Italy.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0058246","name":"Yves Barsacq","idIMDB":"nm0058246"},"actorId":"nm0058246","character":"Robert","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0074720","urlIMDB":"http://www.imdb.com/title/tt0074720","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":[],"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 35 min (95 min)"],"soundMix":["Mono"],"color":["Color (Eastmancolor)"],"aspectRatio":["1.66 : 1"],"camera":null,"laboratory":["Laboratoires Éclair, Paris, France"],"filmLength":null,"negativeFormat":null,"cinematographicProcess":["Panavision"],"printedFilmFormat":null},"rating":"7.5","filmingLocations":[],"awards":[{"award":"César Awards, France 1977","titlesAwards":[{"titleAwardOutcome":"Nominated César","categories":[{"category":"Best Screenplay, Original or Adaptation (Meilleur scénario, dialogue ou adaptation)","names":[{"name":"Francis Veber","id":"nm0891554","role":null}]},{"category":"Best Cinematography (Meilleure photographie)","names":[{"name":"Étienne Becker","id":"nm0065616","role":null}]},{"category":"Best Production Design (Meilleurs décors)","names":[{"name":"Bernard Evein","id":"nm0263372","role":null}]}]}]}],"votes":"3,286","type":"Movie","companyCreditsSimple":[{"idCompany":"co0057705","name":"Andrea Films"},{"idCompany":"co0046075","name":"EFVE"},{"idCompany":"co0044952","name":"Fideline Films"}],"keywords":{"keywords":["screwball"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:42:09"}}