{"data":{"movies":[{"title":"Zebra in the Kitchen","originalTitle":"","year":"1965","releaseDate":"196506","directors":[{"name":"Ivan Tors","id":"nm0868974"}],"writers":[{"name":"Art Arthur","id":"nm0037734"},{"name":"Elgin Ciampi","id":"nm0161781"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjczNDgwNTQ0OV5BMl5BanBnXkFtZTcwOTg5MDAyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Family"],"plot":"A young boy lets the animals out of their cages at the Zoo, to set them free, but the animals start taking over the town.","simplePlot":"A young boy lets the animals out of their cages at the Zoo, to set them free, but the animals start taking over the town.","actors":[{"actorName":"Jay North","urlProfile":"http://www.imdb.com/name/nm0636020","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwMDc4MTU2OF5BMl5BanBnXkFtZTcwNTUyMjY5Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 August 1951","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Jay Waverly North Jr.","height":"5' 7\" (1.7 m)","bio":"Jay North will forever be remembered for giving life to the comic strip hellion Dennis the Menace (1959) on TV. Humanizing this little tornado would not only be his treasure, it would be his torment. Born in 1951, Jay was first seen on TV in 1958 and moved eagerly to minor filming the next year. With over 500 children auditioning, Jay was selected by Dennis' creator Hank Ketcham himself for the star-making title role, appearing in 146 episodes over a four-year period (1959-1963). During this TV peak he also appeared in countless variety programs, including those hosted by Dinah Shore, Milton Berle and Tennessee Ernie Ford. He guest starred in episodes of My Three Sons (1960) and The Lucy Show (1962), among others. However, after the cancellation of his own show, the now active teenager noticed a major tapering off. He found himself badly typecast and efforts to forge ahead with film projects and other series work proved difficult. At first things looked promising. He perpetuated his wholesome image with the family film Zebra in the Kitchen (1965) and, more notably, the exotic adventure Maya (1966), which spun off into a mildly popular TV series, but then all offers dried up. He went from top child star to has-been teen in only a few short years, and had a terrible time adjusting. Despite voicing the popular character Bamm-Bamm in the animated series The Flintstones (1960) and other animated characters in the late 1960s, Jay all but disappeared save a few glimpses here and there. He went through years of personal turmoil and emotional anguish (divorces, drug experimentation, weight gain) before his recovery. Reportedly abused and mishandled during his peak years by on-set relatives/caretakers, Jay has since been instrumental in providing advice and counseling to other professional child/teen stars in the same boat. From time to time these days, Jay has been glimpsed at nostalgia conventions.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwMDc4MTU2OF5BMl5BanBnXkFtZTcwNTUyMjY5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0636020","name":"Jay North","idIMDB":"nm0636020"},"actorId":"nm0636020","character":"Chris Carlyle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Martin Milner","urlProfile":"http://www.imdb.com/name/nm0590398","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MTg1ODg4NV5BMl5BanBnXkFtZTcwMzk3NjMyNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1931","placeOfBirth":" Detroit, Michigan, USA","birthName":"Martin Sam Milner","height":"6' 1\" (1.85 m)","bio":"Martin Sam Milner was born December 28, 1931 in Detroit, Michigan. His mother, Jerre Martin, originally from Oregon, was a dancer with the Paramount Theater circuit. His father, Sam Gordon Milner, a Polish Jewish immigrant, was a film distributor. The Milners moved to Seattle when Martin was a baby and to Los Angeles soon after. At age 15, Martin's father got him an agent and he was chosen to play the role of \"John Day\" in Life with Father (1947), Warner Bros.' version of Clarence Day, Jr.'s popular Broadway play. Milner contracted polio shortly after filming was completed and his career was put on hold for a year as he recovered from the illness. After graduating from North Hollywood High School and studying for one year at the University of Southern California, Milner worked steadily in films during the years 1949-1960. He appeared in films such as Sands of Iwo Jima (1949), Gunfight at the O.K. Corral (1957), Marjorie Morningstar (1958) and Sweet Smell of Success (1957). He put his career on hold again when he was inducted into the Army in 1952 for two years. Shortly after joining the Army, he was assigned to the Human Research Division, where he directed military training films and served as Master of Ceremonies for a touring show based at Fort Ord, California. Milner married television actress and singer Judy Jones in 1957 and they have four children--Amy, Molly, Stuart, and Andrew. Milner met Jack Webb during the filming of Halls of Montezuma (1951) and later worked with him on his \"Dragnet\" radio show as well as the TV series Dragnet (1951). Milner appeared as 17-year-old high school student \"Stephen Banner\" in the episode \"The Big Producer\" in 1952. According to Webb's biography \"Just the Facts, Ma'am\", Webb owed Milner money from a card game. When Webb called him to the studio to pay him back, he offered Milner a role in the \"Dragnet\" radio show. After that, Webb continued to find roles for Milner until he offered him the role of \"Pete Malloy\" on Adam-12 (1968). Milner continued to appear in films throughout the 1970s and 1980s and made many guest appearances on television shows such as Murder, She Wrote (1984), the \"Columbo\" made-for-TV movies, MacGyver (1985), and Diagnosis Murder (1993). Milner is an avid fisherman and has been co-host of the syndicated radio talk show \"Let's Talk Hook-up\" since 1993. He also hosts fishing trips through \"Let's Talk Hook-Up.\" Apart from the Webb connection, Milner starred as \"Tod Stiles\" in his own groundbreaking CBS-TV series, Route 66 (1960). The series was notable for its coast-to-coast location shooting, eloquent scripts by co-creator Stirling Silliphant and others, impressive guest casts, and a distinctive theme song by Nelson Riddle. The series allowed Milner to explore a range of characterizations as his nomadic travels in a Corvette convertible took him from job to job all over the United States, where he dug deeply into the lives of the people he encountered there -- with traveling companions \"Buz Murdock\" (George Maharis) and, after Maharis left the show, \"Lincoln Case\" (Glenn Corbett).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MTg1ODg4NV5BMl5BanBnXkFtZTcwMzk3NjMyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0590398","name":"Martin Milner","nicknames":["Marty"],"idIMDB":"nm0590398"},"actorId":"nm0590398","character":"Dr. Del Hartwood","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andy Devine","urlProfile":"http://www.imdb.com/name/nm0222596","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MTc5MTE1MF5BMl5BanBnXkFtZTYwODY1MjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 October 1905","placeOfBirth":" Flagstaff, Arizona, USA","birthName":"Andrew Vabre Devine","height":"6' (1.83 m)","bio":"Rotund comic character actor of American films. Born Andrew Vabre Devine in Flagstaff, Arizona, the later-to-be Rotund comic character actor was raised in nearby Kingman, Arizona, the son of Irish-American hotel operator Thomas Devine and his wife Amy. Devine was an able athlete as a student and actually played semi-pro football under a phony name (Jeremiah Schwartz, often erroneously presumed to be his real name). Devine used the false name in order to remain eligible for college football. A successful football player at St. Mary & St. Benedict College, Arizona State Teacher's College, and Santa Clara University, Devine went to Hollywood with dreams of becoming an actor. After a number of small roles in silent films, he was given a good part in the talkie The Spirit of Notre Dame (1931) in part due to his fine record as a football player. His sound-film career seemed at risk due to his severely raspy voice, the result of a childhood injury. His voice, however, soon became his trademark, and he spent the next forty-five years becoming an increasingly popular and beloved comic figure in a wide variety of films. In the 1950s, his fame grew enormously with his co-starring role as Jingles opposite Guy Madison's Adventures of Wild Bill Hickok (1951), on television and radio simultaneously. In 1955, before the Hickok series ended, Devine took over the hosting job on a children's show retitled Andy's Gang (1955), in which he gained new fans among the very young. He continued active in films until his death in 1977. He was survived by his wife and two sons.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MTc5MTE1MF5BMl5BanBnXkFtZTYwODY1MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0222596","name":"Andy Devine","idIMDB":"nm0222596"},"actorId":"nm0222596","character":"Branch Hawksbill","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joyce Meadows","urlProfile":"http://www.imdb.com/name/nm0575050","urlPhoto":"","biography":{"dateOfBirth":"13 April 1933","placeOfBirth":" Arrowwood, Alberta, Canada","bio":"Joyce Meadows was born on April 13, 1933 in Arrowwood, Alberta, Canada. She is an actress, known for The Brain from Planet Arous (1957), Two Faces West (1960) and The Girl in Lovers Lane (1960). She has been married to Merrill Harrington since 1984.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0575050","name":"Joyce Meadows","idIMDB":"nm0575050"},"actorId":"nm0575050","character":"Isobel Moon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim Davis","urlProfile":"http://www.imdb.com/name/nm0204824","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MTc2NzMzNl5BMl5BanBnXkFtZTcwNzI4MDgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 August 1909","placeOfBirth":" Edgerton, Missouri, USA","birthName":"Marlin Davis","height":"6' 2½\" (1.89 m)","bio":"Tall, rangy Jim Davis spent much of his early career in westerns, mainly at Republic Pictures. The Missouri-born and -raised Davis' relaxed, easygoing manner and Southern drawl easily fit most moviegoers' image of the cowboy, and Republic put him in a ton of them over the years (the fact that, unlike a lot of movie cowboys, he looked right at home on a horse didn't hurt, either). He alternated between good-guy and villain roles, one of his better ones being that of the devious, murderous fur trapper working for Kirk Douglas' competition in The Big Sky (1952). He is best known, however, for his role as Ewing family patriarch Jock in the long-running TV series Dallas (1978).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MTc2NzMzNl5BMl5BanBnXkFtZTcwNzI4MDgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0204824","name":"Jim Davis","idIMDB":"nm0204824"},"actorId":"nm0204824","character":"Adam Carlyle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dorothy Green","urlProfile":"http://www.imdb.com/name/nm0337802","urlPhoto":"","biography":{"dateOfBirth":"12 January 1920","placeOfBirth":" Los Angeles, California, USA","birthName":"Dorothy Jeannette Hufford","bio":"Dorothy Green was born on January 12, 1920 in Los Angeles, California, USA as Dorothy Jeannette Hufford. She was an actress, known for The Big Heat (1953), The Six Million Dollar Man (1973) and It Happened at the World's Fair (1963). She was married to Sidney Miller and Dr. Sidney Green (Greenberger). She died on May 8, 2008 in Los Angeles.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0337802","name":"Dorothy Green","idIMDB":"nm0337802"},"actorId":"nm0337802","character":"Anne Carlyle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karen Green","urlProfile":"http://www.imdb.com/name/nm0338035","urlPhoto":"","biography":{"bio":"Karen Green is an actress, known for Zebra in the Kitchen (1965), The Eve Arden Show (1957) and Because of You (1952).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0338035","name":"Karen Green","idIMDB":"nm0338035"},"actorId":"nm0338035","character":"Wilma Carlyle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vaughn Taylor","urlProfile":"http://www.imdb.com/name/nm0853299","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMjQzNTUxMl5BMl5BanBnXkFtZTcwNzc5ODkxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1911","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Vaughn Everett Taylor","bio":"Reedy, balding, often bespectacled American character actor with pencil-thin moustache, once described as the man with TV's 'most deceptive face'. He looked like - and was - a certified public accountant, graduate from Northeastern University. A struggling actor in his youth, he worked in stock, tent shows and on radio. After army service in World War II, he became a prolific performer in early anthology series on television (eg. Kraft Theatre (1947) and Robert Montgomery Presents (1950)), though he continued to alternate these with appearances on the New York stage. He was also glimpsed in movies, invariably in small supporting roles, most notably as Deacon Davis in Cat on a Hot Tin Roof (1958), and as George Lowery, boss to doomed Janet Leigh in Psycho (1960). Vaughn reserved his best for the small screen, where he showed his versatility in genial or waspish roles, often as doctors, judges and bankers. He was capable of portraying benevolence as easily as taking on the mantle of greedy or corrupt attorneys, or second-string grifters (his repertoire even included vicious real-life gangster, George 'Pa' Barker, in an episode of The Untouchables (1959)). Among his numerous TV credits, his five journeys into The Twilight Zone (1959) stand out in particular. Severe spinal deterioration brought about Vaughn's retirement from acting in 1976. His wife of many years, Ruth Moss, a fellow graduate of the Leland Powers School, was a noted Boston radio personality and Broadway actress.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMjQzNTUxMl5BMl5BanBnXkFtZTcwNzc5ODkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0853299","name":"Vaughn Taylor","idIMDB":"nm0853299"},"actorId":"nm0853299","character":"Councilman Pew","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Milford","urlProfile":"http://www.imdb.com/name/nm0587333","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjRjYjZlNGMtZjM0Yy00OTIyLTg5NjctMzgwODFkMjUzZDM1L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1927","placeOfBirth":" Johnstown, New York, USA","birthName":"John Hackney Milford","height":"5' 10\" (1.78 m)","bio":"John Milford was born on September 7, 1927 in Johnstown, New York, USA as John Hackney Milford. He was an actor, known for General Hospital (1963), Command & Conquer: Red Alert (1996) and Enos (1980). He was married to Susan Graw. He died on August 14, 2000 in Santa Monica, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjRjYjZlNGMtZjM0Yy00OTIyLTg5NjctMzgwODFkMjUzZDM1L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0587333","name":"John Milford","nicknames":["Milf"],"idIMDB":"nm0587333"},"actorId":"nm0587333","character":"Sgt. Freebee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tristram Coffin","urlProfile":"http://www.imdb.com/name/nm0168939","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjEzZGRjOTctMzZjNC00YWQxLWFlMjYtYjg2YzMxMTBlOGFmXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 August 1909","placeOfBirth":" Mammoth, Utah, USA","bio":"Tristram Coffin was born in a Utah mining community, grew up in Salt Lake City, and started acting while in high school. He later continued acting with traveling stock companies. Having earned a degree in speech at the University of Washington, he worked as a news analyst and sportscaster until a Hollywood talent scout approached him with the idea of putting him in films. Coffin's sinister looks served him well in the roles he played in serials like Perils of Nyoka (1942) and Spy Smasher (1942), but there were occasional hero roles, too, as in the feature The Corpse Vanishes (1942) with Bela Lugosi. He donned the bullet helmet and gadget-laden leather jacket of Rocket Man in the 1949 serial King of the Rocket Men (1949). Baby boomers might remember Coffin best as the Arizona Ranger Captain in the 1950s Western series 26 Men (1957).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjEzZGRjOTctMzZjNC00YWQxLWFlMjYtYjg2YzMxMTBlOGFmXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0168939","name":"Tristram Coffin","nicknames":["Tris"],"idIMDB":"nm0168939"},"actorId":"nm0168939","character":"Councilman Lawrence","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Merritt Bohn","urlProfile":"http://www.imdb.com/name/nm0092109","urlPhoto":"","biography":{"dateOfBirth":"13 May 1905","placeOfBirth":" Chicago, Illinois, USA","birthName":"Merritt Franklin Bohn","bio":"Merritt Bohn was born on May 13, 1905 in Chicago, Illinois, USA as Merritt Franklin Bohn. He was an actor, known for Nevada Smith (1966), Zebra in the Kitchen (1965) and Wild Seed (1965). He died on December 11, 1978 in Torrence, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0092109","name":"Merritt Bohn","idIMDB":"nm0092109"},"actorId":"nm0092109","character":"Chief of Police","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Clarke","urlProfile":"http://www.imdb.com/name/nm0164967","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTNhMzdkMjktMjAwZC00ZDNmLTk1MzktYzEwMmNkMGMwM2NjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1920","placeOfBirth":" Oklahoma City, Oklahoma, USA","birthName":"Robert Irby Clarke","bio":"A movie-crazy kid in his native Oklahoma City, Robert Clarke decided at an early age that he wanted to be an actor, but nevertheless suffered from stage fright in his first school productions. He acted in University of Oklahoma radio plays and on stage at the University of Wisconsin before hitching a ride to California to try to break into the picture business. After screen tests at 20th Century-Fox and Columbia, Clarke landed a berth as a contract player at RKO. When RKO dropped his option three years later, he began freelancing. Clarke married Alyce King of the singing The King Sisters in 1956 and, a decade later, began appearing on TV and on tour with The King Family. His autobiography, To \"B\" or Not to \"B\": A Film Actor's Odyssey, was published in 1996.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTNhMzdkMjktMjAwZC00ZDNmLTk1MzktYzEwMmNkMGMwM2NjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0164967","name":"Robert Clarke","nicknames":["Bob"],"idIMDB":"nm0164967"},"actorId":"nm0164967","character":"Sheriff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Percy Helton","urlProfile":"http://www.imdb.com/name/nm0375887","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk5MGZlNTktOGY1Ni00MTdmLWJmMjQtZTZmNmM4MTAzZWE3XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 January 1894","placeOfBirth":" New York City, New York, USA","birthName":"Percy Alfred Helton","bio":"One of the most familiar faces and voices in Hollywood films of the 1950s. Percy Helton acted almost from infancy, appearing in his father's vaudeville act. The famed Broadway producer David Belasco cast Helton in a succession of child roles over several years, giving the boy an invaluable grounding in the technique and spirit of the theatre. George M. Cohan took Helton under his wing and used him in a number of plays. Helton served in the US Army in Europe during World War I in the American Expeditionary Forces, and at war's end returned to acting on the stage, carving out a substantial career as a juvenile in plays such as \"One Sunday Afternoon\" and \"Young America\". In one of these plays he was required to shout and scream for much of the performance, and by the end of the run his voice had become permanently hoarse. He moved by necessity into character roles, working primarily on the stage until the late 1940s. Despite some early work as a juvenile in silent films, it was not until his brief but memorable appearance as a drunken Santa Claus in Miracle on 34th Street (1947) that he began to shift primarily into film work. His diminutive physique and unmistakable voice made him a fixture in a wide range of films and TV programs throughout the next two decades.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk5MGZlNTktOGY1Ni00MTdmLWJmMjQtZTZmNmM4MTAzZWE3XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0375887","name":"Percy Helton","idIMDB":"nm0375887"},"actorId":"nm0375887","character":"Mr. Richardson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jimmy Stiles","urlProfile":"http://www.imdb.com/name/nm0830186","urlPhoto":"","biography":{"bio":"Jimmy Stiles is an actor, known for Zebra in the Kitchen (1965), The Fugitive (1963) and The Munsters (1964).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0830186","name":"Jimmy Stiles","idIMDB":"nm0830186"},"actorId":"nm0830186","character":"Tim","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dal Jenkins","urlProfile":"http://www.imdb.com/name/nm0420816","urlPhoto":"","biography":{"bio":"Dal Jenkins is an actor, known for Will Penny (1967), The War Lord (1965) and Bad Charleston Charlie (1973).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0420816","name":"Dal Jenkins","idIMDB":"nm0420816"},"actorId":"nm0420816","character":"Kookie","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0059944","urlIMDB":"http://www.imdb.com/title/tt0059944","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 32 min (92 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Color (Metrocolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.2","filmingLocations":[{"location":"Canyon Country, California, USA"}],"rated":"G","awards":[],"votes":"203","type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"}],"keywords":{"keywords":["animal","cage","boy","zoo","african lion","judge","courtroom","whipped cream","toy store","policeman","police","ice cream parlor","ice cream","phone booth","wild animal","tiger","lion","shoeshine","ostrich","manhole","watching tv","monkey","chimpanzee","camel","elephant","telephone call","animal in title","squirrel","cat","key","dream","caged animal","nightmare","bicycle","crying","bear cub","bear","corn","truck","van","boy dog relationship","human animal relationship","family relationships","father son relationship","mother son relationship","cousin cousin relationship","corn on the cob","city","city country contrast","moving","bathtub","swing","roof","german shepherd","dog","cougar","mountain lion","farm","releasing zoo animals","zebra","based on play"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 05:58:03"}}