{"data":{"movies":[{"title":"Venus in Furs","originalTitle":"Paroxismus","year":"1969","releaseDate":"19690819","directors":[{"name":"Jesús Franco","id":"nm0001238"}],"writers":[{"name":"Jesús Franco","id":"nm0001238"},{"name":"Malvin Wald","id":"nm0907013"}],"runtime":"86 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MDI3Mjg2OV5BMl5BanBnXkFtZTcwNzI1ODcyMQ@@._V1.jpg","countries":["UK","Italy","West Germany"],"languages":["English"],"genres":["Thriller"],"plot":"In Istanbul, a jazz trumpeter pulls the murdered body of a young woman from the surf. He remembers her from the night before, when he saw her at a millionaire playboy's party and then later watched as she was assaulted by the party's host and two of his friends. In confusion, Jimmy, the musician, leaves for Rio where he finds the sympathetic ear of Rita, a singer who invites him to live with her and helps him recover his equilibrium and his musical ability. Then, into the room walks a woman who looks like Wanda, the murder victim. Jimmy pursues her, not caring if she's alive or dead. What's going on?","simplePlot":"A musician finds the corpse of a beautiful woman on the beach. The woman returns from the dead to take revenge on the group of wealthy sadists responsible for her death.","actors":[{"actorName":"James Darren","urlProfile":"http://www.imdb.com/name/nm0201626","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MTA2OTUyNF5BMl5BanBnXkFtZTYwNzA2NTU2._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 June 1936","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"James William Ercolani","height":"5' 10½\" (1.79 m)","bio":"Tall, good-looking James Darren was a student of acting coach Stella Adler and made his name in the 1950s in a series of teenage-themed films. A better actor than most of his contemporary teenage heartthrobs, he nevertheless found it difficult to escape the teen-idol image he got in pictures like Gidget (1959) and Gidget Goes Hawaiian (1961). He also gained fame in the early and mid-1960s as a singer, with several hits to his credit, including \"Goodbye Cruel World\" and \"Her Royal Majesty\". His film work tapered off in the 1960s, but he did much TV work and had two hit series, The Time Tunnel (1966) in the 1960s and T.J. Hooker (1982) in the 1980s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MTA2OTUyNF5BMl5BanBnXkFtZTYwNzA2NTU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0201626","name":"James Darren","idIMDB":"nm0201626"},"actorId":"nm0201626","character":"Jimmy Logan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barbara McNair","urlProfile":"http://www.imdb.com/name/nm0573552","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMjkxNTM2MF5BMl5BanBnXkFtZTcwNDU4MDQ3NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1934","placeOfBirth":" Chicago, Illinois, USA","birthName":"Barbara Joan McNair","height":"5' 3\" (1.6 m)","bio":"Popular African-American vocalist and entertainer Barbara McNair dazzled audiences with her singing prowess and exceptional beauty for well over four decades until her death on February 4, 2007 of throat cancer in Los Angeles. The Chicago-born entertainer and one-time secretary was raised in Racine, Wisconsin, one of five children born to Horace and Claudia Taylor McNair. She sang in her church choir and was encouraged by her parents to pursue voice. Following music studies at the Racine Conservatory of Music and the American Conservatory of Music in her hometown Chicago, she moved to Los Angeles and attended USC before relocating once again to New York to pursue her dream. Barbara worked her way up from typist to singer of small supper clubs to headlining large showrooms as one of America's more visible singers of the late 50s and 60s. A jazz stylist influenced by the great Sarah Vaughan at first, she gently eased into popular music. Her first big break came with a week-long gig on Arthur Godfrey's talent show, which led to bookings at The Purple Onion, The Persian Room and L.A.'s Cocoanut Grove. She began receiving invites on the TV variety circuit ('Ed Sullivan's \"Toast of the Town,\" \"The Dean Martin Show\" and \"The Tonight Show\") and made it to Broadway with the musicals \"The Body Beautiful\" (1958) and \"No Strings\" (1962), replacing original star Diahann Carroll in the latter. At different times she recorded on the Coral, Signature and Motown labels resulting in such modest hits as \"You're Gonna Love My Baby\" and \"Bobby.\" In the late 60s Barbara made a choice to scout out acting roles, hoping to parlay her singing success into a movie career. The singer showed initial promise as a sexy lead alongside Raymond St. Jacques in the gritty crime drama If He Hollers, Let Him Go! (1968) in which she made news with her celebrated nude sequences. She also wore a nun's habit alongside Mary Tyler Moore in Elvis Presley's last feature film Change of Habit (1969), and appeared opposite Sidney Poitier as Virgil Tibbs' wife in both They Call Me Mister Tibbs! (1970) and The Organization (1971). A warm, inviting presence, she pioneered her own syndicated musical TV show The Barbara McNair Show (1969), a rarity at the time for a black entertainer, and guested on all the popular TV programs of the day including \"Mission: Impossible,\" \"Hogan's Heroes\" and \"I Spy.\" The early 1970s were a difficult time for Barbara when offers suddenly stopped coming in and her husband/manager, who had mob affiliations, was shot and killed in 1976. Barbara went on to appear in such stage musicals as \"The Pajama Game\" and \"Sophisticated Ladies\", and was also seen in a recurring role for a time on General Hospital (1963) in later years. She was also spotted in a couple of obscure films in the 80s and 90s. Barbara's love of performing continued even in lesser venues -- cabaret clubs, cruise ships, special events and even retirement centers in Florida -- still sporting her stunning looks and vocal sparkle. In 2006 she opened for Bob Newhart in Philadelphia and New Jersey. Married four times in all, Barbara died at age 72 and was survived by husband, Charles Blecka.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMjkxNTM2MF5BMl5BanBnXkFtZTcwNDU4MDQ3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0573552","name":"Barbara McNair","idIMDB":"nm0573552"},"actorId":"nm0573552","character":"Rita","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maria Rohm","urlProfile":"http://www.imdb.com/name/nm0737538","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMDUyMDYzNV5BMl5BanBnXkFtZTcwMzE5NzAzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 August 1945","placeOfBirth":" Vienna, Austria","birthName":"Helga Grohmann","bio":"Maria Rohm is one of the rare gems in the movie business - this is truly her life's work. She started acting on-stage at the famous Vienna Burgtheatre as a child actor from ages 4 through 13. Having performed in such classics as William Shakespeare's \"Midsummer Night's Dream\", Leo Tolstoy's autobiography \"Und das Licht scheint in der Finsternis\", Ferdinand Raimund's \"Der Bauer als Millionär\" etc. She worked with many of the great German stage actors such as Attila Hörbiger, Paula Wessely, Curd Jürgens, Annemarie Düringer, Heinrich Schweiger, Judith Holzmeister to name a few. The young Ms. Rohm continued her theatrical work until she auditioned for Harry Alan Towers at age 18, it was then that her movie career took off. Towers, smitten with the blonde beauty cast her as a lead in a number of his feature films - Maria's extraordinary acting abilities took over from there. Both stunning and immensely talented she soon became highly sought after as a leading lady all across Europe. Her movie roles took her to more than a dozen countries where she shared the screen with such greats as Frankie Avalon, Klaus Kinski, Christopher Lee, Vincent Price and Jack Palance . Extensive traveling eventually took it's toll, and having 30 on-camera movie credits to her name combined with 4 decades experience as an actress, Rohm made the decision to join Towers, her now husband as a producer. Her considerable experience in the industry revealed an astute business woman, and Mr. & Mrs. Towers became power a couple in the independent feature market. The duo worked happily together until Harry Tower's death July 31st, 2009. Ms. Rohm although largely retired, continues to consult periodically in the industry and share her expertise of the business that she fondly remembers as bringing her together with the love of her life.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMDUyMDYzNV5BMl5BanBnXkFtZTcwMzE5NzAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0737538","name":"Maria Rohm","idIMDB":"nm0737538"},"actorId":"nm0737538","character":"Wanda Reed","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Klaus Kinski","urlProfile":"http://www.imdb.com/name/nm0001428","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyOTgwMDE1MV5BMl5BanBnXkFtZTcwNzAxNTIzNA@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 October 1926","placeOfBirth":" Zoppot, Free City of Danzig [now Sopot, Pomorskie, Poland]","birthName":"Nikolaus Günther Nakszynski","height":"5' 8\" (1.73 m)","bio":"Klaus Kinski was born Nikolaus Günther Nakszynski in Zoppot, Free City of Danzig (now Sopot, Poland), to Susanne (Lutze), a nurse, and Bruno Nakszynski, a pharmacist. He grew up in Berlin, was drafted into the German army in 1944 and captured by British forces in Holland. After the war he began acting on the stage, quickly gaining a reputation for his ferocious talent and equally ferocious temper. He started acting in films shortly afterwards, showing an utter disregard for the quality of the productions he appeared in and churning out so many that a complete filmography is almost impossible to assemble. However, he did turn out memorable work for director Werner Herzog, a similarly driven and obsessive character. Herzog and Kinski pushed each other to extremes over a 15-year working relationship, which finally ended after filming Cobra Verde (1987), a production plagued by volcanic clashes between the star and director, involving--among other things--violent physical altercations and mutual death threats. Kinski subsequently directed and starred in the notorious Paganini (1989), his only film as director and which was marked by (again) clashes between Kinski and his producers, who accused him of turning their movie into a pornographic film and sued him in court. His autobiography \"All I Need is Love\", one of the most vicious attacks on the film business ever written, was withdrawn for legal reasons and subsequently re-released as \"Kinski Uncut\" in the US & UK, \"Ich brauche Liebe\" in Germany, and in various other languages.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyOTgwMDE1MV5BMl5BanBnXkFtZTcwNzAxNTIzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001428","name":"Klaus Kinski","idIMDB":"nm0001428"},"actorId":"nm0001428","character":"Ahmed Kortobawi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dennis Price","urlProfile":"http://www.imdb.com/name/nm0696866","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MjQ2MjE5OV5BMl5BanBnXkFtZTcwNDU3NjYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 June 1915","placeOfBirth":" Twyford, Berkshire, England, UK","birthName":"Dennistoun Franklyn John Rose-Price","height":"6' 2\" (1.88 m)","bio":"This urbane, sourly handsome British actor was born to privilege and most of his roles would follow suit. Born Dennistoun John Franklyn Rose-Price in Berkshire in 1915, Dennis Price, the son of a brigadier-general, was expected to abide by his family wishes and make a career for himself in the army or the church. Instead he became an actor. First on stage (Oxford University Dramatic Society) where he debuted with John Gielgud in \"Richard II\" in 1937, he was further promoted in the theatre by Noël Coward. After brief extra work, Price nabbed early star-making film roles in several overbaked Gainsborough mysteries/melodramas, including A Place of One's Own (1945), The Magic Bow (1946) and Caravan (1946), but the one showcase role that could have led him to Hollywood, that of the title poet in The Bad Lord Byron (1949), proved a critical and commercial failure. He took this particularly hard and fell into severe depression. His fatally charming serial murderer in Kind Hearts and Coronets (1949), in which he does in nearly all of Alec Guinness' eight characters (Guiness plays eight different roles), is arguably his crowning achievement on celluloid. By the 50s Price was suffering from severe alcoholism, which adversely affected his personal and professional career. A marriage to bit actress Joan Schofield in 1939 ended eleven years later, due to his substance abuse problem and homosexuality, the latter being a source of great internal anguish for him. They had two daughters. Price became less reliable and fell steeply in his ranking, moving into less quality \"B\" pictures. Eccentric comedy renewed his fading star a bit in such delightful farces as Private's Progress (1956), I'm All Right Jack (1959) and School for Scoundrels (1960). TV also saved him for a time in the 60s with the successful series The World of Wooster (1965), in which he played the disdainful butler, Jeeves. Bad times, however, resurfaced. He filed bankruptcy in 1967 and moved to the remote Channel Island of Sark for refuge. Many of his roles were reduced to glorified cameos and the necessity for cash relegated him to appearing in campy \"Z\" grade cheapfests, many helmed by the infamous writer/director Jesús Franco, a sort of Spanish version of Roger Corman. Vampiros Lesbos (1971) was just one of his dreadful entries. Price also played Dr. Frankenstein for Franco in La malédiction de Frankenstein ou les expériences érotiques de Frankenstein (1972) [Dracula vs. Frankenstein] and the The Erotic Rites of Frankenstein (1973) [The Erotic Rites of Frankenstein]. Fully bloated and in delicate health, he died in 1973 at age 58 in a public ward from liver cirrhosis. A sad ending for one who of Britain's more promising actors and film stars.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MjQ2MjE5OV5BMl5BanBnXkFtZTcwNDU3NjYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0696866","name":"Dennis Price","idIMDB":"nm0696866"},"actorId":"nm0696866","character":"Percival Kapp","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Margaret Lee","urlProfile":"http://www.imdb.com/name/nm0497810","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzODMzMmEtYjU3MC00NTYyLTkzNDEtYmVjMjlmZjdhOGFmXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 August 1943","placeOfBirth":" Wolverhampton, England, UK","birthName":"Margaret Gwendolyn Box","height":"5' 6\" (1.68 m)","bio":"Margaret Lee was born on August 4, 1943 in Wolverhampton, England as Margaret Gwendolyn Box. She is an actress, known for Bandits à Milan (1968), Les insatisfaites poupées érotiques du docteur Hitchcock (1971) and Five for Hell (1969).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzODMzMmEtYjU3MC00NTYyLTkzNDEtYmVjMjlmZjdhOGFmXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0497810","name":"Margaret Lee","idIMDB":"nm0497810"},"actorId":"nm0497810","character":"Olga","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adolfo Lastretti","urlProfile":"http://www.imdb.com/name/nm0489947","urlPhoto":"","biography":{"dateOfBirth":"18 November 1937","placeOfBirth":"","bio":"Adolfo Lastretti was born on November 18, 1937. He is an actor, known for Le lion du désert (1980), Shaft in Africa (1973) and The Four of the Apocalypse... (1975).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0489947","name":"Adolfo Lastretti","idIMDB":"nm0489947"},"actorId":"nm0489947","character":"Insp. Kaplan","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0064789","urlIMDB":"http://www.imdb.com/title/tt0064789","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"01","month":"10","year":"1968","remarks":null},null],"copyrightHolder":"Commonwealth United Entertainment, Inc. (1970)"},"technical":{"runtime":["1 hr 26 min (86 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":["2,630 m (Italy)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.8","filmingLocations":[],"rated":"R","awards":[],"votes":"1,403","type":"Movie","companyCreditsSimple":[{"idCompany":"co0055009","name":"Cinematografica Associati (CI.AS.)"},{"idCompany":"co0034385","name":"Terra-Filmkunst"},{"idCompany":"co0103262","name":"Towers of London Productions"}],"keywords":{"keywords":["trumpeter","murder","wetness","garter","high heels","rape","voice over narration","fur coat","lingerie","stocking fetish","stockings","unknown female corpse","mysterious death","beach","musician","rio de janeiro","revenge","carnival","room","confusion","sadist","musical instrument","death","band","trumpet","violence against a woman","breasts","infidelity","extramarital affair","photograph","lynching","dead woman on a beach","dead woman in a bathtub","dead body on a beach","director cameo","woman in jeopardy","misogynist","red dress","mini dress","blue panties","white panties","female removes her clothes","scantily clad female","suicide by slashing one's wrists","dead woman with eyes open","bathtub suicide","committing suicide while naked","driven to suicide","softcore","suspicion","chest wound","obsession","revelation","screaming","whipping","dark past","art","camera","menace","sexuality","brothel","dead woman","perversion","jealousy","mistreatment","mystery individual","caress","exhibitionism","kiss","revenge sex","redhead","water","knife","bisexual girl","mysterious woman","hallway","fighting","darkness","cruelty","female corpse","brunette","glasses","promiscuity","sexual perversion","controversy","running","fear","mirror","curtain","lust","fondling","trousers","back from the dead","photo shoot","exhibitionist","black woman","fantasy sequence","unfaithfulness","beating","skirt","sexual confusion","disappointment","degradation","posing","dead girl","frustration","manipulation","wig","spirit","voyeur","dead body","bedroom","fence","adultery","panties","bondage","desperation","woman on top","violence","nude model","bed","female rear nudity","singing","humiliation","cigarette smoking","death by drowning","crowd","garden","seduction","brutality","bare chested male","blonde","stairs","sarcasm","whip","suicide attempt","search","old man","restaurant","thong","long hair","suffering","desire","blood","dress","bisexual","anger","jacket","hallucination","suspense","nipples","suicide","pain","short hair","surprise","1960s","istanbul turkey","slow motion scene","exotica","torture","supernatural power","sex","sexual promiscuity","sexual obsession","sexual cruelty","sex slave","sensuality","sadism","psycho sexual","photography","nude modeling","mysterious man","concert","music band","masochism","mansion","male rear nudity","male nudity","lesbian kiss","knife murder","jazz music","interracial relationship","fetish","female frontal nudity","evil","erotica","erotic fantasy","dead woman on ground","bisexuality","avant garde","lesbian","lesbian sex","female nudity","surrealism","cult film","dreamland","independent film","one word title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:04:15"}}