{"data":{"movies":[{"title":"The Watcher in the Woods","originalTitle":"","year":"1980","releaseDate":"19820915","directors":[{"name":"John Hough","id":"nm0396421"},{"name":"Vincent McEveety","id":"nm0568546"}],"writers":[{"name":"Brian Clemens","id":"nm0166018"},{"name":"Florence Engel Randall","id":"nm0709585"}],"runtime":"84 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNDAzMjMwMV5BMl5BanBnXkFtZTcwNzE3NTYyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Family","Horror","Mystery","Thriller"],"plot":"When a normal American family moves into a beautiful old English house in a wooded area, strange, paranormal appearances befall them in this interesting twist to the well-known haunted-house tale. Their daughter Jan sees, and daughter Ellie hears, the voice of a young teenage girl who mysteriously disappeared during a total solar eclipse decades before...","simplePlot":"When a family moves to a country home, the young girls experience strange happenings that have a link to an occult event years past.","actors":[{"actorName":"Bette Davis","urlProfile":"http://www.imdb.com/name/nm0000012","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2OTQ4NTU2OF5BMl5BanBnXkFtZTcwMzI3MjY5Ng@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 April 1908","placeOfBirth":" Lowell, Massachusetts, USA","birthName":"Ruth Elizabeth Davis","height":"5' 3\" (1.6 m)","bio":"Ruth Elizabeth Davis was born April 5, 1908, in Lowell, Massachusetts, to Ruth Augusta (Favor) and Harlow Morrell Davis, a patent attorney. Her parents divorced when she was 10. She and her sister were raised by their mother. Her early interest was dance. To Bette, dancers led a glamorous life, but then she discovered the stage, and gave up dancing for acting. To her, it presented much more of a challenge. After graduation from Cushing Academy, she was refused admittance to Eva Le Gallienne's Manhattan Civic Repertory. She enrolled in John Murray Anderson's Dramatic School and was the star pupil. She was in the off-Broadway play \"The Earth Between\" (1923), and her Broadway debut in 1929 was in \"Broken Dishes\". She also appeared in \"Solid South\". Late in 1930, she was hired by Universal, where she made her first film, called Way Back Home (1931). When she arrived in Hollywood, the studio representative who went to meet her train left without her because he could find no one who looked like a movie star. An official at Universal complained she had \"as much sex appeal as Slim Summerville\" and her performance in The Bad Sister (1931) didn't impress. In 1932, she signed a seven-year deal with Warner Brothers Pictures. Her first film with them was Seed (1931). She became a star after her appearance in The Man Who Played God (1932), known as the actress that could play a variety of very strong and complex roles. More fairly successful movies followed, but it was the role of Mildred Rogers in RKO's Of Human Bondage (1934) that would give Bette major acclaim from the film critics. She had a significant number of write-in votes for the Best Actress Oscar, but didn't win. Warner Bros. felt their seven-year deal with Bette was more than justified. They had a genuine star on their hands. With this success under her belt, she began pushing for stronger and more meaningful roles. In 1935, she received her first Oscar for her role in Dangerous (1935) as Joyce Heath. In 1936, she was suspended without pay for turning down a role that she deemed unworthy of her talent. She went to England, where she had planned to make movies, but was stopped by Warner Bros. because she was still under contract to them. They did not want her to work anywhere. Although she sued to get out of her contract, she lost. Still, they began to take her more seriously after that. Returning after losing her lawsuit, her roles improved dramatically. In 1938, Bette received a second Academy Award nomination for her work in Jezebel (1938) opposite the soon-to-be-legendary Henry Fonda. The only role she didn't get that she wanted was Scarlett O'Hara in Gone with the Wind (1939). Warners wouldn't loan her to David O. Selznick unless he hired Errol Flynn to play Rhett Butler, which both Selznick and Davis thought was a terrible choice. It was rumored she had numerous affairs, among them George Brent and William Wyler, and she was married four times, three of which ended in divorce. She admitted her career always came first. She made many successful films in the 1940s, but each picture was weaker than the last and by the time her Warner Brothers contract had ended in 1949, she had been reduced to appearing in such films as the unintentionally hilarious Beyond the Forest (1949). She made a huge comeback in 1950 when she replaced an ill Claudette Colbert in, and received an Oscar nomination for, All About Eve (1950). She worked in films through the 1950s, but her career eventually came to a standstill, and in 1961 she placed a now famous Job Wanted ad in the trade papers. She received an Oscar nomination for her role as a demented former child star in What Ever Happened to Baby Jane? (1962). This brought about a new round of super-stardom for generations of fans who were not familiar with her work. Two years later, she starred in Hush...Hush, Sweet Charlotte (1964). Bette was married four times. In 1977 she received the AFI's Lifetime Achievement Award and in 1979 she won a Best Actress Emmy for Strangers: The Story of a Mother and Daughter (1979). In 1977-78 she moved from Connecticut to Los Angeles and filmed a pilot for the series Hotel (1983), which she called Brothel. She refused to do the TV series and suffered a stroke during this time. Her last marriage, to actor Gary Merrill, lasted ten years, longer than any of the previous three. In 1985, her daughter Barbara Davis (\"B.D.\") Hyman published a scandalous book about Bette called \"My Mother's Keeper.\" Bette worked in the later 1980s in films and TV, even though a stroke had impaired her appearance and mobility. She wrote a book, \"This 'N That\", during her recovery from the stroke. Her last book was \"Bette Davis, The Lonely Life\", issued in paperback in 1990. It included an update from 1962 to 1989. She wrote the last chapter in San Sebastian, Spain. Sadly, Bette Davis died on October 6, 1989, of metastasized breast cancer, in Neuilly-sur-Seine, Hauts-de-Seine, France. Many of her fans refused to believe she was gone.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2OTQ4NTU2OF5BMl5BanBnXkFtZTcwMzI3MjY5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000012","name":"Bette Davis","nicknames":["The Fourth Warner Brother","The First Lady of Film"],"idIMDB":"nm0000012"},"actorId":"nm0000012","character":"Mrs. Aylwood","urlCharacter":"http://www.imdb.com/character/ch0034442","main":true},{"actorName":"Lynn-Holly Johnson","urlProfile":"http://www.imdb.com/name/nm0000468","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNTk1NzU3M15BMl5BanBnXkFtZTcwNTY3MTcxOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1958","placeOfBirth":" Chicago, Illinois, USA","height":"5' 3\" (1.6 m)","bio":"Lynn-Holly Johnson was born on December 13, 1958 in Chicago, Illinois, USA. She is an actress and director, known for For Your Eyes Only (1981), The Watcher in the Woods (1980) and Ice Castles (1978). She has been married to Kelly James Givens since November 12, 1994. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNTk1NzU3M15BMl5BanBnXkFtZTcwNTY3MTcxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000468","name":"Lynn-Holly Johnson","idIMDB":"nm0000468"},"actorId":"nm0000468","character":"Jan Curtis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kyle Richards","urlProfile":"http://www.imdb.com/name/nm0724202","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MDc4MTcxOV5BMl5BanBnXkFtZTcwNjcxMTEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 January 1969","placeOfBirth":" Hollywood, Los Angeles, California, USA","height":"5' 2\" (1.57 m)","bio":"Kyle Egan Richards was born in Hollywood, California, to Kathleen Mary (Dugan) and Kenneth Edwin Richards, a business executive. Ken died in 1998. Kathleen was diagnosed with breast cancer the same year, and passed away in March of 2002. Kyle, like her sister Kim, began acting at a very young age. She made many appearances on Little House on the Prairie (1974) as Alicia Sanderson Edwards. Kyle has four daughters: Farrah (from her previous relationship to Guraish Aldjufrie), and Alexia, Sophia and Portia from her marriage to real estate agent Mauricio Umansky.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MDc4MTcxOV5BMl5BanBnXkFtZTcwNjcxMTEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0724202","name":"Kyle Richards","idIMDB":"nm0724202"},"actorId":"nm0724202","character":"Ellie Curtis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carroll Baker","urlProfile":"http://www.imdb.com/name/nm0004647","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2ODk4MDk4MV5BMl5BanBnXkFtZTYwMDcwMTM2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 May 1931","placeOfBirth":" Johnstown, Pennsylvania, USA","height":"5' 5\" (1.65 m)","bio":"Carroll Baker was born Karolina Piekarski on May 28, 1931 in Johnstown, Pennsylvania, the daughter of a traveling salesman. She attended community college for a year and then worked as a dancer and magician's assistant. After a brief marriage, she had a small part in Easy to Love (1953), did TV commercials, and had a bit part on Broadway. She studied at the Actors Studio and was married to director Jack Garfein (one daughter, Blanche Baker). Warner Brothers, sensing a future Marilyn Monroe, cast her in Giant (1956), Baby Doll (1956) (Oscar nomination for her thumb-sucking role), The Carpetbaggers (1964) and Harlow (1965) (title role). Moving to Italy, she made films there and in England, Germany, Mexico and Spain . After returning to American films, she married Donald Burton in 1982 and resided in Hampstead, London in the 1980s. They remained together until Burton's death from emphysema in their home in Cathedral City, California in 2007.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2ODk4MDk4MV5BMl5BanBnXkFtZTYwMDcwMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004647","name":"Carroll Baker","idIMDB":"nm0004647"},"actorId":"nm0004647","character":"Helen Curtis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David McCallum","urlProfile":"http://www.imdb.com/name/nm0564724","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NjAwMzQ5N15BMl5BanBnXkFtZTgwNTk2OTg0MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 September 1933","placeOfBirth":" Glasgow, Scotland, UK","birthName":"David Keith McCallum","height":"5' 7\" (1.7 m)","bio":"Since David McCallum's father, David McCallum Sr., was first violinist for the London Philharmonic and his mother, Dorothy Dorman, was a cellist, it's not surprising that David was originally headed for a career in music, playing oboe. He studied briefly at the Royal Academy of Music. He left that, however, for the Royal Academy of Dramatic Art. He made nearly a dozen movies in the United Kingdom before his critically acclaimed work as Lt. Wyatt in Billy Budd (1962). To the older generation, he is perhaps best known for his portrayal of U.N.C.L.E. agent Illya Kuryakin in the hit TV series The Man from U.N.C.L.E. (1964). To younger audience, he is best known for his superlative portrayal of Dr. Donald \"Duckie\" Mallard on the hit CBS series, NCIS (2003). McCallum was first married to actress Jill Ireland, whom he met on March 28 1957 while filming Hell Drivers (1957). In 1963 he introduced Ireland to Charles Bronson when both were filming The Great Escape (1963). She subsequently left McCallum and married Bronson in 1968. McCallum and Ireland had three sons: Paul, Jason (an adopted son who died from an accidental drug overdose in 1989), and Val (short for Valentine). He has been married to Katherine Carpenter since 1967. They have a son, Peter, and a daughter, Sophie. McCallum and his wife are active with charitable organizations that support the United States Marine Corps: Katherine's father was a Marine who served in the Battle of Iwo Jima, and her brother lost his life in the Vietnam War. McCallum has six grandchildren.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NjAwMzQ5N15BMl5BanBnXkFtZTgwNTk2OTg0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0564724","name":"David McCallum","idIMDB":"nm0564724"},"actorId":"nm0564724","character":"Paul Curtis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Benedict Taylor","urlProfile":"http://www.imdb.com/name/nm0852028","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc1NzQyMDQ3NF5BMl5BanBnXkFtZTgwNDM5NjI0MDI@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1960","placeOfBirth":" London, England, UK","birthName":"Benedict Sean Taylor","bio":"Benedict Taylor was born on April 18, 1960 in London, England as Benedict Sean Taylor. He is an actor, known for Star Wars: Episode I - The Phantom Menace (1999), Notes on a Scandal (2006) and The Watcher in the Woods (1980).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc1NzQyMDQ3NF5BMl5BanBnXkFtZTgwNDM5NjI0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0852028","name":"Benedict Taylor","idIMDB":"nm0852028"},"actorId":"nm0852028","character":"Mike Fleming","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frances Cuka","urlProfile":"http://www.imdb.com/name/nm0191311","urlPhoto":"","biography":{"dateOfBirth":"21 August 1936","placeOfBirth":" London, England, UK","height":"5' 2½\" (1.59 m)","bio":"Born in London in 1936 to Joseph and Letitia Cuka the family eventually moved to Hove where Frances was educated at Brighton and Hove High School. She trained at the Guildhall School of Music and Drama then made her stage debut in 1955 in 'Meet Mr Callaghan' in Warrington. Following work with several repertory companies she joined the Theatre Workshop and appeared with them at the Zurich Festival and the Moscow Art Theatre in 1957. She then played the part of Jo in 'A Taste of Honey' in 1958 at the Theatre Royal, Stratford, East London transferring with it to the West End then Broadway followed by an American tour.Further West End appearances include 'Vanity Fair', 'Sweet Bird of Youth', 'Waters of the Moon', 'The Wild Duck' and a number with the R.S.C. in 'Days in Trees', 'Travesties' Nicholas Nickelby' She made her television debut in 1964 in the 'Twelve Good Men' episode of 'The Hidden truth' series which was followed by episodes of 'Adam Adamant Lives', 'The Informer', 'The Champions', 'Within These Walls', 'Crown Court', 'Ruth Rendell Mysteries', 'The Bill,' 'Doctors' and Casualty' amongst others. Her appearances on the big screen have been very few. She made her film debut in the little known comedy 'Over the Odds' in 1961 and didn't appear on screen again until 1970 when she played Bob Cratchit's wife in the musical version of 'Scrooge'. The best known of her films is 'Henry VIII and His Six Wives' in 1972 in which she played Catherine of Aragon.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0191311","name":"Frances Cuka","idIMDB":"nm0191311"},"actorId":"nm0191311","character":"Mary Fleming","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Pasco","urlProfile":"http://www.imdb.com/name/nm0664390","urlPhoto":"","biography":{"dateOfBirth":"18 July 1926","placeOfBirth":" Barnes, London, England, UK","birthName":"Richard Edward Pasco","bio":"Richard Pasco was born on July 18, 1926 in Barnes, London, England as Richard Edward Pasco. He was an actor, known for Mrs Brown (1997), Drummonds (1985) and The Gorgon (1964). He was married to Barbara Leigh-Hunt and Greta Watson. He died on November 12, 2014 in Warwickshire, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0664390","name":"Richard Pasco","idIMDB":"nm0664390"},"actorId":"nm0664390","character":"Tom Colley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ian Bannen","urlProfile":"http://www.imdb.com/name/nm0000846","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NDQyMDU4NF5BMl5BanBnXkFtZTYwMTk3OTU3._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1928","placeOfBirth":" Airdrie, Lanarkshire, Scotland, UK","height":"6' 1\" (1.85 m)","bio":"Scottish character actor and occasional leading man who enlivened scores of fine films in Britain and America. His father was a lawyer in a small town in Lanarkshire. Bannen served in the army and attended Ratcliffe College, Leicestershire. His first acting role came in a 1947 Dublin production of \"Armlet of Jade\". He became a successful figure on the London stage, making a name for himself in the plays of both William Shakespeare and Eugene O'Neill. He was an original member of the Royal Shakespeare Company and appeared on Broadway as well. His film debut occurred in the mid-1950s, and he quickly rose to prominence, primarily in a wide range of supporting roles. His performance as \"Crow\" in The Flight of the Phoenix (1965) won him an Oscar nomination as Best Supporting Actor. Thirty years and scores of films later, Bannen was given the Lifetime Achievement Award of the British Academy of Film and Television Arts. Long after his leading man days had passed, he won new acclaim for his role as the touchingly crafty villager in Waking Ned Devine (1998). The following year he died in an automobile accident. He was survived by his wife of 23 years.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NDQyMDU4NF5BMl5BanBnXkFtZTYwMTk3OTU3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000846","name":"Ian Bannen","idIMDB":"nm0000846"},"actorId":"nm0000846","character":"John Keller","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Katharine Levy","urlProfile":"http://www.imdb.com/name/nm0506496","urlPhoto":"","biography":{"dateOfBirth":"1961","placeOfBirth":" Hampstead, London, England, UK","bio":"Katharine Levy was born in 1961 in Hampstead, London, England. She is an actress, known for The Watcher in the Woods (1980), Firelight (1997) and Much Ado About Nothing (1984).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0506496","name":"Katharine Levy","idIMDB":"nm0506496"},"actorId":"nm0506496","character":"Karen Aylwood","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eleanor Summerfield","urlProfile":"http://www.imdb.com/name/nm0838628","urlPhoto":"","biography":{"dateOfBirth":"7 March 1921","placeOfBirth":" St. Pancras, London, England, UK","birthName":"Eleanor Audrey Summerfield","height":"5' 6\" (1.68 m)","bio":"Known for her small yet earthy Brit portrayals on film, Eleanor Summerfield was born in London on March 7, 1921, initially trained at the Royal Academy of Dramatic Art (1937). The hard-looking, blue-eyed blonde began in films in 1947 but created some waves first on stage opposite Cicely Courtneidge in \"Her Excellency\" at the London Hippodrome in 1949. She followed that with a top role in a rather mediocre musical entitled \"Golden City.\" Musicals would be a strong suit for her in the ensuing years including a more glamorous role in \"When in Rome\" (1959) alongside June Laverick. Eleanor made her last West End musical in 1974 in a show based on the cartoon character of Osbert Lancaster. A popular radio actress and a regular on BBC Radio Four panel show \"Many a Slip,\" she positively shined on TV in a number of comedy series as she entered her matronly years. She had the difficult task of replacing Dora Bryan in the established program \"Our Dora\" when Ms. Bryan abruptly left the series after the sudden death of her first child. Now retitled My Wife's Sister (1956), the show, and Eleanor, succeeded quite well. During her five-decade career, she added bite to a number of films, often raucous comedies, including Laughter in Paradise (1951), Uncle Willie's Bicycle Shop (1954), Dentist in the Chair (1960), Operation Snafu (1961) and Some Will, Some Won't (1970), which was a remake of the earlier film Laughter in Paradise (1951). Long married to actor Leonard Sachs in 1947, they produced two sons; one son, Robin Sachs, became an actor in his own right. Her husband died in 1990 and Eleanor followed him a decade later on July 13, 2001, in London. She was 80.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0838628","name":"Eleanor Summerfield","idIMDB":"nm0838628"},"actorId":"nm0838628","character":"Mrs. Thayer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Georgina Hale","urlProfile":"http://www.imdb.com/name/nm0354914","urlPhoto":"","biography":{"dateOfBirth":"4 August 1943","placeOfBirth":" Ilford, Essex, England, UK","bio":"Georgina Hale is an accomplished stage actress who has made many memorable forays in cinema. Most notably in the films of Ken Russell including her performance as Alma Mahler, in a wonderful and visually rich biopic on the composer Mahler (1974) which she won a BAFTA (British Academy Award) for. Two other standout performances were in Russell's notorious The Devils (1971) and the Twiggy musical The Boyfriend in which she deliciously plays Fay, camping it up, in a backstage lesbian sub plot. She has made in-joke cameos in two further Russell films: Lisztomania (1975) and Valentino (1977). Unfortunately roles were not forthcoming after her BAFTA win (who knows why?) and she made some pretty bad movie choices such as the film version of the tacky Joan Collins novel The World Is Full of Married Men (1979) and McVicar (1980) as well as the occasional stunner such as Butley (1974), written by playwright Simon Gray. Georgina has appeared in many of Gray's stage plays (many have been filmed for British television with her starring) along side Alan Bates and Glenda Jackson and continues to work in British theatre. Georgina has made many appearances as guest star in television series including: Upstairs, Downstairs (1971), The Protectors (1972), Ladykillers (1980), Minder (1979), Boon (1986), One Foot in the Grave (1990), Murder Most Horrid (1991), The Vicar of Dibley (1994), three episodes of Doctor Who (1963) and many many more. She has starred in two television series: Budgie (1971), a successful series in the seventies, and in the early nineties a cult children's series based around a witch like figure called T-Bag. Most recently she has appeared in a comic role in Preaching to the Perverted (1997) in which her character points out that sometimes one has to debase one's self to further one's career. This film may not further her career (at age 55 she does a Sharon Stone under-table leg trick) but it will add to her growing reputation as one of the UK's favorite cult actresses.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWU4ZjliZTItMzM4Yy00NDBjLTgzMWEtYmQyNDA5NzFkMzhlXkEyXkFqcGdeQXVyMjIxMzMyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0354914","name":"Georgina Hale","idIMDB":"nm0354914"},"actorId":"nm0354914","character":"Young Mrs. Aylwood","urlCharacter":"http://www.imdb.com/character/ch0034442","main":true}],"seasons":[],"idIMDB":"tt0081738","urlIMDB":"http://www.imdb.com/title/tt0081738","business":{"budget":null,"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1979/\">1979</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 24 min (84 min)"],"soundMix":["Dolby"],"color":["Color (Technicolor)"],"aspectRatio":["1.75 : 1"],"camera":["Panaflex Camera and Lenses by Panavision","Panavision Cameras and Lenses"],"laboratory":["Technicolor"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.4","filmingLocations":[{"location":"England, UK"}],"rated":"PG","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1982","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best International Film","names":[]},{"category":"Best Supporting Actress","names":[{"name":"Kyle Richards","id":"nm0724202","role":null}]}]}]},{"award":"The Stinkers Bad Movie Awards 1981","titlesAwards":[{"titleAwardOutcome":"Won Stinker Award","categories":[{"category":"Worst Performance by a Child in a Featured Role","names":[{"name":"Kyle Richards","id":"nm0724202","role":null}]}]},{"titleAwardOutcome":"Nominated Stinker Award","categories":[{"category":"Worst Supporting Actress","names":[{"name":"Lynn-Holly Johnson","id":"nm0000468","role":null},{"name":"For Your Eyes Only","id":"tt0082398","role":null}]}]}]},{"award":"Young Artist Awards 1982","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Young Motion Picture Actress","names":[{"name":"Kyle Richards","id":"nm0724202","role":null}]}]}]}],"votes":"4,177","type":"Movie","companyCreditsSimple":[{"idCompany":"co0098836","name":"Walt Disney Productions"}],"keywords":{"keywords":["teenage girl","occult","solar eclipse","past","eclipse","country home","tomb","ruins","dirt bike","fire","barn","fireplace","church","farm","supernatural","full moon","lantern","composer","blindfolded","cut finger","writer","premonition","little girl","mask","dream","musician","dead daughter","stalled car","reality","fun house","creature","amusement park ride","typewriter","horseback riding","dimension","husband wife relationship","bicycling","sheet music","thunder","father daughter relationship","tears","mother son relationship","fairground","symbol","lightning","female protagonist","subjective camera","writing backwards","cracked mirror","supernatural power","sister sister relationship","psychic force","paranormal phenomena","mirror","family relationships","chase","blonde","writing on mirror","wind gust","victorian house","vanishing woman","triangle","transference","surrealism","station wagon","stained glass","shattering glass","puppy","psychic power","other world","mother daughter relationship","lightning strike","initiation rite","humming","hermit","ghostly voice","flashing light","extrasensory perception","english village","distorted voice","collapsing bridge","church bell","ceremony","car crash","brushing hair","blue light","bicycle","backward writing","abandoned church","gothic","woods","unexplainable events","talking in sleep","shared secret","secret society","seance","real estate agent","rainstorm","portable radio","pond","pet dog","old house","mysterious woman","mysterious stranger","music box","grand piano","flashback","exploding car","england","drowning","disappearance","cult film","coffin","childhood friend","chapel","carnival","candlelight","broken mirror","broken glass","boyfriend girlfriend relationship","backwards","apparition","alternate dimension","trapped in a mirror","bell","children","initiation","missing person","alien","blindfold","spirit","forest","old woman","revenge","mansion","horror for children","motocross","pianist","runaway horse","house of mirrors","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 20:23:00"}}