{"data":{"movies":[{"title":"Capone","originalTitle":"","year":"1975","releaseDate":"19750416","directors":[{"name":"Steve Carver","id":"nm0142587"}],"writers":[{"name":"Howard Browne","id":"nm0115006"}],"runtime":"101 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQzNTgzNDk1Ml5BMl5BanBnXkFtZTYwODQ0Mjg5._V1.jpg","countries":["USA"],"languages":["English","Italian"],"genres":["Biography","Crime","Drama"],"plot":"The story of the rise and fall of the infamous Chicago gangster Al Capone and the control he exhibited over the city during the prohibition years. Unusually, briefly covering the years after Capone was imprisoned.","simplePlot":"The story of the rise and fall of the infamous Chicago gangster Al Capone and the control he exhibited over the city during the prohibition years. Unusually, briefly covering the years ... ","actors":[{"actorName":"Ben Gazzara","urlProfile":"http://www.imdb.com/name/nm0001262","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NzA5NTAyOF5BMl5BanBnXkFtZTcwNDM0MDYzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1930","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Biagio Anthony Gazzara","height":"5' 10½\" (1.79 m)","bio":"Ben Gazzara's screen career began with two critically acclaimed roles as heavies in the late 1950s. He turned to television in the 1960s but made a big screen comeback with roles in three John Cassavetes films in the 1970s. The 1980s and 1990s saw Gazzara work more frequently than ever before in character parts. If he never became the leading man his early films and stage work promised, he had a career notable for its longevity. He was born Biagio Anthony Gazzara on August 28, 1930, in New York City. The son of a Sicilian immigrant laborer, he grew up on New York's tough Lower East Side. After seeing Laurette Taylor in \"The Glass Menagerie,\" Gazzara decided he wanted to become an actor. He studied engineering (unhappily) but quit after receiving an acting scholarship (he worked under well-known coach Erwin Piscator). Gazzara then joined the Actors Studio, where a group of students improvised a play from Calder Willingham's novel End as a Man. The tale of a brutal southern military academy reached Broadway slightly changed in 1953 but with Gazzara still in the principal role. It was a star making part (he won a Theatre World award) and he then played leads in the original productions of \"Cat on a Hot Tin Roof\" (1955) and \"A Hatful of Rain\" (1955) (he was nominated for a Tony). Bigger names Paul Newman and Don Murray played those last two roles on the big screen but Gazzara made his movie debut in The Strange One (1957) the film version of \"End as a Man.\" The film was a critical but not commercial success. His next role was as the defendant in Anatomy of a Murder (1959) which was a big hit. Gazzara followed this with an Italian venture co-starring Anna Magnani, Larmes de joie (1960), two Hollywood films The Young Doctors (1961) and Convicts 4 (1962) and then another Italian film Conquered City (1962). None of these did much for his career, and he turned to television. He appeared in the successful series Arrest and Trial (1963) and Run for Your Life (1965). In between, he made A Rage to Live (1965), a film version of John O'Hara's novel. He returned to films in The Bridge at Remagen (1969) and with a cameo appearance in If It's Tuesday, This Must Be Belgium (1969). His buddy in the cameo was John Cassavetes, who directed and co-starred with him in Husbands (1970), a critical success. Gazzara made two more well-received films with his good friend Cassavetes: The Killing of a Chinese Bookie (1976) and Opening Night (1977). Gazzara's other films in the 1970s were undistinguished apart from the sprawling Voyage of the Damned (1976) and a rare leading role in director Peter Bogdanovich's Saint Jack (1979). Bloodline (1979) and They All Laughed (1981) (also directed by Bogdanovich) were only notable because of Gazzara's off-screen relationship with co-star Audrey Hepburn (ironically, Gazzara had declined to make his screen debut in War and Peace (1956) starring Hepburn). Conte de la folie ordinaire (1981) was another lead for Gazzara, but it received a mixed critical reception. Other big-screen roles in the 1980s were scarce apart from Road House (1989), a Patrick Swayze vehicle that Gazzara believed out of all his films had been the most repeated on television. He worked much on the small screen, including the groundbreaking television movie An Early Frost (1985), playing the father of an AIDS victim. The 1990s saw Gazzara working like never before, appearing in 38 films. Most were for free-to-air television or cable but he also worked on the big screen in The Spanish Prisoner (1997), The Big Lebowski (1998), Happiness (1998) and Summer of Sam (1999). His television work included a guest appearance as an executive assistant attorney in a 2001 episode of Law & Order: Special Victims Unit (1999)","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NzA5NTAyOF5BMl5BanBnXkFtZTcwNDM0MDYzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001262","name":"Ben Gazzara","nicknames":["Benny"],"idIMDB":"nm0001262"},"actorId":"nm0001262","character":"Al Capone","urlCharacter":"http://www.imdb.com/character/ch0003952","main":true},{"actorName":"Harry Guardino","urlProfile":"http://www.imdb.com/name/nm0345340","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTQ4OTM3MF5BMl5BanBnXkFtZTcwNTA3MjIyOA@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 December 1925","placeOfBirth":" New York City, New York, USA","birthName":"Harry Vincent Guardino","height":"5' 10\" (1.78 m)","bio":"Virile Brooklyn-born actor Harry Guardino, with dark, wavy hair and a perpetual worried look on his craggy-looking mug, started out in the acting school of hard knocks, slumming for nearly a decade in small, obscure 'tough guy' film parts in the early to mid 50s. A definite man's man, he finally attracted some attention on the Broadway stage with \"A Hatful of Rain\" (1956) and was nominated for a Tony for \"One More River\" in 1960. By then, juicier film roles began to gravitate his way, stealing the thunder out from under Cary Grant and Sophia Loren as a comic handyman in Houseboat (1958). Harry went on to play other brash guys with and without a comic edge to them in both crime and war stories such as Pork Chop Hill (1959), Cinq femmes marquées (1960), Hell Is for Heroes (1962), Madigan (1968), Dirty Harry (1971) and The Enforcer (1976), the last two pairing up with Clint Eastwood. He even played \"Barabbas\" in the classic bible epic King of Kings (1961) for a change of pace and scenery. More and more, however, TV became Harry's favorite medium. He portrayed district attorney \"Hamilton Burger\" in the 70s revival series of \"Perry Mason\" and co-starred in dozens of grim, rugged mini-movies often as a street-smart cop. Not so true to nature, he found an unlikely outlet in musical theatre in later years, going on to star in productions of \"Woman of the Year\" and \"Chicago\". A solid, durable, all-round actor, he died of lung cancer in 1995 at age 69.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTQ4OTM3MF5BMl5BanBnXkFtZTcwNTA3MjIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0345340","name":"Harry Guardino","idIMDB":"nm0345340"},"actorId":"nm0345340","character":"Johnny Torrio","urlCharacter":"http://www.imdb.com/character/ch0069163","main":true},{"actorName":"Susan Blakely","urlProfile":"http://www.imdb.com/name/nm0086806","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzNTIzMjQzM15BMl5BanBnXkFtZTgwNDk3MTQyMDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1948","placeOfBirth":" Frankfurt am Main, Hesse, Germany","bio":"She stands out easily in a crowd with her wholesome beauty, knock-out figure and dazzling smile. Ever-radiant TV and film resident Susan Blakely found success on several paths she chose for herself over the years -- first as a model, then as an award-winning actress on TV and, finally, as a jewelry designer. The trim and trendy blonde also enhanced a mild stream of popular films during the 1970s and 1980s. Born in Frankfurt, Germany, she is the daughter of U.S. Army Colonel Lawrence Blakely. While growing up, she traveled extensively throughout the world with her family including Korea, Hawaii and, finally, Texas. Following a year of study at the University of Texas, Susan moved to New York and managed to secure a place for herself as a high-priced magazine and TV ad model. At the same time, she was encouraged to try her hand at acting and studied at the Neighborhood Playhouse. Married in 1969 to lawyer and screenwriting hopeful Todd Merer, she chanced a move to Hollywood to seek her fame and fortune. Billed initially as Susie Blakely, she was cast in small, capricious, deb-like turns in such films as Savages (1972) (her debut) and The Way We Were (1973). Her first popular movie role came about surrounded by a high-and-mighty all-star cast in Irwin Allen's epic disaster The Towering Inferno (1974), as the spoiled princess-like daughter of unscrupulous skyscraper builder William Holden and wife of callous, pretty-boy opportunist Richard Chamberlain. Lightweight as the role was, Susan willingly accepted the challenge of proving herself in Hollywood as more than just another starlet with a gorgeous face. She did...and more...by earning a Golden Globe and Emmy nomination for her exceptional work as \"Julie Prescott\" in the acclaimed TV mini-series epic Rich Man, Poor Man (1976) with Peter Strauss and Nick Nolte vying for her attention. It was star-making turns for all three leads. This monumental acting opportunity kicked off a highly rewarding career in TV mini-movies, playing an array of flawed but fascinating and newsworthy ladies, including Hitler mistress Eva Braun opposite Anthony Hopkins in Le bunker (1981); tormented actress Frances Farmer in Will There Really Be a Morning? (1983); political wife Joan Bennett Kennedy in The Ted Kennedy Jr. Story (1986); and crime attorney Leslie Abramson in Honor Thy Father and Mother: The True Story of the Menendez Murders (1994). Challenging roles continued to pour in that belied her pretty-girl image -- ranging from drug addicts to a housewife who changes into a werewolf! Less in the acting limelight these days, Susan nevertheless accomplished an award-winning turn in the low-profile film Hungry Hearts (2002), then starred on stage in the 2006 world premiere of \"Diva!\" at the La Jolla Playhouse. In recent years, she has broadened her horizons once again as a semi-precious jewelry designer...and once again she has met with great success. Divorced from her first husband in the 1970s, Susan remarried in 1982. Her present husband, media consultant, litigation and political adviser Steve Jaffe, has also reaped rewards as a film and television producer. Many of his projects have included Susan -- the afore-mentioned Frances Farmer TV biography, the TV-movie A Cry for Love (1980), and the film Russian Holiday (1992) [aka Russian Roulette]. They reside in the Beverly Hills area.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzNTIzMjQzM15BMl5BanBnXkFtZTgwNDk3MTQyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0086806","name":"Susan Blakely","idIMDB":"nm0086806"},"actorId":"nm0086806","character":"Iris Crawford","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sylvester Stallone","urlProfile":"http://www.imdb.com/name/nm0000230","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTk3NDU2OV5BMl5BanBnXkFtZTcwNTA3MTI0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1946","placeOfBirth":" New York City, New York, USA","birthName":"Sylvester Gardenzio Stallone","height":"5' 9½\" (1.77 m)","bio":"This athletically built, dark-haired American actor/screenwriter/director may never be mentioned by old-school film critics in the same breath as, say, Richard Burton or Alec Guinness; however, movie fans worldwide have been flocking to see Stallone's films for over 30 years, making \"Sly\" one of Hollywood's biggest-ever box office draws. Sylvester Stallone was born on July 6, 1946, in New York's gritty Hell's Kitchen, to Jackie Stallone (née Labofish), an astrologer, and Frank Stallone, a beautician and hairdresser. His father was an Italian immigrant, and his mother's heritage is half French (from Brittany) and half German. The young Stallone attended the American College of Switzerland and the University of Miami, eventually obtaining a B.A. degree. Initially, he struggled in small parts in films such as the soft-core The Party at Kitty and Stud's (1970), the thriller Klute (1971) and the comedy Bananas (1971). He got a crucial career break alongside fellow young actor Henry Winkler, sharing lead billing in the effectively written teen gang film The Lords of Flatbush (1974). Further film and television roles followed, most of them in uninspiring productions except for the opportunity to play a megalomaniac, bloodthirsty race driver named \"Machine Gun Joe Viterbo\" in the Roger Corman-produced Death Race 2000 (1975). However, Stallone was also keen to be recognized as a screenwriter, not just an actor, and, inspired by the 1975 Muhammad Ali-Chuck Wepner fight in Cleveland, Stallone wrote a film script about a nobody fighter given the \"million to one opportunity\" to challenge for the heavyweight title. Rocky (1976) became the stuff of cinematic legends, scoring ten Academy Award nominations, winning the Best Picture Award of 1976 and triggering one of the most financially successful movie franchises in history! Whilst full credit is wholly deserved by Stallone, he was duly supported by tremendous acting from fellow cast members Talia Shire, Burgess Meredith and Burt Young, and director John G. Avildsen gave the film an emotive, earthy appeal from start to finish. Stallone had truly arrived on his terms, and offers poured in from various studios eager to secure Hollywood's hottest new star. Stallone followed Rocky (1976) with F.I.S.T. (1978), loosely based on the life of Teamsters boss \"Jimmy Hoffa\", and Paradise Alley (1978) before pulling on the boxing gloves again to resurrect Rocky Balboa in the sequel Rocky II (1979). The second outing for the \"Italian Stallion\" wasn't as powerful or successful as the first \"Rocky\"; however, it still produced strong box office. Subsequent films Nighthawks (1981) and Victory (1981) failed to ignite with audiences, so Stallone was once again lured back to familiar territory with Rocky III (1982) and a fearsome opponent in \"Clubber Lang\" played by muscular ex-bodyguard Mr. T. The third \"Rocky\" installment far outperformed the first sequel in box office takings, but Stallone retired his prizefighter for a couple of years as another mega-franchise was about to commence for the busy actor. The character of Green Beret \"John Rambo\" was the creation of Canadian-born writer David Morrell, and his novel was adapted to the screen with Stallone in the lead role in First Blood (1982), also starring Richard Crenna and Brian Dennehy. The movie was a surprise hit that polarized audiences because of its commentary about the Vietnam war, which was still relatively fresh in the American public's psyche. Political viewpoints aside, the film was a worldwide smash, and a sequel soon followed with Rambo: First Blood Part II (1985), which drew even stronger criticism from several quarters owing to the film's plotline about American MIAs allegedly being held in Vietnam. But they say there is no such thing as bad publicity, and \"John Rambo's\" second adventure was a major money spinner for Stallone and cemented him as one of the top male stars of the 1980s. Riding a wave of amazing popularity, Stallone called on old sparring partner Rocky Balboa to climb back into the ring to defend American pride against a Soviet threat in the form of a towering Russian boxer named \"Ivan Drago\" played by curt Dolph Lundgren in Rocky IV (1985). The fourth outing was somewhat controversial with \"Rocky\" fans, as violence levels seemed excessive compared to previous \"Rocky\" films, especially with the savage beating suffered by Apollo Creed, played by Carl Weathers, at the hands of the unstoppable \"Siberian Express\". Stallone continued forward with a slew of macho character-themed films that met with a mixed reception from his fans. Cobra (1986) was a clumsy mess, Over the Top (1987) was equally mediocre, Rambo III (1988) saw Rambo take on the Russians in Afghanistan, and cop buddy film Tango & Cash (1989) just did not quite hit the mark, although it did feature a top-notch cast and there was chemistry between Stallone and co-star Kurt Russell. Philadelphia's favorite mythical boxer moved out of the shadows for his fifth screen outing in Rocky V (1990) tackling Tommy \"Machine\" Gunn played by real-life heavyweight fighter Tommy Morrison, the great-nephew of screen legend John Wayne. Sly quickly followed with the lukewarm comedy Oscar (1991), the painfully unfunny Stop! Or My Mom Will Shoot (1992), the futuristic action film Demolition Man (1993), and the comic book-inspired Judge Dredd (1995). Interestingly, Stallone then took a departure from the gung-ho steely characters he had been portraying to stack on a few extra pounds and tackle a more dramatically challenging role in the intriguing Cop Land (1997), also starring Robert De Niro and Ray Liotta. It isn't a classic of the genre, but Cop Land (1997) certainly surprised many critics with Stallone's understated performance. Stallone then lent his vocal talents to the animated adventure story Antz (1998), reprised the role made famous by Michael Caine in a terrible remake of Get Carter (2000), climbed back into a race car for Driven (2001), and guest-starred as the \"Toymaker\" in the third chapter of the immensely popular \"Spy Kids\" film series, Spy Kids 3-D: Game Over (2003). Showing that age had not wearied his two most popular franchises, Stallone has most recently brought back never-say-die boxer Rocky Balboa to star in, well, what else but Rocky Balboa (2006), and Vietnam veteran Rambo (2008) will reappear after a 20-year hiatus to once again right wrongs in the jungles of Thailand. Love him or loathe him, Sylvester Stallone has built an enviable and highly respected career in Hollywood; plus, he has considerably influenced modern popular culture through several of his iconic film characters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTk3NDU2OV5BMl5BanBnXkFtZTcwNTA3MTI0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000230","name":"Sylvester Stallone","nicknames":["Sly","Michael","The Italian Stallion","Binky","Sly Stallone"],"idIMDB":"nm0000230"},"actorId":"nm0000230","character":"Frank Nitti","urlCharacter":"http://www.imdb.com/character/ch0003960","main":true},{"actorName":"John Cassavetes","urlProfile":"http://www.imdb.com/name/nm0001023","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNjI3NTgwM15BMl5BanBnXkFtZTYwMjg2MDM2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 December 1929","placeOfBirth":" New York City, New York, USA","birthName":"John Nicholas Cassavetes","height":"5' 7\" (1.7 m)","bio":"John Cassavetes was born on December 9, 1929 in New York City, New York, USA as John Nicholas Cassavetes. He was an actor and director, known for Rosemary's Baby (1968), The Dirty Dozen (1967) and Opening Night (1977). He was married to Gena Rowlands. He died on February 3, 1989 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNjI3NTgwM15BMl5BanBnXkFtZTYwMjg2MDM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001023","name":"John Cassavetes","idIMDB":"nm0001023"},"actorId":"nm0001023","character":"Frankie Yale","urlCharacter":"http://www.imdb.com/character/ch0069164","main":true},{"actorName":"Frank Campanella","urlProfile":"http://www.imdb.com/name/nm0132100","urlPhoto":"","biography":{"dateOfBirth":"12 March 1919","placeOfBirth":" New York City, New York, USA","height":"6' 5\" (1.96 m)","bio":"Frank Campanella was born on March 12, 1919 in New York City, New York, USA. He was an actor, known for Seconds (1966), Pretty Woman (1990) and The Producers (1967). He died on December 30, 2006 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0132100","name":"Frank Campanella","nicknames":["Uncle Frank"],"idIMDB":"nm0132100"},"actorId":"nm0132100","character":"Big Jim Colosimo","urlCharacter":"http://www.imdb.com/character/ch0069165","main":true},{"actorName":"John Orchard","urlProfile":"http://www.imdb.com/name/nm0649443","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5OTQ2OTE4M15BMl5BanBnXkFtZTgwOTY3ODc5MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 November 1928","placeOfBirth":" Lambeth, London, England, UK","birthName":"John Michael Charles Orchard","height":"6' (1.83 m)","bio":"John Orchard was born on November 15, 1928 in Lambeth, London, England as John Michael Charles Orchard. He was an actor, known for Bedknobs and Broomsticks (1971), Ice Station Zebra (1968) and The Whisperers (1967). He died on November 3, 1995 in London.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5OTQ2OTE4M15BMl5BanBnXkFtZTgwOTY3ODc5MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0649443","name":"John Orchard","idIMDB":"nm0649443"},"actorId":"nm0649443","character":"Dion O'Banion","urlCharacter":"http://www.imdb.com/character/ch0069167","main":true},{"actorName":"Carmen Argenziano","urlProfile":"http://www.imdb.com/name/nm0034492","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzdkZWJjNWUtODczNC00NGRhLTllN2QtMzU2N2NkZDI3OTc2XkEyXkFqcGdeQXVyMjc3Njc5NDQ@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 October 1943","placeOfBirth":" Sharon, Pennsylvania, USA","birthName":"Carmen Antimo Argenziano","height":"5' 10\" (1.78 m)","bio":"Carmen Argenziano was born on October 27, 1943 in Sharpsville, Pennsylvania, as Carmen Antimo Argenziano. He is an actor known for his work on hundreds of films and TV series throughout his fifty year career. He was in The Accused, Stand And Deliver, The Godfather: Part II, Identity, and many more, including James Franco's production of Don Quixote, playing the title character. He played the memorable and well loved character Jacob Carter in the TV series Stargate SG1. He is a Lifetime Member of The Actors Studio.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzdkZWJjNWUtODczNC00NGRhLTllN2QtMzU2N2NkZDI3OTc2XkEyXkFqcGdeQXVyMjc3Njc5NDQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0034492","name":"Carmen Argenziano","idIMDB":"nm0034492"},"actorId":"nm0034492","character":"Jack McGurn","urlCharacter":"http://www.imdb.com/character/ch0069168","main":true},{"actorName":"George Chandler","urlProfile":"http://www.imdb.com/name/nm0151370","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2E0N2Q0YWUtZjg5YS00MjY2LTg4ZGEtY2RmNDBhODVmYzZmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 June 1898","placeOfBirth":" Waukegan, Illinois, USA","height":"5' 8\" (1.73 m)","bio":"After military service during the First World War, Chandler studied at the University of Illinois, financing his studies by playing jazz violin in a band. During the early 1920's, he returned to the vaudeville circuit and began in films from 1928. Most of his early efforts were short one- and two-reel comedies, arguably his best being The Fatal Glass of Beer (1933) with W.C. Fields. While he mostly appeared in comedy and had countless bit parts, he later proved that he could handle meatier assignments, such as the simple-minded husband of Ginger Rogers, Amos, in Roxie Hart (1942). George was a protege of director William A. Wellman , who used him in twenty of his films. On television, he made his mark as the jovial, well-remembered Uncle Petrie in Lassie (1954). He also had many good guest spots in other series, a particularly enjoyable one being the old man who sells a haunted Model A to dubious second-hand car dealer Jack Carson(with interesting results) in The Twilight Zone (1959) episode 'The Whole Truth' (1961). Prior to replacing Ronald Reagan as president of the Screen Actor's Guild, Chandler had been treasurer for twelve years (1948-60).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2E0N2Q0YWUtZjg5YS00MjY2LTg4ZGEtY2RmNDBhODVmYzZmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0151370","name":"George Chandler","idIMDB":"nm0151370"},"actorId":"nm0151370","character":"Robert E. Crowe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Davis Chandler","urlProfile":"http://www.imdb.com/name/nm0151405","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWRjZGI4NDYtMzBjYS00N2JmLTlmZmItZGQyMWJkYjhhZTE3XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 January 1935","placeOfBirth":" Hinton, West Virginia, USA","height":"5' 10\" (1.78 m)","bio":"Character actor John Davis Chandler was born on January 28, 1935, in Hinton, West Virginia. He was raised in Charleston, West Virginia. Tall and thin, with fair hair, piercing blue eyes, a pale complexion and a nasal, whiny voice, Chandler specialized in portraying mean, neurotic and dangerous villains. He made an impressive film debut in his sole starring part as the titular sniveling, psychotic, homicidal weasel gangster in Mad Dog Coll (1961). He acted in a trio of Westerns for director Sam Peckinpah, and is especially memorable (and frightening) as the creepy Jimmy Hammond in the magnificent Ride the High Country (1962). He was excellent as vicious punk Arthur Reardon in The Young Savages (1961). He made an effectively loathsome appearance as a vile bushwhacker in the supremely spooky horror-western The Shadow of Chikara (1977) and had a nice bit as a bounty hunter in Clint Eastwood's terrific The Outlaw Josey Wales (1976). He even played a good guy--of sorts--in Peckinpah's Major Dundee (1965). Chandler popped up in three entertaining drive-in exploitation features for director William Grefe: at his wacky best as the crazed, doped-up Acid in The Hooked Generation (1968), a foul shark poacher in the fun Jaws (1975) copy Mako: The Jaws of Death (1976) and an evil pot farmer in Whiskey Mountain (1977). Among the many TV shows John did guest spots on are Star Trek: Deep Space Nine (1993), Walker, Texas Ranger (1993), Chicago Hope (1994) ER (1994), Simon & Simon (1981), Hunter (1984), Murder, She Wrote (1984), Hill Street Blues (1981), T.J. Hooker (1982), Fantasy Island (1977), The Incredible Hulk (1978), Police Woman (1974), Gunsmoke (1955), Adam-12 (1968), The Fugitive (1963), Combat! (1962), The Rifleman (1958), Route 66 (1960) and The Virginian (1962). In real life he was an avid practitioner of yoga. Chandler died at age 75 on February 16, 2010 in Toluca Lake, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWRjZGI4NDYtMzBjYS00N2JmLTlmZmItZGQyMWJkYjhhZTE3XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0151405","name":"John Davis Chandler","idIMDB":"nm0151405"},"actorId":"nm0151405","character":"Hymie Weiss","urlCharacter":"http://www.imdb.com/character/ch0069169","main":true},{"actorName":"Royal Dano","urlProfile":"http://www.imdb.com/name/nm0200455","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MDI5OTQzNF5BMl5BanBnXkFtZTcwMjg4MzI4Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 November 1922","placeOfBirth":" New York City, New York, USA","birthName":"Royal Edward Dano Sr.","height":"6' 2\" (1.88 m)","bio":"Royal Dano was undoubtedly one of the best, most quirky and striking character actors to ever grace the big and small screen alike in a lengthy and impressive career which spanned 42 years. Royal Edward Dano was born on November 16, 1922 in New York City, to Mary Josephine (O'Connor) and Caleb Edward Dano, a newspaper printer. He was of mostly Irish descent (his mother was an immigrant). Royal ran away from home at age twelve and lived in such states as Texas, Florida and California. He struck a deal with his father to continue his education, but still be able to travel around the country. Dano eventually attended New York University. His performing career began as part of the 44th Special Service Provisional Company during World War II. Dano soon branched out to the New York stage and made his Broadway debut with a small role in the hit musical \"Finian's Rainbow.\" He was nominated by the New York Critic's Circle as one of the Promising Actors of 1949. Tall and lean, with a gaunt face, dark hair, a rangy build, and a very distinctive deep croaky voice, Dano was usually cast in both movies and TV shows as gloomy and/or sinister characters. He appeared most often in westerns and worked several times with James Stewart and director Anthony Mann. He made his film debut in \"Undercover Girl.\" Dano's more memorable roles include the Tattered Soldier in \"The Red Badge of Courage,\" a sickly bookworm bad guy in \"Johnny Guitar,\" Elijah in \"Moby Dick,\" Peter in \"King of Kings,\" a cattle rustler in \"The Culpepper Cattle Company,\" a coroner in \"Electra Glide in Blue,\" a profanity-spewing preacher in \"Big Bad Mama,\" Ten Spot in \"The Outlaw Josey Wales,\" a weary factory line worker in \"Take This Job and Shove It,\" a lightening rod salesman in \"Something Wicked This Way Comes,\" a minister in \"The Right Stuff,\" a stuffy high school teacher in \"Teachers,\" rascally zombified old-timer Gramps in \"House II: The Second Story,\" a cantankerous farmer in \"Killer Klowns from Outer Space,\" and, in his last part, a cemetery caretaker in George Romero's \"The Dark Half.\" Among the numerous TV shows Dano did guest spots on are \"Twin Peaks,\" \"Amazing Stories,\" \"CHiPs,\" \"Quincy M.E.,\" \"Fantasy Island,\" \"Little House on the Prairie,\" \"Kung Fu,\" \"Ben Casey,\" \"Planet of the Apes,\" \"Cannon,\" \"Playhouse 90,\" \"Lost in Space,\" \"Gunsmoke,\" \"Bonanza,\" \"Wagon Train,\" \"The Virginian,\" \"Hawaii Five-O,\" \"Alfred Hitchcock Presents,\" \"Wanted; Dead or Alive,\" \"Night Gallery,\" \"Route 66,\" \"The Rifleman,\" and \"Rawhide.\" Moreover, Dano did the voice of the audioanimatronic Abraham Lincoln for Walt Disney's Hall of Presidents for both Disneyland and Disney World. Dano also portrayed Lincoln on the \"Omnibus\" television series. He's the father of actor Richard Dano. Royal Dano died at age 71 of a heart attack on May 15th, 1994.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MDI5OTQzNF5BMl5BanBnXkFtZTcwMjg4MzI4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0200455","name":"Royal Dano","idIMDB":"nm0200455"},"actorId":"nm0200455","character":"Anton J. Cermak","urlCharacter":"http://www.imdb.com/character/ch0069170","main":true},{"actorName":"Joe De Nicola","urlProfile":"http://www.imdb.com/name/nm0210568","urlPhoto":"","biography":{"bio":"Joe De Nicola is an actor and executive, known for The Godfather: Part II (1974), Dead in Love (2009) and Capone (1975).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0210568","name":"Joe De Nicola","idIMDB":"nm0210568"},"actorId":"nm0210568","character":"Charles Fischetti","urlCharacter":"http://www.imdb.com/character/ch0069171","main":true},{"actorName":"Angelo Grisanti","urlProfile":"http://www.imdb.com/name/nm0342540","urlPhoto":"","biography":{"dateOfBirth":"16 May 1930","placeOfBirth":" Forestville, New York, USA","bio":"Angelo Grisanti was born on May 16, 1930 in Forestville, New York, USA. He is an actor, known for A Woman Under the Influence (1974), Wizards (1977) and Opening Night (1977).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0342540","name":"Angelo Grisanti","idIMDB":"nm0342540"},"actorId":"nm0342540","character":"Angelo Genna","urlCharacter":"http://www.imdb.com/character/ch0069172","main":true},{"actorName":"Peter Maloney","urlProfile":"http://www.imdb.com/name/nm0540595","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NDg1MTI1NV5BMl5BanBnXkFtZTcwMDQ1ODQzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 November 1944","placeOfBirth":" Chicago, Illinois, USA","bio":"Peter Maloney was born on November 23, 1944 in Chicago, Illinois, USA. He is an actor, known for Requiem for a Dream (2000), The Thing (1982) and K-PAX (2001). He has been married to Kristin Griffith since 1981. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NDg1MTI1NV5BMl5BanBnXkFtZTcwMDQ1ODQzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0540595","name":"Peter Maloney","idIMDB":"nm0540595"},"actorId":"nm0540595","character":"Jake Guzik","urlCharacter":"http://www.imdb.com/character/ch0069173","main":true},{"actorName":"Dick Miller","urlProfile":"http://www.imdb.com/name/nm0588241","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNDM1OTY4NV5BMl5BanBnXkFtZTcwMDQ3NDcyNA@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1928","placeOfBirth":" The Bronx, New York, USA","birthName":"Richard Miller","height":"5' 5\" (1.65 m)","bio":"A native of the Bronx, New York, Richard \"Dick\" Miller served in the U.S. Navy for a few years and earned a prize title as a middleweight boxer. He settled in Los Angeles in the mid-1950s, where he was noticed by producer/director Roger Corman, who cast him in most of his low-budget films, usually playing unlikeable sorts, such as a vacuum-cleaner salesman in Not of This Earth (1957). His most memorable role would have to be that of the mentally unstable, busboy/beatnik artist Walter Paisley, whose clay sculptures are suspiciously lifelike in A Bucket of Blood (1959) (a rare starring role for him), and he is also fondly remembered for his supporting role as the flower-eating Vurson Fouch in Corman's legendary The Little Shop of Horrors (1960). Miller spent the next 20 years working in Corman productions, and starting in the late 1970s was often cast in films by director Joe Dante, appearing in credited and uncredited walk-on bits as quirky chatterboxes, and stole every scene he appeared in. He has played many variations on his famous Walter Paisley role, such as a diner owner (Twilight Zone: The Movie (1983)) or a janitor (Chopping Mall (1986)). One of his best bits is the funny occult-bookshop owner in The Howling (1981). Being short (so he never played a romantic lead or a threatening villain) with wavy hair, long sideburns, a pointed nose and a face as trustworthy as a used-car dealer's, he was, and is to this day, an immediately recognizable character actor whose one-scene appearances in countless movies and TV shows guarantee audience applause.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNDM1OTY4NV5BMl5BanBnXkFtZTcwMDQ3NDcyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0588241","name":"Dick Miller","idIMDB":"nm0588241"},"actorId":"nm0588241","character":"Joe Pryor","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0072761","urlIMDB":"http://www.imdb.com/title/tt0072761","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"Copyright © MCMLXXV by Twentieth Century-Fox Film Corporation. All Rights Reserved."},"technical":{"runtime":["1 hr 41 min (101 min) (USA)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arriflex 35 BL"],"laboratory":["DeLuxe, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.7","filmingLocations":[{"location":"Universal Studios - 100 Universal City Plaza, Universal City, California, USA"}],"rated":"R","awards":[],"votes":"2,074","type":"Movie","companyCreditsSimple":[{"idCompany":"co0400130","name":"Santa Fe Productions (I)"}],"keywords":{"keywords":["rise and fall","prohibition","gangster","true crime","street shootout","kissing while having sex","bare breasts","love interest","boyfriend girlfriend relationship","kiss","mistress","sex in bed","sex","blood spatter","blood","gore","gang brawl","blonde","gang war","mobster","gunfight","shootout","1930s","drive by shooting","fistfight","scarface","brawl","machine gun","st. valentine's day massacre","shoulder holster","pistol","car chase","chase","violence","brutality","mob violence","gang violence","trial","arrest","jail","hitman","ambush","cigarette smoking","cigar smoking","tough guy","villain played by lead actor","vagina","erotic 70s","female nudity","female frontal nudity","mafia","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:27:45"}}