{"data":{"movies":[{"title":"This Property Is Condemned","originalTitle":"","year":"1966","releaseDate":"19661007","directors":[{"name":"Sydney Pollack","id":"nm0001628"}],"writers":[{"name":"Tennessee Williams","id":"nm0931783"},{"name":"Francis Ford Coppola","id":"nm0000338"}],"runtime":"110 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWUzMWZjMGMtNjE4ZC00M2NlLWIzOTctMzc5ZTUxMjJkYjUwXkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Romance"],"plot":"A railroad official, Owen Legate comes to Dodson, Mississippi to shut down much of the town's railway (town's main income). Owen unexpectedly finds love with Dodson's flirt and main attraction, Alva Starr. Alva and Owen then try to escape Alva's mother's (Hazel) clutches and the town's revenge.","simplePlot":"A railroad official, Owen Legate comes to Dodson, Mississippi to shut down much of the town's railway (town's main income). Owen unexpectedly finds love with Dodson's flirt and main ... ","actors":[{"actorName":"Natalie Wood","urlProfile":"http://www.imdb.com/name/nm0000081","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NjM5OTgxNF5BMl5BanBnXkFtZTYwOTg4NTM2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 July 1938","placeOfBirth":" San Francisco, California, USA","birthName":"Natalia Nikolaevna Zakharenko","height":"5' (1.52 m)","bio":"Natalie Wood was born on July 20, 1938, in San Francisco, California, as Natalia Nikolaevna Zakharenko. Her parents, Maria Stepanovna (Zudilova) and Nikolai Stepanovich Zakharenko, were Russian-born émigrés, of Ukrainian and Russian descent, who spoke barely comprehensible English; they changed the family name to Gurdin after becoming US citizens. When she was just four years old, Natalie appeared in her first film, Happy Land (1943). A production company had come to Santa Rosa, California, where the Gurdins were living and Natalie won a bit part of a crying little girl who had just dropped her ice cream cone. With stars in her eyes for her daughter, Mrs. Gurdin packed the family and moved south to Los Angeles in the hopes that more films would come her daughter's way. Unfortunately they did not, at least not at first, and the family continued to scrape by much as they had done in Santa Rosa. In 1946 Natalie tested for a role in Tomorrow Is Forever (1946). She was only seven at the time, and flunked the screen test. Natalie's mother convinced the studio heads to give her another test, and this time she was convincing enough that they gave Natalie the role. In 1947's Miracle on 34th Street (1947), she won the hearts of movie patrons around the country as Susan Walker in a film that is considered a Christmas classic to this day. Natalie stayed very busy as a child actress, appearing in no less than 18 films in the late 1940s and early 1950s. When she was 16 Natalie appeared in Rebel Without a Cause (1955) with James Dean, Sal Mineo and Dennis Hopper. She played Judy, a rebellious high school student who was more concerned with hanging out with the wrong crowd than being a sweet teenager like her contemporaries. The result was her first Academy Award nomination and a defining moment in her development as an adult actress. She appeared in Splendor in the Grass (1961), West Side Story (1961), Gypsy (1962), and Love with the Proper Stranger (1963). While Natalie was reported to be unhappy making \"West Side Story\", the film did win Oscars for Best Picture, Best Direction, Best Supporting Actor, and Best Supporting Actress. In short, it was a smash hit. Although she wasn't nominated for an Academy Award in that one, she did receive nominations for her roles in \"Splendor in the Grass\" and \"Love with the Proper Stranger\". After This Property Is Condemned (1966) in 1966, Natalie stayed away from Hollywood for three years to have time for herself and to consider where she was going. When she did return her star quality had not diminished a bit, as evidenced by her playing Carol Sanders in the hit Bob & Carol & Ted & Alice (1969). From that point on Natalie didn't work as much. She made a few television appearances, but nothing of substance with the exception of the TV mini-series From Here to Eternity (1979). After making The Last Married Couple in America (1980), Natalie began work on Brainstorm (1983) in the fall of 1981 with Christopher Walken. She did not live to see it released. On November 29, 1981, she was sailing on the yacht she shared with her husband, Robert Wagner, and their friend Walken, when Natalie fell in the ocean while trying to board the dinghy tied up alongside the yacht and drowned. She was 43 years old. Natalie had made 56 films for TV and the silver screen and it's hard to say what she could have done while making her comeback. \"Brainstorm\" was finally released in 1983.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NjM5OTgxNF5BMl5BanBnXkFtZTYwOTg4NTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000081","name":"Natalie Wood","nicknames":["Natalia","Natasha"],"idIMDB":"nm0000081"},"actorId":"nm0000081","character":"Alva Starr","urlCharacter":"http://www.imdb.com/character/ch0038963","main":true},{"actorName":"Robert Redford","urlProfile":"http://www.imdb.com/name/nm0000602","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1Nzc5MzQyMV5BMl5BanBnXkFtZTcwNjQ5OTA0Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1936","placeOfBirth":" Santa Monica, California, USA","birthName":"Charles Robert Redford Jr.","height":"5' 10½\" (1.79 m)","bio":"Charles Robert Redford, Jr. was born on August 18, 1936, in Santa Monica, California, to Martha (Hart), from Texas, and Charles Robert Redford, an accountant for Standard Oil, who was originally from Connecticut. He is of English, Scottish, Cornish, and Irish ancestry. Robert's mother died in 1955, the year after he graduated from high school. Robert was a scrappy kid who stole hubcaps in school and lost his college baseball scholarship at the University of Colorado because of drunkenness. After leaving UoC, he spent some time drifting across America, spending a time working in the California oil fields. Having saved enough he moved to Europe studying art in Paris and Florence.Back in the States he decided on a career as a theatrical designer in New York. Enrolling at the American Academy of Dramatic Art he turned to acting making his stage debut in 'Tall Story'. In 1962 he was signed for the stage production of 'Barefoot in the Park' which was a smash hit but it wasn't until 5 years later when it was filmed that he became an important star. Television and stage experience coupled with all-American good looks led to movies and television roles. His breakthrough role was \"The Sundance Kid\" in Butch Cassidy and the Sundance Kid (1969), when the actor was 32. The Way We Were (1973) and The Sting (1973), both in 1973, made Redford the number one box office star for the next three years. Redford used his clout to advance environmental causes and his riches to acquire Utah property, which he transformed into a ranch and the Sundance ski resort. In 1980, he established the Sundance Institute for aspiring filmmakers. Its annual film festival has become one of the world's most influential. Redford's directorial debut, Ordinary People (1980), won him the Academy Award as Best Director in 1981. He waited eight years before getting behind the camera again, this time for the screen version of John Nichols' acclaimed novel of the Southwest, The Milagro Beanfield War (1988). He scored with critics and fans in 1992 with the Brad Pitt film A River Runs Through It (1992), and again, in 1994, with Quiz Show (1994), which earned him yet another Best Director nomination. Lola Van Wagenen (consumer activist), born in 1940, dropped out of college to marry Redford on September 12, 1958. They divorced in 1985 after having four children, one of whom died of sudden infant death syndrome (SIDS). Daughter Shauna Redford, born November 15, 1960, is a painter who married Eric Schlosser on October 5, 1985, in Provo, UT. Her first child, born in January 1991, made Redford a grandfather. Son James Redford (aka Jamie Redford), a screenwriter, was born May 5, 1962. Daughter Amy Redford, an actress; was born October 22, 1970. Redford also has a brother named William.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1Nzc5MzQyMV5BMl5BanBnXkFtZTcwNjQ5OTA0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000602","name":"Robert Redford","nicknames":["Bob"],"idIMDB":"nm0000602"},"actorId":"nm0000602","character":"Owen Legate","urlCharacter":"http://www.imdb.com/character/ch0038964","main":true},{"actorName":"Charles Bronson","urlProfile":"http://www.imdb.com/name/nm0000314","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMzY5OTQwNV5BMl5BanBnXkFtZTYwMTcyOTE2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1921","placeOfBirth":" Ehrenfeld, Pennsylvania, USA","birthName":"Charles Dennis Buchinsky","height":"5' 8½\" (1.74 m)","bio":"The archetypal screen tough guy with weatherbeaten features--one film critic described his rugged looks as \"a Clark Gable who had been left out in the sun too long\"--Charles Bronson was born Charles Buchinsky, one of 15 children of struggling parents in Pennsylvania. His mother, Mary (Valinsky), was born in Pennsylvania, to Lithuanian parents, and his father, Walter Buchinsky, was a Lithuanian immigrant coal miner. He completed high school and joined his father in the mines (an experience that resulted in a lifetime fear of being in enclosed spaces) and then served in WW II. After his return from the war, Bronson used the GI Bill to study art (a passion he had for the rest of his life), then enrolled at the Pasadena Playhouse in California. One of his teachers was impressed with the young man and recommended him to director Henry Hathaway, resulting in Bronson making his film debut in You're in the Navy Now (1951). He appeared on screen often early in his career, though usually uncredited. However, he made an impact on audiences as the evil assistant to Vincent Price in the 3-D thriller House of Wax (1953). His sinewy yet muscular physique got him cast in action-type roles, often without a shirt to highlight his manly frame. He received positive notices from critics for his performances in Vera Cruz (1954), Target Zero (1955) and Run of the Arrow (1957). Indie director Roger Corman cast him as the lead in his well-received low-budget gangster flick Machine-Gun Kelly (1958), then Bronson scored the lead in his own TV series, Man with a Camera (1958). The 1960s proved to be the era in which Bronson made his reputation as a man of few words but much action. Director John Sturges cast him as half Irish/half Mexican gunslinger Bernardo O'Reilly in the smash hit western The Magnificent Seven (1960), and hired him again as tunnel rat Danny Velinski for the WWII POW big-budget epic The Great Escape (1963). Several more strong roles followed, then once again he was back in military uniform, alongside Lee Marvin and Ernest Borgnine in the testosterone-filled The Dirty Dozen (1967). European audiences had taken a shine to his minimalist acting style, and he headed to the Continent to star in several action-oriented films, including Guns for San Sebastian (1968) (aka \"Guns for San Sebastian\"), the cult western Once Upon a Time in the West (1968) (aka \"Once Upon a Time in The West\"), Rider on the Rain (1970) (aka \"Rider On The Rain\") and, in one of the quirkier examples of international casting, alongside Japansese screen legend Toshirô Mifune in the western Red Sun (1971) (aka \"Red Sun\"). American audiences were by now keen to see Bronson back on US soil, and he returned triumphantly in the early 1970s to take the lead in more hard-edged crime and western dramas, including Cosa Nostra (1972) and the revenge western Chato's Land (1972). After nearly 25 years as a working actor, he became an 'overnight\" sensation. Bronson then hooked up with British director Michael Winner to star in several highly successful urban crime thrillers, including The Mechanic (1972) and Le cercle noir (1973). He then scored a solid hit as a Colorado melon farmer-done-wrong in Richard Fleischer's Mr. Majestyk (1974). However, the film that proved to be a breakthrough for both Bronson and Winner came in 1974 with the release of the controversial Death Wish (1974) (written with Henry Fonda in mind, who turned it down because he was disgusted by the script). The US was at the time in the midst of rising street crime, and audiences flocked to see a story about a mild-mannered architect who seeks revenge for the murder of his wife and rape of his daughter by gunning down hoods, rapists and killers on the streets of New York City. So popular was the film that it spawned four sequels over the next 20 years. Action fans could not get enough of tough guy Bronson, and he appeared in what many fans--and critics--consider his best role: Depression-era street fighter Chaney alongside James Coburn in Hard Times (1975). That was followed by the somewhat slow-paced western Breakheart Pass (1975) (with wife Jill Ireland), the light-hearted romp (a flop) From Noon Till Three (1976) and as Soviet agent Grigori Borsov in director Don Siegel's Cold War thriller Telefon (1977). Bronson remained busy throughout the 1980s, with most of his films taking a more violent tone, and he was pitched as an avenging angel eradicating evildoers in films like the 10 to Midnight (1983), L'enfer de la violence (1984), Assassination (1987) and Kinjite: Forbidden Subjects (1989). Bronson jolted many critics with his forceful work as murdered United Mine Workers leader Jock Yablonski in the TV movie Act of Vengeance (1986), gave a very interesting performance in the Sean Penn-directed The Indian Runner (1991) and surprised everyone with his appearance as compassionate newspaper editor Francis Church in the family film Yes Virginia, There Is a Santa Claus (1991). Bronson's final film roles were as police commissioner Paul Fein in a well-received trio of crime/drama TV movies Tel père... tel flic! (1995), Le justicier braque la mafia (1997) and Le justicier reprend les armes (1999). Unfortunately, ill health began to take its toll; he suffered from Alzheimers disease for the last few years of his life, and finally passed away from pneumonia at Los Angeles' Cedars-Sinai Medical Center in August 2003. Bronson was a true icon of international cinema; critics had few good things to say about his films, but he remained a fan favorite in both the US and abroad for 50 years, a claim few other film legends can make.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMzY5OTQwNV5BMl5BanBnXkFtZTYwMTcyOTE2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000314","name":"Charles Bronson","nicknames":["Il Brutto","Le Sacre Monstre"],"idIMDB":"nm0000314"},"actorId":"nm0000314","character":"J.J. Nichols","urlCharacter":"http://www.imdb.com/character/ch0222682","main":true},{"actorName":"Kate Reid","urlProfile":"http://www.imdb.com/name/nm0003679","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM5NTE0OTIwN15BMl5BanBnXkFtZTcwMzk4OTgwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 November 1930","placeOfBirth":" London, England, UK","birthName":"Daphne Katherine Reid","height":"5' 6\" (1.68 m)","bio":"Esteemed London-born stage, radio and TV actress Kate Reid was actually born Daphne Katherine Reid in 1930 of Canadian parents. The family moved back to Ontario before she was a year old. An introverted child of delicate health, Kate sought refuge in books and role-playing and began studying drama in her mid-teens. She apprenticed in summer stock and trained with Uta Hagen and Herbert Berghof at the HB Studio in New York. Earning critical acclaim for her Lizzie in \"The Rainmaker\" and Masha in \"The Three Sisters,\" her ten years with the Stratford Festival in Canada would establish her as one of Canada's most accomplished actresses. On the Shakespearean stage she would play everything from Lady Macbeth to the shrewish Katherine. A bulky, highly insecure woman, Kate tended to look and play older than she was, battling alcohol and weight problems throughout much of her life. She was to have taken \"The Rainmaker\" to England's West End at one point but severe anxiety attacks kept her from doing so. She made her Broadway debut playing the matinée Martha in Edward Albee's \"Who's Afraid of Virginia Woolf?\" in 1962 in which her legendary mentor Uta Hagen starred. Filming for Kate would be very erratic during the course of her career. She played Natalie Wood's mother in This Property Is Condemned (1966) and is probably best remembered as a scientist in the thriller The Andromeda Strain (1971). She earned two Tony nominations in the 60s for her participation in the plays \"Dylan\" and \"Slapstick Tragedy.\" Further respect came in the package of Arthur Miller's \"The Price\" and John Guare's \"Bosoms and Neglect.\" Plagued by ill health in later years Kate nevertheless offered a couple of outstanding contributions. She was the invalid mistress in the film Atlantic City (1980) opposite Burt Lancaster, and portrayed the devoted, long-suffering wife Linda Loman alongside Dustin Hoffman in the critically-acclaimed 1984 remake of \"Death of a Salesman\" on Broadway. She and Hoffman subsequently preserved their roles with a TV adaptation the following year. Kate also managed a recurring part on Dallas (1978) as well as regular roles on the short-lived Gavilan (1982) and Morningstar/Eveningstar (1986) TV series. She succumbed to brain cancer at age 62 in Ontario, Canada.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM5NTE0OTIwN15BMl5BanBnXkFtZTcwMzk4OTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003679","name":"Kate Reid","idIMDB":"nm0003679"},"actorId":"nm0003679","character":"Hazel Starr","urlCharacter":"http://www.imdb.com/character/ch0224917","main":true},{"actorName":"Mary Badham","urlProfile":"http://www.imdb.com/name/nm0000825","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MzM3MTYwOV5BMl5BanBnXkFtZTcwMTk3OTExNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 October 1952","placeOfBirth":" Birmingham, Alabama, USA","bio":"Mary Badham was born on October 7, 1952 in Birmingham, Alabama, USA. She is an actress, known for To Kill a Mockingbird (1962), This Property Is Condemned (1966) and Our Very Own (2005). She has been married to Richard Wilt since 1975. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MzM3MTYwOV5BMl5BanBnXkFtZTcwMTk3OTExNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000825","name":"Mary Badham","idIMDB":"nm0000825"},"actorId":"nm0000825","character":"Willie Starr","urlCharacter":"http://www.imdb.com/character/ch0456192","main":true},{"actorName":"Alan Baxter","urlProfile":"http://www.imdb.com/name/nm0062667","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjVjZTk0MzItNmJhMy00ZmYwLWJiYWMtMTg3NmZiNzIyM2UwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1908","placeOfBirth":" East Cleveland, Ohio, USA","birthName":"Alan Edwin Baxter","bio":"Before there was an Alan Ladd, there was another furtive-eyed, baby-faced, cigarette-dangling villain named Alan, impacting the movie scene with his various colorless and cold-hearted thugs, mobsters and killers. Dark-haired, bullet-headed actor Alan Baxter earned a noticeable degree of popularity back in the late 30s and 40s with his various despicables, before his film career lost steam and he sought more and more TV and stage work. The son of a Cleveland Trust Company vice president, the Ohio native was born on November 19, 1908, in East Cleveland. Following high school, he studied drama at Williams College in Williamstown, Massachusetts, where he forged a strong friendship with fellow collegiate and future directing icon, Elia Kazan. Once they graduated in 1930, the pair went on to attend the Yale School of Drama. Alan hooked up with the then-fledgling Group Theatre in the early 1930s and appeared in such stage productions as \"Lone Valley\", \"The Pure in Heart\" and \"Waiting for Lefty\". His performance in \"Black Pit\" in 1935, however, was witnessed by a Hollywood talent scout and it was enough to change the course of his career. Immediately heading west to Hollywood, Alan made an auspicious debut with his strong performance as \"Babe Wilson\", the heartless killer loved by Sylvia Sidney's character in Mary Burns, Fugitive (1935). Three years later, Alan went on to recreate the role on radio. With his foot strongly in the Paramount door, he continued playing dangerous, unsavory types in 13 Hours by Air (1936), Big Brown Eyes (1936) and The Case Against Mrs. Ames (1936), until his contract ran out. Continuing to freelance throughout the remainder of the 1930s, he remained on the wrong side of the law in Parole! (1936), Breezing Home (1937), Night Key (1937), Wide Open Faces (1938), Off the Record (1939), My Son Is a Criminal (1939), and Each Dawn I Die (1939). A solid \"B\" lead player who appeared in support when it came to \"A\" pictures, Baxter occasionally broke out of the \"bad guy\" mold -- but not often. By this time, Alan Ladd was starting to cut in on Alan B.'s action with his moody and sexy versions of trench-coat-trendy villains. Baxter, nevertheless, continued to roll on, playing outlaw \"Jesse James\" in Bad Men of Missouri (1941) opposite Dennis Morgan, Wayne Morris and Arthur Kennedy as the Younger brothers, while adding slick malevolence to such films as Escape to Glory (1940) with Constance Bennett, Under Age (1941) with Nan Grey and Mary Anderson, The Pittsburgh Kid (1941) with Jean Parker and Rags to Riches (1941) with Mary Carlisle. This period of filming was topped by an excellent support role in the classic Alfred Hitchcock thriller, Saboteur (1942), in which he, as the meek-voiced, mustachioed, bespectacled, peroxide blond Nazi spy \"Freeman\", shares a memorable scene with lead Robert Cummings. Following standard work in China Girl (1942) and Behind Prison Walls (1943), Alan, at age 35, signed up for the Army Air Force in 1943, and made an appearance in the Broadway production of Moss Hart's \"Winged Victory\", which later was turned into the 1944 movie version of the same name, Winged Victory (1944) (also featuring Alan). Post-war filming grew more dismal with a high majority of \"Poverty Row\" pictures coming his way. His last appearance in a strong film was the Robert Ryan boxing pic, The Set-Up (1949), as a mobster involved in fixing matches. Alan decided to return to the challenge of the stage, appearing in such plays as \"Home of the Brave\" (1945), \"The Voice of the Turtle\" (1947), \"The Hallams\" (1948), \"Jenny Kissed Me\" (1948), \"Tea and Sympathy\" (1955) and \"South Pacific\" (1957) (in a non-singing role). TV also became a positive medium, with adventure guest roles on The Rifleman (1958), Wagon Train (1957), Colt .45 (1957) and Alfred Hitchcock Presents (1955), among the offerings. By the 1960s, he was seen primarily in incidental film roles, his last being the cult rodent thriller, Willard (1971). Diagnosed with cancer, the twice-married actor died a few years later at the Motion Picture Country Home on May 8, 1976.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjVjZTk0MzItNmJhMy00ZmYwLWJiYWMtMTg3NmZiNzIyM2UwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0062667","name":"Alan Baxter","idIMDB":"nm0062667"},"actorId":"nm0062667","character":"Knopke","urlCharacter":"http://www.imdb.com/character/ch0456191","main":true},{"actorName":"Robert Blake","urlProfile":"http://www.imdb.com/name/nm0086706","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MDI0OTc0NF5BMl5BanBnXkFtZTYwNjk3ODU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1933","placeOfBirth":" Nutley, New Jersey, USA","birthName":"Michael James Gubitosi","height":"5' 4\" (1.63 m)","bio":"American actor who began as a child in Our Gang comedies and reappeared as a powerful adult performer of leading and character roles. Born in New Jersey, the young Mickey Gubitosi won a role in MGM's Our Gang series at the age of 5. As one of the more prominent children in the Gang, he gained attention for his cute good looks and his lovable, if somewhat melancholy, personality. In 1940 he took on the stage name Bobby Blake (though he continued to use the name Mickey Gubitosi in the Our Gang series for another three years) and began playing child roles in a wide range of films. He gained a good deal of fame as the Indian sidekick Little Beaver in the Red Ryder series of Westerns. Though roles were sporadic as he grew to manhood, he was never long off the screen (except for a period of military service, 1954-56). But despite some fine work in films like Pork Chop Hill (1959) and Town Without Pity (1961), his career did not take off until his stunning portrayal of killer Perry Smith in In Cold Blood (1967). A number of telling performances in films of the next decade, stardom in a popular television series (Baretta (1975), and several ruefully comic appearances as a guest on The Tonight Show Starring Johnny Carson (1962) made him a popular figure even as his personal difficulties increased. Consumed with anger over his treatment by his family and the studio as a child, he denigrated his early work, suffered bouts of difficulty with drugs, and became known as a difficult, perfectionist person to work with. He quit his successful TV series Hell Town (1985) when his personal demons became overwhelming. After a self-imposed exile of nearly eight years, during which he struggled to right his life, he successfully returned to films and television work, appearing renewed and more confident in himself and his work. In 2001, though, the murder of his wife, Bonnie Bakley, thrust Blake into the limelight in a different way. Admittedly having married Bakley through the coercion of her pregnancy, a routine Bakley had apparently tried with various other celebrities, Blake made no denial of his distaste for the woman, but was by all accounts thrilled with the daughter born to them. Blake was arrested for his wife's murder, but the presumption of innocence trumped what jurors believed to be flimsy evidence, and Blake was acquitted in a trial that made worldwide headlines. Reportedly broke from legal costs, Blake indicated hopefulness that he might be allowed to return to acting work.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MDI0OTc0NF5BMl5BanBnXkFtZTYwNjk3ODU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0086706","name":"Robert Blake","nicknames":["Mickey","Bobby"],"idIMDB":"nm0086706"},"actorId":"nm0086706","character":"Sidney","urlCharacter":"http://www.imdb.com/character/ch0456190","main":true},{"actorName":"Dabney Coleman","urlProfile":"http://www.imdb.com/name/nm0001056","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MjMxOTQyNV5BMl5BanBnXkFtZTYwNDQ3Mjg1._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 January 1932","placeOfBirth":" Austin, Texas, USA","birthName":"Dabney Wharton Coleman","height":"6' 1\" (1.85 m)","bio":"For decades, Dabney Coleman has often appeared as a smarmy, selfish, nervous person, often with money, who is mostly out for himself. He did such a good job in this type of part that he's made a career of it in film. Dabney Wharton Coleman was born in Austin, Texas, to Mary Wharton (Johns) and Melvin Randolph Coleman. He attended the Virginia Military Institute, and studied law in Texas. Coleman has a well deserved reputation as a fine character actor, and a reliable presence for almost any role in TV and movies. Dabney Coleman's early appearances in the cinema were in The Slender Thread (1965) and Downhill Racer (1969). On TV he starred in That Girl (1966). As the 1970s approached he became a well-known character actor in television and movies, appearing in The Towering Inferno (1974), Midway (1976), and Cinderella Liberty (1973). Television seemed Dabney Coleman's forum in the 1970s as Coleman played the role of Merle Jeeter in Mary Hartman, Mary Hartman (1976) and Fernwood Tonight (1977). Coleman made appearances in the popular North Dallas Forty (1979) and the Oscar-winning Melvin and Howard (1980). Dabney Coleman also became known for some satirical movies, starring in the comedy How to Beat the High Co$t of Living (1980) and snatched a lead role for the TV movie Pray TV (1980). Coleman's reputation for playing world-class jerks became cemented in 1980 as the boss to Dolly Parton , Jane Fonda and Lily Tomlin in 9 to 5 (1980). The next year, Coleman was in very good company working with legends Henry Fonda and Katharine Hepburn in On Golden Pond (1981). Coleman's hit streak would not end there. In 1982 Coleman landed a key role in the classic Tootsie (1982), further cementing his role as an unlikable wealthy boss in some capacity. In 1983 Coleman starred in the Cold War classic WarGames (1983). During this period he also found many parts in lesser known movies like Young Doctors in Love (1982) and Callie & Son (1981). In 1984 he starred in The Muppets Take Manhattan (1984) and in 1985 he starred with Tom Hanks in The Man with One Red Shoe (1985). In 1987 the actor won an Emmy for Sworn to Silence (1987). In 1990 Coleman took two lead roles, one in the disastrous Where the Heart Is (1990), and the other in the quirky comedy Short Time (1990). In 1993 Coleman starred in the slapstick comedy Amos & Andrew (1993) (a very funny part) and in a remake of the TV show The Beverly Hillbillies (1993) as Milburn Drysdale. Coleman took an extensive line of TV movies, such films as Texan, In the Line of Duty, among others. Coleman took an unusual part in the ABC cartoon, Recess (1997), and then starred in a couple of big money grossers, the Tom Hanks comedy, You've Got Mail (1998), as Chief Quimby in Inspector Gadget (1999), and in Stuart Little (1999), both 1999. Coleman is still very active.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MjMxOTQyNV5BMl5BanBnXkFtZTYwNDQ3Mjg1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001056","name":"Dabney Coleman","idIMDB":"nm0001056"},"actorId":"nm0001056","character":"Salesman","urlCharacter":"http://www.imdb.com/character/ch0456189","main":true},{"actorName":"John Harding","urlProfile":"http://www.imdb.com/name/nm0362331","urlPhoto":"","biography":{"bio":"John Harding is an actor, known for Please Don't Eat the Daisies (1960), Love Me or Leave Me (1955) and This Property Is Condemned (1966).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0362331","name":"John Harding","idIMDB":"nm0362331"},"actorId":"nm0362331","character":"Gerard Johnson","urlCharacter":"http://www.imdb.com/character/ch0456188","main":true},{"actorName":"Ray Hemphill","urlProfile":"http://www.imdb.com/name/nm0376165","urlPhoto":"","biography":{"dateOfBirth":"28 October 1932","placeOfBirth":" West Carroll, Louisiana, USA","birthName":"Elvin Ray Hemphill","bio":"Ray Hemphill was born on October 28, 1932 in West Carroll, Louisiana, USA as Elvin Ray Hemphill. He was an actor, known for This Property Is Condemned (1966), The Baby Maker (1970) and September 30, 1955 (1977). He died on March 6, 2009 in Burbank, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0376165","name":"Ray Hemphill","idIMDB":"nm0376165"},"actorId":"nm0376165","character":"Jim","urlCharacter":"http://www.imdb.com/character/ch0456187","main":true},{"actorName":"Brett Pearson","urlProfile":"http://www.imdb.com/name/nm0669205","urlPhoto":"","biography":{"dateOfBirth":"11 April 1931","placeOfBirth":" Missouri, USA","bio":"Brett Pearson was born on April 11, 1931 in Missouri, USA. He is known for his work on This Property Is Condemned (1966), Body Fever (1969) and Stagecoach (1966). He died on May 10, 1996 in the USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0669205","name":"Brett Pearson","idIMDB":"nm0669205"},"actorId":"nm0669205","character":"Charlie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jon Provost","urlProfile":"http://www.imdb.com/name/nm0699092","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NzI0MTA0OF5BMl5BanBnXkFtZTYwOTUzOTU2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 March 1950","placeOfBirth":" Los Angeles, California, USA","height":"5' 4\" (1.63 m)","bio":"Forever associated with a heroic TV collie whom he frequently had his arms lovingly wrapped around, blond tyke Jon Provost actually was a veteran performer by the time he won the role of \"Timmy Martin\" at age seven in the series Lassie (1954). L.A. born and bred, Jon was just three years old when he was cast as Jane Wyman and Sterling Hayden's son in the film So Big (1953). He proceeded with The Country Girl (1954) as Bing Crosby and Grace Kelly's son, Back from Eternity (1956) starring Anita Ekberg, and co-starred in Escapade in Japan (1957), which featured an unknown (and unbilled) Clint Eastwood. And then came Lassie (1954)... Actor Tommy Rettig, as Lassie's original young master \"Jeff Miller\", had become too old to be romping around with his dog, so in 1957, he moved away to college and his entire family sold the farm to a brand new clan -- The Martins. Jon's parents were played by rangy Hugh Reilly and the ever-wholesome June Lockhart. For seven seasons, audiences grew to love Timmy and his perilous adventures with the invincible canine. By 1964, however, the Martin family decided to move to Australia and Jon's reign was over as a child star. By the time Jon turned 19, he'd worked in film and television for 16 years. The darker side of the 60s was beginning to take over; so, amid plentiful high-profile job offers, he escaped from the only life he'd known - showbiz. Jon headed for college in Northern California's wine country, studying psychology and eventually settling to raise a family in Sonoma County. In 1990, Jon made a decision to return to television. He performed in The New Lassie (1989) with Dee Wallace. In one nostalgic episode, he appeared together with Lassie's original master, Tommy Rettig, who was making a guest appearance. He also received a Genesis Award for Outstanding Television in a Family Series for a New Lassie story he wrote focusing on the inhumane treatment of research animals. Since his early acting days - gracing screens from not-quite-three - Jon has seen it all: the trials of child celebrity; the social strain; the sex, drugs and rock 'n' roll of the '60s on the Sunset Strip; and battles with near-crippling depression and dyslexia. For a while there, Timmy really was stuck down a well. But he got out - and these days Jon has a different story to tell. He began directing and hosting on-line videos about dogs and cats for a Purina website. Jon's career began afresh and has been burgeoning in a variety of surprising directions since. 2008 marks Jon's 50th anniversary in the role of Timmy. He is celebrating with the release of his autobiography, Timmy's in the Well and a multi-city tour.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NzI0MTA0OF5BMl5BanBnXkFtZTYwOTUzOTU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0699092","name":"Jon Provost","idIMDB":"nm0699092"},"actorId":"nm0699092","character":"Tom","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Random","urlProfile":"http://www.imdb.com/name/nm0709947","urlPhoto":"","biography":{"dateOfBirth":"29 January 1943","placeOfBirth":" Chilliwack, British Columbia, Canada","bio":"Robert Random was born on January 29, 1943 in Chilliwack, British Columbia, Canada. He is an actor, known for Iron Horse (1966), This Property Is Condemned (1966) and Village of the Giants (1965).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0709947","name":"Robert Random","idIMDB":"nm0709947"},"actorId":"nm0709947","character":"Tiny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Quintin Sondergaard","urlProfile":"http://www.imdb.com/name/nm0814218","urlPhoto":"","biography":{"dateOfBirth":"11 January 1925","placeOfBirth":" Seattle, Washington, USA","birthName":"Quentin Charles Sondergaard","bio":"Quintin Sondergaard was born on January 11, 1925 in Seattle, Washington, USA as Quentin Charles Sondergaard. He was an actor, known for Tombstone Territory (1957), This Property Is Condemned (1966) and Five Guns to Tombstone (1960). He died on February 15, 1984 in Riverside County, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0814218","name":"Quintin Sondergaard","idIMDB":"nm0814218"},"actorId":"nm0814218","character":"Hank","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike Steen","urlProfile":"http://www.imdb.com/name/nm0824778","urlPhoto":"","biography":{"dateOfBirth":"16 February 1928","placeOfBirth":" Monroe, Louisiana, USA","birthName":"Malcolm H. Steen","bio":"Mike Steen was born on February 16, 1928 in Monroe, Louisiana, USA as Malcolm H. Steen. He was an actor, known for Sweet Bird of Youth (1962), This Property Is Condemned (1966) and Crack in the World (1965). He died on May 8, 1983 in New York City, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0824778","name":"Mike Steen","idIMDB":"nm0824778"},"actorId":"nm0824778","character":"Max","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0061089","urlIMDB":"http://www.imdb.com/title/tt0061089","business":{"budget":{"money":"$4,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 50 min (110 min)"],"soundMix":["Mono"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Mitchell BNC","Mitchell NC"],"laboratory":["Technicolor, USA"],"filmLength":["3,025 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.1","filmingLocations":[{"location":"Bay St. Louis, Mississippi, USA"}],"rated":"UNRATED","awards":[{"award":"Golden Globes, USA 1967","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Actress - Drama","names":[{"name":"Natalie Wood","id":"nm0000081","role":null}]}]}]},{"award":"Laurel Awards 1967","titlesAwards":[{"titleAwardOutcome":"3rd place Golden Laurel","categories":[{"category":"Female Dramatic Performance","names":[{"name":"Natalie Wood","id":"nm0000081","role":null}]}]}]}],"votes":"4,003","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"},{"idCompany":"co0635919","name":"Seven Arts Productions"}],"keywords":{"keywords":["railroad","mother daughter relationship","family relationships","dysfunctional family","boardinghouse","adolescence","small town","revenge","mississippi","title appears in writing","rain","glass ball","face slap","flashback","tuberculosis","railroad worker","poverty","new orleans louisiana","marriage","great depression","drunkenness","betrayal","1920s","southern gothic","sexuality","railroad track","reputation","melodrama","labor","family disapproval","deception","boarding house","sister sister relationship","train","happy birthday to you","based on play","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:20:54"}}