{"data":{"movies":[{"title":"Detectives","originalTitle":"","year":"1928","releaseDate":"19280609","directors":[{"name":"Chester M. Franklin","id":"nm0291387"}],"writers":[{"name":"Chester M. Franklin","id":"nm0291387"},{"name":"Chester M. Franklin","id":"nm0291387"}],"runtime":"70 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWFjZjJiMmItODljMS00OGUzLWFlNGUtZGFjZDI4ZmZkMWQ3XkEyXkFqcGdeQXVyMjU4NzU2OTA@._V1.jpg","countries":["USA"],"languages":[],"genres":["Comedy","Mystery"],"plot":"Lois, a stenographer at a luxury hotel, is being pursued by the hotel's house detective and a bellhop. When some valuable jewels are stolen, the bellhop--who has always dreamed of being a detective--sees his chance to both solve the jewel robbery and impress the woman he loves. The house detective, however, has other ideas.","simplePlot":"Lois, a stenographer at a luxury hotel, is being pursued by the hotel's house detective and a bellhop. When some valuable jewels are stolen, the bellhop--who has always dreamed of being a ... ","actors":[{"actorName":"Karl Dane","urlProfile":"http://www.imdb.com/name/nm0199322","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzEyMjY4OV5BMl5BanBnXkFtZTgwODMyMjkxNDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 October 1886","placeOfBirth":" Copenhagen, Denmark","birthName":"Rasmus Carl Therkelsen Gottlieb","height":"6' 3½\" (1.92 m)","bio":"Born Rasmus Karl Therkelsen Gottlieb in Copenhagen, Denmark, on October 12, 1886 the future Karl Dane had a rough childhood. His father was an alcoholic and spendthrift. At a young age his parents divorced. To escape his unhappy home he took a great interest in the arts, particularly puppeteering (something popular in Denmark at the time). Dane apprenticed as a machinist during his teenage years. In 1910 he met and fell in love with Carla Dagmar Hagen. They had two children together: Ejlert Carl and Ingeborg Helene. Dane was restless all his life. War broke out, and Denmark was hit with major unemployment. Hoping to support his family (and find new adventures) Dane immigrated to America in 1916 with the intent to send for his family once he could afford to. Dane was miserable and lonely, compounded by the fact his wife soon asked for a divorce. He worked various odd jobs (mostly as a mechanic and carpenter) and lived in various states. Hearing of the good money in flickers Dane tried his luck. By 1917 he was given a small extra role at Vitagraph. Though his scene ended up on the cutting room floor Dane continued to seek a film career. With the outbreak of War in the US Dane found luck, being cast as the evil Hun in many Anti Kaiser films including \"To Hell with the Kaiser!\", \"The Wolves of Kultur\", and \"My Four Year in Germany\". Dane was very successful in such roles. Possibly to avoid anti German sentiment it was at this time he changed his name to the less provocative sounding 'Dane' (after well...being a Dane). By 1918 Dane had grown disillusioned with Hollywood and had fallen in love with a Swedish woman named Helen Benson. Benson strongly disapproved of his acting so Dane quit and took up chicken farming. The pair married and Benson became pregnant in 1923. However she died in childbirth as did the child, a baby girl. Dane was devastated. Terribly lonely Dane quickly married telephone operator Emma Sawyer. The marriage only lasted 6 months. During this unfortunate time Dane ran into old friend Charles Hutchison who convinced him to try acting again. This proved very lucky as Dane was chosen by King Vidor for the role of Slim in \"The Big Parade\". The film would be a major success and go on to be one of the best selling silents of all time (ironic considering Dane's previous Hun roles, it was an anti war film). Dane was signed by MGM for a salary of $150 per week, which would eventually rise to $1,500 weekly. His family back in Denmark spotted him and they reconnected, though Dane would never see his children again. Dane so had many key roles in major movies including many Lillian Gish and John Gilbert films (such as La Boheme and The Scarlet Letter). Dane's career continued to rise with a role as Ramadan in 1926's \"Son of the Sheik\" with Rudolph Valentino and \"Bardelys the Magnificent\" with John Gilbert. In 1927 Dane paired with British actor George K. Arthur to form the comedic duo Dane & Arthur. The pair were quite successful with Dane usually playing the slow witted Scandinavian. Contrary to popular and hugely inaccurate Hollywood Babylon lore Dane did decently in talkies. His English was a bit shaky but his accent was understandable and suited his type and look perfectly. He would go on to have roles in many films between 1928 and 1930. By 1928 Dane began to burn too brightly. He worked too hard and became ill and severely fatigued (almost dying of pneumonia at one point). He began a relationship with crazed Russian Thais Valdemar (contrary to what she claimed they never married). In 1930 Dane's roles had grown smaller and he soon lost his contract. Dane suffered a nervous break down the same year. After recovering in 1931 Dane and Arthur reunited for an 8 month vaudeville tour which did very well and led to another film contract. However by 1932 this too had ended as writers couldn't think up enough clever scenarios for Dane. He made one final film, the 3 hour serial \"The Whispering Shadow\" which starred a new actor named Bela Lugosi (incredibly it took only 12 days to shoot). Dane had a small yet key role in the serial, ending his film career with a wonderful yet underrated performance. Dane made major investments in mining in 1931 and 1933. However his business partner was crooked and Dane soon lost all the money he had made in films. Now impoverished Dane went from one menial job to another, always losing them in some cruel and unfair way. One such job was as a waiter at a café. The owner fired Dane soon after when he discovered a former movie star turned waiter did not draw in customers. MGM also refused to rehire Dane as even a carpenter or an extra despite his skills. Yes he did own a hot dog stand, no he didn't operate it in front of the MGM gates. That was a Kenneth Anger invention. Days before his death Dane was returning to his apartment when he was pick-pocketed of all the money he had in the world: $18. On the eve of April 14th, 1934 Dane's friend (and possible girlfriend though the evidence is sketchy) Frances Leake arrived at his apartment to take him to a movie, hoping to lift his spirits. Unable to enter she had the landlady open the door. The duo discovered Dane slumped in his chair, a revolver at his side. He had left a note by a scrapbook of his publicity clippings, \"To Frances and all my friends---Goodbye.\" He was 47. Dane's body was held hoping his relatives could be found in Denmark. The Danish community of Hollywood was livid and insisted he be given a proper and dignified burial. At their urging MGM paid for a funeral. Dane was buried at Hollywood Forever Cemetery.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzEyMjY4OV5BMl5BanBnXkFtZTgwODMyMjkxNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0199322","name":"Karl Dane","nicknames":["The Great Dane"],"idIMDB":"nm0199322"},"actorId":"nm0199322","character":"House Detective","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George K. Arthur","urlProfile":"http://www.imdb.com/name/nm0037761","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc3MTYwMTQtNjgzZS00OTYyLTk3NTMtMTYzNjVmMTZlNGZlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1899","placeOfBirth":" Littlehampton, Sussex, England, UK","birthName":"Arthur George Brest","height":"5' 6\" (1.68 m)","bio":"The son of a travelling salesman and a department store merchandise demonstrator, Arthur was obliged to fend for himself from an early age, selling newspapers and working at starvation wages for a condiment manufacturer. Although underage, he escaped from this life by joining the Bugle Corps at the outset of World War One. His experience in army shows as a comedian and singer encouraged him to try for an acting career. Again a civilian, Arthur took advantage of a government program to enroll at a dramatic school run by the wife of prominent Shakespearian actor/producer Sir Frank Benson. Deciding to adopt a stage name, he simply reversed his first and middle names, adding a meaningless initial 'K' in order to distinguish himself from another George Arthur. He made his professional debut as a spear-carrier in a production at the Memorial Theatre at Stratford-on-Avon, and soon was playing minor parts in Benson's West End Shakespearian productions. Learning that American film director Harold M. Shaw was in London planning a cinematic adaptation of the novel \"Kipps\" by H.G. Wells, Arthur, with characteristic brashness and skillful self-promotion, managed to persuade Shaw that he was perfect for the title role - as indeed he was. Even before its release it was apparent to all that the film would be a hit, and Arthur found himself in demand as a film actor, and in a position to hobnob with visiting celebrities like Charles Chaplin, Mary Pickford and Douglas Fairbanks. The success of Kipps (1921) led to two films with visiting American star Mae Marsh and dreams of Hollywood. Leaving behind a newly-acquired wife (Milba Lloyd, later employed by Cecil B. DeMille in his art department), Arthur sailed to America and was received with profound indifference by American film makers. Arthur turned to Chaplin for help, and the latter found him a role in a John Gilbert film at Fox. Arthur was then able to persuade director James Cruze to give him a prominent part in his all-star production of Hollywood (1923), today one of the most eagerly sought-after 'lost' films of the silent era. A five-year contract with producer Pat Powers in his pocket, Arthur was convinced that he was firmly established in Hollywood as a light comedian / juvenile, and brought the rest of his family over from England. Within a few months Powers's venture collapsed, and Arthur was reduced to operating a grocery store and remodelling houses to eke out a living. Having long nurtured plans of producing a film of his own, he managed to bluff his way into obtaining sufficient money to finance an ultra-low budget production. He turned to would-be director Josef von Sternberg to helm the film, and with a script by the latter and a largely non-professional cast, The Salvation Hunters (1925) was made. Arthur screened the film for Chaplin, who showed it to Pickford and Fairbanks, and it was decided that United Artists would distribute it. A critical success, Sternberg's career was launched, and Arthur obtained a contract with MGM. Arthur now enjoyed his best days as a film actor. Separated from his first wife, he romanced Renée Adorée and Jean Arthur, and was a frequent visitor to San Simeon. MGM paired Arthur with Karl Dane in a very successful series of light comedies, which ended when the advent of sound revealed Dane's thick accent. The team was able to keep going for a while in vaudeville and short films for RKO and Paramount, and Arthur tried his hand as a singer / composer and novelist, but by 1933 he was pretty much desperate for work. He was able to obtain bit parts at MGM, but focussed his attention on a new career as theatrical producer. He opened a short-lived Grand Guignol theatre in Hollywood, followed by a much more ambitious venture in partnership with E.E. Clive, but after a final film appearance in Vanessa: Her Love Story (1935), he wound up working as a film salesman in Michigan, and then as a theatrical reviewer on Station WQXR. He also published a not-very-successful magazine guide to New York theatre and night life. Following Pearl Harbor, Arthur, now a US citizen, joined the Air Force as a private. Shortly before being shipped overseas, he married again. He spent the war years organising shows for the troops. On his return Arthur tried to revive his magazine, with little success. Once again he reinvented himself, this time as a producer and distributor of short films for television. This provided him with a comfortable living into the 1960s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc3MTYwMTQtNjgzZS00OTYyLTk3NTMtMTYzNjVmMTZlNGZlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0037761","name":"George K. Arthur","idIMDB":"nm0037761"},"actorId":"nm0037761","character":"Bellhop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marceline Day","urlProfile":"http://www.imdb.com/name/nm0206496","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NzI2MjYzNF5BMl5BanBnXkFtZTcwNjM0NTUyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 April 1908","placeOfBirth":" Colorado Springs, Colorado, USA","birthName":"Marceline Newlin","height":"5' 3\" (1.6 m)","bio":"The younger sister of actress Alice Day, Marceline Day achieved stardom in the mid-'20s, appearing opposite such stars as John Barrymore and Lon Chaney. Adept at comedy, she also starred with such top comics as Buster Keaton and Harry Langdon. Her career faltered in the early '30s, however, and she was soon reduced to appearing in low-budget thrillers and action pictures. She retired in the mid-'30s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NzI2MjYzNF5BMl5BanBnXkFtZTcwNjM0NTUyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0206496","name":"Marceline Day","idIMDB":"nm0206496"},"actorId":"nm0206496","character":"Lois","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tenen Holtz","urlProfile":"http://www.imdb.com/name/nm0392669","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4OTE4MjQyNV5BMl5BanBnXkFtZTcwMTc1NzcyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1887","placeOfBirth":" Volin, Russia","birthName":"Alexander Elihu Tenenholtz","bio":"Elihu \"Elye\" Tenenholtz was born in the Russian hamlet of Azran, near the city of Rovne, in 1887 and came to the US at the age of ten. His first appearance in amateur Yiddish theatricals occurred in 1903, in staged readings of the works of Yiddish author Sholom Aleichem, the first person to do that. He augmented his theater appearances by writing for and editing a Yiddish satirical magazine under the pen-name \"Moishe McCarthy\". In 1916 he made the leap to the professional Yiddish stage and, befriended by the great doyenne Bessie Thomashevsky, helped her pen her memoirs, the first publication documenting a Yiddish actor's life. By 1920 he was appearing on both the Yiddish art stage with Maurice Schwartz and on Broadway, quickly rising to the top leadership of the Hebrew Actors' Union, the first arts union in America. In 1925 he co-founded a theater company with Celia Adler, half-sister of Luther Adler and \"Method\" teacher Stella Adler. In 1926 he was summoned to Hollywood and given a five-year contract at MGM. Like most Jewish actors, when he arrived in Hollywood he changed his name (choosing to bifurcate it into \"Tenen Holtz\"). During that time he regularly appeared in films alongside such stars as Greta Garbo, Norma Shearer, Joan Crawford, Jean Harlow and Marion Davies and under directors like King Vidor and Victor Fleming. This period would prove to be Tenenholtz's most prolific and would account for the majority of the 50+ films in which he would appear. While in Hollywood he helped jump start its fledgling Yiddish theater, founding a popular Yiddish theater company that included other transplanted Yiddish actors including Muni Weisenfreund (aka Paul Muni, father and son Rudolph Schildkraut and Joseph Schildkraut. When his contract at MGM ended, he moved over to Warner Brothers where he made films with Leslie Howard under the direction of Michael Curtiz. By the late 1930s the only calls he got were from Poverty Row studios, so Tenenholtz moved to nearby Monrovia and opened a chicken ranch. Though he would occasionally go back in front of the camera, he retired from film. By the time TV emerged, he landed a few roles on shows such as Perry Mason (1957) and Alfred Hitchcock Presents (1955). He died in 1971.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4OTE4MjQyNV5BMl5BanBnXkFtZTcwMTc1NzcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0392669","name":"Tenen Holtz","idIMDB":"nm0392669"},"actorId":"nm0392669","character":"Orloff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Felicia Drenova","urlProfile":"http://www.imdb.com/name/nm0237481","urlPhoto":"","biography":{"dateOfBirth":"1897","placeOfBirth":" Poland","bio":"Felicia Drenova was born in 1897 in Poland. She is an actress, known for Detectives (1928).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0237481","name":"Felicia Drenova","idIMDB":"nm0237481"},"actorId":"nm0237481","character":"Mrs. Winters","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tetsu Komai","urlProfile":"http://www.imdb.com/name/nm0464514","urlPhoto":"","biography":{"dateOfBirth":"23 April 1894","placeOfBirth":" Kumamoto, Japan","height":"5' 11\" (1.8 m)","bio":"Tetsu Komai was born on April 23, 1894 in Kumamoto, Japan. He was an actor, known for The Letter (1940), Island of Lost Souls (1932) and Bulldog Drummond (1929). He died on August 10, 1970 in Gardena, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0464514","name":"Tetsu Komai","idIMDB":"nm0464514"},"actorId":"nm0464514","character":"Chin Lee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clinton Lyle","urlProfile":"http://www.imdb.com/name/nm0528091","urlPhoto":"","biography":{"dateOfBirth":"27 August 1883","placeOfBirth":" San Jose, California, USA","birthName":"Clarence Lyle","bio":"Clinton Lyle was born on August 27, 1883 in San Jose, California, USA as Clarence Lyle. He was an actor, known for Detectives (1928), H.M. Pulham, Esq. (1941) and Slightly Dangerous (1943). He died on June 26, 1950 in Los Angeles County, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0528091","name":"Clinton Lyle","idIMDB":"nm0528091"},"actorId":"nm0528091","character":"Roberts","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0018825","urlIMDB":"http://www.imdb.com/title/tt0018825","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 10 min (70 min)"],"soundMix":["Silent"],"color":["Black and White"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":["1,690 m (7 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"8.1","filmingLocations":[{"location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA"}],"awards":[],"votes":"20","type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"}],"keywords":{"keywords":["jewels","house detective","hotel","stenographer","jewel robbery","jewel thief","bellboy"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 05:48:50"}}