{"data":{"movies":[{"title":"Red Beard","originalTitle":"Akahige","year":"1965","releaseDate":"19681219","directors":[{"name":"Akira Kurosawa","id":"nm0000041"}],"writers":[{"name":"Masato Ide","id":"nm0406836"},{"name":"Hideo Oguni","id":"nm0644823"}],"runtime":"185 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU5ZjE1OWUtZjcxNS00NjAzLThhZTQtOWY0MDc3NDQ1YTE2XkEyXkFqcGdeQXVyMTIyNzY1NzM@._V1.jpg","countries":["Japan"],"languages":["Japanese"],"genres":["Drama"],"plot":"In a charity hospital, a hard-bitten but honorable older doctor, Dr. Niide, takes a young intern under his guidance through the course of a number of difficult cases.","simplePlot":"In 19th century Japan, a rough tempered yet charitable town doctor trains a young intern.","actors":[{"actorName":"Toshirô Mifune","urlProfile":"http://www.imdb.com/name/nm0001536","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NzE2MzEyNF5BMl5BanBnXkFtZTcwNzA5MTU4Mw@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 April 1920","placeOfBirth":" Tsingtao, China [now Qingdao, Shandong, China]","birthName":"Sanchuan Minlang","height":"5' 8½\" (1.74 m)","bio":"Toshiro Mifune achieved more worldwide fame than any other Japanese actor of his century. He was born in Tsingtao, China, to Japanese parents and grew up in Dalian. He did not set foot in Japan until he was 21. His father was an importer and a commercial photographer, and young Toshiro worked in his father's studio for a time after graduating from Dalian Middle School. He was automatically drafted into the Japanese army when he turned 20, and enlisted in the Air Force where he was attached to the Aerial Photography Unit for the duration of the World War II. In 1947 he took a test for Kajirô Yamamoto, who recommended him to director Senkichi Taniguchi, thus leading to Mifune's first film role in These Foolish Times II (1947). Mifune then met and bonded with director Akira Kurosawa, and the two joined to become the most prominent actor-director pairing in all Japanese cinema. Beginning with Drunken Angel (1948), Mifune appeared in 16 of Kurosawa's films, most of which have become world-renowned classics. In Kurosawa's pictures, especially Rashomon (1950), Mifune would become the most famous Japanese actor in the world. A dynamic and ferocious actor, he excelled in action roles, but also had the depth to plumb intricate and subtle dramatic parts. A personal rift during the filming of Red Beard (1965) ended the Mifune-Kurosawa collaboration, but Mifune continued to perform leading roles in major films both in Japan and in foreign countries. He was twice named Best Actor at the Venice Film Festival (for Yojimbo (1961) and Red Beard (1965)). In 1963 he formed his own production company, directing one film and producing several others. In his later years he gained new fame in the title role of the American TV miniseries Shogun (1980), and appeared infrequently in cameo roles after that. His last years were plagued with Alzheimer's Syndrome and he died of organ failure in 1997, a few months before the death of the director with whose name he will forever be linked, Akira Kurosawa.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NzE2MzEyNF5BMl5BanBnXkFtZTcwNzA5MTU4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001536","name":"Toshirô Mifune","nicknames":["The Wolf","The Shogun"],"idIMDB":"nm0001536"},"actorId":"nm0001536","character":"Dr. Kyojô Niide","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yûzô Kayama","urlProfile":"http://www.imdb.com/name/nm0443232","urlPhoto":"","biography":{"dateOfBirth":"11 April 1937","placeOfBirth":" Kanagawa, Japan","bio":"The son of one of one of Japan's biggest male stars of the 1930s, 'Ken Uehara', the handsome and likable Yuzo Kayama became one of Japan's biggest male stars of the 1960s. And just as Uehara embodied the idea of a modern Japanese wartime hero, Kayama became symbolic of postwar Japanese affluence and confidence, most famously in his title role in the 17 original \"Young Guy\" (Wakadaishô) movies for his father's home studio, Toho. A popular singer as well as an actor, Kayama specialized in romantic comedies that encouraged him to break spontaneously into song, as showcased even in movies where he wasn't playing the Young Guy, such as Oyome ni oide (1966). Though like his father he also starred in some of Toho's war films, and crime and action thrillers such as his debut Man Against Man (1960), he largely bypassed serious dramas until Akira Kurosawa tapped him for the lead alongside 'Toshiro Mifune' in Red Beard (1965), the two-year shoot of which Kayama found the most difficult experience of his life, but which also yielded the work of which he is proudest. Other than a single return to the Young Guy character, Kaettekita wakadaishô (1981), ten years after leaving the series, Kayama, also like his father, in later years moved towards playing a series of kindly authority figures, while still maintaining his romantic appeal to nostalgic audiences with musical appearances on the stage and on television.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0443232","name":"Yûzô Kayama","idIMDB":"nm0443232"},"actorId":"nm0443232","character":"Dr. Noboru Yasumoto","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tsutomu Yamazaki","urlProfile":"http://www.imdb.com/name/nm0945734","urlPhoto":"","biography":{"dateOfBirth":"2 December 1936","placeOfBirth":" Chiba, Japan","height":"5' 8½\" (1.74 m)","bio":"Tsutomu Yamazaki was born on December 2, 1936 in Chiba, Japan. He is an actor, known for Departures (2008), Kagemusha, l'ombre du guerrier (1980) and Tampopo (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0945734","name":"Tsutomu Yamazaki","idIMDB":"nm0945734"},"actorId":"nm0945734","character":"Sahachi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Reiko Dan","urlProfile":"http://www.imdb.com/name/nm0199029","urlPhoto":"","biography":{"dateOfBirth":"26 March 1935","placeOfBirth":" Kyoto City, Japan","bio":"Reiko Dan was born on March 26, 1935 in Kyoto City, Japan. She was an actress, known for Sanjuro (1962), Red Beard (1965) and Quand une femme monte l'escalier (1960). She died on November 24, 2003 in Tokyo, Japan.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0199029","name":"Reiko Dan","idIMDB":"nm0199029"},"actorId":"nm0199029","character":"Osugi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Miyuki Kuwano","urlProfile":"http://www.imdb.com/name/nm0476675","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWYxZjUwNzEtNGE2Yy00ZDAwLWFlMjktMmJkYTg5MzE1NWYwXkEyXkFqcGdeQXVyMTI3MDk3MzQ@._V1_UY44_CR36,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 July 1942","placeOfBirth":" Yokohama, Japan","bio":"Miyuki Kuwano was born on July 17, 1942 in Yokohama, Japan. She is an actress, known for Red Beard (1965), Naked Youth (1960) and Fin d'automne (1960).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWYxZjUwNzEtNGE2Yy00ZDAwLWFlMjktMmJkYTg5MzE1NWYwXkEyXkFqcGdeQXVyMTI3MDk3MzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0476675","name":"Miyuki Kuwano","idIMDB":"nm0476675"},"actorId":"nm0476675","character":"Onaka","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kyôko Kagawa","urlProfile":"http://www.imdb.com/name/nm0434593","urlPhoto":"","biography":{"dateOfBirth":"5 December 1931","placeOfBirth":" Ibaraki, Japan","birthName":"Kyoko Ikebe","height":"5' 3¾\" (1.62 m)","bio":"Kyôko Kagawa was born on December 5, 1931 in Ibaraki, Japan as Kyoko Ikebe. She is an actress, known for High and Low (1963), Tokyo Story (1953) and Sansho the Bailiff (1954).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0434593","name":"Kyôko Kagawa","idIMDB":"nm0434593"},"actorId":"nm0434593","character":"Madwoman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tatsuyoshi Ehara","urlProfile":"http://www.imdb.com/name/nm0251177","urlPhoto":"","biography":{"dateOfBirth":"26 March 1937","placeOfBirth":" Tokyo, Japan","bio":"Tatsuyoshi Ehara was born on March 26, 1937 in Tokyo, Japan. He is an actor, known for Samurai Rebellion (1967), Red Beard (1965) and Sanjuro (1962).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0251177","name":"Tatsuyoshi Ehara","idIMDB":"nm0251177"},"actorId":"nm0251177","character":"Genzô Tsugawa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Terumi Niki","urlProfile":"http://www.imdb.com/name/nm0631659","urlPhoto":"","biography":{"dateOfBirth":"11 May 1949","placeOfBirth":"","birthName":"Terumi Iwasaki","bio":"Terumi Niki was born on May 11, 1949 as Terumi Iwasaki. She is an actress, known for Red Beard (1965), Karafuto 1945 Summer Hyosetsu no mon (1974) and Evil Dead Trap (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0631659","name":"Terumi Niki","idIMDB":"nm0631659"},"actorId":"nm0631659","character":"Otoyo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Akemi Negishi","urlProfile":"http://www.imdb.com/name/nm0624372","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzliZDFmZWMtNzU0My00OWE1LWE2MzctM2Q1Y2E3ODgzMjJjXkEyXkFqcGdeQXVyMTI3MDk3MzQ@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1934","placeOfBirth":" Tokyo, Japan","bio":"Akemi Negishi might never have become an actress but for Josef von Sternberg. The legendary director was in Japan looking for a woman to play the seductress who leads a bunch of soldiers astray in his upcoming (and as it turned out, last) movie _Anatahan (1954)_. But Sternberg spotted Negishi one night, dancing on the cabaret stage, and chose her at once. This was the first in a long string of exotic roles, most unusual for the average Japanese actress, but which became her trademark, in films as various as _Kingukongu tai Gojira (1962)_ and Dodes'ka-den (1970). She was a favorite actress of both Akira Kurosawa and Ishirô Honda, both directors seeing beyond the kind of role in which she was usually typecast, and thereby encouraging her to some of the best work any Japanese actress did in the 1950s and 1960s. Her most memorable roles are probably for Kurosawa, in The Lower Depths (1957) and Dodes'ka-den (1970); but she is probably best known outside Japan for playing the woman who leads the dance of tribute to Kong in _Kingukongu tai Gojira (1962)_. Negishi was an unusual presence in Japanese film at that time, since her presence was so aggressively, obviously sensual. This militated against her becoming a major star in the conservative Japanese atmosphere of the time, but she was fortunate to be able to do excellent character work throughout the 1950s and 1960s. Following her arresting cameo as the beautiful lone housewife in Dodes'ka-den (1970), it appears that Negishi retired.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzliZDFmZWMtNzU0My00OWE1LWE2MzctM2Q1Y2E3ODgzMjJjXkEyXkFqcGdeQXVyMTI3MDk3MzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0624372","name":"Akemi Negishi","idIMDB":"nm0624372"},"actorId":"nm0624372","character":"Okuni, the mistress","urlCharacter":"http://www.imdb.com/character/ch0427778","main":true},{"actorName":"Yoshitaka Zushi","urlProfile":"http://www.imdb.com/name/nm0958831","urlPhoto":"","biography":{"dateOfBirth":"19 March 1955","placeOfBirth":" Osaka, Japan","bio":"Born in Yosaka in 1955, Yoshitaka Zushi was discovered when he was eight years old by one of Akira Kurosawa's partners and debuted in the role of young Toshio in Kaneto Shindô's \"Haha\" (Mother, 1963). Since then he has appeared first and foremost in Kurosawa's pictures, beginning with \"Akahige\" (Red Beard, 1965). His most outstanding role is undeniably that of Rokkuchan, the insane young man who drives a trolley through the slums, in the wonderful \"Dodesukaden\" (1970).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0958831","name":"Yoshitaka Zushi","idIMDB":"nm0958831"},"actorId":"nm0958831","character":"Chôji","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yoshio Tsuchiya","urlProfile":"http://www.imdb.com/name/nm0875237","urlPhoto":"","biography":{"dateOfBirth":"18 May 1927","placeOfBirth":" Yamanashi, Japan","height":"5' 8\" (1.73 m)","bio":"Yoshio Tsuchiya grew up in his ancestral home in the countryside of Japan--the very grounds where Akira Kurosawa would later film KAGEMUSHA (1980). Tsuchiya's father was a professor of literature at the prestigious Waseda University in Tokyo, and Tsuchiya grew up hearing as bedtime stories the works of William Shakespeare, of which Tsuchiya's father was the Japanese translator. Such a theatrical childhood no doubt stayed with Tsuchiya, who studied to be a doctor, and did indeed complete medical school. But he still felt drawn to acting, and so joined the highly regarded Hayuza theater group. He intended to do stage work entirely at first, until Akira Kurosawa persuaded him to audition for SHICHININ NO SAMURAI in 1952. Though reluctant at first, Tsuchiya acted his audition with such vigor that Kurosawa was bowled over. So was the public at large when Tsuchiya's fiery Rikichi, the most passionate of all the farmers in SEVEN SAMURAI, made his mark upon the film's release in 1954. Toho began to groom Tsuchiya as a star in the making, but he was less interested in fame than in the quality of roles he played. Kurosawa, too, was intensely protective of his discovery, counseling the young actor to work only with directors of quality. Early in 1957, Kurosawa introduced Tsuchiya to one such director, his close friend Ishiro Honda, whose classic GOJIRA had made its mark in the same year as SEVEN SAMURAI. Tsuchiya and Honda took to each other immediately--in later years he would call Kurosawa and Honda \"my other two fathers\"--and the actor, an avid UFO buff, impressed the director by insisting on the role of the Mysterian commander in their first science fiction collaboration, EARTH DEFENSE FORCE (1957). Since the Commander's face was never to be seen, Honda had had no illusions of getting a first-rate actor to play the part, and actually tried to talk Tsuchiya out of it. Toho, too, wanted him to play a role with a face the audience would get to see. But the iconoclastic Tsuchiya prevailed, and Honda was very touched by his persistence. He acted in numerous pictures for Honda through 1970, when he largely retired from movies in favor of the stage. After appearing in nearly every Kurosawa film after 1954, their collaboration came to an end with RED BEARD in 1965. (The two-year shoot had cost Tsuchiya a role in Honda's popular monster picture EARTH'S GREATEST BATTLE, 1964.) Kurosawa attempted to cast Tsuchiya in both KAGEMUSHA and RAN, but Tsuchiya's stage schedules would not permit. He did, however, narrate as well as appear in a 1991 TV documentary on the making of SEVEN SAMURAI. That same year, he made his first appearance in a monster film in over 20 years, playing the self-important magnate Shindo in GOJIRA VS. KING GHIDORA, which became one of his very favorite acting jobs. Tsuchiya's fierce but controlled persona has not dulled with age, and he remains more in demand than his schedule can handle. He still prefers the stage to films or TV, and usually does at least one stage tour a year. He is also a noted essayist, on subjects ranging from his work with Kurosawa to his interest in UFOs; several books of his work have been published.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0875237","name":"Yoshio Tsuchiya","idIMDB":"nm0875237"},"actorId":"nm0875237","character":"Dr. Handayû Mori","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eijirô Tôno","urlProfile":"http://www.imdb.com/name/nm0867391","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTYxOWJhNjItYjA0ZS00MTdmLTk1ZWUtOWRiMDdlNzMyMmYzXkEyXkFqcGdeQXVyMTI3MDk3MzQ@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 September 1907","placeOfBirth":" Gunma, Japan","bio":"Eijirô Tôno was born on September 17, 1907 in Gunma, Japan. He was an actor, known for Seven Samurai (1954), Yojimbo (1961) and Tora! Tora! Tora! (1970). He died on September 8, 1994.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTYxOWJhNjItYjA0ZS00MTdmLTk1ZWUtOWRiMDdlNzMyMmYzXkEyXkFqcGdeQXVyMTI3MDk3MzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0867391","name":"Eijirô Tôno","idIMDB":"nm0867391"},"actorId":"nm0867391","character":"Goheiji","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Takashi Shimura","urlProfile":"http://www.imdb.com/name/nm0793766","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNjY0ODYyMV5BMl5BanBnXkFtZTcwMDg0MTc4Ng@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 March 1905","placeOfBirth":" Ikuno, Hyogo, Japan","birthName":"Shoji Shimazaki","height":"5' 7¾\" (1.72 m)","bio":"Japanese character actor Takashi Shimura was one of the finest film actors of the 20th century and a leading member of the \"stock company\" of master director Akira Kurosawa. A native of southern Japan, Shimura was a descendant of the samurai warrior class. Following university training, he founded a theatre company, Shichigatsu-za (\"July Theatre\"). In 1930 he joined a professional company, Kindai-za (\"Modern Theatre\"). Four years later he signed with the Kinema Shinko film studio. He found a niche playing samurai roles for various studios, then signed a long-term contract with Toho Studios in 1943. He appeared in an average of six films a year for Toho over the next four decades. His greatest critical acclaim came in more than 20 roles for Kurosawa, though he is almost as well recognized outside Japan for his kindly doctor role in the original \"Godzilla\" (Godzilla (1954)). Shimura's triumph was his unforgettable performance as a dying bureaucrat in Kurosawa's Ikiru (1952). He continued to act steadily, in good films and bad, almost until his death, culminating with Kurosawa's Kagemusha, l'ombre du guerrier (1980). He is often described as filling the spot for Kurosawa that Ward Bond filled for John Ford--an ever-present and reliable character player who consistently supplied a solidity and strength to whatever film he appeared in. Shimura was, to be sure, even a finer actor than Bond, and his range was enormous, from \"Ikiru\"'s diffident clerk to the leader of the Seven Samurai in Kurosawa's Seven Samurai (1954). He died in 1982, a reluctant icon of Japanese cinema.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNjY0ODYyMV5BMl5BanBnXkFtZTcwMDg0MTc4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0793766","name":"Takashi Shimura","idIMDB":"nm0793766"},"actorId":"nm0793766","character":"Tokubei Izumiya","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chishû Ryû","urlProfile":"http://www.imdb.com/name/nm0753479","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MjkzMzU4Nl5BMl5BanBnXkFtZTcwNDk5MDUwNw@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 May 1904","placeOfBirth":" Kumamoto, Japan","height":"5' 10\" (1.78 m)","bio":"What an amazing career! Few can boast a longer one (64 years of activity). Few have been able to have to relate to three generations. And it is pretty sure that no one can compare with him in terms of faithfulness to a director: Chishu Ryu indeed appeared in no fewer than fifty-two out of fifty-four of his master Yasujirô Ozu. He played in 187 films or TV films and could be a very versatile actor: for instance in 1936, when he was thirty, he embodied a student in one film and an old man in another. However he was perfect in Ozu's films, most often, as a simple, unobtrusive man whose humanity is revealed through the hardships of everyday life. How could Japanese cinema have done without Chishu Ryu?","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MjkzMzU4Nl5BMl5BanBnXkFtZTcwNDk5MDUwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0753479","name":"Chishû Ryû","idIMDB":"nm0753479"},"actorId":"nm0753479","character":"Mr. Yasumoto","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Haruko Sugimura","urlProfile":"http://www.imdb.com/name/nm0837503","urlPhoto":"","biography":{"dateOfBirth":"6 January 1909","placeOfBirth":" Hiroshima, Japan","bio":"Haruko Sugimura was born on January 6, 1909 in Hiroshima, Japan. She was an actress, known for Tokyo Story (1953), Late Spring (1949) and Le testament du soir (1995). She died on April 4, 1997 in Tokyo, Japan.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0837503","name":"Haruko Sugimura","idIMDB":"nm0837503"},"actorId":"nm0837503","character":"Kin, the madam","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0058888","urlIMDB":"http://www.imdb.com/title/tt0058888","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["3 hr 5 min (185 min)"],"soundMix":["4-Track Stereo"],"color":["Black and White"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["Toho Developing Co., Japan"],"filmLength":["5,055 m (Sweden)","5,069 m (14 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Tohoscope (anamorphic)"],"printedFilmFormat":["35 mm"]},"rating":"8.3","filmingLocations":[{"location":"Toho Studios, Tokyo, Japan"}],"rated":"NOT RATED","awards":[{"award":"Golden Globes, USA 1966","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Foreign-Language Foreign Film","names":[]}]}]},{"award":"Blue Ribbon Awards 1966","titlesAwards":[{"titleAwardOutcome":"Won Blue Ribbon Award","categories":[{"category":"Best Film","names":[{"name":"Akira Kurosawa","id":"nm0000041","role":null}]},{"category":"Best Actor","names":[{"name":"Toshirô Mifune","id":"nm0001536","role":null}]},{"category":"Best Supporting Actress","names":[{"name":"Terumi Niki","id":"nm0631659","role":null}]}]}]},{"award":"Fotogramas de Plata 1968","titlesAwards":[{"titleAwardOutcome":"Won Fotogramas de Plata","categories":[{"category":"Best Foreign Performer (Mejor intérprete de cine extranjero)","names":[{"name":"Toshirô Mifune","id":"nm0001536","role":null},{"name":"Tengoku to jigoku","id":"tt0057565","role":null}]}]}]},{"award":"Kinema Junpo Awards 1966","titlesAwards":[{"titleAwardOutcome":"Won Kinema Junpo Award","categories":[{"category":"Best Film","names":[{"name":"Akira Kurosawa","id":"nm0000041","role":null}]},{"category":"Best Director","names":[{"name":"Akira Kurosawa","id":"nm0000041","role":null}]}]}]},{"award":"Mainichi Film Concours 1966","titlesAwards":[{"titleAwardOutcome":"Won Mainichi Film Concours","categories":[{"category":"Best Film","names":[{"name":"Akira Kurosawa","id":"nm0000041","role":null}]}]}]},{"award":"Venice Film Festival 1965","titlesAwards":[{"titleAwardOutcome":"Won OCIC Award","categories":[{"category":"","names":[{"name":"Akira Kurosawa","id":"nm0000041","role":null}]}]},{"titleAwardOutcome":"Won San Giorgio Prize","categories":[{"category":"","names":[{"name":"Akira Kurosawa","id":"nm0000041","role":null}]}]},{"titleAwardOutcome":"Won Volpi Cup","categories":[{"category":"Best Actor","names":[{"name":"Toshirô Mifune","id":"nm0001536","role":null}]}]},{"titleAwardOutcome":"Nominated Golden Lion","categories":[{"category":"","names":[{"name":"Akira Kurosawa","id":"nm0000041","role":null}]}]}]}],"votes":"12,045","type":"Movie","companyCreditsSimple":[{"idCompany":"co0095216","name":"Kurosawa Production Co."},{"idCompany":"co0002219","name":"Toho Company"}],"keywords":{"keywords":["clinic","intern","doctor","japan","japanese","19th century","medical profession","one word title","wedding","suicide","landslide","insanity","deathbed","tokyo japan","metamorphosis","literature","thief","surgery","seduction","poor","poison","nudity","mass suicide","earthquake","bad smell","based on novel","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:17:15"}}