{"data":{"movies":[{"title":"Witchboard","originalTitle":"","year":"1986","releaseDate":"19870313","directors":[{"name":"Kevin Tenney","id":"nm0855107"}],"writers":[{"name":"Kevin Tenney","id":"nm0855107"}],"runtime":"98 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTEzYjE4ZWQtYjEzNC00NzU4LTg1YmMtNDk4MDExMzU2YjdjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["UK","USA"],"languages":["English"],"genres":["Horror","Mystery","Thriller"],"plot":"At a party, a guest brings out a Ouija board, and they attempt to contact a spirit he knows. The spirit does appear, but it becomes apparent to the one who brought the Ouija board that this is an evil spirit that is impersonating his spirit, and despite warnings not to use the board alone, a woman uses it alone, and becomes harassed by the evil spirit, his goal to possess her so he can walk the earth again.","simplePlot":"A woman (Kitaen) finds an interest in her friend Brandon's Ouija Board when he brings it by her party.","actors":[{"actorName":"Todd Allen","urlProfile":"http://www.imdb.com/name/nm0021112","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MTkyMDA2Ml5BMl5BanBnXkFtZTgwNTYxNTM3MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 December 1960","placeOfBirth":" San Diego, California, USA","bio":"Actor/writer/producer Todd Allen has appeared in close to 60 film and television productions in his career. Notably, he has costarred with Kevin Costner in three films and with Robert Duvall in The Apostle and again in Broken Trail, where Allen received excellent reviews as Territorial Marshal Bill Miller. Always unpredictable in his choices, Allen's recent appearances showcase chameleon-like abilities and vary between the role of a Catholic Priest in the inspirational sports drama, \"My All American\" to a vicious plantation overseer in the blockbuster hit \"Django Unchained\". With the pending launch of his independent media and production company, Virtuosity, Allen has plans to film a number of exciting film and television projects in the next five years. Under the Virtuosity umbrella, among many others, is the gritty, film-noir styled Western, \"The Deserters\", the romantic thrill ride, \"Suicide Grip\" and \"The Empty Quarter\", a timely and cautionary tale set on a drilling installation in Saudi Arabia's most barren desert. Virtuosity Television is developing several 1-hour drama series' as well as long-form mini-series projects and alternative programming. After time away from the screen while building and attending to the various aspects of funding Virtuosity, Allen is set to shoot three films in the coming months, plans to go back to work immediately and looks forward to resuming his acting career. First up, he is set to travel to Italy and Spain to shoot an Italian-produced and directed spaghetti western in the same locales where Sergio Leone once filmed his epic productions. Previously Allen completed a starring role in the independent feature, Frontera (2010), playing a tough, driven Texas Ranger who brings down a drug cartel. He also has an extensive list of films and television appearances on his resume with appearances, among others, in the NBC/Bruckheimer series Chase (2010) and a recurring role on Friday Night Lights (2006). Other career highlights include multiple films with writer/director Lawrence Kasdan, and an early career role of famed fighter ace 'Chuck Yeager'. Allen maintains residences in Los Angeles and his hometown of Austin, Texas. Flight crews on Southwest Airlines love him.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MTkyMDA2Ml5BMl5BanBnXkFtZTgwNTYxNTM3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0021112","name":"Todd Allen","idIMDB":"nm0021112"},"actorId":"nm0021112","character":"Jim Morar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tawny Kitaen","urlProfile":"http://www.imdb.com/name/nm0000478","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NzM3NDc5M15BMl5BanBnXkFtZTgwNjk2OTEzMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 August 1961","placeOfBirth":" San Diego, California, USA","birthName":"Julie Kitaen","height":"5' 7\" (1.7 m)","bio":"Tawny Kitaen was born on August 5, 1961 in San Diego, California, USA as Julie Kitaen. She is an actress, known for Bachelor Party (1984), Santa Barbara (1984) and The Perils of Gwendoline in the Land of the Yik Yak (1984). She was previously married to Chuck Finley and David Coverdale.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NzM3NDc5M15BMl5BanBnXkFtZTgwNjk2OTEzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000478","name":"Tawny Kitaen","idIMDB":"nm0000478"},"actorId":"nm0000478","character":"Linda Brewster","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Nichols","urlProfile":"http://www.imdb.com/name/nm0629731","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2MzgzMzMxMjJeQTJeQWpwZ15BbWU3MDE3MTM2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 February 1951","placeOfBirth":" Cincinnati, Ohio, USA","height":"5' 11\" (1.8 m)","bio":"After turning down an art scholarship to Ohio State University, Stephen Nichols traveled west, studied Yoga and lived as a monk while preparing vegetarian meals for the monks and nuns in a Hollywood ashram. After three years of celibacy, a steady diet of ice cream and the films of Truffaut and Bergman, he landed at the Theater Academy of Los Angeles City College where he studied for two years. Nichols also studied with Stella Adler, Jack Colvin and Harry Mastrorgeorge. Nichols began his acting career in Los Angeles theater during its renaissance in the early eighties. Throughout the course of the many productions he has appeared in, Nichols has been honored with three Drama-logue and two L.A. Weekly Awards for his performances in such notable productions as \"Pieces of Time,\" for his portrayal of real-life killer, Donald Bashor, for \"Delirious,\" directed by the late Ron Link, and as Jim Morrison in the last thirty-six hours of his life in \"The Lizard King.\" Nichols also appeared at LATC in Rick Clutchey's \"The Cage,\" in the award winning production of Michael Cristofer's \"The Shadow Box\" at Theater East and \"Love Letters,\" during its initial run at the Canon Theater. Most recently Nichols appeared in \"He Hunts\" at the Geffen Playhouse and was seen in the U.S. premiere of Joe Pintaro's electrifying \"The Dead Boy\" for which Nichols received a Maddy Award. Stephen Nichols, one of the most enduring stars of daytime television, was most recently seen as Stefan Cassadine on \"General Hospital.\" And he is best known for his portrayal of the infamous Steve \"Patch\" Johnson on \"Days of Our Lives,\" a role which earned him status as one of the most notable presences on television, second only to Bill Cosby in the TV-Q ratings, along with an Emmy nomination for Outstanding Actor in a Leading Role and five Soap Opera Digest Best Actor Awards. Other TV appearances include: \"Matlock,\" \"L.A. Law,\" \"Diagnosis Murder,\" \"The Nanny,\" \"Second Chances,\" \"Sisters,\" a recurring role on \"Empty Nest\" and as Jesse James opposite Pierce Brosnan in the NBC mini-series \"Around the World in 80 Days,\" to name a few. Nichols has appeared in several feature films including, \"Choices\" with Demi Moore, \"Witchboard,\" \"SoapDish,\" \"Heaven's Tears,\" \"Cover Me,\" \"The Glass Cage,\" \"Phoenix,\" \"Checkmate,\" and \"A Hard Rain.\" Nichols has directed several stage productions including, \"Sixty Minutes from L.A.,\" a presentation pilot for television, \"Wild Horses\" and, most recently, wrote and directed the dramatic short film, \"Get the Dime,\" starring Daniel Bess and Robert Picardo. Upcoming, Nichols will direct the feature films, \"Eau de L.A.\" and \"Fear of Falling.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2MzgzMzMxMjJeQTJeQWpwZ15BbWU3MDE3MTM2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0629731","name":"Stephen Nichols","idIMDB":"nm0629731"},"actorId":"nm0629731","character":"Brandon Sinclair","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kathleen Wilhoite","urlProfile":"http://www.imdb.com/name/nm0001849","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzgwMTU5OTIzOF5BMl5BanBnXkFtZTcwMzczNzUwNg@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1964","placeOfBirth":" Santa Barbara, California, USA","birthName":"Kathleen Alice Wilhoite","height":"5' 5\" (1.65 m)","bio":"Born in 1964, Kathleen Wilhoite grew up in Santa Barbara, California, and began singing in her church choir from the first grade. Two years later, she was performing on stage, as part of a back-up choir, with The Carpenters, at the Santa Barbara County Bowl. All the while, she studied piano and songwriting and appeared in her high school's theater productions, such as \"The House of Blue Leaves\". Kathleen wrote and sang as one of the \"Boogie Woogie Bugle Girls\", a harmony group inspired by The Andrews Sisters. She also became the youngest member of the Santa Barbara Songwriters Guild (age 16). After high school, Kathleen elected to pursue an acting career, as opposed to music, and enrolled at the USC Drama School. Just a couple of months later, she landed her first movie role in Private School (1983). Throughout the 1980s, she appeared in a number of film and TV projects as both leads and second leads where her brash sexuality and unconventional style was eagerly put on display. She appeared noticeably opposite Charles Bronson in Murphy's Law (1986), Jane Fonda in The Morning After (1986), Robert De Niro in Angel Heart (1987), Amy Irving in Crossing Delancey (1988), Patrick Swayze in Road House (1989), and Debra Winger and Nick Nolte in Everybody Wins (1990), and Susan Sarandon and Nolte in Lorenzo's Oil (1992). While her acting career flourished, she continued to expand her music skills but was dealt with a few setbacks, including a contract with Mercury Records that fell through. After a brief sojourn to Texas to refocus intently on her music, Kathleen returned to the Hollywood rat race and eased back in as a \"working actress\". A variety of offbeat roles in such movies as Nurse Betty (2000) and Pay It Forward (2000) has kept her name active on the credits list for over two decades. She landed a number of challenging roles on such shows as L.A. Law (1986) and ER (1994) and, more recently, Gilmore Girls (2000) -- portraying everything from drugged-out moms to the mentally-challenged. In the late 1980s, Kathleen was chosen by cartoonist Cathy Guisewite to give vocal life to her \"Cathy\" creation on animated TV. Married to record producer/drummer David Harte and the mother of three children, Kathleen was signed by her husband to his \"The Daves\" record label (the other \"Dave\" is booking agent David Surnow) and released two CDS - \"Pitch Like a Girl\" (1997) and \"Shiva\" (2000). In sync with both her edgy acting and music style, she wrote and performed an autobiographical one-woman show, \"Stop Yellin',\" directed by Kathy Najimy, in which she sings her own music and performs monologues.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzgwMTU5OTIzOF5BMl5BanBnXkFtZTcwMzczNzUwNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001849","name":"Kathleen Wilhoite","idIMDB":"nm0001849"},"actorId":"nm0001849","character":"Zarabeth","urlCharacter":"http://www.imdb.com/character/ch0403681","main":true},{"actorName":"Burke Byrnes","urlProfile":"http://www.imdb.com/name/nm0126312","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MDM0ODQzMl5BMl5BanBnXkFtZTcwNjI3NDc0Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 December 1937","placeOfBirth":" Oceanside, Long Island, New York, USA","bio":"Burke Byrnes was born on December 9, 1937 in Oceanside, Long Island, New York, USA. He is an actor, known for The Land Before Time (1988), Child's Play 3 (1991) and Curly Sue (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MDM0ODQzMl5BMl5BanBnXkFtZTcwNjI3NDc0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0126312","name":"Burke Byrnes","idIMDB":"nm0126312"},"actorId":"nm0126312","character":"Lt. Dewhurst","urlCharacter":"http://www.imdb.com/character/ch0177324","main":true},{"actorName":"James W. Quinn","urlProfile":"http://www.imdb.com/name/nm0703875","urlPhoto":"","biography":{"height":"6' 1\" (1.85 m)","bio":"James W. Quinn is an actor, known for Night of the Demons (1988), Witchtrap (1989) and Witchboard (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0703875","name":"James W. Quinn","idIMDB":"nm0703875"},"actorId":"nm0703875","character":"Lloyd","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rose Marie","urlProfile":"http://www.imdb.com/name/nm0547300","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NTQ2MTEyN15BMl5BanBnXkFtZTYwNTE5OTU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 August 1923","placeOfBirth":" New York City, New York, USA","birthName":"Rose Marie Mazetta","bio":"Rose Marie is a legend of show business with a career stretching over 80 years since her debut as her self in a Vitaphone musical short that appeared on the bill with The Jazz Singer (1927) at its premiere in 1927. According to Rose Marie, when she approached Al Jolson at The Wintergarden Theater in New York on the night of the premiere that made movie history and told him, \"You were wonderful, Mr. Jolson!\", his reply was, \"Get away, you little brat!\" \"He didn't like kids,\" Rose Marie explained. Her first credited appearance is in another musical short, Baby Rose Marie the Child Wonder (1929) in 1929. The legendary performer was born Rose Marie Mazetta on August 15, 1923 in New York City, the daughter of an Italian-American father and Polish-American mother. Blessed with a remarkable singing voice for a child that allowed her to belt out jazz songs in the \"coon shouter\" style of the 1920s (as exemplified by Sophie Tucker), she began performing when she was three years old as \"Baby Rose Marie.\" By the time she was five, she had her own radio show on NBC, appearing after 'Amos and Andy' (1949)_, the most popular show in the country. Many people could not believe the voice they were hearing actually belonged to a child. Baby Rose Marie made many appearances in films in the 1930s, most famously in International House (1933), a movie about television, the medium in which Rose Marie would win her everlasting fame. In addition to her film performances, Baby Rose Marie also appeared on records and performed in vaudeville as a headliner. One of the acts she appeared with was Edgar Bergen before his Charlie McCarthy ventriloquism act, when he was still a small-timer. A half century letter, when she appeared on Murphy Brown (1988), she told star Candice Bergen, \"I worked with your father in vaudeville when he was doing a doctor sketch.\" When Bergen replied that she couldn't have played the nurse in the act as she was too young, Rose Marie told her that she was the headliner and he was her opening act. \"She didn't care for that too much,\" Rose Marie remembered. She also appeared in vaudeville with Dick Powell, Rudy Vallee and Jimmy Durante, who mentored her. She also entertained at the White House three separate times at the request of three presidents. They were Calvin Coolidge, Herbert Hoover and Franklin D. Roosevelt. She transitioned to becoming a nightclub chanteuse as a teenager, playing all the big night clubs and hotels in New York, Chicago, Atlantic City, Las Vegas and Miami, Florida, usually in Mob-controlled venues. (Prominent mobsters, who called her \"The Kid\", liked her and protected her.) A young Milton Berle, whom she had known since she was a child, wrote some of her material, as did Morey Amsterdam, her future \"Dick Van Dyke\" co-star whom she knew since she was nine years old. After the war she married trumpeter Bobby Guy of the Kay Kyser Orchestra, in 1946. She made her Broadway debut in 1951, co-starring with Phil Silvers in the hit show Top Banana (1954) (she also appeared in the 1954 film adaptation). Rose Marie also appeared on radio on \"The Phil Harris - Alice Faye Show\", playing the sister of Sheldon Leonard, who would later hire her for The Dick Van Dyke Show (1961) in his capacity as executive producer. Rose Marie had a career resurgence as an actress in the 1960s, starring in three sit-coms during the decade: First, My Sister Eileen (1960) in the 1960-1961 season. Second: as comedy writer \"Sally Rogers\" on The Dick Van Dyke Show (1961) from 1961 to 1966, and on The Doris Day Show (1968) from 1969 to 1971. She also appeared frequently on The Hollywood Squares (1965). She was the center square atleast once, and had a recurring role on Murphy Brown (1988) and Wings (1990). She also kept her singing career going, touring as part of the musical revue \"4 Girls 4\" from 1977 to 1981 with Rosemary Clooney, Helen O'Connell and Margaret Whiting. Now approaching ninety, Rose Marie continues to make occasional appearances.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NTQ2MTEyN15BMl5BanBnXkFtZTYwNTE5OTU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0547300","name":"Rose Marie","idIMDB":"nm0547300"},"actorId":"nm0547300","character":"Mrs. Moses","urlCharacter":"http://www.imdb.com/character/ch0338689","main":true},{"actorName":"Judy Tatum","urlProfile":"http://www.imdb.com/name/nm0851362","urlPhoto":"","biography":{"bio":"Judy Tatum is an actress, known for Witchboard (1986), Witchtrap (1989) and Book of Joe (1984).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0851362","name":"Judy Tatum","idIMDB":"nm0851362"},"actorId":"nm0851362","character":"Dr. Gelineau","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gloria Hayes","urlProfile":"http://www.imdb.com/name/nm0371031","urlPhoto":"","biography":{"bio":"Gloria Hayes is an actress, known for Witchboard (1986), Happy Together (1989) and The Frisco Kid (1979).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0371031","name":"Gloria Hayes","idIMDB":"nm0371031"},"actorId":"nm0371031","character":"Wanda","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"J.P. Luebsen","urlProfile":"http://www.imdb.com/name/nm0525088","urlPhoto":"","biography":{"bio":"J.P. Luebsen is known for his work on Witchboard (1986), Flashback (2015) and Witchtrap (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0525088","name":"J.P. Luebsen","idIMDB":"nm0525088"},"actorId":"nm0525088","character":"Malfeitor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Susan Nickerson","urlProfile":"http://www.imdb.com/name/nm1270888","urlPhoto":"","biography":{"bio":"Susan Nickerson is an actress, known for Witchboard (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1270888","name":"Susan Nickerson","idIMDB":"nm1270888"},"actorId":"nm1270888","character":"Chris","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ryan Carroll","urlProfile":"http://www.imdb.com/name/nm0140975","urlPhoto":"","biography":{"bio":"Ryan Carroll is a producer and director, known for Toolbox Murders (2004), Legends of Oz: Dorothy's Return (2013) and The Convent (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0140975","name":"Ryan Carroll","idIMDB":"nm0140975"},"actorId":"nm0140975","character":"Roger","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kenny Rhodes","urlProfile":"http://www.imdb.com/name/nm0722475","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODExMzY3Nzg4MV5BMl5BanBnXkFtZTYwNDE4MzEz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Kenny Rhodes is a producer and director, known for Orange Carpet Special Edition (2014), Hour of Stars (1955) and Witchboard (1986).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODExMzY3Nzg4MV5BMl5BanBnXkFtZTYwNDE4MzEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0722475","name":"Kenny Rhodes","idIMDB":"nm0722475"},"actorId":"nm0722475","character":"Mike","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clare Bristol","urlProfile":"http://www.imdb.com/name/nm0109919","urlPhoto":"","biography":{"bio":"Clare Bristol is an actress, known for Witchboard (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0109919","name":"Clare Bristol","idIMDB":"nm0109919"},"actorId":"nm0109919","character":"Anchorwoman","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0090327","urlIMDB":"http://www.imdb.com/title/tt0090327","business":{"budget":{"money":"$2,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$95,435","country":"USA","day":"04","month":"01","year":"1987","remarks":"15 Screens"}],"gross":[{"money":"$7,369,373","country":"USA","day":"03","month":"05","year":"1987","remarks":""},{"money":"$7,259,470","country":"USA","day":"26","month":"04","year":"1987","remarks":""},{"money":"$7,111,063","country":"USA","day":"19","month":"04","year":"1987","remarks":""},{"money":"$6,942,975","country":"USA","day":"12","month":"04","year":"1987","remarks":""},{"money":"$6,648,246","country":"USA","day":"05","month":"04","year":"1987","remarks":""},{"money":"$6,119,137","country":"USA","day":"29","month":"03","year":"1987","remarks":""},{"money":"$3,026,389","country":"USA","day":"22","month":"03","year":"1987","remarks":""},{"money":"$3,026,389","country":"USA","day":"15","month":"03","year":"1987","remarks":""},{"money":"$436,032","country":"USA","day":"08","month":"02","year":"1987","remarks":""},{"money":"$404,405","country":"USA","day":"01","month":"02","year":"1987","remarks":""},{"money":"$370,071","country":"USA","day":"25","month":"01","year":"1987","remarks":""},{"money":"$330,333","country":"USA","day":"18","month":"01","year":"1987","remarks":""},{"money":"$254,851","country":"USA","day":"11","month":"01","year":"1987","remarks":""},{"money":"$95,435","country":"USA","day":"04","month":"01","year":"1987","remarks":""}],"weekendGross":[{"money":"$71,019","country":"USA","day":"03","month":"05","year":"1987","remarks":"82 Screens"},{"money":"$121,298","country":"USA","day":"26","month":"04","year":"1987","remarks":"131 Screens"},{"money":"$129,029","country":"USA","day":"19","month":"04","year":"1987","remarks":"123 Screens"},{"money":"$151,680","country":"USA","day":"12","month":"04","year":"1987","remarks":"171 Screens"},{"money":"$367,840","country":"USA","day":"05","month":"04","year":"1987","remarks":"304 Screens"},{"money":"$759,808","country":"USA","day":"29","month":"03","year":"1987","remarks":"512 Screens"},{"money":"$1,674,623","country":"USA","day":"22","month":"03","year":"1987","remarks":"1,005 Screens"},{"money":"$2,582,408","country":"USA","day":"15","month":"03","year":"1987","remarks":"1 Screen"},{"money":"$17,694","country":"USA","day":"08","month":"02","year":"1987","remarks":"11 Screens"},{"money":"$28,372","country":"USA","day":"01","month":"02","year":"1987","remarks":"14 Screens"},{"money":"$32,612","country":"USA","day":"25","month":"01","year":"1987","remarks":"15 Screens"},{"money":"$52,514","country":"USA","day":"18","month":"01","year":"1987","remarks":"15 Screens"},{"money":"$72,026","country":"USA","day":"11","month":"01","year":"1987","remarks":"15 Screens"},{"money":"$95,435","country":"USA","day":"04","month":"01","year":"1987","remarks":"15 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"© 1986 Paragon Arts Partners, Ltd."},"technical":{"runtime":["1 hr 38 min (98 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["DeLuxe, Hollywood (CA), USA (color)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"5.7","filmingLocations":[{"location":"Big Bear Lake, Big Bear Valley, San Bernardino National Forest, California, USA"}],"rated":"R","awards":[],"votes":"4,542","type":"Movie","companyCreditsSimple":[{"idCompany":"co0032369","name":"Paragon Arts International"}],"keywords":{"keywords":["ouija board","ouija","evil spirit","hatchet","psychopathic killer","blood splatter","axe murderer","homicidal maniac","man crying","axe in the head","microfilm","cemetery","false pregnancy","hospital","skeptic","thrown out a window","psychic","medium","nightmare","police detective","morning sickness","child ghost","ghost boy","ghost child","paranormal","diamond ring","construction worker","construction","bare chested male","spirit","evil","female nudity","satanic","serial murder","madman","sadistic psychopath","butcher","butchery","slashing","american horror","murderer","serial murderer","bullet hole","stabbed in the chest","bad guy","villain","evil man","gore","body count","killing spree","killing","maniac","undead","psychopath","mass murderer","slasher","serial killer","psycho killer","electronic music score","mountain dew","coors light","coors beer","possession","demonic possession","character's point of view camera shot","dying in someone's arms","blood on face","blood","boxer shorts","male underwear","public library","library","paranormal activity","supernatural power","landlady","fainting","screaming in horror","screaming in fear","demonic spirit","seance","summoning a spirit","pregnant woman","mirror","vengeful ghost","ghost","ghost story","rivalry","male rivalry","paranormal phenomena","hairy chest","first part","first of trilogy","one word title","part of trilogy","lieutenant","first of series","supernatural","death of friend","independent film","surprise ending","demon"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:05:47"}}