{"data":{"movies":[{"title":"Terreur à l'hôpital central","originalTitle":"Visiting Hours","year":"1982","releaseDate":"19820528","directors":[{"name":"Jean-Claude Lord","id":"nm0520440"}],"writers":[{"name":"Brian Taggert","id":"nm0846532"}],"runtime":"103 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGRiNzY1NTEtZjAxYy00M2U2LThiZTEtOGQ0NWU0NTljYTY0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["Canada"],"languages":["English"],"genres":["Horror","Thriller"],"plot":"Deborah Ballin is a controversial middle-aged TV journalist, who is campaigning on air on behalf of a battered woman who murdered her abusive husband, claiming justifiable defense against the so-called victim. But her outspoken views championing women's rights incense one of the studio's cleaning staff, closet homicidal psycho (and misogynist) Colt Hawker whose deep seated despising all all things female occurred from seeing his Mother throwing boiling oil in the face of his abusive Father when he was a small child (and who's M.O. is to photograph victims he stabs as they're spasming to death). So much so that he decides there and then to shut her up...PERMANENTLY! Managing to beat her home, he soon dispatches her maid Francine, before turning his rage onto her as she come home (greeting her in only wearing her jewelry and make-up). Despite the brutal injuries he lashes out on her, she manages to survive and is rushed off to hospital. But undaunted he catches up to her in hospital and...","simplePlot":"A deranged, misogynistic killer assaults a journalist. When he discovers that she survived the attack, he follows her to the hospital to finish her off.","actors":[{"actorName":"Michael Ironside","urlProfile":"http://www.imdb.com/name/nm0000461","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NTg3MDYyM15BMl5BanBnXkFtZTgwMDk0ODc3ODE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1950","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Frederick Reginald Ironside","height":"5' 9½\" (1.77 m)","bio":"Michael Ironside has made a strong and indelible impression with his often incredibly intense and explosive portrayals of fearsome villains throughout the years. He was born as Frederick Reginald Ironside on February 12, 1950 in Toronto, Ontario, Canada. Ironside was a successful arm wrestler in his teenage years. His initial ambition was to be a writer. At age fifteen, Michael wrote a play called \"The Shelter\" that won first prize in a Canada-wide university contest; He used the prize money to mount a production of this play. Ironside attended the Ontario College of Art, took acting lessons from Janine Manatis, and studied for three years at the Canadian National Film Board. Ironside worked in construction as a roofer prior to embarking on an acting career. Ironside first began acting in movies in the late 1970s. He received plenty of recognition with his frightening turn as deadly and powerful psychic Darryl Revok in David Cronenberg's Scanners (1981). He was likewise very chilling as vicious misogynistic psychopath Colt Hawker in the underrated Terreur à l'hôpital central (1982). Other memorable film roles include weary Detective Roersch in the sadly forgotten thriller Cross Country (1983), the crazed Overdog in the immensely enjoyable Spacehunter: Adventures in the Forbidden Zone (1983), the hard-nosed Jester in the blockbuster smash Top Gun (1986), ramrod Major Paul Hackett in Extreme Prejudice (1987), loner Vietnam veteran \"Ben\" in Nowhere to Hide (1987), the ferocious Lem Johnson in Watchers (1988), and lethal immortal General Katana in Highlander II: The Quickening (1991). Moreover, Ironside has appeared in two highly entertaining science fiction features for Paul Verhoeven: At his savage best as the evil Richter in Total Recall (1990) and typically excellent as the rugged Lieutenant Jean Rasczak in Starship Troopers (1997). Ironside showed a more tender and thoughtful side with his lovely and touching performance as a hardened convict who befriends a disabled man in the poignant indie drama gem Chaindance (1991); he also co-wrote the script and served as an executive producer for this beautiful sleeper. Michael was terrific as tough mercenary Ham Tyler on the epic miniseries V (1984), its follow up V: The Final Battle (1984), and subsequent short-lived spin-off series. Ironside also had a recurring role on the television series SeaQuest 2032 (1993). Among the television series he has done guest spots on are The A-Team (1983), Hill Street Blues (1981), The New Mike Hammer (1984), Deadly Nightmares (1983), Tales from the Crypt (1989), Superman (1996), Walker, Texas Ranger (1993), Au-delà du réel - l'aventure continue (1995), ER (1994), Smallville (2001), ER (1994), Desperate Housewives (2004), Justice League (2001) and Masters of Horror (2005). More recently, Ironside garnered a slew of plaudits and a Gemini Award nomination for his outstanding portrayal of shrewd biker gang leader Bob Durelle in the acclaimed Canadian miniseries The Last Chapter II: The War Continues (2003). In addition to his substantial film and television work, Ironside has also lent his distinctive deep voice to TV commercials and video games.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NTg3MDYyM15BMl5BanBnXkFtZTgwMDk0ODc3ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000461","name":"Michael Ironside","idIMDB":"nm0000461"},"actorId":"nm0000461","character":"Colt Hawker","urlCharacter":"http://www.imdb.com/character/ch0075191","main":true},{"actorName":"Lee Grant","urlProfile":"http://www.imdb.com/name/nm0335519","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NTQxMzI5MF5BMl5BanBnXkFtZTcwNTMzMDU4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1926","placeOfBirth":" New York City, New York, USA","birthName":"Lyova Haskell Rosenthal","height":"5' 3¾\" (1.62 m)","bio":"Academy Award winner Lee Grant was born Lyova Haskell Rosenthal on October 31, 1926 in Manhattan, New York City, to Witia (Haskell), a teacher and actress, and Abraham Rosenthal, an educator and realtor. Her father was of Romanian Jewish descent, and her mother was a Russian Jewish immigrant. Lee made her stage debut at age 4 at the Metropolitan Opera in New York City, playing the abducted princess in \"L'Orocolo\". After graduating from high school, she won a scholarship to the Neighborhood Playhouse School of the Theatre, where she studied acting with Sanford Meisner. When she was a teenager Grant established herself as a formidable Broadway talent when she won The Critics' Circle Award for her portrayal of the shoplifter in \"Detective Story\". She reprised the role in the film version (Detective Story (1951), a performance that garnered her the Cannes Film Festival Citation for Best Actress as well as her first Academy Award Nomination. Immediately following her screen debut, however, Lee became a victim of the McCarthy-era blacklists in which actors, writers, directors, etc., were persecuted for supposedly \"Communist\" or \"progressive\" political beliefs, whether they had them or not. Except for an occasional role, she did not work in film or television for 10 years. In 1966 Lee re-started her acting career in the TV series Peyton Place (1964), for which she won an Emmy Award as Stella Chernak, and she later garnered her first Academy Award for Shampoo (1975), also receiving Academy Award nominations for The Landlord (1970) and Voyage of the Damned (1976). Since 1980 Lee has been concentrating on her directorial career, which began as part of the Women's Project at The Americal Film Institute (AFI); her adaptation of August Strindberg's, \"Stronger, The\" was consequently selected as one of the 10 best films ever produced for AFI. In 1987 she received an Academy Award for the HBO documentary, Down and Out in America (1986) and directed Nobody's Child (1986) for CBS, for which she received the Directors Guild Award. In 1983 she received the Congressional Arts Caucus Award for Outstanding Achievement in Acting and Independent Filmmaking. Subsequently, Women in Film paid tribute to her in 1989, with its first-ever Lifetime Achievement Award. Both the New York City Council and the County of Los Angeles Board of Supervisors have recognized Ms. Grant for the contribution her films have made to the fight against domestic violence.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NTQxMzI5MF5BMl5BanBnXkFtZTcwNTMzMDU4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0335519","name":"Lee Grant","idIMDB":"nm0335519"},"actorId":"nm0335519","character":"Deborah Ballin","urlCharacter":"http://www.imdb.com/character/ch0075192","main":true},{"actorName":"Linda Purl","urlProfile":"http://www.imdb.com/name/nm0700909","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMDQyMzIyNV5BMl5BanBnXkFtZTcwMDQ1MDg2OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 September 1955","placeOfBirth":" Greenwich, Connecticut, USA","birthName":"Linda M. Purl","height":"5' 5\" (1.65 m)","bio":"Linda Purl was born in Connecticut and raised in Japan, becoming the only foreigner to train at the Toho Geino Academy. At the Imperial Theatre in Tokyo, she played the role of \"Louis\" in \"The King and I\" (in Japanese), \"Bet\" in \"Oliver\" and the role of \"Helen Keller\" in \"The Miracle Worker\". She then went to England to study under Marguerite Beale, before returning to the United States to study at the Lee Strasberg Institute and, later, with Robert Lewis. Her stage credits include: The Broadway musical, \"The Adventures of Tom Sawyer\"; \"Getting and Spending\", which ran on Broadway at the Helen Hayes Theatre.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMDQyMzIyNV5BMl5BanBnXkFtZTcwMDQ1MDg2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0700909","name":"Linda Purl","idIMDB":"nm0700909"},"actorId":"nm0700909","character":"Sheila Munroe","urlCharacter":"http://www.imdb.com/character/ch0075193","main":true},{"actorName":"William Shatner","urlProfile":"http://www.imdb.com/name/nm0000638","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NjUzOTEzMl5BMl5BanBnXkFtZTcwOTMyMTA3Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1931","placeOfBirth":" Montreal, Quebec, Canada","height":"5' 9½\" (1.77 m)","bio":"William Shatner has notched up an impressive 50-plus years in front of the camera, most recently displaying comedic talent, and being instantly recognizable to several generations of cult television fans as the square-jawed Captain James T. Kirk, commander of the starship U.S.S. Enterprise. Shatner was born in Côte Saint-Luc, Montreal, Canada, to Anne (Garmaise) and Joseph Shatner, a clothing manufacturer. His father was a Jewish immigrant from Bukovina in the Austro-Hungarian Empire, while his maternal grandparents were Lithuanian Jews. After graduating from university he joined a local Summer theatre group as an assistant manager. He then performed with the National Repertory Theatre of Ottawa and at the Stratford, Ontario Shakespeare Festival as an understudy working with such as Alec Guinness, James Mason, and Anthony Quayle. He came to the attention of New York critics and was soon playing important roles on major shows in live television. Shatner spent many years honing his craft before debuting alongside Yul Brynner in The Brothers Karamazov (1958). He was kept busy during the 1960s in films such as Judgment at Nuremberg (1961) and The Intruder (1962) and on television guest-starring in dozens of series such as Alfred Hitchcock Presents (1955), The Defenders (1961), The Outer Limits (1963) and The Twilight Zone (1959). In 1966, Shatner boarded the USS Enterprise for three seasons of Star Trek (1966), co-starring alongside Leonard Nimoy, with the series eventually becoming a bona-fide cult classic with a worldwide legion of fans known as \"Trekkies\". After \"Star Trek\" folded, Shatner spent the rest of the decade and the 1970s making the rounds guest-starring on many prime-time television series, including Hawaii Five-O (1968), Marcus Welby, M.D. (1969) and Ironside (1967). He has also appeared in several feature films, but they were mainly B-grade (or lower) fare such as the embarrassingly bad Euro western White Comanche (1968) and the campy Kingdom of the Spiders (1977). However, the 1980s saw a major resurgence in Shatner's career with the renewed interest in the original Star Trek (1966) series culminating in a series of big-budget \"Star Trek\" feature films including Star Trek: The Motion Picture (1979), Star Trek II: The Wrath of Khan (1982), Star Trek III: The Search for Spock (1984), Star Trek IV: The Voyage Home (1986), Star Trek V: The Final Frontier (1989) and Star Trek VI: The Undiscovered Country (1991). In addition, he starred in the lightweight police series T.J. Hooker (1982) from 1982 to 1986, alongside spunky Heather Locklear, and surprised many fans with his droll comedic talents in Airplane II: The Sequel (1982), Loaded Weapon 1 (1993) and Miss Congeniality (2000). He has most recently been starring in the David E. Kelley television series The Practice (1997) and its spin-off Boston Legal (2004). Outside of work he jogs and follows other athletic pursuits. His interest in health and nutrition led to him becoming spokesman for the American Health Institute's 'Know Your Body' Programme to promote nutritional and physical health.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NjUzOTEzMl5BMl5BanBnXkFtZTcwOTMyMTA3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000638","name":"William Shatner","nicknames":["Bill","Billy"],"idIMDB":"nm0000638"},"actorId":"nm0000638","character":"Gary Baylor","urlCharacter":"http://www.imdb.com/character/ch0075194","main":true},{"actorName":"Lenore Zann","urlProfile":"http://www.imdb.com/name/nm0952801","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDk2NzI1NF5BMl5BanBnXkFtZTcwOTU3ODgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1959","placeOfBirth":" Sydney, Australia","birthName":"Lenore Elizabeth Zann","height":"5' 4\" (1.63 m)","bio":"Lenore Zann was born on November 22, 1959 in Sydney, Australia as Lenore Elizabeth Zann. She is an actress, known for X-Men (1992), Def-Con 4 (1985) and Happy birthday, souhaitez ne jamais être invité (1981). She was previously married to Dennis Keaveney and Ralph Dillon.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDk2NzI1NF5BMl5BanBnXkFtZTcwOTU3ODgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0952801","name":"Lenore Zann","nicknames":["Zan"],"idIMDB":"nm0952801"},"actorId":"nm0952801","character":"Lisa","urlCharacter":"http://www.imdb.com/character/ch0075195","main":true},{"actorName":"Harvey Atkin","urlProfile":"http://www.imdb.com/name/nm0014873","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MzU5ODIxOF5BMl5BanBnXkFtZTcwODUwMDQwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1942","placeOfBirth":" Toronto, Ontario, Canada","bio":"Harvey Atkin was born on December 18, 1942 in Toronto, Ontario, Canada. He is an actor, known for Cagney & Lacey (1981), Arrête de ramer, t'es sur le sable (1979) and The Super Mario Bros. Super Show! (1989). He is married to Celia. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MzU5ODIxOF5BMl5BanBnXkFtZTcwODUwMDQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0014873","name":"Harvey Atkin","idIMDB":"nm0014873"},"actorId":"nm0014873","character":"Vinnie Bradshaw","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Helen Hughes","urlProfile":"http://www.imdb.com/name/nm0400647","urlPhoto":"","biography":{"dateOfBirth":"8 January 1918","placeOfBirth":" Johnstown, Pennsylvania, USA","bio":"Helen Hughes was born on January 8, 1918 in Johnstown, Pennsylvania, USA. She is an actress, known for Billy Madison (1995), Tommy Boy (1995) and Au nom de tous les miens (1983).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0400647","name":"Helen Hughes","idIMDB":"nm0400647"},"actorId":"nm0400647","character":"Louise Shepherd","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael J. Reynolds","urlProfile":"http://www.imdb.com/name/nm0721866","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MTUwNzUxNF5BMl5BanBnXkFtZTYwMzI3MzEz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 August 1939","placeOfBirth":" Toronto, Ontario, Canada","bio":"Michael J. Reynolds was born on August 15, 1939 in Toronto, Ontario, Canada. He is an actor, known for The Descent: Part 2 (2009), Fly Away Home (1996) and Police Academy (1984).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MTUwNzUxNF5BMl5BanBnXkFtZTYwMzI3MzEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0721866","name":"Michael J. Reynolds","idIMDB":"nm0721866"},"actorId":"nm0721866","character":"Porter Halstrom","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kirsten Bishop","urlProfile":"http://www.imdb.com/name/nm0084113","urlPhoto":"","biography":{"dateOfBirth":"6 September 1963","placeOfBirth":" Montreal, Quebec, Canada","birthName":"Kirsten Johanne Alice Bishopric","height":"5' 6\" (1.68 m)","bio":"Kirsten Bishop was born on September 6, 1963 in Montreal, Quebec, Canada as Kirsten Johanne Alice Bishopric. She was an actress and writer, known for Frequency (2000), Shivers (1975) and Rudy: The Rudy Giuliani Story (2003). She was married to Douglas Roberts. She died on April 15, 2014 in Toronto, Ontario, Canada.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0084113","name":"Kirsten Bishop","idIMDB":"nm0084113"},"actorId":"nm0084113","character":"Denise","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Deborah Kirshenbaum","urlProfile":"http://www.imdb.com/name/nm0456980","urlPhoto":"","biography":{"bio":"Deborah Kirshenbaum is an actress, known for The Long Kiss Goodnight (1996), Terreur à l'hôpital central (1982) and Hidden in America (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0456980","name":"Deborah Kirshenbaum","idIMDB":"nm0456980"},"actorId":"nm0456980","character":"Connie Wexler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elizabeth Leigh-Milne","urlProfile":"http://www.imdb.com/name/nm0500321","urlPhoto":"","biography":{"bio":"Elizabeth Leigh-Milne is an actress, known for Terreur à l'hôpital central (1982), The Broken Cord (1992) and Kaleidoscope (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0500321","name":"Elizabeth Leigh-Milne","idIMDB":"nm0500321"},"actorId":"nm0500321","character":"Patricia Ellis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maureen McRae","urlProfile":"http://www.imdb.com/name/nm0574449","urlPhoto":"","biography":{"bio":"Maureen McRae is an actress and art director, known for Terreur à l'hôpital central (1982), The Legend of Wolf Lodge (1988) and Le meurtrier de l'Illinois (1992).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0574449","name":"Maureen McRae","idIMDB":"nm0574449"},"actorId":"nm0574449","character":"Elizabeth Hawker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dustin Waln","urlProfile":"http://www.imdb.com/name/nm0909465","urlPhoto":"","biography":{"bio":"Dustin Waln is an actor, known for Terreur à l'hôpital central (1982), Real Inside (1984) and Gas (1981).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0909465","name":"Dustin Waln","idIMDB":"nm0909465"},"actorId":"nm0909465","character":"Mr. Hawker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Neil Affleck","urlProfile":"http://www.imdb.com/name/nm0012682","urlPhoto":"","biography":{"dateOfBirth":"1953","placeOfBirth":" Montreal, Quebec, Canada","bio":"Neil Affleck was born in 1953 in Montreal, Quebec, Canada. He is known for his work on The Simpsons Movie (2007), The Simpsons (1989) and Miss Spider's Sunny Patch Friends (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0012682","name":"Neil Affleck","idIMDB":"nm0012682"},"actorId":"nm0012682","character":"Police Officer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Damir Andrei","urlProfile":"http://www.imdb.com/name/nm0028319","urlPhoto":"","biography":{"bio":"Damir Andrei is an actor, known for Jumper (2008), Faux-semblants (1988) and The Caveman's Valentine (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0028319","name":"Damir Andrei","idIMDB":"nm0028319"},"actorId":"nm0028319","character":"Paramedic","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0083296","urlIMDB":"http://www.imdb.com/title/tt0083296","business":{"budget":{"money":"$CAD5,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$5,250,157","country":"USA","day":"31","month":"05","year":"1982","remarks":"1,176 Screens"}],"gross":[{"money":"$12,581,713","country":"USA","day":"27","month":"06","year":"1982","remarks":""},{"money":"$11,943,356","country":"USA","day":"20","month":"06","year":"1982","remarks":""},{"money":"$10,944,524","country":"USA","day":"13","month":"06","year":"1982","remarks":""},{"money":"$8,913,984","country":"USA","day":"06","month":"06","year":"1982","remarks":""},{"money":"$5,250,157","country":"USA","day":"31","month":"05","year":"1982","remarks":""}],"weekendGross":[{"money":"$406,733","country":"USA","day":"27","month":"06","year":"1982","remarks":"364 Screens"},{"money":"$509,105","country":"USA","day":"20","month":"06","year":"1982","remarks":"338 Screens"},{"money":"$1,133,359","country":"USA","day":"13","month":"06","year":"1982","remarks":"660 Screens"},{"money":"$2,581,076","country":"USA","day":"06","month":"06","year":"1982","remarks":""},{"money":"$5,250,157","country":"USA","day":"31","month":"05","year":"1982","remarks":""}],"admissions":null,"productionDates":{"money":null,"country":null,"day":"24","month":"10","year":"1980","remarks":null},"filmingDates":null,"copyrightHolder":"©Guardian Trust Company, 618 St. Jaques Street, Montreal, Quebec, Canada (on behalf of unitholders), 1981."},"technical":{"runtime":["1 hr 45 min (105 min)","1 hr 43 min (103 min) (USA)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panaflex Camera and Lenses by Panavision"],"laboratory":["Bellevue Pathé Québec Inc., Montreal, Canada"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.5","filmingLocations":[{"location":"Montréal, Québec, Canada"}],"rated":"R","awards":[{"award":"Genie Awards 1983","titlesAwards":[{"titleAwardOutcome":"Nominated Genie","categories":[{"category":"Best Performance by a Foreign Actress","names":[{"name":"Lee Grant","id":"nm0335519","role":null}]},{"category":"Best Music Score","names":[{"name":"Jonathan Goldsmith","id":"nm1365883","role":null}]}]}]}],"votes":"2,644","type":"Movie","companyCreditsSimple":[{"idCompany":"co0051074","name":"Canadian Film Development Corporation (CFDC)"},{"idCompany":"co0077368","name":"Filmplan"},{"idCompany":"co0151527","name":"Victor Solnicki Productions"}],"keywords":{"keywords":["psycho","grindhouse","serial killer","hospital","journalist","rage","closet","photograph","injury","death","boiling oil","bechdel test passed","canadian horror","canada","cult film","grindhouse film","psychotronic","human monster","stabbed in the stomach","flashback","underground","fondling","fainting","curtain","wrath","wheelchair","van","trousers","tv news","teddy bear","tank top","syringe","surgical mask","surgery","surgeon","suffocation","stretcher","staring","stare","stairs","sofa","skirt","shotgun","shirt","scissors","rifle","press conference","policeman","police officer","police custody","patient","pants","panic","old man","night","neck breaking","mutilated doll","mirror","microphone","machinery","locker room","kitchen","jacket","injection","hypodermic needle","hospital staff","guard","glasses","fright","fear","evil","elevator","drink","drinking","dress","domestic violence","doll","devastation","dead woman","crying","couch","clothes ripping","cigarette smoking","car","car driving","burnt face","bruise","broken window","broken neck","bouquet","black eye","bite marks","beer","beer drinking","beer bottle","bedroom","beating","bandage","ball","asylum","asphyxiation","anger","ambulance","wound","woman taking off pants","woman journalist","watching tv","trauma","traumatic childhood experience","television","television studio","telephone","telephone call","switchblade","stalker","stabbed in the chest","stabbed in the back","shower","sexual violence","sexual sadism","sexual perversion","sexual desire","sexual attraction","sexual abuse","self injury","sadist","sadism","running","psychotic","psychological trauma","psycho killer","police","police detective","police car","photography","photo shoot","perversion","panties","nurse","nurse patient relationship","murder attempt","monitor","medical doctor","living room","knife","knife murder","interview","hospital room","hospital bed","homicide","homicidal maniac","hallway","friend","fragments of glass","flower","father son relationship","escape","employer employee relationship","dying","dying woman","drugs","doctor","disturbed individual","desperation","dead patient","dark past","danger","cut","cruelty","collage","camera","burn injury","brunette","broken mirror","broken door","broken bottle","boss","blonde","biting","bite","bed","bathroom","angst","video nasty","b movie","maniac","rape","murder","stalking","slasher","blood","violence","psychopath","rampage","independent film","1980s"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 07:53:40"}}