{"data":{"movies":[{"title":"Little Shop of Horrors","originalTitle":"","year":"1986","releaseDate":"19861219","directors":[{"name":"Frank Oz","id":"nm0000568"}],"writers":[{"name":"Howard Ashman","id":"nm0039141"},{"name":"Howard Ashman","id":"nm0039141"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzNDM4MjYwNF5BMl5BanBnXkFtZTgwMDE4NzkzMTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Family","Musical","Romance","Sci-Fi"],"plot":"Seymour Krelborn is a nerdy orphan working at Mushnik's, a flower shop in urban Skid Row. He harbors a crush on fellow co-worker Audrey Fulquard, and is berated by Mr. Mushnik daily. One day as Seymour is seeking a new mysterious plant, he finds a very mysterious unidentified plant which he calls Audrey II. The plant seems to have a craving for blood and soon begins to sing for his supper. Soon enough, Seymour feeds Audrey's sadistic dentist boyfriend to the plant and later, Mushnik for witnessing the death of Audrey's ex. Will Audrey II take over the world or will Seymour and Audrey defeat it?","simplePlot":"A nerdy florist finds his chance for success and romance with the help of a giant man-eating plant who demands to be fed.","actors":[{"actorName":"Levi Stubbs","urlProfile":"http://www.imdb.com/name/nm0835925","urlPhoto":"","biography":{"dateOfBirth":"6 June 1936","placeOfBirth":" Detroit, Michigan, USA","birthName":"Levi Stubbles","height":"5' 11\" (1.8 m)","bio":"Levi Stubbs was born on June 6, 1936 in Detroit, Michigan, USA as Levi Stubbles. He was an actor, known for Little Shop of Horrors (1986), Captain N: The Game Master (1989) and Motown on Showtime: Temptations and Four Tops (1986). He was married to Clineice Townsend. He died on October 17, 2008 in Detroit.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0835925","name":"Levi Stubbs","idIMDB":"nm0835925"},"actorId":"nm0835925","character":"Audrey II","urlCharacter":"http://www.imdb.com/character/ch0029629","main":true},{"actorName":"Rick Moranis","urlProfile":"http://www.imdb.com/name/nm0001548","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MTM4NTY0OF5BMl5BanBnXkFtZTcwMjA0NTgwMw@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1953","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Frederick Alan Moranis","height":"5' 4\" (1.63 m)","bio":"Rick began his career as a radio DJ while he was still at high school which led to him writing, producing and being on air in his own show. He joined the Canadian TV series SCTV (1976) winning an Emmy for writing and portraying the character Bob McKenzie which became the basis for the film _Strange Brew_ which he co-wrote, co-directed and made his film acting debut. The character he played in Ghostbusters (1984) was based on a similar character he played on SCTV (1976)_.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MTM4NTY0OF5BMl5BanBnXkFtZTcwMjA0NTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001548","name":"Rick Moranis","idIMDB":"nm0001548"},"actorId":"nm0001548","character":"Seymour Krelborn","urlCharacter":"http://www.imdb.com/character/ch0029146","main":true},{"actorName":"Ellen Greene","urlProfile":"http://www.imdb.com/name/nm0338746","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3OTQ5NDYyN15BMl5BanBnXkFtZTcwOTgzNjcwNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1951","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"5' 6\" (1.68 m)","bio":"The energetic Brooklyn-born Ellen Greene had already made a name for herself with a prolific career in both singing and stage before she made her film debut in Paul Mazursky's Next Stop, Greenwich Village (1976). Having already performed the role of Audrey in the musical comedy \"Little Shop of Horrors\" (1982). She reprised the role in Frank Oz's film adaptation of Little Shop of Horrors (1986). While Ellen has first and foremost been a product of the stage, we should acknowledge her performances before-the-camera in Talk Radio (1988), Stepping Out (1991), and ABC's adored and well received Pushing Daisies (2007). She played the role of the agoraphobic Vivian Charles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3OTQ5NDYyN15BMl5BanBnXkFtZTcwOTgzNjcwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0338746","name":"Ellen Greene","idIMDB":"nm0338746"},"actorId":"nm0338746","character":"Audrey","urlCharacter":"http://www.imdb.com/character/ch0029630","main":true},{"actorName":"Vincent Gardenia","urlProfile":"http://www.imdb.com/name/nm0306696","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMzMyODMyMV5BMl5BanBnXkFtZTcwNTIwMjYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1920","placeOfBirth":" Naples, Campania, Italy","birthName":"Vincenzo Scognamiglio","height":"5' 8½\" (1.74 m)","bio":"He was honored twice off-Broadway with Distinguished Performance OBIE Award, first in 1960 for \"Machinal\" and again in 1969 for \"Passing Through From Exotic Places.\" In 1972 he won a Tony Award for Best Featured Actor in a play for \"Prisoner on 2nd Avenue.\" In 1979 he was nominated for Best Actor in a musical for \"Ballroom.\" 1988 he was honored to be named the Grand Marshal of the Columbus Day Parade in New York City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMzMyODMyMV5BMl5BanBnXkFtZTcwNTIwMjYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0306696","name":"Vincent Gardenia","idIMDB":"nm0306696"},"actorId":"nm0306696","character":"Mushnik","urlCharacter":"http://www.imdb.com/character/ch0453461","main":true},{"actorName":"Steve Martin","urlProfile":"http://www.imdb.com/name/nm0000188","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY0ODYwNDM3OV5BMl5BanBnXkFtZTcwMTc3NjQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 August 1945","placeOfBirth":" Waco, Texas, USA","birthName":"Stephen Glenn Martin","height":"6' (1.83 m)","bio":"Steve Martin was born on August 14, 1945 in Waco, Texas, USA as Stephen Glenn Martin to Mary Lee (née Stewart; 1913-2002) and Glenn Vernon Martin (1914-1997), a real estate salesman and aspiring actor. He was raised in Inglewood and Garden Grove in California. In 1960, he got a job at the Magic shop of Disney's Fantasyland, and while there he learned magic, juggling, and creating balloon animals. At Santa Ana College, he took classes in drama and English poetry. He also took part in comedies and other productions at the Bird Cage Theatre, and joined a comedy troupe at Knott's Berry Farm. He attended California State University as a philosophy major, but in 1967 transferred to UCLA as a theatre major. His writing career began on The Smothers Brothers Comedy Hour (1967), winning him an Emmy Award. Between 1967 and 1973, he also wrote for many other shows, including The Glen Campbell Goodtime Hour (1969) and The Sonny and Cher Comedy Hour (1971). He also appeared on talk shows and comedy shows in the late 1960s and early 1970s. In 1972, he first appeared on The Tonight Show Starring Johnny Carson (1962), doing stand-up several times each year, and even guest hosting a few years later. In 1976, he served for the first time as guest-host on Saturday Night Live (1975). By 2016, he has guest-hosted 15 times, which is one less than Alec Baldwin's record, and also appeared 12 other times on SNL. In 1977, he released his first comedy album, a platinum selling \"Let's Get Small\". He followed it with \"A Wild and Crazy Guy\" (1978), which sold more than a million copies. Both albums went on to win Grammys for Best Comedy Recording. This is when he performed in arenas in front of tens of thousands of people, and begun his movie career, which was always his goal. His first major role was in the short film, The Absent-Minded Waiter (1977), which he also wrote. His star value was established in The Jerk (1979), which was co-written by Martin, and directed by Carl Reiner. The film earned more than $100 million on a $4 million budget. He also starred in Dead Men Don't Wear Plaid (1982), The Man with Two Brains (1983), and All of Me (1984), all directed by Reiner. To avoid being typecast as a comedian, he wanted do more dramatic roles, starring in Pennies from Heaven (1981), a film remake of Dennis Potter's 1978 series. Unfortunately, it was a financial failure. He also starred in John Landis's ¡Three Amigos! (1986), co-written by himself, opposite Martin Short and Chevy Chase. That year, he also appeared in the musical horror comedy, Little Shop of Horrors (1986) opposite Rick Moranis. Next year, he starred in Roxanne (1987), co-written by himself, and in John Hughes' Planes, Trains & Automobiles (1987), opposite John Candy. His other films include Parenthood (1989) and My Blue Heaven (1990), both opposite Moranis. In 1991, he wrote and starred in L.A. Story (1991), about a weatherman who searches meaning in his life and love in Los Angeles. It also starred his then-wife, Victoria Tennant. Same year, Father of the Bride (1991) was so successful that a 1995 sequel followed. During the 1990s, he continued to play more dramatic roles, in Grand Canyon (1991), playing a traumatized movie producer, in Leap of Faith (1992), playing a fake faith healer, in A Simple Twist of Fate (1994), playing a betrayed man adopting a baby, and in David Mamet's thriller The Spanish Prisoner (1997). Other, more comedic roles include in HouseSitter (1992) and The Out-of-Towners (1999), opposite Goldie Hawn, in Nora Ephron's Mixed Nuts (1994), and in Bowfinger (1999), written by himself and co-starring Eddie Murphy. After Bowfinger, he starred in Bringing Down the House (2003) and Cheaper by the Dozen (2003), both earning more than $130 million. He wrote and starred in Shopgirl (2005), and appeared in the sequel of Cheaper by the Dozen. After them, he appeared in The Pink Panther (2006) and The Pink Panther 2 (2009), which he both co-wrote, as Inspector Clouseau. He continues to do movies, more recently appearing in The Big Year (2011), Home (2015), and Love the Coopers (2015). Besides aforementioned, he has been an avid art collector since 1968, written plays, written for The New Yorker, written a well-received memoir (Born Standing Up), written a novel (An Object of Beauty; 2010), hosted the Academy Awards three times, released a Grammy award winning music album (The Crow: New Songs for the 5-String Banjo; 2009), and another album (Love Has Come For You; 2013) with Edie Brickell. Since 2007, he has been married to Anne Stringfield, with whom he has a daughter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY0ODYwNDM3OV5BMl5BanBnXkFtZTcwMTc3NjQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000188","name":"Steve Martin","idIMDB":"nm0000188"},"actorId":"nm0000188","character":"Orin Scrivello - D.D.S.","urlCharacter":"http://www.imdb.com/character/ch0459214","main":true},{"actorName":"Tichina Arnold","urlProfile":"http://www.imdb.com/name/nm0036651","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3MjM1NTg4OV5BMl5BanBnXkFtZTcwMDY3OTQ1OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1969","placeOfBirth":" Queens, New York, USA","birthName":"Tichina Rolanda Arnold","height":"5' 6\" (1.68 m)","bio":"Tichina Arnold was born on June 28, 1969 in Queens, New York, USA as Tichina Rolanda Arnold. She is an actress, known for Martin (1992), Everybody Hates Chris (2005) and Survivor's Remorse (2014). She has been married to Rico Hines since August 18, 2012. She was previously married to Lamon Brewster.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3MjM1NTg4OV5BMl5BanBnXkFtZTcwMDY3OTQ1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0036651","name":"Tichina Arnold","idIMDB":"nm0036651"},"actorId":"nm0036651","character":"Crystal","urlCharacter":"http://www.imdb.com/character/ch0086267","main":true},{"actorName":"Michelle Weeks","urlProfile":"http://www.imdb.com/name/nm0917344","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Michelle Weeks yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0917344","name":"Michelle Weeks","idIMDB":"nm0917344"},"actorId":"nm0917344","character":"Ronette","urlCharacter":"http://www.imdb.com/character/ch0081834","main":true},{"actorName":"Tisha Campbell-Martin","urlProfile":"http://www.imdb.com/name/nm0132896","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NjAwNTQzMF5BMl5BanBnXkFtZTcwNTU1MzQ2OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1968","placeOfBirth":" Oklahoma City, Oklahoma, USA","birthName":"Tisha Michelle Campbell","height":"5' 4½\" (1.64 m)","bio":"Tisha Campbell's first TV appearance was at the age of 8, on episode #006 of the PBS show The Big Blue Marble (1974). The show featured stories on the life and culture of children from around the world. In her segment, Tisha was shown playing with her brother, going to school with her mother who was also her voice coach, and singing at a jazz concert in New York's Greenwich Village.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NjAwNTQzMF5BMl5BanBnXkFtZTcwNTU1MzQ2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0132896","name":"Tisha Campbell-Martin","idIMDB":"nm0132896"},"actorId":"nm0132896","character":"Chiffon","urlCharacter":"http://www.imdb.com/character/ch0086266","main":true},{"actorName":"Jim Belushi","urlProfile":"http://www.imdb.com/name/nm0000902","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NzU1ODA5M15BMl5BanBnXkFtZTYwMTcxMjQz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 June 1954","placeOfBirth":" Chicago, Illinois, USA","birthName":"James Adam Belushi","height":"5' 11\" (1.8 m)","bio":"James Adam Belushi was born June 15, 1954, in Chicago, to Agnes Demetri (Samaras) and Adam Anastos Belushi, a restaurant owner. His father was an Albanian immigrant, from Qytezë, and his mother was also of Albanian descent. The third of four children - his brother was John Belushi - he grew up in Wheaton, Illinois. A high school teacher, impressed by his improvisational skills while giving speeches, convinced him to to be in a school play. After that, he joined the school's drama club. Today, if asked why he got involved in acting, he will jokingly say, \"Because of girls. In the drama club, there were about 20 girls and six guys. And the same thing with choir - more girls!\". He attended the College of DuPage and Southern Illinois University, where he graduated with a degree in Speech and Theater Arts. In 1977, he joined Chicago's Second City improv troupe and remained for three years. In 1979, Garry Marshall saw Jim performing for Second City and arranged for him to come to Hollywood and co-star in the TV pilot Who's Watching the Kids (1978) for Paramount and, then, for a role in the series Working Stiffs (1979) (co-starring Michael Keaton). Later, in 1983, he joined the cast of Saturday Night Live (1975) for two years. Jim came to national attention in About Last Night... (1986), playing the role he originated in the Chicago Apollo Theatre's production of David Mamet's Obie-award winning play \"Sexual Perversity in Chicago\". He resides in Los Angeles with his wife Jennifer Sloan, their daughter Jamison and a son, Robert Belushi, from Belushi's first marriage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NzU1ODA5M15BMl5BanBnXkFtZTYwMTcxMjQz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000902","name":"Jim Belushi","nicknames":["Jim"],"idIMDB":"nm0000902"},"actorId":"nm0000902","character":"Patrick Martin","urlCharacter":"http://www.imdb.com/character/ch0114903","main":true},{"actorName":"John Candy","urlProfile":"http://www.imdb.com/name/nm0001006","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQ3MzQzODUxMF5BMl5BanBnXkFtZTcwMjY5MTkyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1950","placeOfBirth":" Toronto, Ontario, Canada","birthName":"John Franklin Candy","height":"6' 2\" (1.88 m)","bio":"Candy was one of Canada's greatest and funniest character actors. His well-known role as the big hearted buffoon earned him classics in Uncle Buck (1989) and Planes, Trains & Automobiles (1987). His career has handed him some dry spells but Candy always rebounded. Born in Newmarket, Ontario, in the year 1950, Candy was the son of Evangeline (Aker) and Sidney James Candy. His mother was of Ukrainian and Polish ancestry. Candy found his passion for drama while attending a community college. In 1971 Candy made his TV debut in an episode of Police Surgeon (1971) co-starring Sharon Farrell, John Hamelin, and Nick Mancuso. Candy then found a number of bit parts in other Canadian television shows and also in such small films as Tunnel Vision (1976) and Find the Lady (1976). However, his big success came at the age of twenty-seven, when he became part of the comedy group \"Second City\" in Toronto. Alongside such soon-to-be Canadian stars as Catherine O'Hara (one of Candy's lifelong friends), Eugene Levy, Rick Moranis, and Harold Ramis, Candy was also part of the television show the group inspired. SCTV (1976) earned Candy a reputation for his quirky humor and his uncanny imitations of others. After the television series, Candy appeared alongside fellow Canadian Dan Aykroyd in the Steven Spielberg flop 1941 (1979). However, other jobs followed and Candy landed a role, once again with Aykroyd, in the successful classic The Blues Brothers (1980). Candy played a parole officer who is part of the chase after Jake and Elwood Blues. The film was a hit and Candy followed up accordingly. Candy acted in the smash hit Stripes (1981) where he played a dopey, overweight recruit affectionately nicknamed 'Ox'. After the success of Stripes (1981), Candy returned to the Second City with the other former stars, in SCTV Network (1981). Candy also hosted \"Saturday Night Live\" before landing himself a role in the Ron Howard film Splash (1984), a romantic comedy about a mermaid who washes ashore and learns to live like a human. Candy played a sleazy womanizing brother to the character played by Tom Hanks. The film was a bigger success than even Stripes (1981) and a number of people have said that Splash (1984) was his breakout role. He took a second billing in the comedic film Brewster's Millions (1985) where a man must spend thirty million in order to inherit three hundred million from his deceased relative. Candy played the man's best friend, who accidentally gets in the way as much as helping out. Candy continued making films tirelessly, including the film Armed and Dangerous (1986) where he and Eugene Levy play characters who become security guards. 1987 was an especially good year to Candy, giving him two classic roles: Barf the Mawg in the Mel Brooks comedy Spaceballs (1987) and the bumbling salesman Del Griffith alongside Steve Martin's uptight character in the John Hughes film Planes, Trains & Automobiles (1987). The latter film is a golden classic and is one of Candy's greatest films. He followed up immediately with The Great Outdoors (1988), once again alongside Dan Aykroyd. Candy landed another classic role in the film Uncle Buck (1989) which was about a bumbling uncle who must look after his brother's three children. Although he was in the smash hit Home Alone (1990), Candy's career fell into a slump, turning out unsuccessful films in the early nineties. This caused him to change his strategy by taking more serious roles. The first of these serious roles was the corrupt lawyer Dean Andrews in the 'Oliver Stone' film JFK (1991). The film was a big success, and Candy moved on from this victory to make the film Cool Runnings (1993) about the first Jamaican bobsled team. Candy was well known for his size, six feet two and weighing around 300 pounds. However, he was very sensitive about the subject and in the nineties tried to lose weight and quit smoking. He was aware that heart attacks were in his family: both his father and his grandfather died of heart attacks and Candy wanted to prevent that happening to him as best he could. In the mid-nineties Candy filmed the Michael Moore comedy Canadian Bacon (1995) then went to Mexico to film the western spoof Wagons East (1994). It was in Mexico that Candy had a heart attack and passed away in March 1994. Canadian Bacon (1995) was released a year after his death and is his last film. Candy was loved by thousands of people who loved his classic antics in Splash (1984) and The Great Outdoors (1988). He was well-known for his roles in Stripes (1981) and Uncle Buck (1989) and he himself never forgot his Canadian background.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQ3MzQzODUxMF5BMl5BanBnXkFtZTcwMjY5MTkyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001006","name":"John Candy","idIMDB":"nm0001006"},"actorId":"nm0001006","character":"Wink Wilkinson","urlCharacter":"http://www.imdb.com/character/ch0114905","main":true},{"actorName":"Christopher Guest","urlProfile":"http://www.imdb.com/name/nm0001302","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzU2MjMzMV5BMl5BanBnXkFtZTYwMzQwMDMz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1948","placeOfBirth":" New York City, New York, USA","birthName":"Christopher Haden-Guest","height":"5' 11\" (1.8 m)","bio":"U.S.-born actor, director, writer, musician, and composer best known for his mockumentaries, poking fun at heavy metal music, small town theatre, dog shows, folk music and film-making itself, Christopher Haden-Guest was born February fifth, 1948, in New York City. His mother, Jean Pauline (Hindes), was a vice president of casting at CBS. His father, Peter Haden-Guest, was a UN diplomat who was a member of the British House of Lords, and was the fourth Baron of Saling in the County of Essex. Christopher's mother, who was American, was the daughter of Russian Jewish immigrants. Christopher's father, who was British, had English and Dutch-Jewish ancestry. Christopher's paternal great-grandfather, Colonel Albert Goldsmid, was a British officer. He received his dramatic arts training at New York City's High School of Arts and Music and at Bard College, and Guest first appeared in minor film roles in a mixture of film genres including The Hot Rock (1972), Death Wish (1974), Lemmings (1973), and The Long Riders (1980). However, he was also dabbling in writing for several T.V. shows, and when filming Million Dollar Infield (1982), Guest became acquainted with writer-director Rob Reiner and the two collaborated, along with Michael McKean and Harry Shearer, to pen the script and music for the sleeper hit This Is Spinal Tap (1984). The mockumentary also starred Guest as dizzy lead guitarist Nigel Tufnel, whose most famous line is surely, \"These go to eleven,\" when referring to the volume settings on the band's rather unique Marshall amplifiers! Guest then busied himself for several years in the 1980's as a regular performer on Saturday Night Live (1975) and, along with fellow Spinal Tap band members lead singer David St. Hubbins, aka Michael McKean; and bassist Derek Smalls, aka Harry Shearer, they regularly appeared as Spinal Tap. In 1992, they released Spinal Tap: Break Like the Wind - The Videos (1992), plus A Spinal Tap Reunion: The 25th Anniversary London Sell-Out (1992). Guest had a minor acting role in the courtroom drama of A Few Good Men (1992), before returning to poke fun at wannabe actors in the howlingly funny Waiting for Guffman (1996) with Guest taking center stage as high-strung choreographer Corky St. Clair. He made a return to heavy metal with Spinal Tap: The Final Tour (1998) and Catching Up with Marty DiBergi (2000) before turning his comedic pen to the world of championship dog shows for the sensational comedy Best in Show (2000). The latest mockumentary from Guest and co-writer-actor Eugene Levy was again met with critical praise, and movie fans just loved it, too! In 2003, Guest and Eugene Levy took aim at the folk-music world, and successfully collaborated to write the comedy A Mighty Wind (2003) about the reunion of the Folksmen, a fictional 1960s folk music group. Guest is married to well-known actress Jamie Lee Curtis with two children, Annie Guest and Thomas, plus he is the brother of actor Nicholas Guest.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzU2MjMzMV5BMl5BanBnXkFtZTYwMzQwMDMz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001302","name":"Christopher Guest","idIMDB":"nm0001302"},"actorId":"nm0001302","character":"The First Customer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Murray","urlProfile":"http://www.imdb.com/name/nm0000195","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1OTM0MjEwOF5BMl5BanBnXkFtZTYwNTQwNzI1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 September 1950","placeOfBirth":" Wilmette, Illinois, USA","birthName":"William James Murray","height":"6' 2\" (1.88 m)","bio":"Bill Murray is an American actor, comedian, and writer. The fifth of nine children, he was born William James Murray in Wilmette, Illinois, to Lucille (Collins), a mailroom clerk, and Edward Joseph Murray II, who sold lumber. He is of Irish descent. Among his siblings are actors Brian Doyle-Murray, Joel Murray, and John Murray. He and most of his siblings worked as caddies, which paid his tuition to Loyola Academy, a Jesuit school. He played sports and did some acting while in that school, but in his words, mostly \"screwed off.\" He enrolled at Regis College in Denver to study pre-med but dropped out after being arrested for marijuana possession. He then joined the National Lampoon Radio Hour with fellow members Dan Aykroyd, Gilda Radner, and John Belushi. However, while those three became the original members of Saturday Night Live (1975), he joined Saturday Night Live with Howard Cosell (1975), which premiered that same year. After that show failed, he later got the opportunity to join Saturday Night Live (1975), for which he earned his first Emmy Award for Outstanding Writing in a Comedy-Variety or Music Series. He later went on to star in comedy films, including Arrête de ramer, t'es sur le sable (1979), Caddyshack (1980), Stripes (1981), Tootsie (1982), Ghostbusters (1984), Ghostbusters II (1989), Scrooged (1988), What About Bob? (1991), and Groundhog Day (1993). He also co-directed Quick Change (1990). Murray garnered additional critical acclaim later in his career, starring in Lost in Translation (2003), which earned him a Golden Globe and a BAFTA Award for Best Actor, as well as an Academy Award nomination for Best Actor. He also received Golden Globe nominations for his roles in Ghostbusters, Rushmore (1998), Hyde Park on Hudson (2012), St. Vincent (2014), and the HBO miniseries Olive Kitteridge (2014), for which he later won his second Primetime Emmy Award for Outstanding Supporting Actor in a Limited Series or a Movie.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1OTM0MjEwOF5BMl5BanBnXkFtZTYwNTQwNzI1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000195","name":"Bill Murray","nicknames":["Billy","The Murricane"],"idIMDB":"nm0000195"},"actorId":"nm0000195","character":"Arthur Denton","urlCharacter":"http://www.imdb.com/character/ch0029135","main":true},{"actorName":"Stan Jones","urlProfile":"http://www.imdb.com/name/nm0428089","urlPhoto":"","biography":{"dateOfBirth":"23 October 1926","placeOfBirth":" Canada","birthName":"Gordon Stanley Jones","bio":"Stan Jones was born on October 23, 1926 in Canada as Gordon Stanley Jones. He was an actor, known for Little Shop of Horrors (1986), The Transformers: The Movie (1986) and The Pebble and the Penguin (1995). He died on December 30, 1998 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0428089","name":"Stan Jones","idIMDB":"nm0428089"},"actorId":"nm0428089","character":"Narrator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bertice Reading","urlProfile":"http://www.imdb.com/name/nm0713931","urlPhoto":"","biography":{"dateOfBirth":"22 July 1933","placeOfBirth":" Chester, Pennsylvania, USA","bio":"Bertice Reading was born on July 22, 1933 in Chester, Pennsylvania, USA. She was an actress, known for Little Shop of Horrors (1986), The Moon in the Gutter (1983) and Nur Musik... (1963). She died on June 8, 1991 in London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0713931","name":"Bertice Reading","idIMDB":"nm0713931"},"actorId":"nm0713931","character":"'Downtown' Old Woman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ed Wiley","urlProfile":"http://www.imdb.com/name/nm0928829","urlPhoto":"","biography":{"bio":"Ed Wiley is an actor, known for Little Shop of Horrors (1986), Cross of Fire (1989) and Lace II (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0928829","name":"Ed Wiley","idIMDB":"nm0928829"},"actorId":"nm0928829","character":"'Downtown' Bum #1","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0091419","urlIMDB":"http://www.imdb.com/title/tt0091419","business":{"budget":{"money":"$25,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$3,659,884","country":"USA","day":"21","month":"12","year":"1986","remarks":"866 Screens"}],"gross":[{"money":"$34,656,704","country":"USA","day":"08","month":"02","year":"1987","remarks":""},{"money":"$33,126,503","country":"USA","day":"01","month":"02","year":"1987","remarks":""},{"money":"$30,810,276","country":"USA","day":"25","month":"01","year":"1987","remarks":""},{"money":"$27,781,027","country":"USA","day":"18","month":"01","year":"1987","remarks":""},{"money":"$23,727,232","country":"USA","day":"11","month":"01","year":"1987","remarks":""},{"money":"$19,546,049","country":"USA","day":"04","month":"01","year":"1987","remarks":""},{"money":"$11,412,248","country":"USA","day":"28","month":"12","year":"1986","remarks":""},{"money":"$3,659,884","country":"USA","day":"21","month":"12","year":"1986","remarks":""},{"money":"SEK","country":"4,318,255","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":[{"money":"$1,112,016","country":"USA","day":"08","month":"02","year":"1987","remarks":"871 Screens"},{"money":"$1,719,329","country":"USA","day":"01","month":"02","year":"1987","remarks":""},{"money":"$2,093,847","country":"USA","day":"25","month":"01","year":"1987","remarks":""},{"money":"$3,222,066","country":"USA","day":"18","month":"01","year":"1987","remarks":""},{"money":"$3,057,666","country":"USA","day":"11","month":"01","year":"1987","remarks":"858 Screens"},{"money":"$4,004,838","country":"USA","day":"04","month":"01","year":"1987","remarks":"866 Screens"},{"money":"$5,042,682","country":"USA","day":"28","month":"12","year":"1986","remarks":"866 Screens"},{"money":"$3,659,884","country":"USA","day":"21","month":"12","year":"1986","remarks":"866 Screens"}],"admissions":[],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"21","month":"10","year":"1985","remarks":null},{"money":null,"country":null,"day":"05","month":"06","year":"1986","remarks":null}],"copyrightHolder":"This motion picture © 1986 The Geffen Film Company"},"technical":{"runtime":["1 hr 34 min (94 min)","1 hr 42 min (102 min) (original)"],"soundMix":["70 mm 6-Track (70 mm prints)","Dolby Stereo (35 mm prints)"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Lenses and Panaflex Camera by Panavision"],"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["16 mm","70 mm (blow-up)","Super 8 (Airline print with optical sound)","35 mm"]},"rating":"6.9","metascore":"81","filmingLocations":[{"location":"Albert R. Broccoli 007 Stage, Pinewood Studios, Iver Heath, Buckinghamshire, England, UK"}],"rated":"PG-13","awards":[{"award":"Academy Awards, USA 1987","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Effects, Visual Effects","names":[{"name":"Lyle Conway","id":"nm0176732","role":null},{"name":"Bran Ferren","id":"nm0274512","role":null},{"name":"Martin Gutteridge","id":"nm0349707","role":null}]},{"category":"Best Music, Original Song","names":[{"name":"Alan Menken","id":"nm0579678","role":"music"},{"name":"Howard Ashman","id":"nm0039141","role":"lyrics"}]}]}]},{"award":"Golden Globes, USA 1987","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Motion Picture - Comedy or Musical","names":[]},{"category":"Best Original Score - Motion Picture","names":[{"name":"Miles Goodman","id":"nm0006108","role":null}]}]}]},{"award":"BAFTA Awards 1988","titlesAwards":[{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best Special Effects","names":[{"name":"Bran Ferren","id":"nm0274512","role":null},{"name":"Martin Gutteridge","id":"nm0349707","role":null},{"name":"Lyle Conway","id":"nm0176732","role":null},{"name":"Richard Conway","id":"nm0176763","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2013","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best DVD/Blu-Ray Special Edition Release","names":[]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1987","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best Music","names":[{"name":"Alan Menken","id":"nm0579678","role":null}]}]},{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Horror Film","names":[]},{"category":"Best Writing","names":[{"name":"Howard Ashman","id":"nm0039141","role":null}]},{"category":"Best Costumes","names":[{"name":"Marit Allen","id":"nm0020801","role":null}]},{"category":"Best Special Effects","names":[{"name":"Lyle Conway","id":"nm0176732","role":null}]}]}]},{"award":"American Comedy Awards, USA 1987","titlesAwards":[{"titleAwardOutcome":"Nominated American Comedy Award","categories":[{"category":"Funniest Actor in a Motion Picture (Leading Role)","names":[{"name":"Steve Martin","id":"nm0000188","role":null}]},{"category":"Funniest Actress in a Motion Picture (Leading Role)","names":[{"name":"Ellen Greene","id":"nm0338746","role":null}]}]}]},{"award":"Casting Society of America, USA 1987","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Best Casting for Feature Film, Comedy","names":[{"name":"Margery Simkin","id":"nm0799557","role":null}]}]}]},{"award":"Hugo Awards 1987","titlesAwards":[{"titleAwardOutcome":"Nominated Hugo","categories":[{"category":"Best Dramatic Presentation","names":[{"name":"Frank Oz","id":"nm0000568","role":"director"},{"name":"Howard Ashman","id":"nm0039141","role":"screenplay"},{"name":"Charles B. Griffith","id":"nm0341458","role":"based on the 1960 screenplay"}]}]}]},{"award":"Writers Guild of America, USA 1987","titlesAwards":[{"titleAwardOutcome":"Nominated WGA Award (Screen)","categories":[{"category":"Best Screenplay Based on Material from Another Medium","names":[{"name":"Howard Ashman","id":"nm0039141","role":null}]}]}]}],"votes":"51,788","type":"Movie","companyCreditsSimple":[{"idCompany":"co0072496","name":"Geffen Company, The"}],"keywords":{"keywords":["plant","florist","shop","eclipse","nerd","blood","flower","orphan","skid row","crush","assistant","success","dentist","speaking plant","attacked by a plant","dental headgear","dental braces","camera shot from inside mouth","boy with glasses","man with glasses","plant food","masochist","domestic violence","abusive boyfriend","sadistic doctor","based on stage musical","based on stage musical based on film","spinning newspaper","carnivorous plant","remade","inept assistant","horror movie remake","horror movie remade","based on film","solar eclipse","snitch","shrine","motorcycle","laughing gas","gutter","downtown","bum","blood drinking","blonde","horror spoof","greek chorus","flesh eating plant","monster plant","unrequited love","monster","man eaten","love","jealousy","investigation","flesh eating","fame","alien","negative asian stereotype","remake","cult film","homosexual subtext","homoeroticism","man eating plant","giant plant","planetary alignment","dismemberment","murder","puppet","black comedy","sadism","1960s","killer plant","masochism","new york","part animation","nitrous oxide","sadist","based on play","independent film","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:52:41"}}