{"data":{"movies":[{"title":"Angels with Dirty Faces","originalTitle":"","year":"1938","releaseDate":"19381126","directors":[{"name":"Michael Curtiz","id":"nm0002031"}],"writers":[{"name":"John Wexley","id":"nm0923333"},{"name":"Warren Duff","id":"nm0240417"}],"runtime":"97 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2JhZmJmOTQtMjg5Ni00N2M4LTlkNDAtOTc0ZGQ2MTJhNDM4XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama","Film-Noir","Thriller"],"plot":"Two boyhood friends, Rocky Sullivan and Jerry Connolly have taken different paths in life. After Rocky is arrested he is sent to a juvenile facility and becomes a lifelong tough guy and criminal. Jerry on the other hand goes straight and becomes a Catholic priest ministering to people in the same neighborhood when he and Rocky grew up. When Rocky is released from prison he resumes his criminal lifestyle and becomes much admired by many of the local kids. Worried that the kids will follow Rocky into the criminal world, Jerry works hard to keep them on the straight and narrow. When Rocky is convicted and sentenced to the electric chair, Jerry asks him for one last favor.","simplePlot":"A priest tries to stop a gangster from corrupting a group of street kids.","actors":[{"actorName":"James Cagney","urlProfile":"http://www.imdb.com/name/nm0000010","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNDY5NTgxNV5BMl5BanBnXkFtZTYwNzY4MzQ2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 July 1899","placeOfBirth":" New York City, New York, USA","birthName":"James Francis Cagney","height":"5' 6½\" (1.69 m)","bio":"One of Hollywood's preeminent male stars of all time (eclipsed, perhaps, only by \"King\" Clark Gable and arguably by Gary Cooper or Spencer Tracy), and the cinema's quintessential \"tough guy\", James Cagney was also an accomplished--if rather stiff--hoofer and easily played light comedy. James Francis Cagney was born on the Lower East Side of Manhattan in New York City, to Carolyn (Nelson) and James Francis Cagney, Sr., who was a bartender and amateur boxer. Cagney was of Norwegian (from his maternal grandfather) and Irish descent. Ending three decades on the screen, he retired to his farm in Stanfordville, New York (some 77 miles/124 km. north of his New York City birthplace), after starring in Billy Wilder's One, Two, Three (1961). He emerged from retirement to star in the 1981 screen adaptation of E.L. Doctorow's novel \"Ragtime\" (Ragtime (1981)), in which he was reunited with his frequent co-star of the 1930s, Pat O'Brien, and which was his last theatrical film and O'Brien's as well). Cagney's final performance came in the title role of the made-for-TV movie Terrible Joe Moran (1984), in which he played opposite Art Carney.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNDY5NTgxNV5BMl5BanBnXkFtZTYwNzY4MzQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000010","name":"James Cagney","nicknames":["The Professional Againster","Jimmy"],"idIMDB":"nm0000010"},"actorId":"nm0000010","character":"Rocky Sullivan","urlCharacter":"http://www.imdb.com/character/ch0018494","main":true},{"actorName":"Pat O'Brien","urlProfile":"http://www.imdb.com/name/nm0002285","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjc0NzQ2Ml5BMl5BanBnXkFtZTcwMzY0MDAxMw@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 November 1899","placeOfBirth":" Milwaukee, Wisconsin, USA","birthName":"William Joseph Patrick O'Brien","height":"5' 11\" (1.8 m)","bio":"Although he came to be called \"Hollywood's Irishman in Residence\"--and, along with good friends James Cagney, Allen Jenkins, Frank McHugh and a few others were called \"The Irish Mafia\"--and he often played Irish immigrants, Pat O'Brien was US-born and -bred. As a young boy the devoutly Roman Catholic O'Brien considered entering the seminary to study for the priesthood, but although he often played a Father, Monsignor or Bishop, he never actually followed through and entered the seminary. And although never a policeman, in movies he often wore the cop's badge and, although in real life he had no discernible Irish accent, he could pour on the \"brogue\" when the role called for it. Pat O'Brien excelled in roles as beneficent men but could also give convincing performances as wise guys or con artists. He was a most popular film star during the 1930s and 1940s. Over almost five decades, he co-starred in nine films with Cagney, including his own screen swansong, Ragtime (1981).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjc0NzQ2Ml5BMl5BanBnXkFtZTcwMzY0MDAxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002285","name":"Pat O'Brien","idIMDB":"nm0002285"},"actorId":"nm0002285","character":"Jerry Connolly","urlCharacter":"http://www.imdb.com/character/ch0182421","main":true},{"actorName":"Humphrey Bogart","urlProfile":"http://www.imdb.com/name/nm0000007","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyOTE3MDM5Ml5BMl5BanBnXkFtZTYwMzA2MTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1899","placeOfBirth":" New York City, New York, USA","birthName":"Humphrey DeForest Bogart","height":"5' 8\" (1.73 m)","bio":"Humphrey DeForest Bogart was born in New York City, New York, to Maud Humphrey, a famed magazine illustrator and suffragette, and Belmont DeForest Bogart, a moderately wealthy surgeon (who was secretly addicted to opium). Bogart was educated at Trinity School, NYC, and was sent to Phillips Academy in Andover, Massachusetts, in preparation for medical studies at Yale. He was expelled from Phillips and joined the U.S. Naval Reserve. From 1920 to 1922, he managed a stage company owned by family friend William A. Brady (the father of actress Alice Brady), performing a variety of tasks at Brady's film studio in New York. He then began regular stage performances. Alexander Woollcott described his acting in a 1922 play as inadequate. In 1930, he gained a contract with Fox, his feature film debut in a ten-minute short, Broadway's Like That (1930), co-starring Ruth Etting and Joan Blondell. Fox released him after two years. After five years of stage and minor film roles, he had his breakthrough role in The Petrified Forest (1936) from Warner Bros. He won the part over Edward G. Robinson only after the star, Leslie Howard, threatened Warner Bros. that he would quit unless Bogart was given the key role of Duke Mantee, which he had played in the Broadway production with Howard. The film was a major success and led to a long-term contract with Warner Bros. From 1936 to 1940, Bogart appeared in 28 films, usually as a gangster, twice in Westerns and even a horror film. His landmark year was 1941 (often capitalizing on parts George Raft had stupidly rejected) with roles in classics such as High Sierra (1941) and as Sam Spade in one of his most fondly remembered films, The Maltese Falcon (1941). These were followed by Casablanca (1942), The Big Sleep (1946), and Key Largo (1948). Bogart, despite his erratic education, was incredibly well-read and he favored writers and intellectuals within his small circle of friends. In 1947, he joined wife Lauren Bacall and other actors protesting the House Un-American Activities Committee witch hunts. He also formed his own production company, and the next year made The Treasure of the Sierra Madre (1948). Bogie won the best actor Academy Award for The African Queen (1951) and was nominated for Casablanca (1942) and as Captain Queeg in The Caine Mutiny (1954), a film made when he was already seriously ill. He died in his sleep at his Hollywood home following surgeries and a battle with throat cancer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyOTE3MDM5Ml5BMl5BanBnXkFtZTYwMzA2MTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000007","name":"Humphrey Bogart","nicknames":["Bogie"],"idIMDB":"nm0000007"},"actorId":"nm0000007","character":"James Frazier","urlCharacter":"http://www.imdb.com/character/ch0182422","main":true},{"actorName":"Ann Sheridan","urlProfile":"http://www.imdb.com/name/nm0792130","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDkwODM0NV5BMl5BanBnXkFtZTYwNzYyNDQ2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 February 1915","placeOfBirth":" Denton, Texas, USA","birthName":"Clara Lou Sheridan","height":"5' 5½\" (1.66 m)","bio":"Ann Sheridan won the \"Search for Beauty\" contest which carried with it a Paramount screen test. Signed to a contract at 18, she was put into a number of small roles under her real name of Clara Lou Sheridan. As she got better, her name was changed to Ann. In 1936, after two dozen films, she went to Warner Brothers, which billed her as the \"Oomph Girl,\" a name she despised -- although she certainly looked the part. She was allowed to mature into a leading star who could be the girl next door or the tough-as-nails dame. She was in a lot of comedies and a number of forgettable movies, but the public liked her, and her career flourished. She also gave great performances such as the singer in Torrid Zone (1940) and the waitress in They Drive by Night (1940). In 1948, she was dropped by Warner Bros., but came back in Howard Hawks' comedy I Was a Male War Bride (1949) with Cary Grant. She continued to make films into the 1950s but retired before the end of the decade. She starred in the soap opera Another World (1964) and the western series Pistols 'n' Petticoats (1966). Unfortunately, just as her career was reviving with this series, she died of cancer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDkwODM0NV5BMl5BanBnXkFtZTYwNzYyNDQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0792130","name":"Ann Sheridan","nicknames":["The \"Oomph\" Girl"],"idIMDB":"nm0792130"},"actorId":"nm0792130","character":"Laury Martin","urlCharacter":"http://www.imdb.com/character/ch0018497","main":true},{"actorName":"George Bancroft","urlProfile":"http://www.imdb.com/name/nm0051628","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMTAyNTA2N15BMl5BanBnXkFtZTgwMjUzMjE1MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1882","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"6' 2\" (1.88 m)","bio":"George Bancroft was raised in Philadelphia and attended high school at Tomes Institute (Philadelphia). He won an impressive appointment to the United States Naval Academy at Annapolis and graduated as a commissioned officer. He served in the Navy for the prescribed period of required service but no more. He decided to turn to show business, first as a theater manager. He worked in the old and fading minstrel show variety format into the 1920s but then decided to try his hand at acting. By 1923, he was good enough for Broadway and spent about a year there doing two plays. But he was already good enough for some early camera work for by 1921, so he had made his first appearance in the silent movie medium. Being a big man with dark features, he was a natural for heavies. And it seemed that early Westerns were an easy fit as well after his first four films. Through 1924 and into 1925, he did four, culminating with pay dirt in his appealing performance as rogue Jack Slade in the James Cruze Western The Pony Express (1925). With him was another up-and-coming character actor, Wallace Beery. Bancroft's acting made Paramount Pictures take a look at him as star material. His roles as tough guy took on more flesh into the later 1920s, especially in association with director Josef von Sternberg and his well-honed gangster films that started with Underworld (1927). Their work culminated with Sternberg's Thunderbolt (1929) for which Bancroft received an Oscar nomination. He was tops at the box office. Bancroft's various on-screen personas as bigger-than-life strong man was not far from his off-screen character as Hollywood notability got to him. It was recalled that he became more difficult to deal with as his ego grew. At one point, he refused to obey a director's order that he fall down after being shot by the villain. Bancroft declared, \"One bullet can't kill Bancroft!\" Although he stayed busy through the 1930s, he was older and stouter -- the stuff of featured characters. And Bancroft was also getting a lot of competition from younger character actors. In the early '30s, his roles continued to typecast him as lead heavies, but increasingly, he was cast as second tier -- if with more variety -- in later roles. He was paper editor MacWade in Mr. Deeds Goes to Town (1936); a doctor in A Doctor's Diary (1937); a few sea captains along the way; and most memorably Marshal Curly Wilcox in the John Ford Western (his first with sound) Stagecoach (1939). Here he is particularly engaging tough lawman but with a big heart. Into the 1940s, he only did a handful of films. But he again had a rogue's spotlight with another name director -- Cecil B. DeMille -- in one of his always epic yarns. This time it was a Texas Ranger chasing a murderer over the Canadian border in North West Mounted Police (1940) with a stellar cast including Gary Cooper, everybody's favorite blond Madeleine Carroll, and Paulette Goddard as fleeing criminal, Jacques Corbeau's (Bancroft) daughter. By 1942, Bancroft had decided to move on, retiring with the intention of becoming a Southern California rancher. He quietly assumed this new role for a long run of 14 years before his passing.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMTAyNTA2N15BMl5BanBnXkFtZTgwMjUzMjE1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0051628","name":"George Bancroft","idIMDB":"nm0051628"},"actorId":"nm0051628","character":"Mac Keefer","urlCharacter":"http://www.imdb.com/character/ch0507332","main":true},{"actorName":"The 'Dead End' Kids","urlProfile":"http://www.imdb.com/name/nm5369479","urlPhoto":"","biography":{"bio":"The 'Dead End' Kids is an actor, known for Angels with Dirty Faces (1938), They Made Me a Criminal (1939) and Crime School (1938).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5369479","name":"The 'Dead End' Kids","idIMDB":"nm5369479"},"actorId":"nm5369479","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Billy Halop","urlProfile":"http://www.imdb.com/name/nm0356890","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWJhYWY5NjMtMmZmOC00YTlkLTg5NDQtODM4MWRjOGNhZGE3L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 February 1920","placeOfBirth":" New York City, New York, USA","birthName":"William Halop","bio":"Billy Halop's show business career started on radio in the 1920s and carried over to stage work on Broadway. There, in 1937, he and other teenage cast members of the stage hit \"Dead End\" were brought to Hollywood by Samuel Goldwyn for the film version of the play, which was a tremendous hit. Halop and some of the other teenage cast members went on to do a series of films at Universal as the Dead End Kids/Little Tough Guys while some of the others worked at Monogram in a series as the East Side Kids. Halop left the group in the early 1940s to seek a career on his own, but could only land parts in B pictures. His career was also hampered by a long string of marital and financial problems and a lifelong struggle against alcoholism. Toward the end of his career, he had a recurring role as Munson, the owner of the cab company where Archie Bunker worked part time, in All in the Family (1971). His last years were spent making a living as a male nurse.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWJhYWY5NjMtMmZmOC00YTlkLTg5NDQtODM4MWRjOGNhZGE3L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0356890","name":"Billy Halop","idIMDB":"nm0356890"},"actorId":"nm0356890","character":"Soapy","urlCharacter":"http://www.imdb.com/character/ch0018504","main":true},{"actorName":"Bobby Jordan","urlProfile":"http://www.imdb.com/name/nm0429853","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTYxZGExMTQtYmZlMy00NzcyLTk3NmQtZDQ0MTczOWUwOGY3XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 April 1923","placeOfBirth":" Harrison, New York, USA","bio":"Bobby was raised in Flatbush, Brooklyn. By the time he was four and a half, he could act, tap dance and play the Saxophone. He made his stage debut in 1930 and film debut at Warner Bros./Vitaphone in 1931. He also reportedly had a bit part in the 1934 Eddie Cantor film, \"Kid Millions\". He then appeared on Broadway in \"Dead End\", which opened on October 28, 1935. He left the show in mid-November 1936 to appear in the The Samuel Goldwyn Company film version of \"Dead End\". Warner Brothers studios signed the all of the Dead End Kids to contracts. At the peak of his career, Bobby made $1,500 a week, owned a $150,000 home in Beverly Hills and was the sole support of his mother, two brothers a sister and a niece. In 1940, Bobby returned to Universal to appear with several other Dead End Kids in The Little Tough Guys series. Later the same year, Monogram featured him in his first East Side Kids film, \"Boys of the City\". In 1943, Bobby was drafted. He served as a foot soldier in the 97th Infantry until 1945 with his only film appearance being the East Side Kid's \"Bowery Champs\" (1944), playing himself in a running gag. In 1946, Bobby appeared in the first Bowery Boys picture, \"Live Wires\". But, after eight films he left because he was forced to take a backseat to Leo Gorcey and Huntz Hall. In March of that year, he married Lee, and in 1949, they had a son, Robert Jr. Bobby worked sporadically in film and television afterwards. He tried a nightclub act, then he found additional work as a bartender, door-to-door photograph salesperson and he later worked as an oil driller in Coalinga. In 1957, he and Lee divorced, and in 1958, he declared bankruptcy when he failed to pay alimony and child support. On August 25, 1965, Bobby collapsed at the home of a friend he had been living with. Already a heavy drinker, he was admitted to a Veterans Administration Hospital in Los Angeles for treatment for Cirrhosis of the liver.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTYxZGExMTQtYmZlMy00NzcyLTk3NmQtZDQ0MTczOWUwOGY3XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0429853","name":"Bobby Jordan","idIMDB":"nm0429853"},"actorId":"nm0429853","character":"Swing","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leo Gorcey","urlProfile":"http://www.imdb.com/name/nm0329832","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2E2ZjdkODgtNzEyOC00ZWMyLWFkOTktY2JiNjUyNmYyMjM2L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 June 1917","placeOfBirth":" New York City, New York, USA","birthName":"Leo Bernard Gorcey","height":"5' 6\" (1.68 m)","bio":"Leo Gorcey's parents were actor Bernard Gorcey (born 1888) who stood 4' 10\", and Josephine Condon (born 1901), who stood 4' 11\" and weighed 95 pounds; they worked in vaudeville in New York. In 1915, 14-year-old Josephine gave birth to Fred. In 1917, Leo was born, a large baby at 12 lb. 3 oz.; as an adult he would be 5' 6\". In 1921 his brother David Gorcey was born. In 1935, Leo and David appeared in the stage play \"Dead End.\" In 1937, this was made into a movie, and Leo became one of the busiest actors for the next 20 years -- from 1937-1939 he starred in seven Dead End Kids movies, from 1940-1945 in 21 East Side Kids films, from 1946-1956 in 41 Bowery Boys movies. In 1939, Leo married 17-year-old dancer Kay Marvis, who appeared in four of his movies. They divorced in 1944 after five years of marriage; she went on to marry Groucho Marx. In 1945, Leo married Evalene Bankston; they divorced in 1948. Leo was to have paid her $50,000 in a divorce settlement; however, when two detectives she hired broke into his home, he retaliated by firing his gun at them. They sued, and Leo countersued for illegal entry and won $35,000 back. In 1949, Leo married Amelita Ward, whom he met while filming Smugglers' Cove (1948). Their marriage produced Leo Gorcey Jr. in 1949, and a baby girl they named Jan (after Leo's producer and manager, Jan Grippo) in 1951. They divorced in 1956. That year Leo married his young nanny, Brandy, who was taking care of his two kids. They had a baby girl, Brandy Jo, in 1958. The couple divorced in 1962. Leo went to the altar one last time in February, 1968, marrying Mary Gannon. He stayed married to her until his death on June 2, 1969.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2E2ZjdkODgtNzEyOC00ZWMyLWFkOTktY2JiNjUyNmYyMjM2L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0329832","name":"Leo Gorcey","idIMDB":"nm0329832"},"actorId":"nm0329832","character":"Bim","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gabriel Dell","urlProfile":"http://www.imdb.com/name/nm0217316","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwYjVlOTMtMTFiYS00NWE1LTg2MzUtMmIyYjZjYzBlMTFmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 October 1919","placeOfBirth":" New York, USA","birthName":"Gabriel Del Vecchio","height":"5' 10\" (1.78 m)","bio":"The son of an Italian immigrant doctor, Gabriel \"Gabe\" Dell began his career singing in a boys church choir and then on a children's radio show. He made his stage debut in the play \"Dead End\" and, with the other juvenile members of the cast, was called to Hollywood for the film version. Dell was one of the more unusual members of what came to be known as the East Side Kids/Dead End Kids/Bowery Boys in that when he appeared in many of their films, he, unlike his colleagues, didn't always play a member of the gang. He often played a reporter, or a cop, or even a gangster, somebody who had either befriended the gang or used to be one of them but got out. Dell took a leave from the film business during WW II and served in the Merchant Marine for 3-1/2 years. When he returned, he played in a few more of the Bowery Boys series but made his final film with them in 1950 and struck out on his own. He took roles in Broadway plays, formed a nightclub act with former East Side Kid Huntz Hall and studied for three years at the Actors Studio. He worked steadily in television and was a regular cast member of the The Steve Allen Plymouth Show (1956). He alternated between TV and film parts, with one of his best roles being that of a sardonic hit man with a sense of humor in director Phil Karlson's action packed Framed (1975).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwYjVlOTMtMTFiYS00NWE1LTg2MzUtMmIyYjZjYzBlMTFmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0217316","name":"Gabriel Dell","nicknames":["Gabe"],"idIMDB":"nm0217316"},"actorId":"nm0217316","character":"Pasty","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Huntz Hall","urlProfile":"http://www.imdb.com/name/nm0355653","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA4YmNlMzQtODdmZi00NGFmLTgzYzUtNjE3ZmJmZGNkYzNhXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 August 1920","placeOfBirth":" New York City, New York, USA","birthName":"Henry Richard Hall","height":"5' 10\" (1.78 m)","bio":"The 14th of 16 children born to an air conditioning repairman, Henry Richard Hall (he got the name \"Huntz\" from a brother who said his large nose made him look German) was anything but the tough street kid he played in the East Side Kids/Bowery Boys films. He made his stage debut at the age of 1 in a play called \"Thunder on the Left\"; after graduating from a Catholic grammar school, he attended New York's famous Professional Children's School, was a boy soprano with the Madison Square Quintette, and appeared in an experimental 1932 television broadcast. Actor/director Martin Gabel got him an audition for the play \"Dead End\", and Hall got the part because he could imitate a machine gun to playwright Sidney Kingsley's satisfaction. Hall appeared in a total of 81 East Side Kids/Bowery Boys features and serials, more than any other actor. In 1940 he married 18-year-old dancer Elsie May Anderson (they divorced in 1944). During WWII Hall enlisted in the Army, and after his discharge returned to Hollywood, where his first jobs were in war films playing soldiers (for his impressive work in A Walk in the Sun (1945) he received the New York Theatre Critics Circle Blue Ribbon Award). In 1948 Hall found himself in the same kind of jam as did Robert Mitchum -- getting arrested for possession of marijuana, but he was acquitted by a jury. After the trial Hall married showgirl Leslie Wright. In the early 1950s, Hall and former Bowery Boys actor Gabriel Dell teamed up and for a \"Hall and Dell\" nightclub act that was so successful it cost both men their marriages; in 1953 Hall's and Dell's wives both sued for divorce, claiming the men thought more of the act than they did of them. In 1954 Hall was arrested for fighting with the manager of a building where he was attending a party; apparently the party was too noisy and the manager told the occupants to quiet down. Hall took offense at this, a fight ensued and Hall was arrested for assault, for which he paid a $50 fine and was put on probation. In 1959 he was arrested on a drunk driving charge. Having stayed out of trouble for quite some time now, Hall has been content in retirement, with occasional film and television work (not that he needed the money; in addition to owning 10% of the Bowery Boys pictures, Hall made some wise oil and gas investments that paid off handsomely).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA4YmNlMzQtODdmZi00NGFmLTgzYzUtNjE3ZmJmZGNkYzNhXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0355653","name":"Huntz Hall","idIMDB":"nm0355653"},"actorId":"nm0355653","character":"Crab","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bernard Punsly","urlProfile":"http://www.imdb.com/name/nm0700603","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2YyZWEwOGItMWFlYS00OTAxLWI4ZDktN2U4ZTM2ZjI5YzBiL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1923","placeOfBirth":" New York City, New York, USA","bio":"Bernard Punsly auditioned for the 1935 play \"Dead End\" on a lark - he had absolutely no show-business experience whatsoever, had never studied acting and had no desire to be an actor. He said that show business seemed like it might be fun, so he figured he'd give it a shot. To his surprise he was picked for he play, and when it turned out to be a huge hit, was called to Hollywood with the rest of the juvenile cast for the film version. While Punsly appeared in most of the \"Dead End Kids\" films made after the play, he didn't participate in most of his colleagues' \"extra-curricular activities\" - while they were out partying and getting into trouble with the law, Punsly would go home after a day's filming and read, mainly medical books, as he always wanted to be a doctor. His lack of film-industry ambition is reflected in the fact that he appeared in only two films outside of the Dead End Kids series. Punsley left the series in the mid-40s to join the army, where he received his medical training. Upon his discharge he enrolled in the University of Georgia, eventually attaining his life's dream of becoming an MD. He returned to California, but not to a film career - he opened up a medical practice in Torrance. Punsly said that he never watched his old films - not because he had any regrets about making them, but because, as he said, he grew out of them.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2YyZWEwOGItMWFlYS00OTAxLWI4ZDktN2U4ZTM2ZjI5YzBiL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0700603","name":"Bernard Punsly","idIMDB":"nm0700603"},"actorId":"nm0700603","character":"Hunky","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe Downing","urlProfile":"http://www.imdb.com/name/nm0236110","urlPhoto":"","biography":{"dateOfBirth":"26 June 1903","placeOfBirth":" New York City, New York, USA","bio":"Joe Downing was born on June 26, 1903 in New York City, New York, USA. He was an actor, known for Angels with Dirty Faces (1938), Each Dawn I Die (1939) and Johnny Eager (1941). He died on October 16, 1975 in Canoga Park, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0236110","name":"Joe Downing","idIMDB":"nm0236110"},"actorId":"nm0236110","character":"Steve","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edward Pawley","urlProfile":"http://www.imdb.com/name/nm0668023","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWE4M2I3NzItOTJmMi00ZWQxLTg0YjktY2Q3YWNmYzkxZTRkXkEyXkFqcGdeQXVyNTUyMTMyMDg@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 March 1901","placeOfBirth":" Kansas City, Missouri, USA","birthName":"Edward Joel Pawley","height":"5' 10\" (1.78 m)","bio":"Edward Joel Pawley was a native of Kansas City, Missouri, and attended Manuel Training High School. He took drama classes in high school, and after graduation he worked for six months in his half-brother's traveling stage show (under canvas). He went to New York in 1920 to seek his fame and fortune. He acted in various shows both on and off Broadway before getting his first starring role on Broadway (in 1928) as \"Elmer Gantry\" in the popular and controversial show of the same name. While still performing on Broadway in the early 1930s, he became interested in movies and obtained some small parts in a couple of films. He also supplemented his income from the theater by performing, on radio, skits from some of his Broadway shows. Around 1933, he left Broadway and moved to Hollywood, where he found work in more than 50 films over a ten-year period. He was a versatile character actor and appeared in some of the better known films of the 1930s with stars like James Cagney, Humphrey Bogart, Mickey Rooney, The Dead End Kids, Rita Hayworth and John Garfield, among others. He became disenchanted with Hollywood in the early 1940s because of what he saw as attempted Communist infiltration of the movie industry. After making a searing speech against those in the industry who he believed had joined the Communist party, he found himself unable to obtain work because of what he saw as \"blackballing\" by several producers and directors. Consequenly, he found it more difficult to find worthwhile roles, so he left Hollywood in 1942 and returned to the New York stage. He also worked for a while on the popular radio series \"Portia Faces Life\". He and Lucille Wall were the Love Story Boy and Girl on that show. In 1943 he auditioned for the leading role in the very popular drama series \"Big Town, and won the part. He played Steve Wilson, the idealistic managing editor of the Illustrated Press who was not afraid to fight for what he believed in. His sidekick on the show was Fran Carlon, who played Lorelei Kilbourne, the paper's girl reporter. Pawley played that role until 1951. He retired to Rappahannock County, Virginia, where he lived a very domesticated existence, raising and selling championship goats, writing poetry and working part-time as a radio announcer. His rich baritone voice was very mellifluous and could charm any audience. He married (in 1922) his high school sweetheart, Martina May Martin, who was a stage actress. They had one child, a son they named Martin Herbert (b. 1923). After they divorced and later remarried only to divorce again, he married (in 1937) the famous Broadway musical star Helen Shipman, of Pennsylvania. They remained married until her death in 1984; however, there were no children born of this union. His magnificent voice was stilled on January 27, 1988, as the result of a heart attack. He was a man of integrity, charm, eloquence, modesty, and patriotism, not to mention his ability to perform successfully in three different entertainment mediums: stage, movies, and radio.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWE4M2I3NzItOTJmMi00ZWQxLTg0YjktY2Q3YWNmYzkxZTRkXkEyXkFqcGdeQXVyNTUyMTMyMDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0668023","name":"Edward Pawley","idIMDB":"nm0668023"},"actorId":"nm0668023","character":"Edwards","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adrian Morris","urlProfile":"http://www.imdb.com/name/nm0606343","urlPhoto":"","biography":{"dateOfBirth":"12 January 1907","placeOfBirth":" Mount Vernon, New York, USA (some sources say 1903)","bio":"Adrian Morris was born on January 12, 1907 in Mount Vernon, New York, USA. He was an actor, known for The Grapes of Wrath (1940), Angels with Dirty Faces (1938) and The Petrified Forest (1936). He died on November 30, 1941 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0606343","name":"Adrian Morris","idIMDB":"nm0606343"},"actorId":"nm0606343","character":"Blackie","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0029870","urlIMDB":"http://www.imdb.com/title/tt0029870","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"27","month":"06","year":"1938","remarks":null},null],"copyrightHolder":"Warner Bros. Pictures, Inc.; 14 September 1938; LP8414 (in copyright registry)"},"technical":{"runtime":["1 hr 37 min (97 min)"],"soundMix":["Mono"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["(10 reels)","2,650 m (Yugoslavia)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"8.0","filmingLocations":[{"location":"Sing Sing Penitentiary - 354 Hunter Street, Ossining, New York, USA"}],"rated":"APPROVED","awards":[{"award":"Academy Awards, USA 1939","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Actor in a Leading Role","names":[{"name":"James Cagney","id":"nm0000010","role":null}]},{"category":"Best Director","names":[{"name":"Michael Curtiz","id":"nm0002031","role":null}]},{"category":"Best Writing, Original Story","names":[{"name":"Rowland Brown","id":"nm0114602","role":null}]}]}]},{"award":"National Board of Review, USA 1938","titlesAwards":[{"titleAwardOutcome":"Won NBR Award","categories":[{"category":"Best Acting","names":[{"name":"James Cagney","id":"nm0000010","role":null}]}]}]},{"award":"New York Film Critics Circle Awards 1939","titlesAwards":[{"titleAwardOutcome":"Won NYFCC Award","categories":[{"category":"Best Actor","names":[{"name":"James Cagney","id":"nm0000010","role":null}]}]}]}],"votes":"16,538","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."}],"keywords":{"keywords":["dead end kids","juvenile delinquent","priest","tough guy","electric chair","catholic","gangster","gang","villain played by lead actor","main character dies","lower east side manhattan new york city","tenement","irish mob","irish gangster","irish catholic","redemption","psychotronic","cult film","bowery boys","childhood friend","gunfire","catholic priest","reform school","younger version of character","psychotronic film","mean streets","gunfight","death of main character","manhattan new york city","hell's kitchen manhattan new york city","spinning newspaper","nun","orchestral music score","telephone booth","state penitentiary","roulette","roulette wheel","organ grinder","newspaper headline","mugshot","montage","jail","fingerprints","double cross","boys' choir","church","organized crime","kicked in the butt","new york city","irish american","anti hero","pickpocket","warehouse","urban setting","telephone box","street gang","social worker","shootout","rooftop","radio broadcasting","prologue","pool hall","police","parking garage","nightclub","newspaper","murder","moral crusade","mob hit","kidnapping","face slap","drugstore","death row","dancing","crime boss","corrupt lawyer","cellar","casino","blackmail","betrayal","wall safe","tear gas","defiance","basketball","execution"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:45:40"}}