{"data":{"movies":[{"title":"Die ewige Maske","originalTitle":"","year":"1935","releaseDate":"19370112","directors":[{"name":"Werner Hochbaum","id":"nm0387791"}],"writers":[{"name":"Werner Hochbaum","id":"nm0387791"},{"name":"Leo Lapaire","id":"nm0487407"}],"runtime":"74 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2RmODAzYjktOTIyNi00MDAwLWE5OTktMjlmNWEwNGVhZmU1XkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","countries":["Austria","Switzerland"],"languages":["German"],"genres":["Drama"],"simplePlot":"","actors":[{"actorName":"Peter Petersen","urlProfile":"http://www.imdb.com/name/nm0676930","urlPhoto":"","biography":{"dateOfBirth":"18 November 1876","placeOfBirth":" Hamburg, Germany","birthName":"Max Paulsen","bio":"Peter Petersen was born on November 18, 1876 in Hamburg, Germany as Max Paulsen. He was an actor, known for Die ewige Maske (1935), Homecoming (1941) and Mascarade (1934). He was married to Hedwig Bleibtreu. He died on March 11, 1956 in Vienna, Austria.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0676930","name":"Peter Petersen","idIMDB":"nm0676930"},"actorId":"nm0676930","character":"Professor Tscherko","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mathias Wieman","urlProfile":"http://www.imdb.com/name/nm0927436","urlPhoto":"","biography":{"dateOfBirth":"23 June 1902","placeOfBirth":" Osnabrück, Germany","bio":"Mathias was born on June 23, 1902. During his long career Mathias starred in more than 50 films and was a veteran of countless stage roles specializing in portrayals of Johann Wolfgang von Goethe's Dr. Faust. Of his films, one of the more famous he starred in was the Leni Riefenstahl directed The Blue Light (1932), made in 1932. Frau Riefenstahl acted in this film as well as directed it. In \"Das Blaue Licht\", Mathias plays the lead opposite Frau Riefenstahl as a painter who befriends her with unhappy consequences. Frau Riefenstahl and Mathias had worked together previously in another film Storm Over Mont Blanc (1930) in 1930. Frau Riefenstahl, who is 99 years young and whose 100th birthday is coming up in August, 2002, remembers Mathias very well as \"ein wunderbarer Mensch\". Another famous film is the 1936 feature _Ewige Maske, Die (1936)_ a film about a doctor dealing with and overcoming his mental illness. This movie won the 1937 American National Board of Review award for best foreign film and Mathias won the award for best actor. The film was also nominated for an award at the Venice Film Festival. During the time of the National Socialist regime Mathias was \"persona non grata\" with Joseph Goebbels, the Minister of Propaganda who was responsible for film production in Germany. Other notable films were the 1952 entry at the Cannes Film Festival _Herz der Welt (1951)_ in which Mathias portrayed Dr. Alfred Nobel, and 1954's Fear (1954) co-starring Ingrid Bergman and directed by her husband Roberto Rossellini. In this movie, Mathias plays Ingrid Bergman's husband and it's about an affair Bergman's character has while married to Mathias' character. As a stage actor, Mathias was in many, many different productions including German versions of plays by Shakespeare, G.B. Shaw, and Henrik Ibsen, as well as plays by Germans like Bertholt Brecht. In fact, Mathias was a mainstay of the Deutsches Theater in Berlin for a number of years in the 1920s. It was while working as an actor in Berlin that Mathias met his wife Erika (Friedericke Anna Hedwig Meingast), who was a stage actress. They married on January 11, 1926. Erika gave up her promising acting career after marrying Mathias in order that she could help him in his career. Mathias also worked in radio and recorded narratives of famous works accompanied by symphonic music. Examples of CDs that are currently available are Deutsche Grammophon's 2000 release of \"Mathias Wieman spricht Homer. Aus Der Odyssee\" and Deutsche Grammophon's 2002 release of \"Herman Hesse. Tractat vom Steppenwolf,\" and \"Mozart auf der Reise nach Prag\" (Deutsche Grammophon, 1968). After World War 2, Mathias and Erika moved to Zurich, Switzerland, and it was there that Mathias died from cancer in 1969, followed by Erika, also cancer-related, in 1972. They had no children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0927436","name":"Mathias Wieman","idIMDB":"nm0927436"},"actorId":"nm0927436","character":"Dr. Dumartin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Franz Schafheitlin","urlProfile":"http://www.imdb.com/name/nm0769888","urlPhoto":"","biography":{"dateOfBirth":"9 August 1895","placeOfBirth":" Berlin, Germany","birthName":"Franz Erwin Paul Schafheitlin","bio":"Franz Schafheitlin was born on August 9, 1895 in Berlin, Germany as Franz Erwin Paul Schafheitlin. He was an actor, known for Die ewige Maske (1935), Der Kaufmann von Venedig (1968) and Das Chiffontuch (1953). He was married to Hertha Scheel and Ika. He died on February 6, 1980 in Pullach im Isartal, Bavaria, Germany.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0769888","name":"Franz Schafheitlin","idIMDB":"nm0769888"},"actorId":"nm0769888","character":"Monsieur Negar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Kraa","urlProfile":"http://www.imdb.com/name/nm0469076","urlPhoto":"","biography":{"dateOfBirth":"28 April 1911","placeOfBirth":" Næstved, Denmark","bio":"Tom Kraa was born on April 28, 1911 in Næstved, Denmark. He was an actor, known for Die ewige Maske (1935). He died on January 8, 1997 in Dallas, Texas, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0469076","name":"Tom Kraa","idIMDB":"nm0469076"},"actorId":"nm0469076","character":"Dr. Wendt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thekla Ahrens","urlProfile":"http://www.imdb.com/name/nm0014343","urlPhoto":"","biography":{"dateOfBirth":"24 July 1906","placeOfBirth":" Mühleberg, Switzerland","bio":"Thekla Ahrens was born on July 24, 1906 in Mühleberg, Switzerland. She is an actress, known for All for Veronica (1936), Die ewige Maske (1935) and Le postillon de longjumeau (1936).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0014343","name":"Thekla Ahrens","idIMDB":"nm0014343"},"actorId":"nm0014343","character":"Sister Anna","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Olga Tschechowa","urlProfile":"http://www.imdb.com/name/nm0874781","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2RmODAzYjktOTIyNi00MDAwLWE5OTktMjlmNWEwNGVhZmU1XkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1897","placeOfBirth":" Alexandropol, Erivan Governorate, Russian Empire [now Gyumri, Armenia]","birthName":"Olga von Knipper","bio":"Olga Chekhova (also Olga Tschechova in German), one of the most popular stars of the silent film era, remained a mysterious person throughout her life and was accused of being a Russian agent in Nazi Germany. She was born Olga Konstantinovna von Knipper on April 26, 1897, in Aleksandropol, Transcaucasia, Russian Empire (now Gyumri, Armenia). She was the second of 3 children in a bilingual Russian-German family. Her father, Konstantin Leonardovich Knipper, a Lutheran of German descent. He made a military career in Russia as a railroad engineer. Young Olga studied art and literature at an art school in St. Petersburg. Later as an immigrant in Germany she claimed friendship with the family of Tsar Nicholas II--who also was of German origin--and that she had encountered the notorious Russian mystic and monk, Grigory Rasputin. In reality, she was sent from St. Petersburg to Moscow to her aunt, actress Olga Knipper-Chekhova, to study acting at Moscow Art Theatre. In 1914, at age 17, she eloped with Russian-Jewish actor Michael Chekhov, nephew of Anton Chekhov. Olga adored her husband, Michael Chekhov, a rising star of stage and film. But he met another beauty, Xenia Zimmer, and became involved in extramarital affair while Olga was pregnant with their child. Their daughter, Ada Tschechowa, was born in 1916. Olga separated from Michael Chekhov during the tragic time of the Russian Revolution in 1917. That same year she made her film debut in a Russian silent film, Anya Kraeva (1917). Olga claimed that she fled Russia disguised as a peasant woman and posed as a mute while carrying a diamond ring in her mouth. In reality she married an officer in the Austro-Hungarian army, Friedrich Jaroshi, and took a train from the Moscow Belorussky station to Vienna, Austria, having travel documents from the Russian Commissar of Culture (and she was also helped by the Russian intelligence agency in exchange for her cooperation). She was later invited to the Soviet Embassy in Berlin for meetings with Soviet officials. In Germany she was introduced to film producer Erich Pommer and renowned director F.W. Murnau, who gave her a leading role in his film, The Haunted Castle (1921). She quickly became a huge star in Europe and played in more than 40 silent films during the decade. Olga was joined by ex-husband Michael Chekhov in several films, including Poliche (1929) (aka \"The Fool of Love\"), which she also directed. Future Nazi leader Adolf Hitler reportedly fell for Olga upon seeing her cold and beautiful face in several films in the 1920s. She was famous for her movie image as a baroness and was courted in the 1930s by Luftwaffe boss Hermann Göring and by Propaganda Minister Joseph Goebbels. Some wives of high-ranking Nazi officials were jealous of and hated the beautiful Olga. Goebbels was known to have visited her home on several occasions when he wanted to be away from his Nazi \"activities\". He invited Olga to several Nazi receptions and introduced her to Adolf Hitler in April 1933. Olga became a personal friend of Hitler and was photographed sitting next to \"Der Fuhrer\" at official events of the Nazi Party. She also received valuable Christmas gifts from Hitler, and regular birthday presents and other tokens of his attention. In 1936 Olga was honored with the title of \"State Actress\" of the Third Reich and was made a German citizen. She married a wealthy Belgian businessman, Marcel Robyns. One day prior to the wedding she had a private reception with Hitler, who gave her permission to retain her German citizenship. Two years later she divorced Robyns and returned to her high-society life in Berlin. Her famous 1939 photo-op with Hitler was thoroughly analyzed in Moscow. She was invited by Soviet officials to join Hermann Göring and Joachim von Ribbentrop at the meeting with Vyacheslav Molotov and Gen. V. N. Merkulov at the Soviet Embassy in Berlin in 1940. At that time Olga was associated with her agent-brother Lev Knipper, who was sent from Moscow to Germany on a secret mission to assassinate Adolf Hitler. The plan was to use one of Olga's visits with Hitler for a suicide attack on the Fuhrer. Olga was kept oblivious of the plan, which was aborted by an order from Joseph Stalin, who became paranoid about the possibility of Germany's alliance with Britain if Hitler was killed. Interestingly, Stalin and Hitler were both amateur film directors in the 1920s, but as dictators they now directed the course of history. Olga was invited by Josef Goebbels to the official reception in Berlin in July of 1941, only a month after the Nazis invaded Russia and Luftwaffe bombings caused massive devastation to Russian cities. Goebbels announced the planned occupation of Moscow. She was being investigated by the SS on orders from SS leader Heinrich Himmler. She was constantly under surveillance by both Nazi and Soviet agents in her Berlin home. As the war progressed and conditions got progressively worse for the Nazi regime, party bosses became increasingly paranoid. Himmler was planning to arrest her in January of 1945. One early morning she was informed of Himmler's move. She immediately called him directly with a request for a favor--to let her finish her morning cup of coffee comfortably. When SS commandos surrounded her home Himmler opened her door and was met by an angry Adolf Hitler, who in no uncertain terms informed Himmler that he had made a mistake. Olga was a beautiful pawn in a dangerous game between the two most destructive powers in the Second World War. She survived through acting, cheating, lying and disguise. She protected her daughter Ada from Nazi anti-Semitism by hiding the fact that her ex-husband, Michael Chekhov, was Jewish. Her brother Lev Knipper was held in a Nazi concentration camp and managed to survive because of his perfect German (and probably with her help). During the savage battle for Berlin just before the war's end, Olga hid in a bomb shelter and was eventually taken prisoner by the Red Army. She was flown to Moscow in April of 1945, for debriefing at the offices of Soviet secret police officials Viktor Abakumov and Lavrenti Beria. She discreetly attended the Moscow Art Theatre performance of \"The Cherry Orchard\" starring her aunt Olga Knipper-Chekhova in May of 1945. They were not allowed to talk and her aunt Olga fainted backstage. After two months of interrogations in Moscow, on June 26, 1945, Olga was flown back to Berlin, where she was assisted by the Soviet Army. She was given money and moved in to a Soviet-supervised house on Spree Strasse in the Soviet sector of East Berlin. Several articles in the French and British presses stated that she was a clandestine agent and secretly decorated by the Soviet government. She praised the Russian victory over the Nazis in a private letter to her aunt Olga Knipper-Chekhova. Meanwhile, the film she made in Hollywood turned out to be a flop in the US market, mainly because of her heavy Russian accent. She continued a film career in Europe and ran her own film production company, Venus-Film Olga Tschechowa. In 1950 she moved to Munich and starred in several films. In 1955 she used her star power to launch a successful cosmetics company, \"Olga Tscheschowa Kosmetik Geselschaft.\" Her remarkable acting career, spanning almost 60 years, ended in 1978, with a small film role as a grandmother. Her personal file was temporarily available for viewing at the KGB archives in Moscow. One report on her was prepared and signed by the notoriously brutal KGB chief Viktor S. Abakumov. On that report a handwritten question was left by a reader in Kremlin: \"What do you suggest to be done with Ms. Chekhova?\", the handwriting was by Joseph Stalin. Stalin was quoted as having said, \"The actress Olga Chekhova will be very useful in the post-war years\", and she probably was. One of her films was titled The Man Who Wanted to Live Twice (1950), or \"The Man Who Wanted to Live Two Lives\"--and that was exactly what she did. In 1955, Olga was saddened by the death of Michael Chekhov. In 1966, Olga suffered from another tragedy: her only daughter Ada died in an airplane crash. Devastated by the painful loss, Olga suffered from bouts of depression and turned to alcohol, but she survived thanks to her strong will and lust for life. She lived for another fifteen years, played a few more roles in the movies, and saw her great-grandchildren grow. Moments before she died, sensing the end was near, she ordered a glass of champagne from her granddaughter Vera Tschechowa. That was March 9, 1980, in Munich, Germany. Her last words were, \"Life is beautiful!\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2RmODAzYjktOTIyNi00MDAwLWE5OTktMjlmNWEwNGVhZmU1XkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0874781","name":"Olga Tschechowa","idIMDB":"nm0874781"},"actorId":"nm0874781","character":"Madame Negar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karl Skraup","urlProfile":"http://www.imdb.com/name/nm0804835","urlPhoto":"","biography":{"dateOfBirth":"31 July 1898","placeOfBirth":" Atzgersdorf, Lower Austria, Austria-Hungary [now Vienna, Austria]","bio":"Karl Skraup was born on July 31, 1898 in Atzgersdorf, Lower Austria, Austria-Hungary. He was an actor, known for Lowlands (1954), The World Turns Backward (1947) and La Reine de la route (1948). He died on October 2, 1958 in Munich, Germany.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0804835","name":"Karl Skraup","idIMDB":"nm0804835"},"actorId":"nm0804835","character":"Le gardien","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0027592","urlIMDB":"http://www.imdb.com/title/tt0027592","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"19","month":"02","year":"1935","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 14 min (74 min)","1 hr 21 min (81 min) (Germany)","1 hr 25 min (85 min) (Switzerland)","1 hr 20 min (80 min) (Austria)"],"soundMix":["Mono (Tobis-Klangfilm)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["2,219 m (Germany)","2,340 m (Switzerland)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.7","filmingLocations":[{"location":"Atelier Rosenhügel, Vienna, Austria"}],"awards":[{"award":"National Board of Review, USA 1937","titlesAwards":[{"titleAwardOutcome":"Won NBR Award","categories":[{"category":"Best Foreign Film","names":[]},{"category":"Top Foreign Films","names":[]},{"category":"Best Acting","names":[{"name":"Mathias Wieman","id":"nm0927436","role":null}]}]}]},{"award":"Venice Film Festival 1935","titlesAwards":[{"titleAwardOutcome":"Won Best Psychological Film","categories":[{"category":"","names":[{"name":"Werner Hochbaum","id":"nm0387791","role":null}]}]},{"titleAwardOutcome":"Nominated Mussolini Cup","categories":[{"category":"Best Foreign Film","names":[{"name":"Werner Hochbaum","id":"nm0387791","role":null}]}]}]}],"votes":"22","type":"Movie","companyCreditsSimple":[{"idCompany":"co0146236","name":"Progress"},{"idCompany":"co0182209","name":"Progress Film"}],"keywords":{"keywords":["based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 04:48:27"}}