{"data":{"movies":[{"title":"Short Circuit","originalTitle":"","year":"1986","releaseDate":"19860509","directors":[{"name":"John Badham","id":"nm0000824"}],"writers":[{"name":"S.S. Wilson","id":"nm0934093"},{"name":"Brent Maddock","id":"nm0534681"}],"runtime":"98 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTcwYzA3ODQtZGM2YS00YjRlLWIwOTEtZTIxZWY5ZjFhYzQyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Family","Sci-Fi"],"plot":"Number 5, one of a group of experimental military robots, undergoes a sudden transformation after being struck by lightning. He develops self-awareness, consciousness, and a fear of the reprogramming that awaits him back at the factory. With the help of a young woman, Number 5 tries to evade capture and convince his creator that he has truly become alive.","simplePlot":"Number 5 of a group of experimental robots in a lab is electrocuted, suddenly becomes intelligent, and escapes.","actors":[{"actorName":"Ally Sheedy","urlProfile":"http://www.imdb.com/name/nm0000639","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MzY0NTU3OF5BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1962","placeOfBirth":" New York City, New York, USA","birthName":"Alexandra Elizabeth Sheedy","height":"5' 5\" (1.65 m)","bio":"Ally Sheedy was born in New York City, to Charlotte (Baum), a press agent and writer, and John J. Sheedy, Jr., an advertising executive. She is of Russian Jewish (mother) and Irish (father) descent. While at New York's Bank Street School, 12-year-old Ally Sheedy wrote about a mythical encounter between Queen Elizabeth I and an inquisitive mouse. The result, \"She Was Nice to Mice\", was published by McGraw-Hill and became an instant best seller. Although it proved a springboard to an acting career, Sheedy's strongest memories of childhood remain those of \"dancing and doing plays\". From six until fourteen, she danced with the American Ballet Theatre and, during summers at Fire Island, she'd \"get a bunch of kids together and stage shows on back lawns and porches\". When she discovered that to stay with dancing meant staying with starvation diets, she shifted her focus to acting for good. Meanwhile, her book brought her requests from several publications. The Village Voice asked her to review movies and the New York Times wanted her to review children's books. The assignment she accepted was from Ms. Magazine, which requested an article about her mother and herself. It was an appearance on \"The Mike Douglas Show (1961) to promote her book, however, that brought Sheedy work as a performer. Signed by an agent who caught the show, she was sent out on television commercials, immediately. Only 15 at the time, she also performed off-Broadway and on a series of after-school specials. The day she turned 18, Sheedy packed her bags and headed for Los Angeles, where she enrolled in the drama department at USC, and soon landed roles in the television drama The Best Little Girl in the World (1981), The Day the Loving Stopped (1981), Splendor in the Grass (1981) and Homeroom (1981) and played a recurring character on Hill Street Blues (1981). The strength of her performances led directly to her film debut as Sean Penn's naive-but-knowing girlfriend, \"J.C.\", in Bad Boys (1983). That same year (1983), she starred as Matthew Broderick's zany partner in WarGames (1983). After starring as Rob Lowe's would-be romantic interest in Oxford Blues (1984), the withdrawn adolescent of The Breakfast Club (1985) and Gene Hackman's adoring daughter in Twice in a Lifetime (1985), Sheedy played her first fully-adult role in St. Elmo's Fire (1985), the 1985 hit about college friends.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MzY0NTU3OF5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000639","name":"Ally Sheedy","idIMDB":"nm0000639"},"actorId":"nm0000639","character":"Stephanie Speck","urlCharacter":"http://www.imdb.com/character/ch0013798","main":true},{"actorName":"Steve Guttenberg","urlProfile":"http://www.imdb.com/name/nm0000430","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMTI5NzgyNF5BMl5BanBnXkFtZTgwOTQxNjE0MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1958","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Steven Robert Guttenberg","height":"5' 10½\" (1.79 m)","bio":"Although Steve Guttenberg is firmly established as the star not only of hit motion pictures but of hit motion picture franchises, his roots are in the theater. As a result, he has moved effortlessly between comedy and drama. In two decades of stardom in both critical and box-office hits, Guttenberg has been the above-the-title star of six films that earned over $100,000,000 in the United States, a feat accomplished by relatively few superstars. He has also starred in four film franchises, appearing in such sequeled smash hits as Cocoon (1985), 3 Men and a Baby (1987), Police Academy (1984), and Short Circuit (1986), taking his films' box-office grosses into the billions. The comic timing and charm with which he illuminated those films and the dramatic invention which he displayed in such other major successes as Diner (1982), The Bedroom Window (1987), The Boys from Brazil (1978), and a string of historic television films all derive from his firm theater training. Steven Robert Guttenberg was born in Brooklyn, New York, to Ann Guttenberg (née Ann Iris Newman), a surgical assistant, Stan Guttenberg (Jerome Stanley Guttenberg), an electrical engineer. He is of Austrian Jewish and Russian Jewish descent. His studies, which include years with famed teacher Herbert Berghof and with one of the most fertile schools of improvisational comedy, The Groundlings, took him to such renowned theaters as the Helen Hayes on Broadway, where he created the lead role in \"Prelude To A Kiss\" and \"The Comedy\" in London's West End, where he starred in \"The Boys Next Door.\" He recently won kudos again in the world stage premiere production of \"Furthest From the Sun,\" which Woody Harrelson directed and co-authored. Guttenberg has carved as vivid a body of work on TV as he has on the big screen. His television films include the critically acclaimed Miracle on Ice (1981), To Race the Wind (1980), Something for Joey (1977), and the controversial nuclear holocaust picture, The Day After (1983), which more than 20 years after its original airing remains the highest-rated made-for-television movie in history. Fiercely dedicated to improving opportunities for the homeless and for young people, Guttenberg has created Guttenhouse, an apartment complex he has funded to accommodate young people after their graduation from foster child status, with on-site social worker direction to assist their assuming adult responsibilities. The Entertainment Industry Foundation, Hollywood's charity arm, selected him to be Ambassador for Children's Issues because of his dedicated work on behalf of children and the homeless. In this capacity, he is spearheading Sight for Students, a $7-million program in which, together with VSP and Altair Eyeglasses, he will help provide glasses for 50,000 underprivileged and visually challenged children throughout their school years. Part of his unique ability to Pied Piper children to better lives comes from the fact that he is as affectionately regarded by young audiences as by adults, having starred in such kids' favorites as Casper: A Spirited Beginning (1997), It Takes Two (1995), and Zeus and Roxanne (1997). His interest in the welfare of youngsters is reflected in his work as a producer and director. He executive-produced \"Gangs,\" a CBS Schoolbreak Special (1984), which earned an Emmy nomination, and he debuted as a director with another critically acclaimed CBS Schoolbreak Special (1984), \"Love Off Limits\" (1993). Born in Brooklyn, New York (his production company, Mr. Kirby Productions, is named after his high school drama teacher) he grew up in Massapequa, Long Island. Guttenberg's crowded spare time includes his charitable activities for such kids-oriented agencies as Friends of the Children/Bridges, The Starlight Foundation as well as the Entertainment Industry Foundation. He is also an avid surfer and golfer and a passionate devoted dog owner. His first film as director/producer/co-screenwriter/star was an adaptation of a Broadway hit, the classic stage comedy/drama P.S. Your Cat Is Dead! (2002) by the late James Kirkwood Jr., co-author of \"A Chorus Line\" (and, of course, A Chorus Line (1985)). The black comedy, with its frank exploration of sexual role-playing, has lured and defied filmmakers for a quarter-century.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMTI5NzgyNF5BMl5BanBnXkFtZTgwOTQxNjE0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000430","name":"Steve Guttenberg","idIMDB":"nm0000430"},"actorId":"nm0000430","character":"Newton Crosby","urlCharacter":"http://www.imdb.com/character/ch0013799","main":true},{"actorName":"Fisher Stevens","urlProfile":"http://www.imdb.com/name/nm0001770","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MTE2NTMxM15BMl5BanBnXkFtZTYwNjkwMDM0._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 November 1963","placeOfBirth":" Chicago, Illinois, USA","birthName":"Steven Fisher","height":"5' 7\" (1.7 m)","bio":"Fisher Stevens moved from his native Chicago to New York at the age of 13 to pursue an acting career. He tried, unsuccessfully, to get any kind of job and was, he recalls, even rejected as extra for a Crest commercial. When his acting teacher, Dan Fauci, lost the lease to his teaching studio, he rented Fisher's loft and built a stage in the living room. He later studied with Uta Hagen. His first professional theatrical production was playing Tiny Tim's brother, Harry, in the musical version of Dickens' \"A Christmas Carol\" in the basement of an off-off-off Broadway theatre when he was 14. Since then he has performed in more than 20 stage productions including 544 performances in Harvey Fierstein's \"Torch Song Triology\", both on and off Broadway. He also played Eugene in Neil Simon's \"Brighton Beach Memories\". Most recently, he played the leads in Thomas Babe's \"Carrying School Children\", \"Almost Romance\" opposite Helen Slater and Jules Feiffer's \"Little Murders\" with Christine Lahti. He also sang and danced in the musicals \"Miami\" by Wendy Wasserstein and the late Michael Bennett's Broadway production of \"Scandal\" with Swoosie Kurtz and Treat Williams. He also appeared in the recent New York City Shakespeare Festival production of \"A Midsummer Nights Dream\". Fisher made his motion picture debut getting his fingers chopped off in the horror film The Burning (1981) when he was 16-years-old. After that he appeared in Baby It's You (1983) and The Brother from Another Planet (1984). He co-starred with Matt Dillon in the hit comedy film The Flamingo Kid (1984) where he met the then fledgling producer Gary Foster. He appeared as sidekick to Steve Guttenberg's character in Short Circuit (1986). In television he has performed in ABC's Ryan's Hope (1975), Showtime's Tall Tales & Legends (1985) and CBS' Early Edition (1996). Despite having lived in New York City for more than a decade, where, with some other actors, Stevens has started an off-off-off Broadway theatre company called Naked Angels, he insists that he is still a fan of the Chicago Cubs.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MTE2NTMxM15BMl5BanBnXkFtZTYwNjkwMDM0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001770","name":"Fisher Stevens","idIMDB":"nm0001770"},"actorId":"nm0001770","character":"Ben Jabituya","urlCharacter":"http://www.imdb.com/character/ch0013802","main":true},{"actorName":"Austin Pendleton","urlProfile":"http://www.imdb.com/name/nm0671721","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMzY4NjY1MzNeQTJeQWpwZ15BbWU3MDIzNjIzNjI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 March 1940","placeOfBirth":" Warren, Ohio, USA","bio":"Actor Austin Pendleton was born March 27, 1940 in Warren, Ohio to Frances and Thorn Pendleton. He graduated from Yale University. He later became an ensemble member of the Steppenwolf Theater in Chicago, and acted in several of the theater's productions. His first film appearance in Petulia (1968), a minor and uncredited role. Since, he has made over 100 appearances in television and film.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMzY4NjY1MzNeQTJeQWpwZ15BbWU3MDIzNjIzNjI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0671721","name":"Austin Pendleton","idIMDB":"nm0671721"},"actorId":"nm0671721","character":"Howard Marner","urlCharacter":"http://www.imdb.com/character/ch0013803","main":true},{"actorName":"G.W. Bailey","urlProfile":"http://www.imdb.com/name/nm0047265","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MDMzNzU5N15BMl5BanBnXkFtZTcwNTY2MDc1Mw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 August 1944","placeOfBirth":" Port Arthur, Texas, USA","birthName":"George William Bailey","height":"5' 7\" (1.7 m)","bio":"George William Bailey was born on August 27, 1944 in Port Arthur, Texas. Although Bailey started college at Lamar University in Beaumont, he eventually transferred to Texas Tech University in Lubbock. He did not complete his studies. He worked at local theater companies during the mid 1960s until his move to California, sometime in the 1970s. Here he began his work on such television series as Starsky and Hutch (1975), Charlie's Angels (1976) and CHiPs (1977). He eventually got a movie debut role in the Chuck Norris movie A Force of One (1979) before landing the role of Luther Rizzo in M*A*S*H (1972). In 1993, he returned to Texas to study again, this time at Southwest Texas State University. In 1994, he graduated with a Bachelor's degree of Fine Arts, Theatre and, for the 1999-2000 school year, he was the Artist in Residence. While in his 30s, Bailey went prematurely gray, leading to roles of characters much older than his actual age. Although he prefers dramatic acting, his most famous role will always be that of Captain Thaddeus Harris in Police Academy (1984). Since his goddaughter was diagnosed with leukemia, he has worked voluntarily for the Sunshine Kids Foundation, organizing trips for young cancer sufferers. In 2001, he was announced as the executive director of the foundation.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MDMzNzU5N15BMl5BanBnXkFtZTcwNTY2MDc1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0047265","name":"G.W. Bailey","idIMDB":"nm0047265"},"actorId":"nm0047265","character":"Skroeder","urlCharacter":"http://www.imdb.com/character/ch0013801","main":true},{"actorName":"Brian McNamara","urlProfile":"http://www.imdb.com/name/nm0573658","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWIxY2RjNmEtZTFhYi00MGE4LWE2M2YtZDQ3ZDUyYTQyNzE5XkEyXkFqcGdeQXVyMjAyNzY0MTU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 November 1960","placeOfBirth":" Long Island, New York, USA","bio":"Brian McNamara is a character actor, director and producer who has made over 100 TV and film appearances. His first major role was in the Garry Marshall comedy drama The Flamingo Kid (1984) with Matt Dillon. He then went on to star opposite Ally Sheedy and Steve Guttenberg in the John Badham science fiction project Short Circuit (1986), which performed well at the box office. The following year he put in a solid lead performance as Dean Karny in the thriller Billionaire Boys Club (1987): the film was based on an actual event and co-starred Judd Nelson and John Stockwell. Brian switched easily into slapstick comedy next with a supporting role in Caddyshack II (1988), where he shared the screen with veteran comedians Dan Aykroyd, Chevy Chase, and Jackie Mason. He helped Jeff Daniels and John Goodman battle grossly mutated spiders in the Frank Marshall horror comedy Arachnophobia (1990), and shined in the romantic comedy Mystery Date (1991) opposite Ethan Hawke and Teri Polo. Since then he has maintained a steady career in film - most notably a great performance in the independent film The Legend of Tillamook's Gold (2006)","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWIxY2RjNmEtZTFhYi00MGE4LWE2M2YtZDQ3ZDUyYTQyNzE5XkEyXkFqcGdeQXVyMjAyNzY0MTU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0573658","name":"Brian McNamara","idIMDB":"nm0573658"},"actorId":"nm0573658","character":"Frank","urlCharacter":"http://www.imdb.com/character/ch0154635","main":true},{"actorName":"Tim Blaney","urlProfile":"http://www.imdb.com/name/nm0087456","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNjQxMTcxOF5BMl5BanBnXkFtZTcwMjkwMDkwMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 April 1959","placeOfBirth":" Connecticut, USA","birthName":"Timothy Patrick Blaney","bio":"Tim Blaney was born on April 23, 1959 in Connecticut, USA as Timothy Patrick Blaney. He is known for his work on Men in Black (1997), Short Circuit 2 (1988) and Short Circuit (1986).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNjQxMTcxOF5BMl5BanBnXkFtZTcwMjkwMDkwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0087456","name":"Tim Blaney","idIMDB":"nm0087456"},"actorId":"nm0087456","character":"Number 5","urlCharacter":"http://www.imdb.com/character/ch0013804","main":true},{"actorName":"Marvin J. McIntyre","urlProfile":"http://www.imdb.com/name/nm0570793","urlPhoto":"","biography":{"height":"6' 1\" (1.85 m)","bio":"Marvin J. McIntyre is known for his work on The Running Man (1987), Back to the Future Part III (1990) and Silverado (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0570793","name":"Marvin J. McIntyre","idIMDB":"nm0570793"},"actorId":"nm0570793","character":"Duke","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Garber","urlProfile":"http://www.imdb.com/name/nm0304950","urlPhoto":"","biography":{"bio":"John Garber is known for his work on WarGames (1983), Short Circuit (1986) and Blue Thunder (1983).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0304950","name":"John Garber","idIMDB":"nm0304950"},"actorId":"nm0304950","character":"Otis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Penny Santon","urlProfile":"http://www.imdb.com/name/nm0763842","urlPhoto":"","biography":{"dateOfBirth":"2 September 1916","placeOfBirth":" New York City, New York, USA","birthName":"Pierina Burlando","bio":"Penny Santon was born on September 2, 1916 in New York City, New York, USA as Pierina Burlando. She was an actress, known for Short Circuit (1986), Funny Girl (1968) and Fletch (1985). She was married to Bruno Della Santina. She died on May 12, 1999 in Burbank, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0763842","name":"Penny Santon","idIMDB":"nm0763842"},"actorId":"nm0763842","character":"Mrs. Cepeda","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vernon Weddle","urlProfile":"http://www.imdb.com/name/nm0917136","urlPhoto":"","biography":{"dateOfBirth":"24 August 1935","placeOfBirth":" Hattieburg, Mississippi, USA","bio":"Vernon Weddle was born on August 24, 1935 in Hattieburg, Mississippi, USA. He is an actor, known for Short Circuit (1986), White Dog (1982) and Norma Rae (1979).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0917136","name":"Vernon Weddle","idIMDB":"nm0917136"},"actorId":"nm0917136","character":"General Washburne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barbara Tarbuck","urlProfile":"http://www.imdb.com/name/nm0850335","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MDA1OTMxNV5BMl5BanBnXkFtZTcwMTI3OTAzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 January 1942","placeOfBirth":" Detroit, Michigan, USA","birthName":"Barbara Joan Tarbuck","bio":"Trained on a Fulbright Grant to the London Academy of Music and Dramatic Art, Barbara's New York theatre work includes \"Landscape & Silence\" by Harold Pinter, \"Water Engine\" by David Mamet, Neil Simon's \"Brighton Beach Memoirs\" and \"Broadway Bound\", Joseph Chaikin's production of \"America Hurrah!\", and \"Enter The Night\" by Marie Irene Fornes. Recent regional standouts include \"Long Days Journey Into Night\" at Dallas Theatre Center, \"Death of a Salesman\" at San Diego Repertory, \"The Cripple Of Inishman\" at the Geffen, \"Wonderful World\" at Laguna Playhouse, \"Six Characters in Search of an Author\" at Williamstown, and \"Blue Window\" and \"Sidney Bechet Killed a Man\" at South Coast Repertory. Favorite screen roles: the woman with 12 dogs on ER (1994), the aged mother on Cold Case (2003) who comes to terms with her murdered son's homosexuality, Dwayne Johnson's mother in Walking Tall (2004), and Kevin McKidd's mother on Journeyman (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MDA1OTMxNV5BMl5BanBnXkFtZTcwMTI3OTAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0850335","name":"Barbara Tarbuck","idIMDB":"nm0850335"},"actorId":"nm0850335","character":"Senator Mills","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Lawrence","urlProfile":"http://www.imdb.com/name/nm0493058","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMjM2MDA3OF5BMl5BanBnXkFtZTgwOTEyNTg3MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1937","placeOfBirth":" Cincinnati, Ohio, USA","bio":"Tom Lawrence was born on July 31, 1937 in Cincinnati, Ohio, USA. He is known for his work on Short Circuit (1986), WarGames (1983) and Say Anything... (1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMjM2MDA3OF5BMl5BanBnXkFtZTgwOTEyNTg3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0493058","name":"Tom Lawrence","idIMDB":"nm0493058"},"actorId":"nm0493058","character":"Howard Marner's Aide","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fred Slyter","urlProfile":"http://www.imdb.com/name/nm0806354","urlPhoto":"","biography":{"dateOfBirth":"15 July 1935","placeOfBirth":" New York, USA","bio":"Fred Slyter was born on July 15, 1935 in New York, USA. He was an actor, known for Short Circuit (1986), Blue Thunder (1983) and The Ultimate Warrior (1975). He died on February 5, 1992 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0806354","name":"Fred Slyter","idIMDB":"nm0806354"},"actorId":"nm0806354","character":"Norman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Billy Ray Sharkey","urlProfile":"http://www.imdb.com/name/nm0788814","urlPhoto":"","biography":{"dateOfBirth":"10 February 1947","placeOfBirth":" Claremore, Oklahoma, USA","bio":"Billy Ray Sharkey was born on February 10, 1947 in Claremore, Oklahoma, USA. He is an actor, known for WarGames (1983), Short Circuit (1986) and The Grifters (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0788814","name":"Billy Ray Sharkey","idIMDB":"nm0788814"},"actorId":"nm0788814","character":"Zack","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0091949","urlIMDB":"http://www.imdb.com/title/tt0091949","business":{"budget":null,"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1985/\">1985</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 38 min (98 min)"],"soundMix":["Dolby Stereo"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm"]},"rating":"6.6","filmingLocations":[{"location":"Santa Clarita, California, USA"}],"rated":"PG","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1987","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Science Fiction Film","names":[]},{"category":"Best Director","names":[{"name":"John Badham","id":"nm0000824","role":null}]},{"category":"Best Special Effects","names":[{"name":"Syd Mead","id":"nm0574927","role":null},{"name":"Eric Allard","id":"nm0020063","role":null}]}]}]},{"award":"BMI Film & TV Awards 1987","titlesAwards":[{"titleAwardOutcome":"Won BMI Film Music Award","categories":[{"category":"","names":[{"name":"David Shire","id":"nm0006288","role":null}]}]}]}],"votes":"45,717","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005883","name":"TriStar Pictures"},{"idCompany":"co0279836","name":"Producers Sales Organization (PSO)"},{"idCompany":"co0004522","name":"Turman-Foster Company"}],"keywords":{"keywords":["mistaken for alien","animal lover","robot","struck by lightning","lightning","military","malfunction","tracking device","ex boyfriend","encyclopedia","watching tv","three stooges spoof","artificial intelligence","life","laser","first part","talking robot","sentient robot","two word title","three legged dog","grasshopper","rorschach test","chased by car","1980s","garbage truck","parachute","falling off a bridge","truck","cloud gazing","cloud","animal","van","skunk","oregon","raccoon","commercial","tv commercial","bridge","kitten","cat","dog","cow","butterfly","bathtub","reference to john wayne","robot as pathos","indian","pacifist","computer cracker","marine hymn","product placement"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 07:49:42"}}