{"data":{"movies":[{"title":"The Gravy Train","originalTitle":"","year":"1974","releaseDate":"19740616","directors":[{"name":"Jack Starrett","id":"nm0823630"}],"writers":[{"name":"Bill Kerby","id":"nm0449222"},{"name":"Terrence Malick","id":"nm0000517"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmEzOWQxZTctOGM5MC00ZmExLTk2MzItMTk1M2FiNzAzOGQ3XkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Comedy","Crime","Drama"],"plot":"Two rural West Virginia brothers leave home, rob an armored car and become fugitives.","simplePlot":"Two rural West Virginia brothers leave home, rob an armored car and become fugitives.","actors":[{"actorName":"Stacy Keach","urlProfile":"http://www.imdb.com/name/nm0005078","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMzEwODQ4Nl5BMl5BanBnXkFtZTYwMTA0NTQz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 June 1941","placeOfBirth":" Savannah, Georgia, USA","birthName":"Walter Stacy Keach Jr.","height":"5' 11½\" (1.82 m)","bio":"Stacy Keach has played to grand success a constellation of the classic and contemporary stage's greatest roles, and he is considered a pre-eminent American interpreter of Shakespeare. His SRO run as \"King Lear\" at the Shakespeare Theatre Company in Washington, D.C. received the best reviews any national leader has earned in that town for decades. Peter Marks of the Washington Post called Mr. Keach's Lear \"magnificent\". He recently accepted his third prestigious Helen Hayes Award for Leading Actor in 2010 for his stellar performance. His next stage appearance premiering January 13, 2011 at the Lincoln Center in New York is \"Other Desert Cities\" by Jon Robin Baitz and teaming him with Stockard Channing, Linda Lavin and Elizabeth Marvel. His latest television series, Lights Out (2011), on the FX network is a major new mid-season dramatic show, taking him back to the world of boxing which has been a rich setting for him before, notably in Huston's Fat City (1972) which ignited Keach's career as a film star. Versatility embodies the essence of Stacy Keach's career in film and television as well as on stage. The range of his roles is remarkable. His recent performance in Oliver Stone's \"W\" prompted fellow actor Alec Baldwin to blog an impromptu review matching Huston's amazement at Keach's power. Perhaps best known around the world for his portrayal of the hard-boiled detective, Mike Hammer, Stacy Keach is also well-known among younger generations for his portrayal of the irascible, hilarious Dad, Ken Titus, in the Fox sitcom, Titus, and more recently as Warden Henry Pope in the hit series, Prison Break. Following his triumphant recent title role performance in King Lear for the prestigious Goodman Theatre in Chicago, Keach joined the starring cast of John Sayles' recent film, Honeydripper. In the most recent of his non-stop activities, he has completed filming Deathmatch for the Spike Channel, and The Boxer for Zeitsprung Productions in Berlin, Germany. German audiences will also see him as one of the co-stars in the multi-million dollar production of Hindenburg: le géant des airs (2011), scheduled to air in January, 2011 with worldwide release thereafter. Mr. Keach co-stars in the new FX series entitled Lights Out (2011) about a boxing family, where he plays the Dad-trainer of two boxing sons played by Holt McCallany and Pablo Schreiber. The series is also scheduled to air in January, 2011. Keach returns to the New York stage at the start of the 2011 in Jon Robin Baitz's new play, \"Other Desert Cities,\" at the Lincoln Center. Capping his heralded accomplishment on the live stage of putting his own stamp on some of the theatre world's most revered and challenging roles over the past year when he headed the national touring company cast of \"Frost/Nixon,\" portraying Richard M. Nixon, bringing still another riveting characterization to the great legit stages of Los Angeles, Chicago, Boston, the nation's capitol and other major cities. He won his second Best Actor Helen Hayes Award for his outstanding performance. His second triumphant portrayal of King Lear in the past three years, this time for the Shakespeare Theatre Company in the nation's capital earned reviews heard around the world, with resulting offers for him to repeat that giant accomplishment in New York, Los Angeles and even Beijing. An accomplished pianist and composer, Mr. Keach composed the music for the film, Imbued (2009), directed by Rob Nilssen, a celebrated film festival favorite, in which Keach also starred. He has also completed composing the music for the Mike Hammer audio radio series, \"Encore For Murder\", written by Max Collins, directed by Carl Amari, and produced by Blackstone Audio. Mr. Keach began his film career in the late 1960's with _The Heart Is A Lonely Hunter_, followed by _The New Centurions_ with George C. Scott; Doc Holiday with Faye Dunaway in the film 'Doc' (1971); an over-the-hill boxer,Billy Tully in Fat City (1972); directed by John Huston, and The Long Riders (1980), which he co-produced and co-wrote with his brother, James Keach, directed by Walter Hill. On the lighter side, his characterization of Sgt. Stedenko in Cheech and Chong's Up in Smoke (1978), and the sequel, Nice Dreams (1981), gave a whole new generation a taste of Mr. Keach's comedic flair, which he also demonstrated in Robert Altman's Brewster McCloud (1970), playing the oldest living lecherous Wright Brother; and The Life and Times of Judge Roy Bean (1972) where he played a crazed albino out to kill Paul Newman. Historical roles have always attracted him. In movies he has played roles ranging from Martin Luther to Frank James. On television he has been Napoleon, Wilbur Wright, J. Robert Oppenheimer, Barabbas, Sam Houston, and Ernest Hemingway, for which he won a Golden Globe as Best Actor in a mini-series and was nominated for an Emmy in the same category. He played an eccentric painter, Mistral, in the Judith Krantz classic, Mistral's Daughter (1984), a northern spy in the civil war special, The Blue and the Gray (1982), more recently as the pirate Benjamin Hornigold in the Hallmark epic Blackbeard (2006). As a director, his production of Arthur Miller's Incident at Vichy (1973) for PBS was, according to Mr. Miller in his autobiography, Timebends, \"the most expressive production of that play he had seen.\" He won a Cine Golden Eagle Award for his work on the dramatic documentary, The Repeater, in which he starred and also wrote and directed. But it is perhaps the live theatre where Mr. Keach shines brightest. He began his professional career with the New York Shakespeare Festival in 1964, doubling as Marcellus and the Player King in a production of Hamlet directed by Joseph Papp and which featured Julie Harris as Ophelia. He rose to prominence in 1967 in the Off-Broadway political satire, MacBird, where the title role was a cross between Lyndon Johnson and Macbeth and for which he received the first of his three Obie awards. He played the title roles in Henry 5, Hamlet (which he played 3 times), Richard 3, Macbeth, and most recently as King Lear in Robert Falls' modern adaptation at Chicago's Goodman Theatre, which Charles Isherwood of the NY Times called \"terrific\" and \"a blistering modern-dress production that brings alive the morally disordered universe of the play with a ferocity unmatched by any other production I've seen.\" Mr. Keach's stage portrayals of Peer Gynt, Falstaff and Cyrano de Bergerac, and Hamlet caused the New York Times to dub him \"the finest American classical actor since John Barrymore.\" Mr. Keach's Broadway credits include his Broadway debut, Indians, where he played Buffalo Bill and was nominated for a Tony award as Best Actor. He starred in Ira Levin's Deathtrap, the Pulitzer Prize winning Kentucky Cycle (for which he won his first Helen Hayes award as Best Actor), the Rupert Holmes one-man thriller, Solitary Confinement, where Mr. Keach played no less than six roles, all unbeknownst to the audience until the end of the play. In the musical theatre, he starred in the national tour of Barnum, played the King in Camelot for Pittsburgh's Civic Light Opera, and the King in The King and I, which he also toured in Japan. He starred in the Jon Robin Baitz play, Ten Unknowns, at the Mark Taper Forum in 2003. The LA Times said: \"And then there's Keach. What a performance! How many actors can manage such thunder and such sweet pain. He's been away from the LA stage too long. Welcome back.\" In 2004, he starred as Scrooge in Boston's Trinity Rep musical production of A Christmas Carol; earlier in 2004, he starred as Phil Ochsner in Arthur Miller's last play Finishing The Picture, directed by Robert Falls at the Goodman Theatre. As a narrator his voice has been heard in countless documentaries; as the host for the Twilight Zone radio series; numerous books on tape, including the Short Stories of Ernest Hemingway. In the year 2000, he recorded a CD of all of Shakespeare's Sonnets. He recently recorded the voice of St. Paul for a new audio version of The New Testament:, The Word of Promise and Job for the Old Testament edition. He is the narrator on CNBC's new hit show, American Greed (2007), and recently narrated the award-winning documentary, The Pixar Story (2007). He has also reprised his role as Mike Hammer in the Blackstone audio series, the most recent being \"Encore for Murder\". A charter-member of LA Theatre Works, Mr. Keach recently played the title role in Bertolt Brecht's Galileo, recorded both for radio and CD. He was seen on CBS's hit show Two and a Half Men (2003) as the gay Dad of Charlie's fiance. Stacy Keach also believes strongly in 'giving back' and has been the Honorary Chair for the Cleft Palate Foundation for the past twenty-five years. He is also the national spokesman for the World Craniofacial organization. He has served on the Artist's Committee for the Kennedy Center Honors for two decades, is on the board of directors for Genesis at the Crossroads, a Chicago-based organization dedicated to bringing peoples of combatant cultures together through the shared artistic expressions of the visual and culinary arts, music, dance, and theater. He also serves on the artistic board for Washington DC's Shakespeare Theatre National Council, where he was also honored in 2000 with their prestigious Millennium Award for his contribution to classical theatre. Some years ago Hollywood honored him with a Celebrity Outreach Award for his work with charitable organizations. He has been the recipient of Lifetime Achievement Awards from Pacific Pioneer's Broadcasters, the San Diego Film Festival, the Pacific Palisades Film Festival, and The 2007 Oldenburg Film Festival in Germany. Later this year, he will be awarded the 2010 Lifetime Award from the St. Louis Film Festival. In 2008, he received the Mary Pickford Award for versatility in acting. Mr. Keach was a Fulbright scholar to the London Academy of Music and Dramatic Art, attended the University of California at Berkeley and the Yale Drama School. He has always been a star of the American stage, especially in Shakespearen roles such as Hamlet, Henry 5, Coriolanus, Falstaff, Macbeth, Richard 3, and most recently, King Lear. Of his many accomplishments, Mr. Keach claims that his greatest accomplishment is his family. He has been married to his beautiful wife Malgosia for twenty-five years, and they have two wonderful children, Shannon Keach (1988), and daughter Karolina Keach (1990).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMzEwODQ4Nl5BMl5BanBnXkFtZTYwMTA0NTQz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005078","name":"Stacy Keach","idIMDB":"nm0005078"},"actorId":"nm0005078","character":"Calvin Dion","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frederic Forrest","urlProfile":"http://www.imdb.com/name/nm0002078","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNDIyMDQwN15BMl5BanBnXkFtZTYwMzM5NzE1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 December 1936","placeOfBirth":" Waxahachie, Texas, USA","birthName":"Frederic Fenimore Forrest Jr.","height":"5' 10\" (1.78 m)","bio":"Frederic Forrest, the Oscar-nominated character actor, was born two days before Christmas Day 1936 in Waxahachie, Texas, the same home town as director Robert Benton. Forrest had long wanted to be an actor, but he was so nervous that he ran out of auditions for school plays. Later, at Texas Christian University, he took a minor in theater arts while majoring in radio and television studies. His parents opposed his aspirations as a thespian as it was a precarious existence, but he moved on to New York and studied with renowned acting teacher Sanford Meisner. He eventually became an observer at the Actors Studio, where he was tutored by Lee Strasberg. During this time, he supported himself as a page at the NBC Studios in Rockefeller Plaza. His theatrical debut was in the Off-Broadway production of \"Viet-Rock\", an anti-war play featuring music. He became part of avant-garde director Tom O'Horgan's stock company at La Mama, appearing in the infamous \"Futz\", among other productions. He made his uncredited debut in The Filthy Five (1968), a low-budget movie directed by sexploitation auteur Andy Milligan, but he racked up his first credit in O'Horgan's very bizarre screen adaptation of Futz (1969), a satire about a farmer who falls in love with a hog. After starring in the off-Broadway play \"Silhouettes\", Forrest moved with the production to Los Angeles, intent on breaking into movies. While the production ran for three months and was visited by agents bird-dogging new talent, Forrest got no offers and had to support himself as a pizza-baker after the show closed. Eventually, he began auditing classes at Actors Studio West, and director Stuart Millar saw him in a student showcase production of Clifford Odets' \"Watiting for Lefty\" and cast him in When the Legends Die (1972). He copped a 1973 Golden Globe nomination as \"Most Promising Newcomer - Male\" for the role, losing out to Edward Albert in Butterflies Are Free (1972). For the first time in his film acting career, Frederic Forrest looked like he was poised for stardom. His follow-up picture, the pitiful The Godfather (1972) rip-off The Don Is Dead (1973), did nothing for his career, although a small part in \"Godfather\" director Francis Ford Coppola's The Conversation (1974) would later pay dividends. Except for a small role in the disappointing The Missouri Breaks (1976) and his TV turn as Lee Harvey Oswald in CBS' Ruby and Oswald (1978), Forrest had little to show in the first part of his career. Coppola was about to change that. Playing \"Chef Hicks\" in Apocalypse Now (1979) garnered Forrest the best notices of his career, and he parlayed that into Academy Award and Golden Globe nominations as Best Supporting Actor for The Rose (1979), his second hit that year. He was named Best Supporting Actor by the National Society of Film Critics for both films, and once again he seemed poised on the verge of stardom. Like the first time, stardom did not come. His aspirations were to do quality work and play a romantic lead. \"I would like to not have to fit into somebody else's story and have my scenes cut because I'm too strong\", he told a journalist circa 1980. \"And next time, I'd like to get the girl instead of the horse\". He did get the romantic lead he pined for, but it was a case of \"Be careful what you wish for, as you might just get it\". Coppola, so instrumental in propelling Forrest into the first rank of character actors, cast him as the romantic lead in One from the Heart (1981), a picture that proved to be one of the great financial debacles of all time. It bankrupted Coppola's studio, American Zoetrope, and engendered a fierce backlash against the director and the film in Hollywood. Forrest and co-star Teri Garr were both egregiously miscast in Coppola's re-imagining of the musical due to the simple fact that neither could sing or dance and had no place in any kind of musical, traditional or re-imagined. Coppola reportedly never came out of \"Silverfish\", the Winnebago-like trailer he had transformed into a control center from which he directed the film via television monitors, a first in the industry. For his masterpieces The Godfather (1972), The Godfather: Part II (1974) and Apocalypse Now (1979), he had left the visuals in the very able hands of his cinematographers, Gordon Willis and Vittorio Storaro. Coppola was a first-rate screenwriter with a sure hand, eliciting performances from actors as notoriously difficult as Marlon Brando and Al Pacino, but by locking himself away from the set in a trailer to oversee the visual scope of his picture, there was little he seemingly could do to prevent the floundering of his two leads. More concerned with technology than his actors, he lost his touch. One from the Heart (1981) turned out to be a disaster and, except for one more lead in a Coppola-produced film, Wim Wenders' underwhelming Hammett (1982), Forrest's career as a leading man was through. In 1983, he played a supporting role in Valley Girl (1983) in an unmemorable performance, a role that could have been played by any actor, something one couldn't say about his \"Chef\" in Apocalypse Now (1979). Chef had been as essential to the success of the film as had Martin Sheen's Willard and Brando's Col. Kurtz. Increasingly, Forrest began appearing on television and, by 1987, was in the cast of the series 21 Jump Street (1987) on the new Fox TV network, lasting only one season before being ignominiously replaced by Steven Williams. In addition to an appearance in the mini-series Lonesome Dove (1989), Mr. Forrest's fine portrayal of \"Lomax\" in Die Kinder (1990), showed the ability which has been too often unrealized.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNDIyMDQwN15BMl5BanBnXkFtZTYwMzM5NzE1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002078","name":"Frederic Forrest","nicknames":["Daddy Freddy"],"idIMDB":"nm0002078"},"actorId":"nm0002078","character":"Russell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Margot Kidder","urlProfile":"http://www.imdb.com/name/nm0452288","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NDQ2MDI0OF5BMl5BanBnXkFtZTYwMTc1MzI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 October 1948","placeOfBirth":" Yellowknife, Northwest Territories, Canada","birthName":"Margaret Ruth Kidder","height":"5' 6\" (1.68 m)","bio":"Margot Kidder was born Margaret Ruth Kidder in Yellowknife, Northwest Territories, Canada, to Jocelyn Mary \"Jill\" (Wilson), a history teacher from British Columbia, and Kendall Kidder, a New Mexico-born mining engineer and explosives expert. Margot was a delightful child who took pride in everything she did. At an early age she became aware of the great emotions she felt towards expressing herself, and caught the acting bug. As a child she wrote in a diary that she wanted to become a movie star, and that one day it would happen, but she had to overcome something else first. She was aware that she was constantly facing mood swings, but wasn't aware why. At odd times she would try to kill herself - the first time was at age 14 - but the next day she would be just fine. Her father's hectic schedule and moving around so much didn't help matters, either, causing her to attend 11 schools in 12 years. Finally, in an attempt to help Margot with her troubles, her parents sent\" her to a boarding school, where she took part in school plays, such as Romeo and Juliet\", in which she played the lead. After graduation Margot moved to Los Angeles to start a film career. She found herself dealing with a lot of prejudice, and hotheads, but later found solace with a Canadian agent. This was when she got her first acting job, in the Norman Jewison film Gaily, Gaily (1969). This led to another starring role in Quackser Fortune Has a Cousin in the Bronx (1970), in which she co-starred with Gene Wilder. After some harsh words from the film's director, Margot temporarily left films to study acting in New York, doing television work to pay her bills, but when the money ran out, she decided it was time to make a second try at acting. When she arrived in Hollywood she met up at a screen test with actress Jennifer Salt, resulting in a friendship that still stands strong today. Margot and Jennifer moved into a lofty beach house and befriended other, then unknown, struggling filmmakers such as Martin Scorsese, Brian De Palma, Steven Spielberg and Susan Sarandon, among others. Late nights would see the hot, happening youngsters up until all hours talking around a fire about how they were all going to change the film industry. It was crazy living and within the Christmas season, Margot had become involved with De Palma, and as a Christmas present he gave her the script to his upcoming film Sisters (1972). Margot and Salt both had the leads in the film, and it was a huge critical success. The film made branded Margot as a major talent, and in the following years she starred in a string of critically acclaimed pictures, such as Black Christmas (1974), The Great Waldo Pepper (1975), 92 in the Shade (1975) - directed by Thomas McGuane, who was also her husband for a brief period - and a somewhat prophetic tale of self-resurrection, The Reincarnation of Peter Proud (1975). After three years of being a housewife, looking after her daughter Maggie and not working, Margot decided it was time to let her emotions take control and get back into acting. Once her marriage to McGuane was over she eyed a script that would change her life forever. Her new agent hooked her up with a little-known director named Richard Donner. He was going to be directing a film called Superman (1978), and she auditioned for and secured the leading female role of Lois Lane. That film and Superman II (1980) were to be filmed simultaneously. After the success of \"Superman\" she took on more intense roles, such as The Amityville Horror (1979) and Willie & Phil (1980). After that, Margot did numerous films, television and theater work throughout the 1980s, including Superman IV: The Quest for Peace (1987). When the 1990s erupted with the Gulf War, Margot found herself becoming involved in politics. She made a stir in the biz when she spoke out against the military for their actions in Kuwait. She also appeared in a cameo in Donner's Maverick (1994). In 1996, as she was preparing to write her autobiography, she began to become more and more paranoid. When her computer was infected with a virus, this gave her paranoia full rein, and she sank into bipolar disorder. She panicked, and the resulting psychological problems she created for herself resulted in her fantasizing that her first husband was going to kill her, so she left her home and faked her death, physically altering her appearance in the bargain. After an intervention took place, she got back on her feet and started the mental wellness campaign. Since then she has sustained her career in film, television, and theater, recently appearing in a Canadian stage production of \"The Vagina Monologues\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NDQ2MDI0OF5BMl5BanBnXkFtZTYwMTc1MzI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0452288","name":"Margot Kidder","nicknames":["Margie"],"idIMDB":"nm0452288"},"actorId":"nm0452288","character":"Margie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barry Primus","urlProfile":"http://www.imdb.com/name/nm0697587","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY4OGQ1NWEtMTRmYS00OWY4LTliNzktMWQwMTkwMTQ0ZmQ3XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 February 1938","placeOfBirth":" New York City, New York, USA","bio":"Barry Primus was born on February 16, 1938 in New York City, New York, USA. He is an actor and director, known for American Hustle (2013), New York, New York (1977) and Righteous Kill (2008). He is married to Julie Arenal. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY4OGQ1NWEtMTRmYS00OWY4LTliNzktMWQwMTkwMTQ0ZmQ3XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0697587","name":"Barry Primus","idIMDB":"nm0697587"},"actorId":"nm0697587","character":"Tony","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Romanus","urlProfile":"http://www.imdb.com/name/nm0739087","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI4NDkwNTk5Nl5BMl5BanBnXkFtZTYwODM5MTc3._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1943","placeOfBirth":" Barre, Vermont, USA","bio":"Richard Romanus was born on February 8, 1943 in Barre, Vermont, USA. He is an actor and writer, known for Mean Streets (1973), Heavy Metal (1981) and Point of No Return (1993). He has been married to Anthea Sylbert since August 11, 1985. He was previously married to Tina Romanus.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI4NDkwNTk5Nl5BMl5BanBnXkFtZTYwODM5MTc3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0739087","name":"Richard Romanus","idIMDB":"nm0739087"},"actorId":"nm0739087","character":"Carlo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Denny Miller","urlProfile":"http://www.imdb.com/name/nm0588225","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDBiZTQyMGEtZDg1Ni00Mjk3LTk2MTgtMzIzMWEwMmVkMTc4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1934","placeOfBirth":" Bloomington, Indiana, USA","birthName":"Dennis Linn Miller","height":"6' 4\" (1.93 m)","bio":"Denny Miller was born in Bloomington, Indiana, where his father, Ben Miller, was a physical education instructor at Indiana University. He and his brother, Kent, began playing basketball almost from the day they were born. The Miller family left Bloomington when Denny was in the fourth grade. He and his brother played basketball in Silver Spring, Maryland, and Baldwin, New York, before the family moved to Los Angeles. It was at University High School in Los Angeles where Denny and Kent came to the attention of coach John Wooden. They were given full-ride scholarships to UCLA. The Miller brothers played together at UCLA for one year, and their father joined the faculty of UCLA. In his senior year, while working as a furniture mover to pay for school, Denny was discovered on Sunset Boulevard by a talent agent, who signed him with MGM. His first role was a bit part in Some Came Running (1958), which was filmed in Madison, Indiana. Denny said, \"I was the only one who came running. I came running to tell Dean Martin that somebody was in town to shoot him!\" He became the first blond Tarzan in Tarzan, the Ape Man (1959)), a low-budget quickie that lifted most of its footage from earlier Johnny Weissmuller movies. MGM had him under contract for 20 months; in that time he worked 8 weeks as \"Tarzan\". After that he did guest spots on a number of TV series, finally becoming a regular on Wagon Train (1957) as Duke Shannon (his name was then Scott Miller). In 1965-66 he starred (as Denny again) with Juliet Prowse in Mona McCluskey (1965).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDBiZTQyMGEtZDg1Ni00Mjk3LTk2MTgtMzIzMWEwMmVkMTc4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0588225","name":"Denny Miller","idIMDB":"nm0588225"},"actorId":"nm0588225","character":"Rex","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clay Tanner","urlProfile":"http://www.imdb.com/name/nm0849623","urlPhoto":"","biography":{"dateOfBirth":"3 February 1931","placeOfBirth":" Clay, Indiana, USA","birthName":"Allen Honaker","bio":"Clay Tanner was born on February 3, 1931 in Clay, Indiana, USA as Allen Honaker. He was an actor, known for The Outlaw Josey Wales (1976), Race with the Devil (1975) and Lady Sings the Blues (1972). He died on December 22, 2002 in Hernando, Florida, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0849623","name":"Clay Tanner","idIMDB":"nm0849623"},"actorId":"nm0849623","character":"Bather","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Phillips","urlProfile":"http://www.imdb.com/name/nm0680732","urlPhoto":"","biography":{"dateOfBirth":"10 April 1925","placeOfBirth":" Chicago, Illinois, USA","height":"6' (1.83 m)","bio":"Robert Phillips was born on April 10, 1925 in Chicago, Illinois, USA. He is an actor, known for The Dirty Dozen (1967), The Killing of a Chinese Bookie (1976) and The Killers (1964).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0680732","name":"Robert Phillips","idIMDB":"nm0680732"},"actorId":"nm0680732","character":"Gino","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Owen Orr","urlProfile":"http://www.imdb.com/name/nm0650592","urlPhoto":"","biography":{"bio":"Owen Orr is an actor, known for The Hired Hand (1971), Werewolves on Wheels (1971) and The Shadow Riders (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0650592","name":"Owen Orr","idIMDB":"nm0650592"},"actorId":"nm0650592","character":"Cannery Foreman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Starrett","urlProfile":"http://www.imdb.com/name/nm0823630","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNzkzNDQ0Ml5BMl5BanBnXkFtZTcwNTQ3NzkxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 November 1936","placeOfBirth":" Refugio, Texas, USA","birthName":"Claude Ennis Starrett Jr.","height":"5' 10\" (1.78 m)","bio":"Jack Starrett was a superbly talented and versatile actor and director who specialized in making hugely enjoyable down-'n'-dirty low-budget drive-in exploitation pictures. Starrett was born on November 2, 1936, in Refugio, TX. He attended San Marcos Academy in the 1940s and the 1950s. He made his acting debut as \"Coach Jennings\" in Like Father, Like Son (1961) and his debut as a director with two superior biker features starring legendary B-movie tough guy William Smith: Run, Angel, Run! (1969) and Platinum Pussycat (1968). The latter movie proved to be highly influential to subsequent action films made in the 1980s; its \"bring the boys back home\" Vietnam prisoners of war rescue operation premise was reused in such 1980s features as Uncommon Valor (1983), Missing in Action (1984) and Rambo: First Blood Part II (1985). His follow-up films Cry Blood, Apache (1970) and The Strange Vengeance of Rosalie (1972) were both regrettably mediocre, but Starrett bounced back with the exciting Jim Brown blaxploitation vehicle Slaughter (1972) and the delightful Cleopatra Jones (1973). The Gravy Train (1974) was an amiable tongue-in-cheek crime caper romp, while the terrific devil worship/car chase/horror/action winner Race with the Devil (1975) was Starrett's biggest ever drive-in hit and one of his most well-regarded movies. A Small Town in Texas (1976) was a solid entry in the popular redneck exploitation genre that was hot in the 70s. Summer Heat (1982) rates as one of his most atypical and underrated films; it's a really sweet and low-key character study of two likable cowpokes. In addition to his film work, Starrett also directed episodes of such TV shows as Hill Street Blues (1981), The A-Team (1983), The Dukes of Hazzard (1979), Knight Rider (1982), Planet of the Apes (1974) and Starsky and Hutch (1975). Big and burly, with a rough, ruddy complexion, thinning hair, a thick, furry mustache and a deep, booming, resonant rumble of a gravely voice, Jack Starrett had an extremely strong and commanding screen presence that he put to exceptionally fine use as an actor. Starrett was hilarious as the stuttering old-timer \"Gabby Johnson\"--a take-off on iconic western sidekick George 'Gabby' Hayes--in Blazing Saddles (1974) and gave an outstanding performance as \"Galt\", the mean small-town deputy who ruthlessly antagonizes Sylvester Stallone in the fantastic First Blood (1982). Starrett was likewise memorable as strict factory foreman \"Swick\" in The River (1984), and in addition often took small roles in his own pictures. He was married to soap opera actress Valerie Starrett. Their daughter, Jennifer Starrett, was also an actress. Alas, Jack Starrett had problems with alcoholism, which led to his tragic and untimely death at age 52 from kidney failure on March 27, 1989.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNzkzNDQ0Ml5BMl5BanBnXkFtZTcwNTQ3NzkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0823630","name":"Jack Starrett","idIMDB":"nm0823630"},"actorId":"nm0823630","character":"Gentleman Rancher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Francesca Bellini","urlProfile":"http://www.imdb.com/name/nm0069037","urlPhoto":"","biography":{"dateOfBirth":"6 November 1936","placeOfBirth":" New York City, New York, USA","birthName":"Francesca Angela Bellini","bio":"Francesca Bellini was born on November 6, 1936 in New York City, New York, USA as Francesca Angela Bellini. She is known for her work on Un chef de rayon explosif (1963), The Carpetbaggers (1964) and Cinderella (1965).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0069037","name":"Francesca Bellini","idIMDB":"nm0069037"},"actorId":"nm0069037","character":"Receptionist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Al Hansen","urlProfile":"http://www.imdb.com/name/nm0360637","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNDQyMDMyOV5BMl5BanBnXkFtZTYwNTI1Njcy._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Al Hansen is an actor and writer, known for Wayne's World 2 (1993), The Hearse (1980) and Finding McQueen (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNDQyMDMyOV5BMl5BanBnXkFtZTYwNTI1Njcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0360637","name":"Al Hansen","idIMDB":"nm0360637"},"actorId":"nm0360637","character":"Police Captain","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe Tornatore","urlProfile":"http://www.imdb.com/name/nm0868149","urlPhoto":"","biography":{"dateOfBirth":"18 August 1934","placeOfBirth":" New York, New York, USA","birthName":"Joseph Anthony Tornatore","bio":"Joe Tornatore was born on August 18, 1934 in New York, New York, USA as Joseph Anthony Tornatore. He is an actor and director, known for The Sting (1973), The Champ (1979) and Grotesque (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0868149","name":"Joe Tornatore","idIMDB":"nm0868149"},"actorId":"nm0868149","character":"Sergeant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mary L. Honaker","urlProfile":"http://www.imdb.com/name/nm0393071","urlPhoto":"","biography":{"bio":"Mary L. Honaker is an actress, known for The Gravy Train (1974).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0393071","name":"Mary L. Honaker","idIMDB":"nm0393071"},"actorId":"nm0393071","character":"Mother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Don Edwards","urlProfile":"http://www.imdb.com/name/nm7909861","urlPhoto":"","biography":{"bio":"Don Edwards is an actor, known for The Gravy Train (1974).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7909861","name":"Don Edwards","idIMDB":"nm7909861"},"actorId":"nm7909861","character":"Driver","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0071575","urlIMDB":"http://www.imdb.com/title/tt0071575","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"05","month":"11","year":"1973","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 34 min (94 min)"],"soundMix":["Mono"],"color":["Color (Eastmancolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.9","filmingLocations":[{"location":"Washington, District of Columbia, USA"}],"rated":"R","awards":[],"votes":"268","type":"Movie","companyCreditsSimple":[{"idCompany":"co0060242","name":"Tomorrow Entertainment"}],"keywords":{"keywords":["west virginia","robbery","brother","armored car","fistfight","kicked in the groin","building collapse","wrecking ball","shot in the stomach","chicken","electrocuted","electrocution","man in bathtub","kitchen","character says i love you","undershirt","disguise","man crying","police uniform","police car","naked man","held at gunpoint","man forced to strip","forced to strip","washington monument","naked massage","white house","capitol building","washington dc","massage","bare butt","massage parlor","cadillac","coal mine","mustache","hairy chest","bare chested male","bare breasts","brother brother relationship","white briefs","briefs","boxer shorts","male underwear","male rear nudity","male nudity","shower room","men's locker room","locker room","shoveling","shovel","canning factory","factory","television","violence","hold up","criminal"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:50:50"}}