{"data":{"movies":[{"title":"The Sin of Madelon Claudet","originalTitle":"","year":"1931","releaseDate":"19311024","directors":[{"name":"Edgar Selwyn","id":"nm0783629"}],"writers":[{"name":"Edward Knoblock","id":"nm0461241"},{"name":"Charles MacArthur","id":"nm0531269"}],"runtime":"75 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1ODU3NTM3Ml5BMl5BanBnXkFtZTcwNDQyMzcxMQ@@._V1.jpg","countries":["USA"],"languages":["English","French"],"genres":["Drama"],"plot":"French country girl Madelon falls for artist Larry, who leaves her after she becomes pregnant. She finds help from jewel thief Carlo, but he commits suicide when the police try to arrest him. Madelon is arrested and receives a ten year term in prison for assisting him in his profession. To support her son, who does not know that she's been in prison, she becomes a street walker, allowing him to attend medical school.","simplePlot":"Out of jail for a crime she did not commit, Madelon turns to prostitution and thievery to send her illegitimate son to medical school.","actors":[{"actorName":"Helen Hayes","urlProfile":"http://www.imdb.com/name/nm0371040","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwMDgxODAzNF5BMl5BanBnXkFtZTYwMDczNDM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1900","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Helen Hayes Brown","height":"5' (1.52 m)","bio":"Known as \"The First lady of the American Theater\", Helen Hayes had a legendary career on stage and in films and television that spanned over eighty years. Hayes was born in Washington, D.C., to Catherine Estelle \"Essie\" Hayes, an actress who worked in touring companies, and Francis van Arnum Brown, a clerk and salesman. Her maternal grandparents were Irish. A child actress in the first decade of the 20th century, by the time she turned twenty in 1920 she was well on her way to a landmark career on the American stage, becoming perhaps the greatest female star of the theatre during the 1930s and 1940s. She made a handful of scattered films during the silent era and in 1931 was signed to MGM with great fanfare to begin a career starring in films. Her first three films, 'Arrowsmith', 'The Sin of Madelon Claudet', and 'A Farewell to Arms (1932)', were great hits and she would win the 1932 Oscar for Best Actress for her work in Madelon Claudet. Alas, her lack of screen glamour worked against her becoming a box office star during the golden era of Hollywood, and her subsequent films were often not well received by critics. Within four years she had abandoned the screen and returned to the stage for the greatest success of her career, \"Victoria Regina\", which ran for three years starting in 1935. Helen Hayes returned to motion pictures with a few featured roles in 1950s films and frequently appeared on television. In 1970, she made a screen comeback in 'Airport' (1970), a role originally offered to Claudette Colbert, who declined it, earning Hayes her second Oscar, this time for Best Supporting Actress. Helen Hayes retired from the stage in 1971 but enjoyed enormous fame and popularity over the next fifteen years with many roles in motion pictures and television productions, retiring in 1985 after starring in the TV film 'Murder With Mirrors'.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwMDgxODAzNF5BMl5BanBnXkFtZTYwMDczNDM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0371040","name":"Helen Hayes","nicknames":["First Lady of the American Theater"],"idIMDB":"nm0371040"},"actorId":"nm0371040","character":"Madelon","urlCharacter":"http://www.imdb.com/character/ch0170293","main":true},{"actorName":"Lewis Stone","urlProfile":"http://www.imdb.com/name/nm0832011","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMDQyMjIzMl5BMl5BanBnXkFtZTgwNzc3MTI1MzE@._V1._CR97,133,560,741_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 November 1879","placeOfBirth":" Worcester, Massachusetts, USA","birthName":"Lewis Shepard Stone","height":"5' 10¾\" (1.8 m)","bio":"By the time that he was 20, Lewis Stone had turned prematurely grey. He enlisted to fight in the Spanish American War and when he returned, he returned to be a writer. This turned to acting and he began to appear in films during the middle teens. His career was again interrupted by war as he served in the cavalry during World War I. After the war, he returned to films and quickly graduated to lead roles. With his distinguished look and grey hair, he was able to play the roles of well mannered romantic men. In 1921, Lewis starred in Don't Neglect Your Wife (1921). In the next year, he starred with Alice Terry, who played the heroine, and Ramon Novarro in The Prisoner of Zenda (1922) and Scaramouche (1923). In 1924, Metro merged into the new MGM where Lewis remained for the rest of his career. He was busy over the next few years and garnered an Academy Award nomination for The Patriot (1928). In 1928, he appeared in the first of a series of pictures with Greta Garbo. In A Woman of Affairs (1928) he played the older doctor, a friend of the family. But two years later in Romance (1930), he played her lover. Lewis made the transition from silent to sound with The Trial of Mary Dugan (1929), which starred Norma Shearer. Sound did not cause Lewis any problems and he continued to be busy with his roles as the distinguished lead. The Big House (1930) was highly successful for MGM and he appeared in other popular movies such as The Phantom of Paris (1931) with John Gilbert and Red-Headed Woman (1932) with Jean Harlow. He appeared with Garbo in Inspiration (1931), Mata Hari (1931), Grand Hotel (1932) and Queen Christina (1933). In the late 30s he took on a role for which he was long remembered - the role of Judge James Hardy who had a son named Andy. Judge Hardy was the father audiences wanted in the late 30s early 40s. He was kind, intellectual, fair and as patient as he had to be with Andy, played by Mickey Rooney. This series occupied most of his screen time until it ended and he did slow down during the late 40s. In the 50s he continued to appear in a number of pictures including remakes of the two he had made 30 years before with Alice Terry. He suffered a heart attack and died in 1953 after appearing in over 200 films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMDQyMjIzMl5BMl5BanBnXkFtZTgwNzc3MTI1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0832011","name":"Lewis Stone","nicknames":["Lew"],"idIMDB":"nm0832011"},"actorId":"nm0832011","character":"Carlo Boretti","urlCharacter":"http://www.imdb.com/character/ch0170295","main":true},{"actorName":"Neil Hamilton","urlProfile":"http://www.imdb.com/name/nm0358076","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY0ODczOTQ4MF5BMl5BanBnXkFtZTcwMjM5NTAxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1899","placeOfBirth":" Lynn, Massachusetts, USA","birthName":"James Neil Hamilton","height":"5' 11\" (1.8 m)","bio":"Neil Hamilton's show business career began when he secured a job as a shirt model in magazine ads. He became interested in acting and joined several stock companies. He got his first film role in 1918, but received his big break from D.W. Griffith in The White Rose (1923). After performing in several more Griffith films, Hamilton was signed by Paramount in the late 1920s and soon became one of that studio's most popular leading men. His rugged good looks and sophisticated demeanor kept him steadily employed, and he worked for just about every studio in Hollywood, from glittering MGM to rock-bottom PRC. Hamilton worked steadily over the years, and grew gracefully into mature supporting parts. He is probably best known to modern-day audiences, however, as Police Commissioner Gordon in the TV series Batman (1966).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY0ODczOTQ4MF5BMl5BanBnXkFtZTcwMjM5NTAxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0358076","name":"Neil Hamilton","idIMDB":"nm0358076"},"actorId":"nm0358076","character":"Larry","urlCharacter":"http://www.imdb.com/character/ch0170296","main":true},{"actorName":"Robert Young","urlProfile":"http://www.imdb.com/name/nm0001870","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxODA0OTY4MF5BMl5BanBnXkFtZTYwMzU3NzI2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1907","placeOfBirth":" Chicago, Illinois, USA","birthName":"Robert George Young","height":"6' (1.83 m)","bio":"Quiet, soft-spoken Robert grew up in California and had some stage experience with the Pasadena Playhouse before entering films in 1931. His movie career consisted of playing characters who were charming, good-looking--and bland. In fact, his screen image was such that he usually never got the girl. Louis B. Mayer would say, \"He has no sex appeal,\" but he had a work ethic that prepared him for every role that he played. And he did play in as many as eleven films per year for a decade starting with The Black Camel (1931). He was notable as the spy in Alfred Hitchcock's Secret Agent (1936), but the '40s was the decade in which he was to have most of his best roles. These included Northwest Passage (1940); Western Union (1941); and H.M. Pulham, Esq. (1941). Good roles followed, from the husband of Dorothy McGuirein Claudia (1943) to the detective in Crossfire (1947), but they were becoming scarce. In 1949, Robert started a radio show called \"Father Knows Best\" wherein he played Jim Anderson, an average father with average situations--a role which was tailor-made for him. Basically retiring from films, he starred in this program for five years on radio before it went to television in 1954. After a slight falter in the ratings and a switch from CBS to NBC, it became a mainstay of television until it was canceled in 1960. He continued making guest appearances on various television shows and working in television movies. In 1969, he starred as Dr. Marcus Welby in the TV movie Marcus Welby, M.D.: A Matter of Humanities (1969). The Marcus Welby series that followed ran from 1969 through 1976 and featured James Brolin as his assistant, Dr. Steven Kiley--the doc with the bike. After the series ended, Robert, now in his seventies, finally licked his 30-year battle with alcohol and occasionally appeared in television movies through the 1980s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxODA0OTY4MF5BMl5BanBnXkFtZTYwMzU3NzI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001870","name":"Robert Young","idIMDB":"nm0001870"},"actorId":"nm0001870","character":"Dr. Claudet","urlCharacter":"http://www.imdb.com/character/ch0503602","main":true},{"actorName":"Cliff Edwards","urlProfile":"http://www.imdb.com/name/nm0249893","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjU4MjE4OF5BMl5BanBnXkFtZTYwOTgwMDY2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 June 1895","placeOfBirth":" Hannibal, Missouri, USA","height":"5' 5½\" (1.66 m)","bio":"Becoming popular with playing the ukulele, his unique singing and supplying the voice of animated movies, Cliff Edwards was one of the most popular singers in America. Born in Hannibal, Missouri, Edwards left school at the age of 14, moved to St. Louis, and started to work as a singer in saloons. Edwards then taught himself to play the ukulele. He got his nickname, \"Ukelele Ike\", from a club owner who couldn't remember his name. Entering in the vaudeville circuit, he finally made it big. When entering into movies, one of his first movies he made was his most noticeable: The Hollywood Revue of 1929 (1929). Eleven years later, he was immortalized in Disney's Pinocchio (1940).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjU4MjE4OF5BMl5BanBnXkFtZTYwOTgwMDY2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0249893","name":"Cliff Edwards","nicknames":["Ukulele Ike"],"idIMDB":"nm0249893"},"actorId":"nm0249893","character":"Victor","urlCharacter":"http://www.imdb.com/character/ch0170297","main":true},{"actorName":"Jean Hersholt","urlProfile":"http://www.imdb.com/name/nm0380965","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MDE3NjAxMl5BMl5BanBnXkFtZTcwMjExMDExOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 July 1886","placeOfBirth":" Copenhagen, Denmark","birthName":"Jean Buron Hersholt","height":"5' 11\" (1.8 m)","bio":"If ever there was a Great Dane in Hollywood it was Jean Hersholt - and one of its great hearts as well. He was from a well-known Danish stage and entertainment family that had toured throughout Europe performing with young Jean as an essential cast member. He graduated from the Copenhagen Art School and continued expanding his stage experience and evidently decided early that he wanted to work in films. He did just two very early (1906) silent films in Germany. Hersholt emigrated from Denmark to the US while still a young man in 1913. Like many another European he came to America to seek further opportunities. Unlike many other European actors who appeared on Broadway in their early American careers, Hersholt never trod The Great White Way. He moved on to Hollywood in 1914 where the future of silent movies had taken the lead. He started as a movie extra then progressed into small feature player roles from 1915 through 1917. For that latter year he had no less than 17 bit parts. By the 1920s his roles were substantial feature pieces, but most of these were as villains - in fact, a concoction of really vile characters. His theater experience serving him well, he played them so well that he much sought after by directors. Several of his 1920s films were landmarks of the silent era, an early one being The Four Horsemen of the Apocalypse (1921) which helped propel Rudolf Valentino into the stellar heights. Hersholt became popular and well paid. And certainly his signature silent role was the lead character of Marcus Schouler in the Erich von Stroheim great film Greed (1924), based on the novel McTeague. Stroheim, who spent far more time in front of the camera as an actor, was already well know as a task master and perfectionist director. He went through 42 reels of film for the picture - a numbing nine hours of screen time (shown only once at that length in a private studio screening). He cut the film to five hours, but it was further whittled to a bit over two for release, causing Stroheim to quip bitterly of the editor, \"The only thing he had on his mind was his hat!\" The powerful film was still there, but the massive editing resulted in whole roles disappearing, not to mention some telltale continuity. Stroheim's need for realism resulted in the climax of the movie to be shot in Death Valley. Still hot in the fall time, Hersholt endured like a veteran but required a hospital stay after sweating away 27 pounds. Fortunately into the later 1920s Hersholt's roles expanded into a more realistic balance of characters-more virtuous roles - but still some shady fellows and especially the unsuspected, and thus surprising, guilty party in the ever popular murder mysteries. He worked for Samuel Goldwyn for about a year (1923-1924), for Paramount from 1927 through 1929, and several other studios during the period. By the end of the silent era, including those early primitive part mono features with small bits of audio music, sound effects, or dialog, Hersholt was a tried veteran of 75 films. His first all mono sound film was The Climax (1930) and despite a Germanic accent, he had a pleasant, mellow voice and a camera friendly presence that ensured him continued success. The variety ran the gamut from a sturdy supporting part in Grand Hotel (1932), to supporting Boris Karloff and a pretty hot Myrna Loy in The Mask of Fu Manchu (1932), and doing the same in Dinner at Eight (1933). Busy with nine movies in 1930, he also moved into people's living rooms on radio as well during that year. Of course, for some time Hersholt was a mature actor-simply meaning he had many secondary roles as doctors and professors and nobles of many sorts and increasingly he appeared as benign fatherly types. Father roles of the 20s continued into the 30s - augmented with grandfather roles as well. He was the father of Sonja Henie in that charismatic champion ice skater's first Hollywood film One in a Million (1936), and he is perhaps best remembered as the embittered but deeply caring grandfather of Shirley Temple in the beloved Heidi (1937). But it was another role as a doctor that would provide a continuing vehicle for Hersholt and something of a fateful direction for the actor. The mid-30s were abuzz with the births of the Dionne Quintuplets in Canada. Hollywood jumped on it with usual alacrity, highlighting the story and the officiating obstetrician, Dr. Dafoe, who was translated into Dr. John Luke, in The Country Doctor (1936). Hersholt brought the right ingredients to the part of Luke and two years later a sequel followed, Five of a Kind (1938). Hersholt thought the character good medicine all round and was enthusiastic about a series of movies, but Dafoe himself blocked this idea. Nevertheless, in 1937 Hersholt had already germinated a new radio series to continue portraying a dedicated and kindly small town doctor. For a character name Hersholt turned to his most beloved author, his countryman, literary light Hans Christian Andersen, for a name-Dr. Christian. It was a hit and, and he convinced RKO Radio Pictures to bankroll a series of six Dr. Christian films (1939-41). These latter and a few other films would mark the end of Hersholt's film career, but he was so very busy otherwise. His familiarity with Andersen was a scholarly avocation and labor of love, furthered by enthusiastic collecting of a library of important Andersen editions and related bibliography (which would later go to the Library of Congress). His English translation (see Trivia below) of the Andersen corpus of fairy tales (including his addition of several other Andersen stories from the author's private papers) remains perhaps the most comprehensive and best effort-even more so for Hersholt personal interpretation of Andersen. Hersholt would also write several articles about Andersen and edit The Andersen-Scudder-Letters (1948). Among other literary pursuits Hersholt also co-wrote a novel based on his Dr. Christian character. It was in Hersholt's generous nature to give back something in gratitude for the acting career afforded him in Hollywood. His payment was rich indeed: the Motion Picture Relief Fund, the retirement home and hospital inspired by it and generated from it (see Trivia below), and the great charitable work that Hersholt would perform were paid back with two Academy Awards, the second after his tenure as president of the Academy. These special honors would be the seed of the Jean Hersholt Humanitarian Award (see Trivia below). But in 1956 Hersholt was dying of cancer - and yet that would not stop him from one more good turn. His beloved Dr. Christian character was going to TV (produced by the Ziv Studios), and he was asked to symbolically pass the baton to the new Dr. Christian, Macdonald Carey. With a tremendous effort, Hersholt, now withered to 95 pounds braved the first episode shooting, capping his life with one last magnificent example of his humanity.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MDE3NjAxMl5BMl5BanBnXkFtZTcwMjExMDExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0380965","name":"Jean Hersholt","idIMDB":"nm0380965"},"actorId":"nm0380965","character":"Dr. Dulac","urlCharacter":"http://www.imdb.com/character/ch0170300","main":true},{"actorName":"Marie Prevost","urlProfile":"http://www.imdb.com/name/nm0696679","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0OTU0NTQ5M15BMl5BanBnXkFtZTgwMzI0OTg0MzE@._V1._CR139,182,723,959_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 November 1898","placeOfBirth":" Sarnia, Ontario, Canada","birthName":"Mary Bickford Dunn","height":"5' (1.52 m)","bio":"Marie Prevost was born Mary Bickford Dunn in Sarnia, Ontario, Canada, on November 8, 1898. She broke into films when she was 18 years old in Unto Those Who Sin (1916). Finding work in films was difficult in the early days, just as it is today. Marie found herself doing odd jobs until 1917, when she made another film, Secrets of a Beauty Parlor (1917). After filming was completed, Marie found herself unemployed again and went back to scraping around for a living. She kept going to casting calls, but it wasn't until 1919 when she landed a role in Uncle Tom Without a Cabin (1919). Finally, in 1921, movie moguls discovered her talent and began casting her in a number of roles. She appeared in four films that year and an additional six in 1922. Marie seemed to be on a roll. She stayed busy through the balance of the 1920s in a number of films, mostly comedies. As a matter of fact, she would continue making films until 1933, when her appeal began to fade. She made no films in 1934 and precious few after that. With the advent of sound her thick New England accent didn't lend itself well to the \"demon microphone\", despite her beauty. Her depression about her career--or lack of it--drove her to alcohol, and she died on January 23, 1937, in Hollywood, of a combination of alcoholism and malnutrition, virtually broke and living in a dilapidated apartment. She never saw the release, in 1938, of her final film appearance: Ten Laps to Go (1936). She was 38 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0OTU0NTQ5M15BMl5BanBnXkFtZTgwMzI0OTg0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0696679","name":"Marie Prevost","idIMDB":"nm0696679"},"actorId":"nm0696679","character":"Rosalie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karen Morley","urlProfile":"http://www.imdb.com/name/nm0605904","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGYwZWI2NDktOWMxNC00ZDUzLWI3NjItYjEzNjdiODg2NmU1L2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1909","placeOfBirth":" Ottumwa, Iowa, USA","birthName":"Mildred Linton","bio":"Born Mildred Linton in Ottumwa, Iowa on December 12, 1909, Karen Morley was adopted by a well-to-do family who moved to Los Angeles in the mid-1920s. She enrolled at Hollywood High School and studied for a career in medicine at UCLA, but a class in theater changed her career ambitions. After studying at Pasadena Playhouse, she was signed by Fox Studios and her big chance came when producer Howard Hughes selected her to play the blond moll in the 1932 crime epic, Scarface (1932), Morley was put on a contract by MGM and starred in such early 1930s movies as Mata Hari (1931) (with Greta Garbo), Arsène Lupin (1932) (with John Barrymore), Dinner at Eight (1933) (with Jean Harlow), as well as films with Lionel Barrymore, Wallace Beery and Boris Karloff. In 1934, Morley left MGM after arguments about her roles and her private life, including her intention to start a family and her marriage to director Charles Vidor. She continued working as a freelance performer, appearing in King Vidor's Our Daily Bread (1934), Michael Curtiz' Black Fury (1935) and Pride and Prejudice (1940). In 1947, her screen career came to a halt when she testified before the House Committee on Un-American Activities and refused to answer questions about her possible enrollment in the Communist Party. Afterward, she continued promoting left-wing causes and married actor Lloyd Gough. In 1954, she ran unsuccessfully as a New York lieutenant governor candidate for the American Labor Party. Morley died March 8, 2003 at the Motion Picture Country House in Woodland Hills.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGYwZWI2NDktOWMxNC00ZDUzLWI3NjItYjEzNjdiODg2NmU1L2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0605904","name":"Karen Morley","idIMDB":"nm0605904"},"actorId":"nm0605904","character":"Alice","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Winninger","urlProfile":"http://www.imdb.com/name/nm0935415","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjZmOTEzOGEtOWRjMS00NGM2LWI4OGMtODcyOTM5NDliYTg1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1884","placeOfBirth":" Athens, Wisconsin, USA","height":"5' 6\" (1.68 m)","bio":"Short, chubby-framed, twinkle-eyed, ever-huggable Charles Winninger was a veteran vaudevillian by the time he arrived in talking films. Born in a trunk to show biz folk in Athens, Wisconsin, on May 26, 1884, he was initially christened Karl Winninger. He left school while quite young (age 8) to join and tour with his parent's vaudeville family act which was called Winninger Family Concert Co. Upon his parents' retirement, he and his five brothers went off to play in various stock and repertory companies. On film Charlie found an \"in\" with silent comedy shorts between 1915-1916 but never truly settled into the movie business until the advent of sound. In the meantime Broadway made great use of his musical comedy talents, marking his debut with \"The Yankee Girl\" in 1910 which also featured actress (and later stage star) Blanche Ring. He married Blanche in 1912 and the couple went on to star together quite frequently in vaudeville and on Broadway, including the musical \"When Claudia Smiles\" (1914) in which Blanche played the title role. Throughout the 1920s there were plenty of roles for Charlie on the Great White Way including a stint with the Ziegfeld Follies (1920), several Winter Garden productions, and in such musical comedy showcases as \"The Broadway Whirl\" (1921) (with Blanche), \"The Good Old Days\" (1923), \"No, No, Nanette\" (1925) and \"Yes, Yes, Yvette\" (1927). His most significant contribution was originating the role of beloved Cap'n Andy in \"Showboat\" (1927). Playing the Kern/Hammerstein musical for two years straight, he eagerly returned to the role on Broadway in 1932. With the success of \"Show Boat,\" Hollywood started taking more of an interest in the grey-haired song-and-dance man for character roles. Such early talking movies included the slapstick comedy Soup to Nuts (1930) with Ted Healy and The Three Stooges. Though Charlie was known for adding his immeasurable touch to the comedy genre (Flying High (1931) and Woman Chases Man (1937)), he was also a warm-hearted presence in heavier pictures as well, including the melodramas The Bad Sister (1931) with Bette Davis and The Sin of Madelon Claudet (1931) with Helen Hayes, and rugged adventures Gun Smoke (1931) and White Fang (1936). Although he did not play his famous stage role in the 1929 version, Charlie was thankfully able to preserve his beloved Cap'n Andy to film in the superb Irene Dunne/Allan Jones remake of Show Boat (1936). He became so associated with the riverboat captain that he was asked to create several variations of the character on radio. Charlie was relied upon for his benign, errant dads, old-theater entertainers, lovable drunks and other rather wanderlust types in film, characters that usually represented old-fashioned common sense or mores. He was quite entertaining in such classics as Nothing Sacred (1937), Three Smart Girls (1936) and Destry Rides Again (1939). In the 1940s he brightened up a number of MGM comedies and musicals including Babes in Arms (1939), Little Nellie Kelly (1940), Ziegfeld Girl (1941), When Ladies Meet (1941), Broadway Rhythm (1944)_ and Living in a Big Way (1947). One of his last important roles was playing Will Rogers' Judge Priest role in director John Ford's film The Sun Shines Bright (1953), his only leading film role. He and wife Blanche never appeared together in a film although Blanche did play herself in the film If I Had My Way (1940), a film that featured Charlie. His Broadway swan song was in \"Music in the Air\" in 1951 and his final film occurred about a decade later with Raymie (1960). He also played Santa Claus in the hour-long entertainment The Miracle of the White Reindeer (1960) that same year. TV roles dominated much of his work in the 50s. On the one-season The Charles Farrell Show (1956) he played the star's dear old dad. Divorced from wife Blanche in 1951, Charlie subsequently married stage actress-turned-novelist and screenwriter Gertrude Walker whom he originally met on Broadway when he returned to \"Show Boat\" in 1932 (Gertrude played the role of Lottie). Retired for many years, Charlie died in 1969 following an extended illness at the age of 84.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjZmOTEzOGEtOWRjMS00NGM2LWI4OGMtODcyOTM5NDliYTg1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0935415","name":"Charles Winninger","idIMDB":"nm0935415"},"actorId":"nm0935415","character":"Photographer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alan Hale","urlProfile":"http://www.imdb.com/name/nm0002118","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0ODAzMTc1MTheQTJeQWpwZ15BbWU3MDkxNjI2MDg@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1892","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Rufus Edward MacKahan","height":"6' 2\" (1.88 m)","bio":"Alan Hale decided on a film career after his attempt at becoming an opera singer didn't pan out. He quickly became much in demand as a supporting actor, starred in several films for Cecil B. DeMille and directed others for him. With the advent of sound Hale played leads in a few films, but soon settled down into a career as one of the busiest character actors in the business. He was one of the featured members of what became known as the \"Warner Brothers Stock Co.\", a corps of character actors and actresses who appeared in scores of Warner Bros. films of the 1930s and 1940s. Hale's best known role is probably in The Adventures of Robin Hood (1938), one of several films he made with his friend Errol Flynn, in which he played Little John, a role he played in two other films - Robin Hood (1922) and Rogues of Sherwood Forest (1950).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0ODAzMTc1MTheQTJeQWpwZ15BbWU3MDkxNjI2MDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002118","name":"Alan Hale","idIMDB":"nm0002118"},"actorId":"nm0002118","character":"Hubert","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Halliwell Hobbes","urlProfile":"http://www.imdb.com/name/nm0387561","urlPhoto":"","biography":{"dateOfBirth":"16 November 1877","placeOfBirth":" Stratford-on-Avon, Warwickshire, England, UK","birthName":"Herbert Halliwell Hobbes","height":"5' 8½\" (1.74 m)","bio":"Born at Shakespeare's birthplace, Stratford-on-Avon, Halliwell Hobbes could perhaps not aspire to anything else but to be an actor. He made his stage debut in 1898 playing Shakespearean repertory with the famous acting company of Sir Frank Benson throughout England. Among others he played opposite Mrs. Patrick Campbell and Ellen Terry. Hobbes came to the American and Broadway as early as 1906, doing performing and some directing until early 1929 when he came to Hollywood as an elderly actor to launch a long career of memorable character roles. In those first years he seemed to be either a lord or a butler. But by 1931 he was much in demand, lending his distinctive and dignified nasal voice to nearly ten films per year through most of the 1930s. Moving from one studio to another, he was doctors, diplomats, more lords, and some very memorable clerics-especially the staid archbishop reduced to laughter in The Prince and the Pauper (1937). The roles were scarcer through the 1940s, but he was back on Broadway by mid 1940 playing Capulet in \"Romeo and Juliet.\" Still that distinctive voice graced over 100 films by 1949. He turned to the richly diverse American TV playhouse format by 1950 and continued with roles through the decade along with a continued presence on Broadway until late 1955. Although he was sometimes uncredited in films, his roles were no less a recorded legacy of a dedicated acting talent.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0387561","name":"Halliwell Hobbes","idIMDB":"nm0387561"},"actorId":"nm0387561","character":"Roget","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lennox Pawle","urlProfile":"http://www.imdb.com/name/nm0668015","urlPhoto":"","biography":{"dateOfBirth":"27 April 1872","placeOfBirth":" London, England, UK","height":"5' 7\" (1.7 m)","bio":"Beaming, rotund Lennox Pawle is chiefly remembered for his delightful, albeit brief, performance as the 'pixillated' Mr. Dick in MGM's classic version of David Copperfield (1935). A former newspaperman and owner of a racing publication, Pawle had been on stage in his native England from the 1890's as a comic actor and member of the Maude Adams Playhouse Company. With significant stage experience under his belt, he arrived in the U.S. in 1910. He almost immediately attracted supporting roles on Broadway in long-running hit plays like \"Grumpy\" and \"Monsieur Beaucaire\". Only infrequently in films, he portrayed Samuel Pepys in The Glorious Adventure (1922), but otherwise tended to subordinate film acting to his busy stage career. This changed in 1929, when he made three films for Fox. However, during the succeeding decade he made relatively few and all-too-brief appearances on the silver screen before succumbing to a cerebral hemorrhage on February 22, 1936.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0668015","name":"Lennox Pawle","idIMDB":"nm0668015"},"actorId":"nm0668015","character":"St. Jacques","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Russ Powell","urlProfile":"http://www.imdb.com/name/nm0694302","urlPhoto":"","biography":{"dateOfBirth":"16 September 1875","placeOfBirth":" Indianapolis, Indiana, USA","height":"5' 11\" (1.8 m)","bio":"Russ Powell was born on September 16, 1875 in Indianapolis, Indiana, USA. He was an actor, known for The Red Mill (1927), Alone in the City of Sighs and Tears (1915) and Romance and Dynamite (1918). He died on November 28, 1950 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0694302","name":"Russ Powell","idIMDB":"nm0694302"},"actorId":"nm0694302","character":"Claudet","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0022386","urlIMDB":"http://www.imdb.com/title/tt0022386","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"29","month":"05","year":"1931","remarks":null},{"money":null,"country":null,"day":"25","month":"06","year":"1931","remarks":null}],"copyrightHolder":"Metro-Goldwyn-Mayer Distributing Corporation; 21 October 1931; LP2566 (in copyright registry"},"technical":{"runtime":["1 hr 15 min (75 min)"],"soundMix":["Mono (Western Electric Sound System)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["(8 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.7","filmingLocations":[{"location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA"}],"rated":"PASSED","awards":[{"award":"Academy Awards, USA 1932","titlesAwards":[{"titleAwardOutcome":"Won Oscar","categories":[{"category":"Best Actress in a Leading Role","names":[{"name":"Helen Hayes","id":"nm0371040","role":null}]}]}]},{"award":"Venice Film Festival 1932","titlesAwards":[{"titleAwardOutcome":"Won Audience Referendum","categories":[{"category":"Most Favorite Actress","names":[{"name":"Helen Hayes","id":"nm0371040","role":null}]},{"category":"Most Touching Film","names":[{"name":"Edgar Selwyn","id":"nm0783629","role":null}]}]}]}],"votes":"622","type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"}],"keywords":{"keywords":["prison","medical school","suicide","thief","prostitution","prostitute","wrongful conviction","paris france","trial","photographer","pearl necklace","mother son relationship","mistress","gunfire","gambling","friendship","eiffel tower paris","detective","childbirth","art critic","arranged marriage","doctor","illegitimacy","self sacrifice"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:52:59"}}