{"data":{"movies":[{"title":"We're No Angels","originalTitle":"","year":"1955","releaseDate":"19551102","directors":[{"name":"Michael Curtiz","id":"nm0002031"}],"writers":[{"name":"Albert Husson","id":"nm0404062"},{"name":"Ranald MacDougall","id":"nm0532030"}],"runtime":"106 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2FjY2ViOWUtODk2Yi00NWJjLTgzYTQtOGQ2N2IxYzAwMmI3XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1.jpg","countries":["USA"],"languages":["English","French"],"genres":["Comedy","Crime","Romance"],"plot":"At Christmas, three prisoners - Joseph, Albert and Jules - escape from Devil Island to a French small coastal town. They decide to rob a store, to get some money and clothes and travel by ship to another place. They pretend to be there to fix the roof, but pretty soon they realize that the financial condition of the family Ducotel is not good. Andre Tochard, the selfish and mean owner of the establishment, exploits the family Ducotel. The three convicts spend Christmas night with the Ducotels and are so well treated by the family that they decide to help them. Their pet will help them to fix the situation.","simplePlot":"Three Devil's Island escapees hide out in the home of a kindly merchant and repay his kindness by helping him and his family out of several crises.","actors":[{"actorName":"Humphrey Bogart","urlProfile":"http://www.imdb.com/name/nm0000007","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyOTE3MDM5Ml5BMl5BanBnXkFtZTYwMzA2MTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1899","placeOfBirth":" New York City, New York, USA","birthName":"Humphrey DeForest Bogart","height":"5' 8\" (1.73 m)","bio":"Humphrey DeForest Bogart was born in New York City, New York, to Maud Humphrey, a famed magazine illustrator and suffragette, and Belmont DeForest Bogart, a moderately wealthy surgeon (who was secretly addicted to opium). Bogart was educated at Trinity School, NYC, and was sent to Phillips Academy in Andover, Massachusetts, in preparation for medical studies at Yale. He was expelled from Phillips and joined the U.S. Naval Reserve. From 1920 to 1922, he managed a stage company owned by family friend William A. Brady (the father of actress Alice Brady), performing a variety of tasks at Brady's film studio in New York. He then began regular stage performances. Alexander Woollcott described his acting in a 1922 play as inadequate. In 1930, he gained a contract with Fox, his feature film debut in a ten-minute short, Broadway's Like That (1930), co-starring Ruth Etting and Joan Blondell. Fox released him after two years. After five years of stage and minor film roles, he had his breakthrough role in The Petrified Forest (1936) from Warner Bros. He won the part over Edward G. Robinson only after the star, Leslie Howard, threatened Warner Bros. that he would quit unless Bogart was given the key role of Duke Mantee, which he had played in the Broadway production with Howard. The film was a major success and led to a long-term contract with Warner Bros. From 1936 to 1940, Bogart appeared in 28 films, usually as a gangster, twice in Westerns and even a horror film. His landmark year was 1941 (often capitalizing on parts George Raft had stupidly rejected) with roles in classics such as High Sierra (1941) and as Sam Spade in one of his most fondly remembered films, The Maltese Falcon (1941). These were followed by Casablanca (1942), The Big Sleep (1946), and Key Largo (1948). Bogart, despite his erratic education, was incredibly well-read and he favored writers and intellectuals within his small circle of friends. In 1947, he joined wife Lauren Bacall and other actors protesting the House Un-American Activities Committee witch hunts. He also formed his own production company, and the next year made The Treasure of the Sierra Madre (1948). Bogie won the best actor Academy Award for The African Queen (1951) and was nominated for Casablanca (1942) and as Captain Queeg in The Caine Mutiny (1954), a film made when he was already seriously ill. He died in his sleep at his Hollywood home following surgeries and a battle with throat cancer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyOTE3MDM5Ml5BMl5BanBnXkFtZTYwMzA2MTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000007","name":"Humphrey Bogart","nicknames":["Bogie"],"idIMDB":"nm0000007"},"actorId":"nm0000007","character":"Joseph","urlCharacter":"http://www.imdb.com/character/ch0019668","main":true},{"actorName":"Aldo Ray","urlProfile":"http://www.imdb.com/name/nm0712731","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNjk5NDc0N15BMl5BanBnXkFtZTcwNDQ5NTUwOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1926","placeOfBirth":" Pen Argyl, Pennsylvania, USA","birthName":"Aldo DaRe","height":"6' (1.83 m)","bio":"Aldo DaRe was born in the borough of Pen Argyl, in Northampton County, Pennsylvania on 25 September 1926. He attended the University of California at Berkeley, served as a US Navy frogman during WWII and saw action on Iwo Jima. While constable of Crockett, California, he drove his brother Guido to an audition for the film Saturday's Hero (1951). Director David Miller hired him for a small role as a cynical football player. Ray's husky frame, thick neck and raspy voice made him perfect for playing tough sexy roles. He was one of the reminiscing lovers in George Cukor's The Marrying Kind (1952) and starred opposite Rita Hayworth in Miss Sadie Thompson (1953). Ray was the none-too-bright boxer in Cukor's Pat and Mike (1952) and an escaped convict in 'Michael Curtiz''s We're No Angels (1955). His career started downhill in the 1970s, with him appearing in a string of low-budget films as a character actor. His last film was Shock 'Em Dead (1991). Ray was married three times, with one daughter Claire born in 1951 to his first wife Shirley Green whom he married on on 20 June 1947. Ray was then briefly married to actress Jeff Donnell and then had two sons and a daughter with his third wife, Johanna Ray, one of whom is the actor Eric DaRe. Aldo Ray died of throat cancer on 27 March 1991.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNjk5NDc0N15BMl5BanBnXkFtZTcwNDQ5NTUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0712731","name":"Aldo Ray","nicknames":["Rugged Romeo"],"idIMDB":"nm0712731"},"actorId":"nm0712731","character":"Albert","urlCharacter":"http://www.imdb.com/character/ch0019672","main":true},{"actorName":"Peter Ustinov","urlProfile":"http://www.imdb.com/name/nm0001811","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyOTkwOTYzNF5BMl5BanBnXkFtZTYwNDk2NTI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 April 1921","placeOfBirth":" London, England, UK","birthName":"Peter Alexander Freiherr von Ustinov","height":"5' 11½\" (1.82 m)","bio":"Peter Ustinov was a two-time Academy Award-winning film actor, a director, writer, journalist and raconteur. He wrote and directed many acclaimed stage plays and led numerous international theatrical productions. He was born Peter Alexander Freiherr von Ustinov on April 16, 1921, in Swiss Cottage, London, England, the son of Nadezhda Leontievna (Benois) and Iona von Ustinov. His father was of one quarter Polish Jewish, one half Russian, one eighth African Ethiopian, and one eighth German, descent, while his mother was of one half Russian, one quarter Italian, one eighth French, and one eighth German, ancestry. Ustinov had ancestral connections to Russian nobility, as well as to the Ethiopian Royal Family. His father, also known as \"Klop\", was a pilot in the German Air Force during World War I. In 1919, Peter's father joined his own mother and sister in St. Petersburg, Russia. There he met Peter's mother, artist Nadia Benois, who worked for the Imperial Mariinsky Ballet and Opera House in St. Petersburg. In 1920, in a modest and discrete ceremony at a Russian-German Church in St. Petersburg, Ustinov's father married Nadia. Later, when she was seven months pregnant with Peter, the couple emigrated from Russia, in 1921, in the aftermath of the Communist Revolution. Young Peter was brought up in a multi-lingual family--he was fluent in Russian, French, Italian and German, and also was a native English speaker. He attended Westminster College in 1934-37, took the drama and acting class under Michel St. Denis at the London Theatre Studio, 1937-39, and made his stage debut in 1938 in a theatre in Surrey. In 1939 he made his London stage debut in a revue sketch, then had regular performances with Aylesbury Repertory Company. In 1940 he made his film debut in Hullo, Fame! (1940). From 1942-46 Ustinov served as a private soldier with the British Army's Royal Sussex Regiment. He was batman for David Niven and the two became lifelong friends. Ustinov spent most of his service working with the Army Cinema Unit, where he was involved in making recruitment films, wrote plays and appeared in three films as an actor. At that time he wrote and directed The Way Ahead (1944) (aka \"The Immortal Battalion\"). Ustinov had a stellar film career as actor, director and writer, appearing in more than 100 film and television productions. He was awarded two Oscars for Best Supporting Actor--one for his role in Spartacus (1960) and one for his role in Topkapi (1964)--and received two more Oscar nominations as an actor and writer. His career slowed down a bit in the 1970s, but he made a comeback as Hercule Poirot in Death on the Nile (1978) by director John Guillermin. In the 1980s Ustinov recreated brilliantly Poirot in several subsequent television movies and theatrical films, such as Evil Under the Sun (1982) and Appointment with Death (1988), while his cinema work in the 1990s also includes his superb performance as Professor Gus Nikolais in George Miller's excellent dramatic film Lorenzo's Oil (1992), a character partially inspired by Hugo Wolfgang Moser, a research scientist who had been director of the Neurogenetics Research Center at the Kennedy Krieger Institute and Professor of Neurology and Pediatrics at Johns Hopkins University. Ustinov's effortless style and his expertise in dialectic and physical comedy made him a regular guest of talk shows and late night comedians. His witty and multi-dimensional humor was legendary, and he later published a collection of his jokes and quotations, summarizing his wide popularity as a raconteur. He was also an internationally acclaimed TV journalist. Ustinov covered over 100,000 miles and visited more than 30 Russian cities during the making of his well-received BBC television series Russia (1986). In his autobiographical books, such as \"Dear Me\" (1977) and \"My Russia\" (1996), Ustinov revealed a wealth of thoughtful and deep observations about how his life and career was formed by his rich multi-cultural and multi-ethnic background. He wrote and directed numerous stage plays, having success presenting his plays in several countries. His excellent play \"Photo Finish\" was staged in New York, London and St. Petersburg, Russia, where Ustinov directed the acclaimed production starring Elena Solovey and Petr Shelokhonov. Outside of his acting and writing professions, Ustinov served as a Goodwill ambassador for UNICEF and president of WFM, a global citizens movement. He was knighted Sir Peter Ustinov in 1990. From 1971 to his death in 2004, Ustinov lived in a château in the village of Bursins, Vaud, Switzerland, He died of heart failure on March 28, 2004, in a clinic in Genolier, Vaud, Switzerland. His funeral service was held at Geneva's historic cathedral of St. Pierre, and he was laid to rest in the village cemetery of Bursins, Switzerland. He was survived by three daughters, Tamara, Pavla, and Andrea, and son, Igor Ustinov. \"I am an international citizen conceived in Russia, born in England, working in Hollywood, living in Switzerland, and touring the World\" said Peter Ustinov.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyOTkwOTYzNF5BMl5BanBnXkFtZTYwNDk2NTI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001811","name":"Peter Ustinov","idIMDB":"nm0001811"},"actorId":"nm0001811","character":"Jules","urlCharacter":"http://www.imdb.com/character/ch0458499","main":true},{"actorName":"Joan Bennett","urlProfile":"http://www.imdb.com/name/nm0000910","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0OTE5MzU0N15BMl5BanBnXkFtZTYwMTA3MjU2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1910","placeOfBirth":" Palisades, New Jersey, USA","birthName":"Joan Geraldine Bennett","height":"5' 3½\" (1.61 m)","bio":"Joan Geraldine Bennett was born on February 27, 1910, in Palisades, New Jersey. Her parents were both successful stage actors, especially her father, Richard Bennett, and often toured the country for weeks at a time. In fact, Joan came from a long line of actors, dating back to the 18th century. Often, when her parents were on tour, Joan and her two older sisters, Constance Bennett, who later became an actress, and Barbara were left in the care of close friends. At the age of four, Joan made her first stage appearance. She debuted in films a year later in The Valley of Decision (1916), in which her father was the star and the entire Bennett clan participated. In 1923 she again appeared in a film which starred her father, playing a pageboy in The Eternal City (1923). It would be five more years before Joan appeared again on the screen. In between, she married Jack Marion Fox, who was 26 compared to her young age of 16. The union was anything but happy, in great part because of Fox's heavy drinking. In February of 1928 Joan and Jack had a baby girl they named Adrienne. The new arrival did little to help the marriage, though, and in the summer of 1928 they divorced. Now with a baby to support, Joan did something she had no intention of doing--she turned to acting. She appeared in Power (1928) with Alan Hale and Carole Lombard, a small role but a start. The next year she starred in Bulldog Drummond (1929), sharing top billing with Ronald Colman. Before the year was out she was in three more films--Disraeli (1929), The Mississippi Gambler (1929) and Three Live Ghosts (1929). Not only did audiences like her, but so did the critics. Between 1930 and 1931, Joan appeared in nine more movies. In 1932 she starred opposite Spencer Tracy in She Wanted a Millionaire (1932), but it wasn't one she liked to remember, partly because Tracy couldn't stand the fact that everyone was paying more attention to her than to him. Joan was to remain busy and popular throughout the rest of the 1930s and into the 1940s. By the 1950s Joan was well into her 40s and began to lessen her film appearances. She made only eight pictures, in addition to appearing in two television series. After Desire in the Dust (1960), Joan would be absent from the movie scene for the next ten years, resurfacing in House of Dark Shadows (1970), reprising her role from the Dark Shadows (1966) TV series as Elizabeth Collins Stoddard. Joan's final screen appearance was in the Italian thriller Suspiria (1977). Her final public performance was in the TV movie Divorce Wars: A Love Story (1982). On December 7, 1990, Joan died of a heart attack in Scarsdale, New York. She was 80 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0OTE5MzU0N15BMl5BanBnXkFtZTYwMTA3MjU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000910","name":"Joan Bennett","nicknames":["Joanie"],"idIMDB":"nm0000910"},"actorId":"nm0000910","character":"Amelie Ducotel","urlCharacter":"http://www.imdb.com/character/ch0460142","main":true},{"actorName":"Basil Rathbone","urlProfile":"http://www.imdb.com/name/nm0001651","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNjkzNzU1NV5BMl5BanBnXkFtZTYwMDM2MjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1892","placeOfBirth":" Johannesburg, South Africa","birthName":"Philip St. John Basil Rathbone","height":"6' 1½\" (1.87 m)","bio":"Basil Rathbone was born in Johannesburg, South Africa, in 1892, but three years later his family was forced to flee the country because his father was accused by the Boers of being a British spy at a time when Dutch-British conflicts were leading to the Boer War. The Rathbones escaped to England, where Basil and his two younger siblings, Beatrice and John, were raised. Their mother, Anna Barbara (George), was a violinist, who was born in Grahamstown, South Africa, of British parents, and their father, Edgar Philip Rathbone, was a mining engineer born in Liverpool. From 1906 to 1910 Rathbone attended Repton School, where he was more interested in sports--especially fencing, at which he excelled--than studies, but where he also discovered his interest in the theater. After graduation he planned to pursue acting as a profession, but his father disapproved and suggested that his son try working in business for a year, hoping he would forget about acting. Rathbone accepted his father's suggestion and worked as a clerk for an insurance company--for exactly one year. Then he contacted his cousin Frank Benson, an actor managing a Shakespearean troupe in Stratford-on-Avon. Rathbone was hired as an actor on the condition that he work his way through the ranks, which he did quite rapidly. Starting in bit parts in 1911, he was playing juvenile leads within two years. In 1915 his career was interrupted by the First World War. During his military service, as a second lieutenant in the Liverpool Scottish 2nd Battalion, he worked in intelligence and received the Military Cross for bravery. In 1919, released from military service, he returned to Stratford-on-Avon and continued with Shakespeare but after a year moved onto the London stage. The year after that he made his first appearance on Broadway and his film debut in the silent Innocent (1921). For the remainder of the decade Rathbone alternated between the London and New York stages and occasional appearances in films. In 1929 he co-wrote and starred as the title character in a short-running Broadway play called \"Judas\". Soon afterwards he abandoned his first love, the theater, for a film career. During the 1920s his roles had evolved from the romantic lead to the suave lady-killer to the sinister villain (usually wielding a sword), and Hollywood put him to good use during the 1930s in numerous costume romps, including Captain Blood (1935), David Copperfield (1935), A Tale of Two Cities (1935), Anna Karenina (1935), The Last Days of Pompeii (1935), The Adventures of Robin Hood (1938), Tower of London (1939), The Mark of Zorro (1940) and others. Rathbone earned two Oscar nominations for Best Supporting Actor as Tybalt in Romeo and Juliet (1936) and as King Louis XI in If I Were King (1938). However, it was in 1939 that Rathbone played his best-known and most popular character, Sherlock Holmes, with Nigel Bruce as Dr. Watson, first in The Hound of the Baskervilles (1939) and then in The Adventures of Sherlock Holmes (1939), which were followed by 12 more films and numerous radio broadcasts over the next seven years. Feeling that his identification with the character was killing his film career, Rathbone went back to New York and the stage in 1946. The next year he won a Tony Award for his portrayal of Dr. Sloper in the Broadway play \"The Heiress,\" but afterwards found little rewarding stage work. Nevertheless, during the last two decades of his life, Rathbone was a very busy actor, appearing on numerous television shows, primarily drama, variety and game shows; in occasional films, such as Casanova's Big Night (1954), The Court Jester (1955), Tales of Terror (1962) and The Comedy of Terrors (1963); and in his own one-man show, \"An Evening with Basil Rathbone\", with which he toured the U.S.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNjkzNzU1NV5BMl5BanBnXkFtZTYwMDM2MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001651","name":"Basil Rathbone","nicknames":["Ratters"],"idIMDB":"nm0001651"},"actorId":"nm0001651","character":"Andre Trochard","urlCharacter":"http://www.imdb.com/character/ch0019670","main":true},{"actorName":"Leo G. Carroll","urlProfile":"http://www.imdb.com/name/nm0001991","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA3MzE0NDE3MF5BMl5BanBnXkFtZTcwNzA2MjYwOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 October 1886","placeOfBirth":" Weedon Bec, Northamptonshire, England, UK","birthName":"Leo Gratten Carroll","height":"5' 10\" (1.78 m)","bio":"One of the most indispensable of character actors, Leo G. Carroll was already involved in the business of acting as a schoolboy in Gilbert & Sullivan productions. Aged 16, he portrayed an old man in 'Liberty Hall'. In spite of the fact, that he came from a military family, and , perhaps, because of his experience during World War I, he decided against a military career in order to pursue his love of the theatre. In 1911, he had been a stage manager/actor in 'Rutherford and Son' and the following year took this play to America. Twelve years later, Leo took up permanent residence in the United States. His first performance on Broadway was in 'Havoc' (1924) with Claud Allister, followed by Noël Coward's 'The Vortex' (1925, as Paunceford Quentin). Among his subsequent successes on the stage were 'The Green Bay Tree' (1933) as Laurence Olivier's manservant, 'Angel Street' (aka 'Gaslight',1941) as Inspector Rough, and the 'The Late George Apley' (title role). The latter, a satire on Boston society, opened in November 1944 and closed almost exactly a year later. A reviewer for the New York times, Lewis Nichols, wrote \"His performance is a wonderful one. The part of Apley easily could become caricature but Mr.Carroll will have none of that. He plays the role honestly and softly.\" The play was filmed in 1947, with Ronald Colman in the lead role. Leo's film career began in 1934. He was cast, to begin with, in smallish parts. Sometimes they were prestige 'A pictures', usually period dramas, such as The Barretts of Wimpole Street (1934) and Wuthering Heights (1939). Leo was a consummate method actor who truly 'lived' the parts he played, and, as a prominent member of Hollywood's British colony, attracted the attention of Alfred Hitchcock. Indeed, the famous director liked him so much, that he preferred him to any American actor to play the part of a U.S. senator in Strangers on a Train (1951). A scene stealer even in supporting roles, Leo G. Carroll lent a measure of 'gravitas' to most of his performances, point in case that of the homicidal Dr. Murchison in Spellbound (1945) (relatively little screen time, but much impact !) and the professor in North by Northwest (1959). On the small screen, Leo lent his dignified, urbane presence and dry wit to the characters of Cosmo Topper and Alexander Waverly, spymaster and boss of Napoleon Solo and Ilya Kuryakin in The Man from U.N.C.L.E. (1964), the part for which he is chiefly remembered. Leo G. Carroll appeared in over 300 plays during his career and the stage remained his preferred medium. He once remarked \"It's brought me much pleasure of the mind and heart. I owe the theatre a great deal. It owes me nothing\" (NY Times, October 19,1972).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA3MzE0NDE3MF5BMl5BanBnXkFtZTcwNzA2MjYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001991","name":"Leo G. Carroll","idIMDB":"nm0001991"},"actorId":"nm0001991","character":"Felix Ducotel","urlCharacter":"http://www.imdb.com/character/ch0019671","main":true},{"actorName":"John Baer","urlProfile":"http://www.imdb.com/name/nm0046359","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDk5OTYzMmQtODIwNS00YjBkLWI0YjgtZjU4YzE4ZWU2YjIyXkEyXkFqcGdeQXVyMzAwOTU1MTk@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 June 1923","placeOfBirth":" York, Pennsylvania, USA","bio":"John Baer was born on June 6, 1923 in York, Pennsylvania, USA. He was an actor, known for We're No Angels (1955), Terry and the Pirates (1952) and Night of the Blood Beast (1958). He was married to Noureen Jauregui. He died on January 7, 2006 in Newhall, Santa Clarita, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDk5OTYzMmQtODIwNS00YjBkLWI0YjgtZjU4YzE4ZWU2YjIyXkEyXkFqcGdeQXVyMzAwOTU1MTk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0046359","name":"John Baer","idIMDB":"nm0046359"},"actorId":"nm0046359","character":"Paul Trochard","urlCharacter":"http://www.imdb.com/character/ch0019673","main":true},{"actorName":"Gloria Talbott","urlProfile":"http://www.imdb.com/name/nm0847993","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGRkMDY2MzAtOTdiNS00M2Q1LWE2MzgtYWE1MjMzOWQ4MWEwL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 February 1931","placeOfBirth":" Glendale, California, USA","birthName":"Gloria Maude Talbott","bio":"Gloria Talbott was born in the Los Angeles suburb of Glendale, a city co-founded by her grandfather. Growing up in the shadows of the Hollywood studios, her interests inevitably turned to acting, with the result that she participated in school plays and landed small parts in films such as \"Maytime\" (1937), \"Sweet and Lowdown\" (1943) and \"A Tree Grows in Brooklyn\" (1945). After leaving school, she started her own dramatic group and played \"arena\"-style shows at various clubs. After a three-year hiatus (marriage, motherhood and divorce), Talbott resumed her career, working extensively in both TV and films. Her sister is actress Lori Talbott.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGRkMDY2MzAtOTdiNS00M2Q1LWE2MzgtYWE1MjMzOWQ4MWEwL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0847993","name":"Gloria Talbott","idIMDB":"nm0847993"},"actorId":"nm0847993","character":"Isabelle Ducotel","urlCharacter":"http://www.imdb.com/character/ch0460143","main":true},{"actorName":"Lea Penman","urlProfile":"http://www.imdb.com/name/nm0671942","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2IzYzJhMDUtNzY1MC00ZjJmLTgxOWUtMzFkOTJlZTU1NTU0XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1895","placeOfBirth":" Red Cloud, Nebraska, USA","height":"5' 6½\" (1.69 m)","bio":"Lea Penman was born on October 4, 1895 in Red Cloud, Nebraska, USA. She was an actress, known for We're No Angels (1955), Fancy Pants (1950) and More Gas (1931). She died on October 12, 1962 in Hollywood, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2IzYzJhMDUtNzY1MC00ZjJmLTgxOWUtMzFkOTJlZTU1NTU0XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0671942","name":"Lea Penman","idIMDB":"nm0671942"},"actorId":"nm0671942","character":"Mme. Parole","urlCharacter":"http://www.imdb.com/character/ch0019674","main":true},{"actorName":"John Smith","urlProfile":"http://www.imdb.com/name/nm0808774","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2E3YjFiNzAtODUyMC00ODZhLWI2ZmEtNDhkMDZlNTQ4ZjkxXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1931","placeOfBirth":" Los Angeles, California, USA","birthName":"Robert Errol Van Orden","height":"6' 2\" (1.88 m)","bio":"Actor John Smith was born Robert Errol Van Orden in Los Angeles. He began his career singing with The Robert Mitchell Boy Choir, a group which appeared in two Bing Crosby films, Going My Way (1944) and The Bells of St. Mary's (1945). His agent Henry Willson, who also gave Tab Hunter and Rock Hudson their names, changed Van Orden's name to \"John Smith\". Robert Hofler, author of \"The Man Who Invented Rock Hudson\", reports that an actress identified as Pocahontas Crowfoot was in the courtroom when the name change was granted. In We're No Angels (1955), Smith had a small role as \"Arnaud\", the ship's doctor. Aldo Ray, observing the doctor in full dress whites, says \"he looks like a glass of milk\". John Smith's other film credits include Circus World (1964) and Justin Morgan Had a Horse (1972). Smith also appeared in the television westerns Cimarron City (1958) and Laramie (1959).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2E3YjFiNzAtODUyMC00ODZhLWI2ZmEtNDhkMDZlNTQ4ZjkxXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0808774","name":"John Smith","nicknames":["Smitty"],"idIMDB":"nm0808774"},"actorId":"nm0808774","character":"Medical Officer Arnaud","urlCharacter":"http://www.imdb.com/character/ch0460144","main":true}],"seasons":[],"idIMDB":"tt0048801","urlIMDB":"http://www.imdb.com/title/tt0048801","business":{"budget":{"money":"$1,685,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$3,000,000 (USA)","country":"","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 46 min (106 min)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1 (intended ratio)","1.96 : 1 (negative ratio)"],"camera":null,"laboratory":["Technicolor"],"filmLength":["(12 reels)"],"negativeFormat":["35 mm (horizontal)"],"cinematographicProcess":["VistaVision"],"printedFilmFormat":["16 mm","35 mm"]},"rating":"7.5","filmingLocations":[{"location":"Paramount Studios - 5555 Melrose Avenue, Hollywood, Los Angeles, California, USA"}],"awards":[],"votes":"6,435","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["devil's island","christmas","port","turkey the bird","19th century","claim in title","wife murderer","uncle nephew relationship","thief","steamship","snake venom","skylight","skinflint","shoplifting","ship's doctor","sewing machine","safecracker","quarantine","postmaster","piano","photo album","pet snake","no credits","murderer","mock trial","leaky roof","horse and carriage","harmonica","halo","greed","gramophone","general store","forger","fainting girl","embezzler","diary","credit","cousin cousin relationship","christmas dinner","bloodhound","avarice","1890s","foreign language adaptation","punctuation in title","apostrophe in title","last will and testament","unrequited love","unlikely hero","forgery","snake","penal colony","escaped convict","bookkeeper","based on play","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:56:34"}}