{"data":{"movies":[{"title":"Arabian Nights","originalTitle":"","year":"1942","releaseDate":"19460724","directors":[{"name":"John Rawlins","id":"nm0712639"}],"writers":[{"name":"Michael Hogan","id":"nm0389580"},{"name":"Michael Hogan","id":"nm0389580"}],"runtime":"86 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDgyNTExN15BMl5BanBnXkFtZTcwOTA4NjY0MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure"],"plot":"Dancer Sherazade was told by the stars that she will become wife of the kalif in Bagdad. She tells Kamar, brother of kalif Haroun. He planned a coup d'etat, which failed at first, but supported by the wasir he finally succeeds. Haroun is injured and gets help from Ahmad's actor troupe, where he is nursed by Sherazade, who doesn't recognise him. When she hears that Kamar is looking for her she goes to him, but is sold with the complete troupe of actors to slavery. They're able to escape, but Haroun is still in danger. To save him, Sherazade agrees to poison Kamar, but Haroun tries to establish his rulership first.","simplePlot":"The caliph of Baghdad must go into hiding with a group of traveling performers when his brother usurps the throne. Both brothers desire a beautiful dancing girl, who is torn between power and true love.","actors":[{"actorName":"Sabu","urlProfile":"http://www.imdb.com/name/nm0754942","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQyNTg2NjQ5M15BMl5BanBnXkFtZTYwODQ1MDU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1924","placeOfBirth":" Karapur, Kingdom of Mysore, British India","birthName":"Sabu Dastagir","height":"5' 6\" (1.68 m)","bio":"Sabu Dastagir (or Selar Shaik Sabu, depending on your resource) was born on January 27, 1924, in the little town of Mysore, India, which is nestled in the jungles of Karapur. The son of an elephant driver (mahout) in service for the Maharajah of his town, the young stable boy learned responsibility early in life when, at age 9, his father died and Sabu immediately became the ward of the royal elephant stables. As with many Hollywood success stories, good timing, and dumb luck allowed the impoverished youth a chance for a better life. By sheer chance the timid 12-year-old orphan was discovered by a British location crew while searching for a youth to play the title role (an elephant driver!) in their upcoming feature Elephant Boy (1937). Quite taken aback by his earnest looks, engaging naturalness and adaptability to wild animals and their natural habitat, the studio handed the boy a film career on a sterling silver platter and was placed under exclusive contract by the mogul Alexander Korda himself. Sabu and his older brother (as guardian) were whisked away to England to complete the picture and became subsequent wards of the British government. They were given excellent schooling in the process and Sabu quickly learned the English language in preparation for his upcoming films. Elephant Boy (1937) was an unqualified hit and the young actor was promptly placed front and center once again in the film Drums (1938) surrounded by an impressive British cast that included Raymond Massey and Valerie Hobson. With the parallel success of the Tarzan jungle movies in America, Hollywood starting taking a keen look at this refreshingly new boy talent when he first arrived in the U.S. for a publicity tour of the film. Again, his second film was given rave reviews, proving that Sabu would not be just a one-hit wonder. His third film for Korda is considered one of the great true classics. In the Arabian fantasy-adventure The Thief of Bagdad (1940), Sabu plays Abu the Thief and is not only surrounded by superb actors -- notably June Duprez, John Justin, Rex Ingram (as the genie) and Conrad Veidt (as the evil Grand Vizier) -- but exceptional writing and incredible special effects. Sabu's name began stirring international ears. His last pairing with Korda was the excellent adaptation of Rudyard Kipling's classic book Jungle Book (1942) playing Mowgli, the boy raised by wolves, who must adapt to the ways of mankind after being returned to his mother. The movie was directed by Alexander's brother Zoltan Korda. Following this triumph, Sabu officially became the exotic commodity of Universal Pictures and he settled in America. Although initially rewarding monetarily, it proved to be undoing. Unfortunately (and too often typical), a haphazard assembly-line of empty-minded features were developed that hardly compared to the quality pictures in England under Korda. Saddled alongside the unexceptional Maria Montez and Jon Hall, his vehicles Arabian Nights (1942), White Savage (1943) and Cobra Woman (1944) were, for the most part, drivel but certainly did fit the bill as colorful, mindless entertainment. Almost 20 years old by the time he became a citizen of the U.S. in 1944, he enlisted in the Army Air Force and earned WWII distinction in combat missions (Distinguished Flying Cross, Air Medal, among others) as a tail gunner. By the time Sabu returned to Universal and filming, the charm of his youth had worn off and the boyish stereotype impossible to escape. Post-war audiences developed new tastes, but Sabu had no choice but to trudge on with retreads of his former glory. Films such as Tangier (1946) again opposite Ms. Montez, Man-Eater of Kumaon (1948) and Song of India (1949) opposite lovely princess Gail Russell did little to advance his career. While filming the last-mentioned movie, Sabu met and married actress Marilyn Cooper who temporarily filled in for an ailing Ms. Russell on the set. The couple went on to have two children. Sabu actually fared better back in England during the late 40s, starring in the crime drama The End of the River (1947) and appearing fourth-billed as a native general in the exquisitely photographed Black Narcissus (1947). Daring in subject matter, the film had Deborah Kerr heading up a group of Anglican nuns who battle crude traditions, unexpected passions and stark raving madness while setting up a Himalayan order. By the mid-50s Sabu's career was rapidly approaching extinction, seeking work wherever he could find it - in low-budget Europe productions, public appearances, etc. An attempt to conjure up a TV series for himself failed. His life was further aggravated by unpleasant civil and paternity suits brought about against him. His last two pictures were supporting roles in Rampage (1963), which starred Robert Mitchum, and A Tiger Walks (1964), a thoroughly routine Disney picture which was released posthumously. Sabu died unexpectedly at age 39 of a heart attack on December 2, 1963, at his home in Southern California and was buried at Forest Lawn Cemetery in the Hollywood Hills. Son Paul Sabu developed into an accomplished songwriter and even formed a rock band called Sabu; daughter Jasmine Sabu, who died in 2001, was a noted horse trainer whose skill was utilized occasionally for films. Although he went the way of too many of our former stars, Sabu continues to enchant and excite newer generations with his unmatched athletic skills and magnetic charm in those early adventure fantasies of yesteryear.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQyNTg2NjQ5M15BMl5BanBnXkFtZTYwODQ1MDU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0754942","name":"Sabu","idIMDB":"nm0754942"},"actorId":"nm0754942","character":"Ali Ben Ali","urlCharacter":"http://www.imdb.com/character/ch0507459","main":true},{"actorName":"Jon Hall","urlProfile":"http://www.imdb.com/name/nm0355755","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1Njk2MzQ2OV5BMl5BanBnXkFtZTcwNzA0MTI0NA@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 February 1915","placeOfBirth":" Fresno, California, USA","birthName":"Charles Felix Locher","height":"6' 1\" (1.85 m)","bio":"Handsome, athletic leading man Jon Hall was the son of actor Felix Locher and a Tahitian princess. Hall was married three times, two of which were to entertainers: singer Frances Langford and actress Raquel Torres. His third wife was a psychiatrist. They married in 1969 and lived in Los Angeles with her two sons and a daughter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1Njk2MzQ2OV5BMl5BanBnXkFtZTcwNzA0MTI0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0355755","name":"Jon Hall","idIMDB":"nm0355755"},"actorId":"nm0355755","character":"Haroun-Al-Raschid","urlCharacter":"http://www.imdb.com/character/ch0045692","main":true},{"actorName":"Maria Montez","urlProfile":"http://www.imdb.com/name/nm0599688","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NjA5OTM0OV5BMl5BanBnXkFtZTYwNjM5MDI2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 June 1912","placeOfBirth":" Barahona, Dominican Republic","birthName":"Maria Africa Antonia Gracia Vidal de Santo Silas","height":"5' 7\" (1.7 m)","bio":"In a world weary of war and dispirited by the ravages of the Great Depression, Hollywood at the turn of the 1940's concocted a wildly popular, effective lot of escapist fare (though often cheaply made) to regale the sick at heart worldwide. Universal Pictures, more often than not, led in producing such films. We know about the monster movies: wolf men, invisible men -- and invisible women too, for that matter. We know about Sherlock Holmes chasing not killer hounds in 1890 but chasing killer Nazis a half- century later. Such were among typical Universal \"B\" productions. Enter Maria de Santo Silas -- Maria Montez. This daughter of a Spanish diplomat traveled extensively after being educated in the Canary Islands and attempted, albeit unsuccessfully, to establish herself as a stage actress in Europe. In 1940 she found herself in New York City, a model. Her screen career began in 1941, with Universal casting her in bit parts. On account of her strikingly exotic looks and her exotic accent, the studio soon paired her with other \"exotics\" (Sabu and Turhan Bey), and usually with a more \"home-style\" hero (Jon Hall), in a series of low-budget adventures, filmed in Technicolor and situated in fantasy lands, with Montez herself often situated in revealing dress. With Montez threatened by all manner of nastiness -- from evil caliphs to man-eating sharks to her own cobra-worshipping twin sister (!) -- her pictures soon became immensely popular, even though she could not really act, could not dance and could not sing. Audiences flocked to see her films, just to witness the trials and endurance of an alluring beauty in distress (as well, perhaps, as to glimpse some scantily clad, beauteous flesh). The Depression having long since passed, the end of World War II meant also the end of flying carpets and sand dunes and deadly reptiles as potential subjects for attracting moviegoers. That bit of history, plus a bit of girth added to Montez's frame, led her and her husband, the actor Jean-Pierre Aumont, to abandon Hollywood for Europe, where she would appear in a handful of French and Italian adventure films. On 7 September 1951 Maria Montez was discovered drowned in her bath, possibly having first suffered a heart attack.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NjA5OTM0OV5BMl5BanBnXkFtZTYwNjM5MDI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0599688","name":"Maria Montez","nicknames":["The Queen of Technicolor","The Caribbean Cyclone"],"idIMDB":"nm0599688"},"actorId":"nm0599688","character":"Sherazade","urlCharacter":"http://www.imdb.com/character/ch0029019","main":true},{"actorName":"Leif Erickson","urlProfile":"http://www.imdb.com/name/nm0002063","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNDAwMDMwMjReQTJeQWpwZ15BbWU3MDU5NDQ4OTc@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 October 1911","placeOfBirth":" Alameda, California, USA","birthName":"William Y. Wycliffe Anderson","height":"6' 4\" (1.93 m)","bio":"Leif Erickson was born on October 27, 1911 in Alameda, California, USA as William Y. Wycliffe Anderson. He was an actor, known for The High Chaparral (1967), On the Waterfront (1954) and Strait-Jacket (1964). He was married to Ann Diamond, Margaret Hayes and Frances Farmer. He died on January 29, 1986 in Pensacola, Florida, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNDAwMDMwMjReQTJeQWpwZ15BbWU3MDU5NDQ4OTc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002063","name":"Leif Erickson","idIMDB":"nm0002063"},"actorId":"nm0002063","character":"Kamar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Billy Gilbert","urlProfile":"http://www.imdb.com/name/nm0317970","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNTAxODg1MF5BMl5BanBnXkFtZTcwNzA2OTkwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1894","placeOfBirth":" Louisville, Kentucky, USA","birthName":"William Gilbert Barron","height":"5' 11\" (1.8 m)","bio":"The son of singers in the Metropolitan Opera, Billy Gilbert began performing in vaudeville at age 12. He developed a drawn-out, explosive sneezing routine that became his trademark (he was the model for, and voice of, Sneezy in Blanche Neige et les sept nains (1937)). Gilbert's exquisite comic timing made him the perfect foil for such comedians as Stan Laurel and Oliver Hardy, and he was especially memorable as the dim-witted process server Pettibone in His Girl Friday (1940).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNTAxODg1MF5BMl5BanBnXkFtZTcwNzA2OTkwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0317970","name":"Billy Gilbert","idIMDB":"nm0317970"},"actorId":"nm0317970","character":"Ahmad","urlCharacter":"http://www.imdb.com/character/ch0465297","main":true},{"actorName":"Edgar Barrier","urlProfile":"http://www.imdb.com/name/nm0057422","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmJhYTNlN2QtYTUwMi00YjUzLWFmZDEtZjUxYzcxOGZhOTFmL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1907","placeOfBirth":" New York City, New York, USA","bio":"Edgar Barrier was born on March 4, 1907 in New York City, New York, USA. He was an actor, known for Phantom of the Opera (1943), Macbeth (1948) and Cyrano de Bergerac (1950). He died on June 20, 1964 in Hollywood, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmJhYTNlN2QtYTUwMi00YjUzLWFmZDEtZjUxYzcxOGZhOTFmL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0057422","name":"Edgar Barrier","idIMDB":"nm0057422"},"actorId":"nm0057422","character":"Nadan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Lane","urlProfile":"http://www.imdb.com/name/nm0485518","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODljZGNkMGUtNWNjYy00ZGMxLTkyYzQtZDNlODAzMGY5YWVlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 May 1899","placeOfBirth":" Rice Lake, Wisconsin, USA","bio":"Richard Lane was born on May 28, 1899 in Rice Lake, Wisconsin, USA. He was an actor, known for The Jackie Robinson Story (1950), Take Me Out to the Ball Game (1949) and 'Gung Ho!': The Story of Carlson's Makin Island Raiders (1943). He died on September 5, 1982 in Newport Beach, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODljZGNkMGUtNWNjYy00ZGMxLTkyYzQtZDNlODAzMGY5YWVlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0485518","name":"Richard Lane","idIMDB":"nm0485518"},"actorId":"nm0485518","character":"Corporal","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Turhan Bey","urlProfile":"http://www.imdb.com/name/nm0001947","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWUzYjFmOGQtNTcyZi00OTg0LWEyYzMtYjUxMGVjOGI0YjBkXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 March 1922","placeOfBirth":" Vienna, Austria","birthName":"Turhan Gilbert Selahattin Sahultavy","bio":"Popular leading man in 1940's Hollywood who, with his suave demeanor, exotically handsome looks and well-modulated voice, was first called upon to portray mysterious or villainous characters. Soon he would be teamed with other \"exotics\" (e.g. Maria Montez and Sabu) in a series of escapist adventures, filmed in glorious Technicolor and set in lands of fable, which proved most popular with movie audiences of the World War II years. But with the end of the war, his career (like that of Montez) would decline. He ultimately returned to his city of birth to pursue opportunities in commercial photography.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWUzYjFmOGQtNTcyZi00OTg0LWEyYzMtYjUxMGVjOGI0YjBkXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001947","name":"Turhan Bey","nicknames":["Turkish Delight"],"idIMDB":"nm0001947"},"actorId":"nm0001947","character":"Captain","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Qualen","urlProfile":"http://www.imdb.com/name/nm0702798","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjg1NTM5Ml5BMl5BanBnXkFtZTcwNjkxNzYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 December 1899","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"Johan Mandt Kvalen","height":"5' 7\" (1.7 m)","bio":"One of the best and most familiar character actors of the first four decades of sound films, although few who knew his face also knew his name. John Qualen was born in Canada to Norwegian parents. His father was a minister. The family moved to the United States and Qualen (whose real name was Kvalen) grew up in Elgin, Illinois. He won an oratory contest and was given a scholarship to Northwestern University. His interest in acting was piqued there, and he began appearing in tent shows on the Lyceum-Chautauqua circuit, and in stock. He went to New York in 1929 and got his big break as the Swedish janitor in Elmer Rice's Street Scene. He repeated the role two years later in the film version. That same year he first worked for director John Ford in Arrowsmith (1931). He became a member of Ford's famed \"stock company, and had prominent roles for Ford for the next thirty-five years. He became a most familiar character player, specializing in Scandinavians of various nationalities, but frequently playing a wide variety of other ethnicities. Perhaps his greatest work among many memorable roles was as the pitiful Muley, who recounts the destruction of his farm by the bank in Ford's masterpiece, The Grapes of Wrath (1940). Although plagued in his later years by failing eyesight, he continued to work steadily into his final years. He was treasurer of The Authors Club and historian of The Masquers, Hollywood's famed social group for actors. He had three children, Elizabeth, Kathleen, and Meredith. Qualen died in 1987.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjg1NTM5Ml5BMl5BanBnXkFtZTcwNjkxNzYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0702798","name":"John Qualen","idIMDB":"nm0702798"},"actorId":"nm0702798","character":"Aladdin","urlCharacter":"http://www.imdb.com/character/ch0000538","main":true},{"actorName":"Shemp Howard","urlProfile":"http://www.imdb.com/name/nm0397602","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NDU2NDU4Nl5BMl5BanBnXkFtZTYwNzc2MjI2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 March 1895","placeOfBirth":" Brooklyn [now in New York City], New York, USA","birthName":"Samuel Horwitz","height":"5' 7\" (1.7 m)","bio":"Shemp Howard was born Samuel Horwitz in Brooklyn, New York, USA. He was also the brother of fellow stooges Moe Howard and Curly Howard. Larry Fine was not related to any of the other stooges. When not working with The Three Stooges, Shemp made a lot of feature film appearances, such as The Bank Dick (1940) with W.C. Fields. Shemp, Moe, Larry and Curly appeared in only one short together -- Hold That Lion! (1947). In it, Curly appears as an uncredited train car passenger. Watch for the man with the hat on his face. This was a short, non-speaking cameo, due to a stroke Curly suffered the prior year.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NDU2NDU4Nl5BMl5BanBnXkFtZTYwNzc2MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0397602","name":"Shemp Howard","nicknames":["The Forgotten Stooge"],"idIMDB":"nm0397602"},"actorId":"nm0397602","character":"Sinbad","urlCharacter":"http://www.imdb.com/character/ch0022470","main":true},{"actorName":"William 'Wee Willie' Davis","urlProfile":"http://www.imdb.com/name/nm0205655","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzBmNjM0MTYtOTY5Ny00ODkyLTlhMWUtZWM2YmVmMTU1MWI1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 December 1906","placeOfBirth":" New York City, New York, USA","height":"6' 5\" (1.96 m)","bio":"William 'Wee Willie' Davis was born on December 7, 1906 in New York City, New York, USA. He was an actor, known for The Asphalt Jungle (1950), Samson and Delilah (1949) and Abbott and Costello in the Foreign Legion (1950). He died on April 9, 1981 in Louisville, Kentucky, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzBmNjM0MTYtOTY5Ny00ODkyLTlhMWUtZWM2YmVmMTU1MWI1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0205655","name":"William 'Wee Willie' Davis","idIMDB":"nm0205655"},"actorId":"nm0205655","character":"Valda","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thomas Gomez","urlProfile":"http://www.imdb.com/name/nm0327089","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDg4ODMwMDU0MV5BMl5BanBnXkFtZTcwNDY5OTkwOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 July 1905","placeOfBirth":" New York City, New York, USA","birthName":"Sabino Tomas Gomez","bio":"After graduating from high school in 1923, Thomas Sabino Gomez answered a help wanted ad, which resulted in his joining the Alfred Lunt and Lynn Fontanne theater group. Prior to that time he had not considered acting as a career. He continued working as an actor with the Lunts, traveling across country and honing his acting skills. Eventually he began performing in New York's legitimate theater. His film debut occurred in 1942 in Sherlock Holmes and the Voice of Terror (1942) as, of course, a bad guy. While shooting that film he lived at the Hollywood Roosevelt Hotel. He gained a reputation as a methodical man, who would have his daily newspaper brought to his room, where it was placed on the top of an ever growing stack. When he had time to read, he would have a bellboy come to the room and lift the stack of papers, from which he would withdraw the bottom paper. Gomez was a strong union man and served on the board of directors of the Screen Actors Guild for more than 40 years. In the late 1940s he purchased a home in the Hollywood Hills, and lived there until his death. While his film career consisted most of supporting roles, on the Broadway stage he was a star, playing lead roles in such productions as \"A Man for All Seasons\". He was also known as a devotee of gourmet dining, and was well known at most of the best restaurants in Hollywood and New York. He was a heavyset man, weighing over 290 pounds during most of his lifetime. Just prior to his death his doctor had placed him on a diet. At the time of his death his weight was less than 150 pounds. He was survived by a sister who lived in New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDg4ODMwMDU0MV5BMl5BanBnXkFtZTcwNDY5OTkwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0327089","name":"Thomas Gomez","idIMDB":"nm0327089"},"actorId":"nm0327089","character":"Hakim","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeni Le Gon","urlProfile":"http://www.imdb.com/name/nm0494335","urlPhoto":"","biography":{"dateOfBirth":"14 August 1916","placeOfBirth":" Georgia, USA","birthName":"Jennie May Ligon","bio":"Born in 1916 in Chicago, Jeni Le Gon trained at Mary Bruce's School of Dancing and performed as a chorus girl, later in vaudeville, from age 16. In Hollywood she appeared in her debut film, Hooray for Love (1935), as dancing partner of the great Bill Robinson. Though primarily a dancer, Jeni sang well and was an appealing, attractive light actress when (rarely) given the chance. In Hollywood films 1935-49, her earlier appearances were in specialty dance numbers; later, as with most black stars of the time, in servant roles. In the forties, Jeni played leads or second leads in at least 5 independently produced all-black cast films. She appeared on the New York stage periodically (playing leads in all-black productions) and later managed the Dance and Drama Playhouse in Los Angeles. After guest appearances on \"Amos 'N' Andy\" (1951) she faded from public view.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0494335","name":"Jeni Le Gon","idIMDB":"nm0494335"},"actorId":"nm0494335","character":"Dresser","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Greig","urlProfile":"http://www.imdb.com/name/nm0340063","urlPhoto":"","biography":{"dateOfBirth":"27 December 1879","placeOfBirth":" Melbourne, Victoria, Australia","bio":"Robert Greig was born on December 27, 1879 in Melbourne, Victoria, Australia. He was an actor, known for Sullivan's Travels (1941), The Lady Eve (1941) and Trouble in Paradise (1932). He was married to Beatrice Denver Holloway. He died on June 27, 1958 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0340063","name":"Robert Greig","idIMDB":"nm0340063"},"actorId":"nm0340063","character":"Eunuch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Coleman","urlProfile":"http://www.imdb.com/name/nm0170969","urlPhoto":"","biography":{"dateOfBirth":"22 December 1885","placeOfBirth":" Sydney, New South Wales, Australia","birthName":"Charles Pearce Coleman","bio":"Charles Coleman was born on December 22, 1885 in Sydney, New South Wales, Australia as Charles Pearce Coleman. He was an actor, known for The Gay Divorcee (1934), The Rage of Paris (1938) and It Started with Eve (1941). He was married to Beatrice. He died on March 8, 1951 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0170969","name":"Charles Coleman","idIMDB":"nm0170969"},"actorId":"nm0170969","character":"Eunuch","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0034465","urlIMDB":"http://www.imdb.com/title/tt0034465","business":{"budget":null,"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1942/\">1942</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 26 min (86 min)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Color (Technicolor)"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":["Technicolor (uncredited)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.3","filmingLocations":[{"location":"Universal Studios - 100 Universal City Plaza, Universal City, California, USA"}],"rated":"UNRATED","awards":[{"award":"Academy Awards, USA 1943","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Cinematography, Color","names":[{"name":"Milton R. Krasner","id":"nm0005762","role":null},{"name":"William V. Skall","id":"nm0005877","role":null},{"name":"W. Howard Greene","id":"nm0338946","role":null}]},{"category":"Best Art Direction-Interior Decoration, Color","names":[{"name":"Alexander Golitzen","id":"nm0326529","role":null},{"name":"Jack Otterson","id":"nm0653163","role":null},{"name":"Russell A. Gausman","id":"nm0310199","role":null},{"name":"Ira Webb","id":"nm0916129","role":null}]},{"category":"Best Sound, Recording","names":[{"name":"Bernard B. Brown","id":"nm0113094","role":"Universal SSD"}]},{"category":"Best Music, Scoring of a Dramatic or Comedy Picture","names":[{"name":"Frank Skinner","id":"nm0804244","role":null}]}]}]}],"votes":"899","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"},{"idCompany":"co0035064","name":"Walter Wanger Productions"}],"keywords":{"keywords":["slavery","love","performer","dancing girl","poison","dancing","hiding","escape","dancer","arab","evil man","punishment","knife","fight","present","boy","whip","prison","false identity","gift","jail","romantic triangle","wine","poisoned wine","nursing someone back to health","secret identity","falling rock","belief in destiny","hit with a rock","shot with an arrow","arrow","adolescent","assassination attempt","killing","death","dead man","falling from height","aladdin","sinbad","applause","human pyramid","fat man","poisoned drink","hit in the stomach","ring","presumed dead","pity","usurper","spitting in someone's face","brother brother relationship","reading aloud","comic relief","book","storybook","man disguised as a woman","mercy","male in female clothes","cross dressing","man in woman's clothes","sword fight","sword","stabbed in the back","eeny meeny miny moe","daring someone to cross the line","black boy","sentry","auctioneer","auction","dresser","captain","corporal","villain","slave market","swinging on a rope","bound in chains","chain","veil","fire","falling into water","eunuch","unconsciousness","knocked unconscious","hit with a stick","tripping someone","hiding someone","leopard","pool","swimming","magic trick","handkerchief","ruler","friendship","friend","blacksmith","baghdad mesopotamia","pretending to be sick","human in a cage","caged human","cage","monkey","slave","broken on the wheel","blind man","blindness","blind beggar","pretending to be dying","shaving off someone's beard","shaving someone","shaving","chase","falling horse","horse","palace","betrayal by brother","betrayal","bare chested male","tent","rack torture","vulture","turban","torture","slave auction","litter","harem","desert","catfight","camel","beggar","arrow in one's chest","arrow in back","acrobat","arabian"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:00:11"}}