{"data":{"movies":[{"title":"Fantomas","originalTitle":"Fantômas","year":"1964","releaseDate":"19641104","directors":[{"name":"André Hunebelle","id":"nm0402161"}],"writers":[{"name":"Pierre Souvestre","id":"nm0816232"},{"name":"Marcel Allain","id":"nm0019855"}],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NDc1MTA3MF5BMl5BanBnXkFtZTcwMTE3NzE3MQ@@._V1.jpg","countries":["France","Italy"],"languages":["French"],"genres":["Comedy","Crime","Adventure","Fantasy"],"plot":"Criminal mastermind Fantômas, a man of a thousand faces, is unhappy with Fandor, a journalist whose written a fictive interview of him. He kidnaps Fandor, threatens to kill him, but first goes about ruining the journalist's reputation by committing a sensational crime in Fandor's guise. Hot on the trail is police Commissaire Juve, so Fantômas commits a crime looking like him. Soon, our intrepid heroes, Fandor and Juve, with the help of Fandor's girlfriend Hélène, are on the mastermind's trail, but who's in control?","simplePlot":"Criminal mastermind Fantômas, a man of a thousand faces, is unhappy with Fandor, a journalist whose written a fictive interview of him. He kidnaps Fandor, threatens to kill him, but first ... ","actors":[{"actorName":"Jean Marais","urlProfile":"http://www.imdb.com/name/nm0544786","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NjA0NzA5NF5BMl5BanBnXkFtZTcwNDMxMTMwNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 December 1913","placeOfBirth":" Cherbourg, Manche, France","birthName":"Jean Alfred Villain-Marais Vassord","height":"5' 10¾\" (1.8 m)","bio":"Jean Marais was a popular French cinema actor and director who played over 100 roles in film and on television, and was also known for his many talents as a writer, painter and sculptor. He was born Jean Alfred Villain-Marais on December 11, 1913, in Cherbourg, France. His father practiced veterinarian medicine, then fought in the World War I, and eventually left the family. Young Jean Marais was taken to Paris at the age of 4. There he was raised by his mother and grandmother. He attended the Lycée Condorcet, a prestigious State school where also studied his future film partners such as Louis de Funes and Jean Cocteau, and the faculty had such figures as Jean-Paul Sartre. At the age of 13, Marais dropped out of Lycee Condorcet, he tried several other schools, albeit he did not complete his college education, instead he was placed in a Catholic boarding school. At 16, he left school and became involved in amateur acting. After being rejected from drama schools, he took a job as a photographer's assistant and also worked as a caddy at a golf club. In 1933 Marais made his film debut in L'épervier (1933) (aka.. Les Amoureux), by director Marcel L'Herbier. In 1937, at a stage rehearsal of 'King Aedipus', Marais met Jean Cocteau, and they remained close friends until Cocteau's death. Cocteau had a major influence on life and career of Jean Marais who appeared in almost every one of Cocteau's films. Together they made such classics as Beauty and the Beast (1946), Orpheus (1950) and Testament of Orpheus (1960), to name a few. During the World War II, Marais was an actor in the occupied Paris. After liberation of Paris in 1944, he became a truck driver for the French Army, he was decorated for his courage. During the war Marais was married to his film partner, actress Mila Parély, and their marriage was blessed by Cocteau, who wanted Marais to be happy. Marais and Mila Parély divorced after two years of marriage, and shortly after their divorce, they worked together again in 'Beauty and the Beast' (1946), under directorship of Jean Cocteau. During the 1950s, Marais shot to international fame, after starring in films directed by Cocteau, Visconti, and others. During the 1960s and 1970s, Marais went on to star in several popular comedies, such as the Fantomas (1964) trilogy by director André Hunebelle. He co-starred with many major French actors of the time, including such stars as Louis de Funès and Mylène Demongeot in the Fantomas trilogy, and also Jean Gabin, Guy Delorme, Bourvil, Danielle Darrieux, Michèle Morgan, and Yves Montand. Jean Marais was also a remarkable stage actor known for his association with Théâtre de Paris, Théâtre de l'Atelie, and the Comédie Francaise, among others. Marais received numerous international awards and recognitions for his contribution to film art, including the French Legion of Honour (1996). He spent his later years living in his house in Vallaruis, in the South of France where he was involved in painting, sculpture and pottery, and was visited by Pablo Picasso and other cultural figures. Jean Marais died of a heart failure on November 8, 1998, in Cannes, France, and was laid to rest in the small Cemetiere de Vallauris, France.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NjA0NzA5NF5BMl5BanBnXkFtZTcwNDMxMTMwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0544786","name":"Jean Marais","idIMDB":"nm0544786"},"actorId":"nm0544786","character":"Fantômas / Fandor","urlCharacter":"http://www.imdb.com/character/ch0027282","main":true},{"actorName":"Louis de Funès","urlProfile":"http://www.imdb.com/name/nm0000086","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc5NTkyMDU4Nl5BMl5BanBnXkFtZTgwNzk0NTM1NTE@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1914","placeOfBirth":" Courbevoie, Seine [now Hauts-de-Seine], France","birthName":"Louis Germain de Funès de Galarza","height":"5' 4½\" (1.64 m)","bio":"Louis Germain David de Funès de Galarza was born on July 31, 1914, in Courbevoie, France. His father, named Carlos Luis de Funes de Galarza, was a former lawyer of Seville, Spain, who became a diamond cutter. His mother, named Leonor Soto Reguera, was of Spanish and Portugese extraction. Young Louis de Funès was fond of drawing and piano playing. He dropped out of school and worked various jobs, mostly as a jazz pianist at Pigalle, making his customers laugh every time he made a grimace. He studied acting for one year at the Simon acting school. There he made some useful contacts, including Daniel Gélin among others. During the occupation of Paris in the Second World War, he continued his piano studies at a music school, where he fell in love with a secretary, named Jeanne de Maupassant, a grand-niece of writer Guy de Maupassant. She had fallen in love with \"the young man who played jazz like god\"; they married in 1943, and had two sons born in 1944 and 1949. Funès continued playing piano at clubs, knowing there wasn't much call for a short, balding, skinny actor. His wife and Daniel Gelin encouraged him until he managed to overcome his rejection. He made his film debut in 1945, at the age of 31, and went on playing about one hundred film roles in the next twenty years. Louis de Funès shot to international fame in the 1960's after his roles in such slapstick comedies as 'Le gendarme de St. Tropez' (The Gendarme of St. Tropez 1964) and the Fantomas (1964) trilogy. He brilliantly portrayed a funny French policeman, whose hilarious hyperactivity, uncontrolled anger, and sardonic laughter produced a highly comic effect. Funès was voted the most favorite actor in France in 1968, and remained very popular in Europe during the 1970's. He also continued to play on stage during his career as a film star, and was acclaimed for his stage works in classic French theatre. Funès was instrumental in making film adaptations of such theatre plays as 'Oscar continues' and the Moliere's 'Le Misere', among other plays. Nicknamed \"the man with the forty faces per minute\", Louis de Funès played bit parts in over eighty films, before he got his first leading roles, eventually becoming the leading French comedian. He co-starred with the major French actors of the time, including Jean Marais and Mylène Demongeot in the Fantomas trilogy, and also Jean Gabin, Fernandel, Bourvil, Coluche, Annie Girardot, and Yves Montand. Funès's collaboration with director 'Gerard Oury' produced a memorable tandem of Funès-Bourvil. He also worked with Jean Girault in the famous 'Gendarmes' series. In a departure from the Gendarme image, Funès collaborated with Claude Zidi, who wrote for him a new character full of nuances and frankness in L'aile ou la cuisse (1976), which is arguably the best of his roles. Funès played over 130 roles in film and over 100 roles on stage. From 1943-1983 Louis de Funès was married to Jeanne Barthelemy de Maupassant. Their son, named 'Olivier De Funes' , had a brief acting career before becoming a pilot with Air France, his other son, named Patric de Funes, became a medical doctor. Louis de Funès was also a rose grower, a variety of roses has been named the \"Louis de Funès rose\" after him. He died of a heart attack and complications of a stroke on January 27, 1983, in Nantes, France. He was laid to rest in the Cimetière du Cellier, and a monument of him was erected in the rose-garden of his wife's castle.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc5NTkyMDU4Nl5BMl5BanBnXkFtZTgwNzk0NTM1NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000086","name":"Louis de Funès","nicknames":["Fufu"],"idIMDB":"nm0000086"},"actorId":"nm0000086","character":"Le commissaire Juve","urlCharacter":"http://www.imdb.com/character/ch0027411","main":true},{"actorName":"Mylène Demongeot","urlProfile":"http://www.imdb.com/name/nm0218634","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NTExNTkxM15BMl5BanBnXkFtZTcwOTEyNDc3MQ@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1935","placeOfBirth":" Nice, Alpes-Maritimes, France","birthName":"Marie-Hélène Demongeot","height":"5' 7¼\" (1.71 m)","bio":"Mylène Demongeot, one of the blond sex symbols of French cinema during the 1950s and 1960s, managed to overcome typecasting and survived a long hiatus before a stellar comeback in her 70s. She appeared in more than 70 films, including such classics as the Fantomas trilogy. She was born Marie-Helene Demongeot on September 29, 1935, in Nice, France, into a family of actors. Her parents met in Shanghai, China, and moved to Nice, where she grew up. Her mother, Klaudia Trubnikova, was a Russian-Ukrainian émigré from Kharkiv who escaped from the horrors of the Russian Civil War. Her father, Alfred Demongeot, was of French-Italian heritage. The family was bilingual and young Mylene was able to speak Russian and French, but eventually switched to French. As a young girl she was an outcast--she suffered from ruthless kids making vicious comments about her eyes (she was cross-eyed until she had surgery in her teens). She was fond of music and movies, a perfect escape from the horrors of WWII that devastated Europe during her childhood. At the age of 13 she went to Paris and continued her education. She studied piano under the tutelage of Marguerite Long and Yves Nat. She then studied dramatic art with Maria Ventura at Le Cours Simon in Paris. At 15 she became a model in the atelier of Pierre Cardin. At 17 Mylene made her film debut in the supporting role of Nicole in Children of Love (1953) (\"Children of Love\"). Appearing in three or four feature films every year, she rose to international fame in the late 1950s. She was together with Gary Cooper for the opening of the first escalator to be installed in a cinema, at the Rex Theatre in Paris, on June 7, 1957. She had a memorable seduction scene opposite Yves Montand in The Crucible (1957) (\"The Crucible\"). Her first notable leading role was in Be Beautiful But Shut Up (1958) (aka \"Blonde for Danger\"), in which she played a 17-year-old jewel smuggler. Mylene further developed her screen image of a manipulative blond mistress in her brilliant performance opposite David Niven in Bonjour Tristesse (1958), and became permanently locked in the cliché image of a humorous seductress after co-starring with Alain Delon in the 1959 comedy Three Murderesses (1959). Her chance to update her film image came in \"period\" films. She played manipulative and coquettish Andromeda opposite Steve Reeves in The Giant of Marathon (1959) (\"The Giant of Marathon\") and the leading role of Rea opposite Roger Moore in Romulus and the Sabines (1961) (\"Romulus and the Sabines\"). Among her best known roles are the manipulative Milady de Winter in Les trois mousquetaires: Tome I - Les ferrets de la reine (1961) and Helen in all three of the \"Fantomas\" films. Mylene Demongeot became one of the blond sex symbols in 1950s, 1960s and 1970s French cinema. She co-starred with the major French actors of the time, including Jean Marais and Louis de Funès, in the Fantomas (1964) trilogy. Although she gradually phased out of the stereotypical image of a beautiful French coquette, she still looked pretty convincing as a middle-aged Madame, which she developed in the 1980s and 1990s. At that time her acting career came to a pause, as she had been aging gracefully in the South of France. She was also a producer during that time, and was the co-owner of Kangarou Films, a production company that she founded with her late husband Marc Simenon. After a lengthy hiatus she made a comeback in 36th Precinct (2004). She has also appeared in Camping (2006) and La Californie (2006) by director/writer Jacques Fieschi, based on a short story by Georges Simenon. In addition to her film work, Mylene has also written several books, the best-known of which would be \"Tiroirs Secrets\" and \"Animalement vôtre\". In the 2000s she made a pilgrimage to the birthplace of her mother in Kharkov, Ukraine. There she planted a commemorative tree and presented her autobiographical book, \"Les Lilas de Kharkov\" (The Lilacs of Kharkiv). In 2006 she was named Commander in the Order of Arts and Letters for her achievements in acting. She resides in her French hometown of Nice.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NTExNTkxM15BMl5BanBnXkFtZTcwOTEyNDc3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0218634","name":"Mylène Demongeot","idIMDB":"nm0218634"},"actorId":"nm0218634","character":"Hélène","urlCharacter":"http://www.imdb.com/character/ch0055349","main":true},{"actorName":"Jacques Dynam","urlProfile":"http://www.imdb.com/name/nm0245934","urlPhoto":"","biography":{"dateOfBirth":"30 December 1912","placeOfBirth":" Paris, France","birthName":"Jacques André François Joseph Dynam-Barbe","bio":"Jacques Dynam was born on December 30, 1912 in Paris, France as Jacques André François Joseph Dynam-Barbe. He is known for his work on Fantomas (1964), Fantômas se déchaîne (1965) and French Connection II (1975). He died on November 12, 2004 in Paris.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0245934","name":"Jacques Dynam","idIMDB":"nm0245934"},"actorId":"nm0245934","character":"L'inspecteur Bertrand","urlCharacter":"http://www.imdb.com/character/ch0055347","main":true},{"actorName":"Robert Dalban","urlProfile":"http://www.imdb.com/name/nm0197592","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA2NTg4NmUtMWNjNC00M2MxLWFiYzYtMDdhOGY0MDI2YzQ3XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 July 1903","placeOfBirth":" Celles-sur-Belle, Deux-Sèvres, France","birthName":"Gaston Barré","bio":"Robert Dalban was born on July 19, 1903 in Celles-sur-Belle, Deux-Sèvres, France as Gaston Barré. He is known for his work on Diabolique (1955), Fantomas (1964) and Monsieur Gangster (1963). He was married to Madeleine Robinson. He died on April 3, 1987 in Paris, France.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA2NTg4NmUtMWNjNC00M2MxLWFiYzYtMDdhOGY0MDI2YzQ3XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0197592","name":"Robert Dalban","idIMDB":"nm0197592"},"actorId":"nm0197592","character":"Le directeur du journal","urlCharacter":"http://www.imdb.com/character/ch0055350","main":true},{"actorName":"Marie-Hélène Arnaud","urlProfile":"http://www.imdb.com/name/nm0036071","urlPhoto":"","biography":{"dateOfBirth":"24 September 1934","placeOfBirth":" Montmorency, Seine-et-Oise, France","bio":"Marie-Hélène Arnaud was born on September 24, 1934 in Montmorency, Seine-et-Oise, France. She was an actress, known for Fantomas (1964), The Twilight Girls (1957) and Mannequins de Paris (1956). She died on October 6, 1986 in Paris, France.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0036071","name":"Marie-Hélène Arnaud","idIMDB":"nm0036071"},"actorId":"nm0036071","character":"Lady Beltham","urlCharacter":"http://www.imdb.com/character/ch0095039","main":true},{"actorName":"Anne-Marie Peysson","urlProfile":"http://www.imdb.com/name/nm1128735","urlPhoto":"","biography":{"dateOfBirth":"24 July 1935","placeOfBirth":" Saint-Disdier, Hautes-Alpes, France","birthName":"Anne-Marie Marguerite Peysson","bio":"Anne-Marie Peysson was born on July 24, 1935 in Saint-Disdier, Hautes-Alpes, France as Anne-Marie Marguerite Peysson. She was an actress, known for Grand Prix R.T.L. International 70 (1970), Grand Prix R.T.L. International 71 (1971) and Fantomas (1964). She was married to Alain Krauss and Jean Falloux. She died on April 14, 2015 in Le Vésinet, Yvelines, France.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1128735","name":"Anne-Marie Peysson","idIMDB":"nm1128735"},"actorId":"nm1128735","character":"La speakerine","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christian Toma","urlProfile":"http://www.imdb.com/name/nm0866317","urlPhoto":"","biography":{"bio":"Christian Toma is an actor, known for Fantomas (1964), Fantômas se déchaîne (1965) and Le raisin d'or (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0866317","name":"Christian Toma","idIMDB":"nm0866317"},"actorId":"nm0866317","character":"Un inspecteur","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michel Duplaix","urlProfile":"http://www.imdb.com/name/nm0243241","urlPhoto":"","biography":{"dateOfBirth":"1 December 1932","placeOfBirth":" Paris, France","bio":"Michel Duplaix was born on December 1, 1932 in Paris, France. He is an actor, known for Fantomas (1964), Fantômas se déchaîne (1965) and The Mad Adventures of 'Rabbi' Jacob (1973).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0243241","name":"Michel Duplaix","idIMDB":"nm0243241"},"actorId":"nm0243241","character":"Un inspecteur","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrée Tainsy","urlProfile":"http://www.imdb.com/name/nm0846841","urlPhoto":"","biography":{"dateOfBirth":"26 April 1911","placeOfBirth":" Etterbeek, Brussels, Belgium","birthName":"Andrée Micheline Ghislaine Tainsy.","bio":"Andrée Tainsy was supposed to make her screen debut in Pierre Fresnay's film Le duel (1941) but the film was interrupted in 1939 by the declaration of war. When the Armistice was signed with Germany in June 1940, she decided to flee Paris, and eventually France. Her exile first took her to Argentina, first in Mendoza then to Buenos Aires where she joins actors Rachel Bérendt , Madeleine Ozeray, Maurice Castel and author Jacques Théry. From there on she traveled to Chile where 'Jacques Rémy' rallied a troupe of exiled European comedians (Robert Darène, Nora Gregor, Grégoire Aslan) to shoot the film Le fruit mordu (1945) (called in French \"Le moulin des Andes\"). She returned to France after the war where she settled for good.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0846841","name":"Andrée Tainsy","idIMDB":"nm0846841"},"actorId":"nm0846841","character":"L'habilleuse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hugues Wanner","urlProfile":"http://www.imdb.com/name/nm0911197","urlPhoto":"","biography":{"dateOfBirth":"19 October 1907","placeOfBirth":" Lausanne, Switzerland","bio":"Hugues Wanner was born on October 19, 1907 in Lausanne, Switzerland. He was an actor, known for Fantomas (1964), The Night of the Following Day (1968) and Four Bags Full (1956). He died on October 29, 1993.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0911197","name":"Hugues Wanner","idIMDB":"nm0911197"},"actorId":"nm0911197","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Henri Attal","urlProfile":"http://www.imdb.com/name/nm0040933","urlPhoto":"","biography":{"dateOfBirth":"13 May 1936","placeOfBirth":" Paris, France","bio":"Henri Attal was born on May 13, 1936 in Paris, France. He was an actor, known for My Life to Live (1962), Les Biches (1968) and My New Partner (1984). He died on July 24, 2003 in Cucq, Pas-de-Calais, France.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0040933","name":"Henri Attal","idIMDB":"nm0040933"},"actorId":"nm0040933","character":"Un garde du corps / Bodyguard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jacques Berger","urlProfile":"http://www.imdb.com/name/nm0074214","urlPhoto":"","biography":{"bio":"Jacques Berger is an actor, known for Fantomas (1964), Youthful Sinners (1958) and Premier mai (1958).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0074214","name":"Jacques Berger","idIMDB":"nm0074214"},"actorId":"nm0074214","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pierre Collet","urlProfile":"http://www.imdb.com/name/nm0171772","urlPhoto":"","biography":{"dateOfBirth":"10 March 1914","placeOfBirth":" Montrouge, Seine [now Hauts-de-Seine], France","bio":"Pierre Collet was born on March 10, 1914 in Montrouge, Seine [now Hauts-de-Seine], France. He was an actor, known for Le Cercle Rouge (1970), French Connection II (1975) and Greed in the Sun (1964). He died on October 30, 1977 in Paris, France.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0171772","name":"Pierre Collet","idIMDB":"nm0171772"},"actorId":"nm0171772","character":"Un agent","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Henri Guégan","urlProfile":"http://www.imdb.com/name/nm0350174","urlPhoto":"","biography":{"dateOfBirth":"20 March 1926","placeOfBirth":" France","bio":"Henri Guégan was born on March 20, 1926 in France. He is known for his work on Fantomas (1964), Le gendarme se marie (1968) and The Troops on Vacation (1970). He died on July 8, 2011 in France.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0350174","name":"Henri Guégan","idIMDB":"nm0350174"},"actorId":"nm0350174","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0058089","urlIMDB":"http://www.imdb.com/title/tt0058089","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":[{"money":"4,492,419 (France)","country":"","day":null,"month":null,"year":null,"remarks":null}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"15","month":"07","year":"1964","remarks":null},{"money":null,"country":null,"day":"07","month":"09","year":"1964","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 40 min (100 min)"],"soundMix":["Mono"],"color":["Color (Eastmancolor)"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Franscope"],"printedFilmFormat":["35 mm"]},"rating":"7.0","filmingLocations":[{"location":"Chérence, Val-d'Oise, France"}],"rated":"TOUS PUBLICS","awards":[],"votes":"6,749","type":"Movie","companyCreditsSimple":[{"idCompany":"co0012117","name":"P.A.C."},{"idCompany":"co0051263","name":"Société Nouvelle des Établissements Gaumont (SNEG)"},{"idCompany":"co0145712","name":"P.C.M."}],"keywords":{"keywords":["journalist","police","pursuit","motorcycle cop","rubber boat","unknown villain","restaurant","writing check","widow","villain","taxi","stolen jewelry","sleeping gas","sea","sand","police commissario","photographer","newspaper article","news photographer","necklace","motorcycle","model","masked villain","masked bandit","leg in cast","jewelry","jewelry thief","jail","horse","hit in the face","fountain","fight","famous score","false news story","explosion","eiffel tower paris","commissar","chase","cemetery","card","car motorcycle chase","car chase","boyfriend girlfriend relationship","boat","bandage on head","abduction","u boat","chase on train roof","casino","motorcycle chase","submarine","kidnapping","secret headquarters","mask","helicopter","earplug","identikit picture","crane","impersonation and imposture","jewel robbery","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:27:27"}}