{"data":{"movies":[{"title":"Belle Starr's Daughter","originalTitle":"","year":"1948","releaseDate":"19481115","directors":[{"name":"Lesley Selander","id":"nm0782947"}],"writers":[{"name":"W.R. Burnett","id":"nm0122446"}],"runtime":"86 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYyMGI3ODctZmE3YS00ODNmLWFhNjEtYjI5ODRhY2M5MjMyXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Western"],"plot":"When Bob \"Bitter Creek\" Yauntis ()is accused by Belle Starr (), Queen of the outlaws of Cherokee Flats, of disobeying her orders and killing the local Marshal, he is enraged and kills her. He takes charge of the gang. The new Marshal, Tom Jackson (), meets Rose (), Belles's daughter who thinks Tom is responsible for her mother's death. He sets out to track down the gang and prove his innocence to Rose.","simplePlot":"The daughter of famous outlaw Belle Starr arrives at the town where her mother was murdered to find her killer.","actors":[{"actorName":"George Montgomery","urlProfile":"http://www.imdb.com/name/nm0599787","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQzNzM3NjI1MV5BMl5BanBnXkFtZTYwNzIwMTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 August 1916","placeOfBirth":" Brady, Montana, USA","birthName":"George Montgomery Letz","height":"6' 3\" (1.91 m)","bio":"George Montgomery was boxing champion at the University of Montana, where he majored in architecture and interior design. Dropping out a year later, he decided to take up boxing more seriously, and moved to California, where he was coached by ex-heavyweight world champion James J. Jeffries. While in Hollywood, he came to the attention of the studios (not least, because he was an expert rider) and was hired as a stuntman in 1935. After doing this for four years, George was offered a contract at 20th Century Fox in 1939, but found himself largely confined to leads in B-westerns. He did not secure a part in anything even remotely like a prestige picture, until his co-starring role in Roxie Hart (1942), opposite Ginger Rogers. Next, in Orchestra Wives (1942), he played the perfunctory love interest for Ann Rutherford -- though both, inevitably, ended up playing second trombone to Glenn Miller and His Orchestra. In 1947, George got his first serious break, being cast as Raymond Chandler's private eye Philip Marlowe, in The Brasher Doubloon (1947). Reviewers, however, compared his performance unfavourably with that of Humphrey Bogart and found the film 'pallid' overall. So it was back to the saddle for George. Unable to shake his image as a cowboy actor, he starred in scores of films with titles like Belle Starr's Daughter (1948), Dakota Lil (1950), Jack McCall, Desperado (1953) and Masterson of Kansas (1954) at Columbia, and for producer Edward Small at United Artists. When not cleaning up the Wild West with his six-shooter, he branched out into adventure films set in exotic locales (notably as Harry Quartermain in Watusi (1959)). During the 60's, he also wrote, directed and starred in several long-forgotten, low-budget wartime potboilers made in the Philippines. At the height of his popularity, George attracted as much publicity for his acting, as for his liaisons with glamorous stars, like Ginger Rogers, Hedy Lamarr (to whom he was briefly engaged) and singer Dinah Shore (whom he married in 1943). After his retirement from the film business, he devoted himself to his love of painting, furniture-making and sculpting bronze busts, including one of his close friend Ronald Reagan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQzNzM3NjI1MV5BMl5BanBnXkFtZTYwNzIwMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0599787","name":"George Montgomery","idIMDB":"nm0599787"},"actorId":"nm0599787","character":"Marshal Tom Jackson","urlCharacter":"http://www.imdb.com/character/ch0471893","main":true},{"actorName":"Rod Cameron","urlProfile":"http://www.imdb.com/name/nm0131713","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTNiZTFhOTYtZmJjOC00NWUwLWFjY2UtNDljNmI2Y2UwYmM2L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 December 1910","placeOfBirth":" Calgary, Alberta, Canada","birthName":"Nathan Roderick Cox","height":"6' 5\" (1.96 m)","bio":"The well-worn phrase \"Tall in the saddle\" is certainly one easy way of describing (and perhaps pigeon-holing) leathery, wiry-framed 1940s and early 1950s western film star Rod Cameron, although he proved quite capable in crime stories, horrors and even swing-era musicals. The 6'4\" Canadian-born actor was born Nathan Roderick Cox on December 7, 1910, and raised in Alberta. Once his aspirations of becoming a Royal Canadian Mountie passed, he decided to seek fame and fortune as an actor in New York and initially grabbed some work as a laborer on the Holland Tunnel project in Manhattan. When no progress was made acting-wise, he moved to California where he made his \"debut\" in an unbilled bit in one of Bette Davis' scenes in The Old Maid (1939). Upon release, however, he discovered his bit in the scene had been deleted. Cameron found a slight \"in\" (as in \"stand-in\") with Paramount Pictures for such stars as Fred MacMurray while managing to find himself sparingly used in other Paramount films. To supplement his income he also played leading man in the studio's screen tests for starlet wanna-bes and his athleticism paid off playing stunt double for such established cowboy icons as Buck Jones. Cameron toiled as a bit player for quite some time and appeared insignificantly in such classics as Christmas in July (1940) and North West Mounted Police (1940) (where he fulfilled his early wish by playing a Mountie!). Occasionally he would find a noticeable secondary role, in such lesser films as The Monster and the Girl (1941), The Forest Rangers (1942) and as Jesse James in The Remarkable Andrew (1942). Cameron's banner year was 1943, when he finally broke out of the minor leagues and into the major ranks. His breakout screen role was as clench-jawed Agent Rex Bennett, out to bring down the foreign enemy and save the world, in the Republic serial cliffhangers G-men vs. the Black Dragon (1943) and Secret Service in Darkest Africa (1943). From there he was signed by Universal to appear in a flurry of low-budget westerns with Fuzzy Knight as his comic sidekick. Aside from the rough-hewn heroics he was paid to display, he would occasionally show a softer side for the ladies, such as with fellow Canadian Yvonne De Carlo in Salome Where She Danced (1945), Frontier Gal (1945) and River Lady (1948). Seldom would he venture outside the action genre, however, one of the few times being his role as a symphony conductor in Swing Out, Sister (1945). For the most part he remained rooted in westerns and the only variance within that realm was the occasional black-hatted bad guy. Among Cameron's many dusty showcases (more often than not made at Republic or Universal), Brimstone (1949), Stampede (1949), Dakota Lil (1950) and San Antone (1953) are worth a good look. Cameron never found his Stagecoach (1939) or Shane (1953), a vehicle that might have held him even \"taller\" in the saddle, but between 1953 and 1955 he was still ranked \"top 5\" box-office. In the 1950s Cameron found time to settle into a couple of syndicated TV series. Both City Detective (1953) and State Trooper (1956) lasted a couple of seasons. He also guested on the more popular western series, such as Bonanza (1959), Laramie (1959) and The Virginian (1962). When his movie career began to fade in the early 1960s, he went to Spaain for a few spaghetti westerns and appeared in a couple of low-budget westerns such as Requiem for a Gunfighter (1965) and The Bounty Killer (1965), which was noticed more for reuniting sagebrush stars from yesteryear than for its high quality. He also played an aging rodeo star who dies early in the story in the biopic Evel Knievel (1971). The only serious tabloid scandal he ever found himself in was when he divorced wife Angela Alves-Lico (1950-1960) and then immediately married his ex-wife's mother, Dorothy, who was a few years older than him. An extended battle with cancer finally claimed the 72-year-old actor in 1983 at a Gainesville, Georgia, hospital.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTNiZTFhOTYtZmJjOC00NWUwLWFjY2UtNDljNmI2Y2UwYmM2L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0131713","name":"Rod Cameron","idIMDB":"nm0131713"},"actorId":"nm0131713","character":"Bob 'Bitter Creek' Yauntis","urlCharacter":"http://www.imdb.com/character/ch0480854","main":true},{"actorName":"Ruth Roman","urlProfile":"http://www.imdb.com/name/nm0738746","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjcyMDA1MjAyOF5BMl5BanBnXkFtZTcwNjcwOTgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 December 1922","placeOfBirth":" Lynn, Massachusetts, USA","birthName":"Norma Roman","bio":"Ruth Roman was born in Lynn, Massachusetts, the youngest of three daughters of Lithuanian-Jewish parents, Mary Pauline (Gold) and Abraham Roman. Her father, a carnival barker, died when she was a small child, forcing her mother to support the family by working as a waitress and cleaning woman. Ruth grew up in the poor tenement district of Boston, Massachusetts, where she went to school. However, she left school after just two years to pursue an acting career. Her chosen path proved to be strewn with obstacles: in New York, she obtained a job posing for stills for a crime magazine, but theatrical work eluded her. She then worked as a hat check girl at a night club before calling it quits and returning to Boston. There, she made ends meet as an usherette during the day while at night performing with the New England Repertory Company, her first steady acting job. She also studied drama and eventually graduated from the Bishop-Lee Theatre School. Trying to get into films, Ruth unsuccessfully made the rounds of agents and producers for two years (1940-42), until a bit part as a WAVE came her way in the film Stage Door Canteen (1943). With $200 to her name, she purchased a one-way ticket to Hollywood, where she found shared accommodation with other aspiring starlets - naming it, optimistically, 'the House of the Seven Garbos'. After a screen test with Warner Brothers failed to result in a contract, Ruth had another run of six hard years playing bit parts, many of them uncredited, some ending up on the cutting room floor. A sole speaking part of consequence was in the titular role of Jungle Queen (1945), a Universal serial (after subsequent acting lessons, Ruth was aghast, when the serial was re-released in 1951). Ruth finally got her big break when producer Dore Schary cast her (against character, as a murderess) in the RKO thriller The Window (1949). That same year, she successfully auditioned for Stanley Kramer's boxing drama Champion (1949) as the dependable wife of the fighter (Kirk Douglas). After this turning point in her life, the shapely, smoky-voiced brunette secured a contract with Warner Brothers. During the next phase of her career, she moved effortlessly from glamorous and seductive to demure and wholesome, in films opposite stars like James Stewart, Errol Flynn and Gary Cooper. Look Magazine billed her as the 'Big Time Movie Personality of 1950', and by the following year she was receiving some 500 fan letters per week. While many of her leads were in westerns (albeit mostly A-grade ones), Ruth was somewhat more memorable in support of Farley Granger (as his upper-crust lover and the raison d'etre for the planned murder of his wife) in Alfred Hitchcock's Strangers on a Train (1951). Another off-beat role was as a gangster's moll in the British-made updated Shakespearean adaptation Joe MacBeth (1955). As Lily, she is the power behind angst-ridden Paul Douglas ('Joe'), whom she easily manipulates to do her bidding. In The Bottom of the Bottle (1956), she was at her dependable best as the supportive wife of alcoholic Van Johnson. Arguably, her last noteworthy performance on the big screen was in Alexander Singer's romance/drama Love Has Many Faces (1965). By the 1960s, Ruth had made the transition to middle-aged character parts and began to appear mostly on television, in shows like The Outer Limits (1963), Mannix (1967), Gunsmoke (1955), and (in a recurring role) in The Long, Hot Summer (1965). She also toured nationally with theatrical productions of \"Plaza Suite\", \"Who's Afraid of Virginia Woolf\" and \"Two for the Seesaw\". For the actress, who was said to disdain the trimmings of Hollywood stardom, real-life drama came when she and her son counted among the 760 survivors of the sinking of the luxury cruise liner 'Andrea Doria' in 1956. In September 1967, she jumped from her burning car, but still managed to make her scheduled performance in \"Beekman Place\" at the Ivanhoe Theatre. Ruth died in September 1999 at her home in Laguna Beach, aged 75.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjcyMDA1MjAyOF5BMl5BanBnXkFtZTcwNjcwOTgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0738746","name":"Ruth Roman","idIMDB":"nm0738746"},"actorId":"nm0738746","character":"Cimarron Rose","urlCharacter":"http://www.imdb.com/character/ch0480855","main":true},{"actorName":"Wallace Ford","urlProfile":"http://www.imdb.com/name/nm0285922","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDZjZTM3YzYtMzkwNS00NGZkLTg5OTctYzAyYWFmMmEzMWI2L2ltYWdlXkEyXkFqcGdeQXVyMjU5OTg5NDc@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1898","placeOfBirth":" Bolton, Lancashire, England, UK","birthName":"Samuel Jones Grundy","height":"5' 8\" (1.73 m)","bio":"A stocky, friendly-faced character actor, Ford was born Samuel Jones in England and his childhood rivaled the brutality that Charles Dickens ever dreamed up. He lived for a while in an orphanage after being separated from his parents. While still young, he was sent to a Toronto branch of the orphanage. There, he began a cycle that involved living in 17 foster homes - the longest being with a farm family that treated him like a slave. At age 11 he ran away and joined a vaudeville troupe called the Winnepeg Kiddies, with whom he stayed until 1914. He then joined a friend named Wallace Ford and the two 'hoboed\" their way into the United States. After the friend was crushed to death by a railroad car, he took the name Wallace Ford in his memory and found work in theatrical troupes and repertory companies. On Broadway he acted in \"Abraham Lincoln\", \"Abie's Irish Rose\", and \"Bad Girl\". He left Broadway in 1932 to appear with Joan Crawford in Possessed (1931); he also landed the lead in MGM's notorious Freaks (1932), although his fellow actors proved more memorable. He also co-starred as Walter Huston's amoral brother in one of the studio's few full-blown gangster melodramas, The Beast of the City (1932), starring Jean Harlow in arguably her most hard-bitten role. In all he appeared in over 200 films including five directed by John Ford (The Last Hurrah (1958), The Whole Town's Talking (1935), They Were Expendable (1945), The Lost Patrol (1934) and The Informer (1935)). He also appeared with Henry Fonda in the TV series, \"The Deputy\" that ran from 1959-60. Ford died of a heart attack soon after his last memorable role as \"Old Pa\" in the hit Sidney Poitier drama, A Patch of Blue (1965).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDZjZTM3YzYtMzkwNS00NGZkLTg5OTctYzAyYWFmMmEzMWI2L2ltYWdlXkEyXkFqcGdeQXVyMjU5OTg5NDc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0285922","name":"Wallace Ford","idIMDB":"nm0285922"},"actorId":"nm0285922","character":"Lafe Bailey","urlCharacter":"http://www.imdb.com/character/ch0507956","main":true},{"actorName":"Charles Kemper","urlProfile":"http://www.imdb.com/name/nm0447405","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGQ2YjhkOTEtZWE1NC00YTJhLWExZmItZGZkOWZkM2U0NzQ2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1900","placeOfBirth":" Oklahoma, USA","bio":"Charles Kemper was born on September 6, 1900 in Oklahoma, USA. He was an actor, known for Scarlet Street (1945), On Dangerous Ground (1951) and The Southerner (1945). He died on May 12, 1950 in Burbank, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGQ2YjhkOTEtZWE1NC00YTJhLWExZmItZGZkOWZkM2U0NzQ2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0447405","name":"Charles Kemper","idIMDB":"nm0447405"},"actorId":"nm0447405","character":"Deputy Gaffer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Phipps","urlProfile":"http://www.imdb.com/name/nm0681055","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGU0MWU2MWYtNTNjMC00ZTBiLWJjMDgtOTNkYjkxMTI3ZDQ1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1922","placeOfBirth":" Vincennes, Indiana, USA","bio":"In the early days of 1950s science-fiction, one of the first people to become identified with the genre was actor William Phipps. Aside from furnishing the voice of Prince Charming in Disney's cartoon classic Cendrillon (1950), Phipps also hid his boyish face beneath a beard as the star of Arch Oboler's end-of-the-world melodrama Five (1951); made a token appearance in Oboler's The Twonky (1953); encountered Martians in both Invaders from Mars (1953) and The War of the Worlds (1953); and took on the Abominable Snowman as one of the leads in The Snow Creature (1954). Most notoriously, he even grappled with Moon maidens set on world conquest in the almost indescribable Cat-Women of the Moon (1953). Phipps was born in Vincennes, Indiana, and grew up in St. Francisville, Illinois; he knew from boyhood that he was destined to be an actor and appeared in several plays in grade school and at Eastern Illinois University. Hitchhiking to Hollywood in 1941, he worked on the stage and later in films, beginning with RKO's Crossfire (1947). Over the next 60 years he amassed a long list of film and TV credits; he also did commercials and voiceover work, including the narration for the special 190-minute TV version of David Lynch's Dune (1984).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGU0MWU2MWYtNTNjMC00ZTBiLWJjMDgtOTNkYjkxMTI3ZDQ1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0681055","name":"William Phipps","idIMDB":"nm0681055"},"actorId":"nm0681055","character":"Yuma Talbott","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edith King","urlProfile":"http://www.imdb.com/name/nm0454678","urlPhoto":"","biography":{"dateOfBirth":"14 November 1896","placeOfBirth":" White Haven, Pennsylvania, USA","bio":"Edith King was born on November 14, 1896 in White Haven, Pennsylvania, USA. She was an actress, known for Calcutta (1947), Girl on the Run (1953) and The Gallant Blade (1948). She died on February 24, 1973 in Daytona Beach, Florida, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0454678","name":"Edith King","idIMDB":"nm0454678"},"actorId":"nm0454678","character":"Mrs. Allen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Lambert","urlProfile":"http://www.imdb.com/name/nm0483173","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDkzOTJmY2EtM2M3OC00ODNiLTg2NGYtNWNkNzBlYzAxZjE4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 April 1920","placeOfBirth":" Yonkers, New York, USA","bio":"American character actor specializing in tough guys and heavies. A native of Yonkers, New York, he worked on the Broadway stage and then became an increasingly familiar figure in Westerns and crime dramas after World War II. Although almost as familiar a presence in films as his contemporaries Warren Oates, Robert J. Wilke, and Leo Gordon, for some reason Lambert never became as well-known as these, even by film buffs, despite having appeared in a great number of similar roles and films. His credits are often confused with those of the Scots actor of the same name, Jack Lambert.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDkzOTJmY2EtM2M3OC00ODNiLTg2NGYtNWNkNzBlYzAxZjE4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0483173","name":"Jack Lambert","idIMDB":"nm0483173"},"actorId":"nm0483173","character":"Bronc Wilson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fred Libby","urlProfile":"http://www.imdb.com/name/nm0508744","urlPhoto":"","biography":{"dateOfBirth":"20 October 1915","placeOfBirth":" Hopedale, Massachusetts, USA","bio":"Fred Libby was born on October 20, 1915 in Hopedale, Massachusetts, USA. He was an actor, known for 3 Godfathers (1948), Wagon Master (1950) and Belle Starr's Daughter (1948). He died on November 8, 1997 in Miami, Florida, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0508744","name":"Fred Libby","idIMDB":"nm0508744"},"actorId":"nm0508744","character":"Slim Smith","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Isabel Jewell","urlProfile":"http://www.imdb.com/name/nm0422436","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NDgzMDU3N15BMl5BanBnXkFtZTcwNTcwODY5Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 July 1907","placeOfBirth":" Shoshoni, Wyoming, USA","height":"4' 11\" (1.5 m)","bio":"Isabel Jewell, like other actresses in Hollywood in the 1930s, suffered from chronic typecasting. The diminutive, platinum-haired daughter of a doctor and medical researcher seemed to be forever playing hard-boiled, tough-talking broads: gangster's molls, dumb blondes, prostitutes and, of course, poor \"white trash\" Emmy Slattery in Gone with the Wind (1939). While stardom eluded her for the most part, she nonetheless remained a busy supporting actress with an impressive array of A-budget films to her credit. Signed as an MGM contract player, she reputedly earned up to $3,000 a week -- a small fortune at the time. Isabel was educated at St. Mary's Academy in Minnesota and at Hamilton College in Kentucky. After years in stock companies (including an 87-week stint in Lincoln, Nebraska), she hit the big time after getting a part on Broadway in \"Up Pops the Devil\" (1930). With just three hours of rehearsal time, she delivered her performance to great critical acclaim and had even better reviews as a fast-talking telephone operator in \"Blessed Event\". She reprised this role in the screen version of Blessed Event (1932) and her movie career was effectively launched. While her parts were often small, they could also be memorable, as in Ceiling Zero (1936) and Marked Woman (1937). Other acting highlights include her consumptive prostitute finding salvation in Lost Horizon (1937), and her poignant against-type performance as an ill-fated seamstress on her way to the guillotine in A Tale of Two Cities (1935). In the 1940s and '50s, her roles diminished from small to bits to uncredited and she fell on hard times: in 1959 she got into trouble with the law in Las Vegas for passing bad checks and, two years later, spent five days in jail for drunk driving. She was found dead in her home in April 1972, aged just 64. One of her two former husbands was writer-producer-director Owen Crump (1903-1998). A lasting memory of Isabel Jewell is her star on the Hollywood Walk of Fame on Vine Street.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NDgzMDU3N15BMl5BanBnXkFtZTcwNTcwODY5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0422436","name":"Isabel Jewell","idIMDB":"nm0422436"},"actorId":"nm0422436","character":"Belle Starr","urlCharacter":"http://www.imdb.com/character/ch0027880","main":true},{"actorName":"J. Farrell MacDonald","urlProfile":"http://www.imdb.com/name/nm0531759","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjVmOWRhZmYtZGQzNS00MTBiLTg5MTEtZGVjMjBhNzY3ZTRjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 April 1875","placeOfBirth":" Waterbury, Connecticut, USA","birthName":"Joseph Farrell MacDonald","height":"5' 10\" (1.78 m)","bio":"J. Farrell MacDonald was born on April 14, 1875 in Waterbury, Connecticut, USA as Joseph Farrell MacDonald. He was an actor and director, known for Sunrise (1927), Meet John Doe (1941) and My Darling Clementine (1946). He was married to Edith Bostwick. He died on August 2, 1952 in Hollywood, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjVmOWRhZmYtZGQzNS00MTBiLTg5MTEtZGVjMjBhNzY3ZTRjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0531759","name":"J. Farrell MacDonald","idIMDB":"nm0531759"},"actorId":"nm0531759","character":"Doc Benson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris-Pin Martin","urlProfile":"http://www.imdb.com/name/nm0552077","urlPhoto":"","biography":{"dateOfBirth":"19 November 1893","placeOfBirth":" Tucson, Arizona, USA","birthName":"Ysabel Ponciana Chris-Pin Martin Piaz","bio":"Chris-Pin Martin was born on November 19, 1893 in Tucson, Arizona, USA as Ysabel Ponciana Chris-Pin Martin Piaz. He was an actor, known for The Ox-Bow Incident (1943), The Mark of Zorro (1940) and The Fugitive (1947). He died on June 27, 1953 in Montebello, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0552077","name":"Chris-Pin Martin","idIMDB":"nm0552077"},"actorId":"nm0552077","character":"Spanish George","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Larry Johns","urlProfile":"http://www.imdb.com/name/nm0424337","urlPhoto":"","biography":{"dateOfBirth":"25 October 1903","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Lawrence Giddings Johns","bio":"Larry Johns was born on October 25, 1903 in Cleveland, Ohio, USA as Lawrence Giddings Johns. He was an actor, known for Project Moon Base (1953), Law of the Badlands (1951) and Dakota Lil (1950). He died on January 12, 1987 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0424337","name":"Larry Johns","idIMDB":"nm0424337"},"actorId":"nm0424337","character":"Marshal Jed Purdy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kenneth MacDonald","urlProfile":"http://www.imdb.com/name/nm0531810","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmQyZjM5Y2YtYTUyYi00NTEzLThkZjUtOGM0YjdjNWIwMzAwXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 September 1901","placeOfBirth":" Portland, Indiana, USA","birthName":"Kenneth Dollins","bio":"Kenneth MacDonald was born Kenneth Dollins on September 8, 1901 in Portland, Indiana. He began his career as a stage actor in the 1920s and came to Hollywood in the early 1930s. He broke into motion pictures, but after several small roles, he found employment difficult to come by. He hit upon the idea of a little self-promotion, and wrote a pamphlet called \"The Case of Kenneth MacDonald\", and distributed it to as many producers as he could find. The ploy worked; he started getting jobs at most of the studios in Hollywood, and became a regular fixture in Columbia's Charles Starrett series of \"Durango Kid\" westerns. However, he is probably best remembered as a foil for many of Columbia's comedy teams in the studio's two-reelers, particularly The Three Stooges. His suave demeanor and rich booming voice perfectly adapt the role of the con man, crooked lawyer or criminal gang leader he often played, and he showed a surprising flair for physical comedy, taking a two-finger poke in the eyes from Moe Howard, a pie in the face from Larry Fine or an iron bar on the head from Curly Howard with the best of them. He left the Columbia shorts department in 1955 and semi-retired from acting. From 1951-1953, he was a frequent guest star, mostly as a sheriff, on the television series The Range Rider (1951). From 1957-1966, he had a recurring role as Judge Carter on the television series Perry Mason (1957). He was also a frequent guest star as Colonel Parker on the ABC television series Colt .45 (1957). Kenneth MacDonald died at age 70 of a heart attack in Woodland Hills, California on May 5, 1972.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmQyZjM5Y2YtYTUyYi00NTEzLThkZjUtOGM0YjdjNWIwMzAwXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0531810","name":"Kenneth MacDonald","idIMDB":"nm0531810"},"actorId":"nm0531810","character":"Uncle Jim Davis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christine Larsen","urlProfile":"http://www.imdb.com/name/nm0488728","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjMzZTZkNjUtYmM5Ny00MWVhLWI1ZjMtMGM3NDU5ZmMxMTkxL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 March 1918","placeOfBirth":" Durand, Wisconsin, USA","birthName":"Marjorie Goss","bio":"Diminutive beauty Christine Larsen (also credited as 'Larson' in some of her early films) had a minor Hollywood career, spanning a mere seven years, from 1948 to 1955. On the rare occasions she was not cast as the perfunctory love interest in B-westerns, opposite the likes of Johnny Mack Brown, she co-starred in long-forgotten potboilers (Last Train from Bombay (1952)) and 'Jungle Jim' adventures (Valley of Head Hunters (1953)). The multi-talented redhead initially studied acting at the American Academy of Dramatic Arts in New York and gained her entry to Hollywood in the mid 1940's via a spell with the Western Costume Company, as a designer of men's garments for 20th Century Fox musicals and period dramas. She also dabbled in theatrical set design and was a champion equestrian and rodeo queen, whose greatest ambition in life was to own a Lipizzaner stallion. Ironically, it was to be Christine's private life which made the headlines, rather than her all-too-brief tenure as a second feature lead in Hollywood. A 1992 unauthorised biography of Nancy Reagan by sensationalist author Kitty Kelley alleged an affair between her and future president Ronald Reagan -- though she had spurned his proposal of marriage in 1951 -- which endured at least a year into his marriage to Nancy. In 1952, Christine hit the news again, when she made a claim to police, accusing her 57-year old neighbour of spying on her by means of a spotlight and a periscope after she had refused his advances. The authorities, apparently, did not seriously pursue the matter, insisting that periscopes were not covered by city ordinances. There were a few more TV appearances before Christine's career had run its course and it became quiet about her for the remaining years of her life. She died at the relatively young age of 54 in Los Angeles in February 1973.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjMzZTZkNjUtYmM5Ny00MWVhLWI1ZjMtMGM3NDU5ZmMxMTkxL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0488728","name":"Christine Larsen","idIMDB":"nm0488728"},"actorId":"nm0488728","character":"Marie","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0040154","urlIMDB":"http://www.imdb.com/title/tt0040154","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 26 min (86 min)","1 hr 9 min (69 min) (VHS) (West Germany)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["2,366.45 m (9 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.8","filmingLocations":[{"location":"Corriganville, Ray Corrigan Ranch, Simi Valley, California, USA"}],"rated":"APPROVED","awards":[],"votes":"78","type":"Movie","companyCreditsSimple":[{"idCompany":"co0137921","name":"Edward L. Alperson Productions"}],"keywords":{"keywords":["mother","daughter","belle starr","killing","female gunfighter","historical fiction","disloyalty","double cross","deceit","duplicity","deception","gunfighter","jail","violence","murderer","murder","cold blooded killer","bandit","outlaw gang","gang leader","gang member","square dancing","dancehall girl","law and order","lawman","oklahoma territory","kiowa indian","indian","mexican","revenge","follow in mother's footsteps","marriage proposal","dying bandit","hold up","frame up","misplaced admiration","cruelty","gunfire","doctor","posse","damsel in distress","ambush","deputy","hideout","cafe","1880s","u.s. marshal","held at gunpoint","henchman","b western","death of mother","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 05:52:45"}}