{"data":{"movies":[{"title":"The Dam Busters","originalTitle":"","year":"1955","releaseDate":"19550716","directors":[{"name":"Michael Anderson","id":"nm0027183"}],"writers":[{"name":"Paul Brickhill","id":"nm0108595"},{"name":"Guy Gibson","id":"nm1355122"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGNlNDcwY2QtNWJjOS00ZTNlLWI5M2YtOWZlZDA2YTQyYWZiL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjQzNDI3NzY@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Drama","History","War"],"plot":"The British are desperate to shorten the length of WW2 and propose a daring raid to smash Germany's industrial heart. At first the objective looks impossible until a British scientist invents an ingenious weapon capable of destroying the planned target.","simplePlot":"The story of how the British attacked German dams in WWII by using an ingenious technique to drop bombs where they would be most effective.","actors":[{"actorName":"Richard Todd","urlProfile":"http://www.imdb.com/name/nm0865262","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MTM2MzM4Ml5BMl5BanBnXkFtZTcwNTU5ODAyMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 June 1919","placeOfBirth":" Dublin, Ireland","birthName":"Richard Andrew Palethorpe Todd","height":"5' 9\" (1.75 m)","bio":"British leading man who achieved some success in American films, as well. Born in Ireland as the son of a British officer, Todd grew up in Devon and attended Shrewsbury Public School. His interest in theatre led him to small roles in stock in England and Scotland, following which he helped found the Dundee Repertory Theatre in 1939. He served with distinction as a paratrooper in the Second World War and returned to considerably more prominent theatre roles, culminating in the role of \"Lachie\" in John Patrick's \"The Hasty Heart\", in which he followed Richard Basehart in the Broadway production. He made his first film in 1948, and the next year was again cast as \"Lachie\", this time in the film version of The Hasty Heart (1949). His performance, a truly star-making and moving piece of work, earned him an Oscar nomination as Best Actor. He followed it with a role in Alfred Hitchcock's Stage Fright (1950), but although he continued to play leading roles, often in quite good films, he never again achieved the prominence and acclaim he had had with The Hasty Heart (1949). He was quite effective in such roles as \"Robin Hood\" and \"Rob Roy\", and very touching as \"Peter Marshall\" in A Man Called Peter (1955). Ultimately, however, his starring roles dwindled, but he continued as a stalwart character actor, primarily in British films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MTM2MzM4Ml5BMl5BanBnXkFtZTcwNTU5ODAyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0865262","name":"Richard Todd","idIMDB":"nm0865262"},"actorId":"nm0865262","character":"Wing Commander Guy Gibson, V.C., D.S.O., D.F.C.","urlCharacter":"http://www.imdb.com/character/ch0029118","main":true},{"actorName":"Michael Redgrave","urlProfile":"http://www.imdb.com/name/nm0714878","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI0OTM1MTA3MF5BMl5BanBnXkFtZTcwNzEyNTUyOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 March 1908","placeOfBirth":" Bristol, England, UK","birthName":"Michael Scudamore Redgrave","height":"6' 3\" (1.91 m)","bio":"Sir Michael Redgrave was of the generation of English actors that gave the world the legendary John Gielgud, Ralph Richardson and Laurence Olivier, Britain three fabled \"Theatrical Knights\" back in the days when a knighthood for thespian was far more rare than it is today. A superb actor, Redgrave himself was a charter member of the post-Great War English acting pantheon and was the sire of an acting dynasty. He and his wife, Rachel Kempson, were the parents of Vanessa Redgrave, Corin Redgrave and Lynn Redgrave and the grandparents of Natasha Richardson, Joely Richardson and Jemma Redgrave.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI0OTM1MTA3MF5BMl5BanBnXkFtZTcwNzEyNTUyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0714878","name":"Michael Redgrave","nicknames":["Red Redgrave"],"idIMDB":"nm0714878"},"actorId":"nm0714878","character":"Doctor B. N. Wallis, C.B.E., F.R.S.","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ursula Jeans","urlProfile":"http://www.imdb.com/name/nm0419982","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMzE2NDQ2OV5BMl5BanBnXkFtZTgwMjMxNjA1MjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1906","placeOfBirth":" Simla, British India [now Simla, Himachal Pradesh, India]","birthName":"Ursula Jean McMinn","bio":"Fair-haired, blue-eyed British actress with a long career on the London stage. She was born Ursula Jean McMinn in India, schooled in London and trained for acting at RADA. Ursula made her theatrical debut at the Criterion Theatre in 1922. From the 1930's, she specialised in classical plays by Shakespeare and Shaw, performing primarily at the Old Vic and with the Sadler's Wells Company. During World War II, she worked under the auspices of the Entertainments National Service Association (ENSA), along with her second husband, the actor Roger Livesey. They often appeared together on stage and enjoyed a particularly successful run on the West End in a play written specifically for them by J.B. Priestley: \"Ever Since Paradise\". In the late 1950's, the Liveseys toured Australia and New Zealand in \"The Reluctant Debutante\". On screen, they had previously appeared in both the stage and screen versions of The Life and Death of Colonel Blimp (1943). Ursula's relatively few film roles generally saw her as genteel, devoted wives, like her Mrs. Molly Wallis in The Dam Busters (1955). She was rather more effective, however, as the officer's wife Lady Windham in North West Frontier (1959), or as the middle-class widow Martha Dacre, coming to terms with the aftermath of the war in The Weaker Sex (1948).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMzE2NDQ2OV5BMl5BanBnXkFtZTgwMjMxNjA1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0419982","name":"Ursula Jeans","idIMDB":"nm0419982"},"actorId":"nm0419982","character":"Mrs. Wallis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Basil Sydney","urlProfile":"http://www.imdb.com/name/nm0842981","urlPhoto":"","biography":{"dateOfBirth":"23 April 1894","placeOfBirth":" St. Osyth, Essex, England, UK","bio":"The son of a stage manager, Basil Sydney entered the acting profession in 1909. His burgeoning career was interrupted by the outbreak of World War I, during which he saw action with the Norfolk Regiment in the British Army. In the early 1920's, Basil established himself as a matinée idol on the London stage. His film debut, however, took place on the other side of the Atlantic in the silent feature Romance (1920), based on a play by Edward Sheldon. His co-star was the prominent American Broadway star Doris Keane, with whom he had appeared in the theatrical performance of the play five years prior and subsequently married. Basil was rapidly promoted through a starring role in his second screen outing, the comedy Red Hot Romance (1922), but decided to turn down the offer of a lucrative Hollywood contract. His single-minded insistence on being cast exclusively in roles based on works by Shakespeare or Shaw led him to New York and back to the theatre. He spent the remainder of the decade as a leading player on Broadway, playing the parts he craved and duly receiving critical plaudits for his Mercutio of \"Romeo and Juliet\" (1922-23) and for his leads as Hamlet (1925-26) and Petruchio in \"The Taming of the Shrew\" (1927-28). Basil did not return to films until 1932, back in Britain and henceforth as a burly character actor, albeit of never less than commanding presence. His stock-in-trade were shifty opportunists, public servants, domineering fathers or military types. He alternated smoothly between charming or dependable and menacing or sinister. Generally typed as a quintessential Englishman, his casting as a German infiltrator in the wartime drama Went the Day Well? (1942), lent additional gravitas to the warning against complacency. Otherwise, he stood out as Caesar's military aide-de-camp Rufio in the decidedly stodgy screen adaptation of George Bernard Shaw's Caesar and Cleopatra (1945); as the brutish squire Nick Helmar in the period Gainsborough melodrama Jassy (1947); as the indefatigable Captain Smollett battling the pirates of Treasure Island (1950) and as Waldemar Fitzurse, advisor to the devious Prince John (played by Guy Rolfe) in MGM's excellent Technicolor swashbuckler Ivanhoe (1952).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0842981","name":"Basil Sydney","idIMDB":"nm0842981"},"actorId":"nm0842981","character":"Air Chief Marshal Sir Arthur Harris","urlCharacter":"http://www.imdb.com/character/ch0474412","main":true},{"actorName":"Patrick Barr","urlProfile":"http://www.imdb.com/name/nm0056556","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjFjODUzMDYtNzA1ZS00NjAyLWE5OTUtYThmNTczZjc4NjY1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1908","placeOfBirth":" Akola, India","birthName":"Patrick David Barr","bio":"Patrick Barr, born into a judicial family in British India in 1908, was active for more than half a century on the stage, screen and, later, very successfully on television. Tall and distinguished, the son of a judge and (in retirement) theatrical manager, Barr was educated at Radley and Trinity College, Oxford, winning a \"blue\" in the 1929 University Boat Race. Having first worked as an engineer, he made the move to acting at the comparatively late age of twenty-five. His West End stage debut, followed in 1936 in a production of \"The Country Wife\" at the Old Vic. The following year, he made his debut on the New York stage. During the Second World War, he was a conscientious objector serving with a Free French ambulance unit in North Africa. For his bravery, he was awarded the Croix de Guerre. On his return to the United Kingdom, he resumed his acting career in a revival of Noël Coward's \"Private Lives\" at the Apollo Theatre. For the next fifteen years, he appeared almost non-stop on the West End Stage, the longest-running being \"Like a Dove\", in which he played \"Lord Dungavel\" for over two years. By the mid 1950s, the popularity of television was growing dramatically and Barr became more widely-known as a result, twice becoming \"Television Actor of the Year\". In 1970, he made a strong return to the stage, joining the Royal Shakespeare Company for the season at Stratford. He played the ghost in \"Hamlet\", \"Alonso\" in \"The Tempest\" and \"Escalus\" in \"Measure for Measure\". His first film, The Merry Men of Sherwood (1932) was the first of numerous character parts and, while never attaining first billing as he had on the stage and television, his talents were always in demand. Patrick Barr was married twice. He died aged 77 on August 29 1985.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjFjODUzMDYtNzA1ZS00NjAyLWE5OTUtYThmNTczZjc4NjY1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0056556","name":"Patrick Barr","idIMDB":"nm0056556"},"actorId":"nm0056556","character":"Captain Joseph","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ernest Clark","urlProfile":"http://www.imdb.com/name/nm0163919","urlPhoto":"","biography":{"dateOfBirth":"12 February 1912","placeOfBirth":" Paddington, London, England, UK","birthName":"Ernest William Clark","bio":"A distinguished stage actor, Ernest Clark was best known to British television viewers for his role as the crusty \"Sir Geoffrey Loftus\" in the long running \"Doctor\" comedy series during the 1970s. Born in Maida Vale, Clark was the son of a master builder and was educated at Marylebone Grammar School. His first job was as a reporter on a local newspaper and he was also a keen amateur actor. He made his first professional appearance at the Festival Theatre, Cambridge in 1937 and, throughout the 1930s and 40s, was rarely off the West End stage. In New York in 1950, he garnered rave reviews for his appearance in T.S. Eliot's \"The Cocktail Party\". A prolific screen character actor, he was usually cast in cold, tight-lipped roles in British war films. He was vice-president of Equity, the British actor's union, from 1964-69 and president from 1970-73. An articulate, outspoken and often witty commentator for the acting profession, he always argued on the side of regulated entry into what he described as \"an overcrowded industry\". Clark's first two marriages were dissolved. His third wife was 'Julia Lockwood', the daughter of the British film star Margaret Lockwood.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0163919","name":"Ernest Clark","idIMDB":"nm0163919"},"actorId":"nm0163919","character":"Air Vice-Marshal The Hon. Ralph Cochrane","urlCharacter":"http://www.imdb.com/character/ch0512719","main":true},{"actorName":"Derek Farr","urlProfile":"http://www.imdb.com/name/nm0268006","urlPhoto":"","biography":{"dateOfBirth":"7 February 1912","placeOfBirth":" London, England, UK","bio":"Derek Farr was born on February 7, 1912 in London, England. He was an actor, known for The Dam Busters (1955), Double Confession (1950) and The Man in the Road (1956). He was married to Muriel Pavlow and Carole Lynne. He died on March 22, 1986 in London.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0268006","name":"Derek Farr","idIMDB":"nm0268006"},"actorId":"nm0268006","character":"Group Captain J. N. H. Whitworth, D.S.O., D.F.C.","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Carson","urlProfile":"http://www.imdb.com/name/nm0141202","urlPhoto":"","biography":{"dateOfBirth":"16 August 1885","placeOfBirth":" London, England, UK","bio":"Charles Carson was born on August 16, 1885 in London, England. He was an actor, known for Secret Agent (1936), The Dam Busters (1955) and Cry, the Beloved Country (1951). He was married to Bertha Kathleen Elmes. He died on August 5, 1977 in London.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0141202","name":"Charles Carson","idIMDB":"nm0141202"},"actorId":"nm0141202","character":"Doctor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stanley Van Beers","urlProfile":"http://www.imdb.com/name/nm0885676","urlPhoto":"","biography":{"dateOfBirth":"4 May 1911","placeOfBirth":" London, England, UK","bio":"Stanley Van Beers was born on May 4, 1911 in London, England. He was an actor, known for The Dam Busters (1955), The Scarlet Pimpernel (1955) and Late Night Final (1954). He was married to Vivienne Burgess. He died on May 25, 1961 in London.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0885676","name":"Stanley Van Beers","idIMDB":"nm0885676"},"actorId":"nm0885676","character":"Sir David Pye, C.B., F.R.S.","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Colin Tapley","urlProfile":"http://www.imdb.com/name/nm0850029","urlPhoto":"","biography":{"dateOfBirth":"7 May 1907","placeOfBirth":" Dunedin, New Zealand","height":"5' 11\" (1.8 m)","bio":"Born in 1909 in Dunedin, New Zealand. Brown hair, Blue eyes. In 1930 came to England joined Royal Air Force and took part in Byrd expedition. In 1933 took part in Paramount's Search for Beauty and was selected with Joyce Neilson to be the New Zealand winners out of 30 winners worldwide. Went to Hollywood made 'The Search For Beauty' film and was awarded a bit player contract. He shared a flat with Eldred Tidbury (later Donald Gray) who was to be his best friend until Gray's death in 1978. Tidbury had pipped Tapley to the $1000 bonus for best acting performance. He was rejected for lead in it 'Ain't No Sin' with Mae West because of his upper class English accent. Tidbury was rejected for same reason. He appeared in Double Door (1934), Murder at the Vanities (1934), Lives of a Bengal Lancer (1935) during which he had to put on East indian disguise and play an army spy. In the pioneering technicolor film Becky Sharpe (1935) he looked the part in a splendid military uniform. Like Gray he was to get a reputation as being attractive to ladies. Up until 1940 he appeared in 31 films credited and countless more uncredited mostly for Paramount but in 1939 he did some work for MGM. In 1937 he went on location to the Malayan jungle to appear in 'Booloo (1938) in the lead. he was only white man in the cast, an animal adventure picture. He commented the rain was horrendous and the monkeys screaming was most unpleasant. In 1940 unable to return to England he went to Ottawa Canada and enlisted in the Royal Canadian Airforce in the company of another actor Bert Coote. With his experience he was offered an Instructor and was transfered to England later in the War becoming an RAF controller. He was awarded membership of the Caterpillar club after bailing out of an ailing aircraft. In those days the Parachute manufacturer awarded anyone whose life was saved a small jewellery caterpillar. After demobilisation he returned to New zealand briefly, his first time since 1933. He intended to start a launch service in Wanaka and bring his wife and children out there. However he tired of this and went to England to take up his film career again. With the post-war recession in the British film Industry it would be 1949 before he made another film 'Samson and Delilah'. with his upper class accent he was the obvious choice for war films none more so than in 'The Dambusters (1954) with Michael Redgrave and Richard Todd. he played a scientist who developed Barnes Wallis's weapon. Between 1954 and 1958 he worked with his friend Donald Gray in the Danziger TV series 'The Vise' as Inspector Parker. Unlike Gray he did still get film work after the series ended his last film being Frauline Doktor in 1969. His acting career did not end completely until 1983 at the age of 74. He retired to his English Cotswold country cottage in Coates, Gloucestershire, England. He died on the 1st of December 1995 aged 86 and his funeral was held in Gloucester. He was survived by his wife, son and a step daughter.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0850029","name":"Colin Tapley","idIMDB":"nm0850029"},"actorId":"nm0850029","character":"Doctor W. H. Glanville, C.B., C.B.E.","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frederick Leister","urlProfile":"http://www.imdb.com/name/nm0500588","urlPhoto":"","biography":{"dateOfBirth":"1 December 1885","placeOfBirth":" London, England, UK","bio":"Frederick Leister was born on December 1, 1885 in London, England. He was an actor, known for Goodbye, Mr. Chips (1939), The Dam Busters (1955) and The Captive Heart (1946). He died on August 24, 1970.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0500588","name":"Frederick Leister","idIMDB":"nm0500588"},"actorId":"nm0500588","character":"Committee Member","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eric Messiter","urlProfile":"http://www.imdb.com/name/nm0582231","urlPhoto":"","biography":{"dateOfBirth":"14 August 1892","placeOfBirth":" Dudley, West Midlands, England, UK","birthName":"Eric Hugh Messiter","bio":"Eric Messiter was born on August 14, 1892 in Dudley, West Midlands, England as Eric Hugh Messiter. He was an actor, known for Kind Hearts and Coronets (1949), The Dam Busters (1955) and What Say They? (1956). He died on September 13, 1960 in Datchet, Berkshire, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0582231","name":"Eric Messiter","idIMDB":"nm0582231"},"actorId":"nm0582231","character":"Committee Member","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Laidman Browne","urlProfile":"http://www.imdb.com/name/nm0115033","urlPhoto":"","biography":{"dateOfBirth":"13 September 1896","placeOfBirth":" Newcastle-upon-Tyne, England, UK","bio":"Laidman Browne was born on September 13, 1896 in Newcastle-upon-Tyne, England. He was an actor, known for The Dam Busters (1955), The Nine Days' Wonder (1953) and The Three Princes (1954). He died on September 11, 1961 in Bournemouth, Dorset, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0115033","name":"Laidman Browne","idIMDB":"nm0115033"},"actorId":"nm0115033","character":"Committee Member","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Raymond Huntley","urlProfile":"http://www.imdb.com/name/nm0403171","urlPhoto":"","biography":{"dateOfBirth":"23 April 1904","placeOfBirth":" Birmingham, England, UK","height":"6' 1\" (1.85 m)","bio":"Birmingham-born Raymond Huntley was one of those instantly recognisable, mannered types that popped up in classic British films of the 1940's and 50's. Tall and austere, he had a somewhat mean, sour-faced look, accentuated whenever staring with icy disdain from behind horn-rimmed spectacles. This, and his trademark dry delivery, made Huntley such perfect casting for an extensive array of ever-so-superior, humourless civil servants, mean-spirited bank managers, dullish clubroom snobs, smug business types, dour undertakers or sinister cold war spooks. Earlier in his career, Huntley essayed rather more overtly menacing characters, effectively typecast during the war years as Nazi officers ('Pimpernel' Smith (1941)) or German spies (Mail Train (1941)). It is hard to pick out two outstanding performances above all others, but he was arguably at his best as the local bank manager Wix in Passport to Pimlico (1949), emphatic in his greed to reap whatever benefits from the Burgundian declaration of independence; as the irascible boffin Laxton-Jones in Secret Flight (1946); and as Henry Chester, made resentful by his illness, in the Sanatorium segment of Trio (1950). Towards the end of his career, Huntley achieved his greatest popularity when he was cast as the grumpy family solicitor, Sir Geoffrey Dillon, in TV's Upstairs, Downstairs (1971). Educated at King Edward's School, Raymond Huntley made his theatrical debut with the Birmingham Repertory Company in 1922. By the age of twenty-one, he played a septuagenarian farm labourer and was consequently hired as a comedian by a North Country revue for a starting salary of ten pounds a week. Huntley was reputedly the first actor to play Dracula on stage (in Hamilton Deane's hit 1927 London adaptation of the original novel), though it is fair to point out that an earlier reading of the play took place on May 18th, 1897, at the Lyceum Theatre, arranged by none other than the author Bram Stoker himself. In any event, Huntley's superb handling of the character established the direction his future career would take.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0403171","name":"Raymond Huntley","idIMDB":"nm0403171"},"actorId":"nm0403171","character":"Official, National Physical Laboratory","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hugh Manning","urlProfile":"http://www.imdb.com/name/nm0543286","urlPhoto":"","biography":{"dateOfBirth":"19 August 1920","placeOfBirth":" Birmingham, England, UK","birthName":"Hugh Gardner Manning","height":"6' 1\" (1.85 m)","bio":"Hugh Manning was born on August 19, 1920 in Birmingham, England as Hugh Gardner Manning. He was an actor, known for The Elephant Man (1980), Mrs Thursday (1966) and The Dam Busters (1955). He died on August 18, 2004 in London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0543286","name":"Hugh Manning","idIMDB":"nm0543286"},"actorId":"nm0543286","character":"Official, Ministry of Aircraft Production","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0046889","urlIMDB":"http://www.imdb.com/title/tt0046889","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"£419,528 (UK)","country":"","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 4 min (124 min)","1 hr 45 min (105 min) (USA)"],"soundMix":["Mono","Mono (RCA Sound Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["3,422.9 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.4","filmingLocations":[{"location":"RAF Scampton, Lincolnshire, England, UK"}],"rated":"APPROVED","awards":[{"award":"Academy Awards, USA 1956","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Effects, Special Effects","names":[]}]}]},{"award":"BAFTA Awards 1956","titlesAwards":[{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best British Film","names":[]},{"category":"Best British Screenplay","names":[{"name":"R.C. Sherriff","id":"nm0792670","role":null}]},{"category":"Best Film from any Source","names":[]}]}]}],"votes":"7,837","type":"Movie","companyCreditsSimple":[{"idCompany":"co0103091","name":"Associated British Picture Corporation (ABPC)"}],"keywords":{"keywords":["risk","year 1943","bouncing bomb","elite team","flood","flight training","low flying","dam busting","bomber","bomb","dam","scientist","aerial combat","british soldier","bombing","air crew","military","squadron","spotlight","physics","idiosyncratic character","experiment","cricket bat","chorus girl","bureaucracy","crew","uniform","air base","royal air force","plan","pilot","mission briefing","lorry","flight","dog","airfield","1940s","world war two","based on true story","based on book","killing a dog","animal death"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:32:12"}}