{"data":{"movies":[{"title":"Big Trouble in Little China","originalTitle":"","year":"1986","releaseDate":"19860702","directors":[{"name":"John Carpenter","id":"nm0000118"}],"writers":[{"name":"Gary Goldman","id":"nm0325778"},{"name":"David Z. Weinstein","id":"nm0918434"}],"runtime":"99 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzlhYjEzOGItN2MwNS00ODRiLWE5OTItYThiNmJlMTdmMzgxXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1.jpg","countries":["USA"],"languages":["English","Cantonese"],"genres":["Action","Adventure","Comedy","Fantasy"],"plot":"Truck driver Jack Burton arrives in Chinatown, San Francisco, and goes to the airport with his Chinese friend Wang Chi to welcome his green-eyed fiancée Miao Yin who is arriving from China. However she is kidnapped on the arrival by a Chinese street gang and Jack and Wang chase the group. Soon they learn that the powerful evil sorcerer called David Lo Pan, who has been cursed more than two thousand years ago to exist without physical body, needs to marry a woman with green eyes to retrieve his physical body and Miao is the chosen one. Jack and Wang team-up with the lawyer Gracie Law, the bus driver and sorcerer apprentice Egg Shen and their friends and embark in a great adventure in the underground of Chinatown, where they face a world of magicians and magic, monsters and martial arts fighters.","simplePlot":"An All-American trucker gets dragged into a centuries-old mystical battle in Chinatown.","actors":[{"actorName":"Kurt Russell","urlProfile":"http://www.imdb.com/name/nm0000621","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MjkxNzQwMV5BMl5BanBnXkFtZTYwNDk4ODM1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 March 1951","placeOfBirth":" Springfield, Massachusetts, USA","birthName":"Kurt Vogel Russell","height":"5' 11\" (1.8 m)","bio":"Kurt Russell was born Kurt Vogel Russell in Springfield, Massachusetts, to Louise Julia (Crone), a dancer, and actor Bing Russell (Neil Oliver Russell). He is of English, German, Scottish, and Irish descent. His first roles were as a child in television series, including a lead role in the Western series The Travels of Jaimie McPheeters (1963). Russell landed a part in the Elvis Presley movie, It Happened at the World's Fair (1963), when he was ten years old. Walt Disney himself signed Russell to a 10-year contract, and, according to Robert Osborne, he became the studio's top star of the 1970s. Having voiced adult Copper in the animated Disney film The Fox and the Hound (1981), Russell is one of the few famous child stars in Hollywood who has been able to continue his acting career past his teen years. Kurt spent the early 1970s playing minor league baseball. In 1979, he gave a classic performance as Elvis Presley in John Carpenter's ABC TV movie Elvis (1979), and married the actress who played Priscilla Presley in the film, Season Hubley. He was nominated for an Emmy Award for the role. He followed with roles in a string of well-received films, including Used Cars (1980) and Silkwood (1983), for which he was nominated for the Golden Globe Award for Best Supporting Actor - Motion Picture. During the 1980s, he starred in several films by director Carpenter; they created some of his best-known roles, including anti-hero army-turned-robber Snake Plissken in the futuristic action film Escape from New York (1981) (and later in its 1996 sequel Escape from L.A. (1996)), Antarctic helicopter pilot R.J. MacReady in the horror film The Thing (1982), and Jack Burton in the fantasy film Big Trouble in Little China (1986), all of which have since become cult classics. The Thing was based on the short story Who Goes There? by John W. Campbell, Jr., which had been interpreted on film before, albeit loosely, in 1951's The Thing from Another World (1951). In Big Trouble in Little China, Russell played a truck driver caught in an ancient Chinese war. In 1983, he became reacquainted with Goldie Hawn (who appeared with him in The One and Only, Genuine, Original Family Band (1968)) when they worked together on Swing Shift (1984). The two have lived together ever since. They made another film together, Garry Marshall's comedy Overboard (1987). His other 1980s titles include The Best of Times (1986), Winter People (1989), and the hit Tango & Cash (1989). In 1991, he headlined the firefighter drama Backdraft (1991), in 1993, he starred as Wyatt Earp in the western film Tombstone (1993), and in 1994, had a starring role in the military science fiction film Stargate - La porte des étoiles (1994). In the mid-2000s, his portrayal of U.S. Olympic hockey coach Herb Brooks in Miracle (2004) won the praise of critics. In 2006, he appeared in the disaster-thriller Poseidon (2006), and in 2007, in Quentin Tarantino's Death Proof (2007) segment from the film Grindhouse (2007). Russell appeared in The Battered Bastards of Baseball (2014), a documentary about his father and the Portland Mavericks, which debuted at the Sundance Film Festival in 2014. He co-starred in the action thriller Furious 7 (2015). In 2015, Russell starred in the western films Bone Tomahawk (2015) and The Hateful Eight (2015), and in 2016, he had a leading role in the dramatization Deepwater (2016). Russell and Goldie Hawn live on a 72-acre retreat, Home Run Ranch, outside of Aspen. He has two sons, Boston Russell (from his marriage to Hubley) and Wyatt Russell (with Hawn). He also raised Hawn's children, actors Oliver Hudson and Kate Hudson, who just call him dad.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MjkxNzQwMV5BMl5BanBnXkFtZTYwNDk4ODM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000621","name":"Kurt Russell","idIMDB":"nm0000621"},"actorId":"nm0000621","character":"Jack Burton","urlCharacter":"http://www.imdb.com/character/ch0011933","main":true},{"actorName":"Kim Cattrall","urlProfile":"http://www.imdb.com/name/nm0000326","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NjMyMjAyMV5BMl5BanBnXkFtZTcwMDk1ODQ5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 August 1956","placeOfBirth":" Liverpool, England, UK","birthName":"Kim Victoria Cattrall","height":"5' 6½\" (1.69 m)","bio":"Kim Victoria Cattrall was born on August 21, 1956 in Mossley Hill, Liverpool, England to Gladys Shane (Baugh), a secretary, and Dennis Cattrall, a construction engineer. At the age of three months, her family emigrated to Canada, where a large number of her films have been made. At age 11, she returned to her native country and studied at the London Academy of Music and Dramatic Art. She returned to Vancouver and, at age 16, graduated from high school and won a scholarship to study at the American Academy of Dramatic Arts in New York City. During her final year at the Academy, she won a role in Otto Preminger's action thriller Rosebud (1975). Following her film debut, Kim returned to the theatre, first in Vancouver and then in repertory in Toronto prior to winning a contract at Universal Pictures in Los Angeles, California. Her best known film role is the Vulcan Lieutenant Valeris in Star Trek VI: The Undiscovered Country (1991). She is also best known for her role as public relations executive Samantha Jones on the situation comedy Sex and the City (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NjMyMjAyMV5BMl5BanBnXkFtZTcwMDk1ODQ5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000326","name":"Kim Cattrall","idIMDB":"nm0000326"},"actorId":"nm0000326","character":"Gracie Law","urlCharacter":"http://www.imdb.com/character/ch0011934","main":true},{"actorName":"Dennis Dun","urlProfile":"http://www.imdb.com/name/nm0241748","urlPhoto":"","biography":{"dateOfBirth":"19 April 1952","placeOfBirth":" Stockton, California, USA","birthName":"Dennis Gong Dun","height":"5' 5\" (1.65 m)","bio":"Dennis Dun was born on April 19, 1952 in Stockton, California, USA as Dennis Gong Dun. He is known for his work on Big Trouble in Little China (1986), Le dernier empereur (1987) and Midnight Caller (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0241748","name":"Dennis Dun","idIMDB":"nm0241748"},"actorId":"nm0241748","character":"Wang Chi","urlCharacter":"http://www.imdb.com/character/ch0011937","main":true},{"actorName":"James Hong","urlProfile":"http://www.imdb.com/name/nm0393222","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0MTQxOTA4MF5BMl5BanBnXkFtZTgwODE1OTcyMjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1929","placeOfBirth":" Minneapolis, Minnesota, USA","height":"5' 10\" (1.78 m)","bio":"James Hong was born in Minneapolis, Minnesota, USA. He studied civil engineering at the University of Minnesota, but at some point along the way became interested in acting. He graduated from the University of Southern California and practiced for 1½ years as a road engineer with the County of Los Angeles. He took sick leaves and vacation time to do films. He finally quit engineering to focus on acting full time. He is one of the founders of the East-West Players, the oldest Asian American theater in Los Angeles. He served as president and charter member of the Association of Asian Pacific American Artists. Hong is one of the most prolific and well-recognized Asian-American character actors of movies and television. He currently lives in Los Angeles and is planning to produce and direct his own films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0MTQxOTA4MF5BMl5BanBnXkFtZTgwODE1OTcyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0393222","name":"James Hong","nicknames":["Jimmy"],"idIMDB":"nm0393222"},"actorId":"nm0393222","character":"David Lo Pan","urlCharacter":"http://www.imdb.com/character/ch0011935","main":true},{"actorName":"Victor Wong","urlProfile":"http://www.imdb.com/name/nm0939378","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTgxOTQzNjQ0NV5BMl5BanBnXkFtZTcwNjM1OTgwMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1927","placeOfBirth":" San Francisco, California, USA","birthName":"Yee Keung Victor Wong","height":"5' 4\" (1.63 m)","bio":"Eccentric looking Chinese-American actor with a slightly drooping face (the result of a bout of Bell's palsy) who studied political science, art & journalism before becoming a news reporter for a San Francisco public TV station in the late 1960s. Apart from a brief stint in the mid-1970s on the TV soap opera Search for Tomorrow (1951), Wong didn't break into movies until he was in his late fifties in the minor telemovie American Playhouse: Nightsongs (1984). He then appeared in the explosive Mickey Rourke gang movie Year of the Dragon (1985), followed by the heart warming Dim Sum: A Little Bit of Heart (1985), before scoring the role he is probably best remembered for, as the Chinese wizard \"Egg Shen\" helping truck driver Kurt Russell defeat the evil \"Lo-Pan\" in Big Trouble in Little China (1986). His offbeat style remained in demand with more work in Prince of Darkness (1987) and then as an opportunistic store owner, who gets more than he bargained for, in the tongue in cheek horror film Tremors (1990). Wong then appeared as the wise grandfather / retired ninja in the kids martial arts adventure 3 Ninjas (1992), plus he repeated his popular role for the sequels 3 Ninjas Kick Back (1994), 3 Ninjas Knuckle Up (1995) and for his final film appearance 3 Ninjas: High Noon at Mega Mountain (1998). Wong retired from acting in 1998 due to ill health, and passed away in September 2001 from heart failure.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTgxOTQzNjQ0NV5BMl5BanBnXkFtZTcwNjM1OTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0939378","name":"Victor Wong","idIMDB":"nm0939378"},"actorId":"nm0939378","character":"Egg Shen","urlCharacter":"http://www.imdb.com/character/ch0011936","main":true},{"actorName":"Kate Burton","urlProfile":"http://www.imdb.com/name/nm0123632","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMDE1MTMzMV5BMl5BanBnXkFtZTYwMDQ2NDIz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1957","placeOfBirth":" Geneva, Switzerland","height":"5' 6½\" (1.69 m)","bio":"Kate Burton earned her bachelor's degree in Russian studies and European history at Brown University in Rhode Island, where she was also on the board of Production Workshop, one of the university's student theater groups. She furthered her education by studying at Yale University School of Drama, she graduated in 1983. In 2007, she was given an honorary doctorate from Brown University. Kate's debut film appearance was an uncredited role in Anne of the Thousand Days (1969), she then appeared in what would be her first film appearance since her initial debut, the 1980s favorite Big Trouble in Little China (1986). With over 70 film and television appearances under her belt, we should acknowledge her chilling and emotionally gripping performances in Empire Falls (2005) as Cindy Whiting, a permanently disabled but sweet woman with a positive attitude, and Meredith Grey's Alzheimer's-stricken mother in Grey's Anatomy (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMDE1MTMzMV5BMl5BanBnXkFtZTYwMDQ2NDIz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0123632","name":"Kate Burton","idIMDB":"nm0123632"},"actorId":"nm0123632","character":"Margo","urlCharacter":"http://www.imdb.com/character/ch0028235","main":true},{"actorName":"Donald Li","urlProfile":"http://www.imdb.com/name/nm0508397","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MTk2NDg1MF5BMl5BanBnXkFtZTcwODM4MjI3OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1961","placeOfBirth":" Hong Kong","bio":"Donald Li was born in 1961 in Hong Kong. He is an actor, known for The Avengers (2012), Big Trouble in Little China (1986) and Goal! The Dream Begins (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MTk2NDg1MF5BMl5BanBnXkFtZTcwODM4MjI3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0508397","name":"Donald Li","idIMDB":"nm0508397"},"actorId":"nm0508397","character":"Eddie Lee","urlCharacter":"http://www.imdb.com/character/ch0030101","main":true},{"actorName":"Carter Wong","urlProfile":"http://www.imdb.com/name/nm0938975","urlPhoto":"","biography":{"dateOfBirth":"22 March 1947","placeOfBirth":"","birthName":"Chia-Ta Huang","bio":"Carter Wong was born on March 22, 1947 as Chia-Ta Huang. He is known for his work on Big Trouble in Little China (1986), Born invincible (1978) and Traitorous (1976).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0938975","name":"Carter Wong","idIMDB":"nm0938975"},"actorId":"nm0938975","character":"Thunder","urlCharacter":"http://www.imdb.com/character/ch0030623","main":true},{"actorName":"Peter Kwong","urlProfile":"http://www.imdb.com/name/nm0477286","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNzE3Mzg4MV5BMl5BanBnXkFtZTYwNzQ1Njcy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1952","placeOfBirth":" Los Angeles, California, USA","bio":"Peter Kwong is a veteran of film, television and stage, best known for his roles as Rain in Big Trouble in Little China and as Tommy Tong in Eddie Murphy's Golden Child. He just finished filming Cooties, starring Elijah Wood, and has appeared in more than 100 film and television roles. Other favorite films include roles in The Presidio, Angel Town, Never Too Young To Die, Gleaming The Cube, Steel Justice, Theodore Rex with Whoopie Goldberg, Row Your Boat with Jon Bon Jovi and Bai Ling, and Pearl S. Buck's historic epic The Living Reed as the King of Korea. On television you may have seen him in \"Sullivan & Son,\" \"Malcolm and Eddie,\" \"Sisters,\" \"The Wayan Brothers,\" \"Daddy Dearest,\" \"Renegade,\" \" Top Cops,\" \"Full House,\" \"Doctor, Doctor\". On stage, Mr. Kwong portrayed the lead role as Dr. Haing S. Ngor in The Survivor: A Cambodian Odyssey by Jon Lipsky at the Actors Theatre of Louisville/Humana Festival, and stretched his musical theater skills in Mame with the late Juliet Prowse. In addition to his thriving acting career, Kwong recently served on the Board of Governors of the Academy of Television Arts & Sciences for two terms and served on The Board of Directors of SAG-AFTRA, chairman of the Committee for Racial Equality of Actors Equity Association, and the Vice-Chairs of the Ethnic Equal Opportunities and the Young Performers Committees of the Screen Actors Guild. He is a member of the Academy of Motion Picture Arts and Sciences & Television Academy. He has also served with the Los Angeles Asian Pacific Heritage Week. He has emceed events for Visual Communications, The Lotus Festival, Asian Business League, and the Los Angeles Miss Chinatown Pageant four times and had the privilege to go to Namibia, Africa to judge the Miss Universe Pageant. Kwong's talents have won him an honorary membership in the Los Angeles Mime Guild. He is featured dancing on numerous music videos, including Ed Sheeran's Sing. He studied Northern Shao lin Kung-fu which has allowed him to do many of his own stunts and eventually branch off to more meditative disciplines such as Tai Chi Chuan and Chi Kung Meditation. He teaches Tai Chi Chuan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNzE3Mzg4MV5BMl5BanBnXkFtZTYwNzQ1Njcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0477286","name":"Peter Kwong","idIMDB":"nm0477286"},"actorId":"nm0477286","character":"Rain","urlCharacter":"http://www.imdb.com/character/ch0032079","main":true},{"actorName":"James Pax","urlProfile":"http://www.imdb.com/name/nm0657070","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MDA3NTE5N15BMl5BanBnXkFtZTcwNzgwMzIzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"James Pax was educated in New York University with a degree in business and later studied film production/directing in University of Southern California. He lived and worked around the globe in cities like Italy, Japan, US, Hong Kong, Malaysia, and Paris and China. His vast talent as a young singer took him to South America during his teens to perform on TV as being the first Asian singer making it South America. His other interests such as ballet training with Jeoffrey Ballet and his adamant training as a professional Kung Fu artists has give him the foundation to be a fine actor that can take up almost any parts from Shakespeare to Sam Shepard's plays to Jacky Chain movies. In his early 20s he started working as a model and actor in US and Europe for top fashion designer like Armani, making him the first Chinese model to appear on Milan runway in the early 1990. Upon his graduation from New York University with a degree in international business, he worked one year on Wall Street as a stock analyst and then decided to continue his acting career in New York on off-Broadway stage plays and soon after moved on to Hollywood to do early Hollywood produced Chinese action movie like \"Big Trouble in Little China\" with Kurt Russell, Year of Dragon with John Lone. Through his years of working in Hollywood, he quest-starred in numerous TV series and did TV movies with James Wood in 'In love and War\" and feature movies with Charles Bronson in Kinjite, Donald Sutherland in Bethune, and as a series regular on a hot TV series called \"Nasty boys\" in 1990, In early 1992, he decided to venture back to Asia and started acting in Hong Kong, and Japan movie industry. When he passed his thirties he becomes the first Chinese model to be used for a cigarette campaign in Europe for Philip Morris, and West cigarette. In 1992, he decided to go back to USC to complete his study in Film and production management. He then ran a production house and ad agency that serves clients such as Rio casino and MGM in Las Vegas. James has lived in Beijing China since 2001 and has established his own advertising and production company in China. He strives to produce high quality of feature movies, and TV series and commercials for his clients. One of his great achievements in China in 2005 is that he starred in the series called \"I want to really fall in love. The Chinese version of Sex and the city, which also became one of the most talked about series in China because of the daring content about woman chasing after men and the in depth discussion about women's need for men between the four modern Chinese women. A break through from the usual government propaganda related subjects that most series dwelled on. in 2006, James starred in the compelling tale of the \"First Emperor\" Chin Shi Huang di, who build the great wall and also the terra-cotta warriors. The show was aired on January 29th on Discovery USA and gained high ratings. Critics from the Hollywood Reporter to the New York Times praised Pax for his dramatic portrayal of the emperor. The First emperor of China was also aired on Channel 4 UK and received high praises from the British press for his portrayal of emperor Chin as King Lear - a Shakespearean tragic character. His most recent TV work \"Shanghai Solution\", the Chinese version of Schindler's List, aired on CCTV8 on August 2005. The series became the highest Rated drama series on CCTV Channel 8 and James is the producer and the star. It is a 30-episode mega series based on a true historical facts about the 30,000 Jews who fled to China in the 1940s and the Nazi General Meizinger whose \"Final Solution\" plan was to bring them into a concentration camp with the help of the Japanese Imperial Army. James has published a book in China called \"A bowl of fish\" which is a poignant story about a 20 year old young actress who become an instant star and lost it all in a matter of 16 months. A slice of life in the modern China that reflects the reality of the ever-growing capitalist society in big cities like Shanghai. The movie version is looking to get made in 2007.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MDA3NTE5N15BMl5BanBnXkFtZTcwNzgwMzIzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0657070","name":"James Pax","idIMDB":"nm0657070"},"actorId":"nm0657070","character":"Lightning","urlCharacter":"http://www.imdb.com/character/ch0033593","main":true},{"actorName":"Suzee Pai","urlProfile":"http://www.imdb.com/name/nm0656665","urlPhoto":"","biography":{"dateOfBirth":"8 August 1962","placeOfBirth":" Toledo, Ohio, USA","birthName":"Sue Frances Pai","height":"5' 5\" (1.65 m)","bio":"Lovely and slender brunette stunner Suzee Pai was born Sue Frances Pai on August 8, 1962 in Toledo, Ohio. Pai did some fashion modeling in New York City and was a Liberty Bells cheerleader for the football team the Philadelphia Eagles. Moreover, Suzee was the Pet of the Month in the January, 1981 issue of \"Penthouse.\" She appeared in a follow-up pictorial in the June, 1982 issue of the same famous men's magazine. Pai has acted in a few movies; she was especially memorable as blind prostitute Siakwan in Sharky's Machine (1981) and enticing green-eyed beauty Miao Yin in the cult favorite Big Trouble in Little China (1986). Her small part as a Vietnamese prostitute in First Blood (1982) was cut from the final theatrical version of the film. Moreover, Suzee had a recurring role as piano player Billie Low in the short-lived TV series Tattinger's (1988). Alas, Pai quit acting in the 1990's and has kept a low profile ever since.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0656665","name":"Suzee Pai","idIMDB":"nm0656665"},"actorId":"nm0656665","character":"Miao Yin","urlCharacter":"http://www.imdb.com/character/ch0011938","main":true},{"actorName":"Chao Li Chi","urlProfile":"http://www.imdb.com/name/nm0156874","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNDY2NDEyNV5BMl5BanBnXkFtZTcwMjI5MDYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 April 1927","placeOfBirth":" Shanxi Province, China","bio":"Chao Li Chi was born on April 5, 1927 in Shanxi Province, China. He was an actor and writer, known for The Prestige (2006), Falcon Crest (1981) and Wedding Crashers (2005). He was married to Gan. He died on October 16, 2010 in Granada Hills, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNDY2NDEyNV5BMl5BanBnXkFtZTcwMjI5MDYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0156874","name":"Chao Li Chi","idIMDB":"nm0156874"},"actorId":"nm0156874","character":"Uncle Chu","urlCharacter":"http://www.imdb.com/character/ch0033686","main":true},{"actorName":"Jeff Imada","urlProfile":"http://www.imdb.com/name/nm0408001","urlPhoto":"","biography":{"dateOfBirth":"17 June 1955","placeOfBirth":" Inglewood, California, USA","birthName":"Jeffrey Imada","height":"5' 6\" (1.68 m)","bio":"Jeff Imada was born and raised in Inglewood, California, USA, where he began studying martial arts at the age of fifteen. At El Camino College and UCLA, he majored in pre-med and minored in music. While in college, he started working as a movie \"extra,\" which led to his becoming a member of the Screen Actors Guild, Stunts Unlimited and the Directors Guild of America. Jeff Imada also had been technical advisor on numerous films, including Dutch (1991), Tango & Cash (1989), Jumpin' Jack Flash (1986), Dreamscape (1984), and Streets of Fire (1984), and such television series as Magnum, P.I. (1980), Remington Steele (1982), Dynasty (1981), Matt Houston (1982), Supercopter (1984), Stingray (1985), Hart to Hart (1979) and Tales of the Gold Monkey (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0408001","name":"Jeff Imada","idIMDB":"nm0408001"},"actorId":"nm0408001","character":"Needles","urlCharacter":"http://www.imdb.com/character/ch0033922","main":true},{"actorName":"Rummel Mor","urlProfile":"http://www.imdb.com/name/nm0602220","urlPhoto":"","biography":{"birthName":"Rummel Mor Bautista","bio":"Rummel Mor was born as Rummel Mor Bautista. He is an actor, known for Big Trouble in Little China (1986), Mask (1985) and Shopping for Fangs (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0602220","name":"Rummel Mor","idIMDB":"nm0602220"},"actorId":"nm0602220","character":"Joe Lucky","urlCharacter":"http://www.imdb.com/character/ch0034050","main":true},{"actorName":"Craig Ng","urlProfile":"http://www.imdb.com/name/nm0628744","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NzY3OTA5NV5BMl5BanBnXkFtZTgwMzg3OTAyMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Craig Ng is known for his work on Big Trouble in Little China (1986), On Deadly Ground (1994) and A Low Down Dirty Shame (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NzY3OTA5NV5BMl5BanBnXkFtZTgwMzg3OTAyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0628744","name":"Craig Ng","idIMDB":"nm0628744"},"actorId":"nm0628744","character":"One Ear","urlCharacter":"http://www.imdb.com/character/ch0040252","main":true}],"seasons":[],"idIMDB":"tt0090728","urlIMDB":"http://www.imdb.com/title/tt0090728","business":{"budget":{"money":"$25,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$2,723,211","country":"USA","day":"06","month":"07","year":"1986","remarks":"1,053 Screens"},{"money":"£28,403","country":"UK","day":"16","month":"11","year":"1986","remarks":""}],"gross":[{"money":"AUD","country":"826,254","day":null,"month":null,"year":null,"remarks":null},{"money":"SEK","country":"6,154,569","day":null,"month":null,"year":null,"remarks":null},{"money":"$2,000,000","country":"West","day":null,"month":null,"year":null,"remarks":null},{"money":"490,691","country":"West","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1985/\">1985</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 39 min (99 min)"],"soundMix":["70 mm 6-Track (70 mm prints)","Dolby Stereo (35 mm prints)"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["DeLuxe, Hollywood (CA), USA"],"filmLength":["2,688 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm","70 mm (blow-up)"]},"rating":"7.3","filmingLocations":[{"location":"California, USA"}],"rated":"PG-13","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1987","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Music","names":[{"name":"John Carpenter","id":"nm0000118","role":null}]}]}]}],"votes":"98,002","type":"Movie","companyCreditsSimple":[{"idCompany":"co0000756","name":"Twentieth Century Fox Film Corporation"},{"idCompany":"co0047779","name":"TAFT Entertainment Pictures"}],"keywords":{"keywords":["truck","truck driver","cb radio","1980s","airport","chinese","green eyes","sorcerer","chinatown","immortal","fiancee","creature","battle","evil","well","supernatural","underground","magician","chase","bus","rescue","monster","magic","martial arts","siren the alarm","magical potion","five word title","ritual","sword","escape","notebook","sorcery","rite","mythology","skeleton","blindfolded","turban","motorcycle","camera","tour bus","revolver","customs","airliner","mahjong","street gang","gambling","investigation","explosion","ceremony","bride","tunnel","rat","umbrella","sewer","prayer","garter belt","buddha","nylons","warehouse","captive","panties","knife","gunfight","coffin","fire engine","gunshot","tong","police car","sex slavery","meat cleaver","blood","bordello","reference to dirty harry","shotgun","whorehouse","machine gun","video surveillance","prostitute","uncle nephew relationship","funeral march","tractor trailer","having picture taken","kung fu","mixed martial arts","stick fight","disarming someone","showdown","duel","hand to hand combat","combat","love interest","camera shot of feet","foot closeup","female stockinged feet","pantyhose","lifting female in air","sleeping gas","knocked out","man punching a woman","entrance","legend","female journalist","female reporter","female lawyer","sleeping woman","unsubtitled foreign language","mullet","supernatural power","bound and gagged","lifting someone into the air","self awareness","cult film","place name in title","electronic music score","tied to a bed","hogtied","country name in title","golden gate bridge","woman in jeopardy","sacrifice","race against time","mercenary","love","culture clash","brothel","negative asian stereotype","anti hero","wedding","underwater","trap","trance","toast","television news","sword throwing","swimming","surveillance","subterranean","stabbed in the forehead","spoof","spirit","slapstick comedy","shootout","security guard","reporter","rainstorm","potion","levitation","knife throwing","infatuation","gang warfare","friendship","elevator","curse","chinese american","brawl","bottle","bigamy","alley","white dress","scream","disguise","black magic","martial arts gymnastics","wheelchair","music score composed by director","sword fight","kidnapping","exploding body","crossbow","destiny","kukri dagger","lightning","reverse footage","san francisco california","balisong","asian american","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:42:39"}}