{"data":{"movies":[{"title":"I Hired a Contract Killer","originalTitle":"","year":"1990","releaseDate":"19910109","directors":[{"name":"Aki Kaurismäki","id":"nm0442454"}],"writers":[{"name":"Aki Kaurismäki","id":"nm0442454"},{"name":"Aki Kaurismäki","id":"nm0442454"}],"runtime":"79 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5ODkzOTQ3MF5BMl5BanBnXkFtZTcwNDA1MDgxMQ@@._V1.jpg","countries":["Finland","UK","Germany","Sweden","France"],"languages":["English"],"genres":["Comedy","Drama","Romance"],"plot":"After fifteen years' service, Henri Boulanger is made redundant from his job. Shocked, he attempts suicide, but can't go through with it, so he hires a contract killer in a seedy bar to murder him at some unspecified time in the future. But almost immediately he meets and falls in love with Margaret, a flower-seller, which makes Henri realise that his life has some meaning after all. But when he goes back to the bar to cancel the contract, he finds it has been demolished - and there's no way he can get in touch with the killer...","simplePlot":"After fifteen years' service, Henri Boulanger is made redundant from his job. Shocked, he attempts suicide, but can't go through with it, so he hires a contract killer in a seedy bar to ... ","actors":[{"actorName":"Jean-Pierre Léaud","urlProfile":"http://www.imdb.com/name/nm0529543","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NTA2MTQyMF5BMl5BanBnXkFtZTcwNDQ0MzA5Ng@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 May 1944","placeOfBirth":" Paris, France","height":"5' 7\" (1.7 m)","bio":"Jean-Pierre Léaud is not everybody's cup of tea for sure, but will remain an important name in film history. As an actor he can be adored or hated for exactly the same reasons: he is one of those rare players that directors let improvise his dialogue, which gets on certain viewers' nerves while it fascinates others. The same is true for his very personal staccato diction and elocution and his many mannerisms, the most obvious one being his way to run his hand through his long hair. But there is no denying Léaud is not just another actor, whether you love him or are allergic to him. The son of actress Jacqueline Pierreux and scriptwriter/assistant director Pierre Léaud, Jean-Pierre started acting very early. Indeed, he was only thirteen when he first appeared on a screen, playing a small role in a swashbuckling film directed by veteran Georges Lampin \"la Tour, prends garde!\" (1957). And he was still only fourteen when he answered an ad placed in a newspaper by François Truffaut, who was seeking a young actor able to play Antoine Doinel, a troubled adolescent, in his first feature film \"The 400 blows\". Jean-Pierre was tested among a hundred other candidates and proved so amazingly spontaneous and so gifted for improvisation that not only was he hired but he would go on to play the role in four subsequent Truffaut semi-autobiographies concluding with \"Love on the run\" (1978), a unique experience indeed. Thanks to Truffaut he was introduced to the other stars of the French New Wave, mainly Jean-Luc Godard for whom he would appear in eight films and one TV film, and gradually became their icon. Not too sure about his acting talents, he planned to become a director (which he actually did only once) and worked as an assistant to Truffaut and Godard. But his success both as Truffaut's alter ego and as the leftist movie makers' spokesman encouraged him to go on playing rather than directing. \"Masculin Féminin\" (1966) by Godard even earned him an Award for Best Actor at the Berlin Film Festival. An ardent leftist militant himself, he worked with equally committed directors, including abroad. He was in Italian Pasolini's \"Porcile\" (1968), in Polish Skolimovski's \"Dialog 20-40-60\" (also '68) Brazilian Carlos Diegues' Os herdeiros (1970) and Glauber Rocha's Der Leone have sept cabeças (1971). Bertolucci also hired him for \"Last tango in Paris\" starring Marlon Brando (who so petrified Léaud that he could not play his scenes alongside him), but this one was filmed in Paris. This busy period ended after an excellent role in a classic art movie in the French style: Jean Eustache's \"La maman et la putain\". In the late seventies and throughout the eighties Léaud worked irregularly, mainly on television, occasionally giving a crazy performance in a mainstream film, as was the case in Josiane's Balasko crime comedy \"Les keufs\", for which he got a César nomination. But he made an exciting comeback in the nineties when several \"new New Wave\" directors hired Léaud to pay homage to their elders. Among them French movie makers such as Olivier Assayas, Danièle Dubroux , Serge Le Péron or Bertrand Bonello and foreigners like Finnish Aki Käurismäki and Taiwanese Tsai Ming-Liang. A second youth for eternally young, rebellious, ill-at-ease, annoyingly romantic,touchingly annoying Jean-Pierre Léaud, whose round face staring at the camera in the last shot of \"The 400 blows\" will never be forgotten.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NTA2MTQyMF5BMl5BanBnXkFtZTcwNDQ0MzA5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0529543","name":"Jean-Pierre Léaud","idIMDB":"nm0529543"},"actorId":"nm0529543","character":"Henri Boulanger","urlCharacter":"http://www.imdb.com/character/ch0019334","main":true},{"actorName":"Margi Clarke","urlProfile":"http://www.imdb.com/name/nm0164891","urlPhoto":"","biography":{"dateOfBirth":"1954","placeOfBirth":" Liverpool, England, UK","height":"5' 5\" (1.65 m)","bio":"Margi Clarke was born in 1954 in Liverpool, England. She is an actress, known for I Hired a Contract Killer (1990), 24 Hour Party People (2002) and Letter to Brezhnev (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0164891","name":"Margi Clarke","idIMDB":"nm0164891"},"actorId":"nm0164891","character":"Margaret","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kenneth Colley","urlProfile":"http://www.imdb.com/name/nm0171829","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODM1MjQxM15BMl5BanBnXkFtZTgwNTkwNzUyMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 December 1937","placeOfBirth":" Manchester, England, UK","height":"5' 8\" (1.73 m)","bio":"Kenneth Colley was born on December 7, 1937 in Manchester, England. He is an actor and director, known for Star Wars: Episode V - The Empire Strikes Back (1980), Star Wars: Episode VI - Return of the Jedi (1983) and Life of Brian (1979).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODM1MjQxM15BMl5BanBnXkFtZTgwNTkwNzUyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0171829","name":"Kenneth Colley","idIMDB":"nm0171829"},"actorId":"nm0171829","character":"The Killer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"T.R. Bowen","urlProfile":"http://www.imdb.com/name/nm0100928","urlPhoto":"","biography":{"dateOfBirth":"1942","placeOfBirth":" UK","bio":"T.R. Bowen was born in 1942 in the UK. He is an actor and writer, known for Hornblower: Mutiny (2001), Agatha Christie's Miss Marple: The Mirror Crack'd from Side to Side (1992) and Agatha Christie's Miss Marple: A Caribbean Mystery (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0100928","name":"T.R. Bowen","idIMDB":"nm0100928"},"actorId":"nm0100928","character":"Department Head","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Imogen Claire","urlProfile":"http://www.imdb.com/name/nm0163256","urlPhoto":"","biography":{"dateOfBirth":"2 November 1943","placeOfBirth":" London, England, UK","bio":"Stark-looking Imogen Claire, the British dancer, choreographer and actress, was born in London in 1943 and trained at the Royal Ballet School. She went on to study at the London Dance Theatre and progressed to principal roles. As an actress with a decided taste for the avant garde, she became a regular player in the splashy, offbeat film dramas/musicals of Ken Russell, her first film being The Music Lovers (1970) with Glenda Jackson. This was followed by the controversial The Devils (1971) starring Vanessa Redgrave and Oliver Reed, The Boy Friend (1971), Savage Messiah (1972), Mahler (1974), Tommy (1975), Lisztomania (1975) and Valentino (1977). Along the same line, other cult films included The Rocky Horror Picture Show (1975), as one of the Transylvanians, Flash Gordon (1980), Caravaggio (1986), by the innovative director Derek Jarman, and Billy Elliot (2000), in which she played the role of a dance examiner. In the theatre realm, she appeared in a production of \"Tales of the Vienna Woods\" where she met John Rothenberg. They were a couple for over two decades before marrying in 1992. A great portion of her theatre assignments was with Philip Prowse, both as designer and director, with Imogen acting and providing the choreography. She also spent a couple of years teaching at the Drama Centre. Heavily involved in union politics, Imogen was elected Equity's very first choreographer council person in 1994. She lent a strong, unwavering voice, coming up with a steady stream of productive initiatives, particularly for dancers. The Dance Passport was launched in 2000 and proved a major success. She also pioneered insurance plans designed specifically for dancers in case of injury. She was re-elected in 2004 but illness prevented her from taking a full part in council activities. She died after a lengthy battle with cancer in her native London on June 24, 2005.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0163256","name":"Imogen Claire","idIMDB":"nm0163256"},"actorId":"nm0163256","character":"Secretary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Angela Walsh","urlProfile":"http://www.imdb.com/name/nm0909541","urlPhoto":"","biography":{"bio":"Angela Walsh is an actress, known for Nowhere Boy (2009), Distant Voices, Still Lives (1988) and I Hired a Contract Killer (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0909541","name":"Angela Walsh","idIMDB":"nm0909541"},"actorId":"nm0909541","character":"Landlady","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cyril Epstein","urlProfile":"http://www.imdb.com/name/nm0258440","urlPhoto":"","biography":{"bio":"Cyril Epstein is an actor, known for I Hired a Contract Killer (1990), Little Dorrit (1987) and Trojans (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0258440","name":"Cyril Epstein","idIMDB":"nm0258440"},"actorId":"nm0258440","character":"Taxi Driver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicky Tesco","urlProfile":"http://www.imdb.com/name/nm0856254","urlPhoto":"","biography":{"urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0856254","name":"Nicky Tesco","idIMDB":"nm0856254"},"actorId":"nm0856254","character":"Pete","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Cork","urlProfile":"http://www.imdb.com/name/nm0179893","urlPhoto":"","biography":{"bio":"Charles Cork is an actor, known for Snatch (2000), V for Vendetta (2005) and Never Let Me Go (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0179893","name":"Charles Cork","idIMDB":"nm0179893"},"actorId":"nm0179893","character":"Al","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael O'Hagan","urlProfile":"http://www.imdb.com/name/nm0641149","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MjgyMjEwNV5BMl5BanBnXkFtZTcwMDkzODY3Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"September1941","placeOfBirth":" Ireland","bio":"Michael O'Hagan was born in September 1941 in Ireland. He is an actor, known for End of Days (1999), Gods and Monsters (1998) and Midnight in the Garden of Good and Evil (1997). He has been married to Pamela Salem since July 31, 1983.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MjgyMjEwNV5BMl5BanBnXkFtZTcwMDkzODY3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0641149","name":"Michael O'Hagan","idIMDB":"nm0641149"},"actorId":"nm0641149","character":"The Killer's Boss","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tex Axile","urlProfile":"http://www.imdb.com/name/nm0043544","urlPhoto":"","biography":{"dateOfBirth":"13 July 1960","placeOfBirth":" Crawley, Sussex, England, UK","birthName":"Anthony Doughty","bio":"Tex Axile was born on July 13, 1960 in Crawley, Sussex, England as Anthony Doughty. He is an actor, known for I Hired a Contract Killer (1990) and Hail the New Puritan (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0043544","name":"Tex Axile","idIMDB":"nm0043544"},"actorId":"nm0043544","character":"Barkeeper","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Walter Sparrow","urlProfile":"http://www.imdb.com/name/nm0817112","urlPhoto":"","biography":{"dateOfBirth":"22 January 1927","placeOfBirth":" Eltham, London, England, UK","birthName":"Walter Leonard Sparrow","bio":"An English film and television actor best known for his appearance as Duncan in the 1991 film Robin Hood: Prince of Thieves starring Kevin Costner. Sparrow began his career as a stand-up comic before moving to acting with a period with the Royal Shakespeare Company. His first film role was in 1964, in Dr. Terror's House of Horrors, with Christopher Lee. Subsequent films, interspersed between countless TV appearances, included the 1969 sex fantasy Zeta One, Young Sherlock Holmes, and the acclaimed 1988 film The Accidental Tourist starring William Hurt, Kathleen Turner and Geena Davis. His career enjoyed a resurgence in the 1990s, with Sparrow playing key roles in the 1991 film Robin Hood: Prince of Thieves as the blinded retainer Duncan, 1993's The Secret Garden as gruff gardener Ben Weatherstaff, and the 1995 American coming-of-age film Now and Then as tragic drifter 'Crazy Pete'. In 1998 he starred in Tony Harrison's film Prometheus. Sparrow's even more prolific TV appearances included regular roles in the soap opera Emmerdale Farm, as two different characters, and the comedy Paris, and guest spots on Hugh and I, Adam Adamant Lives!, Randall and Hopkirk (Deceased), Z-Cars, All Creatures Great and Small, Alas Smith and Jones, Rumpole of the Bailey, Ernie in Birds Of A Feather, and The Bill among many others. Sparrow is also well known for playing Maurice, a peasant who was threatened to be shipped to the Americas, in the 1998 Cinderella remake Ever After. One of his more notable guest appearances was in the 1989 episode Danger UXD of the sitcom Only Fools and Horses, which had 16.1 million viewers, as porn shop owner Dirty Barry. In the 1990s the appeared in the sitcoms One Foot In The Grave and The Thin Blue Line. His last appearance was in 2000 in an episode of the BBC's medical drama series Doctors.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0817112","name":"Walter Sparrow","idIMDB":"nm0817112"},"actorId":"nm0817112","character":"Hotel Porter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony Rohr","urlProfile":"http://www.imdb.com/name/nm0737575","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTczOTEyNzM5NF5BMl5BanBnXkFtZTcwNzkxMzE2Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Tony Rohr is an actor, known for Les Misérables (2012), Leap Year (2010) and The Double (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTczOTEyNzM5NF5BMl5BanBnXkFtZTcwNzkxMzE2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0737575","name":"Tony Rohr","idIMDB":"nm0737575"},"actorId":"nm0737575","character":"Frank","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe Strummer","urlProfile":"http://www.imdb.com/name/nm0835329","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMDY5NjkzN15BMl5BanBnXkFtZTYwOTc2MDM4._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 August 1952","placeOfBirth":" Ankara, Turkey","birthName":"John Graham Mellor","height":"5' 8\" (1.73 m)","bio":"Although best known as the outspoken front man for legendary punk rock group The Clash, Joe Strummer also carved out an interesting niche as an actor once the band broke up. The Clash formed in 1976, and along with the Sex Pistols spearheaded the British punk rock scene. By 1979, The Clash had broadened their musical horizons at a time when most punk bands were painting themselves into a corner. By the early 1980s, The Clash were filling stadiums around the world; ultimately, trying to reconcile punk ethics with stardom took its toll on the band. The original line-up dissolved in 1983, and but with new members, Strummer soldiered on for a couple years longer. Ultimately embarrassed that The Clash had become a strange parody of itself, he split up the band once and for all, and then kept a low profile for a few years. When he returned, he decided to branch out in a new direction: acting. Strummer first appeared on film playing himself in Rude Boy (1980), a quasi documentary look at The Clash through the misadventures of a young roadie who tours with the band. His first proper role as an actor was as the grimy gangster Simms in Alex Cox's cult classic Straight to Hell (1986). Apparently Strummer employed the method school of acting on the shoot, not changing his clothes for days in the hot Spanish sun. His next notable appearance was as English Johnny in Jim Jarmusch's excellent Mystery Train (1989), a role clearly written for him by Jarmusch. His last appearance - speaking all of his dialogue in French - was in _Docteur Chance (1997)_ . Although not a professional actor by any means, Strummer's charisma went a long way, and he can be a treat to watch onscreen. Along with his acting work, Strummer also composed several film scores, including the excellent Walker (1987) and the raucous soundtrack to Permanent Record (1988). After more than 10 years with only sporadic musical output, Strummer returned in a big way with the excellent 1999 album Rock Art & The X-Ray Style. With his new band, The Mescaleros, Strummer enjoyed a strong comeback that put him back in the spotlight. Sadly, just a few months before The Clash were due to be inducted into the Rock & Roll Hall Of Fame, Strummer died of a congenital heart condition at the still young age of 50. His death came as a shock to fans around the world.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMDY5NjkzN15BMl5BanBnXkFtZTYwOTc2MDM4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0835329","name":"Joe Strummer","nicknames":["Woody"],"idIMDB":"nm0835329"},"actorId":"nm0835329","character":"Guitar Player / Singer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Graves","urlProfile":"http://www.imdb.com/name/nm0336336","urlPhoto":"","biography":{"dateOfBirth":"21 October 1911","placeOfBirth":" London, England, UK","bio":"English actor Peter George Wellesley Graves, a member of the Brish hereditary peerage as the eighth Baron Graves, was born on October 21, 1911 in London. His great-great-great-grandfather was Admiral Thomas Grave, who was made a peerage from Ireland as the first Baron Graves. Educated at Harrow, Graves became an actor and established his reputation as a light comedian and for his roles in musicals. On film, he career reached its apogee during World War II. In his 50s, he became a supporting player in comic roles, including Alfie (1966), The Wrong Box (1966) and The Magic Christian (1969). He continued to act into his 80s, primarily on TV. He died on June 6, 1994 at the age of 82.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0336336","name":"Peter Graves","idIMDB":"nm0336336"},"actorId":"nm0336336","character":"Jeweller","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0099818","urlIMDB":"http://www.imdb.com/title/tt0099818","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"SEK","country":"358,533","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 19 min (79 min)"],"soundMix":["Mono"],"color":["Color (Metrocolor)"],"aspectRatio":["1.85 : 1"],"camera":["Arriflex 35 BL II"],"laboratory":["Metrocolor, London, UK"],"filmLength":["2,190 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.3","filmingLocations":[{"location":"London, England, UK"}],"rated":"NOT RATED","awards":[{"award":"Jussi Awards 1991","titlesAwards":[{"titleAwardOutcome":"Won Jussi","categories":[{"category":"Best Cinematography (Paras kuvaus)","names":[{"name":"Timo Salminen","id":"nm0758742","role":null}]}]},{"titleAwardOutcome":"Nominated Jussi","categories":[{"category":"Best Actor (Paras miespääosa)","names":[{"name":"Jean-Pierre Léaud","id":"nm0529543","role":null}]}]}]},{"award":"Stockholm Film Festival 1990","titlesAwards":[{"titleAwardOutcome":"Nominated Bronze Horse","categories":[{"category":"","names":[{"name":"Aki Kaurismäki","id":"nm0442454","role":null}]}]}]},{"award":"Venice Film Festival 1990","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Lion","categories":[{"category":"","names":[{"name":"Aki Kaurismäki","id":"nm0442454","role":null}]}]}]}],"votes":"4,160","type":"Movie","companyCreditsSimple":[{"idCompany":"co0055215","name":"Esselte Video"},{"idCompany":"co0014703","name":"Finnkino"},{"idCompany":"co0021712","name":"Megamania"}],"keywords":{"keywords":["loneliness","loner","bar","dead aunt","contract to have one's self murdered","financial times the newspaper","telephone number","reference to ali ozgenturk","inside joke","terminal illness","flower vendor","phone book","cemetery","hamburger stand","pursuit","cancer","cigarette smoking","drinking","drink","life savings","money","taxi driver","gas strike","oven","sticking one's head in an oven","loss of job","gold watch","london england","suicide attempt","layoff","suicide by hitman","hitman","assassination","independent film","aunt nephew relationship"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:25:00"}}