{"data":{"movies":[{"title":"White Dog","originalTitle":"","year":"1982","releaseDate":"19820707","directors":[{"name":"Samuel Fuller","id":"nm0002087"}],"writers":[{"name":"Romain Gary","id":"nm0308900"},{"name":"Samuel Fuller","id":"nm0002087"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMDI1MjkyNF5BMl5BanBnXkFtZTcwNTQxNjM0Mg@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama"],"plot":"Deprogramming a dog who kills Blacks is the ultimate challenge for an unorthodox African-American trainer. When a young Hollywood actress finds the injured stray, she nurses it back to health, not knowing it's a \"White Dog\" trained by a racist to attack only Blacks. Julie's appalled when the otherwise gentle, white German Shepherd breaks out, then returns from his nighttime foray dotted with human blood. Julie desperately races from trainer to trainer, advised to kill her pet, until the top Hollywood canine expert refers her to his former protégé, Keys.","simplePlot":"A trainer attempts to retrain a vicious dog that's been raised to attack black people.","actors":[{"actorName":"Kristy McNichol","urlProfile":"http://www.imdb.com/name/nm0001531","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NTQ1ODQ5M15BMl5BanBnXkFtZTcwNTEyNTMyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1962","placeOfBirth":" Los Angeles, California, USA","birthName":"Christina Ann McNichol","height":"5' 4\" (1.63 m)","bio":"Actor Kristy McNichol is best known for her role as \"Buddy\" in the Spelling/Goldberg hit TV series \"Family\", where she won 2 Emmy awards and was nominated for a Golden Globe. McNichol began her career with guest appearances on such popular TV series as Starsky and Hutch, The Bionic Woman, Love American Style and The Love Boat, the list goes on. Her first role as a series regular came with the role of Patricia Apple in the CBS television series Apple's Way. McNichol began her feature film career in the Burt Reynolds comedy \"The End\" and went on to star with Dennis Quaid and Mark Hamill in \"The Night the Lights Went Out in Georgia\", \"Two Moon Junction\" with Louise Fletcher, \"The Pirate Movie\" with Christopher Atkins, \"Just the Way You Are\", \"The Forgotten One\", and \"You Can't Hurry Love\". Her television movie credits include \"Women of Valor\", \"Like Mom, Like Me\", \"Summer of My German Soldier\", \"Love, Mary\", \"My Old Man\" and many more. Kristy also performed voice characters in several animated TV series including \"Extreme Ghostbusters and Steven Spielberg's animated \"Invasion America\". Kristy starred in the hit movie \"Little Darlings\" with Tatum O'Neil which won her a People's Choice Award. Other TV credits include the Witt, Thomas, Harris hit series \"Empty Nest\". Kristy's films include Neil Simon's \"Only When I Laugh\" with Marsh Mason which earned her a Golden Globe nomination, Alan Pakula's \"Dream Lover\" and Samuel Fuller's \"White Dog\". Kristy devotes a lot of her time to charity work. Not only is Kristy McNichol a renowned actor but she is also a singer. Albums include \"The Pirate Movie\" soundtrack, \"The Night the Lights Went Out in Georgia\" soundtrack and The RCA Kristy and Jimmy McNichol album.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NTQ1ODQ5M15BMl5BanBnXkFtZTcwNTEyNTMyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001531","name":"Kristy McNichol","idIMDB":"nm0001531"},"actorId":"nm0001531","character":"Julie Sawyer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christa Lang","urlProfile":"http://www.imdb.com/name/nm0485713","urlPhoto":"","biography":{"dateOfBirth":"23 December 1943","placeOfBirth":" Winterberg, North Rhine-Westphalia, Germany","bio":"Christa Lang was born on December 23, 1943 in Winterberg, North Rhine-Westphalia, Germany. She is an actress and writer, known for White Dog (1982), What's Up, Doc? (1972) and S'en fout la mort (1990). She was previously married to Samuel Fuller.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0485713","name":"Christa Lang","idIMDB":"nm0485713"},"actorId":"nm0485713","character":"Nurse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vernon Weddle","urlProfile":"http://www.imdb.com/name/nm0917136","urlPhoto":"","biography":{"dateOfBirth":"24 August 1935","placeOfBirth":" Hattieburg, Mississippi, USA","bio":"Vernon Weddle was born on August 24, 1935 in Hattieburg, Mississippi, USA. He is an actor, known for Short Circuit (1986), White Dog (1982) and Norma Rae (1979).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0917136","name":"Vernon Weddle","idIMDB":"nm0917136"},"actorId":"nm0917136","character":"Vet","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jameson Parker","urlProfile":"http://www.imdb.com/name/nm0662321","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQ0Mzc5NDYwOF5BMl5BanBnXkFtZTcwMTgyMjgxOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1947","placeOfBirth":" Baltimore, Maryland, USA","birthName":"Francis Jameson Parker Jr.","height":"5' 11½\" (1.82 m)","bio":"Jameson Parker is best known for his role as A.J. Simon on Simon & Simon (1981), which ran on CBS for eight seasons. He was born in Baltimore and saw most of the capitals of Europe during his father's foreign service career. Young Parker also managed to see an inordinate number of boarding schools, claiming to have attended 10 in 13 years, and being bounced out of two. During a recuperative year off, he acted and worked in production at the Arena Stage in Washington, D.C. and he returned to finish his Beloit degree in theater arts in 1972. After graduation, he moved to New York, getting his first big break in a commercial for a breath mint. It helped him to get his role on the NBC soap Somerset (1970), which led to a two year part on ABC's One Life to Live (1968). He moved to LA in 1980. He loves camping and hunting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQ0Mzc5NDYwOF5BMl5BanBnXkFtZTcwMTgyMjgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0662321","name":"Jameson Parker","nicknames":["J.P.","Jamie"],"idIMDB":"nm0662321"},"actorId":"nm0662321","character":"Roland Grale","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karl Lewis Miller","urlProfile":"http://www.imdb.com/name/nm0588709","urlPhoto":"","biography":{"dateOfBirth":"16 June 1941","placeOfBirth":" Utica, New York, USA","bio":"Karl Lewis Miller was born on June 16, 1941 in Utica, New York, USA. He is known for his work on Babe, le cochon devenu berger (1995), Stand by Me (1986) and Bruce Almighty (2003). He died on March 27, 2008 in Arleta, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0588709","name":"Karl Lewis Miller","idIMDB":"nm0588709"},"actorId":"nm0588709","character":"Attacker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karrie Emerson","urlProfile":"http://www.imdb.com/name/nm0256228","urlPhoto":"","biography":{"dateOfBirth":"19 October 1959","placeOfBirth":" USA","bio":"Karrie Emerson was a beautiful, engaging and energetic slender brunette actress who had a fleeting ten year career. She was born in 1960. Karrie first began acting in the late 70s. She popped up in guest spots on such TV shows as \"Dallas,\" \"Vega$,\" \"The Jeffersons,\" and \"T.J. Hooker.\" She briefly appeared as a sunbather in Samuel Fuller's outstanding \"White Dog.\" Emerson had a recurring role on the popular daytime soap opera \"The Edge of Night.\" Karrie was especially impressive and memorable in substantial lovely luckless lass in jeopardy lead roles in the enjoyably trashy low-budget 80s horror favorites \"Evils of the Night\" and \"Chopping Mall.\" Alas, following her small part in the TV mini-series \"From the Dead of Night\" Karrie Emerson abruptly stopped acting in the late 80s.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0256228","name":"Karrie Emerson","idIMDB":"nm0256228"},"actorId":"nm0256228","character":"Sun Bather","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Helen Siff","urlProfile":"http://www.imdb.com/name/nm0797374","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0OTQyODkyNF5BMl5BanBnXkFtZTcwNjY3Njk1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Helen Siff is an actress, known for The Karate Kid (1984), Hail, Caesar! (2016) and You Don't Mess with the Zohan (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0OTQyODkyNF5BMl5BanBnXkFtZTcwNjY3Njk1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0797374","name":"Helen Siff","idIMDB":"nm0797374"},"actorId":"nm0797374","character":"Pound Operator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Glen Garner","urlProfile":"http://www.imdb.com/name/nm0307707","urlPhoto":"","biography":{"bio":"Glen Garner is known for his work on The Nutty Professor (1996), Cujo (1983) and Beethoven's 2nd (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0307707","name":"Glen Garner","idIMDB":"nm0307707"},"actorId":"nm0307707","character":"Pound Worker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Terrence Beasor","urlProfile":"http://www.imdb.com/name/nm0064065","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ2ODQ0MDYxNF5BMl5BanBnXkFtZTcwNzI1NTQzMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 February 1935","placeOfBirth":" Omaha, Nebraska, USA","bio":"Terrence is a graduate of the Pasadena Playhouse ('57), and was their \"Man of the Year\", in 2011. He earned his Equity card in a production of \"The Dybbuk\", directed by Morris Ankrum, on the Playhouse's Main Stage('62). He moved to NYC in 1965, and met his actress/wife, Muriel Minot in 1968 doing back-to-back shows at ELT. They moved to Boston where he subsequently got an MFA in Theatre from Brandeis University ('76), after which he and Muriel moved to LA. Here he fostered a career in Film/TV/commercials (most recently appearing as \"Grandpa\" in a Kraft \"Mac n' Cheese\" campaign), and voice-over work, including being 1/4th the voice of the Borg on all the Star Trek series (as well as ADR/looping on over 450 projects). He is proud to STILL be a \"working actor\", and a member of all the acting unions! He and Muriel have been married since December 1968.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ2ODQ0MDYxNF5BMl5BanBnXkFtZTcwNzI1NTQzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0064065","name":"Terrence Beasor","idIMDB":"nm0064065"},"actorId":"nm0064065","character":"Pound Driver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony Brubaker","urlProfile":"http://www.imdb.com/name/nm0115397","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1ODA2ODE2Ml5BMl5BanBnXkFtZTcwMDgzNzcyMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"6' 4\" (1.93 m)","bio":"Tony Brubaker is known for his work on Daredevil (2003), Heat (1995) and Training Day (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1ODA2ODE2Ml5BMl5BanBnXkFtZTcwMDgzNzcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0115397","name":"Tony Brubaker","idIMDB":"nm0115397"},"actorId":"nm0115397","character":"Sweeper Driver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Samuel Fuller","urlProfile":"http://www.imdb.com/name/nm0002087","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjA0NmU4MjMtOWQ1OS00MGQ3LTkxMDktNmVjNDZjOThiZGVkXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 August 1912","placeOfBirth":" Worcester, Massachusetts, USA","birthName":"Samuel Michael Fuller","height":"5' 6\" (1.68 m)","bio":"At age 17, Samuel Fuller was the youngest reporter ever to be in charge of the events section of the New York Journal. After having participated in the European battle theater in World War II, he directed some minor action productions for which he mostly wrote the scripts himself and which he also produced (e.g. The Baron of Arizona (1950)). His masterpiece was Pickup on South Street (1953) for 20th Century Fox, but at the end of the 1950s, he regained his independence from the production company and filmed many other movies of note, including the controversial White Dog (1982).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjA0NmU4MjMtOWQ1OS00MGQ3LTkxMDktNmVjNDZjOThiZGVkXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002087","name":"Samuel Fuller","nicknames":["Sammy"],"idIMDB":"nm0002087"},"actorId":"nm0002087","character":"Charlie Felton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marshall Thompson","urlProfile":"http://www.imdb.com/name/nm0860471","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMTI5MTY2OF5BMl5BanBnXkFtZTYwNDkzMDI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 November 1925","placeOfBirth":" Peoria, Illinois, USA","birthName":"James Marshall Thompson","height":"6' 1\" (1.85 m)","bio":"Although he geared himself up for major film stardom throughout the 1950s, it took a leading role on a 1960s TV series opposite a lion and chimpanzee to make Marshall Thompson a genuine household name. Born on November 27, 1925, and named James Marshall Thompson after an ancestor, a famed Supreme Court justice, he moved at age 5 with his parents from his Peoria, Illinois, hometown to the Los Angeles area. There his father set up a successful Westwood practice in dentistry that continued for over three decades. His mother once took to the stage as a concert singer and musician. Marshall was their only child. He caught the acting bug while in high school when he appeared in a number of school productions and was spotted by a local talent agent. This did not pan out, but he also acted upon his early skills as a writer. The Westwood Village Players produced the young high school student's ambitious three-act play \"Faith,\" the story of two young aviators in a Nazi prison. He enrolled at Occidental College, where he switched from prey-med to drama. He was also a member of the college's cross-country team. The athletic, lanky-framed, good-looking collegiate was rediscovered while performing as one of the Occidental Players in 1944. This time, he made good and was signed to a Universal contract. He began in minor war-era films with Reckless Age (1944) starring Gloria Jean and was quickly brought over to MGM on the strength of this film. With most big stars off to war, Marshall was given the chance to work quite steadily in perfunctory nice-guy assignments such as Blonde Fever (1944), The Clock (1945), They Were Expendable (1945) and Bad Bascomb (1946) opposite Frances Rafferty. His first association with animals came with the lead in the horse-friendly yarn Gallant Bess (1946), MGM's first film produced in CineColor. The handsome Marshall went on to provide yeoman work in the war dramas Homecoming (1948), Command Decision (1948) and Battleground (1949), becoming an instant babysitters idol to film fans. A genial player on screen, he managed to show potential outside his benign typecast in Dial 1119 (1950) as a cold-hearted, baby-faced killer, and finished his MGM contract out with The Tall Target (1951) playing a potential assassin of Abraham Lincoln. Freelancing for the next several years after losing his contract to MGM owing to a change of management, he assisted a few serious-minded dramas but a noticeable pall soon took over his career with \"B\" thrillers taking up the bulk of his time. He achieved a bit of cult infamy with the films Cult of the Cobra (1955) Fiend Without a Face (1958), It! The Terror from Beyond Space (1958) and First Man Into Space (1959). A couple of notable exceptions were his strong roles in the Audie Murphy starter To Hell and Back (1955) and East of Kilimanjaro (1957), in which he performed his own dangerous stunts and developed a lifelong passion for Africa and wildlife. It was this aforementioned wildlife association, combined with TV, that made the biggest dramatic impact on his career. Throughout the 1950s Marshall appeared faithfully in small-screen presentations, but in 1966 he was cast as a series lead, that of game warden Dr. Marsh Tracy in the African adventure Daktari (1966) developed by Ivan Tors and filmed at Africa, U.S.A., a wild-animal theme park near Los Angeles. Although overshadowed sometimes by those inveterate scene-steals Clarence the Cross-eyed Lion and Judy the Chimpanzee, Marshall provided a strong, honest, authoritative yet friendly persona and earned the most attention yet in his nearly two-decade-long career. He was also involved in nearly every aspect of the show and was afforded the opportunity to direct a few episodes. The series lasted four seasons, and following his departure, continued in the animal vein and his association with Tors by hosting the live action daytime series Jambo (1969), starring in the feature film Clarence, the Cross-Eyed Lion (1965) (which he co-wrote), and directing some episodes of Flipper (1964). Lying low after his final feature film, Around the World Under the Sea (1966), which starred assorted TV adventure alumni including Flipper (1964) star Brian Kelly and Sea Hunt (1958) lead Lloyd Bridges, he spent much of his later time providing footage for wildlife documentaries. An avid photographer, horseman, and guitarist, among many other talents, he died at age 66 in 1992 of congestive heart failure and was survived by his wife Barbara Long, daughter Janet, and grandson Jackson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMTI5MTY2OF5BMl5BanBnXkFtZTYwNDkzMDI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0860471","name":"Marshall Thompson","idIMDB":"nm0860471"},"actorId":"nm0860471","character":"Director","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Bartel","urlProfile":"http://www.imdb.com/name/nm0000860","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NDg5MzQ2OV5BMl5BanBnXkFtZTcwMTcwMTg5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1938","placeOfBirth":" Brooklyn, New York, USA","bio":"Paul Bartel was born in Brooklyn in 1938. He decided he wanted to direct animated movies when he was 11 and by 13 had spent a summer working at New York's UPA animation studio. He majored in theater arts at UCLA, and received a Fulbright scholarship to study film direction in Rome, producing a short that was presented at the 1962 Venice Fiom Festival. He later was hired by Roger Corman's brother, Gene, to direct a low-budget horror featured called \"Private Parts,\" released in 1972. Roger Corman hired him as a second unit director on \"Big Bad Mama,\" which led to his directing \"Death Race 2000\" in 1978. He could not persuade Corman to finance his pet project, \"Eating Raoul.\" The $500,000 black comedy was made after his parents sold their New Jersey home and gave him the money. Shot in 22 days, mostly weekends, over the course of a year, \"Eating Raoul\" starred Bartel and Mary Woronov as gourmet cannibals who lure sex swingers to their apartment, smack them with a skillet, rob them and use the proceeds to buy a restaurant.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NDg5MzQ2OV5BMl5BanBnXkFtZTcwMTcwMTg5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000860","name":"Paul Bartel","idIMDB":"nm0000860"},"actorId":"nm0000860","character":"Cameraman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Monahan","urlProfile":"http://www.imdb.com/name/nm0597544","urlPhoto":"","biography":{"dateOfBirth":"3 November 1924","placeOfBirth":" Millinocket, Maine, USA","bio":"Richard Monahan was born on November 3, 1924 in Millinocket, Maine, USA. He is an actor, known for The Steel Helmet (1951), White Dog (1982) and Untamed Women (1952).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0597544","name":"Richard Monahan","idIMDB":"nm0597544"},"actorId":"nm0597544","character":"Assistant Director","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Neyle Morrow","urlProfile":"http://www.imdb.com/name/nm0555655","urlPhoto":"","biography":{"dateOfBirth":"28 October 1914","placeOfBirth":" Jacksonville, Florida, USA","birthName":"Francis Neyle Marx Jr.","bio":"Neyle Morrow was born on October 28, 1914 in Jacksonville, Florida, USA as Francis Neyle Marx Jr. He was an actor, known for Shock Corridor (1963), The Steel Helmet (1951) and White Dog (1982). He died on September 30, 2006 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0555655","name":"Neyle Morrow","idIMDB":"nm0555655"},"actorId":"nm0555655","character":"Soundman","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0084899","urlIMDB":"http://www.imdb.com/title/tt0084899","business":{"budget":{"money":"$8,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"21","month":"04","year":"1981","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":["Mono"],"color":["Color (Metrocolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panaflex Cameras and Lenses by Panavision"],"laboratory":["Metrocolor, Culver City (CA), USA"],"filmLength":["2,455 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.1","filmingLocations":[{"location":"Wildlife Way Station - 14831 Little Tujunga Canyon Road, Sylmar, Los Angeles, California, USA"}],"rated":"PG","awards":[],"votes":"6,699","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["racist","dog","deprogramming","actress","burglar","rapist","african american","blood","dog movie","throwing darts at a cutout","stewardess","pistol","reference to star wars","allegory","firearm pointed at the camera","sour cream","strangulation","animal psychology","behavior modification","animal refuge","credit card","animal conditioning","protective hand mitt","bigot","llama","dog escaping from a cage","hit with a purse","dog climbing on top of a truck","garbage can","garbage","falcon","homicidal maniac","dog chewing on a cage","searchlight","feeding a lion","pulling up one's t shirt and exposing one's skin","t shirt","drinking from the bottle","whiskey","dog pacing in a cage","junkie","wino","hand over mouth","trailer park","box of chocolates","bare feet","bare chested male","horse","san bernardino california","compton california","barking dog","friendship","friend","animal rental","euthanizing a dog","film cameraman","film camera","film crew","attacked by a dog","robot cardboard cut out","glass repair truck","protected by a dog","breaking a window","dog jumping through a window","wrestling with a lion","safari hat","cowboy hat","dog steps on a man's crotch","licked by a dog","tug of war with a dog","dog chewing someone's underwear","underwear","dog medicine","kissing a dog","hollywood hills","staple gun","reference to blue cross insurance","reference to the screen actors guild","wine","aspiring film director","chimpanzee","elephant","bear","tiger","lion","arena cage","arena","exhaustion","protective body pads","protective mask","gas station","filling station","fencing mask","hiding under a vehicle","dead dog","reference to saint francis of assisi","stained glass window","crucifix","finding a dead body","leather manica","dog bite","neck bandage","arm bandage","dog fangs","climbing over a fence","fence","trust","dart","tranquilizer gun","dart gun","reference to dr. jekyll and mr. hyde the novel","rifle","cure","gun","murdered in a church","electric fence","reference to the hound of the basketvilles the novel","fear","hate","lobotomy","thunder","storm","lightning","hamburger","killed by a dog","murder","death","tears","crying","train","truck driver","truck","truck crashes into a building","truck crashes into a dress shop","truck accident","giving a bath to a dog","blood on a dog","injured dog","pet adoption","metaphor","sunbathing","climbing up a hill","climbing sown a hill","animal cage","jumping over a fence","aspca","giving medicine to a dog","dogcatcher","street cleaner","search","pursuit","chase","falling down stairs","leg scar","little girl","grandfather granddaughter relationship","race relations","old man","hospital","reference to noah's ark","eating","food","feeding a dog","screenwriter","cigar smoking","filmmaking","reference to lord byron","dog muzzle","reference to an academy award","reference to john wayne","breaking and entering","lost dog poster","lost dog","volkswagen beetle","subjective camera","polaroid","photograph","photographer","camera","slow motion scene","stabbed with scissors","scissors","watching a movie on tv","attempted rape","policeman","police","telephone call","rabbit","shooting a dog","killing a dog","watching tv","kiss","german shepherd","dog pound","attack dog","animal compound","flashlight","dog hit by a car","veterinarian","black american","bigotry","prejudice","cult film","racial violence","color in title","animal in title","foreign language adaptation","white panties","upskirt","panties slip","nipple slip","accidental nudity","ford mustang","dog attack","church","stray dog","social commentary","movie studio","movie set","los angeles california","hollywood california","dog training","dog trainer","controversy","compassion","boyfriend girlfriend relationship","apartment","anti racism","car accident","animal trainer","tragedy","racism","dog actor","animal attack","terror","death of friend","based on novel","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 07:57:13"}}