{"data":{"movies":[{"title":"Frasier, the Sensuous Lion","originalTitle":"","year":"1973","releaseDate":"19730619","directors":[{"name":"Pat Shields","id":"nm0793236"}],"writers":[{"name":"Sandy Dvore","id":"nm0233492"},{"name":"Jerry Kobrin","id":"nm0462187"}],"runtime":"97 min","countries":["USA"],"languages":["English"],"genres":["Comedy"],"simplePlot":"","actors":[{"actorName":"Michael Callan","urlProfile":"http://www.imdb.com/name/nm0130286","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI3OTYwOTk2OF5BMl5BanBnXkFtZTcwMDA3ODUxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1935","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Martin Calinieff","bio":"Actor, singer and dancer Michael Callan started life out as Martin Harris Calinieff in Philadelphia on November 22, 1935. A dark-haired charmer, he was taking voice and dance lessons by age 11, with the intentions of becoming the next Gene Kelly. He had the dark, smirking, surly good looks and confident swagger that fit in with the James Dean 50s rebel-like era. He began his professional career as a comic and dancer in Philly night clubs while billing himself as \"Mickey Calin\". Eventually, he entertained at such hot spots as the Copacabana and in Las Vegas showrooms. His move to New York was a wise choice. Given a dancing part in his first Broadway show, \"The Boyfriend\" (1954), starring Julie Andrews, he followed it with another musical, \"Catch a Star\" (1955). This, in turn, led to his biggest break of all, the role of \"Riff\" in the original New York production of \"West Side Story\" (1957). While the show made virtual theater stars out of its leads Carol Lawrence and Larry Kert, Michael, on the other hand, attracted the interest of Columbia Pictures. His film career began engagingly enough -- not as a singer or dancer, but as a dramatic leading man. Columbia placed him in two fairly strong films in the hopes of promoting and developing his obvious teen-idol promise. The first film was a western soap opera in support of Gary Cooper and Rita Hayworth. In They Came to Cordura (1959), Michael co-starred in this film alongside another male dreamboat, Tab Hunter. His second film was a \"B\"-level starring role in The Flying Fontaines (1959), in which he plays a circus Romeo whose caddish cavortings under the \"big top\" accelerate the melodramatic story line. This role pretty much set the tone for what, more or less, would become his screen image -- a notorious womanizer and charming, though sometimes, spineless opportunist. His lovely co-star in the movie, Evy Norlund, was a formerly-crowned Miss Denmark (1958). This movie was her only one, since she abruptly gave up her young aspirations when she married singer James Darren and raise a big family. One of Michael's biggest disappointments, during this time, was losing the role of \"Riff\" in the film version of West Side Story (1961), due to contractual restrictions with Columbia. Russ Tamblyn received the honors and the glory. But he did continue to rack up callow, trouble-making co-leads in youth-oriented films, paired up with Hollywood's loveliest of newcomers, including Tuesday Weld in Because They're Young (1960), Dolores Dorn in 13 West Street (1962) and Deborah Walley in both Gidget Goes Hawaiian (1961) and Bon Voyage! (1962). In The Interns (1962), he continued to perpetuate his slick image as a roving medical resident who juggles gorgeous Anne Helm and Katharine Bard for his own selfish purposes. In the sequel of sorts, The New Interns (1964), he made his customary moves on Barbara Eden (I Dream of Jeannie (1965)) and Dawn Wells) (\"Mary Ann\" on Gilligan's Island (1964)). Although he managed to show off his dancing skills in Pépé (1960) and in the afore-mentioned \"Gidget\" film, Michael never capitalized on it. The era of the movie musicals was in a backslide at the time and he focused completely on acting. He was among the international cast of the war epic, The Victors (1963), and was the best-looking marooned member in the British-made Jules Verne fantasy-adventure, Mysterious Island (1961). Interestingly, his last films of real note were in comedies -- opposite Jane Fonda, in the freewheeling cult western, Cat Ballou (1965), and a scene-stealing Lionel Jeffries in the British satire, You Must Be Joking! (1965). Perhaps his characters were too unsympathetic for their own good; for whatever reason, Michael never managed to hit the cinematic \"bad boy\" stardom he seemed geared up for. In the late 60s, he found a venue better-suited for his talents -- TV sitcoms. His skirt-chasing characters seemed to have more appeal when played lightly for laughs. His best chance came in the form of Occasional Wife (1966). An ideal showcase, Michael played the lead role of \"Peter Christopher\", an up-and-coming executive of a company that strongly pushes the husband/father image. Perennial playboy Callan decides to take on an \"occasional wife\" (Patricia Harty) for appearances' sake while trying to conceal his wily ways from the workplace. The show fit Callan like a glove and he and Harty displayed great chemistry, so much so that they married in real-life during the series' run. Perhaps the true-life marriage ruined the show's illusion, as the series limped away after only one season. Patricia, the second of Michael's three wives, divorced him a few years later. Surprisingly, Michael never starred in another sitcom that got off the ground. He ventured on finding guest appearances on such sitcoms as That Girl (1966), Hazel (1961) and Mary Tyler Moore (1970) and became a favorite player in the extremely popular Love, American Style (1969) sketches, playing (what else?) guys with girl troubles. His TV career eventually took the Fantasy Island (1977), The Love Boat (1977) and Murder, She Wrote (1984) route and, in an effort to jumpstart things, both produced and starred in his own film, Double Exposure (1983), but to little notice. He also returned, occasionally, to the stage in both legit plays and musicals to keep his name alive, including \"Absurd Person Singular\" and \"The Music Man\". The father of two daughters (from his first marriage), he has been glimpsed only here and there, since the mid-90s. Recent movie credits include Stuck on You (2003) and The Still Life (2006). He's also been spotted, occasionally, at various signings and conventions. While perhaps not climbing the height of heights expected, Michael reached an enviable plateau and merits strong attention for his fine contributions to 60s and 70s film and TV.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI3OTYwOTk2OF5BMl5BanBnXkFtZTcwMDA3ODUxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0130286","name":"Michael Callan","nicknames":["Mickey"],"idIMDB":"nm0130286"},"actorId":"nm0130286","character":"Marvin Feldman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Katherine Justice","urlProfile":"http://www.imdb.com/name/nm0433157","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2E3MmZjZjAtYzI1NS00NTllLTgzZGEtMWFmMDNkOTFlOGIxL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 October 1942","placeOfBirth":" Ohio, USA","height":"5' 6½\" (1.69 m)","bio":"Katherine Justice was born on October 28, 1942 in Ohio, USA. She is an actress, known for Guiding Light (1952), Prescription: Murder (1968) and 5 Card Stud (1968).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2E3MmZjZjAtYzI1NS00NTllLTgzZGEtMWFmMDNkOTFlOGIxL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0433157","name":"Katherine Justice","nicknames":["Kathy Justice"],"idIMDB":"nm0433157"},"actorId":"nm0433157","character":"Allison Stewart","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marc Lawrence","urlProfile":"http://www.imdb.com/name/nm0492908","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNzM5ODQ4MF5BMl5BanBnXkFtZTcwMjE4ODExOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1910","placeOfBirth":" New York City, New York, USA","birthName":"Max Goldsmith","height":"5' 10\" (1.78 m)","bio":"American character actor who specialized in underworld types, despite a far greater range. A native of the Bronx, Lawrence participated in plays in school, then attended the City College of New York. In 1930, he was accepted into Eva Le Gallienne's company, where he became friendly with another young actor, one day to be known as John Garfield. The two appeared in a number of plays, both with Le Galliene's company and with the highly-politicized Group Theatre, before Lawrence was given a film contract with Columbia Pictures. His scarred complexion and brooding appearance made him a natural for heavies, and he played scores of gangsters and mob bosses over the next six decades. Nevertheless, he could turn in fine performances in very different kinds of roles as well, such as his bewildered mountain boy in The Shepherd of the Hills (1941). Following the Second World War, as anti-Communist fervor gripped America, Lawrence found himself under scrutiny for his political leanings. When called before the House Un-American Activities Committee, he admitted he had once been a member of the Communist Party. The Committee broke down his resolve and he named the names of other Party members. He was blacklisted and departed for Europe, where he continued to make films, often in leading roles. Following the demise of the blacklist, he returned to America and resumed his position as a familiar and talented purveyor of gangland types. A writer and director as well, Lawrence has remained active in his ninth decade.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNzM5ODQ4MF5BMl5BanBnXkFtZTcwMjE4ODExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0492908","name":"Marc Lawrence","idIMDB":"nm0492908"},"actorId":"nm0492908","character":"Chiarelli","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Lorre Jr.","urlProfile":"http://www.imdb.com/name/nm0521137","urlPhoto":"","biography":{"dateOfBirth":"1 April 1934","placeOfBirth":" Karlsruhe, Germany","birthName":"Eugene Weingand","bio":"Eugene Weingand was born in Karlsrue, Germany on April 1, 1934 and emigrated to the US at the age of 20. Because of his passing resemblance to Peter Lorre he began calling himself Peter Lorie Jr. [sic]. In 1963 he applied to have his name legally changed to Peter Lorie Jr. but the famous actor objected, as did American International Pictures, which had Lorre under contract. After a hearing the judge denied Weingand's petition, deciding he was merely trying to cash in on a famous name. Weingand was barred from using the name Peter Lorie Jr. without Peter Lorre's permission. Unfortunately, Peter Lorre died a few months later and Weingand began calling himself Peter Lorre Jr [sic], and even began claiming to be the son of the famous actor. Under this name he made a handful of film and TV appearances in the 1960s and 70s, and subsequently dropped out of sight.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0521137","name":"Peter Lorre Jr.","idIMDB":"nm0521137"},"actorId":"nm0521137","character":"Boscov","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe E. Ross","urlProfile":"http://www.imdb.com/name/nm0743533","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MDc4MTA0N15BMl5BanBnXkFtZTgwNTg3NTY2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 March 1914","placeOfBirth":" New York City, New York, USA","birthName":"Joseph Roszawikz","height":"5' 7\" (1.7 m)","bio":"Gravel-voiced comedian Joe E. (\"Oooh! Oooh!\") Ross was born in Manhattan and began his career, ironically enough, as a singing waiter in speakeasy clubs. Comedy came to the forefront, however, and he steadily built up his image as a stand-up comic and impressionist, announcing and emceeing at burlesque clubs and various niteries around and about the Schuster circuit out of Chicago in the late 1930s. He made his film debut in the hotsy-totsy girlie show Teaserama (1955), which featured strippers Bettie Page and Tempest Storm and female impersonator Vicki Lynn. The underground flick had Ross doing his familiar baggy-pants burlesque schtick. Another \"break\" came with the comedy Hear Me Good (1957), co-starring Hal March, but it went nowhere and did not result in other offers. The crevice-faced, roly-poly funnyman's greatest claim to fame would be on situation comedy television, first as a third banana to Phil Silvers on his popular late 1950s series \"You'll Never Get Rich\" (The Phil Silvers Show (1955) / \"Sgt. Bilko\") and in the cult hit series Car 54, Where Are You? (1961) as dim-bulb Officer Gunther Toody, opposite Fred Gwynne (famous as \"Herman Munster\") as the more serious Officer Francis Muldoon. Silvers himself had discovered Ross, who was infamous for his \"blue comedy\" routines, working at the Club Ciro in Miami Beach, and he and producer/partner Nat Hiken hired him for \"Bilko\" in the role of dunderhead Master Sgt. Rupert Ritzik. It was Hiken who later gave the green light for Ross to co-star in \"Car 54\". Ross' last series was It's About Time (1966), in which he played a caveman named \"Gronk\" who was brought back to modern times with cavegirl Imogene Coca, but the series was critically blasted and short-lived. He fell out of favor after that and returned to the nightclub scene, appearing occasionally in shoddy, low-grade and obscure films with such tasteless and exploitative titles as How to Seduce a Woman (1974), Linda Lovelace for President (1975), Slumber Party '57 (1976) and The Happy Hooker Goes to Washington (1977). Joe E. Ross died while on stage at the age of 68 and was buried at Forest Lawn Cemetery in Los Angeles, CA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MDc4MTA0N15BMl5BanBnXkFtZTgwNTg3NTY2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0743533","name":"Joe E. Ross","idIMDB":"nm0743533"},"actorId":"nm0743533","character":"Kuback","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lori Saunders","urlProfile":"http://www.imdb.com/name/nm0766883","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MzI5MzE5Ml5BMl5BanBnXkFtZTgwODk5ODk1MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1941","placeOfBirth":" Kansas City, Missouri, USA","birthName":"Linda Marie Hines","height":"5' 5\" (1.65 m)","bio":"Striking brunette Lori Saunders managed to capitalize on her sunny, daisy-fresh beauty during CBS-TV's famous 1960s \"rural age\", an era in which the network churned out a connected trio of bucolic hit shows -- The Beverly Hillbillies (1962), Green Acres (1965) and Petticoat Junction (1963). As the studious, slightly ditzy middle daughter, \"Bobbie Jo Bradley\", on the last-mentioned show, her role would occasionally \"visit\" the other two shows. Once Petticoat Junction (1963) was canceled in 1970, Lori crossed over to the The Beverly Hillbillies (1962) set, with a recurring part as banker Drysdale secretary, \"Betty Gordon\", on its very last season (1970-1971). Born Linda Marie Hines on October 4, 1941, in Kansas City, Missouri, Lori studied, for a time, under acting coach Jeff Corey. Her professional career began at age 19, in 1960, with multiple episodes of The Adventures of Ozzie & Harriet (1952). She then dropped her real name in favor of the stage moniker, \"Linda Saunders\", and became a popular presence pitching commercial products on TV (well over 100). She also earned a few standard \"pretty girl\" film parts, in such minor fare as The Girls on the Beach (1965), Mara of the Wilderness (1965), starring Batman (1966) Adam West, and the horror opus, Blood Bath (1966). Finding sometime work on such established series as Burke's Law (1963), Lori finally hit paydirt when she was brought in to replace actress Pat Woodell on Petticoat Junction (1963) as one of the gorgeous Bradley daughters, when Woodell decided to leave in order to pursue a singing career. Lori changed her marquee name for the final time, in order to avoid confusion with the other \"Linda\" on the show -- Linda Henning). During the \"Petticoat\" run, Lori, Linda and Meredith MacRae formed a brief singing trio career in which they billed themselves as \"The Girls from Petticoat Junction\". The trio occasionally sang on the show (as the \"Hooterville Honeys\") and one available CD contains original songs (\"If You Could Only Be Me\", \"Thirty Days Hath September\") as well as established hits from other artists (\"Up, Up and Away\"). The girls booked a string of nightclubs and fairs, and also made a singing appearance on Johnny Carson's late-nite show. Following her TV peak, Lori continued to find acting work, elsewhere, on such shows as Daniel Boone (1964) and The Courtship of Eddie's Father (1969), as well as an occasional TV pilot. She played sweet \"Betsy McGuire\" for 26 episodes on yet another countrified show, Dusty's Trail (1973), that co-starred Gilligan's Island (1964) star Bob Denver and F Troop (1965) star Forrest Tucker. By coincidence, the other femme co-star on that series was none other than blonde Jeannine Riley, who played daughter \"Billie Jo Bradley\" on Petticoat Junction (1963) at one point but exited the Cannonball, just as Lori was boarding it in 1965. An attempt to shake up her wholesome image with leading roles in minor film fare did not pan out. Head On (1971), A Day at the White House (1972), Frasier, the Sensuous Lion (1973) and the slasher film, So Sad About Gloria (1975), co-starring Dean Jagger, in which Lori plays a former mental patient tormented by visions of ax murders, did little to advance her career and Lori eventually retired from acting work in 1980, following her appearance in the low-budget sci-fi film, Captive (1980), co-starring Cameron Mitchell and David Ladd. Married (since 1961) to longtime husband Bernard Sandler, who is retired now as owner and agent of his Commercial Talent Agency, and living in Southern California, the couple have two children, Ronald Sandler and Stacy Sandler. Lori's long-time creative focus has been on photography, art sculpture and oil painting. She is also a total vegan, an avid outdoors person, into spiritual mediation and involved in many charities involving children/animal rights advocate.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MzI5MzE5Ml5BMl5BanBnXkFtZTgwODk5ODk1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0766883","name":"Lori Saunders","idIMDB":"nm0766883"},"actorId":"nm0766883","character":"Minerva Dolly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Malachi Throne","urlProfile":"http://www.imdb.com/name/nm0861943","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk1Nzk0NzY1OF5BMl5BanBnXkFtZTcwMzA4MzUyOQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 December 1928","placeOfBirth":" New York City, New York, USA","height":"5' 7\" (1.7 m)","bio":"Malachi Throne, the character actor who became one of the more ubiquitous faces on television from the \"Golden Age\" of the 1950s through the 21st Century, was born in New York City on December 1, 1928, the son of Samuel and Rebecca Throne, who had immigrated to America from the Austro-Hungarian Empire. He began performing at an early age. During World War Two, the young Malachi quit school to work in theater, though he later returned and got his high school diploma. He then set out upon a life as a \"wandering player\", as he describes it, playing in summer and winter stock companies while matriculating at Brooklyn College and Long Island University. Though he loved acting, he believed he'd eventually wind up as an English teacher, which is why he doggedly kept at his studies between tours. When he was 21 years old, the Korean Conflict broke out, and Throne wound up in the infantry attached to an armored unit. When he returned to the New York theatrical scene, he found out that the revolution Marlon Brando had started in 1947 playing Stanley Kowalski in A Streetcar Named Desire (1951) was now the status quo. Possessed of a deep, classically trained voice, Throne was cast in the parts of characters much older than his actual age. His clear enunciation also made him a natural for live television, and he went to work on the now-defunct DuMont TV network. He continued his acting studies in New York, tutored by such luminaries as Uta Hagen and William Hickey. In addition to TV, he continued to work on the the stage, appearing in the landmark Off-Broadway production of Eugene O'Neill's \"The Iceman Cometh\", in support of Jason Robards. He also played in the famous Off-Broadway revivals of \"The Threepenny Opera\" and Clifford Odets' \"Rocket To The Moon\", as well as appeared on Broadway in such top shows as Jean Anouilh's \"Becket\" in support of Laurence Olivier. In 1958-59, he found himself in California, playing a season at San Deigo's Old Globe Theater. After his stint with the Globe was over, he went north, to Hollywood, and established himself as a major character actor in guest spots on series television during the 1960s. He had memorable appearances as \"Falseface\" on the Batman TV series and the Arab-styled \"Thief of Outer Space\" on the Lost in Space TV series. He also provided the voice of \"The Keeper\" for \"The Cage\", the pilot episode of the Star Trek (1966) series. He turned down an offer to be a regular cast member on that show, rejecting the part of Dr. McCoy as he did not want to play third fiddle to William Shatner and Leonard Nimoy. Producer Gene Roddenberry, who had offered him the role of \"Bones\" McCoy, was not offended by Throne turning him down, and cast him as \"Commodore José Mendez\" in the two-part episode \"The Menagerie\", which included most of the original pilot, although by then The Keeper's voice had been re-dubbed by another actor, Meg Wyllie. He also later played \"Senator Pardac\" in the \"Star Trek: The Next Generation\" two-part episode \"Unification,\" appearing with Leonard Nimoy, whose Mr. Spock was the role he had coveted a generation before. In 1968, two years after \"Star Trek\" debuted, Throne was cast as Robert Wagner's boss on the TV show It Takes a Thief (1968) while continuing to guest on other TV shows. Throne also remained committed to the stage, appearing as a resident actor with a variety of regional theaters, including the SanFrancisco Actors' Workshop, the Los Angeles Inner City Repertory Co., the MarkTaper Forum and the Louisville Free Theatre. Malachi Throne lives in southern California, where he appears in local theater. When not acting, he writes historical novels. His two sons are also in show business: Zachary Throne is an actor/musician while Joshua Throne is a Producer/Unit Production Manager.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk1Nzk0NzY1OF5BMl5BanBnXkFtZTcwMzA4MzUyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0861943","name":"Malachi Throne","idIMDB":"nm0861943"},"actorId":"nm0861943","character":"Bill Windsor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arthur Gould-Porter","urlProfile":"http://www.imdb.com/name/nm0332520","urlPhoto":"","biography":{"dateOfBirth":"4 January 1905","placeOfBirth":" Penzance, Cornwall, England, UK","bio":"Arthur Gould-Porter was born on January 4, 1905 in Penzance, Cornwall, England. He was an actor, known for Bedknobs and Broomsticks (1971), Torn Curtain (1966) and Darling Lili (1970). He died on January 2, 1987 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0332520","name":"Arthur Gould-Porter","idIMDB":"nm0332520"},"actorId":"nm0332520","character":"Motel Manager","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ralph James","urlProfile":"http://www.imdb.com/name/nm0416850","urlPhoto":"","biography":{"dateOfBirth":"29 November 1924","placeOfBirth":" Los Angeles County, California, USA","birthName":"Ralph James Torrez","bio":"Ralph James was born on November 29, 1924 in Los Angeles County, California, USA as Ralph James Torrez. He was an actor, known for Mork & Mindy (1978), Pancho's Hideaway (1964) and The Scooby-Doo/Dynomutt Hour (1976). He died on March 14, 1992 in Beverly Hills, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0416850","name":"Ralph James","idIMDB":"nm0416850"},"actorId":"nm0416850","character":"Newspaper Reporter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patrick O'Moore","urlProfile":"http://www.imdb.com/name/nm0641868","urlPhoto":"","biography":{"dateOfBirth":"8 April 1909","placeOfBirth":" Dublin, Ireland","height":"6' 2½\" (1.89 m)","bio":"Patrick O'Moore was born on April 8, 1909 in Dublin, Ireland. He was an actor, known for Sahara (1943), The Mechanic (1972) and The Two Mrs. Carrolls (1947). He was married to Maggi O'Moore and Zelma O'Neal. He died on December 10, 1983 in Van Nuys, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0641868","name":"Patrick O'Moore","idIMDB":"nm0641868"},"actorId":"nm0641868","character":"Worcester","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arthur Space","urlProfile":"http://www.imdb.com/name/nm0816475","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmI4ODk0ODEtNGNlNS00NzE5LTk4YzEtN2ZjMzNmMTZlZTA0XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 October 1908","placeOfBirth":" New Brunswick, New Jersey, USA","birthName":"Charles Arthur Space","height":"5' 10\" (1.78 m)","bio":"Arthur Space was born on October 12, 1908 in New Brunswick, New Jersey, USA as Charles Arthur Space. He was an actor, known for National Velvet (1960), The Spirit of St. Louis (1957) and 20 Million Miles to Earth (1957). He was married to Mary (Mollie) Campbell. He died on January 13, 1983 in Hollywood, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmI4ODk0ODEtNGNlNS00NzE5LTk4YzEtN2ZjMzNmMTZlZTA0XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0816475","name":"Arthur Space","idIMDB":"nm0816475"},"actorId":"nm0816475","character":"Dredge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Biro","urlProfile":"http://www.imdb.com/name/nm0083731","urlPhoto":"","biography":{"dateOfBirth":"5 October 1914","placeOfBirth":" New York City, New York, USA","birthName":"Barnet Wolf Biro","bio":"Frank Biro was born on October 5, 1914 in New York City, New York, USA as Barnet Wolf Biro. He was an actor, known for Between Jobs (1984), Ghost Dad (1990) and The Diary of a High School Bride (1959). He died on May 11, 1993 in Van Nuys, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0083731","name":"Frank Biro","idIMDB":"nm0083731"},"actorId":"nm0083731","character":"Host at Cocktail Party","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Chow","urlProfile":"http://www.imdb.com/name/nm0159448","urlPhoto":"","biography":{"dateOfBirth":"24 May 1929","placeOfBirth":" Toronto, Canada","birthName":"David Tai Wai Chow","bio":"David Chow was born on May 24, 1929 in Toronto, Canada as David Tai Wai Chow. He is known for his work on Conquest of the Planet of the Apes (1972), Kung Fu (1972) and Bruce Lee: The Man, the Myth (1976). He died on July 10, 2007 in Beverly Hills, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0159448","name":"David Chow","idIMDB":"nm0159448"},"actorId":"nm0159448","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patrick Cranshaw","urlProfile":"http://www.imdb.com/name/nm0186498","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MDEzODEwOF5BMl5BanBnXkFtZTYwMDUxMjY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 June 1919","placeOfBirth":" Bartlesville, Oklahoma, USA","birthName":"Joseph Patrick Cranshaw","bio":"Patrick Cranshaw was born on June 17, 1919 in Bartlesville, Oklahoma, USA as Joseph Patrick Cranshaw. He was an actor, known for Best in Show (2000), Old School (2003) and The Hudsucker Proxy (1994). He was married to Afyphee Shaw. He died on December 28, 2005 in Fort Worth, Texas, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MDEzODEwOF5BMl5BanBnXkFtZTYwMDUxMjY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0186498","name":"Patrick Cranshaw","idIMDB":"nm0186498"},"actorId":"nm0186498","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mwako Cumbuka","urlProfile":"http://www.imdb.com/name/nm0191784","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NTkwMTg4NV5BMl5BanBnXkFtZTcwMDg4OTEzNA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 September 1950","placeOfBirth":" USA","bio":"Mwako Cumbuka was born on September 1, 1950 in the USA. He is an actor, known for One Flew Over the Cuckoo's Nest (1975), Coffy (1973) and Firehouse (1973).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NTkwMTg4NV5BMl5BanBnXkFtZTcwMDg4OTEzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0191784","name":"Mwako Cumbuka","idIMDB":"nm0191784"},"actorId":"nm0191784","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0070075","urlIMDB":"http://www.imdb.com/title/tt0070075","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"15","month":"12","year":"1972","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 37 min (97 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["DeLuxe"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.0","filmingLocations":[],"rated":"PG","awards":[],"votes":"23","type":"Movie","companyCreditsSimple":[{"idCompany":"co0074428","name":"Shuster-Sandler"}],"keywords":{"keywords":["telepathy","lion","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 22:40:07"}}