{"data":{"movies":[{"title":"The Lost Honor of Kathryn Beck","originalTitle":"","year":"1984","releaseDate":"19840124","directors":[{"name":"Simon Langton","id":"nm0486748"}],"writers":[{"name":"Heinrich Böll","id":"nm0127093"},{"name":"Loring Mandel","id":"nm0541662"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2U3MTUxYTItODRiMC00OWRkLWEzNzYtNTQ2ODAxNjZmMmVjXkEyXkFqcGdeQXVyMzU0NzkwMDg@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama"],"plot":"A shopkeeper is condemned by the police & the press for sleeping with a suspected terrorist.","simplePlot":"A shopkeeper is condemned by the police & the press for sleeping with a suspected terrorist.","actors":[{"actorName":"Marlo Thomas","urlProfile":"http://www.imdb.com/name/nm0005486","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NjUyNTkwOV5BMl5BanBnXkFtZTcwMTgyNjY0MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 November 1937","placeOfBirth":" Detroit, Michigan, USA","birthName":"Margaret Julia Jacobs","height":"5' 4\" (1.63 m)","bio":"Many well-known and highly identifiable actresses have tried and failed to make the arduous crossover from fizzy TV sitcom star to mature, dramatic artist. Usually, it was their hardcore fans who refused to accept them in any other light. Sally Field and Elizabeth Montgomery come to mind first as two actresses who somehow managed to make the none-too-easy adjustment. Marlo Thomas became another success story as well--but, like the others, it was none too easy. Adorable to a fault, Marlo seemed to have nowhere to go after the early 1970s when the cute and wholesome Ann Marie of That Girl (1966) was suddenly no more. Born in Deerfield, Michigan, on November 21, 1937, to parents of Lebanese origin, Marlo was christened Margaret Julia Thomas. She was raised in the mad whirl of the entertainment business as the daughter of show business legend Danny Thomas, who was very determined that she not become an actress, at least until after college graduation. She actually began her adult life as a schoolteacher, but it was a very half-hearted career choice. Marlo began with early TV appearances in the late 1950s on such series as The Many Loves of Dobie Gillis (1959), Zane Grey Theater (1956) and Thriller (1960) Her first major break came when she was cast as Joey Bishop's sister and aspiring actress on the 1961 sitcom The Joey Bishop Show (1961) for one season. She continued to build up her resume with assorted guest shots on Bonanza (1959), McHale's Navy (1962), The Donna Reed Show (1958) and Ben Casey (1961). Following her delightful work on the London stage with \"Barefoot in the Park\" in 1965, she was finally given the opportunity to test for her own sitcom and passed with flying colors. Audiences adored the romantic entanglements and struggling ambition of \"Ann Marie\", a single, independent and very trendy young woman trying to make it as an actress in New York City. Marlo became an instant household name (as did co-star Ted Bessell) and nabbed a Golden Globe and four Emmy nominations during the show's five-year run. Following its demise in 1971, however, Marlo was faced with a problem: being stereotyped as a perky, wide-eyed innocent. Capitalizing on her TV fame, she tried to shatter her lightweight image with a serious film part. Playing the title role of Jenny (1970) opposite Alan Alda, Marlo starred as an unwed pregnant girl who marries a filmmaker out of convenience. Although the valiant effort brought her a Golden Globe nomination for Most Promising Newcomer, audiences stayed away in droves, much preferring her to be chipper and upbeat. She made her Broadway debut in the Herb Gardner play \"Thieves\" in 1974, and later made another stab at films by recreating her role for the big screen. The reviews for Thieves (1977) were less than ecstatic and no other strong offers came her way. Marlo decided to lay low for a time and wound up combining her deep love for children and education with her own career. She won bookend Emmy Awards as both star and producer of the children's specials Free to Be... You & Me (1974) in 1974 and Free to Be... a Family (1988). The album of the former continues to be in-print to the present day. By the late 1970s, however, audiences finally had stopped seeing her as only \"Ann Marie\". She earned renewed respect by stretching herself in TV movies. In the ABC holiday mini-movie It Happened One Christmas (1977), she played a troubled female version of James Stewart's It's a Wonderful Life (1946) character. She also won critical acclaim in the social, made-for-TV dramas The Lost Honor of Kathryn Beck (1984) and Consenting Adult (1985). She also copped an additional Emmy trophy as Best Actress in a Special for Nobody's Child (1986). Her subsequent return visits to Broadway with \"Social Security\" (1986) and \"The Shadow Box\" (1994) were rewarding as well. She has certainly not shied away from demanding theater roles, such as \"Beatrice\" in \"The Effect of Gamma Rays on Man-in-the-Moon Marigolds\" (1990), \"Martha\" in \"Who's Afraid of Virginia Woolf?\" (1992) and Ouisa in \"Six Degrees of Separation\" (1992). Although Marlo wed rather late in life, her enduring show business marriage since 1980 to talk-show icon Phil Donahue clearly indicates that the waiting was worthwhile. Still quite active on TV, she has continued to be a joy in everything from classic comedy (such as playing Jennifer Aniston's mom in Friends (1994)) to adult drama (as a lawyer/mentor in the highly-rated crime drama Law & Order (1990)). Younger brother Tony Thomas and sister Terre Thomas have also had leanings toward show business. Tony has been a prolific TV and film producer over the years, and Terre has dabbled as an actress, once having a guest role on Marlo's sitcom, That Girl (1966). On a more personal level, Marlo has continued the tradition of her late father as both spokesperson and humanitarian for St. Jude's Children's Hospital for cancer research.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NjUyNTkwOV5BMl5BanBnXkFtZTcwMTgyNjY0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005486","name":"Marlo Thomas","nicknames":["Miss Independence","Mugsy"],"idIMDB":"nm0005486"},"actorId":"nm0005486","character":"Kathryn Beck","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kris Kristofferson","urlProfile":"http://www.imdb.com/name/nm0001434","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODM4NDY5MTYyMl5BMl5BanBnXkFtZTYwNjg1ODE2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 June 1936","placeOfBirth":" Brownsville, Texas, USA","birthName":"Kristoffer Kristofferson","height":"5' 11½\" (1.82 m)","bio":"Kris Kristofferson was born in Brownsville, Texas, to Mary Ann (Ashbrook) and Lars Henry Kristofferson. His paternal grandparents were Swedish, and his father was a United States Air Force general who pushed his son to a military career. Kris was a Golden Gloves boxer and went to Pomona College in California. From there, he earned a Rhodes scholarship to study literature at Oxford University. He ultimately joined the United States Army and achieved the rank of captain. He became a helicopter pilot, which served him well later. In 1965, he resigned his commission to pursue songwriting. He had just been assigned to become a teacher at USMA West Point. He got a job sweeping floors in Nashville studios. There he met Johnny Cash, who initially took some of his songs but ignored them. He was also working as a commercial helicopter pilot at the time. He got Cash's attention when he landed his helicopter in Cash's yard and gave him some more tapes. Cash then recorded Kristofferson's \"Sunday Morning Coming Down\", which was voted the 1970 Song of the Year by the Country Music Association. Kris was noted for his heavy boozing. He lost his helicopter pilot job when he passed out at the controls, and his drinking ruined his marriage to singer Rita Coolidge, when he was reaching a bottle and half of Jack Daniels daily. He gave up alcohol in 1976. His acting career nose-dived after making Heaven's Gate (1980). In recent years, he has made a comeback with his musical and acting careers. He does say that he prefers his music, but says his children are his true legacy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODM4NDY5MTYyMl5BMl5BanBnXkFtZTYwNjg1ODE2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001434","name":"Kris Kristofferson","idIMDB":"nm0001434"},"actorId":"nm0001434","character":"Ben Cole","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Dzundza","urlProfile":"http://www.imdb.com/name/nm0001169","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MTgxNjkzMV5BMl5BanBnXkFtZTcwOTI0NDgwMw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 July 1945","placeOfBirth":" Rosenheim, Bavaria, Germany","birthName":"George F. Dzundza","height":"5' 9½\" (1.77 m)","bio":"George Dzundza was born on July 19, 1945 in Rosenheim, Bavaria, Germany as George F. Dzundza. He is an actor and assistant director, known for Basic Instinct (1992), The Deer Hunter (1978) and Crimson Tide (1995). He has been married to Mary Jo Vermeulen since 1982. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MTgxNjkzMV5BMl5BanBnXkFtZTcwOTI0NDgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001169","name":"George Dzundza","idIMDB":"nm0001169"},"actorId":"nm0001169","character":"Lt. DeCarlo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jon DeVries","urlProfile":"http://www.imdb.com/name/nm0222973","urlPhoto":"","biography":{"dateOfBirth":"26 March 1947","placeOfBirth":" New York City, New York, USA","bio":"Jon DeVries was born on March 26, 1947 in New York City, New York, USA. He is an actor, known for American Gangster (2007), Kill Your Darlings (2013) and Sarah, Plain and Tall (1991).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0222973","name":"Jon DeVries","idIMDB":"nm0222973"},"actorId":"nm0222973","character":"Bob Fuhrman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Rasche","urlProfile":"http://www.imdb.com/name/nm0711058","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2OTE4MzA5NV5BMl5BanBnXkFtZTgwOTIzNzcxOTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 August 1944","placeOfBirth":" St. Louis, Missouri, USA","height":"6' (1.83 m)","bio":"David Rasche was born on August 7, 1944 in St. Louis, Missouri, USA. He is an actor, known for Burn After Reading (2008), Men in Black 3 (2012) and Sledge Hammer! (1986). He has been married to Heather Lupton since 1979. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2OTE4MzA5NV5BMl5BanBnXkFtZTgwOTIzNzcxOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0711058","name":"David Rasche","idIMDB":"nm0711058"},"actorId":"nm0711058","character":"Donald Catton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Linda Thorson","urlProfile":"http://www.imdb.com/name/nm0861771","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMDYxMzE1NF5BMl5BanBnXkFtZTgwMTYzMTU2MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 June 1947","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Linda Robinson","height":"5' 9\" (1.75 m)","bio":"The adventurous Canadian-born actress, who would invariably be known as the brunette dish who replaced Diana Rigg on the highly popular The Avengers (1961) spy series, was born Linda Robinson on June 18, 1947, in Toronto, Ontario, Canada. The second of four children of a math and physics teacher, she made a move to England in 1965 and initially studied dance and voice. A teen apprentice at London's Royal Academy of Dramatic Arts, her professional career took off abruptly in another direction, away from the theatre lights, when the 20-year-old was chosen (out of over 200 hopefuls) to succeed Ms. Rigg's \"Emma Peel\" as Patrick Macnee's new female TV partner. Despite her equally luscious looks and a set of beautiful, crystal blue orbs, Linda had major boots to fill following Ms. Rigg's departure and the stay was not long or all that heralded. Fans and critics alike loved \"Emma Peel\"; as a result, neither were all that kind to the rather inexperienced Linda, who eventually returned to her theatre roots to weather out the storm. Out of the limelight for much of the 1970s with maybe a few TV and supporting film roles, including Valentino (1977) and The Greek Tycoon (1978), coming her way, Linda made the trek to America, Broadway to be exact, and won a Theatre World Award for her fine performance in \"Steaming\" in 1982. Immediately following came rave reviews for the Drama Desk Award-winning comedy farce \"Noises Off\" and a more poised, mature Linda was back on her own terms. As a transatlantic player working in the U.S., her native Canada and in England, she went on to perform with the prestigious Royal Shakespearean and Old Vic theatre companies. By the late 1980s, she was appearing with more frequency on the big screen in such lesser-known films as Walls of Glass (1985), Sweet Liberty (1986), The Other Sister (1999) and Mission Alcatraz (2002). TV credits include guest work on Law & Order (1990) and St. Elsewhere (1982) and, as a regular cast member, on the series Marblehead Manor (1987), the daytime soap One Life to Live (1968) and The Hoop Life (1999). Although she has yet to gain the same kind of attention (and controversy) she did as a 20-year-old, her career has been consistently rewarding over the last three decades. Outstanding stage work in \"Shirley Valentine\" (1993), \"The Sisters Rosenzweig\" (1995) and \"Amy's View\" (2000) have added to her value as an artist. Married four times (divorced from third husband producer/newsman Bill Boggs), she has one son, Trevor, and resides in New York City. Married Canadian filmmaker Gavin Mitchell, 20 November 2005.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMDYxMzE1NF5BMl5BanBnXkFtZTgwMTYzMTU2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0861771","name":"Linda Thorson","idIMDB":"nm0861771"},"actorId":"nm0861771","character":"Cory Fuhrman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edward Winter","urlProfile":"http://www.imdb.com/name/nm0935719","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwMTkxMTQyM15BMl5BanBnXkFtZTgwMTYwMTY1MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 June 1937","placeOfBirth":" Ventura, California, USA","birthName":"Edward Dean Winter","bio":"Edward Winter was born on June 3, 1937 in Ventura, California, USA as Edward Dean Winter. He was an actor, known for The Parallax View (1974), Porky's II (1983) and Project U.F.O. (1978). He was married to Linda Foster, Sandra L. Ward and Ronda Faye Moe. He died on March 8, 2001 in Woodland Hills, Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwMTkxMTQyM15BMl5BanBnXkFtZTgwMTYwMTY1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0935719","name":"Edward Winter","idIMDB":"nm0935719"},"actorId":"nm0935719","character":"Carl Macaluso","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Randy Rocca","urlProfile":"http://www.imdb.com/name/nm0733623","urlPhoto":"","biography":{"dateOfBirth":"28 February 1952","placeOfBirth":" Massachusetts, USA","birthName":"Randy George Rocca","bio":"Randy Rocca was born on February 28, 1952 in Massachusetts, USA as Randy George Rocca. He was an actor, known for The Lost Honor of Kathryn Beck (1984), Remington Steele (1982) and Cagney & Lacey (1981). He died on May 15, 1986 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0733623","name":"Randy Rocca","idIMDB":"nm0733623"},"actorId":"nm0733623","character":"Det. Gerry Astarte","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christine Estabrook","urlProfile":"http://www.imdb.com/name/nm0261452","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg3ODMwNDE2Nl5BMl5BanBnXkFtZTcwMjc4NTE4OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 September 1952","placeOfBirth":" Erie, Pennsylvania, USA","height":"5' 3\" (1.6 m)","bio":"Veteran actress Christine Estabrook has built an impressive portfolio of roles in film, television, and theater. Born and raised in East Aurora, near Buffalo, New York, Estabrook was one of five children raised by a single mother. She worked her way through school at various jobs, including a stint at the very first Fisher-Price toy factory making toys by hand. After graduating from the prestigious Yale School of Drama (among her classmates was Meryl Streep), she moved to New York to pursue an acting career. She quickly made her mark in the theater, starring in Broadway productions of The Sisters Rosenzweig, The Heidi Chronicles, I'm Not Rappaport, The Inspector General, and The Cherry Orchard. She won a Drama Desk Award for the Off-Broadway production of The Boys Next Door, an Obie Award for her role in Pastorale, and a Drama Desk Award nomination for her performance in North Shore Fish. Estabrook's credits also include numerous regional theater productions, and four years working in the Eugene O'Neill Playwrights Conference. After 17 years of performing on stage, Estabrook decided she was ready for new challenges and moved to Los Angeles, eager to work in a different medium. Since then, she has guest-starred on some of television's most popular shows and appeared in many feature films. The role of Mrs. Huber on Desperate Housewives (2004) was written especially for the actress by the series' creator, Marc Cherry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg3ODMwNDE2Nl5BMl5BanBnXkFtZTcwMjc4NTE4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0261452","name":"Christine Estabrook","idIMDB":"nm0261452"},"actorId":"nm0261452","character":"Janet Reiss","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steven Williams","urlProfile":"http://www.imdb.com/name/nm0931736","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwOTkwMjc0N15BMl5BanBnXkFtZTcwMzc1MDQ4Mg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1949","placeOfBirth":" Memphis, Tennessee, USA","height":"6' 2\" (1.88 m)","bio":"Steven Williams was born on January 7, 1949 in Memphis, Tennessee, USA. He is an actor and director, known for 21 Jump Street (1987), L.A. Heat (1996) and The Blues Brothers (1980).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwOTkwMjc0N15BMl5BanBnXkFtZTcwMzc1MDQ4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0931736","name":"Steven Williams","idIMDB":"nm0931736"},"actorId":"nm0931736","character":"Les Averback","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ron Parady","urlProfile":"http://www.imdb.com/name/nm0660884","urlPhoto":"","biography":{"dateOfBirth":"12 March 1940","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Ronald Bruce Parady","height":"6' 1\" (1.85 m)","bio":"Ron Parady was born on March 12, 1940 in Cleveland, Ohio, USA as Ronald Bruce Parady. He was an actor, known for The City (1995), Walking to the Waterline (1998) and The Naked Face (1984). He died on June 15, 2003 in Norwalk, Connecticut, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0660884","name":"Ron Parady","idIMDB":"nm0660884"},"actorId":"nm0660884","character":"James McLandish","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Leach","urlProfile":"http://www.imdb.com/name/nm0494880","urlPhoto":"","biography":{"bio":"William Leach is an actor, known for The Lost Honor of Kathryn Beck (1984) and American Playhouse (1981).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0494880","name":"William Leach","idIMDB":"nm0494880"},"actorId":"nm0494880","character":"Harry Flynn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Belinda Bremner","urlProfile":"http://www.imdb.com/name/nm0107103","urlPhoto":"","biography":{"dateOfBirth":"28 April 1948","placeOfBirth":" Chicago, Illinois, USA","height":"5' 6\" (1.68 m)","bio":"Founding member of the Body Politic Ensemble and ShawChicago. She has earned numerous awards including the Joseph Jefferson award and the American College Theater Festival award for her Mrs. Coney: A Tale at Christmas.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0107103","name":"Belinda Bremner","idIMDB":"nm0107103"},"actorId":"nm0107103","character":"Mary Siebel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike Genovese","urlProfile":"http://www.imdb.com/name/nm0312973","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg3ZmU5ZDUtYWQ2ZC00YTRjLTk1MzYtYjMzMmEwMDg2NjQwXkEyXkFqcGdeQXVyNDIzNDgxNTg@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1942","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Peter Michael Genovese","bio":"Born and raised in St. Louis, MO, Mike Genovese taught acting at Webster College from 1969 to 1973. There, he also began his professional acting career with the Lorreto Hilton Repertory Theatre, now the St. Louis Repertory Theatre. While performing in Washington, D.C., he met his future and present wife, TV/film actress Ellen Crawford. His career continued after he moved to Chicago and later Los Angeles. A veteran character actor, Genovese has appeared in many films such as two Richard Pryor billed vehicles: \"Jo Jo Dancer, Your Life Is Calling\" (1986) and \"Harlem Knights\", which also co-starred Eddie Murphy, Redd Foxx and Della Reese, and guest roles on TV series such as \"The Dukes of Hazzard\", \"Star Trek:The Next Generation\", \"Family Matters\", \"NYPD Blue\", \"Quantum Leap\", \"Arli$$\", \"ER\", Chicago Hope\" and \"JAG\", just to mention a few. For \"ER\", the long-running medical drama which airs on NBC, Genovese appeared in a recurring role as Officer Al Grabarsky, where he appeared opposite his real life wife, actress Ellen Crawford, who was as cast regular as Nurse Lydia Wright, his character's girlfriend. He appeared in twelve episodes of the series from 1994 through 2000. In 1979, Mike had a notable performance as Philip Marlowe at Chicago's Organic Theater in Stuart Gordon directed adaptation of Raymond Chandler's \"The Little Sister.\" In 2005, he appeared as Rev. Tollhouse in \"The Book of Liz\" play by Amy Sedaris and David Sedaris at the 2nd Stage Theatre, Hollywood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg3ZmU5ZDUtYWQ2ZC00YTRjLTk1MzYtYjMzMmEwMDg2NjQwXkEyXkFqcGdeQXVyNDIzNDgxNTg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0312973","name":"Mike Genovese","idIMDB":"nm0312973"},"actorId":"nm0312973","character":"Sgt. Ornett","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack McLaughlin-Gray","urlProfile":"http://www.imdb.com/name/nm0572451","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1ODE0NDU3MV5BMl5BanBnXkFtZTgwMTY1MzQ1OTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Jack McLaughlin-Gray is an actor, known for Négociateur (1998), Major League (1989) and The Boy in the Plastic Bubble (1976).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1ODE0NDU3MV5BMl5BanBnXkFtZTgwMTY1MzQ1OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0572451","name":"Jack McLaughlin-Gray","idIMDB":"nm0572451"},"actorId":"nm0572451","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0087639","urlIMDB":"http://www.imdb.com/title/tt0087639","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 36 min (96 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.5","filmingLocations":[{"location":"Chicago, Illinois, USA"}],"awards":[],"votes":"67","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0040329","name":"CBS Entertainment Production"},{"idCompany":"co0052972","name":"Cornworld"},{"idCompany":"co0003920","name":"Open Road"}],"keywords":{"keywords":["based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 20:25:05"}}