{"data":{"movies":[{"title":"Coming to America","originalTitle":"","year":"1988","releaseDate":"19880629","directors":[{"name":"John Landis","id":"nm0000484"}],"writers":[{"name":"Eddie Murphy","id":"nm0000552"},{"name":"David Sheffield","id":"nm0790775"}],"runtime":"116 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGZlNjdlZmMtYTg0MC00MmZkLWIyNDktYmNlOWYzMTkzYWQ1XkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"It is the 21st birthday of Prince Akeem of Zamunda and he is to marry a woman he never saw before. Now the prince breaks with tradition and travels to America to look for the love of his life.","simplePlot":"An extremely pampered African prince travels to Queens, New York City, and goes undercover to find a wife whom he can respect for her intelligence and will.","actors":[{"actorName":"Eddie Murphy","urlProfile":"http://www.imdb.com/name/nm0000552","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NDQzODAwNF5BMl5BanBnXkFtZTYwMzUzNTk3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 April 1961","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Edward Regan Murphy","height":"5' 9\" (1.75 m)","bio":"Edward Regan Murphy was born April 3, 1961 in Brooklyn, New York, to Lillian, a telephone operator, and Charles Edward Murphy, a transit police officer who was also an amateur comedian and actor. After his father died, his mother married Vernon Lynch, a foreman at a Breyer's Ice Cream plant. His siblings are Charlie Murphy and Vernon Lynch, Jr. Eddie had aspirations of being in show business since he was a child. A bright kid growing up in the streets of New York, Murphy spent a great deal of time on impressions and comedy stand-up routines rather than academics. His sense of humor and wit made him a stand out amongst his classmates at Roosevelt Junior-Senior High School. By the time he was fifteen, Murphy worked as a stand-up comic on the lower part of New York, wooing audiences with his dead-on impressions of celebrities and outlooks on life. In the early 1980s, at the age of 19, Murphy was offered a contract for the Not-Ready-For-Prime-Time Players of Saturday Night Live (1975), where Murphy exercised his comedic abilities in impersonating African American figures and originating some of the shows most memorable characters: Velvet Jones, Mr. Robinson, and a disgruntled and angry Gumby. Murphy made his feature film debut in 48 Hrs. (1982), alongside Nick Nolte. The two's comedic and antagonistic chemistry, alongside Murphy's believable performance as a streetwise convict aiding a bitter, aging cop, won over critics and audiences. The next year, Murphy went two for two, with another hit, pairing him with John Landis, who later became a frequent collaborator with Murphy in Coming to America (1988) and Beverly Hills Cop III (1994). Beverly Hills Cop (1984) was the film that made Murphy a box-office superstar and most notably made him a celebrity worldwide, and it remains one of the all-time biggest domestic blockbusters in motion-picture history. Murphy's performance as a young Detroit cop in pursuit of his friend's murderers earned him a third consecutive Golden Globe nomination. Axel Foley became one of Murphy's signature characters. On top of his game, Murphy was unfazed by his success, that is until his box office appeal and choices in scripts resulted into a spotty mix of hits and misses into the late 1980s and early 1990s. Films like The Golden Child (1986) and Beverly Hills Cop II (1987) were critically panned but were still massive draws at the box office. In 1989, Murphy, coming off another hit, Coming to America (1988), found failure with his directorial debut, Harlem Nights (1989). Another 48 Hrs. (1990) and his turn as a hopeless romantic in Boomerang (1992) did little to resuscitate his career. However, his remake of Jerry Lewis's The Nutty Professor (1996) brought Murphy's drawing power back into fruition. From there, Murphy rebounded with occasional hits and misses but has long proven himself as a skilled comedic actor with applaudable range pertaining to characterizations and mannerisms. Though he has grown up a lot since his fast-lane rise as a superstar in the 1980s, Murphy has lived the Hollywood lifestyle with controversy, criticism, scandal, and the admiration of millions worldwide for his talents. As Murphy had matured throughout the years, learning many lessons about the Hollywood game in the process, he settled down with more family-oriented humor with Doctor Dolittle (1998), Mulan (1998), Bowfinger (1999), and the animated smash Shrek (2001), in a supporting role that showcased Murphy's comedic personality and charm. Throughout the 2000s, he further starred in the hits The Haunted Mansion (2003), Shrek 2 (2004), Dreamgirls (2006) (for which he was nominated for a Best Supporting Actor Oscar), Norbit (2007), Shrek the Third (2007), and Shrek Forever After (2010). Murphy was married to Nicole Mitchell Murphy from 1993 to 2006. Murphy has eight children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NDQzODAwNF5BMl5BanBnXkFtZTYwMzUzNTk3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000552","name":"Eddie Murphy","nicknames":["Ed","Murph"],"idIMDB":"nm0000552"},"actorId":"nm0000552","character":"Prince Akeem / Clarence / Randy Watson / Saul","urlCharacter":"http://www.imdb.com/character/ch0011111","main":true},{"actorName":"Arsenio Hall","urlProfile":"http://www.imdb.com/name/nm0002119","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMTE2MTk3MF5BMl5BanBnXkFtZTcwNjc0MjQyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1956","placeOfBirth":" Cleveland, Ohio, USA","height":"5' 11\" (1.8 m)","bio":"Arsenio Hall was born on February 12, 1956 in Cleveland, Ohio, USA. He is an actor and writer, known for Coming to America (1988), The Real Ghostbusters (1986) and 1991 MTV Video Music Awards (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMTE2MTk3MF5BMl5BanBnXkFtZTcwNjc0MjQyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002119","name":"Arsenio Hall","idIMDB":"nm0002119"},"actorId":"nm0002119","character":"Semmi / Extremely Ugly Girl / Morris / Reverend Brown","urlCharacter":"http://www.imdb.com/character/ch0011116","main":true},{"actorName":"James Earl Jones","urlProfile":"http://www.imdb.com/name/nm0000469","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNTg1MzMwM15BMl5BanBnXkFtZTcwNTQyMDgyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 January 1931","placeOfBirth":" Arkabutla, Mississippi, USA","height":"6' 1½\" (1.87 m)","bio":"James Earl Jones was born on January 17, 1931 in Arkabutla, Mississippi, USA. At an early age, he started to take dramatic lessons to calm himself down. It appeared to work as he has since starred in many films over a 40-year period, beginning with the Stanley Kubrick classic Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb (1964). He is probably best known for his role as Darth Vader in the original Star Wars trilogy (for the voice only, as the man in the Darth Vader suit was David Prowse, whose voice was dubbed because of his British West Country accent). He has appeared on the animated series The Simpsons (1989) three times and played Mufasa in The Lion King (1994). James Earl Jones returned as the voice of Darth Vader in Star Wars: Episode III - Revenge of the Sith (2005) and Rogue One (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNTg1MzMwM15BMl5BanBnXkFtZTcwNTQyMDgyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000469","name":"James Earl Jones","nicknames":["Todd"],"idIMDB":"nm0000469"},"actorId":"nm0000469","character":"King Jaffe Joffer","urlCharacter":"http://www.imdb.com/character/ch0011112","main":true},{"actorName":"John Amos","urlProfile":"http://www.imdb.com/name/nm0025309","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA4OTcxNzk0MF5BMl5BanBnXkFtZTcwMzc5NDQwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 December 1939","placeOfBirth":" Newark, New Jersey, USA","birthName":"John A. Amos","height":"6' (1.83 m)","bio":"A native of New Jersey and son of a mechanic, African-American John Amos has relied on his imposing build, eruptive nature and strong, forceful looks to obtain acting jobs, and a serious desire for better roles to earn a satisfying place in the annals of film and TV. He has found it a constant uphill battle to further himself in an industry that tends to diminish an actor's talents with severe and/or demeaning stereotypes and easy pigeonholing. A tough, often hot-headed guy with a somewhat tender side, John would succeed far better on stage than on film and TV...with one extremely noteworthy exceptions. Born on December 27, 1939, John was first employed as an advertising copywriter, a social worker at New York's Vera Institute of Justice, and an American and Canadian semi-professional football player before receiving his calling as an actor. A stand-up comic on the Greenwich Village circuit, the work eventually took him West and, ultimately, led to his hiring as a staff writer on Leslie Uggams' musical variety show in 1969. Making his legit stage debut in a 1971 L.A. production of the comedy \"Norman, Is That You?\", John went on to earn a Los Angeles Drama Critics nomination for \"Best Actor\". As such, he formed his own theater company and produced \"Norman, Is That You?\" on tour. The following year he returned to New York to take his first Broadway bow in \"Tough To Get Help\". By this time he had secured secondary work on the classic Mary Tyler Moore (1970) as Gordy the weatherman. His character remained on the periphery, however, and he left the show after three discouraging seasons. On the bright side, he won the recurring role of the sporadically-unemployed husband of maid Florida Evans (played by Esther Rolle) on Norman Lear's Maude (1972) starring Bea Arthur. The two characters were spun-off into their own popular series as the parental leads in Good Times (1974). Good Times (1974), a family sitcom that took place in a Chicago ghetto high-rise, initially prided itself as being the first network series ever to be created by African-Americans. But subsequent episodes were taken over by others and John was increasingly disgruntled by the lack of quality of the scripts and the direction Lear was taking the show. Once focused on the importance of family values, it was shifting more and more toward the silly antics of Jimmie Walker, who was becoming a runaway hit on the show as the aimless, egotistical, jive-talking teenage son JJ. John began frequently clashing with the higher-ups and, by 1976, was released from the series, with his character being killed in an off-camera car accident while finding employment out of state. Amos rebounded quickly when he won the Emmy-nominated role of the adult Kunte Kinte in the ground-breaking epic mini-series Roots (1977), one of the most powerful and reverential TV features ever to hit television. It was THE TV role of his career, but he found other quality roles for other black actors extremely difficult to come by. He tried his best to avoid the dim-headed lugs and crime-motivated characters that came his way. Along with a few parts (the mini-movie Willa (1979) and the films The Beastmaster (1982) and Coming to America (1988)), he had to endure the mediocre (guest spots on \"Love Boat\", \"The A-Team\", \"Murder, She Wrote\" \"One Life to Live\"). John also toiled through a number of action-themed films that focused more on grit and testosterone than talent. He found one answer to this acting dilemma on the proscenium stage. In 1985, the play \"Split Second\" earned him the NAACP Award as Best Actor. He also received fine reviews in a Berkshire Theater festival production of \"The Boys Next Door\", a tour of O'Neill's towering play \"The Emperor Jones\", and in a Detroit production of Athol Fugard's \"Master Harold...and The Boys\". In addition, John directed two well-received productions, \"Miss Reardon Drinks a Little\" and \"Twelve Angry Men\", in the Bahamas. He took on Shakespeare as Sir Toby Belch in \"Twelfth Night\" at Joseph Papp's New York Shakespeare and earned strong notices in the late August Wilson's Pulitzer Prize-winning play \"Fences\" at the Capital Repertory Company in Albany, New York. Overseas he received plaudits for his appearance in a heralded production of \"The Life and Death of a Buffalo Soldier\" at the Bristol's Old Vic in England. Capping his theatrical career was the 1990 inaugural of his one-man show \"Halley's Comet\", an amusing and humanistic American journey into the life of an 87-year-old who recalls, among other things, World War II, the golden age of radio, the early civil rights movement, and the sighting of the Comet when he was 11. He wrote and has frequently directed the show, which continues to play into the 2007-2008 season. In recent years, John has enjoyed recurring parts on \"The West Wing\" and \"The District\", and is more recently appearing in the offbeat series Men in Trees (2006) starring Anne Heche. John Amos has two children by his former wife Noel Amos and two children. Son K.C. Amos director, writer, producer, editor and daughter Shannon Amos a director, writer and producer. Amos has one grand child,a grand-daughter, Quiera Williams.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA4OTcxNzk0MF5BMl5BanBnXkFtZTcwMzc5NDQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0025309","name":"John Amos","idIMDB":"nm0025309"},"actorId":"nm0025309","character":"Cleo McDowell","urlCharacter":"http://www.imdb.com/character/ch0011113","main":true},{"actorName":"Madge Sinclair","urlProfile":"http://www.imdb.com/name/nm0801672","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MzQzMjcxOV5BMl5BanBnXkFtZTcwNTM3ODUwOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1938","placeOfBirth":" Kingston, Jamaica","birthName":"Madge Dorita Walters","height":"5' 10½\" (1.79 m)","bio":"Madge Sinclair was born Madge Dorita Walters on April 28 1938 in Kingston, Jamaica, married young and had two sons. Madge worked as a teacher in Jamaica until she was 30. She left her two boys with their father and went to New York City to be an actress. She began modeling and later acted with the New York Shakespearean Festival and at Joseph Papp's Public Theatre. In 1974, Madge made her film debut, playing Mrs. Scott in Conrack (1974). She was nominated for an Emmy Award for her performance as Bell Reynolds in the miniseries Roots (1977). In the early 1980s, shortly after joining the cast of Trapper John, M.D. (1979), she was diagnosed with leukemia. She continued to work outliving the doctors' predictions by several years. On December 20, 1995, Madge Sinclair died at age 57 in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MzQzMjcxOV5BMl5BanBnXkFtZTcwNTM3ODUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0801672","name":"Madge Sinclair","idIMDB":"nm0801672"},"actorId":"nm0801672","character":"Queen Aoleon","urlCharacter":"http://www.imdb.com/character/ch0011117","main":true},{"actorName":"Shari Headley","urlProfile":"http://www.imdb.com/name/nm0372191","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NjMwNDY4Nl5BMl5BanBnXkFtZTgwMTYxMTcwOTE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1964","placeOfBirth":" Queens, New York City, New York, USA","height":"5' 7½\" (1.71 m)","bio":"Shari Headley was born on July 15, 1964 in Queens, New York City, New York, USA. She is an actress, known for The Haves and the Have Nots (2013), Switched at Birth (2011) and Coming to America (1988). She was previously married to Christopher Martin.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NjMwNDY4Nl5BMl5BanBnXkFtZTgwMTYxMTcwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0372191","name":"Shari Headley","idIMDB":"nm0372191"},"actorId":"nm0372191","character":"Lisa McDowell","urlCharacter":"http://www.imdb.com/character/ch0011114","main":true},{"actorName":"Paul Bates","urlProfile":"http://www.imdb.com/name/nm0061003","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjM0MzA2Ml5BMl5BanBnXkFtZTcwMzMxMDkwMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Paul Bates is an actor, known for Coming to America (1988), True Romance (1993) and 8 Mile (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjM0MzA2Ml5BMl5BanBnXkFtZTcwMzMxMDkwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0061003","name":"Paul Bates","idIMDB":"nm0061003"},"actorId":"nm0061003","character":"Oha","urlCharacter":"http://www.imdb.com/character/ch0065879","main":true},{"actorName":"Eriq La Salle","urlProfile":"http://www.imdb.com/name/nm0005113","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMjQ3NDUyNl5BMl5BanBnXkFtZTYwMTAzOTI4._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 July 1962","placeOfBirth":" Hartford, Connecticut, USA","birthName":"Erik Ki La Salle","height":"6' 2\" (1.88 m)","bio":"Born and raised in Hartford, CT, as one of four children. Studied two years at Juilliard and graduated from New York University graduate theater program with a B.F.A. degree in theater. Meanwhile he participated in the first of Joseph Papp's Shakespeare productions at the Park theater company. Later he supported himself by acting on and off Broadway and as \"Mike Rivers\" in the soap One Life to Live (1968). After that he moved to L.A. to guest-star in numerous TV series and TV movies.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMjQ3NDUyNl5BMl5BanBnXkFtZTYwMTAzOTI4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005113","name":"Eriq La Salle","idIMDB":"nm0005113"},"actorId":"nm0005113","character":"Darryl Jenks","urlCharacter":"http://www.imdb.com/character/ch0011115","main":true},{"actorName":"Frankie Faison","urlProfile":"http://www.imdb.com/name/nm0265670","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1Mjk3NDg5MV5BMl5BanBnXkFtZTcwNzI2ODQ1MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1949","placeOfBirth":" Newport News, Virginia, USA","height":"6' 2\" (1.88 m)","bio":"Frankie Faison was born on June 10, 1949 in Newport News, Virginia, USA. He is an actor, known for The Silence of the Lambs (1991), Hannibal (2001) and The Wire (2002). He has been married to Jane Mandel since December 26, 1988. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1Mjk3NDg5MV5BMl5BanBnXkFtZTcwNzI2ODQ1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0265670","name":"Frankie Faison","idIMDB":"nm0265670"},"actorId":"nm0265670","character":"Landlord","urlCharacter":"http://www.imdb.com/character/ch0239474","main":true},{"actorName":"Vanessa Bell Calloway","urlProfile":"http://www.imdb.com/name/nm0068599","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNDY5NDg5OV5BMl5BanBnXkFtZTcwOTY1MzcxOQ@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 March 1957","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Vanessa Bell","bio":"Vanessa Bell Calloway was born on March 20, 1957 in Cleveland, Ohio, USA as Vanessa Bell. She is an actress and director, known for Coming to America (1988), Daylight (1996) and Cheaper by the Dozen (2003). She has been married to Dr. Anthony Calloway since September 3, 1988. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNDY5NDg5OV5BMl5BanBnXkFtZTcwOTY1MzcxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0068599","name":"Vanessa Bell Calloway","idIMDB":"nm0068599"},"actorId":"nm0068599","character":"Imani Izzi","urlCharacter":"http://www.imdb.com/character/ch0239478","main":true},{"actorName":"Louie Anderson","urlProfile":"http://www.imdb.com/name/nm0004706","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MTAzNTc5MV5BMl5BanBnXkFtZTYwNTMxNzk1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 March 1953","placeOfBirth":" Minneapolis, Minnesota, USA","birthName":"Louie Perry Anderson","height":"5' 10\" (1.78 m)","bio":"Iconic comedian Louie Anderson, the three-time Emmy®-Award winner, is one of the country's most recognized and adored comics; named by Comedy Central as \"One of 100 Greatest Stand-Up Comedians of All Time.\" His career has spanned more than 30 years. He is a best selling author, star of his own stand up specials and sitcoms, and he continues to tour the country performing to standing room only crowds worldwide. In 2016, Louie was cast to co-star along with Zach Galifianakis and Martha Kelly in the hit FX series, \"Baskets.\" Anderson's extraordinary new role is Christine Baskets, the matriarch of the Baskets clan. The character is based on both his mother and his five sisters, who were a major presence in his life. \"I'm not as nice in the character as my mom was as a person. It really is an extension of my mom, Anderson says, adding that he always aims to make his performance \"as real as possible\" without \"affecting or cartooning it up. It felt like it was divine intervention when I got the call to be on the show, that somehow my mom, from the great beyond, was finally getting herself into show business where she truly belonged in the first place.\" Sharing the ups and downs of his childhood experiences as one of eleven children in Minnesota, Louie crafted comedy routines that rang true for his early club audiences while reducing them to helpless fits of laughter, routines that led him from his career as a counselor to troubled children to the first-place trophy at the 1981 Midwest Comedy Competition. Henny Youngman, who hosted the competition, recognized the diamond-in-the-rough genius of the young comic and hired him as a writer, providing invaluable experience that soon put Louie in his own spotlight on comedy stages all over the country. Johnny Carson, the comedy icon for generations of rising stars, invited Louie to make his national television debut on the \"The Tonight Show\" in 1984, and the rest is history. Leno, Letterman, The Late Late Show with Craig Ferguson, \"Comic Relief\" and Showtime, HBO and CMT specials followed, including hosting the legendary game show, Family Feud, making Louie a household name and opening doors for him as an actor. He has guest-starred in sitcoms like \"Grace Under Fire\" and dramas like \"Touched by an Angel\" and \"Chicago Hope,\" and he has had memorable featured roles in film comedies like \"Coming to America,\" opposite of Eddie Murphy, and the classic \"Ferris Bueller's Day Off.\" In 2013, he took a dive on the ABC reality series, \"Splash\" where he conquered his own fears while becoming an inspiration of hope. His stand up Special, \"Big Baby Boomer\" premiered on CMT, in 2013. Also in that year, he competed and inspired on the ABC reality competition show, Splash. In 1995 Louie put his creative energies to work on the Saturday morning animated series \"Life with Louie.\" The long-running series based on Louie's own childhood and his life with his father won three Humanitas Prizes for writing on a children's' animated series, making him the only three-time recipient of this award. It also earned a Genesis Award for its depiction of the proper treatment of animals and, most significantly, two Emmy Awards. His best selling books include Dear Dad - Letters From An Adult Child, a collection of alternately touching and outrageous letters from Louie to his late father, and Good-bye Jumbo...Hello Cruel World, self-help for those who struggle with self-esteem issues, and his latest installment on family, The F Word, How To Survive Your Family. When not in production, Louie continues to tour, traveling the States doing what Louie loves to do, Stand Up Comedy. Louie again delivers to his fans his inimitable brand of humor and warmth.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MTAzNTc5MV5BMl5BanBnXkFtZTYwNTMxNzk1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004706","name":"Louie Anderson","idIMDB":"nm0004706"},"actorId":"nm0004706","character":"Maurice","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Allison Dean","urlProfile":"http://www.imdb.com/name/nm0212695","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMTQwNDg4Nl5BMl5BanBnXkFtZTcwMzM0MjIzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Allison Dean is an actress and producer, known for Coming to America (1988), Tears of the Sun (2003) and Ruby in Paradise (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMTQwNDg4Nl5BMl5BanBnXkFtZTcwMzM0MjIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0212695","name":"Allison Dean","idIMDB":"nm0212695"},"actorId":"nm0212695","character":"Patrice McDowell","urlCharacter":"http://www.imdb.com/character/ch0011118","main":true},{"actorName":"Sheila Johnson","urlProfile":"http://www.imdb.com/name/nm0426220","urlPhoto":"","biography":{"bio":"Sheila Johnson is an actress, known for Coming to America (1988), Bright Lights, Big City (1988) and Shakedown (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0426220","name":"Sheila Johnson","idIMDB":"nm0426220"},"actorId":"nm0426220","character":"Lady-in-Waiting","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jake Steinfeld","urlProfile":"http://www.imdb.com/name/nm0826039","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5ODA4OTc1NF5BMl5BanBnXkFtZTcwODQ4NzkxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 February 1958","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"5' 11\" (1.8 m)","bio":"Jake Steinfeld was born on February 21, 1958 in Brooklyn, New York City, New York, USA. He is an actor and producer, known for Ratatouille (2007), Big Brother Jake (1990) and Coming to America (1988). He has been married to Tracey since 1989. They have four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5ODA4OTc1NF5BMl5BanBnXkFtZTcwODQ4NzkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0826039","name":"Jake Steinfeld","idIMDB":"nm0826039"},"actorId":"nm0826039","character":"Cab Driver","urlCharacter":"http://www.imdb.com/character/ch0218193","main":true},{"actorName":"Calvin Lockhart","urlProfile":"http://www.imdb.com/name/nm0516865","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxNjUxMzg0MjReQTJeQWpwZ15BbWU3MDA4NzIyMTg@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 October 1934","placeOfBirth":" Nassau, Bahamas","birthName":"Bert Cooper","height":"6' 2½\" (1.89 m)","bio":"Bahamian-born Calvin Lockhart first caught moviegoers' attention in the supercharged urban films Cotton Comes to Harlem (1970) and Halls of Anger (1970) before becoming a fairly steady fixture in the \"blaxploitation\" movies of the early-to-mid 1970s. Born Bert Cooper to a large family in Nassau on October 18, 1934, he was raised there before moving to New York in his late teens with initial designs on becoming a civil engineer (Cooper Union School of Engineering). Dropping out after a year to pursue an acting career, Calvin worked as a carpenter and construction worker, among other odd jobs. He first studied with legendary coach Uta Hagen and then hit the New York theater boards. The story goes that he was discovered by playwright Ketti Frings while working as a taxi driver. She was so impressed with his arrogance that she cast him in her play \"The Cool World\" in 1960. From there Calvin drummed up interest via a bit of controversy on Broadway when he played a sailor in love with a white girl in the racially-themed \"A Taste of Honey\" starring Angela Lansbury. Serious film and TV roles for black actors were scarce at that time, so Calvin moved to Europe. In Italy he owned a restaurant and formed his own theater company, serving as both actor and director. He also lived in Germany before settling in England. He starting building up film credits with minor work in such British movies as A Dandy in Aspic (1968) and Only When I Larf (1968). He made news in another racially-motivated project entitled Joanna (1968), which centered around a \"mod\", interracial romance with 'Genevieve Waite'. Returning to the US with a stronger resume, he made a distinct early impression as a slick preacher bent on fraud in the hip cop flick Cotton Comes to Harlem (1970) and as an English teacher in the inner-city potboiler Halls of Anger (1970). He also involved himself in such black action features as Melinda (1972), Honeybaby, Honeybaby (1974) and The Baron (1977). Similar in charismatic style and intelligence to Sidney Poitier, the famed actor-director was impressed enough to cast Calvin in his broad comedy vehicles Uptown Saturday Night (1974) and Let's Do It Again (1975). Calvin could also play fey upon request, camping it up briefly in Myra Breckinridge (1970). During this rich period he also became an artist-in-residence with the Royal Shakespeare Company at Stratford (the first black actor so honored) and appeared prestigiously in such productions as \"Titus Andronicus\" (1972). Calvin's career grew lackluster, however, by the end of the decade, resorting to trivial guest parts in such TV shows as Good Times (1974) and Get Christie Love! (1974). He landed a recurring role on the nighttime soap Dynasty (1981) in the early '80s. In 1974, Calvin married a woman also from the West Indies and had three children. After his career subsided, he decided to return to his homeland in the mid '90s and resettled in Nassau with his fourth wife, Jennifer Miles. There he involved himself with the Freeport Players Guild as a director. He also returned to films after a 15-year absence, completing Rain (2008), a movie shot in the Bahamas, shortly before he suffered a major stroke. Calvin died of complications on March 29, 2007, and his family is in the process of establishing a scholarship fund in his name for Bahamian student pursuing an acting or filmmaking career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxNjUxMzg0MjReQTJeQWpwZ15BbWU3MDA4NzIyMTg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0516865","name":"Calvin Lockhart","idIMDB":"nm0516865"},"actorId":"nm0516865","character":"Colonel Izzi","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0094898","urlIMDB":"http://www.imdb.com/title/tt0094898","business":{"budget":{"money":"$39,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$160,600,000 (Worldwide)","country":"except","day":null,"month":null,"year":null,"remarks":null},{"money":"SEK","country":"22,895,486","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1988/\">1988</a>"},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1988/\">1988</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 56 min (116 min)"],"soundMix":["Dolby"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Panaflex Gold, Panavision Primo Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm (Eastman 125T 5247, 400T 5294, 400T 5295, 250D 5297)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.0","metascore":"48","filmingLocations":[{"location":"392 S 5th Street, Brooklyn, New York, USA"}],"rated":"R","awards":[{"award":"Academy Awards, USA 1989","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Costume Design","names":[{"name":"Deborah Nadoolman","id":"nm0618966","role":null}]},{"category":"Best Makeup","names":[{"name":"Rick Baker","id":"nm0000711","role":null}]}]}]},{"award":"All Def Movie Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated All Def Movie Award","categories":[{"category":"Most Quoted Movie","names":[]}]}]},{"award":"American Comedy Awards, USA 1989","titlesAwards":[{"titleAwardOutcome":"Won American Comedy Award","categories":[{"category":"Funniest Supporting Actor in a Motion Picture","names":[{"name":"Arsenio Hall","id":"nm0002119","role":null}]}]}]},{"award":"BMI Film & TV Awards 1989","titlesAwards":[{"titleAwardOutcome":"Won BMI Film Music Award","categories":[{"category":"","names":[{"name":"Nile Rodgers","id":"nm0734755","role":null}]}]}]},{"award":"Golden Screen, Germany 1988","titlesAwards":[{"titleAwardOutcome":"Won Golden Screen","categories":[{"category":"","names":[]}]}]},{"award":"Image Awards 1990","titlesAwards":[{"titleAwardOutcome":"Won Image Award","categories":[{"category":"Outstanding Motion Picture","names":[]},{"category":"Outstanding Supporting Actor in a Motion Picture","names":[{"name":"Arsenio Hall","id":"nm0002119","role":null}]}]}]},{"award":"Kids' Choice Awards, USA 1989","titlesAwards":[{"titleAwardOutcome":"Nominated Blimp Award","categories":[{"category":"Favorite Movie Actor","names":[{"name":"Eddie Murphy","id":"nm0000552","role":null}]}]}]}],"votes":"126,751","type":"Movie","companyCreditsSimple":[{"idCompany":"co0102273","name":"Eddie Murphy Productions"},{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["prince","queen","queens new york city","america","male with ponytail","trailer narrated by percy rodriguez","male actor playing a female character","cold weather","rudeness","snow","winter","taxi ride","airport","concorde","dancing","money","secret","wealth","earrings","janitor","boyfriend girlfriend relationship","hamburger","mopping a floor","fairy tale","sidekick","barking","breasts","bride and groom","1980s","two suitors","suitor","man with glasses","new york city","manhattan new york city","madison square garden manhattan new york city","implied fellatio","female nudity","reference to hugh hefner","reference to rocky marciano","satire","obnoxiousness","irreverence","reference to martin luther king jr.","cult film","flirting","fictional country","jheri curl hairstyle","role reversal","usa","king","friendship","fish out of water","assumed identity","arranged marriage","fake commercial","blockbuster","switchblade","royalty","african american","actor playing multiple roles","urban decay","basketball","studio logo segues into film","homelessness","hold up man","barber","spit take","ghetto","barbershop","nightclub","father daughter relationship","africa","father son relationship"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:35:29"}}