{"data":{"movies":[{"title":"Safety in Numbers","originalTitle":"","year":"1930","releaseDate":"19300530","directors":[{"name":"Victor Schertzinger","id":"nm0006276"}],"writers":[{"name":"Marion Dix","id":"nm0228706"},{"name":"George Marion Jr.","id":"nm0547938"}],"runtime":"80 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzU1Y2U0ZGItMGUwNS00MTljLWI5OWUtOWM5NDhmY2M1Y2E0XkEyXkFqcGdeQXVyMTcyODY2NDQ@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Musical","Romance"],"plot":"William Butler Reynolds is slated to inherit ten-million dollars on his 21st birthday, but his worldly uncle, F. Carstairs Reynolds, thinks the lad could use a bit of seasoning before that happens. He sends him to New York City with the purpose of the trip to acquaint him with the pitfalls and wicked ways of the big city, especially for young millionaires. The uncle, who believes there is safety in numbers, also assigns, and pays well, three Follies girls,Jacqueline, Maxine and Pauline, to oversee the lad's tutoring. In the interest of ensuring the boy is well-tutored, Alma McGRegor and Cleo Carewe volunteer their services. Nothing could possibly go wrong with that many experienced tutors on the job.","simplePlot":"A songwriter hires three chorus girls to show him the \"underside\" of big-city life.","actors":[{"actorName":"Charles 'Buddy' Rogers","urlProfile":"http://www.imdb.com/name/nm0736777","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMjQxMjc4OF5BMl5BanBnXkFtZTYwMTE3MjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 August 1904","placeOfBirth":" Olathe, Kansas, USA","height":"6' (1.83 m)","bio":"Born to Maude and Bert Henry Rogers. Attended Olathe high school and Univ. of Kansas. He trained at the Paramount Picture School.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMjQxMjc4OF5BMl5BanBnXkFtZTYwMTE3MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0736777","name":"Charles 'Buddy' Rogers","nicknames":["America's Boyfriend"],"idIMDB":"nm0736777"},"actorId":"nm0736777","character":"William Butler Reynolds","urlCharacter":"http://www.imdb.com/character/ch0494461","main":true},{"actorName":"Kathryn Crawford","urlProfile":"http://www.imdb.com/name/nm0186856","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDU2NzZhNzItOGI3ZS00YTAxLTgwNTMtNjZhMDZmMDI0ZTM5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 October 1908","placeOfBirth":" Wellsboro, Pennsylvania, USA","birthName":"Kathryn Moran","height":"5' 2\" (1.57 m)","bio":"Kathryn Crawford was born on October 5, 1908 in Wellsboro, Pennsylvania, USA as Kathryn Moran. She was an actress, known for Safety in Numbers (1930), King of Jazz (1930) and Emma (1932). She was married to Ralph M. Parsons and James Edgar Jr. She died on December 7, 1980 in Pasadena, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDU2NzZhNzItOGI3ZS00YTAxLTgwNTMtNjZhMDZmMDI0ZTM5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0186856","name":"Kathryn Crawford","idIMDB":"nm0186856"},"actorId":"nm0186856","character":"Jacqueline","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Josephine Dunn","urlProfile":"http://www.imdb.com/name/nm0242642","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNTEzMTExMV5BMl5BanBnXkFtZTgwOTE1ODY3MTE@._V1._CR1.883331298828125,2.5333404541015625,297,380_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 May 1906","placeOfBirth":" New York City, New York, USA","birthName":"Mary Josephine Dunn","height":"5' 3½\" (1.61 m)","bio":"Convent-educated Mary Josephine Dunn got her start in the chorus line of 'Good Morning, Dearie' at the age of 15. She was briefly in the Ziegfeld Follies and, in 1924, had a walk-on in 'Dear Sir' on Broadway. Two years later, she was picked by a talent scout to join the Paramount acting school for hopeful young debutantes. A ravishing blue-eyed blonde, she made an impression in D.W. Griffith's The Sorrows of Satan (1926), Our Modern Maidens (1929) and had good reviews in the Ernst Lubitsch-directed operetta One Hour with You (1932) as Mademoiselle Martel. She had a rare co-starring role in Safety in Numbers (1930) alongside Carole Lombard, but third-billing was as good as it got for Josephine. By early 1933, she was reduced to playing vamps and mercenary wives and retired from the screen five years later, making sporadic appearances in summer stock during the 1940's.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNTEzMTExMV5BMl5BanBnXkFtZTgwOTE1ODY3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0242642","name":"Josephine Dunn","idIMDB":"nm0242642"},"actorId":"nm0242642","character":"Maxine","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carole Lombard","urlProfile":"http://www.imdb.com/name/nm0001479","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg5NjI3MDA5Nl5BMl5BanBnXkFtZTcwMzY3OTQ4Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 October 1908","placeOfBirth":" Fort Wayne, Indiana, USA","birthName":"Jane Alice Peters","height":"5' 6\" (1.68 m)","bio":"Carole Lombard was born Jane Alice Peters in Fort Wayne, Indiana, on October 6, 1908. Her parents divorced in 1916 and her mother took the family on a trip out West. While there they decided to settle down in the Los Angeles area. After being spotted playing baseball in the street with the neighborhood boys by a film director, Carole was signed to a one-picture contract in 1921 when she was 12. The film in question was A Perfect Crime (1921). Although she tried for other acting jobs, she would not be seen onscreen again for four years. She returned to a normal life, going to school and participating in athletics, excelling in track and field. By age 15 she had had enough of school, though, and quit. She joined a theater troupe and played in several stage shows, which were for the most part nothing to write home about. In 1925 she passed a screen test and was signed to a contract with Fox Films. Her first role as a Fox player was Hearts and Spurs (1925), in which she had the lead. Right after that film she appeared in a western called Durand of the Bad Lands (1925). She rounded out 1925 in the comedy Marriage in Transit (1925) (she also appeared in a number of two-reel shorts). In 1926 Carole was seriously injured in an automobile accident that resulted in the left side of her face being scarred. Once she had recovered, Fox canceled her contract. She did find work in a number of shorts during 1928 (13 of them, many for slapstick comedy director Mack Sennett), but did go back for a one-time shot with Fox called Me, Gangster (1928). By now the film industry was moving from the silent era to \"talkies\". While some stars' careers ended because of heavy accents, poor diction or a voice unsuitable to sound, Carole's light, breezy, sexy voice enabled her to transition smoothly during this period. Her first sound film was High Voltage (1929) at Pathe (her new studio) in 1929. In 1931 she was teamed with William Powell in Man of the World (1931). She and Powell hit it off and soon married, but the marriage didn't work out and they divorced in 1933. No Man of Her Own (1932) put Carole opposite Clark Gable for the first and only time (they married seven years later in 1939). By now she was with Paramount Pictures and was one of its top stars. However, it was Twentieth Century (1934) that showed her true comedic talents and proved to the world what a fine actress she really was. In 1936 Carole received her only Oscar nomination for Best Actress for My Man Godfrey (1936). She was superb as ditzy heiress Irene Bullock. Unfortunately, the coveted award went to Luise Rainer in The Great Ziegfeld (1936), which also won for Best Picture. Carole was now putting out about one film a year of her own choosing, because she wanted whatever role she picked to be a good one. She was adept at picking just the right part, which wasn't surprising as she was smart enough to see through the good-ol'-boy syndrome of the studio moguls. She commanded and received what was one of the top salaries in the business - at one time it was reported she was making $35,000 a week. She made but one film in 1941, Mr. & Mrs. Smith (1941). Her last film was in 1942, when she played Maria Tura opposite Jack Benny in To Be or Not to Be (1942). Tragically, she didn't live to see its release. The film was completed in 1941 just at the time the US entered World War II, and was subsequently held back for release until 1942. Meanwhile, Carole went home to Indiana for a war bond rally. On January 16, 1942, Carole, her mother, and 20 other people were flying back to California when the plane went down outside of Las Vegas, Nevada. All aboard perished. The highly acclaimed actress was dead at the age of 33 and few have been able to match her talents since.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg5NjI3MDA5Nl5BMl5BanBnXkFtZTcwMzY3OTQ4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001479","name":"Carole Lombard","nicknames":["The Profane Angel","The Hoosier Tornado","The Queen of Screwball Comedy"],"idIMDB":"nm0001479"},"actorId":"nm0001479","character":"Pauline","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roscoe Karns","urlProfile":"http://www.imdb.com/name/nm0439850","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTA1MDc3Ml5BMl5BanBnXkFtZTcwNTA5NTAzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1891","placeOfBirth":" San Bernardino, California, USA","height":"5' 10\" (1.78 m)","bio":"On stage since age 15, Roscoe Karns parlayed his machine-gun delivery and street-wise demeanor (although many thought of him as a New Yorker, he was actually from San Bernardino, California) into character roles in dozens of films from the 1920s to the 1960s. His peak period, though, was in the 1930s, where he often played a wisecracking cab driver or a brash newspaper reporter (as in His Girl Friday (1940), usually the friend of the hero who helps him solve the murder/catch the bad guys/find the missing heiress, etc.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTA1MDc3Ml5BMl5BanBnXkFtZTcwNTA5NTAzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0439850","name":"Roscoe Karns","idIMDB":"nm0439850"},"actorId":"nm0439850","character":"Bertram Shapiro","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Tucker","urlProfile":"http://www.imdb.com/name/nm0875983","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWYyZTIxMWMtNDI2NC00MzUxLWE0MjEtY2EyYjI5N2IyNzJmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1884","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"5' 11½\" (1.82 m)","bio":"Richard Tucker was born on June 4, 1884 in Brooklyn, New York City, New York, USA. He was an actor, known for Wings (1927), The Jazz Singer (1927) and The Bat Whispers (1930). He was married to Ruth Mitchell. He died on December 5, 1942 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWYyZTIxMWMtNDI2NC00MzUxLWE0MjEtY2EyYjI5N2IyNzJmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0875983","name":"Richard Tucker","idIMDB":"nm0875983"},"actorId":"nm0875983","character":"F. Carstair Reynolds","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Francis McDonald","urlProfile":"http://www.imdb.com/name/nm0567756","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjhiZGJjMTQtODcxOS00NjliLWI3ZWUtM2JlODYyZGE4MWY2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 August 1891","placeOfBirth":" Bowling Green, Kentucky, USA","birthName":"Francis James McDonald","height":"5' 9\" (1.75 m)","bio":"Francis J. McDonald - not a name to bring ready recognition-but a look at the face reminds one of many old movie roles indeed. His career as an actor literally spanned from early silent films and the great silver screen era of sound film to follow on through the golden age of television. His screen credits, noticeable and small, amount to an amazing nearly 350 roles. Starting on stage, he was a slight but handsome leading man who entered films in 1913 and continued lead and featured romantic roles from contemporary to costume adventure into the 1920s. It was during this period that he married - and divorced - actress Mae Busch, most familiar for the many Laurel and Hardy comedies she did. MacDonald worked on Broadway briefly in only two plays (mid-1918). By the time he did his first totally sound film (late silent movies had intervals of background or short dialog sound), Burning Up (1930), MacDonald had 83 films under his belt. But into the 1930s, being older, his roles were turning toward shady characters of second order - and increasingly uncredited. With dark hair and mustache and beady eyes with a prominent nose, MacDonald fit well into many an ethnic or sneaky villain role and continued in demand. He got to know Cecil B. DeMille and had a regular featured character role in his long history of films beginning with The Plainsman (1936). Still through the 1930s and 40s MacDonald averaged a steady five to ten films a year-dipping somewhat in the World War II years. Into the 1950s he was increasingly cast in one of his perennial staples, westerns, with roles already familiar to him: weaselly, tin horn gamblers, henchmen, but also dignified Indian chiefs. He was a natural to move into the incredibly popular western phenomenon that burst over the new medium of TV. He showed up in the spectrum of episodic oaters: from early Range Rider, Kit Carson, Wild Bill Hickok, and The Lone Ranger to later fare, such as, Have Gun-Will Travel, Wanted Dead or Alive, Wagon Train, the whole stable of Warner Bros. westerns at the end of the decade (Maverick, etc.), and The Virginian in the next. In the meanwhile there were some good character pieces in movies. Perhaps the most poignant being his last for DeMille's, The Ten Commandments (1956), where he had the small but showcase role as Simon, the old Jewish slave. Bedraggled and working in the clay pit - with Charlton Heston - he pleads for freedom for the Israelites - and gets a a trowel in the gut from a Egyptian guard for his trouble - dying heroically in Heston's arms - it is classic DeMille. And it was classic MacDonald - always ready to give a skillful and memorable performance.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjhiZGJjMTQtODcxOS00NjliLWI3ZWUtM2JlODYyZGE4MWY2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0567756","name":"Francis McDonald","idIMDB":"nm0567756"},"actorId":"nm0567756","character":"Phil Kemptom","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Raoul Paoli","urlProfile":"http://www.imdb.com/name/nm0660029","urlPhoto":"","biography":{"dateOfBirth":"24 November 1887","placeOfBirth":" Courtalain, Eure-et-Loir, France","height":"6' 1½\" (1.87 m)","bio":"Raoul Paoli was born on November 24, 1887 in Courtalain, Eure-et-Loir, France. He was an actor, known for La souriante Madame Beudet (1923), Gachucha, fille basque (1923) and Timide malgré lui (1930). He died on March 23, 1960 in Paris, France.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0660029","name":"Raoul Paoli","idIMDB":"nm0660029"},"actorId":"nm0660029","character":"Jules","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Virginia Bruce","urlProfile":"http://www.imdb.com/name/nm0115597","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDQyNjQ0M15BMl5BanBnXkFtZTYwMTYyNjU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1910","placeOfBirth":" Minneapolis, Minnesota, USA","birthName":"Helen Virginia Briggs","height":"5' 6\" (1.68 m)","bio":"American leading lady of the 1930s and 1940s, Virginia Bruce was born in Minnesota but grew up in Fargo, North Dakota, and came to California to attend college. Her blond good looks got her an entry into films, and after a few extra roles and bit parts she began to make serious inroads as a leading woman in secondary films and as the \"other\" woman in more prestigious productions. She married screen legend John Gilbert, then in his decline. Subsequently she was married to director J. Walter Ruben and to Turkish producer/director Ali Ipar, for whom she appeared in some Turkish films all but unseen in America. She died in 1982.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDQyNjQ0M15BMl5BanBnXkFtZTYwMTYyNjU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0115597","name":"Virginia Bruce","idIMDB":"nm0115597"},"actorId":"nm0115597","character":"Alma McGregor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Geneva Mitchell","urlProfile":"http://www.imdb.com/name/nm0593352","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDIzYmRiNTMtOTNkMy00MjliLTgwNDMtMjA3YjMwNWNlNThjL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 February 1908","placeOfBirth":" Medarysville, Indiana, USA","height":"5' 5\" (1.65 m)","bio":"Geneva Mitchell was born on February 3, 1908 in Medarysville, Indiana, USA. She was an actress, known for Morning Glory (1933), Restless Knights (1935) and Dance of the Paper Dolls (1929). She was married to Harry J Bryant. She died on March 10, 1949 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDIzYmRiNTMtOTNkMy00MjliLTgwNDMtMjA3YjMwNWNlNThjL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0593352","name":"Geneva Mitchell","idIMDB":"nm0593352"},"actorId":"nm0593352","character":"Cleo Carewe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Louise Beavers","urlProfile":"http://www.imdb.com/name/nm0064792","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmU1NmU1ZDEtMTYyYy00NzYzLWJhY2MtZWU1ODAwZmZiOTI2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 March 1902","placeOfBirth":" Cincinnati, Ohio, USA","height":"5' 4\" (1.63 m)","bio":"1930s and 1940s film actress Louise Beavers was merely one of a dominant gallery of plus-sized and plus-talented African-American character actresses forced to endure blatant, discouraging and demeaning stereotypes during Depression-era and WWII Hollywood. It wasn't until Louise's triumphant role in Fannie Hurst's classic soaper Imitation of Life (1934) that a film of major significance offered a black role of meaning, substance and humanity. Despite the fact that Louise was playing yet another of her endless servile roles as housekeeper Delilah who works for single white mother Claudette Colbert, this time around her character was three-dimensional and not merely a source of servitude and/or or comic relief. She had her own dramatic story and brilliantly handled the heartbreaking co-plot of an appeasing single parent whose light-skinned daughter (played by Fredi Washington) went to cruel and desperate lengths to pass for white. While Louise certainly championed in the role and managed to steal the lion's share of reviews right from under the film's superstar, the movie triggered major controversy and just as many complaints as compliments from both black and white viewers. This certainly did not help what could have been a major, positive shift in black filmmaking. Instead, for the next two or more decades Louise was again forced to retreat into secondary status with precious few opportunities to shine. Ms. Beavers was born in Cincinnati, Ohio, on March 8, 1902 and moved with her family to the Los Angeles area at age 11. A student at Pasadena High School and a choir member at her local church, her mother, a voice teacher, trained Louise for the concert stage but instead the young girl joined an all-female minstrel company called \"Lady Minstrels\" and even hooked up for a time on the vaudeville circuit. A nursing career once entertained was quickly aborted in favor of acting. Her first break of sorts was earning a living as a personal maid and assistant to Paramount star Leatrice Joy (and later actress Lilyan Tashman). By 1924 she was performing as an extra or walk-on in between her chores. A talent agent spotted her and gave her a more noticeable role in Uncle Tom's Cabin (1927). She went on to gain even more visibility, but was invariably stuck in the background cooking or cleaning after the leads. Despite this her beaming smile and good nature paid off. Following scene-grabbing maid roles to such stars as Mary Pickford in Coquette (1929) Linda Watkins in Good Sport (1931), Mae West in She Done Him Wrong (1933), Constance Bennett in What Price Hollywood? (1932) and Jean Harlow in Bombshell (1933), Louise received the role of her career. Her poignant storyline and final death scene deserved an Oscar nomination and many insiders took her snub as deliberate and prejudicial. Five years later her compatriot (and close friend) Hattie McDaniel would become the first black actor to not only earn an Oscar nomination but capture the coveted trophy as well for her subordinate role in Gone with the Wind (1939). Despite their individual triumphs, both ladies continued to trudge through more of the same, albeit steadily. Occasionally Louise was rewarded with such Hollywood \"A\" treats as Made for Each Other (1939) with Carole Lombard, Holiday Inn (1942) starring Bing Crosby, and especially Mr. Blandings Builds His Dream House (1948) with Cary Grant and Myrna Loy. In The Jackie Robinson Story (1950), she offered lovely moments as the baseball star's mother. Although film offers dried up in the 1950s, Louise managed to transfer her talents to the new TV medium, and was one of a number of character actresses hired to play the wise-cracking, problem-solving maid Beulah (1950) during its run. \"Beulah\" was one of the first sitcoms to star a black actor. She also had a recurring role in Disney's \"The Swamp Fox\". In 1957, she made her professional stage debut in San Francisco with the short-lived play \"Praise House\" as a caregiver who extols the Bible through song. Her last few films, which included The Goddess (1958), All the Fine Young Cannibals (1960) and the Bob Hope comedy The Facts of Life (1960) were typical stereotypes and unmemorable. A long time bachelor lady who finally married in the 1950s, the short and stout actress was plagued by health issues in later years, her obesity and diabetes in particular. She lost her fight on October 26, 1962, at age 60 following a heart attack. In 1976 she was posthumously inducted into the Black Filmmakers Hall of Fame.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmU1NmU1ZDEtMTYyYy00NzYzLWJhY2MtZWU1ODAwZmZiOTI2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0064792","name":"Louise Beavers","idIMDB":"nm0064792"},"actorId":"nm0064792","character":"Messalina","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0021327","urlIMDB":"http://www.imdb.com/title/tt0021327","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 20 min (80 min)"],"soundMix":["Mono (Western Electric Sound System)"],"color":["Black and White"],"aspectRatio":["1.20 : 1"],"camera":null,"laboratory":null,"filmLength":["2,156 m (10 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.9","filmingLocations":[{"location":"Paramount Studios - 5555 Melrose Avenue, Hollywood, Los Angeles, California, USA"}],"rated":"PASSED","awards":[],"votes":"62","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["tutor","new york city","millionaire","manhattan new york city","broadway manhattan new york city","roommate","uncle nephew relationship","song","whiskey","wealth","taxi","taxi driver","stock footage","speakeasy","slang","singing","singer","showgirl","show business","prohibition","police officer","nightclub","musician","maid","jazz age","inheritance","heir","education","duplicity","deception","deceit","dancing","dancer","cigarette smoking","archive footage","apartment","1920s","showbiz"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:30:12"}}