{"data":{"movies":[{"title":"Dr. Cook's Garden","originalTitle":"","year":"1971","releaseDate":"19710119","directors":[{"name":"Ted Post","id":"nm0692872"}],"writers":[{"name":"Ira Levin","id":"nm0505615"},{"name":"Art Wallace","id":"nm0908526"}],"runtime":"75 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDg0NzQyMjMtYTRiOC00OTQ5LWJmZmQtNzVhY2FjMWZlYzkzXkEyXkFqcGdeQXVyMzU0NzkwMDg@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Thriller"],"plot":"A young doctor returns to his New England home town after a long absence. He visits with the town's kindly old physician, Dr. Cook, a man he has admired since childhood. However, he soon finds out that the old doctor isn't quite what he seems to be, and the young doctor finds his life in danger.","simplePlot":"A young doctor returns to his New England home town after a long absence. He visits with the town's kindly old physician, Dr. Cook, a man he has admired since childhood. However, he soon ... ","actors":[{"actorName":"Bing Crosby","urlProfile":"http://www.imdb.com/name/nm0001078","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNTQwOTg0NF5BMl5BanBnXkFtZTcwMzU2ODAyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 May 1903","placeOfBirth":" Tacoma, Washington, USA","birthName":"Harry Lillis Crosby","height":"5' 7\" (1.7 m)","bio":"Bing Crosby was born Harry Lillis Crosby, Jr. in Tacoma, Washington, the fourth of seven children of Catherine Helen \"Kate\" (Harrigan) and Harry Lowe Crosby, a brewery bookkeeper. He was of English and Irish descent. Crosby studied law at Gonzaga University in Spokane but was more interested in playing the drums and singing with a local band. Bing and the band's piano player, Al Rinker, left Spokane for Los Angeles in 1925. In the early 1930s Bing's brother Everett sent a record of Bing singing \"I Surrender, Dear\" to the president of CBS. His live performances from New York were carried over the national radio network for 20 consecutive weeks in 1932. His radio success led Paramount Pictures to include him in The Big Broadcast (1932), a film featuring radio favorites. His songs about not needing a bundle of money to make life happy was the right message for the decade of the Great Depression. His relaxed, low-key style carried over into the series of \"Road\" comedies he made with pal Bob Hope. He won the best actor Oscar for playing an easygoing priest in Going My Way (1944). He showed that he was indeed an actor as well as a performer when he played an alcoholic actor down on his luck opposite Grace Kelly in The Country Girl (1954). Playing golf was what he liked to do best. He died at age 74 playing golf at a course outside Madrid, Spain, after completing a tour of England that had included a sold-out engagement at the London Palladium.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNTQwOTg0NF5BMl5BanBnXkFtZTcwMzU2ODAyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001078","name":"Bing Crosby","nicknames":["Der Bingle","The old groaner"],"idIMDB":"nm0001078"},"actorId":"nm0001078","character":"Dr. Leonard Cook","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Converse","urlProfile":"http://www.imdb.com/name/nm0176586","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmRhOGZlNWMtYTY4Yy00NzgwLTkxMzEtNjY5MzA2ZGEwYjM0L2ltYWdlXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 May 1938","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Frank Guthrie Converse","height":"6' 2\" (1.88 m)","bio":"A brawny, firm-jawed, sandy-haired player of 60s and 70s primetime TV, Frank Converse seemed to be one of those handsome tough-guy action figures that could go by the wayside after the demise of their famous series. Instead, this stage-trained actor persevered as a well-respected, all-purpose character actor in a career that has now passed its fourth decade. Born on May 2, 1938 in St. Louis, Missouri, Frank received his early education at the Phillips Andover Academy in Andover, Massachusetts, and earned his BFA degree in drama in 1962 at the Carnegie Institute of Technology in Pittsburgh. In the 1960s he built up his Shakespearean resume with roles in \"King Lear\", \"Caesar and Cleopatra\", \"Hamlet\", \"The Comedy of Errors\", \"Richard III\", \"Henry V\" and \"Much Ado About Nothing\" before making his 1966 Broadway debut in \"First One Asleep, Whistle\", which closed that same day. By this time he had set his sights on film but it was strong-armed TV drama that made him a name. 1967 was a banner year for Frank. Not only did he appear to good advantage in the films Hour of the Gun (1967) as Virgil Earp, and the Southern-baked melodrama Hurry Sundown (1967), he earned surprise stardom in his first TV vehicle Coronet Blue (1967). Probably best remembered for this short-lived series (filmed in 1965, but televised as a summer replacement series from May to September 1967), Converse played the very mysterious Michael Alden, who was roughed up and dumped unceremoniously into the New York harbor by would-be assassins. Left for dead and having lost his memory, the only key to his past are the code words \"Coronet Blue\". Although audiences never found out just what those words meant (the show ended abruptly and without a proper conclusion), they at least now knew the name Frank Converse. From there the actor ventured on (still in a New York City setting) with the police drama N.Y.P.D. (1967). He fared better this time around alongside co-stars Jack Warden and Robert Hooks as three plainclothes detectives tracking down the city's most virulent. This show lasted until 1969. His third and last major series co-starred burly trucker Claude Akins in the big-rig action-adventure Movin' On (1974). In all three series, Converse owned a quiet, reserved, somewhat detached quality that invited \"mystery man\" appeal. During this stage of his popularity he starred or co-starred in a number of mini-movies including Dr. Cook's Garden (1971) with Bing Crosby and Blythe Danner, A Tattered Web (1971), Great Performances: The Widowing of Mrs. Holroyd (1974), Killer on Board (1977), Cruise Into Terror (1978) and, most notably, Sergeant Matlovich vs. the U.S. Air Force (1978). He also guested on such popular 70s shows as \"The Mod Squad\", \"Medical Center\", \"Police Story\", \"Rhoda\" \"The Love Boat\", \"Baa Baa Black Sheep\" and \"The Bionic Woman\". Despite his hectic TV schedule, he continued to return to his theater roots appearing in the original cast of John Guares bizarre black comedy \"The House of Blue Leaves\" (1971) and earning challenging parts in \"The Seagull\" in 1973 and \"Hobson's Choice\" in 1977. Having achieved semi-hunk status as a result of his trio of series work, Frank could have easily drifted away by decade's end. Instead he continued to impressed on the stage. In the 1980s he made a strong return to Broadway opposite Blythe Danner in \"The Philadelphia Story\" (1980) and later appeared as Mitch opposite Danner's Blanche DuBois in \"A Streetcar Named Desire\" (1988). Other 80s Broadway shows included \"Brothers (1983) and \"Design for Living\" (1984), the latter in which he replaced actor Frank Langella. Other productions around the country included that of \"The Crucible\", \"Death of a Salesman\", \"A Man for All Seasons\", \"Misalliance\", \"The Shadow Box\", \"Two for the Seesaw\" and even the musical \"South Pacific\". On the TV/film front, Frank showed up in stalwart character form on a number of daytime soaps during the 1980s (\"One Life to Live\") and the 1990s (\"As the World Turns\", \"All My Children\"). A return to series TV with The Family Tree (1983) and Dolphin Cove (1989) were again very short-lived. More recently he showed up on stage as Doc Gibb in \"Our Town\", which starred Paul Newman and was later televised, and has been a guest star on such shows as \"Law & Order\". He has been married to his third wife, Tony-nominated stage actress Maureen Anderman, since 1982. They have two children along with his two children from a previous marriage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmRhOGZlNWMtYTY4Yy00NzgwLTkxMzEtNjY5MzA2ZGEwYjM0L2ltYWdlXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0176586","name":"Frank Converse","idIMDB":"nm0176586"},"actorId":"nm0176586","character":"Jimmy Tennyson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Blythe Danner","urlProfile":"http://www.imdb.com/name/nm0001100","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMDkzNTAyODdeQTJeQWpwZ15BbWU3MDY5ODEzMjQ@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 February 1943","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Blythe Katharine Danner","height":"5' 7\" (1.7 m)","bio":"Blythe Danner was born in Philadelphia, Pennsylvania, to Katharine (Kile) and Harry Earl Danner, a bank executive. She has German, as well as English and Irish, ancestry. Danner studied acting and got her degree from Bard College and began her career in Boston theater companies. By 25, she won the Theater World Award for her work in Molière's \"The Miser\", at Lincoln Center. She also won the 1970 Tony award for her role in \"Butterflies Are Free\". She made her film premiere in the same year in the television production of Dr. Cook's Garden (1971). For 25 years, she has been a regular performer at the Williamstown Summer Theater Festival. She has also been nominated for Tonys for performances in \"A Streetcar Named Desire\" and \"Betrayal\". Married to director Bruce Paltrow, she is the mother of two acting children, Gwyneth Paltrow and Jake Paltrow.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMDkzNTAyODdeQTJeQWpwZ15BbWU3MDY5ODEzMjQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001100","name":"Blythe Danner","nicknames":["Lalo"],"idIMDB":"nm0001100"},"actorId":"nm0001100","character":"Janey Rausch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thomas Barbour","urlProfile":"http://www.imdb.com/name/nm0053856","urlPhoto":"","biography":{"dateOfBirth":"25 July 1921","placeOfBirth":" New York City, New York, USA","bio":"Thomas Barbour was born on July 25, 1921 in New York City, New York, USA. He was an actor, known for Arthur (1981), Girlfight (2000) and The Age of Innocence (1993). He died on December 29, 2005 in New York City.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0053856","name":"Thomas Barbour","idIMDB":"nm0053856"},"actorId":"nm0053856","character":"The Reverend","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fred Burrell","urlProfile":"http://www.imdb.com/name/nm0123062","urlPhoto":"","biography":{"dateOfBirth":"18 September 1936","placeOfBirth":" Cedar Rapids, Iowa, USA","bio":"Fred Burrell was born on September 18, 1936 in Cedar Rapids, Iowa, USA. He is an actor, known for We Own the Night (2007), Klute (1971) and Kinsey (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0123062","name":"Fred Burrell","idIMDB":"nm0123062"},"actorId":"nm0123062","character":"Harry Bullitt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Staats Cotsworth","urlProfile":"http://www.imdb.com/name/nm0182901","urlPhoto":"","biography":{"dateOfBirth":"17 February 1908","placeOfBirth":" Oak Park, Illinois, USA","birthName":"Staats Jennings Cotsworth Jr.","bio":"Staats Cotsworth was born on February 17, 1908 in Oak Park, Illinois, USA as Staats Jennings Cotsworth Jr. He was an actor, known for As the World Turns (1956), Peyton Place (1957) and The Edge of Night (1956). He was married to Josephine Hutchinson and Muriel Kirkland. He died on April 9, 1979 in New York City, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0182901","name":"Staats Cotsworth","idIMDB":"nm0182901"},"actorId":"nm0182901","character":"Ted Rausch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barnard Hughes","urlProfile":"http://www.imdb.com/name/nm0400464","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTI3MTUzNjg3NV5BMl5BanBnXkFtZTcwNDE2NDAxMw@@._V1_UY44_CR19,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1915","placeOfBirth":" Bedford Hills, New York, USA","birthName":"Barnard Aloysius Kiernan Hughes","bio":"Emmy and Tony Award-winner Barnard Hughes forged a career as one of American's most successful character actors, equally at home and successful on stage, the silver screen, and television. Most of his success came after middle-age. He made his Broadway debut in 1939 in Mary McCarthy's \"Please, Mrs. Garibaldi\", a flop that lasted only four performances. He appeared in another 22 Broadway shows, his last being Noël Coward's \"Waiting in the Wings, which closed in the year 2000. His Broadway career lasted spanned 61 years and eight decades. Along the way, he won the 1978 Tony Award as best Actor in a play for Da (1988), his most famous role, which also brought him the Drama Desk Award as Outstanding Actor in a Play. (He won a lifetime achievement Drama Desk Award in 2000.) He also was nominated for a Tony Award for Best Featured Actor in a Play in 1973 for Much Ado About Nothing (1973), which was fitting, as it was in Shakespeare repertory that he honed his craft. Hughes was born Bernard Aloysius Kiernan Hughes on July 16, 1915, in Bedford Hills, New York, to Irish immigrants Marcella \"Madge\" (Kiernan) and Owen Hughes. Bedford Hills is a hamlet lying 41 miles north of the heart of Broadway in Times Square (He changed the spelling of his Christian name on the advice of a numerologist; thespians are very superstitious). After graduating from the La Salle Academy and attending Manhattan College, he joined New York City's Shakespeare Fellowship Repertory Co. He was a member of the company for two years. He did not actually appear on Broadway in Shakespeare until 1964, when he played Marcellus to Richard Burton's Hamlet (1964). Off-Broadway, he played Polonius to Stacy Keach's Obie Award-winning Hamlet in 1972. His only other Shakespearean turn on the boards of the Great White Way was as Dogberry in \"Much Ado About Nothing\" in the 1972-73 season, which brought him his first Tony nomination. Off-Broadway, he also appeared as the Chorus in \"Pericles, Prince of Tyre\" and Sir John Falstaff in \"The Merry Wives of Windsor\". Back on Broadway, his most prominent role other than \"Da\" (which he also played in the roadshow tour) was as the Old Man opposite Alec Baldwin in Prelude to a Kiss (1992). Hughes had a 54 year-long screen career, equally adept in television as in movies. He was a regular on the soap opera Guiding Light (1952) from 1961-66. Though Hughes was a highly effective dramatic actor, he had a flair for comedy and appeared on such sit-coms as _\"The Phil Silvers Show\" (TV series) and _\"Car 54, Where Are You?\" (1962)_ before having recurring roles on \"All In the Family\" (1971) as a priest and on The Bob Newhart Show (1972) as Bob's father in the 1970s. He eventually headlined his own sit-com in the mid '70s, Doc (1975), which had a successful first season but was canceled early into its second after the network demanded changes to boost ratings. Instead, the ratings sank. His break-through performance in the movies arguably was a the messianic doctor who was a victim of malpractice and turned avenger in Paddy Chayefsky's The Hospital (1971) in 1971. It came two years after a small but memorable part in Best Picture Oscar winner Midnight Cowboy (1969), as he middle-aged gay mamma's boy who picks up self-styled \"hustler\" Joe Buck with disastrous consequences. Hughes married actress Helen Stenborg in 1950 and they remained married until his death on July 11, 2006, five days before what would have been his 91st birthday. The couple had two children, theatrical director Doug Hughes (who was also a Tony-winner) and a daughter, actress Laura Hughes.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTI3MTUzNjg3NV5BMl5BanBnXkFtZTcwNDE2NDAxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0400464","name":"Barnard Hughes","idIMDB":"nm0400464"},"actorId":"nm0400464","character":"Elias Hart","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bethel Leslie","urlProfile":"http://www.imdb.com/name/nm0504064","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MDI4MTc2M15BMl5BanBnXkFtZTcwMjU4MzYxOA@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 August 1929","placeOfBirth":" New York City, New York, USA","birthName":"Jane Bethel Leslie","bio":"The daughter of a well-to-do attorney and a socialite, Bethel Leslie was born on August 3, 1929, in New York City. Ms. Leslie was a 15-year-old student at the Brearley School on the Upper East Side when she was discovered by the legendary producer George Abbott, for the Broadway play \"Snafu\" in 1944. She quickly became a theatre mainstay with such plays as \"The Dancer\" (1946), \"How I Wonder\" (1947), \"Goodbye, My Fancy\" (1948), \"Pygmalion\" (1952) and \"The Time of the Cuckoo\" (1952) under her belt. In later years she gave stunning theater performances in \"Inherit the Wind\" (1955), \"Career\" (1957), and \"Catch Me If You Can\" (1965), then capped her formidable career with a Tony nomination as the drug-addicted mother \"Mary Tyrone\" in \"Long Day's Journey Into Night\" in 1986 opposite Jack Lemmon, Kevin Spacey and Peter Gallagher, which was subsequently televised. While not as well known for her movie work, the seriously attractive actress was best utilized as a brittle support player in such films as The Rabbit Trap (1959) and Captain Newman, M.D. (1963). Sporadic filming later included A Rage to Live (1965), The Molly Maguires (1970), Old Boyfriends (1979), Ironweed (1987), and Message in a Bottle (1999). On TV as a teen, her first series was playing Cornelia Otis Skinner in The Girls (1950), in 1950. Throughout the 50s, she appeared in scores of dramatic parts on episodic TV and became one of those faces without a name, playing with great relish a neurotic victim or cruel-eyed villainess. TV soaps took up Bethel's later years, appearing in The Doctors (1963), All My Children (1970) and One Life to Live (1968) at various times. At one point, she was a head writer for The Secret Storm (1954). Bethel died of cancer at age 70 and was survived by daughter Leslie.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MDI4MTc2M15BMl5BanBnXkFtZTcwMjU4MzYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0504064","name":"Bethel Leslie","idIMDB":"nm0504064"},"actorId":"nm0504064","character":"Essie Bullitt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Abby Lewis","urlProfile":"http://www.imdb.com/name/nm0506885","urlPhoto":"","biography":{"dateOfBirth":"14 November 1910","placeOfBirth":" Mesilla Park, New Mexico, USA","birthName":"Camelia Albon Lewis","bio":"Abby Lewis was born on November 14, 1910 in Mesilla Park, New Mexico, USA as Camelia Albon Lewis. She was an actress, known for Another World (1964), As the World Turns (1956) and Somerset (1970). She was married to John Seymour. She died on November 27, 1997 in New York City, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0506885","name":"Abby Lewis","idIMDB":"nm0506885"},"actorId":"nm0506885","character":"Dora Ludlow","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carol Morley","urlProfile":"http://www.imdb.com/name/nm0605866","urlPhoto":"","biography":{"bio":"Carol Morley was born in Ontario, Canada. She is an actress, known for The Godfather (1972), Dr. Cook's Garden (1971) and The Jimmy Logan Show (1957).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0605866","name":"Carol Morley","idIMDB":"nm0605866"},"actorId":"nm0605866","character":"Mary Booth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jordan Reed","urlProfile":"http://www.imdb.com/name/nm0715498","urlPhoto":"","biography":{"bio":"Jordan Reed is an actor, known for The Delicious (2003), For My Daughter's Honor (1996) and Dr. Cook's Garden (1971).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0715498","name":"Jordan Reed","idIMDB":"nm0715498"},"actorId":"nm0715498","character":"Billy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Helen Stenborg","urlProfile":"http://www.imdb.com/name/nm0826523","urlPhoto":"","biography":{"dateOfBirth":"24 January 1925","placeOfBirth":" Minneapolis, Minnesota, USA","birthName":"Helen Joan Stenborg","bio":"Helen Stenborg was born on January 24, 1925 in Minneapolis, Minnesota, USA as Helen Joan Stenborg. She was an actress, known for One Life to Live (1968), Another World (1964) and Enchanted (2007). She was married to Barnard Hughes. She died on March 22, 2011 in Manhattan, New York City, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0826523","name":"Helen Stenborg","idIMDB":"nm0826523"},"actorId":"nm0826523","character":"Ruth Hart","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0065657","urlIMDB":"http://www.imdb.com/title/tt0065657","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 15 min (75 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.5","filmingLocations":[{"location":"Vermont, USA"}],"awards":[{"award":"Edgar Allan Poe Awards 1972","titlesAwards":[{"titleAwardOutcome":"Nominated Edgar","categories":[{"category":"Best Television Feature or Miniseries","names":[{"name":"Art Wallace","id":"nm0908526","role":null}]}]}]}],"votes":"130","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0053559","name":"Paramount Television"}],"keywords":{"keywords":["doctor","euthanasia","murder","based on play","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 00:52:29"}}