{"data":{"movies":[{"title":"Tiger on Beat","originalTitle":"Lo foo chut gang","year":"1988","releaseDate":"19880319","directors":[{"name":"Chia-Liang Liu","id":"nm0514906"}],"writers":[{"name":"Kwok Chi Tsang","id":"nm0874688"}],"runtime":"88 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NDAwNTEyMV5BMl5BanBnXkFtZTcwMDgxOTQyMQ@@._V1.jpg","countries":["Hong Kong"],"languages":["Cantonese","Hakka"],"genres":["Action","Comedy","Crime","Drama","Thriller"],"plot":"A seasoned cop and his rookie partner are a pair of mismatched partners in this Hong Kong action-comedy in the style of 'Lethal Weapon'. The wacky twosome are up in arms as they try to solve the murder of a heroin trafficker.","simplePlot":"A seasoned cop and his rookie partner are a pair of mismatched partners in this Hong Kong action-comedy in the style of 'Lethal Weapon'. The wacky twosome are up in arms as they try to solve the murder of a heroin trafficker.","actors":[{"actorName":"Yun-Fat Chow","urlProfile":"http://www.imdb.com/name/nm0000334","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1ODkzMDU4MF5BMl5BanBnXkFtZTYwODk0MzY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 May 1955","placeOfBirth":" Lamma Island, Hong Kong","birthName":"Chow Yun Fat","height":"6' 1\" (1.86 m)","bio":"Chow Yun Fat is a charismatic, athletically built and energetic Asian-born film star who first came to the attention of western audiences via his roles in the high-octane/blazing guns action films of maverick HK director John Woo. Chow was born in 1955 on the quiet island of Lamma, part of the then-British colony of Hong Kong, near its famous Victoria Harbour. His mother was a vegetable farmer and cleaning lady, and his father worked on a Shell Oil Company tanker. Chow's family moved to urban Hong Kong in 1965 and in early 1973, Chow attended a casting call for TVB, a division of Shaw Bros. productions. With his good looks and easy-going style, Chow was originally a heartthrob actor in non-demanding TV and film roles. However, his popularity increased with his appearance as white-suited gangster Hui Man-Keung in the highly popular drama TV series Shang Hai tan (1983). In 1985, Chow started receiving acclaim for his work and scored the Golden Horse (Best Actor) Award in Taiwan and another Best Actor Award from the Asian Pacific Film Festival for his performance in Hong Kong 1941 (1984). With these accolades, Chow came to the attention of Woo, who cast Chow in the fast-paced gangster film A Better Tomorrow (1986) (aka \"A Better Tomorrow\"). The rest, as they say, is history. The film was an enormous commercial success, and Chow's influence on young Asian males was not dissimilar to the adulation given to previous Asian film sensations such as Bruce Lee or Jackie Chan. Nearly every young guy in Hong Kong ran out and bought himself a \"Mark Coat,\" as they became known--a long, heavy woolen coat worn by Chow in the movie (although it is is actually very unsuited to Hong Kong's hot and humid climate). Further hard-edged roles in more John Woo crime films escalated Chow's popularity even higher, and fans all over the world flocked to see A Better Tomorrow II (1987) (aka \"A Better Tomorrow 2\"), The Killer (1989) (aka \"The Killer\"), and Hard Boiled (1992) (aka \"Hard Boiled\"). With the phenomenal global interest in the HK action genre, Chow was enticed to the United States and appeared in The Replacement Killers (1998) with Mira Sorvino, The Corruptor (1999) with Mark Wahlberg, and, for a change of pace, in the often-filmed romantic tale of Anna and the King (1999). Chow then returned to the Asian cinema circuit and starred in the critically lauded kung fu epic Crouching Tiger, Hidden Dragon (2000) (aka \"Crouching Tiger, Hidden Dragon\"). His wide appeal can be seen in his \"boy next door\" type of personality and his ability to play such a broad spectrum of roles from a comedic buffoon to a lovestruck Romeo to a trigger-happy professional killer. A highly entertaining and gifted actor with dynamic on-screen presence, Chow continues to remain in strong demand in many film markets.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1ODkzMDU4MF5BMl5BanBnXkFtZTYwODk0MzY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000334","name":"Yun-Fat Chow","nicknames":["Faat Tsai","Faat \"Gor\""],"idIMDB":"nm0000334"},"actorId":"nm0000334","character":"Sgt. Francis Li","urlCharacter":"http://www.imdb.com/character/ch0029112","main":true},{"actorName":"Nina Li Chi","urlProfile":"http://www.imdb.com/name/nm0508327","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDEzMDllOTEtYWUyMC00NTZlLWEzNzUtMjkzNDVjMTUzMjFhL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1961","placeOfBirth":" Shanghai, China","height":"5' 5\" (1.65 m)","bio":"Nina Li was one of the most distinguished Chinese leading ladies in late 80s and early 90s, and was renowned for her ravishing sex appeal which earned her the reputation of being \"Marilyn of the East\". She was born as Li Chi (Li Zhi) on the last day of 1961 in Shanghai. During her childhood, she was greatly influenced by her father, who had taught in the actor studios in Shanghai and Canton and can be considered the Lee Strasberg of China. In 1981, she followed her father to Hong Kong. At first, she worked in a furniture store but later on she went abroad to study in the United States, majoring in economics and business. Her breakthrough came when she came back to Hong Kong in 1986 and joined the Miss Asia contest. She was elected the Champion. However, people sneered at her at first, regarding her beauty as \"tasteless\" and, because she spoke Cantonese with her Shanghai accent, they hissed at her. However, with the help of tycoons like Jackie Chan and Raymond, she was soon recognized by filmmakers as the most hardworking in the city. Within 2 years, she became the fifth highest paid actress in Hong Kong. During her fairly short career (1987-1992), she has collaborated with stars like Jackie Chan, Yun-Fat Chow, Samuel Hui and Sammo Kam-Bo Hung. In 1992, she retired and became an investor in mainland China. Her business collapsed in 1996 and she retired to private life. She was later married to Jet Li, who was a martial arts master from China and was catapulted to international stardom soon after with Mel Gibson in Lethal Weapon 4 (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDEzMDllOTEtYWUyMC00NTZlLWEzNzUtMjkzNDVjMTUzMjFhL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0508327","name":"Nina Li Chi","nicknames":["Li T'si Feng","Li Mei Ren which means \"Li the beauty\""],"idIMDB":"nm0508327"},"actorId":"nm0508327","character":"Marydonna","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Conan Lee","urlProfile":"http://www.imdb.com/name/nm0497056","urlPhoto":"","biography":{"dateOfBirth":"1959","placeOfBirth":" Hong Kong","birthName":"Lloyd Hutchinson","bio":"Conan Lee was born in 1959 in Hong Kong as Lloyd Hutchinson. He is known for his work on Mulan (1998), Lethal Weapon 4 (1998) and Ninja in the Dragon's Den (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0497056","name":"Conan Lee","idIMDB":"nm0497056"},"actorId":"nm0497056","character":"CID Officer Michael Tso","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Norman Chu","urlProfile":"http://www.imdb.com/name/nm0160865","urlPhoto":"","biography":{"dateOfBirth":"6 May 1955","placeOfBirth":" Hong Kong","bio":"Norman Chu was born on May 6, 1955 in Hong Kong. He is an actor and director, known for Duel to Death (1983), The 36th Chamber of Shaolin (1978) and King of Beggars (1992).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0160865","name":"Norman Chu","idIMDB":"nm0160865"},"actorId":"nm0160865","character":"Poison Snake Ping","urlCharacter":"http://www.imdb.com/character/ch0234633","main":true},{"actorName":"Chia-Hui Liu","urlProfile":"http://www.imdb.com/name/nm0514904","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM0NzY3MDg5MF5BMl5BanBnXkFtZTcwNjkxNzAyMg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 August 1951","placeOfBirth":" Guangdong, China","birthName":"Jin-Hsi Shin","height":"5' 9\" (1.75 m)","bio":"Chia-Hui Liu was born on August 22, 1951 in Guangdong, China as Jin-Hsi Shin. He is known for his work on Kill Bill: Vol. 1 (2003), Kill Bill: Vol. 2 (2004) and The 36th Chamber of Shaolin (1978).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM0NzY3MDg5MF5BMl5BanBnXkFtZTcwNjkxNzAyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0514904","name":"Chia-Hui Liu","nicknames":["Master Killer","Gordon Liu"],"idIMDB":"nm0514904"},"actorId":"nm0514904","character":"Fai, the Hitman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shirley Ng","urlProfile":"http://www.imdb.com/name/nm0628840","urlPhoto":"","biography":{"bio":"Shirley Ng is an actress, known for Tiger on Beat (1988), Diao Chan (1987) and The Seventh Curse (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0628840","name":"Shirley Ng","idIMDB":"nm0628840"},"actorId":"nm0628840","character":"Mimi Li, Francis' sister","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Phillip Ko","urlProfile":"http://www.imdb.com/name/nm0438071","urlPhoto":"","biography":{"dateOfBirth":"18 June 1949","placeOfBirth":" Hong Kong, British Crown Colony","birthName":"Phillip Ko Fei","bio":"Phillip Ko was born on June 18, 1949 in Hong Kong, British Crown Colony as Phillip Ko Fei. He was an actor and director, known for Mo (1983), A Killer's Romance (1990) and Mu zhong wu ren (1989). He was married to Madie and Yukari Ôshima. He died on March 30, 2017 in Hong Kong, China.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0438071","name":"Phillip Ko","idIMDB":"nm0438071"},"actorId":"nm0438071","character":"Heroin dealer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tommy Tam","urlProfile":"http://www.imdb.com/name/nm0848389","urlPhoto":"","biography":{"bio":"Tommy Tam is an actor, known for Tiger on Beat (1988), Gaston en Leo in Hong Kong (1988) and Around the World in 80 Days (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0848389","name":"Tommy Tam","idIMDB":"nm0848389"},"actorId":"nm0848389","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Chiang","urlProfile":"http://www.imdb.com/name/nm0156955","urlPhoto":"","biography":{"dateOfBirth":"29 June 1947","placeOfBirth":" Suzhou, Jiangsu, China","birthName":"Wei-Nien Chiang","height":"5' 9\" (1.75 m)","bio":"David Chiang was born in Suzhou, China on June 29, 1947. His mother Hung Wei and father Yim Dut were very popular movie stars. Young David began his acting career at a very early age, appearing in black & white films while he was only 4 years old. \"John\" is David's real English name, while \"David\" was a stage name given to him by Director Chang Cheh. In 1966, while working as a Stuntman and Fight Instructor for the acclaimed Shaw Brothers Studio, he was spotted by Director Chang Cheh. The Director immediately saw potential & screen presence in the young actor & took David under his wing, slowly grooming him. The pair got along like father & son. With Wang Yu's sudden departure in 1969, Run Run Shaw and his senior executives were searching for their next leading man to take the reins to satisfy the frenzy left from the departed Wang Yu. The movie impresario made David an offer he could not refuse. With the guidance of Director Chang Cheh, David won \"The Best Actor\" Award at the 16th Asian Film Festival in 1970 for his role in \"Vengeance!\". In 1972, at the 18th Asian film Festival, David was awarded \"The Best Actor\" for his role in \"Blood Brothers\" & \"The Most Contemporary\" Award in 1973 at the 19th Asian Film Festival for \"The Generation Gap\". David left Hong Kong with his mentor Chang Cheh and set up an Independent Production Company in 1973 known as Chang's Scope Company. With the backing & blessings of Run Run Shaw, their films continued to be distributed through an enormous Shaw circuit. There, David was able to try his hand at directing, producing and script writing. As the 70s came to an end and the 80s approached, David continued to work his magic on the silver screen working with Directors Lee Han Chiang, Hsueh Li Pao, Ho Meng-hua and Chia-Liang Liu. 1980 was also the start of his first TV series \"The Green Dragon Conspiracy\", followed by \"Princess Chang Ping\" and \"Dynasty\" which are all classics. In the mid 80s, David worked alongside his two brothers, Paul Chun & Derek Yee, directing, producing and acting in the comedy \"Legend of the Owl\". David's talents in comedy also was showcased in the movies \"The Challenger\" and \"The Loot\" directed by Eric Tseng . In late 80s into the 90s David successfully directed movies: \"Heaven Can Help\", \"Silent Love\", \"The Wrong Couples\", \"Mr. Handsome\", \"Double Fattiness\", \"My Dear Son\", \"Will of Iron\" and \"Mother of a Different Kind\" . In 1991, David and his family emigrated from Hong Kong to Vancouver, Canada, returning to Hong Kong to make one or two TV series each year. As 2000 approached, David has continued to work in movies & TV series. He was nominated for \"Best Supporting Actor\" in 2006 for his role in \"Revolving Doors of Vengeance\". With over 4 decades under his belt, David is indeed an icon and a legend and is well regarded as one of Kung Fu's top action heroes.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0156955","name":"David Chiang","idIMDB":"nm0156955"},"actorId":"nm0156955","character":"Police Suprintendant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Wong","urlProfile":"http://www.imdb.com/name/nm0399074","urlPhoto":"","biography":{"dateOfBirth":"16 February 1940","placeOfBirth":" Canton, China","bio":"James Wong was born on February 16, 1940 in Canton, China. He was an actor, known for The Killer (1989), Iron Monkey (1993) and Lady in the Water (2006). He died on November 24, 2004 in Hong Kong, China.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0399074","name":"James Wong","idIMDB":"nm0399074"},"actorId":"nm0399074","character":"Police Inspector Jim Pak","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lydia Shum","urlProfile":"http://www.imdb.com/name/nm0838503","urlPhoto":"","biography":{"dateOfBirth":"21 July 1945","placeOfBirth":" Shanghai, China","bio":"With her signature wing-tip frame coke bottle glasses and imposing coif, 'Zaftig' TV-movie comedienne and celebrity personality Lydia Shum also known as 'Ah-Fay' to her fans stands out as one of the most recognizable and endearing entertainment icons in Hong Kong society whose celebrity ubiquity has spanned nearly 5 decades since she began her career in the early 60s as a teenage contract actress with Shaw Brothers studios. Like many within the minority Shanghai expatriate community residing in Hong Kong during the days of the crown colony, Lydia's versatility landed her supporting roles throughout her vast public career in both Cantonese and Mandarin dialect film and television often times playing pillow-talk girlfriends, classmates, sidekicks, siblings, handmaidens, chorus girls, bridesmaids and of course visual comic foil for literally the entire cavalcade of Hong Kong's Golden Age leading ladies including Connie Chan, Li Hua Li, Bo-Bo Fung, Heung Kam Lee, Lily Ho, Meg Lam, Lin Lin Li, Josephine Siao, Nancy Sit, Ming-Chuen Wang and Tina Ti before later graduating to TV award/variety show MCs and serials roles while still maintaining her staple of mostly big-screen Cantonese parts playing nosy landladies, pampered heiresses, neurotic matrons and doting mothers alongside Carol 'Do Do' Cheng, Maggie Cheung, Sylvia Chang Vivian Chow, Sharla Cheung, Cora Miao Sandra Kwan Yue Ng, Teresa Mo, Anita Mui and Anita Yuen (not to mention Lydia being their fourth wind slot for their Mahjong games after work) during the high-profile commercial success of the Hong Kong New Wave output through the 1990s. The history of celebrity girl power in the Hong Kong entertainment scene would not be complete without the mention of Lydia Shum.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0838503","name":"Lydia Shum","nicknames":["Fei-Fei","Ah-Fay"],"idIMDB":"nm0838503"},"actorId":"nm0838503","character":"Department store staff","urlCharacter":"http://www.imdb.com/character/ch0234829","main":true},{"actorName":"Joseph Bryan Baker","urlProfile":"http://www.imdb.com/name/nm3046960","urlPhoto":"","biography":{"bio":"Joseph Bryan Baker (also known as Joe Bryan Baker, or JB Baker), is from Austin, Texas, where he secured a black belt in Taekwondo at the age of 18, from Chief Instructor Michael Uselton of the Texas Taekwondo Karate Institute. He graduated from the University of Texas at Austin in 1985, with a BA in Asian Studies and a concentration (equivalent to a 2nd major) in International Studies. For his BA, his language of study was Mandarin Chinese. J.B. also speaks conversational Japanese and Khmer. In addition to acting, he is a budding video & music producer -- as well as an avid songwriter, singer and guitar-player. He resides in Austin, Texas, but frequently travels on a whim, or on business.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3046960","name":"Joseph Bryan Baker","idIMDB":"nm3046960"},"actorId":"nm3046960","character":"Boss","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chi-Shing Chan","urlProfile":"http://www.imdb.com/name/nm3288001","urlPhoto":"","biography":{"bio":"Chi-Shing Chan is an actor and assistant director, known for City on Fire (1987), The God of Cookery (1996) and Shanghai Express (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3288001","name":"Chi-Shing Chan","idIMDB":"nm3288001"},"actorId":"nm3288001","character":"Shing","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chia Yung Liu","urlProfile":"http://www.imdb.com/name/nm0514905","urlPhoto":"","biography":{"bio":"Chia Yung Liu is known for his work on The 36th Chamber of Shaolin (1978), Legendary Weapons of China (1982) and Master of the Flying Guillotine (1976).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0514905","name":"Chia Yung Liu","idIMDB":"nm0514905"},"actorId":"nm0514905","character":"Sour Puss","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fui-On Shing","urlProfile":"http://www.imdb.com/name/nm0793008","urlPhoto":"","biography":{"dateOfBirth":"1 February 1955","placeOfBirth":" Hong Kong [now Hong Kong, China]","height":"6' 2\" (1.88 m)","bio":"Fui-On Shing was born on February 1, 1955 in Hong Kong. He was an actor, known for The Crazy Companies (1988). He died on August 27, 2009 in Hong Kong, China.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0793008","name":"Fui-On Shing","nicknames":["Big Dumber"],"idIMDB":"nm0793008"},"actorId":"nm0793008","character":"Dummy","urlCharacter":"http://www.imdb.com/character/ch0234818","main":true}],"seasons":[],"idIMDB":"tt0095491","urlIMDB":"http://www.imdb.com/title/tt0095491","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 28 min (88 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Mandarin Laboratory (International) Ltd., Hong Kong"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm (spherical)"]},"rating":"7.0","filmingLocations":[],"rated":"TV-MA","awards":[{"award":"Hong Kong Film Awards 1989","titlesAwards":[{"titleAwardOutcome":"Nominated Hong Kong Film Award","categories":[{"category":"Best Action Choreography","names":[]}]}]}],"votes":"1,222","type":"Movie","companyCreditsSimple":[{"idCompany":"co0323902","name":"Cinema City"}],"keywords":{"keywords":["hong kong","slow motion scene","bullet ballet","impostor","police partner","armed robbery","dripping blood","car crash","loss of wife","police brutality","pistol","warehouse","police station","murder attempt","shootout","hit with a car door","violence against women","taxi driver","blood","arm blown off","torture","cocaine","prostitute","body count","throat slitting","firecracker","limb shot off","black comedy","handcuffs","gunshot wound","infidelity","triad","violent cop","beaten to death","cruel boss","kung fu","violence","shot point blank","severed finger","fingers shot off","bare chested male","hostage","ambush","shot through a door","bar fight","workout","chase","stomach ripped open","dumb police","vigilantism","shot in the side","martial arts","police violence","buddy cop","drugs","blood splatter","submachine gun","shot in the back","immortality","gore","shot to death","arms deal","shot in the leg","slashing","shot in the stomach","shot in the head","shot in the chest","machete","bayonet","shotgun","urinating in fear","chainsaw fight","chainsaw"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:25:31"}}