{"data":{"movies":[{"title":"The Adjutant of the Czar","originalTitle":"Der Adjutant des Zaren","year":"1929","releaseDate":"19290117","directors":[{"name":"Vladimir Strizhevsky","id":"nm0834496"}],"writers":[{"name":"Vladimir Strizhevsky","id":"nm0834496"}],"runtime":"91 min","countries":["Germany"],"languages":[],"genres":[],"simplePlot":"","actors":[{"actorName":"Ivan Mozzhukhin","urlProfile":"http://www.imdb.com/name/nm0610620","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxOTU2MzU4N15BMl5BanBnXkFtZTgwODgzODE1MzE@._V1._CR105,142,544,731_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 September 1889","placeOfBirth":" Penza, Russian Empire [now Russia]","birthName":"Ivan Ilyitch Mozzhukhin","bio":"Ivan Mozzhukhin was a legendary actor of Russian silent films, who escaped execution by the Soviet Red Army and had a stellar career in Europe. He was born Ivan Ilyich Mozzhukhin on September 26, 1889, in the village of Kondol, Saratov province, Russia (now Penza province, Russia). His father was general manager of the large estate of Prince Obolensky. Mozzhukhin attended all-boys Gymnasium in Penza, then studied at the Law School of Moscow University for two years. There he was active in amateur stage productions and joined a touring troupe, then returned to Moscow and was a member of the Vvedensky Narodny Dom Theatre. He made his film debut in 1908. From 1911-14 he worked in the films of producer Aleksandr Khanzhonkov. Mozzhukhin shot to fame after his leading role as violinist Trukhachevsky in La sonate de Kreutzer (1911) by director Pyotr Chardynin, based on the eponymous story by Leo Tolstoy. He starred as Adm. Kornilov in La défense de Sébastopol (1911) and in about 30 more silent films made by Chardynin, Yevgeni Bauer and Khanzhyonkov. By the mid-'10s Mozzhukhin was the indisputable leading star of the Russian cinema, having such film partners as 'Diaghilev''s ballerina Vera Karalli, and his own wife Nathalie Lissenko. His facial expressions were studied by many actors and directors as exemplary acting masks. From 1915-19 he worked in about 40 films by directors Yakov Protazanov and Viktor Tourjansky under the legendary Russian producer Joseph N. Ermolieff. His best known films of the Russian period were The Queen of Spades (1916) and Le père Serge (1918), both by Protazanov. Mozzhukhin's incredible popularity brought him significant wealth, but that came with attendant pressure; he also became famous for his numerous love affairs with his admirers. In 1918 the Russian Communist revolution had already caused irreversible destruction of cultural and economic life, and Mozzhukhin moved under protection of the anti-Communist White Russian forces in Yalta, Crimea. There he worked for Ermolieff during the Russian Civil War. Meanwhile, Soviet government leader V.I. Lenin ordered the seizure and nationalization of all film studios and their films, properties and other assets to use for making Soviet propaganda' most of Mozzhukhin's 70 films were arrested and / or censored. Lev Kuleshov used fragments of Mozzhukhin's films to demonstrate his editing ideas. Mozzhukhin's face was used in Kuleshov's psychological montage to illustrate the principles of film editing, known today as the Kuleshov Effect. Mozzhukhin suffered terribly from the loss of his property after the Communist revolution. However, he continued working in Yalta with Ermolieff until the end of 1919. When the Red Army advanced into Crimea and broke through to Yalta, however, he joined the White Russians and fled the now-communist Russia at the end of the Civil War. He managed to save a few rolls of his silent films, which he took aboard the Greek steamer Pantera\\ in February of 1920. He left Russia together with his film partners from the Ermolieff film company, his wife Nathalie Lissenko, actors Nicolas Koline and Nicolas Rimsky, actress Nathalie Kovanko, cinematographer Nikolai Toporkoff, director Viktor Tourjansky and producer Joseph N. Ermolieff. They emigrated together to Paris, France, and started a Russian-French film company. In 1926 Mozzhukhin got a lucrative contract with Universal Pictures in Hollywood, and was cast as the male lead in Surrender (1927). However, his stint in Hollywood was not a success, due to numerous pressures from the studio's producers who insisted on his taking the stage name John Moskin. In addition, Mozzhukhin and his female co-star Mary Philbin did not get along at all, and that was quite apparent from the footage that they had no chemistry whatever. Ats Hollywood at that time was just making the transition from silent films to talkies, Mozzuhkhin--who did not speak English--was not offered any further roles, and he returned to Europe. Soon Aleksandr Vertinskiy began to comment that Mozzhukhin's troubles in Hollywood were the results of a conspiracy by the powers in Hollywood to destroy a strong competitor. By 1939 Mozzhukhin had made over 100 films in Russia, France, Italy, the US, Germany and Austria. He continued starring in the talkies of the 1930s, although not as successfully as he had during the silent era. He also wrote screenplays for several of his films, and planned to direct a film in France, but the project was abandoned because he contracted a severe form of tuberculosis and was hospitalized. Mozzhukhin died of tuberculosis in a Paris clinic on January 17, 1939, and was laid to rest in the Russian Cemetery at Sainte-Geneviève-des-Bois, in Paris, France. Mozzhukhin's home in Kondol, Penza province, is now restored as the public Memorial Museum of Ivan Mozzhukhin. There, since the 1990s, the museum has annual showing of Mozzhukhin's films, also known as Mozzhukhin's Festivities.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxOTU2MzU4N15BMl5BanBnXkFtZTgwODgzODE1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0610620","name":"Ivan Mozzhukhin","idIMDB":"nm0610620"},"actorId":"nm0610620","character":"Prince Boris Kurbski","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carmen Boni","urlProfile":"http://www.imdb.com/name/nm0094529","urlPhoto":"","biography":{"dateOfBirth":"8 April 1901","placeOfBirth":" Rome, Lazio, Italy","birthName":"Maria Carmela Bonicatti","bio":"Carmen Boni was born on April 8, 1901 in Rome, Lazio, Italy as Maria Carmela Bonicatti. She was an actress, known for Scampolo (1928), La grazia (1929) and La riva dei bruti (1931). She was married to Rigaux, Jean and Augusto Genina. She died on November 19, 1963 in Paris, France.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0094529","name":"Carmen Boni","idIMDB":"nm0094529"},"actorId":"nm0094529","character":"Helena di Armore","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eugen Burg","urlProfile":"http://www.imdb.com/name/nm0121112","urlPhoto":"","biography":{"dateOfBirth":"6 June 1871","placeOfBirth":" Berlin, Germany","bio":"Eugen Burg was born on June 6, 1871 in Berlin, Germany. He was an actor and director, known for Robert and Beltran (1915), Der Stolz der 3. Kompanie (1932) and Voleurs de jeunesse (1928). He was married to Emmy Raabe-Burg. He died on November 15, 1944 in Theresienstadt Concentration Camp, Protectorate of Bohemia and Moravia.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0121112","name":"Eugen Burg","idIMDB":"nm0121112"},"actorId":"nm0121112","character":"Baron Korff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Seroff","urlProfile":"http://www.imdb.com/name/nm0785303","urlPhoto":"","biography":{"bio":"George Seroff was an actor, known for Misdeal (1928), The Adjutant of the Czar (1929) and The White Devil (1930). He died in September 1929.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0785303","name":"George Seroff","idIMDB":"nm0785303"},"actorId":"nm0785303","character":"General Koloboff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fritz Alberti","urlProfile":"http://www.imdb.com/name/nm0016641","urlPhoto":"","biography":{"dateOfBirth":"22 October 1877","placeOfBirth":" Hanau, Hesse, Germany","bio":"Fritz Alberti was born on October 22, 1877 in Hanau, Hesse, Germany. He was an actor, known for The Man Who Cheated Life (1926), Because I Love You (1928) and Das grobe Hemd (1927). He died on September 15, 1954 in Berlin, Germany.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0016641","name":"Fritz Alberti","idIMDB":"nm0016641"},"actorId":"nm0016641","character":"General Trunoff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Daniel Dolski","urlProfile":"http://www.imdb.com/name/nm0231241","urlPhoto":"","biography":{"bio":"Daniel Dolski is an actor, known for The Adjutant of the Czar (1929).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0231241","name":"Daniel Dolski","idIMDB":"nm0231241"},"actorId":"nm0231241","character":"Prince's manservant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexander Polonsky","urlProfile":"http://www.imdb.com/name/nm0689798","urlPhoto":"","biography":{"bio":"Alexander Polonsky is an actor, known for Troika (1930), The Adjutant of the Czar (1929) and Die Hölle von Barballo (1923).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0689798","name":"Alexander Polonsky","idIMDB":"nm0689798"},"actorId":"nm0689798","character":"Servant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexander Granach","urlProfile":"http://www.imdb.com/name/nm0334603","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzRmOTQyZmQtMzlhYy00OWZmLWExOWUtZWFiN2M3ZTg4YzM4XkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1893","placeOfBirth":" Wierzbowce, Galicia, Austria-Hungary [now Verbovcy, Ivano-Frankivsk Oblast, Ukraine]","birthName":"Jessaja Szajko Gronish","bio":"Alexander Granach was born in the region of Galizia, in what was then the Austro-Hungarian Empire (today Ukraine). Given the name Jessaja Szajko Gronish, he was one of a dozen children of a poor Jewish family eking out a living, first in a farming village, later in a series of small towns and cities. He began working early mornings as a baker in his father's poor bakery by the age of 6, had a rough and tumble youth with relatively little schooling in religious and secular Jewish schools. He ran away from home four times, according to his autobiographical novel, but, reunited with his family at the age of 14, saw his first theatrical production, a famous play in the Yiddish language. Granach was smitten by the stage and, determined to become an actor, ran away to Berlin in 1909. In Berlin, Granach worked as a journeyman baker, fell in with a group of Jewish socialist worker-intellectuals--recent immigrants from similar Eastern European backgrounds to his own. His beginning as an actor was in amateur Yiddish-speaking productions, but he was encouraged to learn German and aspire to a wider career and was accepted into the acting school of Max Reinhardt, Europe's leading theatrical figure. Although the beginning of his acting career was interrupted by his military service in World War I, and his time as a prisoner of war in Italy, after the war he rapidly established himself as a leading figure of the flourishing theater and film industry of the Weimar-era in post-war Germany. His most enduring success in German film was as \"Knock,\" the weird real estate agent in \"Nosferatu.\" His charisma is demonstrated in the early German \"talkie,\" \"Kameradschaft\" (1931), directed by G.W. Pabst. Granach was a well-known figure in the lively political and artistic milieu of the 1920s and early '30s, a friend of leading writers, actors, and directors, and had to flee as soon as Hitler came to power in 1933-as both a Jew and a Leftist. He spent the next five years in exile in Poland and the Soviet Union, acting in films and plays, but was arrested by Stalin's minions in 1938 and was fortunate to be able to leave the USSR and then to get to the United States. He learned English, as he had once learned German, and got his chance to act in Hollywood and then on Broadway, joining the small army of Jewish and other escapees from Hitler's Europe. The role for which he is best known in America is that of Kopalsi in \"Ninotchka,\" (1939) directed by Ernst Lubitsch, but his role as Gestapo Inspector Alois Gruber in \"Hangmen Also Die!\" (1943) should be better known. (The film was written, in part, by his old colleague, Bertolt Brecht and directed by Fritz Lang.) Granach was acting on Broadway with Frederic March in the play by John Hersey, \"A Bell for Adano,\" when he had an attack of appendicitis and died several days later of an embolism, on March 13, 1945. Alexander Granach wrote an autobiographical novel, with the title Da geht ein Mensch, in German, which was published in 1945, just after his death. The book was published at the same time in an English version, as There Goes an Actor. It was recognized at the time as a remarkable work, and has been republished as: From the Shtetl to the Stage: the Odyssey of a Wandering Actor, by Transaction Publishers, 2010.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzRmOTQyZmQtMzlhYy00OWZmLWExOWUtZWFiN2M3ZTg4YzM4XkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0334603","name":"Alexander Granach","idIMDB":"nm0334603"},"actorId":"nm0334603","character":"Stranger","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0019624","urlIMDB":"http://www.imdb.com/title/tt0019624","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 31 min (91 min) (UK)"],"soundMix":["Silent"],"color":["Black and White"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":["2,717 m"],"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.7","filmingLocations":[],"awards":[],"votes":"6","type":"Movie","companyCreditsSimple":[{"idCompany":"co0034504","name":"Greenbaum-Film"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 04:36:08"}}