{"data":{"movies":[{"title":"The Roaring Road","originalTitle":"","year":"1919","releaseDate":"19190427","directors":[{"name":"James Cruze","id":"nm0190516"}],"writers":[{"name":"Byron Morgan","id":"nm0604526"},{"name":"Marion Fairfax","id":"nm0265572"}],"runtime":"58 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzA5NDQ3YzUtMzVmZi00NWMwLWI1MjctODA2YzEyZGIxY2UyXkEyXkFqcGdeQXVyMTcyODY2NDQ@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama","Sport"],"plot":"A young man pursues a young lady with the same energy he applies to his other obsession in life, auto racing.","simplePlot":"A young man pursues a young lady with the same energy he applies to his other obsession in life, auto racing.","actors":[{"actorName":"Wallace Reid","urlProfile":"http://www.imdb.com/name/nm0717468","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMzYwMjAyNF5BMl5BanBnXkFtZTYwMTExNjI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 April 1891","placeOfBirth":" St. Louis, Missouri, USA","birthName":"William Wallace Reid","height":"6' 1\" (1.85 m)","bio":"The son of writer-theater producer-director-actor Hal Reid, Wallace was on stage by the age of four in the act with his parents. He spent most of his early years, not on the stage, but in private schools where he excelled in music and athletics. In 1910, his father went to the Chicago studio of \"Selig Polyscope Company\" and Wallace decided that he wanted to be a cameraman. However, with his athletic good looks, he was often put in front of the camera instead of behind - a situation that he disliked. His first film before the camera was The Phoenix (1910), where he played the role of the young reporter. Wallace preferred to be a cameraman, a writer, a director - anything but an actor. He took his fathers play \"The Confession\" to Vitagraph where he wanted to write and direct the film. Wallace ended up also acting in it. Starting with bit parts in various films, Wallace was eventually cast as the leading man to Florence Turner in numerous films. Wallace next moved on to \"Reliance\" where he acted, but also wrote screenplays. His next big move was to Hollywood, where he was hired by Universal director Otis Turner, as assistant director, second cameraman, gopher and scenario writer. It was what he was looking for, but he ended up back in front of the camera. At 20, Reid was an unknown assistant director. In 1913, Wallace married Dorothy Davenport, one of the stars that he both directed and starred with. Although only 17, Dorothy had spent a number of years on the stage before heading to the silver screen. The roles that Wallace played were getting bigger and bigger, but after appearing in over 100 films, he took a salary cut and a small part to work with D.W. Griffith on his milestone film The Birth of a Nation (1915). It was after this film that Jesse L. Lasky signed Wallace to a contract with \"Famous Players\" and he became a big star, but his dreams of directing and writing ended. An alcoholic for years, this situation worsened. His first film for \"Famous Players\" was The Chorus Lady (1915). Wallace went on to star in a series of pictures in which he represented all that was best of the ideal American. He had parts in over 60 more pictures including Intolerance: Love's Struggle Throughout the Ages (1916) and The Squaw Man's Son (1917). But it was the daredevil auto movies that he was most popular at. Flashing cars, dangerous roads and sometimes a race with a speeding locomotive thrilled and scared the public. His auto pictures included The Roaring Road (1919), Excuse My Dust (1920) and Double Speed (1920). When the U.S. entered World War I, Wallace was 25, six foot one and a crack shot. Even though he wanted to enlist, pressure was exerted on him not to. He was the rock on which \"Famous Players\" was built and his loss would have materially effect the company. He had a newborn son and was the sole support for his wife, his son, his mother, her mother, his father and also had to consider his status as a matinée idol. He did volunteer his time to selling Liberty bonds and often opened his house to veterans. His films were financial successes, but in his personal life, he spent money like water. Wallace was a star who was worked continuously by the studio but disaster struck on a film site in Oregon. While making the film The Valley of the Giants (1919), Wallace was involved in a train crash and his injuries prevented him from finishing the film. Unwilling to stop the film, the studio sent the company doctor up to Oregon with a supply of morphine so that he would continue working and not feel the pain of his injury. After the picture was finished, he was needed to begin another so the studio kept supplying Wallace with morphine and he became hooked. Coupled with the alcohol, Wallace never had a chance and by 1922, he started entering a succession of hospitals and sanitariums as his health faded. Making his last film for the studio, Thirty Days (1922), Wallace was barely able to stand, let alone act. He died at the sanitarium, in Dorothy's arms, on the 18th day of January 1923 at the age of only 31. Wallace was the third major Paramount personality to be involved in scandal in 1922.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMzYwMjAyNF5BMl5BanBnXkFtZTYwMTExNjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0717468","name":"Wallace Reid","nicknames":["Wally","The Screen's Most Perfect Lover"],"idIMDB":"nm0717468"},"actorId":"nm0717468","character":"Walter Thomas 'Toodles' Walden","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ann Little","urlProfile":"http://www.imdb.com/name/nm0514517","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDA2YTViMTctNmQ4Yi00NjIyLThkYTYtMTNmNjg1OTA4YjE5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 February 1891","placeOfBirth":" Mount Shasta, California, USA","birthName":"Mary Brooks","bio":"Unlike many serial heroines, Ann Little actually was a daughter of the West. Born in a small town near the foot of northern California's Mt. Shasta, she was raised on a ranch in the shadow of the great mountain. After graduating high school, she joined a traveling stock company, winding up in a play in San Francisco. She entered the film business making one-reel westerns with Broncho Billy Anderson, and soon relocated to Southern California, where she made a variety of films for many different companies. Since she was proficient at such outdoors activities as riding, shooting and swimming, she began to get more work in wsterns, especially as Indian maidens, which pleased her no end as she had engaged in a lifelong study of Indian culture (her faithful portrayal of a young Indian girl in The Squaw Man (1918) won her the respect and friendship of the Indian extras in that film). She began making serials during her tenure at Universal, where she would make the first (in 1915) of six. By 1917, however, she had tired of westerns, and relocated to New York City to try her hand at straight drama. However, she find herself back in the serial field, although this time even more successfully, and returned to Calilfornia. Her career was going great guns when, in 1925, she gave it all up and left the industry. Nobody knew why and she apparently never told anybody she was planning to do it; she just upped and did it. There were rumors that she found religion (Christian Science) and left to devote herself to religious work, but, although she still lived in the Los Angeles area, she refused to speak of her years in Hollywood and never gave a reasn for leaving. She died in 1984.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDA2YTViMTctNmQ4Yi00NjIyLThkYTYtMTNmNjg1OTA4YjE5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0514517","name":"Ann Little","idIMDB":"nm0514517"},"actorId":"nm0514517","character":"Dorothy Ward, the Cub","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Theodore Roberts","urlProfile":"http://www.imdb.com/name/nm0731623","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTI0NzM2MDE4NF5BMl5BanBnXkFtZTYwNDQzMTU5._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 October 1861","placeOfBirth":" San Francisco, California, USA","birthName":"Theodore J. Roberts","bio":"The son of a sea captain, Theodore Roberts was a veteran stage actor, making his first appearance in 1880. Often referred to as the \"Grand Duke of Hollywood,\" Roberts was a regular on the Cecil B. DeMille team and appeared in 23 of DeMille's films. He is best remembered for his role as Moses in DeMille's The Ten Commandments (1923). A well-known and well-loved actor, his funeral in Westlake Park (he died from uremic poisoning) was attended by nearly 2,000 people. However, Roberts felt so much bitterness in his heart for his immediate relatives that he bequeathed his estate to a nephew (a commercial illustrator) in New York. The estate was valued at nearly $20,000, including a yacht valued at $10,000. Several of Roberts' personal items were left to his friends William C. de Mille and his brother Cecil. Roberts claimed that during the worst times of his life, no one in his family offered a word of sympathy or any help at all. His only request was that he be laid to rest next to his beloved wife Florence Smythe, who passed away in 1925.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTI0NzM2MDE4NF5BMl5BanBnXkFtZTYwNDQzMTU5._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0731623","name":"Theodore Roberts","nicknames":["The Grand Duke of Hollywood"],"idIMDB":"nm0731623"},"actorId":"nm0731623","character":"J.D. Ward, the Bear","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Guy Oliver","urlProfile":"http://www.imdb.com/name/nm0646851","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTFlM2MxMTYtNzNlMi00OTM0LWFiZTAtNDI3NTY0NGMyZGIyXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1878","placeOfBirth":" Chicago, Illinois, USA","birthName":"George Guy Oliver","height":"5' 10½\" (1.79 m)","bio":"Guy Oliver was born on September 25, 1878 in Chicago, Illinois, USA as George Guy Oliver. He was an actor and director, known for The Raven (1912), At the Flood Tide (1915) and The Roaring Road (1919). He was married to Elinor. He died on September 1, 1932 in Hollywood, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTFlM2MxMTYtNzNlMi00OTM0LWFiZTAtNDI3NTY0NGMyZGIyXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0646851","name":"Guy Oliver","idIMDB":"nm0646851"},"actorId":"nm0646851","character":"Tom Darby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clarence Geldart","urlProfile":"http://www.imdb.com/name/nm0312238","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4MTgyOTg5MF5BMl5BanBnXkFtZTcwMTUzODMwNw@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 June 1865","placeOfBirth":" New Brunswick, Canada","height":"5' 11\" (1.8 m)","bio":"Clarence Geldart was born on June 9, 1865 in New Brunswick, Canada. He was an actor and director, known for A Woman of Paris: A Drama of Fate (1923), Why Change Your Wife? (1920) and The Roaring Road (1919). He died on May 13, 1935 in Calabasas, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4MTgyOTg5MF5BMl5BanBnXkFtZTcwMTUzODMwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0312238","name":"Clarence Geldart","idIMDB":"nm0312238"},"actorId":"nm0312238","character":"Fred Wheeler","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0010635","urlIMDB":"http://www.imdb.com/title/tt0010635","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["58 min"],"soundMix":["Silent"],"color":["Black and White"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":["1,313.35 m (5 reels) (USA)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.7","filmingLocations":[],"rated":"PASSED","awards":[],"votes":"540","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["train crash","stock footage","speeding ticket","santa monica california","san francisco california","salesman","sales manager","railroad crossing","racecar driver","race car","race car crash","policeman","police officer","motor","motorcycle","motorcycle cop","mechanic","manufacturer","los angeles california","land speed record","grease","gasoline","father daughter relationship","deception","cigarette smoking","cigar smoking","california","barber","barber shop","archive footage","automobile racing"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:55:41"}}