{"data":{"movies":[{"title":"Pluto's Christmas Tree","originalTitle":"","year":"1952","releaseDate":"19521121","directors":[{"name":"Jack Hannah","id":"nm0360286"}],"writers":[{"name":"Bill Berg","id":"nm0073714"},{"name":"Milt Schaffer","id":"nm0769849"}],"runtime":"7 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMzEwNTYyNV5BMl5BanBnXkFtZTcwNzc4MjAzMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation","Short","Comedy","Family","Fantasy"],"plot":"Pluto comes bounding outside to help Mickey get a Christmas tree. Chip 'n Dale see him and make fun of him, but the tree they take refuge in is the one Mickey chops down. They like the decorations, especially the candy canes and Mickey's bowl of mixed nuts. But Pluto spots them and goes after them long before Mickey spots them. Minnie, Donald, and Goofy drop by to sing carols.","simplePlot":"Pluto comes bounding outside to help Mickey get a Christmas tree. Chip 'n Dale see him and make fun of him, but the tree they take refuge in is the one Mickey chops down. They like the ... ","actors":[{"actorName":"Ruth Clifford","urlProfile":"http://www.imdb.com/name/nm0166681","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwOTQyOTczNV5BMl5BanBnXkFtZTcwNzEzMzMzOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1900","placeOfBirth":" Pawtucket, Rhode Island, USA","height":"5' 3\" (1.6 m)","bio":"American actress, originally of leading roles, whose career lasted from silent days into the television era. A native of Rhode Island, she attended St. Mary's Seminary in Narragansett, Rhode Island, then, following her mother's death in 1911, came to Los Angeles as a teenager to live with her actress aunt. She got work as an extra and began her career at 15 at Universal, in fairly substantial roles. By her mid-twenties, she was playing leads and second leads, including the role of Abraham Lincoln's lost love, Ann Rutledge, in The Dramatic Life of Abraham Lincoln (1924). But sound pictures found her roles diminishing, and throughout the next three decades she played smaller and smaller parts. She was a favorite of John Ford(they played bridge together), who used her in eight films, but rarely in substantial roles. She was also, for a time, the voice of Walt Disney's \"Minnie Mouse.\" She lived long enough to find herself in demand for documentary interviews on the subject of early Hollywood. Married for a time to Beverly Hills real-estate developer James Cornelius, she survived that marriage by more than sixty years. She died in 1998, two and one-half months before her 99th birthday.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwOTQyOTczNV5BMl5BanBnXkFtZTcwNzEzMzMzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0166681","name":"Ruth Clifford","idIMDB":"nm0166681"},"actorId":"nm0166681","character":"Minnie Mouse","urlCharacter":"http://www.imdb.com/character/ch0000681","main":true},{"actorName":"Pinto Colvig","urlProfile":"http://www.imdb.com/name/nm0173418","urlPhoto":"","biography":{"dateOfBirth":"11 September 1892","placeOfBirth":" Jacksonville, Oregon, USA","birthName":"Vance DeBar Colvig","bio":"Pinto Colvig was the quintessential clown whose own identity was always hidden but whose innate warm-hearted character always came through his many talents. His humor tickled the funny bone and touched the heart. Incredibly gifted in music, art and mime, he spoke to different generations in different roles: as a child clown playing a squeaky clarinet, as a full-fledged circus clown under the big top, as a newspaper cartoonist, as a film animator, as a mimic and sound effects wizard, and as the voice of dozens of well-known characters on film, records, radio and television. Vance DeBar Colvig was born in Jacksonville, Oregon, on September 11, 1892. His school friends nicknamed him after a spotted horse named \"Pinto\" because of his freckled face - and just like his freckles, the name stuck for his entire life. Pinto's childhood home was filled with music and laughter, and he was a clown from birth. As the youngest of seven children, he would do anything to get attention. He learned to make people laugh by making faces and playing pranks. He also spent hours mimicking the sounds around him: a rusty gate, farm animals, sneezes, wind, cars, trains, etc. He and his brother Don put on song-and-dance minstrel shows at local functions. Along the way he picked up his instrument of choice, the clarinet, and soon played well enough to join the town band. It was the clarinet that got Pinto into show business when he was 12. Visiting Portland's \"Lewis and Clark Centennial Exposition\" with his father William, he was magnetized by \"The Crazy House\" on the Midway where a huckster attracted the crowd with a bass drum and shouts of \"Hubba Hubba!\" Pinto told the man he could play \"squeaky\" clarinet and ran back to the hotel to get his instrument. He was hired on the spot and given some oversized old clothes and a derby and, for the first time, white makeup and a clown face. The man told Pinto, \"Now you look like a real bozo\" (\"bozo\" was a name given to hobo or tramp clowns in those days). Pinto's act was to play a screechy clarinet while distorting his face and crossing his eyes at the high notes. He later recalled, \"I never was able to get circuses and carnivals out of my blood after that.\" He went to school during the winter and worked in the circus and vaudeville in the spring. While studying art at Oregon Agricultural College (now Oregon State University) and playing with the college band, he became known for his clever cartoons in student publications, his funny \"chalk talk\" performances improvising a monologue while quickly sketching cartoons, and his unconventional lifestyle. He never took his class courses seriously and his college career ended abruptly in the spring of 1913 when he accepted an offer to do his chalk talks for the prestigious Pantages vaudeville circuit and wound up in Seattle, Washington. There he joined a circus band and traveled throughout the country struggling to make ends meet. In 1914 he landed a job as a newspaper cartoonist at the \"Nevada Rockroller\" in Reno, and later the \"Carson City News\" in Carson City. By the spring of 1915 his cartooning was going well but the lure of the circus was too strong. When the Al G. Barnes Circus came through Carson City, Pinto dropped everything and joined the troupe, once again clowning and playing his clarinet in the circus band. In those days circuses closed down each winter and Pinto returned to newspaper cartooning wherever he could find a job. While working on a Portland newspaper between seasons in 1916, he met and married Margaret Bourke Slavin, putting an end to his vagabond life as a circus performer. With a family to support, Pinto and Margaret moved to San Francisco, where he returned to the newspaper business writing and drawing cartoons full-time at \"The Bulletin\" and later the \"San Francisco Chronicle\". His cartoon series, \"Life on the Radio Wave,\" which poked fun at the way the newly introduced radio was influencing people's lives, was syndicated nationally by United Features Syndicate. He greatly enjoyed cartooning and considered it another form of clowning. \"A cartoonist,\" he said, \"is just a clown with a pencil.\" While Pinto toiled daily to meet newspaper commitments, he began to spend evenings experimenting with the animation of cartoons and eventually set up his own studio, Pinto Cartoon Comedies Co., where he created one of the first animated silent films in color called \"Pinto's Prizma Comedy Revue (1919)\". In 1922, after realizing that San Francisco was not the place to break into the movie business, he moved his family to Hollywood. There he would be able to continue his animation work and find a wealth of other things that he could do. He was overjoyed one day to get an offer to join Mack Sennett, the reigning king of movie comedies, who had developed one of the most successful studios of the day, the Keystone Film Co., home of the famous Keystone Kops, Charles Chaplin and many others. Sennett needed an experienced animator for his own films, but Pinto soon found himself also writing and acting in comedies and dramas. In 1928 he teamed up with his friend Walter Lantz to create an early talking cartoon, \"Bolivar, the Talking Ostrich (1928)\", but unlike Walt Disney's Steamboat Willie (1928), it failed to become a hit. Pinto and Lantz, who would later be the voice of Woody Woodpecker, gave up and went to larger studios. Disney, who was making \"Mickey Mouse\" and \"Silly Symphony\" cartoons, signed Pinto to a contract in 1930. Pinto worked on stories, co-wrote songs such as the lyrics to \"Who's Afraid of the Big Bad Wolf?\" and was the original voice of animated characters such as Goofy and Pluto, Grumpy and Sleepy in Blanche Neige et les sept nains (1937) and the Practical Pig in \"Three Little Pigs.\" Disney cartoonists copied many of Pinto's facial expressions while drawing animal characters for the cartoons. He left Disney in 1937 following a fallout with Walt and Disney proceeded to reuse his old voice tracks. Meanwhile, Pinto freelanced voices and sound effects for Warner Bros. cartoons, sang for some of the Munchkins during Dorothy's arrival scenes in MGM's The Wizard of Oz (1939), and also joined Max Fleischer Studios in Miami, where he did the voice of Gabby in Gulliver's Travels (1939) and the blustering of Bluto in \"Popeye the Sailor\" cartoons. He returned to Disney in 1941 and continued to freelance for them and on radio programs for others. He was the original Maxwell automobile on Jack Benny's show, the hiccuping horse for Dennis Day, and a variety of voices for \"Amos 'n Andy.\" His live radio experience and contacts introduced him to the recording industry. He did several albums before encountering one of his best-known characters, Bozo the Clown. It was 1946 when Capitol Records in Hollywood hired Alan Livingston as a writer/producer. His initial assignment was to create a children's record library, for which he came up with the soon-to-be-legendary Bozo character. He wrote and produced a popular series of storytelling record-album and illustrative read-along book sets, beginning with the October 1946 release of \"Bozo at the Circus.\" His record-reader concept, which enabled children to read and follow a story in pictures while listening to it, was the first of its kind. The Bozo image was a composite design of Livingston's, derived from a variety of clown pictures and then given to an artist to turn into comic-book-like illustrations. Livingston then hired Pinto to portray the character. \"Pinto came in,\" Livingston recalls, \"and turned out to be a very jolly, likable fellow with the kind of warm, folksy voice I wanted. He didn't talk down to children.\" Not only did Livingston get a perfect Bozo voice in Pinto, he also got most of the animals and odd creatures under the sea and in outer space, all for the price of one. On some of the records, Pinto provided as many as eight other voices. The series turned out to be a smash hit for Capitol, selling over eight million albums in the late 1940s and early 1950s. The character also became a mascot for the record company and was later nicknamed \"Bozo the Capitol Clown.\" Pinto, as Bozo, also starred in the very first Bozo television series, Bozo's Circus (1949) on KTTV-Channel 11 (CBS) in Los Angeles, made numerous guest appearances on radio and personal appearance tours all over the country. He especially enjoyed his visits to children's hospitals and orphanages, according to Pinto, \"doin' my silly stuff to make them laugh.\" Pinto's Bozo ended in 1956 when Larry Harmon, one of several actors hired by Livingston and Capitol to portray Bozo at promotional appearances, formed a business partnership and bought the licensing rights to the character (excluding the record-readers) from Capitol and Livingston. In 1958 Jayark Films Corp. began distributing Bozo limited-animation cartoons to television stations, along with the rights for each to hire its own live Bozo host. Harmon produced and provided the voice of the character in the cartoons. On January 5, 1959, Bozo returned to television beginning with a live 30-minute weeknight show on KTLA-Channel 5 in Los Angeles. Although Pinto's Bozo days were over, it was his son, Vance Colvig Jr., whom KTLA chose as the live Bozo host. Vance's portrayal and the KTLA show lasted for six years, at which time Harmon bought out his partners and continued to market the character through his Larry Harmon Pictures Corp. If Pinto had any dark years, they were during World War II. Four of his five sons were of eligible age and his wife felt the dread that millions of mothers felt, which may have complicated an illness that made her a semi-invalid for several years. Pinto took care of her until her death in 1950. Throughout his life Pinto was upbeat and cheerful, convinced that laughter was the world's best medicine. \"Sure, there have been kicks in the pants and occasionally an empty gut,\" he once said, \"but those are the jolts what pushes a guy upward and onward!\" His letters, though touching on his philosophy, were never serious but always funny and filled with odd typing effects, extraneous capitalization, underlining, misspellings and strange made-up words. He also lavished his letters and envelopes with outrageous cartoons and balloons filled with gags. He kept regular correspondence with clown legends Felix Adler, Emmett Kelly, Lou Jacobs and Otto Griebling, and visited \"clown alley\" whenever a circus came to the Los Angeles area. In 1963 Pinto received a letter from Oregon Senator Maurine Neuberger thanking him for supporting her bill requiring warning labels on cigarette packages. It was a controversial idea at a time when nonsmoking areas were just a dream and America was blue with secondhand smoke. With lungs ravaged by a lifetime of heavy smoking, Pinto did his part to help others become aware of the problem. On October 3, 1967, Vance Debar \"Pinto\" Colvig died of lung cancer at the age of 75 in Woodland Hills, California. Vance Jr. donated his and his father's memorabilia to the Southern Oregon Historical Society in Pinto's hometown of Jacksonville in 1978. Vance Jr. passed away in 1991. In 1993, the Walt Disney Company honored Pinto Colvig as a \"Disney Legend.\" On May 28, 2004, he was inducted into the International Clown Hall of Fame in Milwaukee, Wisconsin.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0173418","name":"Pinto Colvig","nicknames":["'Dean of Hollywood Voicemen'"],"idIMDB":"nm0173418"},"actorId":"nm0173418","character":"Pluto / Goofy","urlCharacter":"http://www.imdb.com/character/ch0027779","main":true},{"actorName":"Dessie Flynn","urlProfile":"http://www.imdb.com/name/nm0283439","urlPhoto":"","biography":{"dateOfBirth":"24 November 1895","placeOfBirth":" Texas, USA","birthName":"Dessie Farrell Flynn","bio":"Dessie Flynn was born on November 24, 1895 in Texas, USA as Dessie Farrell Flynn. He was an actor, known for Chip an' Dale (1947), Squatter's Rights (1946) and Corn Chips (1951). He was married to Ellsworth H. Rumer. He died on December 18, 1990 in North Palm Springs, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0283439","name":"Dessie Flynn","idIMDB":"nm0283439"},"actorId":"nm0283439","character":"Dale","urlCharacter":"http://www.imdb.com/character/ch0029145","main":true},{"actorName":"James MacDonald","urlProfile":"http://www.imdb.com/name/nm0531763","urlPhoto":"","biography":{"dateOfBirth":"19 May 1906","placeOfBirth":" Monks Coppenhall, Crewe, Cheshire, England, UK","birthName":"John James MacDonald","bio":"James MacDonald was born on May 19, 1906 in Monks Coppenhall, Crewe, Cheshire, England as John James MacDonald. He is known for his work on Cendrillon (1950), Alice au pays des merveilles (1951) and Les aventures de Bernard et Bianca (1977). He was married to Sarah Roberta Cullen. He died on February 1, 1991 in Glendale, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0531763","name":"James MacDonald","nicknames":["Jimmy"],"idIMDB":"nm0531763"},"actorId":"nm0531763","character":"Chip / Mickey Mouse","urlCharacter":"http://www.imdb.com/character/ch0029147","main":true},{"actorName":"Clarence Nash","urlProfile":"http://www.imdb.com/name/nm0621699","urlPhoto":"","biography":{"dateOfBirth":"7 December 1904","placeOfBirth":" Watonga, Oklahoma, USA","birthName":"Clarence Charles Nash","height":"5' 2\" (1.57 m)","bio":"Clarence Nash was born on December 7, 1904 in Watonga, Oklahoma, USA as Clarence Charles Nash. He was an actor, known for The Three Caballeros (1944), Mickey and the Beanstalk (1947) and Mickey's Christmas Carol (1983). He was married to Margaret Seamans. He died on February 20, 1985 in Glendale, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0621699","name":"Clarence Nash","nicknames":["Ducky","Charlie Nash"],"idIMDB":"nm0621699"},"actorId":"nm0621699","character":"Donald Duck","urlCharacter":"http://www.imdb.com/character/ch0000719","main":true}],"seasons":[],"idIMDB":"tt0045037","urlIMDB":"http://www.imdb.com/title/tt0045037","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["7 min","8 min (Argentina)"],"soundMix":["Mono (RCA Sound System)"],"color":["Color (Technicolor)"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm","8 mm"]},"rating":"7.8","filmingLocations":[],"rated":"APPROVED","awards":[],"votes":"1,273","type":"Movie","companyCreditsSimple":[{"idCompany":"co0098836","name":"Walt Disney Productions"}],"keywords":{"keywords":["candy cane","christmas","christmas tree","chip n dale","1950s","mouse","duck","cartoon rat","cartoon bird","anthropomorphism","anthropomorphic animal","pluto the character","cartoon mouse","cartoon duck","cartoon dog","present","goofy the character","ornament","christmas caroling","candle","rat","dog","reference to minnie mouse","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:02:29"}}