{"data":{"movies":[{"title":"Down Argentine Way","originalTitle":"","year":"1940","releaseDate":"19401011","directors":[{"name":"Irving Cummings","id":"nm0191899"}],"writers":[{"name":"Darrell Ware","id":"nm0912090"},{"name":"Karl Tunberg","id":"nm0876562"}],"runtime":"89 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwOTI4MDUxOV5BMl5BanBnXkFtZTcwOTg5MDMzMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama","Musical","Romance","Sport"],"plot":"An American girl on vacation in Argentina falls for a wealthy racehorse owner.","simplePlot":"An American girl on vacation in Argentina falls for a wealthy racehorse owner.","actors":[{"actorName":"Don Ameche","urlProfile":"http://www.imdb.com/name/nm0000747","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNjc5ODE4MV5BMl5BanBnXkFtZTYwOTYwMTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1908","placeOfBirth":" Kenosha, Wisconsin, USA","birthName":"Dominic Felix Amici","height":"5' 11\" (1.8 m)","bio":"Don Ameche was a versatile and popular American film actor in the 1930s and '40s, usually as the dapper, mustached leading man. He was also popular as a radio master of ceremonies during this time. As his film popularity waned in the 1950s, he continued working in theater and some TV. His film career surged in a comeback in the 1980s with fine work as an aging millionaire in Trading Places (1983) and a rejuvenated oldster in Cocoon (1985). Ameche was born Dominic Felix Amici in Kenosha, Wisconsin, to Barbara Edda (Hertel) and Felice Amici, a bartender.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNjc5ODE4MV5BMl5BanBnXkFtZTYwOTYwMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000747","name":"Don Ameche","idIMDB":"nm0000747"},"actorId":"nm0000747","character":"Ricardo Quintana","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Betty Grable","urlProfile":"http://www.imdb.com/name/nm0002107","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMDk3ODkwMl5BMl5BanBnXkFtZTYwMTEwNzQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1916","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Elizabeth Ruth Grable","height":"5' 4\" (1.63 m)","bio":"Elizabeth Ruth Grable was born on December 18, 1916 in St. Louis, Missouri, to Lillian Rose (Hofmann) and John Charles Grable, a stockbroker. She had German, English, Irish, and Dutch ancestry. Her mother was a stubborn and materialistic woman who was determined to make her daughter a star. Elizabeth, who later became Betty, was enrolled in Clark's Dancing School at the age of three. With her mother's guidance, Betty studied ballet and tap dancing. At age 13, Betty and her mother set out for Hollywood with the hopes of stardom. Lillian lied about her daughter's age, and Ruth landed several minor parts in films in 1930, such as Whoopee! (1930), New Movietone Follies of 1930 (1930), Happy Days (1929) and Let's Go Places (1930). In 1932, she signed with RKO Radio Pictures. The bit parts continued for the next three years. Betty finally landed a substantial part in By Your Leave (1934). One of her big roles was in College Swing (1938). Unfortunately, the public did not seem to take notice. She was beginning to think she was a failure. The next year, she married former child star Jackie Coogan. His success boosted hers, but they divorced in 1940. When she landed the role of Glenda Crawford in Down Argentine Way (1940), the public finally took notice of this shining bright star. Stardom came through comedies such as Coney Island (1943) and Sweet Rosie O'Grady (1943). The public was enchanted with Betty. Her famous pin-up pose during World War II adorned barracks all around the world. With that pin-up and as the star of lavish musicals, Betty became the highest-paid star in Hollywood. After the war, her star continued to rise. In 1947, the United States Treasury Department noted that she was the highest paid star in America, earning about $300,000 a year - a phenomenal sum even by today's standards. Later, 20th Century-Fox, who had her under contract, insured her legs with Lloyds of London for a million dollars. Betty continued to be popular until the mid-1950s, when musicals went into a decline. Her last film was How to Be Very, Very Popular (1955). She then concentrated on Broadway and nightclubs. In 1965, she divorced band leader Harry James, whom she had wed in 1943. Betty Grable died at age 56 of lung cancer on July 2, 1973 in Santa Monica, California. Her life was an active one, devoid of the scandals that plagued many stars in one way or another. In reality, she cared for her family and the family life more than stardom. In that way, she was a true star.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMDk3ODkwMl5BMl5BanBnXkFtZTYwMTEwNzQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002107","name":"Betty Grable","nicknames":["The Girl With the Million Dollar Legs","The Pin-Up Girl","America's Ideal Girl","The Quicksilver Blonde"],"idIMDB":"nm0002107"},"actorId":"nm0002107","character":"Glenda Crawford","urlCharacter":"http://www.imdb.com/character/ch0448765","main":true},{"actorName":"Carmen Miranda","urlProfile":"http://www.imdb.com/name/nm0000544","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA5NjExODc4OF5BMl5BanBnXkFtZTYwNzYwMTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1909","placeOfBirth":" Marco de Canavezes, Portugal","birthName":"Maria do Carmo Miranda da Cunha","height":"5' (1.52 m)","bio":"Carmen Miranda was born Maria do Carmo Miranda da Cunha on February 9, 1909, near Porto, Portugal, in the town of Marco de Canavezes. Not long after her birth her family moved to Brazil, where her father was involved in the produce business. The family settled in the then-capital city of Rio de Janeiro. After leaving school, Carmen got a job at a local store, and often began singing on the job. Before long she was discovered and got a singing job on a local radio station. She ultimately got a recording contract with RCA. By 1928 she was a genuine superstar in Brazil. As with other popular singers of the era, she eventually made her way into the film world. She made her debut in the Brazilian documentary A Voz do Carnaval (1933). Two years later she appeared in her first feature film, Alô, Alô, Brasil (1935). However. it was Estudantes (1935) that seemed to solidify Carmen in the minds of the Brazilian movie audiences. Now they realized she could act as well as sing. Although there was three years between \"Alo, Alo Carnaval\" and Banana-da-Terra (1939), Carmen continued to churn out musical hits in Brazil. The latter film would be the last in her home country. In late 1939 Carmen arrived, with much fanfare in the press, in New York City. She was now ready to capture Americans' hearts with her talent. She appeared in some musical revues on Broadway and, just as everyone thought, was a huge hit. In 1940 Carmen was signed to appear in the Twentieth Century-Fox production Down Argentine Way (1940), with Betty Grable and Don Ameche. The only complaint that critics had was the fact that Carmen was not on the screen enough. In 1941 she was, again, teamed with Ameche in addition to Alice Faye in That Night in Rio (1941). The film was extremely popular with the theater patrons. Her unique songs went a long way in making her popular. It was after Week-End in Havana (1941) that American cartoon artists began to cash in on Carmen's ever-growing popularity. In the 1930s and 1940s cartoons were sometimes shown as a prelude to whatever feature film was showing. Sure enough, the cartoon version of Carmen came wriggling across the screen, complete with her trademark fruit hat and wide, toothy grin. In 1942 Carmen starred in Springtime in the Rockies (1942) with Betty Grable and Cesar Romero, both of whom she had worked with before. It was shortly after this that America began adopting her style of dress as the latest fad. 1944 saw her in three films: Something for the Boys (1944), Four Jills in a Jeep (1944) and Greenwich Village (1944). The first two did well at the box-office, but the last one left a lot to be desired. It was her last busy year in film. Carmen made one film each in 1945, '46, '47 and '48. After that she didn't make a film for two years, until Nancy Goes to Rio (1950), a production for MGM. Once again didn't make a film for several years, returning with Scared Stiff (1953). She did stay busy, singing on the nightclub circuit and appearing on the relatively new medium of television. However, \"Scared Stiff\" was her final performance on the silver screen. On August 4, 1955, she suffered a heart attack, although she didn't realize it at the time, during a video taping of The Jimmy Durante Show (1954). She went home after attending a party. Early the next morning, on August 5, Carmen suffered a fatal heart attack. She was just 46 years old. Her body was flown to her adopted country of Brazil, where her death was declared a period of national mourning.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA5NjExODc4OF5BMl5BanBnXkFtZTYwNzYwMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000544","name":"Carmen Miranda","nicknames":["The Brazilian Bombshell","A Pequena Notável"],"idIMDB":"nm0000544"},"actorId":"nm0000544","character":"Carmen Miranda","urlCharacter":"http://www.imdb.com/character/ch0142287","main":true},{"actorName":"Charlotte Greenwood","urlProfile":"http://www.imdb.com/name/nm0339307","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDg2MTVmYWEtNjc4ZC00NGQwLTk0MWUtOTllODM5NmE3MzE3XkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 June 1890","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Frances Charlotte Greenwood","height":"5' 8½\" (1.74 m)","bio":"Charlotte Greenwood was born Frances Charlotte Greenwood on June 25, 1890, in Philadelphia, Pennsylvania. She was a sickly child and her father left the family when she was very young. Charlotte grew into a healthy, six foot tall woman. She started her career dancing in vaudeville where she became known for her long legs. Her signature dance move was doing a high kick. She was nicknamed \"Lady Longlegs\". In 1915 Charlotte married actor Cyril Ring. She was deeply in love with him but he left her for another woman. Charlotte married songwriter Martin Broones in 1924. Although she dreamed of becoming a dramatic actress she had greater success in comedy. She starred in a series of stage shows playing a man crazy character named \"Letty\". The character became so popular that Charlotte starred in the movie version So Long Letty in 1929. She appeared in dozens of films including Down Argentine Way, Star Dust, and The Gang's All Here. Charlotte was usually cast as the comedic sidekick and became one the most recognizable character actresses. During World War 2 she joined the Hollywood Victory Caravan and traveled across the country with other film stars raising money. Charlotte returned to the stage in 1950 starring in Cole Porter's Out of This World. She was a devout Christian scientist and her faith made her turn down roles she felt were too risqué. In 1955 she played Aunt Eller in the hit musical Oklahoma. Charlotte made a few more films before retiring. She and Martin enjoyed a very happy marriage until his death in 1971. Charlotte died on December 28, 1977 from natural causes. She was cremated and her ashes were scattered at sea. Since she had no children she left her personal papers to playwright William Luce.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDg2MTVmYWEtNjc4ZC00NGQwLTk0MWUtOTllODM5NmE3MzE3XkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0339307","name":"Charlotte Greenwood","nicknames":["Lady Longlegs","Letty"],"idIMDB":"nm0339307"},"actorId":"nm0339307","character":"Binnie Crawford","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"J. Carrol Naish","urlProfile":"http://www.imdb.com/name/nm0619798","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2FhODA0OTYtYTgwZi00NTI0LWI2OWMtOGFkOWM0NjI0ZWZjXkEyXkFqcGdeQXVyMzAwOTU1MTk@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 January 1896","placeOfBirth":" New York City, New York, USA","birthName":"Joseph Patrick Carrol Naish","height":"5' 8\" (1.73 m)","bio":"J. Carroll was born in New York City to Catherine Moran and Patrick Sarsfield Naish (not in the business). He was educated at St. Cecilia's Academy, New York City. He had seven years stage experience in Paris and New York. Later in stock company. First screen appearance in 1930. Fox brought him to Hollywood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2FhODA0OTYtYTgwZi00NTI0LWI2OWMtOGFkOWM0NjI0ZWZjXkEyXkFqcGdeQXVyMzAwOTU1MTk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0619798","name":"J. Carrol Naish","nicknames":["Joe"],"idIMDB":"nm0619798"},"actorId":"nm0619798","character":"Casiano","urlCharacter":"http://www.imdb.com/character/ch0448767","main":true},{"actorName":"Henry Stephenson","urlProfile":"http://www.imdb.com/name/nm0827261","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDUzMGFkMWEtOTAxMi00YzQzLWFmZTEtOTNmMDhmZjA2ZDIzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 April 1871","placeOfBirth":" Granada, British West Indies","birthName":"Henry Stephenson Garroway","height":"6' 2\" (1.88 m)","bio":"Stephenson was a firm, dignified, worldly presence in Hollywood's classic history-based films of the 30s and 40s. The tall British character actor Henry Stephenson could be both imposing and benevolent in his patrician portrayals, usually expounding words of wisdom or offering gentlemanly aid. He was born Henry S. Garroway in Granada, British West Indies on April 16, 1871 and studied at Rugby in England. His reputation was built solidly on the stage both in America and in England, making his Broadway debut around the turn of the century with \"A Message from Mars\" in 1901. While he did make a few silent pictures (from 1917), film audiences began taking a notice only in later years. After transferring a successful Broadway role to film with Cynara (1932), Stephenson settled in Hollywood where he distinguished himself in a variety of pictures for RKO, MGM and Warner Bros., among others. He appeared quite frequently in royal support for Warners' top star of the time, Errol Flynn, including Captain Blood (1935) as Lord Willoughby, The Charge of the Light Brigade (1936) as Sir Charles Macefield, The Prince and the Pauper (1937) as the Duke of Norfolk, and The Private Lives of Elizabeth and Essex (1939) as Lord Burghley. His last film was the sentimental yarn Challenge to Lassie (1949). Long married to character actress Ann Shoemaker, Stephenson died on April 24, 1956 in San Francisco, California at age 85, and was survived by his widow and daughter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDUzMGFkMWEtOTAxMi00YzQzLWFmZTEtOTNmMDhmZjA2ZDIzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0827261","name":"Henry Stephenson","idIMDB":"nm0827261"},"actorId":"nm0827261","character":"Don Diego Quintana","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kay Aldridge","urlProfile":"http://www.imdb.com/name/nm0017731","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0ODYwMDUzNV5BMl5BanBnXkFtZTgwNDk0OTc2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1917","placeOfBirth":" Tallahassee, Florida, USA","birthName":"Katharine Gratten Aldridge","bio":"This 1930's model and magazine cover-girl was employed, as often as not, as a beautiful \"living statue\" in early 40's Hollywood Technicolor items, strictly to prettify a movie set's ambience while herself saying hardly a word. On the other hand, she was also heroine (talking heroine, it should be pointed out), such as \"Nyoka the Jungle Girl,\" in 40's black-and-white \"B\" serials.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0ODYwMDUzNV5BMl5BanBnXkFtZTgwNDk0OTc2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0017731","name":"Kay Aldridge","idIMDB":"nm0017731"},"actorId":"nm0017731","character":"Helen Carson","urlCharacter":"http://www.imdb.com/character/ch0504261","main":true},{"actorName":"Leonid Kinskey","urlProfile":"http://www.imdb.com/name/nm0455893","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmY2YTUzMDgtOGVmYS00Yjc4LWE5ZWUtM2FhNjc5ZWEzZDljXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1903","placeOfBirth":" St. Petersburg, Russia","bio":"Leonid Kinskey, originally from St. Petersburg, Russia, performed across Europe and much of Latin America before his arrival in the United States. By 1932 he landed a small role as a radical in Ernst Lubitsch's comedy, Trouble in Paradise (1932). The next year he played an agitator in Duck Soup (1933). He went on to play small parts, nearly always foreigners and often comedic, in over sixty films, including Genflou in Les Misérables (1935), the snake charmer in the well-known scene from The Lives of a Bengal Lancer (1935), an Arab in The Garden of Allah (1936), Ivan in The Big Broadcast of 1938 (1938), and Pierre in That Night in Rio (1941). His final film role was Dominiwski in The Man with the Golden Arm (1955). Kinskey's most famous role was as Sascha, the humorous bartender at Rick's Cafe Americaine, in Casablanca (1942). The part had originally been given to Leon Mostovoy; Kinskey replaced him because (1) he was funnier than Mostovoy, and (2) by his own testimony, he was a drinking buddy of the star Humphrey Bogart. His contract guaranteed him two weeks at $750 a week. He died on 8 September 1998, in Fountain Hills, Arizona, aged 95.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmY2YTUzMDgtOGVmYS00Yjc4LWE5ZWUtM2FhNjc5ZWEzZDljXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0455893","name":"Leonid Kinskey","nicknames":["Mad Russian"],"idIMDB":"nm0455893"},"actorId":"nm0455893","character":"Tito Acuna","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris-Pin Martin","urlProfile":"http://www.imdb.com/name/nm0552077","urlPhoto":"","biography":{"dateOfBirth":"19 November 1893","placeOfBirth":" Tucson, Arizona, USA","birthName":"Ysabel Ponciana Chris-Pin Martin Piaz","bio":"Chris-Pin Martin was born on November 19, 1893 in Tucson, Arizona, USA as Ysabel Ponciana Chris-Pin Martin Piaz. He was an actor, known for The Ox-Bow Incident (1943), The Mark of Zorro (1940) and The Fugitive (1947). He died on June 27, 1953 in Montebello, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0552077","name":"Chris-Pin Martin","idIMDB":"nm0552077"},"actorId":"nm0552077","character":"Esteban","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Conway","urlProfile":"http://www.imdb.com/name/nm0176767","urlPhoto":"","biography":{"dateOfBirth":"12 June 1908","placeOfBirth":" Chicago, Illinois, USA","birthName":"Robert Anderson","bio":"Robert Conway was born on June 12, 1908 in Chicago, Illinois, USA as Robert Anderson. He was an actor, known for Down Argentine Way (1940), Moon Over Miami (1941) and The Cowboy and the Blonde (1941). He died on June 18, 1969 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0176767","name":"Robert Conway","idIMDB":"nm0176767"},"actorId":"nm0176767","character":"Jimmy Blake","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gregory Gaye","urlProfile":"http://www.imdb.com/name/nm0310843","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTUxYzM3ZjYtMDdlNS00ODUxLTk0ZDgtM2YzZmJkM2EzM2IwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1900","placeOfBirth":" St. Petersburg, Russian Empire [now Russia]","birthName":"Gregory De Gay","height":"6' (1.83 m)","bio":"Character actor in US films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTUxYzM3ZjYtMDdlNS00ODUxLTk0ZDgtM2YzZmJkM2EzM2IwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0310843","name":"Gregory Gaye","idIMDB":"nm0310843"},"actorId":"nm0310843","character":"Sebastian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bobby Stone","urlProfile":"http://www.imdb.com/name/nm0831764","urlPhoto":"","biography":{"dateOfBirth":"28 September 1922","placeOfBirth":" Des Moines, Iowa, USA","birthName":"Joseph Aronow","bio":"Bobby Stone was born on September 28, 1922 in Des Moines, Iowa, USA as Joseph Aronow. He was an actor and production manager, known for Pride of the Bowery (1940), Kissin' Cousins (1964) and Ghosts on the Loose (1943). He died on May 9, 1977 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0831764","name":"Bobby Stone","idIMDB":"nm0831764"},"actorId":"nm0831764","character":"Panchito","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Judels","urlProfile":"http://www.imdb.com/name/nm0431882","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYwNmVlZjEtYTc2MS00ZDg0LWEyMTctM2U0NmY2ZGVhMjI4XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 August 1882","placeOfBirth":" Amsterdam, Noord-Holland, Netherlands","bio":"Charles Judels or Charles Judel was born in Amsterdam in 1882. starred on vaudeville in the early 1900s, made his Broadway stage debut in 'The Ziegfeld Follies of 1912'. highly talented chubby man who appeared in more than 130 American comedy and drama movies, an expert with dialects served him well throughout his career, his first film was a comedy 'Old Dutch' directed by Frank Hall Crane and starring Lew Fields for the Shubert Film Co in 1915, perhaps best remembered as the cheese-store proprietor in Laurel & Hardy's 1938 film 'Swiss Miss', he also did extensive work as a voice actor in animated films most notably as the voice of Stromboli in Disney's 'Pinocchio'. His last appearance on screen as a Danite Merchant in 'Samson and Delitah' in 1949.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYwNmVlZjEtYTc2MS00ZDg0LWEyMTctM2U0NmY2ZGVhMjI4XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0431882","name":"Charles Judels","idIMDB":"nm0431882"},"actorId":"nm0431882","character":"Dr. Arturo Padilla","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fayard Nicholas","urlProfile":"http://www.imdb.com/name/nm0629379","urlPhoto":"","biography":{"dateOfBirth":"20 October 1914","placeOfBirth":" Mobile, Alabama, USA","birthName":"Fayard Antonio Nicholas","bio":"Fayard Nicholas was one-half of The Nicholas Brothers, a famous African-American tap dancing team who appeared in several movies and became one of the famous and most beloved dance team of all time. Both brothers appeared in films such as An All-Colored Vaudeville Show (1935), The Pirate (1948) and The Five Heartbeats (1991). Fayard's brother, Harold Nicholas died on July 3, 2000, while Fayard died on Januray 24, 2006.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0629379","name":"Fayard Nicholas","idIMDB":"nm0629379"},"actorId":"nm0629379","character":"One of the Nicholas Brothers","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harold Nicholas","urlProfile":"http://www.imdb.com/name/nm0629389","urlPhoto":"","biography":{"dateOfBirth":"27 March 1921","placeOfBirth":" Winston-Salem, North Carolina, USA","birthName":"Harold Lloyd Nicholas","bio":"Harold Nicholas, the younger half of the world famous Nicholas Brothers dance team, is known as one of the world's greatest dancers. He and his brother Fayard Nicholas were established superstars at Twentieth Century Fox with their astounding dance numbers in the studios musicals features. Harold was known for \"attributing spice to Fayard's grace,\" with his quick moves. Harold was a seasoned pro at age 7, appearing in everything from early 1930s Warner Bros. Vitaphone shorts with the great Eubie Blake, to receiving the prestigious Kennedy Center Honor in Washington in 1991. Carnegie Hall sold out for a tribute to he and his brother in 1998, who were both present that special night. Though he always made his astounding mid air splits and backwards somersaults seem effortless, Nicholas was much more though than a \"specialty act\" for 1940s Fox films. He was an incredible \"dancer,\" one you could watch and never tire of. The man had a something no other dancer had. Always with a smile on his face, his special charm and style gave him that extra something no other dancer had.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0629389","name":"Harold Nicholas","idIMDB":"nm0629389"},"actorId":"nm0629389","character":"One of the Nicholas Brothers","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0032410","urlIMDB":"http://www.imdb.com/title/tt0032410","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":"24","month":"06","year":"1940","remarks":null},"filmingDates":null,"copyrightHolder":"Copyright MCMXXXIX by Twentieth Century-Fox Film Corporation (on print); Twentieth Century-Fox Film Corp., 11 October 1940, LP10260 (in copyright registry)"},"technical":{"runtime":["1 hr 29 min (89 min)"],"soundMix":["Mono (Western Electric Mirrophonic Recording)"],"color":["Color (Technicolor)"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":["Technicolor"],"filmLength":["2,590.8 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.6","filmingLocations":[{"location":"Argentina"}],"rated":"APPROVED","awards":[{"award":"Academy Awards, USA 1941","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Cinematography, Color","names":[{"name":"Leon Shamroy","id":"nm0005872","role":null},{"name":"Ray Rennahan","id":"nm0005840","role":null}]},{"category":"Best Art Direction, Color","names":[{"name":"Richard Day","id":"nm0206554","role":null},{"name":"Joseph C. Wright","id":"nm0942532","role":null}]},{"category":"Best Music, Original Song","names":[{"name":"Harry Warren","id":"nm0912851","role":"music"},{"name":"Mack Gordon","id":"nm0330418","role":"lyrics"}]}]}]},{"award":"National Film Preservation Board, USA 2014","titlesAwards":[{"titleAwardOutcome":"Won National Film Registry","categories":[{"category":"National Film Preservation Board","names":[]}]}]}],"votes":"726","type":"Movie","companyCreditsSimple":[{"idCompany":"co0000756","name":"Twentieth Century Fox Film Corporation"}],"keywords":{"keywords":["american","argentina","entertainer","performer","jewelry","racetrack","pampas","orchestra","hacienda","fiesta","cigarette smoking","pre world war two","travel","high society","south america","popular music","hit parade","taxi","costume","banana","rancher","ranch","gaucho","rhumba","samba","dancing","dancer","country in title","1930s","actor shares first and last name with character","actor shares last name with character","debutante","singer","song","buenos aires argentina","love","racing","horse racing","american abroad","ambassador","tango","race fixing","new york city","wager","horse","nightclub","deception","feud","father son relationship","actor shares first name with character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:57:20"}}