{"data":{"movies":[{"title":"Fade to Black","originalTitle":"","year":"1980","releaseDate":"19801014","directors":[{"name":"Vernon Zimmerman","id":"nm0956796"}],"writers":[{"name":"Vernon Zimmerman","id":"nm0956796"}],"runtime":"102 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NDQwNTYxOV5BMl5BanBnXkFtZTYwNzIyOTc4._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Horror","Thriller"],"plot":"Shy, lonely Eric Binford delivers film cassettes and film-related supplies in Los Angeles for a living. But he really exists only to watch movies and immense himself in fantasies about cinematic characters and stars. Frequently bullied and betrayed, Eric comforts himself by pretending to be one of the many tough heroes and villains who have captivated him from the silver screen. However, his sanity takes a turn for the worse and he launches grotesque murders all patterned after characters and incidents from his beloved movies. He becomes known as the Celluloid Killer, one of the most horrifying murderers the city has ever known.","simplePlot":"A shy, lonely film buff embarks on a killing spree against those who browbeat and betray him, all the while stalking his idol, a Marilyn Monroe lookalike.","actors":[{"actorName":"Dennis Christopher","urlProfile":"http://www.imdb.com/name/nm0160550","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1OTY5NTk3MF5BMl5BanBnXkFtZTcwMTAzMzM3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 December 1955","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Dennis Carrelli","height":"5' 11\" (1.8 m)","bio":"Dennis Christopher was born on December 2, 1955 in Philadelphia, Pennsylvania, USA as Dennis Carrelli. He is an actor, known for Django Unchained (2012), Breaking Away (1979) and Chariots of Fire (1981).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1OTY5NTk3MF5BMl5BanBnXkFtZTcwMTAzMzM3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0160550","name":"Dennis Christopher","idIMDB":"nm0160550"},"actorId":"nm0160550","character":"Eric Binford","urlCharacter":"http://www.imdb.com/character/ch0214487","main":true},{"actorName":"Tim Thomerson","urlProfile":"http://www.imdb.com/name/nm0859772","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NzEyNzI4MV5BMl5BanBnXkFtZTYwNTY1MDAz._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1946","placeOfBirth":" Coronado, California, USA","birthName":"Joseph Timothy Thomerson","height":"5' 11\" (1.8 m)","bio":"Tim Thomerson rates highly as one of the best, most prolific, versatile and dependable character actors to ever grace both the big and small screens alike with pleasing regularity since the mid 70s. Although often cast as laconic rough 'n' tumble macho guys, Thomerson has proved on many occasions that he can essay comic roles and more substantial dramatic parts with equal skill and conviction. He was born on April 8th, 1946 in Coronado, California and was raised in Hawaii and San Diego. He did a stint in the National Guard prior to getting a job as a prop man and set builder at the Old Globe Theatre in San Diego. Character actor Anthony Zerbe advised Thomerson to get lessons from legendary acting teacher Stella Adler in New York; and he duly studied with Adler for four years. He began his show business career as a stand-up comedian; he performed at the clubs The Bitter End, Bud Friedman's Improvisation and Catch A Rising Star in New York and at the Comedy Store and the Improv in Los Angeles. He eventually even had a guest spot on \"The Tonight Show\" with Johnny Carson. His film debut was with a funny small role in the hilarious \"Car Wash.\" He achieved his greatest enduring cult popularity with his delightfully deadpan portrayal of rugged police detective Jack Deth in the terrific \"Trancers\" and its strictly so-so sequels. Other memorable parts include eccentric police detective Jerry Moriarty in the fine \"Fade to Black,\" weary factory worker Ray in \"Take This Job and Shove It,\" a highway patrolman in Clint Eastwood's poignant and underrated \"Honkytonk Man,\" burnt-out Vietnam vet helicopter pilot Charts in the exciting \"Uncommon Valor,\" grimy mercenary Rhodes in the cheesy \"Metalstorm: The Destruction of Jared-Syn,\" the crazed John Reynolds in \"Volunteers,\" demented cult leader Lester in \"Cherry 2000,\" the tough-as-nails the Sarge in the enjoyably quirky \"Zone Troopers;\" lovely and touching as the gentle Loy in the outstanding \"Near Dark,\" diminutive, but fearless alien lawman Brick Bardo in the funky \"Dollman,\" and a scruffy motorcyclist in Terry Gilliam's unjustly maligned \"Fear and Loathing in Las Vegas.\" Tim has appeared in a large number of films for low-budget independent director Albert Pyon and acted alongside real-life best buddy Brion James in numerous pictures (the two first met while both serving in the National Guard Reserves). On television Thomerson played the half-man, half-woman Gene-Jean on the uproarious, but sadly short-lived sci-fi parody program \"Quark.\" Thomerson also had recurring roles on the TV shows \"Sirens\" and \"Land's End\" and has made guest appearances on countless TV shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NzEyNzI4MV5BMl5BanBnXkFtZTYwNTY1MDAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0859772","name":"Tim Thomerson","idIMDB":"nm0859772"},"actorId":"nm0859772","character":"Dr. Jerry Moriarty","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gwynne Gilford","urlProfile":"http://www.imdb.com/name/nm0318522","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNjk3ODMyMl5BMl5BanBnXkFtZTcwODA3MDEzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 July 1946","placeOfBirth":" Los Angeles, California, USA","birthName":"Gloria Gwynne Gilford","bio":"Gwynne Gilford was born on July 27, 1946 in Los Angeles, California, USA as Gloria Gwynne Gilford. She is an actress, known for Fade to Black (1980), Masters of the Universe (1987) and Beware! The Blob (1972). She has been married to Robert Pine since September 6, 1969. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNjk3ODMyMl5BMl5BanBnXkFtZTcwODA3MDEzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0318522","name":"Gwynne Gilford","idIMDB":"nm0318522"},"actorId":"nm0318522","character":"Officer Anne Oshenbull","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Norman Burton","urlProfile":"http://www.imdb.com/name/nm0123680","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNjU3ODQ0MV5BMl5BanBnXkFtZTgwMTMyMTM0MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 December 1923","placeOfBirth":" New York City, New York, USA","bio":"Norman Burton is reportedly a graduate of The Actor's Studio in New York. He appeared in professional stage productions of \"Sound of Hunting\", \"Anna Christie\" and José Quintero's production of Brendan Behan's \"The Quare Fellow\" in New York City. His film and TV career ran hot and cold, varying from good roles in major films to supporting roles in grade-B outings. A surprisingly little-remembered actor, he died in 2003.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNjU3ODQ0MV5BMl5BanBnXkFtZTgwMTMyMTM0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0123680","name":"Norman Burton","idIMDB":"nm0123680"},"actorId":"nm0123680","character":"Marty Berger","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Linda Kerridge","urlProfile":"http://www.imdb.com/name/nm0449843","urlPhoto":"","biography":{"dateOfBirth":"18 November 1954","placeOfBirth":" Wagga Wagga, New South Wales, Australia","bio":"Linda Kerridge was born on November 18, 1954 in Wagga Wagga, New South Wales, Australia. She is an actress, known for Fade to Black (1980), Cocaïne (1984) and Vicious Lips (1986). She was previously married to Corey Parker.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0449843","name":"Linda Kerridge","idIMDB":"nm0449843"},"actorId":"nm0449843","character":"Marilyn O'Connor","urlCharacter":"http://www.imdb.com/character/ch0214488","main":true},{"actorName":"Morgan Paull","urlProfile":"http://www.imdb.com/name/nm0667133","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NjExMjM3OF5BMl5BanBnXkFtZTYwOTUwMzky._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 December 1944","placeOfBirth":" West Virginia, USA","bio":"Morgan Paull was born on December 15, 1944 in West Virginia, USA. He was an actor, known for Blade Runner (1982), Patton (1970) and Norma Rae (1979). He was married to Jenny Elam, April, Carmen Nelson and Gaye Huston. He died on July 17, 2012 in Ashland, Oregon, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NjExMjM3OF5BMl5BanBnXkFtZTYwOTUwMzky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0667133","name":"Morgan Paull","idIMDB":"nm0667133"},"actorId":"nm0667133","character":"Gary Bially","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Luisi","urlProfile":"http://www.imdb.com/name/nm0525403","urlPhoto":"","biography":{"dateOfBirth":"11 November 1928","placeOfBirth":" New York City, New York, USA","birthName":"James Anthony Luisi","height":"6' 2\" (1.88 m)","bio":"A native New Yorker, James Luisi attended St. Francis College in Brooklyn Heights on a basketball scholarship. He served in the Army during the Korean War. He then played one season (1953-54) with the Baltimore Bullets in the National Basketball Association. His acting career began on the stage with early parts coming in the Broadway musicals \"Sweet Charity\" and \"Zorba\". His early movies were minor, though his \"beefcake\" appeal was evident in 1973's L'évadé de l'Île du Diable (1973) in which he rarely wore a shirt. Most of his later work was on TV. In 1976 he shared a \"best actor\" daytime Emmy for playing George Washington in a daytime drama special titled First Ladies Diaries: Martha Washington (1975). Also in 1976 he started his four-season role as Jim Rockford's (James Garner) nemesis Lt. Chapman in The Rockford Files (1974). In 1983 he played the cop in charge of some street-gang-members-turned-undercover-agents in the short-lived series The Renegades (1983), which provided a boost for Patrick Swayze, who played one of the gang members. Along with guest spots on numerous TV shows, Luisi also appeared in the soap operas Days of Our Lives (1965) and Another World (1964). In the 1990s he returned to acting in and directing stage work in the Los Angeles area. Stricken with cancer he passed away on 7 June 2002 and is survived by his wife of 41 years, the former Georgia Phillips.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0525403","name":"James Luisi","idIMDB":"nm0525403"},"actorId":"nm0525403","character":"Captain M.L. Gallagher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eve Brent","urlProfile":"http://www.imdb.com/name/nm0107573","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNzEwMDc5MV5BMl5BanBnXkFtZTcwNDc0NjgyMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1929","placeOfBirth":" Houston, Texas, USA","birthName":"Jean Ann Ewers","bio":"Born in Houston, Texas, and raised in Fort Worth, Eve Brent began her career in radio and early television and later moved on to the college and little theater stage. Arriving in Hollywood with a husband and infant son in the 1950s, she landed some film (Gun Girls (1957), Journey to Freedom (1957), The Bride and the Beast (1958)) and episodic TV roles. Maverick director Samuel Fuller changed her name to Eve Brent when she appeared in his western Forty Guns (1957), the first of dozens of screen roles for her under that name. She then played Jane opposite Gordon Scott's Tarzan in Tarzan's Fight for Life (1958) and in episodes of a Tarzan TV series. In addition to her big-screen and episodic TV assignments, Brent has appeared in hundreds of commercials.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNzEwMDc5MV5BMl5BanBnXkFtZTcwNDc0NjgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0107573","name":"Eve Brent","idIMDB":"nm0107573"},"actorId":"nm0107573","character":"Aunt Stella Binford","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Steadman","urlProfile":"http://www.imdb.com/name/nm0824113","urlPhoto":"","biography":{"dateOfBirth":"20 July 1909","placeOfBirth":" Lexington, South Carolina, USA","birthName":"James Lanford Steadman","bio":"John Steadman was born on July 20, 1909 in Lexington, South Carolina, USA as James Lanford Steadman. He was an actor, known for The Hills Have Eyes (1977), The Longest Yard (1974) and Fade to Black (1980). He died on January 28, 1993 in Montrose, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0824113","name":"John Steadman","idIMDB":"nm0824113"},"actorId":"nm0824113","character":"Sam","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marcie Barkin","urlProfile":"http://www.imdb.com/name/nm0055049","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNDUwNzE4NV5BMl5BanBnXkFtZTcwMjYxNTk5OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Marcie Barkin is an actress and producer, known for Fade to Black (1980), The Van (1977) and She's Out of Control (1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNDUwNzE4NV5BMl5BanBnXkFtZTcwMjYxNTk5OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0055049","name":"Marcie Barkin","idIMDB":"nm0055049"},"actorId":"nm0055049","character":"Stacy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mickey Rourke","urlProfile":"http://www.imdb.com/name/nm0000620","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MzYwNDA2MF5BMl5BanBnXkFtZTcwNDYzMjg4Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1952","placeOfBirth":" Schenectady, New York, USA","birthName":"Philip Andre Rourke Jr.","height":"5' 11\" (1.8 m)","bio":"Mickey Rourke was born Phillip Andre Rourke, Jr. on September 16, 1952, in Schenectady, New York, the son of Annette (Cameron) and Phillip Andre Rourke. His father was of Irish and German descent, and his mother was of French-Canadian, English, and German ancestry. When he was six years old, his parents divorced. A year later, his mother married Eugene Addis, a Miami Beach police officer, and moved to Miami Shores, Florida. After graduating from Horace Mann Junior High School, Rourke's family moved to a house located on 47th Street and Prairie Avenue in Miami Beach. In 1969 Rourke attended Miami Beach Senior High School, where he played second-string first baseman under coach Skip Berkman. He also acted in a school play, \"The Serpent,\" directed by legendary \"Teacher To The Stars\" Jay W. Jensen. In 1971 he graduated from Miami Beach Senior High School, and after working for a short time as a bus boy at the famed Forge Restaurant on Miami Beach, Rourke moved back to New York to seek out a career in acting. Rourke's teenage years were more aimed toward sports more than acting. He took up self-defense training at the Boys Club of Miami. It was there he learned boxing skills and decided on an amateur career. At the age of 12, Rourke won his first boxing match as an 118-pound bantamweight, defeating Javier Villanueva. Some of his early matches were fought as Andre Rourke. He continued his boxing training at the famed 5th Street Gym in Miami Beach,soon joining the Police Athletic League boxing program. In 1969 Rourke, now weighing 140 pounds, sparred with former World Welterweight champion Luis Rodriguez. Rodriguez was the number one-rated middleweight boxer in the world and was training for his match with world champion Nino Benvenuti. Rourke claims to have received a concussion in this sparring match. In 1971, at the Florida Golden Gloves, Rourke received another concussion from a boxing match. Doctors told him to take a year off and rest. In 1972 Rourke knocked out Ron Robinson in 18 seconds and John Carver in 39 seconds. On Aug. 20, 1973, Rourke knocked out 'Sherman \"Big Train\"' Bergman' in 31 seconds. Shortly after, Rourke decided to retire from amateur boxing. From 1964 to 1973, Rourke compiled an amateur boxing record of 27 wins (17 by knockout) and 3 defeats. At one point, he reportedly scored 12 consecutive first-round knockouts. As an amateur, Rourke had been friendly with pro-boxer Tommy Torino. When Rourke decided to return to boxing as a professional in 1991, Torino promoted some of Rourke's fights. Rourke was trained by former pro-boxer Freddie Roach at Miami Beach's 5th Street Gym and the Outlaw Boxing Club Gym in Los Angeles. He made $250 for his pro debut, but by the end of his second year of boxing, he had earned a million dollars. In June 1994, Rourke appeared on the cover of World Boxing Magazine. He sparred with world champions James Toney, John David Jackson, and Tommy Morrison. Rourke wished to have 16 professional fights and then fight for a world title. However, he retired in 1994 after eight bouts and never got his desired title fight. His boxing career resulted in severe facial injuries that required a number of operations to repair his damaged face. Rourke went back to acting but worked in relative obscurity until he won a Golden Globe Award for his role as Randy \"The Ram\" Robinson in The Wrestler (2008). He was nominated for Best Actor, as well, but lost.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MzYwNDA2MF5BMl5BanBnXkFtZTcwNDYzMjg4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000620","name":"Mickey Rourke","idIMDB":"nm0000620"},"actorId":"nm0000620","character":"Richie","urlCharacter":"http://www.imdb.com/character/ch0078386","main":true},{"actorName":"Peter Horton","urlProfile":"http://www.imdb.com/name/nm0005022","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNzk0NTc5N15BMl5BanBnXkFtZTYwMTE4MjU1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 August 1953","placeOfBirth":" Bellevue, Washington, USA","birthName":"Peter William Horton","height":"6' 2\" (1.88 m)","bio":"Peter Horton was born on August 20, 1953 in Bellevue, Washington, USA as Peter William Horton. He is an actor and producer, known for Grey's Anatomy (2005), Children of the Corn (1984) and Thirtysomething (1987). He has been married to Nicole Deputron since 1995. They have two children. He was previously married to Michelle Pfeiffer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNzk0NTc5N15BMl5BanBnXkFtZTYwMTE4MjU1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005022","name":"Peter Horton","idIMDB":"nm0005022"},"actorId":"nm0005022","character":"Joey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hennen Chambers","urlProfile":"http://www.imdb.com/name/nm0150341","urlPhoto":"","biography":{"bio":"Hennen Chambers is an actor, known for Fade to Black (1980), Closet Cases of the Nerd Kind (1980) and L.A. Confidential (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0150341","name":"Hennen Chambers","idIMDB":"nm0150341"},"actorId":"nm0150341","character":"Bart","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Melinda O. Fee","urlProfile":"http://www.imdb.com/name/nm0270273","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2Y2YWU2MTAtZDQ0ZS00YjUxLThkZjQtMDlkMzJlNTQyNmQwL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjU5OTg5NDc@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 October 1942","placeOfBirth":" Los Angeles, California, USA","birthName":"Melinda Evelyn Fee","bio":"Melinda O. Fee was born on October 7, 1942 in Los Angeles, California, USA as Melinda Evelyn Fee. She is an actress, known for Guiding Light (1952), A Nightmare on Elm Street 2: Freddy's Revenge (1985) and The Young and the Restless (1973). She has been married to Steven S. Harrison since August 2, 1985.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2Y2YWU2MTAtZDQ0ZS00YjUxLThkZjQtMDlkMzJlNTQyNmQwL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjU5OTg5NDc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0270273","name":"Melinda O. Fee","idIMDB":"nm0270273"},"actorId":"nm0270273","character":"Talk Show Hostess","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anita Converse","urlProfile":"http://www.imdb.com/name/nm0176582","urlPhoto":"","biography":{"bio":"Anita Converse is an actress, known for Fade to Black (1980).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0176582","name":"Anita Converse","idIMDB":"nm0176582"},"actorId":"nm0176582","character":"Dee Dee","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0080711","urlIMDB":"http://www.imdb.com/title/tt0080711","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":[],"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 42 min (102 min)"],"soundMix":["Mono"],"color":["Color (Metrocolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panaflex Camera and Lenses by Panavision"],"laboratory":["Metrocolor"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.9","filmingLocations":[{"location":"302 Market Street, Venice, California, USA"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1981","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Eve Brent","id":"nm0107573","role":null}]}]},{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Horror Film","names":[]},{"category":"Best Actor","names":[{"name":"Dennis Christopher","id":"nm0160550","role":null}]},{"category":"Best Supporting Actress","names":[{"name":"Linda Kerridge","id":"nm0449843","role":null}]},{"category":"Best Director","names":[{"name":"Vernon Zimmerman","id":"nm0956796","role":null}]},{"category":"Best Costumes","names":[{"name":"Doris Bettencourt","id":"nm0528664","role":null}]},{"category":"Best Make-Up","names":[{"name":"Colin Booker","id":"nm1887484","role":null}]}]}]},{"award":"Taormina International Film Festival 1981","titlesAwards":[{"titleAwardOutcome":"Won Bronze Mask","categories":[{"category":"","names":[{"name":"Dennis Christopher","id":"nm0160550","role":null}]}]},{"titleAwardOutcome":"Nominated Golden Charybdis","categories":[{"category":"","names":[{"name":"Vernon Zimmerman","id":"nm0956796","role":null}]}]}]}],"votes":"2,002","type":"Movie","companyCreditsSimple":[{"idCompany":"co0309863","name":"Leisure Investment Company"},{"idCompany":"co0311848","name":"Movie Ventures"}],"keywords":{"keywords":["film geek","death","slasher","cult","violence","splatter","insanity","hollywood","female nudity","blood","masturbation","delusion","mother son relationship","cigarette smoking","nerd","movie fan","film buff","serial killer","paralytic","maniac","film fan","disturbed individual","madness","murder","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:32:11"}}