{"data":{"movies":[{"title":"Insignificance","originalTitle":"","year":"1985","releaseDate":"19850802","directors":[{"name":"Nicolas Roeg","id":"nm0001676"}],"writers":[{"name":"Terry Johnson","id":"nm0426316"}],"runtime":"110 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2MwNTkxNzAtMDcwMy00YjYzLTg4YjItZTY3NTVjNzg2ZmE4XkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Drama","Comedy"],"plot":"Four 1950's cultural icons (Albert Einstein, Marilyn Monroe, Joe DiMaggio and Senator Joseph MacCarthy) who conceivably could have met and probably didn't, fictionally do in this modern fable of post-WWII America. Visually intriguing, the film has a fluid progression of flash-backs and flash-forwards centering on the fictional Einstein's current observations, childhood memories and apprehensions for the future.","simplePlot":"Four 1950s icons meet in the same hotel room and two of them discover more in common between them than they ever anticipated.","actors":[{"actorName":"Michael Emil","urlProfile":"http://www.imdb.com/name/nm0256387","urlPhoto":"","biography":{"dateOfBirth":"1937","placeOfBirth":" London, England, UK","birthName":"Michael Emil Jaglom","bio":"Michael Emil was born in 1937 in London, England as Michael Emil Jaglom. He is an actor and production manager, known for Insignificance (1985), Can She Bake a Cherry Pie? (1983) and Sitting Ducks (1980).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0256387","name":"Michael Emil","nicknames":["Mikey"],"idIMDB":"nm0256387"},"actorId":"nm0256387","character":"Professor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Theresa Russell","urlProfile":"http://www.imdb.com/name/nm0000622","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxODQ5MDc4MF5BMl5BanBnXkFtZTcwOTM4NTY3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 March 1957","placeOfBirth":" San Diego, California, USA","birthName":"Theresa Lynn Paup","height":"5' 6½\" (1.69 m)","bio":"Theresa Russell, named one of the \"100 sexiest stars in film history\" (Empire Magazine), was born in San Diego, California. She was discovered by a photographer at the age of 12, and made her film debut in Elia Kazan's The Last Tycoon (1976), opposite Robert De Niro, Jack Nicholson and Robert Mitchum, at the age of 19. Her resume of nearly fifty films has centered on ground-breaking roles in acclaimed independent films, such as Bad Timing (1980), directed by Nicolas Roeg (whom she would later marry); Eureka (1983); Insignificance (1985); Aria (1987) and Ken Russell's Whore (1991). Her legendary star turn in the thriller, Black Widow (1987), co-starring Debra Winger, stands as one of the most iconic female crime dramas in cinema history. She has had roles in major film and television projects, including the feature films, Straight Time (1978), opposite Dustin Hoffman and Kathy Bates; The Razor's Edge (1984), opposite Bill Murray; Physical Evidence (1989) with Burt Reynolds; Kafka (1991), directed by Steven Soderbergh, playing opposite Jeremy Irons; Impulse (1990), directed by Sondra Locke; The Believer (2001), opposite Ryan Gosling; Luckytown (2000), with Kirsten Dunst and James Caan; Being Human (1994), opposite Robin Williams; Wild Things (1998), with Denise Richards, Matt Dillon and Kevin Bacon; Jolene (2008), opposite Jessica Chastain; the block-buster Spider-Man 3 (2007), and the mini-series Blind Ambition (1979), with Martin Sheen; Empire Falls (2005), with Ed Harris, Paul Newman and Helen Hunt; and Lifetime's Liz & Dick (2012), opposite Lindsay Lohan, portraying Elizabeth Taylor's mother. Along with her then-partner, legendary jazz musician, Michael Melvoin, she has performed in jazz clubs throughout the United States. She is the mother of two sons (Statten Roeg and Maximillian Roeg).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxODQ5MDc4MF5BMl5BanBnXkFtZTcwOTM4NTY3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000622","name":"Theresa Russell","idIMDB":"nm0000622"},"actorId":"nm0000622","character":"Actress","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony Curtis","urlProfile":"http://www.imdb.com/name/nm0000348","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTkwNTEyNF5BMl5BanBnXkFtZTYwNzAxNjI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 June 1925","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"Bernard Herschel Schwartz","height":"5' 9\" (1.75 m)","bio":"Tony Curtis was born Bernard Schwartz, the eldest of three children of Helen (Klein) and Emanuel Schwartz, Jewish immigrants from Hungary. Curtis himself admits that while he had almost no formal education, he was a student of the \"school of hard knocks\" and learned from a young age that the only person who ever had his back was himself, so he learned how to take care of both himself and younger brother, Julius. Curtis grew up in poverty, as his father, Emanuel, who worked as a tailor, had the sole responsibility of providing for his entire family on his meager income. This led to constant bickering between Curtis's parents over money, and Curtis began to go to movies as a way of briefly escaping the constant worries of poverty and other family problems. The financial strain of raising two children on a meager income became so tough that in 1935, Curtis's parents decided that their children would have a better life under the care of the state and briefly had Tony and his brother admitted to an orphanage. During this lonely time, the only companion Curtis had was his brother, Julius, and the two became inseparable as they struggled to get used to this new way of life. Weeks later, Curtis's parents came back to reclaim custody of Tony and his brother, but by then Curtis had learned one of life's toughest lessons: the only person you can count on is yourself. In 1938, shortly before Tony had his Bar Mitzvah, tragedy struck when Tony lost the person most important to him, when his brother, Julius, was hit by a truck and killed. After that tragedy, Curtis's parents became convinced that a formal education was the best way Tony could avoid the same never-knowing-where-your-next-meal-is-coming-from life that they had known. However, Tony rejected this because he felt that learning about literary classics and algebra wasn't going to advance him in life as much as some real hands-on life experience would. He was to find that real-life experience a few years later, when he enlisted in the navy in 1942. Tony spent the next three years getting the life experience he desired by doing everything from working as a crewman on a submarine to honing his future craft as an actor by performing as a sailor in a stage play at the Navy Signalman School in Illinois. In 1945, Curtis was honorably discharged from the navy, and when he realized that the GI Bill would allow him to go to acting school without paying for it, he now saw that his lifelong pipe dream of being an actor might actually be achievable. Curtis auditioned for the New York Dramatic Workshop, and after being accepted on the strength of his audition piece (A scene from \"Dr. Jekyll and Mr. Hyde\" in pantomime), Curtis enrolled in early 1947. He then began to pay his dues by appearing in a slew of stage productions, including \"Twelfth Night\" and \"Golden Boy\". He then connected with a small theatrical agent named Joyce Selznick, who was the niece of film producer David O. Selznick. After seeing his potential, Selznick arranged an interview for Curtis to see David O. Selznick at Universal Studios, where Curtis was offered a seven-year contract. After changing his name to what he saw as an elegant, mysterious moniker--\"Tony Curtis\" (named after the novel Anthony Adverse (1936) by Hervey Allen and a cousin of his named Janush Kertiz)--Curtis began making a name for himself by appearing in small, offbeat roles in small-budget productions. His first notable performance was a two-minute role in Criss Cross (1949), with Burt Lancaster, in which he makes Lancaster jealous by dancing with Yvonne De Carlo. This offbeat role resulted in Curtis's being typecast as a heavy for the next few years, such as playing a gang member in City Across the River (1949). Curtis continued to build up a show reel by accepting any paying job, acting in a number of bit-part roles for the next few years. It wasn't until late 1949 that he finally got the chance to demonstrate his acting flair, when he was cast in an important role in an action western, Sierra (1950). On the strength of his performance in that movie, Curtis was finally cast in a big-budget movie, Winchester '73 (1950). While he appears in that movie only very briefly, it was a chance for him to act alongside a Hollywood legend, James Stewart. As his career developed, Curtis wanted to act in movies that had social relevance, ones that would challenge audiences, so he began to appear in such movies as Spartacus (1960) and The Defiant Ones (1958). He was advised against appearing as the subordinate sidekick in Spartacus (1960), playing second fiddle to the equally famous Kirk Douglas. However, Curtis saw no problem with this because the two had recently acted together in dual leading roles in The Vikings (1958).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTkwNTEyNF5BMl5BanBnXkFtZTYwNzAxNjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000348","name":"Tony Curtis","nicknames":["Boinie"],"idIMDB":"nm0000348"},"actorId":"nm0000348","character":"Senator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Busey","urlProfile":"http://www.imdb.com/name/nm0000997","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NjM5NjE5NF5BMl5BanBnXkFtZTYwNTk3MjUz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1944","placeOfBirth":" Goose Creek, Texas, USA","birthName":"William Gary Busey","height":"6' (1.83 m)","bio":"A blond-haired, fair-complexioned actor with a toothy grin and capable of an unsettling glint in his eyes, Gary Busey was born in Goose Creek, Texas, and was raised in Oklahoma. He is the son of Sadie Virginia (Arnett), a homemaker, and Delmar Lloyd Busey, a construction design manager. He has English, as well as Irish, Scottish, and German, ancestry. He graduated from Nathan Hale High School in Tulsa, Oklahoma in 1962 and for a while was a professional musician. A talented drummer, he played in several bands, including those of country-and-western legends Leon Russell, Kris Kristofferson and Willie Nelson. Busey's first film appearance was as a biker in the low-budget Angels Hard as They Come (1971) and, over the next few years, he landed several film roles generally as a country hick/redneck or surly, rebellious types. His real breakthrough came in the dynamic film The Buddy Holly Story (1978), with Busey taking the lead role as Buddy Holly, in addition to playing guitar and singing all the vocals! His stellar performance scored him a Best Actor nomination and the attention of Hollywood taking overcasting agents. Next up, he joined fellow young actors William Katt and Jan-Michael Vincent as surfing buddies growing up together in the cult surf film Big Wednesday (1978), directed by John Milius. However, a string of appearances in somewhat mediocre films took him out of the spotlight for several years, until he played the brutal assassin Mr. Joshua trying to kill Los Angeles cops Mel Gibson and Danny Glover in the runaway mega-hit Lethal Weapon (1987). Further strong roles followed, including alongside Danny Glover once again in Predator 2 (1990). He was back on the beaches, this time tracking bank robbers with FBI agent Keanu Reeves, in Point Break - Extrême limite (1991) and nearly stole the show as a psychotic Navy officer in league with terrorists led by Tommy Lee Jones taking over the USS Missouri in the highly popular Piège en haute mer (1992). The entertaining Busey has continued to remain busy in front of the cameras and has certainly developed a minor cult following among many film fans. Plus, he's also the proud father of accomplished young actor Jake Busey, whose looks make him almost a dead ringer for his famous father.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NjM5NjE5NF5BMl5BanBnXkFtZTYwNTk3MjUz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000997","name":"Gary Busey","nicknames":["Barry Goosey"],"idIMDB":"nm0000997"},"actorId":"nm0000997","character":"The Ballplayer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Will Sampson","urlProfile":"http://www.imdb.com/name/nm0760225","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMzA4NjcyMl5BMl5BanBnXkFtZTcwMTAyNTUyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 September 1933","placeOfBirth":" Okmulgee, Oklahoma, USA","height":"6' 7\" (2.01 m)","bio":"A Native American actor of the Creek Nation, Sampson's \"big break\" came from his memorable role in One Flew Over the Cuckoo's Nest (1975) opposite Jack Nicholson. He was also starred opposite Clint Eastwood in the western The Outlaw Josey Wales (1976). He had supporting roles in Orca (1977), The White Buffalo (1977) and Fish Hawk (1979). In 1986, he co-starred in Poltergeist II: The Other Side (1986) as a Native American shaman. He died of complications from kidney failure and malnutrition during heart and lung replacement surgery in 1987 and was buried on the reservation where he grew up.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMzA4NjcyMl5BMl5BanBnXkFtZTcwMTAyNTUyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0760225","name":"Will Sampson","idIMDB":"nm0760225"},"actorId":"nm0760225","character":"Elevator Attendant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patrick Kilpatrick","urlProfile":"http://www.imdb.com/name/nm0453304","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDczMTUyOTQ2OF5BMl5BanBnXkFtZTcwMTA1NDE1OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 August 1949","placeOfBirth":" Orange, Virginia, USA","birthName":"Robert Donald Kilpatrick Jr.","height":"6' 2\" (1.88 m)","bio":"As rugged as he is genteel, 6'2\", 220-lb. Patrick Kilpatrick has been one of the finest screen/television character actors and villains of his generation, playing against a spectrum of Hollywood's leading action heroes while occasionally delivering the redemptive, even sensitively challenged, hard-edged heroic role. After nearly dying in a car crash as a teenager, he rehabilitated to the point where he could largely do his own stunts in his more than 100 films and TV projects. His action film appearances span a multitude of genres and embrace an international Who's Who of leading men: The Replacement Killers (1998) against Yun-Fat Chow; Arnold Schwarzenegger and James Caan in Eraser (1996); Last Man Standing (1996) opposite Bruce Willis; Under Siege 2: Dark Territory (1995) opposite Steven Segal; The Presidio (1988) opposite Sean Connery and Mark Harmon; two award-winning and highly rated original cable westerns opposite Tom Selleck, Last Stand at Saber River (1997) and Crossfire Trail (2001); one western opposite Sam Elliot and Kate Capshaw, HBO's Premiere Films adaptation of Louis L'Amour's The Quick and the Dead (1987); and the ever-popular action mainstay Coups pour coups (1990) opposite Jean-Claude Van Damme, as \"The Sandman\". He has even done battle with the largest mammal on earth in Free Willy 3: The Rescue (1997). The versatile Kilpatrick has played leads in everything from American Playhouse (1981) to Nicolas Roeg's masterwork Insignificance (1985) (his film debut) to William Shakespeare's \"Antony and Cleopatra\" at the Los Angeles Theater Center in the hands of Academy Award-winning director Tony Richardson. His resume includes recurring roles on such hit television shows as Dr. Quinn, Medicine Woman (1993) and Tour of Duty (1987), Dark Angel (2000), Stephen King's popular miniseries The Stand (1994), HBO's Arli$$ (1996) and many, many more. It was his work on James Cameron's \"Dark Angel\" series that led Steven Spielberg to seek him out for Minority Report (2002). In a whirlwind 18-month period Kilpatrick did five major studio films, two independents and 27 television guest star spots on 18 different shows. The pace continues to the present with appearances on Boomtown (2002), Las Vegas (2003), Blind Justice (2005), CSI: Crime Scene Investigation (2000), 24 (2001) as Secret Service Agent Dale Spaulding--the man who \"killed\" Jack Bauer\"--Criminal Minds (2005) and James Woods Shark (2006). Kilpatrick, president and CEO of Uncommon Dialogue Films, Inc. (UDF), is the writer/producer/director of the upcoming film \"Vain Attempt.\" In addition to \"Vain Attempt\" UDF has a dynamic slate of arresting movies including \"Naked Warriors\" set in the Pacific in 1943, \"Lady Pirates\", \"The End of the Onslaught\" set in WWII Germany and \"Nine Heroes in the Rape of Nanking\" set in 1937 China, plus two documentaries and a television series \"Natural Laws\" concerning US Fish and Wildlife Special Agents amidst global threat of illegal wildlife traffic and ecological calamity. He travels the world organizing film, ecological business development and acting. UDF recently hosted the Entertainment Conservation Summit in northern California, a first-time assemblage of Hollywood heavyweights and representatives of global outdoor sports and ecological groups. The UDF series \"Natural Laws\" was presented there. A single father, Kilpatrick has two sons, Ben and Sam. His interests range from politics to fashion, veterans' affairs to solar/wind energy application, gun ownership to Mohandas K. Gandhi. He has traveled to Afghanistan, the United Arab Emirates and Kyrgyzstan with the USO, entertaining troops as part of the Henry Rollins/Patrick Kilpatrick South West Asia Tour and is active with the Coalition to Salute Americas' Heroes, Brooke Army Medical Center (San Antonio, TX) and California Paralyzed Veterans. Patrick, trained as an actor by Navy Seals and the LAPD, is a member of the Sons of The American Revolution, and cam trace his ancestors back to the American colonies in the 1640s. His father received the Silver Star for his actions at the battle of Okinawa in World War II as a member of an Underwater Demolition Team (UDT), a predecessor of the Navy SEALS--the inspiration for \"Naked Warriors\". He has a strong appreciation of linguistics and global ecological development, has been known to utilize dialects while acting and has been a gastronome of organic, elegant food and beverage for 35 years.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDczMTUyOTQ2OF5BMl5BanBnXkFtZTcwMTA1NDE1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0453304","name":"Patrick Kilpatrick","idIMDB":"nm0453304"},"actorId":"nm0453304","character":"Driver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ian O'Connell","urlProfile":"http://www.imdb.com/name/nm0640079","urlPhoto":"","biography":{"dateOfBirth":"10 November 1945","placeOfBirth":" Sligo, County Sligo, Republic of Ireland","bio":"Ian O'Connell was born on November 10, 1945 in Sligo, County Sligo, Republic of Ireland. He is an actor, known for Insignificance (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0640079","name":"Ian O'Connell","idIMDB":"nm0640079"},"actorId":"nm0640079","character":"Assistant Director","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Holmes","urlProfile":"http://www.imdb.com/name/nm0391835","urlPhoto":"","biography":{"dateOfBirth":"3 June 1935","placeOfBirth":" London, England, UK","bio":"George Holmes was born on June 3, 1935 in London, England. He is an actor, known for Insignificance (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0391835","name":"George Holmes","idIMDB":"nm0391835"},"actorId":"nm0391835","character":"Actor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard M. Davidson","urlProfile":"http://www.imdb.com/name/nm0203466","urlPhoto":"","biography":{"dateOfBirth":"10 May 1940","placeOfBirth":" Hamilton, Ontario, Canada","bio":"Richard M. Davidson was born on May 10, 1940 in Hamilton, Ontario, Canada. He is an actor, known for The Hurricane (1999), Insignificance (1985) and Deeply (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0203466","name":"Richard M. Davidson","idIMDB":"nm0203466"},"actorId":"nm0203466","character":"Director of Photography","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mitchell Greenberg","urlProfile":"http://www.imdb.com/name/nm0338564","urlPhoto":"","biography":{"dateOfBirth":"19 September 1950","placeOfBirth":" Brooklyn, New York, USA","bio":"Mitchell Greenberg was born on September 19, 1950 in Brooklyn, New York, USA. He is known for his work on The Rebound (2009), Thinner (1996) and Insignificance (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0338564","name":"Mitchell Greenberg","idIMDB":"nm0338564"},"actorId":"nm0338564","character":"Technician","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Raynor Scheine","urlProfile":"http://www.imdb.com/name/nm1807200","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NzA5OTMyNV5BMl5BanBnXkFtZTcwOTUzMzExOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 January 1942","placeOfBirth":" Emporia, Virginia, USA","birthName":"Raynor Johnson","height":"5' 10\" (1.78 m)","bio":"Raynor Scheine was born on January 19, 1942 in Emporia, Virginia, USA as Raynor Johnson. He is an actor, known for Ace Ventura: Pet Detective (1994), My Cousin Vinny (1992) and Transamerica (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NzA5OTMyNV5BMl5BanBnXkFtZTcwOTUzMzExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1807200","name":"Raynor Scheine","idIMDB":"nm1807200"},"actorId":"nm1807200","character":"Autograph Hunter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jude Ciccolella","urlProfile":"http://www.imdb.com/name/nm0161980","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NzY2NzAzOV5BMl5BanBnXkFtZTcwMDc2OTkyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1947","placeOfBirth":" Burlington, Vermont, USA","birthName":"Richard Jude Ciccolella","height":"5' 10\" (1.78 m)","bio":"Jude was born in Burlington Vermont on March 11th, 1947. He spent his first three years in Middlebury Vermont where his father coached Football, Basketball and Baseball at Middlebury College. He then moved to Albany, New York, his hometown, where he would spend his formative years. After grade school at St. Catherine of Siena, He graduated from Christian Brothers Academy in 1965. He was an All City and All League first team selection in Football and Basketball, and was a member of the American Legion All Star team, and pitched in every All Star game all three years that he played. In Football he was voted the Most Valuable Player by the members of his HS team and was Captain of the Basketball team. Along with his father, Richard S. Ciccolella and his brother Thomas, Jude has been inducted into to the CBA Hall of Fame. Though as a kid Jude never participated in plays or learned to play a musical instrument and gave no obvious indication that he would make his living in the performing arts, looking back, there were signs along the way. Jude went to the movies a lot with his mother and father and his Aunt Jo, especially loving the swords and sandal epics, the sci-fi and horror films, and, of course, the westerns. He also would always have fantastic costumes designed by his mother for Halloween contests---the Pharaoh, the Monster, the Knight. He sang the tunes from the radio incessantly---trying to imitate the voices. Even in sports, it seemed to matter more that you stood at the plate like Henry Aaron, that you swung the bat like him---exactly---than whether you got a hit. Fantasy! Imitation! It was really at Brown University, though, that Jude discovered his vocation---something that, in hindsight, had been manifesting itself all along. Jude graduated from Brown with a BA in Philosophy and played football. But it was the theater department, headed by Jim Barnhill, that opened up the thespic world to Jude and pointed him toward his life goal. The campus band, Cool Clear Walter, which Jude fronted, was engendered by associations in the Theater Department-Terry Harkin (drums) and the Philosophy Department-Al Musgrave (lead guitar). After two years of social work in Albany, Jude went to Temple University in 1971 and received and MFA in Acting two years later. After a number of years in Philly writing songs, singing in pubs, doing plays, and supporting himself with stage hand work, it was time, finally---late in the game---to hit the BIG APPLE. Since he arrived, one of the lucky ones, he has earned his living on stage and screen for 35 years. For the first seven years it was tough---on call seven days a week while loading trucks to pay the bills---but there was always progress---a break here, a break there. Again, he was one of the lucky ones. He is a member of The Actors Studio and EST and is co-artistic director with Bill Bolender of The Eumenides Group, which has produced three plays in LA. He received a number of best actor awards for a short film (Last Call) which he co-produced with director Robert Bailey. The Jude Ciccolella Band has been playing for eight years in LA, playing the pop music of his generation and original stuff. He is also the composer and performer on five original CDs. Jude is married to the wonderful actress and award winning author Sylva Kelegian. They reside on the coast with their beloved dogs.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NzY2NzAzOV5BMl5BanBnXkFtZTcwMDc2OTkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0161980","name":"Jude Ciccolella","idIMDB":"nm0161980"},"actorId":"nm0161980","character":"Gaffer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lou Hirsch","urlProfile":"http://www.imdb.com/name/nm0386516","urlPhoto":"","biography":{"bio":"Lou Hirsch was born in Brooklyn, New York City, New York, USA. He is an actor, known for Who Framed Roger Rabbit (1988), My Hero (2000) and Thunderbirds (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0386516","name":"Lou Hirsch","idIMDB":"nm0386516"},"actorId":"nm0386516","character":"Charlie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ray Charleson","urlProfile":"http://www.imdb.com/name/nm0153186","urlPhoto":"","biography":{"bio":"Ray Charleson is an actor, known for United 93 (2006), Empire of the Sun (1987) and Hawk the Slayer (1980).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0153186","name":"Ray Charleson","idIMDB":"nm0153186"},"actorId":"nm0153186","character":"Bud","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joel Cutrara","urlProfile":"http://www.imdb.com/name/nm0193972","urlPhoto":"","biography":{"dateOfBirth":"22 April 1936","placeOfBirth":"","height":"5' 10\" (1.78 m)","bio":"Joel Cutrara was born on April 22, 1936. He is an actor, known for Batman (1989), Who Framed Roger Rabbit (1988) and Insignificance (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0193972","name":"Joel Cutrara","idIMDB":"nm0193972"},"actorId":"nm0193972","character":"Bar Drunk","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0089343","urlIMDB":"http://www.imdb.com/title/tt0089343","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"$110,950","country":"West","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 50 min (110 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.8","filmingLocations":[{"location":"New York City, New York, USA"}],"rated":"R","awards":[{"award":"Cannes Film Festival 1985","titlesAwards":[{"titleAwardOutcome":"Won Technical Grand Prize","categories":[{"category":"","names":[{"name":"Nicolas Roeg","id":"nm0001676","role":null}]}]},{"titleAwardOutcome":"Nominated Palme d'Or","categories":[{"category":"","names":[{"name":"Nicolas Roeg","id":"nm0001676","role":null}]}]}]}],"votes":"2,478","type":"Movie","companyCreditsSimple":[{"idCompany":"co0029168","name":"Recorded Picture Company (RPC)"},{"idCompany":"co0041491","name":"Zenith Entertainment"}],"keywords":{"keywords":["1950s","reference to marilyn monroe","reference to joseph mccarthy","reference to joe dimaggio","reference to albert einstein","skirt flying","new york city","hiroshima japan","whistle","legs","nuclear bomb","baseball","pacifism","new york","atom bomb","theory of relativity","mccarthyism","based on play","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:42:08"}}