{"data":{"movies":[{"title":"Four Guns to the Border","originalTitle":"","year":"1954","releaseDate":"1954","directors":[{"name":"Richard Carlson","id":"nm0137999"}],"writers":[{"name":"George Van Marter","id":"nm0887483"},{"name":"Franklin Coen","id":"nm0168759"}],"runtime":"83 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmViZDg2YjktOTY5NC00YmUwLTk0OGMtN2NmZDEyNTUwOTgxXkEyXkFqcGdeQXVyNTUxODQ0MDk@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Western"],"plot":"At a desert inn, Cully's outlaw gang meet former associate Simon Bhumer, now planning to retire on a farm with his wild, luscious daughter Lolly. On a stormy night, Cully and Lolly almost have an affair, broken up by Simon who still has a fast draw. But later, as the gang heads for the border after a bank robbery, they encounter the Bhumers and a band of renegade Apaches. It's soon a question of who is pursuing whom.","simplePlot":"An outlaw gang on the lam encounters former associate Simon Bhumer and his gorgeous daughter, who's drawn to their leader Cully.","actors":[{"actorName":"Rory Calhoun","urlProfile":"http://www.imdb.com/name/nm0001983","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNzM2NDQyMl5BMl5BanBnXkFtZTYwNzY4MDI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 August 1922","placeOfBirth":" Los Angeles, California, USA","birthName":"Francis Timothy Cuthbert","height":"6' 4\" (1.93 m)","bio":"Rory Calhoun was born Francis Timothy McCown in Los Angeles, the son of Elizabeth Cuthbert and James McCown. Rory starred in over 80 films and 1,000 television episodes. Before becoming an actor he worked as a boxer, a lumberjack, a truck driver and a cowpuncher. Tall and handsome, he benefited from a screen test at 20th Century-Fox, arranged for him by Sue Carol, a Hollywood agent and the wife of actor Alan Ladd, who is said to have spotted Calhoun while he was riding a horse in a Los Angeles park. He debuted on screen in Something for the Boys (1944), with Carmen Miranda, billed as \"Frank McCown\". David O. Selznick changed his name to Rory Calhoun, and after playing small parts for a while, he graduated to starring in western films, including River of No Return (1954) with Marilyn Monroe and Robert Mitchum. Calhoun's better-known pictures include How to Marry a Millionaire (1953) with Lauren Bacall, Monroe and Betty Grable, and With a Song in My Heart (1952) with Susan Hayward. From 1959 to 1960 he starred in the CBS television series The Texan (1958). More than two decades later he returned to CBS for five years as Judge Judson Tyler on the daytime serial Capitol (1982). His final appearance, 70 years old but handsome as ever, was as Ernest Tucker in Pure Country (1992). Calhoun has two stars on Hollywood's Walk of Fame: one for motion pictures, and one for television.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNzM2NDQyMl5BMl5BanBnXkFtZTYwNzY4MDI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001983","name":"Rory Calhoun","nicknames":["Smoke"],"idIMDB":"nm0001983"},"actorId":"nm0001983","character":"Cully","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Colleen Miller","urlProfile":"http://www.imdb.com/name/nm0588125","urlPhoto":"","biography":{"dateOfBirth":"10 November 1932","placeOfBirth":" Yakima, Washington, USA","bio":"The story goes that 19-year-old Colleen Miller was fishing in the California mountains when a resort photographer recruited her to pose with a prize trout; a movie scout saw the picture in print, and Colleen wound up with a small role in The Las Vegas Story (1952). A more noticeable role in Man Crazy (1953) brought the brunette beauty a contract at Universal, where she quickly became a second-rank star in westerns and film-noir. Her best notices were for Playgirl (1954), Four Guns to the Border (1954) and Man in the Shadow (1957), gaining critical praise for her fine natural talent and carefree sensuality. She retired in 1958 (except for one B-western in 1963) for a domestic life with her husband and 2 children. After her 1975 divorce she reportedly considered resuming her career, but has made no more films to date.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0588125","name":"Colleen Miller","idIMDB":"nm0588125"},"actorId":"nm0588125","character":"Lolly Bhumer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Nader","urlProfile":"http://www.imdb.com/name/nm0618865","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4MTA0OTE1N15BMl5BanBnXkFtZTcwMTYyNTEwOQ@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 October 1921","placeOfBirth":" Pasadena, California, USA","birthName":"George Garfield Nader","height":"6' 1\" (1.85 m)","bio":"Born in Pasadena, California, George Nader became interested in acting while still in school and appeared in several productions at the Pasadena Playhouse. This led to several small parts in movies before earning the lead role in the infamous 3D thriller Robot Monster (1953). The movie was bad but profitable, and Nader soon had a contract with Universal Pictures. Unfortunately, the studio already had on its roster such good-looking and athletic actors as Rock Hudson, Tony Curtis and Jeff Chandler, so Nader often found himself being cast in their leftovers, usually playing parts that emphasized his \"beefcake\" appeal. (At 6' 1\" and 180 pounds, Nader had the kind of physique fan magazines drooled over and unlike many of his colleagues, he frequently appeared with his chest hair intact.) However, he did enjoy a few good years in the mid-1950s, turning in a commendable performance in Away All Boats (1956) before his career began to decline. He tried his hand at three TV series and then relocated to Europe, where he enjoyed a modest revival in the late 1960s starring as \"Jerry Cotton\" in a series of West German films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4MTA0OTE1N15BMl5BanBnXkFtZTcwMTYyNTEwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0618865","name":"George Nader","idIMDB":"nm0618865"},"actorId":"nm0618865","character":"Bronco","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Walter Brennan","urlProfile":"http://www.imdb.com/name/nm0000974","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNzA5NjE1MF5BMl5BanBnXkFtZTYwMTMxMTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 July 1894","placeOfBirth":" Lynn, Massachusetts, USA","birthName":"Walter Andrew Brennan","height":"6' (1.83 m)","bio":"In many ways the most successful and familiar character actor of American sound films and the only actor to date to win three Oscars for Best Supporting Actor, Walter Brennan attended college in Cambridge, Massachusetts, studying engineering. While in school he became interested in acting and performed in school plays. He worked some in vaudeville and also in various jobs such as clerking in a bank and as a lumberjack. He toured in small musical comedy companies before entering the military in 1917. After his war service he went to Guatemala and raised pineapples, then migrated to Los Angeles, where he speculated in real estate. A few jobs as a film extra came his way beginning in 1923, then some work as a stuntman. He eventually achieved speaking roles, going from bit parts to substantial supporting parts in scores of features and short subjects between 1927 and 1938. In 1936 his role in Come and Get It (1936) won him the very first Best Supporting Actor Academy Award. He would win it twice more in the decade, and be nominated for a fourth. His range was enormous. He could play sophisticated businessmen, con artists, local yokels, cowhands and military officers with apparent equal ease. An accident in 1932 cost him most of his teeth, and he most often was seen in eccentric rural parts, often playing characters much older than his actual age. His career never really declined, and in the 1950s he became an even more endearing and familiar figure in several television series, most famously The Real McCoys (1957). He died in 1974 of emphysema, a beloved figure in movies and TV, the target of countless comic impressionists, and one of the best and most prolific actors of his time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNzA5NjE1MF5BMl5BanBnXkFtZTYwMTMxMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000974","name":"Walter Brennan","idIMDB":"nm0000974"},"actorId":"nm0000974","character":"Simon Bhumer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nina Foch","urlProfile":"http://www.imdb.com/name/nm0001225","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjAxMTc1NDMzMl5BMl5BanBnXkFtZTcwNTE1NjEwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1924","placeOfBirth":" Leiden, Zuid-Holland, Netherlands","birthName":"Nina Consuelo Maud Fock","height":"5' 9\" (1.75 m)","bio":"A leading lady of the 1940s, the tall and blonde Foch usually played cool, aloof and often foreign, women of sophistication. As film roles became harder to find, Foch proved to be versatile in many areas. She was a panelist on several TV quiz shows, worked as George Stevens' assistant director for The Diary of Anne Frank (1959) and directed plays. Since the 1960s, she has been an acting teacher for USC and the American Film Institute.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjAxMTc1NDMzMl5BMl5BanBnXkFtZTcwNTE1NjEwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001225","name":"Nina Foch","idIMDB":"nm0001225"},"actorId":"nm0001225","character":"Maggie Flannery","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John McIntire","urlProfile":"http://www.imdb.com/name/nm0570615","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0Mjc4MDc3OF5BMl5BanBnXkFtZTcwODU0NzQ5Ng@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 June 1907","placeOfBirth":" Spokane, Washington, USA","birthName":"John Herrick McIntire","height":"6' (1.83 m)","bio":"John McIntire possessed the requisite grit, craggy features and crusty, steely-eyed countenance to make for one of television and film's most durable supporting players of western settings. Born in Spokane, Washington in 1907 and the son of a lawyer, he grew up in Montana where he learned to raise and ride broncos on the family homestead. After two years at USC, he spent some time out at sea before turning his attentions to entertainment and the stage. As a radio announcer, he gained quite a following announcing on the \"March of Time\" broadcasts. In the late 1940s, John migrated west and found a niche for himself in rugged oaters and crimers. Normally the politicians, ranchers and lawmen he portrayed could be counted on for their integrity, maturity and worldly wise, no-nonsense approach to life such as in Black Bart (1948), Down to the Sea in Ships (1949), The Asphalt Jungle (1950), Saddle Tramp (1950) and The World in His Arms (1952). However, director Anthony Mann tapped his versatility and gave him a few shadier, more interesting villains to play in three of his top-notch western films: Winchester '73 (1950), The Far Country (1954) and The Tin Star (1957). Television helped John gain an even stronger foothold in late 1950s Hollywood. Although his character was killed off on the Naked City (1958) program, he became a familiar face in two other classic western series. He won the role of Christopher Hale in 1961 after Wagon Train (1957) series' star Ward Bond died, and then succeeded the late Charles Bickford in The Virginian (1962) in 1967 playing Bickford's brother, Clay Grainger, for three years. John's deep, dusty, resonant voice was utilized often for narratives and documentaries. In the ensuing years, he and his longtime wife, actress Jeanette Nolan, became the Ossie Davis and Ruby Dee of the sagebrush set, appearing together as the quintessential frontier couple for decades and decades. They were married for 56 years until John's death of emphysema in 1991. They both outlived their son, Tim McIntire, a strapping, imposing actor himself, who died in 1986 of heart problems.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0Mjc4MDc3OF5BMl5BanBnXkFtZTcwODU0NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0570615","name":"John McIntire","idIMDB":"nm0570615"},"actorId":"nm0570615","character":"Dutch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Drake","urlProfile":"http://www.imdb.com/name/nm0236866","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDdhODA5MjgtODcyOS00YjM0LWE4Y2QtZDE2MDhkZTQ3NWRlXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 October 1917","placeOfBirth":" New York City, New York, USA","birthName":"Charles Rupert","height":"6' 2\" (1.88 m)","bio":"Personable actor Charles Drake was born Charles Ruppert on October 2, 1917, in New York City. He graduated from Nichols College in 1937 and initially became a salesman before switching to acting in 1939 and appearing in little theater productions. He changed his stage name to the more suitable Charles Drake and in the late 1930s managed to snag a contract with Warner Brothers. Drake started apprenticing in small, often unbilled roles in what would become enduring WWII-era classics: The Hunchback of Notre Dame (1939), The Maltese Falcon (1941), The Man Who Came to Dinner (1942), Now, Voyager (1942), Sergeant York (1941), and Yankee Doodle Dandy (1942), but did not rise suitably in billing rank during that time. Military service interrupted his career in 1943, but he returned to Hollywood within a couple of years sans his Warner's contract. Following a slight lull in the freelancing department, he was finally picked up by Universal and actually found better work in still somewhat standardized roles. He played Dr. Sanderson in Harvey (1950), the villain in You Never Can Tell (1951), and Shelley Winters' cowardly boyfriend in Winchester '73 (1950), among others. He also became a top supporting player in the westerns and war pics of Audie Murphy, who became a good friend offstage. In 1955, Drake turned to television as one of the stock-company players on Robert Montgomery Presents (1950) and a couple of years later became the host of the weekly British TV espionage series Rendezvous (1957). Although he played in over 80 films (mostly dramatic fare) between the years 1939 and 1975, he did not become a star. He continued on as a rather unobtrusive character actor in the 1960s and appeared in such innocuous fare as Tammy Tell Me True (1961) and Valley of the Dolls (1967) (as suitor Kevin Gilmore), while showing up occasionally as assorted high-rankers in such films as The Arrangement (1969) and The Seven Minutes (1971). He finished off his career on TV before retiring. Drake died in 1994 at age 76.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDdhODA5MjgtODcyOS00YjM0LWE4Y2QtZDE2MDhkZTQ3NWRlXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0236866","name":"Charles Drake","idIMDB":"nm0236866"},"actorId":"nm0236866","character":"Jim Flannery","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jay Silverheels","urlProfile":"http://www.imdb.com/name/nm0798855","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzgwMjA1MjA0MF5BMl5BanBnXkFtZTcwNDA1MjIyOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1912","placeOfBirth":" Six Nations Reservation, Brantford, Ontario, Canada","birthName":"Harold J. Smith","height":"6' (1.83 m)","bio":"Jay Silverheels was born on Canada's Six Nation's Reserve and was one of 10 children. He was a star lacrosse player and a boxer before he entered films as a stuntman in 1938. He worked in a number of films through the 1940s before gaining notice as the Osceola brother in a Humphrey Bogart film Key Largo (1948). Most of Silverheels' roles consisted of bit parts as an Indian character. In 1949, he worked in the movie The Cowboy and the Indians (1949) with another \"B movie\" actor Clayton Moore. Later that year, Silverheels was hired to play the faithful Indian companion, Tonto, in the TV series The Lone Ranger (1949) series, which brought him the fame that his motion picture career never did. Silverheels recreated the role of Tonto in two big-screen color movies with Moore,The Lone Ranger (1956) and The Lone Ranger and the Lost City of Gold (1958). After the TV series ended in 1957, Silverheels could not escape the typecasting of Tonto. He would continue to appear in an occasional film and television show but became a spokesperson to improve the portrayal of Indians in the media.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzgwMjA1MjA0MF5BMl5BanBnXkFtZTcwNDA1MjIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0798855","name":"Jay Silverheels","idIMDB":"nm0798855"},"actorId":"nm0798855","character":"Yaqui","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nestor Paiva","urlProfile":"http://www.imdb.com/name/nm0656980","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU1NTMzODgxOF5BMl5BanBnXkFtZTgwMzQzNTQ1MjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 June 1905","placeOfBirth":" Fresno, California, USA","birthName":"Nestor Caetano Paiva","bio":"Veteran character actor Nestor Paiva had one of those nondescript ethnic mugs and a natural gift for dialects that allowed him to play practically any type of foreigner. Born in Fresno, California, he graduated from the University of California at Berkeley and developed an interest in performing while hooking up with college theatrics. Making his debut in a production of \"Antigone,\" he played in a Los Angeles production of \"The Drunkard\" for 11 years, finally leaving the show as his workload grew in number and importance in the mid-40s. Film buffs remember him as the main villain, \"The Scorpion\" in the wartime classic serial \"Don Winslow of the Coast Guard\" (1943). In hundreds of film and TV roles from 1938-67 and in an overall career that spanned 40 years, the bald, dark and bulky Paiva played everything from Spaniards, Greeks, Russians and Portuguese to Italians, Indians, Arabs and even African-Americans (the latter on radio). Some were shifty, others excitable, many quite hilarious...and many of them undeserving and small. He died in 1966.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU1NTMzODgxOF5BMl5BanBnXkFtZTgwMzQzNTQ1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0656980","name":"Nestor Paiva","idIMDB":"nm0656980"},"actorId":"nm0656980","character":"Greasy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mary Field","urlProfile":"http://www.imdb.com/name/nm0275997","urlPhoto":"","biography":{"dateOfBirth":"10 June 1909","placeOfBirth":" New York City, New York, USA","bio":"Mary Field was born on June 10, 1909 in New York City, New York, USA. She was an actress, known for Song of the South (1946), Ball of Fire (1941) and I Married a Witch (1942). She was married to James Madison Walters II. She died on June 12, 1996 in Fairfax, Virginia, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0275997","name":"Mary Field","nicknames":["Character Actress Extraordinaire"],"idIMDB":"nm0275997"},"actorId":"nm0275997","character":"Mrs. Pritchard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert F. Hoy","urlProfile":"http://www.imdb.com/name/nm0398338","urlPhoto":"","biography":{"dateOfBirth":"3 April 1927","placeOfBirth":" New York City, New York, USA","birthName":"Robert Francis Hoy","bio":"Robert F. Hoy was equally at home as a stuntman and as an actor. He appeared as Joe Butler on the acclaimed TV Western, The High Chaparral. He stunt-doubled for Charles Bronson, Tony Curtis, Robert Forrester, Ross Martin, Tyrone Power, David Jansen, Telly Savalas, Charles McGraw, Jay Silverheels and Abby Lane. His acting roles in many films included: Bite the Bullet, The Outlaw Josey Wales, The Lone Ranger, Gambler II, Nevada Smith, Bronco Billy, The Enforcer, The Great Race, and TV shows such as Wanted Dead or Alive, Walker Texas Ranger, JAG, Dallas (recurring role), The Wild Wild West, Magnum P.I. (five episodes), The Young Riders, and Zorro. He was the 2nd Unit Director and Stunt Coordinator in Spain on the TV series Zorro and on the pilot of The Three Musketeers. In his work as a stuntman, Bob specialized in horse work, although he was also called upon to double in fight scenes, do car work and handle high falls. The films in which lead actors and others were doubled for stunts are too numerous to mention but include: Operation Petticoat, The Defiant Ones, Spartacus, Tobruk, They Call Me Bruce, Saskatchewan, River of No Return, To Hell and Back, Drumbeat, Wings of the Hawk, and Revenge of the Creature From the Black Lagoon. With stunt credits on more than 30 television series and twice that many features, there is no doubt that Bob earned his lifetime membership in the Stuntmen's Association, of which he was a founding member. He was also a member of the Academy of Motion Pictures, Arts and Sciences, Directors Guild of America, AFTRA, and the Screen Actors Guild.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0398338","name":"Robert F. Hoy","nicknames":["Bobby"],"idIMDB":"nm0398338"},"actorId":"nm0398338","character":"Smitty","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bob Herron","urlProfile":"http://www.imdb.com/name/nm0380787","urlPhoto":"","biography":{"dateOfBirth":"23 September 1924","placeOfBirth":" Lomita, California, USA","height":"5' 10\" (1.78 m)","bio":"Bob Herron was born on September 23, 1924 in Lomita, California, USA. He is known for his work on L.A. Confidential (1997), The Untouchables (1987) and The Goonies (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0380787","name":"Bob Herron","idIMDB":"nm0380787"},"actorId":"nm0380787","character":"Evans","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Regis Parton","urlProfile":"http://www.imdb.com/name/nm0664017","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMTY5NzI2N15BMl5BanBnXkFtZTgwNjcyMjkyMjE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1917","placeOfBirth":" Johnstown, Pennsylvania, USA","birthName":"Regis Parton","bio":"Regis Parton was born on January 27, 1917 in Johnstown, Pennsylvania, USA. He is known for his work on The Monster Squad (1987), The Stunt Man (1980) and The Love Bug (1968). He died on May 31, 1996 in Riverside, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMTY5NzI2N15BMl5BanBnXkFtZTgwNjcyMjkyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0664017","name":"Regis Parton","nicknames":["Reggie"],"idIMDB":"nm0664017"},"actorId":"nm0664017","character":"Cashier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Donald Kerr","urlProfile":"http://www.imdb.com/name/nm0449676","urlPhoto":"","biography":{"dateOfBirth":"5 August 1891","placeOfBirth":" Eagle Grove, Iowa, USA","bio":"Donald Kerr was born on August 5, 1891 in Eagle Grove, Iowa, USA. He was an actor, known for The Devil Bat (1940), Four Daughters (1938) and Flash Gordon's Trip to Mars (1938). He died on January 25, 1977 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0449676","name":"Donald Kerr","idIMDB":"nm0449676"},"actorId":"nm0449676","character":"Town Loafer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0046994","urlIMDB":"http://www.imdb.com/title/tt0046994","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Universal Pictures Co., Inc. (original), U.S. Copyright LP4001, 17 September 1954"},"technical":{"runtime":["1 hr 23 min (83 min)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Color (Technicolor)"],"aspectRatio":["1.37 : 1 (master ratio)","1.85 : 1 (intended ratio)"],"camera":null,"laboratory":["Technicolor (color by)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.1","filmingLocations":[{"location":"Apple Valley, California, USA"}],"rated":"APPROVED","awards":[{"award":"Golden Globes, USA 1955","titlesAwards":[{"titleAwardOutcome":"Won Golden Globe","categories":[{"category":"Most Promising Newcomer - Male","names":[{"name":"George Nader","id":"nm0618865","role":null}]}]}]}],"votes":"222","type":"Movie","companyCreditsSimple":[{"idCompany":"co0021358","name":"Universal International Pictures (UI)"}],"keywords":{"keywords":["gang","outlaw","apache","desert","bank robbery","yaqui indian","brawl","shootout","rain","lasso","fistfight","knife thrower","year 1881","father daughter relationship","gunfight","posse","sheriff","rivalry","indian attack","bandit","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 23:53:20"}}