{"data":{"movies":[{"title":"Only When I Larf","originalTitle":"","year":"1968","releaseDate":"19681023","directors":[{"name":"Basil Dearden","id":"nm0213136"}],"writers":[{"name":"John Salmon","id":"nm0758778"},{"name":"Patrick Tilley","id":"nm0863352"}],"runtime":"104 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNjA0NTE3OV5BMl5BanBnXkFtZTYwODI3ODg5._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Comedy","Crime","Adventure"],"plot":"A master conman leads a pair of British accomplices on an international adventure of highly profitable dirty tricks.","simplePlot":"A master conman leads a pair of British accomplices on an international adventure of highly profitable dirty tricks.","actors":[{"actorName":"Richard Attenborough","urlProfile":"http://www.imdb.com/name/nm0000277","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDQzMTAwN15BMl5BanBnXkFtZTcwNTI4NTgwMw@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 August 1923","placeOfBirth":" Cambridge, Cambridgeshire, England, UK","birthName":"Richard Samuel Attenborough","height":"5' 7\" (1.7 m)","bio":"Lord Richard Attenborough was born in Cambridge, England, the son of Mary (née Clegg), a founding member of the Marriage Guidance Council, and Frederick Levi Attenborough, a scholar and academic administrator who was a don at Emmanuel College and wrote a standard text on Anglo-Saxon law. Attenborough was educated at Wyggeston Grammar School for Boys in Leicester and at the Royal Academy of Dramatic Art (RADA). His film career began with a role as a deserting sailor in In Which We Serve (1942), a part that contributed to his being typecast for many years as a coward in films like Dulcimer Street (1948), Operation Disaster (1950) and his breakthrough role as a psychopathic young gangster in the film adaptation of Graham Greene's novel, Brighton Rock (1947). During World War II, Attenborough served in the Royal Air Force. He worked prolifically in British films for the next 30 years, and in the 1950s appeared in several successful comedies for John Boulting and Roy Boulting, including Private's Progress (1956) and I'm All Right Jack (1959). Early in his stage career, Attenborough starred in the London West End production of Agatha Christie's \"The Mousetrap\", which went on to become one of the world's longest-running stage productions. Both he and his wife were among the original cast members of the production, which opened in 1952 and (as of 2007) is still running. In the 1960s, he expanded his range of character roles in films such as Seance on a Wet Afternoon (1964) and Guns at Batasi (1964), for which he won the BAFTA Award for Best Actor for his portrayal of the regimental Sergeant Major. He appeared in the ensemble cast of The Great Escape (1963), as Squadron Leader \"Roger Bartlett\" (\"Big X\"), the head of the escape committee. In 1967 and 1968, he won back-to-back Golden Globe Awards in the category of Best Supporting Actor, the first time for The Sand Pebbles (1966), starring Steve McQueen, and the second time for Doctor Dolittle (1967), starring Rex Harrison. He would win another Golden Globe for Best Director, for Gandhi (1982), in 1983. Six years prior to \"Gandhi\", he played the ruthless \"Gen. Outram\" in Indian director Satyajit Ray's period piece, Les joueurs d'échecs (1977). He has never been nominated for an Academy Award in an acting category. He took no acting roles following his appearance in Otto Preminger's The Human Factor (1979), until his appearance as the eccentric developer \"John Hammond\" in Steven Spielberg's Jurassic Park (1993). The following year, he starred as \"Kris Kringle\" in Miracle on 34th Street (1994), a remake of the 1947 classic. Since then, he has made occasional appearances in supporting roles, including the historical drama, Elizabeth (1998), as \"Sir William Cecil\". In the late 1950s, Attenborough formed a production company, \"Beaver Films\", with Bryan Forbes and began to build a profile as a producer on projects, including The League of Gentlemen (1960), The Angry Silence (1960) and Whistle Down the Wind (1961), also appearing in the first two of these as an actor. His feature film directorial debut was the all-star screen version of the hit musical, Oh! What a Lovely War (1969), and his acting appearances became more sporadic - the most notable being his portrayal of serial killer \"John Christie\" in 10 Rillington Place (1971). He later directed two epic period films: Young Winston (1972), based on the early life of Winston Churchill, and A Bridge Too Far (1977), an all-star account of Operation Market Garden in World War II. He won the 1982 Academy Award for Directing for his historical epic, Gandhi (1982), a project he had been attempting to get made for many years. As the film's producer, he also won the Academy Award for Best Picture. His most recent films, as director and producer, include Chaplin (1992), starring Robert Downey Jr. as Charles Chaplin, and Shadowlands (1993), based on the relationship between C.S. Lewis and Joy Gresham. Both films starred Anthony Hopkins, who also appeared in three other films for Attenborough: \"Young Winston\", \"A Bridge Too Far\" and the thriller, Magic (1978). Attenborough also directed the screen version of the hit Broadway musical, \"A Chorus Line\" (A Chorus Line (1985)), and the apartheid drama, Cry Freedom (1987), based on the experiences of Donald Woods. He was nominated for a Golden Globe Award for Best Director for both films. His most recent film as director was another biographical film, Grey Owl (1999), starring Pierce Brosnan. Attenborough is the President of RADA, Chairman of Capital Radio, President of BAFTA, President of the Gandhi Foundation, and President of the British National Film and Television School. He is also a vice patron of the Cinema and Television Benevolent Fund. He is also the patron of the UWC movement (United World Colleges), whereby he continually contributes greatly to the colleges that are part of the organization. He has frequented the United World College of Southern Africa(UWCSA) Waterford Kamhlaba. His wife and he founded the \"Richard and Sheila Attenborough Visual Arts Center\". He also founded the \"Jane Holland Creative Center for Learning\" at Waterford Kamhlaba in Swaziland in memory of his daughter, who died in the Tsunami on Boxing Day, 2004. He passionately believes in education, primarily education that does not judge upon color, race, creed or religion. His attachment to Waterford is his passion for non-racial education, which were the grounds on which Waterford Kamhlaba was founded. Waterford was one of his inspirations for directing Cry Freedom (1987), based on the life of Steve Biko. He was elected to the post of Chancellor of the University of Sussex on 20 March 1998, replacing the Duke of Richmond and Gordon. A lifelong supporter of Chelsea Football Club, Attenborough served as a director of the club from 1969-1982 and, since 1993, has held the honorary position of Life Vice President. He is also the head of the consortium, \"Dragon International\", which is constructing a film and television studio complex in Llanilid, Wales, often referred to as \"Valleywood\". In 1967, he was made a Commander of the Order of the British Empire (CBE). He was knighted in 1976 and, in 1993, he was made a life peer as Baron Attenborough, of Richmond-upon-Thames in the London Borough of Richmond upon Thames. On 13 July 2006, Attenborough and his brother, David Attenborough, were awarded the titles of Distinguished Honorary Fellows of the University of Leicester \"in recognition of a record of continuing distinguished service to the University\". Lord Attenborough is also listed as an Honorary Fellow of Bangor University for his continued efforts to film making. Attenborough has been married to English actress Sheila Sim, since 1945. They had three children. In December 2004, his elder daughter, Jane Holland, as well as her daughter Lucy and her mother-in-law, also named Jane, were killed in the tsunami caused by the Indian Ocean earthquake. A memorial service was held on 8 March 2005, and Attenborough read a lesson at the national memorial service on 11 May 2005. His grandson, Samuel Holland, and granddaughter, Alice Holland, also read in the service. Attenborough's father was principal of University College, Leicester, now the city's university. This has resulted in a long association with the university, with Lord Attenborough a patron. A commemorative plaque was placed on the floor of Richmond Parish Church. The university's \"Richard Attenborough Centre for Disability and the Arts\", which opened in 1997, is named in his Honor. His son, Michael Attenborough, is also a director. He has two younger brothers, the famous naturalist Sir David Attenborough and John Attenborough, who has made a career in the motor trade. He has collected Pablo Picasso ceramics since the 1950s. More than 100 items went on display at the New Walk Museum and Art Gallery in Leicester in 2007; the exhibition is dedicated to his family members lost in the tsunami.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDQzMTAwN15BMl5BanBnXkFtZTcwNTI4NTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000277","name":"Richard Attenborough","nicknames":["Dickie, Bunter."],"idIMDB":"nm0000277"},"actorId":"nm0000277","character":"Silas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Hemmings","urlProfile":"http://www.imdb.com/name/nm0376101","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3OTY3Mjk2NV5BMl5BanBnXkFtZTYwOTkyNTM2._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1941","placeOfBirth":" Guildford, Surrey, England, UK","birthName":"David Leslie Edward Hemmings","height":"5' 8\" (1.73 m)","bio":"David Hemmings, one of the great English cinema icons of the 1960s, was born in Guildford, Surrey, on November 18, 1941, to a cookie merchant and his wife. He was educated at Glyn College, Epsom, but while still a child, Hemmings made his first forays into the world of entertainment. An accomplished singer, he toured as a boy soprano with the English Opera Group, famed for his performances of the works of Benjamin Britten. Britten, who befriended the youngster, wrote some roles specifically for Hemmings, including that of \"Miles\" in \"The Turn of the Screw\". Hemmings subsequently took up painting after his career as a soprano was ended by his transit through puberty. He studied painting at the Epsom School of Art, where he staged the first exhibition of his work at the school when he was 15 years old. Hemmings made his film debut in 1954, with The Rainbow Jacket (1954) for Ealing Studios. He also had bit part in Otto Preminger's 1957 version of Saint Joan (1957). In his 20s, he returned to singing, appearing at nightclubs before concentrating on the stage and the cinema. As the youth culture hit Britain in the late 50s (the Notting Hill race riots of August 1958 limned in Julien Temple's 1986 film Absolute Beginners (1986) being a kind of bookmark signaling its arrival), Hemmings was in the right place at the right time to capitalize on his skills and looks. Boyish-looking, with large, protuberant blue eyes covered with heavy lids, his face was at once startling and decadent while simultaneously conveying an air of fragility. He starred in pop music movies Sing and Swing (1963) and Be My Guest (1965), as well as co-starring in one of Michael Winner's first films, The Girl-Getters (1964), with Oliver Reed. The 24-year-old Hemmings desperately wanted what would become his career-defining role, as the morally jaded fashion photographer Thomas in master-director Michelangelo Antonioni's Blow-Up (1966). He was up against the crème of British actors, including Terence Stamp, who already had an Oscar nomination under his belt and was conventionally handsome. Hemmings thought he had blown his audition as Antonioni shook his head constantly throughout his audition. However, he later found out the great director had a mild form of Tourette's which caused him to move his head from side to side. The role made him a star and, for a while, a darling of the pop culture filmmaking that was expected to revolutionize the English-speaking cinema in the 1960s, after the 1964 Best Picture Oscar-win of Tony Richardson's Tom Jones (1963). He was cast as Mordred in the big-screen adaptation of Lerner & Lowe's musical Camelot (1967) with Richard Harris and Hemmings Blow-Up (1966) co-star Vanessa Redgrave to critically panned results. The same year that \"Camelot\" was released (1967), he put out a pop single (\"Back Street Mirror\") and an album, \"David Hemmings Happens\", recorded in Los Angeles. His album was produced by Jim Dickinson, the early producer of The Byrds, and featured instrumental backing by several members of group. It was re-released on CD in 2005. In 1968, he appeared as Dildano opposite Jane Fonda (in her incarnation as a sexpot) in Roger Vadim's kitsch klassic Barbarella (1968). However, to reduce stereotyping and his identification with pop culture filmmaking, he took on the role of the anti-hero Captain Nolan in Tony Richardson's masterful satire The Charge of the Light Brigade (1968) and later, the eponymous role in Alfred the Great (1969). While both films were imbued with the counter-cultural attitudes of their times, the roles themselves were rather straightforward. Hemmings had reached the summit of his career as an actor. These were the heights he never reached again. As the quality of his roles declined, Hemmings turned more to directing. He had directed his first film in 1972, helming the thriller Running Scared (1972) which starred Gayle Hunnicutt, his wife from 1968 to 1974. Hemmings also co-wrote the script. In the 1970s, he had relocated to Malibu, California to live with Hunnicutt, and the fabled beach community which was his home for the next generation. In 1975, he starred as Bertie Wooster in the Andrew Lloyd Webber musical, \"Jeeves\", one of Lord Webber's few flops. Hemmings formed the independent production company Hemdale Corp. with his business partner, John Daly, in the early 1970s as a tax shelter. He was able to use Hemdale and his role as a producer to vivify his directing career. In 1979, Hemmings the director first attracted major attention with Just a Gigolo (1978), but the film was a flop in spite of its interesting cast. After directing the 1981 adventure film Treasure of the Yankee Zephyr (1981) and an adaptation of James Herbert's novel \"The Survivor\", he focused on TV directing. He soon became one of the top directors of American action TV programs, including The A-Team (1983), Airwolf (1984), Magnum, P.I. (1980) and Quantum Leap (1989). However, in the nineties, he abandoned directing, and returned to live in the UK. The role of \"Cassius\" in Gladiator (2000) heralded his full-time return to acting. He was also memorable in a small role in Martin Scorsese's Gangs of New York (2002). But it was his last major role, in the cinema adaption of Graham Swift's Last Orders (2001), that showed Hemmings at the top of his talent. Unrecognizable from the boy-man of 1966-70, he was memorable as the ex-boxer who ruefully remembers the past with his remaining buddies as they travel to throw the ashes of a departed friend into the sea. That two of the other major roles were filled by Michael Caine and Tom Courtenay, two other British actors whose careers first flourished in the 1960s, added to the poignancy of this tale of men trying to recapture lost time. He also appeared, less memorably, in The League of Extraordinary Gentlemen (2003) opposite the ultimate 60s male British cinema icon, Sean Connery. David Hemmings died of a heart attack on December 3, 2003, in Bucharest, Romania, on the set of Blessed (2004), after playing his scenes for the day. He was 62 years old. His autobiography, \"Blow Up... and Other Exaggerations\" was published in 2004.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3OTY3Mjk2NV5BMl5BanBnXkFtZTYwOTkyNTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0376101","name":"David Hemmings","idIMDB":"nm0376101"},"actorId":"nm0376101","character":"Bob","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexandra Stewart","urlProfile":"http://www.imdb.com/name/nm0829155","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDlmMmZiNmItOTJjZi00ZGU1LThlYjgtNGM2YjE5ODlhNzcyXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1939","placeOfBirth":" Montreal, Quebec, Canada","height":"5' 6\" (1.68 m)","bio":"Alexandra Stewart was born in Quebec in 1939 and went to Paris in 1958 to study art. Less than one year later, she appeared in her first feature film, Les motards (1959). In her long career, she has appeared in many films, including: Otto Preminger's Exodus (1960), Louis Malle's The Fire Within (1963) (aka The Fire Within) and Black Moon (1975) (Stewart has a child by Malle), Arthur Penn's Mickey One (1965) with Warren Beatty, François Truffaut's The Bride Wore Black and Day For Night, In Praise of Older Women (1978), Intimate Moments, Women, Prince's Under the Cherry Moon (1986) with Prince and Kristin Scott Thomas and Roman Polanski's Frantic (1988).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDlmMmZiNmItOTJjZi00ZGU1LThlYjgtNGM2YjE5ODlhNzcyXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0829155","name":"Alexandra Stewart","idIMDB":"nm0829155"},"actorId":"nm0829155","character":"Liz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicholas Pennell","urlProfile":"http://www.imdb.com/name/nm0672077","urlPhoto":"","biography":{"dateOfBirth":"19 November 1938","placeOfBirth":" Brixham, England, UK","bio":"Nicholas Pennell was born on November 19, 1938 in Brixham, England. He was an actor, known for Satie and Suzanne (1994), Battle of Britain (1969) and Isadora (1968). He died on February 22, 1995 in Stratford, Ontario, Canada.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0672077","name":"Nicholas Pennell","idIMDB":"nm0672077"},"actorId":"nm0672077","character":"Spencer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Melissa Stribling","urlProfile":"http://www.imdb.com/name/nm0834320","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTQ1NDU2M15BMl5BanBnXkFtZTcwMDIwMzYyOA@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 November 1926","placeOfBirth":" Gourock, Scotland, UK","birthName":"Melissa Stribling Smith","bio":"Melissa Stribling was born on November 7, 1926 in Gourock, Scotland as Melissa Stribling Smith. She was an actress, known for Horror of Dracula (1958), The League of Gentlemen (1960) and Road to Saint Tropez (1966). She was married to Basil Dearden. She died on March 22, 1992 in Watford, Hertfordshire, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTQ1NDU2M15BMl5BanBnXkFtZTcwMDIwMzYyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0834320","name":"Melissa Stribling","idIMDB":"nm0834320"},"actorId":"nm0834320","character":"Diana","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Terence Alexander","urlProfile":"http://www.imdb.com/name/nm0018776","urlPhoto":"","biography":{"dateOfBirth":"11 March 1923","placeOfBirth":" Islington, London, England, UK","birthName":"Terence Joseph Alexander","height":"6' (1.83 m)","bio":"To say that Terence Alexander, the distinguished British thespian, was hyperactive is a statement that borders on the understatement! Judge for yourself : born in 1923, following a short period when he considered becoming a priest, Alexander exercised the acting profession for six full decades and he might have beaten Queen Victoria's record, had not Parkinson's disease (an illness he finally died of at 86) taken its toll. In 1939, at age 16, he was already in the theater, as the first assistant manager of The White Rose Players Company at the Harrogate Opera House. It did not take more than a few months before he made his acting debut on the aforementioned scene, with the first role in J.B. Priestley's \"The Good Companions\". And not only would he appear in dozens of plays (signed Jean Anouilh, Ray Cooney, T.S. Eliot, Alan Bennett, Margaret Kennedy, and many others) but he would appear in no fewer than... 340 films, TV movies and series episodes! And that is without counting his career as a voice talent on the radio, as a film and a trailer narrator. Of course, appearing in so many plays and filmed works means that, except on the boards, he was not always the lead. He even hardly ever was. But whether in a supporting role or even a bit part, Terence Alexander managed to establish himself as a well-mannered upper class type with suave manners, although quite often on the wrong side of the law (he was excellent as one of the seven retired army officers turned bank robbers in Basil Dearden's quite enjoyable The League of Gentlemen (1960)). But he could also be an effective foil to comics like Norman Wisdom, Benny Hill and Eric Morecambe & Ernie Wise. On TV, Terence Alexander was everywhere, in many quality TV films like \"Autumn Crocus\" (1952), \"The White Carnation\" (1956), \"A Room in Town\" (1970), \"Frankenstein\" (1984) and in more than one TV show. But he was first and foremost in an impressive number of series : these included Maigret (1959) (2 episodes, 1962-63), cult classics such as The Avengers (1961) (3 episodes, 1965-69), Chapeau melon et bottes de cuir (1976) (1 episode, 1977), Man in a Suitcase (1967) (1 episode, 1968), The Champions (1968) (1 episode, 1969), The Persuaders! (1971) (1 episode, 1971) and Doctor Who (1963) (2 episodes, 1985), prestigious classic serials such as Nicholas Nickleby (1968) (5 episodes, 1968), The Forsyte Saga (1967) (9 episodes, 1967) and The Pallisers (1974) (3 episodes, 1974), and this is only a sample of all the series the prolific actor appeared in. With such a hectic activity, Terence Alexander of course gained recognition both from his peers and from the public but fame did not come to him before 1981 when he accepted (rather reluctantly by his own admission) the role of Charlie Hungerford in the detective series \"Bergerac\". As the power broker and (disapproving) partner of detective Jim Bergerac, played by John Nettles, he appeared in 85 of its 86 episodes. Shown in 35 countries, the series allowed Alexander to be known (and cherished) not only by an international audience but by the younger generation too. More than a swan song for this exquisite actor. When he retired in 1999 he must have have felt satisfied with his professional life.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0018776","name":"Terence Alexander","idIMDB":"nm0018776"},"actorId":"nm0018776","character":"Gee Gee Gray","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edric Connor","urlProfile":"http://www.imdb.com/name/nm0175403","urlPhoto":"","biography":{"dateOfBirth":"2 August 1913","placeOfBirth":" Mayaro, Trinidad, British West Indies","bio":"Edric Connor was born on August 2, 1913 in Mayaro, Trinidad, British West Indies. He is known for his work on Moby Dick (1956), The Vikings (1958) and King of Kings (1961). He died on October 16, 1968 in London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0175403","name":"Edric Connor","idIMDB":"nm0175403"},"actorId":"nm0175403","character":"Awana","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gaston Chikhani","urlProfile":"http://www.imdb.com/name/nm0157413","urlPhoto":"","biography":{"bio":"Gaston Chikhani is an actor, known for Only When I Larf (1968), 24 Hours to Kill (1965) and Le petit étranger (1962).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0157413","name":"Gaston Chikhani","idIMDB":"nm0157413"},"actorId":"nm0157413","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clifton Jones","urlProfile":"http://www.imdb.com/name/nm0427790","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNzM4MzI3OV5BMl5BanBnXkFtZTgwOTUyNTM0MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1937","placeOfBirth":" St. Andrew, Jamaica","height":"5' 9¾\" (1.77 m)","bio":"Clifton Jones was born on July 26, 1937 in St. Andrew, Jamaica. He is an actor, known for Watership Down (1978), Sheena (1984) and Space: 1999 (1975).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNzM4MzI3OV5BMl5BanBnXkFtZTgwOTUyNTM0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0427790","name":"Clifton Jones","idIMDB":"nm0427790"},"actorId":"nm0427790","character":"General Sakut","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Calvin Lockhart","urlProfile":"http://www.imdb.com/name/nm0516865","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxNjUxMzg0MjReQTJeQWpwZ15BbWU3MDA4NzIyMTg@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 October 1934","placeOfBirth":" Nassau, Bahamas","birthName":"Bert Cooper","height":"6' 2½\" (1.89 m)","bio":"Bahamian-born Calvin Lockhart first caught moviegoers' attention in the supercharged urban films Cotton Comes to Harlem (1970) and Halls of Anger (1970) before becoming a fairly steady fixture in the \"blaxploitation\" movies of the early-to-mid 1970s. Born Bert Cooper to a large family in Nassau on October 18, 1934, he was raised there before moving to New York in his late teens with initial designs on becoming a civil engineer (Cooper Union School of Engineering). Dropping out after a year to pursue an acting career, Calvin worked as a carpenter and construction worker, among other odd jobs. He first studied with legendary coach Uta Hagen and then hit the New York theater boards. The story goes that he was discovered by playwright Ketti Frings while working as a taxi driver. She was so impressed with his arrogance that she cast him in her play \"The Cool World\" in 1960. From there Calvin drummed up interest via a bit of controversy on Broadway when he played a sailor in love with a white girl in the racially-themed \"A Taste of Honey\" starring Angela Lansbury. Serious film and TV roles for black actors were scarce at that time, so Calvin moved to Europe. In Italy he owned a restaurant and formed his own theater company, serving as both actor and director. He also lived in Germany before settling in England. He starting building up film credits with minor work in such British movies as A Dandy in Aspic (1968) and Only When I Larf (1968). He made news in another racially-motivated project entitled Joanna (1968), which centered around a \"mod\", interracial romance with 'Genevieve Waite'. Returning to the US with a stronger resume, he made a distinct early impression as a slick preacher bent on fraud in the hip cop flick Cotton Comes to Harlem (1970) and as an English teacher in the inner-city potboiler Halls of Anger (1970). He also involved himself in such black action features as Melinda (1972), Honeybaby, Honeybaby (1974) and The Baron (1977). Similar in charismatic style and intelligence to Sidney Poitier, the famed actor-director was impressed enough to cast Calvin in his broad comedy vehicles Uptown Saturday Night (1974) and Let's Do It Again (1975). Calvin could also play fey upon request, camping it up briefly in Myra Breckinridge (1970). During this rich period he also became an artist-in-residence with the Royal Shakespeare Company at Stratford (the first black actor so honored) and appeared prestigiously in such productions as \"Titus Andronicus\" (1972). Calvin's career grew lackluster, however, by the end of the decade, resorting to trivial guest parts in such TV shows as Good Times (1974) and Get Christie Love! (1974). He landed a recurring role on the nighttime soap Dynasty (1981) in the early '80s. In 1974, Calvin married a woman also from the West Indies and had three children. After his career subsided, he decided to return to his homeland in the mid '90s and resettled in Nassau with his fourth wife, Jennifer Miles. There he involved himself with the Freeport Players Guild as a director. He also returned to films after a 15-year absence, completing Rain (2008), a movie shot in the Bahamas, shortly before he suffered a major stroke. Calvin died of complications on March 29, 2007, and his family is in the process of establishing a scholarship fund in his name for Bahamian student pursuing an acting or filmmaking career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxNjUxMzg0MjReQTJeQWpwZ15BbWU3MDA4NzIyMTg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0516865","name":"Calvin Lockhart","idIMDB":"nm0516865"},"actorId":"nm0516865","character":"Ali Lin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian Grellis","urlProfile":"http://www.imdb.com/name/nm0340153","urlPhoto":"","biography":{"dateOfBirth":"1937","placeOfBirth":" UK","bio":"Brian Grellis was born in 1937 in the UK. He is an actor, known for Threads (1984), Submarine X-1 (1968) and Fear in the Night (1972).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0340153","name":"Brian Grellis","idIMDB":"nm0340153"},"actorId":"nm0340153","character":"Spider","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Healy","urlProfile":"http://www.imdb.com/name/nm0372242","urlPhoto":"","biography":{"dateOfBirth":"15 May 1929","placeOfBirth":" Manhattan, New York City, New York, USA","bio":"A rotund, jovial New Yorker, David Healy obligingly played every manner of stereotypical American in British films and on television for more than thirty years. The son of an Australian father and an American mother, he spent much of his youth in Texas. Studying at Southern Methodist University in Dallas, he majored in drama and befriended another young acting hopeful, named Larry Hagman. David first arrived in England as a member of the U.S. Air Force and soon wound up, along with Hagman, in the cast of a touring show written by John Briley. This later grew into The Airbase (1965), a 25-minute BBC sitcom (with David as Staff Sergeant Tillman Miller), which took a humorous look at British-American cultural differences at an RAF base. Considering his job prospects to be rather more lucrative in Britain -- in keeping with the 'bigger fish, smaller pond' theory - David soon found himself in almost continuous demand for any part which required an affable or imperious American. His long gallery of characters included diplomats, businessmen, bureaucrats, spooks, military brass, and so on. There were rare occasions, when he acted against type and played 'Britishers' -- a notable point in case being a likeable Dr. Watson, opposite charismatic Ian Richardson as Sherlock Holmes, in The Sign of Four (1983). His comedic side was showcased in guest appearances with Dick Emery and Kenny Everett and a with couple of turns in Jeeves and Wooster (1990). Though married and settled in Surrey, David took job offers on both sides of the Atlantic. He was glimpsed as a cleric in Patton (1970) and in Robert Aldrich's doomsday thriller La dernière lueur du crépuscule (1977); well-cast as Teddy Roosevelt in Eleanor and Franklin: The White House Years (1977); and he had recurring roles in TV's favourite soapie of the day, Dallas (1978). British TV audiences saw him guesting in just about every major crime series, from The Saint (1962) and Department S (1969), to The Persuaders! (1971). Simultaneously, from 1967, David pursued a successful career as a stage actor in classical plays with the Royal Shakespeare Company and the National Theatre. In 1975, he re-visited his roots, playing Falstaff at a Shakespeare festival in Dallas. Ever versatile, David found another calling in musicals, appearing in \"Kismet\", \"Call Me Madam\" and \"The Music Man\". He received much praise for his interpretation of Runyonesque gambler Nicely-Nicely Johnson (played definitively on screen by Stubby Kaye) in \"Guys and Dolls\", performing show-stopping encores of \"Sit Down, You're Rockin' the Boat\".","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0372242","name":"David Healy","idIMDB":"nm0372242"},"actorId":"nm0372242","character":"Jones","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alan Gifford","urlProfile":"http://www.imdb.com/name/nm0317506","urlPhoto":"","biography":{"dateOfBirth":"11 March 1911","placeOfBirth":" Taunton, Massachusetts, USA","birthName":"John Lennox","bio":"Alan Gifford was born on March 11, 1911 in Taunton, Massachusetts, USA as John Lennox. He was an actor, known for 2001: A Space Odyssey (1968), Phase IV (1974) and Ragtime (1981). He was married to Blanch. He died on March 20, 1989 in Blairgowrie, Perthshire, Scotland.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0317506","name":"Alan Gifford","idIMDB":"nm0317506"},"actorId":"nm0317506","character":"Poster","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0063390","urlIMDB":"http://www.imdb.com/title/tt0063390","business":{"budget":null,"openingWeekend":null,"gross":[],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 44 min (104 min) (USA)"],"soundMix":["Mono"],"color":["Color (Eastmancolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Technicolor"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.1","filmingLocations":[{"location":"Westminster City Hall, Westminster, London, England, UK"}],"awards":[],"votes":"144","type":"Movie","companyCreditsSimple":[{"idCompany":"co0123617","name":"Beecord Production Ltd."},{"idCompany":"co0123618","name":"Deigton/Duffy Production"}],"keywords":{"keywords":["based on novel","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:27:35"}}