{"data":{"movies":[{"title":"The Howling","originalTitle":"","year":"1981","releaseDate":"19810410","directors":[{"name":"Joe Dante","id":"nm0001102"}],"writers":[{"name":"Gary Brandner","id":"nm0104707"},{"name":"John Sayles","id":"nm0000626"}],"runtime":"91 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTcwZmIyNjAtMWM4Yy00YzE1LTk5YzQtNjVlY2IxNzMwNzc2XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Horror"],"plot":"In a red light district, newswoman Karen White is bugged by the police, investigating serial killer Eddie Quist, who has been molesting her through phone calls. After police officers find them in a peep-show cabin and shoot Eddie, Karen becomes emotionally disturbed and loses her memory. Hoping to conquer her inner demons, she heads for the Colony, a secluded retreat where the creepy residents are rather too eager to make her feel at home. There also seems to be a bizarre connection between Eddie Quist and this supposedly safe haven. And when, after nights of being tormented by unearthly cries, Karen ventures into the forest and makes a terrifying discovery.","simplePlot":"After a bizarre and near fatal encounter with a serial killer, a television newswoman is sent to a remote mountain resort whose residents may not be what they seem.","actors":[{"actorName":"Dee Wallace","urlProfile":"http://www.imdb.com/name/nm0908914","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3YmE4ZDAtYzFiOS00M2E3LThjMTItYzE1OWZhY2FiMTg2XkEyXkFqcGdeQXVyMjkxNzgyMDU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 December 1948","placeOfBirth":" Kansas City, Kansas, USA","birthName":"Deanna Lee Bowers","height":"5' 4\" (1.63 m)","bio":"This attractive, happy go lucky blonde actress, educated at the University of Kansas and a former ballet soloist, first broke into both TV and cinema screens in the mid 1970s and through her appearances in several well remembered horror and sci-fi films, and Dee quickly gained a cult following among the fantasy film fans. Poor Dee always seemed to be on the wrong side of some malevolent person or evil creature....she was pursued by a clan of cannibal killers in The Hills Have Eyes (1977), terrorized by a pack of werewolves in the superb The Howling (1981), got a break from the horror, as a sympathetic mom in the mega sci-fi hit E.T. the Extra-Terrestrial (1982), and nearly ends up lunch for a rabid St. Bernard in the heart stopping Cujo (1983). In the early 1980s, Wallace-Stone actually shared the screen several times with her then husband Christopher Stone before his unfortunate, early demise from a heart attack in October, 1995. However, typecasting Dee Wallace-Stone as a horror heroine does not do her justice, as unlike some other scream queens whose careers quickly faded, Dee has gone on to have a very busy and varied acting career, appearing in over 90 feature films to date! Her All-American looks and easy going demeanor has seen Dee often cast as a typical suburban mother, a sympathetic friend, or a trusted ally. Fans warm to her endearing smile and natural warmth, and Dee continues to find herself in constant demand in front of the camera, plus she has her own much visited website.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3YmE4ZDAtYzFiOS00M2E3LThjMTItYzE1OWZhY2FiMTg2XkEyXkFqcGdeQXVyMjkxNzgyMDU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0908914","name":"Dee Wallace","idIMDB":"nm0908914"},"actorId":"nm0908914","character":"Karen White","urlCharacter":"http://www.imdb.com/character/ch0016710","main":true},{"actorName":"Patrick Macnee","urlProfile":"http://www.imdb.com/name/nm0001495","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxOTQ0MzEwNl5BMl5BanBnXkFtZTgwMDk4NDgwNjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 February 1922","placeOfBirth":" Paddington, London, England, UK","birthName":"Daniel Patrick Macnee","height":"6' 1\" (1.85 m)","bio":"British actor Patrick Macnee was born on February 6, 1922 in London, England into a wealthy and eccentric family. His father, Daniel Macnee, was a race horse trainer, who drank and gambled away the family fortune, leaving young Patrick to be raised by his gay mother, Dorothea Mary, and her lover. Shortly after graduating from Eton (from which he was almost expelled for running a gambling ring), Macnee first appeared on stage and made his film debut as an extra in Pygmalion (1938). His career was interrupted by World War II, during which he served in the Royal Navy. After military service, Macnee attended the Webber Douglas School of Dramatic Art in London on scholarship. He also resumed his stage and film career, with bit parts such as Young Jacob Marley in A Christmas Carol (1951). Disappointed with his limited roles, Macnee left England for Canada and the United States. In 1954, he went to Broadway with an Old Vic troupe and later moved on to Hollywood, where he made occasional television and film appearances until returning to England in 1959. Once back home, he took advantage of his producing experience in Canada to become coproducer of the British television series Winston Churchill: The Valiant Years (1960). Shortly thereafter, Macnee landed the role that brought him worldwide fame and popularity in the part of John Steed, in the classic British television series The Avengers (1961). His close identification with this character limited his career choices after the cancellation of the series in 1969, prompting him to reprise the role in Chapeau melon et bottes de cuir (1976), which, though popular, failed to recapture the magic of the original series. During the 1980s and 1990s, Macnee became a familiar face on American television in such series as Gavilan (1982), Empire (1984), Thunder in Paradise (1994) and NightMan (1997). In the past decade, Macnee has also made several audio recordings of book fiction.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxOTQ0MzEwNl5BMl5BanBnXkFtZTgwMDk4NDgwNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001495","name":"Patrick Macnee","nicknames":["Patty Nee","Pat"],"idIMDB":"nm0001495"},"actorId":"nm0001495","character":"Dr. George Waggner","urlCharacter":"http://www.imdb.com/character/ch0107430","main":true},{"actorName":"Dennis Dugan","urlProfile":"http://www.imdb.com/name/nm0240797","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDU4NTkzNV5BMl5BanBnXkFtZTYwNTQ5Mjk1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 September 1946","placeOfBirth":" Wheaton, Illinois, USA","height":"5' 8\" (1.73 m)","bio":"Dennis Dugan was born on September 5, 1946 in Wheaton, Illinois, USA. He is an actor and director, known for Happy Gilmore (1996), You Don't Mess with the Zohan (2008) and Big Daddy (1999). He is married to Sharon Dugan. He was previously married to Joyce Van Patten.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDU4NTkzNV5BMl5BanBnXkFtZTYwNTQ5Mjk1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0240797","name":"Dennis Dugan","nicknames":["Dugie"],"idIMDB":"nm0240797"},"actorId":"nm0240797","character":"Chris Halloran","urlCharacter":"http://www.imdb.com/character/ch0016713","main":true},{"actorName":"Christopher Stone","urlProfile":"http://www.imdb.com/name/nm0831791","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NTcwMzk0OF5BMl5BanBnXkFtZTcwNzgzMTI0NA@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1942","placeOfBirth":" Manchester, New Hampshire, USA","birthName":"Thomas Edward Bourassa","height":"6' (1.83 m)","bio":"Christopher Stone was an occasional lead and supporting actor. Although he never achieved major stardom, he was still quite a busy actor in films and on television throughout the 1980s and early 90s. Stone achieved his first major role as \"Dr. Pooch Hardin\" on the 1970s TV series The Interns (1970), and made occasional appearances in made-for-TV movies and guest-starring on such TV shows that included Mission: Impossible (1966), Hunter (1976) and Wonder Woman (1975). Stone later married actress Dee Wallace and co-starred with her in such theatrical feature films including The Howling (1981) and Cujo (1983), as well as the late 1980s TV series The New Lassie (1989). Stone continued appearing in TV guest-starring roles and made for TV films before he died of a heart attack at the age of 53 in 1995.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NTcwMzk0OF5BMl5BanBnXkFtZTcwNzgzMTI0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0831791","name":"Christopher Stone","idIMDB":"nm0831791"},"actorId":"nm0831791","character":"R. William 'Bill' Neill","urlCharacter":"http://www.imdb.com/character/ch0107431","main":true},{"actorName":"Belinda Balaski","urlProfile":"http://www.imdb.com/name/nm0049470","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NTgwMjEzN15BMl5BanBnXkFtZTcwOTgzMTI0NA@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 December 1947","placeOfBirth":" Inglewood, California, USA","birthName":"Belinda Lou Balaski","height":"5' 6\" (1.68 m)","bio":"Belinda Balaski, born in California with acting skills instilled at birth, began working at age five. Throughout her career she has starred in many feature films, movies of the week, commercials and guest starred in dozens of TV shows. Honored with an Emmy for starring in Best After School Special, \"The Runaways,\" Belinda also received two Emmy submissions for \"Are You My Mother\" with Michael York and \"Proud Men\" with Charlton Heston and Peter Strauss. Her theatre background has earned her the Los Angeles Drama Critics Circle Award, and two Robbies. Don Knotts, Nick Nolte, Charleton Heston, and Cloris Leachman are just some of the famous actors Belinda has starred alongside throughout her impressive career. Balaski's more memorable roles include a hippie chick in the hilariously cruddy made-for-TV hoot \"The Werewolf of Woodstock\" with Andy Stevens, Lynda Carter's sweet best gal pal Essie in the exciting redneck crime/action winner \"Bobbie Jo and the Outlaw,\" an imperiled pregnant woman with Marjoe Gortner in H. G. Well's \"The Food of the Gods,\" and Robert Carradine's surfer girl in the cross country road race romp \"Cannonball.\" Belinda has starred in a dozen Joe Dante films; her best-ever Dante parts are a summer camp counselor in \"Piranha,\" a spunky go-getter News Producer in the now classic \"The Howling,\" a spoof 1950's sci-fi movie called \"Amazon Women on the Moon\", and a harried working class mother in the wonderfully raucous \"Gremlins I & II.\" Among other TV shows Belinda has guest starred on \"Baywatch,\" \"Eerie, Indiana,\" \"Father Dowling Mysteries,\" \"Falcon Crest,\" \"Our House,\" \"Simon & Simon,\" \"Hunter,\" \"The A-Team,\" \"Vega$,\" \"Starsky and Hutch,\" \"Charlie's Angels,\" the Emmy Award-winning \"The Runaways\", \"S.W.A.T.,\" and \"Baretta.\" In the late 80's Belinda created BB's Kids Acting School where she teaches both kids, teenagers, and adults in theatrical, commercial and musical workshops; passing on the knowledge she has acquired throughout her four decades in the entertainment industry. As an actress, teacher, painter, photographer, writer and a mother, Belinda continues to create at every turn, loving every minute of it!","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NTgwMjEzN15BMl5BanBnXkFtZTcwOTgzMTI0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0049470","name":"Belinda Balaski","idIMDB":"nm0049470"},"actorId":"nm0049470","character":"Terry Fisher","urlCharacter":"http://www.imdb.com/character/ch0175148","main":true},{"actorName":"Kevin McCarthy","urlProfile":"http://www.imdb.com/name/nm0002994","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMTA2Mzc0NF5BMl5BanBnXkFtZTYwOTk1OTA2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 February 1914","placeOfBirth":" Seattle, Washington, USA","height":"5' 10\" (1.78 m)","bio":"Handsome, chisel-jawed character actor Kevin McCarthy appeared in nearly 100 movies in a career that spanned seven decades. He also had some starring roles, most notably the horror cult classic Invasion of the Body Snatchers (1956). He played the disillusioned son Biff Loman in the 1951 screen adaptation of Arthur Miller's classic Death of a Salesman (1951), for which he was nominated for a Best Supporting Actor Oscar and won the Golden Globe Award for most promising newcomer (male). He is the younger brother of the late author Mary McCarthy and distant cousin of former U.S. Senator and presidential candidate Eugene McCarthy. McCarthy was orphaned at the age of four when both his parents died in the great flu epidemic of 1918. He was raised by his father's parents in Minneapolis, Minnesota, and later by an uncle and aunt. He graduated from Campion Jesuit High School in Prairie du Chien, Wisconsin, in 1932. He attended the School of Foreign Service at Georgetown University, Washington, DC, in 1933, intending to enter into the diplomatic field. He also attended the University of Minnesota, Minneapolis, in 1936 and the Actors Studio New York, New York. He had roles in two short-lived TV series: The Survivors (1969), with Lana Turner, and Flamingo Road (1980) as Claude Weldon, the father of the character played by Morgan Fairchild. The stage-trained McCarthy frequently appeared on Broadway. He starred as Jerry in \"Two for the Seesaw\" (1959) and as Van Ackerman in \"Advise and Consent\" (1960). He also played President Harry S. Truman in the one-man show \"Give 'Em Hell, Harry!\" McCarthy showed no signs of retiring as late as June 2007. McCarthy acted in the film The Ghastly Love of Johnny X (2012), playing the role of the Grand Inquisitor, at age 93, which was finally released in 2011. He died of pneumonia on September 11, 2010.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMTA2Mzc0NF5BMl5BanBnXkFtZTYwOTk1OTA2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002994","name":"Kevin McCarthy","idIMDB":"nm0002994"},"actorId":"nm0002994","character":"Fred Francis","urlCharacter":"http://www.imdb.com/character/ch0016714","main":true},{"actorName":"John Carradine","urlProfile":"http://www.imdb.com/name/nm0001017","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MDcyMjkzOV5BMl5BanBnXkFtZTYwNzY1MzI2._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1906","placeOfBirth":" New York City, New York, USA","birthName":"Richmond Reed Carradine","height":"6' (1.83 m)","bio":"John Carradine, the son of a reporter/artist and a surgeon, grew up in Poughkeepsie, New York. He attended Christ Church School and Graphic Art School, studying sculpture, and afterward roamed the South selling sketches. He made his acting debut in \"Camille\" in a New Orleans theatre in 1925. Arriving in Los Angeles in 1927, he worked in local theatre. He applied for a job as as scenic designer to Cecil B. DeMille, who rejected his designs but gave him voice work in several films. His on-screen debut was in Tol'able David (1930), billed as Peter Richmond. A protégé and close friend of John Barrymore, Carradine was an extremely prolific film character actor while simultaneously maintaining a stage career in classic leading roles such as Hamlet and Malvolio. In his later years he was typed as a horror star, putting in appearances in many low- and ultra-low-budget horror films. He was a member of the group of actors often used by director John Ford that became known as \"The John Ford Stock Company\". John Carradine died at age 82 of natural causes on November 27, 1988.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MDcyMjkzOV5BMl5BanBnXkFtZTYwNzY1MzI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001017","name":"John Carradine","nicknames":["The Bard of Boulevard","The Voice"],"idIMDB":"nm0001017"},"actorId":"nm0001017","character":"Erle Kenton","urlCharacter":"http://www.imdb.com/character/ch0016712","main":true},{"actorName":"Slim Pickens","urlProfile":"http://www.imdb.com/name/nm0001620","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM5MDQyNjI3Nl5BMl5BanBnXkFtZTcwMTA1MjE1Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1919","placeOfBirth":" Kingsburg, California, USA","birthName":"Louis Burton Lindley Jr.","height":"6' 2\" (1.88 m)","bio":"Slim Pickens spent the early part of his career as a real cowboy and the latter part playing cowboys, and he is best remembered for a single \"cowboy\" image: that of bomber pilot Maj. \"King\" Kong waving his cowboy hat rodeo-style as he rides a nuclear bomb onto its target in the great black comedy Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb (1964). Born in Kingsburg, near Fresno in California's Central Valley, he spent much of his boyhood in nearby Hanford, where he began rodeoing at the age of 12. Over the next two decades he toured the country on the rodeo circuit, becoming a highly-paid and well-respected rodeo clown, a job that entailed enormous danger. In 1950, at the age of 31, Slim married Margaret Elizabeth Harmon and that same year he was given a role in a western, Rocky Mountain (1950). He quickly found a niche in both comic and villainous roles in that genre. With his hoarse voice and pronounced western twang, he was not always easy to cast outside the genre, but when he was, as in \"Dr. Strangelove\", the results were often memorable. He died in 1983 after a long and courageous battle against a brain tumor. He was survived by his wife Margaret and children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM5MDQyNjI3Nl5BMl5BanBnXkFtZTcwMTA1MjE1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001620","name":"Slim Pickens","idIMDB":"nm0001620"},"actorId":"nm0001620","character":"Sam Newfield","urlCharacter":"http://www.imdb.com/character/ch0175149","main":true},{"actorName":"Elisabeth Brooks","urlProfile":"http://www.imdb.com/name/nm0111974","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NzAyNzQyOV5BMl5BanBnXkFtZTcwMjgzMTI0NA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 July 1951","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Elisabeth Brooks Luyties","bio":"Elisabeth Brooks Luyties was born on July 2, 1951 in Toronto, Ontario, Canada. Elisabeth Brooks began acting at age five with her career encompassing both stage and screen. She started appearing in television roles in the mid-1970s and managed to pursue her acting career as a single mother while working a variety of jobs to support herself and her son. She regularly appeared on the daytime soap opera Days of Our Lives (1965), and in such popular television series as The Rockford Files (1974), Hart to Hart (1979), Starsky and Hutch (1975), The Six Million Dollar Man (1974) and Emergency! (1972). She is probably best remembered for her role as the villainess Marsha Quist in the horror film The Howling (1981), a role that brought her considerable notoriety within the genre. Brooks was not only a beautiful actress, but also an accomplished writer, poet and musician. She had a wonderful deep, sultry voice and can be heard singing briefly in the film The Forgotten One (1989) - a horror film she appeared with longtime friend Kristy McNichol. She and McNichol had separated, but McNichol came back to care for Brooks on her final days. Brooks was also known for her spirituality and her encouragement to others. She created her own production company and became an established acting coach. She wrote and produced plays that taught children about the environment, and how they could work with parents to improve their community. An example of this was \"Orphan Dreams\", which she directed first at Calabasas High School and again at Chamber Theatre in Studio City. Elisabeth Brooks, after a three-year struggle with cancer, died in a hospice near her Palm Springs, California home at age 46. As Gigi Bannister wrote in a Tribute to Elisabeth Brooks, \"let it be said, Elisabeth Brooks was no quitter. She was a fighter... a true warrior to the end\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NzAyNzQyOV5BMl5BanBnXkFtZTcwMjgzMTI0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0111974","name":"Elisabeth Brooks","nicknames":["Lissa"],"idIMDB":"nm0111974"},"actorId":"nm0111974","character":"Marsha Quist","urlCharacter":"http://www.imdb.com/character/ch0175150","main":true},{"actorName":"Robert Picardo","urlProfile":"http://www.imdb.com/name/nm0000585","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTYxMDEwMjYwMV5BMl5BanBnXkFtZTcwNzEzNzUzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 October 1953","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"5' 9\" (1.75 m)","bio":"Robert Picardo was born on October 27, 1953 in Philadelphia, Pennsylvania, USA, where he spent his whole childhood. He graduated from the William Penn Charter School and attended Yale University. At Yale, he landed a role in Leonard Bernstein's \"Mass\" and at age 19, he played a leading role in the European premiere of \"Mass\". Later, he graduated with a Bachelor's degree in Drama from Yale University. He appeared in the David Mamet play \"Sexual Perversity in Chicago and with Diane Keaton in \"The Primary English Class\". In 1977, he made his Broadway debut in the comedy hit \"Gemini\" with Danny Aiello and also appeared in Bernard Slade's \"Tribute\", \"Beyond Therapy\" as well as \"Geniuses\" and \"The Normal Heart\" for which he won a Drama-Logue Award. Then, he became involved in television, where he soon was nominated for an Emmy Award for his role as Coach Cutlip on the series The Wonder Years (1988). Robert appeared in several other series: China Beach (1988), Frasier (1993), Ally McBeal (1997), Home Improvement (1991), Au-delà du réel - l'aventure continue (1995) and Sabrina, the Teenage Witch (1996). In 1995, he got the role of the holographic doctor on Star Trek: Voyager (1995) where he also directed two episodes. He also got roles in The Howling (1981), Star 80 (1983), Get Crazy (1983), Oh, God! You Devil (1984), Innerspace (1987), Munchies (1987), Samantha (1991), White Mile (1994), First Contact (1996), Small Soldiers (1998), Les Looney Tunes passent à l'action (2003), Quantum Quest: A Cassini Space Odyssey (2010), and so on. He resides in Los Angeles, California with his wife Linda, and their two daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTYxMDEwMjYwMV5BMl5BanBnXkFtZTcwNzEzNzUzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000585","name":"Robert Picardo","nicknames":["Bob"],"idIMDB":"nm0000585"},"actorId":"nm0000585","character":"Eddie Quist","urlCharacter":"http://www.imdb.com/character/ch0016711","main":true},{"actorName":"Margie Impert","urlProfile":"http://www.imdb.com/name/nm0408286","urlPhoto":"","biography":{"dateOfBirth":"4 June 1948","placeOfBirth":" Horseheads, New York, USA","bio":"Margie Impert was born on June 4, 1948 in Horseheads, New York, USA. She is an actress, known for Another World (1964), The Howling (1981) and The Star Chamber (1983).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0408286","name":"Margie Impert","idIMDB":"nm0408286"},"actorId":"nm0408286","character":"Donna","urlCharacter":"http://www.imdb.com/character/ch0175151","main":true},{"actorName":"Noble Willingham","urlProfile":"http://www.imdb.com/name/nm0932244","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NDk5ODE2NV5BMl5BanBnXkFtZTcwNjY3NDAyOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 August 1931","placeOfBirth":" Mineola, Texas, USA","birthName":"Noble Henry Willingham","bio":"Noble Willingham has appeared in more than 30 feature films, including Up Close & Personal (1996), Ace Ventura: Pet Detective (1994), Chinatown (1974), Good Morning, Vietnam, City Slickers, City Slickers II, and The Distinguished Gentleman. He was born in the small town of Mineola, Texas, east of Dallas. After graduating from North Texas State College, he earned a master's degree in educational psychology from Baylor University. Willingham was a teacher before following his long-time dream of becoming an actor. He auditioned for a part in the film The Last Picture Show, which was filmed in Texas. He won the role, which led to another, in Paper Moon. On television, Willingham had a recurring role in the series Home Improvement and appeared as a guest star in the series Murder, She Wrote and Northern Exposure, both on CBS, and Quantum Leap. He appeared in the television film Men Don't Tell on CBS. His additional television film credits include Woman with a Past, The Alamo, and Unconquered. Willingham has a daughter, Stori. His birthday is August 31.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NDk5ODE2NV5BMl5BanBnXkFtZTcwNjY3NDAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0932244","name":"Noble Willingham","idIMDB":"nm0932244"},"actorId":"nm0932244","character":"Charlie Barton","urlCharacter":"http://www.imdb.com/character/ch0175152","main":true},{"actorName":"James Murtaugh","urlProfile":"http://www.imdb.com/name/nm0615428","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NzY5ODU3Nl5BMl5BanBnXkFtZTcwMTE0MDQzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 October 1942","placeOfBirth":" Chicago, Illinois, USA","birthName":"James Francis Murtaugh","bio":"James Murtaugh was born on October 28, 1942 in Chicago, Illinois, USA as James Francis Murtaugh. He is an actor, known for How to Lose a Guy in 10 Days (2003), Vanilla Sky (2001) and Out of Time (2003). He has been married to Alice Heid since May 15, 1971. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NzY5ODU3Nl5BMl5BanBnXkFtZTcwMTE0MDQzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0615428","name":"James Murtaugh","idIMDB":"nm0615428"},"actorId":"nm0615428","character":"Jerry Warren","urlCharacter":"http://www.imdb.com/character/ch0175153","main":true},{"actorName":"James MacKrell","urlProfile":"http://www.imdb.com/name/nm0572100","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyMTAzNTk0NjheQTJeQWpwZ15BbWU4MDE5MDQ4OTUx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 October 1937","placeOfBirth":" Little Rock, Arkansas, USA","birthName":"James MacKrell","height":"6' 3\" (1.91 m)","bio":"Jim MacKrell's broadcast career has spanned decades and has included every aspect of communications, from local and network commercials to hosting specials to guest-starring in popular series and features. For the four years of its run, Jim was the star of the hit NBC game-show, Celebrity Sweepstakes (1974). He also hosted The Game Game (1969) (CBS), Quiz Kids (1978) (Columbia Pictures TV), plus numerous other shows. Jim's career has taken him to all areas of television and movies. His theatrical credits include such memorable films as Woody Allen's Annie Hall (1977), Albert Brooks' Defending Your Life (1991), Semi-Tough (1977), Gremlins (1984) and Teen Wolf (1985) with Michael J. Fox. He has had guest-starring roles on television in Dallas (1978), Soap (1977), Moonlighting (1985) and The Golden Girls (1985), amongst over 40 others. His made-for-TV movies include Christmas Miracle in Caufield, U.S.A. (1977), ABC Afterschool Specials: Run, Don't Walk (1981) and A Reason to Live (1985). Jim was also a regular on General Hospital (1963), Capitol (1982) and Days of Our Lives (1965). As a performer/writer/producer, Jim has made advertising a major focal point of his career. He has been corporate spokesman for giants such as Chevrolet and Disney. He has starred in spots for household names such as Whirlpool, Fiber Con, Serta, Goodyear, Mattel, Oster, Radio Shack, Exxon, Entex, and more. He also has appeared as a spokesman for industrials and corporate films for Toyota, Exxon, Xerox, Shell, Coca Cola, and more. For 14 years, Jim was the corporate host for the National Easter Seals Telethon and he wrote and produced several projects for ACTA Communications in Chicago. A veteran of radio, his credits include some of the top radio stations in the nation, including KMPC Los Angeles, KFI Los Angeles, WMEX Boston, WNOE New Orleans, WFUN Miami. In recent years, he hosted a top-rated talk show in Houston, Texas, on 97 Talk. With acting, hosting, writing and producing highly-motivating sales films and to having most of his life laid out in Video Rental Stores across the country, there is not an avenue of entertainment or marketing in which Jim MacKrell has not excelled.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyMTAzNTk0NjheQTJeQWpwZ15BbWU4MDE5MDQ4OTUx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0572100","name":"James MacKrell","idIMDB":"nm0572100"},"actorId":"nm0572100","character":"Lew Landers","urlCharacter":"http://www.imdb.com/character/ch0107432","main":true},{"actorName":"Kenneth Tobey","urlProfile":"http://www.imdb.com/name/nm0864851","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MTI1OTAzOV5BMl5BanBnXkFtZTcwOTcwMDAyOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 March 1917","placeOfBirth":" Oakland, California, USA","birthName":"Jesse Kenneth Tobey","height":"5' 11\" (1.8 m)","bio":"Born in Oakland, California, Kenneth Tobey was headed for a law career when he first dabbled in acting at the University of California Little Theater. That experience led to a year and a half of study at New York's Neighborhood Playhouse, where his classmates included Gregory Peck, Eli Wallach and Tony Randall. Throughout the 1940s Tobey acted on Broadway and in stock; he made his film debut in a 1943 short, \"The Man on the Ferry.\" He made his Hollywood film bow in a Hopalong Cassidy Western, and has since appeared in scores of features and on numerous TV series. He even had his own series, Whirlybirds (1957), in which he played an adventurous helicopter pilot.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MTI1OTAzOV5BMl5BanBnXkFtZTcwOTcwMDAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0864851","name":"Kenneth Tobey","idIMDB":"nm0864851"},"actorId":"nm0864851","character":"Older Cop","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0082533","urlIMDB":"http://www.imdb.com/title/tt0082533","business":{"budget":{"money":"$1,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 31 min (91 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arriflex Cameras and Lenses"],"laboratory":["Consolidated Film Industries (CFI), Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.6","filmingLocations":[{"location":"Westlake Village, California, USA"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1981","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best Horror Film","names":[]}]},{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Make-Up","names":[{"name":"Rob Bottin","id":"nm0001964","role":null},{"name":"Rick Baker","id":"nm0000711","role":null}]},{"category":"Best Special Effects","names":[{"name":"David Allen","id":"nm0020406","role":null},{"name":"Peter Kuran","id":"nm0475571","role":null}]}]}]},{"award":"Avoriaz Fantastic Film Festival 1981","titlesAwards":[{"titleAwardOutcome":"Won Critics Award","categories":[{"category":"","names":[{"name":"Joe Dante","id":"nm0001102","role":null}]}]}]}],"votes":"23,984","type":"Movie","companyCreditsSimple":[{"idCompany":"co0066648","name":"Embassy Pictures"},{"idCompany":"co0024716","name":"International Film Investors"},{"idCompany":"co0065795","name":"Wescom Productions"}],"keywords":{"keywords":["forest","lycanthrope","1980s","werewolf transformation","shapeshifting","shape shifter","first of series","werewolf bite","unfaithfulness","sexual rite","outdoor sex","cult film","female full frontal nudity","transformation","psychiatrist","metamorphosis","silver bullet","shot to death","news anchor","group therapy","adultery","monster","werewolf","creature feature","serial killer","woods","night","colony","cabin","sex scene","cove","cartoon on tv","lens flare","female protagonist","werewolf shot","werewolf pack leader","werewolf pack","werewolf family","two word title","regeneration","porn loop","lycanthropy","human prey","howling","female pubic hair","cattle","bush","brother sister relationship","murder of brother","wildfire","supernatural power","rural setting","pay phone","older man younger woman relationship","female nudity","voyeur","stalking","sexual perversion","sensuality","screaming","rampage","policeman","pleasure","perversion","old man","office","nipples","murder victim","lust","love","kiss","jealousy","jacket","infidelity","homicide","growling","friendship","forbidden love","fondling","flame","fire","fangs","falling in love","dress","desperation","desire","deception","danger","corruption","corpse","claw","campfire story","brunette","bloody scratch","blonde","bandage","awakening","attraction","survival horror","grindhouse","tape recorder","rape","pubic hair","orchestral music score","nudity","death","campfire","bare butt","gothic","surprise after end credits","suicidal","sheriff","self sacrifice","restroom","morgue","marriage","male nudity","los angeles california","gore","gas station","exploding car","dream sequence","drawing","california","beach","bar","barbecue","arson","woman in jeopardy","fog","female frontal nudity","camera","wearing a sound wire","vegetarian","tv news","secret society","rifle","phone booth","murder","hunting","corrupt cop","burned alive","bookstore","axe","adult bookstore","mirror","severed hand","amnesia","acid","stop motion animation","reverse footage","based on novel","independent film","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:16:00"}}