{"data":{"movies":[{"title":"High School U.S.A.","originalTitle":"","year":"1983","releaseDate":"19831016","directors":[{"name":"Rod Amateau","id":"nm0024120"}],"writers":[{"name":"Alan Eisenstock","id":"nm0252087"},{"name":"Larry Mintz","id":"nm0591778"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5ODYwOTk4OF5BMl5BanBnXkFtZTcwOTE3MTAwMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"Set in a senior high school class, J.J. pursues the girlfriend of a rival from a higher clique.","simplePlot":"Set in a senior high school class, J.J. pursues the girlfriend of a rival from a higher clique.","actors":[{"actorName":"Michael J. Fox","urlProfile":"http://www.imdb.com/name/nm0000150","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNzM0MjE4NF5BMl5BanBnXkFtZTcwMDkxMzEwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 June 1961","placeOfBirth":" Edmonton, Alberta, Canada","birthName":"Michael Andrew Fox","height":"5' 4½\" (1.64 m)","bio":"Michael J. Fox was born Michael Andrew Fox on June 9, 1961 in Edmonton, Alberta, Canada, to Phyllis Fox (née Piper), a payroll clerk, and William Fox. His parents moved their ten-year-old son, his three sisters, Kelli Fox, Karen, and Jacki, and his brother, Steven, to Vancouver, British Columbia, after his father, a sergeant in the Canadian Army Signal Corps, retired. It was during these years that Michael developed his desire to act. At age fifteen, he successfully auditioned for the role of a 10-year-old in a series called Leo and Me (1978). Gaining attention as a bright new star in Canadian television and movies, Michael realized his love for acting when he appeared on stage in \"The Shadow Box\". At age 18, he moved to Los Angeles and was offered a few roles in television series but early acting success ended fast when the roles stopped coming. For a while, he survived on boxes of macaroni and cheese. Then his agent called to tell him that he got the part of Alex P. Keaton on the situation comedy Family Ties (1982). He starred in the feature films Teen Wolf (1985), High School U.S.A. (1983), Poison Ivy (1985) and Back to the Future (1985).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNzM0MjE4NF5BMl5BanBnXkFtZTcwMDkxMzEwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000150","name":"Michael J. Fox","nicknames":["Mike"],"idIMDB":"nm0000150"},"actorId":"nm0000150","character":"Jay-Jay Manners","urlCharacter":"http://www.imdb.com/character/ch0304820","main":true},{"actorName":"Nancy McKeon","urlProfile":"http://www.imdb.com/name/nm0001529","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI5NzI5NjI4NV5BMl5BanBnXkFtZTcwMDI2NzQyNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1966","placeOfBirth":" Westbury, New York, USA","birthName":"Nancy Justine McKeon","height":"5' 6\" (1.68 m)","bio":"Nancy McKeon was born in Westbury, New York to Don and Barbara McKeon, began modeling baby clothes for the Sears catalog at the age of two and she and her brother did over sixty-five commercials in seven years. When her brother, Philip McKeon, won a role on the TV series, Alice (1976), the family moved to Los Angeles. Her first real acting break came when she did the short-lived TV series, Stone (1979), and guested on Starsky and Hutch (1975). The producers of The Facts of Life (1979) were so impressed by Nancy's performance as the street-wise girl in a pilot called \"Dusty\", they decided to sign her to play \"Jo\" on \"The Facts of Life\". Nancy has starred in the television movies, High School U.S.A. (1983), Poison Ivy (1985), This Child Is Mine (1985) and Firefighter (1986). She provided the voices for animated shows like ABC Weekend Specials: The Puppy's Great Adventure (1979).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI5NzI5NjI4NV5BMl5BanBnXkFtZTcwMDI2NzQyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001529","name":"Nancy McKeon","idIMDB":"nm0001529"},"actorId":"nm0001529","character":"Beth Franklin","urlCharacter":"http://www.imdb.com/character/ch0304818","main":true},{"actorName":"Todd Bridges","urlProfile":"http://www.imdb.com/name/nm0004775","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMzY0MDMzNl5BMl5BanBnXkFtZTYwOTkwMTI1._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 May 1965","placeOfBirth":" San Francisco, California, USA","birthName":"Todd Anthony Bridges","height":"5' 11\" (1.8 m)","bio":"Actor Todd Bridges has seen and done it all. Todd has lived and worked amongst some of the most famous and influential individuals in the world. For over twenty-five years, he has victoriously survived a rapidly changing business. He experienced his second rise to fame, as \"Juice\" on The Young and the Restless (1973). Todd's career began and rocketed when he was only six years of age, forcing his family to relocate from a quiet, friendly neighborhood in San Francisco to the fast-paced stardom of Los Angeles, California in the early 70s. His mother, actress Betty A. Bridges, and father, the late James Bridges, Sr., came to Hollywood in search of the American dream. Betty went on to work quite a bit as an actress while James Sr. became one of the first prominent black Hollywood agents. Betty later became one of Hollywood's greatest managers and acting coaches, whose list of clients (soon to become stars) included her oldest child, Jimmy Bridges, her daughter Verda Bridges, Todd (of course), Nia Long (The Fresh Prince of Bel-Air (1990), Love Jones (1997)), Regina King (Jerry Maguire (1996)), Lamont Bentley (Moesha (1996)), and Aaron Meeks (Soul Food (2000)). It all began one day while watching Redd Foxx display his comic genius on Sanford and Son (1972). Todd, then six, realized his dream of becoming an actor. He exclaimed excitedly to his mother, \"I want to do that\", pointing to the television set. He had asked on his own to enter a business which, during that time, was very limited for black artists. Nevertheless, Todd went on to make some remarkable strides in the industry, pioneering the way for other young, black actors. His first job was a Jell-O commercial, which starred the entire Bridges family. He later accomplished over 60 national commercials. Todd was the first black child actor to become a recurring regular on the hit series, The Waltons (1971), and Little House on the Prairie (1974) with the late great Michael Landon. He went on to guest star on Barney Miller (1974), which eventually gained a spin-off show, starring Abe Vigoda. The spin-off was titled Fish (1977) and Todd became a series regular for four years. Norman Lear, who spearheaded the success of Tandem Productions, with such shows under his belt as The Jeffersons (1975), Good Times (1974), All in the Family (1971) and The Facts of Life (1979), sought to create a new type of show that would cross the racial boundaries set in Hollywood in the early years of television. He began with the new kid in town, Gary Coleman, and a TV veteran, Conrad Bain, from the hit show, Maude (1972). The wheels were spinning and Diff'rent Strokes (1978) was born. The show originated with a wealthy white businessman who adopted his housekeeper's black child after she passed away. There was only one problem. Who would the creators find to match wits with the sassy Gary Coleman? Conrad Bain then suggested the creation of an older brother character to keep up with \"Arnold's\" wisecracks, a strong young actor capable of bouncing the ball back in his court. No one portrayed such qualities as Todd Bridges. Diff'rent Strokes (1978) was introduced to American audience in the fall of 1978. With the new concept of a racially-mixed cast, the producers and creators were unsure how the viewers would react. To their surprise, the show was a complete success and ran strong for eight years. Todd Bridges became an international celebrity and household name by the age of 15. During his success with \"Diff'rent Strokes\", Todd guest starred on such shows as The Love Boat (1977), The Facts of Life (1979), Hello, Larry (1979), Battle of the Network Stars VI (1979), Circus of the Stars #6 (1981), and many, many more. An even bigger opportunity came when he was chosen to portray the role of Chicken George's grandson in the historical television miniseries, Roots (1977), where his performance is still applauded to this day. After \"Diff'rent Strokes\" ended its long run in 1986, things became difficult for Todd. All of a sudden, no one would hire him due to his being typecast as \"Willis Drummond\". He began to experience turbulent times, which would later lead to drug addiction and trouble with the authorities. There would be a pause in his career and his life for nearly ten years. Todd Bridges has been clean and sober for nine years. He is a working actor, director, and producer and is well on his way to the rebirth of a promising television and motion picture career. Together, Todd and his brother, James Jr., have partnered to establish their own production company, \"Little Bridge Productions\". His recent film credits (as an actor) include _1210 Camille Street_ with Faizon Love (Friday (1995), The Replacements (2000)), Frat (), _Hollywood Horror (2000)_ with Tia Mowry-Hardrict and 'Tamara Mowry' (_\"Sister Sister\" (1994)_) and A Testimony. He also recently completed a feature film in Utah called The Climb (2002) for Billy Graham's production company. He directed, produced and starred in the short film about his life, Building Bridges (2000), for TBN. He also directed, along with his brother, a full-length feature film titled Black Ball (2003) (aka Full Circle), starring Lisa Sweat (wife of R&B singer Keith Sweat), Stoney Jackson, De'aundre Bonds, his wife Dori Bridges, and a host of other great names. His directorial credits also include the feature film, Flossin (2001), the life story of his pastor and childhood friend, Pastor Ernest Johnson. On a more personal note, Todd is a proud husband and father. He has been married, since 1998, to his wife, Dori Bridges, and they have one son, Spencir Bridges. Todd has traveled the nation speaking to over 6,000 kids per day in high schools, middle schools, and churches warning about the dangers of drug use, negative peer pressure, and proclaiming Christ Jesus!","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMzY0MDMzNl5BMl5BanBnXkFtZTYwOTkwMTI1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004775","name":"Todd Bridges","nicknames":["Mud Bone","Willis"],"idIMDB":"nm0004775"},"actorId":"nm0004775","character":"Otto Lipton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Angela Cartwright","urlProfile":"http://www.imdb.com/name/nm0142145","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NjgxNjAzOF5BMl5BanBnXkFtZTcwNzI3NTEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1952","placeOfBirth":" Altrincham, Cheshire, England, UK","birthName":"Angela Margaret Cartwright","height":"5' 5\" (1.65 m)","bio":"Born in England, Angela is the younger sister of actress Veronica Cartwright. As a child she was cast as the cute little stepdaughter, Linda Williams, on Make Room for Daddy (1953). She was on the show from 1957 to 1964. After that, she was cast as Brigitta in the popular Julie Andrews movie The Sound of Music (1965). Soon after, she returned to series TV as Penny Robinson, young teenage space traveler, in Lost in Space (1965), which ran from 1965-1968. Even with cheap special effects and a hokey story line, the show is still popular today. In 1970 Angela had a part in Make Room for Granddaddy (1970), a sequel to the original series, but the show was soon canceled. Since that time, she has made a life outside of films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NjgxNjAzOF5BMl5BanBnXkFtZTcwNzI3NTEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0142145","name":"Angela Cartwright","idIMDB":"nm0142145"},"actorId":"nm0142145","character":"Miss D'Angelo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bob Denver","urlProfile":"http://www.imdb.com/name/nm0001134","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNDczNDczMV5BMl5BanBnXkFtZTYwMTY3NDE2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 January 1935","placeOfBirth":" New Rochelle, New York, USA","birthName":"Robert Osborne David Denver","height":"5' 8\" (1.73 m)","bio":"Bob Denver was attending college at Loyola-Marymount University, in Los Angeles, when he got into acting. At first, Denver wasn't sure he wanted to be an actor, but gradually gave in, deciding that's what he was going to do for a career. Before he became established, he worked as a mailman and teacher. He then got a screen test for the part of Maynard G. Krebs and to his surprise won the part. After four years on The Many Loves of Dobie Gillis (1959), Denver got his most famous part of Gilligan, in Gilligan's Island (1964). After Gilligan's three-year run ended he did a few other television shows (including the Gilligan wannabe Dusty's Trail (1973)) and Broadway plays. On September 2, 2005, he died of complications related to cancer treatment at Wake Forest University Baptist Hospital in North Carolina. He had most recently lived in Princeton, West Virgina. He is survived by his wife Dreama Perry Denver, and four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNDczNDczMV5BMl5BanBnXkFtZTYwMTY3NDE2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001134","name":"Bob Denver","nicknames":["Little buddy"],"idIMDB":"nm0001134"},"actorId":"nm0001134","character":"Milton Feld","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dwayne Hickman","urlProfile":"http://www.imdb.com/name/nm0382722","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MjM2Mjk3M15BMl5BanBnXkFtZTcwNDk2MTkyMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 May 1934","placeOfBirth":" Los Angeles, California, USA","birthName":"Dwayne Bernard Hickman","height":"5' 8\" (1.73 m)","bio":"Boyishly handsome Dwayne Hickman, the younger brother of Darryl Hickman, followed in his sibling's tiny footsteps as a moppet film actor himself, appearing in such features as Captain Eddie (1945) (with Darryl) and as \"Nip Worden\" in The Return of Rusty (1946) and the rest of that dog adventure series. On a temporary sabbatical from acting, he returned to Hollywood following college studies (Loyola University) and won the hearts of many young female baby-boomers as the girl-obsessed nephew in The Bob Cummings Show (1955) and especially as the swooning, adorably sheepish \"teen\" in The Many Loves of Dobie Gillis (1959) as the title character. Unable to escape the cramping typecast, he ended up working behind the scenes from the 1970s on as a publicist, a Las Vegas entertainment director and, most successfully, as a programming executive for CBS. Dwayne has returned to acting on occasion in \"Dobie\" retrospectives and other light comedy efforts. In 1994 he wrote his biography, aptly titled \"Forever Dobie.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MjM2Mjk3M15BMl5BanBnXkFtZTcwNDk2MTkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0382722","name":"Dwayne Hickman","idIMDB":"nm0382722"},"actorId":"nm0382722","character":"Mr. Plaza","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lauri Hendler","urlProfile":"http://www.imdb.com/name/nm0376661","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1ODA0NTI4NF5BMl5BanBnXkFtZTgwMDM1NTY3MjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 April 1965","placeOfBirth":" Fort Belvoir, Virginia, USA","height":"5' 2\" (1.57 m)","bio":"Lauri Hendler was born on April 22, 1965 in Fort Belvoir, Virginia, USA. She is an actress, known for Gimme a Break! (1981), Les aventures de Zak et Crysta dans la forêt de FernGully (1992) and The Elder Scrolls V: Skyrim (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1ODA0NTI4NF5BMl5BanBnXkFtZTgwMDM1NTY3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0376661","name":"Lauri Hendler","idIMDB":"nm0376661"},"actorId":"nm0376661","character":"Nadine","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dana Plato","urlProfile":"http://www.imdb.com/name/nm0686818","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3ODUxMjU5NF5BMl5BanBnXkFtZTgwNjU4ODU1MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 November 1964","placeOfBirth":" Maywood, California, USA","birthName":"Dana Michelle Strain","height":"5' 2\" (1.57 m)","bio":"Dana Michelle Plato was born in Maywood, California, on Saturday 7 November 1964. Her first excursion into the film world occurred when she was eleven in the television film Beyond the Bermuda Triangle (1975). Dana never really made an impact on the TV screen until she landed the part of Kimberly Drummond in the TV hit sitcom Diff'rent Strokes (1978) from 1978-1984. After the series ended, Dana had a hard time trying to find other acting work. Sometimes she would surface in a made-for-TV movie or a low-budget film for the silver screen. Times were rough. Her marriage to Lanny Lambert lasted a year, but produced a son. She was arrested in 1991 for robbing a video store in Las Vegas but was placed on probation. The following year, Dana was, again, arrested for forging a prescription for Valium. Things were at a low ebb. She had just finished an interview with Howard Stern, in the spring of 1999, when she and her fiancé, Robert Menchaca, were headed back to California. The interview was one in which Dana hoped to revive her stalled career. They stopped at his parents' house in Moore, Oklahoma, for a weekend Mother's Day visit before continuing on to California. On Saturday, May 8, 1999, Dana died of what appeared to be an accidental overdose of a painkiller called \"Loritab\". Later, on May 21, a coroner's inquest ruled her death a suicide due to a large amount of drugs in her body and her history of past suicide attempts. She was 34 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3ODUxMjU5NF5BMl5BanBnXkFtZTgwNjU4ODU1MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0686818","name":"Dana Plato","idIMDB":"nm0686818"},"actorId":"nm0686818","character":"Cara Ames","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Crystal Bernard","urlProfile":"http://www.imdb.com/name/nm0004751","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2OTEwNjY0NV5BMl5BanBnXkFtZTYwMTMwNTky._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1961","placeOfBirth":" Garland, Texas, USA","birthName":"Crystal Lynn Bernard","height":"5' 4\" (1.63 m)","bio":"Crystal Bernard was born on September 30, 1961 in Garland, Texas, USA as Crystal Lynn Bernard. She is an actress, known for Wings (1990), It's a Living (1980) and Slumber Party Massacre II (1987).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2OTEwNjY0NV5BMl5BanBnXkFtZTYwMTMwNTky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004751","name":"Crystal Bernard","idIMDB":"nm0004751"},"actorId":"nm0004751","character":"Anne-Marie Conklin","urlCharacter":"http://www.imdb.com/character/ch0304814","main":true},{"actorName":"Anthony Edwards","urlProfile":"http://www.imdb.com/name/nm0000381","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NTk5ODY3Nl5BMl5BanBnXkFtZTcwNTE5MjcyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 July 1962","placeOfBirth":" Santa Barbara, California, USA","birthName":"Anthony Charles Edwards","height":"6' 2\" (1.88 m)","bio":"Anthony Edwards was born in Santa Barbara, California, on July 19, 1962, to a well-blended family. He is the youngest of five children, and the son of Erika Kem (Weber), a landscape painter and artist, and Peter Edwards, an architect. His mother was of German descent, and his father was of English, Irish, Scottish, and Spanish-Mexican ancestry. Edwards's parents encouraged him to act at age 16, which eventually led him to attending a summer workshop in London before graduating from high school. Returning to the United States, Edwards worked in commercials, jobs that helped him pay his education at The University of Southern California, where he studied acting. However, he dropped out of college and, in that same year, he had a small role in the movie Fast Times at Ridgemont High (1982), starring Sean Penn. The movie was a box office smash and Edwards was looking forward to doing more films. His first movie role was that of teen-aged \"John Muldowney\" in Heart Like a Wheel (1983) and his first starring role as nerdy \"Gilbert Lowell\", in Revenge of the Nerds (1984). Edwards didn't need to worry about being typecast as a socially-challenged loser. After starring in The Sure Thing (1985) and Gotcha! (1985), he landed another big-time successful movie Top Gun (1986), in which he played Tom Cruise's ill-fated easy-going navigator/best friend, Lt. Nick \"Goose\" Bradshaw. As Cruise rode Top Gun (1986) into the Hollywood stratosphere, Edwards also found his flight to stardom, at the same time. After Top Gun (1986), he reprised his role as Gilbert in the movie Revenge of the Nerds II: Nerds in Paradise (1987), before he starred in Summer Heat (1987). He also starred in Mr. North (1988), and Miracle Mile (1988), although they weren't too successful. Edwards began working in TV movies and continued to star in more box office movies such as Hawks (1988), How I Got Into College (1989), Downtown (1990), Pet Sematary II (1992), Landslide (1992) and Delta Heat (1992). The '90s won Edwards his best reviews for his recurring role of the quirky \"bubble man\" Mike Monroe on the popular television series Northern Exposure (1990). He was nominated for a Cable Ace Award in HBO's Sexual Healing (1993), and the following year, he starred in Charlie's Ghost Story (1995), before he played law clerk \"Clint Von Hooser\" in the John Grisham movie The Client (1994). This led to his most prominent role, as easy-going charismatic physician \"Dr. Mark Greene\" on the very popular TV series ER (1994). For his work on ER (1994), he was nominated for an Emmy Award four times For Outstanding Lead Actor in a Drama Series, but has never won. However, he has won a Golden Globe Award For Best Performance by an Actor-in-a-TV-Series, and was nominated four times, and also has two Screen Actor's Guild Awards. Prior to playing Dr. Greene, he also played bank breaker turned cold-blooded killer, \"Dick Hickock\" in the TV movie remake of Truman Capote's In Cold Blood (1996), which was the best TV movie of the 1996-97 season. During Edwards' hiatus on ER (1994), he went back to the box office circuit to star and to produce the movie Don't Go Breaking My Heart (1999), a complex movie which wasn't a big hit. Edwards, once again, returned to the set of ER (1994), and this time, he signed up for a salary that almost no actor could be paid, so his decision was to stay on the show for 3 more years and possibly to save the money in order to spend a lot of family time and to work on directing later. His first big roles after ER (1994) were that of \"Brains\" in the movie Thunderbirds (2004), and as \"Jim Paretta\" in The Forgotten (2004). In the many years that he starred on ER (1994), that show gave him more success in working on and off the set. Also, it gave him a spiritual blessing that so many popular actors have had over the years.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NTk5ODY3Nl5BMl5BanBnXkFtZTcwNTE5MjcyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000381","name":"Anthony Edwards","nicknames":["ACE"],"idIMDB":"nm0000381"},"actorId":"nm0000381","character":"Beau Middleton","urlCharacter":"http://www.imdb.com/character/ch0100878","main":true},{"actorName":"Frank Bank","urlProfile":"http://www.imdb.com/name/nm0052039","urlPhoto":"","biography":{"dateOfBirth":"12 April 1942","placeOfBirth":" Los Angeles, California, USA","bio":"Frank Bank was born on April 12, 1942 in Los Angeles, California, USA. He was an actor, known for The New Leave It to Beaver (1983), Leave It to Beaver (1957) and Leave It to Beaver (1997). He was married to Rebecca Fink, Jeri Lynn Handelman and Marlene Kay Blau. He died on April 13, 2013 in Los Angeles.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0052039","name":"Frank Bank","idIMDB":"nm0052039"},"actorId":"nm0052039","character":"Mr. Gerardi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elinor Donahue","urlProfile":"http://www.imdb.com/name/nm0231942","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNTgyMDI4OF5BMl5BanBnXkFtZTcwNTI5MzcxOA@@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 April 1937","placeOfBirth":" Tacoma, Washington, USA","birthName":"Mary Eleanor Donahue","bio":"Tap dancing at the age of 16 months, pert and pretty Elinor Donahue has been entertaining audiences for six decades. Born Mary Eleanor Donahue in Tacoma, Washington in 1937, she appeared as a radio singer and vaudeville dancer while still a mere toddler, then was picked up by Universal Studios at the age of 5. Cast in minor child roles in such pictures as Mister Big (1943), the precocious youngster eventually moved to MGM but didn't attain the juvenile stardom of a Margaret O'Brien or Elizabeth Taylor, whom she supported in both The Unfinished Dance (1947) and Love Is Better Than Ever (1952), respectively. Still and all, Elinor's talent and wholesome appeal was recognized and the 50s brought her into the TV era, where she became more accessible, finally winning nationwide \"girl-next-door\" notice in her late teens as the oldest daughter of \"ideal\" parents Robert Young and Jane Wyatt in the classic family show Father Knows Best (1954). Suffering more than her share of teen angst, she played Betty (\"Princess\") Anderson from 1954 to 1960. By the time the series was finished, she seemed ripe for romantic ingénues. She became Andy Griffith's first longstanding girlfriend on The Andy Griffith Show (1960) for one season, but then suffered a major slump. She revived in the 70s with steady roles on The Odd Couple (1970) (as Tony Randall's girlfriend), Mulligan's Stew: Pilot (1977) as a typical sunny mom, and as a guest for countless other shows, including Barnaby Jones (1973), Newhart (1982) and The Golden Girls (1985). An extremely pleasant personality, she was primarily tapped into playing nice, friendly, unflashy parts in both lightweight comedy and dramatic. Possessing a suitable voice for commercials and cartoons, she has lately found recurring roles on Dr. Quinn, Medicine Woman (1993) and a few soaps, including Santa Barbara (1984) and Days of Our Lives (1965), the latter in which she played a rare malicious part. Though she may not have had much of a chance to shine in her career, Elinor has certainly been a steady, reliable player who has not let her fans down with her obvious warmth and pleasing disposition. The widow of TV executive producer Harry Ackerman (he was 25 years her senior), whose list of credits included Leave It to Beaver (1957), Bewitched (1964) and Gidget (1965), and a mother of four sons, Elinor lives with her third husband, contractor Louis Genevrino (married since 1992), in California. In 1998, she published a memoir entitled \"In the Kitchen with Elinor Donahue\", in which she relived some of her memories of Hollywood along with providing more than 150 of her top-grade recipes.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNTgyMDI4OF5BMl5BanBnXkFtZTcwNTI5MzcxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0231942","name":"Elinor Donahue","idIMDB":"nm0231942"},"actorId":"nm0231942","character":"Mrs. Franklin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony Dow","urlProfile":"http://www.imdb.com/name/nm0235638","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3ODg5OTE5OF5BMl5BanBnXkFtZTYwNzY2Nzcz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 April 1945","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Tony Lee Dow","height":"5' 8\" (1.73 m)","bio":"Tony Dow was born on April 13, 1945 in Hollywood, Los Angeles, California, USA as Tony Lee Dow. He is an actor and director, known for Leave It to Beaver (1957), The New Leave It to Beaver (1983) and General Hospital (1963). He has been married to Lauren Shulkind since June 16, 1980. They have one child. He was previously married to Carol Marie Theresa Marlow.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3ODg5OTE5OF5BMl5BanBnXkFtZTYwNzY2Nzcz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0235638","name":"Tony Dow","idIMDB":"nm0235638"},"actorId":"nm0235638","character":"Principal Pete Kinney","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steve Franken","urlProfile":"http://www.imdb.com/name/nm0291266","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NzEzMjAyNV5BMl5BanBnXkFtZTcwNjE3MDYzOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 May 1932","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Stephen Robert Franken","height":"5' 6\" (1.68 m)","bio":"Steve Franken was born on May 27, 1932 in Queens, New York City, New York, USA as Stephen Robert Franken. He was an actor, known for Angels & Demons (2009), Westworld (1973) and The Party (1968). He was married to Jean Garrett and Julia E. Carter. He died on August 24, 2012 in Canoga Park, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NzEzMjAyNV5BMl5BanBnXkFtZTcwNjE3MDYzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0291266","name":"Steve Franken","idIMDB":"nm0291266"},"actorId":"nm0291266","character":"Dr. Fritz Hauptmann","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Nelson","urlProfile":"http://www.imdb.com/name/nm0625287","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODE5ODAyOV5BMl5BanBnXkFtZTcwNjMxNTIzNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 October 1936","placeOfBirth":" New York City, New York, USA","birthName":"David Oswald Nelson","bio":"David Nelson was born 24 October 1936, New York, New York to Ozzie Nelson and Harriet Nelson. He attended Hollywood High School. David was a film producer in Newport Beach and also directed several episodes of The Adventures of Ozzie & Harriet (1952). He started his own commercial production company. David had two boys by ex-wife, June Blair. Daniel Blair Nelson was born on August 20, 1962 and James Eric Nelson was born June 8, 1966 (both in Burbank, California at St. Joseph's Hospital) He married Yvonne O'Connor Huston in 1975, adopting her three children. His stepdaughter Teri Nelson was once married to game show host Chuck Woolery. His twin nephews Matthew and Gunnar perform as The Nelsons. Matthew Nelson also performs with Red37 and Gunnar Nelson is a radio host. Nephew Sam Nelson sings in h is orange and Niece Tracy Nelson is an accomplished actress.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODE5ODAyOV5BMl5BanBnXkFtZTcwNjMxNTIzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0625287","name":"David Nelson","nicknames":["Dave"],"idIMDB":"nm0625287"},"actorId":"nm0625287","character":"Mr. Krinsky, Janitor","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0085679","urlIMDB":"http://www.imdb.com/title/tt0085679","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 36 min (96 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":["Arriflex 35 BL3"],"laboratory":["Consolidated Film Industries (CFI), Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.6","filmingLocations":[{"location":"Covina, California, USA"}],"awards":[],"votes":"859","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0009850","name":"Hill/Mandelker Films"}],"keywords":{"keywords":["high school","high school student","high school senior","bus","nerd","automobile","blindness","teenager","convertible","preppie","car crash","impostor","detention","spoof"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:28:06"}}