{"data":{"movies":[{"title":"The Way of All Flesh","originalTitle":"","year":"1927","releaseDate":"19271001","directors":[{"name":"Victor Fleming","id":"nm0281808"}],"writers":[{"name":"Perley Poore Sheehan","id":"nm0790622"},{"name":"Lajos Biró","id":"nm0083742"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5OTIzNTEyNl5BMl5BanBnXkFtZTgwNzgxOTYyMjE@._V1.jpg","countries":["USA"],"languages":[],"genres":["Drama"],"plot":"The story takes place in Milwaukee during the early 1900s with a bank clerk named August Schiller who is happy with both his job and his family. He is tasked with transporting $1,000 in securities to Chicago. On the train he meets a blond seductress who convinces him to buy her a bottle of champagne, and takes him to a saloon. The next morning he awakes alone in a dilapidated bedroom and without the securities. He finds the woman and pleads with her to return the stolen securities. When he also threatens her he is knocked unconscious by the saloon owner and dragged to a nearby railroad track. As the crooks strips him of his ID and papers, Schiller recovers and struggles with the saloon owner, ultimately throwing him into the path of an oncoming train, killing him. Schiller flees and, as he is about to take his own life, sees in a newspaper that he is supposedly dead. The saloon owner's mangled body had been identified as Schiller's. Twenty years pass. Schiller is now aged and unkempt,...","simplePlot":"The story takes place in Milwaukee during the early 1900s with a bank clerk named August Schiller who is happy with both his job and his family. He is tasked with transporting $1,000 in ... ","actors":[{"actorName":"Emil Jannings","urlProfile":"http://www.imdb.com/name/nm0417837","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NzYyNTQ1Nl5BMl5BanBnXkFtZTgwMjc4NjcwMzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 July 1884","placeOfBirth":" Rorschach, St. Gallen, Switzerland","birthName":"Theodor Friedrich Emil Janenz","height":"6' (1.83 m)","bio":"His real name was Theodor Friedrich Emil Janenz, and in the early 1900s, he was already working in the theater under Max Reinhardt's company. Important movies where he defined himself as a convincing actor were Passion (1919) and Quo Vadis? (1924), followed by The Last Laugh (1924)(aka The Last Laugh) in 1924 and Variety (1925) (aka Variety) in 1925. In 1928, he became the first male leading actor to receive the academy award for The Last Command (1928) directed by Josef von Sternberg. In 1929, Stenberg directed him in his world famous movie The Blue Angel (1930) (aka The Blue Angel) co-starring the young Marlene Dietrich (her first role). Later on, he concentrated on theater and dedicated his acting skills to the Nazi regime and also took part in the realization of Le président Krüger (1941) in 1941, an expensive anti-British film production. When the Second World War ended, the US government cleaned his image, and he converted to catholicism. He played in a few more German movies, but his career never recaptured its brilliance.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NzYyNTQ1Nl5BMl5BanBnXkFtZTgwMjc4NjcwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0417837","name":"Emil Jannings","idIMDB":"nm0417837"},"actorId":"nm0417837","character":"August Schilling","urlCharacter":"http://www.imdb.com/character/ch0041099","main":true},{"actorName":"Belle Bennett","urlProfile":"http://www.imdb.com/name/nm0071602","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMjk4MzAzM15BMl5BanBnXkFtZTgwMzQ0MjI1MzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 April 1891","placeOfBirth":" Milaca, Minnesota, USA","bio":"Belle Bennett was born on April 22, 1891 in Milaca, Minnesota, USA. She was an actress, known for The Iron Mask (1929), Their Own Desire (1929) and The Way of All Flesh (1927). She was married to Jack Oaker and William Macy . She died on November 4, 1932 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMjk4MzAzM15BMl5BanBnXkFtZTgwMzQ0MjI1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0071602","name":"Belle Bennett","idIMDB":"nm0071602"},"actorId":"nm0071602","character":"Mrs. Schilling","urlCharacter":"http://www.imdb.com/character/ch0504564","main":true},{"actorName":"Phyllis Haver","urlProfile":"http://www.imdb.com/name/nm0369793","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NTU2NjE0OV5BMl5BanBnXkFtZTgwOTM5NTM1MzE@._V1._CR109,131,530,703_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 January 1899","placeOfBirth":" Douglass, Kansas, USA","birthName":"Phyllis O'Haver","height":"5' 4½\" (1.64 m)","bio":"Phyllis Haver was born Phyllis O'Haver on January 6, 1899, in Douglas, KS. When she was a child her family moved to California. Young Phyllis got a job playing piano at a local movie theater. Producer Mack Sennett saw her and hired her to be one of his \"Sennett Bathing Beauties\". Between 1916-20 she appeared in more than 35 short films. With her curvy figure and blonde hair she quickly became one of the most popular of Sennett's bathing beauties. Eventually she left Sennett compact and signed a contract with Cecil B. DeMille. She co-starred with Olive Borden in Fig Leaves (1926) and with Victor McLaglen in What Price Glory (1926). She also won rave reviews for her performances as Roxie Hart in Chicago (1927). In 1929 she married millionaire William Seeman. Although she was at the peak of her career, she decided to retire from acting. She and William moved into an 11-room penthouse in New York City. Phyllis said she loved being a wife and never wanted to return to Hollywood. Sadly, after 16 years of marriage she and William divorced. The couple had no children. As she grew older Phylis became more reclusive. She lived in a large house in Connecticut and rarely had visitors. Her only companion was her longtime housekeeper. She reportedly made several suicide attempts and was devastated when her former boss Mack Sennett died. On November 19, 1960, 61-year-old Phyllis took her own life with an overdose of barbiturates. She was found in her bed fully dressed and wearing make-up. Phyllis was buried at Grassy Hills Cemetery in Falls Village, CT.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NTU2NjE0OV5BMl5BanBnXkFtZTgwOTM5NTM1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0369793","name":"Phyllis Haver","idIMDB":"nm0369793"},"actorId":"nm0369793","character":"The Temptress","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Donald Keith","urlProfile":"http://www.imdb.com/name/nm0445229","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2IyOWJjMjAtZTJhNi00ODM0LWExNzktODRkOWRjYzRhODMzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1903","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Francis Feeney","height":"6' (1.83 m)","bio":"Donald Keith was born on September 6, 1903 in Boston, Massachusetts, USA as Francis Feeney. He was an actor, known for The Plastic Age (1925), Parisian Love (1925) and My Lady of Whims (1925). He was married to Kathryn Spicuzza. He died on August 1, 1969 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2IyOWJjMjAtZTJhNi00ODM0LWExNzktODRkOWRjYzRhODMzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0445229","name":"Donald Keith","idIMDB":"nm0445229"},"actorId":"nm0445229","character":"August Jr.","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fred Kohler","urlProfile":"http://www.imdb.com/name/nm0463264","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjgxYjFlY2QtYThiNy00YTNhLWFhYjEtNWZiNWFkZWM1ZGU4XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1887","placeOfBirth":" Burlington, Iowa, USA","birthName":"Fredrick L. Kohler","height":"6' (1.83 m)","bio":"Prolific \"heavy\" in American films of the silent and early talkie eras. A native of Kansas City, Missouri, Kohler left home as a teenager, working various jobs while trying to establish a career in vaudeville. During this time, according to his son, actor Fred Kohler Jr., Kohler worked in a mine and lost part of his right hand in a dynamite accident. Eventually he fell in with a touring theatrical company and worked onstage around the U.S. for several years. In his mid-twenties, he ended up in California and found roles in silent films. He quickly found a niche as a villain, by virtue of his imposing size and his fearsome features, typically and most memorably in The Iron Horse (1924). He worked primarily in Westerns, but films of all sorts benefitted from his skill at screen nastiness. In a series of silent Paramount Westerns based on Zane Grey novels, Kohler not only played the heavy, but also repeated some of the roles when these films were remade as talkies a decade later. His career lasted without let-up until his sudden death from a heart attack at 50 in 1938.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjgxYjFlY2QtYThiNy00YTNhLWFhYjEtNWZiNWFkZWM1ZGU4XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0463264","name":"Fred Kohler","idIMDB":"nm0463264"},"actorId":"nm0463264","character":"The Tough","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Philippe De Lacy","urlProfile":"http://www.imdb.com/name/nm0209462","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzODcxMzIwMl5BMl5BanBnXkFtZTYwNjQyMjky._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 July 1917","placeOfBirth":" Nancy, France","height":"5' 5\" (1.65 m)","bio":"Born in France during a World War I air raid in which his mother was killed, Philippe was adopted by Mrs. Edith DeLacy, who was associated with the Women's Overseas Hospital. After the war ended, Mrs. Lacy brought Philippe to America where his stunning looks soon made him a sought after model for advertisements and eventually brought him to the screen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzODcxMzIwMl5BMl5BanBnXkFtZTYwNjQyMjky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0209462","name":"Philippe De Lacy","idIMDB":"nm0209462"},"actorId":"nm0209462","character":"August - as a Child","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mickey McBan","urlProfile":"http://www.imdb.com/name/nm0564236","urlPhoto":"","biography":{"dateOfBirth":"27 February 1919","placeOfBirth":" Spokane, Washington, USA","bio":"Mickey McBan was born on February 27, 1919 in Spokane, Washington, USA. He was an actor, known for Hot Water (1924), Sorrell and Son (1927) and Peter Pan (1924). He died on October 30, 1979 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0564236","name":"Mickey McBan","idIMDB":"nm0564236"},"actorId":"nm0564236","character":"Evald","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Betsy Ann Hisle","urlProfile":"http://www.imdb.com/name/nm0386808","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmRjYzg3MjktZGNhNC00N2VmLTg5NTAtNDNkOWJkYTg3ZmI3XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 May 1917","placeOfBirth":" Seattle, Washington, USA","birthName":"Juanita J. Hisle","bio":"Betsy Ann Hisle was born on May 30, 1917 in Seattle, Washington, USA as Juanita J. Hisle. She was an actress, known for Nellie, the Beautiful Cloak Model (1924), The Way of All Flesh (1927) and Sorrell and Son (1927). She died on September 20, 1978 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmRjYzg3MjktZGNhNC00N2VmLTg5NTAtNDNkOWJkYTg3ZmI3XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0386808","name":"Betsy Ann Hisle","idIMDB":"nm0386808"},"actorId":"nm0386808","character":"Charlotte","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carmencita Johnson","urlProfile":"http://www.imdb.com/name/nm0424719","urlPhoto":"","biography":{"dateOfBirth":"31 March 1923","placeOfBirth":" Los Angeles, California, USA","bio":"When just a few month old, Carmencita Johnson started appearing in the \"Our Gang\" shorts. As a child she appeared in some of the better known silent features such as \"The Way of All Flesh,\" \"The Winning of Barbara Worth\" and \"The Wind.\" She worked in many films in the 30's, and in the 40's she modeled some, acted, and was an occasional stand-in for Lana Turner. She swam in Ester Williams' aquatic movies. Probably her best known scene was on the last movie she worked on, \"A Place In The Sun.\" Besides being one of the Liz Taylor's friends, Carmen doubles for Shelly Winters when the Montgomery Cliff character murders the Winters character by pushing her into the lake (or did he?). Carmencita married in 1949 and soon thereafter retired from film work. She and her husband Jack Robertson moved to Ojai, California, in 1961, where she became a tireless supporter of the arts. She helped form the Arts Advisory Board. She was selected Ojai Valley Woman of the Year in 1985, and was the longtime publicist for artist George Stuart. A number of the films Carmen appeared in have been \"lost\" including the Academy Award winning movie \"The Way of All Flesh.\" She died in a car accident in September 2000.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0424719","name":"Carmencita Johnson","idIMDB":"nm0424719"},"actorId":"nm0424719","character":"Elizabeth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gordon Thorpe","urlProfile":"http://www.imdb.com/name/nm0861663","urlPhoto":"","biography":{"dateOfBirth":"11 August 1922","placeOfBirth":" Lakin, Kansas, USA","bio":"Gordon Thorpe was born in Lakin, Kansas where he was raised until age five. His father, Harold Thorpe, independently wealthy, with a reputation for owning the largest cars available, then divorced Gordon's mother, Lois, and he later moved to Reno, Nevada, where he worked as an expert card dealer until retirement. Gordon, with his mother, moved to Los Angeles, to stay at the family mansion there on W.3rd Street. Noteworthy, Gordon's family, including Gordon, of course, were well connected and listed in all the social registers of the day, including \"The Blue Book\". Lois used these social connections to get Gordon special attention for a screen test, at which his talent was immediately discovered and he quickly rose to become one of the top child stars of the silent era. He was one of the chosen few able to maintain the same status into \"The Talkies\"throughout the 1930's. Gordon starred in features with many of the great actors of the day, Including Douglas Fairbanks, Errol Flynn, Basil Rathbone, Jackie Cooper, among others. Yet all was not rosy for young Gordon. Though famous for his beautiful head of long curly hair, this became a curse as Gordon had to quite often defend his young masculinity against the short manes of the day, and developed a strong reputation as a fighter. Unfortunately, his frequent fights, though nearly all defensive, still got him into hot water with the studios and Lois, now an overbearing stage mother. This was a source of great distress for Gordon, and often kept him from pursuing or winning even more important roles. At age 16, in the famous movie \"Dawn Patrol\", he portrayed a young, brave fighter-pilot. This was pivotal for Gordon, as he was finally seen no longer as a \"cute child\", but rather as a fine strong young man. It was as much the acceptance in his role here as the character itself that motivated Gordon to leave films, go back to Kansas, go to college, only to later join the Army Air Corps upon the outbreak of the Second World War. He did enlist for fighter pilot duty, and was commissioned as a bombardier. He flew 47 wartime bombing missions in Europe, serving heroically, receiving the Distinguished Flying Cross and three Purple Hearts. Shot down and wounded three times, figuring the odds were likely for not surviving a fourth crash-landing, he politely requested a transfer. As reward for his heroic and loyal duty, he was promptly transferred to the OSS, where he was flown over Yugoslavia, and THROWN out of the plane. With a parachute,and an instruction manual on how to use it, he managed to safely land behind enemy lines. Captain Gordon Thorpe became principal in the formation of the Yugoslavian partisan resistance He used his charisma, his international reputation as a movie actor, and his bravery under fire, to motivate and help win back Yugoslavia at the end of the war. Though not the duty he expected, Gordon turned these events into his finest hour. Following the war, he married Jeanne Selby, a screen cartoonist for Universal Studios. He tried his hand at business being immediately recruited by IBM. Prior to his divorce in 1952, brought about by his recall to active service at the outset of the Korean War, he had one son, Anthony C. Thorpe. As a side note, Anthony did also inherit Gordon's great hair and good looks, but, seeing the perils his father encountered, he was discouraged from ever seeking a role in front of the camera. Anthony does however work in the industry even today, as Property Master and in other crew positions, having done so for over 30 years and with 100's of hours of Film and TV. Gordon served again in the Korean War as an infantry commander. It seems that as the Army Air Corp was dissolved,his commission was reverted to the regular Army. Again, Gordon seemed to inherit the duties he least desired. He once remarked to his son, \"I'd gladly fight the Second World War three times again if it meant I didn't have to go to Korea once!\" He served bravely again, at the front lines until the end of the war, was wounded, suffered from a grenade blast, and was never the same person again. In the years following he lived a colorful though not prosperous existence. He lived in various locales throughout the western United States until he settled down, remarried and managed his own coffeehouse in Sacramento,Ca. from the 1970's until his passing in 1989. He is survived by his son, Anthony C. Thorpe, and one grandson, Morgan Cantrell Thorpe.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0861663","name":"Gordon Thorpe","idIMDB":"nm0861663"},"actorId":"nm0861663","character":"Karl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jackie Combs","urlProfile":"http://www.imdb.com/name/nm0177702","urlPhoto":"","biography":{"bio":"Jackie Combs is an actor, known for Watch My Smoke (1929), No Sale Smitty (1928) and Circus Time (1929).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0177702","name":"Jackie Combs","idIMDB":"nm0177702"},"actorId":"nm0177702","character":"Heinrich","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dean Harrell","urlProfile":"http://www.imdb.com/name/nm0364086","urlPhoto":"","biography":{"dateOfBirth":"29 August 1908","placeOfBirth":" Missouri, USA","bio":"Dean Harrell was born on August 29, 1908 in Missouri, USA. He was an actor, known for The Way of All Flesh (1927), In Old Kentucky (1927) and Loves of an Actress (1928). He died on July 5, 1974 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0364086","name":"Dean Harrell","idIMDB":"nm0364086"},"actorId":"nm0364086","character":"Evald","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anne Sheridan","urlProfile":"http://www.imdb.com/name/nm0792131","urlPhoto":"","biography":{"dateOfBirth":"27 September 1908","placeOfBirth":" Wichita, Kansas, USA","birthName":"Gloria Hellar","height":"5' 3½\" (1.61 m)","bio":"Anne Sheridan was born on September 27, 1908 in Wichita, Kansas, USA as Gloria Hellar. She was an actress, known for Galloping Thunder (1927), Cross Breed (1927) and The Galloping Jinx (1925). She died on September 29, 2008 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0792131","name":"Anne Sheridan","idIMDB":"nm0792131"},"actorId":"nm0792131","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nancy Drexel","urlProfile":"http://www.imdb.com/name/nm0237770","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGUwY2NiZWItZTJjNC00ZDU0LWE0NzQtYjBkZmNlZmMxMGE3L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 April 1910","placeOfBirth":" New York City, New York, USA","birthName":"Dorothy Kitchen","bio":"Nancy Drexel was born on April 6, 1910 in New York City, New York, USA as Dorothy Kitchen. She was an actress, known for Riley the Cop (1928), The Man from Hell's Edges (1932) and Texas Buddies (1932). She was married to Thomas H. Ince Jr.. She died on November 19, 1989 in San Juan Capistrano, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGUwY2NiZWItZTJjNC00ZDU0LWE0NzQtYjBkZmNlZmMxMGE3L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0237770","name":"Nancy Drexel","idIMDB":"nm0237770"},"actorId":"nm0237770","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0019553","urlIMDB":"http://www.imdb.com/title/tt0019553","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 34 min (94 min)"],"soundMix":["Silent"],"color":["Black and White"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":["2,586 m (9 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.0","filmingLocations":[{"location":"Paramount Studios - 5555 Melrose Avenue, Hollywood, Los Angeles, California, USA"}],"awards":[{"award":"Academy Awards, USA 1929","titlesAwards":[{"titleAwardOutcome":"Won Oscar","categories":[{"category":"Best Actor in a Leading Role","names":[{"name":"Emil Jannings","id":"nm0417837","role":null},{"name":"The Last Command","id":"tt0019071","role":null}]}]}]}],"votes":"83","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["children","lost film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:52:41"}}