{"data":{"movies":[{"title":"Fear Is the Key","originalTitle":"","year":"1972","releaseDate":"19750213","directors":[{"name":"Michael Tuchner","id":"nm0875744"}],"writers":[{"name":"Alistair MacLean","id":"nm0533745"},{"name":"Robert Carrington","id":"nm0140588"}],"runtime":"103 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NDQwOTU2N15BMl5BanBnXkFtZTgwNjE3MTkwMzE@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Action","Crime","Drama","Thriller"],"plot":"Following the death of his family in an aeroplane crash, a man plots an elaborate revenge scheme on those responsible. By setting himself up as a criminal, he plans to get close to a certain tycoon who has been approached by the culprits to help them retrieve the cargo of the lost plane.","simplePlot":"Following the death of his family in an aeroplane crash, a man plots an elaborate revenge scheme on those responsible. By setting himself up as a criminal, he plans to get close to a ... ","actors":[{"actorName":"Barry Newman","urlProfile":"http://www.imdb.com/name/nm0628017","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NjA3NDUwOV5BMl5BanBnXkFtZTcwMzE4ODU5NA@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 November 1938","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Barry Foster Newman","height":"6' (1.83 m)","bio":"An unlikely early 1970s cult star, actor Barry Newman managed it with one of his first movies, as Kowalski, the weary ex-cop loaded up on drugs, who takes it on himself to drive from Denver to San Francisco in 15 hours pursued by the police in the counterculture road flick Vanishing Point (1971). The adventures of this rebel without a cause certainly shows its age nowadays, but back then it had the requisite existential feel and most certainly was a symbolic sign of the times a la Peter Fonda's Easy Rider (1969). Newman showed himself off as the new kind of brooding anti-hero that the average-looking Dustin Hoffman and Al Pacino were making popular at the time. Newman didn't hit the kind of heights that Hoffman and Pacino achieved, but has continued on solidly for three decades in tough-talking supports. Barry was born in 1938 in Boston, to an Austrian Jewish father and a Russian Jewish mother. He graduated from Brandeis University with a degree in anthropology, but turned to acting and the New York scene after \"crashing\" a class at the Actor's Studio. Throughout the 1960s, he appeared on stage in such plays as \"Night Life\", \"The Mouse Trap\" and \"What Makes Sammy Run?\" A couple of minor films came his way, including Pretty Boy Floyd (1960). It was his hard-hitting role in The Lawyer (1970) that finally opened the doors needed to get ahead and then Vanishing Point (1971). His cocky, self-assured presence made him even sexier than he appeared. He carried this attitude into his own TV series Petrocelli (1974), in the 1970s, playing a hot-shot attorney but, following the show's demise, his career flattened out. An obvious talent, Newman's later films such as Amy (1981), Daylight (1996) and The Limey (1999) have managed to keep him in the public eye.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NjA3NDUwOV5BMl5BanBnXkFtZTcwMzE4ODU5NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0628017","name":"Barry Newman","idIMDB":"nm0628017"},"actorId":"nm0628017","character":"John Talbot","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Suzy Kendall","urlProfile":"http://www.imdb.com/name/nm0447648","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NjU4NjI5OV5BMl5BanBnXkFtZTcwMTY2NjQ3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1944","placeOfBirth":" Belper, Derbyshire, England, UK","birthName":"Freda A Harrison","height":"5' 4\" (1.63 m)","bio":"A doe-eyed, honey-blond actress of extraordinary beauty, Suzy Kendall was one of the most popular British actresses of the 1960s. Yet, she never really sought the spotlight and accepted fame only reluctantly. Born as Freida Harrison, her goal was actually to be a clothing designer and, in fact, she majored in fabric and fashion design at Derby College. In pursuing her studies, she inevitably ran into fashion photographers and agents. With few exceptions, they were very taken by her looks and urged her to go into modeling. While not particularly interested in that line of work, she was flattered by the compliments and saw a chance to make some extra income. In addition, she saw it as a way to draw attention to her fashion ideas. So, she signed up with a recommended agency, who gave her the name Suzy Kendall. To her surprise, she immediately was in constant demand. This was at a time when there was increased crossover in the British entertainment industry, with singers appearing in motion pictures. Before long, she began to receive film offers and, while not trained as an actress, was persuaded by her agents to accept film and television roles. The first roles were minor in nature, but included a part in the spy caper The Liquidator (1965), which was a major success. She became internationally known with her prominent role in To Sir, with Love (1967), a sort of British version of Blackboard Jungle (1955). That same year, she starred in the crime thriller The Penthouse (1967), playing a woman taken hostage by violent criminal predators. She disliked the film, but it was a major hit. It was around this time that she met the highly talented and famous but insecure Dudley Moore, with whom she co-starred in 30 Is a Dangerous Age, Cynthia (1968). They immediately hit it off and gradually became a couple, marrying in 1968. At Moore's urging, she accepted the title role in Fraulein Doktor (1969), in which she plays a World War I femme fatale, based on Mata Hari. In spite of some good reviews, it was not a success. However, her career was boosted again in L'oiseau au plumage de cristal (1970), in which she plays the girlfriend of a murder suspect who becomes the target of the real killer. The film was an international success and made director Dario Argento a household name among horror fans. By this time, she wanted to become a mother and cut back on her career. But Moore's career had found worldwide success and he didn't think the time was right for raising children. This and their increasing time spent apart took a toll, and they subsequently divorced. However, their marriage ended amicably and they remained good friends for the remainder of his life. She continued to work through the 1970's, mostly as threatened heroines in violent horror films of uneven quality. She soon found herself in a professional rut in an industry that wasn't all that important to her. She remarried and settled into a private life, concentrating on her marriage and raising their child. She did briefly return to the public eye in 2002, when she hosted a memorial service for her late former husband, Moore, who was friends not only with her but her current husband, as well, even giving their daughter piano lessons. Her daughter, Elodie Harper, is a journalist with the British Broadcasting Corporation.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NjU4NjI5OV5BMl5BanBnXkFtZTcwMTY2NjQ3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0447648","name":"Suzy Kendall","idIMDB":"nm0447648"},"actorId":"nm0447648","character":"Sarah Ruthven","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Vernon","urlProfile":"http://www.imdb.com/name/nm0006893","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNTM5MTQ1Ml5BMl5BanBnXkFtZTcwMzYwMzgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1932","placeOfBirth":" Zehner, Saskatchewan, Canada","birthName":"Adolphus Raymondus Vernon Agopsowicz","height":"6' 2\" (1.88 m)","bio":"John Vernon was a prolific stage-trained Canadian character player who made a career out of convincingly playing crafty villains, morally-bankrupt officials and heartless authority figures in American films and television since the 1960s. Vernon has been directed by some stellar filmmakers including Alfred Hitchcock (Topaz (1969)); George Cukor (Justine (1969)); Don Siegel (Dirty Harry (1971)) and Clint Eastwood (The Outlaw Josey Wales (1976)). After training at London's Royal Academy of Dramatic Art and honing his skills in Canadian theatre and television, Vernon made his US film debut in John Boorman's noir/gangster classic Point Blank (1967) as a trusted friend who betrays Lee Marvin. He again failed to inspire confidence as the ineffectual mayor of San Francisco in Dirty Harry (1971). Vernon may be best remembered as the sinister Dean Vernon Wormer in John Landis' Animal House (1978), a role he reprised for the TV spin-off Delta House (1979). This led to more film comedy roles, a highlight being Mr. Big in the blaxploitation spoof I'm Gonna Git You Sucka (1988).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNTM5MTQ1Ml5BMl5BanBnXkFtZTcwMzYwMzgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006893","name":"John Vernon","idIMDB":"nm0006893"},"actorId":"nm0006893","character":"Vyland","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dolph Sweet","urlProfile":"http://www.imdb.com/name/nm0842248","urlPhoto":"","biography":{"dateOfBirth":"18 July 1920","placeOfBirth":" New York City, New York, USA","birthName":"Adolphus Jean Sweet","height":"5' 9\" (1.75 m)","bio":"A barrel-chested, bull-necked presence on stage, film and TV, the tough-minded character actor was born Adolphus Jean Sweet in New York City on July 18, 1920, the son of an auto mechanic. He initially attended the University of Alabama in 1939, but his studies were interrupted by WWII Air Force duty. As a navigator of B-24s, he was shot down during a raid and captured, spending two years as a POW in Germany. For his valor he was honored with the Distinguished Flying Cross and The Purple Heart. A semi-pro football player and a boxer at one point, he received his Masters from Columbia University in 1949 at age 29. He subsequently became the head of the drama division of the English Department at Barnard College from 1949 to 1961. During this period of time he studied voice with Peyton Hibbett, took intensive acting classes with Tamara Daykarhanova and Joseph Anthony at the Daykarhanova School for the Stage in New York City, and appeared in random stock productions in the hopes of one day pursuing a professional career full-time. The 40-something-year-old Sweet finally made his New York/Broadway debut in the Zero Mostel starrer \"Rhinoceros\" in 1961, and continued on the Great White Way with outstanding parts in \"Romulus\" (1962), \"The Sign in Sidney Brustein's Window in 1964 (and its 1972 revival) and \"Streamers\" in 1976. Making his TV debut with \"The Defenders\" in 1961, Dolph quickly became a veteran of blue-collar cop shows including \"East Side, West Side\" and \"The Trials of O'Brien.\" In the late 1960s he started making a dent in soap operas with regular roles on Dark Shadows (1966), The Edge of Night (1956), Somerset (1970) and especially Another World (1964), where he remained for five seasons (1972-1977) playing (of course) Police Chief Gil McGowan, the second husband of Constance Ford's beloved Ada Davis character. Dolph received rather scant notice for his film roles despite some good scenes in such movies as Fear Is the Key (1972) and Go Tell the Spartans (1978). TV proved to be a more accepting medium for the actor. He portrayed J. Edgar Hoover in the \"King\" miniseries in 1978 and in the early 1980s the portly character player won a change-of-pace comedy lead in the popular sitcom Gimme a Break! (1981) in which he played (naturally) a police chief, Carl Kanisky, a widower whose household was run by the irrepressible Nell Carter. During the show's run, Dolph was stricken with cancer and would die on May 8, 1985. At the beginning of the 1985-1986 season, the chief's passing was incorporated into the script and Nell became surrogate mother and father to his children. In real-life, the 64-year-old actor was survived by his second wife of 11 years, actress Iris Braun, and son Jonathan from his first marriage to Reba Gillespie, which ended in divorce in 1973.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0842248","name":"Dolph Sweet","idIMDB":"nm0842248"},"actorId":"nm0842248","character":"Jablonsky","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ben Kingsley","urlProfile":"http://www.imdb.com/name/nm0001426","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU2Njg2NzM4M15BMl5BanBnXkFtZTgwNjYwNjQwMTI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1943","placeOfBirth":" Scarborough, Yorkshire, England, UK","birthName":"Krishna Bhanji","height":"5' 8\" (1.73 m)","bio":"Ben Kingsley was born Krishna Bhanji on December 31, 1943 in Scarborough, Yorkshire, England. His father, Rahimtulla Harji Bhanji, was a Kenyan-born medical doctor, of Gujarati Indian descent, and his mother, Anna Lyna Mary (Goodman), was an English actress. Ben began to act in stage plays during the 1960s. He soon became a successful stage actor, and also began to have roles in films and television. His birth name was Krishna Bhanji, but he changed his name to \"Ben Kingsley\" soon after gaining fame as a stage actor, fearing that a foreign name could hamper his acting career. Kingsley first earned international fame for his performance in the drama movie Gandhi (1982). His performance as Mohandas K. Gandhi earned him international fame. He won many awards - including an Academy Award for Best Actor. He also won Golden Globe, BAFTA and London Film Critics' Circle Awards. After acting in Gandhi (1982), Ben was recognized as one of the finest British actors. After his international fame for appearing in Gandhi (1982), Kingsley appeared in many other famous movies. His success as an actor continued. His performance as Itzhak Stern in the drama movie Schindler's List (1993) earned him a BAFTA nomination. Schindler's List (1993) won seven Academy Awards, including Best Picture. During the late 1990s, Kingsley acted in many successful movies. He played Sweeney Todd in the television movie The Tale of Sweeney Todd (1997). For his performance in this movie, he was nominated for the Screen Actors' Guild Award. His other notable role was as Otto Frank in the television movie Anne Frank (2001), for which he won a Screen Actors' Guild Award. In 2002, Kingsley was appointed Knight Bachelor of the Order of the British Empire in the Queen's New Years Honours for his services to drama. In 2013, he received the BAFTA Los Angeles Britannia Award for Worldwide Contribution to Filmed Entertainment. That same year, he also received the Fellowship Award at the Asian Awards in London, England. Ben Kingsley currently resides in Spelsbury, Oxfordshire, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU2Njg2NzM4M15BMl5BanBnXkFtZTgwNjYwNjQwMTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001426","name":"Ben Kingsley","idIMDB":"nm0001426"},"actorId":"nm0001426","character":"Royale","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ray McAnally","urlProfile":"http://www.imdb.com/name/nm0564044","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NDI3OTc3N15BMl5BanBnXkFtZTcwNjM2MDAxMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 March 1926","placeOfBirth":" Buncrana, County Donegal, Ireland","bio":"Although Irish character actor Ray McAnally would become one of his country's most revered stage actors, he will be forever remembered by audiences both here and abroad for a couple of films he made during the last years of his life. Born in the seaside town of Buncrana and the son of a bank manager, he was educated at St. Eunan's College and entered a seminary at the age of 18. Lucky for us stage and filmgoers, the priesthood proved not to be his calling, and he departed after only a brief time. He joined the Abbey Theatre in 1947 where he met and married actress Ronnie Masterson. They would later form Old Quay Productions and present an assortment of classic plays in the 60s and 70s. He made a triumphant London theatre debut in 1962 with \"A Nice Bunch of Cheap Flowers\" and gave a towering performance as George in \"Who's Afraid of Virginia Woolf?\" opposite legendary British actress, Constance Cummings, at the Piccadilly Theatre. He routinely acted in the Abbey and Irish festivals, but then, in the last decade of life, achieved award-winning notice on TV and films. His impressive performance as Cardinal Altamirano in the film The Mission (1986) earned him Evening Standard and BAFTA awards. His role in the BBC production of A Perfect Spy (1987) also earned him a BAFTA award. In the last year of his life, he was absolutely awe-inspiring as Daniel Day-Lewis' father in the Academy Award-winning film My Left Foot (1989), the story of cerebral palsy victim Christy Brown, who overcame his severe disability to become a flourishing artist and writer. McAnally died suddenly of a heart attack on June 15th of that year and received a posthumous BAFTA award for this last movie in 1990. A fitting end to a versatile, galvanizing talent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NDI3OTc3N15BMl5BanBnXkFtZTcwNjM2MDAxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0564044","name":"Ray McAnally","idIMDB":"nm0564044"},"actorId":"nm0564044","character":"Ruthven","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Marinker","urlProfile":"http://www.imdb.com/name/nm0547707","urlPhoto":"","biography":{"bio":"Peter Marinker is known for his work on Event Horizon (1997), Love Actually (2003) and Judge Dredd (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0547707","name":"Peter Marinker","idIMDB":"nm0547707"},"actorId":"nm0547707","character":"Larry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elliott Sullivan","urlProfile":"http://www.imdb.com/name/nm0838057","urlPhoto":"","biography":{"dateOfBirth":"4 July 1907","placeOfBirth":" San Antonio, Texas, USA","bio":"Elliott Sullivan was born on July 4, 1907 in San Antonio, Texas, USA. He is known for his work on The Great Gatsby (1974), The Sergeant (1968) and Vampyres (1974). He died on June 2, 1974 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0838057","name":"Elliott Sullivan","idIMDB":"nm0838057"},"actorId":"nm0838057","character":"Judge Mollison","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roland Brand","urlProfile":"http://www.imdb.com/name/nm0104520","urlPhoto":"","biography":{"dateOfBirth":"29 November 1929","placeOfBirth":" Montreal, Quebec, Canada","birthName":"Roland Ernest Leptich","bio":"Roland Brand was born on November 29, 1929 in Montreal, Quebec, Canada as Roland Ernest Leptich. He was an actor, known for Lolita (1962), Chato's Land (1972) and Fear Is the Key (1972). He died in 1984 in Wigan, Lancashire, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0104520","name":"Roland Brand","idIMDB":"nm0104520"},"actorId":"nm0104520","character":"Deputy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony Anholt","urlProfile":"http://www.imdb.com/name/nm0030022","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTYyMjY2NTE4MF5BMl5BanBnXkFtZTgwNzYyNTM0MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 January 1941","placeOfBirth":" Singapore","birthName":"Anthony Anholt","height":"5' 9¾\" (1.77 m)","bio":"Tony Anholt was born on January 19, 1941 in Singapore as Anthony Anholt. He was an actor, known for Howards' Way (1985), The Protectors (1972) and Space: 1999 (1975). He was married to Tracey Childs and Sheila Willet. He died on July 26, 2002 in London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTYyMjY2NTE4MF5BMl5BanBnXkFtZTgwNzYyNTM0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0030022","name":"Tony Anholt","idIMDB":"nm0030022"},"actorId":"nm0030022","character":"FBI Man","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0068576","urlIMDB":"http://www.imdb.com/title/tt0068576","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"SEK","country":"4,111,251","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 43 min (103 min) (USA)","1 hr 39 min (99 min) (Germany)"],"soundMix":["Mono"],"color":["Color (Technicolor)"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["Technicolor, London, UK"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision"],"printedFilmFormat":["35 mm"]},"rating":"6.3","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"PG","awards":[],"votes":"976","type":"Movie","companyCreditsSimple":[{"idCompany":"co0056416","name":"Anglo-EMI"},{"idCompany":"co0103436","name":"KLK"}],"keywords":{"keywords":["revenge","loss of family","fight","arrest","radio","rain","submersible","bathyscaphe","helicopter","murder","deception","underwater","oil rig","boat","millionaire","louisiana","car chase","diving","kidnapping","chase","trial","police","speed","automobile","water","based on novel","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 00:51:29"}}