{"data":{"movies":[{"title":"Tampico","originalTitle":"","year":"1944","releaseDate":"19440410","directors":[{"name":"Lothar Mendes","id":"nm0578985"}],"writers":[{"name":"Ladislas Fodor","id":"nm0283780"},{"name":"Ladislas Fodor","id":"nm0283780"}],"runtime":"75 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjgyZDAwZDUtYjA3My00OWQwLTllNTMtYjE5YmUwMmY2YjhjXkEyXkFqcGdeQXVyMTIxOTk5MzY@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","War"],"plot":"Oil-tanker Captain Manson rescues Kathie Hall after her ship is sunk by a U-boat. He marries her. When his ship is sunk and she is suspected because she has no identification. Manson tries to clear her of the charge and discovers that his first mate, Adamson, is a German agent.","simplePlot":"Oil-tanker Captain Manson rescues Kathie Hall after her ship is sunk by a U-boat. He marries her. When his ship is sunk and she is suspected because she has no identification. Manson tries ... ","actors":[{"actorName":"Edward G. Robinson","urlProfile":"http://www.imdb.com/name/nm0000064","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzcwMzU5Nl5BMl5BanBnXkFtZTYwNTkwMjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1893","placeOfBirth":" Bucharest, Romania","birthName":"Emmanuel Goldenberg","height":"5' 7\" (1.7 m)","bio":"Edward G. Robinson arrived in the United States at age ten, and his family moved into New York's Lower East Side. He took up acting while attending City College, abandoning plans to become a rabbi or lawyer. The American Academy of Dramatic Arts awarded him a scholarship, and he began work in stock, with his new name, in 1913. Broadway was two years later; he worked steadily there for 15 years. His work included \"The Kibitzer\", a comedy he co-wrote with Jo Swerling. His film debut was a small supporting part in the silent The Bright Shawl (1923), but it was with the coming of sound that he hit his stride. His stellar performance as snarling, murderous thug Rico Bandello in Little Caesar (1931)--all the more impressive since in real life Robinson was a sophisticated, cultured man with a passion for fine art--set the standard for movie gangsters, both for himself in many later films and for the industry. He portrayed the title character in several biographical works, such as Dr. Ehrlich's Magic Bullet (1940) and A Dispatch from Reuter's (1940). Psychological dramas included Flesh and Fantasy (1943), Double Indemnity (1944), The Woman in the Window (1944)and Scarlet Street (1945). Another notable gangster role was in Key Largo (1948). He was \"absolved\" of allegations of Communist affiliation after testifying as a friendly witness for the House Un-American Activities Committee during the McCarthy hysteria of the early 1950s. In 1956 he had to sell off his extensive art collection in a divorce settlement and also had to deal with a psychologically troubled son. In 1956 he returned to Broadway in \"Middle of the Night\". In 1973 he was awarded a special, posthumous Oscar for lifetime achievement.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzcwMzU5Nl5BMl5BanBnXkFtZTYwNTkwMjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000064","name":"Edward G. Robinson","nicknames":["Eddie","Manny"],"idIMDB":"nm0000064"},"actorId":"nm0000064","character":"Captain Bart Manson","urlCharacter":"http://www.imdb.com/character/ch0444903","main":true},{"actorName":"Lynn Bari","urlProfile":"http://www.imdb.com/name/nm0054609","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWRkYmVlNzItNzc2Mi00OWVjLTg5NzktNWVjZjZmY2Y1NmYxXkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1913","placeOfBirth":" Roanoke, Virginia, USA","birthName":"Margaret Schuyler Fisher","height":"5' 6\" (1.68 m)","bio":"A curvaceous, dark-haired WWII pin-up beauty (aka \"The Woo Woo Girl\" and \"The Girl with the Million Dollar Figure\"), \"B\" film star Lynn Bari had the requisite looks and talent but few of the lucky breaks needed to penetrate the \"A\" rankings during her extensive Hollywood career. Nevertheless, some worthy performances of hers stand out in late-night viewings. She was born with the elite-sounding name of Margaret Schuyler Fisher on December 18, 1913 (various sources also list 1915, 1917 and 1919), in Roanoke, Virginia. She and her younger brother, John, moved with their mother to Boston following the death of their father in 1926. Her mother remarried, this time to a minister, and the family relocated once again when her stepfather was assigned a ministry in California (the Institute of Religious Science in Los Angeles). Paying her dues for years as a snappy bit-part chorine, secretary, party girl and/or glorified extra while being groomed as a starlet under contract to MGM and Fox, her first released film was the MGM comedy Meet the Baron (1933), in which she provided typical window dressing as a collegiate. For the next few years there was little growth at either studio, as she was usually standing amidst others in crowd scenes and looking excited. Finally in Lancer Spy (1937), she received her first billing on screen for a minor part as \"Miss Fenwick\". Though more bit parts were to dribble in, the year 1938 proved to be her breakthrough year. She finally gained some ground playing the \"other woman\" role in glossy soaps and musicals, first giving Barbara Stanwyck some trouble in Always Goodbye (1938). Fox Studios finally handed her some smart co-leads and top supports in such second-tier films as Return of the Cisco Kid (1939), Pack Up Your Troubles (1939), Hotel for Women (1939), and Hollywood Cavalcade (1939). Anxiously waiting for \"the big one\", she made do with her strong looks, tending toward unsympathetic parts. She enjoyed the attention she received playing disparaging society ladies, divas, villainesses, and even a strong-willed prairie flower in such films as Pier 13 (1940), Earthbound (1940), Kit Carson (1940), and Sun Valley Serenade (1941), but they did little to advance her in the ranks. The very best role of her frisky career came with the grade \"A\" comedy The Magnificent Dope (1942), in which she shared top billing with Henry Fonda and Don Ameche. But good roles were hard to find in Lynn's case, and she good-naturedly took whatever was given her. Other above-average movies (she appeared in well over 150) of this period came with China Girl (1942), Hello Frisco, Hello (1943), The Bridge of San Luis Rey (1944), and Nocturne (1946). With diminishing offers for film parts by the 1950s, she started leaning heavily towards stage and TV work. She continued her career until the late '60s and then retired. Her last work included the film The Young Runaways (1968) and TV episodes of \"The Girl from U.N.C.L.E.\" and \"The F.B.I.\" Divorced three times in all, husband #2 was volatile manager/producer Sidney Luft, better known as Judy Garland's hubby years later, who was the father of her only child. Her third husband was a doctor/psychiatrist, and she worked as his nurse for quite some time. They divorced in 1972. Plagued by arthritis in later years, Bari passed away from heart problems on November 20, 1989. Although she may have been labeled a \"B\" leading lady, she definitely was in the \"A\" ranks when it came to class and beauty.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWRkYmVlNzItNzc2Mi00OWVjLTg5NzktNWVjZjZmY2Y1NmYxXkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0054609","name":"Lynn Bari","nicknames":["The Girl with the Million Dollar Figure","The Woo Woo Girl"],"idIMDB":"nm0054609"},"actorId":"nm0054609","character":"Katherine 'Kathy' Hall","urlCharacter":"http://www.imdb.com/character/ch0496409","main":true},{"actorName":"Victor McLaglen","urlProfile":"http://www.imdb.com/name/nm0572142","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNTYxNTcxNF5BMl5BanBnXkFtZTcwMDg1MTMxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1886","placeOfBirth":" Tunbridge Wells, Kent, England, UK","birthName":"Victor Andrew de Bier Everleigh McLaglen","height":"6' 3\" (1.9 m)","bio":"Rambunctious British leading man (contrary to popular belief, he was of Scottish ancestry, not Irish) and later character actor primarily in American films, Victor McLaglen was a vital presence in a number of great motion pictures, especially those of director John Ford. McLaglen (pronounced Muh-clog-len, not Mack-loff-len) was the son of the Right Reverend Andrew McLaglen, a Protestant clergyman who was at one time Bishop of Claremont in South Africa. The young McLaglen, eldest of eight brothers, attempted to serve in the Boer War by joining the Life Guards, though his father secured his release. The adventuresome young man traveled to Canada where he did farm labor and then directed his pugnacious nature into professional prizefighting. He toured in circuses, vaudeville shows, and Wild West shows, often as a fighter challenging all comers. His tours took him to the US, Australia (where he joined in the gold rush) and South Africa. In 1909 he was the first fighter to box newly-crowned heavyweight champion Jack Johnson, whom he fought in a six-round exhibition match in Vancouver (as an exhibition fight, it had no decision). When the First World War broke out, McLaglen joined the Irish Fusiliers and soldiered in the Middle East, eventually serving as Provost Marshal (head of Military Police) for the city of Baghdad. After the war he attempted to resume a boxing career, but was given a substantial acting role in The Call of the Road (1920) and was well received. He became a popular leading man in British silent films, and within a few years was offered the lead in an American film, The Beloved Brute (1924). He quickly became a most popular star of dramas as well as action films, playing tough or suave with equal ease. With the coming of sound, his ability to be persuasively debonair diminished by reason of his native speech patterns, but his popularity increased, particularly when cast by Ford as the tragic Gypo Nolan in The Informer (1935), for which McLaglen won the Best Actor Oscar. He continued to play heroes, villains and simple-minded thugs into the 1940s, when Ford gave his career a new impetus with a number of lovably roguish Irish parts in such films as She Wore a Yellow Ribbon (1949) and The Quiet Man (1952). The latter film won McLaglen another Oscar nomination, the first time a Best Actor winner had been nominated subsequently in the Supporting category. McLaglen formed a semi-militaristic riding and polo club, the Light Horse Brigade, and a similarly arrayed precision motorcycle team, the Victor McLaglen Motorcycle Corps, both of which led to apparently erroneous conclusions that he had fascist sympathies and was forming his own private army. The facts prove otherwise, and despite rumors to the contrary, McLaglen did not espouse the far right-wing sentiments often attributed to him. He continued to act in films into his 70s and died, from heart failure, not long after appearing in a film directed by his son, Andrew V. McLaglen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNTYxNTcxNF5BMl5BanBnXkFtZTcwMDg1MTMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0572142","name":"Victor McLaglen","idIMDB":"nm0572142"},"actorId":"nm0572142","character":"First Mate Fred Adamson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Bailey","urlProfile":"http://www.imdb.com/name/nm0047459","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTdhOTdmYjAtMTY3Zi00NDAyLWE0MmEtMzcwYmRjNTA1MzY4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1913","placeOfBirth":" Toledo, Ohio, USA","bio":"Robert Bailey was born on June 13, 1913 in Toledo, Ohio, USA. He was an actor, known for Jitterbugs (1943), The Dancing Masters (1943) and Wing and a Prayer (1944). He died on August 13, 1983 in Lancaster, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTdhOTdmYjAtMTY3Zi00NDAyLWE0MmEtMzcwYmRjNTA1MzY4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0047459","name":"Robert Bailey","idIMDB":"nm0047459"},"actorId":"nm0047459","character":"Second Mate Watson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marc Lawrence","urlProfile":"http://www.imdb.com/name/nm0492908","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNzM5ODQ4MF5BMl5BanBnXkFtZTcwMjE4ODExOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1910","placeOfBirth":" New York City, New York, USA","birthName":"Max Goldsmith","height":"5' 10\" (1.78 m)","bio":"American character actor who specialized in underworld types, despite a far greater range. A native of the Bronx, Lawrence participated in plays in school, then attended the City College of New York. In 1930, he was accepted into Eva Le Gallienne's company, where he became friendly with another young actor, one day to be known as John Garfield. The two appeared in a number of plays, both with Le Galliene's company and with the highly-politicized Group Theatre, before Lawrence was given a film contract with Columbia Pictures. His scarred complexion and brooding appearance made him a natural for heavies, and he played scores of gangsters and mob bosses over the next six decades. Nevertheless, he could turn in fine performances in very different kinds of roles as well, such as his bewildered mountain boy in The Shepherd of the Hills (1941). Following the Second World War, as anti-Communist fervor gripped America, Lawrence found himself under scrutiny for his political leanings. When called before the House Un-American Activities Committee, he admitted he had once been a member of the Communist Party. The Committee broke down his resolve and he named the names of other Party members. He was blacklisted and departed for Europe, where he continued to make films, often in leading roles. Following the demise of the blacklist, he returned to America and resumed his position as a familiar and talented purveyor of gangland types. A writer and director as well, Lawrence has remained active in his ninth decade.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNzM5ODQ4MF5BMl5BanBnXkFtZTcwMjE4ODExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0492908","name":"Marc Lawrence","idIMDB":"nm0492908"},"actorId":"nm0492908","character":"Valdez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"E.J. Ballantine","urlProfile":"http://www.imdb.com/name/nm0050538","urlPhoto":"","biography":{"dateOfBirth":"3 December 1887","placeOfBirth":" Edinburgh, Scotland, UK","birthName":"Edward James Ballantine","bio":"E.J. Ballantine was born on December 3, 1887 in Edinburgh, Scotland as Edward James Ballantine. He was an actor, known for Magic Town (1947), The Moon Is Down (1943) and Tampico (1944). He died on October 20, 1968 in London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0050538","name":"E.J. Ballantine","idIMDB":"nm0050538"},"actorId":"nm0050538","character":"Silhouette Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mona Maris","urlProfile":"http://www.imdb.com/name/nm0548056","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGM5ZjQ5ZmMtN2M3Zi00Mzg3LTkxNTQtYjNhMjAyNTZkMjczXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 November 1903","placeOfBirth":" Buenos Aires, Argentina","birthName":"Rosa Emma Mona María Marta Capdevielle","height":"5' 6\" (1.68 m)","bio":"Sultry, sleepy-eyed Argentine brunette Mona Maris was born Rosa Emma Mona Maria Marta Capdevielle, of Spanish-French parentage. Her well-to-do background ensured a quality education with an emphasis on foreign languages. Mona mastered three of them, but, alas, English was not among them. This mattered little early on, as her career began in silent films in 1925, first in England and France, then with Universum AG in Germany. Moving to the U.S. in 1929, she was signed by Fox to co-star opposite Warner Baxter in two above-average westerns: En kärleksnatt vid Rio Grande (1929) and the The Arizona Kid (1930) (in which she was rather overshadowed by a young Carole Lombard). In fairness, neither film gave her much to do, except be ornamental. In 'Arizona Kid', she was also unwisely permitted to sing, which was not her forte. Combined with her rather strained command of English, it was somewhat inevitable that she would find herself relegated to acting in a string of Spanish-language versions of American films. Mona Maris is remembered today less for her sojourn in Hollywood, than for her on-screen chemistry with legendary singer Carlos Gardel in the musical drama Cuesta abajo (1934). Filmed in Argentina, it co-starred Mona as a femme fatale and proved to be her defining screen role. She auditioned for the part via telephone from the Paramount lot (having just completed shooting of Kiss and Make-Up (1934)) for French-born director Louis J. Gasnier, winning out over fellow candidates Raquel Torres and Rosita Montenegro. \"Cuesta abajo\" was well-received upon its release in the U.S., becoming the most successful Spanish-language film up to that time. Following Gardel's untimely death in 1935, Mona absented herself from the screen for six years. She returned to Hollywood again in the early 40's, free-lancing for most of the majors, in films like The Falcon in Mexico (1944) and Tampico (1944). Even though, her English was now fluent, she remained mostly typecast as south-of-the-border senoritas. After an uncredited bit in the Bob Hope comedy Monsieur Beaucaire (1946), her career wound down with a third-billed part in a third rate swashbuckler for Republic, The Avengers (1950). Shortly after that, she called it a day and in 1960 retired to Lima, Peru, with her second husband, Dutch millionaire Herman Rick.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGM5ZjQ5ZmMtN2M3Zi00Mzg3LTkxNTQtYjNhMjAyNTZkMjczXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0548056","name":"Mona Maris","idIMDB":"nm0548056"},"actorId":"nm0548056","character":"Dolores Garcia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tonio Selwart","urlProfile":"http://www.imdb.com/name/nm0783615","urlPhoto":"","biography":{"dateOfBirth":"9 June 1896","placeOfBirth":" Wartenberg, Bavaria, Germany","birthName":"Anton Th. Selmair","bio":"Tonio Selwart was born on June 9, 1896 in Wartenberg, Bavaria, Germany as Anton Th. Selmair. He was an actor, known for Senso (1954), Hangmen Also Die! (1943) and La comtesse aux pieds nus (1954). He died on November 2, 2002 in New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0783615","name":"Tonio Selwart","idIMDB":"nm0783615"},"actorId":"nm0783615","character":"Kruger","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0037346","urlIMDB":"http://www.imdb.com/title/tt0037346","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 15 min (75 min)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.4","filmingLocations":[],"awards":[],"votes":"182","type":"Movie","companyCreditsSimple":[{"idCompany":"co0000756","name":"Twentieth Century Fox Film Corporation"}],"keywords":{"keywords":["oil tanker","spy","world war two"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:20:34"}}