{"data":{"movies":[{"title":"So Long at the Fair","originalTitle":"","year":"1950","releaseDate":"19510329","directors":[{"name":"Antony Darnborough","id":"nm0201493"},{"name":"Terence Fisher","id":"nm0279807"}],"writers":[{"name":"Hugh Mills","id":"nm0590027"},{"name":"Anthony Thorne","id":"nm0861355"}],"runtime":"86 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwODMwMTU2Ml5BMl5BanBnXkFtZTcwMTMyOTI0MQ@@._V1.jpg","countries":["UK"],"languages":["English","German","French"],"genres":["Drama","Mystery"],"plot":"Vicky Barton and her brother, Johnny, take a trip to the 1896 Paris Exhibition. They both sleep in seperate rooms in a hotel. When the sister gets up the next morning, she finds her brother and his room had disappeared and no one will even acknowledge that he was ever there. Now Vicky must find out what exactly happened to her brother.","simplePlot":"A young woman visits Paris with her brother only to discover the following morning he has gone missing and the hotel staff have no recollection of his presence.","actors":[{"actorName":"Jean Simmons","urlProfile":"http://www.imdb.com/name/nm0001739","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTQ1ODk3N15BMl5BanBnXkFtZTYwMDk4MDM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 January 1929","placeOfBirth":" Crouch Hill, London, England, UK","birthName":"Jean Merilyn Simmons","height":"5' 4\" (1.63 m)","bio":"Demure British beauty Jean Simmons was born January 31, 1929 in Crouch End, London. As a 14-year-old dance student, she was plucked from her school to play Margaret Lockwood's precocious sister in Give Us the Moon (1944), and she went on to make a name for herself in such major British productions as Caesar and Cleopatra (1945), Great Expectations (1946) (as the spoiled, selfish Estella), Black Narcissus (1947) (as a sultry native beauty), Hamlet (1948) (playing Ophelia to Laurence Olivier's great Dane and earning a Best Supporting Actress Oscar nomination), The Blue Lagoon (1949) and So Long at the Fair (1950), among others. In 1950, she married actor Stewart Granger, and that same year, starred in the Frank Sinatra/Marlon Brando musical Guys and Dolls (1955); she used her own singing voice and earned her first Golden Globe Award. Simmons divorced Granger in 1960 and almost immediately married writer-director Richard Brooks, who cast her as Sister Sharon opposite Burt Lancaster in Elmer Gantry (1960), a memorable adaptation of the Sinclair Lewis novel. That same year, she co-starred with Kirk Douglas in Stanley Kubrick's Spartacus (1960) and played a would-be homewrecker opposite Cary Grant in The Grass Is Greener (1960). Off the screen for a few years, Jean captivated moviegoers with a brilliant performance as the mother in All the Way Home (1963), a literate, tasteful adaptation of James Agee's \"A Death in the Family\". However, after that, she found quality projects somewhat harder to come by, and took work in Life at the Top (1965), Mister Buddwing (1966), Divorce American Style (1967), Rough Night in Jericho (1967), The Happy Ending (1969) (a Richard Brooks film for which she was again Oscar-nominated, this time as Best Actress). Jean continued making films well into the 1970s. In the 1980s, she appeared mainly in television miniseries, such as North and South (1985) and The Thorn Birds (1983). She made a comeback to films in 1995 in How to Make an American Quilt (1995) co-starring Winona Ryder and Anne Bancroft, and most recently played the elderly Sophie in the English version of Hayao Miyazaki's Howl's Moving Castle (2004). She now resided in Santa Monica, California, with her dog, Mr. Gates, and her two cats, Adisson and Megan. Jean Simmons died of lung cancer on January 22, 2010, nine days before her 81st birthday.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTQ1ODk3N15BMl5BanBnXkFtZTYwMDk4MDM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001739","name":"Jean Simmons","idIMDB":"nm0001739"},"actorId":"nm0001739","character":"Vicky Barton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dirk Bogarde","urlProfile":"http://www.imdb.com/name/nm0001958","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNDY0NjAwMl5BMl5BanBnXkFtZTYwMTUxNjI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 March 1921","placeOfBirth":" Hampstead, London, England, UK","birthName":"Derek Jules Gaspard Ulric Niven van den Bogaerde","height":"5' 8½\" (1.74 m)","bio":"Sir Dirk Bogarde, distinguished film actor and writer, was born Derek Jules Gaspard Ulric Niven van den Bogaerde on March 28, 1921, to Ulric van den Bogaerde, the art editor of \"The Times\" (London) newspaper, and actress Margaret Niven in the London suburb of Hampstead. He was one of three children, with sister Elizabeth and younger brother Gareth. His father was Flemish and his mother was of Scottish descent. Ulric Bogaerde started the Times' arts department and served as its first art editor. Derek's mother, Margaret - the daughter of actor and painter Forrest Niven - appeared in the play \"Bunty Pulls The Strings\", but she quit the boards in accordance with her husband's wishes. The young Derek Bogaerde was raised at the family home in Sussex by his sister, Elizabeth, and his nanny, Lally. Educated at the Allen Glen's School in Glasgow, he also attended London's University College School before majoring in commercial art at Chelsea Polytechnic, where his teachers included Henry Moore. Though his father wanted his eldest son to follow him into the \"Times\" as an art critic and had groomed him for that role, Derek dropped out of his commercial art course and became a drama student, though his acting talent at that time was unpromising. In the 1930s he went to work as a commercial artist and a scene designer. He apprenticed as an actor with the Amersham Repertory Company, and made his acting debut in 1939 on a small London stage, the Q Theatre, in a role in which he delivered only one line. His debut in London's West End came a few months later in J.B. Priestley's play \"Cornelius,\" in which he was billed as \"Derek Bogaerde\". He made his uncredited debut as an extra in the pre-war George Formby comedy Come on George! (1939). The September 1939 invasion of Poland by Nazi Germany and the Soviet Union triggered World War II, and in 1940 Bogarde joined the Queen's Royal Regiment as an officer. He served in the Air Photographic Intelligence Unit and eventually attained the rank of major. Nicknamed \"Pippin\" and \"Pip\" during the war, he was awarded seven medals in his five years of active duty. He wrote poems and painted during the war, and in 1943, a small magazine published one of his poems, \"Steel Cathedrals,\" which subsequently was anthologized. His paintings of the war are part of the Imperial War Museum's collection. Similar to his character, Captain Hargreaves, in King & Country (1964), he was called upon to put a wounded soldier out of his misery, a tale recounted in one of his seven volumes of autobiography. While serving with the Air Photographic Intelligence Unit, he took part in the liberation of the Bergen-Belsen concentration camp, which he said was akin to \"looking into Dante's Inferno\". In one of his autobiographies, he wrote, \"At 24, the age I was then, deep shock stays registered forever. An internal tattooing which is removable only by surgery, it cannot be conveniently sponged away by time.\" After being demobilized, he returned to acting. His agent re-christened him \"Dirk Bogarde,\" a name that he would make famous within a decade. In 1947 he appeared in \"Power Without Glory\" at the New Lindsay Theatre, a performance that was praised by Noël Coward, who urged him to continue his acting career. The Rank Organization had signed him to a contract after a talent scout saw him in the play, and he made his credited movie debut in Dancing with Crime (1947) with a one-line bit as a policeman. His first lead in a movie came that year when Wessex Films, distributed by Rank, gave him a part in the proposed Stewart Granger film Sin of Esther Waters (1948). When Granger dropped out, Bogarde took over the lead. Rank subsequently signed him to a long-term contract and he appeared in a variety of parts during the 14 years he was under contract to the studio. For three years he toiled in Rank movies as an apprentice actor without making much of a ripple; then in 1950, he was given the role of young hood Tom Riley in the crime thriller The Blue Lamp (1950) (the title comes from the blue-colored light on police call-boxes in London), the most successful British film of 1950, which established Bogarde as an actor of note. Playing a cop killer, an unspeakable crime in the England of the time, it was the first of the intense neurotics and attractive villains that Bogarde would often play. He continued to act on-stage, appearing in the West End in Jean Anouilh's \"Point of Departure\". While he was praised for his performance, stage acting made him nervous, and as he became more famous, he began to be mobbed by fans. The pressure of the public adulation proved overwhelming, particularly as he suffered from stage fright. He was accosted by crowds of fans at the stage door during the 1955 touring production of \"Summertime,\" and his more enthusiastic admirers even shouted at him during the play. He was to appear in only one more play, the Oxford Playhouse production of \"Jezebel,\" in 1958. He never again took to the boards, despite receiving attractive offers. He first acted for American expatriate director Joseph Losey in The Sleeping Tiger (1954). Losey, a Communist and self-described Stalinist at the time, had emigrated to England after being blacklisted in Hollywood after he refused to direct The Woman on Pier 13 (1949) at RKO Pictures, which was owned by right-wing multi-millionaire Howard Hughes at the time, and he was accused in testimony before the House Un-American Activities Committee of being a Communist. The director, like Bogarde, would not find his stride until the early 1960s, and Losey and Bogarde would build their reputations together. First, however, Losey had to overcome Bogarde's reluctance to star in a low-budget film (shot for $300,000) with a blacklisted American director. Losey, who had never heard of Bogarde until he was proposed for the film, met with him and asked Bogarde to view one of his pictures. After seeing the film, Bogarde was enthusiastic, and Losey talked him into taking the role, which he accepted at a reduced fee (Losey originally was not credited with directing the film due to his being blacklisted in the States). A decade later they would make more memorable films that would be watersheds in their careers. It was not drama but comedy that made Dirk Bogarde a star. He achieved the first rank of English movie stardom playing Dr. Simon Sparrow in the comedy Doctor in the House (1954). The film was a smash hit, becoming one of the most popular British films in history, with 17 million admissions in its first year of release. As Sparrow, Bogarde became a heartthrob and the most popular British movie star of the mid-50s. He reprised the character in Doctor at Sea (1955), Doctor at Large (1957). The title of the latter film may have described his mood as a serious actor having to do another turn as Dr. Sparrow between his career-making performances in Losey's The Servant (1963), with a script by Harold Pinter, and Losey's adaptation of the stage play King & Country (1964), in which Bogarde memorably played the attorney for a young deserter (played by Tom Courtenay). Bogarde, hailed as \"the idol of the Odeons\" in honor of his box-office clout, was offered the role of Jimmy Porter in _Look Back in Anger (1958/I)_ by producer Harry Saltzman and director Tony Richardson, based on the play that touched off the \"Angry Young Man\" and \"Kitchen Sink School\" of contemporary English drama in the 1950s. Though Bogarde wanted to take the part, Rank refused to let him make the film on the grounds that there was \"altogether too much dialog.\" The part went to Richard Burton instead, who went over-the-top in portraying his very angry, not-so-young man. After this disappointment, Bogarde went to Hollywood to play Franz Liszt in Song Without End (1960) and to appear in Nunnally Johnson's Spanish Civil War drama L'ange pourpre (1960) with Ava Gardner. Both were big-budgeted films, but hampered by poor scripts, and after both films failed, Bogarde avoided Hollywood from then on. He was reportedly quite smitten with his French \"Song Without End\" co-star Capucine, and wanted to marry her. Capucine, who suffered from bi-polar disorder, was bisexual with an admitted preference for women. The relationship did not lead to marriage, but did result in a long-term friendship. It apparently was his only serious relationship with a woman, though he had many women friends, including his I Could Go on Singing (1963) co-star Judy Garland. In the early 1960s, with the expiration of his Rank contract, Bogarde made the decision to abandon his hugely successful career in commercial movies and concentrate on more complex, art house films (at the same time, Burt Lancaster made a similar decision, though Lancaster continued to alternate his artistic ventures with more crassly commercial endeavors). Bogarde appeared in Basil Dearden's seminal film Victim (1961), the first British movie to sympathetically address the persecution of homosexuals. His career choice alienated many of his old fans, but he was no longer interested in being a commercial movie star; he, like Lancaster, was interested in developing as an actor and artist (however, that sense of finding himself as an actor did not extend to the stage. His reputation was such in 1963 that he was invited by National Theatre director Laurence Olivier to appear as Hamlet to open the newly built Chichester Festival Theatre. That production of the eponymous play also was intended to open the National Theatre's first season in London. Bogarde declined, and the honor went instead to Peter O'Toole, who floundered in the part.) Jack Grimston, in Bogarde's \"Sunday Times\" obituary of May 9, 1999, entitled \"Bogarde, a solitary star at the edge of the spotlight,\" said of the late actor that he \"belonged to a group that was rare in the British cinema. He was a fine screen player who owed little to the stage. Dilys Powell, the Sunday Times film critic, wrote of him before her own death: 'Most of our gifted film players really belonged to the theater. Bogarde belonged to the screen.'\" Bogarde had won the London Critics Circle's Dilys Powell award for outstanding contribution to cinema in 1992. Appearing in \"Victim\" was a huge career gamble. In the film, Bogarde played a married barrister who is being blackmailed over his closeted homosexuality. Rather than let the blackmail continue, and allow the perpetrators to victimize other gay men, Bogarde's character effectively sacrifices himself, specifically his marriage and his career, by bravely confessing to be gay (homosexuality was an offence in the United Kingdom until 1967, and there reportedly had been a police crackdown against homosexuals after World War II which made gay men particularly vulnerable to blackmail). The film was not released in mainstream theaters in the US, as the Production Code Administration (PCA) refused to classify the film and most theaters would not show films that did not carry the PCA seal of approval. \"Victim\" was the antithesis of the light comedy of Bogarde's \"Doctor\" movies, and many fans of his character Simon Sparrow were forever alienated by his portrayal of a homosexual. For himself, Bogarde was proud of the film and his participation in it, which many think stimulated public debate over homosexuality. The film undoubtedly raised the public consciousness over the egregious and unjust individual costs of anti-gay bigotry. The public attitude towards the \"love that dared not speak its name\" changed enough so that within six years, the 1967 Sexual Offences Act decriminalizing homosexual acts between adults passed Parliament. Bogarde reported that he received many letters praising him for playing the role. His courage in taking on such a role is even more significant in that he most likely was gay himself, and thus exposed himself to a backlash. Bogarde always publicly denied he was a homosexual, though later in life he did confess that he and his manager, Anthony Forwood, had a long-term relationship. When Bogarde met him in 1939, Forwood was a theatrical manager, who eventually married and divorced Glynis Johns. Forwood became Bogarde's friend and subsequently his life partner, and the two moved to France together in 1968. They bought a 15th-century farmhouse near Grasse in Provence in the early 1970s, which they restored. Bogarde and Forwood lived in the house until 1983, when they returned to London so that Forwood could be treated for cancer, from which he eventually died in 1988. Bogarde nursed him in the last few months of his life. After Forwood died, Bogarde was left rudderless and he became more reclusive, eventually retiring from films after Daddy Nostalgia (1990). Mark Rowe and Jeremy Kay, in their obituary of Bogarde, \"Two brilliant lives - on film and in print,\" published in \"The Independent\" on May, 9, 1999, wrote, \"Although he documented with frankness his early sexual encounters with girls and later his adoring love for Kay Kendall and Judy Garland, he never wrote about his longest and closest relationship - with his friend and manager for more than 50 years, Tony Forwood. Sir Dirk said the clues to his private life were in his books. 'If you've got your wits about you, you will know who I am'.\" The British documentary _\"Arena\" [The Private Dirk Bogarde] (2001)_ made with the permission of his family, stressed the fact that he and Forwood were committed lifelong partners. In the same issue, the National Film Theatre's David Thompson, in the article \"The public understood he was essentially gay,\" wrote about Bogarde at his high-water mark in the 1950s, that \"Audiences of that time loved him . . . Very few people picked up on the fact that there was a distinct gay undertone. It says something about British audiences of the time. He had the good fortune to break out of that prison, and it came through the film Victim (1961), where he played a gay character, and through meeting with Joseph Losey, who directed him in The Servant (1963). For the first time, Bogarde's ambivalence was exploited and used by film.\" Bogarde's sexuality is not the issue; what was striking was that it was an act of personal courage for one of Britian's leading box-office attractions to appear in such a provocative and controversial film. Even in the 21st century, many mainstream actors are afraid to play a gay character lest they engender a public backlash against themselves, which is much less likely than it was more than 40 years ago when Bogarde made \"Victim.\" Apart from sociology, \"Victim\" marks the milestone in which critics and audiences could discern the metamorphosis of Bogarde into the mature actor who went on to become one of the cinema's finest performers. Most of Bogarde's best and most serious roles come after \"Victim,\" the film in which he first stretched himself and broke out of the mold of \"movie star.\" He received the first of his six nominations as Best Actor from the British Academy of Film & Television Arts (BAFTA) for the film. Bogarde co-starred with John Mills in The Singer Not the Song (1961), and with Alec Guinness in Damn the Defiant! (1962) (a.k.a. \"Damn the Defiant!\"). In 1963 he reunited with Losey to film the first of two Losey films with screenplays by Pinter. Bogarde's participation in the two Losey/Pinter collaborations, The Servant (1963) and Accident (1967), in addition to 1964's \"King & Country\", solidified his reputation. Critics and savvy moviegoers appreciated the fact that Bogarde had developed into a first-rate actor. For his role as the eponymous servant, Bogarde won BAFTA's Best Actor Award. He had now \"officially\" arrived in the inner circle of the best British film actors. These three films also elevated Losey into the ranks of major directors (Bogarde also starred in Losey's 1966 spy spoof Modesty Blaise (1966), but that film did little to enhance either man's reputation. He turned down the opportunity to appear in Losey's L'assassinat de Trotsky (1972) due to the poor quality of the script). Philip French, in his obituary \"Dark, exotic and yet essentially English\", published in \"The Observer\" on May 9, 1999, said of Bogarde, \"Losey discovered something more complex and sinister in his English persona and his performance as Barrett, the malevolent valet in 'The Servant,' scripted by Harold Pinter, is possibly the most subtle, revealing thing he ever did - by confronting his homosexuality in a non-gay context.\" Losey told interviewer Michel Ciment that his work with Bogarde represented a turning point in the actor's career, when he developed into an actor of depth and power. He also frankly admitted to Ciment that without Bogarde, his career would have stagnated and never reached the heights of success and critical acclaim that it did in the 1960s. Interestingly during the filming of \"The Servant.\" Losey was hospitalized with pneumonia. He asked Bogarde to direct the film in order to keep shooting so that the producers would not cancel the film. A reluctant Bogarde complied with Losey's wishes and directed for ten days. He later said that he would never direct again. Bogarde co-starred with up-and-coming actress Julie Christie in John Schlesinger's Darling (1965), for which Christie won a Best Actress Oscar and was vaulted into 1960s cinema superstardom. During the filming of the movie, both Bogarde and Christie were waiting to hear whether they would be cast as Yuri Zhivago and his lover Lara in David Lean's upcoming blockbuster Doctor Zhivago (1965). Christie got the call, Bogarde didn't, but he was well along in the process of establishing himself as one of the screen's best and most important actors. He won his second BAFTA Best Actor Award for his performance in \"Darling.\" Bogarde went on to major starring roles in such important pictures as The Fixer (1968), for which 'Alan Bates (I)' won a Best Actor Academy Award nomination. While Bogarde never was nominated for an Oscar, he had the honor of starring in two films for Luchino Visconti, The Damned (1969) (\"The Damned\") and Death in Venice (1971), based on Thomas Mann's novella \"Death in Venice.\" Bogarde felt that his performance as Gustav von Aschenbach, the dying composer in love with a young boy and with the concept of beauty, in \"Death in Venice\" was the \"the peak and end of my career . . . I can never hope to give a better performance in a better film.\" Visconti told Bogarde that when the lights went up in a Los Angeles screening room after a showing of \"Death in Venice\" for American studio executives, no one said anything. The silence encouraged Visconti, who believed it meant that the executives were undergoing a catharsis after watching his masterpiece. However, he soon realized that, in Bogarde's own words, \"Apparently they were stunned into horrified silence . . . A group of slumped nylon-suited men stared dully at the blank screen.\" One nervous executive, feeling something should be said, got up and asked, \"Signore Visconti, who was responsible for the score of the film?\" \"Gustav Mahler,\" Visconti replied. \"Just great!\", said the nervous man. \"I think we should sign him.\" After \"Venice\", Bogarde made only seven films over the next two decades and was scathing about the quality of the scripts he was offered. To express himself artistically, he began to write. In his third volumes of autobiography, he wrote, \"No longer do the great Jewish dynasties hold power: the people who were, when all is said and done, the Picture People. Now the cinema is controlled by vast firms like Xerox, Gulf & Western, and many others who deal in anything from sanitary-ware to property development. These huge conglomerates, faceless, soulless, are concerned only with making a profit; never a work of art . . . \" He rued the fact that \"it is pointless to be 'superb' in a commercial failure; and most of the films which I had deliberately chosen to make in the last few years were, by and large, just that. Or so I am always informed by the businessmen. The critics may have liked them extravagantly, but the distributors shy away from what they term 'A Critic's Film', for it often means that the public will stay away. Which, in the mass, they do: and if you don't make money at the box-office you are not asked back to play again.\" However, the courageous artist was not to be daunted: \"But I'd had very good innings. Better than most. So what the hell?\" His well-written works were enthusiastically received by critics and the book-buying public. Bogarde appeared in another film that flirted with the theme of German fascism, Liliana Cavani's highly controversial The Night Porter (1974) (\"The Night Porter\"). He played an ex-SS officer who encounters a woman with whom he had been engaged in a sado-masochistic affair at a World War II Nazi extermination camp. Many critics found the film, which featured extensive nudity courtesy of Charlotte Rampling, crassly offensive, but no one faulted Bogarde's performance. He played Lt. Gen. Frederick \"Boy\" Browning in the all-star blockbuster A Bridge Too Far (1977). Although some of his fellow actors were World War II veterans, only Bogarde had been involved in the actual battle. His performance arguably is the best in the film. Appearing in Alain Resnais' art house hit Providence (1977) gave Bogarde the opportunity to co-star with John Gielgud. He also starred in German wunderkind Rainer Werner Fassbinder's adaptation of Vladimir Nabokov's Despair (1978), with a script by Tom Stoppard. Though the film was not much of a critical success, Bogarde's acting as 1930s German businessman Hermann Hermann, a man who chooses to go mad when faced with the paradoxes of his life in his proto-fascist fatherland, was highly praised. Bogarde enjoyed working with Fassbinder. He wrote that \"Rainer's work was extraordinarily similar to that of Visconti's; despite their age difference, they both behaved, on set, in much the same manner. Both had an incredible knowledge of the camera: the first essential. Both knew how it could be made to function; they had the same feeling for movement on the screen, of the all-important (and often-neglected) 'pacing' of a film, from start to finish, of composition, of texture, and probably most of all they shared that strange ability to explore and probe into the very depths of the character which one had offered them.\" After his experience with Fassbinder, he acted only four more times, twice in feature films and twice on television. Bogarde was nominated for a Golden Globe for playing Roald Dahl in The Patricia Neal Story (1981). He got rave reviews playing Jane Birkin's father in Bertrand Tavernier's Daddy Nostalgia (1990), his last film. In 1984 Bogarde was asked to serve as president of the jury at the Cannes Film Festival, a huge honor for the actor, as he was the first Briton ever to serve in that capacity. Two years earlier he had been made a Chevalier de l'Ordre des lettres 1982. A decade later, he was knighted by Queen Elizabeth II on February 13, 1992. Bogarde won two Best Actor Awards out of six nominations from the British Academy of Film & Television Arts, for \"The Servant\" and \"Darling\" in 1964 and 1966, respectively. He was also nominated in 1962 for \"Victim,\" in 1968 for \"Accident\" and Our Mother's House (1967) and in 1972 for \"Morte a Venezia.\" Bogarde suffered a stroke in 1996, and though it rendered him partially paralyzed, he was able to recover and live in his own flat in Chelsea. However, by May of 1998 he required around-the-clock nursing care, and he had his lawyers draw up a \"living will,\" also known as a no-resuscitation order. Bogarde publicly came out in favor of voluntary euthanasia, becoming Vice President of the Voluntary Euthanasia Society. He publicly addressed the subject of his own \"living will,\" which ordered that no extraordinary measures be taken to keep him alive should he become terminally ill. The living will proved unnecessary. Dirk Bogarde died of a heart attack on May 8, 1999, in his home in Chelsea, London, England. According to his nephew Brock Van den Bogaerde, the family planned to hold a private funeral but no memorial service in accordance with his uncle's wish \"just to forget me.\" Bogarde wanted to be cremated and have his ashes scattered in France, and accordingly, his remains were returned to Provence. Margaret Hinxman, in her May 10, 1999, obituary in \"The Guardian\", said of him, \"At his peak and with directors he trusted - Joseph Losey, Luchino Visconti and Alain Resnais - Dirk Bogarde . . . was probably the finest, most complete, actor on the screen.\" Clive Fisher's obituary in \"The Independent\" on May 10, 1999, praised Bogarde as \"a major figure because, wherever they were made, his finest films are all somehow about him. He was a great self-portraitist and the screen persona he fashioned, a stylization of his private being, not only dominated its surroundings but spoke subliminally and powerfully to British audiences about the tensions of the time, about connivances and cruel respectabilities of England in the Fifties and Sixties.\" The secret of Dirk Bogarde's success as a great cinema actor was his intimate relationship with the camera. Bogarde believed that the key to acting on film was the eyes, specifically, the \"look\" of the actor. Like Alan Ladd, it didn't matter if an actor was good with line readings if they had mastery over the \"look.\" For many critics and movie-goers at the end of the 20th century, Dirk Bogarde's face epitomized the \"look\" of Britain in the tumultuous decades after the Second World War. David Tindle's portrait of Bogarde is part of the collection of London's National Portrait Gallery, London. In 1999, the portrait, on temporary loan, was displayed at 10 Downing Street, the Prime Minister's official residence, with other modern works of art. Officially, Dirk Bogarde had become the look of Britain.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNDY0NjAwMl5BMl5BanBnXkFtZTYwMTUxNjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001958","name":"Dirk Bogarde","nicknames":["The Idol of the Odeon","Pip/Pippin","The British Rock Hudson"],"idIMDB":"nm0001958"},"actorId":"nm0001958","character":"George Hathaway","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Tomlinson","urlProfile":"http://www.imdb.com/name/nm0866835","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MDAxODMxM15BMl5BanBnXkFtZTcwMTExNDUyOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 May 1917","placeOfBirth":" Henley-on-Thames, Oxfordshire, England, UK","birthName":"David Cecil MacAlister Tomlinson","height":"6' 1\" (1.86 m)","bio":"David Tomlinson is best known for his role as George Banks in Walt Disney's Mary Poppins (1964). As a youth he spent a short spell in the guards where he survived the trauma of a plane crash. He began his film career in the pre-war British film Quiet Wedding (1941) and followed that with Leslie Howard's 'Pimpernel' Smith (1941). Altogether he has made over 50 films and on stage he has had long-running successes in many plays including \"The Little Hut\" with Robert Morley and Roger Moore as his understudy. During the 1930s he understudied Alec Guinness before his big break in Mary Poppins (1964), followed by a string of Walt Disney successes. David was close friends with Errol Flynn and Peter Sellers. He also spent time with Walt Disney whilst they discussed his role in Mary Poppins (1964). He retired in the early 1980s after an exemplary career on film and stage, and will always be remembered as one of the centuries greatest character actors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MDAxODMxM15BMl5BanBnXkFtZTcwMTExNDUyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0866835","name":"David Tomlinson","nicknames":["Dave Tomlinson"],"idIMDB":"nm0866835"},"actorId":"nm0866835","character":"Johnny Barton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marcel Poncin","urlProfile":"http://www.imdb.com/name/nm0690333","urlPhoto":"","biography":{"dateOfBirth":"27 August 1890","placeOfBirth":" France","bio":"Marcel Poncin was born on August 27, 1890 in France. He was an actor, known for The Red Shoes (1948), So Long at the Fair (1950) and The Passionate Friends (1949). He died on June 8, 1953 in Paddington, London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0690333","name":"Marcel Poncin","idIMDB":"nm0690333"},"actorId":"nm0690333","character":"Narcisse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cathleen Nesbitt","urlProfile":"http://www.imdb.com/name/nm0626350","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWRkYmZlY2QtNWY5Yi00ZDg1LTgwZGQtZDdiZDc5ZGJmNjg5XkEyXkFqcGdeQXVyMjk3NTUyOTc@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 November 1888","placeOfBirth":" Cheshire, England, UK","birthName":"Cathleen Mary Nesbitt","bio":"Diminutive, genteel Cathleen Nesbitt was a grand dame of the theatre on both sides of the Atlantic in a career spanning seven decades. Among almost 300 roles on stage, she excelled at comic portrayals of sophisticated socialites and elegant mothers. Hollywood used her, whenever a gentler, sweeter version of Gladys Cooper was needed, yet someone still possessed of a subtly sarcastic wit and turn of phrase. Cathleen attended Queen's University in Belfast and the Sorbonne in Paris. Encouraged by a friend of her father - none other than the legendary Sarah Bernhardt - to enter the acting profession, she was taken on by Victorian actress and drama teacher Rosina Filippi (1866-1930). Cathleen's first appearance on stage was in 1910 at the Royalty Theatre in London. This was followed in November 1911 by her Broadway debut with the touring Abbey Theatre Players in 'The Well of the Saints'. From here on, and for the rest of her long life, she was never out of a job, demonstrating her range and versatility by playing anything from villainesses to being a much acclaimed Kate in Shakespeare's 'The Taming of the Shrew', Perdita in 'The Winter's Tale', Audrey Hepburn's grandaunt in 'Gigi', the Dowager Empress in 'Anastasia' and the gossipy 'humorously animated' Julia Shuttlethwaite of T.S. Eliot's 'The Cocktail Party'. Her Mrs. Higgins in 'My Fair Lady', Brooks Atkinson described as played with 'grace and elegance', which also pretty much sums up Cathleen's career in films. Her first motion picture role was a lead in the drama The Faithful Heart (1922), adapted from an Irish play. She then absented herself from the screen for the next decade, resurfacing in supporting roles in British films, though rarely cast in worthy parts, possible exceptions being Man of Evil (1944) and Jassy (1947). Her strengths were rather better showcased during her sojourn in Hollywood, which began in 1952. In addition to prolific appearances in anthology television, she also appeared in several big budget films, most memorably as Cary Grant's perspicacous grandmother in An Affair to Remember (1957) and as gossipy Lady Matheson (alongside Gladys Cooper) in Separate Tables (1958). One of her last roles of note was as Julia Rainbird, who instigates the mystery in Alfred Hitchcock's final film, Family Plot (1976). On the instigation of her friend Anita Loos, author of 'Gentlemen Prefer Blondes', Cathleen wrote her memoirs, 'A Little Love and Good Company' in 1977. For her extraordinarily long career in the acting profession, she was awarded a CBE in the Queen's Honours List the following year. She retired just two years prior to her death in 1983 at the age of 93.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWRkYmZlY2QtNWY5Yi00ZDg1LTgwZGQtZDdiZDc5ZGJmNjg5XkEyXkFqcGdeQXVyMjk3NTUyOTc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0626350","name":"Cathleen Nesbitt","idIMDB":"nm0626350"},"actorId":"nm0626350","character":"Madame Hervé","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Honor Blackman","urlProfile":"http://www.imdb.com/name/nm0000303","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMDg4MDgwNF5BMl5BanBnXkFtZTYwNTA5NjU2._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 August 1925","placeOfBirth":" Plaistow, London, England, UK","height":"5' 6\" (1.68 m)","bio":"Comparing this sultry-eyed blonde to Greta Garbo and Marlene Dietrich may seem a bit overzealous, but Honor Blackman's stylish allure over the years cannot be denied. One of four children, Blackman was born in London's East End to a statistician father employed with the civil service and a homemaker mother. She received diction lessons as a teenager and later attended the Guildhall School of Music and Drama. She temporarily followed in her father's footsteps with a job in the civil service, and then was, of all things, a dispatch rider during World War II. This is where she developed some of her trademark athleticism. Blackman received her first acting work on stage in London's West End as an understudy for \"The Guinea Pig\". She continued with roles in \"The Gleam\" (1946) and \"The Blind Goddess\" (1947), before moving into film. She debuted with Fame Is the Spur (1947), starring Michael Redgrave. In that picture, Blackman dies from a horse-riding accident. This film established the strange pattern wherein many of her movie characters meet untimely deaths. Signed up with the Rank Organisation, Blackman joined several other starlet hopefuls who were being groomed for greater fame. She was initially cast as demure, pleasant young things or \"English Rose\" types and received dependable but unmemorable costar billing in films such as Daughter of Darkness (1948) (1948), Quartet (1948), A Boy, a Girl and a Bike (1949) (1949), So Long at the Fair (1950) (1950) and Green Grow the Rushes (1951) (1951), the last starring a young Richard Burton. Hollywood also took brief notice when she was cast as the second lead femme in MGM's Conspirator (1949) (1949), starring Elizabeth Taylor and Robert Taylor. The stress and struggles of advancing her career coupled with a divorce from her first husband, Bill Sankey, caused Blackman to suffer a nervous collapse in the mid-1950s. After a brief time recovering in a hospital, she regained her health and began rebuilding her career with rather obligatory B-level fare, at first. That reentry culminated with a costarring role in one of the more famous retellings of the tragic \"Titanic\" tale, A Night to Remember (1958) (1958), costarring Kenneth More and David McCallum. Developing a solid footing again, she filmed The Square Peg (1958) (1959) with comedian Norman Wisdom and A Matter of WHO (1961) (1961) with Terry-Thomas. TV series work then also came her way, notably with the highly popular The Avengers (1961), costarring Patrick Macnee as John Steed. As the leather-clad \"Mrs. Cathy Gale\", Blackman showcased her incredible beauty, self-confidence, and athletic derring-do. Her admirable qualities made her not only a catch for the men, but also an inspirational figure for the 1960s feminist movement. Blackman left the show at its peak, however, and was replaced by the equally assertive and popular Diana Rigg as \"Mrs. Emma Peel\". Not out of work long, Blackman took on the role of Greek goddess \"Hera\" in popular movie adventure Jason and the Argonauts (1963) (1963) with marvelous Ray Harryhausen and melodrama Life at the Top (1965) (1965) with Laurence Harvey. She then filmed the most popular role of her career: \"Pussy Galore\". In the classic \"James Bond\" movie Goldfinger (1964) (1964), Blackman went toe to toe with Sean Connery's womanizing \"007\" and created major sparks on screen, managing to outclass the (wink-wink) double meaning of her character's name. That resurgence of popularity should have led to better film opportunities but did not. Blackman toiled for the most part in low-level melodramas and routine adventures. She earned raves on stage, however, as the blind heroine of the thriller \"Wait Until Dark\" as well as for her dual roles in \"Mr. and Mrs.\", a production based on two of Noël Coward's plays. She also enjoyed working occasionally with her second husband, actor Maurice Kaufmann, in the play \"Move Over, Mrs. Markham\" and the film thriller Fright (1971) with Susan George. On stage, she became a throaty-voiced sensation in various musicals, such as \"A Little Night Music\", \"The Sound of Music\", \"On Your Toes\", and \"Nunsense\". Divorced from Kaufmann in 1975 (he died in 1997), Blackman never remarried. The couple adopted two children in the late 1960s, Lottie and Barnaby. Now an octogenarian, the ever-lovely and still glamorous star performs frequently, more recently working in the long-running English hit comedy series The Upper Hand (1990) and in her one-woman stage show, \"Wayward Ladies\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMDg4MDgwNF5BMl5BanBnXkFtZTYwNTA5NjU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000303","name":"Honor Blackman","idIMDB":"nm0000303"},"actorId":"nm0000303","character":"Rhoda O'Donovan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Betty Warren","urlProfile":"http://www.imdb.com/name/nm0912735","urlPhoto":"","biography":{"dateOfBirth":"31 October 1905","placeOfBirth":" Fareham, Hampshire, England, UK","bio":"Betty Warren was born on October 31, 1905 in Fareham, Hampshire, England. She was an actress, known for Passport to Pimlico (1949), So Long at the Fair (1950) and Champagne Charlie (1944). She died on December 15, 1990 in London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0912735","name":"Betty Warren","idIMDB":"nm0912735"},"actorId":"nm0912735","character":"Mrs. O'Donovan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zena Marshall","urlProfile":"http://www.imdb.com/name/nm0551243","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNTMzMjMwNl5BMl5BanBnXkFtZTcwMTIzMDMxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1925","placeOfBirth":" Nairobi, Kenya","height":"5' 5\" (1.65 m)","bio":"Striking, dark-haired beauty Zena Moyra Marshall was born of French (from her mother's side) and English/Irish (her father's) ancestry in Narobi, Kenya. After the early death of her father, her mother remarried and moved the family to Leicestershire. Zena received her education from St Mary's Roman Catholic School in Ascot. Her interest in the acting profession matured after a wartime theatrical tour with the Entertainments National Service Association (ENSA), while still in her teens. After completing her training at RADA, her exotic looks led to a contract with the Rank Organisation where she was groomed by the so-called 'charm school' as a sultry temptress and second lead in costume films, romantic melodramas and thrillers. Zena made her screen debut in the stagey, moribund epic Caesar and Cleopatra (1945). She had a bit-part as a handmaiden. Interestingly, this was also a screen bow for future James Bond star Roger Moore, uncredited as a Roman soldier. Zena's subsequent career was anything but meteoric. For several years, she was given only minor supporting roles in productions by Rank affiliates, such as GFD/Two Cities and Gainsborough, including Sleeping Car to Trieste (1948), Snowbound (1948) and So Long at the Fair (1950). A brief sojourn in Hollywood resulted in a lacklustre Allied Artists musical, Let's Be Happy (1957), as an amorous redhead, rivalling star Vera-Ellen for the affections of crooner Tony Martin. During the 1950's, she managed to rekindle her theatrical career and, by the end of the decade, went on tour through Germany and the Netherlands with \"The Late Edwina Black\". Zena was one of the first actresses to be featured in a British television commercial (for shampoo) on early ITV. Television did, in the end, become her favoured medium. She had some of her better on-screen moments in three episodes of Danger Man (1960), opposite Patrick McGoohan, between 1961 and 1964. Zena Marshall's main claim to fame rests on her portrayal of the Eurasian double agent, Miss Taro, in the first ever Bond film, Dr. No (1962). Her character was, incidentally, the first woman seduced by Bond, prior to his encounter with Ursula Andress in the part of Honey Rider. Another noted beauty, the reigning Miss Jamaica, Marguerite LeWars was originally slated to screen test for Miss Taro. However, Lewars declined for reasons of 'personal modesty' and is merely glimpsed in the film in a bit as an unnamed photographer. Zena herself, was at first unhappy with the script, but Terence Young, who had previously worked with her on the poorly-received costume biopic,The Bad Lord Byron (1949), lightened some of the dialogue with humour. In the end, the bedroom scene with Sean Connery took three days to shoot, because Zena struggled with the idea of having to spit in her co-star's face, after Bond has her character turned over to the superintendent of police. Miss Taro remains one of the most iconic of Bond villainesses. Zena's last roles of note were as an Italian countess in Those Magnificent Men in Their Flying Machines or How I Flew from London to Paris in 25 hours 11 minutes (1965), and as a secretary fighting alien enemies (alongside incongruously cast accountant Charles Hawtrey in the insipid sci-fi outing The Terrornauts (1967). After that, she retired from the screen and settled into domestic life with her third husband, the writer/producer Ivan Foxwell.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNTMzMjMwNl5BMl5BanBnXkFtZTcwMTIzMDMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0551243","name":"Zena Marshall","idIMDB":"nm0551243"},"actorId":"nm0551243","character":"Nina","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eugene Deckers","urlProfile":"http://www.imdb.com/name/nm0213895","urlPhoto":"","biography":{"dateOfBirth":"22 October 1913","placeOfBirth":" Antwerp, Belgium","birthName":"Eugene Francis Deckers","bio":"Eugene Deckers was born on October 22, 1913 in Antwerp, Belgium as Eugene Francis Deckers. He was an actor, known for The Lavender Hill Mob (1951), North West Frontier (1959) and So Long at the Fair (1950). He died in 1977 in Paris, France.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0213895","name":"Eugene Deckers","idIMDB":"nm0213895"},"actorId":"nm0213895","character":"Day Porter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Felix Aylmer","urlProfile":"http://www.imdb.com/name/nm0043875","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTMxM2QxZWYtMzRiOC00OTczLWE3N2YtZTA0YjhhMDhmZmU2L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 February 1889","placeOfBirth":" Corsham, Wiltshire, England, UK","birthName":"Felix Edward Aylmer Jones","height":"5' 9\" (1.75 m)","bio":"British character actor Felix Aylmer was educated at Oxford and later studied drama, making his stage debut at the London Coliseum in 1911. During World War I he served in the Royal Naval Volunteer Reserve and resumed his stage career after the war ended. He entered films in 1930 and stayed in them for the next 40 years, specializing in elderly, doddering characters (often clerics). Arguably his most memorable film appearance is that of the Archbishop of Canterbury in Laurence Olivier's Henry V (1944). He is also well-known for his portrayal of Father Anselm in the television series Oh Brother! (1968).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTMxM2QxZWYtMzRiOC00OTczLWE3N2YtZTA0YjhhMDhmZmU2L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0043875","name":"Felix Aylmer","idIMDB":"nm0043875"},"actorId":"nm0043875","character":"British Consul","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"André Morell","urlProfile":"http://www.imdb.com/name/nm0603682","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk5Njc4OTAwNV5BMl5BanBnXkFtZTcwMDg0NDMxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 August 1909","placeOfBirth":" Pancras, London, England, UK","birthName":"Cecil André Mesritz","height":"6' (1.83 m)","bio":"André Morell was born on August 20, 1909 in Pancras, London, England as Cecil André Mesritz. He was an actor, known for The Bridge on the River Kwai (1957), Ben-Hur (1959) and Barry Lyndon (1975). He was married to Joan Greenwood. He died on November 28, 1978 in London.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk5Njc4OTAwNV5BMl5BanBnXkFtZTcwMDg0NDMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0603682","name":"André Morell","idIMDB":"nm0603682"},"actorId":"nm0603682","character":"Doctor Hart","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Austin Trevor","urlProfile":"http://www.imdb.com/name/nm0872454","urlPhoto":"","biography":{"dateOfBirth":"8 October 1897","placeOfBirth":" Belfast, Ireland","birthName":"Claude Austin Trevor Schilsky","height":"6' (1.83 m)","bio":"Austin Trevor was born on October 8, 1897 in Belfast, Ireland as Claude Austin Trevor Schilsky. He was an actor, known for The Red Shoes (1948), Goodbye, Mr. Chips (1939) and The Day the Earth Caught Fire (1961). He was married to Violet Clowes. He died on January 21, 1978 in Bury St. Edmunds, Suffolk, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0872454","name":"Austin Trevor","idIMDB":"nm0872454"},"actorId":"nm0872454","character":"Police Commissaire","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Natasha Sokolova","urlProfile":"http://www.imdb.com/name/nm0812497","urlPhoto":"","biography":{"dateOfBirth":"1 September 1917","placeOfBirth":" Sao Paulo, Brazil","birthName":"Natalia Kremneff","bio":"Natasha Sokolova was born on September 1, 1917 in Sao Paulo, Brazil as Natalia Kremneff. She was an actress, known for The Passionate Friends (1949), So Long at the Fair (1950) and Demon of the Steppes (1926). She died in 1969 in Paddington, London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0812497","name":"Natasha Sokolova","idIMDB":"nm0812497"},"actorId":"nm0812497","character":"Charlotte","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nelly Arno","urlProfile":"http://www.imdb.com/name/nm0036319","urlPhoto":"","biography":{"dateOfBirth":"15 July 1892","placeOfBirth":" Germany","bio":"Nelly Arno was born on July 15, 1892 in Germany. She was an actress, known for So Long at the Fair (1950), The Great Manhunt (1950) and Take My Life (1947). She died in September 1966 in New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0036319","name":"Nelly Arno","idIMDB":"nm0036319"},"actorId":"nm0036319","character":"Madame Verni","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0042980","urlIMDB":"http://www.imdb.com/title/tt0042980","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 21 min (81 min) (Argentina)","1 hr 26 min (86 min) (USA)","1 hr 26 min (86 min) (UK)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.3","filmingLocations":[{"location":"Pinewood Studios, Iver Heath, Buckinghamshire, England, UK"}],"awards":[{"award":"Bambi Awards 1951","titlesAwards":[{"titleAwardOutcome":"2nd place Bambi","categories":[{"category":"Best Actress - International","names":[{"name":"Jean Simmons","id":"nm0001739","role":null},{"name":"Trio","id":"tt0042752","role":null}]}]}]},{"award":"Picturegoer Awards 1951","titlesAwards":[{"titleAwardOutcome":"Nominated Gold Medal","categories":[{"category":"Best Actress","names":[{"name":"Jean Simmons","id":"nm0001739","role":null}]}]}]}],"votes":"1,186","type":"Movie","companyCreditsSimple":[{"idCompany":"co0103051","name":"Gainsborough Pictures"}],"keywords":{"keywords":["hotel","british noir","plague","death","year 1889","1889 exposition universelle","paris france","eiffel tower paris","world's fair","disappearance"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:30:40"}}