{"data":{"movies":[{"title":"Saturn 3","originalTitle":"","year":"1980","releaseDate":"19800215","directors":[{"name":"Stanley Donen","id":"nm0002045"},{"name":"John Barry","id":"nm0058045"}],"writers":[{"name":"Martin Amis","id":"nm0025007"},{"name":"John Barry","id":"nm0058045"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGU1MDY4YzYtMWIzYi00YjVkLWJiNzUtNTU4NTE1MTcxMWM2XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Adventure","Horror","Sci-Fi","Thriller"],"plot":"Two lovers stationed at a remote base in the asteroid fields of Saturn are intruded upon by a retentive technocrat from Earth and his charge: a malevolent 8-ft robot. Remember, in space no one can hear you scream...","simplePlot":"Two lovers stationed at a remote base in the asteroid fields of Saturn are intruded upon by a retentive technocrat from Earth and his charge: a malevolent 8-ft robot. Remember, in space no one can hear you scream.","actors":[{"actorName":"Farrah Fawcett","urlProfile":"http://www.imdb.com/name/nm0000396","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE3OTAzMTQ3OF5BMl5BanBnXkFtZTcwODkyMDU4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 February 1947","placeOfBirth":" Corpus Christi, Texas, USA","birthName":"Farrah Leni Fawcett","height":"5' 6\" (1.68 m)","bio":"Farrah Fawcett is a true Hollywood success story. A native of Texas, she was the daughter of Pauline Alice (Evans), a homemaker, and James Fawcett, an oil field contractor. She was a natural athlete, something that her father encouraged, and she attended a high school with a strong arts program. She attended University of Texas in Austin, graduating with a degree in Microbiology, but only wanted to be an actress. Winning a campus beauty contest got her noticed by an agent, who encouraged her to pursue acting. After graduating, she moved to Los Angeles and her healthy, all-American blond beauty was immediately noticed. She quickly got roles in various television commercials for such products as Ultra-Brite toothpaste, and Wella Balsam shampoo, and also made appearances in some TV series. In 1968, she met another Southerner, actor Lee Majors, star of the popular TV series The Big Valley (1965), on a blind date set up by their publicists. He became very taken with her and also used his own standing to promote her career. In 1969, she made her film debut in Love Is a Funny Thing (1969). The next year, she appeared in the film adaptation of the Gore Vidal bestselling novel Myra Breckinridge (1970). The shooting was very unpleasant, with much feuding on the set, and Farrah was embarrassed by the finished film, which was a major failure. But Farrah was undamaged and continued to win roles. In 1973, she and Majors married, and the following year, she won a recurring role in the crime series Harry O (1973). She had her first taste of major success when she won a supporting role in the science fiction film Logan's Run (1976). She came to the attention to the highly successful producer Aaron Spelling, who was impressed by her beauty and vivacious personality. That won her a role in the TV series Charlie's Angels (1976). She played a private investigator who works for a wealthy and mysterious businessman, along with two other glamorous female detectives, played by Kate Jackson and Jaclyn Smith. The show immediately became the most popular series on television, earning record ratings and a huge audience. All three actresses became very popular, but Farrah became by far the best known. She won People's Choice Award for Favorite Female Performer in a New TV program in 1977. Her lush, free-wheeling, wavy blond hair also became a phenomenon, with millions of women begging their hairstylists to give them \"The Farrah,\" as her hairstyle was called. Fawcett was also a savvy businesswoman, and she received 10% profit from the proceeds of her famous poster in a red swimsuit. It sold millions and she became the \"It Girl\" of the 1970s. Fawcett was America's sweetheart and found herself on every celebrity magazine and pursued by photographers and fans. While she enjoyed the success and got along well with her co-stars (both of whom were also of Southern origin), she found the material lightweight. Also, the long hours she worked were beginning to take a toll on her marriage to Majors, who found himself eclipsed by her popularity. So the following year, when the show was at its peak, she left to pursue a movie career. Charlie's Angels producers sued her, and the studios shied away from her, and she lost out on the lead role in the hit feature film Foul Play (1978) to Goldie Hawn. Eventually, she and the Charlie's Angels producers reached a settlement, where she would make guest appearances on the series. As a result of the negative publicity and some poor script choices, her career briefly hit a slow spot. In addition, she and Majors separated in 1979. She had starring roles in Somebody Killed Her Husband (1978), Sunburn (1979), and Saturn 3 (1980) (which she did a topless scene in), but all three failed financially. She appeared in the Burt Reynolds chase comedy The Cannonball Run (1981), which was successful financially, but it was met not only with bad reviews but also with bad publicity when Farrah's stunt double Heidi Von Beltz was involved in a stunt that went horribly wrong and left her a quadriplegic. Farrah's feature film career came to a halt, and she and Majors were drifting apart. In 1981, she met Ryan O'Neal, a friend of her husband's, and they began became friends and spent a great deal of time together. He also encouraged her to go back to television and she received good reviews in the well-received miniseries \"Murder in Texas\" (1981). In 1982, she filed for divorce, which Majors readily agreed to. Soon, she and O'Neal were a couple and moved in together. She set on sights on becoming a serious dramatic actress. She took over for Susan Sarandon in the stage play \"Extremities\" where she played a rape victim who turns the tables on her rapist. That, in turn, led her to her major comeback when she starred in the searing story of a battered wife in The Burning Bed (1984), based on a true story. It garnered a very large audience, and critics gave her the best reviews she had ever received for her heartfelt performance. She was nominated for both an Emmy and Golden Globe and also became involved in helping organizations for battered women. The following year, she and O'Neal became the parents of a son, 'Redmond O'Neal'. She tried to continue her momentum with a starring role in the feature film adaptation of Extremities (1986), and while she garnered a Golden Globe nomination, the film, itself, was not a hit. She continued to seek out serious roles, appearing mainly on television. She scored success again in Small Sacrifices (1989), again based on a true crime. Portraying an unhappy woman who is so obsessed with the man she loves that she shoots her children to make herself available and disguises it as a carjacking, Farrah again won rave reviews and helped draw a large audience, and was nominated for an Emmy again. Shortly afterwards, she and O'Neal co-starred in Good Sports (1991), playing a couple who co-star in a sports news program, but O'Neil's performance was lambasted and only 9 episodes were aired. In 1995, she surprised her fans by posing for \"Playboy\" at the age of 48, it became the magazine's best-selling issue of that decade. Her relationship with O'Neal was deteriorating, however, and in 1997, they broke up. The breakup took a toll, and she posed for Playboy again at the age of 50. To promote it, she appeared on Late Show with David Letterman (1993) and gave a rambling interview, sparking rumors of drug use. That same year, however, she made another comeback in The Apostle (1997), playing the neglected wife of a Pentacostal preacher, played by Robert Duvall. Both stars were praised and the film became a surprise hit. She also began dating James Orr, who had directed her earlier in the feature film Man of the House (1995). An incident occurred between them in 1998, and Farrah suffered injuries. The scandal drew nationwide headlines, especially after the tabloids published photos of Farrah with her injuries. The authorities compelled Fawcett to testify against Orr in court, and he was found guilty of assault and given a minimum sentence. Embarrassed, she lowered her profile and her career lost momentum, but she continued to work in television and films. She and O'Neal also started seeing each other again when he was diagnosed with leukemia. The new millennium brought her highs and lows. In 2000, she acted with Richard Gere in Robert Altman's film Dr. T & the Women (2000). Her son Redmond has had problems with drug abuse and has been in and out of jail. In 2001, she lost her only sister to cancer. In 2004, she received her third Emmy nomination for her performance in The Guardian (2003), and she starred in her own reality show titled \"Chasing Farrah\" in 2005 along with Ryan O'Neal, but that ended after only 7 episodes. That same year, she was devastated when her beloved mother died. In 2006, producer Aaron Spelling died, and she famously reunited with her Charlie's Angels co-stars Kate Jackson and Jaclyn Smith at the Emmys in a tribute to him. She looked tan and healthy, but soon, she was diagnosed with anal cancer. She asked her friend Alana Stewart to accompany her and videotape her during her doctor's visits. Those video journals resulted in the documentary \"Farrah's Story,\" co-executive produced by Fawcett. It aired in 2009, and viewers were shocked to see Farrah with a shaved head and in a continuous state of pain. Ryan O'Neal and Alana Stewart were constantly by her side, and her Charlie's Angels co-stars Kate Jackson and Jaclyn Smith also visited her, marking the final time that all three original angels appeared together on television. The documentary became a ratings success, and it earned a Emmy nomination as Outstanding Nonfiction Special. On June 25, 2009 Farrah lost her battle with cancer and passed away at aged 62. She left the bulk of her estate to her only son Redmond, and her trust fund allowed for the creation of The Farrah Fawcett Foundation, which provides funding for cancer research and prevention. Alana Stewart is the president of the Foundation and Jaclyn Smith's husband Dr. Brad Allen is one of the Board of Directors. Ryan O'Neal and Farrah's nephew Greg Walls are also on the Advisory Board, keeping alive her legacy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE3OTAzMTQ3OF5BMl5BanBnXkFtZTcwODkyMDU4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000396","name":"Farrah Fawcett","idIMDB":"nm0000396"},"actorId":"nm0000396","character":"Alex","urlCharacter":"http://www.imdb.com/character/ch0351306","main":true},{"actorName":"Kirk Douglas","urlProfile":"http://www.imdb.com/name/nm0000018","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NDc0MjI5NV5BMl5BanBnXkFtZTYwMDE1MjM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 December 1916","placeOfBirth":" Amsterdam, New York, USA","birthName":"Issur Danielovitch Demsky","height":"5' 9\" (1.75 m)","bio":"Cleft-chinned, steely-eyed and virile star of international cinema who rose from being \"the ragman's son\" (the name of his best-selling 1988 autobiography) to become a bona fide superstar, Kirk Douglas, also known as Issur Danielovitch Demsky, was born in Amsterdam, New York, in 1916. His parents, Bryna (Sanglel) and Herschel Danielovitch, were Jewish immigrants from Chavusy, Mahilyow Voblast (now in Belarus). Although growing up in a poor ghetto, Douglas was a fine student and a keen athlete and wrestled competitively during his time at St. Lawrence University. However, he soon identified an acting scholarship as a way out of his meager existence, and was sufficiently talented to gain entry into the American Academy of Dramatic Arts. He only appeared in a handful of minor Broadway productions before joining the US Navy in 1941, and then after the end of hostilities in 1945, returned to the theater and some radio work. On the insistence of ex-classmate Lauren Bacall movie producer Hal B. Wallis screen-tested Douglas and cast him in the lead role in The Strange Love of Martha Ivers (1946). His performance received rave reviews and further work quickly followed, including an appearance in the low-key drama I Walk Alone (1948), the first time he worked alongside fellow future screen legend Burt Lancaster. Such was the strong chemistry between the two that they appeared in seven films together, including the dynamic western Gunfight at the O.K. Corral (1957), the John Frankenheimer political thriller Seven Days in May (1964) and their final pairing in the gangster comedy Tough Guys (1986). Douglas once said about his good friend: \"I've finally gotten away from Burt Lancaster. My luck has changed for the better. I've got nice-looking girls in my films now\". After appearing in \"I Walk Alone\", Douglas scored his first Oscar nomination playing the untrustworthy and opportunistic boxer Midge Kelly in the gripping Champion (1949). The quality of his work continued to garner the attention of critics and he was again nominated for Oscars for his role as a film producer in The Bad and the Beautiful (1952) and as tortured painter Vincent van Gogh in Lust for Life (1956), both directed by Vincente Minnelli. In 1955 Douglas launched his own production company, Bryna Productions, the company behind two pivotal film roles in his career. The first was as French army officer Col. Dax in director Stanley Kubrick's brilliant anti-war epic Paths of Glory (1957). Douglas reunited with Kubrick for yet another epic, the magnificent Spartacus (1960). The film also marked a key turning point in the life of screenwriter Dalton Trumbo, who had been blacklisted during the McCarthy \"Red Scare\" hysteria in the 1950s. At Douglas' insistence Trumbo was given on-screen credit for his contributions, which began the dissolution of the infamous blacklisting policies begun almost a decade previously that had destroyed so many careers and lives. Douglas remained busy throughout the 1960s, starring in many films,. He played a rebellious modern-day cowboy in Lonely Are the Brave (1962), acted alongside John Wayne in the World War II story In Harm's Way (1965), again with The Duke in a drama about the Israeli fight for independence, Cast a Giant Shadow (1966), and once more with Wayne in the tongue-in-cheek western The War Wagon (1967). Additionally, in 1963 he starred in an onstage production of Ken Kesey's \"One Flew Over The Cuckoo's Nest\", but despite his keen interest, no Hollywood studio could be convinced to bring the story to the screen. However, the rights remained with the Douglas clan, and Kirk's talented son Michael Douglas finally filmed the tale in 1975, starring Jack Nicholson. Into the 1970s Douglas wasn't as busy as previous years; however, he starred in some unusual vehicles, including alongside a young Arnold Schwarzenegger in the loopy western comedy The Villain (1979), then with Farrah Fawcett in the sci-fi thriller Saturn 3 (1980) and then he traveled to Australia for the horse opera/drama L'homme de la rivière d'argent (1982). Unknown to many, Kirk has long been involved in humanitarian causes and has been a Goodwill Ambassador for the US State Department since 1963. His efforts were rewarded in 1981 with the Presidential Medal of Freedom, and in 1983 with the Jefferson Award. Furthermore, the French honored him with the Chevalier of the Legion of Honor. More recognition followed for his work with the American Cinema Award (1987), the German Golden Kamera Award (1987), The National Board of Reviews Career Achievement Award (1989), an honorary Academy Award (1995), Recipient of the American Film Institute's Lifetime Achievement Award (1999) and the UCLA Medal of Honor (2002). Despite a helicopter crash and a stroke suffered in the 1990s, he remains active and continues to appear in front of the camera.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NDc0MjI5NV5BMl5BanBnXkFtZTYwMDE1MjM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000018","name":"Kirk Douglas","idIMDB":"nm0000018"},"actorId":"nm0000018","character":"Adam","urlCharacter":"http://www.imdb.com/character/ch0351308","main":true},{"actorName":"Harvey Keitel","urlProfile":"http://www.imdb.com/name/nm0000172","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMDcxMjgxOV5BMl5BanBnXkFtZTcwODc2NTk2MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 May 1939","placeOfBirth":" Brooklyn, New York, USA","height":"5' 7½\" (1.71 m)","bio":"American actor and producer Harvey Keitel was born on May 13, 1939 in Brooklyn, New York City. An Oscar and Golden Globe Award nominee, he has appeared in films such as Martin Scorsese's Mean Streets (1973) and Taxi Driver (1976), Ridley Scott's The Duellists (1977) and Thelma & Louise (1991), Peter Yates' Mother, Jugs & Speed (1976), Quentin Tarantino's Reservoir Dogs (1992) and Pulp Fiction (1994), Jane Campion's La leçon de piano (1993), Abel Ferrara's Bad Lieutenant (1992), Robert Rodriguez's From Dusk Till Dawn (1996), James Mangold's Cop Land (1997), Paolo Sorrentino's Youth (2015). He is regarded as one of the greatest method actors ever. Along with actors Al Pacino and Ellen Burstyn, he is the current co-president of the Actors Studio. Keitel studied under both Stella Adler and Lee Strasberg and at the HB Studio, eventually landing roles in some Off-Broadway productions. During this time, Keitel auditioned for filmmaker Martin Scorsese and gained a starring role as \"J.R.\", in Scorsese's first feature film, Who's That Knocking at My Door (1967). Since then, Scorsese and Keitel have worked together on several projects. Keitel had the starring role in Scorsese's Mean Streets (1973), which also proved to be Robert De Niro's breakthrough film. Keitel re-teamed with Scorsese for Alice Doesn't Live Here Anymore (1974), in which he had a villainous supporting role, and appeared with Robert De Niro again in Scorsese's Taxi Driver (1976), playing the role of Jodie Foster's pimp.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMDcxMjgxOV5BMl5BanBnXkFtZTcwODc2NTk2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000172","name":"Harvey Keitel","idIMDB":"nm0000172"},"actorId":"nm0000172","character":"Benson","urlCharacter":"http://www.imdb.com/character/ch0351312","main":true}],"seasons":[],"idIMDB":"tt0079285","urlIMDB":"http://www.imdb.com/title/tt0079285","business":{"budget":{"money":"£10,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"ESP","country":"60,425,815","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 36 min (96 min)"],"soundMix":["Dolby (35 mm prints)","70 mm 6-Track (70 mm prints)"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm","70 mm (blow-up)"]},"rating":"5.1","filmingLocations":[{"location":"Shepperton Studios, Shepperton, Surrey, England, UK"}],"rated":"R","awards":[{"award":"Razzie Awards 1981","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Picture","names":[{"name":"Stanley Donen","id":"nm0002045","role":null}]},{"category":"Worst Actor","names":[{"name":"Kirk Douglas","id":"nm0000018","role":null}]},{"category":"Worst Actress","names":[{"name":"Farrah Fawcett","id":"nm0000396","role":null}]}]}]},{"award":"The Stinkers Bad Movie Awards 1980","titlesAwards":[{"titleAwardOutcome":"Nominated Stinker Award","categories":[{"category":"Worst Actress","names":[{"name":"Farrah Fawcett","id":"nm0000396","role":null}]},{"category":"Worst On-Screen Couple","names":[{"name":"Kirk Douglas","id":"nm0000018","role":null},{"name":"Farrah Fawcett","id":"nm0000396","role":null}]}]}]}],"votes":"6,431","type":"Movie","companyCreditsSimple":[{"idCompany":"co0018373","name":"ITC Films"},{"idCompany":"co0103232","name":"Transcontinental Film Productions (London)"}],"keywords":{"keywords":["robot","scientist","future","dog","brain","spaceship setting","pushed into water","falling into water","suicide","self sacrifice","earth viewed from space","falling through the floor","booby trap","impersonation","severed head","jealousy","older man younger woman relationship","bare chested male","hand around throat","fight","hit on the head","evil robot","electric shock","grabbed by the wrist","dead dog","killing a dog","surveillance camera","monitor","skipping rope","artificial intelligence","pill","pep pill","shower","eclipse","facial tattoo","spacecraft","countdown","bodily dismemberment","murder","airlock","future shock","jogging","chess","control room","computer control","man versus machine","spacesuit","spaceship","planet in title","trapped in space","male rear nudity","severed hand","digit in title","minimal cast","killer robot","topless female nudity","male nudity","female nudity","claustrophobia","bare butt","robot as menace","gore","outer space","planet","saturn the planet","space station","machine","android","rampage","independent film","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:53:59"}}