{"data":{"movies":[{"title":"The Man Who Planted Trees","originalTitle":"L'homme qui plantait des arbres","year":"1987","releaseDate":"19880611","directors":[{"name":"Frédéric Back","id":"nm0045610"}],"writers":[{"name":"Jean Giono","id":"nm0320274"},{"name":"Jean Roberts","id":"nm2842726"}],"runtime":"30 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MTUwNjA5NV5BMl5BanBnXkFtZTcwNDMxODcyMQ@@._V1.jpg","countries":["Canada"],"languages":["French"],"genres":["Animation","Short","Drama","Family"],"plot":"This film tells the story of a shepherd who repairs the ruined ecosystem of a secluded valley by single-handedly cultivating a forest over a thirty year period.","simplePlot":"The story of a shepherd's single handed quest to re-forest a barren valley.","actors":[{"actorName":"Philippe Noiret","urlProfile":"http://www.imdb.com/name/nm0634159","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MzE2OTE0N15BMl5BanBnXkFtZTcwNTg2NzIwNw@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1930","placeOfBirth":" Lille, Nord, France","height":"6' 1\" (1.85 m)","bio":"Philippe Noiret was one of French cinema's most familiar faces who appeared in more than 140 films in a career that spanned more than half a century. He was born on October 1, 1930, in Lille, Nord, France, into a middle class family of shopkeepers. His father was fond of literature. Young Noiret attended the College Janson-of-Sally in the 16th arrondissement in Paris. At school, he was more interested in acting than in academics; he failed to pass his baccalaureate exams three times and left school without graduation. He studied acting at the Centre Dramatique de l'Ouest (Western Drama Theatre). There, in 1950, Noiret made his debut sharing the stage with Gérard Philipe under directorship of Roger Blin. From 1953 - 1960 Noiret was a permanent member of the troupe with the Théâtre National Populaire (TNP) in Paris. There he played over 40 roles in seven years under directorship of Jean Vilar. While there he met actress Monique Chaumette, whom he married in 1962, and they had one daughter, Frederique. At that time Noiret continued his acting career as a stand-up comedian and a night club entertainer. Noiret made his big screen debut playing bit part in Gigi (1949), then earned his first on-screen credit in Agence matrimoniale (1952). He landed his first leading role as Lui, a government inspector, in the French New Wave film La Pointe Courte (1955) by notable female director Agnès Varda. His first big success came in 1960 with Louis Malle's film Zazie dans le métro (1960) (aka.. Zazie in the Metro). In 1968 he became a star in France with the title role in Alexandre le bienheureux (1968). After that success, Noiret moved on with his acting career and devoted himself almost entirely to the big screen. Noiret's trademark hangdog face and his range allowed him to portray a middle-class man or an aristocrat, but not a handsome romantic hero, so he was cast primarily as the Everyman character. In La Grande Bouffe (1973), an allegoric film about sex orgy and suicide by overeating, which caused a scandal at Cannes in 1973, Noiret co-starred in a controversial role as suicidal judge Philippe, alongside Marcello Mastroianni. Philippe Noiret shot to international fame with the supporting role as Alfredo, an old man who is a small town projectionist who befriends and inspires a young boy, in Cinema Paradiso (1988). He received international acclaim for his portrayal of the exiled Chilean poet Pablo Neruda in Il Postino: The Postman (1994) by director Michael Radford. Noiret won two Cesar Awards (the French equivalent of the Oscars) and earned three more Cesar nominations. In 1976 he won his first Cesar for his exceptional performance as Julien Dandieu, a surgeon who kills the Nazis in revenge for the death of his wife and daughter, in The Old Gun (1975) (aka.. The Old Gun). Noiret won his second Cesar for the leading role as Major Delaplane in La vie et rien d'autre (1989) (aka.. Life and Nothing But) in 1990. Over the years, Noiret worked with all of the France's top directors. He also made excellent radio performances and popular books readings, which he narrated with his serious voice and impeccable diction. He was decorated with the Knight of the Legion of Honor. Philippe Noiret was also known as an elegant hedonist and an avid dog lover. His other interests outside of the acting profession included art, horses, gourmet cuisine and cigars. For about 30 years he resided in his country house in the wine country near Carcassonne, in the South of France, where he generously supported the local causes. Noiret died of generalized complications of cancer on November 23, 2006, in a hospital, in Paris, and was laid to rest in Cimetière du Monparnasse in Paris, France.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MzE2OTE0N15BMl5BanBnXkFtZTcwNTg2NzIwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0634159","name":"Philippe Noiret","idIMDB":"nm0634159"},"actorId":"nm0634159","character":"Narrator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Plummer","urlProfile":"http://www.imdb.com/name/nm0001626","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MzQ5MDY3NF5BMl5BanBnXkFtZTcwNzMxOTU5Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1929","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Arthur Christopher Orme Plummer","height":"5' 10½\" (1.79 m)","bio":"Arthur Christopher Orme Plummer was born in Toronto, Ontario. He is the only child of Isabella Mary (Abbott), a secretary to the Dean of Sciences at McGill University, and John Orme Plummer, who sold securities and stocks. He is a great-grandson of John Abbott, who was Canada's third Prime Minister (from 1891 to 1892), and a great-great-great-grandson of Anglican clergyman John Bethune. He has Scottish, English, and Anglo-Irish ancestry. Plummer was raised in Senneville, Quebec, by Montreal. Until the 2009 Academy Awards were announced, it could be said about Plummer that he was the finest actor of the post-World War II period to fail to get an Academy Award. In that, he was following in the footsteps of the late great John Barrymore, whom Plummer so memorably portrayed on Broadway in a one-man show that brought him his second Tony Award. In 2010, Plummer finally got an Oscar nod for his portrayal of another legend, Leo Tolstoy in Tolstoï, le dernier automne (2009). Two years later, the first paragraph of his obituary was written when the 82-year-old Plummer became the oldest person in Academy history to win an Oscar. He won for playing a senior citizen who comes out as gay after the death of his wife in the movie Beginners (2010). As he clutched his statuette, the debonaire thespian addressed it thusly: \"You're only two years older than me darling, where have you been all of my life?\" Plummer then told the audience that at birth, \"I was already rehearsing my Academy acceptance speech, but it was so long ago mercifully for you I've forgotten it.\" The Academy Award was a long time in coming and richly deserved. Aside from the youngest member of the Barrymore siblings (which counted Oscar-winners Ethel Barrymore and Lionel Barrymore in their number), Christopher Plummer is the premier Shakespearean actor to come out of North America in the 20th century. He was particularly memorable as Hamlet, Iago and Lear, though his Macbeth opposite Glenda Jackson was -- and this was no surprise to him due to the famous curse attached to the \"Scottish Play\" -- a failure. Plummer also has given many fine portrayals on film, particularly as he grew older and settled down into a comfortable marriage with his third wife Elaine. He thanked her from the stage during the 2012 Oscar telecast, quipping that she \"deserves the Nobel Peace Prize for coming to my rescue every day of my life.\" Like another great stage actor, Richard Burton, the younger Plummer failed to connect with the screen in a way that would make him a star. Dynamic on stage, the charisma failed to transfer through the lens onto celluloid. Burton's early film career, when he was a contract player at 20th Century-Fox, failed to ignite despite his garnering two Oscar nominations early on. He did not become a superstar until the mid-1960s, after hooking up with Elizabeth Taylor on the set of Cleopatra (1963). It was Liz whom he credited with teaching him how to act on film. Christopher Plummer never made it as a leading man in films. Perhaps if he had been born earlier, and acted in the studio system of Hollywood's golden age, he could have been carefully groomed for stardom. As it was he shared the English stage actors' disdain -- and he was equally at home in London as he was on the boards of Broadway or on-stage in his native Canada -- for the movies, which did not help him in that medium, as he has confessed. As he aged, Plummer excelled at character parts. He was always a good villain, this man who garnered kudos playing Lucifer on Broadway in Archibald Macleish's Pulitzer Prize-winning \"J.B.\". Though he likely always be remembered as \"Captain Von Trapp\" in the atomic bomb-strength blockbuster The Sound of Music (1965) (a film he publicly despised until softening his stance in his 2008 autobiography \"In Spite of Me\"), his later film work includes such outstanding performances as the best cinema Sherlock Holmes--other than Basil Rathbone -- in Murder by Decree (1979), the chilling villain in L'argent de la banque (1978), his iconoclastic Mike Wallace in The Insider (1999), the empathetic psychiatrist in A Beautiful Mind (2001), and as Leo Tolstoy in Tolstoï, le dernier automne (2009). It was this last role that finally brought him recognition from the Academy of Motion Picture Arts & Sciences, when he was nominated as Best Actor in a supporting role. Plummer remains one of the most respected and honored actors performing in the English language. He's won two Emmy Awards out of six nominations stretching 46 years from 1959 and 2005, and one Genie Award in five nominations from 1980 to 2004. For his stage work, Plummer has racked up two Tony Awards on six nominations, the first in 1974 as Best Actor (Musical) for the title role in \"Cyrano\" and the second in 1997, as Best Actor (Play), in \"Barrymore\". Surprisingly, he did not win (though he was nominated) for his masterful 2004 performance of \"King Lear\", which he originated at the Stratford Festival in Ontario and brought down to Broadway for a sold-out run. His other Tony nominations show the wide range of his talent, from a 1959 nod for the Elia Kazan-directed production of Macleish's \"J.B.\" to recognition in 1994 for Harold Pinter's \"No Man's Land\", with a 1982 Best Actor (Play) nomination for his \"Iago\" in William Shakespeare's \"Othello\". He continues to be a very in-demand character actor in prestigious motion pictures. If he were English rather than Canadian, he'd have been knighted long ago. (In 1968, he was awarded Companion of the Order of Canada, the country's highest civilian honor and one which required the approval of the sovereign, Queen Elizabeth II.) If he lived in the company town of Los Angeles rather than in Connecticut, he likely would have several more Oscar nominations before winning his first for \"The Last Station\". As it is, as attested to in his witty and well-written autobiography, Christopher Plummer has been amply rewarded in life. In 1970, Plummer - a self-confessed 43-year-old \"bottle baby\" - married his third wife, dancer Elaine Taylor, who helped wean him off his dependency on alcohol. They live happily with their dogs on a 30-acre estate in Weston, Connecticut. Although he spends the majority of his time in the United States, he remains a Canadian citizen. His daughter, with actress Tammy Grimes, is actress Amanda Plummer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MzQ5MDY3NF5BMl5BanBnXkFtZTcwNzMxOTU5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001626","name":"Christopher Plummer","nicknames":["Chris"],"idIMDB":"nm0001626"},"actorId":"nm0001626","character":"Narrator","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0093488","urlIMDB":"http://www.imdb.com/title/tt0093488","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["30 min"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"8.6","filmingLocations":[],"awards":[{"award":"Academy Awards, USA 1988","titlesAwards":[{"titleAwardOutcome":"Won Oscar","categories":[{"category":"Best Short Film, Animated","names":[{"name":"Frédéric Back","id":"nm0045610","role":null}]}]}]},{"award":"Annecy International Animated Film Festival 1987","titlesAwards":[{"titleAwardOutcome":"Won Grand Prix","categories":[{"category":"","names":[{"name":"Frédéric Back","id":"nm0045610","role":null}]}]}]},{"award":"Cannes Film Festival 1987","titlesAwards":[{"titleAwardOutcome":"Nominated Palme d'Or","categories":[{"category":"","names":[{"name":"Frédéric Back","id":"nm0045610","role":null}]}]}]},{"award":"Clermont-Ferrand International Short Film Festival 1988","titlesAwards":[{"titleAwardOutcome":"Won Audience Award","categories":[{"category":"International Competition","names":[{"name":"Frédéric Back","id":"nm0045610","role":null}]}]},{"titleAwardOutcome":"Won Special Jury Award","categories":[{"category":"International Competition","names":[{"name":"Frédéric Back","id":"nm0045610","role":null}]}]}]},{"award":"Hiroshima International Animation Festival 1987","titlesAwards":[{"titleAwardOutcome":"Won Grand Prix","categories":[{"category":"","names":[{"name":"Frédéric Back","id":"nm0045610","role":null}]}]}]},{"award":"Ottawa International Animation Festival 1988","titlesAwards":[{"titleAwardOutcome":"Won Audience Award","categories":[{"category":"","names":[{"name":"Frédéric Back","id":"nm0045610","role":null}]}]},{"titleAwardOutcome":"Won Grand Prize","categories":[{"category":"","names":[{"name":"Frédéric Back","id":"nm0045610","role":null}]}]}]},{"award":"Tampere International Short Film Festival 1988","titlesAwards":[{"titleAwardOutcome":"Won Best Animation","categories":[{"category":"International Competition","names":[{"name":"Frédéric Back","id":"nm0045610","role":null}]}]}]},{"award":"World Animation Celebration 1987","titlesAwards":[{"titleAwardOutcome":"Won Grand Prize","categories":[{"category":"","names":[{"name":"Frédéric Back","id":"nm0045610","role":null}]}]},{"titleAwardOutcome":"Won WAC Winner","categories":[{"category":"Animated Works Between 15 and 30 Minutes","names":[{"name":"Frédéric Back","id":"nm0045610","role":null}]}]}]}],"votes":"4,712","type":"Movie","companyCreditsSimple":[{"idCompany":"co0045850","name":"Canadian Broadcasting Corporation (CBC)"},{"idCompany":"co0035593","name":"National Film Board of Canada (NFB)"},{"idCompany":"co0063461","name":"Société Radio-Canada"}],"keywords":{"keywords":["forest","shepherd","france","based on story","reforestation","deforestation","world war one","world war two","widower","village","rural setting","voice over narration","houseguest","forestry","ecology","beekeeping","acorn","1940s","1930s","1920s","1910s","environmental"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:08:48"}}