{"data":{"movies":[{"title":"Air America","originalTitle":"","year":"1990","releaseDate":"19900810","directors":[{"name":"Roger Spottiswoode","id":"nm0006854"}],"writers":[{"name":"Christopher Robbins","id":"nm0730313"},{"name":"John Eskow","id":"nm0260675"}],"runtime":"113 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDRiNzdlYzUtNzIxMy00OGI4LThlNjQtNTI3Njg5NjVlOWJkL2ltYWdlXkEyXkFqcGdeQXVyNjQzNDI3NzY@._V1.jpg","countries":["USA"],"languages":["English","Lao"],"genres":["Action","Comedy"],"plot":"Air America was the CIA's private airline operating in Laos during the Vietnam War, running anything and everything from soldiers to foodstuffs for local villagers. After losing his pilot's license, Billy Covington is recruited into it, and ends up in the middle of a bunch of lunatic pilots, gun-running by his friend Gene Ryack, and opium smuggling by his own superiors.","simplePlot":"A young pilot finds himself recruited unwittingly into a covert and corrupt CIA airlift organization operating in Vietnam War Era Laos.","actors":[{"actorName":"Mel Gibson","urlProfile":"http://www.imdb.com/name/nm0000154","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTUzOTMwNTM0OV5BMl5BanBnXkFtZTcwNDQwMTUxMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 January 1956","placeOfBirth":" Peekskill, New York, USA","birthName":"Mel Columcille Gerard Gibson","height":"5' 9¾\" (1.77 m)","bio":"Mel Columcille Gerard Gibson was born January 3, 1956 in Peekskill, New York, USA, as the sixth of eleven children of Hutton Gibson, a railroad brakeman, and Anne Patricia (Reilly) Gibson (who died in December of 1990). His mother was Irish, from County Longford, while his American-born father is of mostly Irish descent. Mel and his family moved to Australia in the late 1960s, settling in New South Wales, where Mel's paternal grandmother, contralto opera singer Eva Mylott, was born. After high school, Mel studied at the University of New South Wales in Sydney, performing at the National Institute of Dramatic Arts alongside future film thespians Judy Davis and Geoffrey Rush. After college, Mel had a few stints on stage and starred in a few TV shows. Eventually, he was chosen to star in Mad Max (1979) and in a movie called Tim (1979), co-starring Piper Laurie. The small budgeted movie Mad Max (1979) made him known worldwide, while Tim (1979) garnered him an award for Best Actor from the Australian Film Institute (equivalent to the Oscar). Later, he went on to star in Gallipoli (1981), which earned him a second award for Best Actor from the AFI. In 1980, he married Robyn Moore and had seven children. In 1984, Mel made his American debut in The Bounty (1984), which co-starred Anthony Hopkins. Then in 1987, Mel starred in what would become his signature series, Lethal Weapon (1987), in which he played \"Martin Riggs\". In 1990, he took on the interesting starring role in Hamlet (1990), which garnered him some critical praise. He also made the more endearing Forever Young (1992) and the somewhat disturbing The Man Without a Face (1993). 1995 brought his most famous role as \"Sir William Wallace\" in Braveheart (1995), for which he won two Oscars for Best Picture and Best Director. From there, he made such box office hits as The Patriot (2000), Ransom (1996), and Payback (1999). Today, Mel remains an international superstar mogul, continuously topping the Hollywood power lists as well as the Most Beautiful and Sexiest lists.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTUzOTMwNTM0OV5BMl5BanBnXkFtZTcwNDQwMTUxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000154","name":"Mel Gibson","idIMDB":"nm0000154"},"actorId":"nm0000154","character":"Gene","urlCharacter":"http://www.imdb.com/character/ch0506091","main":true},{"actorName":"Robert Downey Jr.","urlProfile":"http://www.imdb.com/name/nm0000375","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1965","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Robert John Downey Jr","height":"5' 8½\" (1.74 m)","bio":"Robert Downey Jr. has evolved into one of the most respected actors in Hollywood. With an amazing list of credits to his name, he has managed to stay new and fresh even after over four decades in the business. Downey was born April 4, 1965 in Manhattan, New York, the son of writer, director and filmographer Robert Downey Sr. and actress Elsie Downey (née Elsie Ann Ford). Robert's father is of half Lithuanian Jewish, one quarter Hungarian Jewish, and one quarter Irish, descent, while Robert's mother was of English, Scottish, German, and Swiss-German ancestry. Robert and his sister, Allyson Downey, were immersed in film and the performing arts from a very young age, leading Downey Jr. to study at the Stagedoor Manor Performing Arts Training Center in upstate New York, before moving to California with his father following his parents' 1978 divorce. In 1982, he dropped out of Santa Monica High School to pursue acting full time. Downey Sr., himself a drug addict, exposed his son to drugs at a very early age, and Downey Jr. would go on to struggle with abuse for decades. Downey Jr. made his debut as an actor at the age of five in the film Pound (1970), written and directed by his father, Robert Downey Sr.. He built his film repertoire throughout the 1980s and 1990s with roles in Tuff Turf (1985), Weird Science (1985), True Believer (1989), and Wonder Boys (2000) among many others. In 1992, Downey received an Academy Award nomination and won the BAFTA (British Academy Award) for Best Actor for his performance in the title role of Chaplin (1992). In Robert Altman's Short Cuts (1993), he appeared as an aspiring film make-up artist whose best friend commits murder. In Oliver Stone's Natural Born Killers (1994), with Woody Harrelson and Juliette Lewis, Downey starred as a tabloid TV journalist who exploits a murderous couple's killing spree to boost his ratings. For the comedy Heart and Souls (1993), Downey starred as a young man with a special relationship with four ghosts. In 1995, Downey starred in Restoration (1995), with Hugh Grant, Meg Ryan and Ian McKellen, directed by Michael Hoffman. Also that year, he starred in Richard III (1995), in which he appears opposite his Restoration (1995) co-star McKellen. In 1997, Downey was seen in Robert Altman's The Gingerbread Man (1998), alongside Kenneth Branagh, Daryl Hannah and Embeth Davidtz; in One Night Stand (1997), directed by Mike Figgis and starring Wesley Snipes and Nastassja Kinski; and in Hugo Pool (1997), directed by his father, Robert Downey Sr. and starring Sean Penn and Patrick Dempsey. In September of 1999, Downey appeared in Black & White (1999), written and directed by James Toback, along with Ben Stiller, Elijah Wood, Gaby Hoffmann, Brooke Shields and Claudia Schiffer. In January of 1999, he starred with Annette Bening and Aidan Quinn in In Dreams (1999), directed by Neil Jordan. In 2000, Downey co-starred with Michael Douglas and Tobey Maguire in Wonder Boys (2000), directed by Curtis Hanson. In this dramatic comedy, Downey played the role of a bisexual literary agent. In 2001, Downey made his prime-time television debut when he joined the cast of the Fox-TV series Ally McBeal (1997) as attorney \"Larry Paul\". For this role, he won the Golden Globe Award for Best Performance by an Actor in a Supporting Role in a Series, Mini-Series or Motion Picture Made for Television, as well as the Screen Actors Guild Award for Outstanding Performance by a Male in a Comedy Series. In addition, Downey was nominated for an Emmy for Outstanding Supporting Actor in a Comedy Series. The actor's drug-related problems escalated from 1996 to 2001, leading to arrests, rehab visits and incarcerations, and he was eventually fired from Ally McBeal (1997). Emerging clean and sober in 2003, Downey Jr. began to rebuild his career. He marked his debut into music with his debut album, titled \"The Futurist\", on the Sony Classics Label on November 23rd, 2004. The album's eight original songs, that Downey wrote, and his two musical numbers debuting as cover songs revealed his sultry singing voice and his musical talents. Downey displayed his versatility in two different films in October 2003: the musical/drama The Singing Detective (2003), a remake of the BBC hit of the same name, and the thriller Gothika (2003) starring Halle Berry and Penélope Cruz. Downey starred in powerful yet humbling roles inspired by real-life accounts of some of history's most precious kept secrets, including Richard Linklater's A Scanner Darkly (2006) in 2006 co-starring Keanu Reeves, Winona Ryder and Woody Harrelson, and Fur: An Imaginary Portrait of Diane Arbus (2006) co-starring Nicole Kidman, a film inspired by the life of Diane Arbus, the revered photographer whose images captured attention in the early 1960s. These roles exhibited Downey's momentum from the previous year of 2005, in which he starred in the Academy Award®-nominated feature film Good Night, and Good Luck. (2005), directed by George Clooney and in Shane Black's action comedy Kiss Kiss Bang Bang (2005) co-starring Val Kilmer. In 2007, he co-starred in David Fincher's suspenseful _Zodiac (2007/I)_ alongside Jake Gyllenhaal and Mark Ruffalo, about the notorious serial killer who haunted San Francisco during the 1970s. In May 2008, Downey achieved critical acclaim and worldwide box office success for his starring role in Iron Man (2008), Jon Favreau's big-screen rendering of the Marvel comic book superhero. The film co-starred Gwyneth Paltrow, Jeff Bridges and Terrence Howard. In August of 2008, Downey starred with Ben Stiller and Jack Black in the comedy Tropic Thunder (2008), and went on to receive an Academy Award®-nomination for Best Supporting Actor for his, Kirk Lazarus. In December 2009, Downey starred in the action-adventure Sherlock Holmes (2009). The film, directed by Guy Ritchie, co-starred Jude Law and Rachel McAdams and earned Downey a Golden Globe for Best Performance by an Actor in a Motion Picture - Comedy or Musical in January of 2010. In early Summer 2010, Downey re-teamed with director Jon Favreau and reprised his role as \"Tony Stark/Iron Man\" in the hugely successful sequel to the original film, Iron Man 2 (2010), starring Gwyneth Paltrow, Scarlett Johansson, Samuel L. Jackson and Mickey Rourke. Downey next starred in Due Date (2010), a comedy directed by Todd Phillips, in which he plays the role of an expectant father on a road trip racing to get back in time for the birth of his first child. Due Date (2010), starring The Hangover (2009)'s Zach Galifianakis, was released in November 2010. Downey was honored by Time Magazine's \"Time 100\" in 2008, an annual list of the 100 most influential people in the world. His laurels include two Academy Award nominations, three Golden Globe wins, numerous other award nominations and wins, and tremendous popular and commercial success, particularly in his roles as Sherlock Holmes and Tony Stark (the latter of which he has so far played in Iron Man (2008), Iron Man 2 (2010), The Avengers (2012), Iron Man 3 (2013), and Avengers: Age of Ultron (2015). For three consecutive years, from 2012 to 2015, Downey has topped the Forbes list of Hollywood's highest-paid actors, making an estimated $80 million in earnings between June 2014 and June 2015. In 2005, Downey Jr. married Susan Downey, who gave birth to their son, Exton Elias Downey, on February 7, 2012. Downey also has another son, Indio Falconer Downey, born September 7, 1993, from his first marriage to Deborah Falconer, from whom he was officially divorced in 2004. Robert has jump-started the Team Downey Production Company with wife Susan Downey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000375","name":"Robert Downey Jr.","nicknames":["Bob","RDJ"],"idIMDB":"nm0000375"},"actorId":"nm0000375","character":"Billy","urlCharacter":"http://www.imdb.com/character/ch0506083","main":true},{"actorName":"Nancy Travis","urlProfile":"http://www.imdb.com/name/nm0001802","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1MDQ0NDk5MF5BMl5BanBnXkFtZTcwMDEwNDI3Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 September 1961","placeOfBirth":" New York City, New York, USA","birthName":"Nancy Ann Travis","height":"5' 4\" (1.63 m)","bio":"Nancy Travis was born in New York City, to Theresa, a social worker, and Gordon Travis, a sales executive. She lived in Baltimore and Boston before returning to her birthplace to study drama at New York University. Her first job out of school was with New York's American Jewish Theater, after which she hit the road, joining the national tour of Neil Simon's \"Brighton Beach Memoirs.\" She has maintained a connection to the stage throughout her career. A founding member of the New York-based off-Broadway theater company Naked Angels, she appeared in their production of Frank Pugliese's play \"Aven-U Boys, \" as well as \"King of Connecticut\" with Frances McDormand. She also performed in the Broadway run of the award-winning play \"I'm Not Rappaport\" with Cleavon Little and Judd Hirsch. More recently, she appeared in Athol Fugard's \"My Children, My Africa,\" which the author directed at the La Jolla Playhouse. No stranger to television, Travis starred with Peter Gallagher and Isabella Rossellini in the Tom Cruise-directed segment of the Showtime anthology series Fallen Angels (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1MDQ0NDk5MF5BMl5BanBnXkFtZTcwMDEwNDI3Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001802","name":"Nancy Travis","idIMDB":"nm0001802"},"actorId":"nm0001802","character":"Corinne Landreaux","urlCharacter":"http://www.imdb.com/character/ch0218617","main":true},{"actorName":"Ken Jenkins","urlProfile":"http://www.imdb.com/name/nm0420898","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTIwNTQxOTA1NV5BMl5BanBnXkFtZTcwMTY1MDQwNA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1940","placeOfBirth":" Dayton, Ohio, USA","height":"5' 7½\" (1.71 m)","bio":"A versatile veteran of film, television and theater, Ken Jenkins began his acting career performing in high school theater productions in his hometown of Dayton, Ohio. \"I was fortunate to discover the world through the words of William Shakespeare, George Bernard Shaw, Arthur Miller and Tennessee Williams, and to discover in myself a love for the theater that has shaped my life\", says Jenkins. Jenkins went on to study acting at Antioch College while continuing to perform on Broadway and in regional companies throughout his college years. In 1969, he co-founded and served for three years as Associate Artistic Director for the prestigious Actor's Theatre of Louisville, which became known as a breeding ground for some of America's best new playwrights, including Beth Henley and Marsha Norman. Jenkins continued to work with the theater as an actor, director and writer through 1983. Over his 30 years in the theater, Jenkins has been associated with an average of 10 plays a year as an actor, director or playwright. He has portrayed \"Hamlet\" and \"Cyrano\" and performed in other classics by Shakespeare, Ibsen, Shaw and Molière. One of his favorite roles, however, was \"The Duke\", which he played opposite his son, Daniel Jenkins, in the 1985 Broadway musical, \"Big River\". In 1987, Jenkins appeared in John Sayles' critically acclaimed feature film, Matewan (1987) which opened the actor to the joys of acting for the camera. Most recently seen in The Sum of All Fears (2002) with Morgan Freeman and I Am Sam (2001) with Sean Penn, his other feature-film credits include Courage Under Fire (1996), The Abyss (1989), Air America (1990) and Last Man Standing (1996). Jenkins' television credits include a co-starring role for two seasons on Homefront (1991), two seasons on Wiseguy (1987) and guest-star roles on The X-Files (1993), Family Law (1999) and Chicago Hope (1994). He has also appeared in the television movies Thirst (1998), Hiroshima (1995), And the Band Played On (1993). Jenkins is an avid woodworker and a skilled dog trainer. He is married to Katharine Hepburn's niece, actress Katharine Houghton, probably best remembered as playing Hepburn & Tracy's daughter in the classic Guess Who's Coming to Dinner (1967).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTIwNTQxOTA1NV5BMl5BanBnXkFtZTcwMTY1MDQwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0420898","name":"Ken Jenkins","idIMDB":"nm0420898"},"actorId":"nm0420898","character":"Major Donald Lemond","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Marshall Grant","urlProfile":"http://www.imdb.com/name/nm0335344","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMjc1NzI2Nl5BMl5BanBnXkFtZTcwOTUxMjAxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 June 1955","placeOfBirth":" Westport, Connecticut, USA","bio":"David Marshall Grant was born on June 21, 1955 in Westport, Connecticut, USA. He is a producer and actor, known for Brothers & Sisters (2006), The Devil Wears Prada (2006) and Looking (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMjc1NzI2Nl5BMl5BanBnXkFtZTcwOTUxMjAxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0335344","name":"David Marshall Grant","idIMDB":"nm0335344"},"actorId":"nm0335344","character":"Rob Diehl","urlCharacter":"http://www.imdb.com/character/ch0218628","main":true},{"actorName":"Lane Smith","urlProfile":"http://www.imdb.com/name/nm0809031","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM4NDc0NjQwOV5BMl5BanBnXkFtZTgwMTMyNzQ2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1936","placeOfBirth":" Memphis, Tennessee, USA","birthName":"Walter Lane Smith","height":"6' 0½\" (1.84 m)","bio":"Lane Smith was born on April 29, 1936 in Memphis, Tennessee, USA as Walter Lane Smith. He was an actor, known for Lois & Clark: The New Adventures of Superman (1993), My Cousin Vinny (1992) and The Mighty Ducks (1992). He was married to Debbie Benedict and Sydnee Roberta Balaber. He died on June 13, 2005 in Northridge, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM4NDc0NjQwOV5BMl5BanBnXkFtZTgwMTMyNzQ2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0809031","name":"Lane Smith","idIMDB":"nm0809031"},"actorId":"nm0809031","character":"Senator Davenport","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Art LaFleur","urlProfile":"http://www.imdb.com/name/nm0480869","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODY1Mjk4ODc4NF5BMl5BanBnXkFtZTYwMDY2MDAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1943","placeOfBirth":" Gary, Indiana, USA","height":"5' 11¾\" (1.82 m)","bio":"Art LaFleur was born on September 9, 1943 in Gary, Indiana, USA. He is an actor and writer, known for The Sandlot (1993), Field of Dreams (1989) and Cobra (1986).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODY1Mjk4ODc4NF5BMl5BanBnXkFtZTYwMDY2MDAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0480869","name":"Art LaFleur","idIMDB":"nm0480869"},"actorId":"nm0480869","character":"Jack Neely","urlCharacter":"http://www.imdb.com/character/ch0218622","main":true},{"actorName":"Ned Eisenberg","urlProfile":"http://www.imdb.com/name/nm0251999","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzODcwMTE2NF5BMl5BanBnXkFtZTcwMjYxMDkwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 January 1957","placeOfBirth":" New York City, New York, USA","bio":"Ned Eisenberg was born on January 13, 1957 in New York City, New York, USA. He is an actor, known for Limitless (2011), Million Dollar Baby (2004) and Last Man Standing (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzODcwMTE2NF5BMl5BanBnXkFtZTcwMjYxMDkwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0251999","name":"Ned Eisenberg","idIMDB":"nm0251999"},"actorId":"nm0251999","character":"Pirelli","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marshall Bell","urlProfile":"http://www.imdb.com/name/nm0068382","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzODI4NzU1NV5BMl5BanBnXkFtZTgwMzE2ODIwMjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 September 1942","placeOfBirth":" Tulsa, Oklahoma, USA","birthName":"Archibald Marshall Bell","height":"6' 1¼\" (1.86 m)","bio":"A tall, imposing character actor with a penetrating stare, Marshall Bell has provided excellent support in a variety of roles and genres. He was born in Tulsa, Oklahoma, on September 28, 1942, and had been working as a consultant, teaching senior executives how to improve their speaking skills, prior to starting an acting career relatively late in life. His connection was his wife, the veteran costume designer Milena Canonero, herself a winner of three Academy Awards and nominee for five more. He made his motion picture debut in the drama \"Birdy\", which was seen by enough people to effectively jump-start his career. One of his next few roles was one of his most infamous: the creepy Coach Schneider of \"A Nightmare on Elm Street Part 2: Freddy's Revenge\". But the role that really got him noticed was as resistance leader George / Kuato in \"Total Recall\" (the role re-united him with Arnold Schwarzenegger, as he'd played a hit man in the comedy \"Twins\"). Other substantial film roles include a frightening homeless man terrorizing Bill Paxton in the movie \"The Vagrant\", Gordies' emotionally distant father in \"Stand By Me\", and General Owen in the movie \"Starship Troopers\", re-uniting him with \"Total Recall\" director Paul Verhoeven. He's done many TV series, including 'G vs. E', 'Wiseguy', 'The X-Files', 'Tales from the Crypt', 'Hill Street Blues', 'House', and 'Deadwood'. He's also appeared in commercials and done voice-over work. A solid, reliable actor with an authoritative presence, Bell is a natural for playing \"tough guy\" roles, although movies like \"Airheads\" show him to be able to play comedy equally well. He continues to add many credits to his resume, including the critically acclaimed \"Capote\", the prisoner of war drama \"Rescue Dawn\", and the family film \"Nancy Drew\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzODI4NzU1NV5BMl5BanBnXkFtZTgwMzE2ODIwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0068382","name":"Marshall Bell","idIMDB":"nm0068382"},"actorId":"nm0068382","character":"O.V.","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Bowe","urlProfile":"http://www.imdb.com/name/nm0100762","urlPhoto":"","biography":{"dateOfBirth":"4 January 1964","placeOfBirth":" Los Angeles, California, USA","bio":"David Bowe has either appeared in or been the \"voice\" of literally hundreds of National Television and radio commercials! Beginning in 1979 as a teenager helping mom push the car out of the mud for AMC Family Wagon! Through 2016, where he continued in his 6th year as the Voice of IHOP! In between he has appeared in ads for Wendy's, Oscar Meyer, HoneyNut Cheerios, Bud Light, Eggo Waffles, Frosted Flakes, Kodak, Burger King, Ca Lottery, Jack in the Box, Blockbuster Video, Saturn Cars, Taquita Coolers not to mention the on camera spokesman for the launch of MCI friends & family and the first human to appear in the annual \"Bud Bowl\" campaign for the Super Bowl!! He has been \"heard\" by millions as the recognizable Voice of IHOP family restaurants for the past 6 & a half years! Before that recorded voice-overs for hundreds of TV & radio spots! Including, Buick, Diet Dr. Pepper, Intel, Best Buy, Cool from Nestea, AMC theaters, Old Milwaukee Beer, Comp USA and for over 10 years was one of the voices of Fred Meyer superstores located in the Pacific northwest! Not to mention over a hundred Motion Pictures and television appearances over the past 30 years!","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0100762","name":"David Bowe","idIMDB":"nm0100762"},"actorId":"nm0100762","character":"Saunders","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Burt Kwouk","urlProfile":"http://www.imdb.com/name/nm0477297","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMTQwMjI4N15BMl5BanBnXkFtZTcwMDEzODExOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1930","placeOfBirth":" Warrington, Cheshire, England, UK","birthName":"Herbert Tsangtse Kwouk","height":"5' 6\" (1.68 m)","bio":"Burt Kwouk was born on July 18, 1930 in Warrington, Cheshire, England as Herbert Tsangtse Kwouk. He was an actor, known for Goldfinger (1964), Le baiser mortel du dragon (2001) and The Pink Panther Strikes Again (1976). He was married to Caroline Tebbs. He died on May 24, 2016 in Hampstead, London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMTQwMjI4N15BMl5BanBnXkFtZTcwMDEzODExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0477297","name":"Burt Kwouk","idIMDB":"nm0477297"},"actorId":"nm0477297","character":"General Lu Soong","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tim Thomerson","urlProfile":"http://www.imdb.com/name/nm0859772","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NzEyNzI4MV5BMl5BanBnXkFtZTYwNTY1MDAz._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1946","placeOfBirth":" Coronado, California, USA","birthName":"Joseph Timothy Thomerson","height":"5' 11\" (1.8 m)","bio":"Tim Thomerson rates highly as one of the best, most prolific, versatile and dependable character actors to ever grace both the big and small screens alike with pleasing regularity since the mid 70s. Although often cast as laconic rough 'n' tumble macho guys, Thomerson has proved on many occasions that he can essay comic roles and more substantial dramatic parts with equal skill and conviction. He was born on April 8th, 1946 in Coronado, California and was raised in Hawaii and San Diego. He did a stint in the National Guard prior to getting a job as a prop man and set builder at the Old Globe Theatre in San Diego. Character actor Anthony Zerbe advised Thomerson to get lessons from legendary acting teacher Stella Adler in New York; and he duly studied with Adler for four years. He began his show business career as a stand-up comedian; he performed at the clubs The Bitter End, Bud Friedman's Improvisation and Catch A Rising Star in New York and at the Comedy Store and the Improv in Los Angeles. He eventually even had a guest spot on \"The Tonight Show\" with Johnny Carson. His film debut was with a funny small role in the hilarious \"Car Wash.\" He achieved his greatest enduring cult popularity with his delightfully deadpan portrayal of rugged police detective Jack Deth in the terrific \"Trancers\" and its strictly so-so sequels. Other memorable parts include eccentric police detective Jerry Moriarty in the fine \"Fade to Black,\" weary factory worker Ray in \"Take This Job and Shove It,\" a highway patrolman in Clint Eastwood's poignant and underrated \"Honkytonk Man,\" burnt-out Vietnam vet helicopter pilot Charts in the exciting \"Uncommon Valor,\" grimy mercenary Rhodes in the cheesy \"Metalstorm: The Destruction of Jared-Syn,\" the crazed John Reynolds in \"Volunteers,\" demented cult leader Lester in \"Cherry 2000,\" the tough-as-nails the Sarge in the enjoyably quirky \"Zone Troopers;\" lovely and touching as the gentle Loy in the outstanding \"Near Dark,\" diminutive, but fearless alien lawman Brick Bardo in the funky \"Dollman,\" and a scruffy motorcyclist in Terry Gilliam's unjustly maligned \"Fear and Loathing in Las Vegas.\" Tim has appeared in a large number of films for low-budget independent director Albert Pyon and acted alongside real-life best buddy Brion James in numerous pictures (the two first met while both serving in the National Guard Reserves). On television Thomerson played the half-man, half-woman Gene-Jean on the uproarious, but sadly short-lived sci-fi parody program \"Quark.\" Thomerson also had recurring roles on the TV shows \"Sirens\" and \"Land's End\" and has made guest appearances on countless TV shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NzEyNzI4MV5BMl5BanBnXkFtZTYwNTY1MDAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0859772","name":"Tim Thomerson","idIMDB":"nm0859772"},"actorId":"nm0859772","character":"Babo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harvey Jason","urlProfile":"http://www.imdb.com/name/nm0419256","urlPhoto":"","biography":{"dateOfBirth":"29 February 1940","placeOfBirth":" London, England, UK","bio":"Harvey Jason was born on February 29, 1940 in London, England. He is known for his work on The Lost World: Jurassic Park (1997), Air America (1990) and Oliver & Company (1988). He has been married to Pamela Franklin since November 29, 1970. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0419256","name":"Harvey Jason","idIMDB":"nm0419256"},"actorId":"nm0419256","character":"Nino","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sinjai Plengpanit","urlProfile":"http://www.imdb.com/name/nm0393294","urlPhoto":"","biography":{"birthName":"Sinjai Hongtai","height":"5' 7\" (1.7 m)","bio":"Sinjai Plengpanit was born as Sinjai Hongtai. She is an actress, known for Love of Siam (2007), Air America (1990) and 3 A.M. 3D: Part 2 (2014). She is married to Chatchai Plengpanich. They have three children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0393294","name":"Sinjai Plengpanit","idIMDB":"nm0393294"},"actorId":"nm0393294","character":"Gene's Wife","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Natta Nantatanti","urlProfile":"http://www.imdb.com/name/nm0620951","urlPhoto":"","biography":{"bio":"Natta Nantatanti is an actress, known for Air America (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0620951","name":"Natta Nantatanti","idIMDB":"nm0620951"},"actorId":"nm0620951","character":"Gene's Daughter","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0099005","urlIMDB":"http://www.imdb.com/title/tt0099005","business":{"budget":{"money":"$35,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$8,064,480","country":"USA","day":"12","month":"08","year":"1990","remarks":"1,902 Screens"}],"gross":[{"money":"SEK","country":"4,123,359","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1989/\">1989</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 53 min (113 min)"],"soundMix":["70 mm 6-Track (70 mm prints)","Dolby (35 mm prints)"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex Cameras and Lenses"],"laboratory":["DeLuxe, USA (prints)","Rank Film Laboratories, Denham, UK (processing)"],"filmLength":["3,078 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic)","70 mm (blow-up)"]},"rating":"5.7","metascore":"33","filmingLocations":[{"location":"Santa Ventura Studios - 5301 North Ventura Avenue, Ventura, California, USA"}],"rated":"R","awards":[{"award":"Political Film Society, USA 1991","titlesAwards":[{"titleAwardOutcome":"Nominated PFS Award","categories":[{"category":"Exposé","names":[]}]}]}],"votes":"22,763","type":"Movie","companyCreditsSimple":[{"idCompany":"co0094459","name":"Carolco Pictures"},{"idCompany":"co0149490","name":"IndieProd Company Productions"}],"keywords":{"keywords":["pilot","cia","vietnam war","soldier","laos","vietnam","smuggling","helicopter","drugs","aid worker","male camaraderie","rescue","rice field","black comedy","machismo","helicopter pilot","heroin","battle","cigar smoking","arms smuggling","radio station","village","rocket launcher","helicopter crash","air base","major","parachute","explosion","gasoline","hand grenade","general","jungle","abandoned factory","silencer","pistol","machine gun","rifle","los angeles california","uzi","airplane accident","restaurant","drunkenness","plane","gun","racial slur","drug smuggling","corruption","1960s","golf","interracial relationship","senator","aviation","smuggler","cambodia","nightclub","southeast asia","covert operation","based on novel","based on book","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:41:18"}}