{"data":{"movies":[{"title":"Pluto's Judgement Day","originalTitle":"","year":"1935","releaseDate":"19350831","directors":[{"name":"David Hand","id":"nm0359457"}],"writers":[],"runtime":"7 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2NTc0MjItYzliNy00ZTI3LWI2ZGYtYTlhNWM5ZjM2NjgxXkEyXkFqcGdeQXVyMTQxMjk0Mg@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation","Short","Comedy","Family","Fantasy"],"plot":"Pluto chases a kitten through a window and right into Mickey's lap. Mickey scolds him, and goes off to wash the kitten. Pluto falls asleep in front of the fire, and dreams of a hell ruled by cats where he is put on trial for all his crimes against cats and, of course, found guilty.","simplePlot":"Pluto chases a kitten through a window and right into Mickey's lap. Mickey scolds him, and goes off to wash the kitten. Pluto falls asleep in front of the fire, and dreams of a hell ruled ... ","actors":[{"actorName":"Billy Bletcher","urlProfile":"http://www.imdb.com/name/nm0088285","urlPhoto":"","biography":{"dateOfBirth":"24 September 1894","placeOfBirth":" Lancaster, Pennsylvania, USA","birthName":"William Bletcher","height":"5' 2\" (1.57 m)","bio":"Billy Bletcher, standing 5' 2\", was known as the little guy with the big voice, who, ironically, started his film career during the silent era. Billy's show business career began in 1913 at the age of 19 in vaudeville, and within a year, he went to work for Vitagraph Studios in Brooklyn where he both acted and directed. Two years later, he met his wife, Arline Harriett Roberts with whom he would stay married until the day he died in 1979. In 1917, he took his wife westward to Hollywood where he started with smaller production companies, such as the Christie Film Company, writing and acting in shorts, and then moved on to larger and larger companies, such as the Fox Film Corporation where he did a few cowboy movies, one with Tom Mix, playing the comedic element. Then onto larger companies, such as Warner Brothers, RKO, Columbia, and Paramount where he had mostly bit parts, but got experience working with the likes of The Three Stooges and The Marx Brothers. But it was in Mack Sennett's comedy troupe where he started getting recognition doing two-reelers, and his biggest break came when Hal Roach studios pared him with Billy Gilbert and his career took off. Because pictures now had sound, directors and studios everywhere were clamoring for his deep, rich voice. Mack Sennett and Hal Roach put Bletcher in shorts with W.C. Fields and Laurel and Hardy and he even played Spanky's father in the Little Rascals series, but it was Disney who made Bletcher a star. Pinto Colvig, the original voice of Goofy and Pluto, told Bletcher that Disney needed a big, blustering voice to \"huff and puff and blow your house in,\" so he tried out, got the job, and within a very short time, Disney had him doing a session a week in the sound booth, sometimes doing two and three voices. His voice got so famous that when he auditioned to do the voice of one of the seven dwarfs in Blanche Neige et les sept nains (1937), Walt Disney took him aside and told him, \"Billy, your voice is heard so much in all of these singles that I make, I don't think I'd want to use you as one of the Seven Dwarfs.\" Bletcher admits that because his voice was so low and resonant, the characters he got to play were usually the \"heavies\" (bad guys). And as a heavy his voice became too recognizable for him to get a role in a feature length Disney production, with one exception: he did get a minor role in Dumbo as the voice of one of the clowns. As a voice actor, he could go anywhere and soon found himself working for Leon Schlesinger at Warner Brothers, but never got credit for his work since Mel Blanc had it in his contract that he'd be the sole credit for voice characterizations. And at that time there were only a dozen or so actors doing voicework that the jobs were plentiful. He worked for Disney, Warner, and at MGM he did the voice of the Captain in the Captain and the Kids cartoons. In the fifties, he did several characters on the Lone Ranger radio program, but before that he did what's known in the business as ADR (automated dialogue replacement) work, with his old pal Pinto Colvig. In The Wizard of Oz (1939), their voices were substituted for a few of the munchkins. All in all, Bletcher worked on just over 450 films spanning nearly 60 years, his last film being a made-for-TV version of Li'l Abner (1971) in which he played Pappy Yokum. He passed away 13 years later at the age of 84.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0088285","name":"Billy Bletcher","idIMDB":"nm0088285"},"actorId":"nm0088285","character":"Cat Prosecutor","urlCharacter":"http://www.imdb.com/character/ch0371050","main":true},{"actorName":"Pinto Colvig","urlProfile":"http://www.imdb.com/name/nm0173418","urlPhoto":"","biography":{"dateOfBirth":"11 September 1892","placeOfBirth":" Jacksonville, Oregon, USA","birthName":"Vance DeBar Colvig","bio":"Pinto Colvig was the quintessential clown whose own identity was always hidden but whose innate warm-hearted character always came through his many talents. His humor tickled the funny bone and touched the heart. Incredibly gifted in music, art and mime, he spoke to different generations in different roles: as a child clown playing a squeaky clarinet, as a full-fledged circus clown under the big top, as a newspaper cartoonist, as a film animator, as a mimic and sound effects wizard, and as the voice of dozens of well-known characters on film, records, radio and television. Vance DeBar Colvig was born in Jacksonville, Oregon, on September 11, 1892. His school friends nicknamed him after a spotted horse named \"Pinto\" because of his freckled face - and just like his freckles, the name stuck for his entire life. Pinto's childhood home was filled with music and laughter, and he was a clown from birth. As the youngest of seven children, he would do anything to get attention. He learned to make people laugh by making faces and playing pranks. He also spent hours mimicking the sounds around him: a rusty gate, farm animals, sneezes, wind, cars, trains, etc. He and his brother Don put on song-and-dance minstrel shows at local functions. Along the way he picked up his instrument of choice, the clarinet, and soon played well enough to join the town band. It was the clarinet that got Pinto into show business when he was 12. Visiting Portland's \"Lewis and Clark Centennial Exposition\" with his father William, he was magnetized by \"The Crazy House\" on the Midway where a huckster attracted the crowd with a bass drum and shouts of \"Hubba Hubba!\" Pinto told the man he could play \"squeaky\" clarinet and ran back to the hotel to get his instrument. He was hired on the spot and given some oversized old clothes and a derby and, for the first time, white makeup and a clown face. The man told Pinto, \"Now you look like a real bozo\" (\"bozo\" was a name given to hobo or tramp clowns in those days). Pinto's act was to play a screechy clarinet while distorting his face and crossing his eyes at the high notes. He later recalled, \"I never was able to get circuses and carnivals out of my blood after that.\" He went to school during the winter and worked in the circus and vaudeville in the spring. While studying art at Oregon Agricultural College (now Oregon State University) and playing with the college band, he became known for his clever cartoons in student publications, his funny \"chalk talk\" performances improvising a monologue while quickly sketching cartoons, and his unconventional lifestyle. He never took his class courses seriously and his college career ended abruptly in the spring of 1913 when he accepted an offer to do his chalk talks for the prestigious Pantages vaudeville circuit and wound up in Seattle, Washington. There he joined a circus band and traveled throughout the country struggling to make ends meet. In 1914 he landed a job as a newspaper cartoonist at the \"Nevada Rockroller\" in Reno, and later the \"Carson City News\" in Carson City. By the spring of 1915 his cartooning was going well but the lure of the circus was too strong. When the Al G. Barnes Circus came through Carson City, Pinto dropped everything and joined the troupe, once again clowning and playing his clarinet in the circus band. In those days circuses closed down each winter and Pinto returned to newspaper cartooning wherever he could find a job. While working on a Portland newspaper between seasons in 1916, he met and married Margaret Bourke Slavin, putting an end to his vagabond life as a circus performer. With a family to support, Pinto and Margaret moved to San Francisco, where he returned to the newspaper business writing and drawing cartoons full-time at \"The Bulletin\" and later the \"San Francisco Chronicle\". His cartoon series, \"Life on the Radio Wave,\" which poked fun at the way the newly introduced radio was influencing people's lives, was syndicated nationally by United Features Syndicate. He greatly enjoyed cartooning and considered it another form of clowning. \"A cartoonist,\" he said, \"is just a clown with a pencil.\" While Pinto toiled daily to meet newspaper commitments, he began to spend evenings experimenting with the animation of cartoons and eventually set up his own studio, Pinto Cartoon Comedies Co., where he created one of the first animated silent films in color called \"Pinto's Prizma Comedy Revue (1919)\". In 1922, after realizing that San Francisco was not the place to break into the movie business, he moved his family to Hollywood. There he would be able to continue his animation work and find a wealth of other things that he could do. He was overjoyed one day to get an offer to join Mack Sennett, the reigning king of movie comedies, who had developed one of the most successful studios of the day, the Keystone Film Co., home of the famous Keystone Kops, Charles Chaplin and many others. Sennett needed an experienced animator for his own films, but Pinto soon found himself also writing and acting in comedies and dramas. In 1928 he teamed up with his friend Walter Lantz to create an early talking cartoon, \"Bolivar, the Talking Ostrich (1928)\", but unlike Walt Disney's Steamboat Willie (1928), it failed to become a hit. Pinto and Lantz, who would later be the voice of Woody Woodpecker, gave up and went to larger studios. Disney, who was making \"Mickey Mouse\" and \"Silly Symphony\" cartoons, signed Pinto to a contract in 1930. Pinto worked on stories, co-wrote songs such as the lyrics to \"Who's Afraid of the Big Bad Wolf?\" and was the original voice of animated characters such as Goofy and Pluto, Grumpy and Sleepy in Blanche Neige et les sept nains (1937) and the Practical Pig in \"Three Little Pigs.\" Disney cartoonists copied many of Pinto's facial expressions while drawing animal characters for the cartoons. He left Disney in 1937 following a fallout with Walt and Disney proceeded to reuse his old voice tracks. Meanwhile, Pinto freelanced voices and sound effects for Warner Bros. cartoons, sang for some of the Munchkins during Dorothy's arrival scenes in MGM's The Wizard of Oz (1939), and also joined Max Fleischer Studios in Miami, where he did the voice of Gabby in Gulliver's Travels (1939) and the blustering of Bluto in \"Popeye the Sailor\" cartoons. He returned to Disney in 1941 and continued to freelance for them and on radio programs for others. He was the original Maxwell automobile on Jack Benny's show, the hiccuping horse for Dennis Day, and a variety of voices for \"Amos 'n Andy.\" His live radio experience and contacts introduced him to the recording industry. He did several albums before encountering one of his best-known characters, Bozo the Clown. It was 1946 when Capitol Records in Hollywood hired Alan Livingston as a writer/producer. His initial assignment was to create a children's record library, for which he came up with the soon-to-be-legendary Bozo character. He wrote and produced a popular series of storytelling record-album and illustrative read-along book sets, beginning with the October 1946 release of \"Bozo at the Circus.\" His record-reader concept, which enabled children to read and follow a story in pictures while listening to it, was the first of its kind. The Bozo image was a composite design of Livingston's, derived from a variety of clown pictures and then given to an artist to turn into comic-book-like illustrations. Livingston then hired Pinto to portray the character. \"Pinto came in,\" Livingston recalls, \"and turned out to be a very jolly, likable fellow with the kind of warm, folksy voice I wanted. He didn't talk down to children.\" Not only did Livingston get a perfect Bozo voice in Pinto, he also got most of the animals and odd creatures under the sea and in outer space, all for the price of one. On some of the records, Pinto provided as many as eight other voices. The series turned out to be a smash hit for Capitol, selling over eight million albums in the late 1940s and early 1950s. The character also became a mascot for the record company and was later nicknamed \"Bozo the Capitol Clown.\" Pinto, as Bozo, also starred in the very first Bozo television series, Bozo's Circus (1949) on KTTV-Channel 11 (CBS) in Los Angeles, made numerous guest appearances on radio and personal appearance tours all over the country. He especially enjoyed his visits to children's hospitals and orphanages, according to Pinto, \"doin' my silly stuff to make them laugh.\" Pinto's Bozo ended in 1956 when Larry Harmon, one of several actors hired by Livingston and Capitol to portray Bozo at promotional appearances, formed a business partnership and bought the licensing rights to the character (excluding the record-readers) from Capitol and Livingston. In 1958 Jayark Films Corp. began distributing Bozo limited-animation cartoons to television stations, along with the rights for each to hire its own live Bozo host. Harmon produced and provided the voice of the character in the cartoons. On January 5, 1959, Bozo returned to television beginning with a live 30-minute weeknight show on KTLA-Channel 5 in Los Angeles. Although Pinto's Bozo days were over, it was his son, Vance Colvig Jr., whom KTLA chose as the live Bozo host. Vance's portrayal and the KTLA show lasted for six years, at which time Harmon bought out his partners and continued to market the character through his Larry Harmon Pictures Corp. If Pinto had any dark years, they were during World War II. Four of his five sons were of eligible age and his wife felt the dread that millions of mothers felt, which may have complicated an illness that made her a semi-invalid for several years. Pinto took care of her until her death in 1950. Throughout his life Pinto was upbeat and cheerful, convinced that laughter was the world's best medicine. \"Sure, there have been kicks in the pants and occasionally an empty gut,\" he once said, \"but those are the jolts what pushes a guy upward and onward!\" His letters, though touching on his philosophy, were never serious but always funny and filled with odd typing effects, extraneous capitalization, underlining, misspellings and strange made-up words. He also lavished his letters and envelopes with outrageous cartoons and balloons filled with gags. He kept regular correspondence with clown legends Felix Adler, Emmett Kelly, Lou Jacobs and Otto Griebling, and visited \"clown alley\" whenever a circus came to the Los Angeles area. In 1963 Pinto received a letter from Oregon Senator Maurine Neuberger thanking him for supporting her bill requiring warning labels on cigarette packages. It was a controversial idea at a time when nonsmoking areas were just a dream and America was blue with secondhand smoke. With lungs ravaged by a lifetime of heavy smoking, Pinto did his part to help others become aware of the problem. On October 3, 1967, Vance Debar \"Pinto\" Colvig died of lung cancer at the age of 75 in Woodland Hills, California. Vance Jr. donated his and his father's memorabilia to the Southern Oregon Historical Society in Pinto's hometown of Jacksonville in 1978. Vance Jr. passed away in 1991. In 1993, the Walt Disney Company honored Pinto Colvig as a \"Disney Legend.\" On May 28, 2004, he was inducted into the International Clown Hall of Fame in Milwaukee, Wisconsin.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0173418","name":"Pinto Colvig","nicknames":["'Dean of Hollywood Voicemen'"],"idIMDB":"nm0173418"},"actorId":"nm0173418","character":"Pluto","urlCharacter":"http://www.imdb.com/character/ch0027779","main":true},{"actorName":"Walt Disney","urlProfile":"http://www.imdb.com/name/nm0000370","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMTUyNjc5OF5BMl5BanBnXkFtZTcwMjMwNjYwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 December 1901","placeOfBirth":" Chicago, Illinois, USA","birthName":"Walter Elias Disney","height":"5' 10\" (1.78 m)","bio":"Walter Elias Disney was born on December 5, 1901 in Chicago, Illinois, the son of Flora Disney (née Call) and Elias Disney, a Canadian-born farmer and businessperson. He had Irish, German, and English ancestry. Walt moved with his parents to Kansas City at age seven, where he spent the majority of his childhood. At age 16, during World War I, he faked his age to join the American Red Cross. He soon returned home, where he won a scholarship to the Kansas City Art Institute. There, he met a fellow animator, Ub Iwerks. The two soon set up their own company. In the early 1920s, they made a series of animated shorts for the Newman theater chain, entitled \"Newman's Laugh-O-Grams\". Their company soon went bankrupt, however. The two then went to Hollywood in 1923. They started work on a new series, about a live-action little girl who journeys to a world of animated characters. Entitled the \"Alice Comedies\", they were distributed by M.J. Winkler (Margaret). Walt was backed up financially only by Winkler and his older brother Roy O. Disney, who remained his business partner for the rest of his life. Hundreds of \"Alice Comedies\" were produced between 1923 and 1927, before they lost popularity. Walt then started work on a series around a new animated character, Oswald the Lucky Rabbit. This series was successful, but in 1928, Walt discovered that M.J. Winkler and her husband, Charles Mintz, had stolen the rights to the character away from him. They had also stolen all his animators, except for Ub Iwerks. While taking the train home, Walt started doodling on a piece of paper. The result of these doodles was a mouse named Mickey. With only Walt and Ub to animate, and Walt's wife Lillian Disney (Lilly) and Roy's wife Edna Disney to ink in the animation cells, three Mickey Mouse cartoons were quickly produced. The first two didn't sell, so Walt added synchronized sound to the last one, Steamboat Willie (1928), and it was immediately picked up. With Walt as the voice of Mickey, it premiered to great success. Many more cartoons followed. Walt was now in the big time, but he didn't stop creating new ideas. In 1929, he created the 'Silly Symphonies', a cartoon series that didn't have a continuous character. They were another success. One of them, Flowers and Trees (1932), was the first cartoon to be produced in color and the first cartoon to win an Oscar; another, Three Little Pigs (1933), was so popular it was often billed above the feature films it accompanied. The Silly Symphonies stopped coming out in 1939, but Mickey and friends, (including Minnie Mouse, Donald Duck, Goofy, Pluto, and plenty more), were still going strong and still very popular. In 1934, Walt started work on another new idea: a cartoon that ran the length of a feature film. Everyone in Hollywood was calling it \"Disney's Folly\", but Blanche Neige et les sept nains (1937) was anything but, winning critical raves, the adoration of the public, and one big and seven little special Oscars for Walt. Now Walt listed animated features among his ever-growing list of accomplishments. While continuing to produce cartoon shorts, he also started producing more of the animated features. Pinocchio (1940), Dumbo (1941), and Bambi (1942) were all successes; not even a flop like Fantasia (1940) and a studio animators' strike in 1941 could stop Disney now. In the mid 1940s, he began producing \"packaged features\", essentially a group of shorts put together to run feature length, but by 1950 he was back with animated features that stuck to one story, with Cendrillon (1950), Alice au pays des merveilles (1951), and Peter Pan (1953). In 1950, he also started producing live-action films, with Treasure Island (1950). These began taking on greater importance throughout the 50s and 60s, but Walt continued to produce animated features, including La belle et le clochard (1955), Sleeping Beauty (1959), and 101 Dalmatians (1961). In 1955, he even opened a theme park in southern California: Disneyland. It was a place where children and their parents could take rides, just explore, and meet the familiar animated characters, all in a clean, safe environment. It was another great success. Walt also became one of the first producers of films to venture into television, with his series Walt Disney's Wonderful World of Color (1954) which he began in 1954 to promote his theme park. He also produced The Mickey Mouse Club (1955) and Zorro (1957). To top it all off, Walt came out with the lavish musical fantasy Mary Poppins (1964), which mixed live-action with animation. It is considered by many to be his magnum opus. Even after that, Walt continued to forge onward, with plans to build a new theme park and an experimental prototype city in Florida. He never did finish those plans, however; in 1966, he developed lung cancer brought on by his lifelong chain-smoking. He died in the hospital on December 15, 1966 at age 65. But not even his death, it seemed, could stop him. Roy carried on plans to build the Florida theme park, and it premiered in 1971 under the name Walt Disney World. What's more, his company continues to flourish, still producing animated and live-action films and overseeing the still- growing empire started by one man: Walt Disney, who will never be forgotten.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMTUyNjc5OF5BMl5BanBnXkFtZTcwMjMwNjYwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000370","name":"Walt Disney","nicknames":["Uncle Walt"],"idIMDB":"nm0000370"},"actorId":"nm0000370","character":"Mickey Mouse","urlCharacter":"http://www.imdb.com/character/ch0000630","main":true},{"actorName":"Clarence Nash","urlProfile":"http://www.imdb.com/name/nm0621699","urlPhoto":"","biography":{"dateOfBirth":"7 December 1904","placeOfBirth":" Watonga, Oklahoma, USA","birthName":"Clarence Charles Nash","height":"5' 2\" (1.57 m)","bio":"Clarence Nash was born on December 7, 1904 in Watonga, Oklahoma, USA as Clarence Charles Nash. He was an actor, known for The Three Caballeros (1944), Mickey and the Beanstalk (1947) and Mickey's Christmas Carol (1983). He was married to Margaret Seamans. He died on February 20, 1985 in Glendale, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0621699","name":"Clarence Nash","nicknames":["Ducky","Charlie Nash"],"idIMDB":"nm0621699"},"actorId":"nm0621699","character":"Kitten / Cat Judge","urlCharacter":"http://www.imdb.com/character/ch0371051","main":true}],"seasons":[],"idIMDB":"tt0026872","urlIMDB":"http://www.imdb.com/title/tt0026872","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["7 min"],"soundMix":["Mono"],"color":["Color (Technicolor)"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.4","filmingLocations":[],"rated":"APPROVED","awards":[],"votes":"614","type":"Movie","companyCreditsSimple":[{"idCompany":"co0008970","name":"Walt Disney Pictures"}],"keywords":{"keywords":["cat","kitten","fire","trial","hell","flattened","mousetrap","devil","hyperbolic physical distortion","burned while sleeping near fireplace","soul leaves body","pluto the character","wheelchair","torch","tangled limbs","rope","rocking chair","pitchfork","newspaper","mud","mouse","jury","judge","it was all a dream","helium balloon","headstone","halo","gavel","fight","dog chases cat","character's eyes fill the screen","calla lily","broken window","bloomers","ball and chain","anthropomorphism","anthropomorphic fire","anthropomorphic animal","angel","rat","dog","nightmare","revolving door","run over by steamroller","funeral march by chopin","character name in title","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:30:15"}}