{"data":{"movies":[{"title":"Operation Petticoat","originalTitle":"","year":"1959","releaseDate":"19600316","directors":[{"name":"Blake Edwards","id":"nm0001175"}],"writers":[{"name":"Stanley Shapiro","id":"nm0788630"},{"name":"Maurice Richlin","id":"nm0725009"}],"runtime":"124 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzljOWEyZDMtOTUzZS00ZDc5LTkyODgtNDY0ZTAyZmRiNzNiXkEyXkFqcGdeQXVyNzQzNDEyOQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Romance","War"],"plot":"A submarine newly commissioned is damaged in the opening days of WW II. A captain, looking for a command insists he can get it to a dockyard and captain it. Going slowly to this site, they find a stranded group of Army nurses and must take them aboard. How bad can it get? Trying to get a primer coat on the sub, they have to mix white and red in order to have enough. When forced to flee the dock during an air attack, they find themselves with the world's only Pink submarine, still with 5 women in the tight quarters of a submarine.","simplePlot":"During World War II, a commander finds himself stuck with a decrepit (and pink) submarine, a con man executive officer, and a group of army nurses.","actors":[{"actorName":"Cary Grant","urlProfile":"http://www.imdb.com/name/nm0000026","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYyODM4NDU1MV5BMl5BanBnXkFtZTYwMjI1ODM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 January 1904","placeOfBirth":" Horfield, Bristol, England, UK","birthName":"Archibald Alexander Leach","height":"6' 1½\" (1.87 m)","bio":"Once told by an interviewer, \"Everybody would like to be Cary Grant\", Grant is said to have replied, \"So would I.\" Cary Grant was born Archibald Alexander Leach in Horfield, Bristol, England, to Elsie Maria (Kingdon) and Elias James Leach, who worked in a factory. His early years in Bristol would have been an ordinary lower-middle-class childhood, except for one extraordinary event. At age nine, he came home from school one day and was told his mother had gone off to a seaside resort. The real truth, however, was that she had been placed in a mental institution, where she would remain for years, and he was never told about it (he wouldn't see his mother again until he was in his late 20s). He left school at fourteen, lying about his age and forging his father's signature on a letter to join Bob Pender's troupe of knockabout comedians. He learned pantomime as well as acrobatics as he toured with the Pender troupe in the English provinces, picked up a Cockney accent in the music halls in London, and then in July 1920, was one of the eight Pender boys selected to go to the US. Their show on Broadway, \"Good Times,\" ran for 456 performances, giving Grant time to acclimatize. He would stay in America. Mae West wanted Grant for She Done Him Wrong (1933) because she saw his combination of virility, sexuality and the aura and bearing of a gentleman. Grant was young enough to begin the new career of fatherhood when he stopped making movies at age 62. One biographer said Grant was alienated by the new realism in the film industry. In the 1950s and early 1960s, he had invented a man-of-the-world persona and a style--\"high comedy with polished words.\" In To Catch a Thief (1955), he and Grace Kelly were allowed to improvise some of the dialogue. They knew what the director, Alfred Hitchcock, wanted to do with a scene, they rehearsed it, put in some clever double entendres that got past the censors, and then the scene was filmed. His biggest box-office success was another Hitchcock 1950s film, North by Northwest (1959) made with Eva Marie Saint since Kelly was by that time Princess of Monaco.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYyODM4NDU1MV5BMl5BanBnXkFtZTYwMjI1ODM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000026","name":"Cary Grant","idIMDB":"nm0000026"},"actorId":"nm0000026","character":"Lt. Cmdr. Matt T. Sherman","urlCharacter":"http://www.imdb.com/character/ch0025259","main":true},{"actorName":"Tony Curtis","urlProfile":"http://www.imdb.com/name/nm0000348","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTkwNTEyNF5BMl5BanBnXkFtZTYwNzAxNjI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 June 1925","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"Bernard Herschel Schwartz","height":"5' 9\" (1.75 m)","bio":"Tony Curtis was born Bernard Schwartz, the eldest of three children of Helen (Klein) and Emanuel Schwartz, Jewish immigrants from Hungary. Curtis himself admits that while he had almost no formal education, he was a student of the \"school of hard knocks\" and learned from a young age that the only person who ever had his back was himself, so he learned how to take care of both himself and younger brother, Julius. Curtis grew up in poverty, as his father, Emanuel, who worked as a tailor, had the sole responsibility of providing for his entire family on his meager income. This led to constant bickering between Curtis's parents over money, and Curtis began to go to movies as a way of briefly escaping the constant worries of poverty and other family problems. The financial strain of raising two children on a meager income became so tough that in 1935, Curtis's parents decided that their children would have a better life under the care of the state and briefly had Tony and his brother admitted to an orphanage. During this lonely time, the only companion Curtis had was his brother, Julius, and the two became inseparable as they struggled to get used to this new way of life. Weeks later, Curtis's parents came back to reclaim custody of Tony and his brother, but by then Curtis had learned one of life's toughest lessons: the only person you can count on is yourself. In 1938, shortly before Tony had his Bar Mitzvah, tragedy struck when Tony lost the person most important to him, when his brother, Julius, was hit by a truck and killed. After that tragedy, Curtis's parents became convinced that a formal education was the best way Tony could avoid the same never-knowing-where-your-next-meal-is-coming-from life that they had known. However, Tony rejected this because he felt that learning about literary classics and algebra wasn't going to advance him in life as much as some real hands-on life experience would. He was to find that real-life experience a few years later, when he enlisted in the navy in 1942. Tony spent the next three years getting the life experience he desired by doing everything from working as a crewman on a submarine to honing his future craft as an actor by performing as a sailor in a stage play at the Navy Signalman School in Illinois. In 1945, Curtis was honorably discharged from the navy, and when he realized that the GI Bill would allow him to go to acting school without paying for it, he now saw that his lifelong pipe dream of being an actor might actually be achievable. Curtis auditioned for the New York Dramatic Workshop, and after being accepted on the strength of his audition piece (A scene from \"Dr. Jekyll and Mr. Hyde\" in pantomime), Curtis enrolled in early 1947. He then began to pay his dues by appearing in a slew of stage productions, including \"Twelfth Night\" and \"Golden Boy\". He then connected with a small theatrical agent named Joyce Selznick, who was the niece of film producer David O. Selznick. After seeing his potential, Selznick arranged an interview for Curtis to see David O. Selznick at Universal Studios, where Curtis was offered a seven-year contract. After changing his name to what he saw as an elegant, mysterious moniker--\"Tony Curtis\" (named after the novel Anthony Adverse (1936) by Hervey Allen and a cousin of his named Janush Kertiz)--Curtis began making a name for himself by appearing in small, offbeat roles in small-budget productions. His first notable performance was a two-minute role in Criss Cross (1949), with Burt Lancaster, in which he makes Lancaster jealous by dancing with Yvonne De Carlo. This offbeat role resulted in Curtis's being typecast as a heavy for the next few years, such as playing a gang member in City Across the River (1949). Curtis continued to build up a show reel by accepting any paying job, acting in a number of bit-part roles for the next few years. It wasn't until late 1949 that he finally got the chance to demonstrate his acting flair, when he was cast in an important role in an action western, Sierra (1950). On the strength of his performance in that movie, Curtis was finally cast in a big-budget movie, Winchester '73 (1950). While he appears in that movie only very briefly, it was a chance for him to act alongside a Hollywood legend, James Stewart. As his career developed, Curtis wanted to act in movies that had social relevance, ones that would challenge audiences, so he began to appear in such movies as Spartacus (1960) and The Defiant Ones (1958). He was advised against appearing as the subordinate sidekick in Spartacus (1960), playing second fiddle to the equally famous Kirk Douglas. However, Curtis saw no problem with this because the two had recently acted together in dual leading roles in The Vikings (1958).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTkwNTEyNF5BMl5BanBnXkFtZTYwNzAxNjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000348","name":"Tony Curtis","nicknames":["Boinie"],"idIMDB":"nm0000348"},"actorId":"nm0000348","character":"Lt. JG Nicholas Holden","urlCharacter":"http://www.imdb.com/character/ch0116716","main":true},{"actorName":"Joan O'Brien","urlProfile":"http://www.imdb.com/name/nm0639613","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDlmZDk3MzQtZGUyZS00MTEyLTgzYzctZmQ5N2Q4NmYzMTk3XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 February 1936","placeOfBirth":" Cambridge, Massachusetts, USA","birthName":"Joan Marie O'Brien","height":"5' 4\" (1.63 m)","bio":"Joan O'Brien began her show-biz career while she was in high school, on a local TV music show in California with Tennessee Ernie Ford. Soon she was a successful singer, and made the jump to acting. In about half the films she ever made it appeared that Joan played a nurse. Perhaps her most memorable appearance was in Blake Edwards' Operation Petticoat (1959), as the nurse who gets in everyone's way because her, umm, \"proportions\" cause uncomfortable crowding in a small submarine. Because of her, Cary Grant becomes the first officer in the history of the U.S. Navy to sink an enemy truck! She again played a nurse in the Jerry Lewis film _It's Only Money (1963)_ and yet one more time with Elvis Presley in It Happened at the World's Fair (1963)--and, according to legend, fired up a hot off-screen romance with Elvis. Also in 1963, in a strange sort of \"Columbo\" connection, she was voted \"most likely to wed Robert Vaughn\". Joan's final movie was Get Yourself a College Girl (1964), a \"Swinging Sixties\" teenfest also featuring Nancy Sinatra, with music by The Animals and The Dave Clark Five. After that she went back to singing for a while, touring with the Harry James Orchestra. She left show business for good to concentrate on raising her kids, and later became a successful executive with the Hilton Hotel chain.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDlmZDk3MzQtZGUyZS00MTEyLTgzYzctZmQ5N2Q4NmYzMTk3XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0639613","name":"Joan O'Brien","idIMDB":"nm0639613"},"actorId":"nm0639613","character":"Lt. Dolores Crandall RN","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dina Merrill","urlProfile":"http://www.imdb.com/name/nm0581277","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NjY3OTU0NV5BMl5BanBnXkFtZTYwODc3ODI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1923","placeOfBirth":" New York City, New York, USA","birthName":"Nedenia Marjorie Hutton","bio":"It would have been pretty darn difficult for actress Dina Merrill to have ever pulled off playing a commoner on stage, film or TV. She just had too much class. The epitome of poise and glamor, the New York-born socialite and celebrity was born in 1923 the daughter of financier E.F. Hutton, the founder of the Wall Street firm, and heiress Marjorie Merriweather Post of the Post cereal fortune. Although Dina has made elaborate use of her silver spoon privilege over the many decades, she has handled it all positively and graciously, and without tabloid incident. Instilling these same refined credentials into her femme characters, she originally did not intend to pursue acting. Studying at George Washington University, she suddenly dropped out after only a year (to the chagrin of her disapproving parents) after sensing a strong desire to perform. Enrolling at the American Academy of Dramatic Arts, she apprenticed in summer stock in the early 1940s before reaching the Broadway boards with \"The Mermaids Singing\" (1945). After nearly a decade of theater roles and taking some time off to raise two children (her first husband was Stanley Rumbough, Jr., an heir to the Colgate toothpaste fortune), Dina finally made her official film debut with a smart and stylish support role in the Spencer Tracy / Katharine Hepburn vehicle Desk Set (1957). With charm to spare, she continued in her same upper-crust vein playing some version of the model wife, or socialite maven in her many posh but hardly challenging outings. Some of Dina's more noticeable roles came with Operation Petticoat (1959) with the equally classy Cary Grant, BUtterfield 8 (1960), starring Elizabeth Taylor and Laurence Harvey, and The Young Savages (1961) opposite Burt Lancaster. Following her divorce to Rumbough after 20 years, she married handsome actor Cliff Robertson in 1966. The pair had one daughter and were a popular Hollywood fixture for nearly 20 years before they, too, ended up in the divorce courts. With her film career on the wane, Dina gravitated toward the usual TV guest spots, and went on to co-star on Broadway with the drama \"Angel Street\" (1975) and the revamped musical \"On Your Toes\" (1983). In 1989 Dina married actor and investment banker Ted Hartley. Together they bought RKO Studios and renamed it RKO Pavilion. He serves as chairman while she is a vice chairperson and creative director. The studio produced such popular efforts as Milk & Money (1996) and the remake of Mighty Joe Young (1998). Admired for her tireless philanthropic contributions, she is a moderate Republican (vice chair of the Republican Pro-Choice Coalition)and an active lobbyist for women's health issues. She has also devoted much of her time working for the disadvantaged, particularly for the New York City Mission Society. Still active, an avid tennis and golf player as she approaches age 90, the ever-glamorous Dina appeared most recently in a summer stock production of \"Only a Kingdom\" (2004) and continues to appear in occasional movie and television productions.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NjY3OTU0NV5BMl5BanBnXkFtZTYwODc3ODI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0581277","name":"Dina Merrill","nicknames":["Deenie"],"idIMDB":"nm0581277"},"actorId":"nm0581277","character":"Lt. Barbara Duran RN","urlCharacter":"http://www.imdb.com/character/ch0227162","main":true},{"actorName":"Gene Evans","urlProfile":"http://www.imdb.com/name/nm0262775","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjI5MjUyYzktYjY2YS00MzIyLTlkMDItMzFmMzRkN2FlYjEzXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1922","placeOfBirth":" Holbrook, Arizona, USA","birthName":"Eugene Barton Evans","height":"6' 1½\" (1.87 m)","bio":"Gene Evans was born in Holbrook, Arizona, on July 11, 1922, and was raised in Colton, California. He served in the Army during World War II as a combat engineer, and was awarded the Purple Heart and the Bronze Star for bravery in action. He began his acting career there, performing in a theatrical troupe of GIs in Europe. After the war, he went to Hollywood, where he made his film debut in 1947's Under Colorado Skies (1947). The rugged, red-headed character actor was a familiar face in such westerns as Cattle Queen of Montana (1954), The War Wagon (1967), Support Your Local Sheriff! (1969), The Ballad of Cable Hogue (1970) and Pat Garrett & Billy the Kid (1973). He also starred in the war films The Steel Helmet (1951) and Fixed Bayonets! (1951) and co-starred with future first lady Nancy Reagan (before she became Nancy Reagan) in Donovan's Brain (1953). His other major films include Park Row (1952), The Giant Behemoth (1959), Operation Petticoat (1959) and Walking Tall (1973). He became well known in the 1950s on television, playing the father in My Friend Flicka (1955). He remained active in films and television through the 1980s. Evans subsequently retired to a farm near Jackson, Tennessee. He was a popular guest at the Memphis Film Festival for the past decade.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjI5MjUyYzktYjY2YS00MzIyLTlkMDItMzFmMzRkN2FlYjEzXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0262775","name":"Gene Evans","idIMDB":"nm0262775"},"actorId":"nm0262775","character":"Chief Molumphry","urlCharacter":"http://www.imdb.com/character/ch0227163","main":true},{"actorName":"Dick Sargent","urlProfile":"http://www.imdb.com/name/nm0765102","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMDg4NjUwMV5BMl5BanBnXkFtZTcwMjE0MjY5Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 April 1930","placeOfBirth":" Carmel, California, USA","birthName":"Richard Stanford Cox","height":"6' 2\" (1.88 m)","bio":"Sargent was a trim, handsome man with a longish chin. He played a variety of gawky businessmen roles in feature films before finding a niche in tv history as the second Darrin on \"Bewitched\". Shortly before his death, Sargent publicly proclaimed he was gay, and became what he called \"a retroactive role model\" in the battle for gay rights.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMDg4NjUwMV5BMl5BanBnXkFtZTcwMjE0MjY5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0765102","name":"Dick Sargent","idIMDB":"nm0765102"},"actorId":"nm0765102","character":"Ens. Stovall","urlCharacter":"http://www.imdb.com/character/ch0227167","main":true},{"actorName":"Virginia Gregg","urlProfile":"http://www.imdb.com/name/nm0339615","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyNjA1NjgwMDJeQTJeQWpwZ15BbWU3MDIwNTU4MTg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1916","placeOfBirth":" Harrisburg, Illinois, USA","height":"5' 9\" (1.75 m)","bio":"Virginia Gregg was born on March 6, 1916 in Harrisburg, Illinois, USA. She was an actress, known for Operation Petticoat (1959), Love Is a Many-Splendored Thing (1955) and Calvin and the Colonel (1961). She was married to Jaime Del Valle. She died on September 15, 1986 in Encino, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyNjA1NjgwMDJeQTJeQWpwZ15BbWU3MDIwNTU4MTg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0339615","name":"Virginia Gregg","idIMDB":"nm0339615"},"actorId":"nm0339615","character":"Maj. Edna Heywood RN","urlCharacter":"http://www.imdb.com/character/ch0227180","main":true},{"actorName":"Robert F. Simon","urlProfile":"http://www.imdb.com/name/nm0800359","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMzg0NTI0Ml5BMl5BanBnXkFtZTgwODQ5MDgzMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 December 1908","placeOfBirth":" Mansfield, Ohio, USA","height":"5' 11\" (1.8 m)","bio":"A prolific character actor of tall, imposing presence, Robert F. Simon drifted into acting via the Cleveland Playhouse, hoping that this would cure his natural propensity for shyness. After training at the Actor's Studio in New York, he had a ten year run on Broadway (1942-52), in which he cut his teeth, both as actor and as stage manager, on anything from drama to musical comedy. In a roundabout way, he was even able to fulfill his original career goal of becoming a traveling salesman -- as understudy to the great Lee J. Cobb in the role of Willy Loman, in Arthur Miller's \"Death of a Salesman\". Robert started in films in 1950, but over the years was often typecast in stereotypical roles of benevolent authoritarianism or grouchy executive stress, at times drawing unkind reviews from the critics. He was considerably better served by the small screen, where, for some 35 years, he became a familiar face as generals, police captains, doctors, journalists and attorneys. He is, perhaps, most fondly remembered as George Armstrong Custer's disapproving superior, General Alfred Terry, in Custer (1967); as the sympathetic, long-suffering father of Darren Stephens in Bewitched (1964); and as Maynard M. Mitchell, one of the wackiest of generals ever to have served in the Korean War (or any other war, for that matter), in M*A*S*H (1972).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMzg0NTI0Ml5BMl5BanBnXkFtZTgwODQ5MDgzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0800359","name":"Robert F. Simon","idIMDB":"nm0800359"},"actorId":"nm0800359","character":"Capt. J.B. Henderson","urlCharacter":"http://www.imdb.com/character/ch0025261","main":true},{"actorName":"Robert Gist","urlProfile":"http://www.imdb.com/name/nm0321143","urlPhoto":"","biography":{"dateOfBirth":"1 October 1917","placeOfBirth":" Chicago, Illinois, USA","birthName":"Robert Marion Gist","bio":"Robert Gist was a tough kid who grew up around the Chicago stockyards during the Depression. Reform school-bound after injuring another boy in a fistfight, Gist instead ended up in Chicago's Hull House, a settlement house where he first became interested in acting. Work in Chicago radio was followed by stage acting roles in Chicago and on Broadway (in the long-running \"Harvey\" with Josephine Hull). While acting in \"Harvey\", he made his film debut in New York-shot scenes for 20th Century-Fox's Christmas classic Miracle on 34th Street (1947). Gist was also seen on Broadway in director Charles Laughton's \"The Caine Mutiny Court Martial\" (1954) with Henry Fonda and John Hodiak. While shooting Operation Petticoat (1959) in Key West, Florida, Gist told director Blake Edwards that he was interested in directing; Edwards later hired him to helm episodes of the TV series Peter Gunn (1958). Gist has also directed for TV's Naked City (1958), The Twilight Zone (1959), Route 66 (1960) and many others.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0321143","name":"Robert Gist","idIMDB":"nm0321143"},"actorId":"nm0321143","character":"Lt. Watson","urlCharacter":"http://www.imdb.com/character/ch0025262","main":true},{"actorName":"Gavin MacLeod","urlProfile":"http://www.imdb.com/name/nm0533891","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMzI5MTM5OF5BMl5BanBnXkFtZTYwNTU4OTM2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 February 1931","placeOfBirth":" Mount Kisco, New York, USA","birthName":"Allan George See","height":"5' 11\" (1.8 m)","bio":"Gavin MacLeod was raised in Pleasantville, New York, the son of a gas station owner who was part Chippewa Indian (Ojibwa). He followed his 1952 graduation from Ithaca College with military service, then moved to New York City and worked for a while as an usher and elevator operator at Radio City Music Hall. A solid break on Broadway in \"A Hatful of Rain\" in 1956, led him to move to Los Angeles to attempt film and TV. For awhile he earned a minor reputation as a second-string heavy in crime stories. His career more or less flowed and ebbed with these minor dramatic roles until 1972, when his typecast as a shady, dangerous character was shattered forever. As Murray Slaughter, the balding, beaming, gleamy-toothed newswriter on Mary Tyler Moore (1970) wisecracking, humble and un-hip to a fault, Gavin (and Murray) became friendly household names in the 70s. From then on, he could only be envisaged as a loveable schmuck and nice guy. This image was later cast in stone with the enduring success of another TV series, The Love Boat (1977), in his role as the ingratiating Captain Stubing. On the down side, \"Love Boat\" marred his chances to be considered for more challenging work, and his inability to cope with success led to alcoholism and divorce from second wife Patti. However, he later turned his life around, remarried his wife, and wrote a biography called \"Back on Course.\" Today he appears occasionally on the summer stock/dinner theater stage and as a guest performer on TV.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMzI5MTM5OF5BMl5BanBnXkFtZTYwNTU4OTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0533891","name":"Gavin MacLeod","idIMDB":"nm0533891"},"actorId":"nm0533891","character":"Ernest Hunkle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Dunn","urlProfile":"http://www.imdb.com/name/nm0242574","urlPhoto":"","biography":{"dateOfBirth":"23 November 1914","placeOfBirth":" Texas, USA","birthName":"Ollen George Dunn","height":"6' (1.83 m)","bio":"George Dunn was born on November 23, 1914 in Texas, USA as Ollen George Dunn. He was an actor, known for A Woman Under the Influence (1974), Operation Petticoat (1959) and The Beguiled (1971). He died on April 27, 1982 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0242574","name":"George Dunn","idIMDB":"nm0242574"},"actorId":"nm0242574","character":"The Prophet","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dick Crockett","urlProfile":"http://www.imdb.com/name/nm0188398","urlPhoto":"","biography":{"dateOfBirth":"27 February 1915","placeOfBirth":" Maywood, Illinois, USA","birthName":"Richard DeHart Crockett","bio":"Dick Crockett was born on February 27, 1915 in Maywood, Illinois, USA as Richard DeHart Crockett. He is known for his work on The Pink Panther Strikes Again (1976), The Party (1968) and Peter Gunn (1958). He died on January 25, 1979 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0188398","name":"Dick Crockett","idIMDB":"nm0188398"},"actorId":"nm0188398","character":"Harmon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Madlyn Rhue","urlProfile":"http://www.imdb.com/name/nm0722599","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNjAxNjM5OF5BMl5BanBnXkFtZTgwNDQ4OTg0MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1935","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Madeline Solomon","bio":"American character actress Madlyn Rhue was one of television's most prolific actresses and has starred in everything from sitcoms to soap operas to drama series and films for nearly 40 years. Her beautiful looks, black/dark brown hair and hazel eyes got her the attention of television producers and she found herself guest starring on such series as Rawhide (1959), Cheyenne (1955), Star Trek (1966), Hawaii Five-O (1968), Charlie's Angels (1976) and Fantasy Island (1977). She did a few theatrical motion pictures, most notably Operation Petticoat (1959), He Rides Tall (1964), Kenner (1968) and It's a Mad Mad Mad Mad World (1963). In 1977 she was diagnosed with multiple sclerosis, which she battled for nearly 25 years. However, the disease never got her down; she continued to work in numerous television films and was co-starring on such series and soap operas as Executive Suite (1976), Fame (1982) and Days of Our Lives (1965) and had a recurring role on Murder, She Wrote (1984). By 1997, Rhue was unable to work, and she spent her last years at the Motion Picture and Television Country Home retirement center in Woodland Hills, California. She passed away from pneumonia and multiple sclerosis there at age 68 on December 16, 2003.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNjAxNjM5OF5BMl5BanBnXkFtZTgwNDQ4OTg0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0722599","name":"Madlyn Rhue","idIMDB":"nm0722599"},"actorId":"nm0722599","character":"Lt. Reid RN","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marion Ross","urlProfile":"http://www.imdb.com/name/nm0005385","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTU1MDM4N15BMl5BanBnXkFtZTYwNzU3MTU0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 October 1928","placeOfBirth":" Albert Lea, Minnesota, USA","birthName":"Marian Ellen Ross","height":"5' 5\" (1.65 m)","bio":"The lovely, continuously upbeat and iconic All-American mom from the classic Happy Days (1974) TV sitcom had fervent desires of becoming an actress while growing up in her obscure Minnesota town. Born Marian Ross (with an \"a\") in 1928, she grew up in her native state and, at one time, worked as a teenage au pair in order to earn money for drama lessons at the MacPhail Center in Minneapolis. The family eventually relocated to San Diego (she was in her late teens) and Marion attended and graduated from Point Loma High School. Changing her stage moniker to Marion (with an \"o\") Ross because it read classier to her, the young hopeful enrolled at San Diego University and appeared in the theater department's various productions. Graduating in 1950, Marion worked in summer theater in and around the San Diego area, including the Old Globe Theatre. She then managed to land a Paramount Studio contract with the assist of an old college professor and found a few unbilled parts to play as various actress, tourist and girlfriend types in a variety of films such as The Glenn Miller Story (1954), Secret of the Incas (1954), Sabrina (1954) and Pushover (1954). At the same time, she won a regular role as the Irish maid \"Nora\" in the Victorian-TV comedy Life with Father (1953) which ran a couple of seasons and was headed by Leon Ames and Lurene Tuttle. This program happened to be the first live color series for network Hollywood TV. Not your conventional leading lady type, Marion landed slightly larger parts in such movies as The Proud and Profane (1956), Lizzie (1957), Teacher's Pet (1958) and Operation Petticoat (1959), but any and all attempts to move further up the Hollywood film ladder proved a long-lasting frustration. Marking her Broadway debut in 1958 with a role in \"Edwin Booth\" starring José Ferrer, Marion nevertheless continued to focus on TV work. Throughout the 1960s, she appeared in a fairly steady amount of shows, both comedies and dramas, including Father Knows Best (1954), Rawhide (1959), Route 66 (1960), The Outer Limits (1963), The Felony Squad (1966) and The Brady Bunch (1969). By the end of the decade, however, she was still disillusioned, but now she was divorced from her husband of 18 years, Freeman Meskimen, and struggling to raise two children. Middle-aged stardom came to her (in her 46th year) with the nostalgic sitcom series Happy Days (1974), which arrived on a wave of 50s popularity triggered by the huge box-office reception to the film American Graffiti (1973). The show starred \"Graffiti\" lead Ron Howard and co-starred Henry Winkler as \"The Fonz\". Marion was ideally paired with Tom Bosley, who expertly played her beleaguered hubby. The series became a certifiable hit and Marion's ever-pleasant \"Marion Cunningham\" the new, slightly blended version of Lucille Ball's ditzy and Barbara Billingsley's pristine perfect moms. Two Emmy nominations came Marion's way during the show's long tenure (ten seasons). Following the demise of such an exalting hit, many actors often find themselves either resting on their laurels or witnessing a sad decline in their career. Not Marion. She continued to pursue her career assertively and challengingly and the critics kept taking notice. She earned terrific reviews for her recurring The Love Boat (1977) role in 1986, and enjoyed standard guest turns on Night Court (1984), MacGyver (1985), Burke's Law (1963) and (the revived) \"Superman\". One of Marion's finest hours on TV occurred with her role as the obstinate, iron-willed Jewish matriarch in the Brooklyn Bridge (1991) series, which neatly deflected any broad, daffy stereotype she might have incurred from her Happy Days (1974) role. Irritating yet ingratiating at the same time, Marion's fine interpretation garnered the veteran actress two more Emmy nominations. Sadly, a lack of viewership triggered an abrupt cancellation and deep disappointment in Marion. While never making a strong dent in films, an excellent supporting turn for Marion came in the form of her moving portrayal of Shirley MacLaine's loyal housekeeper and confidante in The Evening Star (1996), the long-awaited sequel to the Oscar-winning Terms of Endearment (1983). Critics predicted an Academy Award nomination for the actress but, surprisingly, it did not pan out. Other films over the years have included Colossus: The Forbin Project (1970); Grand Theft Auto (1977), which starred Happy Days (1974) son Ron Howard (who also made his directorial debut); and, more recently, Music Within (2007) and the silly spoof Superhero Movie (2008). In her post-\"Happy Days\" years, Marion reinvigorated her career on the stage. As a result, she earned renewed acclaim and respect for her roles in \"Arsenic and Old Lace\" (which brought her back to Broadway), \"Steel Magnolias\", \"Long Day's Journey Into Night\", \"The Glass Menagerie\", \"Pippin\" and \"Barefoot in the Park\", among others. She also toured with her one-woman show as poet Edna St. Vincent Millay entitled \"A Lovely Light\". On TV, Marion found recurring flinty-like roles on Touched by an Angel (1994) (a fifth Emmy nomination), That '70s Show (1998), The Drew Carey Show (1995), Gilmore Girls (2000) and Brothers & Sisters (2006) and also provided a voice in the cartoon \"Spongebob Squarepants\" as Spongebob's grandmother. The ever-vital copper-haired octogenarian continues to reside at her country-style home she calls the \"Happy Days Farm\" in California's San Fernando Valley.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTU1MDM4N15BMl5BanBnXkFtZTYwNzU3MTU0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005385","name":"Marion Ross","idIMDB":"nm0005385"},"actorId":"nm0005385","character":"Lt. Colfax RN","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clarence Lung","urlProfile":"http://www.imdb.com/name/nm0526693","urlPhoto":"","biography":{"dateOfBirth":"20 October 1914","placeOfBirth":" Boise, Idaho, USA","birthName":"Clarence E. Lung","bio":"Clarence Lung was born on October 20, 1914 in Boise, Idaho, USA as Clarence E. Lung. He was an actor, known for Operation Petticoat (1959), Dragon Seed (1944) and First Yank Into Tokyo (1945). He died on October 15, 1993 in Quitman, Texas, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0526693","name":"Clarence Lung","idIMDB":"nm0526693"},"actorId":"nm0526693","character":"Sgt. Ramon Gillardo","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0053143","urlIMDB":"http://www.imdb.com/title/tt0053143","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"$6,800,000 (USA)","country":"","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 4 min (124 min)","1 hr 40 min (100 min) (Germany)","1 hr 57 min (117 min) (Portugal)","2 hr (120 min) (Ontario) (Canada)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Color (Eastman Color)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Pathé Laboratories, USA (Eastman Color by) (as Pathe)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.3","filmingLocations":[{"location":"Naval Base San Diego, San Diego, California, USA"}],"rated":"APPROVED","awards":[{"award":"Academy Awards, USA 1960","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Writing, Story and Screenplay - Written Directly for the Screen","names":[{"name":"Paul King","id":"nm0455126","role":"story"},{"name":"Joseph Stone","id":"nm0831972","role":"story"},{"name":"Stanley Shapiro","id":"nm0788630","role":"screenplay"},{"name":"Maurice Richlin","id":"nm0725009","role":"screenplay"}]}]}]},{"award":"Golden Globes, USA 1960","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Motion Picture - Comedy","names":[]},{"category":"Best Actor - Comedy or Musical","names":[{"name":"Cary Grant","id":"nm0000026","role":null}]}]}]},{"award":"Laurel Awards 1960","titlesAwards":[{"titleAwardOutcome":"Won Golden Laurel","categories":[{"category":"Top Male Comedy Performance","names":[{"name":"Cary Grant","id":"nm0000026","role":null}]}]},{"titleAwardOutcome":"2nd place Golden Laurel","categories":[{"category":"Top Comedy","names":[]}]}]},{"award":"Writers Guild of America, USA 1960","titlesAwards":[{"titleAwardOutcome":"Nominated WGA Award (Screen)","categories":[{"category":"Best Written American Comedy","names":[{"name":"Stanley Shapiro","id":"nm0788630","role":null},{"name":"Maurice Richlin","id":"nm0725009","role":null}]}]}]}],"votes":"9,758","type":"Movie","companyCreditsSimple":[{"idCompany":"co0021358","name":"Universal International Pictures (UI)"},{"idCompany":"co0023441","name":"Granart Company"}],"keywords":{"keywords":["submarine","army nurse","nurse","woman in military","repairing boat","supply officer","pacific war","junker submarine","u.s. navy","world war two","navy submarine","submarine crew","submarine captain","pig imitation","pink submarine","woman","lieutenant commander","shipyard","number 393","bus","station wagon","automobile","admiral","grappling hook","mechanic","girdle","american flag","torpedo room","crying baby","number 568","destroyer","submarine submerging","guitar","naval ship","goat","air raid siren","beach","life raft","year 1942","radio broadcast","accident prone","curling iron","reference to las vegas","captain's journal","banana","pants","socks","cigarette lighter","white shoes","golf bag","golf club","farmer","tennis racket","corporal","roadblock","stealing a pig","pig pen","two word title","military salute","casino dealer","pickup truck","red paint","white paint","female nurse","army major","female lieutenant","army lieutenant","army jeep","man wearing glasses","engine room","tattooed man","champagne bottle","superstitious sailor","island","cheering","superstitious man","blonde woman","clumsy woman","buxom woman","navy lieutenant","major","binoculars","view through binoculars","bare chested male","morale officer","underwater sequence","depth guage","camouflage netting","army truck","reference to west point","u.s. marine","military truck","aerial attack","prisoner","military jeep","steering wheel","reference to winston churchill","military police","sergeant","lieutenant","letter p","view through periscope","submarine movie","catching a pig","pig farmer","new year's day","reference to tokyo rose","paint can","female army officer","philippines","repair","repairing equipment","engine repair","pig","cebu philippines","pacific ocean","logbook","told in flashback","year 1941","woman in man's clothes","naval officer","naval uniform","military spoof","woman on shipful of sailors","w.a.c. nurse","theft","suggestive situation","sexual innuendo","sailor woman relationship","red tape","procurement","pacific theater","misfired torpedo","military prisoner","military comradeship","military","jerry rigging","hustling","girdle as repair part","friendly fire","double entendre","depth charge","dandy in uniform","comedy of errors","backfire","air raid","clumsiness","truck","torpedo","bra","witch doctor","tattoo","ship sinking","scavenger","oddball","klutz","casino","u boat","blockbuster","the color pink","navy"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 16:11:14"}}