{"data":{"movies":[{"title":"The Good, the Bad and the Ugly","originalTitle":"Il buono, il brutto, il cattivo","year":"1966","releaseDate":"19671229","directors":[{"name":"Sergio Leone","id":"nm0001466"}],"writers":[{"name":"Luciano Vincenzoni","id":"nm0898812"},{"name":"Sergio Leone","id":"nm0001466"}],"runtime":"161 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ5NDI3MTI4MF5BMl5BanBnXkFtZTgwNDQ4ODE5MDE@._V1.jpg","countries":["Italy","Spain","West Germany","USA"],"languages":["Italian"],"genres":["Western"],"plot":"Blondie (The Good) is a professional gunslinger who is out trying to earn a few dollars. Angel Eyes (The Bad) is a hit man who always commits to a task and sees it through, as long as he is paid to do so. And Tuco (The Ugly) is a wanted outlaw trying to take care of his own hide. Tuco and Blondie share a partnership together making money off Tuco's bounty, but when Blondie unties the partnership, Tuco tries to hunt down Blondie. When Blondie and Tuco come across a horse carriage loaded with dead bodies, they soon learn from the only survivor (Bill Carson) that he and a few other men have buried a stash of gold in a cemetery. Unfortunately Carson dies and Tuco only finds out the name of the cemetery, while Blondie finds out the name on the grave. Now the two must keep each other alive in order to find the gold. Angel Eyes (who had been looking for Bill Carson) discovers that Tuco and Blondie met with Carson and knows they know the location of the gold. All he needs is for the two to ...","simplePlot":"A bounty hunting scam joins two men in an uneasy alliance against a third in a race to find a fortune in gold buried in a remote cemetery.","actors":[{"actorName":"Eli Wallach","urlProfile":"http://www.imdb.com/name/nm0908919","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4OTM3ODQ5MF5BMl5BanBnXkFtZTgwMzE3OTcwMjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 December 1915","placeOfBirth":" Red Hook, Brooklyn, New York City, New York, USA","birthName":"Eli Herschel Wallach","height":"5' 10\" (1.78 m)","bio":"One of Hollywood's finest character / \"Method\" actors, Eli Wallach was in demand for over 60 years (first film/TV role was 1949) on stage and screen, and has worked alongside the world's biggest stars, including Clark Gable, Clint Eastwood, Steve McQueen, Marilyn Monroe, Yul Brynner, Peter O'Toole, and Al Pacino, to name but a few. Wallach was born on 7 December 1915 in Brooklyn, NY, to Jewish parents who emigrated from Poland, and was one of the few Jewish kids in his mostly Italian neighborhood. His parents, Bertha (Schorr) and Abraham Wallach, owned a candy store, Bertha's Candy Store. He went on to graduate with a B.A. from the University of Texas in Austin, but gained his dramatic training with the Actors Studio and the Neighborhood Playhouse. He made his debut on Broadway in 1945, and won a Tony Award in 1951 for portraying Alvaro Mangiacavallo in the Tennessee Williams play \"The Rose Tattoo\". Wallach made a strong screen debut in 1956 in the film version of the Tennessee Williams play Baby Doll (1956), shined as \"Dancer\", the nattily dressed hitman, in director Don Siegel's film-noir classic The Lineup (1958), and co-starred in the heist film Seven Thieves (1960). Director John Sturges then cast Wallach as vicious Mexican bandit Calvera in The Magnificent Seven (1960), the western adaptation of the Akira Kurosawa epic Seven Samurai (1954). By all reports, Wallach could not ride a horse prior to making \"TMS\", but expert tutelage from the film's Mexican stunt riders made it look easy! He next appeared in the superb The Misfits (1961), in the star-spangled western opus How the West Was Won (1962), the underrated WW2 film The Victors (1963), as a kidnapper in The Moon-Spinners (1964), in the sea epic Lord Jim (1965) and in the romantic comedy How to Steal a Million (1966). Looking for a third lead actor in the final episode of the \"Dollars Trilogy\", Italian director Sergio Leone cast the versatile Wallach as the lying, two-faced, money-hungry (but somehow lovable) bandit \"Tuco\" in the spectacular The Good, the Bad and the Ugly (1966) (aka \"The Good, The Bad and The Ugly\"), arguably his most memorable performance. Wallach kept busy throughout the remainder of the '60s and into the '70s with good roles in Mackenna's Gold (1969), Cinderella Liberty (1973), Jo le fou (1974), The Deep (1977) and as Steve McQueen's bail buddy in The Hunter (1980). The 1980s was an interesting period for Wallach, as he was regularly cast as an aging doctor, a Mafia figure or an over-the-hill hitman, such as in The Executioner's Song (1982), Our Family Honor (1985), Tough Guys (1986), Nuts (1987), The Two Jakes (1990) and as the candy-addicted \"Don Altabello\" in The Godfather: Part III (1990). At 75+ years of age, Wallach's quality of work was still first class and into the 1990s and beyond, he has remained in demand. He lent fine support to Bride of Violence (1990), Teamster Boss: The Jackie Presser Story (1992), Naked City: Justice with a Bullet (1998) and Keeping the Faith (2000). Most recently Wallach showed up as a fast-talking liquor store owner in Mystic River (2003) and in the comedic drama King of the Corner (2004). In early 2005, Eli Wallach released his much anticipated autobiography, \"The Good, The Bad And Me: In My Anecdotage\", an enjoyable reading from one of the screen's most inventive and enduring actors. Eli Wallach was very much a family man who remained married to his wife Anne Jackson for 66 years. When Wallach died at 98, in 2014, in Manhattan, NY, he was survived by his wife, three children, five grandchildren and several great-grandchildren.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4OTM3ODQ5MF5BMl5BanBnXkFtZTgwMzE3OTcwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0908919","name":"Eli Wallach","idIMDB":"nm0908919"},"actorId":"nm0908919","character":"Tuco","urlCharacter":"http://www.imdb.com/character/ch0002057","main":true},{"actorName":"Clint Eastwood","urlProfile":"http://www.imdb.com/name/nm0000142","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDc0MjY0OV5BMl5BanBnXkFtZTcwNzU1MDAxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1930","placeOfBirth":" San Francisco, California, USA","birthName":"Clinton Eastwood Jr.","height":"6' 4\" (1.93 m)","bio":"Perhaps the icon of macho movie stars, and a living legend, Clint Eastwood has become a standard in international cinema. Born May 31, 1930 in San Francisco, the elder of two children in a middle-class family, Eastwood stayed in high school until the comparatively late age of nineteen and worked menial jobs over a period of several years before enrolling at Los Angeles City College, from which he dropped out after two semesters to pursue acting. He found uncredited bit parts in such nondescript B-films as Revenge of the Creature (1955) and Tarantula (1955) during the mid-'50s while simultaneously digging swimming pools for a living, until he got his first breakthrough in the long-running TV series Rawhide (1959) with Eric Fleming. Though only a secondary player in the early seasons, Clint made the show his own by end of its run and became a recognizable face to television viewers around the country. Eastwood found much bigger and better things in Italy with the excellent spaghetti westerns A Fistful of Dollars (1964) and For a Few Dollars More (1965). But it was the third installment in the trilogy where he found one of his signature roles: The Good, the Bad and the Ugly (1966). The movie was a big hit and he became an instant international star. Clint's first American-made western, Hang 'Em High (1968), was yet again a success, and he followed it up with another starring role in Coogan's Bluff (1968) (the loose inspiration to the TV series McCloud (1970)) before playing second fiddle to Richard Burton in the World War II epic Where Eagles Dare (1968) and Lee Marvin in the bizarre musical Paint Your Wagon (1969). In Sierra torride (1970) and Kelly's Heroes (1970), Eastwood went in an experimental direction by combining tough-guy action with offbeat humor. 1971 proved to be one of his best years in film, if not the best. He starred in The Beguiled (1971) and the classic thriller Play Misty for Me (1971), but it was his role as the hard edge police inspector in Dirty Harry (1971) that gave Eastwood one of his signature roles and invented the loose-cannon cop genre that has been imitated even to this day. Eastwood did a fairly consistent quality of work thereafter with the road movies Thunderbolt and Lightfoot (1974) and The Gauntlet (1977), the Dirty Harry sequels Magnum Force (1973) and The Enforcer (1976), the westerns Joe Kidd (1972), High Plains Drifter (1973) and The Outlaw Josey Wales (1976) (his first of six onscreen collaborations with then live-in love Sondra Locke), and the fact-based thriller Escape from Alcatraz (1979). In 1978 he branched out into the comedy genre in Every Which Way But Loose (1978), which became the biggest hit of his career up to that time; taking inflation into account, it still is. In short, notwithstanding The Eiger Sanction (1975), the '70s were an uninterrupted continuation of success. Eastwood kicked off the '80s with Any Which Way You Can (1980), the blockbuster sequel to Every Which Way But Loose. The fourth Dirty Harry film, Sudden Impact (1983), was the highest-grossing film of the franchise and spawned the character's trademark catchphrase, \"Make my day\". Clint also starred in Bronco Billy (1980), Firefox (1982), Tightrope (1984), City Heat (1984), Pale Rider (1985) and Heartbreak Ridge (1986), all of which were solid hits, with Honkytonk Man (1982) being his only commercial failure of the period. In 1988 he did his fifth and final Dirty Harry movie, The Dead Pool (1988). Although it was a success overall, it did not have the box office punch the previous films had. About this time, with outright bombs like Pink Cadillac (1989) and The Rookie (1990), it became apparent that Eastwood's star was declining as it never had before. He then started taking on more personal projects, such as directing Bird (1988), a biopic of Charlie Parker, and starring in and directing White Hunter Black Heart (1990), an uneven, loose biopic of John Huston. Eastwood bounced back in a big way with his western Unforgiven (1992), which garnered the then 62-year-old his first ever Academy Award nomination (Best Actor) and win for Best Director. Following up with a quick hit, he took on the secret service in In the Line of Fire (1993), then accepted second billing to Kevin Costner in the interesting but poorly received drama A Perfect World (1993). Next up was a love story, The Bridges of Madison County (1995), where Clint surprised audiences with a sensitive performance, but it soon became apparent he was going backwards after his brief revival. Subsequent films were credible, but nothing really stuck out. Among them were the moderately well-received Absolute Power (1997) and Space Cowboys (2000) as well as the badly received True Crime (1999) and Blood Work (2002). But Eastwood surprised yet again, returning to the top of the A-list with the hugely successful boxing drama Million Dollar Baby (2004). The movie earned him an Oscar for Best Director and a Best Actor nomination for the second time. Behind the camera, he had big successes directing the multi-award-winners Mystic River (2003), Flags of Our Fathers (2006), Letters from Iwo Jima (2006) and Changeling (2008) which starred Angelina Jolie. His next starring vehicle, Gran Torino (2008), earned $30 million in its opening weekend, proving his box office appeal has not waned. Eastwood has managed to keep his extremely convoluted personal life top secret and never discusses his families with the media. He had a long time relationship with frequent co-star Locke and has at least eight children by at least six other women, although he has only been married twice. Clint Eastwood lives in Los Angeles and owns homes in Monterey, Northern California, Idaho and Hawaii.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDc0MjY0OV5BMl5BanBnXkFtZTcwNzU1MDAxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000142","name":"Clint Eastwood","idIMDB":"nm0000142"},"actorId":"nm0000142","character":"Blondie","urlCharacter":"http://www.imdb.com/character/ch0038741","main":true},{"actorName":"Lee Van Cleef","urlProfile":"http://www.imdb.com/name/nm0001812","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0ODU1NjY5N15BMl5BanBnXkFtZTcwNTI0NzEyMw@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 January 1925","placeOfBirth":" Somerville, New Jersey, USA","birthName":"Clarence Leroy Van Cleef Jr.","height":"6' 2\" (1.88 m)","bio":"One of the great movie villains, Clarence Leroy Van Cleef, Jr. was born in Somerville, New Jersey, to Marion Lavinia (Van Fleet) and Clarence LeRoy Van Cleef, Sr. His parents were both of Dutch ancestry. Van Cleef started out as an accountant. He served in the U.S. Navy aboard minesweepers and subchasers during World War II. After the war he worked as an office administrator, becoming involved in amateur theatrics in his spare time. An audition for a professional role led to a touring company job in \"Mr. Roberts\". His performance was seen by Stanley Kramer, who cast him as henchman Jack Colby in High Noon (1952), a role that brought him great recognition despite the fact that he had no dialogue. For the next decade he played a string of memorably villainous characters, primarily in westerns but also in crime dramas such as The Big Combo (1955). His hawk nose and steely, slit eyes seemed destined to keep him always in the realm of heavies, but in the mid-Sergio Leone cast him as the tough but decent Col. Mortimer opposite Clint Eastwood in For a Few Dollars More (1965). A new career as a western hero (or at least anti-hero) opened up, and Van Cleef became an international star, though in films of decreasing quality. In the 1980s he moved easily into action and martial-arts movies, and starred in The Master (1984), a TV series featuring almost non-stop martial arts action. He died of a heart attack in December 1989, and was buried at Forest Lawn in the Hollywood Hills.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0ODU1NjY5N15BMl5BanBnXkFtZTcwNTI0NzEyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001812","name":"Lee Van Cleef","idIMDB":"nm0001812"},"actorId":"nm0001812","character":"Sentenza / Angel Eyes","urlCharacter":"http://www.imdb.com/character/ch0028251","main":true},{"actorName":"Aldo Giuffrè","urlProfile":"http://www.imdb.com/name/nm0321294","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMzgzNTQzMl5BMl5BanBnXkFtZTcwODY2NzEyMw@@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1924","placeOfBirth":" Naples, Italy","bio":"Aldo Giuffrè was born on April 10, 1924 in Naples, Italy. He is known for his work on The Good, the Bad and the Ugly (1966), Hier, aujourd'hui et demain (1963) and Where's Picone? (1984). He was married to Elena Pranzo Zaccaria and Liana Trouche. He died on June 26, 2010 in Rome, Lazio, Italy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMzgzNTQzMl5BMl5BanBnXkFtZTcwODY2NzEyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0321294","name":"Aldo Giuffrè","idIMDB":"nm0321294"},"actorId":"nm0321294","character":"Alcoholic Union Captain","urlCharacter":"http://www.imdb.com/character/ch0106959","main":true},{"actorName":"Luigi Pistilli","urlProfile":"http://www.imdb.com/name/nm0685559","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MzM4MDI5OV5BMl5BanBnXkFtZTcwNjU2NzEyMw@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 July 1929","placeOfBirth":" Grosseto, Tuscany, Italy","bio":"Luisi Pistilli's most notable stage successes were roles in \"The Threepenny Opera\", \"St. Joan of the Stockyards\" and a 1972 production, \"Lulu\". In 1991 he reprised his role in \"Lulu\" in the first professional collaboration with actress-singer Milva, his partner in previous plays as well as in a four-year offstage relationship. Pistilli's most memorable roles were in Francesco Rosi's Cadavres exquis (1976), Lino Del Fra's Antonio Gramsci: The Days of Prison (1977), Carlo Lizzani's Italo-Bulgarian co-production The Bandit (1969) and Sergio Leone's For a Few Dollars More (1965) and The Good, the Bad and the Ugly (1966), in which he played priest Pablo Ramirez, the brother of Eli Wallach's character Tuco. He also worked frequently in TV, including the Mafia series La Mafia 5 - Mort à Palerme (1990), directed by Luigi Perelli.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MzM4MDI5OV5BMl5BanBnXkFtZTcwNjU2NzEyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0685559","name":"Luigi Pistilli","idIMDB":"nm0685559"},"actorId":"nm0685559","character":"Father Pablo Ramirez","urlCharacter":"http://www.imdb.com/character/ch0283160","main":true},{"actorName":"Rada Rassimov","urlProfile":"http://www.imdb.com/name/nm0711502","urlPhoto":"","biography":{"dateOfBirth":"1938","placeOfBirth":" Trieste, Italy","bio":"Rada Rassimov was born in 1938 in Trieste, Italy. She is an actress and producer, known for The Good, the Bad and the Ugly (1966), The Cat o' Nine Tails (1971) and Baron Blood (1972).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0711502","name":"Rada Rassimov","idIMDB":"nm0711502"},"actorId":"nm0711502","character":"Maria","urlCharacter":"http://www.imdb.com/character/ch0167700","main":true},{"actorName":"Enzo Petito","urlProfile":"http://www.imdb.com/name/nm0677654","urlPhoto":"","biography":{"dateOfBirth":"24 July 1897","placeOfBirth":" Naples, Campania, Italy","birthName":"Vincenzo Squatriti","bio":"Enzo Petito was born on July 24, 1897 in Naples, Campania, Italy as Vincenzo Squatriti. He was an actor, known for The Good, the Bad and the Ugly (1966), The Widower (1959) and Les années rugissantes (1962). He died on July 17, 1967 in Rome, Italy.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0677654","name":"Enzo Petito","idIMDB":"nm0677654"},"actorId":"nm0677654","character":"Storekeeper","urlCharacter":"http://www.imdb.com/character/ch0283161","main":true},{"actorName":"Claudio Scarchilli","urlProfile":"http://www.imdb.com/name/nm0769116","urlPhoto":"","biography":{"dateOfBirth":"10 February 1924","placeOfBirth":" Rome, Lazio, Italy","bio":"Claudio Scarchilli was born on February 10, 1924 in Rome, Lazio, Italy. He was an actor, known for The Good, the Bad and the Ugly (1966), Companeros (1970) and Viva Cangaceiro (1970). He died on July 25, 1992 in Rome.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0769116","name":"Claudio Scarchilli","idIMDB":"nm0769116"},"actorId":"nm0769116","character":"Mexican Peon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Bartha","urlProfile":"http://www.imdb.com/name/nm0058384","urlPhoto":"","biography":{"dateOfBirth":"1920","placeOfBirth":" Budapest, Hungary","bio":"John Bartha was born in 1920 in Budapest, Hungary. He is an actor, known for The Good, the Bad and the Ugly (1966), Cannibal Ferox (1981) and Faut pas pousser! (1980). He was previously married to Erzsi Paál.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0058384","name":"John Bartha","idIMDB":"nm0058384"},"actorId":"nm0058384","character":"Sheriff","urlCharacter":"http://www.imdb.com/character/ch0167702","main":true},{"actorName":"Livio Lorenzon","urlProfile":"http://www.imdb.com/name/nm0520859","urlPhoto":"","biography":{"dateOfBirth":"6 May 1923","placeOfBirth":" Trieste, Friuli-Venezia Giulia, Italy","bio":"Brother of Gianni Solaro.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0520859","name":"Livio Lorenzon","idIMDB":"nm0520859"},"actorId":"nm0520859","character":"Baker","urlCharacter":"http://www.imdb.com/character/ch0167703","main":true},{"actorName":"Antonio Casale","urlProfile":"http://www.imdb.com/name/nm0142804","urlPhoto":"","biography":{"dateOfBirth":"17 May 1932","placeOfBirth":" Italy","bio":"Antonio Casale was born on May 17, 1932 in Italy. He was an actor and assistant director, known for The Good, the Bad and the Ugly (1966), Duck, You Sucker (1971) and The Grand Duel (1972). He died on February 4, 2017.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0142804","name":"Antonio Casale","idIMDB":"nm0142804"},"actorId":"nm0142804","character":"Jackson / Bill Carson","urlCharacter":"http://www.imdb.com/character/ch0167704","main":true},{"actorName":"Sandro Scarchilli","urlProfile":"http://www.imdb.com/name/nm0769118","urlPhoto":"","biography":{"dateOfBirth":"22 April 1934","placeOfBirth":" Rome, Lazio, Italy","bio":"Sandro Scarchilli was born on April 22, 1934 in Rome, Lazio, Italy. He was an actor, known for The Good, the Bad and the Ugly (1966), Magnificent West (1972) and Des dollars plein la gueule (1973). He died on August 31, 1999 in Rome.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0769118","name":"Sandro Scarchilli","idIMDB":"nm0769118"},"actorId":"nm0769118","character":"Mexican Peon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Benito Stefanelli","urlProfile":"http://www.imdb.com/name/nm0824934","urlPhoto":"","biography":{"dateOfBirth":"2 September 1928","placeOfBirth":" Rome, Lazio, Italy","bio":"Benito Stefanelli was born on September 2, 1928 in Rome, Lazio, Italy. He is known for his work on The Good, the Bad and the Ugly (1966), A Fistful of Dollars (1964) and For a Few Dollars More (1965). He died in December 1999.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0824934","name":"Benito Stefanelli","idIMDB":"nm0824934"},"actorId":"nm0824934","character":"Member of Angel Eyes' Gang","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Angelo Novi","urlProfile":"http://www.imdb.com/name/nm0637064","urlPhoto":"","biography":{"dateOfBirth":"9 June 1930","placeOfBirth":" Lanzo d'Intelvi, Lombardy, Italy","bio":"Angelo Novi was born on June 9, 1930 in Lanzo d'Intelvi, Lombardy, Italy. He is known for his work on Il était une fois en Amérique (1984), Le dernier empereur (1987) and Le dernier Tango à Paris (1972). He died on May 6, 1997 in Lanzo d'Intelvi.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0637064","name":"Angelo Novi","idIMDB":"nm0637064"},"actorId":"nm0637064","character":"Monk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Antonio Casas","urlProfile":"http://www.imdb.com/name/nm0143030","urlPhoto":"","biography":{"dateOfBirth":"11 November 1911","placeOfBirth":" A Coruña, Galicia, Spain","birthName":"Antonio Casas Barros","height":"6' 3\" (1.91 m)","bio":"Casas was originally a soccer player and stayed for three years with the Spanish \"Atlético Madrid\" team. Due to injuries suffered he quit playing soccer and entered the acting profession in 1943, though by the time he retired from soccer he already had three acting credits, ranging from 1941 to 1943. Between the start of his acting career and his death he has 170 appearances in film and TV to his credit.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0143030","name":"Antonio Casas","idIMDB":"nm0143030"},"actorId":"nm0143030","character":"Stevens","urlCharacter":"http://www.imdb.com/character/ch0167706","main":true}],"seasons":[],"idIMDB":"tt0060196","urlIMDB":"http://www.imdb.com/title/tt0060196","business":{"budget":{"money":"$1,200,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$10,584","country":"Finland","day":"07","month":"08","year":"2003","remarks":"1 Screen"}],"gross":[{"money":"$25,100,000","country":"USA","day":"05","month":"08","year":"2012","remarks":""},{"money":"$10,584","country":"Finland","day":"07","month":"08","year":"2003","remarks":""},{"money":"€39,749","country":"Italy","day":"20","month":"07","year":"2014","remarks":""}],"weekendGross":[{"money":"$10,584","country":"Finland","day":"07","month":"08","year":"2003","remarks":"1 Screen"}],"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"2003 Restoration and Remastering © 2003 Metro-Goldwyn-Mayer Studios Inc. All Rights Reserved."},"technical":{"runtime":["2 hr 41 min (161 min)","3 hr 2 min (182 min) (Spain)","2 hr 28 min (148 min) (UK)","3 hr 6 min (186 min) (dubbed) (France)","2 hr 59 min (179 min) (2003 extended English)","2 hr 22 min (142 min) (cut) (1968) (Finland)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["Technicolor S.p.a., Roma, Italy (color)","Triage Motion Picture Services, Los Angeles (CA), USA (film laboratory services) (2003 extended English-language version)"],"filmLength":["3,894 m (short version) (1968) (Finland)","4,430 m (Sweden)","4,432 m (cut version) (1968) (Finland)","4,470 m (1984) (Finland)","4,955 m (restored version) (2003) (Finland)","4,840 m"],"negativeFormat":["35 mm (Eastman 50T 5251)"],"cinematographicProcess":["Techniscope (2-perf)"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"8.9","metascore":"90","filmingLocations":[{"location":"Mini Hollywood, Tabernas, Almería, Andalucía, Spain"}],"rated":"APPROVED","awards":[{"award":"DVD Exclusive Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated DVDX Award","categories":[{"category":"Best Overall DVD, Classic Film","names":[{"name":"Metro-Goldwyn-Mayer (MGM)","id":null,"role":null}]}]}]},{"award":"Laurel Awards 1968","titlesAwards":[{"titleAwardOutcome":"2nd place Golden Laurel","categories":[{"category":"Action Performance","names":[{"name":"Clint Eastwood","id":"nm0000142","role":null}]}]}]},{"award":"Online Film & Television Association 2016","titlesAwards":[{"titleAwardOutcome":"Won OFTA Film Hall of Fame","categories":[{"category":"Motion Picture","names":[]}]}]}],"votes":"532,108","type":"Movie","companyCreditsSimple":[{"idCompany":"co0013844","name":"Produzioni Europee Associati (PEA)"},{"idCompany":"co0065153","name":"Arturo González Producciones Cinematográficas, S.A"},{"idCompany":"co0074863","name":"Constantin Film Produktion"}],"keywords":{"keywords":["spaghetti western","civil war","hitman","outlaw","shootout","gold","cemetery","battle","bandit","honor","buried gold","scam","american civil war","desert","showdown","treasure","u.s. civil war","final showdown","final battle","epic","19th century","shot through a pillow","cowboys and outlaws","repeating rifle","winchester rifle","sequel to cult favorite","drifter","beating","suspense","treasure hunt","escape","combat","ambush","fast draw","gun violence","two man army","tough guy","opening action scene","one man army","one against many","western hero","action hero","hero","psychopath","cult film","prequel and sequel","evil man","masculine character with female name","prequel","rotoscoping","thrown from a train","title ends with period","third part","third in trilogy","period in title","death of title character","freeze frame","acme brand","illiteracy","bandito","antonyms in title","mexican standoff","contract killer","assassin","interrupted hanging","new mexico","part of trilogy","legless man","exploding bridge","dynamite","good versus evil","deep focus","very little dialogue","moral ambiguity","duster","famous opening theme","one armed man","marauder","warrior","kindness","friendship","compassion","shot to death","shot in the face","shot in the chest","grave robbing","falling from height","explosion","dehydration","death","blood","man with no name","gun fu","bounty hunter","anti hero","train","bridge","amputee","paraplegic","sequel","public execution","greed","skeleton","gunfight","hanging","fugitive","small town","stolen money","brother brother relationship","texas","famous score","coat","betrayal","priest","murder","army","gun store","sabotage","1860s","buried treasure","demolition","impersonation","torture","marksman","spit in the face","firing squad","robbery","noose","child murder","catholic mission","double amputee","saved from hanging","violence","thirst","nude with a gun","hotel","shooting gallery","prisoner of war camp","surprise ending","stagecoach","cowboy shirt","cowboy","cowboy hat","cowboy boots","cannon","pistol","six shooter","revolver","poncho","bathtub"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:51:35"}}