{"data":{"movies":[{"title":"The Captain's Table","originalTitle":"","year":"1959","releaseDate":"19600408","directors":[{"name":"Jack Lee","id":"nm0497442"}],"writers":[{"name":"Bryan Forbes","id":"nm0285302"},{"name":"Richard Gordon","id":"nm0330546"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTQzNzczMV5BMl5BanBnXkFtZTYwOTUxMjg5._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Comedy"],"plot":"A ship's captain is promoted by his company from tramp steamers to their flagship passenger liner. Although he is a thoroughly competent sailor ready to take charge of such a ship, he is less prepared for the social duties the new position involves, not least the way he becomes the target for all the comely unattached women on board.","simplePlot":"A ship's captain is promoted by his company from tramp steamers to their flagship passenger liner. Although he is a thoroughly competent sailor ready to take charge of such a ship, he is ... ","actors":[{"actorName":"John Gregson","urlProfile":"http://www.imdb.com/name/nm0339992","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWUwYTczMDktZDFhYy00MjgxLTg1YjAtZTUxNWJiNTk3MjQ2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 March 1919","placeOfBirth":" Liverpool, England, UK","birthName":"Harold Thomas Gregson","height":"5' 10½\" (1.79 m)","bio":"A former telephone engineer who dabbled in amateur dramatics, John Gregson served aboard a minesweeper with the Royal Navy during World War II. After demobilisation, he joined the Liverpool Old Vic, making his stage debut in 'The Knight of the Burning Pestle'. Freshly married, he moved to London and acted alongside Robert Donat and Margaret Leighton in 'A Sleeping Clergyman' at the West End Criterion Theatre in 1947. During the same period, he was also cast in his first movie, the romantic period melodrama Saraband (1948), though his scenes ended up being cut. Undeterred, Gregson established himself as a popular favorite in subsequent Ealing comedies and later as a long term contractee with the Rank Organisation. His screen personae tended to be men of integrity: regular guys who don't necessarily finish on top, introspective, somewhat diffident, and often troubled. His most fondly remembered role was that of vintage car enthusiast Alan McKim, in the idiosyncratic (and typically British) comedy Genevieve (1953). Ironically, while he is featured in almost every scene behind the wheel, Gregson couldn't drive a car when filming began - and proved to be a slow learner. For the remainder of the decade,he became somewhat typecast in traditional 'stiff upper lip' military roles. As film opportunities began to diminish, he turned more and more towards television, enjoying his greatest popularity as titular star of the police drama series Gideon C.I.D. (1964). Until his untimely death at the age of 55, Gregson alternated television work with acting on stage, as well as doing voice-overs and appearing in commercials for Hamlet cigars.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWUwYTczMDktZDFhYy00MjgxLTg1YjAtZTUxNWJiNTk3MjQ2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0339992","name":"John Gregson","idIMDB":"nm0339992"},"actorId":"nm0339992","character":"Capt. Albert Ebbs","urlCharacter":"http://www.imdb.com/character/ch0530769","main":true},{"actorName":"Peggy Cummins","urlProfile":"http://www.imdb.com/name/nm0192033","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAxNjcwOTg4Nl5BMl5BanBnXkFtZTcwOTQwMDg2Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1925","placeOfBirth":" Prestatyn, Denbighshire, Wales, UK","birthName":"Augusta Margaret Diane Fuller","bio":"Peggy Cummins was born on December 18, 1925 in Prestatyn, Denbighshire, Wales as Augusta Margaret Diane Fuller. She is an actress, known for Gun Crazy (1950), Curse of the Demon (1957) and Green Grass of Wyoming (1948). She was previously married to Derek Dunnett.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAxNjcwOTg4Nl5BMl5BanBnXkFtZTcwOTQwMDg2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0192033","name":"Peggy Cummins","idIMDB":"nm0192033"},"actorId":"nm0192033","character":"Mrs. Judd","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Donald Sinden","urlProfile":"http://www.imdb.com/name/nm0801786","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzOTY4MjA4Nl5BMl5BanBnXkFtZTcwMzIwNTYzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1923","placeOfBirth":" Plymouth, Devon, England, UK","birthName":"Donald Alfred Sinden","height":"6' (1.83 m)","bio":"The son of a country chemist, the British actor Donald Sinden intended to pursue a career in architecture but was spotted in an amateur theatrical production and asked to join a company that entertained the troops during World War II (Sinden was rejected for naval service because of asthma). Following a brief training at drama school, he established himself in theater, particularly as a Shakespearean actor. Having made his film debut in The Cruel Sea (1953), Sinden became a leading man in British films during the 1950s and then moved onto character roles later in his career. While his film appearances became less frequent, he worked steadily in theater (with the Royal Shakespeare Company, primarily) and in television, notably as the unperturbable butler in \"Two's Company\" (1975) and as a miserable in-law in \"Never the Twain\" (1981).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzOTY4MjA4Nl5BMl5BanBnXkFtZTcwMzIwNTYzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0801786","name":"Donald Sinden","idIMDB":"nm0801786"},"actorId":"nm0801786","character":"Shawe-Wilson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nadia Gray","urlProfile":"http://www.imdb.com/name/nm0336842","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzIzMDc2MDE5Nl5BMl5BanBnXkFtZTgwMzczNjM3OTE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 November 1923","placeOfBirth":" Bucharest, Romania","birthName":"Nadia Kujnir-Herescu","bio":"Born Nadia Kujnir-Herescu in Bucharest, Romania, on November 23, 1923, to a Russian father and a Bessarabian mother, the future actress Nadia Gray was raised there. She met first husband Constantin Cantacuzino (1905-1958), a Romanian aviator and noted WWII fighter ace, while she was a passenger on one of his commercial air flights. She couple fled the country during the Communist takeover of Romania in the late 1940s and emigrated to Paris. There Nadia enjoyed a vast international career as a Cosmopolitan lead and second lead on stage and in films. The couple eventually settled in Spain. She made her film debut in a leading role as a young waitress who yearns to be a star in the French-Austrian co-production of L'inconnu d'un soir (1949) and went on to essay a number of more mature, sophisticated, glamorous patricians in European films, often a continental jetsetter or bourgeoisie type. Earlier roles that led to European stardom included her countess in Monseigneur (1949), the woman in love with a thief in The Spider and the Fly (1949), and the role of Cristina Versini in the Italian technicolor biopic of the composer _Puccini (1952)_. Her roster of continental male co-stars went on to include such legendary stalwarts as Marcello Mastroianni, 'Vittorio de Sica', Rossano Brazzi, Errol Flynn, Maurice Ronet and Gabriele Ferzetti. Among her scattered appearances in English-speaking productions were a mixture of adventures, dramas, comedies and horrors including Valley of the Eagles (1951) with John McCallum and Jack Warner, Night Without Stars (1951) opposite David Farrar, The Captain's Table (1959) starring John Gregson and Donald Sinden, I Like Money (1961) starring Peter Sellers, Maniac (1963) co-starring Kerwin Mathews, The Naked Runner (1967) starring Frank Sinatra and a supporting role in the classic Albert Finney/Audrey Hepburn romance Two for the Road (1967). Nadia is most famous, however, for her cameo role toward the end of Federico Fellini's masterpiece La Dolce Vita (1960) as a bored and wealthy socialite who celebrates her divorce by performing a memorable mink-coated striptease during a jaded party sequence in her home. Following the death of her first husband in Spain in 1958 (he was only 52), Nadia continued to film and settled permanently in America in the late 60s after meeting and marrying second husband Herbert Silverman, a New York lawyer. She retired from films completely in 1976 and began headlining as a singing cabaret star. The trend-setting Russian-Romanian beauty died of a stroke in Manhattan on June 13, 1994 at age 70 and was survived by her second husband and two stepchildren.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzIzMDc2MDE5Nl5BMl5BanBnXkFtZTgwMzczNjM3OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0336842","name":"Nadia Gray","idIMDB":"nm0336842"},"actorId":"nm0336842","character":"Mrs. Porteous","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maurice Denham","urlProfile":"http://www.imdb.com/name/nm0219062","urlPhoto":"","biography":{"dateOfBirth":"23 December 1909","placeOfBirth":" Beckenham, Kent, England, UK","birthName":"William Maurice Denham","bio":"Born in Beckenham, Kent, English character actor Maurice Denham first came to public notice in the 1940s on radio, appearing on many of the most popular comedy series of the day in a variety of characters. His debut in films came in 1947 with The Smugglers (1947). His talents came to the forefront in the animated feature Animal Farm (1954), in which he voiced all of the animal characters. A prolific actor, his familiar sharp features and bald head appeared in dozens of films over the following years, often as charming but slightly \"balmy\" characters and well-bred cads, although he was more than capable of playing straight drama, as he did in the war picture Sink the Bismarck! (1960) as a naval officer helping to hunt down and sink the German battleship. He began appearing regularly in television in the 1970s and also worked steadily on the stage. He died of natural causes at age 92 in London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0219062","name":"Maurice Denham","idIMDB":"nm0219062"},"actorId":"nm0219062","character":"Major Broster","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Wattis","urlProfile":"http://www.imdb.com/name/nm0915077","urlPhoto":"","biography":{"dateOfBirth":"25 February 1912","placeOfBirth":" Wednesbury, Staffordshire, England, UK","birthName":"Richard Cameron Wattis","height":"5' 10\" (1.78 m)","bio":"A balding, bespectacled, bird-like British comic actor, Richard Wattis was an invaluable asset to any UK comedy film or TV programme for nearly thirty years. Much associated with the Eric Sykes TV series for the latter part of his career. He was often seen in officious roles, such as snooty shop managers, secretaries and policemen. He was working right up to his sudden death from a heart attack in 1975.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0915077","name":"Richard Wattis","idIMDB":"nm0915077"},"actorId":"nm0915077","character":"Prittlewell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Reginald Beckwith","urlProfile":"http://www.imdb.com/name/nm0065888","urlPhoto":"","biography":{"dateOfBirth":"2 November 1908","placeOfBirth":" York, England, UK","birthName":"William Reginald Beckwith","bio":"Reginald Beckwith was born on November 2, 1908 in York, England as William Reginald Beckwith. He was an actor and writer, known for Thunderball (1965), A Shot in the Dark (1964) and Curse of the Demon (1957). He died on June 26, 1965 in Bourne End, Buckinghamshire, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0065888","name":"Reginald Beckwith","nicknames":["Tony"],"idIMDB":"nm0065888"},"actorId":"nm0065888","character":"Burtweed","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lionel Murton","urlProfile":"http://www.imdb.com/name/nm0615463","urlPhoto":"","biography":{"dateOfBirth":"2 June 1915","placeOfBirth":" London, England, UK","birthName":"William Lionel Murton","bio":"Lionel Murton was born on June 2, 1915 in London, England as William Lionel Murton. He was an actor, known for The Dickie Henderson Show (1960), Patton (1970) and Pursuit of the Graf Spee (1956). He was married to Anita D'Allaire. He died on September 26, 2006 in Basingstoke, Hampshire, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0615463","name":"Lionel Murton","nicknames":["Murt"],"idIMDB":"nm0615463"},"actorId":"nm0615463","character":"Bernie Floate","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Kerr","urlProfile":"http://www.imdb.com/name/nm0449652","urlPhoto":"","biography":{"dateOfBirth":"10 June 1922","placeOfBirth":" Cape Town, South Africa","birthName":"William Kerr","bio":"In the 1950s, Bill Kerr was one of Tony Hancock's regular sidekicks in the popular radio series 'Hancock's Half Hour'. In the first series he was smarter than Tony, but as the series progressed he became more and more stupid and childlike, regularly calling Tony 'Tubb'. Despite remaining on the radio series throughout its six year run, when the TV series began he was not required.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0449652","name":"Bill Kerr","nicknames":["Bill Kerr"],"idIMDB":"nm0449652"},"actorId":"nm0449652","character":"Bill Coke","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicholas Phipps","urlProfile":"http://www.imdb.com/name/nm0681043","urlPhoto":"","biography":{"dateOfBirth":"23 June 1913","placeOfBirth":" London, England, UK","bio":"Nicholas Phipps was born on June 23, 1913 in London, England. He was an actor and writer, known for Madeleine (1950), Doctor in the House (1954) and The Captain's Paradise (1953). He died on April 11, 1980 in London.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0681043","name":"Nicholas Phipps","idIMDB":"nm0681043"},"actorId":"nm0681043","character":"Reddish","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joan Sims","urlProfile":"http://www.imdb.com/name/nm0801330","urlPhoto":"","biography":{"dateOfBirth":"9 May 1930","placeOfBirth":" Laindon, Essex, England, UK","birthName":"Irene Joan Marion Sims","height":"5' 5\" (1.65 m)","bio":"The First Lady of Carry On, was born Irene Joan Marion Sims on 9 May 1930. The daughter of an Essex railway station master, Joan was interested in pursuing show-business, and soon became a familiar face in a growing number of amateur productions. In 1946, Joan first applied to RADA, her audition was unsuccessful. She did succeed in being admitted to PARADA, the academy's preparatory school, and finally, on her fourth attempt, Joan graduated and trained at RADA. Joan graduated from RADA in 1950 at the age of nineteen. A cameo appearance in Doctor in the House (1954) as the sexually repressed Nurse Rigor Mortis led to Joan being first spotted by Peter Rogers; Rogers' wife Betty E. Box was the producer of the Doctor series, in which Joan herself became a regular. A few years later, in 1958, Joan received another script from Peter Rogers, it was Carry On Nurse (1959). The film had been a huge success at the box office and in the autumn of that year Rogers and Gerald Thomas began planning a follow up. She went on to appear in 24 of the films, making her the longest serving female member of the team. She first starred in the following three Carry On films: Carry On Teacher (1959), Carry On Constable (1960) and Carry On Regardless (1961), before taking a break from the next four films to concentrate on stage work. She rejoined the team with Carry on Cleo (1964) and remained all the way through to Carry On Emmannuelle (1978) in 1978. Ironically, she was never proclaimed Queen of Carry On. This title went to saucy Barbara Windsor, even though she had only appeared in nine Carry On films. One could argue that her final performances in the Carry On films were rather sentimental, as though she knew that the series was coming to an end and two scenes come to mind. The scene in which she plays cards with Peter Butterworth in Carry on Behind (1975) in his caravan late at night, and also in the laundrette where she dances with an early Carry Oner Victor Maddern in Carry On Emmannuelle (1978). Both of these are memorable sentimental film scene stealers. With the end of the Carry On series in 1978, Joan went on to become a familiar face on TV screens, with ongoing roles in a number of highly successful sitcoms On the Up (1990) and As Time Goes By (1992) and the BBC's prestigious classic drama adaptations such as Martin Chuzzlewit (1994). Joan's autobiography, High Spirits, was released in 2000. She complains in the last few pages of her book at the lack of information on her on the IMDB trivia page, something that was only significantly expanded after her death. In her later years she became a cult figure and something of a British National Institution as the only surviving major Carry On star from early days. However, years of heavy drinking took their toll and she suffered in her later years with ill health. She was admitted to Hospital in Chelsea in London in mid 2001 and slipped into a coma. She died on 28 June 2001, with her lifelong friend and Carry On Norah Holland holding her hand. Following her death, surviving Carry On stars celebrated her achievement in the Carry On films. Barbara Windsor, said at the time of her death, \"To me she was the last of the great Carry Ons, she was there at the beginning. Her talent was wonderful, she could do any accent, dialect, she could dance, sing, play dowdy and glam. We laughed all the time and giggled a lot. I will sorely miss her.\" That quote is so true, throughout her whole Carry On career she alone stands apart as the most versatile actress in the whole series. She was never typecast in the films like the other actors and actresses. Others also paid tribute, even ex-Government Cabinet Ministers. Her agent Richard Hatton said, \"It's wonderful to be able to say that she really did have all the qualities that her many fans would have wished. A great sense of humour, a sympathetic and endearing personality, terrific talent and consideration for others. \"Over and above this, she discovered a new side of herself when she wrote her autobiography last year, which was untypical for the genre - honest, frank and intelligent. Everyone who knew her is going to remember her forever.\"","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0801330","name":"Joan Sims","nicknames":["Joanie","Queen of Puddings","The First Lady of Carry On"],"idIMDB":"nm0801330"},"actorId":"nm0801330","character":"Maude Pritchett","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Miles Malleson","urlProfile":"http://www.imdb.com/name/nm0539942","urlPhoto":"","biography":{"dateOfBirth":"25 May 1888","placeOfBirth":" Croydon, Surrey, England, UK","birthName":"William Miles Malleson","bio":"Actor, playwright and screenwriter Miles Malleson's list of credits reads like a history of British cinema in the first half of the 20th century. Born in Croydon in Surrey, he attended Brighton College in Sussex before studying at Cambridge University with the intention of becoming a schoolmaster. However, he opted instead for the stage and went into repertory theatre in Liverpool and then onto the Royal Academy of Dramatic Art (RADA) in London. He wrote his first play in 1913 and, in contrast to the characters he often portrayed on screen, held socially progressive views which were often reflected in his work. His output included two plays about the First World War, \"D Company\" and \"Black Eill\", and one about the Tolpuddle Martyrs. He also worked as a screenwriter on two documentaries for Paul Rotha, Land of Promise (1946) and \"World of Plenty\". His most prolific period as a screenwriter was in the 1930s and 1940s, initially on historical subjects like Nell Gwyn (1934), Rhodes (1936), and Victoria the Great (1937). In many of these films he also began appearing in supporting roles, and from the mid-'30s onwards he found himself in increasing demand as an actor as well as a writer. Over the next 30 years he appeared in nearly 100 films, featuring in everything from Alfred Hitchcock thrillers and Ealing comedies to Hammer horrors. Usually cast as a befuddled judge or a doddering old doctor, academic or other local eccentric, he first caught audiences' imagination as the hearse driver in the Ealing chiller compendium Dead of Night (1945), after which he began to get bigger and better parts. He was particularly memorable as the philosophical hangman in Kind Hearts and Coronets (1949), Canon Chasuble in The Importance of Being Earnest (1952), Dr. McAdam in Folly to Be Wise (1952), the barrister Grimes in Brothers in Law (1957) and as Windrush Sr. in Private's Progress (1956) and I'm All Right Jack (1959). Towards the end of his career he continued to appear in cameo roles in comedy films, and made several appearances in Hammer horror films including Horror of Dracula (1958) and The Hound of the Baskervilles (1959), before failing eyesight forced him into retirement in his late 70s.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0539942","name":"Miles Malleson","idIMDB":"nm0539942"},"actorId":"nm0539942","character":"Canon Swingler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Le Mesurier","urlProfile":"http://www.imdb.com/name/nm0494452","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMTU1OTU3NV5BMl5BanBnXkFtZTcwMTU1ODUzOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 April 1912","placeOfBirth":" Bedford, Bedfordshire, England, UK","birthName":"John Elton Le Mesurier Halliley","height":"5' 9\" (1.75 m)","bio":"The son of a solicitor, British character actor John Le Mesurier attended public school in Dorset, England, before embarking on a career in law. However, acting was his true calling, and at age 20, with his parents' approval, he began his acting career by studying drama at the Fay Compton School of Acting, where one of his classmates was Alec Guinness. After acting school he performed in repertory until World War II, when he served as a captain in the Northwest Indian Frontier. After the war he returned to the stage and made his film debut in Death in the Hand (1948). By the late 1950s Le Mesurier had made appearances in numerous films, especially those made by the Boulting Brothers, and also on television, particularly on Hancock's Half Hour (1956). In 1968 he landed arguably his most popular role, that of sgt. Wilson in the long-running television series Dad's Army (1968). Although preferring comedy, Le Mesurier also excelled in drama, winning a BAFTA award for Best Actor of the Year in 1971 for his performance in Dennis Potter's \"Traitor (1971) (TV)\". In 1977, during \"Dad's Army\", he had become very ill, but he recovered and continued acting until his death six years later.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMTU1OTU3NV5BMl5BanBnXkFtZTcwMTU1ODUzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0494452","name":"John Le Mesurier","idIMDB":"nm0494452"},"actorId":"nm0494452","character":"Sir Angus","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Hayter","urlProfile":"http://www.imdb.com/name/nm0371687","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTVkZTQ0NWQtNDYzZi00ZWEwLThhYTUtZTU2Nzg4NDAzMjVmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 April 1907","placeOfBirth":" Lonuvla, India","height":"5' 5\" (1.65 m)","bio":"The son of a police superintendent in India, the character actor James Hayter was educated in Scotland, where he was urged into acting by his headmaster. After one year (1924-5) at the Royal Academy of the Dramatic Arts in London, he performed in repertory theater, eventually appearing in The West End in such plays as \"1066 and All That\" and \"French Without Tears.\" He made his film debut in 1936 and continued in films until World War II, when he served in the Royal Armoured Corps. After the war, he established an active screen career, excelling at various sorts of character roles, especially in comedy. Characteristic roles include Friar Tuck in The Story of Robin Hood and His Merrie Men (1952) and A Challenge for Robin Hood (1967), The Pickwick Papers (1952), and David Copperfield (1970).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTVkZTQ0NWQtNDYzZi00ZWEwLThhYTUtZTU2Nzg4NDAzMjVmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0371687","name":"James Hayter","idIMDB":"nm0371687"},"actorId":"nm0371687","character":"Earnshaw","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"June Jago","urlProfile":"http://www.imdb.com/name/nm0415625","urlPhoto":"","biography":{"dateOfBirth":"1926","placeOfBirth":" Australia","bio":"June Jago was born in 1926 in Australia. She is known for her work on L'homme de la rivière d'argent (1982), Carry on Doctor (1967) and S.W.A.L.K. (1971). She died in August 2010 in Australia.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0415625","name":"June Jago","idIMDB":"nm0415625"},"actorId":"nm0415625","character":"Gwenny Coke","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0052672","urlIMDB":"http://www.imdb.com/title/tt0052672","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Color (Eastmancolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"7.1","filmingLocations":[],"awards":[],"votes":"258","type":"Movie","companyCreditsSimple":[{"idCompany":"co0021421","name":"Rank Organisation, The"}],"keywords":{"keywords":["ship captain","flirting","fish out of water","culture clash","cruise ship","based on novel","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:28:46"}}