{"data":{"movies":[{"title":"Ironweed","originalTitle":"","year":"1987","releaseDate":"19880212","directors":[{"name":"Hector Babenco","id":"nm0002199"}],"writers":[{"name":"William Kennedy","id":"nm0448379"},{"name":"William Kennedy","id":"nm0448379"}],"runtime":"143 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzgyMmExYmEtOGM0NC00MjU3LTg4M2QtODRmNWM2NDgzMGQ4XkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama"],"plot":"Albany, New York, Halloween, 1938. Francis Phelan and Helen Archer are bums, back in their birth city. She was a singer on the radio, he a major league pitcher. Death surrounds them: she's sick, a pal has cancer, he digs graves at the cemetery and visits the grave of his infant son whom he dropped; visions of his past haunt him, including ghosts of two men he killed. That night, out drinking, Helen tries to sing at a bar. Next day, Fran visits his wife and children and meets a grandson. He could stay, but decides it's not for him. Helen gets their things out of storage and finds a hotel. Amidst their mistakes and dereliction, the film explores their code of fairness and loyalty.","simplePlot":"An alcoholic drifter spends Halloween in his home town of Albany, NY after returning there for the first time in decades.","actors":[{"actorName":"Jack Nicholson","urlProfile":"http://www.imdb.com/name/nm0000197","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3OTY0ODk0M15BMl5BanBnXkFtZTYwNzE4Njc4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 April 1937","placeOfBirth":" Neptune, New Jersey, USA","birthName":"John Joseph Nicholson","height":"5' 9¾\" (1.77 m)","bio":"Jack Nicholson, an American actor, producer, director and screenwriter, is a three-time Academy Award winner and twelve-time nominee. Nicholson is also notable for being one of two actors - the other being Michael Caine - who have received Oscar nomination in every decade from the 1960s through the 1990s. Nicholson was born on April 22, 1937 in Neptune, New Jersey. He was raised believing that his grandmother was his mother, and that his mother, June Frances Nicholson, a show-girl, was his older sister. He discovered the truth in 1975 from a Time magazine journalist who was researching a profile on him. His real father is believed to have been either Donald Furcillo, an Italian-American show-man, or Eddie King (Edgar Kirschfeld), born in Latvia and also in show-business. Jack's mother's ancestry was Irish, English, as well as German, Scottish and Welsh. Nicholson made his film debut in a B-movie titled The Cry Baby Killer (1958). His rise in Hollywood was far from meteoric, and for years, he sustained his career with guest spots in television series and a number of Roger Corman films, including The Little Shop of Horrors (1960). Nicholson's first turn in the director's chair was for Drive, He Said (1971). Before that, he wrote the screenplay for The Trip (1967), and co-wrote Head (1968), a vehicle for The Monkees. His big break came with Easy Rider (1969) and his portrayal of liquor-soaked attorney George Hanson, which earned Nicholson his first Oscar nomination. Nicholson's film career took off in the 1970s with a definitive performance in Five Easy Pieces (1970). Nicholson's other notable work during this period includes leading roles in Roman Polanski's noir masterpiece Chinatown (1974) and One Flew Over the Cuckoo's Nest (1975), for which he won his first Best Actor Oscar. The 1980s kicked off with another career-defining role for Nicholson as Jack Torrance in Stanley Kubrick's adaptation of Stephen King's novel The Shining (1980). A string of well-received films followed, including Terms of Endearment (1983) which earned Nicholson his second Oscar; Prizzi's Honor (1985) and The Witches of Eastwick (1987). He portrayed another renowned villain, The Joker, in Tim Burton's Batman (1989). In the 1990s, he starred in such varied films as A Few Good Men (1992), for which he received another Oscar nomination, and a dual role in Mars Attacks! (1996). Although a glimpse at the darker side of Nicholson's acting range reappeared in The Departed (2006), the actor's most recent roles highlight the physical and emotional complications one faces late in life. The most notable of these is the unapologetically misanthropic Melvin Udall in As Good as It Gets (1997), for which he won his third Academy Award. Shades of this persona are apparent in About Schmidt (2002), Something's Gotta Give (2003) and The Bucket List (2007). In addition to his Academy Awards and Oscar nominations, Nicholson has seven Golden Globe Awards, and received a Kennedy Center Honor in 2001. He also became one of the youngest actors to receive the American Film Institute's Life Achievement award in 1994. Nicholson has five children: Eldest daughter Jennifer Nicholson (b. 1963), from his marriage to Sandra Knight which ended in 1968; Caleb James Goddard (b. 1970) with Susan Anspach; Honey Hollman (b. 1981) with Danish supermodel, Winnie Hollman; and Lorraine Nicholson (b. 1990) and Ray Nicholson (b. 1992) with Rebecca Broussard. Nicholson's longest relationship was the seventeen years he spent with actress Anjelica Huston; this ended when Broussard become pregnant with his child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3OTY0ODk0M15BMl5BanBnXkFtZTYwNzE4Njc4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000197","name":"Jack Nicholson","nicknames":["Mulholland Man","Nick"],"idIMDB":"nm0000197"},"actorId":"nm0000197","character":"Francis Phelan","urlCharacter":"http://www.imdb.com/character/ch0031112","main":true},{"actorName":"Meryl Streep","urlProfile":"http://www.imdb.com/name/nm0000658","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4Mjk5MDExOF5BMl5BanBnXkFtZTcwOTU1MTMyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 June 1949","placeOfBirth":" Summit, New Jersey, USA","birthName":"Mary Louise Streep","height":"5' 6\" (1.68 m)","bio":"Considered by many critics to be the greatest living actress, Meryl Streep has been nominated for the Academy Award an astonishing 20 times, and has won it three times. Meryl was born Mary Louise Streep in 1949 in Summit, New Jersey, to Mary Wolf (Wilkinson), a commercial artist, and Harry William Streep, Jr., a pharmaceutical executive. Her father was of German and Swiss-German descent, and her mother had English, Irish, and German ancestry. Meryl's early performing ambitions leaned toward the opera. She became interested in acting while a student at Vassar and upon graduation she enrolled in the Yale School of Drama. She gave an outstanding performance in her first film role, Julia (1977), and the next year she was nominated for her first Oscar for her role in The Deer Hunter (1978). She went on to win the Academy Award for her performances in Kramer vs. Kramer (1979) and Sophie's Choice (1982), in which she gave a heart-wrenching portrayal of an inmate mother in a Nazi death camp. A perfectionist in her craft and meticulous and painstaking in her preparation for her roles, Meryl turned out a string of highly acclaimed performances over the next decade in great films like Silkwood (1983); Out of Africa (1985); Ironweed (1987); and A Cry in the Dark (1988). Her career declined slightly in the early 1990s as a result of her inability to find suitable parts, but she shot back to the top in 1995 with her performance as Clint Eastwood's married lover in The Bridges of Madison County (1995) and as the prodigal daughter in Marvin's Room (1996). In 1998 she made her first venture into the area of producing, and was the executive producer for the moving ...First Do No Harm (1997). A realist when she talks about her future years in film, she remarked that \"...no matter what happens, my work will stand...\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4Mjk5MDExOF5BMl5BanBnXkFtZTcwOTU1MTMyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000658","name":"Meryl Streep","idIMDB":"nm0000658"},"actorId":"nm0000658","character":"Helen Archer","urlCharacter":"http://www.imdb.com/character/ch0325473","main":true},{"actorName":"Carroll Baker","urlProfile":"http://www.imdb.com/name/nm0004647","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2ODk4MDk4MV5BMl5BanBnXkFtZTYwMDcwMTM2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 May 1931","placeOfBirth":" Johnstown, Pennsylvania, USA","height":"5' 5\" (1.65 m)","bio":"Carroll Baker was born Karolina Piekarski on May 28, 1931 in Johnstown, Pennsylvania, the daughter of a traveling salesman. She attended community college for a year and then worked as a dancer and magician's assistant. After a brief marriage, she had a small part in Easy to Love (1953), did TV commercials, and had a bit part on Broadway. She studied at the Actors Studio and was married to director Jack Garfein (one daughter, Blanche Baker). Warner Brothers, sensing a future Marilyn Monroe, cast her in Giant (1956), Baby Doll (1956) (Oscar nomination for her thumb-sucking role), The Carpetbaggers (1964) and Harlow (1965) (title role). Moving to Italy, she made films there and in England, Germany, Mexico and Spain . After returning to American films, she married Donald Burton in 1982 and resided in Hampstead, London in the 1980s. They remained together until Burton's death from emphysema in their home in Cathedral City, California in 2007.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2ODk4MDk4MV5BMl5BanBnXkFtZTYwMDcwMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004647","name":"Carroll Baker","idIMDB":"nm0004647"},"actorId":"nm0004647","character":"Annie Phelan","urlCharacter":"http://www.imdb.com/character/ch0325474","main":true},{"actorName":"Michael O'Keefe","urlProfile":"http://www.imdb.com/name/nm0001574","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NDczMDc0N15BMl5BanBnXkFtZTYwNTg4Mzc3._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 April 1955","placeOfBirth":" Mount Vernon, New York, USA","birthName":"Raymond Peter O'Keefe Jr.","height":"6' 1\" (1.85 m)","bio":"Michael O'Keefe was born on April 24, 1955 in Mount Vernon, New York, USA as Raymond Peter O'Keefe Jr. He is an actor and director, known for Michael Clayton (2007), Caddyshack (1980) and Frozen River (2008). He has been married to Emily Donahoe since September 18, 2011. They have one child. He was previously married to Bonnie Raitt.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NDczMDc0N15BMl5BanBnXkFtZTYwNTg4Mzc3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001574","name":"Michael O'Keefe","idIMDB":"nm0001574"},"actorId":"nm0001574","character":"Billy Phelan","urlCharacter":"http://www.imdb.com/character/ch0325475","main":true},{"actorName":"Diane Venora","urlProfile":"http://www.imdb.com/name/nm0893204","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0Mjg4ODY0Ml5BMl5BanBnXkFtZTcwNTc5MDkwMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1952","placeOfBirth":" Hartford, Connecticut, USA","bio":"Diane Venora was born Diana Venora in East Hartford Connecticut. She left Hartford for a full scholarship in the Drama Division of The Juilliard School. After graduating from Juilliard, she performed extensively on the stage and developed a reputation as a talented stage actress, particularly in Shakespearian plays. In 1983, she starred in Joseph Papp's production of \"Hamlet\" at the New York Shakespeare Festival, in the lead role, the first woman to play the role at the New York Shakespeare Festival. In 1988, her critically acclaimed performance in Clint Eastwood's biographical feature of jazz great Charlie Parker, Bird (1988), as \"Chan Parker\", his wife, earned her a Golden Globe nomination and the New York Film Critics Award. These roles essentially made her famous. She was married to cinematographer Andrzej Bartkowiak (Speed (1994)) but later divorced him. After the divorce, she lived in New York with her daughter Madaket Bartkowiak, traveling often for work. She quit show business when Madzia was 8 to spend more time with her daughter. During her 7-year hiatus, Venora stayed close to home, teaching disadvantaged children, and acting in an occasional play. When Madzia was 15, Venora took her to Los Angeles and soon landed a starring role in the ABC series Thunder Alley (1994) playing Edward Asner's daughter and a recurring role in the Emmy award-winning series Chicago Hope (1994). In 1995, she starred opposite Al Pacino and Robert De Niro as Pacino's wife in Heat (1995), earning high regard from both critics and audiences for her of role of \"Justine Hanna\", caught in a troubled marriage. That performance, and her follow-up as Juliet's mother in William Shakespeare's Romeo + Juliet (1996) impressed the directors of both The Jackal (1997) and The 13th Warrior (1999) starring Antonio Banderas.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0Mjg4ODY0Ml5BMl5BanBnXkFtZTcwNTc5MDkwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0893204","name":"Diane Venora","idIMDB":"nm0893204"},"actorId":"nm0893204","character":"Margaret 'Peg' Phelan","urlCharacter":"http://www.imdb.com/character/ch0325476","main":true},{"actorName":"Fred Gwynne","urlProfile":"http://www.imdb.com/name/nm0001304","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxODI0OTk3N15BMl5BanBnXkFtZTgwMDE5NjU1MTE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 July 1926","placeOfBirth":" New York City, New York, USA","birthName":"Frederick Hubbard Gwynne","height":"6' 5\" (1.96 m)","bio":"Fred Gwynne was an enormously talented character actor most famous for starring in the television situation comedies Car 54, Where Are You? (1961) (as Officer Francis Muldoon) and The Munsters (1964) (as the Frankenstein clone Herman Munster). He was very tall and had a resonant, baritone voice that he put to good use in Broadway musicals. Born Frederick Hubbard Gwynne in New York City on July 10, 1926, to a wealthy stockbroker father, he attended the exclusive prep school Groton, where he first appeared on stage in a student production of William Shakespeare's \"Henry V\". After serving in the United States Navy as a radioman during World War II, he went on to Harvard, where he majored in English and was on the staff of the \"Harvard Lampoon\". At Harvard, he studied drawing with artist R.S. Merryman and was active in dramatics. A member of the Hasty Pudding Club, he performed in the dining club's theatricals, appearing in the drag revues of 1949 and 1950. After graduating from Harvard with the class of 1951, Gwynne acted in Shakespeare with a Cambridge, Massachusetts repertory company before heading to New York City, where he supported himself as a musician and copywriter. His principal source of income for many years came from his work as a book illustrator and as a commercial artist. His first book, \"The Best in Show\", was published in 1958. On February 20, 1952, he made his Broadway debut as the character \"Stinker\", in support of Helen Hayes, in the comic fantasy \"Mrs. McThing\". The play, written by \"Harvey (1950)\" author Mary Chase, had a cast featuring Ernest Borgnine, the future \"Professor\" Irwin Corey and Brandon De Wilde, the young son of the play's stage manager, Frederick DeWilde. The play ran for 320 performances and closed on January 10, 1953. He next appeared on Broadway in Burgess Meredith's staging of Nathaniel Benchley's comedy \"The Frogs of Spring\", which opened at the Broadhurst Theatre on October 21, 1953. The play flopped, closing on Halloween Day after but 15 performances. He did not appear on Broadway again for almost seven years. Gwynne made his movie debut, unbilled, as one of Johnny Friendly's gang of thugs who menace Marlon Brando in Elia Kazan's classic On the Waterfront (1954). From 1956 - 1963, he appeared on the television dramatic showcases Studio One in Hollywood (1948), The Kaiser Aluminum Hour (1956), Kraft Theatre (1947), The DuPont Show of the Month (1957), The DuPont Show of the Week (1961) and The United States Steel Hour (1953). But it was in situation comedies that he made his name and his fame. In 1955, he made a memorable guest appearance as Private Honigan on The Phil Silvers Show (1955). He played a soldier with an enormous appetite that Phil Silvers' Sgt. Bilko entered into a pie-eating contest, only to discover he could only eat like a trencherman when he was depressed. The spot led to him coming back as a guest in more episodes. While appearing on Broadway as the pimp Polyte-Le-Mou in the Peter Brook-directed hit \"Irma La Douce\" (winner of the 1961 Tony Award for Best Musical), \"Bilko\" producer-writer Nat Hiken cast him in one of the lead roles in the situation comedy Car 54, Where Are You? (1961). The series, in which he revealed his wonderful flair for comedy, had Gwynne appearing as New York City police officer Francis Muldoon, who served in a patrol car in the Bronx with the dimwitted Officer Gunther Toody, played by co-star Joe E. Ross (\"Oooh! Oooh!\"). Car 54, Where Are You? (1961) lasted only two seasons, but it was so fondly remembered by Baby Boomers, it inspired a feature film version in 1994. He also served as Lamb Chop's doctor on another Baby Boomer classic, The Shari Lewis Show (1960). Another one of his \"Car 54, Where Are You?\" co-stars, Al Lewis, not only became a lifelong friend, he appeared as Gwynne's father-in-law in his next situation comedy. Gwynne was cast as the Frankenstein's monster-like paterfamilias in The Munsters (1964), which also lasted two seasons. In addition to wearing heavy boots with four-inch lifts on them, Gwynne had to wear 40 - 50 lbs of padding and makeup for the role and he reportedly lost ten pounds in one day of filming under the hot lights. He made guest appearances as Herman Munster, most notably on The Red Skelton Hour (1951), appearing on April 27, 1965, along with Billy J. Kramer and the Dakotas, a pop band from The Beatles' native Liverpool. Gwynne appeared in character as Herman Munster in a \"Freddie the Freeloader\" comedy sketch. When \"The Munsters\" was canceled after the 1965-1966 season, Gwynne returned to the theatre to escape television typecasting, although he did return for a featured appearance in the televised version of Arsenic and Old Lace (1969), playing the psychotic Jonathan Brewster in an all-star cast, including with his \"Mrs. McThing\" co-star Helen Hayes, Lillian Gish, Bob Crane, Sue Lyon, Jack Gilford and David Wayne. He appeared twice on television in Mary Chase's \"Harvey\" (1950), the first time in 1958 on the \"Dupont Show of the Month\" version broadcast by CBS, in which he appeared in support of Art Carney as Elwood P. Dodd. Others in the cast included Elizabeth Montgomery, Jack Weston and Larry Blyden. He appeared as the cab driver in the 1972 version, Harvey (1972), in which James Stewart reprised his role as Elwood P. Dodd, in which he was reunited with his Broadway co-star Helen Hayes. In 1968, he made a television series pilot for Screen Gems, \"Guess What I Did Today?\", co-starring Bridget Hanley, who later played Candy Pruit on Here Come the Brides (1968). The pilot, which was made for NBC, was not picked up by the network. Gwynne had trouble making producers forget his character Herman Munster and he started refusing to have anything to do with or even to speak of the show. One of the few visual productions to utilise his beautiful singing voice was The Littlest Angel (1969), a musical produced as part of the Hallmark Hall of Fame (1951). His movie and television appearances were sporadic throughout the 1970s as he worked on- and off-Broadway. He had used his singing voice again to great effect in Meredith Wilson's musical \"Here's Love\", which opened at the Shubert Theatre on October 20, 1963 and played for 334 performances, closing on July 25, 1964. Exactly nine years from the \"Here's Love\" opening, he appeared at the Plymouth as \"Abraham Lincoln\" in the Broadway play \"The Lincoln Mask\", a flop that lasted but one week of eight performances. His most distinguished performance on Broadway (and the favourite of all of his theatrical roles, was as Big Daddy in the 1974 Broadway revival of Tennessee Williams' \"Cat on a Hot Tin Roof\". Though not as cutting as Burl Ives had been in the original production, his Big Daddy was lyrical and powerful, so much so that he overpowered Keir Dullea in the role of \"Brick\". However, Elizabeth Ashley won a Tony Award for playing Maggie the Cat in the production, which gave Tennessee Williams his first big success in a decade, albeit in a revival. Gwynne also was memorable as the elderly Klansman in the first two parts of \"The Texas Trilogy\" in 1977 season. His last appearance on Broadway was in Anthony Shaffer's \"Whodunnit\", which opened at the Biltmore Theatre on December 30, 1983 and closed May 15, 1983 after 157 total performances. Before saying goodbye to the Broadway stage in a hit, he had appeared on the Great White Way in two flops in 1978: \"Angel\", the musical version of Thomas Wolfe's \"Look Homeward, Angel\" (which lasted but five performances) and the Australian professional football club drama \"Players\" (which lasted 23 performances). For the Joseph Papp Public Theatre/New York Shakespeare Festival, he had appeared in Off-Broadway in \"More Than You Deserve\" in the 1973-1974 season and, in \"Grand Magic\", during the 1978-1979 season, for which he won an Obie Award. On the radio, Gwynne appeared in 79 episodes of \"The CBS Radio Mystery Theatre\" between 1975 and 1982. With time, his characterisation of Herman Munster began to fade and he began establishing himself as a film character actor of note in the 1980s with well-reviewed appearances in The Cotton Club (1984), Ironweed (1987), Disorganized Crime (1989) and Pet Sematary (1989), in which his character, Jud Crandall, was based on author Stephen King, who himself is quite tall. Gwynne also made a memorable turn as the judge who battles with the eponymous My Cousin Vinny (1992), his last film. Critic and cinema historian Mick LaSalle cited Gwynne's performance as Judge Chamberlain Haller in his August 2003 article \"Role call of overlooked performances is long\", writing: \"Half of what made Joe Pesci funny in this comedy was the stream of reactions of Gwynne, as the Southern Judge, a Great Dane to Joe Pesci's yapping terrier.\" Gwynne sang professionally, painted, sculpted, wrote & illustrated children's books, including: \"The King Who Rained\" (1970); \"A Chocolate Moose for Dinner\" (1976); \"A Little Pigeon Toad\" (1988) and \"Pondlarker\" (1990). He wrote 10 books in all and \"The King Who Rained\", \"A Chocolate Moose for Dinner\" and \"A Little Pigeon Toad\", which all were published by the prestigious house Simon & Schuster, are still in print. In the first part of his professional life, Gwynne lived a quiet life in suburban Bedford, New York and avoided the Hollywood and Broadway social scenes. He married his first wife Foxy in 1952. They had five children and divorced in 1980. He and his second wife Deb, whom he married in 1981, lived in a renovated farmhouse in rural Taneytown, Maryland. His neighbors described him as a good friend and neighbor who kept his personal and professional lives separate. Fred Gwynne died on July 2, 1993, in Taneytown, Maryland, after a battle with cancer of the pancreas. He was just eight days shy of turning 67 years old. He is sorely missed by Baby Boomers who grew up delighted by his Officer Francis Muldoon and Herman Munster and were gratified by his late-career renaissance on film.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxODI0OTk3N15BMl5BanBnXkFtZTgwMDE5NjU1MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001304","name":"Fred Gwynne","idIMDB":"nm0001304"},"actorId":"nm0001304","character":"Oscar Reo","urlCharacter":"http://www.imdb.com/character/ch0325477","main":true},{"actorName":"Margaret Whitton","urlProfile":"http://www.imdb.com/name/nm0926592","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NDU4MzcyMl5BMl5BanBnXkFtZTcwMTc1Njc1OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1949","placeOfBirth":" Meade, Maryland, USA","birthName":"Margaret Ann Whitton","height":"5' 4\" (1.63 m)","bio":"Actress Margaret Whitton came from the New York stage, performing in off-Broadway gems \"Baba Goya\" (1973) and \"Nourish the Beast\" (1973). She made her Broadway debut in \"Steaming\" (1982). She impressed in films as well, effectively cast as sexy and strong supporting characters in such movies as the prison drama Love Child (1982), the football dramedy The Best of Times (1986) with Robin Williams and Kurt Russell, and especially her breakout role in The Secret of My Succe$s (1987) in which she nearly stole the movie right from under Michael J. Fox as his hard-as-nails aunt-by-marriage. She complimented her success with a hilarious role as the widow-cum-baseball-team owner Rachel Phelps in Major League (1989) and its sequel and as the resilient mother to young Nick Stahl in Mel Gibson's directorial debut The Man Without a Face (1993). Margaret has worked on television, appearing in the soap operas One Life to Live (1968) and The Doctors (1963). Her career includes memorable roles, in A Fine Romance (1989) in which she starred as a bickering wife opposite the late Christopher Cazenove and the soap-opera spoof Good & Evil (1991), where she played against type as the \"good girl\" opposite the more wicked-minded Teri Garr. In made-for-television movies she is best known for her portrayal of the tough-as-nails attorney Leslie Abramson in Menendez: A Killing in Beverly Hills (1994). She has more recently appeared on Broadway in \"And the Apple Doesn't Fall...\" (1995) and the original, award-winning musical \"Marlene\" (1999), the story of legendary Marlene Dietrich that starred Siân Phillips. She has also made a name for herself as a theater director. Her directing credits include Marina Carr's \"Portia Coughlin\" (1996) and \"By the Bog of Cats\" (1998), and The Public Theater's production of \"Dirty Tricks\" (2004), starring Judith Ivey as Martha Mitchell. Margaret is the President of independent film producer Tashtego Films, and has directed her first feature film, A Bird of the Air (2011), starring Rachel Nichols and Jackson Hurst.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NDU4MzcyMl5BMl5BanBnXkFtZTcwMTc1Njc1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0926592","name":"Margaret Whitton","idIMDB":"nm0926592"},"actorId":"nm0926592","character":"Katrina Dougherty","urlCharacter":"http://www.imdb.com/character/ch0325478","main":true},{"actorName":"Tom Waits","urlProfile":"http://www.imdb.com/name/nm0001823","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MDcxMzExNV5BMl5BanBnXkFtZTcwNDgwNzQ0NA@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 December 1949","placeOfBirth":" Pomona, California, USA","birthName":"Thomas Alan Waits","height":"6' (1.83 m)","bio":"Thomas Alan Waits was born in Pomona, California, to schoolteachers Alma Fern (Johnson) and Jesse Frank Waits. Described as one of the last beatniks of the contemporary music, Waits in fact has two separate careers. From 1973 (LP \"Closing Time\") to 1983 (\"One From The Heart\" soundtrack), he recorded nine LPs for Asylum Records, writing songs mainly in the manner of Tin Pan Alley, mixing them with jazz and blues. Extraordinarily, he never produced a hit, but he earned a cult following all over the world. In 1983 he signed with Island Records, and released a series of albums that stunned the music world. Beginning with \"Swordfishtrombones\", he introduced a whole new orchestration, which included some of the instruments invented by Harry Partch. He found a new ground for his innovations, searching in sound fields that never before were searched. This second part of his career coincided with his marriage to Kathleen Brennan, a former writer for Francis Ford Coppola (Zoetrope (1999)). His LPs \"Rain Dogs\" (1985), \"Big Time\" (soundtrack) and \"The Black Rider\" are today what Kurt Weill's music was once. \"The Black Rider\" brings music written for the show directed by Bob Wilson and staged in Germany.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MDcxMzExNV5BMl5BanBnXkFtZTcwNDgwNzQ0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001823","name":"Tom Waits","idIMDB":"nm0001823"},"actorId":"nm0001823","character":"Rudy","urlCharacter":"http://www.imdb.com/character/ch0074522","main":true},{"actorName":"Jake Dengel","urlProfile":"http://www.imdb.com/name/nm0219039","urlPhoto":"","biography":{"dateOfBirth":"19 June 1933","placeOfBirth":" Wisconsin, USA","birthName":"Jacob Paul Dengel","bio":"Jake Dengel was born on June 19, 1933 in Wisconsin, USA as Jacob Paul Dengel. He was an actor, known for Ironweed (1987), Something Wicked This Way Comes (1983) and At Close Range (1986). He died on November 14, 1994 in Sherman Oaks, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0219039","name":"Jake Dengel","idIMDB":"nm0219039"},"actorId":"nm0219039","character":"Pee Wee","urlCharacter":"http://www.imdb.com/character/ch0325479","main":true},{"actorName":"Nathan Lane","urlProfile":"http://www.imdb.com/name/nm0001447","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwMTc1MjQ3NzFeQTJeQWpwZ15BbWU3MDEzNjEwODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 February 1956","placeOfBirth":" Jersey City, New Jersey, USA","birthName":"Joseph Lane","height":"5' 7\" (1.7 m)","bio":"Nathan Lane was born on February 3, 1956 in Jersey City, New Jersey, USA as Joseph Lane. He is an actor, known for The Lion King (1994), The Birdcage (1996) and The Producers (2005). He has been married to Devlin Elliott since November 17, 2015.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwMTc1MjQ3NzFeQTJeQWpwZ15BbWU3MDEzNjEwODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001447","name":"Nathan Lane","idIMDB":"nm0001447"},"actorId":"nm0001447","character":"Harold Allen","urlCharacter":"http://www.imdb.com/character/ch0325480","main":true},{"actorName":"James Gammon","urlProfile":"http://www.imdb.com/name/nm0304000","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MzIxNDE3MF5BMl5BanBnXkFtZTcwMjA3NDYyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1940","placeOfBirth":" Newman, Illinois, USA","birthName":"James Richard Gammon","height":"5' 11\" (1.8 m)","bio":"Rugged-looking James Gammon first broke into the entertainment industry not as an actor but as a TV cameraman. From there, his weatherbeaten features, somewhat menacing attitude and a tough-as-nails voice--the kind that used to be described in detective novels as \"whiskey-soaked\"--reminiscent of '40s noir icon Charles McGraw got him work in front of the cameras in TV westerns (though he sounds as if he's from Texas or Oklahoma, he was actually born and raised in Illinois) and he made his film debut in 1967. Not the kind of guy you'd see in a tuxedo in a Noël Coward drawing-room comedy--unless he was one of a gang holding them up--Gammon could play lighter parts also, as evidenced by his work as the manager in the baseball comedy Major League (1989) and in his regular role as Don Johnson's rambunctious father in Johnson's Nash Bridges (1996) series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MzIxNDE3MF5BMl5BanBnXkFtZTcwMjA3NDYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0304000","name":"James Gammon","idIMDB":"nm0304000"},"actorId":"nm0304000","character":"Reverend Chester","urlCharacter":"http://www.imdb.com/character/ch0094036","main":true},{"actorName":"Will Zahrn","urlProfile":"http://www.imdb.com/name/nm0952040","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMTUyNzMwNV5BMl5BanBnXkFtZTcwODkxMDEzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Will Zahrn is an actor, known for The Dark Knight (2008), L.A. Confidential (1997) and The Untouchables (1987).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMTUyNzMwNV5BMl5BanBnXkFtZTcwODkxMDEzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0952040","name":"Will Zahrn","idIMDB":"nm0952040"},"actorId":"nm0952040","character":"Rowdy Dick","urlCharacter":"http://www.imdb.com/character/ch0325481","main":true},{"actorName":"Laura Esterman","urlProfile":"http://www.imdb.com/name/nm0261644","urlPhoto":"","biography":{"dateOfBirth":"12 March 1945","placeOfBirth":" New York City, New York, USA","bio":"Laura Esterman was born on March 12, 1945 in New York City, New York, USA. She is an actress, known for Awakenings (1990), Addams Family Values (1993) and The Doors (1991).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0261644","name":"Laura Esterman","idIMDB":"nm0261644"},"actorId":"nm0261644","character":"Nora Lawlor","urlCharacter":"http://www.imdb.com/character/ch0325513","main":true},{"actorName":"Joe Grifasi","urlProfile":"http://www.imdb.com/name/nm0341055","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyODA3MTg1M15BMl5BanBnXkFtZTYwOTk3ODAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 June 1944","placeOfBirth":" Buffalo, New York, USA","birthName":"Joseph G. Grifasi","height":"5' 5¾\" (1.67 m)","bio":"Joe Grifasi was born on June 14, 1944 in Buffalo, New York, USA as Joseph G. Grifasi. He is an actor, known for The Deer Hunter (1978), Batman Forever (1995) and 13 Going on 30 (2004). He has been married to Jane Ira Bloom since 1974.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyODA3MTg1M15BMl5BanBnXkFtZTYwOTk3ODAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0341055","name":"Joe Grifasi","idIMDB":"nm0341055"},"actorId":"nm0341055","character":"Jack","urlCharacter":"http://www.imdb.com/character/ch0325512","main":true},{"actorName":"Hy Anzell","urlProfile":"http://www.imdb.com/name/nm0031742","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMDk1NDY5MV5BMl5BanBnXkFtZTgwMDI0NTI0MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1923","placeOfBirth":" New York City, New York, USA","bio":"Hy Anzell was born on September 7, 1923 in New York City, New York, USA. He was an actor, known for Annie Hall (1977), Radio Days (1987) and Crimes and Misdemeanors (1989). He died on August 23, 2003 in Fresno, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMDk1NDY5MV5BMl5BanBnXkFtZTgwMDI0NTI0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0031742","name":"Hy Anzell","idIMDB":"nm0031742"},"actorId":"nm0031742","character":"Rosskam","urlCharacter":"http://www.imdb.com/character/ch0325511","main":true}],"seasons":[],"idIMDB":"tt0093277","urlIMDB":"http://www.imdb.com/title/tt0093277","business":{"budget":{"money":"$27,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$36,973","country":"USA","day":"20","month":"12","year":"1987","remarks":"2 Screens"}],"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1987/\">1987</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 23 min (143 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Lenses and Panaflex Camera by Panavision"],"laboratory":["Technicolor, Hollywood (CA), USA (color)"],"filmLength":["3,913 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.8","filmingLocations":[{"location":"Lark Street and Clinton Ave, Albany, New York, USA"}],"rated":"R","awards":[{"award":"Academy Awards, USA 1988","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Actor in a Leading Role","names":[{"name":"Jack Nicholson","id":"nm0000197","role":null}]},{"category":"Best Actress in a Leading Role","names":[{"name":"Meryl Streep","id":"nm0000658","role":null}]}]}]},{"award":"Golden Globes, USA 1988","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Performance by an Actor in a Motion Picture - Drama","names":[{"name":"Jack Nicholson","id":"nm0000197","role":null}]}]}]},{"award":"Los Angeles Film Critics Association Awards 1987","titlesAwards":[{"titleAwardOutcome":"Won LAFCA Award","categories":[{"category":"Best Actor","names":[{"name":"Jack Nicholson","id":"nm0000197","role":null},{"name":"The Witches of Eastwick","id":"tt0094332","role":null}]}]}]},{"award":"Moscow International Film Festival 1989","titlesAwards":[{"titleAwardOutcome":"Nominated Golden St. George","categories":[{"category":"","names":[{"name":"Hector Babenco","id":"nm0002199","role":null}]}]}]},{"award":"New York Film Critics Circle Awards 1987","titlesAwards":[{"titleAwardOutcome":"Won NYFCC Award","categories":[{"category":"Best Actor","names":[{"name":"Jack Nicholson","id":"nm0000197","role":null},{"name":"The Witches of Eastwick","id":"tt0094332","role":null},{"name":"Broadcast News","id":"tt0092699","role":null}]}]}]}],"votes":"6,645","type":"Movie","companyCreditsSimple":[{"idCompany":"co0008693","name":"Home Box Office (HBO)"},{"idCompany":"co0009677","name":"Keith Barish Productions"},{"idCompany":"co0047779","name":"TAFT Entertainment Pictures"}],"keywords":{"keywords":["albany new york","drifter","cancer","singer","ghost","bar","vomiting","talking to the dead","one word title","resentment toward father","starvation","family relationships","urban setting","love","husband wife relationship","flashback","unconditional love","poverty","able to see the dead","schizophrenia","dead son","melancholy","great depression","compassion","guilt","stomach cancer","church","boarding house","loss of friend","bathtub","music store","vagrant","train","piano","melodrama","hospital","graveyard","baseball","baseball player","attic","alcoholism","1910s","1900s","1930s","accidental death","streetcar","trolley","pulitzer prize source","based on novel","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:36:48"}}