{"data":{"movies":[{"title":"The Horse Without a Head: The 100,000,000 Franc Train Robbery","originalTitle":"","year":"1963","releaseDate":"19630929","directors":[{"name":"Don Chaffey","id":"nm0149548"}],"writers":[{"name":"Paul Berna","id":"nm0075974"},{"name":"T.E.B. Clarke","id":"nm0165021"}],"runtime":"60 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMDc4OTk1NF5BMl5BanBnXkFtZTcwMjcxMjMzMQ@@._V1.jpg","countries":["UK","USA"],"languages":["English"],"genres":["Adventure","Biography","Drama","Family","Western"],"plot":"A group of French slum children who share only one toy -- a headless wooden horse on wheels -- foil a robbery when a thief stashes the key to his hiding place inside the horse...  »","simplePlot":"A group of French slum children who share only one toy -- a headless wooden horse on wheels -- foil a robbery when a thief stashes the key to his hiding place inside the horse... ","actors":[{"actorName":"Jean-Pierre Aumont","urlProfile":"http://www.imdb.com/name/nm0001922","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQzMTg4NTYxOF5BMl5BanBnXkFtZTgwNjg1MjA1MDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1911","placeOfBirth":" Paris, France","birthName":"Jean-Pierre Philippe Salomons","height":"6' (1.83 m)","bio":"Another in the long line of dramatically handsome foreign imports who made an immediate impact on WWII Hollywood was debonair French actor Jean-Pierre Aumont. The epitome of grace and sophistication, the stylish leading man went on to have a long and respectful career on stage, film and TV, both here and abroad. Aumont was born Jean-Pierre Philippe Salomons on January 5, 1911 (some sources list 1909) in Paris, France, to Suzanne (Cahen), an actress, and Alexandre Abraham Salomons, a well-to-do department store executive. His brother, François Villiers (né Francois Salomons), went on to become a film writer/director. His father was a Dutch Jew and his mother was from a French Jewish family; he was of both Ashkenazi and Sephardi ancestry. Jean-Pierre was transferred from various prep schools before enrolling at the Paris Conservatory of Dramatic Art at the age of 16. Run by the renowned Louis Jouvet, young Aumont's first two film roles were prime roles in Jean de la Lune (1931) and Échec et mat (1931). He then went on to appear strongly in a number of Gallic films. He also made an impressive theater debut playing the role of Oedipus in Jean Cocteau's \"La Machine Infernale\" at the Comedie Champs-Elysees in 1934, which set up a long and lucrative tenure on the stage. Splitting his time between live performances and film-making opposite such lovelies as Simone Simon, Danielle Darrieux and Annabella), Aumont served with the French Third Mechanized Division for nearly a year (1939-1940) and earned a medal of distinction for his valour (Croix de Guerre). Two of his finest screen roles came just prior to this: 'Marcel Carne''s farcical comedy Bizarre, Bizarre (1937) starring mentor Louis Jouvet, and the romantic drama Hôtel du Nord (1938) opposite the lovely Annabella and co-starring Jouvet again. Aumont arrived in America barely speaking English in 1942 and only a few days later was \"discovered\" by stage legend Katharine Cornell, making his American debut in her production of \"Rose Burke\". During the play's Los Angeles engagement, he was signed by MGM for films and made a noticeable debut as Captain Pierre Matard in the espionage war picture Assignment in Brittany (1943) co-starring the tragic Susan Peters. Classily promoted as an up-and-coming Jean Gabin, the lithe, handsome, blue-eyed blond captured the admiration of the American public with his Charles Boyer-like charm and charisma. His second American film was the equally successful The Cross of Lorraine (1943), a dramatic Stalag 17-like story of French POW's held in a German war camp. The lovely Technicolor siren Maria Montez, known for her popular (and campy) WWII escapism films at Universal, quickly caught his eye and the couple married in 1943 after only a three-month courtship. An earlier marriage to French's Blanche Montel had ended in divorce in 1940, well before his arrival in America. Aumont again interrupted his burgeoning acting career by serving with the Free French forces in North Africa and was again awarded a medal (Legion of Honor) for his bravery. He was twice wounded during his active years of service. The French actor returned to Hollywood films after the war co-starring with Ginger Rogers in the comedy Heartbeat (1946) and appearing as composer Nikolai Rimsky-Korsakov in Universal's Song of Scheherazade (1947). The reception to both were lukewarm and Aumont decided to return to France with his wife (whose career was now in decline), and his daughter (who was born in 1946 and grew up to become the actress Tina Aumont). Seeking to rediscover his earlier glory in European films and the theatre, he also began writing plays. Now and then he would return to the American soil and appeared on Broadway in 1949 with his work \"Figure of a Girl,\" which was retitled \"My Name Is Aquilon\" by the time it arrived on the Great White Way. While it co-starred the embraceable Lilli Palmer, who was also making her Broadway debut, the play itself was not as embraced. On the international film scene, Aumont appeared with wife Maria in such uninspired offerings as the United Artist escapist fare Siren of Atlantis (1949), the French crime drama Wicked City (1949) [Wicked City] and the Italian adventure La vendetta del corsaro (1951)_ [The Revenge of the Pirates], the last-mentioned proving to be the last for the fetching Ms. Montez. The 39-year-old star tragically drowned in September of 1951 after her hot mineral salt bath triggered a heart seizure. After a period of grieving, Aumont continued transcontinentally, but rather unspectacularly, with acting parts that seemed hardly challenging. He cavorted with Paulette Goddard in the mediocre action adventure Charge of the Lancers (1954); appeared among an international cast in the spectacle Napoleon (1955); co-starred rather stiffly opposite Jean Simmons in the glossy \"sudspenser\" Hilda Crane (1956); was overshadowed by Eleanor Parker, who paled next to Garbo in the remake of Garbo's \"The Painted Veil\" entitled The Seventh Sin (1957); and, played a cameo as the doomed Louis XVI in the US-based John Paul Jones (1959) co-starring wife Marisa. On a more positive note, he, Mel Ferrer and the ever-enchanting Leslie Caron were wonderful in MGM's touching musical Lili (1953). Aumont also fared much better in his 1950s televised appearances of classic works, notably \"Arms and the Man\" and \"Crime and Punishment\". Following a torrid 1955 romance with Grace Kelly (whom, as we all know, went on to marry her Prince), the actor met and married lovely Italian actress Marisa Pavan, the sister of the late Pier Angeli, in 1956, and had two sons, Jean-Claude and Patrick, by her. Troubled by his erratic output and the uneventful film roles offered, which included those in The Enemy General (1960), The Devil at 4 O'Clock (1961) and Le couteau dans la plaie (1962) [Five Miles to Midnight], Aumont wisely refocused on the theatre and his playwriting skills. Stage performances included \"The Heavenly Twins\" and \"A Second String\" (both on Broadway), the title role in \"The Affairs of Anatol\", \"Murderous Angels\" and appearances in the musicals \"Tovarich\" with Vivien Leigh (on Broadway), \"Jacques Brel Is Alive and Well and Living in Paris,\" \"South Pacific\" (as the debonair Emile DeBecque), and \"Gigi\" with wife Marisa. The couple also went on to form a warmly-received nightclub act in New York. For the remainder of his career, Aumont remained the ever-charming and worldly continental, vacillating between the stage (\"Camino Real,\" \"Private Lives,\" \"The Sound of Music\" and \"Tiger at the Gates\"); international films (Castle Keep (1969), Catherine & Co. (1975), Mahogany (1975), Nana, the True Key of Pleasure (1983), Sweet Country (1987), Becoming Colette (1991) and a pair of Merchant/Ivory films Jefferson in Paris (1995) and The Proprietor (1996)): and classy TV fare (The Memory of Eva Ryker (1980), Great Performances: Melba (1988), A Tale of Two Cities (1989)). Some of the actor's finest movie roles in years occurred in the 1970s with the excellent Day for Night (1973) [Day for Night] and Cat and Mouse (1975) [Cat and Mouse]. The distinguished actor/playwright went awardless throughout his cinematic career but this glaring oversight was finally rectified in the form of the cross of Commandeur des Arts et des Lettres in 1991 and an honorary César Award in 1992. He died in his native country of a heart attack a few weeks after his 90th birthday in 2001.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQzMTg4NTYxOF5BMl5BanBnXkFtZTgwNjg1MjA1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001922","name":"Jean-Pierre Aumont","idIMDB":"nm0001922"},"actorId":"nm0001922","character":"Inspector Sinet","urlCharacter":"http://www.imdb.com/character/ch0193810","main":true},{"actorName":"Herbert Lom","urlProfile":"http://www.imdb.com/name/nm0007042","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg5OTc0OTA3Ml5BMl5BanBnXkFtZTcwOTIyOTYyMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1917","placeOfBirth":" Prague, Bohemia, Austria-Hungary [now Czech Republic]","birthName":"Herbert Charles Angelo Kuchacevich ze Schluderpacheru","height":"5' 7¾\" (1.72 m)","bio":"Born September 11, 1917, Herbert Lom made his film debut in the Czech film Woman Below the Cross (1937) and played supporting and, occasionally, lead roles. His career picked up in the 1940s and he played, among other roles, Napoleon Bonaparte in The Young Mr. Pitt (1942) (and, again, in War and Peace (1956)). In a rare starring role, Lom played twin trapeze artists in Dual Alibi (1947). He continued into the 1950s with roles opposite Alec Guinness and Peter Sellers in The Ladykillers (1955) and Robert Mitchum, Jack Lemmon and Rita Hayworth in Fire Down Below (1957). His career really took off in the 1960s and he got the title role in Hammer Films' production of The Phantom of the Opera (1962). He also played \"Captain Nemo\" in Mysterious Island (1961) and landed supporting parts in Le Cid (1961) and an especially showy role in Spartacus (1960) as a pirate chieftain contracted to transport Spartacus' army away from Italy. The 1960s was also the decade in which Lom secured the role for which he will always be remembered: Peter Sellers' long-suffering boss, Commissioner Charles Dreyfus, in the \"Pink Panther\" films, in which he pulled off the not-inconsiderable feat of stealing almost every scene he and Sellers were in--a real accomplishment, considering what a veteran scene-stealer Sellers was. However, Lom did not concentrate solely on a film career. He had become a familiar face to British television viewers when he starred as Dr. Roger Corder in the series The Human Jungle (1963). He moved into horror films in the 1970s, with parts in Asylum (1972) and And Now the Screaming Starts! (1973). He played Prof. Abraham Van Helsing opposite Christopher Lee in Count Dracula (1970), matching wits against the sinister vampire himself. Lom appeared as one of the ten victims in Ten Little Indians (1974), playing the drunken Dr. Edward Armstrong. His career continued into the 1980s, a standout role being that of Christopher Walken's sympathetic doctor in The Dead Zone (1983). He also played opposite Walter Matthau in Hopscotch (1980) and returned to the murder mystery Ten Little Indians (1989), this time playing The General. Lom has been taking it easy since then, though he returned to his familiar role of Commissioner Dreyfus in Le fils de la panthère rose (1993). He has always been a reliable and eminently watchable actor, unfortunately not receiving the stardom he probably should have. Herbert Lom died in his sleep at age 95 on September 27, 2012, in London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg5OTc0OTA3Ml5BMl5BanBnXkFtZTcwOTIyOTYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0007042","name":"Herbert Lom","idIMDB":"nm0007042"},"actorId":"nm0007042","character":"Schiapa","urlCharacter":"http://www.imdb.com/character/ch0114067","main":true},{"actorName":"Leo McKern","urlProfile":"http://www.imdb.com/name/nm0571674","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjQzODUxMV5BMl5BanBnXkFtZTcwOTI1MDAxMw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 March 1920","placeOfBirth":" Sydney, New South Wales, Australia","birthName":"Reginald McKern","height":"5' 6\" (1.68 m)","bio":"Although he sounded very British, Leo McKern was an Australian. By the time he was 15 years old, he had endured an accident that left him without his left eye. A glass eye replaced it - one might conjecture for the better, as far as making McKern a one-day actor of singular focus (no pun intended; his face had that extremely focused look). He failed to complete Sydney Technical High School, though his interest in engineering prompted him to transfer into the role of engineering apprentice (1935 to 1937). He expanded his horizons in a different direction with a two-year stint (1937-1940) at a commercial art college. By then World War II was escalating toward Australia, and he volunteered for service with the Engineering Corp of the Australian Army (1940 to 1942). But yet one more career move was needed, and that while the war moved northward away from Australia when America joined the fight. He studied acting and debuted on stage in 1944. He also met an Australian stage actress (Jane Holland), and mutual attraction took its course. In 1946 she had acting opportunities in England, and McKern decided that, along with the wish to propose to her, his own future as an actor lay there also. McKern was short and stout with a great bulbous nose upon an impish face--all the ingredients for great character. His voice was a sharp and vociferous grind upon the back teeth--also perfect for character. After some touring (which included a trip to post-war Germany), he began to appear with regularity on London's premiere stages, particularly the Old Vic (1949-52 and then again 1962-63). These roles meshed with classic English work when he moved on to the Royal Shakespeare Company (RSC) at Stratford-upon-Avon and the Shakespeare Memorial Theater (later reconstituted as the now Royal Shakespeare Theater) from 1952 to 1954. He also spent a season at the New Nottingham Playhouse. He had weaned himself off his Australian accent long before this with his bid for film roles, the first being as one of the four murderous barons in the Thomas a' Becket story Murder in the Cathedral (1951). And he kept his medieval tights on for his next screen appearances (though the small screen of TV) in some roles for the popular Richard Greene series The Adventures of Robin Hood in 1955, while he continued stage work. From then on, McKern had roles in two to three movies a year--busy but not too busy--gradually mixing progressively more and more TV work in the 1950s, 1960s, and 1970s. The films were as varied as a good stage actor could justify moving into a popular medium. Though he was usually police officials, doctors, and authoritative figures, he always made these early parts stand out. Drama comes in various packages; he was not averse to the rise of sci-fi as a vehicle for it. He graced two British sci-fi classics: X the Unknown (1956) and the better The Day the Earth Caught Fire (1961). And there was also TV fantasy work, one of the best known examples being multiple outings as interrogator and chain-yanker Number Two in The Prisoner series. In the late '70s, he condescended to add some weight to two of the Omen movies, as did Gregory Peck and William Holden, putting him in good company. Great drama was McKern's meat. And doing some historically significant on a great scale was an opportunity for a Shakespearean not to miss. He was cast in the screen version of the Robert Bolt hit play A Man for All Seasons (1966). And his visage was perhaps part of the allure. Cast as ruthless political climber and fated chancellor of England Thomas Cromwell, McKern looked like the Hans Holbein court painting of the man who rather nefariously succeeded to Sir Thomas More's position. More was played by McKern's fellow RSC resident Paul Scofield. McKern gave flesh to the commoner Cromwell, making him loud and abrasive with a delightful verve. Later he and Scofield shared another film role, in the sense that the latter turned down the part of Thomas Ryan in the David Lean epic of Ireland Ryan's Daughter (1970), while McKern accepted it and made the role work. (Scofield would have been a miscast, something he probably wisely foresaw.) McKern, from his early screen roles, could do comedy. He had a fair share of outrageous characters, and he could play them with a glint in his eye and a bit of extra cheek in his performance to show that he must have had fun in the role. In this regard, he showed his stuff supporting Peter Sellers in the endearing The Mouse That Roared (1959) and had the lead in the outlandish They All Died Laughing (1964) as a college professor who decides to snuff out humanity with poison laughing gas. He was a broad country fellow with a Shakespearean twist as Squint in The Amorous Adventures of Moll Flanders (1965). In one of his later comedies, he is rather overlooked because of its clever script; in fact, it is an over-the-top tour de force for McKern. As the infamous nemesis Professor Moriarty in The Adventure of Sherlock Holmes' Smarter Brother (1975), McKern manages to steal the show from funny man and director/writer Gene Wilder along with Marty Feldman and Roy Kinnear. McKern's Moriarty is devilish but tongue-in-cheek with a vengeance, especially with his nervous tic of suddenly, at any time and out of nowhere, yelling, \"YAAA, YAAA!\" Yet McKern's chief legacy has been and probably will continue to be his long-running TV role in more mystery (he had done his fair share in film and TV already) as Horace Rumpole in \"Rumpole of the Bailey\" (1978-1992), a role originally introduced by him in the teleplay \"Rumpole of the Bailey\" in 1975. The role had been specifically created for him by writer John Mortimer, and though every actor can appreciate the security of a long-running role, McKern feared that it was subsuming his more than considerable body of work. Along with that, McKern became increasingly self-conscious of his acting, and mixed in was the idea that his physical appearance was not appealing to the public. As a result, he had to deal with a progressively increasing stage fright. He need not have worried; he was working in diverse TV and movie roles nearly to the time of his passing, and he was beloved by movie and TV fans alike. Along with receiving the award of Officer of the Order of Australia from his home country, in 1983 McKern's memoir \"Just Resting\" was published.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjQzODUxMV5BMl5BanBnXkFtZTcwOTI1MDAxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0571674","name":"Leo McKern","idIMDB":"nm0571674"},"actorId":"nm0571674","character":"Roublot","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pamela Franklin","urlProfile":"http://www.imdb.com/name/nm0291512","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTJhMWUwZjYtYzliNy00NGQyLThhNzQtNTI4ZTYzMWVjZDBmXkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 February 1950","placeOfBirth":" Yokohama, Japan","height":"5' (1.52 m)","bio":"British actress Pamela Franklin has worked with many notable actors and directors throughout her career. A somewhat underrated actress, she had a wide range of emotions that she brought to her many versatile characters. Franklin was born in Yokohama, Japan, and her father was an importer/exporter. She initially studied dance at the Elmhurst School of Ballet in England (now the Elmhurst School for Dance). She made her film debut at age 11 as \"Flora\" in The Innocents (1961) alongside Deborah Kerr and a year later appeared as \"Tina\" in The Lion (1962) with William Holden and Trevor Howard. She has worked with many directors including Ronald Neame, Jack Clayton, and John Huston. Franklin is most remembered for her performance as the rebellious \"Sandy\" in the The Prime of Miss Jean Brodie (1969) which starred Maggie Smith and also as the hapless kidnap victim in The Night of the Following Day (1968) in which she appeared with Marlon Brando and Rita Moreno. Franklin later carved out a niche as a \"scream queen\" in a handful of 1970s horror features. She portrayed the psychic medium in The Legend of Hell House (1973) which also featured Roddy McDowall. For many years, Franklin made several guest appearances on hit TV shows. In the early 1970s, she married actor Harvey Jason whom she met on the set of Necromancy (1972) and had two children. Franklin retired from acting in the early 1980s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTJhMWUwZjYtYzliNy00NGQyLThhNzQtNTI4ZTYzMWVjZDBmXkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0291512","name":"Pamela Franklin","idIMDB":"nm0291512"},"actorId":"nm0291512","character":"Marian","urlCharacter":"http://www.imdb.com/character/ch0003911","main":true},{"actorName":"Vincent Winter","urlProfile":"http://www.imdb.com/name/nm0935844","urlPhoto":"","biography":{"dateOfBirth":"29 December 1947","placeOfBirth":" Aberdeen, Aberdeenshire, Scotland, UK","bio":"Vincent Winter was born on December 29, 1947 in Aberdeen, Aberdeenshire, Scotland. He was an actor and production manager, known for Indiana Jones and the Temple of Doom (1984), For Your Eyes Only (1981) and Superman (1978). He died on November 2, 1998 in Chertsey, Surrey, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0935844","name":"Vincent Winter","idIMDB":"nm0935844"},"actorId":"nm0935844","character":"Fernand","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lee Montague","urlProfile":"http://www.imdb.com/name/nm0598777","urlPhoto":"","biography":{"dateOfBirth":"16 October 1927","placeOfBirth":" Bow, London, England, UK","height":"5' 10\" (1.78 m)","bio":"Lee Montague was born on October 16, 1927 in Bow, London, England. He is an actor, known for Mahler (1974), Brother Sun, Sister Moon (1972) and Billy Budd (1962). He is married to Ruth Goring. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0598777","name":"Lee Montague","idIMDB":"nm0598777"},"actorId":"nm0598777","character":"Mallart","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Denis Gilmore","urlProfile":"http://www.imdb.com/name/nm0319514","urlPhoto":"","biography":{"dateOfBirth":"14 August 1949","placeOfBirth":" Hillingdon, Middlesex, England, UK","bio":"Denis Gilmore was born on August 14, 1949 in Hillingdon, Middlesex, England. He is an actor, known for Mike (1964), The Tomb of Ligeia (1964) and Made in Dagenham (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0319514","name":"Denis Gilmore","idIMDB":"nm0319514"},"actorId":"nm0319514","character":"Tatave","urlCharacter":"http://www.imdb.com/character/ch0114066","main":true},{"actorName":"Sean Keir","urlProfile":"http://www.imdb.com/name/nm0445150","urlPhoto":"","biography":{"bio":"Sean Keir is an actor, known for Greyfriars Bobby: The True Story of a Dog (1961) and Walt Disney's Wonderful World of Color (1954).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0445150","name":"Sean Keir","idIMDB":"nm0445150"},"actorId":"nm0445150","character":"Bon-Bon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Loretta Parry","urlProfile":"http://www.imdb.com/name/nm0663672","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2Mzg2NTAyN15BMl5BanBnXkFtZTcwMjgyNzIxNw@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"bio":"Loretta Parry is an actress, known for Hand in Hand (1961), Go to Blazes (1962) and No Time for Tears (1957).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2Mzg2NTAyN15BMl5BanBnXkFtZTcwMjgyNzIxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0663672","name":"Loretta Parry","idIMDB":"nm0663672"},"actorId":"nm0663672","character":"Melie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Gwynn","urlProfile":"http://www.imdb.com/name/nm0350372","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzkxNGM1Y2EtM2E2Ny00ZTQwLTg2YTQtZjA5NTYzMzVmNzMzXkEyXkFqcGdeQXVyNTAyNDQ2NjI@._V1_UY44_CR19,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1916","placeOfBirth":" Bath, Somerset, England, UK [now Bath and North East Somerset, England, UK]","height":"6' 4\" (1.93 m)","bio":"Michael Gwynn was born on November 30, 1916 in Bath, Somerset, England. He was an actor, known for Village of the Damned (1960), Jason and the Argonauts (1963) and Cleopatra (1963). He died on January 29, 1976 in London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzkxNGM1Y2EtM2E2Ny00ZTQwLTg2YTQtZjA5NTYzMzVmNzMzXkEyXkFqcGdeQXVyNTAyNDQ2NjI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0350372","name":"Michael Gwynn","idIMDB":"nm0350372"},"actorId":"nm0350372","character":"Gendarme","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Butterworth","urlProfile":"http://www.imdb.com/name/nm0125350","urlPhoto":"","biography":{"dateOfBirth":"4 February 1919","placeOfBirth":" Bramhall, Cheshire, England, UK","birthName":"Peter William Shorrocks Butterworth","bio":"Peter Butterworth's promising career in the British Navy ended when the plane in which he was traveling was shot down by the Germans in WW II and he was placed in a POW camp. There he became close friends with Talbot Rothwell (later a writer on the \"Carry On\" series, on which Butterworth often worked) and the two began writing and performing sketches for camp shows to entertain the prisoners (and to cover up the noise of other prisoners digging escape tunnels). After the war Butterworth decided to continue his acting career, and soon became a familiar character actor in both films and television. He specialized in playing gentle, well-meaning but somewhat eccentric characters (which, by most accounts, is what he was in real life). He was married to impressionist Janet Brown, and their son, Tyler Butterworth, also became an actor. Butterworth died suddenly in 1979, as he was waiting in the wings to go onstage in a pantomime show.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0125350","name":"Peter Butterworth","nicknames":["Butterscotch"],"idIMDB":"nm0125350"},"actorId":"nm0125350","character":"Zigon","urlCharacter":"http://www.imdb.com/character/ch0172679","main":true},{"actorName":"Peter Vaughan","urlProfile":"http://www.imdb.com/name/nm0891092","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NDY4MzI5NV5BMl5BanBnXkFtZTcwMTk0ODg5NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1923","placeOfBirth":" Wem, Shropshire, England, UK","birthName":"Peter Ewart Ohm","height":"6' (1.83 m)","bio":"A true character actor in the best sense of the word, offbeat British thespian Peter Vaughan's hefty frame could appear intimidating or marshmallow benevolent; his beady, hollow eyes menacing or tender; his mere presence menacing or avuncular. Adept at playing both sides of the law, his characters usually possessed a strange, somewhat wary countenance that seemed to keep his audience slightly off balance. A homely sort with a bloated face, jutting chin, sliver lips and pronounced nose, this veteran has been a stalwart presence for nearly fifty years. Born Peter Ohm in 1923, he began on the stage and didn't enter films until 1959, well into his thirties. Married in 1952 to rising actress Billie Whitelaw, Peter was primarily in the background at first, offering a cheapjack gallery of thugs, unsmiling cops, and foreign agents in movies. An easily unsympathetic bloke, he played unbilled policemen in his first two films, then slowly gravitated up the credits list. He appeared as the chief of police in the spy drama The Devil's Agent (1962), which also featured his wife, and then gained a bit more attention in a prime part as an offbeat insurance investigator in the B movie Smokescreen (1964), a role that propelled him into the higher ranks. Noticeably shady roles came with playing Tallulah Bankhead's seedy handyman who meets a fatal end in the Gothic horror Die! Die! My Darling! (1965) [aka Die! Die! My Darling!]; his villainous roles in the spy thrillers The Naked Runner (1967) opposite Frank Sinatra and The Man Outside (1967); a German thug in A Twist of Sand (1968); and Sgt. Walker in The Bofors Gun (1968). Divorced from Whitelaw in 1966, he later married actress Lillias Walker, who had roles in a couple of his pictures: Malachi's Cove (1973) and Intimate Reflections (1974). TV became a large source of income for Vaughan in the 1970s, particularly in his role of Grouty in Porridge (1974) on both the large and small screen, and his quirky demeanor fitted like a glove for bizarre director Terry Gilliam, who cast him as the Ogre in Time Bandits (1981) and then as Mr. Helpman in Brazil (1985). For the past few decades he has maintained a healthy balance between film (including standout roles in Zulu Dawn (1979), The Remains of the Day (1993) and The Life and Death of Peter Sellers (2004)) and TV mini-movies, both contemporary and period. He was still performing into his 90s: his final role was Maester Aemon Targaryen in HBO's Game of Thrones (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NDY4MzI5NV5BMl5BanBnXkFtZTcwMTk0ODg5NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0891092","name":"Peter Vaughan","idIMDB":"nm0891092"},"actorId":"nm0891092","character":"Police Sergeant","urlCharacter":"http://www.imdb.com/character/ch0446807","main":true},{"actorName":"Jack Rodney","urlProfile":"http://www.imdb.com/name/nm0734934","urlPhoto":"","biography":{"dateOfBirth":"1916","placeOfBirth":"","bio":"Jack Rodney was born in 1916. He was an actor, known for Time Slip (1953), Concrete Jungle (1960) and A Comedy of Good and Evil (1948). He died on February 20, 1967 in London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0734934","name":"Jack Rodney","idIMDB":"nm0734934"},"actorId":"nm0734934","character":"Pepe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maxwell Shaw","urlProfile":"http://www.imdb.com/name/nm0789871","urlPhoto":"","biography":{"dateOfBirth":"21 February 1929","placeOfBirth":" London, England, UK","bio":"Maxwell Shaw was born on February 21, 1929 in London, England. He was an actor, known for The Oblong Box (1969), Start the Revolution Without Me (1970) and Once More, with Feeling! (1960). He was married to Rose Tobias Shaw. He died on August 21, 1985 in London.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0789871","name":"Maxwell Shaw","idIMDB":"nm0789871"},"actorId":"nm0789871","character":"Cesar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jenny Laird","urlProfile":"http://www.imdb.com/name/nm0481966","urlPhoto":"","biography":{"dateOfBirth":"13 February 1912","placeOfBirth":" Chorlton, Manchester, England, UK","birthName":"Phyllis Edith Mary Blythe","height":"5' 4\" (1.63 m)","bio":"Jenny Laird was born on February 13, 1912 in Chorlton, Manchester, England as Phyllis Edith Mary Blythe. She was an actress and writer, known for Black Narcissus (1947), Village of the Damned (1960) and The Girl of the Canal (1945). She was married to John Fernald. She died on October 31, 2001 in Camden, London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0481966","name":"Jenny Laird","idIMDB":"nm0481966"},"actorId":"nm0481966","character":"Madame Fabert","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0057157","urlIMDB":"http://www.imdb.com/title/tt0057157","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr (60 min)","1 hr 29 min (89 min) (Netherlands)"],"soundMix":["Mono (RCA Sound Recording)"],"color":["Color (Technicolor)"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.4","filmingLocations":[],"rated":"UNRATED","awards":[],"votes":"85","type":"TV Episode","seasonInfo":{"tvSerie":{"name":"Walt Disney's Wonderful World of Color","id":"tt0046593"},"season":"Season 10","episode":"Episode 1"},"companyCreditsSimple":[{"idCompany":"co0098836","name":"Walt Disney Productions"}],"keywords":{"keywords":["family relationships","rocking horse","youth","based on novel","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:07:41"}}