{"data":{"movies":[{"title":"Out on a Limb","originalTitle":"","year":"1987–","releaseDate":"19870118","writers":[],"runtime":"235 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MTEzODQ2M15BMl5BanBnXkFtZTcwNTgzNzAyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Biography","Drama","Romance"],"plot":"Shirley MacLaine plays herself in this TV mini-series based on her autobiographical best-seller which delves into her new age beliefs and its effects on her personal and public lives. John Heard portrays a composite role of her many spiritual and personal advisors.","simplePlot":"The supposed true story of Shirley MacClaine's experience with a spiritual awakening.","actors":[{"actorName":"Shirley MacLaine","urlProfile":"http://www.imdb.com/name/nm0000511","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MTE5MjQ1MF5BMl5BanBnXkFtZTYwMzU2MDg1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 April 1934","placeOfBirth":" Richmond, Virginia, USA","birthName":"Shirley MacLean Beaty","height":"5' 7\" (1.7 m)","bio":"Shirley MacLaine was born Shirley MacLean Beaty in Richmond, Virginia. Her mother, Kathlyn Corinne (MacLean), was a drama teacher from Nova Scotia, Canada, and her father, Ira Owens Beaty, a professor of psychology and real estate agent, was from Virginia. Her brother, Warren Beatty, was born on March 30, 1937. Her ancestry includes English and Scottish. Shirley was the tallest in her ballet classes at the Washington School of Ballet. Just after she graduated from Washington-Lee High School, she packed her bags and headed for New York. While auditioning for Richard Rodgers and Oscar Hammerstein II's \"Me and Juliet\", the producer kept mispronouncing her name. She then changed her name from Shirley MacLean Beaty to Shirley MacLaine. She later had a role in \"The Pajama Game\", as a member of the chorus and understudy to Carol Haney. A few months into the run, Shirley was going to leave the show for the lead role in \"Can-Can\" but ended up filling in for Haney, who had broken her ankle and could not perform. She would fill in for Carol, again, three months later, following another injury, the very night that movie producer Hal B. Wallis was in the audience. Wallis signed MacLaine to a five-year contract to Paramount Pictures. Three months later, she was off to shoot The Trouble with Harry (1955). She then took roles in Hot Spell (1958) and Around the World in Eighty Days (1956), completed not too long before her daughter, Sachi Parker (born Stephanie), was born. With Shirley's career on track, she played one of her most challenging roles: \"Ginny Moorhead\" in Some Came Running (1958), for which she received her first Academy Award nomination for Best Actress. She went on to do The Sheepman (1958) and The Matchmaker (1958). In 1960, she got her second Academy Award nomination for The Apartment (1960). Three years later, she received a third nomination for Irma la Douce (1963). In 1969, she brought her friend Bob Fosse from Broadway to direct her in Sweet Charity (1969), from which she got her \"signature\" song, \"If My Friends Could See Me Now\". After a five-year hiatus, Shirley made a documentary on China called The Other Half of the Sky: A China Memoir (1975), for which she received an Oscar nomination for best documentary. In 1977, she got her fourth Best Actress Oscar nomination for The Turning Point (1977). In 1979, she worked with Peter Sellers in Being There (1979), made shortly before his death. After 20 years in the film industry, she finally took home the Best Actress Oscar for Terms of Endearment (1983). After a five-year hiatus, Shirley made Madame Sousatzka (1988), a critical and financial hit that took top prize at the Venice Film Festival. In 1989, she starred with Dolly Parton, Sally Field and Julia Roberts in Steel Magnolias (1989). She received rave reviews playing Meryl Streep's mother in Postcards from the Edge (1990) and for Guarding Tess (1994). In 1996, she reprised her role from \"Terms of Endearment\" as \"Aurora Greenway\" in The Evening Star (1996), which didn't repeat its predecessor's success at the box office. In mid-1998, she directed Bruno (2000), which starred Alex D. Linz. In February 2001, Shirley worked with close friends once again in These Old Broads (2001), and co-starred with Julia Stiles in Carolina (2003) and with Kirstie Alley in Salem Witch Trials (2002). MacLaine as her own website which includes her own radio show and interviews, the Encounter Board, and Independent Expression, a members-only section of the site. In the past few years, Shirley starred in a CBS miniseries based on the life of cosmetics queen Mary Kay Ash--The Battle of Mary Kay (2002), and wrote two more books, \"The Camino\" in 2001, and \"Out On A Leash\" in 2003. After taking a slight hiatus from motion pictures, Shirley returned with roles in the movies that were small, but wonderfully scene-stealing: Bewitched (2005) with Nicole Kidman and Will Ferrell, In Her Shoes (2005) with Cameron Diaz and Toni Collette, in which Shirley was nominated for a Golden Globe in the best supporting actress category, and Rumor Has It... (2005) with Jennifer Aniston and Kevin Costner. Shirley completed filming of Closing the Ring (2007), directed by Sir Richard Attenborough, in 2007. Her latest book is entitled \"Sage-ing While Ag-ing\"; Shirley's latest film is Valentine's Day (2010), which debuted in theaters on February 12, 2010.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MTE5MjQ1MF5BMl5BanBnXkFtZTYwMzU2MDg1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000511","name":"Shirley MacLaine","idIMDB":"nm0000511"},"actorId":"nm0000511","character":" Shirley MacLaine","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Dance","urlProfile":"http://www.imdb.com/name/nm0001097","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzY0Mjg4MzM0Ml5BMl5BanBnXkFtZTcwODc4NTIxNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1946","placeOfBirth":" Redditch, Worcestershire, England, UK","birthName":"Walter Charles Dance","height":"6' 3\" (1.91 m)","bio":"Charles Dance is an English actor, screenwriter, and film director. Dance typically plays assertive bureaucrats or villains. Some of his most high-profile roles are Tywin Lannister in HBO's Game of Thrones (2011), Guy Perron in The Jewel in the Crown (1984), Sardo Numspa in The Golden Child (1986), Dr. Jonathan Clemens in Alien 3 (1992), Benedict in Last Action Hero (1993), the Master Vampire in Dracula Untold (2014), Lord Havelock Vetinari in Terry Pratchett's Going Postal (2010) and Alastair Denniston in The Imitation Game (2014). He played the role of Tywin Lannister in HBO's Game of Thrones (2011), based on the Song of Ice and Fire novels by George R. R. Martin. In 1989, he played Bond creator Ian Fleming in Anglia Television's drama biography.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzY0Mjg4MzM0Ml5BMl5BanBnXkFtZTcwODc4NTIxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001097","name":"Charles Dance","idIMDB":"nm0001097"},"actorId":"nm0001097","character":" Gerry Stamford","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Heard","urlProfile":"http://www.imdb.com/name/nm0001334","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzczODkyNzY4OV5BMl5BanBnXkFtZTcwNTU0NjQzMQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 March 1945","placeOfBirth":" Washington, District of Columbia, USA","height":"5' 9¼\" (1.76 m)","bio":"John Heard is a very talented actor who established himself in the late 1970s and early '80s with roles in the movies Between the Lines (1977), Chilly Scenes of Winter (1979) (a.k.a. \"Head Over Heels\"), and Heart Beat (1981) (in which he played Jack Kerouac to Nick Nolte's Neal Cassady and Sissy Spacek's Carolyn Cassady) before giving a tour de force performance as a hideously wounded (both physically and psychologically) Vietnam veteran in Cutter's Way (1981) (a.k.a. \"Cutter and Bone\") opposite Jeff Bridges. He also shined as Reverend Dimmesdale (one of America's first religious hypocrites) in the 1979 PBS version of Nathaniel Hawthorne's The Scarlet Letter (1979). Both \"Chilly Scenes of Winter\" and Cutter's Way\" (originally released as \"Head Over Heels\" and \"Cutter and Bone\", respectively) had been re-released under new titles after failing in their first go-rounds, such was the quality of the films. The two re-releases helped redefine the practice by which major studios handled smaller, art house quality pictures by releasing them carefully to select theaters with bespoke marketing campaigns so they reached the proper audience. (Studios would later develop their own art film-independent film subsidiaries to handle such pictures, so they didn't \"fall through the cracks\" like the first releases of the two Heard films.) By the early 1980s John Heard seemed on his way to establishing himself as a major American actor if not on the path to movie stardom. At the time, there was joke that involved confusing Heard with John Hurt and William Hurt because of the similarity of their last names. At the time these contemporaries were considered equal in terms of their star power. That was 30 years ago. William Hurt (the erstwhile husband of Heard's \"Head Over Heels\" co-star Mary Beth Hurt) went on to win a Best Actor Oscar as well as enjoy leading man status as a movie star in the mid- to late-'80s before he flared out in the early 1990s. John Hurt become one of the most respected actors of his generation, nominated twice for the Academy Award. Among Heard's co-stars of his early endeavors, Bridges and Spacek also went on to win Oscars and Nolte has been a multiple nominee. In the early '80s it would not have been unreasonable to predict that Heard himself would become an Oscar winner or a multiple nominee. That didn't happen. (He did get nominated for an Emmy for his turn as a corrupt police detective on The Sopranos (1999).) Heard now is best known for his two turns as Macaulay Culkin's father in the Home Alone (1990) movies. In the 1980s he continued to work on A-List projects, playing the not-so-sympathetic son to Geraldine Page in The Trip to Bountiful (1985) (for which Page won her own Oscar) and Tom Hanks's adult rival in Big (1988) (for which Hanks won his first Oscar nomination), but this meant that by the latter part of the decade he had failed to establish himself as a leading man and was doing supporting roles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzczODkyNzY4OV5BMl5BanBnXkFtZTcwNTU0NjQzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001334","name":"John Heard","idIMDB":"nm0001334"},"actorId":"nm0001334","character":" David Manning","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anne Jackson","urlProfile":"http://www.imdb.com/name/nm0413271","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0Njg5MTEzOV5BMl5BanBnXkFtZTcwNDQ5NDE5Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 September 1925","placeOfBirth":" Millvale, Pennsylvania, USA","birthName":"Anna Jane Jackson","bio":"Anne Jackson was born on September 3, 1925 in Millvale, Pennsylvania, USA as Anna Jane Jackson. She was an actress and producer, known for The Shining (1980), Folks! (1992) and A Woman Called Golda (1982). She was married to Eli Wallach. She died on April 12, 2016 in Manhattan, New York City, New York, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0Njg5MTEzOV5BMl5BanBnXkFtZTcwNDQ5NDE5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0413271","name":"Anne Jackson","idIMDB":"nm0413271"},"actorId":"nm0413271","character":" Bella Abzug","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[{"yearSeason":1987,"episodes":[{"episode":1,"title":"Episode #1.1","date":"18 Jan. 1987","plot":"Shirley MacLaine plays herself in this adaptation of her autobiographical book.","idIMDB":"tt3427764"},{"episode":2,"title":"Episode #1.2","date":"19 Jan. 1987","plot":"Shirley MacLaine's love affair with a married, left-wing British politician.","idIMDB":"tt3427874"}]},{"yearSeason":1987,"episodes":[{"episode":1,"title":"Episode #1.1","date":"18 Jan. 1987","plot":"Shirley MacLaine plays herself in this adaptation of her autobiographical book.","idIMDB":"tt3427764"},{"episode":2,"title":"Episode #1.2","date":"19 Jan. 1987","plot":"Shirley MacLaine's love affair with a married, left-wing British politician.","idIMDB":"tt3427874"}]}],"idIMDB":"tt0093688","urlIMDB":"http://www.imdb.com/title/tt0093688","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["3 hr 55 min (235 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":["Consolidated Film Industries (CFI), Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.2","filmingLocations":[{"location":"California, USA"}],"awards":[{"award":"Golden Globes, USA 1988","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Performance by an Actress in a Miniseries or Motion Picture Made for Television","names":[{"name":"Shirley MacLaine","id":"nm0000511","role":null}]}]}]},{"award":"Primetime Emmy Awards 1987","titlesAwards":[{"titleAwardOutcome":"Nominated Primetime Emmy","categories":[{"category":"Outstanding Miniseries","names":[{"name":"Stan Margulies","id":"nm0546876","role":"producer"},{"name":"Colin Higgins","id":"nm0383359","role":"co-producer"}]},{"category":"Outstanding Sound Editing for a Miniseries or a Special","names":[{"name":"David R. Elliott","id":"nm0254418","role":"supervising sound editor"},{"name":"Dino Dimuro","id":"nm0227491","role":"sound editor"},{"name":"Mark Friedgen","id":"nm0295049","role":"sound editor"},{"name":"G. Michael Graham","id":"nm0334046","role":"sound editor"},{"name":"Joe Melody","id":"nm0578288","role":"sound editor"},{"name":"Stewart Nelsen","id":"nm0625117","role":"sound editor"},{"name":"Rusty Tinsley","id":"nm0864067","role":"sound editor"},{"name":"Scott A. Tinsley","id":"nm0864070","role":"sound editor"},{"name":"Michael C. Gutierrez","id":"nm0349391","role":"sound editor"},{"name":"Bill Voigtlander","id":"nm0901206","role":"adr editor"},{"name":"John Mick","id":"nm0585282","role":"music editor"}]},{"category":"Outstanding Sound Mixing for a Drama Miniseries or a Special","names":[{"name":"Joseph D. Citarella","id":"nm0162898","role":"sound mixer"},{"name":"Grover B. Helsley","id":"nm0375853","role":"sound mixer"},{"name":"John Speak","id":"nm0817255","role":"sound mixer"},{"name":"Ray West","id":"nm0922079","role":"sound mixer"}]}]}]}],"votes":"387","type":"TV Mini-Series","companyCreditsSimple":[{"idCompany":"co0033054","name":"ABC Circle Films"},{"idCompany":"co0267706","name":"Stan Margulies Company, The"}],"keywords":{"keywords":["tv mini series","autobiographical","new age","ocean","kiss","machu picchu","crying man","man crying","beach house","beach","ancient alien","reporter","1970s","script","actress playing herself","actress","dancing","psychic","medium","mineral bath","helicopter","new york city","malibu california","london england","paris france","extramarital affair","male in a bathtub","male in bathtub","bare chested male","reenactment","spirituality","politician","meditation","friendship","metaphysics","pleiades","peru","reincarnation","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:06:00"}}