{"data":{"movies":[{"title":"Dark City","originalTitle":"","year":"1950","releaseDate":"195010","directors":[{"name":"William Dieterle","id":"nm0226189"}],"writers":[{"name":"John Meredyth Lucas","id":"nm0524188"},{"name":"Lawrence B. Marcus","id":"nm0546140"}],"runtime":"98 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NTg3OTM5Ml5BMl5BanBnXkFtZTcwNTUwNzI2Mw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama","Film-Noir","Mystery","Romance"],"plot":"Danny Haley's bookie operation is shut down, so he and his pals need money; when Danny meets Arthur Winant, a sucker from out of town, he decoys him into a series of poker games where eventually Winant loses $5000 that isn't his...then hangs himself. But it seems Winant had a shadowy, protective elder brother who believes in personal revenge. And each of the card players in turn feels a faceless doom inexorably closing in. Dark streets and sexy torch-singer Fran lend ambience.","simplePlot":"Gamblers who \"took\" an out-of-town sucker in a crooked poker game feel shadowy vengeance closing in on them.","actors":[{"actorName":"Charlton Heston","urlProfile":"http://www.imdb.com/name/nm0000032","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMDg1MjYzMV5BMl5BanBnXkFtZTYwMDMxOTE2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1923","placeOfBirth":" Wilmette, Illinois, USA","birthName":"John Charles Carter","height":"6' 2½\" (1.89 m)","bio":"With features chiseled in stone, and renowned for playing a long list of historical figures, particularly in Biblical epics, the tall, well built and ruggedly handsome Charlton Heston was one of Hollywood's greatest leading men and remained active in front of movie cameras for over sixty years. As a Hollywood star, he appeared in 100 films over the course of 60 years. He played Moses in the epic film, The Ten Commandments (1956), for which he received his first Golden Globe Award nomination. He also starred in Touch of Evil (1958) with Orson Welles; Ben-Hur, for which he won the Academy Award for Best Actor (1959); El Cid (1961); and Planet of the Apes (1968). He also starred in the films The Greatest Show on Earth (1952); Secret of the Incas (1954); The Big Country (1958); and The Agony and the Ecstasy (1965). A supporter of Democratic politicians and civil rights in the 1960s, Heston later became a Republican, founding a conservative political action committee and supporting Ronald Reagan. Heston's most famous role in politics came as the five-term president of the National Rifle Association, from 1998 to 2003. Heston was born John Charles Carter on October 4, 1924, in No Man's Land, Illinois, to Lila (Charlton) and Russell Whitford Carter, who operated a sawmill. He had English and Scottish ancestry, with recent Canadian forebears. Heston made his feature film debut as the lead character in a 16mm production of Peer Gynt (1941), based on the Henrik Ibsen play. In 1944, Heston enlisted in the United States Army Air Forces. He served for two years as a radio operator and aerial gunner aboard a B-25 Mitchell stationed in the Alaskan Aleutian Islands with the 77th Bombardment Squadron of the Eleventh Air Force. He reached the rank of Staff Sergeant. Heston married Northwestern University student Lydia Marie Clarke, who was six months his senior. That same year he joined the military. Heston played 'Marc Antony' in Julius Caesar (1950), and firmly stamped himself as genuine leading man material with his performance as circus manager 'Brad Braden' in the Cecil B. DeMille spectacular The Greatest Show on Earth (1952), also starring James Stewart and Cornel Wilde. The now very popular actor remained perpetually busy during the 1950s, both on TV and on the silver screen with audience pleasing performances in the steamy thriller The Naked Jungle (1954), as a treasure hunter in Secret of the Incas (1954) and another barn storming performance for Cecil B. DeMille as \"Moses\" in the blockbuster The Ten Commandments (1956). Heston delivered further dynamic performances in the oily film noir thriller Touch of Evil (1958), and then alongside Gregory Peck in the western The Big Country (1958) before scoring the role for which he is arguably best known, that of the wronged Jewish prince who seeks his freedom and revenge in the William Wyler directed Ben-Hur (1959). This mammoth Biblical epic running in excess of three and a half hours became the standard by which other large scale productions would be judged, and it's superb cast also including Stephen Boyd as the villainous \"Massala\", English actor Jack Hawkins as the Roman officer \"Quintus Arrius\", and Australian actor Frank Thring as \"Pontius Pilate\", all contributed wonderful performances. Never one to rest on his laurels, steely Heston remained the preferred choice of directors to lead the cast in major historical productions and during the 1960s he starred as Spanish legend \"Rodrigo Diaz de Vivar\" in Le Cid (1961), as a US soldier battling hostile Chinese boxers during 55 Days at Peking (1963), played the ill-fated \"John the Baptist\" in The Greatest Story Ever Told (1965), the masterful painter \"Michelangelo\" battling Pope Julius II in The Agony and the Ecstasy (1965), and an English general in Khartoum (1966). In 1968, Heston filmed the unusual western Will Penny (1967) about an aging and lonely cowboy befriending a lost woman and her son, which Heston has often referred to as his favorite piece of work on screen. Interestingly, Heston was on the verge of acquiring an entirely new league of fans due to his appearance in four very topical science fiction films (all based on popular novels) painting bleak future's for mankind. In 1968, Heston starred as time traveling astronaut \"George Taylor\", in the terrific Planet of the Apes (1968) with it's now legendary conclusion as Heston realizes the true horror of his destination. He returned to reprise the role, albeit primarily as a cameo, alongside fellow astronaut James Franciscus in the slightly inferior sequel Beneath the Planet of the Apes (1970). Next up, Heston again found himself facing the apocalypse in The Omega Man (1971) as the survivor of a germ plague that has wiped out humanity leaving only bands of psychotic lunatics roaming the cities who seek to kill the uninfected Heston. And fourthly, taking its inspiration from the Harry Harrison novel \"Make Room!, Make Room!\", Heston starred alongside screen legend Edward G. Robinson and Chuck Connors in Soylent Green (1973). During the remainder of the 1970s, Heston appeared in two very popular \"disaster movies\" contributing lead roles in the far fetched Airport 1975 (1974), plus in the star laden Earthquake (1974), filmed in \"Sensoround\" (low bass speakers were installed in selected theaters to simulate the earthquake rumblings on screen to movie audiences). He played an evil Cardinal in the lively The Four Musketeers: Milady's Revenge (1974), a mythical US naval officer in the recreation of Midway (1976), also filmed in \"Sensoround\", an LA cop trying to stop a sniper in Two-Minute Warning (1976) and another US naval officer in the submarine thriller Gray Lady Down (1978). Heston appeared in numerous episodes of the high rating TV series Dynasty (1981) and The Colbys (1985), before moving onto a mixed bag of projects including TV adaptations of Treasure Island (1990) and A Man for All Seasons (1988), hosting two episodes of the comedy show, Saturday Night Live (1975), starring as the \"Good Actor\" bringing love struck Mike Myers to tears in Wayne's World 2 (1993), and as the eye patch wearing boss of intelligence agent Arnold Schwarzenegger in True Lies (1994). He also narrated numerous TV specials and lent his vocal talents to the animated movie Hercules (1997), the family comedy Cats & Dogs (2001) and an animated version of Ben Hur (2003). Heston made an uncredited appearance in the inferior remake of Planet of the Apes (2001), and his last film appearance to date was in the Holocaust themed drama of Rua Alguem 5555: My Father (2003). Heston narrated for highly classified military and Department of Energy instructional films, particularly relating to nuclear weapons, and \"for six years Heston [held] the nation's highest security clearance\" or Q clearance.\" The Q clearance is similar to a DoD or Defense Intelligence Agency (DIA) clearance of Top Secret. Heston was married to Lydia Marie Clark Heston since March 1944, and they have two children. His highly entertaining autobiography was released in 1995, titled appropriately enough \"Into The Arena\". Although often criticized for his strong conservative beliefs and involvement with the NRA, Heston was a strong advocate for civil right many years before it became fashionable, and was a recipient of the Jean Hersholt Humanitarian Award, plus the Kennedy Center Lifetime Achievement Award. In 2002, he was diagnosed with Alzheimer's disease, and did appear in a film or TV production after 2003. He died in April 2008. Truly, Charlton Heston is one of the legendary figures of US cinema.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMDg1MjYzMV5BMl5BanBnXkFtZTYwMDMxOTE2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000032","name":"Charlton Heston","nicknames":["Chuck"],"idIMDB":"nm0000032"},"actorId":"nm0000032","character":"Danny Haley","urlCharacter":"http://www.imdb.com/character/ch0269253","main":true},{"actorName":"Lizabeth Scott","urlProfile":"http://www.imdb.com/name/nm0779507","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyOTc2ODkzMF5BMl5BanBnXkFtZTYwNjMwMTI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1922","placeOfBirth":" Scranton, Pennsylvania, USA","birthName":"Emma Matzo","height":"5' 7\" (1.7 m)","bio":"Lizabeth Scott was born Emma Matzo on September 29, 1922 in Scranton, Pennsylvania, the oldest of six children of Mary (Pennock) and John Matzo, who were Slovak immigrants. Scott attended Marywood Seminary and the Alvienne School of the Theatre in New York City, where she adopted the stage name of \"Elizabeth Scott.\" After doing a national tour of Hellzapoppin, she was discovered by Broadway producer Michael Myerberg in 1942. Scott was the understudy for Tallulah Bankhead in the original Broadway production of \"The Skin of Our Teeth.\" Later in 1943, a Warner Brothers producer, Hal B. Wallis, discovered Scott at her 21st birthday party held at the Stork Club in New York. Wallis scheduled an interview with Scott the following day, but Scott canceled it when a telegram asked her to replace Miriam Hopkins at the Boston production of The Skin of Our Teeth. In 1944, Scott was invited to Los Angeles by agent Charles K. Feldman, who saw her photos in \"Harpers Bazaar.\" After failed screen tests at Universal, International, then Warner Brothers, Scott again met Wallis, who said he would hire her if he had the power. Scott mistakenly believed that Wallis was as powerful as Jack L. Warner, and did not believe him. The day Scott left for New York, she read in Variety that Wallis resigned from Warner and formed his own production company, releasing films primarily through Paramount. A few months later, she returned from New York and was finally signed to Paramount. Scott appeared in 21 films between 1945 and 1957, though loaned out for half of her films to United Artists, RKO and Columbia. When Scott was introduced to the public in 1945, Paramount publicity releases, exaggerating her background, claimed Scott was a debutante, that her grocer father was an English-born, New York banker, and that her mother was a White Russian aristocrat. Scott's first film was You Came Along (1945), with Robert Cummings as the leading man. This Ayn Rand scripted film introduced the 23-year old smoky blonde to the American public. In a role originally intended for Barbara Stanwyck, Scott played a US Treasury PR flack that falls in love with an Army Air Force officer, who tries to hide his terminal leukemia. Despite Scott's difficulties with director John Farrow, who lobbied for Teresa Wright, the film remains one Scott's favorites. On the strength of her first performance, Wallis starred Scott in The Strange Love of Martha Ivers (1946) over Stanwyck's protests. Scott ended up in third place at the top behind Stanwyck and Van Heflin, with Kirk Douglas, in his film debut, billed below the three stars. The film is actually two in one, with Stanwyck and Scott inhabiting two parallel worlds, both linked by Heflin. The female leads have only one brief scene together. The director, Lewis Milestone, swore never to work with Wallis again, who wanted to re-shoot all of Scott's scenes, which Wallis had to do personally. The film boasts an Oscar nominated screenplay by screenplay by Robert Rossen, music by Miklós Rózsa, art direction by Hans Dreier, and costumes by Edith Head. In Scott's third film, she is cast with Humphrey Bogart in Dead Reckoning (1947). It is Scott's first crack as the archetypal femme fatale. In Dead Reckoning she lures Bogart into a web of lies, and deceit. As is typical in the noir genre, her power is rooted in her beauty and sexual allure. In a departure from his tough guy roles, Bogart plays a wronged man (a noir hero), who struggles to learn the fate of a missing army buddy. Scott is the ex-girlfriend who knows more than she lets on. To keep Bogart from learning the truth about his lost friend and his mysterious double life, Scott seduces him into believing she loves him. In her fourth film, Scott appeared in the second noir to be shot in color, Desert Fury (1947), a coming-of-age story scripted again by Robert Rossen, based on the novel \"Desert Town\" by Ramona Stewart. Mary Astor is Fritzi Haller, a casino and bordello owner who runs the corrupt town of Chuckawalla, Nevada. She controls everyone in town, including the judge and sheriff's office. The only one who dares defy Fritzi is her rebellious daughter Paula (Scott), who returns home after being expelled from another private school. When John Hodiak, a professional gambler, comes to town, Paula falls in love with him and trouble ensues. Then newcomers Burt Lancaster and Wendell Corey also appear. In 1947, Scott was again cast with Lancaster and Kirk Douglas in I Walk Alone (1948), a story of betrayal and vengeance. Scott plays a nightclub singer who provides sympathy and support to Lancaster, recently released from prison to collect a debt, but is double-crossed by the Douglas character. Scott rises above it all and is completely convincing in her portrayal. Scott's character provides a degree of romanticism and humanism usually lacking in film noir. Film number seven was Pitfall (1948). Dick Powell played a middle-level insurance investigator, married to his high school sweetheart, Jane Wyatt. They living out a comfortable but boring existence in a post-war Los Angeles suburb. Powell is restless and unfulfilled (\"I feel like a wheel within a wheel within a wheel\") when he receives what at first seems like a routine assignment to recover goods that have been bought with stolen money, a claim paid off by Powell's firm. The items are traced to Mona Stevens (Scott), a model living in Marina Del Rey. Powell is attracted to her, and what starts out as innocent flirtation ends up in a passionate love affair. Powell's journey into a daydream turns into a nightmare as he becomes a prisoner in his own home and kills an assailant, who has been set on his trail by a jealous private investigator, played by Raymond Burr. Meanwhile, the Burr character also blackmails Mona into doing private \"fashion shows.\" In Too Late for Tears (1949), Scott played an avaricious Jane Palmer, a wife who goes to any length to keep $60,000 that is accidentally thrown in the back of her husband's car. She eventually leaves behind a string of bodies in an effort to keep the money. This film is widely regarded by critics and viewers alike as Scott's best performance and film. Don DeFore, Arthur Kennedy and Kristine Miller also star. Also of interest is 1949's Easy Living (1949), an intelligent, well-written film about an aging football star, played by Victor Mature, who struggles to adjust to his impending retirement, as well as the pressures brought on by an ambitious and defiant wife (Scott). Lucille Ball is commendable as the sympathetic team secretary and director Jacques Tourneur is first-rate. One of Scott's finest roles, it is a favorite of many of her fans. By the end of 1949 Scott appeared in nine films, but did not achieved the level of stardom and clout that was needed to maintain her popularity at the box-office. From 1950 on, she and Hal Wallis passed up numerous opportunities to maintain her stardom. Wallis passed up a chance to star Scott in Lillian Hellman's Broadway play \"Another Part of the Forest\" (1946), later to made into the 1948 film. Scott herself passed up the lead in \"The Rose Tattoo (19955), a decision she publicly regretted. She continued to make films such as Dark City (1950), Red Mountain (1951), Two of a Kind (1951), Scared Stiff (1953) and Bad for Each Other (1953). In February 1954, Scott did not renew her contract with Paramount and became a freelancer. She went on to make the western noir Silver Lode (1954) and The Weapon (1956). In 1957 she retired from the big screen by starring with Elvis Presley in Loving You (1957), Presley's second film. Also starring is newcomer Dolores Hart and veteran Wendell Corey. Since 1957 Scott appeared on a few television shows in the 1960s, during which time she attended the University of Southern California. She eventually became involved in real estate projects. Her legacy lives on however in the growing popularity of classic movies sparked by DVDs and movie channels such as AMC (American Movie Classics) and TCM (Turner Classic Movies).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyOTc2ODkzMF5BMl5BanBnXkFtZTYwNjMwMTI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0779507","name":"Lizabeth Scott","nicknames":["Scotty","Liz","The Threat"],"idIMDB":"nm0779507"},"actorId":"nm0779507","character":"Fran Garland","urlCharacter":"http://www.imdb.com/character/ch0269261","main":true},{"actorName":"Viveca Lindfors","urlProfile":"http://www.imdb.com/name/nm0511798","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NjcyNzk5MV5BMl5BanBnXkFtZTcwODkxMDIxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1920","placeOfBirth":" Uppsala, Uppsala län, Sweden","birthName":"Elsa Viveca Torstensdotter Lindfors","height":"5' 5¾\" (1.67 m)","bio":"Ms. Lindfors was a Swedish-born actress whose stage and screen career in the U.S. and Sweden spanned more than half a century. She was brought to Hollywood in 1946 by Warner Brothers in the hope that she would be a new Greta Garbo or Ingrid Bergman. She appeared with Ronald Reagan in her first Hollywood film, Don Siegel's Night Unto Night (1949). Perhaps best known as a stage actress, she returned to Sweden in August 1995 to tour with the play \"In Search of Strindberg\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NjcyNzk5MV5BMl5BanBnXkFtZTcwODkxMDIxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0511798","name":"Viveca Lindfors","idIMDB":"nm0511798"},"actorId":"nm0511798","character":"Victoria Winant","urlCharacter":"http://www.imdb.com/character/ch0269262","main":true},{"actorName":"Dean Jagger","urlProfile":"http://www.imdb.com/name/nm0415591","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1NzkxNDQ4MF5BMl5BanBnXkFtZTcwMzg0MjIyOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 November 1903","placeOfBirth":" Columbus Grove, Ohio, USA","birthName":"Ira Dean Jagger","height":"6' 2\" (1.88 m)","bio":"Dean Jagger was born in Lima, Ohio, on November 7, 1903. He dropped out of high school twice before finally graduating from Wabash College. Working first as a school teacher, he soon became interested in acting and enrolled at Chicago's \"Lyceum Art Conservatory\". Mr. Jagger made his first movie and only silent film, The Woman from Hell (1929) in 1929, starring Mary Astor. During 1929 he also appeared in the film Handcuffed (1929). He quickly found his niche as a character actor and the highlight of his career was winning an Oscar for \"Best Supporting Actor,\" in the 1949 movie Twelve O'Clock High (1949). Dean played Principal Albert Vane on TV for the 1963-1964 season of Mr. Novak (1963). Dean Jagger died in Santa Monica, California, on February 5, 1991.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1NzkxNDQ4MF5BMl5BanBnXkFtZTcwMzg0MjIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0415591","name":"Dean Jagger","idIMDB":"nm0415591"},"actorId":"nm0415591","character":"Capt. Garvey","urlCharacter":"http://www.imdb.com/character/ch0269266","main":true},{"actorName":"Don DeFore","urlProfile":"http://www.imdb.com/name/nm0214529","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjM0N2Y2NTQtOGFiNC00YWI4LWJmMDMtYTlmYjM2Y2UwMDliXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1913","placeOfBirth":" Cedar Rapids, Iowa, USA","birthName":"Donald John DeFore","height":"6' 1\" (1.85 m)","bio":"Don DeFore toured the country in stock companies for several years before making his Broadway debut in 1938. In films since 1941, he occasionally played leads in B pictures, but was more often cast as the good-natured buddy of the hero or a likable but gullible character whom the hero has to bail out of trouble. DeFore found much more success on television, and was a regular in the hit series Hazel (1961) and The Adventures of Ozzie & Harriet (1952).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjM0N2Y2NTQtOGFiNC00YWI4LWJmMDMtYTlmYjM2Y2UwMDliXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0214529","name":"Don DeFore","nicknames":["Dude"],"idIMDB":"nm0214529"},"actorId":"nm0214529","character":"Arthur Winant","urlCharacter":"http://www.imdb.com/character/ch0269267","main":true},{"actorName":"Jack Webb","urlProfile":"http://www.imdb.com/name/nm0916131","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NjMxNzgwOV5BMl5BanBnXkFtZTYwMDc5MzQ2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 April 1920","placeOfBirth":" Santa Monica, California, USA","birthName":"John Randolph Webb","height":"5' 10\" (1.78 m)","bio":"John Randolph Webb was born in Santa Monica, California, to Margaret (Smith) and Samuel Chester Webb. His father left home before he was born; Webb would never know him. He was raised by his mother and maternal grandmother in dire poverty that preceded the Depression. Making things worse, Webb suffered from acute asthma from age six until adulthood, somewhat surprising for a man whose cigarette intake reached three packs a day at its peak. Webb's great love was movies, and his dream was to direct them. He began in radio, first as a disc jockey then as host of a comedy show (Believe It or Not!), finally as \"Pat Novak, Private Eye\", his first true success. A small role in the film nor classic He Walked by Night (1948) led to the creation of \"Dragnet\". During production, Webb befriended a LAPD police consultant assigned to the film and became fascinated with the cases he heard told. He successfully pitched the idea of a radio series to NBC using stories drawn from actual LAPD files. \"Dragnet\" first aired over NBC radio on June 3, 1949, and came to TV (Dragnet (1951)) on December 16, 1951. The show was one of the monster hits of early TV and was honored with satirizations by comics and even Bugs Bunny (!) during it's run, which lasted until September, 1959. The series' popularity could have ensured its continuation indefinitely but, by then, Webb had become a film director and would helm (and star in) five features: Dragnet (1954), Pete Kelly's Blues (1955), The D.I. (1957), -30- (1959) and The Last Time I Saw Archie (1961). The last two were box office flops, and Webb returned to TV in 1962. In February, 1963, he became Head of Production for Warner Bros. Television, a job he was fired from that December when his revision of 77 Sunset Strip (1958) sent its ratings into a death spiral. After two years of unemployment, a new opportunity arose, the made-for-TV film, of which Universal was then sole supplier. Coincidentally, they owned the rights to Dragnet (1951) and invited Webb to do a new \"Dragnet\" as a TV movie. It turned out so well in industry previews (oddly not broadcast until 1969) that NBC and Universal persuaded him to do a new Dragnet 1967 (1967) TV series, which lasted three-and-a-half seasons and went on to smash success in syndicated reruns. This later incarnation (co-starring Harry Morgan as \"Officer Bill Gannon\") is probably what Webb is best known for and unlike the 50's version, it was produced in color and increasingly focused on his personal conservative social agenda. Over the next five seasons, he regularly blasted marijuana, LSD (which was legal at the time of the revamped series debut), hippies, juvenile delinquency and disrespect for law enforcement. To be fair, the series was equally intolerant of police corruption and went to great lengths to show LAPD's self-disciplinary process as it was at the time. Webb was known as an extremely economical TV producer: his Mark VII productions routinely used minimal sets, even more minimal wardrobes (Friday and Gannon seem to wear the same suits over entire seasons, which minimized continuity issues) and maintained a relatively tight-knit stock company that consisted of scale-paid regulars who routinely appeared as irate crime victims, policewomen, miscreants and clueless parents of misguided youth. While the passing decades haven't been kind to all of the episodes--- several now seem camp, the manpower expended investigating some seemingly minor crimes is laughable and the outcome of many of the trials would be vastly different today--- they remain entertaining while representing somewhat fictionalized docudramas 1960's police operations. With renewed wealth and industry status, Webb was also determined not to repeat his past debacle as a producer/studio boss. He parlayed Dragnet's renewed popularity into a second hit series, Adam-12 (1968), and scored an even bigger hit with Emergency! (1972) (casting his ex-wife, Julie London and her husband Bobby Troup), a show that inspired thousands of kids to become EMT/paramedics for generations, perhaps Webb's greatest legacy. During the production of Dragnet 1967 (1967), he maintained a rigorous daily work schedule while ignoring his health. He loved chili dogs and cigarettes, enjoyed late nights playing cards and drinking with cast members who were amazed to find him fully alert at 7a.m. the next day, expecting the same from them. The combined effect of this lifestyle made him appear older than he actually was by the late 60's. Unbeknownst to fans, he possessed a healthy sense of humor (his 1968 \"Copper Clapper\" appearance on The Tonight Show Starring Johnny Carson (1962) remains a classic) and he was a jazz fanatic, amassing one of the world's greatest collections. Webb's sense of humor didn't extend to his self-image, however. In 1977, director John Landis approached him with an offer to appear as \"Dean Wormer\" in Animal House (1978) and recalled Webb sitting stone-faced and unimpressed at the offer. Sadly, he rejected it as being too counter to his public persona. Webb managed to keep his company solvent until his untimely, yet not unexpected, death from a massive heart attack on December 23, 1982 at age 62. Webb was married four times: to Julie London (1947-54), Dorothy Towne (1955-1957), Jackie Loughery (1958-64), and to Opal Wright (1980-death). He had two daughters by London: 'Stacey Webb' (1950-96) and 'Lisa Webb' (born 1952).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NjMxNzgwOV5BMl5BanBnXkFtZTYwMDc5MzQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0916131","name":"Jack Webb","idIMDB":"nm0916131"},"actorId":"nm0916131","character":"Augie","urlCharacter":"http://www.imdb.com/character/ch0269268","main":true},{"actorName":"Ed Begley","urlProfile":"http://www.imdb.com/name/nm0003225","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTM0Njg2N15BMl5BanBnXkFtZTcwNzgzNzg1MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 March 1901","placeOfBirth":" Hartford, Connecticut, USA","birthName":"Edward James Begley","height":"5' 7\" (1.7 m)","bio":"Charismatic character star Edward James Begley was born in Hartford, Connecticut of Irish parents and educated at St.Patrick's school. His interest in acting first surfaced at the age of nine, when he performed amateur theatricals at the Hartford Globe Theatre. Determined to make his own way, he left home aged eleven and drifted from job to job, had a four-year stint in the U.S. Navy, then worked in a bowling alley replacing pins, joined carnivals and circuses. In 1931, he appeared in vaudeville and was also hired as a radio announcer, his voice broadcast to nationwide audiences. It took him several years to establish himself on the legitimate stage, but in 1943, he had a role in the short-running play 'Land of Fame'. His first success was the 1947 Arthur Miller play 'All My Sons' and this was followed by the 1925 Scopes Trial fictionalisation 'Inherit the Wind' (1955-57), which ran for 806 performances at the National Theatre. Ed, co-starring with Paul Muni, played the part of Matthew Harrison Brady (played in the 1960 motion picture by Fredric March) and won the 1956 Tony Award for Best Featured Actor in a Play. Upon Paul Muni's departure from the cast, Ed used the opportunity to play the part of Henry Drummond (Spencer Tracy's role in the film) with equal vigour. In 1960, he starred as Senator Orrin Knox in the political drama 'Advise and Consent'. Ed's movie career began with Boomerang! (1947), a murder mystery set in his native Connecticut, directed by Elia Kazan. Heavy-set and with bushy eyebrows, the archetypal image of Ed Begley on screen is as a gruff, blustery, often heavily sweating (and sometimes corrupt) politician or industrialist. He proved his mettle in a number of classic films, including Sorry, Wrong Number (1948) and On Dangerous Ground (1951). Whether as the sympathetic executive in Patterns (1956), a bigoted ex-cop turned bank robber in Odds Against Tomorrow (1959), or the crazed billionaire bent on world domination of Billion Dollar Brain (1967), he tackled every part that came his way with conviction. The culmination of his work was a Best Supporting Actor Academy Award for his role of Boss Finley in Tennessee Williams's Sweet Bird of Youth (1962). In addition to countless radio broadcasts, Ed was also busy in television in the 1950's and 60's. Among frequent guest starring appearances, his dynamic characterisations in two episodes of The Invaders (1967) ('The Betrayed' and 'Labyrinth') stand out in particular. Ed Begley died of a heart attack in April 1970 in Hollywood at the age of 69.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTM0Njg2N15BMl5BanBnXkFtZTcwNzgzNzg1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003225","name":"Ed Begley","idIMDB":"nm0003225"},"actorId":"nm0003225","character":"Barney","urlCharacter":"http://www.imdb.com/character/ch0269271","main":true},{"actorName":"Harry Morgan","urlProfile":"http://www.imdb.com/name/nm0604702","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4OTc3NzE5MF5BMl5BanBnXkFtZTcwMTc4NDMxNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1915","placeOfBirth":" Detroit, Michigan, USA","birthName":"Harry Bratsberg","height":"5' 6\" (1.68 m)","bio":"Harry Morgan was a prolific character actor who starred in over 100 films and was a stage performer. Known to a younger generation of fans as \"Col. Sherman T. Potter\" on M*A*S*H (1972). Also known for his commanding personality throughout his career, he tackled movies and television in a way no other actor would do it. Born Harry Bratsberg in Detroit, Michigan, to parents Henry Bratsberg, who immigrated from Norway, who was a mechanic, and Anna Olsen, a housewife who immigrated from Sweden. After graduating from Muskegon High School in Muskegon, Michigan, he took on a job as a salesman, before becoming a successful actor. In the many films, several of his most memorable movies, he appeared in were: in one of his firsts, The Omaha Trail (1942), in the next quarter of a century, he would also appear in The Ox-Bow Incident (1943), Wing and a Prayer (1944), State Fair (1945), Dragonwyck (1946), All My Sons (1948), Red Light (1949), Outside the Wall (1950), Dark City (1950) where he met future Dragnet 1967 (1967) co-star Jack Webb, who would be best friends until Webb's death, late in 1982, along with Appointment with Danger (1951). His films credits also include: High Noon (1952), The Glenn Miller Story (1954), Strategic Air Command (1955), among many others. He also co-starred with James Garner in Support Your Local Sheriff! (1969) and its sequel Support Your Local Gunfighter (1971). On television, he is fondly remembered as Spring Byington's jokingly, henpecked neighbor, \"Pete Porter\" on December Bride (1954), where he became the show's scene-stealer. It was also based on a popular radio show that it transferred into television. The show was an immediate success to viewers, which led him into starring his own short-lived spin-off series, Pete and Gladys (1960), which co-starred Cara Williams, who met Morgan in the movie, The Saxon Charm (1948). Morgan began his eight-year association with old friend, Jack Webb, and Universal, starting with Dragnet 1967 (1967), which he played Off. Bill Gannon. For the second time, like December Bride (1954) before this, it was an immediate hit, where it tackled a lot of topics. Dragnet was canceled in 1970, after a 4-season run, due to Morgan's best friend and co-star (Jack Webb) leaving the show to continue producing other shows, such as: Adam-12 (1968) and Emergency! (1972). Morgan would later work with Webb in both short-lived series, The D.A. (1971), opposite Robert Conrad and Hec Ramsey (1972), opposite Richard Boone. After those roles, Morgan ended his contract with both Universal and Mark VII, to sign with 20th Century Fox. Morgan's biggest role was that of a tough-talking, commanding, fun-loving, serious Army Officer, \"Col. Sherman T. Potter\" on M*A*S*H (1972), when he replaced McLean Stevenson, who left the show to unsuccessfully star in his own sitcom. For the third time, the show was still a hit with fans, and at 60, he was nominated for Emmies nine times and won his first and only Emmy in 1980, for Outstanding Supporting Actor. By 1983, M*A*S*H's series was getting very expensive, as well as with the cast, hence, CBS reduced it to 16 episodes. Despite M*A*S*H's finale in 1983, Morgan went on to star in a short-lived spin-off series After MASH (1983), co-starring Jamie Farr and William Christopher, from the original M*A*S*H (1972) series, without series' star Alan Alda. He also co-starred in 2 more short-lived series, as he was over 70, beginning with Blacke's Magic (1986) with Hal Linden and his final role with You Can't Take It with You (1987). That same year, he reprised his role, for a second time as \"Off. Bill Gannon\" in the film, Dragnet (1987), which starred Dan Aykroyd and Tom Hanks. Then, he guest-starred in several shows such as: The Twilight Zone (1985), Renegade (1992), The Jeff Foxworthy Show (1995), for the third time, he also reprised his \"Off. Bill Gannon\" role, supplying his voice on The Simpsons (1989). Towards the end of his acting career, as he reached 80, he had a recurring role as the older college professor on 3rd Rock from the Sun (1996), opposite John Lithgow. Afterwards, he retired from show business and lived with his family. Harry Morgan died on December 7, 2011, at age 96. On confirming his death, his son Charles, said that he had been recently treated for pneumonia. Morgan was also one of the oldest living Hollywood male actors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4OTc3NzE5MF5BMl5BanBnXkFtZTcwMTc4NDMxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0604702","name":"Harry Morgan","idIMDB":"nm0604702"},"actorId":"nm0604702","character":"Soldier","urlCharacter":"http://www.imdb.com/character/ch0269272","main":true},{"actorName":"Walter Sande","urlProfile":"http://www.imdb.com/name/nm0761340","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWRlODgyYTEtMWEyMC00ZjY5LTllZGItZjlhZDkxYzE1ZjUyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1906","placeOfBirth":" Denver, Colorado, USA","height":"5' 6½\" (1.69 m)","bio":"Chances are you've seen his imposing character face scores of times but couldn't place the name. Colorado-born actor Walter Sande was one of those stern, heavyset character actors in Hollywood everyone recognized but no one could identify. Born in Denver on July 9, 1906, Sande showed an early passion for music as a youth and by his college years managed to start his own band. This led to a job as musical director for 20th Century-Fox's theater chain, which in turn led to acting in films beginning in 1937. Usually providing atmospheric bits with no billing, he made an initial impression in serial cliffhangers as a third-string heavy with the popular The Green Hornet Strikes Again! (1940) and Sky Raiders (1941). His first top featured role, however, would come with The Iron Claw (1941) as Jack \"Flash\" Strong, a photographer who--uncharacteristically for Walter--served as a comic sidekick to the serial's hero. Best of all would be his role in another serial as Red Pennington, the amusing sidekick to Don Winslow of the Navy (1942). he repeated his role again in Don Winslow of the Coast Guard (1943), the successful sequel. The role of Pennington sparked a long and steady supporting career in movies, usually a step or two behind Hollywood's elite on camera, which included Humphrey Bogart and Lauren Bacall in To Have and Have Not (1944) (prominently featured as the fisherman who tries to cheat Bogie), Gary Cooper in Along Came Jones (1945), Alan Ladd in The Blue Dahlia (1946), Charlton Heston in Dark City (1950) and Spencer Tracy in Bad Day at Black Rock (1955), among hundreds of others. He also lent an an authoritative presence to classic sci-fi films such as Red Planet Mars (1952), The War of the Worlds (1953) and Invaders from Mars (1953), and also had a recurring featured part in the 1940s \"Boston Blackie\" film series playing Detective Matthews alongside Chester Morris' former thief-turned-crime hero. A prolific supporting player during the \"golden age\" of TV, Sande worked on nearly every popular western and crime show that aired throughout the 1950s and 1960s. He had a regular series role on The Adventures of Tugboat Annie (1957) as Capt. Horatio Bullwinkle, Annie's tugboat rival, and a recurring one as Inger Stevens' Swedish father, Lars \"Papa\" Holstrum, on The Farmer's Daughter (1963). Walter Sande died of a heart attack in 1971 at age 65.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWRlODgyYTEtMWEyMC00ZjY5LTllZGItZjlhZDkxYzE1ZjUyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0761340","name":"Walter Sande","idIMDB":"nm0761340"},"actorId":"nm0761340","character":"Swede","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Keuning","urlProfile":"http://www.imdb.com/name/nm0450654","urlPhoto":"","biography":{"dateOfBirth":"24 August 1943","placeOfBirth":" Los Angeles County, California, USA","birthName":"Mark Elwyn Keuning","bio":"Mark Keuning was born on August 24, 1943 in Los Angeles County, California, USA as Mark Elwyn Keuning. He is an actor, known for Three Came Home (1950) and Dark City (1950).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0450654","name":"Mark Keuning","idIMDB":"nm0450654"},"actorId":"nm0450654","character":"Billy Winant","urlCharacter":"http://www.imdb.com/character/ch0269275","main":true},{"actorName":"Mike Mazurki","urlProfile":"http://www.imdb.com/name/nm0563417","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNTQzMzkwMl5BMl5BanBnXkFtZTYwNjgwMTU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1907","placeOfBirth":" Tarnopol, Galicia, Austria-Hungary [now Ternopil, Ukraine]","birthName":"Michail Mazuruski","height":"6' 4¾\" (1.95 m)","bio":"With an intimidating face like craggy granite and a towering 6'5\" solid frame, Mike Mazurki (born Mikhail Mazuruski or Mikhail Mazurkiewicz) was one of cinema's first serial thugs and specialized in playing strongarm men, gangsters and bullies for over 50 years on screen. Nearly always portrayed as a lowbrow muscle, in real life Mazurski was highly intelligent, very well read and a witty conversationalist. He was also an accomplished sportsman, having been a football player and a professional wrestler. He first appeared onscreen in uncredited roles in films such as Gentleman Jim (1942) and About Face (1942); however, his daunting bruiser looks were soon noticed and he became phenomenally busy in the 1940s, appearing in nearly 50 movies during the decade, including his well remembered performance as ex-con \"Moose Malloy\" in the film noir thriller Murder, My Sweet (1944) and as the gruesome \"Splitface\" in Dick Tracy (1945). He continued his menacing onscreen presence throughout the 1950s and 1960s, often showing he could be quite adept at deadpan comedy in films including Bud Abbott and Lou Costello in Hollywood (1945), It's a Mad Mad Mad Mad World (1963), Donovan's Reef (1963) and The Adventures of Bullwhip Griffin (1967). Demand for his talents slowed down in the late 1970s and most of the 1980s, as younger villains came to the fore; however, he still turned up in support roles and was still acting at the age of 83 when he passed away in December, 1990.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNTQzMzkwMl5BMl5BanBnXkFtZTYwNjgwMTU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0563417","name":"Mike Mazurki","idIMDB":"nm0563417"},"actorId":"nm0563417","character":"Sidney Winant","urlCharacter":"http://www.imdb.com/character/ch0269276","main":true}],"seasons":[],"idIMDB":"tt0042379","urlIMDB":"http://www.imdb.com/title/tt0042379","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":"12","month":"05","year":"1950","remarks":null},"filmingDates":null,"copyrightHolder":"Paramount Pictures Corporation (original), U.S. Copyright LP392, 6 October 1950"},"technical":{"runtime":["1 hr 38 min (98 min)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["2,668 m (11 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.8","filmingLocations":[{"location":"North Hollywood, California, USA"}],"rated":"16","awards":[],"votes":"1,376","type":"Movie","companyCreditsSimple":[{"idCompany":"co0128419","name":"Hal Wallis Productions"}],"keywords":{"keywords":["poker game","torch singer","vengeance","decoy","brother","bookie","revenge","death","punch drunk","world war two veteran","card cheat","stuffed animal","milk","professional gambler","bookie joint","easter","death of husband","vice squad","slot machine","ulcer","dribble glass","card dealer","phonograph","los angeles california","amusement park","alley cat","suicide by hanging","cashier's check","widow","wallet","veteran","singer","reunion","psychopath","police","police raid","nightclub","murder","las vegas nevada","impersonator","impersonation","fistfight","deception","croupier","chicago illinois","cheating","casino","gambling","suicide"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:07:04"}}