{"data":{"movies":[{"title":"The Electric House","originalTitle":"","year":"1922","releaseDate":"192210","directors":[{"name":"Edward F. Cline","id":"nm0166836"},{"name":"Buster Keaton","id":"nm0000036"}],"writers":[{"name":"Buster Keaton","id":"nm0000036"},{"name":"Edward F. Cline","id":"nm0166836"}],"runtime":"23 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4ODMzNTUxNl5BMl5BanBnXkFtZTcwODY0NzI0NQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Short","Comedy"],"plot":"Botany major Buster mistakenly graduates in electrical engineering and is hired to wire a new home. He installs lots of fanciful gadgets. The one who should have received the degree gets even by rewiring all the gadgets to wreak havoc.","simplePlot":"After being mistakenly certified as an electrical engineer, Buster is hired to wire a house.","actors":[{"actorName":"Buster Keaton","urlProfile":"http://www.imdb.com/name/nm0000036","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MjA4ODk5OF5BMl5BanBnXkFtZTYwNDQyNjI2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1895","placeOfBirth":" Piqua, Kansas, USA","birthName":"Joseph Frank Keaton","height":"5' 5\" (1.65 m)","bio":"When at six months of age he tumbled down a flight of stairs unharmed, he was given the name \"Buster\" by Harry Houdini who, along with W.C. Fields, Bill Robinson (\"Bojangles\"), Eddie Cantor and Al Jolson shared headlines with \"The Three Keatons\": Buster, his father Joe Keaton and mother Myra Keaton. Their act, one of the most dangerous in vaudeville, was about how to discipline a prankster child. Buster was thrown all over the stage and even into the audience. No matter what the stunt, he was poker-faced. By the time Buster turned 21, however, his father was such a severe alcoholic that the stunts became too dangerous to perform and the act dissolved. He first saw a movie studio in March 1917 and, on April 23, his debut film, Roscoe 'Fatty' Arbuckle's The Butcher Boy (1917), was released. He stayed with Fatty through 15 two-reelers, even though he was offered much more to sign with Fox or Warner Bros. after returning from ten months with the U.S. Army (40th Infantry Division) in France. His first full-length feature, The Saphead (1920), established him as a star in his own right. By the middle of 1921 he had his own production company--Buster Keaton Productions--and was writing, directing and starring in his own films. With a small and close team around him, Keaton created some of the most beautiful and imaginative films of the silent era. The General (1926), his favorite, was one of the last films over which he had artistic control. In 1928 he reluctantly signed with MGM after his contract with independent producer Joseph M. Schenck expired. MGM quickly began to enforce its rigid, mechanized style of filmmaking on Keaton, swamping him with gag writers and scripts. He fought against it for a time, and the compromise was initially fruitful, his first film for MGM--The Cameraman (1928)--being one of his finest. However,with his creativity becoming increasingly stifled he began to drink excessively, despondent at having to perform material that was beneath him. Ironically, his films around 1930 were his most successful to date in terms of box-office receipts, which confirmed to MGM that its formula was right. His drinking led to a disregard for schedules and erratic behavior on the MGM lot, and a disastrous confrontation with Louis B. Mayer resulted in him being fired. The diplomatic producer Irving Thalberg attempted to smooth things over but Keaton was past caring. By 1932 he was a divorced alcoholic, getting work where he could, mostly in short comedies. In 1935 he entered a mental hospital. MGM rehired him in 1937 as a $100-a-week gag writer (his salary ten years before was more than ten times this amount). The occasional film was a boost to this steady income. In 1947 his career rebounded with a live appearance at Cirque Medrano in Paris. In 1952 James Mason, who then owned Keaton's Hollywood mansion, found a secret store of presumably lost nitrate stock of many of Buster's early films; film historian and archivist Raymond Rohauer began a serious collection/preservation of Buster's work. In 1957 Buster appeared with Charles Chaplin in Limelight (1952) and his film biography, The Buster Keaton Story (1957), was released. Two years later he received a special Oscar for his life work in comedy, and he began to receive the accolades he so richly deserved, with festivals around the world honoring his work. He died in 1966, age 70.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MjA4ODk5OF5BMl5BanBnXkFtZTYwNDQyNjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000036","name":"Buster Keaton","nicknames":["The Great Stone Face","Malec"],"idIMDB":"nm0000036"},"actorId":"nm0000036","character":"Buster","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0013099","urlIMDB":"http://www.imdb.com/title/tt0013099","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"€33","country":"Spain","day":"31","month":"08","year":"2002","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/2002/\">2002</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["19 min (Spain)","23 min (USA)","22 min (2005 DVD release) (USA)","20 min (2005 DVD release) (USA)"],"soundMix":["Silent"],"color":["Black and White"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":["(2 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.3","filmingLocations":[],"rated":"TV-G","awards":[],"votes":"1,827","type":"Movie","companyCreditsSimple":[{"idCompany":"co0041460","name":"First National Pictures"}],"keywords":{"keywords":["toy train","future technology","push button","advanced technology","new technology","ultra modern house","modern home","home automation","automated home","home renovation","home improvement","written and directed by cast member","electric shock","mix up","swimming pool","revenge","dishwasher","escalator"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:17:58"}}