{"data":{"movies":[{"title":"Matewan","originalTitle":"","year":"1987","releaseDate":"19880630","directors":[{"name":"John Sayles","id":"nm0000626"}],"writers":[{"name":"John Sayles","id":"nm0000626"}],"runtime":"135 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMzcwODYwNV5BMl5BanBnXkFtZTcwMTk5MzYyMQ@@._V1.jpg","countries":["USA"],"languages":["English","Italian"],"genres":["Drama","History"],"plot":"Mingo County, West Virginia, 1920. Coal miners, struggling to form a union, are up against company operators and the gun thugs of the notorious Baldwin-Felts detective agency. Black and Italian miners, brought in by the company to break the strike, are caught between the two forces. UMWA organizer and dual-card Wobbly Joe Kenehan determines to bring the local, Black, and Italian groups together. While Kenehan and his story are fictional, the setting and the dramatic climax are historical; Sid Hatfield, Cabell C. Testerman, C. E. Lively and the Felts brothers were real-life participants, and 'Few Clothes' is based on a character active several years previously.","simplePlot":"A labor union organizer comes to an embattled mining community brutally and violently dominated and harassed by the mining company.","actors":[{"actorName":"Chris Cooper","urlProfile":"http://www.imdb.com/name/nm0177933","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NTgxMzgxNl5BMl5BanBnXkFtZTcwMTAyMjcxNA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1951","placeOfBirth":" Kansas City, Missouri, USA","height":"5' 10\" (1.78 m)","bio":"Christopher Walton Cooper was born in Kansas City, Missouri, to Mary Ann (Walton), a homemaker, and Charles Sherwood Cooper, a cattleman and internist who served as a doctor in the US Air Force. His parents were from Texas, where Cooper was raised. Educated at the University of Missouri school of drama, Cooper appeared on Broadway in \"Of the Fields Lately (1980)\", and off-Broadway in \"The Ballad of Soapy Smith (1983)\" and \"A Different Moon (1983)\". He debuted in films in the John Sayles movie Matewan (1987). Although his performance was well received, the picture was not successful. Other films he has appeared in include Guilty by Suspicion (1991), Money Train (1995) and A Time to Kill (1996). On television, Cooper has been featured in the mini-series Lonesome Dove (1989) and Return to Lonesome Dove (1993), as July Johnson. He has also appeared in a number of television movies. In 1996, he starred in his third John Sayles movie, Lone Star (1996), where he plays Sam Deeds, the sheriff whose lawman father becomes a posthumous suspect in a murder investigation.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NTgxMzgxNl5BMl5BanBnXkFtZTcwMTAyMjcxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0177933","name":"Chris Cooper","idIMDB":"nm0177933"},"actorId":"nm0177933","character":"Joe Kenehan","urlCharacter":"http://www.imdb.com/character/ch0094606","main":true},{"actorName":"Mary McDonnell","urlProfile":"http://www.imdb.com/name/nm0001521","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5ODc4MTcwM15BMl5BanBnXkFtZTgwNjI2Njk3NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1952","placeOfBirth":" Wilkes-Barre, Pennsylvania, USA","birthName":"Mary Eileen McDonnell","height":"5' 6\" (1.68 m)","bio":"Mary McDonnell is a two-time Oscar®-nominated actress, who is known for her character portrayals in both period and present-day screen roles. Mary Eileen McDonnell was born on April 28, 1952 in Wilkes-Barre, Pennsylvania, to Eileen (Mundy) and John McDonnell, a computer consultant, both of Irish descent. Mary was raised in Ithaca, New York. After graduating from the State University of New York at Fredonia, she attended drama school and joined the Long Wharf Theatre Company on the East Coast. It was not until 20 years after working on the theater stage that she had her breakthrough film role, in Kevin Costner's Dances with Wolves (1990), playing Stands with a Fist, a white woman raised by the Sioux Indians. McDonnell received an Academy Award nomination for the role, and also garnered a Best Actress Academy Award® nomination and Golden Globe nomination for her portrayal of a paraplegic soap opera star in John Sayles' critically acclaimed Passion Fish (1992). McDonnell's extensive list of film credits include the Lawrence Kasdan films Grand Canyon and Mumford; Sneakers, opposite Robert Redford, Sidney Poitier and Sir Ben Kingsley; Roland Emmerich's smash Independence Day, with Bill Pullman and Will Smith; acclaimed art house cult-hit Donnie Darko; and Margin Call, opposite Kevin Spacey, which also earned her the Robert Altman Award at the 2012 Independent Spirit Awards. On the small screen, McDonnell starred in four seasons on the Syfy Network's award-winning series Battlestar Galactica in her critically praised performance as the President Laura Roslin. The series earned a Peabody Award, and AFI deemed the series TV Program of the Year for two years in a row. McDonnell garnered an Emmy nomination for her recurring guest role on the television series ER. Some of her other television credits include the ABC hit-series Grey's Anatomy, the CBS series High Society, TNT's adaptation of Arthur Miller's The American Clock, the critically acclaimed CBS movie Behind The Mask and Lifetime's Two Small Voices. McDonnell received rave reviews for her performance opposite David Strathairn in Emily Mann's acclaimed adaptation of Chekhov's The Cherry Orchard. McDonnell began her career in theatre and has starred in a wide variety of both Broadway and off-Broadway productions. She received an Obie Award for her performance in Emily Mann's Still Life and has starred in off-Broadway productions such as Sam Shepard's Pulitzer Prize-winning Buried Child, John Patrick Shanley's Savage in Limbo, John O'Keefe's All Night Long, Michael Cristofer's Black Angel, Kathleen Tolan's A Weekend Near Madison, Paula Cizmar's Death of a Miner and Dennis McIntyre's National Anthem. Her Broadway credits include Tennessee Williams' Summer and Smoke, the title role in Wendy Wasserstein's Pulitzer Prize-winning The Heidi Chronicles and Emily Mann's Execution of Justice. Mary stars as Captain Sharon Raydor on the TNT's hit drama series Major Crimes, the follow-up to The Closer, in which McDonnell originated the role and for which she earned a Primetime Emmy® nomination. McDonnell received her first Oscar nomination and Golden Globe® nomination for her portrayal of . Mary lives in Pacific Palisades, California with her husband, actor Randle Mell, and their two children, Olivia and Michael.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5ODc4MTcwM15BMl5BanBnXkFtZTgwNjI2Njk3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001521","name":"Mary McDonnell","idIMDB":"nm0001521"},"actorId":"nm0001521","character":"Elma Radnor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Will Oldham","urlProfile":"http://www.imdb.com/name/nm0646165","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWQxZGVkNmEtMDExMS00N2Y1LTliNjYtYTgwZThiYTVlMzhlXkEyXkFqcGdeQXVyNDQ3NDYwMTY@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 December 1970","placeOfBirth":" Louisville, Kentucky, USA","bio":"He has had a major recording career under numerous names: Palace, Palace Music, Palace Brothers, Palace Songs, Bonnie Prince Billy, and others. He is also known for strange, detached concert performances.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWQxZGVkNmEtMDExMS00N2Y1LTliNjYtYTgwZThiYTVlMzhlXkEyXkFqcGdeQXVyNDQ3NDYwMTY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0646165","name":"Will Oldham","nicknames":["Bonnie 'Prince' Billy"],"idIMDB":"nm0646165"},"actorId":"nm0646165","character":"Danny Radnor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Strathairn","urlProfile":"http://www.imdb.com/name/nm0000657","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MjI5MDg2MF5BMl5BanBnXkFtZTcwNjgwNDM3NQ@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 January 1949","placeOfBirth":" San Francisco, California, USA","birthName":"David Russell Strathairn","height":"5' 11½\" (1.82 m)","bio":"David Russell Strathairn was born on January 26, 1949 in San Francisco, California. He is the son of Mary Frances (Frazier), a nurse, and Thomas Scott Strathairn, Jr., a physician. He has two siblings, Tom and Anne. His ancestry includes English, Scottish, Irish, Portuguese, Native Hawaiian, and one sixteenth Chinese (the latter three from his paternal grandmother). Strathairn attended Williams College, where he demonstrated great interest in the theater, and first befriended John Sayles, with whom he would later frequently collaborate. Strathairn graduated college and traveled to Florida to visit with his grandfather, but the grandfather passed away while Strathairn was en route. Strathairn, finding himself freshly-arrived and without friends in Florida, decided instead to join the Ringling Brothers Clown College and subsequently worked as a clown for six months in a traveling circus. Relocating to New York State, he spent several years hitchhiking across America to work in local theaters during the summers. During one of these summers Strathairn reunited with Sayles, and this eventually resulted in his role in the highly regarded Return of the Secaucus Seven (1979), Sayle's directorial debut. Thereafter Strathairn developed an extensive resume of supporting roles, which became increasingly substantial as his stature in the industry grew; notable films include Lovesick (1983), Silkwood (1983), L.A. Confidential (1997), and A Map of the World (1999). Sayles frequently casts Strathairn, whose performances can be seen in Sayles' The Brother from Another Planet (1984), Matewan (1987), Eight Men Out (1988), City of Hope (1991), and Passion Fish (1992). Perhaps most notable of his collaborations with Sayles is his superb performance co-starring with Mary Elizabeth Mastrantonio in Limbo (1999). After a string of successful supporting roles in the early 2000s, Strathairn found himself thrust into the role of leading man with his performance as Edward R. Murrow in George Clooney's Good Night, and Good Luck. (2005) Taking on the role of the iconic newsman in the black-and-white drama, Strathairn garnered numerous award mentions including an Academy Award nomination for Best Actor. Following the success of that film, Strathairn traveled easily between low-budget independent films - The Notorious Bettie Page (2005), The Sensation of Sight (2006), My Blueberry Nights (2007), and Howl (2010) among them - and big-budget Hollywood productions, including We Are Marshall (2006), The Spiderwick Chronicles (2008), both The Bourne Ultimatum (2007) and The Bourne Legacy (2012), and Steven Spielberg's biopic Lincoln (2012), in which he plays Secretary of State William Seward. Strathairn has also worked extensively in television, and first became familiar to television viewers as the title character's boss in the series The Days and Nights of Molly Dodd (1987). In addition to narration work for many PBS shows, Strathairn has appeared in the TV series Big Apple (2001), The Sopranos (1999), Monk (2002), and heads the cast of the science-fiction series Alphas (2011). His work in television films has brought him an Emmy Award for Temple Grandin (2010) and an Emmy nominations for Hemingway & Gellhorn (2012). Strathairn married Logan Goodman in 1980, and the couple have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MjI5MDg2MF5BMl5BanBnXkFtZTcwNjgwNDM3NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000657","name":"David Strathairn","idIMDB":"nm0000657"},"actorId":"nm0000657","character":"Sid Hatfield","urlCharacter":"http://www.imdb.com/character/ch0268105","main":true},{"actorName":"Ken Jenkins","urlProfile":"http://www.imdb.com/name/nm0420898","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTIwNTQxOTA1NV5BMl5BanBnXkFtZTcwMTY1MDQwNA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1940","placeOfBirth":" Dayton, Ohio, USA","height":"5' 7½\" (1.71 m)","bio":"A versatile veteran of film, television and theater, Ken Jenkins began his acting career performing in high school theater productions in his hometown of Dayton, Ohio. \"I was fortunate to discover the world through the words of William Shakespeare, George Bernard Shaw, Arthur Miller and Tennessee Williams, and to discover in myself a love for the theater that has shaped my life\", says Jenkins. Jenkins went on to study acting at Antioch College while continuing to perform on Broadway and in regional companies throughout his college years. In 1969, he co-founded and served for three years as Associate Artistic Director for the prestigious Actor's Theatre of Louisville, which became known as a breeding ground for some of America's best new playwrights, including Beth Henley and Marsha Norman. Jenkins continued to work with the theater as an actor, director and writer through 1983. Over his 30 years in the theater, Jenkins has been associated with an average of 10 plays a year as an actor, director or playwright. He has portrayed \"Hamlet\" and \"Cyrano\" and performed in other classics by Shakespeare, Ibsen, Shaw and Molière. One of his favorite roles, however, was \"The Duke\", which he played opposite his son, Daniel Jenkins, in the 1985 Broadway musical, \"Big River\". In 1987, Jenkins appeared in John Sayles' critically acclaimed feature film, Matewan (1987) which opened the actor to the joys of acting for the camera. Most recently seen in The Sum of All Fears (2002) with Morgan Freeman and I Am Sam (2001) with Sean Penn, his other feature-film credits include Courage Under Fire (1996), The Abyss (1989), Air America (1990) and Last Man Standing (1996). Jenkins' television credits include a co-starring role for two seasons on Homefront (1991), two seasons on Wiseguy (1987) and guest-star roles on The X-Files (1993), Family Law (1999) and Chicago Hope (1994). He has also appeared in the television movies Thirst (1998), Hiroshima (1995), And the Band Played On (1993). Jenkins is an avid woodworker and a skilled dog trainer. He is married to Katharine Hepburn's niece, actress Katharine Houghton, probably best remembered as playing Hepburn & Tracy's daughter in the classic Guess Who's Coming to Dinner (1967).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTIwNTQxOTA1NV5BMl5BanBnXkFtZTcwMTY1MDQwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0420898","name":"Ken Jenkins","idIMDB":"nm0420898"},"actorId":"nm0420898","character":"Sephus Purcell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kevin Tighe","urlProfile":"http://www.imdb.com/name/nm0001798","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NjQ3NDU5Nl5BMl5BanBnXkFtZTcwMTE0NDg5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 August 1944","placeOfBirth":" Los Angeles, California, USA","birthName":"Jon Kevin Fishburn","height":"6' 1\" (1.85 m)","bio":"This beefy, genial-looking character actor was born Jon Kevin Fishburn in Los Angeles. Performing as a child from age 10, Tighe initially attended Pasadena City College. He later obtained a Master's Degree in Theater, then taught drama at USC. Living Bohemian-style out of a suitcase after he decided to pursue acting professionally, he was in the United Kingdom trying to obtain work at various prestigious theater companies when producer Jack Webb acquired his services for the Emergency! (1972) medical series alongside Robert Fuller, Julie London, Bobby Troup and Randolph Mantooth. Tighe gained TV stardom as paramedic Roy DeSoto and the series lasted six years. Along with that came a spin-off animated series and some follow-up TV-movies. He returned to acting study in order to refresh his skills during the slow \"post-Emergency\" period and managed to work with such inspiring notables as Stella Adler. His perseverance paid off with a steady stream of gray-haired character roles starting in the 80s -- predominantly in rugged fare. Although he made his Broadway debut with \"Open Admissions\" in 1984, the show folded after only a couple of weeks. On film, however, Kevin did quite well by appearing in such high-profile movies as Matewan (1987), where he first played a \"bad guy,\" Eight Men Out (1988), Road House (1989), Another 48 Hrs. (1990), City of Hope (1991), Newsies (1992), What's Eating Gilbert Grape (1993), Jade (1995) and Mumford (1999). On TV he has had a number of prime support rules over the years playing everything from Thomas Jefferson and William Randolph Hearst to the Kansas patriarch who was senselessly slaughtered along with his family by the \"In Cold Blood\" killers. Known for his serious-minded roles, Kevin has tackled a number of generals, attorneys, governors, doctors, coaches, even psychics during his long career. He won the Canadian \"Genie\" Award for his supporting role in A Man in Uniform (1993). His only child, Jennifer Tighe, is also an actress.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NjQ3NDU5Nl5BMl5BanBnXkFtZTcwMTE0NDg5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001798","name":"Kevin Tighe","idIMDB":"nm0001798"},"actorId":"nm0001798","character":"Hickey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gordon Clapp","urlProfile":"http://www.imdb.com/name/nm0163429","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODE2NjkzNTkyNF5BMl5BanBnXkFtZTgwMDM2MTYzODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 September 1948","placeOfBirth":" North Conway, New Hampshire, USA","birthName":"Gordon Allen Clapp","height":"5' 6\" (1.68 m)","bio":"Gordon Clapp is best known as the Emmy-winning, Tony-nominated actor who charmed audiences as Det. Greg Medavoy on NYPD Blue (1993) and as loudmouth instigator Dave Moss in the 2005 Tony Award-winning Broadway revival of David Mamet's Glengarry Glen Ross (1992). He will appear in the upcoming DreamWorks feature Flags of Our Fathers (2006), directed by Clint Eastwood. Clapp plays gruff General Holland \"Howlin' Mad\" Smith, who helps mastermind the capture of the Japanese island of Iwo Jima during World War II. NYPD Blue finished its twelfth and final season in March, 2005, garnering Clapp a 1998 Emmy Award for Best Supporting Actor in a Drama Series. Glengarry's limited run went from the following May through August, earning Clapp a Tony Award nomination for Best Featured Actor. Clapp has maintained a vibrant career on both sides of the camera. Films include Moonlight Mile (2002), Rules of Engagement (2000) and four films with director John Sayles - Sunshine State (2002), Matewan (1987), Eight Men Out (1988) and Return of the Secaucus Seven (1979). TV appearances include Law & Order: Special Victims Unit (1999), Without a Trace (2002), Deadwood (2004), Less Than Perfect (2002), American Family (2002), Wings (1990), Cheers (1982) and several TV movies. He also executive produced and starred in three short films: Trailer Talk (2006), Bananas (2004), and the award-winning Fast Cars & Babies (2003). Armed with a theater degree from prestigious Williams College, the New Hampshire native spent much of his early career in Canada, in regional and Toronto theater and as a company member of Ottawa's premiere National Arts Centre. His stage and TV work earned him nominations for a Dora Moore Award (Toronto's equivalent to the Tony) and Gemini Award (Canada's equivalent to the Emmy. American regional credits include the Philadelphia Drama Guild, Buffalo's Studio Arena and Boston's Huntington Theater. A talented writer, Clapp's work has appeared in the New York Post, LA Golf and Variety, which earned him a Los Angeles Press Club Award for his humorous account of winning an Emmy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODE2NjkzNTkyNF5BMl5BanBnXkFtZTgwMDM2MTYzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0163429","name":"Gordon Clapp","idIMDB":"nm0163429"},"actorId":"nm0163429","character":"Tom Griggs","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bob Gunton","urlProfile":"http://www.imdb.com/name/nm0348409","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MzY0MTQzM15BMl5BanBnXkFtZTcwMTM0ODYxNw@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 November 1945","placeOfBirth":" Santa Monica, California, USA","birthName":"Robert Patrick Gunton Jr.","height":"6' 2\" (1.88 m)","bio":"Bob Gunton was born on November 15, 1945 in Santa Monica, California, USA as Robert Patrick Gunton Jr. He is an actor, known for The Shawshank Redemption (1994), Argo (2012) and 24 (2008). He has been married to Carey Pitts since August 26, 2006. He was previously married to Annie McGreevey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MzY0MTQzM15BMl5BanBnXkFtZTcwMTM0ODYxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0348409","name":"Bob Gunton","idIMDB":"nm0348409"},"actorId":"nm0348409","character":"C.E. Lively","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jace Alexander","urlProfile":"http://www.imdb.com/name/nm0003167","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNjk1MjA2OF5BMl5BanBnXkFtZTcwOTM2ODQwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 April 1964","placeOfBirth":" New York City, New York, USA","birthName":"Jason Edward Alexander","bio":"Jace Alexander was born on April 7, 1964 in New York City, New York, USA as Jason Edward Alexander. He is a director and producer, known for Law & Order (1990), Rescue Me (2004) and Carry Me Home (2004). He has been married to Maddie Corman since September 6, 1998. They have three children. On July 29, 2015, Jace Alexander was charged with two felonies - one count of promoting a sexual performance by a child and one count of possessing an obscene sexual, performance by a child - and faces up to seven years in prison.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNjk1MjA2OF5BMl5BanBnXkFtZTcwOTM2ODQwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003167","name":"Jace Alexander","idIMDB":"nm0003167"},"actorId":"nm0003167","character":"Hillard Elkins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe Grifasi","urlProfile":"http://www.imdb.com/name/nm0341055","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyODA3MTg1M15BMl5BanBnXkFtZTYwOTk3ODAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 June 1944","placeOfBirth":" Buffalo, New York, USA","birthName":"Joseph G. Grifasi","height":"5' 5¾\" (1.67 m)","bio":"Joe Grifasi was born on June 14, 1944 in Buffalo, New York, USA as Joseph G. Grifasi. He is an actor, known for The Deer Hunter (1978), Batman Forever (1995) and 13 Going on 30 (2004). He has been married to Jane Ira Bloom since 1974.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyODA3MTg1M15BMl5BanBnXkFtZTYwOTk3ODAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0341055","name":"Joe Grifasi","idIMDB":"nm0341055"},"actorId":"nm0341055","character":"Fausto","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nancy Mette","urlProfile":"http://www.imdb.com/name/nm0582627","urlPhoto":"","biography":{"bio":"Nancy Mette is an actress, known for Terms of Endearment (1983), Crocodile Dundee (1986) and Matewan (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0582627","name":"Nancy Mette","idIMDB":"nm0582627"},"actorId":"nm0582627","character":"Bridey Mae","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jo Henderson","urlProfile":"http://www.imdb.com/name/nm0376481","urlPhoto":"","biography":{"dateOfBirth":"10 May 1934","placeOfBirth":" Buffalo, New York, USA","birthName":"Mary Josephine Henderson","bio":"Jo Henderson was born on May 10, 1934 in Buffalo, New York, USA as Mary Josephine Henderson. She was an actress, known for All My Children (1970), Matewan (1987) and Search for Tomorrow (1951). She was married to Myron Jones. She died on August 8, 1988 in Arizona, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0376481","name":"Jo Henderson","idIMDB":"nm0376481"},"actorId":"nm0376481","character":"Mrs. Elkins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Josh Mostel","urlProfile":"http://www.imdb.com/name/nm0609215","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMDI0OTcyN15BMl5BanBnXkFtZTcwNjc5NDMxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 December 1946","placeOfBirth":" New York City, New York, USA","height":"5' 9\" (1.75 m)","bio":"The son of Broadway and film star Zero Mostel, Joshua Mostel is every bit the \"heavyweight\" that his father was -- perhaps even heavier. A graduate of Brandeis University, Mostel followed his father's sizable footsteps by going on-stage. His first major film appearance was as King Herod -- complete with anachronistic psychedelic costuming, and surrounded by go-go girls -- in Jesus Christ, Superstar (1973). Of his three regular assignments on series television, Mostel is probably least proud of his role as Blotto, younger brother of John Belushi's Blutto, in Delta House (1978), the mercifully short-lived TV spin-off of National Lampoon's Animal House. Conversely, one of Joshua Mostel's best film roles was the fish-peddling Uncle Abe in Woody Allen's Radio Days (1987).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMDI0OTcyN15BMl5BanBnXkFtZTcwNjc5NDMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0609215","name":"Josh Mostel","idIMDB":"nm0609215"},"actorId":"nm0609215","character":"Cabell Testerman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary McCleery","urlProfile":"http://www.imdb.com/name/nm0565728","urlPhoto":"","biography":{"bio":"Gary McCleery is an actor, known for Matewan (1987), Étoile (1989) and Hard Choices (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0565728","name":"Gary McCleery","idIMDB":"nm0565728"},"actorId":"nm0565728","character":"Ludie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maggie Renzi","urlProfile":"http://www.imdb.com/name/nm0719964","urlPhoto":"","biography":{"height":"5' 5\" (1.65 m)","bio":"John Sayles and Maggie Renzi have been creative partners, in their life and in their art, since the early '70s. They met as students at Williams College in Massachusetts. John was a member of the class of 1972 and Maggie was member of the class of 1973. In the years immediately after graduation, Maggie worked as a bookstore clerk, a pediatric receptionist, a substitute teacher, a casting agent and a talent agent, while John took jobs like nursing home orderly and meat packer. In the late '70s they moved to California for a few years. John worked for Roger Corman's New World Pictures, and Maggie worked as a salad chef. In 1979 they released their first film: Return of the Secaucus Seven (1979). John wrote the screenplay, and directed and edited the film. He also played the supporting role of Howie', a townie who has three kids before his 30th birthday. Maggie starred as 'Kate', the high school English teacher who invites all her college buddies up to her New Hampshire home for their annual reunion. She also served as Unit Manager and Assistant Editor. The Return of the Secaucus Seven became an art house and campus hit, winning the Los Angeles Film Critics' Award for Best Screenplay, and launching Sayles and Renzi on their way as independent filmmakers. Beginning with their second film, Lianna (1983), Maggie assumed the role of Producer. While she continued to act, her producing responsibilities grew on each subsequent film, and she finally decided to focus just on producing after Passion Fish (1992) was released in 1992. She worked as part of a team of producers on the early films, but on the two most recent films Limbo (1999) and Sunshine State (2002), she is credited as sole producer. In 2000, Maggie was one of the producers of Girlfight (2000), the award-winning first feature made by Karyn Kusama (who began her film career on Sayles/Renzi production teams). However, Maggie says she is not planning to produce other non-Sayles films.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0719964","name":"Maggie Renzi","idIMDB":"nm0719964"},"actorId":"nm0719964","character":"Rosaria","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0093509","urlIMDB":"http://www.imdb.com/title/tt0093509","business":{"budget":{"money":"$4,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 15 min (135 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["DuArt Film Laboratories Inc., New York, USA (processing)"],"filmLength":null,"negativeFormat":["35 mm (Eastman 250D 5297)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.9","filmingLocations":[{"location":"New River Gorge, New River Gorge National River, West Virginia, USA"}],"rated":"PG-13","awards":[{"award":"Academy Awards, USA 1988","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Cinematography","names":[{"name":"Haskell Wexler","id":"nm0005549","role":null}]}]}]},{"award":"American Society of Cinematographers, USA 1988","titlesAwards":[{"titleAwardOutcome":"Nominated ASC Award","categories":[{"category":"Outstanding Achievement in Cinematography in Theatrical Releases","names":[{"name":"Haskell Wexler","id":"nm0005549","role":null}]}]}]},{"award":"Deauville Film Festival 1987","titlesAwards":[{"titleAwardOutcome":"Nominated Critics Award","categories":[{"category":"","names":[{"name":"John Sayles","id":"nm0000626","role":null}]}]}]},{"award":"Film Independent Spirit Awards 1988","titlesAwards":[{"titleAwardOutcome":"Won Independent Spirit Award","categories":[{"category":"Best Cinematography","names":[{"name":"Haskell Wexler","id":"nm0005549","role":null}]}]},{"titleAwardOutcome":"Nominated Independent Spirit Award","categories":[{"category":"Best Feature","names":[{"name":"Peggy Rajski","id":"nm0707475","role":null},{"name":"Maggie Renzi","id":"nm0719964","role":null}]},{"category":"Best Director","names":[{"name":"John Sayles","id":"nm0000626","role":null}]},{"category":"Best Supporting Male","names":[{"name":"James Earl Jones","id":"nm0000469","role":null}]},{"category":"Best Screenplay","names":[{"name":"John Sayles","id":"nm0000626","role":null}]},{"category":"Best Supporting Male","names":[{"name":"David Strathairn","id":"nm0000657","role":null}]}]}]},{"award":"Political Film Society, USA 1988","titlesAwards":[{"titleAwardOutcome":"Won PFS Award","categories":[{"category":"Human Rights","names":[]}]}]}],"votes":"6,084","type":"Movie","companyCreditsSimple":[{"idCompany":"co0046677","name":"Cinecom Entertainment Group"},{"idCompany":"co0005274","name":"Film Gallery"},{"idCompany":"co0045569","name":"Goldcrest Films International"}],"keywords":{"keywords":["union","miner","coal miner","1920s","labor union","west virginia","labor","starving","starving child","confession under torture","street shootout","union movement","written and directed by cast member","one word title","town name in title","church","voice over narration","coal town","throat slitting","medal","labor violence","labor relations","labor movement","labor leader","coal mining","xenophobia","world war one veteran","widow","train","small town","shootout","sermon","sabotage","rape accusation","railway station","racial slur","police chief","murder","mother son relationship","mayor","loss of son","labor strike","labor activist","italian american","immigrant","gun for hire","fire","eviction","eavesdropping","drugstore","coal mine","clothes line","boy minister","boarding house","betrayal","backwoods","ambush","african american","racism","mining camp","appalachia","based on true story","independent film","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 23:35:45"}}