{"data":{"movies":[{"title":"It's a Wonderful Life","originalTitle":"","year":"1946","releaseDate":"19470107","directors":[{"name":"Frank Capra","id":"nm0001008"}],"writers":[{"name":"Frances Goodrich","id":"nm0329304"},{"name":"Albert Hackett","id":"nm0352443"}],"runtime":"130 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMzY5NDc4M15BMl5BanBnXkFtZTcwMzc4NjIxNw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Family","Fantasy"],"plot":"George Bailey has spent his entire life giving of himself to the people of Bedford Falls. He has always longed to travel but never had the opportunity in order to prevent rich skinflint Mr. Potter from taking over the entire town. All that prevents him from doing so is George's modest building and loan company, which was founded by his generous father. But on Christmas Eve, George's Uncle Billy loses the business's $8,000 while intending to deposit it in the bank. Potter finds the misplaced money and hides it from Billy. When the bank examiner discovers the shortage later that night, George realizes that he will be held responsible and sent to jail and the company will collapse, finally allowing Potter to take over the town. Thinking of his wife, their young children, and others he loves will be better off with him dead, he contemplates suicide. But the prayers of his loved ones result in a gentle angel named Clarence coming to earth to help George, with the promise of earning his ...","simplePlot":"An angel is sent from Heaven to help a desperately frustrated businessman by showing him what life would have been like if he had never existed.","actors":[{"actorName":"James Stewart","urlProfile":"http://www.imdb.com/name/nm0000071","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNzMzODY0NV5BMl5BanBnXkFtZTcwMDk3NDQyOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 May 1908","placeOfBirth":" Indiana, Pennsylvania, USA","birthName":"James Maitland Stewart","height":"6' 3\" (1.91 m)","bio":"James Maitland Stewart was born on 20 May 1908 in Indiana, Pennsylvania, to Elizabeth Ruth (Johnson) and Alexander Maitland Stewart, who owned a hardware store. He was of Scottish, Ulster-Scots, and some English, descent. Stewart was educated at a local prep school, Mercersburg Academy, where he was a keen athlete (football and track), musician (singing and accordion playing), and sometime actor. In 1929 he won a place at Princeton, where he studied architecture with some success and became further involved with the performing arts as a musician and actor with the University Players. After graduation, engagements with the University Players took him around the northeastern United States, including a run on Broadway in 1932. But work dried up as the Great Depression deepened, and it wasn't until 1934, when he followed his friend Henry Fonda to Hollywood, that things began to pick up. After his first screen appearance in Art Trouble (1934), he worked for a time for MGM as a contract player and slowly began making a name for himself in increasingly high-profile roles throughout the rest of the 1930s. His famous collaborations with Frank Capra, in You Can't Take It with You (1938), Mr. Smith Goes to Washington (1939), and, after World War II, It's a Wonderful Life (1946) helped to launch his career as a star and to establish his screen persona as the likable everyman. Having learned to fly in 1935, he was drafted into the U.S. Army in 1940 as a private (after twice failing the medical for being underweight). During the course of World War II he rose to the rank of colonel, first as an instructor at home in the United States, and later on combat missions in Europe. He remained involved with the U.S. Air Force Reserve after the war and retired in 1959 as a brigadier general. Stewart's acting career took off properly after the war. During the course of his long professional life he had roles in some of Hollywood's best remembered films, starring in a string of Westerns (bringing his \"everyman\" qualities to movies like The Man Who Shot Liberty Valance (1962)), biopics (The Stratton Story (1949), The Glenn Miller Story (1954), and The Spirit of St. Louis (1957), for instance) thrillers (most notably his frequent collaborations with Alfred Hitchcock) and even some screwball comedies . He continued to work into the 1990s and died at the age of 89 in 1997.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNzMzODY0NV5BMl5BanBnXkFtZTcwMDk3NDQyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000071","name":"James Stewart","nicknames":["Jimmy"],"idIMDB":"nm0000071"},"actorId":"nm0000071","character":"George Bailey","urlCharacter":"http://www.imdb.com/character/ch0004658","main":true},{"actorName":"Donna Reed","urlProfile":"http://www.imdb.com/name/nm0001656","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNzA4MDc4NV5BMl5BanBnXkFtZTYwNTU2ODU2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1921","placeOfBirth":" Denison, Iowa, USA","birthName":"Donnabelle Mullenger","height":"5' 3½\" (1.61 m)","bio":"Donna Reed was born in the midwestern town of Denison, Iowa, on January 27, 1921, as Donna Belle Mullenger. A small town - a population of less than 3,000 people - Denison was located by the Boyer River, and was the county seat of Crawford County. Donna grew up as a farm girl, much like many young girls in western Iowa, except for one thing - Donna was very beautiful. That wasn't to say that others weren't as pretty, it's just that Donna's beauty stood out from all the other local girls, so much so that she won a beauty contest in Denison. Upon graduation from high school Donna left for college in Los Angeles, in the hopes of eventually entering movies. While at Los Angeles City College, she pursued her dream by participating in several college stage productions. In addition to the plays, she also won the title of Campus Queen. At one of those stage plays Donna was spotted by an MGM talent scout and was signed to a contract. Her first film was a minor role in MGM's The Getaway (1941). That was followed by a small part in Babes on Broadway (1941), with Mickey Rooney and Judy Garland as a secretary. Afterwards, MGM began giving her better parts, in films such as The Bugle Sounds (1942), The Courtship of Andy Hardy (1942) and The Man from Down Under (1943). In 1944 she received second billing playing Carol Halliday in See Here, Private Hargrove (1944), a comedy about a reporter drafted into the army who eventually meets up with Donna's character as a worker in the canteen. The following year Donna starred in The Picture of Dorian Gray (1945), her best role to date. It was a love story set in London in 1890. It got mixed critical reviews but did well at the box-office. Donna was now one of the leading ladies of Hollywood. In 1946 she starred in what is probably her best-known role, as the wife of James Stewart in the classic It's a Wonderful Life (1946). This timeless story is a holiday staple to this day. The film also starred Lionel Barrymore and Thomas Mitchell. The next year Donna starred as Ann Daniels in Paramount's Beyond Glory (1948) with Alan Ladd, which did well at the box-office. Her next role was the strongest she had had yet--Chicago Deadline (1949), again with Ladd. It was one of the best mystery dramas to come out of Hollywood in a long time, and did very well at the box office. As the 1940s faded out and the 1950s stormed in, Donna's roles got bigger but were mainly of the wholesome, girl-next-door type. In 1953, however, she starred as the hostess Alma in the widely acclaimed From Here to Eternity (1953). She was so good in that film she was nominated for and won the Academy Award for Best Supporting Actress, beating out such veterans as Thelma Ritter and Marjorie Rambeau. The film itself won for Best Picture and remains a classic to this day. Later that year Donna starred in The Caddy (1953), a comedy with Jerry Lewis and Dean Martin. Three years later she landed the role of Sacajawea in The Far Horizons (1955), the story of the Lewis and Clark Expedition, starring Charlton Heston and Fred MacMurray. After finishing The Whole Truth (1958), Donna began her own TV series (produced by her husband), The Donna Reed Show (1958), a hit that ran for eight years. She was so effective in the show that she was nominated for TV's prestigious Emmy Award as Best Actress every year from 1959-1962. She was far more popular in TV than on the screen. After the run of the program, Donna took some time away from show business before coming back in a couple of made-for-TV movies (in 1974, she had made a feature called Yellow-Headed Summer (1974), but it was never released). She did get the role of Ellie Ewing Farlow in the hit TV series Dallas (1978) during the 1984-85 season. It was to be her final public performance. On January 14, 1986, less than two weeks before her 65th birthday, she died of pancreatic cancer in Beverly Hills, California. Grover Asmus, her husband, created the Donna Reed Foundation for the Performing Arts in her hometown of Denison. The foundation helps others who desire a career in the arts. Donna never forgot her roots. She was still a farm girl at heart.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNzA4MDc4NV5BMl5BanBnXkFtZTYwNTU2ODU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001656","name":"Donna Reed","idIMDB":"nm0001656"},"actorId":"nm0001656","character":"Mary Hatch","urlCharacter":"http://www.imdb.com/character/ch0004663","main":true},{"actorName":"Lionel Barrymore","urlProfile":"http://www.imdb.com/name/nm0000859","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NzY5MTgwNV5BMl5BanBnXkFtZTYwMjc4NjQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1878","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Lionel Herbert Blythe","height":"5' 11\" (1.8 m)","bio":"Famed actor, composer, artist, author and director. His talents extended to the authoring of the novel \"Mr. Cartonwine: A Moral Tale\" as well as his autobiography. In 1944, he joined ASCAP, and composed \"Russian Dances\", \"Partita\", \"Ballet Viennois\", \"The Woodman and the Elves\", \"Behind the Horizon\", \"Fugue Fantasia\", \"In Memorium\", \"Hallowe'en\", \"Preludium & Fugue\", \"Elegie for Oboe, Orch.\", \"Farewell Symphony (1-act opera)\", \"Elegie (piano pieces)\", \"Rondo for Piano\" and \"Scherzo Grotesque\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NzY5MTgwNV5BMl5BanBnXkFtZTYwMjc4NjQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000859","name":"Lionel Barrymore","idIMDB":"nm0000859"},"actorId":"nm0000859","character":"Mr. Potter","urlCharacter":"http://www.imdb.com/character/ch0004662","main":true},{"actorName":"Thomas Mitchell","urlProfile":"http://www.imdb.com/name/nm0593775","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTcwNjAwMDI2M15BMl5BanBnXkFtZTcwNDMyNTUwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1892","placeOfBirth":" Elizabeth, New Jersey, USA","birthName":"Thomas John Mitchell","height":"5' 10\" (1.78 m)","bio":"Thomas Mitchell was one of the great American character actors, whose credits read like a list of the greatest films of the 20th century: Lost Horizon (1937); Stagecoach (1939); The Hunchback of Notre Dame (1939); Mr. Smith Goes to Washington (1939); Gone with the Wind (1939); It's a Wonderful Life (1946) and High Noon (1952). His portrayals are so diverse and convincing that most people don't even realize that one actor could have played them all. He won a Best Supporting Actor Oscar in 1940 for his role as the drunken Doc Boone in John Ford's Stagecoach (1939).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTcwNjAwMDI2M15BMl5BanBnXkFtZTcwNDMyNTUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0593775","name":"Thomas Mitchell","nicknames":["Tommy"],"idIMDB":"nm0593775"},"actorId":"nm0593775","character":"Uncle Billy","urlCharacter":"http://www.imdb.com/character/ch0004669","main":true},{"actorName":"Henry Travers","urlProfile":"http://www.imdb.com/name/nm0871287","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxOTA4ODA1MTdeQTJeQWpwZ15BbWU3MDY1MTAwMjg@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 March 1874","placeOfBirth":" Prudhoe, Northumberland, England, UK","birthName":"Travers John Hegarty","height":"5' 4½\" (1.64 m)","bio":"British-born Henry Travers was a veteran of the English stage before emigrating to the U.S. in 1917. He gained more stage experience there on Broadway working with the Theatre Guild, and began his long film career with Reunion in Vienna (1933). Travers' kindly, grandfatherly demeanor became familiar to filmgoers over the next 25 years, especially in films like High Sierra (1941), where he played Joan Leslie's kindly but slyly observant uncle, and the generous Mr. Bogardus in The Bells of St. Mary's (1945), but it's as the somewhat befuddled angel Clarence Oddbody assigned to James Stewart in the classic It's a Wonderful Life (1946) that Travers will forever be known. After a long and successful career, he retired from the screen in 1949, and died in Hollywood in 1965.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxOTA4ODA1MTdeQTJeQWpwZ15BbWU3MDY1MTAwMjg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0871287","name":"Henry Travers","idIMDB":"nm0871287"},"actorId":"nm0871287","character":"Clarence","urlCharacter":"http://www.imdb.com/character/ch0004666","main":true},{"actorName":"Beulah Bondi","urlProfile":"http://www.imdb.com/name/nm0094135","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyODAzNTIyOF5BMl5BanBnXkFtZTcwMzEwNjk5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 May 1889","placeOfBirth":" Chicago, Illinois, USA","birthName":"Beulah Bondy","height":"5' 5\" (1.65 m)","bio":"Character actress Beulah Bondi was a favorite of directors and audiences and is one of the reasons so many films from the 1930s and 1940s remain so enjoyable, as she was an integral part of many of the ensemble casts (a hallmark of the studio system) of major and/or great films, including The Trail of the Lonesome Pine (1936), Mr. Smith Goes to Washington (1939), Our Town (1940) and Penny Serenade (1941). Highly respected as a first-tier character actress, Bondi won two Best Supporting Actress Oscar nominations, for The Gorgeous Hussy (1936) and Of Human Hearts (1938), and an Emmy Award in 1976 for her turn in the television program The Waltons (1971). She was born Beulah Bondy on May 3, 1888, in Chicago, and established herself as a stage actress in the first phase of her career. She made her Broadway debut in Kenneth S. Webb's \"One of the Family\" at the 49th Street Theatre on December 21, 1925. The show was a modest hit, racking up 238 performances. She next appeared in another hit, Maxwell Anderson's \"Saturday's Children,\" which ran for 326 performances, before appearing in her first flop, Clemence Dane's \"Mariners\" in 1927. Philip Barry's and Elmer Rice's \"Cock Robin\" was an extremely modest hit in 1928, reaching the century mark (100 performances), but it was Bondi's performance in Rice's \"Street Scene,\" which opened at the Playhouse Theatre on Jamuary 10, 1929, that made her career. This famous play won Rice the 1929 Pulitzer Prize for Drama and was a big hit, playing for 601 performances. Most importantly, though, it brought Bondi to the movies at the advanced age of 43. She made her motion picture debut in 1931 in the movie adaptation (Street Scene (1931)), recreating the role she had originated on the Broadway stage. The talkies were still new, and she had the talent and the voice to thrive in Hollywood. Bondi appeared in four more Broadway plays from 1931 to 1934, only one of which, \"The Late Christopher Bean\", a comedy by Sidney Howard, was a hit. Her last appearance on Broadway for a generation was in a flop staged by Melvyn Douglas, \"Mother Lode\" (she made two more appearances on the Great White Way, in \"Hilda Crane\" (1950) and \"On Borrowed Time\" in 1953; neither was a success). For the rest of her professional life, her career lay primarily in film and television. She was typecast as mothers and, later, grandmothers, and played James Stewart's mother four times, most famously as \"Ma Bailey\" in It's a Wonderful Life (1946). Her greatest role is considered her turn in Leo McCarey's Depression-era melodrama Make Way for Tomorrow (1937), in which she played a mother abandoned by her children. Beulah Bondi died on January 1, 1981, from complications from an accident, when she broke her ribs after falling over her cat. She was 92 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyODAzNTIyOF5BMl5BanBnXkFtZTcwMzEwNjk5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0094135","name":"Beulah Bondi","idIMDB":"nm0094135"},"actorId":"nm0094135","character":"Mrs. Bailey","urlCharacter":"http://www.imdb.com/character/ch0004667","main":true},{"actorName":"Frank Faylen","urlProfile":"http://www.imdb.com/name/nm0269709","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzODQ1Njk0NF5BMl5BanBnXkFtZTYwNDkwMTM2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 December 1905","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Francis Charles Ruf","height":"5' 10\" (1.78 m)","bio":"American character actor who specialized in average-guy parts and who could be equally effective in sympathetic or unlikeable roles. His parents, the vaudeville team of Ruf and Cusik, took him onstage with them when he was a baby, and Faylen grew up in the theatre. He attended St. Joseph's Preparatory College in Kirkwood, Missouri, but returned to vaudeville as a comic pantomimist. He toured the country throughout the late Twenties and early Thirties as a clown and later as song-and-dance man with acrobatic agility. During a tour stop in Los Angeles, he was screen tested and began a thirty-year career as one of Hollywood's most familiar character players. His most famous film roles were as the vicious male nurse Bim in The Lost Weekend (1945) and as the cabdriver Ernie in It's a Wonderful Life (1946). But his greatest fame came in television, particularly as Dobie's dad Herbert T. Gillis in The Many Loves of Dobie Gillis (1959). Faylen was married to actress Carol Hughes, with whom he had two daughters. He retired after Funny Girl (1968), and died in 1985.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzODQ1Njk0NF5BMl5BanBnXkFtZTYwNDkwMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0269709","name":"Frank Faylen","idIMDB":"nm0269709"},"actorId":"nm0269709","character":"Ernie","urlCharacter":"http://www.imdb.com/character/ch0004664","main":true},{"actorName":"Ward Bond","urlProfile":"http://www.imdb.com/name/nm0000955","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNDA1Nzk5OF5BMl5BanBnXkFtZTcwMzE2NDQyOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1903","placeOfBirth":" Benkelman, Nebraska, USA","birthName":"Wardell E. Bond","height":"6' 2\" (1.88 m)","bio":"Gruff, burly American character actor. Born in 1903 in Benkelman, Nebraska (confirmed by Social Security records; sources stating 1905 or Denver, Colorado are in error.) Bond grew up in Denver, the son of a lumberyard worker. He attended the University of Southern California, where he got work as an extra through a football teammate who would become both his best friend and one of cinema's biggest stars: John Wayne. Director John Ford promoted Bond from extra to supporting player in the film Salute (1929), and became another fast friend. An arrogant man of little tact, yet fun-loving in the extreme, Bond was either loved or hated by all who knew him. His face and personality fit perfectly into almost any type of film, and he appeared in hundreds of pictures in his more than 30-year career, in both bit parts and major supporting roles. In the films of Wayne and Ford, particularly, he was nearly always present. Among his most memorable roles are John L. Sullivan in Gentleman Jim (1942), Det. Tom Polhaus in The Maltese Falcon (1941) and the Rev. Capt. Samuel Johnson Clayton The Searchers (1956). An ardent but anti-intellectual patriot, he was perhaps the most vehement proponent, among the Hollywood community, of blacklisting in the witch hunts of the 1950s, and he served as a most unforgiving president of the ultra-right-wing Motion Picture Alliance for the Preservation of American Ideals. In the mid-'50s he gained his greatest fame as the star of TV's Wagon Train (1957). During its production, Bond traveled to Dallas, Texas, to attend a football game and died there in his hotel room of a massive heart attack.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNDA1Nzk5OF5BMl5BanBnXkFtZTcwMzE2NDQyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000955","name":"Ward Bond","idIMDB":"nm0000955"},"actorId":"nm0000955","character":"Bert","urlCharacter":"http://www.imdb.com/character/ch0004668","main":true},{"actorName":"Gloria Grahame","urlProfile":"http://www.imdb.com/name/nm0002108","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNTgyNjMxOF5BMl5BanBnXkFtZTYwNTgwMTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 November 1923","placeOfBirth":" Los Angeles, California, USA","birthName":"Gloria Hallward","height":"5' 6\" (1.68 m)","bio":"Gloria Hallward, an acting pupil of her mother (stage actress and teacher Jean Grahame), acted professionally while still in high school. In 1944 Louis B. Mayer saw her on Broadway and gave her an MGM contract under the name Gloria Grahame. Her debut in the title role of Blonde Fever (1944) was auspicious, but her first public recognition came on loan-out in It's a Wonderful Life (1946). Though her talent and sex appeal were of star quality, she did not fit the star pattern at MGM, who sold her contract to RKO in 1947. Here the same problem resurfaced; her best film in these years was made on loan-out, In a Lonely Place (1950). Soon after, she left RKO. The 1950s, her best period, brought Gloria a supporting actress Oscar and typecast her as shady, inimitably sultry ladies in seven well-known film-noir classics. Rumors of being difficult to work with on the set of Oklahoma! (1955) sidelined her film career from 1956 onward. She also suffered from marital and child-custody troubles. Eight years after divorce from Nicholas Ray, who was 12 years her senior (and reportedly had discovered her in bed with his 13 year old son), and after a subsequent marriage to Cy Howard ended in divorce, in 1960 she married her former stepson Anthony Ray who was almost 14 years younger than her. This led Nicholas Ray and Cy Howard to each sue for custody of each's child by Grahame, putting gossip columnists and scandal sheets into overdrive. In 1960 she resumed stage acting, combined with TV work and, from 1970, some mostly inferior films. Gloria was described as a serious, skillful actress; spontaneous, honest, and strong-willed; imaginative and curious; incredibly sexy but insecure about her looks (prompting plastic surgery on her famous lips); loving appreciative male company; \"a bit loony.\" Her busiest period of British and American stage work ended abruptly in 1981 when she collapsed from cancer symptoms during a rehearsal. She returned to New York a few hours before she succumbed on October 5, 1981 at age 57.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNTgyNjMxOF5BMl5BanBnXkFtZTYwNTgwMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002108","name":"Gloria Grahame","idIMDB":"nm0002108"},"actorId":"nm0002108","character":"Violet","urlCharacter":"http://www.imdb.com/character/ch0186476","main":true},{"actorName":"H.B. Warner","urlProfile":"http://www.imdb.com/name/nm0912478","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1Mjc2NjgwMl5BMl5BanBnXkFtZTcwNTM4NDYwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1875","placeOfBirth":" London, England, UK","birthName":"Harry Byron Warner","height":"6' 0½\" (1.84 m)","bio":"Henry Byron Warner was the definitive cinematic Jesus Christ in Cecil B. DeMille's The King of Kings (1927). He was born into a prominent theatrical family on October 26, 1875 in London. His father was Charles Warner, and his grandfather was James Warner, both prominent English actors. He replaced J.B. Warner as Jesus in The King of Kings (1927) when J.B. died of tuberculosis at age 29. (J.B. was not Henry's brother. J.B. had taken the professional last name \"Warner\" because Henry's family took him in.) Henry Warner's family wanted him to become a doctor, and he graduated from London University but eventually gave up his medical studies. The theater was in his blood, and he studied acting in Paris and Italy before joining his father's stock company, making his debut in the English production of \"Drink.\" It was from his father that he honed his craft. Warner made it to America in the early 1900s, after touring the British Empire. Billed as Harry Warner, he made his Broadway debut in the American colonial drama \"Audrey\" at Hoyt's Theatre on November 24, 1902, starring James O'Neill, the father of playwright Eugene O'Neill. He was billed as H.B. Warner in his next appearance on Broadway, in the 1906 comedy \"Nurse Marjorie.\" He appeared in 13 more Broadway productions in his career, from the twin-bill of \"Susan in Search of a Husband\" & \"A Tenement Tragedy\" (also 1906) to \"Silence\" in 1925. He moved into motion pictures, making his debut in the Mutual short Harp of Tara (1914). Also in 1914, he appeared in a film written by Cecil B. DeMille for Famous Players Lasky, The Ghost Breaker (1914), in which he had played on Broadway the year before. Warner became a leading man and a star in silent pictures, reaching the zenith of his career playing Jesus in DeMille's The King of Kings (1927). His excellent performance was actually enhanced by the silent screen, allowing the audience to imagine how Jesus would sound. Warner could be extremely moving in silent pictures, notably in the melodrama Sorrell and Son (1927) as a war veteran father who sacrifices all for his son. When talkies arrived, he became a busy supporting player. A favorite of Frank Capra, appeared in Mr. Deeds Goes to Town (1936). Cast again by Capra, he was nominated for Best Supporting Actor in Lost Horizon (1937). He also appeared in You Can't Take It with You (1938), and Mr. Smith Goes to Washington (1939). Other major talkies included The Devil and Daniel Webster (1941) and Topper Returns (1941). Other than Jesus, the role he is best remembered role for today is in It's a Wonderful Life (1946), in which he played Mr. Gower, the druggist who is saved from committing a lethal medication error by the young George Bailey (the James Stewart character as a child). H.B. Warner appeared in Sunset Boulevard (1950) as himself. His last credited role was as Amminadab in DeMille's The Ten Commandments (1956), a remake of the earlier silent The Ten Commandments (1923). He last role was an uncredited bit part in Darby's Rangers (1958). Henry Warner died on December 21, 1958 in Woodland Hills, California. He was 83 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1Mjc2NjgwMl5BMl5BanBnXkFtZTcwNTM4NDYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0912478","name":"H.B. Warner","idIMDB":"nm0912478"},"actorId":"nm0912478","character":"Mr. Gower","urlCharacter":"http://www.imdb.com/character/ch0186477","main":true},{"actorName":"Frank Albertson","urlProfile":"http://www.imdb.com/name/nm0007214","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MDQzNDAzN15BMl5BanBnXkFtZTcwMzc0Nzg5Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 February 1909","placeOfBirth":" Fergus Falls, Minnesota, USA","birthName":"Francis Healey Albertson","height":"5' 9\" (1.75 m)","bio":"Frank Albertson entered the film industry in 1922 as a prop boy, but soon graduated into acting. He was a prolific and reliable character actor who occasionally played the lead in a \"B\" picture, but was used mainly as a supporting actor in scores of films, often cast as a wisecracking cab driver, a cop or a reporter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MDQzNDAzN15BMl5BanBnXkFtZTcwMzc0Nzg5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0007214","name":"Frank Albertson","nicknames":["Frankie"],"idIMDB":"nm0007214"},"actorId":"nm0007214","character":"Sam Wainwright","urlCharacter":"http://www.imdb.com/character/ch0004675","main":true},{"actorName":"Todd Karns","urlProfile":"http://www.imdb.com/name/nm0439851","urlPhoto":"","biography":{"dateOfBirth":"15 January 1921","placeOfBirth":" Hollywood, California, USA","birthName":"Roscoe Todd Karns","bio":"Son of character actor Roscoe Karns. They appeared together for 5 years in the live televisionshow 'Rocky King, Detective'. The last 30 years Todd Karns had his own theatre near Guadalajara, Mexico.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0439851","name":"Todd Karns","nicknames":["Rocky"],"idIMDB":"nm0439851"},"actorId":"nm0439851","character":"Harry Bailey","urlCharacter":"http://www.imdb.com/character/ch0004659","main":true},{"actorName":"Samuel S. Hinds","urlProfile":"http://www.imdb.com/name/nm0385594","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjE2NTQ4MDQtZWZiZi00MzJhLWJiMDAtZGI1NmQ4NmIwZjc0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1875","placeOfBirth":" Brooklyn, New York, USA","birthName":"Samuel Southey Hinds","bio":"Samuel S. Hinds, a Harvard graduate, was a lawyer in Hollywood until the stock market crash of 1929, in which he lost most of his money. Hinds, who had an interest in theater acting, decided to embark on a career in acting, albeit it age 54. The tall, dignified-looking Hinds appeared in over 200 films, often cast as kindly authoritarian figures--doctors, judges, military officers, politicians, and such. His two most notable appearances were in Destry Rides Again (1939) and It's a Wonderful Life (1946). In addition to his film work, he kept busy appearing on stage, and continued working up until his death in 1948.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjE2NTQ4MDQtZWZiZi00MzJhLWJiMDAtZGI1NmQ4NmIwZjc0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0385594","name":"Samuel S. Hinds","idIMDB":"nm0385594"},"actorId":"nm0385594","character":"Pa Bailey","urlCharacter":"http://www.imdb.com/character/ch0004671","main":true},{"actorName":"Mary Treen","urlProfile":"http://www.imdb.com/name/nm0871695","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5ODcyOTQ0NV5BMl5BanBnXkFtZTgwMzIwNDEzMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 March 1907","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Mary Louise Summers","height":"5' 9\" (1.75 m)","bio":"About as reliable as one could ever find, character actress Mary Treen was a familiar face to most and could always be counted on to bring a bit of levity to any film scene. A minor actress for much of her career, she managed to secure a plain, unassuming niche for herself in 40s, 50s and 60s Hollywood. She was born Mary Louise Treen in St. Louis, Missouri in 1907, her father dying while she was still an infant. Raised in California by her mother, who once performed under the stage name Helene Sullivan, and her stepfather, a physician, she attended the Westlake School for Girls as well as a convent where she tried out successfully in school plays. Mary began dancing in vaudeville shows and revues before seeking her fame in the movies. Tall (5'9\") and stringy-framed, she formed a musical comedy duo with Marjorie Barnett, who was 5'3\", billing themselves as \"Treen and Barnett: Two Unsophisticated Vassar Co-eds.\" Much of their comedy was centered around their difference in height. Not a beauty by Hollywood standards, Mary relied on humor to get attention. In 1934, Warner Brothers signed her up after seeing her in a local play. After three years, she freelanced. Her scores of pudgy-cheeked nurses, waitresses, career girls, wallflowers and confidantes enhanced many a comedy or, at the very least, offered a brief respite in a heavier drama. In the long run, however she deserved better. A few of Mary's highlights would include the films Kentucky Moonshine (1938), I Love a Soldier (1944) (the role was written especially for her), Don Juan Quilligan (1945), and the Christmas classic It's a Wonderful Life (1946) (as James Stewart's cousin Tilly). In later years both Jerry Lewis and Elvis Presley utilized her talents in their movie vehicles. On TV Mary was given a bit more to do and actually stole a few scenes as the arch maid Hilda on The Joey Bishop Show (1961) for three seasons. She typically guested on lightweight sitcoms such as \"The Andy Griffith Show,\" \"Green Acres,\" \"Here's Lucy,\" \"Happy Days\" and \"The Dukes of Hazzard.\" Perhaps because she could play old maid types so easily in later years, she was often thought to have never married. She actually did marry, quite late in life, to a whole-sale liquor dealer. They had no children. He died in 1965 and she eventually moved in with her ex-vaudeville partner, Marjorie Barnett-Klein, who was also widowed. In later years the two performed their old routines to the delight of other senior citizens. Mary was living in Balboa Beach, California when she died of cancer in 1989.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5ODcyOTQ0NV5BMl5BanBnXkFtZTgwMzIwNDEzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0871695","name":"Mary Treen","idIMDB":"nm0871695"},"actorId":"nm0871695","character":"Cousin Tilly","urlCharacter":"http://www.imdb.com/character/ch0004665","main":true},{"actorName":"Virginia Patton","urlProfile":"http://www.imdb.com/name/nm0666634","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmZlMjNmZWUtODJjMy00MzQzLWE4ZjMtMDkwZDI4OWY1Nzk3XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 June 1925","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Virginia Ann Patton","height":"5' 7\" (1.7 m)","bio":"Born in Cleveland, Ohio, Virginia Patton was raised in Portland, Oregon, where she graduated from Jefferson High School in 1942. Her high school goal was to \"make it in Hollywood\". She relocated to Los Angeles and attended the University of Southern California, where she starred in a play written by William C. de Mille. She appeared in several films throughout the early 1940s before landing a supporting part in It's a Wonderful Life (1946), which she considered a once in a lifetime movie role. She retired from acting in the late 1940s to concentrate on raising a family with her husband, Cruse W. Moss in Ann Arbor, Michigan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmZlMjNmZWUtODJjMy00MzQzLWE4ZjMtMDkwZDI4OWY1Nzk3XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0666634","name":"Virginia Patton","idIMDB":"nm0666634"},"actorId":"nm0666634","character":"Ruth Dakin","urlCharacter":"http://www.imdb.com/character/ch0556603","main":true}],"seasons":[],"idIMDB":"tt0038650","urlIMDB":"http://www.imdb.com/title/tt0038650","business":{"budget":{"money":"$3,180,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$7,270,000","country":"USA","day":"31","month":"12","year":"1947","remarks":""},{"money":"£682,222","country":"UK","day":"26","month":"12","year":"2010","remarks":""},{"money":"£569,890","country":"UK","day":"19","month":"12","year":"2010","remarks":""},{"money":"£248,018","country":"UK","day":"21","month":"12","year":"2008","remarks":""}],"weekendGross":[{"money":"£44,437","country":"UK","day":"26","month":"12","year":"2010","remarks":"52 Screens"},{"money":"£44,422","country":"UK","day":"19","month":"12","year":"2010","remarks":"28 Screens"},{"money":"£49,845","country":"UK","day":"21","month":"12","year":"2008","remarks":"32 Screens"}],"admissions":[{"money":"631,158","country":"France","day":"31","month":"12","year":"1948","remarks":""}],"productionDates":{"money":null,"country":null,"day":"27","month":"07","year":"1946","remarks":null},"filmingDates":null,"copyrightHolder":"Copyright MCMXLVII by Liberty Films, Inc. All Rights Reserved (on print)"},"technical":{"runtime":["2 hr 10 min (130 min)","1 hr 58 min (118 min) (25 fps) (DVD edition) (Spain)"],"soundMix":["Mono (RCA Sound System)"],"color":["Color (colorized)","Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["Digital (color stock)","35 mm"]},"rating":"8.6","filmingLocations":[{"location":"California, USA"}],"rated":"PG","awards":[{"award":"Academy Awards, USA 1947","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Picture","names":[]},{"category":"Best Actor in a Leading Role","names":[{"name":"James Stewart","id":"nm0000071","role":null}]},{"category":"Best Director","names":[{"name":"Frank Capra","id":"nm0001008","role":null}]},{"category":"Best Sound, Recording","names":[{"name":"John Aalberg","id":"nm0007356","role":"RKO Radio SSD"}]},{"category":"Best Film Editing","names":[{"name":"William Hornbeck","id":"nm0394962","role":null}]}]}]},{"award":"Golden Globes, USA 1947","titlesAwards":[{"titleAwardOutcome":"Won Golden Globe","categories":[{"category":"Best Director","names":[{"name":"Frank Capra","id":"nm0001008","role":null}]}]}]},{"award":"Cinema Writers Circle Awards, Spain 1949","titlesAwards":[{"titleAwardOutcome":"Won CEC Award","categories":[{"category":"Best Foreign Film (Mejor Película Extranjera)","names":[]}]}]},{"award":"National Board of Review, USA 1947","titlesAwards":[{"titleAwardOutcome":"Won NBR Award","categories":[{"category":"Top Ten Films","names":[]}]}]},{"award":"National Film Preservation Board, USA 1990","titlesAwards":[{"titleAwardOutcome":"Won National Film Registry","categories":[{"category":"","names":[]}]}]},{"award":"New York Film Critics Circle Awards 1946","titlesAwards":[{"titleAwardOutcome":"3rd place NYFCC Award","categories":[{"category":"Best Director","names":[{"name":"Frank Capra","id":"nm0001008","role":null}]}]}]},{"award":"Online Film & Television Association 2002","titlesAwards":[{"titleAwardOutcome":"Won OFTA Film Hall of Fame","categories":[{"category":"Motion Picture","names":[]}]}]},{"award":"Young Artist Awards 1994","titlesAwards":[{"titleAwardOutcome":"Won Former Child Star Lifetime Achievement Award","categories":[{"category":"","names":[{"name":"Jimmy Hawkins","id":"nm0370151","role":null}]}]}]}],"votes":"296,719","type":"Movie","companyCreditsSimple":[{"idCompany":"co0196361","name":"Liberty Films (II)"}],"keywords":{"keywords":["guardian angel","small town life","christmas","alternate history","second chance","angel","bank","building and loan","small town","throwing a stone at a window","run on bank","financial problem","deaf in one ear","angel on earth","war hero","drugstore","rescue from drowning","falling through ice","partial deafness","christmas eve","falling into swimming pool","job offer","declining a job offer","loan company","saved from drowning","contemplating suicide","needing money","flower petal","man in a wheelchair","do over","bell ringing","jumping off a bridge","telegram","ethnic slur","change history","belief in destiny","fund raising","brother brother relationship","husband wife relationship","family relationships","auld lang syne","jumping into a pool with clothes on","what if","concealed nudity","wish fulfillment","old dark house","christmas tree","loss of son","generosity","dance contest","lost money","reference to mark twain","audio flashback","1930s","1920s","friend","business","flashback","prayer","ambition","holiday film","apostrophe in title","dancing couple","two brothers","literally thrown out","four word title","family man","making a wish","depression","advice from bartender","happy ending","african american woman","african american","african american servant","christmas decorations","christmas carol","snowing","dancing","falling into water","sitting","alienation","manhood","lifting person in air","man on the verge of tears","lifting someone into the air","world war two","mislaid trust","bridge at remagen","greed","property seizure","property rights","property auction","property owner","remorse","dedication","revenge","sledding","father daughter relationship","mother daughter relationship","father son relationship","mother son relationship","absent mindedness","grabbed by the lapels","contraction in title","butterfly collection","framed butterfly","marriage proposal","punch into the camera","inexperienced praying","forcibly removed","suitor","weather","bartender","stroke","hark the herald angels sing","great depression","rescue","bridge","renovation","freeze frame","heaven","friendship","job interview","newlywed","marriage","police officer","graduation party","car accident","bell","librarian","jitterbug","maid","snow","taxi driver","ex convict","face slap","bathrobe","financier","common cold","rainstorm","developer","drunkenness","bar","rich snob","board meeting","sacrifice","swimming pool","railway station","cemetery","despair","boarding house","house warming","flower","taxi","river","loss of father","populism","poison","sick child","handshake","attempted suicide","pregnancy","suitcase","new york","wheelchair","prank","double take","financial panic","wipe","wedding night","frustration","window smashing","cash register","death of father","based on novel","film blanc","reference to tom sawyer","cult film","punctuation in title","claim in title","1910s"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 06:22:24"}}