{"data":{"movies":[{"title":"Front à la Scotland Yard","originalTitle":"Die Tür mit den 7 Schlössern","year":"1962","releaseDate":"19630206","directors":[{"name":"Alfred Vohrer","id":"nm0901138"}],"writers":[{"name":"Edgar Wallace","id":"nm0908624"},{"name":"Harald G. Petersson","id":"nm0677457"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGIxMDY3MGYtOGI1YS00NzQ4LWI1ODQtY2U5MmQ3Y2FlNTljXkEyXkFqcGdeQXVyMzU0NzkwMDg@._V1.jpg","countries":["West Germany","France"],"languages":["German"],"genres":["Crime","Horror","Mystery","Thriller"],"plot":"A woman arrives at a lonely mansion and finds herself mixed up with a lunatic who has built his own torture chamber, which is already crowded with victims - and he plans to make her his next one.","simplePlot":"A woman arrives at a lonely mansion and finds herself mixed up with a lunatic who has built his own torture chamber, which is already crowded with victims - and he plans to make her his next one.","actors":[{"actorName":"Heinz Drache","urlProfile":"http://www.imdb.com/name/nm0236621","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODdkMjAwNTctNTJiZi00Yzc3LWEyZDItMDE4YzllNzI2NDE1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1923","placeOfBirth":" Essen, Germany","bio":"This actor's chief claim to fame lies in being the most in-vogue screen cop of post-war German cinema. He first established his reputation in the role of the charismatic Inspector Yates in Francis Durbridge's miniseries Das Halstuch (1962), which hit an impressive eighty percent in TV ratings. He continued in the same vein (same part, same crew cut, different names) apprehending villains in a series of Edgar Wallace potboilers with lurid titles evocative of the genre: The Avenger (1960), The Indian Scarf (1963), Coffin from Hong Kong (1964), Again the Ringer (1965) and Le château des chiens hurlants (1968), among others. After his contract with Constantin Filmverleih expired, he took a sabbatical from the screen and returned to the stage. Drache was smitten by the performing arts from childhood (at the age of fourteen, he could recite Goethe's \"Faust\" by heart). He started acting on stage as an extra in his senior year at high school. Though intended for flight training in the Luftwaffe, he was excused from active military service and permitted to continue his theatrical training in Berlin. Whilst at the Deutsches Theater, he was spotted by Gustaf Gründgens and given a key part in the bizarre comic fantasy \"Der Schatten\" (\"The Shadow\", based on a Russian play). This turned out to be a substantial hit. While it did not make him a star, it led to further character roles under the direction of Gründgens in classics like \"Danton's Death\", \"Candida\" and \"Othello\". Following engagements at the Berliner Schillertheater and the Kleine Komödie in Munich, Drache made his first film appearance in 1954. For the next eight years, he alternated youthful romantic leads with more challenging assignments in serious drama (L'espion de la dernière chance (1956), The Rest Is Silence (1959)). His archetypal crime fighting image was inaugurated with \"\"Der Rächer\" and cemented with \"Das Halstuch\". Audiences took a shine to the easy-going approach and quick-witted, often cynical repartee of his screen detectives. Drache also made good use of his distinctively sonorous voice, frequently synchronising for English-speaking stars like Sean Connery, Christopher Lee, Kirk Douglas and Richard Widmark. On the stage, Drache was able to escape typecasting and occasionally portrayed rather less wholesome characters. The screen, however, rarely permitted him to show his acting range. After a period of relative absence (just five appearances between 1969 and 1985), he returned somewhat reluctantly in familiar guise as the elegant, pin-stripe suited Kriminalhauptkommissar Hans Georg Bülow in TV's top crime-time series Tatort (1970). However, the era for anachronistic gentlemen sleuths had passed and a mixed critical reception prompted Drache to quit the show after just six episodes. After that, he quietly faded from the spotlight and died in Berlin in April 2002 at the age of 79.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODdkMjAwNTctNTJiZi00Yzc3LWEyZDItMDE4YzllNzI2NDE1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0236621","name":"Heinz Drache","idIMDB":"nm0236621"},"actorId":"nm0236621","character":"Inspektor Richard \"Dick\" Martin","urlCharacter":"http://www.imdb.com/character/ch0109227","main":true},{"actorName":"Sabine Sesselmann","urlProfile":"http://www.imdb.com/name/nm0785923","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2NhMjZiNTAtNDY5OC00NWQyLWEyMGQtYTA4NThjMjZiM2Y5XkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 August 1936","placeOfBirth":" Munich, Bavaria, Germany","bio":"Sabine Sesselmann was born on August 13, 1936 in Munich, Bavaria, Germany. She was an actress, known for Le Bossu (1959), Front à la Scotland Yard (1962) and Impudeur (1958). She was married to Ernst Henne jr. She died on March 1, 1998 in Tutzing, Bavaria.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2NhMjZiNTAtNDY5OC00NWQyLWEyMGQtYTA4NThjMjZiM2Y5XkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0785923","name":"Sabine Sesselmann","idIMDB":"nm0785923"},"actorId":"nm0785923","character":"Sybil Lansdown","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eddi Arent","urlProfile":"http://www.imdb.com/name/nm0034357","urlPhoto":"","biography":{"dateOfBirth":"5 May 1925","placeOfBirth":" Free City of Danzig [now Gdansk, Pomorskie, Poland]","birthName":"Gebhardt Georg Arendt","bio":"Eccentric, self-deprecating comedian Eddi Arent first attracted attention in a series of quirky Edgar Wallace adaptations in the 1960's. For several years, he was Germany's idea of stereotypically blithering English lords (Die seltsame Gräfin (1961), as the aptly named Lord Selwyn Moron), laconic butlers (Secret of the Red Orchid (1962)) or obtuse, clumsy second-string Scotland Yard photographers (Dead Eyes of London (1961), Front à la Scotland Yard (1962). Otherwise, Arent was patently reliable as droll, vaguely effete sidekicks and comic relief in westerns and adventure films based on the ever-popular writings of Karl May. He is fondly remembered as the mild-mannered, bumbling butterfly collector Castlepool in the 'Winnetou' trilogy, beginning with The Treasure of the Silver Lake (1962). To confound those who had him perpetually typecast, Arent also donned the black garb of villainy as a murderous monk for one of his last Edgar Wallace potboilers, The Sinister Monk (1965). He must have enjoyed this change of character, since he repeated the exercise: first (not too convincingly), playing a human trafficker masquerading as a priest in Le bossu de Londres (1966); then, as a knife-throwing killer in the English-German co-production Psycho-Circus (1966), which had the great Christopher Lee (for once) relegated to the role of the 'red herring'. Unlike most of his peers, Arent had little formal theatrical training. Instead, he began in cabaret, where he developed the character sketches and personae which would later make his name. Nor did he have any interest in forging a career on the legitimate stage. Films first saw him as a dramatic actor in minor supporting roles, his natural talent as a comedian not recognised until the end of the 1950's. After his hey-day in the 60's, his subsequent output was fairly unremarkable. For the most part, he fluttered around on the margins of youth-oriented low-brow pop-films. Some of his other pictures may have appealed to devotees of 'Heimatfilm' schmaltz. However, in the 80's, Arent acquired a new following with the television sketch show Harald und Eddi (1987). In conjunction with perennial audience favorite Harald Juhnke, he delighted audiences with his comedic versatility. Leaving the limelight in the 1990's, Arent then endured a series of financial and personal setbacks. Suffering from depression and increasingly afflicted by dementia, he died in May 2013 at the age of 88.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0034357","name":"Eddi Arent","idIMDB":"nm0034357"},"actorId":"nm0034357","character":"Kriminalassistent Holms","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pinkas Braun","urlProfile":"http://www.imdb.com/name/nm0105835","urlPhoto":"","biography":{"dateOfBirth":"7 January 1923","placeOfBirth":" Zürich, Switzerland","height":"5' 9¾\" (1.77 m)","bio":"This lean, incisive, basso-voiced Swiss actor with the unsettling mephistophelean countenance was the son of a Galician-Jewish merchant. Pinkas Braun began his chosen vocation at the age of eighteen as an extra with the Zürcher Schauspielhaus (embracing what he considered the 'order and discipline' inherent in a theatrical career). A member of the company's ensemble from 1945 to 1956, Braun featured in numerous premieres of plays by Brecht (who played a pivotal role in his training as an actor), Camus, Dürrenmatt and Frisch. Braun's personal favorite and his critically most acclaimed performance was as Shylock in Shakespeare's \"The Merchant of Venice\". On the screen, his looks and voice naturally predetermined him for arch villainy. At the very least, he would be cast as sinister schemers, occasionally mitigated by a charming blend of rascality. Braun found his widest audience during the 1960's in several lurid adaptations of crime thrillers by Edgar Wallace which have since acquired a substantial cult following: Secret of the Red Orchid (1962) (as a wealthy orchid collector and blackmail victim); Front à la Scotland Yard (1962) (as the criminally insane Dr. Staletti); Der Fluch der gelben Schlange (1963) (Fing-Su, demonic leader of a murderous sect of Chinese snake-worshippers). At his scene-stealing best, Braun took full acting honours as the ruthless Percyval Glyde in a superbly-mounted TV mini-series, Die Frau in Weiß (1971), based on the classic novel by Wilkie Collins. As the owner of a distinctively sonorous voice he was guaranteed regular employment in radio drama or for synchronisation (notably, as William of Baskerville, chief protagonist of Umberto Eco's \"The Name of the Rose\"). Braun also established a reputation as a theatrical director of note and as the leading translator into German of the complete works of Edward Albee.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0105835","name":"Pinkas Braun","idIMDB":"nm0105835"},"actorId":"nm0105835","character":"Dr. Antonio Staletti","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hans Nielsen","urlProfile":"http://www.imdb.com/name/nm0630821","urlPhoto":"","biography":{"dateOfBirth":"30 November 1911","placeOfBirth":" Hamburg, Germany","birthName":"Hans Albert Nielsen","bio":"Hans Nielsen was born on November 30, 1911 in Hamburg, Germany as Hans Albert Nielsen. He was an actor and assistant director, known for Titanic (1943), Town Without Pity (1961) and Destination Death (1964). He was married to Anna Katharina Elisabeth Novian and Annemarie Giersch. He died on October 11, 1965 in West Berlin, West Germany.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0630821","name":"Hans Nielsen","idIMDB":"nm0630821"},"actorId":"nm0630821","character":"Mr. Haveloc","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gisela Uhlen","urlProfile":"http://www.imdb.com/name/nm0880187","urlPhoto":"","biography":{"dateOfBirth":"16 May 1919","placeOfBirth":" Leipzig, Germany","birthName":"Gisela Friedhilde Schreck","height":"5' 4¼\" (1.63 m)","bio":"Gisela Uhlen was born on May 16, 1919 in Leipzig, Germany as Gisela Friedhilde Schreck. She was an actress and writer, known for The Marriage of Maria Braun (1979), Une famille en Bavière (1989) and Toto le héros (1991). She was married to Beat Hodel, Herbert Ballmann, Kurt Wessels, Hans Bertram and Wolfgang Kieling. She died on January 16, 2007 in Cologne, North Rhine-Westphalia, Germany.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0880187","name":"Gisela Uhlen","idIMDB":"nm0880187"},"actorId":"nm0880187","character":"Emely Cody, geb. Cawler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Werner Peters","urlProfile":"http://www.imdb.com/name/nm0676729","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzFjZDMwY2YtZTRiZS00Mjg2LTgyNDEtZDJhMWQ1OWViYmYwL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 July 1918","placeOfBirth":" Werlitzsch, Saxony, Germany","bio":"Corpulent German character actor, often seen in menacing or unpleasant roles. Trained under Lina Carstens (1935-1937), Peters initially started out as a comedian. After military service in World War II, he reinvented himself as a serious dramatic actor, resident for some time at the Munich Kammerspiele and at the Deutsches Theater. From 1948 onwards, he was signed as a character player by the East German film company DEFA, where he became noted for several exceptional performances in films like The Affair Blum (1948) and, as the obsequious, power-hungry Dietrich Hessling, in the controversial Pour le roi de Prusse (1951) (a starring role which won him an East German National Prize). Peters moved to the West in 1955 to portray Nazis, corrupt establishment figures, sinister spies and reprehensible philistines (as well as the odd police inspector or victim) in local and international films. He hit the apex of his career with Robert Siodmak's The Devil Strikes at Night (1957), as a uniformed minor Nazi functionary. His dark screen image also made Peters a perennial favorite as protagonist for the ever-popular \"Dr. Mabuse\" films and the Edgar Wallace series of potboilers. In addition to his work in front of the camera, Peters set up a dubbing studio in 1958 (Rondo Films) for which he himself supplied German voice-overs for international stars like Donald Pleasence and Rod Steiger.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzFjZDMwY2YtZTRiZS00Mjg2LTgyNDEtZDJhMWQ1OWViYmYwL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0676729","name":"Werner Peters","idIMDB":"nm0676729"},"actorId":"nm0676729","character":"Bertram Cody","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jan Hendriks","urlProfile":"http://www.imdb.com/name/nm0376842","urlPhoto":"","biography":{"dateOfBirth":"6 December 1928","placeOfBirth":" Berlin, Germany","birthName":"Heinz Joachim Hinz","bio":"Jan Hendriks was trained in Berlin in the late 40s. The dark haired young man won for his film debut in Aux frontières du péché (1951) opposite Dieter Borsche the German Film Award as best newcomer. He co-starred opposite Johanna Matz in Der große Zapfenstreich (1952) and started a busy filmwork. A first break was in 1953, when he was prisoned a half year after an accident by alcohol consum. Back he played often supporting parts in german movies. Best remembered as foolish officer in Les Soldats ne sont pas de bois (1958) opposite O.W. Fischer and Liselotte Pulver. Since the mid 50s he also starred on TV. A second break was in 1963, when he had lost his mind for some months after a guiltless motor bicycle accident. In the 60s and 70s he played on screen, stage and TV leading and supporting roles. Between 1977-86 he co-starred in the crime series The Old Fox (1977) opposite Siegfried Lowitz.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0376842","name":"Jan Hendriks","idIMDB":"nm0376842"},"actorId":"nm0376842","character":"Tom Cawler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ady Berber","urlProfile":"http://www.imdb.com/name/nm0073317","urlPhoto":"","biography":{"dateOfBirth":"4 February 1913","placeOfBirth":" Vienna, Austria-Hungary [now Austria]","birthName":"Adolf Berber","height":"6' 6¾\" (2 m)","bio":"Ady Berber was born on February 4, 1913 in Vienna, Austria-Hungary as Adolf Berber. He was an actor, known for Ceux du voyage (1954), Dead Eyes of London (1961) and The Return of Dr. Mabuse (1961). He was married to Anna. He died on January 3, 1966 in Vienna, Austria.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0073317","name":"Ady Berber","idIMDB":"nm0073317"},"actorId":"nm0073317","character":"Peter Cawler / Giacco","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Siegfried Schürenberg","urlProfile":"http://www.imdb.com/name/nm0778310","urlPhoto":"","biography":{"dateOfBirth":"12 January 1900","placeOfBirth":" Detmold, Germany","birthName":"Siegfried Hermann Andreas Wittig","bio":"Siegfried Schürenberg was born on January 12, 1900 in Detmold, Germany as Siegfried Hermann Andreas Wittig. He was an actor, known for The Bridge (1959), Le château des chiens hurlants (1968) and The Devil Came from Akasava (1971). He was married to Charlotte and Margareta Christina. He died on August 31, 1993 in Berlin, Germany.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0778310","name":"Siegfried Schürenberg","idIMDB":"nm0778310"},"actorId":"nm0778310","character":"Sir John","urlCharacter":"http://www.imdb.com/character/ch0040367","main":true},{"actorName":"Friedrich Joloff","urlProfile":"http://www.imdb.com/name/nm0427230","urlPhoto":"","biography":{"dateOfBirth":"14 December 1908","placeOfBirth":" Berlin, Germany","birthName":"Friedrich Jolowicz","bio":"Friedrich Joloff was born on December 14, 1908 in Berlin, Germany as Friedrich Jolowicz. He was an actor and composer, known for Brückenallee Nr. 3 (1967), Die Laokoon-Gruppe (1963) and Kannibalen (1970). He died on January 4, 1988 in Verden an der Aller, Germany.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0427230","name":"Friedrich Joloff","idIMDB":"nm0427230"},"actorId":"nm0427230","character":"Hausmeister Burt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Klaus Kinski","urlProfile":"http://www.imdb.com/name/nm0001428","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyOTgwMDE1MV5BMl5BanBnXkFtZTcwNzAxNTIzNA@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 October 1926","placeOfBirth":" Zoppot, Free City of Danzig [now Sopot, Pomorskie, Poland]","birthName":"Nikolaus Günther Nakszynski","height":"5' 8\" (1.73 m)","bio":"Klaus Kinski was born Nikolaus Günther Nakszynski in Zoppot, Free City of Danzig (now Sopot, Poland), to Susanne (Lutze), a nurse, and Bruno Nakszynski, a pharmacist. He grew up in Berlin, was drafted into the German army in 1944 and captured by British forces in Holland. After the war he began acting on the stage, quickly gaining a reputation for his ferocious talent and equally ferocious temper. He started acting in films shortly afterwards, showing an utter disregard for the quality of the productions he appeared in and churning out so many that a complete filmography is almost impossible to assemble. However, he did turn out memorable work for director Werner Herzog, a similarly driven and obsessive character. Herzog and Kinski pushed each other to extremes over a 15-year working relationship, which finally ended after filming Cobra Verde (1987), a production plagued by volcanic clashes between the star and director, involving--among other things--violent physical altercations and mutual death threats. Kinski subsequently directed and starred in the notorious Paganini (1989), his only film as director and which was marked by (again) clashes between Kinski and his producers, who accused him of turning their movie into a pornographic film and sued him in court. His autobiography \"All I Need is Love\", one of the most vicious attacks on the film business ever written, was withdrawn for legal reasons and subsequently re-released as \"Kinski Uncut\" in the US & UK, \"Ich brauche Liebe\" in Germany, and in various other languages.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyOTgwMDE1MV5BMl5BanBnXkFtZTcwNzAxNTIzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001428","name":"Klaus Kinski","idIMDB":"nm0001428"},"actorId":"nm0001428","character":"Pheeny","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0056630","urlIMDB":"http://www.imdb.com/title/tt0056630","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"26","month":"02","year":"1962","remarks":null},{"money":null,"country":null,"day":"30","month":"03","year":"1962","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 35 min (95 min) (Germany)","1 hr 36 min (96 min) (USA)"],"soundMix":["Mono (Klangfilm Eurocord)"],"color":["Black and White"],"aspectRatio":["1.37 : 1 (negative ratio)","1.66 : 1 (theatrical ratio)"],"camera":null,"laboratory":["Mosaik-Film GmbH, Berlin, Germany"],"filmLength":["2,586 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.0","filmingLocations":[{"location":"Berlin, Germany"}],"awards":[],"votes":"386","type":"Movie","companyCreditsSimple":[{"idCompany":"co0060939","name":"Les Films Jacques Leitienne"},{"idCompany":"co0102259","name":"Rialto Film Preben-Philipsen"},{"idCompany":"co0043072","name":"Rialto Film"}],"keywords":{"keywords":["krimi","snake","secret passage","scotland yard","multiple murder","mad doctor","locked door","lobotomy","kidnapping","key","castle","remake","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:47:59"}}