{"data":{"movies":[{"title":"The Greatest Show on Earth","originalTitle":"","year":"1952","releaseDate":"195205","directors":[{"name":"Cecil B. DeMille","id":"nm0001124"}],"writers":[{"name":"Fredric M. Frank","id":"nm0290931"},{"name":"Barré Lyndon","id":"nm0528530"}],"runtime":"152 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNjk5NTQ1M15BMl5BanBnXkFtZTgwNTg5NDc2MjE@._V1.jpg","countries":["USA"],"languages":["English","Russian"],"genres":["Drama","Family","Romance"],"plot":"To ensure a full profitable season, circus manager Brad Braden engages The Great Sebastian, though this moves his girlfriend Holly from her hard-won center trapeze spot. Holly and Sebastian begin a dangerous one-upmanship duel in the ring, while he pursues her on the ground. Subplots involve the secret past of Buttons the Clown and the efforts of racketeers to move in on the game concessions. Let the show begin!","simplePlot":"The dramatic lives of trapeze artists, a clown, and an elephant trainer are told against a background of circus spectacle.","actors":[{"actorName":"Betty Hutton","urlProfile":"http://www.imdb.com/name/nm0002149","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NTcyOTkxNV5BMl5BanBnXkFtZTYwNTYwMTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 February 1921","placeOfBirth":" Battle Creek, Michigan, USA","birthName":"Elizabeth June Thornburg","height":"5' 4\" (1.63 m)","bio":"Betty Hutton was born Elizabeth June Thornburg on February 26, 1921, in Battle Creek, Michigan. Two years later Betty's father decided that the family way of life wasn't for him, so he left (he committed suicide 16 years later). Having to fend for themselves, Mrs. Thornburg moved the family to Detroit to find work in the numerous auto factories there, but times were hard and she decided to take advantage of Prohibition and opened a small tavern, at the time called a speakeasy. The police were always looking for those types of operation, both big and small, and when they detected one, they swooped in and closed it down. Mrs. Thornburg was no different from the other owners, they simply moved elsewhere. Poverty was a constant companion. In addition to that, Mrs. Thornburg was an alcoholic. At nine years old Betty began singing publicly for the first time in a school production. Realizing the voice Betty had, her mother took her around Detroit to have her sing to any group that would listen. This was a small way of getting some money for the poor family. When she was 13 Betty got a few singing jobs with local bands in the area. Thinking she was good enough to make the big time, she left for New York two years later to try a professional career. Unfortunately, it didn't work out and Betty headed back to Detroit. In 1937, Betty was hired by Vincent Lopez who had a popular band that appeared on the local radio. Later, she would return to New York and it was here that her career took off. Betty found herself on Broadway in 1940, and it was only a matter of time before her career took off to bigger heights. The following year she left New York for Hollywood, where she was to find new life in films. She was signed by Paramount Pictures and made her debut, at 21, in The Fleet's In (1942), along with Eddie Bracken, William Holden and Dorothy Lamour. Reviews were better than expected, with critics looking favorably upon her work. She had previously appeared in a few musical shorts, which no doubt helped her in her first feature film. She made one more musical in 1942 and two more in 1943. In 1944 she tried to break away from musicals and try her hand in a screwball comedy, The Miracle of Morgan's Creek (1944). She proved - to herself, the public and the critics - that she was marketable outside musicals. In subsequent films Betty was able to show her comedic side as well as her singing. In 1948 she appeared in her first big box-office bomb, Dream Girl (1948), which was ripped to shreds by critics, as was Betty's acting, and the movie flopped at the box office. It wasn't long before Betty became unhappy with her career. In truth she had the acting talent, but the parts she got weren't the types to showcase that. Though she did appear in three well received films later, Red, Hot and Blue (1949), Annie Get Your Gun (1950) and The Greatest Show on Earth (1952), her career was winding down. Later, after filming Somebody Loves Me (1952), Betty was all but finished. She had married 'Charles O'Curran' that year and he wanted to direct her in an upcoming film. Paramount didn't like the idea and the temper tantrum-prone Betty walked out of her contract and movies. She did concentrate on the relatively new medium of television and the stage, but she never recovered her previous form. Her final film was a minor one, Spring Reunion (1957). Her TV series, The Betty Hutton Show (1959), didn't fare too well at all. Betty lived in quiet retirement in Palm Springs, California until her death on March 11, 2007. She was 86 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NTcyOTkxNV5BMl5BanBnXkFtZTYwNTYwMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002149","name":"Betty Hutton","idIMDB":"nm0002149"},"actorId":"nm0002149","character":"Holly","urlCharacter":"http://www.imdb.com/character/ch0155467","main":true},{"actorName":"Cornel Wilde","urlProfile":"http://www.imdb.com/name/nm0664273","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NDQ0OTQ4MF5BMl5BanBnXkFtZTcwODUyNjgyMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1912","placeOfBirth":" Prievidza, Hungary [now Slovakia]","birthName":"Kornel Lajos Weisz","height":"6' 1\" (1.85 m)","bio":"Dashing actor Cornel Wilde was born Kornel Lajos Weisz on October 13, 1912, in Prievidza, Hungary (now part of Slovakia), to a Jewish family. In 1920, he immigrated to New York City with his parents, Rayna (Vid) and Vojtech Béla Weisz, and elder sister, Edith. His family Americanized their names and Kornel took the name Cornelius Louis Wilde. He spent much of his youth traveling in Europe, developing a continental flair as well as an affinity for languages. He received a scholarship for medical school, but turned it down in favor of his new love, the theatre. A natural athlete and a champion fencer with the U.S. Olympic fencing team, he quit the team just prior to the 1936 Berlin Olympics in order to take a role in a play. In 1937, he married Marjory Heinzen (later known as Patricia Knight), and they both shaved a few years off their ages in order to get work, Wilde thereafter claiming publicly that he was born in New York in 1915, though he continued to list his correct Hungarian birth in 1912 on government documents. Shortening his name to Cornel Wilde for the stage, he appeared in the Broadway hit \"Having a Wonderful Time\", but it was not until he was hired in the dual capacities of fencing choreographer and actor (Tybalt) in Laurence Olivier's 1940 Broadway production of \"Romeo and Juliet\" that Hollywood spotted him. He played a few minor roles before leaping to fame and an Oscar nomination as Frederic Chopin in A Song to Remember (1945). He spent the balance of the 1940s in romantic, and often swashbuckling, leading roles. In the 1950s his star dimmed a little, and aside from an occasional blockbuster like The Greatest Show on Earth (1952), he settled mainly into adventure films. A growing interest in directing led him to form his own production company with the goal of directing his own films. Several of his ventures into film noir in this period, both his own and other directors', are quite interesting (The Big Combo (1955) and Storm Fear (1955), for example). He produced, directed and starred in La proie nue (1965), a tour-de-force adventure drama that brought him real acclaim as a director. His later films were of varying quality, and he ended his career in near-cameos in minor adventure films. He died of leukemia in 1989, three days after his 77th birthday, leaving behind an unpublished autobiography, \"The Wilde Life.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NDQ0OTQ4MF5BMl5BanBnXkFtZTcwODUyNjgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0664273","name":"Cornel Wilde","idIMDB":"nm0664273"},"actorId":"nm0664273","character":"The Great Sebastian","urlCharacter":"http://www.imdb.com/character/ch0155468","main":true},{"actorName":"Charlton Heston","urlProfile":"http://www.imdb.com/name/nm0000032","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMDg1MjYzMV5BMl5BanBnXkFtZTYwMDMxOTE2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1923","placeOfBirth":" Wilmette, Illinois, USA","birthName":"John Charles Carter","height":"6' 2½\" (1.89 m)","bio":"With features chiseled in stone, and renowned for playing a long list of historical figures, particularly in Biblical epics, the tall, well built and ruggedly handsome Charlton Heston was one of Hollywood's greatest leading men and remained active in front of movie cameras for over sixty years. As a Hollywood star, he appeared in 100 films over the course of 60 years. He played Moses in the epic film, The Ten Commandments (1956), for which he received his first Golden Globe Award nomination. He also starred in Touch of Evil (1958) with Orson Welles; Ben-Hur, for which he won the Academy Award for Best Actor (1959); El Cid (1961); and Planet of the Apes (1968). He also starred in the films The Greatest Show on Earth (1952); Secret of the Incas (1954); The Big Country (1958); and The Agony and the Ecstasy (1965). A supporter of Democratic politicians and civil rights in the 1960s, Heston later became a Republican, founding a conservative political action committee and supporting Ronald Reagan. Heston's most famous role in politics came as the five-term president of the National Rifle Association, from 1998 to 2003. Heston was born John Charles Carter on October 4, 1924, in No Man's Land, Illinois, to Lila (Charlton) and Russell Whitford Carter, who operated a sawmill. He had English and Scottish ancestry, with recent Canadian forebears. Heston made his feature film debut as the lead character in a 16mm production of Peer Gynt (1941), based on the Henrik Ibsen play. In 1944, Heston enlisted in the United States Army Air Forces. He served for two years as a radio operator and aerial gunner aboard a B-25 Mitchell stationed in the Alaskan Aleutian Islands with the 77th Bombardment Squadron of the Eleventh Air Force. He reached the rank of Staff Sergeant. Heston married Northwestern University student Lydia Marie Clarke, who was six months his senior. That same year he joined the military. Heston played 'Marc Antony' in Julius Caesar (1950), and firmly stamped himself as genuine leading man material with his performance as circus manager 'Brad Braden' in the Cecil B. DeMille spectacular The Greatest Show on Earth (1952), also starring James Stewart and Cornel Wilde. The now very popular actor remained perpetually busy during the 1950s, both on TV and on the silver screen with audience pleasing performances in the steamy thriller The Naked Jungle (1954), as a treasure hunter in Secret of the Incas (1954) and another barn storming performance for Cecil B. DeMille as \"Moses\" in the blockbuster The Ten Commandments (1956). Heston delivered further dynamic performances in the oily film noir thriller Touch of Evil (1958), and then alongside Gregory Peck in the western The Big Country (1958) before scoring the role for which he is arguably best known, that of the wronged Jewish prince who seeks his freedom and revenge in the William Wyler directed Ben-Hur (1959). This mammoth Biblical epic running in excess of three and a half hours became the standard by which other large scale productions would be judged, and it's superb cast also including Stephen Boyd as the villainous \"Massala\", English actor Jack Hawkins as the Roman officer \"Quintus Arrius\", and Australian actor Frank Thring as \"Pontius Pilate\", all contributed wonderful performances. Never one to rest on his laurels, steely Heston remained the preferred choice of directors to lead the cast in major historical productions and during the 1960s he starred as Spanish legend \"Rodrigo Diaz de Vivar\" in Le Cid (1961), as a US soldier battling hostile Chinese boxers during 55 Days at Peking (1963), played the ill-fated \"John the Baptist\" in The Greatest Story Ever Told (1965), the masterful painter \"Michelangelo\" battling Pope Julius II in The Agony and the Ecstasy (1965), and an English general in Khartoum (1966). In 1968, Heston filmed the unusual western Will Penny (1967) about an aging and lonely cowboy befriending a lost woman and her son, which Heston has often referred to as his favorite piece of work on screen. Interestingly, Heston was on the verge of acquiring an entirely new league of fans due to his appearance in four very topical science fiction films (all based on popular novels) painting bleak future's for mankind. In 1968, Heston starred as time traveling astronaut \"George Taylor\", in the terrific Planet of the Apes (1968) with it's now legendary conclusion as Heston realizes the true horror of his destination. He returned to reprise the role, albeit primarily as a cameo, alongside fellow astronaut James Franciscus in the slightly inferior sequel Beneath the Planet of the Apes (1970). Next up, Heston again found himself facing the apocalypse in The Omega Man (1971) as the survivor of a germ plague that has wiped out humanity leaving only bands of psychotic lunatics roaming the cities who seek to kill the uninfected Heston. And fourthly, taking its inspiration from the Harry Harrison novel \"Make Room!, Make Room!\", Heston starred alongside screen legend Edward G. Robinson and Chuck Connors in Soylent Green (1973). During the remainder of the 1970s, Heston appeared in two very popular \"disaster movies\" contributing lead roles in the far fetched Airport 1975 (1974), plus in the star laden Earthquake (1974), filmed in \"Sensoround\" (low bass speakers were installed in selected theaters to simulate the earthquake rumblings on screen to movie audiences). He played an evil Cardinal in the lively The Four Musketeers: Milady's Revenge (1974), a mythical US naval officer in the recreation of Midway (1976), also filmed in \"Sensoround\", an LA cop trying to stop a sniper in Two-Minute Warning (1976) and another US naval officer in the submarine thriller Gray Lady Down (1978). Heston appeared in numerous episodes of the high rating TV series Dynasty (1981) and The Colbys (1985), before moving onto a mixed bag of projects including TV adaptations of Treasure Island (1990) and A Man for All Seasons (1988), hosting two episodes of the comedy show, Saturday Night Live (1975), starring as the \"Good Actor\" bringing love struck Mike Myers to tears in Wayne's World 2 (1993), and as the eye patch wearing boss of intelligence agent Arnold Schwarzenegger in True Lies (1994). He also narrated numerous TV specials and lent his vocal talents to the animated movie Hercules (1997), the family comedy Cats & Dogs (2001) and an animated version of Ben Hur (2003). Heston made an uncredited appearance in the inferior remake of Planet of the Apes (2001), and his last film appearance to date was in the Holocaust themed drama of Rua Alguem 5555: My Father (2003). Heston narrated for highly classified military and Department of Energy instructional films, particularly relating to nuclear weapons, and \"for six years Heston [held] the nation's highest security clearance\" or Q clearance.\" The Q clearance is similar to a DoD or Defense Intelligence Agency (DIA) clearance of Top Secret. Heston was married to Lydia Marie Clark Heston since March 1944, and they have two children. His highly entertaining autobiography was released in 1995, titled appropriately enough \"Into The Arena\". Although often criticized for his strong conservative beliefs and involvement with the NRA, Heston was a strong advocate for civil right many years before it became fashionable, and was a recipient of the Jean Hersholt Humanitarian Award, plus the Kennedy Center Lifetime Achievement Award. In 2002, he was diagnosed with Alzheimer's disease, and did appear in a film or TV production after 2003. He died in April 2008. Truly, Charlton Heston is one of the legendary figures of US cinema.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMDg1MjYzMV5BMl5BanBnXkFtZTYwMDMxOTE2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000032","name":"Charlton Heston","nicknames":["Chuck"],"idIMDB":"nm0000032"},"actorId":"nm0000032","character":"Brad Braden","urlCharacter":"http://www.imdb.com/character/ch0034875","main":true},{"actorName":"Dorothy Lamour","urlProfile":"http://www.imdb.com/name/nm0483787","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1OTE5ODEwNF5BMl5BanBnXkFtZTYwMzkyNjI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1914","placeOfBirth":" New Orleans, Louisiana, USA","birthName":"Mary Leta Dorothy Slaton","height":"5' 5\" (1.65 m)","bio":"In addition to being Miss New Orleans in 1931, Dorothy Lamour worked as a Chicago elevator operator; band vocalist for her first husband, band leader Herbie Kaye; and radio performer. In 1936 she donned her soon-to-be-famous sarong for her debut at Paramount, The Jungle Princess (1936), and continued to play female Tarzan-Crusoe-Gauguin-girl-with make-up parts through the war years and beyond. The most famous of these was in the popular Bob Hope/Bing Crosby \"Road\" pictures - a strange combination of adventure, slapstick, ad-libs and Hollywood inside jokes. Of these she said, \"I was the happiest and highest-paid straight woman in the business.\" As she aged, however, the quality of her films dropped. Among her serious films were Johnny Apollo (1940) and A Medal for Benny (1945).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1OTE5ODEwNF5BMl5BanBnXkFtZTYwMzkyNjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0483787","name":"Dorothy Lamour","nicknames":["The Beautiful One","The Sarong Girl","Dottie"],"idIMDB":"nm0483787"},"actorId":"nm0483787","character":"Phyllis","urlCharacter":"http://www.imdb.com/character/ch0457348","main":true},{"actorName":"Gloria Grahame","urlProfile":"http://www.imdb.com/name/nm0002108","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNTgyNjMxOF5BMl5BanBnXkFtZTYwNTgwMTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 November 1923","placeOfBirth":" Los Angeles, California, USA","birthName":"Gloria Hallward","height":"5' 6\" (1.68 m)","bio":"Gloria Hallward, an acting pupil of her mother (stage actress and teacher Jean Grahame), acted professionally while still in high school. In 1944 Louis B. Mayer saw her on Broadway and gave her an MGM contract under the name Gloria Grahame. Her debut in the title role of Blonde Fever (1944) was auspicious, but her first public recognition came on loan-out in It's a Wonderful Life (1946). Though her talent and sex appeal were of star quality, she did not fit the star pattern at MGM, who sold her contract to RKO in 1947. Here the same problem resurfaced; her best film in these years was made on loan-out, In a Lonely Place (1950). Soon after, she left RKO. The 1950s, her best period, brought Gloria a supporting actress Oscar and typecast her as shady, inimitably sultry ladies in seven well-known film-noir classics. Rumors of being difficult to work with on the set of Oklahoma! (1955) sidelined her film career from 1956 onward. She also suffered from marital and child-custody troubles. Eight years after divorce from Nicholas Ray, who was 12 years her senior (and reportedly had discovered her in bed with his 13 year old son), and after a subsequent marriage to Cy Howard ended in divorce, in 1960 she married her former stepson Anthony Ray who was almost 14 years younger than her. This led Nicholas Ray and Cy Howard to each sue for custody of each's child by Grahame, putting gossip columnists and scandal sheets into overdrive. In 1960 she resumed stage acting, combined with TV work and, from 1970, some mostly inferior films. Gloria was described as a serious, skillful actress; spontaneous, honest, and strong-willed; imaginative and curious; incredibly sexy but insecure about her looks (prompting plastic surgery on her famous lips); loving appreciative male company; \"a bit loony.\" Her busiest period of British and American stage work ended abruptly in 1981 when she collapsed from cancer symptoms during a rehearsal. She returned to New York a few hours before she succumbed on October 5, 1981 at age 57.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNTgyNjMxOF5BMl5BanBnXkFtZTYwNTgwMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002108","name":"Gloria Grahame","idIMDB":"nm0002108"},"actorId":"nm0002108","character":"Angel","urlCharacter":"http://www.imdb.com/character/ch0155469","main":true},{"actorName":"Henry Wilcoxon","urlProfile":"http://www.imdb.com/name/nm0928295","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0ODUwMDYxOV5BMl5BanBnXkFtZTYwMDkwMTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 September 1905","placeOfBirth":" Dominica, British West Indies","birthName":"Harry Frederick Wilcoxon","height":"6' 3\" (1.91 m)","bio":"Henry Wilcoxon was given the lead role of Marc Antony in Cecil B. DeMille's Cleopatra (1934). It would prove to be the beginning of a long relationship with DeMille he would become a familiar DeMille character actor and DeMille's associate producer in the later years of DeMille's career. However, after DeMille died, he worked sporadically and accepted minor acting roles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0ODUwMDYxOV5BMl5BanBnXkFtZTYwMDkwMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0928295","name":"Henry Wilcoxon","nicknames":["Biff"],"idIMDB":"nm0928295"},"actorId":"nm0928295","character":"FBI Agent Gregory","urlCharacter":"http://www.imdb.com/character/ch0460030","main":true},{"actorName":"Lyle Bettger","urlProfile":"http://www.imdb.com/name/nm0079328","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjA2Mjc3OV5BMl5BanBnXkFtZTcwNzk5MjYwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1915","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Lyle Stathem Bettger","height":"6' (1.83 m)","bio":"Handsome, blond-haired, steely-eyed villain in many film Westerns. He was never the grizzled outlaw, covered in trail dust. No, he was the immaculate-looking, \"respectable\" (but two-faced) dandy in silk damask vest, often puffing suavely on a cheroot, whose ashes he then might contemptuously flick in the hero's face. He could confront an antagonist wearing a wry smile, even while neatly inserting his dirk between the latter's ribs. One wonders why Bettger, with his Aryan looks and menacing sneer, never became typecast as the stereotypical Nazi SS officer or Gestapo interrogator. (Perhaps the man was just fortunate in that regard.)","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjA2Mjc3OV5BMl5BanBnXkFtZTcwNzk5MjYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0079328","name":"Lyle Bettger","idIMDB":"nm0079328"},"actorId":"nm0079328","character":"Klaus","urlCharacter":"http://www.imdb.com/character/ch0460031","main":true},{"actorName":"Lawrence Tierney","urlProfile":"http://www.imdb.com/name/nm0862937","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNDI2MDY3NF5BMl5BanBnXkFtZTcwOTM1NzQyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 March 1919","placeOfBirth":" Brooklyn, New York, USA","birthName":"Lawrence James Tierney","height":"6' 1\" (1.85 m)","bio":"Legendary Hollywood \"tough guy\", on screen and off. Remembered as the title character in Dillinger (1945) and as the consummately brutal lover of Claire Trevor in Born to Kill (1947). Notorious also for his frequent, well-publicized past involvements in public altercations - like barroom brawls - and other real-life manifestations of rowdiness. (In a 1973 incident, he managed to get himself stabbed.) Though now a puffy-faced, totally bald old man, he continues as screen actor to project the hard-as-nails mien that has been ingrained since his younger days, as he evidences quite amply in Quentin Tarantino's Reservoir Dogs (1992).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNDI2MDY3NF5BMl5BanBnXkFtZTcwOTM1NzQyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0862937","name":"Lawrence Tierney","idIMDB":"nm0862937"},"actorId":"nm0862937","character":"Mr. Henderson","urlCharacter":"http://www.imdb.com/character/ch0460032","main":true},{"actorName":"Emmett Kelly","urlProfile":"http://www.imdb.com/name/nm0446374","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NTIxNjQ3NF5BMl5BanBnXkFtZTYwMjE4MTQ2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 December 1898","placeOfBirth":" Sedan, Kansas, USA","birthName":"Emmett Leo Kelly","bio":"Emmett Kelly was born on December 9, 1898 in Sedan, Kansas, USA as Emmett Leo Kelly. He was an actor and writer, known for Bette Midler: Ol' Red Hair Is Back (1977), The Greatest Show on Earth (1952) and The Clown and the Kids (1967). He was married to Elvira Gebhardt and Eva Moore. He died on March 28, 1979 in Sarasota, Florida, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NTIxNjQ3NF5BMl5BanBnXkFtZTYwMjE4MTQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0446374","name":"Emmett Kelly","idIMDB":"nm0446374"},"actorId":"nm0446374","character":"Emmett Kelly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cucciola","urlProfile":"http://www.imdb.com/name/nm0190975","urlPhoto":"","biography":{"bio":"Cucciola is an actor, known for The Greatest Show on Earth (1952).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0190975","name":"Cucciola","idIMDB":"nm0190975"},"actorId":"nm0190975","character":"Cucciola","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Antoinette Concello","urlProfile":"http://www.imdb.com/name/nm0174234","urlPhoto":"","biography":{"bio":"Antoinette Concello was a member of the famous \"Flying Concello\" aerial troupe, a family of flying trapeze artists. In the 20th Century multi-ring circus, the flying trapeze was the main attraction in the center ring of the \"Big Top.\" The Flying Concellos were the premier troupe of aerialists in the 1920s, and Antoinette became known as the \"greatest woman flyer of all time\" because she was the only woman to complete the fabled \"triple\" (see Carol Reed's 1956 film \"Trapeze\" for background about this legendary stunt). A triple means that the aerialist completes three full somersaults while \"flying\" through the air after leaving their bar and being caught by a \"catcher\" hanging upside down on the opposite bar. It is a dangerous stunt. Antoinette appeared with the troupe as one of the acts in Cecil B. DeMille's 1952 Best Picture Oscar-winning movie \"The Greatest Show on Earth,\" which uses Ringling Brothers, Barnum & Baily Circus as a backdrop. The red-coated Ringling ringmaster Fred Brandna would introduce her act by announcing that Antionette was the first and only woman to achieve the triple, and added that she did it with \"incomparable grace\". The legendary flyer did not disappoint her audience, performing the fabled triple at every performance. Antoinette Concello was inducted into the Circus Hall of Fame in 1963.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0174234","name":"Antoinette Concello","idIMDB":"nm0174234"},"actorId":"nm0174234","character":"Antoinette Concello","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Ringling North","urlProfile":"http://www.imdb.com/name/nm0636026","urlPhoto":"","biography":{"dateOfBirth":"14 August 1903","placeOfBirth":" Baraboo, Wisconsin, USA","bio":"John Ringling North was the nephew of John Ringling, one of the five Ringling brothers. John Ringling was born Johann Nicholas Rungling in 1866 in MacGregor, Iowa - the family Americanized the name to Ringling - and with his four brothers, founded what was to become the world's most successful circus in 1884. John Ringling traveled throughout Europe searching for new acts and forging global show business connections. In 1907, the Ringling brothers bought Barnum & Bailey Circus in London, after it had completed a European tour. Possessed of shrewd business skills, he was deeply involved in both the management of the circus and in its finances. Upon the death of his brother Charles in 1926, John took full control of the circus. As an individual, John Ringling invested widely in the booming early 20th Century American economy, and was listed as one of the richest men in the world in 1925. Unfortunately, the stock market crash of October 1929 almost wiped him out, though he retained a substantial art collection. He used it as a basis for a museum in Sarasota, Florida, where the circus wintered each year since 1909. John Ringling died in 1936 in New York City, bequeathed his museum, its art collection and his Sarasota mansion to the state of Florida. Control of the circus eventually passed to his nephew, John Ringling North, who possessed the same sharp business sense as his uncle. John Ringling North, who was born in Wisconsin in 1903, worked in the financial industry before joining tingling Brothers, Barnum & Bailey Circus after the Great Depression. The circus had gone into debt, and when North assumed control of the family business in 1947, he shrewdly used its business skills to get the company out of debt. In his 20 year tenure as circus boss, John North oversaw the evolution of Ringling Brothers from a train-transported to a truck-borne operation. The circus expanded its operations into the western United States, and with the demise of many of its rival circuses, truly lived up to its billed title as \"The Greatest Show on Earth.\"","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0636026","name":"John Ringling North","idIMDB":"nm0636026"},"actorId":"nm0636026","character":"John Ringling North","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tuffy Genders","urlProfile":"http://www.imdb.com/name/nm0312672","urlPhoto":"","biography":{"dateOfBirth":"20 April 1911","placeOfBirth":" Illinois, USA","birthName":"Harold Genders","bio":"Harold \"Tuffy\" Genders was a trapeze artist who was part of the \"The Wards\" trapeze act who eventually became General Manager Ringling Bros. and Barnum & Bailey Circus. Making his debut in \"The Greatest Show on Earth\" in 1911, he was born and raised in Bloomington, Illinois, where he trained at the Y.M.C.A. during the 1920s. Tuffy's first professional gig was with the Flying Wards troupe around 1930 or '31. The Wards were a flying return act that trained in Bloomington, and he likely replaced Eddie Ward, the founder of the troupe, who died the year before Tuffy caught on with the act. Tuffy married fellow trapeze artist Gracie Moore when they were both part of Bob Fisher's Fearless Flyers, another Bloomington trapeze troupe. Tuffy continued to work with the Ward troupe, but it was sold by Eddie Ward's widow to one of her late husband's students in 1936. The new owner, Art Concello, was a friend of Tuffy, who continued to work with various flying acts owned and managed by Concello over the years. When Concello became General Manager of the Ringling Bros. and Barnum & Bailey Circus, Tuffy became his assistant. After Concello retired (some accounts say he was fired) in the 1960s, Tuffy was promoted to General Manager of the Big Show. After the GInging Bros. circus was acquired by the Feld family, Tuffy retired. He died in February 1998 Sarasota, Florida.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0312672","name":"Tuffy Genders","idIMDB":"nm0312672"},"actorId":"nm0312672","character":"Tuffy Genders","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Kellogg","urlProfile":"http://www.imdb.com/name/nm0446120","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjcyODY5YTUtNDhlZi00NDExLWI0ZmEtODkzMTk3NzBlODk1L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 June 1916","placeOfBirth":" Hollywood, California, USA","birthName":"Giles Vernon Kellogg Jr.","height":"5' 10½\" (1.79 m)","bio":"John Kellogg was born on June 3, 1916 in Hollywood, California, USA as Giles Vernon Kellogg Jr. He was an actor, known for Twelve O'Clock High (1949), The Greatest Show on Earth (1952) and Peyton Place (1964). He died on February 22, 2000 in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjcyODY5YTUtNDhlZi00NDExLWI0ZmEtODkzMTk3NzBlODk1L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0446120","name":"John Kellogg","idIMDB":"nm0446120"},"actorId":"nm0446120","character":"Harry","urlCharacter":"http://www.imdb.com/character/ch0460033","main":true},{"actorName":"John Ridgely","urlProfile":"http://www.imdb.com/name/nm0725891","urlPhoto":"","biography":{"dateOfBirth":"6 September 1909","placeOfBirth":" Chicago, Illinois, USA","birthName":"John Huntington Rea","height":"6' 2\" (1.88 m)","bio":"John Ridgely was a versatile character actor who made over 100 films at Warner Brothers during the 1930s and 1940s. Starting out in bit roles in such films as Dark Victory (1939), They Died with Their Boots On (1941) and The Man Who Came to Dinner (1942), Ridgely eventually graduated to larger roles in such classics as Howard Hawks' Air Force (1943), The Big Sleep (1946), Destination Tokyo (1943) and Possessed (1947). After his Warner Brothers tenure ended, he freelanced at other studios and made stage and TV appearances until his untimely passing in 1968 at age 58.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0725891","name":"John Ridgely","idIMDB":"nm0725891"},"actorId":"nm0725891","character":"Assistant Manager","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0044672","urlIMDB":"http://www.imdb.com/title/tt0044672","business":{"budget":{"money":"$4,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$36,880,000","country":"USA","day":"31","month":"12","year":"1952","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1953/\">1953</a>"},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1951/\">1951</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 32 min (152 min)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Color (Technicolor)"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":["Technicolor (color by)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["16 mm","35 mm"]},"rating":"6.7","filmingLocations":[{"location":"Cedar City, Utah, USA"}],"rated":"NOT RATED","awards":[{"award":"Academy Awards, USA 1953","titlesAwards":[{"titleAwardOutcome":"Won Oscar","categories":[{"category":"Best Picture","names":[{"name":"Cecil B. DeMille","id":"nm0001124","role":null}]},{"category":"Best Writing, Motion Picture Story","names":[{"name":"Fredric M. Frank","id":"nm0290931","role":null},{"name":"Theodore St. John","id":"nm0820693","role":null},{"name":"Frank Cavett","id":"nm0147119","role":null}]}]},{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Director","names":[{"name":"Cecil B. DeMille","id":"nm0001124","role":null}]},{"category":"Best Costume Design, Color","names":[{"name":"Edith Head","id":"nm0372128","role":null},{"name":"Dorothy Jeakins","id":"nm0419820","role":null},{"name":"Miles White","id":"nm0925240","role":null}]},{"category":"Best Film Editing","names":[{"name":"Anne Bauchens","id":"nm0061640","role":null}]}]}]},{"award":"Golden Globes, USA 1953","titlesAwards":[{"titleAwardOutcome":"Won Golden Globe","categories":[{"category":"Best Motion Picture - Drama","names":[]},{"category":"Best Director","names":[{"name":"Cecil B. DeMille","id":"nm0001124","role":null}]},{"category":"Best Cinematography - Color","names":[{"name":"George Barnes","id":"nm0055604","role":null},{"name":"J. Peverell Marley","id":"nm0549132","role":null}]}]}]},{"award":"Directors Guild of America, USA 1953","titlesAwards":[{"titleAwardOutcome":"Nominated DGA Award","categories":[{"category":"Outstanding Directorial Achievement in Motion Pictures","names":[{"name":"Cecil B. DeMille","id":"nm0001124","role":null}]}]}]},{"award":"New York Film Critics Circle Awards 1952","titlesAwards":[{"titleAwardOutcome":"3rd place NYFCC Award","categories":[{"category":"Best Director","names":[{"name":"Cecil B. DeMille","id":"nm0001124","role":null}]}]}]},{"award":"Photoplay Awards 1953","titlesAwards":[{"titleAwardOutcome":"Won Special Award","categories":[{"category":"","names":[{"name":"Cecil B. DeMille","id":"nm0001124","role":null}]}]}]}],"votes":"10,013","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["trapeze","clown","circus","trapeze artist","elephant trainer","elephant","epic","horseback riding","thief","theft","tent","stiltwalker","pursuit","pluto the character","mother son relationship","mad hatter","jealousy","ice cream cone","horse","hippopotamus","cotton candy","costume","clown makeup","circus horse","circus boss","christmas","big top","alice in wonderland","acrobat","song","singing","singer","on the run","kiss","hidden identity","bare chested male","band","voice over narration","title sung by character","tiger","monkey","money","midget","lion","leopard","horse and carriage","hiding","handcuffs","dwarf","car hit by a train","blockbuster","train","rivalry","gorilla","old flame","train crash","dog","poker","police chase","animal","injury","love triangle","fistfight","gangster","backstage","fugitive","parade","doctor","train wreck","marriage proposal","circus performer","pipe","robbery","blood transfusion","disguise","car accident","falling from height","arrest","trampoline","euthanasia","melodrama","world war two veteran","florida","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 19:05:14"}}