{"data":{"movies":[{"title":"King Creole","originalTitle":"","year":"1958","releaseDate":"19580702","directors":[{"name":"Michael Curtiz","id":"nm0002031"}],"writers":[{"name":"Herbert Baker","id":"nm0048511"},{"name":"Michael V. Gazzo","id":"nm0311155"}],"runtime":"116 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDQzM2JkMjctOTdjMC00N2QzLWI2NWMtMDMzYWY2ZDEzOWU0XkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama","Musical"],"plot":"Having flunked graduation for a second time and needing cash to support his crabby (and thus unemployed) father, Danny Fisher takes a job as a singer in the King Creole nightclub - about the only joint around not run by smarmy crook Maxie Fields who wants him for his own place. He gets on pretty well with Fields' floozy though, and all this plus his involvement with Fields' hoods and with innocent five-and-dime store assistant Nellie means Danny finds his world closing in on him all ways round.","simplePlot":"A rebellious young man takes a job as a nightclub singer to make ends meet, attracting the attention of a local crime boss.","actors":[{"actorName":"Elvis Presley","urlProfile":"http://www.imdb.com/name/nm0000062","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTEzMTI3Nl5BMl5BanBnXkFtZTYwNTg4MDQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 January 1935","placeOfBirth":" Tupelo, Mississippi, USA","birthName":"Elvis Aron Presley","height":"5' 11¾\" (1.82 m)","bio":"Elvis Aaron Presley was born on January 8, 1935 in East Tupelo, Mississippi, to Gladys Presley (née Gladys Love Smith) and Vernon Presley (Vernon Elvis Presley). He had a twin brother who was stillborn. In September 1948, Elvis and his parents moved to Memphis, Tennessee where he attended Humes High School. In 1953, he attended the senior prom with the current girl he was courting, Regis Wilson. After graduating from high school in Memphis, Elvis took odd jobs working as a movie theater usher and a truck driver for Crown Electric Company. He began singing locally as \"The Hillbilly Cat\", then signed with a local recording company, and then with RCA in 1955. Elvis did much to establish early rock and roll music. He began his career as a performer of rockabilly, an up-tempo fusion of country music and rhythm and blues, with a strong backbeat. His novel versions of existing songs, mixing 'black' and 'white' sounds, made him popular - and controversial - as did his uninhibited stage and television performances. He recorded songs in the rock and roll genre, with tracks like \"Jailhouse Rock\" and \"Hound Dog\" later embodying the style. Presley had a versatile voice and had unusually wide success encompassing other genres, including gospel, blues, ballads and pop music. Teenage girls became hysterical over his blatantly sexual gyrations, particularly the one that got him nicknamed \"Elvis the Pelvis\" (television cameras were not permitted to film below his waist). In 1956, following his six television appearances on The Dorsey Brothers' \"Stage Show\", Elvis was cast in his first acting role, in a supporting part in Love Me Tender (1956), the first of 33 movies he starred in. In 1958, Elvis was drafted into the military, and relocated to Bad Nauheim, Germany. There he met and fell in love with 14-year old army damsel Priscilla Ann Wagner (Priscilla Presley), whom he would eventually marry after an eight-year courtship, and with whom he had his only child, Lisa Marie Presley. Elvis' military service and the \"British Invasion\" of the 1960s reduced his concerts, though not his movie/recording income. Through the 1960s, Elvis settled in Hollywood, where he starred in the majority of his thirty-three movies, mainly musicals, acting alongside some of the most well known actors in Hollywood. Critics panned most of his films, but they did very well at the box office, earning upwards of $150 million total. His last fiction film, Change of Habit (1969), deals with several social issues; romance within the clergy, an autistic child, almost unheard of in 1969, rape, and mob violence. It has recently received critical acclaim. Elvis made a comeback in the 1970s with live concert appearances starting in early 1970 in Las Vegas with over 57 sold-out shows. He toured throughout the United States, appearing on-stage in over 500 live appearances, many of them sold out shows. His marriage ended in divorce, and the stress of constantly traveling as well as his increasing weight gain and dependence upon stimulants and depressants took their toll. Elvis Presley died at age 42 on August 16, 1977 at his mansion in Graceland, near Memphis, shocking his fans worldwide. At the time of his death, he had sold more than 600 million singles and albums. Since his death, Graceland has become a shrine for millions of followers worldwide. Elvis impersonators and purported sightings have become stock subjects for humorists. To date, Elvis Presley is the only performer to have been inducted into three separate music 'Halls of Fame'. Throughout his career, he set records for concert attendance, television ratings and recordings sales, and remains one of the best-selling and most influential artists in the history of popular music.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTEzMTI3Nl5BMl5BanBnXkFtZTYwNTg4MDQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000062","name":"Elvis Presley","nicknames":["The Pelvis","The King","The King of Rock 'n' Roll"],"idIMDB":"nm0000062"},"actorId":"nm0000062","character":"Danny Fisher","urlCharacter":"http://www.imdb.com/character/ch0119284","main":true},{"actorName":"Carolyn Jones","urlProfile":"http://www.imdb.com/name/nm0427700","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NDQwMjU2N15BMl5BanBnXkFtZTcwNzEwNjYyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1930","placeOfBirth":" Amarillo, Texas, USA","birthName":"Carolyn Sue Jones","height":"5' 5\" (1.65 m)","bio":"Carolyn Jones was born April 28, 1930, in Amarillo, Texas. Her mother was Jeannette and her sister was Bette (Moriarty). She was an imaginative child, much like her mother. In 1934, her father abandoned the family and her mother moved them in with her parents, also in Amarillo. As a child Carolyn suffered from severe asthma. Although she loved movies, she was often too sick to attend, so she listened to her favorites, Danny Kaye and Spike Jones and read as many movie fan magazines as she could. She dreamed of attending the famed Pasadena Playhouse and received many awards at school for speech, poetry, and dramatics. In 1947, she was accepted as a student at the Pasadena Playhouse, and her grandfather agreed to pay for her classes. She worked in summer stock to supplement her income, graduating in 1950. She gave herself a complete head-to-toe makeover, including painful cosmetic nose surgery to make herself ready for movie roles. Working as an understudy at the Players Ring Theater, she stepped in when the star left to get married. She was seen by a talent scout from Paramount and given a screen test, which went well. She made her first appearance in The Turning Point (1952). She did some other work during her 6-month contract, but when it ended, Paramount, suffering from television's impact, let it lapse. She quipped, \"They let me and 16 secretaries go!\" She started working in television but kept busy on stage as well. There she met Aaron Spelling, and they became a couple. She made a breakthrough in the 3-D movie House of Wax (1953) and garnered excellent reviews. Aaron was still struggling, so he felt he wasn't able to propose to Carolyn; she finally proposed to him. They were married in April 1953. Neither was earning much, but they really enjoyed each other and their life. Many saw them as an ideal couple. Carolyn decided against children, since she felt she could not juggle the demands of both a career and a family. Columbia Pictures saw her and wanted to test her for the part of prostitute Alma Burke in From Here to Eternity (1953), but she got extremely sick with pneumonia and the part went to Donna Reed instead. She did, however, achieve success in the sci-fi classic Invasion of the Body Snatchers (1956), a subtle allegory of the times (McCarthyism). Aaron had little success as an actor and Carolyn pushed him to become a writer, even threatening to leave him. She constantly promoted his scripts whenever she could and he was ultimately hired by Dick Powell. Carolyn meanwhile was successful once more in The Bachelor Party (1957) (famous line, \"Just say you love me--you don't have to mean it!\"). For this role, she surprised cast members by dying her hair black and cutting it short. This stunning look served her well for a number of roles. For her eight minutes on screen, she received glowing reviews and was nominated for an Academy Award but lost. She followed this with an impressive appearance in King Creole (1958), generally regarded as Elvis Presley's best film. She then gave arguably her best performance ever in Career (1959), but the film was not commercially successful. She played a serious role in this, leaving the kooky role she might have played to Shirley MacLaine. As Aaron's career soared, the marriage started to fail. They separated in October 1963 and were amicably divorced in August 1964, with Carolyn asking for no alimony. They remained friends. She worked at various roles until she got the part for which she will best be remembered, that of Morticia Addams in The Addams Family (1964). She spent two years in this role. Her costume was designed to copy the cartoon drawings and no doubt inspired such imitators as Cassandra Peterson (Elvira, Mistress of the Dark). The show went head-to-head with The Munsters (1964) and Bewitched (1964). The quite blatant sexual chemistry between Morticia and her husband Gomez (John Astin was shocking for the time, perhaps only matched by the sexuality displayed in \"Bachelor Party\" and \"King Creole.\" The show was a big hit and she received all the fame she had craved. However, the network decided to cancel the show, despite its success, after only two years. Typecast as Morticia but without the income that a few more years would have provided, she found life difficult and roles few. While acting on the road, she married her voice coach, Herbert Greene, a well-known and respected Broadway conductor and musical director, and they moved together to Palm Springs, California. After seven years, she left him and returned to Hollywood, determined to try to restart her career. She was surprisingly successful and performed in several shows, including an episode of Fantasy Island (1977) in 1978, a show on which Aaron was the producer. She played Myrna Clegg on the soap Capitol (1982) from 1982 to 1983, despite having been diagnosed with colon cancer in 1981. She had aggressive treatment for the cancer, but it returned during her time on the show and she was told it was terminal. She played some scenes despite being confined to a wheelchair and working in great pain. Although they knew she was dying, she married her boyfriend of five years, Peter Bailey-Britton, in September 1982. She died on August 3, 1983. Carolyn told her sister that she wanted her epitaph to be \"She gave joy to the world.\" She certainly had many friends who loved her greatly, and many fans who enjoyed her wonderful performances.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NDQwMjU2N15BMl5BanBnXkFtZTcwNzEwNjYyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0427700","name":"Carolyn Jones","idIMDB":"nm0427700"},"actorId":"nm0427700","character":"Ronnie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Walter Matthau","urlProfile":"http://www.imdb.com/name/nm0000527","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NjYzOTc0NV5BMl5BanBnXkFtZTYwMjAxNDQ2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1920","placeOfBirth":" Lower East Side, Manhattan, New York City, New York, USA","birthName":"Walter Jake Matthow","height":"6' 2½\" (1.89 m)","bio":"Walter Matthau was born on October 1, 1920 in Lower East Side, Manhattan, New York City, New York, USA as Walter Jake Matthow. He was an actor, known for The Odd Couple (1968), Charade (1963) and Grumpy Old Men (1993). He was married to Carol Grace and Grace Geraldine Johnson. He died on July 1, 2000 in Santa Monica, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NjYzOTc0NV5BMl5BanBnXkFtZTYwMjAxNDQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000527","name":"Walter Matthau","nicknames":["Jake"],"idIMDB":"nm0000527"},"actorId":"nm0000527","character":"Maxie Fields","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dolores Hart","urlProfile":"http://www.imdb.com/name/nm0366247","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA4OTg1OTc1NF5BMl5BanBnXkFtZTcwMzIzMzQ2NQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1938","placeOfBirth":" Chicago, Illinois, USA","birthName":"Dolores Hicks","height":"5' 5½\" (1.66 m)","bio":"Dolores Hart was born on October 20, 1938 in Chicago, Illinois, USA as Dolores Hicks. She is an actress, known for Where the Boys Are (1960), King Creole (1958) and Francis of Assisi (1961).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA4OTg1OTc1NF5BMl5BanBnXkFtZTcwMzIzMzQ2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0366247","name":"Dolores Hart","idIMDB":"nm0366247"},"actorId":"nm0366247","character":"Nellie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dean Jagger","urlProfile":"http://www.imdb.com/name/nm0415591","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1NzkxNDQ4MF5BMl5BanBnXkFtZTcwMzg0MjIyOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 November 1903","placeOfBirth":" Columbus Grove, Ohio, USA","birthName":"Ira Dean Jagger","height":"6' 2\" (1.88 m)","bio":"Dean Jagger was born in Lima, Ohio, on November 7, 1903. He dropped out of high school twice before finally graduating from Wabash College. Working first as a school teacher, he soon became interested in acting and enrolled at Chicago's \"Lyceum Art Conservatory\". Mr. Jagger made his first movie and only silent film, The Woman from Hell (1929) in 1929, starring Mary Astor. During 1929 he also appeared in the film Handcuffed (1929). He quickly found his niche as a character actor and the highlight of his career was winning an Oscar for \"Best Supporting Actor,\" in the 1949 movie Twelve O'Clock High (1949). Dean played Principal Albert Vane on TV for the 1963-1964 season of Mr. Novak (1963). Dean Jagger died in Santa Monica, California, on February 5, 1991.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1NzkxNDQ4MF5BMl5BanBnXkFtZTcwMzg0MjIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0415591","name":"Dean Jagger","idIMDB":"nm0415591"},"actorId":"nm0415591","character":"Mr. Fisher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Liliane Montevecchi","urlProfile":"http://www.imdb.com/name/nm0599656","urlPhoto":"","biography":{"dateOfBirth":"13 October 1932","placeOfBirth":" Paris, France","bio":"Paris-born entertainer Liliane Montevecchi first put on ballet shoes at the age of 9. Nine years later, she became prima ballerina in Roland Petit's ballet company. Hollywood took a sudden interest in her in the early 1950s along with other foreign-born ballet dancers such as Leslie Caron, Zizi Jeanmaire, and Moira Shearer. Liliane was signed to a contract with Metro-Goldwyn-Mayer and began appearing in their musicals. However, for the most part, the roles were small and only mildly flavorful, and did nothing to not enough to distinguish her roles which did nothing to abet her film career. Such cinematic ventures as The Glass Slipper (1955) (starring Caron), Daddy Long Legs (1955) (also starring Caron), Moonfleet (1955), Meet Me in Las Vegas (1956), The Sad Sack (1957), Me and the Colonel (1958), and the Elvis Presley vehicle King Creole (1958) came and went without much fanfare for Liliane personally. It was the live stage that would raise her to legendary status. First, she starred with the Folies Bergere for nine years, traveling all over the world. She then conquered Broadway in the 1980s, winning both Tony and Drama Desk awards for her flashy role in the musical \"Nine\", based on Fellini's art-house film 8½ (1963). She earned a Tony Award nomination several years later with an equally flashy role in the musical \"Grand Hotel\". The entertainer, beloved for her delightful mangling of the English language, has appeared in concert at Carnegie Hall and Lincoln Center, and has vamped and camped with the best of them in her acclaimed cabaret shows and niteries from here to Timbuktu. These include the semi-autobiographical shows \"On the Boulevard\" and \"Back On the Boulvards.\" Still going strong at age 70+, Lilliane Montelecchi has shown time and time again that she is a one-of-a-kind diva who knows no limit.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0599656","name":"Liliane Montevecchi","idIMDB":"nm0599656"},"actorId":"nm0599656","character":"Forty Nina","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vic Morrow","urlProfile":"http://www.imdb.com/name/nm0607558","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNzQ2NjAyM15BMl5BanBnXkFtZTYwNzc2Mjky._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 February 1929","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"Victor Morozoff","height":"5' 9\" (1.75 m)","bio":"Vic Morrow was born in the Bronx, New York, to Jean (Kress) and Harry Morrow, an electrical engineer. His parents were Russian Jewish immigrants. Morrow dropped out of high school at 17 to join the U.S. Navy. When he left the Navy, he used the G.I. Bill to study pre-law at Florida State. While Morrow was working on his degree in Law, he also took part in a school play and found that he preferred stage acting to courtroom acting. When he went to New York, Morrow enrolled in the Actors' Workshop to improve his skills. After graduating, he was cast in the summer stock production of \"A Streetcar Named Desire\". His screen debut came when he was signed by MGM to play a tough-talking, surly street punk in Blackboard Jungle (1955). The good news was that he was now in the movies, but the bad news was that he became typecast as a heavy. Disappointed with this situation, Morrow left MGM after a few years and headed back to school to study directing at USC. He made some appearances on television and in 1962 found a role that brought him fame and made him the \"hero\": the TV series Combat! (1962), in which he played Sgt. Chip Saunders, veteran squad leader. Due to his demands, the show quickly went from an alternating showcase between platoon leader Lt. Hanley (Rick Jason) and Sgt. Saunders to one featuring mainly Saunders. With the success of the show, Morrow put to use what he had learned at USC and directed some episodes. In 1965 he and his wife divorced, and two years later the series ended. These two events put him into a personal and professional slide. By 1969 he began almost a decade of making made-for-TV movies, with an occasional foray into features. Most of his roles, though, put him back as a \"heavy\", although he did have a good part as a tough L.A. cop going up against out-of-town mobsters in a two-part episode of Police Story (1973) that was later released as a telefeature. While he worked in the theater and looked forward to the big screen, most of his roles were in \"B\" pictures such as Dirty Mary Crazy Larry (1974) and Treasure of Matecumbe (1976). He got good reviews playing Walter Matthau's nemesis in the hit comedy The Bad News Bears (1976), but was not involved in any of the following sequels, and he seemed to be stuck in a rut of \"B\" features and average made-for-TV films. With the failure of his second marriage, the death of his mother and the scarcity of good parts, Morrow hit the bottle, which did his career even less good. In 1982, however, he refocused his drive and made a comeback in Twilight Zone: The Movie (1983), but was unfortunately killed on the early morning hours of July 23, 1982 in a tragic, freak accident on the set while filming a scene involving a helicopter which crashed right on top of him and two young children. Vic was the father of Carrie Ann Morrow and actress Jennifer Jason Leigh.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNzQ2NjAyM15BMl5BanBnXkFtZTYwNzc2Mjky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0607558","name":"Vic Morrow","idIMDB":"nm0607558"},"actorId":"nm0607558","character":"Shark","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Stewart","urlProfile":"http://www.imdb.com/name/nm0829717","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMjUyMjU5OV5BMl5BanBnXkFtZTcwMjM5NDYwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 March 1908","placeOfBirth":" New York City, New York, USA","birthName":"Paul Sternberg","bio":"Esteemed character actor Paul Stewart had a pair of the coldest orbs in town and made his living for decades playing dark, callous, shiftless villains, including a vast number of mobsters. Not a well-known name per se, he was nevertheless a reliable actor who seemed to have been born for the film noir and gangland crime drama genre with his premature silvery hair, dark thick brows and probing, deep-set eyes, all accentuated by a tough and penetrating Brooklyn accent. Born in New York City on March 13, 1908, Stewart developed an interest for acting in his teens, making his Broadway debut with \"Two Seconds\" in 1931, following graduation from Columbia University. He had played a few more stage roles in New York when he met and made an impression on Orson Welles. As a result he became a founding member of the Mercury Theatre and a founding member of AFTRA when it was just a radio union. Stewart's tough, guttural voice became a familiar sound on the 1930s airwaves and he was among the cast in the infamous Welles broadcast \"The War of the Worlds.\" He married band singer/actress Peg La Centra (1910-1996) in 1939 and over the years they appeared together on many radio programs. She also provided singing voices for such stars as Susan Hayward on celluloid. Welles next put Stewart in his films, with the classic Citizen Kane (1941) as Raymond, Kane's wily valet, and Stewart found himself in demand as an untrustworthy character player. He essayed a number of stark, sinister types to perfection, with roles in such films as Johnny Eager (1941), Mr. Lucky (1943), Champion (1949), Illegal Entry (1949), Twelve O'Clock High (1949), Carbine Williams (1952), The Bad and the Beautiful (1952) and Kiss Me Deadly (1955). On TV he became a regular on a couple of short-lived series -- Top Secret (1954) and The Man Who Never Was (1966). In the 1950s Stewart turned to stage and TV directing as well, helming a number of popular crimers such as Peter Gunn (1958), Michael Shayne (1960), Perry Mason (1957), It Takes a Thief (1968), Hawaii Five-O (1968) and Remington Steele (1982). His voice also fit the bill for cartoons in the 1960s. In 1974 Stewart suffered a heart attack while on location in New Mexico for Bite the Bullet (1975), but he returned sporadically to films, including the role of impresario Florenz Ziegfeld in W.C. Fields and Me (1976). He suffered a second and fatal heart attack in 1986 at age 77.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMjUyMjU5OV5BMl5BanBnXkFtZTcwMjM5NDYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0829717","name":"Paul Stewart","idIMDB":"nm0829717"},"actorId":"nm0829717","character":"Charlie LeGrand","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jan Shepard","urlProfile":"http://www.imdb.com/name/nm0791629","urlPhoto":"","biography":{"dateOfBirth":"19 March 1928","placeOfBirth":" Quakertown, Pennsylvania, USA","birthName":"Josephine Angela Sorbello","height":"5' 3½\" (1.61 m)","bio":"Jan Shepard was born on March 19, 1928 in Quakertown, Pennsylvania, USA as Josephine Angela Sorbello. She is an actress, known for Attack of the Giant Leeches (1959), King Creole (1958) and That Certain Summer (1972). She has been married to Ray Boyle since 1954.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0791629","name":"Jan Shepard","idIMDB":"nm0791629"},"actorId":"nm0791629","character":"Mimi Fisher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian G. Hutton","urlProfile":"http://www.imdb.com/name/nm0404606","urlPhoto":"","biography":{"dateOfBirth":"1 January 1935","placeOfBirth":" New York City, New York, USA","birthName":"Brian Geoffrey Hutton","bio":"Brian G. Hutton was born on January 1, 1935 in New York City, New York, USA as Brian Geoffrey Hutton. He was an actor and director, known for Where Eagles Dare (1968), Kelly's Heroes (1970) and Last Train from Gun Hill (1959). He was married to Victoria Sierra. He died on August 19, 2014 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0404606","name":"Brian G. Hutton","idIMDB":"nm0404606"},"actorId":"nm0404606","character":"Sal","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Grinnage","urlProfile":"http://www.imdb.com/name/nm0342466","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1ODcyMTQ1M15BMl5BanBnXkFtZTcwMDc4NDkxMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 January 1931","placeOfBirth":" Los Angeles, California, USA","birthName":"Jack Eugene Stewart","bio":"Jack Grinnage was born on January 20, 1931 in Los Angeles, California, USA as Jack Eugene Stewart. He is an actor, known for Rebel Without a Cause (1955), King Creole (1958) and Kolchak: The Night Stalker (1974).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1ODcyMTQ1M15BMl5BanBnXkFtZTcwMDc4NDkxMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0342466","name":"Jack Grinnage","idIMDB":"nm0342466"},"actorId":"nm0342466","character":"Dummy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dick Winslow","urlProfile":"http://www.imdb.com/name/nm0935483","urlPhoto":"","biography":{"dateOfBirth":"25 March 1915","placeOfBirth":" Jennings, Louisiana, USA","birthName":"Richard Winslow Johnson","bio":"Dick Winslow's parents were Winonian Breazeala (a writer) and Sidney R. Johnson. Graduated from Belmont High School in Los Angeles, and first appeared in films when he was five years old. Appeared in the play \"Silver Thread\" at the Egan Theatre in Los Angeles, and in \"The Emperor's Clothes\" at the Belmont Theatre in Los Angeles. He played the pipe organ, piano, marimba, bag pipes, accordion, drums, saxophone and other wind instruments. Had appeared in 75 films by 1934.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0935483","name":"Dick Winslow","idIMDB":"nm0935483"},"actorId":"nm0935483","character":"Eddie Burton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Raymond Bailey","urlProfile":"http://www.imdb.com/name/nm0047450","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNzYyOTI1OV5BMl5BanBnXkFtZTcwOTQ1NTUxOA@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 May 1904","placeOfBirth":" San Francisco, California, USA","birthName":"Raymond Thomas Bailey","height":"5' 10\" (1.78 m)","bio":"Raymond Bailey was a great example of \"If at first you don't succeed...\" After high school, Bailey headed for Hollywood with the intent on becoming a movie star, but soon found it tougher than he thought. Instead Bailey went into a high finance career working as stockbroker and banker. He made a second stab at Hollywood, and again had no success. He then became a seaman, working on various freighters and travelling all over the world. Bailey also worked on a pineapple plantation in Hawaii, and tried his luck in the local theatre. Deciding to give Hollywood one more try in 1938, he got lucky getting several small parts in the movies which eventually evolved into bigger character roles. When television became big, Bailey was in demand for parts and it was there he got his most famous part on the hit sitcom The Beverly Hillbillies (1962), as (ironically) banker Milburn Drysdale, whose fists were tighter than Elly May's pants. After the show ended, he did a few movie roles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNzYyOTI1OV5BMl5BanBnXkFtZTcwOTQ1NTUxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0047450","name":"Raymond Bailey","idIMDB":"nm0047450"},"actorId":"nm0047450","character":"Mr. Evans - School Principal","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leon Tyler","urlProfile":"http://www.imdb.com/name/nm0852766","urlPhoto":"","biography":{"dateOfBirth":"16 June 1932","placeOfBirth":" St. Louis, Missouri, USA","bio":"Leon Tyler was born on June 16, 1932 in St. Louis, Missouri, USA. He is an actor, known for The Absent Minded Professor (1961), The Monkey's Uncle (1965) and Ghost of Dragstrip Hollow (1959).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0852766","name":"Leon Tyler","idIMDB":"nm0852766"},"actorId":"nm0852766","character":"Drug Clerk","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0051818","urlIMDB":"http://www.imdb.com/title/tt0051818","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":[{"money":"587,378","country":"France","day":"31","month":"12","year":"1960","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"20","month":"01","year":"1958","remarks":null},{"money":null,"country":null,"day":"10","month":"03","year":"1958","remarks":null}],"copyrightHolder":"Copyright © 1958 by Hal B. Wallis and Joseph H. Hazen"},"technical":{"runtime":["1 hr 56 min (116 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Black and White"],"aspectRatio":["1.85 : 1 (intended ratio)"],"camera":["Mitchell BNC"],"laboratory":["Technicolor"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.0","filmingLocations":[{"location":"New Orleans, Louisiana, USA"}],"rated":"PG","awards":[],"votes":"3,454","type":"Movie","companyCreditsSimple":[{"idCompany":"co0197491","name":"Wallis-Hazen"}],"keywords":{"keywords":["singer","nightclub","busboy","high school","crime boss","delinquent","kiss on the lips","criminal","pier","accidental shooting","dying words","19 year old","taxi","nightclub owner","woman shot","pistol","nursing back to health","arm bandage","stabbed in the arm","surgeon","rock 'n' roll","hit with a chair","backstage","teen romance","knife fight","stabbed in the chest","back alley","single father","widower","ferry","store clerk","alley","knife","african american","gumbo","rain","drugstore","boyfriend girlfriend relationship","new job","food cart","apartment","balcony","aspiring singer","hit on the head","juvenile delinquent","busking","knocked out","waitress","older man younger woman relationship","older woman younger man relationship","high school dropout","high school student","teenage boy","teenage protagonist","two word title","shot to death","gunshot","father daughter relationship","reference to enrico caruso","father son relationship","school principal","punched in the face","brother sister relationship","horse and carriage","blood","anger","city park","blackmail","tears","doctor","mugging","hospital","thug","audience","dressing room","acoustic guitar","performer","marquee","bartender","job offer","shoplifting","pharmacist","teenage gang","bar","stripper","music band","scam","unemployment","switchblade","guitarist","street vendor","prostitute","face slap","riverboat","stage","applause","hoodlum","singing","mild violence","violence","brawl","fistfight","black belt","karate chop","karate","1950s","cult film","new orleans louisiana","street gang","gang","pharmacy","teenager","young love","based on book","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:22:36"}}