{"data":{"movies":[{"title":"Mr. Moto in Danger Island","originalTitle":"","year":"1939","releaseDate":"19390407","directors":[{"name":"Herbert I. Leeds","id":"nm0498584"}],"writers":[{"name":"Peter Milne","id":"nm0590361"},{"name":"John Reinhardt","id":"nm0718115"}],"runtime":"64 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDZkNzc5OGItMGYxZC00OTZjLTgwM2YtZDcyMWRjOTFiYTZkXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama","Mystery","Thriller"],"plot":"Puerto Rico has become the back door by which a criminal syndicate smuggles inexpensive contraband diamonds from South America into the United States, dramatically driving down the price of legitimate gems. After they have ruthlessly murdered a special investigator, Moto is assigned to the case. While sailing to the island he impresses Twister McGurk, a slow-witted but amiable wrestler, with his martial arts abilities and gains a loyal friend and bodyguard. When an attempt on his life fails and another government official is murdered, Moto sends authorities a fake telegram identifying himself as a criminal named Shimura and making him and the Twister wanted fugitives. That ploy allows them to infiltrate the gang and expose the criminal mastermind behind it.","simplePlot":"The U.S. government asks Mr. Moto to go to Puerto Rico to investigate diamond smuggling after an earlier investigator is murdered.","actors":[{"actorName":"Peter Lorre","urlProfile":"http://www.imdb.com/name/nm0000048","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MzM0ODQwOV5BMl5BanBnXkFtZTYwMjYwNjI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 June 1904","placeOfBirth":" Rózsahegy, Austria-Hungary [now Ruzomberok, Slovakia]","birthName":"László Löwenstein","height":"5' 3½\" (1.61 m)","bio":"As a youth Peter Lorre ran away from home, worked as a bank clerk and, after stage training in Vienna, made his acting debut in Zurich. He remained unknown, traveling for several years and acting in Germany, Austria and Switzerland, until Fritz Lang cast him as the psychopathic child killer in M (1931). After several more films in Germany, Lorre left as the Nazis came to power, going to Paris, London and, in 1935, Hollywood. He played Raskolnikov in Crime and Punishment (1935) and a series of Mr. Moto movies during the late 1930s. He began his pairing with Sydney Greenstreet as Joel Cairo in The Maltese Falcon (1941), continued in Casablanca (1942) and seven other films during the early 1940s. In Germany he wrote, directed and starred in L'homme perdu (1951). After that, somewhat heavier, he played in a string of not-so-stellar efforts, one exception being his role as a clown in The Big Circus (1959). He died the year he made his last movie, playing a stooge in Jerry Lewis' The Patsy (1964).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MzM0ODQwOV5BMl5BanBnXkFtZTYwMjYwNjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000048","name":"Peter Lorre","nicknames":["Lazzy","Europe's One Man Chamber of Horrors"],"idIMDB":"nm0000048"},"actorId":"nm0000048","character":"Mr. Moto","urlCharacter":"http://www.imdb.com/character/ch0031266","main":true},{"actorName":"Jean Hersholt","urlProfile":"http://www.imdb.com/name/nm0380965","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MDE3NjAxMl5BMl5BanBnXkFtZTcwMjExMDExOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 July 1886","placeOfBirth":" Copenhagen, Denmark","birthName":"Jean Buron Hersholt","height":"5' 11\" (1.8 m)","bio":"If ever there was a Great Dane in Hollywood it was Jean Hersholt - and one of its great hearts as well. He was from a well-known Danish stage and entertainment family that had toured throughout Europe performing with young Jean as an essential cast member. He graduated from the Copenhagen Art School and continued expanding his stage experience and evidently decided early that he wanted to work in films. He did just two very early (1906) silent films in Germany. Hersholt emigrated from Denmark to the US while still a young man in 1913. Like many another European he came to America to seek further opportunities. Unlike many other European actors who appeared on Broadway in their early American careers, Hersholt never trod The Great White Way. He moved on to Hollywood in 1914 where the future of silent movies had taken the lead. He started as a movie extra then progressed into small feature player roles from 1915 through 1917. For that latter year he had no less than 17 bit parts. By the 1920s his roles were substantial feature pieces, but most of these were as villains - in fact, a concoction of really vile characters. His theater experience serving him well, he played them so well that he much sought after by directors. Several of his 1920s films were landmarks of the silent era, an early one being The Four Horsemen of the Apocalypse (1921) which helped propel Rudolf Valentino into the stellar heights. Hersholt became popular and well paid. And certainly his signature silent role was the lead character of Marcus Schouler in the Erich von Stroheim great film Greed (1924), based on the novel McTeague. Stroheim, who spent far more time in front of the camera as an actor, was already well know as a task master and perfectionist director. He went through 42 reels of film for the picture - a numbing nine hours of screen time (shown only once at that length in a private studio screening). He cut the film to five hours, but it was further whittled to a bit over two for release, causing Stroheim to quip bitterly of the editor, \"The only thing he had on his mind was his hat!\" The powerful film was still there, but the massive editing resulted in whole roles disappearing, not to mention some telltale continuity. Stroheim's need for realism resulted in the climax of the movie to be shot in Death Valley. Still hot in the fall time, Hersholt endured like a veteran but required a hospital stay after sweating away 27 pounds. Fortunately into the later 1920s Hersholt's roles expanded into a more realistic balance of characters-more virtuous roles - but still some shady fellows and especially the unsuspected, and thus surprising, guilty party in the ever popular murder mysteries. He worked for Samuel Goldwyn for about a year (1923-1924), for Paramount from 1927 through 1929, and several other studios during the period. By the end of the silent era, including those early primitive part mono features with small bits of audio music, sound effects, or dialog, Hersholt was a tried veteran of 75 films. His first all mono sound film was The Climax (1930) and despite a Germanic accent, he had a pleasant, mellow voice and a camera friendly presence that ensured him continued success. The variety ran the gamut from a sturdy supporting part in Grand Hotel (1932), to supporting Boris Karloff and a pretty hot Myrna Loy in The Mask of Fu Manchu (1932), and doing the same in Dinner at Eight (1933). Busy with nine movies in 1930, he also moved into people's living rooms on radio as well during that year. Of course, for some time Hersholt was a mature actor-simply meaning he had many secondary roles as doctors and professors and nobles of many sorts and increasingly he appeared as benign fatherly types. Father roles of the 20s continued into the 30s - augmented with grandfather roles as well. He was the father of Sonja Henie in that charismatic champion ice skater's first Hollywood film One in a Million (1936), and he is perhaps best remembered as the embittered but deeply caring grandfather of Shirley Temple in the beloved Heidi (1937). But it was another role as a doctor that would provide a continuing vehicle for Hersholt and something of a fateful direction for the actor. The mid-30s were abuzz with the births of the Dionne Quintuplets in Canada. Hollywood jumped on it with usual alacrity, highlighting the story and the officiating obstetrician, Dr. Dafoe, who was translated into Dr. John Luke, in The Country Doctor (1936). Hersholt brought the right ingredients to the part of Luke and two years later a sequel followed, Five of a Kind (1938). Hersholt thought the character good medicine all round and was enthusiastic about a series of movies, but Dafoe himself blocked this idea. Nevertheless, in 1937 Hersholt had already germinated a new radio series to continue portraying a dedicated and kindly small town doctor. For a character name Hersholt turned to his most beloved author, his countryman, literary light Hans Christian Andersen, for a name-Dr. Christian. It was a hit and, and he convinced RKO Radio Pictures to bankroll a series of six Dr. Christian films (1939-41). These latter and a few other films would mark the end of Hersholt's film career, but he was so very busy otherwise. His familiarity with Andersen was a scholarly avocation and labor of love, furthered by enthusiastic collecting of a library of important Andersen editions and related bibliography (which would later go to the Library of Congress). His English translation (see Trivia below) of the Andersen corpus of fairy tales (including his addition of several other Andersen stories from the author's private papers) remains perhaps the most comprehensive and best effort-even more so for Hersholt personal interpretation of Andersen. Hersholt would also write several articles about Andersen and edit The Andersen-Scudder-Letters (1948). Among other literary pursuits Hersholt also co-wrote a novel based on his Dr. Christian character. It was in Hersholt's generous nature to give back something in gratitude for the acting career afforded him in Hollywood. His payment was rich indeed: the Motion Picture Relief Fund, the retirement home and hospital inspired by it and generated from it (see Trivia below), and the great charitable work that Hersholt would perform were paid back with two Academy Awards, the second after his tenure as president of the Academy. These special honors would be the seed of the Jean Hersholt Humanitarian Award (see Trivia below). But in 1956 Hersholt was dying of cancer - and yet that would not stop him from one more good turn. His beloved Dr. Christian character was going to TV (produced by the Ziv Studios), and he was asked to symbolically pass the baton to the new Dr. Christian, Macdonald Carey. With a tremendous effort, Hersholt, now withered to 95 pounds braved the first episode shooting, capping his life with one last magnificent example of his humanity.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MDE3NjAxMl5BMl5BanBnXkFtZTcwMjExMDExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0380965","name":"Jean Hersholt","idIMDB":"nm0380965"},"actorId":"nm0380965","character":"Sutter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Amanda Duff","urlProfile":"http://www.imdb.com/name/nm0240358","urlPhoto":"","biography":{"dateOfBirth":"6 March 1914","placeOfBirth":" Fresno, California, USA","bio":"Amanda Duff was born on March 6, 1914 in Fresno, California, USA. She was an actress, known for The Devil Commands (1941), Just Around the Corner (1938) and Mr. Moto in Danger Island (1939). She was married to Philip Dunne. She died on April 6, 2006 in San Francisco, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0240358","name":"Amanda Duff","idIMDB":"nm0240358"},"actorId":"nm0240358","character":"Joan Castle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Warren Hymer","urlProfile":"http://www.imdb.com/name/nm0405220","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjRkZmMwZTctZjI2NC00Yjc2LWEwNTQtZmZiMWMwNjBmYzYyXkEyXkFqcGdeQXVyMjU4NzU2OTA@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 February 1906","placeOfBirth":" New York City, New York, USA","height":"6' (1.83 m)","bio":"Warren Hymer was born on February 25, 1906 in New York City, New York, USA. He was an actor, known for Meet John Doe (1941), Destry Rides Again (1939) and One Way Passage (1932). He was married to Beau Williams and Virginia Meyer. He died on March 25, 1948 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjRkZmMwZTctZjI2NC00Yjc2LWEwNTQtZmZiMWMwNjBmYzYyXkEyXkFqcGdeQXVyMjU4NzU2OTA@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0405220","name":"Warren Hymer","idIMDB":"nm0405220"},"actorId":"nm0405220","character":"Twister McGurk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Lane","urlProfile":"http://www.imdb.com/name/nm0485518","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODljZGNkMGUtNWNjYy00ZGMxLTkyYzQtZDNlODAzMGY5YWVlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 May 1899","placeOfBirth":" Rice Lake, Wisconsin, USA","bio":"Richard Lane was born on May 28, 1899 in Rice Lake, Wisconsin, USA. He was an actor, known for The Jackie Robinson Story (1950), Take Me Out to the Ball Game (1949) and 'Gung Ho!': The Story of Carlson's Makin Island Raiders (1943). He died on September 5, 1982 in Newport Beach, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODljZGNkMGUtNWNjYy00ZGMxLTkyYzQtZDNlODAzMGY5YWVlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0485518","name":"Richard Lane","idIMDB":"nm0485518"},"actorId":"nm0485518","character":"Commissioner Gordon","urlCharacter":"http://www.imdb.com/character/ch0000248","main":true},{"actorName":"Leon Ames","urlProfile":"http://www.imdb.com/name/nm0000748","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY5NDg5NjY4Ml5BMl5BanBnXkFtZTgwMTg1NzQ2MDE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 January 1902","placeOfBirth":" Portland, Indiana, USA","birthName":"Harry Leon Wycoff","height":"5' 8\" (1.73 m)","bio":"Leon Ames was born Harry Wycoff in Portland, Indiana, to Cora Alice (DeMoss) and Charles Elmer Wycoff. He had always wanted to be an actor and he did it the hard way, serving a long apprenticeship in touring amateur theatre companies, even selling shoes for a while on 42nd Street in the 1920's. It took him until 1933 to make his debut on Broadway. His play at the Morosco Theatre, \"It Pays to Sin\", lasted for only three performances after receiving disastrous critical reviews. By then, he had already appeared in his first movie, the sombre, expressionistic Murders in the Rue Morgue (1932), an Edgar Allan Poe adaptation, in which Leon played the dependable love interest of heroine Sidney Fox. For the next three years, he appeared under his birth name, Leon Waycoff, in a variety Of B-movies for \"poverty row\" studios like Mayfair, Showmen's Pictures, World-Wide Pictures, Empire and Majestic. His first film, as Leon Ames, was the Shirley Temple vehicle, Stowaway (1932). For the next few years, he served yet another apprenticeship, playing a variety of stalwart characters and the occasional bad guy in such cheerful potboilers as the anemic Murder in Greenwich Village (1937), the amusing Mysterious Mr. Moto (1938) and the eminently forgettable Secrets of a Nurse (1938). There were occasional highlights: he appeared in Ernst Lubitsch's last film at Paramount, Bluebeard's Eighth Wife (1938), with Gary Cooper and Myrna Loy, and even starred as the leading man of Cipher Bureau (1938) and Panama Patrol (1939), albeit at Grand National. Leon's career improved dramatically after playing Judy Garland's father Alonzo (along with Mary Astor as the matriarch of the family) in MGM's classic, Meet Me in St. Louis (1944), directed by Vincente Minnelli. For the first time, Leon's acting abilities were used to perfection, particularly his ability to deliver dryly humorous one-liners. Signed to a contract at MGM, Leon was now cast in important character roles in more important pictures, usually as put-upon, loving fathers: A Date with Judy (1948), Little Women (1949), (where he again teamed up with Mary Astor), By the Light of the Silvery Moon (1953), to name but a few. For something completely different, he also played district attorney \"Kyle Sackett\" in the film noir, The Postman Always Rings Twice (1946) and, against type, portrayed Paul Newman's thoroughly unpleasant father in From the Terrace (1960). Leon continued in films well until his later years and was last seen as Kathleen Turner's grandfather in Peggy Sue Got Married (1986). On television, he had a popular run starring in Life with Father (1953) and Father of the Bride (1961) (played by Spencer Tracy on the big screen) and playing Wilbur Post's neighbor, \"Gordon Kirkwood\", in Mister Ed (1958). Leon's other claim to fame was being one of 19 actors, who, after a clandestine meeting in June 1933, established the Screen Actor's Guild. For thirty years, from 1945, he held a senior executive position as recording secretary and served as national president of the organization between 1957 and 1979. He held a further position on the board of governors of the Academy of Motion Picture Arts and Sciences. The dapper actor and avid unionist died at a Laguna Beach, California, nursing home at the ripe old age of 91 on October 12 1993.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY5NDg5NjY4Ml5BMl5BanBnXkFtZTgwMTg1NzQ2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000748","name":"Leon Ames","idIMDB":"nm0000748"},"actorId":"nm0000748","character":"Commissioner Madero","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Douglass Dumbrille","urlProfile":"http://www.imdb.com/name/nm0241523","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5Mjg2NTIwOV5BMl5BanBnXkFtZTcwNjk0MDQxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1889","placeOfBirth":" Hamilton, Ontario, Canada","birthName":"Douglass Rupert Dumbrille","height":"6' 1½\" (1.87 m)","bio":"Distinguished character villain Douglass (R.) Dumbrille, whose distinctive stern features, beady eyes, tidy mustache, prominent hook nose and suave, cultivated presence graced scores of talking films, was born on October 13, 1889, in Hamilton, Ontario, Canada. He was first employed as a bank clerk in his home town but caught the acting bug and subsequently left his position to pursue work in various stock companies in the States. After appearing in a production of \"Rain\" in 1923, Dumbrille made his Broadway debut in 1924 as Banquo in \"Macbeth\" at the 48th Street Theatre. Throughout the 1920s and early 1930s he was a moderate fixture on the Great White Way, appearing in dramas (\"The Call of Life\" (1925) with Eva Le Gallienne, \"Chinese O'Neill\" (1929), \"As You Desire Me\" (1931)), romantic comedies (\"Joseph\" (1930), \"Child of Manhattan\" (1932)) and musical operettas (\"Princess Flavia\" (1925), \"Princess Charming\" (1930)). He also appeared in Florenz Ziegfeld Jr.'s 1928 musical production of \"The Three Musketeers\", portraying Athos alongside Dennis King's D'Artagnan, with Rudolf Friml providing the music. A decade later he portrayed Athos once again, this time in a film version (The Three Musketeers (1939)). On the silent screen he portrayed Thomas Jefferson in the short historical film The Declaration of Independence (1924), but did not return to film until 1931, when he began unleashing a number of sneering, oily villains on the viewing public. His first film job was to harass sea captain Gary Cooper in His Woman (1931). From there he proved a slick nemesis to a number of stars, both male and female: Marion Davies with his leering moneybags in Blondie of the Follies (1932); Pat O'Brien with his cruel-minded chain gang warden in Laughter in Hell (1933); Barbara Stanwyck as her unctuous love patsy in Baby Face (1933); James Cagney as gangster Spade Maddock in Lady Killer (1933); Warner Baxter and Myrna Loy as a mobster involved in horse race fixing in Broadway Bill (1934) and, most notoriously, Gary Cooper and Franchot Tone, both of whom he induces fingernail torture (\"We have ways of making men talk!\") as the sinister, turban-wearing rebel leader Mohammed Khan in The Lives of a Bengal Lancer (1935). Dumbrille was also a great pompous foil in comedy slapstick - harassing everybody from The Marx Brothers, Bud Abbott and Lou Costello to Bob Hope. He returned to the musical operetta fold as well on film and played a nuisance to Jeanette MacDonald in three of her films. Seen everywhere, both billed and unbilled, he played sheriffs who went bad in westerns, red-herring suspects or victims who deserved their fate in murder mysteries and corrupters of the legal system in political dramas. The man everybody loved to hate on film softened his image a bit with old age, playing a number of non-plussed executive or officious types in films and TV comedy. Finding a stream of TV work in the 1950s and early 1960s (including The George Burns and Gracie Allen Show (1950), The Untouchables (1959), Perry Mason (1957), Laramie (1959). Petticoat Junction (1963)), Dumbrille's final role was at age 76 as a doctor in a TV episode of Batman (1966) in 1966. His long-time first wife, Jessie Lawson, died in 1957, leaving him two sons, John and Douglas Murray. Dumbrille had more than a few Hollywood tongues wagging when, at age 70, he married Patricia Mowbray, the 28-year-old daughter of his good friend, character actor Alan Mowbray. The marriage was a lasting one, however, and she was among his survivors when he passed away several years later from a heart attack on April 2, 1974. Dumbrille was buried at Pierce Brothers Valhalla Memorial Park Cemetery in North Hollywood, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5Mjg2NTIwOV5BMl5BanBnXkFtZTcwNjk0MDQxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0241523","name":"Douglass Dumbrille","idIMDB":"nm0241523"},"actorId":"nm0241523","character":"La Costa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles D. Brown","urlProfile":"http://www.imdb.com/name/nm0113184","urlPhoto":"","biography":{"dateOfBirth":"1 July 1887","placeOfBirth":" Council Bluffs, Iowa, USA","height":"5' 9\" (1.75 m)","bio":"Charles D. Brown was born on July 1, 1887 in Council Bluffs, Iowa, USA. He was an actor and director, known for The Big Sleep (1946), The Grapes of Wrath (1940) and The Killers (1946). He was married to Nellie V. Tallman (actress). He died on November 25, 1948 in Hollywood, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0113184","name":"Charles D. Brown","idIMDB":"nm0113184"},"actorId":"nm0113184","character":"Col. Thomas Castle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Harvey","urlProfile":"http://www.imdb.com/name/nm0367670","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE3NThhNzAtNTU1NS00ODZlLWI4MjAtZDMyNzFjZWUxNWY0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1882","placeOfBirth":" Sandwich, Illinois, USA","birthName":"Roy Paul Harvey","height":"6' 2\" (1.88 m)","bio":"Paul Harvey was born on September 10, 1882 in Sandwich, Illinois, USA as Roy Paul Harvey. He was an actor, known for Spellbound (1945), Calamity Jane (1953) and Father's Little Dividend (1951). He was married to Ottye Henrietta Cramer (actress) and Merle Stanton. He died on December 15, 1955 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE3NThhNzAtNTU1NS00ODZlLWI4MjAtZDMyNzFjZWUxNWY0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0367670","name":"Paul Harvey","idIMDB":"nm0367670"},"actorId":"nm0367670","character":"Gov. John Bentley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Lowery","urlProfile":"http://www.imdb.com/name/nm0523225","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NjY5NDY1NF5BMl5BanBnXkFtZTgwNTU0ODgwMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 October 1913","placeOfBirth":" Kansas City, Missouri, USA","birthName":"Robert Larkin Hanks","height":"6' 1\" (1.85 m)","bio":"Robert Lowery was born Robert Larkin Hanks in Kansas City, Missouri, the only living child of Roscoe Hanks, noted Kansas City attorney and oil investor; and Leah Thompson, concert pianist and organist. He attended local Kansas City schools and graduated from Paseo High School in 1931 with a record as an accomplished athlete. He played with the old Kansas City Blues baseball team and was a boxer and football player. After a field injury in which he broke his pelvis, he built himself back to strength working at a paper factory in Kansas City. With the premature death of his father at 43, he and his mother moved to Los Angeles in hopes of his landing film and theater roles, given his good looks, athletic ability and outstanding physique. He enrolled in Lila Bliss' acting school and soon came to the attention of Twentieth Century-Fox after successfully appearing in a number of stage roles in the Los Angeles area. He was signed to Fox in 1938, and was soon appearing in such first-class films as Drums Along the Mohawk (1939). Although not known for his stage work, he appeared in several major theater productions, such as \"The Caine Mutiny\" and \"Born Yesterday\" (as \"Brock\") with his wife and fellow actress Jean Parker. He enjoyed a film and stage career that lasted well into the 1960s, at which time he started a second career with Jackie Coogan in a celebrity travel cruise business. One of his more notable film appearances was with Ray Danton in The Rise and Fall of Legs Diamond (1960) and he turned in a rare, but funny, performance as a political hack governor on the make for John Wayne's ex-wife in Wayne's western comedy McLintock! (1963). As he matured into middle age, he acquired a startling resemblance to Clark Gable. He also appeared extensively in television, including as Big Tim Champion in the 1956-57 Circus Boy (1956), also starring Noah Beery Jr. and Micky Dolenz (pre-Monkee days); Playhouse 90 (1956); episodes of Hazel (1961) and Pistols 'n' Petticoats (1966) starring Ann Sheridan, with Lowery playing Buss Courtney in the 1966-67 season. He and wife Jean had one son, Robert, who lives in Redondo Beach, California, with his wife Barbara and twin thirteen-year-old girls. Lowery passed away from a heart attack Christmas night of 1971, and is buried at Valhalla Memorial Park in North Hollywood, California. His motto: \"Whatever's fair.\" He took a less-than-serious view of life and his career, and was well-loved by his friends and family as a raconteur and humorist.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NjY5NDY1NF5BMl5BanBnXkFtZTgwNTU0ODgwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0523225","name":"Robert Lowery","idIMDB":"nm0523225"},"actorId":"nm0523225","character":"Lt. George Bentley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eddie Marr","urlProfile":"http://www.imdb.com/name/nm0549979","urlPhoto":"","biography":{"dateOfBirth":"14 February 1900","placeOfBirth":" Jersey City, New Jersey, USA","bio":"Eddie Marr was born on February 14, 1900 in Jersey City, New Jersey, USA. He was an actor, known for The Glass Key (1942), On Moonlight Bay (1951) and The Steel Trap (1952). He died on August 25, 1987 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0549979","name":"Eddie Marr","idIMDB":"nm0549979"},"actorId":"nm0549979","character":"Capt. Dahlen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harry Woods","urlProfile":"http://www.imdb.com/name/nm0940617","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjE1ODJhMjEtNDNiYi00NDE4LWJlN2ItOTg4NDJiYThiODNlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1889","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Harry Lewis Woods","height":"6' 2\" (1.88 m)","bio":"Harry Woods was born on May 5, 1889 in Cleveland, Ohio, USA as Harry Lewis Woods. He was an actor, known for Monkey Business (1931), Road to Rio (1947) and Days of Jesse James (1939). He was married to Helen Hookenberry. He died on December 28, 1968 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjE1ODJhMjEtNDNiYi00NDE4LWJlN2ItOTg4NDJiYThiODNlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0940617","name":"Harry Woods","idIMDB":"nm0940617"},"actorId":"nm0940617","character":"Grant","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0031677","urlIMDB":"http://www.imdb.com/title/tt0031677","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 4 min (64 min)","1 hr 10 min (70 min) (DVD) (USA)"],"soundMix":["Mono (RCA High Fidelity Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["1,899 m (7 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.0","filmingLocations":[{"location":"20th Century Fox Studios - 10201 Pico Blvd., Century City, Los Angeles, California, USA"}],"rated":"PASSED","awards":[],"votes":"503","type":"Movie","companyCreditsSimple":[{"idCompany":"co0000756","name":"Twentieth Century Fox Film Corporation"}],"keywords":{"keywords":["puerto rico","diamond","wrestler","telegram","smuggling","martial arts","contraband","man with glasses","murder mystery","part of series","cult film","violence","martial arts master","martial artist","suspense","showdown","disarming someone","judo throw","jujitsu","fistfight","brawl","tough guy","action hero","hero","father daughter relationship","swamp","suspect","red herring","racial stereotype","quicksand","judo","governor","freighter","electrocution","detective","detective series","conspiracy","black stereotype","asian stereotype","asian detective","appendicitis","seventh part","murder","jewel","sequel","based on book","based on novel","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:54:26"}}