{"data":{"movies":[{"title":"The Painted Veil","originalTitle":"","year":"1934","releaseDate":"19341123","directors":[{"name":"Richard Boleslawski","id":"nm0092915"}],"writers":[{"name":"John Meehan","id":"nm0576046"},{"name":"Salka Viertel","id":"nm0826554"}],"runtime":"85 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGFlNjUwZTEtYjAzNi00ZDUzLWE4OWYtZDQ3MWM3OTFjOWI3XkEyXkFqcGdeQXVyNjc0MzMzNjA@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Romance"],"plot":"In Austria, Katrin is lonely after her sister's marriage and she agrees to marry her father's research associate Dr. Walter Fane. Fane takes her to China but constantly ignors her in favour of his medical research. Lonely Katrin has an affair with Jack Townsend of the British Embassy. When it is discovered by Walter he becomes very bitter. Fane travels to fight a cholera epidemic and Katrin goes with him and helps. They grow closer together than ever before but Walter is knifed in a riot incited by the burning of a cholera infested town. Now their new found happiness will depend on Walter's survival.","simplePlot":"A wife neglected by her husband, a medical researcher in China, falls in love with a dashing diplomatic attaché.","actors":[{"actorName":"Greta Garbo","urlProfile":"http://www.imdb.com/name/nm0001256","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MDU3ODQ0MF5BMl5BanBnXkFtZTgwNzY4NDQ3MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1905","placeOfBirth":" Stockholm, Stockholms län, Sweden","birthName":"Greta Lovisa Gustafsson","height":"5' 7½\" (1.71 m)","bio":"Greta Garbo was born Greta Lovisa Gustafsson on September 18, 1905, in Stockholm, Sweden, to Anna Lovisa (Johansdotter), who worked at a jam factory, and Karl Alfred Gustafsson, a laborer. She was fourteen when her father died, which left the family destitute. Greta was forced to leave school and go to work in a department store. The store used her as a model in its newspaper ads. She had no film aspirations until she appeared in short advertising film at that same department store while she was still a teenager. Erik A. Petschler, a comedy director, saw the film and gave her a small part in his Luffar-Petter (1922). Encouraged by her own performance, she applied for and won a scholarship to a Swedish drama school. While there she appeared in at least one film, Le chevalier errant (1921). Both were small parts, but it was a start. Finally famed Swedish director Mauritz Stiller pulled her from the drama school for the lead role in The Saga of Gösta Berling (1924). At 18 Greta was on a roll. Following The Joyless Street (1925) both Greta and Stiller were offered contracts with MGM, and her first film for the studio was the American-made Torrent (1926), a silent film in which she didn't have to speak a word of English. After a few more films, including The Temptress (1926), Love (1927) and A Woman of Affairs (1928), Greta starred in Anna Christie (1930) (her first \"talkie\"), which not only gave her a powerful screen presence but also garnered her an Academy Award nomination as Best Actress (she didn't win). Later that year she filmed Romance (1930), which was somewhat of a letdown, but she bounced back in 1931, landing another lead role in Mata Hari (1931), which turned out to be a major hit. Greta continued to give intense performances in whatever was handed her. The next year she was cast in what turned out to be yet another hit, Grand Hotel (1932). However, it was in MGM's Anna Karenina (1935) that she gave what some consider the performance of her life. She was absolutely breathtaking in the role as a woman torn between two lovers and her son. Shortly afterwards, she starred in the historical drama Queen Christina (1933) playing the title character to great acclaim. She earned an Oscar nomination for her role in the romantic drama Camille (1936), again playing the title character. Her career suffered a setback the following year in Conquest (1937), which was a box office disaster. She later made a comeback when she starred in Ninotchka (1939), which showcased her comedic side. It wasn't until two years later she made what was to be her last film, Two-Faced Woman (1941), another comedy. But the film drew controversy and was condemned by the Catholic Church and other groups and was a box office failure, which left Garbo shaken. After World War II Greta, by her own admission, felt that the world had changed perhaps forever and she retired, never again to face the camera. She would work for the rest of her life to perpetuate the Garbo mystique. Her films, she felt, had their proper place in history and would gain in value. She abandoned Hollywood and moved to New York City. She would jet-set with some of the world's best-known personalities such as Aristotle Onassis and others. She spent time gardening and raising flowers and vegetables. In 1954 Greta was given a special Oscar for past unforgettable performances. She even penned her biography in 1990. On April 15, 1990, Greta died of natural causes in New York and with her went the \"Garbo Mystique\". She was 84.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MDU3ODQ0MF5BMl5BanBnXkFtZTgwNzY4NDQ3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001256","name":"Greta Garbo","nicknames":["The Face","The Swedish Sphinx","Garbo","La Divina"],"idIMDB":"nm0001256"},"actorId":"nm0001256","character":"Katrin","urlCharacter":"http://www.imdb.com/character/ch0390751","main":true},{"actorName":"Herbert Marshall","urlProfile":"http://www.imdb.com/name/nm0003339","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWFkNDkxYzktYWI4My00OGQ5LTgxZTAtODIyYjYzMjc3MjI0L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 May 1890","placeOfBirth":" London, England, UK","birthName":"Herbert Brough Falcon Marshall","height":"6' (1.83 m)","bio":"Herbert Marshall had trained to become a certified accountant, but his interest turned to the stage. He lost a leg while serving in World War I, he was rehabilitated with a wooden leg. This did not stop him from making good his decision to make the stage as his vocation. He used a very deliberate square-shouldered and guided walk - largely unnoticeable - to cover up his disability. He spent 20 years in distinguished stage work in London before films. He almost made the transition from stage directly to sound movies except for one silent film, Mumsie (1927), produced in Great Britain. His wonderful mellow, baritone British accent rolled out with a minimum of mouth movement and a nonchalant ease that stood out as unique. His rather blasé demeanor could take on various nuances - without overt emotion - to fit any role he played, whether sophisticated comedy or drama - and the accent fit just as well. He filled the range from romantic lead, with several sympathetic strangers thrown in, to dignified military officer to doctor to various degrees of villainy - his unemotional delivery meshing with the cold, impassive criminal character. He was almost 40 when he appeared in his first picture in Hollywood, The Letter (1929), a worthwhile comparison (but for the primitive sound recording) with the more famous second version (The Letter (1940)) with Bette Davis. Marshall is the murder victim in 1929 and the betrayed husband in 1940. He was heavily in demand in the 1930s, sometimes in five or six pictures a year. Perhaps his best suave comedic role was in Trouble in Paradise (1932), the first non-musical sound comedy by producer/director Ernst Lubitsch - to some, Lubitsch's greatest film. That same year, Marshall did one of his most warmly human, romantic roles in the marvelously erotic Blonde Venus (1932), with the captivating Marlene Dietrich. Through the 40s, his roles were of a more character variety but substantial. He was deviously subtle as the pre-World War II peace leader actually working against peace for a veiled foreign power (Germany) in Foreign Correspondent (1940). The film was one of Alfred Hitchcock 's earliest Hollywood films and, definitely, an under-rated adventure/thriller. Who could forget Marshall's small but standout performance as \"Scott Chavez\", who at the beginning of Duel in the Sun (1946) - with typical Marshall nonchalance - calmly shoots his cantina entertainer/Indian wife for her cheating ways? By the 50s, Marshall was doing fewer movies, but still a variety. His voice was perfect to lend credence to some early sci-fi classics like Riders to the Stars (1954) and Gog (1954) and the The Fly (1958). But he was also busy honing his considerable talent with various early-TV playhouse programs. He also fit comfortably into episodic TV including a rare five-episode run as a priest on 77 Sunset Strip (1958). All told, Herbert Marshall graced nearly 100 movie and TV roles with an aplomb that remains a rich legacy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWFkNDkxYzktYWI4My00OGQ5LTgxZTAtODIyYjYzMjc3MjI0L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003339","name":"Herbert Marshall","nicknames":["Bart"],"idIMDB":"nm0003339"},"actorId":"nm0003339","character":"Walter Fane","urlCharacter":"http://www.imdb.com/character/ch0017054","main":true},{"actorName":"George Brent","urlProfile":"http://www.imdb.com/name/nm0107575","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyNzc1Nzc0NjNeQTJeQWpwZ15BbWU4MDcxNjc4NDgx._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 March 1904","placeOfBirth":" Shannonbridge, Offaly, Ireland","birthName":"George Brendan Nolan","height":"6' 1\" (1.85 m)","bio":"The favorite leading man of star actress Bette Davis, was born George Brendan Nolan, near Dublin, and became an orphan at the tender age of eleven. For a while, he stayed with an aunt in New York, but returned to Ireland to study at the University of Dublin. After leaving university in 1919, George became a courier for Sinn Fein leader Michael Collins, hunted by the Black and Tan, with a price on his head. By that time, he had developed an interest in acting and joined the Abbey Theatre Players. In 1925, he returned to New York, touring with 'Abie's Irish Rose', then working with stock companies in Colorado, Florida and Massachusetts. He appeared in the ensemble cast of 'The Nightingale' on Broadway (1927), and, three years later, co-starred with Alice Brady and Clark Gable in the short-lived play 'Love, Honor and Betray'. He worked in Hollywood from 1930, initially cast as farmers, doctors and partner of Rin Tin Tin, before Warner Brothers recognised his potential as a strong leading man for some of their more temperamental female stars. One of those was Ruth Chatterton, who picked him to play opposite her in The Rich Are Always with Us (1932). This was the first of four films he made with the actress, whom he married - and divorced after two years. A specialist in dapper, sophisticated gentlemen, George gave reliable support to stars like Greta Garbo, Hedy Lamarr, Barbara Stanwyck and (eleven times) Bette Davis, though he could rarely be described as dynamic. His most memorable performances were opposite Davis in Front Page Woman (1935), Dark Victory (1939), The Old Maid (1939), and, co-starring Myrna Loy, The Rains Came (1939). When his looks dissipated and leading man roles became scarce, George gave arguably his best performance (against type) as the maniacal murderer in the Robert Siodmak-directed thriller The Spiral Staircase (1946). Following that, there were several B-movies on both sides of the Atlantic, after which he effectively retired to breed race horses.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyNzc1Nzc0NjNeQTJeQWpwZ15BbWU4MDcxNjc4NDgx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0107575","name":"George Brent","idIMDB":"nm0107575"},"actorId":"nm0107575","character":"Jack Townsend","urlCharacter":"http://www.imdb.com/character/ch0017056","main":true},{"actorName":"Warner Oland","urlProfile":"http://www.imdb.com/name/nm0645941","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDMyOTU0OF5BMl5BanBnXkFtZTYwMDM0NzU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1879","placeOfBirth":" Nyby, Västerbottens län, Sweden","birthName":"Johan Verner Öhlund","height":"5' 11\" (1.8 m)","bio":"Warner Oland was born Johan Verner Olund in the small village of Nyby in Bjurholm parish in the county of Vasterbotten, Sweden, on October 3, 1879. Bjurholm is situated about 60 kilometers outside the town of Umea. His family emigrated to the US on October 15, 1892. His father Jonas was a shopkeeper and his mother was Maria Johanna (nee Forsberg). After finishing grade school and working on Broadway during his 20s, Oland settled in California in the early 1910s, where he worked odd jobs. The movie industry was in its beginning stages in Hollywood, and Johan Olund--changing his name to the more Americanized \"Warner Oland\"--worked as a stage actor for a while before getting small parts in films in the 1910s and 1920s. As Hollywood made the transition from silent to sound pictures in the late 1920s (Oland co-starred in Warner Brothers' groundbreaking part-talkie The Jazz Singer (1927)), he began landing more prominent roles. His greatest success came in 1931 when he was cast in the role of Charlie Chan, a Honolulu-based Chinese-American police detective in Charlie Chan Carries On (1931), based on the popular detective mystery series by Earl Derr Biggers [1884-1933] which was produced by Fox Films. His performance as the seemingly mild-mannered but razor-sharp Asian detective won him critical acclaim, which resulted in his playing Chan again in the sequel, The Black Camel (1931). The success of the Chan character turned into a cash cow for Fox Studios and Oland became a valuable property. It seems incredible today, but in Fox's pre-Shirley Temple period, Oland was considered the only guaranteed profit maker on the lot. He became wealthy and bred miniature schnauzers. Although seemingly happy, Oland became increasingly dependent upon alcohol and exhibited bizarre delusional behavior after periods of drinking. Oland appeared in a total of 16 Charlie Chan feature films from 1931 to 1937. The Chan films were budgeted approaching 1930s A-picture levels (approximately $275,000) and were usually shot within tight 30-day schedules, three films per year (sadly, a number of these have apparently been lost). The series was pretty much the only guaranteed profit-maker the ailing studio could bank on during the days leading to its takeover by ex-Warner's production chief Darryl F. Zanuck in 1935, that resulted in its transformation from Fox Films into Twentieth Century-Fox. From 1931 to 1935 Oland did other films besides the Chan series, but he was increasingly relegated to roles that didn't vary much beyond mysterious Asians, and in mid-1935 he became so identified as Charlie Chan that he was assigned to the series exclusively. His last eight films were all Chan entries, usually co-starring Keye Luke, who played Chan's Number One Son. While considered somewhat stereotypical today, these films were met with wide critical acclaim and all were hugely profitable. The best of the series is generally considered to be Charlie Chan at the Opera (1936), featuring lavish set design and a particularly effective menacing villain in Boris Karloff. Oland's physical and mental problems slowly began to catch up to him, and in 1937 he was said to have suffered a nervous breakdown apparently due to some kind of mental dementia. The Fox executives, knowing that Oland was one of its biggest money earners, kept his alcoholism and mental problems hidden from the public. In November 1937, Edith, his wife of 30 years, filed for divorce. In January 1938 \"Charlie Chan at (the) Ringside\" began production at Fox's Western Avenue lot under the direction of James Tinling with an increasingly erratic Oland. After a few days shooting inside Studio 6, Oland walked out and never returned. He was heard complaining the studio was possessed by voodoo and feared contracting pneumonia. Over the next month there were numerous negotiations between Oland and SAG (Oland had been an early member) and production was briefly resumed, then suspended after Oland again failed to report to work. He was hospitalized and released, then decided to return to his mother's home in Sweden. Oland's film career, unbeknown to him, was over. In the interim, producer Sol M. Wurtzel, desperate to salvage the property, ordered the Chan picture reworked as Mr. Moto's Gamble (1938), with minor supporting cast changes. Successful negotiations were made with the Biggers' estate and the film was quickly shot with Peter Lorre and released April 7, 1938. The film itself remains an anachronism in the Moto series, as it contains much Chan-like dialog, tacked on Moto-esque action scenes and a guest-starring role by Keye Luke. Regardless, it was also a hit. During his visit to Sweden, Oland negotiated a reconciliation with Edith but contracted bronchial pneumonia and died there on August 6, 1938, at age 57. Ironically, Fox contract (and Chan series) director John G. Blystone died the same day. Numerous actors were tested to fill Oland's shoes as Charlie Chan, among them Cy Kendall, Walter Connolly, J. Edward Bromberg, Noah Beery Jr., Michael Visaroff and Leo Carillo (Kendall and Connelly had played Chan on radio). The series continued at Fox for another 11 entries with Sidney Toler, who was signed by Zanuck in mid-October 1938. Toler injected more humor into the character as scripts became somewhat more pedestrian. By 1942 Fox considered the series exhausted and it would ultimately be sold to low-budget studio Monogram Pictures and continue on even after Toler's death in 1947 with Roland Winters in the role through six dismal films into 1949. In a postscript, Fox director Norman Foster paid a subtle tribute to Oland in the next Moto film, Mr. Moto's Last Warning (1939). During that movie's production in August 1938, cast and crew learned of Oland's passing in his native Sweden. Over the title Charlie Chan in Honolulu (1938), on the bill of the Sultana Theatre of Variety, they placed the banner \"Last Day.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDMyOTU0OF5BMl5BanBnXkFtZTYwMDM0NzU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0645941","name":"Warner Oland","nicknames":["Jack"],"idIMDB":"nm0645941"},"actorId":"nm0645941","character":"General Yu","urlCharacter":"http://www.imdb.com/character/ch0197453","main":true},{"actorName":"Jean Hersholt","urlProfile":"http://www.imdb.com/name/nm0380965","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MDE3NjAxMl5BMl5BanBnXkFtZTcwMjExMDExOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 July 1886","placeOfBirth":" Copenhagen, Denmark","birthName":"Jean Buron Hersholt","height":"5' 11\" (1.8 m)","bio":"If ever there was a Great Dane in Hollywood it was Jean Hersholt - and one of its great hearts as well. He was from a well-known Danish stage and entertainment family that had toured throughout Europe performing with young Jean as an essential cast member. He graduated from the Copenhagen Art School and continued expanding his stage experience and evidently decided early that he wanted to work in films. He did just two very early (1906) silent films in Germany. Hersholt emigrated from Denmark to the US while still a young man in 1913. Like many another European he came to America to seek further opportunities. Unlike many other European actors who appeared on Broadway in their early American careers, Hersholt never trod The Great White Way. He moved on to Hollywood in 1914 where the future of silent movies had taken the lead. He started as a movie extra then progressed into small feature player roles from 1915 through 1917. For that latter year he had no less than 17 bit parts. By the 1920s his roles were substantial feature pieces, but most of these were as villains - in fact, a concoction of really vile characters. His theater experience serving him well, he played them so well that he much sought after by directors. Several of his 1920s films were landmarks of the silent era, an early one being The Four Horsemen of the Apocalypse (1921) which helped propel Rudolf Valentino into the stellar heights. Hersholt became popular and well paid. And certainly his signature silent role was the lead character of Marcus Schouler in the Erich von Stroheim great film Greed (1924), based on the novel McTeague. Stroheim, who spent far more time in front of the camera as an actor, was already well know as a task master and perfectionist director. He went through 42 reels of film for the picture - a numbing nine hours of screen time (shown only once at that length in a private studio screening). He cut the film to five hours, but it was further whittled to a bit over two for release, causing Stroheim to quip bitterly of the editor, \"The only thing he had on his mind was his hat!\" The powerful film was still there, but the massive editing resulted in whole roles disappearing, not to mention some telltale continuity. Stroheim's need for realism resulted in the climax of the movie to be shot in Death Valley. Still hot in the fall time, Hersholt endured like a veteran but required a hospital stay after sweating away 27 pounds. Fortunately into the later 1920s Hersholt's roles expanded into a more realistic balance of characters-more virtuous roles - but still some shady fellows and especially the unsuspected, and thus surprising, guilty party in the ever popular murder mysteries. He worked for Samuel Goldwyn for about a year (1923-1924), for Paramount from 1927 through 1929, and several other studios during the period. By the end of the silent era, including those early primitive part mono features with small bits of audio music, sound effects, or dialog, Hersholt was a tried veteran of 75 films. His first all mono sound film was The Climax (1930) and despite a Germanic accent, he had a pleasant, mellow voice and a camera friendly presence that ensured him continued success. The variety ran the gamut from a sturdy supporting part in Grand Hotel (1932), to supporting Boris Karloff and a pretty hot Myrna Loy in The Mask of Fu Manchu (1932), and doing the same in Dinner at Eight (1933). Busy with nine movies in 1930, he also moved into people's living rooms on radio as well during that year. Of course, for some time Hersholt was a mature actor-simply meaning he had many secondary roles as doctors and professors and nobles of many sorts and increasingly he appeared as benign fatherly types. Father roles of the 20s continued into the 30s - augmented with grandfather roles as well. He was the father of Sonja Henie in that charismatic champion ice skater's first Hollywood film One in a Million (1936), and he is perhaps best remembered as the embittered but deeply caring grandfather of Shirley Temple in the beloved Heidi (1937). But it was another role as a doctor that would provide a continuing vehicle for Hersholt and something of a fateful direction for the actor. The mid-30s were abuzz with the births of the Dionne Quintuplets in Canada. Hollywood jumped on it with usual alacrity, highlighting the story and the officiating obstetrician, Dr. Dafoe, who was translated into Dr. John Luke, in The Country Doctor (1936). Hersholt brought the right ingredients to the part of Luke and two years later a sequel followed, Five of a Kind (1938). Hersholt thought the character good medicine all round and was enthusiastic about a series of movies, but Dafoe himself blocked this idea. Nevertheless, in 1937 Hersholt had already germinated a new radio series to continue portraying a dedicated and kindly small town doctor. For a character name Hersholt turned to his most beloved author, his countryman, literary light Hans Christian Andersen, for a name-Dr. Christian. It was a hit and, and he convinced RKO Radio Pictures to bankroll a series of six Dr. Christian films (1939-41). These latter and a few other films would mark the end of Hersholt's film career, but he was so very busy otherwise. His familiarity with Andersen was a scholarly avocation and labor of love, furthered by enthusiastic collecting of a library of important Andersen editions and related bibliography (which would later go to the Library of Congress). His English translation (see Trivia below) of the Andersen corpus of fairy tales (including his addition of several other Andersen stories from the author's private papers) remains perhaps the most comprehensive and best effort-even more so for Hersholt personal interpretation of Andersen. Hersholt would also write several articles about Andersen and edit The Andersen-Scudder-Letters (1948). Among other literary pursuits Hersholt also co-wrote a novel based on his Dr. Christian character. It was in Hersholt's generous nature to give back something in gratitude for the acting career afforded him in Hollywood. His payment was rich indeed: the Motion Picture Relief Fund, the retirement home and hospital inspired by it and generated from it (see Trivia below), and the great charitable work that Hersholt would perform were paid back with two Academy Awards, the second after his tenure as president of the Academy. These special honors would be the seed of the Jean Hersholt Humanitarian Award (see Trivia below). But in 1956 Hersholt was dying of cancer - and yet that would not stop him from one more good turn. His beloved Dr. Christian character was going to TV (produced by the Ziv Studios), and he was asked to symbolically pass the baton to the new Dr. Christian, Macdonald Carey. With a tremendous effort, Hersholt, now withered to 95 pounds braved the first episode shooting, capping his life with one last magnificent example of his humanity.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MDE3NjAxMl5BMl5BanBnXkFtZTcwMjExMDExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0380965","name":"Jean Hersholt","idIMDB":"nm0380965"},"actorId":"nm0380965","character":"Herr Koerber","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bodil Rosing","urlProfile":"http://www.imdb.com/name/nm0743017","urlPhoto":"","biography":{"dateOfBirth":"27 December 1877","placeOfBirth":" Copenhagen, Denmark","birthName":"Bodil Hammerich","bio":"Bodil Rosing was born on December 27, 1877 in Copenhagen, Denmark as Bodil Hammerich. She was an actress, known for Sunrise (1927), You Can't Take It with You (1938) and Roberta (1935). She was married to Einer Jansen. She died on December 31, 1941 in Hollywood, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0743017","name":"Bodil Rosing","idIMDB":"nm0743017"},"actorId":"nm0743017","character":"Frau Koerber","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Katharine Alexander","urlProfile":"http://www.imdb.com/name/nm0018540","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg3Njk5MDktYmQ1Ni00MDgwLWE3ZDAtNWRlZGQwN2Y0NTUwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 September 1898","placeOfBirth":" Fort Smith, Arkansas, USA","bio":"Katherine (also called Katharine) Alexander, an excellent character actress, had been born in 1897 to a mother who was part Cherokee and to a father who farmed land on Indian territory. And yet she was never given the part of a native American in the course of her thirty-five-year acting career. Often a society lady, at times a suffering wife or a dignified mother, she was nearly always all-American. At ease in the register of drama and tragedy as well as in that of comedy, Katherine Alexander was a talented and versatile performer who alternated theater and cinema throughout a highly respectable career. An artist she was bound to be but rather a concert one than a thespian. Her mother, a frustrated musician herself, had indeed seen to it that she receive a formal musical education and young Katherine proved gifted at the violin. And she was indeed giving a violin recital when producer Samuel Goldwyn, who needed an actress who could play the violin for a play he was producing, noticed the young lady and hired her for the role. Miss Alexander, who had not yet turned twenty, realized that she much preferred acting to music playing and that was the beginning of a fruitful career on stage first and alternately on the boards and on the big screen as soon as the cinema started talking. A leading lady on Broadway (where she delivered the lines of such distinguished playwrights as Arthur Schnitzler, Robert E. Sherwood or Philip Barry),she was soon seen as an indispensable supporting actress in Hollywood movies. She was always reliable and competent and did not pale by the side of great stars like Greta Garbo (the wife of Garbo's lover in The Painted Veil (1934)), Bette Davis (the wife of a lawyer in love with Davis in That Certain Woman (1937) ; Miss Trask in Now, Voyager (1942)), Cary Grant (Mrs. Morton in In Name Only (1939)) or John Barrymore (Miss Billow in The Great Man Votes (1939). Katherine Alexander's shining hour came in 1949, two years before she retired, when she embodied Linda Loman, the no-nonsense wife of pathetic salesman Paul Muni in the London production of Arthur Miller's \"Death of a Salesman\". After such a triumph, she decided to give up her career and for thirty years on, she enjoyed a happy second life until her death in early 1981.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg3Njk5MDktYmQ1Ni00MDgwLWE3ZDAtNWRlZGQwN2Y0NTUwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0018540","name":"Katharine Alexander","idIMDB":"nm0018540"},"actorId":"nm0018540","character":"Mrs. Townsend","urlCharacter":"http://www.imdb.com/character/ch0197457","main":true},{"actorName":"Cecilia Parker","urlProfile":"http://www.imdb.com/name/nm0662118","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDc4MDE3MzAtMTc3MC00NTRkLThmNmMtNTQyOTE3MDAyMGY0XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1914","placeOfBirth":" Fort William, Ontario, Canada","height":"5' 3½\" (1.61 m)","bio":"Canadian-born Cecilia Parker, daughter of a British army officer, moved with her family to Hollywood when she was a child. After graduation from high school she got a job as an extra. She did extra work for about a year before she was noticed by Fox executives, who signed her to a contract in 1931. Her career went along steadily if not spectacularly until 1937, when she was signed by MGM to play the older sister of Mickey Rooney in the \"Andy Hardy\" series. Although she had worked in everything from westerns to jungle serials, it's this part that people remember her for. She must have given MGM some trouble at one point, because in 1941 she was \"loaned\" (exiled is probably a better word) to ultra-low-rent studio PRC for one picture, a fate that usually befell actors who displeased the higher-ups at the studios. All was apparently forgiven, though, as she made five more pictures at MGM before she retired in 1942. She returned in 1958 for one final Andy Hardy film, but then went back to the real estate business she and her husband operated in Ventura, California, where she died in 1993.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDc4MDE3MzAtMTc3MC00NTRkLThmNmMtNTQyOTE3MDAyMGY0XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0662118","name":"Cecilia Parker","idIMDB":"nm0662118"},"actorId":"nm0662118","character":"Olga","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Soo Yong","urlProfile":"http://www.imdb.com/name/nm0948540","urlPhoto":"","biography":{"dateOfBirth":"31 October 1903","placeOfBirth":" Maui, Hawaii, USA","bio":"Soo Yong was born on October 31, 1903 in Maui, Hawaii, USA. She was an actress, known for Sayonara (1957), Love Is a Many-Splendored Thing (1955) and The Good Earth (1937). She was married to C.K. Huang. She died in October 1984 in Honolulu, Hawaii.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0948540","name":"Soo Yong","idIMDB":"nm0948540"},"actorId":"nm0948540","character":"Amah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Forrester Harvey","urlProfile":"http://www.imdb.com/name/nm0367516","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODVmZWZkNTgtMWVmZS00NTE2LWE5MGQtOTNjOWZhOGY0YzYyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 June 1884","placeOfBirth":" Cork, Ireland","bio":"Forrester Harvey was born on June 27, 1884 in Cork, Ireland. He was an actor, known for Rebecca (1940), The Invisible Man (1933) and The Wolf Man (1941). He died on December 14, 1945 in Laguna Beach, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODVmZWZkNTgtMWVmZS00NTE2LWE5MGQtOTNjOWZhOGY0YzYyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0367516","name":"Forrester Harvey","idIMDB":"nm0367516"},"actorId":"nm0367516","character":"Waddington","urlCharacter":"http://www.imdb.com/character/ch0017057","main":true},{"actorName":"Robert Adair","urlProfile":"http://www.imdb.com/name/nm0010468","urlPhoto":"","biography":{"dateOfBirth":"3 January 1900","placeOfBirth":" San Francisco, California, USA","height":"6' 1\" (1.85 m)","bio":"Robert Adair was born on January 3, 1900 in San Francisco, California, USA. He was an actor, known for The Face at the Window (1939), The Prince and the Pauper (1937) and The Captain's Paradise (1953). He died on August 10, 1954 in London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0010468","name":"Robert Adair","idIMDB":"nm0010468"},"actorId":"nm0010468","character":"Polo Player","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mariska Aldrich","urlProfile":"http://www.imdb.com/name/nm0017689","urlPhoto":"","biography":{"dateOfBirth":"27 March 1881","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Mariska Horvath","bio":"Mariska Aldrich was born on March 27, 1881 in Boston, Massachusetts, USA as Mariska Horvath. She was an actress, known for Lady by Choice (1934), Whistling in the Dark (1941) and Bar Buckaroos (1940). She was married to James Francis Aldrich. She died on September 28, 1965 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0017689","name":"Mariska Aldrich","idIMDB":"nm0017689"},"actorId":"nm0017689","character":"German Teacher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maidena Armstrong","urlProfile":"http://www.imdb.com/name/nm0035810","urlPhoto":"","biography":{"dateOfBirth":"27 February 1883","placeOfBirth":" Mt. Pleasant, Iowa, USA","bio":"Maidena Armstrong was born on February 27, 1883 in Mt. Pleasant, Iowa, USA. She was an actress, known for Tired Feet (1933), Movie Daze (1934) and Back to the Soil (1934). She died on November 25, 1935 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0035810","name":"Maidena Armstrong","idIMDB":"nm0035810"},"actorId":"nm0035810","character":"German","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Billy Bevan","urlProfile":"http://www.imdb.com/name/nm0079645","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NzM4NzIyOV5BMl5BanBnXkFtZTcwOTcwMDYzOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1887","placeOfBirth":" Orange, New South Wales, Australia","birthName":"William Bevan Harris","height":"5' 5½\" (1.66 m)","bio":"Billy Bevan's show-business career began in his native Australia, with the Pollard theatrical organization. The company had two theater troupes, one which toured Asia and the other traveling to North America. Bevan wound up in the latter, performing in skits and plays all over Canada and Alaska then down into the continental US. While in a road company of the play \"A Knight for a Day\", Bevan was noticed by comedy pioneer Mack Sennett, who hired him on the spot. Bevan made many one- and two-reel shorts for Sennett over a ten-year period, and then transitioned into a reliable comic actor in many Hollywood comedies over the next 20 years or so (even doing voice-overs for cartoons). He made his last film in 1950, then retired. He died in Escondido, CA, in 1957.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NzM4NzIyOV5BMl5BanBnXkFtZTcwOTcwMDYzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0079645","name":"Billy Bevan","idIMDB":"nm0079645"},"actorId":"nm0079645","character":"Bridegroom","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Beulah Bondi","urlProfile":"http://www.imdb.com/name/nm0094135","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyODAzNTIyOF5BMl5BanBnXkFtZTcwMzEwNjk5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 May 1889","placeOfBirth":" Chicago, Illinois, USA","birthName":"Beulah Bondy","height":"5' 5\" (1.65 m)","bio":"Character actress Beulah Bondi was a favorite of directors and audiences and is one of the reasons so many films from the 1930s and 1940s remain so enjoyable, as she was an integral part of many of the ensemble casts (a hallmark of the studio system) of major and/or great films, including The Trail of the Lonesome Pine (1936), Mr. Smith Goes to Washington (1939), Our Town (1940) and Penny Serenade (1941). Highly respected as a first-tier character actress, Bondi won two Best Supporting Actress Oscar nominations, for The Gorgeous Hussy (1936) and Of Human Hearts (1938), and an Emmy Award in 1976 for her turn in the television program The Waltons (1971). She was born Beulah Bondy on May 3, 1888, in Chicago, and established herself as a stage actress in the first phase of her career. She made her Broadway debut in Kenneth S. Webb's \"One of the Family\" at the 49th Street Theatre on December 21, 1925. The show was a modest hit, racking up 238 performances. She next appeared in another hit, Maxwell Anderson's \"Saturday's Children,\" which ran for 326 performances, before appearing in her first flop, Clemence Dane's \"Mariners\" in 1927. Philip Barry's and Elmer Rice's \"Cock Robin\" was an extremely modest hit in 1928, reaching the century mark (100 performances), but it was Bondi's performance in Rice's \"Street Scene,\" which opened at the Playhouse Theatre on Jamuary 10, 1929, that made her career. This famous play won Rice the 1929 Pulitzer Prize for Drama and was a big hit, playing for 601 performances. Most importantly, though, it brought Bondi to the movies at the advanced age of 43. She made her motion picture debut in 1931 in the movie adaptation (Street Scene (1931)), recreating the role she had originated on the Broadway stage. The talkies were still new, and she had the talent and the voice to thrive in Hollywood. Bondi appeared in four more Broadway plays from 1931 to 1934, only one of which, \"The Late Christopher Bean\", a comedy by Sidney Howard, was a hit. Her last appearance on Broadway for a generation was in a flop staged by Melvyn Douglas, \"Mother Lode\" (she made two more appearances on the Great White Way, in \"Hilda Crane\" (1950) and \"On Borrowed Time\" in 1953; neither was a success). For the rest of her professional life, her career lay primarily in film and television. She was typecast as mothers and, later, grandmothers, and played James Stewart's mother four times, most famously as \"Ma Bailey\" in It's a Wonderful Life (1946). Her greatest role is considered her turn in Leo McCarey's Depression-era melodrama Make Way for Tomorrow (1937), in which she played a mother abandoned by her children. Beulah Bondi died on January 1, 1981, from complications from an accident, when she broke her ribs after falling over her cat. She was 92 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyODAzNTIyOF5BMl5BanBnXkFtZTcwMzEwNjk5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0094135","name":"Beulah Bondi","idIMDB":"nm0094135"},"actorId":"nm0094135","character":"Frau Koerber","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0025617","urlIMDB":"http://www.imdb.com/title/tt0025617","business":{"budget":{"money":"$947,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$1,120,000 (Worldwide)","country":"except","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1934/\">1934</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 25 min (85 min)"],"soundMix":["Mono (Western Electric Sound System)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["(9 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.6","filmingLocations":[{"location":"China"}],"rated":"PASSED","awards":[],"votes":"966","type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"}],"keywords":{"keywords":["china","cholera","researcher","epidemic","sister","austria","riot","house on fire","nun","orphan","local commisioner","convent","medical doctor","reference to h.g. wells","theatrical","austrian","fortune teller","78rpm record","gramophone","bungalow","inoculation","confuciusism","gong","mosquito netting","holiday","mastiff","traveling shot","stabbed in the chest","buddha","beggar","umbrella","hot water bottle","diplomatic attache","romantic triangle","dog","chinese","soldier","wedding","festival","buddhism","horse","divorce","diplomat","marriage proposal","dancer","fire","knife wound","orphanage","temple","hong kong","infidelity","confucius","father daughter relationship","bacteriologist","romantic rivalry","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:34:52"}}