{"data":{"movies":[{"title":"The Floorwalker","originalTitle":"","year":"1916","releaseDate":"19160515","directors":[{"name":"Charles Chaplin","id":"nm0000122"}],"writers":[{"name":"Charles Chaplin","id":"nm0000122"},{"name":"Vincent Bryan","id":"nm0117018"}],"runtime":"29 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MjAzNzExMF5BMl5BanBnXkFtZTgwNzQ2MzAwMzE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Short","Comedy"],"plot":"After causing havoc on the sales floor Charlie goes to the office floor. There he runs into the store inspector (who looks exactly like him) who has just robbed the safe and knocked out the manager. Charlie thinks he is in front of a mirror till he notices he holds a stock and his \"image\" the bag of loot.","simplePlot":"The Tramp is tricked into impersonating an embezzling floorwalker in a department store.","actors":[{"actorName":"Charles Chaplin","urlProfile":"http://www.imdb.com/name/nm0000122","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDcwMDc0ODAzOF5BMl5BanBnXkFtZTgwNTY2OTI1MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 April 1889","placeOfBirth":" Walworth, London, England, UK","birthName":"Charles Spencer Chaplin","height":"5' 5\" (1.65 m)","bio":"Considered to be one of the most pivotal stars of the early days of Hollywood, Charlie Chaplin lived an interesting life both in his films and behind the camera. He is most recognized as an icon of the silent film era, often associated with his popular character, the Little Tramp; the man with the toothbrush mustache, bowler hat, bamboo cane, and a funny walk. Charles Spencer Chaplin was born in Walworth, London, England on April 16, 1889, to Hannah Harriet Pedlingham (Hill) and Charles Chaplin, both music hall performers, who were married on June 22, 1885. After Charles Sr. separated from Hannah to perform in New York City, Hannah then tried to resurrect her stage career. Unfortunately, her singing voice had a tendency to break at unexpected moments. When this happened, the stage manager spotted young Charlie standing in the wings and led him on stage, where five-year-old Charlie began to sing a popular tune. Charlie and his half-brother, Syd Chaplin spent their lives in and out of charity homes and workhouses between their mother's bouts of insanity. Hannah was committed to Cane Hill Asylum in May 1903 and lived there until 1921, when Chaplin moved her to California. Chaplin began his official acting career at the age of eight, touring with the Eight Lancashire Lads. At age 18, he began touring with Fred Karno's vaudeville troupe, joining them on the troupe's 1910 United States tour. He traveled west to California in December 1913 and signed on with Keystone Studios' popular comedy director Mack Sennett, who had seen Chaplin perform on stage in New York. Charlie soon wrote his brother Syd, asking him to become his manager. While at Keystone, Chaplin appeared in and directed 35 films, starring as the Little Tramp in nearly all. In November 1914, he left Keystone and signed on at Essanay, where he made 15 films. In 1916, he signed on at Mutual and made 12 films. In June 1917, Chaplin signed up with First National Studios, after which he built Chaplin Studios. In 1919, he and Douglas Fairbanks, Mary Pickford and D.W. Griffith formed United Artists (UA). Chaplin's life and career was full of scandal and controversy. His first big scandal was during World War I, during which time his loyalty to England, his home country, was questioned. He had never applied for American citizenship, but claimed that he was a \"paying visitor\" to the United States. Many British citizens called Chaplin a coward and a slacker. This and his other career eccentricities sparked suspicion with FBI chief J. Edgar Hoover and the House Un-American Activities Committee (HUAC), who believed that he was injecting Communist propaganda into his films. Chaplin's later film The Great Dictator (1940), which was his first \"talkie\", also created a stir. In the film, Chaplin plays a humorous caricature of Adolf Hitler. Some thought the film was poorly done and in bad taste. However, the film grossed over $5 million and earned five Academy Award Nominations. Another scandal occurred when Chaplin briefly dated 22-year-old Joan Barry. However, Chaplin's relationship with Barry came to an end in 1942, after a series of harassing actions from her. In May 1943, Barry returned to inform Chaplin that she was pregnant and filed a paternity suit, claiming that the unborn child was his. During the 1944 trial, blood tests proved that Chaplin was not the father, but at the time, blood tests were inadmissible evidence and he was ordered to pay $75 a week until the child turned 21. Chaplin was also scrutinized for his support in aiding the Russian struggle against the invading Nazis during World War II, and the United States government questioned his moral and political views, suspecting him of having Communist ties. For this reason, HUAC subpoenaed him in 1947. However, HUAC finally decided that it was no longer necessary for him to appear for testimony. Conversely, when Chaplin and his family traveled to London for the premier of Limelight (1952), he was denied re-entry to the United States. In reality, the government had almost no evidence to prove that he was a threat to national security. Instead, he and his wife decided to settle in Switzerland. Chaplin was married four times and had a total of 11 children. In 1918, he married Mildred Harris and they had a son together, Norman Spencer Chaplin, who only lived three days. Chaplin and Mildred were divorced in 1920. He married Lita Grey in 1924, who had two sons, Charles Chaplin Jr. and Sydney Chaplin. They were divorced in 1927. In 1936, Chaplin married Paulette Goddard and his final marriage was to Oona O'Neill (Oona Chaplin), daughter of playwright Eugene O'Neill in 1943. Oona gave birth to eight children: Geraldine Chaplin, Michael Chaplin, Josephine Chaplin, Victoria Chaplin, Eugene Chaplin, Jane Chaplin, Annette-Emilie Chaplin and Christopher Chaplin. In contrast to many of his boisterous characters, Chaplin was a quiet man who kept to himself a great deal. He also had an \"un-millionaire\" way of living. Even after he had accumulated millions, he continued to live in shabby accommodations. In 1921, Chaplin was decorated by the French government for his outstanding work as a filmmaker, and was elevated to the rank of Officer of the Legion of Honor in 1952. In 1972, he was honored with an Academy Award for his \"incalculable effect in making motion pictures the art form of the century.\" He was appointed Knight Commander of the Order of the British Empire in the 1975 New Years Honours List. No formal reason for the honour was listed. The citation simply reads \"Charles Spencer Chaplin, Film Actor and Producer\". Chaplin's other works included musical scores he composed for many of his films. He also authored two autobiographical books, \"My Autobiography\" (1964) and its companion volume, \"My Life in Pictures\" (1974). Chaplin died at age 88 of natural causes on December 25, 1977 at his home in Vevey, Switzerland. His funeral was a small and private Anglican ceremony according to his wishes. In 1978, Chaplin's corpse was stolen from its grave and was not recovered for three months; he was re-buried in a vault surrounded by cement. Six of Chaplin's films have been selected for preservation in the National Film Registry by the United States Library of Congress: The Immigrant (1917), The Kid (1921), The Gold Rush (1925), City Lights (1931), Modern Times (1936) and The Great Dictator (1940). Charlie Chaplin was considered one of the greatest filmmakers in the history of American cinema, whose movies were and still are popular throughout the world, and have even gained notoriety as time progresses. His films show, through the Little Tramp's positive outlook on life in a world full of chaos, that the human spirit has and always will remain the same.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDcwMDc0ODAzOF5BMl5BanBnXkFtZTgwNTY2OTI1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000122","name":"Charles Chaplin","nicknames":["Charlie","Charlot","The Little Tramp"],"idIMDB":"nm0000122"},"actorId":"nm0000122","character":"Impecuneous Customer","urlCharacter":"http://www.imdb.com/character/ch0537403","main":true},{"actorName":"Eric Campbell","urlProfile":"http://www.imdb.com/name/nm0132444","urlPhoto":"","biography":{"dateOfBirth":"26 April 1880","placeOfBirth":" Sale, Cheshire, UK","birthName":"Alfred Eric Campbell","height":"6' 5\" (1.96 m)","bio":"Campbell was born in Sale, Cheshire on 26th April 1880 and began acting as a boy. He married fellow music hall performer Fanny Gertrude Robotham on March 30, 1901 and was later hired by English music hall impresario Fred Karno for his \"Fun Factory\" comedy troupes that featured other comics like a young Charlie Chaplin and Stan Laurel. Campbell arrived in New York with a Karno troupe in July, 1914 and was soon hired by Broadway producer Charles Frohman. In late 1915 fellow Karno alum Chaplin and his brother Sid found Eric working in a George M. Cohan play \"Pom Pom\" and in March, 1916, brought him to Hollywood. Built like a wrestler, over 6' tall and over 250 pounds, topped by small shaved head. Chaplin smeared his face with exaggerated eyebrows and darkened eyes, with a scraggly and long beard. He was the menacing bearded ogre opposite Chaplin in his most famous silents. His first Chaplin film was The Floorwalker (1916), playing the role of the villainous heavy, reprised in subsequent classics like The Rink (1916), The Pawnshop (1916), The Adventurer (1917), The Cure (1917), The Immigrant (1917), Easy Street (1917) and Chase me Charlie (1917). By the summer of 1917 Campbell was Chaplin's favorite co-star and foil, and almost as famous as the little comedian. In early 1917 Campbell filmed his last Chaplin Mutual, The Adventurer, after which Chaplin began construction on his own studio on LaBrea Avenue in Hollywood (which still stands today). During the five-month construction period, Chaplin lent Campbell to Mary Pickford, the world's biggest star, to appear in her film Amarilly of Clothes-Line Alley (1917). He was on the verge of becoming a world-wide star as filming began. But at the same time that he was becoming famous his personal life was beset by tragedy and scandal. On July 9, 1917 his wife died suddenly of a heart attack after dinner at a Santa Monica restaurant near their home. Walking to a nearby store to buy a mourning dress, his 16-year-old daughter Una was hit by a car a seriously injured. At a September 12th party given for Artcraft Studio publicity man Pete Schmid, Campbell met Pearl Gilman, a diminutive vaudeville comedienne with a family reputation for gold-digging. She had been married to candy heir Charles W. Alisky in 1912, and a few years later divorced and married another wealthy man, Theodore Arnreiter. Her sister Mabelle was married to elderly steel magnate William E. Corey, the owner of U.S. Steel. Just five days after they met, Campbell and Gilman Alisky-Arnreiter were married at the home of Elaine Hardy at 824 5th Street in Santa Monica. His daughter Una, still recuperating at a friend's home in Santa Monica canyon, was not told of the wedding for several weeks. Less than two months after marrying the gentle giant, Gilman Alisky-Arnreiter sued him for divorce. He moved out of the Santa Monica bungalow and into the Los Angeles Athletic Club, taking a room next to his best friend Chaplin. A month later later on December 20, Campbell attended a Christmas party at the Vernon Country Club, and drove back to L.A. in a drunken stupor. Approaching the intersection of Wilshire Blvd. and Vermont Ave. at over 60 m.p.h., he lost control of his car, crossed Wilshire and hit another car head-on. He was killed instantly, his massive body locked in the crumpled wreckage for over five hours. Heartbreak never left Campbell, even in death. After his remains were cremated, his ashes were sent to the Rosedale Cemetery, where they remained for six months while the cemetery waited in vain for someone to pay for his funeral. When the bill remained unpaid, the urn was returned to the Handley Mortuary, where it sat unnoticed in a closet from 1917 until late 1938. When the mortuary closed the urn was sent back to Rosedale, where it sat in another closet for still another 13 years. In 1952 a kindhearted office worker arranged for Campbell's remains to finally be buried. But, unfortunately, he forgot to record exactly where Campbell was buried, so the burly Scotsman is lost among the markers and statues in the quiet cemetery. In conjunction with a Scottish film about Campbell's life, a memorial plaque was laid in 1996. Campbell's death had a profound effect on Chaplin, and a quieter effect on movie history. After that time, Chaplin's movies lost some of their comic mystery; that certain something that his Mutual films had but subsequent films did not. His later works were much more self-centered and missing the comic give-and-take of his work with Campbell. There's no telling how famous Eric Campbell would have become, or what different films Chaplin may have done with his burly best friend.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0132444","name":"Eric Campbell","idIMDB":"nm0132444"},"actorId":"nm0132444","character":"Store Manager","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edna Purviance","urlProfile":"http://www.imdb.com/name/nm0701012","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMTI2MTcwNV5BMl5BanBnXkFtZTcwMjY4NjYxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 October 1895","placeOfBirth":" Paradise, Nevada, USA","birthName":"Olga Edna Purviance","height":"5' 2\" (1.57 m)","bio":"Edna Purviance began working as a stenographer in San Francisco. Charles Chaplin invited her to join him at Essanay Studio in 1915, the year of her film debut in Chaplin's His Night Out. Over the next seven years she appeared as his leading lady in over 20 Chaplin films made by Essanay, Mutual, and First National, including the classics The Tramp (1914), The Immigrant (1917), Easy Street (1917), The Kid (1921), and The Idle Class (1921). As a repayment for years of work with him, Chaplin intended real stardom for her with A Woman of Paris: A Drama of Fate (1923). The movie was a commercial failure though it advanced the career of Adolphe Menjou. She remained on Chaplin's payroll until her death, her last two appearances being non-speaking extra parts in his Monsieur Verdoux (1947) and Limelight (1952).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMTI2MTcwNV5BMl5BanBnXkFtZTcwMjY4NjYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0701012","name":"Edna Purviance","idIMDB":"nm0701012"},"actorId":"nm0701012","character":"Secretary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lloyd Bacon","urlProfile":"http://www.imdb.com/name/nm0045800","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjQzMzE0NGMtMGEzYS00MjlkLWFiODEtOGU4MGZjYzI1ODg5XkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 December 1889","placeOfBirth":" San Jose, California, USA","birthName":"Lloyd Francis Bacon","height":"5' 10\" (1.78 m)","bio":"One of the workhorses in Warner Brothers' stable of directors in the 1930s, Lloyd Bacon didn't have a career as loaded with classic films as many of his more famous contemporaries. What few \"classics\" he had his hand in (42nd Street (1933), Footlight Parade (1933)) are so overshadowed by the dazzling surrealistic choreography of Busby Berkeley that casual film buffs today often forget they were actually directed by Bacon. While his resume lacks the drama of failed productions and tales of an unbridled ego, he consistently enriched the studio's coffers, directing a handful of its biggest hits of the late 1920s and 1930s. Bacon's career amounts to that of a competent--and at times brilliant--director who did the best with the material handed to him in assembly-line fashion. Lloyd Bacon was born in San Jose, California, on January 16, 1890, into a theatrical family (his father was Frank Bacon, a playwright and stage actor). His parents enlisted all the Bacon children onto the stage. Despite having a strong interest in law as a student at Santa Clara College, Lloyd opted for an acting career after appearing in a student production of \"The Passion Play.\" In 1911 he joined David Belasco's Los Angeles Stock Company (with Lewis Stone), touring the country and gaining good notices in a Broadway run of the hit \"Cinderella Man\", and gaining further experience during a season of vaudeville. He switched gears in 1915 and took a stab at silent Hollywood, playing the heavy in several of Gilbert M. 'Broncho Billy' Anderson's shorts and pulling double duty as a stunt man. With America's entry into World War I in 1917, Bacon enlisted in the Navy and was assigned to the Photo Department. This began a lifelong admiration for the service and might explain the Navy being a favorite recurring theme in many of his films. After the war's end Bacon moved from Mutual (Charles Chaplin's studio at the time) to Triangle as a comedy actor. It was at this point that he got his first taste of directing-- he had let everyone at the studio know he had an interest in helming a picture, and when the director of a now forgotten Lloyd Hamilton comedy short fell ill, Bacon was given his chance. Constantly moving, he joined tightwad producer Mack Sennett as a gag writer. Sennett, sensing a bargain, happily accommodated Lloyd's desire to become a full-time director by early 1921. The Sennett studio was already in an irreversible decline during Bacon's tenure there but it allowed the novice director to gain a wealth of experience. He apprenticed for Sennett until joining Warner Brothers in 1925, an association that would last a remarkable 18 years and begin when the working-man's studio was building a strong stable of contract directors that included Michael Curtiz, Alan Crosland, John G. Adolfi and Mervyn LeRoy. Although Lloyd never became known for a particular style other than a well-placed close up, his ability to bring in an entertaining film on time and within budget earned him such enormous respect from the five Warner Brothers that he was soon handed control over important projects, including The Singing Fool (1928), Al Jolson's follow-up to The Jazz Singer (1927), which grossed an unheard-of (for Warners, at least) $4,000,000 in domestic receipts alone-- the studio's #1 hit for 1928. Bacon was rewarded by becoming the highest paid director on the studio lot, earning over $200,000 a year throughout the Depression. He was called upon to direct the studio's big-budget production of Moby Dick (1930), which garnered good notices, but it's a version that's barely remembered today. The 1930s saw Bacon assigned to the assembly line; aside from the Busby Berkeley-choreographed films, he directed many of James Cagney's crowd-pleasing two-week wonders, including Picture Snatcher (1933) (Cagney once remarked that the schedule on that picture was so tight that, one time after he and the cast had rehearsed a particular scene, Cagney said, \"OK, Lloyd, are you ready to shoot?\" Bacon grinned and said, \"I just did!\") and The Irish in Us (1935). As a reward, he was occasionally afforded more time and money on productions such as Here Comes the Navy (1934) and Devil Dogs of the Air (1935). He also directed Cagney's return effort after his ill-advised move to cheapjack Grand National Pictures after one of his periodic salary disputes with studio head Jack L. Warner-- the badly miscast if frenetic Boy Meets Girl (1938). This was one of Cagney's least critically acclaimed Warner Brothers films of the 1930s, but a smash hit for the studio. During his years at Warners, Bacon gained a reputation as a clothes horse, the dapper director arriving on the set dressed to the nines, wearing expensive hats that he would hurl around the set when expressing his dissatisfaction (he ruined a lot of hats) at an actor's performance or missed cue. Bacon continued to turn out profitable films for the studio until moving to 20th Century-Fox in 1944 (a logical move, since the recently discharged Darryl F. Zanuck knew Bacon from his early days at Warners). He stayed at Fox until 1949, then bounced among Columbia, Fox, Universal and finally the chaotically-run RKO in 1954. He worked virtually until his death from a cerebral hemorrhage at age 65.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjQzMzE0NGMtMGEzYS00MjlkLWFiODEtOGU4MGZjYzI1ODg5XkEyXkFqcGdeQXVyMjUxODE0MDY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0045800","name":"Lloyd Bacon","idIMDB":"nm0045800"},"actorId":"nm0045800","character":"Floorwalker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Albert Austin","urlProfile":"http://www.imdb.com/name/nm0042317","urlPhoto":"","biography":{"dateOfBirth":"13 December 1882","placeOfBirth":" Birmingham, England, UK","bio":"British-born supporting actor, primarily in the films of Charles Chaplin, for whom Austin also worked as an assistant director and co-writer. His career paralleled that of Chaplin, but dwindled prior to the coming of sound. His brother, William Austin, had a lengthy Hollywood career as a character actor.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0042317","name":"Albert Austin","idIMDB":"nm0042317"},"actorId":"nm0042317","character":"Shop Assistant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charlotte Mineau","urlProfile":"http://www.imdb.com/name/nm0591103","urlPhoto":"","biography":{"dateOfBirth":"24 March 1886","placeOfBirth":" Escanaba, Michigan, USA","bio":"Tall, statuesque Parisian actress, trained at the Sorbonne. Charlotte Mineau provided poise and glamour to many a slapstick farce in the 1910's and 20's. She was already an established performer with Essanay, by the time Charles Chaplin arrived from England. Her very first screen appearance in The Usual Way (1913) co-starred her with Wallace Beery. She later appeared in several of Chaplin's films, including an uncredited part in his debut His New Job (1915). Charlotte subsequently joined Chaplin's move to Mutual, then had spells with Mack Sennett and Hal Roach, where she supported Laurel & Hardy on several occasions (notably in Sugar Daddies (1927). Her career wound down with the advent of sound, and she was last glimpsed as 'Emily', a party guest, in The Marx Brothers feature Monkey Business (1931).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0591103","name":"Charlotte Mineau","idIMDB":"nm0591103"},"actorId":"nm0591103","character":"Store Detective","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leo White","urlProfile":"http://www.imdb.com/name/nm0925118","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDg3NWZkMWQtMjNjOS00YjUzLTgyYTctNWViNTA4ODI5NGVhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1882","placeOfBirth":" Grudziadz, Kujawsko-Pomorskie, Poland","birthName":"Leo Weiss","height":"5' 6\" (1.68 m)","bio":"Leo White started in comedy on the boards of English music hall in the late 1890's. He accompanied theatrical producer Daniel Frohman (later a partner of Adolph Zukor in Famous Players Lasky) to Hollywood in 1910. From 1914, he appeared in Essanay comedies and filmed the 'Sweedie' series with Wallace Beery. He then became a regular supporting player in Charles Chaplin's films at Essanay and, later Mutual, playing dapper, moustachioed continental (particularly French) villains and pompous aristocrats. That image remained with him, as he was contracted by Essanay to play the comic foil to their new French star comedian Max Linder. White's major dramatic film credits of the silent period included Blood and Sand (1922) with Rudolph Valentino and the biblical epic Ben-Hur: A Tale of the Christ (1925). He successfully made the transition to talking pictures and had supporting roles in two Marx Brothers comedies, Monkey Business (1931) and the classic A Night at the Opera (1935), as well as playing a barber in Chaplin's The Great Dictator (1940). In the years just prior to his death, he worked as an extra in several films for Warner Brothers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDg3NWZkMWQtMjNjOS00YjUzLTgyYTctNWViNTA4ODI5NGVhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0925118","name":"Leo White","idIMDB":"nm0925118"},"actorId":"nm0925118","character":"Elegant Customer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James T. Kelley","urlProfile":"http://www.imdb.com/name/nm0445920","urlPhoto":"","biography":{"dateOfBirth":"10 July 1854","placeOfBirth":" Castlebar, Ireland","bio":"James T. Kelley was born on July 10, 1854 in Castlebar, Ireland. He was an actor, known for The Rink (1916), The Immigrant (1917) and The Cure (1917). He died on November 12, 1933 in New York City, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0445920","name":"James T. Kelley","idIMDB":"nm0445920"},"actorId":"nm0445920","character":"Lift Boy","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0006689","urlIMDB":"http://www.imdb.com/title/tt0006689","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Copyright MCMLXXXIV by David Shepard (on 1989 print)"},"technical":{"runtime":["24 min (2 fps) (USA)","29 min (restored) (2013)"],"soundMix":["Silent"],"color":["Black and White"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":["529 m (2 reels) (USA)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.7","filmingLocations":[{"location":"Lone Star Studio - 1751 Glendale Boulevard, Hollywood, Los Angeles, California, USA"}],"rated":"TV-G","awards":[],"votes":"1,588","type":"Movie","companyCreditsSimple":[{"idCompany":"co0056830","name":"Lone Star Corporation"}],"keywords":{"keywords":["loot","character acts like mirror image","thief","salesclerk","look alike","floorwalker","escalator","embezzler","department store"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:28:39"}}