{"data":{"movies":[{"title":"The Terror","originalTitle":"","year":"1963","releaseDate":"19640516","directors":[{"name":"Roger Corman","id":"nm0000339"},{"name":"Francis Ford Coppola","id":"nm0000338"}],"writers":[{"name":"Leo Gordon","id":"nm0330388"},{"name":"Jack Hill","id":"nm0384335"}],"runtime":"81 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDIxMTIzYWEtNTgwOC00MzRmLWE1MWQtMTY3Y2ZhOWJmZGRmXkEyXkFqcGdeQXVyMTQ2MjQyNDc@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Thriller"],"plot":"France, 18th century. Lieutenant Andre Duvalier (Jack Nicholson) has been accidentally separated from his regiment. He is wandering near the coast when he sees a young woman (Sandra Knight) and asks her for directions to Coldon, where he hopes to rejoin his regiment. But the woman doesn't answer, doesn't even greet him and walks away. Eventually she takes him towards the sea, where she disappears in rough water. Andre loses consciousness while trying to follow her, and is attacked by a bird and awakes in a house where an old woman (Dorothy Neumann) claims never to have seen the woman. After he leaves, he sees the woman again, and while trying to follow her, is saved by a man from certain death. Andre learns that in order to help the girl, he must go to castle of Baron Von Leppe (Boris Karloff), and when he arrives, Andre sees the woman looking out of a window. However, Baron Von Leppe is old and seems reluctant to let Andre in. He claims there's no woman in the castle, but shows Andre...","simplePlot":"A young officer in Napoleon's army pursues a mysterious woman to the castle of an elderly Baron.","actors":[{"actorName":"Boris Karloff","urlProfile":"http://www.imdb.com/name/nm0000472","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMTE2MzI5Nl5BMl5BanBnXkFtZTYwMjk4MTI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 November 1887","placeOfBirth":" Camberwell, London, England, UK","birthName":"William Henry Pratt","height":"5' 11\" (1.81 m)","bio":"Along with fellow actors Lon Chaney, Bela Lugosi and Vincent Price, Boris Karloff is recognized as one of the true icons of horror cinema, and the actor most closely identified with the general public's perception of the \"monster\" from the classic Mary Shelley book, \"Frankenstein\". William Henry Pratt was born on November 23, 1887, in Camberwell, London, England, the son of Edward John Pratt Jr., the Deputy Commissioner of Customs Salt and Opium, Northern Division, Indian Salt Revenue Service, and his third wife, Eliza Sarah Millard. He was educated at London University in anticipation that he would pursue a diplomatic career; however, he emigrated to Canada in 1909 and joined a touring company based out of Ontario and adopted the stage name of \"Boris Karloff.\" He toured back and forth across the USA for over ten years in a variety of low-budget theater shows and eventually ended up in Hollywood with very little money to his name. Needing cash to support himself, Karloff secured occasional acting work in the fledgling silent film industry in such pictures as The Deadlier Sex (1920), Omar the Tentmaker (1922), Dynamite Dan (1924) and Tarzan and the Golden Lion (1927), in addition to a handful of serials (the majority of which sadly haven't survived). Karloff supplemented his meager film income by working as a truck driver in Los Angeles, which allowed him enough time off to continue to pursue acting roles. His big break came in 1931 when he was cast as \"the monster\" in the Universal production of Frankenstein (1931), directed by James Whale, one of the studio's few remaining auteur directors. The aura of mystery surrounding Karloff was highlighted in the opening credits, as he was listed as simply \"?.\" The film was a commercial and critical success for Universal, and Karloff was instantly established as a hot property in Hollywood. He quickly appeared in several other sinister roles, including Scarface (1932) (filmed before Frankenstein (1931)), the black-humored The Old Dark House (1932), as the namesake Oriental villain of the Sax Rohmer novels in The Mask of Fu Manchu (1932), as undead Im-Ho-Tep in The Mummy (1932) and the misguided Prof. Morlant in The Ghoul (1933). He thoroughly enjoyed his role as a religious fanatic in John Ford's The Lost Patrol (1934), although contemporary critics described it as a textbook example of overacting. He donned the signature make-up, neck bolts and asphalt spreader's boots again to play Frankenstein's monster in the sensational Bride of Frankenstein (1935) and the less thrilling Son of Frankenstein (1939). Karloff, on loan to Fox, appeared in one of the best of the Warner Oland Chan entries, Charlie Chan at the Opera (1936), before beginning his own short-lived Mr. Wong detective series. He was a wrongly condemned doctor in Devil's Island (1939), shaven-headed executioner \"Mord the Merciless\" in Tower of London (1939), another misguided scientist in The Ape (1940), a crazed scientist surrounded by monsters, vampires and werewolves in House of Frankenstein (1944), a murderous cabman in The Body Snatcher (1945) and a Greek general fighting vampirism in the superb atmospheric Val Lewton thriller Isle of the Dead (1945). While Karloff continued appearing in a plethora of films, many of them were not up to the standards of his previous efforts, including appearances in two of the hokey Bud Abbott and Lou Costello monster movies (he had appeared with them in an earlier superior effort, Abbott and Costello Meet the Killer, Boris Karloff (1949), which theater owners often added his name to the marquee), the low point of the Universal-International horror movie cycle. During the 1950s he was a regular guest on many high-profile TV shows including Texaco Star Theatre (1948), Tales of Tomorrow (1951), The Veil (1958), The Donald O'Connor Show (1954), The Red Skelton Hour (1951) and The Dinah Shore Chevy Show (1956), to name but a few, and he appeared in a mixed bag of films including Sabaka (1954) and Voodoo Island (1957). On Broadway he appeared as the murderous Brewster brother in the hit, \"Arsenic and Old Lace\" (his role, or the absence of him in it, was amusingly parodied in the film version) and a decade later he enjoyed a long run in \"Peter Pan,\" perfectly cast as \"Captain Hook.\" His career experienced something of a revival in the 1960s thanks to hosting the TV anthology series Thriller (1960) and indie director Roger Corman, with Karloff contributing wonderful performances in The Raven (1963), The Terror (1963), the ultra-eerie Black Sabbath (1963) and the H.P. Lovecraft-inspired Monster of Terror (1965). Karloff's last great role was as an aging horror movie star confronting a modern-day sniper in the Peter Bogdanovich film Targets (1968). His TV career was capped off by achieving Christmas immortality as the narrator of Chuck Jones's perennial animated favorite, How the Grinch Stole Christmas! (1966). Three low-budget Mexican-produced horror films starring an ailing Karloff were released in the two years after his death; however, they do no justice to this great actor. In retrospect, he never took himself too seriously as an actor and had a tendency to downplay his acting accomplishments. Renowned as a refined, kind and warm-hearted gentleman, with a sincere affection for children and their welfare, Karloff passed away on February 2, 1969 from emphysema. He was cremated at Guildford Crematorium, Godalming, Surrey, England, where he is commemorated by a plaque in Plot 2 of the Garden of Remembrance.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMTE2MzI5Nl5BMl5BanBnXkFtZTYwMjk4MTI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000472","name":"Boris Karloff","nicknames":["Billy","The Uncanny"],"idIMDB":"nm0000472"},"actorId":"nm0000472","character":"Baron Victor Frederick Von Leppe / Eric","urlCharacter":"http://www.imdb.com/character/ch0049342","main":true},{"actorName":"Jack Nicholson","urlProfile":"http://www.imdb.com/name/nm0000197","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3OTY0ODk0M15BMl5BanBnXkFtZTYwNzE4Njc4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 April 1937","placeOfBirth":" Neptune, New Jersey, USA","birthName":"John Joseph Nicholson","height":"5' 9¾\" (1.77 m)","bio":"Jack Nicholson, an American actor, producer, director and screenwriter, is a three-time Academy Award winner and twelve-time nominee. Nicholson is also notable for being one of two actors - the other being Michael Caine - who have received Oscar nomination in every decade from the 1960s through the 1990s. Nicholson was born on April 22, 1937 in Neptune, New Jersey. He was raised believing that his grandmother was his mother, and that his mother, June Frances Nicholson, a show-girl, was his older sister. He discovered the truth in 1975 from a Time magazine journalist who was researching a profile on him. His real father is believed to have been either Donald Furcillo, an Italian-American show-man, or Eddie King (Edgar Kirschfeld), born in Latvia and also in show-business. Jack's mother's ancestry was Irish, English, as well as German, Scottish and Welsh. Nicholson made his film debut in a B-movie titled The Cry Baby Killer (1958). His rise in Hollywood was far from meteoric, and for years, he sustained his career with guest spots in television series and a number of Roger Corman films, including The Little Shop of Horrors (1960). Nicholson's first turn in the director's chair was for Drive, He Said (1971). Before that, he wrote the screenplay for The Trip (1967), and co-wrote Head (1968), a vehicle for The Monkees. His big break came with Easy Rider (1969) and his portrayal of liquor-soaked attorney George Hanson, which earned Nicholson his first Oscar nomination. Nicholson's film career took off in the 1970s with a definitive performance in Five Easy Pieces (1970). Nicholson's other notable work during this period includes leading roles in Roman Polanski's noir masterpiece Chinatown (1974) and One Flew Over the Cuckoo's Nest (1975), for which he won his first Best Actor Oscar. The 1980s kicked off with another career-defining role for Nicholson as Jack Torrance in Stanley Kubrick's adaptation of Stephen King's novel The Shining (1980). A string of well-received films followed, including Terms of Endearment (1983) which earned Nicholson his second Oscar; Prizzi's Honor (1985) and The Witches of Eastwick (1987). He portrayed another renowned villain, The Joker, in Tim Burton's Batman (1989). In the 1990s, he starred in such varied films as A Few Good Men (1992), for which he received another Oscar nomination, and a dual role in Mars Attacks! (1996). Although a glimpse at the darker side of Nicholson's acting range reappeared in The Departed (2006), the actor's most recent roles highlight the physical and emotional complications one faces late in life. The most notable of these is the unapologetically misanthropic Melvin Udall in As Good as It Gets (1997), for which he won his third Academy Award. Shades of this persona are apparent in About Schmidt (2002), Something's Gotta Give (2003) and The Bucket List (2007). In addition to his Academy Awards and Oscar nominations, Nicholson has seven Golden Globe Awards, and received a Kennedy Center Honor in 2001. He also became one of the youngest actors to receive the American Film Institute's Life Achievement award in 1994. Nicholson has five children: Eldest daughter Jennifer Nicholson (b. 1963), from his marriage to Sandra Knight which ended in 1968; Caleb James Goddard (b. 1970) with Susan Anspach; Honey Hollman (b. 1981) with Danish supermodel, Winnie Hollman; and Lorraine Nicholson (b. 1990) and Ray Nicholson (b. 1992) with Rebecca Broussard. Nicholson's longest relationship was the seventeen years he spent with actress Anjelica Huston; this ended when Broussard become pregnant with his child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3OTY0ODk0M15BMl5BanBnXkFtZTYwNzE4Njc4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000197","name":"Jack Nicholson","nicknames":["Mulholland Man","Nick"],"idIMDB":"nm0000197"},"actorId":"nm0000197","character":"Lt. Andre Duvalier","urlCharacter":"http://www.imdb.com/character/ch0044130","main":true},{"actorName":"Sandra Knight","urlProfile":"http://www.imdb.com/name/nm0461070","urlPhoto":"","biography":{"dateOfBirth":"1 January 1940","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"5' 6\" (1.68 m)","bio":"Sandra Knight was born on January 1, 1940 in Philadelphia, Pennsylvania, USA. She is an actress, known for The Terror (1963), Frankenstein's Daughter (1958) and Thunder Road (1958). She is married to John Stephenson. She was previously married to Jack Nicholson.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0461070","name":"Sandra Knight","nicknames":["Sandy"],"idIMDB":"nm0461070"},"actorId":"nm0461070","character":"Helene / Ghost of Ilsa The Baroness Von Leppe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dick Miller","urlProfile":"http://www.imdb.com/name/nm0588241","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNDM1OTY4NV5BMl5BanBnXkFtZTcwMDQ3NDcyNA@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1928","placeOfBirth":" The Bronx, New York, USA","birthName":"Richard Miller","height":"5' 5\" (1.65 m)","bio":"A native of the Bronx, New York, Richard \"Dick\" Miller served in the U.S. Navy for a few years and earned a prize title as a middleweight boxer. He settled in Los Angeles in the mid-1950s, where he was noticed by producer/director Roger Corman, who cast him in most of his low-budget films, usually playing unlikeable sorts, such as a vacuum-cleaner salesman in Not of This Earth (1957). His most memorable role would have to be that of the mentally unstable, busboy/beatnik artist Walter Paisley, whose clay sculptures are suspiciously lifelike in A Bucket of Blood (1959) (a rare starring role for him), and he is also fondly remembered for his supporting role as the flower-eating Vurson Fouch in Corman's legendary The Little Shop of Horrors (1960). Miller spent the next 20 years working in Corman productions, and starting in the late 1970s was often cast in films by director Joe Dante, appearing in credited and uncredited walk-on bits as quirky chatterboxes, and stole every scene he appeared in. He has played many variations on his famous Walter Paisley role, such as a diner owner (Twilight Zone: The Movie (1983)) or a janitor (Chopping Mall (1986)). One of his best bits is the funny occult-bookshop owner in The Howling (1981). Being short (so he never played a romantic lead or a threatening villain) with wavy hair, long sideburns, a pointed nose and a face as trustworthy as a used-car dealer's, he was, and is to this day, an immediately recognizable character actor whose one-scene appearances in countless movies and TV shows guarantee audience applause.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNDM1OTY4NV5BMl5BanBnXkFtZTcwMDQ3NDcyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0588241","name":"Dick Miller","idIMDB":"nm0588241"},"actorId":"nm0588241","character":"Stefan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dorothy Neumann","urlProfile":"http://www.imdb.com/name/nm0627030","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3OTAyZDEtMTRlYy00ZTA2LWJlNDYtZDA1NDU2NWQ2ODUwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 January 1914","placeOfBirth":" New York City, New York, USA","bio":"Dorothy Neumann was born on January 26, 1914 in New York City, New York, USA. She was an actress, known for The Terror (1963), Sorry, Wrong Number (1948) and The Ten Commandments (1956). She died on May 20, 1994 in Santa Monica, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3OTAyZDEtMTRlYy00ZTA2LWJlNDYtZDA1NDU2NWQ2ODUwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0627030","name":"Dorothy Neumann","idIMDB":"nm0627030"},"actorId":"nm0627030","character":"Katrina, Witch / Eric's Mother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jonathan Haze","urlProfile":"http://www.imdb.com/name/nm0371918","urlPhoto":"","biography":{"dateOfBirth":"1 April 1929","placeOfBirth":" Pittsburgh, Pennsylvania, USA","bio":"Jonathan Haze is an American actor, producer and scary movie idol. Best known for his work in Roger Corman films, and especially for playing \"Seymour\" in Corman's black comedy cult classic, The Little Shop of Horrors (1960), Haze's career spans more than 20 films in six decades, including screen-writing the science fiction comedy Invasion of the Star Creatures (1962). Born in Pittsburgh into a show business family, Haze's cousin was legendary jazz drummer and bandleader Buddy Rich. Haze started his career behind-the-scenes working stage production for his cousin Buddy, eventually becoming stage manager for Josephine Baker. A move to Los Angeles lead to Haze to working in film production and consequently becoming an almost exclusive player for low-budget producer/director Roger Corman. The slight-framed, curly-haired, gawky-looking lad made his inauspicious screen debut in Corman's Monster from the Ocean Floor (1954), but managed to continue on a steady scale in minor roles of tough guys and weirdos. He played a pickpocket in Swamp Women (1955), an ex-convict in Five Guns West (1955) and a man contaminated by radioactive fallout in Day the World Ended (1955), which was Corman's first foray into the sci-fi genre. His on-screen versatility noted, Haze received larger roles and subsequent better billing in the cheapjack productions Gunslinger (1956), It Conquered the World (1956), Naked Paradise (1957), Carnival Rock (1957), Not of This Earth (1957), and Bayou (1957) (a.k.a. \"Poor White Trash\"). Following work as a Viking in the incredulous The Saga of the Viking Women and Their Voyage to the Waters of the Great Sea Serpent (1957), Haze landed his first starrer in the Warner Bros. drama Stakeout on Dope Street (1958), directed by Irvin Kershner. Haze plays an average teenager who, along with 2 friends, finds $250k of heroin and decides to go into the drug selling business. The Little Shop of Horrors (1960), however, catapulted Haze into cult stardom. As the slow-witted sad sack Seymour Krelboyne, Haze plays the unassuming Skid Row flower shop assistant who nourishes a seemingly harmless seedling, then falls prey to its grotesque, bloodthirsty plant while having to kill and serve up human beings as plant food. The comedy, which featured Haze's good friend Dick Miller and an unknown Jack Nicholson, grew overwhelmingly in status over the years thanks to midnight TV and spawned a hit Broadway musical and resulting musical film. Haze worked alongside Miller and Nicholson again in Corman's Edgar Allan Poe-like The Terror (1963) which starred Boris Karloff. Near this time Haze began to veer away from acting opting to work behind-the-scenes again. He wrote the script for the sci-fi comedy Invasion of the Star Creatures (1962) and worked in production for such films as The Premature Burial (1962), Medium Cool (1969) Another Nice Mess (1972), and Corman's The Born Losers (1967). Experience, connections and opportunity then lead to Haze producing commercials. As a CEO of a commercial production company, he created successful national and international campaigns for the likes of United Airlines, Kool-Aid, Schlitz Beer and more during the 70's, 80's and 90's. In 1999, he made a cameo in Corman's \"The Phantom Eye\" (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0371918","name":"Jonathan Haze","nicknames":["Jackie"],"idIMDB":"nm0371918"},"actorId":"nm0371918","character":"Gustaf","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0057569","urlIMDB":"http://www.imdb.com/title/tt0057569","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 21 min (81 min)","1 hr 31 min (91 min) (DVD) (Germany)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical (as Vistascope)"],"printedFilmFormat":["35 mm"]},"rating":"5.0","filmingLocations":[{"location":"Big Sur, California, USA"}],"rated":"PG","awards":[],"votes":"5,477","type":"Movie","companyCreditsSimple":[{"idCompany":"co0137920","name":"Roger Corman Productions"}],"keywords":{"keywords":["baron","castle","sea","painting","forest","lost","death","bird","low budget film","b movie","fireplace","spell","witch","manservant","tomb","uniform","torch","drawing","quicksand","body possession","transformation","mute","thunder","crone","lightning","compass","beach","dungeon","flooding","axe","portcullis","fistfight","tunnel","pistol","punched in the face","key","graveyard","chapel","seizure","blood","fall from height","cult","melting face","public domain","suicide","stranger","soldier","rescue","nobility","baltic sea","haunted by the past","19th century","presumed dead","mystery woman","horse","extramarital affair","drowning","dead wife","bird attack","enigma","deliberate cruelty","survivor","gothic","ghost","aristocrat","corpse","skeleton","crypt","cult director","spirit","hypnotism","cult film","revenge","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:41:47"}}