{"data":{"movies":[{"title":"Blue Thunder","originalTitle":"","year":"1983","releaseDate":"19830513","directors":[{"name":"John Badham","id":"nm0000824"}],"writers":[{"name":"Dan O'Bannon","id":"nm0639321"},{"name":"Don Jakoby","id":"nm0415979"}],"runtime":"109 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmVmNWIzNWQtYmMwOC00MTc1LTkxN2UtNzhlYjg5YjZjMzA4XkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Crime","Drama","Sci-Fi","Thriller"],"plot":"Blue Thunder is a specially modified helicopter. It is for police work, but is armed and designed to counter street insurgencies. Its makers want to show what it will do, but have to train Los Angeles Police pilot Frank Murphy to fly and use it in order to allow it to operate in the city. Murphy and the project pilot have differences going back to Vietnam. The conflict between them continues to heat up as Murphy begins to suspect that Blue Thunder is more than has been disclosed.","simplePlot":"The cop test pilot for an experimental police helicopter learns the sinister implications of the new vehicle.","actors":[{"actorName":"Roy Scheider","urlProfile":"http://www.imdb.com/name/nm0001702","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2ODY5ODg4OTdeQTJeQWpwZ15BbWU2MDUzOTM3Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1932","placeOfBirth":" Orange, New Jersey, USA","birthName":"Roy Richard Scheider","height":"5' 9\" (1.75 m)","bio":"Lean, angular-faced and authoritatively spoken lead / supporting actor Roy Scheider obviously never heard the old actor's axiom about \"never appearing with kids or animals\" lest they overshadow your performance. Breaking that rule did him no harm, though, as he achieved pop cult status by finding, fighting and blowing up a 25-foot-long Great White shark (nicknamed \"Bruce\") in the mega-hit Jaws (1975) and then electrocuting an even bigger Great White in the vastly inferior Jaws 2 (1978). Athletic Scheider was born in November 1932 in Orange, New Jersey, to Anna (Crosson) and Roy Bernhard Scheider, a mechanic. He was of German and Irish descent. A keen sportsman from a young age, he competed in baseball and boxing (his awkwardly mended broken nose is a result of his foray into Golden Gloves competitions). While at college, his pursuits turned from sports to theater and he studied drama at Rutgers and Franklin and Marshall. After a stint in the military, Scheider appeared with the New York Shakespeare Festival and won an \"Obie Award\" for his appearance in the play \"Stephen D.\" His film career commenced with the campy Z-grade horror cheesefest The Curse of the Living Corpse (1964), and he then showed up in Star! (1968), Paper Lion (1968), Stiletto (1969) and Puzzle of a Downfall Child (1970). In 1971 he really came to the attention of film audiences with his role in the Jane Fonda thriller Klute (1971) and then as Det. Buddy Russo (scoring his first Oscar nomination) alongside fiery Gene Hackman in the crime drama The French Connection (1971). His performance as a tough street cop in that film led him into another tough cop role as NYC Det. Buddy Manucci in the underappreciated The Seven-Ups (1973), which features one of the best car chase sequences ever put on film. In the early 1970s the Peter Benchley novel \"Jaws\" was a phenomenal best-seller, and young director Steven Spielberg was chosen by Universal Pictures to direct the film adaptation, Jaws (1975), in which Scheider played police chief Brody and shared lead billing with Robert Shaw and Richard Dreyfuss in the tale of a New England seaside community terrorized by a hungry Great White shark. \"Jaws\" was a blockbuster, and for many years held the record as the highest-grossing film of all time. Scheider then turned up as the shady CIA agent brother of Dustin Hoffman in the unnerving Marathon Man (1976) and in the misfired William Friedkin-directed remake of The Wages of Fear (1953) titled Sorcerer (1977), before again returning to Amity to battle another giant shark in Jaws 2 (1978). Seeking a change from tough cops and hungry sharks, he took the role of womanizing, drug-popping choreographer Joe Gideon, the lead character of the semi-autobiographical portrayal of director Bob Fosse in the sparkling All That Jazz (1979). It was another big hit for Scheider (and another Oscar nomination), with the film featuring a stunning opening sequence to the tune of the funky George Benson number \"On Broadway\", and breathtaking dance routines including the \"Airotica\" performance by the glamorous Sandahl Bergman. Returning to another law enforcement role, Scheider played a rebellious helicopter pilot in the John Badham conspiracy / action film Blue Thunder (1983), a scientist in the sequel to 2001: A Space Odyssey (1968) simply titled 2010: The Year We Make Contact (1984), a cheating husband who turns the tables on his blackmailers in 52 Pick-Up (1986), a cold-blooded hit man in Cohen and Tate (1988) and a CIA operative in the muddled and slow-moving The Russia House (1990). The versatile Scheider was then cast as the captain of a futuristic submarine in the relatively popular TV series SeaQuest 2032 (1993), which ran for three seasons. Inexplicably, however, Scheider had seemingly, and slowly, dropped out of favor with mainstream film audiences, and while he continued to remain busy, predominantly in supporting roles (generally as US presidents or military officers), most of the vehicles he appeared in were B-grade political thrillers such as État d'urgence (1997), Executive Target (1997), Chain of Command (2000) and Red Serpent (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2ODY5ODg4OTdeQTJeQWpwZ15BbWU2MDUzOTM3Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001702","name":"Roy Scheider","idIMDB":"nm0001702"},"actorId":"nm0001702","character":"Officer Frank Murphy","urlCharacter":"http://www.imdb.com/character/ch0023558","main":true},{"actorName":"Warren Oates","urlProfile":"http://www.imdb.com/name/nm0643105","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMDUwMDkxOV5BMl5BanBnXkFtZTcwMjk3NDcyNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 July 1928","placeOfBirth":" Depoy, Kentucky, USA","birthName":"Warren Mercer Oates","height":"5' 11¼\" (1.81 m)","bio":"Warren Oates was an American character actor of the 1960s and 1970s and early 1980s whose distinctive style and intensity brought him to offbeat leading roles. Oates was born in Depoy, a very small Kentucky town. He was the son of Sarah Alice (Mercer) and Bayless Earle Oates, a general store owner. He attended high school in Louisville, continuing on to the University of Louisville and military service with the U.S. Marines. In college he became interested in the theatre and in 1954 headed for New York to make his mark as an actor. However, his first real job in television was, as it had been for James Dean before him, testing the contest gags on the game show Beat the Clock (1950). He did numerous menial jobs while auditioning, including serving as the hat-check man at the nightclub \"21\". By 1957 he had begun appearing in live dramas such as Studio One in Hollywood (1948), but Oates' rural drawl seemed more fitted for the Westerns that were proliferating on the big screen at the time, so he moved to Hollywood and immediately stared getting steady work as an increasingly prominent supporting player, often as either craven or vicious types. With his role as one of the Hammond brothers in the Sam Peckinpah masterpiece Ride the High Country (1962), Oates found a niche both as an actor and as a colleague of one of the most distinguished and distinctive directors of the period. Peckinpah used Oates repeatedly, and Oates, in large part due to the prominence given him by Peckinpah, became one of those rare character actors whose name and face is as familiar as those of many leading stars. He began to play roles which, while still character parts, were also leads, particularly in cult hits like Two-Lane Blacktop (1971) and Bring Me the Head of Alfredo Garcia (1974). Although never destined to be a traditional leading man, Oates remained one of Hollywood's most valued and in-demand character players up until his sudden death from a heart attack on April 3, 1982 at the age of 53. His final two films, Tough Enough (1983) (filmed in late 1981) and Blue Thunder (1983) (filmed in early 1980), were released over one year after his death and were dedicated to his memory.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMDUwMDkxOV5BMl5BanBnXkFtZTcwMjk3NDcyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0643105","name":"Warren Oates","idIMDB":"nm0643105"},"actorId":"nm0643105","character":"Capt. Jack Braddock","urlCharacter":"http://www.imdb.com/character/ch0023561","main":true},{"actorName":"Candy Clark","urlProfile":"http://www.imdb.com/name/nm0163748","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzU5NzM2Mzg1Nl5BMl5BanBnXkFtZTgwNDM1Mzg5NTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1947","placeOfBirth":" Norman, Oklahoma, USA","birthName":"Candace June Clark","height":"5' 7\" (1.7 m)","bio":"Candy Clark was born on June 20, 1947 in Norman, Oklahoma, USA as Candace June Clark. She is an actress, known for Zodiac (2007), American Graffiti (1973) and The Man Who Fell to Earth (1976). She was previously married to Jeff Wald and Marjoe Gortner.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzU5NzM2Mzg1Nl5BMl5BanBnXkFtZTgwNDM1Mzg5NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0163748","name":"Candy Clark","idIMDB":"nm0163748"},"actorId":"nm0163748","character":"Kate","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Daniel Stern","urlProfile":"http://www.imdb.com/name/nm0827663","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NTcwNDcxMF5BMl5BanBnXkFtZTcwMTI3Mjc4Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1957","placeOfBirth":" Bethesda, Maryland, USA","birthName":"Daniel Jacob Stern","height":"6' 4\" (1.93 m)","bio":"Daniel Stern was born in Bethesda, Maryland, to a social worker father and a day care manager mother. He has been acting professionally since the age of seventeen. Following his high school graduation, he auditioned for the Washington Shakespeare Festival seeking a job as a lighting engineer but ended up as \"a strolling player with a lute\" in their production of \"As You Like It.\" Shortly thereafter, he made his way to New York where he \"took a couple of acting lessons\" and began to assemble an impressive portfolio of such off-Broadway credits as \"Split,\" \"Frankie and Annie,\" \"The Mandrake,\" and \"The Old Glory.\" In addition, director Peter Yates cast him as one of the four Indiana teenagers in the highly acclaimed film Breaking Away (1979). Variety in acting roles appeals to Stern. Following \"Breaking Away,\" he appeared in Woody Allen's Stardust Memories (1980), Claudia Weill's It's My Turn (1980) and John Schlesinger's Honky Tonk Freeway (1981) before returning to New York to appear off-Broadway in the two character play \"How I Got That Story,\" which led to critical acclaim and a starring role in Barry Levinson's Diner (1982). Other film credits include I'm Dancing as Fast as I Can (1982), Blue Thunder (1983), Hannah and Her Sisters (1986), The Boss' Wife (1986), The Milagro Beanfield War (1988), Born in East L.A. (1987) and D.O.A. (1988) In addition to his voice-over work on the series, Stern directed several episodes of the popular and critically acclaimed television comedy, The Wonder Years (1988).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NTcwNDcxMF5BMl5BanBnXkFtZTcwMTI3Mjc4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0827663","name":"Daniel Stern","idIMDB":"nm0827663"},"actorId":"nm0827663","character":"Officer Richard Lymangood","urlCharacter":"http://www.imdb.com/character/ch0023559","main":true},{"actorName":"Paul Roebling","urlProfile":"http://www.imdb.com/name/nm0736259","urlPhoto":"","biography":{"dateOfBirth":"1 March 1934","placeOfBirth":" Philadelphia, Pennsylvania, USA","bio":"Paul Roebling was born on March 1, 1934 in Philadelphia, Pennsylvania, USA. He was an actor and producer, known for Blue Thunder (1983), Prince of the City (1981) and Carolina Skeletons (1991). He was married to Olga Bellin. He died on July 27, 1994 in Teec Nos Pos, Arizona, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0736259","name":"Paul Roebling","idIMDB":"nm0736259"},"actorId":"nm0736259","character":"Icelan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Sheiner","urlProfile":"http://www.imdb.com/name/nm0790905","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDA5NzE1Ml5BMl5BanBnXkFtZTcwNTAzOTY3Mg@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 January 1928","placeOfBirth":" New York City, New York, USA","height":"5' 10\" (1.78 m)","bio":"David Sheiner, the television actor, was born on January 13, 1928 in New York City. He made his TV debut in 1952 on Tom Corbett, Space Cadet (1950) and appeared sporadically on TV during the 1950s as he established himself. In 1955, Sheiner made his Broadway debut in \"Will Success Spoil Rock Hunter\" (1958), appearing first as a hotel bellboy and then replacing Orson Bean in a lead role. His career picked up in the 1960s, and he was a frequent guest on numerous TV series in featured roles throughout the '60s, '70s and '80s. He also appeared in movies, most notably as Oscar and Felix's poker buddy Roy in The Odd Couple (1968). In 1988, Sheiner retired from acting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDA5NzE1Ml5BMl5BanBnXkFtZTcwNTAzOTY3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0790905","name":"David Sheiner","idIMDB":"nm0790905"},"actorId":"nm0790905","character":"Fletcher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe Santos","urlProfile":"http://www.imdb.com/name/nm0764134","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNDA0OTMyOF5BMl5BanBnXkFtZTcwMTA0MjkxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 June 1931","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Joseph Minieri","height":"5' 9\" (1.75 m)","bio":"Brooklyn-born actor of Italian descent, Joe Santos started out a football jock at Fordham University and turned semi-pro before finding a new avenue in acting. Success was long in coming, and he paid his dues for years in a number of blue-collar jobs including railroad worker, tree trimmer, cabbie and barkeep while taking acting classes. A soap opera job and work in his cousin Joseph W. Sarno's cheap jack film exploitations (Flesh and Lace (1965), Moonlighting Wives (1966) and My Body Hungers (1967)) in the '60s seemed to lead nowhere. His first real break came with the searing film downer The Panic in Needle Park (1971), getting a part at the urging of his friend and star of the film, the up-and-coming Al Pacino, who had played some softball with Santos. A prime role as a sympathetic sergeant in the acclaimed TV mini-series The Blue Knight (1973) led Santos in the direction of \"good cop\" parts, with a long-running role as James Garner's long-suffering friend Lt. Becker on the series The Rockford Files (1974) (1974-80). Other series roles in Me and Maxx (1980), a.k.a. Pablo (1984)--as Paul Rodriguez's dad--and Lt. Harper in the 1985-86 season of Hardcastle and McCormick (1983) kept him busy. Missing out on the one big role that might have put him on the map, the beefy and balding Santos remains a durable and reliable supporting player, getting some deserved notice in 2004 with his recurring role of \"Consigliere Angelo Garepe\" in the hit hit man series The Sopranos (1999). He has also dabbled in playwriting, having penned \"Sunset Normandie\", in which he also starred.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNDA0OTMyOF5BMl5BanBnXkFtZTcwMTA0MjkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0764134","name":"Joe Santos","idIMDB":"nm0764134"},"actorId":"nm0764134","character":"Montoya","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Malcolm McDowell","urlProfile":"http://www.imdb.com/name/nm0000532","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMjQxNzczM15BMl5BanBnXkFtZTcwMTg3MTMwNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1943","placeOfBirth":" Horsforth, Yorkshire, England, UK","birthName":"Malcolm John Taylor","height":"5' 8½\" (1.74 m)","bio":"Malcolm John Taylor was born on June 13, 1943 in Leeds, England, to working-class parents Edna (McDowell), a hotelier, and Charles Taylor, a publican. His father was an alcoholic. Malcolm hated his parents' ways. His father was keen to send his son to private school to give him a good start in life, so Malcolm was packed off to boarding school at age 11. He attended the Tunbridge Boarding School and the Cannock House School in Eltham, Kent. At school, he was beaten with the slipper or cane every Monday for his wayward behavior. Whilst at school, he decided that he wanted to become an actor; it was also around this time that his love for race cars began. He attended the London Academy of Music and Dramatic Arts (LAMDA) to study acting. Meanwhile, he worked at his parents' pub but lost his job when the pub went bankrupt, his father drinking all the profits. He then had a variety of jobs, from coffee salesman to messenger. His first big-screen role was in Poor Cow (1967), although his two-minute scene was ultimately cut from the completed film. Soon after, he caught the attention of director Lindsay Anderson who cast him in the role of a rebellious student in his film If.... (1968). The film catapulted Malcolm to stardom in Britain but failed everywhere else. He was so enthusiastic about the film's success that he wanted to do another right away. He began writing what would become the semi-autobiographical O Lucky Man! (1973). Meanwhile, he starred as the infamous Alex DeLarge in Stanley Kubrick's controversial A Clockwork Orange (1971), a role that caused him to be typecast as a manic psychopathic villain. In early 1976, he spent nearly a year working on what would later be one of the most infamous films of all time, the semi-pornographic Caligula (1979), financed by Penthouse magazine founder Bob Guccione. Around that time, the British film industry collapsed, forcing him to flee to America to continue working. His first American film was Time After Time (1979). He then did Britannia Hospital (1982), the last part of Lindsay Anderson's working-class trilogy that started with If.... (1968). In the mid-1980s, the years of alcohol and drug abuse, including $1000 a week on cocaine, caught up with him. Years of abuse took its toll on him; his black hairs were now grey. Looking older than he really was, nobody wanted to cast him for playing younger roles. The big roles having dried up, he did many B-rated movies. The 1990s were kinder to him, though. In 1994, he was cast as Dr. Tolian Soran, the man who killed Captain James T. Kirk in Star Trek: Generations (1994). He was back on the track, playing villains again. He played another in the classic BBC miniseries Our Friends in the North (1996). Today, with more than 100 films under his belt, he is one of the greatest actors in America. He still does not have American citizenship, but he likes the no-nonsense American ways. He resides in the northern suburbs of Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMjQxNzczM15BMl5BanBnXkFtZTcwMTg3MTMwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000532","name":"Malcolm McDowell","nicknames":["Mick"],"idIMDB":"nm0000532"},"actorId":"nm0000532","character":"Col. F.E. Cochrane","urlCharacter":"http://www.imdb.com/character/ch0023557","main":true},{"actorName":"Ed Bernard","urlProfile":"http://www.imdb.com/name/nm0076204","urlPhoto":"","biography":{"dateOfBirth":"4 July 1939","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"6' (1.83 m)","bio":"Ed Bernard was born on July 4, 1939 in Philadelphia, Pennsylvania, USA. He is an actor, known for Police Woman (1974), Homeward Bound: The Incredible Journey (1993) and The White Shadow (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0076204","name":"Ed Bernard","idIMDB":"nm0076204"},"actorId":"nm0076204","character":"Sgt. Short","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Bernard","urlProfile":"http://www.imdb.com/name/nm0076251","urlPhoto":"","biography":{"dateOfBirth":"17 May 1938","placeOfBirth":" Chicago, Illinois, USA","height":"6' 2\" (1.88 m)","bio":"Jason Bernard was born on May 17, 1938 in Chicago, Illinois, USA. He was an actor, known for Liar Liar (1997), While You Were Sleeping (1995) and Herman's Head (1991). He was married to Debra. He died on October 16, 1996 in Burbank, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0076251","name":"Jason Bernard","idIMDB":"nm0076251"},"actorId":"nm0076251","character":"Mayor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mario Machado","urlProfile":"http://www.imdb.com/name/nm0532478","urlPhoto":"","biography":{"dateOfBirth":"22 April 1935","placeOfBirth":" Shanghai, China","bio":"Mario Machado has been a fixture of television, film, and radio for over thirty years, and as a news anchor, reporter, narrator, actor, commentator, and producer, he has worked in virtually all aspects of broadcasting. Born in Shanghai, China of both Chinese and Portuguese ancestry, Mario made television history when, in 1967, he became the first Chinese-American on-air television news reporter and anchor in Los Angeles and perhaps in the nation. In 1968 he signed on as a color commentator for CBS Sports and, as a soccer player himself, he revolutionized the world of sports commentating with his personal insight and his dramatic flair. One year later he made television history again when he became the first Consumer Affairs reporter in the nation for KNXT Los Angeles. His work as a producer and a reporter has earned him ten Emmy Award nominations and eight wins, most recently for his work on the television special \"U.S. Citizenship: A Dream Come True\", which was broadcast in over 120 countries. Not content to be limited to the newsroom, Mario has hosted daily talk radio shows on several Los Angeles stations, lent his voice as narrator to numerous documentaries, and hosted several television shows, including the award-winning medical investigation show Medix (1967) and the variety show Saturday Showcase (1998) Ever an avid soccer fan, he has been a commentator for the 1984 Olympics and several World Cups. As an actor, he has appeared in films directed by Carl Reiner, Joel Schumacher, Brian De Palma, and Sylvester Stallone, but he may be best known for his role as newsman Casey Wong in all three RoboCop films. In addition, he has been featured on a diverse number of top-rated television shows, including Mission: Impossible (1966), The Brady Bunch (1969), Murder, She Wrote (1984), and Beverly Hills, 90210 (1990)_. A tireless advocate of multiculturalism in both his professional and personal life, Mario's efforts have won him the John Anson Ford Humanitarian Award in 1994 and he was named Los Angeles County's Humanitarian of the Year in 1995. One of the recognitions that he is proudest of is being named a member of President Reagan's Child Safety Commission in 1986.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0532478","name":"Mario Machado","idIMDB":"nm0532478"},"actorId":"nm0532478","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Murtaugh","urlProfile":"http://www.imdb.com/name/nm0615428","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NzY5ODU3Nl5BMl5BanBnXkFtZTcwMTE0MDQzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 October 1942","placeOfBirth":" Chicago, Illinois, USA","birthName":"James Francis Murtaugh","bio":"James Murtaugh was born on October 28, 1942 in Chicago, Illinois, USA as James Francis Murtaugh. He is an actor, known for How to Lose a Guy in 10 Days (2003), Vanilla Sky (2001) and Out of Time (2003). He has been married to Alice Heid since May 15, 1971. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NzY5ODU3Nl5BMl5BanBnXkFtZTcwMTE0MDQzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0615428","name":"James Murtaugh","idIMDB":"nm0615428"},"actorId":"nm0615428","character":"Alf Hewitt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pat McNamara","urlProfile":"http://www.imdb.com/name/nm0573715","urlPhoto":"","biography":{"dateOfBirth":"22 July 1933","placeOfBirth":" New York City, New York, USA","bio":"Pat McNamara was born on July 22, 1933 in New York City, New York, USA. He is an actor, known for The Silence of the Lambs (1991), Fight Club (1999) and Sleepers (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0573715","name":"Pat McNamara","idIMDB":"nm0573715"},"actorId":"nm0573715","character":"Matusek","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Murdock","urlProfile":"http://www.imdb.com/name/nm0613789","urlPhoto":"","biography":{"dateOfBirth":"28 October 1922","placeOfBirth":" Ohio, USA","birthName":"John M. Murdock","bio":"Jack Murphy during the 1960's and 1970's played in commercials for \"Grandpas\" discount stores in the Midwest. He was well known and played a \"Grandpa\" type character complete with overalls, bald head, glasses and a country accent to complete his character. Very successful and well received by the viewing public his longevity was unparalleled.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0613789","name":"Jack Murdock","idIMDB":"nm0613789"},"actorId":"nm0613789","character":"Kress","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clifford A. Pellow","urlProfile":"http://www.imdb.com/name/nm0671234","urlPhoto":"","biography":{"dateOfBirth":"13 November 1928","placeOfBirth":" Windsor, Ontario, Canada","bio":"Clifford A. Pellow was born on November 13, 1928 in Windsor, Ontario, Canada. He is an actor, known for The Hustler (1961), Magnum Force (1973) and Blue Thunder (1983).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0671234","name":"Clifford A. Pellow","idIMDB":"nm0671234"},"actorId":"nm0671234","character":"Allen","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0085255","urlIMDB":"http://www.imdb.com/title/tt0085255","business":{"budget":{"money":"$22,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$8,258,149","country":"USA","day":"15","month":"05","year":"1983","remarks":"1,539 Screens"}],"gross":[{"money":"SEK","country":"4,741,822","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":[{"money":"$816,085","country":"USA","day":"17","month":"07","year":"1983","remarks":"550 Screens"},{"money":"$865,372","country":"USA","day":"10","month":"07","year":"1983","remarks":"734 Screens"},{"money":"$1,240,688","country":"USA","day":"04","month":"07","year":"1983","remarks":"805 Screens"},{"money":"$1,063,756","country":"USA","day":"26","month":"06","year":"1983","remarks":"770 Screens"},{"money":"$1,581,035","country":"USA","day":"19","month":"06","year":"1983","remarks":"1,057 Screens"},{"money":"$1,908,080","country":"USA","day":"12","month":"06","year":"1983","remarks":"1,205 Screens"},{"money":"$3,208,259","country":"USA","day":"05","month":"06","year":"1983","remarks":"1,416 Screens"},{"money":"$6,239,999","country":"USA","day":"30","month":"05","year":"1983","remarks":"1,555 Screens"},{"money":"$6,153,893","country":"USA","day":"22","month":"05","year":"1983","remarks":"1,539 Screens"}],"admissions":[{"money":"1,679,502","country":"France","day":"31","month":"12","year":"1983","remarks":""},{"money":"794,636","country":"Spain","day":"31","month":"12","year":"1983","remarks":""}],"productionDates":{"money":null,"country":null,"day":"28","month":"12","year":"1979","remarks":null},"filmingDates":[{"money":null,"country":null,"day":"11","month":"01","year":"1980","remarks":null},{"money":null,"country":null,"day":"29","month":"04","year":"1980","remarks":null}],"copyrightHolder":"Columbia Pictures Industries, Inc."},"technical":{"runtime":["1 hr 49 min (109 min)"],"soundMix":["70 mm 6-Track (70 mm prints)","Dolby (35 mm prints)"],"color":["Color (Technicolor)"],"aspectRatio":["2.20 : 1 (70 mm prints)","2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA (prints)"],"filmLength":["3,005 m (Sweden)"],"negativeFormat":["35 mm (Eastman 250T 5293)"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm (Eastman 5384)","70 mm (blow-up) (Eastman 5384)"]},"rating":"6.3","filmingLocations":[{"location":"Goodyear Tire & Rubber Plant, Los Angeles, California, USA"}],"rated":"R","awards":[{"award":"Academy Awards, USA 1984","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Film Editing","names":[{"name":"Frank Morriss","id":"nm0607359","role":null},{"name":"Edward M. Abroms","id":"nm0002155","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1984","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Candy Clark","id":"nm0163748","role":null}]}]},{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Science Fiction Film","names":[]},{"category":"Best Actor","names":[{"name":"Roy Scheider","id":"nm0001702","role":null}]}]}]}],"votes":"13,086","type":"Movie","companyCreditsSimple":[{"idCompany":"co0050868","name":"Columbia Pictures Corporation"},{"idCompany":"co0047780","name":"Rastar Pictures"}],"keywords":{"keywords":["helicopter","pilot","police helicopter","surveillance","police officer killed","evil man","murder of a police officer","acrobatic flight","animosity","los angeles police department","los angeles california","lapd","helicopter pilot","helicopter gunship","recording the villain","police chopper","peeping tom","murder","helicopter shot down","helicopter chase","exploding helicopter","advanced technology","observation","darkness","gatling gun","police","train","vietnam war veteran","cult film","exploding car","training","vulgar language","airplane shot down","aviation","car chase","hiding place","car run over","7 eleven","automatic weapon","two word title","post traumatic stress disorder","post traumatic stress","helicopter explosion","attack helicopter","bound and gagged","color in title","vietnam flashback","tv news","target shooting","sabotage","loop","jet fighter","helicopter crash","heat seeking missile","hit by a train","security","los angeles storm drain","conspiracy","nudity","female nudity"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:12:26"}}