{"data":{"movies":[{"title":"Tiger Warsaw","originalTitle":"","year":"1988","releaseDate":"19880512","directors":[{"name":"Amin Q. Chaudhri","id":"nm0154271"}],"writers":[{"name":"Roy London","id":"nm0518775"}],"runtime":"93 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA2NzA2NTM3NV5BMl5BanBnXkFtZTcwMjExMzgzMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama"],"plot":"Chuck brought sorrow to his family when he shot his father who is now a semi-invalid. After 15 years of self destruction, he returns home to seek forgiveness","simplePlot":"Chuck brought sorrow to his family when he shot his father who is now a semi-invalid. After 15 years of self destruction, he returns home to seek forgiveness","actors":[{"actorName":"Patrick Swayze","urlProfile":"http://www.imdb.com/name/nm0000664","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM2NjI0MjYyMV5BMl5BanBnXkFtZTYwMjY1ODMz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1952","placeOfBirth":" Houston, Texas, USA","birthName":"Patrick Wayne Swayze","height":"5' 10\" (1.78 m)","bio":"Patrick Wayne Swayze was born on August 18, 1952 in Houston, Texas, to Patsy Swayze (née Yvonne Helen Karnes), a choreographer, and Jesse Wayne Swayze, a chemical plant engineer draftsman. His mother owned a dance school in Houston, where Patrick was also a student. His father passed away in 1982. He graduated from Waltrip High School in Houston, and attended San Jacinto College in Pasadena, Texas. He married actress/dancer Lisa Niemi on June 12, 1975, whom he had known when she was 15 and a student at his mother's dance school. His New York City dance training included the Harkness Ballet School and Joffrey Ballet School. He first danced professionally as \"Prince Charming\" in \"Disney on Parade\". After a stint as \"Danny Zuko\" in the original Broadway production of \"Grease\", he made his film debut with a small role in Skatetown, U.S.A. (1979). He made his television debut in 1981 on M*A*S*H (1972), as a soldier diagnosed with leukemia. After many supporting roles in films and a lead role in the TV mini-series North and South (1985), he landed his breakthrough role as dance instructor \"Johnny Castle\" in the hit film Dirty Dancing (1987), for which he received a Golden Globe nomination. He received a second nomination for his portrayal of \"Sam Wheat\" in the blockbuster Ghost (1990). Ghost (1990) was the highest-grossing film of 1990, and at one point, the fourth highest-grossing film of all time. Unfortunately, he did not capitalize on its success. His subsequent films like La cité de la joie (1992), Tall Tale (1995), Black Dog (1998), and Waking Up in Reno (2002) did not fare well with critics or audiences. In December 2003, he returned to Broadway as a replacement for the lead role of \"Billy Flynn\" in the acclaimed revival of John Kander & Fred Ebb's musical, \"Chicago\". The production also went on tour in several cities of the United States, including Los Angeles. In January 2008, he was diagnosed with pancreatic cancer. He fought the illness for well over a year and was able to continue working, but died on September 14, 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM2NjI0MjYyMV5BMl5BanBnXkFtZTYwMjY1ODMz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000664","name":"Patrick Swayze","nicknames":["Buddy"],"idIMDB":"nm0000664"},"actorId":"nm0000664","character":"Chuck 'Tiger' Warsaw","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Piper Laurie","urlProfile":"http://www.imdb.com/name/nm0001453","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTEwMzg5MDU2N15BMl5BanBnXkFtZTcwMDY5NDQ5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 January 1932","placeOfBirth":" Detroit, Michigan, USA","birthName":"Rosetta Jacobs","height":"5' 4½\" (1.64 m)","bio":"Piper Laurie was born Rosetta Jacobs in Detroit, Michigan, on January 22, 1932, to Charlotte Sadie (Alperin) and Alfred Jacobs, a furniture dealer. Her father was a Polish Jewish immigrant and her mother was of Russian Jewish descent. Her father moved the family to Los Angeles, California, when she was 6-years-old. Rosetta was a pretty red-haired little girl, but very shy, so her parents sent her to weekly elocution lessons. In addition to her lessons in Hebrew school, she studied acting at a local acting school, and this eventually led to work at Universal Studios. Universal had signed her as a contract player when she was only 17-years-old, and changed her screen name to Piper Laurie. She was cast in the movie, Louisa (1950), and became very close friends with her costar, Ronald Reagan. She was then cast in Francis Goes to the Races (1951) with Donald O'Connor, Son of Ali Baba (1952) with Tony Curtis, and Ain't Misbehavin' (1955) with Rory Calhoun. The studio tried to enhance her image as an ingénue with press releases stating that she took milk baths and ate gardenia petals for lunch. Although she was making $2,000 per week, her lack of any substantial roles discouraged her so much that by 1955 when she received another script for a Western and \"another silly part in a silly movie\", she dropped the script in the fireplace, called her agent and told him she didn't care if they fired her, jailed her or sued her. From there, she went to New York City to study acting, and worked on live television, starring in The Hallmark Hall of Fame version of \"Twelfth Night\" (1957), \"The Days of Wine and Roses\" (1958) with Cliff Robertson, which debuted on Playhouse 90 on October 2, and as \"Kirsten\" in the Playhouse 90 version of \"Winterset\" (1959). In 1961, she got the part of Paul Newman's crippled girlfriend in the classic film, The Hustler (1961). She was nominated for an Academy Award for Best Actress for that role of \"Sarah Packard\". That same year, she was interviewed by a writer/reporter for the New York Herald Tribune, Joe Morgenstern. She liked his casual dress and lifestyle and, 9 months later, they were married. When she did not receive any substantial acting offers after The Hustler (1961), she retreated with her husband to Woodstock, New York, where she pursued domestic activities such as baking (her grandfather's trade) and raising her only daughter, Anne, born in 1971. In 1976, she accepted the role of \"Margaret White\", the eccentric religious zealot mother of a shy young psychic girl named Carrie (1976), played by Sissy Spacek. Piper received her second supporting Oscar nomination for this role. She and her husband divorced in 1981, she moved to Southern California and obtained many film and television roles. She got a third Oscar nomination for her role as \"Mrs. Norman\" in Children of a Lesser God (1986), and won an Emmy that same year for her acting in Promise (1986), a television movie with James Garner and James Woods. She has appeared in more than 60 films, from 1950 to the present. Ms. Laurie has appeared in many outstanding television shows from \"The Best of Broadway\" in 1954, to roles on \"Playhouse 90\" in 1956, roles on St. Elsewhere (1982), Murder, She Wrote (1984), Matlock (1986), Beauty and the Beast (1987), ER (1994), Diagnosis Murder (1993) and Frasier (1993). Her daughter, Anne Grace, has made her a grandmother, and though she lives in Southern California, she frequently visits her daughter in New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTEwMzg5MDU2N15BMl5BanBnXkFtZTcwMDY5NDQ5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001453","name":"Piper Laurie","nicknames":["Rosie"],"idIMDB":"nm0001453"},"actorId":"nm0001453","character":"Frances Warsaw","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lee Richardson","urlProfile":"http://www.imdb.com/name/nm0724673","urlPhoto":"","biography":{"dateOfBirth":"11 September 1926","placeOfBirth":" Chicago, Illinois, USA","bio":"Born in Chicago in 1926, Richardson trained for the stage at the Goodman Theatre there. After serving in the Army Air Corps during World War II, he moved to New York and worked in off-Broadway productions. In the 1950s, he worked on television drama programs. In the 1960s, he moved to Minneapolis where he was one of the founders of the Guthrie Theater. In addition to being a popular character actor, he was also a popular voice for television commercials and had more than 100 ads to his credit.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0724673","name":"Lee Richardson","idIMDB":"nm0724673"},"actorId":"nm0724673","character":"Michael Warsaw","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mary McDonnell","urlProfile":"http://www.imdb.com/name/nm0001521","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5ODc4MTcwM15BMl5BanBnXkFtZTgwNjI2Njk3NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1952","placeOfBirth":" Wilkes-Barre, Pennsylvania, USA","birthName":"Mary Eileen McDonnell","height":"5' 6\" (1.68 m)","bio":"Mary McDonnell is a two-time Oscar®-nominated actress, who is known for her character portrayals in both period and present-day screen roles. Mary Eileen McDonnell was born on April 28, 1952 in Wilkes-Barre, Pennsylvania, to Eileen (Mundy) and John McDonnell, a computer consultant, both of Irish descent. Mary was raised in Ithaca, New York. After graduating from the State University of New York at Fredonia, she attended drama school and joined the Long Wharf Theatre Company on the East Coast. It was not until 20 years after working on the theater stage that she had her breakthrough film role, in Kevin Costner's Dances with Wolves (1990), playing Stands with a Fist, a white woman raised by the Sioux Indians. McDonnell received an Academy Award nomination for the role, and also garnered a Best Actress Academy Award® nomination and Golden Globe nomination for her portrayal of a paraplegic soap opera star in John Sayles' critically acclaimed Passion Fish (1992). McDonnell's extensive list of film credits include the Lawrence Kasdan films Grand Canyon and Mumford; Sneakers, opposite Robert Redford, Sidney Poitier and Sir Ben Kingsley; Roland Emmerich's smash Independence Day, with Bill Pullman and Will Smith; acclaimed art house cult-hit Donnie Darko; and Margin Call, opposite Kevin Spacey, which also earned her the Robert Altman Award at the 2012 Independent Spirit Awards. On the small screen, McDonnell starred in four seasons on the Syfy Network's award-winning series Battlestar Galactica in her critically praised performance as the President Laura Roslin. The series earned a Peabody Award, and AFI deemed the series TV Program of the Year for two years in a row. McDonnell garnered an Emmy nomination for her recurring guest role on the television series ER. Some of her other television credits include the ABC hit-series Grey's Anatomy, the CBS series High Society, TNT's adaptation of Arthur Miller's The American Clock, the critically acclaimed CBS movie Behind The Mask and Lifetime's Two Small Voices. McDonnell received rave reviews for her performance opposite David Strathairn in Emily Mann's acclaimed adaptation of Chekhov's The Cherry Orchard. McDonnell began her career in theatre and has starred in a wide variety of both Broadway and off-Broadway productions. She received an Obie Award for her performance in Emily Mann's Still Life and has starred in off-Broadway productions such as Sam Shepard's Pulitzer Prize-winning Buried Child, John Patrick Shanley's Savage in Limbo, John O'Keefe's All Night Long, Michael Cristofer's Black Angel, Kathleen Tolan's A Weekend Near Madison, Paula Cizmar's Death of a Miner and Dennis McIntyre's National Anthem. Her Broadway credits include Tennessee Williams' Summer and Smoke, the title role in Wendy Wasserstein's Pulitzer Prize-winning The Heidi Chronicles and Emily Mann's Execution of Justice. Mary stars as Captain Sharon Raydor on the TNT's hit drama series Major Crimes, the follow-up to The Closer, in which McDonnell originated the role and for which she earned a Primetime Emmy® nomination. McDonnell received her first Oscar nomination and Golden Globe® nomination for her portrayal of . Mary lives in Pacific Palisades, California with her husband, actor Randle Mell, and their two children, Olivia and Michael.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5ODc4MTcwM15BMl5BanBnXkFtZTgwNjI2Njk3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001521","name":"Mary McDonnell","idIMDB":"nm0001521"},"actorId":"nm0001521","character":"Paula Warsaw","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barbara Williams","urlProfile":"http://www.imdb.com/name/nm0930062","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMTAwMTg1NF5BMl5BanBnXkFtZTcwMDI1MDkwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1953","placeOfBirth":" Vancouver Island, British Columbia, Canada","bio":"Barbara Williams was born in 1953 in Vancouver Island, British Columbia, Canada. She is known for her work on White House Down (2013), Mother Trucker: The Diana Kilmury Story (1996) and Thief of Hearts (1984).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMTAwMTg1NF5BMl5BanBnXkFtZTcwMDI1MDkwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0930062","name":"Barbara Williams","idIMDB":"nm0930062"},"actorId":"nm0930062","character":"Karen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bobby Di Cicco","urlProfile":"http://www.imdb.com/name/nm0223738","urlPhoto":"","biography":{"dateOfBirth":"1955","placeOfBirth":" Itasca, Illinois, USA","height":"5' 9\" (1.75 m)","bio":"Bobby Di Cicco is an American actor best known for his roles in the Robert Zemeckis movie I Wanna Hold Your Hand (1978), the Steven Spielberg comedy 1941 (1979) and the 'Samuel Fuller' war film The Big Red One (1980). Throughout the 1980s Di Cicco continued starring in such diverse films as Night Shift (1982) and Splash (1984) - both directed by Ron Howard - the John Carpenter-produced The Philadelphia Experiment (1984), the horror film The Supernaturals (1986) and alongside Patrick Swayze in the drama Tiger Warsaw (1988). Di Cicco continued acting until the mid-1990s. He has two daughters, Jessica DiCicco and Katie Di Cicco.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0223738","name":"Bobby Di Cicco","idIMDB":"nm0223738"},"actorId":"nm0223738","character":"Tony","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jenny Chrisinger","urlProfile":"http://www.imdb.com/name/nm0159636","urlPhoto":"","biography":{"bio":"Jenny Chrisinger is an actress and writer, known for Tiger Warsaw (1988), Diary of a Hitman (1991) and The Last Day of School (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0159636","name":"Jenny Chrisinger","idIMDB":"nm0159636"},"actorId":"nm0159636","character":"Val","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Patrick Gillis","urlProfile":"http://www.imdb.com/name/nm0319290","urlPhoto":"","biography":{"bio":"James Patrick Gillis is an actor, known for Tiger Warsaw (1988), Love or Money (1990) and Spenser: For Hire (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0319290","name":"James Patrick Gillis","idIMDB":"nm0319290"},"actorId":"nm0319290","character":"Roger","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michelle Glaven","urlProfile":"http://www.imdb.com/name/nm0165415","urlPhoto":"","biography":{"bio":"Michelle Glaven is an actress, known for Tiger Warsaw (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0165415","name":"Michelle Glaven","idIMDB":"nm0165415"},"actorId":"nm0165415","character":"Emily","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kevin Bayer","urlProfile":"http://www.imdb.com/name/nm0062947","urlPhoto":"","biography":{"bio":"Kevin Bayer is an actor, known for Tiger Warsaw (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0062947","name":"Kevin Bayer","idIMDB":"nm0062947"},"actorId":"nm0062947","character":"Robin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Beeson Carroll","urlProfile":"http://www.imdb.com/name/nm0140739","urlPhoto":"","biography":{"dateOfBirth":"1934","placeOfBirth":"","bio":"Beeson Carroll was born in 1934. He is an actor, known for One Life to Live (1968), Another World (1964) and Rounders (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0140739","name":"Beeson Carroll","idIMDB":"nm0140739"},"actorId":"nm0140739","character":"Uncle Gene","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sally-Jane Heit","urlProfile":"http://www.imdb.com/name/nm0374729","urlPhoto":"","biography":{"bio":"Sally-Jane Heit is an actress, known for The Secret of My Succe$s (1987), Tiger Warsaw (1988) and The Paper (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0374729","name":"Sally-Jane Heit","idIMDB":"nm0374729"},"actorId":"nm0374729","character":"Aunt Barbara","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kaye Ballard","urlProfile":"http://www.imdb.com/name/nm0050639","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MzAyOTUzNF5BMl5BanBnXkFtZTcwMTg0MzQ1MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 November 1925","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Catherine Gloria Balotta","bio":"Singing funny girl Kaye Ballard was born to perform...and perform she has in a career now broaching seven decades. With a strong comedy background and tunnel mouth to rival Martha Raye, the broad and bouncy trouper has drawn laughs on the musical stage, in night clubs, in recordings and on TV. As the archetypal over-emotive, knuckle-biting Italian wife and mama, the octogenarian continues to tickle the funny bone with her earthy brand of comedy while alternately touching hearts in song. She was born Catherine Gloria Balotta, in Cleveland, Ohio, the daughter of an Italian immigrant. A deep desire to perform had already struck by the time she was five years old. A typical class clown during her high school years, she began to compile a number of star impressions for her act. In her teens she performed in a Cleveland USO stage production of \"Stage Door Canteen\" (1941), and soon set out on her own. Earning a job in 1943 touring with Spike Jones and His Orchestra for two years as his featured vocalist and flute/tuba player(!), Kaye eventually set up camp in New York and made her Broadway debut with the revue \"Three to Make Ready\" (1946). From there she showcased in the musicals \"Once in a Lifetime,\" \"Touch and Go\" (in London), \"Annie Get Your Gun\" and the burlesque show \"Top Banana\". During this time she built up a strong song-and-comedy reputation for herself on the nightclub circuit, eventually playing the country's best cabarets/niteries including The Bon Soir, Persian Room and Blue Angel in New York, The Hungry i in San Francisco, and Mr. Kelly's in Chicago. During the 1950s and 1960s, Kaye graced nearly every talk/variety show there was including those for Ed Sullivan, Jack Paar, Johnny Carson, Steve Allen, Perry Como, Red Skelton, Carol Burnett, Merv Griffin and Mike Douglas. Two of her classic TV roles were her ugly stepsister Portia (the other sister being fellow scene-stealer Alice Ghostley) in the Julie Andrews version of Cinderella (1957), and as one of The Mothers-In-Law (1967) (the other being fellow veteran Eve Arden) in the popular but short-lived sitcom produced by Desi Arnaz. Both showcases catered perfectly to Kaye's brash comedy instincts. She also pitched in as a meddling second banana for Doris Day for one season of the star's 70s TV show. On stage Kaye had Broadway audiences rolling in the aisles with her Helen of Troy in the 1954 musical \"The Golden Apple\" while introducing the classic song standard \"Lazy Afternoon.\" Other raves came in the form of \"Wonderful Town\" (1958), \"Carnival\" (1961) and Cole Porter Revisited\" (1965). On the flip side of the coin, she played a frumpy Lola Delaney in a badly misguided musical version of \"Come Back, Little Sheba\" (entitled \"Sheba\") in 1974, and also tried unsuccessfully to bring life to the beloved, indomitable Molly Goldberg radio/TV character in the Broadway musical \"Molly\" (1973); the show lasted a mere two months. Kaye was much more at home sinking her teeth into two of theater's most impregnable females: Mama Rose in \"Gypsy\" and Dolly Levi in \"Hello, Dolly!\" With an out-stretched personality on par with Carol Channing and Ethel Merman, films never became a suitable medium. Although Kaye gave a standout debut performance in The Girl Most Likely (1958), starring Jane Powell, she was seldom seen after that. Her sprinkling of supports included A House Is Not a Home (1964) with Shelley Winters, Which Way to the Front? (1970) starring Jerry Lewis, Freaky Friday (1976) with young Jodie Foster, and, perhaps more notably, in The Ritz (1976) starring Rita Moreno and Jerry Stiller in which she got to play her patented haranguing wife. In later years, Kaye dominated the stage with feisty work in \"Nunsense\", \"The Pirates of Penzance\" (a Broadway replacement), \"High Spirits\" (as Madame Arcati), \"Funny Girl\" (as Mrs. Brice), \"The Full Monty\" and the female version of \"The Odd Couple\". In recent times, the Rancho Mirage, California resident has performed with the Palm Spring Follies show is out-and-about doing her one-woman cabaret show belting out the good old songs and retracing her burlesque-styled comedy roots. A survivor of breast cancer, the never-married veteran has shown no signs of slowing down.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MzAyOTUzNF5BMl5BanBnXkFtZTcwMTg0MzQ1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0050639","name":"Kaye Ballard","idIMDB":"nm0050639"},"actorId":"nm0050639","character":"Aunt Thelma","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Wood","urlProfile":"http://www.imdb.com/name/nm0940052","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA4NDc1MDg2NV5BMl5BanBnXkFtZTgwMjA5Nzc3ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 April 1963","placeOfBirth":" Long Beach, California, USA","height":"6' 2½\" (1.89 m)","bio":"Tom Wood was born on April 19, 1963 in Long Beach, California, USA. He is an actor, known for The Fugitive (1993), Apollo 13 (1995) and U.S. Marshals (1998). He has been married to Jenifer since 1996. They have four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA4NDc1MDg2NV5BMl5BanBnXkFtZTgwMjA5Nzc3ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0940052","name":"Tom Wood","idIMDB":"nm0940052"},"actorId":"nm0940052","character":"Lt. Fontana","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cynthia Lammel","urlProfile":"http://www.imdb.com/name/nm0483568","urlPhoto":"","biography":{"bio":"Cynthia Lammel is an actress, known for Tiger Warsaw (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0483568","name":"Cynthia Lammel","idIMDB":"nm0483568"},"actorId":"nm0483568","character":"Paula's Secretary","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0096267","urlIMDB":"http://www.imdb.com/title/tt0096267","business":{"budget":null,"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1987/\">1987</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 33 min (93 min) (USA)"],"soundMix":["Mono"],"color":["Color (Technicolor)"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"4.7","filmingLocations":[{"location":"Pittsburgh, Pennsylvania, USA"}],"rated":"R","awards":[],"votes":"589","type":"Movie","companyCreditsSimple":[{"idCompany":"co0001775","name":"Continental Film Group Ltd."}],"keywords":{"keywords":["redemption","family relationships","animal in title","independent film","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:33:11"}}