{"data":{"movies":[{"title":"The Other Half","originalTitle":"","year":"1919","releaseDate":"19190818","directors":[{"name":"King Vidor","id":"nm0896542"}],"writers":[{"name":"King Vidor","id":"nm0896542"}],"runtime":"50 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMGJhYTktNTRmOC00NjU3LWI0ODEtNjk5MjQyYjBiMDA0L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1.jpg","countries":["USA"],"languages":[],"genres":["Drama"],"simplePlot":"","actors":[{"actorName":"Florence Vidor","urlProfile":"http://www.imdb.com/name/nm0896538","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3OTg1MTg3NF5BMl5BanBnXkFtZTgwODk1OTY3MTE@._V1._CR31.883331298828125,55.53334045410156,338,427_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 July 1895","placeOfBirth":" Houston, Texas, USA","birthName":"Florence Iona Arto","height":"5' 4½\" (1.64 m)","bio":"Houston-born-and-bred Florence Vidor was one of the great beauties of early Hollywood. But while her photogenic looks went a long way, audiences would not get to enjoy or really experience her voice as she abruptly left the silver screen after her first disastrous attempt at a talking picture. Born Florence Arto on July 23, 1895, she was the daughter of John F. Arto, a realtor, and his wife Ida. Educated in both public and finishing schools, she was also a student at the Convent of the Sacred Heart for a time. Her fate was sealed after an eventful but happenstance meeting of two local aspiring filmmakers--future directors Edward Sedgwick and King Vidor. Vidor, a freelance photographer, cast Florence in his very first two-reel picture, although she had no real designs on being an actress. The two went on to become a romantic item and married in 1915. They would have one child, Suzanne Vidor Parry, in 1919. King set his sites on Hollywood and the couple made the big move, financing their trip by filming travelogue footage for the Ford Motor Co. Settling in Santa Monica, the couple soon found employment at Vitagraph Studios. Florence knew actress Corinne Griffith from her days in Houston and was introduced around the sets. The studio was quite taken by her exquisite beauty and quickly signed her to a contract, starting with some minor roles in such comedy shorts as The Yellow Girl (1916) and Curfew at Simpton Center (1916). In the meantime, husband King sought work as a scriptwriter and occasional movie extra. Florence first turned heads portraying the tragic seamstress \"Mimi\" in A Tale of Two Cities (1917). Audiences took notice and the beautiful brunette was immediately promoted to leading lady status opposite such established stars as Sessue Hayakawa and chic \"drag\" performer Julian Eltinge. She and Hayakawa made several pictures together, including Hashimura Togo (1917), The Secret Game (1917) and The White Man's Law (1918), among others. With the popular Eltinge--who often out dressed his leading ladies--the actress graced the comedies The Countess Charming (1917) and The Widow's Might (1918). Within a short time she was starring in quality pictures for both William C. de Mille and his brother, Cecil B. DeMille, but still preferred to work for her husband, King, who had by this time established himself as a formidable director after opening his own studio in 1919. A mature, opulent presence, Florence became a huge star under her husband's guidance, operating under the banners of King Vidor Productions and Florence Vidor Productions. With such silent classics as The Other Half (1919), Poor Relations (1919), The Family Honor (1920), The Jack-Knife Man (1920), Real Adventure (1922), Dusk to Dawn (1922) and Conquering the Woman (1922), Florence came to the forefront. Her best-regarded film of that period, was King's comedy-drama Alice Adams (1923), remade successfully a decade or so later by Katharine Hepburn. King and Florence divorced in 1924 and Florence went on to appear for other well-known directors, notably Ernst Lubitsch, in such glossy pictures as The Marriage Circle (1924) and The Patriot (1928). She also portrayed famous female Revolutionary War character Barbara Frietchie in Barbara Frietchie (1924), but she earned most of her kudos specializing in sophisticated comedy. She was well represented in that genre with Marry Me (1925), The Grand Duchess and the Waiter (1926) and The Magnificent Flirt (1928). Her stylish humor coupled with a charming sensitivity put her squarely on top throughout most of the 1920s opposite such other well-tailored charmers as Adolphe Menjou, Clive Brook and William Powell. Florence's first major talking film would also become her last. The unhappy experience and end result of working on Chinatown Nights (1929), which used highly experimental sound equipment, was enough to convince her to leave films altogether. By that time Florence had married a second time to famed violinist Jascha Heifetz and preferred to raise a family. The couple went on to have two children. Following her divorce from Heifetz in 1946, Florence continued to remain completely out of the limelight. She later moved to Pacific Palisades, California, and stayed there for the remainder of her life, succumbing to heart failure in 1977 at age 82.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3OTg1MTg3NF5BMl5BanBnXkFtZTgwODk1OTY3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0896538","name":"Florence Vidor","idIMDB":"nm0896538"},"actorId":"nm0896538","character":"Katherine Boone","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Meredith","urlProfile":"http://www.imdb.com/name/nm0580566","urlPhoto":"","biography":{"dateOfBirth":"27 August 1894","placeOfBirth":" Knoxville, Pennsylvania, USA","bio":"Actor Charles Meredith had the requisite good looks to become a popular silent film leading man. Tall, dark and exceedingly good-looking with distinctive high-parted hair, he played opposite Blanche Sweet, Mary Miles Minter, Florence Vidor, Katherine MacDonald, and other top stars of the day in both romantic drama and comedies. In 1924, he abandoned his film career for fulfillment on the stage, not returning to the cinema until 1947 wherein he played a number of small roles with an upstanding, prideful nature (justices, commissioners, reverends, admirals, etc.) Toward the end of his career, he turned to TV as well, notably as Secretary Drake in the Rocky Jones, Space Ranger (1954) series. He died at age 70 in 1964.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0580566","name":"Charles Meredith","idIMDB":"nm0580566"},"actorId":"nm0580566","character":"Donald Trent","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zasu Pitts","urlProfile":"http://www.imdb.com/name/nm0686032","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNzA5MjQzM15BMl5BanBnXkFtZTgwNDE0OTg0MzE@._V1._CR94,138,542,722_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 January 1894","placeOfBirth":" Parsons, Kansas, USA","birthName":"Eliza Susan Pitts","height":"5' 6\" (1.68 m)","bio":"Classic comedienne Zasu Pitts, of the timid, forlorn blue eyes and trademark woebegone vocal pattern and fidgety hands, was born to Rulandus and Nellie (Shay) Pitts, the third of four children on January 3, 1894. Her aged New York-native father, who lost a leg back in the Civil War era, had settled the family in Kansas by the time ZaSu was born but relocated to Santa Cruz, California, when she was 9, seeking a warmer climate and better job opportunities. She attended Santa Cruz High and somehow rose above her excessively shy demeanor to join the school's drama department. She went on to cultivate what was once deemed her negative qualities by making a career out of her unglamorous looks and wallflower tendencies in scores and scores of screwball comedy treasures. Pitts made her stage debut in 1915 and was discovered two years later by pioneer screenwriter Frances Marion, who got her work, though in small, obscure parts, in vehicles for such Paramount stars as Douglas Fairbanks and Mary Pickford . Mary cast her in another of her films to greater effect and the rest is history. She grew in popularity following a series of Universal one-reeler comedies and earned her first feature-length lead in King Vidor's Better Times (1919). She met and married matinée idol Tom Gallery in 1920 and paired up with him in several films, including Bright Eyes (1921), Heart of Twenty (1920), Patsy (1921) and A Daughter of Luxury (1922). Their daughter Ann was born in 1922. In 1924 the actress, now a reputable comedy farceur, was given the greatest tragic role of her career in 'Erich von Stroheim'''s epic classic Greed (1924), an over-four-hour picture cut down by the studio to less than two. The surprise casting initially shocked Hollywood but showed that she could draw tears and pathos as well as laughs with her patented doleful demeanor. The movie has grown tremendously in reputation over time, although it failed initially at the box office due to its extensive cutting. Trading off between comedy shorts and features, she earned additional kudos in such heavy dramas as Sins of the Fathers (1928), The Wedding March (1928), also helmed by Von Stroheim, and War Nurse (1930). Still, by the advent of sound, which was an easy transition for Pitts, she was fully secured in comedy. One bitter and huge disappointment for her was when she was replaced in the war classic All Quiet on the Western Front (1930) by Beryl Mercer after her initial appearance drew unintentional laughs from preview audiences. She decided, however, to make the most of a not-so-bad situation. She had them rolling in the aisles in such wonderful and wacky entertainment as The Dummy (1929), Finn and Hattie (1931), The Guardsman (1931), Blondie of the Follies (1932), Sing and Like It (1934) and Ruggles of Red Gap (1935). She also excelled deliciously in her comedy partnerships with stunning blonde comedienne Thelma Todd (in short films) and gangly comedian 'Slim Summerville' (in features). Breezing through the 1940s in assorted films, she found work in vaudeville and on radio as well, trading quivery banter with 'Bing Crosby', Al Jolson and Rudy Vallee, among others. She also tackled Broadway, making her debut in the mystery \"Ramshackle Inn\" in 1944. The play, which was written especially for her, fared quite well and, as a result, took the show on the road frequently in later years. Postwar films continued to give Pitts the chance to play comic snoops and flighty relatives in such quality fare as Life with Father (1947), but into the 1950s she started focusing on TV. This culminated in her best known series role, playing second banana to cruise line social director Gale Storm in The Gale Storm Show: Oh! Susanna (1956) [aka \"Oh, Susannah\"]. As Nugie, the shipboard beautician and partner-in-crime, she made the most of her timid, twitchy mannerisms. Sadly, ill health dominated Pitts' later years when she was diagnosed with cancer in the mid-1950s. She braved on and continued to work until the very end, making brief appearances in The Thrill of It All (1963) and the all-star comedy epic It's a Mad Mad Mad Mad World (1963). Having married a second time after her divorce from Gallery, the beloved sad sack comedienne passed away at age 69 on June 6, 1963, leaving behind a gallery of scene-stealing worrywarts for all to enjoy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNzA5MjQzM15BMl5BanBnXkFtZTgwNDE0OTg0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0686032","name":"Zasu Pitts","idIMDB":"nm0686032"},"actorId":"nm0686032","character":"Jennie Jones, The Jazz Kid","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Butler","urlProfile":"http://www.imdb.com/name/nm0124877","urlPhoto":"","biography":{"dateOfBirth":"17 December 1894","placeOfBirth":" San Francisco, California, USA","height":"6' (1.83 m)","bio":"David Butler was born on December 17, 1894 in San Francisco, California, USA. He was a director and actor, known for Leave It to Beaver (1957), Calamity Jane (1953) and Road to Morocco (1942). He died on June 14, 1979 in Arcadia, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0124877","name":"David Butler","nicknames":["Dave"],"idIMDB":"nm0124877"},"actorId":"nm0124877","character":"Cpl. Jimmy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alfred Allen","urlProfile":"http://www.imdb.com/name/nm0020251","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTI1ODY5ZDctMGQ2YS00YWM0LWI5NzItYTE5MzllM2E1MTg1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1866","placeOfBirth":" Alfred, New York, USA","height":"6' (1.83 m)","bio":"Alfred Allen was born on April 8, 1866 in Alfred, New York, USA. He was an actor, known for Miss Blossom (1916), The Grub Stake (1923) and Heartaches (1916). He died on June 18, 1947 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTI1ODY5ZDctMGQ2YS00YWM0LWI5NzItYTE5MzllM2E1MTg1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0020251","name":"Alfred Allen","idIMDB":"nm0020251"},"actorId":"nm0020251","character":"J. Martin Trent","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frances Raymond","urlProfile":"http://www.imdb.com/name/nm0713259","urlPhoto":"","biography":{"dateOfBirth":"24 May 1869","placeOfBirth":" Salem, Massachusetts, USA","birthName":"Mary Frances Raymond","bio":"Frances Raymond was born on May 24, 1869 in Salem, Massachusetts, USA as Mary Frances Raymond. She was an actress, known for Seven Chances (1925), The Fable of the Twelve-Cylinder Speed of the Leisure Class (1917) and The Fable of the Home Treatment and the Sure Cure (1915). She was married to David Henderson. She died on June 18, 1961 in Hollywood, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0713259","name":"Frances Raymond","idIMDB":"nm0713259"},"actorId":"nm0713259","character":"Mrs. Boone","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hugh Saxon","urlProfile":"http://www.imdb.com/name/nm0768328","urlPhoto":"","biography":{"dateOfBirth":"14 January 1869","placeOfBirth":" New Orleans, Louisiana, USA","bio":"Hugh Saxon was born on January 14, 1869 in New Orleans, Louisiana, USA. He was an actor, known for Seven Years Bad Luck (1921), The Vision (1926) and The Fighting Boob (1926). He was married to Ellen. He died on May 14, 1945 in Beverly Hills, Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0768328","name":"Hugh Saxon","idIMDB":"nm0768328"},"actorId":"nm0768328","character":"James Bradley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thomas Jefferson","urlProfile":"http://www.imdb.com/name/nm0420232","urlPhoto":"","biography":{"dateOfBirth":"10 September 1856","placeOfBirth":" New York City, New York, USA","height":"5' 6\" (1.68 m)","bio":"Thomas Jefferson was born on September 10, 1856 in New York City, New York, USA. He was an actor, known for Forbidden (1932), The Grim Game (1919) and Rip Van Winkle (1921). He was married to Daisy Jefferson. He died on April 2, 1932 in Hollywood, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0420232","name":"Thomas Jefferson","idIMDB":"nm0420232"},"actorId":"nm0420232","character":"Caleb Fairman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arthur Redden","urlProfile":"http://www.imdb.com/name/nm0714680","urlPhoto":"","biography":{"dateOfBirth":"17 July 1908","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Arthur Lawrence Redden","bio":"Arthur Redden was born on July 17, 1908 in Boston, Massachusetts, USA as Arthur Lawrence Redden. He was an actor, known for Way of the Strong (1919), The Road to Divorce (1920) and The Other Half (1919). He died on January 25, 1958 in Napa, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0714680","name":"Arthur Redden","idIMDB":"nm0714680"},"actorId":"nm0714680","character":"The Star Reporter","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0010534","urlIMDB":"http://www.imdb.com/title/tt0010534","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Brentwood Film Corporation, 7 August 1919, LU14148"},"technical":{"runtime":["50 min"],"soundMix":["Silent"],"color":["Black and White"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":["(5 reels) (USA)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.0","filmingLocations":[],"awards":[],"votes":"6","type":"Movie","companyCreditsSimple":[{"idCompany":"co0050993","name":"Brentwood Film Corporation"}],"keywords":{"keywords":["newspaper","mill worker","social","labor strike","employer employee relationship","machinist","class distinction"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 03:35:00"}}