{"data":{"movies":[{"title":"Curse of the Pink Panther","originalTitle":"","year":"1983","releaseDate":"19830812","directors":[{"name":"Blake Edwards","id":"nm0001175"}],"writers":[{"name":"Blake Edwards","id":"nm0001175"},{"name":"Geoffrey Edwards","id":"nm0250005"}],"runtime":"109 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4OTE5MjYyNF5BMl5BanBnXkFtZTcwNzY2MTMyNA@@._V1.jpg","countries":["UK","USA"],"languages":["English"],"genres":["Comedy","Crime","Mystery"],"plot":"Inspector Clouseau disappears, and the Surete wants the world's second best detective to look for him. However, Clouseau's enemy, Dreyfus, rigs the Surete's computer to select, instead, the world's WORST detective, NYPD Sgt. Clifton Sleigh. Sleigh obtusely bungles his way past assassins and corrupt officials as though he were Clouseau's American cousin.","simplePlot":"Inspector Clouseau disappears, and the Surete wants the world's second best detective to look for him. However, Clouseau's enemy, Dreyfus, rigs the Surete's computer to select, instead, the... ","actors":[{"actorName":"David Niven","urlProfile":"http://www.imdb.com/name/nm0000057","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU3NzU3NjIyNF5BMl5BanBnXkFtZTcwNDUxMTMyNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 March 1910","placeOfBirth":" London, England, UK","birthName":"James David Graham Niven","height":"6' (1.83 m)","bio":"David Niven was named after the Saint's Day on which he was born, St. David, patron Saint of Wales. He attended Stowe School and Sandhurst Military Academy and served for two years in Malta with the Highland Light Infantry. At the outbreak of World War II, although a top-line star, he re-joined the army (Rifle Brigade). He did, however, consent to play in two films during the war, both of strong propaganda value--Spitfire (1942) and The Way Ahead (1944). In spite of six years' virtual absence from the screen, he came in second in the 1945 Popularity Poll of British film stars. On his return to Hollywood after the war he was made a Legionnaire of the Order of Merit (the highest American order that can be earned by an alien). This was presented to Lt. Col. David Niven by Gen. Dwight D. Eisenhower.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU3NzU3NjIyNF5BMl5BanBnXkFtZTcwNDUxMTMyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000057","name":"David Niven","nicknames":["Niv"],"idIMDB":"nm0000057"},"actorId":"nm0000057","character":"Sir Charles Litton","urlCharacter":"http://www.imdb.com/character/ch0005469","main":true},{"actorName":"Robert Wagner","urlProfile":"http://www.imdb.com/name/nm0001822","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MjU3NTk0MF5BMl5BanBnXkFtZTcwODAzODI0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1930","placeOfBirth":" Detroit, Michigan, USA","birthName":"Robert John Wagner","height":"5' 11\" (1.8 m)","bio":"Robert John Wagner, Jr. was born in Detroit, Michigan, to Thelma Hazel Alvera (Boe), a telephone operator, and Robert John Wagner, Sr., a traveling salesman. His paternal grandparents were German and his maternal grandparents were Norwegian. His family moved to Los Angeles when he was seven. Always wanting to be an actor, he held a variety of jobs while pursuing his goal, but it was while dining with his parents at a restaurant in Beverly Hills that he was \"discovered\" by a talent scout. After making his uncredited screen debut in The Happy Years (1950), Wagner was signed by 20th Century Fox, which carefully built him up toward stardom. He played romantic leads with ease, but it wasn't until he essayed the two-scene role of a shellshocked war veteran in With a Song in My Heart (1952) that studio executives recognized his potential as a dramatic actor. He went on to play the title roles in Prince Valiant (1954) and The True Story of Jesse James (1957), and portrayed a cold-blooded murderer in A Kiss Before Dying (1956). In the mid-'60s, however, his film career skidded to a stop after The Pink Panther (1963). Several years of unemployment followed before Wagner made a respectable transition to television as star of the lighthearted espionage series It Takes a Thief (1968) (1968-1970). He also starred in the police series Switch (1975), but Wagner's greatest success was opposite Stefanie Powers in the internationally popular Hart to Hart (1979), which ran from 1979 through 1984 and has since been sporadically revived in TV-movie form (a 1986 series, Lime Street (1985), was quickly canceled due to the tragic death of Wagner's young co-star, Samantha Smith). Considered one of Hollywood's nicest citizens, Robert Wagner has continued to successfully pursue a leading man career; he has also launched a latter-day stage career, touring with Stefanie Powers in the readers' theater presentation \"Love Letters\". He found success playing Number Two, a henchman to Dr. Evil in the blockbuster trilogy Austin Powers: International Man of Mystery (1997), Austin Powers: The Spy Who Shagged Me (1999), and Austin Powers in Goldmember (2002), and in 2007 he began playing Teddy, a recurring role on the hit CBS series Two and a Half Men (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MjU3NTk0MF5BMl5BanBnXkFtZTcwODAzODI0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001822","name":"Robert Wagner","nicknames":["RJ","The Brylcreem Kid"],"idIMDB":"nm0001822"},"actorId":"nm0001822","character":"George Lytton","urlCharacter":"http://www.imdb.com/character/ch0005463","main":true},{"actorName":"Herbert Lom","urlProfile":"http://www.imdb.com/name/nm0007042","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg5OTc0OTA3Ml5BMl5BanBnXkFtZTcwOTIyOTYyMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1917","placeOfBirth":" Prague, Bohemia, Austria-Hungary [now Czech Republic]","birthName":"Herbert Charles Angelo Kuchacevich ze Schluderpacheru","height":"5' 7¾\" (1.72 m)","bio":"Born September 11, 1917, Herbert Lom made his film debut in the Czech film Woman Below the Cross (1937) and played supporting and, occasionally, lead roles. His career picked up in the 1940s and he played, among other roles, Napoleon Bonaparte in The Young Mr. Pitt (1942) (and, again, in War and Peace (1956)). In a rare starring role, Lom played twin trapeze artists in Dual Alibi (1947). He continued into the 1950s with roles opposite Alec Guinness and Peter Sellers in The Ladykillers (1955) and Robert Mitchum, Jack Lemmon and Rita Hayworth in Fire Down Below (1957). His career really took off in the 1960s and he got the title role in Hammer Films' production of The Phantom of the Opera (1962). He also played \"Captain Nemo\" in Mysterious Island (1961) and landed supporting parts in Le Cid (1961) and an especially showy role in Spartacus (1960) as a pirate chieftain contracted to transport Spartacus' army away from Italy. The 1960s was also the decade in which Lom secured the role for which he will always be remembered: Peter Sellers' long-suffering boss, Commissioner Charles Dreyfus, in the \"Pink Panther\" films, in which he pulled off the not-inconsiderable feat of stealing almost every scene he and Sellers were in--a real accomplishment, considering what a veteran scene-stealer Sellers was. However, Lom did not concentrate solely on a film career. He had become a familiar face to British television viewers when he starred as Dr. Roger Corder in the series The Human Jungle (1963). He moved into horror films in the 1970s, with parts in Asylum (1972) and And Now the Screaming Starts! (1973). He played Prof. Abraham Van Helsing opposite Christopher Lee in Count Dracula (1970), matching wits against the sinister vampire himself. Lom appeared as one of the ten victims in Ten Little Indians (1974), playing the drunken Dr. Edward Armstrong. His career continued into the 1980s, a standout role being that of Christopher Walken's sympathetic doctor in The Dead Zone (1983). He also played opposite Walter Matthau in Hopscotch (1980) and returned to the murder mystery Ten Little Indians (1989), this time playing The General. Lom has been taking it easy since then, though he returned to his familiar role of Commissioner Dreyfus in Le fils de la panthère rose (1993). He has always been a reliable and eminently watchable actor, unfortunately not receiving the stardom he probably should have. Herbert Lom died in his sleep at age 95 on September 27, 2012, in London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg5OTc0OTA3Ml5BMl5BanBnXkFtZTcwOTIyOTYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0007042","name":"Herbert Lom","idIMDB":"nm0007042"},"actorId":"nm0007042","character":"Chief Insp. Charles LaRousse Dreyfus","urlCharacter":"http://www.imdb.com/character/ch0005474","main":true},{"actorName":"Joanna Lumley","urlProfile":"http://www.imdb.com/name/nm0525921","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5Mjg1NDM0Nl5BMl5BanBnXkFtZTcwOTA2MTMyNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 May 1946","placeOfBirth":" Srinagar, Jammu and Kashmir, British India","birthName":"Joanna Lamond Lumley","height":"5' 8\" (1.73 m)","bio":"Joanna Lumley was born in Kashmir, India, on 1st May 1946. Her father was a major in the Gurkha Rifles, and she spent most of her early childhood in the Far East where her father was posted. An aspiring actress, she first came to fame as a model in London's swinging 1960s, where she was photographed by the greats, including her friend, the late Patrick Lichfield. She was designer Jean Muir's muse and house model for several years before carving a career as a freelance model where she became one of the top ten most-booked models of the 1960s. Lumley's breakthrough role was as Purdey in Chapeau melon et bottes de cuir (1976), a role for which over 800 girls auditioned. Purdey propelled Lumley to instant fame and created one of the \"must-have\" hairstyles of the 1970s -- the Purdey bob. Lumley became a pin-up figure for a generation of British males who grew up watching her as the high-kicking action girl. Other roles followed, most notably as Sapphire in Sapphire & Steel (1979) opposite David McCallum -- a sci-fi precursor to The X-Files (1993) and an under-rated gem of a series which has gained a cult following in recent years, despite the fact it has only ever been shown ONCE on terrestrial TV. During the 1980s, Lumley returned to the theater, making notable appearances as \"Hedda Gabler\" and as \"Elvira\" in \"Blithe Spirit\" -- a role that seems tailor-made for her. Lumley also made appearances in several films, including Trail of the Pink Panther (1982), Curse of the Pink Panther (1983), and a screen-stealing role in Shirley Valentine (1989). It was her reinvention as a comic actress in Absolutely Fabulous (1992) that shot Lumley to wider international acclaim. Her role as Patsy in Absolutely Fabulous (1992) is regarded as one of the greatest female comic performances ever, earning Lumley a stream of awards, including several BAFTAs. Since Absolutely Fabulous (1992), Lumley has cemented her role as one of the UK's most-loved & respected actresses. She is rarely off UK TV screens and has also built a successful film career as a character/voice-over actress. She recently teamed up with the writer/director Hugo Blick for the series of acclaimed monologues Up in Town (2002) which were critically regarded as the performance of a lifetime, and the recent Sensitive Skin (2005). It has been announced that she will be making a return to the stage for the first time in over a decade in 2007 in a new production of Anton Chekhov's \"The Cherry Orchard\" directed by Sir Jonathan Miller.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5Mjg1NDM0Nl5BMl5BanBnXkFtZTcwOTA2MTMyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0525921","name":"Joanna Lumley","idIMDB":"nm0525921"},"actorId":"nm0525921","character":"Countess Chandra","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Capucine","urlProfile":"http://www.imdb.com/name/nm0001010","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMTc5NjkwMF5BMl5BanBnXkFtZTcwMzYxMTMyNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 January 1928","placeOfBirth":" Saint-Raphaël, Var, France","birthName":"Germaine Lefebvre","height":"5' 7\" (1.7 m)","bio":"With classic patrician features and an independent, non-conformist personality, Capucine began her film debut in 1949 at the age of 21 with an appearance in the film Rendez-vous de juillet (1949). She attended school in France and received a BA degree in foreign languages. Married for six months in her early twenties, she never remarried. In 1957, she was discovered by director Charles K. Feldman while working as a high-fashion model for Givenchy in Paris and was brought to Hollywood to study acting under Gregory Ratoff. She was put under contract by Columbia studios in 1958 and had her first leading part in the movie Song Without End (1960). She made six more major movies in the early to mid 1960s, two of which (The Lion (1962) and The 7th Dawn (1964)) starred William Holden, with whom she had a two-year affair. Moving from Hollywood to a penthouse apartment in Lausanne, Switzerland, in 1962, she continued making movies, mostly in Europe, until her suicide in 1990.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMTc5NjkwMF5BMl5BanBnXkFtZTcwMzYxMTMyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001010","name":"Capucine","nicknames":["Cap","Cappy"],"idIMDB":"nm0001010"},"actorId":"nm0001010","character":"Lady Simone Litton","urlCharacter":"http://www.imdb.com/character/ch0005475","main":true},{"actorName":"Robert Loggia","urlProfile":"http://www.imdb.com/name/nm0005162","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NTQzODU0Nl5BMl5BanBnXkFtZTcwMzczNDgwMw@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 January 1930","placeOfBirth":" Staten Island, New York, USA","birthName":"Salvatore Loggia","height":"5' 11\" (1.8 m)","bio":"Born and raised in New York City, Robert Loggia studied journalism at the University of Missouri before moving back to New York to pursue acting. He trained at the Actors Studio while doing stage work. From the late 1950s he was a familiar face on TV, usually as authoritative figures. Loggia also found work in movies such as The Greatest Story Ever Told (1965), Scarface (1983) and Big (1988). Always in demand, Loggia worked until his death, at 85, from complications of Alzheimer's.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NTQzODU0Nl5BMl5BanBnXkFtZTcwMzczNDgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005162","name":"Robert Loggia","idIMDB":"nm0005162"},"actorId":"nm0005162","character":"Bruno Langois","urlCharacter":"http://www.imdb.com/character/ch0005464","main":true},{"actorName":"Harvey Korman","urlProfile":"http://www.imdb.com/name/nm0466327","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NDMzMzc5NV5BMl5BanBnXkFtZTcwMzA2NjM3MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 February 1927","placeOfBirth":" Chicago, Illinois, USA","birthName":"Harvey Herschel Korman","height":"6' 3½\" (1.92 m)","bio":"Harvey Korman was a lanky, popular TV comedy veteran with a flair for broad comic characterizations, who shone for a decade as leading man and second banana par excellence on The Carol Burnett Show (1967) but failed to find much success in his own projects. Harvey Herschel Korman was born in Chicago, Illinois, to Ellen (Blecher) and Cyril Raymond Korman, a salesman. His parents, both immigrants, were from Russian Jewish families. A persistent TV presence since the early 1960s, Korman's first big break was a stint as a featured performer on The Danny Kaye Show (1963), a lively musical variety series. Here Korman began working in the format which he would soon master--providing sturdy support to a multi-talented star in a wide variety of comedy sketches. Boasting large, expressive features and a wonderfully mutable voice, Korman could play a wide assortment of characters. Perhaps his first classic characterization was provided for The Flintstones (1960) wherein he was the distinctively snooty voice of The Great Gazoo, a little helmeted space man from the future consigned to the Earth's past in punishment for his crimes. Korman garnered four Emmys for his work with Carol Burnett over the years. Her show never recovered from his departure in 1977 to pursue other projects. Ironically Korman would never again find such a successful showcase for his talents though he certainly tried, appearing in several busted pilots and short-lived sitcoms. Like 'Dan Aykroyd', a later somewhat comparable talent, he fared best in sketch comedy. Almost exclusively a comic actor, he stretched a bit to play straight man Bud Abbott opposite Buddy Hackett's Lou Costello in the disappointing TV biopic Bud and Lou (1978). Korman also directed and/or produced sitcom episodes and TV comedy specials. An occasional actor in films, Korman made his feature debut with a supporting role in The Last of the Secret Agents? (1966). Several film roles followed until he gained his widest exposure with a major supporting role in 'Mel Brooks''s classic Western spoof Blazing Saddles (1974). Korman also fared well in Brooks' High Anxiety (1977) and History of the World: Part I (1981). Korman acted in two 1994 features: the blockbuster live-action version of The Flintstones (1994) (providing the voice of the Dictabird) and the poorly received but lavishly produced Radioland Murders (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NDMzMzc5NV5BMl5BanBnXkFtZTcwMzA2NjM3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0466327","name":"Harvey Korman","nicknames":["Mr.Happy Go-Lucky","Harv"],"idIMDB":"nm0466327"},"actorId":"nm0466327","character":"Prof. Auguste Balls","urlCharacter":"http://www.imdb.com/character/ch0005473","main":true},{"actorName":"Burt Kwouk","urlProfile":"http://www.imdb.com/name/nm0477297","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMTQwMjI4N15BMl5BanBnXkFtZTcwMDEzODExOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1930","placeOfBirth":" Warrington, Cheshire, England, UK","birthName":"Herbert Tsangtse Kwouk","height":"5' 6\" (1.68 m)","bio":"Burt Kwouk was born on July 18, 1930 in Warrington, Cheshire, England as Herbert Tsangtse Kwouk. He was an actor, known for Goldfinger (1964), Le baiser mortel du dragon (2001) and The Pink Panther Strikes Again (1976). He was married to Caroline Tebbs. He died on May 24, 2016 in Hampstead, London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMTQwMjI4N15BMl5BanBnXkFtZTcwMDEzODExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0477297","name":"Burt Kwouk","idIMDB":"nm0477297"},"actorId":"nm0477297","character":"Cato Fong","urlCharacter":"http://www.imdb.com/character/ch0005477","main":true},{"actorName":"Ted Wass","urlProfile":"http://www.imdb.com/name/nm0913637","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjczYjQ0YTUtNjgyNy00Y2M2LTg5NjItMzJlNTMzN2U3M2FkL2ltYWdlXkEyXkFqcGdeQXVyMTA2NjU2MjA@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 October 1952","placeOfBirth":" Lakewood, Ohio, USA","bio":"Ted was born in Lakewood Ohio. He graduated from the acclaimed Goodman School of Drama in Chicago, where he performed in a wide array of the classics, from Shakespeare to Ibsen to Orton, Ted made his Broadway debut in the original production of GREASE, playing the role of DANNY ZUKO. Then came the lead role in the hit musical THEY'RE PLAYING OUR SONG. These performances launched a professional acting career that includes iconic roles from stage, film and television. Ted's film credits include principal roles in Blake Edwards' CURSE OF THE PINK PANTHER, OH GOD YOU DEVIL and THE LONGSHOT. Among the many leads in television series, Ted may be best known for DANNY DALLAS in the groundbreaking comedy SOAP. It was while starring in the sit-com BLOSSOM, that Ted began a parallel career in directing, and after it wrapped, directing became his main focus. Regarded as one of the top multi-camera directors, sought after because of his skill working with actors, Ted has a long list of credits, which includes 25 pilots. Whether acting or directing, Ted is passionate about his work.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjczYjQ0YTUtNjgyNy00Y2M2LTg5NjItMzJlNTMzN2U3M2FkL2ltYWdlXkEyXkFqcGdeQXVyMTA2NjU2MjA@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0913637","name":"Ted Wass","idIMDB":"nm0913637"},"actorId":"nm0913637","character":"Sergeant Clifton Sleigh","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roger Moore","urlProfile":"http://www.imdb.com/name/nm0000549","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3Njg5MDkxNl5BMl5BanBnXkFtZTYwNjczMzU0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 October 1927","placeOfBirth":" Stockwell, London, England, UK","birthName":"Roger George Moore","height":"6' 1\" (1.85 m)","bio":"Roger Moore will perhaps always be remembered as the man who replaced Sean Connery in the James Bond series, arguably something he never lived down. Roger George Moore was born on October 14, 1927 in Stockwell, London, England, the son of Lillian (Pope) and George Alfred Moore, a policeman. He first wanted to be an artist, but got into films full time after becoming an extra in the late 1940s. Moore also served in the British military during the Second World War. He came to the United States in 1953. Suave, extremely handsome, and an excellent actor, he received a contract with Metro-Goldwyn-Mayer. His initial foray met with mixed success, with movies like Diane (1956) and Interrupted Melody (1955), as well as The Last Time I Saw Paris (1954). Moore went into television in the 1950s on series such as Ivanhoe (1958) and The Alaskans (1959), but probably received the most recognition from Maverick (1957), as cousin Beau. He received his big breakthrough, at least internationally, as The Saint (1962). The series made him a superstar and he became very successful thereafter. Moore ended his run as the Saint, and was one of the premier stars of the world, but he was not catching on in America. In an attempt to change this, he agreed to star with Tony Curtis on ITC's The Persuaders! (1971), but although hugely popular in Europe, it did not catch on in the United States and was canceled. Just prior to making the series, he starred in The Man Who Haunted Himself (1970), which proved there was far more to Moore than the light-hearted roles he had previously accepted. He was next offered and accepted the role of James Bond, and once audiences got used to the change of style from Connery's portrayal, they also accepted him. Live and Let Die (1973), his first Bond movie, grossed more outside of America than Diamonds Are Forever (1971); Connery's last outing as James Bond. He went on to star in another six Bond films, before bowing out after A View to a Kill (1985). He was age 57 at the time the film was made and was looking a little too old for Bond - it was possibly one film too many. In between times, there had been more success with appearances in films such as That Lucky Touch (1975), Shout at the Devil (1976), The Wild Geese (1978), Escape to Athena (1979) and ffolkes (1980). Despite his fame from the Bond films and many others, the United States never completely took to him until he starred in The Cannonball Run (1981) alongside Burt Reynolds, a success there. After relinquishing his role as Bond, his work load tended to diminish a little, though he did star in the American box office flop Fire, Ice & Dynamite (1990), as well as the comedy Bullseye! (1990), with Michael Caine. He did the overlooked comedy Bed & Breakfast (1991), as well as the television movie The Man Who Wouldn't Die (1994), and then the major Jean-Claude Van Damme flop The Quest (1996). Moore then took second rate roles such as Spice World (1997), and the American television series The Dream Team (1999). Although his film work may have slowed down, he is still very much in the public eye, be it appearing on television chat shows or hosting documentaries. Roger Moore was appointed Commander of the Order of the British Empire on December 31, 1998 in the New Years Honours for services to UNICEF, and was promoted to Knight Commander of the same order on June 14, 2003 in the Queen's Birthday Honours for services to the charities UNICEF and Kiwanis International.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3Njg5MDkxNl5BMl5BanBnXkFtZTYwNjczMzU0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000549","name":"Roger Moore","idIMDB":"nm0000549"},"actorId":"nm0000549","character":"Chief Insp. Jacques Clouseau","urlCharacter":"http://www.imdb.com/character/ch0258861","main":true},{"actorName":"Leslie Ash","urlProfile":"http://www.imdb.com/name/nm0038650","urlPhoto":"","biography":{"dateOfBirth":"19 February 1960","placeOfBirth":" Clapham, Lambeth, London, England, UK","height":"5' 5½\" (1.66 m)","bio":"Leslie Ash was born on February 19, 1960 in Clapham, Lambeth, London, England. She is an actress, known for Quadrophenia (1979), British Men Behaving Badly (1992) and Where the Heart Is (1997). She has been married to Lee Chapman since 1988. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0038650","name":"Leslie Ash","idIMDB":"nm0038650"},"actorId":"nm0038650","character":"Juleta Shane","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Graham Stark","urlProfile":"http://www.imdb.com/name/nm0823174","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzRmMTUzOTEtMmY1Ny00ZjIwLTk3OGMtN2U5MDk3NDZiNDg5XkEyXkFqcGdeQXVyMjIxMzMyMQ@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 January 1922","placeOfBirth":" Wallasey, Cheshire, England, UK","birthName":"Graham William Stark","bio":"Graham Stark was born on January 20, 1922 in Wallasey, Cheshire, England as Graham William Stark. He was an actor and director, known for A Shot in the Dark (1964), Victor Victoria (1982) and Superman III (1983). He was married to Audrey Nicholson. He died on October 29, 2013 in London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzRmMTUzOTEtMmY1Ny00ZjIwLTk3OGMtN2U5MDk3NDZiNDg5XkEyXkFqcGdeQXVyMjIxMzMyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0823174","name":"Graham Stark","idIMDB":"nm0823174"},"actorId":"nm0823174","character":"Bored Waiter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"André Maranne","urlProfile":"http://www.imdb.com/name/nm0544860","urlPhoto":"","biography":{"dateOfBirth":"1926","placeOfBirth":" Paris, France","bio":"André Maranne was born in 1926 in Paris, France. He is an actor, known for The Pink Panther Strikes Again (1976), The Return of the Pink Panther (1975) and Revenge of the Pink Panther (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0544860","name":"André Maranne","idIMDB":"nm0544860"},"actorId":"nm0544860","character":"Sergeant Francois Duval","urlCharacter":"http://www.imdb.com/character/ch0005480","main":true},{"actorName":"Peter Arne","urlProfile":"http://www.imdb.com/name/nm0036170","urlPhoto":"","biography":{"dateOfBirth":"29 September 1920","placeOfBirth":" Kuala Lumpur, Malaya [now Malaysia]","birthName":"Peter Randolph Albrecht","bio":"Peter Arne was for a short time the perfect villain in British film. After a couple of roles in war movies (The Purple Plain (1954) and The Cockleshell Heroes (1955)) and a Tarzan movie (Tarzan and the Lost Safari (1957)) he became a villain in Strangers' Meeting (1957). From than on he continued to play sinister types in The Moonraker (1958), Intent to Kill (1958), Breakout (1959), Conspiracy of Hearts (1960), The Hellfire Club (1961) and The Secret of Monte Cristo (1961). He was very convincing as a Cromwell officer, an Italian camp commander or a Nazi officer. Several times he had sword fights as a devious count. In 1962 he was a pirate sidekick of Christopher Lee in The Pirates of Blood River (1962), but a new kid on the block by the name of Oliver Reed challenged him and killed him halfway through the picture. It seemed like a symbolic fight because for a while Oliver Reed played the roles in Hammer Pictures that Peter Arne could have played and Arne moved to TV roles. His days as a leading actor were over and he continued work in TV and in bit parts in features. Sometimes directors he worked with before brought him back for a little role. In 1972 he got a nice break with \"The Stallion\", a TV movie in which he starred with a horse. He was also in a couple of Blake Edwards movies. He became an antique dealer with his sister as a sideline. He was murdered at the age of 63 shortly after being cast in Doctor Who (1963).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0036170","name":"Peter Arne","idIMDB":"nm0036170"},"actorId":"nm0036170","character":"General Bufoni","urlCharacter":"http://www.imdb.com/character/ch0405156","main":true},{"actorName":"Patti Davis","urlProfile":"http://www.imdb.com/name/nm0205255","urlPhoto":"","biography":{"dateOfBirth":"21 October 1952","placeOfBirth":" Los Angeles, California, USA","birthName":"Patricia Ann Reagan","height":"5' 8\" (1.73 m)","bio":"Patti Davis (born Patricia Ann Reagan on October 21, 1952, in Los Angeles, California) is known as the black sheep of the Reagan family. She is famous for her pro-choice viewpoint on abortion and for being against nuclear weapons, and she had a highly-publicized rift between her and her parents, former president Ronald Reagan and Nancy Reagan. She wrote accounts of her life that did not portray her family in a positive light, and the autobiography \"The Way I See It,\" which contained the revelations that her father was cold, distant, and aloof to everyone except Nancy. It also contained accusations of physical abuse by her mother. Patti was romantically involved with Bernie Leadon of Eagles for a time in the 1970s and co-wrote with him the song \"I Wish You Peace,\" which appeared on The Eagles' \"One of These Nights\" album. In 1984, she married her yoga instructor Paul Grilley, but they divorced in 1990. In the 1990s, she posed nude for Playboy Magazine and filmed the video Playboy Celebrity Centerfold: Patti Davis (1995). Later, Patti reconciled with her parents, especially as they battled her father's Alzheimer's disease. As public opinion polls looked more favorably upon Ronald and Nancy, so did Patti's portrayal of them. She wrote books that were more flattering to her father, and was active in Reagan family actions against John Hinckley and a CBS mini-series called The Reagans (2003). Patti also published columns and articles in a number of newspapers and magazines.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0205255","name":"Patti Davis","idIMDB":"nm0205255"},"actorId":"nm0205255","character":"Michelle Chauvin","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0085384","urlIMDB":"http://www.imdb.com/title/tt0085384","business":{"budget":{"money":"$11,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$1,641,182","country":"USA","day":"14","month":"08","year":"1983","remarks":"812 Screens"}],"gross":[{"money":"$3,374,312","country":"USA","day":"21","month":"08","year":"1983","remarks":""},{"money":"$1,641,182","country":"USA","day":"14","month":"08","year":"1983","remarks":""}],"weekendGross":[{"money":"$840,878","country":"USA","day":"21","month":"08","year":"1983","remarks":"812 Screens"},{"money":"$1,641,182","country":"USA","day":"14","month":"08","year":"1983","remarks":"812 Screens"}],"admissions":null,"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":null,"copyrightHolder":"Titan Productions"},"technical":{"runtime":["1 hr 49 min (109 min)"],"soundMix":["Stereo"],"color":["Color (Technicolor)"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm"]},"rating":"4.3","filmingLocations":[{"location":"Ibiza, Balearic Islands, Spain"}],"rated":"PG","awards":[],"votes":"4,481","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026841","name":"United Artists"},{"idCompany":"co0058511","name":"Titan Productions"},{"idCompany":"co0129095","name":"Blake Edwards"}],"keywords":{"keywords":["computer","detective","diamond","pink panther","taxi driver","accident","flatulence","bellboy","telephone call","carnival","wheelchair","helicopter","cartoon on television","falling out of a window","martial artist","countess","yacht","garbage can","kiss","valencia spain","paris france","old woman","pug dog","man wearing underwear","female fighter","female martial artist","fainting","explosion","seduction","parasailing","falling through a roof","robbery","woman undressing a man","rocket launcher","eye patch","health spa","reference to aldous huxley","interpol","chess","fire","fire hose","knocked unconscious","unconsciousness","new york police department","jewel thief","elevator","lust","bare chested male","martial arts","hotel","rubber duck","binoculars","femme fatale","plastic surgery","mud bath","investigation","museum","bomb","man wearing glasses","leg in a cast","hospital","remote controlled toy car","slapstick comedy","attempted murder","airport","panic","hitman","falling from height","umbrella","mafia","new york city","taxi","stakeout","surveillance","man disguised as a woman","undercover","contact lens","coughing","falling into a swimming pool","gender disguise","interview","reference to sherlock holmes","watching television","disappearance","farce","shot in the back","ineptitude","pursuit","thief","mannequin","beer","blow up doll","waiter","car crash","car chase","cigarette smoking","restaurant","fight","cafe","returning actress with different character","returning character with different actor","woman fights man","1980s","eighth part","color in title","trenchcoat","police","policeman","famous score","bumbling","animated title sequence","sequel","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:09:33"}}