{"data":{"movies":[{"title":"Telefon","originalTitle":"","year":"1977","releaseDate":"19771216","directors":[{"name":"Don Siegel","id":"nm0796923"}],"writers":[{"name":"Peter Hyams","id":"nm0001382"},{"name":"Stirling Silliphant","id":"nm0798103"}],"runtime":"102 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWVmYWU4MDUtNzdiZS00ZmVhLTk1ZDItNjE3OWE0ZmIwNTA2XkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Crime","Drama","Thriller"],"plot":"The KGB is looking for one of their people, a man named Dalchimsky because he has stolen something important but, unfortunately, he manages to get through the border. Later in the U.S. some seemingly ordinary people after receiving a phone call go out and destroy key American military installations. Back in the U.S.S.R. General Strelsky and Colonel Malchenko send for Grigori Borzov, a KGB agent who has been to the U.S. on missions before. They inform him that after the U-2 incident in fear of the possibility that a war with the U.S. will occur; they were part of an operation called TELEFON that involved recruiting young agents and then brainwashing them into believing that they are Americans. They would assume the identity of an American who died a long time ago and who would be their age now. They would be situated in a city that is near or where a key U.S. military installation is located. They were also programmed to destroy upon receiving the command phrase. They have been ...","simplePlot":"A Russian officer is sent to USA to try and stop sleeper agents who will mindlessly attack government entities when they hear certain coded words.","actors":[{"actorName":"Charles Bronson","urlProfile":"http://www.imdb.com/name/nm0000314","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMzY5OTQwNV5BMl5BanBnXkFtZTYwMTcyOTE2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1921","placeOfBirth":" Ehrenfeld, Pennsylvania, USA","birthName":"Charles Dennis Buchinsky","height":"5' 8½\" (1.74 m)","bio":"The archetypal screen tough guy with weatherbeaten features--one film critic described his rugged looks as \"a Clark Gable who had been left out in the sun too long\"--Charles Bronson was born Charles Buchinsky, one of 15 children of struggling parents in Pennsylvania. His mother, Mary (Valinsky), was born in Pennsylvania, to Lithuanian parents, and his father, Walter Buchinsky, was a Lithuanian immigrant coal miner. He completed high school and joined his father in the mines (an experience that resulted in a lifetime fear of being in enclosed spaces) and then served in WW II. After his return from the war, Bronson used the GI Bill to study art (a passion he had for the rest of his life), then enrolled at the Pasadena Playhouse in California. One of his teachers was impressed with the young man and recommended him to director Henry Hathaway, resulting in Bronson making his film debut in You're in the Navy Now (1951). He appeared on screen often early in his career, though usually uncredited. However, he made an impact on audiences as the evil assistant to Vincent Price in the 3-D thriller House of Wax (1953). His sinewy yet muscular physique got him cast in action-type roles, often without a shirt to highlight his manly frame. He received positive notices from critics for his performances in Vera Cruz (1954), Target Zero (1955) and Run of the Arrow (1957). Indie director Roger Corman cast him as the lead in his well-received low-budget gangster flick Machine-Gun Kelly (1958), then Bronson scored the lead in his own TV series, Man with a Camera (1958). The 1960s proved to be the era in which Bronson made his reputation as a man of few words but much action. Director John Sturges cast him as half Irish/half Mexican gunslinger Bernardo O'Reilly in the smash hit western The Magnificent Seven (1960), and hired him again as tunnel rat Danny Velinski for the WWII POW big-budget epic The Great Escape (1963). Several more strong roles followed, then once again he was back in military uniform, alongside Lee Marvin and Ernest Borgnine in the testosterone-filled The Dirty Dozen (1967). European audiences had taken a shine to his minimalist acting style, and he headed to the Continent to star in several action-oriented films, including Guns for San Sebastian (1968) (aka \"Guns for San Sebastian\"), the cult western Once Upon a Time in the West (1968) (aka \"Once Upon a Time in The West\"), Rider on the Rain (1970) (aka \"Rider On The Rain\") and, in one of the quirkier examples of international casting, alongside Japansese screen legend Toshirô Mifune in the western Red Sun (1971) (aka \"Red Sun\"). American audiences were by now keen to see Bronson back on US soil, and he returned triumphantly in the early 1970s to take the lead in more hard-edged crime and western dramas, including Cosa Nostra (1972) and the revenge western Chato's Land (1972). After nearly 25 years as a working actor, he became an 'overnight\" sensation. Bronson then hooked up with British director Michael Winner to star in several highly successful urban crime thrillers, including The Mechanic (1972) and Le cercle noir (1973). He then scored a solid hit as a Colorado melon farmer-done-wrong in Richard Fleischer's Mr. Majestyk (1974). However, the film that proved to be a breakthrough for both Bronson and Winner came in 1974 with the release of the controversial Death Wish (1974) (written with Henry Fonda in mind, who turned it down because he was disgusted by the script). The US was at the time in the midst of rising street crime, and audiences flocked to see a story about a mild-mannered architect who seeks revenge for the murder of his wife and rape of his daughter by gunning down hoods, rapists and killers on the streets of New York City. So popular was the film that it spawned four sequels over the next 20 years. Action fans could not get enough of tough guy Bronson, and he appeared in what many fans--and critics--consider his best role: Depression-era street fighter Chaney alongside James Coburn in Hard Times (1975). That was followed by the somewhat slow-paced western Breakheart Pass (1975) (with wife Jill Ireland), the light-hearted romp (a flop) From Noon Till Three (1976) and as Soviet agent Grigori Borsov in director Don Siegel's Cold War thriller Telefon (1977). Bronson remained busy throughout the 1980s, with most of his films taking a more violent tone, and he was pitched as an avenging angel eradicating evildoers in films like the 10 to Midnight (1983), L'enfer de la violence (1984), Assassination (1987) and Kinjite: Forbidden Subjects (1989). Bronson jolted many critics with his forceful work as murdered United Mine Workers leader Jock Yablonski in the TV movie Act of Vengeance (1986), gave a very interesting performance in the Sean Penn-directed The Indian Runner (1991) and surprised everyone with his appearance as compassionate newspaper editor Francis Church in the family film Yes Virginia, There Is a Santa Claus (1991). Bronson's final film roles were as police commissioner Paul Fein in a well-received trio of crime/drama TV movies Tel père... tel flic! (1995), Le justicier braque la mafia (1997) and Le justicier reprend les armes (1999). Unfortunately, ill health began to take its toll; he suffered from Alzheimers disease for the last few years of his life, and finally passed away from pneumonia at Los Angeles' Cedars-Sinai Medical Center in August 2003. Bronson was a true icon of international cinema; critics had few good things to say about his films, but he remained a fan favorite in both the US and abroad for 50 years, a claim few other film legends can make.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMzY5OTQwNV5BMl5BanBnXkFtZTYwMTcyOTE2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000314","name":"Charles Bronson","nicknames":["Il Brutto","Le Sacre Monstre"],"idIMDB":"nm0000314"},"actorId":"nm0000314","character":"Major Grigori Borzov","urlCharacter":"http://www.imdb.com/character/ch0218655","main":true},{"actorName":"Lee Remick","urlProfile":"http://www.imdb.com/name/nm0001665","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzk1NDgzNTcwN15BMl5BanBnXkFtZTcwNjQ3MzAzOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 December 1935","placeOfBirth":" Quincy, Massachusetts, USA","birthName":"Lee Ann Remick","height":"5' 7\" (1.7 m)","bio":"Lee Remick was born in Quincy, Massachusetts, to Gertrude Margaret (Waldo), an actress, and Francis Edwin Remick, a department store owner. She had Irish and English ancestry. Remick was educated at Barnard College, studied dance and worked on stage and TV, before making her film debut as a sexy Southern majorette in Elia Kazan's A Face in the Crowd (1957). Her next role was also southern: Eula Varner in The Long, Hot Summer (1958). She emerged as a real star in the role of an apparent rape victim in Anatomy of a Murder (1959). And she won an Academy Award nomination for her role as the alcoholic wife of Jack Lemmon in Days of Wine and Roses (1962). After more work in TV and movies, she moved to England in 1970, making more movies there. In 1988 she formed a production company with partners James Garner and Peter K. Duchow.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzk1NDgzNTcwN15BMl5BanBnXkFtZTcwNjQ3MzAzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001665","name":"Lee Remick","idIMDB":"nm0001665"},"actorId":"nm0001665","character":"Barbara","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Donald Pleasence","urlProfile":"http://www.imdb.com/name/nm0000587","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjYzNTQ2MV5BMl5BanBnXkFtZTcwMzA5MTkzNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 October 1919","placeOfBirth":" Worksop, Nottinghamshire, England, UK","birthName":"Donald Henry Pleasence","height":"5' 6\" (1.68 m)","bio":"Balding, quietly-spoken, of slight build and possessed of piercing blue eyes -- often peering out from behind round, steel-rimmed glasses -- Donald Pleasence had the necessary physical attributes which make a great screen villain. In the course of his lengthy career, he relished playing the obsessed, the paranoid and the purely evil. Even the Van Helsing-like psychiatrist Sam Loomis in the Halloween (1978) franchise seems only marginally more balanced than his prey. An actor of great intensity, Pleasence excelled on stage as Shakespearean villains. He was an unrelenting prosecutor in Jean Anouilh's \"Poor Bitos\" and made his theatrical reputation in the title role of the seedy, scheming tramp in Harold Pinter's \"The Caretaker\" (1960). On screen, he gave a perfectly plausible interpretation of the head of the SS, Heinrich Himmler, in The Eagle Has Landed (1976). He was a convincingly devious Thomas Cromwell in Henry VIII and His Six Wives (1972), disturbing in his portrayal of the crazed, bloodthirsty preacher Quint in Will Penny (1967); and as sexually depraved, alcohol-sodden 'Doc' Tydon in the brilliant Aussie outback drama Wake in Fright (1971). And, of course, he was Ernst Stavro Blofeld in You Only Live Twice (1967). These are some of the films, for which we may remember Pleasence, but there was a great deal more to this fabulous, multi-faceted actor. Donald Henry Pleasence was born on October 5, 1919 in Worksop, Nottinghamshire, England, to Alice (Armitage) and Thomas Stanley Pleasence. His family worked on the railway; his grandfather had been a signal man and both his brother and father were station masters. When Donald failed to get a scholarship at RADA, he joined the family occupation working as a clerk at his father's station before becoming station master at Swinton, Yorkshire. While there he wrote letters to theatre companies eventually being accepted by one on the island of Jersey in Spring 1939 as an assistant stage manager. On the eve of World War II, he made his theatrical debut in \"Wuthering Heights\". In 1942, he played Curio in \"Twelfth Night\", but his career was then interrupted by military service in the RAF. He was shot down over France, incarcerated and tortured in a German POW camp. Once repatriated, Donald returned to the stage in Peter Brook's 1946 London production of \"The Brothers Karamazov\" with Alec Guinness although he missed the opening due to measles, followed by a stint on Broadway with Laurence Olivier's touring company in \"Caesar and Cleopatra\" and \"Anthony and Cleopatra\". Upon his return to England, he won critical plaudits for his performance in \"Hobson's Choice\". In 1952, Donald began his screen career, rather unobtrusively, in small parts. He was only really noticed once having found his métier as dastardly, sneaky Prince John in The Adventures of Robin Hood (1955). It took several more years, until international recognition came his way: first, through the filmed adaptation of The Guest (1963); and, secondly, with his blind forger in The Great Escape (1963), a role imbued with added conviction due to his own wartime experience. Some of his best acting Donald reserved for the small screen. In 1962, the producer of The Twilight Zone (1959), Buck Houghton, brought Donald to the United States ('damn the expense'!) to guest star in the third season episode \"The Changing of the Guard\". He was given a mere five days to immerse himself in the part of a gentle school teacher, Professor Ellis Fowler, who, on the eve of Christmas is forcibly retired after fifty-one years of teaching. Devastated, and believing himself a failure who has made no mark on the world, he is about to commit suicide when the school's bell summons him to his classroom. There, he is confronted by the spirits of deceased students who exhort him to consider that his lessons have had fundamental effects on their lives, even leading to acts of great heroism. Upon hearing this, Fowler is now content to graciously accept his retirement. Managing to avoid maudlin sentimentality, Donald's performance was intuitive and, arguably, one of the most poignant ever accomplished in a thirty-minute television episode. Once again, against type, he was equally delightful as the mild-mannered Reverend Septimus Harding in Anthony Trollope's The Barchester Chronicles (1982). Whether eccentric, sinister or given to pathos, Donald Pleasence was always great value-for-money and his performances have rarely failed to engage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjYzNTQ2MV5BMl5BanBnXkFtZTcwMzA5MTkzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000587","name":"Donald Pleasence","idIMDB":"nm0000587"},"actorId":"nm0000587","character":"Nicolai Dalchimsky","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tyne Daly","urlProfile":"http://www.imdb.com/name/nm0002033","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAyNjA2ODk2NV5BMl5BanBnXkFtZTcwMTQ0MTk5Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 February 1946","placeOfBirth":" Madison, Wisconsin, USA","birthName":"Ellen Tyne Daly","height":"5' 5¼\" (1.66 m)","bio":"Tyne Daly was born on February 21, 1946 in Madison, Wisconsin, USA as Ellen Tyne Daly. She is an actress, known for Cagney & Lacey (1981), Judging Amy (1999) and The Enforcer (1976). She was previously married to Georg Stanford Brown.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAyNjA2ODk2NV5BMl5BanBnXkFtZTcwMTQ0MTk5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002033","name":"Tyne Daly","idIMDB":"nm0002033"},"actorId":"nm0002033","character":"Dorothy Putterman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alan Badel","urlProfile":"http://www.imdb.com/name/nm0045996","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2ZkNWUxMTEtYmQzZi00MDkzLTkyMDgtNzNhZTlkZTZjNjI3XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1923","placeOfBirth":" Rusholme, Manchester, England, UK","birthName":"Alan Fernand Badel","bio":"British thespian Alan Badel came to prominence after graduating from RADA a Gold Medal winner. He made an almost instant impact on the stage in both modern and classical roles. One of his first critically acclaimed performances was as Romeo, opposite Claire Bloom's Juliet at the Old Vic. Despite his velvety, resonant voice and commanding personality, Badel never quite made the first rank on screen. In the theatre, however, he was never less than a star, particularly after his tour-de-force impersonation of 19th century actor Edmund Kean in Jean-Paul Sartre's 1971 play. His motion picture career took in parts as John the Baptist in Salome (1953), Richard Wagner in Magic Fire (1955) and as the corrupt manager of a rugby club in This Sporting Life (1963). On the small screen he was excellent as Edmund Dantes, the Count of Monte Cristo (1964), and as the eccentric, enigmatic Count Fosco in The Woman in White (1982). Badel, who died unexpectedly in 1982 at the age of 58, had a distinguished military record dating back to his wartime service with the 13th Parachute Battalion. He took part in Operation Overlord, the D-Day landings in 1944. He fought with distinction as a platoon commander and saw action in the Normandy and Ardennes Campaigns and the subsequent advance through northern Germany. After VE Day, he was posted to the Far East as part of the 6th Airborne Division for a projected invasion of Japan, which never took place due to the bombing of Hiroshima and Nagasaki. Badel spent some time in Palestine, until he was demobbed in June 1947.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2ZkNWUxMTEtYmQzZi00MDkzLTkyMDgtNzNhZTlkZTZjNjI3XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0045996","name":"Alan Badel","idIMDB":"nm0045996"},"actorId":"nm0045996","character":"Colonel Malchenko","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patrick Magee","urlProfile":"http://www.imdb.com/name/nm0535861","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTRhMzg2N2UtN2E5ZC00MDI2LTljNDMtZTFlNWJiZGQyOWNiXkEyXkFqcGdeQXVyMzAwOTU1MTk@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 March 1922","placeOfBirth":" Armagh, Northern Ireland, UK","birthName":"Patrick Joseph Gerard Magee","height":"5' 8\" (1.73 m)","bio":"Born in Armagh, Northern Ireland, Patrick Magee is a classic example of how certain actors rate the stage far more highly than the screen. Magee was well aware that the vast majority of the films that he appeared in were dreadful (he mostly played sinister villains in horror films), but the money came in very handy in financing his distinguished stage work (he was a favorite actor of Samuel Beckett one of whose greatest plays, 'Krapp's Last Tape', was written specifically for him). However, he did do some outstanding work on film, most notably in Stanley Kubrick's A Clockwork Orange (1971) as the crippled writer Mr.Alexander, and in Kubrick's Barry Lyndon (1975), as the chevalier. He also appeared in Joseph Losey's The Servant (1963), Peter Brook's Marat/Sade (1967) and William Friedkin's The Birthday Party (1968). He also appeared in films by such cult directors as Roger Corman, Lucio Fulci and Walerian Borowczyk.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTRhMzg2N2UtN2E5ZC00MDI2LTljNDMtZTFlNWJiZGQyOWNiXkEyXkFqcGdeQXVyMzAwOTU1MTk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0535861","name":"Patrick Magee","idIMDB":"nm0535861"},"actorId":"nm0535861","character":"General Strelsky","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sheree North","urlProfile":"http://www.imdb.com/name/nm0636065","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNjkwOTUwMV5BMl5BanBnXkFtZTcwNjEwOTg0NA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 January 1932","placeOfBirth":" Los Angeles, California, USA","birthName":"Dawn Shirley Crang","height":"5' 4½\" (1.64 m)","bio":"Sheree North was born on January 17, 1932 in Los Angeles, California, USA as Dawn Shirley Crang. She was an actress, known for Charley Varrick (1973), The Shootist (1976) and Maniac Cop (1988). She was married to Phillip Alan Norman, Dr. Gerhardt Ralph Sommer, John M. \"Bud\" Freeman and Frederick Arnold Bessire Jr. She died on November 4, 2005 in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNjkwOTUwMV5BMl5BanBnXkFtZTcwNjEwOTg0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0636065","name":"Sheree North","idIMDB":"nm0636065"},"actorId":"nm0636065","character":"Marie Wills","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Marth","urlProfile":"http://www.imdb.com/name/nm0551731","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5YzgxOWItN2JjYy00MDY1LWI4YmItODBjNGY3MDliNzBmL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1922","placeOfBirth":" New York City, New York, USA","height":"6' 1½\" (1.87 m)","bio":"Versatile, diligent character actor Frank Marth was a familiar presence in just about every major American prime-time TV show of the 60's and 70's. The native New Yorker got his big break as a member of Jackie Gleason's stock company, perennially cast as uncredited background characters in Cavalcade of Stars (1949) and The Honeymooners (1955). According to series co-star Audrey Meadows he was \"worth his weight in gold\". Thereafter, granite-faced, sober-looking Marth became omnipresent on the small screen for more than two decades as tough cops, FBI agents and stern military brass. Amazingly, he was overlooked for the part of a KAOS operative in Get Smart (1965) (which would have been perfect casting !) but made up for it with Luger-wielding Count von Waffenschmidt and assorted SS officers in Hogan's Heroes (1965). He was also a favorite in anything sci-fi, whether as a sinister alien in The Invaders (1967) or as THRUSH agent Carl Voegler in The Man from U.N.C.L.E. (1964). He appeared suitably taciturn as Colonel Brody, stymying dinosaur-hunting Darren McGavin in Kolchak: The Night Stalker (1974). Perfectly cast yet again, he gave the medics a hard time as a hard-nosed tank commander in the M*A*S*H episode \"Hey, Doc\". He had other recurring uniformed roles in Dirty Dozen: The Series (1988) and War and Remembrance (1988). Marth was married to stage and screen actress Hope Holiday.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5YzgxOWItN2JjYy00MDY1LWI4YmItODBjNGY3MDliNzBmL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0551731","name":"Frank Marth","idIMDB":"nm0551731"},"actorId":"nm0551731","character":"Harley Sandburg","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Helen Page Camp","urlProfile":"http://www.imdb.com/name/nm0131986","urlPhoto":"","biography":{"dateOfBirth":"27 December 1930","placeOfBirth":" Washington, USA","bio":"Helen Page Camp was born on December 27, 1930 in Washington, USA. She was an actress, known for Telefon (1977), Best Friends (1982) and Stand by Your Man (1981). She died on August 1, 1991 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0131986","name":"Helen Page Camp","idIMDB":"nm0131986"},"actorId":"nm0131986","character":"Emma Stark","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roy Jenson","urlProfile":"http://www.imdb.com/name/nm0421772","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NTAyNzIyMF5BMl5BanBnXkFtZTcwOTc1MzExOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1927","placeOfBirth":" Calgary, Alberta, Canada","height":"6' 2\" (1.88 m)","bio":"Roy Jenson was born on February 9, 1927 in Calgary, Alberta, Canada. He is known for his work on Chinatown (1974), Soylent Green (1973) and The Life and Times of Judge Roy Bean (1972). He was married to Marina Petrova and Barbara Dionysius. He died on April 24, 2007 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NTAyNzIyMF5BMl5BanBnXkFtZTcwOTc1MzExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0421772","name":"Roy Jenson","idIMDB":"nm0421772"},"actorId":"nm0421772","character":"Doug Stark","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jacqueline Scott","urlProfile":"http://www.imdb.com/name/nm0779261","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzOTY0Njc2NV5BMl5BanBnXkFtZTcwNzMyOTIzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1932","placeOfBirth":" Sikeston, Missouri, USA","birthName":"Jacqueline Sue Scott","bio":"Jacqueline Scott was born on January 1, 1932 in Sikeston, Missouri, USA as Jacqueline Sue Scott. She is an actress, known for Duel (1971), Charley Varrick (1973) and Empire of the Ants (1977). She has been married to Gene Lesser since February 2, 1958. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzOTY0Njc2NV5BMl5BanBnXkFtZTcwNzMyOTIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0779261","name":"Jacqueline Scott","idIMDB":"nm0779261"},"actorId":"nm0779261","character":"Mrs. Hassler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ed Bakey","urlProfile":"http://www.imdb.com/name/nm0049056","urlPhoto":"","biography":{"dateOfBirth":"13 November 1925","placeOfBirth":" Havre de Grace, Maryland, USA","birthName":"William Edward Baekey","bio":"Ed Bakey was born on November 13, 1925 in Havre de Grace, Maryland, USA as William Edward Baekey. He was an actor, known for The Sting (1973), The Philadelphia Experiment (1984) and Dead & Buried (1981). He was married to Anita Susemihl Bakey. He died on May 4, 1988 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0049056","name":"Ed Bakey","nicknames":["Blade"],"idIMDB":"nm0049056"},"actorId":"nm0049056","character":"Carl Hassler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Mitchum","urlProfile":"http://www.imdb.com/name/nm0593850","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGM2MTczYzgtMjIxNy00ZjZhLTgxODAtZDVlZDQ4NjdkZGFkL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1919","placeOfBirth":" Bridgeport, Connecticut, USA","birthName":"John Newman Mitchum","height":"5' 11\" (1.8 m)","bio":"John Newman Mitchum was the September child of a Norwegian mother and an Irish/Blackfoot father whom he never knew, as he was killed in a tragic train yard accident in 1919. His two-years-older brother Robert filled the role as best as he could, while their older sister Annette studied the lively arts and eventually joined a traveling vaudeville team. Born in Bridgeport, Connecticut, the young family moved to Rising Sun, Delaware, where farm life didn't agree with the young boys. Scarce opportunities took them to New York City, where the streets of Hell's kitchen taught the brothers to fight, a skill they developed so well they earned the moniker 'them ornery Mitchum boys'. Eventually, when the Great Depression deepened, the family was forced to separate with the intention of meeting up with sister Annette, who had married a sailor and moved to California, changing her name to Julie. The teenage boys set out with little more than clean handkerchiefs to find their way across the country by the only means they could: hitchhiking and riding the rails. Their somewhat aimless journey took them to places they had never been; where their Eastern accents were not welcome, so they quickly learned that accurately mimicking the local dialect would keep them out of trouble--some of the time! While brother Robert fairly quickly discovered his place in Hollywood legend, John sought his destiny on the high seas, professionally boxing, or conducting a choir. When the opportunity for acting came along John found his perfect niche as a character actor, mostly playing heavies since he was an imposing figure of a man. John's roles had him playing alongside a wide range of celebrities, from Humphrey Bogart in \"Knock On Any Door\" (1949) to Gladys Knight in \"Pipe Dreams\" (1976), Clint Eastwood of \"Dirty Harry\" (1971) to John Wayne in \"Chisum\" (1970), appearing in 58 films overall. It was during production of \"Chisum\" that John Wayne offered his voice for an anthology of John's poetry that seeks to uplift American culture, \"America, Why I Love Her\", a recording for which Mitchum was nominated for a Grammy in 1973. John was a consummate storyteller (as was his brother Robert), and with his fascination with American history in particular he was ever-ready to regale anyone with a thoughtful, interesting, and insightful anecdote, especially if a guitar was available. It was the wedding of music and history that brought him to create the recording \"Our Land, Our Heritage\" with Dan Blocker; big \"Hoss\" from \"Bonanza\", in 1964. Mitchum had some recurring roles throughout his television career; such as \"Pickalong\" from \"Riverboat\", or \"Hoffenmueller\" from \"F-Troop\", over 150 appearances in all during the span of a half-century career. The brothers Mitchum legacy has been well-preserved in his often hilarious autobiography, \"Them Ornery Mitchum Boys\", published in 1989. The subjects range from brother Robert escaping a Georgia chain-gang to his \"poontang\" interview; from John surviving an attacking whale on a three-masted schooner to his adventures riding the rails, developing a great love and respect for the American people.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGM2MTczYzgtMjIxNy00ZjZhLTgxODAtZDVlZDQ4NjdkZGFkL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0593850","name":"John Mitchum","nicknames":["Big John"],"idIMDB":"nm0593850"},"actorId":"nm0593850","character":"Harry Bascom","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Iggie Wolfington","urlProfile":"http://www.imdb.com/name/nm0938370","urlPhoto":"","biography":{"dateOfBirth":"14 October 1920","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Ignatius Wolfington","bio":"Iggie Wolfington was born on October 14, 1920 in Philadelphia, Pennsylvania, USA as Ignatius Wolfington. He was an actor, known for All My Children (1970), 1941 (1979) and Herbie Rides Again (1974). He was married to Lynn Wood. He died on September 30, 2004 in Studio City, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0938370","name":"Iggie Wolfington","idIMDB":"nm0938370"},"actorId":"nm0938370","character":"Father Stuart Diller","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hank Brandt","urlProfile":"http://www.imdb.com/name/nm0104919","urlPhoto":"","biography":{"dateOfBirth":"4 June 1934","placeOfBirth":" New Jersey, USA","birthName":"Henry Brandt","height":"6' 1\" (1.85 m)","bio":"Hank Brandt was born on June 4, 1934 in New Jersey, USA as Henry Brandt. He was an actor, known for Dumb & Dumber (1994), Escape from Alcatraz (1979) and Kingpin (1996). He died on December 4, 2004 in North Hills, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0104919","name":"Hank Brandt","idIMDB":"nm0104919"},"actorId":"nm0104919","character":"William Enders","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0076804","urlIMDB":"http://www.imdb.com/title/tt0076804","business":{"budget":{"money":"$7,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":[],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"04","month":"01","year":"1977","remarks":null},null],"copyrightHolder":"Copyright MCMLXXVII by Metro-Goldwyn-Mayer Inc."},"technical":{"runtime":["1 hr 42 min (102 min)"],"soundMix":["Mono"],"color":["Color (Metrocolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panaflex Cameras by Panavision"],"laboratory":["MGM Laboratories Inc., USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.6","filmingLocations":[{"location":"Santa Clarita, California, USA"}],"rated":"PG","awards":[{"award":"Edgar Allan Poe Awards 1978","titlesAwards":[{"titleAwardOutcome":"Nominated Edgar","categories":[{"category":"Best Motion Picture","names":[{"name":"Peter Hyams","id":"nm0001382","role":null},{"name":"Stirling Silliphant","id":"nm0798103","role":null}]}]}]}],"votes":"4,112","type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"}],"keywords":{"keywords":["kgb","sleeper agent","suicide","photographic memory","sabotage","brainwashing","poem","hypnosis","female double agent","computer analysis","reference to robert frost","detente","border crossing","cyanide capsule","computer","priest","soviet union","motel","mind control","spy","rogue agent","telephone box","helicopter","rattlesnake","cia","cold war","russia","based on novel","title spoken by character","surprise ending","assassin","brainwashed assassin","post hypnotic suggestion","mk ultra","orange juice","fishing trip","holiday inn","player piano","hockey","limousine","phone terror","media coverage","sexism","terrorist","poison","terrorism","parking garage"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 20:28:34"}}