{"data":{"movies":[{"title":"A Cruel Romance","originalTitle":"Zhestokiy romans","year":"1984","releaseDate":"19850918","directors":[{"name":"Eldar Ryazanov","id":"nm0752922"}],"writers":[{"name":"Aleksandr Ostrovskiy","id":"nm0652534"},{"name":"Eldar Ryazanov","id":"nm0752922"}],"runtime":"142 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY4NDMwMDI2Nl5BMl5BanBnXkFtZTcwMjE2ODAwMQ@@._V1.jpg","countries":["Soviet Union"],"languages":["Russian"],"genres":["Drama","Romance"],"plot":"Cinematographic adaptation of classical Russian play \"Dowry-less\" by A. Ostrovsky. Noble but poor widow seeks to arrange marriage for her three daughters. She maintains \"open house\" or provincial form of salon hoping to attract gentlemen well-off enough to marry for love to a dowry-less.","simplePlot":"Cinematographic adaptation of classical Russian play \"Dowry-less\" by A. Ostrovsky. Noble but poor widow seeks to arrange marriage for her three daughters. She maintains \"open house\" or ... ","actors":[{"actorName":"Alisa Freyndlikh","urlProfile":"http://www.imdb.com/name/nm0293981","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4Njc0MTQ0M15BMl5BanBnXkFtZTcwMTI1ODc0NQ@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 December 1934","placeOfBirth":" Leningrad, RSFSR, USSR [now St. Petersburg, Russia]","birthName":"Alisa Brunovna Freyndlikh","bio":"Alisa Brunovna Freindlikh was born on December 8, 1934, in Leningrad, USSR (now St. Petersburg, Russia). Her father, named Bruno Frejndlikh, was a notable actor. Alisa Freindlikh graduated from Leningrad Institute of Theatre, Music, and Cinematography in 1957. From 1961-1983 Alisa Freindlikh was a permanent member of the Leningrad Theatre of Lensovet under directorship of her husband Igor Vladimirov. She was the leading star of that theatre and her stage partners were such actors as Georgi Zhzhyonov, Aleksey Petrenko, Sergey Migitsko, Anatoliy Ravikovich, Mikhail Devyatkin, Mikhail Boyarskiy, Larisa Luppian, Galina Nikulina, Vera Ulik, Leonid Dyachkov, Valeri Kuzin, Yefim Kamenetsky, Leila Kirakosian, Aleksandr Estrin, Petr Shelokhonov, and other notable Russian actors. Alisa Freindlikh made a stellar film career in collaboration with director Eldar Ryazanov. Her most memorable work was the female lead opposite Andrey Myagkov in Office Romance (1977). She also brilliantly played a supporting role in A Cruel Romance (1984), a Ryazanov's adaptation of the 19th century story by Aleksandr Ostrovskiy. In 1983 Alisa Freindlikh was designated the People's Artist of the USSR. That same year she divorced from her husband Igor Vladimirov, and soon left the Theatre of Lensovet. Since 1984 Alisa Freindlikh has been a permanent member of Bolshoi Drama Theatre (BDT) in St. Petersburg (Leningrad) under directorship of Georgi Tovstonogov. There her stage partners were such stars as Kirill Lavrov, Oleg Basilashvili, Lyudmila Makarova, Svetlana Kryuchkova, Zinaida Sharko, Valentina Kovel, Sergey Yurskiy, Nikolay Trofimov, Vladislav Strzhelchik, Yevgeni Lebedev, Georgiy Shtil, Vsevolod Kuznetsov, Vadim Medvedev, Yuriy Demich, Leonid Nevedomsky, Gennadiy Bogachyov, Andrey Tolubeev, and many other notable Russian actors. In 2004, on her 70th birthday, Alisa Freindlikh was visited in her home by the Russian president Vladimir Putin. She was decorated for her achievements as an actress in film and theatre. Alisa Freindlikh is residing in St. Petersburg, Russia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4Njc0MTQ0M15BMl5BanBnXkFtZTcwMTI1ODc0NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0293981","name":"Alisa Freyndlikh","idIMDB":"nm0293981"},"actorId":"nm0293981","character":"Ogudalova","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Larisa Guzeeva","urlProfile":"http://www.imdb.com/name/nm0349975","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDlmZDU4OTEtNWE5Ny00MDQ5LWIyZjUtM2NmMzVmYzBiMDQxXkEyXkFqcGdeQXVyNjMwOTA1MDM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 May 1959","placeOfBirth":" Burtinskoe, Belyaevskiy rayon, Orenburgskaya oblast, RSFSR, USSR [now Russia]","birthName":"Larisa Andreevna Guzeeva","bio":"Larisa Guzeeva was born on May 23, 1959 in Burtinskoe, Belyaevskiy rayon, Orenburgskaya oblast, RSFSR, USSR as Larisa Andreevna Guzeeva. She is an actress, known for A Cruel Romance (1984), Sopernitsy (1985) and Patrioticheskaya komediya (1992). She has been married to Igor Bukharov since 1999. They have one child. She was previously married to Kakha Tolordava and Ilya.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDlmZDU4OTEtNWE5Ny00MDQ5LWIyZjUtM2NmMzVmYzBiMDQxXkEyXkFqcGdeQXVyNjMwOTA1MDM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0349975","name":"Larisa Guzeeva","idIMDB":"nm0349975"},"actorId":"nm0349975","character":"Larisa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nikita Mikhalkov","urlProfile":"http://www.imdb.com/name/nm0586482","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNjY4ODI5Ml5BMl5BanBnXkFtZTcwNDAyMTg2OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 October 1945","placeOfBirth":" Moscow, RSFSR, USSR [now Russia]","birthName":"Nikita Sergeevich Mikhalkov","height":"6' 1½\" (1.87 m)","bio":"Nikita Mikhalkov is the son of the famous communist poet Sergey Mikhalkov, who wrote the lyrics of the Soviet national anthem and had strong connections to the Communist Party. Nikita Mikhalkov's mother, Natalya Petrovna Konchalovskaya, was also a poet and daughter of famous painter Pyotr Petrovich Konchalovsky and his wife Olga Vasilievna Surikova, and by her the great granddaughter of another great painter Vasily Surikov. And then last, but not least, Nikita Mikhalkov is the brother of Andrey Konchalovskiy, also a distinguished film director who, unlike Nikita, has worked in the USA. Not only did Mikhalkov direct the Academy Award-winning film \"Burnt by the Sun\" but he is also well-known as a versatile actor, having appeared in over 40 films, including the role of the Russian Tsar Alexander III in his own \"The Barber of Siberia\" (1998). Mikhalkov has an impressively long list of wins at the most prestigious film festivals, like Cannes, Venice, Moscow or Karlovy Vary. Following his movie's Oscar win for Best Foreign Language Film, Nikita Mikhalkov won a parliamentary seat in the then Prime Minister Victor Chernomyrdin's party. He is always in the spotlight, especially in Moscow, where he resides.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNjY4ODI5Ml5BMl5BanBnXkFtZTcwNDAyMTg2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0586482","name":"Nikita Mikhalkov","idIMDB":"nm0586482"},"actorId":"nm0586482","character":"Paratov","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrey Myagkov","urlProfile":"http://www.imdb.com/name/nm0616556","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGZhMzI2OGYtZWU5NC00MjAxLTk4NzctMjA0ODFiMTMyYWFjL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTc4MzI2NQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1938","placeOfBirth":" Leningrad, RSFSR, USSR [now St. Petersburg, Russia]","birthName":"Andrey Vasilevich Myagkov","bio":"Andrey Myagkov, one of Russia's most familiar faces and a leading actor of the Moscow Art Theatre (MXAT) who starred in the 1970's comedy Ironiya sudby, ili S legkim parom! (1975), made a comeback in the sequel Ironiya sudby. Prodolzhenie (2007). He was born Andrey Vasilevich Myagkov on July 8, 1938, in Leningrad, Russia, USSR (now St. Petersburg, Russia). His father, Vasiliy Myagkov, was a professor at the Polytechnical Academy. Young Andrey was fond of theatre and was involved in the drama club at his high school. However, he focused on the study of chemistry and attended the Leningrad Institute of Technology, graduating in 1960 as a chemical engineer. His first job was as a research engineer at the Leningrad State Institute of Plastics, although at the same time he continued playing on stage as an amateur actor. In 1961 he was admitted to the acting school of the Moscow Art Theatre (MXAT) in Leningrad. Then he moved to Moscow and studied at the Theatrical School of the Moscow Art Theatre (MXAT), graduating in 1965 as an actor. At that time he married actress Anastasiya Voznesenskaya. From 1965 to 1977 he was a member of the troupe at the Sovremennik Theatre in Moscow. There his stage partners were such actors as Oleg Efremov, Evgeniy Evstigneev, Galina Volchek, Stanislav Lyubshin, Anatoliy Romashin, Alla Pokrovskaya, Oleg Tabakov, Oleg Dal, Igor Kvasha, Valentin Gaft, and other notable Russian actors. In 1977 he became a member of the troupe at the Moscow Art Theatre (MXAT). There he made his stage debut in the leading role as Zilov in \"Utinaya okhota\" (\"Duck Hunting\") by Aleksandr Vampilov, and eventually established himself as a leading actor in other stage productions at the MXAT. His stage partners there were such actors as Innokentiy Smoktunovskiy, Yekaterina Vasilyeva, Tatyana Doronina, Oleg Efremov, Evgeniy Evstigneev, Oleg Tabakov, Aleksandr Kalyagin, Andrei Popov, and other notable Russian actors. Since the split of the troupe in 1987, he has been a member of the Chekhov Moscow Art Theatre (Chekhov MXAT), named after Russian playwright Anton Chekhov. His stage partners there have been such notable Russian actors as Alla Pokrovskaya, Natalya Rogozhkina, Anastasiya Voznesenskaya, Irina Miroshnichenko, Iya Savvina, Stanislav Lyubshin, Vyacheslav Nevinnyy, Evgeniy Kindinov, Viktor Sergachyov, and Vladimir Kashpur, among others. He made his film debut in the leading role as a dentist in Pokhozhdeniya zubnogo vracha (1965), by director Elem Klimov. He established himself with such roles as the monk Alyosha in Bratya Karamazovy (1969), then as Khlebnikov, an obsessed chess master, in Grossmeyster (1973). He shot to fame in the Soviet Union with the leading role as Zhenya in Ironiya sudby, ili S legkim parom! (1975), by director Eldar Ryazanov. His fruitful collaboration with Ryazanov continued in Office Romance (1977), The Garage (1980), and A Cruel Romance (1984). Andrey has played over 50 roles in film and on television. He declined offers to play in such modern Russian films as Night Watch (2004) and Turetskiy gambit (2005). However, he made a comeback reprising his most famous role as Zhenya opposite Barbara Brylska in Ironiya sudby. Prodolzhenie (2007), a sequel to the Soviet comedy Ironiya sudby, ili S legkim parom! (1975). In 1989, he made his directorial debut with a stage production of \"Spokoynoy nochi, Mama\" (\"Good Night, Mama\") at the Moscow Art Theatre (MXAT). In 2002 he directed the MXAT production of \"Retro\", a nostalgic play about three middle-aged women courting one man; the play earned him wide public acclaim, although evoking sharp criticism from some contemporary Moscow critics. His latest directorial work for the Moscow Art Theatre was a 2006 production of \"Osenniy charlston\" (\"Autumn Charleston\") based on the play \"The Cemetery Club\" by American playwright Ivan Menchell. He was designated a People's Artist of Russia in 1986. He was awarded the State Prize of the USSR in 1977, the Brothers Vasiliev State Prize in 1979, and has received several other significant awards and nominations. Outside of his acting profession, Andrey paints portraits, and his paintings are owned by such figures as Mikhail Gorbachev and Galina Volchek, among others. He is fond of sport fishing and hiking. He shares his time between his two residences, one in Moscow, and one in a remote village in central Russia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGZhMzI2OGYtZWU5NC00MjAxLTk4NzctMjA0ODFiMTMyYWFjL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTc4MzI2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0616556","name":"Andrey Myagkov","idIMDB":"nm0616556"},"actorId":"nm0616556","character":"Karandyshev","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aleksey Petrenko","urlProfile":"http://www.imdb.com/name/nm0677840","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NzA2NzA5OV5BMl5BanBnXkFtZTcwNjI0NDAxMw@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1938","placeOfBirth":" Chemer, Chernigov Oblast, Ukrainian SSR, USSR [now Chernihiv Oblast, Ukraine]","birthName":"Alexei Vassilyevich Petrenko","bio":"Aleksey Petrenko was born on March 26, 1938 in Chemer, Chernigov Oblast, Ukrainian SSR, USSR as Alexei Vassilyevich Petrenko. He was an actor, known for Le barbier de Sibérie (1998), 12 (2007) and Rasputin (1981). He was married to Azima Abdumaminova, Galina Kozhukhova-Petrenko and Alla Petrenko. He died on February 22, 2017 in Moscow, Russia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NzA2NzA5OV5BMl5BanBnXkFtZTcwNjI0NDAxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0677840","name":"Aleksey Petrenko","idIMDB":"nm0677840"},"actorId":"nm0677840","character":"Knurov","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Viktor Proskurin","urlProfile":"http://www.imdb.com/name/nm0698756","urlPhoto":"","biography":{"dateOfBirth":"8 February 1952","placeOfBirth":" Atbasar, Akmolinsk Oblast, Kazakh SSR, USSR [now Kazakhstan]","birthName":"Viktor Alekseyevich Proskurin","bio":"Viktor Proskurin was born on February 8, 1952 in Atbasar, Akmolinsk Oblast, Kazakh SSR, USSR as Viktor Alekseyevich Proskurin. He is an actor, known for A Cruel Romance (1984), Pikovaya dama (1982) and Gagarin. Pervyy v kosmose (2013). He was previously married to Svetlana Proskurina and Olga Gavrilyuk.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0698756","name":"Viktor Proskurin","idIMDB":"nm0698756"},"actorId":"nm0698756","character":"Vozhevatov","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Georgiy Burkov","urlProfile":"http://www.imdb.com/name/nm0122050","urlPhoto":"","biography":{"dateOfBirth":"31 May 1933","placeOfBirth":" Perm, Russian SFSR, USSR [now Russia]","birthName":"Georgi Ivanovich Burkov","bio":"Georgiy Burkov was born on May 31, 1933 in Perm, Russian SFSR, USSR as Georgi Ivanovich Burkov. He was an actor and director, known for Once Upon a Time there Lived a Dog (1982), Ironiya sudby, ili S legkim parom! (1975) and They Fought for Their Country (1975). He died on July 19, 1990 in Moscow, USSR.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0122050","name":"Georgiy Burkov","idIMDB":"nm0122050"},"actorId":"nm0122050","character":"Robinzon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tatyana Pankova","urlProfile":"http://www.imdb.com/name/nm0659593","urlPhoto":"","biography":{"dateOfBirth":"27 December 1916","placeOfBirth":" Petrograd, Russian Empire [now St. Petersburg, Russia]","birthName":"Tatyana Petrovna Pankova","bio":"Tatyana Pankova was born on December 27, 1916 in Petrograd, Russian Empire as Tatyana Petrovna Pankova. She was an actress, known for A Cruel Romance (1984), Medovyy mesyats (1956) and Sfinks (1990). She died on July 9, 2011 in Moscow, Russia.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0659593","name":"Tatyana Pankova","idIMDB":"nm0659593"},"actorId":"nm0659593","character":"Efrosinya Potapovna","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Borislav Brondukov","urlProfile":"http://www.imdb.com/name/nm0111410","urlPhoto":"","biography":{"dateOfBirth":"1 March 1938","placeOfBirth":" Dubava, Kiev Oblast, Ukrainian SSR, USSR [now Ukraine]","birthName":"Borislav Nikolayevich Brondukov","bio":"Borislav Brondukov was born on March 1, 1938 in Dubava, Kiev Oblast, Ukrainian SSR, USSR as Borislav Nikolayevich Brondukov. He was an actor, known for Adventures of Sherlock Holmes and Dr. Watson: The Twentieth Century Approaches (1986), The Adventures of Sherlock Holmes and Doctor Watson: Mortal Fight (1980) and Sherlock Holmes and Doctor Watson: The Bloody Inscription (1979). He died on March 10, 2004 in Kiev, Ukraine.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0111410","name":"Borislav Brondukov","idIMDB":"nm0111410"},"actorId":"nm0111410","character":"Ivan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aleksandr Pyatkov","urlProfile":"http://www.imdb.com/name/nm0701408","urlPhoto":"","biography":{"dateOfBirth":"31 July 1950","placeOfBirth":"","birthName":"Aleksandr Aleksandrovich Pyatkov","bio":"Aleksandr Pyatkov was born on July 31, 1950 as Aleksandr Aleksandrovich Pyatkov. He is an actor, known for Dersu Uzala (1975), Mute Witness (1995) and A Cruel Romance (1984).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0701408","name":"Aleksandr Pyatkov","idIMDB":"nm0701408"},"actorId":"nm0701408","character":"Gavrilo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yuriy Sarantsev","urlProfile":"http://www.imdb.com/name/nm0764852","urlPhoto":"","biography":{"dateOfBirth":"7 October 1928","placeOfBirth":" Melik, Lower Volga Oblast, RSFSR, USSR [now Saratov Oblast, Russia]","birthName":"Yuri Dmitriyevich Sarantsev","bio":"Yuriy Sarantsev was born on October 7, 1928 in Melik, Lower Volga Oblast, RSFSR, USSR as Yuri Dmitriyevich Sarantsev. He was an actor, known for La planète des tempêtes (1962), A Cruel Romance (1984) and Puti i sudby (1956). He died on August 24, 2005 in Moscow, Russia.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0764852","name":"Yuriy Sarantsev","idIMDB":"nm0764852"},"actorId":"nm0764852","character":"Kapitan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Olga Volkova","urlProfile":"http://www.imdb.com/name/nm0901549","urlPhoto":"","biography":{"dateOfBirth":"15 April 1939","placeOfBirth":" Leningrad, Russian SFSR, USSR [now St. Petersburg, Russia]","birthName":"Olga Vladimirovna Politova","bio":"Olga Vladimirovna Volkova was born on April 15, 1939, in Leningrad, USSR (now St. Petersburg, Russia). Her grandfather was a legendary Russian actor Ivan Volsky. Young Olga Volkova was introduced to theatre by Alisa Freyndlikh, who brought Volkova to Mariya Prizvan-Sokolova's Acting Studio in Leningrad. From 1957-1970 she was a permanent member of the Theatre for Young Audience in Leningrad under directorship of Zinovi Korogodsky. There her stage partners were such actors as Antonina Shuranova and Aleksandr Khochinsky among others. In 1965 Volkova made her film debut and soon she became known as an actress with a special talent for playing sharp characters on stage and in film. She played in more than 50 Russian films. Her best known film-works were made in collaboration with director Eldar Ryazanov. From 1976-1996 Volkova was a permanent member of the legendary troupe of Bolshoi Drama Theatre (BDT) in St. Petersburg (Leningrad). Volkova was invited by director Georgi Tovstonogov and made a successful stage career at the BDT. There her stage partners were such stars as Alisa Freyndlikh, Kirill Lavrov, Oleg Basilashvili, Svetlana Kryuchkova, Vsevolod Kuznetsov, Gennadiy Bogachyov, Andrey Tolubeev, and many other remarkable Russian actors. Olga Volkova has been known for her stellar performances in such plays as 'Pickwick Club' by Charles Dickens and 'Na Dne' (The Lower Depths) by Maxim Gorky on stage of the BDT in St. Petersburg. Volkova was designated the title of People's Artist of Russia (1993). In 1996 she moved from St. Petersburg to Moscow to join the family of her son, actor Ivan Volkov and daughter-in-law, actress Chulpan Khamatova. In 1999 Olga Volkova gave a stellar performance as Amba opposite Sergey Yurskiy in 'Zhelezny Klass', a stage production by \"Art-Partner XXI\" in Moscow. Volkova maintains a busy acting career in film and on stage. She is currently residing in Moscow, Russia.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0901549","name":"Olga Volkova","idIMDB":"nm0901549"},"actorId":"nm0901549","character":"Modistka","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dmitriy Buzylyov-Kretso","urlProfile":"http://www.imdb.com/name/nm0125618","urlPhoto":"","biography":{"dateOfBirth":"22 January 1957","placeOfBirth":" USSR","birthName":"Dmitriy Mikhaylovich Buzylyov-Kretso","bio":"Dmitriy Buzylyov-Kretso was born on January 22, 1957 in the USSR as Dmitriy Mikhaylovich Buzylyov-Kretso. He is an actor, known for Siberiade (1979), A Cruel Romance (1984) and Soleil trompeur 2 (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0125618","name":"Dmitriy Buzylyov-Kretso","idIMDB":"nm0125618"},"actorId":"nm0125618","character":"Ilya","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aleksandr Pankratov-Chyornyy","urlProfile":"http://www.imdb.com/name/nm0659609","urlPhoto":"","biography":{"dateOfBirth":"28 June 1949","placeOfBirth":" Konevo, Pankrushikhinskiy rayon, Altayskiy kray, RSFSR, USSR [now Russia]","birthName":"Aleksandr Vasilevich Pankratov","bio":"Aleksandr Pankratov-Chyornyy was born on June 28, 1949 in Konevo, Pankrushikhinskiy rayon, Altayskiy kray, RSFSR, USSR as Aleksandr Vasilevich Pankratov. He is an actor and director, known for Ward No. 6 (2009), Jazzman (1983) and Courier (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0659609","name":"Aleksandr Pankratov-Chyornyy","idIMDB":"nm0659609"},"actorId":"nm0659609","character":"Ofitser","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sergey Artsibashev","urlProfile":"http://www.imdb.com/name/nm0037950","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MzI3NTkzOV5BMl5BanBnXkFtZTcwNDYyMzIzMg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1951","placeOfBirth":" Kalya, Sverdlovsk Oblast, RSFSR, USSR [now Russia]","birthName":"Sergey Nikolaevich Artsibashev","bio":"Sergey Nikolaevich Artsibashev was born on September 14, 1951 in Kalya, Sverdlovsk Oblast, RSFSR, USSR. He was a well-known Moscow theatre director and actor. As a director he was known for \"Hamlet\", \"Chichikov I k\", \"Three sisters\", \"Zhenitba\", \"Arbenin\". As an actor he was known for 12 (2007), DMB (2000), and Nebesa Obetovannye (1991). He passed away on July 12, 2015 in Moscow, Russia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MzI3NTkzOV5BMl5BanBnXkFtZTcwNDYyMzIzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0037950","name":"Sergey Artsibashev","idIMDB":"nm0037950"},"actorId":"nm0037950","character":"Gulyaev","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0090368","urlIMDB":"http://www.imdb.com/title/tt0090368","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":[{"money":"22,000,000","country":"Soviet","day":null,"month":null,"year":null,"remarks":null}],"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 22 min (142 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":["Mosfilm, Moscow, Soviet Union"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"8.1","filmingLocations":[{"location":"Kostroma, Russia"}],"awards":[],"votes":"2,420","type":"Movie","companyCreditsSimple":[{"idCompany":"co0024010","name":"Mosfilm"}],"keywords":{"keywords":["russia","based on play"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:27:00"}}