{"data":{"movies":[{"title":"The Last Gangster","originalTitle":"","year":"1937","releaseDate":"19371112","directors":[{"name":"Edward Ludwig","id":"nm0524995"}],"writers":[{"name":"John Lee Mahin","id":"nm0536941"},{"name":"William A. Wellman","id":"nm0920074"}],"runtime":"81 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NTc0NzM1Ml5BMl5BanBnXkFtZTcwNTcxMjI4OQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama","Thriller"],"plot":"Gangster Joe Krozac is in prison for ten years. Reporter Paul North is fired by his newspaper for writing articles sympathetic to Krozac's wife and young son. She divorces Krozac and marries North. When Korzac gets out he goes looking for his former wife and son.","simplePlot":"A organized crime big shot is jailed for ten years after his wife becomes pregnant and becomes bitter when she divorces him and remarries.","actors":[{"actorName":"Edward G. Robinson","urlProfile":"http://www.imdb.com/name/nm0000064","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzcwMzU5Nl5BMl5BanBnXkFtZTYwNTkwMjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1893","placeOfBirth":" Bucharest, Romania","birthName":"Emmanuel Goldenberg","height":"5' 7\" (1.7 m)","bio":"Edward G. Robinson arrived in the United States at age ten, and his family moved into New York's Lower East Side. He took up acting while attending City College, abandoning plans to become a rabbi or lawyer. The American Academy of Dramatic Arts awarded him a scholarship, and he began work in stock, with his new name, in 1913. Broadway was two years later; he worked steadily there for 15 years. His work included \"The Kibitzer\", a comedy he co-wrote with Jo Swerling. His film debut was a small supporting part in the silent The Bright Shawl (1923), but it was with the coming of sound that he hit his stride. His stellar performance as snarling, murderous thug Rico Bandello in Little Caesar (1931)--all the more impressive since in real life Robinson was a sophisticated, cultured man with a passion for fine art--set the standard for movie gangsters, both for himself in many later films and for the industry. He portrayed the title character in several biographical works, such as Dr. Ehrlich's Magic Bullet (1940) and A Dispatch from Reuter's (1940). Psychological dramas included Flesh and Fantasy (1943), Double Indemnity (1944), The Woman in the Window (1944)and Scarlet Street (1945). Another notable gangster role was in Key Largo (1948). He was \"absolved\" of allegations of Communist affiliation after testifying as a friendly witness for the House Un-American Activities Committee during the McCarthy hysteria of the early 1950s. In 1956 he had to sell off his extensive art collection in a divorce settlement and also had to deal with a psychologically troubled son. In 1956 he returned to Broadway in \"Middle of the Night\". In 1973 he was awarded a special, posthumous Oscar for lifetime achievement.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzcwMzU5Nl5BMl5BanBnXkFtZTYwNTkwMjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000064","name":"Edward G. Robinson","nicknames":["Eddie","Manny"],"idIMDB":"nm0000064"},"actorId":"nm0000064","character":"Joe Krozac","urlCharacter":"http://www.imdb.com/character/ch0047553","main":true},{"actorName":"James Stewart","urlProfile":"http://www.imdb.com/name/nm0000071","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNzMzODY0NV5BMl5BanBnXkFtZTcwMDk3NDQyOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 May 1908","placeOfBirth":" Indiana, Pennsylvania, USA","birthName":"James Maitland Stewart","height":"6' 3\" (1.91 m)","bio":"James Maitland Stewart was born on 20 May 1908 in Indiana, Pennsylvania, to Elizabeth Ruth (Johnson) and Alexander Maitland Stewart, who owned a hardware store. He was of Scottish, Ulster-Scots, and some English, descent. Stewart was educated at a local prep school, Mercersburg Academy, where he was a keen athlete (football and track), musician (singing and accordion playing), and sometime actor. In 1929 he won a place at Princeton, where he studied architecture with some success and became further involved with the performing arts as a musician and actor with the University Players. After graduation, engagements with the University Players took him around the northeastern United States, including a run on Broadway in 1932. But work dried up as the Great Depression deepened, and it wasn't until 1934, when he followed his friend Henry Fonda to Hollywood, that things began to pick up. After his first screen appearance in Art Trouble (1934), he worked for a time for MGM as a contract player and slowly began making a name for himself in increasingly high-profile roles throughout the rest of the 1930s. His famous collaborations with Frank Capra, in You Can't Take It with You (1938), Mr. Smith Goes to Washington (1939), and, after World War II, It's a Wonderful Life (1946) helped to launch his career as a star and to establish his screen persona as the likable everyman. Having learned to fly in 1935, he was drafted into the U.S. Army in 1940 as a private (after twice failing the medical for being underweight). During the course of World War II he rose to the rank of colonel, first as an instructor at home in the United States, and later on combat missions in Europe. He remained involved with the U.S. Air Force Reserve after the war and retired in 1959 as a brigadier general. Stewart's acting career took off properly after the war. During the course of his long professional life he had roles in some of Hollywood's best remembered films, starring in a string of Westerns (bringing his \"everyman\" qualities to movies like The Man Who Shot Liberty Valance (1962)), biopics (The Stratton Story (1949), The Glenn Miller Story (1954), and The Spirit of St. Louis (1957), for instance) thrillers (most notably his frequent collaborations with Alfred Hitchcock) and even some screwball comedies . He continued to work into the 1990s and died at the age of 89 in 1997.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNzMzODY0NV5BMl5BanBnXkFtZTcwMDk3NDQyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000071","name":"James Stewart","nicknames":["Jimmy"],"idIMDB":"nm0000071"},"actorId":"nm0000071","character":"Paul North","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rose Stradner","urlProfile":"http://www.imdb.com/name/nm0833117","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzliYTlkOGQtMzQxMC00YzdlLTg4M2MtNjdjN2FkNzNhYTQxXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR24,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1913","placeOfBirth":" Vienna, Austria-Hungary [now Austria]","birthName":"Rosa Stradner","bio":"Pretty, soulful-eyed Austrian actress Rose Stradner was a rising 30s ingénue on the Viennese stage and in a few German film romances and musicals when MGM mogul Louis B. Mayer, who was in Europe searching for exotic talent, discovered Rose. Along with Greer Garson, Ilona Massey and Hedy Lamarr, she was brought to Hollywood and groomed as a foreign import. Unfortunately, her personal life became a shambles and eventually overwhelmed her ability to perform. She was born Rosa Stradner in Vienna in 1913 and educated at a convent. Her desire to become an actress came young. At 16 she studied at the Academy for Music and Art in Zurich, Switzerland, and at the age of 19, she auditioned for Max Reinhardt and handed a contract. She appeared for Reinhardt at the Voks and Josefstadt Theaters, often in the classics (Shakespeare, Ibsen, Moliere) but handled modern pieces (Dreiser, O'Neill) just as well. In Europe she also appeared in some films between 1933 and 1936. Fleeing Austria during the Nazi invasion, Rose, her then-husband Karl Heinz Martin, a stage director, and her mother arrived in the States in 1936. She and her husband divorced soon after however. Making her U.S. debut as Edward G. Robinson's put-upon wife in The Last Gangster (1937), she showed promise and was signed by MGM. Her second film Blind Alley (1939), which was more Freudian in nature, starred Chester Morris as a psychologically-disturbed mobster who abducts psychiatrist Ralph Bellamy. Rose had less to do in this picture. The budding star met well-known writer/producer/director Joseph L. Mankiewicz at around this time and she placed her career on hold. The couple married in 1939 had two sons, Chris and Tom. Christopher Mankiewicz, who was born a year later, went on to become a modest film producer in the 1980s. Although Rose returned for a small but key role as a Mother Superior in her husband's film The Keys of the Kingdom (1944), her career was officially over after only three films. In 1948 she was cast in the Edna Ferber play \"Bravo!\" but she had to be replaced during tryouts which caused her severe mental strain. On a positive note, her fluency in several languages helped her husband's screenplays but the marriage was rocky almost from the start. In addition to Mankiewcz' infamous affairs with such stars as Judy Garland and Linda Darnell, Rose did not take to being strictly a \"hausfrau\" easily and soon turned destructive with alcohol used to deaden her unhappiness. She would be known for going into emotional tirades and eventually she was admitted into clinics for her violent rages and psychological disturbances. Constantly threatening suicide, a lethal mix of bitterness and depression set in and on September 27, 1958 ended her pain with an overdose of sleeping pills in her Mt. Kisco, New York, residence. She was only 45.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzliYTlkOGQtMzQxMC00YzdlLTg4M2MtNjdjN2FkNzNhYTQxXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0833117","name":"Rose Stradner","idIMDB":"nm0833117"},"actorId":"nm0833117","character":"Talya Krozac","urlCharacter":"http://www.imdb.com/character/ch0047556","main":true},{"actorName":"Lionel Stander","urlProfile":"http://www.imdb.com/name/nm0822034","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NDQ3NDA4OV5BMl5BanBnXkFtZTcwMjQ2NzkxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 January 1908","placeOfBirth":" The Bronx, New York City, New York, USA","height":"6' (1.83 m)","bio":"Lionel Stander, the movie character actor with the great gravelly voice, was born on January 11th, 1908 in The Bronx borough of New York City. Stander's acting career was derailed when he was blacklisted during the 1950s after being exposed as a Communist Party member during the House Un-American Activities Committee hearings. In his own HUAC testimony in May 1953, Stander denounced HUAC's use of informers, particularly those with mental problems. Stander specialized in playing lovable hoodlums and henchmen and assorted acerbic, hard-boiled types. His physique was burly and brutish, and his head featured a square-jaw beneath a coarse-featured pan that was lightened by his charm. But it was his gruff, foghorn voice that made his fortune. Stander attended the University of North Carolina, but after making his stage debut at the age of 19, he decided to give up college for acting. Along with a successful stage career, his unusual voice made him ideal for radio. His movie screen debut was in the comedy short Salt Water Daffy (1933) with Jack Haley and Shemp Howard. He went on to star in a number of two-reel comedy shorts produced at Vitaphone's Brooklyn studio before moving to Hollywood in 1935, where he appeared as a character actor in many A-list features such as Nothing Sacred (1937). John Howard Lawson, the screenwriter who was one of the Hollywood Ten and who served as the Communist Party's cultural commissar in Hollywood, held up Stander as the model of a committed communist actor who enhanced the class struggle through his performances. In the movie No Time to Marry (1938), which had been written by Party member Paul Jarrico, Stander had whistled a few bars of the \"Internationale\" while waiting for an elevator. Stander thought that the scene would be cut from the movie, but it remained in the picture because \"they were so apolitical in Hollywood at the time that nobody recognized the tune\". Stander had a long history of supporting left-wing causes. He was an active member of the Popular Front from 1936-39, a broad grouping of left-wing organizations dedicated to fighting reactionaries at home and fascism abroad. Stander wrote of the time, \"We fought on every front because we realized that the forces of reaction and Faciscm fight democracy on every front. We, too, have been forced, therefore, to organize in order to combat them on every front: politically through such organizations as the Motion Picture Democratic Committee; economically through our guilds and unions; socially, and culturally through such organizations as the Hollywood Anti-Nazi League.\" The Front disintegrated when the U.S.S.R. signed a non-aggression pact with Nazi Germany, which engendered World War II by giving the Nazis the get-go to invade Poland (with the Soviet Union invading from the East). The Communist Party-USA dropped out of the Front and from anti-Nazi activities, and during the early days of the War, before Germany invaded the U.S.S.R. in June 1941, it tried to hamper US support for the UK under the aegis of supporting \"peace,\" including calling strikes in defense plants. Many communists, such as Elia Kazan, dropped out of the Party after this development, but many others stayed. These were the Stalinists that the American non-communist left grew to despise, and eventually joined with the right to destroy, though much of their antipathy after 1947-48 was generated by a desire to save themselves from the tightening noose of reaction. Melvyn Douglas, a prominent liberal whose wife Helen Gahagan Douglas would later be a U.S. Representative from California (and would lose her bid for the Senate to a young Congressman named Richard Nixon, who red-baited her as \"The Pink Lady\"), had resisted Stander's attempts to recruit him to the Party. \"One night, Lionel Stander kept me up until dawn trying to sell me the Russian brand of Marxism and to recruit me for the Communist Party. I resisted. I had always been condemnatory of totalitarianism and I made continual, critical references to the U.S.S.R. in my speeches. Members of the Anti-Nazi League would urge me to delete these references and several conflicts ensued.\" Douglas, his wife, and other liberals were not adverse to cooperating with Party members and fellow travelers under the aegis of the MPDC, working to oppose fascism and organize relief for the Spanish Republic. They believed that they could minimize Communist Party influence, and were heartened by the fact that the Communists had joined the liberal, patriotic, anti-fascist bandwagon. Their tolerance of Communists lasted until the Soviet-Nazi Pact of August 1939. That, and the invasion of Poland by the Nazis and the USSR shattered the Popular Front. Stander had been subpoenaed by the very first House Un-American Activities Committee inquisition in Hollywood, in 1940, when it was headed by Texas Congressman Martin Dies. The Dies Committee had succeeded in abolishing the Federal Theatre Project of the Works Progress Administration as a left-wing menace in 1939 (the FTP had put on a revival of Lawson's play about the exploitation of miners, \"Prcessional,\" that year in New York). The attack on the FTP had been opposed by many liberals in Hollywood. Stung by the criticisms of Hollywood, the Dies Committee decided to turn its attention on Hollywood itself. Sending investigators to Hollywood, Dies' HUAC compiled a long-list of subversives, including Melvyn Douglas. John L. Leech, a police agent who had infiltrated the Communist Party before being expelled in 1937, presented a list of real and suspected communists to a Los Angeles County grand jury, which also subpoenaed Stander. The testimony was leaked, and the newspapers reported that Stander, along with such prominent Hollywood liberals as James Cagney, Humphrey Bogart, Frederic March and Francot Tone, had been identified as communists. Committee chairman Dies offered all of the people named as communists the opportunity to clear themselves if they would cooperate with him in executive session. Only one of the named people did not appear, and Stander was the only one to appear who was not cleared. Subsequently, he was fired by his studio, Republic Pictures. Stander was then subpoenaed to testify before the California Assembly's Committee on Un-American Activities, along with John Howard Lawson, the union leader John Sorrell and others. During the strike led by Sorrell's militant Conference of Student Unions against the studios in 1945, Stander was the head of a group of progressives in the Screen Actors Guild who supported the CSU and lobbied the guild to honor its picket lines. They were outvoted by the more conservative faction headed by Robert Montgomery, George Murphy and Ronald Reagan. The SAG membership voted 3,029 to 88 to cross the CSU picket-line. Stander continued to work after being fired by Republic. He appeared in Hangmen Also Die! (1943), a film about the Nazi Reinhard Heydrich, who was assassinated by anti-fascists. After the bitter CSU strike, which was smeared as being communist-inspired by the studios, HUAC once again turned its gaze towards Hollywood, starting two cycles of inquisitions in 1947 and 1951. The screenwriter Martin Berkeley, who set a record by naming 155 names before the the second round of Committee hearings, testified that Stander had introduced him to the militant labor union leader Harry Bridges, long suspected of being a communist, whom Stander called \"comrade\". After being blacklisted, Stander worked as a broker on Wall Street and appeared on the stage as a journeyman actor. He returned to the movies in Tony Richardson's The Loved One (1965), and he began his career anew as a character actor, appearing in many films, including Roman Polanski's Cul-De-Sac (1966) and Martin Scorsese's New York, New York (1977). Other movies he appeared in included Promise Her Anything (1966), The Black Bird (1975), Le pont de Cassandra (1976), 1941 (1979), Cookie (1989) and The Last Good Time (1994), his final theatrical film. Stander is best remembered for playing Max on TV's Hart to Hart (1979) (1979-84) with Robert Wagner and Stefanie Powers, a role he reprised in a series of \"Hart to Hart\" TV movies. Stander also appeared on Wagner's earlier TV series It Takes a Thief (1968) and on the HBO series Dream On (1990). Lionel Stander died of lung cancer on November 30, 1994 in Los Angeles, California. He was 86 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NDQ3NDA4OV5BMl5BanBnXkFtZTcwMjQ2NzkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0822034","name":"Lionel Stander","idIMDB":"nm0822034"},"actorId":"nm0822034","character":"'Curly'","urlCharacter":"http://www.imdb.com/character/ch0047558","main":true},{"actorName":"Douglas Scott","urlProfile":"http://www.imdb.com/name/nm0779081","urlPhoto":"","biography":{"dateOfBirth":"31 May 1925","placeOfBirth":" Seattle, Washington, USA","bio":"Douglas Scott was born on May 31, 1925 in Seattle, Washington, USA. He was an actor, known for Wuthering Heights (1939), Intermezzo: A Love Story (1939) and Wee Willie Winkie (1937). He died on June 23, 1988 in Concord, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0779081","name":"Douglas Scott","idIMDB":"nm0779081"},"actorId":"nm0779081","character":"The Boy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Carradine","urlProfile":"http://www.imdb.com/name/nm0001017","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MDcyMjkzOV5BMl5BanBnXkFtZTYwNzY1MzI2._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1906","placeOfBirth":" New York City, New York, USA","birthName":"Richmond Reed Carradine","height":"6' (1.83 m)","bio":"John Carradine, the son of a reporter/artist and a surgeon, grew up in Poughkeepsie, New York. He attended Christ Church School and Graphic Art School, studying sculpture, and afterward roamed the South selling sketches. He made his acting debut in \"Camille\" in a New Orleans theatre in 1925. Arriving in Los Angeles in 1927, he worked in local theatre. He applied for a job as as scenic designer to Cecil B. DeMille, who rejected his designs but gave him voice work in several films. His on-screen debut was in Tol'able David (1930), billed as Peter Richmond. A protégé and close friend of John Barrymore, Carradine was an extremely prolific film character actor while simultaneously maintaining a stage career in classic leading roles such as Hamlet and Malvolio. In his later years he was typed as a horror star, putting in appearances in many low- and ultra-low-budget horror films. He was a member of the group of actors often used by director John Ford that became known as \"The John Ford Stock Company\". John Carradine died at age 82 of natural causes on November 27, 1988.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MDcyMjkzOV5BMl5BanBnXkFtZTYwNzY1MzI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001017","name":"John Carradine","nicknames":["The Bard of Boulevard","The Voice"],"idIMDB":"nm0001017"},"actorId":"nm0001017","character":"Casper","urlCharacter":"http://www.imdb.com/character/ch0047562","main":true},{"actorName":"Sidney Blackmer","urlProfile":"http://www.imdb.com/name/nm0085782","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5MTEzMjIzMF5BMl5BanBnXkFtZTcwMDEwMzYwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 July 1895","placeOfBirth":" Salisbury, North Carolina, USA","birthName":"Sidney Alderman Blackmer","height":"6' (1.83 m)","bio":"Sidney Blackmer, the Tony-award winning actor who played Teddy Roosevelt in seven movies, is best remembered by today's movie audiences for his turn as the warlock/coven-leader Roman Castevet in Roman Polanski's Rosemary's Baby (1968). Born and raised in Salisbury, North Carolina, where he made his debut on July 13, 1895, he had planned as a young man to study law at the University of North Carolina-Chapel Hill. However, playing football and engaging in amateur theatricals proved more important to him than his aspirations to be an attorney, and while in his teens, he went to New York City to try to make it as an actor. He appeared uncredited in movies turned out by various film studios in Fort Lee, New Jersey, which in the first half of the decade of the 1910s, was the Hollywood of America. He reportedly appeared in a bit part in the popular movie serial \"The Perils of Pauline\" (1914). Blackmer made his Broadway debut on February 13, 1917, in \"The Morris Dance,\" Harley Granville-Barker's adaptation of Robert Louis Stevenson's novel \"The Wrong Box.\" He was not to appear again on the Broadway stage for almost exactly three years, due to the outbreak of his World War I, which saw Blackmer join the military as an officer. After the war, he returned to the theater, making his second Broadway appearance in \"Trimmed in Scarlet\" on February 2, 1920. He appeared in 15 other productions on the Great White Way from 1920 to 1928. His appearance in 'Clare Kummer''s comedy \"The Mountain Man\" in 1921 made him a star. He was a pioneer in the new medium of radio, on which he sang during the 1920s. (Blackmer later participated in the first experimental dramas on Allen B. DuMont's television network.) But it was the movies that increasingly attracted Blackmer's professional attention, in which he typically was cast as a smooth villain from High Society, although he did also play sympathetic roles. Although Blackmer is now credited with appearing (un-billed) in \"The Perils of Pauline,\" he didn't make a credited appearance on the silver screen until the dawn of the sound era. With the coming of sound, Hollywood needed actors and actresses who could talk and talk well, so it raided the Broadway stage. Blackmer was one of the Broadway stars who headed West, appearing in his first talkie, \"The Love Racket\" (1929), in 1929. He starred in other early sound films, including \"Kismet\" (1930/I), which is considered a lost film. He was memorable as Big Boy in support of Edward G. Robinson in the gangster classic Little Caesar (1931) Blackmer returned to Broadway in 1931 with the comedy \"The Social Register\" and appeared again in the comedy \"Stop-Over\" in 1938. In Hollywood, he had a supporting role in the Robert Donat version of \"The Count of Monte Cristo\" (1934). Also that year, he appeared in 'William A. Wellman''s \"The President Vanishes\" (1934), co-starring 'Edward Arnold' and 'Osgood Perkins', the father of 'Anthony Perkins'. Sidney Blackmer has the distinction of starring in the only movie ever \"written\" by a president of the United States, \"The President's Mystery\" (1936), based on a story by \"co-authored\" by 'Franklin D. Roosevelt'. F.D.R. was an avid murder mystery reader, and at a meeting of whodunit authors at the White House during his first administration, he suggested an idea for a mystery novel to the writers: A millionaire disappears and starts a new life under a new identity, taking his wealth with him. Mystery writers, including S.S. Van Dine, cobbled together a patch-work book of uneven quality based on the premise, with F.D.R. listed as co-author. \"The President's Mystery\" became a best-seller due to F.D.R.'s enormous personal popularity. In the movie version, written by future Hollywood Ten member 'Lester Cole' and novelist 'Nathanel West', Blackmer played millionaire industrialist Sartos, who engineers his own disappearance while holding on to his fortune. Sartos blackmails a corrupt investment bank run by two con men, which he takes over. He then invests his money with the firm, and robs himself under cover of the crooked brokerage. Disappearing after \"losing\" his fortune, people believe Sartos has committed suicide. Just when it seems that he has accomplished his goal and has escaped into his new life with his loot, something goes awry. Nineteen-thirty seven was a busy year for Blackmer, who appeared in 12 films, including \"Heidi\" (1937), his second flick with superstar moppet Shirley Temple (the had earlier co-starred in \"The Little Colonel\" (1935)). He played General Phillip Sheridan in the epic pot-boiler \"In Old Chicago\" (1937), starring 'Tyrone Power, Jr.'. The movie featured an Oscar-winning performance by 'Alice Brady' as Molly O'Brady, she of the cow with the combustible personality whose bovine hissy fit causes a conflagration that wipes out the City of Broad Shoulders. Then, it was time to indulge in the dubious enterprise of supporting two Caucasian actors in Oriental drag, the Swede 'Warner Oland' in \"Charlie Chan at Monte Carlo\" (1937) and the German 'Peter Lorre' in \"Thank You, Mr. Moto.\" (1937). He also appeared again with Edward G. Robinson in \"The Last Gangster\" (1937). In the late '30s, Blackmer began making a side-line out of portraying F.D.R.'s cousin 'Theodore Roosevelt', appearing as the wild 'n' woolly bully Bull Moose himself in \"This Is My Affair\" (1937), \"The Monroe Doctrine\" (1939), and the Academy Award-winning two-reel short \"Teddy the Rough Rider\" (1940). He followed these up, reprising T.R., in the patriotic short \"March On, America!\" (1942), in the John Wayne western \"In Old Oklahoma\" (1943), in Bill Wellman's \"Buffalo Bill\" (1944), and in the nostalgic \"My Girl Tisa\" (1948). Blackmer appeared in three Broadway productions in the mid-1940s, but it wasn't until the dawn of the new decade of the '50s that he scored his greatest success on Broadway, playing the dipsomaniac Doc in 'William Inge''s \"Come Back, Little Sheba\" opposite Shirley Booth, who scored a Best Actress (Dramatic) Tony Award in 1950 as his wife. Though Blackmer won the Best Actor (Dramatic) Tony Award for \"Sheba,\" he was not able to repeat his triumph on film and possibly join Booth into the Oscar-winner's circle as 'Burt Lancaster' coveted the role. Blackmer also lost out on another plum film assignment when it came time to cast the film version of Sweet Bird of Youth (1962). 'Ed Begley, Sr.' won an Oscar for his portrayal of Boss Finley in 'Richard Brooks''s film of the 'Tennessee Williams' play, a role that Blackmer had originated on Broadway under the stalwart direction of infamous Hollywood Un-American Activities Committee snitch 'Elia Kazan'. Blackmer last appeared on Broadway in \"A Case of Libel\" in the 1963-64 season. In his private life, Blackmer served as the national vice president of the Muscular Dystrophy Association. He was honored with a motion picture star on the Hollywood Walk of Fame at 1625 Vine Street, and was the recipient of the North Carolina Award, the state of North Carolina's highest civilian award, in 1972. Blackmer was married to Lenore Ulric from 1928 until 1939, when they were divorced. He married his second wife Suzanne Kaaren in 1943. They had two sons, Jonathan and Brewster Blackmer. Sidney Blackmer died of cancer on October 6, 1973 at the age of 78 in New York City. He was interred in Chestnut Hill Cemetery in his home town of Salisbury, NC.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5MTEzMjIzMF5BMl5BanBnXkFtZTcwMDEwMzYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0085782","name":"Sidney Blackmer","idIMDB":"nm0085782"},"actorId":"nm0085782","character":"Editor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Grant Mitchell","urlProfile":"http://www.imdb.com/name/nm0593372","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MjYzODAyOV5BMl5BanBnXkFtZTcwNDAxNDMxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 June 1874","placeOfBirth":" Columbus, Ohio, USA","birthName":"John Grant Mitchell Jr.","height":"5' 9\" (1.75 m)","bio":"You would think stage and film veteran Grant Mitchell was born to play stern authoritarians; his father after all was General John Grant Mitchell. But Mitchell would actually be better known for his portrayals of harangued husbands, bemused dads and bilious executives in 30s and 40s films. Born in Columbus, Ohio and a Yale post graduate at Harvard Law, Mitchell gave up his law practice to become an actor and made his stage debut at age 27. He appeared in many leads on Broadway in such plays as \"It Pays to Advertise,\" \"The Champion,\" \"The Whole Town's Talking\" and \"The Baby Cyclone,\" the last of which was specially written for him by George M. Cohan (see \"Other Works\"). Mitchell's screen career officially got off the ground with the advent of sound, though he did show up in a couple of silents. The beefy, balding actor appeared primarily in \"B\" films, and actually had a rare lead in the totally forgotten Father Is a Prince (1940). From time to time, however, he enjoyed being a part of \"A\" quality classic films such as Mr. Smith Goes to Washington (1939), The Man Who Came to Dinner (1942), Laura (1944) and Arsenic and Old Lace (1944). Unmarried, he died at age 82 in 1957.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MjYzODAyOV5BMl5BanBnXkFtZTcwNDAxNDMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0593372","name":"Grant Mitchell","idIMDB":"nm0593372"},"actorId":"nm0593372","character":"Warden","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edward Brophy","urlProfile":"http://www.imdb.com/name/nm0112395","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzExNGE4MTQtZDAzZi00YzM4LWE3ZDEtZTE0NTQzNzgzZGU1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1895","placeOfBirth":" New York City, New York, USA","birthName":"Edward Santree Brophy","height":"5' 5\" (1.65 m)","bio":"Edward S. Brophy was born on February 27, 1895 in New York City and educated at the University of Virginia. He became a bit and small-part in the movies starting in 1919, but switched to behind-the-scenes work for job security, though he continued appearing in small parts. While serving as a property master for Buster Keaton's production unit at Metro-Goldwyn-Mayer, Brophy appeared in a memorable sequence in Keaton's classic The Cameraman (1928), in which Buster and Brophy both try to undress simultaneously in a tiny wardrobe room. Keaton cast Brophy in larger parts in two of his talkies, and by 1934, Brophy abandoned the production end of the movies altogether and was acting full-time. Possessed of a chubby, bald-headed face with pop-eyes, and blessed with (for a comic) a high-pitched voice, Brophy appeared in scores of comic roles. He also played straight dramatic parts, but was less effective in them. Typical of his work was his memorable turn providing comic relief in the small supporting role of the Marine in Manila who adopts the dog \"Tripoli\" in Howard Hawks' war propaganda masterpiece Air Force (1943). In the 1950s, Brophy began taking fewer roles. His last role was in director John Ford's Western Two Rode Together (1961), during the production of which, he died on May 27, 1960 in Pacific Palisades, California. He will always be remembered to film-lovers as the voice of Timothy Mouse in Walt Disney's classic 1941 cartoon Dumbo (1941).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzExNGE4MTQtZDAzZi00YzM4LWE3ZDEtZTE0NTQzNzgzZGU1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0112395","name":"Edward Brophy","idIMDB":"nm0112395"},"actorId":"nm0112395","character":"Fats Garvey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alan Baxter","urlProfile":"http://www.imdb.com/name/nm0062667","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjVjZTk0MzItNmJhMy00ZmYwLWJiYWMtMTg3NmZiNzIyM2UwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1908","placeOfBirth":" East Cleveland, Ohio, USA","birthName":"Alan Edwin Baxter","bio":"Before there was an Alan Ladd, there was another furtive-eyed, baby-faced, cigarette-dangling villain named Alan, impacting the movie scene with his various colorless and cold-hearted thugs, mobsters and killers. Dark-haired, bullet-headed actor Alan Baxter earned a noticeable degree of popularity back in the late 30s and 40s with his various despicables, before his film career lost steam and he sought more and more TV and stage work. The son of a Cleveland Trust Company vice president, the Ohio native was born on November 19, 1908, in East Cleveland. Following high school, he studied drama at Williams College in Williamstown, Massachusetts, where he forged a strong friendship with fellow collegiate and future directing icon, Elia Kazan. Once they graduated in 1930, the pair went on to attend the Yale School of Drama. Alan hooked up with the then-fledgling Group Theatre in the early 1930s and appeared in such stage productions as \"Lone Valley\", \"The Pure in Heart\" and \"Waiting for Lefty\". His performance in \"Black Pit\" in 1935, however, was witnessed by a Hollywood talent scout and it was enough to change the course of his career. Immediately heading west to Hollywood, Alan made an auspicious debut with his strong performance as \"Babe Wilson\", the heartless killer loved by Sylvia Sidney's character in Mary Burns, Fugitive (1935). Three years later, Alan went on to recreate the role on radio. With his foot strongly in the Paramount door, he continued playing dangerous, unsavory types in 13 Hours by Air (1936), Big Brown Eyes (1936) and The Case Against Mrs. Ames (1936), until his contract ran out. Continuing to freelance throughout the remainder of the 1930s, he remained on the wrong side of the law in Parole! (1936), Breezing Home (1937), Night Key (1937), Wide Open Faces (1938), Off the Record (1939), My Son Is a Criminal (1939), and Each Dawn I Die (1939). A solid \"B\" lead player who appeared in support when it came to \"A\" pictures, Baxter occasionally broke out of the \"bad guy\" mold -- but not often. By this time, Alan Ladd was starting to cut in on Alan B.'s action with his moody and sexy versions of trench-coat-trendy villains. Baxter, nevertheless, continued to roll on, playing outlaw \"Jesse James\" in Bad Men of Missouri (1941) opposite Dennis Morgan, Wayne Morris and Arthur Kennedy as the Younger brothers, while adding slick malevolence to such films as Escape to Glory (1940) with Constance Bennett, Under Age (1941) with Nan Grey and Mary Anderson, The Pittsburgh Kid (1941) with Jean Parker and Rags to Riches (1941) with Mary Carlisle. This period of filming was topped by an excellent support role in the classic Alfred Hitchcock thriller, Saboteur (1942), in which he, as the meek-voiced, mustachioed, bespectacled, peroxide blond Nazi spy \"Freeman\", shares a memorable scene with lead Robert Cummings. Following standard work in China Girl (1942) and Behind Prison Walls (1943), Alan, at age 35, signed up for the Army Air Force in 1943, and made an appearance in the Broadway production of Moss Hart's \"Winged Victory\", which later was turned into the 1944 movie version of the same name, Winged Victory (1944) (also featuring Alan). Post-war filming grew more dismal with a high majority of \"Poverty Row\" pictures coming his way. His last appearance in a strong film was the Robert Ryan boxing pic, The Set-Up (1949), as a mobster involved in fixing matches. Alan decided to return to the challenge of the stage, appearing in such plays as \"Home of the Brave\" (1945), \"The Voice of the Turtle\" (1947), \"The Hallams\" (1948), \"Jenny Kissed Me\" (1948), \"Tea and Sympathy\" (1955) and \"South Pacific\" (1957) (in a non-singing role). TV also became a positive medium, with adventure guest roles on The Rifleman (1958), Wagon Train (1957), Colt .45 (1957) and Alfred Hitchcock Presents (1955), among the offerings. By the 1960s, he was seen primarily in incidental film roles, his last being the cult rodent thriller, Willard (1971). Diagnosed with cancer, the twice-married actor died a few years later at the Motion Picture Country Home on May 8, 1976.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjVjZTk0MzItNmJhMy00ZmYwLWJiYWMtMTg3NmZiNzIyM2UwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0062667","name":"Alan Baxter","idIMDB":"nm0062667"},"actorId":"nm0062667","character":"Acey Kile","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Conroy","urlProfile":"http://www.imdb.com/name/nm0175815","urlPhoto":"","biography":{"dateOfBirth":"14 October 1890","placeOfBirth":" Derby, Derbyshire, England, UK","birthName":"Frank Meinberg Conroy","height":"5' 10½\" (1.79 m)","bio":"Frank Conroy was born on October 14, 1890 in Derby, Derbyshire, England as Frank Meinberg Conroy. He was an actor, known for The Naked City (1948), The Ox-Bow Incident (1943) and Grand Hotel (1932). He was married to Ruth Weeker and Helen Robbins. He died on February 24, 1964 in Paramus, New Jersey, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0175815","name":"Frank Conroy","idIMDB":"nm0175815"},"actorId":"nm0175815","character":"Sid Gorman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Louise Beavers","urlProfile":"http://www.imdb.com/name/nm0064792","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmU1NmU1ZDEtMTYyYy00NzYzLWJhY2MtZWU1ODAwZmZiOTI2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 March 1902","placeOfBirth":" Cincinnati, Ohio, USA","height":"5' 4\" (1.63 m)","bio":"1930s and 1940s film actress Louise Beavers was merely one of a dominant gallery of plus-sized and plus-talented African-American character actresses forced to endure blatant, discouraging and demeaning stereotypes during Depression-era and WWII Hollywood. It wasn't until Louise's triumphant role in Fannie Hurst's classic soaper Imitation of Life (1934) that a film of major significance offered a black role of meaning, substance and humanity. Despite the fact that Louise was playing yet another of her endless servile roles as housekeeper Delilah who works for single white mother Claudette Colbert, this time around her character was three-dimensional and not merely a source of servitude and/or or comic relief. She had her own dramatic story and brilliantly handled the heartbreaking co-plot of an appeasing single parent whose light-skinned daughter (played by Fredi Washington) went to cruel and desperate lengths to pass for white. While Louise certainly championed in the role and managed to steal the lion's share of reviews right from under the film's superstar, the movie triggered major controversy and just as many complaints as compliments from both black and white viewers. This certainly did not help what could have been a major, positive shift in black filmmaking. Instead, for the next two or more decades Louise was again forced to retreat into secondary status with precious few opportunities to shine. Ms. Beavers was born in Cincinnati, Ohio, on March 8, 1902 and moved with her family to the Los Angeles area at age 11. A student at Pasadena High School and a choir member at her local church, her mother, a voice teacher, trained Louise for the concert stage but instead the young girl joined an all-female minstrel company called \"Lady Minstrels\" and even hooked up for a time on the vaudeville circuit. A nursing career once entertained was quickly aborted in favor of acting. Her first break of sorts was earning a living as a personal maid and assistant to Paramount star Leatrice Joy (and later actress Lilyan Tashman). By 1924 she was performing as an extra or walk-on in between her chores. A talent agent spotted her and gave her a more noticeable role in Uncle Tom's Cabin (1927). She went on to gain even more visibility, but was invariably stuck in the background cooking or cleaning after the leads. Despite this her beaming smile and good nature paid off. Following scene-grabbing maid roles to such stars as Mary Pickford in Coquette (1929) Linda Watkins in Good Sport (1931), Mae West in She Done Him Wrong (1933), Constance Bennett in What Price Hollywood? (1932) and Jean Harlow in Bombshell (1933), Louise received the role of her career. Her poignant storyline and final death scene deserved an Oscar nomination and many insiders took her snub as deliberate and prejudicial. Five years later her compatriot (and close friend) Hattie McDaniel would become the first black actor to not only earn an Oscar nomination but capture the coveted trophy as well for her subordinate role in Gone with the Wind (1939). Despite their individual triumphs, both ladies continued to trudge through more of the same, albeit steadily. Occasionally Louise was rewarded with such Hollywood \"A\" treats as Made for Each Other (1939) with Carole Lombard, Holiday Inn (1942) starring Bing Crosby, and especially Mr. Blandings Builds His Dream House (1948) with Cary Grant and Myrna Loy. In The Jackie Robinson Story (1950), she offered lovely moments as the baseball star's mother. Although film offers dried up in the 1950s, Louise managed to transfer her talents to the new TV medium, and was one of a number of character actresses hired to play the wise-cracking, problem-solving maid Beulah (1950) during its run. \"Beulah\" was one of the first sitcoms to star a black actor. She also had a recurring role in Disney's \"The Swamp Fox\". In 1957, she made her professional stage debut in San Francisco with the short-lived play \"Praise House\" as a caregiver who extols the Bible through song. Her last few films, which included The Goddess (1958), All the Fine Young Cannibals (1960) and the Bob Hope comedy The Facts of Life (1960) were typical stereotypes and unmemorable. A long time bachelor lady who finally married in the 1950s, the short and stout actress was plagued by health issues in later years, her obesity and diabetes in particular. She lost her fight on October 26, 1962, at age 60 following a heart attack. In 1976 she was posthumously inducted into the Black Filmmakers Hall of Fame.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmU1NmU1ZDEtMTYyYy00NzYzLWJhY2MtZWU1ODAwZmZiOTI2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0064792","name":"Louise Beavers","idIMDB":"nm0064792"},"actorId":"nm0064792","character":"Gloria","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0029118","urlIMDB":"http://www.imdb.com/title/tt0029118","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":"25","month":"09","year":"1937","remarks":null},"filmingDates":null,"copyrightHolder":"Copyright MCMXXXVII in U.S.A. by Metro-Goldwyn-Mayer Corporation (on print); Metro-Goldwyn-Mayer Corp., 9 November 1937, LP7603 (in copyright registry)"},"technical":{"runtime":["1 hr 21 min (81 min)"],"soundMix":["Mono (Western Electric Sound System)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["(8 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.8","filmingLocations":[{"location":"Metro-Goldwyn-Mayer Studios, Hollywood, Los Angeles, California, USA"}],"rated":"PASSED","awards":[],"votes":"982","type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"}],"keywords":{"keywords":["divorce","prison visit","penitentiary","murder","reporter","newspaper","gangster","alcatraz","final showdown","teenager","black hand","african american","laundry room","reference to abraham lincoln","1920s","pregnant woman","fainting","warden","second marriage","reference to jersey city","tear gas","rubber hose","mob boss","cafeteria","gangland murder","paparazzi","media frenzy","prison visitation","black maid","montage","prison train","income tax evasion","cell mate","fbi","reference to napoleon","newspaper headline","new york harbor","prison riot","year 1927","headline","vendetta","great depression","death of title character","main character dies","main character shot","pistol","tough guy","villain played by lead actor","husband wife relationship","baby","adoption","train","photograph","new york city","kidnapping","editor","ship","revenge","torture","transformation","marriage","tax evasion","hideout","riot","san francisco california","father son relationship"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:42:26"}}