{"data":{"movies":[{"title":"Swing High, Swing Low","originalTitle":"","year":"1937","releaseDate":"19370312","directors":[{"name":"Mitchell Leisen","id":"nm0500552"}],"writers":[{"name":"Virginia Van Upp","id":"nm0888144"},{"name":"Oscar Hammerstein II","id":"nm0358564"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMTk3Nzc3Nl5BMl5BanBnXkFtZTcwNjgzNDMyMQ@@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Comedy","Drama","Musical","Romance"],"plot":"In Panama, Maggie King meets soldier Skid Johnson on his last day in the army and reluctantly agrees to a date to celebrate. The two become involved in a nightclub brawl which causes Maggie to miss her ship back to the States. Now stranded, she's forced to move in with Skid and his pal Harry. She soon falls in love with Skid. Skid gets a job playing the trumpet at a local club and becomes a big success. Fame and fortune go to his head which eventually destroys his relationship Maggie and his career.","simplePlot":"In Panama, Maggie King meets soldier Skid Johnson on his last day in the army and reluctantly agrees to a date to celebrate. The two become involved in a nightclub brawl which causes Maggie... ","actors":[{"actorName":"Carole Lombard","urlProfile":"http://www.imdb.com/name/nm0001479","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg5NjI3MDA5Nl5BMl5BanBnXkFtZTcwMzY3OTQ4Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 October 1908","placeOfBirth":" Fort Wayne, Indiana, USA","birthName":"Jane Alice Peters","height":"5' 6\" (1.68 m)","bio":"Carole Lombard was born Jane Alice Peters in Fort Wayne, Indiana, on October 6, 1908. Her parents divorced in 1916 and her mother took the family on a trip out West. While there they decided to settle down in the Los Angeles area. After being spotted playing baseball in the street with the neighborhood boys by a film director, Carole was signed to a one-picture contract in 1921 when she was 12. The film in question was A Perfect Crime (1921). Although she tried for other acting jobs, she would not be seen onscreen again for four years. She returned to a normal life, going to school and participating in athletics, excelling in track and field. By age 15 she had had enough of school, though, and quit. She joined a theater troupe and played in several stage shows, which were for the most part nothing to write home about. In 1925 she passed a screen test and was signed to a contract with Fox Films. Her first role as a Fox player was Hearts and Spurs (1925), in which she had the lead. Right after that film she appeared in a western called Durand of the Bad Lands (1925). She rounded out 1925 in the comedy Marriage in Transit (1925) (she also appeared in a number of two-reel shorts). In 1926 Carole was seriously injured in an automobile accident that resulted in the left side of her face being scarred. Once she had recovered, Fox canceled her contract. She did find work in a number of shorts during 1928 (13 of them, many for slapstick comedy director Mack Sennett), but did go back for a one-time shot with Fox called Me, Gangster (1928). By now the film industry was moving from the silent era to \"talkies\". While some stars' careers ended because of heavy accents, poor diction or a voice unsuitable to sound, Carole's light, breezy, sexy voice enabled her to transition smoothly during this period. Her first sound film was High Voltage (1929) at Pathe (her new studio) in 1929. In 1931 she was teamed with William Powell in Man of the World (1931). She and Powell hit it off and soon married, but the marriage didn't work out and they divorced in 1933. No Man of Her Own (1932) put Carole opposite Clark Gable for the first and only time (they married seven years later in 1939). By now she was with Paramount Pictures and was one of its top stars. However, it was Twentieth Century (1934) that showed her true comedic talents and proved to the world what a fine actress she really was. In 1936 Carole received her only Oscar nomination for Best Actress for My Man Godfrey (1936). She was superb as ditzy heiress Irene Bullock. Unfortunately, the coveted award went to Luise Rainer in The Great Ziegfeld (1936), which also won for Best Picture. Carole was now putting out about one film a year of her own choosing, because she wanted whatever role she picked to be a good one. She was adept at picking just the right part, which wasn't surprising as she was smart enough to see through the good-ol'-boy syndrome of the studio moguls. She commanded and received what was one of the top salaries in the business - at one time it was reported she was making $35,000 a week. She made but one film in 1941, Mr. & Mrs. Smith (1941). Her last film was in 1942, when she played Maria Tura opposite Jack Benny in To Be or Not to Be (1942). Tragically, she didn't live to see its release. The film was completed in 1941 just at the time the US entered World War II, and was subsequently held back for release until 1942. Meanwhile, Carole went home to Indiana for a war bond rally. On January 16, 1942, Carole, her mother, and 20 other people were flying back to California when the plane went down outside of Las Vegas, Nevada. All aboard perished. The highly acclaimed actress was dead at the age of 33 and few have been able to match her talents since.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg5NjI3MDA5Nl5BMl5BanBnXkFtZTcwMzY3OTQ4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001479","name":"Carole Lombard","nicknames":["The Profane Angel","The Hoosier Tornado","The Queen of Screwball Comedy"],"idIMDB":"nm0001479"},"actorId":"nm0001479","character":"Maggie King","urlCharacter":"http://www.imdb.com/character/ch0496336","main":true},{"actorName":"Fred MacMurray","urlProfile":"http://www.imdb.com/name/nm0534045","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMTIyODQ4Nl5BMl5BanBnXkFtZTYwOTk1MTI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 August 1908","placeOfBirth":" Kankakee, Illinois, USA","birthName":"Fredrick Martin MacMurray","height":"6' 3\" (1.91 m)","bio":"Fred MacMurray was likely the most underrated actor of his generation. True, his earliest work is mostly dismissed as pedestrian, but no other actor working in the 1940s and 50s was able to score so supremely whenever cast against type. Frederick Martin MacMurray was born in Kankakee, Illinois, to Maleta Martin and Frederick MacMurray. His father had Scottish ancestry and his mother's family was German. His father's sister was vaudeville performer and actress Fay Holderness. When MacMurray was five years old, the family moved to Beaver Dam in Wisconsin, his parents' birth state. He graduated from Beaver Dam High School (later the site of Beaver Dam Middle School), where he was a three-sport star in football, baseball, and basketball. Fred retained a special place in his heart for his small-town Wisconsin upbringing, referring at any opportunity in magazine articles or interviews to the lifelong friends and cherished memories of Beaver Dam, even including mementos of his childhood in several of his films. In \"Pardon my Past\", Fred and fellow GI William Demarest are moving to Beaver Dam, WI to start a mink farm. MacMurray earned a full scholarship to attend Carroll College in Waukesha, Wisconsin and had ambitions to become a musician. In college, MacMurray participated in numerous local bands, playing the saxophone. In 1930, he played saxophone in the Gus Arnheim and his Coconut Grove Orchestra when Bing Crosby was the lead vocalist and Russ Columbo was in the violin section. MacMurray recorded a vocal with Arnheim's orchestra \"All I Want Is Just One Girl\" -- Victor 22384, 3/20/30. He appeared on Broadway in the 1930 hit production of \"Three's a Crowd\" starring Sydney Greenstreet, Clifton Webb and Libby Holman. He next worked alongside Bob Hope in the 1933 production of \"Roberta\" before he signed on with Paramount Pictures in 1934 for the then-standard 7-year contract (the hit show made Bob Hope a star and he was also signed by Paramount). MacMurray married Lillian Lamont (D: June 22, 1953) on June 20, 1936, and they adopted two children. Although his early film work is largely overlooked by film historians and critics today, he rose steadily within the ranks of Paramount's contract stars, working with some of Hollywood's greatest talents, including wunderkind writer-director Preston Sturges (whom he intensely disliked) and actors Humphrey Bogart and Marlene Dietrich. Although the majority of his films of the 30's can largely be dismissed as standard fare there are exceptions: he played opposite Claudette Colbert in seven films, beginning with The Gilded Lily (1935). He also co-starred with Katharine Hepburn in the classic, Alice Adams (1935), and with Carole Lombard in Hands Across the Table (1935), The Trail of the Lonesome Pine (1936) -- an ambitious early outdoor 3-strip Technicolor hit, co-starring with Henry Fonda and Sylvia Sidney directed by Henry Hathaway -- The Princess Comes Across (1936), and True Confession (1937). MacMurray spent the decade learning his craft and developing a reputation as a solid actor. In an interesting sidebar, artist C.C. Beck used MacMurray as the initial model for a superhero character who would become Fawcett Comics' Captain Marvel in 1939. The 1940s gave him his chance to shine. He proved himself in melodramas such as Above Suspicion (1943) and musicals (Where Do We Go from Here? (1945)), somewhat ironically becoming one of Hollywood's highest-paid actors by 1943, when his salary reached $420,000. He scored a huge hit with the thoroughly entertaining The Egg and I (1947), again teamed with Ms. Colbert and today largely remembered for launching the long-running Ma and Pa Kettle franchise. In 1941, MacMurray purchased a large parcel of land in Sonoma County, California and began a winery/cattle ranch. He raised his family on the ranch and it became the home to his second wife, June Haver after their marriage in 1954. The winery remains in operation today in the capable hands of their daughter, Kate MacMurray. Despite being habitually typecast as a \"nice guy\", MacMurray often said that his best roles were when he was cast against type by Billy Wilder. In 1944, he played the role of \"Walter Neff\", an insurance salesman (numerous other actors had turned the role down) who plots with a greedy wife Barbara Stanwyck to murder her husband in Double Indemnity (1944) -- inarguably the greatest role of his entire career. Indeed, anyone today having any doubts as to his potential depth as an actor should watch this film. He did another stellar turn in the \"not so nice\" category, playing the cynical, spineless \"Lieutenant Thomas Keefer\" in the 1954 production of The Caine Mutiny (1954), directed by Edward Dmytryk. He gave another superb dramatic performance cast against type as a hard-boiled crooked cop in Pushover (1954). Despite these and other successes, his career waned considerably by the late 1950s and he finished out the decade working in a handful of non-descript westerns. MacMurray's career got its second wind beginning in 1959 when he was cast as the dog-hating father figure (well, he was a retired mailman) in the first Walt Disney live-action comedy, The Shaggy Dog (1959). The film was an enormous hit and Uncle Walt green lighted several projects around his middle-aged star. Billy Wilder came calling again and he did a masterful turn in the role of Jeff Sheldrake, a two-timing corporate executive in Wilder's Oscar-winning comedy-drama The Apartment (1960), with Shirley MacLaine and Jack Lemmon -- arguably his second greatest role and the last one to really challenge him as an actor. Although this role would ultimately be remembered as his last great performance, he continued with the lightweight Disney comedies while pulling double duty, thanks to an exceptionally generous contract, on TV. MacMurray was cast in 1961 as Professor Ned Brainerd in Disney's The Absent Minded Professor (1961) and in its superior sequel, Son of Flubber (1963). These hit Disney comedies raised his late-career profile considerably and producer Don Fedderson beckoned with My Three Sons (1960) debuting in 1960 on ABC. The gentle sitcom staple remained on the air for 12 seasons (380 episodes). Concerned about his work load and time away from his ranch and family, Fred played hardball with his series contract. In addition to his generous salary, the \"Sons\" contract was written so that all the scenes requiring his presence to be shot first, requiring him to work only 65 days per season on the show (the contract was reportedly used as an example by Dean Martin when negotiating the wildly generous terms contained in his later variety show contract). This requirement meant the series actors had to work with stand-ins and posed wardrobe continuity issues. The series moved without a hitch to CBS in the fall of 1965 in color after ABC, then still an also-ran network with its eyes peeled on the bottom line, refused to increase the budget required for color production (color became a U.S. industry standard in the 1968 season). This freed him to pursue his film work, family, ranch, and his principal hobby, golf. Politically very conservative, MacMurray was a staunch supporter of the Republican Party; he joined his old friend Bob Hope and James Stewart in campaigning for Richard Nixon in 1968. He was also widely known one of the most -- to be polite -- frugal actors in the business. Stories floated around the industry in the 60s regarding famous hard-boiled egg brown bag lunches and stingy tips. After the cancellation of My Three Sons in 1972, MacMurray made only a few more film appearances before retiring to his ranch in 1978. As a result of a long battle with leukemia, MacMurray died of pneumonia at the age of eighty-three in Santa Monica on November 5, 1991. He was buried in the Holy Cross Cemetery in Culver City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMTIyODQ4Nl5BMl5BanBnXkFtZTYwOTk1MTI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0534045","name":"Fred MacMurray","nicknames":["Bud"],"idIMDB":"nm0534045"},"actorId":"nm0534045","character":"Skid Johnson","urlCharacter":"http://www.imdb.com/character/ch0498263","main":true},{"actorName":"Charles Butterworth","urlProfile":"http://www.imdb.com/name/nm0125325","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzc4NjkyNjAtYWUyZS00MDNjLTk5YTctZTczMTU1YmU5MGRkL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1896","placeOfBirth":" South Bend, Indiana, USA","birthName":"Charles Edward Butterworth","bio":"Charles Butterworth was, before he came to Hollywood in 1930, a stage attraction on Broadway. In the '30s, he had his big successes as the hero's no-nonsense best friend. He made a practice of ad-libbing dry quips and bons mots during shooting, and screenwriters took advantage of this by writing only fragments of his scripts, hoping that he would fill in the missing lines. He didn't like that very much, however, and his star began sinking in the late '30s. In the '40s, he worked for smaller studios; Warner's A production, This Is the Army (1943), was a notable exception. Two years after his last movie, Dixie Jamboree (1944) for PRC, he died in a car crash.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzc4NjkyNjAtYWUyZS00MDNjLTk5YTctZTczMTU1YmU5MGRkL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0125325","name":"Charles Butterworth","idIMDB":"nm0125325"},"actorId":"nm0125325","character":"Harry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jean Dixon","urlProfile":"http://www.imdb.com/name/nm0228863","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmNlY2M0ZWEtOWMwOC00NjJkLTgwMDItNjRlZDk2NzJmZGM3XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 July 1893","placeOfBirth":" Waterbury, Connecticut, USA","birthName":"Marie Mercedes Jacques","bio":"Connecticut-born Jean Dixon had an auspicious theatre debut: on a Parisian stage with Sarah Bernhardt while still a student at a French university. Upon her return to the U.S. in 1921, she made her Broadway debut, and thereafter appeared in many stage productions, on Broadway and across the country, before Hollywood called her in 1929. She most often appeared as the streetwise, smart-mouthed friend of the leading lady. Her most famous appearance would probably be as Molly in the classic screwball comedy My Man Godfrey (1936).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmNlY2M0ZWEtOWMwOC00NjJkLTgwMDItNjRlZDk2NzJmZGM3XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0228863","name":"Jean Dixon","idIMDB":"nm0228863"},"actorId":"nm0228863","character":"Ella","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dorothy Lamour","urlProfile":"http://www.imdb.com/name/nm0483787","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1OTE5ODEwNF5BMl5BanBnXkFtZTYwMzkyNjI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1914","placeOfBirth":" New Orleans, Louisiana, USA","birthName":"Mary Leta Dorothy Slaton","height":"5' 5\" (1.65 m)","bio":"In addition to being Miss New Orleans in 1931, Dorothy Lamour worked as a Chicago elevator operator; band vocalist for her first husband, band leader Herbie Kaye; and radio performer. In 1936 she donned her soon-to-be-famous sarong for her debut at Paramount, The Jungle Princess (1936), and continued to play female Tarzan-Crusoe-Gauguin-girl-with make-up parts through the war years and beyond. The most famous of these was in the popular Bob Hope/Bing Crosby \"Road\" pictures - a strange combination of adventure, slapstick, ad-libs and Hollywood inside jokes. Of these she said, \"I was the happiest and highest-paid straight woman in the business.\" As she aged, however, the quality of her films dropped. Among her serious films were Johnny Apollo (1940) and A Medal for Benny (1945).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1OTE5ODEwNF5BMl5BanBnXkFtZTYwMzkyNjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0483787","name":"Dorothy Lamour","nicknames":["The Beautiful One","The Sarong Girl","Dottie"],"idIMDB":"nm0483787"},"actorId":"nm0483787","character":"Anita Alvarez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harvey Stephens","urlProfile":"http://www.imdb.com/name/nm0827031","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1Zjg4MDQtZTAzYy00YTdjLWIxYTYtMDYzZTgxMGZiNjZkXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 August 1901","placeOfBirth":" Los Angeles, California, USA","birthName":"William Harvey Stephens","height":"5' 11½\" (1.82 m)","bio":"At age 30, actor Harvey Stephens had a sophisticated charm and staid, long-jawed handsomeness that seemed ideal for the big screen, particularly in elegant or period settings. A veteran of a handful of Broadway shows by the time he made his sudden move to film, he was handed on a silver platter a debut starring role. The drawback was that playing opposite him would be a Broadway legend and one the boldest scenery chewers of all-time -- Tallulah Bankhead. The \"leading man\" opportunities went quickly downhill from there for Harvey but he redeemed himself quite well in the next few years as a poised second lead player and (later) dependable character actor on TV. Born on August 21, 1901, the Los Angeles native attended U.C.L.A. before training with Walter Hampden's repertory company for two years as well as in various other stock companies. He had already married Beatrice Nichols in 1929 by the time he established himself on Broadway. Taking his first Broadway bow with a role in \"Other Men's Wives\" (1929), he went on to appear in \"Dishonored Lady\" (1930) with the great Katharine Cornell and \"Tomorrow and Tomorrow\" (1931) with Herbert Marshall and Zita Johann by the time Hollywood came calling. Paramount's Pre-Code drama The Cheat (1931) was an auspicious first assignment For Harvey in which he was cast as decent, upper-scale guy Jeffrey Carlyle, the concerned husband to voracious party girl and gambler Elsa Carlyle, played to the hilt by Tallulah Bankhead. Bankhead, the larger-than-life celebrity deemed too big for the screen, took no prisoners and Harvey was dwarfed for most of the proceedings. Despite his obvious talent, Harvey's big chance for stardom was snuffed out. This would be his first and only chance at male star movie material. Continuing diligently on Broadway in such plays as \"The Animal Kingdom\" (1932) with Leslie Howard, \"Best Years\" (1932), \"Conquest\" (1932), \"I Loved You Wednesday\" (1932) and \"The Party's Over\" (1933), Fox signed Harvey up in 1933 and from there he appeared in second leads and/or \"other man\" parts, bolstering a number of quality films and providing a good-looking distraction between some of Hollywood's most popular cinematic stars. His first ruffled up the Janet Gaynor and Warner Baxter coupling in the comedy Paddy the Next Best Thing (1933). From there he enjoyed playing cads, flirts, and various wealthy suitor types who tried to come between some of Hollywood's glossiest and most popular pairings: William Powell and 'Myrna Loy' in Evelyn Prentice (1934); Spencer Tracy and Myrna Loy in Whipsaw (1935); Claudette Colbert and Fred MacMurray in Maid of Salem (1937); and Carole Lombard and Fred MacMurray in Swing High, Swing Low (1937). By the end of the decade, however, Harvey was receiving credit much further down the list, especially in the higher-quality films of a Beau Geste (1939), Abe Lincoln in Illinois (1940), Sergeant York (1941) and Lady in the Dark (1944). By the end of WWII, his film career had subsided drastically. As such, he returned to Broadway in 1944 with both \"Over 21\" starring Ruth Gordon and \"Violet\". In 1949 he had an officious featured role in the musical classic \"South Pacific\" starring Mary Martin and Ezio Pinza in the non-singing role of Lt. Harbison, only one of two non-singing parts in the show. He stayed with the show for several years. TV occupied much of Harvey's time in the 1950s, now a well-oiled character actor, but he never found any one series that might have given his character name a noticeable boost. His last Broadway role came with \"Time Limit\" (1956). Following unbilled roles in The Young Lions (1958), North by Northwest (1959) and Advance to the Rear (1964), he ended his career on TV in 1965 with an episode of \"Bonanza,\" then retired quietly to the Southern California area. Harvey died just a few days before Christmas in 1986 at the Saddleback Medical Center in Laguna Hills, California, and was survived by present wife Barbara and three children. He was 85 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1Zjg4MDQtZTAzYy00YTdjLWIxYTYtMDYzZTgxMGZiNjZkXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0827031","name":"Harvey Stephens","idIMDB":"nm0827031"},"actorId":"nm0827031","character":"Harvey Howell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cecil Cunningham","urlProfile":"http://www.imdb.com/name/nm0192258","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjBmMmFhZjMtMTU0ZS00ZTk4LTk4NDItYjQ3ZTJlOTQxNWYwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 August 1888","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Edna Cecil Cunningham","height":"5' 8\" (1.73 m)","bio":"Cecil Cunningham was born on August 2, 1888 in St. Louis, Missouri, USA as Edna Cecil Cunningham. She was an actress, known for The Awful Truth (1937), Kitty Foyle (1940) and Come and Get It (1936). She was married to Jean C. Havez. She died on April 17, 1959 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjBmMmFhZjMtMTU0ZS00ZTk4LTk4NDItYjQ3ZTJlOTQxNWYwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0192258","name":"Cecil Cunningham","idIMDB":"nm0192258"},"actorId":"nm0192258","character":"Murphy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Arnt","urlProfile":"http://www.imdb.com/name/nm0036792","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWZjNTc4OTItZmJlOC00MzkxLWEyYTYtMDAxMjZjMjk3MjdhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 August 1906","placeOfBirth":" Michigan City, Indiana, USA","bio":"Charles Arnt was born on August 20, 1906 in Michigan City, Indiana, USA. He was an actor, known for My Favorite Brunette (1947), Sweet Bird of Youth (1962) and Ball of Fire (1941). He died on August 6, 1990 in Orcas Island, Washington, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWZjNTc4OTItZmJlOC00MzkxLWEyYTYtMDAxMjZjMjk3MjdhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0036792","name":"Charles Arnt","idIMDB":"nm0036792"},"actorId":"nm0036792","character":"Georgie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Franklin Pangborn","urlProfile":"http://www.imdb.com/name/nm0659427","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NTM3MTc3MF5BMl5BanBnXkFtZTgwOTgzODE1MzE@._V1._CR114,136,541,718_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 January 1889","placeOfBirth":" Newark, New Jersey, USA","birthName":"Joseph Franklin Pangborn","height":"5' 10½\" (1.79 m)","bio":"Franklin Pangborn - a name more befitting a fictionalized bank president rather than a great comedic actor - was a singular character actor but little is known of his early years. He spent some time in developing acting talent prior to appearing on Broadway by March of 1911, and would do six plays until mid-1913. He was noticeably absent afterward and corresponding with the early years of World War I. He was in the US Army after America entered the war in 1917. Pangborn did one more play on Broadway in 1924. Interestingly, for someone immediately identified with comedy, Pangborn's roles were for the most part dramatic and included Armand Duval in \"Camille\", a role in a play adaptation of \"Ben Hur\", and two parts in \"Joseph and His Brethren\". Two years later, Pangborn turned to silent films. And although he would play some villains and romantic leads, that droopy pudding-face of his was bound for comedy. In all these early roles from his debut in 1926, his first talkie (On Trial (1928)), and on through most of 1932 (when he made 24 appearances on film), Pangborn was playing comedic roles, many of which were for short films (many by Mack Sennett) where the players usually had no on-screen persona and no billing credit. His many appearances in shorts tapered off and ended through 1935. These roles were quite varied and continued as such into the later 1930s. He played the compromised husband in two Bing Crosby vehicles (1933); no fewer than three photographers, reporters, radio announcers, bartenders, and much more, including a character meant to parody his own name: 'Mr. Pingboom' (Turnabout (1940)). But through the same period he was piling up a lot of clerk, floorwalker, and, perhaps most of all, hotel manager roles. These latter were the basis for Pangborn typed as the straight-laced, nervous minor official or service provider or manager of whatever whose smug self-assurance in his orderly world is sorely tested. The term 'sissy' (so prominent a condemnation from childhood memories) was used in early film (and still used today by some film historians) as a catchall name for a spectrum of rather gentle and nebulous male personalities; a simpering voice of any kind would be an instant label that also implied the taboo of homosexuality. Pangborn is often first on the list of actors noted as typed in this general category with Edward Everett Horton with his dignified but slightly simpering New England drawl a close second. Animator Robert Clampett at Warner Bros. in the late 1940s patterned his Goofy Gophers, Mac and Tosh, with their polite and flowery speech after both men. Pangborn had a mellow, lyrical voice which he could ramp up to a staccato, rapid-fire rhythm when perturbed. Indeed, the face and the voice fit well with characters of convention and control, as well as the fastidious to the point of being another slang term of many faces: 'prissy'. And maybe that does not include effeminate - he was not quite that - though the term is indelibly tagged to the character type. His characters were the sort of proper and snobby figures who the easygoing American public would find suspicious - and thus all the funnier on screen when they get their comeuppance. Yet Pangborn never implied 'gay' in his portrayals despite all the gender revisionism of today that might reinterpret his work as such. In real life, people are more complex; on the mainstream screen - as opposed to the shadowy blue one - of the 1930s and 40s, characters were more generally defined within usual convention. By the later 1930s, Pangborn had perfected a wonderful sense of timing of demeanor, manner, and voice to fit the control freak who is gradually dragged into his worst nightmare of relative chaos by hapless situation. By this time his characterizations were such a fixture of guaranteed laughs that the movie-going public expected to see him. Pangborn was in great demand to do what he did best. And having already worked from the silent era with great stars and directors, he continued to do so. W.C. Fields was a great fan of him and used him in several movies. He was a constant in smart comedy from Frank Capra and Gregory La Cava to the more extreme screwball comedies of Preston Sturges, though frequently upstaged with such a company of funny men as Sturges gathered around him. The Pangborn progression from very funny to uproarious is seen evolved, for example, from De Cava's My Man Godfrey (1936) to Sturges's Hail the Conquering Hero (1944). In the first he is the volunteer swell who coordinates store-keeping for the scavenger hunt of his fellow - if downright silly - affluent crust of New York society. As the flow of items brought to him for registering turns into a flood (including a live goat kid), his demeanor, mannerisms, and vocal speed display increasing irritation. Head spinning, he is in defensive mode as he fends off shouting, grabbing participants. The role perhaps was his defining moment as established celebrity comedian. In Sturges's movie, and Pangborn appeared in most of his best efforts, he is the committee chairman of the reception for false hero Eddie Bracken, trying to coordinate festivities and caught in a literal battle of bands at the beginning of the film. Converged upon by various hokey town bands who all want to play the featured pieces, Pangborn attempts order but is methodically carried away as people out of the blue arrive to suggest other songs, and the bands continue to assail him with arguments, and finally all play all the songs - and all at once - to prove the most deserving. It is musical chaos with Pangborn finally reduced to desperate blasts on a whistle and jumping up and down, yelling \"Not yet! Not yet!\" It is one of the actor's finest pieces. Yet Pangborn's usual stock of characters could fit drama as well. Actually, in \"Hero\", his coordinator also has some straight scenes as well. In Now, Voyager (1942) as the cruise tourist director, his only problem is that Bette Davis has not arrived on deck to be partnered for the land touring of Rio. As an accomplished stage actor, he did miss the boards. Friend of Edward Horton, he was able to exchange his quirky screen characters for dramatic ones, participating in Horton's Los Angeles-based Majestic Theatre productions. But times changed for Pangborn's specialties. Movies were more diverse and updated as the 1950s ensued. But he was immediately adaptable to the small screen which would re-introduce him. He was right at home as a guest star on TV comedy shows, playing his beloved characters as cameo celebrations of his matter-of-fact stardom. There were a handful of film roles in his last decade with perhaps the overambitious and black-and-white dull but star-studded The Story of Mankind (1957) a bit of a showcase. Also in 1957 he had the singular distinction of being honored as guest announcer - a familiar enough role - and first guest star on the premiere of the \"Tonight Show\" with its first host Jack Paar. To pass away after surgery seems such a disordered way to go for one such as Franklin Pangborn whose on-screen characters struggled for order above all else. There is no order in the frailty of life by definition, but Pangborn's legacy, rich in comedic gems, has and surely will continue to endure.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NTM3MTc3MF5BMl5BanBnXkFtZTgwOTgzODE1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0659427","name":"Franklin Pangborn","idIMDB":"nm0659427"},"actorId":"nm0659427","character":"Henri","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anthony Quinn","urlProfile":"http://www.imdb.com/name/nm0000063","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MTAxMzIxMV5BMl5BanBnXkFtZTYwODc3OTE2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 April 1915","placeOfBirth":" Chihuahua, Mexico","birthName":"Antonio Rodolfo Quinn Oaxaca","height":"6' 2\" (1.88 m)","bio":"Anthony Quinn was born Antonio Rudolfo Oaxaca Quinn on April 21, 1915, in Chihuahua, Mexico, to Manuela (Oaxaca) and Francisco Quinn, who became an assistant cameraman at a Los Angeles (CA) film studio. His paternal grandfather was Irish, and the rest of his family was Mexican. After starting life in extremely modest circumstances in Mexico, his family moved to Los Angeles, where he grew up in the Boyle Heights and Echo Park neighborhoods. He attended Polytechnic High School and later Belmont High, but eventually dropped out. The young Quinn boxed (which stood him in good stead as a stage actor, when he played Stanley Kowalski in \"A Streetcar Named Desire\" to rave reviews in Chicago), then later studied architecture under Frank Lloyd Wright at the great architect's studio, Taliesin, in Arizona. Quinn was close to Wright, who encouraged him when he decided to give acting a try. After a brief apprenticeship on stage, Quinn hit Hollywood in 1936 and picked up a variety of small roles in several films at Paramount, including an Indian warrior in The Plainsman (1936), which was directed by the man who later became his father-in-law, Cecil B. DeMille. As a contract player at Paramount, Quinn mainly played villains and ethnic types, such as an Arab chieftain in the Bing Crosby-Bob Hope vehicle Road to Morocco (1942). As a Mexican national (he did not become an American citizen until 1947), he was exempt from the draft. With many actors in the service fighting World War II, Quinn was able to move up into better supporting roles. He had married DeMille's daughter Katherine DeMille, which afforded him entrance to the top circles of Hollywood society. He became disenchanted with his career and did not renew his Paramount contract despite the advice of others, including his father-in-law (whom Quinn felt never accepted him due to his Mexican roots). Instead, he returned to the stage to hone his craft. His portrayal of Stanley Kowalski in \"A Streetcar Named Desire\" in Chicago and on Broadway (where he replaced the legendary Marlon Brando, who is forever associated with the role) made his reputation and boosted his film career when he returned to the movies. Brando and Elia Kazan, who directed \"Streetcar\" on Broadway and on film (A Streetcar Named Desire (1951)), were crucial to Quinn's future success. Kazan, knowing the two were potential rivals due to their acclaimed portrayals of Kowalski, cast Quinn as Brando's brother in his biographical film of Mexican revolutionary Emiliano Zapata, Viva Zapata! (1952). Quinn won the Best Supporting Actor Academy Award for 1952, making him the first Mexican-American to win an Oscar. It was not to be his lone appearance in the winner's circle: he won his second Supporting Actor Oscar in 1957 for his portrayal of Paul Gauguin in Vincente Minnelli's biographical film of Vincent van Gogh, Lust for Life (1956), opposite Kirk Douglas. Over the next decade Quinn lived in Italy and became a major figure in world cinema, as many studios shot films in Italy to take advantage of the lower costs (\"runaway production\" had battered the industry since its beginnings in the New York / New Jersey area in the 1910s). He appeared in several Italian films, giving one of his greatest performances as the circus strongman who brutalizes the sweet soul played by Giulietta Masina in her husband Federico Fellini's masterpiece La Strada (1954). Alternating between Europe and Hollywood, Quinn built his reputation and entered the front rank of character actors and character leads. He received his third Oscar nomination (and first for Best Actor) for George Cukor's Wild Is the Wind (1957). He played a Greek resistance fighter against the Nazi occupation in the monster hit The Guns of Navarone (1961) and received kudos for his portrayal of a once-great boxer on his way down in Rod Serling's Requiem for a Heavyweight (1962). He went back to playing ethnic roles, such as an Arab warlord in David Lean's masterpiece Lawrence of Arabia (1962), and he played the eponymous lead in the \"sword-and-sandal\" blockbuster Barabbas (1961). Two years later, he reached the zenith of his career, playing Zorba the Greek in the film of the same name (a.k.a. Zorba the Greek (1964)), which brought him his fourth, and last, Oscar nomination as Best Actor. The 1960s were kind to him: he played character leads in such major films as The Shoes of the Fisherman (1968) and The Secret of Santa Vittoria (1969). However, his appearance in the title role in the film adaptation of John Fowles' novel, The Magus (1968), did nothing to save the film, which was one of that decade's notorious turkeys. In the 1960s, Quinn told Life magazine that he would fight against typecasting. Unfortunately, the following decade saw him slip back into playing ethnic types again, in such critical bombs as The Greek Tycoon (1978). He starred as the Hispanic mayor of a southwestern city on the short-lived television series The Man and the City (1971), but his career lost its momentum during the 1970s. Aside from playing a thinly disguised Aristotle Onassis in the cinematic roman-a-clef The Greek Tycoon (1978), his other major roles of the decade were as Hamza in the controversial The Message (1976) (a.k.a. \"Mohammad, Messenger of God\"), as the Italian patriarch in The Inheritance (1976), yet another Arab in Caravans (1978) and a Mexican patriarch in The Children of Sanchez (1978). In 1983, he reprised his most famous role, Zorba the Greek, on Broadway in the revival of the musical \"Zorba\", for 362 performances. Though his film career slowed during the 1990s, he continued to work steadily in films and television. Quinn lived out the latter years of his life in Bristol, Rhode Island, where he spent most of his time painting and sculpting. He died in a hospital in Boston from pneumonia and respiratory failure linked to his battle with lung cancer. He was 86 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MTAxMzIxMV5BMl5BanBnXkFtZTYwODc3OTE2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000063","name":"Anthony Quinn","nicknames":["Tony"],"idIMDB":"nm0000063"},"actorId":"nm0000063","character":"The Don","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Judels","urlProfile":"http://www.imdb.com/name/nm0431882","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYwNmVlZjEtYTc2MS00ZDg0LWEyMTctM2U0NmY2ZGVhMjI4XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 August 1882","placeOfBirth":" Amsterdam, Noord-Holland, Netherlands","bio":"Charles Judels or Charles Judel was born in Amsterdam in 1882. starred on vaudeville in the early 1900s, made his Broadway stage debut in 'The Ziegfeld Follies of 1912'. highly talented chubby man who appeared in more than 130 American comedy and drama movies, an expert with dialects served him well throughout his career, his first film was a comedy 'Old Dutch' directed by Frank Hall Crane and starring Lew Fields for the Shubert Film Co in 1915, perhaps best remembered as the cheese-store proprietor in Laurel & Hardy's 1938 film 'Swiss Miss', he also did extensive work as a voice actor in animated films most notably as the voice of Stromboli in Disney's 'Pinocchio'. His last appearance on screen as a Danite Merchant in 'Samson and Delitah' in 1949.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYwNmVlZjEtYTc2MS00ZDg0LWEyMTctM2U0NmY2ZGVhMjI4XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0431882","name":"Charles Judels","idIMDB":"nm0431882"},"actorId":"nm0431882","character":"Tony","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0029626","urlIMDB":"http://www.imdb.com/title/tt0029626","business":{"budget":{"money":"$739,621","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":"27","month":"01","year":"1937","remarks":null},"filmingDates":null,"copyrightHolder":"Copyright MCMXXXVII by Paramount Pictures, Inc. (on print); © Paramount Pictures, Inc.; 12 March 1937; LP7037 (in copyright registry)"},"technical":{"runtime":["1 hr 32 min (92 min)","1 hr 22 min (82 min) (2005 DVD release) (USA)"],"soundMix":["Mono (Western Electric Noiseless Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["(10 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.5","filmingLocations":[],"rated":"PASSED","awards":[],"votes":"471","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["trumpet","success","stranded","soldier","ship","panama","nightclub","repetition in title","wedding","wager","trial","telegram","talent agent","singer","rooster","radio broadcasting","police","pianist","panama canal","new york city","musician","marriage","jail","hypochondriac","hotel","gambling","fistfight","engagement","drunkenness","divorce","dissipation","cockfighting","christmas eve","cafe","beauty salon","arrest","based on play"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:38:48"}}