{"data":{"movies":[{"title":"Barefoot in the Park","originalTitle":"","year":"1967","releaseDate":"19670525","directors":[{"name":"Gene Saks","id":"nm0757256"}],"writers":[{"name":"Neil Simon","id":"nm0800319"},{"name":"Neil Simon","id":"nm0800319"}],"runtime":"106 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjJiNzhkNGYtNDRhNi00NjNjLWJmZGEtOTQ1ZDM2NDM0ODgzXkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"New Yorkers Paul Bratter and Corie Bratter née Banks have just gotten married. He is a stuffed shirt just starting his career as a lawyer. She is an independently minded free spirit who prides herself on doing the illogical purely out of a sense of adventure, such acts as walking through Washington Square Park barefoot when it's 17°F outside. Their six day honeymoon at the Plaza Hotel shows that they can get to know each other easily in the biblical sense. But they will see if they can get to know each other in their real life when they move into their first apartment, a cozy (in other words, small), slightly broken down top floor unit in a five story walk-up. While Corie joyfully bounds up and down the stairs, Paul, always winded after the fact, hates the fact of having to walk up the six flights of stairs, if one includes the stairs that comprise the outside front stoop. Beyond the issues with the apartment itself, Paul and Corie will have to deal with an odd assortment of neighbors...","simplePlot":"Paul, a conservative young lawyer, marries the vivacious Corie. Their highly passionate relationship descends into comical discord in a five-flight New York City walk-up apartment.","actors":[{"actorName":"Robert Redford","urlProfile":"http://www.imdb.com/name/nm0000602","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1Nzc5MzQyMV5BMl5BanBnXkFtZTcwNjQ5OTA0Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1936","placeOfBirth":" Santa Monica, California, USA","birthName":"Charles Robert Redford Jr.","height":"5' 10½\" (1.79 m)","bio":"Charles Robert Redford, Jr. was born on August 18, 1936, in Santa Monica, California, to Martha (Hart), from Texas, and Charles Robert Redford, an accountant for Standard Oil, who was originally from Connecticut. He is of English, Scottish, Cornish, and Irish ancestry. Robert's mother died in 1955, the year after he graduated from high school. Robert was a scrappy kid who stole hubcaps in school and lost his college baseball scholarship at the University of Colorado because of drunkenness. After leaving UoC, he spent some time drifting across America, spending a time working in the California oil fields. Having saved enough he moved to Europe studying art in Paris and Florence.Back in the States he decided on a career as a theatrical designer in New York. Enrolling at the American Academy of Dramatic Art he turned to acting making his stage debut in 'Tall Story'. In 1962 he was signed for the stage production of 'Barefoot in the Park' which was a smash hit but it wasn't until 5 years later when it was filmed that he became an important star. Television and stage experience coupled with all-American good looks led to movies and television roles. His breakthrough role was \"The Sundance Kid\" in Butch Cassidy and the Sundance Kid (1969), when the actor was 32. The Way We Were (1973) and The Sting (1973), both in 1973, made Redford the number one box office star for the next three years. Redford used his clout to advance environmental causes and his riches to acquire Utah property, which he transformed into a ranch and the Sundance ski resort. In 1980, he established the Sundance Institute for aspiring filmmakers. Its annual film festival has become one of the world's most influential. Redford's directorial debut, Ordinary People (1980), won him the Academy Award as Best Director in 1981. He waited eight years before getting behind the camera again, this time for the screen version of John Nichols' acclaimed novel of the Southwest, The Milagro Beanfield War (1988). He scored with critics and fans in 1992 with the Brad Pitt film A River Runs Through It (1992), and again, in 1994, with Quiz Show (1994), which earned him yet another Best Director nomination. Lola Van Wagenen (consumer activist), born in 1940, dropped out of college to marry Redford on September 12, 1958. They divorced in 1985 after having four children, one of whom died of sudden infant death syndrome (SIDS). Daughter Shauna Redford, born November 15, 1960, is a painter who married Eric Schlosser on October 5, 1985, in Provo, UT. Her first child, born in January 1991, made Redford a grandfather. Son James Redford (aka Jamie Redford), a screenwriter, was born May 5, 1962. Daughter Amy Redford, an actress; was born October 22, 1970. Redford also has a brother named William.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1Nzc5MzQyMV5BMl5BanBnXkFtZTcwNjQ5OTA0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000602","name":"Robert Redford","nicknames":["Bob"],"idIMDB":"nm0000602"},"actorId":"nm0000602","character":"Paul Bratter","urlCharacter":"http://www.imdb.com/character/ch0024544","main":true},{"actorName":"Jane Fonda","urlProfile":"http://www.imdb.com/name/nm0000404","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQ5NTE2MDAzOV5BMl5BanBnXkFtZTgwOTQ3MTQ3MjE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 December 1937","placeOfBirth":" New York City, New York, USA","birthName":"Lady Jayne Seymour Fonda","height":"5' 8\" (1.73 m)","bio":"Born in New York City to legendary screen star Henry Fonda and New York socialite Frances Seymour Brokaw, Jane Seymour Fonda was destined early to an uncommon and influential life in the limelight. Although she initially showed little inclination to follow her father's trade, she was prompted by Joshua Logan to appear with her father in the 1954 Omaha Community Theatre production of \"The Country Girl\". Her interest in acting grew after meeting Lee Strasberg in 1958 and joining the Actors Studio. Her screen debut in Tall Story (1960) (directed by Logan) marked the beginning of a highly successful and respected acting career highlighted by two Academy Awards for her performances in Klute (1971) and Coming Home (1978), and five Oscar nominations for Best Actress in They Shoot Horses, Don't They? (1969), Julia (1977), The China Syndrome (1979), The Morning After (1986) and On Golden Pond (1981), which was the only film she made with her father. Her professional success contrasted with her personal life, which was often laden with scandal and controversy. Her appearance in several risqué movies (including Barbarella (1968)) by then-husband Roger Vadim was followed by what was to become her most debated and controversial period: her espousal of anti-establishment causes and especially her anti-war activities during the Vietnam War. Her political involvement continued with fellow activist and husband Tom Hayden in the late 1970s and early 1980s. In the 1980s she started the aerobic exercise craze with the publication of the \"Jane Fonda's Workout Book\". She and Hayden divorced, and she married broadcasting mogul Ted Turner in 1991.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQ5NTE2MDAzOV5BMl5BanBnXkFtZTgwOTQ3MTQ3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000404","name":"Jane Fonda","nicknames":["Lady Jane"],"idIMDB":"nm0000404"},"actorId":"nm0000404","character":"Corie Bratter","urlCharacter":"http://www.imdb.com/character/ch0024545","main":true},{"actorName":"Charles Boyer","urlProfile":"http://www.imdb.com/name/nm0000964","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU0MzQ3ODU1Ml5BMl5BanBnXkFtZTcwNjc5NTYwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1899","placeOfBirth":" Figeac, Lot, France","height":"5' 9\" (1.75 m)","bio":"Charles Boyer studied philosophy before he went to the theater where he gave his debut in 1920. Although he had at first no intentions to pursue a career at the movies (his first movie was L'homme du large (1920) by Marcel L'Herbier) he used his chance in Hollywood after several filming stations all over Europe. In the beginning of his career his beautiful voice was hidden by the silent movies but in Hollywood he became famous for his whispered declarations of love (like in movies with Greta Garbo, Marlene Dietrich or Ingrid Bergman). In 1934 he married Pat Paterson, his first and (unusual for a star) only wife. He was so faithful to her that he decided to commit suicide two days after her death in 1978.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU0MzQ3ODU1Ml5BMl5BanBnXkFtZTcwNjc5NTYwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000964","name":"Charles Boyer","nicknames":["The Latin Lover"],"idIMDB":"nm0000964"},"actorId":"nm0000964","character":"Victor Velasco","urlCharacter":"http://www.imdb.com/character/ch0024547","main":true},{"actorName":"Mildred Natwick","urlProfile":"http://www.imdb.com/name/nm0622450","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMzAwNDMyMF5BMl5BanBnXkFtZTcwNzg2NTMxOA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1905","placeOfBirth":" Baltimore, Maryland, USA","bio":"A disarming character lady quite capable of scene-stealing, Mildred Natwick was a well-rounded talent with distinctively dowdy features and idiosyncratic tendencies who, over a six-decade period, assembled together a number of unforgettable matrons on stage and (eventually) film and TV. Whimsical, feisty, loony, stern, impish, shrewish, quizzical, scheming -- she greatly enhanced both comedies and dramas and, thankfully, her off-centered greatness was captured perfectly on occasion by such film directors as John Ford, Alfred Hitchcock and Neil Simon. A short, plumpish, oval-eyed figure with a unique flowery, honey-glazed voice, Natwick was born on June 19, 1905 (some sources list 1908) to Joseph (a businessman) and and Mildred Marion Dawes Natwick. The Baltimore native graduated from both the Bryn Mawr School (in Baltimore) and also from Bennett College in Dutchess County, N.Y., where she majored in drama. Breaking into the professional field touring on stage, Miss Natwick joined the Vagabonds in the late 1920s, a non-professional group from Baltimore. She later became part of the renowned University Players at Cape Cod, Massachusetts, whose rising performers at the time included Henry Fonda, Margaret Sullavan and James Stewart. Natwick made her Broadway bow in the 1932 melodrama \"Carry Nation,\" directed by Blanche Yurka with Esther Dale in the title role. In the cast was Joshua Logan, whom she befriended and later corroborated with when he turned director. She then continued her momentum on 1930s Broadway with \"Amourette\" (1933), \"Spring in Autumn\" (1933), \"The Wind and the Rain\" (1934), \"The Distaff Side\" (1934) \"End of Summer\" (1936), \"Love from a Stranger\" (1936), \"The Star-Wagon\" (1937), \"Missouri Legend\" (1938), \"Stars in Your Eyes\" (1939) (directed by Logan), and \"Christmas Eve\" (1939). Natwick did not come to films until middle age (35) with the John Ford classic The Long Voyage Home (1940), in which she played a Cockney floozie. Despite her fine work in this minor part, she did not make another film until her landlady role five years later in The Enchanted Cottage (1945) supporting Dorothy McGuire and Robert Young. Not a great beauty by Hollywood standards, Natwick learned quickly in Hollywood that if she were to succeed, it would be as a character performer. Ford himself picked up on her versatility and used her repeatedly in several of his post-war classics -- 3 Godfathers (1948), She Wore a Yellow Ribbon (1949), and The Quiet Man (1952). Never abandoning the theater for long, Natwick excelled as Miss Garnett in George Bernard Shaw's \"Candida\" and as the buoyant medium in Noël Coward's \"Blithe Spirit\". As for the big screen, she was sporadically seen in such films as Yolanda and the Thief (1945), The Late George Apley (1947), A Woman's Vengeance (1948), The Kissing Bandit (1948), Cheaper by the Dozen (1950) and Against All Flags (1952). Making use of even the tiniest of roles, none of them did much to improve her stature in Hollywood. With her delicious turn, however, in Hitchcock's eccentric black comedy The Trouble with Harry (1955), which starred Shirley MacLaine (in her film debut), John Forsythe, Kris Kringle's Edmund Gwenn, little Jerry Mathers (of \"Leave It to Beaver\"), and another famous Mildred, Mildred Dunnock, Natwick enjoyed one of her best roles ever on film. This was followed by her scheming and furtive sorceress in the Danny Kaye vehicle The Court Jester (1955) in which she, Kaye and Glynis Johns participate in the memorable tongue-twisting \"The pellet with the poison's in the vessel with the pestle...\" comedy routine. This, in turn, led to a couple of more, albeit lesser, films, including Teenage Rebel (1956) and Tammy and the Bachelor (1957). Preferring the theatre to movies, MIldred received her first Tony nomination for her sharp, astute work in Jean Anouilh's \"Waltz of the Toredors\" in 1957 and recreated her character in a TV special. She seemed to move effortlessly from the classics (\"Medea,\" \"Coriolanus\") to chic comedy (\"Ladies in Retirement,\" \"The Importance of Being Earnest\"). Receiving great applause as the beleaguered, overly-winded mother in Neil Simon's \"Barefoot in the Park\" on Broadway in 1963, she transferred the role to film four years later. The cinematic Barefoot in the Park (1967) earned Mildred a well-deserved Oscar nomination for \"best supporting actress\". She switched things up again with Harold Pinter's theatrical \"Landscape,\" and then again in 1971 when she made her debut in a singing role in the John Kander-Fred Ebb musical, \"70, Girls, 70\" (1971) in which she earned a second Tony nomination. Her last Broadway show came as a replacement in \"Bedroom Farce\" in 1979. With only the slightest of gesture, look or tone of voice, Mildred's characters could speak volumes and she became an essential character player during the 1970s as an offbeat friend, relative or elderly on TV and film. She was awarded the Emmy for her playing of one of The Snoop Sisters (1972)_ alongside the equally delightful Helen Hayes in the short-lived TV series. Both played impish Jessica Fletcher-type mystery writers who solve real crimes on the sly. She also played Rock Hudson's quirky mother in McMillan & Wife (1971) and a notable dying grandmother in a guest appearance of the critically-lauded TV series drama Family (1976). Her final film came with a small regal role as Madame de Rosemonde in Dangerous Liaisons (1988) with Glenn Close, John Malkovich and Michelle Pfeiffer. Never married, Mildred was called \"Milly\" by close friends and family and was the first cousin of Myron 'Grim' Natwick, the creator of Betty Boop for the Max Fleischer cartoon studio and prime animator for Disney's Snow White character. She died of cancer at age 89 in New York City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMzAwNDMyMF5BMl5BanBnXkFtZTcwNzg2NTMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0622450","name":"Mildred Natwick","nicknames":["Milly"],"idIMDB":"nm0622450"},"actorId":"nm0622450","character":"Ethel Banks","urlCharacter":"http://www.imdb.com/character/ch0024548","main":true},{"actorName":"Herb Edelman","urlProfile":"http://www.imdb.com/name/nm0248983","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0MTM1MTEwMTheQTJeQWpwZ15BbWU3MDE3Njg1MTg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1933","placeOfBirth":" Brooklyn, New York, USA","birthName":"Herbert Edelman","height":"6' 5\" (1.96 m)","bio":"Herb Edelman was born on November 5, 1933 in Brooklyn, New York, USA as Herbert Edelman. He was an actor and assistant director, known for The Odd Couple (1968), The Good Guys (1968) and Barefoot in the Park (1967). He was married to Louise Sorel and Marylin Cosgrove. He died on July 21, 1996 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0MTM1MTEwMTheQTJeQWpwZ15BbWU3MDE3Njg1MTg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0248983","name":"Herb Edelman","idIMDB":"nm0248983"},"actorId":"nm0248983","character":"Harry Pepper","urlCharacter":"http://www.imdb.com/character/ch0024546","main":true},{"actorName":"Mabel Albertson","urlProfile":"http://www.imdb.com/name/nm0016781","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1MjkxNjQ1MjdeQTJeQWpwZ15BbWU4MDAwNzA4MzIx._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 July 1901","placeOfBirth":" Lynn, Massachusetts, USA","birthName":"Mabel Ida Albertson","bio":"When, at 50, Mabel Albertson was given the supporting role of Mrs. Carter, young actress Aileen Stanley Jr.'s mother in a Warner Bros. Technicolor musical romance, little did she know that she was starting out a movie and TV career in which she would shine as \"the ultimate haughty judgmental (often wealthy) mother-in-law (or mother, or stepmother, or auntie)\" in an impressive series of films, TV films or TV series episodes. Mabel Albertson's comic gifts helped her to make these generally obnoxious characters hilarious. She is indeed memorable as Jerry Lewis' mother-in-law in Don't Give Up the Ship (1959), as George Hamilton's mother in All the Fine Young Cannibals (1960) or the domineering mother-in-law of poor Anthony Franciosa in Period of Adjustment (1962). On television, Tom Ewell, Dick Van Dyke and Dick Sargent, among others, were given the same treatment by their screen mother. Even at 50 years of age, Mabel Albertson was no newcomer to the business. In fact, she had been a successful vaudeville performer in the 1920s, a radio star in the 1930s and a theater actress and director in the 1940s. She had tried her hand in films twice (in 1928 and 1940) but without much success. Ironically, it was the film business that had previously rejected her which would make her unforgettable from the early 1950s to the late 1970s when Alzheimer's Disease put an and end to a long and fruitful career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1MjkxNjQ1MjdeQTJeQWpwZ15BbWU4MDAwNzA4MzIx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0016781","name":"Mabel Albertson","idIMDB":"nm0016781"},"actorId":"nm0016781","character":"Harriet","urlCharacter":"http://www.imdb.com/character/ch0456367","main":true},{"actorName":"Fritz Feld","urlProfile":"http://www.imdb.com/name/nm0270915","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODdjZTY2MDYtZmY2Yy00YjU5LWJkZWMtOGQxOWI4YjA1ZDhiXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 October 1900","placeOfBirth":" Berlin, Germany","birthName":"Fritz Feilchenfeld","height":"5' 6½\" (1.69 m)","bio":"Fritz Feld was born on October 15, 1900 in Berlin, Germany as Fritz Feilchenfeld. He is known for his work on Bringing Up Baby (1938), Barefoot in the Park (1967) and Hello, Dolly! (1969). He was married to Virginia Christine. He died on November 18, 1993 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODdjZTY2MDYtZmY2Yy00YjU5LWJkZWMtOGQxOWI4YjA1ZDhiXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0270915","name":"Fritz Feld","idIMDB":"nm0270915"},"actorId":"nm0270915","character":"Restaurant Proprietor","urlCharacter":"http://www.imdb.com/character/ch0456368","main":true},{"actorName":"James Stone","urlProfile":"http://www.imdb.com/name/nm0831928","urlPhoto":"","biography":{"dateOfBirth":"10 March 1898","placeOfBirth":" New York City, New York, USA","bio":"James Stone was born on March 10, 1898 in New York City, New York, USA. He was an actor, known for Barefoot in the Park (1967), Five Guns West (1955) and Black Widow (1954). He died on January 9, 1969 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0831928","name":"James Stone","idIMDB":"nm0831928"},"actorId":"nm0831928","character":"Delivery Man","urlCharacter":"http://www.imdb.com/character/ch0456369","main":true},{"actorName":"Ted Hartley","urlProfile":"http://www.imdb.com/name/nm0366894","urlPhoto":"","biography":{"dateOfBirth":"6 November 1924","placeOfBirth":" Omaha, Nebraska, USA","birthName":"Theodore Ringwalt Hartley","bio":"Ted Hartley was born on November 6, 1924 in Omaha, Nebraska, USA as Theodore Ringwalt Hartley. He is an actor and producer, known for High Plains Drifter (1973), Barefoot in the Park (1967) and Race to Witch Mountain (2009). He has been married to Dina Merrill since November 18, 1989.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0366894","name":"Ted Hartley","idIMDB":"nm0366894"},"actorId":"nm0366894","character":"Frank","urlCharacter":"http://www.imdb.com/character/ch0456370","main":true}],"seasons":[],"idIMDB":"tt0061385","urlIMDB":"http://www.imdb.com/title/tt0061385","business":{"budget":null,"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1967/\">1967</a>"},{"money":"1,417,342","country":"Spain","day":"31","month":"12","year":"1968","remarks":""}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 46 min (106 min)"],"soundMix":["Mono"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Technicolor, USA (color by) (as Technicolor®)"],"filmLength":["2,910 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.0","filmingLocations":[{"location":"111 Waverly Place, Greenwich Village, Manhattan, New York City, New York, USA"}],"rated":"APPROVED","awards":[{"award":"Academy Awards, USA 1968","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Actress in a Supporting Role","names":[{"name":"Mildred Natwick","id":"nm0622450","role":null}]}]}]},{"award":"BAFTA Awards 1968","titlesAwards":[{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best Foreign Actress","names":[{"name":"Jane Fonda","id":"nm0000404","role":null}]}]}]},{"award":"Laurel Awards 1968","titlesAwards":[{"titleAwardOutcome":"2nd place Golden Laurel","categories":[{"category":"Female Comedy Performance","names":[{"name":"Jane Fonda","id":"nm0000404","role":null}]}]},{"titleAwardOutcome":"Nominated Golden Laurel","categories":[{"category":"Comedy","names":[]},{"category":"Male Comedy Performance","names":[{"name":"Robert Redford","id":"nm0000602","role":null}]},{"category":"Female Supporting Performance","names":[{"name":"Mildred Natwick","id":"nm0622450","role":null}]}]}]},{"award":"Writers Guild of America, USA 1968","titlesAwards":[{"titleAwardOutcome":"Nominated WGA Award (Screen)","categories":[{"category":"Best Written American Comedy","names":[{"name":"Neil Simon","id":"nm0800319","role":null}]}]}]}],"votes":"11,598","type":"Movie","companyCreditsSimple":[{"idCompany":"co0197491","name":"Wallis-Hazen"},{"idCompany":"co0059601","name":"Nancy Enterprises Inc. (I)"}],"keywords":{"keywords":["apartment","lawyer","conservative","new york city","honeymoon","marriage","neighbor","stuffed shirt","park","attic","eccentric","kiss","elevator","barefoot","hotel","woman wearing only a man's shirt","single set production","lingerie slip","manhattan new york city","jumping over a bench","bloomingdale's department store manhattan new york city","washington square manhattan new york city","walking on a ledge","vodka","umbrella","ulcer","twenty something","tunafish can","trapdoor","tickling","tenth street manhattan new york city","telescope","telephone number","telephone installation","telephone call","taxi","suitcase","stocking cap","staten island ferry","stairway","song","sneezing","slip the undergarment","sleeping on a sofa","sleeping board","skylight","sixty something","singing","singer","shower","sex","scaling ladder","rooftop","rent","reference to geronimo","reference to fidel castro","reference to bluebeard","reading newspaper","rain","radiator","present","pot belly stove","police","policeman","plaza hotel manhattan new york city","pill","park bench","panties","pajamas","ozu","olive","nightgown","newspaper","new york times","new york harbor","new jersey","mirror","mattress","martini","marriage license","mailbox","lord and taylor's manhattan new york city","lingerie","laundry","ladder","hand kissing","kimono","kenichi","illness","hotel desk clerk","horse and carriage","hole in a skylight","hobo","headache","grocery store","grocery store clerk","gloves","garbage can","fur coat","food","folk song","fly in soup","flowers","fist","firewood","ferry","falling down stairs","eel","drink","drinking","door key","dog","do not disturb sign","dinner","difficulty breathing","delfino's manhattan new york city","dancing","dancer","crying","common cold","cold","coffee","coat","clock","climbing stairs","choking","champagne","bum","broken toe","briefcase","bra","brandy","blind date","belly dancer","beer","bed","bath","bathrobe","bar","band","aunt niece relationship","aspirin","anger","alcoholic","albanian restaurant","albanian american","staten island new york city","greenwich village manhattan new york city","drunkenness","central park manhattan new york city","weather","womanizer","widow","bohemian","mother in law son in law relationship","opposites attract","repair","extrovert","telephone","snow","grape","bus","bachelor","restaurant","mother daughter relationship","husband wife relationship","exotic food","eccentric neighbor","newlywed","based on play","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:02:47"}}