{"data":{"movies":[{"title":"Pretty Baby","originalTitle":"","year":"1978","releaseDate":"19780405","directors":[{"name":"Louis Malle","id":"nm0001501"}],"writers":[{"name":"Polly Platt","id":"nm0686895"},{"name":"Polly Platt","id":"nm0686895"}],"runtime":"110 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NTUxNTUxNl5BMl5BanBnXkFtZTgwMTIzMDAwMjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama"],"plot":"In 1917, in the red light district Storyville, New Orleans, the prostitute Hattie lives with her twelve year-old daughter Violet in the fancy brothel of Madame Nell, where she works. Photographer Ernest J. Bellocq has an attraction to Hallie and Violet and he is an habitué of the whorehouse. One day, Madame Nell auctions Violet's virginity and the winner pays the fortune of US$ 400 to spend the night with the girl. Then Hattie marries a wealthy client and moves to Saint Louis, leaving Violet in the brothel alone. Violet decides to marry Bellocq and she moves to his house. Until the day that Hattie, who has overcome her past, comes to Bellocq's house with the intention to take Violet with her.","simplePlot":"A teenage girl lives as a prostitute in New Orleans in 1917.","actors":[{"actorName":"Brooke Shields","urlProfile":"http://www.imdb.com/name/nm0000222","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzE4ODM2MzY5OV5BMl5BanBnXkFtZTcwNTE5MTU5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1965","placeOfBirth":" New York City, New York, USA","birthName":"Brooke Christa Shields","height":"6' (1.83 m)","bio":"\"Want to know what comes between me and my Calvins? Nothing\". If you have not heard of Brooke Shields before, this tagline from her Calvin Klein Jeans ad had to grab your attention. Not that she has not had a previously noteworthy resume. She was born on May 31, 1965 in New York City and, at age 12, she starred as a child prostitute in Pretty Baby (1978). Could this movie even be made today? It was considered risky and controversial in 1978. It was followed by another blockbuster, the romance adventure drama The Blue Lagoon (1980). Brooke has proved herself to be so much more than her early films. Her broad range of work as an adult would be quite an achievement for anyone, especially given how difficult transitioning from child actor to adult often is. She has never stopped working, whether it be a Bob Hope Christmas special, her own sitcom Suddenly Susan (1996) or as an author. She also managed to work on a degree from Princeton University. She has received a number of awards during her career, most notably The People's Choice award for 1981 through 1984 in the category of Favorite Young Performer. In 1997, she was honored again with The People's Choice award for Favorite Female Performer in a New Television Series in 1997 for her work in Suddenly Susan (1996). In her personal life, she was married in 1997 to tennis player Andre Agassi and was devastated when they divorced two years later. She married for the second time in 2001 to Chris Henchy. She has been open about using fertility treatments to become pregnant with their daughter, Rowan, born in 2003. When suffering debilitating depression after the birth of her daughter, she made the decision to put her feelings down on paper. Her book, \"Down Came the Rain: My Journey Through Postpartum Depression\", takes a hard, honest look at what she and many other women experience after childbirth. She still lives in New York City, and is still sought after for work in movies, television, and on stage. Pretty nice list of achievements for the once Calvin Klein jeans girl.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzE4ODM2MzY5OV5BMl5BanBnXkFtZTcwNTE5MTU5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000222","name":"Brooke Shields","nicknames":["Brookie"],"idIMDB":"nm0000222"},"actorId":"nm0000222","character":"Violet","urlCharacter":"http://www.imdb.com/character/ch0080976","main":true},{"actorName":"Keith Carradine","urlProfile":"http://www.imdb.com/name/nm0001018","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk4OTI4MjczOF5BMl5BanBnXkFtZTcwMzI3MTU5Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 August 1949","placeOfBirth":" San Mateo, California, USA","birthName":"Keith Ian Carradine","height":"6' 1\" (1.85 m)","bio":"It seems the second generation of acting Carradines -- David, Keith and Robert -- are proudly continuing the family tradition and begetting a third generation of talent. The dynasty began with veteran Hollywood patriarch John Carradine, the son of a surgeon and a correspondent for the Associated Press. Keith was a child, born of John's second marriage to actress Sonia Sorel. Lanky, laid-back and highly likable, Keith Ian Carradine was born in San Mateo, California, on August 8, 1949. His parents divorced when Keith was six. Following in the footsteps of older half-brother and mentor David Carradine, Keith studied theater arts at Colorado State University in Fort Collins, Colorado, but dropped out after only one semester to pursue his career. Soon after, he auditioned for \"Hair\" in Los Angeles and made his Broadway debut in the 1969 rock musical, playing the role of Claude for an extended period of time. Keith next appeared with his father in a stage production of \"Tobacco Road\" (1970) in Florida. The following year Keith broke into films with a part in the Kirk Douglas/Johnny Cash western A Gunfight (1971). Legendary director Robert Altman was quite taken by Keith's work in the film and gave him a part in his own movie McCabe & Mrs. Miller (1971), which sparked the first of many endeavors together. Keith also made a strong showing on TV, making his mini-movie debut with Man on a String (1972), and appearing with brother David in the TV movie pilot and various episodes of the cult series Kung Fu: Pilot (1972) as the teenage version (seen in flashbacks) of David's character Kwai Chang Caine. Keith continued to impress in Altman's films. He played one of three convicts in the critically-acclaimed movie Thieves Like Us (1974), but scored Oscar gold with his next Altman film, Nashville (1975) -- not with his acting but with his songwriting. His composition \"I'm Easy\" won both the Oscar and Golden Globe for \"Best Song\". Keith also earned a Grammy nomination in 1976 for his contribution to \"Nashville\" in the \"Best Original Score Written for a Motion Picture or Television Special\" category. Keith first association with Altman's protégé, Alan Rudolph, occurred filming Welcome to L.A. (1976), to which he again contributed his music talent. Keith's rangy handsomeness and low-keyed acting style were on full display as he increased his popularity with appearances in such films as Ridley Scott's The Duellists (1977); Louis Malle's first American film, the visually-striking Pretty Baby (1978), that made a controversial star out of young Brooke Shields; and the comedy/romance An Almost Perfect Affair (1979). One acting trick that worked was pairing all three Carradine brothers in The Long Riders (1980), which recalled the infamous lives of brothers Cole, Jim and Bob Younger, and boasted three other sets of acting brothers (Keach, Quaid and Guest) as various other outlaw siblings. Keith's acting reviews throughout much of his career would be decidedly mixed -- some would find his unassuming, introspective acting too listless while others found it beautifully realized and understated. Many of his best notices came from the Altman and Rudolph films, appearing in two of Rudolph acclaimed 80s works -- Choose Me (1984) and The Moderns (1988). He also persevered on TV with award-worthy work. His role in the mini-series Chiefs (1983) netted an Emmy nomination, while his recurring role as Wild Bill Hickok in Deadwood (2004) earned a Golden Satellite nomination and his work in the made-for-TV-film Half a Lifetime (1986) scored a CableACE nomination. Regular series work came late in his career, starring in Fast Track (1997), Outreach (1999) and Complete Savages (2004), all of which were short-lived. Keith's career was revitalized on the 80s and 90s stage. In addition to strong roles in \"Another Part of the Forest\" (1982) and \"Detective Story\" (1984), he won the Outer Critics Circle Award for his excellent work in 1982's \"Foxfire\" opposite Jessica Tandy and Hume Cronyn_ and then roped a Tony and Drama Desk nomination as humorist Will Rogers in the Broadway musical \"The Will Rogers Follies\" (1991). Most recently (2005) he starred in the American premiere of David Hare's satire \"Stuff Happens\" as none other than George W. Bush while expounding on the 2003 invasion of Iraq. Keith has been married twice. Of his two children born from his first union to actress Sandra Will, who played opposite him in the film Choose Me (1984), son Cade Carradine recently portrayed Lord Oxford in the film Richard III (2007) and daughter Sorel Carradine has been seen on TV. Keith and Sandra eventually divorced and he married actress Hayley DuMond in 2006; they met while appearing in the film The Hunter's Moon (1999). Keith's daughter Martha Plimpton, a highly gifted actress on her own, was a child from his relationship to actress Shelley Plimpton, whom he met when both were cast members in \"Hair\" back in 1969. Keith continues to write and compose. More recently he hosted The History Channel's Wild West Tech (2003) and appeared on a season of the hit cable series Dexter (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk4OTI4MjczOF5BMl5BanBnXkFtZTcwMzI3MTU5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001018","name":"Keith Carradine","idIMDB":"nm0001018"},"actorId":"nm0001018","character":"Bellocq","urlCharacter":"http://www.imdb.com/character/ch0080977","main":true},{"actorName":"Susan Sarandon","urlProfile":"http://www.imdb.com/name/nm0000215","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4ODMzMDUzNF5BMl5BanBnXkFtZTcwNzY4NzQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1946","placeOfBirth":" New York City, New York, USA","birthName":"Susan Abigail Tomalin","height":"5' 7\" (1.7 m)","bio":"Susan Sarandon was born Susan Abigail Tomalin in New York City, New York, to Lenora Marie (Criscione) and Phillip Leslie Tomalin, a television producer and advertising executive. She is of Italian (mother) and English, Irish, Welsh, and German (father) descent. Soon after the 1968 Democratic convention, there was a casting call for a film with several roles for the kind of young people who had disrupted the convention. Two recent graduates of Catholic University in Washington DC, went to the audition in New York for Joe (1970). Chris Sarandon, who had studied to be an actor, was passed over. His wife Susan got a major role. That role was as Susan Compton, the daughter of ad executive Bill Compton (Dennis Patrick). In the movie Dad Bill kills Susan's drug dealer boyfriend and next befriends Joe (Peter Boyle)-- a bigot who works on an assembly line and who collects guns. Five years later, Sarandon made the film where fans of cult classics have come to know her as \"Janet\", who gets entangled with transvestite \"Dr. Frank 'n' Furter\" in The Rocky Horror Picture Show (1975). More than 15 years after beginning her career Sarandon at last actively campaigned for a great role, Annie in Bull Durham (1988), flying at her own expense from Rome to Los Angeles. \"It was such a wonderful script ... and did away with a lot of myths and challenged the American definition of success\", she said. \"When I got there, I spent some time with Kevin Costner, kissed some ass at the studio and got back on a plane\". Her romance with the Bull Durham (1988) supporting actor, Tim Robbins, had produced two sons by 1992 and put Sarandon in the position of leaving her domestic paradise only to accept roles that really challenged her. The result was four Academy Award nominations in the 1990s and best actress for Dead Man Walking (1995). Her first Academy Award nomination was for Louis Malle's Atlantic City (1980).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4ODMzMDUzNF5BMl5BanBnXkFtZTcwNzY4NzQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000215","name":"Susan Sarandon","idIMDB":"nm0000215"},"actorId":"nm0000215","character":"Hattie","urlCharacter":"http://www.imdb.com/character/ch0080978","main":true},{"actorName":"Frances Faye","urlProfile":"http://www.imdb.com/name/nm0269662","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMzUyODE1NF5BMl5BanBnXkFtZTYwNDcwMTU2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 November 1912","placeOfBirth":" Brooklyn, New York, USA","birthName":"Frances Cohen","bio":"Frances Faye was born on November 4, 1912 in Brooklyn, New York, USA as Frances Cohen. She was an actress, known for Pretty Baby (1978), Alexander: The Other Side of Dawn (1977) and Double or Nothing (1937). She died on November 8, 1991 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMzUyODE1NF5BMl5BanBnXkFtZTYwNDcwMTU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0269662","name":"Frances Faye","idIMDB":"nm0269662"},"actorId":"nm0269662","character":"Nell","urlCharacter":"http://www.imdb.com/character/ch0456350","main":true},{"actorName":"Antonio Fargas","urlProfile":"http://www.imdb.com/name/nm0267279","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNTgyODM3MF5BMl5BanBnXkFtZTcwNTA1MzAyOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 August 1946","placeOfBirth":" New York City, New York, USA","birthName":"Antonio Juan Fargas","height":"6' 1\" (1.85 m)","bio":"A tall, lanky and twinkle-eyed African-American actor with wonderful onscreen charisma, Antonio Fargas has been appearing on stage and screen for nearly 40 years. His film debut was in Shirley Clarke's The Cool World (1963), a gritty, uncompromising tale about African-American youth growing up in Harlem, New York. He then made his acting presence felt in many \"blaxploitation\" films of the early 1970s, including the classic Shaft (1971), the Mafia flick Across 110th Street (1972), the ultra-violent Pam Grier vehicle Foxy Brown (1974) and the classic tale of Huckleberry Finn (1975). Around this time ABC-TV executives were looking for a capable actor to play the role of golden-hearted street informant \"Huggy Bear\" on Starsky and Hutch (1975), and Fargas scored the role with which he is most closely identified. His career continued to flourish after \"Starsky and Hutch\" wrapped up after four years, and he has appeared in over 50 movies to date, many TV shows and numerous stage productions. He has played a 90-year-old witch doctor in \"The Great White Hope\", was in Melvin Van Peebles' \"Ain't Supposed to Die a Natural Death\", and appeared in productions of \"The Rainmaker\", \"The Emperor Jones\" and \"Dream on Monkey Mountain\". A strong advocate of the strength and diversity of African-American culture, Fargas holds positions on the boards of Rhode Island's Langton Hughes Center for the Arts and The Martin Luther King Center of Newport.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNTgyODM3MF5BMl5BanBnXkFtZTcwNTA1MzAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0267279","name":"Antonio Fargas","nicknames":["Tony"],"idIMDB":"nm0267279"},"actorId":"nm0267279","character":"Professor","urlCharacter":"http://www.imdb.com/character/ch0456351","main":true},{"actorName":"Matthew Anton","urlProfile":"http://www.imdb.com/name/nm0031214","urlPhoto":"","biography":{"dateOfBirth":"18 August 1964","placeOfBirth":"","bio":"Matthew Anton was born on August 18, 1964. He is an actor, known for All My Children (1970), Pretty Baby (1978) and Bad (1977).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0031214","name":"Matthew Anton","idIMDB":"nm0031214"},"actorId":"nm0031214","character":"Red Top","urlCharacter":"http://www.imdb.com/character/ch0456352","main":true},{"actorName":"Diana Scarwid","urlProfile":"http://www.imdb.com/name/nm0769311","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwOTIzNjg4M15BMl5BanBnXkFtZTcwNDE0ODU5Mg@@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 August 1955","placeOfBirth":" Savannah, Georgia, USA","birthName":"Diana Elizabeth Scarwid","height":"5' 5\" (1.65 m)","bio":"Listed as one of twelve \"Promising New Actors of 1980\" in John Willis's Screen World, Vol 32. Diana Scarwid was Born August 27, 1955 in Savannah, Georgia. She left Georgia for New York at the age of 17 to pursue acting. She attended Pace University and the American Academy of Dramatic Arts. After various performances in television and made-for-television films, she went on to earn an Academy Award nomination for Best Actress in a Supporting Role for her performance as John Savage's girlfriend in Inside Moves (1980). A year later, she came to star in perhaps her most recognized role, the portrayal of Christina Crawford, Joan Crawford's allegedly abused and adopted daughter in the film adaptation of Christina Crawford's self-penned memoir, Mommie Dearest (1981). The film was poorly received as a dramatic interpretation but found a second life as a camp classic. The same year, her performance as Louise, Roary's (played by John Savage) girlfriend in Richard Donner's film adaptation of Todd Walton's Inside Moves (1980) was acknowledged with an Academy Award nomination. She lost to Mary Steenburgen for her performance in Melvin and Howard (1980).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwOTIzNjg4M15BMl5BanBnXkFtZTcwNDE0ODU5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0769311","name":"Diana Scarwid","idIMDB":"nm0769311"},"actorId":"nm0769311","character":"Frieda","urlCharacter":"http://www.imdb.com/character/ch0456353","main":true},{"actorName":"Barbara Steele","urlProfile":"http://www.imdb.com/name/nm0824489","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NTc0MDMxNl5BMl5BanBnXkFtZTYwODczNjM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1937","placeOfBirth":" Birkenhead, Cheshire, England, UK","height":"5' 8\" (1.73 m)","bio":"The most beautiful star of the greatest horror masterpiece of Italian film, Black Sunday (1960): Barbara Steele was born on December 29, 1937 in Birkenhead, Cheshire, England. Barbara is loved by her fans for her talent, intelligence, and a dark, mysterious beauty that is unique; her face epitomizes either sweet innocence, or malign evil (she is wonderful to watch either way). At first, Barbara studied to become a painter. In 1957, she joined an acting repertory company. Her feature acting debut was in the British comedy Bachelor of Hearts (1958). At age 21, this strikingly lovely lady, with the hauntingly beautiful face, large eyes, sensuous lips and long, dark hair got her breakout role by starring in Black Sunday (1960), the quintessential Italian film about witchcraft (it was the directorial debut for cinematographer Mario Bava; with his background, it was exquisitely photographed and atmospheric). We got to see Barbara, but did not hear her; her voice was dubbed by another actress for international audiences. After its American success, AIP brought Barbara to America, to star in Roger Corman's Pit and the Pendulum (1961); (though the film was shot entirely in English, again Barbara's own voice was not used). By now, Barbara was typecast by American audiences as a horror star. In 1962, she answered an open-casting call and won a role in Federico Fellini's 8½ (1963); she only had a small role, but it was memorable. Reportedly, Fellini wanted to use her more in the film, but she was contracted to leave Rome to start work on her next horror movie, The Horrible Dr. Hichcock (1962). Being a slow and meticulous director, Fellini's 8½ (1963) was not released until 1963. (Later, when Barbara was cast in lesser roles in lesser movies, she would tell the directors: \"I've worked with some of the best directors in the world. I've worked with Fellini!\") More horror movies followed, such as The Ghost (1963), Castle of Blood (1964), An Angel for Satan (1966) and others; this success led to her being typecast in the horror genre, where she more often than not appeared in Italian movies with a dubbed voice. The nadir was appearing in The Crimson Cult (1968), which was mainly eye candy, with scantily-clad women in a cult. Unfortunately, Barbara got sick of being typecast in horror movies. One of the screen's greatest horror stars, she said in an interview: \"I never want to climb out of another freakin' coffin again!\" This was sad news for her legion of horror fans; it was also a false-step for Barbara as far as a career move. Back in America, she met screenwriter James Poe; they got married, and remained together for many years. James Poe wrote an excellent role for Barbara in They Shoot Horses, Don't They? (1969). The role ended up going to Susannah York, and Barbara wouldn't act in movies again for five years. Barbara returned to movies in Caged Heat (1974); she was miscast: a few years before, Barbara would have been one of the beautiful inmates, not the wheelchair-bound warden, but her performance won positive reviews. In 1977, she appeared in a film by Roger Corman, based on the true story of a mentally ill woman, I Never Promised You a Rose Garden (1977). Unfortunately, her scenes wound up on the cutting room floor. Barbara appeared in Pretty Baby (1978), but she was in the background the whole time, and her talents were mostly wasted. Barbara would appear in two more unmemorable movies. She and James Poe got divorced in 1978, he died two years later. Barbara appeared in the independent film The Silent Scream (1979). Maybe because her ex-husband was now dead, or because her acting career was going nowhere, Barbara retired from acting for a decade. However, she had a lot of success as a producer. She was an associate producer for the miniseries The Winds of War (1983), and produced War and Remembrance (1988), for which she got an Emmy Award. Her horror fans were delighted when Barbara showed up again, this time on television in Dark Shadows (1991), a revival of the beloved 1960s supernatural soap opera. And she has developed a relative fondness along with a sense of ironic humor about her horror queen status, which was evident in her appearance in the Clive Barker documentary A-Z of Horror (1997). The still-lovely Barbara acts occasionally, her latest film was The Butterfly Room (2012). Even well past 60, Barbara Steele is still beautiful and her fans still love her.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NTc0MDMxNl5BMl5BanBnXkFtZTYwODczNjM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0824489","name":"Barbara Steele","nicknames":["The Queen of All Scream Queens"],"idIMDB":"nm0824489"},"actorId":"nm0824489","character":"Josephine","urlCharacter":"http://www.imdb.com/character/ch0456354","main":true},{"actorName":"Seret Scott","urlProfile":"http://www.imdb.com/name/nm0779783","urlPhoto":"","biography":{"dateOfBirth":"1 September 1949","placeOfBirth":" Washington, District of Columbia, USA","bio":"Seret Scott was born on September 1, 1949 in Washington, District of Columbia, USA. She is an actress, known for Pretty Baby (1978), With Murder in Mind (1992) and Losing Ground (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0779783","name":"Seret Scott","idIMDB":"nm0779783"},"actorId":"nm0779783","character":"Flora","urlCharacter":"http://www.imdb.com/character/ch0456355","main":true},{"actorName":"Cheryl Markowitz","urlProfile":"http://www.imdb.com/name/nm0548721","urlPhoto":"","biography":{"bio":"Cheryl Markowitz is an actress, known for Pretty Baby (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0548721","name":"Cheryl Markowitz","idIMDB":"nm0548721"},"actorId":"nm0548721","character":"Gussie","urlCharacter":"http://www.imdb.com/character/ch0456356","main":true},{"actorName":"Susan Manskey","urlProfile":"http://www.imdb.com/name/nm0543880","urlPhoto":"","biography":{"bio":"Susan Manskey is an actress, known for Pretty Baby (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0543880","name":"Susan Manskey","idIMDB":"nm0543880"},"actorId":"nm0543880","character":"Fanny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Laura Zimmerman","urlProfile":"http://www.imdb.com/name/nm0956746","urlPhoto":"","biography":{"bio":"Laura Zimmerman is known for her work on Cirque du Freak: The Vampire's Assistant (2009) and Pretty Baby (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0956746","name":"Laura Zimmerman","idIMDB":"nm0956746"},"actorId":"nm0956746","character":"Agnes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Miz Mary","urlProfile":"http://www.imdb.com/name/nm0555715","urlPhoto":"","biography":{"bio":"Miz Mary is an actress, known for Pretty Baby (1978) and French Quarter Undercover (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0555715","name":"Miz Mary","idIMDB":"nm0555715"},"actorId":"nm0555715","character":"Odette","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gerrit Graham","urlProfile":"http://www.imdb.com/name/nm0334057","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MTg0Mzg3Nl5BMl5BanBnXkFtZTcwNzc1MDAxOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 November 1949","placeOfBirth":" New York City, New York, USA","height":"6' (1.83 m)","bio":"Gerrit Graham was born on November 27, 1949 in New York City. He grew up in St. Louis, Missouri, Chicago, Illinois and Grosse Pointe, Michigan. Gerrit made his acting debut at age eight in a Detroit Art Institute stage production of \"Winnie the Pooh.\" Graham was the president of the dramatic association as a high school student at Groton and general manager of the Columbia Players while studying at Columbia University. He began his cinematic career acting in movies for director Brian De Palma: he's excellent in his film debut as paranoid conspiracy nut Lloyd Clay in \"Greetings!\" and gave a hilarious performance as preening flamboyant rock star Beef in \"Phantom of the Paradise.\" Graham's other memorable comic roles include no-talent aspiring country singer Perman Waters in Paul Bartel's \"Cannonball!,\" hippie commune leader Magic Ray in \"Bobbie Jo and the Outlaw,\" sleazy used car salesman Jeff in the uproarious \"Used Cars,\" the snobby Bob Spinnaker in \"Class Reunion,\" and the leering Rodzinski in \"The Creature Wasn't Nice.\" Moreover, Gerrit has demonstrated his considerable range and versatility in such occasional serious parts as computer nerd Walter Gabler in \"Demon Seed,\" Susan Sarandon's abusive boyfriend Highpockets in \"Pretty Baby,\" tough Vietnam veteran Ray Stark in \"The Annihilators,\" and Alex Vincent's jerky foster father Phil Simpson in \"Child's Play 2.\" Among the many TV shows Graham has done guest spots on are \"Baretta,\" \"Starsky and Hutch,\" \"Laverne & Shirley,\" \"The A-Team,\" \"Fame,\" \"St. Elsewhere,\" \"Miami Vice,\" \"Dallas,\" \"The Wonder Years,\" \"Seinfeld,\" \"Star Trek: Deep Space Nine,\" \"Babylon 5,\" \"The Larry Sanders Show,\" \"Star Trek: Voyager,\" \"Law & Order,\" and \"Third Watch.\" Gerrit had a recurring role on \"The Critic.\" He wrote three episodes of the 80s \"The Twilight Zone\" revival and acted in the \"Welcome to Winfield\" episode of the same show. On stage Gerrit has performed improvisational comedy sketches with Chicago's Second City troupe and worked with improvisational director Paul Sills in Chicago as a member of Sills' Story Theatre ensemble. Graham has written several songs with Bob Weir (these include the lyrics for the Grateful Dead tune \"Victim or the Crime\"). Graham wrote additional dialogue and provided additional voices for the hit Disney animated picture \"The Little Mermaid\" and co-wrote the screenplay for the cartoon feature \"The Prince and the Pauper.\" He's the father of sons Jack and Henry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MTg0Mzg3Nl5BMl5BanBnXkFtZTcwNzc1MDAxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0334057","name":"Gerrit Graham","idIMDB":"nm0334057"},"actorId":"nm0334057","character":"Highpockets","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mae Mercer","urlProfile":"http://www.imdb.com/name/nm0580284","urlPhoto":"","biography":{"dateOfBirth":"12 June 1932","placeOfBirth":" Battleboro, North Carolina, USA","birthName":"Mary Ruth Mercer","bio":"Mae Mercer was born on June 12, 1932 in Battleboro, North Carolina, USA as Mary Ruth Mercer. She was an actress and producer, known for Dirty Harry (1971), The Beguiled (1971) and Pretty Baby (1978). She died on October 29, 2008 in Northridge, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0580284","name":"Mae Mercer","idIMDB":"nm0580284"},"actorId":"nm0580284","character":"Mama Mosebery","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0078111","urlIMDB":"http://www.imdb.com/title/tt0078111","business":{"budget":null,"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1977/\">1977</a>"},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1977/\">1977</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 50 min (110 min)"],"soundMix":["Mono"],"color":["Color (Metrocolor)"],"aspectRatio":["1.33 : 1 (open matte)","1.37 : 1 (negative ratio)","1.85 : 1"],"camera":["Arriflex Cameras"],"laboratory":["Metrocolor, USA"],"filmLength":["3,005 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.6","filmingLocations":[{"location":"Columns Hotel - 3811 St Charles Avenue, New Orleans, Louisiana, USA"}],"rated":"R","awards":[{"award":"Academy Awards, USA 1979","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Music, Original Song Score and Its Adaptation or Best Adaptation Score","names":[{"name":"Jerry Wexler","id":"nm0923310","role":null}]}]}]},{"award":"Cannes Film Festival 1978","titlesAwards":[{"titleAwardOutcome":"Won Technical Grand Prize","categories":[{"category":"","names":[{"name":"Louis Malle","id":"nm0001501","role":null}]}]},{"titleAwardOutcome":"Nominated Palme d'Or","categories":[{"category":"","names":[{"name":"Louis Malle","id":"nm0001501","role":null}]}]}]},{"award":"Los Angeles Film Critics Association Awards 1978","titlesAwards":[{"titleAwardOutcome":"2nd place LAFCA Award","categories":[{"category":"Best Cinematography","names":[{"name":"Sven Nykvist","id":"nm0005815","role":null}]}]}]},{"award":"National Board of Review, USA 1978","titlesAwards":[{"titleAwardOutcome":"Won NBR Award","categories":[{"category":"Top Ten Films","names":[]}]}]},{"award":"The Stinkers Bad Movie Awards 1978","titlesAwards":[{"titleAwardOutcome":"Nominated Stinker Award","categories":[{"category":"Worst Actress","names":[{"name":"Brooke Shields","id":"nm0000222","role":null}]},{"category":"Worst Fake Accent: Female","names":[{"name":"Brooke Shields","id":"nm0000222","role":null}]}]}]}],"votes":"7,787","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["child prostitute","tween girl","virginity auction","prostitute","underage sex","posing for a photograph","nude photograph","erotic photography","girl man relationship","nude modeling","child prostitution","year 1917","photographer","virginity","auction","brothel","12 year old","storyville new orleans","red light district","teenage girl","prostitution","large format camera","nude photo shoot","burning a banknote","illiteracy","underage drinking","hide and seek","brothel madam","newborn son","childbirth","birth pang","white panties","panties","upskirt","female removes her clothes","woman in bathtub","breasts","scantily clad female","two word title","dysfunctional marriage","no panties","ragtime","promiscuous past","promiscuous woman","fondling","cleavage","female rear nudity","leg spreading","lust","piano","photograph","drunkenness","drink","drinking","absent mother","self destructiveness","bathtub","mother abandons daughter","pianist","cult film","precocious child","world war one","sexual awakening","sensuality","reflection","innocence lost","art","nymphette","virgin","teenage sexuality","sex","sexuality","punishment","puberty","nude model","nude bathing","mother daughter relationship","modeling","loss of virginity","first time sex","female nudity","female frontal nudity","exploring sexuality","coming of age","child abuse","bathing","new orleans louisiana","painful sex","defloration","nudity","lolita","1910s","photography","title spoken by character","exploitation film","african american"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 18:40:20"}}