{"data":{"movies":[{"title":"Love Sickness","originalTitle":"Prem Rog","year":"1982","releaseDate":"19820731","directors":[{"name":"Raj Kapoor","id":"nm0004292"}],"writers":[{"name":"Kamna Chandra","id":"nm0133781"},{"name":"Jainendra Jain","id":"nm0415833"}],"runtime":"183 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTExMjU1N15BMl5BanBnXkFtZTcwMjY0NzcxMQ@@._V1.jpg","countries":["India"],"languages":["Hindi"],"genres":["Drama","Musical","Romance"],"plot":"Orphaned at a very young age and adopted by his uncle, a Poojari, and aunt, Premvati, Devdhar lives a poor lifestyle with them and their daughter, Radha. Poojari works for Bade Thakur and his family and prepares astrological charts and organizes prayers, and asks him for financial assistance so that Devdhar can go to Bombay and study, which is approved. Years later Devdhar has matured, returns home so that Radha could get married. He meets with and falls in love with Bade Thakur's paternal niece, Manorama, his childhood friend. She likes him too, but is very naive about love and intimacy. Radha gets married to a much older man and moves out, while Manorama's marriage is arranged with Kunwar Narendra Pratap Singh. The wedding takes place with great pomp and ceremony, and a heartbroken Devdhar leaves the village to return to Bombay. A few months later he meets with Radha, who is now pregnant, and also decides to visit his uncle and aunt. This is where he will get the shock of his life ...","simplePlot":"Manorama, the daughter of a rich, orthodox family is married off, leaving her childhood friend Deodhar and his secret love for her, in despair. When tragedy befalls her, and traditions seem unfair, Deodhar must fight for what's right.","actors":[{"actorName":"Shammi Kapoor","urlProfile":"http://www.imdb.com/name/nm0004433","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5ODU1OTE5ODdeQTJeQWpwZ15BbWU3MDkyNzExMzY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 October 1931","placeOfBirth":" Bombay, Bombay Presidency, British India","birthName":"Shamsher Raj Kapoor","height":"6' 0¾\" (1.85 m)","bio":"Shamsher Raj \"Shammi\" Kapoor was the son of theater and film actor Prithviraj Kapoor and his wife Ramsarni \"Rama\" Mehra Kapoor. Shammi's acting career began in 1948, when he joined his father's theatrical company \"Prithvi Theatres.\" Like his father and his brothers, Shammi eventually moved into the world of movie-making. He made his big screen debut in 1953. His earliest films were mostly low-budget swashbucklers and romances that failed to succeed at the box office. Shammi referred to himself at that point in his career as a \"male starlet.\" In April of 1955, on the sets of Rangin Raaten (1956), Shammi met and fell in love with the actress Geeta Bali. She was an established actress, and he was still struggling in his career. Four months later, Geeta agreed to marry Shammi and they wed in small ceremony witnessed by Hari Walia who produced and directed their next film together Coffee House (1957). The couple had two children, a son Aditya Raj born in 1956 and a daughter Kanchan born in 1961. The film Tumsa Nahin Dekha (1957) was a turning point in Shammi's career. For this film, he cut his hair and shaved off his pencil-thin mustache; creating a new look and persona. The film was a success and was soon followed by more hits. By 1961, Shammi's boisterous shout of \"Yahoo!\" and his exuberant hip-shaking dance moves, in his first color picture Junglee (1961), had made him a star. His natural talent for dancing and his modern and casual fashion sense brought him comparisons to Elvis Presley, and Shammi became known as the \"Rebel Star.\" In 1965, while Shammi was filming Teesri Manzil (1966), his wife Geeta fell ill with smallpox and passed away. After months away from the set, Shammi eventually returned to film the song \"Tumne Mujhe Dekha.\" Shammi's success continued and in 1968, his acting talent was formally recognized. He received the Filmfare Best Actor award for his role in Brahmachari (1968). In 1969, Shammi married Neila Devi from the former royal family of Bhavanagar. Their families had long been friends and they first met when Neila was 9 and Shammi was 19. Neila later recalled that Shammi had pulled her pigtails while she was watching one of his plays from the backstage wings. Shammi's sister-in-law first suggested the match to him. Eventually, Shammi called Neila on the phone to propose. They spent hours talking, and were married the next day. By the 1970s, Shammi's weight gain and competition from other popular actors was taking a toll on his status as a romantic hero. Andaz (1971) was one of his last hits as a leading man. Shammi enjoyed directing two films, Manoranjan (1974) and Bundal Baaz (1976). The films met with some critical success but neither did well at the box-office. As the '70s continued, Shammi began transferring his acting talents into supporting roles. He won another Filmfare Award for Best Supporting Actor in Vidhaata (1982). Shammi took to the Internet early, and was the founder and chairman of Internet Users Community of India. He managed his own website and made online videos to speak directly to his fans. He loved to share stories about his career, his friends, and his famous family: father Prithviraj Kapoor, elder brother Raj Kapoor, younger brother Shashi Kapoor, and their spouses, children, and grandchildren; many of whom work in the film industry. In later years, Shammi continued to take on supporting roles in film and TV. He was presented with the Filmfare Lifetime Achievement Award in 1995. His last film was the posthumously released Rockstar (2011), in which he appeared alongside his great-nephew Ranbir Kapoor. The last seven years of his life, he suffered from chronic renal failure and underwent dialysis three times a week. But it never dampened his warmhearted spirit, until the end he continued to share his joy for life. Shammi Kapoor passed away around 5:15 am, August 14th, 2011 at Mumbai Breach Candy hospital.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5ODU1OTE5ODdeQTJeQWpwZ15BbWU3MDkyNzExMzY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004433","name":"Shammi Kapoor","idIMDB":"nm0004433"},"actorId":"nm0004433","character":"Bade Raja Thakur","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nanda","urlProfile":"http://www.imdb.com/name/nm0620785","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWI2NmEyYWMtM2U5NS00MTc1LWFlM2ItMzcyZjg3Yzk5NTdlXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 January 1939","placeOfBirth":" Kolhapur, Kolhapur State, British India","height":"5' 3½\" (1.61 m)","bio":"A film career spanning from the 1940s to the 1980s, Nanda was born on January 8, 1939, to a show-business Marathi family in Bombay, India. Her father was actor Master Vinayak, and her mother was Sushila. Nanda was the third of seven brothers and sisters. When she was just 5 years old, her father wanted to cast her in his film \"Mandir\" (1948). She didn't want to do it, but her mother cajoled her into it. She played a boy in the film, a role that could have been easily played by her brothers. But Nanda always believed that the reason her parents cast her in the film was because she was their favorite child. It was during the filming of \"Mandir\" that her father suddenly died. The film was eventually completed by Dinkar Patil. Nanda went onto become a child star, where she was credited as Baby Nanda, in films like \"Jaggu\" (1952). Her income supported her large family. When Nanda was a teenager, Rajaram Vankudre Shantaram asked her to attend a wedding in a sari. When he saw her, he felt she was ready to graduate from child roles to sister roles. He cast her in \"Toofan Aur Diya\" (1956), and she was no longer called Baby Nanda but just Nanda. The film's success led to more sister roles, gaining recognition with the release of \"Bhabhi\" (1957) for which she received her first Filmfare nomination as Best Supporting Actress. Nanda played the title role in \"Chhoti Bahen\" (1959), and it became a major hit. She was declared a star and earned a reputation as a talented actress who can do tragedienne roles. She won the Filmfare Best Supporting Actress award for \"Aanchal\" (1960), a major accomplishment, considering that she was barely out of her teens. She impressed Dev Anand when she played his sister in \"Kala Bazaar\" and also his heroine Waheeda Rehman who became her close friend for the next 55 years. Anand promised her that he would graduate her to be his heroine in his next film \"Hum Dono\" (1961), and when the film became a hit, she was offered more heroine roles. She was considered a generous and kindhearted actress, agreeing to act with an then-unknown Shashi Kapoor in \"Char Diwari\" (1961). Even though, the film flopped, she signed onto do seven more films, for which Kapoor always remained grateful to her, calling her his favorite leading lady. Their biggest hit was \"Jab Jab Phool Khile\" (1965), where Nanda played a glamorous, Westernized woman in love with a native Kashmiri played by Kapoor. The film totally changed her career from a tragedienne to a trendy fashionable star. She also had another big hit that same year, the murder mystery \"Gumnaam\" (1965), which put her in the top league of heroines. She continued in heroine roles for the next nine years, again drastically changing her image from a good girl to an adulteress/murderess in \"Ittefaq\" (1969), which earned her a Filmfare nomination as Best Actress. She started winding down her career in the 1970's, with her memorable cameo in \"Shor\" (1972). She ended her career as a heroine with \"Naya Nasha\" (1974), playing a drug addict, a daring role that other actresses would have been afraid to play. Then, she vanished from the screen for several years and reappeared in 3 movies in 1982: 'Mazdoor', 'Ahista Ahista', and 'Prem Rog', the latter two earned her back-to-back Filmfare Nominations as Best Supporting Actress. In all 3 movies she coincidentally played the mother of actress Padmini Kolhapure. Then, she permanently retired from films. Very shy and introvert, Nanda kept to herself, staying close to family and friends. A middle-aged Nanda finally agreed to marry film-maker Manmohan Desai, an engagement took place in 1992, but before the wedding could take place, Manmohan died when he fell from a building. That death, along with her mother and brother's deaths, made her shun the spotlight even more. She did stay in touch with her friends, Waheeda Rehman, Sadhana, Asha Parekh, Shammi, Helen, and Saira Banu almost to her dying day. She died of a sudden heart attack on March 25, 2014. The film industry had a public funeral, grieving the loss of their beloved star, an award-winning actress who was respected for her talent, versatility, and longevity of her career. Her family and friends grieved that they lost a sweet, wonderful woman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWI2NmEyYWMtM2U5NS00MTc1LWFlM2ItMzcyZjg3Yzk5NTdlXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0620785","name":"Nanda","idIMDB":"nm0620785"},"actorId":"nm0620785","character":"Virendra's wife","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tanuja","urlProfile":"http://www.imdb.com/name/nm0849863","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmEzMDM2NTktMjQ1ZS00NWM0LWI3NzYtNmM3ZjA0MTFmNGM1XkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 September 1943","placeOfBirth":" Bombay, Bombay Presidency, British India","birthName":"Tanuja Samarth","height":"5' (1.52 m)","bio":"Tanuja was born on September 23, 1943 in Bombay, Bombay Presidency, British India as Tanuja Samarth. She is known for her work on Saathiya (2002), Khakee (2004) and Masoom (1983). She was previously married to Shomu Mukherjee.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmEzMDM2NTktMjQ1ZS00NWM0LWI3NzYtNmM3ZjA0MTFmNGM1XkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0849863","name":"Tanuja","idIMDB":"nm0849863"},"actorId":"nm0849863","character":"Raj Rani","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vijayendra Ghatge","urlProfile":"http://www.imdb.com/name/nm0315551","urlPhoto":"","biography":{"bio":"Vijayendra Ghatge is known for his work on Devdas (2002), Deewangee (2002) and Love Sickness (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0315551","name":"Vijayendra Ghatge","idIMDB":"nm0315551"},"actorId":"nm0315551","character":"Kunwar Narendra Pratap Singh","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kulbhushan Kharbanda","urlProfile":"http://www.imdb.com/name/nm0451425","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2ODU1NDM0MF5BMl5BanBnXkFtZTcwNjIzNTE3Mw@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 October 1944","placeOfBirth":" Hasan Abdal, Punjab, British India","bio":"Kulbhushan Kharbanda was born on October 21, 1944 in Hasan Abdal, Punjab, British India. He is an actor, known for Lagaan (2001), Haider (2014) and Hera Pheri (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2ODU1NDM0MF5BMl5BanBnXkFtZTcwNjIzNTE3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0451425","name":"Kulbhushan Kharbanda","idIMDB":"nm0451425"},"actorId":"nm0451425","character":"Chote Thakur Virendra 'Vir' Singh","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bindu","urlProfile":"http://www.imdb.com/name/nm0082848","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDc4YzAyYTQtZjVhYi00ZjZlLWE5ZmUtNTA5MDU3M2U2NmI5XkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 January 1951","placeOfBirth":" Valsad, State of Bombay, India","birthName":"Bindu Nanubhai Desai","height":"5' 6\" (1.68 m)","bio":"Bindu was born on April 17th in the Gujerati-speaking Desai family, consisting of her film producer dad, Nanubhai, and stage actress mom, Jyotsna. Due to her Bollywood connections she was able to find a niche in movies as early as 1962 with 'Anpadh' in which she plays the 'well educated' daughter of an 'illiterate' Mala Sinha. But the real meaty and negative role came her way with 'Do Raaste' in which she plays the wife of Prem Chopra, and the movie that type-cast her in as a vamp was 'Kati Patang' with 'Meraaa Naam has Shabnam, Pyar Se Log Mujhey Shaboo Kahete Hain...' in which she belittles and then blackmails Asha Parekh - a song that is still popular and has also been remixed. Quite unlike her screen characters, Bindu's life was not an easy one, especially at the age of 13 when her dad passed away, leaving the onus on her to fend for the rest of the Desai family. She got married to Champaklal Zaveri, who supported her talents and encouraged her to continue to act in movies. She has acted in over 160 movies in a career that spanned from 1962 through on to the 2004 hit 'Main Hoon Na'. Bindu is now a Bollywood legend, a vamp, a character actress, a stern mother-in-law, a dancer, a singer, a seductress but above all - an excellent actress.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDc4YzAyYTQtZjVhYi00ZjZlLWE5ZmUtNTA5MDU3M2U2NmI5XkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0082848","name":"Bindu","idIMDB":"nm0082848"},"actorId":"nm0082848","character":"Chamiya","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sushma Seth","urlProfile":"http://www.imdb.com/name/nm0786024","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2UyNjEwMjQtMmI3MC00NjZhLWFjYmMtMTQ4NmYxMzY0MTE5XkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1936","placeOfBirth":"","bio":"Sushma Seth was born on June 20, 1936. She is an actress, known for Kal Ho Naa Ho (2003), Kabhi Khushi Kabhie Gham... (2001) and Dhadkan (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2UyNjEwMjQtMmI3MC00NjZhLWFjYmMtMTQ4NmYxMzY0MTE5XkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0786024","name":"Sushma Seth","idIMDB":"nm0786024"},"actorId":"nm0786024","character":"Badi Maa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Raza Murad","urlProfile":"http://www.imdb.com/name/nm0613417","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDAzYzNkOGItM2I2My00M2ViLThhZTgtZjYxN2FiZWYzNzdmXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 November 1950","placeOfBirth":" Rampur, Uttar Pradesh, India","height":"6' 3\" (1.91 m)","bio":"Raza Murad was born on November 23, 1950 in Rampur, Uttar Pradesh, India. He is known for his work on Jodhaa Akbar (2008), Bajirao Mastani (2015) and Business Man (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDAzYzNkOGItM2I2My00M2ViLThhZTgtZjYxN2FiZWYzNzdmXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0613417","name":"Raza Murad","idIMDB":"nm0613417"},"actorId":"nm0613417","character":"Raja Virendra Pratap Singh","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rajendra Nath","urlProfile":"http://www.imdb.com/name/nm0707398","urlPhoto":"","biography":{"dateOfBirth":"1931","placeOfBirth":"","bio":"Rajendra Nath was born in 1931. He was an actor, known for Haré Rama Haré Krishna (1971), Mera Naam Joker (1970) and Love Sickness (1982). He died on February 13, 2008 in Mumbai, Maharashtra, India.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0707398","name":"Rajendra Nath","idIMDB":"nm0707398"},"actorId":"nm0707398","character":"Radha's husband","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kiran Vairale","urlProfile":"http://www.imdb.com/name/nm1151507","urlPhoto":"","biography":{"bio":"Kiran Vairale is an actress, known for Naram Garam (1981), Love Sickness (1982) and Saagar (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1151507","name":"Kiran Vairale","idIMDB":"nm1151507"},"actorId":"nm1151507","character":"Radha","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Om Prakash","urlProfile":"http://www.imdb.com/name/nm0695170","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWE3OTM3ODMtZGIzZC00YjU3LWIyZmItOGYxNDA3Mzg4NTk3XkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 December 1919","placeOfBirth":" Lahore, Punjab, British India [now Pakistan]","birthName":"Om Prakash Bakshi","bio":"Om Prakash was born on December 19, 1919 in Lahore, Punjab, British India as Om Prakash Bakshi. He was an actor and director, known for Zanjeer (1973), Padosan (1968) and Dus Lakh (1966). He died on February 12, 1998 in Mumbai, Maharashtra, India.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWE3OTM3ODMtZGIzZC00YjU3LWIyZmItOGYxNDA3Mzg4NTk3XkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0695170","name":"Om Prakash","idIMDB":"nm0695170"},"actorId":"nm0695170","character":"Poojari","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Monty Nath","urlProfile":"http://www.imdb.com/name/nm1550928","urlPhoto":"","biography":{"bio":"Monty Nath is an actor and director, known for Love Sickness (1982), Ram Teri Ganga Maili (1985) and Hum Hain Lajawaab (1984).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1550928","name":"Monty Nath","idIMDB":"nm1550928"},"actorId":"nm1550928","character":"Chote Thakur Vikram Singh","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rishi Kapoor","urlProfile":"http://www.imdb.com/name/nm0438501","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NDU3MTEyMV5BMl5BanBnXkFtZTcwMjAwMTA1NA@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 September 1952","placeOfBirth":" Bombay, State of Bombay, India","height":"5' 7\" (1.7 m)","bio":"Born in south Mumbai, Kapoor is the second son of film director and actor Raj Kapoor. He did his schooling with his brothers at Campion School,Mumbai. His brothers are well-known actors, Randhir Kapoor and Rajiv Kapoor. Rishi Kapoor debuted in his father's 1970 film Mera Naam Joker, playing his father's role as a child. Rishi Kapoor had his first lead role opposite Dimple Kapadia in the popular 1973 film Bobby which became an instant hit among youngsters. He made a popular pairing with future wife Neetu Singh in 1974-1981 but the pair was successful only in multi-star cast films as films with Rishi as main lead like Zehreela Insaan,Zinda Dil,Doosara Aadmi, Anjane Mein, Jhoota Kahin Ka, Dhan Daulat were box office flops.Rishi Neetu pair was successful in multi star films like Khel Khel Mein, Kabhie Kabhie, Amar Akbar Anthony,Pati Patni Aur Woh, Duniya Meri Jeb Mein.The only solo hit of the Rishi Neetu was Rafoo Chakkar. Rishi Kapoor got 51 films as the solo lead hero from 1974-1997 but of them 40 were box -office flops and managed only 11 hits - which were Bobby, Laila Majnu,Rafoo Chakkar, Sargam, Karz, Prem Rog, Nagina, Honeymoon, Banjaran, Heena and Bol Radha Bol.So he was offered the role of playing younger brother to lead heroes in multi star-cast movies from 1977-1994.Rishi Kapoor did 41 multi star cast films from 1976-2000 where Rishi was casted as 2nd or 3rd lead hero and of them 16 were flops and 25 were hits. He was often offered the role of playing younger brother to main lead heroes in the multi hero films he did where his character would be a romantic one and the story would revolve on the main lead hero of the film.In 90's his 2 hero films Deewana,Damini and Eena Meena Dika were a success. He got the plum lead hero roles in two-hero films only few times like in Hum Kisi Se Kum Nahin, Badalte Roshtey, Aap Ke Deewane, Saagar then in 90's with Chandni, Deewana(1992), Damini(1993) and Gurudev (1994); otherwise in the 2 hero films Rishi did in late 70's and through-out 80's, it was his other co-star whose character over-shadowed his and the other co-star was appreciated more like in case of Katilon Ke Kaatil, Coolie, Sitamgar, Zamana. After several box office failures from in 1990s, he eventually moved on to supporting roles in the 2000s. In 1999 he directed the film Aa Ab Laut Chalen.His last film as a romantic lead was the 5 year delayed release Karobaar: The Business of Love (2000)which was unsuccessful. He has since then played supporting roles in films like Yeh Hai Jalwa, Hum Tum, Fanaa, Namaste London, Love Aaj Kal and Patiala House. He also appeared in the British films Don't Stop Dreaming and Sambar Salsa. He was paired with Neetu Singh in the film Do Dooni Chaar (2010). Rishi has acted in the movie Chintu Ji in which he plays himself.In 2012 he appeared in a villainous role in Agneepath and in the multi-starer Housefull 2 where he appeared with brother Randhir for the first time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NDU3MTEyMV5BMl5BanBnXkFtZTcwMjAwMTA1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0438501","name":"Rishi Kapoor","nicknames":["Chintoo"],"idIMDB":"nm0438501"},"actorId":"nm0438501","character":"Devdhar 'Dev'","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Padmini Kolhapure","urlProfile":"http://www.imdb.com/name/nm0464075","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2I4N2JiYjQtMzJhMi00MjAyLThhYmUtOWYzYjFkYjJkNTk5XkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 November 1965","placeOfBirth":" Maharashtra, India","height":"5' 4\" (1.63 m)","bio":"Padmini Kolhapure was born on November 1, 1965 in Maharashtra, India. She is known for her work on Phata Poster Nikhla Hero (2013), Woh 7 Din (1983) and Insaf Ka Tarazu (1980). She has been married to Tutu Sharma since 1993.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2I4N2JiYjQtMzJhMi00MjAyLThhYmUtOWYzYjFkYjJkNTk5XkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0464075","name":"Padmini Kolhapure","nicknames":["Pandi"],"idIMDB":"nm0464075"},"actorId":"nm0464075","character":"Manorama 'Rama' 'Nanu'","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leela Mishra","urlProfile":"http://www.imdb.com/name/nm0592789","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzM0YzY0MmUtYmIwMS00NzNhLTliZjgtNGU0YWNkYjkzZDVkXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1908","placeOfBirth":" Jais, Uttar Pradesh, British India [now India]","bio":"Leela Mishra was born in 1908 in Jais, Uttar Pradesh, British India. She was an actress, known for Sholay (1975), Dosti (1964) and Assoiffé (1957). She died in 1988 in India.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzM0YzY0MmUtYmIwMS00NzNhLTliZjgtNGU0YWNkYjkzZDVkXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0592789","name":"Leela Mishra","idIMDB":"nm0592789"},"actorId":"nm0592789","character":"Bua","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0084532","urlIMDB":"http://www.imdb.com/title/tt0084532","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["3 hr 3 min (183 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":["Bombay Film Laboratories, India"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"7.2","filmingLocations":[{"location":"R.K. Studios, Chembur, Mumbai, Maharashtra, India"}],"awards":[{"award":"Filmfare Awards 1983","titlesAwards":[{"titleAwardOutcome":"Won Filmfare Award","categories":[{"category":"Best Actress","names":[{"name":"Padmini Kolhapure","id":"nm0464075","role":null}]},{"category":"Best Director","names":[{"name":"Raj Kapoor","id":"nm0004292","role":null}]},{"category":"Best Lyricist","names":[{"name":"Santosh Anand","id":"nm0025569","role":null}]},{"category":"Best Editor","names":[{"name":"Raj Kapoor","id":"nm0004292","role":null}]}]}]}],"votes":"631","type":"Movie","companyCreditsSimple":[{"idCompany":"co0156651","name":"K.R. Films Pvt. Ltd."}],"keywords":{"keywords":["love","tradition","hindu","tea","arranged marriage","sister in law sister in law relationship","car crash","sexual assault","rape","melodrama","accidental death","death of fiance","tragic event"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:30:57"}}