{"data":{"movies":[{"title":"Physical Evidence","originalTitle":"","year":"1989","releaseDate":"19890127","directors":[{"name":"Michael Crichton","id":"nm0000341"}],"writers":[{"name":"Steve Ransohoff","id":"nm0710390"},{"name":"Bill Phillips","id":"nm0680250"}],"runtime":"99 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMjAyNjc5M15BMl5BanBnXkFtZTYwOTg3Mjg5._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Mystery","Romance","Thriller"],"plot":"Extortionist Jake Farley is found strangled, and the clues lead directly to former detective Joe Paris, who insists on his innocence but can't provide an alibi. Public defendant Jenny Hudson gets the case, but has problems unravelling the case, complicated by the fact that virtually everyone hated Farley, and Paris has a few enemies as well. She rejects the prosecution's offers to plea bargain, but meanwhile the witnesses she finds are discredited or silenced, and an unidentified patrol car shadows Paris and Hudson wherever they go.","simplePlot":"A police officer suspended and now accused of murder is forced to join forces with his court-appointed attorney to assemble the pieces of a deadly puzzle to find the missing link before time runs out.","actors":[{"actorName":"Burt Reynolds","urlProfile":"http://www.imdb.com/name/nm0000608","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2Nzc1ODA1OF5BMl5BanBnXkFtZTcwMTc4MTc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 February 1936","placeOfBirth":" Lansing, Michigan, USA","birthName":"Burton Leon Reynolds Jr.","height":"5' 11\" (1.8 m)","bio":"Enduring, strong-featured, and genial star of US cinema, Burt Reynolds started off in TV westerns in the 1960s and then carved his name into 1970/1980s popular culture as a male sex symbol (posing nearly naked for \"Cosmopolitan\" magazine) and on-screen as both a rugged action figure and then as a wisecracking, Southern-type \"good olé' boy.\" Burton Leon Reynolds was born in Lansing, Michigan. He is the son of Fern H. (Miller) and Burton Milo Reynolds, who was in the army and later served as chief of police. His family moved to Florida, where he excelled as an athlete and played with Florida State University. He became an All Star Southern Conference halfback (and was earmarked by the Baltimore Colts) before a knee injury and a car accident ended his football career. Midway through college he dropped out and headed to New York with aspirations of becoming an actor. There he worked in restaurants and clubs while pulling the odd TV spot or theatre role. He was spotted in a New York City production of \"Mister Roberts,\" signed to a TV contract, and eventually had recurring roles in such shows as Gunsmoke (1955), Riverboat (1959) and his own series, Hawk (1966). Reynolds continued to appear in undemanding western roles, often playing an Indian halfbreed, in films such as Navajo Joe (1966), 100 Rifles (1969) and Sam Whiskey (1969). However, it was his tough-guy performance as macho Lewis Medlock in the John Boorman backwoods nightmare Deliverance (1972) that really stamped him as a bona-fide star. Reynolds' popularity continued to soar with his appearance as a no-nonsense private investigator in Shamus (1973) and in the Woody Allen comedy Everything You Always Wanted to Know About Sex * But Were Afraid to Ask (1972). Building further on his image as a Southern boy who outsmarts the local lawmen, Reynolds packed fans into theaters to see him in White Lightning (1973), The Longest Yard (1974), W.W. and the Dixie Dancekings (1975) and Gator (1976). At this time, ex-stuntman and longtime Reynolds buddy Hal Needham came to him with a \"road film\" script. It turned out to be the incredibly popular Smokey and the Bandit (1977) with Sally Field and Jerry Reed, which took in over $100 million at the box office. That film's success was followed by Smokey and the Bandit II (1980) and Smokey and the Bandit Part 3 (1983). Reynolds also appeared alongside Kris Kristofferson in the hit football film Semi-Tough (1977), with friend Dom DeLuise in the black comedy The End (1978) (which Reynolds directed), in the stunt-laden buddy film Hooper (1978) and then in the self-indulgent, star-packed road race flick The Cannonball Run (1981). The early 1980s started off well with a strong performance in the violent cop film Sharky's Machine (1981), which he also directed, and he starred with Dolly Parton in The Best Little Whorehouse in Texas (1982) and with fellow macho superstar Clint Eastwood in the coolly received City Heat (1984). However, other projects such as Stroker Ace (1983), Stick (1985) and Paternity (1981) failed to catch fire with fans and Reynolds quickly found himself falling out of popularity with movie audiences. In the late 1980s he appeared in only a handful of films, mostly below average, before his old friend television came to the rescue and he shone again in two very popular TV shows, B.L. Stryker (1989) and Evening Shade (1990), for which he won an Emmy. He was back on screen, but still the roles weren't grabbing the public's attention, until his terrific performance as a drunken politician in the otherwise woeful Striptease (1996) and then another tremendous showing as a manipulative porn director in Boogie Nights (1997), which scored him a Best Supporting Actor nomination. Like the phoenix from the ashes, Reynolds had resurrected his popularity and, in the process, had gathered a new generation of young fans, many of whom had been unfamiliar with his 1970s film roles. He put in entertaining work in Pups (1999), Mystery, Alaska (1999), Driven (2001) and L'enfant et le loup (2002). Definitely one of Hollywood's most resilient stars, Reynolds has continually surprised all with his ability to weather both personal and career hurdles and his 40-plus years in front of the cameras is testament to his staying ability, his acting talent and his appeal to film audiences.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2Nzc1ODA1OF5BMl5BanBnXkFtZTcwMTc4MTc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000608","name":"Burt Reynolds","nicknames":["Buddy"],"idIMDB":"nm0000608"},"actorId":"nm0000608","character":"Joe Paris","urlCharacter":"http://www.imdb.com/character/ch0193481","main":true},{"actorName":"Theresa Russell","urlProfile":"http://www.imdb.com/name/nm0000622","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxODQ5MDc4MF5BMl5BanBnXkFtZTcwOTM4NTY3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 March 1957","placeOfBirth":" San Diego, California, USA","birthName":"Theresa Lynn Paup","height":"5' 6½\" (1.69 m)","bio":"Theresa Russell, named one of the \"100 sexiest stars in film history\" (Empire Magazine), was born in San Diego, California. She was discovered by a photographer at the age of 12, and made her film debut in Elia Kazan's The Last Tycoon (1976), opposite Robert De Niro, Jack Nicholson and Robert Mitchum, at the age of 19. Her resume of nearly fifty films has centered on ground-breaking roles in acclaimed independent films, such as Bad Timing (1980), directed by Nicolas Roeg (whom she would later marry); Eureka (1983); Insignificance (1985); Aria (1987) and Ken Russell's Whore (1991). Her legendary star turn in the thriller, Black Widow (1987), co-starring Debra Winger, stands as one of the most iconic female crime dramas in cinema history. She has had roles in major film and television projects, including the feature films, Straight Time (1978), opposite Dustin Hoffman and Kathy Bates; The Razor's Edge (1984), opposite Bill Murray; Physical Evidence (1989) with Burt Reynolds; Kafka (1991), directed by Steven Soderbergh, playing opposite Jeremy Irons; Impulse (1990), directed by Sondra Locke; The Believer (2001), opposite Ryan Gosling; Luckytown (2000), with Kirsten Dunst and James Caan; Being Human (1994), opposite Robin Williams; Wild Things (1998), with Denise Richards, Matt Dillon and Kevin Bacon; Jolene (2008), opposite Jessica Chastain; the block-buster Spider-Man 3 (2007), and the mini-series Blind Ambition (1979), with Martin Sheen; Empire Falls (2005), with Ed Harris, Paul Newman and Helen Hunt; and Lifetime's Liz & Dick (2012), opposite Lindsay Lohan, portraying Elizabeth Taylor's mother. Along with her then-partner, legendary jazz musician, Michael Melvoin, she has performed in jazz clubs throughout the United States. She is the mother of two sons (Statten Roeg and Maximillian Roeg).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxODQ5MDc4MF5BMl5BanBnXkFtZTcwOTM4NTY3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000622","name":"Theresa Russell","idIMDB":"nm0000622"},"actorId":"nm0000622","character":"Jenny Hudson","urlCharacter":"http://www.imdb.com/character/ch0212921","main":true},{"actorName":"Ned Beatty","urlProfile":"http://www.imdb.com/name/nm0000885","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMzQ2Mzc3MF5BMl5BanBnXkFtZTYwMDIwMDM1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1937","placeOfBirth":" Louisville, Kentucky, USA","birthName":"Ned Thomas Beatty","height":"5' 7\" (1.7 m)","bio":"Stocky, genial-looking supporting actor Ned Beatty was once hailed by Daily Variety as the \"busiest actor in Hollywood\". Ned Thomas Beatty was born in Louisville, Kentucky, to Margaret (Fortney) and Charles William Beatty. He grew up fishing and working on farms. His hometown of St. Matthews, Kentucky, is hardly the environment to encourage a career in the entertainment industry, though, so when asked, \"How did you get into show business?\" Beatty responds, \"By hanging out with the wrong crowd.\" That \"crowd\" includes some of the industry's most prominent names, such as John Huston, Steven Spielberg, Robert Altman, Paul Newman, Richard Burton, Charlton Heston, Marlon Brando and Robert Redford. Beatty has garnered praise from both critics and peers as a dedicated actor's actor. He started as a professional performer at age ten, when he earned pocket money singing in gospel quartets and a barber shop. The big city and bright lights did not come easy, though. The first ten years of Beatty's career were spent at the Barter Theater in Abingdon, Virginia. He then moved on to the Erie Playhouse in Pennsylvania, the Playhouse Theater in Houston, Texas, and the prestigious Arena Stage Company in Washington, D.C. He was also a member of Shakespeare in Central Park, Louisville, Kentucky. Later, he appeared in the Broadway production of \"The Great White Hope\". At the Mark Taper Forum in Los Angeles, he won rave reviews when he starred in \"The Accidental Death of an Anarchist\". In 1971, Beatty was chosen by director John Boorman for the role of Bobby Trippe in the hit film/backwoods nightmare Deliverance (1972). Co-star Burt Reynolds and Beatty struck up a friendship together, and Ned has since been cast by Burt in several other films together, including White Lightning (1973), W.W. and the Dixie Dancekings (1975), and the abysmal Stroker Ace (1983). Ned's talents were also noticed by others in Hollywood and he was cast in many key productions of the 1970s turning in stellar performance, including an Academy Award nomination of Best Supporting Actor for his role in Network (1976). Beatty was also marvelous in Nashville (1975), under fire from a crazed sniper in The Deadly Tower (1975), an undercover FBI man in the action/comedy Silver Streak (1976), as Lex Luthor's bumbling assistant, Otis, in the blockbuster Superman (1978)... and he returned again with Gene Hackman to play Otis and Lex Luthor again in Superman II (1980). Beatty continued to remain busy throughout the 1980s with appearances in several big budget television productions including Les derniers jours de Pompéi (1984). However, the overall caliber of the productions in general did not match up to those he had appeared in during the 1970s. Nonetheless, Beatty still shone in films including The Big Easy (1986) and The Fourth Protocol (1987). Into the 1990s, Beatty's work output swung between a mixture of roles in family orientated productions (Gulliver's Travels (1996), Back to Hannibal: The Return of Tom Sawyer and Huckleberry Finn (1990), etc.) taking advantage of his \"fatherly\" type looks, but he could still accentuate a hard edge, and additionally was cast in Radioland Murders (1994) and Just Cause (1995). His many other films include The Toy (1982), All the President's Men (1976), Wise Blood (1979), Rudy (1993), Spring Forward (1999), Hear My Song (1991) -- for which he earned a Golden Globe nomination for Best Supporting Actor -- Prelude to a Kiss (1992), He Got Game (1998) and Cookie's Fortune (1999). Beatty's numerous television credits include three years on the NBC series Homicide: Life on the Street (1993), Streets of Laredo (1995), and The Boys (1993). Beatty received an Emmy Award nomination for Best Actor for his performance in Friendly Fire (1979) opposite Carol Burnett, and a Best Supporting Actor nomination for Family Channel's Last Train Home (1989). Other notable credits include The Wool Cap (2004), The Execution of Private Slovik (1974), A Woman Called Golda (1982), Pray TV (1982), the miniseries Robert Kennedy and His Times (1985), Lockerbie: A Night Remembered (1998) and T Bone N Weasel (1992). He also had a recurring role on Roseanne (1988) and performed musically on television specials for Dolly Parton and The Smothers Brothers. In 2001, Beatty returned to his theatrical roots starring in London's West End revival production of Tennessee Williams' \"Cat on a Hot Tin Roof\" with Brendan Fraser. He also appeared in the production on Broadway in 2003/2004 with Jason Patric and Ashley Judd. In 2006, Beatty completed three features to be released next year: The Walker (2007); a Paul Schrader film also starring Woody Harrelson, Kristin Scott Thomas, and Lily Tomlin; Paramount's Shooter (2007) starring Mark Wahlberg; and Charlie Wilson's War (2007), a Mike Nichols film with Tom Hanks, Philip Seymour Hoffman and Julia Roberts. Blessed with eight children, Beatty enjoys golf and playing the bass guitar. He gives himself until the age of 70 to become proficient at both. Also in the 21st century, Beatty turned out a terrific performance in the popular Where the Red Fern Grows (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMzQ2Mzc3MF5BMl5BanBnXkFtZTYwMDIwMDM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000885","name":"Ned Beatty","nicknames":["The busiest actor in Hollywood"],"idIMDB":"nm0000885"},"actorId":"nm0000885","character":"James Nicks","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kay Lenz","urlProfile":"http://www.imdb.com/name/nm0001464","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1OTQ5ODc0Nl5BMl5BanBnXkFtZTcwNDkzNzgzNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1953","placeOfBirth":" Los Angeles, California, USA","birthName":"Kay Ann Lenz","height":"5' 1\" (1.55 m)","bio":"Kay came from an L.A. showbiz family. Her father was producer/commentator Ted Lenz and her mother model/radio engineer Kay Miller Lenz. At the ripe old age of eight weeks, Kay appeared on her first TV show produced by her dad as a baby being held up and sung to. She continued on in her father's TV shows and commercials throughout her childhood. In the 60s, she appeared as a teen on stage (Pasadena Playhouse) and in guest parts on The Monroes (1966), The Andy Griffith Show (1960) and Ironside (1967). Kay flirted with 70s film stardom after being cast by director Clint Eastwood in the film Breezy (1973) opposite William Holden as a plucky, troubled hippie/free spirit who has an affair with a much older businessman. Kay was singled out for her affecting performance but the film was ignored. She ventured on but none of her subsequent feisty roles in La route de la violence (1975), The Great Scout & Cathouse Thursday (1976), Mean Dog Blues (1978) and House (1985) put her over the top. She gained quite a bit of exposure, however, after her wedding to former teen idol David Cassidy in 1977. The marriage lasted six years. TV remained Kay's medium of choice and she has garnered two Emmy awards in the process.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1OTQ5ODc0Nl5BMl5BanBnXkFtZTcwNDkzNzgzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001464","name":"Kay Lenz","idIMDB":"nm0001464"},"actorId":"nm0001464","character":"Deborah Quinn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ted McGinley","urlProfile":"http://www.imdb.com/name/nm0569337","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTQ2OTk3OV5BMl5BanBnXkFtZTcwNjcyODUyMg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 May 1958","placeOfBirth":" Newport Beach, California, USA","birthName":"Theodore Martin McGinley","height":"6' (1.83 m)","bio":"Theodore Martin 'Ted' McGinley was born on May 30, 1958 in Newport Beach, California. He is perhaps best known for his long-running roles in the television series Happy Days (1974), The Love Boat (1977), Dynasty (1981), Married with Children (1987) and The West Wing (1999). Formerly a male model, McGinley was spotted by a casting director after appearing in the GQ magazine, and was subsequently offered the role of Roger Phillips in Happy Days (1974). However, the veteran television star is no stranger to film either, having appeared in a string of features including Young Doctors in Love (1982), Revenge of the Nerds (1984), Wayne's World 2 (1993), Major League: Back to the Minors (1998) and Pearl Harbor (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTQ2OTk3OV5BMl5BanBnXkFtZTcwNjcyODUyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0569337","name":"Ted McGinley","idIMDB":"nm0569337"},"actorId":"nm0569337","character":"Kyle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom O'Brien","urlProfile":"http://www.imdb.com/name/nm0639856","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5ODkyNjY1OV5BMl5BanBnXkFtZTYwMzU4ODYy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 April 1965","placeOfBirth":" Burbank, California, USA","birthName":"Thomas Patrick O'Brien","height":"6' (1.83 m)","bio":"Born in Burbank, California, Tom O'Brien began his acting career in 1983 at San Francisco's American Conservatory Theatre, as a student of the conservatory and member of the acting company. His stage debut was Marsha Norman's \"The Holdup.\" Other stage credits include \"Mass Appeal\"; \"A Midsummer Night's Dream\", as Puck; \"The Sleeping Prince\" with 'Annette Bening'; \"1918\"; \"The Lower Depths\"; and \"Da Carravaggio\", with Manhattan Class Company, in New York. Feature credits include The Astronaut's Wife (1999), The Big Easy (1986), Les accusés (1988), Flashback (1990), Facade (1999), and Physical Evidence (1989). Television credits include The Beltway (????) for USA Network, with Charles S. Dutton, and a recurring role on WB's Smallville (2001), as Journalist Roger Nixon. Guest Star turns include Stargate SG-1 (1997), The Dead Zone (2002), CSI: Crime Scene Investigation (2000), The X-Files (1993), JAG (1995), Men (1989), Strange World: Pilot (1999), NYPD Blue (1993), Philly (2001), Dark Skies (1996), Early Edition (1996), L.A. Law (1986), Timecop (1997), The Strip (1999), and Thirtysomething (1987). TV films include the ABC mini-series Son of the Morning Star (1991); NBC's Baby Brokers (1994); CBS's Love and Lies (1990), and Lifetime's Storm and Sorrow (1990). As a producer, O'Brien founded both Irreverent Media Ltd. (IML) in Vancouver, British Columbia, and Fractious Tribes Productions (FTP). IML's feature projects include the magical romantic comedy \"Best Restaurant\"; FTP's projects include the thriller \"Sleeptalkers\". Projects in development include the sci-fi fantasy feature, \"Gone Green\" and the television mini-series \"Coordinates\". In 2007 O'Brien co-founded Lasting Footprint Arts Foundation (LFAF), which develops arts related strategic initiatives; in 2008 O'Brien co-founded Whole World Fund (w2f), a non-profit corporation which finances feature film entertainment and directs a portion of profits to benevolent organizations associated with the central themes of the stories.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5ODkyNjY1OV5BMl5BanBnXkFtZTYwMzU4ODYy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0639856","name":"Tom O'Brien","nicknames":["Rainman"],"idIMDB":"nm0639856"},"actorId":"nm0639856","character":"Matt Farley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kenneth Welsh","urlProfile":"http://www.imdb.com/name/nm0920564","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjY5MDQzNF5BMl5BanBnXkFtZTgwNTQ2MzMyMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 March 1942","placeOfBirth":" Edmonton, Alberta, Canada","height":"5' 9\" (1.75 m)","bio":"Kenneth Welsh was born on March 30, 1942 in Edmonton, Alberta, Canada. He is an actor, known for The Day After Tomorrow (2004), Aviator (2004) and The Exorcism of Emily Rose (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjY5MDQzNF5BMl5BanBnXkFtZTgwNTQ2MzMyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0920564","name":"Kenneth Welsh","idIMDB":"nm0920564"},"actorId":"nm0920564","character":"Harry Norton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ray Baker","urlProfile":"http://www.imdb.com/name/nm0048844","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI4ODkwMTI4N15BMl5BanBnXkFtZTgwOTU2MTI5ODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1948","placeOfBirth":" Omaha, Nebraska, USA","height":"6' 2\" (1.88 m)","bio":"Ray Baker was born in Omaha, grew up in Colorado, and graduated from the University of Denver. In 1970 he moved to the East Coast, and began his acting career doing improvisational theater in Boston and New York. During 19 years in New York City, he appeared on Broadway in such productions as \"Crimes of the Heart\", \"Is There Life After High School?\", \"Torch Song Trilogy\", among others. He also appeared in many in off-Broadway shows, among them \"The Proposition\" and \"Character Lines\". He moved to Los Angeles in 1989, where he now lives, and works as an actor in movies and TV.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI4ODkwMTI4N15BMl5BanBnXkFtZTgwOTU2MTI5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0048844","name":"Ray Baker","idIMDB":"nm0048844"},"actorId":"nm0048844","character":"Strickler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ken James","urlProfile":"http://www.imdb.com/name/nm0416663","urlPhoto":"","biography":{"dateOfBirth":"11 March 1934","placeOfBirth":" Canada","birthName":"Kenneth James","bio":"Ken James was born on March 11, 1934 in Canada as Kenneth James. He was an actor, known for Cinderella Man (2005), Fly Away Home (1996) and The Shipping News (2001). He died on September 21, 2016.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0416663","name":"Ken James","idIMDB":"nm0416663"},"actorId":"nm0416663","character":"Hank Carruth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael P. Moran","urlProfile":"http://www.imdb.com/name/nm0602930","urlPhoto":"","biography":{"dateOfBirth":"8 February 1944","placeOfBirth":" USA","bio":"Michael P. Moran was born on February 8, 1944 in the USA. He was an actor, known for Scarface (1983), A Perfect Murder (1998) and Ghostbusters II (1989). He died on February 4, 2004 in New York City, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0602930","name":"Michael P. Moran","idIMDB":"nm0602930"},"actorId":"nm0602930","character":"Tony Reugger","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Angelo Rizacos","urlProfile":"http://www.imdb.com/name/nm0729766","urlPhoto":"","biography":{"bio":"Angelo Rizacos is an actor, known for Ticket to Heaven (1981), Physical Evidence (1989) and Beautiful Dreamers (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0729766","name":"Angelo Rizacos","idIMDB":"nm0729766"},"actorId":"nm0729766","character":"Tony Sklar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lamar Jackson","urlProfile":"http://www.imdb.com/name/nm0413758","urlPhoto":"","biography":{"bio":"Lamar Jackson is a producer and actor, known for Evening Shade (1990), The Man from Left Field (1993) and The Man Upstairs (1992).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0413758","name":"Lamar Jackson","idIMDB":"nm0413758"},"actorId":"nm0413758","character":"Delmar Fraser","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Hubbard","urlProfile":"http://www.imdb.com/name/nm0399214","urlPhoto":"","biography":{"bio":"Paul Hubbard is an actor, known for A Christmas Story (1983), Matchstick Men (2003) and The Familiar (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0399214","name":"Paul Hubbard","idIMDB":"nm0399214"},"actorId":"nm0399214","character":"Burt Knight","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Larry Reynolds","urlProfile":"http://www.imdb.com/name/nm0721823","urlPhoto":"","biography":{"bio":"Larry Reynolds was born in Brockport, New York, USA. He is known for his work on Blown Away (1994), Meurtres à la St-Valentin (1981) and PCU (1994). He died on March 14, 1996 in Orangeville, Ontario, Canada.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0721823","name":"Larry Reynolds","idIMDB":"nm0721823"},"actorId":"nm0721823","character":"Trial Judge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter MacNeill","urlProfile":"http://www.imdb.com/name/nm0534132","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDI3ODg5M15BMl5BanBnXkFtZTcwNTQ1MzM3Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"6' 1¼\" (1.86 m)","bio":"Peter MacNeill was born in New Brunswick, Canada. He is known for his work on A History of Violence (2005), Crash (1996) and Frequency (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDI3ODg5M15BMl5BanBnXkFtZTcwNTQ1MzM3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0534132","name":"Peter MacNeill","idIMDB":"nm0534132"},"actorId":"nm0534132","character":"Brannigan","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0098093","urlIMDB":"http://www.imdb.com/title/tt0098093","business":{"budget":{"money":"$17,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1987/\">1987</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 39 min (99 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panaflex Cameras and Lenses by Panavision"],"laboratory":["Medallion Film Laboratories, Toronto, Canada"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.1","filmingLocations":[{"location":"Tobin Bridge, Boston, Massachusetts, USA"}],"rated":"R","awards":[],"votes":"1,201","type":"Movie","companyCreditsSimple":[{"idCompany":"co0050868","name":"Columbia Pictures Corporation"}],"keywords":{"keywords":["police officer","alibi","police","murder","cop killed by a cop","police officer shot in the back","witness protection program","police protection","police officer killed by silenced gun","impersonating a police officer","killed in police car","police officer shot in the head","police officer shot","police officer killed","murder of a policeman","death","false accusation","lawyer client romance","prison murder","acid","dirty cop","suspended cop","reference to tarzan","tape recorder","suicide by hanging","reference to richard nixon","garrote","public defender","jury selection","supper club","co habitation","stock broker","boston","red herring","evidence","whodunit","shot in chest","district attorney","murder trial","attempted suicide","killed by woman"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:41:33"}}