{"data":{"movies":[{"title":"The Saturday Night Kid","originalTitle":"","year":"1929","releaseDate":"19291025","directors":[{"name":"A. Edward Sutherland","id":"nm0840042"}],"writers":[{"name":"George Abbott","id":"nm0007973"},{"name":"Lloyd Corrigan","id":"nm0180987"}],"runtime":"63 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzM5MzM1MzA0N15BMl5BanBnXkFtZTgwMTk1NTE3MzE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"Jayme and sister Janie are salesgirls in Ginsberg's Department Store. Mayme is in love with store clerk Bill, but Janie tries to steal him from her. Hazel, another salesgirl, is Jean Harlow's first credited role.","simplePlot":"Jayme and sister Janie are salesgirls in Ginsberg's Department Store. Mayme is in love with store clerk Bill, but Janie tries to steal him from her. Hazel, another salesgirl, is Jean Harlow's first credited role.","actors":[{"actorName":"Clara Bow","urlProfile":"http://www.imdb.com/name/nm0001966","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MTEwOTA4NV5BMl5BanBnXkFtZTYwNDQ4NzI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1905","placeOfBirth":" Brooklyn, New York, USA","birthName":"Clara Gordon Bow","height":"5' 3½\" (1.61 m)","bio":"Clara Gordon Bow, destined to become THE flapper of the 1920's, was born and raised in poverty in Brooklyn, New York, on July 29, 1905. Her family was also beset with violence. Her mother tried to slit Clara's throat when she attempted to enter the film industry. She won a photo beauty contest which launched her movie career that would eventually number 58 films, from 1922 to 1933. It was the movie It (1927), which was to define her career. The film starred Clara as a shop girl who was asked out by the store's owner. As you watch the silent film you can see the excitement as she prepared for her date with the boss, her girlfriend trying hard to assist her. She was trying to use a pair of scissors to modify her dress in order to look more \"sexy\". This movie did a lot to change society's mores as there was only a few years between World War I and Clara Bow, but this movie went a long way in how society looked at itself. Clara was flaming youth in rebellion. In the film she was presenting a worldly wisdom that somehow sex meant having a good time. But you shouldn't be misled by the film, because she was still close to Lillian Gish in that when her boss tries to kiss her goodnight, she slaps him. Yes, she, too, was a good girl and a first cousin of Trueheart Susie. At the height of her popularity she received over 45,000 fan letters a month. She, too, was probably the most overworked and underpaid star in the industry. With the coming of sound, which did lend itself to her thick Brooklyn accent, her popularity waned. Clara was also involved in several court battles ranging from unpaid taxes to being in divorce court for \"stealing\" women's husbands. After the court trials, she made a couple of attempts to get back in the public eye. One was Call Her Savage (1932) in 1932. It was somewhat of a failure at the box office and her last was in 1933 in a film called Hoopla (1933). She, then, married cowboy star, Rex Bell at the age of 26 and retired from the film world at the age of 28. She was a doting mother of her two sons and would do anything to please them. Haunted by a weight problem, and a mental imbalance, she never entered show business again. Clara was confined to a sanitarium from time to time and was not allowed access to her loving sons she adored very much. She died of a heart attack in West Los Angeles, on September 26, 1965. She was 60 years old. Today she is finding a renaissance among movie buffs, who are recently discovering the virtues of silent film. The actress who wanted so much to be like the wonderful young lady in It (1927) has the legacy of her films to confirm what a wonderful lady she really was. She, too, was America's first sex symbol.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MTEwOTA4NV5BMl5BanBnXkFtZTYwNDQ4NzI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001966","name":"Clara Bow","nicknames":["The \"It\" Girl"],"idIMDB":"nm0001966"},"actorId":"nm0001966","character":"Mayme Barry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jean Arthur","urlProfile":"http://www.imdb.com/name/nm0000795","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NDczNTA1N15BMl5BanBnXkFtZTYwNjk2MjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 October 1900","placeOfBirth":" Plattsburgh, New York, USA","birthName":"Gladys Georgianna Greene","height":"5' 3\" (1.6 m)","bio":"This marvelous screen comedienne's best asset was only muffled during her seven years' stint in silent films. That asset? It was, of course, her squeaky, frog-like voice, which silent-era cinema audiences had simply no way of perceiving, much less appreciating. Jean Arthur, born Gladys Georgianna Greene in upstate New York, 20 miles south of the Canadian border, has had her year of birth cited variously as 1900, 1905 and 1908. Her place of birth has often been cited as New York City! (Herein we shall rely for those particulars on Miss Arthur's obituary as given in the authoritative and reliable New York Times. The date and place indicated above shall be deemed correct.) Following her screen debut in a bit part in John Ford's Cameo Kirby (1923), she spent several years playing unremarkable roles as ingénue or leading lady in comedy shorts and cheapie westerns. With the arrival of sound she was able to appear in films whose quality was but slightly improved over that of her past silents. She had to contend, for example, with the consummately evil likes of Dr. Fu Manchu (played by future \"Charlie Chan\" Warner Oland). Her career bloomed with her appearance in Ford's The Whole Town's Talking (1935), in which she played opposite Edward G. Robinson, the latter in a dual role as a notorious gangster and his lookalike, a befuddled, well-meaning clerk. Here is where her wholesomeness and flair for farcical comedy began making themselves plain. The turning point in her career came when she was chosen by Frank Capra to star with Gary Cooper in the classic social comedy Mr. Deeds Goes to Town (1936). Here she rescues the hero - thus herself becoming heroine! - from rapacious human vultures who are scheming to separate him from his wealth. In Capra's masterpiece Mr. Smith Goes to Washington (1939), she again rescues a besieged hero (James Stewart), protecting him from a band of manipulative and cynical politicians and their cronies and again she ends up as a heroine of sorts. For her performance in George Stevens' The More the Merrier (1943), in which she starred with Joel McCrea and Charles Coburn, she received a Best Actress Academy Award nomination, but the award went to Jennifer Jones in The Song of Bernadette (1943) (Coburn, incidentally, won for Best Supporting Actor). Her career began waning toward the end of the 1940s. She starred with Marlene Dietrich and John Lund in Billy Wilder's fluff about post-World War II Berlin, A Foreign Affair (1948). Thereafter, the actress would return to the screen but once, again for George Stevens but not in comedy. She starred with Alan Ladd and Van Heflin in Stevens' western Shane (1953), playing the wife of a besieged settler (Heflin) who accepts help from a nomadic gunman (Ladd) in the settler's effort to protect his farm. It was her silver-screen swansong. She would provide one more opportunity for a mass audience to appreciate her craft. In 1966 she starred as a witty and sophisticated lawyer, Patricia Marshall, a widow, in the TV series The Jean Arthur Show (1966). Her time was apparently past, however; the show ran for only 11 weeks.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NDczNTA1N15BMl5BanBnXkFtZTYwNjk2MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000795","name":"Jean Arthur","idIMDB":"nm0000795"},"actorId":"nm0000795","character":"Janie Barry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Hall","urlProfile":"http://www.imdb.com/name/nm0355671","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2NhOTQzMTAtZTc5Zi00NDBkLTk0MDItMmQ4NjI0ZWI3ZjQ1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 October 1900","placeOfBirth":" Dallas, Texas, USA","birthName":"James E. Brown","height":"5' 11\" (1.8 m)","bio":"James Hall was born on October 22, 1900 in Dallas, Texas, USA as James E. Brown. He was an actor, known for Hell's Angels (1930), Four Sons (1928) and Hotel Imperial (1927). He was married to Irene Gardner. He died on June 7, 1940 in Jersey City, New Jersey, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2NhOTQzMTAtZTc5Zi00NDBkLTk0MDItMmQ4NjI0ZWI3ZjQ1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0355671","name":"James Hall","idIMDB":"nm0355671"},"actorId":"nm0355671","character":"William Taylor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edna May Oliver","urlProfile":"http://www.imdb.com/name/nm0646829","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNTM0NTA0MV5BMl5BanBnXkFtZTgwMzYxNjQ3MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 November 1883","placeOfBirth":" Malden, Massachusetts, USA","birthName":"Edna May Nutter","height":"5' 7\" (1.7 m)","bio":"She was born Edna May Nutter, a child of solid New England stock, on 9th November 1883 in Malden, Massachusetts. The daughter of Ida May and Charles Edward Nutter, Edna was a descendant of the 6th American president John Quincy Adams. Miss Oliver took an early interest in the stage, and she would quit school at the age of 14 to pursue her ambitions in the theater. Despite abandoning traditional schooling, Edna continued to study the performing arts, including speech and piano. One of her first jobs was as pianist with an all female orchestra which toured America around the turn of the century. By 1917 she had achieved success on Broadway in the hit play \"Oh, Boy\". By 1923 she had appeared in her first film. Edna May Oliver seems to have been born to play the classics of American and British literature. Some of her most memorable film roles were in adaptations of works of Charles Dickens. Although some have described her as plain or \"horse faced\", Edna May Oliver's comedic talents lent a beautiful droll warmth to her characters. She was usually called upon to play less glamorous roles such as a spinsters, but she played them with such soul, wit, and depth that to this day she remains one of the best loved of Hollywood's character actresses. A fine example of her comedic talent can be found in Laugh and Get Rich (1931). Here we find her playing a role almost autobiographical in nature, that of a proud woman with Boston roots who has married \"down\". As the plot unwinds, she is invited to a society gala despite her modest circumstances. At the gala she becomes tipsy. With a frolicsome air Edna May seems to use the role to gently mock her real self. Her slightly drunk character seizes upon a bit of flattery, and alluding to her old New England family, proudly proclaims to each who will listen, \"I am a Cranston. That explains everything!\". In real life, Edna May Oliver was a Nutter, and perhaps that explains everything. Edna May Oliver married stock broker David Pratt in 1928, but the marriage ended in divorce five years later. In 1939 she received an Oscar nomination for her supporting role as Widow McKlennar in the picture Drums Along the Mohawk (1939). That was to be one of her last films. Miss Oliver was struck ill in August of 1942. Although she seemed to recover briefly, she was re-admitted to Los Angeles's Cedars of Lebanon hospital in October Her dear friend actress Virginia Hammond flew out from New York to stay by her bedside. Edna May Oliver died on her 59th birthday, 9th November 1942. Virginia Hammond was with her and said, \"She died without ever being aware of the gravity of her condition. She just went peacefully asleep.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNTM0NTA0MV5BMl5BanBnXkFtZTgwMzYxNjQ3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0646829","name":"Edna May Oliver","idIMDB":"nm0646829"},"actorId":"nm0646829","character":"Miss Streeter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Sellon","urlProfile":"http://www.imdb.com/name/nm0783041","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWIwY2Y5NTItYTY0ZS00YzE4LTg0NjUtZTAxZTIzOGUyZDQwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1870","placeOfBirth":" Boston, Massachusetts, USA","height":"5' 11\" (1.8 m)","bio":"Charles Sellon was born on August 24, 1870 in Boston, Massachusetts, USA. He was an actor, known for Bright Eyes (1934), It's a Gift (1934) and The Painted Desert (1931). He was married to Florence E. Willis. He died on June 26, 1937 in La Crescenta, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWIwY2Y5NTItYTY0ZS00YzE4LTg0NjUtZTAxZTIzOGUyZDQwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0783041","name":"Charles Sellon","idIMDB":"nm0783041"},"actorId":"nm0783041","character":"Lem Woodruff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ethel Wales","urlProfile":"http://www.imdb.com/name/nm0907386","urlPhoto":"","biography":{"dateOfBirth":"4 April 1878","placeOfBirth":" Passaic, New Jersey, USA","height":"5' 5½\" (1.66 m)","bio":"Ethel Wales was born on April 4, 1878 in Passaic, New Jersey, USA. She was an actress, known for The Rag Man (1925), The Covered Wagon (1923) and The Criminal Code (1931). She was married to John W. Stockton and Wellington Wales. She died on February 15, 1952 in Hollywood, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0907386","name":"Ethel Wales","idIMDB":"nm0907386"},"actorId":"nm0907386","character":"Lily Woodruff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hyman Meyer","urlProfile":"http://www.imdb.com/name/nm0583167","urlPhoto":"","biography":{"dateOfBirth":"23 October 1876","placeOfBirth":" San Francisco, California, USA","bio":"Hyman Meyer was born on October 23, 1876 in San Francisco, California, USA. He was an actor, known for The Saturday Night Kid (1929), She's a Boy (1927) and Circus Blues (1928). He died on October 7, 1945 in Hollywood, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0583167","name":"Hyman Meyer","idIMDB":"nm0583167"},"actorId":"nm0583167","character":"Mr. Ginsberg","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0020364","urlIMDB":"http://www.imdb.com/title/tt0020364","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"27","month":"07","year":"1929","remarks":null},{"money":null,"country":null,"day":"19","month":"08","year":"1929","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 3 min (63 min)"],"soundMix":["Mono (Western Electric Sound System)"],"color":["Black and White"],"aspectRatio":["1.20 : 1"],"camera":null,"laboratory":null,"filmLength":["1,833.37 m (7 reels) (sound version)","1,948.28 m (7 reels) (silent version)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.5","filmingLocations":[{"location":"Paramount Studios - 5555 Melrose Avenue, Hollywood, Los Angeles, California, USA"}],"awards":[],"votes":"124","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["department store","apartment","comeuppance","golddigger","sibling rivalry","workplace","boyfriend girlfriend relationship","workplace romance","new york city","coworker relationship","dice game","sister sister relationship","matron","reducing machine","rivalry","pageant","party","incompetence","based on play"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 06:30:29"}}