{"data":{"movies":[{"title":"There Goes My Heart","originalTitle":"","year":"1938","releaseDate":"19381014","directors":[{"name":"Norman Z. McLeod","id":"nm0572851"}],"writers":[{"name":"Eddie Moran","id":"nm0602840"},{"name":"Jack Jevne","id":"nm0422382"}],"runtime":"83 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDZkZjkzNjUtMWQ2OS00NDdkLWE3OWQtODBiOWRhM2QxOGQ3XkEyXkFqcGdeQXVyNDY3MzU2MDM@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"Seeing her chance, 25-year-old heiress (Virginia Bruce) flees from her over-protective grandfather with none of her fortune in her purse. On the streets of New York, she is befriended by a shop girl (Patsy Kelly) . The shop girl takes her in and gets her a job at the store which is part of a chain owned by the heiress. Unbeknownst to the newsworthy heiress, her true identity is known to a single reporter (March).","simplePlot":"Seeing her chance, 25-year-old heiress (Virginia Bruce) flees from her over-protective grandfather with none of her fortune in her purse. On the streets of New York, she is befriended by a ... ","actors":[{"actorName":"Fredric March","urlProfile":"http://www.imdb.com/name/nm0545298","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI3MDEyMzg2OF5BMl5BanBnXkFtZTYwNzA2MjI2._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 August 1897","placeOfBirth":" Racine, Wisconsin, USA","birthName":"Ernest Frederick McIntyre Bickel","height":"5' 10\" (1.78 m)","bio":"Fredric March began a career in banking but in 1920 found himself cast as an extra in films being produced in New York. He starred on the Broadway stage first in 1926 and would return there between screen appearances later on. He won plaudits (and an Academy Award nomination) for his send-up of John Barrymore in The Royal Family of Broadway (1930). Four more Academy Award nominations would come his way, and he would win the Oscar for Best Actor twice: for Dr. Jekyll and Mr. Hyde (1931) and The Best Years of Our Lives (1946). He could play roles varying from heavy drama to light comedy, and was often best portraying men in anguish, such as Willy Loman in Death of a Salesman (1951). As his career advanced he progressed from leading man to character actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI3MDEyMzg2OF5BMl5BanBnXkFtZTYwNzA2MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0545298","name":"Fredric March","nicknames":["Freddie"],"idIMDB":"nm0545298"},"actorId":"nm0545298","character":"Bill Spencer","urlCharacter":"http://www.imdb.com/character/ch0504958","main":true},{"actorName":"Virginia Bruce","urlProfile":"http://www.imdb.com/name/nm0115597","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDQyNjQ0M15BMl5BanBnXkFtZTYwMTYyNjU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1910","placeOfBirth":" Minneapolis, Minnesota, USA","birthName":"Helen Virginia Briggs","height":"5' 6\" (1.68 m)","bio":"American leading lady of the 1930s and 1940s, Virginia Bruce was born in Minnesota but grew up in Fargo, North Dakota, and came to California to attend college. Her blond good looks got her an entry into films, and after a few extra roles and bit parts she began to make serious inroads as a leading woman in secondary films and as the \"other\" woman in more prestigious productions. She married screen legend John Gilbert, then in his decline. Subsequently she was married to director J. Walter Ruben and to Turkish producer/director Ali Ipar, for whom she appeared in some Turkish films all but unseen in America. She died in 1982.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDQyNjQ0M15BMl5BanBnXkFtZTYwMTYyNjU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0115597","name":"Virginia Bruce","idIMDB":"nm0115597"},"actorId":"nm0115597","character":"Joan Butterfield","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patsy Kelly","urlProfile":"http://www.imdb.com/name/nm0446763","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NzQ1NTM1NF5BMl5BanBnXkFtZTcwOTA2NTExOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 January 1910","placeOfBirth":" Brooklyn, New York, USA","birthName":"Bridget Sarah Veronica Rose Kelly","height":"5' 4\" (1.63 m)","bio":"Patsy Kelly was born Bridget Sarah Veronica Rose Kelly on January 12, 1910, in Brooklyn, New York. She began performing in vaudeville when she was just twelve years old. Patsy worked with comedian Frank Fay and starred in several Broadway shows. She was discovered by producer Hal Roach who paired her with Thelma Todd in a series of comedy shorts. They became a popular onscreen team and made thirty-five films together including Top Flat and Done In Oil. Although Patsy never became an A-list star she continued to work throughout the 1930s. She had supporting roles in Pigskin Parade, Merrily We Live, and Topper Returns. Patsy was a lesbian and she was always open with the press about her sexuality. She had a long-term relationship with actress Wilma Cox. By the early 1940s Patsy was drinking heavily and making headlines for her erratic behavior. She decided to quit show business and moved to New York City. She started dating Tallulah Bankhead and worked as her secretary. Eventually Patsy went back to acting and appeared on numerous television shows. She also had small roles in the films Rosemary's Baby and Freaky Friday. Patsy won a Tony award in 1971 for her performance in No No Nanette. After suffering a stroke she moved into a nursing home. She died from pneumonia on September 24, 1981. Patsy is buried at Calvary Cemetery in Queens, New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NzQ1NTM1NF5BMl5BanBnXkFtZTcwOTA2NTExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0446763","name":"Patsy Kelly","nicknames":["The Queen of Wisecracks"],"idIMDB":"nm0446763"},"actorId":"nm0446763","character":"Peggy O'Brien","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alan Mowbray","urlProfile":"http://www.imdb.com/name/nm0610253","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMzMyMjc4Ml5BMl5BanBnXkFtZTcwODMwNTMxOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1896","placeOfBirth":" London, England, UK","birthName":"Ernest Allen","height":"6' (1.83 m)","bio":"Alan Mowbray, the American film actor who was one of the founding members of the Screen Actors Guild, was born Ernest Allen on August 18, 1896, in London, England, to a non-theatrical family. He served in the British army during World War I and received the Military Medal and the French Croix De Guerre for bravery in action. He began as a stage actor in England, and in some accounts he gave of his life, claimed he was a provincial actor in England before his naval service. In other versions, he claimed he turned to acting after The Great War, as World War I was then known, as he was broke and had no other skills. After acting in London's West End, Mowbray came to the United States, where he toured the country with the Theater Guild from 1923 to 1929. On the road with the Guild, he most enjoyed acting in the plays of Noël Coward and George Bernard Shaw. He made his Broadway debut in the play \"Sport of Kings\" at the Lyceum Theatre on May 4, 1926. He also appeared on Broadway in \"These Modern Women\" in February 1928 and in \"The Amorous Antic\" in December 1929. On August 25, 1929, Mowbray's own play, \"Dinner is Served,\" an original comedy he wrote, directed and starred in, made its debut at the Cort Theatre. The play was not a success, closing after just four performances. After \"The Amorous Antic,\" Mowbray did not appear again on Broadway until 1963, when he was featured in \"Enter Laughing,\" the hit stage adaptation of Carl Reiner's novel. His relative lack of success on Broadway during the \"Roaring Twenties\" did not matter, as sound had come to Hollywood and the studios were looking for stage actors who could appear in the talkies. Blessed with excellent diction, and tall with a stiff posture and a patrician air, he was ideal for character parts in sound pictures. A member of the \"stiff-upper lip\" school of British acting, he was often cast as a British, European or upper-class American gentleman, or as an aristocrat or royalty. As he aged, roles as doctors or butlers were his forte. Mowbray was praised by the critics for limning George Washington in the 1931 biopic Alexander Hamilton (1931) (he would once again play the Father of His Country, this time in a comic vein, in the 1945 musical Where Do We Go from Here? (1945)). He had a romantic lead role opposite Miriam Hopkins in Pioneer Films' Becky Sharp (1935), which also starred Fredric March and was the first feature film made in three-strip Technicolor. Mowbray had the distinction of appearing in movies with three screen Sherlock Holmeses: Clive Brook in Sherlock Holmes (1932), Reginald Owen in A Study in Scarlet (1933) and Basil Rathbone in Terror by Night (1946). He played the butler in the first two \"Topper\" films, and as a character actor had memorable turns in two John Ford pictures, My Darling Clementine (1946) and Wagon Master (1950). In the area of typecasting, Mowbray could be counted on as a \"pompous blowhard\" in such movies as My Man Godfrey (1936), or as \"the surprise killer\" in B-movie murder mysteries. One of his favorite roles was the con man in the television series Colonel Humphrey Flack (1953), which ran on the Dumont network in 1953. Mowbray occasionally was a screenwriter, but mostly concentrated on acting. In his personal life he was a member of the Royal Geographic Society and was active in several acting fraternities. He also was one of the founding members of the Screen Actors Guild. The Guild was formed in 1933, in the wake of the formation of the Screen Writers Guild, in reaction to a proposed 50% across-the-board pay cut implemented by the studios. Actors Equity, the theatrical actors union, had tried to organize Hollywood after winning a contract and a closed shop on Broadway after World War I, but it had failed. Screen actors angered over the lack of contracts and the grueling work hours at the Hollywood studios founded the Masquers club in 1925 in a move towards unionization. After studio technicians won a collective bargaining agreement from the studios in 1926, MGM studio chief Louis B. Mayer had the idea of heading off collective bargaining by the \"talent\" branches--the actors, writers and directors--by creating a company union. The Academy of Motion Picture Arts & Sciences was created to serve as an intermediary between the studios and the talent branches and technicians, negotiating contract disputes. Proto-unions, such as the original Screen Writers Guild, folded in 1927 after the creation of the Academy. By the announcement of the across-the-board cut in 1933, two previous rounds of cutbacks and lay-offs caused by the Great Depression had alienated most of the talent in Hollywood and had led to a strike by the technicians which had closed down the studios for a day. Losing faith in the company union that was the Academy, the talent began organizing their own guilds. In addition to the lack of contracts for many actors and the concerns over wages and hours, one of the new Screen Actors Guild's grievances was that Academy membership was by invitation-only. In March 1933, SAG was founded by six actors: Berton Churchill, Charles B. Miller, Grant Mitchell, Ralph Morgan, Alden Gay and Kenneth Thomson. Three months later Mowbray was named to SAG's board of directors. He personally funded SAG when it was first founded. While many high-profile actors, already signed to seven-year contracts, refused initially to join SAG, they began to flock to the new union once the studios initiated an anti-raiding provision in the new National Industrial Relations Act code the industry had implemented after Franklin D. Roosevelt became US President and oversaw the enactment of his New Deal legislation in the first 100 days of his administration. The NRA code the movie industry adopted created a situation for the talent similar to baseball's reserve clause, in which another studio was prevented from offering a contract to an actor, writer or director whose contract had lapsed until their old studio had finished with them and not picked up their option. The NRA code contained a pay ceiling for the talent and technicians, but not for executives. The talent was further enraged when it found out that the Academy, the \"company union,\" had created a committee to investigate the feasibility of long-term contracts. Long-term contracts were the only island of stability in an industry that enhanced its profitability by cutting the wages of its employees and by working them long hours. At a pivotal meeting at the home of Frank Morgan (the future \"Wizard of Oz\" and the brother of first SAG president Ralph Morgan), Eddie Cantor insisted that SAG's response to the new code--a collective bargaining agreement--should be in the interests of all actors, not just the already established ones. In the three weeks after the critical meeting, SAG membership rose from approximately 80 members to more than 4,000. Actors resigned from the Academy en masse to join SAG. Cantor, a friend of President Roosevelt, took the occasion of his being invited to spend the 1933 Thanksgiving holiday with the Roosevelt family to point out the inequities in the new code that SAG found particularly noxious. By executive order, F.D.R. struck them down. Finally, in 1937, after a long period of resistance, the studios recognized SAG as a collective bargaining agent for actors. Recognition of the Screen Writers Guild and the Screen Directors Guild eventually followed. Mowbray's financial support, in the crucial early days of the guild, had helped make a collective bargaining agreement for actors a reality. Alan Mowbray married Lorayne Carpenter in 1927, and they had two children. He died on March 25, 1969, of a heart attack.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMzMyMjc4Ml5BMl5BanBnXkFtZTcwODMwNTMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0610253","name":"Alan Mowbray","idIMDB":"nm0610253"},"actorId":"nm0610253","character":"Pennypepper E. Pennypepper","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nancy Carroll","urlProfile":"http://www.imdb.com/name/nm0007216","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MTQyNDM5OF5BMl5BanBnXkFtZTYwMzEzNTU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1903","placeOfBirth":" New York City, New York, USA","birthName":"Ann Veronica LaHiff","height":"5' 4\" (1.63 m)","bio":"Making her film debut in 1927 after several years on the musical stage and later on Broadway. She became very popular during the advent of sound because of her musical background. This red headed cupid-bow mouthed star entertained movie audiences during the 1930s where her singing and dancing abilities gained her a large following of fans. She was reported to have received more fan mail than any of her Hollywood peers of the same era. She was nominated for an Oscar for The Devil's Holiday (1930) and expanded her acting range from flaming flapper as a ditsy comedienne or as a sensitive heroine.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MTQyNDM5OF5BMl5BanBnXkFtZTYwMzEzNTU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0007216","name":"Nancy Carroll","idIMDB":"nm0007216"},"actorId":"nm0007216","character":"Dorothy Moore","urlCharacter":"http://www.imdb.com/character/ch0495840","main":true},{"actorName":"Eugene Pallette","urlProfile":"http://www.imdb.com/name/nm0657874","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5Nzk5NzA2NF5BMl5BanBnXkFtZTcwNTI1MDQxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1889","placeOfBirth":" Winfield, Kansas, USA","birthName":"Eugene William Pallette","height":"5' 9\" (1.75 m)","bio":"Gargantuan-bellied, frog-voiced character actor who was a staple in forties movies. After World War II his ultra-right-wing political views fuelled his 'bomb' paranoia and he bought a property in Oregon which he turned into a well-stocked compound in case the Russians attacked. Many of his old Hollywood friends, including Clark Gable, visited him there (some came to hunt and fish) but the property was later sold.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5Nzk5NzA2NF5BMl5BanBnXkFtZTcwNTI1MDQxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0657874","name":"Eugene Pallette","idIMDB":"nm0657874"},"actorId":"nm0657874","character":"Mr. Stevens - Editor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Claude Gillingwater","urlProfile":"http://www.imdb.com/name/nm0319257","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3M2FjZjUtZjEyYS00YmJlLTkxYzYtMjQ0OTBjZDBiMDEzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 August 1870","placeOfBirth":" Louisiana, Missouri, USA","birthName":"Claude Benton Gillingwater","height":"6' 2\" (1.88 m)","bio":"A man so disagreeable on celluloid, Claude Gillingwater's characters seemed to subsist on a steady diet of persimmons. Fondly recalled as the cranky old skinflint whose seemingly cold heart could only be warmed by the actions of a cute little tyke, the tall and rangy Gillingwater invariably played much older than he was. He, with the omnipresent bushy brows, crop of silver hair and perpetually sour puss, had a much more versatile career than perhaps realized -- on both stage and in film. Most assuredly, this caustic screen image he perfected belied a softer, gentler off-screen demeanor for he was a kind and sympathetic gent and devoted husband to wife Carlyn Stiletz (or Stellith). Their only child, Claude Gillingwater Jr., briefly became an actor himself. Sadly, Gillingwater Sr.'s thriving character career ended on a grim and tragic note in 1939. Born Claude Benton Gillingwater on August 2, 1879, in the small Mississippi River town of Louisiana, Missouri, he was the son of James E. and Lucy (Hunter) Gillingwater and attended St. Louis High School. For a time he was an apprentice to a lawyer uncle, but he eventually left home and joined a traveling stock company. Gradually building up his nascent career on the stage, he was discovered by theater impresario David Belasco. Gillingwater proceeded strongly on the Broadway stage beginning with a melodramatic role in \"A Young Wife\" (1899). This led to a well-received series of parts for the next full decade in New York ranging from high drama (\"Madame Butterfly\", \"Du Barry\") to operettas (\"Mlle. Modiste,\" \"The Old Town,\" \"The Girl in the Train\") to original works (\"The Only Son,\" \"The New Secretary\"). 1918 was a banner year for Gillingwater for he not only appeared in the hit Broadway show \"Three Wise Fools,\" but also made his silent film debut in support of Gladys Leslie and Richard Barthelmess in Wild Primrose (1918). This disagreeable typecast began to assert itself with his second movie three years later as the grumbling, icy-souled Earl of Dorincourt whose grandson helps reveal his tenderer side in Little Lord Fauntleroy (1921), which starred America's sweetheart Mary Pickford in a dual role. A rash of leading/co-starring roles came with the immediate impact of this single success, including Crinoline and Romance (1923) with Viola Dana, Alice Adams (1923) with Florence Vidor, Dulcy (1923) with Constance Talmadge, and Three Wise Fools (1923) with Eleanor Boardman. The last film mentioned gave him the opportunity to repeat his 1918 Broadway triumph. More than not, however, he was supporting the Hollywood elite such as kid star Jackie Coogan in My Boy (1921), Richard Dix in Fools First (1922) and The Christian (1923), 'Leonore Ulric' in Tiger Rose (1923), Alla Nazimova in Madonna of the Streets (1924), Ronald Colman in A Thief in Paradise (1925), Anna Q. Nilsson in Winds of Chance (1925), and Colleen Moore in Oh Kay! (1928). Sometimes his character's names reflected his curt, stern image -- names such as John P. Grout, Lord Storm and Simon Peck. A founding member of the Academy of Motion Pictures Arts and Sciences (1927), he advanced into the talking era of films with equal verve, although his roles were, more often than not, token grouches. Some of his more distinctive parts came with the films A Tale of Two Cities (1935) (as Jarvis Lorry), Mississippi (1935) and The Prisoner of Shark Island (1936). He proved to be an excellent crabapple foil for 20th Century-Fox moppet star Shirley Temple in Poor Little Rich Girl (1936) and subsequently appeared in two more of her pictures - Just Around the Corner (1938) and Little Miss Broadway (1938). Gillingwater played a few more curmudgeons in his last years but this period of time was to be marked by acute sadness and physical/mental hardship. A serious accident on the movie set of the picture Florida Special (1936) (he fell from a platform and injured his back) damaged his health and threatened his career, and the death of his long-time wife Carlyn left him irrevocably depressed. Fearing the possibility of becoming an invalid and wishing not to become a serious burden to anyone, the 69-year-old actor committed suicide at his Beverly Hills home with a self-inflicted gunshot to the head on November 1, 1939. Gillingwater left a fine Hollywood legacy and the fun of some of his old films is watching his vinegar turn to sugar.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3M2FjZjUtZjEyYS00YmJlLTkxYzYtMjQ0OTBjZDBiMDEzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0319257","name":"Claude Gillingwater","idIMDB":"nm0319257"},"actorId":"nm0319257","character":"Cyrus Butterfield","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arthur Lake","urlProfile":"http://www.imdb.com/name/nm0482121","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGJlZTViYmItNjkyMi00NWZjLTlhMzMtZmQwMThkMzY5ZDdkXkEyXkFqcGdeQXVyMjU4NzU2OTA@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 April 1906","placeOfBirth":" Corbin, Kentucky, USA","birthName":"Arthur William Silverlake","height":"6' (1.83 m)","bio":"His parents were circus acrobats and he became part of their act. When they changed to vaudeville and wound up in California, he got a job in the movies. The founder of Universal Pictures, Carl Laemmle changed his name to Lake. In silent films he played somewhat dimwitted youngsters, The long-running part of Dagwood in the \"Blondie\" series pretty much continued the the pattern into adult life. He and Penny Singleton also appeared in a half-hour \"Blondie\" radio series which ran from 1939 to 1950, airing on CBS, ABC and finally on NBC. The program's stylized opening line, delivered by Bill Goodwin became famous: \"Uh-uh-uh. Don't touch that dial. It's time for ...[Lake:] Blond-dee\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGJlZTViYmItNjkyMi00NWZjLTlhMzMtZmQwMThkMzY5ZDdkXkEyXkFqcGdeQXVyMjU4NzU2OTA@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0482121","name":"Arthur Lake","idIMDB":"nm0482121"},"actorId":"nm0482121","character":"Flash Fisher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Etienne Girardot","urlProfile":"http://www.imdb.com/name/nm0320761","urlPhoto":"","biography":{"dateOfBirth":"22 February 1856","placeOfBirth":" London, England, UK","bio":"Etienne Girardot was born on February 22, 1856 in London, England. He was an actor, known for Twentieth Century (1934), The Hunchback of Notre Dame (1939) and The Story of Vernon and Irene Castle (1939). He was married to Dr. Violetta Shelton. He died on November 10, 1939 in Hollywood, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0320761","name":"Etienne Girardot","idIMDB":"nm0320761"},"actorId":"nm0320761","character":"Hinkley - Secretary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Armstrong","urlProfile":"http://www.imdb.com/name/nm0035877","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1OTg1MTAyM15BMl5BanBnXkFtZTcwNjQ4OTUwNA@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 November 1890","placeOfBirth":" Saginaw, Michigan, USA","birthName":"Robert William Armstrong","height":"5' 10\" (1.78 m)","bio":"Robert Armstrong is familiar to old-movie buffs for his case-hardened, rapid-fire delivery in such roles as fast-talking promoters, managers, FBI agents, street cops, detectives and other such characters in scores of films--over 160--many of them at Warner Brothers, where he was part of the so-called \"Warner Brothers Stock Company\" that consisted of such players as James Cagney, Pat O'Brien, Frank McHugh, Alan Hale and Humphrey Bogart, among others. Although he could easily be taken for having grown up in a tough area of Brooklyn or the Bronx, he was actually from the Midwest. He was born in Saginaw, Michigan, in 1890, and his father owned a small and profitable flotilla of boats for use on Lake Michigan. Hearing the Siren call of the gold fields in late 19th-century Alaska, however, he packed up the family and headed west. A typical staging place to start north was in Washington state, and the family settled in Seattle. Rpbert spent a short hitch in the infantry during World War I. Afterwards he decided to go into law and started to study at the University of Washington. However, it wasn't long before that he decided he had a gift for acting and--perhaps influenced by his uncle, playwright and producer Paul Armstrong--decided to follow that path. He hooked up with future Hollywood character actor James Gleason, known to everyone as \"Jimmy\", who worked for a variety of playhouses in California and Oregon and who was heir to his parents' stock company, which toured across the US. Armstrong joined Gleason's company and returned with them to New York. He started from the bottom up, learning the craft of acting. After moving on to leading roles, he received the prime part in Gleason's own play \"Is Zat So?\" (1925-1926), a particularly successful play among several he had written (he also directed and produced plays on Broadway into 1928). Hollywood scouts were watching, and Armstrong found himself with a film contract. He appeared in approximately 10 films in 1928 alone, and after the first five he was able, with the advent of sound, to give voice to the take-charge, mile-a-minute, clenched-teeth delivery that would make him one of the busiest character men in Hollywood--and right alongside him in several of his early 1930s features was his old friend and boss Jimmy Gleason. It was in 1932 that Armstrong became acquainted with an ambitious and adventurous pair of Hollywood filmmakers. Both were World War I fliers, big-game hunters and animal trappers, and partners in high adventure documentaries, Merian C. Cooper and Ernest B. Schoedsack had found a friend in rising producer David O. Selznick, who brought them on board at RKO, with Cooper as production idea man. Schoedsack was the technical side of the pair, knowledgeable about the actual physical and technical side of filmmaking, , and became the actual director of their projects, with Cooper as an associate producer and sometime co-director. They turned out what would be the first of a string of horror-tinged adventure movies, The Most Dangerous Game (1932), with Armstrong having a part in it. He got in his usual wisecrack lines but from a less dimensioned character who had an early demise--the film centered on Joel McCrea and still young silent screen veteran Fay Wray. Cooper saw much of himself in Armstrong's general personality and wanted him for a film that he had been wanting to make for quite a few years, an adventure yarn dealing with the stories he had heard during his years making films in jungles all over the world of giant, vicious apes. The resulting film, King Kong (1933), would put Armstrong at stage center as big-time promoter Carl Denham (very much Cooper himself). The film also began co-star Fay Wray on the road to stardom. With Copper and Schoedsack co-directing and the legendary Willis H. O'Brien heading up a visual effects team supporting his for-the-time astounding animated miniature sequences, the film was a treasure trove for RKO, bringing newfound respect for a studio known mostly for its \"B\" action films and westerns. It was Armstrong's defining moment and set the stage for the plethora of leading man and second lead roles he would play through the 1930s. A sequel, The Son of Kong (1933), followed almost immediately with the same production team and, though not achieving the critical or box-office acclaim as its predecessor, showcased another Armstrong strength--a great sense of comedic timing that had been evident, but not really traded upon, in previous films. The Cooper/Schoedsack team got in one more for 1933, with Armstrong as an uncommon--for him--romantic lead in Blind Adventure (1933), a fast-paced but but often uneven adventure yarn. All the studios wanted him, and what followed was a flood of usually good, crowd-pleasing roles, although still in \"B\" pictures. Among the better ones were Palooka (1934) and 'G' Men (1935), with Armstrong playing a hard-nosed FBI agent who is mentor and partner to a young James Cagney. With a full menu of adventure yarns and colorful cop and military roles, at the end of the decade Armstrong even played one of America's great folk heroes - Jim Bowie - in Man of Conquest (1939), this time at Republic Pictures. Armstrong got more of the same in the decade of World War II--although with age he started to slip down the cast list--with some variety, playing a Nazi agent in the spoof My Favorite Spy (1942) and--in somewhat ridiculous \"Japanese\" makeup--as a Japanese secret-police colonel (named Tojo) with former co-star James Cagney in the escapist romp Blood on the Sun (1945). Finally, Cooper--gorillas still on his mind--came calling for Armstrong again for his Mighty Joe Young (1949), which he made about midway in his association with partner John Ford in their Argosy Pictures venture under the wing of RKO. Armstrong was again a reincarnation of Carl Denham as Max O'Hara, a fast-talking promoter looking for a sensation in \"Darkest Africa\". The Ford touch is perhaps seen in the cowboys who go along with young Ben Johnson as romantic lead to enthusiastic--to say the least--Terry Moore with her pet gorilla Joe (about half as big as King Kong but definitely no ordinary gorilla). It is a great little movie, with more light-hearted tone than \"Kong\" and a red-tinted fire scene recalling the silents. It was a Saturday matinée favorite for at least a decade afterward (this writer enjoyed it as his first movie theater adventure as a small child). Armstrong increasingly went to the small screen through the 1950s. He was a familiar face on most of the TV playhouse programs of the period and did many of the series oaters and crime shows of the period. He received a great send-up as a guest on Red Skelton's variety show when the oft giggling host asked him, \"Say, did you ever get that monkey off that building?\" Armstrong liked keeping busy and helping friends. One of the latter was Cooper--still promoting as his alter ego Carl Denham in his old age. The two passed away within 24 hours of one another in April of 1973.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1OTg1MTAyM15BMl5BanBnXkFtZTcwNjQ4OTUwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0035877","name":"Robert Armstrong","idIMDB":"nm0035877"},"actorId":"nm0035877","character":"Detective O'Brien","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Irving Bacon","urlProfile":"http://www.imdb.com/name/nm0045784","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWYwNjcyNzItYjAyMS00OWMzLTkzM2QtYjU0MmJmN2M1YzgwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1893","placeOfBirth":" St. Joseph, Missouri, USA","birthName":"Irving Earnest Peters","height":"6' (1.83 m)","bio":"A minor character actor who appeared in literally hundreds of films, actor Irving Bacon could always be counted on for expressing bug-eyed bewilderment or cautious frustration in small-town settings with his revolving door of friendly, servile parts - mailmen, milkmen, clerks, chauffeurs, cab drivers, bartenders, soda jerks, carnival operators, handymen and docs. Born September 6, 1893 in the heart of the Midwest (St. Joseph, Missouri), he was the son of Millar and Myrtle (Vane) Bacon. Irving first found work in silent comedy shorts at Keystone Studios usually playing older than he was and, for a time, was a utility player for Mack Sennett in such slapstick as A Favorite Fool (1915). Irving made an easy adjustment when sound entered the pictures and after appearing in the Karl Dane and George K. Arthur two-reel comedy shorts such as Knights Before Christmas (1930), began to show up in feature-length films. He played higher-ups on occasion, such as the Secretary of the Navy in Million Dollar Legs (1932), police inspector in House of Mystery (1934), mayor in Room for One More (1952), and judge in Ambush at Cimarron Pass (1958), but those were exceptions to the rule. Blending in with the town crowd was what Irving was accustomed to and, over the years, he would be glimpsed in some of Hollywood's most beloved classics such as Capra's Mr. Deeds Goes to Town (1936), San Francisco (1936), You Can't Take It with You (1938) and A Star Is Born (1954). Trivia nuts will fondly recall his beleaguered postman in the Blondie (1938) film series that ran over a decade. Irving could also be spotted on popular '50s and '60s TV programs such as the westerns Laramie (1959) and Wagon Train (1957), and \"comedies December Bride (1954) and The Real McCoys (1957). He can still be seen in a couple of old codger roles on I Love Lucy (1951). One was as a marriage license proprietor and the other as Vivian Vance's doting dad from Albuquerque, to whom she paid a visit on her way to Hollywood with the Ricardos. Irving died on February 5, 1965, having clocked in over 400 features.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWYwNjcyNzItYjAyMS00OWMzLTkzM2QtYjU0MmJmN2M1YzgwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0045784","name":"Irving Bacon","idIMDB":"nm0045784"},"actorId":"nm0045784","character":"Mr. Dobbs","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Irving Pichel","urlProfile":"http://www.imdb.com/name/nm0681635","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMDk1MTAxMF5BMl5BanBnXkFtZTgwOTUxMjMyMjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 June 1891","placeOfBirth":" Pittsburgh, Pennsylvania, USA","height":"6' (1.83 m)","bio":"Irving Pichel was born on June 24, 1891 in Pittsburgh, Pennsylvania, USA. He was an actor and director, known for The Most Dangerous Game (1932), Martin Luther (1953) and Destination Moon (1950). He was married to Violette Wilson. He died on July 13, 1954 in Hollywood, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMDk1MTAxMF5BMl5BanBnXkFtZTgwOTUxMjMyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0681635","name":"Irving Pichel","idIMDB":"nm0681635"},"actorId":"nm0681635","character":"Mr. Gorman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Syd Saylor","urlProfile":"http://www.imdb.com/name/nm0768514","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ5YzA1MTUtMWExMi00MDJmLTllOTUtOTM1YzhjOGUyYWI1XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 March 1895","placeOfBirth":" Chicago, Illinois, USA","birthName":"Leo Sailor","height":"5' 10½\" (1.79 m)","bio":"Leo Sailor, a.k.a. Syd Saylor, was born into a very notable family. His father, George Sailor, was a renowned engineer, and was often called out to various locations for consultation and evaluation. In 1906 he was called to San Francisco on a job, and he had no sooner checked into his hotel than the city was devastated by the notorious 1906 earthquake. Mr. Sailor was never seen again, and was presumed to have been one of many to have died in the quake. That left Syd and his brother without a father, and to remedy that situation his mother's brother Ed moved in with the family. Syd decided to follow his uncle Ed's advice; he studied hard and had the help of his uncle as a tutor. Syd soon joined several local actors groups. While appearing in a variety of plays put on by the troupe, Syd discovered that he had a talent for making people laugh, and his other uncle--a captain in the Los Angeles Sheriff's Department who was a former member of Mack Sennett's comedy troupe The Keystone Kops--encouraged him to go to Los Angeles to break into the film industry. Syd did just that, and his uncle used the connections he had in the film industry to get Syd's foot in the door. Syd became a prolific character actor, recognizable by his bulging eyes, stuttering speech and a protruding Adam's apple that bobbed up and down like a pogo stick. He appeared in everything from comedies (in the 1920s he had his own series of two-reel shorts) to westerns, usually as the hero's sidekick. He wasn't just a one-note comic, though. He had a small but touching role as a lonely patient in a psychiatric hospital in The Snake Pit (1948), who goes to the facility's annual dance and desperately and sadly looks for a woman to dance with him. He appeared in more than 170 films, and died of a heart attack in Hollywood in 1962.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ5YzA1MTUtMWExMi00MDJmLTllOTUtOTM1YzhjOGUyYWI1XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0768514","name":"Syd Saylor","idIMDB":"nm0768514"},"actorId":"nm0768514","character":"Robinson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"J. Farrell MacDonald","urlProfile":"http://www.imdb.com/name/nm0531759","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjVmOWRhZmYtZGQzNS00MTBiLTg5MTEtZGVjMjBhNzY3ZTRjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 April 1875","placeOfBirth":" Waterbury, Connecticut, USA","birthName":"Joseph Farrell MacDonald","height":"5' 10\" (1.78 m)","bio":"J. Farrell MacDonald was born on April 14, 1875 in Waterbury, Connecticut, USA as Joseph Farrell MacDonald. He was an actor and director, known for Sunrise (1927), Meet John Doe (1941) and My Darling Clementine (1946). He was married to Edith Bostwick. He died on August 2, 1952 in Hollywood, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjVmOWRhZmYtZGQzNS00MTBiLTg5MTEtZGVjMjBhNzY3ZTRjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0531759","name":"J. Farrell MacDonald","idIMDB":"nm0531759"},"actorId":"nm0531759","character":"Officer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0030856","urlIMDB":"http://www.imdb.com/title/tt0030856","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":null,"copyrightHolder":"Copyright MCMXXXVIII by Hal Roach Studios, Inc. (on print); © Hal Roach Studios, Inc.; 6 October 1938; LP8333 (in copyright registry)"},"technical":{"runtime":["1 hr 23 min (83 min)"],"soundMix":["Mono (Western Electric Mirrophonic Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["(9 reels)","2,345 m (8 reels) (UK)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.7","filmingLocations":[{"location":"Hal Roach Studios - 8822 Washington Blvd., Culver City, California, USA"}],"rated":"PASSED","awards":[{"award":"Academy Awards, USA 1939","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Music, Scoring","names":[{"name":"Marvin Hatley","id":"nm0368943","role":null}]}]}]}],"votes":"401","type":"Movie","companyCreditsSimple":[{"idCompany":"co0075561","name":"Hal Roach Studios"}],"keywords":{"keywords":["reporter","grandfather","yacht","wristwatch","vibrator","telegram","taxi","swedish american","secretary","seaplane","sea captain","saleswoman","roommate","punched in the nose","police","photographer","newspaper editor","musical chairs","minister","maid","island","impersonation","ice skating","floorwalker","finger crossing","drunkenness","detective","department store","deception","chiropractor","boat","banker","runaway heiress"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:29:34"}}