{"data":{"movies":[{"title":"Five Star Final","originalTitle":"","year":"1931","releaseDate":"19310926","directors":[{"name":"Mervyn LeRoy","id":"nm0503777"}],"writers":[{"name":"Louis Weitzenkorn","id":"nm0919380"},{"name":"Byron Morgan","id":"nm0604526"}],"runtime":"89 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODIyMDAzMl5BMl5BanBnXkFtZTcwMTI2NTk5Mw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama"],"plot":"Hinchcliffe, the ruthless publisher of a sleazy New York tabloid, is concerned that the ethical journalistic policies of City Editor Randall have caused a drop in circulation. He pressures the newsman to run more sensational stories including resurrecting the twenty year old Vorhees Murder Case. Although the perpetrator's actions were ultimately judged justifiable, and she has been subsequently living an exemplary life in anonymity, Hunchcliffe insists Randall revisit the story. Randall assigns Isopod, an alcoholic degenerate, to dig up anything lurid that he find. The unprincipled reporter fraudulently insinuates himself into the Vorhees' home masquerading as a minister and gets the expose he sought. Yellow journalism triumphs, and a decent woman's name gets dragged through the mud again... with tragic consequences.","simplePlot":"The City Editor of a sleazy tabloid goes against his own journalistic ethics to resurrect a twenty year old murder case... with tragic results.","actors":[{"actorName":"Edward G. Robinson","urlProfile":"http://www.imdb.com/name/nm0000064","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzcwMzU5Nl5BMl5BanBnXkFtZTYwNTkwMjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1893","placeOfBirth":" Bucharest, Romania","birthName":"Emmanuel Goldenberg","height":"5' 7\" (1.7 m)","bio":"Edward G. Robinson arrived in the United States at age ten, and his family moved into New York's Lower East Side. He took up acting while attending City College, abandoning plans to become a rabbi or lawyer. The American Academy of Dramatic Arts awarded him a scholarship, and he began work in stock, with his new name, in 1913. Broadway was two years later; he worked steadily there for 15 years. His work included \"The Kibitzer\", a comedy he co-wrote with Jo Swerling. His film debut was a small supporting part in the silent The Bright Shawl (1923), but it was with the coming of sound that he hit his stride. His stellar performance as snarling, murderous thug Rico Bandello in Little Caesar (1931)--all the more impressive since in real life Robinson was a sophisticated, cultured man with a passion for fine art--set the standard for movie gangsters, both for himself in many later films and for the industry. He portrayed the title character in several biographical works, such as Dr. Ehrlich's Magic Bullet (1940) and A Dispatch from Reuter's (1940). Psychological dramas included Flesh and Fantasy (1943), Double Indemnity (1944), The Woman in the Window (1944)and Scarlet Street (1945). Another notable gangster role was in Key Largo (1948). He was \"absolved\" of allegations of Communist affiliation after testifying as a friendly witness for the House Un-American Activities Committee during the McCarthy hysteria of the early 1950s. In 1956 he had to sell off his extensive art collection in a divorce settlement and also had to deal with a psychologically troubled son. In 1956 he returned to Broadway in \"Middle of the Night\". In 1973 he was awarded a special, posthumous Oscar for lifetime achievement.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzcwMzU5Nl5BMl5BanBnXkFtZTYwNTkwMjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000064","name":"Edward G. Robinson","nicknames":["Eddie","Manny"],"idIMDB":"nm0000064"},"actorId":"nm0000064","character":"Randall","urlCharacter":"http://www.imdb.com/character/ch0484285","main":true},{"actorName":"Marian Marsh","urlProfile":"http://www.imdb.com/name/nm0550620","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGNhYTY1OGItODg4NS00YjQyLWEwNzQtNGI1M2I3M2FlZWZmXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 October 1913","placeOfBirth":" Trinidad, British West Indies [now Trinidad and Tobago]","birthName":"Violet Ethelred Krauth","height":"5' 2\" (1.57 m)","bio":"One of the early sound era's most attractive young leading ladies, doll-faced Marian Marsh enjoyed a short yet significant film career as the star of several memorable 1930s melodramas opposite some of the cinema's best, most charismatic lead actors. Her youthful, wide-eyed innocence combined with an innate delicacy to make a storybook heroine who was the perfect counterbalance to the licentious characters who often menaced her on film. So successful was she as a damsel in distress that she quickly became typecast, which impeded her development as an actress and helped bring her film career to a premature end. The youngest of four children of a German chocolate manufacturer and his French-English wife, the future star was born Violet Ethelred Krauth on October 17, 1913, on the island of Trinidad, British West Indies. When World War I ruined his business, Mr. Krauth moved the family to Massachusetts, where his children developed an appreciation for the arts and theater. During the mid 1920s, Violet's older sister Jean became a student at Paramount's Astoria studio and later a Paramount contract player. When Jean signed a contract with FBO Pictures in Hollywood, the Krauth family moved to the West Coast, where Violet attended La Conte Junior High School and later Hollywood High. In 1928 Jean helped her strikingly attractive golden-haired sister secure a screen test with Pathe Studios, which promptly signed her but dropped her after a short film appearance. After another short pact with Samuel Goldwyn, Violet, now known as Marilyn Morgan, opted to study acting and voice with 'Nance O'Neil'. In 1929 Warners signed the 16-year-old, who changed her name once again, this time to Marian Marsh. Despite appearances in 30 short films starring James Gleason and a small part in Hell's Angels (1930), Marian's career seemed headed to oblivion when she won the role of her life in Svengali (1931), Warners' film remake of George Du Maurier's 1894 novel \"Trilby\"; the tragic tale of an artists' model who becomes a great singing diva under the hypnotic tutelage of the malevolent Svengali (charismatically portrayed by John Barrymore). According to Miss Marsh, she was tested for the plum role several times before being selected by Barrymore, apparently because she resembled his wife, Dolores Costello. The immense critical and financial success of the film combined with young Miss Marsh's rave reviews to raise her Hollywood stock. Selected as one of the WAMPAS Baby Stars of 1931, she became one of filmdom's top up-and-coming actresses. Hoping to exploit her growing popularity and capitalize on her ability to project warmth, sincerity and inner strength on screen, Warners cast her as virginal heroines in a series of films. Of special note were her compelling performances as the daughter of a woman driven to suicide by amoral newspaper editor Edward G. Robinson in Five Star Final (1931), a ballerina menaced by evil clubfooted puppeteer John Barrymore in The Mad Genius (1931), a sexy teen smitten with mature William Powell in The Road to Singapore (1931), and the fast talking Cinderella secretary of skirt-chasing financier Warren William in Beauty and the Boss (1932). Just when it appeared as if Marian was on the verge of superstardom, she seemed to fall out of favor at Warners. After the critical failure of the much ballyhooed drama Under Eighteen (1931), a disappointed, exhausted Marian rebelled against the studio, which retaliated by not picking up her option. Her career never fully recovered. After she departed Warners, the 19-year-old freelance actress compounded her problems and further diminished her reputation by accepting film work overseas and at minor studios. Although her performances in such films as The Sport Parade (1932), the British comedy Over the Garden Wall (1934) and A Girl of the Limberlost (1934) were admirable, low-budget production values and other assorted problems doomed the projects. In 1935 Marian signed a two-year pact with Columbia Pictures and tried with some success to resurrect her foundering career. Of the eight Columbia pictures she made during the period 1935-36, four were memorable. She was excellent, if typecast, as a young girl mixed up with crooks and gangsters in the entertaining melodrama Counterfeit (1936), as the bespectacled daughter of a retailer in love with a shyster salesman in the charming B comedy Come Closer, Folks (1936), as an accursed young woman forced to marry murderer Boris Karloff in the fondly remembered suspense classic The Black Room (1935), and notably as the beautiful prostitute Sonya in Josef von Sternberg's controversial film version of Fyodor Dostoevsky's timeless novel Crime and Punishment (1935) starring Peter Lorre. Her performance in the latter is without a doubt one of the best, if not the best, of her career. When her Columbia contract expired in 1936, Marian once again squandered her momentum and talent by appearing in routine second features. From 1937 to 1938, she made seven mostly forgettable films, the best of which was Republic's B drama Youth on Parole (1937), in which Marian was poignant as a girl suffering the rejection and prejudice associated with being a parolee. In March 1938 Miss Marsh, long one of Hollywood's most eligible bachelorettes, wed stockbroker Albert Scott, the former husband of actress Colleen Moore. After the marriage she made only five more feature films. \"I loved acting,\" she told author Richard Lamparski, \"but I had become a professional because we needed the money. In 1938 I married a businessman and just drifted away from acting.\" PRC's money-starved comedy House of Errors (1942) is her last film to date. In the late 1950s Marian, was briefly lured back to acting, appearing in an episode of the popular John Forsythe sitcom \"Bachelor Father\" and an episode of Schlitz Playhouse (1951) before retiring in 1959. One year later she married aviation pioneer and wealthy entrepreneur Clifford Henderson and moved to Palm Desert, California, a town Henderson founded in the 1940s. In the 1960s Marian founded Desert Beautiful, a non-profit, all-volunteer conservation organization to promote environmental and beautification programs. \"We planted palm trees along the West Coast and were the first to plant palms in the lower valley [Coachella] to Palm Springs. If you want to leave something behind, plant a tree!\" she told author Dan Van Neste in a 1998 interview. After Cliff Henderson died in 1984, Marian continued to live in the Henderson ranch house continuing her charitable work. Miss Marsh remained in Palm Desert through 2005 and died in 2006. Near her end, Miss March was less active but still committed to her beloved Desert Beautiful. She retains fond memories of her filmmaking years and expresses appreciation for the continuing interest in her career. When asked how she'd like to be remembered in 1998, the modest, ever-gracious star simply replied, \"For doing my best. I think anything I've ever tried, I tried to do my best. In the end, that's all you can do!\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGNhYTY1OGItODg4NS00YjQyLWEwNzQtNGI1M2I3M2FlZWZmXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0550620","name":"Marian Marsh","idIMDB":"nm0550620"},"actorId":"nm0550620","character":"Jenny Townsend","urlCharacter":"http://www.imdb.com/character/ch0140097","main":true},{"actorName":"H.B. Warner","urlProfile":"http://www.imdb.com/name/nm0912478","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1Mjc2NjgwMl5BMl5BanBnXkFtZTcwNTM4NDYwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1875","placeOfBirth":" London, England, UK","birthName":"Harry Byron Warner","height":"6' 0½\" (1.84 m)","bio":"Henry Byron Warner was the definitive cinematic Jesus Christ in Cecil B. DeMille's The King of Kings (1927). He was born into a prominent theatrical family on October 26, 1875 in London. His father was Charles Warner, and his grandfather was James Warner, both prominent English actors. He replaced J.B. Warner as Jesus in The King of Kings (1927) when J.B. died of tuberculosis at age 29. (J.B. was not Henry's brother. J.B. had taken the professional last name \"Warner\" because Henry's family took him in.) Henry Warner's family wanted him to become a doctor, and he graduated from London University but eventually gave up his medical studies. The theater was in his blood, and he studied acting in Paris and Italy before joining his father's stock company, making his debut in the English production of \"Drink.\" It was from his father that he honed his craft. Warner made it to America in the early 1900s, after touring the British Empire. Billed as Harry Warner, he made his Broadway debut in the American colonial drama \"Audrey\" at Hoyt's Theatre on November 24, 1902, starring James O'Neill, the father of playwright Eugene O'Neill. He was billed as H.B. Warner in his next appearance on Broadway, in the 1906 comedy \"Nurse Marjorie.\" He appeared in 13 more Broadway productions in his career, from the twin-bill of \"Susan in Search of a Husband\" & \"A Tenement Tragedy\" (also 1906) to \"Silence\" in 1925. He moved into motion pictures, making his debut in the Mutual short Harp of Tara (1914). Also in 1914, he appeared in a film written by Cecil B. DeMille for Famous Players Lasky, The Ghost Breaker (1914), in which he had played on Broadway the year before. Warner became a leading man and a star in silent pictures, reaching the zenith of his career playing Jesus in DeMille's The King of Kings (1927). His excellent performance was actually enhanced by the silent screen, allowing the audience to imagine how Jesus would sound. Warner could be extremely moving in silent pictures, notably in the melodrama Sorrell and Son (1927) as a war veteran father who sacrifices all for his son. When talkies arrived, he became a busy supporting player. A favorite of Frank Capra, appeared in Mr. Deeds Goes to Town (1936). Cast again by Capra, he was nominated for Best Supporting Actor in Lost Horizon (1937). He also appeared in You Can't Take It with You (1938), and Mr. Smith Goes to Washington (1939). Other major talkies included The Devil and Daniel Webster (1941) and Topper Returns (1941). Other than Jesus, the role he is best remembered role for today is in It's a Wonderful Life (1946), in which he played Mr. Gower, the druggist who is saved from committing a lethal medication error by the young George Bailey (the James Stewart character as a child). H.B. Warner appeared in Sunset Boulevard (1950) as himself. His last credited role was as Amminadab in DeMille's The Ten Commandments (1956), a remake of the earlier silent The Ten Commandments (1923). He last role was an uncredited bit part in Darby's Rangers (1958). Henry Warner died on December 21, 1958 in Woodland Hills, California. He was 83 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1Mjc2NjgwMl5BMl5BanBnXkFtZTcwNTM4NDYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0912478","name":"H.B. Warner","idIMDB":"nm0912478"},"actorId":"nm0912478","character":"Michael Townsend","urlCharacter":"http://www.imdb.com/character/ch0140098","main":true},{"actorName":"Anthony Bushell","urlProfile":"http://www.imdb.com/name/nm0124236","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDBiNDIwYzctYzYwOS00NGE2LTk3YTktNjEwNzA0NDllOTNkXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 May 1904","placeOfBirth":" Westerham, Kent, England, UK","birthName":"Anthony Arnatt Bushell","height":"6' (1.83 m)","bio":"Anthony Bushell was born on May 19, 1904 in Westerham, Kent, England as Anthony Arnatt Bushell. He was an actor and producer, known for A Night to Remember (1958), The Scarlet Pimpernel (1934) and Pursuit of the Graf Spee (1956). He was married to Zelma O'Neal and Anne. He died on April 2, 1997 in Oxford, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDBiNDIwYzctYzYwOS00NGE2LTk3YTktNjEwNzA0NDllOTNkXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0124236","name":"Anthony Bushell","idIMDB":"nm0124236"},"actorId":"nm0124236","character":"Phillip Weeks","urlCharacter":"http://www.imdb.com/character/ch0140099","main":true},{"actorName":"George E. Stone","urlProfile":"http://www.imdb.com/name/nm0831889","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA5NTQyMjg2Ml5BMl5BanBnXkFtZTcwMDQ5NzkxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 May 1903","placeOfBirth":" Lódz, Poland, Russian Empire [now Lódz, Lódzkie, Poland]","birthName":"Gerschon Lichtenstein","height":"5' 3½\" (1.61 m)","bio":"A minor prototype of the \"Runyon-esque\" character for more than three decades, Polish-born actor George E. Stone (né George Stein) was in actuality a close friend of writer Damon Runyon and would play a host of colorful \"dees, dem and dos\" cronies throughout the 1920s, '30s, and '40s. With great names such as Johnnie the Shiek, Boots Burnett, Ice Box Hamilton, Wires Kagel, Ropes McGonigle, Society Max, and Toothpick Charlie, Stone delighted audiences in scores of crimers for decades. A vaudeville and Broadway hoofer in the interim, the runt-sized Stone (5' 3\") finally scored in his first \"grownup\" part as the Sewer Rat in the silent drama 7th Heaven (1927) starring the once-popular romantic pair Charles Farrell and (Academy Award winner) Janet Gaynor. As \"Georgie\" sounded too child-like, he began billing himself as \"George E. Stone.\" From there he was featured in a number of \"tough guy\" potboilers, particularly for Warner Bros. So typed was he as a henchman or thug, that he found few films outside the genre. His gunsels often possessed a yellow streak and could be both broadly comic or threatening in nature, with more than a few of them ending up on a morgue slab before film's end, including his Earl Williams on The Front Page (1931) and Otero in the classic gangster flick Little Caesar (1931). Stone's most popular role of the 1940s was as The Runt in the Boston Blackie film series which ran from 1941 to 1948 and starred Chester Morris. Suffering from failing eyesight in later years, he was virtually blind by the late 1950s but, thanks to friends, managed to secure sporadic film and TV work. From 1958 on, Stone could be glimpsed in a recurring role on the popular courtroom series Perry Mason (1957) as a court clerk. Married to second wife Marjorie Ramey in 1946, he died following a stroke in 1967 in Woodland Hills, California, and was survived by two sisters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA5NTQyMjg2Ml5BMl5BanBnXkFtZTcwMDQ5NzkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0831889","name":"George E. Stone","idIMDB":"nm0831889"},"actorId":"nm0831889","character":"Ziggie Feinstein","urlCharacter":"http://www.imdb.com/character/ch0140100","main":true},{"actorName":"Frances Starr","urlProfile":"http://www.imdb.com/name/nm0823503","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWI5ZjRhODgtNWExZi00YWRkLTliZDItZGY5Mjk5MmEyNGFiL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 June 1886","placeOfBirth":" Albany, New York, USA","bio":"Frances Starr was born on June 6, 1886 in Albany, New York, USA. She was an actress, known for The Star Witness (1931), Five Star Final (1931) and This Reckless Age (1932). She was married to Ronald G. Donaldson (banker), Haskell Coffin and Emil C. Wetten (banker). She died on June 11, 1973 in New York City, New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWI5ZjRhODgtNWExZi00YWRkLTliZDItZGY5Mjk5MmEyNGFiL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0823503","name":"Frances Starr","idIMDB":"nm0823503"},"actorId":"nm0823503","character":"Nancy 'Voorhees' Townsend","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ona Munson","urlProfile":"http://www.imdb.com/name/nm0613262","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NDY5NTQ5OF5BMl5BanBnXkFtZTYwMTgwNDg4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1903","placeOfBirth":" Portland, Oregon, USA","birthName":"Owena Elizabeth Wolcott","height":"5' 2\" (1.57 m)","bio":"Ona Munson was born on June 16, 1903 in Portland, Oregon, USA as Owena Elizabeth Wolcott. She was an actress, known for Gone with the Wind (1939), The Shanghai Gesture (1941) and The Red House (1947). She was married to Eugene Berman, Stewart McDonald and Edward Buzzell. She died on February 11, 1955 in New York City, New York, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NDY5NTQ5OF5BMl5BanBnXkFtZTYwMTgwNDg4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0613262","name":"Ona Munson","idIMDB":"nm0613262"},"actorId":"nm0613262","character":"Kitty Carmody","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Boris Karloff","urlProfile":"http://www.imdb.com/name/nm0000472","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMTE2MzI5Nl5BMl5BanBnXkFtZTYwMjk4MTI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 November 1887","placeOfBirth":" Camberwell, London, England, UK","birthName":"William Henry Pratt","height":"5' 11\" (1.81 m)","bio":"Along with fellow actors Lon Chaney, Bela Lugosi and Vincent Price, Boris Karloff is recognized as one of the true icons of horror cinema, and the actor most closely identified with the general public's perception of the \"monster\" from the classic Mary Shelley book, \"Frankenstein\". William Henry Pratt was born on November 23, 1887, in Camberwell, London, England, the son of Edward John Pratt Jr., the Deputy Commissioner of Customs Salt and Opium, Northern Division, Indian Salt Revenue Service, and his third wife, Eliza Sarah Millard. He was educated at London University in anticipation that he would pursue a diplomatic career; however, he emigrated to Canada in 1909 and joined a touring company based out of Ontario and adopted the stage name of \"Boris Karloff.\" He toured back and forth across the USA for over ten years in a variety of low-budget theater shows and eventually ended up in Hollywood with very little money to his name. Needing cash to support himself, Karloff secured occasional acting work in the fledgling silent film industry in such pictures as The Deadlier Sex (1920), Omar the Tentmaker (1922), Dynamite Dan (1924) and Tarzan and the Golden Lion (1927), in addition to a handful of serials (the majority of which sadly haven't survived). Karloff supplemented his meager film income by working as a truck driver in Los Angeles, which allowed him enough time off to continue to pursue acting roles. His big break came in 1931 when he was cast as \"the monster\" in the Universal production of Frankenstein (1931), directed by James Whale, one of the studio's few remaining auteur directors. The aura of mystery surrounding Karloff was highlighted in the opening credits, as he was listed as simply \"?.\" The film was a commercial and critical success for Universal, and Karloff was instantly established as a hot property in Hollywood. He quickly appeared in several other sinister roles, including Scarface (1932) (filmed before Frankenstein (1931)), the black-humored The Old Dark House (1932), as the namesake Oriental villain of the Sax Rohmer novels in The Mask of Fu Manchu (1932), as undead Im-Ho-Tep in The Mummy (1932) and the misguided Prof. Morlant in The Ghoul (1933). He thoroughly enjoyed his role as a religious fanatic in John Ford's The Lost Patrol (1934), although contemporary critics described it as a textbook example of overacting. He donned the signature make-up, neck bolts and asphalt spreader's boots again to play Frankenstein's monster in the sensational Bride of Frankenstein (1935) and the less thrilling Son of Frankenstein (1939). Karloff, on loan to Fox, appeared in one of the best of the Warner Oland Chan entries, Charlie Chan at the Opera (1936), before beginning his own short-lived Mr. Wong detective series. He was a wrongly condemned doctor in Devil's Island (1939), shaven-headed executioner \"Mord the Merciless\" in Tower of London (1939), another misguided scientist in The Ape (1940), a crazed scientist surrounded by monsters, vampires and werewolves in House of Frankenstein (1944), a murderous cabman in The Body Snatcher (1945) and a Greek general fighting vampirism in the superb atmospheric Val Lewton thriller Isle of the Dead (1945). While Karloff continued appearing in a plethora of films, many of them were not up to the standards of his previous efforts, including appearances in two of the hokey Bud Abbott and Lou Costello monster movies (he had appeared with them in an earlier superior effort, Abbott and Costello Meet the Killer, Boris Karloff (1949), which theater owners often added his name to the marquee), the low point of the Universal-International horror movie cycle. During the 1950s he was a regular guest on many high-profile TV shows including Texaco Star Theatre (1948), Tales of Tomorrow (1951), The Veil (1958), The Donald O'Connor Show (1954), The Red Skelton Hour (1951) and The Dinah Shore Chevy Show (1956), to name but a few, and he appeared in a mixed bag of films including Sabaka (1954) and Voodoo Island (1957). On Broadway he appeared as the murderous Brewster brother in the hit, \"Arsenic and Old Lace\" (his role, or the absence of him in it, was amusingly parodied in the film version) and a decade later he enjoyed a long run in \"Peter Pan,\" perfectly cast as \"Captain Hook.\" His career experienced something of a revival in the 1960s thanks to hosting the TV anthology series Thriller (1960) and indie director Roger Corman, with Karloff contributing wonderful performances in The Raven (1963), The Terror (1963), the ultra-eerie Black Sabbath (1963) and the H.P. Lovecraft-inspired Monster of Terror (1965). Karloff's last great role was as an aging horror movie star confronting a modern-day sniper in the Peter Bogdanovich film Targets (1968). His TV career was capped off by achieving Christmas immortality as the narrator of Chuck Jones's perennial animated favorite, How the Grinch Stole Christmas! (1966). Three low-budget Mexican-produced horror films starring an ailing Karloff were released in the two years after his death; however, they do no justice to this great actor. In retrospect, he never took himself too seriously as an actor and had a tendency to downplay his acting accomplishments. Renowned as a refined, kind and warm-hearted gentleman, with a sincere affection for children and their welfare, Karloff passed away on February 2, 1969 from emphysema. He was cremated at Guildford Crematorium, Godalming, Surrey, England, where he is commemorated by a plaque in Plot 2 of the Garden of Remembrance.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMTE2MzI5Nl5BMl5BanBnXkFtZTYwMjk4MTI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000472","name":"Boris Karloff","nicknames":["Billy","The Uncanny"],"idIMDB":"nm0000472"},"actorId":"nm0000472","character":"Isopod","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aline MacMahon","urlProfile":"http://www.imdb.com/name/nm0533956","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTViNmFhZWMtYWUzZC00OWQ3LThkZjAtNjMwYTgwMjI4OGViXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 May 1899","placeOfBirth":" McKeesport, Pennsylvania, USA","birthName":"Aline Laveen MacMahon","height":"5' 8\" (1.73 m)","bio":"Aline MacMahon was born of Irish/Russian ancestry on May 3 1899, the daughter of William Marcus MacMahon and Jennie Simon MacMahon. Her father went on to become editor-in-chief of Munsey's Magazine, while her mother pursued a theatrical acting career from middle-age and lived to the ripe old age of 107. After the family moved to Brooklyn, Aline was educated in New York and graduated from Barnard College in 1920. She first appeared on stage in 'The Madras House' at the Neighbourhood Playhouse and subsequently made her bow on Broadway in 'The Mirage' in 1921. During the 1920's, Aline had a prolific career on Broadway, first, as a comedienne adept at impersonations (notably, in 'The Grand Street Follies' and 'Artists and Models'). By 1926, she proved to be equally adept at dramatic roles, making an impact in Eugene O'Neill's 'Beyond the Horizon'. Noël Coward described her as 'astonishing, moving and beautiful', while critic Alexander Woollcott commented on her 'extraordinary beauty, vitality and truth' (New York Times, October 14, 1991). Aline's distinguished career on the stage went on for five and a half decades, highlighted by many critically acclaimed performances in plays like 'The Eve of St.Mark' (1942-43), 'The Confidential Clerk' (1954), 'Pictures in the Hallway' (1956) and 'All the Way Home' (1960-61). Her somewhat melancholic, heavy-lidded and thickly eye-browed features inspired sculptor Isamu Noguchi and photographer Cecil Beaton. Aline's film career began on the strength of her wisecracking voice-culture teacher, May Daniels, in the Kaufman and Hart comedy 'Once in a Lifetime', which she had created on stage in Los Angeles in 1931. She reprised her role on screen the following year and was, prior to that, cast in similar roles as feisty secretaries in Five Star Final (1931), (her debut) and The Mouthpiece (1932). Gold Diggers of 1933 (1933) afforded her a well-received co-starring role as the hard-boiled Trixie Lorraine. Aline managed to escape typecasting with several strong dramatic performances: Edward G. Robinson's sad, cast-off wife in Silver Dollar (1932); the sympathetic self-sacrificing Mrs. Moore of The Life of Jimmy Dolan (1933); her co-starring role as Guy Kibbee's long-suffering wife Myra in Babbitt (1934); and kindly spinster aunt Lily Davis in Ah, Wilderness! (1935). In the 1940's, Aline began playing lower-billed character parts, but was nominated for an Academy Award for her performance as the Chinese mother of Katharine Hepburn's character, Ling Tan, in Dragon Seed (1944). After that, Aline played a succession of gentle mothers and grandmothers, as, for example, in The Eddie Cantor Story (1953). She was also occasionally employed in meatier outdoor roles in anything from swashbucklers, like The Flame and the Arrow (1950), to westerns, such as her ranch owner in The Man from Laramie (1955). More exotically cast, she portrayed James Darren's Hawaiian mother, Kapiolani Kahana, in Diamond Head (1962). In her last motion picture performance, she recreated her stage role as Aunt Hannah for the Paramount film version of All the Way Home (1963). Based on the novel A Death in the Family by James Agee, the picture was a huge success with the critics but performed less well at the box office. Except for a handful of guest appearances on television, Aline pretty much retired from the screen after 1964 and died of pneumonia at her Manhattan home at the age of 92 in October 1991.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTViNmFhZWMtYWUzZC00OWQ3LThkZjAtNjMwYTgwMjI4OGViXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0533956","name":"Aline MacMahon","idIMDB":"nm0533956"},"actorId":"nm0533956","character":"Miss Taylor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Oscar Apfel","urlProfile":"http://www.imdb.com/name/nm0002177","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWFjZGUzOTUtZWRiNS00ZTJlLTlkNDctZjA2YjcwZjkyZWFjL2ltYWdlXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 January 1878","placeOfBirth":" Cleveland, Ohio, USA","bio":"Entering the film industry almost at its beginning, Oscar Apfel began his career in 1911 as a director. He hit the big leagues in 1914 when he was given many prestigious assignments for Paramount Pictures, often in collaboration with Cecil B. DeMille. In 1916, he switched to Fox, and then freelanced for many smaller studios. His directing career began to fizzle out in the 1920s, and he wound up churning out low-budget features for minor studios. He retired from directing in 1927 and began a new career as a character actor, often cast as a senior government official, banker, businessman or other type of authority figure.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWFjZGUzOTUtZWRiNS00ZTJlLTlkNDctZjA2YjcwZjkyZWFjL2ltYWdlXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002177","name":"Oscar Apfel","idIMDB":"nm0002177"},"actorId":"nm0002177","character":"Hinchecliffe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Purnell Pratt","urlProfile":"http://www.imdb.com/name/nm0695525","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGI3OTRiYmEtZDU2MC00ODU1LTgzNmMtODcwYmE5NTMzNmJmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1885","placeOfBirth":" Bethel, Illinois, USA","height":"5' 11\" (1.8 m)","bio":"Purnell Pratt was born on October 20, 1885 in Bethel, Illinois, USA. He was an actor, known for Scarface (1932), Grand Hotel (1932) and The Trespasser (1929). He died on July 25, 1941 in Hollywood, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGI3OTRiYmEtZDU2MC00ODU1LTgzNmMtODcwYmE5NTMzNmJmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0695525","name":"Purnell Pratt","idIMDB":"nm0695525"},"actorId":"nm0695525","character":"French","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Elliott","urlProfile":"http://www.imdb.com/name/nm0254609","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjRiMzcyMTAtZDBmYS00ODhkLWFjMzgtYTBlMDYxN2QyZjMyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1879","placeOfBirth":" Columbus, Ohio, USA","birthName":"Richard Robert Elliott","height":"6' 1½\" (1.87 m)","bio":"Robert Elliott was born on October 9, 1879 in Columbus, Ohio, USA as Richard Robert Elliott. He was an actor, known for Gone with the Wind (1939), The Roaring Twenties (1939) and The Divorcee (1930). He was married to Ruth Thorp. He died on November 15, 1951 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjRiMzcyMTAtZDBmYS00ODhkLWFjMzgtYTBlMDYxN2QyZjMyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0254609","name":"Robert Elliott","idIMDB":"nm0254609"},"actorId":"nm0254609","character":"Brannegan","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0021873","urlIMDB":"http://www.imdb.com/title/tt0021873","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"14","month":"04","year":"1931","remarks":null},{"money":null,"country":null,"day":"11","month":"05","year":"1931","remarks":null}],"copyrightHolder":"First National Pictures, Inc.; 8 September 1931; LP2455 (in copyright registry)"},"technical":{"runtime":["1 hr 29 min (89 min)"],"soundMix":["Mono (Western Electric Sound System)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":["Warner Bros. Studio Laboratory, USA"],"filmLength":["(9 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.3","filmingLocations":[{"location":"Warner Brothers Burbank Studios - 4000 Warner Boulevard, Burbank, California, USA"}],"awards":[{"award":"Academy Awards, USA 1932","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Picture","names":[]}]}]}],"votes":"1,234","type":"Movie","companyCreditsSimple":[{"idCompany":"co0041460","name":"First National Pictures"}],"keywords":{"keywords":["editor","city editor","murder","tabloid","reporter","yellow journalism","ethics","publisher","washing one's hands","loyal secretary","moral principles","unrequited love","personal secretary","resignation","fake reverend","banker","reference to peggy hopkins joyce","journalist","newsstand","fiance","engagement","drunkard","city room","jewish american","snobbery","stepfather","speakeasy","double suicide","telephone","switchboard","switchboard operator","suicide","sensationalism","newspaper","newspaper terror","death of mother","based on play","title spoken by character","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:47:45"}}