{"data":{"movies":[{"title":"Robin and Marian","originalTitle":"","year":"1976","releaseDate":"19760312","directors":[{"name":"Richard Lester","id":"nm0504513"}],"writers":[{"name":"James Goldman","id":"nm0063953"}],"runtime":"106 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmMyYTM2YzAtOTFmZC00ZWJhLWJhNGQtNWY4ZmU0N2Q2MjdhXkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1.jpg","countries":["USA","UK"],"languages":["English"],"genres":["Adventure","Drama","Romance"],"plot":"It is 20 years after Robin Hood's heroics against Prince John and the Sheriff of Nottingham. Since then Robin (played by Sean Connery) has spent all his time outside of England, fighting as Richard the Lionheart's right-hand man in the Crusades and in France. His only connection to his past life in Sherwood Forest is his faithful companion, Little John (Nicol Williamson). However, Richard the Lionheart is now dead and a war-weary, middle-aged Robin decides to return to England. His first priority: rekindle his relationship with Maid Marian (Audrey Hepburn). However, if he figured on a peaceful life he didn't bargain on the machinations of the Sheriff of Nottingham and King John.","simplePlot":"Robin Hood, aging none too gracefully, returns exhausted from the Crusades to woo and win Maid Marian one last time.","actors":[{"actorName":"Sean Connery","urlProfile":"http://www.imdb.com/name/nm0000125","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcwNTM4MzctYjQzMi00NTA2LTljYWItNTYzNmE1MTYxN2RlXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1930","placeOfBirth":" Edinburgh, Scotland, UK","birthName":"Thomas Sean Connery","height":"6' 2\" (1.88 m)","bio":"Sean Connery is best known for portraying the character James Bond, starring in seven Bond films between 1962 and 1983. In 1988, Connery won the Academy Award for Best Supporting Actor for his role in The Untouchables (1987). His film career also includes such films as Marnie (1964), The Name of the Rose (1986), The League of Extraordinary Gentlemen (2003), Indiana Jones and the Last Crusade (1989), The Hunt for Red October (1990), Highlander (1986), Murder on the Orient Express (1974), DragonHeart (1996) and The Rock (1996). Connery has been polled as \"The Greatest Living Scot\" and \"Scotland's Greatest Living National Treasure\". In 1989, he was proclaimed \"Sexiest Man Alive\" by People magazine, and in 1999, at age 69, he was voted \"Sexiest Man of the Century\". Thomas Sean Connery was born on August 25, 1930 in Fountainbridge, Edinburgh, Scotland. His mother, Euphemia McBain (née McLean), was a cleaning lady, and his father, Joseph Connery, was a factory worker and truck driver. He has a brother, Neil Connery, who works as a plasterer in Edinburgh. He is of Irish and Scottish descent. Before going into acting, Sean had many different jobs, such as a milkman, lorry driver, a laborer, artist's model for the Edinburgh College of Art, coffin polisher and bodybuilder. He also joined the Royal Navy, but was later discharged because of medical problems. At the age of 23, he had a choice between becoming a professional footballer or an actor, and even though he showed much promise in the sport, he chose acting and said it was one of his more intelligent moves. No Road Back (1957) was Sean's first major movie role, and it followed by several Tv-movies such as Anna Christie (1957), Macbeth (1961) and Anna Karenina (1961) and guest appearances on TV-series, and also films such as Hell Drivers (1957), Another Time, Another Place (1958), Darby O'Gill and the Little People (1959), The Frightened City (1961). In 1962 he appeared in The Longest Day (1962) with a host of other stars. Connery's breakthrough came in the role of secret agent James Bond. He was reluctant to commit to a film series, but understood that if the films succeeded his career would greatly benefit. He played the character in the first five Bond films: Dr. No (1962), From Russia with Love (1963), Goldfinger (1964), Thunderball (1965), and You Only Live Twice (1967) - then appeared again as Bond in Diamonds Are Forever (1971) and Never Say Never Again (1983). All seven films were commercially successful. James Bond, as portrayed by Connery, was selected as the third-greatest hero in cinema history by the American Film Institute. Connery's selection for the role of James Bond owed a lot to Dana Broccoli, wife of producer \"Cubby\" Broccoli, who is reputed to have been instrumental in persuading her husband that Connery was the right man. James Bond's creator, Ian Fleming, originally doubted Connery's casting, saying, \"He's not what I envisioned of James Bond looks\", and \"I'm looking for Commander Bond and not an overgrown stunt-man,\" adding that Connery (muscular, 6' 2\", and a Scot) was unrefined. Fleming's girlfriend told him that Connery had the requisite sexual charisma, and Fleming changed his mind after the successful Dr. No (1962) premiere. He was so impressed, he created a half-Scottish, half-Swiss heritage for Bond in the later novels. Connery's portrayal of Bond owes much to stylistic tutelage from director Terence Young, polishing the actor while using his physical grace and presence for the action. Lois Maxwell, who played Miss Moneypenny, related that, \"Terence took Sean under his wing. He took him to dinner, showed him how to walk, how to talk, even how to eat.\" The tutoring was successful; Connery received thousands of fan letters a week, and the actor became one of the great male sex symbols of film. During the filming of Thunderball (1965), Connery's life was in danger in the sequence with the sharks in Emilio Largo's pool. He had been concerned about this threat when he read the script. Connery insisted that Ken Adam build a special Plexiglas partition inside the pool, but, despite this, it was not a fixed structure and one of the sharks managed to pass through it. He had to abandon the pool immediately. Connery was forced to wear a toupee during each of the Bond movies because he had started balding at the age of 17. This didn't prevent Connery from being cast in roles, although it became more noticeable in his later years. In 2005, From Russia with Love was adapted by Electronic Arts into a video game, titled From Russia with Love (2005), which featured all-new voice work by Connery as well as his likeness, and those of several of the film's supporting cast. After and during the success of the Bond-films he has maintained a successful career as an actor and has appeared in films, including Alfred Hitchcock's Marnie (1964), The Hill (1965), Murder on the Orient Express (1974), The Man Who Would Be King (1975), The Wind and the Lion (1975), Time Bandits (1981), Highlander (1986), The Name of the Rose (1986), The Untouchables (1987) (which earned him an Oscar for best actor in a supporting role), Indiana Jones and the Last Crusade (1989), The Hunt for Red October (1990), Rising Sun (1993), The Rock (1996), Finding Forrester (2000), and The League of Extraordinary Gentlemen (2003). Sean married actress Diane Cilento in 1962 and they had a son, Jason Connery, born on January 11, 1963, he followed in his father's footsteps and also became an actor. The marriage ended in divorce in 1973. In 1975 he married Micheline Roquebrune and they have stayed married, they have no children together. He is also a grandfather. His son, Jason and his ex-wife, actress Mia Sara had a son, Dashiell Quinn Connery, in 1997.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcwNTM4MzctYjQzMi00NTA2LTljYWItNTYzNmE1MTYxN2RlXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000125","name":"Sean Connery","nicknames":["Big Tam"],"idIMDB":"nm0000125"},"actorId":"nm0000125","character":"Robin Hood","urlCharacter":"http://www.imdb.com/character/ch0003908","main":true},{"actorName":"Audrey Hepburn","urlProfile":"http://www.imdb.com/name/nm0000030","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MTY3NTQyMF5BMl5BanBnXkFtZTYwMTk2MzQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 May 1929","placeOfBirth":" Ixelles, Belgium","birthName":"Audrey Kathleen Ruston","height":"5' 7\" (1.7 m)","bio":"Audrey Hepburn was born Audrey Kathleen Hepburn-Ruston on May 4, 1929 in Brussels, Belgium. She was a blue-blood and a cosmopolitan from birth. Her mother, Ella van Heemstra, was a Dutch baroness; Audrey's father, Joseph Victor Anthony Hepburn-Ruston, was born in Úzice, Bohemia, of English and Austrian descent, and worked in business. After her parents divorced, Audrey went to London with her mother where she went to a private girls school. Later, when her mother moved back to the Netherlands, she attended private schools as well. While she vacationed with her mother in Arnhem, Netherlands, Hitler's army took over the town. It was here that she fell on hard times during the Nazi occupation. Audrey suffered from depression and malnutrition. After the liberation, she went to a ballet school in London on a scholarship and later began a modeling career. As a model, she was graceful and, it seemed, she had found her niche in life--until the film producers came calling. In 1948, after being spotted modeling by a producer, she was signed to a bit part in the European film Dutch in Seven Lessons (1948). Later, she had a speaking role in the 1951 film, Young Wives' Tale (1951) as Eve Lester. The part still wasn't much, so she headed to America to try her luck there. Audrey gained immediate prominence in the US with her role in Roman Holiday (1953) in 1953. This film turned out to be a smashing success, and she won an Oscar as Best Actress. This gained her enormous popularity and more plum roles. In contrast to the \"sex goddesses\" of the silver screen, Audrey Hepburn had a more wholesome beauty and an aura of innocence and class about her which gained her many devoted fans. Roman Holiday (1953) was followed by another similarly wonderful performance in the 1957 classic Funny Face (1957). Sabrina (1954), in 1954, for which she received another Academy nomination, and Love in the Afternoon (1957), in 1957, also garnered rave reviews. In 1959, she received yet another nomination for her role in The Nun's Story (1959). Audrey reached the pinnacle of her career when she played Holly Golightly in the delightful film Breakfast at Tiffany's (1961)in 1961. For this she received another Oscar nomination. She scored commercial success again in the espionage caper Charade (1963). One of Audrey's most radiant roles was in the fine production of My Fair Lady (1964) in 1964. Her co-star, Rex Harrison, once was asked to identify his favorite leading lady. Without hesitation, he replied, \"Audrey Hepburn in 'My Fair Lady.'\" After a couple of other movies, most notably Two for the Road (1967), she hit pay dirt and another nomination in 1967's Wait Until Dark (1967). By the end of the sixties, after her divorce from actor Mel Ferrer, Audrey decided to retire while she was on top. Later she married Dr. Andrea Dotti. From time to time, she would appear on the silver screen. One film of note was Robin and Marian (1976), with Sean Connery in 1976. In 1988, Audrey became a special ambassador to the United Nations UNICEF fund helping children in Latin America and Africa, a position she retained until 1993. She was named to People's magazine as one of the 50 most beautiful people in the world. Her last film was Always (1989) in 1989. Audrey Hepburn died on January 20, 1993 in Tolochnaz, Switzerland, from appendicular cancer. She had made a total of 31 high quality movies. Her elegance and style will always be remembered in film history as evidenced by her being named in Empire magazine's \"The Top 100 Movie Stars of All Time.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MTY3NTQyMF5BMl5BanBnXkFtZTYwMTk2MzQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000030","name":"Audrey Hepburn","nicknames":["Edda van Heemstra"],"idIMDB":"nm0000030"},"actorId":"nm0000030","character":"Maid Marian","urlCharacter":"http://www.imdb.com/character/ch0003911","main":true},{"actorName":"Robert Shaw","urlProfile":"http://www.imdb.com/name/nm0001727","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NzI3NTU2MF5BMl5BanBnXkFtZTcwNTUzMjkyOA@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1927","placeOfBirth":" Westhoughton, Lancashire, England, UK","birthName":"Robert Archibald Shaw","height":"5' 10\" (1.78 m)","bio":"Robert Archibald Shaw was born on August 9, 1927 in Westhoughton, Lancashire, England, the eldest son of Doreen Nora (Avery), a nurse, and Thomas Archibald Shaw, a doctor. His paternal grandfather was Scottish, from Argyll. Shaw's mother, who was born in Piggs Peak, Swaziland, met his father while she was a nurse at a hospital in Truro, Cornwall. His father was an alcoholic and a manic depressive; he committed suicide when Robert was only 12. He had three sisters, Elisabeth, Joanna and Wendy and one brother, Alexander. As a boy, he attended school in Truro and was quite an athlete, competing in rugby, squash and track events but turned down an offer for a scholarship at 17 to go to London with furthering education in Cambridge as he did not want a career in medicine but luckily for the rest of us, in acting. He was also inspired by one of the schoolmasters, Cyril Wilkes who got him to read just about everything, including all of the classics. He would take three or four of the boys to London to see plays. The first play Robert would ever see was \"Hamlet\" in 1944 with Sir John Gielgud at the Haymarket. Robert went to the Royal Academy of Dramatic Arts with a £1,000 inheritance from his grandmother. He went on from the Academy, after two years (1946-1948) to Stratford-on-Avon, where he was directed by Gielgud who said to Shaw, \"I do admire you and think you've got a lot of ability, and I'd like to help you, but you make me so nervous.\" He then went on to make his professional stage debut in 1949 and tour Australia in the same year with the Old Vic. He had joined the Old Vic at the invitation of Tyrone Guthrie, who had directed him as the Duke of Suffolk in \"Henry VIII\" at Stratford. He played nothing but lesser Shakespearean roles, Cassio in \"Othello\" and Lysander in \"A Midsummer Night's Dream\" and toured Europe and South Africa with the company. Shaw was sold on Shakespeare and thought that it would be his theatrical life at that stage. He was discovered whilst performing in \"Much Ado About Nothing\" in 1950 at Stratford by Sir Alec Guinness who suggested he come to London to do Hamlet with him. He then went on to his first film role, a very small part in the classic The Lavender Hill Mob (1951) with Guinness but a start nonetheless. It was also at this time that he married his first wife, Jennifer Bourne, an actress he had met while working at the Old Vic and married her in Sallsbury, South Rhodesia on August 1, 1952. Together, they would have four daughters, Deborah, Penny, Rachel and Katherine. He would also appear briefly in The Dam Busters (1955) and did the London production of \"Tiger at the Gates\" in June of 1955 as Topman. He would also make \"Hill in Korea\" around this time and then, after taking on several jobs as a struggling actor and to support his growing family, he would be cast as Dan Tempest in The Buccaneers (1956). Shaw did not take his role seriously but made £10,000 for eight months work. It was around this time that he wrote his first novel, \"The Hiding Place.\" It was a success, selling twelve thousand copies in England and about the same in France and in the United States. He also wrote a dramatization of it that was produced on commercial television in England and Playhouse 90 (1956) aired a different dramatization in America. Around 1959, he became involved with the well-known actress Mary Ure, who was married to the actor John Osborne at the time. He slipped her his telephone number one night at 3:00 a.m. while visiting the couple and she called him the next day. It was around this time, in 1960, that Robert Shaw became a reporter for England's Queen magazine and covered the Olympics in Rome. Shaw and Ure acted together in Middleton's The Changeling at the Royal Court Theatre in London in 1961. He was playing the part of an ugly servant in love with the mistress of the house who persuades him to murder her fiance. Shaw and Ure had a child on August 31st, even though they were still married to their other spouses. His wife Jennifer and Ure had children to him only weeks apart from each other. Mary divorced Osborne and married Shaw in April 1963. The couple was often quoted by the press as being, \"very much in love\" and together, they would have four children together; Colin, Elizabeth, Hannah and Ian. That same year, after making the next two films, Alerte sur le Vaillant (1962) and The Guest (1963), he made From Russia with Love (1963) and was unforgettable as the blonde assassin, Donald 'Red' Grant. He also made Tomorrow at Ten (1963), as well as TV version of Hamlet as Claudius. He would then film The Luck of Ginger Coffey (1964) with Ure and then star in Battle of the Bulge (1965) as the German Panzer commander Hessler. He wrote \"The Flag\" on the set of the film . He was nominated for his next role, as Henry VIII in A Man for All Seasons (1966), an outstanding, unequal led performance. He would write his fourth novel \"The Man in the Glass Booth\", which was later made into a play with Donald Pleasence and later into a film with Maximilian Schell. In 1967, he again starred with his wife in Custer of the West (1967), then on to The Birthday Party (1969) and Battle of Britain (1969). One of his best performances of this decade was also as the Spanish conqueror Pizarro in The Royal Hunt of the Sun (1969). His last published novel, \"A Card from Morocco\" was also a big success and he went on to make Figures in a Landscape (1970) with Malcolm McDowell as two escaped convicts in a Latin American country. As the father of Churchill in Young Winston (1972) he was once again his brilliant self, and stole the scene from John Mills, Patrick Magee, Anthony Hopkins and Ian Holm. After his portrayal of Lord Randolph Churchill, he made A Reflection of Fear (1972), a horror movie with Ure, Sondra Locke and Sally Kellerman. As the chauffeur Steven Ledbetter in The Hireling (1973) he falls in love with Sarah Miles, an aristocratic widow he helps recover from a nervous breakdown. It took the prestigious Palme d'Or at the Cannes Film Festival and was quite a thought provoking film. It was his performances in the following two films, the USA produced The Sting (1973) and The Taking of Pelham One Two Three (1974) that Shaw became familiar once again to American audiences but it is his portrayal as a grizzled Irish shark hunter, named Quint, in Jaws (1975) that everyone remembers, even to this day. Hard to believe that Shaw wasn't that impressed with the script and even confided to a friend, Hector Elizondo, \"They want me to do a movie about this big fish. I don't know if I should do it or not.\" When Elizondo asked why Shaw had reservations he mentioned that he'd never heard of the director and didn't like the title, \"JAWS.\" It is also incredible that as the biggest box office film, which was the first movie to gross more than $100 million worldwide, he had ever been part of, he didn't make a cent from it because of the taxes he had to pay from working in the United States, Canada and Ireland. It was also during this time that he became a depressed recluse following the death of his wife who took an accidental overdose of barbiturates and alcohol. Some have speculated throughout the years that her death was suicidal but there was no reason for it and this is mere sensationalism. Following Diamonds (1975) he made End of the Game (1975), then another brilliant performance as the Sheriff of Nottingham in Robin and Marian (1976). During the same year, he also made Swashbuckler (1976) with Geneviève Bujold and James Earl Jones, a very light-hearted pirate adventure. His next film Black Sunday (1977), with Shaw playing an Israeli counter-terrorist agent trying to stop a terrorist organization, called Black September, which is plotting an attack at the Super Bowl, was a big success both with critics and at the box office. I wasn't surprised considering the depth that he was also involved in writing the script although he didn't receive billing for it. Shaw was very happy with the success of his acting career, but he remained a depressed recluse in his personal life until he finished Black Sunday (1977) when he found himself in love with his secretary of 15 years, Virginia Dewitt Jansen (Jay). They were wed on July 29, 1976 in Hamilton, Bermuda. He adopted her son Charles and the couple also had one son, Thomas. During his stay in Bermuda, Shaw began work on his next movie, The Deep (1977) which teamed him and writer Peter Benchley once again and maybe that was a mistake, in that everyone expected another Jaws (1975). At one point, discussing how bad the film was going, Shaw could be quoted as saying to Nick Nolte, \"It's a treasure picture Nick, it's a treasure picture\". It did well at the box office but not with critics, although they did hail Shaw as the saving grace. He had done it for the money, as he was to do with his next film, for he had decided when Ure had died that life was short and that he needed to provide for his ten children. In 1977, Shaw traveled to Yugoslavia where he starred in Force 10 from Navarone (1978), a sequel to The Guns of Navarone (1961), he revived the lead role of the British MI6 agent Mallory originally played by Gregory Peck. He was a big box office draw and some producers were willing to pay top wages for his work, but he felt restricted by the parts he was being offered. \"I have it in mind to stop making these big-budget extravaganzas, to change my pattern of life. I wanted to prove, I think, that I could be an international movie star. Now that I've done it, I see the valuelessness of it.\" In early 1978, Shaw appeared in Avalanche Express (1979) which was to become his last film in which he played General Marenkov, a senior Russian official who decides to defect to the west and reveals to a CIA agent, played by Lee Marvin, that the Russians are trying to develop biological weapons. An alcoholic most of his life, Shaw died, before the film was completed, of a heart attack at the age of 51 on August 28, 1978. In poor health due to alcoholism during most of the filming, he in fact completed over 90% of his scenes before the death of director Mark Robson two months earlier in June 1978 brought production to a halt. While living in Ireland and taking a hiatus from working, Shaw was driving from Castlebar to his home in Tourmakeady, Ireland with wife, Virginia, and young son, Thomas, after spending the day playing golf with friends on a local course as well as shopping with her in the town. As they approached their cottage, he felt chest pains which he claimed to Virginia that they had started earlier that day while he was playing golf but the pains subsided. He pulled the car over a few hundred yards from his cottage and told her he would get out and walk them off. After taking four or five steps from the parked car, he collapsed by the side of the road in which his wife ran to the cottage to phone for help. An ambulance arrived 15 minutes later where Shaw was taken to Mayo General Hospital in Castlebar where he was pronounced dead on arrival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NzI3NTU2MF5BMl5BanBnXkFtZTcwNTUzMjkyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001727","name":"Robert Shaw","idIMDB":"nm0001727"},"actorId":"nm0001727","character":"Sheriff of Nottingham","urlCharacter":"http://www.imdb.com/character/ch0003910","main":true},{"actorName":"Richard Harris","urlProfile":"http://www.imdb.com/name/nm0001321","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNTA5ODg1NV5BMl5BanBnXkFtZTcwMDU3MTU5Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1930","placeOfBirth":" Limerick, Ireland","birthName":"Richard St. John Harris","height":"6' 1\" (1.85 m)","bio":"A genuine star of cinema on screen and a fiery hell raiser off screen, Richard St John Harris was born on October 1, 1930 in Limerick, Ireland, to a farming family. He was the son of Mildred Josephine (Harty) and Ivan John Harris, and was an excellent rugby player, with a strong passion for literature. Unfortunately, a bout of tuberculosis as a teenager ended his aspirations to a rugby career, but he became fascinated with the theater and skipped a local dance one night to attend a performance of \"Henry IV\". He was hooked and went on to learn his craft at The London Academy of Music and Dramatic Art, then spent several years in stage productions. He debuted on screen in L'épopée dans l'ombre (1959) and quickly scored regular work in films, including The Wreck of the Mary Deare (1959), The Night Fighters (1960) and a good role as a frustrated Australian bomber pilot in The Guns of Navarone (1961). However, his breakthrough performance was as the quintessential \"angry young man\" in the sensational drama This Sporting Life (1963), which scored him an Oscar nomination. He then appeared in the WW II commando tale The Heroes of Telemark (1965) and in the Sam Peckinpah-directed western Major Dundee (1965). He next showed up in Hawaii (1966) and played King Arthur in Camelot (1967), a lackluster adaptation of the famous Broadway play. Better performances followed, among them a role as a reluctant police informer in The Molly Maguires (1970) alongside Sir Sean Connery. Harris took the lead role in the violent western A Man Called Horse (1970), which became something of a cult film and spawned two sequels. As the 1970s progressed, Harris continued to appear regularly on screen; however, the quality of the scripts varied from above average to woeful. His credits during this period included directing himself as an aging soccer player in the delightful The Hero (1971); the western The Deadly Trackers (1973); the big-budget \"disaster\" film Juggernaut (1974); the strangely-titled crime film 99 and 44/100% Dead (1974); with Connery again in Robin and Marian (1976); Gulliver's Travels (1977); a part in the Jaws (1975) ripoff Orca (1977) and a nice turn as an ill-fated mercenary with Richard Burton and Roger Moore in the popular action film The Wild Geese (1978). The 1980s kicked off with Harris appearing in the silly Bo Derek vanity production Tarzan the Ape Man (1981) and the remainder of the decade had him appearing in some very forgettable productions. However, the luck of the Irish was once again to shine on Harris' career and he scored rave reviews (and another Oscar nomination) for The Field (1990). He then locked horns with Harrison Ford as an IRA sympathizer in Patriot Games (1992) and got one of his best roles as gunfighter English Bob in the Clint Eastwood western Unforgiven (1992). Harris was firmly back in vogue and rewarded his fans with more wonderful performances in Wrestling Ernest Hemingway (1993); Pleure ô pays bien-aimé (1995); The Great Kandinsky (1995) and This Is the Sea (1997). Further fortune came his way with a strong performance in the blockbuster Gladiator (2000) and he became known to an entirely new generation of film fans as Albus Dumbledore in the mega-successful Harry Potter and the Sorcerer's Stone (2001) and Harry Potter and the Chamber of Secrets (2002). His final screen role was as \"Lucius Sulla\" in Caesar (2002). A diverse, vigorous and captivating actor, Richard Harris passed away from Hodgkin's Disease on October 25, 2002.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNTA5ODg1NV5BMl5BanBnXkFtZTcwMDU3MTU5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001321","name":"Richard Harris","idIMDB":"nm0001321"},"actorId":"nm0001321","character":"Richard the Lionheart / King Richard","urlCharacter":"http://www.imdb.com/character/ch0498400","main":true},{"actorName":"Nicol Williamson","urlProfile":"http://www.imdb.com/name/nm0932116","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0OTc2MDQxOV5BMl5BanBnXkFtZTcwMjE0NzgwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1936","placeOfBirth":" Hamilton, Scotland, UK","birthName":"Thomas Nicol Williamson","height":"6' 3\" (1.91 m)","bio":"Nicol Williamson was an enormously talented actor who was considered by some critics to be the finest actor of his generation in the late 1960s and the 1970s, rivaled only by Albert Finney, whom Williamson bested in the classics. Williamson's 1969 \"Hamlet\" at the Roundhouse Theatre was a sensation in London, considered by many to be the best limning of The Dane since the definitive 20th-century portrayal by John Gielgud, a performance in that period, rivaled in kudos only by Richard Burton's 1964 Broadway performance. In a sense, Williamson and Burton were the last two great Hamlets of the century. Finney's Hamlet was a failure, and while Derek Jacobi's turn as The Dane was widely hailed by English critics, he lacked the charisma and magnetism -- the star power -- of a Williamson or Burton. Playwright John Osborne, whose play \"Inadmissible Evidence\" was a star vehicle for Williamson in London's West End and on Broadway, called him \"the greatest actor since Marlon Brando.\" While it was unlikely that Williamson could ever achieved the film reputation of Brando (who but Brando did?) or the superstar status that Burton obtained and then lost, his inability to maintain a consistent film career most likely is a result of his own well-noted eccentricities than it is from any deficiency in acting skills. The great critic and raconteur Kenneth Tynan (Laurence Olivier's first dramaturg at the National Theatre) wrote a 1971 profile of Williamson that elucidated the problem with this potentially great performer. Williamson's Hamlet had wowed Prime Minister Harold Wilson, and Wilson in turn raved about his performance to President Richard Nixon. Nixon invited Williamson to stage a one-man show at the White House, which was a success. However, in the same time period, Williamson's reputation was tarred by his erratic behavior during the North American tour of \"Hamlet\". In Boston he stopped during a performance and berated the audience, which led one cast member to publicly apologize to the Boston audience. Williamson would be involved in an even more famous incident on Broadway a generation later. Even before the Boston incident, Williamson had made headlines when, during the Philadelphia tryout of \"Inadmissible Evidence,\" he struck producer David Merrick whilst defending Anthony Page. In 1976 he slapped a fellow actor during the curtain call for the Broadway musical \"Rex.\" Fifteen years later, his co-star in the Broadway production of \"I Hate Hamlet\" was terrified of him after Williamson whacked the actor on his buttocks with a sword, after the actor had abandoned the choreography. A great stage actor, who also did a memorable \"Macbeth\" in London and on Broadway, Williamson was twice nominated for Tony Awards as Best Actor (Dramatic), in 1966 for Osborne's \"Inadmissible Evidence\" (a performance he recreated in the film version) and in 1974 for a revival of \"Uncle Vanya.\" On film, Williamson was superb in many roles, such as the suicidal Irish soldier in The Bofors Gun (1968) and Tony Richardson's Hamlet (1969). He got his chance playing leads, such as Sherlock Holmes in The Seven-Per-Cent Solution (1976) and Castle in Otto Preminger's The Human Factor (1979), and was competent if not spectacular, likely diminished by deficiencies in the scripts rather than his own talent. Richardson also replaced Williamson's rival as Hamlet, Burton, in his adaptation of Vladimir Nabokov's Laughter in the Dark (1969). It was in supporting work that he excelled in film in the 1970s and 1980s. He was quite effective as a supporting actor, such as his Little John to Sean Connery's Robin Hood in Richard Lester's Robin and Marian (1976), was brilliant in I'm Dancing as Fast as I Can (1982) and gave a performance for the ages (albeit in the scenery-chewing category as Merlin) in Excalibur (1981). His Merlin lives on as one of the most enjoyable performances ever caught on film. Then it was over. While the film work didn't dry up, it didn't reach the heights anymore. He failed to harness that enormous talent and convert it into memorable film performances. He did good work as Louis Mountbatten in a 1986 TV-movie, but the roles became more sporadic, and after 1997 this great actor no longer appeared in motion pictures. Williamson's eccentricities showed themselves again in the early 1990s. When appearing as the ghost of John Barrymore in the 1991 Broadway production of Paul Rudnick's \"I Hate Hamlet\" on Broadway in 1991, Williamson's co-star quit the play after being thumped on the buttocks with a sword during a stage fight. Although critics hailed the performances of the understudy as a \"vast improvement\" it caused a sensation in the press. Despite good reviews, the play lasted only 100 performances. Surprisingly, Williamson never won an Oscar nomination, yet that never was a game he seemed to play. In 1970, after his Hamlet triumph, he turned down a six-figure salary to appear as Enobarbus in Charlton Heston's film of Shakespeare's Antony and Cleopatra (1972)_. The role was played by Eric Porter, but his choice was justified in that the film was derided as a vanity production and savaged by critics). Williamson had been a staple on Broadway, even using his fine singing voice to appear as Henry VIII in the Broadway musical \"Rex\" In 1976. He has not appeared on the Great White Way since his own one-man show about John Barrymore that he himself crafted, \"Jack: A Night on the Town with John Barrymore,\" which had enormously successful runs, both at the Criterion Theater in London, and The Geffen Theater in Los Angeles playing to packed houses, before closing on Broadway after only 12 performances in 1996. The \"I Hate Hamlet\" and \"Jack\" shows are still talked about on Broadway. Williamson has joined the ranks of Barrymore, Burton, and Brando, in that they have become phantoms who haunt the theater and film that they they served so admirably on the one hand but failed on the other. All enormously gifted artists, perhaps possessed of genius, they were discombobulated by that gift that became their curse, the burden of dreams -- the dreams of their audiences, their collaborators, their critics. While there is a wistfulness over the loss of such greatness, there is a relief offered, not so much from a moral tale, but as a release from guilt for the run-of-the-mill artists lacking such genius. One can be comforted by the fact that while one lacks the pearl of such a talent, they also lack the irritating genius that engenders that pearl.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0OTc2MDQxOV5BMl5BanBnXkFtZTcwMjE0NzgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0932116","name":"Nicol Williamson","idIMDB":"nm0932116"},"actorId":"nm0932116","character":"Little John","urlCharacter":"http://www.imdb.com/character/ch0003914","main":true},{"actorName":"Denholm Elliott","urlProfile":"http://www.imdb.com/name/nm0001186","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2ODQ3NDc5Nl5BMl5BanBnXkFtZTcwNDAwMjg5Nw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1922","placeOfBirth":" Ealing, London, England, UK","birthName":"Denholm Mitchell Elliott","height":"5' 11½\" (1.82 m)","bio":"Much-loved character actor who specialised in playing slightly sleazy/slightly eccentric and often flawed upper middle class English gentlemen. His career spanned nearly 40 years, becoming a well-known face both in Britain and in the States.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2ODQ3NDc5Nl5BMl5BanBnXkFtZTcwNDAwMjg5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001186","name":"Denholm Elliott","idIMDB":"nm0001186"},"actorId":"nm0001186","character":"Will Scarlett","urlCharacter":"http://www.imdb.com/character/ch0003912","main":true},{"actorName":"Kenneth Haigh","urlProfile":"http://www.imdb.com/name/nm0354078","urlPhoto":"","biography":{"dateOfBirth":"25 March 1929","placeOfBirth":" Mexborough, Yorkshire, England, UK","height":"6' (1.83 m)","bio":"Kenneth Haigh is an English actor who made history originating the character of Jimmy Porter, the original \"Angry Young Man\", in John Osborne's 1956 play Look Back in Anger (1959), a work that revolutionized the English theater. The following year, Haigh took the performance to Broadway, but movie star Richard Burton was cast in the 1959 movie adaptation. The role came near the beginning of his 50-year career. Apart from Jimmy Porter, his best known role was as Joe Lampton in the TV series Man at the Top (1970).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0354078","name":"Kenneth Haigh","idIMDB":"nm0354078"},"actorId":"nm0354078","character":"Sir Ranulf","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ronnie Barker","urlProfile":"http://www.imdb.com/name/nm0054985","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NzE4Nzc3OF5BMl5BanBnXkFtZTcwMDU2MjIyOA@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1929","placeOfBirth":" Bedford, Bedfordshire, England, UK","birthName":"Ronald William George Barker","height":"5' 8\" (1.73 m)","bio":"Ronnie Barker's remarkable versatility as a performer can be traced back to his time in repertory theatre, where he was able to play a wide range of roles and develop his talent for accents, voices and verbal dexterity. It was during this time that he met Glenn Melvyn, who taught him how to stammer (something he would later use to great effect in the sitcom Open All Hours (1973)). Melvyn also gave Ronnie his break into television by offering him a role in I'm Not Bothered (1956). During the 1960s, Ronnie became well-established in radio, providing multiple voices for \"The Navy Lark\" and working with comedy great Jon Pertwee. He also became a regular face on television, appearing in The Frost Report (1966) (perhaps most memorably in a sketch about Britain's class system, with John Cleese and Ronnie Corbett) and playing character roles on The Saint (1962) and The Avengers (1961). In 1971, Ronnie teamed up with Ronnie Corbett again, this time for a BBC sketch series called The Two Ronnies (1971). This series proved enormously popular, continuing until the late 1980s. In addition to \"The Two Ronnies\", Barker starred on the popular BBC sitcoms Porridge (1974) (as a cockney prisoner) and Open All Hours (1973) (as a stammering Northern shopkeeper). In fact, only Leonard Rossiter could be said to have rivaled him during this time for the crown of British television's most popular comedy star. In 1982, he revived silent comedy in By the Sea (1982). Despite his extrovert performances on television, Barker remained a quiet, retiring individual in his personal life, much preferring to spend time with his family rather than mix with the celebrity crowd. This humility, combined with memories of his extraordinary abilities, meant that he continued to be greatly respected by his fellow professionals. In a BAFTA special shown by the BBC in 2004, stars as diverse as Gene Wilder, Peter Kay and Peter Hall paid tribute to his contribution to comedy and British television in general. Ronnie Barker died on 3 October 2005 after suffering from heart problems.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NzE4Nzc3OF5BMl5BanBnXkFtZTcwMDU2MjIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0054985","name":"Ronnie Barker","nicknames":["The Guvnor"],"idIMDB":"nm0054985"},"actorId":"nm0054985","character":"Friar Tuck","urlCharacter":"http://www.imdb.com/character/ch0003916","main":true},{"actorName":"Ian Holm","urlProfile":"http://www.imdb.com/name/nm0000453","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0ODA2MjM2NF5BMl5BanBnXkFtZTYwNDg5NDIz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1931","placeOfBirth":" Goodmayes, Essex, England, UK","birthName":"Ian Holm Cuthbert","height":"5' 6\" (1.68 m)","bio":"Sir Ian Holm is an Academy Award-nominated British film and stage actor who was a star of the Royal Shakespeare Company, and played more than 100 roles in films and on television. He was born Ian Holm Cuthbert on September 12, 1931, in Goodmayes, Essex, UK, to Scottish parents who worked at the Essex mental asylum. His mother, Jean Wilson (Holm), was as a nurse, and his father, Doctor James Harvey Cuthbert, was a psychiatrist. Young Holm was brought up in London. At the age of seven he was inspired by the seeing 'Les Miserables' and became fond of acting. Holm studied at the Royal Academy of Dramatic Arts, graduating in 1950 to the Royal Shakespeare Company. There he emerged as an actor whose range and effortless style allowed him to play almost entire Shakespeare's repertoire. In 1959 his stage partner Laurence Olivier scored a hit on Ian Holm in a sword fight in a production of 'Coriolanus'. Holm still has a scar on his finger. In 1965 Holm made his debut on television as Richard III on the BBC's The Wars of the Roses (1965), which was a filmed theatrical production of four of Shakespeare's plays condensed down into a trilogy. In 1969 Holm won his first BAFTA Film Award Best Supporting Actor for The Bofors Gun (1968), then followed a flow of awards and nominations for his numerous works in film and on television. In 1981 Holm shot to fame with one of his best known roles, as Sam Mussabini in Chariots of Fire (1981), for which he was nominated for Oscar for Best Actor in a Supporting Role. He is best known for his big action film roles, such as Father Vito Cornelius in The Fifth Element (1997), as Bilbo in The Lord of the Rings: The Return of the King (2003), and as Professor Fitz in Aviator (2004). Ian Holm has five children, three daughters and two sons from the first three of his five wives. In 1989 Holm was created a Commander of the British Empire (CBE), and in 1998 he was knighted for his services to drama.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0ODA2MjM2NF5BMl5BanBnXkFtZTYwNDg5NDIz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000453","name":"Ian Holm","idIMDB":"nm0000453"},"actorId":"nm0000453","character":"King John","urlCharacter":"http://www.imdb.com/character/ch0003913","main":true},{"actorName":"Bill Maynard","urlProfile":"http://www.imdb.com/name/nm0562732","urlPhoto":"","biography":{"dateOfBirth":"8 October 1928","placeOfBirth":" Heath End, Farnham, Surrey, England, UK","birthName":"Walter Frederick George Williams","height":"6' 1\" (1.85 m)","bio":"Bill Maynard was born on October 8, 1928 in Heath End, Farnham, Surrey, England as Walter Frederick George Williams. He is an actor and writer, known for Heartbeat (1992), The Gaffer (1981) and Robin and Marian (1976). He has been married to Tonia Bern since September 4, 1989. He was previously married to Muriel Linnett.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0562732","name":"Bill Maynard","idIMDB":"nm0562732"},"actorId":"nm0562732","character":"Mercadier","urlCharacter":"http://www.imdb.com/character/ch0465427","main":true},{"actorName":"Esmond Knight","urlProfile":"http://www.imdb.com/name/nm0460874","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNTg5NzU4MF5BMl5BanBnXkFtZTcwNzg0NjgyNA@@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 May 1906","placeOfBirth":" East Sheen, Surrey, England, UK","birthName":"Esmond Penington Knight","bio":"A stage actor from 1925, Esmond made his first film appearance in 77 Park Lane (1931) for Michael Powell for whom he eventually made 11 films. Esmond served in the Royal Navy during WWII and lost one eye and was almost totally blinded in the other during an engagement against The Bismarck. This didn't stop him later portraying a Royal Naval officer in Sink the Bismarck! (1960).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNTg5NzU4MF5BMl5BanBnXkFtZTcwNzg0NjgyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0460874","name":"Esmond Knight","idIMDB":"nm0460874"},"actorId":"nm0460874","character":"Old Defender","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Veronica Quilligan","urlProfile":"http://www.imdb.com/name/nm0703618","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4OTU3ODYxMV5BMl5BanBnXkFtZTcwNzA2MjgzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1956","placeOfBirth":" Ireland","bio":"Veronica Quilligan was born in 1956 in Ireland. She is an actress, known for Angel (1982), Candleshoe (1977) and Robin and Marian (1976).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4OTU3ODYxMV5BMl5BanBnXkFtZTcwNzA2MjgzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0703618","name":"Veronica Quilligan","idIMDB":"nm0703618"},"actorId":"nm0703618","character":"Sister Mary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Butterworth","urlProfile":"http://www.imdb.com/name/nm0125350","urlPhoto":"","biography":{"dateOfBirth":"4 February 1919","placeOfBirth":" Bramhall, Cheshire, England, UK","birthName":"Peter William Shorrocks Butterworth","bio":"Peter Butterworth's promising career in the British Navy ended when the plane in which he was traveling was shot down by the Germans in WW II and he was placed in a POW camp. There he became close friends with Talbot Rothwell (later a writer on the \"Carry On\" series, on which Butterworth often worked) and the two began writing and performing sketches for camp shows to entertain the prisoners (and to cover up the noise of other prisoners digging escape tunnels). After the war Butterworth decided to continue his acting career, and soon became a familiar character actor in both films and television. He specialized in playing gentle, well-meaning but somewhat eccentric characters (which, by most accounts, is what he was in real life). He was married to impressionist Janet Brown, and their son, Tyler Butterworth, also became an actor. Butterworth died suddenly in 1979, as he was waiting in the wings to go onstage in a pantomime show.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0125350","name":"Peter Butterworth","nicknames":["Butterscotch"],"idIMDB":"nm0125350"},"actorId":"nm0125350","character":"Surgeon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Barrett","urlProfile":"http://www.imdb.com/name/nm0057179","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NjY1NzMzMl5BMl5BanBnXkFtZTgwMzY5NDEzMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 February 1910","placeOfBirth":" Rochdale, Lancashire, England, UK","birthName":"Jack Elvyn Barrett","height":"5' 7½\" (1.71 m)","bio":"John Barrett was born on February 18, 1910 in Rochdale, Lancashire, England as Jack Elvyn Barrett. He was an actor, known for The French Lieutenant's Woman (1981), Far from the Madding Crowd (1967) and Tess (1979). He died on May 22, 1983 in London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NjY1NzMzMl5BMl5BanBnXkFtZTgwMzY5NDEzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0057179","name":"John Barrett","idIMDB":"nm0057179"},"actorId":"nm0057179","character":"Jack","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kenneth Cranham","urlProfile":"http://www.imdb.com/name/nm0186469","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjE3Njg5Ml5BMl5BanBnXkFtZTcwNzc4MDcwOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1944","placeOfBirth":" Dunfermline, Fife, Scotland, UK","height":"5' 7\" (1.7 m)","bio":"Kenneth Cranham was born on December 12, 1944 in Dunfermline, Fife, Scotland. He is an actor, known for Maleficent (2014), Valkyrie (2008) and Layer Cake (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjE3Njg5Ml5BMl5BanBnXkFtZTcwNzc4MDcwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0186469","name":"Kenneth Cranham","idIMDB":"nm0186469"},"actorId":"nm0186469","character":"Jack's Apprentice","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0075147","urlIMDB":"http://www.imdb.com/title/tt0075147","business":{"budget":{"money":"$5,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"Copyright© MCMLXXVI Columbia Pictures Industries Inc. All Rights Reserved (on print)"},"technical":{"runtime":["1 hr 46 min (106 min)"],"soundMix":["Mono"],"color":["Color (Colour by) (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Technicolor, London, UK (colour by) (as Technicolor®)"],"filmLength":null,"negativeFormat":["35 mm (Eastman 100T 5254)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.6","filmingLocations":[{"location":"Pamplona, Navarra, Spain"}],"rated":"PG","awards":[],"votes":"9,244","type":"Movie","companyCreditsSimple":[{"idCompany":"co0050868","name":"Columbia Pictures Corporation"},{"idCompany":"co0071509","name":"Columbia Pictures"},{"idCompany":"co0047780","name":"Rastar Pictures"}],"keywords":{"keywords":["sheriff of nottingham","sheriff","crusades","england","france","friar","king","aging","abbess","sherwood forest","forest","horseback riding","bare chested male","horse drawn wagon","puppet show","two on a horse","sleeping on the ground","war crime","woman hitting a man","man hits woman","kicked in the crotch by two women","lost in the woods","death of a king","funeral procession","castrati","removing an errow","stabbed in the neck","throwing an arrow","catapult","military training","loyal friend","kiss on the lips","blasphemy","reference to god","character says i love you","fight to the death","dying words","disobey direct order","insubordination","one eyed man","briton abroad","englishman abroad","returning to homeland","reunited lovers","bearded man","catholic","british catholic","catholicism","rural setting","richard lionheart","british royalty","king of england","arrow in the neck","kicked in the balls","three word title","star crossed lovers","death by poison","poisoned to death","poisoning","poisoned drink","1190s","12th century","violence","chalice","opening action scene","tragic hero","spear","staff","army","escape","murder","passionate kiss","outlaw gang","thief hero","warrior","fistfight","brawl","ambush","death of hero","main character dies","tragic event","massacre","combat","sword and sandal","sword duel","disarming someone","long sword","shot with a bow and arrow","stick fight","quarterstaff","bow and arrow","battle axe","battlefield","battle","axe fight","blood","wound","poison","poisoned","kissing while having sex","sex","action hero","adventure hero","priest","mother superior","monk","catholic priest","tinker","suicide by poison","serf","scar","punch and judy","pots and pans","nobility","middle age","longbow","literacy","knight","hut","heroism","folk hero","feudalism","feudal system","feudal society","farmer","dwarf","duel","dead bird","clergy","child bride","bravery","attempted suicide","armor","abbey","swashbuckler","tragic romance","tragic love","sword","swordsman","swordsmanship","suicide","rebel","historical fiction","hero","castle","based on legend","arrow","archer","archery","thief","medieval times","robbery","nun","middle ages","sword fight","1100s","outlaw","convent","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:53:17"}}