{"data":{"movies":[{"title":"Le testament du professeur Dowell","originalTitle":"Zaveshchaniye professora Douelya","year":"1985","releaseDate":"198502","directors":[{"name":"Leonid Menaker","id":"nm0578697"}],"writers":[{"name":"Aleksandr Belyaev","id":"nm0069762"},{"name":"Leonid Menaker","id":"nm0578697"}],"runtime":"91 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NzU4OTc1N15BMl5BanBnXkFtZTcwNDAwMjk2MQ@@._V1.jpg","countries":["Soviet Union"],"languages":["Russian"],"genres":["Drama","Sci-Fi"],"plot":"Professor Dowell and his assistant surgeon Dr. Kern are working on the resurrection of the dead. Dr. Kern kills Dowell in a set up car accident. Professor Dowell's head is now kept alive and used by Dr. Kern for extraction of scientific secrets. Next - the living head of a killed woman gets a body of a young woman. That body belongs to the girlfriend of Dowell's son. Dr. Kern is anxious to announce himself as the inventor. But Dowell's son helps his father's head to get in front of the cameras. The head of professor Dowell tells all and dies.","simplePlot":"Professor Dowell and his assistant surgeon Dr. Kern are working on the resurrection of the dead. Dr. Kern kills Dowell in a set up car accident. Professor Dowell's head is now kept alive ... ","actors":[{"actorName":"Olgert Kroders","urlProfile":"http://www.imdb.com/name/nm0471847","urlPhoto":"","biography":{"dateOfBirth":"9 August 1921","placeOfBirth":" Riga, Latvia","bio":"Olgert Kroders was born on August 9, 1921, in Riga, Latvia. His father, writer Robert Kroders, was a nobleman who belonged to Latvian gentry. His mother, Gerta Kroders, was a Latvian drama actress known under stage name Gerta Wulf. Olgert Kroders attended Riga State University, majoring in history. He was also active in student drama club. In 1937, his grandfather, Janis Kroders, was executed in Moscow under the dictatorship of Joseph Stalin. In 1941, when Baltic states were occupied under the dictatorship of Joseph Stalin, the entire Kroders family were arrested on accusations of anti-Soviet activity and exiled to Siberia. There, Kroders' mother and father died in exile due to poor nutrition and harsh environment. Olgert Kroders served his sentence for 15 years. In 1956, 'Nikita Khrushchev denounced Stalin and initiated \"The Thaw\" bringing some liberalization in cultural life of the USSR. After that, Olgert Kroders was allowed to return from his exile to Latvia and eventually became an actor and director. Kroders began his professional career as assistant director for Edward Smilgis at Janis Rajnis Drama Theatre in Riga. From 1961 to 1964 he studied directing at Moscow State Theatrical Institute, GITIS, graduating as theatre director. Upon graduation he returned to Latvia and worked as director at Valmiera Drama Theatre during the 1960s. In 1967, he made his film debut in Elpojiet dzili (1967). During 70s and 80s he enjoyed a steady film acting career appearing in about 20 film and television productions made in the former Soviet Union, and in Latvia. From 1974 - 1990 Olgert Kroders was chief director of Liepaja Drama Theatre, then, from 1990 to 1995 he was chief director of the Latvian National Academic Theatre in Riga. Outside of his acting profession, Olgert Kroders has been a good sportsman, he was Decathlon champion of Jurmala, Latvia. He is living in Riga, Latvia.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0471847","name":"Olgert Kroders","idIMDB":"nm0471847"},"actorId":"nm0471847","character":"Professor Dowell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Igor Vasilev","urlProfile":"http://www.imdb.com/name/nm0890568","urlPhoto":"","biography":{"dateOfBirth":"20 May 1938","placeOfBirth":" Moscow, RSFSR, USSR [now Russia]","birthName":"Igor Alekseyevich Vasilyev","bio":"Igor Vasilyev was a Russian actor of the Moscow Art Theatre. He was born Igor Alekseevich Vasilyev on May 20, 1938, in Moscow, Soviet Union (now Moscow, Russia). He studied acting at the School of Moscow Art Theatre, graduating in 1961 as actor. From 1964 to 1970 he was a permanent member of the troupe at Sovremennik Theatre in Moscow. There his stage partners were such actor as Oleg Efremov, Evgeniy Evstigneev, Galina Volchek, Stanislav Lyubshin, Anatoliy Romashin, Alla Pokrovskaya, Oleg Tabakov, Oleg Dal, Igor Kvasha, Valentin Gaft and other notable Russian actors. From 1970 to 2007 Vasilyev was a member of the troupe at Moscow Art Theatre (MKhAT). There he made such memorable appearances as Zilov in 'Utinaya Okhota' by Aleksandr Vampilov, as Svidrigailov in 'Crime and Punishment' - adaptation of the eponymous novel by Fyodor Dostoevsky, and eventually established himself as a leading actor in many stage productions at MKhAT. There his stage partners were such actors as Innokentiy Smoktunovskiy, Yekaterina Vasilyeva, Tatyana Doronina, Oleg Efremov, Evgeniy Evstigneev, Oleg Tabakov, Aleksandr Kalyagin, Andrei Popov and other notable Russian actors. After the split of the troupe in 1987, he was a member of MKhAT named after Anton Chekhov, where his stage partners included many notable Russian actors. Igor Vasilyev was designated People's Actor of Russia. He played leading and supporting roles in about 30 film and television productions. He died of a heart failure on December 23, 2007, and was laid to rest in Troekurovskoe cemetery in Moscow, Russia.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0890568","name":"Igor Vasilev","idIMDB":"nm0890568"},"actorId":"nm0890568","character":"Doctor Kern","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Valentina Titova","urlProfile":"http://www.imdb.com/name/nm0864515","urlPhoto":"","biography":{"dateOfBirth":"6 February 1942","placeOfBirth":" Kaliningrad, Moskovskaya oblast, RSFSR, USSR [now Korolev, Russia]","birthName":"Valentina Antipovna Titova","bio":"Valentina Titova was born on February 6, 1942 in Kaliningrad, Moskovskaya oblast, RSFSR, USSR as Valentina Antipovna Titova. She is an actress, known for Metel (1965), Le testament du professeur Dowell (1985) and Mimino (1977). She was previously married to Georgi Rerberg.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0864515","name":"Valentina Titova","idIMDB":"nm0864515"},"actorId":"nm0864515","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Natalya Sayko","urlProfile":"http://www.imdb.com/name/nm0756956","urlPhoto":"","biography":{"dateOfBirth":"12 January 1948","placeOfBirth":" Tallinn, Estonian SSR, USSR [now Estonia]","birthName":"Natalya Petrovna Sajko","bio":"Natalya Sayko was born on January 12, 1948 in Tallinn, Estonian SSR, USSR as Natalya Petrovna Sajko. She is an actress, known for Golos (1982), Ya - aktrisa (1980) and Le testament du professeur Dowell (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0756956","name":"Natalya Sayko","idIMDB":"nm0756956"},"actorId":"nm0756956","character":"Angelika / Eve","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aleksey Bobrov","urlProfile":"http://www.imdb.com/name/nm0090432","urlPhoto":"","biography":{"bio":"Aleksey Bobrov is an actor, known for Le testament du professeur Dowell (1985), Provintsialy (2002) and Fear and Desire (1992).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0090432","name":"Aleksey Bobrov","idIMDB":"nm0090432"},"actorId":"nm0090432","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nikolay Lavrov","urlProfile":"http://www.imdb.com/name/nm0492254","urlPhoto":"","biography":{"dateOfBirth":"8 April 1944","placeOfBirth":" USSR","birthName":"Nikolai Grigoryevich Lavrov","bio":"Nikolai Lavrov was a Russian character actor who is best remembered for his screen presence in a supporting role in Upyr (1997), as well as in the Russian TV crime series Uboynaya sila (2000). He was born Nikolai Grigoryevich Lavrov on April 8, 1944, in Russia (at that time the Soviet Union). In the 1960s he began his acting career in Leningrad (now St. Petersburg), Russia. There, from 1967 - 1973, he was a permanent member of the troupe at State Theatre for Young Audience. At that time he studied acting and directing under Zinovi Korogodsky at the Institute of Theatre and Cinematography in Leningrad (St. Petersburg), graduating in 1973, as director. From 1973 - 2000 he was a permanent member of the troupe at Maly Drama Theatre - Theatre of Europe under directorship of Lev Dodin. Nikolai Lavrov made his film debut while being a student, in criminal Dela davno minuvshikh dney... (1972). He gave impressive film performances as a supporting actor in Solyonyy pyos (1975), in Detskaya ploshchadka (1986), and in a powerful criminal drama Upyr (1997). Nikolai Lavrov was also a notable stage actor. During the 1980s he shot to fame in Russia with his powerful performances on the stage of Maly Drama Theatre - Theatre of Europe in St. Petersburg, Russia. There Nikolai Lavrov created leading roles in such award-winning productions as 'Dom' (aka... Home), and 'Bratya i sestry' (aka... Brothers and sisters) based on the eponymous books by 'Fyodor Abramov' under directorship of Lev Dodin. Nikolai Lavrov was awarded the State Prize of the USSR, and was designated Honorable Artist of Russia in 1984. He was a sensitive and sophisticated person who was struggling under pressures of reality and suffered from alcohol dependency, until his life and career were interrupted by a severe emotional breakdown. He died on August 13, 2000, in Sestroretsk, near St. Petersburg, and was laid to rest in Necropolis of The Masters of Art \"Literatorskie mostki\" at Volkovskoe Cemetery, in St. Peterburg, Russia.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0492254","name":"Nikolay Lavrov","idIMDB":"nm0492254"},"actorId":"nm0492254","character":"Police detective","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aleksandr Porokhovshchikov","urlProfile":"http://www.imdb.com/name/nm0691775","urlPhoto":"","biography":{"dateOfBirth":"31 January 1939","placeOfBirth":" Moscow, Russian SFSR, USSR [now Russia]","birthName":"Aleksandr Shalvovich Porokhovshchikov","bio":"Movie and theater actor, film director and producer. Leading man in 42 movies, starred in 90 theater productions. Wife Irina Zhukova-Porokhovshchikova, theater reviewer, starred in his latest movie Tsenzuru k pamyati ne dopuskayu (1992). Uncensored Memories is the first prize winner at the first festival of Russian movie in St. Rafael, France 1993.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0691775","name":"Aleksandr Porokhovshchikov","idIMDB":"nm0691775"},"actorId":"nm0691775","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ernst Romanov","urlProfile":"http://www.imdb.com/name/nm0738998","urlPhoto":"","biography":{"dateOfBirth":"9 April 1936","placeOfBirth":" Kabakovsk, Sverdlovsk Oblast, Russian SFSR, USSR [now Serov, Sverdlovsk Oblast, Russia]","birthName":"Ernst Ivanovich Romanov","bio":"Ernst Romanov was born on April 9, 1936 in Kabakovsk, Sverdlovsk Oblast, Russian SFSR, USSR as Ernst Ivanovich Romanov. He is an actor, known for Bez vidimykh prichin (1982), Na vsyu ostavshuyusya zhizn... (1975) and The Blue Carbuncle (1980).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0738998","name":"Ernst Romanov","idIMDB":"nm0738998"},"actorId":"nm0738998","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Boris Tsymba","urlProfile":"http://www.imdb.com/name/nm0875541","urlPhoto":"","biography":{"bio":"Boris Tsymba is an actor, known for Le testament du professeur Dowell (1985), Takaya pozdnyaya, takaya tyoplaya osen (1981) and Opération liberté (1973).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0875541","name":"Boris Tsymba","idIMDB":"nm0875541"},"actorId":"nm0875541","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tito Romalio","urlProfile":"http://www.imdb.com/name/nm0738658","urlPhoto":"","biography":{"dateOfBirth":"19 July 1951","placeOfBirth":" Leningrad, RSFSR, USSR [now St. Petersburg, Russia]","birthName":"Tito Jose Romalio","bio":"Tito Romalio was a Russian-Brazilian actor and choreographer who appeared in several Soviet films as a child, and later became a dancer. He was murdered by a supermarket security guard in May 2010. He was born Eufalio Tito Jose Romalio on July 19, 1951, in the Soviet Union. His father, Tito Romalio Sr., was a Brazilian actor who married a Russian actress and the family lived in Leningrad/St. Petersburg. Young Tito Romalio made his film debut at the age of five appearing as a child alongside his father in Priklyucheniya Artyomki (1956). At age ten he played one of the leads in Zdravstvuyte, deti (1962) by director Mark Donskoy. Upon recommendation from director Dnskoy, Tito Romalio studied acting and choreography at the reputable Leningrad Academic College of A. Vaganova, graduating in 1970. As a regular Soviet citizen, he served in the Soviet Red Army. After the army service, he returned to his career as professional actor and dancer. During the 70s he was an actor with the popular band \"Druzhba\" under the leadership of Aleksandr Bronevitsky. He also played bit parts in film and on television. Tito Romalio was married to Russian actress Elena Uspenskaya and the couple organized a popular theatre for children named Globus. They produced several popular shows for children. In the early morning of May 10, 2010, Tito Romalio was shopping at a major supermarket, Perekrestok, in Saint Petersburg. There he was severely beaten by a former security guard of the same supermarket who happened to be recently fired from the job. The security guard, Khamzai Yenikeyev, a troubled veteran of the Russian-Chechen war who was diagnosed with a post-traumatic stress disorder and was fired from the job a few days ago, was wandering near the supermarket. He approached the actor and demanded a cell phone, but the actor refused to give his cell phone away. In an outburst of anger Khamzai Yenikeyev attacked Tito Romalio and hit the actor in the head several times. Tito Romalio fell on the ground unconscious. Khamzai Yenikeyev continued the beating using his feet. The beating was videotaped on a security camera. As a result of the beating, Tito Romalio suffered multiple head injuries and had a severe blood loss. He remained unconscious and was bleeding until he was taken to the State emergency room at the Aleksandrovsky Hospital of Saint Petersburg. Tito Romalio remained unconscious until he died on May 11, 2010. His death caused a considerable mourning among his fans in Saint Petersburg and across Russia. He was laid to rest in Severnoe cemetery in St. Petersburg, Russia.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0738658","name":"Tito Romalio","idIMDB":"nm0738658"},"actorId":"nm0738658","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Petr Shelokhonov","urlProfile":"http://www.imdb.com/name/nm0791282","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MDgxNjU5NV5BMl5BanBnXkFtZTcwMDM1ODgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 August 1929","placeOfBirth":" Byelorussian SSR, USSR [now Belarus]","birthName":"Peter Shelokhonov","height":"5' 10¾\" (1.8 m)","bio":"Petr (Peter) Shelokhonov was born in 1929, in Belarus, then part of the USSR. His ancestors came from Lithuania, from Ukraine and from Poland. Petr was destined to practice medicine, like his father, but his fate was changed by war. He survived the Nazi occupation during WWII. The Nazis arrested Petr and he was severely wounded in his forehead but he escaped and survived. Then he joined the partisans resistance in the woods. There Petr Shelokhonov had his first acting experience. He was performing parodies of Hitler and the Nazis to his fellow partisans. His performances helped lift their spirits in a time when they were struggling to survive. This experience accentuated his humble, modest character. The scar on his forehead, the mark of war, made his acting career seem like an impossible dream; but Petr was determined. He made puppets and a screen, and worked in his own puppet theater from 1943 - 1945. In his show titled \"Peter and the Wolf\" he managed to lead four puppets with four voices, and also played the accordion. He performed for bread and rare food packages from the American airlift, and he was very lucky to survive until the end of WWII. In 1945 he became a piano student at the Kiev Conservatory of Music, he also played the accordion on stage. Pyotr Ilyich Tchaikovsky and Sergei Rachmaninoff were his favorites as well as the music of Glenn Miller, Ella Fitzgerald, Frank Sinatra and other stars from the Voice of America radio shows. Eventually he became a stand-up comedian in Leningrad. There, in 1949, he was drafted in the Red Navy and served in the Baltic Fleet for five years. There he was arrested for telling a political joke and was detained in a strict guardhouse. After the death of Stalin, Shelokhonov was discharged from service. He managed to survive the roughest realities of life under Soviet dictatorship; but when his free spirited humor angered the hard liners again, many doors closed. After that, Petr's acting career was limited to Siberia. He moved to the Siberian city of Irkutsk and graduated from Irkutsk Drama School. He became a member of the Irkutsk Drama Theater in the 1950s, then joined the Chekhov's Drama Theatre in the city of Taganrog in the 1960s, then, upon invitation from Lenfilm Studios, he returned to Leningrad in 1968. There, after a few successful appearances on television, he made his big screen debut as spy Sotnikov in Razvyazka (1969). Shelokhonov played a foreign spy wearing a Soviet uniform and killing people. When the movie was released, a real Red Army officer wearing a uniform approached the Moscow Kremlin and made several gun shots trying to kill the Soviet leader Leonid Brezhnev. Immediately after this attack on the Soviet leader, the movie Razvyazka (1969) was banned by the Soviet government, and the filmmakers were censored, albeit Shelokhonov survived again thanks to his talent. He spent most of his professional acting career working for film studios in St. Petersburg, Moscow, Kiev and Odessa. Petr Shelokhonov played leading and supporting roles in Russian and international films, and his filmography includes over 80 roles in film and on television. His film and stage partners were such actors as Mikhail Boyarskiy, Kirill Lavrov, Ivan Krasko, Pavel Luspekayev, Efim Kopelian, Sergey Boyarskiy, Nikolay Boyarskiy, Natalya Fateeva, Andrey Myagkov, Sophie Marceau, Sean Bean, and other stars. He also played over 100 roles on stage in Russian and International theater productions. He played the leading role (Sam) in Photo Finish, written and directed by Peter Ustinov. Petr Shelokhonov was designated Honorable Actor of Russia (1979). He passed away in 1999, and was laid to rest in St. Petersburg, Russia. Books about him were published in Russia and in the USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MDgxNjU5NV5BMl5BanBnXkFtZTcwMDM1ODgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0791282","name":"Petr Shelokhonov","nicknames":["Pete"],"idIMDB":"nm0791282"},"actorId":"nm0791282","character":"Businessman","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0088447","urlIMDB":"http://www.imdb.com/title/tt0088447","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":[{"money":"18,700,000","country":"Soviet","day":null,"month":null,"year":null,"remarks":null}],"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 31 min (91 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":["2,504 m"],"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.9","filmingLocations":[{"location":"Black Sea, Russia"}],"awards":[{"award":"Fantasporto 1985","titlesAwards":[{"titleAwardOutcome":"Nominated International Fantasy Film Award","categories":[{"category":"Best Film","names":[{"name":"Leonid Menaker","id":"nm0578697","role":null}]}]}]}],"votes":"185","type":"Movie","companyCreditsSimple":[{"idCompany":"co0114119","name":"Lenfilm Studio"}],"keywords":{"keywords":["science","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 05:47:56"}}