{"data":{"movies":[{"title":"Rough Seas","originalTitle":"","year":"1931","releaseDate":"19310425","directors":[{"name":"James Parrott","id":"nm0663613"}],"writers":[{"name":"H.M. Walker","id":"nm0907778"}],"runtime":"27 min","countries":["USA"],"languages":["English"],"genres":["Short","Comedy"],"plot":"World War I is over, and the American soldiers are boarding ships to sail for home. Pvt. Charley Chase smuggles his French girlfriend Antoinette aboard as a bag of dirty laundry while his pet monkey Napoleon manages to sneak aboard on his own. Charley and his monkey steal a soldier's uniform for Antoinette piece by piece, and then Charley sings, dances, plays the harmonica and accordion, and pulls pranks on his fellow soldiers while he should be working. The ship's doctor attempts to restore the beautiful tenor voice of a member of Charley's quartet, and Napoleon wreaks havoc by playing with the ship's controls and a cannon.","simplePlot":"On his way home following World War I, Charley smuggles his French sweetheart aboard ship and gets into all kinds of trouble.","actors":[{"actorName":"Charley Chase","urlProfile":"http://www.imdb.com/name/nm0153713","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE5MDgzMjIzNF5BMl5BanBnXkFtZTYwNzk2MjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1893","placeOfBirth":" Baltimore, Maryland, USA","birthName":"Charles Joseph Parrott","height":"6' (1.83 m)","bio":"While Charley Chase is far from being as famous as \"The Big Three\" (Charles Chaplin, Buster Keaton and Harold Lloyd) today, he's highly respected as one of the \"greats\" by fans of silent comedy. Chase (real name Charles Parrott) was born in Maryland, USA, in 1893. After a brief career in vaudeville, he entered Al Christie's movie studio as a comedian in 1913 before settling down at Keystone Films the following year. Chase's career in films did not start off with remarkable success. He played bit parts in a large number of short comedies, appearing with Charlie Chaplin and Roscoe \"Fatty\" Arbuckle, among others, before he finally got his chance at Hal Roach Studios as a director, before Roach realized what a gifted performer he had hired. \"I can play anything!\" Chase told Roach, and eventually his claim was confirmed. Although Mack Sennett's Keystone studio has earned legendary status as the ultimate factory of comic invention, it can hardly be denied that Roach developed a more refined style of comedy which obviously fitted Chase better (indeed, Sennett's unsophisticated product increasingly lost favor with the movie-going public by the early 1920s, while Roach's studio flourished). During five years, 1924-29, he starred in nearly a hundred two-reelers, most of which were directed by Leo McCarey. Chase usually portrayed an apparently gentle and charming man who in reality, it eventually turned out, was quite a loser after all. His character was largely inspired by Lloyd Hamilton, another neglected comedian whom Chase had directed in several two-reelers. Among Charley's most memorable shorts are Innocent Husbands, Mighty Like a Moose, and Movie Night. From the beginning, Charley Chase was a \"critics' darling,\" but none of his movies were remarkably successful at the box office. There is no official \"explanation\" to this, but one reason may be that Chase, in contrast to the more popular clowns, never starred in any feature during the silent period. On a personal level, Chase was severely hobbled by alcoholism, which is unapparent in his films. Chase made several promising appearances after the talkies arrived, in 1929-30, especially in Laurel and Hardy's highly acclaimed feature Sons of the Desert (1933). Despite this, he was never offered any further appearances in features. But he continued to perform in shorts and did also direct some of the Three Stooges' early movies. He died in 1940, not yet 47 years of age, of a heart attack. It is reasonable to believe that his early death was to a large extent caused by his addiction to alcohol, a problem which had troubled his family for several years. His brother James, also an actor, had died the year before. The two brothers had been close throughout their lives, although their personal problems frequently affected each other (or perhaps that was the reason for their being so close.) Chase was married to Bebe Eltinge from 1914, a marriage that lasted until his death and produced two daughters, Polly and June. Chase's silent work was celebrated on DVD in two volumes from Kino Video. At long last his comic genius is being recognized.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE5MDgzMjIzNF5BMl5BanBnXkFtZTYwNzk2MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0153713","name":"Charley Chase","idIMDB":"nm0153713"},"actorId":"nm0153713","character":"Pvt. Charley Chase","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thelma Todd","urlProfile":"http://www.imdb.com/name/nm0865298","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5Mjk4ODc5MF5BMl5BanBnXkFtZTgwODQyNjc3MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1906","placeOfBirth":" Lawrence, Massachusetts, USA","height":"5' 4\" (1.63 m)","bio":"Thelma Todd was born in Lawrence, Massachusetts, an industrial city near the New Hampshire state line. She was a lovely child with good academic tendencies, so much so that she decided early on to become a schoolteacher. After high school she went on to college but at her mother's insistence entered several beauty contests (apparently her mother wanted her to be more than just a \"schoolmarm\"). Thelma was so successful in these endeavors that she entered on the state level and won the title of \"Miss Massachusetts\" in 1925 and went on to the \"Miss America\" pageant. Although she didn't win, the pageant afforded her a chance to be seen been by talent scouts looking for fresh new faces to showcase in films. She began appearing in one- and two-reel shorts, mostly comedy, which showcased her keen comic timing and aptitude for physical comedy (unusual in such a beautiful woman). She had been making shorts for Hal Roach when she was signed to Paramount Pictures. Her first film--at 21 years of age--was as Lorraine Lane in 1927's Fascinating Youth (1926), a romantic comedy, which was Paramount's showcase vehicle for its new stars. Thelma received minor billing in another film that year, God Gave Me Twenty Cents (1926). The next year she starred with Gary Cooper and William Powell in the western Nevada (1927). That year also saw her in three more films, with The Gay Defender (1927) being the most notable. It starred Richard Dix in the role of a man falsely accused of murder. As the 1920s closed, Thelma began getting parts in more and more films. In 1928 and 1929 alone she was featured in 20 pictures, and not just comedies--she also did dramas and gothic horror films. Unlike many silent-era stars whose voices didn't fit their image or screen persona, Thelma's did. She had a bright, breezy, clear voice with a pleasant trace of a somewhat aristocratic, but not snobbish, New England accent and easily made the transition to sound films. In 1930 she added 14 more pictures to her resume, with Dollar Dizzy (1930) and Follow Thru (1930) being the most notable. The latter was a musical with Thelma playing a rival to Nancy Carroll for the affections of Buddy Rogers. It was a box-office hit, as was the stage production on which it was based. The following year Thelma appeared in 14 more films, among them Let's Do Things (1931), Speak Easily (1932), The Old Bull (1932) and On the Loose (1931). Her most successful film that year, however, was the Marx Brothers farce Monkey Business (1931). While critics gave the film mixed reviews, the public loved it. In 1932 Thelma appeared in another Marx Brothers film directed by Norman Z. McLeod, Horse Feathers (1932). She also starred in This Is the Night (1932), a profitable film which featured Cary Grant in his first major role. In 1934 Thelma made 16 features, but her career would soon soon come to a grinding halt. In 1935 she appeared in such films as Twin Triplets (1935) and The Misses Stooge (1935), all showcasing her considerable comic talents. She also proved to be a savvy businesswoman with the opening of \"Thelma Todd's Sidewalk Cafe,\" a nightclub/restaurant that catered to show business people. It also, unfortunately, attracted some shady underworld types as well, and there were rumors that they were trying to take over her club and use it as a gambling establishment in order to fleece the wealthy Hollywood crowd. According to these stories, Thelma and her boyfriend, director Roland West, wouldn't sell their establishment once they found out what the gangsters had in mind, thereby incurring the enmity of people it was not a good idea to become enemies of. Whether the stories were true or not, on December 16, 1935, Thelma was found dead in her car in her garage in Los Angeles. Her death was ruled a suicide owing to carbon monoxide poisoning. She was only 29 years old. At the time, as today, many felt that her death was actually a murder connected to the goings-on at her club, a theory that was lent credence by the fact that no one who knew her had ever seen her depressed or morose enough to worry about her committing suicide. Another factor that aroused suspicion was that her death was given a cursory investigation by the--at the time--notoriously corrupt Los Angeles County District Attorney's Office and the case was quickly and unceremoniously closed. Her death has remained a controversial one even to this day. Three films she made before her death weren't released until the following year: Hot Money (1936), An All American Toothache (1936), and The Bohemian Girl (1936). The latter saw her quite substantial role cut down so much that she was barely glimpsed in the picture. Thelma had made an amazing 115 films in such a short career, and her beauty and talent would no doubt have taken her right to the top if it hadn't been for her untimely demise.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5Mjk4ODc5MF5BMl5BanBnXkFtZTgwODQyNjc3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0865298","name":"Thelma Todd","nicknames":["The Ice Cream Blonde","Hot Toddy"],"idIMDB":"nm0865298"},"actorId":"nm0865298","character":"Antoinette","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carlton Griffin","urlProfile":"http://www.imdb.com/name/nm0341134","urlPhoto":"","biography":{"dateOfBirth":"23 May 1893","placeOfBirth":" New York City, New York, USA","birthName":"Carlton Elliott Griffin","bio":"Carlton Griffin was born on May 23, 1893 in New York City, New York, USA as Carlton Elliott Griffin. He was an actor, known for Girl Shy (1924), It Doesn't Pay (1915) and Bud Tilton, Mail Thief (1913). He was married to Verna Irene Bell and Pauline Saxon. He died on July 24, 1940 in Hollywood, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0341134","name":"Carlton Griffin","idIMDB":"nm0341134"},"actorId":"nm0341134","character":"Lieutenant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"The Ranch Boys","urlProfile":"http://www.imdb.com/name/nm1250768","urlPhoto":"","biography":{"bio":"The Ranch Boys is an actor, known for Rough Seas (1931), In Old Monterey (1939) and High C's (1930).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1250768","name":"The Ranch Boys","idIMDB":"nm1250768"},"actorId":"nm1250768","character":"Soldiers / Singing Group","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jimmie Adams","urlProfile":"http://www.imdb.com/name/nm0011063","urlPhoto":"","biography":{"dateOfBirth":"4 October 1888","placeOfBirth":" Paterson, New Jersey, USA","birthName":"James B. Adams","bio":"Born c. 1888. A slight, short, slapstick comedian who starred in two-reel comedies for Mermaid, Educational, and Christie Film Company in the 1920's. Died in 1933 at age 45 in Glendale, California. In 1921 Adams starred in two-reel comedies for Educational Pictures and Al Christie. The slightly built, pencil-mustached Adams has been described by historian Kalton C. Lahue as \"a poor man's Charley Chase.\" Like Chase, and unlike the other comics at Educational, Adams favored situation comedy over slapstick. He briefly replaced Mack Sennett comic Harry McCoy in the cartoon-inspired Hall Room Boys series (produced by Harry Cohn and Jack Cohn, later of Columbia Pictures). By 1924 Adams was back with Educational. Christie hired Adams for six comedies released in 1926 and 1927. The Christie comedies were more polite and less extreme than the slam-bang comedies of other studios, but Christie's soft-pedal comedy style did find an audience. Star comedians Jimmie Adams, Bobby Vernon, Lige Conley, Neal Burns, and Billy Dooley constituted a lineup that was no threat to Hal Roach, but nevertheless entertained millions with a style than neither Roach or Mack Sennett could or would provide. Adams was also a singer. In 1930 he co-starred with burly comic Bud Jamison as \"The Rolling Stones,\" a pair of singing vagabonds touring America. Adams also sang with The Ranch Boys, a musical group featured in Charley Chase comedies.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0011063","name":"Jimmie Adams","idIMDB":"nm0011063"},"actorId":"nm0011063","character":"Pvt. Jimmie Adams","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Gage","urlProfile":"http://www.imdb.com/name/nm0300813","urlPhoto":"","biography":{"bio":"Frank Gage is an actor, known for Midsummer Mush (1933), Sherman Said It (1933) and High C's (1930).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0300813","name":"Frank Gage","idIMDB":"nm0300813"},"actorId":"nm0300813","character":"Pvt. Frank Gage","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marvin Hatley","urlProfile":"http://www.imdb.com/name/nm0368943","urlPhoto":"","biography":{"dateOfBirth":"3 April 1905","placeOfBirth":" Reed, Oklahoma, USA","bio":"Composer, conductor and author, educated at UCLA and then a staff pianist for KFWB in Hollywood for four years, then to vaudeville for one year, and then to KFUD. Two years after joining the Hal Roach Studios, he took over its music department, which he directed for ten years. Joining ASCAP in 1952, his most-popular composition is the Laurel and Hardy theme, which he always spelled \"Ku-Ku\".","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0368943","name":"Marvin Hatley","idIMDB":"nm0368943"},"actorId":"nm0368943","character":"Pvt. Marvin Hatley","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0022325","urlIMDB":"http://www.imdb.com/title/tt0022325","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"09","month":"01","year":"1931","remarks":null},{"money":null,"country":null,"day":"24","month":"01","year":"1931","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["27 min"],"soundMix":["Mono (Western Electric Sound System)"],"color":["Black and White"],"aspectRatio":["1.20 : 1"],"camera":null,"laboratory":null,"filmLength":["740 m (3 reels) (USA)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.2","filmingLocations":[],"rated":"TV-G","awards":[],"votes":"73","type":"Movie","companyCreditsSimple":[{"idCompany":"co0075561","name":"Hal Roach Studios"}],"keywords":{"keywords":["ship","soldier","monkey","cannon","accordion","world war one","stowaway","fire drill","doughboy"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 06:26:47"}}