{"data":{"movies":[{"title":"The Big Kick","originalTitle":"","year":"1930","releaseDate":"19300329","directors":[{"name":"Warren Doane","id":"nm0229553"}],"writers":[{"name":"H.M. Walker","id":"nm0907778"}],"runtime":"20 min","countries":["USA"],"languages":["English"],"genres":["Comedy","Short"],"plot":"Revenuers have been chasing a gang of bootleggers for years. They're hot on the trail near a gas station operated by Harry, a seemingly slow witted fellow with a cheery and spunky girlfriend. A shootout between treasury agents and the gang - they transport the hooch in manikins seated in a touring car - takes place in front of Harry's filling station. While Harry's gal stays outside, Harry carries the liquor-filled dummies into the station. Will there be a reward for the heroics of Harry and his honey?","simplePlot":"Revenuers have been chasing a gang of bootleggers for years. They're hot on the trail near a gas station operated by Harry, a seemingly slow witted fellow with a cheery and spunky ... ","actors":[{"actorName":"Harry Langdon","urlProfile":"http://www.imdb.com/name/nm0003377","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzUxOTUyMjEwMl5BMl5BanBnXkFtZTgwNjQ0MjI1MzE@._V1._CR106,140,533,716_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 June 1884","placeOfBirth":" Council Bluffs, Iowa, USA","height":"5' 7\" (1.7 m)","bio":"Langdon first performed when he ran away from home at the age of 12-13 to join a travelling medicine show. In 1903 he scored a lasting success in vaudeville with an act called \"Johnny's New Car\" which he performed for twenty years. In 1923, he signed with Principal Pictures as a series star, but transferred to Keystone when Mack Sennett bought the contract. Early in his film career, he had the good fortune to work regularly with the young Frank Capra. The two developed a unique character of an innocent man-child who found himself in dramatic and hazardous circumstances with only providence and good luck making him come out on top. This character clicked with the public and Langdon enjoyed a streak of artistic and commercial successes using it with Capra's direction. Unfortunately, he began to take the praise of his talent too seriously and broke with Capra so he could hog all the glory himself with his films. This proved to be a disasterous mistake as his first film \"Three's a Crowd\", a sickeningly sentimental film that plainly showed that he did not even approach the talent and skill of Capra which was needed to keep his character style viable. It has been also speculated the public was getting tired of Langdon's character, which contributed to Langdon's first solo film being an artistic and commericial failure. That film was the first in a series of bombs that ruined Langdon's career and relegated him to minor films from third string companies for the rest of his life.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzUxOTUyMjEwMl5BMl5BanBnXkFtZTgwNjQ0MjI1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003377","name":"Harry Langdon","nicknames":["The Sad Clown","The Little Elf"],"idIMDB":"nm0003377"},"actorId":"nm0003377","character":"Harry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edgar Kennedy","urlProfile":"http://www.imdb.com/name/nm0448012","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDE0ZDdlZjktYjVhYi00Y2I0LTk0YjAtZjExZjgzYjc5MTQ2XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1890","placeOfBirth":" Lake San Antonio, Monterey County, California, USA","birthName":"Edgar Livingstone Kennedy","height":"6' 1\" (1.85 m)","bio":"Edgar Kennedy, who was born on April 26, 1890, near Monterey, California, hit the road as a young man and traveled across the country, working in a succession of jobs. He became a professional boxer, claiming to have gone 14 rounds against The Manassas Mauler, Jack Dempsey. In addition to his knowledge of the \"Sweet Science\", Kennedy possessed a good musical voice, and wound up singing in musical shows in the Midwest, his first taste of show business. During his cross-country peregrinations he wound up in Los Angeles, and found himself hired as an actor by comedy producer Mack Sennett. At the Sennett Studios he was allegedly one of the original Keystone Kops, but soon graduated from bit parts to supporting roles in Keystone comedies, including Tillie's Punctured Romance (1914) with Charles Chaplin. Kennedy had good roles in other Chaplin movies, but when his contract expired in 1921 he went freelance, though he did occasionally return to Sennett. After leaving Sennett Kennedy established himself as a first-rate supporting comic, and made a career out of playing harassed businessmen, next-door neighbors, cops, etc. By the late 1920s his craft was most prominently featured in comedies for Hal Roach, Sennett's arch-rival, where he flourished in support of Stan Laurel and Oliver Hardy. It was with Roach that he developed his mastery of the \"slow burn\", a routine for which he became famous. He often played a none-too-bright policeman brought to the boiling point by the absurdities of Laurel and Hardy. He also directed the two in From Soup to Nuts (1928) and You're Darn Tootin' (1928). RKO hired Kennedy to appear in a series of comedy shorts called \"The Average Man,\" in which he played the head of a family. The shorts had very tight shooting schedules, often as few as three days, but Kennedy was always a pro and delighted the audience by giving them his all. He made over 200 short subjects and appeared in over 100 feature films, still in demand right up to the day he died of cancer on November 9, 1948.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDE0ZDdlZjktYjVhYi00Y2I0LTk0YjAtZjExZjgzYjc5MTQ2XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0448012","name":"Edgar Kennedy","nicknames":["King of the Slow Burn","Master of the Slow Burn"],"idIMDB":"nm0448012"},"actorId":"nm0448012","character":"Detective","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Judith Barrett","urlProfile":"http://www.imdb.com/name/nm0057184","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2Q2OGUyMzEtNzZmMi00OTllLWJhZjctMzE4OWMzMWI5Mzk4L2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 February 1909","placeOfBirth":" Arlington, Texas, USA","birthName":"Lucille Kelley","bio":"Judith Barrett was born on February 2, 1909 in Arlington, Texas, USA as Lucille Kelley. She was an actress, known for Road to Singapore (1940), Cimarron (1931) and Yellowstone (1936). She was married to Lindsay C. Howard and Cliff Edwards. She died on March 10, 2000 in Palm Desert, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2Q2OGUyMzEtNzZmMi00OTllLWJhZjctMzE4OWMzMWI5Mzk4L2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0057184","name":"Judith Barrett","idIMDB":"nm0057184"},"actorId":"nm0057184","character":"Harry's Girl","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0020687","urlIMDB":"http://www.imdb.com/title/tt0020687","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"20","month":"11","year":"1930","remarks":null},{"money":null,"country":null,"day":"29","month":"11","year":"1930","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["20 min"],"soundMix":["Mono (Western Electric Sound System)"],"color":["Black and White"],"aspectRatio":["1.20 : 1"],"camera":null,"laboratory":null,"filmLength":["600 m (2 reels) (USA)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.6","filmingLocations":[{"location":"Hal Roach Studios - 8822 Washington Blvd., Culver City, California, USA"}],"awards":[],"votes":"26","type":"Movie","companyCreditsSimple":[{"idCompany":"co0075561","name":"Hal Roach Studios"}],"keywords":{"keywords":["car","shootout","touring car","dummy","bootlegger","treasury agent","gas station","filling station","loud noise","inflated head","balloon","directions","bullet hole","spray","gin","bootleg liquor","bootleg","headless","headless doll","hit with a hammer","bashing in head","mannequin","bootleg whiskey","bootlegging","gunfight","machine gun","police","giving directions","petrol station","jalopy","noise","boyfriend girlfriend relationship","flapper","two reeler"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:15:16"}}