{"data":{"movies":[{"title":"Delta Fox","originalTitle":"","year":"1979","releaseDate":"197910","directors":[{"name":"Beverly Sebastian","id":"nm0780933"},{"name":"Ferd Sebastian","id":"nm0780944"}],"writers":[{"name":"Ferd Sebastian","id":"nm0780944"},{"name":"Beverly Sebastian","id":"nm0780933"}],"runtime":"93 min","countries":["USA"],"languages":["English"],"genres":["Crime","Drama"],"plot":"Woman is kidnaped by hitman who discovers that he is the target of another hitman.","simplePlot":"Woman is kidnaped by hitman who discovers that he is the target of another hitman.","actors":[{"actorName":"Stuart Whitman","urlProfile":"http://www.imdb.com/name/nm0926183","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzU1MDAzNTQ5NF5BMl5BanBnXkFtZTYwNDM2MjI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 February 1928","placeOfBirth":" San Francisco, California, USA","birthName":"Stuart Maxwell Whitman","height":"6' (1.83 m)","bio":"Stuart Maxwell Whitman is an American leading man, known for his rugged roles. He was born in San Francisco, California, the elder of two sons of Cecilia (Gold) and Joseph Whitman, a realtor. His mother was a Russian Jewish immigrant, while his paternal grandparents were Polish Jews. His family moved often. He graduated from high school in Los Angeles and spent three post-war years with the Army Corps of Engineers. In the army, he won 32 fights as a light-heavyweight boxer. Upon his discharge from service, he attended Los Angeles City College, where his interest in acting emerged. He studied at the Los Angeles Academy of Dramatic Art and with Michael Chekhov and Ben Bard. He toured the U.S. in a stage company of \"Here Comes Mr. Jordan\" and began to get small roles in television and film. Eventually his athleticism, his handsome features, and his talent for portraying either tough or vulnerable characters led him to a level of stardom. He earned an Academy Award nomination for his leading role of a child molester in The Mark (1961), and starred in the television series Cimarron Strip (1967). A shrewd investor, he amassed a substantial fortune while continuing his career even after its peak in the mid-Sixties.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzU1MDAzNTQ5NF5BMl5BanBnXkFtZTYwNDM2MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0926183","name":"Stuart Whitman","nicknames":["Stu"],"idIMDB":"nm0926183"},"actorId":"nm0926183","character":"The Counselor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Ireland","urlProfile":"http://www.imdb.com/name/nm0409869","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1OTY1MDk2MF5BMl5BanBnXkFtZTcwODMwMjkzNA@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 January 1914","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"John Benjamin Ireland","height":"6' 1\" (1.85 m)","bio":"Born in Canada, John Ireland was raised in New York. Performing as a swimmer in a water carnival, he moved into the legitimate theater, often appearing in minor roles in Broadway plays. His first big break in pictures came in 1945 when he appeared as Windy the introspective letter-writing G.I. in the classic war epic A Walk in the Sun (1945). Ireland was then often featured (mostly as a heavy) in several films. In 1949, he was nominated for best supporting actor for his role as the reporter in All the King's Men (1949). During the early 1950s, Ireland often starred as the emoting, brooding hero, almost exclusively in \"B\" pictures. In 1953, with his son Peter Ireland and wife, Joanne Dru, Ireland co-produced and co-directed the western mini-classic Hannah Lee: An American Primitive (1953) (aka Outlaw Territory). From the mid-'50s on. he appeared mainly in Italian \"quickie\" features and showed up occasionally in supporting roles in major pictures (Spartacus (1960)). Occasionally, his name was mentioned in tabloids of the times, in connection with young starlets, namely Natalie Wood and Sue Lyon. He was to play the role of the patriarch on the Ponderosa in Bonanza: The Next Generation (1988) but the series was not picked up. In addition to Hannah Lee: An American Primitive (1953), his best work was in Little Big Horn (1951) and The Bushwhackers (1951). In his later years, he owned and operated a tiny restaurant, Ireland's, in Santa Barbara, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1OTY1MDk2MF5BMl5BanBnXkFtZTcwODMwMjkzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0409869","name":"John Ireland","idIMDB":"nm0409869"},"actorId":"nm0409869","character":"Lucas Johnson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Jaeckel","urlProfile":"http://www.imdb.com/name/nm0001395","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNDk3OTkxOV5BMl5BanBnXkFtZTcwNjY0MjYwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1926","placeOfBirth":" Long Beach, Long Island, New York, USA","birthName":"Richard Hanley Jaeckel","height":"5' 7\" (1.7 m)","bio":"Stocky tough-guy character actor Richard Jaeckel remains one of Hollywood's most prolific supporting stars. Born in Long Island, New York, on October 10, 1926, Jaeckel's family moved to Los Angeles when he was still in his teens. After graduation from Hollywood High School, Jaeckel was discovered by a casting director while working as a mailboy for 20th Century-Fox. Although he had some reluctance to act, Jaeckel accepted a key part in the war epic Guadalcanal Diary (1943) and remained in films for over 50 years, graduating from playing baby-faced teenagers (like Dick Clark, Jaeckel never seemed to age) to gunfighters and hired killers with ease. From 1944-48 he served in the US Navy, and after his discharge he co-starred in Sands of Iwo Jima (1949) with John Wayne. Jaeckel's other notable roles in films include one of a trio of GIs accused of raping a German girl in Town Without Pity (1961)--a standout performance--and The Dirty Dozen (1967) as tough MP Sgt. Clyde Bowren, who goes along on the mission to keep an eye on the prisoners he's trained, a role he reprised in a made-for-TV sequel in 1985. Jaeckel also received an Academy Award nomination as Best Supporting Actor for his funny but tragic performance in Sometimes a Great Notion (1970). Although he appeared in over 70 films, he was very active in television series such as Frontier Circus (1961), Banyon (1971), Firehouse (1974), Salvage 1 (1979), At Ease (1983), Spenser: For Hire (1985) and Supercarrier (1988). From 1991-94 he played Lt. Ben Edwards on the hit series Baywatch (1989). He passed away after a three-year battle with melanoma cancer on June 14, 1997, at the Motion Picture and Television Hospital in Woodland Hills, California. Jaeckel was 70 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNDk3OTkxOV5BMl5BanBnXkFtZTcwNjY0MjYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001395","name":"Richard Jaeckel","nicknames":["Jake"],"idIMDB":"nm0001395"},"actorId":"nm0001395","character":"Santana","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Lynch","urlProfile":"http://www.imdb.com/name/nm0528433","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MjY3MzQ2MF5BMl5BanBnXkFtZTcwNzAzNDYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1940","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Richard Hugh Lynch","height":"6' (1.83 m)","bio":"Richard Hugh Lynch was born on February 12, 1940 in Brooklyn, New York City, to Irish immigrant parents. He was one of seven children. Before starting a career as an actor, he joined the United States Marine Corps in 1958. He served for four years where he made Corporal, and did a tour of the Middle East with the Sixth Fleet. He began his training with Herbert Berghof and Uta Hagen at H.B. Studios in New York's Greenwich Village, and later went on to train extensively with Lee Strasberg at Carnegie Hall. In 1970, he became a lifetime member of the Actors Studio and spent years in the New York theater community playing in dozens of on- and off-Broadway productions. The more notable plays were: \"The Basic Training of Pavlo Hummel\", \"The Lion in Winter\", \"The Devils\", \"The Lady from the Sea\", \"Action\", \"Live Like Pigs\", \"Richard III\", \"Offi on a Tangerine\", \"A View from the Bridge\", \"The Man with the Flower in His Mouth\", and Shelley Winters' \"One Night Stands of a Noisy Passenger\". Lynch made his film debut in the classic film Scarecrow (1973), winner of the Grand Prix Award at the Cannes Film Festival. His performance in Scarecrow launched his film career and brought him to Hollywood, where he has worked in film and television for over twenty years. His more prominent film work has been in: The Seven-Ups (1973), La chasse est ouverte (1974), La formule (1980), Invasion U.S.A. (1985), Bad Dreams (1988), Little Nikita (1988), Dostoyevsky's Crime and Punishment (2002), and William Peter Blatty's The Ninth Configuration (1980). His performance as the evil King Cromwell, in the successful fantasy film The Sword and the Sorcerer (1982), won him the Saturn Award for Best Actor from the Academy of Science Fiction and Fantasy. Although best known for playing villains, he was cast as the President of the United States in Mil Mascaras vs. the Aztec Mummy (2007). He also starred in numerous television series and Movies of the Week, such as Alcatraz: The Whole Shocking Story (1980), Sizzle (1981), Vampire (1979), Buck Rogers in the 25th Century (1979), Battlestar Galactica (1978), and the Star Trek: The Next Generation (1987) two-part episode \"Gambit\". His work in a variety of independent films has won him a high profile internationally. He has also worked in China, where he played in the first joint production between the Screen Actors' Guild and the People's Republic of China, The Korean Project. In his spare time, Richard enjoys fishing, the arts, architecture, music and poetry. He is also fluent in several languages including German and Italian.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MjY3MzQ2MF5BMl5BanBnXkFtZTcwNzAzNDYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0528433","name":"Richard Lynch","idIMDB":"nm0528433"},"actorId":"nm0528433","character":"David 'Delta' Fox","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Priscilla Barnes","urlProfile":"http://www.imdb.com/name/nm0055733","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNDc5ODU4Nl5BMl5BanBnXkFtZTgwMDg2Njg1MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 December 1955","placeOfBirth":" Fort Dix, New Jersey, USA","height":"5' 7\" (1.7 m)","bio":"Though probably not to her liking, actress Priscilla Barnes is best-known for her bittersweet replacement of TV goddess Suzanne Somers during the tension-riddled times of the popular ABC slapstick comedy series, Three's Company (1976) -- bittersweet in that although the lovely, stringy-framed blonde did become a TV name as a result, she had to endure the anguish of stepping into the shoes of an enormously popular star whose diva act had her unceremoniously dumped from the show when contractual negotiations went awry. It was not the happiest of times for Priscilla yet she managed to pull the whole thing off as nurse \"Terri Alden\", the pretty roommate and (along with co-star Joyce DeWitt), the other female foil to John Ritter's outrageous shenanigans. Priscilla chose to be her own person and allowed her character a bit more substance and intelligence than Somer's jiggly ding-a-ling \"Chrissy Snow\". If nothing else, the new girl on the block added a much-needed stability to an already emotionally wrought set and was accepted by the show's fans for a final three seasons. She and DeWitt developed a fast friendship, which lasted long after the show's demise. Interestingly, Priscilla had been previously turned down for the vapid \"Cindy Snow\" character (played by Jenilee Harrison) because she was perceived as \"too old\" for the role. Priscilla was born in Fort Dix, New Jersey, the daughter of an Air Force commander. An average student in school, the leggy beauty with the prominent cheekbones and intriguing slash of a mouth originally planned to become a dancer and joined a preteen group called the \"The Vivacious Vixens\", but a severe accident while performing on the Hollywood Bowl stage (she broke her leg and fractured her jaw) ended such dreams. During her formative years, she earned some attention as a beauty pageant contender (\"Miss Hollywood\", \"Miss San Bernardino\", \"Miss California\" (runner-up)) while paying her dues waitressing. A chance acquaintance with Peter Falk, who saw promise in the girl who countered her fresh-faced beauty with a self-deprecating wit, led to a bit part on one of his Columbo (1971) episodes, Columbo: A Deadly State of Mind (1975), in 1976, and the start of her professional career. The parts she nabbed typically accentuated her physical assets. A former Penthouse Pet for March 1976 (using the alias \"Joann Witty\"), Priscilla paid her dues via a series of unmemorable projects, including the films Texas Detour (1978), Delta Fox (1979) and The Seniors (1978) plus the short-lived TV series, The American Girls (1978), in which she played a smart-styled, traveling reporter. Handed a somewhat better supporting role in the Gene Wilder sequence of the four-part film, Les séducteurs (1980), she gathered more experience on such shows as Cannon (1971), Starsky and Hutch (1975), The Incredible Hulk (1978), The Rockford Files (1974), Kojak (1973), Taxi (1978) and The Love Boat (1977), before becoming a vital part of Three's Company (1976)'s 1981 cast. Barnes continued with the popular show in spite of her frustrations with producers and her dread of being typecast in innocuous comedy. Since then, she has maintained in a Hollywood that doesn't cater to women of \"maturing\" age, especially former TV stars. On TV, she added a feisty glamor to the series Dark Justice (1991), Viper (1996), Murder, She Wrote (1984) and other The Love Boat (1977) episodes. More often, however, she has shown up in a low-budget film. She has certainly taken on more than her fair share of horror projects, including Stepfather III (1992), Witch Academy (1995), The Backlot Murders (2002), Unseen Evil 2 (2004), The Devil's Rejects (2005), Trailer Park of Terror (2008) and Ed Gein: The Butcher of Plainfield (2007), in which some of her characters have met grisly ends. One film highlight was her featured role, not as a Bondian girl but as the bride of a CIA agent (David Hedison), who is shot to death on her wedding day, in the Timothy Dalton \"007\" film, Licence to Kill (1989). She also enjoyed a role as a quirky fortune teller in Mallrats (1995). Active on the theater scene over the years with credits such as \"Born Yesterday\", \"Vanities\", \"Bus Stop\" and \"A Streetcar Named Desire\" under her belt, she recently played Hillary Clinton in the 2007 black comedy, \"Hillary Agonistes\", in New York. She has been married to actor Ted Monte since 2003.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNDc5ODU4Nl5BMl5BanBnXkFtZTgwMDg2Njg1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0055733","name":"Priscilla Barnes","idIMDB":"nm0055733"},"actorId":"nm0055733","character":"Karen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Julius Harris","urlProfile":"http://www.imdb.com/name/nm0364918","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDUwODE2NF5BMl5BanBnXkFtZTcwNTYwOTA0NA@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 August 1923","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"6' 3½\" (1.92 m)","bio":"Prior to breaking into films, Philadelphia native Julius Harris worked as a bouncer in New York City. It was due to his many associations with struggling actors, that on a dare, Harris auditioned for his first role, in the well-received picture Nothing But a Man (1964), in which he played a father in the South, alongside Ivan Dixon and Abbey Lincoln. After, this, the 40+ year old Harris' impressive physique and deep voice helped enable him to rack up numerous appearances in the then popular blaxploitation genre. It was Harris' strong appearance in supporting roles in such low-budget films as Shaft's Big Score! (1972), Super Fly (1972), and Black Caesar (1973), which helped springboard him into better quality productions. Harris scored a co-starring role in the first Roger Moore James Bond film Live and Let Die (1973), in which his portrayal of the bald-headed, grinning villain \"Tee Hee\", with the menacing artificial arm, has been one of the more fondly remembered heavies of the entire Bond series. More work quickly followed for Harris, including NYPD \"Inspector Daniels\" in the original The Taking of Pelham One Two Three (1974), King Kong (1976), and Looking for Mr. Goodbar (1977). In addition to his film work, he was guest-starring in numerous TV shows, including Harry O (1973), Sanford and Son (1972), Cannon (1971), Good Times (1974), and Kojak (1973). Harris continued working throughout the 1980s in a mixture of different character roles, although the 1990s proved to be a leaner period for him. Julius Harris passed away on 17th October 2004 from heart failure, at the age of 81. He was cremated and then interred in his hometown, and is survived by his daughter Kimberly, and son Gideon.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDUwODE2NF5BMl5BanBnXkFtZTcwNTYwOTA0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0364918","name":"Julius Harris","idIMDB":"nm0364918"},"actorId":"nm0364918","character":"Tiny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tracy Sebastian","urlProfile":"http://www.imdb.com/name/nm0780975","urlPhoto":"","biography":{"bio":"Tracy Sebastian is an actor, known for Running Cool (1993), On the Air Live with Captain Midnight (1979) and 'Gator Bait (1974).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0780975","name":"Tracy Sebastian","idIMDB":"nm0780975"},"actorId":"nm0780975","character":"Filling Station Attendant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Damon Reicher","urlProfile":"http://www.imdb.com/name/nm1059288","urlPhoto":"","biography":{"bio":"Damon Reicher is an actor, known for Delta Fox (1979) and We've Got Each Other (1977).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1059288","name":"Damon Reicher","idIMDB":"nm1059288"},"actorId":"nm1059288","character":"Baskins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Larry Gelman","urlProfile":"http://www.imdb.com/name/nm0312475","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MzUzOTY1NF5BMl5BanBnXkFtZTgwMTc2NzEyMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1930","placeOfBirth":" Brooklyn, New York, USA","birthName":"Lawrence Sheldon Gelman","bio":"Larry Gelman was born on November 3, 1930 in Brooklyn, New York, USA as Lawrence Sheldon Gelman. He is an actor, known for Dreamscape (1984), Mr. Saturday Night (1992) and Tales from the Catholic Church of Elvis! (2009). He is married to Barbara.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MzUzOTY1NF5BMl5BanBnXkFtZTgwMTc2NzEyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0312475","name":"Larry Gelman","idIMDB":"nm0312475"},"actorId":"nm0312475","character":"Rudy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Lockmeister","urlProfile":"http://www.imdb.com/name/nm1058845","urlPhoto":"","biography":{"bio":"Richard Lockmeister is an actor, known for Delta Fox (1979).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1058845","name":"Richard Lockmeister","idIMDB":"nm1058845"},"actorId":"nm1058845","character":"Todd","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Susan Holloway","urlProfile":"http://www.imdb.com/name/nm0391366","urlPhoto":"","biography":{"bio":"Susan Holloway is known for her work on Point Blank (1967), When the Boys Meet the Girls (1965) and Delta Fox (1979).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0391366","name":"Susan Holloway","idIMDB":"nm0391366"},"actorId":"nm0391366","character":"Counselor's Girl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Newell Alexander","urlProfile":"http://www.imdb.com/name/nm0018646","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI2Mzc2MzkzOF5BMl5BanBnXkFtZTgwMTk3NjU1NjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 September 1935","placeOfBirth":" Borger, Texas, USA","height":"5' 11\" (1.8 m)","bio":"Newell Alexander's stage credits include the original productions of Del Shores' \"Cheatin',\" \"Daddy's Dyin' Who's Got the Will?\" (and also the film version), \"Sordid Lives\" (and also the film version) and \"Southern Baptist Sissies\". Newell's TV work includes recurring roles on Big Love (2006) for HBO, Arrested Development (2003), Alias (2001) and Walker, Texas Ranger (1993). He is a principal member of the \"L.A. MadDogs\", one of the industry's busiest voice-over groups (Ray (2003), Shark Tale (2004), Shrek (2001), Shrek 2 (2004), Madagascar (2005), Kill Bill: Vol. 1 (2003), Kill Bill: Vol. 2 (2004), among others). Has has also voiced commercials for such companies as Smith Barney, CVS Phamacy, Cool Whip, Aleve, Pfizer, Acura, Coca-Cola, Wells Fargo Bank and Washington Apples. Newell is the George W. Bush sound-alike for MoveOn.org. He plays Gen. Sam Houston as the host of the Texas History Museum's \"Texas Hall of Heroes\" at the State Capitol in Austin. He has produced and performed in 33 hour-long radio dramas for the Autry Museum of Western Heritage for PBS. Newell performed as Neil Young's opening act \"Dan Clear\" for 70 shows in 1983-84. He and his wife Rosemary share five children and seven grandchildren.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI2Mzc2MzkzOF5BMl5BanBnXkFtZTgwMTk3NjU1NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0018646","name":"Newell Alexander","idIMDB":"nm0018646"},"actorId":"nm0018646","character":"Winters","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Bellah","urlProfile":"http://www.imdb.com/name/nm0068652","urlPhoto":"","biography":{"bio":"John Bellah is an actor, known for Red Dead Redemption (2010), Triangle (1970) and Red Dead Redemption: The Man from Blackwater (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0068652","name":"John Bellah","idIMDB":"nm0068652"},"actorId":"nm0068652","character":"Captain","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jacob Bensussen","urlProfile":"http://www.imdb.com/name/nm4482926","urlPhoto":"","biography":{"bio":"Jacob Bensussen is an actor, known for Delta Fox (1979).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4482926","name":"Jacob Bensussen","idIMDB":"nm4482926"},"actorId":"nm4482926","character":"Boy on Wharf","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alex Henderson","urlProfile":"http://www.imdb.com/name/nm4482964","urlPhoto":"","biography":{"bio":"Alex Henderson is an actor, known for Delta Fox (1979).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4482964","name":"Alex Henderson","idIMDB":"nm4482964"},"actorId":"nm4482964","character":"Boy on Wharf","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0075929","urlIMDB":"http://www.imdb.com/title/tt0075929","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 33 min (93 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arriflex Cameras and Lenses"],"laboratory":["Consolidated Film Industries (CFI), Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.6","filmingLocations":[{"location":"San Francisco, California, USA"}],"rated":"R","awards":[],"votes":"45","type":"Movie","companyCreditsSimple":[{"idCompany":"co0030004","name":"Delta Fox Productions"},{"idCompany":"co0022436","name":"Sebastian International Pictures"}],"keywords":{"keywords":["hitman","f rated","explosion","yacht","money","machine gun","dynamite","truck","telephone call","shootout","porsche","handgun","female nudity","kidnapping","independent film","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 04:27:03"}}