{"data":{"movies":[{"title":"Billion Dollar Brain","originalTitle":"","year":"1967","releaseDate":"19681011","directors":[{"name":"Ken Russell","id":"nm0001692"}],"writers":[{"name":"Len Deighton","id":"nm0215050"},{"name":"John McGrath","id":"nm0569819"}],"runtime":"111 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MzQ3ODE2Ml5BMl5BanBnXkFtZTcwNzQwMDEzMQ@@._V1.jpg","countries":["UK"],"languages":["English","Russian","Finnish"],"genres":["Crime","Thriller"],"plot":"Harry Palmer has left the British Secret Service and become a private detective. One of his first assignments is to deliver an apparently innocent thermos flask to an old friend in Helsinki, Palmer is suspicious of the flask contents and begins to doubt the motives of his friend and those of his boss a Texan billionaire.","simplePlot":"A former British spy stumbles into in a plot to overthrow Communism with the help of a supercomputer. But who is working for whom?","actors":[{"actorName":"Michael Caine","urlProfile":"http://www.imdb.com/name/nm0000323","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzIwNTQ4Ml5BMl5BanBnXkFtZTYwMzE1MTUz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1933","placeOfBirth":" Rotherhithe, London, England, UK","birthName":"Maurice Joseph Micklewhite","height":"6' 1\" (1.85 m)","bio":"Michael Caine was born Maurice Joseph Micklewhite in London, to Ellen Frances Marie (Burchell), a charlady, and Maurice Joseph Micklewhite, a fish-market porter. He left school at 15 and took a series of working-class jobs before joining the British army and serving in Korea during the Korean War, where he saw combat. Upon his return to England he gravitated toward the theater and got a job as an assistant stage manager. He adopted the name of Caine on the advice of his agent, taking it from a marquee that advertised The Caine Mutiny (1954). In the years that followed he worked in more than 100 television dramas, with repertory companies throughout England and eventually in the stage hit, \"The Long and the Short and the Tall.\" Zulu (1964), the 1964 epic retelling of a historic 19th-century battle in South Africa between British soldiers and Zulu warriors, brought Caine to international attention. Instead of being typecast as a low-ranking Cockney soldier, he played a snobbish, aristocratic officer. Although \"Zulu\" was a major success, it was the role of Harry Palmer in The Ipcress File (1965) and the title role in Alfie (1966) that made Caine a star of the first magnitude. He epitomized the new breed of actor in mid-'60s England, the working-class bloke with glasses and a down-home accent. However, after initially starring in some excellent films, particularly in the 1960s, including Gambit (1966), Funeral in Berlin (1966), Play Dirty (1969), Battle of Britain (1969), Too Late the Hero (1970), The Last Valley (1971) and especially Get Carter (1971), he seemed to take on roles in below-average films, simply for the money he could by then command. There were some gems amongst the dross, however. He gave a magnificent performance opposite Sean Connery in The Man Who Would Be King (1975) and turned in a solid one as a German colonel in The Eagle Has Landed (1976). Educating Rita (1983) and Hannah and Her Sisters (1986) (for which he won his first Oscar) were highlights of the 1980s, while more recently Little Voice (1998), The Cider House Rules (1999) (his second Oscar) and Last Orders (2001) have been widely acclaimed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzIwNTQ4Ml5BMl5BanBnXkFtZTYwMzE1MTUz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000323","name":"Michael Caine","idIMDB":"nm0000323"},"actorId":"nm0000323","character":"Harry Palmer","urlCharacter":"http://www.imdb.com/character/ch0021349","main":true},{"actorName":"Karl Malden","urlProfile":"http://www.imdb.com/name/nm0001500","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MjY3Njk5Ml5BMl5BanBnXkFtZTYwNTYwMzI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1912","placeOfBirth":" Chicago, Illinois, USA","birthName":"Mladen George Sekulovich","height":"6' 1½\" (1.87 m)","bio":"Born to a Czech mother and a Serbian father in Chicago, on March 22, 1912, Karl Malden didn't learn how to communicate a single word of English until he was in kindergarten. Raised in Gary, IN, a medium-sized steel town, Malden--like many other young men in Gary--got a job in a steel factory when he finished school. He worked there for three years until 1934 when, fed up with the drudgery of manual labor, he took a Depression-era gamble and left to follow another goal. After a short time at Arkansas State Teacher's College, he attended the Goodman Theater Dramatic School and never looked back. Three years later he went to New York City to find fame. He rapidly became involved with the Group Theater, an awesome organization of actors/directors who were changing the face of Broadway. Malden's own unforgettable face was shortly in the media when he made his stage debut in 1937. His performance attracted the attention of fledgling director Elia Kazan. With Kazan directing, Karl blazed a trail across the Broadway boards in plays like \"All My Sons\" by Arthur Miller and \"A Streetcar Named Desire\" by Tennessee Williams. He returned unscathed from duty in the armed services and then immersed himself in his work. Fortunately, his short \"vacation\" had not harmed his career. From the \"Golden Era\" of Broadway, he made a transition to the screen, starting with his first appearance in They Knew What They Wanted (1940). Jobs came came and fast, and in 1951 he won the Oscar for his performance as Mitch in A Streetcar Named Desire (1951). He was showing himself to be a consummate performer, whether tackling roles that had to be delivered with great moral weight or those requiring none whatsoever, like that of Father Corrigan in On the Waterfront (1954) or the Southern lecher Archie Lee in Baby Doll (1956). A later role came as Capt. Wessels, in John Ford's Cheyenne Autumn (1964). The film, Ford's last, was shot in his beloved Monument Valley. Malden found his greatest fame, however, in the early 1970s on the small screen, as Det. Mike Stone in the hit series The Streets of San Francisco (1972), co-starring with future movie star Michael Douglas. He came into millions of homes every week for five years. He also became the pitchman for American Express, a position he held for 21 years. The crowning glory of his career was in 1988 when he was elected President of the Academy of Motion Picture Arts and Sciences, a title he held for five years. Not one to rest on his laurels, Malden recently wrote his memoir entitled, \"When Do I Start?: A Memoir.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MjY3Njk5Ml5BMl5BanBnXkFtZTYwNTYwMzI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001500","name":"Karl Malden","idIMDB":"nm0001500"},"actorId":"nm0001500","character":"Leo Newbigen","urlCharacter":"http://www.imdb.com/character/ch0021350","main":true},{"actorName":"Ed Begley","urlProfile":"http://www.imdb.com/name/nm0003225","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTM0Njg2N15BMl5BanBnXkFtZTcwNzgzNzg1MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 March 1901","placeOfBirth":" Hartford, Connecticut, USA","birthName":"Edward James Begley","height":"5' 7\" (1.7 m)","bio":"Charismatic character star Edward James Begley was born in Hartford, Connecticut of Irish parents and educated at St.Patrick's school. His interest in acting first surfaced at the age of nine, when he performed amateur theatricals at the Hartford Globe Theatre. Determined to make his own way, he left home aged eleven and drifted from job to job, had a four-year stint in the U.S. Navy, then worked in a bowling alley replacing pins, joined carnivals and circuses. In 1931, he appeared in vaudeville and was also hired as a radio announcer, his voice broadcast to nationwide audiences. It took him several years to establish himself on the legitimate stage, but in 1943, he had a role in the short-running play 'Land of Fame'. His first success was the 1947 Arthur Miller play 'All My Sons' and this was followed by the 1925 Scopes Trial fictionalisation 'Inherit the Wind' (1955-57), which ran for 806 performances at the National Theatre. Ed, co-starring with Paul Muni, played the part of Matthew Harrison Brady (played in the 1960 motion picture by Fredric March) and won the 1956 Tony Award for Best Featured Actor in a Play. Upon Paul Muni's departure from the cast, Ed used the opportunity to play the part of Henry Drummond (Spencer Tracy's role in the film) with equal vigour. In 1960, he starred as Senator Orrin Knox in the political drama 'Advise and Consent'. Ed's movie career began with Boomerang! (1947), a murder mystery set in his native Connecticut, directed by Elia Kazan. Heavy-set and with bushy eyebrows, the archetypal image of Ed Begley on screen is as a gruff, blustery, often heavily sweating (and sometimes corrupt) politician or industrialist. He proved his mettle in a number of classic films, including Sorry, Wrong Number (1948) and On Dangerous Ground (1951). Whether as the sympathetic executive in Patterns (1956), a bigoted ex-cop turned bank robber in Odds Against Tomorrow (1959), or the crazed billionaire bent on world domination of Billion Dollar Brain (1967), he tackled every part that came his way with conviction. The culmination of his work was a Best Supporting Actor Academy Award for his role of Boss Finley in Tennessee Williams's Sweet Bird of Youth (1962). In addition to countless radio broadcasts, Ed was also busy in television in the 1950's and 60's. Among frequent guest starring appearances, his dynamic characterisations in two episodes of The Invaders (1967) ('The Betrayed' and 'Labyrinth') stand out in particular. Ed Begley died of a heart attack in April 1970 in Hollywood at the age of 69.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTM0Njg2N15BMl5BanBnXkFtZTcwNzgzNzg1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003225","name":"Ed Begley","idIMDB":"nm0003225"},"actorId":"nm0003225","character":"Gen. Midwinter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Oskar Homolka","urlProfile":"http://www.imdb.com/name/nm0393028","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDllZTEwMTUtZDMwOS00MmI5LThmM2EtNDI5MmJkNTA4MmU5XkEyXkFqcGdeQXVyMzAwOTU1MTk@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 August 1898","placeOfBirth":" Vienna, Austria-Hungary [now Austria]","bio":"Because of his heavy generically \"European\" accent and Slavic-sounding surname (not an uncommon one among Czechs or Slovaks), many people assumed Oscar Homolka was Eastern European or Russian. In fact, he was born in Vienna (then Austria-Hungary), the multicultural capital of a large multi-ethnic empire at the time. It was there he began his successful stage career, which eventually led him to Hollywood. Homolka was one of the many Austrian and specifically Viennese actors (many of them Jewish) who fled Europe for the U.S. with the rise to power of Adolf Hitler and the Nazi party. Although often typecast in villainous roles - Communist spies, Soviet-bloc military officers or scientists and the like - he was nominated for an Oscar for his portrayal of Uncle Chris in I Remember Mama (1948).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDllZTEwMTUtZDMwOS00MmI5LThmM2EtNDI5MmJkNTA4MmU5XkEyXkFqcGdeQXVyMzAwOTU1MTk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0393028","name":"Oskar Homolka","idIMDB":"nm0393028"},"actorId":"nm0393028","character":"Col. Stok","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Françoise Dorléac","urlProfile":"http://www.imdb.com/name/nm0233753","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NTM3MDU3M15BMl5BanBnXkFtZTYwMDkyNDI2._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 March 1942","placeOfBirth":" Paris, France","height":"5' 7¾\" (1.72 m)","bio":"The radiant Francoise Dorleac is better remembered today as the elder, ill-fated sister of French film star Catherine Deneuve. The Paris-born actress, however, was actually the first to become a star and had quite a formidable career of her own in the 1960s until it was cut short. Born into a theatrical family in 1942 (her father was actor Maurice Dorléac), Francoise first appeared on stage at the age of 10. Entering the film industry with the movie short Mensonges (1957), she studied at the Conservatoire d'Art Dramatique (1959-1961) and had modeled for Christian Dior by the time she started making any kind of cinematic impact. Slim, gamine, pale-skinned and a real brunette stunner, Francoise graced a number of movies before hitting celebrity stardom with François Truffaut's melodrama The Soft Skin (1964) [La Peau Douce] and the classic James Bond-like spy spoof That Man from Rio (1964) [L'Homme de Rio], both released in 1964. The two films showed the polar sides of Francoise's incredible allure and talent. In the former she played an airline stewardess who falls into a tragic affair with a married businessman (Jean Desailly) and in the latter she played a fun and flaky heroine opposite Jean-Paul Belmondo. Unlike Catherine, Francoise proved a carefree, outgoing presence both on and off camera. Known for her chic, stylish ways and almost unbridled sense of joie-de-vivre, she continued making strong marks as the adulterous wife in Roman Polanski's black comedy Cul-De-Sac (1966) and even joined Gene Kelly, George Chakiris, and her sister, who was now a cinematic star by this time too, in the rather candy-coated The Young Girls of Rochefort (1967) [Les Demoiselle de Rochefort], a colorful movie which paid homage to the Hollywood musical. She and Catherine, who looked quite similar, played singing twins who dream about living in Paris. Her fun and funny side was always an asset and often revealed as in the films as Arsène Lupin contre Arsène Lupin (1962) and Male Hunt (1964) [La Chasse à l'Homme ]. Branching out now in such non-French movies as Genghis Khan (1965), Where the Spies Are (1966), and Billion Dollar Brain (1967), the luminous Francoise was on the brink of international stardom when her rental car flipped and burned on a roadway in Nice, France on June 26, 1967. She was near completion of the last film mentioned at the time the accident occurred. Her part in the movie was left intact. Her early death at age 25 most certainly robbed the cinema of a tried and true talent and incomparably beautiful mademoiselle who showed every sign of taking Hollywood by storm, as Catherine later did.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NTM3MDU3M15BMl5BanBnXkFtZTYwMDkyNDI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0233753","name":"Françoise Dorléac","idIMDB":"nm0233753"},"actorId":"nm0233753","character":"Anya","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Guy Doleman","urlProfile":"http://www.imdb.com/name/nm0230934","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NjYwODEyMl5BMl5BanBnXkFtZTgwNzAxNjIwMjE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1923","placeOfBirth":" Hamilton, New Zealand","bio":"Tough-looking New Zealander, with a long string of credits as an actor in Australian films and theatre. He was also prolific on radio as actor, announcer and compère. In August 1952, Doleman won a £300 prize for his performance in an Actor's Choice half-hourly play, entitled \"The Coward\". He used this as a travelling fund for a trip to Hollywood and was duly cast in a supporting role in the adventure film His Majesty O'Keefe (1954). That was followed by an uncredited bit in Alfred Hitchcock's Dial M for Murder (1954). More substantial roles, however, failed to materialise. Doleman consequently returned to Australia, where he found regular work on radio and on stage in Sydney, Melbourne and Adelaide, between 1957 and 1960. Doleman had his best spell in Britain in the 1960's: fondly remembered as SPECTRE operative Count Lippe in the James Bond movie Thunderball (1965), and as the hard-edged spook Colonel Ross in the Harry Palmer trilogy, beginning with The Ipcress File (1965). In a similar vein, he also made a worthy antagonist for Patrick McGoohan as the first 'Number 2' in The Prisoner (1967). Doleman eventually settled in Los Angeles, where he died of lung cancer in January 1996.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NjYwODEyMl5BMl5BanBnXkFtZTgwNzAxNjIwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0230934","name":"Guy Doleman","idIMDB":"nm0230934"},"actorId":"nm0230934","character":"Col. Ross","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vladek Sheybal","urlProfile":"http://www.imdb.com/name/nm0792996","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODhiMjU4MTQtZGI0MS00NDk5LWI4NGItNWQ4ODY2MjkwMjE3XkEyXkFqcGdeQXVyMTc4MzI2NQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 March 1923","placeOfBirth":" Zgierz, Lódzkie, Poland","birthName":"Wladyslaw Sheybal","bio":"Looking back at his filmography, it isn't difficult to imagine Vladek Sheybal in a scene, lobbing Molotov cocktails at advancing German troops, against a backdrop of war-torn Warsaw. However, this part of his life played out for real. A member of the Polish underground, he was twice captured and interred in concentration camps. Both times he escaped. After the war, he was undecided about whether to become a doctor or an actor. His father, a painter and professor of Fine Arts, put pressure on him to become an architect. Acting won out, of course, and Vladek spent six months at the prestigious Stanislavsky School of Acting and a further four years to complete his training at the Drama Director's School. By the time he shared a dressing room with Roman Polanski on stage at the National Theatre in Warsaw, he had become one of Poland's leading actors. He was first acclaimed on screen in Andrzej Wajda's story of the Polish Resistance during the 1944 Warsaw Uprising, Kanal (1957). Ironically, by his own admission, Vladek had 'not a drop of Polish blood' in him, his ethnic background being a mixture of Armenian, Scottish and Austrian. He spoke fluent French, Italian and German before ever learning English. Taking advantage of a scholarship to perfect his craft, Vladek went to England in the early 1960's and decided to stay. His limited command of English and a lack of connections forced him to take on a number of menial jobs. With his last ten pounds in his pocket, he went to Oxford to study English literature. As his English improved, he began to teach drama. Before long, his successful staging of a Russian play at the Oxford University Opera Club led to a job with the BBC as actor/director. Prompted by Sean Connery (whose then-girlfriend Diane Cilento Vladek had directed on stage), he reluctantly took the part of chess grandmaster and SPECTRE agent Kronsteen in From Russia with Love (1963), emerging as one of the most memorable of the early James Bond villains. With his cultured voice, sharp nose and piercing, hypnotic eyes, Vladek's became one of the most recognisable faces on screen in the 60's and 70's. For the most part, he was typecast in sardonic, sinister or eccentric roles, tailor-made as Central European or Soviet spies, in both episodic television (eg The Saint (1962), Secret Agent (1964)) and motion pictures (eg S*P*Y*S (1974)). Perfecting his trademark screen personae was partly down to advice from actress Bette Davis, who, according to a 1992 interview in FAB magazine, instructed him to 'narrow his eyes, lower his voice to a whisper and make long pauses'. Affecting these mannerisms served him well, even when he was not playing the bad guy. On several occasions, he appeared in films by Ken Russell, notably as the decadent sculptor Loerke, in Women in Love (1969), and as the Cecil B. DeMille caricature De Thrill, in The Boy Friend (1971). He was also the arcane, enigmatic psychiatrist Dr. Doug Jackson, in Gerry Anderson's cult sci-fi series UFO (1970) (a part he secured after having previously played a similar character in the movie Journey to the Far Side of the Sun (1969) for the same production team). In 1977, he was presented by The Dracula Society with the Hamilton Deane Award for his performance as a creepy innkeeper in an episode of the short-lived anthology series Supernatural (1977). The prize was presented to him by none other than Christopher Lee. During the latter stages of his career, Vladek revisited the stage, appearing in fringe venues in London in the title role of \"Mahler\" (1973), as Shylock in \"Variations on The Merchant of Venice\" (1977) and as Friedrich Nietzsche in \"The Eagle and the Serpent\" (1988). He also taught acting classes at the London Academy of TV and made several forays into French cinema as middle-aged men obsessed with younger women. A consummate perfectionist at his craft and one of the great European character actors, Vladek died unexpectedly in October 1992 at his home in London, aged 69.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODhiMjU4MTQtZGI0MS00NDk5LWI4NGItNWQ4ODY2MjkwMjE3XkEyXkFqcGdeQXVyMTc4MzI2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0792996","name":"Vladek Sheybal","idIMDB":"nm0792996"},"actorId":"nm0792996","character":"Dr. Eiwort","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Milo Sperber","urlProfile":"http://www.imdb.com/name/nm0818269","urlPhoto":"","biography":{"dateOfBirth":"20 March 1911","placeOfBirth":" Poland","bio":"Milo Sperber was born on March 20, 1911 in Poland. He was an actor and writer, known for The Spy Who Loved Me (1977), Providence (1977) and Billion Dollar Brain (1967). He died on December 22, 1992 in Camden, London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0818269","name":"Milo Sperber","idIMDB":"nm0818269"},"actorId":"nm0818269","character":"Basil","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Janos Kurutz","urlProfile":"http://www.imdb.com/name/nm0476101","urlPhoto":"","biography":{"bio":"Janos Kurutz is an actor, known for Billion Dollar Brain (1967).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0476101","name":"Janos Kurutz","idIMDB":"nm0476101"},"actorId":"nm0476101","character":"Latvian Gangster","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexei Jawdokimov","urlProfile":"http://www.imdb.com/name/nm0419532","urlPhoto":"","biography":{"bio":"Alexei Jawdokimov is an actor, known for The Eagle Has Landed (1976), Firefox (1982) and Defense of the Realm (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0419532","name":"Alexei Jawdokimov","idIMDB":"nm0419532"},"actorId":"nm0419532","character":"Latvian Gangster","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Tamarin","urlProfile":"http://www.imdb.com/name/nm0848470","urlPhoto":"","biography":{"bio":"Paul Tamarin is an actor, known for Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb (1964), The Great Gatsby (1974) and The Bedford Incident (1965).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0848470","name":"Paul Tamarin","idIMDB":"nm0848470"},"actorId":"nm0848470","character":"Latvian Gangster","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Iza Teller","urlProfile":"http://www.imdb.com/name/nm0854429","urlPhoto":"","biography":{"bio":"Iza Teller is an actress, known for The Devils (1971), Billion Dollar Brain (1967) and The Flying Swan (1965).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0854429","name":"Iza Teller","idIMDB":"nm0854429"},"actorId":"nm0854429","character":"Latvian Gangster","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Elwes","urlProfile":"http://www.imdb.com/name/nm0255895","urlPhoto":"","biography":{"dateOfBirth":"13 April 1931","placeOfBirth":" Staines, Middlesex, England, UK","birthName":"Mark Gervase Elwes","bio":"Mark Elwes was born on April 13, 1931 in Staines, Middlesex, England as Mark Gervase Elwes. He is an actor, known for A Fish Called Wanda (1988), Billion Dollar Brain (1967) and Every Home Should Have One (1970). He has been married to Valerie Bland since 1963. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0255895","name":"Mark Elwes","idIMDB":"nm0255895"},"actorId":"nm0255895","character":"Birkenshaw","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stanley Caine","urlProfile":"http://www.imdb.com/name/nm0129010","urlPhoto":"","biography":{"dateOfBirth":"1935","placeOfBirth":" Southwark, London, England, UK","birthName":"Stanley Victor Micklewhite","bio":"Stanley Caine was born in 1935 in Southwark, London, England as Stanley Victor Micklewhite. He was an actor, known for The Italian Job (1969), Billion Dollar Brain (1967) and Play Dirty (1969). He died on January 13, 2013 in Ruislip, London.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0129010","name":"Stanley Caine","idIMDB":"nm0129010"},"actorId":"nm0129010","character":"G.P.O. Special Delivery Boy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gregg Palmer","urlProfile":"http://www.imdb.com/name/nm5354435","urlPhoto":"","biography":{"bio":"Gregg Palmer is an actor, known for Billion Dollar Brain (1967) and Doctor Who (1963).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5354435","name":"Gregg Palmer","idIMDB":"nm5354435"},"actorId":"nm5354435","character":"First Dutch Businessman","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0061405","urlIMDB":"http://www.imdb.com/title/tt0061405","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":[{"money":"175,643 (France)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"623,653 (Spain)","country":"","day":null,"month":null,"year":null,"remarks":null}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"\"Billion Dollar Brain\" copyright MCMLXVII Jovera S.A."},"technical":{"runtime":["1 hr 51 min (111 min)"],"soundMix":["Mono"],"color":["Color (as De Luxe)"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["Technicolor"],"filmLength":["2,975 m (1968) (Finland)","3,044.95 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm"]},"rating":"6.1","filmingLocations":[{"location":"Senaatintori, Helsinki, Finland"}],"awards":[],"votes":"3,628","type":"Movie","companyCreditsSimple":[{"idCompany":"co0021153","name":"Jovera"},{"idCompany":"co0103357","name":"Lowndes Productions Limited"}],"keywords":{"keywords":["british","spy","private detective","harry palmer","texan","soviet union","thermos","texas","computer","chess","political thriller","music score features piano","reference to william shakespeare","zoom lens","vodka","virus","train station","third in trilogy","telescope sight","succulent","stabbed in the back","shakespearean quotation","russian spy","playboy playmate","mi5","lenin","last of series","kgb","hockey player","high powered rifle","greenhouse","frozen sea","erotic art","detective series","convoy","contrarevolution","cello","blackmail","biological warfare","airport terminal","third part","x ray","snowmobile","latvia","anti communist","war criminal","suicide","sniper","shootout","shooting range","secret agent","sauna","russian","riga latvia","revolutionary","refinery","murder","military officer","london england","locker","invasion","hotel","helsinki finland","helicopter","fascism","falling through ice","extramarital affair","espionage","embezzlement","egg","double cross","cold war","classical concert","car in water","car accident","bonfire","biological weapon","baltic sea","airport","train","private army","sequel","based on novel","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:01:14"}}