{"data":{"movies":[{"title":"The Friends of Eddie Coyle","originalTitle":"","year":"1973","releaseDate":"19730627","directors":[{"name":"Peter Yates","id":"nm0946811"}],"writers":[{"name":"George V. Higgins","id":"nm0383389"},{"name":"Paul Monash","id":"nm0597574"}],"runtime":"102 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmNiZDZhNzQtNGYyMC00OTJiLTkyNjItOGNjOTU4NjAzMGU1XkEyXkFqcGdeQXVyNTI4MjkwNjA@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama"],"plot":"Eddie's friends are numerous, but the term friends is suspect. As a small time hood Eddie is about to go back to jail. In order to escape this fate he deals information on stolen guns to the feds. Simultaneously he is supplying arms to his bank robbing/kidnapping hoodlum chums. But who else is dealing with the feds? Who gets the blame for snitching on the bank robbers?","simplePlot":"After his last crime has him looking at a long prison sentence for repeat offenses, a low level Boston gangster decides to snitch on his friends to avoid jail time.","actors":[{"actorName":"Robert Mitchum","urlProfile":"http://www.imdb.com/name/nm0000053","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTI1NDIxOTQyMV5BMl5BanBnXkFtZTYwMDM4MjM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1917","placeOfBirth":" Bridgeport, Connecticut, USA","birthName":"Robert Charles Durman Mitchum","height":"6' 1\" (1.85 m)","bio":"Robert Mitchum was an underrated American leading man of enormous ability, who sublimated his talents beneath an air of disinterest. He was born in Bridgeport, Connecticut, to Ann Harriet (Gunderson), a Norwegian immigrant, and James Thomas Mitchum, a shipyard/railroad worker. His father died in a train accident when he was two, and Robert and his siblings (including brother John Mitchum, later also an actor) were raised by his mother and stepfather (a British army major) in Connecticut, New York, and Delaware. An early contempt for authority led to discipline problems, and Mitchum spent good portions of his teen years adventuring on the open road. On one of these trips, at the age of 14, he was charged with vagrancy and sentenced to a Georgia chain gang, from which he escaped. Working a wide variety of jobs (including ghostwriter for astrologist Carroll Righter), Mitchum discovered acting in a Long Beach, California, amateur theater company. He worked at Lockheed Aircraft, where job stress caused him to suffer temporary blindness. About this time he began to obtain small roles in films, appearing in dozens within a very brief time. In 1945, he was cast as Lt. Walker in Story of G.I. Joe (1945) and received an Oscar nomination as Best Supporting Actor. His star ascended rapidly, and he became an icon of 1940s film noir, though equally adept at westerns and romantic dramas. His apparently lazy style and seen-it-all demeanor proved highly attractive to men and women, and by the 1950s, he was a true superstar despite a brief prison term for marijuana usage in 1949, which seemed to enhance rather than diminish his \"bad boy\" appeal. Though seemingly dismissive of \"art,\" he worked in tremendously artistically thoughtful projects such as Charles Laughton's The Night of the Hunter (1955) and even co-wrote and composed an oratorio produced at the Hollywood Bowl by Orson Welles. A master of accents and seemingly unconcerned about his star image, he played in both forgettable and unforgettable films with unswerving nonchalance, leading many to overlook the prodigious talent he can bring to a project that he finds compelling. He moved into television in the 1980s as his film opportunities diminished, winning new fans with The Winds of War (1983) and War and Remembrance (1988). His sons James Mitchum and Christopher Mitchum are actors, as is his grandson Bentley Mitchum. His last film was James Dean: Live Fast, Die Young (1997) with Casper Van Dien as James Dean.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTI1NDIxOTQyMV5BMl5BanBnXkFtZTYwMDM4MjM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000053","name":"Robert Mitchum","nicknames":["Mitch","Old Rumple Eyes","Bob"],"idIMDB":"nm0000053"},"actorId":"nm0000053","character":"Eddie 'Fingers' Coyle","urlCharacter":"http://www.imdb.com/character/ch0034855","main":true},{"actorName":"Peter Boyle","urlProfile":"http://www.imdb.com/name/nm0001967","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0ODc5NTE4M15BMl5BanBnXkFtZTYwNjY3MTI0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 October 1935","placeOfBirth":" Norristown, Pennsylvania, USA","birthName":"Peter Lawrence Boyle Jr.","height":"6' 2\" (1.88 m)","bio":"A bold, blunt instrument of hatred and violence at the onset of his film career, Peter Boyle recoiled from that repugnant, politically incorrect \"working class\" image to eventually play gruff, gentler bears and even comedy monsters in a career that lasted four decades. He was born on October 18, 1935, in Norristown, Pennsylvania, to Alice (Lewis) and Francis Xavier Boyle. He eventually moved to Philadelphia, where his father was a sought-after local TV personality and children's show host. His paternal grandparents were Irish immigrants, and his mother was of mostly French and British Isles descent. Following a solid Catholic upbringing (he attended a Catholic high school), Peter was a sensitive youth and joined the Christian Brothers religious order at one point while attending La Salle University in Philadelphia. He left the monastery after only a few years when he \"lost\" his calling. Bent on an acting career, Boyle initially studied with guru Uta Hagen in New York. The tall (6' 2\"), hulking, prematurely bald actor wannabe struggled through a variety of odd jobs (postal worker, waiter, bouncer) while simultaneously building up his credits on stage and waiting for that first big break. Things started progressing for him after appearing in the national company of \"The Odd Couple\" in 1965 and landing TV commercials on the sly. In the late 60s he joined Chicago's Second City improv group and made his Broadway debut as a replacement for Peter Bonerz in Paul Sills' \"Story Theatre\" (1971) (Sills was the founder of Second City). Peter's breakout film role did not come without controversy as the hateful, hardhat-donning bigot-turned-murderer Joe (1970) in a tense, violence-prone film directed by John G. Avildsen. The role led to major notoriety, however, and some daunting supporting parts in T.R. Baskin (1971), Slither (1973) and as Robert Redford's calculating campaign manager in The Candidate (1972). During this time his political radicalism found a visible platform after joining Jane Fonda and Donald Sutherland on anti-war crusades, which would include the anti-establishment picture Steelyard Blues (1973). This period also saw the forging of a strong friendship with former Beatle John Lennon. Destined to be cast as monstrous undesirables throughout much of his career, he played a monster of another sort in his early film days, and thus avoided a complete stereotype as a film abhorrent. His hilarious, sexually potent Frankenstein's Monster in the cult Mel Brooks spoof Young Frankenstein (1974) saw him in a sympathetic and certainly more humorous vein. His creature's first public viewing, in which Boyle shares an adroit tap-dancing scene with \"creator\" Gene Wilder in full Fred Astaire regalia, was a show-stopping audience pleaser. Late 70s filmgoers continued to witness Boyle in seamy, urban settings with brutish roles in Taxi Driver (1976) and Hardcore (1979). At the same time he addressed several TV mini-movie roles with the same brilliant darkness such as his Senator Joe McCarthy in Tail Gunner Joe (1977), for which he received an Emmy nomination, and his murderous, knife-wielding Fatso in the miniseries remake of From Here to Eternity (1979). While the following decade found Peter in predominantly less noteworthy filming and a short-lived TV series lead as remote cop Joe Bash (1986), the 90s brought him Emmy glory (for a guest episode on The X-Files (1993)). Despite a blood clot-induced stroke in 1990 that impaired his speech for six months, he ventured on and capped his enviable career on TV wielding funny but crass one-liners in the \"Archie Bunker\" mold on the long-running sitcom Everybody Loves Raymond (1996). A major Emmy blunder had Boyle earning seven nominations for his Frank Barrone character without a win, the only prime player on the show unhonored. He survived a heart attack while on the set of \"Everybody Loves Raymond\" in 1999, but managed to return full time for the remainder of the series' run through 2005. Following a superb turn as Billy Bob Thornton's unrepentantly racist father in the sobering Oscar-winner Monster's Ball (2001), the remainder of his films were primarily situated in frivolous comedy fare such as The Adventures of Pluto Nash (2002), The Santa Clause 2 (2002), Scooby-Doo 2: Monsters Unleashed (2004), and The Santa Clause 3: The Escape Clause (2006), typically playing cranky curmudgeons. Boyle died of multiple myeloma (bone-marrow cancer) and heart disease at New York Presbyterian Hospital in 2006, and was survived by his wife Lorraine and two children. He was 71.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0ODc5NTE4M15BMl5BanBnXkFtZTYwNjY3MTI0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001967","name":"Peter Boyle","idIMDB":"nm0001967"},"actorId":"nm0001967","character":"Dillon","urlCharacter":"http://www.imdb.com/character/ch0457575","main":true},{"actorName":"Richard Jordan","urlProfile":"http://www.imdb.com/name/nm0430151","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4NTM3NTgzNTBeQTJeQWpwZ15BbWU3MDY1NzgxNTQ@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 July 1937","placeOfBirth":" New York City, New York, USA","birthName":"Robert Anson Jordan Jr.","height":"6' 2\" (1.88 m)","bio":"Harvard-educated stage and screen actor Richard Jordan was born into a socially prominent family on July 19, 1937 in New York City, the grandson of Learned Hand, the greatest American jurist never to have served on the U.S. Supreme Court. Newbold Morris, his stepfather, was a member of the New York City Council during Mayor Fiorello LaGuardia's administration. Young Richard was educated in private Manhattan schools and then at the exclusive Hotchkiss prep school in Lakeville, Connecticut. While at Hotchkiss, he was outstanding as the eponymous lead of the school play \"Mr. Roberts\", which won him a place in the Sharon, Connecticut summer stock company. Jordan went to England as an exchange student at the Sherbourne School, a college (private school) that was over 1,000 years old. After graduating from Sherbourne, Jordan entered Harvard College and took his degree in three years. At Harvard, Jordan was a member of the Dramatic Club, both as an actor and as a director. It was while at Harvard that he decided to become a professional actor and began performing with off-campus stage companies. After graduating from Harvard, Jordan launched what was to be a prolific stage career in New York, making his Broadway debut in December 1961 in the play \"Take Her, She's Mine\" under the direction of the venerable George Abbott in Biltmore Theatre. The play, which starred Art Carney, Elizabeth Ashley in a Tony Award-winning turn, and Heywood Hale Broun, was a hit, playing 404 performances. Jordan next appeared in a one-night flop, in \"Bicycle Ride to Nevada\", which opened and closed on September 24, 1963. He was more lucky with his next play, \"Generation\", a comedy starring Henry Fonda that played for 300 performances in the 1965-66 season. He last appeared on Broadway in a success d'estime, John Osborne's \"A Patriot for Me\", directed by Peter Glenville and starring Maximilian Schell and Tommy Lee Jones, who was making his Broadway debut. By that time, Jordan had established himself as a leading player Off-Broadway and Off-Off-Broadway, which accounted for the majority of his over 100 New York stage appearances. Jordan, as actor and director, was a major force in the development of New York's \"Off-Off-Broadway\" theater that flourished in the 1960s. He was one of the founders of the Gotham Arts Theater, which put on plays in an old funeral parlor on West 43rd Street. Fittingly, the company's first play was about necrophilia. Jordan engaged young New York artists to design the sets, the results of which were not always auspicious. Jordan said of this development, \"With our weirdo plays against their far-out sets...it was total insanity!\" He made a significant breakthrough, career-wise, with his appearance in the anti-war play \"The Trial Of The Catonsville Nine\" in both New York and California. Jordan spent eight years with Joseph Papp's New York Shakespeare Festival. He made his debut with Papp's Shakespeare Festival in 1963, playing \"Romeo\" opposite the \"Juliet\" of Kathleen Widdoes, the fellow Papp stock company member who would become his wife, in Papp's Shakespeare in the Park series. The couple married in 1964, and their eight-year marriage produced a daughter, Nina Jordan, born in 1964, who would later co-star with her father in the movie Old Boyfriends (1979). Although he appeared on television during the 1960s, the tall, handsome and talented Jordan did not make his motion picture debut until 1971, when he appeared in a supporting role in Michael Winner's horse opera Lawman (1971), which featured a first-rate cast, including Burt Lancaster, Robert Ryan, Lee J. Cobb and Robert Duvall. However, it was his role as the baby-faced, amoral Treasury agent in The Friends of Eddie Coyle (1973) that made him a known commodity on-screen, while it was the monumental mini-series Captains and the Kings (1976) that made his reputation. His performance as the Irish immigrant \"Joseph Armagh\" brought him an Emmy nomination and a Golden Globe award, and it also brought him his long-time companion, co-star Blair Brown, whom he lived with for many years and by whom he had a son. An actor rather than a star, Jordan played many unsympathetic roles, including that of Nazi Albert Speer in the TV movie Le bunker (1981). He continued to appear on the stage, Off-Broadway and in stock companies touring the major cities of the U.S., while appearing in films and on TV. Jordan was the manager of the L.A. Actors Theater in Los Angeles during the 1970s, where he produced, directed and wrote his own plays. For the 1983-84 Off-Broadway season, he won an Obie Award for his performance in Czech playwright Václav Havel's \"A Private View\". He won the Los Angeles Drama Critics Circle Award for directing Havel's \"Largo Desolato\" at the Taper, Too in 1987. In 1992, Jordan had begun filming The Fugitive (1993) when his fatal illness forced him to leave the production. Thus, Jordan's final role was that of \"General Lewis Armistead\" in the film Gettysburg (1993), which was a labor of love for him. He was close friends with Michael Shaara, the author of the novel \"The Killer Angels\", which the movie was based upon, and contributed to the screenplay. Jordan's last appearance as an actor was the death of his on-screen character, \"General Armistead\". Richard Jordan died in Los Angeles, California of a brain tumor on August 30, 1993. He was 56 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4NTM3NTgzNTBeQTJeQWpwZ15BbWU3MDY1NzgxNTQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0430151","name":"Richard Jordan","idIMDB":"nm0430151"},"actorId":"nm0430151","character":"Dave Foley","urlCharacter":"http://www.imdb.com/character/ch0457576","main":true},{"actorName":"Steven Keats","urlProfile":"http://www.imdb.com/name/nm0444198","urlPhoto":"","biography":{"dateOfBirth":"6 February 1945","placeOfBirth":" The Bronx, New York, USA","height":"5' 10½\" (1.79 m)","bio":"Excellent, prolific, and versatile film, stage, and television actor Steven Keats was born on February 6, 1945 in The Bronx, New York City. The son of Jewish immigrants from Denmark, Keats grew up in Canarsie, The Bronx and graduated from the High School for Performing Arts in Manhattan. He served in the Air Force during the Vietnam War in 1965 and 1966. Following his tour of duty, Steven returned to the United States and attended both the Yale School of Drama and Montclair State College. Keat made his Broadway stage debut in 1970 as part of the second cast for \"Oh! Calcutta.\" His most memorable movie roles include spaced-out punk hood Jackie Brown in \"The Friends of Eddie Coyle,\" Charles Bronson's son-in-law Jack Toby in \"Death Wish,\" Carol Kane's Americanized Jewish immigrant husband Jake Putkovsky in \"Hester Street,\" Robert Shaw's Israeli sidekick Moshevsky in \"Black Sunday,\" and obsessive mad scientist Dr. Philip Spires in \"Silent Rage.\" Steven was nominated for an Emmy for Outstanding Lead Actor in a Limited Series for his exceptional portrayal of ruthless Depression-era rag trade tycoon Jay Blackman in the mini-series \"Seventh Avenue.\" Among the many shows Keats made guest appearances on are \"Kojak,\" \"The Streets of San Francisco,\" \"The Rockford Files,\" \"Starsky and Hutch,\" \"Barnaby Jones,\" \"Cagney & Lacey,\" \"The Love Boat,\" \"The A-Team,\" \"Hunter,\" \"T.J. Hooker,\" \"Hill Street Blues,\" \"Miami Vice,\" \"Matlock,\" and \"MacGyver.\" Moreover, he played Thomas Edison on an episode of \"Voyagers!\". He was the father of sons Shane and Thatcher. Steven was found dead in his Manhattan apartment on May 8, 1994; the cause of death was ruled an apparent suicide. Keats was only 49 years old.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0444198","name":"Steven Keats","idIMDB":"nm0444198"},"actorId":"nm0444198","character":"Jackie Brown","urlCharacter":"http://www.imdb.com/character/ch0457577","main":true},{"actorName":"Alex Rocco","urlProfile":"http://www.imdb.com/name/nm0733678","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MTMyNTkxOF5BMl5BanBnXkFtZTcwMDA4NTAzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 February 1936","placeOfBirth":" Cambridge, Massachusetts, USA","birthName":"Alessandro Federico Petricone Jr.","height":"6' (1.83 m)","bio":"Tough and volatile-looking Italianate character actor Alex Rocco was born in Boston and spent time training with such notable teachers as Leonard Nimoy and Jeff Corey to curb his thick Boston accent. In Hollywood from 1963, he worked as a bartender during the lean years and began his TV career in the late 60s. Slowly, he came to show sly, lethal menace in \"big city\" films and, in the next decade, notably played Las Vegas syndicate boss Moe Green who gets a bullet in the eye during the violent \"christening sequence\" of Mario Puzo's Oscar-winning The Godfather (1972). Finding a comfortable niche playing various swarthy-looking cronies, hoods and cops, he made a distinct impression when he switched to TV comedy and, in the late 80s, won an Emmy for The Famous Teddy Z (1989) during the 1989-1990 season. Other comedy series such as Sibs (1991) and The George Carlin Show (1994) came and went with over 400 TV appearances racked up so far. Recurring roles on The Simpsons (1989) and The Facts of Life (1979) (as Nancy McKeon's father) has kept him alive, as well. Rocco has appeared in two films helmed by his son, screenwriter and director Marc Rocco: Scenes from the Goldmine (1987) and Dream a Little Dream (1989). Other memorably flashy film roles include The Friends of Eddie Coyle (1973), Freebie and the Bean (1974), The Stunt Man (1980), Lady in White (1988), Get Shorty (1995) and Just Write (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MTMyNTkxOF5BMl5BanBnXkFtZTcwMDA4NTAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0733678","name":"Alex Rocco","nicknames":["Bobo"],"idIMDB":"nm0733678"},"actorId":"nm0733678","character":"Jimmy Scalise","urlCharacter":"http://www.imdb.com/character/ch0457578","main":true},{"actorName":"Joe Santos","urlProfile":"http://www.imdb.com/name/nm0764134","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNDA0OTMyOF5BMl5BanBnXkFtZTcwMTA0MjkxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 June 1931","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Joseph Minieri","height":"5' 9\" (1.75 m)","bio":"Brooklyn-born actor of Italian descent, Joe Santos started out a football jock at Fordham University and turned semi-pro before finding a new avenue in acting. Success was long in coming, and he paid his dues for years in a number of blue-collar jobs including railroad worker, tree trimmer, cabbie and barkeep while taking acting classes. A soap opera job and work in his cousin Joseph W. Sarno's cheap jack film exploitations (Flesh and Lace (1965), Moonlighting Wives (1966) and My Body Hungers (1967)) in the '60s seemed to lead nowhere. His first real break came with the searing film downer The Panic in Needle Park (1971), getting a part at the urging of his friend and star of the film, the up-and-coming Al Pacino, who had played some softball with Santos. A prime role as a sympathetic sergeant in the acclaimed TV mini-series The Blue Knight (1973) led Santos in the direction of \"good cop\" parts, with a long-running role as James Garner's long-suffering friend Lt. Becker on the series The Rockford Files (1974) (1974-80). Other series roles in Me and Maxx (1980), a.k.a. Pablo (1984)--as Paul Rodriguez's dad--and Lt. Harper in the 1985-86 season of Hardcastle and McCormick (1983) kept him busy. Missing out on the one big role that might have put him on the map, the beefy and balding Santos remains a durable and reliable supporting player, getting some deserved notice in 2004 with his recurring role of \"Consigliere Angelo Garepe\" in the hit hit man series The Sopranos (1999). He has also dabbled in playwriting, having penned \"Sunset Normandie\", in which he also starred.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNDA0OTMyOF5BMl5BanBnXkFtZTcwMTA0MjkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0764134","name":"Joe Santos","idIMDB":"nm0764134"},"actorId":"nm0764134","character":"Artie Van","urlCharacter":"http://www.imdb.com/character/ch0457579","main":true},{"actorName":"Mitchell Ryan","urlProfile":"http://www.imdb.com/name/nm0752751","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3ODQ5OTUzM15BMl5BanBnXkFtZTYwOTAzNjcz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 January 1928","placeOfBirth":" Louisville, Kentucky, USA","height":"6' (1.83 m)","bio":"American character actor born in Cincinnati and raised in Louisville, Mitchell Ryan is a well known supporting actor in films and television. During his term in the Navy in 1951, he was assigned to the Special Services Entertainment and became hooked on acting. After his term in the Navy, he appeared in dozens of plays until he received notice as playing a regular in TV's Dark Shadows (1966) for three years. Beginning in the 70s, he received work in motion pictures including Monte Walsh (1970), Magnum Force (1973) and in Clint Eastwood's High Plains Drifter (1973). He had a small part in Universal's Midway (1976) and returned to act in numerous soaps and television series, among them included a recurring guest role in Having Babies (1978), Executive Suite (1976), The Chisholms (1979) and All My Children (1970) and a growing list of television films and TV guest appearances. Ryan is probably best known for portraying the villain that Mel Gibson and Danny Glover are after in Lethal Weapon (1987), but his career included several supporting roles in the past ten years including Judge Dredd (1995), Michael Myers' nemesis in Halloween: The Curse of Michael Myers (1995), Liar Liar (1997) with Jim Carrey and as Harrison Ford's chief out to get Brad Pitt in The Devil's Own (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3ODQ5OTUzM15BMl5BanBnXkFtZTYwOTAzNjcz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0752751","name":"Mitchell Ryan","idIMDB":"nm0752751"},"actorId":"nm0752751","character":"Waters","urlCharacter":"http://www.imdb.com/character/ch0457580","main":true},{"actorName":"Peter MacLean","urlProfile":"http://www.imdb.com/name/nm0533806","urlPhoto":"","biography":{"dateOfBirth":"2 January 1936","placeOfBirth":" Dorchester, Massachusetts, USA","bio":"Peter MacLean was born on January 2, 1936 in Dorchester, Massachusetts, USA. He was an actor, known for General Hospital (1963), The Friends of Eddie Coyle (1973) and Days of Our Lives (1965). He died on May 28, 2003 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0533806","name":"Peter MacLean","idIMDB":"nm0533806"},"actorId":"nm0533806","character":"Mr. Partridge","urlCharacter":"http://www.imdb.com/character/ch0457581","main":true},{"actorName":"Kevin O'Morrison","urlProfile":"http://www.imdb.com/name/nm0641870","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTkxZTUzNTgtY2UxNi00NzRiLTg5NmEtZDdlNGFjMzU3Y2QyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1916","placeOfBirth":" St. Louis, Missouri, USA","bio":"Kevin O'Morrison was born on May 25, 1916 in St. Louis, Missouri, USA. He was an actor and writer, known for Sleepless in Seattle (1993), Funny Farm (1988) and The Set-Up (1949). He was married to Linda. He died on December 11, 2016 in Lynnwood, Washington, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTkxZTUzNTgtY2UxNi00NzRiLTg5NmEtZDdlNGFjMzU3Y2QyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0641870","name":"Kevin O'Morrison","idIMDB":"nm0641870"},"actorId":"nm0641870","character":"Bank manager #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marvin Lichterman","urlProfile":"http://www.imdb.com/name/nm0509066","urlPhoto":"","biography":{"dateOfBirth":"12 May 1938","placeOfBirth":" Brooklyn, New York, USA","bio":"Marvin Lichterman was born on May 12, 1938 in Brooklyn, New York, USA. He is an actor, known for The Front (1976), The Friends of Eddie Coyle (1973) and John and Mary (1969).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0509066","name":"Marvin Lichterman","idIMDB":"nm0509066"},"actorId":"nm0509066","character":"Vernon","urlCharacter":"http://www.imdb.com/character/ch0457582","main":true},{"actorName":"Carolyn Pickman","urlProfile":"http://www.imdb.com/name/nm0681959","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4OTAwNjk4Ml5BMl5BanBnXkFtZTgwNzc3NTY3MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Carolyn Pickman is known for her work on Spotlight (2015), The Town (2010) and Moonrise Kingdom (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4OTAwNjk4Ml5BMl5BanBnXkFtZTgwNzc3NTY3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0681959","name":"Carolyn Pickman","idIMDB":"nm0681959"},"actorId":"nm0681959","character":"Nancy","urlCharacter":"http://www.imdb.com/character/ch0457583","main":true},{"actorName":"James Tolkan","urlProfile":"http://www.imdb.com/name/nm0866055","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NDcyNzQ4Nl5BMl5BanBnXkFtZTcwMjExNTgyMQ@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1931","placeOfBirth":" Calumet, Michigan, USA","birthName":"James Stewart Tolkan","height":"5' 6\" (1.68 m)","bio":"Fiery, forceful and intimidating character actor James Tolkan has carved out a nice little niche for himself in both movies and television alike as a formidable portrayer of fierce and flinty hard-boiled tough guy types. James Stewart Tolkan was born on June 20, 1931 in Calumet, Michigan. His father, Ralph M. Tolkan, was a cattle dealer. James attended the University of Iowa, Coe College and Eastern Arizona College. After serving a year-long stint in the United States Navy, Tolkan went to New York and studied acting with both Lee Strasberg and Stella Adler at the Actors Studio. Short and bald, with beady, intense eyes, a wiry, compact, muscular build, a gruff, jarring, high-decibel voice, and an aggressive, confrontational, blunt-as-a-battle-ax, rough-around-the-edges demeanor, Tolkan has been often cast as rugged, cynical no-nonsense cops, mean, domineering authority figures, and various ruthless and dangerous criminals. Tolkan first began acting in movies in the late 1960s and was highly effective in two pictures for Sidney Lumet: He was a rabidly homophobic police lieutenant in the superbly gritty Serpico (1973) and a sneaky district attorney in the equally excellent Prince of the City (1981). Best known as the obnoxiously overzealous high school principal Gerard Strickland in the Back to the Future films, Tolkan's other most memorable roles include Napolean in Woody Allen's Love and Death (1975), a ramrod army officer in WarGames (1983), mayor Robert Culp's mordant, wisecracking assistant in Turk 182! (1985), the hard-nosed Stinger in Top Gun (1986), the choleric Detective Lubric in Masters of the Universe (1987), meek mob accountant Numbers in Dick Tracy (1990), and Wesley Snipes' bullish superior in Boiling Point (1993). James has had recurring parts on the television series A Nero Wolfe Mystery (2000) (he also directed two episodes), Mary (1985), Cobra (1993), The Hat Squad (1992) and Remington Steele (1982). Among the television series James has done guest spots on are Naked City (1958), Hill Street Blues (1981), Miami Vice (1984), The Fresh Prince of Bel-Air (1990), The Equalizer (1985), The Wonder Years (1988) and The Pretender (1996). Besides his film and television work, Tolkan has also performed on stage in productions of such plays as \"Between Two Thieves\", \"Wings\", \"One Tennis Shoe\", \"The Front Page\", \"Twelve Angry Men\", \"Full Circle\", \"The Tempest\", \"Golda\", \"The Silent Partner\" and the original 1984 Broadway production of David Mamet's \"Glengary, Glen Ross\". When he isn't acting, James Tolkan spends his spare time collecting folk art.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NDcyNzQ4Nl5BMl5BanBnXkFtZTcwMjExNTgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0866055","name":"James Tolkan","idIMDB":"nm0866055"},"actorId":"nm0866055","character":"The Man's contact man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Margaret Ladd","urlProfile":"http://www.imdb.com/name/nm0480470","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NDIxNTM0MF5BMl5BanBnXkFtZTcwMjAzMDQwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 November 1942","placeOfBirth":" Providence, Rhode Island, USA","height":"5' 4\" (1.63 m)","bio":"Margaret Ladd was born on November 8, 1942 in Providence, Rhode Island, USA. She is an actress, known for Falcon Crest (1981), The Whales of August (1987) and A Wedding (1978). She is married to Lyle Kessler. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NDIxNTM0MF5BMl5BanBnXkFtZTcwMjAzMDQwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0480470","name":"Margaret Ladd","idIMDB":"nm0480470"},"actorId":"nm0480470","character":"Andrea","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matthew Cowles","urlProfile":"http://www.imdb.com/name/nm0184804","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNDQ0MjY0NV5BMl5BanBnXkFtZTcwNTUyMTgwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 September 1944","placeOfBirth":" New York City, New York, USA","birthName":"Matthew Chandler Cowles","bio":"Matthew Cowles was born on September 28, 1944 in New York City, New York, USA as Matthew Chandler Cowles. He was an actor, known for Shutter Island (2010), All My Children (1970) and Loving (1983). He was married to Christine Baranski and Kathleen Dezina. He died on May 22, 2014 in New York City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNDQ0MjY0NV5BMl5BanBnXkFtZTcwNTUyMTgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0184804","name":"Matthew Cowles","idIMDB":"nm0184804"},"actorId":"nm0184804","character":"Pete","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Helena Carroll","urlProfile":"http://www.imdb.com/name/nm0140833","urlPhoto":"","biography":{"dateOfBirth":"13 November 1928","placeOfBirth":" Glasgow, Scotland, UK","bio":"Helena Carroll was born on November 13, 1928 in Glasgow, Scotland. She was an actress, known for General Hospital (1963), The Dead (1987) and The Jerk (1979). She died on March 31, 2013 in Marina del Rey, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0140833","name":"Helena Carroll","idIMDB":"nm0140833"},"actorId":"nm0140833","character":"Sheila Coyle","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0070077","urlIMDB":"http://www.imdb.com/title/tt0070077","business":{"budget":{"money":"$3,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"02","month":"10","year":"1972","remarks":null},null],"copyrightHolder":"Paramount Pictures Corp."},"technical":{"runtime":["1 hr 42 min (102 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Camera and Lenses"],"laboratory":["Technicolor, New York (NY), USA"],"filmLength":["2,810 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision","Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.6","filmingLocations":[{"location":"Boston Bowl - 820 William T. Morrissey Boulevard, Dorchester, Boston, Massachusetts, USA"}],"rated":"R","awards":[],"votes":"6,103","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["snitch","gangster","bank robbery","reference to arizona","ski mask","reference to j. edgar hoover","phone booth","massachusetts","zoom lens","police alarm","shot in abdomen","brogue","school bus","extortion","masked bandit","saloon","thieves fall out","double cross","police informant","contract killer","drunkenness","bowling alley","pool hall","reference to bobby orr","reference to santa klaus","ice hockey","boston bruins","female stockinged legs","pantyhose","train station","gun dealer","informer","irony","time lock","shooting","see through blouse","mobile home","masked men","hockey arena","family held hostage","car wreck","bar","african american slur","neo noir","irish american","based on novel","character name in title","boston massachusetts"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 06:31:15"}}