{"data":{"movies":[{"title":"7 Women","originalTitle":"","year":"1966","releaseDate":"19660727","directors":[{"name":"John Ford","id":"nm0000406"}],"writers":[{"name":"Janet Green","id":"nm0337944"},{"name":"John McCormick","id":"nm1303417"}],"runtime":"87 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDJiNTZhYzktYTY2Zi00MjBkLWEzODItZTUwMjUxNzNiNWRjXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1.jpg","countries":["USA"],"languages":["English","Mandarin"],"genres":["Drama"],"plot":"In a mission in China in 1935, Agatha Andrews is a rigid missionary beset by Mongolian bandits led by Warlord chief Tunga Khan. With her are her assistant Jane Argent, staff members Emma Clark, Miss Russell and Miss Binns, head of the British mission, Charles Pather, a teacher at the mission and his pregnant wife Florrie. When Dr. D.R. Cartwright arrives, she agrees to sacrifice herself to the Tunga Khan in exchange for his letting the ladies go free.","simplePlot":"Legendary director John Ford's final film involving seven dedicated missionary women in China circa 1935 trying to protect themselves from the advances of a Mongolian barbaric warlord and his cut-throat gang of warriors.","actors":[{"actorName":"Anne Bancroft","urlProfile":"http://www.imdb.com/name/nm0000843","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MzQ3MTk4OV5BMl5BanBnXkFtZTcwMzIzNzgzNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 September 1931","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"Anna Maria Louise Italiano","height":"5' 6\" (1.68 m)","bio":"Anne Bancroft was born on September 17, 1931 in the Bronx, the daughter of Michael Italiano (1905-2001), a dress pattern maker, and Mildred DiNapoli (1908-2010), a telephone operator. She made her cinema debut in Don't Bother to Knock (1952) in 1952 and over the next five years appeared in a lot of undistinguished movies as a supporting actress, such as Gorilla at Large (1954), New York Confidential (1955) and The Girl in Black Stockings (1957). By 1957 she had grown dissatisfied with the roles she was getting, left the film industry and spent the next five years doing plays on Broadway. She returned to the screen in 1962 with her portrayal of Annie Sullivan in The Miracle Worker (1962), for which she won an Oscar. Bancroft went on to give acclaimed performances in The Pumpkin Eater (1964), The Slender Thread (1965), Young Winston (1972), The Prisoner of Second Avenue (1975), The Elephant Man (1980), To Be or Not to Be (1983), 84 Charing Cross Road (1987) and other movies as lead actress, but her most famous role would be as Mrs. Robinson in The Graduate (1967). Her status as the predatory \"older woman\" in the film is iconic, although in real life she was just 36 and only six years older than co-star Dustin Hoffman. Bancroft would later express her frustration over the fact that the film overshadowed her other work. Selective for much of her intermittent career, she appeared on the screen more frequently in the '90s, playing a range of characters in such films as Love Potion No. 9 (1992), Point of No Return (1993), Home for the Holidays (1995), G.I. Jane (1997), Great Expectations (1998) and Up at the Villa (2000). She also started to make some TV films, including Deep in My Heart (1999) for which she won an Emmy. Sadly, on June 6, 2005, Bancroft passed away at the age of 73 from uterine cancer. Her death surprised many, as she had not revealed any information of her illness to the public. Among her survivors was her husband of 41 years, Mel Brooks, and her only child, Max Brooks, who was born in 1972. Her final film, the animated feature Delgo (2008), was released posthumously in 2008 and dedicated to her memory.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MzQ3MTk4OV5BMl5BanBnXkFtZTcwMzIzNzgzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000843","name":"Anne Bancroft","nicknames":["Annie"],"idIMDB":"nm0000843"},"actorId":"nm0000843","character":"Dr. D.R. Cartwright","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sue Lyon","urlProfile":"http://www.imdb.com/name/nm0528987","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NDc2MDYyNF5BMl5BanBnXkFtZTYwMjcwNDI2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 July 1946","placeOfBirth":" Davenport, Iowa, USA","birthName":"Suellyn Lyon","height":"5' 3\" (1.6 m)","bio":"Sue Lyon was born in Davenport, Iowa, the last of five children to Sue Karr Lyon. Her mother was forty-two when her husband died and Sue was 10 months old. Her mother had to work as a hospital house mother to take care of her children and money was tight. Around this time, the Lyon family moved out to Los Angeles, hoping that Sue could help them out financially as a model. She got jobs modeling for JC Penney, and doing a commercial, which featured her dyed blonde hair. She also got small parts on Dennis the Menace (1959) and The Loretta Young Show (1953). Director Stanley Kubrick saw Sue on the show and suggested to his partner that they should see her for the role of Lolita (1962). Sue had been signed by the Glenn Shaw agency, and Pat Holms, an agent, brought her down to Kubrick for audition. She duly won the part of Lolita. In 1964 she married Hampton Fancher III but the marriage was a short one. She did other movies like 7 Women (1966), The Flim-Flam Man (1967) and Tony Rome (1967). She married Roland Harrison, a black photographer and football coach. The controversy over their marriage made them decide to move to Spain. She continued in movies like Evel Knievel (1971), The Magician (1973), and To Love, Perhaps to Die (1973), but divorced Harrison, due to pressure over racism and other problems. She met Gary \"Cotton\" Adamson at the Colorado State Penitentiary, where he was currently serving time for murder and robbery. She worked as a cocktail waitress and lived in an hotel in Denver nearby. She married him in 1973 and began working for prison reform and conjugal rights. Unfortunately this was another short-lived marriage as she divorced him after he committed yet another robbery. More films followed including Smash-Up on Interstate 5 (1976), The Astral Factor (1978), Towing (1978), Crash! (1976), Don't Push, I'll Charge When I'm Ready (1977) and her final film, Alligator (1980). She married a radio engineer, Richard Rudman and they live together in Los Angeles. Sue has retired from acting and avoids interviews.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NDc2MDYyNF5BMl5BanBnXkFtZTYwMjcwNDI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0528987","name":"Sue Lyon","idIMDB":"nm0528987"},"actorId":"nm0528987","character":"Emma Clark - Mission Staff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Margaret Leighton","urlProfile":"http://www.imdb.com/name/nm0500364","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGM1MjlkZjQtZjA2Yy00ZmE3LWI5NzEtYWIxOGJlMWIzYzZiXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 February 1922","placeOfBirth":" Barnt Green, Worcestershire, England, UK","height":"5' 10\" (1.78 m)","bio":"British theatre actress Margaret Leighton made her classical stage debut at age 16. The daughter of a businessman, she joined the Old Vic Company under the direction of Laurence Olivier and Ralph Richardson and in the late 40s and 50s earned kudos for her theatrical endeavors on both the London and Broadway stages. She was nominated for four Tony awards, winning twice. The tall, reedy, opulent lady with strikingly odd, yet fascinating facial features also gave rich performances on film, stealing more than a few features away from the stars with her neurotic, brittle matrons and their unique brand of sophisticated eccentricity. Her first husband was noted publisher Max Reinhardt, famous for his collection of letters and photographs from playwright and novelist George Bernard Shaw. Her second husband was actor Laurence Harvey, who appeared with her in the movie The Good Die Young (1954). Both marriages ended in divorce. Her last marriage to actor Michael Wilding, who co-starred with her in Lady Caroline Lamb (1972), was a long and enduring match up. Other notable screen credits include Marriage a la Mode (1955), Waltz of the Toreadors (1962), The Madwoman of Chaillot (1969) and the TV-movie, Great Expectations (1974) as the incomparable Miss Havisham. In 1971, Margaret was diagnosed with multiple sclerosis but didn't let it slow her down. Even by 1975 when she was no longer capable of walking, she continued to act. She died from complications of the disease the following year.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGM1MjlkZjQtZjA2Yy00ZmE3LWI5NzEtYWIxOGJlMWIzYzZiXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0500364","name":"Margaret Leighton","idIMDB":"nm0500364"},"actorId":"nm0500364","character":"Agatha Andrews - Head of Mission","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Flora Robson","urlProfile":"http://www.imdb.com/name/nm0733460","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDk5MWQwOWUtYzc1OC00ZThhLTkzOGUtZTNjYmNlZmVkOTU2L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 March 1902","placeOfBirth":" South Shields, Durham, England, UK","birthName":"Flora McKenzie Robson","height":"5' 10\" (1.78 m)","bio":"Flora Robson knew she was no beauty, but her wise and sympathetic face would become a familiar - indeed, shining - ornament of the 1930s and 40s silver screen. Though not sure of acting as a career in her early years, she nevertheless appeared on stage for the first time at 5 years old. She was educated at Palmer's Green High School and went on still in her teens to the Royal Academy of Dramatic Art in London, winning a Bronze Medal in 1921. Between 1921 to 1923 she performed in London and Oxford, but both uncertainty and the unstable income of acting at that time convinced her to spend the next few years working as a factory welfare officer in east London. Still her versatility, even in her youth, as a budding character actress of the first water, was noticed. In 1929 a friend urged her to join the Cambridge Festival Theatre where she remained two years. By 1931 she was in residence at the Old Vic with as varied roles as Herodias in \"Salome\" (1931), a drunken prostitute in Bridie's \"The Anatomist\", Shakespeare's Lady Macbeth in \"Macbeth\", and Gwendolen in \"The Importance of Being Earnest\" (both in 1933). She stayed at the Old Vic until 1934, but she was already turning to the big screen with her film debut in A Gentleman of Paris (1931). Her dexterity as screen monarchs began shortly thereafter as Russian Empress Elisabeth in The Rise of Catherine the Great (1934). And she even had a place in television history in the British pioneering TV production of Anna Christie (1937), although she was initially skeptical of the future of this later powerful medium. She was a forceful Livia in Josef von Sternberg's ill-fated and unfinished I, Claudius (1937), but gave notice of her future potential with her rousing Queen Elizabeth I in Alexander Korda's Fire Over England (1937) with Laurence Olivier and Vivien Leigh. The year 1939 was extremely busy for Robson. It marked her first association with British director Michael Powell in his The Lion has Wings and Smith (1939) and the unsurprising call from Hollywood. There she was lauded quickly for two roles that year: as the domineering wife of Paul Muni in \"We Are Not Alone\" (1939) and opposite fellow British stars Olivier, Merle Oberon, and David Niven as narrator and housekeeper Nelly Dean in the haunting Wuthering Heights (1939). Her compelling Korda Elizabeth marked her for a reprise of the role in the 'Errol Flynn' swashbuckler The Sea Hawk (1940) in which she played the role to the hilt. Among early screen Elizabeth standouts, Florence Eldridge in Mary of Scotland (1936)resembled the historical queen and the more famous Bette Davis displayed the manner and temperament with her usual command (though it is hard not to feel that it is Bette playing her brilliant self and not Elizabeth) in The Private Lives of Elizabeth and Essex (1939), but Robson seemed to best personify the total person and spirit of Good Queen Bess. Her continued film career was marked with a like character versatility which had and continued to mark precious time for stage work (as in her murderess Ellen Creed in \"Ladies in Retirement\" (1940, on Broadway). In fact, in 1941, she returned to war-torn London to boldly continue theater performances to a grateful country. After the war it was a full life of crisscrossing the Atlantic. Though some British critics were not impressed with her return to Hollywood to play the overly protective mulatto servant of Ingrid Bergman in Saratoga Trunk (1945), it was an outstanding tour de force character performance honored with an Oscar nomination. Among other memorable roles in the late 1940s, even her reflective Anglican Sister Philippa in Powell's visually stunning and provocative Black Narcissus (1947) displays her depth as a solid character actress. Another quarter of a century of roles were accented with memorable theatrical performances as Lady Macbeth on Broadway (1949) and as Paulina in Shakespeare's \"The Winter's Tale\" (1951), production by John Gielgud, to add to a kaleidoscope mix of movies from 1948 to 1981 and a sprinkling of character pieces on British TV, though she retired from the stage in 1969. The material success of Hollywood played a part in her much deserved honor as Commander of the British Empire (CBE) in 1952 and her ascension as Dame Commander (DBE) in 1960. Kenneth Barrow wrote a biography Flora: The Life of Dame Flora Robson by (1981). She had the further honor of rating two portraits in the National Portrait Gallery in London for her full and distinguished life.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDk5MWQwOWUtYzc1OC00ZThhLTkzOGUtZTNjYmNlZmVkOTU2L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0733460","name":"Flora Robson","idIMDB":"nm0733460"},"actorId":"nm0733460","character":"Miss Binns - Head of British Mission","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mildred Dunnock","urlProfile":"http://www.imdb.com/name/nm0242972","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODE4MzE5MDc1NV5BMl5BanBnXkFtZTYwMTc1MjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 January 1901","placeOfBirth":" Baltimore, Maryland, USA","birthName":"Mildred Dorothy Dunnock","bio":"Petite American character actress who was celebrated for her definitive portrayal of long-suffering Linda Loman in Arthur Miller's \"Death of a Salesman\", a part she played opposite Lee J. Cobb at the Morosco Theatre for 742 consecutive performances between 1949 and 1950. Mildred recreated her role for the screen the following year and was nominated for an Academy Award as Best Supporting Actress, critic Bosley Crowther describing her performance as 'simply superb'. Ironically, Dunnock had not been the first choice for the part for either Miller, or the director, Elia Kazan. Mildred Dunnock first came to the realisation that she had the potential to perform in public when called upon to read in front of her assembled classmates at Western High School. She quickly discovered that, above all, she had 'a voice'. Her initial training was served at Agora, the dramatic society of Baltimore's Goucher College. After graduation she continued her studies at Columbia, completing a master's degree in theatre arts. She first appeared in college productions at John Hopkins University, her debut being a part in \"Penelope\" by W. Somerset Maugham in 1924. She had to wait another eight years before making her debut on Broadway in \"Life Begins\", at the same time earning a crust teaching at a private girl's school. The 1930's were a period of struggle and hardship for the actress and not until the following decade did she gain recognition for her performances in \"King Richard II\", \"Foolish Notion\" and \"The Corn is Green\". One of her biggest hits was as Lavinia Hubbard in Lillian Hellman's \"Another Part of the Forest\" (1946-47). Going from strength to strength, Mildred followed her triumph in 'Salesman' with a tour-de-force performance in the Tennessee Williams play \"Cat on a Hot Tin Roof\" (1955-56), originating the role of 'Big Mama'. Mildred absented herself from the theatre for several years to act in films. Near the beginning of her motion picture career, she was the frail old lady in a wheelchair (in real life she was in her forties) pushed down a flight of stairs by psychopathic killer Tommy Udo (Richard Widmark, in his screen debut) in Kiss of Death (1947). With her finely etched features and sad, all-knowing eyes, Mildred excelled in equal measure at playing eccentric spinster aunts, understanding wives and mothers, her slight frame belying a powerful, intense presence. In Elia Kazan's Baby Doll (1956), she enacted the relatively small part of simple-minded, perpetually timorous Aunt Rose Comfort with such conviction, that she garnered her second Academy Award nomination (losing to Dorothy Malone for Written on the Wind (1956)). She then appeared as a compassionate teacher (her first real-life profession) in Peyton Place (1957), as the exemplary Sister Margharita in The Nun's Story (1959), and, against type, as Gig Young's glacial and avaricious mother in The Story on Page One (1959). In this, Mildred demonstrated her versatility in a chilling portrayal of motherly domination and ostensible virtue turned to vice. Dunnock's film roles in the 1960's included two films with Geraldine Page: Sweet Bird of Youth (1962), as another gentle-mannered aunt, and What Ever Happened to Aunt Alice? (1969), as Page's housekeeper and eventual murder victim. As film roles diminished, she appeared on television and returned to stage work, particularly at the Long Wharf Theater in New Haven, acting in plays by Tennessee Williams and Eugene O'Neill. In 1971, she received the Drama Desk Award for Outstanding Performance for her starring role in \"A Place Without Doors\" by Marguerite Duras. The much-respected actress spent her final years in relative seclusion at Martha's Vineyard, Massachusetts, and died there of age-related problems in July 1991. A teaching theatre at Goucher College is named in her honour.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODE4MzE5MDc1NV5BMl5BanBnXkFtZTYwMTc1MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0242972","name":"Mildred Dunnock","idIMDB":"nm0242972"},"actorId":"nm0242972","character":"Jane Argent - Andrews' Assistant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Betty Field","urlProfile":"http://www.imdb.com/name/nm0275897","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTcwNjViYjgtNzQ1Mi00YWQzLWEwZTEtM2UyNDE5NzdkMjk4XkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1916","placeOfBirth":" Boston, Massachusetts, USA","height":"5' 5\" (1.65 m)","bio":"Thespian Betty Field was born in Boston on February 8, 1916, the daughter of a salesman and his wife. Ancestors on her father's side were Mayflower colonists Priscilla and John Alden. Her parents divorced while she was still young and Betty eventually learned to speak Spanish while traveling with her mother to various Spanish-speaking countries during her childhood. Mother and daughter settled in Newton, Massachusetts, after the mother remarried. Betty's passion for the theatre was sparked during her early teens and by 1932 she was enrolled at the American Academy of Dramatic Art. She made her professional debut in a 1933 summer stock production of \"The First Mrs. Fraser\" and soon was cast in stage roles elsewhere. She even found work in a London theater production of \"She Loves Me\" in early 1934. Rather plaintive in appearance with flat but highly distinctive tones, Betty's Broadway debut came about as an understudy in the comedy \"Page Miss Glory\" in November of 1934, courtesy of George Abbott, in which Betty also had a minor role. Therafter she performed frequently in the comedy mold, and in the service of Abbott, with such delightful plays as \"Three Men on a Horse (1935), \"Boy Meets Girl\" (1936) \"Room Service\" (1937) and \"The Primrose Path (1939), and earning fine reviews for the last two. After seeing her performance on stage as Henry Aldrich's girlfriend Barbara in \"What a Life\" (1938), Paramount executives utilized her services when they transferred What a Life (1939) to film. The studio not only liked what they saw but signed her to a seven-year contract. Throughout the 1940s Betty appeared in a variety of leading ingénue and co-star roles. The important part of Mae, the farm girl, in John Steinbeck's classic Of Mice and Men (1939) starring Burgess Meredith and Lon Chaney was an early highlight, although it didn't provide her the necessary springboard for stardom. Part of the problem was that the rather reserved actress tended to shun the Hollywood scene (she still lived quietly with her mother). While performing for Abbott again on Broadway in \"Ring Two\" (1939), Betty met the show's playwright Elmer Rice and the couple married in 1942. Their three children, John Alden, Judith and Paul, would appear on occasion with their mother on the summer stock stage. Betty also enhanced husband Rice's plays \"Flight to the West\" (1940) and \"A New Life\" (1943), which were designed especially for her. Betty offered consistent, quality work even when the movies she appeared in met with less-than-stellar reviews. She was afforded the opportunity to work with some of Hollywood's finest leading men, including Fredric March in Victory (1940) and Tomorrow, the World! (1944), John Wayne in The Shepherd of the Hills (1941), Robert Cummings in Flesh and Fantasy (1943) and Joel McCrea in The Great Moment (1944). Tops on the list was her heart-tugging performance as the anguished daughter victimized by father Claude Rains in the classic soaper Kings Row (1942). She purposely did not renew her Paramount contract at this point and, following another sterling performance in The Southerner (1945), took a long break from camera work. Back on Broadway, she appeared in such distinguished plays as \"The Voice of the Turtle\" and her husband's \"Dream Girl\" (Rice also directed) for career sustenance. She won the New York Drama Critics Circle award for the latter in 1946. Her Hedvig in Ibsen's \"The Wild Duck\" was also critically lauded. An isolated return to Paramount to play what should have been a career highlight ended up a major disappointment,. While her Daisy Buchanan in F. Scott Fitzgerald's The Great Gatsby (1949) had mixed reviews (some felt she was miscast and not glamorous enough for the part), the movie itself (which was extensively trimmed) and her underwhelming co-star Alan Ladd were also cited as problems. Still a marquee value on Broadway, however, she displayed great range in such fare as \"Twelfth Night\", \"The Rat Race\", \"Peter Pan\" (taking over for Jean Arthur), \"The Fourposter\" (she and Burgess Meredith replaced Jessica Tandy and Hume Cronyn) and \"Ladies of the Corridor\" Betty's soulful features took on a hardened, careworn veneer by the time she returned to Hollywood in the mid-1950's. Nevertheless, she had a \"Field\" day as a character player appearing in a number of drab, dressed-down roles. She lent credence to a number of fascinatingly flawed small-town moms and matrons in films, among them cream-of-the-crop hits Picnic (1955), starring Kim Novak, Bus Stop (1956) with Marilyn Monroe and Peyton Place (1957) headlining Lana Turner and Hope Lange. The stage plays \"The Seagull\", \"Waltz of the Toreadors\", \"Touch of the Poet\" and \"Separate Tables\" also accentuated this newly mature phase of her career. TV took up a large percentage of Betty's time in the 1950s and 1960s with a number of showcase roles. She continued at a fairly steady pace but without much fanfare (as she preferred). Divorced from Rice in 1956, she married and split from lawyer and criminologist Edwin J. Lukas before settling down permanently with husband/artist Raymond Olivere in 1968. Betty's swan song in films was a small, featured part in Clint Eastwood's Coogan's Bluff (1968) as a floozie type, looking noticeably older than she was. Mixing in such stalwart, brittle roles on stage as Amanda in \"The Glass Menagerie\" and Birdie in \"The Little Foxes\", she made one of her last theater appearances in the difficult role of the mother in \"The Effect of Gamma Rays on \"Man-in-the-Moon Marigolds\" in 1971. Betty suffered a fatal cerebral hemorrhage in Hyannis, Massachusetts in 1973, just as she was about to leave and film The Day of the Locust (1975). Cast in the flashy role of \"Big Sister\", an evangelist, her part was taken over by Geraldine Page. At age 57, Hollywood lost a somewhat undervalued talent who enjoyed the work more than the stardom that often accompanied it.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTcwNjViYjgtNzQ1Mi00YWQzLWEwZTEtM2UyNDE5NzdkMjk4XkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0275897","name":"Betty Field","idIMDB":"nm0275897"},"actorId":"nm0275897","character":"Mrs. Florrie Pether - Charles' pregnant wife","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anna Lee","urlProfile":"http://www.imdb.com/name/nm0496819","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMzIxNjc0M15BMl5BanBnXkFtZTcwMzA5OTExOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 January 1913","placeOfBirth":" Ightham, Kent, England, UK","birthName":"Joan Boniface Winnifrith","height":"5' 4\" (1.63 m)","bio":"The daughter of a clergyman, Anna Lee was born Joan Boniface Winnifrith and encouraged to pursue an acting career by her father. After training at London's Royal Albert Hall, she took to the boards and later began appearing in English films, first as an extra, then working her way up to featured parts and finally earning the unofficial title \"Queen of the Quota Quickies.\" Lee and her husband, director Robert Stevenson, relocated to Hollywood in the late 1930s, and Lee began starring in stateside productions as well as becoming a fixture of the John Ford stock company (she appeared in How Green Was My Valley (1941), Fort Apache (1948) and a half-dozen others). In 1970, she became the seventh wife of novelist, poet and playwright Robert Nathan (Portrait of Jennie (1948), The Bishop's Wife (1947)); they married three months after they met. Now widowed, Lee soldiers on, regularly playing wealthy Lila Quartermaine on the TV soaper General Hospital (1963).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMzIxNjc0M15BMl5BanBnXkFtZTcwMzA5OTExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0496819","name":"Anna Lee","nicknames":["Queen of the Quota Quickies"],"idIMDB":"nm0496819"},"actorId":"nm0496819","character":"Mrs. Russell - Mission Staff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eddie Albert","urlProfile":"http://www.imdb.com/name/nm0000734","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNjIwNzE0OV5BMl5BanBnXkFtZTYwNzc0MTQ2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 April 1906","placeOfBirth":" Rock Island, Illinois, USA","birthName":"Edward Albert Heimberger","height":"5' 11\" (1.8 m)","bio":"A graduate of the University of Minnesota, Eddie Albert was a circus trapeze flier before becoming a stage and radio actor. He made his film debut in 1938 and has worked steadily since, often cast as the friendly, good-natured buddy of the hero but occasionally being cast as a villain; one of his most memorable roles was as the cowardly, glory-seeking army officer in Robert Aldrich's World War 2 film, Attack (1956).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNjIwNzE0OV5BMl5BanBnXkFtZTYwNzc0MTQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000734","name":"Eddie Albert","idIMDB":"nm0000734"},"actorId":"nm0000734","character":"Charles Pether - Mission Teacher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike Mazurki","urlProfile":"http://www.imdb.com/name/nm0563417","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNTQzMzkwMl5BMl5BanBnXkFtZTYwNjgwMTU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1907","placeOfBirth":" Tarnopol, Galicia, Austria-Hungary [now Ternopil, Ukraine]","birthName":"Michail Mazuruski","height":"6' 4¾\" (1.95 m)","bio":"With an intimidating face like craggy granite and a towering 6'5\" solid frame, Mike Mazurki (born Mikhail Mazuruski or Mikhail Mazurkiewicz) was one of cinema's first serial thugs and specialized in playing strongarm men, gangsters and bullies for over 50 years on screen. Nearly always portrayed as a lowbrow muscle, in real life Mazurski was highly intelligent, very well read and a witty conversationalist. He was also an accomplished sportsman, having been a football player and a professional wrestler. He first appeared onscreen in uncredited roles in films such as Gentleman Jim (1942) and About Face (1942); however, his daunting bruiser looks were soon noticed and he became phenomenally busy in the 1940s, appearing in nearly 50 movies during the decade, including his well remembered performance as ex-con \"Moose Malloy\" in the film noir thriller Murder, My Sweet (1944) and as the gruesome \"Splitface\" in Dick Tracy (1945). He continued his menacing onscreen presence throughout the 1950s and 1960s, often showing he could be quite adept at deadpan comedy in films including Bud Abbott and Lou Costello in Hollywood (1945), It's a Mad Mad Mad Mad World (1963), Donovan's Reef (1963) and The Adventures of Bullwhip Griffin (1967). Demand for his talents slowed down in the late 1970s and most of the 1980s, as younger villains came to the fore; however, he still turned up in support roles and was still acting at the age of 83 when he passed away in December, 1990.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNTQzMzkwMl5BMl5BanBnXkFtZTYwNjgwMTU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0563417","name":"Mike Mazurki","idIMDB":"nm0563417"},"actorId":"nm0563417","character":"Tunga Khan - Bandit Leader","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Woody Strode","urlProfile":"http://www.imdb.com/name/nm0834754","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MzY1NzY1MV5BMl5BanBnXkFtZTcwMDY3MTMxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 July 1914","placeOfBirth":" Los Angeles, California, USA","birthName":"Woodrow Wilson Woolwine Strode","height":"6' 4\" (1.93 m)","bio":"An athlete turned actor, Strode was a top-notch decathlete and a football star at UCLA. He became part of Hollywood lore after meeting director John Ford and becoming a part of the Ford \"family,\" appearing in four Ford motion pictures. Strode also played the powerful gladiator who does battle with Kirk Douglas in Spartacus (1960).\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MzY1NzY1MV5BMl5BanBnXkFtZTcwMDY3MTMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0834754","name":"Woody Strode","idIMDB":"nm0834754"},"actorId":"nm0834754","character":"Lean Warrior","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jane Chang","urlProfile":"http://www.imdb.com/name/nm0151719","urlPhoto":"","biography":{"bio":"Jane Chang is an actress, known for 7 Women (1966), Operation Bottleneck (1961) and Have Gun - Will Travel (1957).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0151719","name":"Jane Chang","idIMDB":"nm0151719"},"actorId":"nm0151719","character":"Miss Ling - Mission Staff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hans William Lee","urlProfile":"http://www.imdb.com/name/nm0497366","urlPhoto":"","biography":{"bio":"Hans William Lee is an actor, known for 7 Women (1966), Kill a Dragon (1967) and I Spy (1965).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0497366","name":"Hans William Lee","idIMDB":"nm0497366"},"actorId":"nm0497366","character":"Kim - Mission Staff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"H.W. Gim","urlProfile":"http://www.imdb.com/name/nm0319749","urlPhoto":"","biography":{"dateOfBirth":"22 January 1908","placeOfBirth":" China","birthName":"Hom Wing Gim","bio":"H.W. Gim was born on January 22, 1908 in China as Hom Wing Gim. He was an actor, known for True Grit (1969), Paint Your Wagon (1969) and 7 Women (1966). He died on March 15, 1973 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0319749","name":"H.W. Gim","idIMDB":"nm0319749"},"actorId":"nm0319749","character":"Coolie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Irene Tsu","urlProfile":"http://www.imdb.com/name/nm0875187","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGQzZWQ5ZDYtMmU0Ny00MGJlLThkMzEtZDliOWVhMWJkODRkXkEyXkFqcGdeQXVyMjQ2MjAwNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 November 1943","placeOfBirth":" Shanghai, China","birthName":"Irene Wei Ho Tsu","height":"5' 4\" (1.63 m)","bio":"Renowned actress Irene Tsu was born April 5, 1943, in Shanghai, China. Her father was a banker and her mother a painter. When the Communists took over China the family left for Taiwan, then Formosa. They later emigrated to New York City, where Irene attended Mamoroneck Elementary and studied ballet. She was a teenage dancer in Flower Drum Song (1961), directed by Henry Koster. He gave her her first speaking role as a teenage prostitute in his next film, Take Her, She's Mine (1963) starring James Stewart and Sandra Dee, which launched her acting career. She studied acting with Ned Maderino, Lee Strasberg and Peggy Feury, among others, and for the next 20 years she played an assortment of \"native girls\" and \"dutiful daughter\" roles. In addition, she was the TV spokeswoman for Chevron Island and Standard Oil, as well as Hawaiian Punch. She became a respected leading lady and worked with some of the biggest names in the business, from Elvis Presley and John Wayne to Jeff Bridges and Richard Dreyfuss. The 1990s saw Irene mature into such roles as doctors, lawyers and mothers. She guest-starred as Garrett Wang's mother in Star Trek: Voyager (1995), Ming-Na Wen's mom in The Single Guy (1995), the judge in Unauthorized: The Mary Kay Letourneau Story (2000), CSI: NY (2004), The Division (2001) and Strong Medicine (2000), among others. She also appeared in the Peter Ho-Sun Chan hit Hong Kong film Comrades: Almost a Love Story (1996) and Golden Chicken (2002). For the past decade Irene has been a successful realtor in Beverly Hills. She enjoys helping people to realize their dreams, whether by finding them their first condo or selling their multi-million-dollar family estate or helping them invest in income properties. Irene is a single mother to nine-year-old Yasmine and has ben a yoga practitioner for 25 years. She teaches Bikram yoga for the Beverly Hills Department of Parks.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGQzZWQ5ZDYtMmU0Ny00MGJlLThkMzEtZDliOWVhMWJkODRkXkEyXkFqcGdeQXVyMjQ2MjAwNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0875187","name":"Irene Tsu","idIMDB":"nm0875187"},"actorId":"nm0875187","character":"Chinese Girl","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0060050","urlIMDB":"http://www.imdb.com/title/tt0060050","business":{"budget":{"money":"$2,300,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"© MCMLXV by Metro-Goldwyn-Mayer, Inc., John Ford Productions, Inc. &amp; Bernard Smith Productions, Inc."},"technical":{"runtime":["1 hr 27 min (87 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Color (Metrocolor)"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm"]},"rating":"6.9","filmingLocations":[{"location":"Backlot, Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA"}],"awards":[],"votes":"1,605","type":"Movie","companyCreditsSimple":[{"idCompany":"co0020961","name":"Bernard Smith Productions"},{"idCompany":"co0239710","name":"John Ford Productions"},{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"}],"keywords":{"keywords":["mission","missionary","bandit","warlord","doctor","pregnancy","china","pregnant wife","sacrifice","number 7 in title","war refugee","spinster","self sacrifice","schoolteacher","poisoning","physician","mongol","english","childbirth","epidemic","american abroad","1960s","faith","suicide","murder","cruelty","female doctor","baby","bigotry","neurotic","sexism","courage","cholera","violence","poison","based on novel","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:35:27"}}