{"data":{"movies":[{"title":"Sid and Nancy","originalTitle":"","year":"1986","releaseDate":"19861107","directors":[{"name":"Alex Cox","id":"nm0007182"}],"writers":[{"name":"Alex Cox","id":"nm0007182"},{"name":"Abbe Wool","id":"nm0941067"}],"runtime":"112 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNjA5NzY4M15BMl5BanBnXkFtZTcwNjQ2NzI5NA@@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Biography","Drama","Music","Romance"],"plot":"Morbid biographical story of Sid Vicious, bassist with British punk group the Sex Pistols, and his girlfriend Nancy Spungen. When the Sex Pistols break up after their fateful US tour, Vicious attempts a solo career while in the grip of heroin addiction. One morning, Nancy is found stabbed to death and Sid is arrested for her murder.","simplePlot":"The relationship between , bassist for British punk group , and his girlfriend is portrayed.","actors":[{"actorName":"Gary Oldman","urlProfile":"http://www.imdb.com/name/nm0000198","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NTM4MzQ5MV5BMl5BanBnXkFtZTcwOTE4MDczNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 March 1958","placeOfBirth":" New Cross, London, England, UK","birthName":"Gary Leonard Oldman","height":"5' 8½\" (1.74 m)","bio":"Gary Oldman is a talented British born movie actor who played Sid Vicious in Sid & Nancy, Drexl in True Romance, and George Smiley in Tinker Tailor Soldier Spy. He starred in Dawn of the Planet of the Apes and the remake of RoboCop. He is also an English filmmaker, musician and author. Renowned for his \"big\" acting style, Oldman is one of the most celebrated thespians of his generation, with a diverse career encompassing theatre, film and television. Gary Oldman was born on March 21, 1958 in New Cross, London, England, the son of Kathleen (Cheriton), a homemaker, and Leonard Bertram Oldman, a welder. For most of his career he was best-known for playing over-the-top antagonists such as the role of Russian terrorist Egor Korshunov in the 1997 blockbuster Air Force One, though he has recently reached a new audience with heroic roles in the Harry Potter and Dark Knight franchises. In amazing trivia, he was in Batman Begins and The Fifth Element. Oldman won a scholarship to Britain's Rose Bruford Drama College, in Sidcup, Kent, where he received a B.A. in theatre arts in 1979. He subsequently studied with the Greenwich Young People's Theatre and went on to appear in a number of plays throughout the early '80s, including \"The Pope's Wedding,\" for which he received Time Out's Fringe Award for Best Newcomer of 1985-1986 and the British Theatre Association's Drama Magazine Award as Best Actor for 1985. Before fame, he was employed as a worker in assembly lines, and as a porter in an operating theater. He also got jobs selling shoes and beheading pigs while supporting his early acting career. He was also in the movie The Dark Knight with Heath Ledger. His film debut was Remembrance (1982), though his most-memorable early role came when he played Sex Pistol Sid Vicious in the biopic Sid and Nancy (1986) picking up the Evening Standard Film Award as Best Newcomer. He then received a Best Actor nomination from BAFTA for his portrayal of '60s playwright Joe Orton in Prick Up Your Ears (1987). In the 1990s, Oldman brought to life a series of iconic real-world and fictional villains including Lee Harvey Oswald in JFK (1991), the title character in Bram Stoker's Dracula (1992), Drexl Spivey in True Romance (1993), Stansfield in Léon: The Professional (1994), Jean-Baptiste Emanuel Zorg in The Fifth Element (1997) and Ivan Korshunov in Air Force One (1997). That decade also saw Oldman portraying Ludwig van Beethoven in biopic Immortal Beloved (1994). Oldman scored the coveted role of Sirius Black in Harry Potter and the Prisoner of Azkaban (2004), giving him a key part in one of the highest-grossing franchises ever. He reprised that role in Harry Potter and the Goblet of Fire (2005) and Harry Potter and the Order of the Phoenix (2007). Oldman also took on the iconic role of Detective James Gordon in writer-director Christopher Nolan's Batman Begins (2005), a role he played again in The Dark Knight (2008) and The Dark Knight Rises (2012). Prominent film critic Mark Kermode, in reviewing The Dark Knight, wrote, \"the best performance in the film, by a mile, is Gary Oldman's ... it would be lovely to see him get a[n Academy Award] nomination because actually, he's the guy who gets kind of overlooked in all of this.\" Oldman co-starred with Jim Carrey in the 2009 version of A Christmas Carol in which Oldman played three roles. He had a starring role in David Goyer's supernatural thriller The Unborn, released in 2009. In 2010, Oldman co-starred with Denzel Washington in The Book of Eli. He also played a lead role in Catherine Hardwicke's Red Riding Hood. Oldman voiced the role of villain Lord Shen and was nominated for an Annie Award for his performance in Kung Fu Panda 2. In 2011, Oldman portrayed master spy George Smiley in the adaptation of John le Carré's La taupe (2011), and the role scored Oldman his first Academy Award nomination. In 2014, he played one of the lead humans in the science fiction action film Dawn of the Planet of the Apes (2014). Also in 2014, Oldman starred alongside Joel Kinnaman, Abbie Cornish, Michael Keaton, and Samuel L. Jackson in the remake of RoboCop (2014), as Norton, the scientist who creates RoboCop. Also that year, Oldman starred in Dawn of the Planet of the Apes as one of the leads alongside Jason Clarke and Keri Russell. Aside from acting, Oldman tried his hand at writing and directing for Nil by Mouth (1997). The movie opened the Cannes Film Festival in 1997, and won Kathy Burke a Best Actress prize at the festival. Oldman has three children - one with first wife Lesley Manville, and two with third wife Donya Fiorentino. He married Alexandra Edenborough on December 31, 2008 until they divorced in January 2015. He was married to actress Uma Thurman from 1990 to 1992. He married his fourth wife Alexandra Edenborough in 2008 but the couple divorced in 2015. He has three sons named Alfie, Gulliver and Charlie.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NTM4MzQ5MV5BMl5BanBnXkFtZTcwOTE4MDczNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000198","name":"Gary Oldman","nicknames":["Gaz"],"idIMDB":"nm0000198"},"actorId":"nm0000198","character":"Sid Vicious","urlCharacter":"http://www.imdb.com/character/ch0021219","main":true},{"actorName":"Chloe Webb","urlProfile":"http://www.imdb.com/name/nm0916050","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc4MDQ0OTM5M15BMl5BanBnXkFtZTcwOTY0MzMyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 June 1956","placeOfBirth":" Greenwich Village, New York, USA","bio":"Chloe Webb studied at the Boston Conservatory of Drama and Music. She wrote for and acted in the New York Comedy review \"Forbidden Broadway\". Won New York Film Critics and National Society of Film Critics awards for her film debut role as drug addict Nancy Spungen in the cult classic Sid and Nancy (1986). Appeared a year later opposite Brian Dennehy in The Belly of an Architect (1987). She played the role of Louisa Kracklite. Other notable film credits include: Twins (1988), A Dangerous Woman (1993), Armistead Maupin's Tales of the City (1993), She's So Lovely (1997) and Practical Magic (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc4MDQ0OTM5M15BMl5BanBnXkFtZTcwOTY0MzMyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0916050","name":"Chloe Webb","idIMDB":"nm0916050"},"actorId":"nm0916050","character":"Nancy Spungen","urlCharacter":"http://www.imdb.com/character/ch0021219","main":true},{"actorName":"David Hayman","urlProfile":"http://www.imdb.com/name/nm0371342","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MzI2NTQ3Ml5BMl5BanBnXkFtZTcwNzg3NjAxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1950","placeOfBirth":" Bridgeton, Glasgow, Scotland, UK","height":"5' 8\" (1.73 m)","bio":"David Hayman was born in 1950 in Bridgeton, Glasgow, Scotland. He is an actor and director, known for Sid and Nancy (1986), The Boy in the Striped Pajamas (2008) and Hope and Glory (1987).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MzI2NTQ3Ml5BMl5BanBnXkFtZTcwNzg3NjAxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0371342","name":"David Hayman","idIMDB":"nm0371342"},"actorId":"nm0371342","character":"Malcolm","urlCharacter":"http://www.imdb.com/character/ch0371806","main":true},{"actorName":"Debby Bishop","urlProfile":"http://www.imdb.com/name/nm0084033","urlPhoto":"","biography":{"bio":"Debby Bishop is an actress, known for Sid and Nancy (1986), Blue Money (1985) and Scrubbers (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0084033","name":"Debby Bishop","idIMDB":"nm0084033"},"actorId":"nm0084033","character":"Phoebe","urlCharacter":"http://www.imdb.com/character/ch0371809","main":true},{"actorName":"Andrew Schofield","urlProfile":"http://www.imdb.com/name/nm0774508","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzk2Nzc4MV5BMl5BanBnXkFtZTcwMzQ2Nzc4NA@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1962","placeOfBirth":" Kirkby, Liverpool, Merseyside, England, UK","bio":"Andrew Schofield was born in 1962 in Kirkby, Liverpool, Merseyside, England. He is an actor, known for Sid and Nancy (1986), Hamlet (1996) and A Heap of Trouble (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzk2Nzc4MV5BMl5BanBnXkFtZTcwMzQ2Nzc4NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0774508","name":"Andrew Schofield","idIMDB":"nm0774508"},"actorId":"nm0774508","character":"John","urlCharacter":"http://www.imdb.com/character/ch0371812","main":true},{"actorName":"Xander Berkeley","urlProfile":"http://www.imdb.com/name/nm0075359","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMjA1OTEwOTheQTJeQWpwZ15BbWU2MDkxODgxMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 December 1955","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Alexander Harper Berkeley","height":"6' (1.83 m)","bio":"Xander's father was a painter and his mother a school teacher who sewed, providing him with costumes (his preference over toys). School plays and Community Theater were next. An experimental theater troupe in the area (which was an offshoot from Joseph Chaikin's Open Theater in New York) took Xander under their wing when he was 16. He credits this group for shaping him as both a person and an actor, committed to taking risks and remaining open to the unknown. Xander went to Hampshire College, the progressive brainchild of Smith, Mt. Holyoke, Amherst, and the University of Massachusetts. He would continue in the theater at Hampshire, studying and doing plays at each of the other schools, all of which were there in the area. A move to New York after college brought him access to private teachers from the Royal Academy of the Arts, the Moscow Arts Theater and HB Studios. Later in Los Angeles, Xander would spend time with Lee Strasberg at The Actor's Studio during the last years of his life. Xander worked in Regional and Repertory Theaters in addition to off-Broadway while living in New York but, despite a classically trained theater background, he was increasingly drawn to the subtleties of film acting. A play, written by the great southern novelist Reynolds Price, called \"Early Dark\" had such a cinematic feel to it, that an agent saw the film acting potential in Xander and encouraged him to make the move out west. Soon Mommie Dearest (1981) provided Xander with his film debut in the role of \"Christopher Crawford\", and simultaneously gave his career a slightly cultish twist. Alex Cox with Sid and Nancy (1986), James Cameron with Terminator 2: Judgment Day (1991), Bernard Rose with Candyman (1992), Todd Haynes with Safe (1995), Mike Figgis with Leaving Las Vegas (1995), Andrew Niccol with Gattaca (1997) all helped to further associate Xander as an actor in his own rather unusual category. Xander's choices were often determined by the opportunity to learn from directors he admired, certainly all those listed above fell into that category. Clint Eastwood with The Rookie (1990), Ron Howard with Apollo 13 (1995), Rob Reiner with A Few Good Men (1992), Michael Mann with Heat (1995), Wolfgang Petersen with Air Force One (1997), Steven Spielberg with Amistad (1997) are obvious examples of others Xander actively sought to work with and learn from. From obscure independent movies where Xander could play lead roles to the big budget studio movies where he might often play smaller character-driven parts, an education was taking place. Just as working with older directors like Mihalis Kakogiannis on La cerisaie (1999) and Robert M. Young on Human Error (2004) (aka \"Human Error\") brought insights to ways of working that are being lost in pop cultures tendency to slide toward slickness. Not to mention bringing him to places like Bulgaria and China along the way. Perhaps because a life in the foreign services, or espionage was seen as a road not taken, living on location in foreign countries, working as an actor, has somewhat fulfilled the impulse. As early as 1987, a film took Xander to Nicaragua while the Contra War was taking place. It was during this three month shoot on the film Walker (1987) (starring Ed Harris) that Xander got an offer to do a film with his friend, director Jon Hess, in Chile for the following three months. Taking him straight from the revolutionary left-wing Sandanistas to Pinochet's fascist, right-wing regime. In 2001, an offer came in to play a part on a TV pilot called 24 (2001). It was another shady agent-type, and reluctant to repeat his performance from Air Force One (1997) as the turncoat secret serviceman, Xander almost passed on the job. Fortunately for him, he said yes. He met his future wife, Sarah Clarke during the first day of filming. His character, \"George Mason\", was just a guest star in the pilot, but the producers liked what Xander brought to it and continued to write more episodes for him. By the second season, it had become perhaps the most interesting, leveled character Xander had ever gotten to play. Sarah and Xander were married in 2002 and had their daughters, Olwyn in 2006 and Rowan in 2010. Other favorite roles of late have been \"Arlen Pavich\", the middle management dweeb, in Niki Caro's North Country (2005), and the Irish hooligan/railway foreman in David Von Ancken's Seraphim Falls (2006) and, more recently, \"The King of Sodom\" in Harold Ramis' Year One (2009), \"Sonny\" in David Pomes' Cook County (2009), the recovering meth head coming out of prison to discover the life he had left (and destroyed), and crazy \"Uncle Doug\" in David Wike's Out There (2006) (aka \"Out There\").","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMjA1OTEwOTheQTJeQWpwZ15BbWU2MDkxODgxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0075359","name":"Xander Berkeley","idIMDB":"nm0075359"},"actorId":"nm0075359","character":"Bowery Snax","urlCharacter":"http://www.imdb.com/character/ch0371813","main":true},{"actorName":"Perry Benson","urlProfile":"http://www.imdb.com/name/nm0072610","urlPhoto":"","biography":{"dateOfBirth":"9 April 1961","placeOfBirth":" St Pancras, London, England, UK","birthName":"Perry J. S. Benson","height":"5' 5\" (1.65 m)","bio":"Perry Benson was born on April 9, 1961 in St Pancras, London, England as Perry J. S. Benson. He is an actor and writer, known for This Is England (2006), Sid and Nancy (1986) and Somers Town (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0072610","name":"Perry Benson","nicknames":["Pel or Pezza"],"idIMDB":"nm0072610"},"actorId":"nm0072610","character":"Paul","urlCharacter":"http://www.imdb.com/character/ch0371822","main":true},{"actorName":"Tony London","urlProfile":"http://www.imdb.com/name/nm0518793","urlPhoto":"","biography":{"dateOfBirth":"1961","placeOfBirth":" London, England, UK","bio":"Tony London was born in 1961 in London, England. He is an actor, known for The Elephant Man (1980), Sid and Nancy (1986) and 24 Hours in London (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0518793","name":"Tony London","idIMDB":"nm0518793"},"actorId":"nm0518793","character":"Steve","urlCharacter":"http://www.imdb.com/character/ch0371951","main":true},{"actorName":"Sandy Baron","urlProfile":"http://www.imdb.com/name/nm0056310","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MTI5OTU2Nl5BMl5BanBnXkFtZTcwNTI2NDE0NA@@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1936","placeOfBirth":" New York City, New York, USA","birthName":"Sanford Irving Beresofsky","bio":"Sandy Baron was born Sanford Beresofsky in Brooklyn, New York on May 5, 1936. Raised in Brooklyn's Brownsville neighborhood, the young Sandy attended public schools and participated in accelerated classes. A graduate of Brooklyn College, he spent his early years working summers in the Catskill Mountain resorts that were the breeding grounds of many Jewish comedians. Baron made his Broadway debut in \"Tchin-Tchin\" on Oct 25, 1962. His next play, Bertolt Brecht's \"Arturo Ui\" with Christopher Plummer in the title role, was a flop, lasting but eight performances in November 1963. His next appearance on the Great White Way, in the comedy \"Generation,\" was more successful, playing for over half a year in the 1965-1966 season. In 1964, Sandy -- already a seasoned Catskill comic and nightclub performer -- released a 13-track album on Roulette Records, \"The Race! Race!\" The album jacket pronounced it a \"rollicking comedy album about hate, prejudice, bigotry and other such nonsense.\" He established a national reputation that year on the television comedy series That Was the Week That Was (1964), the American version of the hit British TV show, both of which starred David Frost. He followed it up with a lead role in the TV series Hey, Landlord (1966), playing a stand-up comedian. In the 1970s, he made regular appearances on the The Mike Douglas Show (1961) and the The Merv Griffin Show (1962). Baron played Lenny Bruce in the show \"Lenny\" at Hollywood's Aquarius Theater in 1972, and eventually replaced Cliff Gorman in New York in what would prove to be his last Broadway appearance. Baron appeared as himself in Woody Allen's Broadway Danny Rose (1984), the director's homage to borscht-belt comedy. In the 1990s, he appeared as Jack Klompus, the nemesis of Jerry Seinfeld's father on the hit TV series Seinfeld (1989). He replaced Al Lewis as Grandpa Munster in the TV movie The Munsters' Scary Little Christmas (1996). His last movie appearance was in Stephen Frears' The Hi-Lo Country (1998). Sandy Baron died of emphysema on January 21, 2001 in a nursing home in Van Nuys, California. A memorial celebration was held on July 22, 2001 at Hollywood's Ivar Theater.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MTI5OTU2Nl5BMl5BanBnXkFtZTcwNTI2NDE0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0056310","name":"Sandy Baron","nicknames":["Bez"],"idIMDB":"nm0056310"},"actorId":"nm0056310","character":"Hotelier - U.S.A.","urlCharacter":"http://www.imdb.com/character/ch0371942","main":true},{"actorName":"Sy Richardson","urlProfile":"http://www.imdb.com/name/nm0724784","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MzdjNDctMmJhMi00MWM5LWFiNjgtZGM0NThmZWM0Yjc0L2ltYWdlXkEyXkFqcGdeQXVyMTk3NjIzNw@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1941","placeOfBirth":" Cincinnati, Ohio, USA","height":"5' 10\" (1.78 m)","bio":"Sy Richardson was born in Cincinnati, Ohio and raised in Chicago Illinois. He attended fourteen elementary schools, five high schools and three colleges before he figured it out. An artist is a free spirit and boredom is a breath away from than death. He is married to a former Blue Satin model. Sy has one step daughter and two granddaughters. He started singing at twelve and recorded his first record with Lil June and the Januarys at sixteen. Served two years on active duty with the United States Navy. Richardson graduated from UC Boulder with a BS in Journalism specializing in advertising. After a short stint with several Colorado newspapers, he opted to act and joined the Heritage Square Opera House. He performed in vaudeville shows and Olios for two years and moved to Hollywood. His career has taken him to film locations from the US to Europe, South America and Australia. Sy Richardson has traveled around the country doing lectures on How to Live in Work in Hollywood. He co-produced and directed the Symposium 98, a documentary, for the SAG/AFTRA EEOC department. He directed \"TREE\" for the Los Angeles Opera Foundation. His direction of \"South Of Where We Live\" won one out of three nominations for the NAACP Image Awards in 1988. Summers In Suffolk was nominated for three NAACP Image Awards in 1996. Passing won two out ten NAACP nominations in 1997. Sy's (someone stole your fries) McDonald's spot, received the 3 star positions for Advertising Age Magazine in 1998. Mr. Richardson teaches a Bible Study class for adult entertainers. Sy is a member of the Desi International Film Festival, Fisk University International Black Film Festival board, the Biola University Studio Task Force, Board of Directors for the Towne Street Theater, He chaired the SAG Casting Committee for three years and taught a cold reading class for the SAG Conservatory and a former member on the Board of Directors for the Screen Actors Guild. Sy teaches his own Acting Workshop in No Ho California, a Children's Musical Theater Camp and a beginning acting workshop for the Towne Street Theater. He is also a member of the International Society for Excellence in Christian Film and Television. He is the artistic director for the Drama Ministry at Heart of the Canyons Church in Newhall, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MzdjNDctMmJhMi00MWM5LWFiNjgtZGM0NThmZWM0Yjc0L2ltYWdlXkEyXkFqcGdeQXVyMTk3NjIzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0724784","name":"Sy Richardson","idIMDB":"nm0724784"},"actorId":"nm0724784","character":"Methadone Caseworker","urlCharacter":"http://www.imdb.com/character/ch0371824","main":true},{"actorName":"Edward Tudor-Pole","urlProfile":"http://www.imdb.com/name/nm0876128","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc4ODQ1MDgwOF5BMl5BanBnXkFtZTcwMzYwMzAyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 December 1955","placeOfBirth":" Lambeth, Central London, England, UK","bio":"As Eddie Tenpole was considered as replacement for Johnny Rotten in the Sex Pistols, and recorded \"Rock around the Clock\" with the band on \"The Great Rock and Roll Swindle\" LP. Had some chart success with his own band Tenpole Tudor, principally \"Swords of a Thousand Men\". Took over from Richard O'Brien as host of UK gameshow \"The Crystal Maze\" in the early 1990s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc4ODQ1MDgwOF5BMl5BanBnXkFtZTcwMzYwMzAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0876128","name":"Edward Tudor-Pole","idIMDB":"nm0876128"},"actorId":"nm0876128","character":"Hotelier - U.K.","urlCharacter":"http://www.imdb.com/character/ch0371942","main":true},{"actorName":"Biff Yeager","urlProfile":"http://www.imdb.com/name/nm0947010","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA3MTIzNTIyNV5BMl5BanBnXkFtZTYwODcxNDcy._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Biff Yeager is an actor and producer, known for Edward Scissorhands (1990), Ed Wood (1994) and Batman Returns (1992).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA3MTIzNTIyNV5BMl5BanBnXkFtZTYwODcxNDcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0947010","name":"Biff Yeager","idIMDB":"nm0947010"},"actorId":"nm0947010","character":"Detective","urlCharacter":"http://www.imdb.com/character/ch0371826","main":true},{"actorName":"Courtney Love","urlProfile":"http://www.imdb.com/name/nm0001482","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5MDk5OTI1MF5BMl5BanBnXkFtZTcwNjE5NDE5Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1964","placeOfBirth":" San Francisco, California, USA","birthName":"Courtney Michelle Harrison","height":"5' 8½\" (1.74 m)","bio":"The daughter of Grateful Dead devotee and first manager Hank Harrison and psychotherapist Linda Caroll, Courtney Love was born Courtney Michelle Harrison in San Francisco, California in 1964. Love spent her early years living in hippie communes in Oregon and at schools in Europe and New Zealand, under the care of her mother and other family members. By age 16, Love became legally emancipated and traveled throughout Europe, living off of a small trust fund left behind by her grandmother. Love eventually returned to Portland, Oregon, still pursuing music, and then moved around to various locations in the United States before making her break into the industry. As a musician, she played in early incarnations of Babes In Toyland and Faith No More, as well as acting in bit parts for some Alex Cox films. In 1989, she started her own band, Hole, and in 1992 married Nirvana singer Kurt Cobain, giving birth to their daughter, Frances Bean Cobain, that same year. After Cobain's suicide in 1994, and the release of Hole's second album \"Live Through This\", Love continued to thrill her fans and enrage her detractors with her on- and off-stage antics. By 1998, Hole had released their third studio album, \"Celebrity Skin\", and Love had attracted cinematic notoriety for her performance in The People vs. Larry Flynt (1996), which not only garnered her a Golden Globe nomination, but recognition as a serious performer. Early into the millennium, Hole broke up, and Love took some supporting roles in films such as Trapped (2002), but her rocky past and propensity toward drug addiction eventually caught up with her, sending her through a whirlwind of numerous health and legal issues. After unsuccessful stints in and out of drug rehabilitation centers, Love was ordered by the L.A. county court to three months in lock down rehab, which came to an end in 2006. Love soon after released a scrapbook-like diary recounting her life, titled \"Dirty Blonde: The Diaries of Courtney Love\", and continued writing music, testifying her sobriety to the press and public. In 2009, after losing custody of daughter Frances Bean Cobain for unrelated reasons, Love re-formed Hole with an entirely new lineup, and soon after released the band's first album in ten years, titled \"Nobody's Daughter\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5MDk5OTI1MF5BMl5BanBnXkFtZTcwNjE5NDE5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001482","name":"Courtney Love","nicknames":["CLover"],"idIMDB":"nm0001482"},"actorId":"nm0001482","character":"Gretchen","urlCharacter":"http://www.imdb.com/character/ch0371900","main":true},{"actorName":"Rusty Blitz","urlProfile":"http://www.imdb.com/name/nm0088561","urlPhoto":"","biography":{"dateOfBirth":"1928","placeOfBirth":"","bio":"Rusty Blitz was born in 1928. He is an actor and cinematographer, known for Young Frankenstein (1974), Sid and Nancy (1986) and The Frisco Kid (1979).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0088561","name":"Rusty Blitz","idIMDB":"nm0088561"},"actorId":"nm0088561","character":"Reporter","urlCharacter":"http://www.imdb.com/character/ch0371854","main":true},{"actorName":"John Spacely","urlProfile":"http://www.imdb.com/name/nm0816481","urlPhoto":"","biography":{"bio":"John Spacely is known for his work on Gringo (1985), Sid and Nancy (1986) and Step Across the Border (1990). He died in 1992.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0816481","name":"John Spacely","idIMDB":"nm0816481"},"actorId":"nm0816481","character":"Chelsea Resident","urlCharacter":"http://www.imdb.com/character/ch0371901","main":true}],"seasons":[],"idIMDB":"tt0091954","urlIMDB":"http://www.imdb.com/title/tt0091954","business":{"budget":{"money":"$4,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"SEK","country":"843,723","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 52 min (112 min)","1 hr 50 min (110 min) (Australia)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":["3,098 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.1","filmingLocations":[{"location":"Bramley Arms Pub, Bramley Road, Notting Hill, London, England, UK"}],"rated":"R","awards":[{"award":"BAFTA Awards 1987","titlesAwards":[{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best Make Up Artist","names":[{"name":"Peter Frampton","id":"nm0289760","role":null}]}]}]},{"award":"Boston Society of Film Critics Awards 1987","titlesAwards":[{"titleAwardOutcome":"Won BSFC Award","categories":[{"category":"Best Actress","names":[{"name":"Chloe Webb","id":"nm0916050","role":null}]}]}]},{"award":"Evening Standard British Film Awards 1987","titlesAwards":[{"titleAwardOutcome":"Won Evening Standard British Film Award","categories":[{"category":"Most Promising Newcomer","names":[{"name":"Gary Oldman","id":"nm0000198","role":null}]}]}]},{"award":"National Society of Film Critics Awards, USA 1987","titlesAwards":[{"titleAwardOutcome":"Won NSFC Award","categories":[{"category":"Best Actress","names":[{"name":"Chloe Webb","id":"nm0916050","role":null}]}]}]},{"award":"New York Film Critics Circle Awards 1986","titlesAwards":[{"titleAwardOutcome":"3rd place NYFCC Award","categories":[{"category":"Best Actress","names":[{"name":"Chloe Webb","id":"nm0916050","role":null}]}]}]},{"award":"São Paulo International Film Festival 1986","titlesAwards":[{"titleAwardOutcome":"Won Critics Award","categories":[{"category":"","names":[{"name":"Alex Cox","id":"nm0007182","role":null}]}]}]}],"votes":"24,341","type":"Movie","companyCreditsSimple":[{"idCompany":"co0046018","name":"Initial Pictures"},{"idCompany":"co0103620","name":"U.K. Productions Entity"},{"idCompany":"co0041491","name":"Zenith Entertainment"}],"keywords":{"keywords":["vomiting","sex","sex pistols","british","bassist","death","murder","punk rock","heroin","british renaissance","horseback riding","stud","femicide","river thames","punk music","great britain","united kingdom","england","manhattan new york city","walking through a glass door","vietnam","vein","vacuum cleaner","tv show","tour bus","toilet","toilet stall","taxi driver","tavern","stripper","strip club","street market","starvation","squalor","spray paint","spitting","song","smack the drug","singing","singer","shopping","shooting up","semi truck","self destructiveness","seduction","rude boy","rolls royce","rock 'n' roll","riot","reference to thomas wolfe","reference to the osbornes","reference to tennessee williams","reference to telly savalas","reference to stevie nicks","reference to rod stewart","reference to queen elizabeth ii","reference to lily langtry","reference to gary glitter","reference to dylan thomas","reference to debbie harry","reference to bruce springsteen","reference to bob dylan","reference to arthur miller","recording studio","policeman","police car","photographer","phone booth","obscene finger gesture","nudity","nightclub","musician","motorcycle","mother son relationship","mother daughter relationship","mirror","midget","marriage","london bridge","leather jacket","kiss","junkie","interrogation","illness","hypodermic needle","husband wife relationship","hunger","hope","hippie","heroin addict","hepatitis","helicopter","hanging out a window","hanging from the ceiling","hammer and sickle","guitar","guitar player","groupie","grandmother granddaughter relationship","grandfather granddaughter relationship","free love","fight","fascist","family relationships","fake blood","face slap","exercycle","dyed hair","dwarf","drunkenness","drug use","drug deal","drug dealer","drinking","devotion","destiny","despair","depression","dancer","dance club","crying","concert","cigarette smoking","christmas","chelsea hotel manhattan new york city","champagne","camper","camera","bruise","broken heel","breaking a window","breaking glass","breaking a car window","boredom","bondage","blood","black leather","biting hand","beer","beating","bashing someone's head into a wall","bar","barbie doll","baby","american express","airplane stewardess","action man doll","cult film","female nudity","drug addict","drug addiction","world trade center manhattan new york city","window smashing","vandalism","tour boat","taxi","subway","stabbing","rooftop","rock star","rock music","rock club","rock band","police","paris france","nonlinear timeline","methadone","male nudity","loss of girlfriend","limousine","jail","hotel","hospital","graffiti","gay slur","fire","filmmaking","fantasy sequence","fake shooting","drug dealing","drink thrown into someone's face","doomed love","dominatrix","domestic violence","dancing","bus","assault","arrest","1970s","new york city","london england","drugs","sadomasochism","independent film","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 05:54:03"}}