{"data":{"movies":[{"title":"The Mad Adventures of 'Rabbi' Jacob","originalTitle":"Les aventures de Rabbi Jacob","year":"1973","releaseDate":"19731018","directors":[{"name":"Gérard Oury","id":"nm0653620"}],"writers":[{"name":"Gérard Oury","id":"nm0653620"},{"name":"Danièle Thompson","id":"nm0860019"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2MTEwMzczMjFeQTJeQWpwZ15BbWU2MDkwMDQxOQ@@._V1.jpg","countries":["France","Italy"],"languages":["French","English","Hebrew","Yiddish","Arabic"],"genres":["Comedy"],"plot":"In this riot of frantic disguises and mistaken identities, Victor Pivert, a blustering, bigoted French factory owner, finds himself taken hostage by Slimane, an Arab rebel leader. The two dress up as rabbis as they try to elude not only assasins from Slimane's country, but also the police, who think Pivert is a murderer. Pivert ends up posing as Rabbi Jacob, a beloved figure who's returned to France for his first visit after 30 years in the United States. Adding to the confusion are Pivert's dentist-wife, who thinks her husband is leaving her for another woman, their daughter, who's about to get married, and a Parisian neighborhood filled with people eager to celebrate the return of Rabbi Jacob.","simplePlot":"A bigoted Frenchman finds himself forced to impersonate a popular rabbi while on the run from a group of assassins - and the police.","actors":[{"actorName":"Louis de Funès","urlProfile":"http://www.imdb.com/name/nm0000086","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc5NTkyMDU4Nl5BMl5BanBnXkFtZTgwNzk0NTM1NTE@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1914","placeOfBirth":" Courbevoie, Seine [now Hauts-de-Seine], France","birthName":"Louis Germain de Funès de Galarza","height":"5' 4½\" (1.64 m)","bio":"Louis Germain David de Funès de Galarza was born on July 31, 1914, in Courbevoie, France. His father, named Carlos Luis de Funes de Galarza, was a former lawyer of Seville, Spain, who became a diamond cutter. His mother, named Leonor Soto Reguera, was of Spanish and Portugese extraction. Young Louis de Funès was fond of drawing and piano playing. He dropped out of school and worked various jobs, mostly as a jazz pianist at Pigalle, making his customers laugh every time he made a grimace. He studied acting for one year at the Simon acting school. There he made some useful contacts, including Daniel Gélin among others. During the occupation of Paris in the Second World War, he continued his piano studies at a music school, where he fell in love with a secretary, named Jeanne de Maupassant, a grand-niece of writer Guy de Maupassant. She had fallen in love with \"the young man who played jazz like god\"; they married in 1943, and had two sons born in 1944 and 1949. Funès continued playing piano at clubs, knowing there wasn't much call for a short, balding, skinny actor. His wife and Daniel Gelin encouraged him until he managed to overcome his rejection. He made his film debut in 1945, at the age of 31, and went on playing about one hundred film roles in the next twenty years. Louis de Funès shot to international fame in the 1960's after his roles in such slapstick comedies as 'Le gendarme de St. Tropez' (The Gendarme of St. Tropez 1964) and the Fantomas (1964) trilogy. He brilliantly portrayed a funny French policeman, whose hilarious hyperactivity, uncontrolled anger, and sardonic laughter produced a highly comic effect. Funès was voted the most favorite actor in France in 1968, and remained very popular in Europe during the 1970's. He also continued to play on stage during his career as a film star, and was acclaimed for his stage works in classic French theatre. Funès was instrumental in making film adaptations of such theatre plays as 'Oscar continues' and the Moliere's 'Le Misere', among other plays. Nicknamed \"the man with the forty faces per minute\", Louis de Funès played bit parts in over eighty films, before he got his first leading roles, eventually becoming the leading French comedian. He co-starred with the major French actors of the time, including Jean Marais and Mylène Demongeot in the Fantomas trilogy, and also Jean Gabin, Fernandel, Bourvil, Coluche, Annie Girardot, and Yves Montand. Funès's collaboration with director 'Gerard Oury' produced a memorable tandem of Funès-Bourvil. He also worked with Jean Girault in the famous 'Gendarmes' series. In a departure from the Gendarme image, Funès collaborated with Claude Zidi, who wrote for him a new character full of nuances and frankness in L'aile ou la cuisse (1976), which is arguably the best of his roles. Funès played over 130 roles in film and over 100 roles on stage. From 1943-1983 Louis de Funès was married to Jeanne Barthelemy de Maupassant. Their son, named 'Olivier De Funes' , had a brief acting career before becoming a pilot with Air France, his other son, named Patric de Funes, became a medical doctor. Louis de Funès was also a rose grower, a variety of roses has been named the \"Louis de Funès rose\" after him. He died of a heart attack and complications of a stroke on January 27, 1983, in Nantes, France. He was laid to rest in the Cimetière du Cellier, and a monument of him was erected in the rose-garden of his wife's castle.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc5NTkyMDU4Nl5BMl5BanBnXkFtZTgwNzk0NTM1NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000086","name":"Louis de Funès","nicknames":["Fufu"],"idIMDB":"nm0000086"},"actorId":"nm0000086","character":"Victor Pivert","urlCharacter":"http://www.imdb.com/character/ch0164580","main":true},{"actorName":"Suzy Delair","urlProfile":"http://www.imdb.com/name/nm0216177","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MjgwMjEyMV5BMl5BanBnXkFtZTgwMjExNDc3NTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1917","placeOfBirth":" Paris, France","birthName":"Suzanne Pierrette Delaire","bio":"Prototype of the sexy cheeky French lady, Suzy Delair was discovered by Henri-Georges Clouzot, who became her companion and gave her two memorable roles : Mila Malou, inspector Wens' unbearable girlfriend in two films, Le dernier des six (1941), which he wrote, and L'assassin habite... au 21 (1942), which he penned and directed; and the mythical one of Jenny Lamour, a frivolous music-hall singer prepared to do anything to become famous who makes her poor husband insanely jealous in Quai des Orfèvres (1947). The rest of her filmography is rather disappointing, with a few exceptions such as Jean Grémillon's Pattes blanches (1949) , where she is -once again - an unfaithful companion ; Gervaise (1956), René Clément's masterpiece as Gervaise's obnoxious rival or Luchino Visconti's Rocco and His Brothers (1960), another cinema milestone, even if her part in this film is minor. An excellent singer (Who has forgotten \"Avec son tra la la\"?), delightful in operettas, Suzy Delair could hardly choose between her two careers. This may be the reason why she missed out on more great roles than she finally interpreted. Nevertheless, Mila Malou and Jenny Lamour are now part of the French film heritage. Not everybody can boast having left such an imprint on several generations of movie-goers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MjgwMjEyMV5BMl5BanBnXkFtZTgwMjExNDc3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0216177","name":"Suzy Delair","idIMDB":"nm0216177"},"actorId":"nm0216177","character":"Germaine Pivert","urlCharacter":"http://www.imdb.com/character/ch0164582","main":true},{"actorName":"Marcel Dalio","urlProfile":"http://www.imdb.com/name/nm0197950","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyODk3OTIyOF5BMl5BanBnXkFtZTcwNDMwMjgwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 July 1900","placeOfBirth":" Paris, France","birthName":"Israel Moshe Blauschild","height":"5' 6\" (1.68 m)","bio":"Sunday, November the 20th is the anniversary of Marcel Dalio's death in 1983. It was the end of a serendipitous life. You know him. He was a citizen of the world. Born Israel Moshe Blauschild, in Paris, in 1900, he became a much sought-after character actor. His lovely animated face with its great expressive eyes became familiar across Europe. He appeared in Jean Renoir's idiosyncratic \"Rules of the Game\" (The Rules of the Game (1939)) and \"Grand Illusion\" (La Grande Illusion (1937)), arguably the greatest of all films. True to his Frenchman's heart, he married the very young, breathtaking beauty Madeleine Lebeau. He worked with von Stroheim and Pierre Chenal. He had it all. But then the Germans crushed Poland, swept across Belgium and pressed on toward Paris. He waited until the last possible moment and finally, with the sound of artillery clearly audible, with Madeleine, fled in a borrowed car to Orleans and then, in a freight train, to Bordeaux and finally to Portugal. In Lisbon, they bribed a crooked immigration official and were surreptitiously given two visas for Chile. But on arriving in Mexico City, it was discovered the visas were rank forgeries. Facing deportation, Marcel and Madeleine found themselves making application for political asylum with virtually every country in the western hemisphere. Weeks passed until Canada finally issued them temporary visas, and they left for Montreal. Meanwhile, France had fallen and, in the process of subjugating the country, the Germans had found some publicity stills of Dalio. A series of posters were produced and were then displayed throughout the city with the caption 'a typical Jew' so that citizens could more easily report anyone suspected of unrepentant Jewishness. The madness continued. The Curtain Rises (1938), a popular film, was ordered re-edited so that Dalio's scenes could be deleted and re-shot with another, non-Jewish, actor. After a short time, friends in the film industry arranged for them to arrive in Hollywood. Nearly broke, Marcel was immediately put to work in a string of largely forgettable films. Madeleine, a budding actress in her own right, was ironically cast in Hold Back the Dawn (1941), a vehicle for Charles Boyer with a plot driven by the efforts of an émigré (Boyer) trying desperately to cross into the United States from Mexico. But the real irony was waiting at Warner Brothers. In early 1942, Jack L. Warner was driving production of a film based on a one act play, 'Everybody Comes to Rick's' but had no screenplay. What he had was a mishmash of treatments loosely based on the play and two previous movies. But he had a projected release date and a commitment to his distributors to have a movie for that time slot and little else. Warner Brothers started to wing it. Shooting started without a screenplay and little plot. Principal players were cast and a director hired but casting calls for supporting roles and bit players continued, and sometime in the early spring Marcel Dalio and Madeleine Lebeau were cast as, respectively, a croupier and a romantic entanglement for the male lead. Veteran screen-writers were hired to produce a running screenplay, sometimes delivering pages of dialogue one day, for scenes to be shot the following day. No one knew exactly where the plot would go or how the story would turn out. No one was sure of the ending. And, of course, they produced a classic, perhaps the finest, American movie. They produced a screenplay of multiple genres, rich with characterizations, perfectly in tune with the unfolding events in Europe and loaded with talent from top to bottom. Oh, and they changed the title to Casablanca (1942). It is so well known, that many lines of long-memorized dialogue have passed into the slang idiom. 'We'll always have Paris', 'I was misinformed', 'Here's looking at you, kid', ' I am shocked! Shocked! To find that there's gambling going on in here!', 'Louis, I think this is the beginning of a beautiful friendship', 'Oh he's just like any other man, only more so', 'I don't mind a parasite. I object to a cut-rate one', 'Round up the usual suspects', and, of course, the iconic 'Play it, Sam,' often misquoted as 'Play it again, Sam,' the title of the Woody Allen movie. Madeleine Lebeau plays Yvonne, the jilted lover of Humphrey Bogart, who is seen drowning her sorrows at the bar early in the film and who later, to get back at Rick and looking for solace takes up with a German officer finding only self-hatred. She is luminous. And when Claude Rains delivers the signature line, 'I'm shocked! Shocked! To find that there's gambling going on in here!' the croupier, Emil, played by Marcel Dalio, approaches from the roulette table and says simply, 'Your winnings, sir.' It is a delicious moment ripe with scripted irony, one among many in this film, but one made all the more so, knowing where Dalio came from and what he and his wife had endured to arrive at that line. Alas, they separated and divorced the next year, both going on to long successful careers. Dalio never remarried. Late in his career, when Mike Nichols was looking for a vaguely familiar face to deliver a long and worldly, near-monologue in Catch-22 (1970), he turned to Dalio. Faced with a hopelessly idealistic young American pilot, Dalio in tight close-up, delivers a discourse on practical people faced with impractical circumstances, of the virtues of expedience in the face of amorality. Using his wonderful plastic features, now beginning to sag, in a voice full of melancholy, the old man reassures the young man that regardless of what 'grand themes' may be afoot in the world, in the end, little matters but survival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyODk3OTIyOF5BMl5BanBnXkFtZTcwNDMwMjgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0197950","name":"Marcel Dalio","idIMDB":"nm0197950"},"actorId":"nm0197950","character":"Rabbi Jacob","urlCharacter":"http://www.imdb.com/character/ch0149183","main":true},{"actorName":"Claude Giraud","urlProfile":"http://www.imdb.com/name/nm0320774","urlPhoto":"","biography":{"dateOfBirth":"5 February 1936","placeOfBirth":" Chamalières, Puy-de-Dôme, France","bio":"Claude Giraud was born on February 5, 1936 in Chamalières, Puy-de-Dôme, France. He is known for his work on The Mad Adventures of 'Rabbi' Jacob (1973), Angelique: The Road to Versailles (1965) and Angélique (1964).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0320774","name":"Claude Giraud","idIMDB":"nm0320774"},"actorId":"nm0320774","character":"Mohamed Larbi Slimane / Rabbi Zeiligman","urlCharacter":"http://www.imdb.com/character/ch0164581","main":true},{"actorName":"Renzo Montagnani","urlProfile":"http://www.imdb.com/name/nm0598720","urlPhoto":"","biography":{"dateOfBirth":"11 September 1930","placeOfBirth":" Alessandria, Piedmont, Italy","bio":"Renzo Montagnani was born on September 11, 1930 in Alessandria, Piedmont, Italy. He is known for his work on The Mad Adventures of 'Rabbi' Jacob (1973), Mes chers amis 2 (1982) and All My Friends Part 3 (1985). He died on May 22, 1997 in Rome, Lazio, Italy.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0598720","name":"Renzo Montagnani","idIMDB":"nm0598720"},"actorId":"nm0598720","character":"Le colonel Farès","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Janet Brandt","urlProfile":"http://www.imdb.com/name/nm0104935","urlPhoto":"","biography":{"dateOfBirth":"13 December 1914","placeOfBirth":" New York City, New York, USA","bio":"Janet Brandt was born on December 13, 1914 in New York City, New York, USA. She is known for her work on The Mad Adventures of 'Rabbi' Jacob (1973), Battle of the Bulge (1965) and The Jazz Singer (1980). She died on October 24, 2004 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0104935","name":"Janet Brandt","idIMDB":"nm0104935"},"actorId":"nm0104935","character":"Tzipé Schmoll, la grand-mère","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"André Falcon","urlProfile":"http://www.imdb.com/name/nm0265948","urlPhoto":"","biography":{"dateOfBirth":"28 November 1924","placeOfBirth":" Lyon, Rhône, France","bio":"André Falcon was born on November 28, 1924 in Lyon, Rhône, France. He was an actor, known for Stolen Kisses (1968), The Mad Adventures of 'Rabbi' Jacob (1973) and Captain Conan (1996). He died on July 22, 2009 in Paris, France.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0265948","name":"André Falcon","idIMDB":"nm0265948"},"actorId":"nm0265948","character":"Le ministre","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Xavier Gélin","urlProfile":"http://www.imdb.com/name/nm0350739","urlPhoto":"","biography":{"dateOfBirth":"21 June 1946","placeOfBirth":" Paris, France","bio":"Xavier Gélin was born on June 21, 1946 in Paris, France. He was an actor and producer, known for The Mad Adventures of 'Rabbi' Jacob (1973), La gifle (1974) and S*P*Y*S (1974). He was married to Evelyne Gilbert and Anne Ventura. He died on July 2, 1999 in Paris.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0350739","name":"Xavier Gélin","idIMDB":"nm0350739"},"actorId":"nm0350739","character":"Alexandre, le fils du général","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Henri Guybet","urlProfile":"http://www.imdb.com/name/nm0349869","urlPhoto":"","biography":{"dateOfBirth":"21 December 1936","placeOfBirth":" Paris, France","bio":"Henri Guybet was born on December 21, 1936 in Paris, France. He is an actor, known for The Mad Adventures of 'Rabbi' Jacob (1973), The Pawn (1978) and On a retrouvé la 7ème Compagnie! (1975).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0349869","name":"Henri Guybet","idIMDB":"nm0349869"},"actorId":"nm0349869","character":"Salomon, le chauffeur de Pivert","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Popeck","urlProfile":"http://www.imdb.com/name/nm0691201","urlPhoto":"","biography":{"dateOfBirth":"18 May 1936","placeOfBirth":" Paris, France","birthName":"Judka Herpstu","bio":"Popeck was born on May 18, 1936 in Paris, France as Judka Herpstu. He is an actor and writer, known for The Pianist (2002), The Mad Adventures of 'Rabbi' Jacob (1973) and Cousin cousine (1975).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0691201","name":"Popeck","idIMDB":"nm0691201"},"actorId":"nm0691201","character":"Moishe Schmoll","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Miou-Miou","urlProfile":"http://www.imdb.com/name/nm0591877","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MTQwNjQ3NF5BMl5BanBnXkFtZTcwMzk4ODgwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1950","placeOfBirth":" Paris, France","birthName":"Sylvette Herry","height":"5' 4½\" (1.64 m)","bio":"Miou-Miou was born Sylvette Herry on February 22, 1950, in Paris, France. Her father was a gendarme, her mother was a sales-woman. Young Miou-Miou was selling strawberries helping out at her mother's fruit and vegetable stand at a street market. There she was spotted by actor-director Romain Bouteille, who invited her to work at Cafe de la Gare, a popular Parisian theatre, where Gérard Depardieu and Patrick Dewaere were principal actors. There she began as a cleaning lady, then became a dresser, then an actress. She was nicknamed Miou-Miou by Coluche because she was always nice, quiet, and clean as a kitty. In 1971, Miou-Miou made her film debut in La vie sentimentale de Georges le tueur (1971) (The Sentimental Life of George Le Tueur 1971). At that time she became romantically involved with the fellow actor Patrick Dewaere. Their daughter, named Angele, was born in 1974, but their relationship ended few years later, after their work in several films. Their relationship was portrayed in F comme Fairbanks (1976), and later was documented in _Patrick Dewaere (1992 documentary)_. Miou-Miou has been an unusual personality in the French cinema. She once refused to take the Cesar Award for Best Actress, which she won for the title role in Memoirs of a French Whore (1979). She explained that refusal citing her belief that artists should not compete against each other. Her career was hardly affected by such a gesture. She was nominated for Cesar nine times. Her better known works were made with Gérard Depardieu in Going Places (1974), This Sweet Sickness (1977), Ménage (1986), and Germinal (1993), an adaptation of the eponymous novel by Émile Zola.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MTQwNjQ3NF5BMl5BanBnXkFtZTcwMzk4ODgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0591877","name":"Miou-Miou","idIMDB":"nm0591877"},"actorId":"nm0591877","character":"Antoinette Pivert","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Denise Provence","urlProfile":"http://www.imdb.com/name/nm0699019","urlPhoto":"","biography":{"dateOfBirth":"17 February 1921","placeOfBirth":" Paris, France","bio":"Denise Provence was born on February 17, 1921 in Paris, France. She was an actress, known for The Mad Adventures of 'Rabbi' Jacob (1973), L'Agence Nostradamus (1950) and The Exchange Student (1967). She died on November 14, 2011 in Tours, Indre-et-Loire, France.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0699019","name":"Denise Provence","idIMDB":"nm0699019"},"actorId":"nm0699019","character":"Esther Schmoll","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jacques François","urlProfile":"http://www.imdb.com/name/nm0291979","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjVmN2ViMDMtMzdkOC00OGEyLWJiNDctNDI5MmIzOGZmMzE5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1920","placeOfBirth":" Paris, France","birthName":"Henri Jacques Daniel Paul François","bio":"Jacques François was born on May 16, 1920 in Paris, France as Henri Jacques Daniel Paul François. He is known for his work on The Day of the Jackal (1973), The Toy (1976) and The Troops & Troop-ettes (1982). He was married to Madeleine Delavaivre. He died on November 25, 2003 in Paris.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjVmN2ViMDMtMzdkOC00OGEyLWJiNDctNDI5MmIzOGZmMzE5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0291979","name":"Jacques François","idIMDB":"nm0291979"},"actorId":"nm0291979","character":"Le général","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Claude Piéplu","urlProfile":"http://www.imdb.com/name/nm0686263","urlPhoto":"","biography":{"dateOfBirth":"10 May 1923","placeOfBirth":" Paris, France","birthName":"Claude Léon Auguste Piéplu","bio":"Claude Piéplu was born on May 10, 1923 in Paris, France as Claude Léon Auguste Piéplu. He was an actor, known for Asterix and Obelix vs. Caesar (1999), The Discreet Charm of the Bourgeoisie (1972) and The Tenant (1976). He died on May 24, 2006 in Paris.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0686263","name":"Claude Piéplu","idIMDB":"nm0686263"},"actorId":"nm0686263","character":"Le commissaire divisionnaire Andreani","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Georges Adet","urlProfile":"http://www.imdb.com/name/nm0011948","urlPhoto":"","biography":{"dateOfBirth":"22 July 1894","placeOfBirth":" Paris, France","birthName":"Georges Marcel de Roseville-Adet","bio":"Georges Adet was born on July 22, 1894 in Paris, France as Georges Marcel de Roseville-Adet. He was an actor, known for Love and Death (1975), The Mad Adventures of 'Rabbi' Jacob (1973) and Donkey Skin (1970). He died on March 11, 1979 in Paris.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0011948","name":"Georges Adet","idIMDB":"nm0011948"},"actorId":"nm0011948","character":"Le vieux Lévi","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0069747","urlIMDB":"http://www.imdb.com/title/tt0069747","business":{"budget":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":[],"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 40 min (100 min)","1 hr 31 min (91 min) (Spain)","1 hr 35 min (95 min) (USA)"],"soundMix":["Mono"],"color":["Color (Eastmancolor)"],"aspectRatio":["1.66 : 1"],"camera":null,"laboratory":["DeLuxe (US prints)"],"filmLength":null,"negativeFormat":["35 mm","Spherical"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"7.5","filmingLocations":[{"location":"World Trade Center, Manhattan, New York City, New York, USA"}],"rated":"G","awards":[{"award":"Golden Globes, USA 1975","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Foreign Film","names":[]}]}]}],"votes":"9,373","type":"Movie","companyCreditsSimple":[{"idCompany":"co0031163","name":"Les Films Pomereu"},{"idCompany":"co0070084","name":"Horse Film"}],"keywords":{"keywords":["rabbi","airport","jewish community","toilet","racist as protagonist","racist","shabbat","redhead","paris france","president","chewing gum","racism","dentist","synagogue","false identity","questioning","republican guard","jew","yiddish","boat","wedding","new york","kidnapping","revolutionary","helicopter","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:10:09"}}