{"data":{"movies":[{"title":"My Fair Lady","originalTitle":"","year":"1964","releaseDate":"19641225","directors":[{"name":"George Cukor","id":"nm0002030"}],"writers":[{"name":"Alan Jay Lerner","id":"nm0503585"},{"name":"George Bernard Shaw","id":"nm0789737"}],"runtime":"170 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MTEzMzE4MF5BMl5BanBnXkFtZTcwMDAzMTUyMg@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Family","Musical","Romance"],"plot":"Pompous phonetics professor Henry Higgins is so sure of his abilities that he takes it upon himself to transform a Cockney working-class girl into someone who can pass for a cultured member of high society. His subject turns out to be the lovely Eliza Doolittle, who agrees to speech lessons to improve her job prospects. Higgins and Eliza clash, then form an unlikely bond -- one that is threatened by an aristocratic suitor.","simplePlot":"A misogynistic and snobbish phonetics professor agrees to a wager that he can take a flower girl and make her presentable in high society.","actors":[{"actorName":"Audrey Hepburn","urlProfile":"http://www.imdb.com/name/nm0000030","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MTY3NTQyMF5BMl5BanBnXkFtZTYwMTk2MzQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 May 1929","placeOfBirth":" Ixelles, Belgium","birthName":"Audrey Kathleen Ruston","height":"5' 7\" (1.7 m)","bio":"Audrey Hepburn was born Audrey Kathleen Hepburn-Ruston on May 4, 1929 in Brussels, Belgium. She was a blue-blood and a cosmopolitan from birth. Her mother, Ella van Heemstra, was a Dutch baroness; Audrey's father, Joseph Victor Anthony Hepburn-Ruston, was born in Úzice, Bohemia, of English and Austrian descent, and worked in business. After her parents divorced, Audrey went to London with her mother where she went to a private girls school. Later, when her mother moved back to the Netherlands, she attended private schools as well. While she vacationed with her mother in Arnhem, Netherlands, Hitler's army took over the town. It was here that she fell on hard times during the Nazi occupation. Audrey suffered from depression and malnutrition. After the liberation, she went to a ballet school in London on a scholarship and later began a modeling career. As a model, she was graceful and, it seemed, she had found her niche in life--until the film producers came calling. In 1948, after being spotted modeling by a producer, she was signed to a bit part in the European film Dutch in Seven Lessons (1948). Later, she had a speaking role in the 1951 film, Young Wives' Tale (1951) as Eve Lester. The part still wasn't much, so she headed to America to try her luck there. Audrey gained immediate prominence in the US with her role in Roman Holiday (1953) in 1953. This film turned out to be a smashing success, and she won an Oscar as Best Actress. This gained her enormous popularity and more plum roles. In contrast to the \"sex goddesses\" of the silver screen, Audrey Hepburn had a more wholesome beauty and an aura of innocence and class about her which gained her many devoted fans. Roman Holiday (1953) was followed by another similarly wonderful performance in the 1957 classic Funny Face (1957). Sabrina (1954), in 1954, for which she received another Academy nomination, and Love in the Afternoon (1957), in 1957, also garnered rave reviews. In 1959, she received yet another nomination for her role in The Nun's Story (1959). Audrey reached the pinnacle of her career when she played Holly Golightly in the delightful film Breakfast at Tiffany's (1961)in 1961. For this she received another Oscar nomination. She scored commercial success again in the espionage caper Charade (1963). One of Audrey's most radiant roles was in the fine production of My Fair Lady (1964) in 1964. Her co-star, Rex Harrison, once was asked to identify his favorite leading lady. Without hesitation, he replied, \"Audrey Hepburn in 'My Fair Lady.'\" After a couple of other movies, most notably Two for the Road (1967), she hit pay dirt and another nomination in 1967's Wait Until Dark (1967). By the end of the sixties, after her divorce from actor Mel Ferrer, Audrey decided to retire while she was on top. Later she married Dr. Andrea Dotti. From time to time, she would appear on the silver screen. One film of note was Robin and Marian (1976), with Sean Connery in 1976. In 1988, Audrey became a special ambassador to the United Nations UNICEF fund helping children in Latin America and Africa, a position she retained until 1993. She was named to People's magazine as one of the 50 most beautiful people in the world. Her last film was Always (1989) in 1989. Audrey Hepburn died on January 20, 1993 in Tolochnaz, Switzerland, from appendicular cancer. She had made a total of 31 high quality movies. Her elegance and style will always be remembered in film history as evidenced by her being named in Empire magazine's \"The Top 100 Movie Stars of All Time.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MTY3NTQyMF5BMl5BanBnXkFtZTYwMTk2MzQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000030","name":"Audrey Hepburn","nicknames":["Edda van Heemstra"],"idIMDB":"nm0000030"},"actorId":"nm0000030","character":"Eliza Doolittle","urlCharacter":"http://www.imdb.com/character/ch0011720","main":true},{"actorName":"Rex Harrison","urlProfile":"http://www.imdb.com/name/nm0001322","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzU3OTcwMl5BMl5BanBnXkFtZTYwODEyMTU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 March 1908","placeOfBirth":" Huyton, Lancashire, England, UK [now Huyton, Knowsley, Merseyside, England, UK]","birthName":"Reginald Carey Harrison","height":"6' 1\" (1.86 m)","bio":"Rex Harrison was born Reginald Carey Harrison in Huyton, Lancashire, England, to Edith Mary (Carey) and William Reginald Harrison, a cotton broker. He changed his name to Rex as a young boy, knowing it was the Latin word for \"King\". Starting out on his theater career at age 18, his first job at the Liverpool Rep Theatre was nearly his last - dashing across the stage to say his one line, made his entrance and promptly blew it. Fates were kind, however, and soon he began landing roles in the West End. \"French Without Tears\", a play by Terence Rattigan, proved to be his breakthrough role. Soon he was being called the \"greatest actor of light comedy in the world\". Having divorced his first wife Collette Thomas in 1942, he married German actress Lilli Palmer. The two began appearing together in many plays and British films. He attained international fame when he portrayed the King in Anna and the King of Siam (1946), his first American film. After a sex scandal, in which starlet Carole Landis apparently committed suicide because he ended their affair, the relationship with wife Lilli became strained. Rex (by this time known as \"Sexy Rexy\" for his philandering ways and magnetic charm) began a relationship with British actress Kay Kendall and divorced Lilli to marry the terminally ill Kay with hopes of a re-marriage to Palmer upon Kay's death. The death of Kay affected Harrison greatly and Lilli never returned to him. During this time Rex was offered the defining role of his career: Professor Henry Higgins in the original production of \"My Fair Lady\". He won the Tony for the play and an Oscar for the film version. In 1962 Harrison married actress Rachel Roberts. This union and the one following it to Elizabeth Harris (Richard's ex) also ended in divorce. In 1978 Rex met and married Mercia Tinker. He and Mercia remained happily married until his death in 1990. She was also with him in 1989 when he was granted his much-deserved and long awaited knighthood at Buckingham Palace. Rex Harrison died of pancreatic cancer three weeks after his last stage appearance, as Lord Porteous in W. Somerset Maugham's \"The Circle\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzU3OTcwMl5BMl5BanBnXkFtZTYwODEyMTU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001322","name":"Rex Harrison","nicknames":["Sexy Rexy"],"idIMDB":"nm0001322"},"actorId":"nm0001322","character":"Professor Henry Higgins","urlCharacter":"http://www.imdb.com/character/ch0011719","main":true},{"actorName":"Stanley Holloway","urlProfile":"http://www.imdb.com/name/nm0391361","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODcwNzM2NzQ4OF5BMl5BanBnXkFtZTcwNDcyMjYwOA@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1890","placeOfBirth":" Manor Park, London, England, UK","birthName":"Stanley Augustus Holloway","height":"5' 7\" (1.7 m)","bio":"Stanley Holloway was born on October 1, 1890 in Manor Park, London, England as Stanley Augustus Holloway. He was an actor, known for My Fair Lady (1964), Brief Encounter (1945) and The Lavender Hill Mob (1951). He was married to Violet Lane and Alice Mary Laure Foran. He died on January 30, 1982 in Littlehampton, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODcwNzM2NzQ4OF5BMl5BanBnXkFtZTcwNDcyMjYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0391361","name":"Stanley Holloway","idIMDB":"nm0391361"},"actorId":"nm0391361","character":"Alfred P. Doolittle","urlCharacter":"http://www.imdb.com/character/ch0040191","main":true},{"actorName":"Wilfrid Hyde-White","urlProfile":"http://www.imdb.com/name/nm0405035","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTc2NDgzMzYwNV5BMl5BanBnXkFtZTcwNzE2NDQyNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1903","placeOfBirth":" Bourton-on-the-Water, Gloucestershire, England, UK","height":"5' 10\" (1.78 m)","bio":"British character actor of wry charm, equally at home in amused or strait-laced characters. A native of Bourton-on-the-Water in Gloucestershire, he attended Marlborough College and the Royal Academy of Dramatic Arts. His stage debut came in 1922, and by 1925 he was a busy London actor. He married actress Blanche Glynne (real name: Blanche Hope Aitken) and in 1932 toured South Africa in plays. Alleged to have been spotted by George Cukor during a performance in Aldritch, Hyde-White (with or without Cukor's help) made his film debut in 1934. He often appeared under the name Hyde White in these early films. He continued to act upon the stage, playing opposite Laurence Olivier and Vivien Leigh in \"Caesar and Cleopatra\" and \"Antony and Cleopatra\" in 1951. With scores of films to his credit, he will always be remembered for one, My Fair Lady (1964), in which he played Colonel Pickering. Active into his ninth decade, Hyde-White died six days before his 88th birthday. He was survived by his second wife, Ethel, and three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTc2NDgzMzYwNV5BMl5BanBnXkFtZTcwNzE2NDQyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0405035","name":"Wilfrid Hyde-White","idIMDB":"nm0405035"},"actorId":"nm0405035","character":"Colonel Hugh Pickering","urlCharacter":"http://www.imdb.com/character/ch0011721","main":true},{"actorName":"Gladys Cooper","urlProfile":"http://www.imdb.com/name/nm0178066","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNjk0MTMyMl5BMl5BanBnXkFtZTcwNjI1MzM4OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1888","placeOfBirth":" Lewisham, London, England, UK","birthName":"Gladys Constance Cooper","bio":"Gladys Cooper was the daughter of journalist William Frederick Cooper and his wife Mabel Barnett. As a child she was very striking and was used as a photographic model beginning at six years old. She wanted to become an actress and started on that road in 1905 after being discovered by Seymour Hicks to tour with his company in \"Bluebell in Fairyland\". She came to the London stage in 1906 in \"The Belle of Mayfair\", and in 1907 took a departure from the legitimate stage to become a member of Frank Curzon's famous Gaiety Girls chorus entertainments at The Gaiety theater. Her more concerted stage work began in 1911 in a production of Oscar Wilde's comedy \"The Importance of Being Ernest\" which was followed quickly with other roles. From the craze for post cards with photos of actors - that ensued between about 1890 and 1914 - Cooper became a popular subject of maidenly beauty with scenes as Juliet and many others. During World War I her popularity grew into something of pin-up fad for the British military. In the meantime she sampled the early British silent film industry starting in 1913 with The Eleventh Commandment (1913). She had roles in a few other movies in 1916 and 1917. But in the latter year she joined Frank Curzon to co-manage the Playhouse Theatre. This was a decidedly new direction for a woman of the period. She took sole control from 1927 until other stage commitments in 1933. She was also doing plays, some producing of her own, and a few more films in the early 1920s. It was actually about this time that she achieved major stage actress success. She appeared in W. Somerset Maugham's \"Home and Beauty\" in London in 1919 and triumphed in her 1922 appearance in Arthur Wing Pinero's \"The Second Mrs. Tanqueray\". It was ironic that writer Aldous Huxley criticized her performance in \"Home and Beauty\" as \"too impassive, too statuesque, playing all the time as if she were Galatea, newly unpetrified and still unused to the ways of the living world.\" On the other hand, Maugham himself applauded her for \"turning herself from an indifferent actress (at the start of her career) to an extremely competent one\". She also debuted the role of Leslie Crosbie (the Bette Davis role in the 1940 film) in Maugham's \"The Letter\" in 1927. In 1934 Cooper made her first sound picture in the UK and came to Broadway with \"The Shining Hour\" which she had been doing in London. She and it were a success, and she followed it with several plays through 1938, including \"MacBeth\". About this time Hollywood scouts caught wind of her, and she began her 30 odd years in American film. That first film was also Alfred Hitchcock's first Hollywood directorial effort, Rebecca (1940). Her's was a small and light role as Laurence Olivier's gregarious sister, but she stood out all the same. Two years later she bit into the much more substantial role as Bette Davis' domineering and repressive mother in the classic Now, Voyager (1942) for which she received a well deserved Oscar nomination for Best Supporting Actress - the first of three. Though aristocratic elderly ladies was a role she revisited in various guises, Cooper was very busy through 1940s Hollywood. She returned to London stage work from 1947 and stayed for some early episodic British TV into 1950 before once again returning to the US, but was busy on both sides of the Atlantic until her passing. Through the 1950s and into the 1960s Cooper did a few films but was an especially familiar face on American TV in teleplays, a wide range of prime time episodic shows, and popular weird/sci-fi series: several Alfred Hitchcock Presents, Twilight Zone, and Outer Limits. When Enid Bagnold's \"The Chalk Garden\" opened in London in 1955, Cooper debuted as Mrs. St. Maugham and brought it to Broadway in October of that year where it ran through March of 1956. Her last major film was My Fair Lady (1964) as Henry Higgins' mother. The year before she had played the part on TV. In the film, the portrait prop of a fine lady over Higgins' fireplace is that of Cooper painted in 1922. She wrote an autobiography (1931) followed by two biographies (1953 and 1979). In 1967 she was honored as a Dame Commander of the Order of British Empire (DBE) for her great accomplishments in furthering acting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNjk0MTMyMl5BMl5BanBnXkFtZTcwNjI1MzM4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0178066","name":"Gladys Cooper","idIMDB":"nm0178066"},"actorId":"nm0178066","character":"Mrs. Higgins","urlCharacter":"http://www.imdb.com/character/ch0011722","main":true},{"actorName":"Jeremy Brett","urlProfile":"http://www.imdb.com/name/nm0107950","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyOTE0MjMwOV5BMl5BanBnXkFtZTcwNjYyMjYwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1933","placeOfBirth":" Berkswell Grange, Warwickshire, England, UK","birthName":"Peter Jeremy William Huggins","height":"6' 1\" (1.86 m)","bio":"The refined and debonair English actor Jeremy Brett will forever be best remembered for his long-running and critically acclaimed portrayal of Sherlock Holmes for Britain's Granada Television. From a privileged background, Brett was educated at England's most prestigious independent school, Eton College. After training as an actor at the Central School of Speech and Drama in London, Brett made his professional stage debut in repertory in 1954. He became a noteworthy classical actor who was to make regular appearances on stage, including many with the National Theatre. Brett was as cultured off screen as on. His interests included classical music, archery and horseback riding. His greatest popularity and acclaim would come with his portrayal of Sherlock Holmes on television from the 1980s through to the 1990s. Where so many have tried and failed to capture the essence of the character, either being derided or forgotten, Brett's widely praised take on it has been described by many as superlative and even definitive. Brett suffered from poor health towards the end of his life but he was still playing the role of Holmes shortly before his death in 1995 at the age of 61.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyOTE0MjMwOV5BMl5BanBnXkFtZTcwNjYyMjYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0107950","name":"Jeremy Brett","idIMDB":"nm0107950"},"actorId":"nm0107950","character":"Freddy Eynsford-Hill","urlCharacter":"http://www.imdb.com/character/ch0080268","main":true},{"actorName":"Theodore Bikel","urlProfile":"http://www.imdb.com/name/nm0000942","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0Nzc0MTI4NF5BMl5BanBnXkFtZTcwODc0MTMzMQ@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 May 1924","placeOfBirth":" Vienna, Austria","birthName":"Theodor Meir Bikel","height":"6' 1\" (1.85 m)","bio":"Theodore Bikel is one of the most versatile and respected actors and performers of his generation. A master of languages, dialects and accents, he has played every sort of film villain and semi-bad guy imaginable, and always adds depth, dimension and even sympathy to characters that would end up as cardboard cutouts in the hands of lesser actors. His memorable supporting roles include a German naval officer in The African Queen (1951), the king of Serbia in Moulin Rouge (1952) and a German submarine officer in The Enemy Below (1957). He was nominated for an Academy Award for his role in The Defiant Ones (1958). Equally at home on the stage, Bikel is remembered for creating the role of Captain Von Trapp in the original Broadway cast of \"The Sound of Music\" opposite Mary Martin. He also appeared on stage in \"Tonight in Samarkand\", \"The Lark\" and \"The Rope Dancers\". Bikel is fluent in more than half a dozen European and Middle Eastern languages, and sings folk songs in nearly 20 languages, skillfully accompanying himself on guitar, mandolin, balalaika and harmonica. He was a regular on the early 1960s TV show Hootenanny (1963), a weekly cavalcade of folk music. Over the years he has performed on college campuses and in concert halls all over the country, and has recorded a number of record albums of folk music from around the world.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0Nzc0MTI4NF5BMl5BanBnXkFtZTcwODc0MTMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000942","name":"Theodore Bikel","nicknames":["Theo"],"idIMDB":"nm0000942"},"actorId":"nm0000942","character":"Zoltan Karpathy","urlCharacter":"http://www.imdb.com/character/ch0046288","main":true},{"actorName":"Mona Washbourne","urlProfile":"http://www.imdb.com/name/nm0913332","urlPhoto":"","biography":{"dateOfBirth":"27 November 1903","placeOfBirth":" Birmingham, England, UK","height":"5' 4\" (1.63 m)","bio":"Beloved round and roly-poly British character player Mona Washbourne was a natural symbol for the working-class as much of her early career was in playing midwives, barmaids, nannies, landladies and factory workers. Born November 27, 1903, in Birmingham, England, the daughter of Arthur Edmund Washbourne and his wife Kate (Robinson), the piano was to be her early passion and she initially trained at the Birmingham School of Music. Following concerting on the stage and broadcast playing on radio, she made her professional stage debut in 1924 with the \"Modern Follies\" concert party, as both pianist and soubrette. From this point, she delved herself completely into acting and went on tour with the \"Fol-De-Rols\" revue for three seasons, developing a special flair for bawdy, eccentric comedy. She performed in various repertory companies and earned her first major dramatic success on the London stage in 1937 with \"Mourning Becomes Electra\". On the quirkier side, she won kudos for her \"Madame Arcati\" in \"Blithe Spirit\" (1945) and for her doting journalist in \"The Winslow Boy\" (1946). She went on to transfer her role in The Winslow Boy (1948) to film in the postwar years and saw a new avenue for her talents open up. While most of Mona's early film roles tended toward the small and dowdy, they were also quite colorful and seldom failed to make some sort of impression. They also grew in size as years passed. She played a midwife in Doctor in the House (1954); the older, ill-fated first wife to Bluebeard-like charmer Dirk Bogarde in Cast a Dark Shadow (1955); the protagonist's mum in Billy Liar (1963) (another role she originated on stage in 1960); the no-nonsense \"Higgins\" housekeeper in My Fair Lady (1964); an aristocratic old shrew who employs psycho Albert Finney in the remake of Night Must Fall (1964); and a doddering aunt to another psychopath, Terence Stamp, in The Collector (1965). Continuing to impress on the stage with roles in Noël Coward's \"Nude with Violin\" (1957) and \"Present Laughter\" (1958), she also appeared to great effect in \"Misalliance\" (1967) and was a natural for her perplexed aunt role in a madcap production of \"Harvey\" (1975). Here in the States, she earned a Tony nomination for her contribution in \"Home\" (1970). Mona crowned her career remarkably alongside Glenda Jackson as the dithery maiden aunt who lives with her eccentric niece, the poet \"Stevie Smith\", in the play \"Stevie\". A two-person show, she and Jackson won additional acclaim when they took Stevie (1978) to film. Mona won the top critics supporting awards, including New York, Boston and Los Angeles, but was surprisingly snubbed by the Academy at Oscar time. Her final career years (in the early 1980s) were spent on TV with roles as \"Mrs. Higgins\" in a version of George Bernard Shaw's Celebrity Playhouse: Pygmalion (1981) starring Twiggy and Robert Powell; \"Nanny Hawkins\" in the epic miniseries, Brideshead Revisited (1981) and the \"Queen Mum\" in Charles & Diana: A Royal Love Story (1982). Long married to actor Basil Dignam, he died in 1979. Mona passed on slightly less than a decade later, in 1988, at age 84.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0913332","name":"Mona Washbourne","idIMDB":"nm0913332"},"actorId":"nm0913332","character":"Mrs. Pearce","urlCharacter":"http://www.imdb.com/character/ch0080277","main":true},{"actorName":"Isobel Elsom","urlProfile":"http://www.imdb.com/name/nm0255695","urlPhoto":"","biography":{"dateOfBirth":"16 March 1893","placeOfBirth":" Cambridge, Cambridgeshire, England, UK","birthName":"Isobel Jeannette Reed","height":"5' 4\" (1.63 m)","bio":"The epitome of opulent, grande dame haughtiness, British character actress Isobel Elsom began on the stage in 1911 and went on to grace a number of silent and sound pictures in England, marrying and divorcing director Maurice Elvey in the interim. In the late 30s she settled in America and earned major Broadway success with the play \"Ladies in Retirement,\" which she also took to film in 1941. What the tiny-framed Elsom lacked in stature, she certainly made up for in pure chutzpah. The matronly actress remained in Hollywood and played a number of huffy bluebloods in both comedies and drama for over two decades, often as a minor Margaret Dumont-like foil to Jerry Lewis in his solo pictures of the late 50s and early 60s. She sometimes was billed under the last name of a second husband, appearing as Isobel Harbord.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0255695","name":"Isobel Elsom","idIMDB":"nm0255695"},"actorId":"nm0255695","character":"Mrs. Eynsford-Hill","urlCharacter":"http://www.imdb.com/character/ch0080271","main":true},{"actorName":"John Holland","urlProfile":"http://www.imdb.com/name/nm0390710","urlPhoto":"","biography":{"dateOfBirth":"16 May 1908","placeOfBirth":" Fremont, Nebraska, USA","birthName":"John Boggess","bio":"John Holland was born on May 16, 1908 in Fremont, Nebraska, USA as John Boggess. He was an actor, known for My Fair Lady (1964), Chinatown (1974) and How to Succeed in Business Without Really Trying (1967). He died on May 21, 1993 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0390710","name":"John Holland","idIMDB":"nm0390710"},"actorId":"nm0390710","character":"Butler","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0058385","urlIMDB":"http://www.imdb.com/title/tt0058385","business":{"budget":{"money":"$17,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"SEK","country":"8,805,000","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1963/\">1963</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 50 min (170 min)"],"soundMix":["Mono"],"color":["Color (Technicolor)"],"aspectRatio":["2.20 : 1 (negative ratio)","2.35 : 1 (35 mm version)"],"camera":null,"laboratory":["DeLuxe (restored version)","Technicolor"],"filmLength":null,"negativeFormat":["65 mm (Eastman 50T 5251)"],"cinematographicProcess":["Super Panavision 70"],"printedFilmFormat":["35 mm (anamorphic)","70 mm (Kodak) (restored version)","16 mm","70 mm"]},"rating":"7.9","filmingLocations":[{"location":"Backlot, Warner Brothers Burbank Studios - 4000 Warner Boulevard, Burbank, California, USA"}],"rated":"G","awards":[{"award":"Academy Awards, USA 1965","titlesAwards":[{"titleAwardOutcome":"Won Oscar","categories":[{"category":"Best Picture","names":[{"name":"Jack L. Warner","id":"nm0912491","role":null}]},{"category":"Best Actor in a Leading Role","names":[{"name":"Rex Harrison","id":"nm0001322","role":null}]},{"category":"Best Director","names":[{"name":"George Cukor","id":"nm0002030","role":null}]},{"category":"Best Cinematography, Color","names":[{"name":"Harry Stradling Sr.","id":"nm0005889","role":null}]},{"category":"Best Art Direction-Set Decoration, Color","names":[{"name":"Gene Allen","id":"nm0020537","role":null},{"name":"Cecil Beaton","id":"nm0064100","role":null},{"name":"George James Hopkins","id":"nm0394166","role":null}]},{"category":"Best Costume Design, Color","names":[{"name":"Cecil Beaton","id":"nm0064100","role":null}]},{"category":"Best Sound","names":[{"name":"George Groves","id":"nm0344060","role":"Warner Bros. SSD"}]},{"category":"Best Music, Scoring of Music, Adaptation or Treatment","names":[{"name":"André Previn","id":"nm0006238","role":null}]}]},{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Actor in a Supporting Role","names":[{"name":"Stanley Holloway","id":"nm0391361","role":null}]},{"category":"Best Actress in a Supporting Role","names":[{"name":"Gladys Cooper","id":"nm0178066","role":null}]},{"category":"Best Writing, Screenplay Based on Material from Another Medium","names":[{"name":"Alan Jay Lerner","id":"nm0503585","role":null}]},{"category":"Best Film Editing","names":[{"name":"William H. Ziegler","id":"nm0956155","role":null}]}]}]},{"award":"Golden Globes, USA 1965","titlesAwards":[{"titleAwardOutcome":"Won Golden Globe","categories":[{"category":"Best Motion Picture - Comedy or Musical","names":[]},{"category":"Best Director","names":[{"name":"George Cukor","id":"nm0002030","role":null}]},{"category":"Best Actor - Comedy or Musical","names":[{"name":"Rex Harrison","id":"nm0001322","role":null}]}]},{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Actress - Comedy or Musical","names":[{"name":"Audrey Hepburn","id":"nm0000030","role":null}]},{"category":"Best Supporting Actor","names":[{"name":"Stanley Holloway","id":"nm0391361","role":null}]}]}]},{"award":"BAFTA Awards 1966","titlesAwards":[{"titleAwardOutcome":"Won BAFTA Film Award","categories":[{"category":"Best Film from any Source","names":[{"name":"George Cukor","id":"nm0002030","role":null}]}]},{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best British Actor","names":[{"name":"Rex Harrison","id":"nm0001322","role":null}]}]}]},{"award":"American Cinema Editors, USA 1965","titlesAwards":[{"titleAwardOutcome":"Nominated Eddie","categories":[{"category":"Best Edited Feature Film","names":[{"name":"William H. Ziegler","id":"nm0956155","role":null}]}]}]},{"award":"Boxoffice Magazine Awards 1964","titlesAwards":[{"titleAwardOutcome":"Won Boxoffice Blue Ribbon Award","categories":[{"category":"Best Picture of the Month for the Whole Family (December)","names":[{"name":"George Cukor","id":"nm0002030","role":null}]}]}]},{"award":"Cinema Writers Circle Awards, Spain 1966","titlesAwards":[{"titleAwardOutcome":"Won CEC Award","categories":[{"category":"Best Foreign Film (Mejor Película Extranjera)","names":[]}]}]},{"award":"David di Donatello Awards 1965","titlesAwards":[{"titleAwardOutcome":"Won David","categories":[{"category":"Best Foreign Production (Migliore Produzione Straniera)","names":[{"name":"Jack L. Warner","id":"nm0912491","role":null}]},{"category":"Best Foreign Actress (Migliore Attrice Straniera)","names":[{"name":"Audrey Hepburn","id":"nm0000030","role":null}]},{"category":"Best Foreign Actor (Migliore Attore Straniero)","names":[{"name":"Rex Harrison","id":"nm0001322","role":null}]}]}]},{"award":"Directors Guild of America, USA 1965","titlesAwards":[{"titleAwardOutcome":"Won DGA Award","categories":[{"category":"Outstanding Directorial Achievement in Motion Pictures","names":[{"name":"George Cukor","id":"nm0002030","role":null},{"name":"David S. Hall","id":"nm0355465","role":"assistant director plaque"}]}]}]},{"award":"Laurel Awards 1965","titlesAwards":[{"titleAwardOutcome":"Won Golden Laurel","categories":[{"category":"Road Show","names":[]},{"category":"Musical Performance, Male","names":[{"name":"Rex Harrison","id":"nm0001322","role":null}]}]},{"titleAwardOutcome":"3rd place Golden Laurel","categories":[{"category":"Comedy Performance, Female","names":[{"name":"Audrey Hepburn","id":"nm0000030","role":null}]}]},{"titleAwardOutcome":"Nominated Golden Laurel","categories":[{"category":"Supporting Performance, Male","names":[{"name":"Stanley Holloway","id":"nm0391361","role":null}]}]}]},{"award":"National Board of Review, USA 1964","titlesAwards":[{"titleAwardOutcome":"Won NBR Award","categories":[{"category":"Top Ten Films","names":[]}]}]},{"award":"New York Film Critics Circle Awards 1964","titlesAwards":[{"titleAwardOutcome":"Won NYFCC Award","categories":[{"category":"Best Film","names":[]},{"category":"Best Actor","names":[{"name":"Rex Harrison","id":"nm0001322","role":null}]}]},{"titleAwardOutcome":"2nd place NYFCC Award","categories":[{"category":"Best Director","names":[{"name":"George Cukor","id":"nm0002030","role":null}]}]},{"titleAwardOutcome":"3rd place NYFCC Award","categories":[{"category":"Best Actress","names":[{"name":"Audrey Hepburn","id":"nm0000030","role":null}]}]}]},{"award":"Online Film & Television Association 2017","titlesAwards":[{"titleAwardOutcome":"Won OFTA Film Hall of Fame","categories":[{"category":"Motion Picture","names":[]}]}]},{"award":"Writers Guild of America, USA 1965","titlesAwards":[{"titleAwardOutcome":"Nominated WGA Award (Screen)","categories":[{"category":"Best Written American Musical","names":[{"name":"Alan Jay Lerner","id":"nm0503585","role":null}]}]}]}],"votes":"70,312","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."}],"keywords":{"keywords":["flower girl","professor","wager","street","colonel","love","aristocrat","linguist","high society","bet","nubile woman","70mm film","selfishness","self centeredness","ascot racecourse","flower vendor","pillar","wimpole street london","street urchin","guttersnipe","horse drawn carriage","horse","based on stage musical","based on stage musical based on stage play","walking with a book on one's head","linguistics","role reversal","price of fame","cinderella story","transformation","star","socialite","snob","scheme","rags to riches","opposites attract","forbidden love","fish out of water","culture clash","coming of age","blockbuster","fantasy sequence","steam","marbles","diction lessons","tutor","inheritance","bachelor","phonograph","teaching","gossip","apology","misogynist","1910s","horse racing","opera house","class differences","prince","class prejudice","flower market","phoneticist","gramophone","unemployment","horse race","suitor","makeover","bachelor party","dance","racetrack","etiquette","military veteran","mother son relationship","london england","mansion","pygmalion","waltz","eavesdropping","firing squad","dancing","rainstorm","pub","language","father daughter relationship","class distinction","queen","based on play"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:10:10"}}