{"data":{"movies":[{"title":"Six fois deux/Sur et sous la communication","originalTitle":"","year":"1976–","releaseDate":"1976","writers":[],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTI4M2FhNjYtNWQxMS00OWU4LTkzYmYtYjUzODMwMGM5NjAzXkEyXkFqcGdeQXVyNTI2NTY2MDI@._V1.jpg","countries":["France"],"languages":["French"],"genres":[],"simplePlot":"","actors":[{"actorName":"Jean-Luc Godard","urlProfile":"http://www.imdb.com/name/nm0000419","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ5NjYwODg1MF5BMl5BanBnXkFtZTgwMTA2NzI2MDE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 December 1930","placeOfBirth":" Paris, France","height":"5' 8½\" (1.74 m)","bio":"Jean-Luc Godard was born in Paris on December 3, 1930, the second of four children in a bourgeois Franco-Swiss family. His father was a doctor who owned a private clinic, and his mother came from a preeminent family of Swiss bankers. During World War II Godard became a naturalized citizen of Switzerland and attended school in Nyons (Switzerland). His parents divorced in 1948, at which time he returned to Paris to attend the Lycée Rohmer. In 1949 he studied at the Sorbonne to prepare for a degree in ethnology. However, it was during this time that he began attending with François Truffaut, Jacques Rivette, and Éric Rohmer. In 1950 Godard, with Rivette and Rohmer, founded \"Gazette du cinéma\", which published five issues between May and November. He wrote a number of articles for the journal, often using the pseudonym \"Hans Lucas\". After Godard worked on and financed two films by Rivette and Rohmer, Godard's family cut off their financial support in 1951, and he resorted to a Bohemian lifestyle that included stealing food and money when necessary. In January 1952 he began writing film criticism for \"Les cahiers du cinéma\". Later that year he traveled to North and South America with his father and attempted to make his first film (of which only a tracking shot from a car was ever accomplished). In 1953 he returned to Paris briefly before securing a job as a construction worker on a dam project in Switzerland. With the money from the job, he made a short film in 1954 about the building of the dam called Operation Concrete (1958) (\"Operation Concrete\"). Later that year his mother was killed in a motor scooter accident in Switzerland. In 1956 Godard began writing again for \"Les cahiers du cinéma\" as well as for the journal \"Arts\". In 1957 Godard worked as the press attache for \"Artistes Associés\", and made his first French film, Charlotte et Véronique, ou Tous les garçons s'appellent Patrick (1959) (aka \"Charlotte et Véronique\"). In 1958 he shot Charlotte et son Jules (1960) (\"Charlotte and Her Boyfriend\"), his homage to Jean Cocteau. Later that year he took unused footage of a flood in Paris shot by Truffaut and edited it into a film called Une histoire d'eau (1961) (\"A Story of Water\"), which was an homage to Mack Sennett. In 1959 he worked with Truffaut on the weekly publication \"Temps de Paris\". Godard wrote a gossip column for the journal, but also spent much time writing scenarios for films and a body of critical writings which placed him firmly in the forefront of the \"nouvelle vague\" aesthetic, precursing the French New Wave. It was also in that year Godard began work on Breathless (1960) (\"Breathless\"). In 1960 he married Anna Karina in Switzerland. In April and May he shot Le Petit Soldat (1963) in Geneva and was preparing the film for a fall release in Paris. However, French censors banned it due to its references to the Algerian war, and it was not shown until 1963. In March 1960 Breathless (1960) premiered in Paris. It was hugely successful both with the film critics and at the box office, and became a landmark film in the French New Wave with its references to American cinema, its jagged editing and overall romantic/cinephilia approach to filmmaking. The film propelled the popularity of male lead Jean-Paul Belmondo with European audiences. In 1961 Godard shot A Woman Is a Woman (1961), his first film using color widescreen stock. Later that year he participated in the collective effort to remake the film Les sept péchés capitaux (1962), which was heralded as an important project in artistic collaboration. In 1962 Godard shot My Life to Live (1962) in Paris, his first commercial success since \"À bout de souffle\". Later that year he shot a segment entitled \"Le Nouveau Monde\" for the collective film Rogopag (1963), another important work in the history of collaborative multiple-authored art. In 1963 Godard completed a film in homage to Jean Vigo entitled Les Carabiniers (1963), which was a resounding failure with the public and stirred furious controversy with film critics. Also that year he worked on a couple of collective films: Les plus belles escroqueries du monde (1964) (from which Godard's sequence was later cut) and Paris vu par... (1965). In 1964 Godard and his wife Anna Karina formed their own production company, Anouchka Films. They shot a film called Une Femme Mariée (1964), which censors forced them to re-edit due to a topless sunbathing scene shot by Jacques Rozier. The censors also made Godard change the title to \"Une femme marié\" so as to not give the impression that this \"scandalous\" woman was the typical French wife. Later in the year, two French television programs were produced in devotion to Godard's work. In the spring of 1965 Godard shot Alphaville (1965) in Paris; in the summer he shot Pierrot le Fou (1965) in Paris and the south of France. Shortly thereafter he and Anna Karina separated. Following their divorce, Godard shot Made in U.S.A (1966), \"Deux ou trois choses que je sais d'elle (1966)\", \"L'amour en l'an 2000\" (1966) (a sequel to \"Alphaville\" shot as a sketch for the collective film \"L'amour travers les ages\" (1966)). In 1967 Godard shot La chinoise (1967) in Paris with Anne Wiazemsky, who was the granddaughter of French novelist François Mauriac. During the making of the film Godard and Wiazemsky were married in Paris. Later in the year he was prevented from traveling to North Vietnam for the shooting of a sequence for the collective film Far from Vietnam (1967). He instead shot the sequence in Paris, entitled \"Camera-Oeil\". Also during 1967 Godard participated (as the only Frenchman) on an Italian collective film called La contestation (1969). In 1968 Godard was commissioned by French television to make Le gai savoir (1969). However, television producers were so outraged by the product Godard produced that they refused to show it. In May of that year Henri Langlois was fired by the head of the French Jean-Pierre Gorin to form the Dziga-Vertov group, infuriating Godard. He became increasingly concerned with socialist solutions to an idealist cinema, especially in providing the proletariat with the means of production and distribution. Along with other militantly political filmmakers in the Dziga-Vertov group, Godard published a series of 'Ciné-Tracts' outlining these viewpoints. In the summer of 1968 Godard traveled to New York City and Berkeley, California, to shoot the film \"One American Movie\", which was never completed. In September he made a trip to Canada to start another film called \"Communication(s)\", which also went unfinished, and then made a visit to Cuba before returning to France. In 1969 Godard traveled to England, where he made the film See You at Mao (1970) for BBC Weekend Television, but the network later refused to show it. In the late spring he traveled with the Dziga-Vertov group to Prague to secretly shoot the film \"Pravda\". Later that year he shot Struggle in Italy (1971) (\"Struggle for Italy\") for Italian television. It was never shown, either. In 1970 Godard traveled to Lebanon to shoot a film for the Palestinian Liberation Organization entitled \"Jusque à la victoire\" (1970) (\"Until Victory\"). Later that year he traveled to dozens of American universities trying to raise money for the film. In spite of his efforts, it was never released.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ5NjYwODg1MF5BMl5BanBnXkFtZTgwMTA2NzI2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000419","name":"Jean-Luc Godard","nicknames":["JLG"],"idIMDB":"nm0000419"},"actorId":"nm0000419","character":" Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anne-Marie Miéville","urlProfile":"http://www.imdb.com/name/nm0594746","urlPhoto":"","biography":{"dateOfBirth":"11 November 1945","placeOfBirth":" Lausanne, Switzerland","bio":"Anne-Marie Mieville began her career as a singer in the 60s, but moved on to filmmaking. In 1972, she met Jean-Luc Godard, and they began their extremely prolific collaborative career. They have produced numerous films together, and continue to do so.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0594746","name":"Anne-Marie Miéville","idIMDB":"nm0594746"},"actorId":"nm0594746","character":" Herself","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[{"yearSeason":1976,"episodes":[{"episode":1,"title":"Y a personne/Louison","date":"1976","plot":"Know what this is about? Be the first one to add a plot.","idIMDB":"tt3818052"},{"episode":2,"title":"Leçon de choses/Jean-Luc","date":"1976","plot":"Know what this is about? Be the first one to add a plot.","idIMDB":"tt1619767"},{"episode":3,"title":"Photo et C.ie/Marcel","date":"1976","plot":"Know what this is about? Be the first one to add a plot.","idIMDB":"tt1619766"},{"episode":4,"title":"Pas d'histoire/Nana","date":"1976","plot":"Know what this is about? Be the first one to add a plot.","idIMDB":"tt3823900"},{"episode":5,"title":"Nous trois/René","date":"22 Aug. 1976","plot":"Know what this is about? Be the first one to add a plot.","idIMDB":"tt3823898"},{"episode":6,"title":"Avant et après/Jacqueline et Ludovic","date":"29 Aug. 1976","plot":"Know what this is about? Be the first one to add a plot.","idIMDB":"tt3823902"}]},{"yearSeason":1976,"episodes":[{"episode":1,"title":"Y a personne/Louison","date":"1976","plot":"Know what this is about? Be the first one to add a plot.","idIMDB":"tt3818052"},{"episode":2,"title":"Leçon de choses/Jean-Luc","date":"1976","plot":"Know what this is about? Be the first one to add a plot.","idIMDB":"tt1619767"},{"episode":3,"title":"Photo et C.ie/Marcel","date":"1976","plot":"Know what this is about? Be the first one to add a plot.","idIMDB":"tt1619766"},{"episode":4,"title":"Pas d'histoire/Nana","date":"1976","plot":"Know what this is about? Be the first one to add a plot.","idIMDB":"tt3823900"},{"episode":5,"title":"Nous trois/René","date":"22 Aug. 1976","plot":"Know what this is about? Be the first one to add a plot.","idIMDB":"tt3823898"},{"episode":6,"title":"Avant et après/Jacqueline et Ludovic","date":"29 Aug. 1976","plot":"Know what this is about? Be the first one to add a plot.","idIMDB":"tt3823902"}]}],"idIMDB":"tt0074057","urlIMDB":"http://www.imdb.com/title/tt0074057","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 40 min (100 min) (6 episodes)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["Video"],"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.3","filmingLocations":[],"awards":[],"votes":"35","type":"TV Mini-Series","companyCreditsSimple":[{"idCompany":"co0017676","name":"Institut National de l'Audiovisuel (INA)"},{"idCompany":"co0050747","name":"Sonimage"}],"keywords":{"keywords":["tv mini series","non fiction"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 07:45:05"}}