{"data":{"movies":[{"title":"Pumping Iron","originalTitle":"","year":"1977","releaseDate":"19780331","directors":[{"name":"George Butler","id":"nm1000159"},{"name":"Robert Fiore","id":"nm0278478"}],"writers":[{"name":"Charles Gaines","id":"nm0301310"},{"name":"George Butler","id":"nm1000159"}],"runtime":"85 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2OTIwNTQ2OF5BMl5BanBnXkFtZTcwNTA4NDAwMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Documentary","Sport"],"plot":"From Gold's Gym in Venice Beach California to the showdown in Pretoria, amateur and professional bodybuilders prepare for the 1975 Mr. Olympia and Mr. Universe contests in this part-scripted, part-documentary film. Five-time champion Arnold Schwarzenegger defends his Mr. Olympia title against Serge Nubret and the shy young deaf Lou Ferrigno, whose father is his coach; the ruthless champ psyches out the young lion. Sardinian Franco Columbu competes in the lightweight class; at home in Italy he solves a tight parking problem by lifting the car into place. Joe Weider is the marketer; Mike Katz and Ken Waller go for the title of Mr. Universe. Bodybuilding and a celebrity-to-be go mainstream.","simplePlot":"From Gold's Gym in Venice Beach California to the showdown in Pretoria, amateur and professional bodybuilders prepare for the 1975 Mr. Olympia and Mr. Universe contests in this ... ","actors":[{"actorName":"Arnold Schwarzenegger","urlProfile":"http://www.imdb.com/name/nm0000216","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MDc4NzUyMV5BMl5BanBnXkFtZTcwMTQyMTc5MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1947","placeOfBirth":" Thal, Styria, Austria","birthName":"Arnold Alois Schwarzenegger","height":"6' 2\" (1.88 m)","bio":"With an almost unpronounceable surname and a thick Austrian accent, who would have ever believed that a brash, quick talking bodybuilder from a small European village would become one of Hollywood's biggest stars, marry into the prestigious Kennedy family, amass a fortune via shrewd investments and one day be the Governor of California!? The amazing story of megastar Arnold Schwarzenegger is a true \"rags to riches\" tale of a penniless immigrant making it in the land of opportunity, the United States of America. Arnold Alois Schwarzenegger was born July 30, 1947, in the town of Thal, Styria, Austria, to Aurelia (Jadrny) and Gustav Schwarzenegger, the local police chief. From a young age, he took a keen interest in physical fitness and bodybuilding, going on to compete in several minor contests in Europe. However, it was when he emigrated to the United States in 1968 at the tender age of 21 that his star began to rise. Up until the early 1970s, bodybuilding had been viewed as a rather oddball sport, or even a mis-understood \"freak show\" by the general public, however two entrepreneurial Canadian brothers Ben Weider and Joe Weider set about broadening the appeal of \"pumping iron\" and getting the sport respect, and what better poster boy could they have to lead the charge, then the incredible \"Austrian Oak\", Arnold Schwarzenegger. Over roughly the next decade, beginning in 1970, Schwarzenegger dominated the sport of competitive bodybuilding winning five Mr. Universe titles and seven Mr. Olympia titles and, with it, he made himself a major sports icon, he generated a new international audience for bodybuilding, gym memberships worldwide swelled by the tens of thousands and the Weider sports business empire flourished beyond belief and reached out to all corners of the globe. However, Schwarzenegger's horizons were bigger than just the landscape of bodybuilding and he debuted on screen as \"Arnold Strong\" in the low budget Hercules in New York (1970), then director Bob Rafelson cast Arnold in Stay Hungry (1976) alongside Jeff Bridges and Sally Field, for which Arnold won a Golden Globe Award for \"Best Acting Debut in a Motion Picture\". The mesmerizing Pumping Iron (1977) covering the 1975 Mr Olympia contest in South Africa has since gone on to become one of the key sports documentaries of the 20th century, plus Arnold landed other acting roles in the comedy The Villain (1979) opposite Kirk Douglas, and he portrayed Mickey Hargitay in the well- received TV movie The Jayne Mansfield Story (1980). What Arnold really needed was a super hero / warrior style role in a lavish production that utilized his chiseled physique, and gave him room to show off his growing acting talents and quirky humor. Conan the Barbarian (1982) was just that role. Inspired by the Robert E. Howard short stories of the \"Hyborean Age\" and directed by gung ho director John Milius, and with a largely unknown cast, save Max von Sydow and James Earl Jones, \"Conan\" was a smash hit worldwide and an inferior, although still enjoyable sequel titled Conan the Destroyer (1984) quickly followed. If \"Conan\" was the kick start to Arnold's movie career, then his next role was to put the pedal to the floor and accelerate his star status into overdrive. Director James Cameron had until that time only previously directed one earlier feature film titled Piranha Part Two: The Spawning (1981), which stank of rotten fish from start to finish. However, Cameron had penned a fast paced, science fiction themed film script that called for an actor to play an unstoppable, ruthless predator - The Terminator (1984). Made on a relatively modest budget, the high voltage action / science fiction thriller The Terminator (1984) was incredibly successful worldwide, and began one of the most profitable film franchises in history. The dead pan phrase \"I'll be back\" quickly became part of popular culture across the globe. Schwarzenegger was in vogue with action movie fans, and the next few years were to see Arnold reap box office gold in roles portraying tough, no-nonsense individuals who used their fists, guns and witty one-liners to get the job done. The testosterone laden Commando (1985), Raw Deal (1986), Predator (1987), The Running Man (1987) and Red Heat (1988) were all box office hits and Arnold could seemingly could no wrong when it came to picking winning scripts. The tongue-in-cheek comedy Twins (1988) with co-star Danny DeVito was a smash and won Arnold new fans who saw a more comedic side to the muscle- bound actor once described by Australian author / TV host Clive James as \"a condom stuffed with walnuts\". The spectacular Total Recall (1990) and \"feel good\" Kindergarten Cop (1990) were both solid box office performers for Arnold, plus he was about to return to familiar territory with director James Cameron in Terminator 2: Judgment Day (1991). The second time around for the futuristic robot, the production budget had grown from the initial film's $6.5 million to an alleged $100 million for the sequel, and it clearly showed as the stunning sequel bristled with amazing special effects, bone-crunching chases & stunt sequences, plus state of the art computer-generated imagery. Terminator 2: Judgment Day (1991) was arguably the zenith of Arnold's film career to date and he was voted \"International Star of the Decade\" by the National Association of Theatre Owners. Remarkably, his next film Last Action Hero (1993) brought Arnold back to Earth with a hard thud as the self-satirizing, but confusing plot line of a young boy entering into a mythical Hollywood action film confused movie fans even more and they stayed away in droves making the film an initial financial disaster. Arnold turned back to good friend, director James Cameron and the chemistry was definitely still there as the \"James Bond\" style spy thriller True Lies (1994) co-starring Jamie Lee Curtis and Tom Arnold was the surprise hit of 1994! Following the broad audience appeal of True Lies (1994), Schwarzenegger decided to lean towards more family-themed entertainment with Junior (1994) and Jingle All the Way (1996), but he still found time to satisfy his hard-core fan base with Eraser (1996), as the chilling \"Mr. Freeze\" in Batman & Robin (1997) and battling dark forces in the supernatural action of End of Days (1999). The science fiction / conspiracy tale The 6th Day (2000) played to only mediocre fan interest, and Collateral Damage (2002) had its theatrical release held over for nearly a year after the tragic events of Sept 11th 2001, but it still only received a lukewarm reception. It was time again to resurrect Arnold's most successful franchise and, in 2003, Schwarzenegger pulled on the biker leathers for the third time for Terminator 3: Rise of the Machines (2003). Unfortunately, directorial duties passed from James Cameron to Jonathan Mostow and the deletion of the character of \"Sarah Connor\" aka Linda Hamilton and a change in the actor playing \"John Connor\" - Nick Stahl took over from Edward Furlong - making the third entry in the \"Terminator\" series the weakest to date. Schwarzenegger married TV journalist Maria Shriver in April, 1986 and the couple have four children. In October of 2003 Schwarzenegger, running as a Republican, was elected Governor of California in a special recall election of then governor Gray Davis. The \"Governator,\" as Schwarzenegger came to be called, held the office until 2011. Upon leaving the Governor's mansion it was revealed that he had fathered a child with the family's live-in maid and Shriver filed for divorce. Schwarzenegger contributed cameo roles to The Rundown (2003), Around the World in 80 Days (2004) and The Kid & I (2005). Recently, he starred in The Expendables 2 (2012), The Last Stand (2013), Escape Plan (2013), The Expendables 3 (2014), and Terminator Genisys (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MDc4NzUyMV5BMl5BanBnXkFtZTcwMTQyMTc5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000216","name":"Arnold Schwarzenegger","nicknames":["Arnie","Austrian Oak","Conan the Republican","Styrian Oak","The Governator","The Running Man","Conan the Governor","The Machine"],"idIMDB":"nm0000216"},"actorId":"nm0000216","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lou Ferrigno","urlProfile":"http://www.imdb.com/name/nm0002073","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTcwNjQzNV5BMl5BanBnXkFtZTYwNDI0MzM1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 November 1951","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Louis Jude Ferrigno","height":"6' 4\" (1.93 m)","bio":"An internationally famous and well respected bodybuilder / actor, Lou Ferrigno first appeared on TV screens in 1977 as the musclebound The Incredible Hulk (1978), the alter ego of meek scientist Bruce Banner. Ferrigno was born in Brooklyn, New York, in 1951 and as a child suffered from an ear infection that resulted in permanent partial hearing loss. Undeterred by what some may have perceived as a disadvantage, Lou threw himself into athletics (predominantly weightlifting and body building) and at the age of 21 won his first Mr. Universe title. For good measure, he came back and won it again the following year! He also played professional football in the Canadian Football League, before coming to the attention of producer Kenneth Johnson, who was seeking just the right person to portray on screen the comic book superhero, The Incredible Hulk. With his 6' 5\", 285 lb. frame, Lou was the biggest professional bodybuilder of the time, and had recently starred in the documentary Pumping Iron (1977), about the 1975 Mr. Olympia contest in South Africa. He successfully auditioned for the part of the green-skinned Goliath, and that is the role with which he is most closely identified. \"The Hulk\" was a huge ratings success and spawned several telemovies after the initial TV series completed its run. Lou continued to remain busy in films and TV with appearances often centered around his remarkable physique. His films included Hercule (1983), Sinbad of the Seven Seas (1989) and Frogtown II (1992). Lou has additionally guest-starred on several TV shows including The Fall Guy (1981) and The New Mike Hammer (1984) and had a recurring role on The King of Queens (1998). In 1997 he was featured in the dynamic documentary about his sensational return to professional bodybuilding at age 43, Stand Tall (1997). The film detailed how he returned to compete in the Masters category of the Mr. Olympia contest against several familiar bodybuilding foes. In more recent years, he has appeared in several films, including The Misery Brothers (1995), Ping! (2000), From Heaven to Hell (2002) and a cameo as a security guard in the big-budget remake of Hulk (2003). Big Lou is also a successful author with two books detailing his bodybuilding knowledge, and his life behind the scenes playing the Incredible Hulk on TV in the 1970s, plus he has a popular website frequented by his many fans worldwide.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTcwNjQzNV5BMl5BanBnXkFtZTYwNDI0MzM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002073","name":"Lou Ferrigno","nicknames":["Big Louie","Hulk"],"idIMDB":"nm0002073"},"actorId":"nm0002073","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matty Ferrigno","urlProfile":"http://www.imdb.com/name/nm0274830","urlPhoto":"","biography":{"dateOfBirth":"25 May 1925","placeOfBirth":" New York City, New York, USA","height":"6' 3\" (1.91 m)","bio":"Matty Ferrigno was born on May 25, 1925 in New York City, New York, USA. He died on August 21, 2003 in the USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0274830","name":"Matty Ferrigno","idIMDB":"nm0274830"},"actorId":"nm0274830","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victoria Ferrigno","urlProfile":"http://www.imdb.com/name/nm0274833","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Victoria Ferrigno yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0274833","name":"Victoria Ferrigno","idIMDB":"nm0274833"},"actorId":"nm0274833","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike Katz","urlProfile":"http://www.imdb.com/name/nm0441808","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Mike Katz yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0441808","name":"Mike Katz","idIMDB":"nm0441808"},"actorId":"nm0441808","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Franco Columbu","urlProfile":"http://www.imdb.com/name/nm0173372","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NzY4OTgzOV5BMl5BanBnXkFtZTcwNDE1MDgwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Franco Columbu is an actor and producer, known for The Terminator (1984), Conan the Barbarian (1982) and The Running Man (1987).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NzY4OTgzOV5BMl5BanBnXkFtZTcwNDE1MDgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0173372","name":"Franco Columbu","idIMDB":"nm0173372"},"actorId":"nm0173372","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ed Corney","urlProfile":"http://www.imdb.com/name/nm0180357","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Ed Corney yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0180357","name":"Ed Corney","idIMDB":"nm0180357"},"actorId":"nm0180357","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ken Waller","urlProfile":"http://www.imdb.com/name/nm0909058","urlPhoto":"","biography":{"bio":"Ken Waller is an actor, known for Pumping Iron (1977), Raw Iron: The Making of 'Pumping Iron' (2002) and Kill the Golden Goose (1979).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0909058","name":"Ken Waller","idIMDB":"nm0909058"},"actorId":"nm0909058","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Serge Nubret","urlProfile":"http://www.imdb.com/name/nm0637704","urlPhoto":"","biography":{"dateOfBirth":"6 October 1938","placeOfBirth":" Anse-Bertrand, Guadeloupe, France","height":"6' (1.83 m)","bio":"Born in Guadaloupe in 1939, Serge Nubret moved to Paris in the 1950s and discovered bodybuilding. Nubret has won the titles Mr. Europe (1966), Mr. Universe (1976), and Mr. World (1977). He also came in third place in the 1973 Mr. Olympia competition and came in second in 1975, bested only by Arnold Schwarzenegger. In addition, Nubret was once the Europe Director of the International Federation of Body Building. In addition to his athletic accomplishments, Serge Nubret also acted in several films in the 1960s.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0637704","name":"Serge Nubret","idIMDB":"nm0637704"},"actorId":"nm0637704","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robbie Robinson","urlProfile":"http://www.imdb.com/name/nm0733030","urlPhoto":"","biography":{"dateOfBirth":"24 May 1945","placeOfBirth":"","bio":"Robbie Robinson became a Professional Bodybuilder in 1975. He retired in 2001 after more than 300 international and successful contests. First winner of Night of the Champions 1979 and the Master Mr. Olympia 1994 (where he beat the famous \"Hulk\" Lou Ferrigno). Now lives in Venice CA. Probably the BB Competitor with the longest career. His fight against steroids and corruption in the BB Business makes him an outsider and for the big business leaders of muscles a \"Bad Boy of Bodybuilding\". Because he started in a lighter class he never had competition against Arnold Schwarzenegger (until 1979 there were two classes, lightweight and heavyweight).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0733030","name":"Robbie Robinson","nicknames":["The Black Prince"],"idIMDB":"nm0733030"},"actorId":"nm0733030","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marianne Claire","urlProfile":"http://www.imdb.com/name/nm0163274","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Marianne Claire yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0163274","name":"Marianne Claire","idIMDB":"nm0163274"},"actorId":"nm0163274","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Zane","urlProfile":"http://www.imdb.com/name/nm0952920","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NzI5NjM1OF5BMl5BanBnXkFtZTgwOTkzNzEzMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1942","placeOfBirth":" Kingston, Pennsylvania, USA","height":"5' 9½\" (1.77 m)","bio":"Frank Zane was born on June 28, 1942 in Kingston, Pennsylvania, USA. He is an actor and writer, known for Pumping Iron (1977), Evolution of Bodybuilding (2012) and Bodybuilders (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NzI5NjM1OF5BMl5BanBnXkFtZTgwOTkzNzEzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0952920","name":"Frank Zane","idIMDB":"nm0952920"},"actorId":"nm0952920","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David DuPree","urlProfile":"http://www.imdb.com/name/nm1812613","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for David DuPree yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1812613","name":"David DuPree","idIMDB":"nm1812613"},"actorId":"nm1812613","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eddie Giuliani","urlProfile":"http://www.imdb.com/name/nm2906452","urlPhoto":"","biography":{"height":"5' 6\" (1.68 m)","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2906452","name":"Eddie Giuliani","idIMDB":"nm2906452"},"actorId":"nm2906452","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danny Padilla","urlProfile":"http://www.imdb.com/name/nm1131012","urlPhoto":"","biography":{"dateOfBirth":"3 April 1951","placeOfBirth":"","bio":"Danny Padilla was born on April 3, 1951. He is an actor, known for Pumping Iron (1977), Super Troopers (2001) and The Comeback (1980).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1131012","name":"Danny Padilla","idIMDB":"nm1131012"},"actorId":"nm1131012","character":"Himself","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0076578","urlIMDB":"http://www.imdb.com/title/tt0076578","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"© Copyright MCMLXXVI, White Mountain Films"},"technical":{"runtime":["1 hr 25 min (85 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["16 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm (blow-up)"]},"rating":"7.5","filmingLocations":[{"location":"California Hall, San Francisco, California, USA"}],"rated":"PG","awards":[{"award":"Kansas City Film Critics Circle Awards 1977","titlesAwards":[{"titleAwardOutcome":"Won KCFCC Award","categories":[{"category":"Best Documentary","names":[]}]}]}],"votes":"17,071","type":"Movie","companyCreditsSimple":[{"idCompany":"co0231465","name":"Rollie Robinson"},{"idCompany":"co0028276","name":"White Mountain Films"}],"keywords":{"keywords":["bodybuilding","gym","metal","strong man","muscleman","sweat","strength training","ego","strength","beefcake","weightlifting","body building","mr. universe","mr. olympia","contest","new york city","lifting someone into the air","heavyweight","iron","masculinity","sportsman","training","shower","body oil","chest","muscle tone","subculture","photographer","still photography","photography","flash photography","exercise machine","winner","first place","brooklyn new york city","mind game","male camaraderie","marijuana","pot smoking","strategy","competitor","friendship","friend","venice california","working out","camaraderie","male bonding","style","posing","power","muscle","exercise","lifting weights","competition","magazine","photo shoot","model","male model","father son relationship","voice over narration","nudity","male nudity","male frontal nudity","bare chested male","independent film","based on book"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:21:30"}}