{"data":{"movies":[{"title":"The Strongest Man in the World","originalTitle":"","year":"1975","releaseDate":"19750206","directors":[{"name":"Vincent McEveety","id":"nm0568546"}],"writers":[{"name":"Joseph L. McEveety","id":"nm0568539"},{"name":"Herman Groves","id":"nm0344065"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NTc1MjE1OF5BMl5BanBnXkFtZTcwMDMwNTUyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Family","Comedy","Fantasy"],"plot":"A school laboratory accident mixes one student's vitamin cereal mix with Dexter Riley's chemical experiment. When the kids decide to dispose of the mess to their neighbor's cow, they learn that the cereal gave the cow the super-strength to give a massively vast supply of milk. When they try it out on themselves, they discover that the stuff gives any human superhuman strength for a few minutes. The school sees this as the thing needed to save their school from closure, as the Dean makes a deal with his relative who owns the company that makes the cereal for financial support, unaware that it was Dexter's chemical which was solely responsible for the strength. When her competitor learn of this deal, he hires two criminals to stop it.","simplePlot":"Dexter Riley and his friends accidently discover a new chemical mixed with a cereal seems to give anyone temporary superhuman strength","actors":[{"actorName":"Kurt Russell","urlProfile":"http://www.imdb.com/name/nm0000621","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MjkxNzQwMV5BMl5BanBnXkFtZTYwNDk4ODM1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 March 1951","placeOfBirth":" Springfield, Massachusetts, USA","birthName":"Kurt Vogel Russell","height":"5' 11\" (1.8 m)","bio":"Kurt Russell was born Kurt Vogel Russell in Springfield, Massachusetts, to Louise Julia (Crone), a dancer, and actor Bing Russell (Neil Oliver Russell). He is of English, German, Scottish, and Irish descent. His first roles were as a child in television series, including a lead role in the Western series The Travels of Jaimie McPheeters (1963). Russell landed a part in the Elvis Presley movie, It Happened at the World's Fair (1963), when he was ten years old. Walt Disney himself signed Russell to a 10-year contract, and, according to Robert Osborne, he became the studio's top star of the 1970s. Having voiced adult Copper in the animated Disney film The Fox and the Hound (1981), Russell is one of the few famous child stars in Hollywood who has been able to continue his acting career past his teen years. Kurt spent the early 1970s playing minor league baseball. In 1979, he gave a classic performance as Elvis Presley in John Carpenter's ABC TV movie Elvis (1979), and married the actress who played Priscilla Presley in the film, Season Hubley. He was nominated for an Emmy Award for the role. He followed with roles in a string of well-received films, including Used Cars (1980) and Silkwood (1983), for which he was nominated for the Golden Globe Award for Best Supporting Actor - Motion Picture. During the 1980s, he starred in several films by director Carpenter; they created some of his best-known roles, including anti-hero army-turned-robber Snake Plissken in the futuristic action film Escape from New York (1981) (and later in its 1996 sequel Escape from L.A. (1996)), Antarctic helicopter pilot R.J. MacReady in the horror film The Thing (1982), and Jack Burton in the fantasy film Big Trouble in Little China (1986), all of which have since become cult classics. The Thing was based on the short story Who Goes There? by John W. Campbell, Jr., which had been interpreted on film before, albeit loosely, in 1951's The Thing from Another World (1951). In Big Trouble in Little China, Russell played a truck driver caught in an ancient Chinese war. In 1983, he became reacquainted with Goldie Hawn (who appeared with him in The One and Only, Genuine, Original Family Band (1968)) when they worked together on Swing Shift (1984). The two have lived together ever since. They made another film together, Garry Marshall's comedy Overboard (1987). His other 1980s titles include The Best of Times (1986), Winter People (1989), and the hit Tango & Cash (1989). In 1991, he headlined the firefighter drama Backdraft (1991), in 1993, he starred as Wyatt Earp in the western film Tombstone (1993), and in 1994, had a starring role in the military science fiction film Stargate - La porte des étoiles (1994). In the mid-2000s, his portrayal of U.S. Olympic hockey coach Herb Brooks in Miracle (2004) won the praise of critics. In 2006, he appeared in the disaster-thriller Poseidon (2006), and in 2007, in Quentin Tarantino's Death Proof (2007) segment from the film Grindhouse (2007). Russell appeared in The Battered Bastards of Baseball (2014), a documentary about his father and the Portland Mavericks, which debuted at the Sundance Film Festival in 2014. He co-starred in the action thriller Furious 7 (2015). In 2015, Russell starred in the western films Bone Tomahawk (2015) and The Hateful Eight (2015), and in 2016, he had a leading role in the dramatization Deepwater (2016). Russell and Goldie Hawn live on a 72-acre retreat, Home Run Ranch, outside of Aspen. He has two sons, Boston Russell (from his marriage to Hubley) and Wyatt Russell (with Hawn). He also raised Hawn's children, actors Oliver Hudson and Kate Hudson, who just call him dad.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MjkxNzQwMV5BMl5BanBnXkFtZTYwNDk4ODM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000621","name":"Kurt Russell","idIMDB":"nm0000621"},"actorId":"nm0000621","character":"Dexter Riley","urlCharacter":"http://www.imdb.com/character/ch0032818","main":true},{"actorName":"Joe Flynn","urlProfile":"http://www.imdb.com/name/nm0283499","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MDUxNTMxMV5BMl5BanBnXkFtZTcwNzA4MjcxOA@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 November 1924","placeOfBirth":" Youngstown, Ohio, USA","birthName":"Joseph A. Flynn","height":"5' 6\" (1.68 m)","bio":"Born on November 8, 1924, in Youngstown, Ohio and after attending Northwestern University, Flynn began his entertainment career as a ventriloquist and as a radio performer. During World War II, he served in the Army's Special Services Branch (formerly the Morale Branch) entertaining the troops in the United States. After the war, Flynn moved to Hollywood. He made his film debut as Joseph Flynn in the bottom-of-the-barrel, beneath-B-picture potboiler The Big Chase (1954), which co-starred Lon Chaney Jr., which he followed up with a part as a priest in The Seven Little Foys (1955) starring Bob Hope. Flynn began to achieve success on television in the late 1950s, becoming a regular on The George Gobel Show (1954). This landed him a role on The Joey Bishop Show (1961), but Flynn was dumped after the first season by Bishop for stealing too many scenes. By the time he was booted off, he had developed a reputation as a reliable comic foil. The termination of his Bishop gig proved fortuitous for he landed the role that made him a television immortal that very next season: Captain Wallace 'Leadbottom' Binghamton on McHale's Navy (1962). The classic sit-com, which co-starred Ernest Borgnine and Tim Conway, ran until 1966 and spawned two theatrical movie releases. It also lead to a co-starring role on the short-lived The Tim Conway Show (1970). Beginning with his appearance in Walt Disney Co.'s The Love Bug (1968), Flynn appeared in nine other Disney productions: seven theatrical releases and two TV movies, including two movies released after his death. He appeared in five movies with Kurt Russell, including three in which he played Eugene (E.J.) Higgins, the dean of financially-strapped Medfield College: The Computer Wore Tennis Shoes (1969), Now You See Him, Now You Don't (1972), and The Strongest Man in the World (1975). In the early 1970s, Flynn was one of the leaders of a Screen Actors Guild group that sought a more equitable distribution of TV residual payments. On July 19, 1974, just after completing his voice-over work on the Disney animated movie Les aventures de Bernard et Bianca (1977),\" he died of a heart attack in the swimming pool of his Beverly Hills home. Apparently, he had gone into the pool with a cast on his broken leg. His body was found at the pool's bottom, held down by the weight of the cast. He was 49 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MDUxNTMxMV5BMl5BanBnXkFtZTcwNzA4MjcxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0283499","name":"Joe Flynn","idIMDB":"nm0283499"},"actorId":"nm0283499","character":"Dean Higgins","urlCharacter":"http://www.imdb.com/character/ch0032827","main":true},{"actorName":"Eve Arden","urlProfile":"http://www.imdb.com/name/nm0000781","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMzQzMjU1Ml5BMl5BanBnXkFtZTcwNjExOTkxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 April 1908","placeOfBirth":" Mill Valley, California, USA","birthName":"Eunice Quedens","height":"5' 9½\" (1.77 m)","bio":"Eve was born just north of San Francisco in Mill Valley and was interested in show business from an early age. At 16, she made her stage debut after quitting school to joined a stock company. After appearing in minor roles in two films under her real name, Eunice Quedens, she found that the stage offered her the same minor roles. By the mid 30s, one of these minor roles would attract notice as a comedy sketch in the stage play \"Ziegfeld Folies\". By that time, she had changed her name to Eve Arden. In 1937, she attracted some attention with a small role in Oh, Doctor (1937) which led to her being cast in a minor role in the film Stage Door (1937). By the time the film was finished, her part had expanded into the wise-cracking, fast-talking friend to the lead. She would play virtually the character for most of her career. While her sophisticated wise-cracking would never make her the lead, she would be a busy actress in dozens of movies over the next dozen years. In At the Circus (1939), she was the acrobatic Peerless Pauline opposite Groucho Marx and the Russian sharp shooter in the comedy The Doughgirls (1944). For her role as Ida in Mildred Pierce (1945), she received an Academy Award nomination. Famous for her quick ripostes, this led to work in Radio during the 40s. In 1948, CBS Radio premiered \"Our Miss Brooks\", which would be the perfect show for her character. As her film career began to slow, CBS would take the popular radio show to television in 1952. The television series Our Miss Brooks (1952) would run through 1956 and led to he movie Our Miss Brooks (1956). When the show ended, she tried another television series, The Eve Arden Show (1957), but it was soon canceled. In the 60s, Eve raised a family and did a few guest roles, until her come-back television series The Mothers-In-Law (1967). This show, co-starring Kaye Ballard ran for two seasons. After that, she would make more unsold pilots, a couple of television movies and a few guest shots. She returned in occasional cameo appearances including the Principal McGee in Grease (1978), and Warden June in Pandemonium (1982), showing that she still had the wise-cracks and screen presence to bring back the fond memories of Miss Connie Brooks.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMzQzMjU1Ml5BMl5BanBnXkFtZTcwNjExOTkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000781","name":"Eve Arden","idIMDB":"nm0000781"},"actorId":"nm0000781","character":"Harriet Crumply","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cesar Romero","urlProfile":"http://www.imdb.com/name/nm0003110","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NjE3ODgzOV5BMl5BanBnXkFtZTcwMDMyOTkxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 February 1907","placeOfBirth":" New York City, New York, USA","birthName":"Cesar Julio Romero Jr.","height":"6' 3\" (1.91 m)","bio":"Tall, suave and sophisticated Cesar Romero actually had two claims to fame in Hollywood. To one generation, he was the distinguished Latin lover of numerous musicals and romantic comedies, and the rogue bandit The Cisco Kid in a string of low-budget westerns. However, to a younger generation weaned on television, Romero was better known as the white-faced, green-haired, cackling villain The Joker of the camp 1960s TV series Batman (1966), and as a bumbling corporate villain in a spate of Walt Disney comedies, such as chasing a young Kurt Russell in the fun-packed The Computer Wore Tennis Shoes (1969). Fans and critics alike agreed that Romero was a major talent who proved himself an enduring and versatile star in an overwhelming variety of roles in a career as an actor, dancer and comedian that lasted nearly 60 years. Cesar Romero was born of Cuban parents in New York City in February 1907. He attended the Collegiate School and Riverdale Country School before working as a ballroom dancer. He first appeared on Broadway in the 1927 production of Lady Do, and then in the stage production of Strictly Dishonorable. His first film role was in The Shadow Laughs (1933), after which he gave strong performances in The Devil Is a Woman (1935) and in the Shirley Temple favorite, Wee Willie Winkie (1937). Critics and fans generally agree that Romero's best performance was as the Spanish explorer Cortez in Captain from Castile (1947). However, he also shone in the delightful Julia Misbehaves (1948) and several other breezy and lighthearted escapades. In 1953 he starred in the 39-part espionage TV serial Passport to Danger (1954), which earned him a considerable income due to a canny profit-sharing arrangement. Although Romero became quite wealthy and had no need to work, he could not stay away from being in front of the cameras. He continued to appear in a broad variety of film roles, but surprised everyone in Hollywood by taking on the role of \"The Joker\" in the hugely successful TV series Batman (1966). He refused to shave his trademark mustache for the role, and close observation shows how the white clown makeup went straight on over his much loved mustache! The appearances in Batman were actually only a small part of the enormous amount of work that Romero contributed to television. He guest-starred in dozens of shows, including Rawhide (1959), 77 Sunset Strip (1958), Zorro (1957), Fantasy Island (1977) and Murder, She Wrote (1984). However, it was The Joker for which his TV work was best remembered, and Romero often remarked that for many, many years after Batman ended, fans would stop him and ask him to chuckle and giggle away just like he did as The Joker. Romero always obliged, and both he and the fans just loved it! With a new appeal to a younger fan base, Romero turned up in three highly popular Disney comedies: The Computer Wore Tennis Shoes (1969), Now You See Him, Now You Don't (1972) and The Strongest Man in the World (1975) as corrupt but inept villain A.J. Arno. Throughout the remainder of the 1980s Romero remained busy, and even at 78 years of age the ladies still loved his charm, and he was cast as Jane Wyman's love interest in the top-rated prime-time soap opera Falcon Crest (1981), playing Peter Stavros from 1985 to 1987. Although Romero stopped acting in 1990, he remained busy, regularly hosting classic movie programs on cable television. A talented and much loved Hollywood icon, he passed away on New Year's Day 1994, at the age of 86.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NjE3ODgzOV5BMl5BanBnXkFtZTcwMDMyOTkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003110","name":"Cesar Romero","nicknames":["Butch","The Latin Lover","The Latin from Manhattan"],"idIMDB":"nm0003110"},"actorId":"nm0003110","character":"A.J. Arno","urlCharacter":"http://www.imdb.com/character/ch0032828","main":true},{"actorName":"Phil Silvers","urlProfile":"http://www.imdb.com/name/nm0799014","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMTAwMDI1OV5BMl5BanBnXkFtZTcwODQ1NTUyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 May 1911","placeOfBirth":" New York City, New York, USA","birthName":"Philip Silver","height":"5' 11\" (1.8 m)","bio":"Phil Silvers was born on May 11, 1911 in New York City, New York, USA as Philip Silver. He was an actor, known for The Phil Silvers Show (1955), A Funny Thing Happened on the Way to the Forum (1966) and It's a Mad Mad Mad Mad World (1963). He was married to Evelyn Patrick and Jo-Carroll Dennison. He died on November 1, 1985 in Century City, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMTAwMDI1OV5BMl5BanBnXkFtZTcwODQ1NTUyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0799014","name":"Phil Silvers","nicknames":["The King of Chutzpah"],"idIMDB":"nm0799014"},"actorId":"nm0799014","character":"Kirwood Krinkle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dick Van Patten","urlProfile":"http://www.imdb.com/name/nm0887694","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MDg2NDQ3OV5BMl5BanBnXkFtZTcwMTg5OTQ4Mg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 December 1928","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Richard Vincent Van Patten","height":"5' 9½\" (1.77 m)","bio":"Dick Van Patten began acting as a child. He made his first of 27 Broadway appearances, at age seven, in \"Tapestry in Grey\". After, he appeared in many films, including Freaky Friday (1976), with Jodie Foster; Sacré Robin des Bois (1993) and Spaceballs (1987). His TV credits include his starring role on the hit 80's comedy-drama, Eight Is Enough (1977), where he played \"Tom Bradford\" - the patriarchal head of the pack. Dick also authored several bestselling books, including \"How To Get Your Child Into Show Business\" and his autobiography, \"Eight Isn't Enough\". Dick is also known for starting (by lending his name to) \"Natural Balance\", a line of high-end dog food that is intended to be indistinguishable from stews and other dishes, that are normally intended for human consumption. Dick was married to former The June Taylor Dancers' Pat Van Patten (nee Poole) for over 60 years. They have three sons: Nels Van Patten, James Van Patten and Vincent Van Patten.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MDg2NDQ3OV5BMl5BanBnXkFtZTcwMTg5OTQ4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0887694","name":"Dick Van Patten","idIMDB":"nm0887694"},"actorId":"nm0887694","character":"V.P. Harry Crumply","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harold Gould","urlProfile":"http://www.imdb.com/name/nm0332390","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyOTIyNzMwMF5BMl5BanBnXkFtZTcwOTM0Njg4Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1923","placeOfBirth":" Schenectady, New York, USA","birthName":"Harold Vernon Goldstein","height":"5' 9½\" (1.77 m)","bio":"Harold Gould earned a Ph.D. in theatre and taught speech and drama at Cornell University. Pursuing some off-Broadway work in the 1950s, he decided to practice what he preached, and became a full-time professional actor in the 1960s. He has appeared in hundreds of TV shows since, usually playing a father, grandfather or other authority figure.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyOTIyNzMwMF5BMl5BanBnXkFtZTcwOTM0Njg4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0332390","name":"Harold Gould","idIMDB":"nm0332390"},"actorId":"nm0332390","character":"Regent Dietz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael McGreevey","urlProfile":"http://www.imdb.com/name/nm0569951","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1ODkzODMwNF5BMl5BanBnXkFtZTcwMTkyMzk1Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 February 1948","placeOfBirth":" Phoenix, Arizona, USA","bio":"Michael McGreevey began his professional career at the age of seven, appearing in The Girl Most Likely (1958) with Jane Powell, the first of 18 films he would act in over the next 20 years. A successful child actor, Michael also appeared in over 100 television shows, including stints as a series regular on Riverboat (1959) (Burt Reynolds' first show) and guest-star appearances on such acclaimed series as Naked City (1958), Route 66 (1960) and three two-part specials for Walt Disney's Wonderful World of Color (1954). At 18 years of age he enrolled in classes at UCLA while continuing his professional acting career, starring opposite Kirk Douglas, Robert Mitchum and Sally Field in The Way West (1967) (Field's first film), with David Niven in The Impossible Years (1968) and alongside Richard Widmark and Lena Horne in Death of a Gunfighter (1969), as well as guest-starring in numerous television shows (Mod Squad (1968), Love, American Style (1969)) and made-for-TV movies (including If Tomorrow Comes (1971) with Patty Duke). Graduating from UCLA Film School with honors, he continued to work as an actor, but set his sights on one day moving behind the camera and trying his hand at writing, directing, and producing. While co-starring opposite Kurt Russell in a series of very successful movies for Disney (The Computer Wore Tennis Shoes (1969), Now You See Him, Now You Don't (1972), Snowball Express (1972) and The Strongest Man in the World (1975)) and making guest-star appearances on acclaimed television series like The Waltons (1971), Michael began writing. He was lucky enough to get his first professional writing assignment collaborating with his father, John McGreevey (Emmy Award; WGA Laurel Award) developing a three-hour movie for television about the Kennedy assassination entitled Ruby and Oswald (1978). A truly monumental television event, \"Ruby and Oswald\" was a ratings winner as well as a critical success. Michael continued writing on his own, branching out into series television, working on such shows as \"The Waltons\" with creator Earl Hamner Jr., Palmerstown, U.S.A. (1980) with Alex Haley and Norman Lear, Quincy M.E. (1976) and many others. Michael was nominated for an Emmy award for his teleplay of the ABC Afterschool Special, ABC Afterschool Specials: The Celebrity and the Arcade Kid (1983). What started out as a freelance assignment writing one episode of Fame (1982), the NBC series based on the popular film, turned into three seasons (72 episodes) as writer, story editor and eventually producer. Having written more episodes than anyone else, Michael was the obvious choice to write the last \"Fame\" show, effectively closing the door on the School of the Arts and bringing the award-winning series to an end. After \"Fame\", Michael decided he needed a break from the grind of series television, and returned to writing long-form television, developing movies and mini-series for all the networks, including NBC's highest rated movie of the '194 season, Bonanza: The Return (1993). Michael returned to series television as the Supervising Producer of High Tide (1994) for the '95-'96 season and then assumed the same duties on the syndicated series, Tarzan: The Epic Adventures (1996), completing 22 episodes for the '96-'97 season. He realized another life-long dream by directing one of the \"Tarzan\" episodes. Having been bitten by the directing bug, Michael immediately took on another assignment, helming three episodes of the Fox Network's children series, Mowgli: The New Adventures of the Jungle Book (1998). The producers (Alliance, Kushner-Locke) were so pleased with his work on this demanding action/adventure series that they asked him to direct an independent feature based on the Kipling books, Jungle Book: Lost Treasure (1998), starring Gary Collins and Michael Beck. Immediately after completing the film, McGreevey returned to television, executive-producing (as well as writing and directing) 26 one-hour episodes of the syndicated series Born Free (1998) (a continuation of the very popular movie based on Joy Adamson's extraordinary work with the lioness, Elsa, in Africa). Since finishing the series, Michael has co-written an action\\thriller television movie and series pilot, \"Endangered,\" and co-wrote the script for a big-budget adaptation of the L. Frank Baum classic, \"The Life and Adventures of Santa Claus.\" He is presently developing an original screenplay, \"13 Weeks,\" a romantic comedy about working in series television, and shooting three documentaries entitled \"Aging Without Symptoms,\" \"Welcome to Eden,\" and \"The Face of America.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1ODkzODMwNF5BMl5BanBnXkFtZTcwMTkyMzk1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0569951","name":"Michael McGreevey","idIMDB":"nm0569951"},"actorId":"nm0569951","character":"Richard Schuyler","urlCharacter":"http://www.imdb.com/character/ch0147316","main":true},{"actorName":"Richard Bakalyan","urlProfile":"http://www.imdb.com/name/nm0048147","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NTg3MTExM15BMl5BanBnXkFtZTgwMzAzOTEzMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 1931","placeOfBirth":" Watertown, Massachusetts, USA","height":"5' 7\" (1.7 m)","bio":"Richard Bakalyan was born on January 29, 1931 in Watertown, Massachusetts, USA. He was an actor and writer, known for Chinatown (1974), The Fox and the Hound (1981) and Von Ryan's Express (1965). He was married to Betty Lee Bauman. He died on February 27, 2015 in Elmira, New York, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NTg3MTExM15BMl5BanBnXkFtZTgwMzAzOTEzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0048147","name":"Richard Bakalyan","nicknames":["Dick","Dicky B"],"idIMDB":"nm0048147"},"actorId":"nm0048147","character":"Cookie","urlCharacter":"http://www.imdb.com/character/ch0147319","main":true},{"actorName":"William Schallert","urlProfile":"http://www.imdb.com/name/nm0769974","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5ODQzMTYxOF5BMl5BanBnXkFtZTYwMTc0MDI0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1922","placeOfBirth":" Los Angeles, California, USA","birthName":"William Joseph Schallert","height":"6' 1\" (1.85 m)","bio":"The son of Edwin Schallert, drama editor of the \"Los Angeles Times\" and the dean of West Coast critics, William Schallert became interested in an acting career while at UCLA in 1942. After graduation, he became involved with the Circle Theater (eventually becoming one of its owners) and made his film debut in The Foxes of Harrow (1947). He then became ubiquitous in movies and TV ever since, and from 1979 to 1981, he was president of the Screen Actors Guild. He stayed active with SAG projects and said he never gave retirement a thought.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5ODQzMTYxOF5BMl5BanBnXkFtZTYwMTc0MDI0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0769974","name":"William Schallert","nicknames":["Bill"],"idIMDB":"nm0769974"},"actorId":"nm0769974","character":"Prof. Quigley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Benson Fong","urlProfile":"http://www.imdb.com/name/nm0284538","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NzY0MjMwMl5BMl5BanBnXkFtZTgwNDY1ODgwMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1916","placeOfBirth":" Sacramento, California, USA","height":"5' 9\" (1.75 m)","bio":"Benson Fong was born on October 10, 1916 in Sacramento, California, USA. He is known for his work on The Love Bug (1968), Flower Drum Song (1961) and Our Man Flint (1966). He was married to Maylia. He died on August 1, 1987 in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NzY0MjMwMl5BMl5BanBnXkFtZTgwNDY1ODgwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0284538","name":"Benson Fong","idIMDB":"nm0284538"},"actorId":"nm0284538","character":"Ah Fong","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Gregory","urlProfile":"http://www.imdb.com/name/nm0339834","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDA0ODg2NzQwOV5BMl5BanBnXkFtZTcwMjMzMjYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 December 1911","placeOfBirth":" The Bronx, New York City, New York, USA","height":"6' (1.83 m)","bio":"New York-born James Gregory gave up a career as a stockbroker for one as an actor, and began on the Broadway stage. He made his film debut in 1948. Gregory specialized in playing loud, brash, tough cops or businessmen. One of his better roles was as the detective out to get Capone in Al Capone (1959). He also played Dean Martin's boss in three of the four cheesy \"Matt Helm\" spy films. Memorable as the opinionated, loudmouthed Inspector Luger in the television series Barney Miller (1974).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDA0ODg2NzQwOV5BMl5BanBnXkFtZTcwMjMzMjYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0339834","name":"James Gregory","idIMDB":"nm0339834"},"actorId":"nm0339834","character":"Chief Blair","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ann Marshall","urlProfile":"http://www.imdb.com/name/nm0550749","urlPhoto":"","biography":{"dateOfBirth":"17 July 1946","placeOfBirth":" USA","birthName":"Joann Marshall","bio":"Ann Marshall was born on July 17, 1946 in the USA as Joann Marshall. She is an actress, known for The Strongest Man in the World (1975), Mickey and the Contessa (1963) and Superdad (1973).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0550749","name":"Ann Marshall","idIMDB":"nm0550749"},"actorId":"nm0550749","character":"Debbie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Don Carter","urlProfile":"http://www.imdb.com/name/nm0141583","urlPhoto":"","biography":{"bio":"Don Carter is an actor, known for A Boy and His Dog (1975), Freaky Friday (1976) and The Strongest Man in the World (1975).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0141583","name":"Don Carter","idIMDB":"nm0141583"},"actorId":"nm0141583","character":"Gilbert","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christina Anderson","urlProfile":"http://www.imdb.com/name/nm0026519","urlPhoto":"","biography":{"bio":"Christina Anderson is an actress, known for The Strongest Man in the World (1975), Charley and the Angel (1973) and The Shaggy D.A. (1976).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0026519","name":"Christina Anderson","idIMDB":"nm0026519"},"actorId":"nm0026519","character":"Cris","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0073760","urlIMDB":"http://www.imdb.com/title/tt0073760","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"28","month":"05","year":"1974","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 32 min (92 min)"],"soundMix":["Mono (RCA Photophone Sound Recording)"],"color":["Color (Technicolor)"],"aspectRatio":["1.75 : 1"],"camera":null,"laboratory":["Technicolor"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.0","filmingLocations":[{"location":"Glendale, California, USA"}],"rated":"G","awards":[],"votes":"1,949","type":"Movie","companyCreditsSimple":[{"idCompany":"co0098836","name":"Walt Disney Productions"}],"keywords":{"keywords":["cereal","strength","cow","company","formula","school","experiment","milk","superhuman strength","super strength","competition","student","laboratory","vitamin","speeding vehicle","star died before release","bowl of cereal","reference to tarzan","muscleman","steamed over eyeglasses","sequel","college campus","slam dunk","basketball court","overweight","fat boy","slapstick comedy","lamp post","doorknob","broken door handle","science project","chinese restaurant","live broadcast","reserved parking place","reference to king kong","race against time","television broadcast","animated opening credits","ends with freeze frame","freeze frame","test tube","stopped by police","traffic light","runaway car","car chase","making out in a car","convertible","henchman","classic car","elongating arm","balloon","contest","sponsor","puff of smoke","karate chop","bust sculpture","lifted by helium balloon","helium balloon","bail","arrest","motorcycle cop","police chase","stolen police car","police car","stolen car","chinatown","rivalry","business rivalry","asian american","police chief","industrial spy","board meeting","boardroom","swinging from a chandelier","chandelier","chinese american","lifting person in air","feats of strength","barbell","eating cereal","cereal box","breakfast cereal","chinese food","vitamin pills","hypnosis","bird poop","dog chasing a dog","dog chase","catflap","secret formula","milking a cow","chemical formula","college dean","aunt nephew relationship","acupuncture","industrial espionage","falling from height","ex convict","release from prison","doberman","fraternity house","college professor","fired from the job","fraternity","dog","door knob pulled off","kidnapping","pet dog","college student","tied to a chair","six word title","school administrator","college","weightlifting","potion","laboratory accident","medfield college","teenager","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:41:26"}}