{"data":{"movies":[{"title":"Dr. No","originalTitle":"","year":"1962","releaseDate":"19630127","directors":[{"name":"Terence Young","id":"nm0950109"}],"writers":[{"name":"Richard Maibaum","id":"nm0537363"},{"name":"Johanna Harwood","id":"nm0367820"}],"runtime":"110 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU3NzExMTQ4N15BMl5BanBnXkFtZTcwMjkzNzQzNA@@._V1.jpg","countries":["UK"],"languages":["English","French"],"genres":["Action","Adventure","Thriller"],"plot":"James Bond (007) is Britain's top agent and is on an exciting mission, to solve the mysterious murder of a fellow agent. The task sends him to Jamaica, where he joins forces with Quarrel and a loyal CIA agent, Felix Leiter. While dodging tarantulas, \"fire breathing dragons\" and a trio of assassins, known as the three blind mice. Bond meets up with the beautiful Honey Ryder and goes face to face with the evil Dr. No.","simplePlot":"A resourceful British government agent seeks answers in a case involving the disappearance of a colleague and the disruption of the American space program.","actors":[{"actorName":"Sean Connery","urlProfile":"http://www.imdb.com/name/nm0000125","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcwNTM4MzctYjQzMi00NTA2LTljYWItNTYzNmE1MTYxN2RlXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1930","placeOfBirth":" Edinburgh, Scotland, UK","birthName":"Thomas Sean Connery","height":"6' 2\" (1.88 m)","bio":"Sean Connery is best known for portraying the character James Bond, starring in seven Bond films between 1962 and 1983. In 1988, Connery won the Academy Award for Best Supporting Actor for his role in The Untouchables (1987). His film career also includes such films as Marnie (1964), The Name of the Rose (1986), The League of Extraordinary Gentlemen (2003), Indiana Jones and the Last Crusade (1989), The Hunt for Red October (1990), Highlander (1986), Murder on the Orient Express (1974), DragonHeart (1996) and The Rock (1996). Connery has been polled as \"The Greatest Living Scot\" and \"Scotland's Greatest Living National Treasure\". In 1989, he was proclaimed \"Sexiest Man Alive\" by People magazine, and in 1999, at age 69, he was voted \"Sexiest Man of the Century\". Thomas Sean Connery was born on August 25, 1930 in Fountainbridge, Edinburgh, Scotland. His mother, Euphemia McBain (née McLean), was a cleaning lady, and his father, Joseph Connery, was a factory worker and truck driver. He has a brother, Neil Connery, who works as a plasterer in Edinburgh. He is of Irish and Scottish descent. Before going into acting, Sean had many different jobs, such as a milkman, lorry driver, a laborer, artist's model for the Edinburgh College of Art, coffin polisher and bodybuilder. He also joined the Royal Navy, but was later discharged because of medical problems. At the age of 23, he had a choice between becoming a professional footballer or an actor, and even though he showed much promise in the sport, he chose acting and said it was one of his more intelligent moves. No Road Back (1957) was Sean's first major movie role, and it followed by several Tv-movies such as Anna Christie (1957), Macbeth (1961) and Anna Karenina (1961) and guest appearances on TV-series, and also films such as Hell Drivers (1957), Another Time, Another Place (1958), Darby O'Gill and the Little People (1959), The Frightened City (1961). In 1962 he appeared in The Longest Day (1962) with a host of other stars. Connery's breakthrough came in the role of secret agent James Bond. He was reluctant to commit to a film series, but understood that if the films succeeded his career would greatly benefit. He played the character in the first five Bond films: Dr. No (1962), From Russia with Love (1963), Goldfinger (1964), Thunderball (1965), and You Only Live Twice (1967) - then appeared again as Bond in Diamonds Are Forever (1971) and Never Say Never Again (1983). All seven films were commercially successful. James Bond, as portrayed by Connery, was selected as the third-greatest hero in cinema history by the American Film Institute. Connery's selection for the role of James Bond owed a lot to Dana Broccoli, wife of producer \"Cubby\" Broccoli, who is reputed to have been instrumental in persuading her husband that Connery was the right man. James Bond's creator, Ian Fleming, originally doubted Connery's casting, saying, \"He's not what I envisioned of James Bond looks\", and \"I'm looking for Commander Bond and not an overgrown stunt-man,\" adding that Connery (muscular, 6' 2\", and a Scot) was unrefined. Fleming's girlfriend told him that Connery had the requisite sexual charisma, and Fleming changed his mind after the successful Dr. No (1962) premiere. He was so impressed, he created a half-Scottish, half-Swiss heritage for Bond in the later novels. Connery's portrayal of Bond owes much to stylistic tutelage from director Terence Young, polishing the actor while using his physical grace and presence for the action. Lois Maxwell, who played Miss Moneypenny, related that, \"Terence took Sean under his wing. He took him to dinner, showed him how to walk, how to talk, even how to eat.\" The tutoring was successful; Connery received thousands of fan letters a week, and the actor became one of the great male sex symbols of film. During the filming of Thunderball (1965), Connery's life was in danger in the sequence with the sharks in Emilio Largo's pool. He had been concerned about this threat when he read the script. Connery insisted that Ken Adam build a special Plexiglas partition inside the pool, but, despite this, it was not a fixed structure and one of the sharks managed to pass through it. He had to abandon the pool immediately. Connery was forced to wear a toupee during each of the Bond movies because he had started balding at the age of 17. This didn't prevent Connery from being cast in roles, although it became more noticeable in his later years. In 2005, From Russia with Love was adapted by Electronic Arts into a video game, titled From Russia with Love (2005), which featured all-new voice work by Connery as well as his likeness, and those of several of the film's supporting cast. After and during the success of the Bond-films he has maintained a successful career as an actor and has appeared in films, including Alfred Hitchcock's Marnie (1964), The Hill (1965), Murder on the Orient Express (1974), The Man Who Would Be King (1975), The Wind and the Lion (1975), Time Bandits (1981), Highlander (1986), The Name of the Rose (1986), The Untouchables (1987) (which earned him an Oscar for best actor in a supporting role), Indiana Jones and the Last Crusade (1989), The Hunt for Red October (1990), Rising Sun (1993), The Rock (1996), Finding Forrester (2000), and The League of Extraordinary Gentlemen (2003). Sean married actress Diane Cilento in 1962 and they had a son, Jason Connery, born on January 11, 1963, he followed in his father's footsteps and also became an actor. The marriage ended in divorce in 1973. In 1975 he married Micheline Roquebrune and they have stayed married, they have no children together. He is also a grandfather. His son, Jason and his ex-wife, actress Mia Sara had a son, Dashiell Quinn Connery, in 1997.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcwNTM4MzctYjQzMi00NTA2LTljYWItNTYzNmE1MTYxN2RlXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000125","name":"Sean Connery","nicknames":["Big Tam"],"idIMDB":"nm0000125"},"actorId":"nm0000125","character":"James Bond","urlCharacter":"http://www.imdb.com/character/ch0000007","main":true},{"actorName":"Ursula Andress","urlProfile":"http://www.imdb.com/name/nm0000266","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMjE4NjMzNDReQTJeQWpwZ15BbWU3MDk4OTU2MDQ@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 March 1936","placeOfBirth":" Ostermundigen, Bern, Switzerland","height":"5' 5\" (1.65 m)","bio":"The quintessential jet-set Euro starlet, Ursula Andress was born in the Swiss canton of Berne on March 19, 1936, one of six children in a strict German Protestant family. Although often seeming icily aloof, a restless streak early demonstrated itself in her personality, and she had an impetuous desire to explore the world outside Switzerland. (For instance, she was tracked down by Interpol for running away from boarding school at 17 years old.) The stunning young woman found work as an art model in Rome and did walk-ons in three quickie Italian features before coming to Hollywood. At 19, she met fading matinée idol John Derek, who left his first wife and two children to marry Ursula in 1957, despite the fact that she only spoke a few words of English at the time, and persuaded the new bride to put her acting ambitions on hold for a few years thereafter. The year 1962 saw the virtually unknown Swiss beauty back on the set, playing a small role in the first movie version of Ian Fleming's fanciful \"James Bond\" espionage novels, Dr. No (1962), opposite Sean Connery. Due to the heaviness of her Swiss/German accent, Andress' entire performance had to be dubbed by a voiceover artist. Nevertheless, her striking beauty and smoldering screen presence made a strong impression on moviegoers, immediately establishing her as one of the most desired women in the world and as an ornament to put on-screen alongside some of the most bankable talent of the era, such as Elvis Presley in Fun in Acapulco (1963) and Dean Martin in 4 for Texas (1963). In 1965, she was one of several European starlets to co-star in Quoi de neuf, Pussycat? (1965) -- a film that perhaps sums up mid-'60s pop culture better than any other -- written by Woody Allen, starring Allen and Peter Sellers, with music by Burt Bacharach, a title song performed by Tom Jones and much on-screen sexual romping. Andress appeared in many more racy-for-their time movies in both the United States and Europe, including The 10th Victim (1965), in which she wore a famously ballistic bra, and The Blue Max (1966), where she was aptly cast as the sultry, sexually insatiable wife of an aristocratic World War I German general. She was also featured in Casino Royale (1967), a satirical foray into the world of James Bond, and gave a sparkling performance in the crime caper Perfect Friday (1970). Roles as a prostitute kidnapped by outlaws in Red Sun (1971) and a bombshell nurse hired to titillate a doddering millionaire to death in The Sensuous Nurse (1975) provided plenty of excuses to throw her clothes to the wind, and she was notoriously stripped and slathered in orange paint by a pair of nubiles in The Mountain of the Cannibal God (1978), before taking on the role of King Louis XIV's alluring mistress in Le 5e mousquetaire (1979) . Unmarried since 1966 (she divorced Derek after falling in love with French actor Jean-Paul Belmondo on the Malaysian set of Up to His Ears (1965)), Andress played the field for years, reportedly involved at various times with a host of lovers including (but by no means limited to) Dennis Hopper, Ryan O'Neal, Marcello Mastroianni and Fabio Testi. In 1979, she began what would be a long-term romance with Harry Hamlin, her handsome young co-star from Clash of the Titans (1981) (in which she was cast, predictably, as \"Aphrodite\"). While subsequently traveling in India, Andress' belly began to swell out of her clothing, and she felt very nauseous. What at first seemed a severe case of \"Delhi Belly\" turned out to be pregnancy, her first and only, at age 43. She and Hamlin named the child, who was born in 1980, Dimitri Hamlin. After the birth of her son, Andress scaled back her career, which now focused mostly on slight European films and occasional television roles, as she was raising Dimitri in Rome. Her relationship with Hamlin ended in 1983, and she last worked on a film in 2005. Ursula divides her time between family in Switzerland, friends in Spain and Virginia, and her properties in California and Italy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMjE4NjMzNDReQTJeQWpwZ15BbWU3MDk4OTU2MDQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000266","name":"Ursula Andress","nicknames":["Urs"],"idIMDB":"nm0000266"},"actorId":"nm0000266","character":"Honey Ryder","urlCharacter":"http://www.imdb.com/character/ch0000307","main":true},{"actorName":"Joseph Wiseman","urlProfile":"http://www.imdb.com/name/nm0936476","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NzI5MDY3NV5BMl5BanBnXkFtZTYwODQ4NjU2._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 May 1918","placeOfBirth":" Montreal, Quebec, Canada","height":"6' (1.83 m)","bio":"Joseph Wiseman was born on May 15, 1918 in Montreal, Quebec, Canada. He came to Broadway in the 1930s, where he was critically hailed for performances in Shakespeare's \"King Lear\", Clifford Odets' \"Golden Boy\" and Anton Chekhov's \"Uncle Vanya\". Motion pictures in which Wiseman has been seen include Detective Story (1951), starring Kirk Douglas, Viva Zapata! (1952) with Marlon Brando, The Garment Jungle (1957), The Night They Raided Minsky's (1968), Cosa Nostra (1972) and L'apprentissage de Duddy Kravitz (1974) which brought him back to his native Canada for a co-starring role with Richard Dreyfuss.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NzI5MDY3NV5BMl5BanBnXkFtZTYwODQ4NjU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0936476","name":"Joseph Wiseman","idIMDB":"nm0936476"},"actorId":"nm0936476","character":"Dr. No","urlCharacter":"http://www.imdb.com/character/ch0000394","main":true},{"actorName":"Jack Lord","urlProfile":"http://www.imdb.com/name/nm0520437","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjI5MzYzN15BMl5BanBnXkFtZTYwNTU2OTQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 December 1920","placeOfBirth":" New York City, New York, USA","birthName":"John Joseph Patrick Ryan","height":"6' 2\" (1.88 m)","bio":"Jack Lord will probably be best remembered as Steve McGarrett in the long running television series Hawaii Five-O (1968), but he was much more than that however. He starred in several movies, directed several episodes of his show, was in several Broadway productions, and was an accomplished artist. Two of his paintings were acquired by New York's Metropolitan Museum of Art and the British Museum of Modern Art by the time he was twenty. Lord was also known for being a very cultured man who loved reading poetry out loud on the set of his TV show and as being somewhat reclusive at his Honolulu home. He met his son from his first marriage, who was killed in an accident when he was thirteen, only once as a baby.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjI5MzYzN15BMl5BanBnXkFtZTYwNTU2OTQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0520437","name":"Jack Lord","idIMDB":"nm0520437"},"actorId":"nm0520437","character":"Felix Leiter","urlCharacter":"http://www.imdb.com/character/ch0000313","main":true},{"actorName":"Bernard Lee","urlProfile":"http://www.imdb.com/name/nm0496866","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NTc3MTAxMV5BMl5BanBnXkFtZTYwNTM5NjU2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 January 1908","placeOfBirth":" Brentford, Middlesex, England, UK","birthName":"John Bernard Lee","height":"6' 0½\" (1.84 m)","bio":"Best remembered as 'M' in the James Bond films, Bernard Lee was a popular character player in British films throughout the 1950s and 1960s. Born into a theatrical family, he made his stage debut at age six and later attended the Royal Academy of Dramatic Art. He first appeared on the West End stage in London in 1928, and continued to work in the theatre during the 1930s, taking only occasional film roles. It was only after World War II that he concentrated his efforts on the cinema, and was much in demand in British films of the 1950s as friendly authority figures, including army sergeants, police detectives or navy officers. Detectives became a particular specialty, and he played this role in more than a dozen films, including The Blue Lamp (1950), Beat the Devil (1953) and The Detective (1954). In the early 1960s, he also made regular appearances as police detectives in the The Edgar Wallace Mystery Theatre (1960) second feature series, usually as \"Inspector Meredith\". He also made memorable appearances in The Third Man (1949), Operation Disaster (1950), Glory at Sea (1952), Pursuit of the Graf Spee (1956), Dunkirk (1958) and Whistle Down the Wind (1961). He was effectively cast against type in only two films, as the union agitator in The Angry Silence (1960), and as a disgruntled civil servant who becomes a spy for the Russians in Ring of Treason (1964). In 1962, he made his first appearance as the head of the British secret service in the first James Bond film, Dr. No (1962). He went on to be featured in the next ten films in the series, appearing with Sean Connery, George Lazenby and, later, Roger Moore as Bond, and will probably be considered the definitive \"M\" by more than one generation of Bond fans.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NTc3MTAxMV5BMl5BanBnXkFtZTYwNTM5NjU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0496866","name":"Bernard Lee","idIMDB":"nm0496866"},"actorId":"nm0496866","character":"M.","urlCharacter":"http://www.imdb.com/character/ch0000295","main":true},{"actorName":"Anthony Dawson","urlProfile":"http://www.imdb.com/name/nm0206060","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NjM2NjQ0Ml5BMl5BanBnXkFtZTcwNzkzNzQzNA@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 October 1916","placeOfBirth":" Edinburgh, Scotland, UK","height":"6' 2\" (1.88 m)","bio":"Long-faced, emaciated-looking character actor with a thin mustache and an impeccable English accent, Anthony Dawson was typecast in a variety of villainous roles in the 1950s and 1960s. He was born Anthony Douglas Gillon Dawson in Edinburgh, Scotland, to Ida Violet (Kittel) and Eric Francis Dawson. His father was Scottish and his mother was of German and English descent. Dawson made his greatest impact in the Alfred Hitchcock classic Dial M for Murder (1954). He was excellent as Lesgate, seedy ex-Cambridge classmate of would-be wife murderer Wendice (Ray Milland). In the scene where Wendice blackmails him to commit the killing (\"There were times I felt you belonged to me\"), he is nervous and visibly torn between fear and avarice. Dawson gave similarly sinister performances in the thriller Midnight Lace (1960), where he menaced hapless Doris Day, and the Terence Fisher-directed Hammer horror The Curse of the Werewolf (1961) as Count Siniestro. In another film by this director, the James Bond classic Dr. No (1962), Dawson played the geologist Prof. R.J.Dent, a henchman of the title character who attempts to assassinate the hero, then finds out to his cost what Bond's \"license to kill\" really means. Dawson was also the first screen incarnation of Bond villain Ernst Stavro Blofeld (in From Russia with Love (1963) and Thunderball (1965)), though the viewer only sees his hands stroking a white cat and hears the voice of Austrian actor Eric Pohlmann. A highly capable, immediately recognizable actor, Dawson deserved better roles than came his way after the mid-1960s. He eventually ended up playing small parts in minor Italian films and European co-productions, but should not be confused with the Italian horror director Antonio Margheriti who sometimes used the pseudonym 'Anthomy M. Dawson'. An interesting footnote to Dawson's career are his unpublished memoirs, \"Rambling Recollections\", in which he vividly recalls meeting Hitchcock after first arriving in Hollywood. This took place at a dinner party given by the director at Perino's Restaurant in Los Angeles. Also present were 'Dial M' co-stars Grace Kelly and English actor John Williams. Dawson later escorted Kelly to her residence at Chateau Marmont, an apartment bloc on Sunset Strip. Dawson then intimated that an affair took place, which, however lasted just until Ray Milland arrived on the scene.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NjM2NjQ0Ml5BMl5BanBnXkFtZTcwNzkzNzQzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0206060","name":"Anthony Dawson","idIMDB":"nm0206060"},"actorId":"nm0206060","character":"Professor Dent","urlCharacter":"http://www.imdb.com/character/ch0000372","main":true},{"actorName":"Zena Marshall","urlProfile":"http://www.imdb.com/name/nm0551243","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNTMzMjMwNl5BMl5BanBnXkFtZTcwMTIzMDMxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1925","placeOfBirth":" Nairobi, Kenya","height":"5' 5\" (1.65 m)","bio":"Striking, dark-haired beauty Zena Moyra Marshall was born of French (from her mother's side) and English/Irish (her father's) ancestry in Narobi, Kenya. After the early death of her father, her mother remarried and moved the family to Leicestershire. Zena received her education from St Mary's Roman Catholic School in Ascot. Her interest in the acting profession matured after a wartime theatrical tour with the Entertainments National Service Association (ENSA), while still in her teens. After completing her training at RADA, her exotic looks led to a contract with the Rank Organisation where she was groomed by the so-called 'charm school' as a sultry temptress and second lead in costume films, romantic melodramas and thrillers. Zena made her screen debut in the stagey, moribund epic Caesar and Cleopatra (1945). She had a bit-part as a handmaiden. Interestingly, this was also a screen bow for future James Bond star Roger Moore, uncredited as a Roman soldier. Zena's subsequent career was anything but meteoric. For several years, she was given only minor supporting roles in productions by Rank affiliates, such as GFD/Two Cities and Gainsborough, including Sleeping Car to Trieste (1948), Snowbound (1948) and So Long at the Fair (1950). A brief sojourn in Hollywood resulted in a lacklustre Allied Artists musical, Let's Be Happy (1957), as an amorous redhead, rivalling star Vera-Ellen for the affections of crooner Tony Martin. During the 1950's, she managed to rekindle her theatrical career and, by the end of the decade, went on tour through Germany and the Netherlands with \"The Late Edwina Black\". Zena was one of the first actresses to be featured in a British television commercial (for shampoo) on early ITV. Television did, in the end, become her favoured medium. She had some of her better on-screen moments in three episodes of Danger Man (1960), opposite Patrick McGoohan, between 1961 and 1964. Zena Marshall's main claim to fame rests on her portrayal of the Eurasian double agent, Miss Taro, in the first ever Bond film, Dr. No (1962). Her character was, incidentally, the first woman seduced by Bond, prior to his encounter with Ursula Andress in the part of Honey Rider. Another noted beauty, the reigning Miss Jamaica, Marguerite LeWars was originally slated to screen test for Miss Taro. However, Lewars declined for reasons of 'personal modesty' and is merely glimpsed in the film in a bit as an unnamed photographer. Zena herself, was at first unhappy with the script, but Terence Young, who had previously worked with her on the poorly-received costume biopic,The Bad Lord Byron (1949), lightened some of the dialogue with humour. In the end, the bedroom scene with Sean Connery took three days to shoot, because Zena struggled with the idea of having to spit in her co-star's face, after Bond has her character turned over to the superintendent of police. Miss Taro remains one of the most iconic of Bond villainesses. Zena's last roles of note were as an Italian countess in Those Magnificent Men in Their Flying Machines or How I Flew from London to Paris in 25 hours 11 minutes (1965), and as a secretary fighting alien enemies (alongside incongruously cast accountant Charles Hawtrey in the insipid sci-fi outing The Terrornauts (1967). After that, she retired from the screen and settled into domestic life with her third husband, the writer/producer Ivan Foxwell.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNTMzMjMwNl5BMl5BanBnXkFtZTcwMTIzMDMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0551243","name":"Zena Marshall","idIMDB":"nm0551243"},"actorId":"nm0551243","character":"Miss Taro","urlCharacter":"http://www.imdb.com/character/ch0000443","main":true},{"actorName":"John Kitzmiller","urlProfile":"http://www.imdb.com/name/nm0457839","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ZGM4ZjgtYzk1YS00ODBhLWE2YjktNzhkMjdiY2UwMmQxXkEyXkFqcGdeQXVyMTc4MzI2NQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 December 1913","placeOfBirth":" Battle Creek, Michigan, USA","height":"6' 4\" (1.93 m)","bio":"John Kitzmiller was born on December 4, 1913 in Battle Creek, Michigan, USA. He was an actor, known for Dr. No (1962), Variety Lights (1951) and La vallée de la paix (1956). He was married to Dusia Bejic. He died on February 23, 1965 in Rome, Lazio, Italy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ZGM4ZjgtYzk1YS00ODBhLWE2YjktNzhkMjdiY2UwMmQxXkEyXkFqcGdeQXVyMTc4MzI2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0457839","name":"John Kitzmiller","idIMDB":"nm0457839"},"actorId":"nm0457839","character":"Quarrel","urlCharacter":"http://www.imdb.com/character/ch0102115","main":true},{"actorName":"Eunice Gayson","urlProfile":"http://www.imdb.com/name/nm0311013","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MzIxMTA0Ml5BMl5BanBnXkFtZTcwOTY3MzkwOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 March 1931","placeOfBirth":" Purley, Surrey, England, UK","birthName":"Eunice Elizabeth Sargaison","height":"5' 4\" (1.63 m)","bio":"Eunice Gayson was born on March 17, 1931 in Purley, Surrey, England as Eunice Elizabeth Sargaison. She is an actress, known for From Russia with Love (1963), Dr. No (1962) and The Revenge of Frankenstein (1958).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MzIxMTA0Ml5BMl5BanBnXkFtZTcwOTY3MzkwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0311013","name":"Eunice Gayson","idIMDB":"nm0311013"},"actorId":"nm0311013","character":"Sylvia","urlCharacter":"http://www.imdb.com/character/ch0000431","main":true},{"actorName":"Lois Maxwell","urlProfile":"http://www.imdb.com/name/nm0561755","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMTM3MTQyNF5BMl5BanBnXkFtZTYwOTQ4NjU2._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 February 1927","placeOfBirth":" Kitchener, Ontario, Canada","birthName":"Lois Ruth Hooker","height":"5' 8\" (1.73 m)","bio":"Everyone knows (or should know) Lois Maxwell as the one and only \"Miss Moneypenny\", but there's much more to her acting career than that. She started out against her parents' will, and without their knowledge, in a Canadian children's radio program, credited as \"Robin Wells\". Before the age of 15 she left for England with the Canadian army's Entertainment Corps and managed (after her age had been discovered) to get herself enrolled in The Royal Academy of Dramatic Art, where she met and became friends with Roger Moore. Her movie career started with a Michael Powell and Emeric Pressburger production, Stairway to Heaven (1946). After having won The Most Promising Newcomer Golden Globe Award in 1947, she went to Hollywood and made six films before she decided to try her luck in Italy. She ha to leave Italy to go to England when her husband became ill, and since then she has had roles in a number of movies besides the first 14 Bond movies. In 1989 she retired.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMTM3MTQyNF5BMl5BanBnXkFtZTYwOTQ4NjU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0561755","name":"Lois Maxwell","idIMDB":"nm0561755"},"actorId":"nm0561755","character":"Miss Moneypenny","urlCharacter":"http://www.imdb.com/character/ch0000343","main":true},{"actorName":"Peter Burton","urlProfile":"http://www.imdb.com/name/nm0078252","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEyMzYwODE1Ml5BMl5BanBnXkFtZTYwMDY4MzEz._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1921","placeOfBirth":" Bromley, Kent, England, UK","birthName":"Peter Ray Burton","bio":"Peter Burton was born on April 4, 1921 in Bromley, Kent, England as Peter Ray Burton. He is known for his work on A Clockwork Orange (1971), Dr. No (1962) and Sink the Bismarck! (1960). He was married to Lillias Walker. He died on November 27, 1989 in Chelsea, London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEyMzYwODE1Ml5BMl5BanBnXkFtZTYwMDY4MzEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0078252","name":"Peter Burton","idIMDB":"nm0078252"},"actorId":"nm0078252","character":"Major Boothroyd","urlCharacter":"http://www.imdb.com/character/ch0000297","main":true},{"actorName":"Yvonne Shima","urlProfile":"http://www.imdb.com/name/nm0793553","urlPhoto":"","biography":{"height":"5' 2\" (1.57 m)","bio":"Yvonne Shima is an actress, known for Dr. No (1962), The World of Suzie Wong (1960) and Les dents du diable (1960).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0793553","name":"Yvonne Shima","idIMDB":"nm0793553"},"actorId":"nm0793553","character":"Sister Lily","urlCharacter":"http://www.imdb.com/character/ch0000470","main":true},{"actorName":"Michel Mok","urlProfile":"http://www.imdb.com/name/nm0596304","urlPhoto":"","biography":{"bio":"Michel Mok is an actress, known for Dr. No (1962).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0596304","name":"Michel Mok","idIMDB":"nm0596304"},"actorId":"nm0596304","character":"Sister Rose","urlCharacter":"http://www.imdb.com/character/ch0115614","main":true},{"actorName":"Marguerite LeWars","urlProfile":"http://www.imdb.com/name/nm0506759","urlPhoto":"","biography":{"dateOfBirth":"1938","placeOfBirth":" Kingston, Jamaica, British West Indies","bio":"Marguerite LeWars was born in 1938 in Kingston, Jamaica, British West Indies. She is an actress, known for Dr. No (1962) and Inside 'Dr. No' (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0506759","name":"Marguerite LeWars","idIMDB":"nm0506759"},"actorId":"nm0506759","character":"Photographer","urlCharacter":"http://www.imdb.com/character/ch0306488","main":true},{"actorName":"William Foster-Davis","urlProfile":"http://www.imdb.com/name/nm0288126","urlPhoto":"","biography":{"dateOfBirth":"8 May 1904","placeOfBirth":"","bio":"William Foster-Davis was born on May 8, 1904. He was an actor, known for Dr. No (1962). He died on January 5, 1991.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0288126","name":"William Foster-Davis","idIMDB":"nm0288126"},"actorId":"nm0288126","character":"Superintendent","urlCharacter":"http://www.imdb.com/character/ch0219412","main":true}],"seasons":[],"idIMDB":"tt0055928","urlIMDB":"http://www.imdb.com/title/tt0055928","business":{"budget":{"money":"$1,100,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$43,500,000 (Worldwide)","country":"except","day":null,"month":null,"year":null,"remarks":null},{"money":"4,772,574","country":"France","day":"31","month":"12","year":"1963","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1962/\">1962</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 50 min (110 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Color (Technicolor) (as Technicolor ©)"],"aspectRatio":["1.37 : 1 (negative ratio)","1.66 : 1 (intended ratio, Europe)","1.85 : 1 (intended ratio, USA)"],"camera":["Mitchell BNC"],"laboratory":["Technicolor, UK (processed by) (as Technicolor Limited , England)"],"filmLength":null,"negativeFormat":["35 mm (Eastman 50T 5251)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.3","filmingLocations":[{"location":"2171 Magenta Drive, Jamaica"}],"rated":"APPROVED","awards":[{"award":"Golden Globes, USA 1964","titlesAwards":[{"titleAwardOutcome":"Won Golden Globe","categories":[{"category":"Most Promising Newcomer - Female","names":[{"name":"Ursula Andress","id":"nm0000266","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best DVD/Blu-Ray Collection","names":[{"name":"Casino Royale","id":"tt0381061","role":null},{"name":"Goldfinger","id":"tt0058150","role":null},{"name":"Diamonds Are Forever","id":"tt0066995","role":null},{"name":"The Man with the Golden Gun","id":"tt0071807","role":null},{"name":"Die Another Day","id":"tt0246460","role":null},{"name":"The Spy Who Loved Me","id":"tt0076752","role":null},{"name":"From Russia with Love","id":"tt0057076","role":null},{"name":"Thunderball","id":"tt0059800","role":null},{"name":"On Her Majesty's Secret Service","id":"tt0064757","role":null}]}]}]},{"award":"IGN Summer Movie Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated IGN Award","categories":[{"category":"Best Movie Blu-Ray","names":[{"name":"From Russia with Love","id":"tt0057076","role":null},{"name":"Goldfinger","id":"tt0058150","role":null},{"name":"Thunderball","id":"tt0059800","role":null},{"name":"You Only Live Twice","id":"tt0062512","role":null},{"name":"On Her Majesty's Secret Service","id":"tt0064757","role":null},{"name":"Diamonds Are Forever","id":"tt0066995","role":null},{"name":"The Spy Who Loved Me","id":"tt0076752","role":null},{"name":"GoldenEye","id":"tt0113189","role":null},{"name":"Casino Royale","id":"tt0381061","role":null}]}]}]},{"award":"Laurel Awards 1964","titlesAwards":[{"titleAwardOutcome":"2nd place Golden Laurel","categories":[{"category":"Top Action Drama","names":[]}]},{"titleAwardOutcome":"3rd place Golden Laurel","categories":[{"category":"Top Action Performance","names":[{"name":"Sean Connery","id":"nm0000125","role":null}]}]}]}],"votes":"121,170","type":"Movie","companyCreditsSimple":[{"idCompany":"co0054040","name":"Eon Productions"}],"keywords":{"keywords":["official james bond series","murder","british secret service","terrorist plot","hand to hand combat","shootout","burned alive","corpse","person on fire","death of friend","007","cia agent","cia","scientist","jamaica","assassin","rocket","west indies","professor","terrorist","metal hand","fight","woman","two word title","improvised snorkel","exploding car","tough guy","one man army","assassination attempt","shot in the back","shot in the chest","spit in the face","exploding building","terrorism","criminal mastermind","good versus evil","chase","spy","disarming someone","judo throw","fistfight","brawl","gunfight","showdown","kiss","fighting","machine gun","hitman","sex","kissing while having sex","warrior","spy hero","prisoner","patrol boat","silencer","radioactive","explosion","escape","kingston jamaica","panties","knife","blood stain","cyanide","assassination","shot to death","handgun","surveillance","covert","gambling","camel toe","first part","evil man","cult figure","cult film","subterranean fortress","strangulation","rescue","radioactivity","pistol","hearse","geiger counter","fake blindness","espionage","eavesdropping","drugged drink","disguise","cigarette smoking","car goes over a cliff","car chase","airport","baccarat","british intelligence","arch villain","tank","superstition","secret base","nuclear reactor","handcuffs","blockbuster","bikini","first of series","flamethrower","megalomaniac","secret headquarters","chemin de fer","karate","secret organization","short wave radio","judo","suicide pill","famous entrance","caribbean","secret agent","extortion","sniper","casino","womanizer","chinese","mad scientist","air duct","london england","martial arts","based on book","based on novel","island","tarantula","seashell","armed guard","bond girl","1960s","villain","walther ppk","catch phrase","beretta","love interest","semiautomatic pistol","opening action scene","action hero","hero","hairy chest","record player","phonograph record","gambling chip","nylons","calypso","music band","camera","singing","bar","playing cards","airplane","period in title","punctuation in title","bare chested male","river","photographer","phone booth","nightclub","marina","hotel","general","fishing boat","famous line","elevator","country club","convertible","beach","shoe","title spoken by character","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:17:17"}}