{"data":{"movies":[{"title":"Maid to Order","originalTitle":"","year":"1987","releaseDate":"19870731","directors":[{"name":"Amy Holden Jones","id":"nm0427468"}],"writers":[{"name":"Amy Holden Jones","id":"nm0427468"},{"name":"Perry Howze","id":"nm0398286"}],"runtime":"93 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMTAwNzg2OV5BMl5BanBnXkFtZTcwMTM1NjYxMQ@@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Fantasy","Comedy"],"plot":"Spoiled Jessie Montgomery, whose wild behavior and spending excesses cause her well-meaning but exasperated millionaire father Charles to wish he never had her, is visited by fairy godmother Stella. In an effort to save Jessie, Stella casts a spell which causes Charles to no longer have a daughter. Jessie, now penniless and without a friend, must take a maid's job to earn a living, and hopefully to learn her lesson...","simplePlot":"Spoiled Jessie Montgomery, whose wild behavior and spending excesses cause her well-meaning but exasperated millionaire father Charles to wish he never had her, is visited by fairy ... ","actors":[{"actorName":"Ally Sheedy","urlProfile":"http://www.imdb.com/name/nm0000639","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MzY0NTU3OF5BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1962","placeOfBirth":" New York City, New York, USA","birthName":"Alexandra Elizabeth Sheedy","height":"5' 5\" (1.65 m)","bio":"Ally Sheedy was born in New York City, to Charlotte (Baum), a press agent and writer, and John J. Sheedy, Jr., an advertising executive. She is of Russian Jewish (mother) and Irish (father) descent. While at New York's Bank Street School, 12-year-old Ally Sheedy wrote about a mythical encounter between Queen Elizabeth I and an inquisitive mouse. The result, \"She Was Nice to Mice\", was published by McGraw-Hill and became an instant best seller. Although it proved a springboard to an acting career, Sheedy's strongest memories of childhood remain those of \"dancing and doing plays\". From six until fourteen, she danced with the American Ballet Theatre and, during summers at Fire Island, she'd \"get a bunch of kids together and stage shows on back lawns and porches\". When she discovered that to stay with dancing meant staying with starvation diets, she shifted her focus to acting for good. Meanwhile, her book brought her requests from several publications. The Village Voice asked her to review movies and the New York Times wanted her to review children's books. The assignment she accepted was from Ms. Magazine, which requested an article about her mother and herself. It was an appearance on \"The Mike Douglas Show (1961) to promote her book, however, that brought Sheedy work as a performer. Signed by an agent who caught the show, she was sent out on television commercials, immediately. Only 15 at the time, she also performed off-Broadway and on a series of after-school specials. The day she turned 18, Sheedy packed her bags and headed for Los Angeles, where she enrolled in the drama department at USC, and soon landed roles in the television drama The Best Little Girl in the World (1981), The Day the Loving Stopped (1981), Splendor in the Grass (1981) and Homeroom (1981) and played a recurring character on Hill Street Blues (1981). The strength of her performances led directly to her film debut as Sean Penn's naive-but-knowing girlfriend, \"J.C.\", in Bad Boys (1983). That same year (1983), she starred as Matthew Broderick's zany partner in WarGames (1983). After starring as Rob Lowe's would-be romantic interest in Oxford Blues (1984), the withdrawn adolescent of The Breakfast Club (1985) and Gene Hackman's adoring daughter in Twice in a Lifetime (1985), Sheedy played her first fully-adult role in St. Elmo's Fire (1985), the 1985 hit about college friends.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MzY0NTU3OF5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000639","name":"Ally Sheedy","idIMDB":"nm0000639"},"actorId":"nm0000639","character":"Jessie Montgomery","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Beverly D'Angelo","urlProfile":"http://www.imdb.com/name/nm0000350","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNTk4ODU5NV5BMl5BanBnXkFtZTcwODU0OTgwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 November 1951","placeOfBirth":" Columbus, Ohio, USA","birthName":"Beverly Heather D'Angelo","height":"5' 2\" (1.57 m)","bio":"Intriguing, inspiring, and never less than interesting -- key adjectives in describing the career of Beverly D'Angelo, which has well passed the three-decade mark. Perhaps deserving better movies than she generally found herself in, she nevertheless was always an object of fascination and the one to watch...whatever the role. Hardly the shrinking violet type, Hollywood counted on her for her colorful personality, down-to-earth demeanor and scene-stealing capabilities. Beverly Heather D'Angelo was born on November 15, 1951 in Columbus, Ohio, the daughter of musicians Priscilla Ruth (Smith), a violinist, and Eugene \"Gene\" Constantino D'Angelo, a bass player who also managed a TV station. her maternal grandfather, Howard Dwight Smith, was the architect who designed the Ohio (\"Horseshoe\") Stadium at Ohio State University. Her mother had English, Irish, Scottish, and German ancestry, and her father was of Italian descent. Beverly once attended an American school in Florence, Italy. Initially drawn to art, Beverly worked as a animator/cartoonist at Hanna-Barbera Productions before moving to Canada to pursue a rock singing career, To make ends meet she worked as a session vocalist and sang anyplace she could -- from coffeehouses to topless bars. At one point the teenager was invited to join up with rockabilly legend Ronnie Hawkins. Beverly's acting career started up when she left the Hawkins band and joined the Charlottetown Festival repertory company. She was touring Canada as Ophelia in \"Kronborg: 1582\", a rock musical version of Shakespeare's \"Hamlet\" when the renowned Colleen Dewhurst caught a performance and saw promise in both Beverly and the show. Eventually musical director Gower Champion got into the mix and the show was completely revamped, becoming the rock musical \"Rockabye Hamlet\", which made its way to Broadway in 1976. While the show itself was short-lived, Beverly's Ophelia attracted fine notices and she soon found herself on the West coast with film and TV opportunities. After this point, she seldom returned to the stage but did star alongside Ed Harris in the 1995 off-Broadway production of Sam Shepard's \"Simpatico\", which earned her a Theatre World Award. A role in the TV miniseries Captains and the Kings (1976) led to bit parts in The Sentinel (1977) and in the Woody Allen classic Annie Hall (1977). A string of co-starring roles followed with First Love (1977), the Clint Eastwood starrer Every Which Way But Loose (1978) and the film adaptation of the hit counterculture musical Hair (1979). Best of all for Beverly was her powerhouse featured performance as the one-and-only Patsy Cline in the acclaimed biopic Coal Miner's Daughter (1980). Both she and Oscar winner Sissy Spacek (as fellow country singer Loretta Lynn) expertly supplied their own vocals. Playing everything from tough-as-nails prostitutes, party girls and barflies to rich, prim widows and depressed, alcoholic moms, most of Beverly's output was solid during this time. Playing happening kind of gals, she customarily rose above much of the standard comedic or dramatic material given. An interesting gallery of offbeat characters came her way in a number of hit-or-miss features: Paternity (1981), Finders Keepers (1984), Big Trouble (1986), Maid to Order (1987), High Spirits (1988), Cold Front (1989), Daddy's Dyin'... Who's Got the Will? (1990), The Pope Must Diet (1991), Man Trouble (1992), Lightning Jack (1994), The Crazysitter (1994), Merchants of Venus (1998) and Sugar Town (1999). She also sang in a few of these films. Beverly attracted mainstream notice as Chevy Chase's beleaguered wife in the comedy spoof National Lampoon's Vacation (1983) and its three sequels. Stronger roles came with such films as the English/Irish production The Miracle (1991) and the Neo-Nazi film American History X (1998). She was also a favorite of director John Schlesinger who used her in Honky Tonk Freeway (1981) and Eye for an Eye (1996), among others. In the spoof Pterodactyl Woman from Beverly Hills (1997), in which she served as associate producer, Beverly gamely starred as a chic Beverly Hills housewife who turns into a flying prehistoric reptile by night. On TV, Beverly scored well as matricide victim Kitty Menendez in Menendez: A Killing in Beverly Hills (1994) and earned an Emmy-nomination (and arguably gave the best performance) as Stella Kowalski opposite \"Hair\" co-star Treat Williams in the TV remake of A Streetcar Named Desire (1984). Other topnotch TV mini-movies included Sweet Temptation (1996) and Judgment Day: The John List Story (1993), in which she played Robert Blake's devout wife. On primetime she has been cast quite assertively in recurring parts -- lately she has been spotted on Law & Order: Special Victims Unit (1999) as a defense attorney, and on Entourage (2004) as a talent agent. Beverly's off-camera romantic life has been just as interesting. Following her relationship with \"Hair\" director Milos Forman, she married Lorenzo Salviati, an economics student who also was an Italian duke. She left Hollywood and lived with him in Europe, but separated after two years and returned. A six-year relationship with Irish director Neil Jordan was followed by one with Oscar-winning production designer Anton Furst; this ended tragically when, just weeks after their breakup, he committed suicide. A former union with the volatile Al Pacino produced twins Olivia and Anton, who were born in 2001. These days, Beverly's career on camera has remained secondary to the raising of her children. Occasionally she has made use of her vocal talents performing at L.A. nightclubs and with a jazz band that included brother Jeff. From time to time she still lights up the screen as a brash professional or somebody's colorful mom; whatever time she has on screen, whether major or minor, it is always welcomed and never, ever less than...interesting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNTk4ODU5NV5BMl5BanBnXkFtZTcwODU0OTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000350","name":"Beverly D'Angelo","idIMDB":"nm0000350"},"actorId":"nm0000350","character":"Stella Winston","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Ontkean","urlProfile":"http://www.imdb.com/name/nm0648920","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyODI4OTEyNF5BMl5BanBnXkFtZTcwMjc0OTgwMw@@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 January 1946","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"Michael Leonard Ontkean","height":"6' 1\" (1.85 m)","bio":"Michael Ontkean, the Cando-American actor best known for playing the minor league hockey player Ned Braden in the cult classic Slap Shot (1977), was born on January 24, 1946 in Vancouver, British Columbia. His parents Leonard and Muriel (née Cooper) Ontkean were actors. Michael appeared on the Canadian TV series Hudson's Bay (1959), which ran for one season in 1959-60, but did not appear again professionally as an actor until an episode of Ironside (1967) was broadcast in 1970. Like many a Canadian lad, Ontkean grew up playing hockey. He was good enough to earn a hockey scholarship to the University of New Hampshire, a Division I program. He was a standout player at UNH in his three seasons as a varsity player from 1966 to 1969. (Division I hockey teams did not allow freshmen to play on the varsity team in those days.) After graduating from UNH in 1969, he did not pursue a professional hockey career but moved to Los Angeles to become an actor. After taking roles on episodic TV shows and appearing in TV movies from 1970 to 1972, he had his breakthrough with a lead in the TV series The Rookies (1972), which debuted in September 1972. He played policeman Willie Gillis on the series, which was canceled after the 1973-74 season. His \"Rookies\" co-star Kate Jackson would later appear as his wife in the then-controversial 1982 film Making Love (1982), in which Ontkean played a married man who leaves his wife after coming out after an affair with his gay lover. Earlier, Ontkean's skill as a hockey player enabled Ontkean to beat out Peter Straus and other actors for the role as the disaffected Ned Braden in \"Slap Shot\". In the film, he performed all of his on-ice shots himself. Subsequently, he had a major role in Paul Mazursky's Willie & Phil (1980), but neither that movie or \"Making Love\" was a hit. (Peter Straus, who lost the role in \"Slap Shot\" to Ontkean but was the bigger star after the success of the TV mini-series Rich Man, Poor Man (1976), turned down the role of the closeted gay man played by Ontkean in \"Making Love.\") Ontkean's most memorable role since the early '80s was Sheriff Harry S Truman) in 'David Lynch''s cult classic TV series Twin Peaks (1990). He continues to appear in movies and on TV while living in Hawaii with his second wife, Jamie Smith Jackson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyODI4OTEyNF5BMl5BanBnXkFtZTcwMjc0OTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0648920","name":"Michael Ontkean","idIMDB":"nm0648920"},"actorId":"nm0648920","character":"Nick McGuire","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Valerie Perrine","urlProfile":"http://www.imdb.com/name/nm0674781","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNzgyMDEwMl5BMl5BanBnXkFtZTYwMjI2ODgz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 September 1943","placeOfBirth":" Galveston, Texas, USA","birthName":"Valerie Ritchie Perrine","height":"5' 7½\" (1.71 m)","bio":"Valerie Perrine was born on September 3, 1943 in Galveston, Texas, USA as Valerie Ritchie Perrine. She is an actress, known for Superman (1978), What Women Want (2000) and Superman II (1980).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNzgyMDEwMl5BMl5BanBnXkFtZTYwMjI2ODgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0674781","name":"Valerie Perrine","idIMDB":"nm0674781"},"actorId":"nm0674781","character":"Georgette Starkey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dick Shawn","urlProfile":"http://www.imdb.com/name/nm0790071","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4ODg0NzI3NV5BMl5BanBnXkFtZTcwMTQ0OTgwMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 December 1923","placeOfBirth":" Buffalo, New York, USA","birthName":"Richard Schulefand","height":"6' (1.83 m)","bio":"One-of-a-kind nightclub comedian/singer Dick Shawn (ne Richard Schulefand) was as off-the-wall as they came and, as such, proved to be rather an acquired taste. Way ahead of his time most say, it was extremely difficult indeed to know how to properly tap into this man's eclectic talents. Shawn began inching toward the forefront during the be-bop 50s and early 60s with his odd penchant for playing cool cats. During his mild bid for film stardom, he was top-billed as a hip, laid back genie in the thoroughly dismal satire The Wizard of Baghdad (1960), but seemed to have better luck when taken in smaller doses. He fared quite well opposite another \"way-out-there\" comedian, Ernie Kovacs, in Wake Me When It's Over (1960) as a hustling soldier out to make a buck in the Far East. Also on the plus side, he replaced Zero Mostel in the bawdy musical \"A Funny Thing Happened on the Way to the Forum\" on Broadway and stole a small scene in the all-star epic comedy It's a Mad Mad Mad Mad World (1963). By far, the one role that completely overshadows all of his other hard work is his mock portrayal of a singing Adolf Hitler in the show-within-a-movie The Producers (1967). In the film, which starred Mostel and Gene Wilder as two con artists deliberately producing a stage \"bomb\" called \"Springtime for Hitler,\" Shawn sang the hammy, absurdly narcissistic song \"Love Power.\" The movie finally captured Shawn in his element, but this stroke of genius of matching actor to role would never happen again for him. For the most part his roles came off slick and smarmy, and were stuck in mediocre material. Shawn won a huge fan base, however, touring in one-man stage shows which contained a weird mix of songs, sketches, satire, philosophy and even pantomime. A bright, innovative wit, one of his best touring shows was called \"The Second Greatest Entertainer in the World.\" During the show's intermission, Shawn would lie visibly on the stage floor absolutely still during the entire time. By freakish coincidence, Shawn was performing at the University of California at San Diego in 1987 when he suddenly fell forward on the stage during one of his spiels about the Holocaust. The audience, of course, laughed, thinking it was just a part of his odd shtick. In actuality, the 63-year-old married actor with four children had suffered a fatal heart attack. A not surprising end for this thoroughly offbeat and intriguing personality.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4ODg0NzI3NV5BMl5BanBnXkFtZTcwMTQ0OTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0790071","name":"Dick Shawn","idIMDB":"nm0790071"},"actorId":"nm0790071","character":"Stan Starkey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Skerritt","urlProfile":"http://www.imdb.com/name/nm0000643","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzY3Mjk5MTMyMl5BMl5BanBnXkFtZTYwMjUxMTc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1933","placeOfBirth":" Detroit, Michigan, USA","birthName":"Thomas Roy Skerritt","height":"6' (1.83 m)","bio":"Lean, ruggedly handsome leading man and supporting actor whose \"outdoor\" looks have improved with age, Tom Skerritt attended Wayne State University and UCLA, and was first noticed in a UCLA production of \"The Rainmaker\" before making his movie debut in War Hunt (1962). However, he spent most of the next decade in television, regularly appearing in Combat! (1962), The Virginian (1962), Gunsmoke (1955) and 12 O'Clock High (1964). Skerritt's next big break was appearing alongside Donald Sutherland and Elliott Gould in Robert Altman's biting satire MASH (1970). Several other film roles quickly followed, before he landed the plum role of Capt. Dallas of the ill-fated commercial towing vehicle Nostromo in the creepy sci-fi epic Alien (1979). Skerritt turned up again in another thriller playing a cop hunting a serial killer in the eerie The Dead Zone (1983), as a Navy Officer Flight instructor in Top Gun (1986) , in the six-chick flick Steel Magnolias (1989), and then as the poster boy for a \"Guess\" Jeans ad campaign utilizing his mature, weather-beaten features. Skerritt didn't neglect his TV background and reappeared on the small screen in Cheers (1982), The China Lake Murders (1990) and picked up an Emmy in 1994 for his performance as Sheriff Brock in the superb series Picket Fences (1992). Skerritt has remained continually busy for the past decade, contributing natural, entertaining and reliable performances in TV series, made-for-TV movies and major theatrical releases. He recreated the role of Will Kane in the TV production of High Noon (2000), and appeared alongside Bruce Willis in the mercenary war drama Tears of the Sun (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzY3Mjk5MTMyMl5BMl5BanBnXkFtZTYwMjUxMTc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000643","name":"Tom Skerritt","idIMDB":"nm0000643"},"actorId":"nm0000643","character":"Charles Montgomery","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Merry Clayton","urlProfile":"http://www.imdb.com/name/nm0165749","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MjIzNTEwNV5BMl5BanBnXkFtZTcwOTI3MDk0OQ@@._V1_UY44_CR26,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1948","placeOfBirth":" New Orleans, Louisiana, USA","bio":"Gospel singer best known for singing backing vocals on the Rolling Stones classic \"Gimme Shelter\" and for her performance as the Acid Queen on the 1972 recording of The Who's \"Tommy\" with the London Symphony Orchestra.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MjIzNTEwNV5BMl5BanBnXkFtZTcwOTI3MDk0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0165749","name":"Merry Clayton","idIMDB":"nm0165749"},"actorId":"nm0165749","character":"Audrey James","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Begonya Plaza","urlProfile":"http://www.imdb.com/name/nm0687037","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwNzY1MjY5NF5BMl5BanBnXkFtZTgwODYxNDYzOTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 July 1966","placeOfBirth":" Bogota, Colombia","birthName":"Begoña del Pilar Plaza Gill","height":"5' 4\" (1.63 m)","bio":"Daughter, Caterina Armenter, born in Barcelona, 1992.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwNzY1MjY5NF5BMl5BanBnXkFtZTgwODYxNDYzOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0687037","name":"Begonya Plaza","idIMDB":"nm0687037"},"actorId":"nm0687037","character":"Maria","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rain Phoenix","urlProfile":"http://www.imdb.com/name/nm0681095","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0NzU5Nzc3MjheQTJeQWpwZ15BbWU3MDg3MDc0MzQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 November 1972","placeOfBirth":" Crockett, Texas, USA","birthName":"Rain Joan of Arc Phoenix","height":"5' 2¼\" (1.58 m)","bio":"Rain Phoenix is the second child and first daughter born to Arlyn and John Bottom. At a young age, she and her brother River were singing on the streets of South America for money for their growing family. As the years carried on, Rain became a big sister to brother, Joaquin, and sister, Liberty. When Arlyn was pregnant with Rain's youngest sister, Summer, the Bottom family were moving back to America and changed their name to 'Phoenix', to commemorate their new beginning. With a love of nature and animals, the Phoenixes decided to become vegans. A short while later, all five talented Phoenix children were signed to agent Iris Burton. Over the years, Rain has starred along celebrities like Julia Stiles, Josh Hartnett and Uma Thurman. Her love of music has lead her to appear in such bands as Aleka's Attic, whom her brother River was also in, The Causey Way with her sister Summer and her current band, The Paper Cranes with her husband, Michael Tubbs. She also toured with the Red Hot Chilli Peppers as a backup singer during their 'One Hot Minute' tour in 1996. A good friend of Michael Stipe, they have collaborated together on many projects (including the soundtrack to Happiness, and several REM songs). Rain is currently happily married to her husband Michael. They and the rest of The Paper Cranes are working on their first full-length album, due to be released in September.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0NzU5Nzc3MjheQTJeQWpwZ15BbWU3MDg3MDc0MzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0681095","name":"Rain Phoenix","idIMDB":"nm0681095"},"actorId":"nm0681095","character":"Brie Starkey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leland Crooke","urlProfile":"http://www.imdb.com/name/nm0188882","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NTIxNzEyNV5BMl5BanBnXkFtZTcwMzM4NDMzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Leland Crooke is an actor, known for Maid to Order (1987), F/X2 (1991) and Shattered Illusions (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NTIxNzEyNV5BMl5BanBnXkFtZTcwMzM4NDMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0188882","name":"Leland Crooke","idIMDB":"nm0188882"},"actorId":"nm0188882","character":"Dude","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Teddy Wilson","urlProfile":"http://www.imdb.com/name/nm0934209","urlPhoto":"","biography":{"dateOfBirth":"10 December 1943","placeOfBirth":" New York City, New York, USA","birthName":"Theodore Rosevelt Wilson","bio":"Teddy Wilson was born on December 10, 1943 in New York City, New York, USA as Theodore Rosevelt Wilson. He was an actor and writer, known for That's My Mama (1974), Blood In, Blood Out (1993) and Life Stinks (1991). He was married to Joan Pringle. He died on July 21, 1991 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0934209","name":"Teddy Wilson","idIMDB":"nm0934209"},"actorId":"nm0934209","character":"Woodrow","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Perla Walter","urlProfile":"http://www.imdb.com/name/nm0910112","urlPhoto":"","biography":{"dateOfBirth":"24 January 1933","placeOfBirth":" Florida, USA","bio":"Perla Walter was born on January 24, 1933 in Florida, USA. She was an actress, known for Perfect (1985), Friday the 13th Part III (1982) and The Man with Two Brains (1983). She died on May 19, 2007 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0910112","name":"Perla Walter","idIMDB":"nm0910112"},"actorId":"nm0910112","character":"Trini","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rita Gomez","urlProfile":"http://www.imdb.com/name/nm2114655","urlPhoto":"","biography":{"bio":"Rita Gomez is an actress, known for Traffic (2000), Delirious (1991) and California Suite (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2114655","name":"Rita Gomez","idIMDB":"nm2114655"},"actorId":"nm2114655","character":"Juanita","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Beghe","urlProfile":"http://www.imdb.com/name/nm0000892","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1Mjc2MDQxN15BMl5BanBnXkFtZTcwMzAyMDgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 March 1960","placeOfBirth":" New York City, New York, USA","birthName":"Jason Deneen Beghe","height":"5' 10¾\" (1.8 m)","bio":"Jason Beghe was born on March 12, 1960 in New York City, New York, USA as Jason Deneen Beghe. He is an actor, known for Chicago P.D. (2014), The Next Three Days (2010) and Thelma & Louise (1991). He has been married to Angie Janu since 2000. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1Mjc2MDQxN15BMl5BanBnXkFtZTcwMzAyMDgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000892","name":"Jason Beghe","idIMDB":"nm0000892"},"actorId":"nm0000892","character":"Bret","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kimberly Beck","urlProfile":"http://www.imdb.com/name/nm0065206","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzg4MzE5MV5BMl5BanBnXkFtZTcwMDIxODUxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 January 1956","placeOfBirth":" Glendale, California, USA","bio":"Kimberly Beck was born on January 9, 1956 in Glendale, California, USA. She is known for her work on General Hospital (1963), Independence Day (1996) and Friday the 13th: The Final Chapter (1984). She has been married to Jason Clark since December 28, 1988. They have two children. She was previously married to William Barron Hilton.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzg4MzE5MV5BMl5BanBnXkFtZTcwMDIxODUxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0065206","name":"Kimberly Beck","idIMDB":"nm0065206"},"actorId":"nm0065206","character":"Kim","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0093476","urlIMDB":"http://www.imdb.com/title/tt0093476","business":{"budget":{"money":"$3,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1986/\">1986</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 33 min (93 min)"],"soundMix":["Ultra Stereo"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["DeLuxe, Hollywood (CA), USA (color)","FotoKem Laboratory, Burbank (CA), USA (dailies)"],"filmLength":["2,557 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.5","filmingLocations":[{"location":"32596 Pacific Coast Hwy, Malibu, California, USA"}],"rated":"PG","awards":[],"votes":"2,717","type":"Movie","companyCreditsSimple":[{"idCompany":"co0007957","name":"Vista Organization"}],"keywords":{"keywords":["maid","fairy godmother","couple","wish","weird couple","party","f rated","gas mask","animated credits","three word title","1980s","vegetarian","master servant relationship","satire","limousine","spoiled brat","singing","servant","redemption","nonperson","alternate reality","role reversal","yuppie","wealth","self discovery","identity","humility","home improvement","fish out of water","employment","coming of age","class differences","riches to rags","talent agent","swimming pool","songwriter","skinny dipping","singer","dumpster diving","cleaning","cinderella story","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 07:49:58"}}