{"data":{"movies":[{"title":"Olympia Part One: Festival of the Nations","originalTitle":"Olympia 1. Teil - Fest der Völker","year":"1938","releaseDate":"19400308","directors":[{"name":"Leni Riefenstahl","id":"nm0726166"}],"writers":[{"name":"Leni Riefenstahl","id":"nm0726166"}],"runtime":"111 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMzM4NDk5MF5BMl5BanBnXkFtZTgwNjUzOTA2MjE@._V1.jpg","countries":["Germany"],"languages":["German","English","Italian","French","Japanese","Portuguese"],"genres":["Documentary","Sport"],"plot":"After being commissioned by the 1936 Olympic Committee to create a feature film of the Berlin Olympics, Riefenstahl shot a documentary that celebrates the human body by combining the poetry of bodies in motion with close-ups of athletes in the heat of competition. Includes the marathon, men's diving, and American track star Jesse Owen's sprint races at the 1936 Olympic games. The production tends to glorify the young male body and, some say, expresses the Nazi attitude toward athletic prowess. Includes the lighting of the torch at the stadium and Adolf Hitler looking on in amazement as Jesse Owens wins an unprecedented four Gold Medals.","simplePlot":"The document of the 1936 Olympics at Berlin.","actors":[{"actorName":"David Albritton","urlProfile":"http://www.imdb.com/name/nm0017049","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NDU3MDQ0OV5BMl5BanBnXkFtZTgwMzU3Nzg2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 April 1913","placeOfBirth":" Danville, Alabama, USA","birthName":"David Donald Albritton","height":"6' 3\" (1.91 m)","bio":"David Donald Albritton was born on April 13, 1913 in Danville, Alabama. He was the son of sharecroppers Peter and Josephine Albritton. One of the first high jumpers to use the straddle technique, Albritton attended as well as was a stand-out member of the track team at East Coast Technical High School in Cleveland, Ohio. Following graduation from high school in 1934, David went on to attend Ohio State University, where he was a member of the Alpha Fi Alpha fraternity and received expert training from noted track and field coach Larry Snyder. Albritton won the National Collegiate Athletic Association championship during his sophomore year at Ohio State in 1936 (he graduated from Ohio State two years later). That same year David and fellow athlete Cornelius Johnson both jumped a new world record height of 6'9 3/4 feet at the Olympic Trials. Albritton subsequently won a silver medal in the high jump event at the 1936 Olympics in Berlin, Germany. Moreover, David not only either won or tied for seven National Athletic Amateur Union outdoor titles from 1936 to 1950, but also was the AAU champion for the years 1937, 1946, and 1947 and tied for three national collegiate titles in 1938, 1945, and 1950. In addition, Albritton worked as an industrial arts teacher and track and field coach at Dunbar High School in Dayton, Ohio, where as a coach he led the school to three state track titles. In 1960 David ran for the Ohio House of Representatives; he wound up serving six terms on the General Assembly and made history in 1969 by becoming the first black man to chair a House committee. (He also served as a trustee of Wright State University.) Albritton was inducted into the National Track and Field Hall of Fame in 1980 and the Ohio State Athletic Hall of Fame in 1978. David died at age 81 on May 14, 1994.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NDU3MDQ0OV5BMl5BanBnXkFtZTgwMzU3Nzg2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0017049","name":"David Albritton","idIMDB":"nm0017049"},"actorId":"nm0017049","character":"Himself - High Jump, USA","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arvo Askola","urlProfile":"http://www.imdb.com/name/nm3935741","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMzA1NzI5NV5BMl5BanBnXkFtZTgwMzc2Nzg2MjE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 December 1909","placeOfBirth":" Valkeala, Finland","bio":"Champion long distance runner Arvo Askola was born on December 2, 1909 in Valkeala, Finland. Arvo finished second in the men's 10,000 meter running event at the 1934 European Championships. Askola went on to win a silver medal in that same exact event at the 1936 Olympic games in Berlin, Germany. Arvo died at age 65 on November 23, 1975 in Kuusankoski, Finland.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMzA1NzI5NV5BMl5BanBnXkFtZTgwMzc2Nzg2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3935741","name":"Arvo Askola","idIMDB":"nm3935741"},"actorId":"nm3935741","character":"Himself - 10000 Metres, FIN","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Beresford","urlProfile":"http://www.imdb.com/name/nm0073596","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MDM4ODk0OV5BMl5BanBnXkFtZTgwNzI4Nzg2MjE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1899","placeOfBirth":" London, England, UK","birthName":"Jack Beresford Wiszniewski","bio":"Jack Beresford was born on January 1, 1899 in London, England as Jack Beresford Wiszniewski. He died on September 3, 1977 in Shiplake, Oxfordshire, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MDM4ODk0OV5BMl5BanBnXkFtZTgwNzI4Nzg2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0073596","name":"Jack Beresford","idIMDB":"nm0073596"},"actorId":"nm0073596","character":"Himself - Carries British Flag","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Erwin Blask","urlProfile":"http://www.imdb.com/name/nm3858448","urlPhoto":"","biography":{"dateOfBirth":"20 March 1910","placeOfBirth":" East Prussia, Germany","bio":"Erwin Blask was born on March 20, 1910 in East Prussia, Germany. The tenth child of an Imperial Guard soldier, Erwin was an avid football, handball, and table tennis player in his youth. Blask won a silver medal in the men's hammer throw at the 1936 Olympic games in Berlin, Germany. Erwin went on to win a second silver medal in the same event at the 1938 European Championships as well as won several national titles which include the stone throw in 1933 and 1934 and the hammer throw in 1935, 1939-1940, and 1950-1951. Moreover, Blask not only won the national police title in the javelin throw in 1929, but also set two world records in both the stone throw in 1933 and the hammer throw in 1938. Outside of his impressive athletic achievements, Erwin was also a sergeant in the Wehrbezirks-Kommando Berlinin, served as director of the German Police Sports Board in the Technical Committee for Police Pentathlon from 1949-1959 and Athletics from 1959-1970, and headed the third Frankfurt Police Station from 1960 to 1970. He was married to sprinter Dora Voigt. Blask died at age 88 on February 6, 1999 in Frankfurt am Main, Hessen, Germany.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3858448","name":"Erwin Blask","idIMDB":"nm3858448"},"actorId":"nm3858448","character":"Himself - Hammer Throw, German","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sulo Bärlund","urlProfile":"http://www.imdb.com/name/nm3858968","urlPhoto":"","biography":{"dateOfBirth":"15 April 1910","placeOfBirth":" Kangasala, Finland","height":"6' 1\" (1.85 m)","bio":"Shot puter Sulo Richard Barlund was born on April 15, 1910 in Kangasala, Finland. Sulo won a silver medal in the men's shot put at the 1936 Olympic games in Berlin, Germany. Barlund went on to finish fourth in the same event at the 1938 European Championships and placed sixth in the 1946 European Championships. Sulo died at age 75 on April 13, 1986 in Kangasala, Finland.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3858968","name":"Sulo Bärlund","idIMDB":"nm3858968"},"actorId":"nm3858968","character":"Himself - Shot Put, Finland","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ibolya Csák","urlProfile":"http://www.imdb.com/name/nm3860984","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4ODg0NTkwNV5BMl5BanBnXkFtZTgwMjU3Nzg2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 January 1915","placeOfBirth":" Budapest, Hungary","bio":"Ibolya Csak was born on January 6, 1915 in Budapest, Hungary. Ibolya won the gold medal in the women's high jump at the 1936 Olympic games in Berlin, Germany and was one of several Jewish athletes to win medals at the 1936 Olympics. Csak went on to win another gold medal in the same event at the 1938 European Championships after the original winner Dora Ratjen from Germany turned out to be a man. Moreover, Ibolya not only was a competitor of the National Gymnastics Club from 1929 to 1939, but also was a gymnast from 1929 to 1932 and an athlete from 1933 to 1939 as well as won nine Hungarian titles altogether which include two in the long jump. Csak was the mother of two children, Ibolya and Attila. In addition, Ibolya worked in the central office of the Hungarian Banknote Printing Co. from 1936 to 1970. Csak received the International Fair Play Life Achievement Award in 2005. Ibolya died at age 91 in her native Budapest from complications following a fall on February 9, 2006.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4ODg0NTkwNV5BMl5BanBnXkFtZTgwMjU3Nzg2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3860984","name":"Ibolya Csák","idIMDB":"nm3860984"},"actorId":"nm3860984","character":"Herself - High Jump, Hungary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Glenn Cunningham","urlProfile":"http://www.imdb.com/name/nm1807380","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTA1ODI1MV5BMl5BanBnXkFtZTgwMzk3Nzg2MjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 August 1909","placeOfBirth":" Atlanta, Kansas, USA","birthName":"Glenn Vernice Cunningham","bio":"Glenn Cunningham was born on August 4, 1909 in Atlanta, Kansas, USA as Glenn Vernice Cunningham. He died on March 10, 1988 in Menifee, Arkansas, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTA1ODI1MV5BMl5BanBnXkFtZTgwMzk3Nzg2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1807380","name":"Glenn Cunningham","nicknames":["The Kansas Ironman","The Iron Man of Kansas"],"idIMDB":"nm1807380"},"actorId":"nm1807380","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Henri de Baillet-Latour","urlProfile":"http://www.imdb.com/name/nm0207214","urlPhoto":"","biography":{"dateOfBirth":"1 March 1876","placeOfBirth":" Brussels, Belgium","bio":"Henri de Baillet-Latour was born on March 1, 1876 in Brussels, Belgium. He died on January 6, 1942 in Brussels.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0207214","name":"Henri de Baillet-Latour","idIMDB":"nm0207214"},"actorId":"nm0207214","character":"Himself - IOC, Stands with Hitler, with Hurdlers","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Philip Edwards","urlProfile":"http://www.imdb.com/name/nm0250281","urlPhoto":"","biography":{"dateOfBirth":"23 September 1907","placeOfBirth":" Georgetown, British Guiana [now Guyana]","birthName":"Philip Aron Edwards","height":"5' 9\" (1.75 m)","bio":"Philip Edwards was born on September 23, 1907 in Georgetown, British Guiana as Philip Aron Edwards. He died on September 6, 1971 in Montreal, Quebec, Canada.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0250281","name":"Philip Edwards","nicknames":["Man of Bronze"],"idIMDB":"nm0250281"},"actorId":"nm0250281","character":"Himself - 800 Metres, Canada","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Donald Finlay","urlProfile":"http://www.imdb.com/name/nm0277973","urlPhoto":"","biography":{"dateOfBirth":"27 May 1909","placeOfBirth":"","bio":"Donald Finlay was born on May 27, 1909. He died on April 18, 1970.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0277973","name":"Donald Finlay","idIMDB":"nm0277973"},"actorId":"nm0277973","character":"Himself - 110m Hurdles, GB","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tilly Fleischer","urlProfile":"http://www.imdb.com/name/nm3720440","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MzMyNzI5Nl5BMl5BanBnXkFtZTgwNzc4Nzg2MjE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 October 1911","placeOfBirth":" Frankfurt am Main, Hessen, Germany","birthName":"Ottilie Fleischer","height":"5' 6\" (1.68 m)","bio":"Ottilie \"Tilly\" Fleischer was born on October 2, 1911 in Frankfurt am Mein, Hessen, Germany. Her father was a butcher. Tilly initially became interested in sports as a child and trained as a teenager in a variety of athletic activities that include shot put, pentathlon, and the discus and javelin throw. Fleischer won the bronze medal in the women's javelin throw and finished fourth in the women's discus throw at the 1932 Olympics in Los Angeles, California. Tilly subsequently went on to win the gold medal in the women's javelin throw at the 1936 Olympics in Berlin, Germany and holds the distinction of being the first German woman to win a gold medal at an Olympics event. After retiring from athletic competitions Fleischer took up playing handball and was a member of the Eintracht Frankfurt handball club that won the German championship in 1943. Tilly was married twice and had two daughters from her first marriage. Fleischer opened a leather goods shop in Lahr, Germany in 1948. Tilly died at age 93 on July 14, 2005.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MzMyNzI5Nl5BMl5BanBnXkFtZTgwNzc4Nzg2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3720440","name":"Tilly Fleischer","nicknames":["Tilly"],"idIMDB":"nm3720440"},"actorId":"nm3720440","character":"Herself - Javelin Throw, Germany","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wilhelm Frick","urlProfile":"http://www.imdb.com/name/nm0294804","urlPhoto":"","biography":{"dateOfBirth":"12 March 1877","placeOfBirth":" Alsenz, Rockenhausen, Palatinate, Germany","height":"5' 10\" (1.78 m)","bio":"Wilhelm Frick was born on March 12, 1877 in Alsenz, Rockenhausen, Palatinate, Germany. He died on October 16, 1946 in Nuremberg, Germany.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0294804","name":"Wilhelm Frick","idIMDB":"nm0294804"},"actorId":"nm0294804","character":"Himself - Spectator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joseph Goebbels","urlProfile":"http://www.imdb.com/name/nm0324305","urlPhoto":"","biography":{"dateOfBirth":"29 October 1897","placeOfBirth":" Rheydt [now Mönchengladbach], Germany","birthName":"Joseph Paul Goebbels","height":"5' 5\" (1.65 m)","bio":"Josef Goebbels, the man who almost single-handedly developed the field of propaganda into an art form, would, for a day, be the leader of World War II Germany. Goebbels was born in the German Rhineland to strict Catholic parents. He was short, standing at just under 5' 6\", of small stature and skinny, and had a sharp, prominent nose and an oily, sallow complexion. He was rejected by the German army in World War I on the basis of being a cripple, specifically, he had a club foot for which he wore a brace, contracted after a bout of osteomyelitis. After Germany was defeated, Goebbels joined the National Socialist Workers Party, more infamously known as the Nazi party, which opposed the democratic Weimar Republic that had been set up to govern Germany. Because of his impressive oratorical skills and uncanny ability to slant arguments to his view, Goebbels was considered an ideal leader in the Nazi party. It was there that he met Hitler in 1925. Though they both shared a hatred of Jews, Goebbels, a dedicated socialist, initially tried to expel the relatively capitalistic Hitler, who he saw as simply an opportunist. He would change his tune, however, when Hitler rose in rank to become Nazi leader. Hitler rewarded Goebbels with a post as Nazi district leader of Berlin, where he would wage year-round political campaigns that eventually drained the organization of virtually all of its funds. He met and married divorcée Magda Quandt around this time. Though their membership grew, the Nazis didn't manage to attract a sizable enough number of voters - especially in Berlin - to attain any kind of legitimate political power, due to both the rebounding German economy and a distrust of the gang of street thugs within the Nazi party called the Sturm Abteilung (SA). However, after the US stock market crashed in 1929, the European economies took a tremendous hit, and the resulting worldwide economic depression hit Germany especially hard. The dire economic straits of many Germans were tailor-made for a demagogue like Hitler, and, slowly, he began to take power; first as Chancellor in 1933, then as Führer in 1934. Goebbels was named minister of entertainment and propaganda, a position that gave him have sole discretion as to what books, magazines, films, radios, newspapers, etc., could print, say, or show. Knowing the media power where the influencing of people was concerned, he searched for a director to place as the head of UFA, Germany's leading film studio. In a famous meeting, he offered the position to respected German director Fritz Lang, who tried to excuse himself by saying that he had Jewish grandparents, to which Goebbels curtly replied, \"We will decide who is Jewish!\" Lang promptly fled the country and Goebbels settled on a rising female director, Leni Riefenstahl, as the \"official\" Nazi filmmaker. She directed two documentaries on the party's Nuremburg rallies of 1932 and 1933. The first was disowned by Riefenstahl because of the little time she had to prepare and the fact that it was never shown publicly because the film featured Ernst Röhm, leader of the SA, who along with many SA leaders, was murdered by the Nazi high command when they moved against the SA, just after the film was completed. Their second attempt, on which Goebbels assisted Riefenstahl extensively, is perhaps the most famous propaganda film ever made: Triumph of the Will (1935). It took almost a year to prepare from the miles upon miles of footage shot. It was a success worldwide, but was not particularly popular in Germany at the time. Goebbels then commissioned Riefenstahl to shoot the 1936 Berlin Olympics, which the Nazi leadership assumed would be dominated by German athletes. The Germans did win the total medal counts, but African-American sprinter Jesse Owens shattered the myth of Aryan dominance by winning gold medals in four different events - more than any other competitor - and was idolized by the German crowds. After World War II broke out, Goebbels was responsible for creating a massive propaganda body of work by the German government, much of which still remains recorded. He was known to use almost anything for propaganda purposes, such as posters from French and German movies with Jewish stars as examples of the \"typical Jew.\" Even when Germany was crumbling in 1945 and the Allies demanded unconditional surrender, Goebbels used that as a motivational tool to demonstrate that every German needed to fight or face destruction. As Allied forces began to advance toward Germany, a paranoid and rapidly deteriorating Hitler had many of his assistants executed or imprisoned, but Goebbels was given the title of \"Defender of Berlin.\" Hitler committed suicide by gunshot on April 30, leaving Goebbels as the next in command to take over the faltering government, which, by then, controlled only a small part of Berlin. As both Soviet forces on one side and American and British forces on the other closed in on the capital, Goebbels was well aware of the fate he would meet if he were captured alive. On May 1, 1945, he reluctantly endorsed the plan his wife had conjured, which she had communicated to Albert Speer, and permitted her to drug their six children with morphine and proceed to poison them to death through the administration of a cyanide capsule. Later that day, after requesting a moment of privacy with his wife from the onlooking SS soldiers, he shot her in head, as they had also planned, and then took his own life within seconds. Soviet troops, who Goebbels had always boasted would never get to Berlin, found him and his wife partially burnt and unburied outside the Fuhrerbunker. He was survived only by a stepson from Magda's first marriage.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0324305","name":"Joseph Goebbels","nicknames":["The Malicious Dwarf","The Nazi Megaphone","Bumsbeen","Nachgedunkelter Schrumpfgermane"],"idIMDB":"nm0324305"},"actorId":"nm0324305","character":"Himself - Spectator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hermann Göring","urlProfile":"http://www.imdb.com/name/nm0351425","urlPhoto":"","biography":{"dateOfBirth":"12 January 1893","placeOfBirth":" Rosenheim, Bavaria, Germany","birthName":"Hermann Wilhelm Göring","height":"5' 10\" (1.78 m)","bio":"Hermann Göring was born on January 12, 1893, in Rosenheim, Bavaria, the son of a prominent judge. He entered the German Royal Military Academy at Gross Lichterfeide outside Berlin in his teens and graduated in 1911. At the beginning of World War I he saw service as an infantry lieutenant but soon transfered to the air corps. During the war he racked up 22 aerial kills, earning the coveted Blue Max and a promotion to commanding officer of Manfred von Richthofen's \"Flying Circus\" in 1918 after that famous ace was killed in action. In the years following World War I Göring became one of Adolf Hitler's most devoted followers. The former war hero was named head of Hitler's private army, the Brownshirts, a Nazi paramilitary organization similar to the Blackshirt fascist group in Italy commanded by Benito Mussolini, in 1922. Göring took part in the unsuccessful \"Beer Hall Putsch\" attempt to overthrow the Bavarian state government in 1923, was wounded and spent some time in prison. In 1933, after Hitler was appointed Chancellor of Germany, Göring became commissioner for aviation and in 1935 commander in chief of the newly established German Air Force (the Luftwaffe). By the opening days of World War II, Göring had built the Luftwaffe into the largest air force in the world. His planes performed superbly in the \"blitzkrieg\" campaigns against Poland, the Low Countries, Norway and France. In recognition of his work, Göring was promoted to Reichsmarschall (a rank above field marshal) on June 19, 1940. The tall, heavyset Göring became well known for his garish, colorful uniforms and his devotion to the war aims of the Nazi party, rivaled only by Hitler's. Göring didn't confine his efforts on behalf of the Nazi party to purely military matters, however; he also developed much of Nazi Germany's anti-Jewish legislation. Unfortunately for Göring, his hour of military triumph was short-lived. He seriously botched the Battle of Britain in August and September of 1940 by overestimating the Luftwaffe's capability for long-range combat and underestimating the resolve of Britain's Royal Air Force, which resulted in the loss of huge numbers of his aircraft in daily air raids against England, not to mention the death or capture of thousands of his most experienced bomber crews. During the invasion of the Soviet Union in June of 1941, the Luftwaffe first held the upper hand against the undertrained and underequipped Soviet Air Force. However, it wasn't long before the tide turned, and before long the Russians were turning out thousands of fighters and bombers and inflicting serious damage on the Luftwaffe, which could ill afford such losses. Starting in 1943 Allied bombers had turned the tide of the air war against Germany, and Göring's vaunted Luftwaffe began losing increasing numbers of planes, not to mention experienced pilots, to the US and British air forces, and Allied bombing campaigns smashed many more German aircraft on the ground in addition to destroying many aircraft factories. In April 1945, with the defeat of Germany a certainty, Göring suggested to Hitler that he make peace with the Allies before they brought total destruction to Germany. Enraged, Hitler ordered his arrest. Göring managed to escape from Nazi custody but was captured on May 2, 1945, by soldiers of the U.S. 7th Army. He was eventually tried, convicted and sentenced to death for crimes against humanity during the war crimes trials at Nuremberg late in 1945. His lawyers fought for time with appeals and requests to overturn his death sentence, but they were all denied. On October 15, 1946, just two hours before the former Reichsmarshall was to face the hangman to pay for his crimes, the 53-year-old Hermann Göring committed suicide in his jail cell by taking poison that he somehow had smuggled in with him.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0351425","name":"Hermann Göring","nicknames":["Der Dicke"],"idIMDB":"nm0351425"},"actorId":"nm0351425","character":"Himself - Spectator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ernest Harper","urlProfile":"http://www.imdb.com/name/nm0363856","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMjI2MzE3NF5BMl5BanBnXkFtZTgwMTc2Nzg2MjE@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 August 1902","placeOfBirth":" Sheffield, Yorkshire, England, UK","height":"5' 6\" (1.68 m)","bio":"Champion long distance runner Ernest \"Ernie\" Harper was born on August 2, 1902 in Chesterfield, Derbyshire, England. Harper finished fifth in the 1,000 meter race and fourth in the individual cross country event at the 1924 Olympics. Ernest subsequently finished 22nd in the 1928 Olympic marathon and went on to win a silver medal for England by placing second in the men's marathon at the 1936 Olympic games in Berlin, Germany. Moreover, Harper not only was the Northern Counties champion for the years 1923, 1925-1926, and 1928-1930, but also finished second in the six miles event at the 1930 British Empire Games, won the Amateur Athletics Association ten miles title in 1923, 1926-1927, and 1929, and represented England in the International Cross Country Championships for nine successive years from 1923 to 1931 (Harper won the English title in both 1927 and 1929 as well as won the individual competition in 1926). In addition, Ernest ran for the Hallamshire Harriers athletic club in Sheffield, South Yorkshire, England. Harper eventually turned pro in 1939. Ernest died at age 77 on October 9, 1979 in Tullamarine, Melbourne, Victoria, Australia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMjI2MzE3NF5BMl5BanBnXkFtZTgwMTc2Nzg2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0363856","name":"Ernest Harper","nicknames":["Ernie"],"idIMDB":"nm0363856"},"actorId":"nm0363856","character":"Himself - Marathon, GB","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0030522","urlIMDB":"http://www.imdb.com/title/tt0030522","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 1 min (121 min) (Sweden)","1 hr 51 min (111 min) (USA)","1 hr 6 min (66 min) (UK)"],"soundMix":["Mono (Tobis-Klangfilm)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":["Debrie Le Parvo"],"laboratory":null,"filmLength":["3,269 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"8.0","filmingLocations":[{"location":"Acropolis, Athens, Greece"}],"awards":[{"award":"Kinema Junpo Awards 1941","titlesAwards":[{"titleAwardOutcome":"Won Kinema Junpo Award","categories":[{"category":"Best Foreign Language Film","names":[{"name":"Leni Riefenstahl","id":"nm0726166","role":null}]}]}]},{"award":"Venice Film Festival 1938","titlesAwards":[{"titleAwardOutcome":"Won Mussolini Cup","categories":[{"category":"Best Foreign Film","names":[{"name":"Leni Riefenstahl","id":"nm0726166","role":null},{"name":"Olympia 2. Teil - Fest der Schönheit","id":"tt0030523","role":null}]}]}]}],"votes":"3,220","type":"Movie","companyCreditsSimple":[{"idCompany":"co0013490","name":"Olympia Film GmbH"},{"idCompany":"co0098497","name":"International Olympic Committee"},{"idCompany":"co0041119","name":"Tobis Filmkunst"}],"keywords":{"keywords":["olympics","berlin olympics","nazi germany","sportsman","propaganda","olympic athlete","jesse owens","olympic games","hitler","stadium","marathon","f rated","title directed by female","slow motion","triple jump","track and field","shot put","relay race","pole vault","opening ceremony","medal ceremony","long jump","javelin toss","hurdles","hammer throw","gymnastics","classical art","bell ringing","athleticism","acropolis","voice over narration","statue","spear","signal","ruins","multinational","laurel wreath","high jump","sportswoman","year 1936","flag","exhaustion","american abroad","discus","cheering","nude dance","male physique","olympic medal","olympic flame","berlin germany","1930s","nudity","female nudity","bisexual interest"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:31:45"}}