{"data":{"movies":[{"title":"Crossed Swords","originalTitle":"The Prince and the Pauper","year":"1977","releaseDate":"19780317","directors":[{"name":"Richard Fleischer","id":"nm0281507"}],"writers":[{"name":"Berta Domínguez D.","id":"nm0231716"},{"name":"Pierre Spengler","id":"nm0818201"}],"runtime":"113 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNTU4NDE3N15BMl5BanBnXkFtZTcwNzYzNDMyMQ@@._V1.jpg","countries":["UK","USA"],"languages":["English"],"genres":["Adventure","Comedy","Drama","Family"],"plot":"Tom Canty is a poor English boy who bears a remarkable resemblance to Edward, Prince of Wales and son of King Henry VIII. The two boys meet and decide to play a joke on the court by dressing in each other's clothes, but the plan goes awry when they are separated and each must live the other's life.","simplePlot":"A poor boy and the Prince of Wales exchange identities, but events force the pair to experience each other's lives as well.","actors":[{"actorName":"Oliver Reed","urlProfile":"http://www.imdb.com/name/nm0001657","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NDg5MDg1MF5BMl5BanBnXkFtZTcwNzEwODkyOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1938","placeOfBirth":" Wimbledon, London, England, UK","birthName":"Robert Oliver Reed","height":"5' 11\" (1.8 m)","bio":"Oliver Reed was born on February 13, 1938 in Wimbledon, London, England as Robert Oliver Reed. He was an actor, known for Gladiator (2000), Oliver! (1968) and Tommy (1975). He was married to Josephine Burge and Kate Byrne. He died on May 2, 1999 in Valletta, Malta.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NDg5MDg1MF5BMl5BanBnXkFtZTcwNzEwODkyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001657","name":"Oliver Reed","nicknames":["Mr England","Ollie"],"idIMDB":"nm0001657"},"actorId":"nm0001657","character":"Miles Hendon","urlCharacter":"http://www.imdb.com/character/ch0030944","main":true},{"actorName":"Raquel Welch","urlProfile":"http://www.imdb.com/name/nm0000079","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjYyMTEyNV5BMl5BanBnXkFtZTgwMjcxMjMyMTE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 September 1940","placeOfBirth":" Chicago, Illinois, USA","birthName":"Jo Raquel Tejada","height":"5' 6\" (1.68 m)","bio":"A new reigning 1960s international sex symbol took to the cinematic throne as soon as Raquel Welch emerged from the sea in her purposely depleted, furry prehistoric bikini. Tantalizingly wet with her garb clinging to all the right amazonian places, One Million Years B.C. (1966), if nothing else, captured the hearts and libidos of modern men (not to mention their teenage sons) while producing THE most definitive and best-selling pin-up poster of that time. After a major dry spell following the death of Marilyn Monroe in 1962, the auburn-maned Ms. Welch effortlessly assumed Marilyn's place and forever wiped away the notion that enduring sex goddesses came only in one form -- bottled blonds. She was born Jo Raquel Tejada on September 5, 1940 in Chicago, Illinois, the first of three children born to Bolivian Armando Carlos Tejada Urquizo, an aerospace engineer, and his Irish-American wife Josephine Sarah Hall, who was the daughter of American architect Emery Stanford Hall (1869-1939) and his wife Clara Louise Adams. The family moved to San Diego, California (her father was transferred) when Raquel was only two. Taking dance lessons as a youngster, she grew up to be quite a knockout and nailed a number of teen beauty titles (\"Miss Photogenic,\" \"Miss La Jolla,\" \"Miss Contour,\" \"Miss Fairest of the Fair\" and \"Miss San Diego\"). With her sights set on theater arts, she studied at San Diego State College on a scholarship starting in 1958 and married her first husband, high school sweetheart James Welch, the following year. They had two children Damon Welch (born 1959) and Tahnee Welch (born 1961). Tahnee went on to take advantage of her own stunning looks as an actress, most notably a prime featured role in Cocoon (1985). Off campus Raquel became a local TV weather girl in San Diego and eventually quit college. Following the end of her marriage in 1961 (she and Welch didn't divorced until 1965), she packed up her two children and moved to Dallas, Texas, where she modeled for Neiman-Marcus and worked as a barmaid for a time. Regrouping, she returned to California, migrated to Los Angeles, and made the rounds of film/TV auditions. Providing minor but sexy set decoration on the small screen (Bewitched (1964), McHale's Navy (1962) and The Virginian (1962)) as well as the large (Elvis Presley's Roustabout (1964) and Doris Day's Do Not Disturb (1965)). Caught in the midst of the \"beach party\" craze, it's not surprising to find out that her first prime film role was A Swingin' Summer (1965), which concentrated more on musical guests The Righteous Brothers and Gary Lewis & The Playboys than on Raquel's outstanding contributions. But 20th Century Fox certainly took notice and signed her up. With her very first film under contract (actually, she was on loan out to Britain's Hammer Studios at the time), she took on the remake of One Million B.C. (1940) in the Carole Landis role and the rest is history. Raquel remained an international celebrity in her first few years of stardom. In England, she was quite revealing as the deadly sin representing \"lust\" for the comedy team of Peter Cook and Dudley Moore in their vehicle Bedazzled (1967), and as the title secret agent in the sexy spy spoof Fathom (1967). In Italy, she gained some exposure in primarily mediocre vehicles opposite such heartthrobs as Marcello Mastroianni. Back in the U.S., however, she caused quite a stir in her ground-breaking sex scenes with black athlete Jim Brown in the \"spaghetti western\" 100 Rifles (1969), and as the transgendered title role in the unfathomable Myra Breckinridge (1970). Adapted from Gore Vidal novel, she created some unwelcome notoriety by locking horns with aging diva Mae West on the set. The instant cult movie was a laughingstock to all concerned and certainly didn't help Raquel's attempt at being taking seriously as an actress. Box office bombs abounded. Try as she might in such films as Kansas City Bomber (1972) and The Wild Party (1975), which drew some good reviews for her, her sexy typecast gave her little room to breathe. With determination, however, she partly offset this with modest supporting roles in larger ensemble pieces. She showed definite spark and won a Golden Globe for the swashbuckler The Three Musketeers (1973), and appeared to good advantage in the mystery thriller The Last of Sheila (1973). She planned on making a comeback in Cannery Row (1982), even agreeing to appear topless (which she had never done before), but was suddenly fired during production without notice. She sued MGM for breach of contract and ultimately won a $15 million settlement, but it didn't help her film career and only helped to label her as trouble on a set. TV movies became a positive milieu for Raquel as she developed sound vehicles for herself such as The Legend of Walks Far Woman (1982) and Right to Die (1987). She also found a lucrative avenue pitching beauty products in infomercials and developing exercise videos à la Jane Fonda. Raquel took advantage of her modest singing and dancing abilities by performing in splashy Las Vegas showrooms and starring in such plausible stage vehicles as \"Woman of the Year\" and \"Victor/Victoria.\" Still a dazzler broaching age 70, Raquel continues to show up here and there and still can turn heads. She has even spoofed her own diva image on occasion, most memorably on \"Seinfeld\". More recently she has co-starred in the Hispanic-oriented TV series American Family (2002) and in the short-lived comedy Welcome to the Captain (2008), and appeared in the movies Tortilla Soup (2001), Legally Blonde (2001) and Forget About It (2006). She is separated from her fourth husband Richard Palmer, who is 15 years her junior.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjYyMTEyNV5BMl5BanBnXkFtZTgwMjcxMjMyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000079","name":"Raquel Welch","idIMDB":"nm0000079"},"actorId":"nm0000079","character":"Lady Edith","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Lester","urlProfile":"http://www.imdb.com/name/nm0504492","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI4NzcxMTQ2OV5BMl5BanBnXkFtZTcwOTE5NDcwNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1958","placeOfBirth":" Oxford, Oxfordshire, England, UK","birthName":"Mark A. Letzer","height":"6' (1.83 m)","bio":"Mark attended stage school in London, England as a young child and made his film debut in The Counterfeit Constable (1964) at the age of six. He made countless TV appearances and became very well known in England. Worldwide fame developed as a result of his portrayal of a stuttering child in Our Mother's House (1967). Producers of Oliver! (1968) auditioned 250 child actors for the title role and finally chose him. Many roles for TV, film and stage followed. His last major film was Crossed Swords (1977). He now lives with his wife and two children in Cheltenham, England. He and his wife are osteopaths.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI4NzcxMTQ2OV5BMl5BanBnXkFtZTcwOTE5NDcwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0504492","name":"Mark Lester","idIMDB":"nm0504492"},"actorId":"nm0504492","character":"Edward / Tom","urlCharacter":"http://www.imdb.com/character/ch0498470","main":true},{"actorName":"Ernest Borgnine","urlProfile":"http://www.imdb.com/name/nm0000308","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NDE1NjY2OF5BMl5BanBnXkFtZTYwNDE0MzM1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 January 1917","placeOfBirth":" Hamden, Connecticut, USA","birthName":"Ermes Effron Borgnino","height":"5' 9½\" (1.77 m)","bio":"Ernest Borgnine was born Ermes Effron Borgnino on January 24, 1917 in Hamden, Connecticut. His parents were Anna (Boselli), who had emigrated from Carpi (MO), Italy, and Camillo Borgnino, who had emigrated from Ottiglio (AL), Italy. As an only child, Ernest enjoyed most sports, especially boxing, but took no real interest in acting. At age 18, after graduating from high school in New Haven, and undecided about his future career, he joined the United States Navy, where he stayed for ten years until leaving in 1945. After a few factory jobs, his mother suggested that his forceful personality could make him suitable for a career in acting, and Borgnine promptly enrolled at the Randall School of Drama in Hartford. After completing the course, he joined Robert Porterfield's famous Barter Theatre in Abingdon, Virginia, staying there for four years, undertaking odd jobs and playing every type of role imaginable. His big break came in 1949, when he made his acting debut on Broadway playing a male nurse in \"Harvey\". In 1951, Borgnine moved to Los Angeles to pursue a movie career, and made his film debut as Bill Street in The Whistle at Eaton Falls (1951). His career took off in 1953 when he was cast in the role of Sergeant \"Fatso\" Judson in From Here to Eternity (1953). This memorable performance led to numerous supporting roles as \"heavies\" in a steady string of dramas and westerns. He played against type in 1955 by securing the lead role of Marty Piletti, a shy and sensitive butcher, in Marty (1955). He won an Academy Award for Best Actor for his performance, despite strong competition from Spencer Tracy, Frank Sinatra, James Dean and James Cagney. Throughout the 1950s, 1960s and 1970s, Borgnine performed memorably in such films as The Catered Affair (1956), Ice Station Zebra (1968) and Emperor of the North (1973). Between 1962 and 1966, he played Lt. Commander Quinton McHale in the popular television series McHale's Navy (1962). In early 1984, he returned to television as Dominic Santini in the action series Supercopter (1984) co-starring Jan-Michael Vincent, and in 1995, he was cast in the comedy series The Single Guy (1995) as doorman Manny Cordoba. He also appeared in several made-for-TV movies. Ernest Borgnine has often stated that acting is his greatest passion, and he is still working today. His amazing 61-year career (1951 - 2012 and continuing) includes appearances in well over 100 feature films and as a regular in three television series, as well as voiceovers in animated films such as All Dogs Go to Heaven 2 (1996), Small Soldiers (1998), and a continued role in the series SpongeBob SquarePants (1999). Between 1973 until his death, Ernest was married to Tova Traesnaes, who heads her own cosmetics company. They lived in Beverly Hills, California, where Ernest assisted his wife between film projects. When not acting, Ernest actively supported numerous charities and spoke tirelessly at benefits throughout the country. He has been awarded several honorary doctorates from colleges across the United States as well as numerous Lifetime Achievement Awards. In 1996, Ernest purchased a bus and traveled across the United States to see the country and meet his many fans. On December 17, 1999, he presented the University of North Alabama with a collection of scripts from his film and television career, due to his long friendship with North Alabama alumnus and actor George Lindsey (died May 6, 2012), who was an artist in residence at North Alabama. Ernest Borgnine passed away aged 95 on July 8, 2012, at Cedars-Sinai Medical Center in Los Angeles, California, of renal failure. He is survived by his wife Tova, their children and his younger sister Evelyn (1926-2013)","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NDE1NjY2OF5BMl5BanBnXkFtZTYwNDE0MzM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000308","name":"Ernest Borgnine","nicknames":["Ernie"],"idIMDB":"nm0000308"},"actorId":"nm0000308","character":"John Canty","urlCharacter":"http://www.imdb.com/character/ch0030949","main":true},{"actorName":"George C. Scott","urlProfile":"http://www.imdb.com/name/nm0001715","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNTk5NjkzOF5BMl5BanBnXkFtZTYwNTAwOTQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 October 1927","placeOfBirth":" Wise, Virginia, USA","birthName":"George Campbell Scott","height":"6' (1.83 m)","bio":"George C. Scott was an immensely talented actor, a star of screen, stage and television. He was born on October 18, 1927 in Wise, Virginia, to Helena Agnes (Slemp) and George Dewey Scott. At the age of eight, his mother died, and his father, an executive at Buick, raised him. In 1945, he joined the United States Marines and spent four years with them, no doubt an inspiration for portraying General George S. Patton years later. When Scott left the Marines, he enrolled in journalism classes at the University of Missouri, but it was while performing in a play there that the acting bug bit him. He has said it \"clicked, just like tumblers in a safe.\" It was in 1957 that he landed a role in \"Richard III\" in New York City. The play was a success and brought the young actor to the attention of critics. He soon began to get work on television, mostly in live broadcasts of plays, and he landed the role of the crafty prosecutor in Anatomy of a Murder (1959). It was this role that got him his first Oscar nomination, for Best Supporting Actor. However, George and Oscar wouldn't actually become the best of friends. In fact, he felt the whole process forced actors to become stars and that the ceremony was little more than a \"meat market.\" In 1962, he was nominated again for Best Supporting Actor, this time opposite Paul Newman in The Hustler (1961), but sent a message saying \"No, thanks\" and refused the nomination. However, whether he was being temperamental or simply stubborn in his opinion of awards, it did not seem to stop him from being nominated in the future. \"Anatomy\" and \"The Hustler\" were followed by the clever mystery The List of Adrian Messenger (1963), in which he starred alongside Kirk Douglas, Robert Mitchum and cameos by major stars of the time, including Burt Lancaster and Frank Sinatra. It's a must-see, directed by John Huston with tongue deeply in cheek. The following year, Scott starred as General \"Buck\" Turgidson in Stanley Kubrick's comical anti-war film Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb (1964). This became one of his favorites and he often said that he felt guilty getting paid for it, as he had so much fun making it. Another comedy followed, The Flim-Flam Man (1967), with Scott playing a smooth-talking con artist who takes on an apprentice whom he soon discovers has too many morals. Three years followed, with some smaller television movies, before he got the role for which he will always be identified: the aforementioned General Patton in Patton (1970). This was a war movie that came at the end of a decade where anti-war protests had rocked a nation and become a symbol of youth dissatisfied with what was expected of them. Still, the actor's portrayal of this aggressive military icon actually drew sympathy for the controversial hero. He won the Oscar this time, but stayed at home watching hockey instead. A pair of films that he made in the early 1980s were outstanding. The first of these was L'enfant du diable (1980), a film often packaged as a horror movie but one that's really more of a supernatural thriller. He plays John Russell, a composer and music professor who loses his wife and daughter in a tragic accident. Seeking solace, he moves into an archaic mansion that had been unoccupied for 12 years. However, a child-like presence seems to be sharing the house with him and trying to share its secrets with him. From learning of the house's past, he discovers its horrific secret of long ago, a secret that the presence will no longer allow to be kept. Then he starred -- along with a young cast of then largely unknowns, including Timothy Hutton, Sean Penn and Tom Cruise -- in the intense drama Taps (1981). He played the head of a military academy that's suddenly slated for destruction when the property is sold to local developers who plan to build condos. The students take over the academy when they feel that the regular channels are closed to them. Scott kept up in films, television and on stage in the later years of his life (Broadway dimmed its lights for one minute on the night of his death). Among his projects were playing Ebenezer Scrooge in a worthy television update of A Christmas Carol (1984), an acclaimed performance on Broadway of \"Death of a Salesman\", the voice of McLeach in Disney's The Rescuers Down Under (1990) and co-starring roles in television remakes of two classic films, 12 Angry Men (1997) and Inherit the Wind (1999), to name just a few. After his death the accolades poured in, with Jack Lemmon saying, \"George was truly one of the greatest and most generous actors I have ever known,\" while Tony Randall called him \"the greatest actor in American history\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNTk5NjkzOF5BMl5BanBnXkFtZTYwNTAwOTQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001715","name":"George C. Scott","nicknames":["G.C."],"idIMDB":"nm0001715"},"actorId":"nm0001715","character":"Ruffler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rex Harrison","urlProfile":"http://www.imdb.com/name/nm0001322","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzU3OTcwMl5BMl5BanBnXkFtZTYwODEyMTU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 March 1908","placeOfBirth":" Huyton, Lancashire, England, UK [now Huyton, Knowsley, Merseyside, England, UK]","birthName":"Reginald Carey Harrison","height":"6' 1\" (1.86 m)","bio":"Rex Harrison was born Reginald Carey Harrison in Huyton, Lancashire, England, to Edith Mary (Carey) and William Reginald Harrison, a cotton broker. He changed his name to Rex as a young boy, knowing it was the Latin word for \"King\". Starting out on his theater career at age 18, his first job at the Liverpool Rep Theatre was nearly his last - dashing across the stage to say his one line, made his entrance and promptly blew it. Fates were kind, however, and soon he began landing roles in the West End. \"French Without Tears\", a play by Terence Rattigan, proved to be his breakthrough role. Soon he was being called the \"greatest actor of light comedy in the world\". Having divorced his first wife Collette Thomas in 1942, he married German actress Lilli Palmer. The two began appearing together in many plays and British films. He attained international fame when he portrayed the King in Anna and the King of Siam (1946), his first American film. After a sex scandal, in which starlet Carole Landis apparently committed suicide because he ended their affair, the relationship with wife Lilli became strained. Rex (by this time known as \"Sexy Rexy\" for his philandering ways and magnetic charm) began a relationship with British actress Kay Kendall and divorced Lilli to marry the terminally ill Kay with hopes of a re-marriage to Palmer upon Kay's death. The death of Kay affected Harrison greatly and Lilli never returned to him. During this time Rex was offered the defining role of his career: Professor Henry Higgins in the original production of \"My Fair Lady\". He won the Tony for the play and an Oscar for the film version. In 1962 Harrison married actress Rachel Roberts. This union and the one following it to Elizabeth Harris (Richard's ex) also ended in divorce. In 1978 Rex met and married Mercia Tinker. He and Mercia remained happily married until his death in 1990. She was also with him in 1989 when he was granted his much-deserved and long awaited knighthood at Buckingham Palace. Rex Harrison died of pancreatic cancer three weeks after his last stage appearance, as Lord Porteous in W. Somerset Maugham's \"The Circle\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzU3OTcwMl5BMl5BanBnXkFtZTYwODEyMTU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001322","name":"Rex Harrison","nicknames":["Sexy Rexy"],"idIMDB":"nm0001322"},"actorId":"nm0001322","character":"The Duke of Norfolk","urlCharacter":"http://www.imdb.com/character/ch0047591","main":true},{"actorName":"David Hemmings","urlProfile":"http://www.imdb.com/name/nm0376101","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3OTY3Mjk2NV5BMl5BanBnXkFtZTYwOTkyNTM2._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1941","placeOfBirth":" Guildford, Surrey, England, UK","birthName":"David Leslie Edward Hemmings","height":"5' 8\" (1.73 m)","bio":"David Hemmings, one of the great English cinema icons of the 1960s, was born in Guildford, Surrey, on November 18, 1941, to a cookie merchant and his wife. He was educated at Glyn College, Epsom, but while still a child, Hemmings made his first forays into the world of entertainment. An accomplished singer, he toured as a boy soprano with the English Opera Group, famed for his performances of the works of Benjamin Britten. Britten, who befriended the youngster, wrote some roles specifically for Hemmings, including that of \"Miles\" in \"The Turn of the Screw\". Hemmings subsequently took up painting after his career as a soprano was ended by his transit through puberty. He studied painting at the Epsom School of Art, where he staged the first exhibition of his work at the school when he was 15 years old. Hemmings made his film debut in 1954, with The Rainbow Jacket (1954) for Ealing Studios. He also had bit part in Otto Preminger's 1957 version of Saint Joan (1957). In his 20s, he returned to singing, appearing at nightclubs before concentrating on the stage and the cinema. As the youth culture hit Britain in the late 50s (the Notting Hill race riots of August 1958 limned in Julien Temple's 1986 film Absolute Beginners (1986) being a kind of bookmark signaling its arrival), Hemmings was in the right place at the right time to capitalize on his skills and looks. Boyish-looking, with large, protuberant blue eyes covered with heavy lids, his face was at once startling and decadent while simultaneously conveying an air of fragility. He starred in pop music movies Sing and Swing (1963) and Be My Guest (1965), as well as co-starring in one of Michael Winner's first films, The Girl-Getters (1964), with Oliver Reed. The 24-year-old Hemmings desperately wanted what would become his career-defining role, as the morally jaded fashion photographer Thomas in master-director Michelangelo Antonioni's Blow-Up (1966). He was up against the crème of British actors, including Terence Stamp, who already had an Oscar nomination under his belt and was conventionally handsome. Hemmings thought he had blown his audition as Antonioni shook his head constantly throughout his audition. However, he later found out the great director had a mild form of Tourette's which caused him to move his head from side to side. The role made him a star and, for a while, a darling of the pop culture filmmaking that was expected to revolutionize the English-speaking cinema in the 1960s, after the 1964 Best Picture Oscar-win of Tony Richardson's Tom Jones (1963). He was cast as Mordred in the big-screen adaptation of Lerner & Lowe's musical Camelot (1967) with Richard Harris and Hemmings Blow-Up (1966) co-star Vanessa Redgrave to critically panned results. The same year that \"Camelot\" was released (1967), he put out a pop single (\"Back Street Mirror\") and an album, \"David Hemmings Happens\", recorded in Los Angeles. His album was produced by Jim Dickinson, the early producer of The Byrds, and featured instrumental backing by several members of group. It was re-released on CD in 2005. In 1968, he appeared as Dildano opposite Jane Fonda (in her incarnation as a sexpot) in Roger Vadim's kitsch klassic Barbarella (1968). However, to reduce stereotyping and his identification with pop culture filmmaking, he took on the role of the anti-hero Captain Nolan in Tony Richardson's masterful satire The Charge of the Light Brigade (1968) and later, the eponymous role in Alfred the Great (1969). While both films were imbued with the counter-cultural attitudes of their times, the roles themselves were rather straightforward. Hemmings had reached the summit of his career as an actor. These were the heights he never reached again. As the quality of his roles declined, Hemmings turned more to directing. He had directed his first film in 1972, helming the thriller Running Scared (1972) which starred Gayle Hunnicutt, his wife from 1968 to 1974. Hemmings also co-wrote the script. In the 1970s, he had relocated to Malibu, California to live with Hunnicutt, and the fabled beach community which was his home for the next generation. In 1975, he starred as Bertie Wooster in the Andrew Lloyd Webber musical, \"Jeeves\", one of Lord Webber's few flops. Hemmings formed the independent production company Hemdale Corp. with his business partner, John Daly, in the early 1970s as a tax shelter. He was able to use Hemdale and his role as a producer to vivify his directing career. In 1979, Hemmings the director first attracted major attention with Just a Gigolo (1978), but the film was a flop in spite of its interesting cast. After directing the 1981 adventure film Treasure of the Yankee Zephyr (1981) and an adaptation of James Herbert's novel \"The Survivor\", he focused on TV directing. He soon became one of the top directors of American action TV programs, including The A-Team (1983), Airwolf (1984), Magnum, P.I. (1980) and Quantum Leap (1989). However, in the nineties, he abandoned directing, and returned to live in the UK. The role of \"Cassius\" in Gladiator (2000) heralded his full-time return to acting. He was also memorable in a small role in Martin Scorsese's Gangs of New York (2002). But it was his last major role, in the cinema adaption of Graham Swift's Last Orders (2001), that showed Hemmings at the top of his talent. Unrecognizable from the boy-man of 1966-70, he was memorable as the ex-boxer who ruefully remembers the past with his remaining buddies as they travel to throw the ashes of a departed friend into the sea. That two of the other major roles were filled by Michael Caine and Tom Courtenay, two other British actors whose careers first flourished in the 1960s, added to the poignancy of this tale of men trying to recapture lost time. He also appeared, less memorably, in The League of Extraordinary Gentlemen (2003) opposite the ultimate 60s male British cinema icon, Sean Connery. David Hemmings died of a heart attack on December 3, 2003, in Bucharest, Romania, on the set of Blessed (2004), after playing his scenes for the day. He was 62 years old. His autobiography, \"Blow Up... and Other Exaggerations\" was published in 2004.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3OTY3Mjk2NV5BMl5BanBnXkFtZTYwOTkyNTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0376101","name":"David Hemmings","idIMDB":"nm0376101"},"actorId":"nm0376101","character":"Hugh Hendon","urlCharacter":"http://www.imdb.com/character/ch0046227","main":true},{"actorName":"Harry Andrews","urlProfile":"http://www.imdb.com/name/nm0028674","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MjQyMDg1Ml5BMl5BanBnXkFtZTcwNzgxOTM2NA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1911","placeOfBirth":" Tonbridge, Kent, England, UK","birthName":"Harry Fleetwood Andrews","height":"6' 2\" (1.88 m)","bio":"British character actor Harry Andrews had the sort of massive granite face and square jaw that would stamp that career, but he set himself apart with brilliant stage and screen work. He had graduated from Wrekin College in Shropshire and then moved on to the stage, appearing with Liverpool Repertory in 1933 and focusing on Shakespearean roles. He was befriended by stage star John Gielgud who invited him to New York and Broadway as part of the cast of \"Hamlet\" in 1935. On the return to London, Andrews did a run of plays in the West End. Then Gielgud invited him into his own stage company. Soon after he was asked into the Old Vic Company by its director Laurence Olivier. His roles were becoming increasingly substantial, authoritative parts to match his sharp and forceful, through-the-teeth delivery of lines. Next he did not pass up the opportunity to join the Stratford Memorial Theatre in Stratford-upon-Avon, where he spent a decade honing himself into an established, fine, versatile actor, described by the controversial London theater critic Kenneth Tynan as \"the backbone of British theater.\" He came to the small screen before the large, having debuted in British experimental television in 1939, followed over a decade later with his debut on the ever expanding and fecund American playhouse TV in 1952. His big screen debut came the next year in a character part which would accent his career-from ancient to modern-the disciplined military man in Paratrooper (1953). From there the roles came his way - three or four per year - well into 1979, when TV took up most of his time. His movie making was spent either before American or British cameras. And the military roles were always masterly done, whether a roughed out sergeant or a more dignified officer. Though his most famous noncom may be Sergeant Major Tom Pugh alongside John Mills in J. Lee Thompson's classic adventure Ice Cold in Alex (1958), his achievement as Sergeant Major Bert Wilson, the near psychotic martinet, opposite Sean Connery and Ian Bannen, in The Hill (1965) was an over-the-top tour de force. That same year he was back in costume - having played many an ancient and medieval noble role through the 1950s - in something different - playing the great Renaissance architect Donato Bramante against Charlton Heston as rival Michelangelo in The Agony and the Ecstasy (1965). Not a big part, nevertheless Andrews gave the role a subdued and matter-of-fact strength that well fit the ambitious architect of the fiery Pope Julius II (played with great verve by Rex Harrison). While Andrews was also excellent with a tongue-in-cheek style for comedic roles, as in the send up, The Ruling Class (1972), he excelled against type as a flamboyant homosexual in the black comedy Entertaining Mr. Sloane (1970). He had said something like: \"I don't want to be a star -- I want to be a good actor in good parts\" - but his presence always made him standout. It was ironic that he had difficulty in memorizing lines. Sometime later co-star Alan Bates thought him very courageous for his obvious triumph over this impediment. Bates further remarked that Andrews' great sense of humor and no-nonsense personable character made him a favorite with younger actors as a continuous well of encouragement and learning experiences. Though his parts were smaller as he grew older, he filled each of his roles, big or small - over 100 of them - with a giant's footsteps.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MjQyMDg1Ml5BMl5BanBnXkFtZTcwNzgxOTM2NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0028674","name":"Harry Andrews","idIMDB":"nm0028674"},"actorId":"nm0028674","character":"Hertford","urlCharacter":"http://www.imdb.com/character/ch0124249","main":true},{"actorName":"Julian Orchard","urlProfile":"http://www.imdb.com/name/nm0649444","urlPhoto":"","biography":{"dateOfBirth":"3 March 1930","placeOfBirth":" Wheatley, England, UK","birthName":"Julian Dean Chavasse Orchard","height":"6' 2\" (1.88 m)","bio":"Julian Orchard was born on March 3, 1930 in Wheatley, England as Julian Dean Chavasse Orchard. He was an actor, known for The Harry Secombe Show (1968), The Slipper and the Rose: The Story of Cinderella (1976) and Revenge of the Pink Panther (1978). He was married to Susan B. Cartwright. He died on June 21, 1979 in Westminster, London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0649444","name":"Julian Orchard","idIMDB":"nm0649444"},"actorId":"nm0649444","character":"St.John","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Murray Melvin","urlProfile":"http://www.imdb.com/name/nm0578527","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2OTU0MDc1OV5BMl5BanBnXkFtZTcwMTAxNjAzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1932","placeOfBirth":" St. Pancras, London, England, UK","bio":"Murray Melvin was born on August 10, 1932 in St. Pancras, London, England. He is an actor, known for Barry Lyndon (1975), The Phantom of the Opera (2004) and A Taste of Honey (1961).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2OTU0MDc1OV5BMl5BanBnXkFtZTcwMTAxNjAzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0578527","name":"Murray Melvin","idIMDB":"nm0578527"},"actorId":"nm0578527","character":"Prince's Dresser","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lalla Ward","urlProfile":"http://www.imdb.com/name/nm0911677","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNDc1MTMyNF5BMl5BanBnXkFtZTcwNzgzMjIyOA@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1951","placeOfBirth":" London, England, UK","birthName":"(The Honourable) Sarah Ward","height":"5' 5\" (1.65 m)","bio":"Lalla Ward born Sarah Ward, daughter of Lord Bangor - Edward Ward - and his writer wife, Marjorie Banks. She always wanted to act, paint and draw, and so joined the Central School of Speech and Drama in 1967. When she left in 1970, it was straight into a part in the Hammer film Vampire Circus (1972). Following this she worked extensively on stage, in films - including England Made Me (1973), Rosebud (1975) and Crossed Swords (1977) (aka The Prince and the Pauper) - and on television - including appearances in Quiller: Thundersky (1975), Hazell: Hazell Meets the First Eleven (1978), Quiller: Thundersky (1975) and several episodes of The Duchess of Duke Street (1976). She also appeared in a film called Got It Made (1974), which was later reissued as \"Sweet Virgin\" with sex scenes added featuring other actors. This led to her winning a libel action against Club International magazine, which ran a selection of nude photographs from the film purporting to be of her. Her guest appearance in the Doctor Who story Doctor Who: The Armageddon Factor: Part One (1979) in 1979 led to her being chosen to play Romana when the original actress, Mary Tamm, left after one season. Ward quit Doctor Who in 1980, and in December of that year married Tom Baker. The marriage lasted 16 months. Ward continued to act, with roles in Schoolgirl Chums (1982) and Hamlet, Prince of Denmark (1980) for the BBC and \"The Jeweller's Shop\" and \"The Rehearsal\" on stage. She also developed her love of painting and wrote and illustrated several books. In 1992 she married eminent biologist Dr. Richard Dawkins, author of such books as \"The Selfish Gene\" and \"The Blind Watchmaker\", and gave up acting to concentrate on writing and on her family.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNDc1MTMyNF5BMl5BanBnXkFtZTcwNzgzMjIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0911677","name":"Lalla Ward","idIMDB":"nm0911677"},"actorId":"nm0911677","character":"Princess Elizabeth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Felicity Dean","urlProfile":"http://www.imdb.com/name/nm0212772","urlPhoto":"","biography":{"dateOfBirth":"24 January 1959","placeOfBirth":" London, England, UK","bio":"Felicity Dean was born on January 24, 1959 in London, England. She is an actress, known for The Whistle Blower (1986), Revolution (1985) and The Last of the Blonde Bombshells (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0212772","name":"Felicity Dean","idIMDB":"nm0212772"},"actorId":"nm0212772","character":"Lady Jane","urlCharacter":"http://www.imdb.com/character/ch0496437","main":true},{"actorName":"Sybil Danning","urlProfile":"http://www.imdb.com/name/nm0000356","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQzMDcxODgxMF5BMl5BanBnXkFtZTgwOTExODAyOTE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 May 1952","placeOfBirth":" Wels, Upper Austria, Austria","birthName":"Sybille Johanna Danninger","height":"5' 7\" (1.7 m)","bio":"Tall, leggy, buxom and statuesque 5'7\" blonde beauty Sybil Danning reigns supreme as one of the sexiest, most dynamic and commanding actresses to achieve cult B-movie queen status. She was born Sybille Johanna Danninger on May 24, 1952, in Wels, Austria, the daughter of a US Army major father and an Austrian mother. She grew up on army bases in such places as New Jersey, Maryland and Sacramento, California. Sybil attended Etontown's Star of the Sea Catholic School. At age 14 she worked for her uncle as a dental assistant. Two years later she moved to Vienna, Austria, and worked for a dental supply company. She then relocated to Salzburg and worked as an assistant to a top oral surgeon. Danning then enrolled in the Buchner School of Cosmetology in Salzburg and received a diploma in facial treatment, decorative make-up, manicure and body massage. She soon began doing fashion shows and photo layouts. Danning made her film debut as Lorelei in Komm nur, mein liebstes Vögelein (1968). She next portrayed Kriemhild in The Long Swift Sword of Siegfried (1971). Sybil studied for three years with noted Munich drama coach Anne-Marie Hanschke. Sybil made memorable appearances in such mainstream features as Barbe-bleue (1972), The Three Musketeers (1973), Crossed Swords (1977) and The Concorde... Airport '79 (1979). She also continued to act in such enjoyably lowbrow exploitation items as Naughty Nymphs (1972), Das Mädchen mit der heißen Masche (1972) and Cat in the Cage (1978). Danning was especially excellent and impressive as the fierce Valkyrie warrior Saint-Exmin in the science-fiction cult classic Battle Beyond the Stars (1980). Other notable roles are tough prison inmate Ericka in the babes-behind-bars classic Chained Heat (1983), a formidable female swordfighter in I sette magnifici gladiatori (1983), wicked werewolf queen Stirba in Howling II: ... Your Sister Is a Werewolf (1985), a cunning femme fatale English professor in They're Playing with Fire (1984), the Queen of the Moon in the hilarious Amazon Women on the Moon (1987), the strict Warden Sutter in the amusing chicks-in-chains parody Reform School Girls (1986), an alien queen in The Phantom Empire (1988) and a rugged lady bounty hunter in L.A. Bounty (1989). Sybil has done guest spots on the television series Vega$ (1978), Simon & Simon (1981), V (1984), Masquerade (1983), The Fall Guy (1981), Deadly Nightmares (1983), Street Hawk (1985) and Superboy (1988). She did a ten-page pictorial for the August 1983 issue of \"Playboy\". Outside of acting, Danning has also worked on several movies as a producer and wrote the story for \"L.A. Bounty\". After a regrettably lengthy absence from acting, Sybil Danning has made a welcome comeback by appearing as an evil Nazi villainess in the \"Werewolf Women of the SS\" mock trailer for Grindhouse (2007) and a nurse in Rob Zombie's remake Halloween (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQzMDcxODgxMF5BMl5BanBnXkFtZTgwOTExODAyOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000356","name":"Sybil Danning","nicknames":["The Queen of the B movies"],"idIMDB":"nm0000356"},"actorId":"nm0000356","character":"Mother Canty","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Graham Stark","urlProfile":"http://www.imdb.com/name/nm0823174","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzRmMTUzOTEtMmY1Ny00ZjIwLTk3OGMtN2U5MDk3NDZiNDg5XkEyXkFqcGdeQXVyMjIxMzMyMQ@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 January 1922","placeOfBirth":" Wallasey, Cheshire, England, UK","birthName":"Graham William Stark","bio":"Graham Stark was born on January 20, 1922 in Wallasey, Cheshire, England as Graham William Stark. He was an actor and director, known for A Shot in the Dark (1964), Victor Victoria (1982) and Superman III (1983). He was married to Audrey Nicholson. He died on October 29, 2013 in London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzRmMTUzOTEtMmY1Ny00ZjIwLTk3OGMtN2U5MDk3NDZiNDg5XkEyXkFqcGdeQXVyMjIxMzMyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0823174","name":"Graham Stark","idIMDB":"nm0823174"},"actorId":"nm0823174","character":"Jester","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Preston Lockwood","urlProfile":"http://www.imdb.com/name/nm0516999","urlPhoto":"","biography":{"dateOfBirth":"30 October 1912","placeOfBirth":" Leyton, London, England, UK","birthName":"Reginald Herbert Lockwood","bio":"Preston Lockwood was born on October 30, 1912 in Leyton, London, England as Reginald Herbert Lockwood. He was an actor, known for Time Bandits (1981), Agatha Christie's Miss Marple: At Bertram's Hotel (1987) and Absolution (1978). He died on April 24, 1996 in Denville Hall, Northwood, Hillingdon, London.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0516999","name":"Preston Lockwood","idIMDB":"nm0516999"},"actorId":"nm0516999","character":"Father Andrew","urlCharacter":"http://www.imdb.com/character/ch0172675","main":true}],"seasons":[],"idIMDB":"tt0077381","urlIMDB":"http://www.imdb.com/title/tt0077381","business":{"budget":{"money":"$8,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Copyright © The Prince and the Pauper Film Export AG MCMLXXVII All Rights Reserved."},"technical":{"runtime":["1 hr 53 min (113 min)","2 hr 1 min (121 min) (DVD) (USA)"],"soundMix":["70 mm 6-Track"],"color":["Color (Technicolor)"],"aspectRatio":["2.20 : 1 (70 mm prints)","2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision (anamorphic) (as Panavision®)"],"printedFilmFormat":["70 mm (blow-up)","35 mm"]},"rating":"6.5","filmingLocations":[{"location":"Pinewood Studios, Iver Heath, Buckinghamshire, England, UK"}],"rated":"PG","awards":[],"votes":"1,241","type":"Movie","companyCreditsSimple":[{"idCompany":"co0113578","name":"International Film Production"},{"idCompany":"co0027350","name":"Prince and the Pauper Film Export A.G."}],"keywords":{"keywords":["boy","prince","king","king henry viii","whipping","comedy of manners","slapstick","loss of father","satire","royalty","historical fiction","adventure hero","disarming someone","rapier","duel","sword duel","swordsman","sword fight","sword","british royal family","historical event","look alike","westminster abbey london","mark twain","coronation ceremony","tudor england","beggar","beggars' guild","impostor","king edward vi","swashbuckler","stocks","children","identity swap","based on book","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 22:08:19"}}