{"data":{"movies":[{"title":"Lady Dracula","originalTitle":"","year":"1977","releaseDate":"19791003","directors":[{"name":"Franz Josef Gottlieb","id":"nm0331964"}],"writers":[{"name":"Brad Harris","id":"nm0364490"},{"name":"Redis Read","id":"nm0713875"}],"runtime":"79 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjZmMWQwZTEtY2ZiZS00NjZhLTgxNzUtNjVlZWQwNWY0ZGNiL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["West Germany"],"languages":["German"],"genres":["Comedy","Horror"],"plot":"A beautiful blonde bitten by Count Dracula 100 years previously is unearthed in Vienna, and soon she goes on a killing spree.","simplePlot":"A beautiful blonde bitten by Count Dracula 100 years previously is unearthed in Vienna, and soon she goes on a killing spree.","actors":[{"actorName":"Evelyne Kraft","urlProfile":"http://www.imdb.com/name/nm0469192","urlPhoto":"","biography":{"dateOfBirth":"11 April 1951","placeOfBirth":" USSR","bio":"Strikingly lovely, sexy, and shapely Swiss blonde bombshell Evelyne Kraft was born on April 11, 1951 in the USSR. The statuesque stunner made her film debut as Eleonora in the enjoyable Italian giallo \"The French Sex Murders.\" Evelyne achieved her greatest enduring cult cinema popularity with her memorable starring role as the innocent, yet alluring Amazonian jungle goddess Ah Wei in the gloriously daft Hong Kong giant creature feature \"The Mighty Peking Man.\" Kraft had another lead part as the titular character in the amusing lowbrow horror comedy romp \"Lady Dracula.\" Her last role was as a terrorist posing as a secretary in \"Assassination Attempt.\" After she called it a day as an actress, Evelyne dedicated herself to charity-focused construction work in Africa with her own building company based in Nigeria. Moreover, Kraft was also a wife and a mother. Evelyne died at the tragically young age of 57 from heart failure on January 13, 2009 in Islisberg, Aargau.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0469192","name":"Evelyne Kraft","idIMDB":"nm0469192"},"actorId":"nm0469192","character":"Comtesse Barbara von Weidenborn / Lady Dracula","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brad Harris","urlProfile":"http://www.imdb.com/name/nm0364490","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDM3NjQ4ZGItNDA2ZC00ZDY3LTkzYmYtZDRhM2I0ODgzODJlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1933","placeOfBirth":" St. Anthony, Idaho, USA","birthName":"Bradford Jan Harris","height":"5' 11\" (1.8 m)","bio":"Born in St. Anthony, a small town in eastern Idaho, Bradford Harris attended UCLA in the early 1950s, where he played fullback on the football team while studying economics. His studies may have been intended as the groundwork for a career in his family's banking business, but Harris instead drifted into the fringes of Los Angeles' movie industry, and secured employment as a stunt man. In the late 1950s he traveled to Europe as the stunt co-ordinator for a German-Italian co-production. Soon he found himself working as a second-unit director, and that led to a starring role in Goliath Against the Giants (1961). His good looks and muscular build kept him in demand during the era of \"sword and sandal\" movies, and when this genre began to fade away, he moved into \"spaghetti westerns\" and a spate of action movies with an emphasis on spy thrillers. In 1967 he married actress Olga Schoberová.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDM3NjQ4ZGItNDA2ZC00ZDY3LTkzYmYtZDRhM2I0ODgzODJlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0364490","name":"Brad Harris","idIMDB":"nm0364490"},"actorId":"nm0364490","character":"Kommissar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Theo Lingen","urlProfile":"http://www.imdb.com/name/nm0003586","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDA1OWY1NzEtYmZlZS00NThlLThkNjgtODUyNzg4YjYzYTIyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1903","placeOfBirth":" Hanover, Germany","birthName":"Franz Theodor Schmitz","bio":"Theo Lingen was born on June 10, 1903 in Hanover, Germany as Franz Theodor Schmitz. He was an actor and director, known for M (1931), Le testament du docteur Mabuse (1933) and Um eine Nasenlänge (1949). He was married to Marianne Zoff. He died on November 10, 1978 in Vienna, Austria.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDA1OWY1NzEtYmZlZS00NThlLThkNjgtODUyNzg4YjYzYTIyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003586","name":"Theo Lingen","idIMDB":"nm0003586"},"actorId":"nm0003586","character":"Theo Marmorstein","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eddi Arent","urlProfile":"http://www.imdb.com/name/nm0034357","urlPhoto":"","biography":{"dateOfBirth":"5 May 1925","placeOfBirth":" Free City of Danzig [now Gdansk, Pomorskie, Poland]","birthName":"Gebhardt Georg Arendt","bio":"Eccentric, self-deprecating comedian Eddi Arent first attracted attention in a series of quirky Edgar Wallace adaptations in the 1960's. For several years, he was Germany's idea of stereotypically blithering English lords (Die seltsame Gräfin (1961), as the aptly named Lord Selwyn Moron), laconic butlers (Secret of the Red Orchid (1962)) or obtuse, clumsy second-string Scotland Yard photographers (Dead Eyes of London (1961), Front à la Scotland Yard (1962). Otherwise, Arent was patently reliable as droll, vaguely effete sidekicks and comic relief in westerns and adventure films based on the ever-popular writings of Karl May. He is fondly remembered as the mild-mannered, bumbling butterfly collector Castlepool in the 'Winnetou' trilogy, beginning with The Treasure of the Silver Lake (1962). To confound those who had him perpetually typecast, Arent also donned the black garb of villainy as a murderous monk for one of his last Edgar Wallace potboilers, The Sinister Monk (1965). He must have enjoyed this change of character, since he repeated the exercise: first (not too convincingly), playing a human trafficker masquerading as a priest in Le bossu de Londres (1966); then, as a knife-throwing killer in the English-German co-production Psycho-Circus (1966), which had the great Christopher Lee (for once) relegated to the role of the 'red herring'. Unlike most of his peers, Arent had little formal theatrical training. Instead, he began in cabaret, where he developed the character sketches and personae which would later make his name. Nor did he have any interest in forging a career on the legitimate stage. Films first saw him as a dramatic actor in minor supporting roles, his natural talent as a comedian not recognised until the end of the 1950's. After his hey-day in the 60's, his subsequent output was fairly unremarkable. For the most part, he fluttered around on the margins of youth-oriented low-brow pop-films. Some of his other pictures may have appealed to devotees of 'Heimatfilm' schmaltz. However, in the 80's, Arent acquired a new following with the television sketch show Harald und Eddi (1987). In conjunction with perennial audience favorite Harald Juhnke, he delighted audiences with his comedic versatility. Leaving the limelight in the 1990's, Arent then endured a series of financial and personal setbacks. Suffering from depression and increasingly afflicted by dementia, he died in May 2013 at the age of 88.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0034357","name":"Eddi Arent","idIMDB":"nm0034357"},"actorId":"nm0034357","character":"Eddi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christine Buchegger","urlProfile":"http://www.imdb.com/name/nm0118123","urlPhoto":"","biography":{"dateOfBirth":"19 November 1942","placeOfBirth":" Vienna, Austria","bio":"Christine Buchegger was born on November 19, 1942 in Vienna, Austria. She was an actress, known for From the Life of the Marionettes (1980), Inferno (1973) and Der Fall Eleni Voulgari (1971). She was married to Christian Kohlund. She died on March 3, 2014 in Munich, Bavaria, Germany.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0118123","name":"Christine Buchegger","idIMDB":"nm0118123"},"actorId":"nm0118123","character":"Irene Ruhesanft","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Walter Giller","urlProfile":"http://www.imdb.com/name/nm0318854","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWZhOGQzNWEtZGFiNC00NDI2LTk3NmYtNzk2NmFjOGE0NjcxXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 August 1927","placeOfBirth":" Recklinghausen, Germany","height":"6' 0½\" (1.84 m)","bio":"Walter Giller was born on August 23, 1927 in Recklinghausen, Germany. He was an actor, known for Drei Mann in einem Boot (1961), The Conjugal Bed (1963) and The Captain from Köpenick (1956). He was married to Nadja Tiller. He died on December 15, 2011 in Hamburg, Germany.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWZhOGQzNWEtZGFiNC00NDI2LTk3NmYtNzk2NmFjOGE0NjcxXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0318854","name":"Walter Giller","idIMDB":"nm0318854"},"actorId":"nm0318854","character":"Herr Oskar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Klaus Höhne","urlProfile":"http://www.imdb.com/name/nm0405912","urlPhoto":"","biography":{"dateOfBirth":"13 June 1927","placeOfBirth":" Hamburg, Germany","birthName":"Klaus Wilhelm Bruno Höhne","bio":"Klaus Höhne was born on June 13, 1927 in Hamburg, Germany as Klaus Wilhelm Bruno Höhne. He is known for his work on The Damned (1969), Tatort (1970) and Gezeiten (1970). He died on August 21, 2006 in Murnau am Staffelsee, Bavaria, Germany.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0405912","name":"Klaus Höhne","idIMDB":"nm0405912"},"actorId":"nm0405912","character":"Herr Hubert","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roberto Blanco","urlProfile":"http://www.imdb.com/name/nm0087325","urlPhoto":"","biography":{"dateOfBirth":"7 June 1937","placeOfBirth":" Tunis, French Protectorate Tunisia [now Tunisia]","birthName":"Roberto Zerquera","bio":"Roberto Blanco was born on June 7, 1937 in Tunis, French Protectorate Tunisia as Roberto Zerquera. He is an actor, known for Ein Lied für Luxemburg (1973), Il est de retour (2015) and Die Harald Schmidt Show (1995). He has been married to Luzandra Strassburg since September 14, 2013. He was previously married to Mireille Blanco.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0087325","name":"Roberto Blanco","idIMDB":"nm0087325"},"actorId":"nm0087325","character":"Baggerführer Karli","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Boyd","urlProfile":"http://www.imdb.com/name/nm0000963","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NjQxMzcyOF5BMl5BanBnXkFtZTYwOTk4OTYy._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 July 1931","placeOfBirth":" Glengormley, Northern Ireland, UK","birthName":"William Millar","height":"6' (1.83 m)","bio":"Stephen Boyd was born William Millar on July 4, 1931, at Glengormley, Northern Ireland, one of nine children of Martha Boyd and Canadian truck driver James Alexander Millar, who worked for Fleming's on Tomb Street in Belfast. He attended Glengormley & Ballyrobert primary school and then moved on to Ballyclare High School and studied bookkeeping at Hughes Commercial Academy. In Ireland he worked in an insurance office and travel agency during the day and rehearsed with a semi-professional acting company at night during the week and weekends. He would eventually manage to be on the list for professional acting companies to call him when they had a role. He joined the Ulster Theatre Group and was a leading man with that company for three years, playing all kinds of roles. He did quite a bit of radio work in between as well, but then decided it was distracting him from acting and completely surrendered to his passion. Eventually he went to London as an understudy in an Irish play that was being given there, \"The Passing Day\". In England he became very ill and was in and out of work, supplementing his acting assignments with odd jobs such as waiting in a cafeteria, doorman at the Odeon Theatre and even busking on the streets of London. Even as things turned for the worst, he would always write back to his mother that all was well and things were moving along so as not to alarm her in any way or make her worry. Sir Michael Redgrave discovered him one night at the Odeon Theatre and arranged an introduction to the Windsor Repertory Company. The Arts Council of Great Britain was looking for a leading man and part-time director for the only major repertory company that was left in England, The Arts Council Midland Theatre Company, and he got the job. During his stay in England he went into television with the BBC, and for 18 months he was in every big play on TV. One of the major roles in his early career was the one in the play \"Barnett's Folly\", which he himself ranked as one of his favorites. In 1956 he signed a seven-year contract with 20th Century-Fox. This led to his first film role, as an IRA member spying for the Nazis in The Man Who Never Was (1956), a job he was offered by legendary producer Alexander Korda. William Wyler was so struck by Boyd's performance in that film that he asked Fox to loan him Boyd, resulting in his being cast in what is probably his most famous role, that of Messala in the classic Ben-Hur (1959) opposite Charlton Heston. He received a Golden Globe award for his work on that film but was surprisingly bypassed on Oscar night. Still under contract with Fox, Boyd waited around to play the role of Marc Anthony in Cleopatra (1963) opposite Elizabeth Taylor. However, Taylor became so seriously ill that the production was delayed for months, which caused Boyd and other actors to withdraw from the film and move on to other projects. Boyd made several films under contract before going independent. One of the highlights was Fantastic Voyage (1966), a science-fiction film about a crew of scientists miniaturized and injected into the human body as if in inner space. He also received a nomination for his role of Insp. Jongman in Lisa (1962) (aka \"The Inspector\") co-starring with Dolores Hart. Boyd's Hollywood career began to fade by the late 1960s as he started to spend more time in Europe, where he seemed to find better roles more suited to his interests. When he went independent it was obvious that he took on roles that spoke to him rather than just taking on assignments for the money, and several of the projects he undertook were, at the time, quite controversial, such as Slaves (1969) and Carter's Army (1970). Boyd chose his roles based solely on character development and the value of the story that was told to the public, and never based on monetary compensation or peer pressure. Although at the height of his career he was considered one of Hollywood's leading men, he never forgot where he came from, and always reminded everyone that he was, first and foremost, an Irishman. When the money started coming in, one of the first things he did was to ensure that his family was taken care of. He was particularly close to his mother Martha and his brother Alex. Boyd was married twice, the first time in 1958 to Italian-born MCA executive Mariella di Sarzana, but that only lasted (officially) during the filming of \"Ben Hur\". His second marriage was to Elizabeth Mills, secretary at the British Arts Council and a friend since 1955. Liz Mills followed Boyd to the US in the late 1950s and was his personal assistant and secretary for years before they married, about ten months before his death on June 2, 1977, in Northridge, California, from a massive heart attack while playing golf - one of his favorite pastimes","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NjQxMzcyOF5BMl5BanBnXkFtZTYwOTk4OTYy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000963","name":"Stephen Boyd","nicknames":["Dimples"],"idIMDB":"nm0000963"},"actorId":"nm0000963","character":"Graf Dracula","urlCharacter":"http://www.imdb.com/character/ch0002561","main":true},{"actorName":"Ulrich Beiger","urlProfile":"http://www.imdb.com/name/nm0067176","urlPhoto":"","biography":{"dateOfBirth":"26 August 1918","placeOfBirth":" Munich, Germany","bio":"Ulrich Beiger was born on August 26, 1918 in Munich, Germany. He was an actor and director, known for The Great Escape (1963), Percy Stuart (1969) and The Terrible People (1960). He was married to Hannelore Schützler. He died on September 18, 1996 in Munich, Bavaria, Germany.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0067176","name":"Ulrich Beiger","idIMDB":"nm0067176"},"actorId":"nm0067176","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marion Kracht","urlProfile":"http://www.imdb.com/name/nm0469116","urlPhoto":"","biography":{"dateOfBirth":"5 December 1962","placeOfBirth":" Munich, Bavaria, West Germany","height":"5' 7¾\" (1.72 m)","bio":"Marion Kracht was born on December 5, 1962 in Munich, Bavaria, West Germany. She is an actress and director, known for The Adventures of Dr. Bayer (1985), Diese Drombuschs (1983) and Ein Sommer in Schottland (2012). She has been married to Berthold Manns since December 2004. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0469116","name":"Marion Kracht","idIMDB":"nm0469116"},"actorId":"nm0469116","character":"Comtesse Barbara als Mädchen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Georg Lehn","urlProfile":"http://www.imdb.com/name/nm0499784","urlPhoto":"","biography":{"dateOfBirth":"7 February 1915","placeOfBirth":" Darmstadt, Germany","bio":"Georg Lehn was born on February 7, 1915 in Darmstadt, Germany. He was an actor, known for Der plötzliche Reichtum der armen Leute von Kombach (1971), The Bridge (1959) and Instinkt ist alles (1960). He died on March 20, 1996 in Munich, Bavaria, Germany.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0499784","name":"Georg Lehn","idIMDB":"nm0499784"},"actorId":"nm0499784","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edith Leyrer","urlProfile":"http://www.imdb.com/name/nm0508073","urlPhoto":"","biography":{"dateOfBirth":"25 October 1946","placeOfBirth":" Vienna, Austria","bio":"Edith Leyrer was born on October 25, 1946 in Vienna, Austria. She is an actress, known for Une nuit très morale... (1977), Der Weyland Casperl (1970) and Wild Violets (1968).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0508073","name":"Edith Leyrer","idIMDB":"nm0508073"},"actorId":"nm0508073","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zdenka Procházková","urlProfile":"http://www.imdb.com/name/nm0698324","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2JmOTIzY2QtZmVmMi00M2M5LThlMjQtOTUzNjEzMDA0ZTA3XkEyXkFqcGdeQXVyMjIxMzMyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1926","placeOfBirth":" Prague, Czechoslovakia","bio":"Zdenka Procházková was born on April 4, 1926 in Prague, Czechoslovakia. She is an actress, known for ...and the Fifth Horseman Is Fear (1965), Z mého zivota (1955) and Die Verwandlung (1975).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2JmOTIzY2QtZmVmMi00M2M5LThlMjQtOTUzNjEzMDA0ZTA3XkEyXkFqcGdeQXVyMjIxMzMyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0698324","name":"Zdenka Procházková","idIMDB":"nm0698324"},"actorId":"nm0698324","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0076290","urlIMDB":"http://www.imdb.com/title/tt0076290","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 19 min (79 min) (Netherlands)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.66 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"4.3","filmingLocations":[],"rated":"NOT RATED","awards":[],"votes":"94","type":"Movie","companyCreditsSimple":[{"idCompany":"co0037733","name":"IFV Produktion"},{"idCompany":"co0000849","name":"TV13 Filmproduktion"}],"keywords":{"keywords":["dracula","supernatural","vampire","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 00:35:32"}}