{"data":{"movies":[{"title":"Runaway Train","originalTitle":"","year":"1985","releaseDate":"19860117","directors":[{"name":"Andrey Konchalovskiy","id":"nm0464846"}],"writers":[{"name":"Djordje Milicevic","id":"nm0587429"},{"name":"Paul Zindel","id":"nm0956928"}],"runtime":"111 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2OTg2MDg4MF5BMl5BanBnXkFtZTcwMTE0NzI5NA@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Drama","Thriller"],"plot":"A hardened convict and a younger prisoner escape from a brutal prison in the middle of winter only to find themselves on an out-of-control train with a female railway worker while being pursued by the vengeful head of security.","simplePlot":"Two escaped convicts and a female railway worker find themselves trapped on a train with no brakes and nobody driving.","actors":[{"actorName":"Jon Voight","urlProfile":"http://www.imdb.com/name/nm0000685","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NTE3NDA3M15BMl5BanBnXkFtZTgwMDMyNTM1MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1938","placeOfBirth":" Yonkers, New York, USA","birthName":"Jonathan Vincent Voight","height":"6' 2½\" (1.89 m)","bio":"Jon Voight was born on December 29, 1938 in Yonkers, New York, USA as Jonathan Vincent Voight. He is an actor, known for Mission: Impossible (1996), Heat (1995) and Transformers (2007). He was previously married to Marcheline Bertrand and Lauri Peters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NTE3NDA3M15BMl5BanBnXkFtZTgwMDMyNTM1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000685","name":"Jon Voight","idIMDB":"nm0000685"},"actorId":"nm0000685","character":"Oscar 'Manny' Manheim","urlCharacter":"http://www.imdb.com/character/ch0021276","main":true},{"actorName":"Eric Roberts","urlProfile":"http://www.imdb.com/name/nm0000616","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MTk3OTgwM15BMl5BanBnXkFtZTcwODE1OTIwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1956","placeOfBirth":" Biloxi, Mississippi, USA","birthName":"Eric Anthony Roberts","height":"5' 10\" (1.78 m)","bio":"One of Hollywood's edgier, more intriguing characters running around and about for decades, Eric Anthony Roberts started life in Biloxi, Mississippi. He is the son of Betty Lou (Bredemus) and Walter Grady Roberts, one-time actors and playwrights. His siblings are actors Lisa Roberts Gillan and Julia Roberts, and he grew up in Atlanta, Georgia. He began his acting career at age 5 in a local theater company called the \"Actors and Writers Workshop\", founded by his late father. After his schooling at Grady High, he studied drama at age 17 in London for two years at the Royal Academy of Dramatic Arts, then returned to the States and continued his studies at the American Academy in New York. He made his NY stage debut in \"Rebel Women\" in 1976 at age 20 and appeared in regional productions, once playing the newspaper boy in a production of \"A Streetcar Named Desire\" starring Shirley Knight and Glenn Close. After appearing in such daytime soaps as Another World (1964) and How to Survive a Marriage (1974), his career began to shift fast forward when he copped a leading role in a major film. In King of the Gypsies (1978), based on Peter Maas' best-seller about a fracturing dynasty of New York City gypsies, he made his debut alongside an intimidating roster of stars including Judd Hirsch, Susan Sarandon, Shelley Winters and Sterling Hayden. Young Eric held his own expertly (winning a Golden Globe nomination) while his burning intensity and brooding charm marked sure signs of star potential. After this, he won the lead opposite Milo O'Shea in the 1980 stage production of \"Mass Appeal\". He suffered serious injuries in a car accident during his nascent film career but lost no fans by the time he returned to co-star with Sissy Spacek as a small-town stranger in Raggedy Man (1981). It was, however, his stark and frightening portrayal of two-bit hustler Paul Snider, the cast-off boyfriend who slays Playmate-turned-movie starlet Dorothy Stratten (played by Mariel Hemingway) in Star 80 (1983) that really put him on the movie map and earned him a second Golden Globe nomination. A wide range of fascinating, whacked-out roles were immediately offered to him on a silver plate. He played another dangerous streetwise hustler type in The Pope of Greenwich Village (1984) opposite fellow rebel Mickey Rourke; a cocky soda pop sales exec in the Australian comedy Coca-Cola kid (1985); appeared with more charm and restraint opposite Rosanna Arquette in the offbeat romantic comedy Nobody's Fool (1986) and topped his prolific period off with an Academy Award nomination as a young prison escapee hiding out with Jon Voight aboard an out-of-control train in the ultra-violent, character-driven action adventure Runaway Train (1985). Good things continued to happen when he was a replacement lead in the original run of \"Burn This\" and won a Theatre World Award for his 1988 Broadway debut. A risky, no-holds-barred actor, he was often guilty of overacting if given half the chance. His film career began to slide in the late 1980s, appearing in more quantity than quality pictures. A series of missteps led to unheralded appearances in such bombs as the karate-themed Best of the Best (1989); the NY urban thriller The Ambulance (1990); the action western Blood Red (1989), which took three years to release and is the only film Eric and his sister Julia Roberts appeared in together; and Rude Awakening (1989) when he filled in as a burned-out hippie opposite a Chong-less Cheech Marin. More under appreciated \"B\" filming came with the 1990s (Freefall (1994), Sensation (1994), The Nature of the Beast (1995), etc.), while also chewing the scenery with a number of mobster types in TV-movies, including one as \"Al Capone\". He soon began appearing as flashy secondary villains and creepies that showcased other stars instead, such as Final Analysis (1992) starring Richard Gere, Heaven's Prisoners (1996) top lining Alec Baldwin, and The Dark Knight (2008), part of the \"Batman\" series with Christian Bale and the late Heath Ledger. Eric's undeniable, unconventional talent would occasionally mesh with the perfect role. At the Sundance Film Festival in 1996, he received critical applause for his starring role as a man dying of AIDS in the uplifting and emotional film It's My Party (1996) and earned more honors as a writer marked for murder in the mob-themed story La Cucaracha (1998). He was also perfectly cast as one of the cold-blooded killers in the Emmy-nominated TV adaptation of Truman Capote's chiller In Cold Blood (1996). Eric continued to appear sporadically on TV in such dramatic series as Law & Order: Criminal Intent (2001), while sometimes showing a fun side as well in comedy (The King of Queens (1998)). His own series work included Less Than Perfect (2002) and, more recently, and in the cult program Heroes (2006) where promise for a longer participation ended with his character's death. Recovered from a long-standing cocaine problem, Eric wed, for the first time, actress/writer Eliza Roberts (nee Garrett). They have appeared in such films as Killer Weekend (2004) and Final Approach (2005). His daughter from a former relationship, Emma Roberts, is a newly popular and fast-rising \"tween\" actress from the series Unfabulous (2004) and has played youthful super-sleuth Nancy Drew (2007) on film. Eric's unpredictable, volatile nature which works so mesmerizing on screen has also led to troubling times off camera; his relationship with younger sis Julia Roberts has been seriously strained for quite some time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MTk3OTgwM15BMl5BanBnXkFtZTcwODE1OTIwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000616","name":"Eric Roberts","idIMDB":"nm0000616"},"actorId":"nm0000616","character":"Buck McGeehy","urlCharacter":"http://www.imdb.com/character/ch0336216","main":true},{"actorName":"Rebecca De Mornay","urlProfile":"http://www.imdb.com/name/nm0000360","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjk0MzE1OV5BMl5BanBnXkFtZTYwODU3ODgz._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 August 1959","placeOfBirth":" Santa Rosa, California, USA","birthName":"Rebecca Jane Pearch","height":"5' 5½\" (1.66 m)","bio":"Rebecca De Mornay was born 1959 as Rebecca Jane Pearch in Santa Rosa, California. She is the daughter of Julie (Eagar) and Wally George (born George Walter Pearch), a television and radio commentator. Her paternal grandmother was child actress Eugenia Clinchard. Her parents divorced when she was young, and her mother married Richard De Mornay, who adopted her (Rebecca subsequently took his surname). Rebecca's paternal grandfather was English, and she also has German, French, and other English, ancestry. After Richard De Mornay's untimely death, Rebecca's mother moved her and her half-brother Peter from northern California to Europe, where she was raised primarily in England and Austria. Rebecca graduated \"summa cum laude\" from a German-speaking high school in the Austrian alps, and still speaks fluent German and French. She began her acting training in Los Angeles at Lee Strasberg's Institute, became an apprentice at Francis Ford Coppola's Zoetrope Film Studio, and soon thereafter made her film debut in One from the Heart (1981). Her breakthrough came in the box office hit Risky Business (1983), in which she gave a seductive and critically acclaimed performance as a streetwise prostitute opposite a young Tom Cruise. She went on to international stardom with her portrayal of a chillingly twisted nanny in the hugely popular The Hand That Rocks the Cradle (1992). Other acclaimed film work includes Runaway Train (1985) (with Jon Voight), The Trip to Bountiful (1985) (with Geraldine Page), Backdraft (1991) (with Kurt Russell). Network television work includes the tour-de-force role of Arlie in the stellar Getting Out (1994) (based on Marsha Norman's play), the tragic title character in Dominick Dunne's An Inconvenient Woman (1991) (with Jason Robards), the remake of The Shining (1997) (produced by Stephen King), a multi-episode story arc about a cancer survivor on ER (1994) and Hallmark Hall of Fame's Night Ride Home (1999) (with Ellen Burstyn). On stage, she starred as Billie Dawn in \"Born Yesterday\" (1988) at the Pasadena Playhouse, as Charlotte Corday in \"Marat/Sade\" (1990) at the Williamstown Festival, and as Anna in \"Closer\" (2000) at the Mark Taper Forum. Rebecca's directing debut was with a segment of Showtime's Au-delà du réel - l'aventure continue (1995) starring John Savage and Frank Whaley. Rebecca currently resides in Los Angeles with sportscaster Patrick O'Neal, and their daughters, Sophia De Mornay-O'Neal and Veronica De Mornay-O'Neal.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjk0MzE1OV5BMl5BanBnXkFtZTYwODU3ODgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000360","name":"Rebecca De Mornay","idIMDB":"nm0000360"},"actorId":"nm0000360","character":"Sara","urlCharacter":"http://www.imdb.com/character/ch0073798","main":true},{"actorName":"Kyle T. Heffner","urlProfile":"http://www.imdb.com/name/nm0373600","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NDI3MTYzN15BMl5BanBnXkFtZTgwMjU0MzY4ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 May 1957","placeOfBirth":" Chicago, Illinois, USA","birthName":"Kyle Troy Heffner","bio":"Kyle Heffner was born in Chicago, Illinois. His parents noticed his acting ability early and enrolled him, at 11 years old, in a well-respected children's theater, The Jack and Jill Players. After a few plays he began working as a professional in commercials and educational films. His passion for acting took him to Northwestern University. After receiving his degree, he set out for Los Angeles in his grandfather's Ford Granada. Kyle's L.A. angel turned out to be Garry Marshall, who put Kyle to work in Young Doctors in Love (1982), Marshall's directorial debut. \"Doctors\" was produced by Jerry Bruckheimer, which led to Kyle's portrayal of Richie Blazik in Flashdance (1983). Heffner has appeared in over a dozen films since then, including Runaway Train (1985), The Woman in Red (1984), When Harry Met Sally... (1989), High Crimes (2002), and The Hallmark MOW's Family Plan (2005) and Wishing Well (2009). Rounding out his career are numerous national commercials and dozen's TV guest-starring roles which include \"Curb your Enthusiasm\" (2004), \"Seinfeld\" (1990), Gideon's Crossing (2000), Suddenly Susan (1996)), and LA theater such as \"In Heat\" (2008) at the Lost Studio.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NDI3MTYzN15BMl5BanBnXkFtZTgwMjU0MzY4ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0373600","name":"Kyle T. Heffner","idIMDB":"nm0373600"},"actorId":"nm0373600","character":"Frank Barstow","urlCharacter":"http://www.imdb.com/character/ch0073800","main":true},{"actorName":"John P. Ryan","urlProfile":"http://www.imdb.com/name/nm0752636","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDIyNjM4OF5BMl5BanBnXkFtZTcwNjMzOTgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1936","placeOfBirth":" New York City, New York, USA","height":"6' (1.83 m)","bio":"Character actor John P. Ryan was born on July 30, 1936 in New York City. The son of Irish immigrant parents, Ryan graduated from Rice High School and studied English at the City College of New York, where he first developed an interest in acting. He served six years in the US Army and worked as a welfare investigator prior to pursuing an acting career. John made his film debut in the 1967 comedy \"The Tiger Makes Out.\" He appeared in five pictures for Jack Nicholson; he's especially memorable as male nurse Spicer in \"Five Easy Pieces.\" Manic, pale-eyed and craggy-faced, with an often intense and explosive screen presence, Ryan was frequently cast as nasty villains, hard-boiled police officers, and strict military men. John gave a strong and touching performance in a rare change-of-pace sympathetic role as Frank Davis, the bitter and regretful father of a murderous monster mutant baby in Larry Cohen's excellent \"It's Alive.\" He also portrayed Davis in the okay sequel \"It Lives Again.\" Other notable movie parts include the fanatical Colonel Hardcore in \"Shamus,\" shrewd mob capo Patsy O'Neill in the witty \"Cops and Robbers,\" evil scientist Schneider in \"Futureworld,\" the dogged Lt. Parmental in \"Breathless,\" vicious Irish mobster Joe Flynn in \"The Cotten Club;\" at his ferocious best as sadistic prison Warden Ranken in the powerful \"Runaway Train,\" hateful fascist lunatic Glastenbury in the exciting \"Avenging Force,\" ruthless drug kingpin Nathan White in the cruddy \"Death Wish IV: The Crackdown,\" ramrod high school principal Mr. O'Rourke in the amusing \"Three O'Clock High,\" and lethal robot history teacher Mr. Hardin in \"Class of 1999.\" Among the TV shows Ryan did guest spots on are \"M.A.S.H.,\" \"The Rockford Files,\" \"Hawaii Five-O,\" \"Buck Rogers in the 25th Century,\" \"Starsky & Hutch,\" \"Kojak,\" \"Hart to Hart,\" \"The F.B.I.,\" and \"Miami Vice.\" John had a recurring role on the TV series \"Archer.\" In addition to his film and TV credits, Ryan also appeared in over 90 stage plays. Following his final film appearance in \"Bound,\" John spent his later years giving acting lessons and was an advocate of spiritual healing. John P. Ryan died from a stroke at age 70 on March 20, 2007 in Los Angeles, California; he's survived by two daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDIyNjM4OF5BMl5BanBnXkFtZTcwNjMzOTgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0752636","name":"John P. Ryan","idIMDB":"nm0752636"},"actorId":"nm0752636","character":"Warden Ranken","urlCharacter":"http://www.imdb.com/character/ch0073799","main":true},{"actorName":"T.K. Carter","urlProfile":"http://www.imdb.com/name/nm0141953","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4OTc5NDQ5NF5BMl5BanBnXkFtZTcwNDAyNTQxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1956","placeOfBirth":" New York City, New York, USA","birthName":"Thomas Kent Carter","height":"6' 1\" (1.85 m)","bio":"T.K. Carter was raised just east of Los Angeles, California. He began his stand-up routine at age 12, and, by high school, appeared in Neil Simon's production of \"The Odd Couple.\" He began his professional stand-up routine at the Comedy Store in Los Angeles and has also worked at the Improvisation Cafe and Ye Little Club. His first role was in an episode of Police Woman (1974), and starred in the Los Angeles Actors Theatre's version of \"Sisters.\" He has since appeared in such films as Space Jam (1996), A Rage in Harlem (1991) and Ski Patrol (1990).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4OTc5NDQ5NF5BMl5BanBnXkFtZTcwNDAyNTQxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0141953","name":"T.K. Carter","idIMDB":"nm0141953"},"actorId":"nm0141953","character":"Dave Prince","urlCharacter":"http://www.imdb.com/character/ch0336217","main":true},{"actorName":"Kenneth McMillan","urlProfile":"http://www.imdb.com/name/nm0573299","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxODU5MzA2M15BMl5BanBnXkFtZTcwNDE3MTMxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 July 1932","placeOfBirth":" Brooklyn, New York, USA","height":"5' 6½\" (1.69 m)","bio":"Character actor Kenneth McMillan was born on July 2, 1932 in Brooklyn, New York. Prior to becoming an actor, McMillan was a manager at Gimbels Department Store. At age 30, McMillan decided to pursue an acting career. He attended the LaGuardia High School for Performing Arts and took acting lessons from Uta Hagen and Irene Dailey. He made his film debut at age 41 with a small role in Sidney Lumet's superbly gritty police drama Serpico (1973). Portly and ruddy-faced, with an often aggressive and cantankerous demeanor, McMillan was usually cast as gruff, hostile and unfriendly characters. McMillan's most notable parts include the borough commander in The Taking of Pelham One Two Three (1974), a cowardly small-town sheriff in Tobe Hooper's excellent miniseries Salem's Lot (1979), William Hurt's bitter paraplegic father in Eyewitness (1981), a racist fire chief in Ragtime (1981), a wily old safecracker in The Pope of Greenwich Village (1984), the vile and grotesquely obese Baron Vladimir Harkonnen in Dune (1984), Aidan Quinn's pathetic drunken father in Reckless (1984) and a sleazy high-roller gambler in \"The Ledge\" episode of the hugely enjoyable horror anthology Cat's Eye (1985). Moreover, McMillan was equally adept at comedy, giving especially funny and engaging performances as a baseball club manager in Blue Skies Again (1983), Meg Ryan's corrupt police chief father in Armed and Dangerous (1986), and a dotty senile veterinarian in Three Fugitives (1989). McMillan had a steady recurring role as Valerie Harper's irate boss on the situation comedy Rhoda (1974). Among the television series McMillan guest-starred on are Dark Shadows (1966), Ryan's Hope (1975), Kojak (1973), Starsky and Hutch (1975), The Rockford Files (1974), Moonlighting (1985), Magnum, P.I. (1980) and Murder, She Wrote (1984). Outside of his substantial film and television credits, McMillan also frequently performed on stage at the New York Shakespeare Festival. He acted in the original Broadway productions of \"Streamers\" and \"American Buffalo\". He won an Obie for his performance in the off-Broadway play, \"Weekends Like Other People\". Kenneth McMillan died of liver disease at age 56 on January 8, 1989 in Santa Monica, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxODU5MzA2M15BMl5BanBnXkFtZTcwNDE3MTMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0573299","name":"Kenneth McMillan","idIMDB":"nm0573299"},"actorId":"nm0573299","character":"Eddie MacDonald","urlCharacter":"http://www.imdb.com/character/ch0073801","main":true},{"actorName":"Stacey Pickren","urlProfile":"http://www.imdb.com/name/nm0681968","urlPhoto":"","biography":{"bio":"Stacey Pickren is an actress, known for Into the Night (1985), Flashdance (1983) and Runaway Train (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0681968","name":"Stacey Pickren","idIMDB":"nm0681968"},"actorId":"nm0681968","character":"Ruby","urlCharacter":"http://www.imdb.com/character/ch0073802","main":true},{"actorName":"Walter Wyatt","urlProfile":"http://www.imdb.com/name/nm0943593","urlPhoto":"","biography":{"dateOfBirth":"31 March 1939","placeOfBirth":" Kern County, California, USA","birthName":"Walter Clarke Wyatt","bio":"Walter Wyatt was born on March 31, 1939 in Kern County, California, USA as Walter Clarke Wyatt. He is known for his work on The Blues Brothers (1980), Animal House (1978) and Christine (1983). He died on March 7, 1986 in Los Angeles County, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0943593","name":"Walter Wyatt","idIMDB":"nm0943593"},"actorId":"nm0943593","character":"Conlan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edward Bunker","urlProfile":"http://www.imdb.com/name/nm0120483","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3OTc4NjI5Nl5BMl5BanBnXkFtZTcwMjkxOTMwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1933","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Edward Heward Bunker","height":"6' 1½\" (1.87 m)","bio":"Edward Bunker was born on December 31, 1933 in Hollywood, Los Angeles, California, USA as Edward Heward Bunker. He was an actor and writer, known for Reservoir Dogs (1992), Runaway Train (1985) and Animal Factory (2000). He was married to Jennifer Steele. He died on July 19, 2005 in Burbank, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3OTc4NjI5Nl5BMl5BanBnXkFtZTcwMjkxOTMwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0120483","name":"Edward Bunker","nicknames":["Bunk","Eddie"],"idIMDB":"nm0120483"},"actorId":"nm0120483","character":"Jonah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Reid Cruickshanks","urlProfile":"http://www.imdb.com/name/nm0189996","urlPhoto":"","biography":{"dateOfBirth":"27 June 1923","placeOfBirth":" Plainfield, New Jersey, USA","bio":"Reid Cruickshanks was born on June 27, 1923 in Plainfield, New Jersey, USA. He was an actor, known for Ed Wood (1994), Runaway Train (1985) and Fletch (1985). He died on December 11, 2008 in Marina del Rey, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0189996","name":"Reid Cruickshanks","idIMDB":"nm0189996"},"actorId":"nm0189996","character":"Al Turner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dan Wray","urlProfile":"http://www.imdb.com/name/nm0942033","urlPhoto":"","biography":{"bio":"Dan Wray is an actor, known for Runaway Train (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0942033","name":"Dan Wray","idIMDB":"nm0942033"},"actorId":"nm0942033","character":"Fat Con","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Lee Gogin","urlProfile":"http://www.imdb.com/name/nm0324672","urlPhoto":"","biography":{"height":"4' 3\" (1.3 m)","bio":"Michael Lee Gogin is an actor, known for Fear and Loathing in Las Vegas (1998), Runaway Train (1985) and Critters (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0324672","name":"Michael Lee Gogin","idIMDB":"nm0324672"},"actorId":"nm0324672","character":"Short Con","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Bloom","urlProfile":"http://www.imdb.com/name/nm0089183","urlPhoto":"","biography":{"dateOfBirth":"19 February 1944","placeOfBirth":" Los Angeles, California, USA","height":"7' 4\" (2.24 m)","bio":"The big, beefy and extremely tall John Bloom was an imposingly massive 7 foot, 4 inch bulky hulk of a man who was born on February 19, 1944 and grew up in and around Los Angeles. He originally worked as an accountant who was coerced into acting in 1971 by legendary Grade Z schlock exploitation drive-in filmmaker Al Adamson. Bloom made his debut as Frankenstein's monster in the hilariously horrible Dracula vs. Frankenstein (1971). He also appeared in supporting roles in both Brain of Blood (1971) and Angels' Wild Women (1972)_ for Adamson as well playing a hulking warrior and a motorcycle gang member respectively. Among Bloom's more memorable roles are a gentle, dim-witted behemoth handyman who has the head of a vicious criminal killer grafted onto his body in the deliciously cheesy The Incredible 2-Headed Transplant (1971), a murderous extraterrestrial who terrorizes Los Angeles in the not-half-bad sci-fi/horror outing The Dark (1979), the intimidating bodyguard for an Indian pimp in the hilariously raunchy and raucous Bachelor Party (1984), the Reaper, a cannibal hillbilly in the terrible The Hills Have Eyes Part II (1984), and an enormous antagonistic alien who fights with William Shatner in Star Trek VI: The Undiscovered Country (1991). Bloom continued working throughout the 1980s and early 1990s playing tall and hulking thugs or seedy criminals in minor to small roles in movies and TV shows until health problems led to his semi-retirement by the mid 1990s. Being a giant, he also suffered from acromegaly his entire life which took a toll on his health leading to an enlarged heart, among other physical problems. John Bloom died of heart failure on January 15, 1999 at age 54.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0089183","name":"John Bloom","idIMDB":"nm0089183"},"actorId":"nm0089183","character":"Tall Con","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hank Worden","urlProfile":"http://www.imdb.com/name/nm0941401","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMjE0MDY1OF5BMl5BanBnXkFtZTYwMTI1MzAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 July 1901","placeOfBirth":" Rolfe, Iowa, USA","birthName":"Norton Earl Worden","height":"6' 1½\" (1.87 m)","bio":"Raised on a cattle ranch in Montana. Educated at Stanford and the University of Nevada as an engineer. Washed out as an Army pilot. Toured the country in rodeos as a saddle bronc rider. Broke his neck in a horsefall in his 20s, but didn't know it until his 40s. Chosen along with Tex Ritter from a rodeo at Madison Square Garden in New York to appear in the Broadway play \"Green Grow the Lilacs\", the play from which the musical \"Oklahoma\" was later derived. Drove a cab in New York, then worked on dude ranches as a wrangler and as a guide on the Bright Angel trail of the Grand Canyon. Recommended by Billie Burke to several movie producers. Became friends with John Wayne, Howard Hawks, and later John Ford, all of whom provided him with much work. Survived by adopted daughter Dawn Henry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMjE0MDY1OF5BMl5BanBnXkFtZTYwMTI1MzAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0941401","name":"Hank Worden","idIMDB":"nm0941401"},"actorId":"nm0941401","character":"Old Con","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0089941","urlIMDB":"http://www.imdb.com/title/tt0089941","business":{"budget":{"money":"$9,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$2,601,480","country":"USA","day":"06","month":"12","year":"1985","remarks":"965 Screens"}],"gross":[{"money":"SEK","country":"4,655,499","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1985/\">1985</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 51 min (111 min)"],"soundMix":["Dolby Stereo"],"color":["Color (Rankcolor)"],"aspectRatio":["1.85 : 1"],"camera":["J-D-C Cameras and Lenses"],"laboratory":["Rank Film Laboratories, Denham, UK"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.3","filmingLocations":[{"location":"Anaconda, Montana, USA"}],"rated":"R","awards":[{"award":"Academy Awards, USA 1986","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Actor in a Leading Role","names":[{"name":"Jon Voight","id":"nm0000685","role":null}]},{"category":"Best Actor in a Supporting Role","names":[{"name":"Eric Roberts","id":"nm0000616","role":null}]},{"category":"Best Film Editing","names":[{"name":"Henry Richardson","id":"nm0724572","role":null}]}]}]},{"award":"Golden Globes, USA 1986","titlesAwards":[{"titleAwardOutcome":"Won Golden Globe","categories":[{"category":"Best Performance by an Actor in a Motion Picture - Drama","names":[{"name":"Jon Voight","id":"nm0000685","role":null}]}]},{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Motion Picture - Drama","names":[]},{"category":"Best Performance by an Actor in a Supporting Role in a Motion Picture","names":[{"name":"Eric Roberts","id":"nm0000616","role":null}]}]}]},{"award":"American Cinema Editors, USA 1986","titlesAwards":[{"titleAwardOutcome":"Nominated Eddie","categories":[{"category":"Best Edited Feature Film","names":[{"name":"Henry Richardson","id":"nm0724572","role":null}]}]}]},{"award":"Cannes Film Festival 1986","titlesAwards":[{"titleAwardOutcome":"Nominated Palme d'Or","categories":[{"category":"","names":[{"name":"Andrey Konchalovskiy","id":"nm0464846","role":null}]}]}]},{"award":"Motion Picture Sound Editors, USA 1986","titlesAwards":[{"titleAwardOutcome":"Won Golden Reel Award","categories":[{"category":"Best Sound Editing - Foreign Feature","names":[]}]}]},{"award":"Stuntman Awards 1986","titlesAwards":[{"titleAwardOutcome":"Nominated Stuntman Award","categories":[{"category":"Best Vehicular Stunt (Feature Film)","names":[{"name":"Terry Jackson","id":"nm0414084","role":null},{"name":"Golan-Globus Productions","id":null,"role":null}]}]}]}],"votes":"21,839","type":"Movie","companyCreditsSimple":[{"idCompany":"co0206391","name":"Golan-Globus Productions"},{"idCompany":"co0005986","name":"Northbrook Films"}],"keywords":{"keywords":["train","prison","out of control","prisoner","escape","freight train","heart attack","fugitive","beating","violence","collision course","determination","runaway vehicle","riding on the top of a train car","man on top of train","hiding in a laundry basket","tough guy","ends with a quote","speeding train","hand injury","head dunked in a toilet bowl","reference to wayne newton","escaped prisoner","shakespearean quotation","falling into a river","sewer","death wish","stab wound","stabbed in the hand","snowy landscape","stabbed in the stomach","two word title","railroad trestle","bell 206 jet ranger helicopter","ice","snow","train driver","train movie","knife","prison guard","shotgun","one day","intimidation","railroad bridge","suspense","manhunt","glacier","helicopter search","sewer system","stabbing","boxing match","maximum security prison","main character dies","prisoner on the run","existentialism","warden","prison warden","prison laundry","prison fight","prison escape","prison cell","prison break","on the lam","locomotive","allegory","train crash","alaska","runaway train","prison riot","helicopter","riding freight train","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:43:34"}}