{"data":{"movies":[{"title":"5 Masters of Death","originalTitle":"Shao Lin wu zu","year":"1974","releaseDate":"1979","directors":[{"name":"Cheh Chang","id":"nm0151653"}],"writers":[{"name":"Kuang Ni","id":"nm0393250"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNjE2MjU4Nl5BMl5BanBnXkFtZTgwNzU5MzA5NjE@._V1.jpg","countries":["Hong Kong","Taiwan"],"languages":["Mandarin"],"genres":["Action","Drama"],"plot":"The story is simple (Shaolin vs. Manchu traitors), but the effect was anything but, as the screen's most charismatic action actors team with a legendary director and revered choreographers (Liu Chia-liang and brother Liu Chia-yung) for scenes of unparalleled power.","simplePlot":"Five students escape from the destruction of their beloved Shaolin Temple...now each must take revenge and train in their own seperate fighting styles...they will become The Five Shaolin Masters!!","actors":[{"actorName":"David Chiang","urlProfile":"http://www.imdb.com/name/nm0156955","urlPhoto":"","biography":{"dateOfBirth":"29 June 1947","placeOfBirth":" Suzhou, Jiangsu, China","birthName":"Wei-Nien Chiang","height":"5' 9\" (1.75 m)","bio":"David Chiang was born in Suzhou, China on June 29, 1947. His mother Hung Wei and father Yim Dut were very popular movie stars. Young David began his acting career at a very early age, appearing in black & white films while he was only 4 years old. \"John\" is David's real English name, while \"David\" was a stage name given to him by Director Chang Cheh. In 1966, while working as a Stuntman and Fight Instructor for the acclaimed Shaw Brothers Studio, he was spotted by Director Chang Cheh. The Director immediately saw potential & screen presence in the young actor & took David under his wing, slowly grooming him. The pair got along like father & son. With Wang Yu's sudden departure in 1969, Run Run Shaw and his senior executives were searching for their next leading man to take the reins to satisfy the frenzy left from the departed Wang Yu. The movie impresario made David an offer he could not refuse. With the guidance of Director Chang Cheh, David won \"The Best Actor\" Award at the 16th Asian Film Festival in 1970 for his role in \"Vengeance!\". In 1972, at the 18th Asian film Festival, David was awarded \"The Best Actor\" for his role in \"Blood Brothers\" & \"The Most Contemporary\" Award in 1973 at the 19th Asian Film Festival for \"The Generation Gap\". David left Hong Kong with his mentor Chang Cheh and set up an Independent Production Company in 1973 known as Chang's Scope Company. With the backing & blessings of Run Run Shaw, their films continued to be distributed through an enormous Shaw circuit. There, David was able to try his hand at directing, producing and script writing. As the 70s came to an end and the 80s approached, David continued to work his magic on the silver screen working with Directors Lee Han Chiang, Hsueh Li Pao, Ho Meng-hua and Chia-Liang Liu. 1980 was also the start of his first TV series \"The Green Dragon Conspiracy\", followed by \"Princess Chang Ping\" and \"Dynasty\" which are all classics. In the mid 80s, David worked alongside his two brothers, Paul Chun & Derek Yee, directing, producing and acting in the comedy \"Legend of the Owl\". David's talents in comedy also was showcased in the movies \"The Challenger\" and \"The Loot\" directed by Eric Tseng . In late 80s into the 90s David successfully directed movies: \"Heaven Can Help\", \"Silent Love\", \"The Wrong Couples\", \"Mr. Handsome\", \"Double Fattiness\", \"My Dear Son\", \"Will of Iron\" and \"Mother of a Different Kind\" . In 1991, David and his family emigrated from Hong Kong to Vancouver, Canada, returning to Hong Kong to make one or two TV series each year. As 2000 approached, David has continued to work in movies & TV series. He was nominated for \"Best Supporting Actor\" in 2006 for his role in \"Revolving Doors of Vengeance\". With over 4 decades under his belt, David is indeed an icon and a legend and is well regarded as one of Kung Fu's top action heroes.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0156955","name":"David Chiang","idIMDB":"nm0156955"},"actorId":"nm0156955","character":"Hu Te-Ti","urlCharacter":"http://www.imdb.com/character/ch0097372","main":true},{"actorName":"Lung Ti","urlProfile":"http://www.imdb.com/name/nm0862479","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjZkOTgwNWUtN2Q2NS00ZjNlLWE5M2EtMTM4NTdkYmRkZmQzXkEyXkFqcGdeQXVyNjc0MTQwOTc@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 August 1946","placeOfBirth":" Guangdong Province, China","birthName":"Tam Fu Wing","height":"5' 11¾\" (1.83 m)","bio":"Lung Ti was born on August 19, 1946 in Guangdong Province, China as Tam Fu Wing. He is an actor and director, known for A Better Tomorrow (1986), The Legend of Drunken Master (1994) and A Better Tomorrow II (1987). He has been married to Min-Ming Tao since May 22, 1975. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjZkOTgwNWUtN2Q2NS00ZjNlLWE5M2EtMTM4NTdkYmRkZmQzXkEyXkFqcGdeQXVyNjc0MTQwOTc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0862479","name":"Lung Ti","idIMDB":"nm0862479"},"actorId":"nm0862479","character":"Tsai Te-Chung","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sheng Fu","urlProfile":"http://www.imdb.com/name/nm0297143","urlPhoto":"","biography":{"dateOfBirth":"20 October 1954","placeOfBirth":" Hong Kong","birthName":"Chang Fu-Sheng","height":"5' 9\" (1.75 m)","bio":"Born Chang Fu-Sheng to a wealthy family on October 20th, 1954, in Hong Kong. His English adopted name was Alexander. He was the ninth of 11 siblings. He was considered his father's favorite. Unlike the rest of his family, he showed little interest in academic and had no desire to try his hand in business. He left school after only 2 years of secondary education and had showed a keen interest in Kung Fu. At 16, he joined the Shaw-TVB training center. He was the among the 45 graduates who graduated as the 1st class of the Shaw-TVB training center on Sept 28, 1972. After his stint at training school, Fu Sheng got his start at Shaw Brothers at 17. He was discovered by legendary director, Chang Cheh and trained for 6 months under the martial tutelage of legendary director and Martial Arts Master, Lau Kar-Leung. Some of his early appearances in film were Man of Iron (1972), Young People (1972), The 14 Amazons (1972). He got his 1st big role with the 1973 film, Police Force. He next appeared in Chang Cheh's youth action drama, Friends in 1974 co-starring David Chiang and Lily Li. He won the 'Best Young Newcomer' award at the 20th Annual Asian Film Festival for his performance. He joined Chang Cheh in Taiwan and made true and classic kung fu films such as Men From The Monastery (1974), Heroes Two (1973), Shaolin Temple and Shaolin Avengers (both 1976). He teamed up with legend Chun-Kuan Chi in the 1st of many films starting with Shaolin Martial Arts (1974). In the films Men From The Monastery, Heroes Two, Shaolin Temple, Shaolin Avengers, Fu Sheng played a role that he would become universally synonymous with--that of famed Chinese folk hero, Fang Shi-Yu. Fu Sheng was a star, but he rose to true super and mega status with Disciples of Shaolin (1975). Les disciples de Shaolin (1975) is arguably the finest and greatest acting performance of of his career. He met Jenny Tseng, who was a popular singer who toured around the world and lent her voice to Chinese movies and television programs, in 1975 on the set of Boxer Rebellion. They fell quickly in love and married on December 4th, 1976. Fu Sheng would continue to rise to mega-star status in Asia and gained international stardom with the popular and classic movie, Le caïd de Chinatown (1977) (1977). With his star on rise, he suffered two significant setbacks, both in September, giving the title, \"The Black Septembers\". On September 17th, 1978, he complained about being dizzy while shooting on the set of Sun Chung's Deadly Breaking Sword (1979). He fell backwards 8 feet in height with his head crashing through an urn, almost breaking his neck. It caused a serious concussion in his skull with internal bleeding. He wore a neck brace for a couple of months. He suffered permanent dizziness, poor diction, slurred speech and vision problems. The second accident occurred in September 19th, 1979 during the filming of Heroes Shed No Tears, his right leg was shattered when the harness holding him up broke sending him crashing to the hard floor. He had to undergo another procedure as the bone didn't set properly while he was recuperating from the first operation and a special contraption was put in place to keep him still. He was out of work for the of six months. Due to his injuries happening in September, he proclaimed to no longer film in the month of September for the rest of his career. At the time, he moved into a house once owned by the late Bruce Lee and known for it's negative feng shui. He made his comeback in 1981 with the classic and funny Long hu shao ye (1981), a film he made with his brother, Chang Chan-Peng. His career was back on track and he kept on rising. He left his longtime director Chang Cheh, who he made a total of 23 films with. He became a actual student of martial arts master, Lau Kar-Leung, who was becoming a superstar director in his own way. Fu Sheng was filming the all time classic from Lau Kar-Leung, The Eight Diagram Pole Fighter, when tragedy struck. July 7, 1983 Fu Sheng was returning to his home after dinner out at Clearwater Bay Country Club around 10pm. He was a passenger in his Porsche 911 Targa that was driven by his older brother, Chang Zheng Sheng. His brother took one of the winding curves on Clearwater Bay Road too fast and hit a cement barrier around 10:30pm. Fu Sheng's older brother suffered injuries, but Fu Sheng himself suffered a collapsed chest and severe wounds in the abdomen with unstoppable bleeding. He was rushed to the hospital. The doctors tried revive him by trying to get blood back into his body through transfusion but that was unsuccessful because he kept on losing more blood. The horrible realization set in that surgery was going to be impossible because Fu Sheng also had a broken back. After 5 hours in agony, at 3:43am, Shaw's and Asia's brightest movie star had died. He was only 28 years old. His funeral took place on Thursday, July 14th, 1983. His death was celebrated with a state honors funeral. The day of his death, the Hong Kong television programming stopped and showed chain pictures of his life and career. Over 2,000 actors and 30,000 people attended. The amount of attenders and spectators rivaled that of Bruce Lee's funeral a decade earlier. His funeral was organized by the Shaw Brothers committee. His remains were cremated. Fu Sheng left a long lasting legacy in the kung fu film history. With his mischievous good looks, versatility, amazing acting ability and agility, he quickly became a favorite of martial arts fans and luminaries. Fu Sheng's film work is still revered in Hong Kong and he has strong cult following among kung fu fans around the world. Considered Hong Kong's best loved actors and one Shaw Studios best actors ever, Fu Sheng left a wealth of entertainment for all to enjoy. He will always be one of the cinema's most treasured personalities and bonafide legend in kung fu film history. His films and legacy lives on.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0297143","name":"Sheng Fu","nicknames":["Alexander"],"idIMDB":"nm0297143"},"actorId":"nm0297143","character":"Ma Chao-Hsing","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kuan-Chun Chi","urlProfile":"http://www.imdb.com/name/nm0156891","urlPhoto":"","biography":{"dateOfBirth":"14 June 1949","placeOfBirth":" China","birthName":"Wu Dong-wai","height":"6' 3\" (1.91 m)","bio":"Chi Kuan-Chun was one of the top Shaw Brothers stars to have a successful post-Shaws career in the 1970s. Chi began studying martial arts at the age of 12 and after learning for nearly a decade, was chosen to play a stuntman in a Hollywood film. Soon after, he became one of the top talents for Shaw Brothers. Perhaps he was best known for always allying himself with the late Alexander Fu Sheng in a series of period pieces. After leaving Shaw Brothers, Chi went to Taiwan, where he proved to be a top kung fu lead actor, with films like Showdown at Cotton Mill. In the 1990s he retired from films but made a comeback as the villain in the 2003 film Drunken Monkey, reuniting with Gordon Liu and Kar-Leung Lau.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0156891","name":"Kuan-Chun Chi","idIMDB":"nm0156891"},"actorId":"nm0156891","character":"Li Shih-Kai","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fei Meng","urlProfile":"http://www.imdb.com/name/nm0579528","urlPhoto":"","biography":{"dateOfBirth":"1952","placeOfBirth":" Shandong, China","birthName":"An-tung Yang","bio":"Comes from China, debuted in 1971 as the main charactor in King Boxer, and became popular as Fang Shi Yu with his white fan and a brilliant smile.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0579528","name":"Fei Meng","idIMDB":"nm0579528"},"actorId":"nm0579528","character":"Fang Ta-Hung","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lung Wei Wang","urlProfile":"http://www.imdb.com/name/nm0910979","urlPhoto":"","biography":{"dateOfBirth":"14 July 1949","placeOfBirth":" China","bio":"Lung Wei Wang was born on July 14, 1949 in China. He is an actor and director, known for Return to the 36th Chamber (1980), The New Legend of Shaolin (1994) and Master of the Flying Guillotine (1976).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0910979","name":"Lung Wei Wang","idIMDB":"nm0910979"},"actorId":"nm0910979","character":"Ma Fu Yi","urlCharacter":"http://www.imdb.com/character/ch0097374","main":true},{"actorName":"Ka-Yan Leung","urlProfile":"http://www.imdb.com/name/nm0415777","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmVlODgwYmYtNTk3ZS00NGYzLWJkNzAtNjc5MDE1MGQ3OGM5L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 January 1949","placeOfBirth":" Guangdong, China","bio":"Ka-Yan Leung was born on January 20, 1949 in Guangdong, China. He is an actor and director, known for Ip Man 3 (2015), The Man with the Iron Fists (2012) and Warriors Two (1978).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmVlODgwYmYtNTk3ZS00NGYzLWJkNzAtNjc5MDE1MGQ3OGM5L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0415777","name":"Ka-Yan Leung","nicknames":["Beardy"],"idIMDB":"nm0415777"},"actorId":"nm0415777","character":"Chien San","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shao Chun Chang","urlProfile":"http://www.imdb.com/name/nm2463412","urlPhoto":"","biography":{"bio":"Shao Chun Chang is known for his work on 5 Masters of Death (1974), One-Armed Boxer (1972) and Fearless Fighters (1971).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2463412","name":"Shao Chun Chang","idIMDB":"nm2463412"},"actorId":"nm2463412","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yi Kuei Chang","urlProfile":"http://www.imdb.com/name/nm2368412","urlPhoto":"","biography":{"bio":"Yi Kuei Chang is known for his work on A Touch of Zen (1971), Master of the Flying Guillotine (1976) and 5 Masters of Death (1974).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2368412","name":"Yi Kuei Chang","idIMDB":"nm2368412"},"actorId":"nm2368412","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chin Hai Chen","urlProfile":"http://www.imdb.com/name/nm1794912","urlPhoto":"","biography":{"bio":"Chin Hai Chen is an actor, known for Born invincible (1978), Master of the Flying Guillotine (1976) and 5 Masters of Death (1974).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1794912","name":"Chin Hai Chen","idIMDB":"nm1794912"},"actorId":"nm1794912","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shen-Lin Chen","urlProfile":"http://www.imdb.com/name/nm1830165","urlPhoto":"","biography":{"bio":"Shen-Lin Chen is known for his work on Master of the Flying Guillotine (1976), The Killer Meteors (1976) and 5 Masters of Death (1974).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1830165","name":"Shen-Lin Chen","idIMDB":"nm1830165"},"actorId":"nm1830165","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ti-Ko Chen","urlProfile":"http://www.imdb.com/name/nm1507745","urlPhoto":"","biography":{"bio":"Ti-Ko Chen is known for his work on Project A 2 (1987), Miracles - Mr. Canton and Lady Rose (1989) and Ma fung gwai kuen (1979).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1507745","name":"Ti-Ko Chen","idIMDB":"nm1507745"},"actorId":"nm1507745","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yi-Hsiung Chi","urlProfile":"http://www.imdb.com/name/nm1794908","urlPhoto":"","biography":{"bio":"Yi-Hsiung Chi is an actor and director, known for Mad Mission (1982), Shuang la (1980) and Lao shu la gui (1979).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1794908","name":"Yi-Hsiung Chi","idIMDB":"nm1794908"},"actorId":"nm1794908","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tao Chiang","urlProfile":"http://www.imdb.com/name/nm0465062","urlPhoto":"","biography":{"dateOfBirth":"17 June 1942","placeOfBirth":" Taiwan","birthName":"Ting Hsuen-yuan","bio":"Tao Chiang was born on June 17, 1942 in Taiwan as Ting Hsuen-yuan. He is an actor and assistant director, known for Return to the 36th Chamber (1980), My Name Called Bruce (1978) and Super Hero (1979).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0465062","name":"Tao Chiang","idIMDB":"nm0465062"},"actorId":"nm0465062","character":"Chen Wen-yao","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wan Hsi Chin","urlProfile":"http://www.imdb.com/name/nm1532033","urlPhoto":"","biography":{"bio":"Wan Hsi Chin is known for his work on Le Kid face au Lama (1980), Island of Fire (1990) and Fearless Hyena 2 (1983).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1532033","name":"Wan Hsi Chin","idIMDB":"nm1532033"},"actorId":"nm1532033","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0072991","urlIMDB":"http://www.imdb.com/title/tt0072991","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 45 min (105 min) (Hong Kong)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Shawscope"],"printedFilmFormat":["35 mm"]},"rating":"6.8","filmingLocations":[],"rated":"R","awards":[{"award":"Golden Horse Film Festival 1975","titlesAwards":[{"titleAwardOutcome":"Won Golden Horse Award","categories":[{"category":"Best Sound Recording","names":[{"name":"Yung-Hua Wang","id":"nm0911102","role":null}]}]}]}],"votes":"777","type":"Movie","companyCreditsSimple":[{"idCompany":"co0187892","name":"Chang's Film Company"},{"idCompany":"co0128798","name":"Shaw Brothers"}],"keywords":{"keywords":["kung fu classic","violence","bald hero","monastery","buddhist","buddhist temple","bald","buddhist monk","shaolin monk","shaolin temple","shaolin kung fu","fistfight","brawl","fighting style","fight choreography","martial arts training","martial arts","fighting","shaolin"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:39:07"}}