{"data":{"movies":[{"title":"Sullivan's Travels","originalTitle":"","year":"1941","releaseDate":"19420206","directors":[{"name":"Preston Sturges","id":"nm0002545"}],"writers":[{"name":"Preston Sturges","id":"nm0002545"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA2MjYwOTk2Nl5BMl5BanBnXkFtZTgwODE0MDkxMTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Adventure","Comedy","Drama","Romance"],"plot":"Sullivan is a successful, spoiled, and naive director of fluff films, with a heart-o-gold, who decides he wants to make a film about the troubles of the downtrodden poor. Much to the chagrin of his producers, he sets off in tramp's clothing with a single dime in his pocket to experience poverty first-hand, and gets some reality shock.","simplePlot":"A director of escapist films goes on the road as a hobo to learn about life, which gives him a rude awakening.","actors":[{"actorName":"Joel McCrea","urlProfile":"http://www.imdb.com/name/nm0566948","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMjI0NDIyOV5BMl5BanBnXkFtZTYwMzMxMjg2._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1905","placeOfBirth":" South Pasadena, California, USA","birthName":"Joel Albert McCrea","height":"6' 2½\" (1.89 m)","bio":"One of the great stars of American Westerns, and a very popular leading man in non-Westerns as well. He was born and raised in the surroundings of Hollywood and as a boy became interested in the movies that were being made all around. He studied acting at Pomona College and got some stage experience at the Pasadena Community Playhouse, where other future stars such as Randolph Scott, Robert Young, and Victor Mature would also get their first experience. He worked as an extra after graduation from the University of Southern California in 1928 and did some stunt work. In a rare case of an extra being chosen from the crowd to play a major role, McCrea was given a part in The Jazz Age. A contract at MGM followed, and then a better contract at RKO. Will Rogers took a liking to the young man (they shared a love of ranching and roping) and did much to elevate McCrea's career. His wholesome good looks and quiet manner were soon in demand, primarily in romantic dramas and comedies, and he became an increasingly popular leading man. He hoped to concentrate on Westerns, but several years passed before he could convince the studio heads to cast him in one. When he proved successful in that genre, more and more Westerns came his way. But he continued to make a mark in other kinds of pictures, and proved himself particularly adept at the light comedy of Preston Sturges, for whom he made several films. By the late Forties, his concentration focused on Westerns, and he made few non-Westerns thereafter. He was immensely popular in them, and most of them still hold up well today. He and Randolph Scott, whose career strongly resembles McCrea's, came out of retirement to make a classic of the genre, Sam Peckinpah's Ride the High Country (1962). Scott stayed retired thereafter; McCrea made a couple of appearances in small films afterwards, but was primarily content to maintain his life as a gentleman rancher. He was married for fifty-seven years to actress Frances Dee, who survived him.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMjI0NDIyOV5BMl5BanBnXkFtZTYwMzMxMjg2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0566948","name":"Joel McCrea","nicknames":["McFee"],"idIMDB":"nm0566948"},"actorId":"nm0566948","character":"John L. Sullivan","urlCharacter":"http://www.imdb.com/character/ch0021284","main":true},{"actorName":"Veronica Lake","urlProfile":"http://www.imdb.com/name/nm0000043","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMjQ0NTQ3NV5BMl5BanBnXkFtZTYwNTI5MzQ2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 November 1922","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Constance Frances Marie Ockelman","height":"4' 11½\" (1.51 m)","bio":"Veronica Lake was born as Constance Frances Marie Ockleman on November 14, 1922, in Brooklyn, New York. She was the daughter of Constance Charlotta (Trimble) and Harry Eugene Ockelman, who worked for an oil company as a ship employee. Her father was of half German and half Irish descent, and her mother was of Irish ancestry. While still a child, Veronica's parents moved to Florida when she was not quite a year old. By the time she was five, the family had returned to Brooklyn. When Connie was only twelve, tragedy struck when her father died in an explosion on an oil ship. One year later her mother married Anthony Keane and Connie took his last name as her own. In 1934, when her stepfather was diagnosed with tuberculosis, the family moved to Saranac Lake, where Connie Keane enjoyed the outdoor life and flourished in the activities of boating on the lakes, skating, skiing, swimming, biking around Moody Pond and hiking up Mt Baker. The family made their home in 1935 at 1 Watson Place, (now 27 Seneca Street) then they moved to 1 Riverside Drive,(now Lake Kiwassa Road). Both Connie and Anthony benefited from the Adirondack experience and in 1936 the family left the Adirondacks and moved to Miami, FL., however, the memories of those carefree Saranac Lake days would always remain deeply rooted in her mind. Two years later, Connie graduated from high school in Miami. Her natural beauty and charm and a definite talent for acting prompted her mother and step-father to move to Beverly Hills, California, where they enrolled her in the well known Bliss Hayden School of Acting in Hollywood. Connie had previously been diagnosed as a classic schizophrenic and her parents saw acting as a form of treatment for her condition. She showed remarkable abilities and did not have to wait long for a part to come her way. Her first movie was as one of the many coeds in the RKO film, Sorority House (1939) in 1939. It was a minor part, to be sure, but it was a start. Veronica quickly followed up that project with two other films. All Women Have Secrets (1939) and Dancing Co-Ed (1939), both in 1939, were again bit roles for the pretty young woman from the East Coast, but she did not complain. After all, other would-be starlets took a while before they ever received a bit part. Veronica continued her schooling, in 1940, while taking a bit roles in two more films, Young as You Feel (1940) and Forty Little Mothers (1940). Prior to this time, she was still under her natural name of Constance Keane. Now, with a better role in 1941's I Wanted Wings (1941), she was asked to change her name and Veronica Lake was born. Now, instead of playing coeds, she had a decent, speaking part. Veronica felt like an actress. The film was a success and the public loved this bright newcomer. Paramount, the studio she was under contract with, then assigned her to two more films that year, Hold Back the Dawn (1941) and Sullivan's Travels (1941). The latter received good reviews from the always tough film critics. As Ellen Graham, in This Gun for Hire (1942) the following year, Veronica now had top billing. She had paid her dues and was on a roll. The public was enamored with her. In 1943, Veronica starred in only one film. She portrayed Lieutenant Olivia D'Arcy in So Proudly We Hail! (1943) with Claudette Colbert. The film was a box-office smash. It seemed that any film Veronica starred in would be an unquestionable hit. However, her only outing for 1944, The Hour Before the Dawn (1944) would not be well-received by either the public or the critics. As Nazi sympathizer Dora Bruckmann, Veronica's role was dismal at best. Critics disliked her accent immensely because it wasn't true to life. Her acting itself suffered because of the accent. Mediocre films trailed her for all of 1945. It seemed that Veronica was dumped in just about any film to see if it could be salvaged. Hold That Blonde! (1945), Out of This World (1945), and Miss Susie Slagle's (1946) were just a waste of talent for the beautiful blonde. The latter film was a shade better than the previous two. In 1946, Veronica bounced back in The Blue Dahlia (1946) with Howard Da Silva. The film was a hit, but it was the last decent film for Veronica. Paramount continued to put her in pathetic movies. After 1948, Paramount discharged the once prized star and she was out on her own. In 1949, she starred in the Twentieth Century film Slattery's Hurricane (1949). Unfortunately, another weak film. She was not on the big screen again until 1952 when she appeared in Stronghold (1951). By Veronica's own admission, the film \"was a dog.\" From 1952 to 1966, Veronica made television appearances and even tried her hand on the stage. Not a lot of success for her at all. By now alcohol was the order of the day. She was down on her luck and drank heavily. In 1962, Veronica was found living in an old hotel and working as a bartender. She finally returned to the big screen in 1966 in Footsteps in the Snow (1966). Another drought ensued and she appeared on the silver screen for the last time in 1970's Flesh Feast (1970) - a very low budget film. On July 7, 1973, Veronica died of hepatitis in Burlington, Vermont. The beautiful actress with the long blonde hair was dead at the age of 50.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMjQ0NTQ3NV5BMl5BanBnXkFtZTYwNTI5MzQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000043","name":"Veronica Lake","nicknames":["The Peek-a-boo Girl"],"idIMDB":"nm0000043"},"actorId":"nm0000043","character":"The Girl","urlCharacter":"http://www.imdb.com/character/ch0041090","main":true},{"actorName":"Robert Warwick","urlProfile":"http://www.imdb.com/name/nm0913094","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGYwMWJlY2UtMjA4ZS00YzcwLWJlMzQtYjAwY2UzMzNmZDk1XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1878","placeOfBirth":" Sacramento, California, USA","birthName":"Robert Taylor Bien","height":"5' 11½\" (1.82 m)","bio":"A prominent matinée stage and silent-film star with handsome features offset only slightly by a prominent proboscis, Robert Warwick was born and raised in Sacramento, California, as Robert Taylor Bien. The gift of music was instilled at an early age (he sang in his church choir) and he initially prepared for an operatic career. Studying vocally in Paris, he abandoned legit singing for acting after being hired in 1903 to understudy in the Broadway play \"Glad of It\". He grew quickly in stature in such popular stage roles as \"Vronsky\" in \"Anna Karenina\" (1907), and was a strong presence in the musical operettas \"The Kiss Waltz\" (1911) and \"The Princess\" (1912), the latter featuring his first wife, actress Josephine Whittell. With effortless charm, Warwick segued into romantic film roles, playing dashing leads in Alias Jimmy Valentine (1915), The Face in the Moonlight (1915), The Heart of a Hero (1916)--in which he portrayed Revolutionary War hero Nathan Hale--The Mad Lover (1917) and A Girl's Folly (1917). At one point he even formed his own production company, Robert Warwick Film Corp. The company produced four films before Warwick temporarily left Hollywood in 1917 to serve in WWI as an infantry captain. In the 1920s he shifted between Broadway and film leads. His well-modulated voice proved ideal for sound pictures, and he subsequently enjoyed a long career (over 200 films) in grand, authoritative character parts. Among his plethora of movie roles were \"Neptune\" in Night Life of the Gods (1935), \"Col. Gray\" in Shirley Temple's The Little Colonel (1935), \"Sir Francis Knolly\" in Mary of Scotland (1936) and \"Lord Montague\" in the Norma Shearer/Leslie Howard starrer Romeo and Juliet (1936). He also was seen to fine advantage in several of Errol Flynn's rousing costumers such as The Prince and the Pauper (1937), The Adventures of Robin Hood (1938), The Private Lives of Elizabeth and Essex (1939), and The Sea Hawk (1940). A grand, stately gent, he was often seen impersonating high-ranking military officers, dapper businessmen or stern but benevolent father figure types. The legendary Preston Sturges utilized his services, giving him small roles in The Great McGinty (1940), Christmas in July (1940) and The Lady Eve (1941) before handing him a standout part as an avuncular studio mogul in Sullivan's Travels (1941). For the most part, however, Warwick was humbled into playing smaller, serviceable roles in adventures and crime dramas, with many of these characters embracing unyielding traditionalist values. Other exceptions to this rule were his hammy, downtrodden Hollywood actor \"Charlie Waterman\" in In a Lonely Place (1950) and his dying tycoon in While the City Sleeps (1956). Warwick continued performing well into his 80s. Primarily on TV in his twilight years, he could be spotted frequently on such programs as The Twilight Zone (1959), Maverick (1957) and Dr. Kildare (1961). Divorced from his first wife, he survived his second, actress Stella Lattimore (1905-1960), before dying in 1964 following an extended illness. He had one daughter by his first wife; Rosalind, who bore him two grandchildren, and with his second wife another daughter, Betsey, who was a prominent published poet in Los Angeles and was buried next to her father at Holy Cross Cemetary in Los Angeles in 2007.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGYwMWJlY2UtMjA4ZS00YzcwLWJlMzQtYjAwY2UzMzNmZDk1XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0913094","name":"Robert Warwick","idIMDB":"nm0913094"},"actorId":"nm0913094","character":"Mr. LeBrand","urlCharacter":"http://www.imdb.com/character/ch0496216","main":true},{"actorName":"William Demarest","urlProfile":"http://www.imdb.com/name/nm0218131","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA2MjY5NDAxOF5BMl5BanBnXkFtZTcwNjM2MjcwOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1892","placeOfBirth":" St. Paul, Minnesota, USA","birthName":"Carl William Demarest","height":"5' 9½\" (1.77 m)","bio":"Born in St. Paul, Minnesota, William Demarest was a prolific actor in movies and TV, making more than 140 films. Demarest started his acting career in vaudeville and made his way to Broadway. His most famous role was in My Three Sons (1960), replacing a very sick William Frawley. Demarest was nominated for an Academy Award for Best Actor in a Supporting role in the real-life biography, The Jolson Story (1946). He did not win. This was the first and only time Demarest was nominated for any Academy Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA2MjY5NDAxOF5BMl5BanBnXkFtZTcwNjM2MjcwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0218131","name":"William Demarest","idIMDB":"nm0218131"},"actorId":"nm0218131","character":"Mr. Jones","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Franklin Pangborn","urlProfile":"http://www.imdb.com/name/nm0659427","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NTM3MTc3MF5BMl5BanBnXkFtZTgwOTgzODE1MzE@._V1._CR114,136,541,718_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 January 1889","placeOfBirth":" Newark, New Jersey, USA","birthName":"Joseph Franklin Pangborn","height":"5' 10½\" (1.79 m)","bio":"Franklin Pangborn - a name more befitting a fictionalized bank president rather than a great comedic actor - was a singular character actor but little is known of his early years. He spent some time in developing acting talent prior to appearing on Broadway by March of 1911, and would do six plays until mid-1913. He was noticeably absent afterward and corresponding with the early years of World War I. He was in the US Army after America entered the war in 1917. Pangborn did one more play on Broadway in 1924. Interestingly, for someone immediately identified with comedy, Pangborn's roles were for the most part dramatic and included Armand Duval in \"Camille\", a role in a play adaptation of \"Ben Hur\", and two parts in \"Joseph and His Brethren\". Two years later, Pangborn turned to silent films. And although he would play some villains and romantic leads, that droopy pudding-face of his was bound for comedy. In all these early roles from his debut in 1926, his first talkie (On Trial (1928)), and on through most of 1932 (when he made 24 appearances on film), Pangborn was playing comedic roles, many of which were for short films (many by Mack Sennett) where the players usually had no on-screen persona and no billing credit. His many appearances in shorts tapered off and ended through 1935. These roles were quite varied and continued as such into the later 1930s. He played the compromised husband in two Bing Crosby vehicles (1933); no fewer than three photographers, reporters, radio announcers, bartenders, and much more, including a character meant to parody his own name: 'Mr. Pingboom' (Turnabout (1940)). But through the same period he was piling up a lot of clerk, floorwalker, and, perhaps most of all, hotel manager roles. These latter were the basis for Pangborn typed as the straight-laced, nervous minor official or service provider or manager of whatever whose smug self-assurance in his orderly world is sorely tested. The term 'sissy' (so prominent a condemnation from childhood memories) was used in early film (and still used today by some film historians) as a catchall name for a spectrum of rather gentle and nebulous male personalities; a simpering voice of any kind would be an instant label that also implied the taboo of homosexuality. Pangborn is often first on the list of actors noted as typed in this general category with Edward Everett Horton with his dignified but slightly simpering New England drawl a close second. Animator Robert Clampett at Warner Bros. in the late 1940s patterned his Goofy Gophers, Mac and Tosh, with their polite and flowery speech after both men. Pangborn had a mellow, lyrical voice which he could ramp up to a staccato, rapid-fire rhythm when perturbed. Indeed, the face and the voice fit well with characters of convention and control, as well as the fastidious to the point of being another slang term of many faces: 'prissy'. And maybe that does not include effeminate - he was not quite that - though the term is indelibly tagged to the character type. His characters were the sort of proper and snobby figures who the easygoing American public would find suspicious - and thus all the funnier on screen when they get their comeuppance. Yet Pangborn never implied 'gay' in his portrayals despite all the gender revisionism of today that might reinterpret his work as such. In real life, people are more complex; on the mainstream screen - as opposed to the shadowy blue one - of the 1930s and 40s, characters were more generally defined within usual convention. By the later 1930s, Pangborn had perfected a wonderful sense of timing of demeanor, manner, and voice to fit the control freak who is gradually dragged into his worst nightmare of relative chaos by hapless situation. By this time his characterizations were such a fixture of guaranteed laughs that the movie-going public expected to see him. Pangborn was in great demand to do what he did best. And having already worked from the silent era with great stars and directors, he continued to do so. W.C. Fields was a great fan of him and used him in several movies. He was a constant in smart comedy from Frank Capra and Gregory La Cava to the more extreme screwball comedies of Preston Sturges, though frequently upstaged with such a company of funny men as Sturges gathered around him. The Pangborn progression from very funny to uproarious is seen evolved, for example, from De Cava's My Man Godfrey (1936) to Sturges's Hail the Conquering Hero (1944). In the first he is the volunteer swell who coordinates store-keeping for the scavenger hunt of his fellow - if downright silly - affluent crust of New York society. As the flow of items brought to him for registering turns into a flood (including a live goat kid), his demeanor, mannerisms, and vocal speed display increasing irritation. Head spinning, he is in defensive mode as he fends off shouting, grabbing participants. The role perhaps was his defining moment as established celebrity comedian. In Sturges's movie, and Pangborn appeared in most of his best efforts, he is the committee chairman of the reception for false hero Eddie Bracken, trying to coordinate festivities and caught in a literal battle of bands at the beginning of the film. Converged upon by various hokey town bands who all want to play the featured pieces, Pangborn attempts order but is methodically carried away as people out of the blue arrive to suggest other songs, and the bands continue to assail him with arguments, and finally all play all the songs - and all at once - to prove the most deserving. It is musical chaos with Pangborn finally reduced to desperate blasts on a whistle and jumping up and down, yelling \"Not yet! Not yet!\" It is one of the actor's finest pieces. Yet Pangborn's usual stock of characters could fit drama as well. Actually, in \"Hero\", his coordinator also has some straight scenes as well. In Now, Voyager (1942) as the cruise tourist director, his only problem is that Bette Davis has not arrived on deck to be partnered for the land touring of Rio. As an accomplished stage actor, he did miss the boards. Friend of Edward Horton, he was able to exchange his quirky screen characters for dramatic ones, participating in Horton's Los Angeles-based Majestic Theatre productions. But times changed for Pangborn's specialties. Movies were more diverse and updated as the 1950s ensued. But he was immediately adaptable to the small screen which would re-introduce him. He was right at home as a guest star on TV comedy shows, playing his beloved characters as cameo celebrations of his matter-of-fact stardom. There were a handful of film roles in his last decade with perhaps the overambitious and black-and-white dull but star-studded The Story of Mankind (1957) a bit of a showcase. Also in 1957 he had the singular distinction of being honored as guest announcer - a familiar enough role - and first guest star on the premiere of the \"Tonight Show\" with its first host Jack Paar. To pass away after surgery seems such a disordered way to go for one such as Franklin Pangborn whose on-screen characters struggled for order above all else. There is no order in the frailty of life by definition, but Pangborn's legacy, rich in comedic gems, has and surely will continue to endure.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NTM3MTc3MF5BMl5BanBnXkFtZTgwOTgzODE1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0659427","name":"Franklin Pangborn","idIMDB":"nm0659427"},"actorId":"nm0659427","character":"Mr. Casalsis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Porter Hall","urlProfile":"http://www.imdb.com/name/nm0356004","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxOTQ4YTktN2YxNS00NjJmLWFlZWItOTBlMjEzZmM3MzdjXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 September 1888","placeOfBirth":" Cincinnati, Ohio, USA","birthName":"Clifford Porter Hall","height":"5' 7\" (1.7 m)","bio":"For over two decades, Porter Hall made a career out of playing villains and pompous, unpleasant people. His movie career was not a mirror of his real life, however. Mr. Hall was well known as a generous and outgoing person who was well-liked by almost everybody he knew. It is ironic that the role he is most often seen in today is that of an atheist in Going My Way (1944) - ironic because Hall was a deacon in his church. Hall, who didn't make his first movie until he was 43, remained active until his death in 1953.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxOTQ4YTktN2YxNS00NjJmLWFlZWItOTBlMjEzZmM3MzdjXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0356004","name":"Porter Hall","idIMDB":"nm0356004"},"actorId":"nm0356004","character":"Mr. Hadrian","urlCharacter":"http://www.imdb.com/character/ch0539253","main":true},{"actorName":"Byron Foulger","urlProfile":"http://www.imdb.com/name/nm0288304","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1M2E0Y2ItOGU1NC00OWVkLTliMTUtNjhkOTdlZDYxMjMyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 August 1899","placeOfBirth":" Ogden, Utah, USA","birthName":"Byron Kay Foulger","bio":"One of those wonderfully busy character actors whose face is familiar if not his name, mild-mannered actor Byron Foulger began performing with community theater, and stock and repertory companies after graduating from the University of Utah. He met his future wife, character actress Dorothy Adams, in one of these companies. The marriage lasted nearly five decades and ended only with his death. Making his Broadway debut in a 1920 production of \"Medea\" that featured Moroni Olsen as Jason (of the Argonauts), and went on to appear in several other Olsen Broadway productions and in close succession (including \"The Trial of Joan of Arc,\" \"Mr. Faust\" and \"Candida\"). While touring the country with Olsen's stock company, he ended up at the Pasadena Playhouse where he both acted and directed. Thereafter he and wife Dorothy decided to settle in Los Angeles. Together the acting couple tried to stake a claim for themselves in 30s and 40s Hollywood films. Both succeeded, appearing in hundreds of film parts, both together and apart, albeit in small and often unbilled bits. A man of meek, nervous countenance, Foulger's short stature and squinty stare could be used for playing both humble and shady fellows. In the 1940s, the actor became a part of Preston Sturges' company of players, appearing in five of his classic films -- The Great McGinty (1940), Sullivan's Travels (1941), The Palm Beach Story (1942), The Miracle of Morgan's Creek (1944) and The Great Moment (1944). Although predominantly employed as an owlish storekeeper, mortician, professor, or bank teller, his better parts had darker intentions. He was exceptional as weaselly, mealy-mouthed, whining henchmen who inevitably showed their yellow streak by the film's end. The character actor eased into TV roles in the 1950s and '60s, displaying a comedy side in many folksy, rural sitcoms. His final regular TV role was as train conductor Wendell Gibbs in the final years of the Petticoat Junction (1963) series. The father of actress Rachel Ames, Foulger died of a heart ailment on April 4, 1970.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1M2E0Y2ItOGU1NC00OWVkLTliMTUtNjhkOTdlZDYxMjMyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0288304","name":"Byron Foulger","idIMDB":"nm0288304"},"actorId":"nm0288304","character":"Mr. Valdelle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Margaret Hayes","urlProfile":"http://www.imdb.com/name/nm0371135","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMDk0YWUtMmVmNi00ZTI1LWIzOGYtZmQ3YzQ2ZmZlMDkxXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 December 1916","placeOfBirth":" Baltimore, Maryland, USA","birthName":"Florette Regina Ottenheimer","height":"5' 4\" (1.63 m)","bio":"Auburn-haired Margaret 'Maggie' Hayes made her Broadway debut in 1940 and was signed by Paramount the following year. She generally played second leads, often as 'the other woman', but was never quite fulfilled in her profession. Instead, she pursued diverse other career paths outside of acting, both in between performing, and after her retirement in 1962: as fashion designer, model, owner of a boutique in Palm Beach and designing/selling jewelry in New York. She even worked for a while as a public relations executive for luxury goods department store Bergdorf Goodman on Fifth Avenue in Manhattan. In the late 40's, she became fashion editor for 'Life Magazine', before returning to the New York stage and acting in television where she had some of her best roles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMDk0YWUtMmVmNi00ZTI1LWIzOGYtZmQ3YzQ2ZmZlMDkxXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0371135","name":"Margaret Hayes","nicknames":["Dana Edwards","Florette DeBussy"],"idIMDB":"nm0371135"},"actorId":"nm0371135","character":"Secretary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Greig","urlProfile":"http://www.imdb.com/name/nm0340063","urlPhoto":"","biography":{"dateOfBirth":"27 December 1879","placeOfBirth":" Melbourne, Victoria, Australia","bio":"Robert Greig was born on December 27, 1879 in Melbourne, Victoria, Australia. He was an actor, known for Sullivan's Travels (1941), The Lady Eve (1941) and Trouble in Paradise (1932). He was married to Beatrice Denver Holloway. He died on June 27, 1958 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0340063","name":"Robert Greig","idIMDB":"nm0340063"},"actorId":"nm0340063","character":"Sullivan's Butler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eric Blore","urlProfile":"http://www.imdb.com/name/nm0089314","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWVjODQ4YWQtZjg4OC00NDQ1LThkNzktNzIyNzYzZmNiMzQ1XkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 December 1887","placeOfBirth":" London, England, UK","height":"5' 8\" (1.73 m)","bio":"Born in London, Eric Blore came out of college and started his working life as an insurance agent. But while touring in Australia he took an interest in the stage and theater. He gave up his insurance job and turned to acting after returning to England. With his elfish long, straight nose, squint-eyed demeanor and a crisp voice, he successfully began a career starring in many shows and revues, focusing on traditional British comedy. Encouraged further, in 1923 he came to New York and was almost immediately using his London stage experience on Broadway. Though there were a few dramatic parts, he inevitably played comic roles in musical comedies and revues (in some of which he also received billing as a lyricist) regularly from 1923 to 1933. He would return once again some ten years later to take on multiple roles for Ziegfeld Follies of 1943. No stranger to film, as early as 1920 he had tried his hand in British cinema. And in 1926 he did the US silent version of The Great Gatsby (1926) that starred Warner Baxter. His familiar role as a head waiter began with his first Fred Astaire/Ginger Rogers film, Flying Down to Rio (1933). With a foot still on Broadway, in 1933 he played the waiter in the stage version of The Gay Divorcee and was then tapped to reprise the role in the film version with Fred and Ginger. Blore had been perfecting his basic comic characters since his London days -- a leering English gentlemen, brusque/wise-acre butler or waiter or other service provider -- with a lockjawed British accent. These characters accompanied by Blore's flawlessly timed delivery were thoroughly applicable and effective as he moved permanently to Hollywood character acting. He played a fair spectrum of other roles, even in a few rare dramas, such as the adventure The Soldier and the Lady (1937) and Island of Lost Men (1939). Blore was very busy with movies from 1934 through most of the 1940s. He appeared in five of the nine Fred and Ginger dance musicals. Some of his best mugging and scripted lines were in Top Hat (1935) and Shall We Dance (1937) of that series. He was also cast very effectively as valet/butler Jamison in the screen adaptations of the Wolfe Kaufman Lone Wolf mystery novel series. There were eleven films between 1940 and 1947, with all but the last three starring the dashing, sonorous-voiced Warren William (who had a greater profile than 'The Great Profile', 'John Barrymore' ) as Michael Lanyard. This was a popular series with first-rate scripts and good production values to keep the public coming back for more. Blore was also invited into the company of stock players ruled over by zany comedy director Preston Sturges. Though Blore only did two films for Sturges, his role in the first of these, The Lady Eve (1941), was a Blore tour de force. Playing the suave confidence man, Pearly, to his old bunko acquaintances Barbara Stanwyck and Charles Coburn, he took the role of pseudo-wealthy Sir Alfred McGlennan Keith out to fleece the local American business gentry. His scene with a gullible Henry Fonda taking in Sir Alfred's concocted story of Stanwyck's being a twin daughter of the lady of the manor by way of her coachman is a delight, punctuated with Blore interrupting perplexed Fonda's questions with a loud shhhhhhh of silence at each. Inevitably, the parts started to become less frequent. Several of Blore's 1940s movies were with lesser known up-and-comers or older stars such as himself. Still, he enjoyed a variety of roles, including the opportunity of animation immortality when Disney chose him for the voice of Mr. Toad in the classic short The Wind in the Willows (1949). But for two widely spaced appearances, Blore essentially retired by 1955. And as sometimes is the case when personalities move into obscurity, their deaths are prematurely announced. Such was the case with Blore when the New Yorker journalist Kenneth Tynan reported him as having already passed on. Blore's lawyer raised a flurry, as did the editor of the New Yorker, who claimed the periodical had never had to print a retraction. The night before the highly profiled retraction appeared, Blore indeed passed away. And the next morning the New Yorker was the only publication with the wrong information. It seems likely Blore would have been particularly tickled with the irony of this last comedic bit in honor of his passing.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWVjODQ4YWQtZjg4OC00NDQ1LThkNzktNzIyNzYzZmNiMzQ1XkEyXkFqcGdeQXVyMjUxODE0MDY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0089314","name":"Eric Blore","idIMDB":"nm0089314"},"actorId":"nm0089314","character":"Sullivan's Valet","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Torben Meyer","urlProfile":"http://www.imdb.com/name/nm0583395","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE2OGEyNzktZTVjZS00NGEwLTk2NWQtNWU0NDE3NmZhMDljL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 December 1884","placeOfBirth":" Århus, Denmark","birthName":"Torben Emil Meyer","bio":"Torben Meyer was born on December 1, 1884 in Århus, Denmark as Torben Emil Meyer. He was an actor, known for Judgment at Nuremberg (1961), Sullivan's Travels (1941) and The Palm Beach Story (1942). He died on May 22, 1975 in Hollywood, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE2OGEyNzktZTVjZS00NGEwLTk2NWQtNWU0NDE3NmZhMDljL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0583395","name":"Torben Meyer","idIMDB":"nm0583395"},"actorId":"nm0583395","character":"The Doctor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victor Potel","urlProfile":"http://www.imdb.com/name/nm0693055","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjRmNmE4MDMtMTAwYS00N2ZlLTlmZjAtY2MxZTg2YjFkNTM4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 October 1889","placeOfBirth":" Lafayette, Indiana, USA","height":"6' 1\" (1.85 m)","bio":"Victor Potel was born in Lafayette, Indiana, in 1889. His first film was in 1910, for Essanay Film Manufacturing Company in Chicago. Potel worked for Essanay in most of the Broncho Billy series, as well as playing a character called \"Slippery Sam\" in almost 80 movies as well as Universal Pictures' \"Snakeville\" series. He moved to Universal in 1928 to make Melody of Love (1928) and worked steadily, playing small and sometimes uncredited bit parts, primarily comic roles due to his height and awkward look. Potel also wrote and directed. In 1935 he provided continuity and dialogue for several films. He became part of Preston Sturges' stock of character actors, appearing in nine films written and directed by Sturges. Potel work until his death on 8 March 1947, just after finishing playing \"Barfly\" in Relentless (1948).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjRmNmE4MDMtMTAwYS00N2ZlLTlmZjAtY2MxZTg2YjFkNTM4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0693055","name":"Victor Potel","idIMDB":"nm0693055"},"actorId":"nm0693055","character":"Cameraman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Webb","urlProfile":"http://www.imdb.com/name/nm0916253","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2QyOWYyYjEtOGNkNC00N2MwLThmMmQtYjExMTZiZTFhMjI0XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1915","placeOfBirth":" Bloomington, Illinois, USA","birthName":"John Richard Webb","height":"6' 1½\" (1.87 m)","bio":"Richard Webb was born on September 9, 1915 in Bloomington, Illinois, USA as John Richard Webb. He was an actor, known for Captain Midnight (1954), Border Patrol (1959) and Out of the Past (1947). He was married to Florence and Elizabeth Sterns. He died on June 10, 1993 in Van Nuys, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2QyOWYyYjEtOGNkNC00N2MwLThmMmQtYjExMTZiZTFhMjI0XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0916253","name":"Richard Webb","idIMDB":"nm0916253"},"actorId":"nm0916253","character":"Radio Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles R. Moore","urlProfile":"http://www.imdb.com/name/nm0601023","urlPhoto":"","biography":{"dateOfBirth":"23 April 1893","placeOfBirth":" Chicago, Illinois, USA","birthName":"Charles Randolph Moore","bio":"Charles R. Moore was born on April 23, 1893 in Chicago, Illinois, USA as Charles Randolph Moore. He was an actor, known for Sullivan's Travels (1941), The Little Foxes (1941) and The Palm Beach Story (1942). He died on July 20, 1947 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0601023","name":"Charles R. Moore","idIMDB":"nm0601023"},"actorId":"nm0601023","character":"Colored Chef","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Almira Sessions","urlProfile":"http://www.imdb.com/name/nm0785929","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDBiZGNhZjItZDJkOS00ODYwLTg2ODEtOWIzZDNkMjFhN2ZlL2ltYWdlXkEyXkFqcGdeQXVyMzAwOTU1MTk@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1888","placeOfBirth":" Washington, District of Columbia, USA","bio":"A member of a very socially prominent Washington family, Sessions played vaudeville, radio, television and film for sixty years. Sessions made her debut in 1909 in a comic opera. She has appeared over 500 times in movies and on television. Session sang comic songs in cabarets before going to New York to act on the stage. In 1940, she went to Hollywood to appear on Bob Hope's radio show and made her West Coast film debut that same year, having already appeared in numerous films on the East Coast during the preceding decade, usually playing bit parts as aunts, landladies, gossips and the like; Sessions retired from films in 1971.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDBiZGNhZjItZDJkOS00ODYwLTg2ODEtOWIzZDNkMjFhN2ZlL2ltYWdlXkEyXkFqcGdeQXVyMzAwOTU1MTk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0785929","name":"Almira Sessions","idIMDB":"nm0785929"},"actorId":"nm0785929","character":"Ursula","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0034240","urlIMDB":"http://www.imdb.com/title/tt0034240","business":{"budget":{"money":"$689,665","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":"22","month":"07","year":"1941","remarks":null},"filmingDates":null,"copyrightHolder":"approved MCMXLI by Paramount Pictures, Inc. (on print); © Paramount Pictures, Inc.; 4 December 1941; LP11049 (in copyright registry)"},"technical":{"runtime":["1 hr 30 min (90 min)","1 hr 25 min (85 min) (TV premiere) (West Germany)"],"soundMix":["Mono (Western Electric Mirrophonic Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["2,476.8 m (9 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"8.1","filmingLocations":[{"location":"Paramount Studios - 5555 Melrose Avenue, Hollywood, Los Angeles, California, USA"}],"rated":"NOT RATED","awards":[{"award":"National Board of Review, USA 1942","titlesAwards":[{"titleAwardOutcome":"Won NBR Award","categories":[{"category":"Top Ten Films","names":[]}]}]},{"award":"National Film Preservation Board, USA 1990","titlesAwards":[{"titleAwardOutcome":"Won National Film Registry","categories":[{"category":"","names":[]}]}]}],"votes":"19,157","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["bindle stick","filmmaking","director","actress","hobo","tramp","on the road","poverty","police","money","dime","car","train","kindness","hitchhiking","labor camp","money falling through the air","two word title","road movie","1940s","hanging up without saying goodbye","character's point of view camera shot","new york city","manhattan new york city","social commentary","radio city music hall manhattan new york city","identification","world war two","wrongful conviction","wrongful arrest","woman dressed as man","whistle","wealth","water","water ladle","watching a movie","wallpaper","wall phone","tying bedsheets","truck","trespassing","transient","train ticket","tombstone","tobacco spit","ticket agent","throwing a rock","thief","theft","theatre audience","telephone call","teenage boy","tearing pants on a nail","tank","sweat box","swamp","suicide","suffering","stumbling over noisy garbage cans","studio boss","stanley steamer","song","socialist realism","sleeping","slapstick comedy","singing","singer","shovel","shoes","sex","serving tray","search","screwball comedy","sandwich board","sandbag","rowboat","rock","robbery","road trip","rifle","revival meeting","resisting arrest","reference to mary martin","reference to mae west","reference to lady godiva","reference to the keystone kops","reference to jack benny","reference to hopalong cassidy","reference to frank capra","reference to ernst lubitsch","reference to eddie rochester anderson","reference to bob hope","reference to bing crosby","reckless driving","railroad yard","pushed into a swimming pool","pulled into a swimming pool","portrait","policeman","reference to pluto the dog","pittsburgh pennsylvania","organ","organist","oil can","newspaper","mud","movie extra","mourning","motorcycle","montage","missing","misery","mirror","reference to mickey mouse","marital separation","lying in wait","lunch counter","limousine","leg iron","lawyer","laughter","lantern","labor movement","knocked unconscious","killed by a train","judge","jeep","jail cell","id card","hymn","husband wife relationship","hunger","horse and wagon","homemade car","hollywood california","hog odor","hitchhiker","hit on the head","helmet","headline","headache","head caught in venetian blinds","hay","hard luck","handcuffs","ham and eggs","hair brush","gun","guard","grief","greed","grave","goat","girdle","freightyard","food","following","flypaper","flowers","flea","flash camera","film set","film projector","film director","fight","fight on moving train","feather duster","false confession","false confession to murder","false accusation","falling into water barrel","falling into swimming pool","falling from train","equality","driver's license","drama filmmaking","doughnut","dormitory","dog","divorce","disguise","dining hall","crying baby","cross dressing","crashing into haystack","court","courtroom","communist","comedy filmmaking","coffee","climbing through window","cigarette smoking","cigar smoking","chopping wood","choking","chicago illinois","check","chase","charity","chained to a bed","caricature","capitalism","campfire","camera","business card","bum","breaking lamp over head","boxcar","blurry vision","blood","black preacher","black minister","black congregation","black american","binoculars","billy club","bicarbonate of soda","bed","beating","bathrobe","bare feet","bare chested male","barbecue","audience distraction","atomizer","assault and battery","arrest","animated sequence","$5 bill","writer director","riding the rails","shotgun","nevada","meta film","film within a film","california","trial","soup kitchen","social experiment","sneeze","sister sister relationship","shower","screening room","satire","revival mission","recreational vehicle","publicist","presumed dead","police chase","photograph","naivety","mugging","movie theatre","movie studio","motorcycle cop","motion picture executive","morgue","mansion","los angeles california","las vegas nevada","kansas city missouri","jumping from train","jail","income tax","homelessness","homeless shelter","hit by a train","great depression","generosity","freight train","flirting","fast motion scene","diner","convertible","common cold","class differences","child drives car","cemetery","car chase","bigamy","assault","airplane","swimming pool","photographer","mistaken identity","african american","prison trustee","chain gang","butler","impersonation","auto theft","amnesia","cross country","hard labor","church","valet","shantytown","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:29:30"}}