{"data":{"movies":[{"title":"Private Hell 36","originalTitle":"","year":"1954","releaseDate":"19540903","directors":[{"name":"Don Siegel","id":"nm0796923"}],"writers":[{"name":"Collier Young","id":"nm0949418"},{"name":"Ida Lupino","id":"nm0526946"}],"runtime":"81 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmU0NzBlMjQtODQzZC00ZjRmLWJkMzMtZGU2YjFlNzIwMmQ3XkEyXkFqcGdeQXVyMjUxODE0MDY@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama","Film-Noir"],"plot":"Two detectives are investigating a robbery in which $300,000 was taken. Their investigation leads them to the main player and they find the cash, but one of them has meanwhile fallen hard for a woman with expensive tastes, and though he desperately wants to keep her, he knows that a cop's salary isn't going to be enough for her.","simplePlot":"When 2 detectives steal $80,000 from a dead robber, one of them suffers from a guilty conscience which could lead to murder.","actors":[{"actorName":"Ida Lupino","urlProfile":"http://www.imdb.com/name/nm0526946","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3OTk1MTgwMl5BMl5BanBnXkFtZTYwMTQyNTU2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1918","placeOfBirth":" Camberwell, London, England, UK","height":"5' 4\" (1.63 m)","bio":"Ida was born in London to a show business family. In 1933, her mother brought Ida with her to an audition and Ida got the part her mother wanted. The picture was Her First Affaire (1932). Ida, a bleached blonde, came to Hollywood in 1934 and played small and insignificant parts. Peter Ibbetson (1935) was one of her few noteworthy movies and it was not until The Light That Failed (1939) that she got a chance to get better parts. In most of her movies, she was cast as the hard, but sympathetic woman from the wrong side of the tracks. In The Sea Wolf (1941) and High Sierra (1941), she played the part magnificently. It has been said that no one could do hard-luck dames the way Lupino could do them. She played tough, knowing characters who held their own against some of the biggest leading men of the day - Humphrey Bogart, Ronald Colman, John Garfield and Edward G. Robinson. She made a handful of films during the forties playing different characters ranging from Pillow to Post (1945), where she played a traveling saleswoman to the tough nightclub singer in The Man I Love (1947). But good roles for women were hard to get and there were many young actresses and established stars competing for those roles. She left Warner Brothers in 1947 and became a freelance actress. When better roles did not materialize, Ida stepped behind the camera as a director, writer and producer. Her first directing job came when director Elmer Clifton fell ill on a script that she co-wrote Not Wanted (1949). Ida had joked that as an actress, she was the poor man's Bette Davis. Now, she said that as a director, she became the poor man's Don Siegel. The films that she wrote, or directed, or appeared in during the fifties were mostly inexpensive melodramas. She later turned to Television where she directed episodes in shows such as The Untouchables (1959) and The Fugitive (1963). In the seventies, she did guest appearances on various television show and small parts in a few movies.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3OTk1MTgwMl5BMl5BanBnXkFtZTYwMTQyNTU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0526946","name":"Ida Lupino","nicknames":["Little Scout"],"idIMDB":"nm0526946"},"actorId":"nm0526946","character":"Lilli Marlowe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steve Cochran","urlProfile":"http://www.imdb.com/name/nm0168215","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGZmZGEwNTItZGJhYy00OTgyLWJiMzYtYzk1OGI3NGZlMzFmXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1917","placeOfBirth":" Eureka, California, USA","birthName":"Robert Alexander Cochran","height":"6' (1.83 m)","bio":"Born Robert Alexander Cochran, son of a California lumberman, he worked mostly in the theatre before landing a contract with Samuel Goldwyn in 1945. His debut was Wonder Man (1945) with Virginia Mayo and Danny Kaye. From 1949 to 1952, he was signed to Warner Brothers, then started up his own production company. In 1965 he sailed off in his yacht to Guatemala to look for suitable filming locations, but died of a lung infection before reaching land.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGZmZGEwNTItZGJhYy00OTgyLWJiMzYtYzk1OGI3NGZlMzFmXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0168215","name":"Steve Cochran","idIMDB":"nm0168215"},"actorId":"nm0168215","character":"Cal Bruner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Howard Duff","urlProfile":"http://www.imdb.com/name/nm0003318","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzNjIwMjQyMV5BMl5BanBnXkFtZTcwMjkwNTUxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 November 1913","placeOfBirth":" Bremerton, Washington, USA","birthName":"Howard Green Duff","height":"6' (1.83 m)","bio":"Tough, virile, wavy-haired and ruggedly handsome with trademark forlorn-looking brows that added an intriguing touch of vulnerability to his hard outer core, actor Howard Duff and his wife-at-the-time, actress Ida Lupino, were one of Hollywood's premiere film couples during the 1950s \"Golden Age\". Prior to that, Duff had relationships with a number of the cinema's most dazzling leading ladies, including Ava Gardner (just prior to her marriage to musician Artie Shaw) and Gloria DeHaven. Duff's talent first manifested itself on radio as Dashiell Hammett's popular private eye \"Sam Spade\" (1946-1950), and eventually extended to include stage, film and TV. While never considered a top-tier movie star and, despite his obvious prowess, never considered for any acting awards, Howard Duff was an undeniably strong good guy and potent heavy but perhaps lacked the requisite charisma or profile to move into the ranks of a Burt Lancaster, Kirk Douglas or Robert Mitchum. His career spanned over four decades. His full name was Howard Green Duff and he was born in Bremerton, Washington on November 24, 1913. Growing up in and around the Seattle area, he attended Roosevelt High School where he played basketball. It was here that he also found an outlet acting in school plays and, following graduation, studied drama. He eventually became an acting member of the Repertory Playhouse in Seattle. Military service interrupted his early career and he served with the U.S. Army Air Force's radio service from 1941 to 1945. Upon his discharge, he returned to his acting pursuits and won the role of \"Sam Spade\" on NBC Radio in the role Humphrey Bogart made famous in The Maltese Falcon (1941). Lurene Tuttle played his altruistic secretary \"Effie\" on the series. He eventually left the program when his film career settled in and Stephen Dunne took over the radio voice of the detective in 1950 for its final season. Duff's post-war movie career started completely on the right foot at Universal with the hard-hitting film noir Brute Force (1947), in which he received good notices as an ill-fated cellmate to Burt Lancaster, Charles Bickford and others. Quite well-known for his radio voice by this time, he was given special billing in the movie's credits as \"Radio's Sam Spade\". This was followed by equally vital and volatile performances in the prescient semi-documentary-styled police drama The Naked City (1948) and in Arthur Miller's taut family drama All My Sons (1948) starring Lancaster, again, and Edward G. Robinson. After such a strong showing, Howard career went into a period of moviemaking in which his films were more noted for its entertainment and rousing action than as character-driven pieces. A number of them were routine westerns that paired him opposite some of Hollywood's loveliest ladies: Red Canyon (1949) with Ann Blyth, Calamity Jane and Sam Bass (1949) with Yvonne De Carlo and The Lady from Texas (1951) with Mona Freeman. Other adventure-oriented flicks that more or less came and went included Spaceways (1953), Tanganyika (1954), The Yellow Mountain (1954), Flame of the Islands (1956), Blackjack Ketchum, Desperado (1956) (title role), The Broken Star (1956) and Sierra Stranger (1957). Howard also began appearing infrequently on the stage in the early 1950s with such productions as \"Season in the Sun\" (1952) and \"Anniversary Waltz\" (1954). Those films that rose above the standard included gritty top-billed roles in Johnny Stool Pigeon (1949), Illegal Entry (1949), Shakedown (1950), Spy Hunt (1950) and Woman in Hiding (1950), the last a film noir which paired him with Ida Lupino for the first time. Here, he plays the hero who saves Lupino from a murdering husband (Stephen McNally). In 1951, he married Ms. Lupino, already a well-established star at Warner Bros., who was coming into her own recently as a director. The couple had one daughter, Bridget Duff, born in 1952. Lupino and Duff co-starred in four hard-boiled film dramas during the 1950s -- Jennifer (1953), Private Hell 36 (1954), Women's Prison (1955) and While the City Sleeps (1956). The demise of the studio-guided contract system had an effect on Howard's film career and offers started drying up in the late 1950s. Fortunately, he found just as wide an appeal on TV, appearing in a number of dramatic showcases for Science Fiction Theatre (1955), Lux Video Theatre (1950) and Climax! (1954). And, in a change of pace, the married couple decided to go for laughs by starring together in the TV series Mr. Adams and Eve (1957). Here, they played gregarious husband-and-wife film stars \"Howard Adams\" and \"Eve Drake\". Many of the scripts, though broadly exaggerated for comic effect, were reportedly based on a few of their own real-life experiences. They also guest-starred in an entertaining hour-long episode of the The Lucy-Desi Comedy Hour (1957) in 1959 with the two couples inadvertently booked at the same vacant lodge, together. The show ends up a battle-of-the sexes, free-for-all with the two gals scheming to add a little romance to what has essentially become a fishing vacation for the guys. The 1960s bore more fruit on TV than in film. Sans Lupino, Duff went solo as nightclub owner \"Willie Dante\" in the tongue-in-cheek adventure series Dante (1960), which lasted less than a season. A few years later, the veteran co-starred with handsome rookie Dennis Cole in what is perhaps his best-remembered series, the police drama The Felony Squad (1966), which was filmed in and around Los Angeles. Duff directed one of those episodes, having directed several episodes of the silly sitcom Camp Runamuck (1965), a year or so earlier. In between series work were guest assignments on such popular primetime shows as Bonanza (1959), The Twilight Zone (1959), Burke's Law (1963) and Combat! (1962). The marriage of Ida and Howard did not last, however, and the famous married couple separated in 1966 after 15 years of marriage. Ida and Howard didn't officially divorce, however, until 1984. Howard later married a non-professional, Judy Jenkinson, who survived him. While much of Howard's work in later years was standard, if unmemorable, every now and then he would demonstrate the fine talent he was. A couple of his better film performances came as a sex-minded, booze-swilling relative in A Wedding (1978) and as Dustin Hoffman's attorney in the Oscar-winning drama Kramer vs. Kramer (1979). He also enjoyed a villainous role in the short-lived series Flamingo Road (1980) and had a lengthy stint on Knots Landing (1979) during the 1984-1985 season. Duff died at age 76 of a heart attack, on July 8, 1990, in Santa Barbara, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzNjIwMjQyMV5BMl5BanBnXkFtZTcwMjkwNTUxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003318","name":"Howard Duff","idIMDB":"nm0003318"},"actorId":"nm0003318","character":"Jack Farnham","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dean Jagger","urlProfile":"http://www.imdb.com/name/nm0415591","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1NzkxNDQ4MF5BMl5BanBnXkFtZTcwMzg0MjIyOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 November 1903","placeOfBirth":" Columbus Grove, Ohio, USA","birthName":"Ira Dean Jagger","height":"6' 2\" (1.88 m)","bio":"Dean Jagger was born in Lima, Ohio, on November 7, 1903. He dropped out of high school twice before finally graduating from Wabash College. Working first as a school teacher, he soon became interested in acting and enrolled at Chicago's \"Lyceum Art Conservatory\". Mr. Jagger made his first movie and only silent film, The Woman from Hell (1929) in 1929, starring Mary Astor. During 1929 he also appeared in the film Handcuffed (1929). He quickly found his niche as a character actor and the highlight of his career was winning an Oscar for \"Best Supporting Actor,\" in the 1949 movie Twelve O'Clock High (1949). Dean played Principal Albert Vane on TV for the 1963-1964 season of Mr. Novak (1963). Dean Jagger died in Santa Monica, California, on February 5, 1991.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1NzkxNDQ4MF5BMl5BanBnXkFtZTcwMzg0MjIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0415591","name":"Dean Jagger","idIMDB":"nm0415591"},"actorId":"nm0415591","character":"Capt. Michaels","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dorothy Malone","urlProfile":"http://www.imdb.com/name/nm0540416","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMzY2OTUyNV5BMl5BanBnXkFtZTcwMTg4MjM5OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 1924","placeOfBirth":" Chicago, Illinois, USA","birthName":"Dorothy Eloise Maloney","height":"5' 6\" (1.68 m)","bio":"The blonde, sultry, dreamy-eyed beauty of Dorothy Malone, who was born in Chicago, Illinois, took some time before it made an impact with American filmgoing audiences. But once she did, she played it for all it was worth in her one chance Academy Award-winning \"bad girl\" performance, a role quite unlike the classy and straight-laced lady herself. Dorothy Eloise Maloney was raised in Dallas, Texas, where her heart and soul remains. She was one of five children born to an accountant father. Two older sisters died of polio. Attending Ursuline Convent and Highland Park High School, she was quite popular (as \"School Favorite\"). She was also a noted female athlete while there and won several awards for swimming and horseback riding. Following graduation, she studied at Southern Methodist University with the intent of becoming a nurse, but a role in the college play \"Starbound\" happened to catch the eye of an RKO talent scout and she was offered a Hollywood contract. The lovely brunette started off in typical RKO starlet mode with acting/singing/dancing/diction lessons and bit parts (billed as Dorothy Maloney) in such films as the Frank Sinatra musicals Higher and Higher (1943) and Step Lively (1944), a couple of the mystery \"Falcon\" entries and a showier role in Show Business (1944) with Eddie Cantor and George Murphy. RKO lost interest, however, after the two-year contract was up. Warner Bros., however, stepped up to the plate and offered the actress a contract. Now billed as Dorothy Malone, her third film offering with the studio finally injected some adrenalin into her floundering young career when she earned the small role of a seductive book clerk in the Bogart/Bacall classic The Big Sleep (1946). Critics and audiences took notice of her captivating little part. As reward, the studio nudged her up the billing ladder with more visible roles in Two Guys from Texas (1948), Romance on the High Seas (1948), South of St. Louis (1949) and Colorado Territory (1949)_ with the westerns showing off her equestrian prowess if not her acting ability. Despite this positive movement, Warner Bros. did not extend Dorothy's contract in 1949 and she returned willingly back to her tightly-knit family in Dallas. Taking a steadier job with an insurance agency, she happened to attend a work-related convention in New York City and grew fascinated with the big city. Deciding to recommit to her acting career, she moved to the Big Apple and studied American Theater Wing. In between her studies she managed to find work on TV, which spurred freelancing \"B\" movie offers in the routine form of Saddle Legion (1951), The Bushwhackers (1951), the Martin & Lewis romp Scared Stiff (1953), Law and Order (1953) Jack Slade (1953), Pushover (1954) and Private Hell 36 (1954). Things picked up noticeably once Dorothy went platinum blonde which seemed to emphasize her overt and sensual beauty. First off as a sister to Doris Day in Young at Heart (1954), a musical remake of Four Daughters (1938), back at Warner Bros. She garnered even better attention when she appeared in the war pic Battle Cry (1955), in which she shared torrid love scenes with film's newest heartthrob Tab Hunter, and continued the momentum with the reliable westerns Five Guns West (1955) and Tall Man Riding (1955) but not with melodramatic romantic dud Sincerely Yours (1955) which tried to sell to the audiences a heterosexual Liberace. By this time Dorothy had signed with Universal. Following a few more westerns for good measure (At Gunpoint (1955), Tension at Table Rock (1956) and Pillars of the Sky (1956), Dorothy won the scenery-chewing role of wild, nymphomaniac Marylee Hadley in the Douglas Sirk soap opera meller Written on the Wind (1956) co-starring Rock Hudson, Lauren Bacall and Robert Stack. Both Stack and Malone had the showier roles and completely outshined the two leads, earning supporting Oscar nominations in the process. Stack lost in his category but Dorothy nabbed the trophy for her splendidly tramp, boozed-up Southern belle which was highlighted by her writhing mambo dance. Unfortunately, Dorothy's long spell of mediocre filming did not end with all the hoopla she received for Written on the Wind (1956). The Tarnished Angels (1957), which reunited Malone with Hudson and Stack faltered, and Quantez (1957) with Fred MacMurray was just another run-of-the-mill oater. Two major film challenges might have changed things with Man of a Thousand Faces (1957)as the unsympathetic first wife of James Cagney's Lon Chaney Sr, and as alcoholic actress Diana Barrymore in the biographic melodrama Too Much, Too Soon (1958). Diana Barrymore. Cagney, however, overshadowed everyone in the first and the second was fatally watered down by the Production Code committee. To compensate, Dorothy, at age 35, finally married -- to playboy actor Jacques Bergerac, Ginger Rogers' ex-husband, in 1959. A baby daughter, Mimi, was born the following year. Fewer film offers, which included Warlock (1959) and The Last Voyage (1960), came her way as Dorothy focused more on family life. While a second daughter, Diane, was born in 1962, Dorothy and Jacques' turbulent marriage wouldn't lasted and the divorce became final in December of 1964. A bitter custody battle ensued with Dorothy eventually winning primary custody. It took the small screen to rejuvenate Dorothy's career in the mid-1960s when she earned top billing of TV's first prime time soap opera Peyton Place (1964). Dorothy, starring in Lana Turner's 1957 film role of Constance MacKenzie, found herself in a smash hit. The run wasn't entirely happy however. Doctors discovered blood clots on her lungs which required major surgery and she almost died. Lola Albright filled in until she was able to return. Just as bad, her the significance of her role dwindled with time and 20th Century-Fox finally wrote her and co-star Tim O'Connor off the show in 1968. Dorothy filed a breach of contract lawsuit which ended in an out-of-court settlement. Her life on- and off-camera did not improve. Dorothy's second marriage to stockbroker Robert Tomarkin in 1969 would last only three months, and a third to businessman Charles Huston Bell managed about three years. Now-matronly roles in the films Winter Kills (1979), Vortex (1982), The Being (1983) and Rest in Pieces (1987), were few and far between a few TV-movies -- which included some \"Peyton Place\" revivals, did nothing to advance her. A weary Dorothy returned and settled for good back in Dallas, returning to Hollywood only on occasion. Her last film was a cameo in the popular thriller Basic Instinct (1992) as a friend to Sharon Stone. She will be remembered as one of those Hollywood stars who proved she had the talent but somehow got the short end of the stick when it came to quality films offered.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMzY2OTUyNV5BMl5BanBnXkFtZTcwMTg4MjM5OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0540416","name":"Dorothy Malone","idIMDB":"nm0540416"},"actorId":"nm0540416","character":"Francey Farnham","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bridget Duff","urlProfile":"http://www.imdb.com/name/nm0240365","urlPhoto":"","biography":{"dateOfBirth":"23 April 1952","placeOfBirth":" Los Angeles, California, USA","birthName":"Bridget Mirella Duff","bio":"Bridget Duff was born on April 23, 1952 in Los Angeles, California, USA as Bridget Mirella Duff. She is an actress, known for Private Hell 36 (1954) and Biography (1987). She has been married to Jason Von Donovan since June 21, 1986. She was previously married to Michael Steinberg.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0240365","name":"Bridget Duff","idIMDB":"nm0240365"},"actorId":"nm0240365","character":"Bridget Farnham","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jerry Hausner","urlProfile":"http://www.imdb.com/name/nm0369617","urlPhoto":"","biography":{"dateOfBirth":"20 May 1909","placeOfBirth":" Cleveland, Ohio, USA","birthName":"James Bernard Hausner","height":"5' 4\" (1.63 m)","bio":"Jerry Hausner was born on May 20, 1909 in Cleveland, Ohio, USA as James Bernard Hausner. He is known for his work on Paths of Glory (1957), The Dick Tracy Show (1961) and Pete Hothead (1952). He died on April 1, 1993 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0369617","name":"Jerry Hausner","idIMDB":"nm0369617"},"actorId":"nm0369617","character":"Hausner, Nightclub Owner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dabbs Greer","urlProfile":"http://www.imdb.com/name/nm0339428","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0Mjk5MzIzNF5BMl5BanBnXkFtZTcwODIzMjYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 April 1917","placeOfBirth":" Fairview, Missouri, USA","birthName":"Robert William Greer","height":"5' 10½\" (1.79 m)","bio":"Dabbs Greer was a very familiar face in films and especially on TV. He was a sort of \"everyman\" in his roles and played merchants, preachers, businessmen, and other \"pillars of the community\" types as well as assorted villains. With his plain looking face, wavy hair and mellow, distinctive voice he was a solid supporting actor. He was born on April 2, 1917, in Fairview, Missouri, but reared in Anderson, Missouri. He was the only child of a pharmacist father and a speech therapist mother. His first acting experience was on stage in a children's theatre production when he was eight years old. He attended Drury College in Springfield, Missouri, where he earned a BA and headed the drama department and Little Theatre in Mountain Grove, Missouri, from 1940-43. He then moved on to the famed Pasadena Playhouse in California as actor, instructor and administrator from 1943-50. He made his film debut in Reign of Terror (1949) (aka \"The Black Book\") in an uncredited bit part and went on to appear in many parts during the next 50 years. He is probably best remembered for his role as Rev. Alden on Little House on the Prairie (1974) but he was also a regular on the TV series Gunsmoke (1955) as a merchant, Mr. Jonas; Hank (1965) as Coach Ossie Weiss and Picket Fences (1992) as Rev. Henry Novotny. He also appeared in made-for-TV movies and guest-starred on such series as Adventures of Superman (1952); The Rifleman (1958); Wanted: Dead or Alive (1958); Trackdown (1957); Perry Mason (1957); Bonanza (1959); The Fugitive (1963) and The Brady Bunch (1969).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0Mjk5MzIzNF5BMl5BanBnXkFtZTcwODIzMjYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0339428","name":"Dabbs Greer","nicknames":["Bill"],"idIMDB":"nm0339428"},"actorId":"nm0339428","character":"Sam Marvin, Bartender","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris O'Brien","urlProfile":"http://www.imdb.com/name/nm3977787","urlPhoto":"","biography":{"bio":"Chris O'Brien is an actor, known for The Gun That Won the West (1955), Private Hell 36 (1954) and The Prime Time (1960).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3977787","name":"Chris O'Brien","idIMDB":"nm3977787"},"actorId":"nm3977787","character":"Coroner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kenneth Patterson","urlProfile":"http://www.imdb.com/name/nm0666292","urlPhoto":"","biography":{"dateOfBirth":"3 August 1911","placeOfBirth":" Bozeman, Montana, USA","birthName":"Kenneth Gordon Patterson","bio":"Kenneth Patterson was born on August 3, 1911 in Bozeman, Montana, USA as Kenneth Gordon Patterson. He was an actor, known for Being There (1979), Invasion of the Body Snatchers (1956) and ...and justice for all. (1979). He died on February 16, 1990 in Los Angeles County, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0666292","name":"Kenneth Patterson","idIMDB":"nm0666292"},"actorId":"nm0666292","character":"Det. Lieutenant Lubin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Dockstader","urlProfile":"http://www.imdb.com/name/nm0230019","urlPhoto":"","biography":{"dateOfBirth":"28 March 1914","placeOfBirth":" Lindina, Wisconsin, USA","bio":"George Dockstader was born on March 28, 1914 in Lindina, Wisconsin, USA. He is known for his work on The Jackie Robinson Story (1950), Every Which Way But Loose (1978) and Private Hell 36 (1954). He died on December 27, 1987 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0230019","name":"George Dockstader","idIMDB":"nm0230019"},"actorId":"nm0230019","character":"Fugitive","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jimmy Hawkins","urlProfile":"http://www.imdb.com/name/nm0370151","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwODI1NzExNl5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1941","placeOfBirth":" Los Angeles, California, USA","birthName":"James F. Hawkins","bio":"Jimmy Hawkins....Portrayed the son of some of Hollywood's most popular movie stars of the 40's (Spencer Tracy, Katherine Hepburn, Greer Garson, Lana Turner & Jessica Tandy). Jimmy also has the distinction of playing Jimmy Stewart & Donna Reed's son, Tommy Bailey, in the Frank Capra film classic... \"It's A Wonderful Life\". In television, he starred as a Donald Ruggles in one of TV's first family sitcoms \"The Charlie Ruggles Show\" (abc'49-'52), Tagg Oakley on The Emmy nominated \"Annie Oakley\" series (cbs'53-'58), Jimmy was reunited with Donna Reed when he was signed to play Shelley Fabares' boyfriend, Scotty, for eight seasons on \"The Donna Reed Show\" (abc'58-'66)... four seasons on The Adventures of Ozzie & Harriet, two years on Petticoat Junction, and \"Ichabod and Me\". He also appeared on \"Leave It To Beaver\", \"Dennis The Menace\", \"Gidget\", \"My Three Sons\", \"Hitchcock Presents\", \"Red Skelton\", \"Lux Video Theatre\" etc. He co-starred as Elvis Presley's sidekick in two MGM musicals, \"Girl Happy\" and \"Spinout\". He was invited by The USO & Department of Defense to entertain the troops in Viet Nam ('68) As a producer, Jimmy's credits include \"Evel Knievel\" (Major Motion Picture), \" Don't Look Back\"...The Satchel Paige Story (abc Theatre) which won him NAACP's Image Award... \"Scouts Honor\" (NBC MOW) starring Gary Coleman...which celebrated The 50th Anniversary of The Cub Scouts of America....Disney's \"Love Leads The Way\"(The Disney Channel)...\"A Time For Miracles\"...the Story of Mother Seton (abc Theatre). \"Smart Cookies\" based on his original story \"Be Prepared\" celebrated the 100th Anniversary of The Girl Scouts (The Hallmark Channel). He created the 3 hour NBC Emmy Award winning television special \"The 50th Anniversary Motown Returns to the Apollo\". Mr. Hawkins produced the PBS Television special all-star radio version celebrating It's A Wonderful Life's 50th Anniversary. Over the years he has helped raise millions of dollars for a variety of charities. He is the author of five popular It's A Wonderful Life books and sits on the Advisory Board of The Jimmy Stewart Museum and for 20 years served on the Board of Directors of the Donna Reed Foundation for the Performing Arts. Jimmy is celebrating over 50 years as a member of THE ACADEMY of MOTION PICTURE ARTS and SCIENCES.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwODI1NzExNl5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0370151","name":"Jimmy Hawkins","idIMDB":"nm0370151"},"actorId":"nm0370151","character":"Delivery Boy","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0047370","urlIMDB":"http://www.imdb.com/title/tt0047370","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Copyright MCMLIV Filmakers Productions, Inc."},"technical":{"runtime":["1 hr 21 min (81 min)"],"soundMix":["Mono (RCA Sound Recording)"],"color":["Black and White"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.7","filmingLocations":[{"location":"Hollywood Park Racetrack - 1050 S. Prairie Avenue, Inglewood, California, USA"}],"rated":"APPROVED","awards":[],"votes":"740","type":"Movie","companyCreditsSimple":[{"idCompany":"co0034926","name":"Filmakers, The"}],"keywords":{"keywords":["detective","murder","robbery","investigation","marked money","stakeout","hollywood race track","trailer park","new york","police corruption","police detective","automobile chase","pharmacist","nightclub","horse racing","gambling","drugstore","bartender","automobile accident","trap","singer","female corrupts male","police","los angeles california","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:08:37"}}