{"data":{"movies":[{"title":"Start the Revolution Without Me","originalTitle":"","year":"1970","releaseDate":"19780412","directors":[{"name":"Bud Yorkin","id":"nm0005570"}],"writers":[{"name":"Fred Freeman","id":"nm0293391"},{"name":"Lawrence J. Cohen","id":"nm0169549"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0MTk1NTgyOF5BMl5BanBnXkFtZTYwNTYyNzk5._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","History"],"plot":"An account of the adventures of two sets of identical twins, badly scrambled at birth, on the eve of the French Revolution. One set is haughty and aristocratic, the other poor and somewhat dim. They find themselves involved in palace intrigues as history happens around them. Based, very loosely, on Dickens's _A Tale of Two Cities_, Dumas's _The Corsican Brothers_, etc.","simplePlot":"Two mismatched sets of identical twins - one aristocrat, one peasant - mistakenly exchange identities on the eve of the French Revolution.","actors":[{"actorName":"Gene Wilder","urlProfile":"http://www.imdb.com/name/nm0000698","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMTAxMzczNl5BMl5BanBnXkFtZTYwMjEwOTg2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 June 1933","placeOfBirth":" Milwaukee, Wisconsin, USA","birthName":"Jerome Silberman","height":"5' 10½\" (1.79 m)","bio":"Gene Wilder was born Jerome Silberman in Milwaukee, Wisconsin, to Jeanne (Baer) and William J. Silberman, who manufactured miniature whiskey and beer bottles. His father was a Russian Jewish immigrant, while his Illinois-born mother was of Russian Jewish descent. Wilder caught his first big break playing a small role in the off-Broadway production of Arnold Wesker's \"Roots\" and followed quickly with his Broadway debut as the comic valet in \"The Complaisant Lover\" (both 1961), for which he won the Clement Derwent Award. His other Broadway credits included \"One Flew Over the Cuckoo's Nest\" (1963, with Kirk Douglas), \"The White House\" (1964, with Helen Hayes) and \"Luv\" (1966), but it was a 1963 Broadway production of \"Mother Courage and Her Children\" that altered the course of his life forever. In its cast was Anne Bancroft, who was dating Mel Brooks at the time, and the relationship established between the two men eventually led to Wilder's becoming part of Brooks' \"stock company\". Wilder's Actor's Studio connection may have helped him land his first feature, Bonnie and Clyde (1967), in which he drew much favourable attention in a small but memorable role as a frightened young undertaker abducted by the legendary duo. Wilder's performance as the endearingly frantic Leo Bloom in The Producers (1967) kicked off his celebrated collaboration with Mel Brooks and garnered him an Academy Award nomination as Best Supporting Actor. His career gained momentum as he played a swashbuckler in Start the Revolution Without Me (1970), the candy impresario of Willy Wonka & the Chocolate Factory (1971) and a sheep-smitten doctor in Woody Allen's Everything You Always Wanted to Know About Sex * But Were Afraid to Ask (1972). Wilder re-teamed with Mel Brooks for the inspired lunacy of Blazing Saddles (1974) and Young Frankenstein (1974), earning his second Oscar nomination for his first-time screen-writing efforts (along with Mel Brooks) on the latter. Spurred by these triumphs, Wilder made his directorial debut (in addition to acting and starring) with The Adventure of Sherlock Holmes' Smarter Brother (1975). His first association with Richard Pryor had come on Blazing Saddles (1974), but Richard Pryor (co-screenwriter) had lost out in his bid for the Cleavon Little role. Richard Pryor and Wilder first acted together in the highly entertaining and commercially successful Silver Streak (1976) and scored at the box office again with Stir Crazy (1980), but their later efforts were mediocre. Ironically, Hanky Panky (1982), Wilder's first of three films with his late wife Gilda Radner, originally was written to pair him with Richard Pryor again, but Richard Pryor's unavailability necessitated rewriting the part for Gilda Radner.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMTAxMzczNl5BMl5BanBnXkFtZTYwMjEwOTg2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000698","name":"Gene Wilder","idIMDB":"nm0000698"},"actorId":"nm0000698","character":"Claude / Philippe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Donald Sutherland","urlProfile":"http://www.imdb.com/name/nm0000661","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MDI1NzcyMl5BMl5BanBnXkFtZTcwOTk0MjQwOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 July 1935","placeOfBirth":" Saint John, New Brunswick, Canada","birthName":"Donald McNichol Sutherland","height":"6' 4\" (1.93 m)","bio":"The towering presence of Canadian actor Donald Sutherland is often noticed, as are his legendary contributions to cinema. He has appeared in almost 200 different shows and films. He is also the father of renowned actor Kiefer Sutherland, among others. Donald McNichol Sutherland was born in Saint John, New Brunswick, to Dorothy Isobel (McNichol) and Frederick McLea Sutherland, who worked in sales and electricity. He has Scottish, as well as German and English, ancestry. Sutherland worked several different jobs - he was a radio DJ in his youth - and was almost set on becoming an engineer after graduating from the University of Toronto with a degree in engineering. However, he also graduated with a degree in drama, and he chose to abandon becoming an engineer in favour of an actor. Sutherland's first roles were bit parts and consisted of such films as the horror film Dr. Terror's House of Horrors (1965) which starred Christopher Lee. He was also appearing in episodes of TV shows such as \"The Saint\" and \"Court Martial\". Sutherland's break would come soon, though, and it would come in the form of a war film in which he was barely cast. The reason he was barely cast was because he had been a last-minute replacement for an actor that had dropped out of the film. The role he played was that of the dopey but loyal Vernon Pinkley in the war film The Dirty Dozen (1967). The film also starred Lee Marvin, Charles Bronson, and Telly Savalas. The picture was an instant success as an action/war film, and Sutherland played upon this success by taking another role in a war film: this was, however, a comedy called MASH (1970) which landed Sutherland the starring role alongside Elliott Gould and Tom Skerritt. This is now considered a classic among film goers, and the 35-year old actor was only getting warmed up. Sutherland took a number of other roles in between these two films, such as the theatrical adaptation Oedipus the King (1968), the musical Joanna (1968) and the Clint Eastwood-helmed war comedy Kelly's Heroes (1970). It was Kelly's Heroes (1970) that became more well-known, and it reunited Sutherland with Telly Savalas. 1970 and 1971 offered Sutherland a number of other films, the best of them would have to be Klute (1971). The film, which made Jane Fonda a star, is about a prostitute whose friend is mysteriously murdered. Sutherland received no critical acclaim like his co-star Fonda (she won an Oscar) but his career did not fade. Moving on from Klute (1971), Sutherland landed roles such as the lead in the thriller Lady Ice (1973), and another lead in the western Alien Thunder (1974). These films did not match up to \"Klute\"'s success, though Sutherland took a supporting role that would become one of his most infamous and most critically acclaimed. He played the role of the murderous fascist leader in the Bernardo Bertolucci Italian epic 1900 (1976). Sutherland also gained another memorable role as a marijuana-smoking university professor in Animal House (1978) among other work that he did in this time. Another classic role came in the form of the Robert Redford film, Ordinary People (1980). Sutherland portrays an older father figure who must deal with his children in an emotional drama of a film. It won Best Picture, and while both the supporting stars were nominated for Oscars, Sutherland once again did not receive any Academy Award nomination. He moved on to play a Nazi spy in a film based on Ken Follett's book \"Eye of the Needle\" and he would star alongside Al Pacino in the commercial and critical disaster that was Revolution (1985). While it drove Al Pacino out of films for four years, Sutherland continued to find work. This work led to the dramatic, well-told story of apartheid A Dry White Season (1989) alongside the legendary actor Marlon Brando. Sutherland's next big success came in the Oliver Stone film JFK (1991) where Sutherland plays the chilling role of Mister X, an anonymous source who gives crucial information about the politics surrounding President Kennedy. Once again, he was passed over at the Oscars, though Tommy Lee Jones was nominated for his performance as Clay Shaw. Sutherland went on to appear in Buffy the Vampire Slayer (1992), Shadow of the Wolf (1992), and Disclosure (1994). The new millennium provided an interesting turn in Sutherland's career: reuniting with such former collaborators as Clint Eastwood and Tommy Lee Jones, Sutherland starred in Space Cowboys (2000). He also appeared as the father figure to Nicole Kidman's character in Cold Mountain (2003) and Charlize Theron's character in The Italian Job (2003). He has also made a fascinating, Oscar-worthy performance as the revolutionist Mr. Thorne in Land of the Blind (2006) and also as a judge in Reign Over Me (2007). Recently, he has joined forces with his son Rossif Sutherland and Canadian comic [error] with the new comedy The Con Artist (2010), as well as acting alongside Jamie Bell and Channing Tatum in the sword-and-sandal film The Eagle (2011). Sutherland has also taken a role in the remake of Charles Bronson's film The Mechanic (1972). Donald Sutherland has made a lasting legacy on Hollywood, whether portraying a chilling and horrifying villain, or playing the older respectable character in his films. A true character actor, Sutherland is one of Canada's most well-known names and will hopefully continue on being so long after his time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MDI1NzcyMl5BMl5BanBnXkFtZTcwOTk0MjQwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000661","name":"Donald Sutherland","idIMDB":"nm0000661"},"actorId":"nm0000661","character":"Charles / Pierre","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hugh Griffith","urlProfile":"http://www.imdb.com/name/nm0341518","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg0NzMxMTUwM15BMl5BanBnXkFtZTYwMzg1MjI2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 May 1912","placeOfBirth":" Marian Glas, Anglesey, Wales, UK","birthName":"Hugh Emrys Griffith","bio":"Enjoyably larger-than-life character actor Hugh Emrys Griffith was born in Marianglas, Anglesey, North Wales, to Mary (Williams) and William Griffith. Griffith left the world of banking (having been employed as a teller) after winning a scholarship to study acting at the Royal Academy of Dramatic Art. Though he graduated a gold medallist, top of his class of 300, the war put the brakes on his career and he enlisted in the Army in 1940, serving with the Royal Welsh Fusiliers in India for six years. Following the war, he enjoyed a successful career on the stage, appearing in Shakespearean plays in Stratford-upon-Avon with the Royal Shakespeare Company. He was particularly noteworthy as \"Falstaff\" and, his favourite role, \"King Lear\", which he played both in English and in his native Welsh. On the other side of the Atlantic, he made his Broadway debut in 1951 and had a hit starring in \"Look Homeward Angel\" (1957-59) with Anthony Perkins and Jo Van Fleet. The play ran for 564 performances and earned Griffith a Tony Award nomination for the part of \"W.O. Gant\". He later jokingly remarked, that, when the producers asked him to play a man from the deep south, he (Griffith) had understood that to mean a man from the deep south of Wales. Griffith started his film career proper in 1948 with films like Dulcimer Street (1948), followed by the wonderful black comedy Kind Hearts and Coronets (1949) at Ealing in 1949. A portly, thickly-bearded character with bushy eyebrows, ruddy complexion and a resonant bass voice, Griffith made a lasting impression for his many portrayals of eccentric, bucolic and, sometimes, raucous types. In 1959, he won the Academy Award as Best Supporting Actor for his \"Sheikh Ilderim\", who supplies Charlton Heston with the chariot race-winning white stallions in Ben-Hur (1959). He was equally memorable as the lecherous \"Squire Western\" in Tom Jones (1963), a role for which he was nominated for both an Oscar and a BAFTA Award as Best British Actor. He later appeared in the critically-acclaimed musical version of Oliver! (1968), as a hilarious \"King Louis\" in Start the Revolution Without Me (1970) and one of Vincent Price's many victims in The Abominable Dr. Phibes (1971). On television, he was a noteworthy, rolling-eyed \"Long John Silver\" in a 1960 version of \"Treasure Island\", The DuPont Show of the Month: Treasure Island (1960), and roving-eyed funeral director \"Caradog Lloyd-Evans\" in the comedy Grand Slam (1978). Griffith was a lifelong friend (and drinking companion) of Welsh poet Dylan Thomas.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg0NzMxMTUwM15BMl5BanBnXkFtZTYwMzg1MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0341518","name":"Hugh Griffith","idIMDB":"nm0341518"},"actorId":"nm0341518","character":"King Louis XVI","urlCharacter":"http://www.imdb.com/character/ch0027382","main":true},{"actorName":"Jack MacGowran","urlProfile":"http://www.imdb.com/name/nm0532290","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkxNDY5NTY0OF5BMl5BanBnXkFtZTcwNDAzMzIxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1918","placeOfBirth":" Dublin, Ireland","birthName":"John Joseph MacGowran","height":"5' 7\" (1.7 m)","bio":"Jack MacGowran, the great Irish character actor known for his roles in the plays of Samuel Beckett, was born on October 13, 1918, in Ireland. He established his professional reputation as a member of the Abbey Players in Dublin, but he won his greatest fame for essaying Beckett's characters onstage. (In 1971, MacGowran would win the Obie Award for Best Performance By an Actor essaying \"Beckett\" on the off-Broadway stage.) MacGowran's appearance as the Squire's right-hand man in John Ford's paean to Ireland, The Quiet Man (1952), introduced him to world cinema. In 1954 he moved to London, where he joined The Shakespeare Company (before it won the patronage of Queen Elizabeth II and added the sobriquet \"Royal\" to its name). At the Shakespeare Company, he became friends with fellow Irishman-abroad Peter O'Toole, with whom he would co-star in Richard Brooks's Lord Jim (1965) (1965) a decade later. In New York, he appeared as Joxer, one of the greatest roles in modern Irish drama, in the Broadway musical \"Juno\", which was based on 'Sean O'Casey''s 1924 masterpiece \"The Shame of Mary Boyle (1929)\". Fittingly, he played O'Casey's brother Archie in Young Cassidy (1965), one of John Ford's last films (which the director had to abandon owing to ill health). One of his only movie leads came with Wonderwall (1968), an exercise in \"mod\" cinema (a genre that ironically harkened back to the first cinema, that of the silent screen), a film that is remembered mostly for 'George Harrison's score. By that time, MacGowran had established himself as the actor to go to for roles calling for an impish, Puckish character. He was in great demand for comedies, such as the Oscar-winning 'Tom Jones (1963)_ (Best Picture of 1963) and Start the Revolution Without Me (1970). In the classical genre, he memorably played The Fool to the great 'Paul Scofield''s watershed interpretation of King Lear (1971) in Peter Brooks's 1971 film that captured Scofield's magisterial performance, arguably the greatest interpretation of Lear in the 20th century. After starring in the first London production of Beckett's \"Endgame\", MacGowran began a busy career as a character actor in motion pictures. Director Roman Polanski used him twice, as a gangster in his absurdist Cul-De-Sac (1966) and as Professor Abronsius, the Vampire Hunter, in his horror film parody The Fearless Vampire Killers (1967), a role that was written especially for him. His last film was a more straightforward horror picture, the 1973 blockbuster The Exorcist (1973), in which he played a doomed film director. Jack MacGowran died on January 31, 1973, of complications from influenza, which he had caught in London during a flu epidemic. The cinema and the stage lost a unique talent that never has been replaced.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkxNDY5NTY0OF5BMl5BanBnXkFtZTcwNDAzMzIxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0532290","name":"Jack MacGowran","idIMDB":"nm0532290"},"actorId":"nm0532290","character":"Jacques","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Billie Whitelaw","urlProfile":"http://www.imdb.com/name/nm0925794","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU0NDY5NTM3OF5BMl5BanBnXkFtZTcwOTU4NDYwOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 June 1932","placeOfBirth":" Coventry, Warwickshire, England, UK","birthName":"Billie Honor Whitelaw","height":"5' 2\" (1.57 m)","bio":"Billie Whitelaw first appeared on the radio aged 11. She made her theatrical debut in 1950 and in films from 1953. She has made a speciality of playing intense, single-purposed women. Also, (on stage), she has appeared in many of the stranger plays by Samuel Beckett.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU0NDY5NTM3OF5BMl5BanBnXkFtZTcwOTU4NDYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0925794","name":"Billie Whitelaw","idIMDB":"nm0925794"},"actorId":"nm0925794","character":"Queen Marie Antoinette","urlCharacter":"http://www.imdb.com/character/ch0026874","main":true},{"actorName":"Victor Spinetti","urlProfile":"http://www.imdb.com/name/nm0818920","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2Njg0MjI0M15BMl5BanBnXkFtZTcwOTk3Mjc5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 September 1929","placeOfBirth":" Cwm, Ebbw Vale, Gwent, Wales, UK","birthName":"Vittorio Georgio Andrea Spinetti","bio":"Comic eccentric and gifted raconteur, Victor Spinetti was born in Wales on September 2, 1929, the son of Giuseppe Spinetti and Lily (Watson) Spinetti. He was educated at Monmouth School. Initially interested in a teaching degree, he turned to acting instead and studied for the stage at the College of Music and Drama, Cardiff. A familiar stage presence in London's West End, his roles included \"Expresso Bongo\" with Paul Scofield and Leonard Bernstein's \"Candide\". He also spent six years with Joan Littlewood's Theatre Workshop. Noticed in some of his more important theater pieces such as \"The Hostage\", \"Fings Ain't Wot They Used T'be\", \"Henry IV, Parts I & II\", and \"Every Man in His Humour\", his triumph in \"Oh! What a Lovely War\" led to Broadway and both the Tony and Theatre World awards. In the late 1960s, Victor co-starred in \"The Odd Couple\" with Jack Klugman when it toured London. A noted performer with the Royal Shakespeare Company, he has been equally adept in theatre musicals, providing delicious villainy as Fagin in \"Oliver!\" and Captain Hook in \"Peter Pan\". A theatre director of both legit and musical plays as well, Victor's one man show \"A Very Private Diary\" has played all over the world. At age 70+, Victor is still quite active on stage, more recently playing Baron Bomburst in the musical version of \"Chitty Chitty Bang Bang\" in 2003, and \"The Merry Widow\" in 2004. In 1960s film, Victor became a vital part of the \"Beatlemania\" phenomenon earning international recognition as he added to the insanity of three of The Beatles' cult vehicles: A Hard Day's Night (1964), Help! (1965) and their hour-long Magical Mystery Tour (1967). A TV favorite in England, he scored in many comedy series over the years. He is an excellent conversationalist and storyteller who has often extended his talents into writing.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2Njg0MjI0M15BMl5BanBnXkFtZTcwOTk3Mjc5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0818920","name":"Victor Spinetti","nicknames":["Vic"],"idIMDB":"nm0818920"},"actorId":"nm0818920","character":"Duke d'Escargot","urlCharacter":"http://www.imdb.com/character/ch0013133","main":true},{"actorName":"Ewa Aulin","urlProfile":"http://www.imdb.com/name/nm0042046","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MjY0NjA3OV5BMl5BanBnXkFtZTcwMDk1MzIyOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1950","placeOfBirth":" Landskrona, Skåne län, Sweden","birthName":"Ewa Brigitta Aulin","bio":"When Gunnar Fischer made a short in 1965 he needed a young girl, and he chose a young neighbor of his, Ewa Aulin. After winning a beauty contest she quickly got an Italian film contract which led to a string of quickly forgotten films. She got good reviews for Candy (1968) but at the age of 23, she felt that movies wasn't anything for her. She remarried, had two daughters and enrolled in university to study teaching.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MjY0NjA3OV5BMl5BanBnXkFtZTcwMDk1MzIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0042046","name":"Ewa Aulin","idIMDB":"nm0042046"},"actorId":"nm0042046","character":"Princess Christina","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Helen Fraser","urlProfile":"http://www.imdb.com/name/nm0292136","urlPhoto":"","biography":{"dateOfBirth":"15 June 1942","placeOfBirth":" Oldham, Lancashire, England, UK","birthName":"Helen Margaret Stronach","height":"5' 4\" (1.63 m)","bio":"Helen Fraser (born Helen Margaret Stronach; Oldham, Lancashire 15 June 1942) is an English actress, who has appeared in many television series since the early 1960s. For international audiences, she may be best known her roles in Billy Liar (1963) and Repulsion (1965). She is also well known for portraying the role of miserable warder Sylvia Hollamby in the prison drama series Bad Girls. She appeared in the series from the very first episode in 1999 to the very last in 2006. She trained at RADA alongside Tom Courtenay and John Thaw, among others. She got her breakthrough role alongside Courtenay in Billy Liar (1963). They later played the parents of character Dave Best in the Christmas special of The Royle Family (2008). She is best known to television viewers for her long-running role in the ITV women's prison drama Bad Girls as unpleasant warder Sylvia Hollamby from the very first episode in 1999 to the very last in 2006. She reprised the role in the West End production of Bad Girls: The Musical in 2007. She made her TV debut in the early 1960s and her credits include Z-Cars, Dixon of Dock Green, The Likely Lads, Doctor in the House,The Dustbinmen, On the Buses, Rising Damp, Tales of the Unexpected, Duty Free, One Foot in the Grave and Casualty. She also worked on TV with comedians like Dick Emery and the Two Ronnies in the 1970s. She has also appeared on stage, including with the Royal National Theatre, in the West End and in regional theatres across the country. In 2009 and 2010 she toured the UK as Mrs Fisher in a stage version of Billy Liar. In 2011 she joined the tour of Calendar Girls. Fraser has appeared in the ITV soap Coronation Street twice - in 1998 as Magenta Savannah and again in 2013 as Doris Babbage. In 2015 she appeared in an episode of the BBC daytime soap Doctors. In 1964 she married the recording engineer Peter Handford, the couple had met on the set of Billy Liar. Handford died in 2007. Fraser resides in Eye, Suffolk.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0292136","name":"Helen Fraser","idIMDB":"nm0292136"},"actorId":"nm0292136","character":"Mimi Montage","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rosalind Knight","urlProfile":"http://www.imdb.com/name/nm0461063","urlPhoto":"","biography":{"dateOfBirth":"3 December 1933","placeOfBirth":" Marylebone, London, England, UK","birthName":"Rosalind Marie Knight","height":"5' 4\" (1.63 m)","bio":"Rosalind Knight was born on December 3, 1933 in Marylebone, London, England as Rosalind Marie Knight. She is an actress, known for About a Boy (2002), Tom Jones (1963) and Prick Up Your Ears (1987). She was previously married to Michael Elliott.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0461063","name":"Rosalind Knight","idIMDB":"nm0461063"},"actorId":"nm0461063","character":"Helene de Sisi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harry Fowler","urlProfile":"http://www.imdb.com/name/nm0288714","urlPhoto":"","biography":{"dateOfBirth":"10 December 1926","placeOfBirth":" Lambeth, London, England, UK","birthName":"Henry James Fowler","bio":"Harry Fowler was born on December 10, 1926 in Lambeth, London, England as Henry James Fowler. He is known for his work on The Army Game (1957), Hue and Cry (1947) and Went the Day Well? (1942). He was married to Catherine Palmer and Joan Dowling. He died on January 4, 2012 in London.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0288714","name":"Harry Fowler","idIMDB":"nm0288714"},"actorId":"nm0288714","character":"Marcel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Murray Melvin","urlProfile":"http://www.imdb.com/name/nm0578527","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2OTU0MDc1OV5BMl5BanBnXkFtZTcwMTAxNjAzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1932","placeOfBirth":" St. Pancras, London, England, UK","bio":"Murray Melvin was born on August 10, 1932 in St. Pancras, London, England. He is an actor, known for Barry Lyndon (1975), The Phantom of the Opera (2004) and A Taste of Honey (1961).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2OTU0MDc1OV5BMl5BanBnXkFtZTcwMTAxNjAzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0578527","name":"Murray Melvin","idIMDB":"nm0578527"},"actorId":"nm0578527","character":"Blind Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ken Parry","urlProfile":"http://www.imdb.com/name/nm0663669","urlPhoto":"","biography":{"dateOfBirth":"20 June 1930","placeOfBirth":" Wigan, Lancashire, England, UK","height":"5' 6\" (1.68 m)","bio":"Ken Parry was born on June 20, 1930 in Wigan, Lancashire, England. He was an actor, known for La mégère apprivoisée (1967), Start the Revolution Without Me (1970) and Lifeforce (1985). He died on December 5, 2007 in London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0663669","name":"Ken Parry","idIMDB":"nm0663669"},"actorId":"nm0663669","character":"Dr. Boileau","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maxwell Shaw","urlProfile":"http://www.imdb.com/name/nm0789871","urlPhoto":"","biography":{"dateOfBirth":"21 February 1929","placeOfBirth":" London, England, UK","bio":"Maxwell Shaw was born on February 21, 1929 in London, England. He was an actor, known for The Oblong Box (1969), Start the Revolution Without Me (1970) and Once More, with Feeling! (1960). He was married to Rose Tobias Shaw. He died on August 21, 1985 in London.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0789871","name":"Maxwell Shaw","idIMDB":"nm0789871"},"actorId":"nm0789871","character":"Duke de Sisi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jacques Maury","urlProfile":"http://www.imdb.com/name/nm0561284","urlPhoto":"","biography":{"dateOfBirth":"25 June 1937","placeOfBirth":" Berchem, Flanders, Belgium","birthName":"Jacques Vloeberghs","bio":"Jacques Maury was born on June 25, 1937 in Berchem, Flanders, Belgium as Jacques Vloeberghs. He was an actor, known for National Lampoon's European Vacation (1985), Pirates (1986) and Love and Death (1975). He died on March 20, 1985 in Mahé Island, Seychelles.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0561284","name":"Jacques Maury","idIMDB":"nm0561284"},"actorId":"nm0561284","character":"Lt. Sorel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Graham Stark","urlProfile":"http://www.imdb.com/name/nm0823174","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzRmMTUzOTEtMmY1Ny00ZjIwLTk3OGMtN2U5MDk3NDZiNDg5XkEyXkFqcGdeQXVyMjIxMzMyMQ@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 January 1922","placeOfBirth":" Wallasey, Cheshire, England, UK","birthName":"Graham William Stark","bio":"Graham Stark was born on January 20, 1922 in Wallasey, Cheshire, England as Graham William Stark. He was an actor and director, known for A Shot in the Dark (1964), Victor Victoria (1982) and Superman III (1983). He was married to Audrey Nicholson. He died on October 29, 2013 in London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzRmMTUzOTEtMmY1Ny00ZjIwLTk3OGMtN2U5MDk3NDZiNDg5XkEyXkFqcGdeQXVyMjIxMzMyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0823174","name":"Graham Stark","idIMDB":"nm0823174"},"actorId":"nm0823174","character":"Andre Coupe","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0066402","urlIMDB":"http://www.imdb.com/title/tt0066402","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"€224,979","country":"Spain","day":"31","month":"08","year":"2002","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/2002/\">2002</a>"},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1968/\">1968</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)","1 hr 38 min (98 min) (alternate) (Spain)"],"soundMix":["Stereo"],"color":["Color (Technicolor)"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"6.6","filmingLocations":[{"location":"France"}],"rated":"M","awards":[{"award":"Writers Guild of America, USA 1971","titlesAwards":[{"titleAwardOutcome":"Nominated WGA Award (Screen)","categories":[{"category":"Best Comedy Written Directly for the Screen","names":[{"name":"Fred Freeman","id":"nm0293391","role":null},{"name":"Lawrence J. Cohen","id":"nm0169549","role":null}]}]}]}],"votes":"2,222","type":"Movie","companyCreditsSimple":[{"idCompany":"co0053044","name":"NorBud Productions"},{"idCompany":"co0085607","name":"Norbud Films"},{"idCompany":"co0026840","name":"Warner Bros."}],"keywords":{"keywords":["twins","french revolution","chase","arson","torch","long blonde hair","parody","spoof","battle","catfight","love interest","long brown hair","brunette","blonde woman","blonde","kiss","disarming someone","swashbuckler","sword duel","duel","sword fight","sword","bare breasts","18th century","reference to william shakespeare","surrealism","violence","twin brother","topless","sexual humor","sexual attraction","sensuality","nudity","nipples","love","forced to strip","female rear nudity","female nudity","dress","comedy of errors","clothes ripping","brother brother relationship","twins separated at birth","reference to shakespeare's the comedy of errors","switched at birth","mistaken identity","screwball"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:53:46"}}