{"data":{"movies":[{"title":"Three for the Show","originalTitle":"","year":"1955","releaseDate":"19550224","directors":[{"name":"H.C. Potter","id":"nm0693281"}],"writers":[{"name":"Edward Hope","id":"nm0393971"},{"name":"Leonard Stern","id":"nm0827767"}],"runtime":"93 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNjcxNzEwMF5BMl5BanBnXkFtZTcwMjkxMDIyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Musical"],"plot":"This musical reworking of TOO MANY HUSBANDS (1940), features Grable as a top singer and dancer who's been widowed by WW II. She marries her late husband's songwriting partner, Gower Champion, but the new marriage is thrown for a loop when Lemmon, her first husband, turns up very much alive and eager to see Grable.","simplePlot":"A widowed singer marries her late husband's songwriting partner, which leads to trouble when her first husband turns up very much alive.","actors":[{"actorName":"Betty Grable","urlProfile":"http://www.imdb.com/name/nm0002107","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMDk3ODkwMl5BMl5BanBnXkFtZTYwMTEwNzQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1916","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Elizabeth Ruth Grable","height":"5' 4\" (1.63 m)","bio":"Elizabeth Ruth Grable was born on December 18, 1916 in St. Louis, Missouri, to Lillian Rose (Hofmann) and John Charles Grable, a stockbroker. She had German, English, Irish, and Dutch ancestry. Her mother was a stubborn and materialistic woman who was determined to make her daughter a star. Elizabeth, who later became Betty, was enrolled in Clark's Dancing School at the age of three. With her mother's guidance, Betty studied ballet and tap dancing. At age 13, Betty and her mother set out for Hollywood with the hopes of stardom. Lillian lied about her daughter's age, and Ruth landed several minor parts in films in 1930, such as Whoopee! (1930), New Movietone Follies of 1930 (1930), Happy Days (1929) and Let's Go Places (1930). In 1932, she signed with RKO Radio Pictures. The bit parts continued for the next three years. Betty finally landed a substantial part in By Your Leave (1934). One of her big roles was in College Swing (1938). Unfortunately, the public did not seem to take notice. She was beginning to think she was a failure. The next year, she married former child star Jackie Coogan. His success boosted hers, but they divorced in 1940. When she landed the role of Glenda Crawford in Down Argentine Way (1940), the public finally took notice of this shining bright star. Stardom came through comedies such as Coney Island (1943) and Sweet Rosie O'Grady (1943). The public was enchanted with Betty. Her famous pin-up pose during World War II adorned barracks all around the world. With that pin-up and as the star of lavish musicals, Betty became the highest-paid star in Hollywood. After the war, her star continued to rise. In 1947, the United States Treasury Department noted that she was the highest paid star in America, earning about $300,000 a year - a phenomenal sum even by today's standards. Later, 20th Century-Fox, who had her under contract, insured her legs with Lloyds of London for a million dollars. Betty continued to be popular until the mid-1950s, when musicals went into a decline. Her last film was How to Be Very, Very Popular (1955). She then concentrated on Broadway and nightclubs. In 1965, she divorced band leader Harry James, whom she had wed in 1943. Betty Grable died at age 56 of lung cancer on July 2, 1973 in Santa Monica, California. Her life was an active one, devoid of the scandals that plagued many stars in one way or another. In reality, she cared for her family and the family life more than stardom. In that way, she was a true star.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMDk3ODkwMl5BMl5BanBnXkFtZTYwMTEwNzQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002107","name":"Betty Grable","nicknames":["The Girl With the Million Dollar Legs","The Pin-Up Girl","America's Ideal Girl","The Quicksilver Blonde"],"idIMDB":"nm0002107"},"actorId":"nm0002107","character":"Julie Lowndes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marge Champion","urlProfile":"http://www.imdb.com/name/nm0150718","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NDk2OTQ5N15BMl5BanBnXkFtZTYwMTU1NTc1._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 September 1919","placeOfBirth":" Los Angeles, California, USA","birthName":"Marjorie Celeste Belcher","height":"5' 2\" (1.57 m)","bio":"One of the great dancer and choreographers in both movies and stage, Marge Champion is best known today as the former wife of Gower Champion, when they worked together as a highly successfully dancing team in the MGM musical years. After retiring from movies, Champion now works as a dance teacher and as a choreographer in New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NDk2OTQ5N15BMl5BanBnXkFtZTYwMTU1NTc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0150718","name":"Marge Champion","idIMDB":"nm0150718"},"actorId":"nm0150718","character":"Gwen Howard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gower Champion","urlProfile":"http://www.imdb.com/name/nm0150706","urlPhoto":"","biography":{"dateOfBirth":"22 June 1921","placeOfBirth":" Geneva, Illinois, USA","birthName":"Gower Carlisle Champion","height":"5' 10½\" (1.79 m)","bio":"Gower Champion was born on June 22, 1921 in Geneva, Illinois, USA as Gower Carlisle Champion. He was an actor and director, known for Show Boat (1951), Till the Clouds Roll By (1946) and An Evening with Julie Andrews and Harry Belafonte (1969). He was married to Karla Most and Marge Champion. He died on August 25, 1980 in New York City, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0150706","name":"Gower Champion","idIMDB":"nm0150706"},"actorId":"nm0150706","character":"Vernon Lowndes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Lemmon","urlProfile":"http://www.imdb.com/name/nm0000493","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NTE3ODE1N15BMl5BanBnXkFtZTYwOTU1MTM2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1925","placeOfBirth":" Newton, Massachusetts, USA","birthName":"John Uhler Lemmon III","height":"5' 9\" (1.75 m)","bio":"Jack Lemmon was born in Newton, Massachusetts, to Mildred Burgess LaRue (Noel) and John Uhler Lemmon, Jr., the president of a doughnut company. His ancestry included Irish (from his paternal grandmother) and English. Jack attended Ward Elementary near his Newton, MA home. At age 9 he was sent to Rivers Country Day School, then located in nearby Brookline. After RCDS, he went to high school at Phillips Andover Academy. Jack was a member of the Harvard class of 1947, where he was in Navy ROTC and the Dramatic Club. After service as a Navy ensign, he worked in a beer hall (playing piano), on radio, off Broadway, TV and Broadway. His movie debut was with Judy Holliday in It Should Happen to You (1954). He won Best Supporting Actor as Ensign Pulver in Mister Roberts (1955). He received nominations in comedy (Some Like It Hot (1959), The Apartment (1960)) and drama (Days of Wine and Roses (1962), The China Syndrome (1979), Un fils pour l'été (1980) and Missing (1982)). He won the Best Actor Oscar for Save the Tiger (1973) and the Cannes Best Actor award for \"Syndrome\" and \"Missing\". He made his debut as a director with Kotch (1971) and in 1985 on Broadway in \"Long Day's Journey into Night\". In 1988 he received the Life Achievement Award of the American Film Institute.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NTE3ODE1N15BMl5BanBnXkFtZTYwOTU1MTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000493","name":"Jack Lemmon","idIMDB":"nm0000493"},"actorId":"nm0000493","character":"Martin 'Marty' Stewart","urlCharacter":"http://www.imdb.com/character/ch0093309","main":true},{"actorName":"Myron McCormick","urlProfile":"http://www.imdb.com/name/nm0566584","urlPhoto":"","biography":{"dateOfBirth":"8 February 1908","placeOfBirth":" Albany, Indiana, USA (some sources say 1907)","birthName":"Walter Myron McCormick","bio":"American character actor of vast stage experience who appeared infrequently but memorably in films. A native of Albany, Indiana, he attended Princeton University, where he was an honors student and Phi Beta Kappa. In 1929, he joined the University Players in Massachusetts, joining and eventually sharing a New York City apartment with a trio of struggling performers: Henry Fonda, Joshua Logan, and James Stewart. While Fonda and Stewart found their greatest success in Hollywood, Logan and McCormick gravitated to and were most closely tied the New York stage. McCormick also became one of the busiest actors in radio drama. He made occasional movies, such as when the Broadway cast of Maxwell Anderson's \"Winterset\" reunited for the film version. He won fame as Luther Billis in Logan's production of \"South Pacific\" (the role was played by Ray Walston in the film) and as \"Sergeant King\" in No Time for Sergeants (1958) a part he repeated in the movie version. Cancer claimed him in 1962 at the age of 54.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0566584","name":"Myron McCormick","idIMDB":"nm0566584"},"actorId":"nm0566584","character":"Mike Hudson","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0048719","urlIMDB":"http://www.imdb.com/title/tt0048719","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"16","month":"02","year":"1954","remarks":null},{"money":null,"country":null,"day":"21","month":"05","year":"1954","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 33 min (93 min) (USA)","1 hr 28 min (88 min) (TCM print) (USA)"],"soundMix":["Mono"],"color":["Color (Technicolor)"],"aspectRatio":["2.35 : 1","2.55 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["CinemaScope"],"printedFilmFormat":["35 mm"]},"rating":"6.1","filmingLocations":[],"rated":"APPROVED","awards":[],"votes":"246","type":"Movie","companyCreditsSimple":[{"idCompany":"co0050868","name":"Columbia Pictures Corporation"}],"keywords":{"keywords":["seemingly widowed","remake","based on play"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 07:53:03"}}