{"data":{"movies":[{"title":"Dog Day Afternoon","originalTitle":"","year":"1975","releaseDate":"19751225","directors":[{"name":"Sidney Lumet","id":"nm0001486"}],"writers":[{"name":"Frank Pierson","id":"nm0682757"},{"name":"P.F. Kluge","id":"nm0460190"}],"runtime":"125 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BODExZmE2ZWItYTIzOC00MzI1LTgyNTktMDBhNmFhY2Y4OTQ3XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Biography","Crime","Drama","Thriller"],"plot":"Based upon a real-life story that happened in the early seventies in which the Chase Manhattan Bank in Gravesend, Brooklyn, was held siege by a gay bank robber determined to steal enough money for his male lover to undergo a sex change operation. On a hot summer afternoon, the First Savings Bank of Brooklyn is held up by Sonny and Sal, two down-and-out characters. Although the bank manager and female tellers agree not to interfere with the robbery, Sonny finds that there's actually nothing much to steal, as most of the cash has been picked up for the day. Sonny then gets an unexpected phone call from Police Captain Moretti, who tells him the place is surrounded by the city's entire police force. Having few options under the circumstances, Sonny nervously bargains with Moretti, demanding safe escort to the airport and a plane out of the country in return for the bank employees' safety.","simplePlot":"A man robs a bank to pay for his lover's operation; it turns into a hostage situation and a media circus.","actors":[{"actorName":"Penelope Allen","urlProfile":"http://www.imdb.com/name/nm0020897","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMzc1NTQ5NV5BMl5BanBnXkFtZTcwMDQ3MjYwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Penelope Allen is an actress, known for Dog Day Afternoon (1975), The Thin Red Line (1998) and Scarecrow (1973).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMzc1NTQ5NV5BMl5BanBnXkFtZTcwMDQ3MjYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0020897","name":"Penelope Allen","idIMDB":"nm0020897"},"actorId":"nm0020897","character":"Sylvia","urlCharacter":"http://www.imdb.com/character/ch0306223","main":true},{"actorName":"Sully Boyar","urlProfile":"http://www.imdb.com/name/nm0101604","urlPhoto":"","biography":{"dateOfBirth":"14 December 1923","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Israel Sully Boyarsky","bio":"Sully Boyar was born on December 14, 1923 in Brooklyn, New York City, New York, USA as Israel Sully Boyarsky. He was an actor, known for Dog Day Afternoon (1975), Prizzi's Honor (1985) and The Jazz Singer (1980). He was married to Jo Boyar. He died on March 23, 2001 in Queens, New York City.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0101604","name":"Sully Boyar","idIMDB":"nm0101604"},"actorId":"nm0101604","character":"Mulvaney","urlCharacter":"http://www.imdb.com/character/ch0306222","main":true},{"actorName":"John Cazale","urlProfile":"http://www.imdb.com/name/nm0001030","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMTM1MjI5NV5BMl5BanBnXkFtZTcwMTM5NTM1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 August 1935","placeOfBirth":" Boston, Massachusetts, USA","birthName":"John Holland Cazale","height":"5' 10½\" (1.79 m)","bio":"John Cazale was born in Boston, Massachusetts, to an Irish-American mother, Cecilia (Holland), and an Italian-American father, John Cazale. Cazale only made five feature films in his career, all which many fans and critics alike call classics. But before his film debut, the short The American Way (1962), he won numerous Obie Awards for his stage performances in \"The Indian Wants the Bronx\" and \"The Line\". Cazale scored the role of Fredo Corleone in Francis Ford Coppola's The Godfather (1972), after his long time friend, Al Pacino, invited him to audition. He reprised his role as the troubled Fredo in The Godfather: Part II (1974), where his character endures one of the most infamous movie moments in the history of cinema. Cazale also starred with Gene Hackman and Harrison Ford in the thriller, The Conversation (1974), as Hackman's assistant, Stan. The Godfather's director, Francis Ford Coppola, also directed the movie. Cazale's fourth feature film, Dog Day Afternoon (1975), earned him a Golden Globe nomination for Best Supporting Actor for his role as Sal, a bank robber. His long time friend and Godfather co-star, Al Pacino, played his partner, Sonny. His final film, The Deer Hunter (1978), was filmed whilst he was ill with cancer. He was in a relationship with his co-star, Meryl Streep, whilst filming The Deer Hunter (1978), whom he met when they both appeared in the New York Public Theater's 1976 production of Shakespeare's Measure for Measure. Controversy occurred during the filming. While the studio was unaware of his condition, the director, Michael Cimino, knew about it. As Cazale was evidently weak, he was forced to film his scenes first. When the studio discovered he was suffering from cancer, they wanted him removed from the film. His co-star and girlfriend, Meryl Streep, threatened to quit if he was fired. He died shortly after filming was completed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMTM1MjI5NV5BMl5BanBnXkFtZTcwMTM5NTM1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001030","name":"John Cazale","idIMDB":"nm0001030"},"actorId":"nm0001030","character":"Sal","urlCharacter":"http://www.imdb.com/character/ch0009440","main":true},{"actorName":"Beulah Garrick","urlProfile":"http://www.imdb.com/name/nm0308242","urlPhoto":"","biography":{"dateOfBirth":"12 June 1921","placeOfBirth":" Nottingham, England, UK","bio":"Beulah Garrick was born on June 12, 1921 in Nottingham, England. She is an actress, known for Dog Day Afternoon (1975), The Boy Who Saw Through (1956) and Mrs. Miniver (1960).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0308242","name":"Beulah Garrick","idIMDB":"nm0308242"},"actorId":"nm0308242","character":"Margaret","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carol Kane","urlProfile":"http://www.imdb.com/name/nm0001406","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NDgzMzMwOV5BMl5BanBnXkFtZTYwNjg1NzY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 June 1952","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Carolyn Laurie Kane","height":"5' 2\" (1.57 m)","bio":"Carol Kane was born Carolyn Laurie Kane on June 18, 1952 in Cleveland, Ohio, to Elaine Joy (Fetterman), a jazz singer and pianist, and Michael Myron Kane, an architect. Her family is Jewish (from Russia, Poland, and Austria). Due to her parents' divorce, Carol spent most of her childhood in boarding schools, starting at age twelve, when she attended the Cherry Lawn School, a progressive boarding school in Darien, Connecticut, until 1965, followed by enrollment at the Professional Children's School in New York City. She made her professional theater debut in a 1966 production of \"The Prime of Miss Jean Brodie\". She worked prolifically in several successful received films of the 1970s, Carnal Knowledge (1971) (her film film debut), Dog Day Afternoon (1975), Hester Street (1975) (for which she earned an Oscar nomination for her performance), Annie Hall (1977) and When a Stranger Calls (1979). From 1981-1983 she played the part of what is considered to be her most memorable role. Simka Dahblitz-Gravas, the wife of Latka Gravas (played by 'Andy Kaufman), on the American television series _Taxi_. For her performance in the series, she earned two Emmy Awards. Other notable credits include: Pandemonium (1982), Racing with the Moon (1984), Transylvania 6-5000 (1985), Jumpin' Jack Flash (1986), Ishtar (1987), The Princess Bride (1987), Scrooged (1988), The Lemon Sisters (1989) and Addams Family Values (1993). Carol is first and foremost an actress of the stage and is known for her portrayal of the evil headmistress Madame Morrible in the Broadway musical \"Wicked\". She played in various productions from 2005-2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NDgzMzMwOV5BMl5BanBnXkFtZTYwNjg1NzY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001406","name":"Carol Kane","idIMDB":"nm0001406"},"actorId":"nm0001406","character":"Jenny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sandra Kazan","urlProfile":"http://www.imdb.com/name/nm0443584","urlPhoto":"","biography":{"bio":"Sandra Kazan is an actress, known for Dog Day Afternoon (1975), Caught (1996) and The Plot Against Harry (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0443584","name":"Sandra Kazan","idIMDB":"nm0443584"},"actorId":"nm0443584","character":"Deborah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marcia Jean Kurtz","urlProfile":"http://www.imdb.com/name/nm0476040","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MTA2MjM2MF5BMl5BanBnXkFtZTcwMTI5MDg1MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Marcia Jean Kurtz was born in The Bronx, New York, USA. She is an actress, known for Requiem for a Dream (2000), Black Swan (2010) and Dog Day Afternoon (1975).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MTA2MjM2MF5BMl5BanBnXkFtZTcwMTI5MDg1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0476040","name":"Marcia Jean Kurtz","idIMDB":"nm0476040"},"actorId":"nm0476040","character":"Miriam","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Amy Levitt","urlProfile":"http://www.imdb.com/name/nm0506204","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4ODAzNzM1Nl5BMl5BanBnXkFtZTgwNjA4NTU3MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Amy Levitt is an actress, known for Dog Day Afternoon (1975), One Life to Live (1968) and American Pop (1981).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4ODAzNzM1Nl5BMl5BanBnXkFtZTgwNjA4NTU3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0506204","name":"Amy Levitt","idIMDB":"nm0506204"},"actorId":"nm0506204","character":"Maria","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Marriott","urlProfile":"http://www.imdb.com/name/nm0550191","urlPhoto":"","biography":{"dateOfBirth":"30 January 1893","placeOfBirth":" Boley, Indian Territory, USA [now Oklahoma, USA]","bio":"John Marriott was born on January 30, 1893 in Boley, Indian Territory, USA. He was an actor, known for Dog Day Afternoon (1975), The Little Foxes (1941) and The Joe Louis Story (1953). He died on April 5, 1977 in Jamaica, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0550191","name":"John Marriott","idIMDB":"nm0550191"},"actorId":"nm0550191","character":"Howard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Estelle Omens","urlProfile":"http://www.imdb.com/name/nm0648384","urlPhoto":"","biography":{"dateOfBirth":"11 October 1928","placeOfBirth":" Chicago, Illinois, USA","bio":"Estelle Omens was born on October 11, 1928 in Chicago, Illinois, USA. She was an actress, known for Dog Day Afternoon (1975), Stir Crazy (1980) and Marathon Man (1976). She was married to Frank Gregory. She died on December 5, 1983 in North Hollywood, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0648384","name":"Estelle Omens","idIMDB":"nm0648384"},"actorId":"nm0648384","character":"Edna","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Al Pacino","urlProfile":"http://www.imdb.com/name/nm0000199","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzg1ODAyNl5BMl5BanBnXkFtZTYwMjAxODQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1940","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Alfredo James Pacino","height":"5' 7\" (1.7 m)","bio":"One of the greatest actors in all of film history, Al Pacino established himself during one of film's greatest decades, the 1970s, and has become an enduring and iconic figure in the world of American movies. Alfredo James Pacino was born on April 25, 1940, in the Bronx, New York, to an Italian-American family. His parents, Rose (Gerardi) and Sal Pacino, divorced when he was young. His mother moved them into his grandparents' house. Pacino found himself often repeating the plots and voices of characters he had seen in the movies, one of his favorite activities. Bored and unmotivated in school, the young Al Pacino found a haven in school plays, and his interest soon blossomed into a full-time career. Starting on the stage, he went through a lengthy period of depression and poverty, sometimes having to borrow bus fare to make it to auditions. He made it into the prestigious Actors Studio in 1966, studying under legendary acting coach Lee Strasberg, creator of the Method Approach that would become the trademark of many 1970s-era actors. After appearing in a string of plays in supporting roles, Pacino finally succeeded with \"The Indian Wants the Bronx\", winning an Obie Award for the 1966-67 season. That was followed by a Tony Award for \"Does the Tiger Wear a Necktie?\". His first feature films made little departure from the gritty realistic stage performances that earned him respect: he played a drug addict in The Panic in Needle Park (1971) after his film debut in Me, Natalie (1969). What came next would change his life forever. The role of Michael Corleone in The Godfather (1972) was one of the most sought-after of the time: Robert Redford, Warren Beatty, Jack Nicholson, Ryan O'Neal, Robert De Niro and a host of others either wanted it or were mentioned for it, but director Francis Ford Coppola had his heart set on the unknown Italian Pacino for the role, although pretty much everyone else--from the studio to the producers to some of the cast members--did not want him. Though Coppola won out through slick persuasion, Pacino was in constant fear of being fired during the hellish shoot. Much to his (and Coppola's) relief, the film was a monster hit that did wonders for everyone's career, including Pacino's, and earned him his first Academy Award nomination for Best Supporting Actor. However, instead of taking on easier projects for the big money he could now command, Pacino threw his support behind what he considered tough but important films, such as the true-life crime drama Serpico (1973) and the tragic real-life bank robbery film Dog Day Afternoon (1975). He opened eyes around the film world for his brave choice of roles, and he was nominated three consecutive years for the \"Best Actor\" Academy Award. He faltered slightly with Bobby Deerfield (1977), but regained his stride with ...and justice for all. (1979), for which he received another Academy Award nomination for Best Actor. Unfortunately, this would signal the beginning of a decline in his career, which produced such critical and commercial flops as Cruising - La Chasse (1980) and Author! Author! (1982). Pacino took on another vicious gangster role and cemented his legendary status in the ultra-violent cult film Scarface (1983), but a monumental mistake was about to follow. Revolution (1985) endured an endless and seemingly cursed shoot in which equipment was destroyed, weather was terrible, and Pacino became terribly ill with pneumonia. Constant changes in the script also further derailed a project that seemed doomed from the start anyway. The Revolutionary War film is considered one of the worst films ever, not to mention one of the worst of his career, resulted in his first truly awful reviews and kept him off the screen for the next four years. Returning to the stage, Pacino has done much to give back and contribute to the theatre, which he considers his first love. He directed a film, The Local Stigmatic (1990), but it remains unreleased. He lifted his self-imposed exile with the striking Sea of Love (1989) as a hard-drinking policeman. This marked the second phase of Pacino's career, being the first to feature his now famous dark, owl eyes and hoarse, gravelly voice. Returning to the Corleones, Pacino made The Godfather: Part III (1990) and earned raves for his first comedic role in the colorful Dick Tracy (1990). This earned him another Academy Award nomination for Best Supporting Actor, and two years later he was nominated for Glengarry Glen Ross (1992). He went into romantic mode for Frankie and Johnny (1991). In 1992, he finally won the Academy Award for Best Actor for his amazing performance in Scent of a Woman (1992). A mixture of technical perfection (he plays a blind man) and charisma, the role was tailor-made for him, and remains a classic. The next few years would see Pacino becoming more comfortable with acting and movies as a business, turning out great roles in great films with more frequency and less of the demanding personal involvement of his wilder days. Carlito's Way (1993) proved another gangster classic, as did the epic crime drama Heat (1995) directed by Michael Mann and co-starring Robert De Niro, although they only had a few scenes together. He returned to the director's chair for the highly acclaimed and quirky Shakespeare adaptation Looking for Richard (1996). City Hall (1996), Donnie Brasco (1997) and The Devil's Advocate (1997) all came out in this period. Reteaming with Mann and then Oliver Stone, he gave two commanding performances in The Insider (1999) and Any Given Sunday (1999). In the 2000s, Pacino starred in a number of theatrical blockbusters, including Ocean's Thirteen (2007), but his choice in television roles (the vicious Roy Cohn in the HBO miniseries Angels in America (2003) and his sensitive portrayal of Jack Kevorkian, in the television movie You Don't Know Jack (2010)) are reminiscent of the bolder choices of his early career. Each television project garnered him an Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie. In his personal life, Pacino is one of Hollywood's most enduring and notorious bachelors, having never been married. He has a daughter, Julie Marie, with acting teacher Jan Tarrant, and a new set of twins with longtime girlfriend Beverly D'Angelo. His romantic history includes a long-time romance with \"Godfather\" co-star Diane Keaton. With his intense and gritty performances, Pacino was an original in the acting profession. His Method approach would become the process of many actors throughout time, and his unbeatable number of classic roles has already made him a legend among film buffs and all aspiring actors and directors. His commitment to acting as a profession and his constant screen dominance has established him as one of the movies' true legends. Pacino has never abandoned his love for the theater, and Shakespeare in particular, having directed the Shakespeare adaptation Looking for Richard (1996) and played Shylock in The Merchant of Venice (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzg1ODAyNl5BMl5BanBnXkFtZTYwMjAxODQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000199","name":"Al Pacino","nicknames":["Sonny"],"idIMDB":"nm0000199"},"actorId":"nm0000199","character":"Sonny","urlCharacter":"http://www.imdb.com/character/ch0009439","main":true},{"actorName":"Gary Springer","urlProfile":"http://www.imdb.com/name/nm0819725","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4ODk0MTY0MF5BMl5BanBnXkFtZTcwODA1NzkxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1959","placeOfBirth":" New York City, New York, USA","bio":"Gary Springer was born on July 29, 1959 in New York City, New York, USA. He is an actor and producer, known for Dog Day Afternoon (1975), Jaws 2 (1978) and Hometown U.S.A. (1979).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4ODk0MTY0MF5BMl5BanBnXkFtZTcwODA1NzkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0819725","name":"Gary Springer","idIMDB":"nm0819725"},"actorId":"nm0819725","character":"Stevie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Broderick","urlProfile":"http://www.imdb.com/name/nm0110814","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMjA4MTU5Ml5BMl5BanBnXkFtZTcwMDQ2ODUxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 March 1927","placeOfBirth":" Charlestown, New Hampshire, USA","birthName":"James Joseph Broderick III","bio":"James Broderick was born on March 7, 1927 in Charlestown, New Hampshire, USA as James Joseph Broderick III. He was an actor and director, known for Family (1976), Dog Day Afternoon (1975) and As the World Turns (1956). He was married to Patricia Broderick. He died on November 1, 1982 in New Haven, Connecticut, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMjA4MTU5Ml5BMl5BanBnXkFtZTcwMDQ2ODUxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0110814","name":"James Broderick","idIMDB":"nm0110814"},"actorId":"nm0110814","character":"Sheldon","urlCharacter":"http://www.imdb.com/character/ch0009441","main":true},{"actorName":"Charles Durning","urlProfile":"http://www.imdb.com/name/nm0001164","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMDk1NTU1OV5BMl5BanBnXkFtZTYwMDA2MjM0._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 February 1923","placeOfBirth":" Highland Falls, New York, USA","birthName":"Charles Edward Durning","height":"5' 8\" (1.73 m)","bio":"WWII veteran, dance instructor and diversely talented stage & screen actor were all inclusions on the resume of this perpetually busy US actor who didn't get in front of the cameras until around the time of his fortieth birthday. The stockily built Charles Durning was one of Hollywood's most dependable and sought after supporting actors. Durning was born in Highland Falls, New York, to Louise Marie (Leonard), a laundress, and James Gerald Durning. His father was an Irish immigrant and his mother was of Irish descent. Durning first got his start in guest appearances in early 1960's TV shows. He scored minor roles over the next decade until he really got noticed by film fans as the sneering, corrupt cop \"Lt. Snyder\" hassling street grifter 'Robert Redford' in the multi award winning mega-hit The Sting (1973). Durning was equally entertaining in the Billy Wilder production of The Front Page (1974), he supported screen tough guy Charles Bronson in the suspenseful western Breakheart Pass (1975) and featured as \"Spermwhale Whalen\" in the story of unorthodox police behavior in The Choirboys (1977). The versatile Durning is equally adept at comedic roles and demonstrated his skills as \"Doc Hopper\" in The Muppet Movie (1979), a feisty football coach in North Dallas Forty (1979), a highly strung police officer berating maverick cop Burt Reynolds in Sharky's Machine (1981), and a light footed, dancing Governor (alongside Burt Reynolds once more) in The Best Little Whorehouse in Texas (1982). Durning continued a regular on screen association with Burt Reynolds appearing in several more feature films together and as \"Dr. Harlan Elldridge\" in the highly popular TV series Evening Shade (1990). On par with his multitude of feature film roles, Durning has always been in high demand on television and has guest starred in Everybody Loves Raymond (1996), Monk (2002) and Rescue Me (2004). Plus, he has appeared in the role of \"Santa Claus\" in five different television movies.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMDk1NTU1OV5BMl5BanBnXkFtZTYwMDA2MjM0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001164","name":"Charles Durning","nicknames":["Charlie","King of Character Actors"],"idIMDB":"nm0001164"},"actorId":"nm0001164","character":"Moretti","urlCharacter":"http://www.imdb.com/character/ch0306224","main":true},{"actorName":"Carmine Foresta","urlProfile":"http://www.imdb.com/name/nm0286148","urlPhoto":"","biography":{"dateOfBirth":"30 September 1925","placeOfBirth":" New York City, New York, USA","birthName":"Carmine Michael Foresta","bio":"Carmine Foresta was born on September 30, 1925 in New York City, New York, USA as Carmine Michael Foresta. He is known for his work on The Godfather: Part II (1974), Dog Day Afternoon (1975) and The Amityville Horror (1979). He died on July 11, 2011 in Saratoga Springs, New York.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0286148","name":"Carmine Foresta","idIMDB":"nm0286148"},"actorId":"nm0286148","character":"Carmine","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0072890","urlIMDB":"http://www.imdb.com/title/tt0072890","business":{"budget":{"money":"$1,800,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$50,000,000","country":"USA","day":"31","month":"12","year":"1977","remarks":""},{"money":"$46,665,856","country":"USA","day":"31","month":"12","year":"1976","remarks":""}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 5 min (125 min)","2 hr 11 min (131 min) (1975) (Finland)"],"soundMix":["Mono"],"color":["Color (Technicolor)"],"aspectRatio":["1.33 : 1 (negative ratio)","1.85 : 1 (intended ratio)"],"camera":["Panavision Cameras and Lenses (uncredited)"],"laboratory":["Technicolor (color by) (as Technicolor®)"],"filmLength":["3,415 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision","Spherical"],"printedFilmFormat":["35 mm"]},"rating":"8.0","filmingLocations":[{"location":"New York, USA"}],"rated":"R","awards":[{"award":"Academy Awards, USA 1976","titlesAwards":[{"titleAwardOutcome":"Won Oscar","categories":[{"category":"Best Writing, Original Screenplay","names":[{"name":"Frank Pierson","id":"nm0682757","role":null}]}]},{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Picture","names":[{"name":"Martin Bregman","id":"nm0106840","role":null},{"name":"Martin Elfand","id":"nm0253292","role":null}]},{"category":"Best Actor in a Leading Role","names":[{"name":"Al Pacino","id":"nm0000199","role":null}]},{"category":"Best Actor in a Supporting Role","names":[{"name":"Chris Sarandon","id":"nm0001697","role":null}]},{"category":"Best Director","names":[{"name":"Sidney Lumet","id":"nm0001486","role":null}]},{"category":"Best Film Editing","names":[{"name":"Dede Allen","id":"nm0020441","role":null}]}]}]},{"award":"Golden Globes, USA 1976","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Motion Picture - Drama","names":[]},{"category":"Best Supporting Actor - Motion Picture","names":[{"name":"John Cazale","id":"nm0001030","role":null}]},{"category":"Best Supporting Actor - Motion Picture","names":[{"name":"Charles Durning","id":"nm0001164","role":null}]},{"category":"Best Director - Motion Picture","names":[{"name":"Sidney Lumet","id":"nm0001486","role":null}]},{"category":"Best Actor in a Motion Picture - Drama","names":[{"name":"Al Pacino","id":"nm0000199","role":null}]},{"category":"Best Screenplay - Motion Picture","names":[{"name":"Frank Pierson","id":"nm0682757","role":null}]},{"category":"Best Acting Debut in a Motion Picture - Male","names":[{"name":"Chris Sarandon","id":"nm0001697","role":null}]}]}]},{"award":"BAFTA Awards 1976","titlesAwards":[{"titleAwardOutcome":"Won BAFTA Film Award","categories":[{"category":"Best Actor","names":[{"name":"Al Pacino","id":"nm0000199","role":null},{"name":"The Godfather: Part II","id":"tt0071562","role":null}]},{"category":"Best Film Editing","names":[{"name":"Dede Allen","id":"nm0020441","role":null}]}]},{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best Direction","names":[{"name":"Sidney Lumet","id":"nm0001486","role":null}]},{"category":"Best Film","names":[]},{"category":"Best Screenplay","names":[{"name":"Frank Pierson","id":"nm0682757","role":null}]},{"category":"Best Sound Track","names":[{"name":"Jack Fitzstephens","id":"nm0280657","role":null},{"name":"Richard P. Cirincione","id":"nm0162758","role":null},{"name":"Sanford Rackow","id":"nm0705242","role":null},{"name":"Stephen A. Rotter","id":"nm0745450","role":null},{"name":"James Sabat","id":"nm0754530","role":null},{"name":"Dick Vorisek","id":"nm0903459","role":null}]}]}]},{"award":"David di Donatello Awards 1976","titlesAwards":[{"titleAwardOutcome":"Won Special David","categories":[{"category":"","names":[{"name":"Martin Bregman","id":"nm0106840","role":null},{"name":"Martin Elfand","id":"nm0253292","role":null}]}]}]},{"award":"Directors Guild of America, USA 1976","titlesAwards":[{"titleAwardOutcome":"Nominated DGA Award","categories":[{"category":"Outstanding Directorial Achievement in Motion Pictures","names":[{"name":"Sidney Lumet","id":"nm0001486","role":null}]}]}]},{"award":"Kansas City Film Critics Circle Awards 1975","titlesAwards":[{"titleAwardOutcome":"Won KCFCC Award","categories":[{"category":"Best Actor","names":[{"name":"Al Pacino","id":"nm0000199","role":null}]}]}]},{"award":"Los Angeles Film Critics Association Awards 1976","titlesAwards":[{"titleAwardOutcome":"Won LAFCA Award","categories":[{"category":"Best Picture","names":[]},{"category":"Best Actor","names":[{"name":"Al Pacino","id":"nm0000199","role":null}]},{"category":"Best Director","names":[{"name":"Sidney Lumet","id":"nm0001486","role":null}]}]}]},{"award":"National Board of Review, USA 1975","titlesAwards":[{"titleAwardOutcome":"Won NBR Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Charles Durning","id":"nm0001164","role":null}]},{"category":"Top Ten Films","names":[]}]}]},{"award":"National Film Preservation Board, USA 2009","titlesAwards":[{"titleAwardOutcome":"Won National Film Registry","categories":[{"category":"","names":[]}]}]},{"award":"New York Film Critics Circle Awards 1975","titlesAwards":[{"titleAwardOutcome":"2nd place NYFCC Award","categories":[{"category":"Best Actor","names":[{"name":"Al Pacino","id":"nm0000199","role":null}]}]},{"titleAwardOutcome":"3rd place NYFCC Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Chris Sarandon","id":"nm0001697","role":null}]}]}]},{"award":"Online Film & Television Association 2015","titlesAwards":[{"titleAwardOutcome":"Won OFTA Film Hall of Fame","categories":[{"category":"Motion Picture","names":[]}]}]},{"award":"San Sebastián International Film Festival 1975","titlesAwards":[{"titleAwardOutcome":"Won Prize San Sebastián","categories":[{"category":"Best Actor","names":[{"name":"Al Pacino","id":"nm0000199","role":null}]}]}]},{"award":"Writers Guild of America, USA 1976","titlesAwards":[{"titleAwardOutcome":"Won WGA Award (Screen)","categories":[{"category":"Best Drama Written Directly for the Screen","names":[{"name":"Frank Pierson","id":"nm0682757","role":null}]}]}]}],"votes":"192,479","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."},{"idCompany":"co0054778","name":"Artists Entertainment Complex"}],"keywords":{"keywords":["shot in the forehead","fbi agent","gay","airport","arrest","shot in the head","asking for forgiveness","reference to barry goldwater","reference to howard johnson's restaurant","telephone","dictating one's will","heist","theft","thief","one day","based on true story","bank","brooklyn","police","hostage","bank employee","hostage situation","sex change operation","bank manager","robber","suicide pact","siege","fbi","unruly crowd","crowd of onlookers","crowd","vietnam war veteran","mob","will","crowd control","protestor","activist","reference to an overdose","bisexual man","bisexual male","bisexual interest","bisexual lead character","gunfire","gun shot","demands","threat","interview","telephone interview","1970s","cops and robbers","frantic","robbery gone wrong","robbery goes wrong","dimwit","brooklyn new york","hostage released","anchorman","doctor","bank guard","male to female transgender","transgendered character","reporter","smoke","fire","pizza boy","gay lover","asthma attack","traveler's cheques","gay man","gay interest","based on real events","prayer","dead body","gurney","sweating","shooting","police car","air conditioning","body search","black american","african american","reference to god","demonstration","protest","father son relationship","f word","bullhorn","apology","reference to wyoming","black comedy","reference to algeria","transgender","true crime","car procession","tv reporter","tv camera","celebrity","pizza delivery boy","marriage","husband wife relationship","attica","nervousness","telephone call","gay liberation","tv news","malapropism","sidekick","transsexual","detective sergeant","detective","bank cashier","bank clerk","bank robber","gay parent","gay father","diabetic shock","diabetic","infidelity","unfaithfulness","adultery","new york city","brooklyn new york city","animal in title","anonymous telephone call","no music","famous line","sergeant","robbery gone awry","rifle","revolver","policeman","police sniper","police officer","pizza","pistol","heist gone wrong","handgun","gun","delivery boy","car","airplane","new york","what happened to epilogue","unhappy marriage","tarmac","sniper","smoking","security guard","police detective","pizza delivery","mother son relationship","media frenzy","last will and testament","gay slur","fainting","extramarital affair","diabetes","catholic","blockbuster","barbershop","banker","bank teller","asthma","helicopter","botched crime","stockholm syndrome","based on article","bank robbery","homosexual"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 16:13:25"}}