{"data":{"movies":[{"title":"With Six You Get Eggroll","originalTitle":"","year":"1968","releaseDate":"19680807","directors":[{"name":"Howard Morris","id":"nm0606593"}],"writers":[{"name":"Gwen Bagni","id":"nm0046772"},{"name":"Paul Dubov","id":"nm0239532"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTc4NzM0NjA2MF5BMl5BanBnXkFtZTgwMTUxNjIzMTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama","Family","Romance"],"plot":"Abby McClure, a widow with three sons, and Jake Iverson, a widower with a teen-age daughter, get fixed up. They start dating and decide to get married. They're not prepared for the hostile reactions from their children, especially Jake's daughter Stacy, who wants to be the woman of the house, and Abby's oldest son Flip, who hates Jake.","simplePlot":"Two widowed people fall in love and marry, unprepared for the hostile reactions of their children.","actors":[{"actorName":"Doris Day","urlProfile":"http://www.imdb.com/name/nm0000013","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTQ1MTQwMF5BMl5BanBnXkFtZTYwMzc3ODM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 April 1922","placeOfBirth":" Cincinnati, Ohio, USA","birthName":"Doris Mary Ann Kappelhoff","height":"5' 7\" (1.7 m)","bio":"One of America's most prolific actresses was born Doris Mary Ann Kappelhoff on April 3, 1922, in Cincinnati, Ohio, to Alma Sophia (Welz), a housewife, and William Joseph Kappelhoff, a music teacher and choir master. Her grandparents were all German immigrants. She had two brothers, Richard, who died before she was born and Paul, a few years older. Her parents divorced while she was still a child and she lived with her mother. Like most little girls, Doris liked to dance. At fourteen, she formed a dance act with a boy, Jerry Doherty, and they won $500 in a local talent contest. She and Jerry took a brief trip to Hollywood to test the waters. They felt they could succeed, so she and Jerry returned to Cincinnati with the intention of packing and making a permanent move to Hollywood. Tragically, the night before she was to move to Hollywood, she was injured riding in a car hit by a train, ending the possibility of a dancing career. It was a terrible setback, but after taking singing lessons she found a new vocation, and at age 17, she began touring with the Les Brown Band. She met trombonist Al Jorden, whom she married in 1941. Jorden was prone to violence and they divorced after two years, not long after the birth of their son Terry. In 1946, Doris married George Weidler, but this union lasted less than a year. Day's agent talked her into taking a screen test at Warner Bros. The executives there liked what they saw and signed her to a contract (her early credits are often confused with those of another actress named Doris Day, who appeared mainly in B westerns in the 1930s and 1940s). Her first starring movie role was in Romance on the High Seas (1948). The next year, she made two more films, My Dream Is Yours (1949) and It's a Great Feeling (1949). Audiences took to her beauty, terrific singing voice and bubbly personality, and she turned in fine performances in the movies she made (in addition to several hit records). She made three films for Warner Bros. in 1950 and five more in 1951. In that year, she met and married Martin Melcher, who adopted her young son Terry, who later grew up to become Terry Melcher, a successful record producer. In 1953, Doris starred in Calamity Jane (1953), which was a major hit, and several more followed: Lucky Me (1954), Love Me or Leave Me (1955), The Man Who Knew Too Much (1956) and what is probably her best-known film, Pillow Talk (1959). She began to slow down her filmmaking pace in the 1960s, even though she started out the decade with a hit, Please Don't Eat the Daisies (1960). In 1958, her brother Paul died. Around this time, her husband, who had also taken charge of her career, had made deals for her to star in films she didn't really care about, which led to a bout with exhaustion. The 1960s weren't to be a repeat of the previous busy decade. She didn't make as many films as she had in that decade, but the ones she did make were successful: Do Not Disturb (1965), The Glass Bottom Boat (1966), Where Were You When the Lights Went Out? (1968) and With Six You Get Eggroll (1968). Martin Melcher died in 1968, and Doris never made another film, but she had been signed by Melcher to do her own TV series, The Doris Day Show (1968). That show, like her movies, was also successful, lasting until 1973. After her series went off the air, she made only occasional TV appearances. By the time Martin Melcher died, Doris discovered she was millions of dollars in debt. She learned that Melcher had squandered virtually all of her considerable earnings, but she was eventually awarded $22 million by the courts in a case against a man that Melcher had unwisely let invest her money. She married for the fourth time in 1976 and since her divorce in 1980 has devoted her life to animals. Today, she runs the Doris Day Animal League in Carmel, California, which advocates homes and proper care of household pets.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTQ1MTQwMF5BMl5BanBnXkFtZTYwMzc3ODM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000013","name":"Doris Day","nicknames":["Do-Do","Clara Bixby","Eunice"],"idIMDB":"nm0000013"},"actorId":"nm0000013","character":"Abby McClure","urlCharacter":"http://www.imdb.com/character/ch0147602","main":true},{"actorName":"Brian Keith","urlProfile":"http://www.imdb.com/name/nm0001417","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA1MzAwOTM2NF5BMl5BanBnXkFtZTYwNTk1MjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 November 1921","placeOfBirth":" Bayonne, New Jersey, USA","birthName":"Robert Keith Richey Jr.","height":"6' 0½\" (1.84 m)","bio":"Son of character actor Robert Keith and stage actress Helena Shipman. He grew up on the road with his parents while they toured in plays. First appeared at age 3 in film Pied Piper Malone (1924) with his father. Began acting in radio programs and on stage before World War II. Joined the Marines and served as a machine gunner. Returned to Broadway stage after the war and branched out into television and film. Worked as an extra in several films before achieving speaking roles and subsequent stardom.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA1MzAwOTM2NF5BMl5BanBnXkFtZTYwNTk1MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001417","name":"Brian Keith","idIMDB":"nm0001417"},"actorId":"nm0001417","character":"Jake Iverson","urlCharacter":"http://www.imdb.com/character/ch0147604","main":true},{"actorName":"Pat Carroll","urlProfile":"http://www.imdb.com/name/nm0140946","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMDkxNzc3N15BMl5BanBnXkFtZTcwNTE4NjIzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1927","placeOfBirth":" Shreveport, Louisiana, USA","birthName":"Patricia Ann Angela Bridget Carroll","bio":"She has played everything from chatterbox wives to wicked stepsisters on TV, and from Gertrude Stein to Shakespeare's Falstaff on stage. At age 80 plus, the plucky comedienne shows no signs of stopping any time soon. The riotous Pat Carroll was born in Shreveport, Louisiana in 1927, the daughter of Kathryn Angela Meagher and Maurice Clifton Carroll. Her family moved to Los Angeles when Pat was five, and there began performing in local stage productions. She graduated from Hollywood's Immaculate Heart High School, an all-girls Catholic school, then attended Immaculate College, also in Los Angeles, and Catholic University of America. Following her college graduation, she began performing comedy in nightclubs and gained early experience with appearances in resort areas. Her stage debut in 1947 with a role in \"The Goose and the Gander\" starring Gloria Swanson led to hundreds of stock roles. She made her off-Broadway debut in the play \"Come What May\" in 1950. Also a talented singer, she earned a Tony nomination for her Broadway work in the singing revue \"Catch a Star\" in 1955, and then enjoyed a number of brash showcases in such musicals as \"On the Town,\" \"Once Upon a Mattress\" and \"The Unsinkable Molly Brown\". It was, however, the \"golden age\" of TV that truly took advantage of Pat's adroit talents. An initial \"second banana\" regular on the variety programs The Red Buttons Show (1952) and The Saturday Night Revue (1953), she copped an Emmy award for her work on Caesar's Hour (1954) as Howard Morris' wife and earned fine reviews from her recurring role on the sitcom Make Room for Daddy (1953) playing Bunny Halper, the pert and plucky wife of Danny Thomas' nightclub manager Charlie Halper (Sid Melton). Pat's down-to-earth demeanor, chummy disposition and hearty, infectious laugh made her a popular guest on all the major talkfests and a welcomed panelist on such game shows as \"You Don't Say,\" \"To Tell the Truth,\" \"I've Got a Secret\" and \"Password\". In 1965, she co-starred on TV as one of the wicked stepsisters in the endearing Rodgers and Hammerstein's musical Cinderella (1965), which starred Lesley Ann Warren as the princess-to-be. In later years she won recurring/regular roles on the last season of Too Close for Comfort (1980) [retitled in 1986 as \"The Ted Knight Show\"] and the Suzanne Somers' sitcom She's the Sheriff (1987). As a character actress, the cropped-blond comedienne never made much of a dent in film, which included supporting roles in With Six You Get Eggroll (1968) with Doris Day and The Brothers O'Toole (1973) with John Astin. In the late 1970s her career received a huge shot in the arm with the award-winning, one-woman show \"Gertrude Stein, Gertrude Stein, Gertrude Stein\", which she also produced and won multiple theater awards, including the Outer Critics Circle and Drama Desk trophies. A complete departure from her usual comedy antics, audiences saw a burgeoning dramatic actress in the making. Taking the show on the road for four years, she also won a Grammy for her recorded version of the performance in 1981. She then returned to Broadway after thirty years to appear in the play \"Dancing in the End Zone\" (1985). Pat surprised her fans by continuing vigorously in this vein. She began taking on Shakespearean roles and earning critical acclaim. For her interpretations of Sir John Falstaff in \"The Merry Wives of Windsor\" and the Nurse in \"Romeo and Juliet\" she won bookend Helen Hayes awards. A life member of The Actors Studio, other challenging stage roles over the years have included Volpone, Mother Courage (another Helen Hayes award), the Stage Manager in \"Our Town\" and the Chorus in a Broadway revival of \"Electra\". Still interested in tickling the funny bone on occasion, she has performed in a number of adaptations of the wacky musical comedy \"Nunsense\" playing the Reverend Mother. If this weren't enough, she has extended herself into directing, helming a musical version of \"Alice in Wonderland\" for The Kennedy Center, as well as productions of \"Private Lives and \"The Supporting Cast\". Since the late 1980s Pat has become a voice-over favorite on numerous animated programs -- notably for Disney as the sea witch Ursula in The Little Mermaid (1989). She has three children (oldest son Sean and daughters Kerry and Tara) by late husband Lee Karsian, a one-time manager and talent agent. Tara Karsian is a character actress from stage, film and TV. Kerry Karsian' is a casting director.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMDkxNzc3N15BMl5BanBnXkFtZTcwNTE4NjIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0140946","name":"Pat Carroll","idIMDB":"nm0140946"},"actorId":"nm0140946","character":"Maxine Scott","urlCharacter":"http://www.imdb.com/character/ch0341417","main":true},{"actorName":"Barbara Hershey","urlProfile":"http://www.imdb.com/name/nm0001347","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNzQ1NjU1N15BMl5BanBnXkFtZTcwNjYzMTkwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1948","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Barbara Lynn Herzstein","height":"5' 5\" (1.65 m)","bio":"Barbara Hershey was born Barbara Lynn Herzstein in Hollywood, California, to Melrose (Moore) and Arnold Nathan Herzstein, a horse racing columnist. Her father, born in Manhattan, was from a Jewish family (from Hungary and Russia), and her mother, originally from Arkansas, had English and Scots-Irish ancestry. Hershey was raised in a small bungalow, and had aspirations of being an actress from her earliest memories. The multi-award-winning actress has been in some of Hollywood's most memorable films. She has been a winner of an Emmy and a Golden Globe for A Killing in a Small Town (1990). She won two consecutive Best Actress awards at the Cannes Film Festival, (which is unprecedented) for Shy People (1987) and A World Apart (1988). She won a Gemini Award for Anne of Green Gables: A New Beginning (2008) for PBS and a Lifetime Achievement Award at the Vienna International Film Festival. Hershey was nominated for an Academy Award for The Portrait of a Lady (1996). She's worked with some of the world's great directors, among them - Martin Scorsese, William Wyler, Woody Allen, Jane Campion and Darren Aronofsky. The versatile actress was first discovered by a talent agent while she was attending Hollywood High School. She began working in television, The Monroes (1966), and film, With Six You Get Eggroll (1968), with Doris Day. And with roles in The Baby Maker (1970) and Boxcar Bertha (1972), Hershey quickly advanced to starring roles. The 1980's catapulted Hershey's film career, when she starred in The Stunt Man (1980) with 'Peter O'Toole', The Right Stuff (1983), The Natural (1984) with Robert Redford, Hannah and Her Sisters (1986) with Woody Allen, Hoosiers (1986) with Gene Hackman, Tin Men (1987), Shy People (1987), The Last Temptation of Christ (1988), A World Apart (1988) and Beaches (1988) with Bette Midler. Hershey returned to television in 1990 with her highly-lauded performance in A Killing in a Small Town (1990), Paris Trout (1991), Return to Lonesome Dove (1993), the British mini-series, Daniel Deronda (2002) and the last season of Chicago Hope (1994). During the same period, Hershey remained active in features. She was nominated for an Oscar and Golden Globe for The Portrait of a Lady (1996). She also starred in Merchant-Ivory's La fille d'un soldat ne pleure jamais (1998) and the award-winning Australian film, Lantana (2001). Recently, Hershey has recently performed in James Wan's cult-hit, Insidious (2010) and Darren Aronofsky's award-winning Black Swan (2010), playing Natalie Portman's insane mother. Hershey resides in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNzQ1NjU1N15BMl5BanBnXkFtZTcwNjYzMTkwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001347","name":"Barbara Hershey","idIMDB":"nm0001347"},"actorId":"nm0001347","character":"Stacey Iverson","urlCharacter":"http://www.imdb.com/character/ch0147606","main":true},{"actorName":"George Carlin","urlProfile":"http://www.imdb.com/name/nm0137506","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODgzNTk0NV5BMl5BanBnXkFtZTcwNjU1MjY3MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1937","placeOfBirth":" New York City, New York, USA","birthName":"George Denis Patrick Carlin","height":"5' 9\" (1.75 m)","bio":"Born and raised by his mother in Manhattan, New York City. His parents divorced when he was two months. His mother (as well as his father) worked in marketing, where they met. The long hours the mother worked left the young George by himself for long hours every day, providing him (in his own words), the time he needed to think about various subjects, listen to radio, and practice his impersonations, that where acclaimed by his mother and coworkers since an early age. Carlin started out as a conventional comedian and had achieved a fair degree of success as a Bill Cosby style raconteur in nightclubs and on TV until the late 1960s, when he radically overhauled his persona. His routines became more insightful, introducing more serious subjects. As he aged, he became more cynic and bitter, unintentionally changing his stage persona again in a radical way throughout the 90s. This new George Carlin, usually referred to as the late George Carlin, is one of the most acclaimed and enjoyed by the public and critics. Carlin's forte is Lenny Bruce-style social and political commentary, spiced with nihilistic observations about people and religion peppered with black humor. He is also noted for his masterful knowledge and use of the English language. Carlin's notorious \"Seven Dirty Words\" comedy routine was part of a radio censorship case that made its way to the U.S. Supreme Court in 1978.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODgzNTk0NV5BMl5BanBnXkFtZTcwNjU1MjY3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0137506","name":"George Carlin","nicknames":["Georgie Porgie","Curious George"],"idIMDB":"nm0137506"},"actorId":"nm0137506","character":"Herbie Fleck","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alice Ghostley","urlProfile":"http://www.imdb.com/name/nm0315933","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMDQxMjA4NV5BMl5BanBnXkFtZTcwNjMwNDkwOA@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 August 1923","placeOfBirth":" Eve, Missouri, USA","birthName":"Alice Margaret Ghostley","bio":"Whether portraying a glum, withering wallflower, a drab and dowdy housewife, a klutzy maid or a cynical gossip, eccentric character comedienne Alice Ghostley had the ability to draw laughs from the skimpiest of material with a simple fret or whine. Making a name for herself on the Tony-winning Broadway stage, her eternally forlorn looks later evolved as an amusingly familiar plain-Jane presence on TV sitcoms and in an occasional film or two during the 50s, 60s and 70s. Alice was born in a whistle-stop railroad station in the tiny town of Eve, Missouri, where her father was employed as a telegraph operator. She grew up in various towns in the Midwest (Arkansas, Oklahoma) and began performing from the age of 5 where she was called upon to recite poetry, sing and tap-dance. Spurred on by a high school teacher, she studied drama at the University of Oklahoma but eventually left in order to pursue a career in New York with her sister Gladys. Teaming together in an act called \"The Ghostley Sisters\", Alice eventually went solo and developed her own cabaret show as a singer and comedienne. She also toiled as a secretary to a music teacher in exchange for singing lessons, worked as a theater usherette in order to see free stage shows, paid her dues as a waitress, worked once for a detective agency, and even had a stint as a patch tester for a detergent company. No glamourpuss by any stretch of the imagination, she built her reputation as a singing funny lady. The short-statured, auburn-haired entertainer received her star-making break singing the satirical ditty \"The Boston Beguine\" in the Broadway stage revue \"New Faces of 1952\", which also showcased up-and-coming stars Eartha Kitt, Carol Lawrence, Hogan's Heroes co-star Robert Clary and Paul Lynde to whom she would be invariably compared to what with their similarly comic demeanors. The film version of New Faces (1954)_ featured pretty much the same cast. She and \"male counterpart\" Lynde would appear together in the same films and/or TV shows over the years. With this momentum started, she continued on Broadway with the short-lived musicals \"Sandhog\" (1954) featuring Jack Cassidy, \"Trouble in Tahiti\" (1955), \"Shangri-La\" (1956), again starring Jack Cassidy, and the legit comedy \"Maybe Tuesday\" (1958). A reliable sketch artist, she fared much better on stage in the 1960s playing a number of different characterizations in both \"A Thurber Carnival\" (1960), and opposite Bert Lahr in \"The Beauty Part\" (1962), for which she received a Tony nomination. She finally nabbed the Tony trophy as \"featured actress\" for her wonderful work as Mavis in the comedy play \"The Sign in Sidney Brustein's Window\" (1965). By this time Alice had established herself on TV. She and good friend Kaye Ballard stole much of the proceedings as the evil stepsisters in the classic Julie Andrews version of Cinderella (1957), and she also recreated her Broadway role in a small screen adaptation of _Shangri-La (1960) (TV)_. Although it was mighty hard to take away her comedy instincts, she did appear in a TV production of \"Twelfth Night\" as Maria opposite Maurice Evans' Malvolio, and graced such dramatic programs as \"Perry Mason\" and \"Naked City\", as well as the film To Kill a Mockingbird (1962). She kept herself in the TV limelight as a frequent panelist on such game shows as \"The Hollywood Squares\" and \"The Match Game\". Enjoying a number of featured roles in such lightweight comedy fare as My Six Loves (1963) with Debbie Reynolds, With Six You Get Eggroll (1968) starring Doris Day, and the Joan Rivers starrer Rabbit Test (1978), she also had a small teacher role in the popular film version of Grease (1978). Alice primarily situated herself, however, on the sitcom circuit and appeared in a number of recurring 'nervous Nellie\" roles, topping it off as the painfully shy, dematerializing and accident-prone witch nanny Esmeralda in Bewitched (1964) from 1969-1972 (replacing the late Marion Lorne, who had played bumbling Aunt Clara), and as the batty friend Bernice in Designing Women (1986). In 1978 Alice replaced Dorothy Loudon as cruel Miss Hannigan in \"Annie\", her last Broadway stand. Alice would play the mean-spirited scene-stealer on and off for nearly a decade in various parts of the country. Other musicals during this time included \"Take Me Along\", \"Bye, Bye Birdie\" (as the overbearing mother), and the raucous revue \"Nunsense\". A series of multiple strokes ended her career come the millennium and she passed away of colon cancer on September 21, 2007. Her long-time husband of fifty years, Italian comedic actor Felice Orlandi died in 2003. The couple had no children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMDQxMjA4NV5BMl5BanBnXkFtZTcwNjMwNDkwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0315933","name":"Alice Ghostley","idIMDB":"nm0315933"},"actorId":"nm0315933","character":"Molly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Findlater","urlProfile":"http://www.imdb.com/name/nm0277512","urlPhoto":"","biography":{"dateOfBirth":"28 August 1943","placeOfBirth":" Los Angeles, California, USA","bio":"John Findlater was born on August 28, 1943 in Los Angeles, California, USA. He is an actor, known for Airport (1970), Peyton Place (1964) and With Six You Get Eggroll (1968). He has been married to Vicki DeBenedictis since July 22, 1995. They have one child. He was previously married to Catherine Mary Stewart.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0277512","name":"John Findlater","idIMDB":"nm0277512"},"actorId":"nm0277512","character":"Flip McClure","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elaine Devry","urlProfile":"http://www.imdb.com/name/nm0222986","urlPhoto":"","biography":{"dateOfBirth":"10 January 1930","placeOfBirth":" Compton, California, USA","birthName":"Thelma Elaine Mahnken","height":"5' 9\" (1.75 m)","bio":"Elaine Devry was born on January 10, 1930 in Compton, California, USA as Thelma Elaine Mahnken. She is an actress, known for The Cheyenne Social Club (1970), Herbie Rides Again (1974) and Diary of a Madman (1963). She was previously married to Mickey Rooney and Dan Ducich.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0222986","name":"Elaine Devry","idIMDB":"nm0222986"},"actorId":"nm0222986","character":"Cleo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Herb Voland","urlProfile":"http://www.imdb.com/name/nm0901343","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNzM3MDExMV5BMl5BanBnXkFtZTcwNzM1MjUyOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 October 1918","placeOfBirth":" New Rochelle, New York, USA","birthName":"Herbert Maurice Voland","height":"5' 11½\" (1.82 m)","bio":"Herb Voland was born on October 2, 1918 in New Rochelle, New York, USA as Herbert Maurice Voland. He was an actor, known for Airplane! (1980), With Six You Get Eggroll (1968) and Death Sentence (1974). He died on April 26, 1981 in Riverside, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNzM3MDExMV5BMl5BanBnXkFtZTcwNzM1MjUyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0901343","name":"Herb Voland","idIMDB":"nm0901343"},"actorId":"nm0901343","character":"Harry Scott","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jamie Farr","urlProfile":"http://www.imdb.com/name/nm0268026","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MjY4MDI4Nl5BMl5BanBnXkFtZTYwMzU3NzMy._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 July 1934","placeOfBirth":" Toledo, Ohio, USA","birthName":"Jameel Joseph Farah","height":"5' 9\" (1.75 m)","bio":"Jamie Farr was born on July 1, 1934 in Toledo, Ohio, USA as Jameel Joseph Farah. He is an actor, known for M*A*S*H (1972), Port Charles (1997) and Scrooged (1988). He has been married to Joy Ann Richards since February 16, 1963. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MjY4MDI4Nl5BMl5BanBnXkFtZTYwMzU3NzMy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0268026","name":"Jamie Farr","idIMDB":"nm0268026"},"actorId":"nm0268026","character":"Jo Jo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Christopher","urlProfile":"http://www.imdb.com/name/nm0160639","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTgwMTg5MF5BMl5BanBnXkFtZTYwNzM3NzEz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1932","placeOfBirth":" Evanston, Illinois, USA","birthName":"William Wallace Christopher","height":"5' 9\" (1.75 m)","bio":"William Christopher was born on October 20, 1932 in Evanston, Illinois, USA as William Wallace Christopher. He was an actor, known for M*A*S*H (1972), After MASH (1983) and The Fortune Cookie (1966). He was married to Barbara Christopher. He died on December 31, 2016 in Pasadena, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTgwMTg5MF5BMl5BanBnXkFtZTYwNzM3NzEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0160639","name":"William Christopher","nicknames":["Bill"],"idIMDB":"nm0160639"},"actorId":"nm0160639","character":"Zip - Cloud","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Milton Frome","urlProfile":"http://www.imdb.com/name/nm0296330","urlPhoto":"","biography":{"dateOfBirth":"24 February 1909","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"6' 2\" (1.88 m)","bio":"Milton Frome was born on February 24, 1909 in Philadelphia, Pennsylvania, USA. He was an actor, known for Batman: The Movie (1966), The Nutty Professor (1963) and Bye Bye Birdie (1963). He was married to Marjorie. He died on March 21, 1989 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0296330","name":"Milton Frome","idIMDB":"nm0296330"},"actorId":"nm0296330","character":"Bud Young","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Allan Melvin","urlProfile":"http://www.imdb.com/name/nm0578510","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MjQzMjIzM15BMl5BanBnXkFtZTcwNDI1NDYxOA@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 February 1923","placeOfBirth":" Kansas City, Missouri, USA","birthName":"Allan John Melvin","height":"5' 11\" (1.8 m)","bio":"Allan Melvin was born on February 18, 1923 in Kansas City, Missouri, USA as Allan John Melvin. He was an actor, known for The Phil Silvers Show (1955), Archie Bunker's Place (1979) and All in the Family (1971). He was married to Amalia Faustina Sestero. He died on January 17, 2008 in Brentwood, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MjQzMjIzM15BMl5BanBnXkFtZTcwNDI1NDYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0578510","name":"Allan Melvin","idIMDB":"nm0578510"},"actorId":"nm0578510","character":"Desk Sergeant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Steele","urlProfile":"http://www.imdb.com/name/nm0824649","urlPhoto":"","biography":{"bio":"Richard Steele is an actor, known for With Six You Get Eggroll (1968), The Main Event (1979) and Hot Splash (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0824649","name":"Richard Steele","idIMDB":"nm0824649"},"actorId":"nm0824649","character":"Jason McClure","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jimmy Bracken","urlProfile":"http://www.imdb.com/name/nm0102790","urlPhoto":"","biography":{"dateOfBirth":"16 January 1957","placeOfBirth":" Los Angeles, California, USA","bio":"Jimmy Bracken was born on January 16, 1957 in Los Angeles, California, USA. He is an actor, known for With Six You Get Eggroll (1968), Secrets of the Pirates' Inn (1969) and Big Wednesday (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0102790","name":"Jimmy Bracken","idIMDB":"nm0102790"},"actorId":"nm0102790","character":"Mitch McClure","urlCharacter":"http://www.imdb.com/character/ch0147608","main":true}],"seasons":[],"idIMDB":"tt0063821","urlIMDB":"http://www.imdb.com/title/tt0063821","business":{"budget":null,"openingWeekend":null,"gross":[],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 35 min (95 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm"]},"rating":"6.4","filmingLocations":[{"location":"Toluca Lake, Los Angeles, California, USA"}],"rated":"G","awards":[{"award":"Laurel Awards 1970","titlesAwards":[{"titleAwardOutcome":"3rd place Golden Laurel","categories":[{"category":"Female Comedy Performance","names":[{"name":"Doris Day","id":"nm0000013","role":null}]}]}]}],"votes":"1,999","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026936","name":"Arwin Productions"},{"idCompany":"co0114899","name":"Cinema Center Films"}],"keywords":{"keywords":["widow","widower","matchmaker","marriage","family comedy","food in title","truck driver","sheepdog","police","newlywed","large family","jail","in laws","dysfunctional family","camper","automobile accident","hippie","dog","drive in restaurant","quarrel","psychedelic rock","mod","elopement","love","family relationships","diva","independent film","title spoken by character","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:28:41"}}