{"data":{"movies":[{"title":"This Is a Hijack","originalTitle":"","year":"1973","releaseDate":"19750502","directors":[{"name":"Barry Pollack","id":"nm0689358"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEzNTg3Njg3M15BMl5BanBnXkFtZTgwNDcyODk1MDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Thriller","Drama"],"plot":"A gambler with serious debts hijacks a small private plane, planning to collect a $1,000,000 ransom. Unfortunately, he's not in the best of company with his mates, and the F.B.I. is waiting for them on the ground ...","simplePlot":"A gambler with serious debts hijacks a small private plane, planning to collect a $1,000,000 ransom. Unfortunately, he's not in the best of company with his mates, and the F.B.I. is waiting... ","actors":[{"actorName":"Adam Roarke","urlProfile":"http://www.imdb.com/name/nm0730126","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NjEzNTUwMl5BMl5BanBnXkFtZTcwNjc0NDYzOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 August 1937","placeOfBirth":" Brooklyn, New York, USA","birthName":"Richard Jordan Gerler","bio":"Burly Brooklyn-born tough guy Adam Roarke made an infamous name for himself in 1960s biker flicks, usually donning a black leather jacket and a mean, mean scowl, typically the head of a bunch of hell-raisers. Nine of his more than 30 films would be in motorcycle movies, sometimes at odds with young rebel Jack Nicholson before his 'Easy Rider' fame. The former Richard Jordan Gerler was destined to become some type of entertainer as his dad was a vaudeville comic and his mom a chorus girl. His parents met while performing in the Ziegfeld Follies. A former gang member living on the streets of New York, he eventually straightened up by enlisting in the Army. Following this he studied acting at the Beverly Hills Playhouse and earned a Universal contract to boot. Adam appeared on TV in all the \"hip\" 60s shows at the time such as \"The Mod Squad\" and \"Star Trek.\" His cult films include Hells Angels on Wheels (1967) with Nicholson, The Savage Seven (1968), Psych-Out (1968) again with Nicholson, Hell's Belles (1969) and Platinum Pussycat (1968) In addition, he appeared on horseback in John Wayne's western El Dorado (1967), and co-starred with Anthony Perkins in Play It As It Lays (1972), Peter Fonda in Dirty Mary Crazy Larry (1974), and Peter O'Toole in The Stunt Man (1980). Parts grew scarce in the early 80s and Adam decided to focus his attentions on teaching. In 1982 he opened the Film Actor's Lab in Dallas, Texas and settled. One of his students would be Lou Diamond Phillips of the movie La Bamba fame. Ironically, Adam's last film was a featured role in the low-budget film Sioux City (1994) starring and directed by former protégé Phillips. Adam died two years later of a heart attack in his sleep in the Dallas-Fort Worth suburb of Euless, Texas. The 60s 'leader of the pack' prototype was survived by wife Carla.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NjEzNTUwMl5BMl5BanBnXkFtZTcwNjc0NDYzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0730126","name":"Adam Roarke","idIMDB":"nm0730126"},"actorId":"nm0730126","character":"Mike Christie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lynn Borden","urlProfile":"http://www.imdb.com/name/nm0096143","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNjAxOTUxMV5BMl5BanBnXkFtZTcwODQwNTIzNA@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 March 1937","placeOfBirth":" Detroit, Michigan, USA","birthName":"Lynn Freyse","height":"5' 7\" (1.7 m)","bio":"Most famous for her role in the 1972 low-budget shocker Frogs (1972), this talented actress has rarely received any large roles. She was originally going to play the lead in 1964's Roustabout (1964). She had a memorable role in the action film Dirty Mary Crazy Larry (1974), though small, and has starred sporadically in feature films and TV movies.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNjAxOTUxMV5BMl5BanBnXkFtZTcwODQwNTIzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0096143","name":"Lynn Borden","idIMDB":"nm0096143"},"actorId":"nm0096143","character":"Diane","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jay Robinson","urlProfile":"http://www.imdb.com/name/nm0732717","urlPhoto":"","biography":{"dateOfBirth":"14 April 1930","placeOfBirth":" New York City, New York, USA","bio":"Character actor Jay Robinson owned a pair of the narrowest, cruelest-looking eyes in 1950s Hollywood. To complement them was an evil-looking sneer, crisp and biting diction and a nefarious-sounding cackle. These were all draped upon a lean, bony physique that could slither about menacingly like a ready-to-pounce cobra. With that in mind, he made an auspicious film debut as Caligula in The Robe (1953), stealing much of the proceedings from the movie's actual stars Richard Burton, Jean Simmons and Victor Mature. Though many complained that Jay's interpretation bordered dangerously on outrageous camp, his depraved Roman emperor nevertheless remains the most indelible image when reminded of the epic costumer. Born on April 14, 1930 in New York City, Jay came from a fine upbringing, tutored at private schools both here and in Europe. His background in summer stock and repertory companies eventually attracted Broadway work in the Shakespeare classics \"As You Like It\" (1950) and \"Much Ado About Nothing\" (1952). He also appeared in and produced the play, \"Buy Me Blue Ribbons,\" in 1951, which was short-lived. After his movie bow, Jay went on to reprise the scenery-chewing character Caligula in Demetrius and the Gladiators (1954) with Mature and Susan Hayward, and offered typically eye-catching supporting turns in The Virgin Queen (1955), starring Bette Davis, and My Man Godfrey (1957), with David Niven and June Allyson. However, it was at this juncture that things started going horribly wrong for Jay. His new-found celebrity reportedly went to his head and he became extremely difficult to work with. In addition, the volatile actor began experimenting recklessly with drugs. In 1958, he was booked for possession of narcotics (methadone) and sentenced to a year in jail. Free on bail, the incident and resulting notoriety ruined his career. After scraping up work outside the entertainment industry as a cook and landlord, he recovered from his drug addiction and married. Resuming work in obscure bit parts, he had another career relapse when he was forced to spend 15 months in jail after an old warrant was served on him. In the late 1960s, Jay started appearing again on television. He even prodded the memory of his own character Caligula character by playing an impertinent Julius Caesar on an episode of Bewitched (1964). However, it took a huge star like Bette Davis, who had always recognized and appreciated his talent, to help him regain a footing in movies again when she insisted he take a prime role in her movie, Bunny O'Hare (1971). The movie failed miserably, deservedly so, but Jay prevailed and managed to repair his status with a number of delightfully flamboyant and hammy performances. Jay played fun parts along the way in Woody Allen's Everything You Always Wanted to Know About Sex * But Were Afraid to Ask (1972), Warren Beatty's Shampoo (1975) and even Paul Reubens' Big Top Pee-wee (1988). While he played the delightfully eccentric Dr. Shrinker on The Krofft Supershow (1976) for one season, he somewhat balanced this silliness with made-for-video Shakespearean performances of Macbeth (1981), The Tragedy of Othello, the Moor of Venice (1981) and Richard II (1982). Some horror roles fell his way as well with Train Ride to Hollywood (1975), in which he played Dracula, Transylvania Twist (1989) and Bram Stoker's Bram Stoker's Dracula (1992). In 1997, Jay proved an ideal host for the Discovery Channel's Beyond Bizarre (1997). Jay Robinson died at age 83 of congestive heart failure in his home in Sherman Oaks, California on September 27, 2013.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0732717","name":"Jay Robinson","idIMDB":"nm0732717"},"actorId":"nm0732717","character":"Simon Scott","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dub Taylor","urlProfile":"http://www.imdb.com/name/nm0852305","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1OTgxMzA0OF5BMl5BanBnXkFtZTcwNDY4ODUwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 February 1907","placeOfBirth":" Richmond, Virginia, USA","birthName":"Walter Clarence Taylor II","bio":"Dub Taylor was born on February 26, 1907 in Richmond, Virginia, USA as Walter Clarence Taylor II. He was an actor, known for Back to the Future Part III (1990), Bonnie and Clyde (1967) and Maverick (1994). He was married to Florence Gertrude Heffernan. He died on October 3, 1994 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1OTgxMzA0OF5BMl5BanBnXkFtZTcwNDY4ODUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0852305","name":"Dub Taylor","idIMDB":"nm0852305"},"actorId":"nm0852305","character":"Sheriff Gordon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sandy Balson","urlProfile":"http://www.imdb.com/name/nm0051161","urlPhoto":"","biography":{"dateOfBirth":"18 December 1930","placeOfBirth":" USA","birthName":"Sandra Balson","bio":"Sandy Balson was born on December 18, 1930 in the USA as Sandra Balson. She was an actress, known for Last of the Red Hot Lovers (1972), This Is a Hijack (1973) and Half a House (1975). She died on January 21, 2015.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0051161","name":"Sandy Balson","idIMDB":"nm0051161"},"actorId":"nm0051161","character":"Mrs. Phillips","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sam Chew Jr.","urlProfile":"http://www.imdb.com/name/nm0156780","urlPhoto":"","biography":{"dateOfBirth":"20 August 1942","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Samuel Chew Jr","bio":"Sam Chew, Jr. was born and raised in Philadelphia, Penn. A graduate of Temple University, class of 1965, he worked as an announcer/DJ in Philadelphia and moved to Hollywood in 1965. He was a contract player at 20th Century Fox along with James Brolin and Tom Selleck from 1966-1968. He has appeared in hundreds of TV shows: The Love Boat, Dynasty, Eight Is Enough, Cannon, Mannix, Barnaby Jones, among others as a guest star. He is active also in the commercial/spokesperson field, and does extensive narration and voiceover work.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0156780","name":"Sam Chew Jr.","idIMDB":"nm0156780"},"actorId":"nm0156780","character":"Pierce","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nikki Diamond","urlProfile":"http://www.imdb.com/name/nm7661025","urlPhoto":"","biography":{"bio":"Nikki Diamond is an actress, known for This Is a Hijack (1973).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7661025","name":"Nikki Diamond","idIMDB":"nm7661025"},"actorId":"nm7661025","character":"Hollis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Agneta Eckemyr","urlProfile":"http://www.imdb.com/name/nm0248555","urlPhoto":"","biography":{"dateOfBirth":"2 July 1950","placeOfBirth":" Karlsborg, Västra Götalands län, Sweden","bio":"Agneta Marie-Anne Eckemyr (born 2 July 1950 in Karlsborg) is a Swedish actress and model turned clothing designer. Initially a model, her looks took her into film and television roles. She was photographed by Life Magazine appearing opposite the five semi-finalist actors for the role of James Bond in \"On Her Majesty's Secret Service.\" Shortly after appearing in the 1974 Disney family film production \"The Island at the Top of the World,\" Eckemyr appeared on the front cover and within the October 1975 edition of Playboy magazine, as a Playboy Playmate. After retirement from being an actress, she turned her talents to clothing design. Her most recent designs are featured at Älskling (Swedish for Darling), on Columbus Avenue, New York City; a block from where she lives in an apartment overlooking Central Park.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0248555","name":"Agneta Eckemyr","idIMDB":"nm0248555"},"actorId":"nm0248555","character":"Cami","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Biff Elliot","urlProfile":"http://www.imdb.com/name/nm0254187","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MjYxOTM4MF5BMl5BanBnXkFtZTcwMzc2MTMwMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1923","placeOfBirth":" Lynn, Massachusetts, USA","birthName":"Leon Shalek","bio":"Biff Elliot was born on July 26, 1923 in Lynn, Massachusetts, USA as Leon Shalek. He was an actor, known for I, the Jury (1953), PT 109 (1963) and Alfred Hitchcock Presents (1955). He was married to Constance K. Bandy and Elizabeth A. Dole. He died on August 15, 2012 in Studio City, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MjYxOTM4MF5BMl5BanBnXkFtZTcwMzc2MTMwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0254187","name":"Biff Elliot","idIMDB":"nm0254187"},"actorId":"nm0254187","character":"Neal Hanaford","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jacqueline Giroux","urlProfile":"http://www.imdb.com/name/nm0321017","urlPhoto":"","biography":{"birthName":"Jackie Giroux","height":"5' 6\" (1.68 m)","bio":"Ms. Giroux is co-founder and a director of Global Universal Film Group, Inc., due to her expertise in film financing and World Wide business and film relationships. Giroux was President of the public Company FoneFriend Inc. (OTC: BB) until July 2003, as well as a founder and director. Ms. Giroux is a writer, producer and director of feature films. She won a scholarship to the New York American Academy of Dramatic Arts, and has appeared in many off Broadway and Broadway plays. Her career in films was launched with a lead role in \"The Cross and the Switch Blade\", starring Pat Boone and Eric Estrada. In addition to starring in the film, Ms. Giroux single-handedly promoted the film by touring, lecturing and selling advance tickets on behalf of the film, to organizations such as The Kiwanis Clubs, The Masons, Church Groups, Colleges, Family Oriented Groups, and drug rehabilitation Centers, which earned Ms. Giroux keys to the various Cities and distinguished achievement awards. Ms. Giroux has appeared in fifteen feature films and several TV series; including the hit film, \"To Live and Die in LA\", directed by Billy Friedkin for MGM in 1985. Since then, she has written and produced ten feature films and two \"Movies of the Week.\" including Damsel of Death, the only true story, as dictated by Aileen Wuornos and her family and friends. Ms. Giroux has extensive experience in structuring financing and co-production deals, having successfully arranged for co-productions between Canada, France and Germany, as well as Canada, France and Australia. In 2000, she wrote and directed \"Coo Coo Café\", a satire on the media networks, filmed at Millbrook Studios in New Brunswick Canada. \"Coo Coo Café\" was a nominee in the New York Film and Video Film Festival, and later invited to participate in the Sundance Film Festival. Ms. Giroux was instrumental in securing the spokeswoman services of bi-lingual actress/artist Barbara Carrera for FoneFriend Promotional Videos/Commercials and created the test market commercials, \"Nobody takes MY FoneFriend!\" Recently Ms. Giroux completed the television pilot \"You've Got the Part!\" an online casting show, which will soon debut on You Tube and My Space. Ms. Giroux created the entire show, plus contracted four television sponsors to assist in the production. She has also been recently contracted to assist director Ryan Fleck (\"Half Nelson\") on his next feature film, Sugar, in the Dominican Republic, utilizing Global's \"below the line\" service agreement with Santo Domingo Film/Serie 23 Productions. She is a bondable producer via Film Finances, having line produced ten films on time and budget.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0321017","name":"Jacqueline Giroux","idIMDB":"nm0321017"},"actorId":"nm0321017","character":"Belinda","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Isen","urlProfile":"http://www.imdb.com/name/nm1019808","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxODUxOTY0Nl5BMl5BanBnXkFtZTgwMjg2NDQ1MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Charles Isen is an actor, known for Sweet November (2001), This Is a Hijack (1973) and Stitch in Time (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxODUxOTY0Nl5BMl5BanBnXkFtZTgwMjg2NDQ1MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1019808","name":"Charles Isen","nicknames":["Chuck"],"idIMDB":"nm1019808"},"actorId":"nm1019808","character":"Harry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Art Koulias","urlProfile":"http://www.imdb.com/name/nm0467980","urlPhoto":"","biography":{"dateOfBirth":"8 April 1919","placeOfBirth":" Lowell, Massachusetts, USA","bio":"Art Koulias was born on April 8, 1919 in Lowell, Massachusetts, USA. He was an actor, known for The Naked Road (1959), Deadman's Curve (1978) and This Is a Hijack (1973). He died on January 6, 2008 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0467980","name":"Art Koulias","idIMDB":"nm0467980"},"actorId":"nm0467980","character":"Ritchie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carol Locatell","urlProfile":"http://www.imdb.com/name/nm0479841","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MjEwNjcwNV5BMl5BanBnXkFtZTcwMDY2NDg3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1940","placeOfBirth":"","bio":"Carol Locatell was born on December 13, 1940. She is an actress, known for The Family Stone (2005), Friday the 13th: A New Beginning (1985) and Coffy (1973).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MjEwNjcwNV5BMl5BanBnXkFtZTcwMDY2NDg3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0479841","name":"Carol Locatell","idIMDB":"nm0479841"},"actorId":"nm0479841","character":"Jennifer Pierce","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jennifer Lee Pryor","urlProfile":"http://www.imdb.com/name/nm0497503","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMjU4NjU5NV5BMl5BanBnXkFtZTcwMDIxMzYzMg@@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"bio":"Jennifer Lee Pryor is an actress and producer, known for The Sunshine Boys (1975), Something Came Over Them (2005) and The Duchess and the Dirtwater Fox (1976). She was previously married to Richard Pryor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMjU4NjU5NV5BMl5BanBnXkFtZTcwMDIxMzYzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0497503","name":"Jennifer Lee Pryor","idIMDB":"nm0497503"},"actorId":"nm0497503","character":"Edy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Duncan McLeod","urlProfile":"http://www.imdb.com/name/nm0572800","urlPhoto":"","biography":{"dateOfBirth":"26 July 1918","placeOfBirth":" Glenfinnan, Scotland, UK","birthName":"Murdo Duncan McLeod","bio":"Duncan McLeod was born on July 26, 1918 in Glenfinnan, Scotland as Murdo Duncan McLeod. He was an actor, known for Bill & Ted's Excellent Adventure (1989), Beyond the Valley of the Dolls (1970) and Sometimes They Come Back (1991). He was married to Pamela Marvin. He died on November 25, 2005 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0572800","name":"Duncan McLeod","idIMDB":"nm0572800"},"actorId":"nm0572800","character":"Gil Gresham","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0072277","urlIMDB":"http://www.imdb.com/title/tt0072277","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 29 min (89 min) (Germany)","1 hr 25 min (85 min) (UK)","1 hr 30 min (90 min) (USA)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["DeLuxe"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.5","filmingLocations":[],"rated":"PG","awards":[],"votes":"40","type":"Movie","companyCreditsSimple":[],"keywords":{"keywords":["debt","gambler","ransom","pilot","employer employee relationship","police","industrialist","wealth","gambling debt","gambling","kidnapping","airplane","hijacking","boss","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 21:48:44"}}