{"data":{"movies":[{"title":"A Man Alone","originalTitle":"","year":"1955","releaseDate":"19551017","directors":[{"name":"Ray Milland","id":"nm0001537"}],"writers":[{"name":"John Tucker Battle","id":"nm0061510"},{"name":"Mort Briskin","id":"nm0109858"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MTQ1ODI3MF5BMl5BanBnXkFtZTYwMjM4MjU5._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Romance","Western"],"plot":"A gunfighter, stranded in the desert, comes across the aftermath of a stage robbery, in which all the passengers were killed. He takes one of the horses to ride to town to report the massacre, but finds himself accused of it. He also finds himself accused of the murder of the local banker, and winds up hiding in the basement of a house where the local sheriff, who is very sick, lives with his daughter.","simplePlot":"A gunfighter's main hope lies in the trust of a beautiful woman who hides him out when he is wrongly suspected of a stagecoach massacre.","actors":[{"actorName":"Ray Milland","urlProfile":"http://www.imdb.com/name/nm0001537","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMjgyNDYwN15BMl5BanBnXkFtZTYwNjUxNjI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 January 1905","placeOfBirth":" Neath, Glamorgan, Wales, UK","birthName":"Reginald Alfred John Truscott-Jones","height":"6' 1\" (1.86 m)","bio":"Ray Milland became one of Paramount's most bankable and durable stars, under contract from 1934 to 1948, yet little in his early life suggested a career as a motion picture actor. Milland was born Alfred Reginald Jones in the Welsh town of Neath, Glamorgan, to Elizabeth Annie (Truscott) and Alfred Jones. He spent his youth in the pursuit of sports. He became an expert rider early on, working at his uncle's horse-breeding estate while studying at the King's College in Cardiff. At 21, he went to London as a member of the elite Household Cavalry (Guard for the Royal Family), undergoing a rigorous 19-months training, further honing his equestrian skills, as well as becoming adept at fencing, boxing and shooting. He won trophies, including the Bisley Match, with his unit's crack rifle team. However, after four years, he suddenly lost his means of financial support (independent income being a requirement as a Guardsman) when his stepfather discontinued his allowance. Broke, he tried his hand at acting in small parts on the London stage. There are several stories as to how he derived his stage name. It is known, that during his teens he called himself \"Mullane\", using his stepfather's surname. He may later have suffused \"Mullane\" with \"mill-lands\", an area near his hometown. When he first appeared on screen in British films, he was billed first as Spike Milland, then Raymond Milland. In 1929, Ray befriended the popular actress Estelle Brody at a party and, later that year, visited her on the set of her latest film, The Plaything (1929). While having lunch, they were joined by a producer who persuaded the handsome Welshman to appear in a motion picture bit part. Ray rose to the challenge and bigger roles followed, including the male lead in The Lady from the Sea (1929). The following year, he was signed by MGM and went to Hollywood, but was given little to work with, except for the role of Charles Laughton's ill-fated nephew in Payment Deferred (1932). After a year, Ray was out of his contract and returned to England. His big break did not come until 1934 when he joined Paramount, where he was to remain for the better part of his Hollywood career. During the first few years, he served an apprenticeship playing second leads, usually as the debonair man-about-town, in light romantic comedies. He appeared with Burns and Allen in Many Happy Returns (1934), enjoyed third-billing as a British aristocrat in the Claudette Colbert farce The Gilded Lily (1935) and was described as \"excellent\" by reviewers for his role in the sentimental drama Alias Mary Dow (1935). By 1936, he had graduated to starring roles, first as the injured British hunter rescued on a tropical island by The Jungle Princess (1936), the film which launched Dorothy Lamour's sarong-clad career. After that, he was the titular hero of Bulldog Drummond Escapes (1937) and, finally, won the girl (rather than being the \"other man\") in Mitchell Leisen's screwball comedy Easy Living (1937). He also re-visited the tropics in Ebb Tide (1937), Her Jungle Love (1938) and Tropic Holiday (1938), as well as being one of the three valiant brothers of Beau Geste (1939). In 1940, Ray was sent back to England to star in the screen adaptation of Terence Rattigan's French Without Tears (1940), for which he received his best critical reviews to date. He was top-billed (above John Wayne) running a ship salvage operation in Cecil B. DeMille's lavish Technicolor adventure drama Reap the Wild Wind (1942), besting Wayne in a fight - much to the \"Duke's\" personal chagrin - and later wrestling with a giant octopus. Also that year, he was directed by Billy Wilder in a charming comedy, The Major and the Minor (1942) (co-starred with Ginger Rogers), for which he garnered good notices from Bosley Crowther of the New York Times. Ray then played a ghost hunter in The Uninvited (1944), and the suave hero caught in a web of espionage in Fritz Lang's thriller Ministry of Fear (1944). On the strength of his previous role as \"Major Kirby\", Billy Wilder chose to cast Ray against type in the ground-breaking drama The Lost Weekend (1945) as dipsomaniac writer \"Don Birnam\". Ray gave the defining performance of his career, his intensity catching critics, used to him as a lightweight leading man, by surprise. Crowther commented \"Mr. Milland, in a splendid performance, catches all the ugly nature of a 'drunk', yet reveals the inner torment and degradation of a respectable man who knows his weakness and his shame\" (New York Times, December 3, 1945). Arrived at the high point of his career, Ray Milland won the Oscar for Best Actor, as well as the New York Critic's Award. Rarely given such good material again, he nonetheless featured memorably in many more splendid films, often exploiting the newly discovered \"darker side\" of his personality: as the reporter framed for murder by Charles Laughton's heinous publishing magnate in The Big Clock (1948); as the sophisticated, manipulating art thief \"Mark Bellis\" in the Victorian melodrama So Evil My Love (1948) (for which producer Hal B. Wallis sent him back to England); as a Fedora-wearing, Armani-suited \"Lucifer\", trawling for the soul of an honest District Attorney in Alias Nick Beal (1949); and as a traitorous scientist in The Thief (1952), giving what critics described as a \"sensitive\" and \"towering\" performance. In 1954, Ray played calculating ex-tennis champ \"Tony Wendice\", who blackmails a former Cambridge chump into murdering his wife, in Alfred Hitchcock's Dial M for Murder (1954). He played the part with urbane sophistication and cold detachment throughout, even in the scene of denouement, calmly offering a drink to the arresting officers. With Lisbon (1956), Ray Milland moved into another direction, turning out several off-beat, low-budget films with himself as the lead, notably The Safecracker (1958) and Panic in Year Zero! (1962). At the same time, he cheerfully made the transition to character parts, often in horror and sci-fi outings. In accordance with his own dictum of appearing in anything that had \"any originality\", he worked on two notable pictures with Roger Corman: first, as a man obsessed with catalepsy in Premature Burial (1962); secondly, as obsessed self-destructive surgeon \"Dr. Xavier\" in X: The Man with the X-Ray Eyes (1963)-the Man with X-Ray Eyes, a film which, despite its low budget, won the 1963 Golden Asteroid in the Trieste Festival for Science Fiction. As the years went on, Ray gradually disposed of his long-standing toupee, lending dignity through his presence to many run-of-the-mill television films, such as Cave In! (1983) and maudlin melodramas like Love Story (1970). He guest-starred in many anthology series on television and had notable roles in Rod Serling's Night Gallery (1969) and the original Battlestar Galactica (1978) (as Quorum member Sire Uri). He also enjoyed a brief run on Broadway, starring as \"Simon Crawford\" in \"Hostile Witness\" (1966), at the Music Box Theatre. In his private life, Ray was an enthusiastic yachtsman, who loved fishing and collecting information by reading the Encyclopedia Brittanica. In later years, he became very popular with interviewers because of his candid spontaneity and humour. In the same self-deprecating vein he wrote an anecdotal biography, \"Wide-Eyed in Babylon\", in 1976. A film star, as well as an outstanding actor, Ray Milland died of cancer at the age of 81 in March 1986.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMjgyNDYwN15BMl5BanBnXkFtZTYwNjUxNjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001537","name":"Ray Milland","idIMDB":"nm0001537"},"actorId":"nm0001537","character":"Wes Steele","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mary Murphy","urlProfile":"http://www.imdb.com/name/nm0614500","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmM5NTk2MzQtYzhiZi00NjgwLTlhMDYtNzNlMzViMWVjNzY0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 January 1931","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Mary Louise Murphy","height":"5' 4\" (1.63 m)","bio":"This actress' two-decade career produced only one single stand-out film role but that one role as the \"good girl\" who redeems \"bad boy\" Marlon Brando's tough biker in the cult flick The Wild One (1953) put Mary Murphy at the head of the acting class for one brief shining moment. In others, she proved a lovely distraction amid the male action surrounding her and also, given the right material, displayed obvious talent in both Grade \"A\" and \"B\" drama as the feminine co-star or second lead. The beautiful blue-eyed brunet stunner was born on January 26, 1931, in Washington D.C. but quickly moved with her family six months later to Cleveland, Ohio. Her father, James, a businessman, died there in 1940, and her mother eventually moved Mary and her two brothers and sister (she was the youngest of the four) West to Southern California where Mary went on to attend University High School in the Los Angeles area, graduating in 1949. A one-time employee of Saks Fifth Avenue in Beverly Hills, the fresh-faced beauty was \"discovered\" at a café and signed by Paramount Studios. Following insignificant bit/extra work in such movies as the Bob Hope's vehicles The Lemon Drop Kid (1951) and My Favorite Spy (1951), the sci-fi feature When Worlds Collide (1951), and \"Best Picture\" The Greatest Show on Earth (1952), Mary won the female lead opposite relative newcomer Tommy Morton in the show business drama Main Street to Broadway (1953). The film was ill-received and both stars were rather dwarfed by the huge names that surrounded them -- Tallulah Bankhead, Lionel Barrymore, Ethel Barrymore, Shirley Booth, Mary Martin and even Rodgers and Hammerstein. Her second lead in a film was a different story. the legendary The Wild One (1953) opposite Marlon Brando. Mary managed to hold her own in this biker classic but it did not, however, necessarily lead to better films. She continued in the demure ingénue mode in the Vincent Price sub-horror The Mad Magician (1954) and the routine western Sitting Bull (1954) which starred future husband Dale Robertson. The Juen 1956 marriage to Robertson was very short-lived; it was annulled by Christmas time. Mary went on, however, to give earnest leading lady perfs opposite Tony Curtis in Beachhead (1954), Ray Milland's debut as a director, A Man Alone (1955) and Hell's Island (1955) with John Payne. She also appeared to good advantage in The Desperate Hours (1955) but was slightly overshadowed by powerhouse star cast of Humphrey Bogart, Fredric March, Arthur Kennedy, Gig Young and Martha Scott. From then on it was fairly dismal for Mary in such lesser features as The Maverick Queen (1956), The Electronic Monster (1958) and Live Fast, Die Young (1958), a lowbudget \"Wild Ones\" delinquent crimer as a girl who tries to save her sister from a life of crime. Mary left the screen for a time but resumed her career in the 60s and early 70s primarily on TV with a number of episodics and mini-movies playing matronly wives and mothers and had a small but noticeable role in the film Junior Bonner (1972). Remarried in 1962, Mary retired completely by the late 70s and turned to environmental causes. She also worked in a Los Angeles art gallery for a time and has been seen on occasion in nostalgia conventions.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmM5NTk2MzQtYzhiZi00NjgwLTlhMDYtNzNlMzViMWVjNzY0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0614500","name":"Mary Murphy","idIMDB":"nm0614500"},"actorId":"nm0614500","character":"Nadine Corrigan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ward Bond","urlProfile":"http://www.imdb.com/name/nm0000955","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNDA1Nzk5OF5BMl5BanBnXkFtZTcwMzE2NDQyOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1903","placeOfBirth":" Benkelman, Nebraska, USA","birthName":"Wardell E. Bond","height":"6' 2\" (1.88 m)","bio":"Gruff, burly American character actor. Born in 1903 in Benkelman, Nebraska (confirmed by Social Security records; sources stating 1905 or Denver, Colorado are in error.) Bond grew up in Denver, the son of a lumberyard worker. He attended the University of Southern California, where he got work as an extra through a football teammate who would become both his best friend and one of cinema's biggest stars: John Wayne. Director John Ford promoted Bond from extra to supporting player in the film Salute (1929), and became another fast friend. An arrogant man of little tact, yet fun-loving in the extreme, Bond was either loved or hated by all who knew him. His face and personality fit perfectly into almost any type of film, and he appeared in hundreds of pictures in his more than 30-year career, in both bit parts and major supporting roles. In the films of Wayne and Ford, particularly, he was nearly always present. Among his most memorable roles are John L. Sullivan in Gentleman Jim (1942), Det. Tom Polhaus in The Maltese Falcon (1941) and the Rev. Capt. Samuel Johnson Clayton The Searchers (1956). An ardent but anti-intellectual patriot, he was perhaps the most vehement proponent, among the Hollywood community, of blacklisting in the witch hunts of the 1950s, and he served as a most unforgiving president of the ultra-right-wing Motion Picture Alliance for the Preservation of American Ideals. In the mid-'50s he gained his greatest fame as the star of TV's Wagon Train (1957). During its production, Bond traveled to Dallas, Texas, to attend a football game and died there in his hotel room of a massive heart attack.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNDA1Nzk5OF5BMl5BanBnXkFtZTcwMzE2NDQyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000955","name":"Ward Bond","idIMDB":"nm0000955"},"actorId":"nm0000955","character":"Sheriff Gil Corrigan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Raymond Burr","urlProfile":"http://www.imdb.com/name/nm0000994","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMDMxOTU3MF5BMl5BanBnXkFtZTYwNDQ1NDM2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 May 1917","placeOfBirth":" New Westminster, British Columbia, Canada","birthName":"Raymond William Stacey Burr","height":"6' 1½\" (1.87 m)","bio":"Born Raymond William Stacy Burr on 21 May 1917 in New Westminster, British Columbia, Burr spent most of his early life traveling. As a youngster, his father moved his family to China, where the elder Burr worked as a trade agent. When the family returned to Canada, Raymond's parents separated. He and his mother moved to Vallejo, California, where she raised him with the aid of her parents. As he got older, Burr began to take jobs to support his mother, younger sister and younger brother. He took jobs as a ranch hand in Roswell, New Mexico; as a deputy sheriff; a photo salesman; and even as a singer in nightclubs. In World War II, Burr served in the United States Navy. In Okinawa, he was shot in the stomach and sent home. In 1946, Burr made his film debut in San Quentin (1946). From there, he appeared in more than 90 films before landing the role of defense attorney Perry Mason (1957). After a battle with cancer, Burr died at age 76 on September 12, 1993 at his ranch home in Sonoma, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMDMxOTU3MF5BMl5BanBnXkFtZTYwNDQ1NDM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000994","name":"Raymond Burr","nicknames":["Ray"],"idIMDB":"nm0000994"},"actorId":"nm0000994","character":"Stanley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arthur Space","urlProfile":"http://www.imdb.com/name/nm0816475","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmI4ODk0ODEtNGNlNS00NzE5LTk4YzEtN2ZjMzNmMTZlZTA0XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 October 1908","placeOfBirth":" New Brunswick, New Jersey, USA","birthName":"Charles Arthur Space","height":"5' 10\" (1.78 m)","bio":"Arthur Space was born on October 12, 1908 in New Brunswick, New Jersey, USA as Charles Arthur Space. He was an actor, known for National Velvet (1960), The Spirit of St. Louis (1957) and 20 Million Miles to Earth (1957). He was married to Mary (Mollie) Campbell. He died on January 13, 1983 in Hollywood, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmI4ODk0ODEtNGNlNS00NzE5LTk4YzEtN2ZjMzNmMTZlZTA0XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0816475","name":"Arthur Space","idIMDB":"nm0816475"},"actorId":"nm0816475","character":"Doctor Mason","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lee Van Cleef","urlProfile":"http://www.imdb.com/name/nm0001812","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0ODU1NjY5N15BMl5BanBnXkFtZTcwNTI0NzEyMw@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 January 1925","placeOfBirth":" Somerville, New Jersey, USA","birthName":"Clarence Leroy Van Cleef Jr.","height":"6' 2\" (1.88 m)","bio":"One of the great movie villains, Clarence Leroy Van Cleef, Jr. was born in Somerville, New Jersey, to Marion Lavinia (Van Fleet) and Clarence LeRoy Van Cleef, Sr. His parents were both of Dutch ancestry. Van Cleef started out as an accountant. He served in the U.S. Navy aboard minesweepers and subchasers during World War II. After the war he worked as an office administrator, becoming involved in amateur theatrics in his spare time. An audition for a professional role led to a touring company job in \"Mr. Roberts\". His performance was seen by Stanley Kramer, who cast him as henchman Jack Colby in High Noon (1952), a role that brought him great recognition despite the fact that he had no dialogue. For the next decade he played a string of memorably villainous characters, primarily in westerns but also in crime dramas such as The Big Combo (1955). His hawk nose and steely, slit eyes seemed destined to keep him always in the realm of heavies, but in the mid-Sergio Leone cast him as the tough but decent Col. Mortimer opposite Clint Eastwood in For a Few Dollars More (1965). A new career as a western hero (or at least anti-hero) opened up, and Van Cleef became an international star, though in films of decreasing quality. In the 1980s he moved easily into action and martial-arts movies, and starred in The Master (1984), a TV series featuring almost non-stop martial arts action. He died of a heart attack in December 1989, and was buried at Forest Lawn in the Hollywood Hills.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0ODU1NjY5N15BMl5BanBnXkFtZTcwNTI0NzEyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001812","name":"Lee Van Cleef","idIMDB":"nm0001812"},"actorId":"nm0001812","character":"Clanton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alan Hale Jr.","urlProfile":"http://www.imdb.com/name/nm0001308","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMjY1ODIyM15BMl5BanBnXkFtZTcwMTQ1NDg5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 March 1921","placeOfBirth":" Los Angeles, California, USA","birthName":"Alan Hale Mackahan Jr.","height":"6' 2\" (1.88 m)","bio":"The son of the great character actor (and Errol Flynn sidekick) Alan Hale, Alan Hale Jr. (he dropped the Jr. after his father passed away) was literally born into the movies. Hale did his first movie as a baby and continued to act until his death. Unlike other child actors, Hale made a smooth transition in the movies and starred in several classics like Up Periscope (1959), The Lady Takes a Flyer (1957) and The West Point Story (1950), as well as many westerns. He did a lot of television guest appearances as well before getting his role as The Skipper on the cult comedy Gilligan's Island (1964). After the show went off the air, Hale continued to act and even teamed up with Gilligan co-star Bob Denver in the The Good Guys (1968), a CBS-TV comedy that lasted only two years. After that ended, Hale kept busy acting in guest shots and maintained his business interests which included a restaurant and travel agency.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMjY1ODIyM15BMl5BanBnXkFtZTcwMTQ1NDg5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001308","name":"Alan Hale Jr.","nicknames":["The Skipper"],"idIMDB":"nm0001308"},"actorId":"nm0001308","character":"Jim Anderson","urlCharacter":"http://www.imdb.com/character/ch0492530","main":true},{"actorName":"Douglas Spencer","urlProfile":"http://www.imdb.com/name/nm0817930","urlPhoto":"","biography":{"dateOfBirth":"10 February 1910","placeOfBirth":" Princeton, Illinois, USA","birthName":"William Henry Mesenkop","height":"6' 2\" (1.88 m)","bio":"Douglas Spencer was born on February 10, 1910 in Princeton, Illinois, USA as William Henry Mesenkop. He is known for his work on The Thing from Another World (1951), Shane (1953) and The Three Faces of Eve (1957). He died on October 6, 1960 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0817930","name":"Douglas Spencer","idIMDB":"nm0817930"},"actorId":"nm0817930","character":"Henry Slocum","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thomas Browne Henry","urlProfile":"http://www.imdb.com/name/nm0378015","urlPhoto":"","biography":{"dateOfBirth":"7 November 1907","placeOfBirth":" Los Angeles, California, USA","bio":"If you've ever seen a war picture, sci-fi epic or western from the 1940s or 1950s, then you've seen Thomas Browne Henry, and more than once. Along with Morris Ankrum, Henry is probably the army officer most responsible for helping Earth drive off hordes of invading outer-space monsters, aliens and other unwelcome intruders. His stocky build, sharply etched face, commanding voice and no-nonsense, get-down-to-business style were just right for the scores of generals, colonels, bankers, political leaders and other authority figures he played over his long and prolific career. Born in California, he had a very successful career as a stage actor and director, and was closely associated with the renowned Pasadena Playhouse, before breaking into films in 1948 (his brother, William Henry, was also an actor) and played a succession of cops, sheriffs, district attorneys, professors and, of course, army officers over the next 20+ years. He finally retired in 1970 and went back to his first love, the theater, again back to the Pasadena Playhouse. He died in 1980.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0378015","name":"Thomas Browne Henry","nicknames":["Dean of the Pasadena Playhouse"],"idIMDB":"nm0378015"},"actorId":"nm0378015","character":"Maybanks","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Grandon Rhodes","urlProfile":"http://www.imdb.com/name/nm0722438","urlPhoto":"","biography":{"dateOfBirth":"7 August 1904","placeOfBirth":" Jersey City, New Jersey, USA","birthName":"Grandon Neviers Augustine Rolker","bio":"Grandon Rhodes was born on August 7, 1904 in Jersey City, New Jersey, USA as Grandon Neviers Augustine Rolker. He was an actor, known for Born Yesterday (1950), All the King's Men (1949) and Earth vs. the Flying Saucers (1956). He was married to Ruth Lee and Eveta Bryant. He died on June 9, 1987 in Encino, Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0722438","name":"Grandon Rhodes","idIMDB":"nm0722438"},"actorId":"nm0722438","character":"Luke Joiner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Martin Garralaga","urlProfile":"http://www.imdb.com/name/nm0307986","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjJhYWEyZTAtODQ2Zi00YjlhLTk1YTEtMmIxZDZhZDU1NzVhXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1894","placeOfBirth":" Barcelona, Catalonia, Spain","birthName":"Norman Garralaag","bio":"Martin Garralaga was born on November 10, 1894 in Barcelona, Catalonia, Spain as Norman Garralaag. He was an actor, known for Lonely Are the Brave (1962), For Whom the Bell Tolls (1943) and The Left Handed Gun (1958). He died on June 12, 1981 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjJhYWEyZTAtODQ2Zi00YjlhLTk1YTEtMmIxZDZhZDU1NzVhXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0307986","name":"Martin Garralaga","idIMDB":"nm0307986"},"actorId":"nm0307986","character":"Ortega","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kim Spalding","urlProfile":"http://www.imdb.com/name/nm0816719","urlPhoto":"","biography":{"dateOfBirth":"7 December 1915","placeOfBirth":" Washington, Missouri, USA","birthName":"Ross Farris Latimer","bio":"Kim Spalding was born on December 7, 1915 in Washington, Missouri, USA as Ross Farris Latimer. He was an actor, known for It! The Terror from Beyond Space (1958), Three Desperate Men (1951) and A Man Alone (1955). He was married to Jeanne Cagney. He died on November 18, 2000 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0816719","name":"Kim Spalding","idIMDB":"nm0816719"},"actorId":"nm0816719","character":"Sam Hall","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Howard Negley","urlProfile":"http://www.imdb.com/name/nm0624384","urlPhoto":"","biography":{"dateOfBirth":"16 April 1898","placeOfBirth":" Butler, Pennsylvania, USA","birthName":"Howard Jack Negley","bio":"Howard Negley was born on April 16, 1898 in Butler, Pennsylvania, USA as Howard Jack Negley. He was an actor, known for Kansas City Confidential (1952), Annie Was a Wonder (1949) and Mr. Whitney Had a Notion (1949). He was married to Lydia I Powell. He died on November 7, 1983 in Kerrville, Texas, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0624384","name":"Howard Negley","idIMDB":"nm0624384"},"actorId":"nm0624384","character":"Wilson","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0048336","urlIMDB":"http://www.imdb.com/title/tt0048336","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Copyright MCMLV by Republic Pictures Corporation With All Rights Reserved"},"technical":{"runtime":["1 hr 36 min (96 min)"],"soundMix":["Mono (RCA Sound Recording)"],"color":["Color (Trucolor)"],"aspectRatio":["1.37 : 1","1.66 : 1"],"camera":null,"laboratory":["Consolidated Film Industries (CFI), Hollywood (CA), USA (Trucolor by) (as Consolidated Film Industries)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.4","filmingLocations":[{"location":"St. George, Utah, USA"}],"rated":"APPROVED","awards":[],"votes":"523","type":"Movie","companyCreditsSimple":[{"idCompany":"co0020540","name":"Republic Pictures (I)"},{"idCompany":"co0208296","name":"Republic Studio Organization, The"}],"keywords":{"keywords":["gunfighter","banker","stagecoach","desert","sheriff","street shootout","shot to death","1800s","dead child","hiding someone","henchman","nursing back to health","noose","handcuffs","woman with gun","putting sleeping person to bed","father daughter relationship","sick father","held at gunpoint","falling off horse","stagecoach robbery","arizona","shooting a horse","false accusation","yellow fever","windy","undertaker","sneaking","snake","shot in the back","shackles","saved from hanging","sandstorm","child murder","lynch mob","kitten","horse killed","hope chest","gunshot","gunman","framed for murder","fistfight","father daughter hug","falling in love","doctor","dead body","corrupt sheriff","concussion","coffin","church","cellar","cellar door","cat","canned peaches","cactus","bad reputation","small town","trucolor"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:54:08"}}