{"data":{"movies":[{"title":"The Ultimate Warrior","originalTitle":"","year":"1975","releaseDate":"197606","directors":[{"name":"Robert Clouse","id":"nm0167195"}],"writers":[{"name":"Robert Clouse","id":"nm0167195"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGRjYjkzNDUtYmNhOC00ZDBkLWFjYWItZWUxOWM4Y2FjNjAxXkEyXkFqcGdeQXVyMTYxNjkxOQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Sci-Fi"],"plot":"Only a few people still live in New York in 2012. They are organized in gangs with their own turf. One of them is led by Baron, another one by Carrot, and they are constantly at war with each other. Baron's gang is more peaceful and have developed seeds that can germinate despite the virus plague. The lone ranger Carson is hired by Bishop for protection.","simplePlot":"Atomic holocaust is not the only plague that threatens our future. New York City, 2012 A.D.: In a plague devastated world, one tired man finds a reason to fight.","actors":[{"actorName":"Yul Brynner","urlProfile":"http://www.imdb.com/name/nm0000989","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQ2ODQ2MjQ5NV5BMl5BanBnXkFtZTYwODk4MjM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1920","placeOfBirth":" Vladivostok, Primorskaya Oblast, Far Eastern Republic [now Primorsky Krai, Russia]","birthName":"Yuli Borisovich Bryner","height":"5' 8\" (1.73 m)","bio":"Exotic leading man of American films, famed as much for his completely bald head as for his performances, Yul Brynner masked much of his life in mystery and outright lies designed to tease people he considered gullible. It was not until the publication of the books \"Yul: The Man Who Would Be King\" and \"Empire and Odyssey\" by his son, Yul \"Rock\" Brynner, that many of the details of Brynner's early life became clear. Yul sometimes claimed to be a half-Swiss, half-Japanese named Taidje Khan, born on the island of Sakhalin; in reality, he was the son of Marousia Dimitrievna (Blagovidova), the Russian daughter of a doctor, and Boris Yuliyevich Bryner, an engineer and inventor of Swiss-German and Russian descent. He was born in their home town of Vladivostok on 11 July 1920 and named Yuli after his grandfather, Jules Bryner. When Yuli's father abandoned the family, his mother took him and his sister Vera to Harbin, Manchuria, where they attended a YMCA school. In 1934 Yuli's mother took her children to Paris. Her son was sent to the exclusive Lycée Moncelle, but his attendance was spotty. He dropped out and became a musician, playing guitar in the nightclubs among the Russian gypsies who gave him his first real sense of family. He met luminaries such as Jean Cocteau and became an apprentice at the Theatre des Mathurins. He worked as a trapeze artist with the famed Cirque d'Hiver company. He traveled to the U.S. in 1941 to study with acting teacher Michael Chekhov and toured the country with Chekhov's theatrical troupe. That same year, he debuted in New York as Fabian in \"Twelfth Night\" (billed as Youl Bryner). After working in a very early TV series, Mr. Jones and His Neighbors (1944), he played on Broadway in \"Lute Song\" with Mary Martin, winning awards and mild acclaim. He and his wife, actress Virginia Gilmore, starred in the first TV talk show, Mr. and Mrs. (1948). Brynner then joined CBS as a television director. He made his film debut in Port of New York (1949). Two years later Mary Martin recommended him for the part he would forever be known for: the King in Richard Rodgers' and Oscar Hammerstein II's musical \"The King and I\". Brynner became an immediate sensation in the role, repeating it for film (The King and I (1956)) and winning the Oscar for Best Actor. For the next two decades, he maintained a starring film career despite the exotic nature of his persona, performing in a wide range of roles from Egyptian pharaohs to Western gunfighters, almost all with the same shaved head and indefinable accent. In the 1970s he returned to the role that had made him a star, and spent most of the rest of his life touring the world in \"The King and I\". When he developed lung cancer in the mid 1980s, he left a powerful public service announcement denouncing smoking as the cause, for broadcast after his death. The cancer and its complications, after a long illness, ended his life. Brynner was cremated and his ashes buried in a remote part of France, on the grounds of the Abbey of Saint-Michel de Bois Aubry, a short distance outside the village of Luzé. He remains one of the most fascinating, unusual and beloved stars of his time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQ2ODQ2MjQ5NV5BMl5BanBnXkFtZTYwODk4MjM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000989","name":"Yul Brynner","idIMDB":"nm0000989"},"actorId":"nm0000989","character":"Carson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Max von Sydow","urlProfile":"http://www.imdb.com/name/nm0001884","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MDQzOTMwN15BMl5BanBnXkFtZTYwMDgyMjM1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1929","placeOfBirth":" Lund, Skåne län, Sweden","birthName":"Max Carl Adolf von Sydow","height":"6' 4\" (1.93 m)","bio":"Max von Sydow was born Carl Adolf von Sydow on April 10, 1929 in Lund, Skåne, Sweden, to a middle-class family. He is the son of Baroness Maria Margareta (Rappe), a teacher, and Carl Wilhelm von Sydow, an ethnologist and folklore professor. His surname traces back to his father's partial German ancestry. When he was in high school, he and a few fellow students, including Yvonne Lombard, started a theatre club which encouraged his interest in acting. After conscription, he began to study at the Royal Dramatic Theatre's acting school (1948-1951), together with Lars Ekborg, Margaretha Krook and Ingrid Thulin. His first role was as Nils the crofter in Alf Sjöberg's Only a Mother (1949). After graduation, he worked at the city theatres in Norrköping and Malmö. His work in the movies by Ingmar Bergman (especially The Seventh Seal (1957), that includes the iconic scenes in which he plays chess with Death) made him well-known internationally, and he started to get offers from abroad. His career abroad began with him playing Jesus in The Greatest Story Ever Told (1965); Hawaii (1966) and The Quiller Memorandum (1966). Since then, his career includes very different kind of characters, like Karl Oskar Nilsson in The Emigrants (1971); Father Lankester Merrin in The Exorcist (1973); Joubert the assassin in Three Days of the Condor (1975), Emperor Ming in Flash Gordon (1980); the villain Ernst Stavro Blofeld in the Never Say Never Again (1983); Liet-Kynes in Dune (1984) the artist Frederick in Hannah and Her Sisters (1986); Lassefar in Pelle the Conqueror (1987), for which he received his first Academy Award nomination; Dr. Peter Ingham in Awakenings (1990); Lamar Burgess in Minority Report (2002) and The Renter in Extremely Loud & Incredibly Close (2011), which earned him his second Academy Award nomination. He has become one of Sweden's most admired and professional actors and is the only male Swedish actor to receive an Oscar nomination. Max has been nominated twice: for Pelle the Conqueror (1987) in 1988 and for Extremely Loud & Incredibly Close (2011) in 2012. He received the Guldbagge Award for Best Director in his directing debut, the drama film Katinka (1988). In 2016, he joined the sixth season of the HBO series Game of Thrones (2011) as the Three-eyed Raven, which earned him his Primetime Emmy Award nomination.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MDQzOTMwN15BMl5BanBnXkFtZTYwMDgyMjM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001884","name":"Max von Sydow","idIMDB":"nm0001884"},"actorId":"nm0001884","character":"Baron","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joanna Miles","urlProfile":"http://www.imdb.com/name/nm0587151","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMzU5MjE5Nl5BMl5BanBnXkFtZTgwMDkzMjk4NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1940","placeOfBirth":" Nice, Alpes-Maritimes, France","bio":"Joanna Miles, the Emmy Award-winning American actress, was born on March 6, 1940 in Nice, France to expatriate American abstract painter Jeanne Miles and French painter-museum curator Johannes Schiefer. Escaping the war, she was relocated to the United States in 1941. She graduated from the progressive Putney School in 1958. She began her career in New York, acting in a number of plays, television shows and films. On receiving numerous rewards, she reached the apogee of her career, playing \"Laura Wingfield\" in the 1973 TV production of \"The Glass Menagerie\", with co-stars Katharine Hepburn, Sam Waterston and Michael Moriarty, for which Mrs. Miles and Michael Moriarty won Emmy Awards. In 1990, for nine years, Mrs. Miles founded and was the Artistic Director of the Playwright's Group in LA. She also is the vice-president of \"Brandman Productions\". Mrs. Miles has continued to work steadily in TV, films and theater. She is a lifetime member of the Actors Studio and the Motion Picture Academy. Most recently, in 2011, she starred in \"Women In Shorts\", at the Working Stage Theater and, in 2012, among a few other play readings around town \"There Is No They\" at the Road Theater. An ex-New Yorker, she lives in LA with her husband, writer, producer and novelist Michael Brandman. Her son, Miles Brandman, is a film writer, director and playwright. Her stepson, Steven J. Brandman, is a television producer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMzU5MjE5Nl5BMl5BanBnXkFtZTgwMDkzMjk4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0587151","name":"Joanna Miles","idIMDB":"nm0587151"},"actorId":"nm0587151","character":"Melinda","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Smith","urlProfile":"http://www.imdb.com/name/nm0810342","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMzQxNTYzOV5BMl5BanBnXkFtZTcwMDQyOTQ5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 March 1933","placeOfBirth":" Columbia, Missouri, USA","height":"6' 2\" (1.88 m)","bio":"Biker, bare-knuckle brawler, cowboy, Bee-Girl fighter, vampire hunter . . . William Smith has done it all. He was born on March 24, 1933, in Columbia, Missouri, on Rolling Acres, a Hereford cattle ranch. After losing everything to the dust bowl, the family moved to California. From 1942, when he was eight, through young adulthood, Bill appeared in many movies as an extra (uncredited). After high school, he joined the Air Force and served during the Korean War and flew secret ferret missions over Russia while in the NSA. He studied at the University of Munich, and Syracuse University. He graduated cum laude at UCLA. Bill would go on to become one of Hollywood's best-known character actors, with over 300 TV and movie credits. On TV he played in many westerns (did his own horseback riding), cop and sci-fi shows. He's best remembered for appearing in Batman (1966) as, appropriately, Adonis in the last episode. He was a series regular in Hawaii Five-O (1968), where he played Det. James \"Kimo\" Carew (the episode with Cathy Lee Crosby, \"The Kahuna,\" drew particularly high ratings). On the big screen, Bill is legendary for biker flicks (he does his own motorcycle riding). His first biker flick, Run, Angel, Run! (1969), was shot in 13 days for under $100,000--and made $13 million! This was followed by Angels Die Hard (1970). These early, ground-breaking features defined the genre, and would be imitated endlessly (but never duplicated). In the early 1970s, Bill got into horror films--playing a vampire slayer in Grave of the Vampire (1972)--and science fiction, in the camp classic Invasion of the Bee Girls (1973), where he fought killer insect-women wearing sunglasses. Just about everybody's favorite William Smith movie, though, is Any Which Way You Can (1980), where as a bare-knuckle brawler he had a knock-down, drag-out fight with Clint Eastwood that wrecked about half the town. Tougher than Arnold Schwarzenegger, Bill played his dad in Conan the Barbarian (1982), and was one of the few actors in the wildly popular, but critically lambasted, youth-oriented Red Dawn (1984) to receive any recognition from critics. He was in what could be called a textbook example of low-budget, campy sci-fi, Hell Comes to Frogtown (1988). Just about everybody who has ever worked with Bill speaks highly of him. He's educated, intelligent and energetic. A true legend in the business, Bill's acting career is still going strong in 2006, well into the 64th year of his career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMzQxNTYzOV5BMl5BanBnXkFtZTcwMDQyOTQ5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0810342","name":"William Smith","nicknames":["Big Bill"],"idIMDB":"nm0810342"},"actorId":"nm0810342","character":"Carrot","urlCharacter":"http://www.imdb.com/character/ch0165287","main":true},{"actorName":"Richard Kelton","urlProfile":"http://www.imdb.com/name/nm0447126","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMDgzODQ1NV5BMl5BanBnXkFtZTgwNzk0NTczMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1943","placeOfBirth":" Lincoln, Nebraska, USA","birthName":"Richard Duane Kelton","height":"6' 2\" (1.88 m)","bio":"Richard Duane Kelton was born in Lincoln, Nebraska, and was the only child of Fred and Glenna Kelton. While growing up in Miami, Oklahoma, he remembered watching James Dean and cites him as his main influence on becoming an actor. After studying drama at The University of Kansas, he made his way to California where he made his debut playing \"Bud\" in an episode of Gunsmoke (1955). Soon after that he made his TV movie debut as \"Lieutenant Charring\" in Wild Women (1970). He continued in numerous other guest starring roles and a movie roles. He also played the role of \"Nick\" in the Broadway revival of \"Who's Afraid Of Virginia Woolf\" in 1976. He made his starring role as \"Ficus\" in the short-lived science fiction series \"Quark\" (1978). Later that year he was invited back to The University of Kansas to give a short seminar on films. He continued his career until his death in 1978.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMDgzODQ1NV5BMl5BanBnXkFtZTgwNzk0NTczMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0447126","name":"Richard Kelton","nicknames":["Rick or Dick"],"idIMDB":"nm0447126"},"actorId":"nm0447126","character":"Cal","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen McHattie","urlProfile":"http://www.imdb.com/name/nm0570385","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MTM2NTQzN15BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 February 1947","placeOfBirth":" Antigonish, Nova Scotia, Canada","birthName":"Stephen McHattie Smith","height":"5' 11½\" (1.82 m)","bio":"Stephen McHattie was born on February 3, 1947 in Antigonish, Nova Scotia, Canada as Stephen McHattie Smith. He is an actor and director, known for 300 (2006), Watchmen (2009) and The Fountain (2006). He is married to Lisa Houle. They have three children. He was previously married to Meg Foster.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MTM2NTQzN15BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0570385","name":"Stephen McHattie","nicknames":["Sniff"],"idIMDB":"nm0570385"},"actorId":"nm0570385","character":"Robert","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Darrell Zwerling","urlProfile":"http://www.imdb.com/name/nm0959022","urlPhoto":"","biography":{"dateOfBirth":"9 September 1928","placeOfBirth":" Pittsburgh, Pennsylvania, USA","bio":"Darrell Zwerling was born on September 9, 1928 in Pittsburgh, Pennsylvania, USA. He was an actor, known for Chinatown (1974), Grease (1978) and Wild at Heart (1990). He died on April 11, 2014 in Hollywood, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0959022","name":"Darrell Zwerling","idIMDB":"nm0959022"},"actorId":"nm0959022","character":"Silas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lane Bradbury","urlProfile":"http://www.imdb.com/name/nm0102902","urlPhoto":"","biography":{"dateOfBirth":"17 June 1938","placeOfBirth":" Buckhead, Georgia, USA","birthName":"Janette Lane Bradbury","bio":"Lane Bradbury was born on June 17, 1938 in Buckhead, Georgia, USA as Janette Lane Bradbury. She is an actress and writer, known for Alice Doesn't Live Here Anymore (1974), Maybe I'll Come Home in the Spring (1971) and To Dance with the White Dog (1993). She was previously married to Lou Antonio.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0102902","name":"Lane Bradbury","idIMDB":"nm0102902"},"actorId":"nm0102902","character":"Barrie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nate Esformes","urlProfile":"http://www.imdb.com/name/nm0260559","urlPhoto":"","biography":{"dateOfBirth":"29 June 1932","placeOfBirth":" New York City, New York, USA","birthName":"Nathan Esformes","bio":"Nate Esformes was born on June 29, 1932 in New York City, New York, USA as Nathan Esformes. He was an actor and writer, known for All the President's Men (1976), Petulia (1968) and Battle Beyond the Stars (1980). He died on June 19, 2013 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0260559","name":"Nate Esformes","idIMDB":"nm0260559"},"actorId":"nm0260559","character":"Garon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mel Novak","urlProfile":"http://www.imdb.com/name/nm0636893","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NDc5MjM0OV5BMl5BanBnXkFtZTgwNDIzNTg4MzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1942","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"Mi'lan Mrdjenovich","height":"6' 2\" (1.88 m)","bio":"Martial arts legend and quintessential action movie villain Mel Novak has battled a who's who of legendary Hollywood heroes and is best known as the iconic Stick the Assassin in Bruce Lee's Game of Death. He has also starred in Black Belt Jones opposite Jim Kelly, The Ultimate Warrior opposite Yul Brenner, Eye for an Eye opposite Chuck Norris, Christopher Lee and Richard Roundtree, Tom Horn opposite Steve McQueen and more recently in Gregory Hatanaka's Samurai Cop 2: Deadly Vengeance opposite Bai Ling. Mel also stars in the ensemble cast of Thomas J. Churchill's upcoming film Checkpoint opposite William Forsythe, Bill Goldberg, Fred \"The Hammer\" Williamson and Kenny Johnson. Mel has also acted in Garry Marshall's films such as Exit to Eden opposite Dan Aykroyd and Rosie O'Donnell and Dear God opposite Greg Kinnear and Tim Conway. Ever the noted martial arts movie villain, Mel has had the opportunity to be directed by legendary filmmaker Robert Clouse (Enter the Dragon) several times. His first appearance was a villainous role, where he portrayed a Nazi opposite Jerry Lewis in Which Way to the Front. His first villainous TV role was as a hit man opposite Mike Connors and Abe Vigoda in the classic series Mannix. This role was also his first kill. While he is the ultimate villain on screen, in real life, he is a true hero. Mel is also inducted into the Martial Arts Hall of Fame. He has been bestowed with numerous awards for his acting work as well as humanitarian awards for all his numerous charitable endeavors. He has been volunteering on Skid Row for over 30 years and has counseled prisoners at the most dangerous prisons in the country and has also volunteered with the Special Olympics.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NDc5MjM0OV5BMl5BanBnXkFtZTgwNDIzNTg4MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0636893","name":"Mel Novak","nicknames":["Milan Mrdjenovich"],"idIMDB":"nm0636893"},"actorId":"nm0636893","character":"Lippert","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mickey Caruso","urlProfile":"http://www.imdb.com/name/nm0142325","urlPhoto":"","biography":{"height":"5' 10\" (1.78 m)","bio":"Mickey Caruso is known for his work on Opération dragon (1973), Buck Rogers in the 25th Century (1979) and The Ultimate Warrior (1975). He died on December 4, 2004.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0142325","name":"Mickey Caruso","idIMDB":"nm0142325"},"actorId":"nm0142325","character":"B. Harkness","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Johnson","urlProfile":"http://www.imdb.com/name/nm0425120","urlPhoto":"","biography":{"bio":"Gary Johnson is an actor, known for The Ultimate Warrior (1975), Black Samson (1974) and Black Starlet (1974).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0425120","name":"Gary Johnson","idIMDB":"nm0425120"},"actorId":"nm0425120","character":"L. Harkness","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Susan Keener","urlProfile":"http://www.imdb.com/name/nm0444761","urlPhoto":"","biography":{"bio":"Susan Keener is an actress, known for The Ultimate Warrior (1975), Dr. Masher (1969) and Hec Ramsey (1972).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0444761","name":"Susan Keener","idIMDB":"nm0444761"},"actorId":"nm0444761","character":"Angry Woman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stevie Myers","urlProfile":"http://www.imdb.com/name/nm0616863","urlPhoto":"","biography":{"bio":"Stevie Myers is known for her work on The Blues Brothers (1980), Near Dark (1987) and The Black Hole (1979).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0616863","name":"Stevie Myers","idIMDB":"nm0616863"},"actorId":"nm0616863","character":"Ice House Woman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fred Slyter","urlProfile":"http://www.imdb.com/name/nm0806354","urlPhoto":"","biography":{"dateOfBirth":"15 July 1935","placeOfBirth":" New York, USA","bio":"Fred Slyter was born on July 15, 1935 in New York, USA. He was an actor, known for Short Circuit (1986), Blue Thunder (1983) and The Ultimate Warrior (1975). He died on February 5, 1992 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0806354","name":"Fred Slyter","idIMDB":"nm0806354"},"actorId":"nm0806354","character":"Store Room Clerk","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0073835","urlIMDB":"http://www.imdb.com/title/tt0073835","business":{"budget":{"money":"$800,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"Warner Brothers Entertainment, Inc."},"technical":{"runtime":["1 hr 34 min (94 min)"],"soundMix":["Mono"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.8","filmingLocations":[{"location":"Warner Brothers Burbank Studios - 4000 Warner Boulevard, Burbank, California, USA"}],"rated":"R","awards":[],"votes":"1,317","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."}],"keywords":{"keywords":["gang","seed","new york city","future","turf","plague","urban setting","dystopia","cutting off own hand","vegetable garden","vegetable","twin towers","tomato","subway tunnel","subway train","subway system","subway station","subway chase","subway","pregnant woman in jeopardy","pregnancy","powder milk","north carolina","newborn son","hand chopped off","death of baby","death of a baby","chopping off a hand","childbirth","axe chop","axe","pessimism","cigar smoking","cult film","statue of liberty new york city","2010s","scientist","violence","survivor","post apocalypse","disaster","gangster","three word title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:44:24"}}