{"data":{"movies":[{"title":"The Day the Earth Caught Fire","originalTitle":"","year":"1961","releaseDate":"196205","directors":[{"name":"Val Guest","id":"nm0346436"}],"writers":[{"name":"Wolf Mankowitz","id":"nm0542554"},{"name":"Val Guest","id":"nm0346436"}],"runtime":"99 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjZmYTUxZDktZDA5YS00OTE0LWFjZWItNjc1ZDU1Mjg5YmIyXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Drama","Sci-Fi","Romance"],"plot":"Hysterical panic has engulfed the world after the United States and the Soviet Union simultaneously detonate nuclear devices causing a change to the nutation (axis of rotation) of the Earth.","simplePlot":"When the U.S. and Russia unwittingly test atomic bombs at the same time, it alters the nutation (axis of rotation) of the Earth.","actors":[{"actorName":"Janet Munro","urlProfile":"http://www.imdb.com/name/nm0613130","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNjA3Njg2N15BMl5BanBnXkFtZTYwOTU1NTky._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 September 1934","placeOfBirth":" Blackpool, Lancashire, England, UK","birthName":"Janet Neilson Horsburgh","height":"5' 6\" (1.68 m)","bio":"As Disney's lively lass Katie O'Gill she was the freshness of spring. She could inspire you to dance a jig through a field of flowers. Her entrancing green eyes and catchy spirit had that kind of life-affirming effect. Cute, spunky, almond-eyed British actress Janet Munro was deemed to be an actress from day one as the daughter of Scottish stage and variety hall comedian Alex Munro (1911-1986) (born Alexander Horsburgh). Janet Neilson Horsburgh was born in Blackpool (near Liverpool), Lancashire, England on September 28, 1934. Her entertainer father adopted the name Munro as his own a few years after Janet was born. His wife, Phyllis, Janet's mother, died when Janet was only 8 and the young girl was raised by the comedian's second wife, Lilias. She first trained as a teenager in repertory theatre in the Lancashire area and in the late 1950s found popularity on British TV. She even earned the title of \"Miss Television of 1958\" by a fan magazine. She also dabbled in films with prominent roles in the breezy comedy Small Hotel (1957), the drama The Young and the Guilty (1958) and the creepy sci-fi/horror The Crawling Eye (1958) [aka The Crawling Eye]. Adaptable to both comedy and drama, the little charmer caught the eye of Walt Disney who saw big things for her, and she was signed to a five-picture deal in 1959. She made four. Appealing to a brand new generation of Britishers and Americans as the scrappy, brunette-banged ingénue of several box-office family films, she brightened up the day with her performances in Darby O'Gill and the Little People (1959), Third Man on the Mountain (1959), and Swiss Family Robinson (1960). The Golden Globe winner for \"most promising newcomer\" eventually outgrew Disney and tried to moved ahead by altering her wholesome image with some mature, spicier roles. Audiences, however, didn't respond well to this sudden departure. The idea of an adult Janet Munro playing overly sexy ladies and the seriously downtrodden did not take and her career quickly faltered. Despite a BAFTA nomination for her role in Walk in the Shadow (1962), she began to see life unraveling both personally and professionally right before her very eyes. Janet's marriages to actors Tony Wright and Ian Hendry fell by the wayside and two miscarriages plus chronic medical ills only deepened her suffering. Worse yet, she developed an acute alcohol problem. Semi-retired from acting between 1964 and 1968 while married to Hendry in order to raise her children, she found the going difficult when she tried to return full time. Ironically, one of Janet's last screen roles showed her at her dramatic best, playing that of a boozing pop star in the British film Sebastian (1968). Four years later Janet died under somewhat mysterious circumstances. Reports circulated that she choked to death at a London hotel while drinking tea. The immediate cause of her death was acute myocarditis; the underlying cause was chronic ischemic heart disease. The sun set all too soon on this lovely actress at 38 years of age. She was survived by her two daughters, Sally and Connie.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNjA3Njg2N15BMl5BanBnXkFtZTYwOTU1NTky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0613130","name":"Janet Munro","nicknames":["Jan"],"idIMDB":"nm0613130"},"actorId":"nm0613130","character":"Jeannie Craig","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leo McKern","urlProfile":"http://www.imdb.com/name/nm0571674","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjQzODUxMV5BMl5BanBnXkFtZTcwOTI1MDAxMw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 March 1920","placeOfBirth":" Sydney, New South Wales, Australia","birthName":"Reginald McKern","height":"5' 6\" (1.68 m)","bio":"Although he sounded very British, Leo McKern was an Australian. By the time he was 15 years old, he had endured an accident that left him without his left eye. A glass eye replaced it - one might conjecture for the better, as far as making McKern a one-day actor of singular focus (no pun intended; his face had that extremely focused look). He failed to complete Sydney Technical High School, though his interest in engineering prompted him to transfer into the role of engineering apprentice (1935 to 1937). He expanded his horizons in a different direction with a two-year stint (1937-1940) at a commercial art college. By then World War II was escalating toward Australia, and he volunteered for service with the Engineering Corp of the Australian Army (1940 to 1942). But yet one more career move was needed, and that while the war moved northward away from Australia when America joined the fight. He studied acting and debuted on stage in 1944. He also met an Australian stage actress (Jane Holland), and mutual attraction took its course. In 1946 she had acting opportunities in England, and McKern decided that, along with the wish to propose to her, his own future as an actor lay there also. McKern was short and stout with a great bulbous nose upon an impish face--all the ingredients for great character. His voice was a sharp and vociferous grind upon the back teeth--also perfect for character. After some touring (which included a trip to post-war Germany), he began to appear with regularity on London's premiere stages, particularly the Old Vic (1949-52 and then again 1962-63). These roles meshed with classic English work when he moved on to the Royal Shakespeare Company (RSC) at Stratford-upon-Avon and the Shakespeare Memorial Theater (later reconstituted as the now Royal Shakespeare Theater) from 1952 to 1954. He also spent a season at the New Nottingham Playhouse. He had weaned himself off his Australian accent long before this with his bid for film roles, the first being as one of the four murderous barons in the Thomas a' Becket story Murder in the Cathedral (1951). And he kept his medieval tights on for his next screen appearances (though the small screen of TV) in some roles for the popular Richard Greene series The Adventures of Robin Hood in 1955, while he continued stage work. From then on, McKern had roles in two to three movies a year--busy but not too busy--gradually mixing progressively more and more TV work in the 1950s, 1960s, and 1970s. The films were as varied as a good stage actor could justify moving into a popular medium. Though he was usually police officials, doctors, and authoritative figures, he always made these early parts stand out. Drama comes in various packages; he was not averse to the rise of sci-fi as a vehicle for it. He graced two British sci-fi classics: X the Unknown (1956) and the better The Day the Earth Caught Fire (1961). And there was also TV fantasy work, one of the best known examples being multiple outings as interrogator and chain-yanker Number Two in The Prisoner series. In the late '70s, he condescended to add some weight to two of the Omen movies, as did Gregory Peck and William Holden, putting him in good company. Great drama was McKern's meat. And doing some historically significant on a great scale was an opportunity for a Shakespearean not to miss. He was cast in the screen version of the Robert Bolt hit play A Man for All Seasons (1966). And his visage was perhaps part of the allure. Cast as ruthless political climber and fated chancellor of England Thomas Cromwell, McKern looked like the Hans Holbein court painting of the man who rather nefariously succeeded to Sir Thomas More's position. More was played by McKern's fellow RSC resident Paul Scofield. McKern gave flesh to the commoner Cromwell, making him loud and abrasive with a delightful verve. Later he and Scofield shared another film role, in the sense that the latter turned down the part of Thomas Ryan in the David Lean epic of Ireland Ryan's Daughter (1970), while McKern accepted it and made the role work. (Scofield would have been a miscast, something he probably wisely foresaw.) McKern, from his early screen roles, could do comedy. He had a fair share of outrageous characters, and he could play them with a glint in his eye and a bit of extra cheek in his performance to show that he must have had fun in the role. In this regard, he showed his stuff supporting Peter Sellers in the endearing The Mouse That Roared (1959) and had the lead in the outlandish They All Died Laughing (1964) as a college professor who decides to snuff out humanity with poison laughing gas. He was a broad country fellow with a Shakespearean twist as Squint in The Amorous Adventures of Moll Flanders (1965). In one of his later comedies, he is rather overlooked because of its clever script; in fact, it is an over-the-top tour de force for McKern. As the infamous nemesis Professor Moriarty in The Adventure of Sherlock Holmes' Smarter Brother (1975), McKern manages to steal the show from funny man and director/writer Gene Wilder along with Marty Feldman and Roy Kinnear. McKern's Moriarty is devilish but tongue-in-cheek with a vengeance, especially with his nervous tic of suddenly, at any time and out of nowhere, yelling, \"YAAA, YAAA!\" Yet McKern's chief legacy has been and probably will continue to be his long-running TV role in more mystery (he had done his fair share in film and TV already) as Horace Rumpole in \"Rumpole of the Bailey\" (1978-1992), a role originally introduced by him in the teleplay \"Rumpole of the Bailey\" in 1975. The role had been specifically created for him by writer John Mortimer, and though every actor can appreciate the security of a long-running role, McKern feared that it was subsuming his more than considerable body of work. Along with that, McKern became increasingly self-conscious of his acting, and mixed in was the idea that his physical appearance was not appealing to the public. As a result, he had to deal with a progressively increasing stage fright. He need not have worried; he was working in diverse TV and movie roles nearly to the time of his passing, and he was beloved by movie and TV fans alike. Along with receiving the award of Officer of the Order of Australia from his home country, in 1983 McKern's memoir \"Just Resting\" was published.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjQzODUxMV5BMl5BanBnXkFtZTcwOTI1MDAxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0571674","name":"Leo McKern","idIMDB":"nm0571674"},"actorId":"nm0571674","character":"Bill Maguire","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edward Judd","urlProfile":"http://www.imdb.com/name/nm0431837","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg1OWI2YjktYjI1ZS00ZGQ4LTk3NTgtZWRkZjVjOWUxNjE4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1932","placeOfBirth":" Shanghai, China","bio":"The British character actor Edward Judd was born to British parents in 1932 in Shanghai, China, where he began acting on stage as a teenager. Before he was 16, he was in England making his film debut in The Hideout (1948), closely followed by Maniacs on Wheels (1949) and The Outsider (1948). During the 1950s, Judd achieved modest fame on the English stage and continued his film career. By the 1960s, he had become associated mostly with science fiction films, e.g., X the Unknown (1956), The Day the Earth Caught Fire (1961), First Men in the Moon (1964), Island of Terror (1966) and Invasion (1966). Judd made sporadic appearances, mostly in television, until the early 1990s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg1OWI2YjktYjI1ZS00ZGQ4LTk3NTgtZWRkZjVjOWUxNjE4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0431837","name":"Edward Judd","idIMDB":"nm0431837"},"actorId":"nm0431837","character":"Peter Stenning","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Goodliffe","urlProfile":"http://www.imdb.com/name/nm0328982","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwMTM0NzkyM15BMl5BanBnXkFtZTYwOTI0MDgy._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1914","placeOfBirth":" Bebington, Cheshire, England, UK","birthName":"Lawrence Michael Andrew Goodliffe","height":"5' 10½\" (1.79 m)","bio":"Michael Goodliffe was born on October 1, 1914 in Bebington, Cheshire, England as Lawrence Michael Andrew Goodliffe. He was an actor, known for Peeping Tom (1960), Sam (1973) and A Night to Remember (1958). He died on March 20, 1976 in Wimbledon, London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwMTM0NzkyM15BMl5BanBnXkFtZTYwOTI0MDgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0328982","name":"Michael Goodliffe","idIMDB":"nm0328982"},"actorId":"nm0328982","character":"'Jacko' Jackson - Night Editor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bernard Braden","urlProfile":"http://www.imdb.com/name/nm0102946","urlPhoto":"","biography":{"dateOfBirth":"16 May 1916","placeOfBirth":" Vancouver, British Columbia, Canada","bio":"Bernard Braden was born on May 16, 1916 in Vancouver, British Columbia, Canada. He was an actor and producer, known for The Sweepstakes Game (1976), Now and Then (1967) and The Day the Earth Caught Fire (1961). He was married to Barbara Kelly. He died on February 2, 1993 in London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0102946","name":"Bernard Braden","idIMDB":"nm0102946"},"actorId":"nm0102946","character":"'Dave' Davis - News Editor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Reginald Beckwith","urlProfile":"http://www.imdb.com/name/nm0065888","urlPhoto":"","biography":{"dateOfBirth":"2 November 1908","placeOfBirth":" York, England, UK","birthName":"William Reginald Beckwith","bio":"Reginald Beckwith was born on November 2, 1908 in York, England as William Reginald Beckwith. He was an actor and writer, known for Thunderball (1965), A Shot in the Dark (1964) and Curse of the Demon (1957). He died on June 26, 1965 in Bourne End, Buckinghamshire, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0065888","name":"Reginald Beckwith","nicknames":["Tony"],"idIMDB":"nm0065888"},"actorId":"nm0065888","character":"Harry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gene Anderson","urlProfile":"http://www.imdb.com/name/nm0026741","urlPhoto":"","biography":{"dateOfBirth":"28 March 1931","placeOfBirth":" London, England, UK","height":"5' 6\" (1.68 m)","bio":"Gene Anderson was born on March 28, 1931 in London, England. She was an actress, known for The Day the Earth Caught Fire (1961), The Long Haul (1957) and The First Mrs. Fraser (1957). She was married to Edward Judd. She died on May 5, 1965 in London.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0026741","name":"Gene Anderson","idIMDB":"nm0026741"},"actorId":"nm0026741","character":"May","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Renée Asherson","urlProfile":"http://www.imdb.com/name/nm0038914","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzM1NjM1NTQ0N15BMl5BanBnXkFtZTgwMzgxMDYyMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 May 1915","placeOfBirth":" Kensington, London, England, UK","birthName":"Dorothy Renée Ascherson","bio":"A beautiful and durable actress of screen, stage and television. She played the bride of Laurence Olivier's title character in Henry V (1944) (Henry V (1944)). She later appeared in Maniacs on Wheels (1949), a speedway drama with Dirk Bogarde. A frequent co-star of the actor Robert Donat, whom she married in 1953. The couple separated in 1956, but were due to reconcile at the time of his untimely death in London on 9th June 1958, aged 53.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzM1NjM1NTQ0N15BMl5BanBnXkFtZTgwMzgxMDYyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0038914","name":"Renée Asherson","idIMDB":"nm0038914"},"actorId":"nm0038914","character":"Angela","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arthur Christiansen","urlProfile":"http://www.imdb.com/name/nm0160144","urlPhoto":"","biography":{"dateOfBirth":"27 July 1904","placeOfBirth":" Wallasey, Merseyside, England, UK","bio":"Arthur Christiansen was born on July 27, 1904 in Wallasey, Merseyside, England. He is known for his work on The Day the Earth Caught Fire (1961), 80,000 Suspects (1963) and Deadline Midnight (1960). He was married to Brenda Shepherd Christiansen. He died on September 27, 1963.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0160144","name":"Arthur Christiansen","idIMDB":"nm0160144"},"actorId":"nm0160144","character":"'Jeff' Jefferson - Editor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Austin Trevor","urlProfile":"http://www.imdb.com/name/nm0872454","urlPhoto":"","biography":{"dateOfBirth":"8 October 1897","placeOfBirth":" Belfast, Ireland","birthName":"Claude Austin Trevor Schilsky","height":"6' (1.83 m)","bio":"Austin Trevor was born on October 8, 1897 in Belfast, Ireland as Claude Austin Trevor Schilsky. He was an actor, known for The Red Shoes (1948), Goodbye, Mr. Chips (1939) and The Day the Earth Caught Fire (1961). He was married to Violet Clowes. He died on January 21, 1978 in Bury St. Edmunds, Suffolk, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0872454","name":"Austin Trevor","idIMDB":"nm0872454"},"actorId":"nm0872454","character":"Sir John Kelly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edward Underdown","urlProfile":"http://www.imdb.com/name/nm0880956","urlPhoto":"","biography":{"dateOfBirth":"3 December 1908","placeOfBirth":" London, England, UK","birthName":"Charles Edward Underdown","height":"6' 1\" (1.85 m)","bio":"A London-born stage and film veteran, actor Edward Underdown was educated at Eton College and began in theatre roles in 1932 with \"Words and Music\". A former jockey and steeplechase rider, he quickly forged ahead in films making his debut in The Warren Case (1934) and appearing in secondary roles. A tall, officious and good looking gent, he came into his own in post-war film leads and supports with prominent roles in The October Man (1947), Her Panelled Door (1950), The Dark Man (1951), Murder Will Out (1952), The Shadow Man (1953), and John Huston's cult overseas hit Beat the Devil (1953) starring Humphrey Bogart and Jennifer Jones in which he played Jones' prim dullard of a husband. Most of his work was in dismissible \"B\" level fare as dour, damp, stuffy types. He started moving down the credits list in 1960s horrors and action drama until he was reduced to bit parts. Over the course of his career, he played everything from British lords to archaeologists, but never branched out into a successful international career. Things might have turned out differently had a little more luck come his way. It seems writer Ian Fleming's first choice for the role of James \"007\" Bond was the handsome but still relatively undistinguished Underdown, but the actor was never even considered by producer Albert R. Broccoli. Of course, Sean Connery soared to stardom in the part and, ironically, Underdown wound up with a very small part in one of the more popular of the film series Thunderball (1965). Underdown died in his native England on December 15, 1989 at age 81.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0880956","name":"Edward Underdown","idIMDB":"nm0880956"},"actorId":"nm0880956","character":"Dick Sanderson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ian Ellis","urlProfile":"http://www.imdb.com/name/nm0254874","urlPhoto":"","biography":{"bio":"Ian Ellis is an actor, known for The Day the Earth Caught Fire (1961), The Flood (1963) and The Magnificent Six and ½: Ghosts and Ghoulies (1967).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0254874","name":"Ian Ellis","idIMDB":"nm0254874"},"actorId":"nm0254874","character":"Michael Stenning","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0054790","urlIMDB":"http://www.imdb.com/title/tt0054790","business":{"budget":{"money":"£200,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Melina Productions Ltd. (1961)"},"technical":{"runtime":["1 hr 39 min (99 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Black and White (with tinted sequences)"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Dyaliscope"],"printedFilmFormat":["35 mm"]},"rating":"7.2","filmingLocations":[{"location":"Shepperton Studios, Shepperton, Surrey, England, UK"}],"rated":"UNRATED","awards":[{"award":"BAFTA Awards 1962","titlesAwards":[{"titleAwardOutcome":"Won BAFTA Film Award","categories":[{"category":"Best British Screenplay","names":[{"name":"Wolf Mankowitz","id":"nm0542554","role":null},{"name":"Val Guest","id":"nm0346436","role":null}]}]}]},{"award":"Hugo Awards 1963","titlesAwards":[{"titleAwardOutcome":"Nominated Hugo","categories":[{"category":"Best Dramatic Presentation","names":[{"name":"Val Guest","id":"nm0346436","role":"written by/director"},{"name":"Wolf Mankowitz","id":"nm0542554","role":"written by"}]}]}]}],"votes":"3,507","type":"Movie","companyCreditsSimple":[{"idCompany":"co0376381","name":"Melina Productions"},{"idCompany":"co0103186","name":"Pax Films"}],"keywords":{"keywords":["reporter","nuclear bomb","newsroom","newspaper editor","newspaper","alcoholic","british new wave","bare chested boy","beatnik","boy","apartment","divorce","female nudity","newspaper reporter","end of the world","earth in peril","divorced father","typhus","weather","solar eclipse","heat wave","drought","water shortage","london england","disaster","stock footage","cyclone","telephone operator","ferris wheel","funfair","bar","cold war","riot","nuclear testing","elevator shaft","fog"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:17:55"}}