{"data":{"movies":[{"title":"Black Christmas","originalTitle":"","year":"1974","releaseDate":"19741220","directors":[{"name":"Bob Clark","id":"nm0163706"}],"writers":[{"name":"Roy Moore","id":"nm0600860"}],"runtime":"98 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDUxM2IyYzgtMjU1ZS00Mzc4LWIwMmUtYzczMzM5ZWIzNGUxXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["Canada","USA"],"languages":["English"],"genres":["Horror","Mystery","Thriller"],"plot":"It's time for Christmas break, and the sorority sisters make plans for the holiday, but the strange anonymous phone calls are beginning to put them on edge. When Clare disappears, they contact the police, who don't express much concern. Meanwhile Jess is planning to get an abortion, but boyfriend Peter is very much against it. The police finally begin to get concerned when a 13-year-old girl is found dead in the park. They set up a wiretap to the sorority house, but will they be in time to prevent a sorority girl attrition problem?","simplePlot":"During their Christmas break, a group of sorority girls are stalked by a stranger.","actors":[{"actorName":"Olivia Hussey","urlProfile":"http://www.imdb.com/name/nm0001377","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMzczMjE2M15BMl5BanBnXkFtZTcwODg5NDcxMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 April 1951","placeOfBirth":" Buenos Aires, Federal District, Argentina","birthName":"Olivia Osuna","height":"5' 2\" (1.57 m)","bio":"At age 15, when most young women are nurturing dreams of romance, Olivia Hussey was giving life to Juliet in Franco Zeffirelli's Romeo and Juliet (1968). Her performance in one of the most celebrated roles ever written in the English language won her the Golden Globe and two successive Best Actor Donatello Awards (Italy's Oscar equivalent), an incredible achievement for an actress in only her third film. Olivia, a seasoned veteran of the London stage where she debuted opposite Vanessa Redgrave in \"The Prime of Miss Jean Brodie\", has appeared in over two dozen films, including Death on the Nile (1978) with Bette Davis and Peter Ustinov, Jésus de Nazareth (1977) (united again with the great Zeffirelli), Last Days of Pompeii (1975) opposite Sir Laurence Olivier, Lost Horizon (1973), The Bastard (1978), Hallmark's Hall of Fame Ivanhoe (1982) with James Mason, Showtime's Psycho IV: The Beginning (1990) and It (1990). She has also guest-starred in numerous television series. Considered by many to be one of the most beautiful women in the world, Olivia may owe this \"title\" to her \"exotic\" blend; her father was Argentinian and her mother was of English and Scottish ancestry. She spent her early youth in Buenos Aires, her father being Andreas Osuna, aka Isvaldo Ribo, renowned Argentine opera and tango singer, and her English mother encouraging her early inclinations for the performing arts. At the age of seven. she moved with her mother and younger brother to England, where she spent the next five years attending drama school. From there, she landed the role of \"Jenny\" in \"Jean Brodie\". It was in that theater production that Zeffirelli spotted her. After auditioning over 500 other young actresses for the part of Juliet, he awarded the part to Olivia, and the rest, as they say, is history. She then moved to Los Angeles, where she met and married Dean Paul Martin, son of the late and great entertainer Dean Martin. They had a son, Alexander Martin, who is now an actor. She and Martin eventually divorced, and Olivia later married Akira Fuse, one of Japan's premier singers. That marriage produced a second son, Max, born in 1983. Two years later, she signed on to star with Burt Lancaster and Ben Cross (Chariots of Fire (1981)) in The Jeweller's Shop (1988), a screen adaptation of a story written by Pope John Paul II (at the time he wrote it he was called Karol Wotyla). Following the filming, Olivia was invited to view the film at the Vatican as a guest of His Holiness. Never seeming to be able to stop the constant work schedule and travel, Olivia finally decided she needed a break. After taking some much deserved time off for herself and to raise her young daughter, India Joy, she returned to work starring in two back-to-back features. The first, El grito (2000) (known as \"Bloody Proof\" in America), was shot in Mexico City and required her to deliver the role bilingually, applying her native command of Spanish. The second was Tortilla Heaven (2007), a comedy written and directed by Sundance Film Festival winner Judy Hecht Dumontet, in which Olivia plays the town nudist(!). Most recently, Olivia has completed her life's dream, portraying Mother Teresa of Calcutta, a movie shot entirely on location in Sri Lanka and Italy. Her performance was received with open arms by the Sisters of Mother Teresa's Missionaries of Charity when it was screened for them in Italy. Also present at the screening, and pleased with her portrayal, was Agi Bojaxhiu, a wonderful lady and the niece and only direct living relative of Mother herself. Olivia lives outside of Los Angeles with her family, as well as her menagerie of animals.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMzczMjE2M15BMl5BanBnXkFtZTcwODg5NDcxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001377","name":"Olivia Hussey","idIMDB":"nm0001377"},"actorId":"nm0001377","character":"Jess","urlCharacter":"http://www.imdb.com/character/ch0130094","main":true},{"actorName":"Keir Dullea","urlProfile":"http://www.imdb.com/name/nm0001158","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczODgxNDU1NV5BMl5BanBnXkFtZTYwMzQxOTI2._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 May 1936","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Keir Atwood Dullea","height":"6' 1\" (1.85 m)","bio":"Tall, slim, remote and boyishly handsome, one of Keir Dullea's most arresting features is his pale blue eyes, which featured in a number of watershed films of the 1960s. A major, up-and-coming film star from the \"Camelot\" years straight through the turbulent era of the U.S.-Viet Nam War, he never quite reached international fame. His shining star may have suffered a power outage into the next decade, but he persevered quite well on T.V. and (especially) the stage in a career now surpassing five decades. Dullea, who was born in Cleveland, Ohio, is the son of two book-store owners, and he was raised in New York's Greenwich Village section. He graduated from George School in Pennsylvania and attended both Rutgers and San Francisco State before deciding to pursue summer stock and regional theatre. Attending the Neighborhood Playhouse, he made his New York City acting debut in a production of \"Sticks and Bones\" in 1956. His first big break came with the pilot program of the Route 66 (1960) series, and he proceeded to find other TV roles in Naked City (1958), Checkmate (1960) and various dramatic programs. Following stage work in \"Season of Choice\" (1959) and \"A Short Happy Life\" (1961), Dullea made an auspicious film debut in a leading role with The Hoodlum Priest (1961), playing a troubled street gang member who crosses paths with Don Murray's determined minister. The young actor's characters from then on seemed to walk a dangerous tight-rope of emotions, and his apparent versatility at such a young age led him to a number of other psychologically scarred portrayals. Tending to play men younger than he really was, none were more disturbed than his haphephobic adolescent David (Dullea was twenty-six at the time) in the deeply felt love story David and Lisa (1962). Paired beautifully with Janet Margolin's schizophrenic Lisa, Dullea won the Golden Globe Award for \"Most Promising Male Newcomer.\" In the World War II military drama The Thin Red Line (1964)he played an edgy, nervous-eyed private who is pushed to his murderous brink by a brutal sergeant on Guadacanal. In Bunny Lake Is Missing (1965) Dullea portrayed the incestuous brother of Carol Lynley, who may or may not figure into the disappearance of Lynley's child. Keir also costarred as the mysterious intruder who inserts an emotional wedge between gay lovers Anne Heywood and Sandy Dennis in the ground-breaking film about homosexuals, Le renard (1967). Topping that off, Dullea played the salacious Marquis De Sade himself in a relatively tame, internationally flavored production of De Sade (1969). The apex of his film career, however, came with his lead role in Stanley Kubrick's epic science-fiction film, 2001: A Space Odyssey (1968), as the astronaut Dr. David Bowman. In the realm of stage acting, Keir made his debut on Broadway in 1967 with \"Dr. Cook's Garden\" costarring Burl Ives, and Dullea won some \"flower power\" stardom two years later as a sensitive young blind man who attempted to wriggle free of his protective, overbearing mother. His character also pursues love with a free-spirited girl, played by Blythe Danner, in the play \"Butterflies Are Free.\" By the time the movie of this story was released in 1972 both stars had been replaced by Goldie Hawn and Edward Albert. Dullea next went abroad to seek film work in England and in Canada, but with lukewarm results. He continued to show his odd-man-out appeal on the Broadway stage as \"Brick\" in 1970, and in the Broadway revival of \"Cat on a Hot Tin Roof\" in 1974, acting along with Elizabeth Ashley as \"Maggie,\" and in the black comedy \"P.S. Your Cat Is Dead!\" one year later. In the years since then, Dullea has acted steadily on the stage in New York City, and in U.S. regional theatres, in productions of \"Sweet Prince,\" \"The Seagull\" and \"The Little Foxes,\"among others. His cinematic roles since 1970 have included another \"mysterious stranger\" in The Next One (1984), and he also reprised his \"David Bowman\" role in 2010: The Year We Make Contact (1984), the sequel to \"2001: A Space Odyssey.\" Dullea has had four wives: his first was actress Margot Bennett, and he and his third wife, Susie Fuller (whom he met during the British performances of \"Butterflies are Free\" in London), cofounded the Theater Artists Workshop of Westport in 1983. Dullea, Fuller and her two children resided in London for quite a while. After Fuller's death in 1998, Dullea married for the fourth time in 1999 to actress Mia Dillon, who is best known for portraying the character \"Babe\" in in the play, \"Crimes of the Heart\" in New York City. Just a few weeks later they appeared together in the play \"Deathtrap.\" Dullea has worked infrequently in television roles. Among his more recent work in movies has been the role of a senator in The Good Shepherd (2006), along with Matt Damon and Angelina Jolie, which was directed by Robert De Niro.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczODgxNDU1NV5BMl5BanBnXkFtZTYwMzQxOTI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001158","name":"Keir Dullea","idIMDB":"nm0001158"},"actorId":"nm0001158","character":"Peter","urlCharacter":"http://www.imdb.com/character/ch0546439","main":true},{"actorName":"Margot Kidder","urlProfile":"http://www.imdb.com/name/nm0452288","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NDQ2MDI0OF5BMl5BanBnXkFtZTYwMTc1MzI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 October 1948","placeOfBirth":" Yellowknife, Northwest Territories, Canada","birthName":"Margaret Ruth Kidder","height":"5' 6\" (1.68 m)","bio":"Margot Kidder was born Margaret Ruth Kidder in Yellowknife, Northwest Territories, Canada, to Jocelyn Mary \"Jill\" (Wilson), a history teacher from British Columbia, and Kendall Kidder, a New Mexico-born mining engineer and explosives expert. Margot was a delightful child who took pride in everything she did. At an early age she became aware of the great emotions she felt towards expressing herself, and caught the acting bug. As a child she wrote in a diary that she wanted to become a movie star, and that one day it would happen, but she had to overcome something else first. She was aware that she was constantly facing mood swings, but wasn't aware why. At odd times she would try to kill herself - the first time was at age 14 - but the next day she would be just fine. Her father's hectic schedule and moving around so much didn't help matters, either, causing her to attend 11 schools in 12 years. Finally, in an attempt to help Margot with her troubles, her parents sent\" her to a boarding school, where she took part in school plays, such as Romeo and Juliet\", in which she played the lead. After graduation Margot moved to Los Angeles to start a film career. She found herself dealing with a lot of prejudice, and hotheads, but later found solace with a Canadian agent. This was when she got her first acting job, in the Norman Jewison film Gaily, Gaily (1969). This led to another starring role in Quackser Fortune Has a Cousin in the Bronx (1970), in which she co-starred with Gene Wilder. After some harsh words from the film's director, Margot temporarily left films to study acting in New York, doing television work to pay her bills, but when the money ran out, she decided it was time to make a second try at acting. When she arrived in Hollywood she met up at a screen test with actress Jennifer Salt, resulting in a friendship that still stands strong today. Margot and Jennifer moved into a lofty beach house and befriended other, then unknown, struggling filmmakers such as Martin Scorsese, Brian De Palma, Steven Spielberg and Susan Sarandon, among others. Late nights would see the hot, happening youngsters up until all hours talking around a fire about how they were all going to change the film industry. It was crazy living and within the Christmas season, Margot had become involved with De Palma, and as a Christmas present he gave her the script to his upcoming film Sisters (1972). Margot and Salt both had the leads in the film, and it was a huge critical success. The film made branded Margot as a major talent, and in the following years she starred in a string of critically acclaimed pictures, such as Black Christmas (1974), The Great Waldo Pepper (1975), 92 in the Shade (1975) - directed by Thomas McGuane, who was also her husband for a brief period - and a somewhat prophetic tale of self-resurrection, The Reincarnation of Peter Proud (1975). After three years of being a housewife, looking after her daughter Maggie and not working, Margot decided it was time to let her emotions take control and get back into acting. Once her marriage to McGuane was over she eyed a script that would change her life forever. Her new agent hooked her up with a little-known director named Richard Donner. He was going to be directing a film called Superman (1978), and she auditioned for and secured the leading female role of Lois Lane. That film and Superman II (1980) were to be filmed simultaneously. After the success of \"Superman\" she took on more intense roles, such as The Amityville Horror (1979) and Willie & Phil (1980). After that, Margot did numerous films, television and theater work throughout the 1980s, including Superman IV: The Quest for Peace (1987). When the 1990s erupted with the Gulf War, Margot found herself becoming involved in politics. She made a stir in the biz when she spoke out against the military for their actions in Kuwait. She also appeared in a cameo in Donner's Maverick (1994). In 1996, as she was preparing to write her autobiography, she began to become more and more paranoid. When her computer was infected with a virus, this gave her paranoia full rein, and she sank into bipolar disorder. She panicked, and the resulting psychological problems she created for herself resulted in her fantasizing that her first husband was going to kill her, so she left her home and faked her death, physically altering her appearance in the bargain. After an intervention took place, she got back on her feet and started the mental wellness campaign. Since then she has sustained her career in film, television, and theater, recently appearing in a Canadian stage production of \"The Vagina Monologues\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NDQ2MDI0OF5BMl5BanBnXkFtZTYwMTc1MzI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0452288","name":"Margot Kidder","nicknames":["Margie"],"idIMDB":"nm0452288"},"actorId":"nm0452288","character":"Barb","urlCharacter":"http://www.imdb.com/character/ch0130095","main":true},{"actorName":"John Saxon","urlProfile":"http://www.imdb.com/name/nm0768334","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjE1NTk3Ml5BMl5BanBnXkFtZTcwOTAzMjg0NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 August 1935","placeOfBirth":" Brooklyn, New York, USA","birthName":"Carmine Orrico","height":"5' 10½\" (1.79 m)","bio":"John Saxon has appeared in nearly 200 roles in the movies and on television in a more-than half-century-long career that has stretched over seven decades since he made his big screen debut in 1954 in uncredited small roles in It Should Happen to You (1954) and George Cukor's A Star Is Born (1954). Born Carmine Orrico on August 5, 1936 in Brooklyn, New York, the son of Italian immigrants Antonio Orrico and Anna (née Protettore), he studied acting with Stella Adler after graduating from New Utrecht High School. He was discovered by talent agent Henry Willson, the man most famous for creating and representing Rock Hudson (as well as a stable of \"beefcake\" male stars and starlets), who signed him up after he saw Saxon's picture on the cover of a magazine. Willson brought the 16-year-old to Southern California, changed his name to John Saxon, and launched his career. Saxon made his television debut on Richard Boone's series Medic (1954) in 1955 and got his first substantial (and credited) role in Running Wild (1955), playing a juvenile delinquent. In the Esther Williams vehicle The Unguarded Moment (1956) (one of her rare dramatic roles), the film's marketing campaign spotlighted him, trumpeting the movie as \"Co-starring the exciting new personality John Saxon.\". By 1958, he seemed to have established himself as a supporting player in A-List pictures, being featured in Blake Edwards's comedy This Happy Feeling (1958) headlined by Debbie Reynolds and Vincente Minnelli's The Reluctant Debutante (1958) with Rex Harrison and Sandra Dee. In the next five years, he worked steadily, including supporting roles in John Huston's The Unforgiven (1960), the James Stewart comedy Mr. Hobbs Takes a Vacation (1962) and Otto Preminger's The Cardinal (1963) while having first billing in the B-movies Cry Tough (1959) and War Hunt (1962). Fluent in Italian, he made his first pictures in Italy in the period, Agostino (1962) and Mario Bava's Evil Eye (1963). Despite his good work with major directors, he failed to succeed as a star. By 1965, he was appearing in the likes of Blood Beast from Outer Space (1965), albeit, top-billed. A more emblematic picture was Sidney J. Furie's The Appaloosa (1966), in which he appeared in Mexican bandito drag as the man who steals the horse of Marlon Brando, another Stella Adler student. The \"ethnic-looking\" Saxon would reprise the role, of sorts, in John Sturges Joe Kidd (1972) in support of superstar Clint Eastwood. In those less politically correct times, many an Italian-American with a dark complexion would be relied on to play Mexicans, Native Americans and other \"exotic\" types like Mongols. Saxon played everything from an Indian chief on Bonanza (1959) to Marco Polo on The Time Tunnel (1966). From 1969 to 1972 season, he was a star of the television series The Bold Ones: The New Doctors (1969), playing the brilliant surgeon Theodore Stuart. When the series ended, he took one of his most famous roles when Bruce Lee demurred over casting Rod Taylor as he was too tall. A black belt in karate, Saxon appeared as Roper in Opération dragon (1973). He has continued to play a wide variety of roles on television and in motion pictures ever since.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjE1NTk3Ml5BMl5BanBnXkFtZTcwOTAzMjg0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0768334","name":"John Saxon","idIMDB":"nm0768334"},"actorId":"nm0768334","character":"Lt. Ken Fuller","urlCharacter":"http://www.imdb.com/character/ch0250787","main":true},{"actorName":"Marian Waldman","urlProfile":"http://www.imdb.com/name/nm0907201","urlPhoto":"","biography":{"dateOfBirth":"16 December 1924","placeOfBirth":" Toronto, Ontario, Canada","height":"5' 3½\" (1.61 m)","bio":"Character actress Marian Waldman was born on December 16, 1924 in Toronto, Ontario, Canada. The daughter of a professor mother and a physician father, Waldman was an Ashkenazi Jew. Marian began her career as a stage actress in the 1950's in the Toronto area initially as a choir girl before branching out by acting in stage plays. Outside of her work in live theatre, Waldman also acted in a few films as well as was a writer for several TV shows; she was especially memorable as the drunken foul-mouthed housemother Mrs. Mac in the seasonal slasher classic Black Christmas (1974). Her hobbies included reading, traveling, astrology, and attending both parties and various events around Toronto. Marian died at age sixty on July 5, 1985 in Toronto, Ontario, Canada.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0907201","name":"Marian Waldman","nicknames":["Pookie"],"idIMDB":"nm0907201"},"actorId":"nm0907201","character":"Mrs. Mac","urlCharacter":"http://www.imdb.com/character/ch0066179","main":true},{"actorName":"Andrea Martin","urlProfile":"http://www.imdb.com/name/nm0551908","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MDU5MDEyN15BMl5BanBnXkFtZTcwNjQ1NjIzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 January 1947","placeOfBirth":" Portland, Maine, USA","birthName":"Andrea Louise Martin","height":"5' 4\" (1.63 m)","bio":"Andrea Martin was born on January 15, 1947 in Portland, Maine, USA as Andrea Louise Martin. She is an actress and writer, known for SCTV (1976), Wag the Dog (1997) and Anastasia (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MDU5MDEyN15BMl5BanBnXkFtZTcwNjQ1NjIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0551908","name":"Andrea Martin","idIMDB":"nm0551908"},"actorId":"nm0551908","character":"Phyl","urlCharacter":"http://www.imdb.com/character/ch0546440","main":true},{"actorName":"James Edmond","urlProfile":"http://www.imdb.com/name/nm0249461","urlPhoto":"","biography":{"dateOfBirth":"7 February 1924","placeOfBirth":" Walkerton, Ontario, Canada","bio":"James Edmond was born on February 7, 1924 in Walkerton, Ontario, Canada. He was an actor, known for Black Christmas (1974), Devil Girl from Mars (1954) and La race des champions (1986). He was married to Shirley Faessler. He died on November 4, 2000 in Paris, Ontario.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0249461","name":"James Edmond","idIMDB":"nm0249461"},"actorId":"nm0249461","character":"Mr. Harrison","urlCharacter":"http://www.imdb.com/character/ch0106624","main":true},{"actorName":"Doug McGrath","urlProfile":"http://www.imdb.com/name/nm0569789","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg0NDc2ODU1MF5BMl5BanBnXkFtZTcwMDI0MTMxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 April 1935","placeOfBirth":" Vancouver, British Columbia, Canada","bio":"Doug McGrath was born on April 13, 1935 in Vancouver, British Columbia, Canada. He is an actor, known for Pale Rider (1985), Twilight Zone: The Movie (1983) and The Outlaw Josey Wales (1976).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg0NDc2ODU1MF5BMl5BanBnXkFtZTcwMDI0MTMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0569789","name":"Doug McGrath","idIMDB":"nm0569789"},"actorId":"nm0569789","character":"Sargeant Nash","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Art Hindle","urlProfile":"http://www.imdb.com/name/nm0385543","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NDkxMzA1NV5BMl5BanBnXkFtZTcwNDg3Mjg0NA@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 July 1948","placeOfBirth":" Halifax, Nova Scotia, Canada","height":"5' 10\" (1.78 m)","bio":"Born in Halifax to a Royal Canadian Navy father, Art's mother soon had him back in their home town of Toronto, Ontario. He grew up in the \"Beaches\" of Toronto a big fan of Elvis Presley and rock n' roll. Although shy as a child, he grew to be a rebellious and independent teenager. This lead him to much traveling, mostly by hitch-hiking, picking up odd jobs, meeting all sorts of people from red-necks to freedom marchers to surfers and everyone in between. By the time he was 21, he was a father, a stockbroker and an amateur photographer. A much admired uncle of Art's was Michael Caine, a talented and successful actor. This had piqued Art's interest in acting during his teens. Although fairly successful himself, as a broker, he basically felt unfulfilled and eventually, after being inspired and touched by a Toronto Workshop Productions play, he made the commitment to leave the stock market for theatre. Although he worked, basically, as an unglorified gofer for a few months with TWP, eventually he got an acting agent, mostly with a false resume, and started auditioning mostly for commercials. It was at this time that Art credits a discovery that changed his future. Someone, he can't remember who, directed him to the Eli Rill Workshop. Eli had moved to Toronto from New York, where he taught at the Actor's Studio. Kind, gentle and articulate, Eli lucidly communicated techniques and explorations of the Method. Art thrived in this environment and soon started applying his knowledge to getting acting jobs. His first big role was in a biker movie, The Proud Rider (1971), spawned by the popularity of Easy Rider (1969). Art actually worked with a real motorcycle gang, the Satan's Choice. It was during the making of this rather bad movie that Art almost changed his professional name to Jeremy Kane. The producers thought that Art should have a more \"show biz\" name and took his photo to a girls school and asked the students to suggest first names and last names. They then took these names to Art and asked him to pick one of each. He liked the name Jeremy and chose Caine in honor of his uncle. The first person he called was his uncle Michael. Michael told him in no uncertain terms to stick to his own name. Art did so, but the other name is still connected to the film. The other anecdote was when the producers asked Art if he could ride a \"bike,\" he took them \"literally\" and said he could, but that when it came to motorcycles his brother Lang Hindle was much better, being a champion road racer. Cast for the part late on a Thursday, Art had to learn to ride a motorcycle by Monday morning. The next big step was being cast as Billy Duke, the best hockey player in the world, drafted by the Maple Leafs to lead them back to the playoffs in the film Winter Comes Early (1971), Canada's first million-dollar movie. This film led to offers from Hollywood, which he resisted until work dried up and Art, who had 4 children by this time, finally moved to Los Angeles. Art credits much of his success in California to luck. He felt he was lucky having Patricia McQueeney as his manager and a dynamic pair of agents in Arnold Rifkin and Nichole David. Over the years Art has come to be known as a \"working actor\" involved as a leading actor in some \"classic\" films and numerous pilots and series. His work in ENG, one Canada's most successful series, won him a Acting Gemini and his Pete Braga in Bienvenue à Paradise Falls (2001) has been described as a \"classic performance\" although Art credits brilliant writing for all the plaudits. Also, in the early 1990s, Art added the credit Director to his impressive resume. He and his beautiful wife, Brooke now split time between California, Florida and Canada spending time with their much beloved children, all 8 of them, and their 6 grandchildren. Lucky? Indeed!","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NDkxMzA1NV5BMl5BanBnXkFtZTcwNDg3Mjg0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0385543","name":"Art Hindle","idIMDB":"nm0385543"},"actorId":"nm0385543","character":"Chris Hayden","urlCharacter":"http://www.imdb.com/character/ch0130098","main":true},{"actorName":"Lynne Griffin","urlProfile":"http://www.imdb.com/name/nm0341289","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3Mzg0NDE3NF5BMl5BanBnXkFtZTcwNDIyNzAzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 September 1952","placeOfBirth":" Toronto, Ontario, Canada","height":"5' 5½\" (1.66 m)","bio":"The talented Lynne Griffin started out on Canadian television in the early 1970s, then moved on to acting on stage. She is known for her work in Shakespearean plays and has frequently appeared at the Stratford Festival in Stratford, Ontario. She gave a notable performance in the television movie I'll Take Manhattan (1987), one of her rare acting performances in the US, most of her work being done in her home country of Canada.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3Mzg0NDE3NF5BMl5BanBnXkFtZTcwNDIyNzAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0341289","name":"Lynne Griffin","nicknames":["The Neat Canadian Lady"],"idIMDB":"nm0341289"},"actorId":"nm0341289","character":"Clare Harrison","urlCharacter":"http://www.imdb.com/character/ch0130099","main":true},{"actorName":"Michael Rapport","urlProfile":"http://www.imdb.com/name/nm0710943","urlPhoto":"","biography":{"dateOfBirth":"23 March 1946","placeOfBirth":" New York City, New York, USA","bio":"Michael Rapport was born on March 23, 1946 in New York City, New York, USA. He is an actor, known for Black Christmas (1974), Hardbodies (1984) and Ambrose Bierce: Civil War Stories (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0710943","name":"Michael Rapport","idIMDB":"nm0710943"},"actorId":"nm0710943","character":"Patrick","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leslie Carlson","urlProfile":"http://www.imdb.com/name/nm0137967","urlPhoto":"","biography":{"dateOfBirth":"24 February 1933","placeOfBirth":" Mitchell, South Dakota, USA","bio":"Excellent, prolific, and versatile character actor Leslie Carlson was born on February 24, 1933 in Mitchell, South Dakota. Leslie earned both a BFA and an MA from the University of South Dakota, which he attended in the 1950's. Carlson began his acting career performing in several stage plays in both America and England. He immigrated to Canada in the late 1960's and began popping up in a slew of films and TV shows in the early 1970's. His most memorable movie roles were helpful police officer Graham in the chilling seasonal slasher shocker \"Black Christmas,\" stuffy newspaper reporter Tom Sims in the creepy \"Deranged,\" security expert Jim in \"Shoot,\" bumbling drunk Bud in \"High-Ballin',\" and a pushy Christmas tree salesman in the delightful \"A Christmas Story.\" Leslie appeared in four pictures for noted director David Cronenberg: He was splendidly slimy as sinister white collar corporate sleazeball Barry Convex in \"Videodrome\" (for which he was nominated for a Genie Award for Best Performance by an Actor in a Supporting Role), \"The Dead Zone,\" \"The Fly,\" and the offbeat short \"Camera.\" Among the many TV shows Carlson did guest spots on are \"Road to Avonlea,\" \"The X-Files,\" \"Highlander,\" \"Friday the 13: The Series,\" \"21 Jump Street,\" \"MacGyver,\" \"The Twilight Zone,\" and \"The New Avengers.\" In addition to his film and TV credits, Leslie also acted throughout the decades in stage productions of such plays as \"Homecoming,\" \"Our Town,\" \"A Lie of the Mind\" (Carlson was nominated for a Jessie Richardson Award in 1989 for his sterling work in this particular play), \"A Walk in the Woods,\" \"Candida,\" \"Glengarry Glen Ross,\" \"Dr. Jeckyll and Mr. Hyde,\" \"Hamlet,\" \"Joggers,\" \"All My Sons,\" and \"Death and the Maiden.\" Carlson died of cancer on May 3, 2014 at the age of 81.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0137967","name":"Leslie Carlson","idIMDB":"nm0137967"},"actorId":"nm0137967","character":"Graham","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Martha Gibson","urlProfile":"http://www.imdb.com/name/nm0317104","urlPhoto":"","biography":{"dateOfBirth":"14 January 1939","placeOfBirth":" Ottawa, Ontario, Canada","bio":"Martha Gibson was born on January 14, 1939 in Ottawa, Ontario, Canada. She is an actress and writer, known for Seeing Things (1981), Black Christmas (1974) and De parents inconnus (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0317104","name":"Martha Gibson","idIMDB":"nm0317104"},"actorId":"nm0317104","character":"Mrs. Quaife","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Rutter","urlProfile":"http://www.imdb.com/name/nm0752157","urlPhoto":"","biography":{"dateOfBirth":"30 August 1943","placeOfBirth":" Ontario, Canada","bio":"John Rutter was born on August 30, 1943 in Ontario, Canada. He is known for his work on Black Christmas (1974), Three Card Monte (1978) and Day of Resurrection (1980).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0752157","name":"John Rutter","idIMDB":"nm0752157"},"actorId":"nm0752157","character":"Laughing Detective","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Warner","urlProfile":"http://www.imdb.com/name/nm0912571","urlPhoto":"","biography":{"dateOfBirth":"24 May 1937","placeOfBirth":" Canada","bio":"Robert Warner was born on May 24, 1937 in Canada. He is known for his work on Black Christmas (1974), Big Jake (1971) and Deranged: Confessions of a Necrophile (1974).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0912571","name":"Robert Warner","nicknames":["Bob"],"idIMDB":"nm0912571"},"actorId":"nm0912571","character":"Doctor","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0071222","urlIMDB":"http://www.imdb.com/title/tt0071222","business":{"budget":{"money":"$620,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$4,053,000","country":"USA","day":"20","month":"12","year":"1974","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1974/\">1974</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 38 min (98 min)"],"soundMix":["Mono"],"color":["Color (Technicolor)"],"aspectRatio":["1.75 : 1","1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Quinn Labs, Toronto, Canada","Technicolor, Hollywood (CA), USA (prints)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.2","filmingLocations":[{"location":"6 Clarendon Crescent, Toronto, Ontario, Canada"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1976","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Scroll","categories":[{"category":"Best Horror Film","names":[]}]}]},{"award":"Canadian Film Awards 1975","titlesAwards":[{"titleAwardOutcome":"Won Etrog","categories":[{"category":"Best Performance by a Lead Actress","names":[{"name":"Margot Kidder","id":"nm0452288","role":null},{"name":"A Quiet Day in Belfast","id":"tt0072056","role":null}]},{"category":"Best Sound Editing (Feature)","names":[{"name":"Kenneth Heeley-Ray","id":"nm0373459","role":null}]}]}]},{"award":"Edgar Allan Poe Awards 1976","titlesAwards":[{"titleAwardOutcome":"Nominated Edgar","categories":[{"category":"Best Motion Picture","names":[{"name":"Roy Moore","id":"nm0600860","role":null}]}]}]}],"votes":"23,138","type":"Movie","companyCreditsSimple":[{"idCompany":"co0038657","name":"Film Funding Ltd. of Canada"},{"idCompany":"co0004750","name":"Vision IV"},{"idCompany":"co0051074","name":"Canadian Film Development Corporation (CFDC)"}],"keywords":{"keywords":["christmas","subjective camera","obscene telephone call","holiday horror","sorority","sorority house","missing person","holiday","desk sergeant","police station","abortion","stalking","christmas party","murder","psychological thriller","ambiguous ending","reference to marlon brando","two word title","canuxploitation","blood splatter","entering through window","home library","secret drinker","inhaler","pov shot","fireplace poker","bloodhound","suffocated with plastic bag","woman with glasses","character's point of view camera shot","girl with glasses","nightgown","wreath","middle aged woman","phone tap","basement","search for missing person","pianist","strangulation","christmas lights","broken window","obsession","manic depression","break in","asphyxiation","anonymous telephone call","children's choir","obscene finger gesture","college life","hook","santa claus outfit","knife","dead child","telephone","kitty","unplanned pregnancy","christmas carol","bag on one's head","accidental death","prank telephone call","obscene gesture","mass murder","psychopathic killer","ice rink","hallucination","christmas gift","smothering","police detective","police officer throat slit","rocking chair","doll","head wound","snowball","pregnancy","serial killer","piano recital","alcoholic","close up eye","police investigation","search party","psychotic","remade","rocking horse","drunkenness","gothic cathedral","dark past","suspense","telephone call","distorted voice","suicide","christmas eve","dramatic irony","house cat","co ed","hockey","piano","cellar","asthma attack","incest","dead woman","christmas star","suicide attempt","banging on the wall","mysterious death","homicide","candle","scream","psycho killer","tracing a telephone call","black comedy","christmas wreath","telephone terror","mysterious telephone call","murder of a police officer","slasher flick","holiday in title","horror movie remade","throat slitting","christmas horror","hiding in a closet","murdered in sleep","boyfriend girlfriend relationship","unknown killer","psycho","one night","mystery killer","mysterious stranger","murder by strangling","multiple murder","multiple homicide","knife murder","deeply disturbed person","death by strangulation","dead girl","darkness","color in title","stabbed to death","christmas tree","small town","hidden corpse","dark humor","cult film","phone terror","slasher","old dark house","city","mansion","mental illness","avant garde","suffocation","child in peril","attic","split personality","stabbing","independent film","surprise ending","reference to charlie chaplin","reference to julie christie","dead woman with eyes open","anti christmas"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:40:56"}}