{"data":{"movies":[{"title":"The Golden Child","originalTitle":"","year":"1986","releaseDate":"19861212","directors":[{"name":"Michael Ritchie","id":"nm0006916"}],"writers":[{"name":"Dennis Feldman","id":"nm0271022"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2E2MWJhZjEtMDdmOS00MmFkLWJlNWEtNWQ0NjA0NzIwNjRkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Comedy","Fantasy","Mystery"],"plot":"Eddie Murphy plays a detective with a speciality of finding lost children. He is told he is the 'Chosen one' who will find and protect the Golden Child, a Bhuddist mystic who was kidnapped by an evil sorcerer. Murphy disbelieves the mysticism but finds more and more evidence of demon worship as he investigates.","simplePlot":"A private detective specializing in missing children is charged with the task of finding a special child who dark forces want to eliminate.","actors":[{"actorName":"J.L. Reate","urlProfile":"http://www.imdb.com/name/nm0714164","urlPhoto":"","biography":{"dateOfBirth":"14 September 1979","placeOfBirth":" California, USA","birthName":"Jasmine Reate","bio":"J.L. Reate was born on September 14, 1979 in California, USA as Jasmine Reate. She is an actress, known for The Golden Child (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0714164","name":"J.L. Reate","idIMDB":"nm0714164"},"actorId":"nm0714164","character":"The Golden Child","urlCharacter":"http://www.imdb.com/character/ch0038713","main":true},{"actorName":"Eddie Murphy","urlProfile":"http://www.imdb.com/name/nm0000552","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NDQzODAwNF5BMl5BanBnXkFtZTYwMzUzNTk3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 April 1961","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Edward Regan Murphy","height":"5' 9\" (1.75 m)","bio":"Edward Regan Murphy was born April 3, 1961 in Brooklyn, New York, to Lillian, a telephone operator, and Charles Edward Murphy, a transit police officer who was also an amateur comedian and actor. After his father died, his mother married Vernon Lynch, a foreman at a Breyer's Ice Cream plant. His siblings are Charlie Murphy and Vernon Lynch, Jr. Eddie had aspirations of being in show business since he was a child. A bright kid growing up in the streets of New York, Murphy spent a great deal of time on impressions and comedy stand-up routines rather than academics. His sense of humor and wit made him a stand out amongst his classmates at Roosevelt Junior-Senior High School. By the time he was fifteen, Murphy worked as a stand-up comic on the lower part of New York, wooing audiences with his dead-on impressions of celebrities and outlooks on life. In the early 1980s, at the age of 19, Murphy was offered a contract for the Not-Ready-For-Prime-Time Players of Saturday Night Live (1975), where Murphy exercised his comedic abilities in impersonating African American figures and originating some of the shows most memorable characters: Velvet Jones, Mr. Robinson, and a disgruntled and angry Gumby. Murphy made his feature film debut in 48 Hrs. (1982), alongside Nick Nolte. The two's comedic and antagonistic chemistry, alongside Murphy's believable performance as a streetwise convict aiding a bitter, aging cop, won over critics and audiences. The next year, Murphy went two for two, with another hit, pairing him with John Landis, who later became a frequent collaborator with Murphy in Coming to America (1988) and Beverly Hills Cop III (1994). Beverly Hills Cop (1984) was the film that made Murphy a box-office superstar and most notably made him a celebrity worldwide, and it remains one of the all-time biggest domestic blockbusters in motion-picture history. Murphy's performance as a young Detroit cop in pursuit of his friend's murderers earned him a third consecutive Golden Globe nomination. Axel Foley became one of Murphy's signature characters. On top of his game, Murphy was unfazed by his success, that is until his box office appeal and choices in scripts resulted into a spotty mix of hits and misses into the late 1980s and early 1990s. Films like The Golden Child (1986) and Beverly Hills Cop II (1987) were critically panned but were still massive draws at the box office. In 1989, Murphy, coming off another hit, Coming to America (1988), found failure with his directorial debut, Harlem Nights (1989). Another 48 Hrs. (1990) and his turn as a hopeless romantic in Boomerang (1992) did little to resuscitate his career. However, his remake of Jerry Lewis's The Nutty Professor (1996) brought Murphy's drawing power back into fruition. From there, Murphy rebounded with occasional hits and misses but has long proven himself as a skilled comedic actor with applaudable range pertaining to characterizations and mannerisms. Though he has grown up a lot since his fast-lane rise as a superstar in the 1980s, Murphy has lived the Hollywood lifestyle with controversy, criticism, scandal, and the admiration of millions worldwide for his talents. As Murphy had matured throughout the years, learning many lessons about the Hollywood game in the process, he settled down with more family-oriented humor with Doctor Dolittle (1998), Mulan (1998), Bowfinger (1999), and the animated smash Shrek (2001), in a supporting role that showcased Murphy's comedic personality and charm. Throughout the 2000s, he further starred in the hits The Haunted Mansion (2003), Shrek 2 (2004), Dreamgirls (2006) (for which he was nominated for a Best Supporting Actor Oscar), Norbit (2007), Shrek the Third (2007), and Shrek Forever After (2010). Murphy was married to Nicole Mitchell Murphy from 1993 to 2006. Murphy has eight children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NDQzODAwNF5BMl5BanBnXkFtZTYwMzUzNTk3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000552","name":"Eddie Murphy","nicknames":["Ed","Murph"],"idIMDB":"nm0000552"},"actorId":"nm0000552","character":"Chandler Jarrell","urlCharacter":"http://www.imdb.com/character/ch0016809","main":true},{"actorName":"Charles Dance","urlProfile":"http://www.imdb.com/name/nm0001097","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzY0Mjg4MzM0Ml5BMl5BanBnXkFtZTcwODc4NTIxNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1946","placeOfBirth":" Redditch, Worcestershire, England, UK","birthName":"Walter Charles Dance","height":"6' 3\" (1.91 m)","bio":"Charles Dance is an English actor, screenwriter, and film director. Dance typically plays assertive bureaucrats or villains. Some of his most high-profile roles are Tywin Lannister in HBO's Game of Thrones (2011), Guy Perron in The Jewel in the Crown (1984), Sardo Numspa in The Golden Child (1986), Dr. Jonathan Clemens in Alien 3 (1992), Benedict in Last Action Hero (1993), the Master Vampire in Dracula Untold (2014), Lord Havelock Vetinari in Terry Pratchett's Going Postal (2010) and Alastair Denniston in The Imitation Game (2014). He played the role of Tywin Lannister in HBO's Game of Thrones (2011), based on the Song of Ice and Fire novels by George R. R. Martin. In 1989, he played Bond creator Ian Fleming in Anglia Television's drama biography.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzY0Mjg4MzM0Ml5BMl5BanBnXkFtZTcwODc4NTIxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001097","name":"Charles Dance","idIMDB":"nm0001097"},"actorId":"nm0001097","character":"Sardo Numspa","urlCharacter":"http://www.imdb.com/character/ch0016811","main":true},{"actorName":"Charlotte Lewis","urlProfile":"http://www.imdb.com/name/nm0001470","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NTY3NzM2MV5BMl5BanBnXkFtZTYwNzQwODI3._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 August 1967","placeOfBirth":" Kensington, London, England, UK","height":"5' 6½\" (1.69 m)","bio":"Charlotte Lewis was born on August 7, 1967 in Kensington, London, England. She is an actress, known for The Golden Child (1986), Men of War (1994) and Storyville (1992).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NTY3NzM2MV5BMl5BanBnXkFtZTYwNzQwODI3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001470","name":"Charlotte Lewis","idIMDB":"nm0001470"},"actorId":"nm0001470","character":"Kee Nang","urlCharacter":"http://www.imdb.com/character/ch0016810","main":true},{"actorName":"Victor Wong","urlProfile":"http://www.imdb.com/name/nm0939378","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTgxOTQzNjQ0NV5BMl5BanBnXkFtZTcwNjM1OTgwMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1927","placeOfBirth":" San Francisco, California, USA","birthName":"Yee Keung Victor Wong","height":"5' 4\" (1.63 m)","bio":"Eccentric looking Chinese-American actor with a slightly drooping face (the result of a bout of Bell's palsy) who studied political science, art & journalism before becoming a news reporter for a San Francisco public TV station in the late 1960s. Apart from a brief stint in the mid-1970s on the TV soap opera Search for Tomorrow (1951), Wong didn't break into movies until he was in his late fifties in the minor telemovie American Playhouse: Nightsongs (1984). He then appeared in the explosive Mickey Rourke gang movie Year of the Dragon (1985), followed by the heart warming Dim Sum: A Little Bit of Heart (1985), before scoring the role he is probably best remembered for, as the Chinese wizard \"Egg Shen\" helping truck driver Kurt Russell defeat the evil \"Lo-Pan\" in Big Trouble in Little China (1986). His offbeat style remained in demand with more work in Prince of Darkness (1987) and then as an opportunistic store owner, who gets more than he bargained for, in the tongue in cheek horror film Tremors (1990). Wong then appeared as the wise grandfather / retired ninja in the kids martial arts adventure 3 Ninjas (1992), plus he repeated his popular role for the sequels 3 Ninjas Kick Back (1994), 3 Ninjas Knuckle Up (1995) and for his final film appearance 3 Ninjas: High Noon at Mega Mountain (1998). Wong retired from acting in 1998 due to ill health, and passed away in September 2001 from heart failure.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTgxOTQzNjQ0NV5BMl5BanBnXkFtZTcwNjM1OTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0939378","name":"Victor Wong","idIMDB":"nm0939378"},"actorId":"nm0939378","character":"The Old Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Randall 'Tex' Cobb","urlProfile":"http://www.imdb.com/name/nm0002012","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMzc2NzYwN15BMl5BanBnXkFtZTcwMTI3OTgwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 May 1950","placeOfBirth":" Bridge City, Texas, USA","birthName":"Randall Hubbard Cobb","height":"6' 3\" (1.91 m)","bio":"Former Heavyweight boxing contender Randall \"Tex\" Cobb has had 3 highly colorful careers; kickboxer, pro boxer, and movie actor. Born in Bridge City, Texas on May 7, 1950, the 6 feet 3 inch, 225 pound Cobb excelled in high school football and martial arts. Enjoying \"extreme\" sports to the max, Cobb launched a professional kickboxing career and racked up 9 straight knockout victories. Realizing however, that the big money was in boxing, he switched sports and launched a professional boxing career. Known for a \"cast-iron\" chin, a sledge-hammer punch, and a \"gift for gab\", Cobb quickly established himself as one of the top heavyweight contenders in the world. Cobb's brutal, one-sided beating by heavyweight King Larry Holmes over 15 rounds (Cobb was never off his feet) caused world-famous boxing announcer Howard Cosell to \"swear-off\" boxing for the rest of his life. Cobb took the beating with his typical grin and a wide smirk. His antics captured the attention of Hollywood and he was cast as Jon Voight's opponent in the remake of The Champ (1979). Cobb went on to act in a vast number of successful productions, receiving positive reviews for his \"raw, primitive,\" acting style. He launched a highly successful ring comeback in the early 1990s stretching his winning streak to 20 straight. However, he retired unexpectedly with a 43-7 log with 36 knockouts, never to box again. He continues to act and has been the subject of a highly-controversial Sport's Illustrated article which resulted in numerous law-suits.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMzc2NzYwN15BMl5BanBnXkFtZTcwMTI3OTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002012","name":"Randall 'Tex' Cobb","idIMDB":"nm0002012"},"actorId":"nm0002012","character":"Til","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Hong","urlProfile":"http://www.imdb.com/name/nm0393222","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0MTQxOTA4MF5BMl5BanBnXkFtZTgwODE1OTcyMjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1929","placeOfBirth":" Minneapolis, Minnesota, USA","height":"5' 10\" (1.78 m)","bio":"James Hong was born in Minneapolis, Minnesota, USA. He studied civil engineering at the University of Minnesota, but at some point along the way became interested in acting. He graduated from the University of Southern California and practiced for 1½ years as a road engineer with the County of Los Angeles. He took sick leaves and vacation time to do films. He finally quit engineering to focus on acting full time. He is one of the founders of the East-West Players, the oldest Asian American theater in Los Angeles. He served as president and charter member of the Association of Asian Pacific American Artists. Hong is one of the most prolific and well-recognized Asian-American character actors of movies and television. He currently lives in Los Angeles and is planning to produce and direct his own films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0MTQxOTA4MF5BMl5BanBnXkFtZTgwODE1OTcyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0393222","name":"James Hong","nicknames":["Jimmy"],"idIMDB":"nm0393222"},"actorId":"nm0393222","character":"Doctor Hong","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shakti Chen","urlProfile":"http://www.imdb.com/name/nm0787695","urlPhoto":"","biography":{"dateOfBirth":"15 May 1958","placeOfBirth":" China","bio":"Shakti Chen was born on May 15, 1958 in China. She is an actress, known for The Golden Child (1986), Star Trek VI: The Undiscovered Country (1991) and Volunteers (1985). She was previously married to Leslie Stevens.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0787695","name":"Shakti Chen","idIMDB":"nm0787695"},"actorId":"nm0787695","character":"Kala","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tau Logo","urlProfile":"http://www.imdb.com/name/nm0517762","urlPhoto":"","biography":{"bio":"Tau Logo is an actor, known for The Golden Child (1986), Saturday the 14th Strikes Back (1988) and East L.A. Warriors (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0517762","name":"Tau Logo","idIMDB":"nm0517762"},"actorId":"nm0517762","character":"Yu","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tiger Chung Lee","urlProfile":"http://www.imdb.com/name/nm0498365","urlPhoto":"","biography":{"dateOfBirth":"7 February 1948","placeOfBirth":" Tokyo, Japan","birthName":"Masanori Toguchi","height":"6' 4\" (1.93 m)","bio":"Tiger Chung Lee was born on February 7, 1948 in Tokyo, Japan as Masanori Toguchi. He is an actor, known for The Golden Child (1986), Red Heat (1988) and Blind Fury (1989). He was previously married to Shou Li.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0498365","name":"Tiger Chung Lee","idIMDB":"nm0498365"},"actorId":"nm0498365","character":"Khan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pons Maar","urlProfile":"http://www.imdb.com/name/nm0006542","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg1OTQ4OTQ0M15BMl5BanBnXkFtZTYwNDEzNTAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1951","placeOfBirth":" Pensacola, Florida, USA","height":"6' (1.83 m)","bio":"Pons Maar is originally from Florida where he studied ceramics and visual art. After moving to San Francisco he became a fixture on the local arts scene as a graphic designer and performance artist, and, as a musician, playing in a couple of art/punk bands. At one of his solo performances of 'Natural Enemies' he was seen by Oscar-winning Sound Designer/Editor Walter Murch and cast as the Lead Wheeler in Walter's first directing effort Return to Oz (1985). Pons acted in the film as well as serving as the Performance Coordinator, starting what was to become a pattern of working on both sides of the camera. Following with other non-human roles in _Golden Child(1987)_ and _Masters of the Universe (1988)_ he continued to delve deeper into extreme latex makeup and huge, hot, and heavy creature and fantasy character suits. After the full 65 episode run on the TV show _Dinosaurs(1991)_ and playing the lead character in _Theodore Rex(1995)_. Pons then focused on Coordinating Puppets and Creatures in various feature films and TV productions. Pons served as the Co-Head of the Screen Actor's Guild Puppeteer Committee from 2003-2005. During this time he and co-head, Kevin Carlson, were able to change the puppeteer's status from a caucus to a full committee. Currently (2017) he is a partner in TASTY NAME a boutique video production company based in Alameda, CA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg1OTQ4OTQ0M15BMl5BanBnXkFtZTYwNDEzNTAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006542","name":"Pons Maar","nicknames":["Moustapha"],"idIMDB":"nm0006542"},"actorId":"nm0006542","character":"Fu","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Kwong","urlProfile":"http://www.imdb.com/name/nm0477286","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNzE3Mzg4MV5BMl5BanBnXkFtZTYwNzQ1Njcy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1952","placeOfBirth":" Los Angeles, California, USA","bio":"Peter Kwong is a veteran of film, television and stage, best known for his roles as Rain in Big Trouble in Little China and as Tommy Tong in Eddie Murphy's Golden Child. He just finished filming Cooties, starring Elijah Wood, and has appeared in more than 100 film and television roles. Other favorite films include roles in The Presidio, Angel Town, Never Too Young To Die, Gleaming The Cube, Steel Justice, Theodore Rex with Whoopie Goldberg, Row Your Boat with Jon Bon Jovi and Bai Ling, and Pearl S. Buck's historic epic The Living Reed as the King of Korea. On television you may have seen him in \"Sullivan & Son,\" \"Malcolm and Eddie,\" \"Sisters,\" \"The Wayan Brothers,\" \"Daddy Dearest,\" \"Renegade,\" \" Top Cops,\" \"Full House,\" \"Doctor, Doctor\". On stage, Mr. Kwong portrayed the lead role as Dr. Haing S. Ngor in The Survivor: A Cambodian Odyssey by Jon Lipsky at the Actors Theatre of Louisville/Humana Festival, and stretched his musical theater skills in Mame with the late Juliet Prowse. In addition to his thriving acting career, Kwong recently served on the Board of Governors of the Academy of Television Arts & Sciences for two terms and served on The Board of Directors of SAG-AFTRA, chairman of the Committee for Racial Equality of Actors Equity Association, and the Vice-Chairs of the Ethnic Equal Opportunities and the Young Performers Committees of the Screen Actors Guild. He is a member of the Academy of Motion Picture Arts and Sciences & Television Academy. He has also served with the Los Angeles Asian Pacific Heritage Week. He has emceed events for Visual Communications, The Lotus Festival, Asian Business League, and the Los Angeles Miss Chinatown Pageant four times and had the privilege to go to Namibia, Africa to judge the Miss Universe Pageant. Kwong's talents have won him an honorary membership in the Los Angeles Mime Guild. He is featured dancing on numerous music videos, including Ed Sheeran's Sing. He studied Northern Shao lin Kung-fu which has allowed him to do many of his own stunts and eventually branch off to more meditative disciplines such as Tai Chi Chuan and Chi Kung Meditation. He teaches Tai Chi Chuan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNzE3Mzg4MV5BMl5BanBnXkFtZTYwNzQ1Njcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0477286","name":"Peter Kwong","idIMDB":"nm0477286"},"actorId":"nm0477286","character":"Tommy Tong","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wally Taylor","urlProfile":"http://www.imdb.com/name/nm0853321","urlPhoto":"","biography":{"dateOfBirth":"1931","placeOfBirth":" Maywood, Illinois, USA","bio":"Wally Taylor was born in 1931 in Maywood, Illinois, USA. He was an actor, known for Rocky III (1982), Escape from New York (1981) and The Golden Child (1986). He died on October 7, 2012 in San Antonio, Texas, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0853321","name":"Wally Taylor","idIMDB":"nm0853321"},"actorId":"nm0853321","character":"Detective Boggs","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eric Douglas","urlProfile":"http://www.imdb.com/name/nm0235040","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzOTQ0ODAzNl5BMl5BanBnXkFtZTcwMDI3NTUyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 June 1958","placeOfBirth":" Los Angeles, California, USA","birthName":"Eric Anthony Douglas","height":"5' 7\" (1.7 m)","bio":"Eric Douglas was born on June 21, 1958 in Los Angeles, California, USA as Eric Anthony Douglas. He was an actor, known for The Golden Child (1986), Delta Force 3: The Killing Game (1991) and A Gunfight (1971). He died on July 6, 2004 in Manhattan, New York City, New York, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzOTQ0ODAzNl5BMl5BanBnXkFtZTcwMDI3NTUyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0235040","name":"Eric Douglas","idIMDB":"nm0235040"},"actorId":"nm0235040","character":"Yellow Dragon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Levin","urlProfile":"http://www.imdb.com/name/nm0505570","urlPhoto":"","biography":{"dateOfBirth":"12 March 1949","placeOfBirth":" Chicago, Illinois, USA","birthName":"Charles Herbert Levin","bio":"Charles Levin was born on March 12, 1949 in Chicago, Illinois, USA as Charles Herbert Levin. He is an actor, known for Manhattan (1979), Annie Hall (1977) and This Is Spinal Tap (1984). He was previously married to Katherine DeHtre.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0505570","name":"Charles Levin","idIMDB":"nm0505570"},"actorId":"nm0505570","character":"TV Host","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0091129","urlIMDB":"http://www.imdb.com/title/tt0091129","business":{"budget":{"money":"$25,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$12,000,000","country":"USA","day":"14","month":"12","year":"1986","remarks":""}],"gross":[{"money":"SEK","country":"9,667,659","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1986/\">1986</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 34 min (94 min)"],"soundMix":["Dolby"],"color":["Color (Metrocolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Metrocolor, Culver City (CA), USA"],"filmLength":null,"negativeFormat":["35 mm (also horizontal) (Eastman 125T 5247, 400T 5294)"],"cinematographicProcess":["Spherical","VistaVision (visual effects)"],"printedFilmFormat":["35 mm"]},"rating":"5.9","filmingLocations":[{"location":"Melrose Avenue at North Spaulding, Los Angeles, California, USA"}],"rated":"PG-13","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1987","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Fantasy Film","names":[]}]}]},{"award":"Young Artist Awards 1988","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Young Actress in a Motion Picture - Drama","names":[{"name":"J.L. Reate","id":"nm0714164","role":null}]}]}]}],"votes":"41,837","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"},{"idCompany":"co0102273","name":"Eddie Murphy Productions"},{"idCompany":"co0072491","name":"Industrial Light & Magic (ILM)"}],"keywords":{"keywords":["child","boy","demon","woman","detective","chosen one","mysticism","asian","temple","social worker","monk","mystic","tibet","private detective","bird","kathmandu nepal","prophecy","1980s","private investigator","opening action scene","three word title","fistfight","chase","pistol","brawl","gunfight","showdown","shootout","hand to hand combat","nipples visible through clothing","villain turns good","true love","self sacrifice","screwball","knife","good versus evil","dead woman","dagger","butterfly","statue of liberty new york city","dream","resurrection","reluctant hero","loss of loved one","dark fantasy","black hero","biker gang","beyond death","anti hero","supernatural power","kidnapping","reference to ed mcmahon","cult film","child abandonment","unlikely hero","search","rescue","religious leader","religion","oracle","opposites attract","interracial romance","house","hallucination","fish out of water","culture clash","massacre","blockbuster","missing person","hollywood sign","holy child","devil","buddhism","monster","missing child","karate","crossbow","los angeles california","parakeet","chinatown","kung fu","dragon","eiffel tower paris","martial arts","telekinesis","hell","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 01:54:58"}}