{"data":{"movies":[{"title":"Yellowstone Kelly","originalTitle":"","year":"1959","releaseDate":"19600113","directors":[{"name":"Gordon Douglas","id":"nm0235066"}],"writers":[{"name":"Burt Kennedy","id":"nm0447944"},{"name":"Heck Allen","id":"nm0020571"}],"runtime":"91 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMjk4NDc4NF5BMl5BanBnXkFtZTcwNTM3ODU5Mw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Western"],"plot":"A fur-trapper named Kelly, who once saved the life of a Sioux chief, is allowed to set his traps in Sioux territory during the late 1870s. Reluctantly he takes on a tenderfoot assistant named Anse and together they give shelter to a runaway Arapaho woman. Tensions develop when Anse falls in love with this woman and when the Sioux chief arrives with his warriors to re-claim her.","simplePlot":"In 1870s, in the Sioux territory south of the Missouri, trapper and Indian scout Luther Yellowstone Kelly is hired by the army at Fort Buford but runs into trouble with the Sioux.","actors":[{"actorName":"Clint Walker","urlProfile":"http://www.imdb.com/name/nm0907636","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MTk5OTc4OF5BMl5BanBnXkFtZTcwNzA0OTUwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 May 1927","placeOfBirth":" Hartford, Illinois, USA","birthName":"Norman Eugene Walker","height":"6' 6\" (1.98 m)","bio":"Clint Walker was born Norman Eugene Walker in Hartford, southwestern Illinois, to Gladys Huldah (Schwanda), a Czech immigrant, and Paul Arnold Walker, who was from Arkansas. Walker almost single-handedly started the western craze on TV in the 1950s as Cheyenne Bodie in Cheyenne (1955). Growing up in the Depression era meant taking work wherever you could get it, and Walker found himself working at such jobs as Mississippi River boatman, carnival roustabout and golf caddy. He quit high school at 16 and at age 17 joined the Merchant Marine. After the war he worked his way cross country, including working in the oil fields in Brownwood, Texas, and wound up in California, where he worked as an undercover agent for a private detective agency on the Long Beach waterfront. After a while he took a job as a security officer at the Sands Hotel in Las Vegas. It was there that he met quite a few Hollywood people who told him that his size, physique and good looks would serve him well in Hollywood and that he should go to Los Angeles and give it a try. He met actor Henry Wilcoxon, who introduced him to director Cecil B. DeMille, and Walker found himself playing the part of a Captain of the Guard in The Ten Commandments (1956). Someone from Warner Bros. saw the film, found out that Walker was under contract to producer Hal B. Wallis, bought up Walker's contract and gave him the lead in \"Cheyenne\". The series was a huge hit and spawned countless other western series, from Warners and other studios. However, Walker was dissatisfied with the way Warners was handling his career -- they would let other contract players make films, for example, but he wasn't allowed to -- and that triggered a dispute which ended up with him taking a walk from the show. He and Warners eventually settled their disagreements. When the show ended Walker began to get supporting parts in features, his biggest and most successful one being The Dirty Dozen (1967). He starred in the well-received The Night of the Grizzly (1966) and the not-so-well received None But the Brave (1965), a WWII film that was Frank Sinatra's one and only stab at directing. He also played the lead in Baker's Hawk (1976), and turned in a good performance as a villain in the TV movie Scream of the Wolf (1974). Lately he and several of his colleagues from \"The Dirty Dozen\" provided the voices for the animated film Small Soldiers (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MTk5OTc4OF5BMl5BanBnXkFtZTcwNzA0OTUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0907636","name":"Clint Walker","idIMDB":"nm0907636"},"actorId":"nm0907636","character":"Luther 'Yellowstone' Kelly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edd Byrnes","urlProfile":"http://www.imdb.com/name/nm0126318","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MjYwODU2Ml5BMl5BanBnXkFtZTYwMDY3NjM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1933","placeOfBirth":" New York City, New York, USA","birthName":"Edward Breitenberger","bio":"Born Edward Byrne Breitenberger in New York City on July 30, 1933, Edd Byrnes shared an impoverished and unhappy childhood with brother Vincent and sister Jo-Ann. Their mother worked hard at various jobs to keep the family together because her alcoholic husband was often absent from the scene. When Edd was 13 his father was found dead in a basement. Edd then dropped his last name in favor of \"Byrnes\", based on the name of his maternal grandfather, a New York City fireman. Edd found escape from family problems at the movies and at the gym, where he developed an athletic body. At age 17 he was approached by a man who offered to take free \"physique\" photos of him. According to Edd's 1996 autobiography, \"Kookie No More\", this led to a few years of \"hustling\" older, well-to-do men, despite the fact that Edd was heterosexual. One of these men acted as Edd's mentor, introducing him to fashion and culture and encouraging his hopes for an acting career. After doing some summer-stock work and a few bit parts on TV, Edd drove to California in 1955, arriving in Los Angeles on the day James Dean died in a car crash. He managed to get a few minor parts in films and then won a role in a new TV series called 77 Sunset Strip (1958), which premiered in September of 1958. Efrem Zimbalist Jr. and Roger Smith starred as private eyes but Edd, playing a hip-talking parking-lot attendant named \"Kookie\", won the most attention. Viewers quoted his dialog, (\"Baby, you're the ginchiest!\"), and young males imitated the way he wielded his ever-present comb. His fan mail soon reached an astonishing 15,000 letters a week and his single with Connie Stevens, \"Kookie, Kookie, Lend Me Your Comb\", became a top-5 hit. Edd chafed, however, at the restrictions in his Warner Brothers contract, which forced him to turn down roles in Ocean's 11 (1960), North to Alaska (1960) and Rio Bravo (1959). He walked off the \"77 Sunset Strip\" set and in the ensuing months began to drink heavily and visit a psychiatrist, who administered drugs to him. His contract dispute was eventually settled, though not much to his advantage, and when he returned to \"77 Sunset Strip\" his role was upgraded from \"sidekick\" to \"partner\" and he wore a suit and tie. Audience reaction was not good, ratings dropped, and the show was canceled. The hip-talking, hair-combing image clung to him, however, and Edd felt he lost the lead in PT 109 (1963) because President John F. Kennedy didn't want to be played by \"Kookie.\" A few more movies and TV appearances followed, but his career had passed its peak before he turned 30. In 1962 he married long-time girlfriend Asa Maynor. Their son, Logan, was born on September 13, 1965. Edd and Asa's marriage ended in divorce in 1971, partially because of his reliance on drugs and alcohol. In 1982 he succeeded in going \"clean and sober.\" He never remarried, remains proud of his son, and has come to terms with his role as television's first teen idol.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MjYwODU2Ml5BMl5BanBnXkFtZTYwMDY3NjM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0126318","name":"Edd Byrnes","idIMDB":"nm0126318"},"actorId":"nm0126318","character":"Anse Harper","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Russell","urlProfile":"http://www.imdb.com/name/nm0751245","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NjU5MzYwNl5BMl5BanBnXkFtZTcwMDgyOTgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 January 1921","placeOfBirth":" Los Angeles, California, USA","birthName":"John Lawrence Russell","height":"6' 3\" (1.91 m)","bio":"Handsome, rugged American leading man John Russell (whose credits are often confused with those of child actor Johnny Russell) attended the University of California, where he was a student athlete. Serving in the US Marine Corps in WW II, he earned a battlefield commission and decorations for valor at Guadalcanal. His dark good looks brought him to the attention of a talent scout after the war and he began playing second leads and occasional heavies in major productions. In the 1950s, he branched into television and starred in several popular series, most notably Lawman (1958). His appearances were sporadic after the 1960s, though he was a memorable villain in Clint Eastwood's Pale Rider (1985).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NjU5MzYwNl5BMl5BanBnXkFtZTcwMDgyOTgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0751245","name":"John Russell","idIMDB":"nm0751245"},"actorId":"nm0751245","character":"Gall","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ray Danton","urlProfile":"http://www.imdb.com/name/nm0200645","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3OTYwMjg2Nl5BMl5BanBnXkFtZTcwODk5MjgwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 September 1931","placeOfBirth":" New York City, New York, USA","birthName":"Raymond Kaplan","height":"6' (1.83 m)","bio":"Handsome and smooth natured leading man who often played oily individuals, Ray Danton was born in New York and dramatically trained at Carnegie Tech. First debuted on-screen as a moody Native American in Chief Crazy Horse (1955) and regularly guest-starred in many 1950s TV shows including Playhouse 90 (1956), Wagon Train (1957), and 77 Sunset Strip (1958)...often as a gunslinger or a slippery criminal. Danton found plenty of demand for his talents and appeared in several minor films including The Night Runner (1957), Tarawa Beachhead (1958), in which he starred with his wife, Julie Adams, and then as a serial rapist in The Beat Generation (1959). However, his most well remembered role was as the vicious prohibition gangster Jack Diamond in the superb The Rise and Fall of Legs Diamond (1960) also starring a young Warren Oates and directed by Budd Boetticher. Danton reprised his Legs Diamond role only a year later in the unrelated, and not as enjoyable Portrait of a Mobster (1961). Cornering the market on playing shady characters, Danton then portrayed troubled actor George Raft in The George Raft Story (1961), but he was back on the side of good in 1962 playing an Allied officer at the invasion of Normandy in The Longest Day (1962). Europe then beckoned for the virile Danton, and like many other young US actors in the early 1960s, he made several films in Italy and Spain between 1964 and 1969 with a mixture of success. Danton returned to the USA in the early 1970s and appeared in several other low budget features; however, he also turned his hand to direction and his first film was the AIP production of Deathmaster (1972) starring Robert Quarry who was riding high on the success of the Count Yorga vampire films. Danton directed another couple of minor horror films before becoming involved in television and directing episodes of some of the most popular TV series of the 1970/80s including Quincy M.E. (1976), The Incredible Hulk (1978), Magnum, P.I. (1980) and Cagney & Lacey (1981). His final directorial work was on the TV series Vietnam War Story (1987) in 1987. Danton passed away in 1992 from kidney failure aged only 61.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3OTYwMjg2Nl5BMl5BanBnXkFtZTcwODk5MjgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0200645","name":"Ray Danton","idIMDB":"nm0200645"},"actorId":"nm0200645","character":"Sayapi, Gall's Nephew","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Claude Akins","urlProfile":"http://www.imdb.com/name/nm0015391","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MDc0MjU3MF5BMl5BanBnXkFtZTcwNTE1NDg5Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1926","placeOfBirth":" Nelson, Georgia, USA","birthName":"Claude Marion Akins","height":"6' 1\" (1.85 m)","bio":"Broad-shouldered and beefy Claude Akins had wavy black hair, a deep booming voice and was equally adept at playing sneering cowardly villains as he was at portraying hard-nosed cops. The son of a police officer, Akins never seemed short of work and appeared in nearly 100 films and 180+ TV episodes in a career spanning over 40 years. He originally attended Northwestern University, and went on to serve with the US Army Signal Corps in World War II in Burma and the Phillipines. Upon returning, he reignited his interest in art and drama and first appeared in front of the camera in 1953 in From Here to Eternity (1953). He quickly began notching up roles in such TV shows as Dragnet (1951), My Friend Flicka (1955), Gunsmoke (1955) and Zane Grey Theater (1956). He also turned in several strong cinematic performances, such as gunfighter Joe Burdette in the landmark western Rio Bravo (1959), Mack in the excellent The Defiant Ones (1958), Sgt. Kolwicz in Merrill's Marauders (1962) and Earl Sylvester in the gripping The Killers (1964). In the early 1970s Akins turned up in several supernatural TV films playing \"no-nonsense\" sheriffs in both The Night Stalker (1972) and The Norliss Tapes (1973), and was unrecognizable underneath his simian make-up as war-mongering Gen. Aldo in Battle for the Planet of the Apes (1973). Akins continued starring in films and TV right up until the time of his death from cancer in 1994. By all reports a very gregarious, likable and friendly person off screen, Akins was married for over 40 years to Theresa \"Pie\" Fairfield, and had three children, Claude Marion Jr., Michele & Wendy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MDc0MjU3MF5BMl5BanBnXkFtZTcwNTE1NDg5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0015391","name":"Claude Akins","idIMDB":"nm0015391"},"actorId":"nm0015391","character":"Sergeant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rhodes Reason","urlProfile":"http://www.imdb.com/name/nm0714156","urlPhoto":"","biography":{"dateOfBirth":"19 April 1930","placeOfBirth":" Glendale, California, USA","birthName":"Rhodes Reason","height":"6' 2\" (1.88 m)","bio":"Rhodes Reason was born in Glendale, California on April 19, 1930. He is the younger brother of Rex Reason. Rhodes made his professional debut at the age of 18 in the play Romeo and Juliet under the direction of Charles Laughton. His career has spanned nearly 40 years and he has appeared in over 230 roles in television, movies and stage. He starred in the series White Hunter (1957) in England, and was cast as Sheriff Will Mayberry in the TV series Bus Stop (1961). His numerous guest appearances have included Death Valley Days (1952), Here's Lucy (1968), Maverick (1957), 77 Sunset Strip (1958), The Time Tunnel (1966), Perry Mason (1957), Star Trek (1966), and many more. In the early 1980s he starred in the Broadway musical \"Annie\", playing Daddy Warbucks for nearly three years. He is an active member of the Academy of Motion Picture Arts and Sciences.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0714156","name":"Rhodes Reason","idIMDB":"nm0714156"},"actorId":"nm0714156","character":"Major Towns","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andra Martin","urlProfile":"http://www.imdb.com/name/nm0551907","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTVmNDc0MTQtNjhlNy00OWQzLWJmZmMtYjIwNWJiZGI2NGUxL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzAwOTU1MTk@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1935","placeOfBirth":" Rockford, Illinois, USA","birthName":"Sandra Rehn","bio":"Andra Martin was born on July 15, 1935 in Rockford, Illinois, USA as Sandra Rehn. She is an actress, known for Up Periscope (1959), The Thing That Couldn't Die (1958) and The Big Beat (1958). She has been married to Philip M. Stein since August 8, 1970. She was previously married to David May II and Ty Hardin.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTVmNDc0MTQtNjhlNy00OWQzLWJmZmMtYjIwNWJiZGI2NGUxL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzAwOTU1MTk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0551907","name":"Andra Martin","idIMDB":"nm0551907"},"actorId":"nm0551907","character":"Wahleeah, Sayapi's Arapaho Captive","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Vinson","urlProfile":"http://www.imdb.com/name/nm0899090","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDA2NDk4Nl5BMl5BanBnXkFtZTcwOTUwNTgxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 October 1936","placeOfBirth":" Los Angeles, California, USA","birthName":"Robert Gary Vinson","height":"6' (1.83 m)","bio":"Gary Vinson was born on October 22, 1936 in Los Angeles, California, USA as Robert Gary Vinson. He was an actor and writer, known for McHale's Navy (1962), Pistols 'n' Petticoats (1966) and High School Caesar (1960). He was married to Lavonne R. Wuertzer and Paula J. Hill. He died on October 15, 1984 in Redondo Beach, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDA2NDk4Nl5BMl5BanBnXkFtZTcwOTUwNTgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0899090","name":"Gary Vinson","idIMDB":"nm0899090"},"actorId":"nm0899090","character":"Lieutenant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Warren Oates","urlProfile":"http://www.imdb.com/name/nm0643105","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMDUwMDkxOV5BMl5BanBnXkFtZTcwMjk3NDcyNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 July 1928","placeOfBirth":" Depoy, Kentucky, USA","birthName":"Warren Mercer Oates","height":"5' 11¼\" (1.81 m)","bio":"Warren Oates was an American character actor of the 1960s and 1970s and early 1980s whose distinctive style and intensity brought him to offbeat leading roles. Oates was born in Depoy, a very small Kentucky town. He was the son of Sarah Alice (Mercer) and Bayless Earle Oates, a general store owner. He attended high school in Louisville, continuing on to the University of Louisville and military service with the U.S. Marines. In college he became interested in the theatre and in 1954 headed for New York to make his mark as an actor. However, his first real job in television was, as it had been for James Dean before him, testing the contest gags on the game show Beat the Clock (1950). He did numerous menial jobs while auditioning, including serving as the hat-check man at the nightclub \"21\". By 1957 he had begun appearing in live dramas such as Studio One in Hollywood (1948), but Oates' rural drawl seemed more fitted for the Westerns that were proliferating on the big screen at the time, so he moved to Hollywood and immediately stared getting steady work as an increasingly prominent supporting player, often as either craven or vicious types. With his role as one of the Hammond brothers in the Sam Peckinpah masterpiece Ride the High Country (1962), Oates found a niche both as an actor and as a colleague of one of the most distinguished and distinctive directors of the period. Peckinpah used Oates repeatedly, and Oates, in large part due to the prominence given him by Peckinpah, became one of those rare character actors whose name and face is as familiar as those of many leading stars. He began to play roles which, while still character parts, were also leads, particularly in cult hits like Two-Lane Blacktop (1971) and Bring Me the Head of Alfredo Garcia (1974). Although never destined to be a traditional leading man, Oates remained one of Hollywood's most valued and in-demand character players up until his sudden death from a heart attack on April 3, 1982 at the age of 53. His final two films, Tough Enough (1983) (filmed in late 1981) and Blue Thunder (1983) (filmed in early 1980), were released over one year after his death and were dedicated to his memory.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMDUwMDkxOV5BMl5BanBnXkFtZTcwMjk3NDcyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0643105","name":"Warren Oates","idIMDB":"nm0643105"},"actorId":"nm0643105","character":"Corporal","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0053457","urlIMDB":"http://www.imdb.com/title/tt0053457","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"© COPYRIGHT MCMLIX BY WARNER BROS. PICTUTES, INC. ALL RIGHTS RESERVED (on print)"},"technical":{"runtime":["1 hr 31 min (91 min)"],"soundMix":["Mono (RCA Sound Recording)"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1 (DVD aspect ratio)","1.37 : 1"],"camera":null,"laboratory":["Technicolor, USA (color) (as Technicolor®)"],"filmLength":["2,507 m (Netherlands)","2,515 m (10 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.5","filmingLocations":[{"location":"Flagstaff, Arizona, USA"}],"rated":"APPROVED","awards":[],"votes":"681","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."}],"keywords":{"keywords":["sioux chief","1870s","tenderfoot","fur trapper","based on real person","storm","chimney fire","nickname","horse chase","indian attack","horse and cart","man carrying woman in arms","killed with a knife","stabbed to death","brawl","coffee drinking","dead body floating in a river","river","house on fire","admiration","friendship","arrow in chest","screaming woman","saying last words before dying","bare chested male","prayer","dove egg","removing a bullet","scar","falling in love","campfire","kicked by a mule","mule","lieutenant","sergeant","major","saloon","reference to the battle of little big horn","reference to george armstrong custer","tall man","uncle nephew relationship","squaw","nickname in title","two word title","american indian","native american","u.s. cavalry","tied up","riverboat","missouri river","captive","arrow in back","u.s. army","sioux tribe","montana","arapaho tribe","mountain man","based on novel","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:53:21"}}