{"data":{"movies":[{"title":"Soif de justice","originalTitle":"Kuai can che","year":"1984","releaseDate":"19840817","directors":[{"name":"Sammo Kam-Bo Hung","id":"nm0005033"}],"writers":[{"name":"Edward Tang","id":"nm0849282"},{"name":"Gwing-Gai Lee","id":"nm1471273"}],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTMzNTAzNV5BMl5BanBnXkFtZTcwMDkwNzYxMQ@@._V1.jpg","countries":["Hong Kong"],"languages":["Cantonese","English"],"genres":["Action","Comedy","Crime","Romance"],"plot":"Cousins Thomas and David, owners of a mobile restaurant, team up with their friend Moby, a bumbling private detective, to save the beautiful Sylvia, a pickpocket. Action and humor abound in the streets of Barcelona, culminating with a battle in the castle hideout of the evil gang.","simplePlot":"Cousins Thomas and David, owners of a mobile restaurant, team up with their friend Moby, a bumbling private detective, to save the beautiful Sylvia, a pickpocket. Action and humor abound in... ","actors":[{"actorName":"Jackie Chan","urlProfile":"http://www.imdb.com/name/nm0000329","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MDM0MDUzM15BMl5BanBnXkFtZTcwOTI4MzU1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 April 1954","placeOfBirth":" Victoria Peak, Hong Kong","birthName":"Kong-sang Chan","height":"5' 8½\" (1.74 m)","bio":"Hong Kong's cheeky, lovable and best known film star, Jackie Chan endured many years of long, hard work and multiple injuries to establish international success via his early beginnings in Hong Kong's manic martial arts cinema industry. Jackie was born Kong-sang Chan on Hong Kong's famous Victoria Peak on April 7, 1954, to Charles and Lee-Lee Chan, and the family emigrated to Canberra, Australia, in early 1960. The young Jackie was less than successful scholastically, so his father sent him back to Hong Kong to attend the rigorous China Drama Academy, one of the Peking Opera schools. Chan excelled at acrobatics, singing and martial arts and eventually became a member of the \"Seven Little Fortunes\" performing troupe and began lifelong friendships with fellow martial artists / actors Sammo Kam-Bo Hung and Biao Yuen. Chan journeyed back and forth to visit his parents and work in Canberra, but eventually he made his way back to Hong Kong as his permanent home. In the early 1970s Chan commenced his movie career and interestingly appeared in very minor roles in two films starring then rising martial arts superstar Bruce Lee: The Chinese Connection (1972), aka \"Fist of Fury\" aka \"The Chinese Connection\", and the Warner Bros. production Opération dragon (1973). Not long after Lee's untimely death Chan was often cast in films cashing in on the success of Bruce Lee by utilizing words like \"fist\", \"fury\" or \"dragon\" in their US release titles. Chan's own film career was off and running and he swiftly appeared in many low-budget martial arts films that were churned out at a rapid fire pace by Hong Kong studios eager to satisfy the early 1970s boom in martial-arts cinema. He starred in Shaolin Wooden Men (1976) (aka \"Shaolin Wooden Men\"), Jian hua yan yu jiang nan (1977) (aka \"To Kill With Intrigue\"), Le protecteur (1978) (aka \"Half A Loaf of Kung Fu\") and Fei du juan yun shan (1978) (aka \"Magnificent Bodyguards\"), which all fared reasonably well at the cinemas. However, he scored a major breakthrough with the hit Drunken Master (1978) (aka \"Drunken Master\"), which has become a cult favorite among martial arts film fans. Not too long after this, Chan made his directorial debut with La danse du lion (1980) (aka \"The Young Master\") and then \"Enter the Dragon\" producer Robert Clouse lured Jackie to the US for a film planned to break Jackie into the lucrative US market. Battle Creek Brawl (1980) (aka \"Battle Creek Brawl\") featured Jackie competing in a \"toughest street fighter\" contest set in 1940s Texas; however, Jackie was unhappy with the end result, and it failed to fire with US audiences. In a further attempt to get his name known in the US, Jackie was cast alongside Burt Reynolds, Roger Moore and Dean Martin in the Hal Needham-directed car chase flick The Cannonball Run (1981). Regrettably, Jackie was cast as a Japanese race driver and his martial arts skills are only shown in one small sequence near the film's conclusion. Stateside success was still a few years away for Jackie Chan! Undeterred, he returned to the Orient to do what he did best--make jaw-dropping action films loaded with amazing stunt work. Chan and his legendary stunt team were unparalleled in their ability to execute the most incredible fight scenes and action sequences, and the next decade would see some of their best work. Chan paired with the dynamic Sammo Hung Kam-Bo to star in Winners & Sinners (1983) (aka \"Winners & Sinners\"), Project A (1983) (aka \"Project \"A\"), Soif de justice (1984) (aka \"Wheels On Meals\"), Le flic de Hong Kong (1985) (aka \"Winners & Sinners 2\"), My Lucky Stars 2: Twinkle Twinkle Lucky Stars (1985) (aka \"My Lucky Stars 2\", aka \"Winners & Sinners 3\"(. Chan then journeyed back to the US for another shot at that market, starring alongside Danny Aiello in The Protector (1985),) filmed in Hong Kong and New York. However, as with previous attempts, Jackie felt the US director--in this case, James Glickenhaus--failed to understand his audience appeal and the film played to lukewarm reviews and box-office receipts. Jackie did, however, decide to \"harden\" up his on-screen image somewhat and his next film, Police Story (1985) (aka \"Police Story\") was a definite departure from previously light-hearted martial arts fare, and his fans loved the final product! This was quickly followed up with the Raiders of the Lost Ark (1981)-influenced Mister Dynamite (1986) (aka \"The Armour of God\"), during filming of which Jackie mistimed a leap from a wall to a tree on location in Yugoslavia and fell many quite a few feet onto his head, causing a skull fracture. It was another in a long line of injuries that Chan has suffered as a result of doing his own stunt work, and he was soon back in front of the cameras. Project A 2 (1987) (aka \"Project A: Part 2\"), Police Story 2 (1988) (aka \"Police Story 2\"), Miracles - Mr. Canton and Lady Rose (1989) (aka \"Mr. Canton and Lady Rose)\", Armour of God 2: Operation Condor (1991) (aka \"Armour of God 2\") and Police Story 3: Supercop (1992) (aka \"Police Story 3\") were all sizable hits for Jackie, escalating his status to phenomenal heights in Asia, and to his loyal fan base around the globe. US success was now just around the corner for the the hard-working Jackie Chan, and it arrived in the form of the action film Rumble in the Bronx (1995) (aka \"Rumble In The Bronx\", though it was actually filmed in Canada) that successfully blended humor and action to make a winning formula in US theaters. Jackie did not waste any time and went to work on Police Story 4: First Strike (1996) (aka \"Police Story 4\"), Mr. Nice Guy (1997) (aka \"Mr. Nice Guy\"), Who Am I? (1998) (aka \"Who Am I\"), which all met with positive results at the international box office. Jackie then went to work in the his biggest-budget US production, starring alongside fast-talking comedian Chris Tucker in the action / comedy Rush Hour (1998). The film was a bigger hit than \"Rumble In the Bronx\" and firmly established Jackie as a bona fide star in the US. Jackie then paired up with rising talent Owen Wilson to star in Shanghai Noon (2000) and its sequel, Shanghai Knights (2003), and re-teamed with Tucker in Rush Hour 2 (2001), as well as starring in The Tuxedo (2002), Le médaillon (2003) and the delightful Around the World in 80 Days (2004). Not one to forget his loyal fan base, Jackie returned to more gritty and traditional fare with New Police Story (2004) (aka \"New Police Story\") and The Myth (2005) (aka \"The Myth\"). The multi-talented Chan (he's also a major recording star in Asia) shows no sign of slowing down and has long since moved out of the shadow of Bruce Lee, to whom he was usually compared early in his career. Chan is truly one of the international film industry's true maverick actor / director / stuntman / producer combinations - he has done it the hard way, and always his way to achieve his dreams and goals to be an international cinematic star. Off screen he has been directly involved in many philanthropic ventures providing financial assistance to schools and universities around the world. He is a UNICEF GoodWill Ambassador, and he has campaigned against animal abuse and pollution and assisted with disaster relief efforts to the 2004 Indian Ocean Tsunami victims.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MDM0MDUzM15BMl5BanBnXkFtZTcwOTI4MzU1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000329","name":"Jackie Chan","nicknames":["Y'uen Lo","Sing Lung","Pao Pao","Kung-Fu Master"],"idIMDB":"nm0000329"},"actorId":"nm0000329","character":"Thomas","urlCharacter":"http://www.imdb.com/character/ch0126025","main":true},{"actorName":"Biao Yuen","urlProfile":"http://www.imdb.com/name/nm0950707","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWMyNmQ2YzMtNTVlZC00OTI4LTg3YTUtYmUyODM3NTI1NDhkXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1957","placeOfBirth":" Hong Kong","birthName":"Hsia Ling-Jun","height":"5' 6¼\" (1.68 m)","bio":"Yuen Biao is regarded as one of the most acrobatic martial artists ever. Unfortunately, he is still underrated and not as popular as other contemporaries such as Jackie Chan, Sammo Kam-Bo Hung, and Jet Li even though he is the most critically acclaimed out of all of them and the most talented as well. And now he is receiving a cult following due to word of mouth. Born of his parents Ha Kwong-Tai (father) and Ha Sau-Ying. Yuen Biao was first enrolled in the China Drama Academy at the age of 5 (he was the youngest there). He met Sammo Kam-Bo Hung and Jackie Chan while attending the Academy. Jackie Chan took him under his wing, and they became lifelong friends. Yuen Biao stayed at the Academy until the age of 16 where he moved with Master Jim-Yuen to America. However, two years later he came back, citing there were no opportunities for Chinese martial artists to star in American films. After being in some bit part roles in films such as Stoner (1974) (aka Stoner), Shing le fantastique Mandchou (1976) (aka Hand of Death), he didn't receive his first major breakthrough role until Sammo Kam-Bo Hung cast him in Knockabout (1979) (aka Knockabout). However, his first role which gave him full exposure and established his status as a A-list star was The Prodigal Son (1981) (aka The Prodigal Son), which also starred and was directed by Sammo Kam-Bo Hung. After that, 'Jackie Chan' cast him in the classic Project A (1983) (aka Project A). After starring in some other films with Sammo Kam-Bo Hung and/or Jackie Chan, he decided to go his own way and to forge his own career to get out of the shadows of Jackie Chan and Sammo Kam-Bo Hung. He met his future wife DiDi Phang Sau-Ha in 1984 while working as a stunt coordinator on the film DiDi Phang was working on: Tai fong siu sau (1982) (aka Carry On Pickpocket). They have two children. His daughter Yi-Bui was born in 1986 and his son Ming-Tsak in 1988. The film On the Run (1988) (aka On The Run) confirmed his abilities as a brilliant actor as his portrayal as a married man seeking vengeance for his wife's brutal murder was critically acclaimed. The following year he starred in probably his best film, The Iceman Cometh (1989) (aka The Iceman Cometh), in which he starred with acclaimed actress Maggie Cheung. The film is regarded as a cult classic and is remembered not only for the fantastic fighting scenes and hilarious comedy, but also the wonderful acting of Biao Yuen and Maggie Cheung and the wonderful simmering sexual chemistry between them. After starring in the acclaimed Once Upon a Time in China (1991) (aka Once Upon a Time in China, in which most of his scenes were cut), he directed his first movie (Xi Zang xiao zi (1992). aka A Kid From Tibet), in which he also starred. In 1994, he worked for the first time in years, with Sammo Kam-Bo Hung in the gloriously titled Mou mian bei (1995) (aka Don't Give a Damn). In recent years, Yuen Biao has complained of poor scripts, so he appears in films sparsely nowadays. He also has a second home in Canada where he spends most of time pursuing his hobby of golf.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWMyNmQ2YzMtNTVlZC00OTI4LTg3YTUtYmUyODM3NTI1NDhkXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0950707","name":"Biao Yuen","nicknames":["Little Brother"],"idIMDB":"nm0950707"},"actorId":"nm0950707","character":"David","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sammo Kam-Bo Hung","urlProfile":"http://www.imdb.com/name/nm0005033","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMTM3MzM4MzVeQTJeQWpwZ15BbWU3MDIzNjM3NzQ@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1952","placeOfBirth":" Hong Kong, British Crown Colony","birthName":"Hung Kam-Bo","height":"5' 7\" (1.7 m)","bio":"Born in Hong Kong, Sammo Hung's acting career began while he was training in acrobatics, martial arts and dance as a child at the China Drama Academy, and he received acclaim for his performance with a troupe called \"The Seven Little Fortunes.\" He made his feature film debut as an actor at the age of 12, and has worked in numerous martial arts films as an actor, director, producer and/or choreographer, collaborating with Bruce Lee and Jackie Chan, two superstars of the genre. He is now internationally renowned as a pioneer and trend-setter in Hong Kong action films. Hung's big break as a film actor came with a role as a sparring partner in the Bruce Lee film Opération dragon (1973). He established his reputation as a skilled physical comedian in several kung-fu comedies, beginning with \"Enter the Fat Dragon\" (Enter the Fat Dragon (1978)). He also produced and starred in numerous successful films throughout the 1970s and 1980s for Hong Kong's leading film studio, Golden Harvest. Hung collaborated in the 1980s with long-time friend Jackie Chan in a highly successful series of action comedies that cemented Hung's reputation as a consummate actor/director and launched Chan's career as an international star. For a while, Hung also starred in an American TV series, Martial Law (1998). He directed Once Upon a Time in China and America (1997), his first film shot in the US. He and his wife, Mina, now divide their time between homes in Hong Kong and Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMTM3MzM4MzVeQTJeQWpwZ15BbWU3MDIzNjM3NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005033","name":"Sammo Kam-Bo Hung","nicknames":["Yuen Chu","Big Brother"],"idIMDB":"nm0005033"},"actorId":"nm0005033","character":"Moby","urlCharacter":"http://www.imdb.com/character/ch0128244","main":true},{"actorName":"Benny Urquidez","urlProfile":"http://www.imdb.com/name/nm0882054","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg1OTE0MTYwOF5BMl5BanBnXkFtZTcwMDIzMzAyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1952","placeOfBirth":" Tarzana, California, USA","birthName":"Benjamin Gilbert Urquidez","bio":"Benny Urquidez was raised in a very athletic family. His mother was a professional wrestler and his father a professional boxer, with all of his siblings black belts. He has earned black belts in nine different martial arts and trained in other styles. The Jet decided to pursue full-contact karate as a career in 1974. He achieved a record of over 200 wins and no losses, with 63 title defenses and 57 KOs. He is the only fighter to have retained six world titles in five weight divisions for 24 consecutive years. Returning to the ring in 1993 at age 42, he beat defending champ Yoshihisa Tagami, 25, of Japan for the world light middle weight championship. Now retired, the Jet devotes his time to his acting and movie career. His specialty is training actors for fight scenes. He is also a martial arts instructor who has written four instructional books and has released eight instructional videos. His own unique martial art is called Ukidokan, which means \"way of life\" and the Jet Center is located in north Hollywood, CA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg1OTE0MTYwOF5BMl5BanBnXkFtZTcwMDIzMzAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0882054","name":"Benny Urquidez","nicknames":["The Jet"],"idIMDB":"nm0882054"},"actorId":"nm0882054","character":"Mondale's Henchman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Keith Vitali","urlProfile":"http://www.imdb.com/name/nm0899918","urlPhoto":"","biography":{"bio":"Started his martial arts career at the University Of South Carolina in 1971 and in only two years, earned his 1st degree Black Belt. Competed in regional tournaments and major events throughout the world. Was World Karate Champion and US National Karate Champion for 3 consecutive years. (1978-1980). Began his film career in \"Force Five\" then \"Revenge Of The Ninja\". Keith co-starred with Jackie Chan in \"Meals On Wheels\", starred in \"No Retreat, No Surrender 3\", \"American Kickboxer\", \"Superfights\".","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0899918","name":"Keith Vitali","idIMDB":"nm0899918"},"actorId":"nm0899918","character":"Mondale's Henchman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Herb Edelman","urlProfile":"http://www.imdb.com/name/nm0248983","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0MTM1MTEwMTheQTJeQWpwZ15BbWU3MDE3Njg1MTg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1933","placeOfBirth":" Brooklyn, New York, USA","birthName":"Herbert Edelman","height":"6' 5\" (1.96 m)","bio":"Herb Edelman was born on November 5, 1933 in Brooklyn, New York, USA as Herbert Edelman. He was an actor and assistant director, known for The Odd Couple (1968), The Good Guys (1968) and Barefoot in the Park (1967). He was married to Louise Sorel and Marylin Cosgrove. He died on July 21, 1996 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0MTM1MTEwMTheQTJeQWpwZ15BbWU3MDE3Njg1MTg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0248983","name":"Herb Edelman","idIMDB":"nm0248983"},"actorId":"nm0248983","character":"Matt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lola Forner","urlProfile":"http://www.imdb.com/name/nm0286499","urlPhoto":"","biography":{"dateOfBirth":"6 June 1960","placeOfBirth":" Alicante, Spain","birthName":"María Dolores Forner","height":"5' 6\" (1.68 m)","bio":"Lola Forner was born on June 6, 1960 in Alicante, Spain as María Dolores Forner. She is an actress, known for Mister Dynamite (1986), Soif de justice (1984) and Shouts of Anxiety (1984).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0286499","name":"Lola Forner","idIMDB":"nm0286499"},"actorId":"nm0286499","character":"Sylvia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Susana Sentís","urlProfile":"http://www.imdb.com/name/nm0784555","urlPhoto":"","biography":{"bio":"Susana Sentís is an actress, known for Soif de justice (1984), Perras callejeras (1985) and La ràdio folla (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0784555","name":"Susana Sentís","idIMDB":"nm0784555"},"actorId":"nm0784555","character":"Gloria","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"José Sancho","urlProfile":"http://www.imdb.com/name/nm0761103","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk5ZDk2ZDMtZTVhZi00NzIyLTgyZDEtZThjN2Q4NWQzNWVjXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 November 1944","placeOfBirth":" Manises, Valencia, Comunidad Valenciana, Spain","birthName":"José Asunción Martínez Sancho","height":"5' 7¼\" (1.71 m)","bio":"José Sancho was born on November 11, 1944 in Manises, Valencia, Comunidad Valenciana, Spain as José Asunción Martínez Sancho. He was an actor, known for Cuéntame (2001), Live Flesh (1997) and Talk to Her (2002). He was married to Reyes Monforte and María Jiménez. He died on March 3, 2013 in Valencia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk5ZDk2ZDMtZTVhZi00NzIyLTgyZDEtZThjN2Q4NWQzNWVjXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0761103","name":"José Sancho","idIMDB":"nm0761103"},"actorId":"nm0761103","character":"Mondale","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Miguel Palenzuela","urlProfile":"http://www.imdb.com/name/nm0370717","urlPhoto":"","biography":{"bio":"Miguel Palenzuela is an actor, known for Open Your Eyes (1997), Soif de justice (1984) and Tierra (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0370717","name":"Miguel Palenzuela","idIMDB":"nm0370717"},"actorId":"nm0370717","character":"The Butler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Josep Lluís Fonoll","urlProfile":"http://www.imdb.com/name/nm0284631","urlPhoto":"","biography":{"dateOfBirth":"1946","placeOfBirth":" Barcelona, Catalonia, Spain","bio":"Josep Lluís Fonoll was born in 1946 in Barcelona, Catalonia, Spain. He was an actor, known for Soif de justice (1984), Hell of the Living Dead (1980) and Un jour sans soleil (1998). He died on October 5, 2011 in Barcelona, Cataluña, Spain.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0284631","name":"Josep Lluís Fonoll","idIMDB":"nm0284631"},"actorId":"nm0284631","character":"Dino","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Amparo Moreno","urlProfile":"http://www.imdb.com/name/nm0603868","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjcxOWRmODYtYzE3NS00MDc5LTg1MjAtYWI2NzMxMmM1OGIxXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 July 1949","placeOfBirth":" L'Hospitalet de Llobregat, Barcelona, Catalonia, Spain","bio":"Amparo Moreno was born on July 24, 1949 in L'Hospitalet de Llobregat, Barcelona, Catalonia, Spain. She is an actress, known for El cor de la ciutat (2000), The Life of David Gale (2003) and Soif de justice (1984).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjcxOWRmODYtYzE3NS00MDc5LTg1MjAtYWI2NzMxMmM1OGIxXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0603868","name":"Amparo Moreno","idIMDB":"nm0603868"},"actorId":"nm0603868","character":"Susana","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Montserrat Julió","urlProfile":"http://www.imdb.com/name/nm0432314","urlPhoto":"","biography":{"dateOfBirth":"1929","placeOfBirth":" Mataró, Barcelona, Catalonia, Spain","birthName":"Montserrat Julió i Nonell","bio":"Montserrat Julió was born in 1929 in Mataró, Barcelona, Catalonia, Spain as Montserrat Julió i Nonell. She was an actress and writer, known for Soif de justice (1984), Robin and Marian (1976) and The Blood Spattered Bride (1972). She died on January 26, 2017 in Madrid, Spain.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0432314","name":"Montserrat Julió","idIMDB":"nm0432314"},"actorId":"nm0432314","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Luis Monte","urlProfile":"http://www.imdb.com/name/nm1107032","urlPhoto":"","biography":{"bio":"Luis Monte is an actor, known for Soif de justice (1984).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1107032","name":"Luis Monte","idIMDB":"nm1107032"},"actorId":"nm1107032","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Josep L. Dallester","urlProfile":"http://www.imdb.com/name/nm1104945","urlPhoto":"","biography":{"bio":"Josep L. Dallester is an actor, known for Soif de justice (1984).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1104945","name":"Josep L. Dallester","idIMDB":"nm1104945"},"actorId":"nm1104945","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0087578","urlIMDB":"http://www.imdb.com/title/tt0087578","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"HKD 21,465,013","country":"Hong","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 38 min (98 min) (Spain)","1 hr 40 min (100 min) (USA)","1 hr 48 min (108 min) (Hong Kong)","1 hr 44 min (104 min) (video) (West Germany)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.2","filmingLocations":[{"location":"Barcelona, Catalonia, Spain"}],"rated":"TV-14","awards":[{"award":"Hong Kong Film Awards 1985","titlesAwards":[{"titleAwardOutcome":"Nominated Hong Kong Film Award","categories":[{"category":"Best Action Choreography","names":[]}]}]}],"votes":"8,593","type":"Movie","companyCreditsSimple":[{"idCompany":"co0015592","name":"Golden Harvest Company"},{"idCompany":"co0080682","name":"Laurenfilm"}],"keywords":{"keywords":["castle","detective","hand to hand combat","parkour","acrobat","acrobatics","pistol","gunfight","shootout","showdown","sword","stylized violence","violence","fistfight","brawl","kung fu classic","kung fu master","kung fu fighting","chop socky","warrior","tough guy","three man army","buddy cop","buddy movie","rescue mission","rescue","damsel in distress","rapier","fencing","physical comedy","action hero","hero","grappling hook","falling into water","male hits a female","jumping out a window","car chase","drinking","mental patient","mental hospital","stolen money","food vendor","suspicious wife","van","slapstick comedy","chinese","chinaman","inheritance","rome italy","thief","chase","biker","sword fight","skateboard","italy","martial arts"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:14:33"}}