{"data":{"movies":[{"title":"Coal Miner's Daughter","originalTitle":"","year":"1980","releaseDate":"19800307","directors":[{"name":"Michael Apted","id":"nm0000776"}],"writers":[{"name":"Thomas Rickman","id":"nm0725564"},{"name":"Loretta Lynn","id":"nm0528750"}],"runtime":"124 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMjUxNTczNV5BMl5BanBnXkFtZTgwNjg2MDM0MDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Biography","Drama","Music","Musical"],"plot":"At only thirteen years of age, Loretta Webb marries Doolittle Lynn and is soon responsible for a sizeable family. Loretta appears destined to a life of homemaking, but Doolittle recognises his wife's musical talent, and buys her a guitar as an anniversary present one year. At eighteen, the mother of four children and busy housewife still finds time to write and sing songs at small fairs and local honky-tonks. This gift sets on the gruelling, tumultuous path to superstardom and country music greatness.","simplePlot":"Biographical story of , a legendary country singer that came from poverty to worldwide fame. She rose from humble beginnings in Kentucky to superstardom and changing the sound and style of country music forever.","actors":[{"actorName":"Sissy Spacek","urlProfile":"http://www.imdb.com/name/nm0000651","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAwMTU4NTMwMF5BMl5BanBnXkFtZTgwMDMyMTg4MTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1949","placeOfBirth":" Quitman, Texas, USA","birthName":"Mary Elizabeth Spacek","height":"5' 3\" (1.6 m)","bio":"As a kid, Sissy Spacek climbed trees, rode horses, swam, and played in the woods. She was born Mary Elizabeth Spacek on December 25, 1949, in Quitman, Texas, to Virginia Frances (Spilman) and Edwin Arnold Spacek, Sr., a county agricultural agent. Her father's family was of Czech and German origin. Sissy attended Quitman High School and was homecoming queen. After graduating, she embarked on an acting career, gaining interest in the profession through her cousin, actor Rip Torn. Sissy relocated to New York, and through him, enrolled in the New York branch of the Actors Studio. She studied acting at the Lee Strasberg Institute while also pursuing work as a model and singer, appearing in West Village showcases such as the Bitter End for $10 a night. Sissy eventually broke into film and one of her first roles was as Holly in the classic Badlands (1973). The art director on that film was Jack Fisk, with whom she would marry in 1974 and ultimately collaborate on eight films. Sissy followed this landmark film with a star-making and Oscar nominated performance in Carrie (1976), in which she played a humiliated prom queen who goes postal with her telekinesis. Sissy has had an enduring and award winning career in movies and television, which includes an Oscar as Best Actress for Coal Miner's Daughter (1980). The parents of two grown daughters, Sissy and Jack live on a large horse ranch in the foothills of Virginia's Blue Ridge Mountains. Even though she continued to appear in film and television during the late 1980s and 1990s, Sissy devoted most of those years to her family. Then, in 2001, Sissy returned to the big screen in a major way with a powerful performance in In the Bedroom (2001), which not only earned her a sixth Best Actress Oscar nomination, but a win for Best Actress at the Golden Globes, Independent Spirit Awards, and numerous critics association awards. Sissy continues to work steadily as an actress, but in 2012, her credits expanded even further to include a memoir, My Extraordinary Ordinary Life, as well as planning her directorial debut on the in-development film Sweet Tea.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAwMTU4NTMwMF5BMl5BanBnXkFtZTgwMDMyMTg4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000651","name":"Sissy Spacek","idIMDB":"nm0000651"},"actorId":"nm0000651","character":"Loretta Lynn","urlCharacter":"http://www.imdb.com/character/ch0040117","main":true},{"actorName":"Tommy Lee Jones","urlProfile":"http://www.imdb.com/name/nm0000169","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNjc4MDc0OV5BMl5BanBnXkFtZTcwOTc5OTUwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1946","placeOfBirth":" San Saba, Texas, USA","height":"6' (1.83 m)","bio":"Tommy Lee Jones was born in San Saba, Texas, the son of Lucille Marie (Scott), a police officer and beauty shop owner, and Clyde C. Jones, who worked on oil fields. Tommy himself worked in underwater construction and on an oil rig. He attended St. Mark's School of Texas, a prestigious prep school for boys in Dallas, on a scholarship, and went to Harvard on another scholarship. He roomed with future Vice President Al Gore and played offensive guard in the famous 29-29 Harvard-Yale football game of '68 known as \"The Tie.\" He received a B.A. in English literature and graduated cum laude from Harvard in 1969. Following college, he moved to New York and began his theatrical career on Broadway in \"A Patriot for Me\" (1969). In 1970, he made his film debut in Love Story (1970). While living in New York, he continued to appear in various plays, both on- and off-Broadway: \"Fortune and Men's Eyes\" (1969); \"Four on a Garden\" (1971); \"Blue Boys\" (1972); \"Ulysses in Nighttown\" (1974). During this time, he also appeared on a daytime soap opera, One Life to Live (1968) as Dr. Mark Toland from 1971-75. He moved with wife Kate Lardner, granddaughter of short-story writer/columnist Ring Lardner, and her two children from a previous marriage, to Los Angeles. There he began to get some roles on television: Charlie's Angels (1976) (pilot episode); Smash-Up on Interstate 5 (1976); and The Amazing Howard Hughes (1977). While working on the movie Back Roads (1981), he met and fell in love with Kimberlea Cloughley, whom he later married. More roles in television--both on network and cable--stage and film garnered him a reputation as a strong, explosive, thoughtful actor who could handle supporting as well as leading roles. He made his directorial debut in The Good Old Boys (1995) on TNT. In addition to directing and starring in the film, he co-wrote the teleplay (with J.T. Allen). The film, based on Elmer Kelton's novel, is set in west Texas where Jones has strong family ties. Consequently, this story of a cowboy facing the end of an era has special meaning for him.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNjc4MDc0OV5BMl5BanBnXkFtZTcwOTc5OTUwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000169","name":"Tommy Lee Jones","nicknames":["TLJ","Tom"],"idIMDB":"nm0000169"},"actorId":"nm0000169","character":"Doolittle Lynn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Levon Helm","urlProfile":"http://www.imdb.com/name/nm0375629","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MjgyODc1NV5BMl5BanBnXkFtZTcwMDk5MzIyMw@@._V1_UY44_CR32,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1940","placeOfBirth":" Elaine, Arkansas, USA","birthName":"Mark Lavon Helm","height":"5' 8\" (1.73 m)","bio":"Levon Helm was in the right place at the right time. He saw the birth of rock and roll and, though he was too much of a gentleman to say it, his role in helping to keep that rebellious child healthy was more than just instrumental. On May 26, 1940, Mark Lavon Helm was the second of four children born to Nell and Diamond Helm in Elaine, Arkansas. Diamond was a cotton farmer who entertained occasionally as a musician. The Helms loved music and often sang together. They listened to The Grand Ole Opry and Sonny Boy Williamson and his King Biscuit Entertainers regularly on the radio. A favorite family pastime was attending traveling music shows in the area. According to his 1993 autobiography, \"This Wheel's On Fire\", Levon recalled seeing his first live show, Bill Monroe and his Blue Grass Boys, at six years old. His description: \"This really tattooed my brain. I've never forgotten it.\" Hearing performers like Monroe and Williamson on the radio was one thing; seeing them live made a huge impression. Levon's father bought him his first guitar at age nine. At ten and 11, whenever he wasn't in school or at work on the farm, the boy could be found at KFFA's broadcasting studio in Helena, Arkansas, watching Sonny Boy Williamson do his radio show, \"King Biscuit Time\". Helm made his younger sister Linda a string bass out of a washtub when he was 12 years old. She would play the bass while her brother slapped his thighs and played harmonica and guitar. They would sing songs learned at home and popular hits of the day, and billed themselves as \"Lavon and Linda.\" Because of their fresh-faced good looks, obvious musical talent and Levon's natural ability to win an audience with sheer personality and infectious rhythms, the pair consistently won talent contests along the Arkansas 4-H Club circuit. In 1954 Levon was 14 years old when he saw Johnny Cash and Carl Perkins do a show at Helena. Also performing was a young Elvis Presley, with Scotty Moore on guitar, and Bill Black on stand-up bass. They did not have a drummer. The music was early jazz-fueled rockabilly, and the audience went wild. In 1955 he saw Elvis once more, before Presley's star exploded. This time Presley had D.J. Fontana with him on drums and Black was playing electric bass. Helm couldn't get over the difference and thought it was the best band he'd seen. The added instruments gave the music solidity and depth. People jumped out of their seats dancing to the thunderous, heart-pumping rhythms. The melting pot that was the Mississippi Delta had boiled over and evolved. Its magnificently rich blues was uniting with all the powerful, new, spicy-hot sounds and textures that became rock and roll. Natural progression led Levon to form his own rock band as a high-school junior, called The Jungle Bush Beaters. While Little Richard and Jerry Lee Lewis were making teens everywhere crazed, Levon would practice, play, watch and learn. After seeing Jerry Lee's drummer Jimmy Van Eaton, he seriously began thinking of playing the drums himself. Around this same time the 17-year-old musician was invited by Conway Twitty to share the stage with Twitty and his Rock Housers. He had met Twitty when \"Lavon and Linda\" opened for him at a previous show. Helm was a personable, polite teen who took his music seriously, so Twitty allowed him to sit in whenever the opportunity arose. Ronnie Hawkins came into Levon Helm's life in 1957. A charismatic entertainer and front-man, Hawkins was gathering musicians to tour Canada, where the shows and money were steady. He had a sharp eye for talent. He needed a drummer and Levon fit the bill. Fulfilling a promise to Nell and Diamond to finish high school, Levon joined Ronnie and his \"Hawks\" on the road. The young Arkansas farm boy, once a tractor driving champion, found himself driving Hawkins' Cadillac to gigs, happily aware that all the unknown adventures of rock and roll would soon be his destiny. In 1959 Ronnie got The Hawks signed to Roulette Records. They had two hits, \"Forty Days\" and \"Mary Lou\", sold 750,000 copies and appeared on Dick Clark's New American Bandstand 1965 (1952). Hawkins and Helm recruited four more talented Canadian musicians in the early 1960s--Richard Manuel, Rick Danko, Garth Hudson and Robbie Robertson. Under Ronnie's tutelage they would often perform until midnight and rehearse until four in the morning. Other bands began emulating their style; now they were the ones to watch and learn from. Eventually the students surpassed their teacher. Weary of Ronnie's strict regulations and eager to expand their own musical interests, the five decided to break from Hawkins. They called themselves \"Levon and the Hawks.\" About 1965 Bob Dylan decided to change his sound. He was ready to \"go electric\" and wanted Levon and The Hawks to help him fire it up. The boys signed on to tour with Dylan, but unfortunately Dylan's die-hard folk fans resisted. Night after night of constant booing left Levon without the pleasure of seeing his audience enjoy themselves. He called his drummer's stool \"the best seat in the house,\" because he could see his fellow musicians and his audience simultaneously. What pleased him most, always, was that his audience had a good time. He temporarily left the group and eventually landed back home in Arkansas. Dylan and the rest of the band took up residence in Woodstock, NY. They rented a large, pink house where they wrote and rehearsed new material. Danko called for Helm to join them when Capitol Records gave them a recording contract. Woodstock residents called them \"the band,\" so they kept the moniker. The name The Band fit. The sound was no-frills rock-and-roll, but far from simplistic. They fused every musical influence they were exposed to over the years as individuals and as a unit. The result was brilliant. Their development as musicians was perfected by years of playing. Living together at \"Big Pink\" allowed complete collaboration of their artistic expression. Americana and folklore themes, heart-wrenching ballads filled with naked emotion, majestic harmonies, hard-driving rhythms and exquisite instrumentation made critics, peers and fans realize that this music was unlike any heard before. Their first album, \"Music from Big Pink\", released in July of 1968, made them household names, and as a result they were invited to appear on Ed Sullivan's The Ed Sullivan Show (1948) in autumn of '69. Following \"Big Pink\"'s success the next album, called simply \"The Band\", is considered by some as their masterpiece. They made seven albums total, including one live recording in 1972, \"Rock of Ages\". Many of their hits--such as \"The Weight\", \"W.S. Walcott's Medicine Show\" and \"The Night They Drove Old Dixie Down\"--were spawned from stories of Levon's beloved South. Helm was working in Los Angeles in 1974, at a Sunset Blvd. hotel, when he spotted a beautiful young brunette taking a dip in the pool. Her name was Sandra Dodd and when she looked up at him smiling, she didn't recognize him at first. The charming musician offered to take the lovely lady for sushi and never looked back. They were married on September 7, 1981, in Woodstock. The barn and studio Helm built in Woodstock, which became his permanent home, was just about complete in 1975. He invited Muddy Waters to his new studio and they recorded \"Muddy Waters in Woodstock\". To the delight of everyone involved, it won a Grammy. The Band held a farewell concert at Winterland in San Francisco on Thanksgiving 1976. It was a bittersweet time for many, who felt the group's demise was too soon. They called it \"The Last Waltz\", which included Ronnie Hawkins,Dr. John, Muddy Waters, Ringo Starr, Bob Dylan, Eric Clapton and an all-star guest list of peers and friends that read like the \"Who's Who\" of rock and roll. The event eventually sold as a triple album and was also filmed--The Last Waltz (1978) became the first historical \"rockumentary.\" Group members went on to individual pursuits. Levon cut his debut album, \"The RCO All-Stars\", in 1977. His next effort was the self-titled \"Levon Helm\", followed by \"American Son\", released in 1980. That same year was pivotal, as Helm turned his attention to acting. He played Loretta Lynn's father in Coal Miner's Daughter (1980), winning great reviews for his first film appearance. He did another self-titled album and Hollywood again came knocking in 1983, giving him a role in The Right Stuff (1983). The authenticity he brought to his characters earned him numerous movie roles from 1980 until 2009. Levon gave a sensitive, convincing portrayal of a destitute blind man in the 2005 Tommy Lee Jones vehicle, Three Burials (2005). In 2007 he filmed Shooter (2007) with Mark Wahlberg. His last role was in 2009. where he portrayed Confederate Gen. John Bell Hood in Dans la brume électrique (2009), again with his friend Tommy Lee Jones. Rick Danko and Levon reunited to play music after Danko had been living in California. Rick moved back to Woodstock and the friends did an acoustic tour in early 1983. In San Jose the following year, they received excellent reviews when Hudson and Manuel joined them for their first U.S. appearance as The Band since 1976. They continued playing together until the tragic death of their dear friend and comrade, the 42-year-old Manuel. During the 1990s three more Band albums were recorded: \"Jericho\", \"High on the Hog\" and \"Jubilation\". In 1998 Levon was diagnosed with throat cancer and the famous voice with the rich Southern nuances was silenced to a whisper. He still played the drums, mandolin and harmonica, often performing with his daughter, Amy Helm, also a vocalist and instrumentalist. A great emotional support to her father during this time, Amy appeared with him regularly at Levon Helm Studios. In 1999 Helm endured another tragic loss when Rick Danko passed away 19 days before his 56th birthday. His death marked the end of an era. Miraculously, Levon's voice slowly returned. He felt comfortable enough to sing again live. With imagination and vision, he conceived The Midnight Ramble Sessions, a series of live performances at Levon Helm Studios in Woodstock. Named for the traveling minstrel shows of his youth, the first Midnight Ramble was held in January, 2004. It featured one of the last performances by great blues pianist Johnnie Johnson. Friends old and new joined Levon on his stage, including Emmylou Harris, Dr. John, John Sebastian, Allen Toussaint, Elvis Costello, Phil Lesh, Jimmy Vivino, Hubert Sumlin, Little Sammy Davis, Billy Bob Thornton and The Boxmasters, The Muddy Waters Band, The Swell Season, Donald Fagen, Steve Jordon, Hot Tuna, Kris Kristofferson, The Black Crowes, Nitty Gritty Dirt Band, Norah Jones, The Bacon Brothers, Robbie Dupree, My Morning Jacket, Shemekia Copeland, The Wood Brothers, Steve Earle, Jackie Greene, Sam Bush, Brewer & Shipley, Carolyn Wonderland, Ollabelle and The Alexis P. Suter Band. The monthly Rambles at \"The Barn\" were wildly successful, drawing a worldwide audience. Releases produced by Levon Helm Studios from Helm's personal \"vault,\" were Volume I and II of \"The Midnight Ramble Sessions\", plus a live RCO All-Stars performance from New Year's Eve 1977, at the Palladium. The vitality and magnetism of these recordings speak for themselves. In September of 2007, Dirt Farmer Music and Vanguard Records released \"Dirt Farmer\", Levon's first solo, studio album in 25 years. A project particularly close to his heart, the CD contains music reminiscent of his past, and songs handed down from his parents. \"Dirt Farmer\" was awarded a Grammy for Best Traditional Folk Album in February 2008 and landed Levon a spot in Rolling Stone's The 100 Greatest Singers of All Time. That same year he was also recognized by the Recording Academy with a lifetime achievement award as an original member of The Band and was given the \"Artist of the Year\" Award by the Americana Music Association. In 2009 Levon released \"Electric Dirt\", which marked his highest debut in Soundscan era at #36 and spent six consecutive weeks at #1 on the Americana Radio Chart. He won a second Grammy for \"Electric Dirt\" in the inaugural category of Best Americana Album in 2010. In September 2008 Levon took \"The Midnight Ramble\" on the road to Nashville's historic Ryman Auditorium. Buddy Miller, John Hiatt, Sheryl Crow, George Receli, Sam Bush and Billy Bob Thornton helped The Levon Helm Band create an evening of unforgettable musical joy. \"Ramble at the Ryman - Live CD and DVD\" (sold individually) won him his third consecutive Grammy, again as Best Album in the Americana category, in February 2012. Sadly, Levon's cancer returned shortly after this last triumph. He passed away on April 19, 2012. His funeral was a tearful, joyful, musical celebration of his life. The intimacy of the shows performed at Levon's hearth offered a hospitality and warmth found in no other venue, not to mention the excellence of the performances themselves, hosted by a man whose gifts were truly legendary. Though always an enthusiastic and passionate performer, with sheer joy and gratitude, he effortlessly captivated his audience, young and old, with a rhythmic power all his own. During a career that spanned over five decades, Levon Helm nurtured a tradition of professionalism with a deep respect for his craft and remained refreshingly genuine in a world that often compromised integrity. He was a master storyteller who wove his tales with the magic thread of universality that ties us all. He beckoned us to come in, sit awhile and enjoy. We see ourselves in his stories and we are home. --Dawn LoBue Copyright © 2006 ~ 2012 All Rights Reserved.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MjgyODc1NV5BMl5BanBnXkFtZTcwMDk5MzIyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0375629","name":"Levon Helm","idIMDB":"nm0375629"},"actorId":"nm0375629","character":"Ted Webb","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Phyllis Boyens-Liptak","urlProfile":"http://www.imdb.com/name/nm0101992","urlPhoto":"","biography":{"bio":"Phyllis Boyens-Liptak was an actress, known for Coal Miner's Daughter (1980), Guncrazy (1992) and Harlan County U.S.A. (1976). She died on December 9, 2009.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0101992","name":"Phyllis Boyens-Liptak","idIMDB":"nm0101992"},"actorId":"nm0101992","character":"'Clary' Webb","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Anderson Jr.","urlProfile":"http://www.imdb.com/name/nm0026286","urlPhoto":"","biography":{"bio":"Bill Anderson Jr. is an actor, known for Coal Miner's Daughter (1980).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0026286","name":"Bill Anderson Jr.","idIMDB":"nm0026286"},"actorId":"nm0026286","character":"Webb Child","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Foister Dickerson","urlProfile":"http://www.imdb.com/name/nm0225417","urlPhoto":"","biography":{"bio":"Foister Dickerson is an actor, known for Coal Miner's Daughter (1980).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0225417","name":"Foister Dickerson","idIMDB":"nm0225417"},"actorId":"nm0225417","character":"Webb Child","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Malla McCown","urlProfile":"http://www.imdb.com/name/nm0566685","urlPhoto":"","biography":{"bio":"Malla McCown is an actress, known for Coal Miner's Daughter (1980).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0566685","name":"Malla McCown","idIMDB":"nm0566685"},"actorId":"nm0566685","character":"Webb Child","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pamela McCown","urlProfile":"http://www.imdb.com/name/nm0566687","urlPhoto":"","biography":{"bio":"Pamela McCown is an actress, known for Coal Miner's Daughter (1980).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0566687","name":"Pamela McCown","idIMDB":"nm0566687"},"actorId":"nm0566687","character":"Webb Child","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kevin Salvilla","urlProfile":"http://www.imdb.com/name/nm0759467","urlPhoto":"","biography":{"bio":"Kevin Salvilla is an actor, known for Coal Miner's Daughter (1980).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0759467","name":"Kevin Salvilla","idIMDB":"nm0759467"},"actorId":"nm0759467","character":"Webb Child","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Sanderson","urlProfile":"http://www.imdb.com/name/nm0761836","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NjIxMjMwN15BMl5BanBnXkFtZTcwMDk1NzgzOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 January 1944","placeOfBirth":" Memphis, Tennessee, USA","height":"5' 8\" (1.73 m)","bio":"Prolific and versatile character actor William Sanderson was born on January 10, 1944, in Memphis, Tennessee. His mother was an elementary school teacher and his father was a landscape designer. William served two years in the US Army. Following his military service he attended Southern Methodist University. He earned both a BBA degree and a JD law degree from Memphis State University. William went to New York to try his luck as an actor. He studied his craft with Herbert Berghof and William Hickey. Sanderson began his acting career in off-Broadway stage productions and appeared in several independent pictures. He gave a superbly lively and intense performance as vicious racist and escaped convict Jessie Lee Kane in the brutal exploitation feature Fight for Your Life (1977). William was likewise marvelous as gentle toymaker J.F. Sebastian in the fantastic science-fiction cult favorite Blade Runner (1982). He has played his fair share of loathsome bad guys (he refers to these particular characters as \"prairie scum\"), such as nasty lout Calvin in Raggedy Man (1981), lowlife hick Lee Dollarhide in Coal Miner's Daughter (1980) and weaselly criminal Snow in Lone Wolf McQuade (1983). Not surprisingly, considering his distinctive Southern drawl, he has also appeared in such westerns as the comedy Wagons East (1994), Crossfire Trail (2001), Monte Walsh (2003), Andersonville (1996), Gods and Generals (2003) and the acclaimed TV mini-series Lonesome Dove (1989) (one of several projects in which Sanderson has acted alongside Tommy Lee Jones). Sanderson gave a lovely and touching portrayal in a rare lead role as emotionally dysfunctional recovering alcoholic ukulele minstrel Stanley Myer in the poignant indie drama Stanley's Gig (2000). He achieved his greatest popularity, however, as flaky backwoodsman Larry on the hit sitcom Newhart (1982) on which he uttered the memorable catchphrase, \"I'm Larry. This is my brother Darryl and this is my other brother Darryl.\" More recently Sanderson had a terrific role as conniving hotel proprietor E.B. Farnum on the sensationally gritty cable western TV series Deadwood (2004). Among the TV shows William has done guest spots on are The Practice (1997), The Pretender (1996), ER (1994), The X-Files (1993), Walker, Texas Ranger (1993), Les anges de la ville (1993), Matlock (1986), Babylon 5 (1994), Married with Children (1987), The Twilight Zone (1985), Knight Rider (1982), Coach (1989), The Dukes of Hazzard (1979) and Starsky and Hutch (1975). He has also done voices for numerous cartoon characters, radio commercials and books on tape. Outside of his substantial film and TV credits, William has acted on stage in productions of such plays as \"The Taming of the Shrew,\" \"When Ya Comin' Back, Red Ryder?,\" \"Insect Comedy,\" \"To Kill a Mockingbird,\" \"Dutchman,\" \"Fishing,\" \"Authentic Life of Billy the Kid,\" \"Tobacco Road,\" and \"Scotch Rocks.\" William Sanderson lives in Burbank, California, with his wife Sharon Wix.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NjIxMjMwN15BMl5BanBnXkFtZTcwMDk1NzgzOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0761836","name":"William Sanderson","nicknames":["Bill"],"idIMDB":"nm0761836"},"actorId":"nm0761836","character":"Lee Dollarhide","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sissy Lucas","urlProfile":"http://www.imdb.com/name/nm0524282","urlPhoto":"","biography":{"bio":"Sissy Lucas is an actress, known for Coal Miner's Daughter (1980).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0524282","name":"Sissy Lucas","idIMDB":"nm0524282"},"actorId":"nm0524282","character":"Betty Sue Lynn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pat Patterson","urlProfile":"http://www.imdb.com/name/nm0666338","urlPhoto":"","biography":{"bio":"Pat Patterson is an actor, known for Coal Miner's Daughter (1980), Whodunit? (1986) and Seeing Things (1981).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0666338","name":"Pat Patterson","idIMDB":"nm0666338"},"actorId":"nm0666338","character":"Jack Benny Lynn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian Warf","urlProfile":"http://www.imdb.com/name/nm0912184","urlPhoto":"","biography":{"dateOfBirth":"31 August 1973","placeOfBirth":" Pikeville, Kentucky, USA","bio":"Brian Warf was born on August 31, 1973 in Pikeville, Kentucky, USA. He is an actor, known for Coal Miner's Daughter (1980) and The Wilgus Stories (2000). He has been married to Kathleen Byrne since May 30, 2006. They have one child.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0912184","name":"Brian Warf","idIMDB":"nm0912184"},"actorId":"nm0912184","character":"Ernest Ray Lynn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elizabeth Watson","urlProfile":"http://www.imdb.com/name/nm2071142","urlPhoto":"","biography":{"bio":"Elizabeth Watson is an actress, known for Coal Miner's Daughter (1980).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2071142","name":"Elizabeth Watson","idIMDB":"nm2071142"},"actorId":"nm2071142","character":"Cissy Lynn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Beverly D'Angelo","urlProfile":"http://www.imdb.com/name/nm0000350","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNTk4ODU5NV5BMl5BanBnXkFtZTcwODU0OTgwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 November 1951","placeOfBirth":" Columbus, Ohio, USA","birthName":"Beverly Heather D'Angelo","height":"5' 2\" (1.57 m)","bio":"Intriguing, inspiring, and never less than interesting -- key adjectives in describing the career of Beverly D'Angelo, which has well passed the three-decade mark. Perhaps deserving better movies than she generally found herself in, she nevertheless was always an object of fascination and the one to watch...whatever the role. Hardly the shrinking violet type, Hollywood counted on her for her colorful personality, down-to-earth demeanor and scene-stealing capabilities. Beverly Heather D'Angelo was born on November 15, 1951 in Columbus, Ohio, the daughter of musicians Priscilla Ruth (Smith), a violinist, and Eugene \"Gene\" Constantino D'Angelo, a bass player who also managed a TV station. her maternal grandfather, Howard Dwight Smith, was the architect who designed the Ohio (\"Horseshoe\") Stadium at Ohio State University. Her mother had English, Irish, Scottish, and German ancestry, and her father was of Italian descent. Beverly once attended an American school in Florence, Italy. Initially drawn to art, Beverly worked as a animator/cartoonist at Hanna-Barbera Productions before moving to Canada to pursue a rock singing career, To make ends meet she worked as a session vocalist and sang anyplace she could -- from coffeehouses to topless bars. At one point the teenager was invited to join up with rockabilly legend Ronnie Hawkins. Beverly's acting career started up when she left the Hawkins band and joined the Charlottetown Festival repertory company. She was touring Canada as Ophelia in \"Kronborg: 1582\", a rock musical version of Shakespeare's \"Hamlet\" when the renowned Colleen Dewhurst caught a performance and saw promise in both Beverly and the show. Eventually musical director Gower Champion got into the mix and the show was completely revamped, becoming the rock musical \"Rockabye Hamlet\", which made its way to Broadway in 1976. While the show itself was short-lived, Beverly's Ophelia attracted fine notices and she soon found herself on the West coast with film and TV opportunities. After this point, she seldom returned to the stage but did star alongside Ed Harris in the 1995 off-Broadway production of Sam Shepard's \"Simpatico\", which earned her a Theatre World Award. A role in the TV miniseries Captains and the Kings (1976) led to bit parts in The Sentinel (1977) and in the Woody Allen classic Annie Hall (1977). A string of co-starring roles followed with First Love (1977), the Clint Eastwood starrer Every Which Way But Loose (1978) and the film adaptation of the hit counterculture musical Hair (1979). Best of all for Beverly was her powerhouse featured performance as the one-and-only Patsy Cline in the acclaimed biopic Coal Miner's Daughter (1980). Both she and Oscar winner Sissy Spacek (as fellow country singer Loretta Lynn) expertly supplied their own vocals. Playing everything from tough-as-nails prostitutes, party girls and barflies to rich, prim widows and depressed, alcoholic moms, most of Beverly's output was solid during this time. Playing happening kind of gals, she customarily rose above much of the standard comedic or dramatic material given. An interesting gallery of offbeat characters came her way in a number of hit-or-miss features: Paternity (1981), Finders Keepers (1984), Big Trouble (1986), Maid to Order (1987), High Spirits (1988), Cold Front (1989), Daddy's Dyin'... Who's Got the Will? (1990), The Pope Must Diet (1991), Man Trouble (1992), Lightning Jack (1994), The Crazysitter (1994), Merchants of Venus (1998) and Sugar Town (1999). She also sang in a few of these films. Beverly attracted mainstream notice as Chevy Chase's beleaguered wife in the comedy spoof National Lampoon's Vacation (1983) and its three sequels. Stronger roles came with such films as the English/Irish production The Miracle (1991) and the Neo-Nazi film American History X (1998). She was also a favorite of director John Schlesinger who used her in Honky Tonk Freeway (1981) and Eye for an Eye (1996), among others. In the spoof Pterodactyl Woman from Beverly Hills (1997), in which she served as associate producer, Beverly gamely starred as a chic Beverly Hills housewife who turns into a flying prehistoric reptile by night. On TV, Beverly scored well as matricide victim Kitty Menendez in Menendez: A Killing in Beverly Hills (1994) and earned an Emmy-nomination (and arguably gave the best performance) as Stella Kowalski opposite \"Hair\" co-star Treat Williams in the TV remake of A Streetcar Named Desire (1984). Other topnotch TV mini-movies included Sweet Temptation (1996) and Judgment Day: The John List Story (1993), in which she played Robert Blake's devout wife. On primetime she has been cast quite assertively in recurring parts -- lately she has been spotted on Law & Order: Special Victims Unit (1999) as a defense attorney, and on Entourage (2004) as a talent agent. Beverly's off-camera romantic life has been just as interesting. Following her relationship with \"Hair\" director Milos Forman, she married Lorenzo Salviati, an economics student who also was an Italian duke. She left Hollywood and lived with him in Europe, but separated after two years and returned. A six-year relationship with Irish director Neil Jordan was followed by one with Oscar-winning production designer Anton Furst; this ended tragically when, just weeks after their breakup, he committed suicide. A former union with the volatile Al Pacino produced twins Olivia and Anton, who were born in 2001. These days, Beverly's career on camera has remained secondary to the raising of her children. Occasionally she has made use of her vocal talents performing at L.A. nightclubs and with a jazz band that included brother Jeff. From time to time she still lights up the screen as a brash professional or somebody's colorful mom; whatever time she has on screen, whether major or minor, it is always welcomed and never, ever less than...interesting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNTk4ODU5NV5BMl5BanBnXkFtZTcwODU0OTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000350","name":"Beverly D'Angelo","idIMDB":"nm0000350"},"actorId":"nm0000350","character":"Patsy Cline","urlCharacter":"http://www.imdb.com/character/ch0034969","main":true}],"seasons":[],"idIMDB":"tt0080549","urlIMDB":"http://www.imdb.com/title/tt0080549","business":{"budget":null,"openingWeekend":[{"money":"$3,366,443","country":"USA","day":"09","month":"03","year":"1980","remarks":"437 Screens"}],"gross":[{"money":"$3,366,443","country":"USA","day":"09","month":"03","year":"1980","remarks":""}],"weekendGross":[{"money":"$3,366,443","country":"USA","day":"09","month":"03","year":"1980","remarks":"437 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"Universal City Studios, Inc."},"technical":{"runtime":["2 hr 4 min (124 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panaflex Camera and Lenses by Panavision"],"laboratory":["Technicolor, Hollywood (CA), USA (color)"],"filmLength":["3,415 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.5","filmingLocations":[{"location":"Norton, Virginia, USA"}],"rated":"PG","awards":[{"award":"Academy Awards, USA 1981","titlesAwards":[{"titleAwardOutcome":"Won Oscar","categories":[{"category":"Best Actress in a Leading Role","names":[{"name":"Sissy Spacek","id":"nm0000651","role":null}]}]},{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Picture","names":[{"name":"Bernard Schwartz","id":"nm0193533","role":null}]},{"category":"Best Writing, Screenplay Based on Material from Another Medium","names":[{"name":"Thomas Rickman","id":"nm0725564","role":null}]},{"category":"Best Cinematography","names":[{"name":"Ralf D. Bode","id":"nm0005659","role":null}]},{"category":"Best Art Direction-Set Decoration","names":[{"name":"John W. Corso","id":"nm0181149","role":null},{"name":"John M. Dwyer","id":"nm0245501","role":null}]},{"category":"Best Sound","names":[{"name":"Richard Portman","id":"nm0692446","role":null},{"name":"Roger Heman Jr.","id":"nm0375947","role":null},{"name":"James R. Alexander","id":"nm0018482","role":null}]},{"category":"Best Film Editing","names":[{"name":"Arthur Schmidt","id":"nm0772831","role":null}]}]}]},{"award":"Golden Globes, USA 1981","titlesAwards":[{"titleAwardOutcome":"Won Golden Globe","categories":[{"category":"Best Motion Picture - Comedy or Musical","names":[]},{"category":"Best Actress in a Motion Picture - Comedy or Musical","names":[{"name":"Sissy Spacek","id":"nm0000651","role":null}]}]},{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Actor in a Motion Picture - Comedy or Musical","names":[{"name":"Tommy Lee Jones","id":"nm0000169","role":null}]},{"category":"Best Actress in a Supporting Role - Motion Picture","names":[{"name":"Beverly D'Angelo","id":"nm0000350","role":null}]}]}]},{"award":"BAFTA Awards 1982","titlesAwards":[{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best Actress","names":[{"name":"Sissy Spacek","id":"nm0000651","role":null}]},{"category":"Best Sound","names":[{"name":"Gordon Ecker","id":"nm0248563","role":null},{"name":"James R. Alexander","id":"nm0018482","role":null},{"name":"Richard Portman","id":"nm0692446","role":null},{"name":"Roger Heman Jr.","id":"nm0375947","role":null}]}]}]},{"award":"American Cinema Editors, USA 1981","titlesAwards":[{"titleAwardOutcome":"Nominated Eddie","categories":[{"category":"Best Edited Feature Film","names":[{"name":"Arthur Schmidt","id":"nm0772831","role":null}]}]}]},{"award":"Directors Guild of America, USA 1981","titlesAwards":[{"titleAwardOutcome":"Nominated DGA Award","categories":[{"category":"Outstanding Directorial Achievement in Motion Pictures","names":[{"name":"Michael Apted","id":"nm0000776","role":null}]}]}]},{"award":"Kansas City Film Critics Circle Awards 1980","titlesAwards":[{"titleAwardOutcome":"Won KCFCC Award","categories":[{"category":"Best Actress","names":[{"name":"Sissy Spacek","id":"nm0000651","role":null}]}]}]},{"award":"Los Angeles Film Critics Association Awards 1980","titlesAwards":[{"titleAwardOutcome":"Won LAFCA Award","categories":[{"category":"Best Actress","names":[{"name":"Sissy Spacek","id":"nm0000651","role":null}]}]}]},{"award":"National Board of Review, USA 1980","titlesAwards":[{"titleAwardOutcome":"Won NBR Award","categories":[{"category":"Best Actress","names":[{"name":"Sissy Spacek","id":"nm0000651","role":null}]},{"category":"Top Ten Films","names":[]}]}]},{"award":"National Society of Film Critics Awards, USA 1981","titlesAwards":[{"titleAwardOutcome":"Won NSFC Award","categories":[{"category":"Best Actress","names":[{"name":"Sissy Spacek","id":"nm0000651","role":null}]}]}]},{"award":"New York Film Critics Circle Awards 1980","titlesAwards":[{"titleAwardOutcome":"Won NYFCC Award","categories":[{"category":"Best Actress","names":[{"name":"Sissy Spacek","id":"nm0000651","role":null}]}]}]},{"award":"Writers Guild of America, USA 1981","titlesAwards":[{"titleAwardOutcome":"Nominated WGA Award (Screen)","categories":[{"category":"Best Drama Adapted from Another Medium","names":[{"name":"Thomas Rickman","id":"nm0725564","role":null}]}]}]}],"votes":"13,486","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"}],"keywords":{"keywords":["poverty","country music","singer","kissing while having sex","title based on song","abusive husband","father daughter relationship","wedding night","husband wife relationship","female protagonist","character's journey shown on map","journey shown on map","three word title","punctuation in title","apostrophe in title","song","singing","still","moonshine","jeep","honkytonk","car crash","bus tour","1950s","price of fame","twin","friendship between women","female bonding","rape","child bride","superstar","star","songwriter","rags to riches","promoter","mental breakdown","marital problem","friendship","dysfunctional marriage","coal","affection","teenage pregnancy","washington state","patsy cline","nashville tennessee","married as teenager","kentucky","grand ole opry","coal mining","blockbuster","appalachia","based on autobiography","musician","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:36:58"}}