{"data":{"movies":[{"title":"The Wilby Conspiracy","originalTitle":"","year":"1975","releaseDate":"197502","directors":[{"name":"Ralph Nelson","id":"nm0625680"}],"writers":[{"name":"Rod Amateau","id":"nm0024120"},{"name":"Harold Nebenzal","id":"nm0623872"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU4Nzc2NjE0N15BMl5BanBnXkFtZTcwOTEwMzg4NA@@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Action","Adventure","Drama","Thriller"],"plot":"Having spent 10 years in prison for nationalist activities, Shack Twala is finally ordered released by the South African Supreme Court but he finds himself almost immediately on the run after a run-in with the police. Assisted by his lawyer Rina Van Niekirk and visiting British engineer Jim Keogh, he heads for Capetown where he hopes to recover a stash of diamonds, meant to finance revolutionary activities, that he had entrusted to a dentist before his incarceration. Along the way, they are followed by Major Horn of the South African State security bureau and it becomes apparent that he has no intention of arresting them until they reach their final destination","simplePlot":"Black anti-apartheid activist and British engineer are forced to run from South African secret police.","actors":[{"actorName":"Sidney Poitier","urlProfile":"http://www.imdb.com/name/nm0001627","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0OTE3MzQ2Nl5BMl5BanBnXkFtZTcwMDc2MDc1NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1927","placeOfBirth":" Miami, Florida, USA","birthName":"Sidney L. Poitier","height":"6' 2½\" (1.89 m)","bio":"A native of Cat Island, The Bahamas (though born in Miami during a mainland visit by his parents), Poitier grew up in poverty as the son of farmers Evelyn (Outten) and Reginald James Poitier, who also drove a cab. He had little formal education and at the age of 15 was sent to Miami to live with his brother, in order to forestall a growing tendency toward delinquency. In the U.S., Poitier first experienced the racial chasm that divides the country, a great shock to a boy coming from a society with a majority of African descent. A determination to find and create opportunities for African-Americans was born in him because of the poor treatment he received on the streets of Miami. At 18, he went to New York, did menial jobs and slept in a bus terminal toilet. A brief stint in the Army as a worker at a veteran's hospital was followed by more menial jobs in Harlem. An impulsive audition at the American Negro Theatre was rejected so forcefully that Poitier dedicated the next six months to overcoming his accent and performance ineptness. On his second try, he was accepted. He was spotted in a rehearsal and given a bit part in a Broadway production of \"Lysistrata,\" for which he got excellent reviews. By the end of 1949, he was having to choose between leading roles on stage and an offer to work for Darryl F. Zanuck in the film No Way Out (1950). Poitier's performance as a doctor treating a white bigot got him plenty of notice and led to more roles, each considerably more interesting and prominent than most African American actors of the time were getting. Nevertheless, the roles were still less interesting and prominent than those white actors routinely obtained. But seven years later, after turning down several projects he considered demeaning, Poitier got a number of roles that catapulted him into a category rarely if ever achieved by an African American man of that time, that of starring leading man. One of the films, The Defiant Ones (1958), gave Poitier his first Academy Award nomination as Best Actor. Five years later, he won the Oscar for Lilies of the Field (1963), the first African American to win for a leading role. Poitier maintained activity on stage, on screen, and in the burgeoning Civil Rights movement. His roles in Guess Who's Coming to Dinner (1967) and To Sir, with Love (1967) were for their time landmarks in the breaking down of social barriers between African Americans and whites, and Poitier's talent, conscience, integrity, and inherent likability placed him on equal footing with the white stars of the day. He took on directing and producing chores in the Seventies, achieving success in both arenas. Although he has reduced the frequency of his roles in recent years, he remains one of the most respected and beloved figures in American cinema of the twentieth century.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0OTE3MzQ2Nl5BMl5BanBnXkFtZTcwMDc2MDc1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001627","name":"Sidney Poitier","idIMDB":"nm0001627"},"actorId":"nm0001627","character":"Shack Twala","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Caine","urlProfile":"http://www.imdb.com/name/nm0000323","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzIwNTQ4Ml5BMl5BanBnXkFtZTYwMzE1MTUz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1933","placeOfBirth":" Rotherhithe, London, England, UK","birthName":"Maurice Joseph Micklewhite","height":"6' 1\" (1.85 m)","bio":"Michael Caine was born Maurice Joseph Micklewhite in London, to Ellen Frances Marie (Burchell), a charlady, and Maurice Joseph Micklewhite, a fish-market porter. He left school at 15 and took a series of working-class jobs before joining the British army and serving in Korea during the Korean War, where he saw combat. Upon his return to England he gravitated toward the theater and got a job as an assistant stage manager. He adopted the name of Caine on the advice of his agent, taking it from a marquee that advertised The Caine Mutiny (1954). In the years that followed he worked in more than 100 television dramas, with repertory companies throughout England and eventually in the stage hit, \"The Long and the Short and the Tall.\" Zulu (1964), the 1964 epic retelling of a historic 19th-century battle in South Africa between British soldiers and Zulu warriors, brought Caine to international attention. Instead of being typecast as a low-ranking Cockney soldier, he played a snobbish, aristocratic officer. Although \"Zulu\" was a major success, it was the role of Harry Palmer in The Ipcress File (1965) and the title role in Alfie (1966) that made Caine a star of the first magnitude. He epitomized the new breed of actor in mid-'60s England, the working-class bloke with glasses and a down-home accent. However, after initially starring in some excellent films, particularly in the 1960s, including Gambit (1966), Funeral in Berlin (1966), Play Dirty (1969), Battle of Britain (1969), Too Late the Hero (1970), The Last Valley (1971) and especially Get Carter (1971), he seemed to take on roles in below-average films, simply for the money he could by then command. There were some gems amongst the dross, however. He gave a magnificent performance opposite Sean Connery in The Man Who Would Be King (1975) and turned in a solid one as a German colonel in The Eagle Has Landed (1976). Educating Rita (1983) and Hannah and Her Sisters (1986) (for which he won his first Oscar) were highlights of the 1980s, while more recently Little Voice (1998), The Cider House Rules (1999) (his second Oscar) and Last Orders (2001) have been widely acclaimed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzIwNTQ4Ml5BMl5BanBnXkFtZTYwMzE1MTUz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000323","name":"Michael Caine","idIMDB":"nm0000323"},"actorId":"nm0000323","character":"Jim Keogh","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicol Williamson","urlProfile":"http://www.imdb.com/name/nm0932116","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0OTc2MDQxOV5BMl5BanBnXkFtZTcwMjE0NzgwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1936","placeOfBirth":" Hamilton, Scotland, UK","birthName":"Thomas Nicol Williamson","height":"6' 3\" (1.91 m)","bio":"Nicol Williamson was an enormously talented actor who was considered by some critics to be the finest actor of his generation in the late 1960s and the 1970s, rivaled only by Albert Finney, whom Williamson bested in the classics. Williamson's 1969 \"Hamlet\" at the Roundhouse Theatre was a sensation in London, considered by many to be the best limning of The Dane since the definitive 20th-century portrayal by John Gielgud, a performance in that period, rivaled in kudos only by Richard Burton's 1964 Broadway performance. In a sense, Williamson and Burton were the last two great Hamlets of the century. Finney's Hamlet was a failure, and while Derek Jacobi's turn as The Dane was widely hailed by English critics, he lacked the charisma and magnetism -- the star power -- of a Williamson or Burton. Playwright John Osborne, whose play \"Inadmissible Evidence\" was a star vehicle for Williamson in London's West End and on Broadway, called him \"the greatest actor since Marlon Brando.\" While it was unlikely that Williamson could ever achieved the film reputation of Brando (who but Brando did?) or the superstar status that Burton obtained and then lost, his inability to maintain a consistent film career most likely is a result of his own well-noted eccentricities than it is from any deficiency in acting skills. The great critic and raconteur Kenneth Tynan (Laurence Olivier's first dramaturg at the National Theatre) wrote a 1971 profile of Williamson that elucidated the problem with this potentially great performer. Williamson's Hamlet had wowed Prime Minister Harold Wilson, and Wilson in turn raved about his performance to President Richard Nixon. Nixon invited Williamson to stage a one-man show at the White House, which was a success. However, in the same time period, Williamson's reputation was tarred by his erratic behavior during the North American tour of \"Hamlet\". In Boston he stopped during a performance and berated the audience, which led one cast member to publicly apologize to the Boston audience. Williamson would be involved in an even more famous incident on Broadway a generation later. Even before the Boston incident, Williamson had made headlines when, during the Philadelphia tryout of \"Inadmissible Evidence,\" he struck producer David Merrick whilst defending Anthony Page. In 1976 he slapped a fellow actor during the curtain call for the Broadway musical \"Rex.\" Fifteen years later, his co-star in the Broadway production of \"I Hate Hamlet\" was terrified of him after Williamson whacked the actor on his buttocks with a sword, after the actor had abandoned the choreography. A great stage actor, who also did a memorable \"Macbeth\" in London and on Broadway, Williamson was twice nominated for Tony Awards as Best Actor (Dramatic), in 1966 for Osborne's \"Inadmissible Evidence\" (a performance he recreated in the film version) and in 1974 for a revival of \"Uncle Vanya.\" On film, Williamson was superb in many roles, such as the suicidal Irish soldier in The Bofors Gun (1968) and Tony Richardson's Hamlet (1969). He got his chance playing leads, such as Sherlock Holmes in The Seven-Per-Cent Solution (1976) and Castle in Otto Preminger's The Human Factor (1979), and was competent if not spectacular, likely diminished by deficiencies in the scripts rather than his own talent. Richardson also replaced Williamson's rival as Hamlet, Burton, in his adaptation of Vladimir Nabokov's Laughter in the Dark (1969). It was in supporting work that he excelled in film in the 1970s and 1980s. He was quite effective as a supporting actor, such as his Little John to Sean Connery's Robin Hood in Richard Lester's Robin and Marian (1976), was brilliant in I'm Dancing as Fast as I Can (1982) and gave a performance for the ages (albeit in the scenery-chewing category as Merlin) in Excalibur (1981). His Merlin lives on as one of the most enjoyable performances ever caught on film. Then it was over. While the film work didn't dry up, it didn't reach the heights anymore. He failed to harness that enormous talent and convert it into memorable film performances. He did good work as Louis Mountbatten in a 1986 TV-movie, but the roles became more sporadic, and after 1997 this great actor no longer appeared in motion pictures. Williamson's eccentricities showed themselves again in the early 1990s. When appearing as the ghost of John Barrymore in the 1991 Broadway production of Paul Rudnick's \"I Hate Hamlet\" on Broadway in 1991, Williamson's co-star quit the play after being thumped on the buttocks with a sword during a stage fight. Although critics hailed the performances of the understudy as a \"vast improvement\" it caused a sensation in the press. Despite good reviews, the play lasted only 100 performances. Surprisingly, Williamson never won an Oscar nomination, yet that never was a game he seemed to play. In 1970, after his Hamlet triumph, he turned down a six-figure salary to appear as Enobarbus in Charlton Heston's film of Shakespeare's Antony and Cleopatra (1972)_. The role was played by Eric Porter, but his choice was justified in that the film was derided as a vanity production and savaged by critics). Williamson had been a staple on Broadway, even using his fine singing voice to appear as Henry VIII in the Broadway musical \"Rex\" In 1976. He has not appeared on the Great White Way since his own one-man show about John Barrymore that he himself crafted, \"Jack: A Night on the Town with John Barrymore,\" which had enormously successful runs, both at the Criterion Theater in London, and The Geffen Theater in Los Angeles playing to packed houses, before closing on Broadway after only 12 performances in 1996. The \"I Hate Hamlet\" and \"Jack\" shows are still talked about on Broadway. Williamson has joined the ranks of Barrymore, Burton, and Brando, in that they have become phantoms who haunt the theater and film that they they served so admirably on the one hand but failed on the other. All enormously gifted artists, perhaps possessed of genius, they were discombobulated by that gift that became their curse, the burden of dreams -- the dreams of their audiences, their collaborators, their critics. While there is a wistfulness over the loss of such greatness, there is a relief offered, not so much from a moral tale, but as a release from guilt for the run-of-the-mill artists lacking such genius. One can be comforted by the fact that while one lacks the pearl of such a talent, they also lack the irritating genius that engenders that pearl.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0OTc2MDQxOV5BMl5BanBnXkFtZTcwMjE0NzgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0932116","name":"Nicol Williamson","idIMDB":"nm0932116"},"actorId":"nm0932116","character":"Major Horn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Prunella Gee","urlProfile":"http://www.imdb.com/name/nm0311562","urlPhoto":"","biography":{"dateOfBirth":"17 February 1950","placeOfBirth":" London, England, UK","bio":"The glamorous Prunella Gee was trained at the London Academy of Music and Dramatic Art. She appeared in her first television series, 'Shabby Tiger' in 1973, which gave her instant notoriety due to her nude scenes. She became a virtual staple of British television thereafter, and was chosen to guest star in single episodes of 'The Sweeney', 'The Return of the Saint', 'Hammer House of Horror' and 'The Professionals'. Prunella's impressive list of film credits include 'The Wilby Conspiracy' with Sidney Poitier and Michael Caine, the James Bond adventure 'Never Say Never Again' with Sean Connery, and 'Stormy Monday', in which she played Sting's wife. On stage, she has played all three women in 'The Last of the Red Hot Lovers', the blind Sheila in 'Wait Until Dark', the double role of Alice in 'Double Take' and Romaine in 'Witness for the Prosecution'. In 1998, Prunella went to Los Angeles to make 'The Merchants of Venus', in which she starred with Michael York, Beverly D'Angelo and Brian Cox. One year later she appeared as Doreen Heavey for a five month stint in the long-running British soap opera 'Coronation Street'. Since giving up acting in 2004, Prunella has worked as a counselor and therapist in Camden, London. In 2011, she agreed to appear in the short film 'Trimming Pablo', a one-off return to the acting field.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0311562","name":"Prunella Gee","idIMDB":"nm0311562"},"actorId":"nm0311562","character":"Rina Van Niekirk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Saeed Jaffrey","urlProfile":"http://www.imdb.com/name/nm0006762","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NTAzNTIxMl5BMl5BanBnXkFtZTcwMjkyNzg5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 January 1929","placeOfBirth":" Malerkotla, Punjab, British India","birthName":"Saeed Joffrey","height":"5' 5\" (1.65 m)","bio":"Saeed Jaffrey was born in Maler Kotla, Punjab, India. He was born on the 8th of January 1929. He attended University of Allahabad where he completed his post-graduate degree in history. He also attended the Staff Training Institute of All India Radio. He started his career in drama, as the founder of his own English theatre company called the Unity Theatre, in New Delhi between 1951 and 1956. He also served with All India Radio as Radio Director during this period. He played a wide variety of roles in comedy and drama with equal ease and enthusiasm. His early theatrical work included roles in productions of Tennessee Williams, Fry, Priesty, Wilde, and Shakespeare. In 1956, he finished his studies at the Royal Academy of Dramatic Art in London, a premier school of drama. He went to the United States on a Fulbright scholarship and took a second post-graduate degree in drama from the Catholic University in America. With this experience as his base, he took his company on a tour of the United States doing Shakespearean plays in the year 1957. He was the first Indian Actor to have ever done so. He then became an active member of the Actors' Studio in New York. Here, he was noted for his acting in the play \"Nights\" and his role as the \"Nawab\" in Granada Television's adaptation of \"The Jewel in the Crown\". He married Madhur, actress and cookery writer, with whom he has had three children. He is now divorced from her. In the 1960s he made numerous stage appearances and participated in a number of tours. He also started his U.S. television career in these years. He was the director of publicity and advertising for the Government of India in their Tourist Office in the U.S. from 1958 to 1960. His performance in the BBC classic _Gangsters (1975) (TV)_, as \"Rafiq\" earned him countrywide recognition in the United Kingdom. This was even though he had acted in Theatres and appeared on television previously in the U.K. During this period he acted in the off-Broadway play \"A Tenth of an Inch Make The Difference\" written and directed by Rolf Forsberg, who later cast Saeed Jaffrey and his wife Madhur in the noted short films, \"Parable\" in 1964, and \"Stalked\", starring Jack Hawkins, in 1968. Mr. Jaffrey began his feature film career acting in the movie The Guru (1969), and since then has made numerous film appearances along with Hollywood stars such as Sean Connery, Michael Caine, Pierce Brosnan etc. He has, since then, worked with directors of high caliber such as Satyajit Ray, James Ivory, David Lean and Richard Attenborough. He is a member of the Actors' Equity Association, Screen Actors Guild and the American Federation of Television and Radio Artists. He is known over the world for his impeccable English accent, his dapper style and his catch phrase \"My dear boy\". They form part of an acting persona that audiences have always found enchanting. He uses his smooth charm to good effect whether he is playing the archetypal oily, corrupt businessman or the kindly, knowing, father like figure. He is the first Asian to have received British and Canadian Academy Award nominations for acting, and is the first ever to be awarded the Order of the British Empire for his services to drama.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NTAzNTIxMl5BMl5BanBnXkFtZTcwMjkyNzg5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006762","name":"Saeed Jaffrey","idIMDB":"nm0006762"},"actorId":"nm0006762","character":"Anil Mukerjee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Persis Khambatta","urlProfile":"http://www.imdb.com/name/nm0001422","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzEzNjUzNzY5OV5BMl5BanBnXkFtZTcwOTAxOTkxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 October 1948","placeOfBirth":" Bombay, State of Bombay, India","height":"5' 7½\" (1.71 m)","bio":"Persis Khambatta was born on October 2, 1948 in Bombay, India. At age 17, as Femina Miss India, she entered Miss Universe 1965, dressed in off-the-rack clothes she bought at the last minute. Khambatta became a model for companies such as Revlon. Her biggest acting break was getting the role of Lieutenant Ilia, the bald Deltan alien in Star Trek: The Motion Picture (1979). This led to roles in Nighthawks (1981), Megaforce (1982) and Le chevalier du monde perdu (1983). She was considered for the title role in the James Bond film Octopussy (1983), but was passed over for Maud Adams. Khambatta became the first citizen of India to present an Academy Award in 1980. She was nominated for Saturn Award Best Actress for her Star Trek role. Khambatta also made guest appearances on many popular American television series. In the early 1980s, Khambatta was seriously injured in a car crash in Germany and had to have heart bypass surgery. A year before her death, she wrote and published a coffee table book called \"Pride of India\" which featured former Miss Indias; it was dedicated to Mother Teresa and part of the royalties went to the Missionaries of Charity. On August 17, 1998, Persis Khambatta was taken to the Marine Hospital in South Mumbai, complaining of chest pains. She died of a heart attack on August 18, 1998 at age 49, her funeral was held in Mumbai.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzEzNjUzNzY5OV5BMl5BanBnXkFtZTcwOTAxOTkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001422","name":"Persis Khambatta","nicknames":["Femina Miss India"],"idIMDB":"nm0001422"},"actorId":"nm0001422","character":"Persis Ray","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rijk de Gooyer","urlProfile":"http://www.imdb.com/name/nm0329693","urlPhoto":"","biography":{"dateOfBirth":"17 December 1925","placeOfBirth":" Utrecht, Utrecht, Netherlands","bio":"Rijk de Gooyer was born on December 17, 1925 in Utrecht, Utrecht, Netherlands. He was an actor, known for In voor- en tegenspoed (1991), Nosferatu the Vampyre (1979) and De Brekers (1985). He was married to Tonny Domburg. He died on November 2, 2011 in Amsterdam, Noord-Holland, Netherlands.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0329693","name":"Rijk de Gooyer","idIMDB":"nm0329693"},"actorId":"nm0329693","character":"Van Heerden","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rutger Hauer","urlProfile":"http://www.imdb.com/name/nm0000442","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY4MjI0MjgyOV5BMl5BanBnXkFtZTgwMDA0MDkyODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 January 1944","placeOfBirth":" Breukelen, Utrecht, Netherlands","birthName":"Rutger Oelsen Hauer","height":"6' 1½\" (1.87 m)","bio":"Blonde, blue-eyed, tall and handsome Dutch actor Rutger Hauer has an international reputation for playing everything from romantic leads to action heroes to sinister villains. Hauer was born in Breukelen, a town in the province of Utrecht, the Netherlands. He is the son of Teunke (Mellema) and Arend Hauer, both actors. Because his parents were often touring, he and his three sisters were raised by a nanny. A bit of a rebel during his childhood, he chafed at the rules and rigors of school and was often getting into mischief. His grandfather had been the captain of a schooner and at age 15, Hauer ran away to work on a freighter for a year. Like his great-grandfather, Hauer is color-blind, which prevented him from furthering his career as a sailor. Upon his return he attended night school and started working in the construction industry. When he again bombed at school, his parents enrolled him in drama classes. Fancying himself a poet, he spent most of his time writing poetry and hanging out in Amsterdam coffee houses instead of studying. He was expelled for poor attendance and afterward spent a brief period in the Dutch navy. Deciding he didn't like military life, he convinced his superiors that he was mentally unfit and was sent to a special home for psych patients. It was an unpleasant place, but Hauer remained there until he convinced his ranking officers that the military really did not need him.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY4MjI0MjgyOV5BMl5BanBnXkFtZTgwMDA0MDkyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000442","name":"Rutger Hauer","nicknames":["The Dutch Paul Newman"],"idIMDB":"nm0000442"},"actorId":"nm0000442","character":"Blane Van Niekirk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patrick Allen","urlProfile":"http://www.imdb.com/name/nm0019996","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk2Njk0MTc4NF5BMl5BanBnXkFtZTgwNjY2NDc3MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 March 1927","placeOfBirth":" Nyasaland [now Malawi]","birthName":"John Keith Patrick Allen","height":"5' 9\" (1.75 m)","bio":"Patrick Allen was born on March 17, 1927 in Nyasaland as John Keith Patrick Allen. He was an actor, known for Dial M for Murder (1954), Crane (1963) and Glencannon (1959). He was married to Lawson, Sarah. He died on July 28, 2006 in London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk2Njk0MTc4NF5BMl5BanBnXkFtZTgwNjY2NDc3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0019996","name":"Patrick Allen","idIMDB":"nm0019996"},"actorId":"nm0019996","character":"District Commissioner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe De Graft","urlProfile":"http://www.imdb.com/name/nm0208646","urlPhoto":"","biography":{"bio":"Joe De Graft was an actor, known for The Wilby Conspiracy (1975). He died on November 1, 1978.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0208646","name":"Joe De Graft","idIMDB":"nm0208646"},"actorId":"nm0208646","character":"Wilby Xaba","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Archie Duncan","urlProfile":"http://www.imdb.com/name/nm0241902","urlPhoto":"","biography":{"dateOfBirth":"26 May 1914","placeOfBirth":" Glasgow, Scotland, UK","bio":"Archie Duncan was born on May 26, 1914 in Glasgow, Scotland. He was an actor, known for The Adventures of Robin Hood (1955), Sherlock Holmes (1954) and Ring of Bright Water (1969). He died on July 24, 1979 in London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0241902","name":"Archie Duncan","idIMDB":"nm0241902"},"actorId":"nm0241902","character":"Gordon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Abdulla Sunado","urlProfile":"http://www.imdb.com/name/nm0839013","urlPhoto":"","biography":{"bio":"Abdulla Sunado is an actor, known for Out of Africa (1985), The Wilby Conspiracy (1975) and Braxton (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0839013","name":"Abdulla Sunado","idIMDB":"nm0839013"},"actorId":"nm0839013","character":"Village Headman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Helmut Dantine","urlProfile":"http://www.imdb.com/name/nm0200626","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGU3YmNiMTUtNDFjYy00Njg4LWI5ZDgtYjQzODk0Mzg0ZjBiXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 October 1918","placeOfBirth":" Vienna, Austria-Hungary [now Austria]","birthName":"Helmut Guttman","height":"6' (1.83 m)","bio":"Actor/director/producer Helmut Dantine was born in Vienna, Austria on October 7, 1917. He made a name for himself as an actor during World War Two playing German soldiers and Nazi villains in Hollywood films, most notably in Mrs. Miniver (1942). The young Dantine was a fervent anti-fascist/anti-Nazi activist in Vienna. As a leader in the anti-Nazi youth movement the 19-year old was summarily rounded up and imprisoned at the Rosserlaende concentration camp. Family influence persuaded a physician to grant him a medical release that June and he was immediately sent to Los Angeles to stay with the only friend they had in America. Dantine joined the Pasadena Playhouse, where he was spotted by a Warner Bros. talent scout who was struck by Dantine's dark good looks. Signed to a Warner's contract, he appeared in a variety of films after making his debut as a Nazi in International Squadron (1941) starring Ronald Reagan. He played supporting, second lead and eventually, lead roles in such films as Casablanca (1942) (where he was the newlywed who gambles away his visa money), Edge of Darkness (1943) (his first lead), the infamous Mission to Moscow (1943) and Passage to Marseille (1944). Two of his best films came on loan-out from Warners in 1942: Ernst Lubitsch's comic masterpiece To Be or Not to Be (1942) and William Wyler's Oscar-winning Mrs. Miniver (1942). Dantine directed the the unsuccessful Thundering Jets (1958). His wife, Niki Dantine, was the daughter of Loew's president Nicholas Schenck, the overall boss of Metro-Goldwyn-Mayer -- ostensibly the most powerful man in Hollywood since 1927. After Schenck was forced out of Loew's, the wily old movie veteran formed his own production and distribution company. In 1959, Dantine's acting career was on the wane and his attempt to become a director a relative failure, he became a producer. He was appointed vice-president of his father-in-law's Schenck Enterprises, eventually becoming president of the company in 1970. Dantine produced three minor Sam Peckinpah films in the mid-1970s, including Bring Me the Head of Alfredo Garcia (1974) and The Killer Elite (1975) in both of which,he had small supporting roles. Helmut Dantine died on May 2, 1982, at age 63, in Beverly Hills after suffering a massive heart attack. His body was interred at Westwood Memorial Park in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGU3YmNiMTUtNDFjYy00Njg4LWI5ZDgtYjQzODk0Mzg0ZjBiXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0200626","name":"Helmut Dantine","idIMDB":"nm0200626"},"actorId":"nm0200626","character":"Prosecuting Counsel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Pearce","urlProfile":"http://www.imdb.com/name/nm0669000","urlPhoto":"","biography":{"bio":"Peter Pearce is an actor, known for The Wilby Conspiracy (1975), Beryl Markham: A Shadow on the Sun (1988) and True Blue (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0669000","name":"Peter Pearce","idIMDB":"nm0669000"},"actorId":"nm0669000","character":"Highway Policeman","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0073901","urlIMDB":"http://www.imdb.com/title/tt0073901","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":[{"money":null,"country":null,"day":"18","month":"02","year":"1974","remarks":null},null],"copyrightHolder":"Copyright © United Artists Corporation MCMLXXIV (1974)"},"technical":{"runtime":["1 hr 45 min (105 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.66 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe, UK"],"filmLength":["2,882 m (Sweden, cut version)","2,895 m (Sweden, uncut version)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.4","filmingLocations":[{"location":"Kenya"}],"rated":"PG","awards":[],"votes":"1,206","type":"Movie","companyCreditsSimple":[{"idCompany":"co0037459","name":"Baum/Dantine Productions"},{"idCompany":"co0006250","name":"Optimus Productions Ltd."}],"keywords":{"keywords":["police","diamond","dentist","on the run","lawyer","air strip","border","pilot","airplane","car chase","jeep","sinkhole","fugitive","africa","tracking device","johannesburg south africa","helicopter","car","handcuffs","racism","south africa","chase","apartheid","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:44:55"}}