{"data":{"movies":[{"title":"Quintet","originalTitle":"","year":"1979","releaseDate":"19790429","directors":[{"name":"Robert Altman","id":"nm0000265"}],"writers":[{"name":"Frank Barhydt","id":"nm3004592"},{"name":"Robert Altman","id":"nm0000265"}],"runtime":"118 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWFkZWQ0OTctYmZmNi00YzJmLTg1NDItZDhmYWI4Yzg0NzdiXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1.jpg","countries":["USA"],"languages":["English","Latin"],"genres":["Drama","Mystery","Sci-Fi"],"plot":"In the distant future the world is in the grip of another ice age. A city originally built to house five million people is now in its death throes as the relentlessly advancing glacier is slowly crushing the metropolis's steel infrastructure. The relatively few surviving fur-clad inhabitants, perhaps thousands, perhaps only hundreds, drift aimlessly in their grim, drab world, awaiting their inevitable fate as they try to survive from day to day with scavenged firewood and minimal diet. Their only solaces are booza, an alcoholic drink distilled from moss, and Quintet, a seemingly innocuous board game for six players. The only other surviving mammals are roving packs of hungry mastiffs which roam the city's corridors and quickly dispose of the remains of the dead. Newly arrived from the south is Essex with his pregnant wife Vivia, seeking shelter in the doomed city only to find it populated by people middle-aged or older. They had supported themselves by hunting seals, but now that the ...","simplePlot":"During a future ice age, dying humanity occupies its remaining time by playing a board game called \"Quintet.\" For one small group, this obsession is not enough; they play the game with living pieces ... and only the winner survives.","actors":[{"actorName":"Paul Newman","urlProfile":"http://www.imdb.com/name/nm0000056","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODUwMDYwNDg3N15BMl5BanBnXkFtZTcwODEzNTgxMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 January 1925","placeOfBirth":" Shaker Heights, Ohio, USA","birthName":"Paul Leonard Newman","height":"5' 9½\" (1.77 m)","bio":"Screen legend, superstar, and the man with the most famous blue eyes in movie history, Paul Leonard Newman was born on January 26, 1925, in Cleveland, Ohio, the second son of Theresa (Fetsko) and Arthur Sigmund Newman. Paul's father was Jewish, the son of immigrants from Poland and Hungary; he owned a successful sporting goods store. Paul's mother, a practicing Christian Scientist of Slovak decent, and his uncle Joe, had an interest in creative arts, and it rubbed off on him. He acted in grade school and high school plays. The Newmans were a well-to-do family, and Paul grew up in a nice home in Shaker Heights. By 1950, the 25-year-old Newman had been kicked out of Ohio University for unruly behavior, served three years in the United States Navy during World War II as a radio operator, graduated from Ohio's Kenyon College, married his first wife, Jackie, and had his first child, Scott. 1950 was also the year that Paul's father died. When he became successful in later years, Newman said if he had any regrets it would be that his father wasn't around to see it. He brought Jackie back to Shaker Heights and he ran his father's store for a short period. Then, knowing that wasn't the career path he wanted to take, he moved Jackie and Scott to New Haven, Connecticut, where he attended Yale University's School of Drama. While doing a play there, Paul was spotted by two agents, who invited him to come to New York City to pursue a career as a professional actor. After moving to New York, Paul acted in guest spots for various television series and in 1953 came a big break. He got the part of understudy of the lead role in the successful Broadway play \"Picnic\". Through this play, he met actress Joanne Woodward, who was also an understudy in the play. While they got on very well and there was a strong attraction, Paul was married and his second child, Susan, was born that year. During this time, Newman was also accepted into the much admired and popular New York Actors Studio, although he wasn't technically auditioning. In 1954, a film Paul was very reluctant to do was released, The Silver Chalice (1954). He considered his performance in this costume epic to be so bad that he took out a full-page ad in a trade paper apologizing for it to anyone who might have seen it. He had always been embarrassed about the film and reveled in making fun of it. He immediately wanted to return to the stage, and performed in \"The Desperate Hours\". In 1956, Newman got the chance to redeem himself in the film world by portraying boxer Rocky Graziano in Somebody Up There Likes Me (1956), and critics praised his performance. In 1957, with a handful of films to his credit, he was cast in The Long, Hot Summer (1958), co-starring none other than Joanne Woodward. During the shooting of this film, they realized they were meant to be together and by now, so did Paul's wife Jackie. After Jackie gave Paul a divorce, he and Joanne married in Las Vegas in January 1958. They went on to have three daughters together and raised them in Westport, Connecticut. In 1959, Paul received his first Academy Award nomination for Best Actor, in Cat on a Hot Tin Roof (1958). The 1960s would bring Paul Newman into superstar status, as he became one of the most popular actors of the decade, and garnered three more Best Actor Oscar nominations, for The Hustler (1961), Hud (1963) and Cool Hand Luke (1967). In 1968, his debut directorial effort Rachel, Rachel (1968) was given good marks, and although the film and Joanne Woodward were nominated for Oscars, Newman was not nominated for Best Director. However, he did win a Golden Globe Award for his direction. 1969 brought the popular screen duo Paul Newman and Robert Redford together for the first time when Butch Cassidy and the Sundance Kid (1969) was released. It was a box office smash. Through the 1970s, Newman had hits and misses from such popular films as The Sting (1973) and The Towering Inferno (1974) to lesser known films as The Life and Times of Judge Roy Bean (1972) to a cult classic Slap Shot (1977). After the death of his only son, Scott, in 1978, Newman's personal life and film choices moved in a different direction. His acting work in the 1980s and on is what is often most praised by critics today. He became more at ease with himself and it was evident in The Verdict (1982) for which he received his sixth Best Actor Oscar nomination and in 1987 finally received his first Oscar for The Color of Money (1986). Friend and director of Somebody Up There Likes Me (1956), Robert Wise accepted the award on Newman's behalf as he did not attend the ceremony. Films were not the only thing on his mind during this period. A passionate race car driver since the early 1970s, Newman became co-owner of Newman-Haas racing in 1982, and also founded \"Newman's Own\", a successful line of food products that has earned in excess of $100 million, every penny of which Newman donated to charity. He also started The Hole in the Wall Gang Camps, an organization for children with serious illness. He was as well known for his philanthropic ways and highly successful business ventures as he was for his legendary actor status. Newman enjoyed a 50-year marriage to Joanne in Connecticut, their main residence since moving away from the bright lights of Hollywood in 1960. Renowned for his sense of humor, in 1998 he quipped that he was a little embarrassed to see his salad dressing grossing more than his movies. During his later years, he still attended races, was much involved in his charitable organizations, and in 2006, he opened a restaurant called Dressing Room, which helps out the Westport Country Playhouse, a place that Paul took great pride in. In 2007, he made some headlines when he said that he was losing his invention and confidence in his acting abilities and that acting is \"pretty much a closed book for me.\" He died on September 26, 2008 at age 83 of lung cancer. Whether he was on the screen or not, Paul Newman remained synonymous with the anti-heroism of the 1960s and 1970s cinema, and with the rebellious nature his characters so often embodied.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODUwMDYwNDg3N15BMl5BanBnXkFtZTcwODEzNTgxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000056","name":"Paul Newman","nicknames":["King Cool","PL"],"idIMDB":"nm0000056"},"actorId":"nm0000056","character":"Essex","urlCharacter":"http://www.imdb.com/character/ch0529851","main":true},{"actorName":"Vittorio Gassman","urlProfile":"http://www.imdb.com/name/nm0002094","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNzg4OTU1Nl5BMl5BanBnXkFtZTcwMTY1OTQyOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 September 1922","placeOfBirth":" Genoa, Liguria, Italy","birthName":"Vittorio Gassmann","height":"6' 1½\" (1.87 m)","bio":"Vittorio Gassman studied theatre in his youth and was quite a good basketball player. He debuted on stage in 1943 and soon felt home in all classical theatre works. Since 1946 he also worked at the movies and his first big role there was the criminal in Bitter Rice (1949). This fixed him to his main parts: The ambiguous gentleman inflicting pain and pleasure at the same time. He also participated in the Italian comedies and in American movies but the latter with only minor success. As a homage to his passion for the theatre he directed a cinema version of the play Kean: Genius or Scoundrel (1957).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNzg4OTU1Nl5BMl5BanBnXkFtZTcwMTY1OTQyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002094","name":"Vittorio Gassman","nicknames":["Il Mattatore","The Sir Laurence Olivier of Italy"],"idIMDB":"nm0002094"},"actorId":"nm0002094","character":"St. Christopher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fernando Rey","urlProfile":"http://www.imdb.com/name/nm0721073","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODc3NDM0NV5BMl5BanBnXkFtZTYwNDI3MjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 September 1917","placeOfBirth":" A Coruña, Galicia, Spain","birthName":"Fernando Casado Arambillet","height":"5' 9½\" (1.77 m)","bio":"Fernando Rey, the great Spanish movie actor primarily known in the United States for his role as \"Frog One\" in The French Connection (1971) and its sequel, was born Fernando Casado D'Arambillet on September 20 1917, in A Coruña, Galicia, Spain, the son of Colonel Casado Veiga. Originally, the young Fernando intended to become an architect. However, when the Spanish Civil War erupted in 1936, his architectural studies were interrupted, and he gained employment as a movie extra. He took the stage name \"Fernando Rey\" at the beginning of his career, equivalent, in English, to \"Fernando King\". Eight years after his movie debut, he was cast in his first major speaking role, as the Duke de Alba in José López Rubio's 1944 movie \"Eugenia de Montijo\". Rey enjoyed a long and prosperous career as an actor in movies, the theater, radio, and television. He also was a major voice-over artist in Spain, narrating films and dubbing the voices of actors in foreign films. Rey's most fruitful collaboration was with the great director Luis Buñuel, which began during the 1960s and continued thought the 1970s. The films that Rey appeared in for Buñuel' made him an international star, the first produced by the Spanish cinema. By the early 1970s, Rey's career reached its high point, with his co-starring role in \"The French Connection\" (Best Picture Oscar Winner for 1971) and his starring role in Buñuel's The Discreet Charm of the Bourgeoisie (1972) (\"The Discreet Charm of the Bourgeoisie\", Best Foreign Language Film Oscar winner for 1972). Rey followed up these successes by appearing in The French Connection (1971) in 1974, and Buñuel's tandem That Obscure Object of Desire (1977) (\"That Obscure Object of Desire\"), an art-house hit that was nominated for the Best Foreign Language Film Oscar. Ironically, in the film, Rey's voice was dubbed into French by Michel Piccoli. That same year, he won the Best Actor prize at Cannes for Carlos Saura' Elisa, My Life (1977). Many honors came to Rey in the twilight of his career, during the 1980s and 1990s. He was awarded at San Sebastián and Cannes, and was presented with the gold medal of the Spanish Art and Movie Sciences Academy. He became the president of that Academy from 1992 till his death from cancer two years later.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODc3NDM0NV5BMl5BanBnXkFtZTYwNDI3MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0721073","name":"Fernando Rey","idIMDB":"nm0721073"},"actorId":"nm0721073","character":"Grigor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bibi Andersson","urlProfile":"http://www.imdb.com/name/nm0000761","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMTQzOTI3M15BMl5BanBnXkFtZTcwMjQ2MjM2NQ@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 November 1935","placeOfBirth":" Kungsholmen, Stockholm, Stockholms län, Sweden","birthName":"Berit Elisabeth Andersson","height":"5' 4¼\" (1.63 m)","bio":"Her artistic dreams came early in life and were further supported by her older sister Gerd Andersson who became a ballet dancer at the Royal Opera and made her acting debut in 1951. Bibi, on the other side, had to make do with bit parts and commercials. She debuted in Dum-Bom (1953), playing against Nils Poppe. Eventually, she was able to start at the Royal Dramatic Theatre's acting school in 1954. A brief relationship with Ingmar Bergman made her quit school and follow him to the Malmö city theatre, where he was a director, performing in plays by August Strindberg and Hjalmar Bergman. Bergman also gave her a small part in his comedy Smiles of a Summer Night (1955), and larger roles in his Wild Strawberries (1957) and The Seventh Seal (1957). From the the 1960s she got offers from abroad, with best result in I Never Promised You a Rose Garden (1977). During the civil war in Yugoslavia she has worked with several initiatives to give the people of Sarajevo theatre and other forms of culture.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMTQzOTI3M15BMl5BanBnXkFtZTcwMjQ2MjM2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000761","name":"Bibi Andersson","idIMDB":"nm0000761"},"actorId":"nm0000761","character":"Ambrosia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brigitte Fossey","urlProfile":"http://www.imdb.com/name/nm0287637","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NTgwMzU3MV5BMl5BanBnXkFtZTcwNzE5MDEwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 June 1946","placeOfBirth":" Tourcoing, Nord, France","bio":"This lovely, docile, sensitive-appearing blonde French leading lady started impressively in films at age 6, making a most notable debut in René Clément's Forbidden Games (1952). She abandoned acting a few years later for schooling and a normal upbringing. After a brief career as an interpreter and translator, she returned to the cinema as a young adult and met with great award-worthy success in mostly European movies, including François Truffaut's The Man Who Loved Women (1977), Chanel Solitaire (1981), etc.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NTgwMzU3MV5BMl5BanBnXkFtZTcwNzE5MDEwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0287637","name":"Brigitte Fossey","idIMDB":"nm0287637"},"actorId":"nm0287637","character":"Vivia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nina van Pallandt","urlProfile":"http://www.imdb.com/name/nm0887684","urlPhoto":"","biography":{"dateOfBirth":"15 July 1932","placeOfBirth":" Copenhagen, Denmark","birthName":"Nina Magdelena Møller","height":"5' 6½\" (1.69 m)","bio":"Nina Van Pallandt became famous in the United States in the early 1970s as the mistress of hoaxer Clifford Irving, who went to jail when his biography of Howard Hughes, allegedly written with Hughes' co-operation, proved to be a fake when Hughes himself came out of seclusion to repudiate the work. Van Pallandt helped expose Irving's fraud by revealing that he was vacationing with her in Mexico at the time he was allegedly interviewing Hughes. She appears, as herself, in Orson Welles' non-fiction film \"F For Fake\" (F for Fake (1973)). Van Pallandt was known in Europe as a singer of folk songs before her involvement with Irving and subsequent film career, having been married to her fellow folk singer, Baron Frederik van Pallandt, with whom she toured Europe and had many hit records as \"Nina & Frederik\". The height of Van Pallandt's film career was her appearance in four Robert Altman movies: The Long Goodbye (1973), A Wedding (1978), Quintet (1979) and O.C. and Stiggs (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0887684","name":"Nina van Pallandt","idIMDB":"nm0887684"},"actorId":"nm0887684","character":"Deuca","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Langton","urlProfile":"http://www.imdb.com/name/nm0486732","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMTc5NzI2OV5BMl5BanBnXkFtZTgwNjY2MTIzMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 April 1912","placeOfBirth":" Motherwell, Scotland, UK","birthName":"Basil Muir Langton-Dodds","height":"5' 9½\" (1.77 m)","bio":"His father, a wine importer loved the theatre and encouraged his acting ambitions and got him his first job at 16 touring with a Shakespearean company painting scenery and doing walk on parts. His mother disapproved thinking it wasn't a job for a respectable middle class young man. By 1939 he'd graduated to leading roles but then the war came. He joined the army and rose through the ranks to become a major. Within four days of leaving the service he was back in the theatre in a play 'Fifty Fifty' and the 'Seagulls Over Sorento' which ran five years.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMTc5NzI2OV5BMl5BanBnXkFtZTgwNjY2MTIzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0486732","name":"David Langton","idIMDB":"nm0486732"},"actorId":"nm0486732","character":"Goldstar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thomas Hill","urlProfile":"http://www.imdb.com/name/nm0384718","urlPhoto":"","biography":{"dateOfBirth":"2 June 1927","placeOfBirth":" Landour, Mussoorie, India","bio":"Thomas Hill was born on June 2, 1927 in Landour, Mussoorie, India. He was an actor, known for The NeverEnding Story (1984), The Neverending Story II: The Next Chapter (1990) and The Postman Always Rings Twice (1981). He died on April 20, 2009 in Bloomington, Indiana, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0384718","name":"Thomas Hill","idIMDB":"nm0384718"},"actorId":"nm0384718","character":"Francha","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Monique Mercure","urlProfile":"http://www.imdb.com/name/nm0580494","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzhlMmM5NjAtN2I1Ny00YzJjLTlkMjEtZjk3MzdiZTk2NTA0XkEyXkFqcGdeQXVyMTc4MzI2NQ@@._V1_UY44_CR10,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 November 1930","placeOfBirth":" Montreal, Quebec, Canada","bio":"Monique Mercure was born on November 14, 1930 in Montreal, Quebec, Canada. She is an actress, known for Le festin nu (1991), The Red Violin (1998) and J.A. Martin photographe (1977). She was previously married to Pierre Mercure.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzhlMmM5NjAtN2I1Ny00YzJjLTlkMjEtZjk3MzdiZTk2NTA0XkEyXkFqcGdeQXVyMTc4MzI2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0580494","name":"Monique Mercure","idIMDB":"nm0580494"},"actorId":"nm0580494","character":"Redstone's Mate","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Craig Richard Nelson","urlProfile":"http://www.imdb.com/name/nm0625269","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NDQ5Mzg2N15BMl5BanBnXkFtZTcwMDcyNzcyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 September 1947","placeOfBirth":" Salt Lake City, Utah, USA","height":"6' 3\" (1.91 m)","bio":"Craig Richard Nelson was born on September 17, 1947 in Salt Lake City, Utah, USA. He is an actor and director, known for 3 Women (1977), The Paper Chase (1973) and The Rat Pack (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NDQ5Mzg2N15BMl5BanBnXkFtZTcwMDcyNzcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0625269","name":"Craig Richard Nelson","idIMDB":"nm0625269"},"actorId":"nm0625269","character":"Redstone","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maruska Stankova","urlProfile":"http://www.imdb.com/name/nm0822379","urlPhoto":"","biography":{"dateOfBirth":"17 February 1934","placeOfBirth":" Prague, Czechoslovakia","bio":"Maruska Stankova was born on February 17, 1934 in Prague, Czechoslovakia. She was an actress, known for Quintet (1979), Almost Golden: The Jessica Savitch Story (1995) and Dreams Beyond Memory (1988). She died on August 31, 2000 in Toronto, Ontario, Canada.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0822379","name":"Maruska Stankova","idIMDB":"nm0822379"},"actorId":"nm0822379","character":"Jaspera","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anne Gerety","urlProfile":"http://www.imdb.com/name/nm0314251","urlPhoto":"","biography":{"dateOfBirth":"3 July 1926","placeOfBirth":" New York City, New York, USA","bio":"Anne Gerety was born on July 3, 1926 in New York City, New York, USA. She was an actress, known for Quintet (1979), No Place to Hide (1981) and World War III (1982). She died on October 25, 2003 in Nissequogue, Long Island, New York.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0314251","name":"Anne Gerety","idIMDB":"nm0314251"},"actorId":"nm0314251","character":"Aeon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michel Maillot","urlProfile":"http://www.imdb.com/name/nm0537630","urlPhoto":"","biography":{"dateOfBirth":"1926","placeOfBirth":"","birthName":"Michel Max Maillot","bio":"Michel Maillot was born in 1926 as Michel Max Maillot. He was an actor and writer, known for The Peanut Butter Solution (1985), Quintet (1979) and The Girl in Blue (1973). He died on September 6, 1999 in Saint-Bruno-de-Montarville, Québec, Canada.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0537630","name":"Michel Maillot","idIMDB":"nm0537630"},"actorId":"nm0537630","character":"Obelus","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Max Fleck","urlProfile":"http://www.imdb.com/name/nm0281392","urlPhoto":"","biography":{"bio":"Max Fleck is an actor, known for Quintet (1979), Revolution's Orphans (1979) and Seaway (1965).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0281392","name":"Max Fleck","idIMDB":"nm0281392"},"actorId":"nm0281392","character":"Wood Supplier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Françoise Berd","urlProfile":"http://www.imdb.com/name/nm0073414","urlPhoto":"","biography":{"dateOfBirth":"2 March 1923","placeOfBirth":" Saint-Pacome, Québec, Canada","bio":"Françoise Berd was born on March 2, 1923 in Saint-Pacome, Québec, Canada. She was an actress and producer, known for A Special Day (1977), Agnes of God (1985) and Quintet (1979). She died on August 10, 2001 in Montréal, Québec.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0073414","name":"Françoise Berd","idIMDB":"nm0073414"},"actorId":"nm0073414","character":"Charity House Woman","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0079770","urlIMDB":"http://www.imdb.com/title/tt0079770","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Copyright © 1979 Twentieth Century-Fox Film Corporation. All Rights Reserved (on print)"},"technical":{"runtime":["1 hr 58 min (118 min)","1 hr 56 min (116 min) (Argentina)","1 hr 50 min (110 min) (Portugal)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA (color by) (as Deluxe®)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.2","filmingLocations":[{"location":"Expo '67, Montréal, Québec, Canada"}],"rated":"R","awards":[],"votes":"2,335","type":"Movie","companyCreditsSimple":[{"idCompany":"co0306113","name":"Lion's Gate Films"},{"idCompany":"co0000756","name":"Twentieth Century Fox Film Corporation"}],"keywords":{"keywords":["game","future","ice age","board game","drink","mastiff","glacier","dystopia","drinking","mistaken identity","seal hunter","pack of dogs","betrayal","traveler","canada goose","thumb sucking","casino","stabbed to death","ice floe","wood","drunkenness","freeze to death","eaten by dogs","stabbed in chest","climate change","armageddon","hotel","alcohol","death of brother","death of expectant mother","death of pregnant woman","explosion","off screen murder","dead woman with eyes open","hero kills a woman","avalanche","throat slitting","stabbed in the head","revenge","pregnant woman murdered","post apocalypse","murder","loss of wife","game of death","assumed identity","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 09:08:21"}}