{"data":{"movies":[{"title":"TRON","originalTitle":"","year":"1982","releaseDate":"19820709","directors":[{"name":"Steven Lisberger","id":"nm0513974"}],"writers":[{"name":"Steven Lisberger","id":"nm0513974"},{"name":"Steven Lisberger","id":"nm0513974"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0OTM4ODM2MF5BMl5BanBnXkFtZTgwMTI0NDIxMDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Sci-Fi"],"plot":"Hacker/arcade owner Kevin Flynn is digitally broken down into a data stream by a villainous software pirate known as Master Control and reconstituted into the internal, 3-D graphical world of computers. It is there, in the ultimate blazingly colorful, geometrically intense landscapes of cyberspace, that Flynn joins forces with Tron to outmaneuver the Master Control Program that holds them captive in the equivalent of a gigantic, infinitely challenging computer game.","simplePlot":"A computer hacker is abducted into the digital world and forced to participate in gladiatorial games where his only chance of escape is with the help of a heroic security program.","actors":[{"actorName":"Jeff Bridges","urlProfile":"http://www.imdb.com/name/nm0000313","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU1NjM4MDYzMl5BMl5BanBnXkFtZTcwMjIwMjMyMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 December 1949","placeOfBirth":" Los Angeles, California, USA","birthName":"Jeffrey Leon Bridges","height":"6' 1\" (1.85 m)","bio":"Jeffrey Leon Bridges was born on December 4, 1949 in Los Angeles, California, the son of well-known film and TV star Lloyd Bridges and his long-time wife Dorothy Dean Bridges (née Simpson). He grew up amid the happening Hollywood scene with big brother Beau Bridges. Both boys popped up, without billing, alongside their mother in the film The Company She Keeps (1951), and appeared on occasion with their famous dad on his popular underwater TV series Sea Hunt (1958) while growing up. At age 14, Jeff toured with his father in a stage production of \"Anniversary Waltz\". The \"troublesome teen\" years proved just that for Jeff and his parents were compelled at one point to intervene when problems with drugs and marijuana got out of hand. He recovered and began shaping his nascent young adult career appearing on TV as a younger version of his father in the acclaimed TV- movie Silent Night, Lonely Night (1969), and in the strange Burgess Meredith film Le 3eme oeil (1970). Following fine notices for his portrayal of a white student caught up in the racially-themed Halls of Anger (1970), his career-maker arrived just a year later when he earned a coming-of-age role in the critically-acclaimed ensemble film The Last Picture Show (1971). The Peter Bogdanovich- directed film made stars out off its young leads (Bridges, Timothy Bottoms, Cybill Shepherd) and Oscar winners out of its older cast (Ben Johnson, Cloris Leachman). The part of Duane Jackson, for which Jeff received his first Oscar-nomination (for \"best supporting actor\"), set the tone for the types of roles Jeff would acquaint himself with his fans -- rambling, reckless, rascally and usually unpredictable). Owning a casual carefree handsomeness and armed with a perpetual grin and sly charm, he started immediately on an intriguing 70s sojourn into offbeat filming. Chief among them were his boxer on his way up opposite a declining Stacy Keach in Fat City (1972); his Civil War-era conman in the western Bad Company (1972); his redneck stock car racer in The Last American Hero (1973); his young student anarchist opposite a stellar veteran cast in Eugene O'Neill's The Iceman Cometh (1973); his bank-robbing (also Oscar-nominated) sidekick to Clint Eastwood in Thunderbolt and Lightfoot (1974); his aimless cattle rustler in Rancho Deluxe (1975); his low-level western writer who wants to be a real-life cowboy in Hearts of the West (1975); and his brother of an assassinated President who pursues leads to the crime in Winter Kills (1979). All are simply marvelous characters that should have propelled him to the very top rungs of stardom...but strangely didn't. Perhaps it was his trademark ease and naturalistic approach that made him somewhat under appreciated at that time when Hollywood was run by a Dustin Hoffman, Robert De Niro and Al Pacino-like intensity. Neverthless, Jeff continued to be a scene-stealing favorite into the next decade, notably as the video game programmer in the 1982 science-fiction cult classic TRON (1982), and the struggling musician brother vying with brother Beau Bridges over the attentions of sexy singer Michelle Pfeiffer in The Fabulous Baker Boys (1989). Jeff became a third-time Oscar nominee with his highly intriguing (and strangely sexy) portrayal of a blank-faced alien in Starman (1984), and earned even higher regard as the ever-optimistic inventor Preston Tucker in Tucker: The Man and His Dream (1988). Since then Jeff has continued to pour on the Bridges magic on film. Few enjoy such an enduring popularity while maintaining equal respect with the critics. The Fisher King (1991), American Heart (1992), Fearless (1993), The Big Lebowski (1998) (now a cult phenomenon) and The Contender (2000) (which gave him a fourth Oscar nomination) are prime examples. More recently he seized the moment as a bald-pated villain as Robert Downey Jr.'s nemesis in Iron Man (2008) and then, at age 60, he capped his rewarding career by winning the elusive Oscar, plus the Golden Globe and Screen Actor Guild awards (among many others), for his down-and-out country singer Bad Blake in Crazy Heart (2009). Bridges next starred in TRON: Legacy (2010), reprising one of his more famous roles, and received another Oscar nomination for Best Actor for his role in the Western remake True Grit (2010). In 2014, he co-produced and starred in an adaptation of the Lois Lowry science fiction drama The Giver (2014). Jeff has been married since 1977 to non-professional Susan Geston (they met on the set of Rancho Deluxe (1975)). The couple have three daughters, Isabelle (born 1981), Jessica (born 1983), and Hayley (born 1985). He hobbies as a photographer on and off his film sets, and has been known to play around as a cartoonist and pop musician. His ancestry is English, and smaller amounts of Scots-Irish (Northern Irish), Irish, Swiss-German, and German.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU1NjM4MDYzMl5BMl5BanBnXkFtZTcwMjIwMjMyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000313","name":"Jeff Bridges","nicknames":["The Dude"],"idIMDB":"nm0000313"},"actorId":"nm0000313","character":"Kevin Flynn / Clu","urlCharacter":"http://www.imdb.com/character/ch0014019","main":true},{"actorName":"Bruce Boxleitner","urlProfile":"http://www.imdb.com/name/nm0000310","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MTc5OTQ0M15BMl5BanBnXkFtZTcwMjY1Mjg4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1950","placeOfBirth":" Elgin, Illinois, USA","birthName":"Bruce William Boxleitner","height":"6' 2\" (1.88 m)","bio":"As one of Hollywood's leading men, Bruce Boxleitner has starred in a major motion picture franchise, numerous feature films, several popular television series, produced a major network film and TV series, performed on Broadway, and authored two science fiction novels. Boxleitner received his formal acting training on stage. A native mid-westerner, he is an alumnus of Chicago's prestigious Goodman Theatre. In 1972, he starred in the Broadway production of Status Quo Vadis with Ted Danson. He then relocated to Los Angeles and quickly landed a guest spot on the legendary TV series The Mary Tyler Moore Show as well as numerous guest roles on series, including Hawaii 5-0, Beretta, Police Woman, and Gunsmoke. Boxleitner's big break occurred when he was cast opposite James Arness in the pilot for the epic TV series How the West Was Won. He went on to star in the CBS series Bring 'em Back Alive; mini-series East of Eden; and TV movie The Last Convertible. In 1982, Boxleitner was cast as the title role in Disney's cult film TRON which garnered him science fiction fans worldwide. However, it was in Boxleitner's four-year run for CBS's 'Scarecrow and Mrs. King', starring opposite Kate Jackson, which endeared him to fans everywhere and made him a household name. In 1994, Boxleitner joined the cast of the popular TV series Babylon 5 as John Sheridan, President of the Interstellar Alliance, a war hero-turned-diplomat at the helm of Earth Alliance Space Station in the year 2259. The show aired for five seasons. Boxleitner most recently starred with Jeff Bridges in TRON: Legacy, the popular motion picture sequel to TRON. The cast includes Garrett Hedlund and Olivia Wilde. In addition, Boxleitner reprised his role in TRON: Uprising on Disney's XD TV network, his first animated TV series. The multi-talented cast includes Elijah Wood, Mandy Moore, Lance Henriksen, and Paul Reubens. The original TRON recently celebrated its 30th anniversary. Several motion pictures include Gods and Generals with Robert Duvall, Jeff Daniels, Stephen Lang and Mira Sorvino; The Babe with John Goodman and Kelly McGillis; Kuffs with Christian Slater; and The Baltimore Bullet with James Coburn. Numerous TV movie credits include The Secret with Kirk Douglas; Perfect Family with Jennifer O'Neal and Joanna Cassidy; Double Jeopardy with Rachel Ward, Sally Kirkland and Sela Ward; Passion Flower with Barbara Hershey and Nicol Williamson; and Hallmark Channel movies, 'Love's Resounding Courage' and 'Falling in Love with the Girl Next Door'; among many others. The veteran actor has appeared in numerous recurring roles on TV series including GCB and Heroes, and has guest-starred on NCIS and Chuck, among others. A skilled horseman, Boxleitner utilized his talents in numerous Western TV series and films including Kenny Rogers television movie series that aired on CBS and NBC, starring opposite Kenny Rogers; 'Gunsmoke V: One Man's Justice' with James Arness (Arness' final film); CBS' remake of Red River with Gregory Harrison, James Arness and Laura Johnson; 'Wyatt Earp: Return to Tombstone' with Hugh O'Brian; and Down the Long Hills, based on legendary western author Louis L'Amour's novel of the same name. Boxleitner was inducted into the Hall of Great Western Performers at the National Cowboy and Western Heritage Museum in Oklahoma City in April 2012 honoring him for his illustrious career in western films. He is a two-time recipient of the Wrangler Award. In 2013, Boxleitner co-starred with Andie MacDowell and Dylan Neal in Hallmark Channel's first-ever prime-time series, Debbie Macomber's Cedar Cove to rave reviews and an average of 2 million viewers. The #1 rated cable program was renewed for a third season and is scheduled to premiere in the summer of 2015. In 1999, Boxleitner authored \"Frontier Earth\" and in 2001, its sequel \"Frontier Earth: Searcher\", published by The Berkley Publishing Group. Bruce Boxleitner resides in Los Angeles with his wife, publicist Verena King, and has three sons: Sam, Lee and Michael.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MTc5OTQ0M15BMl5BanBnXkFtZTcwMjY1Mjg4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000310","name":"Bruce Boxleitner","idIMDB":"nm0000310"},"actorId":"nm0000310","character":"Alan Bradley / Tron","urlCharacter":"http://www.imdb.com/character/ch0014020","main":true},{"actorName":"David Warner","urlProfile":"http://www.imdb.com/name/nm0001831","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMzg2Nzg1MjheQTJeQWpwZ15BbWU3MDk4Nzg0Mzg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1941","placeOfBirth":" Manchester, England, UK","height":"6' 2\" (1.88 m)","bio":"David Hattersley Warner was born July 29, 1941 in Manchester, England, to Ada Doreen (Hattersley) and Herbert Simon Warner. He has described his childhood as \"messy\". His father changed jobs often and moved from town to town. David attended eight schools and \"failed his exams at all of them\". His parents separated when he was a teenager and he only saw his mother again seven years later - on her deathbed. After a series of odd jobs, he was accepted at the Royal Academy of Dramatic Arts (RADA) where he was very unhappy. After RADA, he became a member of the Royal Shakespeare Company and got the role of Blifil in the adventure comedy Tom Jones (1963). With the title role in the comedy-drama Morgan! (1966) and a two-year stint as Hamlet with the RSC, Warner became a star at age 24. He has often played villains in such films as The Thirty-Nine Steps (1978), Time After Time (1979), Time Bandits (1981), TRON (1982) and Titanic (1997). He also appeared in Star Trek V: The Final Frontier (1989) and Star Trek VI: The Undiscovered Country (1991), two sequels to the popular Star Trek films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMzg2Nzg1MjheQTJeQWpwZ15BbWU3MDk4Nzg0Mzg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001831","name":"David Warner","idIMDB":"nm0001831"},"actorId":"nm0001831","character":"Ed Dillinger / Sark / Master Control Program","urlCharacter":"http://www.imdb.com/character/ch0014021","main":true},{"actorName":"Cindy Morgan","urlProfile":"http://www.imdb.com/name/nm0604563","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MTQ2Nzc4MF5BMl5BanBnXkFtZTgwMzA0NDU1ODE@._V1_UY44_CR9,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1954","placeOfBirth":" Chicago, Illinois, USA","birthName":"Cynthia Ann Cichorski","height":"5' 7\" (1.7 m)","bio":"Best known as \"Lacey Underall\" in Caddyshack (1980), and \"Yori\" in TRON (1982), Cindy Morgan was born Cynthia Ann Cichorski on September 29 in Chicago, Ill, not far from Wrigley Field. The daughter of a Polish factory worker and German mother, Cindy attended 12 years of Catholic school and was the first in her family to attend college. While studying communications at Northern Illinois University, Cindy spun records on the radio. A commercial station in town wanted her to report the news for them as well, and so a slight deception was needed. She used the name Cindy Morgan, taken from a story Cindy read about Morgan le Fay, when she was twelve years old. After graduation, Cindy gave all the latest meteorological news on a TV station in Rockford, Ill. She also kept her hand in radio by working the graveyard shift at a local rock station. Then she returned to Chicago and deejayed on WSDM (now WLUP). During a labor dispute at the station, she literally quit on the air and walked out with a record still spinning on the turntable. She found employment at auto shows for Fiat, which took her to both coasts. Cindy moved to Los Angeles in 1978, and became the Irish Spring girl. While she did TV commercials, she studied acting, and was rewarded with her first screen role in \"Caddyshack\", playing the role of \"Lacey Underall\", an over-amorous ingénue.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MTQ2Nzc4MF5BMl5BanBnXkFtZTgwMzA0NDU1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0604563","name":"Cindy Morgan","idIMDB":"nm0604563"},"actorId":"nm0604563","character":"Lora / Yori","urlCharacter":"http://www.imdb.com/character/ch0014022","main":true},{"actorName":"Barnard Hughes","urlProfile":"http://www.imdb.com/name/nm0400464","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTI3MTUzNjg3NV5BMl5BanBnXkFtZTcwNDE2NDAxMw@@._V1_UY44_CR19,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1915","placeOfBirth":" Bedford Hills, New York, USA","birthName":"Barnard Aloysius Kiernan Hughes","bio":"Emmy and Tony Award-winner Barnard Hughes forged a career as one of American's most successful character actors, equally at home and successful on stage, the silver screen, and television. Most of his success came after middle-age. He made his Broadway debut in 1939 in Mary McCarthy's \"Please, Mrs. Garibaldi\", a flop that lasted only four performances. He appeared in another 22 Broadway shows, his last being Noël Coward's \"Waiting in the Wings, which closed in the year 2000. His Broadway career lasted spanned 61 years and eight decades. Along the way, he won the 1978 Tony Award as best Actor in a play for Da (1988), his most famous role, which also brought him the Drama Desk Award as Outstanding Actor in a Play. (He won a lifetime achievement Drama Desk Award in 2000.) He also was nominated for a Tony Award for Best Featured Actor in a Play in 1973 for Much Ado About Nothing (1973), which was fitting, as it was in Shakespeare repertory that he honed his craft. Hughes was born Bernard Aloysius Kiernan Hughes on July 16, 1915, in Bedford Hills, New York, to Irish immigrants Marcella \"Madge\" (Kiernan) and Owen Hughes. Bedford Hills is a hamlet lying 41 miles north of the heart of Broadway in Times Square (He changed the spelling of his Christian name on the advice of a numerologist; thespians are very superstitious). After graduating from the La Salle Academy and attending Manhattan College, he joined New York City's Shakespeare Fellowship Repertory Co. He was a member of the company for two years. He did not actually appear on Broadway in Shakespeare until 1964, when he played Marcellus to Richard Burton's Hamlet (1964). Off-Broadway, he played Polonius to Stacy Keach's Obie Award-winning Hamlet in 1972. His only other Shakespearean turn on the boards of the Great White Way was as Dogberry in \"Much Ado About Nothing\" in the 1972-73 season, which brought him his first Tony nomination. Off-Broadway, he also appeared as the Chorus in \"Pericles, Prince of Tyre\" and Sir John Falstaff in \"The Merry Wives of Windsor\". Back on Broadway, his most prominent role other than \"Da\" (which he also played in the roadshow tour) was as the Old Man opposite Alec Baldwin in Prelude to a Kiss (1992). Hughes had a 54 year-long screen career, equally adept in television as in movies. He was a regular on the soap opera Guiding Light (1952) from 1961-66. Though Hughes was a highly effective dramatic actor, he had a flair for comedy and appeared on such sit-coms as _\"The Phil Silvers Show\" (TV series) and _\"Car 54, Where Are You?\" (1962)_ before having recurring roles on \"All In the Family\" (1971) as a priest and on The Bob Newhart Show (1972) as Bob's father in the 1970s. He eventually headlined his own sit-com in the mid '70s, Doc (1975), which had a successful first season but was canceled early into its second after the network demanded changes to boost ratings. Instead, the ratings sank. His break-through performance in the movies arguably was a the messianic doctor who was a victim of malpractice and turned avenger in Paddy Chayefsky's The Hospital (1971) in 1971. It came two years after a small but memorable part in Best Picture Oscar winner Midnight Cowboy (1969), as he middle-aged gay mamma's boy who picks up self-styled \"hustler\" Joe Buck with disastrous consequences. Hughes married actress Helen Stenborg in 1950 and they remained married until his death on July 11, 2006, five days before what would have been his 91st birthday. The couple had two children, theatrical director Doug Hughes (who was also a Tony-winner) and a daughter, actress Laura Hughes.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTI3MTUzNjg3NV5BMl5BanBnXkFtZTcwNDE2NDAxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0400464","name":"Barnard Hughes","idIMDB":"nm0400464"},"actorId":"nm0400464","character":"Dr. Walter Gibbs / Dumont","urlCharacter":"http://www.imdb.com/character/ch0014024","main":true},{"actorName":"Dan Shor","urlProfile":"http://www.imdb.com/name/nm0794890","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MjExMTkxMV5BMl5BanBnXkFtZTcwMjg5MzkxOA@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 November 1956","placeOfBirth":" New York City, New York, USA","bio":"Dan Shor was born on November 16, 1956 in New York City, New York, USA. He is an actor and director, known for Bill & Ted's Excellent Adventure (1989), TRON (1982) and Air Force One (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MjExMTkxMV5BMl5BanBnXkFtZTcwMjg5MzkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0794890","name":"Dan Shor","idIMDB":"nm0794890"},"actorId":"nm0794890","character":"Ram / Popcorn Co-Worker","urlCharacter":"http://www.imdb.com/character/ch0098201","main":true},{"actorName":"Peter Jurasik","urlProfile":"http://www.imdb.com/name/nm0432867","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMDkwNDU0Ml5BMl5BanBnXkFtZTcwNDk2MDcyNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1950","placeOfBirth":" Queens, New York, USA","height":"5' 10½\" (1.79 m)","bio":"Peter Jurasik began his professional career as a stage actor working in off Broadway productions in New York and later in tours and regional theaters up and down the east coast. In 1975, he moved to Los Angeles beginning a twenty five year run as a character actor continuing to act on stage, but additionally working in feature films, in nightclubs doing comedy and especially on television with hundreds of TV appearances in both comedies and dramas. Audiences seem to remember him best for his work on 'Hill Street Blues' as Sid and later in 'Babylon 5' as Londo. He has received awards for his work on both of these shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMDkwNDU0Ml5BMl5BanBnXkFtZTcwNDk2MDcyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0432867","name":"Peter Jurasik","idIMDB":"nm0432867"},"actorId":"nm0432867","character":"Crom","urlCharacter":"http://www.imdb.com/character/ch0014023","main":true},{"actorName":"Tony Stephano","urlProfile":"http://www.imdb.com/name/nm0826886","urlPhoto":"","biography":{"birthName":"Stuart Thomas","bio":"Tony may have had a short career in films, but he is well-remembered for his roles in \"The Reincarnation of Peter Proud\" (1975) and \"Tron\" (1982). In the first of his movies, he shows off his exceptional physique. Tony was a successful fashion model in his younger years. His ruggedly handsome good looks made him easy to notice and hard to forget on film. Although he retired from films while still in his thirties, fans will long remember him.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0826886","name":"Tony Stephano","idIMDB":"nm0826886"},"actorId":"nm0826886","character":"Peter / Sark's Lieutenant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Craig Chudy","urlProfile":"http://www.imdb.com/name/nm0161009","urlPhoto":"","biography":{"dateOfBirth":"21 October 1937","placeOfBirth":" Chicago, Illinois, USA","birthName":"Craig Warren Chudy","bio":"Craig Chudy was born on October 21, 1937 in Chicago, Illinois, USA as Craig Warren Chudy. He is known for his work on TRON (1982), Billie (1965) and The Other Side of the Mountain: Part II (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0161009","name":"Craig Chudy","idIMDB":"nm0161009"},"actorId":"nm0161009","character":"Warrior #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vince Deadrick Jr.","urlProfile":"http://www.imdb.com/name/nm0212604","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwOTIyMzQyNF5BMl5BanBnXkFtZTgwNzQzNDEzMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1954","placeOfBirth":" USA","birthName":"Vincent Paul Deadrick Jr.","bio":"Vince Deadrick Jr. was born on September 14, 1954 in the USA as Vincent Paul Deadrick Jr. He is known for his work on Titanic (1997), Iron Man (2008) and The Big Lebowski (1998). He is married to Irena Deadrick.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwOTIyMzQyNF5BMl5BanBnXkFtZTgwNzQzNDEzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0212604","name":"Vince Deadrick Jr.","idIMDB":"nm0212604"},"actorId":"nm0212604","character":"Warrior #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sam Schatz","urlProfile":"http://www.imdb.com/name/nm0770230","urlPhoto":"","biography":{"bio":"Sam Schatz is an actor, known for TRON (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0770230","name":"Sam Schatz","idIMDB":"nm0770230"},"actorId":"nm0770230","character":"Expert Disc Warrior","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jackson Bostwick","urlProfile":"http://www.imdb.com/name/nm0098311","urlPhoto":"","biography":{"dateOfBirth":"23 October 1943","placeOfBirth":" Carlisle, Pennsylvania, USA","birthName":"Jackson Leonard Bostwick Jr.","bio":"Jackson Bostwick was born on October 23, 1943 in Carlisle, Pennsylvania, USA as Jackson Leonard Bostwick Jr. He is an actor and producer, known for TRON (1982), Escape from DS-3 (1981) and Suitable for Murder (2008). He has been married to Elizabeth Lamont since March 2002. They have one child. He was previously married to Kelly Nyman and Sheryl Williamson.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0098311","name":"Jackson Bostwick","idIMDB":"nm0098311"},"actorId":"nm0098311","character":"Head Guard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David S. Cass Sr.","urlProfile":"http://www.imdb.com/name/nm0003180","urlPhoto":"","biography":{"birthName":"David S. Cass","height":"6' 4\" (1.93 m)","bio":"Cass began his career in the motion picture industry as an extra - but soon he was alternating between acting parts and stunt work. The stunt work eventually prevailed and Cass went on to become one of Hollywood's top stunt co-ordinators and Second Unit Directors. This led to his producing several films which, in turn, led to first-unit directing. Dave has co-produced Miramax Films' Texas Rangers (2001); a trio of Burt Reynolds' TV movies titled Hard Time (1998), for the TNT network - writing one episode, and directing another, Hard Time: The Premonition (1999). He has also co-written several other films including Enter the Devil (1972) and Hard Ground (2003). Dave was the director of The Hallmark Channel's mini-series, Johnson County War (2002), another take on the infamous Wyoming cattle wars, this one an adaptation by Larry McMurtry. Cass has directed two Gentle Ben TV movies, plus Night of the Wolf (2002), starring Anne Archer and Robert Urich, for Animal Planet. And from Hallmark, again, David directed a city girl/country boy love story, Straight from the Heart (2003), which garnered the highest ratings ever for a Hallmark Channel TV Movie.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0003180","name":"David S. Cass Sr.","idIMDB":"nm0003180"},"actorId":"nm0003180","character":"Factory Guard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gerald Berns","urlProfile":"http://www.imdb.com/name/nm0076954","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDAzODM0MjU4NV5BMl5BanBnXkFtZTcwNTE4NDI1NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Born in Boston, Gerald Berns is a graduate of the University of Rhode Island. A resident actor with The Boston Repertory Theatre for 5 years, Mr. Berns appeared in over 20 stage productions, starring in the world premieres of Harry Nilsson's musical, \"The Point\" - creating the role of \"The Rockman\" - and Kurt Vonnegut Jr.'s \"Player Piano\" - creating the role of \"Kroner\". Mr.Berns has appeared in many television shows, commercials, and feature films. His character in \"Beverly Hills Cop\" was satirized in MAD Magazine. On stage in Los Angeles Mr. Berns was seen in \"Outward Bound\", a production at the Hudson Backstage, and at Ojai's Theatre 150 in \"True West\" by Sam Shepard, a production Mr. Shepard attended and called \"one of the best productions\" of the play he'd seen; of Mr.Berns' work, Mr. Shepard described it as \"Good, really good.\" Also a screenwriter, Mr. Berns has been represented by the William Morris Agency and Paradigm. In 2015, entering USA Film Festivals, four of his screenplays, some co-written, won multiple Awards.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDAzODM0MjU4NV5BMl5BanBnXkFtZTcwNTE4NDI1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0076954","name":"Gerald Berns","idIMDB":"nm0076954"},"actorId":"nm0076954","character":"Guard #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bob Neill","urlProfile":"http://www.imdb.com/name/nm0624727","urlPhoto":"","biography":{"bio":"Bob Neill is known for his work on Memento (2000), TRON (1982) and Red Planet (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0624727","name":"Bob Neill","idIMDB":"nm0624727"},"actorId":"nm0624727","character":"Guard #2","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0084827","urlIMDB":"http://www.imdb.com/title/tt0084827","business":{"budget":{"money":"$17,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$4,761,795","country":"USA","day":"11","month":"07","year":"1982","remarks":""}],"gross":[{"money":"$26,918,576","country":"USA","day":"12","month":"09","year":"1982","remarks":""},{"money":"$26,061,388","country":"USA","day":"06","month":"09","year":"1982","remarks":""},{"money":"$24,502,847","country":"USA","day":"29","month":"08","year":"1982","remarks":""},{"money":"$23,083,205","country":"USA","day":"22","month":"08","year":"1982","remarks":""},{"money":"$21,533,207","country":"USA","day":"15","month":"08","year":"1982","remarks":""},{"money":"$20,411,730","country":"USA","day":"08","month":"08","year":"1982","remarks":""},{"money":"$18,076,682","country":"USA","day":"01","month":"08","year":"1982","remarks":""},{"money":"$15,439,075","country":"USA","day":"25","month":"07","year":"1982","remarks":""},{"money":"$11,008,899","country":"USA","day":"18","month":"07","year":"1982","remarks":""},{"money":"$4,761,795","country":"USA","day":"11","month":"07","year":"1982","remarks":""}],"weekendGross":[{"money":"$341,767","country":"USA","day":"12","month":"09","year":"1982","remarks":"150 Screens"},{"money":"$1,161,388","country":"USA","day":"06","month":"09","year":"1982","remarks":"541 Screens"},{"money":"$900,000","country":"USA","day":"15","month":"08","year":"1982","remarks":"380 Screens"},{"money":"$1,190,254","country":"USA","day":"08","month":"08","year":"1982","remarks":"502 Screens"},{"money":"$1,198,339","country":"USA","day":"01","month":"08","year":"1982","remarks":"650 Screens"},{"money":"$2,200,282","country":"USA","day":"25","month":"07","year":"1982","remarks":"842 Screens"},{"money":"$1,006,255","country":"USA","day":"25","month":"07","year":"1982","remarks":"436 Screens"},{"money":"$815,860","country":"USA","day":"18","month":"07","year":"1982","remarks":"372 Screens"},{"money":"$3,646,192","country":"USA","day":"18","month":"07","year":"1982","remarks":""},{"money":"$4,761,795","country":"USA","day":"11","month":"07","year":"1982","remarks":""}],"admissions":[{"money":"514,545","country":"West","day":null,"month":null,"year":null,"remarks":null}],"productionDates":{"money":null,"country":null,"day":"20","month":"04","year":"1981","remarks":null},"filmingDates":[null,null],"copyrightHolder":"© Copyright - MCMLXXXII - Walt Disney Productions"},"technical":{"runtime":["1 hr 36 min (96 min)"],"soundMix":["70 mm 6-Track (70 mm prints)","Dolby (35 mm prints)"],"color":["Color"],"aspectRatio":["2.20 : 1 (70 mm prints)","2.35 : 1"],"camera":["Panavision 65mm","Panavision Cameras and Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":["2,620 m (Sweden)"],"negativeFormat":["35 mm (also horizontal)","65 mm"],"cinematographicProcess":["Panavision (anamorphic) (some live-action scenes)","Super Panavision 70 (live-action scenes)","VistaVision (computer graphics scenes)"],"printedFilmFormat":["35 mm","70 mm"]},"rating":"6.8","filmingLocations":[{"location":"1150 S Olive St, Los Angeles, California, USA"}],"rated":"PG","awards":[{"award":"Academy Awards, USA 1983","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Costume Design","names":[{"name":"Elois Jenssen","id":"nm0421784","role":null},{"name":"Rosanna Norton","id":"nm0636287","role":null}]},{"category":"Best Sound","names":[{"name":"Michael Minkler","id":"nm0591444","role":null},{"name":"Bob Minkler","id":"nm0591440","role":null},{"name":"Lee Minkler","id":"nm0591443","role":null},{"name":"James LaRue","id":"nm0489341","role":null}]}]}]},{"award":"BAFTA Awards 1983","titlesAwards":[{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best Special Visual Effects","names":[{"name":"Richard Taylor","id":"nm0853053","role":null},{"name":"Harrison Ellenshaw","id":"nm0254001","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1983","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best Costumes","names":[{"name":"Elois Jenssen","id":"nm0421784","role":null},{"name":"Rosanna Norton","id":"nm0636287","role":null}]}]},{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Science Fiction Film","names":[]},{"category":"Best Animated Film","names":[]}]}]},{"award":"DVD Exclusive Awards 2003","titlesAwards":[{"titleAwardOutcome":"Nominated DVD Premiere Award","categories":[{"category":"Best Overall New Extra Features, Library Release","names":[{"name":"Jeff Kurtti","id":"nm1126487","role":null},{"name":"Michael Pellerin","id":"nm1212309","role":null}]},{"category":"Original Retrospective Documentary, Library Release","names":[{"name":"Robert Meyer Burnett","id":"nm0122428","role":null}]}]}]},{"award":"Guinness World Record Award 1982","titlesAwards":[{"titleAwardOutcome":"Won Guinness World Record","categories":[{"category":"First Use of Computer-Generated Animation","names":[{"name":"Steven Lisberger","id":"nm0513974","role":"director"}]}]}]},{"award":"Young Artist Awards 1983","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Family Feature - Animated, Musical or Fantasy","names":[]}]}]}],"votes":"97,388","type":"Movie","companyCreditsSimple":[{"idCompany":"co0098836","name":"Walt Disney Productions"},{"idCompany":"co0021144","name":"Lisberger/Kushner"}],"keywords":{"keywords":["computer","arcade","computer hacker","security","escape","computer program","laser","computer programmer","cyberspace","alter ego","kiss","futuristic tank","computer world","gladiatorial combat","first part","computer animation","alternate reality","los angeles california","ceo","revenge","super computer","army","destiny","psychotronic","fish out of water","1980s","female gladiator","reluctant hero","female warrior","warrior","survival","battle","fictional war","social commentary","fight the system","unlikely hero","one word title","superhero","experimental technology","no opening credits","subjective camera","brain in a vat","time lapse photography","stabbed in the head","bug","ship","exploding ship","punched in the face","falling from height","tower","water","canyon","exploding tank","missile","character's point of view camera shot","lightcycle","falling to death","fight to the death","office","cubicle","reference to santa claus","software engineer","boyfriend girlfriend relationship","ex boyfriend ex girlfriend relationship","bare chested male","exploding body","high tech","race","character repeating someone else's dialogue","oppression","on the run","title appears in writing","inside a computer","megacorporation","tank","allegory","visual metaphor","technology gone amok","fraud","forced perspective","dethronement","binary code","virtual set","surrealism","jai alai","inspired by logo","electronic music score","chase","maze","labyrinth","discus","cult film","alternate dimension","video arcade","popcorn","orange","helicopter","cyberpunk","virtual reality","frisbee","computer cracker","electronic music","artificial intelligence","teleportation","human versus computer","gladiator","part animation","part computer animation","death of friend","title spoken by character","character name in title","surprise ending","giant"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 16:16:04"}}