{"data":{"movies":[{"title":"Yes, Giorgio","originalTitle":"","year":"1982","releaseDate":"19820924","directors":[{"name":"Franklin J. Schaffner","id":"nm0769874"}],"writers":[{"name":"Anne Piper","id":"nm0684872"},{"name":"Norman Steinberg","id":"nm0825799"}],"runtime":"110 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNDgzOTE0NF5BMl5BanBnXkFtZTYwODI3Mzk5._V1.jpg","countries":["USA"],"languages":["English","Italian"],"genres":["Comedy","Musical"],"plot":"A famous opera singer, Giorgio Fini, loses his voice during an American tour. He goes to a female throat specialist, Pamela Taylor, whom he falls in love with.","simplePlot":"A famous opera singer, Giorgio Fini, loses his voice during an American tour. He goes to a female throat specialist, Pamela Taylor, whom he falls in love with.","actors":[{"actorName":"Luciano Pavarotti","urlProfile":"http://www.imdb.com/name/nm0667556","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzk0MTM2OV5BMl5BanBnXkFtZTcwODYyMjUxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 October 1935","placeOfBirth":" Modena, Emilia-Romagna, Italy","height":"5' 10¾\" (1.8 m)","bio":"Luciano Pavarotti was the best-selling classical singer and humanitarian known for his most original and popular performances with the 'Three Tenors' and 'Pavarotti & Friends'. He was born on October 12, 1935, in Modena, Emilia-Romagna, in Northern Italy. He was the first child and only son of two children in the family of a baker. His father, Fernando Pavarotti, was a gifted amateur tenor, who instilled a love for music and singing in young Luciano. His mother, Adele Venturi, worked at the local cigar factory. Young Pavarotti showed many talents. He first sang with his father in the Corale Rossi, a male choir in Modena, and won the first prize in an international choir competition in Wales, UK. He also played soccer as a goalkeeper for his town's junior team. In 1954, at the age of 19, Pavarotti decided to make a career as a professional opera singer. He took serious study with professional tenor Arrio Pola, who discovered that Pavarotti had perfect pitch, and offered to teach him for free. After six years of studies, he had only a few performances in small towns without pay. At that time Pavarotti supported himself working as a part-time school teacher and later an insurance salesman. In 1961 he married his girlfriend, singer Adua Veroni, and the couple had three daughters. Pavarotti made his operatic debut on April 29, 1961, as Rodolfo in La Boheme by Giacomo Puccini, at the opera house in Reggio Emilia. In the following years he relied on the professional advise from tenor Giuseppe Di Stefano, who prevented Pavarotti from appearances when his voice was not ready yet. Eventually Pavarotti stepped in for Di Stefano in 1963, at the Royal Opera House in London as 'Rodolfo' in La Boheme by Giacomo Puccini, making his international debut. That same year he met soprano Joan Sutherland and the two began one of the most legendary partnerships in vocal history; Pavarotti made his American debut opposite Sutherland in February of 1965, in Miami Opera. Pavarotti was blessed with a voice of a rare range, beauty and clarity, which was best during the 60s, 70s and 80s. In 1966 he became the first opera tenor to hit all nine \"high C's\" with his full voice in the aria 'Quel destin' in 'La Fille du Regiment' (aka.. The Daughter of the Regiment) by Gaetano Donizetti. He repeated this feat in his legendary 1972 Met performance and was nicknamed \"King of the High C's\" in rave reviews. Pavarotti's popularity was arguably bigger than that of any other living tenor in the world. His 1993 live performance in the New York's Central Park was attended by 500,000 fans while millions watched it on television. During the 1990s and 2000s Pavarotti was still showing his ability to deliver his clear ringing tone in the higher register, albeit in fewer performances. Luciano Pavarotti was known for his humanitarian work. He was the founder and the host of the 'Pavarotti & Friends' annual charity concerts and related activities in Modena, Italy. There he sang with international stars of all styles to raise funds for several worthy UN causes. Pavarotti sang with Bono and U2 in the 1995 song Miss Sarajevo and raised $1,500,000 in his charity project 'Concert for Bosnia'. He also established and financed the Pavarotti Music Center in Bosnia, and raised funds in charity concerts for refugees from Afghanistan and for refugees from Kosovo. Pavarotti made two Guinness World Records: one was for receiving the most curtain calls at 165; and the other was for the best selling classical album of 'The Three Tenors in Concert' with Plácido Domingo and José Carreras. In March 2004 Pavarotti gave his last performance in an opera as the painter Mario Cavaradossi in Giacomo Puccini's 'Tosca' at the New York Metropolitan Opera. In 2005 Luciano Pavarotti started a 40 city farewell tour. He sang his signature aria 'Nessun Dorma' from 'Turandot' by Giacomo Puccini, at the 2006 Winter Olympics opening ceremony in Turin, Italy, on February 10, 2006. Pavarotti survived an emergency surgery for pancreatic cancer. His remaining appearances for 2006 have been canceled. However, his management anticipated that his farewell tour would resume in 2007. Luciano Pavarotti died of kidney failure on September 6, 2007, at home in Modena, Italy, where he was surrounded by his family. He was laid to rest with his parents in the family tomb in Montale Rangone cemetery near Modena. His funeral ceremony in Modena was an international event attended by celebrities and over fifty thousand music lovers from all over the world.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzk0MTM2OV5BMl5BanBnXkFtZTcwODYyMjUxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0667556","name":"Luciano Pavarotti","nicknames":["Lucianone","Big Luciano","The King of the High C's","Big P"],"idIMDB":"nm0667556"},"actorId":"nm0667556","character":"Giorgio Fini","urlCharacter":"http://www.imdb.com/character/ch0387972","main":true},{"actorName":"Kathryn Harrold","urlProfile":"http://www.imdb.com/name/nm0002130","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NDY0MjkzNV5BMl5BanBnXkFtZTYwMzQ2MDE3._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 August 1950","placeOfBirth":" Tazewell, Virginia, USA","birthName":"Kathryn Hunter Harrold","height":"5' 9\" (1.75 m)","bio":"Kathryn Harrold was born on August 2, 1950 in Tazewell, Virginia, USA as Kathryn Hunter Harrold. She is an actress, known for Raw Deal (1986), The Hunter (1980) and Modern Romance (1981).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NDY0MjkzNV5BMl5BanBnXkFtZTYwMzQ2MDE3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002130","name":"Kathryn Harrold","nicknames":["Kitty"],"idIMDB":"nm0002130"},"actorId":"nm0002130","character":"Pamela Taylor","urlCharacter":"http://www.imdb.com/character/ch0387973","main":true},{"actorName":"Eddie Albert","urlProfile":"http://www.imdb.com/name/nm0000734","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNjIwNzE0OV5BMl5BanBnXkFtZTYwNzc0MTQ2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 April 1906","placeOfBirth":" Rock Island, Illinois, USA","birthName":"Edward Albert Heimberger","height":"5' 11\" (1.8 m)","bio":"A graduate of the University of Minnesota, Eddie Albert was a circus trapeze flier before becoming a stage and radio actor. He made his film debut in 1938 and has worked steadily since, often cast as the friendly, good-natured buddy of the hero but occasionally being cast as a villain; one of his most memorable roles was as the cowardly, glory-seeking army officer in Robert Aldrich's World War 2 film, Attack (1956).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNjIwNzE0OV5BMl5BanBnXkFtZTYwNzc0MTQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000734","name":"Eddie Albert","idIMDB":"nm0000734"},"actorId":"nm0000734","character":"Henry Pollack","urlCharacter":"http://www.imdb.com/character/ch0387974","main":true},{"actorName":"Paola Borboni","urlProfile":"http://www.imdb.com/name/nm0095979","urlPhoto":"","biography":{"dateOfBirth":"1 January 1900","placeOfBirth":" Golese di Parma, Emilia-Romagna, Italy","bio":"Paola Borboni was born on January 1, 1900 in Golese di Parma, Emilia-Romagna, Italy. She was an actress, known for Roman Holiday (1953), I Vitelloni (1953) and Between Miracles (1971). She was married to Bruno Vilar. She died on April 9, 1995 in Bodio Lomnago, Lombardy, Italy.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0095979","name":"Paola Borboni","idIMDB":"nm0095979"},"actorId":"nm0095979","character":"Sister Theresa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Hong","urlProfile":"http://www.imdb.com/name/nm0393222","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0MTQxOTA4MF5BMl5BanBnXkFtZTgwODE1OTcyMjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1929","placeOfBirth":" Minneapolis, Minnesota, USA","height":"5' 10\" (1.78 m)","bio":"James Hong was born in Minneapolis, Minnesota, USA. He studied civil engineering at the University of Minnesota, but at some point along the way became interested in acting. He graduated from the University of Southern California and practiced for 1½ years as a road engineer with the County of Los Angeles. He took sick leaves and vacation time to do films. He finally quit engineering to focus on acting full time. He is one of the founders of the East-West Players, the oldest Asian American theater in Los Angeles. He served as president and charter member of the Association of Asian Pacific American Artists. Hong is one of the most prolific and well-recognized Asian-American character actors of movies and television. He currently lives in Los Angeles and is planning to produce and direct his own films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0MTQxOTA4MF5BMl5BanBnXkFtZTgwODE1OTcyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0393222","name":"James Hong","nicknames":["Jimmy"],"idIMDB":"nm0393222"},"actorId":"nm0393222","character":"Kwan","urlCharacter":"http://www.imdb.com/character/ch0256358","main":true},{"actorName":"Beulah Quo","urlProfile":"http://www.imdb.com/name/nm0704511","urlPhoto":"","biography":{"dateOfBirth":"17 April 1923","placeOfBirth":" Stockton, California, USA","height":"5' 3\" (1.6 m)","bio":"Beulah Quo was born on April 17, 1923 in Stockton, California, USA. She is known for her work on General Hospital (1963), Chinatown (1974) and Brokedown Palace (1999). She was married to Edwin Qwoh. She died on October 23, 2002 in La Mesa, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0704511","name":"Beulah Quo","idIMDB":"nm0704511"},"actorId":"nm0704511","character":"Mei Ling","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Norman Steinberg","urlProfile":"http://www.imdb.com/name/nm0825799","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NzM4MDM1NV5BMl5BanBnXkFtZTgwOTg3MDE0NzE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 June 1939","placeOfBirth":" Brooklyn, New York, USA","bio":"Norman Steinberg was born on June 6, 1939 in Brooklyn, New York, USA. He is a producer and writer, known for Blazing Saddles (1974), My Favorite Year (1982) and Johnny Dangerously (1984).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NzM4MDM1NV5BMl5BanBnXkFtZTgwOTg3MDE0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0825799","name":"Norman Steinberg","idIMDB":"nm0825799"},"actorId":"nm0825799","character":"Dr. Barmen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rod Colbin","urlProfile":"http://www.imdb.com/name/nm0170314","urlPhoto":"","biography":{"dateOfBirth":"23 December 1923","placeOfBirth":" New Haven, Connecticut, USA","bio":"Rod Colbin was born on December 23, 1923 in New Haven, Connecticut, USA. He was an actor, known for Frances (1982), The Edge of Night (1956) and John Hus (1977). He was married to Annemarie. He died on February 4, 2007 in Denver, Colorado, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0170314","name":"Rod Colbin","idIMDB":"nm0170314"},"actorId":"nm0170314","character":"Ted Mullane","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kathryn Fuller","urlProfile":"http://www.imdb.com/name/nm0298276","urlPhoto":"","biography":{"dateOfBirth":"5 June 1922","placeOfBirth":" Delaware, Ohio, USA","birthName":"Kathryn Eagon","bio":"Kathryn Fuller of La Cañada Flintridge, actress and member of the Screen Actors Guild (SAG/AFTRA) and Actors' Equity Association (AEA) -- who was affectionately known to her family as \"America's Favorite Actress\" -- passed away peacefully at home on May 24, 2012, due to natural causes. She was 89. Services and interment were conducted May 31, 2012, at Mountain View Chapel in Altadena. Kathryn was born on June 5, 1922, in Delaware, Ohio to Gilbert and Ruth Eagon. She earned a degree in Theatre Arts from Ohio Wesleyan University. There, during the Second World War, she met her future husband, Mark H. Fuller, who was then enrolled in the U.S. Navy V-12 Unit at Ohio Wesleyan. They were married in July, 1945, at Christ Church in New York City. Following the War, Kathryn and Mark resided in California; they lived in Altadena, Arcadia, South Pasadena, and then for 52 years in La Cañada Flintridge. Kathryn began a professional acting career with performances at the Pasadena Playhouse, Theatre Americana (Altadena), and Glendale Centre Theatre. Eventually she would make many appearances on television, in films and on stage. She was a gifted actress, director and writer -- but Kathryn will also be remembered as a loving wife and mother, with four sons and two daughters. She managed a busy household that often included extended family members. For over 40 years, Kathryn and her family were active members of Holliston United Methodist Church; she taught preschool at Holliston's Merryland Nursery School. She volunteered in her community, reading books at local schools and directing theater for non-profits -- such as Foothill Service Club for The Blind, where she directed a play cast entirely with blind actors. In over 50 years of work, Kathryn influenced the careers of fellow actors and touched the hearts of many. In 1962, she was a co-founder of Studio Theatre Playhouse in Los Angeles, which today remains a venue for new theatrical talent. As a playwright, she authored: \"Lightning in the South\" (from the life of Mary Todd Lincoln) and co-authored \"Lutie\" (a comedic romp set in New Orleans). Both premiered at Glendale Centre Theatre. Her many performances with The Colony at Studio Theatre Playhouse included: Terrence Shank's adaptation of John Steinbeck's \"The Grapes of Wrath\", Eugene O'Neill's \"Long Day's Journey into Night,\" and the world stage premier of Ray Bradbury's \"The Martian Chronicles.\" When \"The Grapes of Wrath\" was picked up by the Louisville Regional Equity Theatre, Kathryn was cast in the featured role of \"Mama\" for an extended run. On television, Kathryn's recurring roles included Mabel Cummings in \"Days of Our Lives,\" Mrs. Shellenback on \"Happy Days,\" and Mrs. McGregor on \"Valerie's Family.\" Numerous other appearances included \"Laverne & Shirley,\" \"Little House on the Prairie,\" \"Highway to Heaven,\" \"Remington Steele,\" and \"Newhart\". Her favorite motion picture role was that of Faye Kennedy in \"Yes, Georgio\" co-starring with Luciano Pavarotti. Kathryn is preceded in death by her parents and her sister Sue Jacobs. She is survived by her husband Mark; sister Meredith Rode and brother Richard Eagon; children, Mike (Tina), Elin Alto (John), Scott (Susanne), Tim (Gail), Babette Coverdale (John) and Matt (Shyrlee), eight grandchildren and three great-grandchildren. She is loved and missed by all.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0298276","name":"Kathryn Fuller","idIMDB":"nm0298276"},"actorId":"nm0298276","character":"Faye Kennedy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joseph Mascolo","urlProfile":"http://www.imdb.com/name/nm0556217","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NDk2NDUxMl5BMl5BanBnXkFtZTYwODgzMjU0._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 March 1929","placeOfBirth":" West Hartford, Connecticut, USA","height":"6' 1\" (1.85 m)","bio":"Joseph has dark brown hair and brown eyes. He plays the clarinet, and he played with the Metropolitan Opera in N.Y.C for two years. He does charity work for handicapped people, and the people from Ocilla, Georgia appreciated his work so much that they had one-mile street named after him. His hobbies are reading, tennis, and gardening.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NDk2NDUxMl5BMl5BanBnXkFtZTYwODgzMjU0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0556217","name":"Joseph Mascolo","idIMDB":"nm0556217"},"actorId":"nm0556217","character":"Dominic Giordano","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karen Kondazian","urlProfile":"http://www.imdb.com/name/nm0464875","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MDgxMzYyOF5BMl5BanBnXkFtZTcwNTM4NDc3OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1950","placeOfBirth":" Boston, Massachusetts, USA","height":"5' 4\" (1.63 m)","bio":"Karen Kondazian's career as an actor started at the age of eight when she was chosen to be one of the infamous children on Art Linkletter's \"Kids Say the Darndest Things.\" The opportunity to miss school during tapings was all it took for Karen to abandon her life's goal of becoming a spy and focus on acting. She was born in Boston, attended The University of Vienna and The London Academy of Music and Dramatic Arts, after which she began her acting career in New York. Her first professional work was in Michael Cacoyannis' \"The Trojan Women.\" She later won the LA Drama Critics Circle Award for Tennessee Williams' \"The Rose Tattoo.\" Williams, after seeing her work in Tattoo, was so impressed that he gave her carte blanche to produce any of his plays in his lifetime. Her other award-winning performances of Williams include \"Sweet Bird of Youth\" (with Ed Harris) and \"Vieux Carre.\" At the Fountain Theatre, Kondazian has starred in Williams' \"Orpheus Descending,\" \"Night of the Iguana,\" and \"Milk Train Doesn't Stop Here Anymore...\" plus Maria Callas in Terrence McNally's \"Master Class.\" On television, she appeared as a series regular lead in CBS's \"Shannon,\" and guest starred in over 50 television shows and films including: \"James Dean\" (with James Franco) and \"Yes Giorgio\" (with Luciano Pavarotti). She is a lifetime member of the Actors Studio. Kondazian is also a multi-award winning novelist. Her debut novel, \"The Whip,\" based on a true story, won a USA News Book Award, among others.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MDgxMzYyOF5BMl5BanBnXkFtZTcwNTM4NDc3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0464875","name":"Karen Kondazian","idIMDB":"nm0464875"},"actorId":"nm0464875","character":"Francesca Giordano","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leona Mitchell","urlProfile":"http://www.imdb.com/name/nm0593528","urlPhoto":"","biography":{"dateOfBirth":"13 October 1949","placeOfBirth":" Enid, Oklahoma, USA","bio":"Leona Mitchell was born on October 13, 1949 in Enid, Oklahoma, USA. She is an actress, known for Turandot (1987), Yes, Giorgio (1982) and Carmen (1987). She has been married to Elmer Bush since 1980. They have one child.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0593528","name":"Leona Mitchell","idIMDB":"nm0593528"},"actorId":"nm0593528","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kurt Adler","urlProfile":"http://www.imdb.com/name/nm0012195","urlPhoto":"","biography":{"dateOfBirth":"2 April 1905","placeOfBirth":" Vienna, Austria-Hungary [now Austria]","birthName":"Kurt Herbert Adler","bio":"Kurt Adler was born on April 2, 1905 in Vienna, Austria-Hungary as Kurt Herbert Adler. He died on February 9, 1988 in Ross, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0012195","name":"Kurt Adler","idIMDB":"nm0012195"},"actorId":"nm0012195","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emerson Buckley","urlProfile":"http://www.imdb.com/name/nm0118596","urlPhoto":"","biography":{"bio":"Emerson Buckley is known for his work on Yes, Giorgio (1982), Luciano Pavarotti: Gala Concert (1987) and Pavarotti in Concert at the Madison Square Garden (1984).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0118596","name":"Emerson Buckley","idIMDB":"nm0118596"},"actorId":"nm0118596","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexander Courage","urlProfile":"http://www.imdb.com/name/nm0006021","urlPhoto":"","biography":{"dateOfBirth":"10 December 1919","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Alexander Mair Courage Jr.","bio":"Alexander Courage was born on December 10, 1919 in Philadelphia, Pennsylvania, USA as Alexander Mair Courage Jr. He is known for his work on Star Trek: The Next Generation (1987), Jurassic Park (1993) and First Contact (1996). He was married to Shirley Pumpelly. He died on May 15, 2008 in Pacific Palisades, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0006021","name":"Alexander Courage","nicknames":["Sandy"],"idIMDB":"nm0006021"},"actorId":"nm0006021","character":"Conductor, Turandot","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0084931","urlIMDB":"http://www.imdb.com/title/tt0084931","business":{"budget":{"money":"$19,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$85,000","country":"USA","day":"27","month":"09","year":"1982","remarks":"424 Screens"}],"gross":[{"money":"$1,368,588","country":"USA","day":"10","month":"10","year":"1982","remarks":""},{"money":"$668,370","country":"USA","day":"03","month":"10","year":"1982","remarks":""},{"money":"$85,000","country":"USA","day":"27","month":"09","year":"1982","remarks":""}],"weekendGross":[{"money":"$403,388","country":"USA","day":"10","month":"10","year":"1982","remarks":"420 Screens"},{"money":"$518,786","country":"USA","day":"03","month":"10","year":"1982","remarks":"424 Screens"},{"money":"$85,000","country":"USA","day":"27","month":"09","year":"1982","remarks":"424 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 50 min (110 min)"],"soundMix":["Dolby"],"color":["Color (Metrocolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["70 mm","35 mm"]},"rating":"4.2","filmingLocations":[],"rated":"PG","awards":[{"award":"Academy Awards, USA 1983","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Music, Original Song","names":[{"name":"John Williams","id":"nm0002354","role":"music"},{"name":"Alan Bergman","id":"nm0074732","role":"lyrics"},{"name":"Marilyn Bergman","id":"nm0004750","role":"lyrics"}]}]}]},{"award":"Golden Globes, USA 1983","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Original Song - Motion Picture","names":[{"name":"John Williams","id":"nm0002354","role":"music"},{"name":"Alan Bergman","id":"nm0074732","role":"lyrics"},{"name":"Marilyn Bergman","id":"nm0004750","role":"lyrics"}]}]}]},{"award":"Razzie Awards 1983","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Actor","names":[{"name":"Luciano Pavarotti","id":"nm0667556","role":null}]},{"category":"Worst Screenplay","names":[{"name":"Norman Steinberg","id":"nm0825799","role":null}]},{"category":"Worst New Star","names":[{"name":"Luciano Pavarotti","id":"nm0667556","role":null}]}]}]}],"votes":"473","type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"}],"keywords":{"keywords":["opera","comma in title","two word title","punctuation in title","based on novel","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:05:01"}}