{"data":{"movies":[{"title":"Abbott and Costello Meet Frankenstein","originalTitle":"Bud Abbott Lou Costello Meet Frankenstein","year":"1948","releaseDate":"19480615","directors":[{"name":"Charles Barton","id":"nm0059106"}],"writers":[{"name":"Robert Lees","id":"nm0498738"},{"name":"Frederic I. Rinaldo","id":"nm0727411"}],"runtime":"83 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NjIzODQ0N15BMl5BanBnXkFtZTgwMDQzNzYzMjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Fantasy","Horror","Sci-Fi"],"plot":"The world of freight handlers Wilbur Grey and Chick Young is turned upside down when the remains of Frankenstein's monster and Dracula arrive from Europe to be used in a house of horrors. Dracula awakens and escapes with the weakened monster, who he plans to re-energize with a new brain. Larry Talbot (the Wolfman) arrives from London in an attempt to thwart Dracula. Dracula's reluctant aide is the beautiful Dr. Sandra Mornay. Her reluctance is dispatched by Dracula's bite. Dracula and Sandra abduct Wilbur for his brain and recharge the monster in preparation for the operation. Chick and Talbot attempt to find and free Wilbur, but when the full moon rises all hell breaks loose with the Wolfman, Dracula, and Frankenstein all running rampant.","simplePlot":"Two hapless freight handlers find themselves encountering Dracula, the Frankenstein Monster and the Wolf Man.","actors":[{"actorName":"Bud Abbott","urlProfile":"http://www.imdb.com/name/nm0007941","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MjIzMjQzMV5BMl5BanBnXkFtZTcwMTY3NDM3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 October 1895","placeOfBirth":" Asbury Park, New Jersey, USA","birthName":"William Alexander Abbott","height":"5' 8\" (1.73 m)","bio":"Long acknowledged as one of the best \"straight men\" in the business, Bud Abbott was born William Alexander Abbott in Asbury Park, New Jersey, to Rae (Fisher) and Harry Abbott, who had both worked for the Barnum and Bailey Circus. He himself worked in carnivals while still a child and dropped out of school in 1909. He worked as assistant treasurer for the Casino Theater in Brooklyn, then as treasurer and/or manager of various theaters around the country. He worked as the straight man to such vaudeville and burlesque comics as Harry Steepe and Harry Evanson while managing the National Theater in Detroit. In 1931 while cashiering at the Brooklyn theater, he substituted for comic Lou Costello's ill straight-man. The two clicked almost immediately and formed their famous comedy team. Throughout the 1930s they worked burlesque, minstrel shows, vaudeville and movie houses. In 1938 they got national exposure through the Kate Smith radio show \"The Kate Smith Hour\", and signed with Universal Pictures the next year. They made their film debut in One Night in the Tropics (1940), and, while the team wasn't the film's stars, it made money for Universal and they got good enough notices to convince Universal to give them their own picture. Their first starring film, Buck Privates (1941), with The Andrews Sisters, grossed what was then a company-record $10 million (on a $180,000 budget) and they were on their way to stardom and a long run as the most popular comedy team in America. In 1942 they topped a poll of Hollywood stars. They had their own radio show (ABC, 1941-6, NBC, 1946-9) and TV show (The Abbott and Costello Show (1952)). After the war their careers stalled and the box-office takes for their films started slipping. However, they made a big comeback in Abbott and Costello Meet Frankenstein (1948), which raked in huge profits and even got the team good notices from critics who normally wouldn't even review their films. The movie's success convinced Universal to embark on a series of films in which the team met various monsters or found themselves in exotic locations. Their film career eventually petered out and the team split up in 1957. Costello embarked on a series of TV appearances and even made a film, without Abbott, called The 30 Foot Bride of Candy Rock (1959), but it was a flop. He received good notices after a dramatic performance in an episode of Wagon Train (1957) and was in discussion to star in a biography of famed New York City mayor Fiorello LaGuardia, a project Costello had been trying to get off the ground for years, when he died. Both Abbott and Costello had major tax problems with the Internal Revenue Service and wound up virtually broke. Abbott started over with a new partner, Candy Candido, in the 1960s and set off on a national tour, including Las Vegas, but the act failed. In 1966 he voiced his character in a cartoon version of their television show. His health deteriorated badly in the late 1960s, he had always suffered from epilepsy, and he died in 1974.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MjIzMjQzMV5BMl5BanBnXkFtZTcwMTY3NDM3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0007941","name":"Bud Abbott","idIMDB":"nm0007941"},"actorId":"nm0007941","character":"Chick","urlCharacter":"http://www.imdb.com/character/ch0472068","main":true},{"actorName":"Lou Costello","urlProfile":"http://www.imdb.com/name/nm0182579","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNjkzNjE3N15BMl5BanBnXkFtZTcwOTY4NzIzOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1906","placeOfBirth":" Paterson, New Jersey, USA","birthName":"Louis Francis Cristillo","height":"5' 5\" (1.65 m)","bio":"Lou Costello was born Louis Francis Cristillo in Paterson, New Jersey, to Helen (Rege) and Sebastiano Cristillo. His father was from Calabria, Italy, and his mother was an American of Italian, French, and Irish ancestry. Raised in Paterson, Costello dropped out of high school and headed west to break into the movies. He got a job as a carpenter at MGM and Warners. He went from there to stuntman and then to vaudeville as a comic. In 1931, while working in Brooklyn, his straight man became ill and the theater cashier, Bud Abbott, filled in for him. The two formed their famous comedy team and, through the 1930s, they worked burlesque, minstrel shows, vaudeville and movie houses. In 1938 they got national exposure through the Kate Smith Hour radio show, and signed with Universal Pictures the next year. They debuted in One Night in the Tropics (1940). Their scene-stealing performances in that film landed them their own picture the next year, Buck Privates (1941), with The Andrews Sisters. It was a runaway hit, grossing what was then a company record $10 million on a $180,000 budget. In 1942 they topped a poll of Hollywood stars. They had their own radio show (ABC, 1941-46, NBC, 1946-49) and TV show (The Abbott and Costello Show (1952)). After the war their movies shifted formula to one in which they met various monsters or found themselves in exotic locations. The team split up in 1957, with both winding up completely out of money after troubles with the Internal Revenue Service. After that Lou appeared in a few television shows and the movie The 30 Foot Bride of Candy Rock (1959), released a few months after he died.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNjkzNjE3N15BMl5BanBnXkFtZTcwOTY4NzIzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0182579","name":"Lou Costello","idIMDB":"nm0182579"},"actorId":"nm0182579","character":"Wilbur","urlCharacter":"http://www.imdb.com/character/ch0481799","main":true},{"actorName":"Lon Chaney Jr.","urlProfile":"http://www.imdb.com/name/nm0001033","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMTM4NTkxMV5BMl5BanBnXkFtZTYwNjI1MjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1906","placeOfBirth":" Oklahoma City, Oklahoma, USA","birthName":"Creighton Tull Chaney","height":"6' 2\" (1.88 m)","bio":"American character actor whose career was influenced (and often overshadowed) by that of his father, silent film star Lon Chaney. The younger Chaney was born while his parents were on a theatrical tour, and he joined them onstage for the first time at the age of six months. However, as a young man, even during the time of his father's growing fame, Creighton Chaney worked menial jobs to support himself without calling upon his father. He was at various times a plumber, a meatcutter's apprentice, a metal worker, and a farm worker. Always, however, there was the desire to follow in his father's footsteps. He studied makeup at his father's side, learning many of the techniques that had made his father famous. And he took stage roles in stock companies. It was not until after his father's death in 1930 that Chaney went to work in films. His first appearances were under his real name (he had been named for his mother, singer Frances Chaney). He played number of supporting parts before a producer in 1935 insisted on changing his name to Lon Chaney Jr. as a marketing ploy. Chaney was uncomfortable with the ploy and always hated the \"Jr\". addendum. But he was also aware that the famous name could help his career, and so he kept it. Most of the parts he played were unmemorable, often bits, until 1939 when he was given the role of the simple-minded Lennie in the film adaptation of John Steinbeck's Of Mice and Men (1939). Chaney's performance was spectacularly touching; indeed, it became one of the two roles for which he would always be best remembered. The other came within the next year, when Universal, in hopes of reviving their horror film franchise as well as memories of their great silent star, Chaney Sr., cast Chaney as the tortured Lawrence Talbot in The Wolf Man (1941). With this film and the slew of horror films that followed it, Chaney achieved a kind of stardom, though he was never able to achieve his goal of surpassing his father. By the 1950s, he was established as a star in low-budget horror films and as a reliable character actor in more prestigious, big-budget films such as High Noon (1952). Never as versatile as his father, he fell more and more into cheap and mundane productions which traded primarily on his name and those of other fading horror stars. His later years were bedeviled by illness and problems with alcohol. When he died from a variety of causes in 1973, it was as an actor who had spent his life chasing the fame of his father, but who was much beloved by a generation of filmgoers who had never seen his father.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMTM4NTkxMV5BMl5BanBnXkFtZTYwNjI1MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001033","name":"Lon Chaney Jr.","nicknames":["The Prince of Pain"],"idIMDB":"nm0001033"},"actorId":"nm0001033","character":"Lawrence Talbot","urlCharacter":"http://www.imdb.com/character/ch0002574","main":true},{"actorName":"Bela Lugosi","urlProfile":"http://www.imdb.com/name/nm0000509","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0Mjc4MTE2N15BMl5BanBnXkFtZTYwNjUyMDI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1882","placeOfBirth":" Lugos, Kingdom of Hungary, Austria-Hungary [now Lugoj, Timis County, Romania]","birthName":"Béla Ferenc Dezsõ Blaskó","height":"6' 1\" (1.85 m)","bio":"It's ironic that Martin Landau won an Oscar for impersonating Bela Lugosi (in Ed Wood (1994)) when Lugosi himself never came within a mile of one, but that's just the latest of many sad ironies surrounding Lugosi's career. Bela Lugosi was born Béla Ferenc Dezsö Blaskó on October 20, 1882, Lugos, Hungary, Austria-Hungary (now Lugoj, Romania), to Paula de Vojnich and István Blaskó, a banker. He was the youngest of four children. During WWI, he volunteered and was commissioned as an infantry lieutenant, and was wounded three times. A distinguished stage actor in his native Hungary, Austria-Hungary, he ended up a drug-addicted pauper in Hollywood, thanks largely to typecasting brought about by his most famous role. He began his stage career in 1901 and started appearing in films during World War I, fleeing to Germany in 1919 as a result of his left-wing political activity (he organized an actors' union). In 1920 he emigrated to the US and made a living as a character actor, shooting to fame when he played Count Dracula in the legendary 1927 Broadway stage adaptation of Bram Stoker's novel. It ran for three years, and was subsequently, and memorably, filmed by Tod Browning in 1931, establishing Lugosi as one of the screen's greatest personifications of pure evil. Also in 1931, he became a U.S. citizen. Sadly, his reputation rapidly declined, mainly because he was only too happy to accept any part (and script) handed to him, and ended up playing pathetic parodies of his greatest role, in low-grade poverty row shockers. He ended his career working for the legendary Worst Director of All Time, Edward D. Wood Jr.. Lugosi was married Ilona Szmik (1917 - 1920), Ilona von Montagh (? - ?), and Lillian Arch (1933 - 1951). He is the father of Bela Lugosi Jr. (1938). Lugosi helped organize the Screen Actors Guild in the mid-'30s, joining as member number 28. Bela Lugosi died of a heart attack August 16, 1956. He was buried in his full Dracula costume, including a cape.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0Mjc4MTE2N15BMl5BanBnXkFtZTYwNjUyMDI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000509","name":"Bela Lugosi","nicknames":["Adelbert","Dracula"],"idIMDB":"nm0000509"},"actorId":"nm0000509","character":"Dracula","urlCharacter":"http://www.imdb.com/character/ch0002561","main":true},{"actorName":"Glenn Strange","urlProfile":"http://www.imdb.com/name/nm0833363","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGU4M2I2YzAtMTA3Yy00ZjMzLTkwYzUtYmU1YWJjOTQyZGMwXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 August 1899","placeOfBirth":" Weed, New Mexico, USA","birthName":"George Glenn Strange","height":"6' 6½\" (1.99 m)","bio":"At various times in his life a rancher, deputy sheriff and rodeo performer, this huge, towering (6' 5\") beast of a man was born George Glenn Strange in Weed, New Mexico, on August 16, 1899, but grew up a real-life cowboy in Cross Cut, Texas. Of Irish and Cherokee Indian descent, he taught himself (by ear) the fiddle and guitar at a young age and started performing at local functions as a teen. In the late 1920s, Glenn and his cousin, Taylor McPeters, better known later as the western character actor Cactus Mack, joined a radio singing group known as the \"Arizona Wranglers\" that toured throughout the country. They both started providing singing fillers in film westerns in the early 1930s. Glenn would play extra or bit roles for a number of years B Western and serials. One of his first roles was uncredited as a soldier, in tin armor, as part of \"Ming's Army\", in the sci fi classic serial \"Flash Gordon\"(1936/I). He would play a cowhand, rustler, henchman, sidekick, or plain ol' warbling, harmonica-blowing cowboy. Eventually in the late 30s, his billing improved and he evolved into a full-time bad guy in hundreds of \"B\" westerns. He was seen (or glimpsed) in many of the popular serials of the day, including The Hurricane Express (1932), Law of the Wild (1934), The Lone Ranger Rides Again (1939), and Riders of Death Valley (1941). It was his massive build that helped him break into the Universal horror picture genre of the 1940s. Horror star Boris Karloff had grown weary and fearful of his Frankenstein Creature typecast and abandoned the role. Glenn was the perfect replacement for the job and made his monstrous debut with House of Frankenstein (1944), quickly followed by House of Dracula (1945). It was he who played the Creature in the cult horror/comedy classic Abbott and Costello Meet Frankenstein (1948) as part of the monstrous trio of Bela Lugosi's Dracula and Lon Chaney Jr.'s Wolf Man. As the \"B\" western started faded off into the sunset in the 1950s, Strange moseyed on over to TV work. He played the nemesis \"Butch Cavendish\" and later reprised the role, after a prison escape, on \"The Lone Ranger\" (1949). Among other TV roles, he capped off his career with a steady (12 years) role as Sam the bartender on the classic Gunsmoke (1955) series from 1962 until shortly before his death from lung cancer in 1973.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGU4M2I2YzAtMTA3Yy00ZjMzLTkwYzUtYmU1YWJjOTQyZGMwXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0833363","name":"Glenn Strange","nicknames":["Pee Wee"],"idIMDB":"nm0833363"},"actorId":"nm0833363","character":"Monster","urlCharacter":"http://www.imdb.com/character/ch0002565","main":true},{"actorName":"Lenore Aubert","urlProfile":"http://www.imdb.com/name/nm0041304","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjQ1YWNkODMtZmNlMS00MmI1LWIyNzctYWFjYmFjNGQ4YTY3XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1918","placeOfBirth":" Cilli, Austria-Hungary [now Celje, Slovenia]","birthName":"Eleanore Maria Leisner","bio":"Lenore Aubert was born in present-day Slovenia, at the time still connected to the Austro-Hungarian Empire (her French name was pure Hollywood hokum, designed to make her background more exotic - though she did live for some time in Paris). Eleanore Maria Leisner was the daughter of an Austrian general and spent her formative years in Vienna where she studied acting and appeared in a few movies as an extra. Her marriage to a Jewish boy obliged her to leave Austria after the 'Anschluss' and the couple emigrated to the United States via France. In New York, Lenore found work as a model and was eventually offered a lucrative stage role as Lorraine Sheldon in \"The Man Who Came to Dinner\" at the La Jolla Playhouse in San Diego. Determined to get the part, Lenore crossed the U.S. by bus. Once settled in California, Lenore was 'discovered' twice. The first time, she was spotted by an agent for Samuel Goldwyn and signed to appear as the alluring Nazi spy trying to tempt Bob Hope in They Got Me Covered (1943). Though Dorothy Lamour wryly commented on Lenore's sexy walk, there was not enough screen time for the newcomer to seriously challenge the established star in the popularity stakes. After that, Lenore went into Action in Arabia (1944) opposite George Sanders. This picture did not make much of a splash either, but attracted the attention of Republic studio boss Herbert J. Yates, who was still desperately searching to find a replacement for his failed star Vera Ralston. Lenore was consequently cast in the period thriller The Catman of Paris (1946) which was launched with a (for Republic) bigger-then-average publicity campaign and went on to be exhibited at the better cinemas. Unfortunately, in the course of the 65 minutes, sets and cinematography were the real stars. Though the cast tried hard, they failed to overcome the deficiencies of lacklustre direction,a silly script and the even sillier makeup for the not very scary top- hatted 'werecat' monster. Needless to say, that 'Catman' did nothing for the careers of any involved. During the next few years, Lenore appeared in a number of B-movies, such as The Return of the Whistler (1948) and Barbary Pirate (1949). Her own favourite among her screen roles was that of Viennese singer/actress Fritzi Scheff (1879-1954) in I Wonder Who's Kissing Her Now (1947). Several times she had screen-tested, unsuccessfully, for A-grade productions. These included Saratoga Trunk (1945) and For Whom the Bell Tolls (1943), but on both occasions she lost out to Ingrid Bergman. Lenore's greatest success in film was probably retrospectively, due to the popularity and later cult status enjoyed by two films starring her with Abbott and Costello, made back-to-back: Abbott and Costello Meet Frankenstein (1948) (generally regarded as the duo's best) and Abbott and Costello Meet the Killer, Boris Karloff (1949). A story goes, that, during production of the former, Lenore (attired all in mink) walked actor Glenn Strange -- in full make-up as the Frankenstein monster -- on a leash up and down the studio lot in full view of visiting tourists arriving on the tour tram (nothing beats good publicity !). In the 1950's, Lenore joined her husband who was in the garment business in New York. The business succeeded, the marriage did not. With the exception of a couple of minor European films, Lenore's acting career was effectively over. She devoted much of her remaining life to charitable causes, doing work for the United Nations and the Museum of Natural History in New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjQ1YWNkODMtZmNlMS00MmI1LWIyNzctYWFjYmFjNGQ4YTY3XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0041304","name":"Lenore Aubert","idIMDB":"nm0041304"},"actorId":"nm0041304","character":"Sandra Mornay","urlCharacter":"http://www.imdb.com/character/ch0523561","main":true},{"actorName":"Jane Randolph","urlProfile":"http://www.imdb.com/name/nm0709905","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGY4YzBlYzMtYzRmNy00ZjZmLTk2NzYtMzdhNGU2NWUzMzJjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 October 1915","placeOfBirth":" Youngstown, Ohio, USA","birthName":"Jane Roermer","bio":"Poised and pretty actress Jane Randolph was briefly in the limelight during the 1940s. Born in Ohio in 1919, Jane grew up in Indiana. A couple of years after graduating from high school her interest in an acting career accelerated and she decided to move to Hollywood in 1939 to try her luck. She studied at Max Reinhardt's school and eventually was picked up by Warner Bros. and given bit parts in 1941. The following year RKO picked up her contract and she received the leading lady role in Highways by Night (1942). She would become known for her vulnerable femmes in film noir, which included Jealousy (1945) and Railroaded! (1947)--one of the few decent productions by bottom-of-the-barrel Producers Releasing Corporation--and in atmospheric horrors, particularly Cat People (1942) and its sequel, The Curse of the Cat People (1944). One of her last movies would be the classic comedy thriller Abbott and Costello Meet Frankenstein (1948). A year later she married sometime producer Jaime del Amo and retired to Spain and the life of a socialite. In later years she returned to Los Angeles, but also maintained a home in Switzerland.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGY4YzBlYzMtYzRmNy00ZjZmLTk2NzYtMzdhNGU2NWUzMzJjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0709905","name":"Jane Randolph","idIMDB":"nm0709905"},"actorId":"nm0709905","character":"Joan Raymond","urlCharacter":"http://www.imdb.com/character/ch0050232","main":true},{"actorName":"Frank Ferguson","urlProfile":"http://www.imdb.com/name/nm0272432","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE0ODY4OTE2N15BMl5BanBnXkFtZTgwODExNjY4MjE@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1906","placeOfBirth":" Ferndale, California, USA","height":"5' 10½\" (1.79 m)","bio":"American character actor Frank Ferguson appeared in scores of films and television shows, often as self-important types. Prior to his film debut, he was a prominent performer and director with the acclaimed Pasadena Community Playhouse, where he coached numerous up-and-coming young actors such as Dana Andrews, George Reeves, Robert Preston and Victor Mature. He broke into films, himself, in the early 1940s, usually playing minor supporting roles, though he was seen to advantage in larger roles, notably in two of the best-known (and oddest) westerns of the '50s, Rancho Notorious (1952) and Johnny Guitar (1954). He played hundreds of ranchers, bankers and police detectives in films and television throughout the '50s and '60s. He became most familiar as \"Gus\" on the children's program My Friend Flicka (1955) and later as \"Eli Carson\" on the two TV series based on the novel Peyton Place (1964). He semi-retired in 1972 and died of cancer six years later.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE0ODY4OTE2N15BMl5BanBnXkFtZTgwODExNjY4MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0272432","name":"Frank Ferguson","idIMDB":"nm0272432"},"actorId":"nm0272432","character":"Mr. McDougal","urlCharacter":"http://www.imdb.com/character/ch0050233","main":true},{"actorName":"Charles Bradstreet","urlProfile":"http://www.imdb.com/name/nm0103548","urlPhoto":"","biography":{"dateOfBirth":"23 June 1918","placeOfBirth":" Silver Ridge, Maine, USA","bio":"When Charles Bradstreet accompanied his brother to try-outs for a play, a script was thrust into Charles' hands, he was asked to read the part, and he was ultimately given the lead (a Los Angeles production titled \"Come to My House\"). Later, while managing a bar called Billingsley's (frequented by Frank Sinatra, Bing Crosby et al.), he was offered a movie contract at Columbia - then was rejected by studio Harry Cohn, who knew that Bradstreet had once thrown his (Cohn's) nephew out of Billingsley's! Bradstreet did later land an MGM contract, playing a series of small roles there, then freelanced. He played his best-known role in _Bud Abbott, Lou Costello Meet Frankenstein (1948)_, accepting it (even though he thought it was a step backwards career-wise) because he was friendly with its director, 'Charles T. Barton'. According to Bradstreet, he was offered the chance to play Tarzan and the lead in TV's \"Gunsmoke\", but turned down both offers. When \"the glamour went out of\" acting for him, he got into real estate.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0103548","name":"Charles Bradstreet","idIMDB":"nm0103548"},"actorId":"nm0103548","character":"Dr. Stevens","urlCharacter":"http://www.imdb.com/character/ch0050234","main":true}],"seasons":[],"idIMDB":"tt0040068","urlIMDB":"http://www.imdb.com/title/tt0040068","business":{"budget":{"money":"$800,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":"26","month":"03","year":"1948","remarks":null},"filmingDates":null,"copyrightHolder":"Universal Pictures Co., Inc.; 8 September 1949 (in notice 1948); LP2719"},"technical":{"runtime":["1 hr 23 min (83 min)","1 hr 30 min (90 min) (Argentina)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":["Universal Studios Laboratory, USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.6","filmingLocations":[{"location":"Benedict Castle, Riverside, California, USA"}],"rated":"PASSED","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2017","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best DVD/Blu-Ray Collection","names":[{"name":"Frankenstein","id":"tt0021884","role":null},{"name":"Bride of Frankenstein","id":"tt0026138","role":null},{"name":"Son of Frankenstein","id":"tt0031951","role":null},{"name":"The Ghost of Frankenstein","id":"tt0034786","role":null},{"name":"Frankenstein Meets the Wolf Man","id":"tt0035899","role":null},{"name":"House of Frankenstein","id":"tt0036931","role":null},{"name":"House of Dracula","id":"tt0037793","role":null}]},{"category":"Best DVD/Blu-Ray Collection","names":[{"name":"The Wolf Man","id":"tt0034398","role":null},{"name":"Frankenstein Meets the Wolf Man","id":"tt0035899","role":null},{"name":"House of Frankenstein","id":"tt0036931","role":null},{"name":"House of Dracula","id":"tt0037793","role":null},{"name":"Werewolf of London","id":"tt0027194","role":null},{"name":"She-Wolf of London","id":"tt0038934","role":null}]}]}]},{"award":"National Film Preservation Board, USA 2001","titlesAwards":[{"titleAwardOutcome":"Won National Film Registry","categories":[{"category":"","names":[]}]}]}],"votes":"11,444","type":"Movie","companyCreditsSimple":[{"idCompany":"co0021358","name":"Universal International Pictures (UI)"}],"keywords":{"keywords":["dracula","monster","brain","freight","frankenstein's monster","running","escape","wolf","operation","full moon","actor reprises previous role","supernatural power","passage","forest","hiding","creature","mask","woods","costume","metamorphosis","undercover","journal","equipment","professor","suitcase","guillotine","hypnotism","customer","transformation","hound dog","bite mark","lagoon","attack","foot chase","punched in the face","insurance inspector","england","investigator","trap door","insurance company","face slap","partner","sea","electricity","walking cane","cape","undead","crowbar","police officer","prisoner","legend","big ben","clock tower","captive","skeleton","kidnapping","search party","device","rifle","motor boat","passed out","dancing","beast","decoration","pier","armor","dock","guest","hidden room","dungeon","rowboat","masquerade ball","statue","living dead","flashlight","hidden entrance","knocked out","machinery","exhibit","animated sequence","delivery","locker","scream","trap","anger","search","thunder","paddle","destiny","lobby","blonde","hotel","note","key","experiment","laughter","bat","fear","candle","axe","rage","lightning","rope","fangs","american","uniform","klutz","luggage","death","invisibility","fire","barrel","gasoline","gate","strength","spell","murder","power","florida","crate","scalpel","rampage","universal monsters cinematic universe","vampire versus werewolf","1940s","evil man","universal monsters","romantic subplot","woman thrown through a window","upskirt","comic coward","performer name in title","sergeant","animated title sequence","abbott and costello","thrown through a window","burned alive","brain transplant","falling from height","lycanthropy","slapstick comedy","invisible man","vampire","party","island","secret door","coffin","boat","duplicity","horror spoof","london england","wax museum","impersonation","castle","doctor","brain surgery","bumbler","masquerade","vampire bat","laboratory","cellar","deception","werewolf","shipping office","spoof","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 03:50:58"}}