{"data":{"movies":[{"title":"The Enforcer","originalTitle":"","year":"1976","releaseDate":"19761222","directors":[{"name":"James Fargo","id":"nm0267309"}],"writers":[{"name":"Harry Julian Fink","id":"nm0277807"},{"name":"Rita M. Fink","id":"nm0277849"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWZiZjkyNGEtYzgwMS00NjEwLTljNDYtZTExNmYzZmViNjFhXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Crime","Thriller"],"plot":"Picking up three years after the events in Magnum Force, a threatening terrorist group called, The People's Revolutionary Strike Force declare war to the city of San Francisco and demand a ransom to be paid, otherwise they plan to blow the city apart. While Inspector 'Dirty' Harry Callahan is at a limbo following his unorthodox method during a robbery, he's at it to dispatch the terrorist group, by playing their game by being more dirty than ever. But this time, he's got a new partner, which might prove the task to be somewhat more difficult than ever, unless the two can work together.","simplePlot":"Dirty Harry must foil a terrorist organization made up of disgruntled Vietnam veterans. But this time, he's teamed with a rookie female partner that he's not too excited to be working with.","actors":[{"actorName":"Clint Eastwood","urlProfile":"http://www.imdb.com/name/nm0000142","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDc0MjY0OV5BMl5BanBnXkFtZTcwNzU1MDAxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1930","placeOfBirth":" San Francisco, California, USA","birthName":"Clinton Eastwood Jr.","height":"6' 4\" (1.93 m)","bio":"Perhaps the icon of macho movie stars, and a living legend, Clint Eastwood has become a standard in international cinema. Born May 31, 1930 in San Francisco, the elder of two children in a middle-class family, Eastwood stayed in high school until the comparatively late age of nineteen and worked menial jobs over a period of several years before enrolling at Los Angeles City College, from which he dropped out after two semesters to pursue acting. He found uncredited bit parts in such nondescript B-films as Revenge of the Creature (1955) and Tarantula (1955) during the mid-'50s while simultaneously digging swimming pools for a living, until he got his first breakthrough in the long-running TV series Rawhide (1959) with Eric Fleming. Though only a secondary player in the early seasons, Clint made the show his own by end of its run and became a recognizable face to television viewers around the country. Eastwood found much bigger and better things in Italy with the excellent spaghetti westerns A Fistful of Dollars (1964) and For a Few Dollars More (1965). But it was the third installment in the trilogy where he found one of his signature roles: The Good, the Bad and the Ugly (1966). The movie was a big hit and he became an instant international star. Clint's first American-made western, Hang 'Em High (1968), was yet again a success, and he followed it up with another starring role in Coogan's Bluff (1968) (the loose inspiration to the TV series McCloud (1970)) before playing second fiddle to Richard Burton in the World War II epic Where Eagles Dare (1968) and Lee Marvin in the bizarre musical Paint Your Wagon (1969). In Sierra torride (1970) and Kelly's Heroes (1970), Eastwood went in an experimental direction by combining tough-guy action with offbeat humor. 1971 proved to be one of his best years in film, if not the best. He starred in The Beguiled (1971) and the classic thriller Play Misty for Me (1971), but it was his role as the hard edge police inspector in Dirty Harry (1971) that gave Eastwood one of his signature roles and invented the loose-cannon cop genre that has been imitated even to this day. Eastwood did a fairly consistent quality of work thereafter with the road movies Thunderbolt and Lightfoot (1974) and The Gauntlet (1977), the Dirty Harry sequels Magnum Force (1973) and The Enforcer (1976), the westerns Joe Kidd (1972), High Plains Drifter (1973) and The Outlaw Josey Wales (1976) (his first of six onscreen collaborations with then live-in love Sondra Locke), and the fact-based thriller Escape from Alcatraz (1979). In 1978 he branched out into the comedy genre in Every Which Way But Loose (1978), which became the biggest hit of his career up to that time; taking inflation into account, it still is. In short, notwithstanding The Eiger Sanction (1975), the '70s were an uninterrupted continuation of success. Eastwood kicked off the '80s with Any Which Way You Can (1980), the blockbuster sequel to Every Which Way But Loose. The fourth Dirty Harry film, Sudden Impact (1983), was the highest-grossing film of the franchise and spawned the character's trademark catchphrase, \"Make my day\". Clint also starred in Bronco Billy (1980), Firefox (1982), Tightrope (1984), City Heat (1984), Pale Rider (1985) and Heartbreak Ridge (1986), all of which were solid hits, with Honkytonk Man (1982) being his only commercial failure of the period. In 1988 he did his fifth and final Dirty Harry movie, The Dead Pool (1988). Although it was a success overall, it did not have the box office punch the previous films had. About this time, with outright bombs like Pink Cadillac (1989) and The Rookie (1990), it became apparent that Eastwood's star was declining as it never had before. He then started taking on more personal projects, such as directing Bird (1988), a biopic of Charlie Parker, and starring in and directing White Hunter Black Heart (1990), an uneven, loose biopic of John Huston. Eastwood bounced back in a big way with his western Unforgiven (1992), which garnered the then 62-year-old his first ever Academy Award nomination (Best Actor) and win for Best Director. Following up with a quick hit, he took on the secret service in In the Line of Fire (1993), then accepted second billing to Kevin Costner in the interesting but poorly received drama A Perfect World (1993). Next up was a love story, The Bridges of Madison County (1995), where Clint surprised audiences with a sensitive performance, but it soon became apparent he was going backwards after his brief revival. Subsequent films were credible, but nothing really stuck out. Among them were the moderately well-received Absolute Power (1997) and Space Cowboys (2000) as well as the badly received True Crime (1999) and Blood Work (2002). But Eastwood surprised yet again, returning to the top of the A-list with the hugely successful boxing drama Million Dollar Baby (2004). The movie earned him an Oscar for Best Director and a Best Actor nomination for the second time. Behind the camera, he had big successes directing the multi-award-winners Mystic River (2003), Flags of Our Fathers (2006), Letters from Iwo Jima (2006) and Changeling (2008) which starred Angelina Jolie. His next starring vehicle, Gran Torino (2008), earned $30 million in its opening weekend, proving his box office appeal has not waned. Eastwood has managed to keep his extremely convoluted personal life top secret and never discusses his families with the media. He had a long time relationship with frequent co-star Locke and has at least eight children by at least six other women, although he has only been married twice. Clint Eastwood lives in Los Angeles and owns homes in Monterey, Northern California, Idaho and Hawaii.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDc0MjY0OV5BMl5BanBnXkFtZTcwNzU1MDAxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000142","name":"Clint Eastwood","idIMDB":"nm0000142"},"actorId":"nm0000142","character":"Harry Callahan","urlCharacter":"http://www.imdb.com/character/ch0007342","main":true},{"actorName":"Tyne Daly","urlProfile":"http://www.imdb.com/name/nm0002033","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAyNjA2ODk2NV5BMl5BanBnXkFtZTcwMTQ0MTk5Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 February 1946","placeOfBirth":" Madison, Wisconsin, USA","birthName":"Ellen Tyne Daly","height":"5' 5¼\" (1.66 m)","bio":"Tyne Daly was born on February 21, 1946 in Madison, Wisconsin, USA as Ellen Tyne Daly. She is an actress, known for Cagney & Lacey (1981), Judging Amy (1999) and The Enforcer (1976). She was previously married to Georg Stanford Brown.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAyNjA2ODk2NV5BMl5BanBnXkFtZTcwMTQ0MTk5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002033","name":"Tyne Daly","idIMDB":"nm0002033"},"actorId":"nm0002033","character":"Kate Moore","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harry Guardino","urlProfile":"http://www.imdb.com/name/nm0345340","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTQ4OTM3MF5BMl5BanBnXkFtZTcwNTA3MjIyOA@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 December 1925","placeOfBirth":" New York City, New York, USA","birthName":"Harry Vincent Guardino","height":"5' 10\" (1.78 m)","bio":"Virile Brooklyn-born actor Harry Guardino, with dark, wavy hair and a perpetual worried look on his craggy-looking mug, started out in the acting school of hard knocks, slumming for nearly a decade in small, obscure 'tough guy' film parts in the early to mid 50s. A definite man's man, he finally attracted some attention on the Broadway stage with \"A Hatful of Rain\" (1956) and was nominated for a Tony for \"One More River\" in 1960. By then, juicier film roles began to gravitate his way, stealing the thunder out from under Cary Grant and Sophia Loren as a comic handyman in Houseboat (1958). Harry went on to play other brash guys with and without a comic edge to them in both crime and war stories such as Pork Chop Hill (1959), Cinq femmes marquées (1960), Hell Is for Heroes (1962), Madigan (1968), Dirty Harry (1971) and The Enforcer (1976), the last two pairing up with Clint Eastwood. He even played \"Barabbas\" in the classic bible epic King of Kings (1961) for a change of pace and scenery. More and more, however, TV became Harry's favorite medium. He portrayed district attorney \"Hamilton Burger\" in the 70s revival series of \"Perry Mason\" and co-starred in dozens of grim, rugged mini-movies often as a street-smart cop. Not so true to nature, he found an unlikely outlet in musical theatre in later years, going on to star in productions of \"Woman of the Year\" and \"Chicago\". A solid, durable, all-round actor, he died of lung cancer in 1995 at age 69.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTQ4OTM3MF5BMl5BanBnXkFtZTcwNTA3MjIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0345340","name":"Harry Guardino","idIMDB":"nm0345340"},"actorId":"nm0345340","character":"Lt. Bressler","urlCharacter":"http://www.imdb.com/character/ch0135352","main":true},{"actorName":"Bradford Dillman","urlProfile":"http://www.imdb.com/name/nm0226947","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ0MjI4NzQyOF5BMl5BanBnXkFtZTcwNDM2NTgwOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 April 1930","placeOfBirth":" San Francisco, California, USA","height":"6' (1.83 m)","bio":"Dark-haired, Ivy League-looking Bradford Dillman, whose white-collar career spanned nearly five decades, possessed charm and confident good looks that were slightly tainted by a bent smile, darting glance and edgy countenance that often provoked suspicion. Sure enough, the camera picked up on it and he played shady, highly suspect characters throughout most of his career. The actor was born in San Francisco on April 14, 1930, to Dean and Josephine Dillman. Yale-educated, he graduated with a B.A. in English Literature. Following this he served with the US Marines in Korea (1951-1953) before focusing on acting as a profession. Studying at the Actors Studio, he spent several seasons apprenticing with the Sharon (CT) Playhouse before making his professional acting debut in \"The Scarecrow\" in 1953. Dillman took his initial Broadway bow in Eugene O'Neill's play \"Long Day's Journey Into Night\" in 1956, originating the author's alter ego character Edmund Tyrone and winning a Theatre World Award in the process. This success put him squarely on the map and 20th Century-Fox took immediate advantage by placing the darkly handsome up-and-comer under contract. Cast in the melodrama A Certain Smile (1958), he earned a Golden Globe for \"Most Promising Newcomer\" playing a Parisian student who loses his girl (Christine Carère) to the worldly Italian roué Rossano Brazzi. He followed this with a strong ensemble appearance in In Love and War (1958), which featured a cast of young rising stars including Hope Lange and Robert Wagner. More acting honors followed after completing the film Compulsion (1959), which told the true story of the infamous 1920s kidnapping/murder case of Nathan Leopold and Richard Loeb. He went on to share a \"Best Actor\" award at the Cannes Film Festival with fellow co-stars Dean Stockwell, who played the other youthful murderer, and veteran Orson Welles. Though he was a magnetic player poised for stardom, Dillman's subsequent films failed to serve him well and were generally unworthy of his talent. Though properly serious and stoic as the title character in Francis of Assisi (1961), the film itself was stilted and weakly scripted. Circle of Deception (1960) was a misguided tale of espionage and intrigue, but it did introduce him to his second wife, supermodel-cum-actress Suzy Parker. While A Rage to Live (1965) with Suzanne Pleshette was trashy soap material, The Plainsman (1966) was rather a silly, juvenile version of the Gary Cooper western classic. As a result of these missteps--and others--he began to top-line lesser quality projects or play supporting roles in \"A\" pictures. His nothing role as Robert Redford's college pal-turned Hollywood producer in The Way We Were (1973) and his major roles in the ludicrous The Swarm (1978) and Lords of the Deep (1989) became proof in the pudding. His last good film role was in O'Neill's The Iceman Cometh (1973), although he did play an interesting John Wilkes Booth in the speculative re-enactment drama The Lincoln Conspiracy (1977) and had a fun leading role in the Jaws (1975)-like spoof Piranha (1978). Dillman bore up very well on TV over the years, subsisting on a plethora of mini-movies and guest spots on popular series, playing everything from turncoats to frauds and from adulterers to psychotics. He earned a Daytime Emmy for his appearance in The ABC Afternoon Playbreak: Last Bride of Salem (1974) and starred in two series--Court Martial (1965), as a military lawyer, and King's Crossing (1982), as an alcoholic parent and teacher attempting to straighten out. He also spent a season on the established nighttime soap Falcon Crest (1981) in 1982. He is the father of five children. One daughter, Pamela Dillman has worked as an actress, narrator, director and teacher of acting. Bradford launched a late-in-the career sideline as an author. The football fan inside him compelled him to write \"Inside the New York Giants\" (1995), a book that rated players drafted by the team since 1967. Two years later he published his memoirs, the curiously-titled \"Are You Somebody?: An Actor's Life.\" He hasn't been seen on since a few guest star shots on \"Murder, She Wrote\" in the mid-90s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ0MjI4NzQyOF5BMl5BanBnXkFtZTcwNDM2NTgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0226947","name":"Bradford Dillman","nicknames":["Brad"],"idIMDB":"nm0226947"},"actorId":"nm0226947","character":"Capt. McKay","urlCharacter":"http://www.imdb.com/character/ch0211552","main":true},{"actorName":"John Mitchum","urlProfile":"http://www.imdb.com/name/nm0593850","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGM2MTczYzgtMjIxNy00ZjZhLTgxODAtZDVlZDQ4NjdkZGFkL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1919","placeOfBirth":" Bridgeport, Connecticut, USA","birthName":"John Newman Mitchum","height":"5' 11\" (1.8 m)","bio":"John Newman Mitchum was the September child of a Norwegian mother and an Irish/Blackfoot father whom he never knew, as he was killed in a tragic train yard accident in 1919. His two-years-older brother Robert filled the role as best as he could, while their older sister Annette studied the lively arts and eventually joined a traveling vaudeville team. Born in Bridgeport, Connecticut, the young family moved to Rising Sun, Delaware, where farm life didn't agree with the young boys. Scarce opportunities took them to New York City, where the streets of Hell's kitchen taught the brothers to fight, a skill they developed so well they earned the moniker 'them ornery Mitchum boys'. Eventually, when the Great Depression deepened, the family was forced to separate with the intention of meeting up with sister Annette, who had married a sailor and moved to California, changing her name to Julie. The teenage boys set out with little more than clean handkerchiefs to find their way across the country by the only means they could: hitchhiking and riding the rails. Their somewhat aimless journey took them to places they had never been; where their Eastern accents were not welcome, so they quickly learned that accurately mimicking the local dialect would keep them out of trouble--some of the time! While brother Robert fairly quickly discovered his place in Hollywood legend, John sought his destiny on the high seas, professionally boxing, or conducting a choir. When the opportunity for acting came along John found his perfect niche as a character actor, mostly playing heavies since he was an imposing figure of a man. John's roles had him playing alongside a wide range of celebrities, from Humphrey Bogart in \"Knock On Any Door\" (1949) to Gladys Knight in \"Pipe Dreams\" (1976), Clint Eastwood of \"Dirty Harry\" (1971) to John Wayne in \"Chisum\" (1970), appearing in 58 films overall. It was during production of \"Chisum\" that John Wayne offered his voice for an anthology of John's poetry that seeks to uplift American culture, \"America, Why I Love Her\", a recording for which Mitchum was nominated for a Grammy in 1973. John was a consummate storyteller (as was his brother Robert), and with his fascination with American history in particular he was ever-ready to regale anyone with a thoughtful, interesting, and insightful anecdote, especially if a guitar was available. It was the wedding of music and history that brought him to create the recording \"Our Land, Our Heritage\" with Dan Blocker; big \"Hoss\" from \"Bonanza\", in 1964. Mitchum had some recurring roles throughout his television career; such as \"Pickalong\" from \"Riverboat\", or \"Hoffenmueller\" from \"F-Troop\", over 150 appearances in all during the span of a half-century career. The brothers Mitchum legacy has been well-preserved in his often hilarious autobiography, \"Them Ornery Mitchum Boys\", published in 1989. The subjects range from brother Robert escaping a Georgia chain-gang to his \"poontang\" interview; from John surviving an attacking whale on a three-masted schooner to his adventures riding the rails, developing a great love and respect for the American people.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGM2MTczYzgtMjIxNy00ZjZhLTgxODAtZDVlZDQ4NjdkZGFkL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0593850","name":"John Mitchum","nicknames":["Big John"],"idIMDB":"nm0593850"},"actorId":"nm0593850","character":"DiGeorgio","urlCharacter":"http://www.imdb.com/character/ch0007355","main":true},{"actorName":"DeVeren Bookwalter","urlProfile":"http://www.imdb.com/name/nm0095430","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjEyNThlYmItNjQzZC00ODZhLWEzYWQtZWM0Yjg0ZjM4OTliXkEyXkFqcGdeQXVyMTI3MDk3MzQ@._V1_UY44_CR37,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 September 1939","placeOfBirth":" Brookville, Pennsylvania, USA","bio":"DeVeren Bookwalter honed his TV and movie acting talents originally in stage work in New York. From the east he moved to Los Angeles in the early 1970s, to plumb the opportunities of West Coast acting. One of the first of varied small roles in his new movie career was The Omega Man (1971). Bookwalter had a particular passion for Shakespeare and found an adequate outlet in his association with R. Thad Taylor's Shakespeare Society of America in West Hollywood. Working out of a turn-of-the-century Victorian mansion converted to several production stages, the SSA was especially devoted to performing all of Shakespeare's plays with a pool of LA legitimate theater, TV, and movie talent. Bookwalter played Feste the Clown in the SSA's ambitious Twelfth Night (1971)which used the mansion's massive backyard patio as the central stage. The production included young British actors Vincent Mongol and Vickery Turner and veteran funny man Avery Schreiber. When the mansion's owners tore it down in early 1972 (for the proverbial parking lot), Taylor moved the SSA to a converted garage a few miles north and with Bookwalter and the addition of a varied trove of talented volunteers constructed within it a half scale model of the Globe Theater. Reconstituting the new location as the LA Globe Theater, the SSA continued the goal of completing Shakespeare's plays, along with a steady insertion of new plays and some modern classics. Bookwalter took the helm as director and star in the SSA's acclaimed Cyrano de Bergerac (1975) which garnered the Los Angeles Drama Critics Circle Awards for production, director, and lead performance for that year. The SSA completed the Shakespeare collection of plays in 1976-77 season, and Bookwalter once again moved into movies, including the American TV production of Othello (1981). His most notable movie role was as the home grown terrorist leader Bobby Maxwell in the Clint Eastwood_ continuing Dirty Harry installment The Enforcer (1976). Thereafter Bookwalter moved into the steady work of soap operas (1982-84) and finally returned to New York where he passed away before his time in 1987.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjEyNThlYmItNjQzZC00ODZhLWEzYWQtZWM0Yjg0ZjM4OTliXkEyXkFqcGdeQXVyMTI3MDk3MzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0095430","name":"DeVeren Bookwalter","idIMDB":"nm0095430"},"actorId":"nm0095430","character":"Bobby Maxwell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Crawford","urlProfile":"http://www.imdb.com/name/nm0186833","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzhjMTRjMDktYTA4MC00YWVkLWIyYWEtNjc1ZDI3ZGFhOWI3L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 September 1920","placeOfBirth":" Colfax, Washington, USA","birthName":"Cleve Allen Richardson","height":"6' 0½\" (1.84 m)","bio":"Burly, handsome and rugged character actor John Crawford appeared in over 200 movies and TV shows combined in a career that spanned over 40 years, usually cast as tough and/or villainous characters. Crawford was born Cleve Richardson on September 13, 1920, in Colfax, Washington. He was discovered by a Warner Bros. scout while attending the University of Washington's School of Drama. Although he failed his screen test, Crawford nonetheless joined RKO as a laborer. He then got a job building sets at Circle Theater in Los Angeles, and eventually persuaded the producers to cast him in some of their plays. He was soon signed to Columbia Pictures to act in secondary roles in westerns. In the late 1950s he graduated to bigger parts in such films as Orders to Kill (1958), The Key (1958) and Hell Is a City (1960), all of which were made in the UK. Crawford returned to America in the early 1960s and began a prolific career in both movies and TV series, up until 1986. His most memorable film roles include the ill-fated chief engineer in The Poseidon Adventure (1972), the hearty Tom Iverson in Night Moves (1975), the bumbling mayor of San Francisco in The Enforcer (1976), hard-nosed police chief Buzz Cavanaugh in Outlaw Blues (1977) and amiable old mine hand Brian Deerling in The Boogens (1981). John had recurring parts as Sheriff Ep Bridges in The Waltons (1971) and Capt. Parks on Police Woman (1974). Among the many TV shows he made guest appearances in are The Lone Ranger (1949), Adventures of Superman (1952), I Spy (1965), The Twilight Zone (1959), The Untouchables (1959), Wagon Train (1957), The Fugitive (1963), Star Trek (1966), Lost in Space (1965), Bonanza (1959), Hogan's Heroes (1965), Mission: Impossible (1966), Gunsmoke (1955), The Bionic Woman (1976), Dallas (1978) and Dynasty (1981). Crawford died at age 90 following complications from a stroke on September 21, 2010, in Thousand Oaks, California. He's survived by his ex-wife Ann Wakefield, four daughters and two grandchildren.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzhjMTRjMDktYTA4MC00YWVkLWIyYWEtNjc1ZDI3ZGFhOWI3L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0186833","name":"John Crawford","idIMDB":"nm0186833"},"actorId":"nm0186833","character":"The Mayor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Samantha Doane","urlProfile":"http://www.imdb.com/name/nm0229552","urlPhoto":"","biography":{"dateOfBirth":"29 November 1946","placeOfBirth":" Harlan, Kentucky, USA","bio":"Samantha Doane was born on November 29, 1946 in Harlan, Kentucky, USA. She is an actress, known for The Enforcer (1976), The Gauntlet (1977) and Growing Strong (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0229552","name":"Samantha Doane","idIMDB":"nm0229552"},"actorId":"nm0229552","character":"Wanda","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert F. Hoy","urlProfile":"http://www.imdb.com/name/nm0398338","urlPhoto":"","biography":{"dateOfBirth":"3 April 1927","placeOfBirth":" New York City, New York, USA","birthName":"Robert Francis Hoy","bio":"Robert F. Hoy was equally at home as a stuntman and as an actor. He appeared as Joe Butler on the acclaimed TV Western, The High Chaparral. He stunt-doubled for Charles Bronson, Tony Curtis, Robert Forrester, Ross Martin, Tyrone Power, David Jansen, Telly Savalas, Charles McGraw, Jay Silverheels and Abby Lane. His acting roles in many films included: Bite the Bullet, The Outlaw Josey Wales, The Lone Ranger, Gambler II, Nevada Smith, Bronco Billy, The Enforcer, The Great Race, and TV shows such as Wanted Dead or Alive, Walker Texas Ranger, JAG, Dallas (recurring role), The Wild Wild West, Magnum P.I. (five episodes), The Young Riders, and Zorro. He was the 2nd Unit Director and Stunt Coordinator in Spain on the TV series Zorro and on the pilot of The Three Musketeers. In his work as a stuntman, Bob specialized in horse work, although he was also called upon to double in fight scenes, do car work and handle high falls. The films in which lead actors and others were doubled for stunts are too numerous to mention but include: Operation Petticoat, The Defiant Ones, Spartacus, Tobruk, They Call Me Bruce, Saskatchewan, River of No Return, To Hell and Back, Drumbeat, Wings of the Hawk, and Revenge of the Creature From the Black Lagoon. With stunt credits on more than 30 television series and twice that many features, there is no doubt that Bob earned his lifetime membership in the Stuntmen's Association, of which he was a founding member. He was also a member of the Academy of Motion Pictures, Arts and Sciences, Directors Guild of America, AFTRA, and the Screen Actors Guild.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0398338","name":"Robert F. Hoy","nicknames":["Bobby"],"idIMDB":"nm0398338"},"actorId":"nm0398338","character":"Buchinski","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jocelyn Jones","urlProfile":"http://www.imdb.com/name/nm0428394","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDNhMDYzYzgtMDVhYi00MjdlLTkyNTktZTY1MTIyYWEyMDQzL2ltYWdlXkEyXkFqcGdeQXVyMzgzODA4MQ@@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1950","placeOfBirth":" New York City, New York, USA","height":"5' 7\" (1.7 m)","bio":"Jocelyn Jones was raised in an artist's community on the Hudson River just 30 minutes north of Manhattan. This idyllic hamlet is home to some of the most influential artists of our time and it was here that her interest in art, artists and their process began. She is the daughter of Henry Jones, a character actor whose credits include some 40 films and over 300 televisions shows. Mr. Jones started out as a Broadway actor, most known for \"The Bad Seed\", \"Advise And Consent\" and his Tony Award-winning performance in \"Sunrise at Campobello\". Ms. Jones began her career at the age of 12, appearing alongside her father and E.G. Marshall in an episode of \"The Defenders.\" Her work in motion pictures includes Clint Eastwood, \"The Enforcer\" \"The Other Side of the Mountain\" with Beau Bridges, Al Pacino's \"Serpico\" as well as starring in the cult classics \"Tourist Trap\" and \"The Great Texas Dynamite Chase.\" Ms. Jones has appeared on stage in both New York and Los Angeles, most notably at The Mark Taper Forum, playing Greta Garbo in the world premiere of Christopher Hampton's \"Tales From Hollywood.\" She has also appeared with Joe Stern's Matrix Theatre Company, where she played the delightfully insane Violet in George M. Cohan's farce \"The Tavern\" and as Constance Wicksteed, a spinster with a passion for large breasts, in Alan Bennett's farce \"Habeas Corpus\". She received critical acclaim for her role as Lucy Brown in Ron Sossi's groundbreaking production of \"The Three Penny Opera\", which famously utilized all three theaters of The Odyssey Theatre Complex for that same production. An in demand acting teacher for over 25 year, Ms. Jones has shepherded hundreds of actors from novice to starring careers and currently works with over a hundred hand picked actors, directors and writers at The Jocelyn Jones Acting Studio. Known as a \"secret weapon\" to some of the biggest stars in the industry, she has served as a confidential Creative Consultant, working on some of the highest-grossing pictures of all time. From advising artists on which projects to choose, to working with writing teams, to develop current and future projects, Ms. Jones' consultant work has been considered an invaluable asset to many. As a script doctor, she has served in every capacity, from page-one rewrites to final polishes- confidentially contributing to blockbuster films and television series alike. Her production company, Mind's Eye Pictures, is dedicated to producing her own original content.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDNhMDYzYzgtMDVhYi00MjdlLTkyNTktZTY1MTIyYWEyMDQzL2ltYWdlXkEyXkFqcGdeQXVyMzgzODA4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0428394","name":"Jocelyn Jones","idIMDB":"nm0428394"},"actorId":"nm0428394","character":"Miki","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"M.G. Kelly","urlProfile":"http://www.imdb.com/name/nm0446619","urlPhoto":"","biography":{"dateOfBirth":"1954","placeOfBirth":" Ada, Oklahoma, USA","birthName":"Michael Gary Kelly","bio":"M.G. Kelly was born in 1954 in Ada, Oklahoma, USA as Michael Gary Kelly. He is known for his work on Wheel of Fortune (1983), The Enforcer (1976) and A Star Is Born (1976).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0446619","name":"M.G. Kelly","nicknames":["Machine Gun Kelly"],"idIMDB":"nm0446619"},"actorId":"nm0446619","character":"Father John","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nick Pellegrino","urlProfile":"http://www.imdb.com/name/nm0671033","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NTAwNzY5Nl5BMl5BanBnXkFtZTYwMjIwNDky._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 July 1945","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Nicola Pellegrino","height":"5' 11\" (1.8 m)","bio":"Nick Pellegrino was born on July 13, 1945 in Boston, Massachusetts, USA as Nicola Pellegrino. He is known for his work on The Enforcer (1976), The China Syndrome (1979) and Hot Club California (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NTAwNzY5Nl5BMl5BanBnXkFtZTYwMjIwNDky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0671033","name":"Nick Pellegrino","idIMDB":"nm0671033"},"actorId":"nm0671033","character":"Martin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Albert Popwell","urlProfile":"http://www.imdb.com/name/nm0691620","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY2Yjk5ODgtM2YzYy00MjNiLWJlODktMzU1OWUzY2Q0ZTYxXkEyXkFqcGdeQXVyMTI3MDk3MzQ@._V1_UY44_CR37,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1926","placeOfBirth":" New York City, New York, USA","height":"6' 3\" (1.91 m)","bio":"Handsome, leanly built African-American actor who notched up guest appearances in dozens of popular US TV shows, including Mannix (1967), McCloud (1970), Emergency! (1972) and Magnum, P.I. (1980). However, he's better known to cult films fans for his portrayal of character \"Matthew Johnson\" in the successful blaxploitation films Cleopatra Jones (1973) and the sequel Cleopatra Jones and the Casino of Gold (1975). Popwell additionally co-starred alongside screen icon Clint Eastwood in five films, starting off as \"Wonderful Digby\" in Coogan's Bluff (1968). The next four occasions were entries in the highly popular \"Dirty Harry\" films, firstly as the wounded bank robber at the receiving end of Eastwood's now legendary, \"Do you feel lucky, punk?\" speech in the opening minutes of Dirty Harry (1971). He was back as a sadistic pimp who murders a greedy call girl with a can of drain cleaner and is later executed by a vigilante motorcycle cop in Magnum Force (1973), and he was still on the wrong side of the law as a \"Black Power\" activist named \"Big Ed\" Mustapha in The Enforcer (1976). For his final appearance alongside Eastwood, Popwell was on the right side of Clint for once as a fellow detective in Sudden Impact (1983). Popwell passed away on April 9, 1999, from complications arising after major surgery.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY2Yjk5ODgtM2YzYy00MjNiLWJlODktMzU1OWUzY2Q0ZTYxXkEyXkFqcGdeQXVyMTI3MDk3MzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0691620","name":"Albert Popwell","nicknames":["Poppy"],"idIMDB":"nm0691620"},"actorId":"nm0691620","character":"Mustapha","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rudy Ramos","urlProfile":"http://www.imdb.com/name/nm0708784","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNzgxMjg5M15BMl5BanBnXkFtZTcwMjc0MzAzMQ@@._V1_UY44_CR10,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 September 1950","placeOfBirth":" Lawton, Oklahoma, USA","bio":"With only one television credit on his resume, Rudy was cast in the hit TV western, The High Chaparral (1967), as \"Wind\", the half-breed Indian boy. Thirty-five years later, his career is still going strong. Recurring roles on TV include Resurrection Blvd. (2000) and Hunter (1984). Rudy has had starring roles in made-for-TV movies such as The Blue Knight (1973), Helter Skelter (1976), Everybody's Baby: The Rescue of Jessica McClure (1989) and Dr. Quinn Medicine Woman: The Movie (1999), to name a few. Guest appearances on episodic TV range from George Lopez (2002), NYPD Blue (1993) and JAG (1995) to Murder, She Wrote (1984), MacGyver (1985), Hill Street Blues (1981) and Hawaii Five-O (1968), with many in-between. Rudy has also performed in many feature films. He has had featured roles in Beverly Hills Cop II (1987), with Eddie Murphy, and The Enforcer (1976), with Clint Eastwood, co-starring roles in Colors (1988), directed by Dennis Hopper and staring Sean Penn, and The Driver (1978), with Ryan O'Neal, and starring roles in Quicksilver (1986), with Kevin Bacon, Defiance (1980), with Jan-Michael Vincent, and Art Carney, Torchlight (1985), with Steve Railsback and Ian McShane and Road Dogz (2000), with Jacob Vargas and directed by the up-and-coming young director, Alfredo Ramos. As a member of the Los Angeles Actors Theatre, Rudy performed the role of \"Cupcakes\", in the award-winning hit show, Shorteyes, by Miguel Pinero. Other stage performances have taken place in such notable theaters as The Mark Taper Forum, John Anson Ford, The Met, Matrix, The Los Angeles Theatre Center, Nosotros, South Coast Rep, New Mexico Rep and The Ojai Playwrights Conference. The album, \"Hard Knocks and Bad Times\", showcases Rudy's musical talents.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNzgxMjg5M15BMl5BanBnXkFtZTcwMjc0MzAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0708784","name":"Rudy Ramos","idIMDB":"nm0708784"},"actorId":"nm0708784","character":"Mendez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Ackridge","urlProfile":"http://www.imdb.com/name/nm0010089","urlPhoto":"","biography":{"dateOfBirth":"9 January 1926","placeOfBirth":"","bio":"Bill Ackridge was born on January 9, 1926. He was an actor, known for A View to a Kill (1985), The Enforcer (1976) and Signal Seven (1986). He died on March 14, 1998 in San Francisco, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0010089","name":"Bill Ackridge","idIMDB":"nm0010089"},"actorId":"nm0010089","character":"Andy","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0074483","urlIMDB":"http://www.imdb.com/title/tt0074483","business":{"budget":{"money":"$9,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"SEK","country":"2,665,006","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1976/\">1976</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 36 min (96 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panaflex Cameras, Panavision Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA","Technicolor, Hollywood (CA), USA (prints)"],"filmLength":["2,588 m (Sweden, cut version)","2,635 m (Sweden, uncut version)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision"],"printedFilmFormat":["35 mm"]},"rating":"6.8","filmingLocations":[{"location":"1470 Pine Street, San Francisco, California, USA"}],"rated":"R","awards":[],"votes":"33,564","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."},{"idCompany":"co0102264","name":"Malpaso Company, The"}],"keywords":{"keywords":["dirty harry","partner","terrorist","inspector","ransom","terrorist group","mayor","alcatraz","prison","showdown","warehouse","revenge","rocket launcher","policewoman","hostage","extremist","policeman","woman murders a woman","murder of a policewoman","police procedural","neo noir","shootout in a church","baseball bat","shoulder holster","quick draw","assault rifle","opening action scene","militant","female villain","catholic priest","wisecrack humor","police shootout","street shootout","gunfight","ambush","female cop","female gunfighter","gun violence","gun battle","1970s","famous line","catch phrase","m 16","shot in the groin","buddy cop","terrorist plot","mixed martial arts","martial arts","fistfight","brawl","gore","shot in the head",".44 magnum","dark comedy","blood","violence","maverick cop","tough cop","tough girl","anti hero","tough guy","action hero","hero","racial slur","blood splatter","shot in the chest","restaurant","revolver","prostitute","throat slitting","knife","arrest","shootout","swat team","pistol","press conference","rescue","machine gun","army base","nun","watching tv","sex doll","playing pool","baseball stadium","audio cassette","radio station","baseball game","suspended cop","politician","reporter","african american","priest","rooftop","foot chase","autopsy","bomb","morgue","explosion","police officer","hospital","police car","tear gas","armed robbery","siren","stabbed to death","shotgun","murder","male nudity","female nudity","bazooka","detective","blockbuster","third part","sequel","limousine","kidnapping","returning character killed off","black militant","helicopter","pool table","neo black panthers","terrorism","san francisco california","hit and run","shot in the crotch","disc jockey","boat","hijacking","chase","baseball","church","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:43:25"}}