{"data":{"movies":[{"title":"Who's Harry Crumb?","originalTitle":"","year":"1989","releaseDate":"19890203","directors":[{"name":"Paul Flaherty","id":"nm0280901"}],"writers":[{"name":"Robert Conte","id":"nm0176256"},{"name":"Peter Wortmann","id":"nm0941810"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1M2Y0YzctMGUxMy00NzVkLTk4MjYtNmMxMjZhNzY3MTQ1XkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1.jpg","countries":["USA","Canada"],"languages":["English"],"genres":["Comedy","Mystery"],"plot":"Harry is the latest generation of the Crumbs, famous and extremely talented detectives. Unfortunately talent seems to have skipped a generation and Harry is reduced to \"gumshoe\" work at a remote branch of the Crumb detective agency. Back at headquarters, Crumb executive Elliot Draison hatches an evil plan which requires the inclusion of an incompetent detective. With Harry Crumb on the case Draison thinks everything will run fine for him. Despite his best efforts Crumb actually makes some headway in the case...","simplePlot":"Harry Crumb is a bumbling and inept private investigator who is hired to solve the kidnapping of a young heiress which he's not expected to solve because his employer is the mastermind behind the kidnapping.","actors":[{"actorName":"John Candy","urlProfile":"http://www.imdb.com/name/nm0001006","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQ3MzQzODUxMF5BMl5BanBnXkFtZTcwMjY5MTkyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1950","placeOfBirth":" Toronto, Ontario, Canada","birthName":"John Franklin Candy","height":"6' 2\" (1.88 m)","bio":"Candy was one of Canada's greatest and funniest character actors. His well-known role as the big hearted buffoon earned him classics in Uncle Buck (1989) and Planes, Trains & Automobiles (1987). His career has handed him some dry spells but Candy always rebounded. Born in Newmarket, Ontario, in the year 1950, Candy was the son of Evangeline (Aker) and Sidney James Candy. His mother was of Ukrainian and Polish ancestry. Candy found his passion for drama while attending a community college. In 1971 Candy made his TV debut in an episode of Police Surgeon (1971) co-starring Sharon Farrell, John Hamelin, and Nick Mancuso. Candy then found a number of bit parts in other Canadian television shows and also in such small films as Tunnel Vision (1976) and Find the Lady (1976). However, his big success came at the age of twenty-seven, when he became part of the comedy group \"Second City\" in Toronto. Alongside such soon-to-be Canadian stars as Catherine O'Hara (one of Candy's lifelong friends), Eugene Levy, Rick Moranis, and Harold Ramis, Candy was also part of the television show the group inspired. SCTV (1976) earned Candy a reputation for his quirky humor and his uncanny imitations of others. After the television series, Candy appeared alongside fellow Canadian Dan Aykroyd in the Steven Spielberg flop 1941 (1979). However, other jobs followed and Candy landed a role, once again with Aykroyd, in the successful classic The Blues Brothers (1980). Candy played a parole officer who is part of the chase after Jake and Elwood Blues. The film was a hit and Candy followed up accordingly. Candy acted in the smash hit Stripes (1981) where he played a dopey, overweight recruit affectionately nicknamed 'Ox'. After the success of Stripes (1981), Candy returned to the Second City with the other former stars, in SCTV Network (1981). Candy also hosted \"Saturday Night Live\" before landing himself a role in the Ron Howard film Splash (1984), a romantic comedy about a mermaid who washes ashore and learns to live like a human. Candy played a sleazy womanizing brother to the character played by Tom Hanks. The film was a bigger success than even Stripes (1981) and a number of people have said that Splash (1984) was his breakout role. He took a second billing in the comedic film Brewster's Millions (1985) where a man must spend thirty million in order to inherit three hundred million from his deceased relative. Candy played the man's best friend, who accidentally gets in the way as much as helping out. Candy continued making films tirelessly, including the film Armed and Dangerous (1986) where he and Eugene Levy play characters who become security guards. 1987 was an especially good year to Candy, giving him two classic roles: Barf the Mawg in the Mel Brooks comedy Spaceballs (1987) and the bumbling salesman Del Griffith alongside Steve Martin's uptight character in the John Hughes film Planes, Trains & Automobiles (1987). The latter film is a golden classic and is one of Candy's greatest films. He followed up immediately with The Great Outdoors (1988), once again alongside Dan Aykroyd. Candy landed another classic role in the film Uncle Buck (1989) which was about a bumbling uncle who must look after his brother's three children. Although he was in the smash hit Home Alone (1990), Candy's career fell into a slump, turning out unsuccessful films in the early nineties. This caused him to change his strategy by taking more serious roles. The first of these serious roles was the corrupt lawyer Dean Andrews in the 'Oliver Stone' film JFK (1991). The film was a big success, and Candy moved on from this victory to make the film Cool Runnings (1993) about the first Jamaican bobsled team. Candy was well known for his size, six feet two and weighing around 300 pounds. However, he was very sensitive about the subject and in the nineties tried to lose weight and quit smoking. He was aware that heart attacks were in his family: both his father and his grandfather died of heart attacks and Candy wanted to prevent that happening to him as best he could. In the mid-nineties Candy filmed the Michael Moore comedy Canadian Bacon (1995) then went to Mexico to film the western spoof Wagons East (1994). It was in Mexico that Candy had a heart attack and passed away in March 1994. Canadian Bacon (1995) was released a year after his death and is his last film. Candy was loved by thousands of people who loved his classic antics in Splash (1984) and The Great Outdoors (1988). He was well-known for his roles in Stripes (1981) and Uncle Buck (1989) and he himself never forgot his Canadian background.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQ3MzQzODUxMF5BMl5BanBnXkFtZTcwMjY5MTkyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001006","name":"John Candy","idIMDB":"nm0001006"},"actorId":"nm0001006","character":"Harry Crumb","urlCharacter":"http://www.imdb.com/character/ch0023823","main":true},{"actorName":"Jeffrey Jones","urlProfile":"http://www.imdb.com/name/nm0000470","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNjYzMzAyNV5BMl5BanBnXkFtZTYwNzM5MjA0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 September 1946","placeOfBirth":" Buffalo, New York, USA","birthName":"Jeffrey Duncan Jones","height":"6' 4½\" (1.94 m)","bio":"Jeffrey Duncan Jones was born in Buffalo, New York. He is a very tall, fair-haired character actor who is recognized all over for his excellent work. He is a veteran stage actor having such plays as \"The Elephant Man\" and Neil Simon's \"London Suite\" under his belt. His first film role was in The Revolutionary (1970).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNjYzMzAyNV5BMl5BanBnXkFtZTYwNzM5MjA0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000470","name":"Jeffrey Jones","idIMDB":"nm0000470"},"actorId":"nm0000470","character":"Eliot Draisen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Annie Potts","urlProfile":"http://www.imdb.com/name/nm0001633","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0NjkyMDIzMF5BMl5BanBnXkFtZTcwNjc2NTUyMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 October 1952","placeOfBirth":" Franklin, Kentucky, USA","birthName":"Anne Hampton Potts","height":"5' 3\" (1.6 m)","bio":"Interested in stage and film at an early age, Annie Potts attended Stephens College in Missouri, enrolling in the theater studies course, followed by graduate work in California. At the age of 20, she married her college sweetheart, Steven Hartley. Only a short time later, she and her husband were in a serious automobile accident in New Mexico -- their Volkswagen bus was demolished by two drivers who were drag racing. Steve lost a leg, and Annie had multiple fractures (resulting in a traumatic arthritis that still persists). Early roles were primarily in television, such as Black Market Baby (1977), but her presence moved up with an appearance in the mega-hit Ghostbusters (1984), and then she hit the big time with a seven-year stint as one of the stars of Designing Women (1986). A brief period in Love & War (1992) ended with the cancellation of the show, about which she remains resentful.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0NjkyMDIzMF5BMl5BanBnXkFtZTcwNjc2NTUyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001633","name":"Annie Potts","idIMDB":"nm0001633"},"actorId":"nm0001633","character":"Helen Downing","urlCharacter":"http://www.imdb.com/character/ch0023824","main":true},{"actorName":"Tim Thomerson","urlProfile":"http://www.imdb.com/name/nm0859772","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NzEyNzI4MV5BMl5BanBnXkFtZTYwNTY1MDAz._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1946","placeOfBirth":" Coronado, California, USA","birthName":"Joseph Timothy Thomerson","height":"5' 11\" (1.8 m)","bio":"Tim Thomerson rates highly as one of the best, most prolific, versatile and dependable character actors to ever grace both the big and small screens alike with pleasing regularity since the mid 70s. Although often cast as laconic rough 'n' tumble macho guys, Thomerson has proved on many occasions that he can essay comic roles and more substantial dramatic parts with equal skill and conviction. He was born on April 8th, 1946 in Coronado, California and was raised in Hawaii and San Diego. He did a stint in the National Guard prior to getting a job as a prop man and set builder at the Old Globe Theatre in San Diego. Character actor Anthony Zerbe advised Thomerson to get lessons from legendary acting teacher Stella Adler in New York; and he duly studied with Adler for four years. He began his show business career as a stand-up comedian; he performed at the clubs The Bitter End, Bud Friedman's Improvisation and Catch A Rising Star in New York and at the Comedy Store and the Improv in Los Angeles. He eventually even had a guest spot on \"The Tonight Show\" with Johnny Carson. His film debut was with a funny small role in the hilarious \"Car Wash.\" He achieved his greatest enduring cult popularity with his delightfully deadpan portrayal of rugged police detective Jack Deth in the terrific \"Trancers\" and its strictly so-so sequels. Other memorable parts include eccentric police detective Jerry Moriarty in the fine \"Fade to Black,\" weary factory worker Ray in \"Take This Job and Shove It,\" a highway patrolman in Clint Eastwood's poignant and underrated \"Honkytonk Man,\" burnt-out Vietnam vet helicopter pilot Charts in the exciting \"Uncommon Valor,\" grimy mercenary Rhodes in the cheesy \"Metalstorm: The Destruction of Jared-Syn,\" the crazed John Reynolds in \"Volunteers,\" demented cult leader Lester in \"Cherry 2000,\" the tough-as-nails the Sarge in the enjoyably quirky \"Zone Troopers;\" lovely and touching as the gentle Loy in the outstanding \"Near Dark,\" diminutive, but fearless alien lawman Brick Bardo in the funky \"Dollman,\" and a scruffy motorcyclist in Terry Gilliam's unjustly maligned \"Fear and Loathing in Las Vegas.\" Tim has appeared in a large number of films for low-budget independent director Albert Pyon and acted alongside real-life best buddy Brion James in numerous pictures (the two first met while both serving in the National Guard Reserves). On television Thomerson played the half-man, half-woman Gene-Jean on the uproarious, but sadly short-lived sci-fi parody program \"Quark.\" Thomerson also had recurring roles on the TV shows \"Sirens\" and \"Land's End\" and has made guest appearances on countless TV shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NzEyNzI4MV5BMl5BanBnXkFtZTYwNTY1MDAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0859772","name":"Tim Thomerson","idIMDB":"nm0859772"},"actorId":"nm0859772","character":"Vince Barnes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barry Corbin","urlProfile":"http://www.imdb.com/name/nm0179224","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNTYxMDg4Ml5BMl5BanBnXkFtZTcwNTc4ODM3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 October 1940","placeOfBirth":" Lamesa, Texas, USA","birthName":"Leonard Barry Corbin","height":"5' 11\" (1.8 m)","bio":"Barry's full given name is Leonard Barrie Corbin, and he was born on October 16, 1940 in Lamesa, Texas, to Kilmer Blain Corbin, an attorney, and Alma Corbin, an elementary school teacher. Barry has a daughter named Shannon Ross, with whom he shares his 15-acre ranch in Fort Worth, Texas, when he isn't working. He says that he rides horses there every chance he gets.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNTYxMDg4Ml5BMl5BanBnXkFtZTcwNTc4ODM3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0179224","name":"Barry Corbin","idIMDB":"nm0179224"},"actorId":"nm0179224","character":"P.J. Downing","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shawnee Smith","urlProfile":"http://www.imdb.com/name/nm0809938","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MzQ5Mzg2M15BMl5BanBnXkFtZTYwOTE3Nzg0._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 July 1969","placeOfBirth":" Orangeburg, South Carolina, USA","height":"5' 3\" (1.6 m)","bio":"Shawnee Smith has consistently put her versatile talents to use in the film, television, theatrical and musical arenas with much success. Her impressive career includes a co-starring role on an award-winning television show, which is now strong in syndication, and a variety of memorable roles in hit feature films. She also toured America and the U.K. fronting a rather extreme rock band called \"Fydolla Ho\". Smith was born in Orangeburg, South Carolina, to Patricia Ann (Smoak), an oncology nurse, and James H. \"Jim\" Smith, a financial planner and U.S. Air Force pilot. Shawnee's achievements began early in her career when she appeared in the movie Annie (1982). As a young actress, she was awarded the Youth in Film Award for Best Actress in a television film for her role in the CBS drama Crime of Innocence (1985). She was honored with the Dramalogue Critics Award for her performance in the theatrical production \"To Gillian on her 37th Birthday\". In the same year, she received rave reviews for her co-starring role with Richard Dreyfuss at the Huntington Hartford Theatre in \"The Hands of its Enemy\". Shawnee then starred in The Blob (1988) for Columbia Pictures, in the hit comedy Summer School (1987) for Paramount Pictures and in Who's Harry Crumb? (1989), also for Columbia Pictures. Those roles would be followed by appearances in such highly-acclaimed films as Leaving Las Vegas (1995), Armageddon (1998), Desperate Hours (1990) and Breakfast of Champions (1999). Shawnee's television credits are equally as impressive, with a list that includes a regular role on the hit CBS comedy Becker (1998) as well as series regular roles on The Tom Show (1997) and Arsenio (1997). She appeared in the CBS television movies Something Borrowed, Something Blue (1997), I Saw What You Did (1988) and Face of Evil (1996), as well as the miniseries The Stand (1994) and The Shining (1997). Her recent film projects include The Almost Guys (2004), Saw (2004), a gritty, taut and terrifying film and the sequel Saw II (2005). Satisfied with pushing the extremes in her critically-acclaimed punk/metal band \"Fydolla Ho\", Shawnee is working on her first solo record with Queens of the Stone Age producer Chris Goss.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MzQ5Mzg2M15BMl5BanBnXkFtZTYwOTE3Nzg0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0809938","name":"Shawnee Smith","idIMDB":"nm0809938"},"actorId":"nm0809938","character":"Nikki Downing","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Valri Bromfield","urlProfile":"http://www.imdb.com/name/nm0111315","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzM2ZTk0NWEtYTM3Yi00NjE1LWJiZmItZjk4NmYwY2QwOTkxL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI2MDEwNA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1949","placeOfBirth":" Toronto, Ontario, Canada","bio":"Valri Bromfield was born on February 10, 1949 in Toronto, Ontario, Canada. She is a writer and actress, known for The Rosie O'Donnell Show (1996), Inside America's Totally Unsolved Lifestyles (1992) and Nothing But Trouble (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzM2ZTk0NWEtYTM3Yi00NjE1LWJiZmItZjk4NmYwY2QwOTkxL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI2MDEwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0111315","name":"Valri Bromfield","idIMDB":"nm0111315"},"actorId":"nm0111315","character":"Detective Casey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Doug Steckler","urlProfile":"http://www.imdb.com/name/nm0824299","urlPhoto":"","biography":{"bio":"Doug Steckler is a writer and actor, known for SCTV Network (1981), The Show Formerly Known as the Martin Short Show (1995) and The NBC All Star Hour (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0824299","name":"Doug Steckler","idIMDB":"nm0824299"},"actorId":"nm0824299","character":"Dwayne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Renée Coleman","urlProfile":"http://www.imdb.com/name/nm0171187","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMjY1NDczNl5BMl5BanBnXkFtZTcwOTc0MDgwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 January 1962","placeOfBirth":" Saskatoon, Saskatchewan, Canada","bio":"Renée Coleman (born January 8, 1962) is a Canadian actress who has appeared in several TV shows and movies. She is best known for her role on the NBC TV series, Quantum Leap (1989), in which she played the role of Alia, the \"evil leaper\". Coleman is also known for her role in the 1992 box office hit, A League of Their Own (1992), as left-fielder and substitute catcher Alice Gaspers,[1] and in Who's Harry Crumb? (1989), as kidnapping-victim Jennifer Downing. Coleman appeared in several more films through the mid-'90s, including Pentathlon (1994) (one of her last domestic roles), the Mexican film Le jardin de l'Eden (1994), the Polish film Gracze (1995), and the Swiss film Waiting for Michelangelo (1996). In 1995, Coleman left the film business and returned to school, where she earned her Mythological Studies doctorate (with an emphasis on Depth Psychology) at Pacifica Graduate Institute in 2002. She currently lives with her husband and their four children in Santa Clarita, California, where she works in a private practice as a certified DreamTender. In August 2012, Coleman's first book, Icons of a Dreaming Heart - The Art and Practice of Dream-Centered Living, was published.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMjY1NDczNl5BMl5BanBnXkFtZTcwOTc0MDgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0171187","name":"Renée Coleman","idIMDB":"nm0171187"},"actorId":"nm0171187","character":"Jennifer Downing","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wesley Mann","urlProfile":"http://www.imdb.com/name/nm0543019","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MTU0NTYxNl5BMl5BanBnXkFtZTgwMzMyMzU4NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1959","placeOfBirth":" USA","height":"5' 8½\" (1.74 m)","bio":"Wesley Mann was born in 1959 in the USA. He is an actor, known for Back to the Future Part II (1989), My Stepmother Is an Alien (1988) and Soul Surfer (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MTU0NTYxNl5BMl5BanBnXkFtZTgwMzMyMzU4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0543019","name":"Wesley Mann","idIMDB":"nm0543019"},"actorId":"nm0543019","character":"Tim","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tamsin Kelsey","urlProfile":"http://www.imdb.com/name/nm0447064","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMjA5Mjk5Ml5BMl5BanBnXkFtZTgwOTA5MDg3MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"Tamsin Kelsey was born in Vancouver, British Columbia, Canada. She is an actress, known for Needful Things (1993), Who's Harry Crumb? (1989) and Bruiser (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMjA5Mjk5Ml5BMl5BanBnXkFtZTgwOTA5MDg3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0447064","name":"Tamsin Kelsey","idIMDB":"nm0447064"},"actorId":"nm0447064","character":"Marie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe Flaherty","urlProfile":"http://www.imdb.com/name/nm0280886","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3OTk1MTIzOF5BMl5BanBnXkFtZTcwODYyMjkyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 June 1941","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"Joseph O'Flaherty","height":"6' 1\" (1.85 m)","bio":"Joe Flaherty was born on June 21, 1941 in Pittsburgh, Pennsylvania, USA as Joseph O'Flaherty. He is an actor and writer, known for SCTV (1976), Une maison de fous (1990) and SCTV Network (1981). He was previously married to Judith.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3OTk1MTIzOF5BMl5BanBnXkFtZTcwODYyMjkyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0280886","name":"Joe Flaherty","idIMDB":"nm0280886"},"actorId":"nm0280886","character":"Doorman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fiona Roeske","urlProfile":"http://www.imdb.com/name/nm0736450","urlPhoto":"","biography":{"bio":"Fiona Roeske is known for her work on Destination finale (2000), Happy Gilmore (1996) and Dreamcatcher (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0736450","name":"Fiona Roeske","idIMDB":"nm0736450"},"actorId":"nm0736450","character":"Crumb Receptionist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lori O'Byrne","urlProfile":"http://www.imdb.com/name/nm0639936","urlPhoto":"","biography":{"bio":"Lori O'Byrne is an actress, known for Who's Harry Crumb? (1989) and 21 Jump Street (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0639936","name":"Lori O'Byrne","idIMDB":"nm0639936"},"actorId":"nm0639936","character":"Karen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michele Goodger","urlProfile":"http://www.imdb.com/name/nm0328902","urlPhoto":"","biography":{"bio":"Michele Goodger is an actress, known for Little Women (1994), Who's Harry Crumb? (1989) and Les accusés (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0328902","name":"Michele Goodger","idIMDB":"nm0328902"},"actorId":"nm0328902","character":"Mrs. MacIntyre","urlCharacter":"http://www.imdb.com/character/ch0023825","main":true}],"seasons":[],"idIMDB":"tt0098645","urlIMDB":"http://www.imdb.com/title/tt0098645","business":{"budget":null,"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1988/\">1988</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 34 min (94 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arriflex Cameras and Lenses"],"laboratory":["Alpha Cine Service, Vancouver, Canada","Technicolor, Hollywood (CA), USA (prints)"],"filmLength":["2,461 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.8","filmingLocations":[{"location":"Hollywood Freeway, Hollywood, Los Angeles, California, USA"}],"rated":"PG-13","awards":[],"votes":"13,083","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005883","name":"TriStar Pictures"},{"idCompany":"co0065874","name":"NBC Productions"},{"idCompany":"co0183651","name":"Arnon Milchan Productions"}],"keywords":{"keywords":["detective","kidnapping","detective agency","private investigator","fish tank","bitten by a fish","mansion","wet pants","lawn sprinkler","santa monica california","california","subtitled scene","hit by a door","paper shredder","pencil sharpener","electric pencil sharpener","car accident","ford mustang","rental car","orange tree","window cleaner","hotel","hotel room","van","portrait painting","company president","shipping magnate","beautician","newspaper headline","fake beard","rubber boots","covered in mud","health spa","hit with a boot","man dressed as woman","cross dressing","mud bath","tic tac toe","gender disguise","bumbling hero","secretary","kidnapped daughter","bus","sister sister relationship","businessman","aikido","tycoon","check","confession","playing footsie","photograph","martial arts","knocked out","cowboy boots","electrocution","shed","airplane","blindfold","metal detector","model","poster","cattle prod","double cross","airport security","scene during opening credits","woman undressing","undressing","woman in peril","caged human","chain","tied to a chair","chained to a chair","pistol whip","held at gunpoint","pistol","tie","intercom","looking through a window","crashing through a window","ransom note","love triangle","jockey","saab","airport","extramarital affair","cheating wife","following someone","dumpster","plot to kill husband","camera","crossed eyes","little boy","ceiling fan","security guard","air vent","coin","cage","held captive","arrest","mud","tennis court","tennis coach","tennis racket","tampered brakes","dinosaur egg","suitcase full of money","ransom money","comedy of errors","slapstick comedy","fish hook","fishing rod","butler","counting money","tracking device","telephone booth","car crash","intergenerational friendship","classic car","teenage girl","amateur sleuth","hiding in a trunk","runaway car","man girl relationship","fat man","obesity","falling into water","restaurant","dinner table","dinner","convertible","obese","overweight","female police detective","police detective","police","policewoman","ransom demand","ransom","race track","father daughter relationship","husband wife relationship","adultery","bicycle","dinosaur skeleton","office","treadmill","master of disguise","turban","private detective","three word title","question mark in title","cut and paste note","sucker punch","male to female footsie playing","male to male footsie playing","female to male footsie playing","question in title","kidnapped woman","chloroform","footsie under the table","stupidity","photography","massage","impersonation","female impersonation","disguise","crazy","cheating","teenage daughter","steel plate in head","brake failure","screwball","title spoken by character","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:35:51"}}