{"data":{"movies":[{"title":"The Happy Prince","originalTitle":"","year":"1974","releaseDate":"19741202","directors":[{"name":"Michael Mills","id":"nm3382237"}],"writers":[{"name":"Michael Mills","id":"nm3382237"},{"name":"Oscar Wilde","id":"nm0928492"}],"runtime":"25 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmRjMjFmYjAtOWQ0Ni00ZjhiLWFiZmQtZjY2YTAxMzRiNGIyXkEyXkFqcGdeQXVyNjU4OTk0ODk@._V1.jpg","countries":["Canada"],"languages":["English"],"genres":["Animation","Short","Drama","Fantasy","Romance"],"plot":"A royal statue makes friends with a small swallow.","simplePlot":"A royal statue makes friends with a small swallow.","actors":[{"actorName":"Christopher Plummer","urlProfile":"http://www.imdb.com/name/nm0001626","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MzQ5MDY3NF5BMl5BanBnXkFtZTcwNzMxOTU5Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1929","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Arthur Christopher Orme Plummer","height":"5' 10½\" (1.79 m)","bio":"Arthur Christopher Orme Plummer was born in Toronto, Ontario. He is the only child of Isabella Mary (Abbott), a secretary to the Dean of Sciences at McGill University, and John Orme Plummer, who sold securities and stocks. He is a great-grandson of John Abbott, who was Canada's third Prime Minister (from 1891 to 1892), and a great-great-great-grandson of Anglican clergyman John Bethune. He has Scottish, English, and Anglo-Irish ancestry. Plummer was raised in Senneville, Quebec, by Montreal. Until the 2009 Academy Awards were announced, it could be said about Plummer that he was the finest actor of the post-World War II period to fail to get an Academy Award. In that, he was following in the footsteps of the late great John Barrymore, whom Plummer so memorably portrayed on Broadway in a one-man show that brought him his second Tony Award. In 2010, Plummer finally got an Oscar nod for his portrayal of another legend, Leo Tolstoy in Tolstoï, le dernier automne (2009). Two years later, the first paragraph of his obituary was written when the 82-year-old Plummer became the oldest person in Academy history to win an Oscar. He won for playing a senior citizen who comes out as gay after the death of his wife in the movie Beginners (2010). As he clutched his statuette, the debonaire thespian addressed it thusly: \"You're only two years older than me darling, where have you been all of my life?\" Plummer then told the audience that at birth, \"I was already rehearsing my Academy acceptance speech, but it was so long ago mercifully for you I've forgotten it.\" The Academy Award was a long time in coming and richly deserved. Aside from the youngest member of the Barrymore siblings (which counted Oscar-winners Ethel Barrymore and Lionel Barrymore in their number), Christopher Plummer is the premier Shakespearean actor to come out of North America in the 20th century. He was particularly memorable as Hamlet, Iago and Lear, though his Macbeth opposite Glenda Jackson was -- and this was no surprise to him due to the famous curse attached to the \"Scottish Play\" -- a failure. Plummer also has given many fine portrayals on film, particularly as he grew older and settled down into a comfortable marriage with his third wife Elaine. He thanked her from the stage during the 2012 Oscar telecast, quipping that she \"deserves the Nobel Peace Prize for coming to my rescue every day of my life.\" Like another great stage actor, Richard Burton, the younger Plummer failed to connect with the screen in a way that would make him a star. Dynamic on stage, the charisma failed to transfer through the lens onto celluloid. Burton's early film career, when he was a contract player at 20th Century-Fox, failed to ignite despite his garnering two Oscar nominations early on. He did not become a superstar until the mid-1960s, after hooking up with Elizabeth Taylor on the set of Cleopatra (1963). It was Liz whom he credited with teaching him how to act on film. Christopher Plummer never made it as a leading man in films. Perhaps if he had been born earlier, and acted in the studio system of Hollywood's golden age, he could have been carefully groomed for stardom. As it was he shared the English stage actors' disdain -- and he was equally at home in London as he was on the boards of Broadway or on-stage in his native Canada -- for the movies, which did not help him in that medium, as he has confessed. As he aged, Plummer excelled at character parts. He was always a good villain, this man who garnered kudos playing Lucifer on Broadway in Archibald Macleish's Pulitzer Prize-winning \"J.B.\". Though he likely always be remembered as \"Captain Von Trapp\" in the atomic bomb-strength blockbuster The Sound of Music (1965) (a film he publicly despised until softening his stance in his 2008 autobiography \"In Spite of Me\"), his later film work includes such outstanding performances as the best cinema Sherlock Holmes--other than Basil Rathbone -- in Murder by Decree (1979), the chilling villain in L'argent de la banque (1978), his iconoclastic Mike Wallace in The Insider (1999), the empathetic psychiatrist in A Beautiful Mind (2001), and as Leo Tolstoy in Tolstoï, le dernier automne (2009). It was this last role that finally brought him recognition from the Academy of Motion Picture Arts & Sciences, when he was nominated as Best Actor in a supporting role. Plummer remains one of the most respected and honored actors performing in the English language. He's won two Emmy Awards out of six nominations stretching 46 years from 1959 and 2005, and one Genie Award in five nominations from 1980 to 2004. For his stage work, Plummer has racked up two Tony Awards on six nominations, the first in 1974 as Best Actor (Musical) for the title role in \"Cyrano\" and the second in 1997, as Best Actor (Play), in \"Barrymore\". Surprisingly, he did not win (though he was nominated) for his masterful 2004 performance of \"King Lear\", which he originated at the Stratford Festival in Ontario and brought down to Broadway for a sold-out run. His other Tony nominations show the wide range of his talent, from a 1959 nod for the Elia Kazan-directed production of Macleish's \"J.B.\" to recognition in 1994 for Harold Pinter's \"No Man's Land\", with a 1982 Best Actor (Play) nomination for his \"Iago\" in William Shakespeare's \"Othello\". He continues to be a very in-demand character actor in prestigious motion pictures. If he were English rather than Canadian, he'd have been knighted long ago. (In 1968, he was awarded Companion of the Order of Canada, the country's highest civilian honor and one which required the approval of the sovereign, Queen Elizabeth II.) If he lived in the company town of Los Angeles rather than in Connecticut, he likely would have several more Oscar nominations before winning his first for \"The Last Station\". As it is, as attested to in his witty and well-written autobiography, Christopher Plummer has been amply rewarded in life. In 1970, Plummer - a self-confessed 43-year-old \"bottle baby\" - married his third wife, dancer Elaine Taylor, who helped wean him off his dependency on alcohol. They live happily with their dogs on a 30-acre estate in Weston, Connecticut. Although he spends the majority of his time in the United States, he remains a Canadian citizen. His daughter, with actress Tammy Grimes, is actress Amanda Plummer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MzQ5MDY3NF5BMl5BanBnXkFtZTcwNzMxOTU5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001626","name":"Christopher Plummer","nicknames":["Chris"],"idIMDB":"nm0001626"},"actorId":"nm0001626","character":"The Happy Prince","urlCharacter":"http://www.imdb.com/character/ch0131762","main":true},{"actorName":"Glynis Johns","urlProfile":"http://www.imdb.com/name/nm0424318","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwOTAzMjg4NV5BMl5BanBnXkFtZTYwNjg4ODc3._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 October 1923","placeOfBirth":" Pretoria, South Africa","birthName":"Glynis Margaret P. Johns","height":"5' 4\" (1.63 m)","bio":"Husky voiced Glynis is the daughter of actor Mervyn Johns. Best known for her light comedy roles and often playful flirtation, Glynis was born in South Africa while her parents were on tour there (her mother was a concert pianist) but was always proud of her Welsh roots and took delight in playing the female lead (opposite Richard Burton) in the classic Under Milk Wood (1972). Glynis is probably best known for her role as the suffragette mother in Mary Poppins (1964) although she is probably best loved for her fishy roles in Miranda (1948) and Mad About Men (1954). She had earlier showed she could take on the serious roles as well as in Frieda (1947). Most recently seen (at the time of writing) in Superstar (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwOTAzMjg4NV5BMl5BanBnXkFtZTYwNjg4ODc3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0424318","name":"Glynis Johns","nicknames":["The Girl with the Upside-Down Eyes"],"idIMDB":"nm0424318"},"actorId":"nm0424318","character":"Swallow","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Codner","urlProfile":"http://www.imdb.com/name/nm3514067","urlPhoto":"","biography":{"bio":"John Codner was an actor, known for Strangers at the Door (1977), The Happy Prince (1974) and Shoestring Theatre (1959). He died in 1989.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3514067","name":"John Codner","idIMDB":"nm3514067"},"actorId":"nm3514067","character":"Additional Voices","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jill Frappier","urlProfile":"http://www.imdb.com/name/nm0292021","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMzQzNDk2NV5BMl5BanBnXkFtZTgwMDQ1NjYwMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Jill Frappier is known for her work on Sailor Moon (1995), Strange Brew (1983) and Le bonheur au bout du chemin III (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMzQzNDk2NV5BMl5BanBnXkFtZTgwMDQ1NjYwMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0292021","name":"Jill Frappier","idIMDB":"nm0292021"},"actorId":"nm0292021","character":"Additional Voices","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Howard Ryshpan","urlProfile":"http://www.imdb.com/name/nm0753447","urlPhoto":"","biography":{"dateOfBirth":"5 December 1932","placeOfBirth":" Montreal, Quebec, Canada","bio":"Howard Ryshpan was born on December 5, 1932 in Montreal, Quebec, Canada. He is known for his work on The Mysterious Cities of Gold (1982), Rabid (1977) and Pinocchio le robot (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0753447","name":"Howard Ryshpan","idIMDB":"nm0753447"},"actorId":"nm0753447","character":"Additional Voices","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0071596","urlIMDB":"http://www.imdb.com/title/tt0071596","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["25 min"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"8.5","filmingLocations":[],"awards":[],"votes":"208","type":"Movie","companyCreditsSimple":[{"idCompany":"co0032648","name":"Potterton Productions"},{"idCompany":"co0043149","name":"Reader's Digest"}],"keywords":{"keywords":["based on short story","fable","england"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 22:16:28"}}