{"data":{"movies":[{"title":"Inside Moves","originalTitle":"","year":"1980","releaseDate":"19810909","directors":[{"name":"Richard Donner","id":"nm0001149"}],"writers":[{"name":"Todd Walton","id":"nm0910587"},{"name":"Valerie Curtin","id":"nm0193224"}],"runtime":"113 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NzY3Mzc1N15BMl5BanBnXkFtZTcwNzQyMDMyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama"],"plot":"After a failed suicide attempt leaves him partially crippled, Roary begins spending a lot of time at a neighborhood bar full of interesting misfits. When Jerry the bartender suddenly finds himself playing basketball for the Golden State Warriors, Roary and the rest of the bar regulars hope his success will provide a lift to their sagging spirits. Will Jerry forget his friends? What about his junkie hooker girlfriend and her pimp?","simplePlot":"After a failed suicide attempt leaves him partially crippled, Roary begins spending a lot of time at a neighborhood bar full of interesting misfits. When Jerry the bartender suddenly finds ... ","actors":[{"actorName":"John Savage","urlProfile":"http://www.imdb.com/name/nm0001698","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NTkyMzA0OF5BMl5BanBnXkFtZTcwNjA0MjQ3OA@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1949","placeOfBirth":" Old Bethpage, Long Island, New York, USA","birthName":"John Smeallie Youngs","height":"5' 9½\" (1.77 m)","bio":"This American film actor also multitasks as a producer, composer and production manager. He rose to fame in the 1970s, praised for his range and sensitivity. His blonde rugged looks helped viewers connect even more easily to his powerful performances. Born John Youngs in Old Bethpage, New York, Savage attended the American Academy of Performing Arts. The Long Island boy debuted on Broadway in the chorus of \"Fiddler On the Roof\". He ended up playing one of the sons, after another actor fell sick. During this production, managers Stewart Cohen and Rudy Altobelli discovered Savage. Between 1972 and 1975, Savage did a number of films, a TV show and spent three years doing theater in Chicago; \"One Flew Over the Cuckoo's Nest\" and \"Dance on a Country Grave\". He subsequently moved to Los Angeles to star in \"Eric\" with Patricia Neal and Mark Hamill, and then was cast by director Ulu Grosbard to play \"Bobby\" in the original production of David Mamet's \"American Buffalo\". Savage first made a major splash with The Deer Hunter (1978), winner of the 1979 Best Picture Oscar. The film's impact on Hollywood and America remains enormous. Director Michael Cimino cast him as \"Steven\", who returns from Vietnam missing his legs. The following year, this actor enjoyed leads in two more big pictures: the film adaptation of Joseph Wambaugh's The Onion Field (1979) and Milos Forman's musical Hair (1979). Savage played the corn-fed recruit \"Claude Hooper Bukowski\", who turns on, tunes in and drops out. Critics and film historians celebrated his performance -- both then and now. In fact, John Willis' \"Screen World\" hailed him as one of the 12 promising new actors of 1979 (Vol. 31). In another major role, Savage appeared as the suicide-survivor in Richard Donner's Inside Moves (1980). Sensitive and moving, this feel-good film delivers a powerful message about overcoming adversity. He was nominated for Best Actor-Foreign for his work in L'homme de Prague (1981). He went on to co-star in Maria's Lovers (1984) with Nastassja Kinski, backed by cinema legend Robert Mitchum. Later films include Oliver Stone's Salvador (1986) and Francis Ford Coppola's The Godfather: Part III (1990) in place of Robert Duvall (who refused to appear due to a salary dispute). During the late 80s, Savage threw his star power behind the anti-apartheid struggle in South Africa. He continues to work despite his activism, including guest appearances in The X-Files (1993), Star Trek: Voyager (1995), Dark Angel (2000) and various \"Law & Order\" episodes. He first collaborated with director Spike Lee as the bike-riding gentrifier in Do the Right Thing (1989), and then shifted to the camera's other side for Malcolm X (1992) and Summer of Sam (1999). He also had a brief, but powerful, role in Terrence Malick's war epic, The Thin Red Line (1998). Married twice -- first to artist Susan Youngs and later to South African TV star Sandi Schultz -- Savage is the father of ceramic artist Lachlan Youngs and actress/singer/songwriter Jennifer Youngs.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NTkyMzA0OF5BMl5BanBnXkFtZTcwNjA0MjQ3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001698","name":"John Savage","idIMDB":"nm0001698"},"actorId":"nm0001698","character":"Roary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Morse","urlProfile":"http://www.imdb.com/name/nm0001556","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNjUzOTE1N15BMl5BanBnXkFtZTYwNTU4NDQ0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 October 1953","placeOfBirth":" Hamilton, Massachusetts, USA","birthName":"David Bowditch Morse","height":"6' 4\" (1.93 m)","bio":"David Morse, a 6' 4\" tall blue-eyed blond who performed on stage for 10 years before breaking into film, became established as a respected supporting, character actor and second lead. He was born the first of four children of Charles, a sales manager, and Jacquelyn Morse, a schoolteacher, on October 11, 1953, in Beverly, Massachusetts. He grew up with three younger sisters. After graduating from high school, Morse studied acting at the William Esper Studio. In 1971, he began his professional acting career appearing in over 30 productions with the Boston Repertory Company from 1971 to 1977. In the late 1970s, Morse continued his stage career with the Circle Repertory Company in New York before moving into television and film. In the late 1990s, he returned to the Off-Broadway stage starring in Paula Vogel's Pulitzer Prize winning drama, \"How I Learned to Drive\" (1997), for which he won the Drama Desk Award and the Obie. Morse made his big screen debut in 1980 co-starring as \"Jerry Maxwell\", a cheerful bartender turned basketball player, opposite John Savage and Diana Scarwid in Inside Moves (1980), written by Barry Levinson and directed by Richard Donner. Although Inside Moves (1980) was nominated for an Oscar, Morse had to wait a few years until his career took off. His big break came in 1982 when he was cast as Dr. Jack \"Boomer\" Morrison, a young doctor who struggles as a single parent after the death of his wife, in St. Elsewhere (1982), a medical drama that ran for six seasons. He co-starred as opposite Jodie Foster and young Jena Malone in the Oscar nominated Sci-Fi drama Contact (1997). In 1999, he appeared in Stephen King's The Green Mile (1999), with Tom Hanks. A year later, he played a supporting role as a kidnapped husband of Meg Ryan in Proof of Life (2000). In 2002, Morse became the first English-speaking actor nominated for the Golden Horse Award, the Chinese equivalent of the Oscars, for his superb performance as FBI expert \"Kevin Richter\" in Double Vision (2002). From 2002 to 2004, Morse had a regular gig starring as \"Mike Olshansky\", an ex-Philadelphia policeman turned cab driver, in the TV series Hack (2002) which ran three seasons and was filmed in Philadelphia, close to his home. In 2006-2007, he has a recurring role on season 3 of an Emmy award-winning medical drama House (2004). David Morse has been married to fellow actress Susan Wheeler Duff since 1982. They have three children, one daughter and twin sons. In 1994, after the the Northridge earthquake destroyed his home in Sherman Oaks, Morse moved from LA to Philadelphia with his family, and resides in his wife's hometown.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNjUzOTE1N15BMl5BanBnXkFtZTYwNTU4NDQ0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001556","name":"David Morse","idIMDB":"nm0001556"},"actorId":"nm0001556","character":"Jerry Maxwell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Diana Scarwid","urlProfile":"http://www.imdb.com/name/nm0769311","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwOTIzNjg4M15BMl5BanBnXkFtZTcwNDE0ODU5Mg@@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 August 1955","placeOfBirth":" Savannah, Georgia, USA","birthName":"Diana Elizabeth Scarwid","height":"5' 5\" (1.65 m)","bio":"Listed as one of twelve \"Promising New Actors of 1980\" in John Willis's Screen World, Vol 32. Diana Scarwid was Born August 27, 1955 in Savannah, Georgia. She left Georgia for New York at the age of 17 to pursue acting. She attended Pace University and the American Academy of Dramatic Arts. After various performances in television and made-for-television films, she went on to earn an Academy Award nomination for Best Actress in a Supporting Role for her performance as John Savage's girlfriend in Inside Moves (1980). A year later, she came to star in perhaps her most recognized role, the portrayal of Christina Crawford, Joan Crawford's allegedly abused and adopted daughter in the film adaptation of Christina Crawford's self-penned memoir, Mommie Dearest (1981). The film was poorly received as a dramatic interpretation but found a second life as a camp classic. The same year, her performance as Louise, Roary's (played by John Savage) girlfriend in Richard Donner's film adaptation of Todd Walton's Inside Moves (1980) was acknowledged with an Academy Award nomination. She lost to Mary Steenburgen for her performance in Melvin and Howard (1980).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwOTIzNjg4M15BMl5BanBnXkFtZTcwNDE0ODU5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0769311","name":"Diana Scarwid","idIMDB":"nm0769311"},"actorId":"nm0769311","character":"Louise","urlCharacter":"http://www.imdb.com/character/ch0032790","main":true},{"actorName":"Amy Wright","urlProfile":"http://www.imdb.com/name/nm0942195","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NzE5NzgzMl5BMl5BanBnXkFtZTcwNzExMTkwMw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 April 1950","placeOfBirth":" Chicago, Illinois, USA","bio":"One of those dazzling chameleon players who never received their due, Amy Wright is still woefully unrecognized despite a superb resumé of Southern-styled film credits since the late 70s. On the other side of the coin, she has certainly made a distinct name for herself in the theater world as the embodiment of down-home eccentricity. As a testament to her interesting dichotomy as an offbeat actress, she played much younger than she was at the onset of her career; these days she tends to play older. Born on April 15, 1950, in Chicago, Amy was raised in the Midwest and eventually attended Beloit College. She gave up her position as a teacher to pursue her dream to be an actress in New York. Elfin in quality with an intriguing, gap-toothed look, the child-like blonde actress found almost immediate reassurance as an apprentice at actor Rip Torn's Sanctuary Theater, making her stage debut in the company's 1975 production of \"Agnes and Joan\". Amy and her much older mentor (then married to theater legend Geraldine Page) began a clandestine personal relationship that produced two daughters. Torn never divorced Ms. Page and his longtime relationship with Amy was exposed shortly before his wife's sudden death of a heart attack in 1987. The couple eventually married. Interestingly, Amy appeared with both Torn and Ms. Page in the August Strindberg short plays \"Miss Julie\", \"Creditors\" and \"The Stronger\" in 1977 in repertory at the Hudson Guild Theatre, later taking the last two plays to the Public Theater. Amy's sweetly countrified look and demeanor inspired a number of standout performances in high quality productions. At age 26, she earned her first major attention on stage playing a crippled teen in a successful revival of Lanford Wilson's \"The Rimers of Eldrich\" in 1976. Two years later Wilson wrote the stage part of a lifetime for her as 13-year-old Shirley Tally in his acclaimed work \"Fifth of July\" off-Broadway in 1978. The show made a spectacular transition to Broadway in 1980. In 1983 she shared the Drama Desk Award for her ensemble contribution in the comedy farce \"Noises Off\". Amy's film debut was in trademark quirky form with Martha Coolidge's documentary-styled Not a Pretty Picture (1976), and she went on to minor roles in the small-town \"A\" pictures The Deer Hunter (1978) and Breaking Away (1979). Arguably one of her most spellbinding film appearances came as Harry Dean Stanton's religiously wacko 15-year-old daughter, Sabbath Lily, in John Huston's Wise Blood (1979), following this with an equally strange comic role as a bed-hopping groupie in Woody Allen's Stardust Memories (1980). Amy also shared moments of brilliance opposite John Savage's handicapped lead in Inside Moves (1980); as William Hurt's spinster sis in The Accidental Tourist (1988); in Beth Henley's Southern-baked beauty contest spoof Miss Firecracker (1989); and as Jeff Daniels' soon-to-be-married sister in Love Hurts (1990). As much as these performances should have placed her at the very top of the Hollywood echelon of character players, Wright was surprisingly ignored for film awards and continued more or less obscurely. Nevertheless, she continued to make strong stage showings opposite the late Uta Hagen in the Off-Broadway winner \"Mrs. Klein\" in 1995, and as part of the familial comedy relief in \"Lake Hollywood\" (1999). Other reported stage appearances over time have included \"Breakfast with Les and Bes\", \"Hamlet\", A Village Wooing\", \"The Little Foxes\" and \"Prin\". On camera she continues with her thoroughly offbeat ways in such movies as The Scarlet Letter (1995), Tom and Huck (1995) (as Aunt Polly), Winning Girls Through Psychic Mind Control (2002), Messengers (2004) and her most recent, The Namesake (2006), along with rare TV appearances in such popular shows as \"Law and Order\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NzE5NzgzMl5BMl5BanBnXkFtZTcwNzExMTkwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0942195","name":"Amy Wright","idIMDB":"nm0942195"},"actorId":"nm0942195","character":"Anne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony Burton","urlProfile":"http://www.imdb.com/name/nm0123748","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwMDY1NTEzNjJeQTJeQWpwZ15BbWU3MDY0MTA0MDg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 March 1937","placeOfBirth":" Flint, Michigan, USA","birthName":"Anthony Mabron Burton","height":"6' (1.83 m)","bio":"Tony Burton, who is famous for playing the corner man in six \"Rocky\" movies, was himself, in real life, a professional heavyweight boxer. Boxing in such avenues as Palm Springs, Los Angeles, and Hollywood, California, the 6 feet 200 pound Burton knocked-out among others, Bob Smith and Denny Chaney. His most important match was an April 4, 1959 6th round knockout defeat at the hands of undefeated Lamar Clark at Palm Springs, California. Clark was the 10th rated heavyweight and had won 38 straight knockouts. Burton gave as good as he got for 5 rounds, but Clark's relentless mauling style finally wore him down.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwMDY1NTEzNjJeQTJeQWpwZ15BbWU3MDY0MTA0MDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0123748","name":"Tony Burton","nicknames":["Hollywood"],"idIMDB":"nm0123748"},"actorId":"nm0123748","character":"Lucius","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Henderson","urlProfile":"http://www.imdb.com/name/nm0376347","urlPhoto":"","biography":{"dateOfBirth":"19 March 1926","placeOfBirth":" Chicago, Illinois, USA","birthName":"William Randall Henderson","bio":"Bill Henderson was born on March 19, 1926 in Chicago, Illinois, USA as William Randall Henderson. He was an actor, known for Clue (1985), White Men Can't Jump (1992) and City Slickers (1991). He was married to Ritsuyo Moriyasu. He died on April 3, 2016 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0376347","name":"Bill Henderson","idIMDB":"nm0376347"},"actorId":"nm0376347","character":"Blue Lewis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steve Kahan","urlProfile":"http://www.imdb.com/name/nm0434676","urlPhoto":"","biography":{"dateOfBirth":"1930","placeOfBirth":"","height":"6' 1½\" (1.87 m)","bio":"Kahan is the cousin of film writer, producer and director Richard Donner. Kahan may be best known for playing the bedraggled \"Captain Ed Murphy\" trying to keep Mel Gibson and Danny Glover in check in the \"Lethal Weapon\" series of films. He has appeared in several television series as recurring characters as well.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0434676","name":"Steve Kahan","idIMDB":"nm0434676"},"actorId":"nm0434676","character":"Burt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack O'Leary","urlProfile":"http://www.imdb.com/name/nm0641591","urlPhoto":"","biography":{"dateOfBirth":"10 June 1935","placeOfBirth":" Louisville, Kentucky, USA","birthName":"John Charles O'Leary","bio":"Jack O'Leary was born on June 10, 1935 in Louisville, Kentucky, USA as John Charles O'Leary. He was an actor, known for The Goonies (1985), Reds (1981) and The Rose (1979). He died on September 28, 1989 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0641591","name":"Jack O'Leary","idIMDB":"nm0641591"},"actorId":"nm0641591","character":"Max","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bert Remsen","urlProfile":"http://www.imdb.com/name/nm0719037","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI1NDI0NDgyN15BMl5BanBnXkFtZTcwNTk5NzYxOA@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 February 1925","placeOfBirth":" Glen Cove, Long Island, New York, USA","birthName":"Herbert Birchell Remsen","bio":"American character actor who became a casting director following an accident, then returned to acting years later. The son of a New York policeman, Remsen lived a colorful life before turning to acting. He made his film debut in 1959 and was busy before the cameras in both film and television. Five years later, however, a collapsing crane on the set of the TV series No Time for Sergeants (1964) broke his back and nearly killed him. He recuperated for months and was able to walk again with crutches, but he believed his acting career was ended. He became a casting director, eventually heading the casting department of Lorimar Productions. While casting the film Brewster McCloud (1970), he was given a role by director Robert Altman. Though he continued to work in casting with his wife and partner Barbara Dodd, he resumed his acting career, working in scores of films and television episodes, most of the time requiring only a cane to walk. He appeared in many of Altman's films and was a popular figure in the film industry for his generosity and his vivid story-telling. He died in his sleep at age 74 in 1999.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI1NDI0NDgyN15BMl5BanBnXkFtZTcwNTk5NzYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0719037","name":"Bert Remsen","idIMDB":"nm0719037"},"actorId":"nm0719037","character":"Stinky","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harold Russell","urlProfile":"http://www.imdb.com/name/nm0751174","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU3MDYwODgyNl5BMl5BanBnXkFtZTcwNTU4OTQwNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 January 1914","placeOfBirth":" North Sydney, Nova Scotia, Canada","birthName":"Harold John Russell","bio":"Harold John Russell was born in Nova Scotia in 1914. His family moved to Cambridge Massachusetts when his father died in 1919. He was training paratroopers at Camp MacKall NC on June 6, 1944 when some TNT he was using exploded in his hands. He lost both hands. After receiving hooks, and training on them, he was chosen to make an Army training film called \"Diary Of A Sergeant\". William Wyler saw the film and decided to cast him in The Best Years of Our Lives (1946). Harold Russell played Homer Parish. For this role he received 2 Oscars, a Best Supporting and one for being an inspiration to all returning veterans. He is the only actor to receive 2 Oscars for the same role. After the movie he attended Boston University. He later went on to help establish AMVETS as a viable alternative to the American Legion for veterans, though his dream of an international veterans organization was never realized. He later appeared in Inside Moves (1980) and Dogtown (1997). He lived with his wife on Cape Cod in Massachusetts. He wrote 2 biographies: \"Victory In My Hands\" (1947) & \"The Best Years Of My Life\" (1981).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU3MDYwODgyNl5BMl5BanBnXkFtZTcwNTU4OTQwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0751174","name":"Harold Russell","idIMDB":"nm0751174"},"actorId":"nm0751174","character":"Wings","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pepe Serna","urlProfile":"http://www.imdb.com/name/nm0785277","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MDgyMDM4NF5BMl5BanBnXkFtZTcwNjU5ODEzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 July 1944","placeOfBirth":" Corpus Christi, Texas, USA","bio":"The ever-reliable Hispanic-American actor Pepe Serna has appeared in more than 100 feature films and 300 television shows, but is most recognized for his performances in several motion pictures, including Scarface (1983) with Al Pacino, Silverado starring Kevin Costner (1985), The Rookie (1990) with Clint Eastwood, and American Me (1992) with Edward James Olmos. Born in Corpus Christi, Texas in 1944, Serna was initially discovered by producer Hal Wallis and debuted in his film Red Sky at Morning (1971). Pepe's sideline as a painter has met with critical success and he has been commissioned quite frequently. His vibrant paintings and recent one-man stage shows reflect a serious return to his Mexican roots.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MDgyMDM4NF5BMl5BanBnXkFtZTcwNjU5ODEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0785277","name":"Pepe Serna","idIMDB":"nm0785277"},"actorId":"nm0785277","character":"Herrada","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harold Sylvester","urlProfile":"http://www.imdb.com/name/nm0843221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzQzNjExNF5BMl5BanBnXkFtZTgwMzc2OTcyODE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1949","placeOfBirth":" New Orleans, Louisiana, USA","height":"6' 4\" (1.93 m)","bio":"Harold Sylvester was born on February 10, 1949 in New Orleans, Louisiana, USA. He is an actor and producer, known for An Officer and a Gentleman (1982), Innerspace (1987) and Married with Children (1987). He has been married to Kathleen since 1970. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzQzNjExNF5BMl5BanBnXkFtZTgwMzc2OTcyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0843221","name":"Harold Sylvester","idIMDB":"nm0843221"},"actorId":"nm0843221","character":"Alvin Martin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arnold Williams","urlProfile":"http://www.imdb.com/name/nm0930046","urlPhoto":"","biography":{"dateOfBirth":"1935","placeOfBirth":"","bio":"Arnold Williams was born in 1935. He is an actor, known for Live and Let Die (1973), The Panic in Needle Park (1971) and The King of Marvin Gardens (1972).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0930046","name":"Arnold Williams","idIMDB":"nm0930046"},"actorId":"nm0930046","character":"Benny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Brenlin","urlProfile":"http://www.imdb.com/name/nm0107229","urlPhoto":"","biography":{"dateOfBirth":"10 October 1927","placeOfBirth":" Pitcairn, Pennsylvania, USA","birthName":"George Henry Brendlinger","bio":"George Brenlin was born on October 10, 1927 in Pitcairn, Pennsylvania, USA as George Henry Brendlinger. He was an actor, known for General Hospital (1963), Fight for the Title (1957) and Cimarron (1960). He was married to Kay Nickell. He died on August 21, 1986 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0107229","name":"George Brenlin","idIMDB":"nm0107229"},"actorId":"nm0107229","character":"Gil","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gerri Dean","urlProfile":"http://www.imdb.com/name/nm0212783","urlPhoto":"","biography":{"bio":"Gerri Dean is an actress, known for Inside Moves (1980), Murdock's Gang (1973) and Cannon (1971).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0212783","name":"Gerri Dean","idIMDB":"nm0212783"},"actorId":"nm0212783","character":"Hooker","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0080928","urlIMDB":"http://www.imdb.com/title/tt0080928","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 53 min (113 min)"],"soundMix":["Mono"],"color":["Color (Technicolor)"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Technicolor, USA"],"filmLength":["3,095 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm"]},"rating":"7.4","filmingLocations":[{"location":"Echo Park, Los Angeles, California, USA"}],"rated":"PG","awards":[{"award":"Academy Awards, USA 1981","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Actress in a Supporting Role","names":[{"name":"Diana Scarwid","id":"nm0769311","role":null}]}]}]}],"votes":"1,153","type":"Movie","companyCreditsSimple":[{"idCompany":"co0064560","name":"Goodmark Productions Inc."}],"keywords":{"keywords":["bar","bartender","failed suicide","basketball","jumping out a window","san francisco california","bay area","falling from height","jumping from height","san francisco bay area california","group of friends","waitress","wheelchair bound","wheelchair","boyfriend girlfriend relationship","basketball court","basketball game","basketball player","card game","playing cards","ambulance","attempted suicide","body landing on a car","disabled","cripple","disabled person","two word title","suicide attempt","self esteem","personality change","operation","money","hospital","handicapped","friendship","compassion","recovery","handicapped actor","based on novel","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:30:00"}}