{"data":{"movies":[{"title":"Deal of the Century","originalTitle":"","year":"1983","releaseDate":"19831104","directors":[{"name":"William Friedkin","id":"nm0001243"}],"writers":[{"name":"Paul Brickman","id":"nm0001887"},{"name":"Bernard Edelman","id":"nm0248975"}],"runtime":"99 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNDgyNjcwMl5BMl5BanBnXkFtZTcwOTMwNjIzMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Crime"],"plot":"Arms dealers from several companies vie to sell the most expensive and highest tech weapons to a South American dictator. There are complications; understanding the exact nature of how 'gifts' are used to grease the wheels of a sale, a religious conversion from one of the salesman and a romance that begins to grow between two competitors, not to mention the imminient financial collapse of one of the companies if they don't make this sale.","simplePlot":"A small time arms dealer in South America to sell weapons to the revolutionaries, winds up negotiating the sale of an experimental plane to the nation's dictator.","actors":[{"actorName":"Chevy Chase","urlProfile":"http://www.imdb.com/name/nm0000331","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNTY2ODA4OV5BMl5BanBnXkFtZTcwOTE1NjAxMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 October 1943","placeOfBirth":" New York City, New York, USA","birthName":"Cornelius Crane Chase","height":"6' 4\" (1.93 m)","bio":"Chevy Chase was born Cornelius Crane Chase in Lower Manhattan, New York, to Cathalene Parker (Browning), a concert pianist and librettist, and Edward Tinsley \"Ned\" Chase, an editor and writer. His parents both came from prominent families, and his grandfathers were artist and illustrator Edward Leigh Chase and admiral Miles Browning. His recent ancestry includes English, Scottish, Irish, and Danish. His grandmother gave him the nickname \"Chevy\" when he was two years old. Chase was a part of the Saturday Night Live (1975) cast from its debut until 1976, and then embarked on a highly successful movie career. He scored in the eighties with hits such as Caddyshack (1980), National Lampoon's Vacation (1983) and its sequels, Fletch (1985) and Fletch Lives (1989). All his films show his talent for deadpan comedy. Sadly, his career generally worsened throughout the nineties, starring in disappointments such as the mediocre Memoirs of an Invisible Man (1992), and Cops and Robbersons (1994). More recently, Community (2009) marked a return for him, as he played a regular role for the first four seasons.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNTY2ODA4OV5BMl5BanBnXkFtZTcwOTE1NjAxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000331","name":"Chevy Chase","idIMDB":"nm0000331"},"actorId":"nm0000331","character":"Eddie Muntz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sigourney Weaver","urlProfile":"http://www.imdb.com/name/nm0000244","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MTcyNTE3OV5BMl5BanBnXkFtZTcwMTA0MTMyMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 October 1949","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Susan Alexandra Weaver","height":"5' 11\" (1.8 m)","bio":"Sigourney Weaver was born Susan Alexandra Weaver in Leroy Hospital in Manhattan, New York City. Her father, TV producer Sylvester L. Weaver Jr., originally wanted to name her Flavia, because of his passion for Roman history (he had already named her elder brother Trajan). Her mother, Elizabeth Inglis (née Desiree Mary Lucy Hawkins), was an English actress who had sacrificed her career for a family. Sigourney grew up in a virtual bubble of guiltless bliss, being taken care of by nannies and maids. By 1959, the Weavers had resided in 30 different households. In 1961, Sigourney began attending the Brearley Girls Academy, but her mother moved her to another New York private school, Chapin. Sigourney was quite a bit taller than most of her other classmates (at the age of 13, she was already 5' 10\"), resulting in her constantly being laughed at and picked on; in order to gain their acceptance, she took on the role of class clown. In 1962, her family moved to San Francisco briefly, an unpleasant experience for her. Later, they moved back east to Connecticut, where she became a student at the Ethel Walker School, facing the same problems as before. In 1963, she changed her name to \"Sigourney\", after the character \"Sigourney Howard\" in F. Scott Fitzgerald's \"The Great Gatsby\" (her own birth name, Susan, was in honor of her mother's best friend, explorer Susan Pretzlik). Sigourney had already starred in a school drama production of \"A Midsummer Night's Dream\", and, in 1965, she worked during the summer with a stock troupe, performing in \"A Streetcar Named Desire\" and \"You Can't Take It With You\" (she didn't star in the latter because she was taller than the lead actor!). After graduating from school in 1967, she spent some months in a kibbutz in Israel. At that time, she became engaged to reporter Aaron Latham, but they soon broke up. In 1969, Sigourney enrolled in Stanford University, majoring in English Literature. She also participated in school plays, especially Japanese Noh plays. By that time she was living in a tree house, alongside a male friend, dressed in elf-like clothes! After completing her studies in 1971, she applied for the Yale School of Drama in New Haven. Despite appearing at the audition reading a Bertolt Brecht speech and wearing a rope-like belt, she was accepted by the school but her professors rejected her, because of her height, and kept typecasting her as prostitutes and old women (whereas classmate Meryl Streep was treated almost reverently). However, in 1973, while making her theatrical debut with \"Watergate Classics\", she met up with a team of playwrights and actors and began hanging around with them, resulting in long-term friendships with Christopher Durang, Kate McGregor-Stewart and Albert Innaurato. In 1974, she starred in such plays as Aristophanes' \"Frogs\" and Durang's \"The Nature and Purpose of the Universe\" and \"Daryl and Carol and Kenny and Jenny\", as \"Jenny\". After finishing her studies that year, she began seriously pursuing a stage career, but her height kept being a hindrance. However, she continued working on stage with Durang (in \"Titanic\" [1975]) and Innaurato (in \"Gemini\" [1976]). Other 1970s stage works included \"Marco Polo Sing a Song\", \"The Animal Kingdom\", \"A Flea in Her Ear\", \"The Constant Husband\", \"Conjuring an Event\" and others. However, the one that really got her noticed was \"Das Lusitania Songspiel\", a play she co-wrote with Durang and in which she starred for two seasons, from 1979 to 1981. She was also up for a Drama Desk Award for it. During the mid-70s, she appeared in several TV spots and even starred as \"Avis Ryan\" in the soap opera Somerset (1970). In 1977, she was cast in the role Shelley Duvall finally played in Annie Hall (1977), after rejecting the part due to prior stage commitments. In the end, however, Woody Allen offered her a part in the film that, while short (she was on-screen for six seconds), made many people sit up and take notice. She later appeared in Madman (1978) and, of course, Alien (1979). The role of the tough, uncompromising \"Ripley\" made Sigourney an \"overnight\" star and brought her a British Award Nomination. She next appeared in Eyewitness (1981) and L'année de tous les dangers (1982), the latter being a great success in Australia that won an Oscar and brought Sigourney and co-star Mel Gibson to Cannes in 1983. The same year she delivered an honorary Emmy award to her father, a few months before her uncle, actor Doodles Weaver, committed suicide. That year also brought her a romance with Jim Simpson, her first since having broken up two years previously with James M. McClure. She and Simpson were married on 1 October 1984. Sigourney had, meanwhile, played in the poorly received Deal of the Century (1983) and the mega-hit Ghostbusters (1984). She was also nominated for a Tony Award for her tour-de-force performance in the play \"Hurly Burly\". Then followed One Woman or Two (1985), Half Moon Street (1986) and Aliens (1986). The latter was a huge success, and Sigourney was nominated for both a Golden Globe and an Oscar. She then entered her most productive career period and snatched Academy Award nominations, in both Best Actress and Best Supporting Actress categories, for her intense portrayal of Dian Fossey in Gorillas in the Mist (1988) and her delicious performance as a double-crossing, power-hungry corporate executive in Working Girl (1988). She ended up losing in both, but made up for it to a degree by winning both Golden Globes. After appearing in a documentary about fashion photographer Helmut Newton, Helmut Newton: Frames from the Edge (1989), and reprising her role in the sequel Ghostbusters II (1989), she discovered she was pregnant and retired from public life for a while. She gave birth to her daughter, Charlotte Simpson, on 13 April 1990, and returned to the movies as a (now skinhead) Ripley in Alien 3 (1992) and a gorgeous \"Queen Isabella of Spain\" in 1492: Christophe Colomb (1992), her second film with director Ridley Scott. She starred in the political comedy Dave (1993) alongside Kevin Kline, and then a Roman Polanski thriller, Death and the Maiden (1994). In 1995, she was seen in Jeffrey (1995) and Copycat (1995). The next year, she \"trod the boards\" in \"Sex and Longing\", yet another Durang play. She hadn't performed in the theater in many years before that play, her last stage performances occurring in the 1980s in \"As You Like It\" (1981), \"Beyond Therapy\" (1981), \"The Marriage of 'Bette and Boo'\" (1985) and \"The Merchant of Venice\" (1986). In 1997, she was the protagonist in Grimm's Snow White: A Tale of Terror (1997), Ice Storm (1997) and Alien: Resurrection (1997). Her performance in Ice Storm (1997) got her a BAFTA prize and another Golden Globe nod. She also gave excellent performances in A Map of the World (1999) and the sci-fi spoof Galaxy Quest (1999). Her next comedy, Company Man (2000), wasn't quite so warmly welcomed critically and financially, however. She next played a sexy con artist in Heartbreakers (2001) and had a voice role in Big Bad Love (2001). Her father died at the age of 93. Sigourney herself has recently starred in Tadpole (2000) and is planning a cinematic version of The Guys (2002), the enthralling September 11th one-act drama she played on stage on late 2001. At age 60, she played a crucial role in Avatar (2009), which became the top box-office hit of all time. The film reunited her with her Aliens (1986) director James Cameron. Her beauty, talent, and hard-work keeps the ageless actress going, and she has continued to win respect from her fans and directors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MTcyNTE3OV5BMl5BanBnXkFtZTcwMTA0MTMyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000244","name":"Sigourney Weaver","nicknames":["The Actress's Actress","The Sci-Fi Queen"],"idIMDB":"nm0000244"},"actorId":"nm0000244","character":"Catherine DeVoto","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gregory Hines","urlProfile":"http://www.imdb.com/name/nm0002138","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NjU4NTYzM15BMl5BanBnXkFtZTYwODkwMjY2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 February 1946","placeOfBirth":" New York City, New York, USA","birthName":"Gregory Oliver Hines","height":"6' (1.83 m)","bio":"Gregory Hines was born on February 14, 1946 in New York City, New York, USA as Gregory Oliver Hines. He was an actor, known for The Cotton Club (1984), Running Scared (1986) and History of the World: Part I (1981). He was married to Pamela Koslow and Patricia Panella. He died on August 9, 2003 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NjU4NTYzM15BMl5BanBnXkFtZTYwODkwMjY2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002138","name":"Gregory Hines","idIMDB":"nm0002138"},"actorId":"nm0002138","character":"Ray Kasternak","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vince Edwards","urlProfile":"http://www.imdb.com/name/nm0250436","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MTczMDE0MF5BMl5BanBnXkFtZTYwMTE0ODQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1928","placeOfBirth":" Brownsville, Brooklyn, New York City, New York, USA","birthName":"Vincent Edward Zoine","height":"6' 2\" (1.88 m)","bio":"Born in Brooklyn, the son of Italian immigrant parents, Vince Edwards early aspired to the theater. He was a swimming champion in high school, attended Ohio State University on an athletic scholarship, and was on their National Championship swimming team. Olympics were on the horizon, but an appendicitis operation cut short his swimming career. He studied at the American Academy of Dramatic Arts, and then became a contract actor at Paramount Pictures in the early 1950s. In the 1960s he reached his popular peak as the brilliant but confrontational young Dr. Casey in the television series Ben Casey (1961)","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MTczMDE0MF5BMl5BanBnXkFtZTYwMTE0ODQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0250436","name":"Vince Edwards","idIMDB":"nm0250436"},"actorId":"nm0250436","character":"Frank Stryker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Marquez","urlProfile":"http://www.imdb.com/name/nm0549884","urlPhoto":"","biography":{"dateOfBirth":"14 March 1943","placeOfBirth":" Cuba","bio":"William Marquez was born on March 14, 1943 in Cuba. He is known for his work on The Mask of Zorro (1998), General Hospital (1963) and Crazy Heart (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0549884","name":"William Marquez","idIMDB":"nm0549884"},"actorId":"nm0549884","character":"Gen. Cordosa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eduardo Ricard","urlProfile":"http://www.imdb.com/name/nm0723066","urlPhoto":"","biography":{"bio":"Eduardo Ricard is an actor, known for Freaked (1993), Casa de mi Padre (2012) and Lionheart (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0723066","name":"Eduardo Ricard","idIMDB":"nm0723066"},"actorId":"nm0723066","character":"Col. Salgado","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Herd","urlProfile":"http://www.imdb.com/name/nm0378800","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyOTgxNTUyMF5BMl5BanBnXkFtZTcwMDgzNzQ0MQ@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 September 1932","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Richard Thomas Herd Jr.","height":"5' 11\" (1.8 m)","bio":"Utilitarian character actor Richard Herd is one of those stern familiar faces you've seen countless times on film and TV but can't quite place the name. The stage-trained actor who shares a striking resemblance to actor Karl Malden never found the one role that would make him a household name, but he has made up for it with a number of rich and rewarding stage, film and TV assignments bolstered by his trademark authoritarian look and stance. Born on September 26, 1932, is the son of another Richard, a railroad engineer and WWII vet who died when the boy was quite young. The younger Herd suffered from bone marrow cancer which affected the growth of his legs as a child. As a result, he was educated at the Industrial School for Crippled Children during his formative years. Luckily, loving care and several operations saved his legs from deformity. It was his mother Katherine's love of music that ignited Richard's initial desire to perform. Trained on the drums, he received early acting training on radio and in summer stock (Liberty Mutual Theatre in Boston) during his high school years and in the late 1940s studied Shakespeare under veteran Claude Rains at one point. Other plays such as \"Our Town\" and \"Sing Out Sweet Land,\" and the children's theatre productions of \"Penrod\" and \"Robin Hood\" helped to beef up his early resume. Richard enlisted in the Army during the Korean War but injured a knee in basic training which led to an honorable discharge within 90 days of his enlistment. He did, however, go on to work for the Army Signal Corps in a host of training films. Richard continued to gather experience in such classical plays as \"The Miser\" and \"A Month in the Country\". With several summer stock runs, Shakespearean bus-and-truck tours and industrial films under his belt, he finally made his New York debut in the minor role of an usher in The Dress Circle\" at Carnegie Hall. He also became a member of the Player's Club. Making a highly inauspicious film debut in the minor role of a coach in the film Hercules in New York (1970), which was the showcase debut for the massively-muscled Arnold Schwarzenegger, Richard didn't settle in Hollywood until the mid 1970s after replacing actor Richard Long (who died before filming began) in the role of Watergate figure James McCord in All the President's Men (1976). Although Richard made a handful of other movies throughout the rest of the decade (I Never Promised You a Rose Garden (1977), F.I.S.T. (1978), The China Syndrome (1979), The Onion Field (1979)), he appeared with much more frequency on TV, playing stern, authoritarian types on episodes of \"Kojak,\" \"The Rockford Files,\" \"The Streets of San Francisco,\" (starring the similar-looking Karl Malden), \"Rafferty,\" \"Eight Is Enough\" and \"Starsky & Hutch,\" as well as in the TV movies Pueblo (1973), Captains and the Kings (1976), The Hunted Lady (1977), Dr. Scorpion (1978), Kate Bliss and the Ticker Tape Kid (1978), Terror Out of the Sky (1978) (TV)_, Marciano (1979) (TV)_ and, most notably, Ike: The War Years (1980) in which he portrayed General Omar Bradley. Never finding the one support role that might have made him a character star, Richard has nevertheless been featured impressively on all three mediums for the past four decades. On stage he appeared in a pre-Broadway tryout of \"On the Waterfront\" and played to great applause in productions of \"Other People's Money\" and \"The Big Knife\". His finest hour on stage, however, would come with his portrayal of the epic film producer in the one-man show \"Cecil B. DeMille Presents,\" which he has toured throughout the country. On TV, Richard has guested on most of the popular TV programs of late, including \"Desperate Housewives\" and CSI: Miami\" and is probably best remembered for his recurring roles as Admiral Noyce on SeaQuest 2032 (1993), as Jason Alexander's boss Wilhelm in the sitcom classic Seinfeld (1989) and as Admiral Owen Paris in Star Trek: Voyager (1995). A few of his lightweight cinematic crowd-pleasers include Private Benjamin (1980), Deal of the Century (1983), Planes, Trains & Automobiles (1987) and Sgt. Bilko (1996). On occasion Richard has moved into the director/producer/writer's chair. He directed the play \"Idle Wheels\" for the Road Theatre Company in North Hollywood, was a producer of the N.Y. play \"Agamemnon\" and co-producer (and performer) of the play \"The Couch with the Six Insides,\" and, as a playwright, had a presentation of his play \"Prisoner of the Crown\" produced at Dublin's Abbey Theatre. Married briefly at the age of 19, Richard remarried and had two children (Richard Jr. and Erica) by his second wife. That marriage also ended in divorce, but his third (in 1980), to actress Patricia Herd (Patricia Crowder Ruskin) has lasted. Patricia has a daughter from an earlier marriage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyOTgxNTUyMF5BMl5BanBnXkFtZTcwMDgzNzQ0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0378800","name":"Richard Herd","idIMDB":"nm0378800"},"actorId":"nm0378800","character":"Lyle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Graham Jarvis","urlProfile":"http://www.imdb.com/name/nm0419054","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5MTI1OTY0M15BMl5BanBnXkFtZTgwMzM0ODA1NTE@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1930","placeOfBirth":" Toronto, Ontario, Canada","bio":"Jarvis attended Williams College before moving to New York to pursue a career in theater. He studied acting at the American Theater Wing and was an original member of the Lincoln Center Repertory Theater.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5MTI1OTY0M15BMl5BanBnXkFtZTgwMzM0ODA1NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0419054","name":"Graham Jarvis","idIMDB":"nm0419054"},"actorId":"nm0419054","character":"Babers","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wallace Shawn","urlProfile":"http://www.imdb.com/name/nm0001728","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDYzMDQ1OF5BMl5BanBnXkFtZTcwMDQ3OTc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 November 1943","placeOfBirth":" New York City, New York, USA","birthName":"Wallace Michael Shawn","height":"5' 2\" (1.57 m)","bio":"American character actor and writer Wallace Shawn has one of those fun, mischievously homely faces just made to entertain. Though he got out of the starting gate rather slowly, he has since excelled on stage, television and film while managing to turn himself into a winner with his loser-type looks. Woody Allen's character in the movie Manhattan (1979) amusingly describes Wallace's character as \"a homunculus\", which is a pretty fair description of this predominantly bald, wan, pucker-mouthed, butterball-framed, slightly lisping gent. Wallace made his movie debut in Allen's heralded classic playing Diane Keaton's ex-husband. Born to privilege on November 12, 1943 in New York City, Wallace was the son of renowned editor William Shawn of \"The New Yorker\" fame and educated at both Harvard University, where he studied history, and Magdalen College, Oxford. Wallace initially taught English in India on a Fulbright scholarship, and then English, Latin and drama back in New York. However, a keen interest in writing and acting soon compelled him to leave his cushy position and pursue a stage career as both playwright and actor. During his distinguished career, Wallace turned out several plays. \"Our Late Night\", the first of his works to be performed, was awarded an off-Broadway Obie in 1975. \"A Thought in Three Parts\" (1976); \"The Mandrake\" (1977), which he translated from the original Italian and in which he made his acting debut; \"Marie and Bruce\" (1979); \"Aunt Dan and Lemon\" (1985) and \"The Fever\", for which he received his second Obie Award for \"Best New Play\" during the 1990-91 season, then followed. A popular support player in both comedy and occasional drama, his assorted kooks, creeps, eggheads and schmucks possessed both endearing and unappetizing qualities. He earned some of his best early notices partnered with theatre director/actor Andre Gregory in the unique Louis Malle-directed film My Dinner with Andre (1981). Shawn co-wrote the improvisatory, humanistic piece and his brother, Allen Shawn, was the composer. Shawn and Gregory would collaborate again for Malle in another superb, original-concept film Vanya on 42nd Street (1994). Among the quality offbeat filming involving has been Bruce Paltrow's A Little Sex (1982); James Ivory's The Bostonians (1984); Stephen Frears' Prick Up Your Ears (1987); Rob Reiner's The Princess Bride (1987); Alan Rudolph's The Moderns (1988) and Mrs. Parker and the Vicious Circle (1994); Paul Bartel's Scenes from the Class Struggle in Beverly Hills (1989); and several others for Woody Allen: Radio Days (1987), Shadows and Fog (1991), The Curse of the Jade Scorpion (2001) and Melinda and Melinda (2004). Of late, he has lent his vocal talents to a considerable number of animated pictures including A Goofy Movie (1995), Toy Story (1995) (and its sequel), The Jungle Book: Mowgli's Story (1998), The Incredibles (2004), Chicken Little (2005) and Happily N'Ever After (2006). Over the decades, Shawn has scurried about effortlessly in a number of television guest appearances including Taxi (1978), Homicide: Life on the Street (1993), Ally McBeal (1997), Law & Order: Criminal Intent (2001) and Desperate Housewives (2004), and has drummed up a few recurring roles for himself in the process, including The Cosby Show (1984), Murphy Brown (1988), Star Trek: Deep Space Nine (1993) and Crossing Jordan (2001). In the series Clueless (1996), based on the highly successful of the same name Clueless (1995), Shawn revisited his role as the owlish high school teacher.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDYzMDQ1OF5BMl5BanBnXkFtZTcwMDQ3OTc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001728","name":"Wallace Shawn","idIMDB":"nm0001728"},"actorId":"nm0001728","character":"Harold DeVoto","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Randi Brooks","urlProfile":"http://www.imdb.com/name/nm0112205","urlPhoto":"","biography":{"dateOfBirth":"8 November 1956","placeOfBirth":" New York City, New York, USA","birthName":"Pam Plambeck","height":"5' 10¾\" (1.8 m)","bio":"Randi Brooks was born on November 8, 1956 in New York City, New York, USA as Pam Plambeck. She is an actress, known for Tightrope (1984), The Man with Two Brains (1983) and Cop (1988). She has been married to Joseph Brazen since January 18, 1985. They have three children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0112205","name":"Randi Brooks","idIMDB":"nm0112205"},"actorId":"nm0112205","character":"Ms. Della Rosa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ebbe Roe Smith","urlProfile":"http://www.imdb.com/name/nm0808076","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNDg3NjcyMV5BMl5BanBnXkFtZTcwMjE2MTkyNw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 June 1949","placeOfBirth":" San Diego, California, USA","bio":"Ebbe Roe Smith was born on June 25, 1949 in San Diego, California, USA. He is an actor and writer, known for Chute libre (1993), Turner & Hooch (1989) and The Big Easy (1986).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNDg3NjcyMV5BMl5BanBnXkFtZTcwMjE2MTkyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0808076","name":"Ebbe Roe Smith","idIMDB":"nm0808076"},"actorId":"nm0808076","character":"Bob","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Libertini","urlProfile":"http://www.imdb.com/name/nm0508844","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5OTE5NDMxNl5BMl5BanBnXkFtZTcwODgxMDkwMw@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 May 1933","placeOfBirth":" Cambridge, Massachusetts, USA","birthName":"Richard Joseph Libertini","height":"6' 1½\" (1.87 m)","bio":"Richard Libertini was born in E. Cambridge, Massachusetts, to parents who had come to America from southern Italy. Having grown up in a household where both Italian and English were spoken, he developed an ear for foreign accents. A facility he would later use to advantage on stage and in films. He graduated from Emerson College in Boston, and for a while earned a living as a trumpet player in the Boston area. Later, he moved to New York, where he teamed up with two former college classmates, MacIntyre Dixon and Lynda Segal, to create an off-Broadway revue called \"Stewed Prunes.\" (This was during the coffee house revolution in the 1960s. Bob Dylan was playing around the corner.) The show was quite successful and after running a year in New York they took it on the road. While playing Chicago, he was asked to join the renowned Second City Improvisational Theatre Group, an association which continues to the present. After a number of years doing stage work in New York (Woody Allen's Don't Drink the Water (1969) and Paul Sills' Story Theatre (1971) among many others) he eventually moved to L.A. where he began doing films. Three of his most memorable characters are the Spanish-American dictator in The In-Laws (1979) with Alan Arkin and Peter Falk, the Tibetan Mystic in All of Me (1984) with Steve Martin, and Lily Tomlin and the justice of the peace in Best Friends (1982) with Goldie Hawn and Burt Reynolds. Other films include Fletch (1985) with Chevy Chase and Popeye (1980) with Robin Williams.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5OTE5NDMxNl5BMl5BanBnXkFtZTcwODgxMDkwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0508844","name":"Richard Libertini","idIMDB":"nm0508844"},"actorId":"nm0508844","character":"Masaggi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"J.W. Smith","urlProfile":"http://www.imdb.com/name/nm0808541","urlPhoto":"","biography":{"bio":"J.W. Smith is a producer and actor with more than 40 years of entertainment experience in motion pictures and television. J.W. grew up in Cleveland, Ohio, where he began his acting career at The Karamu House Community Theater. In the early 1970s, J.W. moved to New York City where he became a student in Uta Hagen's acting class at HB Studio and at The Henry Street Playhouse. During his stint in New York City, J.W. met and became close friends with Morgan Freeman and Bill Duke. More than four decades later, J.W. remains close friends with both Morgan and Bill, often collaborating on scripts and potential projects. J.W. spent several successful years performing on Broadway and Off Broadway in plays including, \"We Interrupt This Program,\" Public Theater's production of \"On the Goddam Lock-in,\" and \"So Nice, They Named It Twice.\" In addition to acting, J.W. produced shows in and around New York City for the Amas Repertory Theater Company. In the early 1980s, J.W. moved to Los Angeles to pursue an acting career in film and television where he immediately landed his first job in television on \"Palmerstown, U.S.A.\" He was selected to be a part of Paramount Pictures Associate Producers Training Program, working on several ground-breaking series for television including, \"The Best of The West,\" \"Taxi,\" and \"Cheers.\" J.W. has also appeared in numerous television shows including, \"L.A. Law,\" \"Cagney and Lacey,\" \"Reno 911,\" \"The X-Files,\" and \"Hill Street Blues.\" Showing his range and depth of talent, J.W. has appeared in many popular feature films including, \"Red Heat\" (starring Arnold Schwarzenegger), \"Johnny Handsome\" (starring Mickey Rourke, Ellen Barkin, and Morgan Freeman), \"Undisputed\" (starring Wesley Snipes and Ving Rhames), \"Beetlejuice\" (starring Michael Keaton), \"Hoodlum\" (starring Laurence Fishburne, Tim Roth, and directed by Bill Duke), \"The Warriors\" (cult classic directed by Walter Hill), to name a few. J.W. is President of 3000 Realms Entertainment, a production company he co-founded with friend and business partner, Bryan Behuniak. J.W.'s project in development with 3000 Realms Entertainment is \"Dead Wrong,\" executive produced by Morgan Freeman, with producers Bryan Behuniak, James Dyer, and writer Matt Benjamin.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0808541","name":"J.W. Smith","idIMDB":"nm0808541"},"actorId":"nm0808541","character":"Will","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carmencristina Moreno","urlProfile":"http://www.imdb.com/name/nm1628058","urlPhoto":"","biography":{"bio":"Carmencristina Moreno is an actor, known for Cactuses (2006), Deal of the Century (1983) and Hickey & Boggs (1972).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1628058","name":"Carmencristina Moreno","idIMDB":"nm1628058"},"actorId":"nm1628058","character":"Woman Singer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Levin","urlProfile":"http://www.imdb.com/name/nm0505570","urlPhoto":"","biography":{"dateOfBirth":"12 March 1949","placeOfBirth":" Chicago, Illinois, USA","birthName":"Charles Herbert Levin","bio":"Charles Levin was born on March 12, 1949 in Chicago, Illinois, USA as Charles Herbert Levin. He is an actor, known for Manhattan (1979), Annie Hall (1977) and This Is Spinal Tap (1984). He was previously married to Katherine DeHtre.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0505570","name":"Charles Levin","idIMDB":"nm0505570"},"actorId":"nm0505570","character":"Dr. Rechtin","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0085412","urlIMDB":"http://www.imdb.com/title/tt0085412","business":{"budget":null,"openingWeekend":[{"money":"$3,520,605","country":"USA","day":"06","month":"11","year":"1983","remarks":"1 Screen"}],"gross":[],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 39 min (99 min)"],"soundMix":["Dolby"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Lenses and Panaflex Camera by Panavision"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"4.5","filmingLocations":[{"location":"Santa Barbara, California, USA"}],"rated":"PG","awards":[],"votes":"3,079","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."},{"idCompany":"co0042356","name":"Dream Quest Images"}],"keywords":{"keywords":["dictator","arms dealer","helicopter","used car salesman","explosion","missile","aerial combat","symbolic sex","tire iron","gun shop","flamethrower","baptism","born again christian","traffic helicopter","aircraft","arms deal","suicide","shot in the foot","attempted mugging","machine gun","voice over narration","black comedy","no opening credits","weaponry","spin","social commentary","salesmanship","public relations","military industrial complex","microcosm","greed","defense contractor","cold war","arms trade","arms race","arms industry","allegory","aggression","advertising","satire","weapon selling","christmas","based on book","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:15:56"}}