{"data":{"movies":[{"title":"Halloween","originalTitle":"","year":"1978","releaseDate":"19781025","directors":[{"name":"John Carpenter","id":"nm0000118"}],"writers":[{"name":"John Carpenter","id":"nm0000118"},{"name":"Debra Hill","id":"nm0384185"}],"runtime":"91 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk1OGU2NmMtNTdhZC00NjdlLWE5YTMtZTQ0MGExZTQzOGQyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Thriller"],"plot":"The year is 1963, the night: Halloween. Police are called to 43 Lampkin Ln. only to discover that 15 year old Judith Myers has been stabbed to death, by her 6 year-old brother, Michael. After being institutionalized for 15 years, Myers breaks out on the night before Halloween. No one knows, nor wants to find out, what will happen on October 31st 1978 besides Myers' psychiatrist, Dr. Loomis. He knows Michael is coming back to Haddonfield, but by the time the town realizes it, it'll be too late for many people.","simplePlot":"Fifteen years after murdering his sister on Halloween night 1963, Michael Myers escapes from a mental hospital and returns to the small town of Haddonfield to kill again.","actors":[{"actorName":"Donald Pleasence","urlProfile":"http://www.imdb.com/name/nm0000587","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjYzNTQ2MV5BMl5BanBnXkFtZTcwMzA5MTkzNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 October 1919","placeOfBirth":" Worksop, Nottinghamshire, England, UK","birthName":"Donald Henry Pleasence","height":"5' 6\" (1.68 m)","bio":"Balding, quietly-spoken, of slight build and possessed of piercing blue eyes -- often peering out from behind round, steel-rimmed glasses -- Donald Pleasence had the necessary physical attributes which make a great screen villain. In the course of his lengthy career, he relished playing the obsessed, the paranoid and the purely evil. Even the Van Helsing-like psychiatrist Sam Loomis in the Halloween (1978) franchise seems only marginally more balanced than his prey. An actor of great intensity, Pleasence excelled on stage as Shakespearean villains. He was an unrelenting prosecutor in Jean Anouilh's \"Poor Bitos\" and made his theatrical reputation in the title role of the seedy, scheming tramp in Harold Pinter's \"The Caretaker\" (1960). On screen, he gave a perfectly plausible interpretation of the head of the SS, Heinrich Himmler, in The Eagle Has Landed (1976). He was a convincingly devious Thomas Cromwell in Henry VIII and His Six Wives (1972), disturbing in his portrayal of the crazed, bloodthirsty preacher Quint in Will Penny (1967); and as sexually depraved, alcohol-sodden 'Doc' Tydon in the brilliant Aussie outback drama Wake in Fright (1971). And, of course, he was Ernst Stavro Blofeld in You Only Live Twice (1967). These are some of the films, for which we may remember Pleasence, but there was a great deal more to this fabulous, multi-faceted actor. Donald Henry Pleasence was born on October 5, 1919 in Worksop, Nottinghamshire, England, to Alice (Armitage) and Thomas Stanley Pleasence. His family worked on the railway; his grandfather had been a signal man and both his brother and father were station masters. When Donald failed to get a scholarship at RADA, he joined the family occupation working as a clerk at his father's station before becoming station master at Swinton, Yorkshire. While there he wrote letters to theatre companies eventually being accepted by one on the island of Jersey in Spring 1939 as an assistant stage manager. On the eve of World War II, he made his theatrical debut in \"Wuthering Heights\". In 1942, he played Curio in \"Twelfth Night\", but his career was then interrupted by military service in the RAF. He was shot down over France, incarcerated and tortured in a German POW camp. Once repatriated, Donald returned to the stage in Peter Brook's 1946 London production of \"The Brothers Karamazov\" with Alec Guinness although he missed the opening due to measles, followed by a stint on Broadway with Laurence Olivier's touring company in \"Caesar and Cleopatra\" and \"Anthony and Cleopatra\". Upon his return to England, he won critical plaudits for his performance in \"Hobson's Choice\". In 1952, Donald began his screen career, rather unobtrusively, in small parts. He was only really noticed once having found his métier as dastardly, sneaky Prince John in The Adventures of Robin Hood (1955). It took several more years, until international recognition came his way: first, through the filmed adaptation of The Guest (1963); and, secondly, with his blind forger in The Great Escape (1963), a role imbued with added conviction due to his own wartime experience. Some of his best acting Donald reserved for the small screen. In 1962, the producer of The Twilight Zone (1959), Buck Houghton, brought Donald to the United States ('damn the expense'!) to guest star in the third season episode \"The Changing of the Guard\". He was given a mere five days to immerse himself in the part of a gentle school teacher, Professor Ellis Fowler, who, on the eve of Christmas is forcibly retired after fifty-one years of teaching. Devastated, and believing himself a failure who has made no mark on the world, he is about to commit suicide when the school's bell summons him to his classroom. There, he is confronted by the spirits of deceased students who exhort him to consider that his lessons have had fundamental effects on their lives, even leading to acts of great heroism. Upon hearing this, Fowler is now content to graciously accept his retirement. Managing to avoid maudlin sentimentality, Donald's performance was intuitive and, arguably, one of the most poignant ever accomplished in a thirty-minute television episode. Once again, against type, he was equally delightful as the mild-mannered Reverend Septimus Harding in Anthony Trollope's The Barchester Chronicles (1982). Whether eccentric, sinister or given to pathos, Donald Pleasence was always great value-for-money and his performances have rarely failed to engage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjYzNTQ2MV5BMl5BanBnXkFtZTcwMzA5MTkzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000587","name":"Donald Pleasence","idIMDB":"nm0000587"},"actorId":"nm0000587","character":"Loomis","urlCharacter":"http://www.imdb.com/character/ch0003219","main":true},{"actorName":"Jamie Lee Curtis","urlProfile":"http://www.imdb.com/name/nm0000130","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MTI0MDk2OV5BMl5BanBnXkFtZTgwODQ4MTE0NDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1958","placeOfBirth":" Los Angeles, California, USA","height":"5' 7\" (1.7 m)","bio":"Jamie Lee Curtis was born on November 22, 1958 in Los Angeles, California, the daughter of legendary actors Janet Leigh and Tony Curtis. She got her big break at acting in 1978 when she won the role of Laurie Strode in Halloween (1978). After that, she became famous for roles in movies like Trading Places (1983), Perfect (1985) and A Fish Called Wanda (1988). She starred in one of the biggest action films ever, True Lies (1994), for which she won a Golden Globe Award for her performance. Curtis also appeared on Buck Rogers in the 25th Century (1979), and starred in Death of a Centerfold: The Dorothy Stratten Story (1981) as the title role. Her first starring role was opposite Richard Lewis on the ABC situation comedy Anything But Love (1989). In 1998, she starred in Halloween H20: 20 Years Later (1998) in which she reprised her role that made her famous back in 1978. Her paternal grandparents were Hungarian Jewish immigrants, while two of her maternal great-grandparents were Danish.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MTI0MDk2OV5BMl5BanBnXkFtZTgwODQ4MTE0NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000130","name":"Jamie Lee Curtis","nicknames":["The Scream Queen","The Queen of Screams","The Body"],"idIMDB":"nm0000130"},"actorId":"nm0000130","character":"Laurie","urlCharacter":"http://www.imdb.com/character/ch0003212","main":true},{"actorName":"Nancy Kyes","urlProfile":"http://www.imdb.com/name/nm0477341","urlPhoto":"","biography":{"dateOfBirth":"19 December 1949","placeOfBirth":" Falls Church, Virginia, USA","birthName":"Nancy Louise Kyes","height":"5' 6\" (1.68 m)","bio":"Pretty, perky and appealing brunette actress Nancy Kyes had a regrettably brief acting career; she appeared in three excellent features for director John Carpenter in which she acted under the name of Nancy Loomis. She was born on December 19, 1949 in Falls Church, Virginia. Nancy attended high school in Riverside, California and studied theater at Northwestern University in Evanston, Illinois. Nancy made a solid film debut as whiny secretary Julie in the tough and exciting urban action thriller \"Assault on Precinct 13.\" (Kyes also worked behind the scenes on this picture as the wardrobe mistress.) She gave a wonderfully funny and lively performance as feisty babysitter Annie Brackett in the outstanding seasonal slasher classic \"Halloween.\" Kyes was once again fine and impressive as Janet Leigh's sassy assistant Sandy Fadel in the superior supernatural shocker \"The Fog.\" Nancy had a small role as Tom Atkins' bitter ex-wife Linda in the unjustly maligned \"Halloween III: Season of the Witch.\" Kyes has tiny parts in the made-for-TV movies \"Not in Front of the Children\" and \"Lady Boss.\" Her sole TV show credit was on the \"Little Boy Lost\" episode of the mid 80s revival of \"The Twilight Zone.\" Nancy Kyes now works as a sculptress in Los Angeles.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0477341","name":"Nancy Kyes","idIMDB":"nm0477341"},"actorId":"nm0477341","character":"Annie","urlCharacter":"http://www.imdb.com/character/ch0003209","main":true},{"actorName":"P.J. Soles","urlProfile":"http://www.imdb.com/name/nm0001753","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MjI3OTU0NF5BMl5BanBnXkFtZTcwOTEwMTIzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 July 1950","placeOfBirth":" Frankfurt am Main, Hesse, Germany","birthName":"Pamela Jayne Hardon","height":"5' 8\" (1.73 m)","bio":"P.J. (Pamela Jayne) Soles was born on July 17, 1950 in Frankfurt, Germany. Her father came from Holland and her mother from New Jersey. Because her father was working for an international insurance company, the family moved all over the world. P.J. lived in Casablanca, Morocco, and Maracaibo, Venezuela, where she learned to speak fluent Spanish, and then Brussels, Belgium, where she went to high school at the International School of Brussels. When she was at Briarcliff College, she wanted to become the first woman ambassador to the Soviet Union. This career goal changed when she visited the Actors Studio in New York City. She moved to Manhattan and began acting in commercials and modeling for fashion magazines. She was married to J. Steven Soles during her years in New York, but then made the move to Los Angeles to work in television and movies. At this time, she and Soles' got divorced, but she decided to keep her name as P.J. Soles. She was among the hundreds of actors auditioning for Brian De Palma and George Lucas in their joint casting session for Carrie (1976) and Star Wars: Episode IV - A New Hope (1977). After Carrie, she went to Georgia to film Our Winning Season (1978) and met actor Dennis Quaid. They were married in 1978 in Texas on a dude ranch. P.J. starred in Rock 'n' Roll High School (1979) with Ramones. Next she filmed Private Benjamin (1980) and then Stripes (1981). She and Quaid were divorced in 1983. P.J. continued doing numerous television and film roles, and then married Skip Holm, who was the stunt pilot on The Right Stuff (1983). They have two children and were divorced in 1998. Still active in television and film, P.J. manages not to let her fans down, but keeps them interested in her work, which keeps on getting better, making her one of the most versatile actresses of her time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MjI3OTU0NF5BMl5BanBnXkFtZTcwOTEwMTIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001753","name":"P.J. Soles","nicknames":["\"The Totally Girl\" from Halloween"],"idIMDB":"nm0001753"},"actorId":"nm0001753","character":"Lynda","urlCharacter":"http://www.imdb.com/character/ch0003217","main":true},{"actorName":"Charles Cyphers","urlProfile":"http://www.imdb.com/name/nm0194234","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MTQyMjI3OF5BMl5BanBnXkFtZTcwMDQ1MTgwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 July 1939","placeOfBirth":" Niagara Falls, New York, USA","height":"5' 10\" (1.78 m)","bio":"Charles is a graduate of the American Academy of Dramatic Arts. He also took drama classes at Los Angeles City College and is a graduate of Cal. State at LA, receiving his BA in theatre arts. Aside from his many film and tv credits he is especially proud of his body of work in the LA theatre. He was a member of the company of angels for 25 years. He is a recipient of the Los Angeles Drama Critics Award for best performance by an actor for his role in The Caretaker and a dramalogue award for best performance by an actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MTQyMjI3OF5BMl5BanBnXkFtZTcwMDQ1MTgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0194234","name":"Charles Cyphers","idIMDB":"nm0194234"},"actorId":"nm0194234","character":"Brackett","urlCharacter":"http://www.imdb.com/character/ch0003228","main":true},{"actorName":"Kyle Richards","urlProfile":"http://www.imdb.com/name/nm0724202","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MDc4MTcxOV5BMl5BanBnXkFtZTcwNjcxMTEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 January 1969","placeOfBirth":" Hollywood, Los Angeles, California, USA","height":"5' 2\" (1.57 m)","bio":"Kyle Egan Richards was born in Hollywood, California, to Kathleen Mary (Dugan) and Kenneth Edwin Richards, a business executive. Ken died in 1998. Kathleen was diagnosed with breast cancer the same year, and passed away in March of 2002. Kyle, like her sister Kim, began acting at a very young age. She made many appearances on Little House on the Prairie (1974) as Alicia Sanderson Edwards. Kyle has four daughters: Farrah (from her previous relationship to Guraish Aldjufrie), and Alexia, Sophia and Portia from her marriage to real estate agent Mauricio Umansky.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MDc4MTcxOV5BMl5BanBnXkFtZTcwNjcxMTEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0724202","name":"Kyle Richards","idIMDB":"nm0724202"},"actorId":"nm0724202","character":"Lindsey","urlCharacter":"http://www.imdb.com/character/ch0003223","main":true},{"actorName":"Brian Andrews","urlProfile":"http://www.imdb.com/name/nm0028584","urlPhoto":"","biography":{"bio":"Brian Andrews is an actor, known for Halloween (1978), The Great Santini (1979) and Days of Our Lives (1965).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0028584","name":"Brian Andrews","idIMDB":"nm0028584"},"actorId":"nm0028584","character":"Tommy","urlCharacter":"http://www.imdb.com/character/ch0003206","main":true},{"actorName":"John Michael Graham","urlProfile":"http://www.imdb.com/name/nm0334137","urlPhoto":"","biography":{"bio":"John Michael Graham is an actor, known for Halloween (1978), Grease (1978) and Halloween: The Inside Story (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0334137","name":"John Michael Graham","idIMDB":"nm0334137"},"actorId":"nm0334137","character":"Bob","urlCharacter":"http://www.imdb.com/character/ch0003236","main":true},{"actorName":"Nancy Stephens","urlProfile":"http://www.imdb.com/name/nm0827111","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA2MzdhNGEtMGQ4ZS00NmU3LTk4NTUtZmNlNjg1Y2ZhNmQ2XkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 July 1949","placeOfBirth":" Texas, USA","birthName":"Nancy Jane Stephens","height":"5' 7\" (1.7 m)","bio":"Nancy Stephens was born on July 2, 1949 in Texas, USA as Nancy Jane Stephens. She is an actress and producer, known for Halloween (1978), Escape from New York (1981) and Halloween H20: 20 Years Later (1998). She has been married to Rick Rosenthal since May 23, 1981. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA2MzdhNGEtMGQ4ZS00NmU3LTk4NTUtZmNlNjg1Y2ZhNmQ2XkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0827111","name":"Nancy Stephens","idIMDB":"nm0827111"},"actorId":"nm0827111","character":"Marion","urlCharacter":"http://www.imdb.com/character/ch0175113","main":true},{"actorName":"Arthur Malet","urlProfile":"http://www.imdb.com/name/nm0539395","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzE0OTU5MzgxOF5BMl5BanBnXkFtZTcwNDE0NDYxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 September 1927","placeOfBirth":" Lee-on-Solent, England, UK","birthName":"Vivian R. Malet","bio":"Arthur Malet was born on September 24, 1927 in Lee-on-Solent, England as Vivian R. Malet. He was an actor, known for Hook (1991), Halloween (1978) and The Secret of NIMH (1982). He died on May 18, 2013 in Santa Monica, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzE0OTU5MzgxOF5BMl5BanBnXkFtZTcwNDE0NDYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0539395","name":"Arthur Malet","idIMDB":"nm0539395"},"actorId":"nm0539395","character":"Graveyard Keeper","urlCharacter":"http://www.imdb.com/character/ch0032091","main":true},{"actorName":"Mickey Yablans","urlProfile":"http://www.imdb.com/name/nm0944749","urlPhoto":"","biography":{"bio":"Mickey Yablans is an actor, known for Halloween (1978), A Nightmare on Elm Street 4: The Dream Master (1988) and Prison (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0944749","name":"Mickey Yablans","idIMDB":"nm0944749"},"actorId":"nm0944749","character":"Richie","urlCharacter":"http://www.imdb.com/character/ch0030633","main":true},{"actorName":"Brent Le Page","urlProfile":"http://www.imdb.com/name/nm0494506","urlPhoto":"","biography":{"bio":"Brent Le Page is an actor, known for Halloween (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0494506","name":"Brent Le Page","idIMDB":"nm0494506"},"actorId":"nm0494506","character":"Lonnie","urlCharacter":"http://www.imdb.com/character/ch0028502","main":true},{"actorName":"Adam Hollander","urlProfile":"http://www.imdb.com/name/nm0390866","urlPhoto":"","biography":{"dateOfBirth":"14 October 1964","placeOfBirth":" Los Angeles, California, USA","bio":"Adam Hollander was born on October 14, 1964 in Los Angeles, California, USA. He was an actor, known for Halloween (1978), The Sting II (1983) and The City (1977). He died on September 24, 1984 in Albuquerque, New Mexico, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0390866","name":"Adam Hollander","idIMDB":"nm0390866"},"actorId":"nm0390866","character":"Keith","urlCharacter":"http://www.imdb.com/character/ch0033601","main":true},{"actorName":"Robert Phalen","urlProfile":"http://www.imdb.com/name/nm0679606","urlPhoto":"","biography":{"dateOfBirth":"10 May 1937","placeOfBirth":" San Francisco, California, USA","bio":"Robert Phalen was born on May 10, 1937 in San Francisco, California, USA. He is an actor, known for Halloween (1978), Starman (1984) and Three Days of the Condor (1975).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0679606","name":"Robert Phalen","idIMDB":"nm0679606"},"actorId":"nm0679606","character":"Dr. Wynn","urlCharacter":"http://www.imdb.com/character/ch0003230","main":true},{"actorName":"Tony Moran","urlProfile":"http://www.imdb.com/name/nm0602985","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMTQ4NDE1Nl5BMl5BanBnXkFtZTYwMTE3MDM2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 August 1957","placeOfBirth":" Burbank, California, USA","birthName":"Anthony Moran","height":"6' (1.83 m)","bio":"Tony Moran was born on August 14, 1957 in Burbank, California, USA as Anthony Moran. He is an actor and producer, known for Halloween (1978), Beg (2011) and American Poltergeist (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMTQ4NDE1Nl5BMl5BanBnXkFtZTYwMTE3MDM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0602985","name":"Tony Moran","idIMDB":"nm0602985"},"actorId":"nm0602985","character":"Michael Myers","urlCharacter":"http://www.imdb.com/character/ch0003211","main":true}],"seasons":[],"idIMDB":"tt0077651","urlIMDB":"http://www.imdb.com/title/tt0077651","business":{"budget":{"money":"$300,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$60,000,000 (Worldwide)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"SEK","country":"2,298,579","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 31 min (91 min)","1 hr 41 min (101 min) (extended) (USA)"],"soundMix":["Mono","Stereo (Stereo Scream Sound)"],"color":["Color (Metrocolor)"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["Metrocolor, Culver City (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision"],"printedFilmFormat":["35 mm"]},"rating":"7.9","metascore":"78","filmingLocations":[{"location":"Meridian Avenue & Mission Street, South Pasadena, California, USA"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2014","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best DVD/Blu-Ray Special Edition Release","names":[]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1979","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Horror Film","names":[]}]}]},{"award":"Avoriaz Fantastic Film Festival 1979","titlesAwards":[{"titleAwardOutcome":"Won Critics Award","categories":[{"category":"","names":[{"name":"John Carpenter","id":"nm0000118","role":null}]}]}]},{"award":"Chicago International Film Festival 1978","titlesAwards":[{"titleAwardOutcome":"Nominated Gold Hugo","categories":[{"category":"Best Feature","names":[{"name":"John Carpenter","id":"nm0000118","role":null}]}]}]},{"award":"Los Angeles Film Critics Association Awards 1979","titlesAwards":[{"titleAwardOutcome":"Won New Generation Award","categories":[{"category":"","names":[{"name":"John Carpenter","id":"nm0000118","role":null}]}]}]},{"award":"National Film Preservation Board, USA 2006","titlesAwards":[{"titleAwardOutcome":"Won National Film Registry","categories":[{"category":"","names":[]}]}]}],"votes":"166,853","type":"Movie","companyCreditsSimple":[{"idCompany":"co0051701","name":"Compass International Pictures"},{"idCompany":"co0017847","name":"Falcon International Productions"}],"keywords":{"keywords":["halloween","michael myers","babysitting","trick or treat","slasher","masked killer","night","death","psychiatrist","knife","stalking","high school","stabbed to death","knife murder","year 1978","woman strangled to death","woman stabbed","subjective camera","character's point of view camera shot","evil man","horror movie remade","first part","dead teenager","cult film","laundry room","gun","falling from height","electronic music score","dog","teenage girl","woman in jeopardy","mental patient","killing spree","homicidal maniac","girl","escaped mental patient","slasher flick","psychopath","butcher knife","first of series","psycho killer","halloween costume","boogeyman","1970s","dead dog","serial killer","escaped killer","famous score","stabbing","strangulation","holiday horror","violence","yelling","punishment","surprise ending","october","child","small town","teenager","kitchen knife","neighbor","car","murder","mask","knitting needle","bedsheet ghost","pay phone","payphone","teen horror","long take","child murders a child","manhunt","hiding in a closet","ghost costume","headstone","staged murder scene","small town sheriff","teenager in danger","teenager murdered","21 year old","17 year old","stabbed with kitchen knife","strangled with a telephone cord","return to hometown","one word title","reference to the boogeyman","woman wearing only a man's shirt","madman","maniac","serial murder","psychopathic killer","jumpsuit","blood splatter","carrying a dead body","year 1963","teen movie","human monster","dead woman with eyes open","dead woman","title at the end","husband wife relationship","lifting a male into the air","female protagonist","lifting someone into the air","carpenter","autumn leaves","autumn","villain not really dead cliche","paranoia","stabbed in the stomach","house of horrors","no ending","indestructibility","goth","wetness","suburb","mercilessness","low budget film","female victim","cutting","corruption","teen angst","shot in the chest","prologue","pot smoking","marijuana","falling out a window","car theft","burglary","knitting","female nudity","little girl","little boy","doctor patient relationship","babysitter","boy","teenage boy","good versus evil","underage drinking","murder of family","shot to death","off screen murder","running","fence","couch","1960s","blockbuster","nudity","nude woman murdered","music score composed by director","closet","sororicide","killer child","throat slitting","independent film","title spoken by character","light bulb"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:28:50"}}