{"data":{"movies":[{"title":"Save the Tiger","originalTitle":"","year":"1973","releaseDate":"19730214","directors":[{"name":"John G. Avildsen","id":"nm0000814"}],"writers":[{"name":"Steve Shagan","id":"nm0787399"}],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTlkOThjY2QtZjc5ZS00MjRmLWI4YjEtMTNkNDE1ZGYxMDhhXkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Drama"],"plot":"The film depicts a day and a half in Harry Stoner's life. Harry is down on his luck, and trapped in his own indulgences. He daydreams about his youth, trying to escape from the fact that business is rotten and his company owes bundles of money. His day is filled with unusual episodes as he picks up a hitchhiker/prostitute, arranges for his company's warehouse to burn down so he can collect the insurance-money, he hires strippers for his buddies and gets engaged in an animal rights campaign, a fashion show and experiences a rather uncomfortable flashback to the war.","simplePlot":"A disillusioned aging decent man and once proud WWII veteran is dealing with midlife crisis as well as a tough moral dilemma. If he wants his small near-bankrupt clothing company to survive, he has two days to let go of his shaken morals.","actors":[{"actorName":"Jack Lemmon","urlProfile":"http://www.imdb.com/name/nm0000493","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NTE3ODE1N15BMl5BanBnXkFtZTYwOTU1MTM2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1925","placeOfBirth":" Newton, Massachusetts, USA","birthName":"John Uhler Lemmon III","height":"5' 9\" (1.75 m)","bio":"Jack Lemmon was born in Newton, Massachusetts, to Mildred Burgess LaRue (Noel) and John Uhler Lemmon, Jr., the president of a doughnut company. His ancestry included Irish (from his paternal grandmother) and English. Jack attended Ward Elementary near his Newton, MA home. At age 9 he was sent to Rivers Country Day School, then located in nearby Brookline. After RCDS, he went to high school at Phillips Andover Academy. Jack was a member of the Harvard class of 1947, where he was in Navy ROTC and the Dramatic Club. After service as a Navy ensign, he worked in a beer hall (playing piano), on radio, off Broadway, TV and Broadway. His movie debut was with Judy Holliday in It Should Happen to You (1954). He won Best Supporting Actor as Ensign Pulver in Mister Roberts (1955). He received nominations in comedy (Some Like It Hot (1959), The Apartment (1960)) and drama (Days of Wine and Roses (1962), The China Syndrome (1979), Un fils pour l'été (1980) and Missing (1982)). He won the Best Actor Oscar for Save the Tiger (1973) and the Cannes Best Actor award for \"Syndrome\" and \"Missing\". He made his debut as a director with Kotch (1971) and in 1985 on Broadway in \"Long Day's Journey into Night\". In 1988 he received the Life Achievement Award of the American Film Institute.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NTE3ODE1N15BMl5BanBnXkFtZTYwOTU1MTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000493","name":"Jack Lemmon","idIMDB":"nm0000493"},"actorId":"nm0000493","character":"Harry Stoner","urlCharacter":"http://www.imdb.com/character/ch0035537","main":true},{"actorName":"Jack Gilford","urlProfile":"http://www.imdb.com/name/nm0318527","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNDM2MjU0MF5BMl5BanBnXkFtZTYwMjEzMjcy._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 July 1908","placeOfBirth":" New York City, New York, USA","birthName":"Jacob Aaron Gellman","bio":"Jack Gilford was born in Brooklyn, New York, as Yankel Gellman. He began his career in the Amateur Nights of the 1930s moving on to nightclubs as an innovative comedian doing satire and pantomime. He was a regular at the Greenwich Village nightspot, Cafe Society and hosted shows featuring Zero Mostel, Billie Holiday and jazz greats like Hazel Scott. It is said that he invented the expression, \"The butler did it!\", as part of one of his movie satire routines. He also did a facial pantomime of \"Pea Soup Coming to a Boil\". During the 1950s, he was a victim of the The House Un-American Activities Committee (HUAC) blacklisting which stalled his TV career until the early 1960s. But after that, he became a regular popular comic character actor on dozens of TV series and movies. He was most recognized for being the rubber-faced guy on the \"Cracker Jacks\" commercials for a dozen years, from 1960-1972. He was nominated for Tony awards on Broadway for best supporting actor in the musical, \"A Funny Thing Happened on the Way to the Forum\", and \"Cabaret\". The song \"Meeskite\" was written for him by John Kander & Fred Ebb. He was nominated for an Academy Award for Best Supporting Actor for the film, Save the Tiger (1973), starring opposite Jack Lemmon, who won the Best Actor Oscar for his performance.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNDM2MjU0MF5BMl5BanBnXkFtZTYwMjEzMjcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0318527","name":"Jack Gilford","idIMDB":"nm0318527"},"actorId":"nm0318527","character":"Phil Greene","urlCharacter":"http://www.imdb.com/character/ch0035539","main":true},{"actorName":"Laurie Heineman","urlProfile":"http://www.imdb.com/name/nm0374348","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzczOTg3MzUyMF5BMl5BanBnXkFtZTgwNTcxMjMzNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 August 1948","placeOfBirth":" Chicago, Illinois, USA","bio":"Laurie Heineman was born on August 4, 1948 in Chicago, Illinois, USA. She is an actress, known for Spotlight (2015), Another World (1964) and As the World Turns (1956). She has been married to Ron Millican since 1982. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzczOTg3MzUyMF5BMl5BanBnXkFtZTgwNTcxMjMzNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0374348","name":"Laurie Heineman","idIMDB":"nm0374348"},"actorId":"nm0374348","character":"Myra","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Norman Burton","urlProfile":"http://www.imdb.com/name/nm0123680","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNjU3ODQ0MV5BMl5BanBnXkFtZTgwMTMyMTM0MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 December 1923","placeOfBirth":" New York City, New York, USA","bio":"Norman Burton is reportedly a graduate of The Actor's Studio in New York. He appeared in professional stage productions of \"Sound of Hunting\", \"Anna Christie\" and José Quintero's production of Brendan Behan's \"The Quare Fellow\" in New York City. His film and TV career ran hot and cold, varying from good roles in major films to supporting roles in grade-B outings. A surprisingly little-remembered actor, he died in 2003.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNjU3ODQ0MV5BMl5BanBnXkFtZTgwMTMyMTM0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0123680","name":"Norman Burton","idIMDB":"nm0123680"},"actorId":"nm0123680","character":"Fred Mirrell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patricia Smith","urlProfile":"http://www.imdb.com/name/nm0809507","urlPhoto":"","biography":{"dateOfBirth":"20 February 1930","placeOfBirth":" New Haven, Connecticut, USA","bio":"Patricia Smith was born on February 20, 1930 in New Haven, Connecticut, USA. She was an actress, known for The Spirit of St. Louis (1957), Save the Tiger (1973) and Days of Our Lives (1965). She was married to John Lasell. She died on January 2, 2011 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0809507","name":"Patricia Smith","idIMDB":"nm0809507"},"actorId":"nm0809507","character":"Janet Stoner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thayer David","urlProfile":"http://www.imdb.com/name/nm0203076","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzODczMTcwOV5BMl5BanBnXkFtZTcwMjEyMTYxOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1927","placeOfBirth":" Medford, Massachusetts, USA","birthName":"David Thayer Hersey","bio":"He was David Thayer Hersey from an upper crust Winchester, Massachusetts family. After secondary school he began attending Harvard University. Along with several students he founded the Brattle Theatre Company in 1946. After working closely on Brattle with fellow Harvard graduates and his father,Thayer Frye Hersey, David took the stage name Thayer David in honor of his father. Thayer David was tall and heavy-set with a prominent beetling brow and protruding lips (a somewhat intimidating demeanor) which inevitably bound him to character roles. But he had no false allusions about leading man roles and whatnot other than applying a consummate passion for being a good actor in those parts allotted him. To this he brought a forceful if pursed and imperious voice and a knack for developing voice characterizations to fit any part. By late 1950 he was on Broadway in a revival of the comedy play \"The Relapse\" Through most the 1950s he was busy with theater roles rounded with returns to Broadway for the next two decades in some great dramas, including stepping in as a replacement to play Cardinal Wolsey in \"A Man for All Seasons\" (1961-63). Like many a trained actor looking beyond the stage, David saw the potential of the small screen as a new acting vehicle. By 1957 he had launched his TV career amid the television playhouse phenomenon which had been established by 1950. He would revisit perennially through most of the 1960s, but he had about the same time been discovered by filmdom as well. His first role was in the quite well done Baby Face Nelson (1957), part of the body of serious dramas that Mickey Rooney (as the machine gun-happy 1930s gangster) was amassing since his early days as one of Hollywood's biggest juvenile stars. David next film had the clumsy and long forgotten title A Time to Love and a Time to Die (1958), but it was a much more substantial part with young John Gavin as German friends who become World War II officers and confront humanity versus the Nazi war mentality. As was usual with his roles, David was the veiled (if not overt) antagonist-always intellectual but with a brutish shadow. Within a year the chance to play a really melodramatic villain came with his casting in the film version of Journey to the Center of the Earth (1959) from the novel by the visionary French 19th century sci-fi author Jules Verne. Although the film substantially strayed from the novel, the latter plodded along, while the script was fast-paced and engaging. And where there was no villain except nature herself, the film had David as the self-serving-downright nasty - Count Saknussem. With James Mason heading the cast and-then-teen heartthrob Pat Boone drawing in as well a young female audience, the film and its special effects made for a rousing good time. Into the 1960s David's opportunities focused most on television. And among these was a fad TV acting goal of being a guest super villain on the highly popular and inventive The Wild Wild West (1965 to 1969). David had the even better fortune of being cast in two episodes (1967 and 1969). In the meantime David had hit some more substantial TV pay dirt. The smash daytime horror soaper Dark Shadows had premiered in 1966, and David was in on the ground floor as perfect for several characters to emerge through the series run (1966 to 1971). He played seven characters in the course of the show, the most prominent being Professor T. Elliot Stokes. He reprised this role in the substantially more potent in-a-nutshell film version of the story House of Dark Shadows (1970), considered by horror aficionados as one of best blood and gore vampire romps. David returned in the studio-butchered and thus unsuccessful film sequel Night of Dark Shadows (1971) as his eighth characterization, the Reverend Strack. In all cases David was intimately involved and delighted in meshing makeup and costumes with the voices he invented for all these roles (most of which he developed) for the series. If not from an already dependable track record, David's longevity on the series marked him as a veteran trooper in the casting halls of Hollywood. But he later recalled that his time invested in doing voice over commercials could often come close to DS production schedule conflicts. His commercial work marked the inevitable practical side of acting. Even the best known actors and actresses have stooped to such business over art, for the money is always good. David was thereafter quite in demand through the decade of the 1970s in both film and TV. Although he might be best recalled from the era as the crooked fight manager in historic Rocky (1976), his most character of character roles was by far his Dragon in the Clint Eastwood adventure/thriller The Eiger Sanction (1975). Based on the novel by American author Rod Whitaker who used the pseudonym Trevanian to come off European, there is much name wordplay, for instance, Dragon's full name in the novel is Uras S. Dragon (say it fast). David's Dragon is head of CIA-like shadow hit unit which employed Eastwood's character, and Dragon is an extreme albino (can't tolerate normal environment). David gives him a rather strident rasping voice with a hint of menace that along with his nearly colorless eyes and figure bathed in the dramatic red light of an infrared-controlled environment easily makes him the most memorable character in the film. David guest-starred on some of the most watched episodic fare of the 1970s, and he was especially busy between 1975 and 1977. Amid two to three films per year he made the rounds of TV production at the major studios. Universal had continued using his talents during this period when this contributor met and worked with Thayer David in early 1977. He was an engaging person who enjoyed good conversation - the more obscure the better - and a good cigar. Among outside pursuits he was also a rare book collector with varied interests and enjoyed entertaining at home. A big man, he was nonetheless at that time overweight and the demands of production visibly put a strain on him - he looked ill. But an actor must work, and he carried on into the next year and lost some weight as well. It was then that Paramount television offered him a potentially great opportunity. This was the lead role in the TV pilot movie for a series on the preoccupied but brilliant, corpulent - and most important, rich - detective Nero Wolfe. The script was good, and Thayer lent his accumulated and considerable characterization talents to make Wolfe his own, although his loss of weight was now much more noticeable and was rumored to be cancer. The success of the TV pilot looked promising, as would the subsequent go-ahead for the series. But in one of the ironic twists of fate, Thayer David suddenly died of a heart attack, perhaps a complication of the purported advancing cancer - he was only 51 years old. The pilot was shelved for over a year, ending up premiering as a late night TV offering (Dec 1979). A Nero Wolfe series did appear (1981), but it was short-lived. One can only wonder if Thayer David had remained hale. A Nero Wolfe series with such a dedicated and creative actor may have thrived with a long run - the Holy Grail of any actor - the dream of security and the opportunity to contribute thoroughly to on-going success. Oh well - the stuff of dreams - posterity has to settle for the filmed record of Thayer David as is - and that is a very substantial offering indeed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzODczMTcwOV5BMl5BanBnXkFtZTcwMjEyMTYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0203076","name":"Thayer David","idIMDB":"nm0203076"},"actorId":"nm0203076","character":"Charlie Robbins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Hansen","urlProfile":"http://www.imdb.com/name/nm0361127","urlPhoto":"","biography":{"dateOfBirth":"2 March 1911","placeOfBirth":" Washington, District of Columbia, USA","bio":"William Hansen was born on March 2, 1911 in Washington, District of Columbia, USA. He was an actor, known for Fail-Safe (1964), Save the Tiger (1973) and 1776 (1972). He died on June 23, 1975 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0361127","name":"William Hansen","idIMDB":"nm0361127"},"actorId":"nm0361127","character":"Meyer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harvey Jason","urlProfile":"http://www.imdb.com/name/nm0419256","urlPhoto":"","biography":{"dateOfBirth":"29 February 1940","placeOfBirth":" London, England, UK","bio":"Harvey Jason was born on February 29, 1940 in London, England. He is known for his work on The Lost World: Jurassic Park (1997), Air America (1990) and Oliver & Company (1988). He has been married to Pamela Franklin since November 29, 1970. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0419256","name":"Harvey Jason","idIMDB":"nm0419256"},"actorId":"nm0419256","character":"Rico","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Liv Lindeland","urlProfile":"http://www.imdb.com/name/nm0511515","urlPhoto":"","biography":{"dateOfBirth":"7 December 1945","placeOfBirth":" Norway","height":"5' 7\" (1.7 m)","bio":"Buxom and shapely blonde bombshell Liv Lindeland was born on December 7, 1945 in Norway. Liv moved to the United States in 1965 and worked for four years as a fashion model in Boston, Massachusetts. Lindeland moved a second time to Los Angeles, California in 1969. She was the Playmate of the Month in the January, 1971 issue of \"Playboy\" and has the distinction of being the first Playmate to show pubic hair in her pictorial. Liv was named Playmate of the Year in 1972. She studied acting and speech at the Robert Arthur Workshop in Los Angeles. In the wake of her Playmate stint Lindeland went on to act in a handful of movies and eventually became a talent agent. Liv did a follow-up pictorial called \"Playmates Forever!\" in the December, 1979 issue of \"Playboy.\" She's the daughter in law of actress/dancer Cyd Charisse.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0511515","name":"Liv Lindeland","idIMDB":"nm0511515"},"actorId":"nm0511515","character":"Ula","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lara Parker","urlProfile":"http://www.imdb.com/name/nm0662430","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MDQyNTI1MV5BMl5BanBnXkFtZTcwOTA2MDQ4Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 October 1938","placeOfBirth":" Knoxville, Tennessee, USA","birthName":"Mary Lamar Rickey","height":"5' 5½\" (1.66 m)","bio":"Lara Parker was born in Knoxville, Tennessee, and grew up in Memphis. She attended Central High School in Memphis and won a scholarship to Vassar College, where she began a major in Philosophy, which she completed at Southwestern at Memphis, now called Rhodes College, receiving her BA. She attended graduate school at the University of Iowa and completed all course work on a Masters in Speech and Drama. The summer Lara was to write her thesis, she acted at the Millbrook Playhouse in Lock Haven, Pennsylvania, where she did five leading roles in six weeks. Rather than return to Iowa, she decided to try her luck in New York City, and, the second week she was there, she was cast as Angelique the witch in the daytime horror serial Dark Shadows (1966), a job she held for five years, culminating in the film, Night of Dark Shadows (1971). While she was in New York, she appeared in a Broadway play, \"Woman is My Idea\", and two off-Broadway Plays: \"Lulu\" and \"A Gun Play\". Lara moved to Los Angeles in 1972 and began working in film and nighttime television, performing many guest roles and occasionally returning to daytime television. After acting, she has been a high school teacher, has written several screenplays and has completed her first novel (see book section below). As of 1999, she lives in California with her husband, Jimmy Hawkins, and daughter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MDQyNTI1MV5BMl5BanBnXkFtZTcwOTA2MDQ4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0662430","name":"Lara Parker","idIMDB":"nm0662430"},"actorId":"nm0662430","character":"Margo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eloise Hardt","urlProfile":"http://www.imdb.com/name/nm0362496","urlPhoto":"","biography":{"dateOfBirth":"1918","placeOfBirth":" Lawton, Oklahoma, USA","birthName":"Florence Louise Hardt","bio":"Eloise Hardt was born in 1918 in Lawton, Oklahoma, USA as Florence Louise Hardt. She is an actress, known for The Dennis O'Keefe Show (1959), Incubus (1966) and Save the Tiger (1973).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0362496","name":"Eloise Hardt","idIMDB":"nm0362496"},"actorId":"nm0362496","character":"Jackie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Janina","urlProfile":"http://www.imdb.com/name/nm0417633","urlPhoto":"","biography":{"bio":"Janina is an actress, known for Save the Tiger (1973) and Marcus Welby, M.D. (1969).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0417633","name":"Janina","idIMDB":"nm0417633"},"actorId":"nm0417633","character":"Dusty","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ned Glass","urlProfile":"http://www.imdb.com/name/nm0321982","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNzkzMzg3OF5BMl5BanBnXkFtZTcwNTIyMjYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 April 1906","placeOfBirth":" Radom, Mazowieckie, Poland","birthName":"Nusyn Glass","bio":"Veteran Polish-born character actor Ned Glass grew up in New York, and, after vaudeville experience, started acting in small parts on Broadway from the early 1930's. He gained further experience in the capacity of theatrical production supervisor, before entering motion pictures in 1937 as an MGM contract player. Until the mid-1950's, he was seen primarily in tiny supporting roles as clerks, reporters, bank tellers and small-time managers. His career was briefly put on hold after being blacklisted during the McCarthy era, but, with help from friends like John Houseman and Moe Howard (of The Three Stooges fame) he managed to get enough film work to make ends meet. By 1953, Ned began to find a new lease of life in television, where his roles were more varied and substantial. This afforded him the opportunity to fully develop his screen persona: that of the balding, weedy, perpetually nervy conman or weasely stooge, often delivering barbed repartee or wisecracks in a heavy Brooklyn accent. Ned was at his best in comedy, put to good use in several episodes of Jackie Gleason's The Honeymooners (1955), and adapting well to anything else with a New York theme, from Kojak (1973) to Barney Miller (1974). He had many other good guest-starring roles on television, including several shifty characters in The Untouchables (1959), and as Freddie the Forger in Get Smart (1965) ('Do I Hear a Vaults?',1970). He was twice nominated for Emmy Awards, first, for an episode of Julia (1968) (as Sol Cooper); the second time in for Bridget Loves Bernie (1972) (Uncle Moe Plotnick). From the time he played Doc in West Side Story (1961), Ned also began to land some meatier roles on the big screen, including the character of Popcorn in Experiment in Terror (1962), and as Doc Schindler, in one of the funniest 60's comedies, The Fortune Cookie (1966), directed by Billy Wilder. His best portrayal was that of the wily Leonard Gideon, sharpest of the villainous trio (the others being James Coburn and George Kennedy) on the trail of a quarter of a million dollar loot in gold, in the Hitchcockian thriller Charade (1963). Ned continued playing crusty reprobates in films and on television, his last being a small-time thief in an episode of Cagney & Lacey (1981). He died two years later in Encino, California, at the age of 78.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNzkzMzg3OF5BMl5BanBnXkFtZTcwNTIyMjYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0321982","name":"Ned Glass","idIMDB":"nm0321982"},"actorId":"nm0321982","character":"Sid Fivush","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pearl Shear","urlProfile":"http://www.imdb.com/name/nm0790401","urlPhoto":"","biography":{"dateOfBirth":"19 April 1918","placeOfBirth":" Washington, Pennsylvania, USA","birthName":"Pearl Gilbert","bio":"Pearl Shear was born on April 19, 1918 in Washington, Pennsylvania, USA as Pearl Gilbert. She was an actress, known for High Anxiety (1977), Barfly (1987) and Save the Tiger (1973). She died on July 27, 2009 in Chapel Hill, North Carolina, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0790401","name":"Pearl Shear","idIMDB":"nm0790401"},"actorId":"nm0790401","character":"Cashier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Biff Elliot","urlProfile":"http://www.imdb.com/name/nm0254187","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MjYxOTM4MF5BMl5BanBnXkFtZTcwMzc2MTMwMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1923","placeOfBirth":" Lynn, Massachusetts, USA","birthName":"Leon Shalek","bio":"Biff Elliot was born on July 26, 1923 in Lynn, Massachusetts, USA as Leon Shalek. He was an actor, known for I, the Jury (1953), PT 109 (1963) and Alfred Hitchcock Presents (1955). He was married to Constance K. Bandy and Elizabeth A. Dole. He died on August 15, 2012 in Studio City, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MjYxOTM4MF5BMl5BanBnXkFtZTcwMzc2MTMwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0254187","name":"Biff Elliot","idIMDB":"nm0254187"},"actorId":"nm0254187","character":"Tiger Petitioner","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0070640","urlIMDB":"http://www.imdb.com/title/tt0070640","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"14","month":"02","year":"1972","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 40 min (100 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Movielab, USA"],"filmLength":["2,725 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.9","filmingLocations":[{"location":"Roxbury Park - 471 S. Roxbury Dr, Beverly Hills, California, USA"}],"rated":"R","awards":[{"award":"Academy Awards, USA 1974","titlesAwards":[{"titleAwardOutcome":"Won Oscar","categories":[{"category":"Best Actor in a Leading Role","names":[{"name":"Jack Lemmon","id":"nm0000493","role":null}]}]},{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Actor in a Supporting Role","names":[{"name":"Jack Gilford","id":"nm0318527","role":null}]},{"category":"Best Writing, Story and Screenplay Based on Factual Material or Material Not Previously Published or Produced","names":[{"name":"Steve Shagan","id":"nm0787399","role":null}]}]}]},{"award":"Golden Globes, USA 1974","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Motion Picture - Drama","names":[]},{"category":"Best Supporting Actor - Motion Picture","names":[{"name":"Jack Gilford","id":"nm0318527","role":null}]},{"category":"Best Actor in a Motion Picture - Drama","names":[{"name":"Jack Lemmon","id":"nm0000493","role":null}]}]}]},{"award":"Writers Guild of America, USA 1974","titlesAwards":[{"titleAwardOutcome":"Won WGA Award (Screen)","categories":[{"category":"Best Drama Written Directly for the Screen","names":[{"name":"Steve Shagan","id":"nm0787399","role":null}]}]}]}],"votes":"3,686","type":"Movie","companyCreditsSimple":[{"idCompany":"co0065715","name":"Filmways Pictures"},{"idCompany":"co0261058","name":"Cirandinha Productions"},{"idCompany":"co0261000","name":"Jalem Productions"}],"keywords":{"keywords":["flashback","fashion show","businessman","reference to charlie chaplin","reference to w.c. fields","reference to daddy warbucks","reference to little lulu","reference to popeye","reference to citation the racehorse","reference to whirlaway the racehorse","little league baseball","one night stand","war flashback","reference to the song fine and mellow","reference to billie holiday","reference to the cotton club","reference to lena horne","no ending","reference to joe penner","reference to lou gehrig","reference to irving berlin","reference to lorenz hart","reference to richard rodgers","reference to george gershwin","sports fan","jazz fan","reference to fats waller","reference to mel powell","reference to art tatum","reference to doc blanchard","reference to glenn davis","reference to red grange","reference to babe ruth","reference to hank greenberg","reference to earl hines","reference to jimmie foxx","reference to willie pep","reference to tony zale","reference to sugar ray robinson","reference to oliver hardy","reference to stan laurel","reference to paul von hindenburg","reference to the hindenburg","reference to daniel ellsberg","reference to martin bormann","reference to daniel berrigan","reference to bunny berigan","reference to eddie arcaro","reference to brian jones","reference to edward bowes","reference to jim morrison","reference to beau jack","reference to janis joplin","reference to helen o'connell","reference to jimi hendrix","reference to josef stalin","reference to jesus christ","reference to mao zedong","reference to carl hubbell","reference to the rolling stones","older man younger woman","reference to maharishi mahesh yogi","reference to pierre laval","reference to oscar ichazo","reference to gabriel heatter","reference to ram dass","reference to marcel cerdan","reference to jefferson starship","reference to jack teagarden","reference to grace slick","reference to lucky luciano","reference to don ameche","reference to abe reles","reference to aretha franklin","reference to fiorello laguardia","reference to barbra streisand","reference to jimmy durante","reference to the band","reference to franklin d. roosevelt","reference to bob dylan","reference to cookie lavagetto","reference to new riders of the purple sage","reference to fred allen","reference to jerry garcia","reference to herman goering","reference to the grateful dead","reference to henry a. wallace","reference to glenn miller","reference to moe purtill","reference to my lai massacre","reference to james earl ray","reference to medgar evers","reference to robert f. kennedy","reference to john f. kennedy","reference to j. d. tippit","reference to albert camus","reference to the beatles","reference to martin luther king","reference to enola gay","reference to adolf eichmann","reference to malcolm x","reference to sirhan sirhan","reference to joseph goebbels","reference to marilyn monroe","reference to jack ruby","reference to wilhelm keitel","reference to heinrich himmler","reference to moses","reference to albert speer","raising money","reference to mick jagger","speaking spanish","car phone","reference to the beaches of normandy","reference to d day","survival","jewish character","wise old man","employer employee relationship","guilty conscious","stuck between a rock and a hard place","cynic","indebted company","metaphoric title","cab driver","tiger","animal conservationist","petition","arson specialist","moral dilemma","arson for hire","embezzlement","porn theater","mobster","upper middle class","giving a speech","public event","best friend","nervous breakdown","dead war buddy","ptsd","midlife crisis","insurance fraud","melancholy","hired arsonist","heart attack during sex","speaking french","sexual fetish","business partner","world war two veteran","disillusionment","nostalgia","threat of bankruptcy","financial trouble","high class prostitute","cheating husband","propositioned for sex","clothing manufacturer","clothing industry","clothing factory","oscar winner","american dream","dissatisfaction","materialism","cynicism","illegal drug","pot smoking","smoking marijuana","self discovery","alienation","deadpan humor","only daughter","barely legal","older man younger woman relationship","friendship","jazz","baseball","clothes line","existentialism","reference to cole porter","enema","water cooler","visual hallucination","tie","telephone","taxi","switch board","suit","sink","shower","shaving","sewing machine","razor","prostitute","partners","panties","pacific ocean","nudity","nightmare","movie theatre","model","mob","marijuana","maid","los angeles california","hitchhiker","heart attack","garter","elevator","dart board","cocktail bar","cigar smoking","cigarette smoking","chinese restaurant","breakfast in bed","bra","boxer shorts","beach","baseball field","automobile","auditory hallucination","argument","world war two","garment worker","garment industry","factory","arson","arsonist","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:26:43"}}