{"data":{"movies":[{"title":"For a Few Dollars More","originalTitle":"Per qualche dollaro in più","year":"1965","releaseDate":"19670510","directors":[{"name":"Sergio Leone","id":"nm0001466"}],"writers":[{"name":"Sergio Leone","id":"nm0001466"},{"name":"Fulvio Morsella","id":"nm0607694"}],"runtime":"132 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMjIzOTEzMF5BMl5BanBnXkFtZTcwMTUzNTk3NA@@._V1.jpg","countries":["Italy","Spain","West Germany"],"languages":["Italian"],"genres":["Western"],"plot":"Monco is a bounty killer chasing El Indio and his gang. During his hunting, he meets Col. Douglas Mortimer, another bounty killer, and they decide to make a partnership, chase the bad guys together and split the reward. During their enterprise, there will be lots of bullets and funny situations. In the end, one of the bounty hunters shows the real intention of his hunting.","simplePlot":"Two bounty hunters with the same intentions team up to track down a Western outlaw.","actors":[{"actorName":"Clint Eastwood","urlProfile":"http://www.imdb.com/name/nm0000142","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDc0MjY0OV5BMl5BanBnXkFtZTcwNzU1MDAxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1930","placeOfBirth":" San Francisco, California, USA","birthName":"Clinton Eastwood Jr.","height":"6' 4\" (1.93 m)","bio":"Perhaps the icon of macho movie stars, and a living legend, Clint Eastwood has become a standard in international cinema. Born May 31, 1930 in San Francisco, the elder of two children in a middle-class family, Eastwood stayed in high school until the comparatively late age of nineteen and worked menial jobs over a period of several years before enrolling at Los Angeles City College, from which he dropped out after two semesters to pursue acting. He found uncredited bit parts in such nondescript B-films as Revenge of the Creature (1955) and Tarantula (1955) during the mid-'50s while simultaneously digging swimming pools for a living, until he got his first breakthrough in the long-running TV series Rawhide (1959) with Eric Fleming. Though only a secondary player in the early seasons, Clint made the show his own by end of its run and became a recognizable face to television viewers around the country. Eastwood found much bigger and better things in Italy with the excellent spaghetti westerns A Fistful of Dollars (1964) and For a Few Dollars More (1965). But it was the third installment in the trilogy where he found one of his signature roles: The Good, the Bad and the Ugly (1966). The movie was a big hit and he became an instant international star. Clint's first American-made western, Hang 'Em High (1968), was yet again a success, and he followed it up with another starring role in Coogan's Bluff (1968) (the loose inspiration to the TV series McCloud (1970)) before playing second fiddle to Richard Burton in the World War II epic Where Eagles Dare (1968) and Lee Marvin in the bizarre musical Paint Your Wagon (1969). In Sierra torride (1970) and Kelly's Heroes (1970), Eastwood went in an experimental direction by combining tough-guy action with offbeat humor. 1971 proved to be one of his best years in film, if not the best. He starred in The Beguiled (1971) and the classic thriller Play Misty for Me (1971), but it was his role as the hard edge police inspector in Dirty Harry (1971) that gave Eastwood one of his signature roles and invented the loose-cannon cop genre that has been imitated even to this day. Eastwood did a fairly consistent quality of work thereafter with the road movies Thunderbolt and Lightfoot (1974) and The Gauntlet (1977), the Dirty Harry sequels Magnum Force (1973) and The Enforcer (1976), the westerns Joe Kidd (1972), High Plains Drifter (1973) and The Outlaw Josey Wales (1976) (his first of six onscreen collaborations with then live-in love Sondra Locke), and the fact-based thriller Escape from Alcatraz (1979). In 1978 he branched out into the comedy genre in Every Which Way But Loose (1978), which became the biggest hit of his career up to that time; taking inflation into account, it still is. In short, notwithstanding The Eiger Sanction (1975), the '70s were an uninterrupted continuation of success. Eastwood kicked off the '80s with Any Which Way You Can (1980), the blockbuster sequel to Every Which Way But Loose. The fourth Dirty Harry film, Sudden Impact (1983), was the highest-grossing film of the franchise and spawned the character's trademark catchphrase, \"Make my day\". Clint also starred in Bronco Billy (1980), Firefox (1982), Tightrope (1984), City Heat (1984), Pale Rider (1985) and Heartbreak Ridge (1986), all of which were solid hits, with Honkytonk Man (1982) being his only commercial failure of the period. In 1988 he did his fifth and final Dirty Harry movie, The Dead Pool (1988). Although it was a success overall, it did not have the box office punch the previous films had. About this time, with outright bombs like Pink Cadillac (1989) and The Rookie (1990), it became apparent that Eastwood's star was declining as it never had before. He then started taking on more personal projects, such as directing Bird (1988), a biopic of Charlie Parker, and starring in and directing White Hunter Black Heart (1990), an uneven, loose biopic of John Huston. Eastwood bounced back in a big way with his western Unforgiven (1992), which garnered the then 62-year-old his first ever Academy Award nomination (Best Actor) and win for Best Director. Following up with a quick hit, he took on the secret service in In the Line of Fire (1993), then accepted second billing to Kevin Costner in the interesting but poorly received drama A Perfect World (1993). Next up was a love story, The Bridges of Madison County (1995), where Clint surprised audiences with a sensitive performance, but it soon became apparent he was going backwards after his brief revival. Subsequent films were credible, but nothing really stuck out. Among them were the moderately well-received Absolute Power (1997) and Space Cowboys (2000) as well as the badly received True Crime (1999) and Blood Work (2002). But Eastwood surprised yet again, returning to the top of the A-list with the hugely successful boxing drama Million Dollar Baby (2004). The movie earned him an Oscar for Best Director and a Best Actor nomination for the second time. Behind the camera, he had big successes directing the multi-award-winners Mystic River (2003), Flags of Our Fathers (2006), Letters from Iwo Jima (2006) and Changeling (2008) which starred Angelina Jolie. His next starring vehicle, Gran Torino (2008), earned $30 million in its opening weekend, proving his box office appeal has not waned. Eastwood has managed to keep his extremely convoluted personal life top secret and never discusses his families with the media. He had a long time relationship with frequent co-star Locke and has at least eight children by at least six other women, although he has only been married twice. Clint Eastwood lives in Los Angeles and owns homes in Monterey, Northern California, Idaho and Hawaii.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDc0MjY0OV5BMl5BanBnXkFtZTcwNzU1MDAxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000142","name":"Clint Eastwood","idIMDB":"nm0000142"},"actorId":"nm0000142","character":"Monco","urlCharacter":"http://www.imdb.com/character/ch0038741","main":true},{"actorName":"Lee Van Cleef","urlProfile":"http://www.imdb.com/name/nm0001812","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0ODU1NjY5N15BMl5BanBnXkFtZTcwNTI0NzEyMw@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 January 1925","placeOfBirth":" Somerville, New Jersey, USA","birthName":"Clarence Leroy Van Cleef Jr.","height":"6' 2\" (1.88 m)","bio":"One of the great movie villains, Clarence Leroy Van Cleef, Jr. was born in Somerville, New Jersey, to Marion Lavinia (Van Fleet) and Clarence LeRoy Van Cleef, Sr. His parents were both of Dutch ancestry. Van Cleef started out as an accountant. He served in the U.S. Navy aboard minesweepers and subchasers during World War II. After the war he worked as an office administrator, becoming involved in amateur theatrics in his spare time. An audition for a professional role led to a touring company job in \"Mr. Roberts\". His performance was seen by Stanley Kramer, who cast him as henchman Jack Colby in High Noon (1952), a role that brought him great recognition despite the fact that he had no dialogue. For the next decade he played a string of memorably villainous characters, primarily in westerns but also in crime dramas such as The Big Combo (1955). His hawk nose and steely, slit eyes seemed destined to keep him always in the realm of heavies, but in the mid-Sergio Leone cast him as the tough but decent Col. Mortimer opposite Clint Eastwood in For a Few Dollars More (1965). A new career as a western hero (or at least anti-hero) opened up, and Van Cleef became an international star, though in films of decreasing quality. In the 1980s he moved easily into action and martial-arts movies, and starred in The Master (1984), a TV series featuring almost non-stop martial arts action. He died of a heart attack in December 1989, and was buried at Forest Lawn in the Hollywood Hills.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0ODU1NjY5N15BMl5BanBnXkFtZTcwNTI0NzEyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001812","name":"Lee Van Cleef","idIMDB":"nm0001812"},"actorId":"nm0001812","character":"Col. Douglas Mortimer","urlCharacter":"http://www.imdb.com/character/ch0002060","main":true},{"actorName":"Gian Maria Volontè","urlProfile":"http://www.imdb.com/name/nm0002231","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NTU2NDU4M15BMl5BanBnXkFtZTcwNTUyNjMyNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1933","placeOfBirth":" Milan, Lombardy, Italy","height":"6' 0½\" (1.84 m)","bio":"Born in Milan in 1933, Gian Maria Volontè studied in Rome at the National Dramatic Arts Academy, where he obtained his degree in 1957. He began working in theatre and television, where he was soon noticed as one of the most promising actors of his generation. After several supporting appearances in film, he reached notoriety with the character of Ramón Rojo in Sergio Leone's A Fistful of Dollars (1964). This success was doubled in Leone's next film, For a Few Dollars More (1965). The following ten years would be the most intense of Volontè career. L'armée Brancaleone (1966) (directed by Mario Monicelli) was the most successful Italian movie of the year, We Still Kill the Old Way (1967) (directed by Elio Petri) won the Grand Prix du Scenario at the Cannes Film Festival, and Volontè won his first Nastro d'Argento (Silver Ribbon - the most presitgious acting award in Italy) in 1970 for Enquête sur un citoyen au-dessus de tout soupçon (1970) (also directed by Petri), making him an international star. The film won the Academy Award for Best Foreign-Language Film, the Grand Prix at the Cannes Film Festival and two Italian Golden Globes, including one for his performance. In 1972, he starred in two Italian movies as the protagonist: Petri's Lulu the Tool (1971) and Francesco Rosi's The Mattei Affair (1972), both of which win the Grand Prix at the Cannes Film Festival, where he also wins a Special Mention. In his life, Volontè won a huge number of other prizes and honours, becoming one of the most celebrated Italian actors of the seventies, and challenging Vittorio Gassman and Marcello Mastroianni as the most popular Italian actor. He died in Greece in 1994.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NTU2NDU4M15BMl5BanBnXkFtZTcwNTUyNjMyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002231","name":"Gian Maria Volontè","idIMDB":"nm0002231"},"actorId":"nm0002231","character":"El Indio","urlCharacter":"http://www.imdb.com/character/ch0002070","main":true},{"actorName":"Mario Brega","urlProfile":"http://www.imdb.com/name/nm0103828","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNzE2MDI1MV5BMl5BanBnXkFtZTcwNjQ2NzEyMw@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 March 1923","placeOfBirth":" Rome, Lazio, Italy","height":"6' 4\" (1.93 m)","bio":"Mario Brega was born on March 5, 1923 in Rome, Lazio, Italy. He was an actor and producer, known for For a Few Dollars More (1965), The Good, the Bad and the Ugly (1966) and A Fistful of Dollars (1964). He died on July 23, 1994 in Rome.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNzE2MDI1MV5BMl5BanBnXkFtZTcwNjQ2NzEyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0103828","name":"Mario Brega","idIMDB":"nm0103828"},"actorId":"nm0103828","character":"Nino, Member of Indio's Gang","urlCharacter":"http://www.imdb.com/character/ch0142845","main":true},{"actorName":"Luigi Pistilli","urlProfile":"http://www.imdb.com/name/nm0685559","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MzM4MDI5OV5BMl5BanBnXkFtZTcwNjU2NzEyMw@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 July 1929","placeOfBirth":" Grosseto, Tuscany, Italy","bio":"Luisi Pistilli's most notable stage successes were roles in \"The Threepenny Opera\", \"St. Joan of the Stockyards\" and a 1972 production, \"Lulu\". In 1991 he reprised his role in \"Lulu\" in the first professional collaboration with actress-singer Milva, his partner in previous plays as well as in a four-year offstage relationship. Pistilli's most memorable roles were in Francesco Rosi's Cadavres exquis (1976), Lino Del Fra's Antonio Gramsci: The Days of Prison (1977), Carlo Lizzani's Italo-Bulgarian co-production The Bandit (1969) and Sergio Leone's For a Few Dollars More (1965) and The Good, the Bad and the Ugly (1966), in which he played priest Pablo Ramirez, the brother of Eli Wallach's character Tuco. He also worked frequently in TV, including the Mafia series La Mafia 5 - Mort à Palerme (1990), directed by Luigi Perelli.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MzM4MDI5OV5BMl5BanBnXkFtZTcwNjU2NzEyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0685559","name":"Luigi Pistilli","idIMDB":"nm0685559"},"actorId":"nm0685559","character":"Groggy, Member of Indio's Gang","urlCharacter":"http://www.imdb.com/character/ch0107702","main":true},{"actorName":"Aldo Sambrell","urlProfile":"http://www.imdb.com/name/nm0759757","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNjY0NTQzMV5BMl5BanBnXkFtZTYwODEwMjI0._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 February 1931","placeOfBirth":" Madrid, Madrid, Spain","birthName":"Alfredo Sánchez Brell","bio":"Prolific, versatile, and ubiquitous character actor Aldo Sambrell was featured in over 140 international motion pictures in a remarkably long, varied, and illustrious career that spanned four and a half decades. Swarthy and burly, usually sporting a thick mustache, and often projecting an air of quiet oily menace, Sambrell was frequently cast in colorful supporting parts as hateful villains and lethal gunslingers in numerous Italian spaghetti Westerns. Sambrell was born Alfredo Sanchez Brell on February 23, 1931 in Madrid, Spain. His family fled Spain because of the Spanish Civil War and he was raised in Mexico. While in Mexico Aldo played professional soccer in the Mexican leagues in Pueblo and Monterrey. After beginning his career in the entertainment industry as a singer, Sambrell eventually returned to Spain and made his film debut in an uncredited bit role as a Jewish rebel in the biblical epic King of Kings (1961). Aldo appeared in his first spaghetti western in 1963. Sambrell was perhaps best known for his gritty portrayals of scruffy bandit gang members in Sergio Leone's classic spaghetti westerns A Fistful of Dollars (1964), For a Few Dollars More (1965), The Good, the Bad and the Ugly (1966) and Once Upon a Time in the Wild, Wild West (1973). Sambrell gave a memorably chilling performance as ruthless bandit gang leader Mervyn Duncan in Navajo Joe (1966). He had a rare lead role as voodoo priest Gatenebo in the laughably lousy horror clunker La vengeance du zombie (1974). Among the many directors Aldo worked for are David Lean, Richard Fleischer, John Milius, Sergio Corbucci, Umberto Lenzi, León Klimovsky, Jess Franco, Richard Lester, Jackie Chan, Charlton Heston, Matt Cimber and Enzo G. Castellari. Moreover, Sambrell also wrote, produced and directed a few films. He was married to actress Cándida López. His last film role was as an aging actor in the poignant short Río seco (2006). Aldo died at age 79 on July 10, 2010 in Alicante, Spain after suffering a series of strokes.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNjY0NTQzMV5BMl5BanBnXkFtZTYwODEwMjI0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0759757","name":"Aldo Sambrell","idIMDB":"nm0759757"},"actorId":"nm0759757","character":"Cuchillio","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Klaus Kinski","urlProfile":"http://www.imdb.com/name/nm0001428","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyOTgwMDE1MV5BMl5BanBnXkFtZTcwNzAxNTIzNA@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 October 1926","placeOfBirth":" Zoppot, Free City of Danzig [now Sopot, Pomorskie, Poland]","birthName":"Nikolaus Günther Nakszynski","height":"5' 8\" (1.73 m)","bio":"Klaus Kinski was born Nikolaus Günther Nakszynski in Zoppot, Free City of Danzig (now Sopot, Poland), to Susanne (Lutze), a nurse, and Bruno Nakszynski, a pharmacist. He grew up in Berlin, was drafted into the German army in 1944 and captured by British forces in Holland. After the war he began acting on the stage, quickly gaining a reputation for his ferocious talent and equally ferocious temper. He started acting in films shortly afterwards, showing an utter disregard for the quality of the productions he appeared in and churning out so many that a complete filmography is almost impossible to assemble. However, he did turn out memorable work for director Werner Herzog, a similarly driven and obsessive character. Herzog and Kinski pushed each other to extremes over a 15-year working relationship, which finally ended after filming Cobra Verde (1987), a production plagued by volcanic clashes between the star and director, involving--among other things--violent physical altercations and mutual death threats. Kinski subsequently directed and starred in the notorious Paganini (1989), his only film as director and which was marked by (again) clashes between Kinski and his producers, who accused him of turning their movie into a pornographic film and sued him in court. His autobiography \"All I Need is Love\", one of the most vicious attacks on the film business ever written, was withdrawn for legal reasons and subsequently re-released as \"Kinski Uncut\" in the US & UK, \"Ich brauche Liebe\" in Germany, and in various other languages.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyOTgwMDE1MV5BMl5BanBnXkFtZTcwNzAxNTIzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001428","name":"Klaus Kinski","idIMDB":"nm0001428"},"actorId":"nm0001428","character":"Juan Wild - The Hunchback","urlCharacter":"http://www.imdb.com/character/ch0467968","main":true},{"actorName":"Benito Stefanelli","urlProfile":"http://www.imdb.com/name/nm0824934","urlPhoto":"","biography":{"dateOfBirth":"2 September 1928","placeOfBirth":" Rome, Lazio, Italy","bio":"Benito Stefanelli was born on September 2, 1928 in Rome, Lazio, Italy. He is known for his work on The Good, the Bad and the Ugly (1966), A Fistful of Dollars (1964) and For a Few Dollars More (1965). He died in December 1999.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0824934","name":"Benito Stefanelli","idIMDB":"nm0824934"},"actorId":"nm0824934","character":"Luke 'Hughie'","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Luis Rodríguez","urlProfile":"http://www.imdb.com/name/nm0735668","urlPhoto":"","biography":{"birthName":"Luis Rodríguez Palillo","bio":"Luis Rodríguez was born as Luis Rodríguez Palillo. He is an actor, known for For a Few Dollars More (1965), Otra primavera (1950) and Cerca de la ciudad (1952).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0735668","name":"Luis Rodríguez","idIMDB":"nm0735668"},"actorId":"nm0735668","character":"Manuel, Member of Indio's Gang","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Panos Papadopulos","urlProfile":"http://www.imdb.com/name/nm0660208","urlPhoto":"","biography":{"dateOfBirth":"1 August 1920","placeOfBirth":" Kerassus, Greece","bio":"Panos Papadopulos was born on August 1, 1920 in Kerassus, Greece. He was an actor, known for For a Few Dollars More (1965), Otto - Der Film (1985) and Fedora (1978). He died on February 18, 2001 in Munich, Bavaria, Germany.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0660208","name":"Panos Papadopulos","idIMDB":"nm0660208"},"actorId":"nm0660208","character":"Sancho Perez, Member of Indio's Gang","urlCharacter":"http://www.imdb.com/character/ch0151823","main":true},{"actorName":"Mara Krupp","urlProfile":"http://www.imdb.com/name/nm0472756","urlPhoto":"","biography":{"dateOfBirth":"26 October 1935","placeOfBirth":" Italy","bio":"Mara Krupp was born on October 26, 1935 in Italy. She is an actress, known for For a Few Dollars More (1965), I due pezzi da 90 (1971) and Squillo (1964).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0472756","name":"Mara Krupp","idIMDB":"nm0472756"},"actorId":"nm0472756","character":"Mary - Hotel Manager's Beautiful Wife","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roberto Camardiel","urlProfile":"http://www.imdb.com/name/nm0131209","urlPhoto":"","biography":{"dateOfBirth":"29 November 1917","placeOfBirth":" Alagón, Zaragoza, Aragón, Spain","birthName":"Roberto Camardiel Escudero","bio":"Roberto Camardiel was born on November 29, 1917 in Alagón, Zaragoza, Aragón, Spain as Roberto Camardiel Escudero. He was an actor, known for For a Few Dollars More (1965), Molokai, la isla maldita (1959) and Mi calle (1960). He died on November 7, 1986 in Madrid, Spain.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0131209","name":"Roberto Camardiel","idIMDB":"nm0131209"},"actorId":"nm0131209","character":"Tucumcari station clerk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joseph Egger","urlProfile":"http://www.imdb.com/name/nm0250905","urlPhoto":"","biography":{"dateOfBirth":"22 February 1889","placeOfBirth":" Donawitz, Styria, Austria-Hungary [now Austria]","bio":"Joseph Egger was born on February 22, 1889 in Donawitz, Styria, Austria-Hungary. He was an actor, known for A Fistful of Dollars (1964), For a Few Dollars More (1965) and Sissi impératrice (1956). He died on August 29, 1966 in Gablitz, Lower Austria, Austria.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0250905","name":"Joseph Egger","idIMDB":"nm0250905"},"actorId":"nm0250905","character":"Old Prophet","urlCharacter":"http://www.imdb.com/character/ch0393456","main":true},{"actorName":"Tomás Blanco","urlProfile":"http://www.imdb.com/name/nm0087339","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmRiMGFjMmQtYWI0Yi00ODFmLWI3YTctYjlkZGI2YTEzNmVmXkEyXkFqcGdeQXVyNTUyMTMyMDg@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1910","placeOfBirth":" Bilbao, Vizcaya, País Vasco, Spain","birthName":"Tomás Blanco García","bio":"At 18 he enlisted in the Foreign Legion in Morocco remained prominent through 21. After graduating, contact the theater environment, debuting professionally in Madrid in 1933 with the company Josefina Diaz. Then working on new companies: Maria Fernanda Ladrón de Guevara, Tarsila Criado and Carmen Echevarria and others. After the Spanish civil war film offers come the first time in continuing the theater company Membrives Lola.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmRiMGFjMmQtYWI0Yi00ODFmLWI3YTctYjlkZGI2YTEzNmVmXkEyXkFqcGdeQXVyNTUyMTMyMDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0087339","name":"Tomás Blanco","idIMDB":"nm0087339"},"actorId":"nm0087339","character":"Tucumcari sheriff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lorenzo Robledo","urlProfile":"http://www.imdb.com/name/nm0696468","urlPhoto":"","biography":{"dateOfBirth":"1921","placeOfBirth":"","bio":"Lorenzo Robledo was born in 1921. He was an actor, known for The Good, the Bad and the Ugly (1966), For a Few Dollars More (1965) and The Mercenary (1968). He died in September 2006 in Madrid, Madrid, Spain.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0696468","name":"Lorenzo Robledo","idIMDB":"nm0696468"},"actorId":"nm0696468","character":"Tomaso, Indio's Traitor","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0059578","urlIMDB":"http://www.imdb.com/title/tt0059578","business":{"budget":{"money":"$600,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"€25,204","country":"Italy","day":"06","month":"07","year":"2014","remarks":""},{"money":"ESP","country":"274,756,312","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 12 min (132 min)"],"soundMix":["Mono"],"color":["Color (Technicolor)"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["Fotofilm S.A., Madrid, Spain (processing)","Technicolor S.p.a., Roma, Italy (prints)"],"filmLength":["3,420 m (cut version) (1966) (Finland)","3,625 m (Sweden, cut version)","3,635 m (1984) (Finland)","3,200 m (1965) (Italy)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Techniscope"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"8.3","filmingLocations":[{"location":"Desierto de Tabernas, Almería, Andalucía, Spain"}],"rated":"R","awards":[],"votes":"169,159","type":"Movie","companyCreditsSimple":[{"idCompany":"co0013844","name":"Produzioni Europee Associati (PEA)"},{"idCompany":"co0046114","name":"Arturo González Producciones Cinematográficas"},{"idCompany":"co0074863","name":"Constantin Film Produktion"}],"keywords":{"keywords":["bounty hunter","yuma prison","death","pot smoking","rural setting","mustache","killing a horse","friends who live together","right hand man","sidekick","beard","piano","sombrero","redhead","cleavage","gang that lives together","street shootout","bar shootout","final showdown","five word title","19th century","confederate money","western town","prison escape","cult film","cowboys and outlaws","poncho","cowboy shirt","cowboy boots","cowboy hat","disarming someone","ambush","mexican standoff","winchester rifle","repeating rifle","suspense","bar fight","bar brawl","karate","martial arts","fistfight","brawl","two man army","stylized violence","showdown","six shooter","violence","opening action scene","tough guy","blood","blood splatter","western hero","action hero","hero","dynamite","breasts","rivalry","alliance","competitor","little boy","outlaw gang","church","chess","frontier town","fast draw","duel","beating","shootout","playing cards","pianist","gunslinger","wanted poster","remote","cowboy","sheriff","bible","marijuana","horse and cart","tavern","floor safe","explosion","bound and gagged","covered wagon","rotoscoping","second part","second in trilogy","money in title","flashback","actual animal killed","sadism","famous score","deep focus","shooting a woman","dead woman on bed","female nudity","insanity","haunted by the past","emergency stop","apple tree","sequel to remake","black suit clad killer","negative asian stereotype","warrior","honor","friendship","blockbuster","man with no name","watch","sequel to cult favorite","revolver","pistol","part of trilogy","handgun","gun","colonel","anti hero","civil war veteran","train","railway station","poker","shot in the forehead","sequel","1870s","bank robbery","el paso texas","gunfight","revenge","small town","infiltration","marksmanship contest","texas","jail break","bank","rape","betrayal","suicide","spaghetti western","murder","hat","jail","saloon","marksman","pocket watch","bandit","safecracker","hotel","hunchback","gun fu","new mexico","surprise ending","nudity"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:22:44"}}