{"data":{"movies":[{"title":"The Black Swan","originalTitle":"","year":"1942","releaseDate":"19421204","directors":[{"name":"Henry King","id":"nm0454771"}],"writers":[{"name":"Ben Hecht","id":"nm0372942"},{"name":"Seton I. Miller","id":"nm0589316"}],"runtime":"87 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1ODM0NTM2NF5BMl5BanBnXkFtZTgwMTI0MjczMjE@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Action","Adventure","Drama","Family","History"],"plot":"When notorious pirate Henry Morgan is made governor of Jamaica, he enlists the help of some of his former partners in ridding the Carribean of Buccaneers. When one of them apparently abducts the previous governor's pretty daughter and joins up with the rebels, things are set for a fight.","simplePlot":"An ex-pirate contends with rowdy buccaneers and a love-hate relationship with an aristocratic woman who's tougher than she seems.","actors":[{"actorName":"Tyrone Power","urlProfile":"http://www.imdb.com/name/nm0000061","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNTEzOTA2OF5BMl5BanBnXkFtZTYwNDk5MDM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1914","placeOfBirth":" Cincinnati, Ohio, USA","birthName":"Tyrone Edmund Power Jr.","height":"5' 11\" (1.8 m)","bio":"Tyrone Power was one of the great romantic swashbuckling stars of the mid-twentieth century, and the third Tyrone Power of four in a famed acting dynasty reaching back to the eighteenth century. His great-grandfather was the first Tyrone Power (1795-1841), a famed Irish comedian. His father, known to historians as Tyrone Power Sr., but to his contemporaries as either Tyrone Power or Tyrone Power the Younger, was a huge star in the theater (and later in films) in both classical and modern roles. His mother, Helen Emma \"Patia\" (née Reaume), (Mrs. Tyrone Power), was also a Shakespearean actress as well as a respected dramatic coach. Tyrone Edmund Power, Jr., (also called Tyrone Power III) was born at his mother's home of Cincinnati, Ohio, in 1914. His ancestry included English, Irish, German, French Huguenot, and French-Canadian. A frail, sickly child, he was taken by his parents to the warmer climate of southern California. After his parents' divorce, he and his sister Anne Power returned to Cincinnati with their mother. There he attended school while developing an obsession with acting. Although raised by his mother, he corresponded with his father, who encouraged his acting dreams. He was a supernumerary in his father's stage production of 'The Merchant of Venice' in Chicago and held him as he died suddenly of a heart attack later that year. Startlingly handsome, young Tyrone nevertheless struggled to find work in Hollywood. He appeared in a few small roles, then went east to do stage work. A screen test led to a contract at 20th Century Fox in 1936, and he quickly progressed to leading roles. Within a year or so, he was one of Fox's leading stars, playing in contemporary and period pieces with ease. Most of his roles were colorful without being deep, and his swordplay was more praised than his wordplay. He served in the Marine Corps in World War II as a transport pilot, and he saw action in the Pacific Theater of operations. After the war, he got his best reviews for an atypical part as a downward-spiraling con-man in Nightmare Alley (1947). Although he remained a huge star, much of his postwar work was unremarkable. He continued to do notable stage work and also began producing films. Following a fine performance in Billy Wilder's Witness for the Prosecution (1957), Power began production on Solomon and Sheba (1959). Halfway through shooting, he collapsed during a dueling scene with George Sanders, and he died of a heart attack before reaching a hospital. His three children, including his namesake, Tyrone William Power IV (known professionally as Tyrone Power Jr.), have all followed him in the family acting tradition.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNTEzOTA2OF5BMl5BanBnXkFtZTYwNDk5MDM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000061","name":"Tyrone Power","nicknames":["Ty"],"idIMDB":"nm0000061"},"actorId":"nm0000061","character":"Jamie Waring","urlCharacter":"http://www.imdb.com/character/ch0052764","main":true},{"actorName":"Maureen O'Hara","urlProfile":"http://www.imdb.com/name/nm0000058","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2OTA0ODA4MV5BMl5BanBnXkFtZTYwNjIwNzQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 August 1920","placeOfBirth":" Ranelagh, County Dublin, Ireland, UK [now Ranelagh, Dublin, Republic of Ireland]","birthName":"Maureen FitzSimons","height":"5' 7½\" (1.71 m)","bio":"In America, the early performing arts accomplishments of young Maureen FitzSimons (who we know as Maureen O'Hara) would definitely have put her in the child prodigy category. However, for a child of Irish heritage surrounded by gifted parents and family, these were very natural traits. Maureen made her entrance into this caring haven on August 17, 1920, in Ranelagh (a suburb of Dublin), Ireland. Her mother, Marguerita Lilburn FitzSimons, was an accomplished contralto. Her father, Charles FitzSimons, managed a business in Dublin and also owned part of the renowned Irish soccer team \"The Shamrock Rovers\". Maureen was the second of six FitzSimons children - Peggy, Florrie, Charles B. Fitzsimons, Margot Fitzsimons and James O'Hara completed this beautiful family. Maureen loved playing rough athletic games as a child and excelled in sports. She combined this interest with an equally natural gift for performing. This was demonstrated by her winning pretty much every Feis award for drama and theatrical performing her country offered. By age 14 she was accepted to the prestigious Abbey Theater and pursued her dream of classical theater and operatic singing. This course was to be altered, however, when Charles Laughton, after seeing a screen test of Maureen, became mesmerized by her hauntingly beautiful eyes. Before casting her to star in Jamaica Inn (1939), Laughton and his partner, Erich Pommer, changed her name from Maureen FitzSimons to \"Maureen O'Hara\" - a bit shorter last name for the marquee. Under contract to Laughton, Maureen's next picture was to be filmed in America (The Hunchback of Notre Dame (1939)) at RKO Pictures. The epic film was an extraordinary success and Maureen's contract was eventually bought from Laughton by RKO. At 19, Maureen had already starred in two major motion pictures with Laughton. Unlike most stars of her era, she started at the top, and remained there - with her skills and talents only getting better and better with the passing years. Maureen has an enviable string of all-time classics to her credit that include the aforementioned \"The Hunchback of Notre Dame\", How Green Was My Valley (1941), Miracle on 34th Street (1947), Sitting Pretty (1948), The Quiet Man (1952), The Parent Trap (1961) and McLintock! (1963). Add to this the distinction of being voted one of the five most beautiful women in the world and you have a film star who was as gorgeous as she was talented. Although at times early in her career Hollywood didn't seem to notice, there was much more to Maureen O'Hara than her dynamic beauty. She not only had a wonderful lyric soprano voice, but she could use her inherent athletic ability to perform physical feats that most actresses couldn't begin to attempt, from fencing to fisticuffs. She was a natural athlete. In her career Maureen starred with some of Hollywood's most dashing leading men, including Tyrone Power, John Payne, Rex Harrison, James Stewart, Henry Fonda, Brian Keith, Sir Alec Guinness and, of course, her famed pairings with \"The Duke\" himself, John Wayne. She starred in five films with Wayne, the most beloved being The Quiet Man (1952). In addition to famed director John Ford, Maureen was also fortunate to have worked for some other great directors in the business: Alfred Hitchcock, William Dieterle, Henry Hathaway, Henry King, Jean Renoir, John M. Stahl, William A. Wellman, Frank Borzage, Walter Lang, George Seaton, George Sherman, Carol Reed, Delmer Daves, David Swift, Andrew V. McLaglen and Chris Columbus. In 1968 Maureen found much deserved personal happiness when she married Charles Blair. Gen. Blair was a famous aviator whom she had known as a friend of her family for many years. A new career began for Maureen, that of a full-time wife. Her marriage to Blair, however, was again far from typical. Blair was the real-life version of what John Wayne had been on the screen. He had been a Brigadier General in the Air Force, a Senior Pilot with Pan American, and held many incredible record-breaking aeronautic achievements. Maureen happily retired from films in 1973 after making the TV movie The Red Pony (1973) (which won the prestigious Peabody Award for Excellence) with Henry Fonda. With Blair, Maureen managed Antilles Airboats, a commuter sea plane service in the Caribbean. She not only made trips around the world with her pilot husband, but owned and published a magazine, \"The Virgin Islander\", writing a monthly column called \"Maureen O'Hara Says\". Tragically, Charles Blair died in a plane crash in 1978. Though completely devastated, Maureen pulled herself together and, with memories of ten of the happiest years of her life, continued on. She was elected President and CEO of Antilles Airboats, which brought her the distinction of being the first woman president of a scheduled airline in the United States. Maureen now lives quite happily in retirement in a home near her grandson and his family in Boise, Idaho. Fortunately, she was coaxed out of retirement several times - once in 1991 to star with John Candy in Only the Lonely (1991) and again, in 1995, in a made-for-TV movie, The Christmas Box (1995) on CBS. In the spring of 1998, Maureen accepted the second of what would be three projects for Polson Productions and CBS: Cab to Canada (1998) - and, in October, 2000, The Last Dance (2000). On November 4, 2014 Maureen was honored by a long overdue Oscar for \"Lifetime Achievement\" at the annual Motion Picture Arts and Sciences Governors Awards. Maureen O'Hara is still absolutely stunning, with that trademark red hair, dazzling smile and those huge, expressive eyes. She has fans from all over the world of all ages who are utterly devoted to her legacy of films and her persona as a strong, courageous and intelligent woman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2OTA0ODA4MV5BMl5BanBnXkFtZTYwNjIwNzQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000058","name":"Maureen O'Hara","nicknames":["Big Red","The Pirate Queen","The Queen of Technicolor"],"idIMDB":"nm0000058"},"actorId":"nm0000058","character":"Lady Margaret Denby","urlCharacter":"http://www.imdb.com/character/ch0052765","main":true},{"actorName":"Laird Cregar","urlProfile":"http://www.imdb.com/name/nm0187284","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MTgwNzczNV5BMl5BanBnXkFtZTgwODczNDQzNzE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 July 1914","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Samuel Laird Cregar","height":"6' 3\" (1.91 m)","bio":"Seemingly suave, cultivated actor by nature, definitely huge in both talent and girth, and capable of playing much older than he was, Hollywood of the early '40s tragically lost Laird Cregar before it could fully comprehend on how to best utilize his obvious gifts. He was born Samuel Laird Cregar in a well-to-do section of Philadelphia, eventually dropping his first name after forging an acting career. At age eight his parents sent him to England and enrolled him at the Winchester Academy. During his school's off time, his pique in acting escalated after being employed as a page boy with the Stratford-on-Avon Players. Thereafter, his mind was set to become a professional actor. Returning to the U.S., he attended Episcopal Academy in Philadelphia and the Douglas Adams School in Longport, New Jersey. Again, he found meager jobs, such as an usher, in order to stay close to the theater. Awarded a scholarship to the Pasadena Community Playhouse, he trained there for two years before going out on his own and finding minor work on the bi-coastal stage and finding minuscule parts in films. Laird's break came of his own making. After witnessing Robert Morley's triumph in the title role of \"Oscar Wilde\" on Broadway, Laird set upon finding backing for his own version of the play. Debuting in Los Angeles and finding resounding success there as well as in San Francisco, film studios began competing for his services with Twentieth Century-Fox winning out. He made his feature debut opposite Paul Muni in Hudson's Bay (1941) in the boisterous role of a fur trapper and solidified his movie standing by appearing flamboyantly as a bullfighting critic at odds with Tyrone Power's matador in the popular Technicolor classic Blood and Sand (1941). He then went on to show a scene-stealing prowess for stylish farce as one of Jack Benny \"suitors\" in the drag comedy Charley's Aunt (1941). By the time Laird cut a mean, sinister path in I Wake Up Screaming (1941), playing a detective so insanely hung up on a murdered girl (Carole Landis) that he deliberately frames an innocent man (Victor Mature) for her crime, it was obvious films could rely on him for any of their comedic or dramatic ventures. There seemed nothing he couldn't do, but it was obvious audiences loved him as the 300 lb. man you love to hate - goaded on by his nefarious doings in the film noir classic This Gun for Hire (1942) starring Alan Ladd and Rings on Her Fingers (1942) with Gene Tierney. On the Los Angeles theater front he gave Monty Woolley a run for the money in Woolley's signature stage role of Sheridan Whiteside in \"The Man Who Came to Dinner\". Along with the good came some contrived roles in a few mediocre films ranging from training officers to hammy-styled pirates. Even so, he usually stood out among the other actors in some fashion. He even played the Devil himself in the exquisitely humor-laced Ernst Lubitsch comedy Heaven Can Wait (1943). His film career was capped by his definitive Jack the Ripper in The Lodger (1944). Investing the psychotic role with an intense, gripping realism and off-putting, oily charm, he led a brilliantly seasoned cast and relished a death scene in the film (in truth, the real-life serial killer was never caught) that dared to forever stereotype him as a Sydney Greenstreet-like villain. Unfortunately, his early death robbed film audiences of seeing what course Laird's career would have taken. Sure enough, his last celluloid offering in Hangover Square (1945) was as another despicable character with murder on its maniacal mind. Top-lining a cast that included Linda Darnell (as an object of his affection), and George Sanders, he this time portrayed a temperamental composer who suffers from a split personality disorder and, prone to periodic blackouts, commits brutal murders. Another compelling death scene had his mad character wildly pounding out a concerto while the room around him goes up in flames and the ceiling crashes down on him. Laird's obsession with avoiding the inevitable stereotype as a \"heavy heavy\" and wistful pursuit of a romantic leading man career compelled him to go on a reckless, unsupervised crash diet (from 300 lbs to 200 lbs), which is evident by his drastically trimmed-down look in his last film. This proved too strenuous on his system and he was forced to undergo surgery for a severe stomach disorder. His 28-year-old heart gave out on the morning of December 9, 1944, only days after his operation. He was survived by his mother.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MTgwNzczNV5BMl5BanBnXkFtZTgwODczNDQzNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0187284","name":"Laird Cregar","nicknames":["Sam"],"idIMDB":"nm0187284"},"actorId":"nm0187284","character":"Capt. Henry Morgan","urlCharacter":"http://www.imdb.com/character/ch0043886","main":true},{"actorName":"Thomas Mitchell","urlProfile":"http://www.imdb.com/name/nm0593775","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTcwNjAwMDI2M15BMl5BanBnXkFtZTcwNDMyNTUwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1892","placeOfBirth":" Elizabeth, New Jersey, USA","birthName":"Thomas John Mitchell","height":"5' 10\" (1.78 m)","bio":"Thomas Mitchell was one of the great American character actors, whose credits read like a list of the greatest films of the 20th century: Lost Horizon (1937); Stagecoach (1939); The Hunchback of Notre Dame (1939); Mr. Smith Goes to Washington (1939); Gone with the Wind (1939); It's a Wonderful Life (1946) and High Noon (1952). His portrayals are so diverse and convincing that most people don't even realize that one actor could have played them all. He won a Best Supporting Actor Oscar in 1940 for his role as the drunken Doc Boone in John Ford's Stagecoach (1939).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTcwNjAwMDI2M15BMl5BanBnXkFtZTcwNDMyNTUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0593775","name":"Thomas Mitchell","nicknames":["Tommy"],"idIMDB":"nm0593775"},"actorId":"nm0593775","character":"Tommy Blue","urlCharacter":"http://www.imdb.com/character/ch0412420","main":true},{"actorName":"George Sanders","urlProfile":"http://www.imdb.com/name/nm0001695","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyODU3MDQ4NV5BMl5BanBnXkFtZTcwOTgwOTkxOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 July 1906","placeOfBirth":" St. Petersburg, Russian Empire [now Russia]","birthName":"George Henry Sanders","height":"6' 3½\" (1.92 m)","bio":"George Sanders was born of English parents in St. Petersburg, Russia. He worked in a Birmingham textile mill, in the tobacco business and as a writer in advertising. He entered show business in London as a chorus boy, going from there to cabaret, radio and theatrical understudy. His film debut, in 1936, was as Curly Randall in Find the Lady (1936). His U.S. debut, the same year, with Twentieth Century-Fox, was as Lord Everett Stacy in Lloyd's of London (1936). During the late 1930s and early 1940s he made a number of movies as Simon Templar--the Saint--and as Gay Lawrence, the Falcon. He played Nazis (Maj. Quive-Smith in Fritz Lang's Man Hunt (1941)), royalty (Charles II in Otto Preminger's Forever Amber (1947)), and biblical roles (Saran of Gaza in Cecil B. DeMille's Samson and Delilah (1949)). He won the 1950 Academy Award for Best Supporting Actor as theatre critic Addison De Witt in Joseph L. Mankiewicz's All About Eve (1950). In 1957 he hosted a TV series, The George Sanders Mystery Theater (1957). He continued to play mostly villains and charming heels until his suicide in 1972.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyODU3MDQ4NV5BMl5BanBnXkFtZTcwOTgwOTkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001695","name":"George Sanders","idIMDB":"nm0001695"},"actorId":"nm0001695","character":"Capt. Billy Leech","urlCharacter":"http://www.imdb.com/character/ch0001280","main":true},{"actorName":"Anthony Quinn","urlProfile":"http://www.imdb.com/name/nm0000063","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MTAxMzIxMV5BMl5BanBnXkFtZTYwODc3OTE2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 April 1915","placeOfBirth":" Chihuahua, Mexico","birthName":"Antonio Rodolfo Quinn Oaxaca","height":"6' 2\" (1.88 m)","bio":"Anthony Quinn was born Antonio Rudolfo Oaxaca Quinn on April 21, 1915, in Chihuahua, Mexico, to Manuela (Oaxaca) and Francisco Quinn, who became an assistant cameraman at a Los Angeles (CA) film studio. His paternal grandfather was Irish, and the rest of his family was Mexican. After starting life in extremely modest circumstances in Mexico, his family moved to Los Angeles, where he grew up in the Boyle Heights and Echo Park neighborhoods. He attended Polytechnic High School and later Belmont High, but eventually dropped out. The young Quinn boxed (which stood him in good stead as a stage actor, when he played Stanley Kowalski in \"A Streetcar Named Desire\" to rave reviews in Chicago), then later studied architecture under Frank Lloyd Wright at the great architect's studio, Taliesin, in Arizona. Quinn was close to Wright, who encouraged him when he decided to give acting a try. After a brief apprenticeship on stage, Quinn hit Hollywood in 1936 and picked up a variety of small roles in several films at Paramount, including an Indian warrior in The Plainsman (1936), which was directed by the man who later became his father-in-law, Cecil B. DeMille. As a contract player at Paramount, Quinn mainly played villains and ethnic types, such as an Arab chieftain in the Bing Crosby-Bob Hope vehicle Road to Morocco (1942). As a Mexican national (he did not become an American citizen until 1947), he was exempt from the draft. With many actors in the service fighting World War II, Quinn was able to move up into better supporting roles. He had married DeMille's daughter Katherine DeMille, which afforded him entrance to the top circles of Hollywood society. He became disenchanted with his career and did not renew his Paramount contract despite the advice of others, including his father-in-law (whom Quinn felt never accepted him due to his Mexican roots). Instead, he returned to the stage to hone his craft. His portrayal of Stanley Kowalski in \"A Streetcar Named Desire\" in Chicago and on Broadway (where he replaced the legendary Marlon Brando, who is forever associated with the role) made his reputation and boosted his film career when he returned to the movies. Brando and Elia Kazan, who directed \"Streetcar\" on Broadway and on film (A Streetcar Named Desire (1951)), were crucial to Quinn's future success. Kazan, knowing the two were potential rivals due to their acclaimed portrayals of Kowalski, cast Quinn as Brando's brother in his biographical film of Mexican revolutionary Emiliano Zapata, Viva Zapata! (1952). Quinn won the Best Supporting Actor Academy Award for 1952, making him the first Mexican-American to win an Oscar. It was not to be his lone appearance in the winner's circle: he won his second Supporting Actor Oscar in 1957 for his portrayal of Paul Gauguin in Vincente Minnelli's biographical film of Vincent van Gogh, Lust for Life (1956), opposite Kirk Douglas. Over the next decade Quinn lived in Italy and became a major figure in world cinema, as many studios shot films in Italy to take advantage of the lower costs (\"runaway production\" had battered the industry since its beginnings in the New York / New Jersey area in the 1910s). He appeared in several Italian films, giving one of his greatest performances as the circus strongman who brutalizes the sweet soul played by Giulietta Masina in her husband Federico Fellini's masterpiece La Strada (1954). Alternating between Europe and Hollywood, Quinn built his reputation and entered the front rank of character actors and character leads. He received his third Oscar nomination (and first for Best Actor) for George Cukor's Wild Is the Wind (1957). He played a Greek resistance fighter against the Nazi occupation in the monster hit The Guns of Navarone (1961) and received kudos for his portrayal of a once-great boxer on his way down in Rod Serling's Requiem for a Heavyweight (1962). He went back to playing ethnic roles, such as an Arab warlord in David Lean's masterpiece Lawrence of Arabia (1962), and he played the eponymous lead in the \"sword-and-sandal\" blockbuster Barabbas (1961). Two years later, he reached the zenith of his career, playing Zorba the Greek in the film of the same name (a.k.a. Zorba the Greek (1964)), which brought him his fourth, and last, Oscar nomination as Best Actor. The 1960s were kind to him: he played character leads in such major films as The Shoes of the Fisherman (1968) and The Secret of Santa Vittoria (1969). However, his appearance in the title role in the film adaptation of John Fowles' novel, The Magus (1968), did nothing to save the film, which was one of that decade's notorious turkeys. In the 1960s, Quinn told Life magazine that he would fight against typecasting. Unfortunately, the following decade saw him slip back into playing ethnic types again, in such critical bombs as The Greek Tycoon (1978). He starred as the Hispanic mayor of a southwestern city on the short-lived television series The Man and the City (1971), but his career lost its momentum during the 1970s. Aside from playing a thinly disguised Aristotle Onassis in the cinematic roman-a-clef The Greek Tycoon (1978), his other major roles of the decade were as Hamza in the controversial The Message (1976) (a.k.a. \"Mohammad, Messenger of God\"), as the Italian patriarch in The Inheritance (1976), yet another Arab in Caravans (1978) and a Mexican patriarch in The Children of Sanchez (1978). In 1983, he reprised his most famous role, Zorba the Greek, on Broadway in the revival of the musical \"Zorba\", for 362 performances. Though his film career slowed during the 1990s, he continued to work steadily in films and television. Quinn lived out the latter years of his life in Bristol, Rhode Island, where he spent most of his time painting and sculpting. He died in a hospital in Boston from pneumonia and respiratory failure linked to his battle with lung cancer. He was 86 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MTAxMzIxMV5BMl5BanBnXkFtZTYwODc3OTE2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000063","name":"Anthony Quinn","nicknames":["Tony"],"idIMDB":"nm0000063"},"actorId":"nm0000063","character":"Wogan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Zucco","urlProfile":"http://www.imdb.com/name/nm0958345","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWViMGQxMGEtMTBiNi00MWJlLTkyZGYtMzEzOWEwN2VmMGI0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 January 1886","placeOfBirth":" Manchester, England, UK","height":"5' 10\" (1.78 m)","bio":"At 22, George Zucco decided to begin his stage career in earnest in the Canadian provinces in 1908. In the course of the following decade, he also performed in an American vaudeville tour with his young wife, Frances, in a routine called \"The Suffragette.\" As World War I grew in scale, Zucco returned to England to join the army. He saw action and was wounded in his right arm by gunfire. Subsequent surgery partially handicapped the use of two fingers and a thumb. However, having honed his theatrical talents, he proceeded to enter the London stage scene and was rewarded with a developing career that made him a leading man as the 1920s progressed. By 1931 he began working in British sound films, his first being The Dreyfus Case (1931) with Cedric Hardwicke. What followed were 13 B-grade movies through 1935, until The Man Who Could Work Miracles (1936) with Roland Young and Ralph Richardson. Zucco was on his way to America and Broadway by late 1935. He had signed to play Disraeli opposite Helen Hayes in the original play \"Victoria Regina,\" which ran from December 1935 to June 1936. After that came a Hollywood contract and his first American picture, Sinner Take All (1936). Zucco had a sharp hawk nose, magnetic dark eyes, and an arching brow that fit well with authoritative and intimidating characters. That same year, he was in the second installment of the \"Thin Man\" series, followed by a series of supporting roles in nine films in 1937, usually typed as an English doctor or lord character. They were good supporting roles in \"A\" films, but he was also taking on darker characters. This was evident in Charlie Chan in Honolulu (1938) and more so with Arrest Bulldog Drummond (1938). Here, he was Rolf Alferson, alias the criminal mastermind \"The Stinger,\" who could administer a poisonous sting from a needle at the tip of his cane. It was a typical pop movie in the pulp mystery/horror genre with the usual sort of ending, but it started him on the road as a Hollywood arch villain. That same year, he was cast as Professor Moriarty, the brilliant archenemy of the world's most famous detective in The Adventures of Sherlock Holmes (1939). Also that year, he and Hardwicke reunited to play the dark clerical heavies in the classic The Hunchback of Notre Dame (1939). Although into the early 1940s Zucco was still getting some variety in shady roles, he was increasingly accepting parts as mad doctors--ancient and otherwise--starting with The Mummy's Hand (1940), the sequel to the original The Mummy (1932). Although this was made by the relatively major Universal Pictures, Zucco began grinding out outlandish horror stuff for bottom-of-the-barrel Producers Releasing Corp. (PRC). It would be incorrect to say he sold out to the horror genre, though, even if horror buffs have made him their own. Into the later 1940s, he was still giving good accounts as nobles, judges and not-so-mad doctors in such \"A\" hits as Captain from Castile (1947), Joan of Arc (1948), and Madame Bovary (1949). Zucco was in real life an engaging personality and was also known as a very dependable actor. He suffered a stroke not long after his final film, David and Bathsheba (1951), once more in Egyptian garb but this time not even credited. He retired and lived on in fragile health. He evidently recovered his health enough to be offered the role of the mad scientist in Voodoo Woman (1957), but he declined. About that time, his health required a move to a nursing home, where he lived out his last years with dignity.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWViMGQxMGEtMTBiNi00MWJlLTkyZGYtMzEzOWEwN2VmMGI0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0958345","name":"George Zucco","idIMDB":"nm0958345"},"actorId":"nm0958345","character":"Lord Denby","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0034522","urlIMDB":"http://www.imdb.com/title/tt0034522","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":"01","month":"07","year":"1942","remarks":null},"filmingDates":null,"copyrightHolder":"Twentieth Century-Fox Film Corporation; 4 December 1942; LP11987"},"technical":{"runtime":["1 hr 27 min (87 min) (copyright time)","1 hr 25 min (85 min) (current existing footage) (USA)","1 hr 25 min (85 min) (censored) (re-release) (Portugal)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Black and White (reissue)","Color (Technicolor)"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":["Technicolor (photographed in)"],"filmLength":["2,395.42 m (9 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.9","filmingLocations":[{"location":"Cuba"}],"rated":"APPROVED","awards":[{"award":"Academy Awards, USA 1943","titlesAwards":[{"titleAwardOutcome":"Won Oscar","categories":[{"category":"Best Cinematography, Color","names":[{"name":"Leon Shamroy","id":"nm0005872","role":null}]}]},{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Effects, Special Effects","names":[{"name":"Fred Sersen","id":"nm0785731","role":"photographic"},{"name":"Roger Heman Sr.","id":"nm0002703","role":"sound"},{"name":"George Leverett","id":"nm0505336","role":"sound"}]},{"category":"Best Music, Scoring of a Dramatic or Comedy Picture","names":[{"name":"Alfred Newman","id":"nm0000055","role":null}]}]}]}],"votes":"3,115","type":"Movie","companyCreditsSimple":[{"idCompany":"co0000756","name":"Twentieth Century Fox Film Corporation"}],"keywords":{"keywords":["maracaibo venezuela","governor","pirate","jamaica","english","bare chested male bondage","hit on the head with a rock","pirate flag","escaping from bonds","gagged","female tied up","male tied up","redhead","rapier","sword","bare chested male","bird in title","tavern","shipwreck","punching","horse riding","fainting","eye patch","black slave","privateer","bound and gagged","color in title","animal in title","tortuga","sword wound","spaniard","ship","sea battle","rehabilitation","pardon","loyalty","impeachment","gunfire","father daughter relationship","escape","engagement","duplicity","drunkenness","courtship","class distinction","cannon","riding accident","british colonial","1600s","kidnapping","sword fight","sea captain","locket","fake marriage","treason","pillaging","torture","rack torture","hammock","carrack","swashbuckler","caribbean","unwanted kiss","harbor","based on book","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 01:38:49"}}