{"data":{"movies":[{"title":"The Great Sioux Uprising","originalTitle":"","year":"1953","releaseDate":"19530717","directors":[{"name":"Lloyd Bacon","id":"nm0045800"}],"writers":[{"name":"Melvin Levy","id":"nm0506544"},{"name":"J. Robert Bren","id":"nm0107130"}],"runtime":"80 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTJlODA0NWQtNGE0OS00NDJkLWE5NTktZjk4NjJmMjg2Yjg4L2ltYWdlXkEyXkFqcGdeQXVyNzA4ODc3ODU@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Western"],"plot":"Joan Britton, improbably gorgeous frontier horse dealer, and the much less scrupulous Stephen Cook are friendly competitors supplying horses to the Union Army in Wyoming Territory during the Civil War. Southern general Stand Watie, a Cherokee, is rumored to be in the area to stir up the Sioux against the Union, when Cook picks this worst possible moment to steal a herd of Sioux horses. Enter ex-army doctor Jonathan Westgate, who becomes Cook's rival for the love of Joan, opposes his crooked activities...and who alone can prevent a new Indian war.","simplePlot":"During the Civil War, Southern agitators and a crooked horse dealer endanger the peace between the Union and the Wyoming Sioux.","actors":[{"actorName":"Jeff Chandler","urlProfile":"http://www.imdb.com/name/nm0001996","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTAxMDQ3NDk0OV5BMl5BanBnXkFtZTYwNTA4MjM2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 December 1918","placeOfBirth":" Brooklyn, New York, USA","birthName":"Ira Grossel","height":"6' 4\" (1.93 m)","bio":"Jeff was born in Brooklyn and attended Erasmus High School. After high school, he took a drama course and worked in stock companies for two years. His next role would be that of an officer in World War II. After he was discharged from the service, he became busy acting in radio drama's and comedies until he was signed by Universal. It would be in the fifties that Jeff would become a star making westerns and action pictures. He would be nominated for an Academy Award for his role as Cochise in Broken Arrow (1950). He would follow this by playing the role of Cochise in two sequels: The Battle at Apache Pass (1952) and Taza, Son of Cochise (1954). While his premature gray hair and tanned features served him well in his westerns and action pictures, the studio would put him into soaps and costume movies. In his films, his leading ladies would include Maureen O'Hara, Rhonda Fleming, Jane Russell, Joan Crawford, and June Allyson. Shortly after his last film Merrill's Marauders (1962), Jeff died, at 42, from blood poisoning after an operation for a slipped disc.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTAxMDQ3NDk0OV5BMl5BanBnXkFtZTYwNTA4MjM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001996","name":"Jeff Chandler","nicknames":["Big Gray"],"idIMDB":"nm0001996"},"actorId":"nm0001996","character":"Jonathan Westgate","urlCharacter":"http://www.imdb.com/character/ch0178778","main":true},{"actorName":"Faith Domergue","urlProfile":"http://www.imdb.com/name/nm0231409","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMTgxNDAzN15BMl5BanBnXkFtZTgwMjUwNDkyMjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1924","placeOfBirth":" New Orleans, Louisiana, USA","birthName":"Faith Marie Domergue","height":"5' 5\" (1.65 m)","bio":"Sultry, brunette Faith Domergue was born in New Orleans, part Creole, but primarily of Irish and English extraction. She was adopted when she was six weeks old. In 1927 her adoptive parents took her to live in California, where she was educated at Catholic schools in Santa Monica. She had her first flirt with the acting profession while still at school, on stage at the Bliss Hayden Theatre. Just after her graduation she suffered a disfiguring injury during a car accident when she was thrown into a windshield, and spent 18 months undergoing intensive plastic surgery. Still in her teens, she was briefly married to Acapulco night club owner and bandleader Teddy Stauffer. By 1941 she was properly back in circulation. \"Discovered\" by a Warner Brothers talent scout, she was signed to a contract and her name streamlined a la Hollywood to \"Faith Dorn\". Sometime at the end of May that year young Faith found herself at a studio party (it was not unheard of for underage ingénues to be thrown together with rich or influential men) given on board the Southern Cross, a yacht owned by billionaire Howard Hughes. Hughes, 21 years her senior, became quickly infatuated with the teenager and bought out her contract from Warner Brothers for $50,000, then signed her to the studio he owned, RKO Pictures. He also mollified her adoptive parents by buying them a house, and he paid for Faith to take lessons to perfect her diction and acting. The romantic affair continued on-and-off until mid-1943, and was eventually scuttled by Hughes' various indiscretions with stars Lana Turner, Ava Gardner and Rita Hayworth. In 1945 Faith reclaimed her original name, Domergue (insisting it be pronounced \"Dah-mure\") and, by the following year, made her screen debut in Young Widow (1946), a film starring another Hughes find, Jane Russell. Hughes then spent the extravagant--for the time--amount of $3.2 million on Vendetta (1950), the picture that was to catapult Faith to stardom. Three directors went to work on the project, only to be fired in quick succession: Max Ophüls, Preston Sturges and Stuart Heisler. Faith's lack of theatrical training also proved to be a detriment. The picture was eventually completed by Mel Ferrer, but not released until 1950. When it finally arrived in cinemas, it--like Hughes other fiasco, the Spruce Goose--failed to take off. An earlier effort, the film noir Where Danger Lives (1950), was also released at this time. It starred Domergue in the role as a homicidal femme fatale, opposite Robert Mitchum as the lover she manipulates into taking the blame for her murdering millionaire hubby Claude Rains. In spite of another huge publicity campaign, with Faith featured on the cover of \"Look\" Magazine and articles in numerous other publications, this film also performed indifferently at the box office and caused Hughes to lose interest in his erstwhile protégé. During the next few years Faith began to freelance at other studios, appearing in westerns: The Duel at Silver Creek (1952), with Audie Murphy; The Great Sioux Uprising (1953), with Jeff Chandler; and Santa Fe Passage (1955) with John Payne at Republic. In 1955 she starred in the first of a trio of sci-fi/horror outings for which she is chiefly remembered. In This Island Earth (1955), shot in Technicolor at Universal, she played a scientist kidnapped by aliens and, with her colleagues, pressed into service defending their world against interplanetary attack. Helped by a clever script and make-up artist Bud Westmore's $24,000 creation of a bug-eyed mutant monster, the film was a huge success and has become a cult favorite. Faith essayed yet another scientist engaged in destroying Ray Harryhausen's giant octopus (six-tentacled, because of the minuscule budget) in It Came from Beneath the Sea (1955). In Cult of the Cobra (1955), Faith replaced Mari Blanchard in the role of the high-priestess of a cobra-worshiping cult who assumes the shape of a serpent in order to kill six GIs who have witnessed a secret ceremony. Following her separation from Argentine writer/director Hugo Fregonese, Faith made three films in England, most notably as queen of the London underworld in Vernon Sewell's Spin a Dark Web (1956) (aka \"Spin a Dark Web\"). During the 1960s she concentrated on television and appeared in everything from Bonanza (1959) to Combat! (1962), from Perry Mason (1957) to Bronco (1958). After making several films in Italy (and getting married for a third time, to assistant director and theatrical producer Paolo Cossa in 1966)) , she revisited the horror genre in the cheap but cheerful The House of Seven Corpses (1974), as the emotive star of a horror movie who awakens the deceased after reading from the \"Tibetan Book of the Dead\". Faith Domergue never quite made it as a major star, unlike Jane Russell. She did, however, acquire something of a cult following because of her involvement in the seminal This Island Earth (1955), as well as her other science-fiction films from this period. Ironically, Faith later confessed that she never much cared for the genre.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMTgxNDAzN15BMl5BanBnXkFtZTgwMjUwNDkyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0231409","name":"Faith Domergue","nicknames":["Faith Dawn"],"idIMDB":"nm0231409"},"actorId":"nm0231409","character":"Joan Britton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lyle Bettger","urlProfile":"http://www.imdb.com/name/nm0079328","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjA2Mjc3OV5BMl5BanBnXkFtZTcwNzk5MjYwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1915","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Lyle Stathem Bettger","height":"6' (1.83 m)","bio":"Handsome, blond-haired, steely-eyed villain in many film Westerns. He was never the grizzled outlaw, covered in trail dust. No, he was the immaculate-looking, \"respectable\" (but two-faced) dandy in silk damask vest, often puffing suavely on a cheroot, whose ashes he then might contemptuously flick in the hero's face. He could confront an antagonist wearing a wry smile, even while neatly inserting his dirk between the latter's ribs. One wonders why Bettger, with his Aryan looks and menacing sneer, never became typecast as the stereotypical Nazi SS officer or Gestapo interrogator. (Perhaps the man was just fortunate in that regard.)","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjA2Mjc3OV5BMl5BanBnXkFtZTcwNzk5MjYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0079328","name":"Lyle Bettger","idIMDB":"nm0079328"},"actorId":"nm0079328","character":"Stephen Cook","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Whitney","urlProfile":"http://www.imdb.com/name/nm0926338","urlPhoto":"","biography":{"dateOfBirth":"24 May 1916","placeOfBirth":" Long Branch, New Jersey, USA","birthName":"Peter King Engle","height":"6' 3½\" (1.92 m)","bio":"The name may have you scratchin' your head a bit while searchin' for your nearby trivia book, but oh...that intimidating face is so familiar. Peter Whitney's over-powering frame, swarthy looks, bushy brows and maniacal look in his eye made him one of the most fearsome character actors to lump around in 40s, 50s and 60s film and TV. Born May 24, 1916 in New Jersey, Peter was of German ancestry and educated at Exeter Academy. He eventually moved to the Los Angeles area and trained with the Pasadena Community Playhouse, gaining valuable experience in summer stock as well. He made a play for films in the early 40s, deciding also to use his wife Adrienne's middle name for his own stage moniker. His real name he felt sounded too German and might be detrimental to his WWII-era career. He and Adrienne went on to have three children. His mammoth features and pudding-like puss reminded one easily of a Charles Laughton without table manners. He started his supporting career off promisingly at Warner Bros. at the outbreak of America's involvement in WWII showing fine potential in such films as Underground (1941), his debut, Nine Lives Are Not Enough (1941) and Blues in the Night (1941) as assorted henchmen, cronies and just downright mean guys. Taking part in \"A\" quality casts such as in Action in the North Atlantic (1943) and Mr. Skeffington (1944), Peter played two of his most notorious roles at war's end, that of murderous hillbilly twins Mert and Bert Fleagle in the riotous Fred MacMurray comedy Murder, He Says (1945) and as Peter Lorre's seedy partner in the film noir Three Strangers (1946). Peter broke off from Warners in the post-war years but still yielded some fine entertainment with roles in such \"B\" fare as The Notorious Lone Wolf (1946), Blonde Alibi (1946), and an odd, romantic turn as Lt. Gates in the creepy Rondo Hatton crimer The Brute Man (1946). In the mid-50s, TV took over a larger portion of Peter's career. His imposing mug was featured in about every popular western and crime drama there was including \"Gunsmoke,\" \"Wagon Train,\" \"The Rifleman,\" \"Bonanza,\" \"Perry Mason\" and \"Peter Gunn.\" He finally cut loose a bit and spoofed his own grubby rube image with guest turns on such bucolic series as \"Petticoat Junction\" and \"The Beverly Hillbillies,\" the latter playing a greedy ne'er-do-well fellow rustic. His obesity may have triggered an early fatal heart attack at age 55 in 1972, which robbed Hollywood of a wonderfully unappetizing and scurrilous character actor. In addition to his wife and children, Peter was survived by four grandchildren","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0926338","name":"Peter Whitney","nicknames":["Pete"],"idIMDB":"nm0926338"},"actorId":"nm0926338","character":"Ahab Jones","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stacy Harris","urlProfile":"http://www.imdb.com/name/nm0365345","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMDg5MDcxNl5BMl5BanBnXkFtZTgwMDA5OTU2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1918","placeOfBirth":" Big Timber, Quebec, Canada","birthName":"Stanley Harris","bio":"Stacy Harris, the Cando-American television, movie and radio actor, is probably best known for the many roles he played opposite Jack Webb in Dragnet (1954) and on other Webb-produced shows. Harris and Webb were close friends and Jack named one of his daughters \"Stacey\" in his friend's honor. Harris was born on July 26, 1918 Big Timber, Quebec and established himself as a radio actor playing FBI agent Jim Taylor on ABC Radio's \"This is Your FBI,\" appearing on 409 episodes from 1945 to 1953. He made his movie debut in the Alan Ladd movie Appointment with Danger (1951), which also co-starred Jack Webb. He appeared five times in the four years of the original Dragnet (1951) series that ran from 1951 to 1954, plus played the main villain in the \"Dragnet\" feature film of 1954. He appeared another eight times in the second Dragnet 1967 (1967) series of 1967-70, most notably as the fake forest ranger Clifford Ray alias Barney Regal. He had a small recurring role in two TV series, The Life and Legend of Wyatt Earp (1955) and O'Hara, U.S. Treasury (1971), the latter of which was created by Webb. In all, he appeared in hundreds of TV and movie roles between 1951 and 1972. His last role was in the low-budget political thriller Noon Sunday (1970), which was released two years after his death. Stacy Harris died on March 13, 1973 Los Angeles, California. He was 54 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMDg5MDcxNl5BMl5BanBnXkFtZTgwMDA5OTU2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0365345","name":"Stacy Harris","idIMDB":"nm0365345"},"actorId":"nm0365345","character":"Uriah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Walter Sande","urlProfile":"http://www.imdb.com/name/nm0761340","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWRlODgyYTEtMWEyMC00ZjY5LTllZGItZjlhZDkxYzE1ZjUyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1906","placeOfBirth":" Denver, Colorado, USA","height":"5' 6½\" (1.69 m)","bio":"Chances are you've seen his imposing character face scores of times but couldn't place the name. Colorado-born actor Walter Sande was one of those stern, heavyset character actors in Hollywood everyone recognized but no one could identify. Born in Denver on July 9, 1906, Sande showed an early passion for music as a youth and by his college years managed to start his own band. This led to a job as musical director for 20th Century-Fox's theater chain, which in turn led to acting in films beginning in 1937. Usually providing atmospheric bits with no billing, he made an initial impression in serial cliffhangers as a third-string heavy with the popular The Green Hornet Strikes Again! (1940) and Sky Raiders (1941). His first top featured role, however, would come with The Iron Claw (1941) as Jack \"Flash\" Strong, a photographer who--uncharacteristically for Walter--served as a comic sidekick to the serial's hero. Best of all would be his role in another serial as Red Pennington, the amusing sidekick to Don Winslow of the Navy (1942). he repeated his role again in Don Winslow of the Coast Guard (1943), the successful sequel. The role of Pennington sparked a long and steady supporting career in movies, usually a step or two behind Hollywood's elite on camera, which included Humphrey Bogart and Lauren Bacall in To Have and Have Not (1944) (prominently featured as the fisherman who tries to cheat Bogie), Gary Cooper in Along Came Jones (1945), Alan Ladd in The Blue Dahlia (1946), Charlton Heston in Dark City (1950) and Spencer Tracy in Bad Day at Black Rock (1955), among hundreds of others. He also lent an an authoritative presence to classic sci-fi films such as Red Planet Mars (1952), The War of the Worlds (1953) and Invaders from Mars (1953), and also had a recurring featured part in the 1940s \"Boston Blackie\" film series playing Detective Matthews alongside Chester Morris' former thief-turned-crime hero. A prolific supporting player during the \"golden age\" of TV, Sande worked on nearly every popular western and crime show that aired throughout the 1950s and 1960s. He had a regular series role on The Adventures of Tugboat Annie (1957) as Capt. Horatio Bullwinkle, Annie's tugboat rival, and a recurring one as Inger Stevens' Swedish father, Lars \"Papa\" Holstrum, on The Farmer's Daughter (1963). Walter Sande died of a heart attack in 1971 at age 65.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWRlODgyYTEtMWEyMC00ZjY5LTllZGItZjlhZDkxYzE1ZjUyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0761340","name":"Walter Sande","idIMDB":"nm0761340"},"actorId":"nm0761340","character":"Joe Baird","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Chase","urlProfile":"http://www.imdb.com/name/nm0153679","urlPhoto":"","biography":{"dateOfBirth":"11 April 1902","placeOfBirth":" Huntington, Long Island, New York, USA","birthName":"Guy Alden Chase","height":"6' 3\" (1.91 m)","bio":"Stephen Chase was born on April 11, 1902 in Huntington, Long Island, New York, USA as Guy Alden Chase. He was an actor, known for The Blob (1958), When Worlds Collide (1951) and The Little Colonel (1935). He died on April 1, 1982 in Santa Monica, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0153679","name":"Stephen Chase","idIMDB":"nm0153679"},"actorId":"nm0153679","character":"Major McKay","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John War Eagle","urlProfile":"http://www.imdb.com/name/nm0911272","urlPhoto":"","biography":{"dateOfBirth":"8 June 1901","placeOfBirth":" Leicestershire, England, UK","birthName":"John Edwin Worley Eagle","height":"6' 1\" (1.85 m)","bio":"John War Eagle was born on June 8, 1901 in Leicestershire, England as John Edwin Worley Eagle. He was an actor, known for The Man from Laramie (1955), The Day of the Locust (1975) and When the Legends Die (1972). He died on February 7, 1991 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0911272","name":"John War Eagle","idIMDB":"nm0911272"},"actorId":"nm0911272","character":"Red Cloud","urlCharacter":"http://www.imdb.com/character/ch0141820","main":true},{"actorName":"Glenn Strange","urlProfile":"http://www.imdb.com/name/nm0833363","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGU4M2I2YzAtMTA3Yy00ZjMzLTkwYzUtYmU1YWJjOTQyZGMwXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 August 1899","placeOfBirth":" Weed, New Mexico, USA","birthName":"George Glenn Strange","height":"6' 6½\" (1.99 m)","bio":"At various times in his life a rancher, deputy sheriff and rodeo performer, this huge, towering (6' 5\") beast of a man was born George Glenn Strange in Weed, New Mexico, on August 16, 1899, but grew up a real-life cowboy in Cross Cut, Texas. Of Irish and Cherokee Indian descent, he taught himself (by ear) the fiddle and guitar at a young age and started performing at local functions as a teen. In the late 1920s, Glenn and his cousin, Taylor McPeters, better known later as the western character actor Cactus Mack, joined a radio singing group known as the \"Arizona Wranglers\" that toured throughout the country. They both started providing singing fillers in film westerns in the early 1930s. Glenn would play extra or bit roles for a number of years B Western and serials. One of his first roles was uncredited as a soldier, in tin armor, as part of \"Ming's Army\", in the sci fi classic serial \"Flash Gordon\"(1936/I). He would play a cowhand, rustler, henchman, sidekick, or plain ol' warbling, harmonica-blowing cowboy. Eventually in the late 30s, his billing improved and he evolved into a full-time bad guy in hundreds of \"B\" westerns. He was seen (or glimpsed) in many of the popular serials of the day, including The Hurricane Express (1932), Law of the Wild (1934), The Lone Ranger Rides Again (1939), and Riders of Death Valley (1941). It was his massive build that helped him break into the Universal horror picture genre of the 1940s. Horror star Boris Karloff had grown weary and fearful of his Frankenstein Creature typecast and abandoned the role. Glenn was the perfect replacement for the job and made his monstrous debut with House of Frankenstein (1944), quickly followed by House of Dracula (1945). It was he who played the Creature in the cult horror/comedy classic Abbott and Costello Meet Frankenstein (1948) as part of the monstrous trio of Bela Lugosi's Dracula and Lon Chaney Jr.'s Wolf Man. As the \"B\" western started faded off into the sunset in the 1950s, Strange moseyed on over to TV work. He played the nemesis \"Butch Cavendish\" and later reprised the role, after a prison escape, on \"The Lone Ranger\" (1949). Among other TV roles, he capped off his career with a steady (12 years) role as Sam the bartender on the classic Gunsmoke (1955) series from 1962 until shortly before his death from lung cancer in 1973.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGU4M2I2YzAtMTA3Yy00ZjMzLTkwYzUtYmU1YWJjOTQyZGMwXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0833363","name":"Glenn Strange","nicknames":["Pee Wee"],"idIMDB":"nm0833363"},"actorId":"nm0833363","character":"Stand Watie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Arnt","urlProfile":"http://www.imdb.com/name/nm0036792","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWZjNTc4OTItZmJlOC00MzkxLWEyYTYtMDAxMjZjMjk3MjdhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 August 1906","placeOfBirth":" Michigan City, Indiana, USA","bio":"Charles Arnt was born on August 20, 1906 in Michigan City, Indiana, USA. He was an actor, known for My Favorite Brunette (1947), Sweet Bird of Youth (1962) and Ball of Fire (1941). He died on August 6, 1990 in Orcas Island, Washington, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWZjNTc4OTItZmJlOC00MzkxLWEyYTYtMDAxMjZjMjk3MjdhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0036792","name":"Charles Arnt","idIMDB":"nm0036792"},"actorId":"nm0036792","character":"Gist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Julia Montoya","urlProfile":"http://www.imdb.com/name/nm0600224","urlPhoto":"","biography":{"dateOfBirth":"12 September 1901","placeOfBirth":" El Paso, Texas, USA","bio":"Julia Montoya was born on September 12, 1901 in El Paso, Texas, USA. She was an actress, known for The Far Horizons (1955), The Ring (1952) and The Great Sioux Uprising (1953). She died on January 12, 1993 in Santa Maria, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0600224","name":"Julia Montoya","idIMDB":"nm0600224"},"actorId":"nm0600224","character":"Heyoka","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ray Bennett","urlProfile":"http://www.imdb.com/name/nm0071986","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDJmNjdjMDItZjJkYi00ZGEyLWE3NTAtNzQ0NDAxMGQ2NGM3XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 March 1895","placeOfBirth":" Portland, Oregon, USA","birthName":"Raphael Fabian Bennett","bio":"After spending his childhood in San Francisco, Bennett eventually moved to Los Angeles and was residing in Beverly Hills by 1930. From the onset, he had close ties to the acting profession, his mother (Ella Costillo Bennett) being a celebrated drama critic and author. His first acting was in stock and his entry to films was via stunt work. Throughout his career he was variously billed either as \"Ray' or (for better productions) as 'Raphael' Bennett. When he eventually graduated to speaking parts -- which varied in size from small to medium -- it was generally as hard-bitten desperadoes or assorted sneaky henchmen in westerns and serials. On luckier occasions he got to play the lead villain. The majority of his appearances were for Poverty Row outfits like Republic or Monogram. The life of a small part contract player could not have been an easy one. The 1940 census had Ray working for six weeks in 1939, earning a meagre $1250. In between filming, Ray tried his hand at writing dramatic novels with a historical setting. At least one of his unpublished manuscripts (\"The Shelter of the Cloth\") is still held as part of the UCLA Library Special Collections. He never married and died from a long-standing heart affliction in December 1957 at the age of 62.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDJmNjdjMDItZjJkYi00ZGEyLWE3NTAtNzQ0NDAxMGQ2NGM3XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0071986","name":"Ray Bennett","idIMDB":"nm0071986"},"actorId":"nm0071986","character":"Sgt. Manners","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dewey Drapeau","urlProfile":"http://www.imdb.com/name/nm0237100","urlPhoto":"","biography":{"dateOfBirth":"21 August 1899","placeOfBirth":" Wagner, South Dakota, USA","birthName":"George Dewey Drapeau","bio":"Dewey Drapeau was born on August 21, 1899 in Wagner, South Dakota, USA as George Dewey Drapeau. He was an actor, known for The Great Sioux Uprising (1953), Around the World in Eighty Days (1956) and Westward Ho, the Wagons! (1956). He was married to Alice McBride and Hermine Cournoyer. He died on September 7, 1978 in Alameda, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0237100","name":"Dewey Drapeau","idIMDB":"nm0237100"},"actorId":"nm0237100","character":"Teo-Ka-Ha","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Boyd 'Red' Morgan","urlProfile":"http://www.imdb.com/name/nm0604508","urlPhoto":"","biography":{"dateOfBirth":"24 October 1915","placeOfBirth":" Waurika, Oklahoma, USA","birthName":"Boyd Franklin Morgan","bio":"Boyd 'Red' Morgan was born on October 24, 1915 in Waurika, Oklahoma, USA as Boyd Franklin Morgan. He is known for his work on Foxy Brown (1974), The Amazing Transparent Man (1960) and The War Wagon (1967). He was married to Lucille. He died on January 8, 1988 in Tarzana, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0604508","name":"Boyd 'Red' Morgan","idIMDB":"nm0604508"},"actorId":"nm0604508","character":"Ray","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lane Bradford","urlProfile":"http://www.imdb.com/name/nm0103048","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMzI2OTIwNl5BMl5BanBnXkFtZTgwNTg1ODc5MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 August 1922","placeOfBirth":" Yonkers, New York, USA","birthName":"John Myrtland Le Varre Jr.","height":"6' 1\" (1.85 m)","bio":"Lane Bradford was born on August 29, 1922 in Yonkers, New York, USA as John Myrtland Le Varre Jr. He is known for his work on Zombies of the Stratosphere (1952), The Invisible Monster (1950) and The Slender Thread (1965). He was married to Joan Irene Velin. He died on June 7, 1973 in Honolulu, Hawaii, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMzI2OTIwNl5BMl5BanBnXkFtZTgwNTg1ODc5MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0103048","name":"Lane Bradford","idIMDB":"nm0103048"},"actorId":"nm0103048","character":"Lee","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0045841","urlIMDB":"http://www.imdb.com/title/tt0045841","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"$1,350,000 (USA)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1952/\">1952</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 20 min (80 min)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Color (Technicolor)"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":["Technicolor, USA (color by) (as Technicolor)"],"filmLength":["2,198 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.5","filmingLocations":[{"location":"Portland, Oregon, USA"}],"rated":"APPROVED","awards":[],"votes":"160","type":"Movie","companyCreditsSimple":[{"idCompany":"co0021358","name":"Universal International Pictures (UI)"}],"keywords":{"keywords":["cook","doctor","american civil war","veterinarian","cavalry","military service","reconciliation","murder","settler","lynching","kidnapping","horse trader","heroism","frameup","deception","escape","fort","blacksmith","horse thief","dakota tribe","red cloud's war","sioux tribe","cavalry charge","self sacrifice","u.s. cavalry"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:17:31"}}