{"data":{"movies":[{"title":"Horse Feathers","originalTitle":"","year":"1932","releaseDate":"19320819","directors":[{"name":"Norman Z. McLeod","id":"nm0572851"}],"writers":[{"name":"Bert Kalmar","id":"nm0436095"},{"name":"Harry Ruby","id":"nm0748438"}],"runtime":"68 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4OTE4MzgyN15BMl5BanBnXkFtZTgwNzY5MTM4MTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Musical","Romance","Sport"],"plot":"Professor Quincy Adams Wagstaff has just been installed as the new president of Huxley College. His cavalier attitude toward education is not reserved for his son Frank, who is seeing the college widow, Connie Bailey. Frank influences Wagstaff to recruit two football players who hang out in a speakeasy, in order to beat rival school Darwin. Unfortunately, Wagstaff mistakenly hires the misfits Baravelli and Pinky. Finding out that Darwin has beaten him to the \"real\" players, Wagstaff enlists Baravelli and Pinky to kidnap them, which leads to an anarchic football finale.","simplePlot":"Quincy Adams Wagstaff, the new president of Huxley University, hires bumblers Baravelli and Pinky to help his school win the big football game against rival Darwin University.","actors":[{"actorName":"The Marx Brothers","urlProfile":"http://www.imdb.com/name/nm2580347","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0Njc3NDc2OF5BMl5BanBnXkFtZTcwNTkzNTgxMw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"bio":"The Marx Brothers, Groucho, Chico, Harpo and Zeppo are a group of actors known for Duck Soup (1933), Animal Crackers (1930) Horse Feathers (1932) A Night in Casablanca (1946) A Day at the Races (1937) and A Night at the Opera (1935). They began their careers in Vaudeville, before becoming stars in the movies.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0Njc3NDc2OF5BMl5BanBnXkFtZTcwNTkzNTgxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2580347","name":"The Marx Brothers","idIMDB":"nm2580347"},"actorId":"nm2580347","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Groucho Marx","urlProfile":"http://www.imdb.com/name/nm0000050","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3OTA3NDA0NV5BMl5BanBnXkFtZTYwNzUzMzQ2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 October 1890","placeOfBirth":" New York City, New York, USA","birthName":"Julius Henry Marx","height":"5' 7½\" (1.71 m)","bio":"The bushy-browed, cigar-smoking wise-cracker with the painted-on moustache and stooped walk was the leader of The Marx Brothers. With one-liners that were often double entendres, Groucho never cursed in any of his performances and said he never wanted to be known as a dirty comic. With a great love of music and singing (The Marx Brothers started as a singing group), one of the things Groucho was best known for was his rendition of the song \"Lydia the Tattooed Lady.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3OTA3NDA0NV5BMl5BanBnXkFtZTYwNzUzMzQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000050","name":"Groucho Marx","idIMDB":"nm0000050"},"actorId":"nm0000050","character":"Professor Quincy Adams Wagstaff","urlCharacter":"http://www.imdb.com/character/ch0497940","main":true},{"actorName":"Harpo Marx","urlProfile":"http://www.imdb.com/name/nm0555617","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjgwMjI3MTE1Ml5BMl5BanBnXkFtZTYwNjYxNTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 November 1888","placeOfBirth":" New York City, New York, USA","birthName":"Adolph Marx","height":"5' 5½\" (1.66 m)","bio":"With the big, poofy, curly red hair, a top hat, and a horn, the lovable mute was the favorite of the Marx Brothers. Though chasing woman was a favorite routine of his in the movies, Harpo was a devoted father and husband. He adopted the mute routine in vaudeville and carried it over to the films. Harpo was an accomplished self-taught harpist whose musical numbers would many times bring tears to the eyes of the audience of an otherwise hilarious movie.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjgwMjI3MTE1Ml5BMl5BanBnXkFtZTYwNjYxNTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0555617","name":"Harpo Marx","idIMDB":"nm0555617"},"actorId":"nm0555617","character":"Pinky","urlCharacter":"http://www.imdb.com/character/ch0030171","main":true},{"actorName":"Chico Marx","urlProfile":"http://www.imdb.com/name/nm0555597","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDI2MzIyMF5BMl5BanBnXkFtZTYwMjMwMTU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1887","placeOfBirth":" New York City, New York, USA","birthName":"Leonard Marx","height":"5' 6\" (1.68 m)","bio":"As a kid trying to negotiate his way through various gang territories to a floating crap game or a new pool hall where he was not yet known as a hustler, Leonard (Chico) Marx learned to fake several accents. Because he later employed an Italian accent in the Marx Brothers' act, people assumed his name was pronounced \"Cheeko.\" Instead, Leonard was dubbed \"Chicko\" for his other consuming passion, women (or \"chicks\"), at which he was more successful than gambling, but when a typesetter dropped the \"k\" out of his name, the brothers let it stay as Chico. Chico was the brother who guided the Marxes to stardom. He took over the act's managment (amicably) from their mother, Minnie, and through audacity and charm, Chico secured the Brothers their first international (London) booking, their first Broadway show and their MGM contract with Irving Thalberg, among other successes.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDI2MzIyMF5BMl5BanBnXkFtZTYwMjMwMTU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0555597","name":"Chico Marx","idIMDB":"nm0555597"},"actorId":"nm0555597","character":"Baravelli","urlCharacter":"http://www.imdb.com/character/ch0024429","main":true},{"actorName":"Zeppo Marx","urlProfile":"http://www.imdb.com/name/nm0555688","urlPhoto":"","biography":{"dateOfBirth":"25 February 1901","placeOfBirth":" New York City, New York, USA","birthName":"Herbert Marx","height":"5' 8\" (1.73 m)","bio":"The youngest of The Marx Brothers, Zeppo was put into the role of the straight man after his brother Gummo left the act. Zeppo also acted as an understudy to all three of his brothers, and he has been said to have played Grouchos part better than Groucho himself. After playing small parts in the first five Marx Brothers movies, Zeppo felt his talent wasn't being used to its full extent and left the act to join Gummo as an agent. Somewhat of a mechanical whiz, Zeppo invented a wristwatch that would monitor the pulse rate of cardiac patients, and his company, Marman Products, produced clamping devices which were used in the first atomic bomb raids over Japan in 1945. Zeppo died on November 30, 1979, from cancer.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0555688","name":"Zeppo Marx","nicknames":["Zep"],"idIMDB":"nm0555688"},"actorId":"nm0555688","character":"Frank Wagstaff","urlCharacter":"http://www.imdb.com/character/ch0024430","main":true},{"actorName":"Thelma Todd","urlProfile":"http://www.imdb.com/name/nm0865298","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5Mjk4ODc5MF5BMl5BanBnXkFtZTgwODQyNjc3MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1906","placeOfBirth":" Lawrence, Massachusetts, USA","height":"5' 4\" (1.63 m)","bio":"Thelma Todd was born in Lawrence, Massachusetts, an industrial city near the New Hampshire state line. She was a lovely child with good academic tendencies, so much so that she decided early on to become a schoolteacher. After high school she went on to college but at her mother's insistence entered several beauty contests (apparently her mother wanted her to be more than just a \"schoolmarm\"). Thelma was so successful in these endeavors that she entered on the state level and won the title of \"Miss Massachusetts\" in 1925 and went on to the \"Miss America\" pageant. Although she didn't win, the pageant afforded her a chance to be seen been by talent scouts looking for fresh new faces to showcase in films. She began appearing in one- and two-reel shorts, mostly comedy, which showcased her keen comic timing and aptitude for physical comedy (unusual in such a beautiful woman). She had been making shorts for Hal Roach when she was signed to Paramount Pictures. Her first film--at 21 years of age--was as Lorraine Lane in 1927's Fascinating Youth (1926), a romantic comedy, which was Paramount's showcase vehicle for its new stars. Thelma received minor billing in another film that year, God Gave Me Twenty Cents (1926). The next year she starred with Gary Cooper and William Powell in the western Nevada (1927). That year also saw her in three more films, with The Gay Defender (1927) being the most notable. It starred Richard Dix in the role of a man falsely accused of murder. As the 1920s closed, Thelma began getting parts in more and more films. In 1928 and 1929 alone she was featured in 20 pictures, and not just comedies--she also did dramas and gothic horror films. Unlike many silent-era stars whose voices didn't fit their image or screen persona, Thelma's did. She had a bright, breezy, clear voice with a pleasant trace of a somewhat aristocratic, but not snobbish, New England accent and easily made the transition to sound films. In 1930 she added 14 more pictures to her resume, with Dollar Dizzy (1930) and Follow Thru (1930) being the most notable. The latter was a musical with Thelma playing a rival to Nancy Carroll for the affections of Buddy Rogers. It was a box-office hit, as was the stage production on which it was based. The following year Thelma appeared in 14 more films, among them Let's Do Things (1931), Speak Easily (1932), The Old Bull (1932) and On the Loose (1931). Her most successful film that year, however, was the Marx Brothers farce Monkey Business (1931). While critics gave the film mixed reviews, the public loved it. In 1932 Thelma appeared in another Marx Brothers film directed by Norman Z. McLeod, Horse Feathers (1932). She also starred in This Is the Night (1932), a profitable film which featured Cary Grant in his first major role. In 1934 Thelma made 16 features, but her career would soon soon come to a grinding halt. In 1935 she appeared in such films as Twin Triplets (1935) and The Misses Stooge (1935), all showcasing her considerable comic talents. She also proved to be a savvy businesswoman with the opening of \"Thelma Todd's Sidewalk Cafe,\" a nightclub/restaurant that catered to show business people. It also, unfortunately, attracted some shady underworld types as well, and there were rumors that they were trying to take over her club and use it as a gambling establishment in order to fleece the wealthy Hollywood crowd. According to these stories, Thelma and her boyfriend, director Roland West, wouldn't sell their establishment once they found out what the gangsters had in mind, thereby incurring the enmity of people it was not a good idea to become enemies of. Whether the stories were true or not, on December 16, 1935, Thelma was found dead in her car in her garage in Los Angeles. Her death was ruled a suicide owing to carbon monoxide poisoning. She was only 29 years old. At the time, as today, many felt that her death was actually a murder connected to the goings-on at her club, a theory that was lent credence by the fact that no one who knew her had ever seen her depressed or morose enough to worry about her committing suicide. Another factor that aroused suspicion was that her death was given a cursory investigation by the--at the time--notoriously corrupt Los Angeles County District Attorney's Office and the case was quickly and unceremoniously closed. Her death has remained a controversial one even to this day. Three films she made before her death weren't released until the following year: Hot Money (1936), An All American Toothache (1936), and The Bohemian Girl (1936). The latter saw her quite substantial role cut down so much that she was barely glimpsed in the picture. Thelma had made an amazing 115 films in such a short career, and her beauty and talent would no doubt have taken her right to the top if it hadn't been for her untimely demise.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5Mjk4ODc5MF5BMl5BanBnXkFtZTgwODQyNjc3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0865298","name":"Thelma Todd","nicknames":["The Ice Cream Blonde","Hot Toddy"],"idIMDB":"nm0865298"},"actorId":"nm0865298","character":"Connie Bailey","urlCharacter":"http://www.imdb.com/character/ch0024431","main":true},{"actorName":"David Landau","urlProfile":"http://www.imdb.com/name/nm0484439","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWQ2ZDI0ZGItODAyZS00OWRmLWFkYTEtN2IyOWM4YTdmMzUwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 March 1879","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"6' 2\" (1.88 m)","bio":"Very busy Hollywood character actor who didn't hit his stride on screen until he was in his 50s but who nonetheless appeared in 33 films between 1931 and 1934. Many of his performances were somewhat wooden, although that suited the characters he portrayed. Landau was best known for his deep, sonorous speaking voice.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWQ2ZDI0ZGItODAyZS00OWRmLWFkYTEtN2IyOWM4YTdmMzUwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0484439","name":"David Landau","idIMDB":"nm0484439"},"actorId":"nm0484439","character":"Jennings","urlCharacter":"http://www.imdb.com/character/ch0024432","main":true}],"seasons":[],"idIMDB":"tt0023027","urlIMDB":"http://www.imdb.com/title/tt0023027","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"Copyright MCMXXXII Paramount Publix Corporation (on print); © Paramount Publix Corporation; 18 August 1932; LP3209 (in copyright registry)"},"technical":{"runtime":["1 hr 8 min (68 min)"],"soundMix":["Mono (Western Electric Noiseless Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["(8 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.7","filmingLocations":[{"location":"Occidental College -1600 Campus Road, Eagle Rock, Los Angeles, California, USA"}],"rated":"NOT RATED","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2017","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best DVD/Blu-Ray Collection","names":[{"name":"The Cocoanuts","id":"tt0019777","role":null},{"name":"Animal Crackers","id":"tt0020640","role":null},{"name":"Monkey Business","id":"tt0022158","role":null},{"name":"Duck Soup","id":"tt0023969","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best DVD Collection","names":[{"name":"The Cocoanuts","id":"tt0019777","role":null},{"name":"Animal Crackers","id":"tt0020640","role":null},{"name":"Monkey Business","id":"tt0022158","role":null},{"name":"Duck Soup","id":"tt0023969","role":null}]}]}]}],"votes":"9,746","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["athletic cheating","marx brothers","football","college","education","widow","speakeasy","professor","football movie","lifesaver","swordfish","collegiate","reference to nathan hale","college football","1930s","man with glasses","ends with a wedding","three guesses","slapstick comedy","irreverence","sports team","wedding","student","slot machine","singing","shaving","serenade","seal","satire","radio broadcasting","police officer","piano","pea shooter","password","mistaken identity","microscope","locker room","lecture","kidnapping","iceman","harp","guitar","fireplace","father son relationship","falling into water","escape","duck","dogcatcher","college president","coffee","chariot","canoe","candle","breaking the fourth wall","banana peel","baby talk","american football"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:49:42"}}