{"data":{"movies":[{"title":"The Great Man's Lady","originalTitle":"","year":"1942","releaseDate":"19450717","directors":[{"name":"William A. Wellman","id":"nm0920074"}],"writers":[{"name":"W.L. River","id":"nm0729179"},{"name":"Adela Rogers St. Johns","id":"nm0820700"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTBjN2ZhZWYtODlkOS00ODY2LWJkZmMtOGNhZTQ3MDZiZjYxXkEyXkFqcGdeQXVyNjc0MzMzNjA@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Western","Romance"],"plot":"In Hoyt City, a statue of founder Ethan Hoyt is dedicated, and 100 year old Hannah Sempler Hoyt (who lives in the last residence among skyscrapers) is at last persuaded to tell her story to a 'girl biographer'. Flashback: in 1848, teenage Hannah meets and flirts with pioneer Ethan; on a sudden impulse, they elope. We follow their struggle to found a city in the wilderness, hampered by the Gold Rush, star-crossed love, peril, and heartbreak. The star \"ages\" 80 years.","simplePlot":"A 100-year-old pioneer woman tells her story in flashbacks.","actors":[{"actorName":"Barbara Stanwyck","urlProfile":"http://www.imdb.com/name/nm0001766","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjMxODIzODEzNF5BMl5BanBnXkFtZTYwNDgwNjI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1907","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Ruby Catherine Stevens","height":"5' 5\" (1.65 m)","bio":"Today Barbara Stanwyck is remembered primarily as the matriarch of the family known as the Barkleys on the TV western The Big Valley (1965), wherein she played Victoria, and from the hit drama The Colbys (1985). But she was known to millions of other fans for her movie career, which spanned the period from 1927 until 1964, after which she appeared on television until 1986. It was a career that lasted for 59 years. Barbara Stanwyck was born Ruby Catherine Stevens on July 16, 1907, in Brooklyn, New York, to working class parents Catherine Ann (McPhee) and Byron E. Stevens. Her father, from Massachusetts, had English ancestry, and her Canadian mother, from Nova Scotia, was of Scottish and Irish descent. Stanwyck went to work at the local telephone company for fourteen dollars a week, but she had the urge (a dream--that was all it was) somehow to enter show business. When not working, she pounded the pavement in search of dancing jobs. The persistence paid off. Barbara was hired as a chorus girl for the princely sum of $40 a week, much better than the wages she was getting from the phone company. She was seventeen, and was going to make the most of the opportunity that had been given her. In 1928 Barbara moved to Hollywood, where she was to start one of the most lucrative careers filmdom had ever seen. She was an extremely versatile actress who could adapt to any role. Barbara was equally at home in all genres, from melodramas, such as Forbidden (1932) and Stella Dallas (1937), to thrillers, such as Double Indemnity (1944), one of her best films, also starring Fred MacMurray (as you have never seen him before). She also excelled in comedies such as Remember the Night (1940) and The Lady Eve (1941). Another genre she excelled in was westerns, Union Pacific (1939) being one of her first and TV's The Big Valley (1965) (her most memorable role) being her last. In 1983, she played in the ABC hit mini-series The Thorn Birds (1983), which did much to keep her in the eye of the public. She turned in an outstanding performance as Mary Carson. Barbara was considered a gem to work with for her serious but easygoing attitude on the set. She worked hard at being an actress, and she never allowed her star quality to go to her head. She was nominated for four Academy Awards, though she never won. She turned in magnificent performances for all the roles she was nominated for, but the \"powers that be\" always awarded the Oscar to someone else. However, in 1982 she was awarded an honorary Academy Award for \"superlative creativity and unique contribution to the art of screen acting.\" Sadly, Barbara died on January 20, 1990, leaving 93 movies and a host of TV appearances as her legacy to us.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjMxODIzODEzNF5BMl5BanBnXkFtZTYwNDgwNjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001766","name":"Barbara Stanwyck","nicknames":["Missy","The Queen","Babs"],"idIMDB":"nm0001766"},"actorId":"nm0001766","character":"Hannah Sempler Hoyt","urlCharacter":"http://www.imdb.com/character/ch0414141","main":true},{"actorName":"Joel McCrea","urlProfile":"http://www.imdb.com/name/nm0566948","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMjI0NDIyOV5BMl5BanBnXkFtZTYwMzMxMjg2._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1905","placeOfBirth":" South Pasadena, California, USA","birthName":"Joel Albert McCrea","height":"6' 2½\" (1.89 m)","bio":"One of the great stars of American Westerns, and a very popular leading man in non-Westerns as well. He was born and raised in the surroundings of Hollywood and as a boy became interested in the movies that were being made all around. He studied acting at Pomona College and got some stage experience at the Pasadena Community Playhouse, where other future stars such as Randolph Scott, Robert Young, and Victor Mature would also get their first experience. He worked as an extra after graduation from the University of Southern California in 1928 and did some stunt work. In a rare case of an extra being chosen from the crowd to play a major role, McCrea was given a part in The Jazz Age. A contract at MGM followed, and then a better contract at RKO. Will Rogers took a liking to the young man (they shared a love of ranching and roping) and did much to elevate McCrea's career. His wholesome good looks and quiet manner were soon in demand, primarily in romantic dramas and comedies, and he became an increasingly popular leading man. He hoped to concentrate on Westerns, but several years passed before he could convince the studio heads to cast him in one. When he proved successful in that genre, more and more Westerns came his way. But he continued to make a mark in other kinds of pictures, and proved himself particularly adept at the light comedy of Preston Sturges, for whom he made several films. By the late Forties, his concentration focused on Westerns, and he made few non-Westerns thereafter. He was immensely popular in them, and most of them still hold up well today. He and Randolph Scott, whose career strongly resembles McCrea's, came out of retirement to make a classic of the genre, Sam Peckinpah's Ride the High Country (1962). Scott stayed retired thereafter; McCrea made a couple of appearances in small films afterwards, but was primarily content to maintain his life as a gentleman rancher. He was married for fifty-seven years to actress Frances Dee, who survived him.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMjI0NDIyOV5BMl5BanBnXkFtZTYwMzMxMjg2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0566948","name":"Joel McCrea","nicknames":["McFee"],"idIMDB":"nm0566948"},"actorId":"nm0566948","character":"Ethan Hoyt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian Donlevy","urlProfile":"http://www.imdb.com/name/nm0002046","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwODA4ODAyOF5BMl5BanBnXkFtZTYwODMxMTM2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1901","placeOfBirth":" Portadown, County Armagh, Ireland [now in Northern Ireland], UK","birthName":"Waldo Brian Donlevy","height":"5' 8\" (1.73 m)","bio":"It seems that Brian Donlevy started out life as colorfully as any character he ever played on the stage or screen. He lied about his age (he was actually 14) in 1916 so he could join the army. When Gen. John J. Pershing sent American troops to invade Mexico in pursuit of Pancho Villa--Mexican rebels under Villa's command raided Columbus, NM, and killed 16 American soldiers and civilians--Donlevy served with that expedition and later, in WW I, was a pilot with the Lafayette Escadrille, a unit of the French Air Force comprised of American and Canadian pilots. His schooling was in Cleveland, OH, but in addition he spent two years at the US Naval Academy at Annapolis, MD. However, he gave up on a military career for the stage. After having landed several smaller roles, he got a part in \"What Price Glory\" and established himself as a bona fide actor. Later such roles on stage as \"Three for One\", \"The Milky Way\" and \"Life Begins at 8:30\" gave him the experience to head off to Hollywood. Donlevy began his Hollywood career with the silent film A Man of Quality (1926) and his first talkie was Gentlemen of the Press (1929) (in which he had a bit part). There was a five- to six-year gap before he reappeared on the film scene in 1935 with three pictures: Mary Burns, Fugitive (1935), Another Face (1935) and Barbary Coast (1935), which was his springboard into film history. Receiving rave reviews as \"the tough guy all in black\", acting jobs finally began to roll his way. In 1936 he starred in seven films, including Strike Me Pink (1936), in which he played the tough guy to Eddie Cantor's sweet bumpkin Eddie Pink. In all, from 1926 to 1969 Donlevy starred in at least 89 films, reprising one of his Broadway roles as a prizefighter in The Milky Way (1940), and had his own television series (which he also produced), Dangerous Assignment (1952). In 1939 he received an Oscar nomination for Best Supporting Actor for his portrayal of the sadistic Sgt. Markoff in Paramount's Beau Geste (1939), its remake of an earlier silent hit. The Great McGinty (1940), a Preston Sturges comedy about a poor homeless slob who makes it to Governor of a state with the mob's help, is a brilliant character study of a man and the changes he goes through to please himself, those around him and, eventually, the woman he loves. A line in the film, spoken by Mrs. McGinty, seems a fitting description of the majority of roles Brian Donlevy would play throughout his career: \". . . You're a tough guy, McGinty, not a wrong guy.\" Donlevy's ability to make the roughest edge of any character have a soft side was his calling card. He perfected it and no one has quite mastered it since. He later, in 1944, reprised that role in The Miracle of Morgan's Creek (1944). By 1935 Donlevy was working for 20th Century-Fox and had just completed filming 36 Hours to Kill (1936) when he became engaged to young singer Marjorie Lane, and they married the next year. The marriage produced one child, Judy, but ended in divorce in 1947. It was 19 years before he remarried. In 1966, Bela Lugosi's ex-wife Lillian became Mrs. Brian Donlevy, and they were married until his death in 1972. Donlevy had always derived great pleasure from his two diverse interests, gold mining and writing poetry, so it was fitting that after his last film, Pit Stop (1969), he retired to Palm Springs, CA, where he began to write short stories and had his income well supplemented from a prosperous California tungsten mine he owned. Having gone in for throat surgery in 1971 he re-entered the Motion Picture County Hospital in Woodland Hills, CA, on March 10th, 1972. Less than a month later, on April 6, he passed away from cancer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwODA4ODAyOF5BMl5BanBnXkFtZTYwODMxMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002046","name":"Brian Donlevy","idIMDB":"nm0002046"},"actorId":"nm0002046","character":"Steely Edwards","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"K.T. Stevens","urlProfile":"http://www.imdb.com/name/nm0828523","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjU1OGY0MDItZGM4Yy00MmUyLThiMTMtNjRkNTA3M2U5ODI4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 July 1919","placeOfBirth":" Los Angeles, California, USA","birthName":"Gloria Wood","bio":"She certainly had the requisite genes for an acting career as her father was the legendary director Sam Wood and her mother was a stage performer. K.T. Stevens wasted no time either. By the time she was 2 years old, she had made her film debut in her father's silent classic Peck's Bad Boy (1921), which starred Jackie Coogan. Christened Gloria Wood, she was billed \"Baby Gloria Wood\" as a toddler. Following high school, she decided to pursue acting full-time, taking drama lessons and apprenticing in summer stock. In 1938, she toured in two productions: \"You Can't Take It with You\" and \"My Sister Eileen\". The following year, she made her Broadway debut in a walk-on role in \"Summer Light\", which was directed by Lee Strasberg. At this point, she was calling herself \"Katharine Stevens\" (after her favorite actress, Katharine Hepburn), as she did not want to ride on her famous father's coattails. Eventually, she settled on the initials \"K.T.\" which she felt added mystery and flair. Although her film career subsided, she flourished on radio (\"Junior Miss\") and on the Broadway stage where \"The Man Who Came to Dinner\" (1940), \"Yankee Point\" (1942) and \"Nine Girls\" 1943) helped boost her reputation. K.T. met actor Hugh Marlowe after they appeared together on Broadway in \"The Land Is Bright\" (1941). Co-starring in a 1944 Chicago production of \"The Voice of the Turtle\", they married in 1946. The couple went on to grace more than 20 stage shows together, including a Broadway production of the classic film Laura (1944), in which she played the mysterious title role and he played the obsessed detective. In the 1950s, K.T. moved to TV episodics with Perry Mason (1957), Alfred Hitchcock Presents (1955) and The Big Valley (1965), just a few of her guest appearances. She possessed an open-faced prettiness and seemed ideal for film noir, but her chance to breakthrough never materialized despite decent roles in Kitty Foyle (1940), which was directed by her father, The Great Man's Lady (1942) starring Barbara Stanwyck, Port of New York (1949) with Yul Brynner, Vice Squad (1953) featuring Paulette Goddard and the sci-fi film Missile to the Moon (1958). Following her 1967 divorce from Marlowe, K.T. abandoned acting for a time in favor of teaching nursery school. She eventually returned to TV and made some strides in daytime soaps, most notably The Young and the Restless (1973). She also served three terms as President of the L.A. local branch of AFTRA. K.T. had two sons, Jeffrey Marlowe, born in 1948 and Christian, born in 1951, the latter best known these days as sportscaster Chris Marlowe. She died of lung cancer in 1994.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjU1OGY0MDItZGM4Yy00MmUyLThiMTMtNjRkNTA3M2U5ODI4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0828523","name":"K.T. Stevens","idIMDB":"nm0828523"},"actorId":"nm0828523","character":"Girl Biographer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thurston Hall","urlProfile":"http://www.imdb.com/name/nm0356159","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWQ5YzY0ODgtMDg3ZS00NTJiLWFiZTMtZTNmMTVhZDRmMjRkXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 May 1882","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Ernest Thurston Hall","height":"6' (1.83 m)","bio":"Movies, especially comedies, have always needed big, blustery, booming authoritarian types for the lead to play off of (or against), and one of the best was Thurston Hall, most famous for his role of Mr. Schuyler in the Topper (1953) series of the early 1950s. Hall was a tall, distinguished, imposing-looking man, which fit perfectly with the variety of military officers, wealthy businessmen, bankers and upper-crust types he played so well. The Boston-born Hall was attracted to a theatrical career as a youth, and toured New England with a theater troupe and eventually journeyed to Britain, where he spent several years on the stage. He formed his own theater company and successfully toured South Africa, New Zealand and Australia. By the time he entered films he was an established and successful stage actor, in both the U.S. and Europe. He started out in silent films, but his rich baritone voice enabled him to easily transition into talkies. He appeared in more than 200 films, his final one being Affair in Reno (1956), although he had kept busy in television, with appearances on many different series in addition to his co-starring role on \"Topper\". He died of a heart attack in 1958.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWQ5YzY0ODgtMDg3ZS00NTJiLWFiZTMtZTNmMTVhZDRmMjRkXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0356159","name":"Thurston Hall","idIMDB":"nm0356159"},"actorId":"nm0356159","character":"Mr. Sempler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lloyd Corrigan","urlProfile":"http://www.imdb.com/name/nm0180987","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjc2ZDY2N2UtNWEyOC00NDRhLWE4OGEtODY2MWQ4ZWZjYWY0L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 October 1900","placeOfBirth":" San Francisco, California, USA","height":"5' 6\" (1.68 m)","bio":"Lloyd Corrigan was born on October 16, 1900 in San Francisco, California, USA. He was an actor and writer, known for The Manchurian Candidate (1962), It's a Mad Mad Mad Mad World (1963) and Cyrano de Bergerac (1950). He died on November 5, 1969 in Woodland Hills, Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjc2ZDY2N2UtNWEyOC00NDRhLWE4OGEtODY2MWQ4ZWZjYWY0L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0180987","name":"Lloyd Corrigan","idIMDB":"nm0180987"},"actorId":"nm0180987","character":"Mr. Cadwallader","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Etta McDaniel","urlProfile":"http://www.imdb.com/name/nm0567400","urlPhoto":"","biography":{"dateOfBirth":"1 December 1890","placeOfBirth":" Wichita, Kansas, USA","bio":"Etta McDaniel was born on December 1, 1890 in Wichita, Kansas, USA. She was an actress, known for Son of Dracula (1943), The Prisoner of Shark Island (1936) and The Great Man's Lady (1942). She died on January 13, 1946 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0567400","name":"Etta McDaniel","idIMDB":"nm0567400"},"actorId":"nm0567400","character":"Delilah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank M. Thomas","urlProfile":"http://www.imdb.com/name/nm0858828","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzc1NTBmNzQtMzdmNC00MzE4LWJjMmUtYzcyYTcxN2U1ZWJiXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 July 1889","placeOfBirth":" St. Joseph, Missouri, USA","bio":"Frank M. Thomas was born on July 13, 1889 in St. Joseph, Missouri, USA. He was an actor, known for Bachelor Mother (1939), Horace Mann's Miracle (1953) and The Black Robe (1949). He was married to Mona Bruns. He died on November 25, 1989 in Tujunga, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzc1NTBmNzQtMzdmNC00MzE4LWJjMmUtYzcyYTcxN2U1ZWJiXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0858828","name":"Frank M. Thomas","idIMDB":"nm0858828"},"actorId":"nm0858828","character":"Frisbee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William B. Davidson","urlProfile":"http://www.imdb.com/name/nm0203527","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWQ5NGU5MzYtMDQxMS00ODkyLWFkZjQtMGFiMGIyYjRmMmRmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1888","placeOfBirth":" Dobbs Ferry, New York, USA","birthName":"William Beatman Davidson","height":"6' 1½\" (1.87 m)","bio":"William B. Davidson was born on June 16, 1888 in Dobbs Ferry, New York, USA as William Beatman Davidson. He was an actor, known for The Most Dangerous Game (1932), Sun Valley Serenade (1941) and Hell's Angels (1930). He was married to Helen Bolton and Mary Hellen Dorsey. He died on September 28, 1947 in Santa Monica, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWQ5NGU5MzYtMDQxMS00ODkyLWFkZjQtMGFiMGIyYjRmMmRmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0203527","name":"William B. Davidson","idIMDB":"nm0203527"},"actorId":"nm0203527","character":"Senator Knobs","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lillian Yarbo","urlProfile":"http://www.imdb.com/name/nm0946361","urlPhoto":"","biography":{"dateOfBirth":"1905","placeOfBirth":" Washington, District of Columbia, USA","bio":"Lillian Yarbo was born in 1905 in Washington, District of Columbia, USA. She was an actress, known for You Can't Take It with You (1938), Destry Rides Again (1939) and The Great Man's Lady (1942). She died in 1996 in the USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0946361","name":"Lillian Yarbo","idIMDB":"nm0946361"},"actorId":"nm0946361","character":"Mandy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Helen Lynd","urlProfile":"http://www.imdb.com/name/nm0528505","urlPhoto":"","biography":{"dateOfBirth":"18 January 1902","placeOfBirth":" New Jersey, USA","bio":"Helen Lynd was born on January 18, 1902 in New Jersey, USA. She was an actress, known for Of Mice and Men (1939), The Strawberry Blonde (1941) and So Proudly We Hail! (1943). She died on April 1, 1992 in Beverly Hills, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0528505","name":"Helen Lynd","idIMDB":"nm0528505"},"actorId":"nm0528505","character":"Bettina","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mary Treen","urlProfile":"http://www.imdb.com/name/nm0871695","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5ODcyOTQ0NV5BMl5BanBnXkFtZTgwMzIwNDEzMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 March 1907","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Mary Louise Summers","height":"5' 9\" (1.75 m)","bio":"About as reliable as one could ever find, character actress Mary Treen was a familiar face to most and could always be counted on to bring a bit of levity to any film scene. A minor actress for much of her career, she managed to secure a plain, unassuming niche for herself in 40s, 50s and 60s Hollywood. She was born Mary Louise Treen in St. Louis, Missouri in 1907, her father dying while she was still an infant. Raised in California by her mother, who once performed under the stage name Helene Sullivan, and her stepfather, a physician, she attended the Westlake School for Girls as well as a convent where she tried out successfully in school plays. Mary began dancing in vaudeville shows and revues before seeking her fame in the movies. Tall (5'9\") and stringy-framed, she formed a musical comedy duo with Marjorie Barnett, who was 5'3\", billing themselves as \"Treen and Barnett: Two Unsophisticated Vassar Co-eds.\" Much of their comedy was centered around their difference in height. Not a beauty by Hollywood standards, Mary relied on humor to get attention. In 1934, Warner Brothers signed her up after seeing her in a local play. After three years, she freelanced. Her scores of pudgy-cheeked nurses, waitresses, career girls, wallflowers and confidantes enhanced many a comedy or, at the very least, offered a brief respite in a heavier drama. In the long run, however she deserved better. A few of Mary's highlights would include the films Kentucky Moonshine (1938), I Love a Soldier (1944) (the role was written especially for her), Don Juan Quilligan (1945), and the Christmas classic It's a Wonderful Life (1946) (as James Stewart's cousin Tilly). In later years both Jerry Lewis and Elvis Presley utilized her talents in their movie vehicles. On TV Mary was given a bit more to do and actually stole a few scenes as the arch maid Hilda on The Joey Bishop Show (1961) for three seasons. She typically guested on lightweight sitcoms such as \"The Andy Griffith Show,\" \"Green Acres,\" \"Here's Lucy,\" \"Happy Days\" and \"The Dukes of Hazzard.\" Perhaps because she could play old maid types so easily in later years, she was often thought to have never married. She actually did marry, quite late in life, to a whole-sale liquor dealer. They had no children. He died in 1965 and she eventually moved in with her ex-vaudeville partner, Marjorie Barnett-Klein, who was also widowed. In later years the two performed their old routines to the delight of other senior citizens. Mary was living in Balboa Beach, California when she died of cancer in 1989.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5ODcyOTQ0NV5BMl5BanBnXkFtZTgwMzIwNDEzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0871695","name":"Mary Treen","idIMDB":"nm0871695"},"actorId":"nm0871695","character":"Persis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lucien Littlefield","urlProfile":"http://www.imdb.com/name/nm0514707","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjEyZjMxZDQtYWZlZC00ZGJmLTg5ODYtZGQ1MmQ0MTQ0YjkzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 August 1895","placeOfBirth":" San Antonio, Texas, USA","birthName":"Lucien Lovell Littlefield","height":"5' 10½\" (1.79 m)","bio":"Lucien Littlefield was born on August 16, 1895 in San Antonio, Texas, USA as Lucien Lovell Littlefield. He was an actor and writer, known for Sons of the Desert (1933), The Little Foxes (1941) and Zorro's Black Whip (1944). He was married to Constance Palmer. He died on June 4, 1960 in Hollywood, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjEyZjMxZDQtYWZlZC00ZGJmLTg5ODYtZGQ1MmQ0MTQ0YjkzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0514707","name":"Lucien Littlefield","idIMDB":"nm0514707"},"actorId":"nm0514707","character":"City Editor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Hamilton","urlProfile":"http://www.imdb.com/name/nm0357963","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NzY5NjMyM15BMl5BanBnXkFtZTgwNTc5NzUyMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 January 1887","placeOfBirth":" Shippensburg, Pennsylvania, USA","birthName":"John Rummel Hamilton","height":"5' 10½\" (1.79 m)","bio":"Burly, stentorian-voiced John Hamilton, worked on Broadway and in touring theatrical companies for many years prior to his 1930 film debut. He was in the original Broadway company of \"Seventh Heaven\" and would appear in the film remake (Seventh Heaven (1937)) in 1937. For Warner Bros, he starred with Donald Meek in a series of short mysteries based on S.S. Van Dine stories. He was often typecast as prison wardens, judges and police chiefs, but played various types of characters in an almost limitless number of films from the 1930s to the 1950s. He became famous when he was cast as Daily Planet newspaper editor Perry White in the 1950s TV classic, Adventures of Superman (1952). He is survived by a son. Hamilton is often confused with John F. Hamilton, a British actor who made a few films in the US during the same period, and with several other actors of the same name.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NzY5NjMyM15BMl5BanBnXkFtZTgwNTc5NzUyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0357963","name":"John Hamilton","idIMDB":"nm0357963"},"actorId":"nm0357963","character":"Senator Grant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fred 'Snowflake' Toones","urlProfile":"http://www.imdb.com/name/nm0867560","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGY3YWQ5ZTgtMDFiZS00ODhkLWE5ZmEtNzViNGI4YzdmYTZkXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1906","placeOfBirth":" North Carolina, USA","bio":"Toones is one of the most \"colorful\" character faces in B-Westerns and cliffhangers. He appeared in over 200 films between 1928 and 1951; and during 1936 and 1947, Toones often worked under contract for Republic Pictures, appearing in about 40 of its films. Toones often played a bootblack or shoeshine man in at least six of his movies, and Toones actually ran the shoeshine stand at Republic Studios. Toones first appeared as a porter in 1932 in \"The Hurricane Express\", and was usually typecast as a porter -appearing in over 50 films in such a role. He also played a variety of other service-oriented or domestic worker roles such as stable grooms, janitors, elevator operators, valets, cooks, bellhops, doormen, butlers, and bartenders. Like other actors of the time, i.e. Anna May Wong and Franklin Pangborn, Toones is a prime example of racial and social stereotyping in the Hollywood film industry. His standard characterization was that of a middle-aged \"colored\" man with a high-pitched voice and childlike mannerisms. \"Snowflake\" was the stage name Toones was best known by, and he used this name as his credit as early as his third film, 1931's \"Shanghaied Love\". Likewise, in \"Shanghaied Love\" and over 35 other films, \"Snowflake\" was also Toones' character name. Toones acted in films such as \"Mississippi\"(1935), \"Hawk of the Wilderness\" (1938) and \"Daredevils of the Red Circle\"(1939) with Bruce Bennett and in many \"B\" westerns such as \"The Lawless Nineties\"(1936) with John Wayne. He also appeared in dozens of two-reeler's such as Columbia's \"Woman Haters\" (1934) with the Three Stooges, and had a bit role in Laurel and Hardy's classic feature \"Way Out West\"(1937). Toones is also a familiar face in four Preston Sturges comedies: \"Twentieth Century\"(1934), \"Remember the Night\"(1940),\"Christmas in July\"(1940) and \"The Palm Beach Story\"(1942).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGY3YWQ5ZTgtMDFiZS00ODhkLWE5ZmEtNzViNGI4YzdmYTZkXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0867560","name":"Fred 'Snowflake' Toones","idIMDB":"nm0867560"},"actorId":"nm0867560","character":"Pogey","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0034812","urlIMDB":"http://www.imdb.com/title/tt0034812","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"17","month":"02","year":"1941","remarks":null},{"money":null,"country":null,"day":"19","month":"04","year":"1941","remarks":null}],"copyrightHolder":"Paramount Pictures, Inc. (original), U.S. Copyright LP11337, 26 March 1942"},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":["Mono (Western Electric Mirrophonic Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.7","filmingLocations":[{"location":"Paramount Studios - 5555 Melrose Avenue, Hollywood, Los Angeles, California, USA"}],"rated":"PASSED","awards":[],"votes":"466","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["pioneer","statue","founder","biographer","flashback","silver","gambler","flood","dedication","sermon","held at gunpoint","archive footage","stock footage","wagon master","damsel in distress","bartender","henchman","barfly","death of a child","unrequited love","sacramento california","year 1847","divorce","log cabin","farm","year 1868","grave site","shooting unarmed man","saloon","woman croupier","gambling house","media frenzy","black stereotype","mammy","african american","frontier","arranged marriage","wagon train","reference to abraham lincoln","year 1906","reference to san francisco fire","black maid","three card monte","philadelphia pennsylvania","marriage license","twin","year 1860","san francisco california","first person narration","told in flashback","old woman","centenarian","virginia city nevada"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 16:20:04"}}