{"data":{"movies":[{"title":"The Fly","originalTitle":"","year":"1986","releaseDate":"19860815","directors":[{"name":"David Cronenberg","id":"nm0000343"}],"writers":[{"name":"George Langelaan","id":"nm0486228"},{"name":"Charles Edward Pogue","id":"nm0688279"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjI3OGRhYjUtZmY1MC00N2JlLWJjMDUtYmViNTE0NDA0NzZlXkEyXkFqcGdeQXVyNTI4MjkwNjA@._V1.jpg","countries":["USA","UK","Canada"],"languages":["English"],"genres":["Drama","Horror","Sci-Fi"],"plot":"Seth Brundle (), a brilliant but eccentric scientist attempts to woo investigative journalist Veronica Quaife () by offering her a scoop on his latest research in the field of matter transportation, which against all the expectations of the scientific establishment have proved successful. Up to a point. Brundle thinks he has ironed out the last problem when he successfully transports a living creature, but when he attempts to teleport himself a fly enters one of the transmission booths, and Brundle finds he is a changed man. This Science-Gone-Mad film is the source of the quotable quote \"Be afraid. Be very afraid.\"","simplePlot":"A brilliant but eccentric scientist begins to transform into a giant man/fly hybrid after one of his experiments goes horribly wrong.","actors":[{"actorName":"Jeff Goldblum","urlProfile":"http://www.imdb.com/name/nm0000156","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NzkyODg1Nl5BMl5BanBnXkFtZTYwMTY2OTE0._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 October 1952","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"Jeffrey Lynn Goldblum","height":"6' 4½\" (1.94 m)","bio":"Jeffrey Lynn Goldblum was born October 22, 1952 in Pittsburgh, Pennsylvania, one of four children of Shirley (Temeles), a radio broadcaster who also ran an appliances firm, and Harold L. Goldblum, a doctor. His father was of Russian Jewish descent and his mother was of Austrian Jewish ancestry. Goldblum began his career on the New York stage after moving to the city at age seventeen. Possessing his own unique style of delivery, Goldblum made an impression on moviegoers with little more than a single line in Woody Allen's Annie Hall (1977), when he fretted about having forgotten his mantra. Goldblum went on to appear in the remake Invasion of the Body Snatchers (1978) and co-starred with Ben Vereen in the detective series Tenspeed and Brown Shoe (1980) before a high-profile turn in the classic ensemble film The Big Chill (1983). The quirky actor turned up in the suitably quirky film The Adventures of Buckaroo Banzai Across the 8th Dimension (1984), which became a 1980s cult classic, starred in the modern-day film noir Into the Night (1985), then went on to a breakthrough role in the David Cronenberg remake The Fly (1986), which also featured actress Geena Davis, Goldblum's wife from 1987-1990 and co-star in two additional films: Transylvania 6-5000 (1985) and Julien Temple's Earth Girls Are Easy (1988). Goldblum was the rather unlikely star of some of the biggest blockbusters of the 1990s: Steven Spielberg's dinosaur adventure Jurassic Park (1993) and its sequel The Lost World: Jurassic Park (1997), as well as the alien invasion film Independence Day (1996). These films saw Goldblum playing the type of intellectual characters he has become associated with. More recently, roles have included critically acclaimed turns in Igby Goes Down (2002) and Wes Anderson's The Life Aquatic with Steve Zissou (2004). In 2009, he returned to television to star in his second crime series Law & Order: Criminal Intent (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NzkyODg1Nl5BMl5BanBnXkFtZTYwMTY2OTE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000156","name":"Jeff Goldblum","idIMDB":"nm0000156"},"actorId":"nm0000156","character":"Seth Brundle","urlCharacter":"http://www.imdb.com/character/ch0010294","main":true},{"actorName":"Geena Davis","urlProfile":"http://www.imdb.com/name/nm0000133","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMTk5MTc3Ml5BMl5BanBnXkFtZTYwMDc0NDE0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 January 1956","placeOfBirth":" Wareham, Massachusetts, USA","birthName":"Virginia Elizabeth Davis","height":"6' (1.83 m)","bio":"As a child, Geena dreamed of being an actress. While in high school, she felt left out and had low self-esteem because, at 6 feet, she was the tallest girl in school. After high school graduation, Geena entered New England College in New Hampshire and then transferred the next year to Boston University, where she majored in drama. In 1979, she graduated and moved to New York to start her career. Her career consisted of sales clerk and waitress. She worked at Ann Taylor, where she eventually rose to Saturday window mannequin while trying to get a job with a modeling agency. Eventually signed by the Zoli Agency, she wound up as a model in the Victoria Secret's Catalogue. Ever vigilant, Sydney Pollack was looking for new talent in the catalog when he spotted Geena and cast her in Tootsie (1982). With good reviews, Geena moved to Los Angeles where she was cast as Wendy in the short-lived but critically acclaimed television series Buffalo Bill (1983). A starter marriage to restaurant manager Richard Emmolo ended in divorce at about that time. Her next appearance on television was in her own series Sara (1985), which was also good, but soon canceled. Geena then returned to the big screen in the below-average Transylvania 6-5000 (1985) followed by the successful Chevy Chase movie Fletch (1985). From there on, she was on a roll with second husband Jeff Goldblum in the horror remake The Fly (1986). More successful were Tim Burton's dark comedy Beetlejuice (1988) and The Accidental Tourist (1988). For the last film, she was the surprise winner of the Oscar for Best Supporting Actress. More fun movies followed with the flying-saucer-in-the-pool Earth Girls Are Easy (1988) and everyone-loves-a-clown Quick Change (1990) with Bill Murray. The very successful Thelma & Louise (1991), directed by Ridley Scott, again garnered Academy Award nominations for Geena and Susan Sarandon. A League of Their Own (1992), with Tom Hanks and directed by Penny Marshall, was the turning point as her next film, Hero (1992), was only average. Then she married director Renny Harlin and they set up a production and development company called \"The Forge\". Their first film was Speechless (1994), which flopped at the box office. Undeterred, Renny decided to film the big-budget Cutthroat Island (1995), starring Geena as pirate leader Morgan, which also flopped. Geena has since starred in the thriller The Long Kiss Goodnight (1996) and played Eleanor Little in Stuart Little (1999) and Stuart Little 2 (2002). She's also returned to TV, headlining The Geena Davis Show (2000) and Commander in Chief (2005). Both series were canceled after one season each, but she won a Golden Globe for the latter. Since 2001 she has been married to her fourth husband, neurosurgeon Reza Jarrahy, and they have three children. In 2008, after being missed from the big screen for some years, Geena ventured to Sydney, Australia, playing the foul-mouthed mother of Harry Cook and Harrison Gilbertson to shoot the dark comedy Accidents Happen (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMTk5MTc3Ml5BMl5BanBnXkFtZTYwMDc0NDE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000133","name":"Geena Davis","idIMDB":"nm0000133"},"actorId":"nm0000133","character":"Veronica Quaife","urlCharacter":"http://www.imdb.com/character/ch0276925","main":true},{"actorName":"John Getz","urlProfile":"http://www.imdb.com/name/nm0315288","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNDcxODcwMF5BMl5BanBnXkFtZTcwMjQ2MzMzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 October 1946","placeOfBirth":" Davenport, Iowa, USA","birthName":"John William Getz","height":"6' 2\" (1.88 m)","bio":"John Getz was born on October 15, 1946 in Davenport, Iowa, USA as John William Getz. He is an actor, known for Blood Simple. (1984), The Fly (1986) and The Social Network (2010). He was previously married to Grace McKeaney.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNDcxODcwMF5BMl5BanBnXkFtZTcwMjQ2MzMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0315288","name":"John Getz","idIMDB":"nm0315288"},"actorId":"nm0315288","character":"Stathis Borans","urlCharacter":"http://www.imdb.com/character/ch0010298","main":true},{"actorName":"Joy Boushel","urlProfile":"http://www.imdb.com/name/nm0100205","urlPhoto":"","biography":{"dateOfBirth":"1959","placeOfBirth":"","height":"5' 3\" (1.6 m)","bio":"Vibrant, buxom, ravishing and voluptuous redhead beauty Joy Boushel only acted in a handful of movies and TV shows for just ten years, but she nonetheless made a nice favorable impression with her winning blend of bubbly vitality and unbridled sex appeal. Boushel made her splendidly spirited debut as the sassy waitress Sally in the enjoyably lowbrow comedy \"Pick-Up Summer\" (1980). Joy was likewise solid and credible as a primitive cave woman in the excellent \"Quest for Fire\" (1981). Moreover, she had memorably sexy roles in the horror films \"Terror Train\" (1980), \"Humongous\" (1982), and David Cronenberg's outstanding \"The Fly\" (1986), giving an especially notable turn in the latter as the enticing young woman Jeff Goldblum picks up in a bar. Alas, despite a funny part in the hit comedy \"Look Who's Talking\" (1989) her acting career came to a sudden complete end in the early 90s.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0100205","name":"Joy Boushel","idIMDB":"nm0100205"},"actorId":"nm0100205","character":"Tawny","urlCharacter":"http://www.imdb.com/character/ch0218781","main":true},{"actorName":"Leslie Carlson","urlProfile":"http://www.imdb.com/name/nm0137967","urlPhoto":"","biography":{"dateOfBirth":"24 February 1933","placeOfBirth":" Mitchell, South Dakota, USA","bio":"Excellent, prolific, and versatile character actor Leslie Carlson was born on February 24, 1933 in Mitchell, South Dakota. Leslie earned both a BFA and an MA from the University of South Dakota, which he attended in the 1950's. Carlson began his acting career performing in several stage plays in both America and England. He immigrated to Canada in the late 1960's and began popping up in a slew of films and TV shows in the early 1970's. His most memorable movie roles were helpful police officer Graham in the chilling seasonal slasher shocker \"Black Christmas,\" stuffy newspaper reporter Tom Sims in the creepy \"Deranged,\" security expert Jim in \"Shoot,\" bumbling drunk Bud in \"High-Ballin',\" and a pushy Christmas tree salesman in the delightful \"A Christmas Story.\" Leslie appeared in four pictures for noted director David Cronenberg: He was splendidly slimy as sinister white collar corporate sleazeball Barry Convex in \"Videodrome\" (for which he was nominated for a Genie Award for Best Performance by an Actor in a Supporting Role), \"The Dead Zone,\" \"The Fly,\" and the offbeat short \"Camera.\" Among the many TV shows Carlson did guest spots on are \"Road to Avonlea,\" \"The X-Files,\" \"Highlander,\" \"Friday the 13: The Series,\" \"21 Jump Street,\" \"MacGyver,\" \"The Twilight Zone,\" and \"The New Avengers.\" In addition to his film and TV credits, Leslie also acted throughout the decades in stage productions of such plays as \"Homecoming,\" \"Our Town,\" \"A Lie of the Mind\" (Carlson was nominated for a Jessie Richardson Award in 1989 for his sterling work in this particular play), \"A Walk in the Woods,\" \"Candida,\" \"Glengarry Glen Ross,\" \"Dr. Jeckyll and Mr. Hyde,\" \"Hamlet,\" \"Joggers,\" \"All My Sons,\" and \"Death and the Maiden.\" Carlson died of cancer on May 3, 2014 at the age of 81.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0137967","name":"Leslie Carlson","idIMDB":"nm0137967"},"actorId":"nm0137967","character":"Dr. Brent Cheevers","urlCharacter":"http://www.imdb.com/character/ch0218785","main":true},{"actorName":"George Chuvalo","urlProfile":"http://www.imdb.com/name/nm0161546","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MjQ1NjQ5M15BMl5BanBnXkFtZTYwMjY2MjM1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1937","placeOfBirth":" Toronto, Ontario, Canada","height":"6' (1.83 m)","bio":"George Chuvalo was Canada's greatest heavyweight boxer. In a career which spanned three decades and 93 fights, Chuvallo fought 6 world heavyweight champions, and failed in two attempts to capture the World Heavyweight Title. George a muscular 6 feet 210 pounder, turned pro in 1956 at age 18 and knocked-out 4 men in one night to capture the Jack Dempsey Novice Heavyweight Tournament. On September 15, 1958 he knocked-out James J. Parker in one round to win the Canadian Heavyweight Boxing Title for the first time. Over the next 19 years, Chuvallo would reign 4 more times as Canada's boxing king. Chuvalo failed in his first attempt to win the world's title by losing a 15 round nod to Ernie Terrell in 1965. A year later he was beaten by Muhammad Ali in 15 rounds again. In his 21 year career, Chuvalo compiled a record of 73-18-2 with 64 wins by knockout. Chuvalo scored wins over rated contenders such as Jerry Quarry KO 7, Cleveland Williams W 10, Buster Mathis W 12, Manuel Ramos KO 5, Doug Jones KO 11 and Robert Cleroux W 12. He was defeated by heavyweight champions Floyd Patterson, Ernie Terrell, Muhammad Ali, Joe Frazier, Jimmy Ellis and George Foreman. In 93 professional fights, Chuvalo was never knocked off his feet.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MjQ1NjQ5M15BMl5BanBnXkFtZTYwMjY2MjM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0161546","name":"George Chuvalo","nicknames":["Iron Man","Washer Woman"],"idIMDB":"nm0161546"},"actorId":"nm0161546","character":"Marky","urlCharacter":"http://www.imdb.com/character/ch0218789","main":true},{"actorName":"Michael Copeman","urlProfile":"http://www.imdb.com/name/nm0178680","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxODIwMzM3MF5BMl5BanBnXkFtZTgwOTYxMTI2MzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Michael Copeman is known for his work on The Fly (1986), The Assassination of Jesse James by the Coward Robert Ford (2007) and Focus (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxODIwMzM3MF5BMl5BanBnXkFtZTgwOTYxMTI2MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0178680","name":"Michael Copeman","idIMDB":"nm0178680"},"actorId":"nm0178680","character":"2nd Man in Bar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Cronenberg","urlProfile":"http://www.imdb.com/name/nm0000343","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjM3OTYyMV5BMl5BanBnXkFtZTYwMzcyMzY1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 March 1943","placeOfBirth":" Toronto, Ontario, Canada","birthName":"David Paul Cronenberg","height":"5' 9\" (1.75 m)","bio":"David Cronenberg, also known as the King of Venereal Horror or the Baron of Blood, was born in Toronto, Ontario, Canada, in 1943. His father was a journalist, and his mother was a piano player. After showing an inclination for literature at an early age (he wrote and published eerie short stories, thus following his father's path) and for music (playing classical guitar until he was 12), Cronenberg graduated from the University of Toronto with a degree in Literature after switching from the science department. He reached the cult status of horror-meister with the gore-filled, modern-vampire variations of Shivers (1975) and Rabid (1977), following an experimental apprenticeship in independent film-making and in Canadian television programs. Cronenberg gained popularity with the head-exploding, telepathy-based Scanners (1981) after the release of the much underrated, controversial, and autobiographical Chromosome 3 (1979). Cronenberg become a sort of a mass media guru with Vidéodrome (1983), a shocking investigation of the hazards of reality-morphing television and a prophetic critique of contemporary aesthetics. The issues of tech-induced mutation of the human body and topics of the prominent dichotomy between body and mind were back again in The Dead Zone (1983) and The Fly (1986), both bright examples of a personal film-making identity, even if both films are based on mass-entertainment materials: the first being a rendition of a Stephen King best-seller, the latter a remake of famous American horror movie. With Faux-semblants (1988) and Le festin nu (1991), the Canadian director, no more a mere genre movie-maker but a fully realized auteur, got the acclaim of international critics. Such profound statements on modern humanity and ever-changing society are prominent in the provocative Crash (1996) and in the virtual reality essay of eXistenZ (1999), both of which well fared at the Cannes and Berlin Film Festivals. In the last two filmic projects Spider (2002) and A History of Violence (2005), Cronenberg avoids expressing his teratologic and oniric expressionism in favor of a more psychological exploration of human contradictions and idiosyncrasies.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjM3OTYyMV5BMl5BanBnXkFtZTYwMzcyMzY1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000343","name":"David Cronenberg","idIMDB":"nm0000343"},"actorId":"nm0000343","character":"Gynecologist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carol Lazare","urlProfile":"http://www.imdb.com/name/nm0493706","urlPhoto":"","biography":{"bio":"Carol Lazare is an actress and writer, known for The Fly (1986), Lies My Father Told Me (1975) and One Man (1977).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0493706","name":"Carol Lazare","idIMDB":"nm0493706"},"actorId":"nm0493706","character":"Nurse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shawn Hewitt","urlProfile":"http://www.imdb.com/name/nm0382087","urlPhoto":"","biography":{"bio":"Shawn Hewitt is an actor, known for The Fly (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0382087","name":"Shawn Hewitt","idIMDB":"nm0382087"},"actorId":"nm0382087","character":"Clerk","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0091064","urlIMDB":"http://www.imdb.com/title/tt0091064","business":{"budget":{"money":"$15,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$7,007,423","country":"USA","day":"17","month":"08","year":"1986","remarks":"1,195 Screens"},{"money":"£83,004","country":"UK","day":"15","month":"02","year":"1987","remarks":"2 Screens"}],"gross":[{"money":"$20,172,594 (Worldwide)","country":"except","day":null,"month":null,"year":null,"remarks":null},{"money":"SEK","country":"3,645,688","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1985/\">1985</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 36 min (96 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arriflex Cameras"],"laboratory":["DeLuxe, USA"],"filmLength":["2,623 m (Sweden)","2,626 m (Finland)"],"negativeFormat":["35 mm (Eastman 125T 5247, 400T 5294)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm (Eastman 5384)"]},"rating":"7.5","metascore":"79","filmingLocations":[{"location":"135 Liberty Steet, Toronto, Ontario, Canada"}],"rated":"R","awards":[{"award":"Academy Awards, USA 1987","titlesAwards":[{"titleAwardOutcome":"Won Oscar","categories":[{"category":"Best Makeup","names":[{"name":"Chris Walas","id":"nm0906901","role":null},{"name":"Stephan Dupuis","id":"nm0243518","role":null}]}]}]},{"award":"BAFTA Awards 1988","titlesAwards":[{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best Make Up Artist","names":[{"name":"Chris Walas","id":"nm0906901","role":null},{"name":"Stephan Dupuis","id":"nm0243518","role":null}]},{"category":"Best Special Effects","names":[{"name":"Chris Walas","id":"nm0906901","role":null},{"name":"Jon Berg","id":"nm0073802","role":null},{"name":"Louis Craig","id":"nm0185942","role":null},{"name":"Hoyt Yeatman","id":"nm0947087","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Classic Film DVD Release","names":[]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1987","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best Horror Film","names":[]},{"category":"Best Actor","names":[{"name":"Jeff Goldblum","id":"nm0000156","role":null}]},{"category":"Best Make-Up","names":[{"name":"Chris Walas","id":"nm0906901","role":null}]}]},{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Actress","names":[{"name":"Geena Davis","id":"nm0000133","role":null}]},{"category":"Best Director","names":[{"name":"David Cronenberg","id":"nm0000343","role":null}]},{"category":"Best Music","names":[{"name":"Howard Shore","id":"nm0006290","role":null}]}]}]},{"award":"Avoriaz Fantastic Film Festival 1987","titlesAwards":[{"titleAwardOutcome":"Won Special Jury Award","categories":[{"category":"","names":[{"name":"David Cronenberg","id":"nm0000343","role":null}]}]}]},{"award":"Canadian Society of Cinematographers Awards 1987","titlesAwards":[{"titleAwardOutcome":"Won CSC Award","categories":[{"category":"Best Cinematography in Theatrical Feature","names":[{"name":"Mark Irwin","id":"nm0410419","role":null}]}]}]},{"award":"Fantasporto 1987","titlesAwards":[{"titleAwardOutcome":"Nominated International Fantasy Film Award","categories":[{"category":"Best Film","names":[{"name":"David Cronenberg","id":"nm0000343","role":null}]}]}]},{"award":"Hugo Awards 1987","titlesAwards":[{"titleAwardOutcome":"Nominated Hugo","categories":[{"category":"Best Dramatic Presentation","names":[{"name":"David Cronenberg","id":"nm0000343","role":"screenplay/director"},{"name":"Charles Edward Pogue","id":"nm0688279","role":"screenplay"},{"name":"George Langelaan","id":"nm0486228","role":"story"}]}]}]},{"award":"National Board of Review, USA 1986","titlesAwards":[{"titleAwardOutcome":"Nominated NBR Award","categories":[{"category":"Top Ten Films","names":[]}]}]},{"award":"National Society of Film Critics Awards, USA 1987","titlesAwards":[{"titleAwardOutcome":"2nd place NSFC Award","categories":[{"category":"Best Actor","names":[{"name":"Jeff Goldblum","id":"nm0000156","role":null}]}]}]},{"award":"New York Film Critics Circle Awards 1986","titlesAwards":[{"titleAwardOutcome":"3rd place NYFCC Award","categories":[{"category":"Best Actor","names":[{"name":"Jeff Goldblum","id":"nm0000156","role":null}]}]}]}],"votes":"125,444","type":"Movie","companyCreditsSimple":[{"idCompany":"co0142386","name":"SLM Production Group"},{"idCompany":"co0000858","name":"Brooksfilms"}],"keywords":{"keywords":["psychotronic","cult film","scientist","eccentric scientist","experiment","teleportation","mutant","reporter","science","laboratory","assisted suicide","suicide","removing a fingernail","latex gloves","medical mask","dental mask","surgical mask","falling in love","interview","ex lover","ground fog","ex boyfriend","loft apartment","countdown timer","crying","orchestral music score","woman takes off stocking","woman wearing only a man's shirt","cult director","genetic engineering","physicist","wall climbing","arm ripped off","super strength","strange behavior","famous line","scissors","back hair","stalking","turned inside out","stocking","voice recognition","doomed romance","animal experimentation","intestines","lifting a female into the air","lifting an adult into the air","pleading","heartbreaking","paranoia","dream","jaw ripped off","gothic","lifting someone into the air","body horror","genetic alteration","science runs amok","metamorphosis","experiment gone wrong","social commentary","fable","nightmare","monster as victim","true love","teeth","dark humor","abortion","tragic love","superhuman strength","steak","medicine cabinet","magazine","love triangle","jealousy","fingernail","ear","computer","baboon","allegory","shotgun","exploding head","pregnancy","monster","mad scientist","editor","hospital","mutation","remake","moral ambiguity","arm wrestling","botched teleportation","tragedy","first part","removing nylon stocking","canadian science fiction","creature feature","1980s","sex scene","cyberpunk","reference to typhoid mary","slow motion scene","blurred boundaries","grand guignol","male nudity","male rear nudity","briefs","male underwear","bare chested male","defenestration","horror movie remake","gore","remake of cult film","death wish"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:25:51"}}