{"data":{"movies":[{"title":"Counsellor at Law","originalTitle":"","year":"1933","releaseDate":"19331225","directors":[{"name":"William Wyler","id":"nm0943758"}],"writers":[{"name":"Elmer Rice","id":"nm0723418"},{"name":"Elmer Rice","id":"nm0723418"}],"runtime":"82 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNTI3MTMxOV5BMl5BanBnXkFtZTgwMjY0OTgzMjE@._V1.jpg","countries":["USA"],"languages":["English","Italian","Yiddish"],"genres":["Drama"],"plot":"Crackerjack lawyer George Simon is a workaholic, and a successful one, at that. Having just gotten a woman acquited of a murder charge, he is juggling cases ranging from breaking a will to quashing the disorderly conduct charges against the son of a woman he knew in the old neighborhood, before he became a hot shot counsellor. He adores his wife Cora, who feels she married a bit below her station. His step-children think so, too. His secretary Rexy adores him, although he is oblivious to the fact. Threatened with losing his practice due to a discretion in a case seven years earlier, his wife leaves for Europe until the scandal blows over, and he comes to realize (just in time) who his true friends are.","simplePlot":"Successful attorney has his Jewish heritage and poverty-stricken background brought home to him when he learns his wife has been unfaithful.","actors":[{"actorName":"John Barrymore","urlProfile":"http://www.imdb.com/name/nm0000858","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMTc5NzMwNV5BMl5BanBnXkFtZTYwNzAwNTQ2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 February 1882","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"John Sidney Blyth","height":"5' 10\" (1.78 m)","bio":"American stage and screen actor whose rise to superstardom and subsequent decline is one of the legendary tragedies of Hollywood. A member of the most famous generation of the most famous theatrical family in America, he was also its most acclaimed star. His father was Maurice Blyth (or Blythe; family spellings vary), a stage success under the name 'Maurice Barrymore'. His mother, Georgie Drew, was the daughter of actor John Drew. Although well known in the theatre, Maurice and Georgie were eclipsed by their three children, John, Lionel Barrymore, and Ethel Barrymore, each of whom became legendary stars. John was handsome and roguish. He made his stage debut at 18 in one of his father's productions, but was much more interested in becoming an artist. Briefly educated at King's College, Wimbledon, and at New York's Art Students League, Barrymore worked as a freelance artist and for a while sketched for the New York Evening Journal. Gradually, though, the draw of his family's profession ensnared him and by 1905 he had given up professional drawing and was touring the country in plays. He survived the 1906 San Francisco earthquake and in 1909 became a major Broadway star in \"The Fortune Hunter.\" In 1922, Barrymore became his generation's most acclaimed Hamlet, in New York and London. But by this time he had become a frequent player in motion pictures. His screen debut supposedly came in An American Citizen (1914), though records of several lost films indicate he may have made appearances as far back as 1912. He became every bit the star of films that he was on stage, eclipsing his siblings in both arenas. Though his striking matinee-idol looks had garnered him the nickname \"The Great Profile\", he often buried them under makeup or distortion in order to create memorable characters of degradation or horror. He was a romantic leading man into the early days of sound films, but his heavy drinking (since boyhood) began to take a toll, and he degenerated quickly into a man old before his time. He made a number of memorable appearances in character roles, but these became over time more memorable for the humiliation of a once-great star than for his gifts. His last few films were broad and distasteful caricatures of himself, though in even the worst, such as Playmates (1941), he could rouse himself to a moving soliloquy from Hamlet. He died in 1942, mourned as much for the loss of his life as for the loss of grace, wit, and brilliance which had characterized his career at its height.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMTc5NzMwNV5BMl5BanBnXkFtZTYwNzAwNTQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000858","name":"John Barrymore","nicknames":["The Great Profile","Jack"],"idIMDB":"nm0000858"},"actorId":"nm0000858","character":"George Simon","urlCharacter":"http://www.imdb.com/character/ch0210682","main":true},{"actorName":"Bebe Daniels","urlProfile":"http://www.imdb.com/name/nm0199841","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3OTI5NDc5M15BMl5BanBnXkFtZTYwMjY1MjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 January 1901","placeOfBirth":" Dallas, Texas, USA","birthName":"Phyllis Virginia Daniels","height":"5' 2\" (1.57 m)","bio":"Bebe Daniels already had toured as an actor by the age of four in a stage production of \"Richard III\". She had her first leading role at the age of seven and started her film career shortly after this in movies for Imperial, Pathe and others. At 14 she was already a film veteran, and was enlisted by Hal Roach to star as Harold Lloyd's leading lady in his \"Lonesome Luke\" shorts, distributed by Pathe. Lloyd fell hard for Bebe and seriously considered marrying her, but her drive to pursue a film career along with her sense of independence clashed with Lloyd's Victorian definition of a wife. The two eventually broke up but would remain lifelong friends. Bebe was sought out for stardom by Cecil B. DeMille, who literally pestered her into signing with Paramount. Unlike many actors, the arrival of sound posed no problem for her; she had a beautiful singing voice and became a major musical star, with such hits sd Rio Rita (1929) and 42nd Street (1933). In 1930 she married Ben Lyon, with whom she went to England in the mid-'30s, where she became a successful West End stage star. She and her husband also had their own radio show in London, and became the most popular radio team in the country--especially during World War II, when they refused to return to the US and stayed in London, broadcasting even during the worst of the \"blitz\". They later appeared in several British films together as their radio characters. Her final film was one in that series, The Lyons Abroad (1955).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3OTI5NDc5M15BMl5BanBnXkFtZTYwMjY1MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0199841","name":"Bebe Daniels","idIMDB":"nm0199841"},"actorId":"nm0199841","character":"Regina 'Rexy' Gordon","urlCharacter":"http://www.imdb.com/character/ch0210692","main":true},{"actorName":"Doris Kenyon","urlProfile":"http://www.imdb.com/name/nm0448987","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM2Nzk2OTAwOF5BMl5BanBnXkFtZTgwMjg0ODY3MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 September 1897","placeOfBirth":" Syracuse, New York, USA","birthName":"Doris Margaret Kenyon","height":"5' 6\" (1.68 m)","bio":"The daughter of a poet, Doris Kenyon made her stage and screen debuts in 1915. She was often cast as a pleasant heroine in many silent films. She co-starred with popular silent-era actors like Rudolph Valentino and her future husband Milton Sills. Due to her stage experience she made a smooth transition to sound films. She could still be seen on television in the mid-'60s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM2Nzk2OTAwOF5BMl5BanBnXkFtZTgwMjg0ODY3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0448987","name":"Doris Kenyon","idIMDB":"nm0448987"},"actorId":"nm0448987","character":"Cora Simon","urlCharacter":"http://www.imdb.com/character/ch0203204","main":true},{"actorName":"Isabel Jewell","urlProfile":"http://www.imdb.com/name/nm0422436","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NDgzMDU3N15BMl5BanBnXkFtZTcwNTcwODY5Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 July 1907","placeOfBirth":" Shoshoni, Wyoming, USA","height":"4' 11\" (1.5 m)","bio":"Isabel Jewell, like other actresses in Hollywood in the 1930s, suffered from chronic typecasting. The diminutive, platinum-haired daughter of a doctor and medical researcher seemed to be forever playing hard-boiled, tough-talking broads: gangster's molls, dumb blondes, prostitutes and, of course, poor \"white trash\" Emmy Slattery in Gone with the Wind (1939). While stardom eluded her for the most part, she nonetheless remained a busy supporting actress with an impressive array of A-budget films to her credit. Signed as an MGM contract player, she reputedly earned up to $3,000 a week -- a small fortune at the time. Isabel was educated at St. Mary's Academy in Minnesota and at Hamilton College in Kentucky. After years in stock companies (including an 87-week stint in Lincoln, Nebraska), she hit the big time after getting a part on Broadway in \"Up Pops the Devil\" (1930). With just three hours of rehearsal time, she delivered her performance to great critical acclaim and had even better reviews as a fast-talking telephone operator in \"Blessed Event\". She reprised this role in the screen version of Blessed Event (1932) and her movie career was effectively launched. While her parts were often small, they could also be memorable, as in Ceiling Zero (1936) and Marked Woman (1937). Other acting highlights include her consumptive prostitute finding salvation in Lost Horizon (1937), and her poignant against-type performance as an ill-fated seamstress on her way to the guillotine in A Tale of Two Cities (1935). In the 1940s and '50s, her roles diminished from small to bits to uncredited and she fell on hard times: in 1959 she got into trouble with the law in Las Vegas for passing bad checks and, two years later, spent five days in jail for drunk driving. She was found dead in her home in April 1972, aged just 64. One of her two former husbands was writer-producer-director Owen Crump (1903-1998). A lasting memory of Isabel Jewell is her star on the Hollywood Walk of Fame on Vine Street.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NDgzMDU3N15BMl5BanBnXkFtZTcwNTcwODY5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0422436","name":"Isabel Jewell","idIMDB":"nm0422436"},"actorId":"nm0422436","character":"Bessie Green","urlCharacter":"http://www.imdb.com/character/ch0210693","main":true},{"actorName":"Melvyn Douglas","urlProfile":"http://www.imdb.com/name/nm0002048","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MDMxMDAxMV5BMl5BanBnXkFtZTYwODg1NDQ2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 April 1901","placeOfBirth":" Macon, Georgia, USA","birthName":"Melvyn Edouard Hesselberg","height":"6' 1½\" (1.87 m)","bio":"Two-time Oscar-winner Melvyn Douglas was one of America's finest actors. In addition to his two Oscars, he also won a Tony Award and an Emmy. Douglas would enjoy cinema immortality if for no other reason than his being the man who made Greta Garbo laugh in Ernst Lubitsch's classic comedy Ninotchka (1939), but he was much, much more. He was born Melvyn Edouard Hesselberg on April 5, 1901, in Macon, Georgia. His father, Edouard Gregory Hesselberg, was a Latvian Jewish immigrant (from Riga). His mother, Lena Priscilla (Shackelford), from Clark Furnace, Tennessee, was from a family with deep roots in the United States, and the daughter of a Col. George Taliaferro Shackelford; she had English ancestry (including antecedents who were Mayflower passengers), and remote Italian roots (from the Taliaferro family). Melvyn's father was a concert pianist who supported his family by teaching music at university-based conservatories. Melvyn dropped out of high school to pursue his dream of becoming an actor. He made his Broadway debut in the drama \"A Free Soul \" at the Playhouse Theatre on January 12, 1928, playing the role of a raffish gangster (a part that would later make Clark Gable's career when the play was adapted to the screen as A Free Soul (1931) ). \"A Free Soul\" was a modest success, running for 100 performances. His next three plays were flops: \"Back Here\" and \"Now-a-Days\" each lasted one week, while \"Recapture\" lasted all of three before closing. He was much luckier with his next play, \"Tonight or Never,\" which opened on November 18, 1930, at legendary producer David Belasco's theater. Not only did the play run for 232 performances, but Douglas met the woman who would be his wife of nearly 50 years: his co-star, Helen Gahagan. They were married in 1931. The movies came a-calling in 1932 and Douglas had the unique pleasure of assaying completely different characters in widely divergent films. He first appeared opposite his future Ninotchka (1939) co-star Greta Garbo in the screen adaptation of Luigi Pirandello's As You Desire Me (1932), proving himself a sophisticated leading man as, aside from his first-rate performance, he was able to shine in the light thrown off by Garbo, the cinema's greatest star. In typical Hollywood fashion, however, this terrific performance in a top-rank film from a major studio was balanced by his appearance in a low-budget horror film for the independent Mayfair studio, The Vampire Bat (1933). However, the leading man won out, and that's how he first came to fame in the 1930s in such films as She Married Her Boss (1935) and Garbo's final film, Two-Faced Woman (1941). Douglas had shown he could play both straight drama and light comedy. Douglas was a great liberal and was a pillar of the anti-Nazi Popular Front in the Hollywood of the 1930s. A big supporter of President Franklin D. Roosevelt, he and his wife Helen were invited to spend a night at the White House in November 1939. Douglas' leftism would come back to haunt him after the death of FDR. Well-connected with the Roosevelt White House, Douglas served as a director of the Arts Council in the Office of Civilian Defense before joining the Army during World War II. He was very active in politics and was one of the leading lights of the anti-Communist left in the late 1930s and early 1940s. Helen Gahagan Douglas, who also was politically active, was elected to Congress from the 14th District in Los Angeles in 1944, the first of three terms. Returning to films after the war, Douglas' screen persona evolved and he took on more mature roles, in such films as The Sea of Grass (1947) (Elia Kazan's directorial debut) and Mr. Blandings Builds His Dream House (1948). His political past caught up with him, however, in the late 1940s, and he - along with fellow liberals Edward G. Robinson and Henry Fonda (a registered Republican!) - were \"gray-listed\" (not explicitly blacklisted, they just weren't offered any work). The late 1940s brought the House Un-American Activities Committee (HUAC) to Hollywood, a move that sowed the seeds of the McCarthy anti-red hysteria that would wrack Hollywood and sweep America in the 1950s. In 1950, Helen Gahagan Douglas ran as a Democrat for the U.S. Senate and was opposed by the Republican nominee, a small-time red-baiting candidate from Whittier named Richard Nixon. While Nixon did not go so far as to accuse her of actually being a Communist, he did charge her with being soft on Communism due to her opposition to HUAC and her stance insisting that the U.S. improve its relations with the USSR. Nixon tarred her as a fellow traveler of Communists, a pinko who was \"pink right down to her underwear.\" Her opponent in the Democratic primary had given her the nickname \"The Pink Lady\", erroneously attributed to Nixon. But it was Helene Gahagan Douglas who gave Nixon his most famous nickname, \"Tricky Dicky\". While many historians have written that she was defeated by Nixon because of his unethical behavior and dirty campaign tactics, her pro-Soviet, anti-Cold War stance had alienated President Harry S. Truman, who had refused to campaign for her, and other Democratic Cold Warriors like Congressman John F. Kennedy, who hailed the election of fellow-Cold Warrior Nixon to the Senate. The blacklist was implemented by Hollywood in 1947, after the HUAC grilling of the Hollywood help led to the \"exposure\" and subsequent persecution of the Hollywood 10. The post-World War II Red Scare targeted New Deal liberals as much as actual, genuine communists in a push to roll back liberalism, and Douglas was a marked man. After appearing in six films as a leading man and second lead in A-List pictures from 1947-49, Douglas made just two films in the decade of the 1950s - supporting roles at RKO in 1951 - until he reappeared a decade later in Peter Ustinov's Billy Budd (1962) in 1962. In the meantime, Douglas did play the eponymous private detective in the TV series Steve Randall (1952) in the 1952-53 season for the doomed DuMont network, which failed the next year, and, following the example of his old friend Reagan in his stint on General Electric Theater (1953), appeared as the host of the western omnibus TV series Frontier Justice (1958) in 1958. Throughout the 1950s Douglas secured roles on such prestigious omnibus drama showcases as Playhouse 90 (1956) and even appeared on Reagan's General Electric Theater (1953). Then there was the theater. Douglas made many appearances on Broadway in the 1940s and 1950s, including in a notable 1959 flop, making his musical debut playing Captain Boyle in Marc Blitzstein's \"Juno.\" The musical, based on Sean O'Casey's play \"Juno and the Paycock\", closed in less than three weeks. Douglas was much luckier in his next trip to the post: he won a Tony for his Broadway lead role in the 1960 play \"The Best Man\" by Gore Vidal. In 1960, with the election of the Democratic President John F. Kennedy, the erstwhile Nixon supporter who had defeated Tricky Dicky for the Big Brass Ring of American electoral politics. About this time, as the civil rights movement became stronger and found more support among Democrats and the Kennedy administration, former liberal activist and two-term Screen Actors Guild president Reagan was in the process of completing his evolution into a right-wing Republican. Reagan and Douglas' friendship lapsed. After Reagan was elected President of the United States in 1980, Douglas said of his former friend that Reagan had begun to believe in the pro-business speeches he delivered for General Electric when he was the host of the General Electric Theater (1953). Douglas' own evolution into a premier character actor was completed by the early 1960s. His years of movie exile seemed to deepen him, making him richer, and he returned to the big screen a more authoritative actor. For his second role after coming off of the graylist, he won a Best Supporting Actor Oscar as Paul Newman's father in Hud (1963). Other films in which he shined were Paddy Chayefsky's The Americanization of Emily (1964), CBS Playhouse (1967) (a 1967 episode directed by George Schaefer called \"Do Not Go Gentle Into That Good Night\", for which he won a Best Actor Emmy) and The Candidate (1972), in which he played Robert Redford's father. It was for his performance playing Gene Hackman's father that Douglas got his sole Best Actor Academy Award nod, in I Never Sang for My Father (1970). He had a career renaissance in the late 1970s, appearing in The Seduction of Joe Tynan (1979), Being There (1979) and Ghost Story (1981). He won his second Oscar for \"Being There.\" Helen Gahagan Douglas died in 1980 and Melvyn followed her in 1981. He was 80 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MDMxMDAxMV5BMl5BanBnXkFtZTYwODg1NDQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002048","name":"Melvyn Douglas","idIMDB":"nm0002048"},"actorId":"nm0002048","character":"Roy Darwin","urlCharacter":"http://www.imdb.com/character/ch0210689","main":true},{"actorName":"Onslow Stevens","urlProfile":"http://www.imdb.com/name/nm0828668","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjI5ZDhjNzYtMjI1OC00NmQ4LTkzNDAtNGE1MGRlNzYyNTljL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 March 1902","placeOfBirth":" Los Angeles, California, USA","birthName":"Onslow Ford Stevenson","height":"6' 2\" (1.88 m)","bio":"Son of character actor Houseley Stevenson, brother of designer Edward Stevenson and actor Houseley Stevenson Jr., Onslow Stevens was highly active from mid-1920s at the Pasadena Community Playhouse, where his entire family worked frequently as performers, directors and teachers. he scored a major success on Broadway in \"Stage Door\" in 1936. He played many leading roles and even more character parts over the years. Although at first a stalwart and reliable figure in films, in later years his career was adversely affected by alcohol. Nevertheless, he was a familiar and respected performer for many years. His final months were spent in a Van Nuys, California, nursing home where, in November 1976, he suffered a broken hip under unclear circumstances. Pneumonia set in and he died in January 1977. A coroner's inquest ruled that the broken hip had occurred \"at the hands of another, not an accident.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjI5ZDhjNzYtMjI1OC00NmQ4LTkzNDAtNGE1MGRlNzYyNTljL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0828668","name":"Onslow Stevens","idIMDB":"nm0828668"},"actorId":"nm0828668","character":"John P. Tedesco","urlCharacter":"http://www.imdb.com/character/ch0210694","main":true},{"actorName":"Thelma Todd","urlProfile":"http://www.imdb.com/name/nm0865298","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5Mjk4ODc5MF5BMl5BanBnXkFtZTgwODQyNjc3MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1906","placeOfBirth":" Lawrence, Massachusetts, USA","height":"5' 4\" (1.63 m)","bio":"Thelma Todd was born in Lawrence, Massachusetts, an industrial city near the New Hampshire state line. She was a lovely child with good academic tendencies, so much so that she decided early on to become a schoolteacher. After high school she went on to college but at her mother's insistence entered several beauty contests (apparently her mother wanted her to be more than just a \"schoolmarm\"). Thelma was so successful in these endeavors that she entered on the state level and won the title of \"Miss Massachusetts\" in 1925 and went on to the \"Miss America\" pageant. Although she didn't win, the pageant afforded her a chance to be seen been by talent scouts looking for fresh new faces to showcase in films. She began appearing in one- and two-reel shorts, mostly comedy, which showcased her keen comic timing and aptitude for physical comedy (unusual in such a beautiful woman). She had been making shorts for Hal Roach when she was signed to Paramount Pictures. Her first film--at 21 years of age--was as Lorraine Lane in 1927's Fascinating Youth (1926), a romantic comedy, which was Paramount's showcase vehicle for its new stars. Thelma received minor billing in another film that year, God Gave Me Twenty Cents (1926). The next year she starred with Gary Cooper and William Powell in the western Nevada (1927). That year also saw her in three more films, with The Gay Defender (1927) being the most notable. It starred Richard Dix in the role of a man falsely accused of murder. As the 1920s closed, Thelma began getting parts in more and more films. In 1928 and 1929 alone she was featured in 20 pictures, and not just comedies--she also did dramas and gothic horror films. Unlike many silent-era stars whose voices didn't fit their image or screen persona, Thelma's did. She had a bright, breezy, clear voice with a pleasant trace of a somewhat aristocratic, but not snobbish, New England accent and easily made the transition to sound films. In 1930 she added 14 more pictures to her resume, with Dollar Dizzy (1930) and Follow Thru (1930) being the most notable. The latter was a musical with Thelma playing a rival to Nancy Carroll for the affections of Buddy Rogers. It was a box-office hit, as was the stage production on which it was based. The following year Thelma appeared in 14 more films, among them Let's Do Things (1931), Speak Easily (1932), The Old Bull (1932) and On the Loose (1931). Her most successful film that year, however, was the Marx Brothers farce Monkey Business (1931). While critics gave the film mixed reviews, the public loved it. In 1932 Thelma appeared in another Marx Brothers film directed by Norman Z. McLeod, Horse Feathers (1932). She also starred in This Is the Night (1932), a profitable film which featured Cary Grant in his first major role. In 1934 Thelma made 16 features, but her career would soon soon come to a grinding halt. In 1935 she appeared in such films as Twin Triplets (1935) and The Misses Stooge (1935), all showcasing her considerable comic talents. She also proved to be a savvy businesswoman with the opening of \"Thelma Todd's Sidewalk Cafe,\" a nightclub/restaurant that catered to show business people. It also, unfortunately, attracted some shady underworld types as well, and there were rumors that they were trying to take over her club and use it as a gambling establishment in order to fleece the wealthy Hollywood crowd. According to these stories, Thelma and her boyfriend, director Roland West, wouldn't sell their establishment once they found out what the gangsters had in mind, thereby incurring the enmity of people it was not a good idea to become enemies of. Whether the stories were true or not, on December 16, 1935, Thelma was found dead in her car in her garage in Los Angeles. Her death was ruled a suicide owing to carbon monoxide poisoning. She was only 29 years old. At the time, as today, many felt that her death was actually a murder connected to the goings-on at her club, a theory that was lent credence by the fact that no one who knew her had ever seen her depressed or morose enough to worry about her committing suicide. Another factor that aroused suspicion was that her death was given a cursory investigation by the--at the time--notoriously corrupt Los Angeles County District Attorney's Office and the case was quickly and unceremoniously closed. Her death has remained a controversial one even to this day. Three films she made before her death weren't released until the following year: Hot Money (1936), An All American Toothache (1936), and The Bohemian Girl (1936). The latter saw her quite substantial role cut down so much that she was barely glimpsed in the picture. Thelma had made an amazing 115 films in such a short career, and her beauty and talent would no doubt have taken her right to the top if it hadn't been for her untimely demise.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5Mjk4ODc5MF5BMl5BanBnXkFtZTgwODQyNjc3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0865298","name":"Thelma Todd","nicknames":["The Ice Cream Blonde","Hot Toddy"],"idIMDB":"nm0865298"},"actorId":"nm0865298","character":"Lillian La Rue","urlCharacter":"http://www.imdb.com/character/ch0210695","main":true},{"actorName":"Clara Langsner","urlProfile":"http://www.imdb.com/name/nm0486699","urlPhoto":"","biography":{"dateOfBirth":"30 November 1883","placeOfBirth":" Galicia, Austria-Hungary","bio":"Clara Langsner was born on November 30, 1883 in Galicia, Austria-Hungary. She is an actress, known for Counsellor at Law (1933), A Perfect Match (1930) and Personal Maid (1931).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0486699","name":"Clara Langsner","idIMDB":"nm0486699"},"actorId":"nm0486699","character":"Lena Simon","urlCharacter":"http://www.imdb.com/character/ch0210686","main":true},{"actorName":"John Hammond Dailey","urlProfile":"http://www.imdb.com/name/nm0197325","urlPhoto":"","biography":{"dateOfBirth":"20 July 1877","placeOfBirth":" Providence, Rhode Island, USA","bio":"John Hammond Dailey was born on July 20, 1877 in Providence, Rhode Island, USA. He was an actor, known for Counsellor at Law (1933). He died on January 14, 1940 in New York City, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0197325","name":"John Hammond Dailey","idIMDB":"nm0197325"},"actorId":"nm0197325","character":"Charlie McFadden","urlCharacter":"http://www.imdb.com/character/ch0210696","main":true},{"actorName":"Mayo Methot","urlProfile":"http://www.imdb.com/name/nm0582551","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MzQ4NTgxM15BMl5BanBnXkFtZTYwMjA5MjQ2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 March 1904","placeOfBirth":" Portland, Oregon, USA","height":"5' 2\" (1.57 m)","bio":"Mayo Methot was born on March 3, 1904 in Portland, Oregon, USA. She was an actress, known for Marked Woman (1937), The Night Club Lady (1932) and Virtue (1932). She was married to Humphrey Bogart, Percy Tredegar Morgan Jr. and John M. La Mond. She died on June 9, 1951 in Portland.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MzQ4NTgxM15BMl5BanBnXkFtZTYwMjA5MjQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0582551","name":"Mayo Methot","nicknames":["Sluggy"],"idIMDB":"nm0582551"},"actorId":"nm0582551","character":"Zedorah Chapman","urlCharacter":"http://www.imdb.com/character/ch0210700","main":true},{"actorName":"Robert Gordon","urlProfile":"http://www.imdb.com/name/nm0330036","urlPhoto":"","biography":{"dateOfBirth":"21 August 1913","placeOfBirth":" Pittsburgh, Pennsylvania, USA","height":"5' 6\" (1.68 m)","bio":"Robert Gordon was born on August 21, 1913 in Pittsburgh, Pennsylvania, USA. He was a director and actor, known for It Came from Beneath the Sea (1955), The Joe Louis Story (1953) and The Gatling Gun (1971). He was married to Sophia Levine. He died on December 1, 1990 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0330036","name":"Robert Gordon","idIMDB":"nm0330036"},"actorId":"nm0330036","character":"Henry Susskind","urlCharacter":"http://www.imdb.com/character/ch0210704","main":true},{"actorName":"Malka Kornstein","urlProfile":"http://www.imdb.com/name/nm0466520","urlPhoto":"","biography":{"bio":"Malka Kornstein is an actress, known for Counsellor at Law (1933).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0466520","name":"Malka Kornstein","idIMDB":"nm0466520"},"actorId":"nm0466520","character":"Sarah Becker","urlCharacter":"http://www.imdb.com/character/ch0210706","main":true},{"actorName":"Vincent Sherman","urlProfile":"http://www.imdb.com/name/nm0792605","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2U2YzYxMjQtZTJiMi00YjY1LTg2M2EtOWNmYzNjZmI5ZGEyXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1906","placeOfBirth":" Vienna, Georgia, USA","birthName":"Abraham Orovitz","bio":"Vincent Sherman was born on July 16, 1906 in Vienna, Georgia, USA as Abraham Orovitz. He was a director and actor, known for Mr. Skeffington (1944), The Young Philadelphians (1959) and Adventures of Don Juan (1948). He was married to Hedda Comoro. He died on June 18, 2006 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2U2YzYxMjQtZTJiMi00YjY1LTg2M2EtOWNmYzNjZmI5ZGEyXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0792605","name":"Vincent Sherman","idIMDB":"nm0792605"},"actorId":"nm0792605","character":"Harry Becker","urlCharacter":"http://www.imdb.com/character/ch0210699","main":true},{"actorName":"Marvin Kline","urlProfile":"http://www.imdb.com/name/nm0459648","urlPhoto":"","biography":{"bio":"Marvin Kline is an actor and writer, known for Counsellor at Law (1933), December Bride (1954) and Naked City (1958).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0459648","name":"Marvin Kline","idIMDB":"nm0459648"},"actorId":"nm0459648","character":"Herbert Howard Weinberg","urlCharacter":"http://www.imdb.com/character/ch0210703","main":true},{"actorName":"T.H. Manning","urlProfile":"http://www.imdb.com/name/nm0543382","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIyOGE3OWYtMTNjOS00ZmYxLWFjZDYtMmFjNGYyMjI5Njg4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"T.H. Manning is an actor, known for Street Scene (1931) and Counsellor at Law (1933).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIyOGE3OWYtMTNjOS00ZmYxLWFjZDYtMmFjNGYyMjI5Njg4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0543382","name":"T.H. Manning","idIMDB":"nm0543382"},"actorId":"nm0543382","character":"Peter J. Malone","urlCharacter":"http://www.imdb.com/character/ch0210698","main":true}],"seasons":[],"idIMDB":"tt0023911","urlIMDB":"http://www.imdb.com/title/tt0023911","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Universal Pictures Corp., 1934 (on print)"},"technical":{"runtime":["1 hr 22 min (82 min)"],"soundMix":["Mono (Western Electric Noiseless Recording Sound System)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.6","filmingLocations":[],"rated":"TV-G","awards":[],"votes":"918","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"}],"keywords":{"keywords":["secretary","lawyer","jewish","witness","cross examination","twist of fate","jewish american","crooked lawyer","ethics","perjury","suicide attempt","unrequited love","telephone operator","socialite","politician","office boy","new york city","mother son relationship","mixed marriage","law office","italian american","infidelity","false alibi","elevator operator","disbarment","detective","communist","brother","breaking and entering","breach of promise","blackmail","beating","adultery","courtroom","based on play"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:30:41"}}