{"data":{"movies":[{"title":"The Woman Who Sinned","originalTitle":"","year":"1991","releaseDate":"19911117","directors":[{"name":"Michael Switzer","id":"nm0842830"}],"writers":[{"name":"Stu Samuels","id":"nm0760522"},{"name":"Denne Bart Petitclerc","id":"nm0551933"}],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjA0MDQ5YmItZDc1Ni00ZDU5LWJmMTYtY2E3YjE1ZTFmZjliXkEyXkFqcGdeQXVyMjExMDIwNzA@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Thriller"],"plot":"A beautiful woman is falsely accused of her best friend's murder after an illicit affair while Michael and Victoria Robeson's secrets need to come out if the crime is to be solved.","simplePlot":"A beautiful woman is falsely accused of her best friend's murder after an illicit affair while Michael and Victoria Robeson's secrets need to come out if the crime is to be solved.","actors":[{"actorName":"Susan Lucci","urlProfile":"http://www.imdb.com/name/nm0005166","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5MDY5NDM3OF5BMl5BanBnXkFtZTcwMjE1MTMwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 December 1946","placeOfBirth":" Scarsdale, New York, USA","birthName":"Susan Victoria Lucci","height":"5' 2\" (1.57 m)","bio":"Susan Lucci was born on December 23, 1946, in Scarsdale, New York, to Jeanette (Granquist) and Victor Lucci, a building contractor. She is of Italian (father) and Swedish, German, and French (mother) descent. Susan grew up in Garden City. Since she can remember, she wanted to be a performer, and through her teenage years, took voice lessons, dance lessons, and participated in community theater. In high school she was the ideal student: took many honors classes, was a cheerleader, staff writer for the school newspaper, was a foreign exchange student to Norway, and performed in the school musicals, including lead roles in \"Oklahoma\" and \"The King and I\". After graduating with Honors from Garden City High School, she was accepted and attended Marymount College in Tarrytown, New York, which was noted for its theater program. After graduating with a BFA in theater arts, she moved to New York City, and began going to auditions. One of her first jobs was that of a color girl for CBS. Every day she would report to the studio, and sit on a stool, as technicians developed the new color cameras. Most of her acting work consisted of Off-Broadway understudy roles, day-player roles on soap operas, and extra and stand-in work for movies. In 1969 at the age of twenty-three, she auditioned for a brand new soap opera that was to be called All My Children (1970). She landed the role of Erica Kane, which is still considered by many critics to be one of the best roles on television written for women. Around this time, she met an married restaurant owner Helmut Huber. In 1978, Susan received her first Daytime Emmy nomination. She was nominated again in 1981, and nominated almost every year since then. In the early 1980s, she became the first soap opera actress to appear on the cover of major magazines, as well as the first to star in Movies of the Week. But what made her a household name by the late 1980s was her string of Emmy losses. It became a running joke that the 'Queen of Daytime Television' had no crown. It seems that every time that she would have a real knockout year, another daytime diva would have a more unique story line, or a more challenging acting role, including multiple personalities, or an actress playing more than one character. But in 1999, on her 19th Emmy nomination, she won. She received a four minute standing ovation. Now, after twenty one nominations, she is considered to be one of the most honored performers in the history of television, daytime or primetime.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5MDY5NDM3OF5BMl5BanBnXkFtZTcwMjE1MTMwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005166","name":"Susan Lucci","nicknames":["Looch","La Lucci","Daytime's Leading Lady","The Queen of Daytime"],"idIMDB":"nm0005166"},"actorId":"nm0005166","character":"Victoria Robeson","urlCharacter":"http://www.imdb.com/character/ch0338643","main":true},{"actorName":"Tim Matheson","urlProfile":"http://www.imdb.com/name/nm0001513","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNTEyNzU4Ml5BMl5BanBnXkFtZTgwMDI2MTY4MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1947","placeOfBirth":" Glendale, California, USA","birthName":"Timothy Lewis Matthieson","height":"6' 2\" (1.88 m)","bio":"Tim Matheson is an American actor, director and producer perhaps best known for his portrayal of the smooth talking 'Eric \"Otter\" Stratton' in the 1978 comedy, Animal House (1978), but has had a variety of other well-known roles both before and since, including critical accolades for his playing \"Vice President John Hoynes\" on the television series, The West Wing (1999), which garnered him two Primetime Emmy award nominations for Best Guest Star in a Drama Series. From 2011 to 2015, Matheson starred as 'Dr. Brick Breeland' in The CW series, Hart of Dixie (2011), opposite Rachel Bilson. He has and continues to direct several episodes each season throughout the series. Not limited to \"Hart of Dixie\", Matheson has made a career of directing an array of episodic projects on some of television's most prominent shows, including \"The Last Ship,\" \"Burn Notice,\" \"Criminal Minds,\" \"Without a Trace,\" \"Cold Case,\" \"Numbers,\" \"Drop Dead Diva,\" \"Suits,\" \"Eureka\" and \"White Collar,\" as well as pilots for Fox's \"The Good Guys\" and the USA Network successful original series \"Covert Affairs.\" Beginning his career at the age of 13, Matheson appeared in Robert Young's CBS nostalgia comedy series, Window on Main Street (1961), during the 1961-1962 television season. In 1964, he provided the voice of the lead character in the cartoon program Jonny Quest (1964), as well as the voice of \"Jace\" in the original animated series, Space Ghost (1966). Additionally, he played the role of the oldest son, \"Mike Beardsley\", in the film Yours, Mine and Ours (1968), which starred Lucille Ball and Henry Fonda. In 1969, Matheson joined the cast of NBC's western series, The Virginian (1962), in its eighth season, as \"Jim Horn\". During the final season of the television western Bonanza (1959) in 1972-1973, Matheson played \"Griff King\", a parolee who tries to reform his life as a worker at the Ponderosa Ranch under Ben Cartwright's watch. Following that, he portrayed young motorcycle cop \"Phil Sweet\", in the 1973 film, Magnum Force (1973). In the fall of 1976, Matheson was seen opposite Kurt Russell in the NBC series, The Quest (1976), the story of two young men in the American West seeking the whereabouts of their sister, a captive of the Cheyenne. In 1978, he co-starred in the acclaimed Animal House (1978), opposite John Belushi; the following year, he appeared alongside Belushi again in Steven Spielberg's 1941 (1979). Matheson and Catherine Hicks played \"Rick Tucker\" and \"Amanda Tucker\", who operate a detective agency in Laurel Canyon in CBS' Tucker's Witch (1982), which aired during the 1982-1983 season. He then appeared in the 1983 To Be or Not to Be (1983), starring Mel Brooks and Anne Bancroft and went on to star in the 1984 comedy, Up the Creek (1984) and 1985's Fletch (1985). Matheson, along with business partner 'Dan Grodnik', bought National Lampoon in 1989, when the magazine was facing financial decline. They were unable to reverse the magazine fortunes, however, and sold it in 1991. In 1996, Matheson took on the role of a con man who claims to be Carol Brady's thought-to-be-dead husband in A Very Brady Sequel (1996). Matheson was seen opposite Ryan Reynolds in the feature comedy Van Wilder: Party Liaison (2002) in 2002, playing the father of the title character, who was inspired by his own character in Animal House (1978), as a nod to the original film. He was born in Glendale, California, a suburb of Los Angeles, and has three wonderful children from former wife, Megan Murphy Matheson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNTEyNzU4Ml5BMl5BanBnXkFtZTgwMDI2MTY4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001513","name":"Tim Matheson","idIMDB":"nm0001513"},"actorId":"nm0001513","character":"Michael Robeson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Dudikoff","urlProfile":"http://www.imdb.com/name/nm0001154","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTI4ODQ0MzAtZWE3Yi00Y2E5LTk3OWQtZjRmN2ZkZGYxOWE5XkEyXkFqcGdeQXVyMjU2MzMxNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 October 1954","placeOfBirth":" Redondo Beach, California, USA","birthName":"Michael Joseph Stephen Dudikoff","height":"6' (1.83 m)","bio":"Michael Dudikoff was born on October 8, 1954 in Redondo Beach, California, USA as Michael Joseph Stephen Dudikoff. He is an actor, known for Platoon Leader (1988), American Ninja (1985) and Bachelor Party (1984). He has been married to Belle since September 18, 2004. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTI4ODQ0MzAtZWE3Yi00Y2E5LTk3OWQtZjRmN2ZkZGYxOWE5XkEyXkFqcGdeQXVyMjU2MzMxNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001154","name":"Michael Dudikoff","idIMDB":"nm0001154"},"actorId":"nm0001154","character":"Evan Ganns","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Vernon","urlProfile":"http://www.imdb.com/name/nm0006893","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNTM5MTQ1Ml5BMl5BanBnXkFtZTcwMzYwMzgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1932","placeOfBirth":" Zehner, Saskatchewan, Canada","birthName":"Adolphus Raymondus Vernon Agopsowicz","height":"6' 2\" (1.88 m)","bio":"John Vernon was a prolific stage-trained Canadian character player who made a career out of convincingly playing crafty villains, morally-bankrupt officials and heartless authority figures in American films and television since the 1960s. Vernon has been directed by some stellar filmmakers including Alfred Hitchcock (Topaz (1969)); George Cukor (Justine (1969)); Don Siegel (Dirty Harry (1971)) and Clint Eastwood (The Outlaw Josey Wales (1976)). After training at London's Royal Academy of Dramatic Art and honing his skills in Canadian theatre and television, Vernon made his US film debut in John Boorman's noir/gangster classic Point Blank (1967) as a trusted friend who betrays Lee Marvin. He again failed to inspire confidence as the ineffectual mayor of San Francisco in Dirty Harry (1971). Vernon may be best remembered as the sinister Dean Vernon Wormer in John Landis' Animal House (1978), a role he reprised for the TV spin-off Delta House (1979). This led to more film comedy roles, a highlight being Mr. Big in the blaxploitation spoof I'm Gonna Git You Sucka (1988).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNTM5MTQ1Ml5BMl5BanBnXkFtZTcwMzYwMzgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006893","name":"John Vernon","idIMDB":"nm0006893"},"actorId":"nm0006893","character":"Lieutenant Girvetz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christine Belford","urlProfile":"http://www.imdb.com/name/nm0067785","urlPhoto":"","biography":{"dateOfBirth":"14 January 1949","placeOfBirth":" Amityville, New York, USA","birthName":"Christina Riley","bio":"Christine Belford was born on January 14, 1949 in Amityville, New York, USA as Christina Riley. She is an actress, known for Christine (1983), Kenny Rogers as The Gambler (1980) and The Groundstar Conspiracy (1972). She has been married to Nicholas Pryor since July 1993.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0067785","name":"Christine Belford","idIMDB":"nm0067785"},"actorId":"nm0067785","character":"Randy Emerson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clayton Landey","urlProfile":"http://www.imdb.com/name/nm0484707","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MzcxODA0NV5BMl5BanBnXkFtZTgwMzMyNjA2MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"After 40 plays, 40 films, 180 TV episodes, and 85 commercials Clayton stopped counting. He has been a professional performer, actor, director, producer, writer and teacher for over 40 years. Recent film credits include Sully, Camera Store and A Sunday Horse. On Television he starred as Roger Barrow in the first season of 1st and Ten, the first scripted half hour comedy original series on HBO. He has had recurring roles in ten other TV series including 3 seasons as attorney James Westmont on Knots Landing and 1 year as the evil Gregory on Days of Our Lives. Other shows with multiple episodes include: Dynasty, Walker, Texas Ranger, Without a Trace, and Stargate: Atlantis and most recently If Loving You Is Wrong. As well as starring in the pilot for Used Cars and Guest Starring in the pilot SNOOPS his favorite Guest Starring roles include Becker, Designing Women, Star Trek: Deep Space Nine and JAG. Known to jokingly say his film career goes from A-Z (Assault of The Killer Bimbos to Zombie Strippers) his over 40 films and movies for television include favorites Norma Rae, Fatal Beauty, Pump Up the Volume and The Cisco Kid. His work has been represented at the Cannes (She's So Lovely) , Sundance (Shadow Hours) and Venice (The Reluctant Fundamentalist) Film Festivals. Norma Rae, Clayton's first feature, was named in 2011 to The Library of Congress National Film Registry. It is, however, (sad but) true that more people have probably seen him get sucked down the drain in The Blob than in any other role. He has appeared in over 40 theatrical productions in New York, Los Angeles, Atlanta and Dallas. He received a Drama-Logue Award, an LA Weekly Award, a Maddy, a Garland Award and a Los Angeles Drama Critics Circle nomination for his performance as Luther Adler in the critically acclaimed production of Names at the Matrix Theater in Los Angeles. He recreated the role the following season in the Off-Broadway production. He also received a Drama-Logue for producing the multi-award winning Andrea's Got Two Boyfriends. His training includes a BA in Drama from the University of Houston and Masters classes with Stella Adler, Marlon Brando and Darryl Hickman. He teaches Scene Study For The Working Actor at the Alliance Theater and Get The F**k Out of Your Head at The Rob Mello Studio. Clayton is Chair of The Muriel Moore/Danny Nelson SAG-AFTRA Conservatory. He served two terms on the Atlanta Local SAG-AFTRA Board, one as Secretary. Clayton is proud to be the voice of the Kennesaw State University Marching Owls in NCAA Division I football. He is happily married to World Ranked and record holding Masters Swimmer Leslie Landey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MzcxODA0NV5BMl5BanBnXkFtZTgwMzMyNjA2MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0484707","name":"Clayton Landey","idIMDB":"nm0484707"},"actorId":"nm0484707","character":"Larry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Everett","urlProfile":"http://www.imdb.com/name/nm0263577","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4NTU1ODQ4MDdeQTJeQWpwZ15BbWU4MDEwMTU2NTAy._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 October 1948","placeOfBirth":" Portland, Oregon, USA","height":"5' 9\" (1.75 m)","bio":"Graduate of The London Academy of Music and Dramatic Arts on an ITT International Fellowship in the Fulbright Competition, Tom is an accomplished country singer-songwriter (RCA album - \"Porchlight on in Oregon\" and the independently released \"Still Waters - (A collection of Years)), a Lifetime Member of The Actors Studio, and a first-rate chameleon character actor playing everything from white collar professionals to starring as Brian David Mitchell in the CBS television movie \"The Elizabeth Smart Story,\" to receiving glowing notices for his comedic work as a dweeb/nerd/gofer in \"Winning Isn't Everything\" at New York's Hudson Guild Theatre directed by legendary comedic director George Abbot, to playing southern white trash Alfredo in \"Leatherface: Texas Chainsaw Massacre 3.\" High profile roles include, but are not limited to, the scruffy 'George 'Gabby' Hayes'-like Sgt. Pepper in Dances with Wolves (1990), the straight-laced National Security Officer Jack Doherty in Air Force One (1997), and the black stovepipe-hatted Mosley Baker in The Alamo (2004). Everett has also created a whole host of other memorable, idiosyncratic characterizations, albeit in, perhaps, lesser known films: Assistant Coach to James Earl Jones in Best of the Best (1989), Rabbitt in Prison (1987) starring Viggo Mortensen, etc.. He's had the pleasure of working with directors and producers more than once including three films with Michael Bay (\"Pearl Harbor, \"Transformers,\" and \"The Island\"), three films with John Lee Hancock (including John Lee's first film \"Hard Time Romance,\" starring alongside Tom's friend Leon Rippy), several projects with Alex Graves, Kevin Falls, Jeff Burr, Michael Pressman, Kevin Costner, Frank Von Zerneck & Bob Sertner, Ian Sander, Jeff Morton, Renny Harlin, Peter Segal & Michael Ewing. Television audiences have seen him in many projects doing a variety of roles including as Rory Carmichael, the condemned Alabama death row inmate in the pilot episode of _\"The Beast\" (2001) directed by Mimi Leder, as the recurring character Charles Frost on \"West Wing\"_, and most recently as the recurring character Dr. Elliot Langley on \"Journeyman.\" He's also a cellist, guitarist and little-known humorist; in that last vein, and as a closet comedian, he recently had the pleasure of working with Judd Apatow and Paul Rudd in \"This Is Forty.\" He received scholarships to Jacob's Pillow Dance Festival, NYU School of the Arts where he received an MFA, Perry-Mansfield School of Drama and Dance, and is a native of Oregon, and the son of Viennese parents. Tom spent 12 years in New York honing his craft and acting in five Broadway plays, many off-Broadway & off-off Broadway & regional theatre ones too (including his being a Resident Member of The American Shakespeare Theatre in Stratford, Connecticut.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4NTU1ODQ4MDdeQTJeQWpwZ15BbWU4MDEwMTU2NTAy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0263577","name":"Tom Everett","idIMDB":"nm0263577"},"actorId":"nm0263577","character":"Sergeant Harper","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Sanderford","urlProfile":"http://www.imdb.com/name/nm0761438","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzMzcxODUwOTBeQTJeQWpwZ15BbWU4MDg4NTM4Njkx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 February 1952","placeOfBirth":" Florida, USA","bio":"John Sanderford was born on February 6, 1952 in Florida, USA. He is an actor, known for General Hospital (1963), Transformers: Revenge of the Fallen (2009) and Leprechaun (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzMzcxODUwOTBeQTJeQWpwZ15BbWU4MDg4NTM4Njkx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0761438","name":"John Sanderford","idIMDB":"nm0761438"},"actorId":"nm0761438","character":"Dr. Mark Longwell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lenore Kasdorf","urlProfile":"http://www.imdb.com/name/nm0440466","urlPhoto":"","biography":{"dateOfBirth":"27 July 1948","placeOfBirth":" Queens, New York, USA","bio":"1963-1965 attended International School of Bangkok, Thailand. Her father was a Colonel in the US Army stationed in Bangkok. Lenore attended during her sophmore and junior years and was a cheerleader.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0440466","name":"Lenore Kasdorf","idIMDB":"nm0440466"},"actorId":"nm0440466","character":"Jane Mary Woodman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Claudia Christian","urlProfile":"http://www.imdb.com/name/nm0160004","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU3OTY5MjM5Nl5BMl5BanBnXkFtZTgwMTkxODE0MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1965","placeOfBirth":" Glendale, California, USA","birthName":"Claudia Ann Christian","height":"5' 9\" (1.75 m)","bio":"Claudia Christian was born on August 10, 1965, in Glendale, California. Her family moved to Connecticut some afterwards. At age five, she was bitten by the acting bug when she played a Native American in a school play. After her family returned to California, she graduated high school at 16, and set out to start her acting career. She worked in a coffee house and then at a clothing store for two years before landing her first acting role on the soap Dallas (1978). In her next appearance, she played Kara in the television movie, Calendar Girl Murders (1984). Her big break came when she landed the part of \"Susan Ivanova\" on the science-fiction series Babylon 5 (1994). Her grandfather is a surgeon and her three older brothers are genetic engineers and veterinarians. Claudia enjoys listening to opera, painting, extreme sports, playing piano, collecting antiques and hosting dinner parties. She is fluent in French, Italian and German and enjoys acting in these languages. Claudia was voted \"sexiest woman in sci-fi\" by SFX Magazine in 1998.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU3OTY5MjM5Nl5BMl5BanBnXkFtZTgwMTkxODE0MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0160004","name":"Claudia Christian","idIMDB":"nm0160004"},"actorId":"nm0160004","character":"Judy Reinhardt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ian Patrick Williams","urlProfile":"http://www.imdb.com/name/nm0930787","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNjI1OTU0Ml5BMl5BanBnXkFtZTcwOTU5OTE5MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Ian Patrick Williams is an actor and writer, known for Dolls (1987), Re-Animator (1985) and Prison Break: The Final Break (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNjI1OTU0Ml5BMl5BanBnXkFtZTcwOTU5OTE5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0930787","name":"Ian Patrick Williams","idIMDB":"nm0930787"},"actorId":"nm0930787","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patricia Estrin","urlProfile":"http://www.imdb.com/name/nm0261921","urlPhoto":"","biography":{"dateOfBirth":"13 June 1949","placeOfBirth":" Youngstown, Ohio, USA","bio":"Patricia Estrin was born on June 13, 1949 in Youngstown, Ohio, USA. She is an actress, known for Another World (1964), Baby Boom (1987) and Act of Vengeance (1974).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0261921","name":"Patricia Estrin","idIMDB":"nm0261921"},"actorId":"nm0261921","character":"Jackie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kevin Page","urlProfile":"http://www.imdb.com/name/nm0656241","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyOTg0NjYzMl5BMl5BanBnXkFtZTcwNDc3NDYzMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Kevin Page is a 35 year veteran of the film, television, VO and commercial industries. Some of his career highlights include: His recurring character on \"Seinfeld\" as NBC executive, Stu Chermack, who invites Jerry to pitch his \"show about nothing\" was based on real-life NBC exec Rick Ludwin. And the enigmatic character \"Bum\" on the re-boot of \"Dallas\" (2012-2014) who ultimately shot and killed TV icon \"JR Ewing\" played by the late Larry Hagman. Mr. Page Played over 20 different classic roles opposite the dog, \"Wishbone,\" as a star on the long-running PBS series of the same name. His death scene in the classic film, Robocop (1987), as the ill-fated young executive, Mr. Kinney, repeatedly got the film an \"X\" rating from the MMPA ratings board before director Paul Verhoeven agreed to cut 4 1/2 seconds out for the U. S. theatrical release (most of which was Page getting blown away by ED-209). He has made over 2 dozen television commercials for products ranging from beer to national airlines to breakfast cereals. In addition to being an actor, Mr. Page is a writer, director and producer of more than a dozen internationally distributed documentary films. He was born and raised in the Midwest and now makes his home in Texas.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyOTg0NjYzMl5BMl5BanBnXkFtZTcwNDc3NDYzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0656241","name":"Kevin Page","idIMDB":"nm0656241"},"actorId":"nm0656241","character":"Ted Osborne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Neil Vipond","urlProfile":"http://www.imdb.com/name/nm0899277","urlPhoto":"","biography":{"dateOfBirth":"24 December 1929","placeOfBirth":" Toronto, Ontario, Canada","bio":"Neil Vipond was born on December 24, 1929 in Toronto, Ontario, Canada. He is an actor, known for Paradis (1982), The Fair (1999) and The Day the World Ended (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0899277","name":"Neil Vipond","idIMDB":"nm0899277"},"actorId":"nm0899277","character":"Novack","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stuart Nisbet","urlProfile":"http://www.imdb.com/name/nm0632604","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NjI0OTU0N15BMl5BanBnXkFtZTcwMTU3OTg0OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 January 1934","placeOfBirth":" Los Angeles, California, USA","height":"5' 11\" (1.8 m)","bio":"Character actor Stuart Nisbet was born on January 17, 1934 in Los Angeles, California. The son of Emmet and Hazel Nisbet, Stuart grew up in Bakersfield, California before eventually moving to and settling down in Glendale, California. Nisbet studied acting at both Los Angeles City College and California State University in Los Angeles. Stuart first started acting in various films and television shows in the early 1960's. Outside of acting, Nisbet was also the owner and co-founder of the casting agency Baker-Nisbet, Inc. in Hollywood, California for twenty-four years. In addition, Stuart was proud of his Scottish ancestry and served as the President of the Nesbitt/Nisbet Society of North America for many years as well as was a dedicated member of several local improvisational Hollywood comedy groups. Nisbet died at age 82 at USC Verdugo Hills Hospital in Glendale, California on June 23, 2016. He was survived by his wife Nancy; his children Bill, Linda, and Scott; grandchildren Shane, Shilo, Brandy, and Hope; and children-in-law Denny and Delia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NjI0OTU0N15BMl5BanBnXkFtZTcwMTU3OTg0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0632604","name":"Stuart Nisbet","nicknames":["Stu"],"idIMDB":"nm0632604"},"actorId":"nm0632604","character":"Judge","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0103280","urlIMDB":"http://www.imdb.com/title/tt0103280","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["2 hr (120 min) (Netherlands)","1 hr 40 min (100 min) (USA)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.5","filmingLocations":[{"location":"Los Angeles, California, USA"}],"awards":[],"votes":"89","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0199280","name":"Samuels Film Company"},{"idCompany":"co0063285","name":"World International Network (WIN)"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 03:37:24"}}