{"data":{"movies":[{"title":"Skinheads","originalTitle":"","year":"1989","releaseDate":"19890808","directors":[{"name":"Greydon Clark","id":"nm0163990"}],"writers":[{"name":"Greydon Clark","id":"nm0163990"},{"name":"David Reskin","id":"nm0720286"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjk2MTQ4MzM3N15BMl5BanBnXkFtZTcwNTM3NzcxMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Thriller"],"plot":"A gang of skinheads is wanted by the police after committing a series of brutal crimes in their hometown. While trying to lay low in a more rural area, they get into a fight with the owner of a truck stop. When two witness run off into the woods, the gang follows, intent on silencing them for good. Fortunately for the fleeing pair, they stumbling upon a survivalist (and World War II veteran) with no fondness for Nazis, traditional or Neo.","simplePlot":"A group of students traveling to California are menaced by a vicious group of skin-heads in the Colorado mountains. A WW2 vet living in the mountains comes to their rescue.","actors":[{"actorName":"Chuck Connors","urlProfile":"http://www.imdb.com/name/nm0175200","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MDEwNjExOV5BMl5BanBnXkFtZTcwMDIyOTkxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1921","placeOfBirth":" Brooklyn, New York, USA","birthName":"Kevin Joseph Aloysius Connors","height":"6' 5½\" (1.97 m)","bio":"Chuck Connors was born Kevin Joseph Connors in Brooklyn, New York, to Marcella (Londrigan) and Alban Francis \"Allan\" Connors. His parents were immigrants from the Dominion of Newfoundland (now part of Canada), and were of Irish descent. Chuck and his two-years-younger sister, Gloria, grew up in a working-class section of the west side of Brooklyn, where their father worked the local docks as a longshoreman. Chuck's natural athletic prowess earned him a scholarship to Adelphi Academy, a private high school, and then to Seton Hall, a Catholic college in South Orange, New Jersey. Leaving Seton Hall after two years, on October 20, 1942, he joined the army, listing his occupation as a ski instructor. After enlistment in the infantry at Fort Knox, he later served mostly as a tank-warfare instructor at Camp Campbell, Kentucky, and then finally at West Point. Following his discharge early in 1946, he resumed his athletic pursuits. He played center for the Boston Celtics in the 1946-47 season but left early for spring training with the Brooklyn Dodgers. Baseball had always been his first love, and for the next several years he knocked about the minor leagues in such places as Rochester (NY), Norfolk (VA), Newark (NJ), Newport News (VA), Mobile (AL) and Montreal, Canada (while in Montreal he met Elizabeth Riddell, whom he married in October 1948. They had four sons during their 13-year marriage). He finally reached his goal, playing for the Brooklyn Dodgers, in May 1949, but after just five weeks and one at-bat he returned to Montreal. After a brief stint with the Chicago Cubs in 1951, during which he hit two home runs, Chuck wound up with the Cubs' Triple-A farm team, the L.A. Angels, in 1952. A baseball fan who was also a casting director for MGM spotted Chuck and recommended him for a part in the Spencer Tracy-Katharine Hepburn comedy Pat and Mike (1952). Originally cast to play a prizefighter, but that role went instead to Aldo Ray. Chuck was cast as a captain in the state police. He now abandoned his athletic hopes and devoted full time to his acting career, which often emphasized his muscular 6'6\" physique. During the next several years he made 20 movies, culminating in a key role in William Wyler's 1958 western The Big Country (1958). Also appearing in many television series, he finally hit the big time in 1958 with The Rifleman (1958), which began its highly successful five-year run on ABC. Other television series followed, as did a number of movies which, though mostly minor, allowed Chuck to display his range as both a stalwart \"good guy\" and a menacing \"heavy\". Chuck Connors died at age 71 of lung cancer and pneumonia on November 10, 1992 in Los Angeles, California. He is buried in San Fernando Mission Cemetery with his tombstone carrying a photo of Connors as Lucas McCain in \"The Rifleman\" as well as logos from the three professional sports teams he played for: the Dodgers, Cubs and Celtics.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MDEwNjExOV5BMl5BanBnXkFtZTcwMDIyOTkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0175200","name":"Chuck Connors","idIMDB":"nm0175200"},"actorId":"nm0175200","character":"Mr. Huston","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barbara Bain","urlProfile":"http://www.imdb.com/name/nm0000828","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzODg4NjI0N15BMl5BanBnXkFtZTYwNzUxNDI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 September 1931","placeOfBirth":" Chicago, Illinois, USA","birthName":"Mildred Fogel","height":"5' 9¼\" (1.76 m)","bio":"Barbara Bain was born in Chicago, graduating from the University of Illinois with a Bachelor's Degree in Sociology. She then relocated to New York City where she gained work as a dancer and high-fashion model. Ms. Bain studied with Martha Graham, permanently cementing her love of dance; however, it was with Lee Strasberg at the prestigious Actors Studio that she discovered her true first love - acting. She is probably best known for her work in the landmark television series Mission: Impossible (1966), created by Bruce Geller, where she created the pivotal role of Impossible Missions Force Agent \"Cinnamon Carter\", and, in the process, became the first actress in the history of television to receive three consecutive Emmy Awards for Best Dramatic Actress. Ms. Bain followed with the role of \"Dr. Helena Russell\" in the now classic British syndicated science fiction television series Space: 1999 (1975), created by Gerry Anderson and Sylvia Anderson. Her stage work has garnered her Los Angeles Critic's Circle and DramaLogue Awards for her work on Arthur Kopit's \"Wings\", Samuel Beckett's \"Happy Days\" and Eugène Ionesco's \"The Chairs\". Ms. Bain has worked on behalf of numerous charitable causes and is the founder of the Screen Actors Guild's \"BookPals\" Program which currently has some 300 of her colleagues reading to children in Los Angeles schools. Following the success of the program there, she helped the program to develop in other major cities throughout North America.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzODg4NjI0N15BMl5BanBnXkFtZTYwNzUxNDI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000828","name":"Barbara Bain","idIMDB":"nm0000828"},"actorId":"nm0000828","character":"Martha","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Culp","urlProfile":"http://www.imdb.com/name/nm0191677","urlPhoto":"","biography":{"dateOfBirth":"15 January 1961","placeOfBirth":" Los Angeles, California, USA","birthName":"Jason S. Culp","bio":"Jason Culp was born on January 15, 1961 in Los Angeles, California, USA as Jason S. Culp. He is an actor, known for General Hospital (1963), Skinheads (1989) and The Reflecting Pool (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0191677","name":"Jason Culp","idIMDB":"nm0191677"},"actorId":"nm0191677","character":"Jeff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian Brophy","urlProfile":"http://www.imdb.com/name/nm0112393","urlPhoto":"","biography":{"bio":"Brian Brophy is an actor and casting director, known for The Shawshank Redemption (1994), Armageddon (1998) and The Player (1992).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0112393","name":"Brian Brophy","idIMDB":"nm0112393"},"actorId":"nm0112393","character":"Damon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Liz Sagal","urlProfile":"http://www.imdb.com/name/nm0755967","urlPhoto":"","biography":{"dateOfBirth":"9 October 1961","placeOfBirth":" Los Angeles, California, USA","birthName":"Elizabeth A. Sagal","bio":"Liz Sagal was born on October 9, 1961 in Los Angeles, California, USA as Elizabeth A. Sagal. She is known for her work on Sons of Anarchy (2008), Flashdance (1983) and Two Guys, a Girl and a Pizza Place (1998). She is married to Bruce Grayson.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0755967","name":"Liz Sagal","idIMDB":"nm0755967"},"actorId":"nm0755967","character":"Amy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Kohne","urlProfile":"http://www.imdb.com/name/nm0463417","urlPhoto":"","biography":{"bio":"Bill Kohne is an actor and producer, known for Tomcats (2001), Skinheads (1989) and Get a Job (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0463417","name":"Bill Kohne","idIMDB":"nm0463417"},"actorId":"nm0463417","character":"Jeff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lynna Hopwood","urlProfile":"http://www.imdb.com/name/nm0394485","urlPhoto":"","biography":{"bio":"Lynna Hopwood is an actress, known for Skinheads (1989), Side Out (1990) and Follow Your Heart (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0394485","name":"Lynna Hopwood","idIMDB":"nm0394485"},"actorId":"nm0394485","character":"Liz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gene Mitchell","urlProfile":"http://www.imdb.com/name/nm0593351","urlPhoto":"","biography":{"height":"6' (1.83 m)","bio":"Gene Mitchell, Jr. was born in Torrance, California. He is the third of four children of a homemaker mother (Jill) from Cincinnati, Ohio, and an auto body repairman, Gene Mitchell, Sr., from Flint, Michigan. After his parents divorce, following his freshman year of high school, Gene joined his mother and step-family on a 5,000 acre Hereford cattle ranch located in the Shingletown/Manton area of Northern California. Living in this rural setting, where his mother and family assisted neighboring families during lean times of the 1970s, would have a profound impact on Gene's life and future career as an actor, writer, and filmmaker. Gene returned to Torrance where he lived with his grandparents, graduated from high school, and enrolled in college at California State University, Long Beach, intent on a career in business. However, he caught the acting bug the summer before his senior year when an artistic director for Gary Goddard Entertainment asked if he would audition for the role of young Conan (the Barbarian) in a live show based upon the popular film series. Gene's presence and athleticism made an impression on the director and he was encouraged to get professional training if he wanted to make a living as an actor. Gene embraced the encouragement and enrolled in a summer program at the Lee Strasberg Theatre Institute in Los Angeles where he studied with acting coach Susan Peretz and learned \"The Method.\" Gene advanced his training in front of the cameras at the Film Industry Workshops where he worked with professional film and TV performers and within a year left college to work as an actor. Inspired by the real-life story of Sylvester Stallone and his Rocky creation, Gene soon wrote his first screenplay Passion which landed him a writing coach and literary agent, and he began training in the \"Sweet Science\" of boxing at the Fabela Chavez Boxing Center in Carson, California. One of his first paid acting roles was Brutus in the cult classic Surf Nazis Must Die. In addition to acting his role and performing stunts, Gene learned all that he could about making a movie. Through the 1980s Gene continued studying, screenwriting, and began directing while working at The Actors Studio where he was mentored by veteran actors, playwrights, and directors. Gene's first screen break came in the role of Detective Peel in John Stockwell's Under Cover (1987) and was followed by a chilling portrayal of a neo-Nazi in 1989's Skinheads. With his acting versatility and no-nonsense presence Gene had no difficulty finding work in movies. In the 1990s his screenwriting and filmmaking career began to take precedence with the brothers drama Strong City (1992) a modern-day On the Waterfront, and the critically-acclaimed Flipping (1997) a stylish crime-thriller in which he made his directorial debut. During this period, he also took on the role of co-producer for some of his projects including Fatal Choice (1995) and Sins of the Father (1998). While Gene defined his onscreen persona as the tough, no-nonsense leader in films like Centurion Force (1998), in the 2000s his screenwriting was moving in a new direction, both cerebral and meticulous, and he began developing a library of deeply personal stories of spiritual triumph and historical significance. As an actor, Gene was directed by Ron Howard in Frost/Nixon (2008) and followed up by completing several new screenplays including Footprints, a fantasy adventure in the genre of Pete's Dragon, Sutter's New West, a historical mini-series which chronicles the life of empire builder John Augustus Sutter, and True Reckoning a rare American drama which juxtaposes a young boy's dream of being a football quarterback with the brutal life of being a prizefighter (Summer 2017).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0593351","name":"Gene Mitchell","idIMDB":"nm0593351"},"actorId":"nm0593351","character":"Frank","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Noon","urlProfile":"http://www.imdb.com/name/nm0634694","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmJjNGZlNjgtYmVhZS00YWQzLTk0MTctNDFiZTk2ZGJhYjRlXkEyXkFqcGdeQXVyMzkwMzY5Ng@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Frank Noon is known for his work on Red Dead Redemption (2010), Darkman (1990) and Road House (1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmJjNGZlNjgtYmVhZS00YWQzLTk0MTctNDFiZTk2ZGJhYjRlXkEyXkFqcGdeQXVyMzkwMzY5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0634694","name":"Frank Noon","idIMDB":"nm0634694"},"actorId":"nm0634694","character":"Walt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dennis Ott","urlProfile":"http://www.imdb.com/name/nm0653023","urlPhoto":"","biography":{"dateOfBirth":"13 June 1958","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"6' 11\" (2.11 m)","bio":"Dennis Ott was born on June 13, 1958 in Philadelphia, Pennsylvania, USA. He is known for his work on Runaway Train (1985), Road House (1989) and Police Academy 6: City Under Siege (1989). He was married to Louise. He died on November 3, 1994 in Philadelphia.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0653023","name":"Dennis Ott","idIMDB":"nm0653023"},"actorId":"nm0653023","character":"Brains","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James A. Stunden","urlProfile":"http://www.imdb.com/name/nm0836240","urlPhoto":"","biography":{"bio":"James A. Stunden is an actor, known for Skinheads (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0836240","name":"James A. Stunden","idIMDB":"nm0836240"},"actorId":"nm0836240","character":"Randy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Fox","urlProfile":"http://www.imdb.com/name/nm0289147","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDExNzYxNl5BMl5BanBnXkFtZTgwNzkxNTc3MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1921","placeOfBirth":" Yonkers, New York, USA","birthName":"Myron Melvin Fox","bio":"Michael Fox first \"trod the boards\" in grade school plays in his hometown of Yonkers, New York. After toying with the idea of becoming a history teacher, Fox did \"something as foreign to my nature as one could think of\", becoming a \"boomer\" (a migratory railroad worker) and taking jobs as a brakeman with various lines. His interest in acting was rekindled in the mid-'40s and he appeared in several \"little theater\" plays in Los Angeles. An acting-directing stint in a Players Ring production of \"Home of the Brave\" caught the eye of Harry Sauber, an associate of exploitation mogul \"Jungle Sam\" Sam Katzman, and Fox landed his first film role (A Yank in Indo-China (1952)). He appeared in dozens of movies (and innumerable TV episodes) in the decades since; one of his regular TV roles was as the coroner in the courtroom drama Perry Mason (1957).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDExNzYxNl5BMl5BanBnXkFtZTgwNzkxNTc3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0289147","name":"Michael Fox","idIMDB":"nm0289147"},"actorId":"nm0289147","character":"Saul","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bunny Summers","urlProfile":"http://www.imdb.com/name/nm0838677","urlPhoto":"","biography":{"dateOfBirth":"23 February 1924","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Bernice Siegel","bio":"Bunny Summers was born on February 23, 1924 in Brooklyn, New York City, New York, USA as Bernice Siegel. She was an actress, known for Re-Animator (1985), From Beyond (1986) and The Last Starfighter (1984). She died on September 9, 2010 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0838677","name":"Bunny Summers","nicknames":["Bunny"],"idIMDB":"nm0838677"},"actorId":"nm0838677","character":"Bessie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cynthia Cheston","urlProfile":"http://www.imdb.com/name/nm0156379","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmNkNzM5NTktYTQwMC00MTRjLTg3MjEtMzdhOTJiN2I1MzA5XkEyXkFqcGdeQXVyMjA4MDY5Mzg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 2\" (1.57 m)","bio":"Cynthia was born in Pasadena, California and raised in Newport Beach, Ca. She started her career as an actress at the age of 8 appearing in \"Heart of Tomorrow\". She went on to study at South Coast Repretory Conservatory under the guidance of James Wilson. Appearing in various movies, she left America at the age of 27 to work in Japan. For the last 20 years. she has been working as an Actress appearing in dramas, movies, commercials, print work and narration. She spent 15 years as a Jazz Singer, working in Japan's top Jazz Clubs and Hotels. She is now appearing in the long awaited, Nodame Contabile The Movie as Noemi, the spoiled, lazy, stuck-up flautist, whose heart is really in to Rock and Roll.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmNkNzM5NTktYTQwMC00MTRjLTg3MjEtMzdhOTJiN2I1MzA5XkEyXkFqcGdeQXVyMjA4MDY5Mzg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0156379","name":"Cynthia Cheston","idIMDB":"nm0156379"},"actorId":"nm0156379","character":"Carla","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jadili Johnson","urlProfile":"http://www.imdb.com/name/nm0425285","urlPhoto":"","biography":{"bio":"Jadili Johnson is an actor, known for The Color Purple (1985), Skinheads (1989) and Tall Tales & Legends (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0425285","name":"Jadili Johnson","idIMDB":"nm0425285"},"actorId":"nm0425285","character":"Willie","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0100632","urlIMDB":"http://www.imdb.com/title/tt0100632","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"20","month":"07","year":"1988","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min) (Brazil)","1 hr 28 min (88 min) (UK)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arriflex Cameras and Lenses"],"laboratory":["FotoKem Laboratory, Burbank (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"2.1","filmingLocations":[],"rated":"R","awards":[],"votes":"391","type":"Movie","companyCreditsSimple":[],"keywords":{"keywords":["mountain","fight","skinhead","dead woman on ground","topless female nudity","woman's neck broken","woman kills woman","female skinhead","vw beetle","violence","strangulation","snake","shotgun","knife","gunpowder","forest","dead boy","cabin","blood","bear","throat slitting","nudity","neck breaking","murder","crucifixion","rifle","world war two veteran","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 01:53:37"}}