{"data":{"movies":[{"title":"Urbania","originalTitle":"","year":"2000","releaseDate":"20010809","directors":[{"name":"Jon Shear","id":"nm0790398"}],"writers":[{"name":"Daniel Reitz","id":"nm0718670"},{"name":"Daniel Reitz","id":"nm0718670"}],"runtime":"103 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMTU4Mjc3OV5BMl5BanBnXkFtZTcwMjU1ODQyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama"],"plot":"Charlie takes an odyssey through grief during a fall weekend in New York City. His encounters are planned and chance: with a homeless man who sleeps by his building, with a friend who's dying, with the couple who lives (and noisily loves) in the flat above him, with a bartender and a one-night-stand he follows home, and with a tattooed stranger whom he seeks out and befriends. Along the way, Charlie inhabits a city full of moments of violence and of stories and legends: a kidney thief, a microwaved poodle, a rat in a hot dog bun, a baby left on a car top, a tourist's toothbrush, needles in public-phone change slots. Charlie lives and tells his own stories. What caused his melancholy?","simplePlot":"A tour of The Anger Stage.","actors":[{"actorName":"Dan Futterman","urlProfile":"http://www.imdb.com/name/nm0001246","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwODA1NjY0MV5BMl5BanBnXkFtZTYwODExNDQ0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 June 1967","placeOfBirth":" Silver Spring, Maryland, USA","birthName":"Daniel Paul Futterman","height":"5' 9\" (1.75 m)","bio":"Dan Futterman was born on June 8, 1967 in Silver Spring, Maryland, USA as Daniel Paul Futterman. He is an actor and producer, known for Capote (2005), A Mighty Heart (2007) and The Birdcage (1996). He has been married to Anya Epstein since September 23, 2000. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwODA1NjY0MV5BMl5BanBnXkFtZTYwODExNDQ0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001246","name":"Dan Futterman","nicknames":["Danny"],"idIMDB":"nm0001246"},"actorId":"nm0001246","character":"Charlie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sam Ball","urlProfile":"http://www.imdb.com/name/nm0050458","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MjcxNzk5M15BMl5BanBnXkFtZTYwMzIxODE1._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1973","placeOfBirth":" Bunker Hill, West Virginia, USA","height":"6' (1.83 m)","bio":"Sam Ball was born on June 29, 1973 in Bunker Hill, West Virginia, USA. He is an actor, known for One Life to Live (1968), 13 Going on 30 (2004) and The Last Castle (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MjcxNzk5M15BMl5BanBnXkFtZTYwMzIxODE1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0050458","name":"Sam Ball","idIMDB":"nm0050458"},"actorId":"nm0050458","character":"Dean","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lothaire Bluteau","urlProfile":"http://www.imdb.com/name/nm0089937","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyNjIyOTk1Nl5BMl5BanBnXkFtZTcwMDAxNzk5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 April 1957","placeOfBirth":" Montréal, Québec, Canada","bio":"Lothaire Bluteau was born on April 14, 1957 in Montréal, Québec, Canada. He is an actor and writer, known for Vikings (2013), Black Robe (1991) and Jesus of Montreal (1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyNjIyOTk1Nl5BMl5BanBnXkFtZTcwMDAxNzk5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0089937","name":"Lothaire Bluteau","idIMDB":"nm0089937"},"actorId":"nm0089937","character":"Bill","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alan Cumming","urlProfile":"http://www.imdb.com/name/nm0001086","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MjM0NDI5M15BMl5BanBnXkFtZTcwNDg1ODE0Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1965","placeOfBirth":" Aberfeldy, Perthshire, Scotland, UK","height":"5' 10\" (1.78 m)","bio":"Alan Cumming was born on January 27, 1965, in Aberfeldy, Scotland, to Mary (Darling), an insurance company secretary, and Alex Cumming. His family lived nearby in Dunkeld, where his father was a forester for Atholl Estate. The family (including his brother, Tom) moved to Fassfern near Fort William, before moving to the east coast of Scotland in 1969, where Alan's father took up the position of Head Forester of Panmure Estate; it was there that Alan grew up. He went to Monikie Primary School and Carnoustie High School, where he began appearing in plays, and soon after that began working with with the Carnoustie Theatre Club and Carnoustie Musical Society. In 1981 he left high school with 8 'O' Grades and 4 Highers, but because he was too young to enter any university or drama school he worked for just over a year as a sub-editor at D.C. Thomson Publishers in Dundee. There he worked on the launch of a new magazine, \"Tops\", and was also the \"Young Alan\" who answered readers' letters. In September 1982 he began a three-year course at the Royal Scottish Academy of Music and Drama in Glasgow. He graduated in 1985 with a B.A. (Dramatic Studies) and awards for verse speaking and direction. He also had formed a cabaret double act with fellow student Forbes Masson called Victor and Barry, which went on to become hugely successful with tours (including two Perrier Pick of the Fringe seasons in London and a month-long engagement at the Sydney Opera House as part of an Australian tour), records (\"Hear Victor and Barry and Faint\", \"Are We Too Loud?\") and many TV appearances throughout the UK. Before graduating Alan made his professional theater and film debuts in \"Macbeth\" at the Tron Theatre in Glasgow and in Gillies MacKinnon's \"Passing Glory\". After graduating, Alan worked extensively in Scottish theater and television, including a stint on the soap opera High Road (1980) before moving to London when \"Conquest of the South Pole\", a play by German playwright Manfred Karge, transferred from the Traverse Theatre in, Edinburgh to the the Royal Court in London, earning him his first Olivier award nomination for Most Promising Newcomer of 1988. Alan performed with the Royal Shakespeare Company and then the Royal National Theatre, where he starred in \"Accidental Death of an Anarchist\", which he also adapted with director Tim Supple. The production was nominated for Best revival at the 1991 Olivier awards and Alan won for Comedy Performance of the Year. Then his film career began with Ian Sellar's Prague (1992), in which he starred with Sandrine Bonnaire and Bruno Ganz. The film premiered at the 1992 Cannes film festival and went on to win him Best Actor award at the Atlantic Film Festival and a Scottish BAFTA Best Actor nomination. In the same year he made two films for the BBC - Screen Two: The Last Romantics (1992) and Bernard and the Genie (1991), the latter winning him the Top Television Newcomer award at 1992 British Comedy Awards. In the 1992 Olivier awards he was also nominated for Comedy Performance of the Year for \"La Bete\". In 1993 he played Hamlet for the English Touring Theare to great critical acclaim (\"An actor knocking on the door of greatness\" - Daily Mail; ranked first and second--with his performance in \"Cabaret\"--in the Daily Telegraph's performances of the year) and then immediately went on to play the Emcee in Sam Mendes' revival of \"Cabaret\" at the same venue (London's Donmar Warehouse). He received a 1994 Olivier award nomination for Best Actor in a Musical for \"Cabaret\", and for Hamlet he received the 1994 TMA Best Actor award and a Shakespeare Globe award nomination. In 1994 he made his first Hollywood film, Le cercle des amies (1995), and his performance as the oleaginous Sean Walsh along with those in two films released in quick succession (Emma (1996) and GoldenEye (1995)) brought him to the attention of American producers, and he appeared in several Hollywood films, such as Romy and Michele's High School Reunion (1997) and Buddy (1997). He returned to the UK in 1997 to work with Stanley Kubrick and the Spice Girls before returning stateside in 1998 to reprise his role in \"Cabaret\" on Broadway. The show and his portrayal were a sensation, and he received the Tony, Drama Desk, Outer Critics' Circle, Theatre World, FANY, New York Press and New York Public Advocate's awards for his performance. Since then he has alternated between theater and films, and also between smaller independent films and more mainstream fare. His theater work includes 2001's \"Design for Living\" on Broadway and the hugely successful off-Broadway \"Elle\" by Jean Genet, which he adapted and played the lead in 2002. His films have included Julie Taymor's Titus (1999), Urbania (2000), the \"Spy Kids\" trilogy, Josie et les Pussycats (2001), X-Men 2 (2003), Nicholas Nickleby (2002), Son of the Mask (2005) and the Showtime movie musical Reefer Madness: The Movie Musical (2005). He wrote, directed, produced and acted in The Anniversary Party (2001) with Jennifer Jason Leigh, which premiered at the Cannes Film festival in 2002 and went on to win a National Board of Review award and two Independent Spirit award nominations. More recently he has produced the documentary Show People (2004) and the films Sweet Land (2005) and Full Grown Men (2006) (and appears in both) and acted in Gray Matters (2006) opposite Heather Graham and Bam Bam and Celeste (2005) opposite Margaret Cho. In 2006, he returned to Broadway as Macheath in \"The Threepenny Opera\". He has also found the time to write a novel, \"Tommy's Tale\", in 2002.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MjM0NDI5M15BMl5BanBnXkFtZTcwNDg1ODE0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001086","name":"Alan Cumming","idIMDB":"nm0001086"},"actorId":"nm0001086","character":"Brett","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Josh Hamilton","urlProfile":"http://www.imdb.com/name/nm0357979","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1ODA3MzE1MV5BMl5BanBnXkFtZTcwODMxMzg1MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 June 1969","placeOfBirth":" New York City, New York, USA","birthName":"Joshua Cole Hamilton","height":"5' 11\" (1.8 m)","bio":"Josh Hamilton was born on June 9, 1969 in New York City, New York, USA as Joshua Cole Hamilton. He is an actor, known for Madam Secretary (2015), Gracepoint (2014), American Horror Story (2013), The Bourne Identity (2002), J. Edgar (2011) and Ice Age (2002). He appeared in two Sundance films in 2015, Take Me To The River and The Experimenter. Josh is also an accomplished stage actor appearing in The Real Thing (2015), Dead Accounts (2013), The Coast of Utopia (2007) and Proof (2001). He has been married to Lily Thorne since 2005. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1ODA3MzE1MV5BMl5BanBnXkFtZTcwODMxMzg1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0357979","name":"Josh Hamilton","idIMDB":"nm0357979"},"actorId":"nm0357979","character":"Matt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matt Keeslar","urlProfile":"http://www.imdb.com/name/nm0444832","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNzA4MzUyNl5BMl5BanBnXkFtZTcwMTIxMDkyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 October 1972","placeOfBirth":" Grand Rapids, Michigan, USA","height":"6' 2\" (1.88 m)","bio":"At eighteen, Matt Keeslar moved from Adrian, Michigan to New York City to attend the Juilliard School of Drama. The Juilliard faculty had selected him to fill one of twenty spots in \"Group 24\", the twenty-forth class to participate in Juilliard's rigorous acting program. Along with the group projects Matt performed at Juilliard, he also played the title role in a touring production of Moliere's Don Juan, directed by Joseph Chaiken; produced and starred in a student production of \"Waiting for Godot; and participated in several interdepartmental productions, including playing the title role in Igor Stravinsky's A Soldier's Tale. Matt signed with ICM in his second year at Juilliard and immediately won roles in Quiz Show (1994), directed by Robert Redford, and Renaissance Man (1994), directed by Penny Marshall. In his third year, Matt won a lead role in the movie Safe Passage (1994), in which he played the son of Susan Sarandon and Sam Shepard. He finally dropped out of Juilliard after his third year to take accept the lead role in Peter Yates' Film The Run of the Country (1995). Matt went on to star in professional plays in New York and regionally. He originated the roles of Boyd in Nicky Silver's Fit to be Tied, Nathan Hale in David Stanley Ford's The Interrogation of Nathan Hale, Bo in Laura Cahill's Mercy, and Ricky in Jack Heifner's Earth to Bucky. Despite his love of theatre, Matt worked in film and television most frequently. Some of the highlights from his film career include: Waiting for Guffman (1996), The Last Days of Disco (1998), Scream 3 (2000), and Art School Confidential (2006). He guest-starred in several television projects, and starred in The Middleman (2008), a series for ABC Family in which he played the title role.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNzA4MzUyNl5BMl5BanBnXkFtZTcwMTIxMDkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0444832","name":"Matt Keeslar","idIMDB":"nm0444832"},"actorId":"nm0444832","character":"Chris","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Simon","urlProfile":"http://www.imdb.com/name/nm1022539","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2ODM5NzAzMl5BMl5BanBnXkFtZTcwOTI0NzgyMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"James Simon is an actor, known for Urbania (2000) and Life on the V: The Story of V66 (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2ODM5NzAzMl5BMl5BanBnXkFtZTcwOTI0NzgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1022539","name":"James Simon","idIMDB":"nm1022539"},"actorId":"nm1022539","character":"Sam","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Megan Dodds","urlProfile":"http://www.imdb.com/name/nm0230155","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjU5OTk5Ml5BMl5BanBnXkFtZTcwMzQ1NTUxOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 February 1970","placeOfBirth":" Sacramento, California, USA","birthName":"Megan Lynne Dodds","height":"5' 7\" (1.7 m)","bio":"Megan Dodds graduated from the famous Juilliard School, where she tackled a wide range of classic plays including \"The Seagull,\" \"Misalliance,\" \"Macbeth\" and \"All's Well That Ends Well.\" She made her Broadway debut in \"School for Scandal\" at the Lyceum Theatre, directed by Gerald Freedman. A small role in the movie So I Married an Axe Murderer (1993) and a couple of television roles preceded her West End debut in Ben Elton's successful, outrageous show \"Popcorn.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjU5OTk5Ml5BMl5BanBnXkFtZTcwMzQ1NTUxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0230155","name":"Megan Dodds","idIMDB":"nm0230155"},"actorId":"nm0230155","character":"Deedee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gabriel Olds","urlProfile":"http://www.imdb.com/name/nm0646192","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxOTMxY2QtMGYxZi00ZGYzLThiZjQtZjZiYTgxODg4MTgzL2ltYWdlXkEyXkFqcGdeQXVyMjU1MDQ0Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 March 1972","placeOfBirth":" New York, USA","birthName":"Gabriel Emerson Olds","bio":"Gabriel Olds was born on March 24, 1972 in New York, USA as Gabriel Emerson Olds. He is an actor, known for Surrogates (2009), Without Limits (1998) and Urbania (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxOTMxY2QtMGYxZi00ZGYzLThiZjQtZjZiYTgxODg4MTgzL2ltYWdlXkEyXkFqcGdeQXVyMjU1MDQ0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0646192","name":"Gabriel Olds","idIMDB":"nm0646192"},"actorId":"nm0646192","character":"Ron","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barbara Sukowa","urlProfile":"http://www.imdb.com/name/nm0837784","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMzM3MDkyNF5BMl5BanBnXkFtZTcwNjA5NDgzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 February 1950","placeOfBirth":" Bremen, Germany","height":"5' 5\" (1.65 m)","bio":"A strikingly beautiful German lead actress, Barbara Sukowa broke into TV and films as the protégée of famed director Rainer Werner Fassbinder with his masterpiece mini-series Berlin Alexanderplatz (1980) and the moody film drama Lola, une femme allemande (1981) in the title role. In the latter, Barbara won critical kudos portraying a cynical, manipulative singer/hooker who sets her sights on an unsuspecting town politician played by Armin Mueller-Stahl. Following Fassbinder's sudden death in 1982, Barbara was gloriously displayed in a couple of stark, brilliant, politically-motivated films by director Margarethe von Trotta. In Marianne & Juliane (1981), Barbara won both the Venice Film Festival and German Film awards and as _Rosa Luxemburg (1986)_ , she copped the Cannes Film Festival award. A number of international productions, notably Lars von Trier's Europa (1991), brought Barbara to the attention of Hollywood. Although not well known here by name, this fascinating figure has added her exotic allure to a number of American films including The Sicilian (1987), M. Butterfly (1993), Johnny Mnemonic (1995), Cradle Will Rock (1999) and the just-completed Romance & Cigarettes (2005), which was written and directed by John Turturro. Barbara started up a second career as a concert vocalist in recent years, performing works by such classical composers as Arnold Schönberg, among others.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMzM3MDkyNF5BMl5BanBnXkFtZTcwNjA5NDgzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0837784","name":"Barbara Sukowa","idIMDB":"nm0837784"},"actorId":"nm0837784","character":"Clara - The Married Woman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gerry Bamman","urlProfile":"http://www.imdb.com/name/nm0051482","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMzg5MzY1MF5BMl5BanBnXkFtZTcwNzUyMzk5Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1941","placeOfBirth":" Independence, Kansas, USA","height":"6' 1\" (1.85 m)","bio":"Gerry Bamman was born on September 18, 1941 in Independence, Kansas, USA. He is an actor, known for Home Alone (1990), Home Alone 2: Lost in New York (1992) and The Bodyguard (1992).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMzg5MzY1MF5BMl5BanBnXkFtZTcwNzUyMzk5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0051482","name":"Gerry Bamman","idIMDB":"nm0051482"},"actorId":"nm0051482","character":"Don","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott Denny","urlProfile":"http://www.imdb.com/name/nm0219673","urlPhoto":"","biography":{"bio":"Scott Denny is an actor, known for Urbania (2000), Rudy (1993) and I Am Joe's Heart (1987). He was previously married to Abby Epstein.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0219673","name":"Scott Denny","idIMDB":"nm0219673"},"actorId":"nm0219673","character":"Ken","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pamela Shaw","urlProfile":"http://www.imdb.com/name/nm0789904","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMDE5Mjk4M15BMl5BanBnXkFtZTgwMjEwMDQ5MDE@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"bio":"Pamela Shaw is an actress, known for Swingers (1996), Emma Blue (2008) and Urbania (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMDE5Mjk4M15BMl5BanBnXkFtZTgwMjEwMDQ5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0789904","name":"Pamela Shaw","idIMDB":"nm0789904"},"actorId":"nm0789904","character":"Judy - The Photo Lady","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Wheir","urlProfile":"http://www.imdb.com/name/nm0924003","urlPhoto":"","biography":{"dateOfBirth":"2 March 1972","placeOfBirth":" Amarillo, Texas, USA","birthName":"David JosephWheir","height":"6' 2\" (1.88 m)","bio":"David Wheir was born on March 2, 1972 in Amarillo, Texas, USA as David JosephWheir. He is an editor and actor, known for No Reservations (2007), Urbania (2000) and Wild Roomies (2004). He is married to Nicola Kraus.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0924003","name":"David Wheir","idIMDB":"nm0924003"},"actorId":"nm0924003","character":"Gary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Bradley","urlProfile":"http://www.imdb.com/name/nm0002222","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NjA5NDk2Ml5BMl5BanBnXkFtZTYwOTE0ODcy._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 May 1961","placeOfBirth":" Northumberland, Pennsylvania, USA","height":"6' 1\" (1.85 m)","bio":"Christopher Bradley was born one of eight children and raised in the New Mexico desert. His father was a college professor and his mother was a registered nurse. He moved to Ft. Worth, Texas at age 18 when he was offered a scholarship to Texas Christian University, from which he graduated with a BFA in theatre. While continuing his film work, he completed his MFA in Screenwriting at UCLA, where he also completed most of the credits for an animation degree. In addition to acting, Christopher teaches screenwriting online for the UCLA Professional Program.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NjA5NDk2Ml5BMl5BanBnXkFtZTYwOTE0ODcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002222","name":"Christopher Bradley","idIMDB":"nm0002222"},"actorId":"nm0002222","character":"Efraim - The Window Couple","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0182508","urlIMDB":"http://www.imdb.com/title/tt0182508","business":{"budget":{"money":"$225,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$72,129","country":"USA","day":"17","month":"09","year":"2000","remarks":"10 Screens"}],"gross":[{"money":"$1,027,119","country":"USA","day":"26","month":"11","year":"2000","remarks":""},{"money":"$1,019,071","country":"USA","day":"19","month":"11","year":"2000","remarks":""},{"money":"$1,002,134","country":"USA","day":"12","month":"11","year":"2000","remarks":""},{"money":"$886,916","country":"USA","day":"05","month":"11","year":"2000","remarks":""},{"money":"$773,130","country":"USA","day":"29","month":"10","year":"2000","remarks":""},{"money":"$662,332","country":"USA","day":"22","month":"10","year":"2000","remarks":""},{"money":"$527,695","country":"USA","day":"15","month":"10","year":"2000","remarks":""},{"money":"$386,628","country":"USA","day":"08","month":"10","year":"2000","remarks":""},{"money":"$271,006","country":"USA","day":"01","month":"10","year":"2000","remarks":""},{"money":"$165,694","country":"USA","day":"24","month":"09","year":"2000","remarks":""},{"money":"$72,129","country":"USA","day":"17","month":"09","year":"2000","remarks":""}],"weekendGross":[{"money":"$5,860","country":"USA","day":"26","month":"11","year":"2000","remarks":"6 Screens"},{"money":"$5,230","country":"USA","day":"19","month":"11","year":"2000","remarks":"4 Screens"},{"money":"$59,298","country":"USA","day":"12","month":"11","year":"2000","remarks":"38 Screens"},{"money":"$63,998","country":"USA","day":"05","month":"11","year":"2000","remarks":"38 Screens"},{"money":"$59,110","country":"USA","day":"29","month":"10","year":"2000","remarks":"40 Screens"},{"money":"$68,297","country":"USA","day":"22","month":"10","year":"2000","remarks":"42 Screens"},{"money":"$82,958","country":"USA","day":"15","month":"10","year":"2000","remarks":"43 Screens"},{"money":"$69,884","country":"USA","day":"08","month":"10","year":"2000","remarks":"31 Screens"},{"money":"$78,064","country":"USA","day":"01","month":"10","year":"2000","remarks":"27 Screens"},{"money":"$65,081","country":"USA","day":"24","month":"09","year":"2000","remarks":"14 Screens"},{"money":"$72,129","country":"USA","day":"17","month":"09","year":"2000","remarks":"10 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 43 min (103 min)","1 hr 46 min (106 min) (Mar del Plata) (Argentina)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Aaton LTR, Canon Lenses"],"laboratory":["Cinesite, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["16 mm (Kodak Vision 500T 7279)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 16 (source format)"],"printedFilmFormat":["35 mm (spherical) (blow-up)"]},"rating":"7.0","metascore":"73","filmingLocations":[{"location":"New York City, New York, USA"}],"rated":"R","awards":[{"award":"Chlotrudis Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated Chlotrudis Award","categories":[{"category":"Best Actor","names":[{"name":"Dan Futterman","id":"nm0001246","role":null}]},{"category":"Best Adapted Screenplay","names":[{"name":"Daniel Reitz","id":"nm0718670","role":null},{"name":"Jon Shear","id":"nm0790398","role":null}]}]}]},{"award":"GLAAD Media Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated GLAAD Media Award","categories":[{"category":"Outstanding Film (Limited Release)","names":[]}]}]},{"award":"L.A. Outfest 2000","titlesAwards":[{"titleAwardOutcome":"Won Grand Jury Award","categories":[{"category":"Outstanding American Narrative Feature","names":[{"name":"Jon Shear","id":"nm0790398","role":null}]}]}]},{"award":"Philadelphia International Gay & Lesbian Film Festival 2000","titlesAwards":[{"titleAwardOutcome":"Won Jury Prize","categories":[{"category":"Best Feature","names":[{"name":"Jon Shear","id":"nm0790398","role":null}]}]}]},{"award":"Provincetown International Film Festival 2000","titlesAwards":[{"titleAwardOutcome":"Won Audience Award","categories":[{"category":"Best Feature","names":[{"name":"Jon Shear","id":"nm0790398","role":null}]}]}]},{"award":"San Francisco International Lesbian & Gay Film Festival 2000","titlesAwards":[{"titleAwardOutcome":"Won Best First Feature","categories":[{"category":"","names":[{"name":"Jon Shear","id":"nm0790398","role":null}]}]}]},{"award":"Seattle International Film Festival 2000","titlesAwards":[{"titleAwardOutcome":"Won Golden Space Needle Award","categories":[{"category":"Best Actor","names":[{"name":"Dan Futterman","id":"nm0001246","role":null}]}]}]},{"award":"Sundance Film Festival 2000","titlesAwards":[{"titleAwardOutcome":"Nominated Grand Jury Prize","categories":[{"category":"Dramatic","names":[{"name":"Jon Shear","id":"nm0790398","role":null}]}]}]}],"votes":"2,788","type":"Movie","companyCreditsSimple":[{"idCompany":"co0067970","name":"Daly-Harris Productions"}],"keywords":{"keywords":["new york","needle","tourist","hot dog bun","rat","poodle","dog","kidney","bartender","grief","new york city","vomiting","microwave oven","homosexual","kiss","gay relationship","gay kiss","slow motion scene","shower","one night","manhattan new york city","gay cruising","anniversary","epilepsy","epileptic seizure","lost love","throat slitting","reference to stella dallas","clock","birthday party","tattoo","scar","actor","teacher","marijuana","drugs","doll","arson","face slap","reference to murray head","reference to glenda jackson","reference to peter finch","reference to catherine deneuve","older woman younger man relationship","photo shop","theft","stealing a kidney","death","friendship","homelessness","homophobia","flashing","storytelling","aids","male nudity","bar","surrealism","voice over narration","paranoia","urination","stockbroker","rainstorm","flashback","fantasy sequence","masturbation","gay","murder","vengeance","casual sex","urban legend","hate crime","gay bashing","closeted homosexual","based on play","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:15:51"}}