{"data":{"movies":[{"title":"Finding Forrester","originalTitle":"","year":"2000","releaseDate":"20010112","directors":[{"name":"Gus Van Sant","id":"nm0001814"}],"writers":[{"name":"Mike Rich","id":"nm0723692"}],"runtime":"136 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGQwYzY5ZDktMTI1My00ZjkwLTk3YjMtYWJmYTk2ZmQ0MjdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English","German"],"genres":["Drama"],"plot":"Because of scoring exceptionally high on a statewide standardized exam and being an exceptionally good basketball player Jamal Wallace is sent to a prestigious prep school in Manhattan. He soon befriends the reclusive writer, William Forrester. The friendship leads William to overcome his reclusiveness and for Jamal to overcome the racial prejudices and pursue his true dream - writing.","simplePlot":"A young writing prodigy finds a mentor in a reclusive author.","actors":[{"actorName":"Sean Connery","urlProfile":"http://www.imdb.com/name/nm0000125","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcwNTM4MzctYjQzMi00NTA2LTljYWItNTYzNmE1MTYxN2RlXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1930","placeOfBirth":" Edinburgh, Scotland, UK","birthName":"Thomas Sean Connery","height":"6' 2\" (1.88 m)","bio":"Sean Connery is best known for portraying the character James Bond, starring in seven Bond films between 1962 and 1983. In 1988, Connery won the Academy Award for Best Supporting Actor for his role in The Untouchables (1987). His film career also includes such films as Marnie (1964), The Name of the Rose (1986), The League of Extraordinary Gentlemen (2003), Indiana Jones and the Last Crusade (1989), The Hunt for Red October (1990), Highlander (1986), Murder on the Orient Express (1974), DragonHeart (1996) and The Rock (1996). Connery has been polled as \"The Greatest Living Scot\" and \"Scotland's Greatest Living National Treasure\". In 1989, he was proclaimed \"Sexiest Man Alive\" by People magazine, and in 1999, at age 69, he was voted \"Sexiest Man of the Century\". Thomas Sean Connery was born on August 25, 1930 in Fountainbridge, Edinburgh, Scotland. His mother, Euphemia McBain (née McLean), was a cleaning lady, and his father, Joseph Connery, was a factory worker and truck driver. He has a brother, Neil Connery, who works as a plasterer in Edinburgh. He is of Irish and Scottish descent. Before going into acting, Sean had many different jobs, such as a milkman, lorry driver, a laborer, artist's model for the Edinburgh College of Art, coffin polisher and bodybuilder. He also joined the Royal Navy, but was later discharged because of medical problems. At the age of 23, he had a choice between becoming a professional footballer or an actor, and even though he showed much promise in the sport, he chose acting and said it was one of his more intelligent moves. No Road Back (1957) was Sean's first major movie role, and it followed by several Tv-movies such as Anna Christie (1957), Macbeth (1961) and Anna Karenina (1961) and guest appearances on TV-series, and also films such as Hell Drivers (1957), Another Time, Another Place (1958), Darby O'Gill and the Little People (1959), The Frightened City (1961). In 1962 he appeared in The Longest Day (1962) with a host of other stars. Connery's breakthrough came in the role of secret agent James Bond. He was reluctant to commit to a film series, but understood that if the films succeeded his career would greatly benefit. He played the character in the first five Bond films: Dr. No (1962), From Russia with Love (1963), Goldfinger (1964), Thunderball (1965), and You Only Live Twice (1967) - then appeared again as Bond in Diamonds Are Forever (1971) and Never Say Never Again (1983). All seven films were commercially successful. James Bond, as portrayed by Connery, was selected as the third-greatest hero in cinema history by the American Film Institute. Connery's selection for the role of James Bond owed a lot to Dana Broccoli, wife of producer \"Cubby\" Broccoli, who is reputed to have been instrumental in persuading her husband that Connery was the right man. James Bond's creator, Ian Fleming, originally doubted Connery's casting, saying, \"He's not what I envisioned of James Bond looks\", and \"I'm looking for Commander Bond and not an overgrown stunt-man,\" adding that Connery (muscular, 6' 2\", and a Scot) was unrefined. Fleming's girlfriend told him that Connery had the requisite sexual charisma, and Fleming changed his mind after the successful Dr. No (1962) premiere. He was so impressed, he created a half-Scottish, half-Swiss heritage for Bond in the later novels. Connery's portrayal of Bond owes much to stylistic tutelage from director Terence Young, polishing the actor while using his physical grace and presence for the action. Lois Maxwell, who played Miss Moneypenny, related that, \"Terence took Sean under his wing. He took him to dinner, showed him how to walk, how to talk, even how to eat.\" The tutoring was successful; Connery received thousands of fan letters a week, and the actor became one of the great male sex symbols of film. During the filming of Thunderball (1965), Connery's life was in danger in the sequence with the sharks in Emilio Largo's pool. He had been concerned about this threat when he read the script. Connery insisted that Ken Adam build a special Plexiglas partition inside the pool, but, despite this, it was not a fixed structure and one of the sharks managed to pass through it. He had to abandon the pool immediately. Connery was forced to wear a toupee during each of the Bond movies because he had started balding at the age of 17. This didn't prevent Connery from being cast in roles, although it became more noticeable in his later years. In 2005, From Russia with Love was adapted by Electronic Arts into a video game, titled From Russia with Love (2005), which featured all-new voice work by Connery as well as his likeness, and those of several of the film's supporting cast. After and during the success of the Bond-films he has maintained a successful career as an actor and has appeared in films, including Alfred Hitchcock's Marnie (1964), The Hill (1965), Murder on the Orient Express (1974), The Man Who Would Be King (1975), The Wind and the Lion (1975), Time Bandits (1981), Highlander (1986), The Name of the Rose (1986), The Untouchables (1987) (which earned him an Oscar for best actor in a supporting role), Indiana Jones and the Last Crusade (1989), The Hunt for Red October (1990), Rising Sun (1993), The Rock (1996), Finding Forrester (2000), and The League of Extraordinary Gentlemen (2003). Sean married actress Diane Cilento in 1962 and they had a son, Jason Connery, born on January 11, 1963, he followed in his father's footsteps and also became an actor. The marriage ended in divorce in 1973. In 1975 he married Micheline Roquebrune and they have stayed married, they have no children together. He is also a grandfather. His son, Jason and his ex-wife, actress Mia Sara had a son, Dashiell Quinn Connery, in 1997.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcwNTM4MzctYjQzMi00NTA2LTljYWItNTYzNmE1MTYxN2RlXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000125","name":"Sean Connery","nicknames":["Big Tam"],"idIMDB":"nm0000125"},"actorId":"nm0000125","character":"William Forrester","urlCharacter":"http://www.imdb.com/character/ch0010817","main":true},{"actorName":"Rob Brown","urlProfile":"http://www.imdb.com/name/nm0114532","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNzkyMTU0M15BMl5BanBnXkFtZTcwMDk5MTcyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"March1984","placeOfBirth":" Harlem, New York City, New York, USA","height":"6' 1\" (1.85 m)","bio":"Rob Brown was born in Harlem and raised in Brooklyn, New York. A natural who never studied acting and who had no professional acting experience, made his acting and motion picture debut in Finding Forrester (2000). Rob celebrated his 16th birthday just before the start of production. He is a talented athlete in high school playing both basketball and football.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNzkyMTU0M15BMl5BanBnXkFtZTcwMDk5MTcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0114532","name":"Rob Brown","idIMDB":"nm0114532"},"actorId":"nm0114532","character":"Jamal Wallace","urlCharacter":"http://www.imdb.com/character/ch0010820","main":true},{"actorName":"F. Murray Abraham","urlProfile":"http://www.imdb.com/name/nm0000719","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQ2MzQ2ODYxM15BMl5BanBnXkFtZTcwODY3NTIxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 October 1939","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"Murray Abraham","height":"5' 10\" (1.78 m)","bio":"F. Murray Abraham was born on October 24, 1939 in Pittsburgh, Pennsylvania and raised in El Paso, Texas. Primarily a stage actor, Abraham made his screen debut as an usher in the George C. Scott comedy They Might Be Giants (1971). By the mid-1970s, Murray had steady employment as an actor, doing commercials and voice-over work. He can be seen as one of the undercover police officers along with Al Pacino in Sidney Lumet's Serpico (1973), and in television roles including the villain in one third-season episode of Kojak (1973). His film work of those years also included the roles of a cabdriver in The Prisoner of Second Avenue (1975), a mechanic in The Sunshine Boys (1975), and a police officer in All the President's Men (1976). Beyond these small roles, Abraham continued to do commercials and voice-over work for income. But in 1978, he decided to give them up. Frustrated with the lack of substantial roles, Abraham said, \"No one was taking my acting seriously. I figured if I didn't do it, then I'd have no right to the dreams I've always had\". His wife, Kate Hannan, went to work as an assistant and Abraham became a \"house husband\". He described, \"I cooked and cleaned and took care of the kids. It was very rough on my macho idea of life. But it was the best thing that ever happened to me\". Abraham appeared as drug dealer Omar Suárez alongside Pacino again in the gangster film Scarface (1983). He also gained visibility voicing a talking bunch of grapes in a series of television commercials for Fruit of the Loom underwear. In 1985 he was honored with as Academy Award for Best Performance by an Actor in a Leading Role for the acclaimed role of envious composer Antonio Salieri in Amadeus (1984), an award for which Tom Hulce, playing Mozart in that movie, had also been nominated. He was also honored with a Golden Globe for Best Performance by an Actor in a Motion Picture - Drama, among other awards, and his role in the film, is still considered to be his most iconic as the film's director Milos Forman inspired the work of the role with Abraham's wide range of qualities as a great stage and film actor. After Amadeus, he next appeared in The Name of the Rose (1986), in which he played Bernardo Gui, nemesis to Sean Connery's William of Baskerville. In the DVD audio commentary, his director on the film, Jean-Jacques Annaud, described Abraham as an \"egomaniac\" on the set, who considered himself more important than Sean Connery, since Connery did not have an Oscar. That said, the film was a critical success. Abraham had tired of appearing as villains and wanted to return to his background in comedy, as he also explained to People Weekly magazine in an interview he gave at the time of its release.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQ2MzQ2ODYxM15BMl5BanBnXkFtZTcwODY3NTIxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000719","name":"F. Murray Abraham","idIMDB":"nm0000719"},"actorId":"nm0000719","character":"Prof. Robert Crawford","urlCharacter":"http://www.imdb.com/character/ch0010819","main":true},{"actorName":"Anna Paquin","urlProfile":"http://www.imdb.com/name/nm0001593","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNzM2NjMzNl5BMl5BanBnXkFtZTgwOTE2Njk0MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 July 1982","placeOfBirth":" Winnipeg, Manitoba, Canada","birthName":"Anna Helene Paquin","height":"5' 4\" (1.63 m)","bio":"Anna Paquin is the first millennial to have received an Academy Award nomination for acting, and the first to win. She was born in Winnipeg, Manitoba, Canada, in 1982, to Mary (Brophy), an English teacher from Wellington, New Zealand, and Brian Paquin, a Canadian phys-ed teacher. Anna moved to her mother's native country when she was four years old. Her first acting job ever was at age nine in the film La leçon de piano (1993), which she ended up being cast in because it was shot in New Zealand. At age 16, she relocated to Los Angeles where she completed her last two years of high school (graduating in 2000). She then moved to New York where she attended Columbia University for one year. Between 2001 and 2004 she worked almost exclusively on stage in both New York and London. In 2007 Anna was cast in HBO's \"True Blood\", which concluded shooting its 7th and final season in 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNzM2NjMzNl5BMl5BanBnXkFtZTgwOTE2Njk0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001593","name":"Anna Paquin","idIMDB":"nm0001593"},"actorId":"nm0001593","character":"Claire Spence","urlCharacter":"http://www.imdb.com/character/ch0010818","main":true},{"actorName":"Busta Rhymes","urlProfile":"http://www.imdb.com/name/nm0005354","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MjUyNjM1M15BMl5BanBnXkFtZTcwMzUxMjc3MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 May 1972","placeOfBirth":" Brooklyn, New York, USA","birthName":"Trevor Tahiem Smith Jr.","height":"6' 1\" (1.85 m)","bio":"Busta Rhymes was born on May 20, 1972 in Brooklyn, New York, USA as Trevor Tahiem Smith Jr.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MjUyNjM1M15BMl5BanBnXkFtZTcwMzUxMjc3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005354","name":"Busta Rhymes","nicknames":["Bus-a-Bus"],"idIMDB":"nm0005354"},"actorId":"nm0005354","character":"Terrell Wallace","urlCharacter":"http://www.imdb.com/character/ch0010821","main":true},{"actorName":"April Grace","urlProfile":"http://www.imdb.com/name/nm0333318","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE1Y2Y2MzUtNjE4NS00MWI0LTg5ZjItMGMwNzMzNzVlNWQwXkEyXkFqcGdeQXVyMTU5MTI0Mjg@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1962","placeOfBirth":" Lakeland, Florida, USA","bio":"April Grace was born on May 12, 1962 in Lakeland, Florida, USA. She is an actress, known for I Am Legend (2007), Whiplash (2014) and A.I. Artificial Intelligence (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE1Y2Y2MzUtNjE4NS00MWI0LTg5ZjItMGMwNzMzNzVlNWQwXkEyXkFqcGdeQXVyMTU5MTI0Mjg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0333318","name":"April Grace","idIMDB":"nm0333318"},"actorId":"nm0333318","character":"Ms. Joyce","urlCharacter":"http://www.imdb.com/character/ch0068804","main":true},{"actorName":"Michael Pitt","urlProfile":"http://www.imdb.com/name/nm0685856","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMDM3MTE1M15BMl5BanBnXkFtZTcwOTI4Njg2Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1981","placeOfBirth":" West Orange, New Jersey, USA","birthName":"Michael Carmen Pitt","height":"5' 11\" (1.8 m)","bio":"Michael Carmen Pitt (born April 10, 1981) is an American actor, model and musician. A casting agent, whom Pitt mistook as a police officer attempting to arrest him, noticed him and recommended him for a guest role on the television series Dawson's Creek (1998) (he played Henry Parker in 15 episodes between 1999 and 2000). Rising through the ranks of indie cinema, Michael starred in dramas like Hedwig and the Angry Inch (2001), The Dreamers (2004), and Last Days (2005), along with roles in the thrillers Murder by Numbers (2002) and Funny Games (2007). Moving back to television, he played Jimmy Darmody on Boardwalk Empire (2010) and Mason Verger in Hannibal (2013). In 2017, he appears opposite Scarlett Johansson in the science fiction action adaptation Ghost in the Shell (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMDM3MTE1M15BMl5BanBnXkFtZTcwOTI4Njg2Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0685856","name":"Michael Pitt","idIMDB":"nm0685856"},"actorId":"nm0685856","character":"John Coleridge","urlCharacter":"http://www.imdb.com/character/ch0068805","main":true},{"actorName":"Michael Nouri","urlProfile":"http://www.imdb.com/name/nm0636694","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNDQxMjI2NV5BMl5BanBnXkFtZTcwMjkxNTE2Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 December 1945","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Michael David Nouri","height":"6' 3\" (1.91 m)","bio":"Michael Nouri was born on December 9, 1945 in Washington, District of Columbia, USA as Michael David Nouri. He is an actor, known for Flashdance (1983), The Proposal (2009) and The Terminal (2004). He was previously married to Vicki Light and Lynn Goldsmith.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNDQxMjI2NV5BMl5BanBnXkFtZTcwMjkxNTE2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0636694","name":"Michael Nouri","idIMDB":"nm0636694"},"actorId":"nm0636694","character":"Dr. Spence","urlCharacter":"http://www.imdb.com/character/ch0068806","main":true},{"actorName":"Richard Easton","urlProfile":"http://www.imdb.com/name/nm0247733","urlPhoto":"","biography":{"dateOfBirth":"22 March 1933","placeOfBirth":" Montréal, Québec, Canada","bio":"Richard Easton was born on March 22, 1933 in Montréal, Québec, Canada. He is known for his work on The Brothers (1972), Finding Forrester (2000) and Revolutionary Road (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0247733","name":"Richard Easton","idIMDB":"nm0247733"},"actorId":"nm0247733","character":"Prof. Matthews","urlCharacter":"http://www.imdb.com/character/ch0068807","main":true},{"actorName":"Glenn Fitzgerald","urlProfile":"http://www.imdb.com/name/nm0280245","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDY4NGJmMjYtMTEyMC00ODJkLTlhMWYtMGY3OWZiZjBmZjcyXkEyXkFqcGdeQXVyNjkwMzc4Mzc@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 December 1971","placeOfBirth":" Brooklyn, New York City, New York, USA","bio":"Glenn Fitzgerald is a highly regarded actor of stage, film, and television. Film roles include: Lonnie, the son of Alan Alda and Lily Tomlin in David O. Russell's cult classic Flirting with Disaster; Neil, the boy at the \"key party\" that goes home with Sigourney Weaver in Ang Lee's The Ice Storm; the Hasidic scholar husband of Renee Zellwegger in A Price Above Rubies; the uptight assistant to Sean Connery in Gus Van Sant's Finding Forester; and the earnest antique dealer in love with Bruce Willis' wife in M. Night Shyamalan's The Sixth Sense. He has also played diverse roles in several indies including: a terminally ill pacifist forced to fight for his life in Series 7; a sociopathic skinhead opposite Ryan Gosling in The Believer; the sensitive, kind brother in Tully; and the reckless, drug-addled tank commander opposite Joaquin Phoenix in Buffalo Soldiers. Between film jobs Glenn has built a respected stage career, originating roles in Jon Robin Baitz's Mizlansky/Zilinsky, opposite Nathan Lane and directed by Joe Mantello; Kenneth Lonergan's Lobby Hero (nominated for a Lucille Lortel Award for Outstanding Lead Actor), Will Eno's The Realistic Joneses at Yale Rep with Tracy Letts and Parker Posey, directed by Sam Gold and David Lindsay-Abaire's Ripcord with Holland Taylor. He's appeared in innovative productions of classic plays such as Hedda Gabler at New York Theatre Workshop directed by Ivo van Hove; The Importance of Being Earnest at Williamstown Theater Festival directed by David Hyde Pierce and starring Tyne Daly; CSC's Ivanov and Hamlet directed by Austin Pendleton alongside Ethan Hawke and Peter Sarsgaard; and Othello directed by Sam Gold at New York Theatre Workshop with Daniel Craig and David Oyelowo. Television credits include series regular Brian Darling on ABC's Dirty Sexy Money, and guest starring roles on Six Feet Under, Billions, Madam Secretary, Elementary, Law and Order, Law and Order: Criminal Intent, Homicide, and CSI:Miami. Glenn is also a photographer whose intimate, behind-the-scenes portraits of theater productions have been featured in the New York Times.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDY4NGJmMjYtMTEyMC00ODJkLTlhMWYtMGY3OWZiZjBmZjcyXkEyXkFqcGdeQXVyNjkwMzc4Mzc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0280245","name":"Glenn Fitzgerald","idIMDB":"nm0280245"},"actorId":"nm0280245","character":"Massie, Forrester's Delivery Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lil' Zane","urlProfile":"http://www.imdb.com/name/nm0178580","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5MDUyNjM0MV5BMl5BanBnXkFtZTgwNTA3NTE2MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1982","placeOfBirth":" Yonkers, New York, USA","birthName":"Zane R. Copeland Jr","height":"5' 5\" (1.65 m)","bio":"Actor/rapper Lil' Zane was named after his dad and grew up in Atlanta, Georgia. He has been writing and rhyming since he was 10. When he was 11 he approached Worldwide Entertainment CEO Kevin Wales outside an Atlanta talent show and told him he wanted to be a star. Zane got his big break on 112's \"Anywhere\" song. He earned props for his writing skills on \"Angels With Dirty Faces\" for Sean Combs's album. He grew up listening to LL Cool J and Whodini and wants to use his music as a stepping stone to get into other things like acting and hosting a talk show. His LP on Priority Records, \"Young World The Future\", is in stores. When he was told that he was wanted to do a rap verse on the song \"Anywhere\" he only had 30 minutes to write his verse, because they booked the studio time until 12 and it was 11:30 when he got there.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5MDUyNjM0MV5BMl5BanBnXkFtZTgwNTA3NTE2MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0178580","name":"Lil' Zane","nicknames":["Lil' Zane"],"idIMDB":"nm0178580"},"actorId":"nm0178580","character":"Damon","urlCharacter":"http://www.imdb.com/character/ch0068808","main":true},{"actorName":"Stephanie Berry","urlProfile":"http://www.imdb.com/name/nm0077678","urlPhoto":"","biography":{"bio":"Stephanie Berry is an actress, known for Finding Forrester (2000), The Invasion (2007) and No Reservations (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0077678","name":"Stephanie Berry","idIMDB":"nm0077678"},"actorId":"nm0077678","character":"Janice Wallace","urlCharacter":"http://www.imdb.com/character/ch0068809","main":true},{"actorName":"Fly Williams III","urlProfile":"http://www.imdb.com/name/nm0929936","urlPhoto":"","biography":{"bio":"Fly Williams III is an actor, known for Finding Forrester (2000), Freedomland (2006) and Three Quarters of Face Value (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0929936","name":"Fly Williams III","idIMDB":"nm0929936"},"actorId":"nm0929936","character":"Fly","urlCharacter":"http://www.imdb.com/character/ch0068810","main":true},{"actorName":"Damany Mathis","urlProfile":"http://www.imdb.com/name/nm0558910","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg2ODM5ZTEtNzYxYi00MDVlLThmNDUtNDRiYTY4YmFmODIyXkEyXkFqcGdeQXVyNTc5NDkwODA@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 April 1982","placeOfBirth":" Harlem, New York, USA","height":"6' 1\" (1.85 m)","bio":"At the forefront of New York City's musical resurrection is Harlem rapper/actor Damany Mathis (Rugz D. Bewler). The former Roc-A-Fella intern turned prominent emcee emerged on the music scene in 2010 as part of the independent music collective DD172/BluRoc Records, where he penned the popular underground hit \"Super Bad.\" The song's success catapulted Damany Mathis (Rugz D. Bewler) as a talent fans and music insiders alike had to pay close attention to. With a heightened profile, Damany Mathis (Rugz D. Bewler) capitalized on his newfound notoriety by releasing his first mixtape, Bewler's Day Off. To continue building his buzz and further his progress, Damany Mathis (Rugz D. Bewler) followed up with the releases of Save Bewler: The Memoirs of Muhammad Mc'Fly, All I Need Is 20: The Lover's Rock Edition, and By Any Means Necessary, all projects consisting of original music distributed for free download. Focused on creating timeless music, Damany Mathis (Rugz D. Bewler) continues to capture the hearts and support of listeners, strengthening his connection with fans through his ability to craft songs with universal themes and messages that resonate with a wide a range of people. Sold-out shows, brand sponsorships, and national radio and television appearances have steadily contributed to Rugz D. Bewler's ascent as one of The Big Apple's next notable rappers, establishing himself as another individual from Harlem to influence popular music and culture.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg2ODM5ZTEtNzYxYi00MDVlLThmNDUtNDRiYTY4YmFmODIyXkEyXkFqcGdeQXVyNTc5NDkwODA@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0558910","name":"Damany Mathis","nicknames":["Rugz D. Bewler"],"idIMDB":"nm0558910"},"actorId":"nm0558910","character":"Kenzo","urlCharacter":"http://www.imdb.com/character/ch0068811","main":true},{"actorName":"Damion Lee","urlProfile":"http://www.imdb.com/name/nm0497082","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4OTkwNDgwOF5BMl5BanBnXkFtZTgwMDkxNTQzOTE@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"bio":"Hailing from the Flatbush section of Brooklyn, NY. He was approached by a talent agent while riding a New York City subway train. This chance encounter landed his first feature film role alongside Sean Connery and Rob Brown in the drama \"Finding Forrester.\" Fast forward to 2005, he began auditioning again and began to book major roles in several indie films one after the other. Among those many film roles is the critically acclaimed \"Blueprint\" (Dir: Kirk Shannon-Butts) in which he portrays a young college student having a romantic getaway with his male love interest. He took a more serious turn in the highly anticipated \"True Story\" (Dir: Rasheed Wilds) as the hot headed antagonist and drug dealer D. In the upcoming film \"Soft Focus\" (Dir: Rod Gailes, OBC) he stars as Marcus, a man living two lives at one time. Other credits include \"When It Rains\", \"44\", \"Israel\", \"Sam\" & \"Pressure.\" When Damion is not in front of the camera he coaches other actors, writes and performs his own poetry, and enjoys deep conversations about the journey of life.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4OTkwNDgwOF5BMl5BanBnXkFtZTgwMDkxNTQzOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0497082","name":"Damion Lee","idIMDB":"nm0497082"},"actorId":"nm0497082","character":"Clay","urlCharacter":"http://www.imdb.com/character/ch0068812","main":true}],"seasons":[],"idIMDB":"tt0181536","urlIMDB":"http://www.imdb.com/title/tt0181536","business":{"budget":{"money":"$43,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$701,207","country":"USA","day":"25","month":"12","year":"2000","remarks":"200 Screens"},{"money":"£381,822","country":"UK","day":"25","month":"02","year":"2001","remarks":"258 Screens"}],"gross":[{"money":"$51,768,623","country":"USA","day":"15","month":"04","year":"2001","remarks":""},{"money":"$51,706,678","country":"USA","day":"08","month":"04","year":"2001","remarks":""},{"money":"$51,584,820","country":"USA","day":"01","month":"04","year":"2001","remarks":""},{"money":"$51,370,406","country":"USA","day":"25","month":"03","year":"2001","remarks":""},{"money":"$51,022,867","country":"USA","day":"18","month":"03","year":"2001","remarks":""},{"money":"$50,590,601","country":"USA","day":"11","month":"03","year":"2001","remarks":""},{"money":"$50,041,645","country":"USA","day":"04","month":"03","year":"2001","remarks":""},{"money":"$49,101,695","country":"USA","day":"25","month":"02","year":"2001","remarks":""},{"money":"$47,641,383","country":"USA","day":"18","month":"02","year":"2001","remarks":""},{"money":"$44,810,828","country":"USA","day":"11","month":"02","year":"2001","remarks":""},{"money":"$41,277,446","country":"USA","day":"04","month":"02","year":"2001","remarks":""},{"money":"$35,677,842","country":"USA","day":"28","month":"01","year":"2001","remarks":""},{"money":"$29,201,113","country":"USA","day":"21","month":"01","year":"2001","remarks":""},{"money":"$20,537,936","country":"USA","day":"14","month":"01","year":"2001","remarks":""},{"money":"$8,565,522","country":"USA","day":"07","month":"01","year":"2001","remarks":""},{"money":"$5,301,731","country":"USA","day":"01","month":"01","year":"2001","remarks":""},{"money":"$743,056","country":"USA","day":"25","month":"12","year":"2000","remarks":""},{"money":"£722,893","country":"UK","day":"04","month":"03","year":"2001","remarks":""},{"money":"£381,822","country":"UK","day":"25","month":"02","year":"2001","remarks":""},{"money":"€1,919,062","country":"Spain","day":"31","month":"08","year":"2002","remarks":""},{"money":"ESP 283,653,614","country":"Spain","day":"30","month":"06","year":"2001","remarks":""}],"weekendGross":[{"money":"$47,249","country":"USA","day":"15","month":"04","year":"2001","remarks":"76 Screens"},{"money":"$85,812","country":"USA","day":"08","month":"04","year":"2001","remarks":"128 Screens"},{"money":"$141,173","country":"USA","day":"01","month":"04","year":"2001","remarks":"177 Screens"},{"money":"$260,177","country":"USA","day":"25","month":"03","year":"2001","remarks":"279 Screens"},{"money":"$342,144","country":"USA","day":"18","month":"03","year":"2001","remarks":"373 Screens"},{"money":"$400,574","country":"USA","day":"11","month":"03","year":"2001","remarks":"363 Screens"},{"money":"$655,716","country":"USA","day":"04","month":"03","year":"2001","remarks":"578 Screens"},{"money":"$1,093,331","country":"USA","day":"25","month":"02","year":"2001","remarks":"808 Screens"},{"money":"$2,007,353","country":"USA","day":"18","month":"02","year":"2001","remarks":"1,130 Screens"},{"money":"$2,506,165","country":"USA","day":"11","month":"02","year":"2001","remarks":"1,586 Screens"},{"money":"$4,213,168","country":"USA","day":"04","month":"02","year":"2001","remarks":"1,983 Screens"},{"money":"$4,612,998","country":"USA","day":"28","month":"01","year":"2001","remarks":"2,002 Screens"},{"money":"$6,714,733","country":"USA","day":"21","month":"01","year":"2001","remarks":"2,002 Screens"},{"money":"$11,112,139","country":"USA","day":"14","month":"01","year":"2001","remarks":"2,002 Screens"},{"money":"$2,212,810","country":"USA","day":"07","month":"01","year":"2001","remarks":"200 Screens"},{"money":"$3,020,028","country":"USA","day":"01","month":"01","year":"2001","remarks":"200 Screens"},{"money":"$701,207","country":"USA","day":"25","month":"12","year":"2000","remarks":"200 Screens"},{"money":"£161,069","country":"UK","day":"04","month":"03","year":"2001","remarks":"205 Screens"},{"money":"£381,822","country":"UK","day":"25","month":"02","year":"2001","remarks":"258 Screens"}],"admissions":[{"money":"17,167","country":"Netherlands","day":"31","month":"12","year":"2001","remarks":""},{"money":"447,796","country":"Spain","day":"31","month":"08","year":"2002","remarks":""},{"money":"388,734","country":"Spain","day":"30","month":"06","year":"2001","remarks":""}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["2 hr 16 min (136 min)"],"soundMix":["Dolby Digital","DTS","SDDS (8 channels)"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA (prints)"],"filmLength":["3,752 m (Sweden)","3,794 m (Spain)"],"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm (Fuji F-CP 3519)"]},"rating":"7.3","metascore":"62","filmingLocations":[{"location":"Copps Coliseum, Hamilton, Ontario, Canada"}],"rated":"PG-13","awards":[{"award":"Berlin International Film Festival 2001","titlesAwards":[{"titleAwardOutcome":"Won Prize of the Guild of German Art House Cinemas","categories":[{"category":"","names":[{"name":"Gus Van Sant","id":"nm0001814","role":null}]}]},{"titleAwardOutcome":"Nominated Golden Berlin Bear","categories":[{"category":"","names":[{"name":"Gus Van Sant","id":"nm0001814","role":null}]}]}]},{"award":"Black Reel Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated Black Reel","categories":[{"category":"Theatrical - Best Supporting Actor","names":[{"name":"Rob Brown","id":"nm0114532","role":null}]}]}]},{"award":"Casting Society of America, USA 2001","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Best Casting for Feature Film, Drama","names":[{"name":"Francine Maisler","id":"nm0537892","role":null},{"name":"Bernard Telsey","id":"nm0854549","role":null}]}]}]},{"award":"Chicago Film Critics Association Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated CFCA Award","categories":[{"category":"Most Promising Actor","names":[{"name":"Rob Brown","id":"nm0114532","role":null}]}]}]},{"award":"Christopher Awards 2001","titlesAwards":[{"titleAwardOutcome":"Won Christopher Award","categories":[{"category":"Feature Films","names":[{"name":"Gus Van Sant","id":"nm0001814","role":"director"},{"name":"Mike Rich","id":"nm0723692","role":"screenwriter"},{"name":"Laurence Mark","id":"nm0548257","role":"producer"},{"name":"Sean Connery","id":"nm0000125","role":"producer"},{"name":"Rhonda Tollefson","id":"nm0866104","role":"producer"},{"name":"Dany Wolf","id":"nm0937714","role":"executive producer"},{"name":"Jonathan King","id":"nm0454908","role":"executive producer"}]}]}]},{"award":"Dallas-Fort Worth Film Critics Association Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated DFWFCA Award","categories":[{"category":"Best Actor","names":[{"name":"Sean Connery","id":"nm0000125","role":null}]},{"category":"Best Picture","names":[]}]}]},{"award":"Golden Trailer Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Best Art and Commerce","names":[{"name":"Aspect Ratio","id":null,"role":null}]}]}]},{"award":"Las Vegas Film Critics Society Awards 2000","titlesAwards":[{"titleAwardOutcome":"Won Sierra Award","categories":[{"category":"Best Male Newcomer","names":[{"name":"Rob Brown","id":"nm0114532","role":null}]}]}]},{"award":"Online Film & Television Association 2001","titlesAwards":[{"titleAwardOutcome":"Nominated OFTA Film Award","categories":[{"category":"Best Youth Performance","names":[{"name":"Rob Brown","id":"nm0114532","role":null}]},{"category":"Best First Screenplay","names":[{"name":"Mike Rich","id":"nm0723692","role":null}]}]}]},{"award":"Phoenix Film Critics Society Awards 2001","titlesAwards":[{"titleAwardOutcome":"Won PFCS Award","categories":[{"category":"Best Newcomer","names":[{"name":"Rob Brown","id":"nm0114532","role":null}]}]},{"titleAwardOutcome":"Nominated PFCS Award","categories":[{"category":"Best Performance by a Youth in a Leading or Supporting Role","names":[{"name":"Rob Brown","id":"nm0114532","role":null}]},{"category":"Best Screenplay - Original","names":[{"name":"Mike Rich","id":"nm0723692","role":null}]}]}]},{"award":"Satellite Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Satellite Award","categories":[{"category":"Best Performance by an Actor in a Motion Picture, Drama","names":[{"name":"Sean Connery","id":"nm0000125","role":null}]}]}]},{"award":"Young Artist Awards 2001","titlesAwards":[{"titleAwardOutcome":"Won Young Artist Award","categories":[{"category":"Best Performance in a Feature Film - Leading Young Actor","names":[{"name":"Rob Brown","id":"nm0114532","role":null}]}]},{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Family Feature Film - Drama","names":[]}]}]}],"votes":"74,714","type":"Movie","companyCreditsSimple":[{"idCompany":"co0050868","name":"Columbia Pictures Corporation"},{"idCompany":"co0248885","name":"Finding Forrester Productions"},{"idCompany":"co0103746","name":"Fountainbridge Films"}],"keywords":{"keywords":["school","writing","basketball","new york","mentor","recluse","two word title","brooklyn new york city","famous line","catcher in the rye","inner city","basketball movie","man with glasses","unlikely friendship","reference to kipling","reference to mark twain","reference to coleridge","age difference","interracial relationship","racism","break in","new york city","student mentor relationship","plagiarism","interracial romance","african american","teacher student relationship","child prodigy","writing contest","private school","new york yankees","brother brother relationship","peer pressure","academic fraud","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:49:08"}}