{"data":{"movies":[{"title":"Beautiful Girls","originalTitle":"","year":"1996","releaseDate":"19960209","directors":[{"name":"Ted Demme","id":"nm0001130"}],"writers":[{"name":"Scott Rosenberg","id":"nm0003298"}],"runtime":"112 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NjU0NDM0NV5BMl5BanBnXkFtZTYwODU5MjY5._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama","Romance"],"plot":"New York based jazz pianist Willie Conway heads back to his small hometown of Knights Ridge, Massachusetts for a high school reunion. The trip is as much to go to the reunion and see his old friends - none of whom left Knights Ridge after graduation - as it is to get away from his current life, at which he is at a crossroads both personally and professionally. He is just eking out a living with his piano playing gigs, and as such he is thinking about taking a sales job. He's also not sure if he's ready to marry his long time girlfriend, lawyer Tracy Stover. Most of Willie's Knights Ridge blue collar friends' best days were in high school, they still having that \"trophy\" mentality of girlfriends and wives. Only Michael \"Mo\" Morris is happily married with a family. Paul Kirkwood, whose room is plastered with magazine pictures of models, wants his waitress ex-girlfriend Jan back only because he knows now that he can't have her. And Tommy \"Birdman\" Rowland, who was the big man in high ...","simplePlot":"A piano player at a crossroads in his life returns home to his friends and their own problems with life and love.","actors":[{"actorName":"Matt Dillon","urlProfile":"http://www.imdb.com/name/nm0000369","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzk4NjI3NjQ0MF5BMl5BanBnXkFtZTgwMzE3NzI5NzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 February 1964","placeOfBirth":" New Rochelle, New York, USA","birthName":"Matthew Raymond Dillon","height":"6' (1.83 m)","bio":"Matt Dillon's successful film career has spanned over three decades and has showcased his wide range of dramatic and comedic talents. Dillon displayed his versatility with an arresting performance co-starring as a racist cop in the critically acclaimed Paul Haggis film Crash. This role earned him nominations for an Academy award, Golden Globe Award, Screen Actors Guild Award, Critics Choice Award, BAFTA Award and won him an Independent Spirit Award. In addition, the film earned him a Screen Actors Guild Award and a Critics Choice Award for Best Ensemble. As the New York Times' Film Critic A.O. Scott put it, \"He seems to be getting better with every film.\" He starred opposite Kate Hudson and Owen Wilson in Universal Pictures' comedy, You, Me and Dupree and in Factotum for which he received glowing reviews for portraying Charles Bukowski's alter ego when the film premiered at the Cannes Film Festival. From his breakthrough performance in The Outsiders to his hilarious turn as an obsessed private investigator in There's Something About Mary, he has proven himself to be one of the most diverse actors of his generation. In 1990 Dillon won an IFP Spirit Award for his gritty performance as a drug addict in Gus Van Sant's Drugstore Cowboy. From there he went on to star in such films as Ted Demme's Beautiful Girls opposite Uma Thurman and Natalie Portman, Cameron Crowe's Singles, In & Out with Kevin Kline, Kevin Spacey's Albino Alligator, Francis Ford Coppola's Rumble Fish, Garry Marshall's Flamingo Kid, Van Sant's To Die For with Nicole Kidman, and John McNaughton's Wild Things. He starred in Nothing But The Truth, opposite Kate Beckinsale and Vera Farmiga, Disney's Old Dogs, opposite John Travolta, Robin Williams and Kelly Preston, and the Screen Gems films Armored and Takers. Aside from being an accomplished actor, Dillon wrote, and made his feature film directorial debut with City of Ghosts, in which he also starred with Gérard Depardieu, Stellan Skarsgård, and James Caan. Prior to City of Ghosts, Dillon made his television directorial debut in 1997 with an episode of HBO's gritty prison drama Oz. Dillon's achievements continued with television appearances in an HBO adaptation of Irwin Shaw's Return To Kansas City and a part co-narrating the documentary Dear America: Letters From Home. Dillon's multi-talents have also landed him on stage starring on Broadway in The Boys In Winter as well as the PBS/American Playhouse production of The Great American Fourth Of July And Other Disasters. His recent film credits include the comedy Girl Most Likely opposite Annette Bening and Kristen Wiig; the drama Sunlight, Jr. opposite Naomi Watts, and the heist comedy The Art Of The Steal opposite Kurt Russell. Dillon most recently starred in M. Night Shyamalan's hit television event series Wayward Pines for FOX.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzk4NjI3NjQ0MF5BMl5BanBnXkFtZTgwMzE3NzI5NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000369","name":"Matt Dillon","idIMDB":"nm0000369"},"actorId":"nm0000369","character":"Tommy 'Birdman' Rowland","urlCharacter":"http://www.imdb.com/character/ch0015507","main":true},{"actorName":"Noah Emmerich","urlProfile":"http://www.imdb.com/name/nm0001187","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNjg4MzgxNV5BMl5BanBnXkFtZTcwMTQ5NTYzNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1965","placeOfBirth":" New York City, New York, USA","birthName":"Noah Nicholas Emmerich","height":"6' 3\" (1.91 m)","bio":"Noah Emmerich was born and raised in New York City, to Constance, a concert pianist, and André Emmerich, an art dealer and gallery owner. He attended Yale University, where he sang with the a capella group the Yale Spizzwinks. He attended NYU Film School where he wrote and directed an award winning short film called \"The Painter.\" Emmerich came to prominence with starring roles in the cult hit Beautiful Girls (1996) and the Jim Carrey blockbuster The Truman Show (1998). He is considered a real \"actor's actor,\" noted for his understated, subtle realism and his deep emotional presence on screen. His production company, Sandbox Entertainment, has a first-look production deal with New Line Cinema. His older brother is Toby Emmerich.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNjg4MzgxNV5BMl5BanBnXkFtZTcwMTQ5NTYzNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001187","name":"Noah Emmerich","idIMDB":"nm0001187"},"actorId":"nm0001187","character":"Michael 'Mo' Morris","urlCharacter":"http://www.imdb.com/character/ch0015517","main":true},{"actorName":"Annabeth Gish","urlProfile":"http://www.imdb.com/name/nm0001272","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMzQyNTMwOF5BMl5BanBnXkFtZTgwNzQyNzI2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 March 1971","placeOfBirth":" Albuquerque, New Mexico, USA","birthName":"Anne Elizabeth Gish","height":"5' 8\" (1.73 m)","bio":"A versatile actress, Annabeth Gish weathered the transition from child actor to adult, with a variety of dramatic and comedic roles on film and television. Anne Elizabeth Gish was born on March 13, 1971 in Albuquerque, New Mexico and moved with her family to Cedar Falls, at the age of two. Her parents were both teachers; her father, Robert Gish, was an English professor at the University of Northern Iowa, her mother, Judy, taught at Malcolm Price Laboratory School. Performing in community theater productions throughout her childhood, Gish began her professional acting career, at the age of eight, by appearing in a number of commercials. She made her screen debut, at the age of 13, in the teen film, Desert Bloom (1986), opposite Jon Voight, and, in following years, has found success in film and television. Gish starred in the films, Hiding Out (1987), with Jon Cryer, Mystic Pizza (1988), with Julia Roberts, and on Shag (1989), opposite Phoebe Cates and Bridget Fonda. She also played the lead role, as rape victim \"Lyn McKenna\", in the TV movie, When He's Not a Stranger (1989). Gish went on to graduate from Cedar Falls' Northern University High School in 1989. In addition to acting, Gish took time to focus on her academic career and attended Duke University. Studying English as well as theater, she graduated with honors, in 1993, with a BA in English. Gish returned to screens in the mid-1990s, with appearances in supporting roles, in films Wyatt Earp (1994), The Last Supper (1995) and critical praise biopic, Nixon (1995). The next year, Gish appeared in the ensemble cast movie, Beautiful Girls (1996). On television, Gish played the younger sister of Dana Delany's character in True Women (1997), a epic miniseries, based on the best seller novel by Janice Woods Windle. Her other credits include the miniseries, Scarlett (1994), the short-lived Patricia Wettig's drama series Courthouse (1995), the box office bomb superhero film, Steel (1997), a supporting role on Ashley Judd's success thriller, Double Jeopardy (1999), and several other independent films. Most recently, Gish played \"Special Agent Monica Reyes\" on the cult series, The X-Files (1993) (2001-2002), for which she was nominated for a Saturn Award for Best Supporting Actress on Television. She also starred in the Showtime drama, Brotherhood (2006) (2006-2008) and appeared in recurring roles on The West Wing (1999) (2003-2006), Flashforward (2009) (2010), Pretty Little Liars (2010) (2011-2012) and CSI: Crime Scene Investigation (2000) (2011-2012). In 2012, she starred on the ABC drama series, Americana (2012), as Ashley Greene's character's mother.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMzQyNTMwOF5BMl5BanBnXkFtZTgwNzQyNzI2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001272","name":"Annabeth Gish","idIMDB":"nm0001272"},"actorId":"nm0001272","character":"Tracy Stover","urlCharacter":"http://www.imdb.com/character/ch0015514","main":true},{"actorName":"Lauren Holly","urlProfile":"http://www.imdb.com/name/nm0000452","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMDA0NDcyMl5BMl5BanBnXkFtZTgwNzE2ODkwODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 October 1963","placeOfBirth":" Bristol, Pennsylvania, USA","birthName":"Lauren Michael Holly","height":"5' 5\" (1.65 m)","bio":"Born in Bristol, Pennsylvania, the daughter of two college professors, Lauren grew up in the upstate New York town of Geneva. Her childhood was split between experiences that contrasted. She was privy to the shelter of growing up in a rural town and also exposed due to the erudite sophistication of her parents' academic careers. Lauren spent time traveling in Europe and lived for a year in London, where she studied languages and flute at the famed Sarah Siddons School. A graduate of Sarah Lawrence College in New York, Lauren credits her love of acting to her great-grandmother who bred a family tradition of \"treading the boards\" on the musical theatre stages of Liverpool and London. Lauren's breakthrough motion picture performance came in the New Line Cinema's box-office smash, Dumb & Dumber (1994), with Jim Carrey and Jeff Daniels. Lauren captured the hearts of audiences, as \"Mary Swanson\", the woman who drove Jim Carrey to follow her across the country to pledge his love. Next, she received glowing reviews for her performance in the Edward Burns drama, No Looking Back (1998), as a woman whose life in a small seaside community is turned upside down by the reappearance of her ex-boyfriend. Lauren's other film credits include Oliver Stone's \"Any Given Sunday,\" with Al Pacino, Cameron Diaz and Jamie Fox, Sydney Pollack's \"Sabrina,\" starring Harrison Ford, the action-drama \"Turbulence,\" co-starring Ray Liotta, the Miramax ensemble \"Beautiful Girls,\" a lead role in the Universal production of \"Dragon: The Bruce Lee Story,\" \"A Smile Like Yours,\" \"The Adventures of Ford Fairlane,\" the comedy \"Down Periscope,\" starring Kelsey Grammer, \"Entropy\" and \"The Last Producer,\" starring and directed by Burt Reynolds.In television, Lauren's credits are no less impressive. Lauren recently starred in 2 films for Hallmark. She also boasts three seasons as Director Jenny Shepard in CBS/Paramount Television's top-rated drama series NCIS. Lauren was seen in the TNT movie \"King of Texas,\" an adaptation of Shakespeare's \"King Lear,\" playing opposite Oscar winner Marcia Gay Harden and renowned actor Patrick Stewart, and in the NBC miniseries \"Jackie, Ethel, Joan: Women of Camelot,\" alongside Jill Hennessy and Leslie Stefanson. Additionally, Lauren starred as plastic surgeon Jeremy Hanlon on David E. Kelley's Emmy Award-nominated CBS drama, \"Chicago Hope,\" marking her second project with Kelley, following their successful collaboration on the critically acclaimed, Emmy Award-winning series, \"Picket Fences.\" Lauren has worked on numerous Independent films. These feature films include the political thriller \"Fatwa,\" in which she not only acted but also served as a producer, the Peter Schwaba penned and directed comedy \"Godfather of Green Bay,\" \"The Chumscrubber,\" an Arie Posen directed, independent film to be released by DreamWorks, \"Pleasure Drivers,\" directed by acclaimed cinematographer Andrej Sekula and co-starring Angus McFadden, a Lifetime movie \"Caught in the Act,\" which she also produced, and \"Chasing 3000\". Most recently, Lauren starred in \"You're So Cupid\" with Brian Krause and Jeremy Sumpter. Additional projects contributing to the broad and diverse body of motion picture work Lauren has compiled include the drama \"Colored Eggs\" with Faye Dunaway, the comedy \"Raising Flagg\" playing opposite Oscar winner Alan Arkin, the Darrell Roodt directed HBO thriller, \"Pavement\", co-starring Robert Patrick and Paramount Pictures', and \"What Women Want\" opposite Mel Gibson and Helen Hunt. In addition, Lauren served a lead role in Disney's Oscar winning animated motion picture \"Spirited Away\" as the voice of Chihiro's Mother. Coming up she will play a lead in \"Perfect Age of Rock and Roll,\" produced by Spike Lee. Lauren currently [march, 2014] makes her home in Toronto, Canada with her \"three kings\", sons Alexander, George, and Henry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMDA0NDcyMl5BMl5BanBnXkFtZTgwNzE2ODkwODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000452","name":"Lauren Holly","idIMDB":"nm0000452"},"actorId":"nm0000452","character":"Darian Smalls","urlCharacter":"http://www.imdb.com/character/ch0015508","main":true},{"actorName":"Timothy Hutton","urlProfile":"http://www.imdb.com/name/nm0000459","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MjYxODUwNV5BMl5BanBnXkFtZTcwNTg5Nzg4Mg@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 August 1960","placeOfBirth":" Malibu, California, USA","birthName":"Timothy Tarquin Hutton","height":"6' (1.83 m)","bio":"Timothy Hutton was born in Malibu, California, to Maryline (Poole), a teacher, and actor Jim Hutton (Dana James Hutton). He set Hollywood ablaze when he burst onto the acting scene in the early 1980s. After only a small number of significant roles in TV movies, he bagged the part of Conrad in the Robert Redford-directed Ordinary People (1980). His convincing - and touching - performance as the troubled and self-accusing teenager trying to deal with the death of his older brother, won him an Academy Award. He is, to date, the youngest actor to receive an Oscar for Best Supporting Actor (1980). With over 70 film, TV, and stage appearances (including an impressive 15 features films between 2006-08), Tim Hutton is (of 2008) headlining the hit TV series Leverage (2008) as insurance investigator Nate Ford. He also starred in the acclaimed Roman Polanski film The Ghost Writer (2010). Tim made his Broadway debut in 1989 in the A.R. Gurney play 'Love Letters'.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MjYxODUwNV5BMl5BanBnXkFtZTcwNTg5Nzg4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000459","name":"Timothy Hutton","nicknames":["Tim"],"idIMDB":"nm0000459"},"actorId":"nm0000459","character":"Willie Conway","urlCharacter":"http://www.imdb.com/character/ch0015511","main":true},{"actorName":"Rosie O'Donnell","urlProfile":"http://www.imdb.com/name/nm0005280","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTcwNzk5NjkwNF5BMl5BanBnXkFtZTcwNzQ2ODQwMg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 March 1962","placeOfBirth":" Commack, Long Island, New York, USA","birthName":"Roseann O'Donnell","height":"5' 6½\" (1.69 m)","bio":"Rosie O'Donnell was born into an Irish-American family in Commack, Long Island. She is the middle of 5 children, and is the daughter of Roseann Teresa (Murtha) and Edward Joseph O'Donnell, an electrical engineer for the defense industry. Her mother died when she was ten. She said that she watched TV nearly 24 hours a day. When she was 18, she dropped out of college and went on to do shows like Gimme a Break! (1981), and she produced and hosted Stand-Up Spotlight (1988). Now, she works on her own down-to-earth syndicated show: The Rosie O'Donnell Show (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTcwNzk5NjkwNF5BMl5BanBnXkFtZTcwNzQ2ODQwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005280","name":"Rosie O'Donnell","nicknames":["Dolly","Ro"],"idIMDB":"nm0005280"},"actorId":"nm0005280","character":"Gina Barrisano","urlCharacter":"http://www.imdb.com/character/ch0015513","main":true},{"actorName":"Max Perlich","urlProfile":"http://www.imdb.com/name/nm0001611","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEyNzU1MzIzMV5BMl5BanBnXkFtZTgwOTU3MDk2MDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 March 1968","placeOfBirth":" Cleveland, Ohio, USA","height":"5' 4½\" (1.64 m)","bio":"Max Perlich was born on March 28, 1968 in Cleveland, Ohio, USA. He is known for his work on Blow (2001), Ferris Bueller's Day Off (1986) and Cliffhanger (1993). He is married to Jia Mae.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEyNzU1MzIzMV5BMl5BanBnXkFtZTgwOTU3MDk2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001611","name":"Max Perlich","idIMDB":"nm0001611"},"actorId":"nm0001611","character":"Kev","urlCharacter":"http://www.imdb.com/character/ch0015518","main":true},{"actorName":"Martha Plimpton","urlProfile":"http://www.imdb.com/name/nm0000588","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyOTQxNDMyMl5BMl5BanBnXkFtZTcwMjU4NDE3Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 November 1970","placeOfBirth":" New York City, New York, USA","birthName":"Martha Campbell Plimpton","height":"5' 5\" (1.65 m)","bio":"She has show biz in her blood. Martha Plimpton was born November 16, 1970, in New York City to two actors: Keith Carradine and Shelley Plimpton. Martha began her career at age 8, when her mom had a friend of hers, composer Elizabeth Swados, enroll her in an actors' workshop. At age 10, she got a small part in Rollover (1981), and also made a series of Calvin Klein commercials. Her first substantial film role was as a tomboy in The River Rat (1984); the following year, Steven Spielberg cast her in The Goonies (1985). Martha met River Phoenix while they were both filming The Mosquito Coast (1986), but since she was only 15 at the time, she did not go out with him. Even though she had a small part in the movie, it established her as a serious actress. Martha appeared in movies such as the screwball comedy Stars and Bars (1988) and, that same year, she was paired again with Phoenix in Running on Empty (1988). They dated for a while and then broke up. For a while, she was engaged to actor Jon Patrick Walker. As if making movies didn't keep her busy enough, Martha frequently worked at theaters and made her Chicago debut with the Steppenwolf Theatre Company Ensemble in \"The Libertine\" in 1996. As a member of that ensemble, she received a National Medal of Arts award in the autumn of 1998. As for movies, Colin Fitz Lives! (1997) and Eye of God (1997) in which she plays the starring role, have been run at the Sundance Film Festival. Although some recent movies have had low box office (Pecker (1998) $2.1 million, and 200 Cigarettes (1999) $6.8 million), Martha's performances shine and she often rises above her material. Perhaps recalling how important acting lessons were to her as a child, she donates her time and efforts to the \"52nd Street Project\" which is a not-for-profit organization dedicated to matching the inner-city children with professional theater artists to create original theater, by writing, directing and performing their own plays. Perhaps one of the inner-city kids she is coaching will be the next famous actress in Hollywood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyOTQxNDMyMl5BMl5BanBnXkFtZTcwMjU4NDE3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000588","name":"Martha Plimpton","idIMDB":"nm0000588"},"actorId":"nm0000588","character":"Jan","urlCharacter":"http://www.imdb.com/character/ch0015512","main":true},{"actorName":"Natalie Portman","urlProfile":"http://www.imdb.com/name/nm0000204","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODE3Mjg1NV5BMl5BanBnXkFtZTcwNzA4ODcxNA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 June 1981","placeOfBirth":" Jerusalem, Israel","birthName":"Natalie Hershlag","height":"5' 3\" (1.6 m)","bio":"Natalie Portman is the first person born in the 1980s to have won the Academy Award for Best Actress (for Black Swan (2010)). Natalie was born Natalie Hershlag on June 9, 1981, in Jerusalem, Israel, to a Jewish family. She is the only child of Avner Hershlag, an Israeli-born doctor, and Shelley Stevens, an American-born artist (from Cincinnati, Ohio), who also acts as Natalie's agent. She left Israel for Washington, D.C., when she was still very young. After a few more moves, her family finally settled in New York, where she still lives to this day. She graduated with honors, and her academic achievements allowed her to attend Harvard University. She was discovered by an agent in a pizza parlor at the age of 11. She was pushed towards a career in modeling but she decided that she would rather pursue a career in acting. She was featured in many live performances, but she made her powerful film debut in the movie Léon: The Professional (1994) (aka \"Léon\"). Following this role Natalie won roles in such films as Heat (1995), Beautiful Girls (1996), and Mars Attacks! (1996). It was not until 1999 that Natalie received worldwide fame as Queen Amidala in the highly anticipated US$431 million-grossing prequel Star Wars: Episode I - The Phantom Menace (1999). She then she starred in two critically acclaimed comedy dramas, Anywhere But Here (1999) and Where the Heart Is (2000), followed by Closer (2004), for which she received an Oscar nomination. She reprised her role as Padme Amidala in the last two episodes of the Star Wars prequel trilogy: Star Wars: Episode II - Attack of the Clones (2002) and Star Wars: Episode III - Revenge of the Sith (2005). She received an Academy Award and a Golden Globe Award for Best Actress in Black Swan (2010). She received a second nomination for Best Actress, for playing Jacqueline Kennedy in Jackie (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODE3Mjg1NV5BMl5BanBnXkFtZTcwNzA4ODcxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000204","name":"Natalie Portman","nicknames":["Nat"],"idIMDB":"nm0000204"},"actorId":"nm0000204","character":"Marty","urlCharacter":"http://www.imdb.com/character/ch0015505","main":true},{"actorName":"Michael Rapaport","urlProfile":"http://www.imdb.com/name/nm0001650","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2NTQ0NTI1M15BMl5BanBnXkFtZTcwMjEwNTA3OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 March 1970","placeOfBirth":" New York City, New York, USA","birthName":"Michael David Rapaport","height":"6' 2½\" (1.89 m)","bio":"A true New Yorker through and through, Michael Rapaport was born in Manhattan, to June Brody, a radio personality, and David Rapaport, a radio program manager. He is of Polish Jewish and Russian Jewish descent. Rapaport moved to Los Angeles to try stand-up comedy following high school graduation (which came after a series of expulsions), but he never lost, forgot nor deserted his New York roots. It's embedded in his work and is a major part of his low-keyed charm and ongoing appeal. His early idols were also New Yorkers (Robert De Niro, Christopher Walken, etc.). He toiled only briefly in L.A. Within a short amount of time Michael moved from the live comedy stage to working in front of a camera. The two developed an immediate rapport. A guest spot on the TV series China Beach (1988) led to a starring role in the quirky interracial indie Zebrahead (1992), which clinched it for him. This, in turn, led to a string of standout parts in films, such as Christian Slater's pal in True Romance (1993), an edgy collegiate-turned-skinhead in Higher Learning (1995) and a sympathetic none-too-bright boxer in Woody Allen's Mighty Aphrodite (1995), all enabling him to build up a higher profile. In later years he managed to show his ease at offbeat comedy, demonstrating a kid-like, goofy charm as Lisa Kudrow's cop boyfriend for a few episodes on Friends (1994) and as teacher Danny Hanson on Boston Public (2000). Lately he has formed his own production company, Release Entertainment, in search of that one big breakout role that could nab top stardom for him. Rapaport married writer Nicole Beatty in 2000, and they have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2NTQ0NTI1M15BMl5BanBnXkFtZTcwMjEwNTA3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001650","name":"Michael Rapaport","idIMDB":"nm0001650"},"actorId":"nm0001650","character":"Paul Kirkwood","urlCharacter":"http://www.imdb.com/character/ch0015515","main":true},{"actorName":"Mira Sorvino","urlProfile":"http://www.imdb.com/name/nm0000227","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDU1NDgwNl5BMl5BanBnXkFtZTYwNDIyOTM3._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 September 1967","placeOfBirth":" New York City, New York, USA","birthName":"Mira Katherine Sorvino","height":"5' 10\" (1.78 m)","bio":"Mira Katherine Sorvino was born on September 28, 1967 in Manhattan. She is the daughter of Lorraine Davis, an actress turned drama therapist, and veteran character actor Paul Sorvino. Her father's family were Italian immigrants. The young Sorvino was intelligent, an avid reader and an exceptional scholar. Her father discouraged her from becoming an actor, as he knew how the industry often chews up young stars. She attended Harvard, majoring in Chinese, graduating magna cum laude in 1989, largely on the strength of her thesis, a Hoopes Prize-winning thesis on racial conflict in China, written and researched during the year spent in Beijing, which helped her fluency in Mandarin Chinese. However, she showed interest in a career in acting from an early age, and moved to New York City to try her hand in the City's film industry, waitressing, auditioning and working at the Tribeca production company of Robert De Niro. She succeeded in getting a little television work in the early 1990s, but got her first film job in the independent gangster movie Amongst Friends (1993), on which she worked her way up the ladder behind the camera to eventually associate-produce the film, and, more importantly, was eventually cast as the female lead. The indie production was well-received, and Sorvino's performance attracted enough buzz to get her cast in two more movies, one a more prominent indie, Barcelona (1994), the other her first Hollywood feature, Quiz Show (1994), and her skillful performances brought her yet more attention. An exceptionally poised and articulate young woman, she may have seemed inappropriate to play a crazy hooker, but Woody Allen took the chance, and her magnificent performance as the female lead in his Mighty Aphrodite (1995) proved her range as a performer and earned her an Oscar (at the tender age of 29) for Best Supporting Actress. Since winning the Oscar, Sorvino has continued to take a wide range of roles, including another stretch as Marilyn Monroe in Norma Jean & Marilyn (1996), co-starring with another very intelligent and skilled young actress, Ashley Judd. Forays into action and horror, such as Mimic (1997) and The Replacement Killers (1998) show that Sorvino is not above being playful in the film roles she chooses. However, what forever cemented her role in popular culture was her performance as charmingly silly California beach girl Romy White in Romy and Michele's High School Reunion (1997), in which she and co-star Lisa Kudrow utter one hilarious absurdity after another. Mira Sorvino married Christopher Backus on June 11, 2004, and the couple have four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDU1NDgwNl5BMl5BanBnXkFtZTYwNDIyOTM3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000227","name":"Mira Sorvino","idIMDB":"nm0000227"},"actorId":"nm0000227","character":"Sharon Cassidy","urlCharacter":"http://www.imdb.com/character/ch0015509","main":true},{"actorName":"Uma Thurman","urlProfile":"http://www.imdb.com/name/nm0000235","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxNzk1MTQyMl5BMl5BanBnXkFtZTgwMDIzMDEyMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1970","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Uma Karuna Thurman","height":"6' (1.83 m)","bio":"Uma Karuna Thurman was born in Boston, Massachusetts, into a highly unorthodox and Eurocentric family. She is the daughter of Nena Thurman (née Birgitte Caroline von Schlebrügge), a fashion model and socialite who now runs a mountain retreat, and of Robert Thurman (Robert Alexander Farrar Thurman), a professor and academic who is one of the nation's foremost Buddhist scholars. Uma's mother was born in Mexico City, Mexico, to a German father and a Swedish mother (who herself was of Swedish, Danish, and German descent). Uma's father, a New Yorker, has English, Scots-Irish, Scottish, and German ancestry. Uma grew up in Amherst, Massachusetts, where her father worked at Amherst College. Thurman's household was one in which the The Dalai Lama was an occasional guest; she and her siblings all have names deriving from Buddhist mythology; and Middle American behavior was little understood, much less pursued. And so it was that the young Thurman confronted childhood with an odd name and eccentric home life -- and nature seemingly conspired against her as well. She is six feet tall, and from an early age towered over everyone else in class. Her famously large feet would soon sprout to size 11 -- and even beyond that -- and although they would eventually be lovingly filmed by director Quentin Tarantino, as a child she generally wore the biggest shoes in class, which only provided another subject of ridicule. Even her long nose moved one of her mother's friends to helpfully suggest rhinoplasty -- to the ten-year-old Thurman. To make matters worse yet, the family constantly relocated, making the gangly, socially inept Thurman perpetually the new kid in class. The result was an exceptionally awkward, self-conscious, lonely and alienated childhood. Unsurprisingly, the young Thurman enjoyed making believe she was someone other than herself, and so thrived at acting in school plays -- her sole successful extracurricular activity. This interest, and her lanky frame, perfect for modeling, led the 15-year-old Thurman to New York City for high school and modeling work (including a layout in Glamour Magazine) as she sought acting roles. The roles soon came, starting with a few formulaic and forgettable Hollywood products, but immediately followed by Terry Gilliam's The Adventures of Baron Munchausen (1988) and Stephen Frears' Dangerous Liaisons (1988), both of which brought much attention to her unorthodox sensuality and performances that intriguingly combined innocence and worldliness. The weird, gangly girl became a sex symbol virtually overnight. Thurman continued to be offered good roles in Hollywood pictures into the early '90s, the least commercially successful but probably best-known of which was her smoldering, astonishingly-adult performance as June, Henry Miller's wife, in Henry & June (1990), the first movie to actually receive the dreaded NC-17 rating in the USA. After a celebrated start, Thurman's career stalled in the early '90s with movies such as the mediocre Mad Dog and Glory (1993). Worse, her first starring role was in Even Cowgirls Get the Blues (1993), which had endured a tortured journey from cult-favorite book to big-budget movie, and was a critical and financial debacle. Fortunately, Uma bounced back with a brilliant performance as Mia Wallace, that most unorthodox of all gangster's molls, in Tarantino's lauded, hugely successful Pulp Fiction (1994), a role for which Thurman received an Academy Award nomination. Since then, Thurman has had periods of flirting with roles in arty independents such as A Month by the Lake (1995), and supporting roles in which she has lent some glamorous presence to a mixed batch of movies, such as Beautiful Girls (1996) and The Truth About Cats & Dogs (1996). Thurman returned to smaller films after playing the villainess Poison Ivy in the reviled Joel Schumacher effort Batman & Robin (1997) and Emma Peel in a remake of The Avengers (1998). She worked with Woody Allen and Sean Penn on Sweet and Lowdown (1999), and starred in Richard Linklater's drama Tape (2001) opposite Hawke. Thurman also won a Golden Globe award for her turn in the made-for-television film Hysterical Blindness (2002), directed by Mira Nair. A return to the mainstream spotlight came when Thurman redeemed with Quentin Tarantino for Kill Bill: Vol. 1 (2003), a revenge flick the two had dreamed up on the set of Pulp Fiction (1994). She also turned up in the John Woo cautioner Paycheck (2003) that same year. The renewed attention was not altogether welcome because Thurman was dealing with the break-up of her marriage with Hawke at about this time. Thurman handled the situation with grace, however, and took her surging popularity in stride. She garnered critical acclaim for her work in Kill Bill: Vol. 2 (2004) and was hailed as Tarantino's muse. Thurman reunited with Pulp Fiction (1994) dance partner John Travolta for the Get Shorty (1995) sequel Be Cool (2005) and played Ulla in The Producers (2005). Thurman had been briefly married to Gary Oldman, from 1990 to 1992. In 1998, she married Ethan Hawke, her co-star in the offbeat futuristic thriller Gattaca (1997). The couple had two children, Levon and Maya. Hawke and Thurman filed for divorce in 2004.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxNzk1MTQyMl5BMl5BanBnXkFtZTgwMDIzMDEyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000235","name":"Uma Thurman","idIMDB":"nm0000235"},"actorId":"nm0000235","character":"Andera","urlCharacter":"http://www.imdb.com/character/ch0015506","main":true},{"actorName":"Pruitt Taylor Vince","urlProfile":"http://www.imdb.com/name/nm0898546","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjAwNDE4Ml5BMl5BanBnXkFtZTcwMDMzODQwNw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 July 1960","placeOfBirth":" Baton Rouge, Louisiana, USA","height":"5' 9\" (1.75 m)","bio":"Vince first started to get noticed for his excellent performances at the start of his career in Shy People (1987) and Mississippi Burning (1988). In both these films he played something of a blathering redneck idiot, although there was a streak of pathos in both performances which made it impossible to dismiss his characters as just 'bad' people. In 'David Lynch''s Wild at Heart (1990) and Adrian Lyne's Jacob's Ladder (1990), he put in performances which showed he was merely biding his time before his next great role came along. Well, as luck would have it, two great roles came along in two years. As Rub Squeers, Paul Newman's emotional work partner in Nobody's Fool (1994), he put in an excellent performance. However, this performance was nothing compared to the acting powerhouse which was Heavy (1995). In this tender indie film, also marking Liv Tyler's first proper film role, Vince practically carries the whole film, and does so with style. Watching him gradually lose grip of his life breaks your heart, and it is without doubt one of the most underrated performances of the 90s. Vince has not really had a film role to touch this since, but he has been in the cult hit crime show, Murder One: Diary of a Serial Killer (1997), as Clifford Banks. It was a rare opportunity for Vince to flex his acting muscles as a slightly different type of character. Vince undoubtedly has the ability to be a major star; he just needs to be given the opportunity.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjAwNDE4Ml5BMl5BanBnXkFtZTcwMDMzODQwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0898546","name":"Pruitt Taylor Vince","idIMDB":"nm0898546"},"actorId":"nm0898546","character":"Stanley 'Stinky' Womack","urlCharacter":"http://www.imdb.com/character/ch0015516","main":true},{"actorName":"Anne Bobby","urlProfile":"http://www.imdb.com/name/nm0090321","urlPhoto":"","biography":{"dateOfBirth":"12 December 1967","placeOfBirth":" Paterson, New Jersey, USA","birthName":"Anne Marie Bobby","bio":"Anne Bobby was born on December 12, 1967 in Paterson, New Jersey, USA as Anne Marie Bobby. She is an actress, known for Born on the Fourth of July (1989), Nightbreed (1990) and BioShock (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0090321","name":"Anne Bobby","idIMDB":"nm0090321"},"actorId":"nm0090321","character":"Sarah Morris","urlCharacter":"http://www.imdb.com/character/ch0165319","main":true},{"actorName":"Richard Bright","urlProfile":"http://www.imdb.com/name/nm0109175","urlPhoto":"","biography":{"dateOfBirth":"28 June 1937","placeOfBirth":" Brooklyn, New York, USA","birthName":"Richard James Bright","height":"5' 7½\" (1.71 m)","bio":"Fair complexioned, cold-eyed actor Richard Bright has notched up an impressive array of character performances of often shifty, or deadly characters on the wrong side of the law. First came to attention as a burglar in the engrossing The Panic in Needle Park (1971), and then followed it the following year playing a slick con artist hustling naive Ali MacGraw for the bank robbery loot in The Getaway (1972), before Steve McQueen pummels Bright to get the money back. Additionally, in 1972, he made his first appearance as bodyguard / enforcer \"Al Neri\", protecting Al Pacino in The Godfather (1972), and returned in the same role in The Godfather: Part II (1974) and, 16 years later, he was back once again still protecting mob boss Al Pacino in The Godfather: Part III (1990). Bright's look's have endeared him to casting agents looking for criminals & cops, as he has also appeared in Sergio Leone's Il était une fois en Amérique (1984), Sam Raimi's crazy Crimewave (1985), the union tale Teamster Boss: The Jackie Presser Story (1992) and Witness to the Mob (1998). In addition, he has appeared regularly on TV in police/drama shows such as Hill Street Blues (1981), Houston Knights (1987), Third Watch (1999) and The Sopranos (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0109175","name":"Richard Bright","nicknames":["Richie"],"idIMDB":"nm0109175"},"actorId":"nm0109175","character":"Dick Conway","urlCharacter":"http://www.imdb.com/character/ch0165320","main":true}],"seasons":[],"idIMDB":"tt0115639","urlIMDB":"http://www.imdb.com/title/tt0115639","business":{"budget":null,"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1997/\">1997</a>"},{"money":"14,204","country":"Netherlands","day":"01","month":"01","year":"1997","remarks":""},{"money":"7,389","country":"Portugal","day":"05","month":"06","year":"1997","remarks":""},{"money":"3,965","country":"Portugal","day":"29","month":"05","year":"1997","remarks":"opening week"},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1995/\">1995</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 52 min (112 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe, Toronto, Canada (prints)"],"filmLength":["3,145 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.2","metascore":"64","filmingLocations":[{"location":"Lake William, Shorewood, Minnesota, USA"}],"rated":"R","awards":[{"award":"Chicago Film Critics Association Awards 1997","titlesAwards":[{"titleAwardOutcome":"Nominated CFCA Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Natalie Portman","id":"nm0000204","role":null}]},{"category":"Most Promising Actress","names":[{"name":"Natalie Portman","id":"nm0000204","role":null},{"name":"Mars Attacks!","id":"tt0116996","role":null},{"name":"Everyone Says I Love You","id":"tt0116242","role":null}]}]}]},{"award":"San Sebastián International Film Festival 1996","titlesAwards":[{"titleAwardOutcome":"Won CEC Award for Best Screenplay","categories":[{"category":"","names":[{"name":"Scott Rosenberg","id":"nm0003298","role":null}]}]},{"titleAwardOutcome":"Nominated Golden Seashell","categories":[{"category":"","names":[{"name":"Ted Demme","id":"nm0001130","role":null}]}]}]}],"votes":"27,373","type":"Movie","companyCreditsSimple":[{"idCompany":"co0022594","name":"Miramax"},{"idCompany":"co0055428","name":"Woods Entertainment"}],"keywords":{"keywords":["friendship","reunion","town","small town","pianist","hometown","bar","reference to pubic hair","teenage girl","reference to william shakespeare","snowplow","older man younger woman relationship","reference to shakespeare's romeo and juliet","twenty something","teenager","going home","extramarital affair","dream girl","affection","ring","niece","ice fishing","hospital","boyfriend girlfriend relationship","birthday party","cult film","winter","lolita","eating disorder","snow","adultery","ice skating","class reunion","title spoken by character","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:20:17"}}