{"data":{"movies":[{"title":"Men of Crisis: The Harvey Wallinger Story","originalTitle":"","year":"1971","directors":[{"name":"Woody Allen","id":"nm0000095"}],"writers":[{"name":"Woody Allen","id":"nm0000095"}],"runtime":"25 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWJmMTE2NDEtZjRhOS00Mjk1LTgyODAtOTMwYzEzNDJkMjlmXkEyXkFqcGdeQXVyMjM3ODA2NDQ@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Short","Comedy"],"plot":"This mockumentary follows the fictional career of Harvey Wallinger, ostensible chief aide and adviser to Richard Nixon, from Nixon's time as Eisenhower's vice-president through his loss in the 1960 election to John F. Kennedy to his own eventual election as U.S. president in 1968. Wallinger gives Nixon advice over the course of his career and, in numerous interviews, catalogs the attitudes, skills, and insight that made Nixon as great as Nixon thought he was.","simplePlot":"This mockumentary follows the fictional career of Harvey Wallinger, ostensible chief aide and adviser to Richard Nixon, from Nixon's time as Eisenhower's vice-president through his loss in ... ","actors":[{"actorName":"Woody Allen","urlProfile":"http://www.imdb.com/name/nm0000095","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MjU3MTI2MF5BMl5BanBnXkFtZTcwMDgxNTE4MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 December 1935","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Allan Stewart Konigsberg","height":"5' 5\" (1.65 m)","bio":"Woody Allen was born Allan Stewart Konigsberg on December 1, 1935 in Brooklyn, New York, to Nettie (Cherrie), a bookkeeper, and Martin Konigsberg, a waiter and jewellery engraver. His father was of Russian Jewish descent, and his maternal grandparents were Austrian Jewish immigrants. As a young boy, he became intrigued with magic tricks and playing the clarinet, two hobbies that he continues today. Allen broke into show business at 15 years when he started writing jokes for a local paper, receiving $200 a week. He later moved on to write jokes for talk shows but felt that his jokes were being wasted. His agents, Charles Joffe and Jack Rollins, convinced him to start doing stand-up and telling his own jokes. Reluctantly he agreed and, although he initially performed with such fear of the audience that he would cover his ears when they applauded his jokes, he eventually became very successful at stand-up. After performing on stage for a few years, he was approached to write a script for Warren Beatty to star in: Quoi de neuf, Pussycat? (1965) and would also have a moderate role as a character in the film. During production, Woody gave himself more and better lines and left Beatty with less compelling dialogue. Beatty inevitably quit the project and was replaced by Peter Sellers, who demanded all the best lines and more screen-time. It was from this experience that Woody realized that he could not work on a film without complete control over its production. Woody's theoretical directorial debut was in What's Up, Tiger Lily? (1966); a Japanese spy flick that he dubbed over with his own comedic dialogue about spies searching for the secret recipe for egg salad. His real directorial debut came the next year in the mockumentary Take the Money and Run (1969). He has written, directed and, more often than not, starred in about a film a year ever since, while simultaneously writing more than a dozen plays and several books of comedy. While best known for his romantic comedies Annie Hall (1977) and Manhattan (1979), Woody has made many transitions in his films throughout the years, transitioning from his \"early, funny ones\" of Bananas (1971), Love and Death (1975) and Everything You Always Wanted to Know About Sex * But Were Afraid to Ask (1972); to his more storied and romantic comedies of Annie Hall (1977), Manhattan (1979) and Hannah and Her Sisters (1986); to the Bergmanesque films of Stardust Memories (1980) and Interiors (1978); and then on to the more recent, but varied works of Crimes and Misdemeanors (1989), Husbands and Wives (1992), Mighty Aphrodite (1995), _Celebrity_ and Deconstructing Harry (1997); and finally to his films of the last decade, which vary from the light comedy of Scoop (2006), to the self-destructive darkness of Match Point (2005) and, most recently, to the cinematically beautiful tale of Vicky Cristina Barcelona (2008). Although his stories and style have changed over the years, he is regarded as one of the best filmmakers of our time because of his views on art and his mastery of filmmaking.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MjU3MTI2MF5BMl5BanBnXkFtZTcwMDgxNTE4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000095","name":"Woody Allen","idIMDB":"nm0000095"},"actorId":"nm0000095","character":"Harvey Wallinger","urlCharacter":"http://www.imdb.com/character/ch0251063","main":true},{"actorName":"David Ackroyd","urlProfile":"http://www.imdb.com/name/nm0010097","urlPhoto":"","biography":{"dateOfBirth":"30 May 1940","placeOfBirth":" Orange, New Jersey, USA","height":"6' 1\" (1.85 m)","bio":"Veteran stage and TV actor David Ackroyd was born on May 30, 1940 in Orange, New Jersey, the son of Arthur, an insurance adjuster, and Charlotte (nee Henderson) Ackroyd. He studied at Bucknell University in Pennsylvania where he received his BA in 1962 as an ROTC student. Following his graduation he appeared in community theater productions while serving in Arizona with the military. He then focused on the arts as a career after enrolling at the Yale Drama School where he earned his Masters of Fine Arts in 1968. David gathered early professional credits at the Yale Repertory Theatre (for three seasons) and Williamstown Theatre Festival (for six seasons). He also found challenging and varied stage work outside the U.S. in Taiwan, Russia, Poland, Germany, France, and the Czech Republic. Dark-haired with a serious handsomeness to him, he was able to extend his all-stage career into film and TV in the early 1970s, beginning with daytime leading man outings in \"The Secret Storm\" and \"Another World\". He progressed to prime time work as Gary Ewing in Dallas (1978) until Ted Shackelford successfully took over the role when the character moved front and center with the spin-off drama Knots Landing (1979). David's prime on-camera work occurred in the late 70s with a series of strong co-star roles in the mini-series The Dark Secret of Harvest Home (1978) with Bette Davis and The Word (1978), as well as the TV-movies And I Alone Survived (1978) and Women in White (1979). He then began to find supporting roles in such movies as The Mountain Men (1980), The Sound of Murder (1982), Wrestling with God (1990), Dark Angel (1990) and Prison Life (2000); however, film stardom eluded him. Prone to playing upscale types or white-collar professionals (senators, doctors, lawyers, etc.), he appeared as a guest star on such popular programs as \"Hotel\", \"Dynasty\", \"Highway to Heaven\", \"Murder She Wrote\" and \"MacGyver\". He also continued to prevail on the stage with potent performances in \"Unlikely Heroes\", his 1971 Broadway debut, \"The Rivals\", \"Juno and the Paycock\", \"Hamlet\" (as Rosencrantz), \"Private Lives\" \"Children of a Lesser God\" (replacing original star John Rubinstein), \"A Soldier's Play\", \"Who's Afraid of Virginia Woolf?\", \"Six Characters in Search of an Author\", and, more recently, off-Broadway in 2003 with \"It Just Catches\". A well-seasoned narrator in documentary stories for the History Channel, he has sometimes utilized his well-modulated vocals for such animated cartoons as \"Johnny Quest\" and \"Captain Planet and the Planeteers\". Most of his work of late comes in the form of voice work. Long married to wife Ruth Liming, a college admissions officer, the couple has two daughters, Jessica and Abigail. Living in Montana where he is a professor of drama at Flathead Valley Community College in Kalispell, David is also one of the founding members of the Alpine Theatre Project which produces plays for the Whitefish Theatre Company.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0010097","name":"David Ackroyd","idIMDB":"nm0010097"},"actorId":"nm0010097","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wil Albert","urlProfile":"http://www.imdb.com/name/nm0016607","urlPhoto":"","biography":{"dateOfBirth":"22 August 1930","placeOfBirth":" New York City, New York, USA","bio":"Wil Albert was born on August 22, 1930 in New York City, New York, USA. He is an actor, known for Frost/Nixon (2008), Defending Your Life (1991) and Barfly (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0016607","name":"Wil Albert","idIMDB":"nm0016607"},"actorId":"nm0016607","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Conrad Bain","urlProfile":"http://www.imdb.com/name/nm0047699","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyNjAwODYxNjNeQTJeQWpwZ15BbWU3MDE1Njk2OTg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1923","placeOfBirth":" Lethbridge, Alberta, Canada","birthName":"Conrad Stafford Bain","height":"5' 10\" (1.78 m)","bio":"Usually sized up as an erudite gent, advice-spouting father or uptight, pompous neighbor, the acting talents of Conrad Bain were best utilized on stage and on TV. Born in Lethbridge, Alberta, on February 4, 1923, Conrad Stafford Bain was a twin son (the other was named Bonar) born to Stafford Harrison Bain, a wholesaler, and Jean Agnes (née Young). He enjoyed Canadian sports growing up (ice hockey, speed skating), but picked up an interest in acting while in high school. Electing to train at Alberta's Banff School of Fine Arts after graduating, he met Monica Marjorie Sloan, an artist, while there. His acting pursuit was interrupted by WWII when he subsequently joined the Canadian army. Picking up here he left off following his discharge, he studied at New York's American Academy of Dramatic Arts. He also married Ms. Sloan in 1945 and became a naturalized U.S. citizen the following year. The couple went on to have three children -- Jennifer, Mark and Kent. Making his stage debut in a Connecticut production of \"Dear Ruth\" in 1947, Bain also appeared in \"Jack and the Beanstalk\" and a tour of \"The Barretts of Wimpole Street\" before making his off-Broadway debut in a 1956 Circle-in-the-Square revival of Eugene O'Neill's \"The Iceman Cometh,\" a production that made a star out of Jason Robards. Following an inauspicious Broadway bow in \"Sixth Finger in a Five Finger Glove\", which closed after only one day, he joined the Stratford (Ontario) Shakespeare Festival for their 1958 season, appearing in \"A Winter's Tale,\" \"Much Ado About Nothing\" and \"Henry IV, Part I.\" Fair in complexion and exceedingly genial in demeanor, the wry and witty blond actor graduated into other Broadway work, particularly drama, with strong roles in \"Candide,\" \"Advise and Consent,\" \"An Enemy of the People,\" \"Twigs\" and \"Uncle Vanya.\" He also built up his regional and repertory credits during the early 1960s with parts in \"King Lear,\" \"The Firebugs,\" \"Death of a Salesman\" and \"The Shadow of Heroes\" at Seattle Rep. Later in the decade he began to focus more intently on TV, usually playing cerebral, white-collar types (district attorneys, stock brokers, doctors, politicos). Bain eventually found an \"in\" with daytime drama, which included a recurring role on Dark Shadows (1966) (as an innkeeper), and a part on The Edge of Night (1956) in 1970. He broke completely away, however, from his trademark dramatics when the 49-year-old actor was \"discovered\" for prime-time TV by Norman Lear and offered a supporting role opposite Bea Arthur and Bill Macy in Norman Lear's landmark, liberally-sliced comedy series Maude (1972), a spin-off of Lear's equally landmark All in the Family (1971) sitcom. Conrad was cast as Rue McClanahan's stuffy, conservative doctor/husband, Arthur Harmon, who usually was at political odds with free-wheeling feminist Maude Finlay. The role moved Bain into the prime TV comedy character ranks. Following the show's lengthy run (1972-1978), he was given the green light by Lear to move into his own comedy series with Diff'rent Strokes (1978) as the wealthy father of a girl and adoptive father of two African-American children. While young Gary Coleman, the compact, precocious, mouthy dynamo, may have stolen the show, the good-humored Bain remained a strong center and voice of reason until the show's demise in 1986. Three was not a charm when Bain went into a third new comedy series, Mr. President (1987), with Conrad as a loyal aide-de-camp to \"President\" George C. Scott. The show, created not by Lear but by Johnny Carson, lasted only 24 episodes. During and after his lengthy 70s and 80s TV success, Conrad would continue to return to his first love, the stage, in such productions as \"Uncle Vanya,\" \"The Owl and the Pussycat,\" \"On Golden Pond,\" \"The Dining Room\" and \"On Borrowed Time\", the last being a 1992 return to Broadway after nearly two decades. Films, on the other hand, were a non-issue at this point. Earlier minor turns included Clint Eastwood's Coogan's Bluff (1968), Gene Hackman's I Never Sang for My Father (1970), Woody Allen's Bananas (1971), Sean Connery's The Anderson Tapes (1971) and Barbra Streisand's Up the Sandbox (1972). His last stop in films was an engaging part as a befuddled grandpa opposite the perennially crusty Mary Wickes in Postcards from the Edge (1990) starring Meryl Streep and Shirley MacLaine. One of Bain's last on-camera appearances was recreating his Phillip Drummond role from Diff'rent Strokes (1978) on a 1996 episode of \"The Fresh Prince of Bel-Air\". Other than a stage role in \"Ancestral Voices\" in 2000, Conrad turned for a time to screen-writing but later comfortably retired to the Brentwood area of Los Angeles. Moving to a Livermore California retirement home in 2008, wife Monica died a year later. Bain passed away there quietly of natural causes on January 14, 2013, less than a month short of his 90th birthday. His twin brother Bonar died in 2005.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyNjAwODYxNjNeQTJeQWpwZ15BbWU3MDE1Njk2OTg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0047699","name":"Conrad Bain","idIMDB":"nm0047699"},"actorId":"nm0047699","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Court Benson","urlProfile":"http://www.imdb.com/name/nm0072464","urlPhoto":"","biography":{"dateOfBirth":"4 November 1914","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"Courtenay E. Benson","bio":"Court Benson was born on November 4, 1914 in Vancouver, British Columbia, Canada as Courtenay E. Benson. He was an actor, known for No, My Darling Daughter (1961), Men of Crisis: The Harvey Wallinger Story (1971) and Dentist on the Job (1961). He died on February 5, 1995 in Mount Kisco, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0072464","name":"Court Benson","idIMDB":"nm0072464"},"actorId":"nm0072464","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Milo Boulton","urlProfile":"http://www.imdb.com/name/nm0099609","urlPhoto":"","biography":{"dateOfBirth":"13 July 1903","placeOfBirth":" Ohio, USA","bio":"Milo Boulton was born on July 13, 1903 in Ohio, USA. He was an actor, known for Love Story (1970), Men of Crisis: The Harvey Wallinger Story (1971) and Car 54, Where Are You? (1961). He was married to Katharine R. He died on February 2, 1989 in Crescent City, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0099609","name":"Milo Boulton","idIMDB":"nm0099609"},"actorId":"nm0099609","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harold Chidhoff","urlProfile":"http://www.imdb.com/name/nm1206584","urlPhoto":"","biography":{"bio":"Harold Chidhoff is an actor, known for Men of Crisis: The Harvey Wallinger Story (1971).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1206584","name":"Harold Chidhoff","idIMDB":"nm1206584"},"actorId":"nm1206584","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jean David","urlProfile":"http://www.imdb.com/name/nm0202933","urlPhoto":"","biography":{"dateOfBirth":"4 May 1931","placeOfBirth":" Denver, Colorado, USA","bio":"Jean David was born on May 4, 1931 in Denver, Colorado, USA. She is an actress, known for Bang the Drum Slowly (1973), Born to Win (1971) and Les Boys (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0202933","name":"Jean David","idIMDB":"nm0202933"},"actorId":"nm0202933","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jean De Baer","urlProfile":"http://www.imdb.com/name/nm0207203","urlPhoto":"","biography":{"bio":"Jean De Baer is an actress, known for Maverick (1994), The Man Without a Face (1993) and 84 Charing Cross Road (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0207203","name":"Jean De Baer","idIMDB":"nm0207203"},"actorId":"nm0207203","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard M. Dixon","urlProfile":"http://www.imdb.com/name/nm0228963","urlPhoto":"","biography":{"birthName":"James LaRoe","bio":"Richard M. Dixon was born as James LaRoe. He is an actor, known for Where the Buffalo Roam (1980), Good to See You Again, Alice Cooper (1974) and The Faking of the President (1976).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0228963","name":"Richard M. Dixon","idIMDB":"nm0228963"},"actorId":"nm0228963","character":"President Richard M. Nixon","urlCharacter":"http://www.imdb.com/character/ch0027234","main":true},{"actorName":"Abe Drazen","urlProfile":"http://www.imdb.com/name/nm1206713","urlPhoto":"","biography":{"bio":"Abe Drazen is an actor, known for Men of Crisis: The Harvey Wallinger Story (1971) and The Tonight Show Starring Johnny Carson (1962).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1206713","name":"Abe Drazen","idIMDB":"nm1206713"},"actorId":"nm1206713","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dan Frazer","urlProfile":"http://www.imdb.com/name/nm0292498","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNDM4NTI0MV5BMl5BanBnXkFtZTgwNzQ3Nzg3MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 November 1921","placeOfBirth":" Hell's Kitchen [now Clinton], Manhattan, New York City, New York, USA","birthName":"Daniel Thomas Frazer","bio":"Son of a bricklayer and ironworker, who was involved in the construction of the Empire State Building, Dan Frazer first acted in local theatre in his rough 'Hell's Kitchen' neighbourhood on the Manhattan West Side. He also benefited from the Federal Theatre Project, funded by the Works Progress Administration after the onset of the Great Depression. During World War II, Dan helped entertain troops as a member of the U.S. Army Special Services, subsequently making his first appearance on Broadway as a marine in 'Christopher Blake'. He began acting on the small screen during the 1950's, appearing in anything from anthology series, to comedies, to crime drama. His motion picture debut did not eventuate until 1963, when he portrayed a priest in Lilies of the Field (1963). For the best part of his screen career, Dan portrayed an assortment of clergymen and cops, almost invariably honest, hard-working types. Internationally, he became best known as Telly Savalas's nervous NYPD boss, Captain Frank McNeil, during all five seasons of Kojak (1973); and as Virgil Starkwell's (Woody Allen's) psychiatrist in the hilarious Take the Money and Run (1969). Dan Frazer was a Member of the Academy of Motion Picture Arts and Sciences.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNDM4NTI0MV5BMl5BanBnXkFtZTgwNzQ3Nzg3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0292498","name":"Dan Frazer","idIMDB":"nm0292498"},"actorId":"nm0292498","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Reed Hadley","urlProfile":"http://www.imdb.com/name/nm0352914","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3OTc5NTAxOF5BMl5BanBnXkFtZTcwODc2MzYyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 June 1911","placeOfBirth":" Petrolia, Texas, USA","birthName":"Reed Herring","height":"6' 4\" (1.93 m)","bio":"Tall, dark, and handsome, Reed Hadley appeared most frequently as either a villain or as an officer of the law during a film career of 35 years. His rich, bass voice was also frequently heard as narrator for movies and documentaries. He may be best remembered for his work in television, where he starred in Racket Squad (1950) and Public Defender (1954). Other highlights of his career include playing the title character in \"Red Ryder\" on the radio and \"Zorro\" in the Republic serial, Zorro's Fighting Legion (1939).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3OTc5NTAxOF5BMl5BanBnXkFtZTcwODc2MzYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0352914","name":"Reed Hadley","idIMDB":"nm0352914"},"actorId":"nm0352914","character":"Narrator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Graham Jarvis","urlProfile":"http://www.imdb.com/name/nm0419054","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5MTI1OTY0M15BMl5BanBnXkFtZTgwMzM0ODA1NTE@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1930","placeOfBirth":" Toronto, Ontario, Canada","bio":"Jarvis attended Williams College before moving to New York to pursue a career in theater. He studied acting at the American Theater Wing and was an original member of the Lincoln Center Repertory Theater.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5MTI1OTY0M15BMl5BanBnXkFtZTgwMzM0ODA1NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0419054","name":"Graham Jarvis","idIMDB":"nm0419054"},"actorId":"nm0419054","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mitchell Jason","urlProfile":"http://www.imdb.com/name/nm0419267","urlPhoto":"","biography":{"dateOfBirth":"1921","placeOfBirth":"","bio":"Mitchell Jason was born in 1921. He was an actor, known for Network (1976), The Heartbreak Kid (1972) and Doing Life (1986). He died on March 11, 2014 in Doylestown, Pennsylvania, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0419267","name":"Mitchell Jason","idIMDB":"nm0419267"},"actorId":"nm0419267","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0133962","urlIMDB":"http://www.imdb.com/title/tt0133962","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["25 min"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.2","filmingLocations":[],"awards":[],"votes":"272","type":"Movie","companyCreditsSimple":[{"idCompany":"co0037666","name":"WNET Channel 13 New York"}],"keywords":{"keywords":["richard nixon","written and directed by cast member","unreleased film","satire","fake documentary","mccarthyism","boy scout","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:44:55"}}