{"data":{"movies":[{"title":"Hercules","originalTitle":"","year":"1997","releaseDate":"19970627","directors":[{"name":"Ron Clements","id":"nm0166256"},{"name":"John Musker","id":"nm0615780"}],"writers":[{"name":"Ron Clements","id":"nm0166256"},{"name":"John Musker","id":"nm0615780"}],"runtime":"93 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDcwYjEyNWItMGI1Mi00MjI1LWIyMDEtMTQ4YjhkNjM4NDU3XkEyXkFqcGdeQXVyNDUyOTg3Njg@._V1.jpg","countries":["USA"],"languages":["English","Spanish","Greek"],"genres":["Animation","Adventure","Comedy","Family","Fantasy","Musical","Romance"],"plot":"Hercules, son of the Greek God, Zeus, is turned into a half-god, half-mortal by evil Hades, God of the Underworld, who plans to overthrow Zeus. Hercules is raised on Earth and retains his god-like strength, but when he discovers his immortal heritage Zeus tells him that to return to Mount Olympus he must become a true hero. Hercules becomes a famous hero with the help of his friend Pegasus and his personal trainer, Phil the satyr. Hercules battles monsters, Hades and the Titans, but it is his self-sacrifice to rescue his love Meg which makes him a true hero.","simplePlot":"The son of the Greek Gods Zeus and Hera is stripped of his immortality as an infant and must become a true hero in order to reclaim it.","actors":[{"actorName":"Tate Donovan","urlProfile":"http://www.imdb.com/name/nm0004883","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNzUxMTMwM15BMl5BanBnXkFtZTcwNDQ1Mzc1MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1963","placeOfBirth":" Tenafly, New Jersey, USA","birthName":"Tate Buckley Donovan","height":"6' (1.83 m)","bio":"Tate Buckley Donovan began making television appearances while still in his teens, most often cast as angst-ridden high schoolers in such made-for-TV films such as Not My Kid (1985) and Nutcracker: Money, Madness & Murder (1987). Donovan was born to a large family in Tenafly, New Jersey, the son of Eileen Frances (McAllister) and John Timothy Donovan, a surgeon. He is of Irish descent. Donovan moved to Los Angeles to be closer to the television industry while he attended college at USC, where he also met several fellow actors who became longtime friends, such as Grant Heslov and George Clooney, with whom he still parties with to this day (he also had a fairly substantial part in their smash film, Good Night, and Good Luck. (2005). Although not quite as active as his friend Clooney in the romantic arena, confirmed bachelor Donovan has been engaged to both film star Sandra Bullock and television icon Jennifer Aniston, and has dated a diverse group of women such as socialite Plum Sikes (2000), stage actress Whitney Allen (2001) and television actress Lauren Graham, whom he met when they both appeared in the play \"Once in a Lifetime\" at the Williamstown Theater Festival in 2002. After graduating from college, Donovan gained prominent notice for his portrayal of the charismatic yet self-centered co-pilot in the ensemble period drama Memphis Belle (1990). Prior to that, Donovan had appeared as the cocky elder camper in SpaceCamp (1986) and as a recovering drug addict in Clean and Sober (1988). His first leading role was in the charming but minor Love Potion No. 9 (1992), costarring Bullock, to whom he became engaged (their relationship ended in 1994). He then appeared in several independent features as sullen, withdrawn types before following up with a role in the Disney family comedy, Holy Matrimony (1994). He returned to Disney for perhaps his highest-profile effort to date, the animated Hercules (1997), for which he provided the voice for the adult version of the title character. His small-screen work has included a Cable ACE-nominated turn in the HBO series Vietnam War Story II (1988) (V). He joined the parade of film stars who turned to sitcoms, heading the cast of Partners (1995) opposite Jon Cryer. When that failed to catch on, he joined with his \"Memphis Belle\" co-stars Eric Stoltz and Reed Diamond to play three brothers in a memorable episode of NBC's Homicide: Life on the Street (1993) and had a recurring role as a client and potential love interest for Calista Flockhart's titular lawyer Ally McBeal (1997). Switching networks, he had a recurring role as a love interest opposite his then-girlfriend Jennifer Aniston in NBC's Friends (1994) and donned clerical garb to play the priest son of a large Irish Catholic family in the short-lived NBC drama Trinity (1998). More recently he has appeared as a guest star in several shows such as The Guardian (2001), as well as Mister Sterling (2003) and in the new show The O.C. (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNzUxMTMwM15BMl5BanBnXkFtZTcwNDQ1Mzc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004883","name":"Tate Donovan","idIMDB":"nm0004883"},"actorId":"nm0004883","character":"Hercules","urlCharacter":"http://www.imdb.com/character/ch0000545","main":true},{"actorName":"Josh Keaton","urlProfile":"http://www.imdb.com/name/nm0005079","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTE0NzY5OF5BMl5BanBnXkFtZTgwMTc3OTIxMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1979","placeOfBirth":" Pasadena, California, USA","birthName":"Joshua Luis Wiener","height":"5' 9\" (1.75 m)","bio":"Josh Keaton was born on February 8, 1979 in Pasadena, California, USA as Joshua Luis Wiener. He is known for his work on Hercules (1997), General Hospital (1963) and Green Lantern: The Animated Series (2011). He has been married to Elizabeth Melendez since May 30, 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTE0NzY5OF5BMl5BanBnXkFtZTgwMTc3OTIxMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005079","name":"Josh Keaton","idIMDB":"nm0005079"},"actorId":"nm0005079","character":"Young Hercules","urlCharacter":"http://www.imdb.com/character/ch0000545","main":true},{"actorName":"Roger Bart","urlProfile":"http://www.imdb.com/name/nm0058372","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjViOGMyNzctZTA1My00OTM0LWE2OWUtNTNiNzY5ODhhNGM1L2ltYWdlXkEyXkFqcGdeQXVyMzAyMTgyOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1962","placeOfBirth":" Norwalk, Connecticut, USA","height":"5' 10\" (1.78 m)","bio":"Roger Bart was born on September 29, 1962 in Norwalk, Connecticut, USA. He is an actor, known for The Producers (2005), American Gangster (2007) and Desperate Housewives (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjViOGMyNzctZTA1My00OTM0LWE2OWUtNTNiNzY5ODhhNGM1L2ltYWdlXkEyXkFqcGdeQXVyMzAyMTgyOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0058372","name":"Roger Bart","idIMDB":"nm0058372"},"actorId":"nm0058372","character":"Young Hercules","urlCharacter":"http://www.imdb.com/character/ch0000545","main":true},{"actorName":"Danny DeVito","urlProfile":"http://www.imdb.com/name/nm0000362","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5MjM5MzM3M15BMl5BanBnXkFtZTYwOTEzOTY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1944","placeOfBirth":" Asbury Park, New Jersey, USA","birthName":"Daniel Michael DeVito Jr.","height":"4' 10\" (1.47 m)","bio":"Danny DeVito has amassed a formidable and versatile body of work as an actor, producer and director that spans the stage, television and film. Daniel Michael DeVito Jr. was born on November 17, 1944, in Neptune, New Jersey, to Italian-American parents. His mother, Julia (Moccello), was a homemaker. His father, Daniel, Sr., was a small business owner whose ventures included a dry cleaning shop, a dairy outlet, a diner, and a pool hall. While growing up in Asbury Park, his parents sent him to private schools. He attended Our Lady of Mount Carmel grammar school and Oratory Prep School. Following graduation in 1962, he took a job as a cosmetician at his sister's beauty salon. A year later, he enrolled at New York's American Academy of Dramatic Arts so he could learn more about cosmetology. While at the academy, he fell in love with acting and decided to further pursue an acting career. During this time, he met another aspiring actor Michael Douglas at the National Playwrights Conference in Waterford, Connecticut. The two would later go on to collaborate on numerous projects. Soon after he also met an actress named Rhea Perlman. The two fell in love and moved in together. They were married in 1982 and had three children together. In 1968, Danny landed his first part in a movie when he appeared as a thug in the obscure Dreams of Glass (1970). Despite this minor triumph, Danny became discouraged with the film industry and decided to focus on stage productions. He made his Off-Broadway debut in 1969 in \"The Man With the Flower in His Mouth.\" He followed this up with stage roles in \"The Shrinking Bride,\" and \"Lady Liberty.\" In 1975, he was approached by director Milos Forman and Michael Douglas about appearing in the film version of One Flew Over the Cuckoo's Nest (1975), which would star Jack Nicholson in the leading role. With box office success almost guaranteed and a chance for national exposure, Danny agreed to the role. The movie became a huge hit, both critically and financially, and still ranks today as one the greatest movies of all time. Unfortunately, the movie did very little to help Danny's career. In the years following, he was relegated to small movie roles and guest appearances on television shows. His big break came in 1978 when he auditioned for a role on an ABC sitcom pilot called Taxi (1978), which centered around taxi cab drivers at a New York City garage. Danny auditioned for the role of dispatcher Louie DePalma. At the audition, the producers told Danny that he needed to show more attitude in order to get the part. He then slammed down the script and yelled, \"Who wrote this sh**?\" The producers, realizing he was perfect for the part, brought him on board. The show was a huge success, running from 1978 to 1983. Louie DePalma, played flawlessly by Danny, became one of the most memorable (and reviled) characters in television history. While he was universally hated by TV viewers, he was well-praised by critics, winning an Emmy award and being nominated three other times. Throughout the 1980s and 1990s, Danny maintained his status as a great character actor with memorable roles in movies like Romancing the Stone (1984), Ruthless People (1986), Throw Momma from the Train (1987) and Twins (1988). He also had a great deal of success behind the camera, directing movies like The War of the Roses (1989) and Hoffa (1992). In 1992, Danny was introduced to a new generation of moviegoers when he was given the role of The Penguin/Oswald Cobblepot in Tim Burton's highly successful Batman Returns (1992). This earned him a nomination for Best Villain at the MTV Movie Awards. That same year, along with his then-wife Rhea Perlman, Danny co-founded Jersey Films, which has produced many popular films and TV shows, including Pulp Fiction (1994), Get Shorty (1995), Man on the Moon (1999) and Erin Brockovich (2000). DeVito has many directing credits to his name as well, including Throw Momma from the Train (1987), The War of the Roses (1989), Hoffa (1992), Death to Smoochy (2002) and the upcoming St. Sebastian. In 2006, he returned to series television in the FX comedy series It's Always Sunny in Philadelphia (2005). With a prominent role in a hit series, Devito's comic talents were now on display for a new generation of television viewers. In 2012, he provided the title voice role in Dr. Seuss' The Lorax (2012). These days, he continues to work with many of today's top talents as an actor, director and producer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5MjM5MzM3M15BMl5BanBnXkFtZTYwOTEzOTY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000362","name":"Danny DeVito","idIMDB":"nm0000362"},"actorId":"nm0000362","character":"Phil","urlCharacter":"http://www.imdb.com/character/ch0043224","main":true},{"actorName":"James Woods","urlProfile":"http://www.imdb.com/name/nm0000249","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE5ODIxNTcxNV5BMl5BanBnXkFtZTgwMjQ2ODYzMDI@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1947","placeOfBirth":" Vernal, Utah, USA","birthName":"James Howard Woods","height":"5' 11\" (1.8 m)","bio":"James Woods is a leanly built, strangely handsome actor-producer-director with intense eyes and a sometimes untrustworthy grin, who has been impressing audiences for over three decades with his compelling performances. James Howard Woods was born on April 18th, 1947 in Vernal, Utah, the son of Martha A. (Smith) and Gail Peyton Woods, a United States Army intelligence officer who died during Woods' childhood. James is of Irish, English, and German descent. He grew up in Warwick, Rhode Island, with his mother and stepfather. He graduated from Pilgrim High School in 1965, near the top of his class. He earned a scholarship to the Massachusetts Institute of Technology; dropping out during his sophomore year in 1967, he then headed off to New York with his fraternity brother Martin Donovan to pursue aspirations to appear on the stage. After appearing in a handful of New York City theater productions, Woods scored his first film role in All the Way Home (1971) and followed that up with meager supporting roles in The Way We Were (1973) and The Choirboys (1977). However, it was Woods' cold-blooded performance as the cop killer in The Onion Field (1979), based on a Joseph Wambaugh novel, that seized the attention of movie-goers to his on-screen power. Woods quickly followed up with another role in another Joseph Wambaugh film adaptation, The Black Marble (1980), as a sleazy and unstable cable-T.V.-station owner in David Cronenberg's mind-bending and prophetic Vidéodrome (1983), as gangster Max Bercovicz in Sergio Leones mammoth epic Il était une fois en Amérique (1984), and scored a best actor Academy Award nomination as abrasive journalist Richard Boyle in Oliver Stone's gritty and unsettling Salvador (1986). There seemed to be no stopping the rise of this star as he continued to amaze movie-goers with his remarkable versatility and his ability to create such intense, memorable characters. The decade of the 1990s started off strongly with high praise for his role as Roy Cohn in the television production of Citizen Cohn (1992). Woods was equally impressive as sneaky hustler Lester Diamond who cons Sharon Stone in Casino (1995), made a tremendous H.R. Haldeman in Nixon (1995), portrayed serial killer Carl Panzram in Killer: A Journal of Murder (1995), and then as accused civil rights assassin Byron De La Beckwith in Ghosts of Mississippi (1996). Not to be typecast solely as hostile hoodlums, Woods has further expanded his range to encompass providing voice-overs for animated productions including Hercules (1997), Hooves of Fire (1999), and Stuart Little 2 (2002). Woods also recently appeared in the critically praised The Virgin Suicides (1999), in the coming-of-age movie Riding in Cars with Boys (2001), as a corrupt medico in Any Given Sunday (1999), and in the comedy-horror spoof Scary Movie 2 (2001). A remarkable performer with an incredibly diverse range of acting talent, Woods remains one of Hollywood's outstanding leading men.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE5ODIxNTcxNV5BMl5BanBnXkFtZTgwMjQ2ODYzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000249","name":"James Woods","nicknames":["Jimmy"],"idIMDB":"nm0000249"},"actorId":"nm0000249","character":"Hades","urlCharacter":"http://www.imdb.com/character/ch0000515","main":true},{"actorName":"Susan Egan","urlProfile":"http://www.imdb.com/name/nm0250743","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzMjYzODI5ODJeQTJeQWpwZ15BbWU3MDI3MTM0Mzk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 February 1970","placeOfBirth":" Seal Beach, California, USA","birthName":"Susan Farrell Egan","height":"5' 4\" (1.63 m)","bio":"Susan Egan was born on February 18, 1970 in Seal Beach, California, USA as Susan Farrell Egan. She is an actress, known for Hercules (1997), Spirited Away (2001) and 13 Going on 30 (2004). She has been married to Robert Hartmann since June 26, 2005. They have two children. She has two daughters. There names are Nina and Isla. She was one of the first students to attend the Orange County High School of the Arts during its original incarnation at Los Alamitos High School. Served as Artistic Director at the Orange County High School of the Arts for school year 2002-2003. Originated the role of \"Belle\" in the Broadway production of Disney's Beauty and the Beast. Was nominated for Broadway's 1994 Tony Award as Best Actress (Musical) for originating the role of \"Belle\" in Disney's \"Beauty and the Beast.\" Enrolled at UCLA as an anthropology major, but dropped out to do the national tour of \"Bye Bye, Birdie\", with Tommy Tune. Welcomed her first child, Nina, with husband Robert Hartmann, on February 6th, 2007. Nina weighed 6 lbs 14 oz and measured 20.5 inches long. She was born a few days early, and was named after Robert's grandmother. Susan gave birth to a second daughter, Isla, on December 15, 2009. Appearing in the title role in the Broadway musical \"Thoroughly Modern Millie\". [February 2004] While performing in the revival of \"Bye, Bye Birdie\" with Tommy Tune he told her how much he loved the way she sang her first song and would often sing along with her as a vocal warm-up while he was in a costume change. The song was \"How Lovely To Be A Woman\". Although Egan considered that to be the greatest compliment she had ever received she could not get the image of Tune in his dressing room singing that song in his underwear out of her head.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzMjYzODI5ODJeQTJeQWpwZ15BbWU3MDI3MTM0Mzk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0250743","name":"Susan Egan","nicknames":["Su-Su","Susie","The Belle of Broadway","Sus"],"idIMDB":"nm0250743"},"actorId":"nm0250743","character":"Meg","urlCharacter":"http://www.imdb.com/character/ch0043225","main":true},{"actorName":"Bobcat Goldthwait","urlProfile":"http://www.imdb.com/name/nm0001281","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MDYxMTYwOF5BMl5BanBnXkFtZTcwNDUwNTYyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1962","placeOfBirth":" Syracuse, New York, USA","birthName":"Robert Francis Goldthwait","height":"5' 7\" (1.7 m)","bio":"Robert Francis 'Bobcat' Goldthwait, born May 26, 1962, is an American comedian. He is most widely known for his high pitch voice during his comedy acts. He was born in Syracuse, New York in 1962. He decided on a career as a comedian at an early age and was performing professionally while still in high school at the age of 15. He and his classmate, Tom Kenny, performed in a comedy duo, billing themselves as \"Bobcat and Tomcat\". Goldthwait became recognized as a solo stand-up comedian and had three televised concert specials in the 1980s: Bob Goldthwait - Is He Like That All the Time?, An Evening with Bobcat Goldthwait: Share the Warmth (1987) and Meat Bob. Goldthwait's first major film role was in Police Academy 2: Their First Assignment (1985). He reprised the role in the next two films in the series. During the fall of 1993, Goldthwait did stand-up material as an opening act for Nirvana on what would be their final North American tour. He has made several guest appearances on talk shows as well as comedy programs including The Ben Stiller Show (1992). On May 9, 1994, he made a controversial appearance on The Tonight Show with Jay Leno (1992), where, on impulse, he set a couch on fire. This incident was then the basis of the plot for his subsequent appearance on The Larry Sanders Show (1992). One of the most recognizable features of Goldthwait's performances is his voice. Goldthwait has voiced characters on the television series Capitol Critters (1992); The Moxy & Flea Show (1995); Unhappily Ever After (1995); Hercules (1998) and Buzz Lightyear of Star Command (2000). He has also appeared, as himself, hosting the comedy quiz show Bobcat's Big Ass Show (1998). Goldthwait has released two comedy albums: \"Meat Bob\" (1988) on Chrysalis Records and \"I Don't Mean to Insult You, but You Look Like Bobcat Goldthwait\" (23 September, 2003) on Comedy Central Records. He made his feature film directorial debut with Shakes the Clown (1991), which he wrote and starred in as well. His film, Windy City Heat (2003), won a Comedia Award for Best Comedy Film at Montreal's Just for Laughs Film Festival in 2004. He married Ann Luly in 1986 at the age of 24. The couple have two children (now grown), Tasha and Taylor, and divorced in May 1998. At one time, Goldthwait was engaged to his Unhappily Ever After (1995) co-star, Nikki Cox, but the couple has since split. Bobcat began directing ABC's Jimmy Kimmel Live! (2003) in the fall 2004 season. Since joining the show's crew, the ratings went up to 2 million viewers a night, with the numbers rising nearly 50% with the teenage demographic. In May of 2006, he left to pursue his film career as a filmmaker/director but has since returned to the show. Goldthwait's most recent feature, \"Sleeping Dogs Lie\" (formally Sleeping Dogs Lie (2006)), starring Melinda Page Hamilton, was in the 2006 Sundance Film Festival and it was part of the \"Independent Dramatic Features\" competition. \"Sleeping Dogs Lie\" is about a youthful, impulsive sexual encounter which opens the door to a dark comedy about the complexities of honesty. It was also nominated for the Grand Jury Prize in the \"Dramatic Features\" category. \"Sleeping Dogs Lie\" was picked up in a mid-six figure deal for distribution in north America by Roadside Attractions & Samuel Goldwyn Films at the 2006 Sundance Film Festival. A French film company called \"Gaumont\" bought it for the international rights to the film in France. \"Tartan Films\", a UK-based production company, also bought it for international rights in the United Kingdom. The film was released in the US on October 20, 2006.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MDYxMTYwOF5BMl5BanBnXkFtZTcwNDUwNTYyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001281","name":"Bobcat Goldthwait","nicknames":["The Bobcat","Bobscratch Goldfarb"],"idIMDB":"nm0001281"},"actorId":"nm0001281","character":"Pain","urlCharacter":"http://www.imdb.com/character/ch0000583","main":true},{"actorName":"Matt Frewer","urlProfile":"http://www.imdb.com/name/nm0001242","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2NDk1ODQ4MV5BMl5BanBnXkFtZTgwODg2Mzc2MjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 January 1958","placeOfBirth":" Washington, District of Columbia, USA","height":"6' 3\" (1.91 m)","bio":"Born in Washington D.C. and raised in Canada, Frewer attended the same Peterborough, Ontario area high school as his Psi Factor, chroniques du paranormal (1996) co-star Barclay Hope. He trained for the stage in England, spending several years in such varied UK productions as \"The Glass Menagerie\", \"Bent\" and \"A Comedy of Errors\". He has performed in dozens of feature films, TV movies and series. A committed environmentalist, Frewer is a spokesperson for the Rainforest Action Network. When not on location, he and his wife, Amanda Hillwood, and their daughter divide their time between Malibu, California and the Gatineau Hills of Quebec.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2NDk1ODQ4MV5BMl5BanBnXkFtZTgwODg2Mzc2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001242","name":"Matt Frewer","idIMDB":"nm0001242"},"actorId":"nm0001242","character":"Panic","urlCharacter":"http://www.imdb.com/character/ch0000584","main":true},{"actorName":"Rip Torn","urlProfile":"http://www.imdb.com/name/nm0001800","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMTI5MTA5MV5BMl5BanBnXkFtZTYwMDE2Mjk2._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 February 1931","placeOfBirth":" Temple, Texas, USA","birthName":"Elmore Rual Torn Jr.","height":"5' 10\" (1.78 m)","bio":"Rip Torn was born Elmore Rual Torn, Jr. on February 6, 1931 in Temple, Texas. \"Rip\" is a family name, taken by generations of Torn men and bestowed on Elmore by his father, who was also called \"Rip\". Torn attended Texas A & M and the University of Texas, where he majored in animal husbandry. Extremely naïf when he was young, Torn hitchhiked to Hollywood with the idea of becoming a movie star; he wanted to make enough money in order to buy a ranch. Success did not come overnight, as he had hoped, and Torn had to work many odd jobs while occasionally being cast in television roles. He made his feature film debut in Elia Kazan's Baby Doll (1956) in a small part. Serious about learning his craft, he moved to New York City where he studied under Lee Strasberg at the Actors Studio. Torn also studied dance with Martha Graham. His serious acting career began on the small screen, where he made a name for himself in the Golden Age of Television; between 1957 and 1960, he appeared regularly on such prestigious live shows as Omnibus (1952) and Playhouse 90 (1956). Torn made his Broadway debut in Kazan's staging of Tennessee Williams' \"Sweet Bird of Youth\" on March 10, 1959, in support of Paul Newman, Sidney Blackmer and Geraldine Page, who would become his second wife. The play was a hit, closing on January 30, 1960 after 375 performances. He won a 1960 Tony Award nomination as Best Featured Actor in a Play and a Theater World award for his role as \"Tom, Jr.\", a role he recreated in the 1962 film. (Torn also starred as \"Boss Finley\" in a later television adaptation of the play). Torn earned a reputation as an actor's actor on stage, both Broadway and off-Broadway, as well as on screen. He continues to work in the New York theater despite his demanding TV and movie schedule as both an actor and director. He has won two Obie awards for his work off-Broadway, for Distinguished Performance in Norman Mailer's \"The Deer Park\" (for the 1966-1967 season), and for Distinguished Direction for \"The Beard\" (1967-1968). He has his own stage company, and directed his daughter Angelica Page(by Geraldine Page) in John Paul Alexander's \"Strangers in the Land of Canaan\" at the Actors Studio. Torn made his feature film directorial debut with The Telephone (1988). He has constantly been in demand as a character actor, in supporting, second lead and occasional lead roles. His best performance on film came in Payday (1973), and he was nominated for a best supporting actor Oscar for Cross Creek (1983). Most of Torn's roles have been in drama, though he is adept in comedy. His role in Albert Brooks' comedy Defending Your Life (1991) led to his being cast in The Larry Sanders Show (1992), on which he played talk show producer \"Artie\". Torn won six consecutive Emmy nominations for the role, winning once for Best Supporting Actor in a comedy series in 1996. Rip Torn was married to actress Ann Wedgeworth from 1956 to 1961, whom he divorced to marry Geraldine Page. They remained married until her death in 1987. Torn helped his cousin, Oscar-winner Sissy Spacek, to make her way as an actress, seeing to it that she was accepted by the Lee Strasberg's Actors Studio and then the Lee Strasberg Institute.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMTI5MTA5MV5BMl5BanBnXkFtZTYwMDE2Mjk2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001800","name":"Rip Torn","idIMDB":"nm0001800"},"actorId":"nm0001800","character":"Zeus","urlCharacter":"http://www.imdb.com/character/ch0000553","main":true},{"actorName":"Samantha Eggar","urlProfile":"http://www.imdb.com/name/nm0002058","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODI2MjU3N15BMl5BanBnXkFtZTcwNjExNDk2Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 March 1939","placeOfBirth":" Hampstead, London, England, UK","birthName":"Victoria Louise Samantha Marie Elizabeth Therese Eggar","height":"5' 7\" (1.7 m)","bio":"Samantha Eggar was born on March 5, 1939 in Hampstead, London, England as Victoria Louise Samantha Marie Elizabeth Therese Eggar. She is an actress, known for Hercules (1997), Chromosome 3 (1979) and Doctor Dolittle (1967). She was previously married to Tom Stern.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODI2MjU3N15BMl5BanBnXkFtZTcwNjExNDk2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002058","name":"Samantha Eggar","idIMDB":"nm0002058"},"actorId":"nm0002058","character":"Hera, Hercules' Mother","urlCharacter":"http://www.imdb.com/character/ch0036964","main":true},{"actorName":"Barbara Barrie","urlProfile":"http://www.imdb.com/name/nm0057363","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1ODIyNzI0MF5BMl5BanBnXkFtZTcwMTExNTg2OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 May 1931","placeOfBirth":" Chicago, Illinois, USA","birthName":"Barbara Ann Berman","bio":"Chicago-born, Texas-raised Barbara Barrie already had a prolific theater career behind her when she came to prominence as the lead in One Potato, Two Potato (1964), for which she received the award for Prix d'interprétation féminine (best actress - tied with Anne Bancroft) at the 1964 Cannes Film Festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1ODIyNzI0MF5BMl5BanBnXkFtZTcwMTExNTg2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0057363","name":"Barbara Barrie","idIMDB":"nm0057363"},"actorId":"nm0057363","character":"Alcmene; Hercules' Foster Mother","urlCharacter":"http://www.imdb.com/character/ch0045026","main":true},{"actorName":"Hal Holbrook","urlProfile":"http://www.imdb.com/name/nm0001358","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNTMwNjE3NV5BMl5BanBnXkFtZTcwNTQzMjc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1925","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Harold Rowe Holbrook Jr.","height":"6' 1\" (1.85 m)","bio":"Hal Holbrook is an Emmy- and Tony-Award winning actor who is one of the great craftsman of stage and screen. He is best known for his performance as Mark Twain, for which he won a Tony and the first of his ten Emmy Award nominations. Aside from the stage, Holbrook made his reputation primarily on television, and was memorable as Abraham Lincoln, as Senator Hays Stowe on The Bold Ones: The Senator (1970) and as Capt. Lloyd Bucher on Pueblo (1973). All of these roles brought him Emmy Awards, with Pueblo (1973) bringing him two, as Best Lead Actor in a Drama and Actor of the Year - Special. On January 22, 2008, he became the oldest male performer ever nominated for a an Academy Award, for his supporting turn in Into the Wild (2007) He was born Harold Rowe Holbrook, Jr. on February 17, 1925 in Cleveland, Ohio, to Eileen (Davenport), a vaudeville dancer, and Harold Rowe Holbrook, Sr. Raised primarily in South Weymouth, Mass., Holbrook attended the Culver Academies. During World War II, Holbrook served in the Army in Newfoundland. After the war, he attended Denison University, graduating in 1948. While at Denison, Holbrook's senior honors project concerned Mark Twain. He'd later develop \"Mark Twain Tonight\", the one-man show in which he impersonates the great American writer Mark Twain, a.k.a. Samuel Clemens. Holbrook learned his craft on the boards and by appearing in the TV soap opera The Brighter Day (1954). He first played Mark Twain as a solo act in 1954, at Lock Haven State Teachers College in Pennsylvania. The show was a success that created a buzz. After seeing the performance, Ed Sullivan, the host of TV's premier variety show, featured him on The Ed Sullivan Show (1948) on February 12, 1956. This lead to an international tour sponsored by the U.S. Department of State, which included appearances in Iron Curtain countries. Holbrook brought the show to Off-Broadway in 1959. He even played Mark Twain for President Dwight D. Eisenhower. The 1966 \"Mark Twain Tonight\" Broadway production brought Holbrook even more acclaim, and the Tony Award. The show was taped and Holbrook won an Emmy nomination. He reprised the show on Broadway in 1977 and in 2005. By that time, he had played Samuel Clemens on stage over 2,000 times. Among Holbrook's more famous roles was \"The Major\" in the original Broadway production of Arthur Miller's \"Incident at Vichy\", as Martin Sheen's significant other in the controversial and acclaimed TV movie That Certain Summer (1972), the first TV movie to sympathetically portray homosexuality, and as Abraham Lincoln in a TV special based on Carl Sandburg's acclaimed biography of the 16th President. He also is known for his portrayal of the enigmatic \"Deep Throat\" in All the President's Men (1976), one of the major cinema events of the mid-'70s. In the 1990s, he had a regular supporting role in the TV series Evening Shade (1990), playing 'Burt Reynolds''s father-in-law.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNTMwNjE3NV5BMl5BanBnXkFtZTcwNTQzMjc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001358","name":"Hal Holbrook","idIMDB":"nm0001358"},"actorId":"nm0001358","character":"Amphitryon","urlCharacter":"http://www.imdb.com/character/ch0045027","main":true},{"actorName":"Paul Shaffer","urlProfile":"http://www.imdb.com/name/nm0787238","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwODA5OTEwMV5BMl5BanBnXkFtZTYwNzEzNTU0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 November 1949","placeOfBirth":" Thunder Bay, Ontario, Canada","birthName":"Paul A. Shaffer","height":"5' 5\" (1.65 m)","bio":"Paul Shaffer was born on November 28, 1949 in Thunder Bay, Ontario, Canada as Paul A. Shaffer. He is known for his work on Late Show with David Letterman (1993), A Very Murray Christmas (2015) and Late Night with David Letterman: 6th Anniversary Special (1988). He has been married to Catherine Vasapoli since August 19, 1990. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwODA5OTEwMV5BMl5BanBnXkFtZTYwNzEzNTU0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0787238","name":"Paul Shaffer","nicknames":["Johnny Carwash","Wayne 'Fatboy' Ewing","Paul W. Shaffer"],"idIMDB":"nm0787238"},"actorId":"nm0787238","character":"Hermes; the Messenger God","urlCharacter":"http://www.imdb.com/character/ch0043855","main":true},{"actorName":"Amanda Plummer","urlProfile":"http://www.imdb.com/name/nm0001625","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjIyNTY3NF5BMl5BanBnXkFtZTcwOTUwMzg4OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 March 1957","placeOfBirth":" New York City, New York, USA","birthName":"Amanda Michael Plummer","height":"5' 4\" (1.63 m)","bio":"The daughter of Canadian actor Christopher Plummer and American actress Tammy Grimes, Amanda Plummer was born in New York City on March 23, 1957. Her breakthrough role came when she starred opposite Robin Williams in The Fisher King (1991). However, Plummer may be best remembered for her work in the Quentin Tarantino classic Pulp Fiction (1994). Tarantino wrote the parts of two robbers who hold up a restaurant specifically for Plummer and her partner-in-screen-crime Tim Roth. Since that stand-out role, Plummer has continued to appear in a wide variety of films, including The Prophecy (1995), Freeway (1996), and Ma vie sans moi (2003). Plummer has also appeared in the films Butterfly Kiss (1995) as \"Eunice\" by Michael Winterbottom, Ma vie sans moi (2003) by Isabel Coixet, Pax (1994) by Eduardo Guedes, Daniel (1983) by Sidney Lumet, Ken Park (2002) by Larry Clark and, lately, The Making of Plus One (2010) and Inconceivable (2008) both by 'Mary Mcguckian', among others. She has often performed on stage. Her highly acclaimed work on Broadway has garnered her a Tony award and two Tony Award nominations as well as the Outer Critics Circle Award and Drama Desk Award. She was honored with three Emmy awards, and one Emmy nomination, a Saturn Award, and DVDX nomination, CableAce Award and Golden Globe nomination. In 1988, she was honored with the Anti-Defamation League Award for Woman of Achievement. On stage, Plummer appeared as Alma in Tennessee Williams's \"Summer and Smoke\" with Kevin Anderson, directed by Michael Wilson. At the Stratford Theater in Ontario, she was Joan of Arc in an original adaptation of \"The Lark\" by Jean Anouilh, directed by Michael Lindsay-Hogg. She appeared as Polly in \"The Gnadiges Fraulein\" with Elizabeth Ashley, and as Kyra in the world premiere of \"One Exception\", both by by Tennessee Williams, at the Hartford Stage. On Broadway: \"A Taste of Honey\" as Jo (nominated for a Tony Award, and Drama Desk Award, and received the Outer Critics Circle, and Theatre World Awards); as Agnes in \"Agnes of God\" with Geraldine Page (Tony Award, Drama Desk Award, Outer Critics Circle, and Boston Critics Awards); as Eliza in \"Pygmalion\" with Peter O'Toole and John Mills (Tony Award nomination); as Laura in \"The Glass Menagerie\" with Jessica Tandy; as Dolly in \"You Never Can Tell\" by George Bernard Shaw. Among her off-Broadway shows are \"A Lie of the Mind\" as Beth, directed and written by Sam Shepard with Harvey Keitel, Aidan Quinn and Geraldine Page, \"Killer Joe\" by Tracy Letts, \"The Milk Train Doesn't Stop Here Any More\" by Tennessee Williams, and \"A Taste of Honey\" with Valerie French. In England, at the Guilford Theatre she appeared as Eliza Doolittle in \"Pygmalion,\" and at the Royal Court Theatre did \"This Is a Chair\", directed by Stephen Daldry and written by Carol Churchill. Her regional work includes Juliet in \"Romeo & Juliet\" (Hollywood Dramalogue Award) and Sonya in \"Uncle Vanya,\" Frankie in \"A Member of the Wedding,\" \"Two Rooms,\" and \"The Wake of Jamey Foster\" by Beth Henley. In television, she is the recipient of three Emmy Awards, one Emmy nomination, a Cable Ace Award, and a Golden Globe nomination. She appeared as Lucky in the filmed workshop, \"Core Sample - Goli Otok\" with Vanessa Redgrave and Lynn Redgrave, directed by Lenka Udovicki, the artistic director of The Ulysses Theater on Brijuni, Croatia, and also in Lucky McKee's film Red (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjIyNTY3NF5BMl5BanBnXkFtZTcwOTUwMzg4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001625","name":"Amanda Plummer","idIMDB":"nm0001625"},"actorId":"nm0001625","character":"Clotho","urlCharacter":"http://www.imdb.com/character/ch0065806","main":true},{"actorName":"Carole Shelley","urlProfile":"http://www.imdb.com/name/nm0791186","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjE4OTczM15BMl5BanBnXkFtZTcwOTM3MzkxOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 August 1939","placeOfBirth":" London, England, UK","bio":"Though English-born, Carole Shelley has spent almost her entire award-winning career in the theatre in America, becoming one of Broadway's mainstays and a true pioneer of the American theatre. A naturalized US citizen, Shelley stays busy on all fronts in the entertainment industry in films, television and, of course, the live stage. Her Broadway credits include \"The Odd Couple\" (her Broadway debut) playing the hilarious Gwendolyn Pigeon, the intended blind date for the hapless Felix, a role she reprised for the film The Odd Couple (1968) and in the later television series (The Odd Couple (1970). Her other Broadway credits include \"The Miser\", \"Stepping Out\" (Tony nomination), \"The Elephant Man\" (Tony Award, Best Actress), \"Hay Fever\", \"The Norman Conquests\" (LADCC Award), \"Absurd Person Singular\" (Tony nomination) and \"Loot\". Her national tours include \"Broadway Bound\", \"The Royal Family\" and \"Noises Off\". She has also worked off-Broadway, in plays including \"The Film Society\", \"London Suite\", \"The Destiny of Me\", \"Richard II\" (New York Shakespeare Festival), \"Later Life\" (Drama Desk nomination), \"Cabaret Verboten\", \"What the Butler Saw\", \"Little Murders\", \"Twelve Dreams\" (Obie award), \"Tartuffe\". Returning to London, she replaced Maggie Smith in \"Lettuce and Lovage\" (she had gone to America to star in the Broadway run of the play) in the West End. Always interested in remaining busy, she has never turned down a good opportunity for work and has acquitted herself admirably by stepping into such long running hits as \"Cabaret\", \"Show Boat\", \"The Last Night of Ballyhoo\" and \"Noises Off\". She has kept busy in films, too, appearing in Quiz Show (1994), The Road to Wellville (1994), Jungle 2 Jungle (1997), The Super (1991) and she has provided some delightful vocal characterizations for many Disney animated features: Hercules (1997), Les aristochats (1970), The Hunchback of Notre Dame (1996) and Robin Hood (1973).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjE4OTczM15BMl5BanBnXkFtZTcwOTM3MzkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0791186","name":"Carole Shelley","idIMDB":"nm0791186"},"actorId":"nm0791186","character":"Lachesis","urlCharacter":"http://www.imdb.com/character/ch0065808","main":true}],"seasons":[],"idIMDB":"tt0119282","urlIMDB":"http://www.imdb.com/title/tt0119282","business":{"budget":{"money":"$85,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$21,454,451","country":"USA","day":"29","month":"06","year":"1997","remarks":"2,872 Screens wide release"},{"money":"$249,567","country":"USA","day":"15","month":"06","year":"1997","remarks":"1 Screen"}],"gross":[{"money":"$99,046,791","country":"USA","day":"21","month":"12","year":"1997","remarks":""},{"money":"$99,009,173","country":"USA","day":"14","month":"12","year":"1997","remarks":""},{"money":"$98,922,290","country":"USA","day":"07","month":"12","year":"1997","remarks":""},{"money":"$98,804,543","country":"USA","day":"30","month":"11","year":"1997","remarks":""},{"money":"$98,506,359","country":"USA","day":"23","month":"11","year":"1997","remarks":""},{"money":"$98,315,777","country":"USA","day":"16","month":"11","year":"1997","remarks":""},{"money":"$98,107,617","country":"USA","day":"09","month":"11","year":"1997","remarks":""},{"money":"$97,829,310","country":"USA","day":"02","month":"11","year":"1997","remarks":""},{"money":"$97,491,847","country":"USA","day":"26","month":"10","year":"1997","remarks":""},{"money":"$97,030,115","country":"USA","day":"19","month":"10","year":"1997","remarks":""},{"money":"$96,334,030","country":"USA","day":"12","month":"10","year":"1997","remarks":""},{"money":"$95,564,982","country":"USA","day":"05","month":"10","year":"1997","remarks":""},{"money":"$94,992,647","country":"USA","day":"28","month":"09","year":"1997","remarks":""},{"money":"$94,253,632","country":"USA","day":"21","month":"09","year":"1997","remarks":""},{"money":"$92,959,099","country":"USA","day":"14","month":"09","year":"1997","remarks":""},{"money":"$91,351,578","country":"USA","day":"07","month":"09","year":"1997","remarks":""},{"money":"$91,187,796","country":"USA","day":"01","month":"09","year":"1997","remarks":""},{"money":"$90,704,556","country":"USA","day":"24","month":"08","year":"1997","remarks":""},{"money":"$90,973,030","country":"USA","day":"17","month":"08","year":"1997","remarks":""},{"money":"$88,770,133","country":"USA","day":"10","month":"08","year":"1997","remarks":""},{"money":"$86,820,878","country":"USA","day":"03","month":"08","year":"1997","remarks":""},{"money":"$83,426,924","country":"USA","day":"27","month":"07","year":"1997","remarks":""},{"money":"$76,760,217","country":"USA","day":"20","month":"07","year":"1997","remarks":""},{"money":"$66,492,048","country":"USA","day":"13","month":"07","year":"1997","remarks":""},{"money":"$50,030,540","country":"USA","day":"06","month":"07","year":"1997","remarks":""},{"money":"$23,658,555","country":"USA","day":"29","month":"06","year":"1997","remarks":""},{"money":"$1,498,436","country":"USA","day":"22","month":"06","year":"1997","remarks":""},{"money":"$249,567","country":"USA","day":"15","month":"06","year":"1997","remarks":""},{"money":"£11,179,877","country":"UK","day":"04","month":"01","year":"1998","remarks":""},{"money":"$252,712,101","country":"Worldwide","day":"18","month":"08","year":"2012","remarks":""},{"money":"$146,000,000","country":"Worldwide","day":"11","month":"01","year":"1998","remarks":"except USA"},{"money":"$100,300,000","country":"Worldwide","day":"14","month":"12","year":"1997","remarks":"except USA"},{"money":"$78,100,000","country":"Worldwide","day":"30","month":"11","year":"1997","remarks":"except USA"},{"money":"$67,000,000","country":"Worldwide","day":"23","month":"11","year":"1997","remarks":"except USA"},{"money":"$60,000,000","country":"Worldwide","day":"16","month":"11","year":"1997","remarks":"except USA"},{"money":"$55,700,000","country":"Worldwide","day":"02","month":"11","year":"1997","remarks":"except USA"},{"money":"DEM 26,847,449","country":"Germany","day":"12","month":"01","year":"1998","remarks":""},{"money":"DEM 25,497,738","country":"Germany","day":"05","month":"01","year":"1998","remarks":""},{"money":"DEM 22,738,638","country":"Germany","day":"29","month":"12","year":"1997","remarks":""},{"money":"DEM 16,926,188","country":"Germany","day":"15","month":"12","year":"1997","remarks":""},{"money":"DEM 13,228,611","country":"Germany","day":"08","month":"12","year":"1997","remarks":""}],"weekendGross":[{"money":"£81,479","country":"UK","day":"04","month":"01","year":"1998","remarks":"134 Screens"}],"admissions":[{"money":"4,090,931","country":"France","day":"27","month":"01","year":"1998","remarks":""},{"money":"3,515,604","country":"France","day":"30","month":"12","year":"1997","remarks":""},{"money":"31,151 (France)","country":"opening","day":null,"month":null,"year":null,"remarks":null},{"money":"749,436 (France)","country":"opening","day":null,"month":null,"year":null,"remarks":null},{"money":"2,967,196","country":"Germany","day":"19","month":"01","year":"1998","remarks":""},{"money":"2,878,724","country":"Germany","day":"12","month":"01","year":"1998","remarks":""},{"money":"2,721,736","country":"Germany","day":"05","month":"01","year":"1998","remarks":""},{"money":"2,410,648","country":"Germany","day":"29","month":"12","year":"1997","remarks":""},{"money":"2,073,504","country":"Germany","day":"22","month":"12","year":"1997","remarks":""},{"money":"1,785,818","country":"Germany","day":"15","month":"12","year":"1997","remarks":""},{"money":"1,401,890","country":"Germany","day":"08","month":"12","year":"1997","remarks":""},{"money":"966,472","country":"Germany","day":"01","month":"12","year":"1997","remarks":""},{"money":"471,724","country":"Germany","day":"24","month":"11","year":"1997","remarks":"opening week"},{"money":"558,142","country":"Netherlands","day":"31","month":"12","year":"1998","remarks":""},{"money":"401,743","country":"Netherlands","day":"01","month":"01","year":"1998","remarks":""}],"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 33 min (93 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color (Technicolor)"],"aspectRatio":["1.78 : 1 / (high definition)","1.66 : 1 (negative ratio)","1.85 : 1 (intended ratio)"],"camera":null,"laboratory":["Technicolor, USA"],"filmLength":["2,548 m (Sweden)","2,644 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.2","filmingLocations":[],"rated":"G","awards":[{"award":"Academy Awards, USA 1998","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Music, Original Song","names":[{"name":"Alan Menken","id":"nm0579678","role":"music"},{"name":"David Zippel","id":"nm0957138","role":"lyrics"}]}]}]},{"award":"Golden Globes, USA 1998","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Original Song - Motion Picture","names":[{"name":"Alan Menken","id":"nm0579678","role":"music"},{"name":"David Zippel","id":"nm0957138","role":"lyrics"}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1998","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Fantasy Film","names":[]}]}]},{"award":"Annie Awards 1997","titlesAwards":[{"titleAwardOutcome":"Won Annie","categories":[{"category":"Best Individual Achievement: Directing in a Feature Production","names":[{"name":"Ron Clements","id":"nm0166256","role":null},{"name":"John Musker","id":"nm0615780","role":null}]},{"category":"Best Individual Achievement: Producing in a Feature Production","names":[{"name":"Alice Dewey","id":"nm0223107","role":null},{"name":"Ron Clements","id":"nm0166256","role":null},{"name":"John Musker","id":"nm0615780","role":null}]},{"category":"Best Individual Achievement: Effects Animation","names":[{"name":"Mauro Maressa","id":"nm0546520","role":null}]},{"category":"Best Individual Achievement: Character Animation","names":[{"name":"Nik Ranieri","id":"nm0710181","role":null}]}]},{"titleAwardOutcome":"Nominated Annie","categories":[{"category":"Best Animated Feature","names":[]},{"category":"Best Individual Achievement: Character Animation","names":[{"name":"Ken Duncan","id":"nm0242008","role":null}]}]}]},{"award":"ASCAP Film and Television Music Awards 1998","titlesAwards":[{"titleAwardOutcome":"Won ASCAP Award","categories":[{"category":"Top Box Office Films","names":[{"name":"David Zippel","id":"nm0957138","role":null}]}]}]},{"award":"Awards Circuit Community Awards 1997","titlesAwards":[{"titleAwardOutcome":"2nd place ACCA","categories":[{"category":"Best Animated Feature","names":[]}]},{"titleAwardOutcome":"Nominated ACCA","categories":[{"category":"Best Original Score","names":[{"name":"Alan Menken","id":"nm0579678","role":null}]}]}]},{"award":"Blockbuster Entertainment Awards 1998","titlesAwards":[{"titleAwardOutcome":"Nominated Blockbuster Entertainment Award","categories":[{"category":"Favorite Animated Famliy Movie","names":[]},{"category":"Favorite Song from a Movie","names":[]}]}]},{"award":"Casting Society of America, USA 1998","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Best Casting for Animated Voiceover","names":[{"name":"Ruth Lambert","id":"nm0483294","role":null}]}]}]},{"award":"Golden Screen, Germany 1998","titlesAwards":[{"titleAwardOutcome":"Won Golden Screen","categories":[{"category":"","names":[]}]}]},{"award":"Los Angeles Film Critics Association Awards 1997","titlesAwards":[{"titleAwardOutcome":"Won LAFCA Award","categories":[{"category":"Best Animation","names":[{"name":"John Musker","id":"nm0615780","role":null},{"name":"Ron Clements","id":"nm0166256","role":null}]}]}]},{"award":"Motion Picture Sound Editors, USA 1998","titlesAwards":[{"titleAwardOutcome":"Won Golden Reel Award","categories":[{"category":"Best Sound Editing - Animated Feature","names":[{"name":"Tim Holland","id":"nm0390843","role":"supervising sound editor"},{"name":"Gary Rydstrom","id":"nm0003977","role":"sound designer"},{"name":"Marilyn McCoppen","id":"nm0566359","role":"supervising adr editor/dialogue editor"},{"name":"Pat Jackson","id":"nm0413913","role":"sound effects editor"},{"name":"Jeff Jones","id":"nm0428335","role":"sound effects editor"},{"name":"John K. Carr","id":"nm0139758","role":"sound effects editor"},{"name":"Mary Helen Leasman","id":"nm0495294","role":"foley editor"},{"name":"Marian Wilde","id":"nm0928480","role":"foley editor"},{"name":"James Melton","id":"nm0578394","role":"dialogue editor"}]}]},{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing - Music Animation","names":[]}]}]},{"award":"Online Film & Television Association 1998","titlesAwards":[{"titleAwardOutcome":"Won OFTA Film Award","categories":[{"category":"Best Voice-Over Performance","names":[{"name":"James Woods","id":"nm0000249","role":null}]}]},{"titleAwardOutcome":"Nominated OFTA Film Award","categories":[{"category":"Best Voice-Over Performance","names":[{"name":"Danny DeVito","id":"nm0000362","role":null}]},{"category":"Best Animated Picture","names":[{"name":"Ron Clements","id":"nm0166256","role":null},{"name":"Alice Dewey","id":"nm0223107","role":null},{"name":"John Musker","id":"nm0615780","role":null}]},{"category":"Best Music, Original Comedy/Musical Score","names":[{"name":"Alan Menken","id":"nm0579678","role":null},{"name":"David Zippel","id":"nm0957138","role":null}]},{"category":"Best Music, Original Song","names":[{"name":"Alan Menken","id":"nm0579678","role":"music by"},{"name":"David Zippel","id":"nm0957138","role":"lyrics by"},{"name":"Roger Bart","id":"nm0058372","role":"performed by"}]}]}]},{"award":"Young Artist Awards 1998","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Performance in a Voiceover - TV or Film - Young Actor","names":[{"name":"Josh Keaton","id":"nm0005079","role":null}]}]}]}],"votes":"153,098","type":"Movie","companyCreditsSimple":[{"idCompany":"co0008970","name":"Walt Disney Pictures"},{"idCompany":"co0075995","name":"Walt Disney Feature Animation"}],"keywords":{"keywords":["hercules","zeus","hero","hades","underworld","greece","olympus","titan","satyr","love","greek god","monster","ancient greece","baby","self sacrifice","trainer","rescue","immortality","fate","pegasus","eyeball","evil man","lump on head","chipmunk","transformation","eye","cigar smoking","lion","rabbit","fire","uncle nephew relationship","bronze age","reference to trojan war","13th century b.c.","bully comeuppance","sword and sandal","warrior","superhero","2d animation","wilhelm scream","eating a flower","family relationships","shyness","cat","lifting someone into the air","rock monster","foster parent","two headed creature","three headed creature","swallowed whole","waterfall","vase","trap","training","tornado","sword","super strength","soul","snake","ship","severed head","prophecy","nymph","musical number","muse","medusa","landslide","imp","hydra","chain reaction","hate","good versus evil","giant monster","gate","fish","father son relationship","eaten alive","cyclops","child in peril","cerberus","centaur","boar","betrayal","based on greek myth","animal attack","afterlife","god woman relationship","horse","no opening credits","blockbuster","legend","planetary alignment","greek mythology","helicopter","pitchfork","death","mythology","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:50:24"}}