{"data":{"movies":[{"title":"Frankie and Johnny","originalTitle":"","year":"1991","releaseDate":"19911011","directors":[{"name":"Garry Marshall","id":"nm0005190"}],"writers":[{"name":"Terrence McNally","id":"nm0573645"},{"name":"Terrence McNally","id":"nm0573645"}],"runtime":"118 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA4Y2QyODMtNzBiYi00OGYwLTkxZjQtNjZmZGI3ZTc4NTk0XkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama","Romance"],"plot":"Johnny on his release from his jail joins the restaurant where Frankie works. Johnny discovered his talent for cooking when in jail. Love at first sight bites Johnny on seeing Frankie. He makes direct attempts to get her heart. But deep a wound in Frankie's heart would not let her give her heart to Johnny. Johnny's divorced wife and kids have moved to a new world of a different person. Frankie opens up her tragic story and Johnny promises to be with her in difficult times.","simplePlot":"Johnny has just been released from prison, and gets a job in a café beside waitress Frankie. Frankie is a bit of a loner, but Johnny is determined their romance will blossom.","actors":[{"actorName":"Al Pacino","urlProfile":"http://www.imdb.com/name/nm0000199","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzg1ODAyNl5BMl5BanBnXkFtZTYwMjAxODQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1940","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Alfredo James Pacino","height":"5' 7\" (1.7 m)","bio":"One of the greatest actors in all of film history, Al Pacino established himself during one of film's greatest decades, the 1970s, and has become an enduring and iconic figure in the world of American movies. Alfredo James Pacino was born on April 25, 1940, in the Bronx, New York, to an Italian-American family. His parents, Rose (Gerardi) and Sal Pacino, divorced when he was young. His mother moved them into his grandparents' house. Pacino found himself often repeating the plots and voices of characters he had seen in the movies, one of his favorite activities. Bored and unmotivated in school, the young Al Pacino found a haven in school plays, and his interest soon blossomed into a full-time career. Starting on the stage, he went through a lengthy period of depression and poverty, sometimes having to borrow bus fare to make it to auditions. He made it into the prestigious Actors Studio in 1966, studying under legendary acting coach Lee Strasberg, creator of the Method Approach that would become the trademark of many 1970s-era actors. After appearing in a string of plays in supporting roles, Pacino finally succeeded with \"The Indian Wants the Bronx\", winning an Obie Award for the 1966-67 season. That was followed by a Tony Award for \"Does the Tiger Wear a Necktie?\". His first feature films made little departure from the gritty realistic stage performances that earned him respect: he played a drug addict in The Panic in Needle Park (1971) after his film debut in Me, Natalie (1969). What came next would change his life forever. The role of Michael Corleone in The Godfather (1972) was one of the most sought-after of the time: Robert Redford, Warren Beatty, Jack Nicholson, Ryan O'Neal, Robert De Niro and a host of others either wanted it or were mentioned for it, but director Francis Ford Coppola had his heart set on the unknown Italian Pacino for the role, although pretty much everyone else--from the studio to the producers to some of the cast members--did not want him. Though Coppola won out through slick persuasion, Pacino was in constant fear of being fired during the hellish shoot. Much to his (and Coppola's) relief, the film was a monster hit that did wonders for everyone's career, including Pacino's, and earned him his first Academy Award nomination for Best Supporting Actor. However, instead of taking on easier projects for the big money he could now command, Pacino threw his support behind what he considered tough but important films, such as the true-life crime drama Serpico (1973) and the tragic real-life bank robbery film Dog Day Afternoon (1975). He opened eyes around the film world for his brave choice of roles, and he was nominated three consecutive years for the \"Best Actor\" Academy Award. He faltered slightly with Bobby Deerfield (1977), but regained his stride with ...and justice for all. (1979), for which he received another Academy Award nomination for Best Actor. Unfortunately, this would signal the beginning of a decline in his career, which produced such critical and commercial flops as Cruising - La Chasse (1980) and Author! Author! (1982). Pacino took on another vicious gangster role and cemented his legendary status in the ultra-violent cult film Scarface (1983)_, but a monumental mistake was about to follow. Revolution (1985) endured an endless and seemingly cursed shoot in which equipment was destroyed, weather was terrible, and Pacino became terribly ill with pneumonia. Constant changes in the script also further derailed a project that seemed doomed from the start anyway. The Revolutionary War film is considered one of the worst films ever, not to mention one of the worst of his career, resulted in his first truly awful reviews and kept him off the screen for the next four years. Returning to the stage, Pacino has done much to give back and contribute to the theatre, which he considers his first love. He directed a film, The Local Stigmatic (1990), but it remains unreleased. He lifted his self-imposed exile with the striking Sea of Love (1989) as a hard-drinking policeman. This marked the second phase of Pacino's career, being the first to feature his now famous dark, owl eyes and hoarse, gravelly voice. Returning to the Corleones, Pacino made The Godfather: Part III (1990) and earned raves for his first comedic role in the colorful Dick Tracy (1990). This earned him another Academy Award nomination for Best Supporting Actor, and two years later he was nominated for Glengarry Glen Ross (1992). He went into romantic mode for Frankie and Johnny (1991). In 1992, he finally won the Academy Award for Best Actor for his amazing performance in Scent of a Woman (1992). A mixture of technical perfection (he plays a blind man) and charisma, the role was tailor-made for him, and remains a classic. The next few years would see Pacino becoming more comfortable with acting and movies as a business, turning out great roles in great films with more frequency and less of the demanding personal involvement of his wilder days. Carlito's Way (1993) proved another gangster classic, as did the epic crime drama Heat (1995) directed by Michael Mann and co-starring Robert De Niro, although they only had a few scenes together. He returned to the director's chair for the highly acclaimed and quirky Shakespeare adaptation Looking for Richard (1996). City Hall (1996), Donnie Brasco (1997) and The Devil's Advocate (1997) all came out in this period. Reteaming with Mann and then Oliver Stone, he gave two commanding performances in The Insider (1999) and Any Given Sunday (1999). In the 2000s, Pacino starred in a number of theatrical blockbusters, including Ocean's Thirteen (2007), but his choice in television roles (the vicious Roy Cohn in HBO's miniseries Angels in America (2003) and his sensitive portrayal of Jack Kevorkian, in the television movie You Don't Know Jack (2010)) are reminiscent of the bolder choices of his early career. Each television project garnered him an Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie. In his personal life, Pacino is one of Hollywood's most enduring and notorious bachelors, having never been married. He has a daughter, Julie Marie, with acting teacher Jan Tarrant, and a new set of twins with longtime girlfriend Beverly D'Angelo. His romantic history includes a long-time romance with \"Godfather\" co-star Diane Keaton. With his intense and gritty performances, Pacino was an original in the acting profession. His Method approach would become the process of many actors throughout time, and his unbeatable number of classic roles has already made him a legend among film buffs and all aspiring actors and directors. His commitment to acting as a profession and his constant screen dominance has established him as one of the movies' true legends. Pacino has never abandoned his love for the theater, and Shakespeare in particular, having directed the Shakespeare adaptation Looking for Richard (1996) and played Shylock in The Merchant of Venice (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzg1ODAyNl5BMl5BanBnXkFtZTYwMjAxODQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000199","name":"Al Pacino","nicknames":["Sonny"],"idIMDB":"nm0000199"},"actorId":"nm0000199","character":"Johnny","urlCharacter":"http://www.imdb.com/character/ch0019431","main":true},{"actorName":"Michelle Pfeiffer","urlProfile":"http://www.imdb.com/name/nm0000201","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNjI0Njc5NF5BMl5BanBnXkFtZTYwOTM2MjYz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1958","placeOfBirth":" Santa Ana, California, USA","birthName":"Michelle Marie Pfeiffer","height":"5' 7½\" (1.71 m)","bio":"Michelle Pfeiffer was born in Santa Ana, California, to Donna Jean (Taverna) and Richard Pfeiffer, a heating and air-conditioning contractor. She has an older brother and two younger sisters - Dedee Pfeiffer and Lori Pfeiffer, who both dabbled in acting and modeling but decided against making it their life's work. Her parents were both originally from North Dakota. Her father had German and British Isles ancestry, and her mother was of half Swiss-German and half Swedish descent. Pfeiffer graduated from Fountain Valley High School in 1976, and attended one year at the Golden West College, where she studied to become a court reporter. But it was while working as a supermarket checker at Vons, a large Southern California grocery chain, that she realized her true calling. She was married to actor/director Peter Horton (\"Gary\" of Thirtysomething (1987)) in 1981. They were later divorced, and she then had a three year relationship with actor Fisher Stevens. When that did not work out, Pfeiffer decided she did not want to wait any longer before having her own family, and in March 1993, she adopted a baby girl, Claudia Rose. On November 13th of the same year, she married lawyer-turned-writer/producer David E. Kelley, creator of Picket Fences (1992), Chicago Hope (1994), The Practice (1997), and Boston Public (2000). On August 5, 1994, their son John Henry was born.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNjI0Njc5NF5BMl5BanBnXkFtZTYwOTM2MjYz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000201","name":"Michelle Pfeiffer","idIMDB":"nm0000201"},"actorId":"nm0000201","character":"Frankie","urlCharacter":"http://www.imdb.com/character/ch0019432","main":true},{"actorName":"Hector Elizondo","urlProfile":"http://www.imdb.com/name/nm0001185","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMDEzMTE4MDFeQTJeQWpwZ15BbWU3MDk3ODU3MTM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 December 1936","placeOfBirth":" New York City, New York, USA","height":"5' 10\" (1.78 m)","bio":"Hector Elizondo was born in New York City, New York, where he was raised, on the Upper West Side of Manhattan. He is the son of Carmen Medina Reyes and Martín Echevarría Elizondo. Hector is of Basque and Puerto Rican descent, and \"Elizondo\" means \"at the foot of the church\" in Basque. His lifestyle in his pre-acting days was as diverse as the roles he plays today. He was a conga player with a Latin band, a classical guitarist and singer, a weightlifting coach, a ballet dancer and a manager of a bodybuilding gym. In his teens, he played basketball and baseball and was scouted by the New York Giants and Pittsburgh Pirates farm teams. After a knee injury ended his dance career, he switched to drama. Since then, he has frequently appeared on Broadway, most notably with George C. Scott in Arthur Penn's production of \"Sly Fox\" for which he received a Drama Desk nomination and for his role as \"God\" in \"Steambath\", which won him an Obie Award. Other theatre credits include; \"The Prisoner of Second Avenue\"; \"The Great White Hope\"; \"Dance of Death\" with Robert Shaw and \"The Rose Tattoo\" opposite Cicely Tyson. Countless starring roles in television include: Foley Square (1985); American Playhouse: Medal of Honor Rag (1982); Casablanca (1983) (in which he recreated the Claude Rains role of police chief \"Capt. Renault\"); Freebie and the Bean (1974); Popi (1975) and as Sophia Loren's husband in the CBS special Courage (1986). Guest appearances include: Kojak (1973); Kojak: Ariana (1989); Columbo: A Case of Immunity (1975); Baretta (1975); All in the Family (1971); The Rockford Files (1974) and Bret Maverick (1981). In addition, he also directed a.k.a. Pablo (1984), the first show to utilise seven cameras instead of the usual four. On the big screen, he has been seen in, among others, American Gigolo (1980); The Taking of Pelham One Two Three (1974); Cuba (1979); Valdez Is Coming (1971) and in four films directed by Garry Marshall: Young Doctors in Love (1982); The Flamingo Kid (1984); Nothing in Common (1986) and Overboard (1987). Elizondo starred with Dan Aykroyd and Michelle Pfeiffer in PBS' Great Performances: Tales from the Hollywood Hills: Natica Jackson (1987) (based on a collection of John O'Hara stories) and made his debut as a stage director with a production of \"Villa!\" starring Julio Medina. In addition, he performed in the 50th anniversary production of \"War of the Worlds\" co-starring Jason Robards and the TV-movie Addicted to His Love (1988) with Barry Bostwick.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMDEzMTE4MDFeQTJeQWpwZ15BbWU3MDk3ODU3MTM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001185","name":"Hector Elizondo","idIMDB":"nm0001185"},"actorId":"nm0001185","character":"Nick","urlCharacter":"http://www.imdb.com/character/ch0019434","main":true},{"actorName":"Nathan Lane","urlProfile":"http://www.imdb.com/name/nm0001447","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwMTc1MjQ3NzFeQTJeQWpwZ15BbWU3MDEzNjEwODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 February 1956","placeOfBirth":" Jersey City, New Jersey, USA","birthName":"Joseph Lane","height":"5' 7\" (1.7 m)","bio":"Nathan Lane was born on February 3, 1956 in Jersey City, New Jersey, USA as Joseph Lane. He is an actor, known for The Lion King (1994), The Birdcage (1996) and The Producers (2005). He has been married to Devlin Elliott since November 17, 2015.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwMTc1MjQ3NzFeQTJeQWpwZ15BbWU3MDEzNjEwODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001447","name":"Nathan Lane","idIMDB":"nm0001447"},"actorId":"nm0001447","character":"Tim","urlCharacter":"http://www.imdb.com/character/ch0019433","main":true},{"actorName":"Kate Nelligan","urlProfile":"http://www.imdb.com/name/nm0625075","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc3MTc5OTUxOF5BMl5BanBnXkFtZTcwMDE4OTgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 March 1950","placeOfBirth":" London, Ontario, Canada","birthName":"Patricia Colleen Nelligan","height":"5' 6½\" (1.69 m)","bio":"Cando-American actress Kate Nelligan has had a successful acting career in her native Canada, in Britain and in the United States. Born Patricia Colleen Nelligan on March 16, 1951 in London, Ontario, Kate was the daughter of blue collar-worker Patrick Nelligan and his wife Josephine (née Deir), a schoolteacher who suffered from alcoholism and mental illness. Nelligan studied at Toronto's Glendon College, but left to attend the Central School of Speech and Drama in London. She quickly established herself in the UK on stage and on television. As a member of the National Theatre, she gave a much lauded performance in \"Tales from the Vienna Woods\" and was nominated for a Laurence Olivier Award for David Hare's Plenty (1985). (Ironically, she was beaten by Lady Olivier, Joan Plowright, but would soon play opposite of her husband and Frank Langella in the 1979 version of Dracula (1979).) Her performance as Isabella in 'Shakespeare's Measure for Measure (1979) in 1979 also was highly acclaimed. She had her shot at movie stardom with \"Dracula\" and the 1981 thriller _Eye of the Needle (1981), but did not become a star. She moved to Manhattan in the early '80s, dropped the English accent, and won stardom on the Broadway boards, racking up four Tony Award nominations for Best Actress in the 1980s. On the screen, both big and small, she established herself as a top-notch and in-demand supporting player and character actress. Nelligan was Oscar-nominated as Best Supporting Actress for The Prince of Tides (1991) in 1992. Her performances in movies and television in her native Canada have brought her five Gemini Awards nominations.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc3MTc5OTUxOF5BMl5BanBnXkFtZTcwMDE4OTgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0625075","name":"Kate Nelligan","idIMDB":"nm0625075"},"actorId":"nm0625075","character":"Cora","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jane Morris","urlProfile":"http://www.imdb.com/name/nm0606623","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3NDg1MjMyN15BMl5BanBnXkFtZTgwMzQ2NjA5NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Jane Morris was born in Quincy, Illinois, USA. She is an actress, known for True Lies (1994), Runaway Bride (1999) and Behind the Candelabra (2013). She is married to Jeff Michalski. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3NDg1MjMyN15BMl5BanBnXkFtZTgwMzQ2NjA5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0606623","name":"Jane Morris","idIMDB":"nm0606623"},"actorId":"nm0606623","character":"Nedda","urlCharacter":"http://www.imdb.com/character/ch0019435","main":true},{"actorName":"Greg Lewis","urlProfile":"http://www.imdb.com/name/nm0507239","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGMyZjlkYmMtNTJhNS00OGNjLWE3MmQtM2RlNmRhNDdmNjY4XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"bio":"Greg Lewis is an actor and writer, known for K-PAX (2001), Frankie and Johnny (1991) and The Princess Diaries (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGMyZjlkYmMtNTJhNS00OGNjLWE3MmQtM2RlNmRhNDdmNjY4XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0507239","name":"Greg Lewis","idIMDB":"nm0507239"},"actorId":"nm0507239","character":"Tino","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Al Fann","urlProfile":"http://www.imdb.com/name/nm0266802","urlPhoto":"","biography":{"dateOfBirth":"21 February 1925","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Albert Louis Fann","bio":"Al Fann was born on February 21, 1925 in Cleveland, Ohio, USA as Albert Louis Fann. He is an actor and producer, known for The French Connection (1971), The Fisher King (1991) and Frankie and Johnny (1991). He was previously married to Mi Mi Green.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0266802","name":"Al Fann","idIMDB":"nm0266802"},"actorId":"nm0266802","character":"Luther","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ele Keats","urlProfile":"http://www.imdb.com/name/nm0444185","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQzOTcwMDU5OF5BMl5BanBnXkFtZTcwMDMzNjIzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1973","placeOfBirth":" Paris, France","birthName":"Elemy Georgescu","height":"5' 7\" (1.7 m)","bio":"Recognized as \"the essence of health, talent and sincerity\", Ele Keats has worked with some of the most acclaimed artists in Hollywood since her acting debut at 15 in the famous Michael Jackson Pepsi commercial. Born in Paris to copywriter Sacha Georgescu and Ford model Jan McGuire, Keats was raised in New York City and Germany before relocating to Los Angeles at 12 where she pursued her model and acting career. A trained singer and dancer, Keats quickly established herself as a familiar face on television, appearing in numerous commercials and starring as Anny in Fox's teen soap-opera Tribes (1990). More film roles followed, including There Goes My Baby (1994), Garry Marshall's Frankie and Johnny (1991) (opposite Al Pacino and Michelle Pfeiffer), the Disney musical Newsies (1992) (opposite Christian Bale and Robert Duvall) and Frank Marshall's acclaimed drama Alive (1993) (opposite Ethan Hawke and Vincent Spano). On television, she has worked in numerous renowned series such as Diagnosis Murder (1993), Touched by an Angel (1994), CSI: Crime Scene Investigation (2000) and Cold Case (2003) and has appeared in more than one hundred national TV commercials. More recently, Keats has kept building her solid career with roles in Steven Soderbergh's Eros (2004) (opposite Robert Downey Jr.), the acclaimed short film Snowflake (2014) and the horror film Insidious: Chapitre 3 (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQzOTcwMDU5OF5BMl5BanBnXkFtZTcwMDMzNjIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0444185","name":"Ele Keats","idIMDB":"nm0444185"},"actorId":"nm0444185","character":"Artemis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fernando López","urlProfile":"http://www.imdb.com/name/nm0530112","urlPhoto":"","biography":{"bio":"Fernando López is an actor, known for One Life to Live (1968), Frankie and Johnny (1991) and Thirteen Conversations About One Thing (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0530112","name":"Fernando López","idIMDB":"nm0530112"},"actorId":"nm0530112","character":"Jorge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Glenn Plummer","urlProfile":"http://www.imdb.com/name/nm0687625","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzgxNTQzNV5BMl5BanBnXkFtZTgwNzE0MzA0ODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1961","placeOfBirth":" Richmond, California, USA","birthName":"Glenn E. Plummer","height":"5' 7½\" (1.71 m)","bio":"On a foundation of talent, unbridled dedication and a passionate mindset, Glenn Plummer has enjoyed a successful acting career that spans almost two decades. He has starred in such feature films as: Saw II (2005), co-starring Donnie Wahlberg, Shawnee Smith, Dina Meyer and Beverley Mitchell; Dennis Hopper's Colors (1988), co-starring Sean Penn, Robert Duvall and Maria Conchita Alonso; Menace II Society (1993), co-starring Samuel L. Jackson, Larenz Tate and Anthony Johnson; Showgirls (1995), co-starring Elizabeth Berkley, Kyle MacLachlan and Gina Gershon; The Salton Sea (2002), co-starring Val Kilmer, Vincent D'Onofrio, Anthony LaPaglia and Luiz Guzman; Poolhall Junkies (2002), co-starring Christopher Walken, Chazz Palminteri and Alison Eastwood and the compelling drama South Central (1992) in the break out role of \"O.G.\" Bobby Johnson, one of Glenn's most memorable performances. It was largely this very moving role that helped solidify Glenn as a staple in the African-American film community. Experiencing much crossover success, Glenn took his abilities to cover a wide range of personas and delved into television. Appearing in such television movies and mini-series as, ABC's The Women of Brewster Place (1989) with Oprah Winfrey, Lynn Whitfield and Cicely Tyson; TNT's Heat Wave (1990), L.A.'s Watt's Riots of 1965, alongside Cicely Tyson, Blair Underwood, James Earl Jones and TNT's Reversible Errors (2004), with William H. Macy, Tom Selleck and Monica Potter, Glenn Plummer generated praise and accolades from critics alike for his performances in Showtime's Ruby's Bucket of Blood (2001), co-starring Angela Bassett, as well as his deep, thought-provoking exhibition in HBO's The Corner (2000), with T.K. Carter and Khandi Alexander. Before returning to the big screen, Glenn had a re-occurring role as \"Timmy Rawlins\" in the inaugural season of the Emmy/Golden Globes Award-Winning, television show ER (1994) including the 88-minute pilot. Currently, Glenn Plummer's projects include writing, directing (in his directorial debut), producing and starring in the upcoming horror film VooDoo Curse: The Giddeh (2006), co-starring Randy Brooks, Kira Madallo Sesay and Terry Bookhart.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzgxNTQzNV5BMl5BanBnXkFtZTgwNzE0MzA0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0687625","name":"Glenn Plummer","idIMDB":"nm0687625"},"actorId":"nm0687625","character":"Peter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tim Hopper","urlProfile":"http://www.imdb.com/name/nm0394434","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUxMjQwNjQzN15BMl5BanBnXkFtZTcwMzc5NzQ4Nw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Tim Hopper is an actor, known for Vanilla Sky (2001), School of Rock (2003) and The Last of the Mohicans (1992).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUxMjQwNjQzN15BMl5BanBnXkFtZTcwMzc5NzQ4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0394434","name":"Tim Hopper","idIMDB":"nm0394434"},"actorId":"nm0394434","character":"Lester","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harvey Miller","urlProfile":"http://www.imdb.com/name/nm0588458","urlPhoto":"","biography":{"dateOfBirth":"15 June 1935","placeOfBirth":" New York, New York, USA","birthName":"Harvey Skolnik","bio":"Harvey was born as Harvey Skolnik. He grew up in Plainfield, New Jersey. Harvey started his career in New York City as comedienne Sandy Baron's manager. Harvey furthered his career by working with his close longtime friends: Garry Marshall, Penny Marshall, Albert Brooks, James L. Brooks and Jerry Belson, Harvey helped create Love American Style with Bill Idelson. Harvey also loved meeting celebrities so when he was head writer and director of TV's The Odd Couple, his invigoration of the show by introducing big name talent served dual purposes. Harvey was responsible for integrating the following people into the show: Howard Cosell, Bobby Riggs, Billy Jean King, Paul Williams, Betty White, Alan Ludden and many others. Harvey first met Burt Reynolds on Cannonball Run. There is a very famous episode of the dating game whereby the bachlorette, due to her attraction to his charm and razor sharp humor, chooses Harvey over Burt Reynolds. When the bachelorette meets and sees that she did't choose Burt, she is devastated. When the host announces her date as Harvey Skolnik from Plainfield, NJ she Is crestfallen. Harvey was a fairly attractive man, but the meet became enormously funny. From that day on When attending industry events or parties, he would always ask if Reynolds was going to be there, so that Reynolds couldn't vengefully express his embarrassment for losing to Harvey. Harvey bought and lived in Harrison Ford's old house. Before he became a movie star, Harrison was a carpenter and built a lovely country style home in LA. Harvey made classic cameos in The Odd Couple as the penguin in the bathtub in the nude off broadway show episode whereby Felix secretly attends his girlfriend's only to embarrass her by covering her up when she appears naked. He also made classic cameo appearances in the Laverne and Shirley whereby he played a shyster producer who steals Lavergn's heirloom earrings. Since he was so close with Penny Marshall, Albert Brooks, Garry Marshall, Jerry Belson and others he always made brief mostly comedic appearances in their TV Shows and Movies. A few of them included: Young Doctors in Love, Beaches, Modern Romance, Awakenings, and Others. Harvey was always the life of every party and set. He was a unique talent and irrepressible spirit. This world is now a far less interesting place without him. He will be sorely missed.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0588458","name":"Harvey Miller","idIMDB":"nm0588458"},"actorId":"nm0588458","character":"Mr. Rosen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sean O'Bryan","urlProfile":"http://www.imdb.com/name/nm0639917","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ4NDc3NTU1MF5BMl5BanBnXkFtZTcwMDg1NDY1Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1963","placeOfBirth":" Louisville, Kentucky, USA","birthName":"Sean Michael O'Bryan","height":"6' 2\" (1.88 m)","bio":"Originally from Kentucky, Sean O'Bryan moved to Los Angeles over ten years ago and has worked extensively in film and TV. Some major key TV guest appearances include Chicago Hope, Beverly Hills 90210, and Felicity. Sean has done several major films including, Phenomenon (1996), Exit to Eden (1994), The Princess Diaries (2001), and Frankie and Johnny (1991). Not only has he focused on working in front of the camera, he's also done several theatrical performances, including: The Lisbon Traviata, It's Only a Play, Money and Friends et al. In 1995, Sean married Samantha Follows (sister to Megan Follows - star of Anne of Green Gables) and they currently have two children. In 2001, Sean joined the entire Follows family to perform in Noel Coward's \"Hay Fever\" at the Gravenhurst Opera House in Gravenhurst, Ontario, Canada. As all the Follows are Canadian, Sean was the only American on stage in this British play; however, his character was the only American character so he had it made! Sean can be seen in the new kids flick, Big Fat Liar (2002) starring Frankie Muniz.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ4NDc3NTU1MF5BMl5BanBnXkFtZTcwMDg1NDY1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0639917","name":"Sean O'Bryan","idIMDB":"nm0639917"},"actorId":"nm0639917","character":"Bobby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Goldie McLaughlin","urlProfile":"http://www.imdb.com/name/nm0572325","urlPhoto":"","biography":{"bio":"Goldie McLaughlin is an actress, known for Frankie and Johnny (1991).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0572325","name":"Goldie McLaughlin","idIMDB":"nm0572325"},"actorId":"nm0572325","character":"Waitress Helen","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0101912","urlIMDB":"http://www.imdb.com/title/tt0101912","business":{"budget":{"money":"$29,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"AUD","country":"2,332,742","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1991/\">1991</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 58 min (118 min)"],"soundMix":["Dolby"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Technicolor, USA"],"filmLength":["3,233 m (Sweden)"],"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.7","filmingLocations":[{"location":"Glendale, California, USA"}],"rated":"R","awards":[{"award":"Golden Globes, USA 1992","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Performance by an Actress in a Motion Picture - Comedy or Musical","names":[{"name":"Michelle Pfeiffer","id":"nm0000201","role":null}]}]}]},{"award":"BAFTA Awards 1992","titlesAwards":[{"titleAwardOutcome":"Won BAFTA Film Award","categories":[{"category":"Best Actress in a Supporting Role","names":[{"name":"Kate Nelligan","id":"nm0625075","role":null}]}]}]},{"award":"GLAAD Media Awards 1992","titlesAwards":[{"titleAwardOutcome":"Won GLAAD Media Award","categories":[{"category":"Outstanding Film","names":[]}]}]},{"award":"National Board of Review, USA 1991","titlesAwards":[{"titleAwardOutcome":"Won NBR Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Kate Nelligan","id":"nm0625075","role":null}]},{"category":"Top Ten Films","names":[]}]}]},{"award":"New York Film Critics Circle Awards 1991","titlesAwards":[{"titleAwardOutcome":"3rd place NYFCC Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Kate Nelligan","id":"nm0625075","role":null},{"name":"The Prince of Tides","id":"tt0102713","role":null}]}]}]}],"votes":"23,680","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["restaurant","waitress","ex convict","new york city","greek","middle aged man","lingerie","three word title","removing nylon stocking","female stockinged legs","legs","greek restaurant","greek dance","reference to moby dick","voyeur","vcr","urban setting","short order cook","reference to william shakespeare","reading","pursuit","manhattan new york city","low self esteem","loneliness","learning a new work every day","homosexual","gay","falling in love","ex husband ex wife relationship","release from prison","prostitute","promiscuity","greek dancing","funeral","domestic violence","crying","bowling","abused woman","lingerie slip","friend","woman on top","sexual attraction","sadness","female nudity","bed","bedroom","adultery","city","nudity","sex","cafe","friendship","based on play","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:18:09"}}