{"data":{"movies":[{"title":"Bad Boys","originalTitle":"","year":"1995","releaseDate":"19950407","directors":[{"name":"Michael Bay","id":"nm0000881"}],"writers":[{"name":"George Gallo","id":"nm0303032"},{"name":"Michael Barrie","id":"nm0057398"}],"runtime":"119 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NDk1NTU5NF5BMl5BanBnXkFtZTcwMjE2NDU2MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Comedy","Crime","Drama","Thriller"],"plot":"Marcus Burnett is a hen-pecked family man. Mike Lowry is a foot-loose and fancy free ladies' man. Both are Miami policemen, and both have 72 hours to reclaim a consignment of drugs stolen from under their station's nose. To complicate matters, in order to get the assistance of the sole witness to a murder, they have to pretend to be each other.","simplePlot":"Two hip detectives protect a murder witness while investigating a case of stolen heroin.","actors":[{"actorName":"Lisa Boyle","urlProfile":"http://www.imdb.com/name/nm0102288","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzc3MDk2MjY5M15BMl5BanBnXkFtZTgwNDcyNTEyMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1964","placeOfBirth":" Chicago, Illinois, USA","height":"5' 7\" (1.7 m)","bio":"Lisa Boyle was born on August 6, 1964 in Chicago, Illinois, USA. She is known for her work on Bad Boys (1995), Face/Off (1997) and Lost Highway (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzc3MDk2MjY5M15BMl5BanBnXkFtZTgwNDcyNTEyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0102288","name":"Lisa Boyle","idIMDB":"nm0102288"},"actorId":"nm0102288","character":"Girl Decoy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Will Smith","urlProfile":"http://www.imdb.com/name/nm0000226","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTczMzk1MjU1MV5BMl5BanBnXkFtZTcwNDk2MzAyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1968","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Willard Carroll Smith Jr.","height":"6' 2\" (1.88 m)","bio":"Willard Carroll \"Will\" Smith, Jr. (born September 25, 1968) is an American actor, comedian, producer, rapper, and songwriter. He has enjoyed success in television, film, and music. In April 2007, Newsweek called him \"the most powerful actor in Hollywood\". Smith has been nominated for five Golden Globe Awards, two Academy Awards, and has won four Grammy Awards. In the late 1980s, Smith achieved modest fame as a rapper under the name The Fresh Prince. In 1990, his popularity increased dramatically when he starred in the popular television series The Fresh Prince of Bel-Air. The show ran for six seasons (1990-96) on NBC and has been syndicated consistently on various networks since then. After the series ended, Smith moved from television to film, and ultimately starred in numerous blockbuster films. He is the only actor to have eight consecutive films gross over $100 million in the domestic box office, eleven consecutive films gross over $150 million internationally, and eight consecutive films in which he starred open at the number one spot in the domestic box office tally. Smith is ranked as the most bankable star worldwide by Forbes. As of 2014, 17 of the 21 films in which he has had leading roles have accumulated worldwide gross earnings of over $100 million each, five taking in over $500 million each in global box office receipts. As of 2014, his films have grossed $6.6 billion at the global box office. He has received Best Actor Oscar nominations for Ali and The Pursuit of Happyness. Smith was born in West Philadelphia, the son of Caroline (Bright), a Philadelphia school board administrator, and Willard Carroll Smith, Sr., a refrigeration engineer. He grew up in West Philadelphia's Wynnefield neighborhood, and was raised Baptist. He has three siblings, sister Pamela, who is four years older, and twins Harry and Ellen, who are three years younger. Smith attended Our Lady of Lourdes, a private Catholic elementary school in Philadelphia. His parents separated when he was 13, but did not actually divorce until around 2000. Smith attended Overbrook High School. Though widely reported, it is untrue that Smith turned down a scholarship to attend the Massachusetts Institute of Technology (MIT); he never applied to college because he \"wanted to rap.\" Smith says he was admitted to a \"pre-engineering [summer] program\" at MIT for high school students, but he did not attend. According to Smith, \"My mother, who worked for the School Board of Philadelphia, had a friend who was the admissions officer at MIT. I had pretty high SAT scores and they needed black kids, so I probably could have gotten in. But I had no intention of going to college.\" Smith started as the MC of the hip-hop duo DJ Jazzy Jeff & The Fresh Prince, with his childhood friend Jeffrey \"DJ Jazzy Jeff\" Townes as producer, as well as Ready Rock C (Clarence Holmes) as the human beat box. The trio was known for performing humorous, radio-friendly songs, most notably \"Parents Just Don't Understand\" and \"Summertime\". They gained critical acclaim and won the first Grammy awarded in the Rap category (1988). Smith spent money freely around 1988 and 1989 and underpaid his income taxes. The Internal Revenue Service eventually assessed a $2.8 million tax debt against Smith, took many of his possessions, and garnished his income. Smith was nearly bankrupt in 1990, when the NBC television network signed him to a contract and built a sitcom, The Fresh Prince of Bel-Air, around him. The show was successful and began his acting career. Smith set for himself the goal of becoming \"the biggest movie star in the world\", studying box office successes' common characteristics. Smith's first major roles were in the drama Six Degrees of Separation (1993) and the action film Bad Boys (1995) in which he starred opposite Martin Lawrence. In 1996, Smith starred as part of an ensemble cast in Roland Emmerich's Independence Day. The film was a massive blockbuster, becoming the second highest grossing film in history at the time and establishing Smith as a prime box office draw. He later struck gold again in the summer of 1997 alongside Tommy Lee Jones in the summer hit Men in Black playing Agent J. In 1998, Smith starred with Gene Hackman in Enemy of the State. He turned down the role of Neo in The Matrix in favor of Wild Wild West (1999). Despite the disappointment of Wild Wild West, Smith has said that he harbors no regrets about his decision, asserting that Keanu Reeves's performance as Neo was superior to what Smith himself would have achieved, although in interviews subsequent to the release of Wild Wild West he stated that he \"made a mistake on Wild Wild West. That could have been better.\" In 2005, Smith was entered into the Guinness Book of World Records for attending three premieres in a 24-hour time span. He has planned to star in a feature film remake of the television series It Takes a Thief. On December 10, 2007, Smith was honored at Grauman's Chinese Theatre on Hollywood Boulevard. Smith left an imprint of his hands and feet outside the world-renowned theater in front of many fans. Later that month, Smith starred in the film I Am Legend, released December 14, 2007. Despite marginally positive reviews, its opening was the largest ever for a film released in the United States during December. Smith himself has said that he considers the film to be \"aggressively unique\". A reviewer said that the film's commercial success \"cemented [Smith's] standing as the number one box office draw in Hollywood.\" On December 1, 2008, TV Guide reported that Smith was selected as one of America's top ten most fascinating people of 2008 for a Barbara Walters ABC special that aired on December 4, 2008. In 2008 Smith was reported to be developing a film entitled The Last Pharaoh, in which he would be starring as Taharqa. It was in 2008 that Smith starred in the superhero movie Hancock. Men in Black III opened on May 25, 2012 with Smith again reprising his role as Agent J. This was his first major starring role in four years. On August 19, 2011, it was announced that Smith had returned to the studio with producer La Mar Edwards to work on his fifth studio album. Edwards has worked with artists such as T.I., Chris Brown, and Game. Smith's most recent studio album, Lost and Found, was released in 2005. Smith and his son Jaden played father and son in two productions: the 2006 biographical drama The Pursuit of Happyness, and the science fiction film After Earth, which was released on May 31, 2013. Smith starred opposite Margot Robbie in the romance drama Focus. He played Nicky Spurgeon, a veteran con artist who takes a young, attractive woman under his wing. Focus was released on February 27, 2015. Smith was set to star in the Sci-Fic thriller Brilliance, an adaptation of Marcus Sakey's novel of the same name scripted by Jurassic Park writer David Koepp. But he left the project. Smith played Dr. Bennet Omalu of the Brain Injury Research Institute in the sports-drama Concussion, who became the first person to discover chronic traumatic encephalopathy (CTE) in a football player's brain. CTE is a degenerative disease caused by severe trauma to the head that can be discovered only after death. Smith's involvement is mostly due to his last-minute exit from the Sci-Fi thriller-drama Brilliance. Concussion was directed by Peter Landesman and-bead filmed in Pittsburgh, according to the Pittsburgh Tribune-Review. It received $14.4 million in film tax credits from Pennsylvania. Principal photography started on October 27, 2014. Actress Gugu Mbatha-Raw played his wife. Omalu served as a consultant. As of November 2015, Smith is set to star in the independent drama Collateral Beauty, which will be directed by David Frankel. Smith will play a New York advertising executive who succumbs to an deep depression after a personal tragedy. Nobel Peace Prize Concert December 11, 2009, in Oslo, Norway: Smith with wife Jada and children Jaden and Willow Smith married Sheree Zampino in 1992. They had one son, Trey Smith, born on November 11, 1992, and divorced in 1995. Trey appeared in his father's music video for the 1998 single \"Just the Two of Us\". He also acted in two episodes of the sitcom All of Us, and has appeared on The Oprah Winfrey Show and on the David Blaine: Real or Magic TV special. Smith married actress Jada Koren Pinkett in 1997. Together they have two children: Jaden Christopher Syre Smith (born 1998), his co-star in The Pursuit of Happyness and After Earth, and Willow Camille Reign Smith (born 2000), who appeared as his daughter in I Am Legend. Smith and his brother Harry own Treyball Development Inc., a Beverly Hills-based company named after Trey. Smith and his family reside in Los Angeles, California. Smith was consistently listed in Fortune Magazine's \"Richest 40\" list of the forty wealthiest Americans under the age of 40.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTczMzk1MjU1MV5BMl5BanBnXkFtZTcwNDk2MzAyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000226","name":"Will Smith","nicknames":["Fresh Prince","Mr. July"],"idIMDB":"nm0000226"},"actorId":"nm0000226","character":"Mike Lowrey","urlCharacter":"http://www.imdb.com/character/ch0005380","main":true},{"actorName":"Martin Lawrence","urlProfile":"http://www.imdb.com/name/nm0001454","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NzIzMDAxMF5BMl5BanBnXkFtZTcwMDIyMTI2MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 April 1965","placeOfBirth":" Frankfurt am Main, Hesse, Germany","birthName":"Martin Fitzgerald Lawrence","height":"5' 7½\" (1.71 m)","bio":"Martin Lawrence was born on April 16, 1965 in Frankfurt am Main, Hesse, Germany as Martin Fitzgerald Lawrence. He is an actor and writer, known for Bad Boys II (2003), Bad Boys (1995) and Big Momma's House (2000). He has been married to Shamicka Gibbs since July 10, 2010. They have two children. He was previously married to Pat Smith.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NzIzMDAxMF5BMl5BanBnXkFtZTcwMDIyMTI2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001454","name":"Martin Lawrence","idIMDB":"nm0001454"},"actorId":"nm0001454","character":"Marcus Burnett","urlCharacter":"http://www.imdb.com/character/ch0005383","main":true},{"actorName":"Michael Taliferro","urlProfile":"http://www.imdb.com/name/nm0848075","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMTE4MDcyMV5BMl5BanBnXkFtZTcwNzQ1ODkxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 August 1961","placeOfBirth":" USA","bio":"Michael Taliferro was born on August 23, 1961 in the USA. He was an actor and director, known for Bad Boys (1995), The Replacements (2000) and Armageddon (1998). He died on May 4, 2006 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMTE4MDcyMV5BMl5BanBnXkFtZTcwNzQ1ODkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0848075","name":"Michael Taliferro","nicknames":["Big Bear"],"idIMDB":"nm0848075"},"actorId":"nm0848075","character":"Carjacker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emmanuel Xuereb","urlProfile":"http://www.imdb.com/name/nm0944687","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjM3NzY3Nl5BMl5BanBnXkFtZTYwODQwNjgy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1965","placeOfBirth":"","bio":"Emmanuel Xuereb was born in 1965. He is an actor and producer, known for Bad Boys (1995), Natural Born Killers (1994) and Grim (1995). He was previously married to Stacey Dash.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjM3NzY3Nl5BMl5BanBnXkFtZTYwODQwNjgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0944687","name":"Emmanuel Xuereb","idIMDB":"nm0944687"},"actorId":"nm0944687","character":"Eddie Dominguez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tchéky Karyo","urlProfile":"http://www.imdb.com/name/nm0001409","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzMyNDQyN15BMl5BanBnXkFtZTYwMzgzODU3._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1953","placeOfBirth":" Istanbul, Turkey","birthName":"Baruh Djaki Karyo","height":"5' 10\" (1.78 m)","bio":"Born in Istanbul, Turkey, Tcheky Karyo grew up in Paris. He studied drama at the Cyrano Theatre and became a member of the Daniel Sorano Company, where he played numerous classical roles. He next joined the National Theatre of Strasbourg, where he starred in contemporary theatre as well as in such classical works as \"Tartuffe\", \"Macbeth\" and \"Othello.\" He is one of France's most popular actors. Nominated for a Cesar Award for his starring role in La balance (1982), Karyo received the prestigious Jean Gabin Prize in 1986 in recognition of his talent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzMyNDQyN15BMl5BanBnXkFtZTYwMzgzODU3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001409","name":"Tchéky Karyo","idIMDB":"nm0001409"},"actorId":"nm0001409","character":"Fouchet","urlCharacter":"http://www.imdb.com/character/ch0474036","main":true},{"actorName":"Marc Macaulay","urlProfile":"http://www.imdb.com/name/nm0531333","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2ODQwMjIzOF5BMl5BanBnXkFtZTcwNzg1ODk0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1957","placeOfBirth":" Millinocket, Maine, USA","bio":"Marc Macaulay was born on October 13, 1957 in Millinocket, Maine, USA. He is known for his work on Bad Boys (1995), 12 Years a Slave (2013) and Monster (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2ODQwMjIzOF5BMl5BanBnXkFtZTcwNzg1ODk0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0531333","name":"Marc Macaulay","idIMDB":"nm0531333"},"actorId":"nm0531333","character":"Noah Trafficante","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ralph Gonzalez","urlProfile":"http://www.imdb.com/name/nm0327774","urlPhoto":"","biography":{"bio":"Ralph Gonzalez is known for his work on Bad Boys II (2003), Bad Boys (1995) and Négociateur (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0327774","name":"Ralph Gonzalez","idIMDB":"nm0327774"},"actorId":"nm0327774","character":"Kuni","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vic Manni","urlProfile":"http://www.imdb.com/name/nm0543195","urlPhoto":"","biography":{"bio":"Vic Manni is known for his work on Bad Boys (1995), Gone in Sixty Seconds (2000) and Enemy of the State (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0543195","name":"Vic Manni","idIMDB":"nm0543195"},"actorId":"nm0543195","character":"Ferguson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank John Hughes","urlProfile":"http://www.imdb.com/name/nm0400606","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1ODYxMjgzM15BMl5BanBnXkFtZTcwMjA1NTc4Ng@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 November 1967","placeOfBirth":" The Bronx, New York City, New York, USA","height":"5' 8\" (1.73 m)","bio":"A native of the South Bronx, Frank John Hughes studied Jazz composition at the Berklee College of Music in Boston before moving back to New York to begin studying with legendary Russian method acting teacher Sonia Moore at her Studio of the Theatre. At the age of nineteen he became one of the youngest members ever to be given lifetime membership into New York's prestigious Actor's Studio. In 1988, after stage productions Off-Broadway, Hughes made his feature film debut in Robert Celestino's True Convictions. Hughes and Celestino would next collaborate in 1997 on the Sundance Film Festival hit Mr. Vincent. Since then Hughes has appeared in films such as Bad Boys opposite Will Smith, The Funeral, Layin' Low, Urban Jungle, Robbers, Deranged, for which he won best actor at the New York Independent Film Festival, Steven Spielberg's Catch Me If You Can opposite Tom Hanks and Leonardo DiCaprio, 'Yonkers Joe' and Righteous Kill opposite Robert De Niro and Al Pacino. A veteran of numerous television appearances, Mr. Hughes received wide international acclaim for his portrayal of Wild Bill Guarnere in the HBO miniseries Band of Brothers and in 2007 joined the cast of HBO's The Sopranos for the show's final season playing Walden Belfiore. In 2008, Hughes joined the cast of the hit series 24 as Director of Homeland Security Tim Woods and remained for the final two seasons until the series ended. In 2010, Hughes wrote, produced and starred in the film 'Leave' opposite Rick Gomez, Bryan Cranston and Ron Livingston. It was directed once again, by his long time collaborator Robert Celestino. 'Leave', which won both 'best feature' and the 'audience award' at the Gasparilla International Film Festival, will be released in 2012. In 2011, Hughes wrote and produced 'The Grief Tourist' staring Michael Cudlitz, Melanie Griffith and Pruitt Taylor Vince. It is set for release in late 2012. Hughes is co-founder of Reckoner Films along with Rick Gomez.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1ODYxMjgzM15BMl5BanBnXkFtZTcwMjA1NTc4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0400606","name":"Frank John Hughes","idIMDB":"nm0400606"},"actorId":"nm0400606","character":"Casper","urlCharacter":"http://www.imdb.com/character/ch0005387","main":true},{"actorName":"Mike Kirton","urlProfile":"http://www.imdb.com/name/nm0457048","urlPhoto":"","biography":{"bio":"Mike Kirton is known for his work on The Patriot (2000), Ace Ventura: Pet Detective (1994) and Le transporteur II (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0457048","name":"Mike Kirton","idIMDB":"nm0457048"},"actorId":"nm0457048","character":"Andy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Will Knickerbocker","urlProfile":"http://www.imdb.com/name/nm0460754","urlPhoto":"","biography":{"bio":"Will Knickerbocker is an actor, known for Bad Boys (1995), Ace Ventura: Pet Detective (1994) and Cape Fear (1991).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0460754","name":"Will Knickerbocker","idIMDB":"nm0460754"},"actorId":"nm0460754","character":"Officer Bill O'Fee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Theresa Randle","urlProfile":"http://www.imdb.com/name/nm0005337","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NTgyMjA1N15BMl5BanBnXkFtZTYwMTg5ODI3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 December 1964","placeOfBirth":" South Central, Los Angeles, California, USA","birthName":"Theresa Ellen Randle","height":"5' 5\" (1.65 m)","bio":"Born in Los Angeles in 1964, Theresa Randle began her performing career by studying dance (traditional, modern, jazz) and comedy. She entered Beverly Hills High School, with a special program for the exceptionally gifted. At the end of college she earned her first role at the Los Angeles Inner City Cultural Center and was seen in commercials. Theresa was also involved in acting on the stage, with roles in such productions as \"In Command of the Children\", \"Sonata\", \"6 Parts of Musical Broadway\" and \"Fight the Good Fight\". In 1987 she got her first big-screen break with Maid to Order (1987). For the next three years she appeared (in small roles) in such movies as Easy Wheels (1989) and Heart Condition (1990), with Denzel Washington). She continued in small roles by great directors such as Abel Ferrara (The King of New York (1990)) and Spike Lee (Jungle Fever (1991) and Malcolm X (1992)). In 1995 she starred in Beverly Hills Cop III (1994) and Bad Boys (1995) (with Will Smith). In 1996 she earned her first starring role in Spike Lee's Girl 6 (1996), playing a young, out-of-work actress who gets caught up in the seductive, yet dark, world of phone sex. She has also appeared in Space Jam (1996), with Michael Jordan (and a bevy of classic Warner Bros. cartoon characters) and recently in the film adaptation of the comic strip Spawn (1997), with Martin Sheen).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NTgyMjA1N15BMl5BanBnXkFtZTYwMTg5ODI3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005337","name":"Theresa Randle","idIMDB":"nm0005337"},"actorId":"nm0005337","character":"Theresa Burnett","urlCharacter":"http://www.imdb.com/character/ch0005388","main":true},{"actorName":"Tiffany Samuels","urlProfile":"http://www.imdb.com/name/nm0760528","urlPhoto":"","biography":{"bio":"Tiffany Samuels is an actress, known for Bad Boys (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0760528","name":"Tiffany Samuels","idIMDB":"nm0760528"},"actorId":"nm0760528","character":"Megan Burnett","urlCharacter":"http://www.imdb.com/character/ch0005393","main":true},{"actorName":"Cory Hodges","urlProfile":"http://www.imdb.com/name/nm0388144","urlPhoto":"","biography":{"bio":"Cory Hodges is an actor, known for Antwone Fisher (2002), Bad Boys (1995) and Max Keeble's Big Move (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0388144","name":"Cory Hodges","idIMDB":"nm0388144"},"actorId":"nm0388144","character":"James Burnett","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0112442","urlIMDB":"http://www.imdb.com/title/tt0112442","business":{"budget":{"money":"$19,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$15,523,358","country":"USA","day":"09","month":"04","year":"1995","remarks":""},{"money":"ATS 2,153,004","country":"Austria","day":"08","month":"06","year":"1995","remarks":"44 Screens"}],"gross":[{"money":"$65,637,842","country":"USA","day":"10","month":"09","year":"1995","remarks":""},{"money":"$65,611,947","country":"USA","day":"04","month":"09","year":"1995","remarks":""},{"money":"$65,558,811","country":"USA","day":"27","month":"08","year":"1995","remarks":""},{"money":"$65,477,680","country":"USA","day":"20","month":"08","year":"1995","remarks":""},{"money":"$65,328,321","country":"USA","day":"13","month":"08","year":"1995","remarks":""},{"money":"$65,131,559","country":"USA","day":"06","month":"08","year":"1995","remarks":""},{"money":"$64,876,653","country":"USA","day":"30","month":"07","year":"1995","remarks":""},{"money":"$64,507,202","country":"USA","day":"23","month":"07","year":"1995","remarks":""},{"money":"$61,052,992","country":"USA","day":"11","month":"06","year":"1995","remarks":""},{"money":"$60,802,534","country":"USA","day":"04","month":"06","year":"1995","remarks":""},{"money":"$60,454,746","country":"USA","day":"29","month":"05","year":"1995","remarks":""},{"money":"$59,277,272","country":"USA","day":"21","month":"05","year":"1995","remarks":""},{"money":"$57,284,613","country":"USA","day":"14","month":"05","year":"1995","remarks":""},{"money":"$54,358,156","country":"USA","day":"07","month":"05","year":"1995","remarks":""},{"money":"$50,216,792","country":"USA","day":"30","month":"04","year":"1995","remarks":""},{"money":"$44,090,795","country":"USA","day":"23","month":"04","year":"1995","remarks":""},{"money":"$32,503,442","country":"USA","day":"16","month":"04","year":"1995","remarks":""},{"money":"$15,523,358","country":"USA","day":"09","month":"04","year":"1995","remarks":""},{"money":"£4,734,434","country":"UK","day":"13","month":"08","year":"1995","remarks":""},{"money":"£3,923,490","country":"UK","day":"16","month":"07","year":"1995","remarks":""},{"money":"£843,940","country":"UK","day":"18","month":"06","year":"1995","remarks":""},{"money":"ATS 2,153,004","country":"Austria","day":"08","month":"06","year":"1995","remarks":""}],"weekendGross":[{"money":"$67,624","country":"USA","day":"20","month":"10","year":"1995","remarks":"88 Screens"},{"money":"$20,225","country":"USA","day":"10","month":"09","year":"1995","remarks":"25 Screens"},{"money":"$31,026","country":"USA","day":"04","month":"09","year":"1995","remarks":"34 Screens"},{"money":"$212,883","country":"USA","day":"30","month":"08","year":"1995","remarks":"255 Screens"},{"money":"$31,556","country":"USA","day":"27","month":"08","year":"1995","remarks":"40 Screens"},{"money":"$118,257","country":"USA","day":"13","month":"08","year":"1995","remarks":"144 Screens"},{"money":"$141,343","country":"USA","day":"06","month":"08","year":"1995","remarks":"180 Screens"},{"money":"$316,568","country":"USA","day":"23","month":"07","year":"1995","remarks":"328 Screens"},{"money":"$166,861","country":"USA","day":"11","month":"06","year":"1995","remarks":"278 Screens"},{"money":"$261,261","country":"USA","day":"04","month":"06","year":"1995","remarks":"384 Screens"},{"money":"$802,175","country":"USA","day":"29","month":"05","year":"1995","remarks":"615 Screens"},{"money":"$1,261,311","country":"USA","day":"21","month":"05","year":"1995","remarks":""},{"money":"$2,004,539","country":"USA","day":"14","month":"05","year":"1995","remarks":""},{"money":"$2,914,912","country":"USA","day":"07","month":"05","year":"1995","remarks":""},{"money":"$4,314,088","country":"USA","day":"30","month":"04","year":"1995","remarks":""},{"money":"$7,012,808","country":"USA","day":"23","month":"04","year":"1995","remarks":""},{"money":"$11,016,040","country":"USA","day":"16","month":"04","year":"1995","remarks":""},{"money":"$15,523,358","country":"USA","day":"09","month":"04","year":"1995","remarks":""},{"money":"ATS 2,153,004","country":"Austria","day":"13","month":"08","year":"1995","remarks":"144 Screens"}],"admissions":[{"money":"1,485,166","country":"France","day":"03","month":"10","year":"1995","remarks":""}],"productionDates":{"money":null,"country":null,"day":"31","month":"08","year":"1994","remarks":null},"filmingDates":[{"money":null,"country":null,"day":"28","month":"10","year":"1994","remarks":null},{"money":null,"country":null,"day":"16","month":"02","year":"1995","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 59 min (119 min)"],"soundMix":["Dolby SR","SDDS"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Panaflex Gold II, Panavision Primo Lenses","Panavision Panaflex Platinum, Panavision Primo Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":["3,256 m (Sweden)","3,426 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.8","metascore":"41","filmingLocations":[{"location":"Anastasia Avenue, Coral Gables, Florida, USA"}],"rated":"R","awards":[{"award":"BMI Film & TV Awards 1995","titlesAwards":[{"titleAwardOutcome":"Won BMI Film Music Award","categories":[{"category":"","names":[{"name":"Mark Mancina","id":"nm0006183","role":null}]}]}]},{"award":"Grammy Awards 1996","titlesAwards":[{"titleAwardOutcome":"Nominated Grammy","categories":[{"category":"Best Song Written Specifically for a Motion Picture or for Television","names":[{"name":"Kenneth 'Babyface' Edmonds","id":"nm0004892","role":null}]}]}]},{"award":"MTV Movie Awards 1996","titlesAwards":[{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Best On-Screen Duo","names":[{"name":"Will Smith","id":"nm0000226","role":null},{"name":"Martin Lawrence","id":"nm0001454","role":null}]},{"category":"Best Action Sequence","names":[]}]}]}],"votes":"180,989","type":"Movie","companyCreditsSimple":[{"idCompany":"co0102770","name":"Don Simpson/Jerry Bruckheimer Films"}],"keywords":{"keywords":["drugs","murder","heroin","police","witness","internal affairs","detective","friend","best friend","bust","money","partner","loose cannon","corrupt cop","computer cracker","mansion","basketball","corpse","prostitute","swimming pool","police detective","machismo","blockbuster","womanizer","mafia","drug lord","police brutality","anti hero","police captain","police station","suicide by cop","buddy comedy","directorial debut","gangster","cult film","first part","machine gun","pistol","swat team","street shootout","police shootout","profanity","strong language","strip club","robbery","police chase","handcuffs","kiss","1990s","mexican standoff","bloodshed","gore","blood splatter","bullet time","bullet ballet","slow motion scene","gun duel","brothel","fighting","fight","gun fu","brutality","shoulder holster","black hero","foot chase","blood","store","held at gunpoint","f word","hotel fight","quick draw","hk 5 machine gun","buddy","character repeating someone else's dialogue","nightclub","black bra and panties","stripper","home invasion","ambush","sidekick","wisecrack humor","dual wield","glock","showdown","gun battle","gun in purse","brawl","fistfight","opening action scene","shootout","gunfight","fight in the restroom","baseball bat","pump action shotgun","shotgun","two man army","action hero","hero","maverick cop","tough cop","tough guy","black panties","exploding car","children","shooting a woman","upskirt","throat cut","standing on the roof of a car","shot repeatedly","panties","brothel madam","fire","dead woman on floor","captain","attempted murder","airport","reference to skittles","telephone","husband wife relationship","boyfriend girlfriend relationship","porsche","money falling through the air","shot in the chest","body count","knife in hand","car accident","stabbed in the hand","death","cell phone","car","shot to death","shot in the leg","desert eagle","train","miami florida","witness protection","police corruption","hangar","hacker","car crash","car chase","african american","black cop","wheelchair","razor blade","night vision goggles","miranda warning","forklift","elevator","aquarium","badge","mistaken identity","identity swap","helicopter","ether","automobile","spiral staircase","marriage","homosexual","luxury","florida","carpet","title based on song","dog","gun","buddy cop","apartment","chase","violence","prostitution","wine","explosion","heist","title spoken by character","surprise ending","dark comedy"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 16:17:57"}}