{"data":{"movies":[{"title":"Idle Hands","originalTitle":"","year":"1999","releaseDate":"19990430","directors":[{"name":"Rodman Flender","id":"nm0281869"}],"writers":[{"name":"Terri Hughes","id":"nm0400957"},{"name":"Ron Milbauer","id":"nm0586922"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWE4YzE1NzItNjc3OC00ODgzLTgxMDItYzY4NmI2YjZiYmQwXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Fantasy","Horror","Thriller"],"plot":"Seventeen year old slacker Anton Tobias wakes up one Halloween morning to discover that both of his parents have been turned into two headless Halloween decorations. After speaking to his equally irresponsible friends, Mick and Pnub, he discovers that his right hand has a blood-thirsty mind of its own and is hell-bent on wreaking havoc whether he likes it or not.","simplePlot":"A teenage slacker's right hand becomes possessed with murderous intent.","actors":[{"actorName":"Devon Sawa","urlProfile":"http://www.imdb.com/name/nm0001701","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMDkyNDE3Nl5BMl5BanBnXkFtZTgwNTMxNTQwODE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1978","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"Devon Edward Sawa","height":"6' (1.83 m)","bio":"Devon started his career as young actor in Vancouver, Canada. First in the theater, and then moving onto smaller roles on TV. His breakout role was the title character in the Universal motion picture, Casper. He went on to star in many more films during his teens such as Now and Then, Little Giants and Wild America. In his early twenties, Devon sought out edgier projects. Movies like Idle Hands, SLC Punk, Final Destination, Slackers and playing 'Stan' in the acclaimed video for Eminem's hit song of the same name, directed by Dr. Dre. Recently Devon spent 4 years on the CW hit show NIKITA. He will be seen next in Punks Dead: SLC Punk 2 and Life On The Line, opposite John Travolta, Kate Bosworth and Sharon Stone.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMDkyNDE3Nl5BMl5BanBnXkFtZTgwNTMxNTQwODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001701","name":"Devon Sawa","idIMDB":"nm0001701"},"actorId":"nm0001701","character":"Anton Tobias","urlCharacter":"http://www.imdb.com/character/ch0016240","main":true},{"actorName":"Seth Green","urlProfile":"http://www.imdb.com/name/nm0001293","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MzI2ODkwN15BMl5BanBnXkFtZTcwMDYyNzMyOQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1974","placeOfBirth":" Overbrook Park, Philadelphia, Pennsylvania, USA","birthName":"Seth Benjamin Green","height":"5' 4\" (1.63 m)","bio":"Seth Green has starred in numerous films and television series including the Austin Powers trilogy, The Italian Job, Party Monster, Without a Paddle, Can't Hardly Wait, Old Dogs and dozens more, including starring roles in 2013's Sexy Evil Genius, The Story of Luke and 2014's Yellowbird. He's portraying Christopher Guest in Netflix's upcoming National Lampoon origin film, A Stupid and Futile Gesture. Green is the co-creator/executive producer/primary voice talent and a writer/director on Robot Chicken, 2010 & 2016 Emmy® Award-winner for Outstanding Short Format Animation Program. Green has voiced Chris Griffin on Family Guy since the series' inception and Leonardo on Nickelodeon's Teenage Mutant Ninja Turtles. Green has been singled out for many Emmy voiceover nominations for Adult Swim's Robot Chicken. The show, the network's highest-rated original program, and their specials have won numerous Annie Awards for writing and producing, including one for Green for directing. In 2012, Green and his partners created Stoopid Buddy Stoodios, a full-service animation studio with many other projects including: Crackle's SuperMansion, Adult Swim's Hot Streets and OMG! Earth and WWE's Camp WWE. Green has always been fascinated by space travel and has done a PSA for NASA, moderated NASA's first San Diego Comic-Con panel and designed the CASIS patch for the 2015 ISS U.S. National Laboratory missions for research to benefit life on Earth.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MzI2ODkwN15BMl5BanBnXkFtZTcwMDYyNzMyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001293","name":"Seth Green","idIMDB":"nm0001293"},"actorId":"nm0001293","character":"Mick","urlCharacter":"http://www.imdb.com/character/ch0016239","main":true},{"actorName":"Elden Henson","urlProfile":"http://www.imdb.com/name/nm0711805","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNzczMjE2Ml5BMl5BanBnXkFtZTcwNzg3MzUzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 August 1977","placeOfBirth":" Rockville, Maryland, USA","birthName":"Elden Ryan Ratliff","height":"5' 9\" (1.75 m)","bio":"Elden Henson (formerly billed as Elden Ratliff and Elden Ryan Ratliff) got his start in the business at age two, as a baby model. By the time he was six, he was appearing in numerous commercials; by age ten, he was on his way to becoming a successful child actor. By the time he started high school, John Burroughs High School in Burbank, California, he got his big break, starring in the three The Mighty Ducks (1992) movies as enforcer Fulton Reed. From there, he went on to get rave reviews as Max Kane, the seemingly slow-witted giant in Miramax's The Mighty (1998). Elden has since starred in Idle Hands (1999), She's All That (1999), and Showtime's A Gift of Love: The Daniel Huffman Story (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNzczMjE2Ml5BMl5BanBnXkFtZTcwNzg3MzUzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0711805","name":"Elden Henson","idIMDB":"nm0711805"},"actorId":"nm0711805","character":"Pnub","urlCharacter":"http://www.imdb.com/character/ch0016242","main":true},{"actorName":"Jessica Alba","urlProfile":"http://www.imdb.com/name/nm0004695","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYxNzE4OTk5Nl5BMl5BanBnXkFtZTcwODYyMDYzMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1981","placeOfBirth":" Pomona, California, USA","birthName":"Jessica Marie Alba","height":"5' 6½\" (1.69 m)","bio":"Jessica Marie Alba was born on April 28, 1981, in Pomona, CA, to Catherine (Jensen) and Mark David Alba, who served in the US Air Force. Her mother has Danish, Welsh, German, English, and French ancestry, while her father is of Mexican descent (including Spanish, Indigenous Mexican, and distant Sephardic Jewish, roots). Her family moved to Biloxi, MS, when she was an infant. Three years later her father's career brought the family back to California, then to Del Rio, TX, before finally settling in Southern California when Jessica was nine. In love with the idea of becoming an actress from the age of five, she was 12 before she took her first acting class. Nine months later she was signed by an agent. She studied at the Atlantic Theatre Company with founders William H. Macy and David Mamet. A gifted young actress, Jessica has played a variety of roles ranging from light comedy to gritty drama since beginning her career. She made her feature film debut in 1993 in Hollywood Pictures' comedy Camp Nowhere (1994). Originally hired for two weeks, she got her break when an actress in a principal role suddenly dropped out. Jessica cheerfully admits it wasn't her prodigious talent or charm that inspired the director to tap her to take over the part--it was her hair, which matched the original performer's. The two-week job stretched to two months, and Jessica ended the film with an impressive first credit. Two national TV commercials for Nintendo and J.C. Penney quickly followed before Jessica was featured in several independent films. She branched out into TV in 1994 with a recurring role in Nickelodeon's popular comedy series The Secret World of Alex Mack (1994). She played an insufferable young snob, devoted to making life miserable for the the title character, played by Larisa Oleynik. That same year, she won the role of \"Maya\" in Flipper (1995) and filmed the pilot for the series. She spent 1995 shooting the first season's episodes in Australia. An avid swimmer and PADI-certified SCUBA diver, Jessica was delighted to be doing a show that allowed her to play with dolphins. The show's success guaranteed it a second season, which she also starred in. Her involvement in the show lasted from 1995 to 1997. In 1996 she appeared in Venus Rising (1995) as \"Young Eve\". The next year she appeared on The Dini Petty Show (1989), a Canadian talk show, and spoke about her role in \"Flipper\" and her general acting career. She began working on P.U.N.K.S. (1999), featuring Randy Quaid, in 1998. In early 1998 she appeared in Brooklyn South (1997) as \"Melissa\". That same year she was in two episodes of Beverly Hills, 90210 (1990) as \"Leanne\" and in two episodes of Love Boat: The Next Wave (1998). She appeared in \"Teen Magazine\" in 1995 and various European magazines over the following years. More importantly, she was featured in the February 1999 issue of \"Vanity Fair\" magazine. She also had major roles in two movies that year: Never Been Kissed (1999) and Idle Hands (1999). In 2000 she had roles in Paranoid (2000) and starred in the sci-fi TV series Dark Angel (2000), gaining worldwide recognition. Her first starring role in a major studio film was the Honey (2003), Universal Pictures' contemporary urban drama that grossed over $60 million worldwide. She has since made over 25 feature films that have earned a combined box-office total of over $800 million, including comedies and dramas, from gritty independents to major studio blockbusters. In 2005 she starred opposite Bruce Willis and an all-star cast in the provocative and critically acclaimed Sin City (2005), directed by Robert Rodriguez and Frank Miller. She next starred as Sue Storm--\"The Invisible Girl\"--in Marvel's action-franchise blockbuster Fantastic Four (2005), which was released by 20th Century-Fox in July 2005 and became a worldwide box-office success with over $300 million in revenue. Jessica was part of Garry Marshall's all-star ensemble romantic comedy, Valentine's Day (2010), which broke box-office records with the largest opening on a four-day President's Day weekend in history. She starred opposite Casey Affleck and Kate Hudson in director Michael Winterbottom's controversial screen adaptation of The Killer Inside Me (2010), based on Jim Thompson's novel, as well as Robert Rodriquez's Machete (2010). She co-starred in the third installment of the hit \"Meet the Parents\" franchise Little Fockers (2010), as well as the 4D family adventure Spy Kids: All the Time in the World in 4D (2011), marking her third of five collaborations with Robert Rodriguez. Jessica was part of an all-star voice cast for The Weinstein Company's animated adventure, Escape from Planet Earth (2013), also featuring Sarah Jessica Parker, Brendan Fraser and James Gandolfini. She appeared in the comedy A.C.O.D. (2013), which premiered at the Sundance Film Festival and starred Adam Scott, Jane Lynch and Amy Poehler. She made a cameo appearance in Machete Kills (2013) and co-starred in Robert Rodriquez's highly-anticipated, star-studded sequel Sin City: A Dame to Kill For (2014). That year she had a full slate of acting projects, including the period drama Dear Eleanor (2016)\"; The Englishman opposite Pierce Brosnan and Salma Hayek; the IFC parody mini-series The Spoils of Babylon (2014), produced by Funny or Die, with a stellar cast including Will Ferrell, Kristen Wiig, Tobey Maguire, Michael Sheen and Tim Robbins; and Stretch (2014), co-starring Patrick Wilson, Chris Pine, Ray Liotta, Ed Helms and Brooklyn Decker. Jessica has received Golden Globe and People's Choice Award nominations, was voted TV Guide readers' Breakout Star of the Year, and won Favorite TV Actress at the 2001 Teen Choice Awards for \"Dark Angel.\" She won the Nickelodeon Kids' Choice Award for Favorite Female Actress for her performance in \"Fantastic Four\" and an MTV Movie Award for Sexiest Performance in \"Sin City.\" She received another Teen Choice Award for Choice Movie Actress in a Horror/Thriller for The Eye (2008) and was honored by the Young Hollywood Awards as Superstar of Tomorrow in 2005. She has received ALMA Awards for her performances in \"Dark Angel\" and \"Machete,\" as well as a Fashion Icon in 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYxNzE4OTk5Nl5BMl5BanBnXkFtZTcwODYyMDYzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004695","name":"Jessica Alba","nicknames":["Sky Angel","Albz"],"idIMDB":"nm0004695"},"actorId":"nm0004695","character":"Molly","urlCharacter":"http://www.imdb.com/character/ch0016238","main":true},{"actorName":"Vivica A. Fox","urlProfile":"http://www.imdb.com/name/nm0000407","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxNDM2NDU1MF5BMl5BanBnXkFtZTgwMTc5MTQ2NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1964","placeOfBirth":" South Bend, Indiana, USA","birthName":"Vivica Anjanetta Fox","height":"5' 7\" (1.7 m)","bio":"Vivica A. Fox was born in South Bend, Indiana, on July 30, 1964, and is the daughter of Everlyena, a pharmaceutical technician, and William Fox, a private school administrator. She is of Native American and African-American descent and is proud of her heritage. She is a graduate of Arlington High School in Indianapolis, Indiana, and, after graduating, moved to California to attend college. Vivica went to Golden West College and graduated with an Associate Art degree in Social Sciences. While in California, she started acting professionally, first on soap operas, such as Generations (1989), Days of Our Lives (1965) and The Young and the Restless (1973). In another early role, she played Patti LaBelle's fashion designer daughter, \"Charisse Chamberlain\", on the NBC-TV series, Out All Night (1992). Her first big break was in the film, Independence Day (1996), along with Will Smith, and also Set It Off (1996). She has earned critical acclaim for her portrayal of \"Maxine\" in the 1997 motion picture, Soul Food (1997), which netted her MTV Movie Award and NAACP Image Award nominations. In 2000, she was casted in the medical drama, City of Angels (2000), as \"Dr. Lillian Price\". She has had roles in many other movies ever since, such as: Teaching Mrs. Tingle (1999), Two Can Play That Game (2001) and Kill Bill: Vol. 1 (2003). In 2004, Fox was in an episode of Punk'd (2003), where her pregnant friend pretended to go into labor, but they became angry when a paramedic appeared to care more about taking pictures than delivering the baby. Vivica also took another television role, from 2004 to 2006, as she starred in the drama series, 1-800-Missing (2003), on the Lifetime Television Network. In 2007, she was a contender on Dancing with the Stars (2005) and stayed until she was voted off in the fourth week. In 1998, Vivica A. Fox married singer Christopher Harvest (aka Sixx-Nine), whom she later divorced in June 2002. She also dated rapper 50 Cent, however this was a brief relationship.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxNDM2NDU1MF5BMl5BanBnXkFtZTgwMTc5MTQ2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000407","name":"Vivica A. Fox","nicknames":["Angie"],"idIMDB":"nm0000407"},"actorId":"nm0000407","character":"Debi LeCure","urlCharacter":"http://www.imdb.com/character/ch0016241","main":true},{"actorName":"Christopher Hart","urlProfile":"http://www.imdb.com/name/nm0366205","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxOTk3MTI0M15BMl5BanBnXkFtZTcwMzc2NjAxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1961","placeOfBirth":" Nanaimo, British Columbia, Canada","bio":"Christopher Hart was born on February 22, 1961 in Nanaimo, British Columbia, Canada. He is an actor, known for The Addams Family (1991), Addams Family Values (1993) and Idle Hands (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxOTk3MTI0M15BMl5BanBnXkFtZTcwMzc2NjAxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0366205","name":"Christopher Hart","idIMDB":"nm0366205"},"actorId":"nm0366205","character":"The Hand","urlCharacter":"http://www.imdb.com/character/ch0245155","main":true},{"actorName":"Jack Noseworthy","urlProfile":"http://www.imdb.com/name/nm0005276","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmFiZDA5ZGYtZjU2YS00NWJkLTkzNTktYjQ0MWEwZjAxMTBlXkEyXkFqcGdeQXVyMzY3NTE1Njk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 December 1969","placeOfBirth":" Lynn, Massachusetts, USA","birthName":"John E. Noseworthy Jr.","height":"5' 8\" (1.73 m)","bio":"Born and raised in Massachusetts, Jack received his BFA from The Boston Conservatory. He began his career on stage in the national tour of the musical CATS. He made his Broadway debut in the original company of JEROME ROBBINS BROADWAY, played Mark in A CHORUS LINE, and opposite John Lithgow in SWEET SMELL OF SUCCESS. In addition to his New York stage work, he received the Los Angeles Drama Critics prize and a Drama-Logue Award as Best Actor for his starring role as Alan Strang in the Los Angeles production of EQUUS. He stared as Pip in the Utah Shake's production of GREAT EXPECTATIONS as well as Mr. Charles Bingley, in PRIDE & PREJUDICE. In January of 2017 he guest stared on \"Shades Of Blue\" opposite Ray Liotta, and is currently shooting the independent feature \"Band Night\". Jack played Alan deShields in the Lifetime miniseries \"Marilyn\". He played Bobby Kennedy in NatGeo's highest rated film, \"Killing Kennedy\" opposite Rob Lowe and Ginnifer Goodwin. He has completed the features\"10,000 Miles\", \"Julia\" \"Needlestick\" and \"Tio Papi\". He played \"Mordred\" in CAMELOT opposite Nathan Gunn at The Glimmerglass Festival, and recently shot the web pilot, IN PLAIN VIEW. He received rave reviews as Elliot in \"Two Point Oh\" Jeff Jackson's new play off Broadway at 59E59th St. in NYC, as well as narrating the Christopher Wheeldon Ballet, \"Carnival Of The Animals\" for NYCB. In the motion picture arena, he has worked with Jonathan Mostow five times, most recently in the Bruce Willis action thriller \"The Surrogates\", as well as, \"Breakdown,\" \"U-571,\" the FOX Network's pilot \"Them\" and his cameo in \"Terminator 3: Rise of the Machines\". Jack's other feature film credits include the independent favorites, \"Pretty Ugly People\" and \"Phat Girlz,\" as well as, \"Undercover Brother,\" \"Poster Boy,\" \"Unconditional Love,\" \"Event Horizon,\" \"The Brady Bunch Movie,\" \"Barb Wire,\" \"Trigger Effect,\" \"Cecil B. DeMented,\" \"Alive\" and \"Encino Man,\" his movie debut. On television: the Hallmark-Hall-Of-Fame western \"Aces 'N Eights\" \"ELVIS\" opposite Jonathan Rhys Meyers, played Sissy Spacek's son in \"A Place For Annie,\" and Anne Bancroft's obsession in \"Mrs. Cage.\" Other television credits include: \"Shades Of Blue\" \"CSI,\" \"The District,\" \"Law & Order,\" \"Law & Order: SVU,\" \"Crossing Jordan\" and \"Judging Amy\" (four episodes). He also has the distinction of being the series lead on MTV's first scripted series, \"Dead At 21.\" In March of 2016, Jack produced \"Arrabal\" at the Bi-Annual Ibero American Theatre Festival in Bogota, Colombia. \"Arrabal\" begins rehearsals in Cambridge, Ma at American Repertory Theatre on April 3rd, 2017. It opens on May 12th and runs thru June 18th. He previously optioned and produced \"Peter & I\" by Matte O'Brien and Matt Vinson. Jack created, directed and produced three benefits under the Voices For Change banner at Ars Nova, for John Kerry's presidential campaign.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmFiZDA5ZGYtZjU2YS00NWJkLTkzNTktYjQ0MWEwZjAxMTBlXkEyXkFqcGdeQXVyMzY3NTE1Njk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005276","name":"Jack Noseworthy","idIMDB":"nm0005276"},"actorId":"nm0005276","character":"Randy","urlCharacter":"http://www.imdb.com/character/ch0016243","main":true},{"actorName":"Katie Wright","urlProfile":"http://www.imdb.com/name/nm0942558","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMTQzNjgyNl5BMl5BanBnXkFtZTYwMDM5ODU1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1981","placeOfBirth":" Kansas City, Missouri, USA","birthName":"Katherine Wright","height":"5' 7\" (1.7 m)","bio":"Katie Wright was born on December 25, 1981 in Kansas City, Missouri, USA as Katherine Wright. She is an actress and writer, known for Idle Hands (1999), Detention: The Siege at Johnson High (1997) and A Secret Between Friends: A Moment of Truth Movie (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMTQzNjgyNl5BMl5BanBnXkFtZTYwMDM5ODU1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0942558","name":"Katie Wright","idIMDB":"nm0942558"},"actorId":"nm0942558","character":"Tanya","urlCharacter":"http://www.imdb.com/character/ch0245156","main":true},{"actorName":"Sean Whalen","urlProfile":"http://www.imdb.com/name/nm0923490","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MjIzMjY5NF5BMl5BanBnXkFtZTgwOTk0NjczMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 May 1964","placeOfBirth":" Washington, District of Columbia, USA","height":"5' 8\" (1.73 m)","bio":"Sean was born in Washington D.C. The youngest of four, he was raised in Silver Spring/Olney Maryland and graduated from Sherwood High School. He moved west and graduated from UCLA four years later. Like most actors, he worked as a waiter while studying and performing at the famed Groundling Theater and Playhouse West. His break came doing commercials and his first film, The People Under the Stairs (1991). Sean has worked in every genre of film and television. (Except a Western. He really wants to do a Western) He is also an acting coach, writer, producer, looper, acting teacher and heads the comedy department at Studio 4: James Franco's Film & Acting School in North Hollywood. He is a father of two beautiful daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MjIzMjY5NF5BMl5BanBnXkFtZTgwOTk0NjczMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0923490","name":"Sean Whalen","idIMDB":"nm0923490"},"actorId":"nm0923490","character":"McMacy","urlCharacter":"http://www.imdb.com/character/ch0245157","main":true},{"actorName":"Nicholas Sadler","urlProfile":"http://www.imdb.com/name/nm0755556","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU4NDU3NjQ0N15BMl5BanBnXkFtZTcwMTEwNDg4Nw@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"bio":"Nicholas Sadler is an actor and director, known for Scent of a Woman (1992), True Grit (2010) and Twister (1996). He has been married to GiGi New since 2003.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU4NDU3NjQ0N15BMl5BanBnXkFtZTcwMTEwNDg4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0755556","name":"Nicholas Sadler","idIMDB":"nm0755556"},"actorId":"nm0755556","character":"Ruck","urlCharacter":"http://www.imdb.com/character/ch0245158","main":true},{"actorName":"Fred Willard","urlProfile":"http://www.imdb.com/name/nm0929609","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMTQzMTc2MF5BMl5BanBnXkFtZTgwNjY5MjgyMTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1939","placeOfBirth":" Shaker Heights, Ohio, USA","height":"6' 2\" (1.88 m)","bio":"Fred Willard radiates a unique charm that has established him as one of the industry's most gifted comic actors, first coming to prominence as ambitious but dimwitted sidekick Jerry Hubbard to Martin Mull's smarmy talk-show host Barth Gimble in the devastating satirical series Fernwood Tonight (1977). A master of sketch comedy, he is most heralded for his quick wit and improvisational expertise. His 50 appearances in sketches on The Tonight Show with Jay Leno (1992) are indicative of his ability to transform any character into a unique comic portrayal. Fred recently completed a sold-out run of his one-man show, \"Fred Willard: Alone At Last!\" (with a cast of 12) and received two Los Angeles Artistic Director Awards, for Best Comedy and Best Production. He is an alumnus of The Second City and currently heads a sketch comedy workshop, The MoHo Group.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMTQzMTc2MF5BMl5BanBnXkFtZTgwNjY5MjgyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0929609","name":"Fred Willard","idIMDB":"nm0929609"},"actorId":"nm0929609","character":"Dad Tobias","urlCharacter":"http://www.imdb.com/character/ch0368426","main":true},{"actorName":"Connie Ray","urlProfile":"http://www.imdb.com/name/nm0712790","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczODU3ODQyNV5BMl5BanBnXkFtZTgwMDgxODIxMzE@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 July 1956","placeOfBirth":" Chapel Hill, North Carolina, USA","birthName":"Constance Ray","bio":"Connie Ray studied dance at East Carolina University. She earned an MFA in acting from Ohio University. Known for her screen and stage work, she is also a writer. She presently splits her time between Los Angeles and New York. Her film and television highlights include The Torkelsons (1991), Hope Floats (1998), Idle Hands (1999), Stuart Little (1999), About Schmidt (2002), Ice Princess (2005), Thank You for Smoking (2005), The Big C (2013)_, and Grays's Anatomy (2014)_. As a playwright, she penned the \"Smoke on the Mountain\" trilogy - numbering among the most produced musicals in America for the last twenty five years.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczODU3ODQyNV5BMl5BanBnXkFtZTgwMDgxODIxMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0712790","name":"Connie Ray","idIMDB":"nm0712790"},"actorId":"nm0712790","character":"Mom Tobias","urlCharacter":"http://www.imdb.com/character/ch0245159","main":true},{"actorName":"Steve Van Wormer","urlProfile":"http://www.imdb.com/name/nm0888321","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDM0MTAxMV5BMl5BanBnXkFtZTYwOTA3NDky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"A native of Grand Blanc, Michigan, Steve Van Wormer came to Los Angeles after graduating from Michigan State University through the sponsorship of the Warner Bros. Sitcom Writer's Workshop, soon moving into acting. With a background in sketch comedy performance and writing, he furthered his acting chops by enrolling in The Groundlings School. In addition, Steve began his own sketch comedy troupe, Caustic Casserole. The acerbic quartet performed at various venues around town, such as The Comedy Store and the Upfront Comedy Theater. Steve has appeared in numerous feature films, including the ensemble rave scene drama, Groove, Stew Deedle in Disney's Meet The Deedles, and Jingle All The Way opposite Arnold Schwarzenegger. His notable television appearances include the Disney Channel movie, Johhny Tsunami, the CBS Drama Turks, and The Tonight Show with Jay Leno. Steve was on the cutting edge of FOX's interstitial programming, doing music and pop culture commentary for Spin On Fox. He has voiced numerous video games including: Soul Calibur 3 & 4, GRID, Operation Flashpoint, Turok & X-Men 3.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDM0MTAxMV5BMl5BanBnXkFtZTYwOTA3NDky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0888321","name":"Steve Van Wormer","idIMDB":"nm0888321"},"actorId":"nm0888321","character":"Curtis","urlCharacter":"http://www.imdb.com/character/ch0245160","main":true},{"actorName":"Kelly Monaco","urlProfile":"http://www.imdb.com/name/nm0597450","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MTg5NzUyOV5BMl5BanBnXkFtZTcwMDQ4NTA3MQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 May 1976","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Kelly Marie Monaco","height":"5' 1\" (1.55 m)","bio":"An active athlete, Kelly Marie Monaco grew up on the East Coast, where she participated in soccer, swimming, track and softball, among other sports. After the last of five girls was born, her family decided to move from the bustling city of Philadelphia to the more peaceful environment of the Poconos. Monaco proudly states that she is a born competitor. In addition to athletics, she participated intensely in speech, debate and theater during high school. Monaco's television debut came in 1997, when she landed a recurring role on Baywatch (1989). She has since segued into the feature film world with roles in Idle Hands (1999), Mumford (1999) and BASEketball (1998). Raised in an Italian Catholic home, Monaco is very close with her family, especially her great-grandmother. She enjoys volunteering for children's charity events, as well as working with elders. She currently resides in West Hollywood, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MTg5NzUyOV5BMl5BanBnXkFtZTcwMDQ4NTA3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0597450","name":"Kelly Monaco","idIMDB":"nm0597450"},"actorId":"nm0597450","character":"Tiffany","urlCharacter":"http://www.imdb.com/character/ch0245161","main":true},{"actorName":"Timothy Stack","urlProfile":"http://www.imdb.com/name/nm0821048","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTUxNjc5M15BMl5BanBnXkFtZTcwMjIzMDQzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 November 1956","placeOfBirth":" Doylestown, Pennsylvania, USA","height":"6' 4\" (1.93 m)","bio":"Timothy Stack was born on November 21, 1956 in Doylestown, Pennsylvania, USA. He is an actor and writer, known for Dumb and Dumberer: When Harry Met Lloyd (2003), Cast Away (2000) and My Name Is Earl (2005). He is married to Jano Stack.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTUxNjc5M15BMl5BanBnXkFtZTcwMjIzMDQzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0821048","name":"Timothy Stack","idIMDB":"nm0821048"},"actorId":"nm0821048","character":"Principal Tidwell","urlCharacter":"http://www.imdb.com/character/ch0245162","main":true}],"seasons":[],"idIMDB":"tt0138510","urlIMDB":"http://www.imdb.com/title/tt0138510","business":{"budget":{"money":"$25,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$1,807,181","country":"USA","day":"02","month":"05","year":"1999","remarks":"1,611 Screens"}],"gross":[{"money":"$4,002,955","country":"USA","day":"13","month":"06","year":"1999","remarks":""},{"money":"$3,881,064","country":"USA","day":"06","month":"06","year":"1999","remarks":""},{"money":"$3,708,447","country":"USA","day":"23","month":"05","year":"1999","remarks":""},{"money":"$3,573,536","country":"USA","day":"16","month":"05","year":"1999","remarks":""},{"money":"$3,004,841","country":"USA","day":"09","month":"05","year":"1999","remarks":""},{"money":"$1,807,181","country":"USA","day":"02","month":"05","year":"1999","remarks":""}],"weekendGross":[{"money":"$1,807,181","country":"USA","day":"02","month":"05","year":"1999","remarks":"1,611 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"20","month":"04","year":"1998","remarks":null},{"money":null,"country":null,"day":"07","month":"07","year":"1998","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 32 min (92 min)"],"soundMix":["Dolby Digital","DTS","SDDS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Panaflex Gold II, Panavision Primo Lenses","Panavision Panaflex Gold, Panavision Primo Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA (prints)","Technicolor, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm (Kodak Vision 500T 5279, Eastman EXR 200T 5293)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.2","metascore":"31","filmingLocations":[{"location":"1034 North Madison Avenue, Pasadena, California, USA"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2000","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Performance by a Younger Actor/Actress","names":[{"name":"Devon Sawa","id":"nm0001701","role":null}]}]}]},{"award":"Teen Choice Awards 1999","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Film - Most Disgusting Scene","names":[{"name":"Devon Sawa","id":"nm0001701","role":null}]}]}]}],"votes":"34,591","type":"Movie","companyCreditsSimple":[{"idCompany":"co0050868","name":"Columbia Pictures Corporation"},{"idCompany":"co0023848","name":"Licht/Mueller Film Corporation"},{"idCompany":"co0050544","name":"Team Todd"}],"keywords":{"keywords":["female frontal nudity","breasts","slow motion scene","nude woman murdered","trailer home","reference to mozart","incense","stabbed in the head","twin brother","drug use","neck breaking","strangulation","priestess","demonic possession","disembodied hand","phone sex","fighting with self","hand","friend","halloween","watching tv","slacker","killing spree","close up of eyes","stabbed in the hand","hand through chest","burnt hand","shot in the forehead","reference to ludwig van beethoven","memorial","headless corpse","disposing of a dead body","tied to a bed","butt grab","thrown through a window","circular saw","stabbed to death","reference to o.j. simpson","stabbed in the forehead","music video","pentagram","map","newspaper clipping","police station","utah","character repeating someone else's dialogue","body horror","patricide","matricide","smoke","garage","body cast","reference to satan","rising from the grave","knitting needle","jack o'lantern","high school","band","bowling alley","attic","hydrolic lift","headphones","zippo lighter","lyricist","neighbor","couch potato","flashlight","reference to kevin costner","hiding under a bed","hiding under the covers","crawling hand","electrocution","electric carving knife","meat cleaver","drive thru","pistol","corpse","boyfriend girlfriend relationship","policeman","teenage boy","death","husband wife relationship","cut into pieces","angel","crushed to death","impalement","knife throwing","ashtray","hit with a shovel","dancing","angel costume","devil costume","scalping","pencil sharpener","bitten hand","cameo","reference to kiss the band","stealing a car","halloween costume","burrito","anti hero","friendship","duct tape","self mutilation","dark comedy","cult film","severed head","offscreen killing","writing in blood","eye gouging","screwball comedy","asthma inhaler","truck","teenager","taser","stoner","serial killer","rescue","puppet","pot smoking","nun costume","marijuana","making out","laziness","knife","hospital","hit by a truck","good versus evil","girl next door","dog","damsel in distress","crawling through an air shaft","cat","breast fondling","blood","basement","black comedy","gore","teen movie","stabbed in the ear","police officer killed","microwave","dagger","hanged woman","knitting","undead","murder","severed ear","severed hand","eyeball","high school dance","decapitation","disembodied head","bong","living dead","death of mother","death of father","death of friend","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:24:10"}}