{"data":{"movies":[{"title":"Stigmata","originalTitle":"","year":"1999","releaseDate":"19990910","directors":[{"name":"Rupert Wainwright","id":"nm0906548"}],"writers":[{"name":"Tom Lazarus","id":"nm0493842"},{"name":"Tom Lazarus","id":"nm0493842"}],"runtime":"103 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNWUyZTYtMTViZC00Y2ZkLWE2ZDEtNGY2ZDAxNjY2YjYzXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English","Assyrian Neo-Aramaic","Portuguese","Italian","Aramaic"],"genres":["Horror"],"plot":"A priest from the Vatican is sent to Sao Paulo, Brazil to investigate the appearance of the face of the Virgin Mary on the side of a building. While there he hears of a statue of the Virgin Mary bleeding tears in a small town outside of the city. Meanwhile, a young woman in the U.S. begins to show signs of stigmata, the wounds of Christ. The priest from the Vatican links up with her and cares for her as she is increasingly afflicted by the stigmata. Her ranting and raving finally begins to make sense to the priest who starts to question what his religion has stood for for the last 1900 years.","simplePlot":"When a young woman becomes afflicted by stigmata, a priest is sent to investigate her case, which may have severe ramifications for his faith and for the Catholic Church itself.","actors":[{"actorName":"Patricia Arquette","urlProfile":"http://www.imdb.com/name/nm0000099","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5Njg0NjkxMV5BMl5BanBnXkFtZTcwMzc0NTI5NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1968","placeOfBirth":" Chicago, Illinois, USA","birthName":"Patricia T. Arquette","height":"5' 2\" (1.57 m)","bio":"With her expressive blue eyes, soft, Southern-tinged voice and an acting range that can carry her from hysterically funny to terrifying in seconds, Patricia Arquette is one of the most underrated and talented actresses of her generation. Though she has been working for years, she's always stayed just under the radar of true stardom, despite a 1995 marriage to Nicolas Cage. Patricia was born in Chicago, though the family soon moved to a commune near Arlington, Virginia. Her parents, Lewis Arquette, an actor, and Brenda Denaut (née Nowak), an acting teacher and therapist, had 4 other children: Rosanna Arquette, Richmond Arquette, Alexis Arquette, and David Arquette, all actors. Her paternal grandfather, Cliff Arquette, was also an entertainer. Patricia's mother was from an Ashkenazi Jewish family (from Poland and Russia), while Patricia's father had French-Canadian, Swiss-German, and English ancestry. At 15, Patricia ran away from home to live with her sister Rosanna and, after initial insecurity, got her start in Pretty Smart (1987). A year later, she gained attention for her starring role in A Nightmare on Elm Street 3: Dream Warriors (1987), considered by many to be the best film of the Nightmare series. In 1989, Patricia's son, Enzo (father is Paul Rossi), was born. Soon after, her career took off, and she has since appeared in such critically acclaimed movies as True Romance (1993), Beyond Rangoon (1995), Ethan Frome (1993), Lost Highway (1997) and Flirting with Disaster (1996). She won a CableACE award in 1991 for her portrayal of a deaf epileptic in Wildflower (1991). In 1997, after her mother died of breast cancer, Patricia took the lead in the fight against the disease. She has run in the annual Race for the Cure and in 1999 was the Lee National Denim Day spokesperson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5Njg0NjkxMV5BMl5BanBnXkFtZTcwMzc0NTI5NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000099","name":"Patricia Arquette","idIMDB":"nm0000099"},"actorId":"nm0000099","character":"Frankie Paige","urlCharacter":"http://www.imdb.com/character/ch0011433","main":true},{"actorName":"Gabriel Byrne","urlProfile":"http://www.imdb.com/name/nm0000321","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMzE1ODA1Ml5BMl5BanBnXkFtZTcwODY3MjU5MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1950","placeOfBirth":" Dublin, Ireland","birthName":"Gabriel James Byrne","height":"5' 10\" (1.78 m)","bio":"Byrne was the first of six children, born in Dublin, Ireland. His father was a cooper and his mother a hospital worker. He was raised Catholic and educated by the Irish Christian Brothers. He spent five years of his childhood in a seminary training to be a Catholic priest. He later said, \"I spent five years in the seminary and I suppose it was assumed that you had a vocation. I have realized subsequently that I didn't have one at all. I don't believe in God. But I did believe at the time in this notion that you were being called.\" He attended University College Dublin, where he studied archeology and linguistics, and became proficient in Irish. He played football (soccer) in Dublin with the Stella Maris Football Club. Byrne worked in archeology after he left UCD but maintained his love of his language, writing Draíocht (Magic), the first drama in Irish on Ireland's national Irish television station, TG4, in 1996. He discovered his acting ability as a young adult. Before that he worked at several occupations which included being an archaeologist, a cook, a bullfighter, and a Spanish schoolteacher. He begin acting when he was 29. He began on stage at the Focus Theatre and the Abbey Theatre in Dublin, later he joined the Royal Court Theatre and the Royal National Theatre in London. Byrne came to prominence on the final season of the Irish television show The Riordans, later starring in the spin-off series, Bracken. He made his film début in 1981 as Lord Uther Pendragon in John Boorman's King Arthur epic, Excalibur. Byrne is featured as therapist Dr. Paul Weston in the critically acclaimed HBO series In Treatment (2008). In his return to theater in 2008, he appeared as King Arthur in Lerner and Loewe's Camelot with the New York Philharmonic which was featured in a PBS broadcast in the Live From Lincoln Center series in May of 2008. Byrne did not visit America until he was 37. In 1988, Byrne married actress Ellen Barkin with whom he has two children. The couple separated amicably in 1993 and divorced in 1999. Byrne resides in Brooklyn, New York. In November 2004, Byrne was appointed a UNICEF Ireland Ambassador. In 2007 Byrne was presented with the first of the newly created Volta awards at the 5th Jameson Dublin International Film Festival. This was for lifetime achievement in acting. He also received the Honorary Patronage of the University Philosophical Society, of Trinity College, Dublin on February 20, 2007. He was awarded an honorary degree in late 2007 by the National University of Ireland, Galway, in recognition of Byrne's \"outstanding contribution to Irish and international film\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMzE1ODA1Ml5BMl5BanBnXkFtZTcwODY3MjU5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000321","name":"Gabriel Byrne","idIMDB":"nm0000321"},"actorId":"nm0000321","character":"Father Andrew Kiernan","urlCharacter":"http://www.imdb.com/character/ch0011434","main":true},{"actorName":"Jonathan Pryce","urlProfile":"http://www.imdb.com/name/nm0000596","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NTQ3OTcwNl5BMl5BanBnXkFtZTgwNTE2MDU2ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1947","placeOfBirth":" Holywell, Flintshire, Wales, UK","birthName":"John Price","height":"6' (1.83 m)","bio":"From Holywell to Hollywood, Jonathan Pryce, CBE is a critically acclaimed and award winning actor from North Wales, internationally regarded as the one of greatest ones both on stage and screen. Renowned for his immense versatility and powerful presence he has transcended the industry, effortlessly moving between Hollywood studio films and the classical West End in a range of work that also includes bold independent cinema and the Broadway musical. He has created some of the most memorable characters in cinema and for over forty years been on the wish list of many of the worlds most notorious and accomplished directors as 'Someone they must work with'. Jonathan, after graduating from the world famous RADA in London, began his career in the 1970's at the hugely influential Liverpool Everyman Theatre which grounded his politics and talent and helped attract a legacy of brave individual artists that have since been through their doors. From his definitive performance as Hamlet, he made his breakthrough screen performance in Terry Gilliam's masterpiece Brazil (1985). The phrase an 'Actors Actor' is often overused but with Jonathan Pryce I can think of no better fitting tribute because what that means to the industry is - here is a talent people want to watch and people want to work with. His choices can be considered as bold as they should be as well as always truthful that give life to characters multi-layered and always exciting, where it can be even hard to believe that he is just one man. As in his stage course that includes notable performances such as in \"Hamlet\", \"The Merchant of Venice\", \"The Goat or Who is Sylvia?\", \"The Taming of the Shrew\", \"Miss Saigon\", \"Oliver\", \"Comedians\" and \"King Lear\", Jonathan Pryce's range of staggering portrayals full of generously euphoric delight has also been expressed in films such as Brazil (1985), Glengarry Glen Ross (1992), The Age of Innocence (1993), Carrington (1995), Evita (1996), Behind the Lines (1997), Tomorrow Never Dies (1997), Very Annie Mary (2001), Unconditional Love (2002) and Pirates of the Caribbean: Dead Man's Chest (2006) as well as in mesmerizing TV roles such as in Roger Doesn't Live Here Anymore (1981), Game of Thrones (2011), My Zinc Bed (2008), Wolf Hall (2015) and Taboo (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NTQ3OTcwNl5BMl5BanBnXkFtZTgwNTE2MDU2ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000596","name":"Jonathan Pryce","idIMDB":"nm0000596"},"actorId":"nm0000596","character":"Cardinal Daniel Houseman","urlCharacter":"http://www.imdb.com/character/ch0035636","main":true},{"actorName":"Nia Long","urlProfile":"http://www.imdb.com/name/nm0000505","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE0NjM4NDY3Ml5BMl5BanBnXkFtZTgwODI5Njg5MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 October 1970","placeOfBirth":" Brooklyn, New York, USA","birthName":"Nitara Carlynn Long","height":"5' 2\" (1.57 m)","bio":"Stunning pop culture icon, Hollywood leading lady and three-time NAACP award winner Nia Long returns to the big screen this fall in the highly anticipated Universal Pictures sequel The best man holiday (in theaters November 15th) where she reunites with original castmates Taye Diggs (\"Private Practice\"), Terrence Howard (Hustle & flow), Morris Chestnut (The brothers) and Harold Perrineau (\"Lost\"). Additionally in Spring 2014, Long will star in Tyler Perry's Single mom's club alongside Wendi McLendon- Covey (Bridesmaids), Tyler Perry (Madea) and Amy Smart (Crank). Early this year, Long joined the all-star cast of Showtime's \"House of Lies\" alongside Golden Globe Award winner Don Cheadle & Kristen Bell as \"Tamara,\" a business school classmate and former flame of Marty's (Don Cheadle) who has been hired by the same consulting firm Galweather Stearn after taking time off to raise a family. Long made her film debut in the poignant film portraying the social problems in inner-city Los Angeles, Boyz n the hood , and continued on to star in FRIDAY alongside Ice Cube and Chris Tucker as well as LOVE JONES which won the prestigious Audience Award at Sundance. Other notable film roles include Soul Food, Alfie opposite Jude Law, The Best man, Are We There Yet?, Big Momma's House 1 & 2 opposite Martin Lawrence, Stigmata, the Broken Hearts Club and Made in America. On the small screen, Long's portrayal of \"Officer Sasha Monroe\" on NBC's hit crime drama \"Third Watch\" awarded her two NAACP Image Awards for Outstanding Actress in a Drama series. Long's other TV accomplishments include \"The Fresh Prince of Bel-Air,\" \"Boston Legal,\" \"Judging Amy,\" and \"Big Shots.\" Long also voiced \"Roberta\" in the first season of the Fox hit \"the Cleveland Show.\" Making her directorial debut on Ashanti's music video \"Baby\" and Yolanda Adam's \"This Too Shall Pass,\" Nia continues her work behind the camera and is developing a feature film that centers on renowned world champion boxer and trainer Ann Wolfe. In addition to her film and TV work, Long's passion lies in serving her community. With her family roots planted in Trinidad, Grenada, and Barbados, Long's long term goals are to connect women in the US to those of the islands and to mentor young girls to regain their self-esteem. Additionally, Long lends her support to Black Girls Rock, an organization that promotes the arts for young women of color and encourages dialogue on the ways women of color are portrayed in the media. In 2012 she was named an official surrogate to the Barack Obama reelection campaign. A Brooklyn native, Long now calls Los Angeles home where she lives with her 12 year old son, Massai, 14 month old son, Kez and partner Ime Udoka, an Assistant Coach for the San Antonio Spurs. Long loves to cook organic farmer's market fresh meals adding a twist of her Trinidadian heritage. When she's not juggling between her career and motherhood, she enjoys staying active by doing pilates, boxing, hiking, and horseback riding. Long also finds pleasure in traveling and experiencing different cultures throughout the world. One of her favorite locations to visit is Jamaica, a place she calls her second home where she can reflect and refuel.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE0NjM4NDY3Ml5BMl5BanBnXkFtZTgwODI5Njg5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000505","name":"Nia Long","nicknames":["Nia"],"idIMDB":"nm0000505"},"actorId":"nm0000505","character":"Donna Chadway","urlCharacter":"http://www.imdb.com/character/ch0055955","main":true},{"actorName":"Thomas Kopache","urlProfile":"http://www.imdb.com/name/nm0465664","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5OTY5NDAwNV5BMl5BanBnXkFtZTcwMDc5NzgyMQ@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 October 1945","placeOfBirth":" Manchester, New Hampshire, USA","height":"5' 9\" (1.75 m)","bio":"Thomas Kopache is an actor born in Manchester, New Hampshire on October 17, 1945 who is best known for his role as Assistant Secretary of State Bob Slatterly on The West Wing (1999) and for appearing in many roles on all of the various \"Star Trek\" spin-off television shows. Kopache has played seven characters on the \"Star Trek\" spin-offs Star Trek: The Next Generation (1987), Star Trek: Deep Space Nine (1993), Star Trek: Voyager (1995), and \"Star Trek: Enterprise\". He also appeared in the Star Trek movie Star Trek: Generations (1994) and the \"Star Trek\"-inspired sci-fi TV series Babylon 5 (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5OTY5NDAwNV5BMl5BanBnXkFtZTcwMDc5NzgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0465664","name":"Thomas Kopache","idIMDB":"nm0465664"},"actorId":"nm0465664","character":"Father Durning","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rade Serbedzija","urlProfile":"http://www.imdb.com/name/nm0784884","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjk4NTc0NTk5OV5BMl5BanBnXkFtZTcwOTY5OTIxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 July 1946","placeOfBirth":" Bunic, Croatia, Yugoslavia","height":"5' 10\" (1.78 m)","bio":"Rade Serbedzija was born in Bunic (Korenica) in 1946. Graduated from the Academy of Dramatic Arts in Zagreb. Still a student, he started to play the leading roles in films and theater productions. He is remembered as an outstanding Peer Gynt, Don Juan, Georgij, Melkior, Oedipus, Hamlet, Leon and Richard III. He wrote and published four books of poetry and released four albums, as well as directed 12 plays (Balade Petrice Kerempuha, Kazu da je sova nekad bila pekareva kci, Judita, Hrvatski slavuj...). He shot more than seventy films (Rdece klasje (1970), Zadah tela (1983), Hajka (1977), Vecernja zvona (1986), Bravo maestro (1978), Variola Vera (1982), Una (1984), Usijanje (1979), Zivot je lep (1985), Kiklop (1982), Povratak (1979), Horvatov izbor (1985), Dreaming the Rose (1986), Kontesa Dora (1993)...), and starred in leading roles of several TV-series (Sam covjek, U registraturi (1974), Prosjaci i sinovi (1971), Bombaski proces (1978), Nikola Tesla (1977), Putovanje u Vucjak (1986)...). He joined Vanessa Redgrave to found a theater that produced plays such as Brecht in exile, Liberation of Skopje, Smoke, Opera Sarajevo. He took part in many charity and peace initiatives. After a world famous film Before the Rain (1994) where he played the leading role, he was cast in films by prominent directors of the world (P. Noyce, J. Woo, S. Kubrick, F. Rossi...), in films such as The Saint (1997) (P. Noyce), The Truce (1997) (F. Rossi), Prague Duet (1998), Broken English (1996), Eyes Wide Shut (1999) (S. Kubrick), Polish Wedding (1998), Stigmata (1999), Mighty Joe Young (1998), Il dolce rumore della vita (1999), Open Sea (1998), Mission: Impossible II (2000), Space Cowboys (2000), Snatch (2000), and in South Pacific (2001), Hermano (2007), Quicksand (2003), currently in post-production. He starred alongside Val Kilmer, Elisabeth Shue, John Turturro, Tom Cruise, Glenn Close. He lives in London.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjk4NTc0NTk5OV5BMl5BanBnXkFtZTcwOTY5OTIxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0784884","name":"Rade Serbedzija","idIMDB":"nm0784884"},"actorId":"nm0784884","character":"Marion Petrocelli","urlCharacter":"http://www.imdb.com/character/ch0080014","main":true},{"actorName":"Enrico Colantoni","urlProfile":"http://www.imdb.com/name/nm0170186","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmVmMWE1MDAtZDA5Ni00MTQxLWIwZTItMTY5Y2EzN2ZlNWNjXkEyXkFqcGdeQXVyMTEyMDU4NDk@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 February 1963","placeOfBirth":" Toronto, Ontario, Canada","bio":"Enrico Colantoni was born on February 14, 1963 in Toronto, Ontario, Canada. He is an actor and director, known for Just Shoot Me! (1997), Galaxy Quest (1999) and Veronica Mars (2004). He has been married to Rosanna Francioni since November 11, 2011. They have four children. He was previously married to Nancy Snyder.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmVmMWE1MDAtZDA5Ni00MTQxLWIwZTItMTY5Y2EzN2ZlNWNjXkEyXkFqcGdeQXVyMTEyMDU4NDk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0170186","name":"Enrico Colantoni","nicknames":["Rico"],"idIMDB":"nm0170186"},"actorId":"nm0170186","character":"Father Dario","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dick Latessa","urlProfile":"http://www.imdb.com/name/nm0490050","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU1ODI3Mzc2MV5BMl5BanBnXkFtZTgwNDYzMTE5MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1929","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Richard Robert Latessa","bio":"Dick Latessa was born on September 15, 1929 in Cleveland, Ohio, USA as Richard Robert Latessa. He was an actor, known for One Life to Live (1968), Stigmata (1999) and Alfie (2004). He was married to Shirley Stollman. He died on December 19, 2016 in Manhattan, New York City, New York, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU1ODI3Mzc2MV5BMl5BanBnXkFtZTgwNDYzMTE5MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0490050","name":"Dick Latessa","idIMDB":"nm0490050"},"actorId":"nm0490050","character":"Father Gianni Delmonico","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Portia de Rossi","urlProfile":"http://www.imdb.com/name/nm0005577","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0Mjk1MjIxOV5BMl5BanBnXkFtZTcwODQyNjY5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 January 1973","placeOfBirth":" Geelong, Victoria, Australia","birthName":"Amanda Lee Rogers","height":"5' 8\" (1.73 m)","bio":"Portia de Rossi was born and raised in Geelong, Australia. Originally born Amanda Rogers, at 15 she changed her name to Portia, saying that it was the most daring thing she had ever done up until that point. After graduating from high school, she attended the University of Melbourne, and studied law. Although she studied diligently, in 1993, Portia found herself giving special notice to a casting director who saw her in a commercial, and she soon auditioned for Sirènes (1993), a low budget comedy starring Hugh Grant. She was cast in the role of Giddy, one of the three gorgeous models in the movie. It wasn't until 1997, however, that Portia at last began to attract real attention. She turned an unforgettable role as Murphy in Scream 2 (1997), and in 1998 she joined the cast of Ally McBeal (1997) as the \"Ice Queen\", Nelle Porter. She has also worked on such projects as Stigmata (1999), Girl (1998), and The Invisibles (1999), and she has appeared on several magazine covers, including Shape. After more than a decade of hard work, Portia is finally beginning to win real recognition, not only for her long golden tresses, but also for her wonderful talent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0Mjk1MjIxOV5BMl5BanBnXkFtZTcwODQyNjY5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005577","name":"Portia de Rossi","idIMDB":"nm0005577"},"actorId":"nm0005577","character":"Jennifer Kelliho","urlCharacter":"http://www.imdb.com/character/ch0164221","main":true},{"actorName":"Patrick Muldoon","urlProfile":"http://www.imdb.com/name/nm0005258","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjcwNDEtNjA1Yi00NzE5LWE2NjYtNjE5NmI0ZGZiYTk1L2ltYWdlXkEyXkFqcGdeQXVyMzQ5Njc1Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 September 1968","placeOfBirth":" Los Angeles, California, USA","birthName":"William Patrick Muldoon III","height":"6' 2\" (1.88 m)","bio":"William Patrick Muldoon III was born and raised in the Los Angeles waterfront town of San Pedro, California, the son of Deanna and William Patrick Muldoon II, a personal injury and maritime attorney. He has Irish and Croatian ancestry. His parents' artistic backgrounds, in painting, writing, and music, induced the same appetites in their son, as well as athletics. He played college football for the U.S.C. Trojans and has two Rose Bowl rings. His first job in the entertainment business was as a model for Calvin Klein and started at the esteemed Wilhelmina Modeling agency . Early in his career he appeared on Who's the Boss? (1984) with Tony Danza and Silk Stalkings (1991) with Rob Estes which led to Days of Our Lives (1965) and the role of Austin Reed. Patrick won the Soap Opera Digest award for best new actor and spent the next three years at NBC. Being one of the most visible faces from the soaps, he caught the attention of Spelling Entertainment, and received the only development deal from the company in it's history - it led to a season on Melrose Place (1992). His next big break was landing the part of Zander Barkalow in Paul Verhoeven's Starship Troopers (1997) with Casper Van Dien. He's appeared in a host of independent films including the Sundance contestant Wicked (1998) with Julia Stiles, and Frank Darabont's Black Cat Run (1998). In 2011 he returned to Days of Our Lives (1965) for a year. He has since starred in All About Christmas Eve (2012) with Haylie Duff for 'Lifetime,' _Holiday Road Trip_ with 'Ashley Scott' and George Hamilton, In the Dark (2013) with Elisabeth Röhm for 'Lifetime.' He is also a development executive at Eclectic Pictures as well as an independent producer on many upcoming projects in late 2015 including _Badge of Honor_ with Martin Sheen, Mena Suvari, and (I). Patrick is also starring in the film. Patrick is lead singer of \"The Sleeping Masses' who wrote and sang the title song in Powder Blue (2009) with Jessica Biel. The band has two records available on iTunes. In his spare time Patrick loves to play guitar and is a blue belt in \"Krav Maga\", which he takes regularly and uses to fight crime all over the world.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjcwNDEtNjA1Yi00NzE5LWE2NjYtNjE5NmI0ZGZiYTk1L2ltYWdlXkEyXkFqcGdeQXVyMzQ5Njc1Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005258","name":"Patrick Muldoon","idIMDB":"nm0005258"},"actorId":"nm0005258","character":"Steven","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ann Cusack","urlProfile":"http://www.imdb.com/name/nm0193639","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgyNzI5MTgyNF5BMl5BanBnXkFtZTgwMzIwMDc2NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 May 1961","placeOfBirth":" Brooklyn, New York, USA","height":"5' 8½\" (1.74 m)","bio":"Ann Cusack was born on May 22, 1961 in Brooklyn, New York, USA. She is an actress, known for Nightcrawler (2014), A League of Their Own (1992) and Accepted (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgyNzI5MTgyNF5BMl5BanBnXkFtZTgwMzIwMDc2NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0193639","name":"Ann Cusack","idIMDB":"nm0193639"},"actorId":"nm0193639","character":"Dr. Reston","urlCharacter":"http://www.imdb.com/character/ch0011435","main":true},{"actorName":"Shaun Toub","urlProfile":"http://www.imdb.com/name/nm0869467","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAxOTY5MDg2OF5BMl5BanBnXkFtZTcwMTMwMjk2Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1963","placeOfBirth":" Tehran, Iran","height":"6' 1½\" (1.87 m)","bio":"Shaun Toub was born in Tehran, Iran, to a Persian Jewish family. He was raised in Manchester, England. At the age of 14, he moved to Switzerland and after a two year stay, he crossed the Atlantic to Nashua, New Hampshire, to finish his last year of high school. After two years of college in Massachusetts, Shaun transferred to USC. His high school yearbook notes: \"The Funniest guy in school and the most likely to succeed in the entertainment world.\" Through a chance encounter with an astute talent agent, he broke into the Hollywood scene with hope in his heart and a natural talent to entertain. Toub has received accolades for several of his appearances in over 100 television episodes including Seinfeld, The Sopranos, Castle, NCIS, Chuck, Lost, Charmed, ER, Just Shoot Me, JAG, Married with Children and various movies made for television. His filmography includes his memorable performance in Bad Boys, Broken Arrow, The Kite Runner, Charlie Wilson's War, Iron Man, The Last Airbender and the Oscar-winning film Crash. His recent work includes playing Majid Javadi in Season 3 of Homeland and the upcoming film Papa, the life story of Ernest Hemingway, in the role of Evan Shipman the poet. Shaun is very proud of his Persian heritage and is very active in the community. Through various charity events and public speaking engagements, he inspires the community to embrace the arts, as the arts enhance everyday life. Shaun resides in Los Angeles and loves the outdoors, sports, and music.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAxOTY5MDg2OF5BMl5BanBnXkFtZTcwMTMwMjk2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0869467","name":"Shaun Toub","idIMDB":"nm0869467"},"actorId":"nm0869467","character":"Doctor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Hodges","urlProfile":"http://www.imdb.com/name/nm0388218","urlPhoto":"","biography":{"dateOfBirth":"1 July 1965","placeOfBirth":" Chicago, Illinois, USA","height":"6' (1.83 m)","bio":"Tom Hodges was born on July 1, 1965 in Chicago, Illinois, USA. He is an actor and producer, known for Stigmata (1999), Michael (1996) and Steel Magnolias (1989). He has been married to Colleen since July 2009.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0388218","name":"Tom Hodges","idIMDB":"nm0388218"},"actorId":"nm0388218","character":"ER Nurse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lydia Hazan","urlProfile":"http://www.imdb.com/name/nm0371885","urlPhoto":"","biography":{"bio":"Lydia Hazan is known for her work on Stigmata (1999), The Way of the Gun (2000) and Obese at 16: A Life in the Balance (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0371885","name":"Lydia Hazan","idIMDB":"nm0371885"},"actorId":"nm0371885","character":"Attending Nurse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shaun Duke","urlProfile":"http://www.imdb.com/name/nm0602170","urlPhoto":"","biography":{"dateOfBirth":"14 January 1953","placeOfBirth":" Stanislaus County, California, USA","birthName":"Shaun Duke Moosekian","bio":"Shaun Duke was born on January 14, 1953 in Stanislaus County, California, USA as Shaun Duke Moosekian. He is an actor, known for Losing in Love (2016), Rosewood (2015) and Aquarius (2015). He is married to Kathryn Atwood.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0602170","name":"Shaun Duke","idIMDB":"nm0602170"},"actorId":"nm0602170","character":"Dr. Eckworth","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0145531","urlIMDB":"http://www.imdb.com/title/tt0145531","business":{"budget":{"money":"$29,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$18,309,666","country":"USA","day":"12","month":"09","year":"1999","remarks":"2,899 Screens"},{"money":"£1,070,783","country":"UK","day":"23","month":"01","year":"2000","remarks":"273 Screens"}],"gross":[{"money":"$50,041,732","country":"USA","day":"20","month":"02","year":"2000","remarks":""},{"money":"$50,040,876","country":"USA","day":"13","month":"02","year":"2000","remarks":""},{"money":"$50,039,222","country":"USA","day":"06","month":"02","year":"2000","remarks":""},{"money":"$50,035,519","country":"USA","day":"30","month":"01","year":"2000","remarks":""},{"money":"$50,029,768","country":"USA","day":"16","month":"01","year":"2000","remarks":""},{"money":"$50,023,892","country":"USA","day":"09","month":"01","year":"2000","remarks":""},{"money":"$50,014,865","country":"USA","day":"02","month":"01","year":"2000","remarks":""},{"money":"$50,000,915","country":"USA","day":"26","month":"12","year":"1999","remarks":""},{"money":"$49,985,276","country":"USA","day":"19","month":"12","year":"1999","remarks":""},{"money":"$49,947,155","country":"USA","day":"12","month":"12","year":"1999","remarks":""},{"money":"$49,789,629","country":"USA","day":"21","month":"11","year":"1999","remarks":""},{"money":"$49,662,619","country":"USA","day":"14","month":"11","year":"1999","remarks":""},{"money":"$49,473,176","country":"USA","day":"07","month":"11","year":"1999","remarks":""},{"money":"$49,206,560","country":"USA","day":"31","month":"10","year":"1999","remarks":""},{"money":"$48,758,507","country":"USA","day":"24","month":"10","year":"1999","remarks":""},{"money":"$47,961,934","country":"USA","day":"17","month":"10","year":"1999","remarks":""},{"money":"$46,483,606","country":"USA","day":"10","month":"10","year":"1999","remarks":""},{"money":"$44,300,500","country":"USA","day":"03","month":"10","year":"1999","remarks":""},{"money":"$40,566,932","country":"USA","day":"26","month":"09","year":"1999","remarks":""},{"money":"$32,953,476","country":"USA","day":"19","month":"09","year":"1999","remarks":""},{"money":"$18,309,666","country":"USA","day":"12","month":"09","year":"1999","remarks":""},{"money":"£3,472,079","country":"UK","day":"20","month":"02","year":"2000","remarks":""},{"money":"£3,365,512","country":"UK","day":"13","month":"02","year":"2000","remarks":""},{"money":"£3,084,180","country":"UK","day":"06","month":"02","year":"2000","remarks":""},{"money":"£2,320,217","country":"UK","day":"30","month":"01","year":"2000","remarks":""},{"money":"£1,070,783","country":"UK","day":"23","month":"01","year":"2000","remarks":""},{"money":"SGD 302,083","country":"Singapore","day":"26","month":"01","year":"2000","remarks":""},{"money":"SGD 272,188","country":"Singapore","day":"19","month":"01","year":"2000","remarks":""},{"money":"SGD 208,930","country":"Singapore","day":"12","month":"01","year":"2000","remarks":""},{"money":"SGD 57,843","country":"Singapore","day":"02","month":"01","year":"2000","remarks":"sneak preview"}],"weekendGross":[{"money":"$720","country":"USA","day":"20","month":"02","year":"2000","remarks":"1 Screen"},{"money":"$808","country":"USA","day":"13","month":"02","year":"2000","remarks":"4 Screens"},{"money":"$2,817","country":"USA","day":"06","month":"02","year":"2000","remarks":"5 Screens"},{"money":"$1,496","country":"USA","day":"30","month":"01","year":"2000","remarks":"5 Screens"},{"money":"$2,360,738","country":"USA","day":"03","month":"10","year":"1999","remarks":"2,045 Screens"},{"money":"$4,700,199","country":"USA","day":"26","month":"09","year":"1999","remarks":"2,854 Screens"},{"money":"$9,229,007","country":"USA","day":"19","month":"09","year":"1999","remarks":"2,901 Screens"},{"money":"$18,309,666","country":"USA","day":"12","month":"09","year":"1999","remarks":"2,899 Screens"},{"money":"£47,925","country":"UK","day":"20","month":"02","year":"2000","remarks":"64 Screens"},{"money":"£97,591","country":"UK","day":"13","month":"02","year":"2000","remarks":"122 Screens"},{"money":"£385,102","country":"UK","day":"06","month":"02","year":"2000","remarks":"264 Screens"},{"money":"£718,604","country":"UK","day":"30","month":"01","year":"2000","remarks":"275 Screens"},{"money":"£1,070,783","country":"UK","day":"23","month":"01","year":"2000","remarks":"273 Screens"}],"admissions":[{"money":"43,133","country":"Netherlands","day":"31","month":"12","year":"2000","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"17","month":"09","year":"1998","remarks":null},{"money":null,"country":null,"day":"27","month":"04","year":"1999","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 43 min (103 min)"],"soundMix":["DTS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)"]},"rating":"6.2","metascore":"28","filmingLocations":[{"location":"Greystone Park & Mansion - 905 Loma Vista Drive, Beverly Hills, California, USA"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2000","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Horror Film","names":[]}]}]},{"award":"Blockbuster Entertainment Awards 2000","titlesAwards":[{"titleAwardOutcome":"Nominated Blockbuster Entertainment Award","categories":[{"category":"Favorite Actress - Horror","names":[{"name":"Patricia Arquette","id":"nm0000099","role":null}]},{"category":"Favorite Actor - Horror","names":[{"name":"Gabriel Byrne","id":"nm0000321","role":null}]},{"category":"Favorite Supporting Actor - Horror","names":[{"name":"Jonathan Pryce","id":"nm0000596","role":null}]}]}]},{"award":"Motion Picture Sound Editors, USA 2000","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing - Music (Foreign &amp; Domestic)","names":[{"name":"Kenneth Karman","id":"nm0439741","role":"supervising music editor"},{"name":"Mike Flicker","id":"nm0282287","role":"supervising music editor/scoring editor"},{"name":"Stephen Lotwis","id":"nm0521564","role":"supervising music editor"},{"name":"Billy Corgan","id":"nm0004842","role":"scoring editor"}]}]}]},{"award":"Razzie Awards 2000","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Supporting Actor","names":[{"name":"Gabriel Byrne","id":"nm0000321","role":null},{"name":"End of Days","id":"tt0146675","role":null}]}]}]}],"votes":"56,124","type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"},{"idCompany":"co0024546","name":"FGM Entertainment"}],"keywords":{"keywords":["priest","stigmata","wound","vatican","catholic","statue","hairdresser","crucifixion","brazil","catholic priest","investigation","gospel","religion","church","catholic church","fax machine","scar","extreme close up","goatee","feather","underwater scene","conspiracy","christianity","friendship","cult film","attempted murder","irish","strangulation","crashing through a window","revelation","panic","whipping","demon","funeral","corrupt priest","alley","car crash","car accident","chase","bare chested male","security guard","race against time","f word","wheelchair","rescue","fire","e mail","black comedy","messenger","cover up","film ends with text","scroll","library","translator","diner","tape recorder","writing on wall","computer","apartment","exorcism","mansion","danger","ambulance","brain scan","blood sample","female doctor","gothic","false accusation","yelling","self mutilation","threatened with a knife","knife","newspaper clipping","prostitute","thrown through a window","shower","bathtub","premarital sex","corpse","coffin","aerial shot","flower","subtitled scene","photograph","village","dove","lightning","rainstorm","heavy rain","1990s","twenty something","punk","tattoo artist","tattoo","interracial friendship","nightclub","cigarette smoking","candle","camera","train accident","surveillance footage","insanity","fear","paranoia","surrealism","gore","blood on face","praying","paranormal phenomena","vision","slow motion scene","fast motion scene","scene during opening credits","virgin mary statue","catholicism","religious symbolism","new york city","pittsburgh pennsylvania","vatican city","prologue","one word title","supernatural horror","faking stigmata","reference to the gospel of st. thomas","anti catholic","anti clericalism","supernatural power","bible","female nudity","nun","demonic possession","usa","suppression","occult","nudity","hallucination","crisis of faith","cardinal the priest","beautician","christian horror","rome italy","apocrypha","reference to jesus christ","blood","rosary","translation","subway","possession","bandage","statue weeping blood","hospital","ancient manuscript","doctor","waterdrop","levitation","atheist","water","title spoken by character","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:01:44"}}