{"data":{"movies":[{"title":"The Burning Season: The Chico Mendes Story","originalTitle":"The Burning Season","year":"1994","releaseDate":"19940917","directors":[{"name":"John Frankenheimer","id":"nm0001239"}],"writers":[{"name":"Andrew Revkin","id":"nm0720923"},{"name":"William Mastrosimone","id":"nm0557895"}],"runtime":"123 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MTA4NzIyOV5BMl5BanBnXkFtZTcwNDI2NjEyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Biography","Drama"],"plot":"Based on the true story of a Brazilian rubber tapper who leads his people in protest against government and developers, who want to cut down their part of the rainforest for a new road and ranch land. The rich and the powerful will stop at nothing, and frequently resort to murder.","simplePlot":"Based on the true story of a Brazilian rubber tapper who leads his people in protest against government and developers, who want to cut down their part of the rainforest for a new road and ... ","actors":[{"actorName":"Raul Julia","urlProfile":"http://www.imdb.com/name/nm0000471","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzMyOTgzODYyNl5BMl5BanBnXkFtZTcwMDE5OTgwMw@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 March 1940","placeOfBirth":" San Juan, Puerto Rico","birthName":"Raul Rafael Carlos Julia y Arcelay","height":"6' 2\" (1.88 m)","bio":"Raul Julia was born and raised in San Juan, Puerto Rico, to Olga Arcelay, a mezzo-soprano singer, and Raúl Juliá, an electrical engineer. He graduated from Colegio San Ignacio de Loyola High School in San Juan. Here he studied the rigorous classical curriculum of the Jesuits and was always active in student dramatics. Julia was discovered while performing in a nightclub in San Juan by actor Orson Bean who inspired him to move to the mainland to pursue other projects. Julia moved to Manhattan, New York City in 1964 and quickly found work by acting in small and supporting roles in off-Broadway shows. In 1966, Julia began appearing in Shakespearean roles, creating a deliciously conniving Edmund in \"King Lear\" in 1973 and a smoldering Othello in 1979. Julia also made his mark on the musical stage playing one of the \"Two Gentlemen of Verona\" during its run in 1971, and a chilling role of Mack the Knife in \"The Threepenny Opera\" in 1976 and as a Felliniesque film director in \"Nine\" in 1982. The stage successes led to his movie works where he is better known. One of his best movie roles is a passionate political prisoner in Le baiser de la femme-araignée (1985). Julia also appeared as dramatic heroes and memorable villains in a number of films and made-for-TV-movies. His later roles included the crazy macabre Gomez Addams in two Addams Family movies. With his health declining from 1993 onward after he underwent a surgical operation for stomach cancer, Julia kept on acting, where he traveled to Mexico during the winter of 1993-1994 to play the Brazilian Amazon forest activist Chico Mendes in The Burning Season: The Chico Mendes Story (1994), for which he posthumously won a Golden Globe and an Emmy Award. His last theatrical movie was filmed shortly after The Burning Season: The Chico Mendes Story (1994) when he traveled to Australia to shoot all of his scenes for Street Fighter - L'ultime combat (1994), based on the popular video game where he played the villainous General M. Bison. His last role was a supporting part in another made-for-TV movie titled Down Came a Blackbird (1995). On October 16, 1994, the weakened and gaunt Raul Julia suffered a stroke in New York City where he fell into a coma a few days later and was put on life support. He was transferred to a hospice in nearby Manhasset, Long Island where his weakened body finally gave up the struggle on October 24, at age 54. His body was flown back to Puerto Rico for burial where thousands turned out for his state funeral to remember him. Two honoring ceremonies were held at Colegio San Ignacio de Loyola High School, and at the Headquarters of the Institute of Puerto Rican Culture prior to his burial.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzMyOTgzODYyNl5BMl5BanBnXkFtZTcwMDE5OTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000471","name":"Raul Julia","idIMDB":"nm0000471"},"actorId":"nm0000471","character":"Chico Mendes","urlCharacter":"http://www.imdb.com/character/ch0435130","main":true},{"actorName":"Carmen Argenziano","urlProfile":"http://www.imdb.com/name/nm0034492","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzdkZWJjNWUtODczNC00NGRhLTllN2QtMzU2N2NkZDI3OTc2XkEyXkFqcGdeQXVyMjc3Njc5NDQ@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 October 1943","placeOfBirth":" Sharon, Pennsylvania, USA","birthName":"Carmen Antimo Argenziano","height":"5' 10\" (1.78 m)","bio":"Carmen Argenziano was born on October 27, 1943 in Sharpsville, Pennsylvania, as Carmen Antimo Argenziano. He is an actor known for his work on hundreds of films and TV series throughout his fifty year career. He was in The Accused, Stand And Deliver, The Godfather: Part II, Identity, and many more, including James Franco's production of Don Quixote, playing the title character. He played the memorable and well loved character Jacob Carter in the TV series Stargate SG1. He is a Lifetime Member of The Actors Studio.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzdkZWJjNWUtODczNC00NGRhLTllN2QtMzU2N2NkZDI3OTc2XkEyXkFqcGdeQXVyMjc3Njc5NDQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0034492","name":"Carmen Argenziano","idIMDB":"nm0034492"},"actorId":"nm0034492","character":"Alfredo Sezero","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sonia Braga","urlProfile":"http://www.imdb.com/name/nm0000968","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NjQ4MTgwNF5BMl5BanBnXkFtZTcwNzUzNzAzMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 June 1950","placeOfBirth":" Maringá, Paraná, Brazil","birthName":"Sônia Maria Campos Braga","height":"5' 2\" (1.57 m)","bio":"Born June 8, 1950, in Maringá, Paraná State, Brazil to a seamstress mother and a Realtor father. Made a notable appearance in the film adaptation of Jorge Amado's Dona Flor and Her Two Husbands (1976). Played the central role of Dona Flor. Earned American recognition and a Golden Globe nomination for performance in Le baiser de la femme-araignée (1985). She was nominated a second Golden Globe for her performance in Moon Over Parador (1988). She played the part of Madonna Mendez.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NjQ4MTgwNF5BMl5BanBnXkFtZTcwNzUzNzAzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000968","name":"Sonia Braga","nicknames":["The Brazilian Bombshell"],"idIMDB":"nm0000968"},"actorId":"nm0000968","character":"Regina de Carvalho","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kamala Lopez","urlProfile":"http://www.imdb.com/name/nm0520234","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMDg3NDAwOV5BMl5BanBnXkFtZTgwNzA1MTU2MDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 April 1964","placeOfBirth":" New York, New York, USA","height":"5' 2\" (1.57 m)","bio":"Kamala Lopez is an award-winning film and television actress, producer, director, writer and editor as well as an internationally recognized political activist, blogger and published editorialist. Born in New York City to a South Indian mother and a Venezuelan father, Lopez lived with her parents in Caracas until age 14, when the family returned to the US. While still in high school in Brooklyn, she was cast on Sesame Street (1969) as Mercedes, Maria's cousin, a role she played for two seasons before being accepted to Yale University, where she double majored in Philosophy and Theatre Studies. She trained at the Herbert Berghof Studio in New York, with Jerzy Grotovski (Objective Drama Workship, Yale/UC Irvine), Juan Carlos Corraza (Madrid, Spain) and Sanford Meisner, both in his masterclass (three years) and his director's lab (one year; Bequia, St. Vincent; Los Angeles). Lopez has worked as an actor in feature films including Born in East L.A. (1987), Deep Cover (1992), The Burning Season: The Chico Mendes Story (1994) (winner of two Emmys, three Golden Globes and the Humanitas Prize), Clear and Present Danger (1994), Lightning Jack (1994) and I Heart Huckabees (2004). She has guest-starred in television shows including Medium (2005), 24 (2001), Alias (2001), NYPD Blue (1993), Hill Street Blues (1981), Miami Vice (1984), 21 Jump Street (1987) (winner of the Imagen Award). She hosted the PBS series Wired Science (2007), a production of KCET Los Angeles in association with Wired Magazine. In 1995 Lopez formed the production company Heroica Films with the mission to write, direct and produce media for women, about women and utilizing women both in front and behind the camera. Since then Lopez and Heroica Films have produced, directed and written many short films, several features, film festivals, podcasts and virtual internet media campaigns. Her feature directorial debut, A Single Woman (2008), about the life of Congresswoman Janette Rankin, won the 2009 Exceptional Merit in Media Award from the National Women's Political Caucus. Lopez is a fellow of Film Independents Director's Lab as well as their Writer's Lab. In 2009 she was given a retrospective of her work, both as an actor and director, at the Museum of Latin American Art (MOLAA). She has served on the Board of Directors of Young Artists United as well as the Jury and Advisory Board of The Women's International Film and TV Showcase. She is the Founding Director of GlobalGirl Media's Los Angeles Bureau, which nurtures the voices and self-expression of girls in under-served communities worldwide, training them to become citizen broadcast journalists. She is the VP of Media for the National Organization for Women (Pacific Shore) and founder and Executive Director of The E.R.A. Education Project, a non-profit initiative to raise awareness about the need to ratify the Equal Rights Amendment. Lopez collaborated with the Mayor's Office in his Parnership for L.A. Schools in South Central Los Angeles as well as working with H.E.A.R.T., the LAUSD's Gang and Crime Prevention Unit. She is presently on the Board of Directors of Girls and Gangs, the only organization advocating for girls in the L.A. County Juvenile Justice system. She is an official blogger for the Huffington Post and a Scholar of the Aspen Institute's Ideas Festival. She is the recipient of the 2011 Woman of Courage Award from the National Women's Political Caucus given to women from diverse backgrounds who have demonstrated courage by taking a stand to further civil rights and equality, and who exemplify women's leadership. Lopez's short film \"Ese Beso\" won the Audience Award at the Boyle Heights International Latina Film Festival in 2012. In May she was named one of the 21 Leaders for the 21st Century by Women's eNews.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMDg3NDAwOV5BMl5BanBnXkFtZTgwNzA1MTU2MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0520234","name":"Kamala Lopez","idIMDB":"nm0520234"},"actorId":"nm0520234","character":"Ilzamar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Luis Guzmán","urlProfile":"http://www.imdb.com/name/nm0350079","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYyNjIyOTU2NF5BMl5BanBnXkFtZTcwODk3ODcxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1956","placeOfBirth":" Cayey, Puerto Rico","height":"5' 7½\" (1.71 m)","bio":"Actor of Puerto Rican descent who made many memorable films in the 1980s due to his villainous persona. Presently resides with his wife and many kids in Vermont.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYyNjIyOTU2NF5BMl5BanBnXkFtZTcwODk3ODcxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0350079","name":"Luis Guzmán","idIMDB":"nm0350079"},"actorId":"nm0350079","character":"Estate Boss","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nigel Havers","urlProfile":"http://www.imdb.com/name/nm0369814","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU0Njc5MTYwNF5BMl5BanBnXkFtZTcwOTc5NTczNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 November 1949","placeOfBirth":" London, England, UK","birthName":"Nigel Allan Havers","height":"5' 10\" (1.78 m)","bio":"Nigel Havers was born on November 6, 1949 in London, England as Nigel Allan Havers. He is an actor and director, known for Chariots of Fire (1981), Empire of the Sun (1987) and Coronation Street (1960). He has been married to Georgiana Bronfman since June 2007. He was previously married to Polly Williams and Carolyn Cox.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU0Njc5MTYwNF5BMl5BanBnXkFtZTcwOTc5NTczNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0369814","name":"Nigel Havers","idIMDB":"nm0369814"},"actorId":"nm0369814","character":"Steven Kaye","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tomas Milian","urlProfile":"http://www.imdb.com/name/nm0587401","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2Y1NDJiZWUtM2MxOS00Nzk0LWI3OGEtNjFkMTQ4YzVjYTJiL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 March 1933","placeOfBirth":" Havana, Cuba","birthName":"Tomás Quintín Rodríguez Milián","height":"6' (1.83 m)","bio":"Tomas Milian, an American actor born in Cuba; was trained at the Actors Studio. He appeared in a few plays on Broadway, as well as in a show by Jean Cocteau in Spoleto. Mauro Bolognini noticed him and that was the starting point of a rich cinematographic career in Italy, where he played in all manner of genres. He interpreted a mad psychopath in The Ugly Ones (1966) (aka \"Bounty Killer\"), a role he would then improve and diversify into an impressive gallery of neurotic and sadistic killers, first in \"spaghetti westerns\" (many directed by Sergio Corbucci), and then in violent action and police thrillers (many directed by Umberto Lenzi). His films gradually evolved into action comedies, as he played the recurrent characters of thief \"Er Monnezza\" and cop Nico Giraldi (the latter being originally based on the lead character in Serpico (1973)), two typically Roman characters who enjoyed great popularity in the '70s and '80s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2Y1NDJiZWUtM2MxOS00Nzk0LWI3OGEtNjFkMTQ4YzVjYTJiL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0587401","name":"Tomas Milian","idIMDB":"nm0587401"},"actorId":"nm0587401","character":"Darli Alves","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Esai Morales","urlProfile":"http://www.imdb.com/name/nm0005246","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExODI3NzM1OV5BMl5BanBnXkFtZTcwNjI1NzMzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1962","placeOfBirth":" Brooklyn, New York, USA","birthName":"Esai Manuel Morales","height":"5' 10\" (1.78 m)","bio":"Award-winning actor Esai Morales is a graduate of New York's High School for the Performing Arts, began his acting career on the stage, firstly appearing in El Hermano at the Ensemble Theatre Studio and at New York's Shakespeare Festival In The Park in The Tempest. He had his feature film debut in Bad Boys and his breakthrough role in La Bamba made him a star, contributing to making the film the most commercially successful Latino-themed Rock biopic of all time. To this day, his role as Bob Morales continues to uptrend in major social media sites. In 1997 Esai Morales co-founded the National Hispanic Foundation for the Arts, created to advance the presence of Latinos in the media, telecommunications and entertainment industries. The NHFA has provided scholarships to hundreds of Hispanic students in excess of 1 million dollars. Theater performances include Oscar Wilde's Salome with Al Pacino (Broadway) Joe Papp's production of The Tempest with Raul Julia (New York's Shakespeare in the Park Festival) Tamer of Horses (Los Angeles Theater Center) The Exonerated, directed by Bob Balaban and his musical theater debut on The Mambo Kings. Film credits include Bad Boys, La Bamba, Rapa Nui, Mi Familia, Fast Food Nation, Paid in Full, The Line, Atlas Shrugged: Part II, Jarhead II: Field of Fire, The Disappearance of Garcia Lorca and Gun Hill Road a film he starred and executive produced. The film was a grand Jury Nominee at the Sundance Film Festival in 2011. Television credits comprise the Emmy award-winning series NYPD BLUE (ABC) Resurrection Blvd (Showtime) American Family (PBS) Miami Vice (NBC) Fame (NBC) Law and Order: SVU (NBC) The Burning Season: The Chico Mendes Story (HBO) Vanished (FOX) Burn Notice (USA) Jericho (CBS) Caprica (Syfy) Fairly Legal (USA) Criminal Minds (CBS) Major Crimes (TNT) and Saving Westbrook High. Currently, Morales plays the role of President of The United States on The Brink, HBO's new dark comedy about a geo-political crisis.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExODI3NzM1OV5BMl5BanBnXkFtZTcwNjI1NzMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005246","name":"Esai Morales","idIMDB":"nm0005246"},"actorId":"nm0005246","character":"Jair","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edward James Olmos","urlProfile":"http://www.imdb.com/name/nm0001579","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzODQzODQ4OF5BMl5BanBnXkFtZTcwMDczMTkxNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1947","placeOfBirth":" Los Angeles, California, USA","height":"5' 8½\" (1.74 m)","bio":"Edward James Olmos was born in Los Angeles, California, to Eleanor (Huizar) and Pedro Olmos, who was a mail carrier and welder. His family was of Mexican descent. If Olmos had followed the first love of his life, he would have been a professional baseball player. But by age 13, another love entered his life: rock music. By age 15, he was already an experienced rock singer, forming and reforming several \"garage bands\" along the way. During the late 1960s and early 1970s, he played the most famous clubs on Sunset Strip, including Gazzarri's and The Factory. But a friend suggested that, with his flair for the dramatic, he consider a career in acting. Throughout the 1970s, he divided his time between rock music gigs, acting classes, bit parts in television, Off-off-off Broadway plays and his business of moving fine furniture (which kept body, soul and family together). His first big break was a starring role in Luis Valdez's play, \"Zoot Suit\", in 1978. The play moved to Broadway and led to a Tony Award nomination and great critical acclaim. Perhaps best known for his role as Lt. Martin Castillo in the NBC television series Miami Vice (1984) (1984-1989), Olmos has been seen in numerous film and television productions. He received an Academy Award nomination for Best Actor for his starring role in Stand and Deliver (1988). Most notable of his recent offerings is American Me (1992), which was also his directing debut. But acting, directing and screenwriting are only parts of what he does. Olmos contends he would much rather be known as an activist than an actor. He devotes much of his time to causes, particularly those focusing on the needs and rights of children. He makes, on average, some 150 personal appearances a year to places where he can reach kids at risk; juvenile halls, detention centers, boys/girls clubs, schools. Anywhere he can get across his message that \"we all have a choice\" about where life takes us. Olmos stresses the importance of education, the risks of gang life and tries to promote the notion of taking responsibility for one's own actions and one's own happiness in life. Using his own \"disadvantaged background\" as an example (he grew up in East Los Angeles, infamous for its gang problems), he tells the kids, \"If I can do it, so can you\". And he tries to point them in a positive direction. He has served as an ambassador for UNICEF and has received numerous accolades for his activism. He will long be remembered for getting out in the thick of the Los Angeles Riots of 1992 with his broom: one calm, reasonable presence in the midst of chaos and gunfire. Edward James Olmos was married to actress Lorraine Bracco. Between them they have 6 children, ages 10 - 25.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzODQzODQ4OF5BMl5BanBnXkFtZTcwMDczMTkxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001579","name":"Edward James Olmos","nicknames":["EJO","Ed","Eddie"],"idIMDB":"nm0001579"},"actorId":"nm0001579","character":"Wilson Pinheiro","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony Plana","urlProfile":"http://www.imdb.com/name/nm0686470","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzU0OTExNF5BMl5BanBnXkFtZTcwODczOTY4MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 April 1952","placeOfBirth":" Havana, Cuba","birthName":"Jose Antonio Plana","height":"5' 5½\" (1.66 m)","bio":"Tony Plana was born on April 19, 1952 in Havana, Cuba as Jose Antonio Plana. He is an actor and director, known for Ugly Betty (2006), Goal! The Dream Begins (2005) and Primal Fear (1996). He is married to Ada Maris. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzU0OTExNF5BMl5BanBnXkFtZTcwODczOTY4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0686470","name":"Tony Plana","idIMDB":"nm0686470"},"actorId":"nm0686470","character":"Galvao","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marco Rodríguez","urlProfile":"http://www.imdb.com/name/nm0735424","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NjI1MjkwNV5BMl5BanBnXkFtZTcwMzY4NTA2OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 July 1953","placeOfBirth":" Los Angeles, California, USA","height":"5' 11\" (1.8 m)","bio":"Marco Rodriguez is a film, television, and stage actor. Marco received his Bachelor of Arts degree from the University of Southern California and trained with notable acting coaches, Jeff Corey and Jose Quintero. After a short stint as a teacher in the Lausd, Rodriguez embarked on a professional acting career with his debut as \"El Pachuco\" in the Mark Taper Forum production of Zoot Suit and then toured Europe with Luis Valdez' Teatro Campesino. While at the Taper, Marco joined the Improvisational Theatre Project (now known as P.l.a.y.) collaborating on the critically acclaimed play School Talk. Other writing projects include the award-winning Espernaza Del Valle for the Office of Substance Abuse Prevention (Osap) and Natividad, a solo Christmas play in Spanish. Rodriguez is also a founding member of the East Los Angeles. Classic Theatre, an organization dedicated to exposing disadvantaged youth to classic dramatic literature and the theatrical experience. In 1998, Marco founded Dejando Huellas (Leaving a Mark), a bilingual drama outreach program including coaching, workshops and performance opportunities for the under served Latino population. Since 2007, Marco has also been involved as a lead teaching artist with the acclaimed Los Angeles theatre company, About Productions, and its innovative educational programming that introduces at-risk youth to the importance of writing and the power of communication through artistic expression, facilitated dialogue and live performance.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NjI1MjkwNV5BMl5BanBnXkFtZTcwMzY4NTA2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0735424","name":"Marco Rodríguez","idIMDB":"nm0735424"},"actorId":"nm0735424","character":"Tavora","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carlos Carrasco","urlProfile":"http://www.imdb.com/name/nm0140033","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODk4OTA3MDI0NF5BMl5BanBnXkFtZTgwMDM2MTM0ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 April 1948","placeOfBirth":" Panama City, Panama","bio":"Born in Panama City, Panama, Carlos traveled to the United States on an acting scholarship to Stephens College in Columbia, Missouri. After subsequent study at the University of Illinois and Wayne State University in Detroit, he began his professional career in New York, making his Broadway debut in the Circle-in-the-Square's production of \"The National Health.\" Extensive stage work followed, including appearances at many of the country's regional theaters such as the Hartford Stage Company, Atlanta's Alliance Theater and Los Angeles' Mark Taper Forum. Pursuing a parallel career in arts administration, Carlos has been Executive Director of the Hispanic Organization of Latin Actors in New York, a panelist for the New York State Council on the Arts and a co-director of the JACK Arts Ensemble based in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODk4OTA3MDI0NF5BMl5BanBnXkFtZTgwMDM2MTM0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0140033","name":"Carlos Carrasco","idIMDB":"nm0140033"},"actorId":"nm0140033","character":"Helio","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jonathan Carrasco","urlProfile":"http://www.imdb.com/name/nm0140057","urlPhoto":"","biography":{"bio":"Jonathan Carrasco is an actor, known for Kazaam (1996), The Burning Season: The Chico Mendes Story (1994) and It Came from Outer Space II (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0140057","name":"Jonathan Carrasco","idIMDB":"nm0140057"},"actorId":"nm0140057","character":"Genesio","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeffrey Licon","urlProfile":"http://www.imdb.com/name/nm0509131","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3OTQ1NjQxMl5BMl5BanBnXkFtZTYwNTcwMDc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 August 1985","placeOfBirth":" Los Angeles, California, USA","birthName":"Jeffrey Peter Basil Licon","height":"5' 6\" (1.68 m)","bio":"Jeffrey Licon was born on August 29, 1985 in Los Angeles, California, USA as Jeffrey Peter Basil Licon. He is an actor, known for Mysterious Skin (2004), The Brothers Garcia (2000) and Alien Raiders (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3OTQ1NjQxMl5BMl5BanBnXkFtZTYwNTcwMDc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0509131","name":"Jeffrey Licon","nicknames":["Jeff"],"idIMDB":"nm0509131"},"actorId":"nm0509131","character":"Young Chico Mendes","urlCharacter":"http://www.imdb.com/character/ch0435130","main":true},{"actorName":"José Pérez","urlProfile":"http://www.imdb.com/name/nm0673526","urlPhoto":"","biography":{"dateOfBirth":"1940","placeOfBirth":" New York City, New York, USA","bio":"José Pérez was born in 1940 in New York City, New York, USA. He is an actor, known for The Mask of Zorro (1998), The Way of the Gun (2000) and Miami Blues (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0673526","name":"José Pérez","idIMDB":"nm0673526"},"actorId":"nm0673526","character":"Moacir","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0109351","urlIMDB":"http://www.imdb.com/title/tt0109351","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["2 hr 3 min (123 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"7.3","filmingLocations":[{"location":"Mexico"}],"rated":"R","awards":[{"award":"Golden Globes, USA 1995","titlesAwards":[{"titleAwardOutcome":"Won Golden Globe","categories":[{"category":"Best Miniseries or Motion Picture Made for Television","names":[]},{"category":"Best Performance by an Actor in a Miniseries or Motion Picture Made for Television","names":[{"name":"Raul Julia","id":"nm0000471","role":null}]},{"category":"Best Performance by an Actor in a Supporting Role in a Series, Miniseries or Motion Picture Made for Television","names":[{"name":"Edward James Olmos","id":"nm0001579","role":null}]}]},{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Performance by an Actress in a Supporting Role in a Series, Miniseries or Motion Picture Made for Television","names":[{"name":"Sonia Braga","id":"nm0000968","role":null}]}]}]},{"award":"Primetime Emmy Awards 1995","titlesAwards":[{"titleAwardOutcome":"Won Primetime Emmy","categories":[{"category":"Outstanding Individual Achievement in Directing for a Miniseries or a Special","names":[{"name":"John Frankenheimer","id":"nm0001239","role":null}]},{"category":"Outstanding Lead Actor in a Miniseries or a Special","names":[{"name":"Raul Julia","id":"nm0000471","role":null}]}]},{"titleAwardOutcome":"Nominated Primetime Emmy","categories":[{"category":"Outstanding Supporting Actor in a Miniseries or a Special","names":[{"name":"Edward James Olmos","id":"nm0001579","role":null}]},{"category":"Outstanding Supporting Actress in a Miniseries or a Special","names":[{"name":"Sonia Braga","id":"nm0000968","role":null}]},{"category":"Outstanding Made for Television Movie","names":[{"name":"David Puttnam","id":"nm0701298","role":"executive producer"},{"name":"John Frankenheimer","id":"nm0001239","role":"producer"},{"name":"Thomas M. Hammel","id":"nm0358411","role":"producer"},{"name":"Diane Batson-Smith","id":"nm0061253","role":"co-producer"}]},{"category":"Outstanding Writing for a Miniseries or a Special","names":[{"name":"William Mastrosimone","id":"nm0557895","role":null},{"name":"Michael Tolkin","id":"nm0866062","role":null},{"name":"Ron Hutchinson","id":"nm0404396","role":null}]}]}]},{"award":"Screen Actors Guild Awards 1995","titlesAwards":[{"titleAwardOutcome":"Won Actor","categories":[{"category":"Outstanding Performance by a Male Actor in a TV Movie or Miniseries","names":[{"name":"Raul Julia","id":"nm0000471","role":null}]}]}]},{"award":"American Cinema Editors, USA 1995","titlesAwards":[{"titleAwardOutcome":"Nominated Eddie","categories":[{"category":"Best Edited Motion Picture for Non-Commercial Television","names":[{"name":"Françoise Bonnot","id":"nm0095089","role":null},{"name":"Paul Rubell","id":"nm0747824","role":null}]}]}]},{"award":"CableACE Awards 1995","titlesAwards":[{"titleAwardOutcome":"Won CableACE","categories":[{"category":"Actor in a Movie or Miniseries","names":[{"name":"Raul Julia","id":"nm0000471","role":null},{"name":"Home Box Office (HBO)","id":null,"role":null}]},{"category":"Directing a Movie or Miniseries","names":[{"name":"John Frankenheimer","id":"nm0001239","role":null},{"name":"Home Box Office (HBO)","id":null,"role":null}]}]},{"titleAwardOutcome":"Nominated CableACE","categories":[{"category":"Movie or Miniseries","names":[{"name":"David Puttnam","id":"nm0701298","role":"executive producer"},{"name":"John Frankenheimer","id":"nm0001239","role":"producer/director"},{"name":"Thomas M. Hammel","id":"nm0358411","role":"producer"},{"name":"Diane Batson-Smith","id":"nm0061253","role":"producer"},{"name":"Ron Hutchinson","id":"nm0404396","role":"writer"},{"name":"Home Box Office (HBO)","id":null,"role":null}]},{"category":"Editing a Dramatic Special or Series/Theatrical Special/Movie or Miniseries","names":[{"name":"Françoise Bonnot","id":"nm0095089","role":null},{"name":"Home Box Office (HBO)","id":null,"role":null}]}]}]},{"award":"Casting Society of America, USA 1995","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Best Casting for TV Movie of the Week","names":[{"name":"Junie Lowry-Johnson","id":"nm0523381","role":null}]}]}]},{"award":"Environmental Media Awards, USA 1995","titlesAwards":[{"titleAwardOutcome":"Won EMA Award","categories":[{"category":"Made for TV Movie / Miniseries","names":[]}]}]},{"award":"Humanitas Prize 1995","titlesAwards":[{"titleAwardOutcome":"Won Humanitas Prize","categories":[{"category":"PBS/Cable Category","names":[{"name":"William Mastrosimone","id":"nm0557895","role":null},{"name":"Michael Tolkin","id":"nm0866062","role":null}]}]}]}],"votes":"545","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0119786","name":"HBO Pictures"}],"keywords":{"keywords":["non violent resistance","resistance","environmental crime","logging","deforestation","environmental destruction","environmental issue","nature conservation","eco activist","political murder","female nudity","union leader","political corruption","female full frontal nudity","electrocution","election","christ allegory","chainsaw","burned alive","bribery","1950s","rain forest","1980s","ecology","assassination","sadism","union","gun","environmental","forest","melodrama","torture","based on true story","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:37:33"}}