{"data":{"movies":[{"title":"Cold Comfort Farm","originalTitle":"","year":"1995","releaseDate":"19960510","directors":[{"name":"John Schlesinger","id":"nm0772259"}],"writers":[{"name":"Malcolm Bradbury","id":"nm0102903"},{"name":"Stella Gibbons","id":"nm0316599"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNDY3MTA2Ml5BMl5BanBnXkFtZTYwMzU3NTU5._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"In England in the early 1930's, 20 year old Flora Poste, recently orphaned and left with only 100 pounds a year, goes to stay with distant relatives on Cold Comfort Farm. Everyone on the gloomy farm is completely around the twist, but Flora tries to sort everything out...","simplePlot":"In England in the early 1930's, 20 year old Flora Poste, recently orphaned and left with only 100 pounds a year, goes to stay with distant relatives on Cold Comfort Farm. Everyone on the ... ","actors":[{"actorName":"Eileen Atkins","urlProfile":"http://www.imdb.com/name/nm0040586","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0ODU4MTQ3Ml5BMl5BanBnXkFtZTcwMzg0MzMwMg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1934","placeOfBirth":" Clapton, London, England, UK","birthName":"Eileen June Atkins","height":"5' 6½\" (1.69 m)","bio":"Eileen Atkins was born in a Salvation Army Women's Hostel in north London. Her father was a gas meter reader; her mother, a seamstress and barmaid. A drama teacher taught her how to drop her Cockney accent, and she studied Shakespeare and Greek tragedies. Her breakthrough role in \"The Killing of Sister George\" took her to Broadway.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0ODU4MTQ3Ml5BMl5BanBnXkFtZTcwMzg0MzMwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0040586","name":"Eileen Atkins","idIMDB":"nm0040586"},"actorId":"nm0040586","character":"Judith Starkadder","urlCharacter":"http://www.imdb.com/character/ch0025577","main":true},{"actorName":"Kate Beckinsale","urlProfile":"http://www.imdb.com/name/nm0000295","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MzY2MDYwOF5BMl5BanBnXkFtZTcwODQ3MDA0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1973","placeOfBirth":" Finsbury Park, London, England, UK","birthName":"Kathrin Romany Beckinsale","height":"5' 7\" (1.7 m)","bio":"Kate Beckinsale was born on 26 July 1973 in England, and has resided in London for most of her life. Her mother is Judy Loe, who has appeared in a number of British dramas and sitcoms and continues to work as an actress, predominantly in British television productions. Her father was Richard Beckinsale, born in Nottingham, England. He starred in a number of popular British television comedies during the 1970s, most notably the series Rising Damp (1974), Porridge (1974) and The Lovers (1970). He passed away tragically early in 1979 at the age of 31. Kate attended the private school Godolphin and Latymer School in London for her grade and primary school education. In her teens she twice won the British bookseller W.H. Smith Young Writers' competition - once for three short stories and once for three poems. After a tumultuous adolescence (a bout of anorexia - cured - and a smoking habit which continues to this day), she gradually took up the profession of acting. Her major acting debut came in a TV film about World War II called One Against the Wind (1991), filmed in Luxembourg during the summer of 1991. It first aired on American television that December. Kate began attending Oxford University's New College in the fall of 1991, majoring in French and Russian literature. She had already decided that she wanted to act, but to broaden her horizons she chose university over drama school. While in her first year at Oxford, Kate received her big break in Kenneth Branagh's film adaptation of William Shakespeare's Much Ado About Nothing (1993). Kate worked in three other films while attending Oxford, beginning with a part in the medieval historical drama Royal Deceit (1994), cast as Ethel. The film was shot during the spring of 1993 on location in Denmark, and she filmed her supporting part during New College's Easter break. Later in the summer of that year she played the lead in the contemporary mystery drama Uncovered (1994). Before she went back to school, her third year at university was spent at Oxford's study-abroad program in Paris, France, immersing herself in the French language, Parisian culture and French cigarettes. A year away from the academic community and living on her own in the French capital caused her to re-evaluate the direction of her life. She faced a choice: continue with school or concentrate on her flourishing acting career. After much thought, she chose the acting career. In the spring of 1994 Kate left Oxford, after finishing three years of study. Kate appeared in the BBC/Thames Television satire Cold Comfort Farm (1995), filmed in London and East Sussex during late summer 1994 and which opened to spectacular reviews in the United States, grossing over $5 million during its American run. It was re-released to U.K. theaters in the spring of 1997. Acting on the stage consumed the first part of 1995; she toured in England with the Thelma Holts Theatre Company production of Anton Chekhov's \"The Seagull\". After turning down several mediocre scripts \"and going nearly berserk with boredom\", she waited seven months before another interesting role was offered to her. Her big movie of 1995 was the romance/horror movie Haunted (1995), starring opposite Aidan Quinn and John Gielgud, and filmed in West Sussex. In this film she wanted to play \"an object of desire\", unlike her past performances where her characters were much less the siren and more the worldly innocent. Kate's first film project of 1996 was the British ITV production of Jane Austen's novel Emma (1996). Her last film of 1996 was the comedy Shooting Fish (1997), filmed at Shepperton Studios in London during early fall. She played the part of Georgie, an altruistic con artist. She had a daughter, Lily, in 1999 with actor Michael Sheen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MzY2MDYwOF5BMl5BanBnXkFtZTcwODQ3MDA0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000295","name":"Kate Beckinsale","idIMDB":"nm0000295"},"actorId":"nm0000295","character":"Flora Poste","urlCharacter":"http://www.imdb.com/character/ch0025572","main":true},{"actorName":"Sheila Burrell","urlProfile":"http://www.imdb.com/name/nm0123090","urlPhoto":"","biography":{"dateOfBirth":"9 May 1922","placeOfBirth":" Blackheath, London, England, UK","birthName":"Sheila Mary Burrell","height":"5' 5\" (1.65 m)","bio":"Sheila Burrell was born on May 9, 1922 in Blackheath, London, England as Sheila Mary Burrell. She was an actress, known for Cold Comfort Farm (1995), Paranoiac (1963) and Jane Eyre (1996). She was married to David Sim and Laurence Payne. She died on July 19, 2011 in Kingston upon Thames, Surrey, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0123090","name":"Sheila Burrell","idIMDB":"nm0123090"},"actorId":"nm0123090","character":"Ada Doom","urlCharacter":"http://www.imdb.com/character/ch0300379","main":true},{"actorName":"Stephen Fry","urlProfile":"http://www.imdb.com/name/nm0000410","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTEyNzc0MV5BMl5BanBnXkFtZTgwMDQwNDk0NjE@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1957","placeOfBirth":" Hampstead, London, England, UK","birthName":"Stephen John Fry","height":"6' 4½\" (1.94 m)","bio":"Writer, actor, comedian, doer of good works, excellent good friend to the famous and not, Fry lives in his London SW1 flat and his Norfolk house when not traveling. Famous for his public declaration of celibacy in the \"Tatler\" back in the 1980s, Emma Thompson has characterised her friend as \"90 percent gay, 10 percent other.\" Stephen Fry was born in Hampstead, London, to Marianne Eve (Newman) and Alan Fry, a physicist and inventor. His maternal grandparents were Hungarian Jewish immigrants, while his father's family was of English background. He grew up in Norfolk and attended Uppingham School and Stout's Hill. After his notorious three months in Pucklechurch prison for credit card fraud, he attended Queens College, Cambridge in 1979, finishing with a 2:1 in English in 1981/2. While at Cambridge, he was a member of the Cherubs drinking club, and Footlights with Thompson, Tony Slattery, Martin Bergman, and Hugh Laurie (to whom he was introduced by E.T.). His prolific writing partnership with Laurie began in 1981 with resulting Footlights revues for (among others) Mayweek, Edinburgh Festival, and a three month tour of Australia. In 1984, Fry was engaged to do the rewrite of the Noel Gay musical \"Me and My Girl,\" which made him a millionaire before the age of 30. It also earned him a nomination for a Tony award in 1987. (Sidenote: It was upon SF's suggestion that Emma Thompson landed a leading role in the London cast of this show.) Throughout the 1980s, Fry did a huge amount of television and radio work, as well as writing for newspapers (e.g. a weekly column in the \"Daily Telegraph\") and magazines (e.g. articles for \"Arena\"). He is probably best known for his television roles in Black-Adder II (1986) and Jeeves and Wooster (1990). His support of the Terence Higgins Trust through events such as the first \"Hysteria\" benefit, as well as numerous other charity efforts, are probably those works of which he is most proud. Fry's acting career has not been limited to films and television. He had successful runs in Alan Bennett's \"Forty Years On,\" Simon Gray's \"The Common Pursuit\" with John Sessions, Rik Mayall, John Gordon Sinclair, and others. Michael Frayn's \"Look Look\" and Gray's \"Cell Mates\" were less successful for both Fry and their playwrights, the latter not helped by his walking out of the play after only a couple of weeks. Fry has published four novels as well as a collection of his radio and journalistic miscellanea. He has recorded audiotapes of his novels (an unabridged version of \"The Liar\" was released in 1995), as well as many other works for both adults and children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTEyNzc0MV5BMl5BanBnXkFtZTgwMDQwNDk0NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000410","name":"Stephen Fry","idIMDB":"nm0000410"},"actorId":"nm0000410","character":"Mybug","urlCharacter":"http://www.imdb.com/character/ch0300382","main":true},{"actorName":"Freddie Jones","urlProfile":"http://www.imdb.com/name/nm0428086","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNjc3MTQxOF5BMl5BanBnXkFtZTcwMjU2ODgwMw@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1927","placeOfBirth":" Stoke-on-Trent, Staffordshire, England, UK","birthName":"Frederick Charles Jones","height":"6' 1\" (1.85 m)","bio":"The British character actor Freddie Jones came to the acting profession after 10 years of working as a laboratory assistant and acting in amateur theater on the side. To kick off his mid-life career change, Jones attended Rose Bruford College of Speech and Drama in Kent, England, on a scholarship. He then worked in repertory theater, later joining up with the Royal Shakespeare Company and gaining recognition as an actor of exceptional cleverness, intelligence and perception. His theatrical film debut came in 1967 in Peter Brook's critically acclaimed, Marat/Sade (1967). Two years later, Jones made his mark on the acting world playing \"Claudius\" in the six-part television miniseries, The Caesars (1968). Based on this performance, he was named \"The World's Best Television Actor of the Year\" at the Monte-Carlo TV Festival in 1969. Also, around this time, Jones gave one of his most touching film performances, that of the \"monster\" in Frankenstein Must Be Destroyed (1969), in which he displayed pathos reminiscent of Boris Karloff's monster. Critical acclaim led Jones to more prominent roles in television, e.g., The Ghosts of Motley Hall (1976), Children of the Stones (1977), and Pennies from Heaven (1978), as well as in film, e.g., The Man Who Haunted Himself (1970), Antony and Cleopatra (1972), All Creatures Great and Small (1975) and Zulu Dawn (1979). Jones achieved international recognition as a film actor after appearing in such Hollywood films as Clint Eastwood's Firefox (1982) and David Lynch's The Elephant Man (1980), Dune (1984) and Wild at Heart (1990). Arguably one of his most endearing roles was the frequently drunk reporter \"Orlando\" in Federico Fellini's And the Ship Sails On (1983). His theatrical acting has been especially well-suited for literary drama, e.g., Far from the Madding Crowd (1967), Nicholas Nickleby (1977), Silas Marner (1985), Screen One: Adam Bede (1992), David Copperfield (2000) and The Count of Monte Cristo (2002). Jones' eccentric, twitchy portrayals, often bordering on caricature, although sometimes criticized, have nevertheless ensured his international recognition and popularity as a character actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNjc3MTQxOF5BMl5BanBnXkFtZTcwMjU2ODgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0428086","name":"Freddie Jones","idIMDB":"nm0428086"},"actorId":"nm0428086","character":"Adam Lambsbreath","urlCharacter":"http://www.imdb.com/character/ch0025578","main":true},{"actorName":"Joanna Lumley","urlProfile":"http://www.imdb.com/name/nm0525921","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5Mjg1NDM0Nl5BMl5BanBnXkFtZTcwOTA2MTMyNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 May 1946","placeOfBirth":" Srinagar, Jammu and Kashmir, British India","birthName":"Joanna Lamond Lumley","height":"5' 8\" (1.73 m)","bio":"Joanna Lumley was born in Kashmir, India, on 1st May 1946. Her father was a major in the Gurkha Rifles, and she spent most of her early childhood in the Far East where her father was posted. An aspiring actress, she first came to fame as a model in London's swinging 1960s, where she was photographed by the greats, including her friend, the late Patrick Lichfield. She was designer Jean Muir's muse and house model for several years before carving a career as a freelance model where she became one of the top ten most-booked models of the 1960s. Lumley's breakthrough role was as Purdey in Chapeau melon et bottes de cuir (1976), a role for which over 800 girls auditioned. Purdey propelled Lumley to instant fame and created one of the \"must-have\" hairstyles of the 1970s -- the Purdey bob. Lumley became a pin-up figure for a generation of British males who grew up watching her as the high-kicking action girl. Other roles followed, most notably as Sapphire in Sapphire & Steel (1979) opposite David McCallum -- a sci-fi precursor to The X-Files (1993) and an under-rated gem of a series which has gained a cult following in recent years, despite the fact it has only ever been shown ONCE on terrestrial TV. During the 1980s, Lumley returned to the theater, making notable appearances as \"Hedda Gabler\" and as \"Elvira\" in \"Blithe Spirit\" -- a role that seems tailor-made for her. Lumley also made appearances in several films, including Trail of the Pink Panther (1982), Curse of the Pink Panther (1983), and a screen-stealing role in Shirley Valentine (1989). It was her reinvention as a comic actress in Absolutely Fabulous (1992) that shot Lumley to wider international acclaim. Her role as Patsy in Absolutely Fabulous (1992) is regarded as one of the greatest female comic performances ever, earning Lumley a stream of awards, including several BAFTAs. Since Absolutely Fabulous (1992), Lumley has cemented her role as one of the UK's most-loved & respected actresses. She is rarely off UK TV screens and has also built a successful film career as a character/voice-over actress. She recently teamed up with the writer/director Hugo Blick for the series of acclaimed monologues Up in Town (2002) which were critically regarded as the performance of a lifetime, and the recent Sensitive Skin (2005). It has been announced that she will be making a return to the stage for the first time in over a decade in 2007 in a new production of Anton Chekhov's \"The Cherry Orchard\" directed by Sir Jonathan Miller.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5Mjg1NDM0Nl5BMl5BanBnXkFtZTcwOTA2MTMyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0525921","name":"Joanna Lumley","idIMDB":"nm0525921"},"actorId":"nm0525921","character":"Mrs. Mary Smiling","urlCharacter":"http://www.imdb.com/character/ch0025575","main":true},{"actorName":"Ian McKellen","urlProfile":"http://www.imdb.com/name/nm0005212","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MjgyNjk3MV5BMl5BanBnXkFtZTcwNTA3NTY5Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1939","placeOfBirth":" Burnley, Lancashire, England, UK","birthName":"Ian Murray McKellen","height":"5' 11\" (1.8 m)","bio":"Widely regarded as the one of greatest stage and screen actors both in his native Great Britain and internationally, twice nominated for the Oscar and recipient of every major theatrical award in UK and US, Ian Murray McKellen was born on May 25, 1939 in Burnley, Lancashire, England, to Margery Lois (Sutcliffe) and Denis Murray McKellen, a civil engineer. He is of Scottish, Northern Irish, and English descent. During his early childhood, his parents moved with Ian and his sister Jean to the mill town of Wigan. It was in this small town that young Ian rode out World War II. He soon developed a fascination with acting and the theater, which was encouraged by his parents. They would take him to plays, those by William Shakespeare, in particular. The amateur school productions fostered Ian's growing passion for theatre. When Ian was of age to begin attending school, he made sure to get roles in all of the productions. At Bolton School in particular, he developed his skills early on. Indeed, his first role in a Shakespearian play was at Bolton, as Malvolio in \"Twelfth Night\". Ian soon began attending Stratford-upon-Avon theater festivals, where he saw the greats perform: Laurence Olivier, Wendy Hiller, John Gielgud, Ralph Richardson and Paul Robeson. He continued his education in English Drama, but soon it fell by the wayside as he concentrated more and more on performing. He eventually obtained his Bachelor of Arts in 1961, and began his career in earnest. McKellen began working in theatre over the next few years. Very few people knew of Ian's homosexuality; he saw no reason to go public, nor had he told his family. They did not seem interested in the subject and so he saw no reason to bring it up. In 1988, Ian publicly came out of the closet on the BBC Radio 4 program, while discussing Margaret Thatcher's \"section 28\" legislation which would make the \"public promotion of homosexuality\" a crime. It was reason enough for McKellen to take a stand, and he has been active in the Gay Rights movement ever since. Ian resides in Limehouse, where he has also lived with his former long-time partner Sean Mathias. The two men have also worked together on the film Bent (1997) as well as in acclaimed stage productions. To this day, McKellen works mostly in theater, and was knighted by Queen Elizabeth II in 1990 for his efforts in the arts. However, he has managed to make several quite successful forays into film. He has appeared in several productions of Shakespeare's works including his well received Richard III (1995), and in a variety of other movies. However, it has only been recently that his star has finally begun to shine in the eyes of North American audiences. Roles in various films, Cold Comfort Farm (1995), Apt Pupil (1998) and Gods and Monsters (1998), riveted audiences. The latter, in particular, created a sensation in Hollywood, and McKellen's role garnered him several of awards and nominations, including a Golden Globe and an Oscar nod. McKellen, as he continues to work extensively on stage, he always keeps on 'solidifying' his 'role' as Laurence Olivier's worthy 'successor' in the best sense too, such as _King Lear (2008)_ directed by Trevor Nunn and in a range of other staggering performances full of generously euphoric delight that have included \"Peter Pan\" and Noël Coward's \"Present Laughter\", as well as Samuel Beckett's \"Waiting for Godot\" and Harold Pinter's \"No Man's Land\", both in acclaimed productions brilliantly directed by Sean Mathias. McKellen found mainstream success with his performance as Magneto in X-Men (2000) and its sequels. His largest mark on the big screen may be as Gandalf in The Lord of the Rings film trilogy directed by Peter Jackson, which he reprised in The Hobbit trilogy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MjgyNjk3MV5BMl5BanBnXkFtZTcwNTA3NTY5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005212","name":"Ian McKellen","idIMDB":"nm0005212"},"actorId":"nm0005212","character":"Amos Starkadder","urlCharacter":"http://www.imdb.com/character/ch0025573","main":true},{"actorName":"Miriam Margolyes","urlProfile":"http://www.imdb.com/name/nm0546816","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwMzgxNTQzNV5BMl5BanBnXkFtZTcwNjA2MzYzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 May 1941","placeOfBirth":" Oxford, Oxfordshire, England, UK","height":"5' 1\" (1.55 m)","bio":"A veteran of stage and screen, award-winning actress Miriam Margolyes has achieved success on both sides of the Atlantic. Winner of the BAFTA Best Supporting Actress award in 1993 for The Age of Innocence (1993) she also received Best Supporting Actress at the 1989 LA Critics Circle Awards for her role in Little Dorrit (1987) and a Sony Radio Award for Best Actress on \"Radio\" in 1993. She was the voice of Fly the dog in Babe, le cochon devenu berger (1995). Major credits during her long and celebrated career include Yentl (1983), Little Shop of Horrors (1986), I Love You to Death (1990), End of Days (1999), Sunshine (1999), Cold Comfort Farm (1995), Cats & Dogs (2001), Magnolia (1999) and she was Prof. Sprout in Harry Potter and the Chamber of Secrets (2002). Most recently Margolyes appeared in Stephen Hopkins' The Life and Death of Peter Sellers (2004), Modigliani (2004), István Szabó's Adorable Julia (2004) and Ladies in Lavender (2004) (with Dames Maggie Smith and Judi Dench), which is opening at the NY Tribeca Festival on April 23rd. Most memorable TV credits include Screen Two: Old Flames (1990), Freud (1984), The Life and Loves of a She-Devil (1986), The Black Adder (1982), The Girls of Slender Means (1975), _Oliver Twist (1982) (TV)_, The History Man (1981), Vanity Fair (2004) , Supply & Demand (1997). She was Franny in the CBS sitcom Frannie's Turn (1992) and starred recently in the Miss Marple episode, \"Murder at the Vicarage\". Stage credits include \"The Vagina Monologues\", Sir Peter Hall's Los Angeles production of \"Romeo & Juliet\", \"She Stoops to Conquer\" and \"Orpheus Descending\" (all for Sir Peter Hall), \"The Killing of Sister George\", \"The Threepenny Opera\" (Tony Richardson), Michael Lindsay-Hogg's \"The White Devil\" at The Old Vic, the Bristol Old Vic production of \"The Canterbury Tales\" and her own award-winning, one-woman show, \"Dickens' Woman\". In the 2002 Queen's New Years Honours List, Her Majesty Queen Elizabeth II awarded her the OBE (Officer of the Order of the British) Empire for her services to Drama.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwMzgxNTQzNV5BMl5BanBnXkFtZTcwNjA2MzYzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0546816","name":"Miriam Margolyes","idIMDB":"nm0546816"},"actorId":"nm0546816","character":"Mrs. Beetle","urlCharacter":"http://www.imdb.com/character/ch0300380","main":true},{"actorName":"Rufus Sewell","urlProfile":"http://www.imdb.com/name/nm0001722","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NDI2MzIwMF5BMl5BanBnXkFtZTcwNTIyNTY0Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1967","placeOfBirth":" Twickenham, Middlesex, England, UK","birthName":"Rufus Frederick Sewell","height":"6' (1.83 m)","bio":"Rufus Sewell was born on the 29th of October 1967 in Twickenham, England. His mother, Jo, was Welsh, and was an artist and painter. His father, Bill, was an Australian animator who died when Rufus was 10. He has one brother, Caspar. He attended London's Central School of Speech and Drama and left in June of 1989 after completing three years of training. He made his London Stage debut in \"Making It Better\" for which he won the \"Best Newcomer Award\"; he also originated the role of Septimus Hodge in Tom Stoppards \"Arcadia\" and was nominated for an Oliver Award. On the Broadway stage, he debuted in \"Translations\" and received the Broadway Theater World Award. His film work has been has been equally varied and acclaimed from the junkie in Twenty-One (1991), the sweet bus driver in A Man of No Importance (1994), and the volatile artist in Carrington (1995). The lustful son in Cold Comfort Farm (1995), the protagonist hounded Dostoevsky-like in Dark City (1998), the star-crossed suitor in Dangerous Beauty (1998), to the the bitter, acidic, alcoholic cokehead of The Very Thought of You (1998), he has appeared in some of the most acclaimed theatre, film and television productions.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NDI2MzIwMF5BMl5BanBnXkFtZTcwNTIyNTY0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001722","name":"Rufus Sewell","nicknames":["Roof"],"idIMDB":"nm0001722"},"actorId":"nm0001722","character":"Seth Starkadder","urlCharacter":"http://www.imdb.com/character/ch0025574","main":true},{"actorName":"Ivan Kaye","urlProfile":"http://www.imdb.com/name/nm0443321","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MjMyNTgwOV5BMl5BanBnXkFtZTgwNjU5MTYzMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 4\" (1.93 m)","bio":"Ivan Blakeley Kaye was born on 1st July 1961 and made his stage debut at Sadlers Wells in 1980 in 'Charlie and the Chocolate Factory; as Willie Wonka, appearing throughout the 1980s with the National Theatre in 'The Changeling', 'Ghetto' and The Magic Olympic Games, as well as West End performances in 'The Rocky Horror Show' at the Piccadilly Theatre as Eddie and Dr Scott, 'Serious Money' at Wyndhams and 'A View From the Bridge' at Bristol Old Vic, transferring to the Strand. In 1992 he made his television leading role in the name part of detective drama 'Sam Saturday' and has since been seen as star-struck Reuben Starkadder in 'Cold Comfort Farm', a duplicitous spouse in 'Bad Girls'. an initially questionable doctor in 'East Enders' and dim farm-hand Bryan in sitcom 'Green, Green Grass' in addition to period pieces 'The Borgias' and 'Vikings' in less than sympathetic mode. (On his Twitter page he describes himself as Villain for Hire.) He is also a founder and director of Comedy Ink Productions with actor/writer Douglas McFerran (born May 1958) producing short comedic offerings such as the 'Witchcraft in Suburbia' series and is a supporter of the Hounslow Urban Farm (where 'Green Green Grass was partially filmed) and, with several other actors, the Justice for Andrew campaign, seeking justice for the murder of a young Liverpudlian. Married to Lesley and living in Oxfordshire Mr Kaye has a daughter Eve.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MjMyNTgwOV5BMl5BanBnXkFtZTgwNjU5MTYzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0443321","name":"Ivan Kaye","idIMDB":"nm0443321"},"actorId":"nm0443321","character":"Reuben Starkadder","urlCharacter":"http://www.imdb.com/character/ch0025576","main":true},{"actorName":"Jeremy Peters","urlProfile":"http://www.imdb.com/name/nm0676500","urlPhoto":"","biography":{"height":"6' 3\" (1.9 m)","bio":"Jeremy Peters is an actor, known for Cold Comfort Farm (1995), The Return of the Native (1994) and Mark of Lilith (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0676500","name":"Jeremy Peters","idIMDB":"nm0676500"},"actorId":"nm0676500","character":"Urk","urlCharacter":"http://www.imdb.com/character/ch0025583","main":true},{"actorName":"Maria Miles","urlProfile":"http://www.imdb.com/name/nm0587188","urlPhoto":"","biography":{"bio":"Maria Miles is an actress, known for Cold Comfort Farm (1995), Kafka (1991) and Luther (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0587188","name":"Maria Miles","idIMDB":"nm0587188"},"actorId":"nm0587188","character":"Elfine Starkadder","urlCharacter":"http://www.imdb.com/character/ch0025580","main":true},{"actorName":"Christopher Bowen","urlProfile":"http://www.imdb.com/name/nm0100817","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ1MDcwNzQ4OF5BMl5BanBnXkFtZTgwMzc2NjExOTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Christopher Bowen is an actor, known for Tomorrow Never Dies (1997), Richard III (1995) and Cold Comfort Farm (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ1MDcwNzQ4OF5BMl5BanBnXkFtZTgwMzc2NjExOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0100817","name":"Christopher Bowen","idIMDB":"nm0100817"},"actorId":"nm0100817","character":"Charles Fairford","urlCharacter":"http://www.imdb.com/character/ch0025579","main":true},{"actorName":"Louise Rea","urlProfile":"http://www.imdb.com/name/nm0713755","urlPhoto":"","biography":{"bio":"Louise Rea is an actress, known for Cold Comfort Farm (1995), Ghosts (1995) and Dalziel and Pascoe (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0713755","name":"Louise Rea","idIMDB":"nm0713755"},"actorId":"nm0713755","character":"Meriam Beetle","urlCharacter":"http://www.imdb.com/character/ch0025581","main":true},{"actorName":"Sophie Revell","urlProfile":"http://www.imdb.com/name/nm0720808","urlPhoto":"","biography":{"bio":"Sophie Revell is an actress, known for Cold Comfort Farm (1995) and Strange But True? (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0720808","name":"Sophie Revell","idIMDB":"nm0720808"},"actorId":"nm0720808","character":"Rennet","urlCharacter":"http://www.imdb.com/character/ch0025582","main":true}],"seasons":[],"idIMDB":"tt0112701","urlIMDB":"http://www.imdb.com/title/tt0112701","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":[{"money":"3,601","country":"Netherlands","day":"31","month":"12","year":"1998","remarks":""},{"money":"3,520","country":"Netherlands","day":"01","month":"01","year":"1998","remarks":""}],"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 35 min (95 min)"],"soundMix":["Stereo"],"color":["Black and White","Color"],"aspectRatio":["1.66 : 1"],"camera":null,"laboratory":null,"filmLength":["2,902 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.3","metascore":"82","filmingLocations":[{"location":"London, England, UK"}],"rated":"PG","awards":[{"award":"BAFTA Awards 1996","titlesAwards":[{"titleAwardOutcome":"Won BAFTA TV Award","categories":[{"category":"Best Make Up/Hair","names":[{"name":"Dorka Nieradzik","id":"nm0631218","role":null}]}]}]},{"award":"Banff Television Festival 1995","titlesAwards":[{"titleAwardOutcome":"Won Banff Rockie Award","categories":[{"category":"Best Made-for-TV Movie","names":[]}]}]},{"award":"International Emmy Awards 1996","titlesAwards":[{"titleAwardOutcome":"Nominated Emmy","categories":[{"category":"Drama","names":[]}]}]},{"award":"Satellite Awards 1997","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Satellite Award","categories":[{"category":"Best Motion Picture, Comedy or Musical","names":[{"name":"Alison Gilby","id":"nm0318336","role":null},{"name":"Joanna Gueritz","id":"nm0345953","role":null},{"name":"Antony Root","id":"nm0740501","role":null}]},{"category":"Best Actor in a Supporting Role in a Motion Picture, Comedy or Musical","names":[{"name":"Ian McKellen","id":"nm0005212","role":null}]}]}]},{"award":"USC Scripter Award 1997","titlesAwards":[{"titleAwardOutcome":"Nominated USC Scripter Award","categories":[{"category":"","names":[{"name":"Malcolm Bradbury","id":"nm0102903","role":"screenwriter"},{"name":"Stella Gibbons","id":"nm0316599","role":"author"}]}]}]}],"votes":"5,785","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0103694","name":"BBC Films"},{"idCompany":"co0043107","name":"British Broadcasting Corporation (BBC)"},{"idCompany":"co0103745","name":"Thames International"}],"keywords":{"keywords":["farm","secret","strong female lead","strong female character","charleston the dance","charleston dance","flapper","pipe organ","sexual attraction","poetry","orphan","leaving home","inheritance","female writer","female lead","dancing","family relationships","writer","wedding","wedding reception","unwed pregnancy","train","sussex england","sermon","railway station","pub","prologue","premarital sex","preacher","nightclub","movie producer","mother son relationship","mother daughter relationship","milking","matriarch","marriage proposal","makeover","london england","infatuation","houseguest","grandmother","fish out of water","farce","cow","cousin cousin relationship","correspondence","church","cemetery","birth","birth control","biplane","1920s","class differences","farm worker","rural setting","based on novel","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:46:27"}}