{"data":{"movies":[{"title":"The Disappearance of Kevin Johnson","originalTitle":"","year":"1996","releaseDate":"19970725","directors":[{"name":"Francis Megahy","id":"nm0576283"}],"writers":[{"name":"Francis Megahy","id":"nm0576283"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzAwNjkzNTA0NF5BMl5BanBnXkFtZTcwNDE2NzcxMQ@@._V1.jpg","countries":["USA","UK"],"languages":["English"],"genres":["Comedy"],"plot":"Mockumentary about the unexplained disappearance of a fictitious up-and-coming movie producer.","simplePlot":"Mockumentary about the unexplained disappearance of a fictitious up-and-coming movie producer.","actors":[{"actorName":"Pierce Brosnan","urlProfile":"http://www.imdb.com/name/nm0000112","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMjMxNzM4OV5BMl5BanBnXkFtZTcwNDM5NzkxMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1953","placeOfBirth":" Drogheda, County Louth, Ireland","birthName":"Pierce Brendan Brosnan","height":"6' 2\" (1.88 m)","bio":"Pierce Brendan Brosnan was born in Drogheda, County Louth, Ireland, to May (Smith), a nurse, and Thomas Brosnan, a carpenter. He lived in Navan, County Meath, until he moved to England, UK, at an early age (thus explaining his ability to play men from both backgrounds convincingly). His father left the household when Pierce was a child and although reunited later in life, the two have never had a close relationship. His most popular role is that of British secret agent James Bond. The death, in 1991, of Cassandra Harris, his wife of eleven years, left him with three children - Christopher and Charlotte from Cassandra's first marriage and Sean from their marriage. Since her death, he has had two children with his second wife, Keely Shaye Brosnan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMjMxNzM4OV5BMl5BanBnXkFtZTcwNDM5NzkxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000112","name":"Pierce Brosnan","idIMDB":"nm0000112"},"actorId":"nm0000112","character":"Pierce Brosnan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Coburn","urlProfile":"http://www.imdb.com/name/nm0000336","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNTg3Njg4M15BMl5BanBnXkFtZTcwOTI1ODE1NA@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 August 1928","placeOfBirth":" Laurel, Nebraska, USA","birthName":"James Harrison Coburn Jr.","height":"6' 2\" (1.88 m)","bio":"Lanky, charismatic and versatile actor with an amazing grin that put everyone at ease, James Coburn studied acting at UCLA, and then moved to New York to study under noted acting coach Stella Adler. After being noticed in several stage productions, Coburn appeared in a handful of minor westerns before being cast as the knife-throwing, quick-shooting Britt in the John Sturges mega-hit The Magnificent Seven (1960). Sturges remembered Coburn's talents when he cast his next major film project, The Great Escape (1963), where Coburn played the Australian POW Sedgewick. Regular work now came thick and fast for Coburn, including appearing in Major Dundee (1965), the first of several films he appeared in directed by Hollywood enfant terrible Sam Peckinpah. The next two years were a key period for Coburn, with his performances in the wonderful 007 spy spoof Our Man Flint (1966) and the eerie Dead Heat on a Merry-Go-Round (1966). Coburn followed up in 1967 with a Flint sequel, In Like Flint (1967), and the much underrated political satire The President's Analyst (1967). The remainder of the 1960s was rather uneventful for Coburn. However, he became associated with martial arts legend Bruce Lee and the two trained together, traveled extensively and even visited India scouting locations for a proposed film project, but Lee's untimely death (Coburn, along with Steve McQueen, was a pallbearer at Lee's funeral) put an end to that. The 1970s saw Coburn appearing again in several strong roles, starting off in Peckinpah's Pat Garrett & Billy the Kid (1973), alongside Charles Bronson in the Depression-era Hard Times (1975) and as a disenchanted German soldier on the Russian front in Peckinpah's superb Cross of Iron (1977). Towards the end of the decade, however, Coburn was diagnosed with rheumatoid arthritis, which severely hampered his health and work output for many years. After conventional treatments failed, Coburn turned to a holistic therapist, and through a restructured diet program, made a definite improvement. By the 1990s he was once again appearing regularly in both film and TV productions. No one was probably more surprised than Coburn himself when he was both nominated for, and then won, the Best Supporting Actor Award in 1997 for playing Nick Nolte's abusive and alcoholic father in Affliction (1997). At 70 years of age, Coburn's career received another shot in the arm, and he appeared in another 14 films, including Chiens des neiges (2002) and The Man from Elysian Fields (2001), before his death from a heart attack in November of 2002. Coburn's passions in life included martial arts, card playing and enjoying fine Cuban cigars!","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNTg3Njg4M15BMl5BanBnXkFtZTcwOTI1ODE1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000336","name":"James Coburn","idIMDB":"nm0000336"},"actorId":"nm0000336","character":"James Coburn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dudley Moore","urlProfile":"http://www.imdb.com/name/nm0001545","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MjY5MTQxOF5BMl5BanBnXkFtZTcwNTAxMTkwMw@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 April 1935","placeOfBirth":" Dagenham, Essex, England, UK","birthName":"Dudley Stuart John Moore","height":"5' 2½\" (1.59 m)","bio":"Dudley Moore, the gifted comedian who had at least three distinct career phases that brought him great acclaim and success, actually started out as a musical prodigy as a child. He was born in Dagenham, Essex, England, in 1935, to working class parents, Ada Francis (Hughes), an English secretary, and John Havlin Moore, a Scottish railway electrician (originally from Glasgow). Dudley won a music scholarship to Magdalen College, Oxford, to study the organ. At university, he also studied composition and became a classically trained pianist, though his forte on the piano for public performance was jazz. After graduating from Magdalen College in 1958, Moore was offered a position as organist at King's College, Cambridge, but turned it down in order to go to London and pursue a music and acting career. Fellow Oxonian Alan Bennett (Exter Colelge, B.A., Medieval History, 1957) had already recommended him to John Bassett, who was putting together a satirical comedy revue called \"Beyond The Fringe\". \"Beyond The Fringe\" was to be Moore's first brush with fame, along with co-stars Bennett, future theatrical director Jonathan Miller (now Sir Jonathan, who studied Medicine at Cambridge and was a physician), and Peter Cook, who was destined to become Moore's comic partner during the 1960s and '70s. It was Miller who had recommended Cook for \"Beyond the Fringe\", in much the same way that Bennett had bird-dogged Moore. Cook, who had studied modern languages at Cambridge, had been part of the famous Cambridge theatrical, the Footlights revue in 1959, had subsequently gone to London to star in a West End revue for Kenneth Williams, \"Pieces of Eight\". This old-fashioned review was such a success there was a sequel, \"One Over The Eight\". He was advised by his agent not to star in the fringe with the three others as he was a professional whereas they were amateurs. Ironically, the great success of \"Beyond the Fringe\", which was a new kind of satirical comedy, would doom the very old-fashioned reviews that Cook had just tasted success in. \"Beyond the Fringe\" not only won great acclaim in the UK, but it was a hit in the U.S.. The four won a special Tony Award in 1963 for their Broadway production of \"Beyond The Fringe\" and there was a television program made of the revue in 1964. Moore and Cook were offered the TV show Not Only... But Also (1965) by the BBC in 1965. Peter Cook was on as a guest. Their pairing was so successful, it enjoyed a second season in 1966 and a third in 1970. They were particularly funny as the working-class characters \"Pete\" and \"Dud\". The duo then broke into the movies, including The Wrong Box (1966) and Bedazzled (1967). In 1974, the duo won their second Tony Award for their show \"Good Night\", which was the stage version of their TV series \"Not Only... But Also\". In the mid- to late 1970s, they issued three comic albums in the guise of the characters \"Derek\" and \"Clive\" (Moore and Cook, respectively), two lavatory attendants that many viewed as reincarnations of their earlier TV characters \"Pete\" and \"Dud\". The albums, ad libbed in a recording studio while the two drank vast quantities of alcohol, were noted at the time for their obscenity. Their typical routine was a stream-of-consciousness fugue by Cook, interspersed with interjections by Moore. With their obscenity-laden, free-formed riffs, Derke and Clive presaged the more free-wheeling shock comedy of the 1980s and '90s. After marrying American actress Tuesday Weld in 1975, Moore moved to the U.S. and began a second career as a solo screen comedian, stealing the show from Chevy Chase and Goldie Hawn as the horny conductor in the movie comedy, Foul Play (1978). When George Segal dropped out of the movie 10 (1979), director Blake Edwards cast Moore in the lead role as the composer undergoing a mid-life crisis. It was a huge hit, but was surpassed by his Oscar-nominated turn as the dipsomaniac billionaire in Arthur (1981). In the early 1980s, Moore was a top box office attraction. In 1983, the National Alliance of Theater Owners named him the Top Box Office Star-Male of the Year. His career began petering out after he turned down the lead in Splash (1984), a role that helped establish Tom Hanks as a top movie comedian and position him for his transition into movie drama and super-stardom. As Hanks star waxed, Moore's star waned, and by 1985 he was reduced to playing an elf in Santa Claus: The Movie (1985), one of the all time turkeys. Even a second turn as \"Arthur\" in Arthur 2: On the Rocks (1988) couldn't revive his box office, the dependent clause of the title all too well describing his career. His TV series Dudley (1993) [TV-Series] was a bust, and the 1990s proved a wasteland for the once-honored and prosperous comedian. Moore was deeply affected by the January 1995 death of Peter Cook by a gastrointestinal hemorrhage at the age of 57. Moore organized a two-day memorial to Cook in Los Angeles that was held in November 1995. Less than four years later, in September 1999, Moore announced that he was afflicted with progressive supra-nuclear palsy, a disease for which there is no treatment. Dudley Moore was invested as a Commander of the Order of The British Empire (one step below knighthood) in June 2001. Moore personally attended the ceremony at Buckingham Palace to accept his CBE from Prince Charles, despite being unable to speak and being wheelchair-bound. He died in Watchung, New Jersey on March 27, 2002, from the pneumonia related to progressive supra-nuclear palsy. He was 66 years old. Dudley Moore was married four times, to actresses Suzy Kendall, Tuesday Weld, Brogan Lane and 'Nicole Rothschild', and had two sons, one with Tuesday Weld and one with Nicole Rothschild.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MjY5MTQxOF5BMl5BanBnXkFtZTcwNTAxMTkwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001545","name":"Dudley Moore","nicknames":["Cuddly Dudley","The Sex Thimble"],"idIMDB":"nm0001545"},"actorId":"nm0001545","character":"Dudley Moore","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexander Folk","urlProfile":"http://www.imdb.com/name/nm0284273","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5Njc5MDI5OV5BMl5BanBnXkFtZTYwMjA0MjEz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 May 1946","placeOfBirth":" Los Angeles, California, USA","bio":"Alexander Folk was born on May 30, 1946 in Los Angeles, California, USA. He is an actor, known for Dreamgirls (2006), Lost Highway (1997) and La cité des anges (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5Njc5MDI5OV5BMl5BanBnXkFtZTYwMjA0MjEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0284273","name":"Alexander Folk","idIMDB":"nm0284273"},"actorId":"nm0284273","character":"Police Detective","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bridget Baiss","urlProfile":"http://www.imdb.com/name/nm0047966","urlPhoto":"","biography":{"bio":"Bridget Baiss is an actress, known for The Disappearance of Kevin Johnson (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0047966","name":"Bridget Baiss","idIMDB":"nm0047966"},"actorId":"nm0047966","character":"Gayle Hamilton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carl Sundstrom","urlProfile":"http://www.imdb.com/name/nm0839232","urlPhoto":"","biography":{"bio":"Carl Sundstrom is an actor, known for Lost Highway (1997), Nothing to Lose (1997) and White Oleander (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0839232","name":"Carl Sundstrom","idIMDB":"nm0839232"},"actorId":"nm0839232","character":"Security Guard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Brandon","urlProfile":"http://www.imdb.com/name/nm0104787","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1OTY5NTIzN15BMl5BanBnXkFtZTcwMDgwMTk4OQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1945","placeOfBirth":" Brooklyn, New York, USA","birthName":"Michael Feldman","bio":"Michael Brandon was born on April 20, 1945 in Brooklyn, New York, USA as Michael Feldman. He is an actor and director, known for Thomas & Friends (1984), Captain America: The First Avenger (2011) and Dempsey and Makepeace (1985). He has been married to Glynis Barber since November 18, 1989. They have one child. He was previously married to Lindsay Wagner.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1OTY5NTIzN15BMl5BanBnXkFtZTcwMDgwMTk4OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0104787","name":"Michael Brandon","idIMDB":"nm0104787"},"actorId":"nm0104787","character":"Jeff Littman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Keely Sims","urlProfile":"http://www.imdb.com/name/nm0801337","urlPhoto":"","biography":{"dateOfBirth":"14 July 1960","placeOfBirth":" Long Beach, California, USA","bio":"Keely Sims was born on July 14, 1960 in Long Beach, California, USA. She was an actress, known for Click: The Calendar Girl Killer (1990), The Disappearance of Kevin Johnson (1996) and Star Trek: Voyager (1995). She died on January 8, 2013.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0801337","name":"Keely Sims","idIMDB":"nm0801337"},"actorId":"nm0801337","character":"Leela Kerr","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hector Elias","urlProfile":"http://www.imdb.com/name/nm0253476","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1ODgwNTkyMl5BMl5BanBnXkFtZTYwMzkwNjM0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 September 1941","placeOfBirth":" Buenos Aires, Argentina","bio":"Hector Elias was born on September 24, 1941 in Buenos Aires, Argentina. He is known for his work on Me and You and Everyone We Know (2005), Envy (2004) and ¡Three Amigos! (1986).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1ODgwNTkyMl5BMl5BanBnXkFtZTYwMzkwNjM0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0253476","name":"Hector Elias","idIMDB":"nm0253476"},"actorId":"nm0253476","character":"Ramon Garcia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Hillard","urlProfile":"http://www.imdb.com/name/nm0384798","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzOTYxMDAxNV5BMl5BanBnXkFtZTYwMDg2ODcy._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1965","placeOfBirth":" Chicago, Illinois, USA","birthName":"John Hillard Worful","bio":"John Hillard was born on February 24, 1965 in Chicago, Illinois, USA as John Hillard Worful. He is an actor and writer, known for Uncharted (2009), The Disappearance of Kevin Johnson (1996) and 96 Souls (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzOTYxMDAxNV5BMl5BanBnXkFtZTYwMDg2ODcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0384798","name":"John Hillard","idIMDB":"nm0384798"},"actorId":"nm0384798","character":"Ricky Ryan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Heather Stephens","urlProfile":"http://www.imdb.com/name/nm0005463","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MDU4OTMwNV5BMl5BanBnXkFtZTYwNDU5Mzky._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"height":"5' 6\" (1.68 m)","bio":"Heather Stephens is an actress, known for Lost Highway (1997), Dante's Peak (1997) and Tomcats (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MDU4OTMwNV5BMl5BanBnXkFtZTYwNDU5Mzky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005463","name":"Heather Stephens","idIMDB":"nm0005463"},"actorId":"nm0005463","character":"Rhonda","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rick Peters","urlProfile":"http://www.imdb.com/name/nm0676648","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4Njk4Mzg5NV5BMl5BanBnXkFtZTgwMzE1ODY3NzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"June1967","placeOfBirth":" Detroit, Michigan, USA","height":"6' 3\" (1.91 m)","bio":"Rick was born in a suburb of Detroit in June of 1966. The family lived there until August 1968, when they moved to England (his dad accepted a transfer with one of the \"Big 3\" Auto manufacturers). They lived there until 1974, then returned to Michigan. They lived in Michigan until another transfer took the family to Australia in August of 1977. 5 years later the family moved back to the States, this time to California, where Rick finished high school--that's where Rick began his acting career...in high school plays. Rick is married to a woman whom he met \"in the business.\" She is a screenwriter. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4Njk4Mzg5NV5BMl5BanBnXkFtZTgwMzE1ODY3NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0676648","name":"Rick Peters","idIMDB":"nm0676648"},"actorId":"nm0676648","character":"Willis Stevens","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ian Ogilvy","urlProfile":"http://www.imdb.com/name/nm0644707","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyOTcxODE1N15BMl5BanBnXkFtZTcwNTA3ODMxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1943","placeOfBirth":" Woking, Surrey, England, UK","birthName":"Ian Raymond Ogilvy","height":"6' (1.83 m)","bio":"Ian Ogilvy was born on September 30, 1943 in Woking, Surrey, England as Ian Raymond Ogilvy. He is an actor and writer, known for Death Becomes Her (1992), The Conqueror Worm (1968) and My Life in Ruins (2009). He has been married to Kathryn Holcomb since 1992. He was previously married to Diane Sarah Patricia Hart.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyOTcxODE1N15BMl5BanBnXkFtZTcwNTA3ODMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0644707","name":"Ian Ogilvy","idIMDB":"nm0644707"},"actorId":"nm0644707","character":"Gary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Laskin","urlProfile":"http://www.imdb.com/name/nm0489644","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwOTcxNDc0NF5BMl5BanBnXkFtZTcwMTg3NTczMg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 April 1951","placeOfBirth":" Duluth, Minnesota, USA","birthName":"Michael Lewis Laskin","height":"5' 11\" (1.8 m)","bio":"Michael Laskin was born on April 3, 1951 in Duluth, Minnesota, USA as Michael Lewis Laskin. He is an actor, known for Just Go with It (2011), The Grifters (1990) and Disclosure (1994). He is married to Emily Laskin. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwOTcxNDc0NF5BMl5BanBnXkFtZTcwMTg3NTczMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0489644","name":"Michael Laskin","nicknames":["Mick"],"idIMDB":"nm0489644"},"actorId":"nm0489644","character":"Bill Rackman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charlotte Brosnan","urlProfile":"http://www.imdb.com/name/nm0112481","urlPhoto":"","biography":{"dateOfBirth":"27 November 1971","placeOfBirth":" London, England, UK","birthName":"Charlotte Emily Harris","bio":"Born in 1971, Charlotte Brosnan is the daughter of Cassandra Harris (d. 1991) and Dermot Harris (d. 1986); and the adopted daughter of Pierce Brosnan, who was married to Cassandra from 1977 until her death on 28 December, 1991. She has one brother, Christopher Brosnan (son of Cassandra and Dermot, who was also adopted by Pierce); one half-brother, Sean Brosnan (son of Cassandra and Pierce); and two adopted/step-brothers, Dylan and Paris (sons of Pierce and Keely Shaye Brosnan). Charlotte has a daughter, Isabella Sophie (b. August 1998) and a son Lucas (b. April 16th 2005), with Alex Smith.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0112481","name":"Charlotte Brosnan","idIMDB":"nm0112481"},"actorId":"nm0112481","character":"Amy","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0116111","urlIMDB":"http://www.imdb.com/title/tt0116111","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 45 min (105 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.6","filmingLocations":[],"rated":"R","awards":[],"votes":"220","type":"Movie","companyCreditsSimple":[],"keywords":{"keywords":["voice over narration","tv crew","tv camera","swimming pool","suntan","studio boss","screenwriter","satire","san pedro california","real estate agent","mockumentary","microphone","los angeles california","lie","liar","irony","investigation","interview","hooker","filmmaking","film producer","film industry","disappearance","car pulled out of water","cameraman","cameo","british","boyfriend girlfriend relationship","agent","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 21:45:35"}}