{"data":{"movies":[{"title":"Wild Orchid","originalTitle":"","year":"1989","releaseDate":"19900427","directors":[{"name":"Zalman King","id":"nm0455394"}],"writers":[{"name":"Patricia Louisianna Knop","id":"nm0461341"},{"name":"Zalman King","id":"nm0455394"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDNjOWU1ZjgtZDMxMS00MGFmLWE3ZDEtM2ZhNTU1NDQxMzZhXkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1.jpg","countries":["USA"],"languages":["English","Portuguese"],"genres":["Drama","Romance"],"plot":"Emily, a raw recruit to a law firm is sent to Brazil with Claudia to help finalise a real estate deal. Emily is innocent and vulnerable, and when she's left in Rio with Wheeler, a milionaire with an unusual outlook on life, Emily is shocked and intrigued by the sex antics to which she is exposed.","simplePlot":"A female lawyer becomes mesmerized by a self-made millionaire during an encounter in Rio setting off a series of erotic encounters.","actors":[{"actorName":"Mickey Rourke","urlProfile":"http://www.imdb.com/name/nm0000620","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MzYwNDA2MF5BMl5BanBnXkFtZTcwNDYzMjg4Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1952","placeOfBirth":" Schenectady, New York, USA","birthName":"Philip Andre Rourke Jr.","height":"5' 11\" (1.8 m)","bio":"Mickey Rourke was born Phillip Andre Rourke, Jr. on September 16, 1952, in Schenectady, New York, the son of Annette (Cameron) and Phillip Andre Rourke. His father was of Irish and German descent, and his mother was of French-Canadian, English, and German ancestry. When he was six years old, his parents divorced. A year later, his mother married Eugene Addis, a Miami Beach police officer, and moved to Miami Shores, Florida. After graduating from Horace Mann Junior High School, Rourke's family moved to a house located on 47th Street and Prairie Avenue in Miami Beach. In 1969 Rourke attended Miami Beach Senior High School, where he played second-string first baseman under coach Skip Berkman. He also acted in a school play, \"The Serpent,\" directed by legendary \"Teacher To The Stars\" Jay W. Jensen. In 1971 he graduated from Miami Beach Senior High School, and after working for a short time as a bus boy at the famed Forge Restaurant on Miami Beach, Rourke moved back to New York to seek out a career in acting. Rourke's teenage years were more aimed toward sports more than acting. He took up self-defense training at the Boys Club of Miami. It was there he learned boxing skills and decided on an amateur career. At the age of 12, Rourke won his first boxing match as an 118-pound bantamweight, defeating Javier Villanueva. Some of his early matches were fought as Andre Rourke. He continued his boxing training at the famed 5th Street Gym in Miami Beach,soon joining the Police Athletic League boxing program. In 1969 Rourke, now weighing 140 pounds, sparred with former World Welterweight champion Luis Rodriguez. Rodriguez was the number one-rated middleweight boxer in the world and was training for his match with world champion Nino Benvenuti. Rourke claims to have received a concussion in this sparring match. In 1971, at the Florida Golden Gloves, Rourke received another concussion from a boxing match. Doctors told him to take a year off and rest. In 1972 Rourke knocked out Ron Robinson in 18 seconds and John Carver in 39 seconds. On Aug. 20, 1973, Rourke knocked out 'Sherman \"Big Train\"' Bergman' in 31 seconds. Shortly after, Rourke decided to retire from amateur boxing. From 1964 to 1973, Rourke compiled an amateur boxing record of 27 wins (17 by knockout) and 3 defeats. At one point, he reportedly scored 12 consecutive first-round knockouts. As an amateur, Rourke had been friendly with pro-boxer Tommy Torino. When Rourke decided to return to boxing as a professional in 1991, Torino promoted some of Rourke's fights. Rourke was trained by former pro-boxer Freddie Roach at Miami Beach's 5th Street Gym and the Outlaw Boxing Club Gym in Los Angeles. He made $250 for his pro debut, but by the end of his second year of boxing, he had earned a million dollars. In June 1994, Rourke appeared on the cover of World Boxing Magazine. He sparred with world champions James Toney, John David Jackson, and Tommy Morrison. Rourke wished to have 16 professional fights and then fight for a world title. However, he retired in 1994 after eight bouts and never got his desired title fight. His boxing career resulted in severe facial injuries that required a number of operations to repair his damaged face. Rourke went back to acting but worked in relative obscurity until he won a Golden Globe Award for his role as Randy \"The Ram\" Robinson in The Wrestler (2008). He was nominated for Best Actor, as well, but lost.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MzYwNDA2MF5BMl5BanBnXkFtZTcwNDYzMjg4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000620","name":"Mickey Rourke","idIMDB":"nm0000620"},"actorId":"nm0000620","character":"James Wheeler","urlCharacter":"http://www.imdb.com/character/ch0078357","main":true},{"actorName":"Jacqueline Bisset","urlProfile":"http://www.imdb.com/name/nm0000302","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MjAxMzI4OF5BMl5BanBnXkFtZTcwNjYwNTQ0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 September 1944","placeOfBirth":" Weybridge, Surrey, England, UK","birthName":"Winnifred Jacqueline Fraser-Bisset","height":"5' 6½\" (1.69 m)","bio":"Jacqueline Bisset has been an international film star since the late 1960s. She received her first roles mainly because of her stunning beauty, but over time she has become a fine actress respected by fans and critics alike. Bisset has worked with directors John Huston, François Truffaut, George Cukor and Roman Polanski. Her co-stars have included Anthony Quinn, Paul Newman, Nick Nolte, Kenneth Branagh and Marcello Mastroianni. Her somewhat French-sounding name has led many to assume that she is from France, but she was brought up in England and had to study to learn French. Her mother was French and was an attorney before being married. As a child Jacqueline studied ballet. During her teenage years her father left the family when her mother was diagnosed with disseminating sclerosis; Jacqueline worked as a model to support her ailing mother and eventually her parents divorced, an experience she has said she considered character-strengthening. She took an early interest in film, and her modeling career helped pay for acting lessons. In 1967 Bisset gained her first critical attention in Two for the Road (1967), and in that same year appeared briefly in the popular James Bond spoof Casino Royale (1967), playing Miss Goodthighs. In 1968 her career got a boost when Mia Farrow unexpectedly dropped out of the shooting of The Detective (1968); Farrow's marriage to co-star Frank Sinatra was on the rocks, and her role was eventually given to Bisset, who received special billing in the film's credits. That same year she earned a Golden Globe nomination as Most Promising Newcomer for her role in The Sweet Ride (1968), and gained even more attention playing opposite Steve McQueen in the popular action film Bullitt (1968). In 1970 she co-starred in the disaster film Airport (1970) as a stewardess carrying Dean Martin's love child, and the film was one of the biggest box office hits of the year. Then she had the starring role in The Grasshopper (1970), and co-starred with Alan Alda in the well-reviewed but commercially underperforming horror film The Mephisto Waltz (1971). In 1973 she became recognized in Europe as a serious dramatic actress when she played the lead in Truffaut's Day for Night (1973). However, it would be several years before her talents would be taken seriously in the US. Jacqueline's stunning looks and figure made quite a splash in The Deep (1977). Her underwater swimming scenes in that movie inspired the worldwide wet T-shirt craze, and Newsweek magazine declared her \"the most beautiful film actress of all time\". The film's producer, Peter Guber, said \"That T-shirt made me a rich man.\" However, she hated the wet T-shirt scenes because she felt exploited. At the time of filming she was not told that the filmmakers would shoot the scenes in such a provocative way, and she felt tricked. Next up came high-profile roles in The Greek Tycoon (1978), a thinly disguised fictionalization of the marriage of Jacqueline Kennedy and Aristotle Onassis, and Who Is Killing the Great Chefs of Europe? (1978), for which she received a Golden Globe nomination as Best Actress in a Comedy. In the early 1980s, Bisset starred in the box office disasters Le jour de la fin du monde (1980) and Inchon (1981), but her well-received turn opposite Candice Bergen in Rich and Famous (1981) in between those two films gained her recognition as a serious actress from American audiences. She rebounded neatly with Class (1983), playing Rob Lowe's attractive mother who has an affair with her son's prep school roommate, and as Albert Finney's wife in Au-dessous du volcan (1984), a part that earned her a Golden Globe nomination for Best Supporting Actress. She also earned praise for her work in the cable adaptation of Anna Karenina (1985) with Christopher Reeve, and in the miniseries Napoleon and Josephine: A Love Story (1987) with Armand Assante. In 1989 she co-starred in the racy comedy Scenes from the Class Struggle in Beverly Hills (1989) and the controversial erotic thriller Wild Orchid (1989), neither of which did well at the box office, but her output remained consistent with television projects and independent features. In 1996, she was nominated for a César Award, the French equivalent of the Oscar, for her performance in La Cérémonie (1995). She had roles in historical period dramas such as Dangerous Beauty (1998), as a retired courtesan in 16th-century Venice, and the Biblical epics Jésus (1999) and In the Beginning (2000), playing the Virgin Mary and Sarah, wife of Abraham, respectively. Other notable credits included the miniseries Jeanne d'Arc (1999) alongside Leelee Sobieski, which gained her an Emmy nomination, and The Sleepy Time Gal (2001), which premiered at the Sundance Film Festival but unfortunately was not picked up for theatrical distribution. In 2005 Jacqueline was back on the big screen playing Keira Knightley's mother in the Domino Harvey biopic Domino (2005) for Tony Scott, and in 2006 she had a meaty recurring role in the fourth season of the FX series Nip/Tuck (2003) as the ruthless extortionist \"James.\" More recently she appeared in BBC's program Dancing on the Edge (2013), for which she finally won her first Golden Globe Award, and in the movies Welcome to New York (2014) with Gérard Depardieu and Miss You Already (2015) with Drew Barrymore and Toni Collette. Bisset has never married, but has been involved in long-term romantic relationships with Canadian actor Michael Sarrazin, Moroccan entrepreneur Victor Drai, Russian ballet dancer Alexander Godunov, French actor Vincent Perez and Turkish martial arts instructor Emin Boztepe. She continues to make numerous films, and frequently participates in film festivals and award ceremonies around the world.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MjAxMzI4OF5BMl5BanBnXkFtZTcwNjYwNTQ0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000302","name":"Jacqueline Bisset","idIMDB":"nm0000302"},"actorId":"nm0000302","character":"Claudia Dennis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carré Otis","urlProfile":"http://www.imdb.com/name/nm0652895","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzMjc1NzY2MTJeQTJeQWpwZ15BbWU3MDU2MDQwMTM@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 September 1968","placeOfBirth":" San Francisco, California, USA","birthName":"Carré Brennan Otis","height":"5' 10\" (1.78 m)","bio":"Carré Otis was born on September 28, 1968 in San Francisco, California, USA as Carré Brennan Otis. She is an actress, known for Wild Orchid (1989), Naked on the Inside (2007) and Exit in Red (1996). She has been married to Matthew Sutton since December 2005. They have two children. She was previously married to Mickey Rourke.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzMjc1NzY2MTJeQTJeQWpwZ15BbWU3MDU2MDQwMTM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0652895","name":"Carré Otis","idIMDB":"nm0652895"},"actorId":"nm0652895","character":"Emily Reed","urlCharacter":"http://www.imdb.com/character/ch0415014","main":true},{"actorName":"Assumpta Serna","urlProfile":"http://www.imdb.com/name/nm0785264","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyMDIzNzQwMV5BMl5BanBnXkFtZTYwNTQ3NjYy._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1957","placeOfBirth":" Barcelona, Barcelona, Catalonia, Spain","birthName":"María Asunción Rodés Serna","height":"5' 7\" (1.7 m)","bio":"Assumpta Serna was born in Barcelona, Spain. She studied Law but abandoned it for her real passion, acting. Her career has spanned over 103 films and TV projects in over 20 countries. She has won more than twenty best actress awards thought the world (Spain, France, Italy, USA, Mexico, Argentina, Chile, Uruguay...). She has worked as an actress in all six of the languages she speaks: Catalan, Spanish, Portuguese, French, Italian and English. A few of her many films are: Uncertainty (2008) with Joseph Gordon-Levitt, directed by Scott McGehee and David Siegel, Pedro Almodóvar's Matador (1986), the 1993 Spanish Oscar entry Le maître d'escrime (1992) directed by Pedro Olea, María Luisa Bemberg's film, I, the Worst of All (1990), The Craft (1996) for Columbia Tri Star, Samuel Fuller's The Day of Reckoning, Wild Orchid (1989), opposite Mickey Rourke. She has worked on more than 20 European co productions, such as Nostradamus (1994), with Rutger Hauer and F. Murray Abraham, Le cercle des passions (1983), with Max von Sydow, L'accordeur de tremblements de terre (2005) by the Quay Brothers and produced by Terry Gilliam and Desvío al paraíso (1994) with Charles Dance. Her performances have been acclaimed in popular British TV series such as Sharpe where she played the feisty guerrilla leader Teresa opposite Sean Bean and in Henry VIII, with Ray Winstone, playing the King's first wife Catherine of Aragon. In Spain she was a regular on the country's most popular TV show Aquí no hay quien viva (2003). In 2011, she played Vanozza, the mother of Cesare and Lucrezia Borgia, in the series Borgia (2011), written and produced by Tom Fontana, shown in 35 countries. She was elected to the board of the European Film Academy representing Spain for 6 years and responsible for the organization of the European Film awards (2004) in Barcelona (with a 1.8 million euro budget). Whist living in Los Angeles she was an active member of the Academy of Motion Pictures, Arts and Sciences, serving on the committee for Foreign film. She was the first Spanish actress to be honored with membership to AMPAS and is one of only five living actors to be members in all Spain. She has sat on juries in International film festivals around the world, such as Chicago, Venice, San Sebastian, Mar del Plata (Argentina), Biarritz, Rio de Janeiro, Montreal, Karlovy Vary, Cartagena de Indias (Colombia), Brussels, Cluj (Romania), and Rome. She was elected President of AISGE in 2002. AISGE is the organization in Spain that deals with the task of managing and protecting the intellectual property rights of actors. She was also voted vice-president of ARTIS, the European Association of intellectual property rights for actors. After the release of her first book she began teaching workshops in Universities and Film Schools on the subject of screen-acting. In 2005 founded with Scott Cleverdon first team an international non-profit film foundation. First team has been teaching film acting and the direction of actors in 6 countries around the world and so far has taught more than 1500 filmmakers. (www.fundacionfirstteam.org). Based in Spain, first team offers a pioneering university course on Screen Acting for actors, believed to be the first of its kind in the world and tuition programs for directors and scriptwriters. Her book, El trabajo del actor de cine was the first to be written in Spanish regarding the craft of film-acting. She followed it up with Monologues in V.O, a resource for auditioning actors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyMDIzNzQwMV5BMl5BanBnXkFtZTYwNTQ3NjYy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0785264","name":"Assumpta Serna","idIMDB":"nm0785264"},"actorId":"nm0785264","character":"Hanna Munch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bruce Greenwood","urlProfile":"http://www.imdb.com/name/nm0339304","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYwMDI5MDM1Nl5BMl5BanBnXkFtZTYwODUyNjc4._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 August 1956","placeOfBirth":" Noranda, Québec, Canada","birthName":"Stuart Bruce Greenwood","height":"6' 0½\" (1.84 m)","bio":"Bruce Greenwood was born on August 12, 1956 in Noranda, Québec, Canada as Stuart Bruce Greenwood. He is an actor and producer, known for Star Trek (2009), I, Robot (2004) and Star Trek Into Darkness (2013). He has been married to Susan Devlin since 1985. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYwMDI5MDM1Nl5BMl5BanBnXkFtZTYwODUyNjc4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0339304","name":"Bruce Greenwood","idIMDB":"nm0339304"},"actorId":"nm0339304","character":"Jerome McFarland","urlCharacter":"http://www.imdb.com/character/ch0101423","main":true},{"actorName":"Oleg Vidov","urlProfile":"http://www.imdb.com/name/nm0896554","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0OTg4NDQxMF5BMl5BanBnXkFtZTcwMDg3OTcyMQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 June 1943","placeOfBirth":" Filimonki, Leninskiy rayon, Moskovskaya oblast, RSFSR, USSR [now Filimonki, Moscow, Russia]","birthName":"Oleg Borisovich Vidov","bio":"Oleg Borisovich Vidov was born in the suburbs of Moscow on 11 June 1943 to Varvara Vidova, a teacher, and Boris Nikolaievich Garnevich, an economist. As a child he lived with his mother, who worked for the Soviet government in the field of education in Mongolia and East Germany. When his mother was sent to China on assignment, he went to live with his aunt Anuta in Kazakstan. Eventually he moved with his mother and aunt to Moscow. At 18, competing against hundreds of would-be actors, he was accepted to the acting department of the state film school VGIK. Oleg appeared in 50 films since 1961, mostly in starring roles. He was a sex symbol of his generation in Russia, and many of his films are still played on Russian television today. Here his credits include \"Red Heat\", Wild Orchid (1989) and Thirteen Days. In 1985, he defected to the U.S. and began acting in films and television there. Oleg and his wife obtained international distribution rights to the award-winning Soyuzmultfilm Studio animation library in 1992 and helped popularize Russian animation around the world. Together they produced numerous series based on animation they digitally restored from the Soyuzmultfilm animation library including \"Animated Classic Showcase\", Mikhail Baryshnikov's Les Contes de mon enfance (1981), Rudyard Kipling's \"Jungle Book\", \"Masters of Russian Animation\", \"The Adventures of Cheburashka and Friends\", and \"Animated Soviet Propaganda\". In 2007 they sold the library to a Russian oligarch.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0OTg4NDQxMF5BMl5BanBnXkFtZTcwMDg3OTcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0896554","name":"Oleg Vidov","idIMDB":"nm0896554"},"actorId":"nm0896554","character":"Otto Munch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Milton Gonçalves","urlProfile":"http://www.imdb.com/name/nm0328604","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NjM4MjA5NF5BMl5BanBnXkFtZTYwMTU2ODg2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 December 1933","placeOfBirth":" Monte Santo, Minas Gerais, Brazil","bio":"Milton Gonçalves was born on December 9, 1933 in Monte Santo, Minas Gerais, Brazil. He is an actor and director, known for Carandiru (2003), Side by Side (2012) and Le baiser de la femme-araignée (1985). He has been married to Oda Gonçalves since March 28, 1966. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NjM4MjA5NF5BMl5BanBnXkFtZTYwMTU2ODg2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0328604","name":"Milton Gonçalves","idIMDB":"nm0328604"},"actorId":"nm0328604","character":"Flavio","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jens Peter","urlProfile":"http://www.imdb.com/name/nm0676225","urlPhoto":"","biography":{"bio":"Jens Peter is an actor and assistant director, known for Wild Orchid (1989), 2 Graves (2013) and Once in a Blue Moon (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0676225","name":"Jens Peter","idIMDB":"nm0676225"},"actorId":"nm0676225","character":"Volleyball Player","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Antonio Mario Silva Da Silva","urlProfile":"http://www.imdb.com/name/nm0196202","urlPhoto":"","biography":{"bio":"Antonio Mario Silva Da Silva is an actor, known for Wild Orchid (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0196202","name":"Antonio Mario Silva Da Silva","idIMDB":"nm0196202"},"actorId":"nm0196202","character":"Rambo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Land","urlProfile":"http://www.imdb.com/name/nm0484361","urlPhoto":"","biography":{"dateOfBirth":"31 January 1956","placeOfBirth":" Hoboken, New Jersey, USA","birthName":"Paul Calandrillo","height":"6' 3\" (1.91 m)","bio":"Paul Land was born on January 31, 1956 in Hoboken, New Jersey, USA as Paul Calandrillo. He was an actor, known for Wild Orchid (1989), The Idolmaker (1980) and Spring Break (1983). He died on December 30, 2007 in North Bergen, New Jersey.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0484361","name":"Paul Land","idIMDB":"nm0484361"},"actorId":"nm0484361","character":"Big Sailor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Villella","urlProfile":"http://www.imdb.com/name/nm0898252","urlPhoto":"","biography":{"height":"5' 8\" (1.73 m)","bio":"Michael Villella is an actor, known for The Slumber Party Massacre (1982), Wild Orchid (1989) and Gotham (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0898252","name":"Michael Villella","idIMDB":"nm0898252"},"actorId":"nm0898252","character":"Elliot Costa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bernardo Jablonski","urlProfile":"http://www.imdb.com/name/nm0413009","urlPhoto":"","biography":{"dateOfBirth":"1 January 1952","placeOfBirth":"","bio":"Bernardo Jablonski was born on January 1, 1952. He was an actor and writer, known for Elite Squad (2007), Wild Orchid (1989) and Sai de Baixo (1996). He was married to Maria Clara Gueiros. He died on October 28, 2011 in Rio de Janeiro, Rio de Janeiro, Brazil.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0413009","name":"Bernardo Jablonski","idIMDB":"nm0413009"},"actorId":"nm0413009","character":"Roberto","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Luiz Lobo","urlProfile":"http://www.imdb.com/name/nm0516526","urlPhoto":"","biography":{"bio":"Luiz Lobo is an actor, known for Wild Orchid (1989), Federal Bank Heist (2011) and Cutie Pie... Her Loves and Sins (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0516526","name":"Luiz Lobo","idIMDB":"nm0516526"},"actorId":"nm0516526","character":"Juan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lester Berman","urlProfile":"http://www.imdb.com/name/nm0075801","urlPhoto":"","biography":{"bio":"Lester Berman is a production manager and producer, known for The Postman (1997), Wild Orchid (1989) and Suspect Zero (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0075801","name":"Lester Berman","idIMDB":"nm0075801"},"actorId":"nm0075801","character":"Interviewer #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steven Kaminsky","urlProfile":"http://www.imdb.com/name/nm0436756","urlPhoto":"","biography":{"dateOfBirth":"2 June 1965","placeOfBirth":" Santa Monica, California, USA","birthName":"Steven Robb Kaminsky","bio":"Steven Kaminsky was born on June 2, 1965 in Santa Monica, California, USA as Steven Robb Kaminsky. He is a production manager and producer, known for Life of Pi (2012), Divergent (2014) and The Mask (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0436756","name":"Steven Kaminsky","idIMDB":"nm0436756"},"actorId":"nm0436756","character":"Interviewer #2","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0100934","urlIMDB":"http://www.imdb.com/title/tt0100934","business":{"budget":null,"openingWeekend":[{"money":"$3,646,000","country":"USA","day":"29","month":"04","year":"1990","remarks":"819 Screens"}],"gross":[{"money":"AUD","country":"527,583","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1989/\">1989</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 45 min (105 min)","1 hr 57 min (117 min) (Ontario) (Canada)","1 hr 51 min (111 min) (unrated) (USA)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["FotoKem Laboratory, Burbank (CA), USA","Líder, Rio de Janeiro, Brazil"],"filmLength":null,"negativeFormat":["35 mm (Agfa XT 125, XT 320)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"4.5","filmingLocations":[{"location":"Bahia, Brazil"}],"rated":"R","awards":[{"award":"Razzie Awards 1991","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Actor","names":[{"name":"Mickey Rourke","id":"nm0000620","role":null},{"name":"Desperate Hours","id":"tt0099409","role":null}]},{"category":"Worst New Star","names":[{"name":"Carré Otis","id":"nm0652895","role":null}]}]}]}],"votes":"9,421","type":"Movie","companyCreditsSimple":[{"idCompany":"co0115727","name":"Vision PDG"}],"keywords":{"keywords":["millionaire","lawyer","brazil","female protagonist","breasts","sex standing up","sweat","passionate kiss","kiss","intimacy","loneliness","beach volleyball","beach","tan line","man undressing","self made man","fear of intimacy","first time sex","male full frontal nudity","hairy chest","sex scene","sailor","dance","parrot","sexual tension","hotel","watching sex","male rear nudity","american abroad","convertible","man in a swimsuit","bare chested male","woman dressed as man","scantily clad female","thong panties","lipstick","jetlag","sexual pleasure","sex on floor","lingerie","leg spreading","lust","promiscuous woman","pubic hair","female removes her dress","undressing","female frontal nudity","cleavage","panties","older woman younger man relationship","plant in title","controversy","water","female nudity","sexual awakening","sensuality","passion","expatriate","male nudity","erotica","independent film","woman","voyeur","volleyball","child","abandoned building","brief male full frontal nudity","barred window","candle","hotel room","sex in a car","sunglasses","undershirt","dancing","masquerade","cigar smoking","man with a pierced earring","bodyguard","speedo","stockings","motorcycle","female pubic hair","flower in title","rio de janeiro brazil","mask","seduction","rough sex","extramarital affair","dress ripped off","male prostitute"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:21:15"}}