{"data":{"movies":[{"title":"Buster & Chauncey's Silent Night","originalTitle":"","year":"1998","releaseDate":"19981013","directors":[{"name":"Buzz Potamkin","id":"nm0692997"}],"writers":[{"name":"George Taweel","id":"nm0851809"},{"name":"Rob Loos","id":"nm0519763"}],"runtime":"48 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwMjc0MTE3N15BMl5BanBnXkFtZTYwMDkyMjk5._V1.jpg","countries":["Canada","USA"],"languages":["English"],"genres":["Animation","Comedy","Family","Musical"],"plot":"Animated story about the creation of the song \"Silent Night\".","simplePlot":"Animated story about the creation of the song \"Silent Night\".","actors":[{"actorName":"Phil Hartman","urlProfile":"http://www.imdb.com/name/nm0367005","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEyNjYxNTY3Ml5BMl5BanBnXkFtZTYwNTM1MDE0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 September 1948","placeOfBirth":" Brantford, Ontario, Canada","birthName":"Phillip Edward Hartmann","height":"5' 10½\" (1.79 m)","bio":"Phil Hartman was born Philip Edward Hartmann on September 24, 1948, in Brantford, Ontario, Canada. His surname was originally \"Hartmann\", but he later dropped the second \"n\". He was one of eight children of Doris Marguerite (Wardell) and Rupert Loebig Hartmann, a salesman. He was of German, Irish, and English descent. The family moved to the United States when Phil was around ten, and he spent the majority of his childhood in Connecticut and Southern California. He later obtained his American citizenship in the early 1990s. He often would visit his homeland of Canada throughout his career, and the City of Brantford even erected a plaque on the Walk of Fame in the town in honor of Phil's career and memory. The Humber College Comedy: Writing & Performance program in Toronto, Ontario, also has an award in Phil's memory that is given out to their Post-Graduate comedy students. Phil originally studied Graphic Design at California State University. He began to work part time as a graphic artist, designing album covers for such bands as Crosby, Stills, Nash, and Young (see Crosby Stills Nash & Young) and Poco. In 1975, alongside doing album work, Phil joined the California comedy troupe, The Groundlings. While in The Groundlings, Phil worked with Paul Reubens and Jon Lovitz, who became good friends of his until his death. Phil and Paul created the character Pee Wee Herman together, and Phil even had a role on Pee-wee's Playhouse (1986) as pirate Captin' Carl. In 1986, Phil joined the cast of Saturday Night Live (1975) and was on the show for a record of 8 seasons (which was later broken by Tim Meadows). Phil played a wide range of characters including: Frank Sinatra, Bill Clinton, Ronald Reagan, Ed McMahon, Barbara Bush, and many others. He was known to help out other writers who wanted to get their sketches read and onto the show. He held Saturday Night Live (1975) together during his 8-year reign, thus the nickname he garnered while on the show, \"The Glue.\" Phil was also known for his voice work on commercials and cartoons. He was probably most well known for the voices of Troy McClure and Lionel Hutz on the animated comedy The Simpsons (1989). He also provided other minor voices for The Simpsons (1989). Phil left Saturday Night Live (1975) in 1994, and in 1995, was cast in the critically acclaimed NBC show NewsRadio (1995) as arrogant radio show host Bill McNeal. After Phil's death, Phil's good friend Jon Lovitz attempted to fill the void as Max Lewis on NewsRadio (1995), but the struggling show's ratings dropped, and the show later fizzled out and ended in 1999. Phil had an interesting career in movies, mostly playing supporting characters. He was the lead in Houseguest (1995) and was also in Greedy (1994), Jingle All the Way (1996), Sgt. Bilko (1996), and his last live action film, Small Soldiers (1998). His last role was the English language dub of Kiki's Delivery Service (1989), as the quick-witted cat Jiji, which featured Small Soldiers co-star Kirsten Dunst in the lead voice role. On May 28th, 1998, Phil was shot to death while sleeping in his Encino, California home by his wife, Brynn Hartman. Brynn left the house and later came back with a friend to show him Phil's body. When her friend went to call 911, Brynn locked herself in the bedroom with Phil's lifeless body and shot herself. It was later discovered by the coroner that Brynn had alcohol, cocaine, and the antidepressant, Zoloft, in her system. They leave behind two children, Sean Edward (b. 1988) and Birgen (b. 1992). Phil and Brynn's bodies were cremated and spread upon Catalina Island, just off the coast of California, on June 4, 1998. Phil had specifically stated in his will that he wanted the ashes spread on Catalina Island because it was his favorite holiday getaway as he was an avid boater, surfer and general lover of the sea. Phil was a very caring and sensitive person and was described as \"very sweet and kind of quiet.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEyNjYxNTY3Ml5BMl5BanBnXkFtZTYwNTM1MDE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0367005","name":"Phil Hartman","nicknames":["The Sultan of Smarm","The Glue of \"Saturday Night Live\""],"idIMDB":"nm0367005"},"actorId":"nm0367005","character":"Chauncey","urlCharacter":"http://www.imdb.com/character/ch0328063","main":true},{"actorName":"Marie Osmond","urlProfile":"http://www.imdb.com/name/nm0005288","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTA4MjI3NF5BMl5BanBnXkFtZTYwOTU2MTA2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1959","placeOfBirth":" Ogden, Utah, USA","birthName":"Olive Marie Osmond","height":"5' 5\" (1.65 m)","bio":"Marie Osmond was born on October 13, 1959 in Ogden, Utah, USA as Olive Marie Osmond. She is a producer and actress, known for Donny and Marie (1975), Marie (2012) and The Talk (2010). She was previously married to Brian Blosil and Steve Craig.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTA4MjI3NF5BMl5BanBnXkFtZTYwOTU2MTA2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005288","name":"Marie Osmond","idIMDB":"nm0005288"},"actorId":"nm0005288","character":"Queen","urlCharacter":"http://www.imdb.com/character/ch0328065","main":true},{"actorName":"Tom Arnold","urlProfile":"http://www.imdb.com/name/nm0000792","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NTYzNzMyNl5BMl5BanBnXkFtZTgwNjc2NzgzMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1959","placeOfBirth":" Ottumwa, Iowa, USA","birthName":"Thomas Duane Arnold","height":"6' 2\" (1.88 m)","bio":"Tom Arnold was born in Ottumwa, Iowa, to Linda (Graham) and Jack Arnold. After his parents divorced, he was raised by his father. In 1983, he got his first taste of stand-up comedy when he performed at open microphone nights at the University of Iowa. Tom's comedy career had its ups and downs over the next several years until 1988, when he entered the Minneapolis Comedy Competition and won first place. With this victory in hand, he decided to move to Los Angeles to pursue a stand-up comedy career. Once he hit Los Angeles, things happened fast. That same year, he was hired as a staff writer for Roseanne Barr's TV sitcom Roseanne (1988) and began to appear regularly on the show as \"Arnie Thomas\". He and Roseanne Barr were married in 1990, with Arnold converting to Judaism prior to the marriage. They formed Rapello County Productions to develop projects for themselves. The couple's marriage, together with their sometimes outrageous behavior, attracted media attention - and especially that of the tabloids - like a magnet. In 1994 conditions between the two deteriorated and they went through a very public, and acrimonious, divorce. Tom has been married twice since then and is the co-host of Fox Sports Net's talk show The Best Damn Sports Show Period (2001). He also does voiceover work, and provides the voice for the \"Oven Mitt\" character in the TV commercials for the Arby's restaurant chain.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NTYzNzMyNl5BMl5BanBnXkFtZTgwNjc2NzgzMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000792","name":"Tom Arnold","idIMDB":"nm0000792"},"actorId":"nm0000792","character":"Fritz","urlCharacter":"http://www.imdb.com/character/ch0328066","main":true},{"actorName":"Judith Blazer","urlProfile":"http://www.imdb.com/name/nm0088008","urlPhoto":"","biography":{"dateOfBirth":"22 October 1956","placeOfBirth":" Dover, New Jersey, USA","bio":"Judith Blazer was born on October 22, 1956 in Dover, New Jersey, USA. She is an actress, known for Guiding Light (1952), As the World Turns (1956) and Anastasia (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0088008","name":"Judith Blazer","idIMDB":"nm0088008"},"actorId":"nm0088008","character":"Lady Gretchen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Townsend Coleman","urlProfile":"http://www.imdb.com/name/nm0171243","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MDQ0OTc3Nl5BMl5BanBnXkFtZTgwODA2ODIwMTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 May 1954","placeOfBirth":" New York City, New York, USA","birthName":"Townsend Raymond Coleman","height":"5' 10\" (1.78 m)","bio":"As a busy Hollywood voice-actor, Townsend Coleman is perhaps one of the most recognizable voices on TV. For 16 years, he was the voice of NBC's \"Must See TV\" and \"Comedy Night Done Right\" primetime comedy promos, including hits from Seinfeld and Frasier to 30 Rock and The Office, as well as the promos for \"The Tonight Show\" starring Jay Leno (then Conan), \"Late Night with Conan O'Brien\" (then Jimmy Fallon), \"Last Call with Carson Daly\" and \"Saturday Night Live\". He currently voices the daily on-air promos for the long-running \"Live with Kelly and Michael\" and radio spots for \"Judge Judy\", in addition to regularly voicing primetime promos for ABC Family, The Hub, and now, ABC-TV. But the character behind the voice really came to life in 1985, when Coleman, having just moved to Los Angeles from Cleveland, Ohio, auditioned for and got a part on the animated hit, \"Inspector Gadget\". As the voice of Corporal Capeman, Gadget's bumbling assistant, he embarked on an entirely new career, providing the voices for some of the most memorable characters in cartoons and commercials. In addition to thwarting evil as the voice of \"The Tick\", Fox Kids' hit animated series, he has provided the voices for many popular cartoon characters, including Michaelangelo, Rat King, and Usagi Yojimbo on the original, long-running cartoon series, \"Teenage Mutant Ninja Turtles\". He also voiced Waldo on \"Where's Waldo?\", Gobo, Architect, and Wrench on NBC's animated \"Fraggle Rock\", Scott/Teen Wolf on \"Teen Wolf\", Scratch on \"Spacecats\", the voice of Wayne Gretzky on \"Prostars\", Riot on \"Jem and the Holograms\", Dragonflyer on \"Glofriends\", Rewind on the 80's \"Transformers\", and 20 years later, Sentinel Prime on \"Transformers: Animated\" for Cartoon Network. In addition to his active animation career, Coleman has also been the voice behind numerous national TV ad campaigns for clients such as Home Depot, Kellogg's Frosted Flakes, Mattel Hot Wheels, Sunny Delight, Colgate, Jenny Craig, Blockbuster Video, Greyhound, AT&T, Eggo Waffles, Taco Bell and the voice of \"Spot\", the precocious red 7-Up dot... even a few \"Keebler elves\" and \"Raid bugs\". Born in New York City in 1954, Coleman spent his childhood in Denver, Colorado and Cleveland, Ohio. After studying architecture and theater at the University of Colorado in Boulder, he returned home to Ohio to pursue a radio career. Ten years as a disc jockey at various Cleveland radio stations led to numerous commercial and voiceover jobs. He appeared as host of the nationally syndicated TV series \"The Dance Show\" prior to moving his family to LA in 1984 to take advantage of career opportunities on the west coast. Coleman's primary career focus was acting in TV and film, but soon changed, as he foresaw a more lucrative career specializing in the field of voiceovers. Having performed in numerous theatrical and musical productions back in Cleveland, the fall of 2013 saw Townsend re-ignite his passion for theatre after a 30 year hiatus by performing the role of Uncle Sid in Eugene O'Neill's 'Ah, Wilderness!' at The Actors Co-op in Hollywood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MDQ0OTc3Nl5BMl5BanBnXkFtZTgwODA2ODIwMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0171243","name":"Townsend Coleman","idIMDB":"nm0171243"},"actorId":"nm0171243","character":"Father Joseph","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim Cummings","urlProfile":"http://www.imdb.com/name/nm0191906","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1Mzk5OTc4NV5BMl5BanBnXkFtZTcwOTE3NjUxNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1952","placeOfBirth":" Youngstown, Ohio, USA","birthName":"James Jonah Cummings","height":"5' 8\" (1.73 m)","bio":"Born James Jonah Cummings on November 3, 1952, he grew up in Youngstown, Ohio. Sooner or later, he moved to New Orleans. There, he designed Mardi Gras floats, was a singer, door-to-door salesman, and a Louisiana riverboat deckhand. Then Cummings moved to Anaheim, California, where he started his career playing Lionel from the program Dumbo's Circus (1985).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1Mzk5OTc4NV5BMl5BanBnXkFtZTcwOTE3NjUxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0191906","name":"Jim Cummings","idIMDB":"nm0191906"},"actorId":"nm0191906","character":"Buster","urlCharacter":"http://www.imdb.com/character/ch0328067","main":true},{"actorName":"Gregg Edelman","urlProfile":"http://www.imdb.com/name/nm0248981","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NzM5NDE3Ml5BMl5BanBnXkFtZTgwMTEzNzQwMzE@._V1_UY44_CR19,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1958","placeOfBirth":" Chicago, Illinois, USA","bio":"Gregg Edelman was born on September 12, 1958 in Chicago, Illinois, USA. He is an actor, known for Spider-Man 2 (2004), Little Children (2006) and Crimes and Misdemeanors (1989). He has been married to Carolee Carmello since March 5, 1995. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NzM5NDE3Ml5BMl5BanBnXkFtZTgwMTEzNzQwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0248981","name":"Gregg Edelman","idIMDB":"nm0248981"},"actorId":"nm0248981","character":"Father Joseph","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harry Goz","urlProfile":"http://www.imdb.com/name/nm0333100","urlPhoto":"","biography":{"dateOfBirth":"16 February 1932","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Harry G. Goz","bio":"Harry Goz was born on February 16, 1932 in St. Louis, Missouri, USA as Harry G. Goz. He was an actor, known for Sealab 2021 (2000), Mommie Dearest (1981) and Marathon Man (1976). He was married to Margaret Avsharian. He died on September 6, 2003 in Manhasset, Long Island, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0333100","name":"Harry Goz","nicknames":["Hal"],"idIMDB":"nm0333100"},"actorId":"nm0333100","character":"Mayor Huffenmeier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Earl Hammond","urlProfile":"http://www.imdb.com/name/nm0358679","urlPhoto":"","biography":{"dateOfBirth":"17 June 1921","placeOfBirth":" New York City, New York, USA","birthName":"Erwin Saul Hamburger","bio":"Earl Hammond, a thespian who acted in radio, movies, television, and on Broadway in a career that spanned a remarkable 70 years, was born Erwin Saul Hamburger on June 17, 1921 in New York City. He became a professional actor on radio at the age of seven and continued working in that venue for over 50 years. As a radio actor, he had a recurring part on the soap opera \"Days of Our Lives\" in the 1940s and appeared on the \"CBS Radio Mystery Theater\" from 1979 to 1982. His family moved to Buffalo, where he began appearing on radio station WGR in 1938, after he graduated from high school. He eventually moved to California, where he studied drama at Los Angeles City College. After graduating in 1941, he was drafted and served in the Army during WWII. Hammond returned to New York City after being demobilized and appeared in theater and on the radio. Hammond made his TV debut on the Kraft Theatre (1947) episode \"Ladies in Retirement\" (1950), then had a recurring role as Sergent Lane on the TV Series Rocky King, Detective (1950) (syndicated as \"Rocky King, Detective\") in 1953. He appeared regularly in TV during the 1950s and '60s (his TV work slackening off in the '70s), but did not make his movie debut until 1962, in the B-movie Satan in High Heels (1962). He appeared in three Broadway plays from 1957 to 1959. He was in the short-lived musical \"Livin' The Life' in the spring of 1957 and played Roddy McDowall''s father in Compulsion (1959) in the 1957-58 season. He last trod the boards on the Great White Way in the unsuccessful musical \"Juno\" in the spring of 1959. Late in his career, he became a voice actor, supplying voice-overs for the TV series Star Blazers (1979), The Adventures of the Galaxy Rangers (1986), Silverhawks (1986), and _\"Thundercats\" (1985). He also did voice work on audiotapes. _Pope John Paul II_ personally selected him to be his \"voice\" on the audio book made from the Pope's book \"Crossing the Threshold of Hope\". Earl Hammond died of heart failure on May 17, 2002 in New York City. He was 80 years old.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0358679","name":"Earl Hammond","idIMDB":"nm0358679"},"actorId":"nm0358679","character":"Additional Voices","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Kandel","urlProfile":"http://www.imdb.com/name/nm0437199","urlPhoto":"","biography":{"dateOfBirth":"15 February 1951","placeOfBirth":" Queens, New York, USA","bio":"Paul Kandel was born on February 15, 1951 in Queens, New York, USA. He is an actor, known for The Hunchback of Notre Dame (1996), The Hunchback of Notre Dame II (2002) and Disney Sing-Along-Songs: Topsy Turvy (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0437199","name":"Paul Kandel","idIMDB":"nm0437199"},"actorId":"nm0437199","character":"Duke of Raoche","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lea Michele","urlProfile":"http://www.imdb.com/name/nm0584951","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MDgxNjA4OF5BMl5BanBnXkFtZTcwMjY3ODAyNg@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 August 1986","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"Lea Michele Sarfati","height":"5' 2½\" (1.59 m)","bio":"Lea Michele Sarfati was born in the Bronx, New York to parents Edith Thomasina (Porcelli), a nurse, and Mark David Sarfati, a delicatessen owner-turned-real estate agent. Her mother is of Italian descent (from Rome and Naples), and her father is of Sephardi Jewish ancestry (from Turkey and Greece). Lea was raised Catholic. She grew up in Tenafly, New Jersey, where she eventually attended and graduated from Tenafly High School. At the age of eight, Lea went with a friend to an open casting call for an up-and-coming musical. After spontaneously deciding to audition, she was offered the role and, two weeks later, she was starring on Broadway. She made her debut on Broadway in 1995 as a replacement for the role of Young Cosette in \"Les Misérables\". Following her theatrical debut, Lea was cast in the role of Tateh's daughter, the Little Girl, in the 1998 original Broadway cast of \"Ragtime\" and, in 2004, Lea portrayed Shprintze and understudied the role of Chava in the Broadway revival of the musical \"Fiddler on the Roof\". When she was fourteen, Lea was given the role of Wendla Bergmann in Steven Sater and Duncan Sheik's musical version of \"Spring Awakening\". She starred in early workshops, off-Broadway and, finally, originated the role in the Broadway production at the age of twenty. Around the same time that the show was set to go to Broadway, Lea was offered the role of Éponine Thénardier in the Broadway revival of \"Les Misérables\". However, she chose to remain with \"Spring Awakening\", which debuted on Broadway in December 2006. She was later nominated for a Drama Desk Award for Outstanding Actress in a Musical. After two years of starring in \"Spring Awakening\", Lea left the show with co-star Jonathan Groff, to pursue other opportunities. In late 2008, Lea won the role of Rachel Berry on the comedy-drama series Glee (2009), and since the show's premiere on May 19, 2009, has received worldwide critical acclaim for her performance. She received the 2009 Satellite Award for Best Actress in a Series - Comedy or Musical, and later won three People's Choice Awards and a Screen Actors Guild Award. Along with her award wins, Lea also received Golden Globe and Emmy Award nominations.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MDgxNjA4OF5BMl5BanBnXkFtZTcwMjY3ODAyNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0584951","name":"Lea Michele","nicknames":["Lee","Lele"],"idIMDB":"nm0584951"},"actorId":"nm0584951","character":"Christina","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ellen Bernfeld","urlProfile":"http://www.imdb.com/name/nm0076739","urlPhoto":"","biography":{"bio":"Ellen Bernfeld is an actress, known for Anastasia (1997), Buster & Chauncey's Silent Night (1998) and The Positively True Adventures of the Alleged Texas Cheerleader-Murdering Mom (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0076739","name":"Ellen Bernfeld","idIMDB":"nm0076739"},"actorId":"nm0076739","character":"Additional Voices","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peppy Castro","urlProfile":"http://www.imdb.com/name/nm3552776","urlPhoto":"","biography":{"bio":"Peppy Castro is an actress, known for Buster & Chauncey's Silent Night (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3552776","name":"Peppy Castro","idIMDB":"nm3552776"},"actorId":"nm3552776","character":"Additional Voices","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Madeline Doherty","urlProfile":"http://www.imdb.com/name/nm0230590","urlPhoto":"","biography":{"bio":"Madeline Doherty is an actress, known for Anastasia (1997), The Producers (2005) and Buster & Chauncey's Silent Night (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0230590","name":"Madeline Doherty","idIMDB":"nm0230590"},"actorId":"nm0230590","character":"Additional Voices","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joy Hermalyn","urlProfile":"http://www.imdb.com/name/nm3552811","urlPhoto":"","biography":{"bio":"Joy Hermalyn is an actress, known for The Sound of Music Live! (2013), Buster & Chauncey's Silent Night (1998) and Easter Mysteries (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3552811","name":"Joy Hermalyn","idIMDB":"nm3552811"},"actorId":"nm3552811","character":"Additional Voices","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0167064","urlIMDB":"http://www.imdb.com/title/tt0167064","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"1998 Columbia TriStar Home Video, Inc."},"technical":{"runtime":["49 min (Canada)","48 min (USA)","49 min (Argentina)","49 min (YouTube) (UK)"],"soundMix":["Stereo (Surround Sound)"],"color":["Color (YouTube)"],"aspectRatio":["16:9 HD","4:3 (Youtube video)"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.4","filmingLocations":[],"rated":"G","awards":[],"votes":"167","type":"Video","companyCreditsSimple":[{"idCompany":"co0025752","name":"Project X Productions"},{"idCompany":"co0097574","name":"Tundra Productions"}],"keywords":{"keywords":["silent night","thieves","mistake","impostor","animal name in title","pipe organ","punctuation in title","apostrophe in title","ampersand in title","girl","winter","violin","treasure","title based on song","thief","star died before release","soup","sneeze","reference to jesus christ","queen","music box","guitar","echo","church","choir master","cat","caroler","blue jay","austria","angel","ambition","accordion","mouse","christmas","independent film","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 18:12:10"}}