{"data":{"movies":[{"title":"The Informant","originalTitle":"","year":"1997","releaseDate":"19980102","directors":[{"name":"Jim McBride","id":"nm0564319"}],"writers":[{"name":"Gerald Seymour","id":"nm0786821"},{"name":"Nicholas Meyer","id":"nm0583292"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NTIzMDQwMV5BMl5BanBnXkFtZTcwMjc1NDMzMQ@@._V1.jpg","countries":["Ireland","USA"],"languages":["English","German"],"genres":["Drama"],"plot":"A young IRA member is forced to turn informant on his comrades when he is caught in an assassination attempt on a judge.","simplePlot":"A young IRA member is forced to turn informant on his comrades when he is caught in an assassination attempt on a judge.","actors":[{"actorName":"Anthony Brophy","urlProfile":"http://www.imdb.com/name/nm0112390","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MjYyMDU0Nl5BMl5BanBnXkFtZTcwODQxMDgzNw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Born in Hammersmith, London to Irish parents. He has been acting since the age of 16, first with the Dublin Youth Theatre, and then with the National Youth Theatre. He moved from there to work in Irish theatres, including The Abbey Theatre and Druid, both in Ireland and the West end. His film career began with 'In the name of the Father' (1993). His TV work has included the portrayal of Chapuys for Showtime in all four seasons of the show. He is also a writer, his first stage play 'Chicane' was staged in Dublin last year, and was subsequently shortlisted for the Stewart Parker award. Since its production, he has adapted the play for the screen, and hopes to stage his second play 'Monocide' next year.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MjYyMDU0Nl5BMl5BanBnXkFtZTcwODQxMDgzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0112390","name":"Anthony Brophy","idIMDB":"nm0112390"},"actorId":"nm0112390","character":"Gingy McAnally","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cary Elwes","urlProfile":"http://www.imdb.com/name/nm0000144","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTUxNzY3NTAxNF5BMl5BanBnXkFtZTgwNjU4MDU0NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1962","placeOfBirth":" London, England, UK","birthName":"Ivan Simon Cary Elwes","height":"6' (1.83 m)","bio":"Cary Elwes was born in Westminster, London, England, the third son of interior designer/shipping heiress Tessa Georgina Kennedy and the late portrait painter Bede Evelyn Dominick Elwes. He is the brother of producer/agent Cassian Elwes and artist Damian Elwes. He was raised in London and attended Harrow. After graduating from Harrow, he moved to the US and studied drama at Sarah Lawrence College. He left school after two years to begin his film career. Cary is well respected by colleagues and fans alike and considered by many to be one of the finest young actors working today. He is interested in history and says, \"It's deliberate that a lot of my films have been period pieces\". He is politically active for causes he believes in, such as protecting the environment and helping Native American people. Elwes is married to Lisa Marie Kurbikoff, a stills photographer. He comes from a long-established recusant English family on his father's side. Several prominent Catholic clerics are among his relatives, including Fr. Luke Cary-Elwes, Dom Columba Cary-Elwes, and Dom Cuthbert Cary-Elwes. His paternal great-grandfather was Chamberlain to the Pope. Cary (the surname \"Cary-Elwes\" was shortened to \"Elwes\" in some branches of the family) was an altar boy at London's Brompton Oratory, although he did not attend a Catholic high school. From his maternal grandmother, Daska Marija Ivanovic-Banac, who was born in Osijek in the Austra-Hungarian Empire (now in Croatia), he has Croatian Jewish and Serbian ancestry. Cary's other lineage is English, Irish, and Scottish.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTUxNzY3NTAxNF5BMl5BanBnXkFtZTgwNjU4MDU0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000144","name":"Cary Elwes","idIMDB":"nm0000144"},"actorId":"nm0000144","character":"Lt. David Ferris","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Timothy Dalton","urlProfile":"http://www.imdb.com/name/nm0001096","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE5NDA1OTA4NV5BMl5BanBnXkFtZTcwMDE3NDk0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 March 1946","placeOfBirth":" Colwyn Bay, Wales, UK","birthName":"Timothy Peter Dalton","height":"6' 2\" (1.88 m)","bio":"At a consistently lean 6' 2\", green-eyed Timothy Dalton may very well be one of the last of the dying breed of swashbuckling, classically trained Shakespearean actors who have forged simultaneous successful careers in theater, television and film. He has been comparison-shopped roundly for stepping into roles played by other actors, first following Sir Laurence Olivier in Wuthering Heights (1970), then as \"James Bond\" in The Living Daylights (1987) and Licence to Kill (1989), and even more brutally, recently, as \"Rhett Butler\" in Scarlett (1994). Undaunted and good-natured, he has always stated that he likes the risk of challenges. He was born in Colwyn Bay, North Wales, the oldest of five children of Dorothy (Scholes) and Peter Dalton-Leggett. His father was stationed in Colwyn Bay during WWII, and moved the family to Manchester in the late 1940s, where he worked in advertising and raised the growing Dalton family, in an upper-class neighbourhood outside of Belper, Derbyshire. Timothy was enrolled in a school for bright children, where he excelled in sports and was interested in the sciences. He was fascinated with acting from a young age, perhaps due to the fact that both his grandfathers were vaudevillians, but it was when he saw a performance of \"Macbeth\" at age 16 that his destiny was clinched. After leaving Herbert Strutt Grammar School at the age of sixteen, he toured as a leading member of Michael Croft's National Youth Theater. Between 1964-66, he studied at The Royal Academy of Dramatic Art (RADA). Just before completing his two years, he quit and joined the Birmingham Repertory Theatre, playing the lead in many productions under the direction of Peter Dews while at the same time turning professional. Dalton later said of RADA in an interview with \"Seventeen\" Magazine (December 1970), \"It took a year to undo the psychological damage that was caused by the oppressive teachers\". His talent and classic good looks immediately landed him professional work in television, guest-starring on an episode of the short-lived TV series, Judge Dee (1969), and as a regular on the 14-episode series Sat'day While Sunday (1967) with the young Malcolm McDowell. In late 1967 Peter O'Toole recommended him for the role of the young \"King Philip of France\" in The Lion in Winter (1968) (coincidentally, this was also Anthony Hopkins' big break). The following year, he starred in the Italian film Le voyeur (1970) with Marcello Mastroianni and Virna Lisi, although his voice was dubbed into Italian by another actor. Dalton also mixed in a healthy dose of BBC work during this time, including The Three Princes (1968), _BBC Play of the Month: Five Finger Exercise (1970) (TV)_and Candida (1973). Also during this time, he was approached and tested for the role of James Bond in On Her Majesty's Secret Service (1969) but turned it down, feeling he was too young for the part. His next film was another costume drama, Cromwell (1970), working with director Ken Hughes, with whom he later made his first American film, Sextette (1978). He followed Cromwell (1970) with Wuthering Heights (1970) and Mary, Queen of Scots (1971). He was already developing a pattern in his films that would follow him throughout his career: costume dramas where he played royalty, which he had done in three of his first four films (and ridden horses in three, and raised a sword in two). In 1972, he was contracted to play a part in Lady Caroline Lamb (1972). However, at the last moment he was replaced. Dalton sued the company and won, but the film went on without him. From the early to mid-1970s, he decided to further hone his skills by going back into the theater full time. He signed on with the Royal Shakespeare Company (RSC) and the Prospect Theatre Company (PTC), and toured the world with both, playing the leads in \"Romeo and Juliet\", \"King Lear\", \"Henry V\", \"Love's Labours Lost\", and \"Henry IV\" - parts 1 and 2. In 1975, he returned to movies in the British/Austrian production of The Executioner (1975). It was followed in 1976 by the Spanish religious historical film about the inquisition, The Man Who Knew Love (1978), which was never widely released. After this, he took another break from film, mixing in a healthy dose of theater, returning for his first American film, Sextette (1978), and the lengthy miniseries Centennial (1978), his first American television appearance, in which Lynn Redgrave played his wife. Because of his broad exposure to American audiences in this series, he began to get more frequent film and television work in the US, including the episode \"Fallen Angel\" of Charlie's Angels (1976) -- which, ironically, had several references to his character being like \"James Bond\" -- and the TV movie The Flame Is Love (1979). Although he did a few features, including playing Vanessa Redgrave's husband in Agatha (1979), most of his work until 1985 consisted of TV movies and miniseries. He played royalty again in the very campy Flash Gordon (1980). He followed this with a small film, Chanel Solitaire (1981) and, in 1981, also filmed a staged production of Antony and Cleopatra (1984) opposite Lynn Redgrave, with Anthony Geary, as well as Nichelle Nichols and Walter Koenig of the original TV series, Star Trek (1966). The years 1983-1987 have so far been the most prolific of his career. In 1983, he starred as \"Rochester\" in what he considers one of his best works, the BBC's very popular Jane Eyre (1983). Also, during this time, Roger Moore was considering leaving Bond, and Dalton was again approached, but due to his full schedule, he had to decline. In 1984, he did one of his many narrations in the Faerie Tale Theatre (1982) production of The Emperor's New Clothes (1987). That same year also saw him in the Hallmark Hall of Fame piece The Master of Ballantrae (1984) opposite Michael York and Richard Thomas, and another miniseries, Mistral's Daughter (1984), opposite Stefanie Powers and Stacy Keach. The next year was also a very busy one. He starred in another miniseries, Sins (1986), playing the brother of Joan Collins, and also starred in and narrated the four-hour TV movie Florence Nightingale (1985), opposite Jaclyn Smith. He also starred in The Doctor and the Devils (1985) as \"Dr. Thomas Rock\", with Stephen Rea, Jonathan Pryce, and Patrick Stewart. In the mid-to-late 1980s, Dalton narrated many nature documentaries, most notably several episodes of the UK series Wildlife Chronicles (1987) (called \"Wildlife Chronicles\" in the US). In the spring of 1986, he teamed with Vanessa Redgrave for another revival of a Shakespeare production, The Taming of the Shrew (1988) and his interpretation of \"Petrucchio\" received uniformly high praise. Simultaneously, the world was playing a guessing game as to who would succeed Roger Moore as \"James Bond\". Dalton was approached but was committed to the theater, and so Pierce Brosnan was offered the part. When Brosnan was unable to get out of his Remington Steele (1982) contract at the last minute, Dalton was again approached. Able now to work it into his tight schedule, he agreed. Although his first outing as Bond, The Living Daylights (1987), did reasonably well at the box-office, Licence to Kill (1989) suffered from a lack of marketing that appeared to harm its chances of big box-office success. However, Dalton's interpretation of \"Bond\" in this film received critical acclaim in some quarters as being the closest to author Ian Fleming's literary \"Bond\". Back in the theater, he teamed again with Vanessa Redgrave for a revival of Eugene O'Neill's seldom performed play, \"A Touch of the Poet\", which is considered by some to be his and Redgrave's finest professional collaboration. Although there were talks of bringing the play to Broadway, this never materialized. Following Licence to Kill (1989), he immediately returned to one of his strengths, costume drama, in The King's Whore (1990). It was followed by his excellent performance in Disney's The Rocketeer (1991), where he played a swashbuckling, Errol Flynn type. In August 1991, he teamed with Whoopi Goldberg for the first bi-racial interpretation of \"Love Letters\" for the final sold-out performances of the play in Los Angeles. When he had signed on to do \"Bond\" it was for three pictures, but the rights to the \"Bond\" films became entangled in lengthy litigation, delaying production of the third. During this wait, he was set to star in the title role of another historical epic, Christopher Columbus: The Discovery (1992). From the start, however, the film was doomed due to the competition with the Gérard Depardieu \"Columbus\" picture, which was racked with its own problems. When the director was replaced, Dalton backed out and was followed by his co-star, Isabella Rossellini. In 1992, he starred in the A&E production Framed (1992), which won a bronze medal in the 1993 New York Film Festival. The next year, he journeyed to northern Alaska and Minnesota to make a documentary on one of his favorite subjects, wolves. In the Company of Whales (1991) went on to win a silver medal in the 1994 New York Film Festival. He kept busy in television through 1993 and 1994. He made Red Eagle (1994), Scarlett (1994) and managed to squeeze in a guest appearance on Tales from the Crypt (1989) in the episode \"Werewolf Concerto\". In 1994, he took on the role of \"Rhett Butler\" in the eight-hour mini-series Scarlett (1994), produced by Robert Halmi Sr. for the Hallmark Hall of Fame. In April of that year, believing he needed to move on to fresh challenges, he officially resigned the role of \"James Bond\", a move which was much regretted by the producers, though they understood his reasons. After two months of negotiations, the role went to Pierce Brosnan. In September 1994, Dalton was called upon for two readings of \"Peter and the Wolf\" at the Hollywood Bowl. He played to full-capacity crowds. In November, Scarlett (1994) premiered and, though given only a lukewarm response by critics, it was a ratings success not only in the US but all over the world, breaking records in many European countries. As always after a major work, Dalton again withdrew quietly and without fanfare to search for his next project, a small, personal film. In the summer of 1995, he journeyed to Canada to shoot Salt Water Moose (1996). The film was made by Canada's Norstar Entertainment and was sold to Halmi to be the first video release in his new line of Hallmark family films. It premiered on Showtime in June 1996. During the spring of 1996, he made the IRA drama The Informant (1997) in Ireland and, in May, he traveled to Prague to shoot Passion's Way (1999), opposite Sela Ward. On February 7, 1997, the comedy The Beautician and the Beast (1997) co-starring Fran Drescher opened in the US. He also gleefully parodied his swashbuckling/James Bond image in Les Looney Tunes passent à l'action (2003) as a spy playing an actor playing a spy. In 1995, Dalton began a relationship with Oksana Grigorieva which produced a child in 1997, Dalton's son Alexander. Over the following years, Dalton has been a caring and loving father of his son. Very much a private man, Dalton's pastimes include fishing, reading, jazz, opera, antique fairs and auctions and, of course, movies.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE5NDA1OTA4NV5BMl5BanBnXkFtZTcwMDE3NDk0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001096","name":"Timothy Dalton","nicknames":["Tim","The Daltonator","T-Dalt"],"idIMDB":"nm0001096"},"actorId":"nm0001096","character":"DCI Rennie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maria Lennon","urlProfile":"http://www.imdb.com/name/nm0502057","urlPhoto":"","biography":{"bio":"Maria Lennon is an actress, known for The Informant (1997), Crossmaheart (1998) and Eviction (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0502057","name":"Maria Lennon","idIMDB":"nm0502057"},"actorId":"nm0502057","character":"Roisin McAnally","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Kavanagh","urlProfile":"http://www.imdb.com/name/nm0442559","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5ODY3Nzc3Ml5BMl5BanBnXkFtZTcwNTMyMTUwOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"John Kavanagh is one of Ireland's underrated character actors. Little detail is given on him, yet he has appeared in many well-known films and television series alongside a variety of actors. Kavanagh began his career with the Irish comedy, Paddy (1970), where he played the small role of \"Willie Egan\". That same year, he played another small role in the World War II film, L'évasion du capitaine Schlütter (1970), which is about a P.O.W. camp, in Scotland, whose prisoners are preparing an escape. The next twelve years brought Kavanagh no new films, though he continued to act on stage. Finally, he decided to return to screen acting with the theatrical film, The Ballroom of Romance (1982), which put him in a romance with accomplished actress Brenda Fricker. The film was followed up with the small film, Attracta (1983), and the made-for-television movie, The Country Girls (1984), starring Sam Neill. Kavanagh's next theatrical film was one of the most famous films of his career: the Irish film Cal (1984), starring Helen Mirren and John Lynch. The film was about a young member of the IRA (Lynch) who is seeking to get out of the organization. He meets the widow of one of the IRA's victims (Mirren) and begin a love affair. Moving on from this film, Kavanagh acted in a number of films and television series. He participated in the action film, The Joyriders (1999), the crime drama, Bellman and True (1987), the independent film, 4 Play: In the Border Country (1991), and the thriller, The Fantasist (1986), among others. Kavanagh's career picked up considerably in the mid-nineties. He acted alongside such classic actors as Mia Farrow and Jim Broadbent in the John Irvin film, Widows' Peak (1994). Kavanagh then guest-starred in the Sharpe series (starring Sean Bean and Hugh Fraser), where he played the holy man \"Father Michael Curtis\". That same year, he acted in the most talked about epic of its time; Mel Gibson's Braveheart (1995). Starring Gibson, Angus Macfadyen and Brendan Gleeson, Kavangh acted as one of the nobles who routinely changed sides from Scotland to England in the Scottish wars of independence. The film won Best Picture and Best Director, and was a smash hit. After this fantastic success, Kavanagh acted in Some Mother's Son (1996), a prison film which was written by Jim Sheridan, and reunited with Brenda Fricker in Pete's Meteor (1998). He continued to act in other films throughout the nineties and, as the new millennium dawned, Kavanagh continued on to new projects. After a number of smaller films, Kavanagh acted in another historical epic; the mighty Oliver Stone film, Alexander (2004), starring Colin Farrell, Val Kilmer and Anthony Hopkins. Kavanagh played the role of \"Parmenion\", the old general who questions Alexander's actions. After a plot to kill the young leader is foiled, Parmenion is accused of being the mastermind behind it and is murdered. While the film was a triumph overseas, its domestic budget was a fraction of the budget, and received negative reviews for a number of different reasons. After this, Kavanagh acted in Brian De Palma's murder film, Le dahlia noir (2006), which failed at the box office. Kavanagh has rebounded with the successful television series, Les Tudors (2007). Starring fellow Alexander (2004) cast member Jonathan Rhys Meyers, the series plays out the story of England's turmoil in the time of Henry the Eighth and his life as he breaks from the Catholic Church.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5ODY3Nzc3Ml5BMl5BanBnXkFtZTcwNTMyMTUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0442559","name":"John Kavanagh","idIMDB":"nm0442559"},"actorId":"nm0442559","character":"IRA Chief","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sean McGinley","urlProfile":"http://www.imdb.com/name/nm0569336","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMzg3MDc3Ml5BMl5BanBnXkFtZTcwNjU1MjQ3Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1956","placeOfBirth":" Gaoth Dobhair, Donegal, Ireland","height":"6' (1.83 m)","bio":"Sean McGinley was born in 1956 in Gaoth Dobhair, Donegal, Ireland. He is known for his work on Braveheart (1995), Republic of Doyle (2010) and The Butcher Boy (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMzg3MDc3Ml5BMl5BanBnXkFtZTcwNjU1MjQ3Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0569336","name":"Sean McGinley","idIMDB":"nm0569336"},"actorId":"nm0569336","character":"Frankie Conroy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frankie McCafferty","urlProfile":"http://www.imdb.com/name/nm0564525","urlPhoto":"","biography":{"dateOfBirth":"1967","placeOfBirth":" County Donegal, Ireland","bio":"Frankie McCafferty was born in 1967 in County Donegal, Ireland. He is an actor and director, known for Au nom du père (1993), Ballykissangel (1996) and Philomena (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0564525","name":"Frankie McCafferty","idIMDB":"nm0564525"},"actorId":"nm0564525","character":"Dalton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stuart Graham","urlProfile":"http://www.imdb.com/name/nm0334324","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM3OTQ4OTY5NF5BMl5BanBnXkFtZTcwOTUzNjQ2Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1967","placeOfBirth":" Belfast, Northern Ireland, UK","bio":"Stuart Graham was born in 1967 in Belfast, Northern Ireland. He is an actor and director, known for Hunger (2008), La taupe (2011) and Goldfish Memory (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM3OTQ4OTY5NF5BMl5BanBnXkFtZTcwOTUzNjQ2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0334324","name":"Stuart Graham","idIMDB":"nm0334324"},"actorId":"nm0334324","character":"Det. Astley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Lydon","urlProfile":"http://www.imdb.com/name/nm0527994","urlPhoto":"","biography":{"dateOfBirth":"11 September 1964","placeOfBirth":" London, England, UK","birthName":"Gary O'Brien","bio":"Gary was born in London, but moved to his father's hometown Wexford in the Republic of Ireland. After leaving school he joined Wexford Theatre Co-op, performing in plays by Sam Sheperd, Dario Fo and Joe Orton. During this time he began a collaboration with the Wexford writer, making his London debut in 1988 playing Jimmy Brady in A Handful of Stars (1993), and went on to perform in Billy Roche's Wexford Trilogy on stage and television.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0527994","name":"Gary Lydon","idIMDB":"nm0527994"},"actorId":"nm0527994","character":"Det. McDonough","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sean Kearns","urlProfile":"http://www.imdb.com/name/nm0444036","urlPhoto":"","biography":{"bio":"Sean Kearns is an actor, known for The Boxer (1997), Angela's Ashes (1999) and The Informant (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0444036","name":"Sean Kearns","idIMDB":"nm0444036"},"actorId":"nm0444036","character":"Det. Prentice","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"B.J. Hogg","urlProfile":"http://www.imdb.com/name/nm0389698","urlPhoto":"","biography":{"dateOfBirth":"30 April 1955","placeOfBirth":" Lisburn County, Antrim, Northern Ireland, UK","birthName":"William Henry Brian Hogg","bio":"BJ Hogg, a true Ulsterman, born in Lisburn, Co. Antrim. His father William was a plater in Harland and Woolfe shipyard in Belfast His mother May ran a general store in their home town. BJ has travelled the world as an actor, writer and now director. He is a true all-rounder, a classically trained musician who started his career whilst in his teens, touring with the Big Bands, all over his native Ireland. His acting career has taken him from theatre roles in Belfast Art's and Lyric Theatres to London's Royal Court, including the Moscow Arts Theatre and the National Theatre of Belarus in Minsk. In Russia, BJ was the only European actor to be invited to play with an all Russian cast in the Russian stage play, Threshold, in Moscow Arts Theatre and The National ByloRussian State Theatre (Yanka Kupala) Minsk. Directed by Shivaun O'Casey, he played Corporal Brennan in major US and Irish tours of her father Sean's play \"The Plough and the Stars\". Starring in numerous television series he has become a household name and face in the comic role of \"Big Mervyn\" in the long-running BBC NI comedy series \"Give My Head Peace\", aired across the UK and Ireland. BJ, passionate about his native Northern Ireland, has successfully based his career from his home territory, playing in movies internationally and indeed, closer to home. BJ just completed filming with Tim Robbins and Bill Murray in the forthcoming City Of Ember, Richard Attenborough's Closing The Ring and Steve McQueen's acclaimed Cannes 2008 award winning, The Hunger. He works extensively when he can, in the theatre, and has just completed in the principle role, Robert, the inaugural tour of the huge new musical On Eagles Wing, which is scheduled for major European and US tours and then Broadway in 2010. BJ has worked extensively with acclaimed directors including Richard Attenborough, Jim Sheridan, Thaddeus O'Sullivan, Mike Leigh and Alan Pakula. Turning to directing himself, he is about to helm a major UK documentary Richard Attenborough: Master At Work, and also direct a British movie called, Promises, Promises. Integrally involved in the production of 'Dance Lexi Dance', he also played the eponymous 'Lexi Hamilton' in the Oscar nominated short film 'Dance Lexi Dance' which continues to win awards, including Special Jury award at the Aspen film festival. As a writer, BJ has just completed his second screenplay Promises, Promises, which he also directs, filming in the UK, with Ed Burns, Claire Forlani and Rosemary Harris due for release in Summer 2010.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0389698","name":"B.J. Hogg","idIMDB":"nm0389698"},"actorId":"nm0389698","character":"Constable Goss","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ciarán Fitzgerald","urlProfile":"http://www.imdb.com/name/nm0280200","urlPhoto":"","biography":{"dateOfBirth":"27 July 1983","placeOfBirth":" Dublin, Ireland","height":"5' 8\" (1.73 m)","bio":"Ciarán Fitzgerald was born in Dublin, Ireland, on 27 July, 1983. He is best known as a child actor. He made his film debut as a nine year old in the Irish film Le cheval venu de la mer (1992), directed by Mike Newell, in which he played one of the two lead characters. In this, his first film, his co-stars included such greats of Irish acting as Gabriel Byrne, David Kelly, Colm Meaney and Brendan Gleeson. Together with co-star Rúaidhrí Conroy, he won the Young Actor Award of 1994 as Outstanding Youth Actor in a Family Foreign Film for this performance. During the 1990s, Ciarán Fitzgerald appeared in numerous, mostly Irish, films and TV productions including The General (1998) and The Boxer (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0280200","name":"Ciarán Fitzgerald","nicknames":["Fitzy","Ossie"],"idIMDB":"nm0280200"},"actorId":"nm0280200","character":"Gerard McAnally","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Virginia Cole","urlProfile":"http://www.imdb.com/name/nm0170837","urlPhoto":"","biography":{"bio":"Virginia Cole also played Bridget Cadogan in \"The Irish R.M.\" This popular BBC series was produced in the 1980's. Set in turn-of-the-20th century western Ireland, the Bridget character was the victim of much verbal abuse from the cook, her aunt-in-law. The Bridget characters evolves from a love struck young girl from the vilified Hare Island to proud wife and mother.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0170837","name":"Virginia Cole","idIMDB":"nm0170837"},"actorId":"nm0170837","character":"Roisin's Ma","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Lammin","urlProfile":"http://www.imdb.com/name/nm0483594","urlPhoto":"","biography":{"bio":"Gary Lammin is an actor, known for Riff-Raff (1991), The Informant (1997) and The Calcium Kid (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0483594","name":"Gary Lammin","idIMDB":"nm0483594"},"actorId":"nm0483594","character":"Cpl. Jones","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Gaddas","urlProfile":"http://www.imdb.com/name/nm0300518","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE3ZjQzNjktZDcxZi00OTg1LWJiYTYtZWE0MzkyOTgyMTZkXkEyXkFqcGdeQXVyMzE3OTU5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 June 1960","placeOfBirth":" Ragworth, Stockton-on-Tees, Durham, England, UK","height":"6' 2½\" (1.89 m)","bio":"James Gaddas was born on June 17, 1960 in Ragworth, Stockton-on-Tees, Durham, England. He is an actor and writer, known for Starter for 10 (2006), Bad Girls (1999) and The Black Candle (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE3ZjQzNjktZDcxZi00OTg1LWJiYTYtZWE0MzkyOTgyMTZkXkEyXkFqcGdeQXVyMzE3OTU5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0300518","name":"James Gaddas","idIMDB":"nm0300518"},"actorId":"nm0300518","character":"British I.O.","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0119368","urlIMDB":"http://www.imdb.com/title/tt0119368","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":null,"copyrightHolder":"Showtime Networks, Inc."},"technical":{"runtime":["2 hr 29 min (149 min)","1 hr 45 min (105 min) (USA)","1 hr 45 min (105 min) (Germany)"],"soundMix":["Ultra Stereo"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":["DeLuxe"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"6.5","filmingLocations":[{"location":"Dublin, County Dublin, Ireland"}],"rated":"R","awards":[{"award":"Banff Television Festival 1998","titlesAwards":[{"titleAwardOutcome":"Nominated Banff Rockie Award","categories":[{"category":"Best Made-for-TV Movie","names":[]}]}]},{"award":"Motion Picture Sound Editors, USA 1999","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing - Television Movies of the Week - Sound Effects &amp; Foley","names":[]},{"category":"Best Sound Editing - Television Movies of the Week - Music","names":[]}]}]},{"award":"PEN Center USA West Literary Awards 1999","titlesAwards":[{"titleAwardOutcome":"Won Literary Award","categories":[{"category":"Teleplay","names":[{"name":"Nicholas Meyer","id":"nm0583292","role":null}]}]}]},{"award":"Venice Film Festival 1997","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Lion","categories":[{"category":"","names":[{"name":"Jim McBride","id":"nm0564319","role":null}]}]}]}],"votes":"529","type":"Movie","companyCreditsSimple":[{"idCompany":"co0069955","name":"Hallmark Entertainment"},{"idCompany":"co0078056","name":"Johnny Loves Suzie Productions"},{"idCompany":"co0052980","name":"Showtime Networks"}],"keywords":{"keywords":["protestant","catholic","political crime","rocket launcher","bomb","informer","threat","intimidation","belfast","ulster","northern ireland","sectarianism","police brutality","witness protection","irish republican army","terrorism","ireland","independent film","based on book"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:23:09"}}