{"data":{"movies":[{"title":"Only You","originalTitle":"","year":"1994","releaseDate":"19941007","directors":[{"name":"Norman Jewison","id":"nm0422484"}],"writers":[{"name":"Diane Drake","id":"nm0236884"}],"runtime":"108 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmEzOWI2YTUtMDNkNS00MDRlLWFmMTctNDAyNTdiYjU5MDZiXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1.jpg","countries":["USA","Italy"],"languages":["English","Italian"],"genres":["Comedy","Romance"],"plot":"Destiny. Faith (Marisa Tomei) believes that two soul-mates can be united if they find each other. From the Ouija board, she has found the name of her missing half, and it is D-A-M-O-N B-R-A-D-L-E-Y. Later, at the carnival, the fortune teller sees the name Damon Bradley in the Crystal Ball and Faith is convinced. She is told that \"You make your own destiny,...don't wait for it to come to you\", but she is looking for Damon. 14 years later, she is engaged to a dull podiatrist and plans to marry until she gets a call from one of his classmates who is on his way to Venice, Italy. The classmate is Damon Bradley. Rushing to the airport to see her soul-mate, she misses him and the plane, but decides, then and there, to go after him. So Faith and her sister-in-law Kate both board the next plane for Italy hoping to find her Damon.","simplePlot":"Destiny. Faith (Marisa Tomei) believes that two soul-mates can be united if they find each other. From the Ouija board, she has found the name of her missing half, and it is D-A-M-O-N ... ","actors":[{"actorName":"Marisa Tomei","urlProfile":"http://www.imdb.com/name/nm0000673","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMjA3OTc3N15BMl5BanBnXkFtZTcwNTA1MzY1Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 December 1964","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"5' 4½\" (1.64 m)","bio":"Marisa Tomei was born on December 4, 1964, in Brooklyn, New York to mother Patricia \"Addie\" Tomei, an English teacher and father Gary Tomei, a lawyer. Marisa also has a brother, actor Adam Tomei. As a child, Marisa's mother frequently corrected her speech as to eliminate her heavy Brooklyn accent. As a teen, Marisa attended Edward R. Murrow High School and graduated in the class of 1982. She was one year into her college education at Boston University when she dropped out for a co-starring role on the CBS daytime drama As the World Turns (1956). Her role on that show paved the way for her entrance into film: in 1984, she made her film debut with a bit part in The Flamingo Kid (1984). Three years later, Marisa became known for her role as Maggie Lawton, Lisa Bonet's college roommate, on the sitcom A Different World (1987). Her real breakthrough came in 1992, when she co-starred as Joe Pesci's hilariously foul-mouthed, scene-stealing girlfriend in My Cousin Vinny (1992), a performance that won her a Best Supporting Actress Oscar. Later that year, she turned up briefly as a snippy Mabel Normand in director Richard Attenborough's biopic Chaplin (1992), and was soon given her first starring role in Untamed Heart (1993). A subsequent starring role -- and attempted makeover into Audrey Hepburn -- in the romantic comedy Only You (1994) proved only moderately successful. Marisa's other 1994 role as Michael Keaton's hugely pregnant wife in The Paper (1994) was well-received, although the film as a whole was not. Fortunately for Tomei, she was able to rebound the following year with a solid performance as a troubled single mother in Nick Cassavetes' Décroche les étoiles (1996) which earned her a Screen Actors Guild nomination for Best Supporting Actress. She turned in a similarly strong work in Welcome to Sarajevo (1997), and in 1998 did some of her best work in years as the sexually liberated, unhinged cousin of Natasha Lyonne's Vivian Abramowitz in Tamara Jenkins' Slums of Beverly Hills (1998). Marisa co-starred with Mel Gibson in the hugely successful romantic comedy What Women Want (2000) and during the 2002 movie award season, she proved her first Best Supporting Actress Oscar win was no fluke when she received her second nomination in the same category for the critically acclaimed dark drama, In the Bedroom (2001). She also made a guest appearance on the animated TV phenomenon The Simpsons (1989) as Sara Sloane, a movie star who falls in love with Ned Flanders. In 2006, she went on to do 4 episodes for Rescue Me (2004). She played Angie, the ex-wife of Tommy Calvin (Denis Leary)'s brother Johnny (Dean Winters). At age 42, Marisa took on a provocative role in legendary filmmaker Sidney Lumet's melodramatic picture Before the Devil Knows You're Dead (2007), in which she appeared nude in love scenes with costars Ethan Hawke and Philip Seymour Hoffman. Marisa then took on another provocative role as a stripper in the highly acclaimed film The Wrestler (2008) opposite Mickey Rourke. Her great performance earned her many awards from numerous film societies for Best Supporting Actress, a third Academy Award nomination, as well as nominations for a Golden Globe and a BAFTA. Many critics heralded this performance as a standout in her career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMjA3OTc3N15BMl5BanBnXkFtZTcwNTA1MzY1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000673","name":"Marisa Tomei","idIMDB":"nm0000673"},"actorId":"nm0000673","character":"Faith Corvatch","urlCharacter":"http://www.imdb.com/character/ch0023415","main":true},{"actorName":"Robert Downey Jr.","urlProfile":"http://www.imdb.com/name/nm0000375","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1965","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Robert John Downey Jr","height":"5' 8½\" (1.74 m)","bio":"Robert Downey Jr. has evolved into one of the most respected actors in Hollywood. With an amazing list of credits to his name, he has managed to stay new and fresh even after over four decades in the business. Downey was born April 4, 1965 in Manhattan, New York, the son of writer, director and filmographer Robert Downey Sr. and actress Elsie Downey (née Elsie Ann Ford). Robert's father is of half Lithuanian Jewish, one quarter Hungarian Jewish, and one quarter Irish, descent, while Robert's mother was of English, Scottish, German, and Swiss-German ancestry. Robert and his sister, Allyson Downey, were immersed in film and the performing arts from a very young age, leading Downey Jr. to study at the Stagedoor Manor Performing Arts Training Center in upstate New York, before moving to California with his father following his parents' 1978 divorce. In 1982, he dropped out of Santa Monica High School to pursue acting full time. Downey Sr., himself a drug addict, exposed his son to drugs at a very early age, and Downey Jr. would go on to struggle with abuse for decades. Downey Jr. made his debut as an actor at the age of five in the film Pound (1970), written and directed by his father, Robert Downey Sr.. He built his film repertoire throughout the 1980s and 1990s with roles in Tuff Turf (1985), Weird Science (1985), True Believer (1989), and Wonder Boys (2000) among many others. In 1992, Downey received an Academy Award nomination and won the BAFTA (British Academy Award) for Best Actor for his performance in the title role of Chaplin (1992). In Robert Altman's Short Cuts (1993), he appeared as an aspiring film make-up artist whose best friend commits murder. In Oliver Stone's Natural Born Killers (1994), with Woody Harrelson and Juliette Lewis, Downey starred as a tabloid TV journalist who exploits a murderous couple's killing spree to boost his ratings. For the comedy Heart and Souls (1993), Downey starred as a young man with a special relationship with four ghosts. In 1995, Downey starred in Restoration (1995), with Hugh Grant, Meg Ryan and Ian McKellen, directed by Michael Hoffman. Also that year, he starred in Richard III (1995), in which he appears opposite his Restoration (1995) co-star McKellen. In 1997, Downey was seen in Robert Altman's The Gingerbread Man (1998), alongside Kenneth Branagh, Daryl Hannah and Embeth Davidtz; in One Night Stand (1997), directed by Mike Figgis and starring Wesley Snipes and Nastassja Kinski; and in Hugo Pool (1997), directed by his father, Robert Downey Sr. and starring Sean Penn and Patrick Dempsey. In September of 1999, Downey appeared in Black & White (1999), written and directed by James Toback, along with Ben Stiller, Elijah Wood, Gaby Hoffmann, Brooke Shields and Claudia Schiffer. In January of 1999, he starred with Annette Bening and Aidan Quinn in In Dreams (1999), directed by Neil Jordan. In 2000, Downey co-starred with Michael Douglas and Tobey Maguire in Wonder Boys (2000), directed by Curtis Hanson. In this dramatic comedy, Downey played the role of a bisexual literary agent. In 2001, Downey made his prime-time television debut when he joined the cast of the Fox-TV series Ally McBeal (1997) as attorney \"Larry Paul\". For this role, he won the Golden Globe Award for Best Performance by an Actor in a Supporting Role in a Series, Mini-Series or Motion Picture Made for Television, as well as the Screen Actors Guild Award for Outstanding Performance by a Male in a Comedy Series. In addition, Downey was nominated for an Emmy for Outstanding Supporting Actor in a Comedy Series. The actor's drug-related problems escalated from 1996 to 2001, leading to arrests, rehab visits and incarcerations, and he was eventually fired from Ally McBeal (1997). Emerging clean and sober in 2003, Downey Jr. began to rebuild his career. He marked his debut into music with his debut album, titled \"The Futurist\", on the Sony Classics Label on November 23rd, 2004. The album's eight original songs, that Downey wrote, and his two musical numbers debuting as cover songs revealed his sultry singing voice and his musical talents. Downey displayed his versatility in two different films in October 2003: the musical/drama The Singing Detective (2003), a remake of the BBC hit of the same name, and the thriller Gothika (2003) starring Halle Berry and Penélope Cruz. Downey starred in powerful yet humbling roles inspired by real-life accounts of some of history's most precious kept secrets, including Richard Linklater's A Scanner Darkly (2006) in 2006 co-starring Keanu Reeves, Winona Ryder and Woody Harrelson, and Fur: An Imaginary Portrait of Diane Arbus (2006) co-starring Nicole Kidman, a film inspired by the life of Diane Arbus, the revered photographer whose images captured attention in the early 1960s. These roles exhibited Downey's momentum from the previous year of 2005, in which he starred in the Academy Award®-nominated feature film Good Night, and Good Luck. (2005), directed by George Clooney and in Shane Black's action comedy Kiss Kiss Bang Bang (2005) co-starring Val Kilmer. In 2007, he co-starred in David Fincher's suspenseful _Zodiac (2007/I)_ alongside Jake Gyllenhaal and Mark Ruffalo, about the notorious serial killer who haunted San Francisco during the 1970s. In May 2008, Downey achieved critical acclaim and worldwide box office success for his starring role in Iron Man (2008), Jon Favreau's big-screen rendering of the Marvel comic book superhero. The film co-starred Gwyneth Paltrow, Jeff Bridges and Terrence Howard. In August of 2008, Downey starred with Ben Stiller and Jack Black in the comedy Tropic Thunder (2008), and went on to receive an Academy Award®-nomination for Best Supporting Actor for his, Kirk Lazarus. In December 2009, Downey starred in the action-adventure Sherlock Holmes (2009). The film, directed by Guy Ritchie, co-starred Jude Law and Rachel McAdams and earned Downey a Golden Globe for Best Performance by an Actor in a Motion Picture - Comedy or Musical in January of 2010. In early Summer 2010, Downey re-teamed with director Jon Favreau and reprised his role as \"Tony Stark/Iron Man\" in the hugely successful sequel to the original film, Iron Man 2 (2010), starring Gwyneth Paltrow, Scarlett Johansson, Samuel L. Jackson and Mickey Rourke. Downey next starred in Due Date (2010), a comedy directed by Todd Phillips, in which he plays the role of an expectant father on a road trip racing to get back in time for the birth of his first child. Due Date (2010), starring The Hangover (2009)'s Zach Galifianakis, was released in November 2010. Downey was honored by Time Magazine's \"Time 100\" in 2008, an annual list of the 100 most influential people in the world. His laurels include two Academy Award nominations, three Golden Globe wins, numerous other award nominations and wins, and tremendous popular and commercial success, particularly in his roles as Sherlock Holmes and Tony Stark (the latter of which he has so far played in Iron Man (2008), Iron Man 2 (2010), The Avengers (2012), Iron Man 3 (2013), and Avengers: Age of Ultron (2015). For three consecutive years, from 2012 to 2015, Downey has topped the Forbes list of Hollywood's highest-paid actors, making an estimated $80 million in earnings between June 2014 and June 2015. In 2005, Downey Jr. married Susan Downey, who gave birth to their son, Exton Elias Downey, on February 7, 2012. Downey also has another son, Indio Falconer Downey, born September 7, 1993, from his first marriage to Deborah Falconer, from whom he was officially divorced in 2004. Robert has jump-started the Team Downey Production Company with wife Susan Downey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000375","name":"Robert Downey Jr.","nicknames":["Bob","RDJ"],"idIMDB":"nm0000375"},"actorId":"nm0000375","character":"Peter Wright","urlCharacter":"http://www.imdb.com/character/ch0177395","main":true},{"actorName":"Bonnie Hunt","urlProfile":"http://www.imdb.com/name/nm0001372","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MDI4OTU0NF5BMl5BanBnXkFtZTcwMjUyNjk1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 September 1961","placeOfBirth":" Chicago, Illinois, USA","birthName":"Bonnie Lynn Hunt","height":"5' 8\" (1.73 m)","bio":"Bonnie Hunt was born on September 22, 1961 in Chicago, Illinois, USA as Bonnie Lynn Hunt. She is a producer and writer, known for The Bonnie Hunt Show (2008), Return to Me (2000) and The Green Mile (1999). She was previously married to John Murphy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MDI4OTU0NF5BMl5BanBnXkFtZTcwMjUyNjk1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001372","name":"Bonnie Hunt","idIMDB":"nm0001372"},"actorId":"nm0001372","character":"Kate","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joaquim de Almeida","urlProfile":"http://www.imdb.com/name/nm0021835","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MjkxNDkzMl5BMl5BanBnXkFtZTgwNDQ5NjU5MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 March 1957","placeOfBirth":" São Sebastião da Pedreira, Lisbon, Portugal","birthName":"Joaquim António Portugal Baptista de Almeida","height":"5' 7¾\" (1.72 m)","bio":"Joaquim de Almeida was born in Lisbon, Portugal. Son of two pharmacists and the sixth of eight kids, Joaquim showed signs at an early age that his future lay not in the family business. At the age of eighteen, after attending the theater course at the Lisbon Conservatory for two years, he left Portugal to pursue his studies after the Conservatory was temporarily closed following the 1974 democratic revolution. He lived a year in Vienna, Austria, working in various jobs from the Künstlerhaus-Theater to gardening. He moved to New York City in 1976. There, he studied with Lee Strasberg, Nicholas Ray and Stella Adler while working as a bartender. After doing some theater and small roles in Soap Operas, he finally landed his first role in a film \"The Soldier\" in 1981. The following year he had his first important role in \"Honorary Consul\", working next to Richard Gere, Michael Caine and Bob Hoskins. But it was his third film \"Good Morning Babylon\", directed by Paolo and Vittorio Taviani, that opened the Cannes Film Festival in 1987, that propelled him to an international career. Being fluent in six languages has helped him to work everywhere in the world. He hasn't stopped since then. He has been in more then 90 films and Television shows acting with actors and directors like Harrison Ford, Gene Hackman, Kim Basinger, Antonio Banderas, Robert Rodriguez, Steven Soderberg, Benicio del Toro and Kiefer Sutherland among others. It was while playing the main villain in season 3 of the popular series \"24\", that he discovered the pleasure of living on the beach and he moved to Santa Monica where he lives today. He spends long periods in Portugal where he has a house in Sintra to be with his son Louren and his daughter Ana. Joaquim de Almeida became an American citizen in 2005 and kept his Portuguese nationality. He has been the recipient of many awards: Best Actor - Cairo Film Festival 1991, Golden Globe Best Actor Portugal 1995,1997,2001, SAG Awards- Best ensemble 2005, Portuguese Foreign Press-Personality of the year 1995, Career Award in Festival Cinema de Badajoz 2004, Career Award Festival Iberoamericano de Huelva 2009, Career Award Festival de Cine de Punta del Este 2003, Gold Medal City of Sintra 2008, Gold Medal City of Setubal 2006 and the Order of Infante by the President of Portugal.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MjkxNDkzMl5BMl5BanBnXkFtZTgwNDQ5NjU5MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0021835","name":"Joaquim de Almeida","nicknames":["Quim"],"idIMDB":"nm0021835"},"actorId":"nm0021835","character":"Giovanni","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fisher Stevens","urlProfile":"http://www.imdb.com/name/nm0001770","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MTE2NTMxM15BMl5BanBnXkFtZTYwNjkwMDM0._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 November 1963","placeOfBirth":" Chicago, Illinois, USA","birthName":"Steven Fisher","height":"5' 7\" (1.7 m)","bio":"Fisher Stevens moved from his native Chicago to New York at the age of 13 to pursue an acting career. He tried, unsuccessfully, to get any kind of job and was, he recalls, even rejected as extra for a Crest commercial. When his acting teacher, Dan Fauci, lost the lease to his teaching studio, he rented Fisher's loft and built a stage in the living room. He later studied with Uta Hagen. His first professional theatrical production was playing Tiny Tim's brother, Harry, in the musical version of Dickens' \"A Christmas Carol\" in the basement of an off-off-off Broadway theatre when he was 14. Since then he has performed in more than 20 stage productions including 544 performances in Harvey Fierstein's \"Torch Song Triology\", both on and off Broadway. He also played Eugene in Neil Simon's \"Brighton Beach Memories\". Most recently, he played the leads in Thomas Babe's \"Carrying School Children\", \"Almost Romance\" opposite Helen Slater and Jules Feiffer's \"Little Murders\" with Christine Lahti. He also sang and danced in the musicals \"Miami\" by Wendy Wasserstein and the late Michael Bennett's Broadway production of \"Scandal\" with Swoosie Kurtz and Treat Williams. He also appeared in the recent New York City Shakespeare Festival production of \"A Midsummer Nights Dream\". Fisher made his motion picture debut getting his fingers chopped off in the horror film The Burning (1981) when he was 16-years-old. After that he appeared in Baby It's You (1983) and The Brother from Another Planet (1984). He co-starred with Matt Dillon in the hit comedy film The Flamingo Kid (1984) where he met the then fledgling producer Gary Foster. He appeared as sidekick to Steve Guttenberg's character in Short Circuit (1986). In television he has performed in ABC's Ryan's Hope (1975), Showtime's Tall Tales & Legends (1985) and CBS' Early Edition (1996). Despite having lived in New York City for more than a decade, where, with some other actors, Stevens has started an off-off-off Broadway theatre company called Naked Angels, he insists that he is still a fan of the Chicago Cubs.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MTE2NTMxM15BMl5BanBnXkFtZTYwNjkwMDM0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001770","name":"Fisher Stevens","idIMDB":"nm0001770"},"actorId":"nm0001770","character":"Larry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Billy Zane","urlProfile":"http://www.imdb.com/name/nm0000708","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NzA2NTE0NF5BMl5BanBnXkFtZTcwNzAxMTUxMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1966","placeOfBirth":" Chicago, Illinois, USA","birthName":"William George Zane Jr.","height":"6' 0½\" (1.84 m)","bio":"William George Zane, better known as Billy Zane, was born on February 24, 1966 in Chicago, Illinois, to Thalia (Colovos) and William Zane, both of Greek ancestry. His parents were amateur actors and managed a medical technical school. Billy has an older sister, actress and singer Lisa Zane. Billy was bitten by the acting bug early on. In his early teens, he attended Harand Camp of the Theater Arts in Elkhart Lake, Wisconsin. In 1982, he attended the American School in Switzerland. His high school days were spent at Francis Parker High School in Chicago, Illinois. Daryl Hannah and Jennifer Beals also attended Parker, prior to Billy's attendance. Soon after graduating from high school, Billy decided to venture out to California to attempt acting for the first time. Within three weeks, he won his very first big screen role in Back to the Future (1985), playing the role of Match, one of Biff Tannen's thugs. He would later reprise that role for the sequel Back to the Future Part II (1989). Then after a small role in the science fiction horror film Critters (1986), he landed starring roles in several television films. Billy played villain Hughie Warriner in the Australian thriller film Calme blanc (1989), where he met his future wife, Lisa Collins. He also co-starred in Memphis Belle (1990), a film version of a 1944 documentary about a World War II bomber. In 1991, he appeared as John Justice Wheeler on several episodes of David Lynch's television series Twin Peaks (1990). Billy starred as the eponymous superhero in Le fantôme du Bengale (1996) and as Caledon Hockley in the billion dollar grossing Titanic (1997). Then, he starred in the television movie Cléopatre (1999) where he met his soon-to-be fiance, actress Leonor Varela from whom he subsequently separated. In 2005, he had a recurring role as the poetry loving ex-demon Drake on the television series Charmed (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NzA2NTE0NF5BMl5BanBnXkFtZTcwNzAxMTUxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000708","name":"Billy Zane","idIMDB":"nm0000708"},"actorId":"nm0000708","character":"The False Damon Bradley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adam LeFevre","urlProfile":"http://www.imdb.com/name/nm0480775","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2OTY5NzE5Ml5BMl5BanBnXkFtZTcwMTk3NjgwMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 August 1950","placeOfBirth":" Albany, New York, USA","bio":"Adam LeFevre was born on August 11, 1950 in Albany, New York, USA. He is an actor, known for The Lucky One (2012), Hitch (2005) and She's Out of My League (2010). He was previously married to Cora Ann Bennett.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2OTY5NzE5Ml5BMl5BanBnXkFtZTcwMTk3NjgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0480775","name":"Adam LeFevre","idIMDB":"nm0480775"},"actorId":"nm0480775","character":"Damon Bradley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Benjamin Hickey","urlProfile":"http://www.imdb.com/name/nm0382632","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjI4Nzc5MzE3Nl5BMl5BanBnXkFtZTgwMDQ1OTcyMTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 June 1963","placeOfBirth":" Plano, Texas, USA","bio":"John Benjamin Hickey was born on June 25, 1963 in Plano, Texas, USA. He is an actor, known for Flags of Our Fathers (2006), Transformers: Revenge of the Fallen (2009) and The Bone Collector (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjI4Nzc5MzE3Nl5BMl5BanBnXkFtZTgwMDQ1OTcyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0382632","name":"John Benjamin Hickey","idIMDB":"nm0382632"},"actorId":"nm0382632","character":"Dwayne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Siobhan Fallon Hogan","urlProfile":"http://www.imdb.com/name/nm0266441","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMTExMDgzMV5BMl5BanBnXkFtZTgwMTI5MjQ2ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 May 1961","placeOfBirth":" Syracuse, New York, USA","bio":"Siobhan Fallon Hogan has been seen in several blockbusters over the past twenty years. She is playing Arlene Moran, Sheriff Arnold Pope's (Terrence Howard) secretary in FX's Wayward Pines by Chad Hodge and Blake Crouch. The redheaded character actress has had many memorable roles in film and television. She was born in 1961 in Syracuse, New York, to Jane (Eagan) and William J. Fallon, an attorney, and is the second of five children. A graduate of Le Moyne College in Syracuse, she received her M.F.A. from Catholic University. She began her career on stage in her own character-driven, one-women shows. After appearing in her show, \"Bat Girl,\" she was cast on _\"Saturday Night Live\" in 1992. This show opened many doors for Fallon, and she then began to work steadily in film. Although she began in comedy, Fallon has a following in dramatic foreign films, notably Lars von Trier's Dancer in the Dark (2000) and Dogville (2003). She also played in Michael Haneke's Funny Games (2007). Her television credits include a recurring role on Seinfeld (1989) as Elaine's roommate, Alec Baldwin's sister on 30 Rock (2006) and several other guest spots. She has been happily married to commodities trader Peter Hogan for over twenty years. They have three children: Bernadette, Peter and Sinead.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMTExMDgzMV5BMl5BanBnXkFtZTgwMTI5MjQ2ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0266441","name":"Siobhan Fallon Hogan","idIMDB":"nm0266441"},"actorId":"nm0266441","character":"Leslie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Antonia Rey","urlProfile":"http://www.imdb.com/name/nm0712744","urlPhoto":"","biography":{"dateOfBirth":"12 October 1927","placeOfBirth":" Havana, Cuba","birthName":"Antonia Francesch","bio":"Antonia Rey was born on October 12, 1927 in Havana, Cuba as Antonia Francesch. She is an actress, known for Jacob's Ladder (1990), Hair (1979) and Only You (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0712744","name":"Antonia Rey","idIMDB":"nm0712744"},"actorId":"nm0712744","character":"Fortune Teller","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Phyllis Newman","urlProfile":"http://www.imdb.com/name/nm0628233","urlPhoto":"","biography":{"dateOfBirth":"19 March 1933","placeOfBirth":" Jersey City, New Jersey, USA","bio":"Phyllis Newman was born on March 19, 1933 in Jersey City, New Jersey, USA. She is an actress, known for The Match Game (1962), The Tonight Show Starring Johnny Carson (1962) and One Life to Live (1968). She was previously married to Adolph Green.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0628233","name":"Phyllis Newman","idIMDB":"nm0628233"},"actorId":"nm0628233","character":"Faith's Mother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Denise Du Maurier","urlProfile":"http://www.imdb.com/name/nm0238899","urlPhoto":"","biography":{"bio":"Denise Du Maurier is an actress, known for Only You (1994) and Bill's Gun Shop (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0238899","name":"Denise Du Maurier","idIMDB":"nm0238899"},"actorId":"nm0238899","character":"Dwayne's Mother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tammy Minoff","urlProfile":"http://www.imdb.com/name/nm0591547","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWM2YTk1NjktZDZhZC00NjljLWI0ZmUtZDQwMzUwMmFiMGE2XkEyXkFqcGdeQXVyMTUzMTM2NzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1979","placeOfBirth":" New York City, New York, USA","bio":"Tammy Minoff was born on October 4, 1979 in New York City, New York, USA. She is an actress and director, known for Only You (1994), I Am Not a Hipster (2012) and Limerence (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWM2YTk1NjktZDZhZC00NjljLWI0ZmUtZDQwMzUwMmFiMGE2XkEyXkFqcGdeQXVyMTUzMTM2NzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0591547","name":"Tammy Minoff","idIMDB":"nm0591547"},"actorId":"nm0591547","character":"Young Faith","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harry Barandes","urlProfile":"http://www.imdb.com/name/nm0052968","urlPhoto":"","biography":{"dateOfBirth":"30 November 1978","placeOfBirth":" New York City, New York, USA","height":"5' 7\" (1.7 m)","bio":"Harry Barandes was born on November 30, 1978 in New York City, New York, USA. He is an actor, known for Only You (1994), The Tale of Peter Rabbit (1991) and The Sonnet Project (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0052968","name":"Harry Barandes","idIMDB":"nm0052968"},"actorId":"nm0052968","character":"Young Larry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jessica Hertel","urlProfile":"http://www.imdb.com/name/nm0381013","urlPhoto":"","biography":{"bio":"Jessica Hertel is an actress, known for Only You (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0381013","name":"Jessica Hertel","idIMDB":"nm0381013"},"actorId":"nm0381013","character":"Young Kate","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0110737","urlIMDB":"http://www.imdb.com/title/tt0110737","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"£1,123,230","country":"UK","day":"22","month":"02","year":"1995","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1993/\">1993</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 55 min (115 min)","1 hr 44 min (104 min) (Finland)","1 hr 48 min (108 min) (France)"],"soundMix":["Dolby","SDDS","Dolby Digital"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panaflex Camera and Lenses by Panavision"],"laboratory":["Technicolor"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.5","filmingLocations":[{"location":"Chicago Studio City - 5660 W. Taylor Street, Austin, Chicago, Illinois, USA"}],"rated":"PG","awards":[],"votes":"16,248","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005883","name":"TriStar Pictures"},{"idCompany":"co0177300","name":"Fried/Woods Films"},{"idCompany":"co0184088","name":"Yorktown Productions"}],"keywords":{"keywords":["italy","sister in law","trip","soul mate","telephone call","teacher","shoe","love at first sight","crystal ball","airport","ouija board","telephone","italian","fortune teller","childhood","venice italy","ouija","infidelity","adultery","affair","cheating wife","camera shot of feet","punched in the face","swim suit","school class","roof","rooftop","public address system","podiatry","plato","marital separation","marital problem","marital love","loudspeaker","lost shoe","kiss","husband wife relationship","high heels","fistfight","false identity","extramarital affair","concierge","brother sister relationship","boat","bellman","bathing suit","airport security","airplane","airplane trip","bathtub","fate","engagement","assumed identity","american abroad","wine","wedding dress","water balloon","waiter","television","taxi","sunglasses","strike","sheep","saxophone","running out of gas","rome italy","ring","restaurant","rental car","pool","mistaken identity","icon","hotel clerk","hospital","horse and carriage","gypsy","full moon","fainting","driving","doctor","disguise","dancing","canal","binoculars","amusement park","aviation","mad love","yacht","title based on song"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:13:37"}}