{"data":{"movies":[{"title":"Gorgeous","originalTitle":"Boh lei chun","year":"1999","releaseDate":"19990206","directors":[{"name":"Vincent Kok","id":"nm0463674"}],"writers":[{"name":"Jackie Chan","id":"nm0000329"},{"name":"Ivy Ho","id":"nm0387306"}],"runtime":"121 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NjMzODkxNV5BMl5BanBnXkFtZTcwMzk2NDMyMQ@@._V1.jpg","countries":["Hong Kong","Taiwan"],"languages":["Cantonese","English","Mandarin","Japanese","Min Nan"],"genres":["Action","Comedy","Romance"],"plot":"A Taiwanese girl named Bu has just been proposed to. While pondering the proposal, she finds a message in a bottle which inspires her go to Hong Kong to meet the guy, Albert, who wrote the message. However, she finds out that Albert is gay. A successful playboy businessman CN, and Howie have been rivals in love and business since school days. Howie finds out that CN is dating his girl and also trying to take over his company. Howie tells his guys to teach CN a lesson. Bu happens to be there and saves CN, but decides to fake her identity and scheme to make him fall in love with her. In the meantime Howie, who wants to teach CN a humiliating lesson, hires a highly trained foreign fighter to beat him.","simplePlot":"A romantic girl travels to Hong Kong in search of certain love but instead meets a kind-hearted professional fighter with whom she begins to fall for instead.","actors":[{"actorName":"Jackie Chan","urlProfile":"http://www.imdb.com/name/nm0000329","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MDM0MDUzM15BMl5BanBnXkFtZTcwOTI4MzU1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 April 1954","placeOfBirth":" Victoria Peak, Hong Kong","birthName":"Kong-sang Chan","height":"5' 8½\" (1.74 m)","bio":"Hong Kong's cheeky, lovable and best known film star, Jackie Chan endured many years of long, hard work and multiple injuries to establish international success via his early beginnings in Hong Kong's manic martial arts cinema industry. Jackie was born Kong-sang Chan on Hong Kong's famous Victoria Peak on April 7, 1954, to Charles and Lee-Lee Chan, and the family emigrated to Canberra, Australia, in early 1960. The young Jackie was less than successful scholastically, so his father sent him back to Hong Kong to attend the rigorous China Drama Academy, one of the Peking Opera schools. Chan excelled at acrobatics, singing and martial arts and eventually became a member of the \"Seven Little Fortunes\" performing troupe and began lifelong friendships with fellow martial artists / actors Sammo Kam-Bo Hung and Biao Yuen. Chan journeyed back and forth to visit his parents and work in Canberra, but eventually he made his way back to Hong Kong as his permanent home. In the early 1970s Chan commenced his movie career and interestingly appeared in very minor roles in two films starring then rising martial arts superstar Bruce Lee: The Chinese Connection (1972), aka \"Fist of Fury\" aka \"The Chinese Connection\", and the Warner Bros. production Opération dragon (1973). Not long after Lee's untimely death Chan was often cast in films cashing in on the success of Bruce Lee by utilizing words like \"fist\", \"fury\" or \"dragon\" in their US release titles. Chan's own film career was off and running and he swiftly appeared in many low-budget martial arts films that were churned out at a rapid fire pace by Hong Kong studios eager to satisfy the early 1970s boom in martial-arts cinema. He starred in Shaolin Wooden Men (1976) (aka \"Shaolin Wooden Men\"), Jian hua yan yu jiang nan (1977) (aka \"To Kill With Intrigue\"), Le protecteur (1978) (aka \"Half A Loaf of Kung Fu\") and Fei du juan yun shan (1978) (aka \"Magnificent Bodyguards\"), which all fared reasonably well at the cinemas. However, he scored a major breakthrough with the hit Drunken Master (1978) (aka \"Drunken Master\"), which has become a cult favorite among martial arts film fans. Not too long after this, Chan made his directorial debut with La danse du lion (1980) (aka \"The Young Master\") and then \"Enter the Dragon\" producer Robert Clouse lured Jackie to the US for a film planned to break Jackie into the lucrative US market. Battle Creek Brawl (1980) (aka \"Battle Creek Brawl\") featured Jackie competing in a \"toughest street fighter\" contest set in 1940s Texas; however, Jackie was unhappy with the end result, and it failed to fire with US audiences. In a further attempt to get his name known in the US, Jackie was cast alongside Burt Reynolds, Roger Moore and Dean Martin in the Hal Needham-directed car chase flick The Cannonball Run (1981). Regrettably, Jackie was cast as a Japanese race driver and his martial arts skills are only shown in one small sequence near the film's conclusion. Stateside success was still a few years away for Jackie Chan! Undeterred, he returned to the Orient to do what he did best--make jaw-dropping action films loaded with amazing stunt work. Chan and his legendary stunt team were unparalleled in their ability to execute the most incredible fight scenes and action sequences, and the next decade would see some of their best work. Chan paired with the dynamic Sammo Hung Kam-Bo to star in Winners & Sinners (1983) (aka \"Winners & Sinners\"), Project A (1983) (aka \"Project \"A\"), Soif de justice (1984) (aka \"Wheels On Meals\"), Le flic de Hong Kong (1985) (aka \"Winners & Sinners 2\"), My Lucky Stars 2: Twinkle Twinkle Lucky Stars (1985) (aka \"My Lucky Stars 2\", aka \"Winners & Sinners 3\"(. Chan then journeyed back to the US for another shot at that market, starring alongside Danny Aiello in The Protector (1985),) filmed in Hong Kong and New York. However, as with previous attempts, Jackie felt the US director--in this case, James Glickenhaus--failed to understand his audience appeal and the film played to lukewarm reviews and box-office receipts. Jackie did, however, decide to \"harden\" up his on-screen image somewhat and his next film, Police Story (1985) (aka \"Police Story\") was a definite departure from previously light-hearted martial arts fare, and his fans loved the final product! This was quickly followed up with the Raiders of the Lost Ark (1981)-influenced Mister Dynamite (1986) (aka \"The Armour of God\"), during filming of which Jackie mistimed a leap from a wall to a tree on location in Yugoslavia and fell many quite a few feet onto his head, causing a skull fracture. It was another in a long line of injuries that Chan has suffered as a result of doing his own stunt work, and he was soon back in front of the cameras. Project A 2 (1987) (aka \"Project A: Part 2\"), Police Story 2 (1988) (aka \"Police Story 2\"), Miracles - Mr. Canton and Lady Rose (1989) (aka \"Mr. Canton and Lady Rose)\", Armour of God 2: Operation Condor (1991) (aka \"Armour of God 2\") and Police Story 3: Supercop (1992) (aka \"Police Story 3\") were all sizable hits for Jackie, escalating his status to phenomenal heights in Asia, and to his loyal fan base around the globe. US success was now just around the corner for the the hard-working Jackie Chan, and it arrived in the form of the action film Rumble in the Bronx (1995) (aka \"Rumble In The Bronx\", though it was actually filmed in Canada) that successfully blended humor and action to make a winning formula in US theaters. Jackie did not waste any time and went to work on Police Story 4: First Strike (1996) (aka \"Police Story 4\"), Mr. Nice Guy (1997) (aka \"Mr. Nice Guy\"), Who Am I? (1998) (aka \"Who Am I\"), which all met with positive results at the international box office. Jackie then went to work in the his biggest-budget US production, starring alongside fast-talking comedian Chris Tucker in the action / comedy Rush Hour (1998). The film was a bigger hit than \"Rumble In the Bronx\" and firmly established Jackie as a bona fide star in the US. Jackie then paired up with rising talent Owen Wilson to star in Shanghai Noon (2000) and its sequel, Shanghai Knights (2003), and re-teamed with Tucker in Rush Hour 2 (2001), as well as starring in The Tuxedo (2002), Le médaillon (2003) and the delightful Around the World in 80 Days (2004). Not one to forget his loyal fan base, Jackie returned to more gritty and traditional fare with New Police Story (2004) (aka \"New Police Story\") and The Myth (2005) (aka \"The Myth\"). The multi-talented Chan (he's also a major recording star in Asia) shows no sign of slowing down and has long since moved out of the shadow of Bruce Lee, to whom he was usually compared early in his career. Chan is truly one of the international film industry's true maverick actor / director / stuntman / producer combinations - he has done it the hard way, and always his way to achieve his dreams and goals to be an international cinematic star. Off screen he has been directly involved in many philanthropic ventures providing financial assistance to schools and universities around the world. He is a UNICEF GoodWill Ambassador, and he has campaigned against animal abuse and pollution and assisted with disaster relief efforts to the 2004 Indian Ocean Tsunami victims.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MDM0MDUzM15BMl5BanBnXkFtZTcwOTI4MzU1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000329","name":"Jackie Chan","nicknames":["Y'uen Lo","Sing Lung","Pao Pao","Kung-Fu Master"],"idIMDB":"nm0000329"},"actorId":"nm0000329","character":"C.N. Chan","urlCharacter":"http://www.imdb.com/character/ch0039051","main":true},{"actorName":"Qi Shu","urlProfile":"http://www.imdb.com/name/nm0795517","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NjAwNDIyNV5BMl5BanBnXkFtZTYwMzg1MTI1._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 April 1976","placeOfBirth":" Taipei, Taiwan","birthName":"Li-Hui Lin","height":"5' 6\" (1.68 m)","bio":"Born in Taiwan, Qi Shu has won the prestigious Golden Horse Awards in Taiwan (regarded as the East Asian Oscars) for Best Supporting Actress. She has also received a nomination for Best Actress from the Golden Horse Awards. She appeared with Jackie Chan in the romantic comedy Gorgeous (1999) (\"Gorgeous\"). Her name is spelled in a variety of ways, including Hsu Qi, Hsu Chi, Qi Shu, and Shu Kei, and there are quite a few other variations on her name on foreign V.C.D.s, D.V.D.s, and internet sites.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NjAwNDIyNV5BMl5BanBnXkFtZTYwMzg1MTI1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0795517","name":"Qi Shu","idIMDB":"nm0795517"},"actorId":"nm0795517","character":"Bu","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony Chiu-Wai Leung","urlProfile":"http://www.imdb.com/name/nm0504897","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYzNjYzMzk0Ml5BMl5BanBnXkFtZTYwNDUzMDU0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 June 1962","placeOfBirth":" Hong Kong","height":"5' 7½\" (1.71 m)","bio":"Tony Leung Chiu Wai was born in Hong Kong on 27 June 1962. He and his younger sister were raised by their mother after his father left them. In 1982, after passing the training courses of TVB, Tony became a TV actor and became famous for his comedy style in such TV shows as Lu ding ji (1983) or Jue dai shuang jiao (1979). However, he didn't limit himself to television and began showing his versatility in films like My Heart Is That Eternal Rose (1989) and La cité des douleurs (1989). After he starred in several movies directed by 'Kar wai Wong'; such as Chungking Express (1994) and Happy Together (1997), he gained more respect as an actor and finally received the Best Actor Award at the Cannes International Film Festival for his outstanding performance in In the Mood for Love (2000). In addition to his acting career, he is also known as a singer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYzNjYzMzk0Ml5BMl5BanBnXkFtZTYwNDUzMDU0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0504897","name":"Tony Chiu-Wai Leung","nicknames":["Short Tony"],"idIMDB":"nm0504897"},"actorId":"nm0504897","character":"Albert","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emil Chau","urlProfile":"http://www.imdb.com/name/nm0154235","urlPhoto":"","biography":{"dateOfBirth":"22 December 1960","placeOfBirth":" Hong Kong","height":"5' 8\" (1.73 m)","bio":"Emil Chau was born on December 22, 1960 in Hong Kong. He is an actor, known for Gorgeous (1999), Mr. Nice Guy (1997) and Purple Storm (1999). He has been married to Constance Woods since 1986. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0154235","name":"Emil Chau","idIMDB":"nm0154235"},"actorId":"nm0154235","character":"L.W. Lo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richie Jen","urlProfile":"http://www.imdb.com/name/nm0719104","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NDcxNzI1M15BMl5BanBnXkFtZTcwNTg5NTMyNQ@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 June 1966","placeOfBirth":" Changhua, Taiwan","birthName":"Hsien-Chi Jen","height":"5' 9¾\" (1.77 m)","bio":"Richie Jen was born on June 23, 1966 in Changhua, Taiwan as Hsien-Chi Jen. He is an actor, known for Breaking news (2004), La vie sans principe (2011) and Trivisa (2016). He is married to Tina Chen. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NDcxNzI1M15BMl5BanBnXkFtZTcwNTg5NTMyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0719104","name":"Richie Jen","nicknames":["Xiao Qi","Xiao Chi"],"idIMDB":"nm0719104"},"actorId":"nm0719104","character":"Long-Yi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ken Lo","urlProfile":"http://www.imdb.com/name/nm0516310","urlPhoto":"","biography":{"dateOfBirth":"19 March 1957","placeOfBirth":" Laos","birthName":"Kenneth Lo Wai-Kwong","height":"5' 10¾\" (1.8 m)","bio":"Ken Lo was born on March 19, 1957 in Laos as Kenneth Lo Wai-Kwong. He is known for his work on The Legend of Drunken Master (1994), Rush Hour (1998) and New Police Story (2004). He was previously married to Suk Yin Lai.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0516310","name":"Ken Lo","nicknames":["Kwong Jai"],"idIMDB":"nm0516310"},"actorId":"nm0516310","character":"Lo's Bodyguard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sung Young Chen","urlProfile":"http://www.imdb.com/name/nm0150844","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTFhMDA2MjQtYzZhOS00NWJlLTgwN2UtOTZjMzcyZTk2MTYxL2ltYWdlXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1945","placeOfBirth":" Taiwan","bio":"Sung Young Chen was born in 1945 in Taiwan. He is an actor and director, known for La cité des douleurs (1989), The New Legend of Shaolin (1994) and Gorgeous (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTFhMDA2MjQtYzZhOS00NWJlLTgwN2UtOTZjMzcyZTk2MTYxL2ltYWdlXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0150844","name":"Sung Young Chen","idIMDB":"nm0150844"},"actorId":"nm0150844","character":"Bu's Father","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elaine Jin","urlProfile":"http://www.imdb.com/name/nm0157805","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTIzNDQ3M2UtNDFlNi00ZWE0LTgwOWEtNTRkZWY2ZTdlOTNhXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 December 1954","placeOfBirth":" Taiwan","birthName":"Yen-ling Chin","bio":"Elaine Jin was born on December 15, 1954 in Taiwan as Yen-ling Chin. She is an actress, known for Yi Yi (2000), Port of Call (2015) and Une belle journée d'été (1991). She was previously married to Robert Wong and Lawrence Tin-Bun Leung.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTIzNDQ3M2UtNDFlNi00ZWE0LTgwOWEtNTRkZWY2ZTdlOTNhXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0157805","name":"Elaine Jin","idIMDB":"nm0157805"},"actorId":"nm0157805","character":"Bu's Mother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bradley James Allan","urlProfile":"http://www.imdb.com/name/nm0015904","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNTAyNjk5N15BMl5BanBnXkFtZTcwMzY2MTIyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 February 1973","placeOfBirth":" Melbourne, Victoria, Australia","height":"5' 4¼\" (1.63 m)","bio":"BRAD ALLAN: Born with an inherent fascination of all things Chinese, Brad Allan started studying martial arts, boxing, gymnastics and Chinese circus arts from the age of 10 years. At age 15 years, Brad met two of China's greatest wushu athletes Liang Chang Xing and Tang Lai Wei of the renowned Beijing Wushu Team (the same team as Jet Li). Under their expert guidance Brad quickly rose to become one of Australia's top wushu athletes. At the age of 22 years Brad returned to Australia after several years studying language and martial arts in Asia. It was in his home town of Melbourne that he met his mentor and master, Jackie Chan. A chance encounter gave Brad an opportunity to demonstrate his skills to Jackie and his team; a dream come true that would change his life forever. As the first non-Asian member, Brad would spend the next 12 years traveling and performing around the world as part of the illustrious JACKIE CHAN STUNT TEAM. It was during this time and under Jackie's direct guidance that Brad would progress from stunt performer, to action choreographer, to stunt coordinator and finally action director. Brad Allan has travelled one of the more unique paths to Hollywood and brings a unique visual style that combines the best of the east and west. Action transcends language and cultural boundaries; It can excite us, move us and make us laugh. Brad Allan has a global vision for action film making. He works with an international team of skilled professionals from all over the world united by their passion for action and film making. His goal is to entertain, excite and motivate the human race.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNTAyNjk5N15BMl5BanBnXkFtZTcwMzY2MTIyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0015904","name":"Bradley James Allan","nicknames":["Bai-Hu"],"idIMDB":"nm0015904"},"actorId":"nm0015904","character":"Alan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tats Lau","urlProfile":"http://www.imdb.com/name/nm0490624","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2VkMTBkZmUtOGY1Ni00ZjFlLTg0YmItZDZlNTY5Y2ExYWNiXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 February 1963","placeOfBirth":" Hong Kong, China","bio":"Tats Lau was born on February 23, 1963 in Hong Kong, China. He is an actor and composer, known for Ip Man 3 (2015), Gorgeous (1999) and Forbidden City Cop (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2VkMTBkZmUtOGY1Ni00ZjFlLTg0YmItZDZlNTY5Y2ExYWNiXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0490624","name":"Tats Lau","idIMDB":"nm0490624"},"actorId":"nm0490624","character":"Chan's Assistant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vincent Kok","urlProfile":"http://www.imdb.com/name/nm0463674","urlPhoto":"","biography":{"dateOfBirth":"15 August 1965","placeOfBirth":" Hong Kong","bio":"Vincent Kok was born on August 15, 1965 in Hong Kong. He is an actor and writer, known for Gorgeous (1999), Shaolin Soccer (2001) and CJ7 (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0463674","name":"Vincent Kok","idIMDB":"nm0463674"},"actorId":"nm0463674","character":"Man at Pier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sandra Kwan Yue Ng","urlProfile":"http://www.imdb.com/name/nm0510950","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmVmYjFhOGYtNjM4ZS00ZGY3LWExZWQtODk0ZmJiNjU1YmQ5XkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 August 1965","placeOfBirth":" Hong Kong, China","bio":"Sandra Kwan Yue Ng was born on August 2, 1965 in Hong Kong, China. She is an actress and producer, known for Echoes of the Rainbow (2010), Golden Chicken (2002) and Young and Dangerous: Portland Street Blues (1998). She is married to Peter Ho-Sun Chan. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmVmYjFhOGYtNjM4ZS00ZGY3LWExZWQtODk0ZmJiNjU1YmQ5XkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0510950","name":"Sandra Kwan Yue Ng","idIMDB":"nm0510950"},"actorId":"nm0510950","character":"Airport Pickpocket","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sam Lee","urlProfile":"http://www.imdb.com/name/nm0498189","urlPhoto":"","biography":{"dateOfBirth":"27 September 1975","placeOfBirth":" Hong Kong","height":"5' 7\" (1.7 m)","bio":"Sam Lee was born on September 27, 1975 in Hong Kong. He is an actor, known for Made in Hong Kong (1997), Pinpon (2002) and Dog Bite Dog (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0498189","name":"Sam Lee","idIMDB":"nm0498189"},"actorId":"nm0498189","character":"Robber","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kar-Ying Law","urlProfile":"http://www.imdb.com/name/nm0437630","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjc0OGFkYzMtYWVmOS00YzM5LTkyNWUtNTY5NWM1ZmFmOTk0XkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 August 1947","placeOfBirth":" Guangzhou, Guangdong, China","bio":"Kar-Ying Law was born on August 27, 1947 in Guangzhou, Guangdong, China. He is known for his work on Crime story (1993), Le roi singe 1 - La boîte de Pandore (1995) and Summer Snow (1995). He has been married to Ming-Chuen Wang since May 2, 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjc0OGFkYzMtYWVmOS00YzM5LTkyNWUtNTY5NWM1ZmFmOTk0XkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0437630","name":"Kar-Ying Law","idIMDB":"nm0437630"},"actorId":"nm0437630","character":"Restaurant Manager","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Chow","urlProfile":"http://www.imdb.com/name/nm0159507","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MzgyNTMyN15BMl5BanBnXkFtZTcwNTgwMzgyMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 June 1962","placeOfBirth":" Hong Kong","birthName":"Sing-Chi Chow","height":"5' 8½\" (1.74 m)","bio":"Stephen Chow was the only boy of his family, and has grown up as a Bruce Lee fan and a martial arts addict. His career started on TV, where he presented a children show ( \"430 Space Shuttle\" (1983)) and started becoming popular. He got some supporting roles, after that, and won the Taiwanese Golden Horse award for best supporting actor. He had his first starring role in 1990 in a 'Chow Yun-Fat' spoof: All for the Winner (1990) - \"All for the Winner\" and started excelling in the comedy genre. In Hong-Kong, his particular nonsense style is called \"Mo Lei Tau\". It's also on the set of this movie that he encountered his fellow sidekick Man-Tat Ng. One of the last HK biggest star which have not been bought by Hollywood, even if Miramax (who'll surely release Shaolin Soccer (2001) - \"Shaolin Soccer\" this year in the USA - after remastering it, ouch.) has probably planned something for him...","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MzgyNTMyN15BMl5BanBnXkFtZTcwNTgwMzgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0159507","name":"Stephen Chow","nicknames":["Sing Jai","Sing Yeh"],"idIMDB":"nm0159507"},"actorId":"nm0159507","character":"H.K. Police Officer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0184526","urlIMDB":"http://www.imdb.com/title/tt0184526","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"SGD","country":"1,900,000","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 1 min (121 min)","1 hr 35 min (95 min) (Finland)","1 hr 39 min (99 min) (dubbed) (USA)","1 hr 19 min (79 min) (USA) (English subtitled re-release)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex 35 BL4, Technovision Anamorphic Lenses"],"laboratory":["Cine Art Laboratory Ltd., Hong Kong"],"filmLength":null,"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Technovision (anamorphic)"],"printedFilmFormat":["35 mm"]},"rating":"6.0","filmingLocations":[],"rated":"PG-13","awards":[{"award":"Golden Horse Film Festival 1999","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Horse Award","categories":[{"category":"Best Action Choreography","names":[{"name":"Jackie Chan","id":"nm0000329","role":null}]}]}]},{"award":"Hong Kong Film Awards 2000","titlesAwards":[{"titleAwardOutcome":"Nominated Hong Kong Film Award","categories":[{"category":"Best Action Choreography","names":[{"name":"Jackie Chan","id":"nm0000329","role":null}]}]}]}],"votes":"9,231","type":"Movie","companyCreditsSimple":[{"idCompany":"co0035542","name":"GH Pictures"},{"idCompany":"co0015592","name":"Golden Harvest Company"},{"idCompany":"co0033915","name":"Golden Harvest Pictures (China)"}],"keywords":{"keywords":["love","hong kong","taiwan","gay","message in a bottle","boat","fairy tale","millionaire","homosexual","business rivalry","kung fu","hitman","streetfighting","street fighter","combat","fighting","fight","prize fighter","illegal fistfight","showdown","kickboxing","boxing gloves","violence","hand to hand combat","chop socky","martial arts master","martial artist","stylized violence","parkour","ambush","pistol","disarming someone","karate","karate chop","parking lot","mixed martial arts","yacht","tough guy","action hero","hero","kiss","swimming","letter","dancing","dark comedy","boyfriend girlfriend relationship","martial arts","gun","honor","redemption","kindness","friendship","compassion"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:02:29"}}