{"data":{"movies":[{"title":"The Bone Collector","originalTitle":"","year":"1999","releaseDate":"19991105","directors":[{"name":"Phillip Noyce","id":"nm0637518"}],"writers":[{"name":"Jeffery Deaver","id":"nm0213281"},{"name":"Jeremy Iacone","id":"nm0406228"}],"runtime":"118 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWQxN2ZmNDMtMzA2Ny00ZDJhLTlkNTgtMWMyZjljY2QzMzNhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA","Canada"],"languages":["English"],"genres":["Crime","Drama","Mystery","Thriller"],"plot":"Quadripeligic ex-cop Lincoln Rhyme was looking forward to his assisted suicide when he got the news: some sicko was abducting people in a taxi and leaving them to die in particularly sadistic ways. With time counting down between each abduction and possible death, Rhyme recruits rather-unwilling Amelia Donaghy, haunted by her cop father's suicide and thinking she's next, into working the crime scenes to track down the killer.","simplePlot":"A quadriplegic ex-homicide detective and his female partner try to track down a serial killer who is terrorizing New York City.","actors":[{"actorName":"Denzel Washington","urlProfile":"http://www.imdb.com/name/nm0000243","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDU2Mzc3MV5BMl5BanBnXkFtZTcwNjAwNTE5OQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1954","placeOfBirth":" Mount Vernon, New York, USA","birthName":"Denzel Hayes Washington Jr.","height":"6' 1\" (1.85 m)","bio":"Denzel Washington is an American actor and filmmaker. He has received three Golden Globe awards, a Tony Award, and two Academy Awards: Best Supporting Actor for the historical war drama film Glory (1989) and Best Actor for his role as a corrupt cop in the crime thriller Training Day (2001). Denzel Hayes Washington, Jr. was born on December 28, 1954 in Mount Vernon, New York. He is the middle of three children of a beautician mother, Lennis (Lowe), from Georgia, and a Pentecostal minister father, Denzel Washington, Sr., from Virginia. After graduating from high school, Denzel enrolled at Fordham University, intent on a career in journalism. However, he caught the acting bug while appearing in student drama productions and, upon graduation, he moved to San Francisco and enrolled at the American Conservatory Theater. He left A.C.T. after only one year to seek work as an actor. His first paid acting role was in a summer stock theater stage production in St. Mary's City, Maryland. The play was \"Wings of the Morning\", which is about the founding of the colony of Maryland (now the state of Maryland) and the early days of the Maryland colonial assembly (a legislative body). He played the part of a real historical character, Mathias Da Sousa, although much of the dialogue was created. Afterwards he began to pursue screen roles in earnest. With his acting versatility and powerful sexual presence, he had no difficulty finding work in numerous television productions. He made his first big screen appearance in Carbon Copy (1981) with George Segal. Through the 1980s, he worked in both movies and television and was chosen for the plum role of Dr. Philip Chandler in NBC's hit medical series St. Elsewhere (1982), a role that he would play for six years. In 1989, his film career began to take precedence when he won the Oscar for Best Supporting Actor for his portrayal of Tripp, the runaway slave in Edward Zwick's powerful historical masterpiece Glory (1989). Washington has received much critical acclaim for his film work since the 1990s, including his portrayals of real-life figures such as South African anti-apartheid activist Steve Biko in Cry Freedom (1987), Muslim minister and human rights activist Malcolm X in Malcolm X (1992), boxer Rubin \"Hurricane\" Carter in The Hurricane (1999), football coach Herman Boone in Remember the Titans (2000), poet and educator Melvin B. Tolson in The Great Debaters (2007), and drug kingpin Frank Lucas in American Gangster (2007). Malcolm X and The Hurricane garnered him Oscar nominations for Best Actor, before he finally won that statuette in 2002 for his lead role in Training Day (2001). Through the 1990s, Denzel also co-starred in such big budget productions as The Pelican Brief (1993), Philadelphia (1993), Crimson Tide (1995), The Preacher's Wife (1996), and Courage Under Fire (1996), a role for which he was paid $10 million. He continued to define his onscreen persona as the tough, no-nonsense hero through the 2000s in films like Out of Time (2003), Man on Fire (2004), Inside Man (2006), and The Taking of Pelham 123 (2009). Cerebral and meticulous in his film work, he made his debut as a director with Antwone Fisher (2002); he also directed The Great Debaters (2007) and Fences (2016). In 2010, Washington headlined The Book of Eli (2010), a post-Apocalyptic drama. Later that year, he starred as a veteran railroad engineer in the action film Unstoppable (2010), about an unmanned, half-mile-long runaway freight train carrying dangerous cargo. The film was his fifth and final collaboration with director Tony Scott, following Crimson Tide (1995), Man on Fire (2004), Déjà Vu (2006) and The Taking of Pelham 1 2 3. He has also been a featured actor in the films produced by Jerry Bruckheimer and has been a frequent collaborator of director Spike Lee. In 2012, Washington starred in Flight (2012), for which he was nominated for an Academy Award for Best Actor. He co-starred with Ryan Reynolds in Sécurité rapprochée (2012), and prepared for his role by subjecting himself to a torture session that included waterboarding. In 2013, Washington starred in 2 Guns (2013), alongside Mark Walberg. In 2014, he starred in The Equalizer (2014), an action thriller film directed by Antoine Fuqua and written by Richard Wenk, based on the television series of same name starring Edward Woodward. During this time period, he also took on the role of producer for some of his films, including The Book of Eli and Safe House. In 2016, he was selected as the recipient for the Cecil B. DeMille Lifetime Achievement Award at the 73rd Golden Globe Awards. He lives in Los Angeles, California with his wife, Pauletta Washington, and their four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDU2Mzc3MV5BMl5BanBnXkFtZTcwNjAwNTE5OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000243","name":"Denzel Washington","nicknames":["D"],"idIMDB":"nm0000243"},"actorId":"nm0000243","character":"Lincoln Rhyme","urlCharacter":"http://www.imdb.com/character/ch0009802","main":true},{"actorName":"Angelina Jolie","urlProfile":"http://www.imdb.com/name/nm0001401","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODg3MzYwMjE4N15BMl5BanBnXkFtZTcwMjU5NzAzNw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1975","placeOfBirth":" Los Angeles, California, USA","birthName":"Angelina Jolie Voight","height":"5' 7\" (1.7 m)","bio":"Angelina Jolie is an Oscar-winning actress who became popular after playing the title role in the \"Lara Croft\" blockbuster movies, as well as Mr. & Mrs. Smith (2005), Wanted (2008), Salt (2010) and Maleficent (2014). Off-screen, Jolie has become prominently involved in international charity projects, especially those involving refugees. She often appears on many \"most beautiful women\" lists, and she has a personal life that is avidly covered by the tabloid press. Jolie was born Angelina Jolie Voight in Los Angeles, California. In her earliest years, Angelina began absorbing the acting craft from her actor parents, Jon Voight, an Oscar-winner, and Marcheline Bertrand, who had studied with Lee Strasberg. Her good looks may derive from her ancestry, which is German and Slovak on her father's side, and French-Canadian, Dutch, Polish, and remote Huron, on her mother's side. At age eleven, Angelina began studying at the Lee Strasberg Theatre Institute, where she was seen in several stage productions. She undertook some film studies at New York University and later joined the renowned Met Theatre Group in Los Angeles. At age 16, she took up a career in modeling and appeared in some music videos. In the mid-1990s, Jolie appeared in various small films where she got good notices, including Hackers (1995) and Foxfire (1996). Her critical acclaim increased when she played strong roles in the made-for-TV movies True Women (1997), and in George Wallace (1997) which won her a Golden Globe Award and an Emmy nomination. Jolie's acclaim increased even further when she played the lead role in the HBO production Gia (1998). This was the true life story of supermodel Gia Carangi, a sensitive wild child who was both brazen and needy and who had a difficult time handling professional success and the deaths of people who were close to her. Carangi became involved with drugs and because of her needle-using habits she became, at the tender age of 26, one of the first celebrities to die of AIDS. Jolie's performance in Gia (1998) again garnered a Golden Globe Award and another Emmy nomination, and she additionally earned a SAG Award. Angelina got a major break in 1999 when she won a leading role in the successful feature The Bone Collector (1999), starring alongside Denzel Washington. In that same year, Jolie gave a tour de force performance in Girl, Interrupted (1999) playing opposite Winona Ryder. The movie was a true story of women who spent time in a psychiatric hospital. Jolie's role was reminiscent of Jack Nicholson's character in One Flew Over the Cuckoo's Nest (1975), the role which won Nicholson his first Oscar. Unlike \"Cuckoo\", \"Girl\" was a small film that received mixed reviews and barely made money at the box office. But when it came time to give out awards, Jolie won the triple crown -- \"Girl\" propelled her to win the Golden Globe Award, the SAG Award and the Academy Award for best leading actress in a supporting role. With her new-found prominence, Jolie began to get in-depth attention from the press. Numerous aspects of her controversial personal life became news. At her wedding to her Hackers (1995) co-star Jonny Lee Miller, she had displayed her husband's name on the back of her shirt painted in her own blood. Jolie and Miller divorced, and in 2000, she married her Pushing Tin (1999) co-star Billy Bob Thornton. Jolie had become the fifth wife of a man twenty years her senior. During her marriage to Thornton, the spouses each wore a vial of the other's blood around their necks. That marriage came apart in 2002 and ended in divorce. In addition, Jolie was estranged from her famous father, Jon Voight. In 2000, Jolie was asked to star in Lara Croft: Tomb Raider (2001). At first, she expressed disinterest, but then decided that the required training for the athletic role was intriguing. The Croft character was drawn from a popular video game. Lara Croft was a female cross between Indiana Jones and James Bond. When the film was released, critics were unimpressed with the final product, but critical acclaim wasn't the point of the movie. The public paid $275 million for theater tickets to see a buffed up Jolie portray the adventuresome Lara Croft. Jolie's father Jon Voight appeared in \"Croft\", and during filming there was a brief rapprochement between father and daughter. One of the Croft movie's filming locations was Cambodia. While there, Jolie witnessed the natural beauty, culture and poverty of that country. She considered this an eye opening experience, and so began the humanitarian chapter of her life. Jolie began visiting refugee camps around the world and came to be formally appointed as a Goodwill Ambassador for the United Nations High Commissioner for Refugees (UNHCR). Some of her experiences were written and published in her popular book \"Notes from My Travels\" whose profits go to UNHCR. Jolie has stated that she now plans to spend most of her time in humanitarian efforts, to be financed by her actress salary. She devotes one third of her income to savings, one third to living expenses and one third to charity. In 2002, Angelina adopted a Cambodian refugee boy named Maddox, and in 2005, adopted an Ethiopian refugee girl named Zahara. Jolie's dramatic feature film Beyond Borders (2003) parallels some of her real life humanitarian experiences although, despite the inclusion of a romance between two westerners, many of the movie's images were too depressingly realistic -- the film was not popular among critics or at the box office. In 2004, Jolie began filming Mr. & Mrs. Smith (2005) with co-star Brad Pitt. The film became a major box office success. There were rumors that Pitt and Jolie had an affair while filming \"Smith\". Jolie insisted that because her mother had been hurt by adultery, she herself could never participate in an affair with a married man, therefore there had been no affair with Pitt at that time. Nonetheless, Pitt separated from his wife Jennifer Aniston in January 2005 and, in the months that followed, he was frequently seen in public with Jolie, apparently as a couple. Pitt's divorce was finalized later in 2005. Jolie and Pitt announced in early 2006 that they would have a child together, and Jolie gave birth to daughter Shiloh that May. They also adopted a three-year-old Vietnamese boy named Pax. The couple, who married in 2014, continue to pursue movie and humanitarian projects, and now have a total of six children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODg3MzYwMjE4N15BMl5BanBnXkFtZTcwMjU5NzAzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001401","name":"Angelina Jolie","nicknames":["Angie","Ange","AJ"],"idIMDB":"nm0001401"},"actorId":"nm0001401","character":"Amelia Donaghy","urlCharacter":"http://www.imdb.com/character/ch0009801","main":true},{"actorName":"Queen Latifah","urlProfile":"http://www.imdb.com/name/nm0001451","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjkxNzkyMF5BMl5BanBnXkFtZTcwNTQ1MTMyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 March 1970","placeOfBirth":" Newark, New Jersey, USA","birthName":"Dana Elaine Owens","height":"5' 10\" (1.78 m)","bio":"Often considered hip-hop's first lady (though some would attribute that to Roxanne Shanté), the woman behind the moniker Queen Latifah was born Dana Owens on March 18th, 1970, in East Orange, New Jersey. She is the daughter of Rita (Bray), a teacher, and Lancelot Owens, Sr. She came from a police family--both her father and older brother were cops, which would later influence her rhyming style and life philosophy. Owens witnessed both sides of Black urban life in the USA while growing up. After a brief stint as a Burger King employee, she soon found herself making waves in the hip-hop music scene. After working as the human beat box alongside Ladies Fresh, she was just 18 years old when she originally broke through in the late 1980s with a style that picked selectively from jazz, reggae, and soul traditions, from beats produced by 'D.J. Mark the 45 King'. Her debut single, \"Wrath of My Madness,\" was released in 1988. A year later, her debut long-player, \"All Hail the Queen,\" enjoyed favored reviews: an old, wise head was evident on the top of her young shoulders. The former Burger King employee maintained her early commitment to answer the misogynist armory of some of her male counterparts and, at the same time, imparted musical good times to all genders. Her name means \"delicate and sensitive\" in Arabic, but she has often been anything but in her rhymes and the messages she sends out through them. One of the most prominent female hip-hop artists on the scene for over a decade, Queen Latifah has also made tremendous inroads in movies, television, and artist management, with her management company, Flavor Unit, alongside her business partner Shakim Compere. A role model who takes the responsibility to heart, Latifah carefully constructed a fine career for herself--one that is constantly moving upward.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjkxNzkyMF5BMl5BanBnXkFtZTcwNTQ1MTMyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001451","name":"Queen Latifah","nicknames":["Hip-Hop's First Lady"],"idIMDB":"nm0001451"},"actorId":"nm0001451","character":"Thelma","urlCharacter":"http://www.imdb.com/character/ch0009803","main":true},{"actorName":"Michael Rooker","urlProfile":"http://www.imdb.com/name/nm0740264","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNDI5MjQ5MF5BMl5BanBnXkFtZTYwMjI1MTgz._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 April 1955","placeOfBirth":" Jasper, Alabama, USA","height":"5' 9\" (1.75 m)","bio":"Michael Rooker was born in 1955 in Jasper, Alabama. When he was 13 his parents divorced and he went with his mother to live in Chicago. He caught the acting bug while attending college, and began appearing in local stage productions. On first breaking into film, his intensity and \"don't-mess-with-me\" good looks were highlighted to chilling effect as the title character in Henry: Portrait of a Serial Killer (1986), filmed in 1986 but, due to its controversial nature, not released until 1990. Since that widely noticed and highly praised performance, much of his career has been spent playing brutes, villains and psychopaths. His occasional turns as a \"good guy\", however, are always well-acted and a welcome change for a talented actor too often typecast.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNDI5MjQ5MF5BMl5BanBnXkFtZTYwMjI1MTgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0740264","name":"Michael Rooker","idIMDB":"nm0740264"},"actorId":"nm0740264","character":"Captain Howard Cheney","urlCharacter":"http://www.imdb.com/character/ch0074255","main":true},{"actorName":"Michael McGlone","urlProfile":"http://www.imdb.com/name/nm0569458","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzc0YThkZWMtNTA4OS00ZWY0LTllYjctMmQ3MzQ2NjgwNTgzL2ltYWdlXkEyXkFqcGdeQXVyNTMxMzE4Mw@@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1972","placeOfBirth":" White Plains, New York, USA","bio":"Michael McGlone is an Actor, Writer, Director, Producer, Singer/Songwriter and Performer. He began his career on the screen with his critically acclaimed performance in the 1995 Sundance Film Festival Best Film Award Winner, The Brothers McMullen, from where he went on to star in such movies as She's the One, One Tough Cop, The Bone Collector, Dinner Rush and Hard Ball... In a return to the screen with Eddie Burns in their third feature film together, The Fitzgerald Family Christmas, McGlone played the fiery and robust Quinn Fitzgerald...after which he continued his recurring work on CBS's Person of Interest... In this next phase of his prolific career, Michael McGlone has created Kenny The Gun, the story of New York City Cop, Kenneth Patrick Sullivan, Detective 1st Grade, who ironically in the afterglow his greatest success, finds himself at a painful crossroads. As a consummate Irish New Yorker, McGlone unforgettably delivers the story of the quintessential Irish Cop, Kenny The Gun, in his powerful One Man Show. \"This is the launch of Kenny The Gun,\" says Michael; \"this is how I'm introducing the Series to the world.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzc0YThkZWMtNTA4OS00ZWY0LTllYjctMmQ3MzQ2NjgwNTgzL2ltYWdlXkEyXkFqcGdeQXVyNTMxMzE4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0569458","name":"Michael McGlone","idIMDB":"nm0569458"},"actorId":"nm0569458","character":"Detective Kenny Solomon","urlCharacter":"http://www.imdb.com/character/ch0009805","main":true},{"actorName":"Luis Guzmán","urlProfile":"http://www.imdb.com/name/nm0350079","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYyNjIyOTU2NF5BMl5BanBnXkFtZTcwODk3ODcxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1956","placeOfBirth":" Cayey, Puerto Rico","height":"5' 7½\" (1.71 m)","bio":"Actor of Puerto Rican descent who made many memorable films in the 1980s due to his villainous persona. Presently resides with his wife and many kids in Vermont.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYyNjIyOTU2NF5BMl5BanBnXkFtZTcwODk3ODcxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0350079","name":"Luis Guzmán","idIMDB":"nm0350079"},"actorId":"nm0350079","character":"Eddie Ortiz","urlCharacter":"http://www.imdb.com/character/ch0074257","main":true},{"actorName":"Leland Orser","urlProfile":"http://www.imdb.com/name/nm0650702","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwODE2ODM5OF5BMl5BanBnXkFtZTgwODc5NzIyMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1960","placeOfBirth":" San Francisco, California, USA","birthName":"Leland Jones Orser","height":"5' 8½\" (1.74 m)","bio":"Leland Orser was born on August 6, 1960 in San Francisco, California, USA as Leland Jones Orser. He is an actor and director, known for Taken (2008), Taken 2 (2012) and Se7en (1995). He has been married to Jeanne Tripplehorn since October 14, 2000. They have one child. He was previously married to Roma Downey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwODE2ODM5OF5BMl5BanBnXkFtZTgwODc5NzIyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0650702","name":"Leland Orser","idIMDB":"nm0650702"},"actorId":"nm0650702","character":"Richard Thompson","urlCharacter":"http://www.imdb.com/character/ch0074259","main":true},{"actorName":"John Benjamin Hickey","urlProfile":"http://www.imdb.com/name/nm0382632","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjI4Nzc5MzE3Nl5BMl5BanBnXkFtZTgwMDQ1OTcyMTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 June 1963","placeOfBirth":" Plano, Texas, USA","bio":"John Benjamin Hickey was born on June 25, 1963 in Plano, Texas, USA. He is an actor, known for Flags of Our Fathers (2006), Transformers: Revenge of the Fallen (2009) and The Bone Collector (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjI4Nzc5MzE3Nl5BMl5BanBnXkFtZTgwMDQ1OTcyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0382632","name":"John Benjamin Hickey","idIMDB":"nm0382632"},"actorId":"nm0382632","character":"Dr. Barry Lehman","urlCharacter":"http://www.imdb.com/character/ch0074260","main":true},{"actorName":"Bobby Cannavale","urlProfile":"http://www.imdb.com/name/nm0134072","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NzM3MzQ4Ml5BMl5BanBnXkFtZTgwOTg2MjY4ODE@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 May 1970","placeOfBirth":" Union City, New Jersey, USA","birthName":"Roberto M. Cannavale","height":"6' 2½\" (1.89 m)","bio":"In both career and in real life, Bobby Cannavale tends to choose the unconventional way of doing things. In the beginning, his decisions may have cost the dark, swarthily good-looking actor some acting roles and/or good-paying money but, in the end, his strong work ethic and sense of self, despite a lack of formal training, allowed him to take a successful path off the crowded acting trail. From character goofball and cut-up, he has broken into the leading man ranks with his recent starring role as a reincarnated matchmaker in the TV series Cupid (2009). Born Roberto M. Cannavale in Union City, New Jersey, to an Italian father, Sal, and Cuban mother, Isabel, he was involved in various activities at his Union City Catholic school, St. Michaels, while growing up. An altar boy, choir boy and lector, he also appeared in the church school's various musicals including his very first, \"Guys and Dolls\", in which he showed up as one of the gangsters, and \"The Music Man\", appearing as the lisping, scene-stealing tyke, \"Winthrop\". Bobby's parents divorced when he was five years old and his mother moved the family to Puerto Rico for a couple of years. Eventually, they returned to the States and settled in Coconut Creek, Florida, where he attended high school. Restless and uncomfortable in any sort of regimented setting, he often got suspended for playing the class clown. Graduating in the late 1980s, and bitten by the acting bug, Bobby chose to return to the New York/New Jersey area in order to jump start an acting career. Working in bars to support himself, he again avoided the confines of an acting school and, instead, gained experience as a \"reader\" on occasion with the Naked Angels theatre company. During this time (1994), he met and married Jenny Lumet, the actress-daughter of director Sidney Lumet. They had son, Jake, the following year. The couple divorced in 2003. Spotted by playwright Lanford Wilson while performing in an East Village production of Larry Kramer's \"The Normal Heart\", Bobby was invited to join Wilson's prestigious Circle Repertory Theatre. As a \"reader\" for the company, he eventually earned stage parts in \"Chilean Holidays\" (1996) and in Wilson's \"Virgil Is Still the Frog Boy.\" He also went on to serve as understudy to Mark Linn-Baker in a 1998 production of \"A Flea in Her Ear\" and later replaced him. A noticeable role in the company's play, \"The Most Fabulous Story Ever Told\" by Paul Rudnick led to Bobby's being cast in the recurring role of a tugboat operator in the TV series Trinity (1998). Having only appeared in bit parts thus far in such movies as Night Falls on Manhattan (1996), directed by Lumet, and I'm Not Rappaport (1996), it was \"Trinity\" creator John Wells who caught Bobby's stage performance and handed him this career-making break on camera. Bobby's \"nice-guy\" aura and blue-collar charm proved invaluable, if a bit restrictive. Once the \"Trinity\" series ended, Wells cast the 6'3\" lug with the trademark caterpillar brows and crooked smile as lovelorn paramedic \"Bobby Caffey\" in his series Third Watch (1999). The character became quite popular but Bobby, again feeling restricted and wishing to broaden his horizon as an actor, asked to be released from the show -- but \"in a big way\". Creator Wells obliged and had the paramedic fatally shot in the chest and then experience a \"beyond the grave\" union with his character's deceased, ne'er-do-well dad. Bobby next joined the cast of father-in-law Sidney Lumet's acclaimed TV courtroom drama 100 Centre Street (2001), starring Alan Arkin, cast against type as a brazenly opportunistic prosecutor. He subsequently earned recurring roles on Ally McBeal (1997) (in 2002) and Six Feet Under (2001) (in 2004). As for films, Bobby was featured in Gloria (1999), The Bone Collector (1999), Washington Heights (2002) and The Guru (2002) by the time he scored as the gregarious truck driver in the critically-hailed indie film The Station Agent (2003), which paired him intriguingly opposite the diminutive actor Peter Dinklage. Unwilling to shirk away from more controversial roles such as his gay drug dealer who has the hots for a fellow prisoner in the acclaimed series Oz (1997) or his closeted dancing neophyte in the film comedy Shall We Dance (2004) starring Richard Gere, Bobby continued to elevate his status seesawing between film (Shortcut to Happiness (2003), Happy Endings (2005), Romance & Cigarettes (2005)) and TV assignments (the miniseries Kingpin (2003)). He earned big viewer points with his recurring portrayal of \"Will Truman\"'s dour cop/boyfriend on the hit sitcom Will & Grace (1998) in 2004 and won a \"Guest Star\" Emmy award in the process. Elsewhere, on stage, he merited attention in such productions as \"Hurlyburly\" and earned a Tony Award nomination for his 2007 Broadway debut in \"Mauritius\". After five consecutive failed pilots, Bobby has come front-and-center with his quirky starring role in the ABC series Cupid (2009), recurring roles in Cold Case (2003) and Nurse Jackie (2009), and topnotch Emmy-winning part in Boardwalk Empire (2010). He also continues to rake up credits on the big screen (The Merry Gentleman (2008), Diminished Capacity (2008), The Take (2007), 100 Feet (2008), Roadie (2011)). This is a guy definitely here to stay.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NzM3MzQ4Ml5BMl5BanBnXkFtZTgwOTg2MjY4ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0134072","name":"Bobby Cannavale","idIMDB":"nm0134072"},"actorId":"nm0134072","character":"Amelia's Boyfriend","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ed O'Neill","urlProfile":"http://www.imdb.com/name/nm0642145","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI2NjcyODk0NV5BMl5BanBnXkFtZTgwNTMxODc4NzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 April 1946","placeOfBirth":" Youngstown, Ohio, USA","birthName":"Jr. Edward Philip O'Neill","height":"6' 1\" (1.85 m)","bio":"Ed O'Neill is an American actor best known for playing Al Bundy on Married with Children (1987), the most iconic working class character on television since Archie Bunker. Upon his debut on the world stage in Youngstown, Ohio on April 12, 1946, he was christened Edward Philip O'Neill, Jr. Both his father, Ed, Sr., a steelworker and truck driver, and his social worker mother, the former Ruth Ann Quinlan, were Irish-Americans. A gifted athlete, the 6'1\" O'Neil attended Ohio University on a football scholarship, but transferred after his sophomore year to Youngstown State University, where he played as a defensive lineman. In 1969, he was drafted by the Pittsburgh Steelers, but was cut in training camp. (Al Bundy was a former high-school football star constantly reminiscing about his glory days on the high school gridiron. Terry Bradshaw, the Hall of Fame Pittsburgh Steelers quarterback, twice appeared on \"Married with Children\".) After being cut by the Steelers, O'Neill went back to YSU to join the new theater department. After graduating, he became a social studies teacher at his alma mater, Ursuline High School, before fully committing to acting. He was a member of the company at the American Repertory Theater in Cambridge, Massachusetts, one of the top regional theaters in America. After numerous supporting parts in movies and television, he was cast as the New York City detective Popeye Doyle in the 1986 television movie that was a pilot for a proposed television series. \"Popeye Doyle\" was based on the classic police drama The French Connection (1971), with O'Neil playing the role originated by Gene Hackman). The television movie and O'Neil's performance got good reviews, but it was not picked up as a series. A year later, O'Neill was cast as Al Bundy in the sitcom \"Married with Children\", which debuted on the then-new Fox Network in April 1987. It ran 10 years, until June 1997, and made O'Neil a star. During the production of \"Married with Children\" and after its cancellation, O'Neill appeared in movies, guested on television shows, and made television commercials. The second iconic fictional policeman role that O'Neill took over was Sgt. Joe Friday in his 2003 remake of Jack Webb's classic crime series Dragnet (2003), which appeared on ABC. The network canceled the show during its second season. Since 2009, O'Neill has played Jay Pritchett on the ABC's sitcom Modern Family (2009), for which he was nominated for an Emmy Award in 2011. Since 1986, O'Neil has been married to actress Catherine Rusoff. They have two daughters, Claire and Sophia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI2NjcyODk0NV5BMl5BanBnXkFtZTgwNTMxODc4NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0642145","name":"Ed O'Neill","idIMDB":"nm0642145"},"actorId":"nm0642145","character":"Detective Paulie Sellitto","urlCharacter":"http://www.imdb.com/character/ch0009804","main":true},{"actorName":"Richard Zeman","urlProfile":"http://www.imdb.com/name/nm0069822","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE0NTM5Mjg5NjFeQTJeQWpwZ15BbWU4MDMzODgyMTgx._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Richard Zeman is known for his work on The Bone Collector (1999), The Day After Tomorrow (2004) and The Score (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE0NTM5Mjg5NjFeQTJeQWpwZ15BbWU4MDMzODgyMTgx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0069822","name":"Richard Zeman","idIMDB":"nm0069822"},"actorId":"nm0069822","character":"Lieutenant Carl Hanson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Olivia Birkelund","urlProfile":"http://www.imdb.com/name/nm0083565","urlPhoto":"","biography":{"dateOfBirth":"26 April 1963","placeOfBirth":" New York City, New York, USA","bio":"Olivia Birkelund is a Manhattan native. She attended Brown University in Rhode Island and Circle in the Square Theater School in New York. For years, she did a lot of regional theater, such as playing \"Desdemona\" in \"Othello\" and \"Helena\" in \"A Midsummer's Night's Dream\". Of her small role as the unfortunate \"Lindsey\" in Denzel Washington's thriller, The Bone Collector (1999), Olivia says, \"It was just a victim part. She's kidnapped in a taxi cab with her husband and then dragged down to the boiler room of a very old building in New York. She's strapped to one pipe, and then he turns another pipe on her face and all this steam comes out. She gets steamed like a piece of broccoli. It wasn't that challenging and, yet, working with Phillip Noyce, the director, was so wonderful that it made that job very interesting\".","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0083565","name":"Olivia Birkelund","idIMDB":"nm0083565"},"actorId":"nm0083565","character":"Lindsay Rubin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Swanson","urlProfile":"http://www.imdb.com/name/nm0841795","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MTY0NDY5NF5BMl5BanBnXkFtZTcwOTUzODg0Nw@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 September 1948","placeOfBirth":" Queens, New York City, New York, USA","bio":"After completing his degree in English Literature and graduating with honors from C.W. Post College, Gary Swanson put aside a career as a professional high diver on The Atlantic City Steel Pier and began working immediately as Greg Mercer on NBC Daytime Soap Opera, \"Somerset\" in New York City. While starring in the popular daytime drama, he met with the famed acting teacher and father of The Method, Lee Strasberg. Swanson studied with Strasberg both privately and at The Actors Studio after auditioning and becoming one of the very few lifetime members accepted into this elite acting company. Under Strasberg's tutelage, Swanson became one of the highest rated actors on television. Swanson continued his work with Strasberg for eight years while building his career as a working actor in New York and Los Angeles. His movie career kicked off in 1974, and since then he has starred in 15 feature films. He has guest starred in numerous television series and films, theatrical productions and hundreds of national network commercials. He has starred and worked with some of the greatest directors in the world - Arthur Hiller, Willaim Friedkin, Peter Masterson, Nicolas Roeg, and Philip Noyce. Swanson's teaching credits are numerous, he began with Carlin Glynn at Tajas Productions in 1983. Credits include a summer at Circle In The Square. He taught basic technique at The Actors Studio where he continues to collaborate. In 1994, James Lipton and the executive committee of The Actors Studio","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MTY0NDY5NF5BMl5BanBnXkFtZTcwOTUzODg0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0841795","name":"Gary Swanson","idIMDB":"nm0841795"},"actorId":"nm0841795","character":"Alan Rubin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Bulleit","urlProfile":"http://www.imdb.com/name/nm0119874","urlPhoto":"","biography":{"bio":"James Bulleit is an actor and producer, known for Guiding Light (1952), Donnie Brasco (1997) and The Bone Collector (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0119874","name":"James Bulleit","idIMDB":"nm0119874"},"actorId":"nm0119874","character":"Train Engineer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Fontaine","urlProfile":"http://www.imdb.com/name/nm0284804","urlPhoto":"","biography":{"dateOfBirth":"28 November 1936","placeOfBirth":" Quebec, Canada","bio":"Frank Fontaine was born in Montreal and raised in New York State and England. He comes from an average dysfunctional family. He began his college education at Georgetown University in Washington D.C. but that came to an abrupt halt when he left for London and the Royal Academy of Dramatic Art. Since then, he has created more than a hundred characters on screen and stage. Some of his feature film credits include: The Covenant; The Last Kiss; Confessions of a Dangerous Mind; The Sum of all Fears; Where the Money Is; The Bone Collector and Two Summers. Among his television credits are: At the Hotel; The Reagans; Reedeemer; Indian Summer; Foreign Objects; Nurenberg; and Maurice Richard. On stage, he has played Samuel Beckett in Burnt Piano; Caesar in Julius Caesar; Malvolio in Twelfth Night; Henry in The Fantasticks; Norman in On Golden Pond; Charles in The Middle Ages; Frank Srang in Equus; Lord Brockhurst in The Boyfriend; and Von Strack in Amadeus. One of Frank's biggest assets is his bountiful energy, which allows him to venture into the unknown. He likes to play multi dimensional characters who defy type. Recently, he was asked what were the similarities between he and the character of Herbert Poppy he created in Two Summers. \"Herbert and I met, became good friends; and often the case, we rubbed off on each other. Our identities became blurred. But, when the shooting was over, he went his way and I went mine\", was Frank's reply. Trust plays a big part in this artist's life. \"The more trustful I am of myself and specially of those around me on a project, the better my work becomes\", he says. Frank Fontaine is also a writer. His television and stage plays The Great Bergen, The Monster, The Great Symphonic Adventure, The Inquest and Others, have been produced by the CBC. He is a good storyteller and can create characters on the written page with as much ease as he does as the gifted character actor he is.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0284804","name":"Frank Fontaine","idIMDB":"nm0284804"},"actorId":"nm0284804","character":"Grandfather","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0145681","urlIMDB":"http://www.imdb.com/title/tt0145681","business":{"budget":{"money":"$73,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$16,712,020","country":"USA","day":"07","month":"11","year":"1999","remarks":"2,587 Screens"},{"money":"£816,104","country":"UK","day":"16","month":"01","year":"2000","remarks":"289 Screens"}],"gross":[{"money":"$66,488,090","country":"USA","day":"05","month":"03","year":"2000","remarks":""},{"money":"$66,372,450","country":"USA","day":"27","month":"02","year":"2000","remarks":""},{"money":"$66,227,335","country":"USA","day":"20","month":"02","year":"2000","remarks":""},{"money":"$65,989,975","country":"USA","day":"13","month":"02","year":"2000","remarks":""},{"money":"$65,714,980","country":"USA","day":"06","month":"02","year":"2000","remarks":""},{"money":"$65,415,110","country":"USA","day":"30","month":"01","year":"2000","remarks":""},{"money":"$65,128,890","country":"USA","day":"23","month":"01","year":"2000","remarks":""},{"money":"$64,822,870","country":"USA","day":"16","month":"01","year":"2000","remarks":""},{"money":"$64,309,210","country":"USA","day":"09","month":"01","year":"2000","remarks":""},{"money":"$63,722,000","country":"USA","day":"02","month":"01","year":"2000","remarks":""},{"money":"$63,115,060","country":"USA","day":"26","month":"12","year":"1999","remarks":""},{"money":"$62,412,565","country":"USA","day":"19","month":"12","year":"1999","remarks":""},{"money":"$60,833,400","country":"USA","day":"12","month":"12","year":"1999","remarks":""},{"money":"$58,121,035","country":"USA","day":"05","month":"12","year":"1999","remarks":""},{"money":"$53,747,635","country":"USA","day":"28","month":"11","year":"1999","remarks":""},{"money":"$45,128,155","country":"USA","day":"21","month":"11","year":"1999","remarks":""},{"money":"$35,224,690","country":"USA","day":"14","month":"11","year":"1999","remarks":""},{"money":"$16,712,020","country":"USA","day":"07","month":"11","year":"1999","remarks":""},{"money":"£3,608,350","country":"UK","day":"13","month":"02","year":"2000","remarks":""},{"money":"£3,388,456","country":"UK","day":"06","month":"02","year":"2000","remarks":""},{"money":"£2,805,843","country":"UK","day":"30","month":"01","year":"2000","remarks":""},{"money":"£1,935,303","country":"UK","day":"23","month":"01","year":"2000","remarks":""},{"money":"£816,104","country":"UK","day":"16","month":"01","year":"2000","remarks":""},{"money":"SGD 937,142","country":"Singapore","day":"26","month":"01","year":"2000","remarks":""},{"money":"SGD 629,303","country":"Singapore","day":"19","month":"01","year":"2000","remarks":""},{"money":"SGD 141,298","country":"Singapore","day":"09","month":"01","year":"2000","remarks":"sneak preview"}],"weekendGross":[{"money":"$78,085","country":"USA","day":"05","month":"03","year":"2000","remarks":"161 Screens"},{"money":"$109,645","country":"USA","day":"27","month":"02","year":"2000","remarks":"215 Screens"},{"money":"$162,925","country":"USA","day":"20","month":"02","year":"2000","remarks":"245 Screens"},{"money":"$192,720","country":"USA","day":"13","month":"02","year":"2000","remarks":"292 Screens"},{"money":"$212,070","country":"USA","day":"06","month":"02","year":"2000","remarks":"329 Screens"},{"money":"$197,520","country":"USA","day":"30","month":"01","year":"2000","remarks":"332 Screens"},{"money":"$221,650","country":"USA","day":"23","month":"01","year":"2000","remarks":"341 Screens"},{"money":"$979,440","country":"USA","day":"19","month":"12","year":"1999","remarks":"1,113 Screens"},{"money":"$1,706,040","country":"USA","day":"12","month":"12","year":"1999","remarks":"2,031 Screens"},{"money":"$3,197,860","country":"USA","day":"05","month":"12","year":"1999","remarks":"2,518 Screens"},{"money":"$5,487,535","country":"USA","day":"28","month":"11","year":"1999","remarks":"2,500 Screens"},{"money":"$6,531,270","country":"USA","day":"21","month":"11","year":"1999","remarks":"2,623 Screens"},{"money":"$12,010,225","country":"USA","day":"14","month":"11","year":"1999","remarks":"2,594 Screens"},{"money":"$16,712,020","country":"USA","day":"07","month":"11","year":"1999","remarks":"2,587 Screens"},{"money":"£72,732","country":"UK","day":"13","month":"02","year":"2000","remarks":"112 Screens"},{"money":"£322,651","country":"UK","day":"06","month":"02","year":"2000","remarks":"270 Screens"},{"money":"£535,015","country":"UK","day":"30","month":"01","year":"2000","remarks":"287 Screens"},{"money":"£718,521","country":"UK","day":"23","month":"01","year":"2000","remarks":"288 Screens"},{"money":"£816,104","country":"UK","day":"16","month":"01","year":"2000","remarks":"289 Screens"}],"admissions":[{"money":"360,872","country":"Netherlands","day":"31","month":"12","year":"2000","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"21","month":"09","year":"1998","remarks":null},{"money":null,"country":null,"day":"11","month":"12","year":"1998","remarks":null}],"copyrightHolder":"Columbia Pictures Industries Inc."},"technical":{"runtime":["1 hr 58 min (118 min)"],"soundMix":["DTS","SDDS","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe, USA"],"filmLength":["3,231 m (Sweden)"],"negativeFormat":["35 mm (Fuji Super F-500T 8572)"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"6.7","metascore":"45","filmingLocations":[{"location":"380 Lafayette Street, New York City, New York, USA"}],"rated":"R","awards":[{"award":"Black Reel Awards 2000","titlesAwards":[{"titleAwardOutcome":"Nominated Black Reel","categories":[{"category":"Theatrical - Best Supporting Actress","names":[{"name":"Queen Latifah","id":"nm0001451","role":null}]}]}]},{"award":"Blockbuster Entertainment Awards 2000","titlesAwards":[{"titleAwardOutcome":"Nominated Blockbuster Entertainment Award","categories":[{"category":"Favorite Actress - Suspense","names":[{"name":"Angelina Jolie","id":"nm0001401","role":null}]}]}]},{"award":"Image Awards 2000","titlesAwards":[{"titleAwardOutcome":"Nominated Image Award","categories":[{"category":"Outstanding Supporting Actress in a Motion Picture","names":[{"name":"Queen Latifah","id":"nm0001451","role":null}]}]}]},{"award":"Yoga Awards 2001","titlesAwards":[{"titleAwardOutcome":"Won Yoga Award","categories":[{"category":"Worst Foreign Actress","names":[{"name":"Angelina Jolie","id":"nm0001401","role":null},{"name":"Girl, Interrupted","id":"tt0172493","role":null},{"name":"Gone in Sixty Seconds","id":"tt0187078","role":null}]}]}]}],"votes":"125,746","type":"Movie","companyCreditsSimple":[{"idCompany":"co0050868","name":"Columbia Pictures Corporation"},{"idCompany":"co0005073","name":"Universal Pictures"},{"idCompany":"co0552345","name":"MELS"}],"keywords":{"keywords":["serial killer","suicide","police","quadriplegic","new york city","taxi","seizure","assisted suicide","dead nurse","black woman murdered","woman stabbed","1990s","future technology","4th detective precinct","nyc taxi 5z66","nypd 4th detective precinct","nypd shield 78499","syracuse new york","human bite","peregrine falcon","taxi limousine commission murder","taxi limousine commission","suicide by gunshot","nypd esu","suicide of father","stockyard","rat","nypd","sip puff device","assistive technology","taxi divider","taxi abduction","steam pipe","underground","oyster","oyster shell","woolworth building","subway tunnel","disposable camera","hospital bed","railroad","hand signal","railroad hand signal","murder investigation","evil man","manhattan new york city","world trade center manhattan new york city","wall street manhattan new york city","rockefeller center manhattan new york city","pier","glock","torture","subway station","steam","pool hall","oxygen mask","new york skyline","medical technician","kidnapping","handicapped person","forensic psychology","ferry slip","eagle","death wish","scene of the crime","christmas party","chess","caregiver","copycat crime","murder","christmas","brooklyn bridge","dismemberment","women in uniform","paralysis","severed hand","policewoman","scalding","forensic evidence","helicopter","destiny","neo noir","based on book","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:29:04"}}