{"data":{"movies":[{"title":"L.A. Story","originalTitle":"","year":"1991","releaseDate":"19910208","directors":[{"name":"Mick Jackson","id":"nm0413875"}],"writers":[{"name":"Steve Martin","id":"nm0000188"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NDU3NDA1OV5BMl5BanBnXkFtZTYwOTQzNzI5._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama","Fantasy","Romance"],"plot":"Harris K Telemacher is a 'wacky weekend weatherman' for a local Los Angeles television station who is searching for meaning in his otherwise cliche ridden Los Angeles life. With the help of an insightful and talkative Freeway sign, Harris embarks on a journey through Los Angeles in pursuit of Sarah, an English reporter who has been sent to the City of Angels to research an article for the London Times.","simplePlot":"With the help of a talking freeway billboard, a \"wacky weatherman\" tries to win the heart of an English newspaper reporter, who is struggling to make sense of the strange world of early-90s Los Angeles.","actors":[{"actorName":"Steve Martin","urlProfile":"http://www.imdb.com/name/nm0000188","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY0ODYwNDM3OV5BMl5BanBnXkFtZTcwMTc3NjQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 August 1945","placeOfBirth":" Waco, Texas, USA","birthName":"Stephen Glenn Martin","height":"6' (1.83 m)","bio":"Steve Martin was born on August 14, 1945 in Waco, Texas, USA as Stephen Glenn Martin to Mary Lee (née Stewart; 1913-2002) and Glenn Vernon Martin (1914-1997), a real estate salesman and aspiring actor. He was raised in Inglewood and Garden Grove in California. In 1960, he got a job at the Magic shop of Disney's Fantasyland, and while there he learned magic, juggling, and creating balloon animals. At Santa Ana College, he took classes in drama and English poetry. He also took part in comedies and other productions at the Bird Cage Theatre, and joined a comedy troupe at Knott's Berry Farm. He attended California State University as a philosophy major, but in 1967 transferred to UCLA as a theatre major. His writing career began on The Smothers Brothers Comedy Hour (1967), winning him an Emmy Award. Between 1967 and 1973, he also wrote for many other shows, including The Glen Campbell Goodtime Hour (1969) and The Sonny and Cher Comedy Hour (1971). He also appeared on talk shows and comedy shows in the late 1960s and early 1970s. In 1972, he first appeared on The Tonight Show Starring Johnny Carson (1962), doing stand-up several times each year, and even guest hosting a few years later. In 1976, he served for the first time as guest-host on Saturday Night Live (1975). By 2016, he has guest-hosted 15 times, which is one less than Alec Baldwin's record, and also appeared 12 other times on SNL. In 1977, he released his first comedy album, a platinum selling \"Let's Get Small\". He followed it with \"A Wild and Crazy Guy\" (1978), which sold more than a million copies. Both albums went on to win Grammys for Best Comedy Recording. This is when he performed in arenas in front of tens of thousands of people, and begun his movie career, which was always his goal. His first major role was in the short film, The Absent-Minded Waiter (1977), which he also wrote. His star value was established in The Jerk (1979), which was co-written by Martin, and directed by Carl Reiner. The film earned more than $100 million on a $4 million budget. He also starred in Dead Men Don't Wear Plaid (1982), The Man with Two Brains (1983), and All of Me (1984), all directed by Reiner. To avoid being typecast as a comedian, he wanted do more dramatic roles, starring in Pennies from Heaven (1981), a film remake of Dennis Potter's 1978 series. Unfortunately, it was a financial failure. He also starred in John Landis's ¡Three Amigos! (1986), co-written by himself, opposite Martin Short and Chevy Chase. That year, he also appeared in the musical horror comedy, Little Shop of Horrors (1986) opposite Rick Moranis. Next year, he starred in Roxanne (1987), co-written by himself, and in John Hughes' Planes, Trains & Automobiles (1987), opposite John Candy. His other films include Parenthood (1989) and My Blue Heaven (1990), both opposite Moranis. In 1991, he wrote and starred in L.A. Story (1991), about a weatherman who searches meaning in his life and love in Los Angeles. It also starred his then-wife, Victoria Tennant. Same year, Father of the Bride (1991) was so successful that a 1995 sequel followed. During the 1990s, he continued to play more dramatic roles, in Grand Canyon (1991), playing a traumatized movie producer, in Leap of Faith (1992), playing a fake faith healer, in A Simple Twist of Fate (1994), playing a betrayed man adopting a baby, and in David Mamet's thriller The Spanish Prisoner (1997). Other, more comedic roles include in HouseSitter (1992) and The Out-of-Towners (1999), opposite Goldie Hawn, in Nora Ephron's Mixed Nuts (1994), and in Bowfinger (1999), written by himself and co-starring Eddie Murphy. After Bowfinger, he starred in Bringing Down the House (2003) and Cheaper by the Dozen (2003), both earning more than $130 million. He wrote and starred in Shopgirl (2005), and appeared in the sequel of Cheaper by the Dozen. After them, he appeared in The Pink Panther (2006) and The Pink Panther 2 (2009), which he both co-wrote, as Inspector Clouseau. He continues to do movies, more recently appearing in The Big Year (2011), Home (2015), and Love the Coopers (2015). Besides aforementioned, he has been an avid art collector since 1968, written plays, written for The New Yorker, written a well-received memoir (Born Standing Up), written a novel (An Object of Beauty; 2010), hosted the Academy Awards three times, released a Grammy award winning music album (The Crow: New Songs for the 5-String Banjo; 2009), and another album (Love Has Come For You; 2013) with Edie Brickell. Since 2007, he has been married to Anne Stringfield, with whom he has a daughter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY0ODYwNDM3OV5BMl5BanBnXkFtZTcwMTc3NjQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000188","name":"Steve Martin","idIMDB":"nm0000188"},"actorId":"nm0000188","character":"Harris K. Telemacher","urlCharacter":"http://www.imdb.com/character/ch0016097","main":true},{"actorName":"Victoria Tennant","urlProfile":"http://www.imdb.com/name/nm0005481","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5Nzg4MDEwNF5BMl5BanBnXkFtZTYwMjI1NjA1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1950","placeOfBirth":" London, England, UK","height":"5' 5\" (1.65 m)","bio":"Victoria Tennant trained for eight years at the Elmhurst Ballet School and for two years at the Central School for Speech and Drama in London. In her first film, she starred in the title role of The Ragman's Daughter (1972), written by Alan Sillitoe and directed by Harold Becker. Extensive television work began with Emmy and Golden Globe nominations for the fifteen hour miniseries, The Winds of War (1983). For the thirty-hour miniseries War and Remembrance (1988), she received her second Emmy nomination. She also wrote and co-produced the film Edie & Pen (1996) for HBO and produced Sister Mary Explains It All (2001) for Showtime with her producing partner and husband, Kirk Stambler. Ms. Tennant's work in the theatre includes the Santa Barbara Theatre Company's production of \"Doubt\" by John Patrick Shanley, for which she won the Santa Barbara Independent's Indie award, The Vagina Monologues at the Canon Theatre and the Napa Valley Opera House, The Misalliance at LA Theatreworks, Love Letters at Steppenwolf in Chicago, Getting Married at Circle-in-the-Square on Broadway, and The Taming of the Shrew at the Westport Playhouse.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5Nzg4MDEwNF5BMl5BanBnXkFtZTYwMjI1NjA1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005481","name":"Victoria Tennant","idIMDB":"nm0005481"},"actorId":"nm0005481","character":"Sara McDowel","urlCharacter":"http://www.imdb.com/character/ch0016103","main":true},{"actorName":"Richard E. Grant","urlProfile":"http://www.imdb.com/name/nm0001290","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MTYxMzcxMF5BMl5BanBnXkFtZTYwNzMwODQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1957","placeOfBirth":" Mbabane, Union of South Africa [now Swaziland]","birthName":"Richard Grant Esterhuysen","height":"6' 2\" (1.88 m)","bio":"Richard E. Grant was born on May 5, 1957 in Mbabane, Union of South Africa as Richard Grant Esterhuysen. He is an actor, known for Bram Stoker's Dracula (1992), Logan (2017) and Corpse Bride (2005). He has been married to Joan Washington since November 1, 1986. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MTYxMzcxMF5BMl5BanBnXkFtZTYwNzMwODQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001290","name":"Richard E. Grant","nicknames":["Reg"],"idIMDB":"nm0001290"},"actorId":"nm0001290","character":"Roland Mackey","urlCharacter":"http://www.imdb.com/character/ch0016100","main":true},{"actorName":"Marilu Henner","urlProfile":"http://www.imdb.com/name/nm0000447","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNTYxOTM2M15BMl5BanBnXkFtZTcwNzkyNjkxNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 April 1952","placeOfBirth":" Chicago, Illinois, USA","birthName":"Mary Lucy Denise Pudlowski","height":"5' 7\" (1.7 m)","bio":"Marilu Henner was born on April 6, 1952 in Chicago, Illinois, USA as Mary Lucy Denise Pudlowski. She is known for her work on Taxi (1978), Evening Shade (1990) and L.A. Story (1991). She has been married to Michael Brown since December 21, 2006. She was previously married to Robert Lieberman and Frederic Forrest.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNTYxOTM2M15BMl5BanBnXkFtZTcwNzkyNjkxNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000447","name":"Marilu Henner","idIMDB":"nm0000447"},"actorId":"nm0000447","character":"Trudi","urlCharacter":"http://www.imdb.com/character/ch0016104","main":true},{"actorName":"Sarah Jessica Parker","urlProfile":"http://www.imdb.com/name/nm0000572","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMDY0MzMxMV5BMl5BanBnXkFtZTcwMzMxNjQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 March 1965","placeOfBirth":" Nelsonville, Ohio, USA","height":"5' 3\" (1.6 m)","bio":"Sarah Jessica Parker was born March 25, 1965, in Nelsonville, Ohio, to Barbra Forste (née Keck), a teacher who ran a nursery school, and Stephen Parker, a journalist. Her parents divorced, and her mother later remarried to Paul Forste and had four more children, bringing the total to eight. Sarah now had 3 full siblings and 4 half siblings. Her father was of Eastern European Jewish ancestry, and her mother had German, and some English, roots. Trained in singing and ballet, Sarah was cast in the Broadway production of \"The Innocents\", which prompted her family to relocate to New Jersey. Already a professional performer (she studied at the American Ballet School and the Professional Children's School), Sarah was cast in \"The Sound of Music\" (along with four of her siblings), and landed the lead in the Broadway run of \"Annie\". After a year as the free-spirited orphan, Sarah attended Dwight Morrow High School, while continuing to add more credits to her acting resume. She landed a role in the made-for-TV movie My Body, My Child (1982), before being cast as one of the lead roles in the 1982 sitcom Square Pegs (1982), as high-schooler Patty Green. Once a graduate, Sarah decided to pursue a full-time acting career rather than further her education. Since Square Pegs (1982) did not last more than a year, Sarah moved on to supporting film roles in movies such as Footloose (1984), Firstborn (1984), and the lead role in the teenage film Girls Just Want to Have Fun (1985). Sarah was having lots of fun, although she had yet to land a star-turning role. After more television appearances in series and made-for-TV movies including A Year in the Life (1986), The Room Upstairs (1987) and A Long Way from Home: Dadah Is Death (1988), Sarah finally landed the role of Steve Martin's bubbly lover in the 1991 comedy L.A. Story (1991). More substantial film roles soon followed, starting with a role opposite Nicolas Cage in Honeymoon in Vegas (1992) (which foreshadowed her comedic talent), Hocus Pocus (1993) and Ed Wood (1994). A big Woody Allen fan, she starred opposite the renowned filmmaker in the television movie The Sunshine Boys (1996), and that same year, she landed a starring role in Miami Rhapsody (1995). 1996 was a film intensive year with roles in The First Wives Club (1996), If Lucy Fell (1996), and Mars Attacks! (1996). All the while making a name for herself in film, Sarah was gaining respect as a theater actress, with her lead role as a dog (hard to imagine, but true) in the off-Broadway \"Sylvia\", and her Broadway roles in \"How to Succeed in Business Without Really Trying\" (starring her present husband, Matthew Broderick), and the Tony-Award nominated \"Once Upon a Mattress\". But Sarah's star has shot up since her portrayal of Manhattan sex-columnist Carrie Bradshaw in the HBO series Sex and the City (1998). Sarah's Golden Globe Best Actress victory in 2000 only underscores the fact that she plays the role of Carrie as though it were literally written for her. Sarah has been happily married to fellow actor Matthew Broderick for quite a while now. Before the marriage, she dated Robert Downey Jr. (who she also lived with), and the late John Kennedy Jr. When not serving as lead actress and producer of Sex and the City (1998), Sarah is a member of Hollywood's Women's Political Committee, and is UNICEF's representative for the Performing Arts.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMDY0MzMxMV5BMl5BanBnXkFtZTcwMzMxNjQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000572","name":"Sarah Jessica Parker","nicknames":["SJP"],"idIMDB":"nm0000572"},"actorId":"nm0000572","character":"SanDeE*","urlCharacter":"http://www.imdb.com/character/ch0016096","main":true},{"actorName":"Susan Forristal","urlProfile":"http://www.imdb.com/name/nm0286759","urlPhoto":"","biography":{"bio":"Susan Forristal is an actress, known for L.A. Story (1991), Addicted to Love (1997) and The Distinguished Gentleman (1992). She was previously married to Lorne Michaels.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0286759","name":"Susan Forristal","idIMDB":"nm0286759"},"actorId":"nm0286759","character":"Ariel","urlCharacter":"http://www.imdb.com/character/ch0192387","main":true},{"actorName":"Kevin Pollak","urlProfile":"http://www.imdb.com/name/nm0001629","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjgzMzQzNzg0NF5BMl5BanBnXkFtZTcwMzI5NjY1OQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 October 1957","placeOfBirth":" San Francisco, California, USA","birthName":"Kevin Elliot Pollak","height":"5' 5\" (1.65 m)","bio":"Kevin Pollak was born in San Francisco in 1957, to Elaine (Klein) and Robert Pollak. A stand-up comedy performer at age 10, he turned professional comedian a decade later and was puttering around from city to city when film roles beckoned. Pollak refocused thereafter on acting in what would be a wise and profitable career move. Landing his first film role in George Lucas' Willow (1988), directed by Ron Howard, became the wind beneath his wings, and he has been sailing ever since. Critically noticed for his role in Avalon (1990), it was Rob Reiner's A Few Good Men (1992) that shot him up the credit's list. Adept at displaying smarmy and/or shady, smug characters, such showy roles in The Usual Suspects (1995) and Casino (1995) were his reward. He co-created and co-executive produced The Underworld (1997) along with actress/writer/partner/wife Lucy Webb. They also appeared together in the movies The Don's Analyst (1997) and Outside Ozona (1998). Not only starring in two of his own HBO stand-up comedy specials, Pollak returned to the live stand-up stage in 2001, headlining a sold out 20 city tour. Most recently, he co-starred with Bruce Willis and Matthew Perry in The Whole Ten Yards (2004), a sequel to the hit comedy The Whole Nine Yards (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjgzMzQzNzg0NF5BMl5BanBnXkFtZTcwMzI5NjY1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001629","name":"Kevin Pollak","idIMDB":"nm0001629"},"actorId":"nm0001629","character":"Frank Swan","urlCharacter":"http://www.imdb.com/character/ch0016099","main":true},{"actorName":"Sam McMurray","urlProfile":"http://www.imdb.com/name/nm0573481","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0OTUwNDM4MV5BMl5BanBnXkFtZTcwODIxMzM5OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 April 1952","placeOfBirth":" New York City, New York, USA","height":"6' 2\" (1.88 m)","bio":"Sam McMurray was born on April 15, 1952 in New York City, New York, USA. He is an actor and producer, known for Raising Arizona (1987), National Lampoon's Christmas Vacation (1989) and Belles à mourir (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0OTUwNDM4MV5BMl5BanBnXkFtZTcwODIxMzM5OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0573481","name":"Sam McMurray","idIMDB":"nm0573481"},"actorId":"nm0573481","character":"Morris Frost","urlCharacter":"http://www.imdb.com/character/ch0016105","main":true},{"actorName":"Patrick Stewart","urlProfile":"http://www.imdb.com/name/nm0001772","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MzU5ODQ5OF5BMl5BanBnXkFtZTYwODIwODk1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 July 1940","placeOfBirth":" Mirfield, Yorkshire, England, UK","birthName":"Patrick Hewes Stewart","height":"5' 10\" (1.78 m)","bio":"Sir Patrick Stewart was born in Mirfield, Yorkshire, England, to Gladys (Barrowclough), a textile worker and weaver, and Alfred Stewart, who was in the army. He was a member of various local drama groups from about age 12. He left school at age 15 to work as a junior reporter on a local paper; he quit when his editor told him he was spending too much time at the theatre and not enough working. Stewart spent a year as a furniture salesman, saving cash to attend drama school. He was accepted by Bristol Old Vic Theatre School in 1957. He made his professional debut in 1959 in the repertory theatre in Lincoln; he worked at the Manchester Library Theatre and a tour around the world with the Old Vic Company followed in the early 1960s. Stewart joined the Royal Shakespeare Company in 1966, to begin his 27-year association. Following a spell with the Royal National Theatre in the mid 1980s, he went to Los Angeles, California to star on Star Trek: The Next Generation (1987), which ran from 1987-1994, playing the role of Captain Jean-Luc Picard. After the series ended, Stewart reprised his role for a string of successful Star Trek films: Star Trek: Generations (1994), Star Trek: First Contact (1996), Star Trek: Insurrection (1998), and Star Trek: Nemesis (2002). Stewart continues to work on the stage and in various films. He was awarded Knight Bachelor of the Order of the British Empire in the 2010 Queen's New Year's Honours List for his services to drama.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MzU5ODQ5OF5BMl5BanBnXkFtZTYwODIwODk1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001772","name":"Patrick Stewart","nicknames":["Old Baldy","Beef Stew"],"idIMDB":"nm0001772"},"actorId":"nm0001772","character":"Mr. Perdue, Maitre D' at L'Idiot","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrew Amador","urlProfile":"http://www.imdb.com/name/nm0023777","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MDI4NDU5M15BMl5BanBnXkFtZTcwMjQ5ODgyMQ@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"During his active television and radio career, Andrew has worked as a news anchor and reporter for television stations in Los Angeles, San Francisco and Detroit; he also has anchored and reported for CBS radio in Los Angeles (KNX, KFWB). In addition, Andrew was a popular disc jockey on Los Angeles progressive music radio stations KROQ, KWST and the much-revered KNAC. A fixture on Los Angeles television for many years, Angelenos may remember Andrew as the personable weathercaster and environmental reporter for KCAL-TV in the 1980's and 1990's. Andrew has twice been nominated for a local news Emmy and was recognized for his journalistic excellence by the Associated Press, The Radio-Television Digital News Association and the Los Angeles Press Club. He is the recipient of a Golden Mike for his reporting work at KNX. Andrew's acting resume is highlighted by roles in \"L.A. Story,\" \"The First Power,\" \"Taking Care of Business\" and \"The Net.\" Network television appearances include work on \"Dallas,\" \"Murder She Wrote,\" \"Quantum Leap,\" \"The Hogan Family,\" and other hit TV shows. His voice-over and narration portfolio encompasses a wide range of projects including commercials for artists associated with nearly every major recording label in the U.S. and abroad. Andrew is proud to be a part of the Los Angeles theatre scene; his favorite roles include blind baseball fan Greg in an award-winning production of \"Bleacher Bums,\" iconic playboy Elyot Chase in a well-received revival of Noel Coward's \"Private Lives,\" and the pompous Petkoff in Shaw's \"Arms and the Man.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MDI4NDU5M15BMl5BanBnXkFtZTcwMjQ5ODgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0023777","name":"Andrew Amador","idIMDB":"nm0023777"},"actorId":"nm0023777","character":"Bob, News Anchor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gail Grate","urlProfile":"http://www.imdb.com/name/nm0335990","urlPhoto":"","biography":{"dateOfBirth":"2 October 1959","placeOfBirth":" Queens, New York, USA","bio":"Gail Grate was born on October 2, 1959 in Queens, New York, USA. She was an actress, known for L.A. Story (1991), A Season for Miracles (1999) and ER (1994). She died on May 28, 2014 in Jacksonville, Florida, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0335990","name":"Gail Grate","idIMDB":"nm0335990"},"actorId":"nm0335990","character":"Gail, News Anchor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eddie De Harp","urlProfile":"http://www.imdb.com/name/nm0208825","urlPhoto":"","biography":{"bio":"Eddie De Harp is known for his work on Requiem for a Dream (2000), L.A. Story (1991) and The Beverly Hillbillies (1993). He was previously married to Katarina Gutierez.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0208825","name":"Eddie De Harp","idIMDB":"nm0208825"},"actorId":"nm0208825","character":"Maitre D' at Brunch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"M.C. Shan","urlProfile":"http://www.imdb.com/name/nm0787937","urlPhoto":"","biography":{"dateOfBirth":"9 September 1965","placeOfBirth":" Elmhurst, New York, USA","birthName":"Shawn Moltke","bio":"M.C. Shan was born on September 9, 1965 in Elmhurst, New York, USA as Shawn Moltke.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0787937","name":"M.C. Shan","idIMDB":"nm0787937"},"actorId":"nm0787937","character":"Rap Waiter at L'Idiot","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frances Fisher","urlProfile":"http://www.imdb.com/name/nm0004920","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NjU0ODU0OV5BMl5BanBnXkFtZTgwMzIwOTQ2MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 May 1952","placeOfBirth":" Milford-on-the-sea, Hampshire, England, UK","height":"5' 4\" (1.63 m)","bio":"Frances Fisher began by apprenticing at the Barter Theatre in Abingdon, Virginia. She spent 14 years based in New York City, playing leads in over 30 productions of plays by such noted writers as John Arden, Noël Coward, Emily Mann, Joe Orton, Sam Shepard, William Shakespeare, Jean Claude Van Italie, Eudora Welty and Tennessee Williams. She won a Drama Logue Award - Best Ensemble for the American Premier of Caryl Churchill's \"Three More Sleepless Nights\", played in the American premier of Judith Thompson's \"The Crackwalker\" and originated roles in Elia Kazan's \"The Chain\" and Arthur Miller's last play \"Finishing the Picture\". Besides working with Kazan and Miller, some of Ms. Fisher's more interesting theater experiences were creating roles from two great works of literature: George Orwell's \"1984\" and Victor Hugo's \"The Hunchback of Notre Dame\". Ms. Fisher worked at the Mark Taper Forum in Los Angeles alongside Annette Bening and Alfred Molina in Anton Chekhov's \"The Cherry Orchard\". Fisher starred in \"Sexy Laundry\" with Paul Ben-Victor at the Hayworth Theatre in Los Angeles. She studied with Stella Adler and became a lifetime member of the Actors Studio by actually \"walking up the stairs\" and auditioning for legendary acting teacher Lee Strasberg. Ms. Fisher recently completed The Host (2013), Love on the Run (2016), Red Wing (2013) and will work with Catherine Hardwicke in her new film Plush (2013) in August 2012. Ms. Fisher was honored for a Lifetime Achievement Award 2011 in her old hometown of the Pacific Palisades, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NjU0ODU0OV5BMl5BanBnXkFtZTgwMzIwOTQ2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004920","name":"Frances Fisher","idIMDB":"nm0004920"},"actorId":"nm0004920","character":"June","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Iman","urlProfile":"http://www.imdb.com/name/nm0408081","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNzUxNDMwOF5BMl5BanBnXkFtZTYwNzY3ODI4._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 July 1955","placeOfBirth":" Mogadishu, Somalia","birthName":"Iman Abdulmajid","height":"5' 9\" (1.75 m)","bio":"Iman was born on July 25, 1955 in Mogadishu, Somalia as Iman Abdulmajid. She is a producer and actress, known for Project Runway Canada (2007), Out of Africa (1985) and No Way Out (1987). She was previously married to David Bowie and Spencer Haywood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNzUxNDMwOF5BMl5BanBnXkFtZTYwNzY3ODI4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0408081","name":"Iman","idIMDB":"nm0408081"},"actorId":"nm0408081","character":"Cynthia","urlCharacter":"http://www.imdb.com/character/ch0016101","main":true}],"seasons":[],"idIMDB":"tt0102250","urlIMDB":"http://www.imdb.com/title/tt0102250","business":{"budget":null,"openingWeekend":[{"money":"$6,616,915","country":"USA","day":"10","month":"02","year":"1991","remarks":"1,091 Screens"}],"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1990/\">1990</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 35 min (95 min)"],"soundMix":["Dolby"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Technicolor"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.7","metascore":"66","filmingLocations":[{"location":"Spring Street Towers - 650 S. Spring Street, Downtown, Los Angeles, California, USA"}],"rated":"PG-13","awards":[],"votes":"25,953","type":"Movie","companyCreditsSimple":[{"idCompany":"co0094459","name":"Carolco Pictures"},{"idCompany":"co0149490","name":"IndieProd Company Productions"},{"idCompany":"co0044166","name":"L.A. Films"}],"keywords":{"keywords":["weatherman","television","manic pixie dream girl","surrealism","slow motion scene","reference to shakespeare's hamlet","reference to william shakespeare","city name in title","earthquake","abstract art","california","beverly hills california","tv news","satire","love","freeway shooting","anagram","supernatural power","los angeles storm drain","helicopter","statue of liberty","valley girl","los angeles california","amazing grace hymn","riddle","sex","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:29:44"}}