{"data":{"movies":[{"title":"Serial Killer","originalTitle":"","year":"1995","releaseDate":"19951005","directors":[{"name":"Pierre David","id":"nm0203039"}],"writers":[{"name":"Mark Sevi","id":"nm0786411"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDE5OTY5N15BMl5BanBnXkFtZTYwNzA3MTA5._V1.jpg","countries":["USA","Germany"],"languages":["English"],"genres":["Thriller"],"plot":"As a member of FBI Psychological Profile Unit, Selby Younger tracks Morrano, vicious and intelligent serial killer. Before getting caught, Morrano attacks her leaving serious psychological wounds. Two years later, Morrano escapes and Selby, now working on a desk job, must face her personal traumas again.","simplePlot":"As a member of FBI Psychological Profile Unit, Selby Younger tracks Morrano, vicious and intelligent serial killer. Before getting caught, Morrano attacks her leaving serious psychological ... ","actors":[{"actorName":"Kim Delaney","urlProfile":"http://www.imdb.com/name/nm0001126","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4Mjk3MzEyOV5BMl5BanBnXkFtZTYwMTU5MDc2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 November 1961","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"5' 7\" (1.7 m)","bio":"Kim Delaney was born on November 29, 1961, in Philadelphia, Pennsylvania, and was raised in Roxborough. She is the daughter of Joan and Jack Delaney, who retired from Delphi Automotive, where he served as a committeeman for the United Auto Workers. She has four brothers: Ed Delaney and John Delaney, who are older than her, and Keith and Patrick Delaney, who are younger. As a cheerleader at John W. Hallahan Catholic Girls High School in Philadelphia, she dreamed of being a court reporter and settling close to home. Kim began her modeling career working for the Elite agency while still in high school. After graduation, Kim continued to model in Philadelphia and then headed for New York City, quickly winning commercials. She studied acting in New York with William Esper. She auditioned for Dynasty (1981) and Dallas (1978) , but lost out. When she auditioned for All My Children (1970), however, she got the part of Jenny Gardner, and in August 1981 her acting career took off. In the spring of 1983, she made her busy schedule even busier by performing in an off-Broadway play directed by Dorothy Lyman. She has been nominated for many acting awards, winning an Emmy Award for Outstanding Supporting Actress in a Drama Series for playing Diane Russell on NYPD Blue (1993). She has continued to star in both television and theater, as well as in films such as Rules of Engagement (1995) and Mission to Mars (2000). Kim Delaney lives in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4Mjk3MzEyOV5BMl5BanBnXkFtZTYwMTU5MDc2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001126","name":"Kim Delaney","idIMDB":"nm0001126"},"actorId":"nm0001126","character":"Selby Younger","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Hudson","urlProfile":"http://www.imdb.com/name/nm0399839","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjA3NTExM15BMl5BanBnXkFtZTgwNTk5OTM1OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1956","placeOfBirth":" Newport News, Virginia, USA","height":"6' (1.83 m)","bio":"Gary was nominated for Best Actor for the Canadian series \"Wild Roses\" for the CBC at the Monte-Carlo Television Festival in 2009. The show was also nominated. Born and raised in Newport News, Virginia.. He is a proud uncle, and son of Joe and Bev...and has 9 nieces and nephews. Gary moved to Los Angeles in 1979, but always considers Virginia his home. For the last 14 years he has split his time between the States and Canada. Gary is now a dual citizen, and enjoys the time he spends in the great white north. He has been teaching acting for the past 15 years, doing seminars in the US and Canada, and just finished teaching a semester at the University of the Arts in San Francisco. He enjoys his \"frustrating\" time on the golf course, playing in numerous charity events every year, and still swings a pretty mean tennis racket. A big sports fan...he cheers for the underdog...Cowboys - Joe Tores team in New York City...and the house that Jerry West built.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjA3NTExM15BMl5BanBnXkFtZTgwNTk5OTM1OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0399839","name":"Gary Hudson","idIMDB":"nm0399839"},"actorId":"nm0399839","character":"Cole Grayson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tobin Bell","urlProfile":"http://www.imdb.com/name/nm0068551","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM5OTE1MjA3Nl5BMl5BanBnXkFtZTgwOTAxNjk4MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 August 1942","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Joseph H. Tobin Jr.","height":"5' 10½\" (1.79 m)","bio":"Tobin Bell is an American actor with a career in film, television and theater spanning three decades. He was born in Queens, New York and raised in Weymouth, Mass. His mother is the British actress Eileen Bell. He is perhaps best known for his role as the iconic villain \"Jigsaw\" in the Saw film series...for which he received MTV Award nominations in 2007 & 2009. He's a graduate of Boston University and has a Masters Degree in Education from Montclair State University. He studied acting with Sanford Meisner at the Neighborhood Playhouse and Lee Strasberg at the Actors Studio in New York. He is a lifetime member of The Actors Studio and a member of The Academy of Motion Picture Arts and Sciences.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM5OTE1MjA3Nl5BMl5BanBnXkFtZTgwOTAxNjk4MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0068551","name":"Tobin Bell","idIMDB":"nm0068551"},"actorId":"nm0068551","character":"William Lucian Morrano","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pam Grier","urlProfile":"http://www.imdb.com/name/nm0000427","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNDEwNDA0N15BMl5BanBnXkFtZTcwOTY1NjgyNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1949","placeOfBirth":" Winston-Salem, North Carolina, USA","birthName":"Pamela Suzette Grier","height":"5' 8\" (1.73 m)","bio":"Pam Grier was born in Winston-Salem, NC, one of four children of Gwendolyn Sylvia (Samuels), a nurse, and Clarence Ransom Grier Jr., an Air Force mechanic. Pam has been a major African-American star from the early 1970s. Her career started in 1971, when Roger Corman of New World Pictures launched her with The Big Doll House (1971), about a women's penitentiary, and The Big Bird Cage (1972). Her strong role put her into a five-year contract with Samuel Z. Arkoff of American-International Pictures, and she became a leading lady in action films such as Jack Hill's Coffy (1973) and Foxy Brown (1974), the comic strip character Friday Foster (1975) and William Girdler's 'Sheba, Baby' (1975). She continued working with American-International, where she portrayed William Marshall's vampire victim in the Blacula (1972) sequel, Scream Blacula Scream (1973). During the 1980s she became a regular on Miami Vice (1984) and played a supporting role as an evil witch in Ray Bradbury's and Walt Disney Pictures' Something Wicked This Way Comes (1983), then returned to action as Steven Seagal's partner in Above the Law (1988). Her most famous role of the 1990s was probably Jackie Brown (1997), directed by Quentin Tarantino, which was an homage to her earlier 1970s action roles, She occasionally did supporting roles, as in Tim Burton's Mars Attacks! (1996), In Too Deep (1999) and a funny performance in Jawbreaker (1999). She also appeared in John Carpenter's Ghosts of Mars (2001) and co-starred with Snoop Dogg in Bones (2001). Her entire career of over 30 years has brought only success for this beautiful and talented actress. A sister of Grier's died from cancer in 1990 and the son of that sister committed suicide because of his mother's illness. Pam herself was diagnosed with cancer in 1988 and given 18 months to live, which has had an effect on how she has chosen to live. She has never been wed, although she has been romantically linked to Richard Pryor and Kareem Abdul-Jabbar in the past.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNDEwNDA0N15BMl5BanBnXkFtZTcwOTY1NjgyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000427","name":"Pam Grier","idIMDB":"nm0000427"},"actorId":"nm0000427","character":"Capt. Maggie Davis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marco Rodríguez","urlProfile":"http://www.imdb.com/name/nm0735424","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NjI1MjkwNV5BMl5BanBnXkFtZTcwMzY4NTA2OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 July 1953","placeOfBirth":" Los Angeles, California, USA","height":"5' 11\" (1.8 m)","bio":"Marco Rodriguez is a film, television, and stage actor. Marco received his Bachelor of Arts degree from the University of Southern California and trained with notable acting coaches, Jeff Corey and Jose Quintero. After a short stint as a teacher in the Lausd, Rodriguez embarked on a professional acting career with his debut as \"El Pachuco\" in the Mark Taper Forum production of Zoot Suit and then toured Europe with Luis Valdez' Teatro Campesino. While at the Taper, Marco joined the Improvisational Theatre Project (now known as P.l.a.y.) collaborating on the critically acclaimed play School Talk. Other writing projects include the award-winning Espernaza Del Valle for the Office of Substance Abuse Prevention (Osap) and Natividad, a solo Christmas play in Spanish. Rodriguez is also a founding member of the East Los Angeles. Classic Theatre, an organization dedicated to exposing disadvantaged youth to classic dramatic literature and the theatrical experience. In 1998, Marco founded Dejando Huellas (Leaving a Mark), a bilingual drama outreach program including coaching, workshops and performance opportunities for the under served Latino population. Since 2007, Marco has also been involved as a lead teaching artist with the acclaimed Los Angeles theatre company, About Productions, and its innovative educational programming that introduces at-risk youth to the importance of writing and the power of communication through artistic expression, facilitated dialogue and live performance.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NjI1MjkwNV5BMl5BanBnXkFtZTcwMzY4NTA2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0735424","name":"Marco Rodríguez","idIMDB":"nm0735424"},"actorId":"nm0735424","character":"Manny Ramirez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joel Polis","urlProfile":"http://www.imdb.com/name/nm0689177","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTIzNTIyMF5BMl5BanBnXkFtZTYwMDI4MTEz._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1951","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Joel Ian Polis","bio":"Joel Polis was a competitive athlete in high school and earned a full scholarship in gymnastics to the University of Southern California. He caught the acting bug his Freshman year when he was cast in the school's production of \"West Side Story.\" He then received a scholarship to join the Summer Theater Festival on a European tour, performing in England, Germany and the Edinburgh Theater Festival. He dropped out of USC to work as a circus clown, but after three months of tumbling around the arena, he decided that a life wearing big shoes and a red rubber nose was not for him, so he boarded a Greyhound Bus and headed East. He traveled to New York where he studied acting at NYU and with the Broadway director Lloyd Richards. He returned to Los Angeles to finish his BA and then received his MFA from Yale Drama School. Joel has been acting for over twenty years in film, television and on the stage. His first film role was as Fuchs in John Carpenter's classic sci-fi film The Thing (1982). He has appeared in numerous TV shows including Cheers (Gary), Alien Nation, Northern Exposure, Star Trek: Voyager, Roseanne, Seinfeld, Chicago Hope, Boston Legal, and CSI. Joel's extensive theater credits include the Astor Place Theater, Hartford Stage, Old Globe Theater, South Coast Repertory, Mark Taper Forum, Odyssey Theatre, and the Pasadena Playhouse.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTIzNTIyMF5BMl5BanBnXkFtZTYwMDI4MTEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0689177","name":"Joel Polis","idIMDB":"nm0689177"},"actorId":"nm0689177","character":"Jack Blund","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lyman Ward","urlProfile":"http://www.imdb.com/name/nm0911700","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc3NDc0NDY4Ml5BMl5BanBnXkFtZTcwMjc3MzAyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 June 1941","placeOfBirth":" Saint John, New Brunswick, Canada","bio":"Lyman Ward was born on June 21, 1941 in Saint John, New Brunswick, Canada. He is an actor, known for Ferris Bueller's Day Off (1986), Independence Day (1996) and A Nightmare on Elm Street 2: Freddy's Revenge (1985). He was previously married to Cindy Pickett, Leigh Heine and Cathy Gelbart.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc3NDc0NDY4Ml5BMl5BanBnXkFtZTcwMjc3MzAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0911700","name":"Lyman Ward","idIMDB":"nm0911700"},"actorId":"nm0911700","character":"Dr. Harvard Jankowitz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrew Prine","urlProfile":"http://www.imdb.com/name/nm0697785","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2NjU4MTU5Nl5BMl5BanBnXkFtZTcwMTk3NTUwOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 February 1936","placeOfBirth":" Jennings, Florida, USA","birthName":"Andrew Louis Prine","height":"6' 2\" (1.88 m)","bio":"Andrew Prine, a well-known stage actor also known for military/western dramas, was first seen in Kiss Her Goodbye (1959), then in The Miracle Worker (1962). Prine, who has a Texan sounding voice, was also well remembered in westerns like Texas Across the River (1966), Generation (1969) and Chisum (1970), which featured his close and well known friends Christopher George, John Wayne and Richard Jaeckel. Prine next starred in Simon, King of the Witches (1971), One Little Indian (1973), The Centerfold Girls (1974) and Grizzly (1976), which also featured Christopher George and Richard Jaeckel. Prine also wrote his own little dialogue story for Grizzly (1976). During this time through the 60s and 70s, Prine was married four times but kept his acting career up. Prine later was in The Evil (1978), Amityville II: le possédé (1982), Eliminators (1986), Chill Factor (1989) and Gettysburg (1993), which got Prine a big and great role. Prine is a great veteran actor in Hollywood who will always be remembered. He has also been in over 30 great films and made 79 guest appearances.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2NjU4MTU5Nl5BMl5BanBnXkFtZTcwMTk3NTUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0697785","name":"Andrew Prine","idIMDB":"nm0697785"},"actorId":"nm0697785","character":"Perry Jones","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cyndi Pass","urlProfile":"http://www.imdb.com/name/nm0664773","urlPhoto":"","biography":{"bio":"Cyndi Pass was a big screen film actress known for powerful performances. Pass began her acting career appearing mainly in films, such as the Holly Floria thrilling mystery \"Bikini Island\" (1991), the Jeff Wincott action flick \"Mission of Justice\" (1992) and \"Round Trip to Heaven\" (1992) with Corey Feldman. She also appeared in the thriller \"Deadbolt\" (1992) with Justine Bateman and the action movie \"Bounty Tracker\" (1993) with Lorenzo Lamas and Matthias Hues. She continued to work steadily in film throughout the nineties, appearing in the Mel Harris action picture \"Desperate Motive\" (1993) and the Dan Quinn action film \"Scanner Cop\" (1993). More recently, she continued to act in the crime picture \"Serial Killer\" (1995) with Kim Delaney, the fantasy \"Wes Craven Presents Wishmaster\" (1997) with Tammy Lauren and the Shanna Reed thriller \"The Night Caller\" (1998). She also appeared in the comedy \"Edtv\" (1999) with Matthew McConaughey. Pass most recently worked on \"The Stepdaughter\" (2001). She worked in series television while getting her start in acting, including a part on \"Full House\" (ABC, 1987-1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0664773","name":"Cyndi Pass","idIMDB":"nm0664773"},"actorId":"nm0664773","character":"Marianne Capriato","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leonard Termo","urlProfile":"http://www.imdb.com/name/nm0855657","urlPhoto":"","biography":{"dateOfBirth":"6 March 1935","placeOfBirth":" Brooklyn, New York City, New York, USA","bio":"Leonard Termo was born on March 6, 1935 in Brooklyn, New York City, New York, USA. He was an actor, known for Fight Club (1999), Ed Wood (1994) and Lost Highway (1997). He died on October 30, 2012 in Santa Clarita, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0855657","name":"Leonard Termo","idIMDB":"nm0855657"},"actorId":"nm0855657","character":"Loft Manager","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kimberly Faith Jones","urlProfile":"http://www.imdb.com/name/nm0428592","urlPhoto":"","biography":{"bio":"Kimberly Faith Jones is an actress, known for Another World (1964), In Country (1989) and Serial Killer (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0428592","name":"Kimberly Faith Jones","idIMDB":"nm0428592"},"actorId":"nm0428592","character":"Lisa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anne Bellamy","urlProfile":"http://www.imdb.com/name/nm0068679","urlPhoto":"","biography":{"bio":"Anne Bellamy is an actress, known for Cast Away (2000), Westworld (1973) and A Glimpse Inside the Mind of Charles Swan III (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0068679","name":"Anne Bellamy","idIMDB":"nm0068679"},"actorId":"nm0068679","character":"Nana Younger","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jean St. James","urlProfile":"http://www.imdb.com/name/nm0679531","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxNTkwMjQ3NF5BMl5BanBnXkFtZTgwNzU2NjM1ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Jean St. James is known for her work on General Hospital (1963), Death Becomes Her (1992) and Cocktail (1988).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxNTkwMjQ3NF5BMl5BanBnXkFtZTgwNzU2NjM1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0679531","name":"Jean St. James","idIMDB":"nm0679531"},"actorId":"nm0679531","character":"Selby's Neighbor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jodi Karger","urlProfile":"http://www.imdb.com/name/nm0439220","urlPhoto":"","biography":{"bio":"Jodi Karger is an actress, known for Serial Killer (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0439220","name":"Jodi Karger","idIMDB":"nm0439220"},"actorId":"nm0439220","character":"Jenny Woods","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gaby Nimier","urlProfile":"http://www.imdb.com/name/nm0632355","urlPhoto":"","biography":{"bio":"Gaby Nimier is an actress, known for Serial Killer (1995) and Talking About Sex (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0632355","name":"Gaby Nimier","idIMDB":"nm0632355"},"actorId":"nm0632355","character":"Female Victim","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0114393","urlIMDB":"http://www.imdb.com/title/tt0114393","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"10","month":"10","year":"1994","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 34 min (94 min)"],"soundMix":["Ultra Stereo"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.2","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[],"votes":"282","type":"Video","companyCreditsSimple":[{"idCompany":"co0002436","name":"Inferno Productions"},{"idCompany":"co0309967","name":"Republic Pictures (II)"},{"idCompany":"co0026085","name":"Starlight"}],"keywords":{"keywords":["serial killer","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:46:16"}}