{"data":{"movies":[{"title":"Assassin Warrior","originalTitle":"Silent Trigger","year":"1996","releaseDate":"19961012","directors":[{"name":"Russell Mulcahy","id":"nm0611683"}],"writers":[{"name":"Sergio Altieri","id":"nm0022835"}],"runtime":"93 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzNTQxNzgzNF5BMl5BanBnXkFtZTcwNDkzNjAwMQ@@._V1.jpg","countries":["Canada","UK"],"languages":["English"],"genres":["Action","Drama","Thriller"],"plot":"Action superstar Dolph Lundgren (Universal Soldier) delivers big-screen entertainment in the adventure thriller that's loaded with special effects and hard-hitting action...SILENT TRIGGER! Lundgren plays a top political assassin who's teamed with a sexy female counterpart (gorgeous Gina Bellman) to gun down a target. But when emotions begin to cloud his thoughts, it sets off an explosive series of events leading to the ultimate climax of kill or be killed! From the director of Highlander and The Shadow, SILENT TRIGGER is action -packed entertainment that'll blow you away!","simplePlot":"Waxman is a former Special Forces soldier who is now working as a heavily armed assassin for a top secret government agency. When a covert mission goes terribly wrong, Waxman and fellow assassin Clegg become that agency's prime targets.","actors":[{"actorName":"Dolph Lundgren","urlProfile":"http://www.imdb.com/name/nm0000185","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzEyNzU4NV5BMl5BanBnXkFtZTgwNDg2MzM3MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1957","placeOfBirth":" Stockholm, Stockholms län, Sweden","birthName":"Hans Lundgren","height":"6' 5\" (1.96 m)","bio":"Dolph Lundgren was born in Stockholm, Sweden, to Sigrid Birgitta (Tjerneld), a language teacher, and Karl Johan Hugo Lundgren, an engineer and economist for the Swedish government. He lived in Stockholm until the age of 13, when he moved in with his grandparents in Nyland, Ångermanland, Sweden. Despite an early interest in music and the fine arts, Dolph decided to follow in his father's footsteps and pursue an Engineering degree. After having completed his military service, he enrolled at the Royal Institute of Technology in Stockholm. It was in the military when Dolph first came in contact with the martial arts. Five years later, Dolph had become a World-Class competitor in Japanese Karate and was deeply involved with a discipline that was to become an important part of his life. After graduating High School, Dolph spent considerable time studying in the United States and abroad on various academic scholarships. He attended Washington State University and Clemson University in South Carolina. In 1982, he received a scholarship to complete his Masters Degree in Chemical Engineering at the University of Sydney, Australia. In 1983, he was awarded a Fulbright scholarship to the Massachusetts Institute of Technology in Boston, one of the world's top engineering schools. That same year, Dolph decided to move to New York City and take up acting. He started studying drama at the Warren Robertson Theatre Workshop in Manhattan, not knowing how quickly his life was about to change. Dolph's motion picture debut came in the \"James Bond\" feature, A View to a Kill (1985). However, it was his performance in Rocky IV (1985) later that year that definitely got him noticed. After a 9-month audition process among 5,000 hopefuls, he was cast opposite writer-director Sylvester Stallone, as his Russian opponent, \"Ivan Drago\". Following the success of Rocky IV (1985), Lundgren moved to Los Angeles and has since starred in more than thirty feature films. Lundgren portrayed the classic action-heroic lead in such films as Gary Goddard's Masters of the Universe (1987), Showdown in Little Tokyo (1991) co-starring Brandon Lee and Blackjack (1998), by Hong-Kong action legend, John Woo. Lundgren has also continued to turning in memorable performances as the main adversary to other action-stars, most notably in Universal Soldier (1992) opposite Jean-Claude Van Damme, directed by Roland Emmerich, as well as Robert Longo's Johnny Mnemonic (1995) opposite Keanu Reeves. In February 2004, Dolph Lundgren directed his first feature film, the thriller The Defender (2004), in which he also starred. In 2005, he directed and starred in yet another feature, The Russian Specialist (2005) (a.k.a \"The Russian Specialist\"). In January 2006, he finished principal photography of The Final Inquiry (2006), an Italian/American/Spanish co-production, directed by Giulio Base, in which he played against, amongst others, Daniele Liotti, Max von Sydow and F. Murray Abraham. In the fall 2006, Lundgren starred in Diamond Dogs (2007), a Chinese/American co-production filmed on location in Mongolia. In the Spring 2007, he directed a modern day western shot in Texas, Missionary Man (2007). In 2009, he completed two new directorial efforts, the action-packed Command Performance (2009), which showcases Lundgren's longtime musical talents as a drummer; and the neo-noir thriller The Killing Machine (2010). Lundgren also reunited with co-stars Jean-Claude Van Damme and Sylvester Stallone for Universal Soldier: Regeneration (2009) and the highly anticipated action blockbuster, The Expendables (2010). Dolph has managed to not let his Hollywood career stand in the way of his athletic background. He has been awarded his Third Degree Black Belt by the World Karate Organization in Tokyo. His accomplishments include being the Captain of the Swedish National Karate Team, as well as a Champion of the Swedish, European and Australian Heavyweight Division titles. Lundgren still regularly performs Karate exhibitions at international tournaments worldwide. In addition to his Karate expertise, Dolph was selected by the U.S. Olympic Committee to serve as the Team Leader of the 1996 U.S. Olympic Pentathlon Team during the Atlanta Games. He is actively involved in promoting the image of this sport. Lundgren's production company, Thor Pictures, is developing several projects in which he will produce, star and/or direct. He is also a founding member of \"Group of Eight\", a New York theater group started in 1994. Lundgren has also been working on a fitness book and sports wear line for men, the creation and launch of a new Dolph Lundgren brand, a licensing, media and publishing program and the development of future entertainment and media projects. Lundgren is married to Anette Qviberg-Lundgren, an interior decorator and fashion designer. The couple, along with their two daughters, resides in Marbella, Spain.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzEyNzU4NV5BMl5BanBnXkFtZTgwNDg2MzM3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000185","name":"Dolph Lundgren","idIMDB":"nm0000185"},"actorId":"nm0000185","character":"Shooter","urlCharacter":"http://www.imdb.com/character/ch0512641","main":true},{"actorName":"Gina Bellman","urlProfile":"http://www.imdb.com/name/nm0069109","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDI2NTg5MDcwOF5BMl5BanBnXkFtZTcwODAyOTUwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 July 1966","placeOfBirth":" Auckland, New Zealand","height":"5' 6½\" (1.69 m)","bio":"Gina Bellman was born on July 10, 1966 in Auckland, New Zealand. She is an actress, known for Leverage (2008), Coupling (2000) and Assassin Warrior (1996). She has been married to Zaab Sethna since September 2013. They have one child. She was previously married to Lucho Brieva.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDI2NTg5MDcwOF5BMl5BanBnXkFtZTcwODAyOTUwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0069109","name":"Gina Bellman","idIMDB":"nm0069109"},"actorId":"nm0069109","character":"Spotter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Conrad Dunn","urlProfile":"http://www.imdb.com/name/nm0420718","urlPhoto":"","biography":{"bio":"Conrad Dunn was born in Los Angeles, California, USA. He is an actor, known for Chicago (2002), Stripes (1981) and Alien Nation (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0420718","name":"Conrad Dunn","idIMDB":"nm0420718"},"actorId":"nm0420718","character":"Supervisor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Heyerdahl","urlProfile":"http://www.imdb.com/name/nm0382216","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNDM2NjAzMV5BMl5BanBnXkFtZTcwNjc0MTgwNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1963","placeOfBirth":" British Columbia, Canada","height":"6' 4\" (1.93 m)","bio":"An award-winning Canadian actor, Christopher Heyerdahl co-stars in the British TV series \"Tin Star,\" UCP's \"Damnation\" and SyFy's \"Van Helsing\" Having just finished AMC's hit series \"Hell On Wheels,\" playing the enigmatic 'Swede.\" This post-Civil War drama debuted as the second highest rated original series in AMC history. Heyerdahl also joined the fifth season of HBO's hit show \"True Blood\" portraying The Authority's \"Headless\" Chancellor, Dieter Braun. Born in British Columbia, Heyerdahl is known internationally for his powerful performances in film, theatre and television. His previous credits include roles as H.P. Lovecraft in the Gemini award winning \"Out Of Mind: The Stories Of H.P. Lovecraft\", \"The Ghosts of Dickens' Past\" in which he starred as Charles Dickens, \"The Education Of Little Tree and Blade: Trinity.\" Fluent in French, he also starred in \"Le Dernier Tunnel,\" \"Cadavres\" and \"La Loi Du Cochon.\" Heyerdahl has an impressive list of television credits including recent guest roles on \"Midnight, Texas\", \"Monority Report\", \"The Player\", \"Rush,\" \"Dig,\" \"Vegas,\" \"Castle,\" \"CSI,\" and \"Falling Skies,\" as well as recurring guest roles on \"Supernatural,\" \"Caprica,\" \"Smallville,\" \"Human Target,\" \"Stargate Atlantis,\" the award-winning children's series \"Are You Afraid of the Dark?\" as well as Steven Spielberg's Emmy and Golden Globe Award winning mini-series \"Into The West\" for Dreamworks TNT. In June 2015, Heyerdahl won a Leo Award for Best performance by a male (supporting) in a motion picture for \"Eadweard\" and Best Performance in a Children's Program for R.L. Stine's \"The Haunting Hour - Fear Never Knocks\" In 2012. Additionally, in 2010 and 2006 Heyerdahl won Leo Awards for Best Supporting Performance by a Male in a Dramatic Series for \"Sanctuary;\" and Best Guest Performance by a Male in a Dramatic Series respectfully for his performance as Jan Van Der Heyden in \"The Collector.\" In 2009, Heyerdahl was nominated for Best Supporting Performance by a Male in a Dramatic Series for \"Sanctuary- Revelations Part 2\" and a Gemini Award nomination for Best Performance by an Actor in a Guest Role in a Dramatic Series, also for \"Sanctuary.\" On stage, Heyerdahl has a long list of theatre credits including \"Love's Labour's Lost\", \"The Changeling\" and \"Knight of the Burning Pestle\" at the Stratford Shakespeare Festival, \"The Glace Bay Miners' Museum\", \"The Last Comedy\", and \"Savage Love\", to name a few. Most recently, Heyerdahl shot a leading role alongside Susan Sarandon, Donald Sutherland and Ellen Burstyn in the indie crime-drama \"The Calling,\" Gil Bellows in \"3 Days in Havana\" and Michael Eklund in \"Eadwaerd.\" Heyerdahl is internationally known for his dual roles of John Druitt and Bigfoot in SyFy's hit series \"Sanctuary\" and the mega hit \"Twilight\" franchise as the \"sensitive\" Volturi Leader Marcus.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNDM2NjAzMV5BMl5BanBnXkFtZTcwNjc0MTgwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0382216","name":"Christopher Heyerdahl","idIMDB":"nm0382216"},"actorId":"nm0382216","character":"O'Hara","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emma Stevens","urlProfile":"http://www.imdb.com/name/nm0828394","urlPhoto":"","biography":{"bio":"Emma Stevens is known for her work on Assassin Warrior (1996), Beyond Borders (2003) and Assassin's Creed III (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0828394","name":"Emma Stevens","idIMDB":"nm0828394"},"actorId":"nm0828394","character":"Target Woman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexandria Haber","urlProfile":"http://www.imdb.com/name/nm0352159","urlPhoto":"","biography":{"bio":"Alexandria Haber is an actress, known for Assassin Warrior (1996), Jackie Bouvier Kennedy Onassis (2000) and 19-2 (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0352159","name":"Alexandria Haber","idIMDB":"nm0352159"},"actorId":"nm0352159","character":"Peasant Girl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Reynald Robinson","urlProfile":"http://www.imdb.com/name/nm0733012","urlPhoto":"","biography":{"bio":"Reynald Robinson is an actor, known for Assassin Warrior (1996), La sarrasine (1992) and Crème glacée, chocolat et autres consolations (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0733012","name":"Reynald Robinson","idIMDB":"nm0733012"},"actorId":"nm0733012","character":"Refugee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dale Hayes","urlProfile":"http://www.imdb.com/name/nm0370962","urlPhoto":"","biography":{"bio":"Dale Hayes is an actress and casting director, known for Assassin Warrior (1996), Hawaii (2006) and Au coeur des secrets (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0370962","name":"Dale Hayes","idIMDB":"nm0370962"},"actorId":"nm0370962","character":"Refugee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Erin Simms","urlProfile":"http://www.imdb.com/name/nm0799958","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU4YmI4ODEtZmY5Zi00ZjQ1LTk4MmMtNDA1ZjUzZDA5NWU0L2ltYWdlXkEyXkFqcGdeQXVyMTMxNzIwOTg@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1976","placeOfBirth":" Montréal, Québec, Canada","bio":"Erin Simms was born and raised in Montreal. She went to St. George's high school that specializes in the arts. After learning acting for a couple of years she landed a small part in her first movie and then landed the part of Morgan on Student Bodies. She left the show to be on the Power Rangers. She now lives in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU4YmI4ODEtZmY5Zi00ZjQ1LTk4MmMtNDA1ZjUzZDA5NWU0L2ltYWdlXkEyXkFqcGdeQXVyMTMxNzIwOTg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0799958","name":"Erin Simms","idIMDB":"nm0799958"},"actorId":"nm0799958","character":"Refugee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jonathan Robert Rondeau","urlProfile":"http://www.imdb.com/name/nm0739991","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyODU0ODI3NF5BMl5BanBnXkFtZTYwMzE0NjM4._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1977","placeOfBirth":" Montreal, Quebec, Canada","bio":"Jonathan Robert Rondeau was born on October 10, 1977 in Montreal, Quebec, Canada. He is an actor, known for Assassin Warrior (1996), Stardom (2000) and Funkytown (2011). He has been married to Brigid Quinlan since May 22, 2010. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyODU0ODI3NF5BMl5BanBnXkFtZTYwMzE0NjM4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0739991","name":"Jonathan Robert Rondeau","idIMDB":"nm0739991"},"actorId":"nm0739991","character":"Refugee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carl Alacchi","urlProfile":"http://www.imdb.com/name/nm0015775","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MjE2Njk2OF5BMl5BanBnXkFtZTcwNzQ5NDkzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Carl Alacchi is an actor, known for The Day After Tomorrow (2004), The Terminal (2004) and Hollow Point (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MjE2Njk2OF5BMl5BanBnXkFtZTcwNzQ5NDkzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0015775","name":"Carl Alacchi","idIMDB":"nm0015775"},"actorId":"nm0015775","character":"Soldier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jonathan Larocque","urlProfile":"http://www.imdb.com/name/nm0488463","urlPhoto":"","biography":{"bio":"Jonathan Larocque is an actor, known for Assassin Warrior (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0488463","name":"Jonathan Larocque","idIMDB":"nm0488463"},"actorId":"nm0488463","character":"Soldier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andreas Apergis","urlProfile":"http://www.imdb.com/name/nm0032001","urlPhoto":"","biography":{"bio":"Andreas Apergis has been working as an actor, director and translator for over twenty years in both French and English. Recent screen credits include Pawn Sacrifice, Ed Zwick's biopic about Bobby Fischer, Brian Singer's X-Men: Days of Future Past and Guy Maddin's Séances project. He played Commander Krone in Riddick 3 as well as the mercenary Ritter in Rolland Emmerich's White House Down. For television he has appeared in four seasons of Being Human, as Miro Cescu in Durham County 3 and has a recurring role in Timothy Sexton's Lifetime series The lottery . He has also been the voice in many video games, such as Cesare Borgia in Assassin's Creed Brotherhood, and Frank Pritchard in Deus Ex: Human Revolution. In 2009 he received a Best Actor Mecca award for his work in the original play Blessed are They. His directorial debut of Medea (produced by Scapegoat Carnivale Theatre) which he translated and starred in as Jason won best English Language production in 2011, while his second, a translation of Euripides The Bacchae won a total of nine awards including Best Actor and Best Production.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0032001","name":"Andreas Apergis","idIMDB":"nm0032001"},"actorId":"nm0032001","character":"Soldier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tim Post","urlProfile":"http://www.imdb.com/name/nm0692874","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2MxOGQwNjYtNTZkZC00NmIwLWI0NTEtOTM5NDEyNWUxMjVmL2ltYWdlXkEyXkFqcGdeQXVyMTM5NTM2Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1963","placeOfBirth":" Canada","bio":"Tim Post was born in 1963 in Canada. He is an actor, known for Enemy (2013), Dawn of the Dead (2004) and X-Men: Days of Future Past (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2MxOGQwNjYtNTZkZC00NmIwLWI0NTEtOTM5NDEyNWUxMjVmL2ltYWdlXkEyXkFqcGdeQXVyMTM5NTM2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0692874","name":"Tim Post","idIMDB":"nm0692874"},"actorId":"nm0692874","character":"Soldier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Cavalier","urlProfile":"http://www.imdb.com/name/nm0146767","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDEzYTJhNGItMWY4NC00MWQwLWEwYmMtNjI3NzVlNjNkZTZlXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"bio":"Jason Cavalier is known for his work on Aviator (2004), 300 (2006) and Immortals (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDEzYTJhNGItMWY4NC00MWQwLWEwYmMtNjI3NzVlNjNkZTZlXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0146767","name":"Jason Cavalier","idIMDB":"nm0146767"},"actorId":"nm0146767","character":"Soldier","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0117653","urlIMDB":"http://www.imdb.com/title/tt0117653","business":{"budget":{"money":"$9,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":[],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"21","month":"07","year":"1995","remarks":null},{"money":null,"country":null,"day":"06","month":"09","year":"1995","remarks":null}],"copyrightHolder":"Algonquin Productions Limited"},"technical":{"runtime":["1 hr 33 min (93 min)","1 hr 28 min (88 min) (cut) (Germany)"],"soundMix":["Dolby"],"color":["Color (Eastmancolor)"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"5.6","filmingLocations":[{"location":"Jean d'Estrees St, Montreal, Québec, Canada"}],"rated":"R","awards":[],"votes":"2,855","type":"Movie","companyCreditsSimple":[{"idCompany":"co0070887","name":"Algonquin Productions Limited"},{"idCompany":"co0020020","name":"Cine Grande Corporation"},{"idCompany":"co0033479","name":"Conquistador Entertainment"}],"keywords":{"keywords":["assassin","soldier","action noir","veteran","rangefinder","die hard scenario","tv movie","brutality","sniper rifle","hand to hand combat","kickboxing","karate","martial arts","showdown","gunfight","disarming someone","rope","helmet","body armor","hk 5 machine gun","beretta","semiautomatic pistol","violence","gore","blood","female fighter","tough girl","tough guy","one against many","one man army","action hero","hero","nonlinear timeline","bomb","rooftop","pizza","exploding car","exploding helicopter","held at gunpoint","security guard","shotgun","pistol","silencer","machine gun","shootout","ignoring a telephone","refugee","hitman","handcuffs","uh 1 huey helicopter","time lapse photography","tattoo","sunrise","spider","slow motion scene","shot multiple times","shot in the chest","shot in the back","shot in the head","running through water","running for your life","rocky beach","rappel from helicopter","rain","punched in the face","night vision binoculars","knife held to someone's throat","kill zone","kicked in the belly","jeep","hitting a woman","helicopter crash","hallucination","gun held to one's crotch","freight elevator","flashback","firing squad","falling object","falling elevator","extreme closeup","explosion","execution","dumbell","drinking from the bottle","dream","construction site","choke hold","chain link fence","carbine","car fire","bullet proof vest","blood splatter","armor piercing ammunition","ak 47","aerial shot",".50 calibre bullet",".357 magnum","sniper","female nudity","lasersight","massacre","independent film","surprise ending","plot twist"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 23:25:04"}}