{"data":{"movies":[{"title":"Weekend at Bernie's II","originalTitle":"","year":"1993","releaseDate":"19930709","directors":[{"name":"Robert Klane","id":"nm0458228"}],"writers":[{"name":"Robert Klane","id":"nm0458228"},{"name":"Robert Klane","id":"nm0458228"}],"runtime":"97 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NDQ1MTM4MF5BMl5BanBnXkFtZTcwMzI4MTgxMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Adventure","Comedy","Fantasy"],"plot":"After their adventure at Bernie's weekend house (events of \"Weekend At Bernie's\") accountants/programmers oafish Larry and up-tight Richard return to New York only to be blamed by the insurance company they all worked for Bernie's theft of two million dollars and fired. Larry and Richard investigate and discover that the money is somewhere in St Thomas in the Virgin Islands. Meanwhile the Cartel Bernie was stealing the money for hires a Voodoo Queen to help them find the money. She tells Henry and Charles to steal Bernie's body and raise it from the dead to lead them to the money. Unfortunately Henry and Charles goofed and Bernie can only move when he hears music. Richard, Larry and Bernie all go to St Thomas to find the money with the aid of Claudia only to be followed by Hummel, a company security officer, who believes that Larry and Richard stole the money as well as Henry and Charles. Who will get to the money first?...","simplePlot":"Larry and Richard use a voodoo-revived corpse to track down hidden money to clear their names.","actors":[{"actorName":"Andrew McCarthy","urlProfile":"http://www.imdb.com/name/nm0000530","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NzU0MzY0N15BMl5BanBnXkFtZTgwOTE2MDkzODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 November 1962","placeOfBirth":" New York City, New York, USA","height":"5' 9\" (1.75 m)","bio":"Andrew McCarthy grew up in Westfield, New Jersey, until he was 15. He then moved to Bernardsville, and attended a prep school called the Pingry School, where he performed in plays and musicals and played basketball. At 18, he went to New York University as a theatre major and wound up as the lead in the 1983 film Class (1983). He also studied at the Circle in Square Theater School in New York. He has been in several on and off Broadway shows, such as 'Long Day's Journey', as well as over 40 movies. He continues to show his talented acting abilities in upcoming movies and shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NzU0MzY0N15BMl5BanBnXkFtZTgwOTE2MDkzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000530","name":"Andrew McCarthy","idIMDB":"nm0000530"},"actorId":"nm0000530","character":"Larry Wilson","urlCharacter":"http://www.imdb.com/character/ch0016011","main":true},{"actorName":"Jonathan Silverman","urlProfile":"http://www.imdb.com/name/nm0001738","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2NjY5OTAxN15BMl5BanBnXkFtZTcwNzg3NDQ2MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 August 1966","placeOfBirth":" Los Angeles, California, USA","birthName":"Jonathan Elihu Silverman","height":"6' 0½\" (1.84 m)","bio":"Jonathan Silverman was born on August 5, 1966 in Los Angeles, California, USA as Jonathan Elihu Silverman. He is known for his work on Weekend at Bernie's (1989), The Single Guy (1995) and 12:01 (1993). He has been married to Jennifer Finnigan since June 7, 2007.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2NjY5OTAxN15BMl5BanBnXkFtZTcwNzg3NDQ2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001738","name":"Jonathan Silverman","idIMDB":"nm0001738"},"actorId":"nm0001738","character":"Richard Parker","urlCharacter":"http://www.imdb.com/character/ch0016012","main":true},{"actorName":"Terry Kiser","urlProfile":"http://www.imdb.com/name/nm0435218","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjcwMjAyOF5BMl5BanBnXkFtZTgwMDg5NjQ2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 August 1939","placeOfBirth":" Omaha, Nebraska, USA","bio":"Excellent, prolific and dependable character actor Terry Kiser was born in Omaha, Nebraska. Terry attended the University of Kansas on both football and dramatic scholarships. He graduated with a degree in Industrial Engineering and worked for three years in this profession in his hometown of Omaha. Kiser also acted in some 50 plays around this same time. Terry then moved to New York and studied his craft at the Actors Studio, where he was mentored by legendary Method acting teacher Lee Strasberg. Following several gigs in television commercials, he made his film debut as a preacher in the film Rachel, Rachel (1968). Although often cast as sleazy and unlikable scoundrels, Terry has shown on occasion that he can portray more sympathetic parts with equal skill and conviction. Kiser gave an especially strong and engaging performance in a rare substantial starring role in the little seen drama Lapin 360 (1972). Best known as the deceased, but still active Bernie Lomax in the hilarious \"Weekend at Bernie's\" films, Terry's other memorable roles include Chuck Norris' ill-fated cop partner Dave Pierce in the exciting An Eye for an Eye (1981), shady businessman Freddy Barrett in the entertaining science fiction disaster film Starflight: The Plane That Couldn't Land (1983), petty worthless hoodlum Jesse Hardwick in the superior horror anthology opus From a Whisper to a Scream (1987), sneaky psychiatrist Dr. Crews in Friday the 13th Part VII: The New Blood (1988), and the evil Count Gunther Spretzle in Mannequin: On the Move (1991). Kiser had a recurring part on the daytime soap opera The Doctors (1963). Among the many television series Terry has done guest spots on are Will & Grace (1998), Walker, Texas Ranger (1993), Baywatch Nights (1995), Dream On (1990), The Golden Girls (1985), L.A. Law (1986), Hunter (1984), Murder, She Wrote (1984), Riptide (1984), Knight Rider (1982), The Fall Guy (1981), Magnum, P.I. (1980), Hill Street Blues (1981), CHiPs (1977), Diff'rent Strokes (1978), All in the Family (1971), Maude (1972), Hawaii Five-O (1968), The Bionic Woman (1976), The Six Million Dollar Man (1974), and Baretta (1975). In addition to his film and television work, Kiser has acted on stage in the Broadway plays \"God's Favorite\" (Terry received a Tony Award nomination for his performance in this Neil Simon comedy), \"Shelter\", \"The Castro Complex\", and \"Paris Is Out!\". Terry won both an Obie and a Theater World Award for his exemplary acting in the dramatic play \"Fortune and Men's Eyes\". Terry currently resides in Austin, TX and co-founded the premiere acting school The Actors Arena.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjcwMjAyOF5BMl5BanBnXkFtZTgwMDg5NjQ2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0435218","name":"Terry Kiser","idIMDB":"nm0435218"},"actorId":"nm0435218","character":"Bernie Lomax","urlCharacter":"http://www.imdb.com/character/ch0016014","main":true},{"actorName":"Troy Byer","urlProfile":"http://www.imdb.com/name/nm0004752","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzM3NDk0Y2YtMmU0Zi00MDM5LTkxYjUtYjQ0OWQxZmNjYzRiXkEyXkFqcGdeQXVyNjM5NzEyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 November 1964","placeOfBirth":" New York City, New York, USA","birthName":"Troy Yvette Beyer","height":"5' 5\" (1.65 m)","bio":"Troy Byer began her career in show business at the ripe age of four as one of the original cast members on Sesame Street. Although Troy has worked most of her life as an actress (Dynasty, Murder One, The Cosby Show), writer (BAPS, Love Don't Cost A Thing, Soul Food) and director of major studio films she is also author of Amazon best seller, \"Ex-Free: 9 Keys To Freedom After Heartbreak\". Troy is currently earning her PhD in Jungian Analysis with and emphasis on Archetypal studies. She has a Master's Degree in Depth Psychology with an emphasis in Liberal, Eco and Community Psychology, Troy has dedicated her life to working with and teaching individuals and communities how to heal from pain caused by heartbreak and working with single mothers. Troy has appeared on numerous shows including The Dr. Oz show and Steve Harvey's TV & Radio show as a Heartbreak Recovery Expert.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzM3NDk0Y2YtMmU0Zi00MDM5LTkxYjUtYjQ0OWQxZmNjYzRiXkEyXkFqcGdeQXVyNjM5NzEyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004752","name":"Troy Byer","idIMDB":"nm0004752"},"actorId":"nm0004752","character":"Claudia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barry Bostwick","urlProfile":"http://www.imdb.com/name/nm0000960","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NjA4MDg0MV5BMl5BanBnXkFtZTgwNDY5MDgzNDE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1945","placeOfBirth":" San Mateo, California, USA","birthName":"Barry Knapp Bostwick","height":"6' 4\" (1.93 m)","bio":"Tall (6' 4\"), agile, energetic, and ever-so-confident as both actor and singer, especially on the award-winning Broadway stage, Barry Bostwick possesses that certain narcissistic poise, charm and élan that reminds one instantly (and humorously) of a Kevin Kline -- both were quite brilliant in their respective interpretations of The Pirate King in \"The Pirates of Penzance\". Yet, for all his diverse talents (he is a Golden Globe winner and was nominated for the Tony Award three times, winning once), Barry is indelibly caught in a time warp. Even today, 35 years after the fact, he is indelibly associated with the role of nerdy hero Brad Majors in the midnight movie phenomena The Rocky Horror Picture Show (1975). While it is extremely flattering to be a part of such a cult institution, Barry's acting legacy deserves much more than this. He was born Barry Knapp Bostwick on February 24, 1945, in San Mateo, California, one of two sons of Elizabeth \"Betty\" (Defendorf) and Bud Bostwick (Henry Bostwick), a city planner and actor. A student at San Mateo High School, he and his elder brother Peter use to put on musicals and puppet shows for the neighborhood kids. Barry attended San Diego's United States International University's School for the Performing Arts in 1967, and switched from music to drama during the course of his studies. He also worked occasionally as a circus performer, which would come in handy on the musical stage down the line. He subsequently moved to New York and attended the Graduate School of Arts and Sciences at New York University. Making his stage debut at age 22 in a production of \"Take Her, She's Mine,\" Barry performed in a number of non-musical roles in such productions of \"War and Peace\" (1968) and \"The Misanthrope (1968). Making his 1969 Broadway debut in \"Cock-a-Doodle Dandy\", which ran in tandem with \"Hamlet\" in which he was featured as Osric, it was his portrayal of the swaggering, leather jacket-wearing 50s \"bad boy\" Danny Zuko in the 1972 Broadway high-school musical smash \"Grease\" that put Barry's name prominently and permanently on the marquee signs. Originating the role, he was nominated for a Tony but lost out that year to the older generation (Phil Silvers for \"A Funny Thing Happened...\"). In the midst of all this star-making hoopla, Barry was also breaking into films with a minor role in Jennifer on My Mind (1971) and leading parts in the comedy spoofs Road Movie (1974) and The Wrong Damn Film (1975). It all paled after winning the role as Susan Sarandon's simp of a boyfriend in the The Rocky Horror Picture Show (1975), which featured a delicious Tim Curry camping it up as a transvestite monster-maker. The movie, based on the macabre 1973 British stage musical \"The Rocky Horror Show,\" packed the midnight movie houses with costumed fans replicating every move and, word and offering puns and props aplenty in recapturing the insanity of the show. While the \"Rocky\" association hit like a tornado, Barry ventured on and tried to distance himself. He created sparks again on Broadway, garnering a second Tony nomination for the comedy revival \"They Knew What They Wanted\" in 1976. He finally took home the trophy the following year for the musical \"The Robber Bridegroom\" (1977), which relied again on his patented bluff and bravado as a Robin Hood-like hero. Following top roles in the musicals \"She Loves Me\" and \"The Pirates of Penzance\", Barry turned rewardingly to film and TV. The two-part feature Movie Movie (1978), which played like an old-style double feature, was a great success, performing alongside esteemed actor George C. Scott. Barry excelled in both features, but especially the musical parody. He fared just as well on the smaller screen in TV movies, playing everything from historical icons (George Washington) to preening matinée idols (John Gilbert), and winning a Golden Globe for his role as a military officer in the epic miniseries War and Remembrance (1988). A variety of interesting roles followed in glossy, soap-styled fare, farcical comedies and period drama. A welcomed return to Broadway musicals in the form of \"Nick & Nora\" (he as sleuth Nick \"The Thin Man\" Charles) was marred when the glitzy production folded after only nine perfs. Instead, the prematurely grey-haired actor found steadier success in sitcoms as a smug comedy foil to Michael J. Fox playing Mayor Randall Winston for six seasons in Spin City (1996). He later enjoyed a recurring role as a dauntless attorney on Law & Order: Special Victims Unit (1999). Then again, Barry could be spotted pitching items in commercials or hamming it up in family-oriented Disneyesque entertainment in the \"Parent Trap\" and \"101 Dalmatian\" mold. In 1997, Bostwick was diagnosed with prostate cancer, and 10 days later had his prostate removed. The operation was successful and in 2004, he won the Gilda Radner Courage Award from the Roswell Park Cancer Institute. Just a year earlier he appeared on an episode of \"Scrubs\" as a patient also having prostate cancer. Barry married somewhat late in life. For a brief time he was wed to actress Stacey Nelkin (1987-1991), but has since become a father of two, Brian and Chelsea, with second wife Sherri Jensen Bostwick, an actress who appeared with Barry in the TV movie Praying Mantis (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NjA4MDg0MV5BMl5BanBnXkFtZTgwNDY5MDgzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000960","name":"Barry Bostwick","idIMDB":"nm0000960"},"actorId":"nm0000960","character":"Arthur Hummel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Wright","urlProfile":"http://www.imdb.com/name/nm0942875","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MjM5NzM2NF5BMl5BanBnXkFtZTgwMDg3NDk2NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 November 1952","placeOfBirth":" Englewood, New Jersey, USA","birthName":"Harold Thomas Wright","bio":"Tom Wright was born on November 29, 1952 in Englewood, New Jersey, USA as Harold Thomas Wright. He is known for his work on Marked for Death (1990), Barbershop (2002) and Seinfeld (1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MjM5NzM2NF5BMl5BanBnXkFtZTgwMDg3NDk2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0942875","name":"Tom Wright","idIMDB":"nm0942875"},"actorId":"nm0942875","character":"Charles","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steve James","urlProfile":"http://www.imdb.com/name/nm0416944","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjgxODU2MzM5MV5BMl5BanBnXkFtZTcwMjAwMTcyNA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 February 1952","placeOfBirth":" New York City, New York, USA","height":"6' 1\" (1.85 m)","bio":"Steve James was often cast in action movies as the hero's sidekick, despite usually being a better actor and fighter than the star. James was raised in New York City, attended C.W. Post College as an Arts and Film major, and upon graduating, became involved in stage work and TV commercials. He started in film as a stuntman, working in such New York productions as Ghostbusters, The Wiz, The Warriors, and The Wanderers. His first major film role was as Robert Ginty's sidekick in The Exterminator; he later played sidekick to such stars as Michael Dudikoff (3 times), David Carradine, and Chuck Norris. His last 2 films were the pilot for the TV series \"M.A.N.T.I.S.\" which aired on the Fox network just a few weeks after his death at age 41 of cancer (of unknown origin) and \"Bloodfist V: Human Target\" with Don \"The Dragon\" Wilson which premiered after Steve's death.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjgxODU2MzM5MV5BMl5BanBnXkFtZTcwMjAwMTcyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0416944","name":"Steve James","nicknames":["Lurch"],"idIMDB":"nm0416944"},"actorId":"nm0416944","character":"Henry","urlCharacter":"http://www.imdb.com/character/ch0016015","main":true},{"actorName":"Novella Nelson","urlProfile":"http://www.imdb.com/name/nm0625645","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxOTM5NjkyNF5BMl5BanBnXkFtZTcwNDA1OTI0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 December 1939","placeOfBirth":" Brooklyn, New York, USA","bio":"Novella Nelson was born on December 17, 1939 in Brooklyn, New York, USA. She is an actress, known for A Perfect Murder (1998), The Devil's Advocate (1997) and Antwone Fisher (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxOTM5NjkyNF5BMl5BanBnXkFtZTcwNDA1OTI0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0625645","name":"Novella Nelson","idIMDB":"nm0625645"},"actorId":"nm0625645","character":"Mobu","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Phil Coccioletti","urlProfile":"http://www.imdb.com/name/nm0168083","urlPhoto":"","biography":{"dateOfBirth":"26 June 1953","placeOfBirth":" Greensburg, Pennsylvania, USA","bio":"Phil Coccioletti was born on June 26, 1953 in Greensburg, Pennsylvania, USA. He is an actor, known for It's Complicated (2009), Weekend at Bernie's II (1993) and Mystère (1983).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0168083","name":"Phil Coccioletti","idIMDB":"nm0168083"},"actorId":"nm0168083","character":"Cartel Man #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Dourdan","urlProfile":"http://www.imdb.com/name/nm0235427","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTkzNTU4Ml5BMl5BanBnXkFtZTYwNTU0Njg3._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 December 1966","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Gary Robert Durdin","height":"6' 2\" (1.88 m)","bio":"Gary Dourdan was born on December 11, 1966 in Philadelphia, Pennsylvania, USA as Gary Robert Durdin. He is an actor, known for CSI: Crime Scene Investigation (2000), Alien: Resurrection (1997) and Perfect Stranger (2007). He was previously married to Roshumba Williams.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTkzNTU4Ml5BMl5BanBnXkFtZTYwNTU0Njg3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0235427","name":"Gary Dourdan","idIMDB":"nm0235427"},"actorId":"nm0235427","character":"Cartel Man #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Lally","urlProfile":"http://www.imdb.com/name/nm0482466","urlPhoto":"","biography":{"dateOfBirth":"2 October 1956","placeOfBirth":" Cleveland, Ohio, USA","height":"6' 4\" (1.93 m)","bio":"James Lally was born on October 2, 1956 in Cleveland, Ohio, USA. He is an actor, known for The Birdcage (1996), Working Girl (1988) and Before the Devil Knows You're Dead (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0482466","name":"James Lally","idIMDB":"nm0482466"},"actorId":"nm0482466","character":"Morgue Attendant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Rogers","urlProfile":"http://www.imdb.com/name/nm0737089","urlPhoto":"","biography":{"bio":"Born in Trinidad, Michael Rogers began his career as an actor and director with the Everyman Company in Brooklyn. He also spent five years teaching acting and playwriting in Harlem. Rogers received an MFA from the Yale School of Drama shortly before being cast in The Mosquito Coast as Francis Lungley, a local man who befriends Allie (played by Harrison Ford). Michael Rogers is a founding member of La Compagnia De' Colombari and has appeared in seven productions for Theatre for a New Audience. He has also appeared on Broadway in August Wilson's play Joe Turner's Come and Gone. Rogers is story editor for Soho Films US.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0737089","name":"Michael Rogers","idIMDB":"nm0737089"},"actorId":"nm0737089","character":"Island Cop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stack Pierce","urlProfile":"http://www.imdb.com/name/nm0682474","urlPhoto":"","biography":{"dateOfBirth":"15 June 1933","placeOfBirth":" USA","birthName":"Robert Stack Pierce","bio":"Stack Pierce was born on June 15, 1933 in the USA as Robert Stack Pierce. He is an actor, known for WarGames (1983), Days of Our Lives (1965) and Weekend at Bernie's II (1993). He was previously married to Marion Jean Johnson.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0682474","name":"Stack Pierce","idIMDB":"nm0682474"},"actorId":"nm0682474","character":"Claudia's Dad","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Constance Shulman","urlProfile":"http://www.imdb.com/name/nm0795723","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyNTAxMzM2MV5BMl5BanBnXkFtZTgwMjM1ODEwMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1958","placeOfBirth":" Johnson City, Tennessee, USA","bio":"Constance Shulman was born on April 4, 1958 in Johnson City, Tennessee, USA. She is an actress and producer, known for Sweet and Lowdown (1999), Fried Green Tomatoes (1991) and Orange Is the New Black (2013). She has been married to Reed Birney since July 3, 1999. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyNTAxMzM2MV5BMl5BanBnXkFtZTgwMjM1ODEwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0795723","name":"Constance Shulman","idIMDB":"nm0795723"},"actorId":"nm0795723","character":"Tour Operator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jennie Moreau","urlProfile":"http://www.imdb.com/name/nm0603403","urlPhoto":"","biography":{"bio":"Jennie Moreau is an actress, known for Weekend at Bernie's II (1993), Flying (2002) and MURDER and murder (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0603403","name":"Jennie Moreau","idIMDB":"nm0603403"},"actorId":"nm0603403","character":"Brenda","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0108539","urlIMDB":"http://www.imdb.com/title/tt0108539","business":{"budget":{"money":"$7,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1992/\">1992</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 37 min (97 min)","1 hr 30 min (90 min) (UK)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"4.6","filmingLocations":[{"location":"New York City, New York, USA"}],"rated":"PG","awards":[{"award":"The Stinkers Bad Movie Awards 1993","titlesAwards":[{"titleAwardOutcome":"Won Stinker Award","categories":[{"category":"Worst Sequel","names":[{"name":"Victor Drai","id":"nm0236819","role":null},{"name":"Joseph Perez","id":"nm0673530","role":null}]}]},{"titleAwardOutcome":"Nominated Stinker Award","categories":[{"category":"The Sequel Nobody Was Clamoring For","names":[{"name":"Victor Drai","id":"nm0236819","role":null},{"name":"Joseph Perez","id":"nm0673530","role":null}]}]}]}],"votes":"10,829","type":"Movie","companyCreditsSimple":[{"idCompany":"co0044553","name":"Artimm"},{"idCompany":"co0078622","name":"D&A Partnership"},{"idCompany":"co0005883","name":"TriStar Pictures"}],"keywords":{"keywords":["voodoo","fraud","corpse","island","second part","re animate","necrophilia","dancing corpse","conga","animated credits","chase","yanked off bikini top","sequel","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:48:16"}}