{"data":{"movies":[{"title":"The Guyver","originalTitle":"Guyver","year":"1991","releaseDate":"19920603","directors":[{"name":"Screaming Mad George","id":"nm0313608"},{"name":"Steve Wang","id":"nm0911036"}],"writers":[{"name":"Jon Purdy","id":"nm0700833"},{"name":"Yoshiki Takaya","id":"nm0157695"}],"runtime":"88 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNzY5MDU0OV5BMl5BanBnXkFtZTcwNzI0MDYyMQ@@._V1.jpg","countries":["USA","Japan"],"languages":["English"],"genres":["Sci-Fi","Action","Comedy"],"plot":"A young man discovers a mechanical device that merges with his own body, turning him into a cyborg superhero. When strange creatures start appearing, trying to take the device back, he begins to uncover a secret plot to genetically engineer terrifying monsters.","simplePlot":"A young man discovers a mechanical device that merges with his own body, turning him into a cyborg superhero. When strange creatures start appearing, trying to take the device back, he ... ","actors":[{"actorName":"Greg Joung Paik","urlProfile":"http://www.imdb.com/name/nm0656754","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNDgwMzIwMl5BMl5BanBnXkFtZTYwOTY0MDQ4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Greg Joung Paik is known for his work on Collision (2004), Get Smart (2008) and The Guyver (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNDgwMzIwMl5BMl5BanBnXkFtZTYwOTY0MDQ4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0656754","name":"Greg Joung Paik","idIMDB":"nm0656754"},"actorId":"nm0656754","character":"Dr. Tetsu Segawa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jimmie Walker","urlProfile":"http://www.imdb.com/name/nm0907858","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2MTMyMjcyNV5BMl5BanBnXkFtZTcwOTIzODYyNA@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 June 1947","placeOfBirth":" Bronx, New York, USA","birthName":"James Carter Walker","height":"6' 1\" (1.85 m)","bio":"He symbolized the 70s American dream of success -- the former kid from the ghetto who rose to wisecracking TV superstardom. While in his element as the broadly strutting, gleamy-toothed J.J. Evans of the popular urban-styled sitcom Good Times (1974), Jimmie Walker lived the extremely good life. Following the series' demise, however, reality again checked in. Still and all, he has not self-destructed as others before him have and continues to enjoy a comedy career now approaching four decades. Jimmie was born on June 25, 1947, in New York's tough South Bronx neighborhood. His ambitions were not originally to entertain. Basketball was his prime interest but the idea that a gawky, stringbean-framed teenager could become a hoop star did not seem realistic. Instead he abruptly quit school and worked an odd assortment of jobs until wisely returning to night classes at Theodore Roosevelt High School and redeeming himself with a diploma. The federally-funded Search for Education, Evaluation and Knowledge (SEEK) next came through for Jimmie as he was able to learn a trade: radio engineering/announcing. Within a year he was hired as an engineer for a small radio station, but gained a minor reputation on the sly as a funny guy and good writer. This side interest is what motivated Jimmie to try comedy performance. He made his stand-up debut as an opening act on New Year's Eve in 1967 for \"The Last Poets,\" a militant poetry group, and was such a hit that he stayed with the group for a year and a half building and polishing his jive-styled act. At one point Jimmie was seen at a Manhattan club by comedian David Brenner who referred him and others (such as Freddie Prinze) to Budd Friedman and his Improv stage in New York. Jimmie eventually became a regular. His debut shot on TV variety came with Jack Paar's show and his successful 1972 appearance propelled him to main attraction billing. He was quickly checked out by the Norman Lear team and practically handed stardom on a silver platter with Good Times (1974), a spin-off of Esther Rolle's domestic character on the popular Maude (1972) series. Skinny, energetic and youthful-looking with plenty of harmless sass and attitude, Jimmie and the show were instant cross-over hits despite the fact that he was a 27-year-old playing the teenage son of Rolle. His catchphrase \"Dyn-o-mite!\" became a popular item in the American vernacular. Jimmie became such a major celebrity that Time Magazine named him \"Comedian of the Decade.\" Clothing, belts, and even a talking doll that blurted out his familiar phrase were soon on the open market. To the dismay of other actors on the show, his exaggerated character stole prime focus and shifted the well-intentioned direction of a positive black family image into a much broader and stereotyped caricature. This caused dissension in the troops and both adult leads, Ms. Rolle and John Amos, departed the series (Rolle came back later). Nevertheless, the series managed to last six seasons. During that time Jimmie made use of his ever-surging popularity with lightweight appearances elsewhere on primetime (\"The Love Boat,\" \"Fantasy Island\") and on game shows (\"The Match Game,\" \"Tattletales\"). He became a hot item in Las Vegas and even churned out a best-selling comedy album entitled, of course, \"Dyn-o-mite!\" His attempt at film stardom came with a top supporting role in Let's Do It Again (1975) starring Sidney Poitier and Bill Cosby, a comedy that also featured his TV dad John Amos. Jimmie was featured as a highly unlikely, scrawny-framed boxer promoted by Poitier and Cosby. As enjoyable as he was, it did not lead to other major film offers. Most of his later movies have been self-mocking guest parts or cameo bits in spoofs such as in Airplane! (1980), the Frankenstein take-off Monster Mash: The Movie (1995) and the slasher movie parody Shriek If You Know What I Did Last Friday the Thirteenth (2000). Upon the series' demise in 1979, Jimmie returned to the stand-up stage while looking for a sophomore TV hit. Unable to capitalize on his TV stardom, he instead found himself extremely pigeon-holed by the J.J. character. The short-lived B.A.D. Cats (1980), which had him playing a support role as a comic car thief-cum-repossessor, lasted only a month. The military comedy At Ease (1983) had Jimmie starring as a Sergeant Bilko-like conman. It too came and went quickly. Hoping the third time would be a charm, Jimmie was a bust again in the syndicated show Bustin' Loose (1987), based loosely on Richard Pryor's 1981 movie, with the comedian playing another of his genial con artists. Jimmie's main focus has remained the stand-up circuit, touring an average of 25-30 weeks a year. The rubbery-faced, tunnel-mouthed comic continues to pop up occasionally on the late night talk show forum. In his spare time he writes scripts for TV and films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2MTMyMjcyNV5BMl5BanBnXkFtZTcwOTIzODYyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0907858","name":"Jimmie Walker","nicknames":["J.J."],"idIMDB":"nm0907858"},"actorId":"nm0907858","character":"Striker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Spellos","urlProfile":"http://www.imdb.com/name/nm0046428","urlPhoto":"","biography":{"birthName":"Peter Spellos","bio":"Peter Spellos is known for his work on Men in Black II (2002), Bound (1996) and Ghost in the Shell (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0046428","name":"Peter Spellos","idIMDB":"nm0046428"},"actorId":"nm0046428","character":"Ramsey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Berryman","urlProfile":"http://www.imdb.com/name/nm0077720","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0OTA0MTAwM15BMl5BanBnXkFtZTcwOTQ3MDQ4NA@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 September 1948","placeOfBirth":" Los Angeles, California, USA","birthName":"Michael John Berryman","height":"6' 2\" (1.88 m)","bio":"Late 1970s horror genre icon who's best known for his creepy performance as \"Pluto\" in the uncompromising Wes Craven horror film The Hills Have Eyes (1977). Berryman (who suffers from Hypohidrotic Ectodermal Dysplasia, a rare condition leaving him with no sweat glands, hair, fingernails or teeth) reminds one of a latter-day Rondo Hatton who also suffered from a rare medical condition that distorted his features giving him a brutish look just right for horror movies. To Berryman's credit, he managed to develop upon his \"Pluto\" character, and has turned up in numerous sci-fi / fantasy movies such as My Science Project (1985), Weird Science (1985), Armed Response (1986) and Evil Spirits (1990). The tall & lean Berryman generally portrays mutant bikers, evil undertakers, monsters and other frightening characters! A genuine favorite of horror movie fans.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0OTA0MTAwM15BMl5BanBnXkFtZTcwOTQ3MDQ4NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0077720","name":"Michael Berryman","idIMDB":"nm0077720"},"actorId":"nm0077720","character":"Lisker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Spice Williams-Crosby","urlProfile":"http://www.imdb.com/name/nm0818454","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ0OTA3NDA5Nl5BMl5BanBnXkFtZTgwOTU1NzY2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1952","placeOfBirth":" North Hollywood, Los Angeles, California, USA","birthName":"Marceline Ann Williams","height":"5' 7½\" (1.71 m)","bio":"Born on a ranch in North Hollywood, California, Spice rode her horse to kindergarten, grew up playing in her father's medical offices, eventually hitting the road as a musician, singer, and dancer under contract to 20th Century-Fox Records. Overcoming a seven-year drug and alcohol problem, at the age of 26, she turned to God, nutrition and exercise with the eventual promise of helping others to turn their lives around. As she got older, Spice changed the course of her career and began studying acting for stage and film. After hearing about roles for female warriors, wrestlers, and super-heroines, she began to kickbox and bodybuild, slowly creating a niche for herself. Spice has worked in such feature motion pictures as Star Trek V, Cherokee Kid, From Dusk Till Dawn, The Guyver, A Simple Plan, and For The Love Of The Game. She has also guest-starred on numerous TV shows including, Roseanne, My Two Dads, Women In Prison, Mama's Family, The Bold And The Beautiful, Step by Step, The Smart Guy, Diagnosis Murder, Buffy the Vampire Slayer and Srcubs, in what she terms as an \"action actress.\" \"In fact,\" says Spice, \"I can't remember doing a role where I wasn't asked to perform some kind of physical feat\" Since 1986, Spice has been stunt doubling Deidre Hall (Marlena) on \"Days of our Lives and has also played several roles on that soap. She had the great honor of working with Clint Eastwood on \"Million Dollar Baby,\" and then had a blast working on an independent film in with Luke Goss, called \"Dead UnDead.\" She is very proud of co-starring in an incredible film called, \"The Sensei,\" with Diana Lee Inosanto starring & directing, a fun film called, \"Bare Knuckles, \" and recently, she played a warden in a Stallone film and can be seen as a hooker on the new TV show, Brooklyn 99. Currently, Spice has produced her own show called, \"I FIGHT FOR MY LIFE\" about women victims and turning them into women victors! Stunts came into play in 1980 ago when Spice was asked to double an actress playing a Judo instructor opposite Rock Hudson. Since then, she has doubled for the likes of Louise Fletcher, Meg Foster, Katherine Ross, Clare Carey, Deidre Hall, Cindy Pickett, Linda Kozlowski, Eileen Brennen, Becky Ann Baker, Kelly Preston and many more. Spice also Stunt Coordinates feature films, Television shows and commercials. Her stunt expertise is in fighting & \"hitting the ground!\" Although Spice has crashed cars, dove through glass windows, taken stair falls, executed 30-foot ratchets, 50-foot high falls, and hung from helicopters 350 feet above the ground, she is perhaps best known for her ability to pick a 300 pound man up over her head in a fireman's carry. Gracing the cover and pages of over 100 magazines, both here and abroad, Spice has also made a name for herself as a nutritional expert with 2 Masters in Fitness Science & Holistic Nutrition and a PhD in Natural Health Medicine, writing for magazine as Ms. Fitness, Natural Muscle Magazine, and World Black Belt. She holds a 3rd DAN in Arjukanpo, 1st DAN in Doce Pares Eskrima, and is Certified Level B in Israeli KAPAP, Level C in Guatemala GIKA, and Security Defensive Tactics, Inc.. Her successful joint venture with her husband -- a popular line of vegetarian food products called \"Spice Of Life Meatless Meats & Jerky.\" In December of 1998, she was voted into the Marquis Who's Who in America-West. One of her greatest honors was posing for a 30ft bronze statue where she represents the past, present and future female athletes of the Olympics. Spice's goal is to continue to set an example for the \"women of the new millennium\" -- spiritually focused, mentally alert, and physically capable. Spice is married to Gregory Crosby -- screenwriter (Hacksaw Ridge) and first-born grandson of actor/singer Bing Crosby and they have a beautiful son, Luke, who is equally healthy and active!","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ0OTA3NDA5Nl5BMl5BanBnXkFtZTgwOTU1NzY2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0818454","name":"Spice Williams-Crosby","idIMDB":"nm0818454"},"actorId":"nm0818454","character":"Weber","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Hamill","urlProfile":"http://www.imdb.com/name/nm0000434","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3Njc5ODc4OV5BMl5BanBnXkFtZTYwNjY5MTU0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1951","placeOfBirth":" Oakland, California, USA","birthName":"Mark Richard Hamill","height":"5' 9\" (1.75 m)","bio":"Mark Hamill is best known for his portrayal of Luke Skywalker in the original Star Wars trilogy - Star Wars: Episode IV - A New Hope (1977), Star Wars: Episode V - The Empire Strikes Back (1980), and Star Wars: Episode VI - Return of the Jedi (1983) - a role he reprise in Star Wars: The Force Awakens (2015). Hamill also starred and co-starred in the films Corvette Summer (1978), The Big Red One (1980), and Kingsman: The Secret Service (2014). Hamill's extensive voice acting work includes a long-standing role as the Joker, commencing with Batman: The Animated Series (1992). Mark Richard Hamill was born in Oakland, California, to Virginia Suzanne (Johnson) and William Thomas Hamill, a captain in the United States Navy. He majored in drama at Los Angeles City College and made his acting debut on The Bill Cosby Show (1969). He played a recurring role (Kent Murray) on the soap opera General Hospital (1963) and co-starred on the comedy series The Texas Wheelers (1974). Robert Englund auditioned for a role in Apocalypse Now (1979) when he walked across the hall where auditions were taking place for George Lucas's Star Wars saga. After watching the auditions for a while, he realized that Hamill, his friend, would be perfect for the role of Luke Skywalker. He suggested to Hamill that he audition for the role; Hamill did, and won the role. Released on May 25, 1977, Star Wars: Episode IV - A New Hope (1977) was an enormous unexpected success and made a huge impact on the film industry. Hamill also appeared in The Star Wars Holiday Special (1978) and later starred in the successful sequels Star Wars: Episode V - The Empire Strikes Back (1980), and Star Wars: Episode VI - Return of the Jedi (1983). For both of the sequels, Hamill was honored with the Saturn Award for Best Actor given by the Academy of Science Fiction, Fantasy and Horror Films. He reprise the role of Luke Skywalker for the radio dramatizations of both \"Star Wars\" (1981) and \"The Empire Strikes Back\" (1983). For the radio dramatization of \"Return of the Jedi\" (1996), the role was played by a different actor. With the acquisition of Lucasfilm by the Walt Disney Company, this was announced that there will be more Star Wars films starting with Star Wars: The Force Awakens (2015), which was released on December 18, 2015. Hamill appeared in Star Wars: The Force Awakens (2015) and will continue to star in the current trilogy, alongside fellow Star Wars actors Harrison Ford and Carrie Fisher, reprising their roles as Luke Skywalker, Han Solo and Princess Leia Organa, respectively.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3Njc5ODc4OV5BMl5BanBnXkFtZTYwNjY5MTU0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000434","name":"Mark Hamill","idIMDB":"nm0000434"},"actorId":"nm0000434","character":"Max Reed","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Armstrong","urlProfile":"http://www.imdb.com/name/nm0035737","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MTU2MTQwM15BMl5BanBnXkFtZTgwNTU2MTI3NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1958","placeOfBirth":" Stoneboro, Pennsylvania, USA","birthName":"John Michael Armstrong","height":"5' 11\" (1.8 m)","bio":"Jack Armstrong made his professional acting debut as \"Tom Sawyer\" on the stage of Houston's famed Alley Theatre. He then toured the U.S and Canada in an ensemble production headed by M*A*S*H (1972)'s \"Radar O'Reilly,\" Gary Burghoff. Other stage credits include \"Mrs. Warren's Profession\", \"I am a Camera\", \"The Fox\" and, most recently, the original production of \"Mountains\" for which Jack won the Dramalogue Award for Best Actor. His television career began playing \"Wally\" on the longest running daytime drama in history, the CBS soap Guiding Light (1952). ABC execs then placed him under contract for their hit, All My Children (1970) and, later, One Life to Live (1968). Audiences will also remember his work on Days of Our Lives (1965) and Amour, gloire et beauté (1987). Armstrong's prime-time television appearances began when writer/producer Hugh Wilson cast him in the recurring role of \"Marty\" on The Famous Teddy Z (1989). Other guest star roles include Friends (1994), The Tick (2001), Beverly Hills, 90210 (1990), Some of My Best Friends (2001), Oh Baby (1998), V.I.P. (1998) and many others. He starred in the USA series Eden (1993) which aired in the U.S. and internationally. Movies of the Week include Where Are My Children? (1994) with CSI: Crime Scene Investigation (2000)'s Marg Helgenberger and Hard Knox (1984) with Robert Conrad. Film credits include 28 Days (2000) with Sandra Bullock, HBO's Live from Baghdad (2002) with Michael Keaton and Helena Bonham Carter, \"Jersey Rose\" with Jenna Elfman, Student Bodies (1981) and the starring role in the Sci-Fi action thriller The Guyver (1991) based on the popular Japanese animated series. Jack also co-stars in the comedy Mi Amigo (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MTU2MTQwM15BMl5BanBnXkFtZTgwNTU2MTI3NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0035737","name":"Jack Armstrong","idIMDB":"nm0035737"},"actorId":"nm0035737","character":"Sean Barker / The Guyver","urlCharacter":"http://www.imdb.com/character/ch0056551","main":true},{"actorName":"Johnnie Saiko","urlProfile":"http://www.imdb.com/name/nm0756531","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNTAzODQxNV5BMl5BanBnXkFtZTcwMjY1MDg2OA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Johnnie Saiko is known for his work on X-Men Origins: Wolverine (2009), Stargate - La porte des étoiles (1994) and Race to Witch Mountain (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNTAzODQxNV5BMl5BanBnXkFtZTcwMjY1MDg2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0756531","name":"Johnnie Saiko","idIMDB":"nm0756531"},"actorId":"nm0756531","character":"Craig","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vivian Wu","urlProfile":"http://www.imdb.com/name/nm0943180","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NDcxMjc3MF5BMl5BanBnXkFtZTYwNDAwMjEy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1966","placeOfBirth":" Shanghai, China","birthName":"Junmei Wu","bio":"Vivian Wu was born in Shanghai, China, in 1966 as Wu Jun Mei. She started acting at age 15 with the Shanghai Film Studio, and then later studied Travel Industry Management at Hawaii's Pacific University. After that she played 'Wen Hsiu' in the Oscar-winning Le dernier empereur (1987) directed by Bernardo Bertolucci. In 1993 Vivian was cast by directer Oliver Stone in Entre ciel et terre (1993) and The Joy Luck Club (1993). Since then she has been working constantly in film and television and was cast by directer Peter Greenaway in 8 ½ Women (1999) and The Pillow Book (1996), in which she starred alongside Ewan McGregor. Vivian also played Soong May-ling in the hit film The Soong Sisters (1997) and was chosen by People magazine as one of the most beautiful people in the world in 1990.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NDcxMjc3MF5BMl5BanBnXkFtZTYwNDAwMjEy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0943180","name":"Vivian Wu","idIMDB":"nm0943180"},"actorId":"nm0943180","character":"Mizky Segawa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Deborah Anne Gorman","urlProfile":"http://www.imdb.com/name/nm0331058","urlPhoto":"","biography":{"dateOfBirth":"11 July 1981","placeOfBirth":"","birthName":"Deborah Anne Gorman","height":"5' 1\" (1.55 m)","bio":"Deborah Anne Gorman was born on July 11, 1981. She is an actress, known for The Guyver (1991), Stop at Nothing (1991) and I Don't Buy Kisses Anymore (1992).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0331058","name":"Deborah Anne Gorman","idIMDB":"nm0331058"},"actorId":"nm0331058","character":"Ms. Jenson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danny Gibson","urlProfile":"http://www.imdb.com/name/nm0316919","urlPhoto":"","biography":{"bio":"Danny Gibson is an actor, known for The Guyver (1991), Best of the Best (1989) and L.A. Streetfighters (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0316919","name":"Danny Gibson","idIMDB":"nm0316919"},"actorId":"nm0316919","character":"Aikido Instructor's Assistant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Willard E. Pugh","urlProfile":"http://www.imdb.com/name/nm0700072","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MzYwMTgzOV5BMl5BanBnXkFtZTcwMzc1NzkwNw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1959","placeOfBirth":" Memphis, Tennessee, USA","birthName":"Willard Earl Pugh","height":"5' 11\" (1.8 m)","bio":"Willard E. Pugh was born on June 16, 1959 in Memphis, Tennessee, USA as Willard Earl Pugh. He is an actor and producer, known for The Color Purple (1985), Air Force One (1997) and RoboCop 2 (1990).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MzYwMTgzOV5BMl5BanBnXkFtZTcwMzc1NzkwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0700072","name":"Willard E. Pugh","idIMDB":"nm0700072"},"actorId":"nm0700072","character":"Col. Castle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Gale","urlProfile":"http://www.imdb.com/name/nm0301834","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWViYWNhOTYtNTQxYy00Y2JhLWEzODQtZWJmN2E1N2M2ZDhjXkEyXkFqcGdeQXVyNzQxODc5NDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 October 1936","placeOfBirth":" Wimbledon, England, UK","birthName":"David Quentin Gale","height":"6' 1½\" (1.87 m)","bio":"Tall, thin and distinguished character actor David Quentin Gale was born on October 2, 1936 in Wimbledon, England. Gale began his acting career on the New York stage in the late 50s. He first started acting in both movies and television in the early 70s. With his gaunt face, lean build, and intense and imposing screen presence, David was usually cast as extremely wicked and hateful villains. Gale achieved his greatest enduring cult cinema popularity with his marvelously robust and inspired portrayal of the icy, ruthless, and arrogant mad scientist Dr. Carl Hill in Stuart Gordon's terrific horror splatter gem \"Re-Animator.\" He reprised this part in the enjoyable sequel \"Bride of Re-Animator.\" David's other memorable roles include demented pop psychologist TV show host Dr. Anthony Blakely in \"The Brain;\" at his deliriously wired and wacky best as batty CEO Carter Brown in \"Syngenor,\" and evil corporate head Fulton Balcus in \"The Guyver.\" Gale had recurring parts on the TV shows \"The Secret Storm,\" \"The Edge of Night,\" \"One Life to Live,\" and \"Search for Tomorrow.\" Among the TV series he made guest appearances on episodes of are \"Kojak,\" \"Ryan's Hope,\" \"Hart to Hart,\" \"The Dukes of Hazzard,\" \"Tales from the Darkside,\" \"L.A. Law,\" \"Dallas,\" and \"Knots Landing.\" Moreover, David also had a lengthy and impressive stage career: He not only acted in Broadway stage productions of the classic plays \"Of Mice and Men\" and \"Sweet Bird of Youth,\" but also acted in Off-Broadway stage productions of such plays as \"Elizabeth the Queen,\" \"Joe Egg,\" \"The Trial,\" \"Orpheus Descending,\" and \"Anthony and Cleopatra.\" Gale was married and had a son. David died of complications from open heart surgery on August 18, 1991 in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWViYWNhOTYtNTQxYy00Y2JhLWEzODQtZWJmN2E1N2M2ZDhjXkEyXkFqcGdeQXVyNzQxODc5NDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0301834","name":"David Gale","idIMDB":"nm0301834"},"actorId":"nm0301834","character":"Fulton Balcus","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"'Evil' Ted Smith","urlProfile":"http://www.imdb.com/name/nm0810107","urlPhoto":"","biography":{"bio":"'Evil' Ted Smith is known for his work on The Fifth Element (1997), Drive (1997) and House of 1000 Corpses (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0810107","name":"'Evil' Ted Smith","idIMDB":"nm0810107"},"actorId":"nm0810107","character":"Ronnie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Doug Simpson","urlProfile":"http://www.imdb.com/name/nm0800978","urlPhoto":"","biography":{"bio":"Doug Simpson is known for his work on The Last Boy Scout (1991), The Guyver (1991) and The Undercover Kid (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0800978","name":"Doug Simpson","idIMDB":"nm0800978"},"actorId":"nm0800978","character":"Quinton","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0101988","urlIMDB":"http://www.imdb.com/title/tt0101988","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"17","month":"10","year":"1990","remarks":null},{"money":null,"country":null,"day":"17","month":"12","year":"1990","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 28 min (88 min)","1 hr 32 min (92 min) (director's cut) (USA)"],"soundMix":["Ultra Stereo"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"4.8","filmingLocations":[],"rated":"PG-13","awards":[{"award":"Fantasporto 1993","titlesAwards":[{"titleAwardOutcome":"Nominated International Fantasy Film Award","categories":[{"category":"Best Film","names":[{"name":"Screaming Mad George","id":"nm0313608","role":null},{"name":"Steve Wang","id":"nm0911036","role":null}]}]}]}],"votes":"3,771","type":"Movie","companyCreditsSimple":[],"keywords":{"keywords":["cyborg","monster","creature","superhero","kicked in the crotch","reference to robocop","comic relief","hybrid","alien technology","camera shot of feet","college student","glowing eyes","skull","escape attempt","kiss","scooter","obesity","conspiracy","cover up","urban setting","nosebleed","thug","breaking a bottle over someone's head","improvised weapon","circular saw","elevator","decomposing body","switchblade","threatened with a knife","blade","offscreen killing","tentacle","looking at oneself in a mirror","bare chested male","fight to the death","brutality","interrogation","microscope","abandoned building","actress","film director","film set","crushed to death","cigarette smoking","flashback","skeleton","neck breaking","strangulation","electrocution","subterranean","colonel","bully comeuppance","bully","reference to superman","resurrection","back from the dead","nunchucks","tattoo","scene before opening credits","subjective camera","character's point of view camera shot","spiral staircase","exploding body","explosion","bomb","secret laboratory","laboratory","cloning","deoxyribonucleic acid","genetics","genetic engineering","macguffin","biological weapon","hit with a baseball bat","homeless man","alley fight","alley","man kills a woman","henchwoman","van","1990s","electronic music score","film starts with text","prologue","scientist","doctor","research scientist","crime scene","double cross","betrayal","deception","violence","death","murder","one against many","final showdown","showdown","damsel in distress","human experiment","escape","baseball bat","held at gunpoint","hostage","knocked out","mexican standoff","stylized violence","impalement","knife","stabbed to death","stabbed in the chest","eye gouging","stabbed in the eye","blood","corpse","training","dojo","cia agent","limousine","investigation","father daughter relationship","boyfriend girlfriend relationship","presumed dead","revenge","martial arts master","martial arts training","hand to hand combat","mixed martial arts","pistol","brawl","fight","fistfight","head butt","beaten to death","beating","kicked in the stomach","kicked in the face","punched in the chest","punched in the face","aikido","slow motion scene","revolver","screaming","danger","panic","fear","bravery","courage","asian american","african american","latin american","ethnic stereotype","racial stereotype","super speed","super strength","jumping from height","low budget film","opening action scene","foot chase","chase","los angeles storm drain","one word title","falling from height","campy","warrior","tough guy","one man army","anti hero","action hero","unlikely hero","teenage hero","teenage superhero","teenager","stupid victim","henchman","rapping","repeated line","character repeating someone else's dialogue","slapstick comedy","wisecrack humor","transformation","mutation","evil man","evil laughter","megacorporation","evil corporation","megalomaniac","thrown from height","giant creature","shape shifting","falling down stairs","costumed hero","robot suit","body armor","supernatural power","mind control","alien race","alien","los angeles california","based on tv series","based on anime","based on comic","first part","based on cartoon","power suit","misleading star billing","surrealism","kidnapping","telekinesis","shape shifter","origin of hero","masked hero","man in monster suit","interracial relationship","giant monster","catch phrase","remake of asian film","remake","world domination","weapon","science runs amok","rescue","race against time","martial arts","mad scientist","kung fu","invasion","good versus evil","gangster","experiment gone wrong","toaster oven","loss of father","karate","cia","apartment","b movie","remake of japanese film","based on manga","cult film","based on comic book","mutant","death of father","independent film","title spoken by character","character name in title","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 05:58:21"}}