{"data":{"movies":[{"title":"Batman: Mask of the Phantasm","originalTitle":"","year":"1993","releaseDate":"19931225","directors":[{"name":"Eric Radomski","id":"nm0705779"},{"name":"Bruce Timm","id":"nm0863622"}],"writers":[{"name":"Bob Kane","id":"nm0004170"},{"name":"Alan Burnett","id":"nm0122334"}],"runtime":"76 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BODE0YTBiMjQtNWQyZC00YTNjLWJmYjAtMWUwNzI4NGVlZTAzL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation","Action","Adventure","Crime","Drama","Family","Mystery","Romance","Sci-Fi","Thriller"],"plot":"Batman, the costumed crime-fighter who prowls the night skies in Gotham City, soon finds there's another vigilante in town knocking off prominent mob figures. Despite the scythe-like blade for a hand, a mechanical voice and the cloud of smoke that follows the figure wherever it goes, the police and outraged officials mistake the homicidal crusader for Batman himself and demand that the city's longtime hero be brought to justice. Meanwhile, Andrea Beaumont returns to town. She is the lost love of Bruce Wayne, the billionaire playboy who is Batman's alter ego, and was an integral part of Wayne's decision ten years earlier to don the cape and cowl. Now, she is back in his life and is no less a disruption than the return of his old archenemy, The Joker, who has a stake in seeing the annihilation of this new vigilante, whoever it proves to be.","simplePlot":"Batman is wrongly implicated in a series of murders of mob bosses actually done by a new vigilante assassin.","actors":[{"actorName":"Kevin Conroy","urlProfile":"http://www.imdb.com/name/nm0175834","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MDcwMTU2NF5BMl5BanBnXkFtZTcwMzMyMjg0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1955","placeOfBirth":" Westbury, New York, USA","height":"6' 2\" (1.88 m)","bio":"Kevin Conroy was born on November 30, 1955 in Westbury, New York. At age 17, Kevin earned a full scholarship to attend Juilliard's drama division, where he studied under actor John Houseman. In 1978, after graduating from Juilliard, he toured with \"The Acting Company\", Houseman's acting group, and in 1979, he went on the national tour of \"Deathtrap\". In 1980, he was cast in the daytime soap opera Another World (1964). However, he soon missed the theatre, and so he became associated with the Old Globe Theatre in San Diego, California, where he performed in \"Hamlet\" and \"A Midsummer Night's Dream\". From 1980 to 1985, he acted in a variety of contemporary and classic theatre pieces, including the Broadway production of \"Eastern Standard\" and \"Lolita\". He is very respected in theatre circles for his interpretation of Shakespearean characters, and in 1984, he played the title role in \"Hamlet\" in the New York Shakespeare Festival. Kevin returned to television in the television movie Covenant (1985). He was a series regular on Ohara (1987) in 1987, and on Tour of Duty (1987) from 1987 to 1988, before starring in a series of television movies. He is best known for providing the title role in the animated Batman: The Animated Series (1992) series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MDcwMTU2NF5BMl5BanBnXkFtZTcwMzMyMjg0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0175834","name":"Kevin Conroy","idIMDB":"nm0175834"},"actorId":"nm0175834","character":"Batman / Bruce Wayne","urlCharacter":"http://www.imdb.com/character/ch0000177","main":true},{"actorName":"Dana Delany","urlProfile":"http://www.imdb.com/name/nm0001127","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNjQ2ODk0OF5BMl5BanBnXkFtZTcwNTc3MDI2Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 March 1956","placeOfBirth":" New York City, New York, USA","birthName":"Dana Welles Delany","height":"5' 6\" (1.68 m)","bio":"Dana Welles Delany was born on March 13, 1956, in New York City and raised in Stamford, Connecticut. Dana knew early in life that she wanted to be an actress. Following graduation from Wesleyan University, this tall (5'7\") beauty moved to New York and developed her skills working in daytime television and theater. Dana starred in the Broadway show \"A Life\" and received critical acclaim in a number of off-Broadway productions as well. Her role in Nicholas Kazan's controversial \"Bloodmoon\" in New York led her to Hollywood. Dana acted in a number of TV series, working steadily until she could get her own starring vehicle. That happened in 1988 when Dana became identified with Army nurse Colleen McMurphy in ABC TV's critically acclaimed series China Beach (1988), the role earning her three Emmy nominations and two Emmy Awards as Best Actress. Dana moved on to movies and eventually started getting starring roles in films, such as Exit to Eden (1994). With over a dozen TV and movie projects within the last few years, Dana is one of the busiest actresses in Hollywood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNjQ2ODk0OF5BMl5BanBnXkFtZTcwNTc3MDI2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001127","name":"Dana Delany","idIMDB":"nm0001127"},"actorId":"nm0001127","character":"Andrea Beaumont","urlCharacter":"http://www.imdb.com/character/ch0408884","main":true},{"actorName":"Hart Bochner","urlProfile":"http://www.imdb.com/name/nm0000952","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MTIwNTk2M15BMl5BanBnXkFtZTYwNjQ2NTEz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1956","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Hart Matthew Bochner","height":"6' (1.83 m)","bio":"Hart Matthew Bochner was born in Toronto, Ontario, Canada, to Ruth (Roher), a concert pianist, and Lloyd Bochner, an actor. He is of Russian Jewish and Ukrainian Jewish descent. Hart made his feature film debut portraying George C. Scott's son in Ernest Hemingway's Islands in the Stream (1977) and would go on to gain notice for his role in the Academy award-winning, Breaking Away (1979). However, it was his role in Die Hard (1988), opposite Bruce Willis, that would earn him pop culture status. His performance as the obnoxiously sleazy Harry (\"Hans, Bubby\") Ellis was bestowed the #2 spot on Maxim's \"The Greatest Movie Sleazeballs Of All Time\" list. Other films also include playing opposite Susan Sarandon in Wayne Wang's Anywhere But Here (1999), Break Up (1998) with Bridget Fonda, the cult hit Apartment Zero (1988) opposite Colin Firth, George Cukor's Rich and Famous (1981), with Jacqueline Bisset, and John Schlesinger's L'innocent (1993), opposite Anthony Hopkins. On television, Bochner starred in the Emmy award-winning epic miniseries, War and Remembrance (1988), Ernest Hemingway's The Sun Also Rises (1984), John Steinbeck's East of Eden (1981), And the Sea Will Tell (1991), Children of the Dust (1995), and Haywire (1980). He would inevitably transition to behind-the-scenes work as a director, making his debut with the cult comedy, PCU (1994), for Twentieth Century Fox, and High School High (1996) for Columbia Pictures. Just Add Water (2008) for Sony Pictures is his latest directorial effort, which he also wrote, and stars Danny DeVito, Dylan Walsh, Jonah Hill, and Justin Long. He will next be seen starring in the upcoming Campbell Scott film, Company Retreat (2009), as well as Spread (2009) opposite Ashton Kutcher. Most recently was seen starring as Debra Messing's love interest in the USA Network series, The Starter Wife (2008). Bochner lives in Los Angeles and is actively involved in several causes, sitting on the board of directors for the Environmental Media Association as well as the DGA-PAC Leadership Council, and L.A.'s Green Ribbon Commission. In 2008, Bochner was named Time Magazine's \"Greenest Celebrity in Hollywood\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MTIwNTk2M15BMl5BanBnXkFtZTYwNjQ2NTEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000952","name":"Hart Bochner","idIMDB":"nm0000952"},"actorId":"nm0000952","character":"Arthur Reeves","urlCharacter":"http://www.imdb.com/character/ch0136683","main":true},{"actorName":"Stacy Keach","urlProfile":"http://www.imdb.com/name/nm0005078","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMzEwODQ4Nl5BMl5BanBnXkFtZTYwMTA0NTQz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 June 1941","placeOfBirth":" Savannah, Georgia, USA","birthName":"Walter Stacy Keach Jr.","height":"5' 11½\" (1.82 m)","bio":"Stacy Keach has played to grand success a constellation of the classic and contemporary stage's greatest roles, and he is considered a pre-eminent American interpreter of Shakespeare. His SRO run as \"King Lear\" at the Shakespeare Theatre Company in Washington, D.C. received the best reviews any national leader has earned in that town for decades. Peter Marks of the Washington Post called Mr. Keach's Lear \"magnificent\". He recently accepted his third prestigious Helen Hayes Award for Leading Actor in 2010 for his stellar performance. His next stage appearance premiering January 13, 2011 at the Lincoln Center in New York is \"Other Desert Cities\" by Jon Robin Baitz and teaming him with Stockard Channing, Linda Lavin and Elizabeth Marvel. His latest television series, Lights Out (2011), on the FX network is a major new mid-season dramatic show, taking him back to the world of boxing which has been a rich setting for him before, notably in Huston's Fat City (1972) which ignited Keach's career as a film star. Versatility embodies the essence of Stacy Keach's career in film and television as well as on stage. The range of his roles is remarkable. His recent performance in Oliver Stone's \"W\" prompted fellow actor Alec Baldwin to blog an impromptu review matching Huston's amazement at Keach's power. Perhaps best known around the world for his portrayal of the hard-boiled detective, Mike Hammer, Stacy Keach is also well-known among younger generations for his portrayal of the irascible, hilarious Dad, Ken Titus, in the Fox sitcom, Titus, and more recently as Warden Henry Pope in the hit series, Prison Break. Following his triumphant recent title role performance in King Lear for the prestigious Goodman Theatre in Chicago, Keach joined the starring cast of John Sayles' recent film, Honeydripper. In the most recent of his non-stop activities, he has completed filming Deathmatch for the Spike Channel, and The Boxer for Zeitsprung Productions in Berlin, Germany. German audiences will also see him as one of the co-stars in the multi-million dollar production of Hindenburg: le géant des airs (2011), scheduled to air in January, 2011 with worldwide release thereafter. Mr. Keach co-stars in the new FX series entitled Lights Out (2011) about a boxing family, where he plays the Dad-trainer of two boxing sons played by Holt McCallany and Pablo Schreiber. The series is also scheduled to air in January, 2011. Keach returns to the New York stage at the start of the 2011 in Jon Robin Baitz's new play, \"Other Desert Cities,\" at the Lincoln Center. Capping his heralded accomplishment on the live stage of putting his own stamp on some of the theatre world's most revered and challenging roles over the past year when he headed the national touring company cast of \"Frost/Nixon,\" portraying Richard M. Nixon, bringing still another riveting characterization to the great legit stages of Los Angeles, Chicago, Boston, the nation's capitol and other major cities. He won his second Best Actor Helen Hayes Award for his outstanding performance. His second triumphant portrayal of King Lear in the past three years, this time for the Shakespeare Theatre Company in the nation's capital earned reviews heard around the world, with resulting offers for him to repeat that giant accomplishment in New York, Los Angeles and even Beijing. An accomplished pianist and composer, Mr. Keach composed the music for the film, Imbued (2009), directed by Rob Nilssen, a celebrated film festival favorite, in which Keach also starred. He has also completed composing the music for the Mike Hammer audio radio series, \"Encore For Murder\", written by Max Collins, directed by Carl Amari, and produced by Blackstone Audio. Mr. Keach began his film career in the late 1960's with _The Heart Is A Lonely Hunter_, followed by _The New Centurions_ with George C. Scott; Doc Holiday with Faye Dunaway in the film 'Doc' (1971); an over-the-hill boxer,Billy Tully in Fat City (1972); directed by John Huston, and The Long Riders (1980), which he co-produced and co-wrote with his brother, James Keach, directed by Walter Hill. On the lighter side, his characterization of Sgt. Stedenko in Cheech and Chong's Up in Smoke (1978), and the sequel, Nice Dreams (1981), gave a whole new generation a taste of Mr. Keach's comedic flair, which he also demonstrated in Robert Altman's Brewster McCloud (1970), playing the oldest living lecherous Wright Brother; and The Life and Times of Judge Roy Bean (1972) where he played a crazed albino out to kill Paul Newman. Historical roles have always attracted him. In movies he has played roles ranging from Martin Luther to Frank James. On television he has been Napoleon, Wilbur Wright, J. Robert Oppenheimer, Barabbas, Sam Houston, and Ernest Hemingway, for which he won a Golden Globe as Best Actor in a mini-series and was nominated for an Emmy in the same category. He played an eccentric painter, Mistral, in the Judith Krantz classic, Mistral's Daughter (1984), a northern spy in the civil war special, The Blue and the Gray (1982), more recently as the pirate Benjamin Hornigold in the Hallmark epic Blackbeard (2006). As a director, his production of Arthur Miller's Incident at Vichy (1973) for PBS was, according to Mr. Miller in his autobiography, Timebends, \"the most expressive production of that play he had seen.\" He won a Cine Golden Eagle Award for his work on the dramatic documentary, The Repeater, in which he starred and also wrote and directed. But it is perhaps the live theatre where Mr. Keach shines brightest. He began his professional career with the New York Shakespeare Festival in 1964, doubling as Marcellus and the Player King in a production of Hamlet directed by Joseph Papp and which featured Julie Harris as Ophelia. He rose to prominence in 1967 in the Off-Broadway political satire, MacBird, where the title role was a cross between Lyndon Johnson and Macbeth and for which he received the first of his three Obie awards. He played the title roles in Henry 5, Hamlet (which he played 3 times), Richard 3, Macbeth, and most recently as King Lear in Robert Falls' modern adaptation at Chicago's Goodman Theatre, which Charles Isherwood of the NY Times called \"terrific\" and \"a blistering modern-dress production that brings alive the morally disordered universe of the play with a ferocity unmatched by any other production I've seen.\" Mr. Keach's stage portrayals of Peer Gynt, Falstaff and Cyrano de Bergerac, and Hamlet caused the New York Times to dub him \"the finest American classical actor since John Barrymore.\" Mr. Keach's Broadway credits include his Broadway debut, Indians, where he played Buffalo Bill and was nominated for a Tony award as Best Actor. He starred in Ira Levin's Deathtrap, the Pulitzer Prize winning Kentucky Cycle (for which he won his first Helen Hayes award as Best Actor), the Rupert Holmes one-man thriller, Solitary Confinement, where Mr. Keach played no less than six roles, all unbeknownst to the audience until the end of the play. In the musical theatre, he starred in the national tour of Barnum, played the King in Camelot for Pittsburgh's Civic Light Opera, and the King in The King and I, which he also toured in Japan. He starred in the Jon Robin Baitz play, Ten Unknowns, at the Mark Taper Forum in 2003. The LA Times said: \"And then there's Keach. What a performance! How many actors can manage such thunder and such sweet pain. He's been away from the LA stage too long. Welcome back.\" In 2004, he starred as Scrooge in Boston's Trinity Rep musical production of A Christmas Carol; earlier in 2004, he starred as Phil Ochsner in Arthur Miller's last play Finishing The Picture, directed by Robert Falls at the Goodman Theatre. As a narrator his voice has been heard in countless documentaries; as the host for the Twilight Zone radio series; numerous books on tape, including the Short Stories of Ernest Hemingway. In the year 2000, he recorded a CD of all of Shakespeare's Sonnets. He recently recorded the voice of St. Paul for a new audio version of The New Testament:, The Word of Promise and Job for the Old Testament edition. He is the narrator on CNBC's new hit show, American Greed (2007), and recently narrated the award-winning documentary, The Pixar Story (2007). He has also reprised his role as Mike Hammer in the Blackstone audio series, the most recent being \"Encore for Murder\". A charter-member of LA Theatre Works, Mr. Keach recently played the title role in Bertolt Brecht's Galileo, recorded both for radio and CD. He was seen on CBS's hit show Two and a Half Men (2003) as the gay Dad of Charlie's fiance. Stacy Keach also believes strongly in 'giving back' and has been the Honorary Chair for the Cleft Palate Foundation for the past twenty-five years. He is also the national spokesman for the World Craniofacial organization. He has served on the Artist's Committee for the Kennedy Center Honors for two decades, is on the board of directors for Genesis at the Crossroads, a Chicago-based organization dedicated to bringing peoples of combatant cultures together through the shared artistic expressions of the visual and culinary arts, music, dance, and theater. He also serves on the artistic board for Washington DC's Shakespeare Theatre National Council, where he was also honored in 2000 with their prestigious Millennium Award for his contribution to classical theatre. Some years ago Hollywood honored him with a Celebrity Outreach Award for his work with charitable organizations. He has been the recipient of Lifetime Achievement Awards from Pacific Pioneer's Broadcasters, the San Diego Film Festival, the Pacific Palisades Film Festival, and The 2007 Oldenburg Film Festival in Germany. Later this year, he will be awarded the 2010 Lifetime Award from the St. Louis Film Festival. In 2008, he received the Mary Pickford Award for versatility in acting. Mr. Keach was a Fulbright scholar to the London Academy of Music and Dramatic Art, attended the University of California at Berkeley and the Yale Drama School. He has always been a star of the American stage, especially in Shakespearen roles such as Hamlet, Henry 5, Coriolanus, Falstaff, Macbeth, Richard 3, and most recently, King Lear. Of his many accomplishments, Mr. Keach claims that his greatest accomplishment is his family. He has been married to his beautiful wife Malgosia for twenty-five years, and they have two wonderful children, Shannon Keach (1988), and daughter Karolina Keach (1990).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMzEwODQ4Nl5BMl5BanBnXkFtZTYwMTA0NTQz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005078","name":"Stacy Keach","idIMDB":"nm0005078"},"actorId":"nm0005078","character":"Phantasm / Carl Beaumont","urlCharacter":"http://www.imdb.com/character/ch0408884","main":true},{"actorName":"Abe Vigoda","urlProfile":"http://www.imdb.com/name/nm0001820","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDk5NzMyN15BMl5BanBnXkFtZTYwMjA4Mjg1._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1921","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Abraham Charles Vigodah","height":"6' (1.83 m)","bio":"Tall, dour-faced and slouch-shouldered character actor Abe Vigoda proved himself in both gritty dramatic roles, and as an actor with wonderful comedic timing. Vigoda was born in Brooklyn, New York, to Lena (Moses) and Samuel Vigoda, both Russian Jewish immigrants. His father was a tailor on the Lower East Side. He made his first stage appearance at the age of 17 and plodded away in small theater shows for over 20 years. For the majority of film-goers, Vigoda first came to prominence in The Godfather (1972) as the double-crossing Tessio, pleading with Robert Duvall to get him off the hook \"for old times' sake.\" He also appeared in its sequel. Vigoda had roles in a few nondescript TV films before landing the plum part of Sgt. Phil Fish on the brilliant sitcom Barney Miller (1974). Perhaps his best known role, Sgt. Fish proved popular enough to be spun off to his own (short-lived) series Fish (1977). With his long face and unusual looks, Vigoda remained in high demand in mafioso-type roles, and for a while in the mid-1980s, he was mistakenly believed to have been dead, leading producers to remark, \"I need an Abe Vigoda type actor,\" not realizing Vigoda was still alive and well. The 1990s and beyond became busy again for him, with appearances in North (1994), The Misery Brothers (1995), A Brooklyn State of Mind (1998), and Crime Spree (2003). He continued acting into his 90s, surprising audiences with his entertaining style. Abe Vigoda died in his sleep on January 26, 2016 in Woodland Park, New Jersey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDk5NzMyN15BMl5BanBnXkFtZTYwMjA4Mjg1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001820","name":"Abe Vigoda","idIMDB":"nm0001820"},"actorId":"nm0001820","character":"Salvatore Valestra","urlCharacter":"http://www.imdb.com/character/ch0136684","main":true},{"actorName":"Dick Miller","urlProfile":"http://www.imdb.com/name/nm0588241","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNDM1OTY4NV5BMl5BanBnXkFtZTcwMDQ3NDcyNA@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1928","placeOfBirth":" The Bronx, New York, USA","birthName":"Richard Miller","height":"5' 5\" (1.65 m)","bio":"A native of the Bronx, New York, Richard \"Dick\" Miller served in the U.S. Navy for a few years and earned a prize title as a middleweight boxer. He settled in Los Angeles in the mid-1950s, where he was noticed by producer/director Roger Corman, who cast him in most of his low-budget films, usually playing unlikeable sorts, such as a vacuum-cleaner salesman in Not of This Earth (1957). His most memorable role would have to be that of the mentally unstable, busboy/beatnik artist Walter Paisley, whose clay sculptures are suspiciously lifelike in A Bucket of Blood (1959) (a rare starring role for him), and he is also fondly remembered for his supporting role as the flower-eating Vurson Fouch in Corman's legendary The Little Shop of Horrors (1960). Miller spent the next 20 years working in Corman productions, and starting in the late 1970s was often cast in films by director Joe Dante, appearing in credited and uncredited walk-on bits as quirky chatterboxes, and stole every scene he appeared in. He has played many variations on his famous Walter Paisley role, such as a diner owner (Twilight Zone: The Movie (1983)) or a janitor (Chopping Mall (1986)). One of his best bits is the funny occult-bookshop owner in The Howling (1981). Being short (so he never played a romantic lead or a threatening villain) with wavy hair, long sideburns, a pointed nose and a face as trustworthy as a used-car dealer's, he was, and is to this day, an immediately recognizable character actor whose one-scene appearances in countless movies and TV shows guarantee audience applause.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNDM1OTY4NV5BMl5BanBnXkFtZTcwMDQ3NDcyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0588241","name":"Dick Miller","idIMDB":"nm0588241"},"actorId":"nm0588241","character":"Chuckie Sol","urlCharacter":"http://www.imdb.com/character/ch0010325","main":true},{"actorName":"John P. Ryan","urlProfile":"http://www.imdb.com/name/nm0752636","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDIyNjM4OF5BMl5BanBnXkFtZTcwNjMzOTgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1936","placeOfBirth":" New York City, New York, USA","height":"6' (1.83 m)","bio":"Character actor John P. Ryan was born on July 30, 1936 in New York City. The son of Irish immigrant parents, Ryan graduated from Rice High School and studied English at the City College of New York, where he first developed an interest in acting. He served six years in the US Army and worked as a welfare investigator prior to pursuing an acting career. John made his film debut in the 1967 comedy \"The Tiger Makes Out.\" He appeared in five pictures for Jack Nicholson; he's especially memorable as male nurse Spicer in \"Five Easy Pieces.\" Manic, pale-eyed and craggy-faced, with an often intense and explosive screen presence, Ryan was frequently cast as nasty villains, hard-boiled police officers, and strict military men. John gave a strong and touching performance in a rare change-of-pace sympathetic role as Frank Davis, the bitter and regretful father of a murderous monster mutant baby in Larry Cohen's excellent \"It's Alive.\" He also portrayed Davis in the okay sequel \"It Lives Again.\" Other notable movie parts include the fanatical Colonel Hardcore in \"Shamus,\" shrewd mob capo Patsy O'Neill in the witty \"Cops and Robbers,\" evil scientist Schneider in \"Futureworld,\" the dogged Lt. Parmental in \"Breathless,\" vicious Irish mobster Joe Flynn in \"The Cotten Club;\" at his ferocious best as sadistic prison Warden Ranken in the powerful \"Runaway Train,\" hateful fascist lunatic Glastenbury in the exciting \"Avenging Force,\" ruthless drug kingpin Nathan White in the cruddy \"Death Wish IV: The Crackdown,\" ramrod high school principal Mr. O'Rourke in the amusing \"Three O'Clock High,\" and lethal robot history teacher Mr. Hardin in \"Class of 1999.\" Among the TV shows Ryan did guest spots on are \"M.A.S.H.,\" \"The Rockford Files,\" \"Hawaii Five-O,\" \"Buck Rogers in the 25th Century,\" \"Starsky & Hutch,\" \"Kojak,\" \"Hart to Hart,\" \"The F.B.I.,\" and \"Miami Vice.\" John had a recurring role on the TV series \"Archer.\" In addition to his film and TV credits, Ryan also appeared in over 90 stage plays. Following his final film appearance in \"Bound,\" John spent his later years giving acting lessons and was an advocate of spiritual healing. John P. Ryan died from a stroke at age 70 on March 20, 2007 in Los Angeles, California; he's survived by two daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDIyNjM4OF5BMl5BanBnXkFtZTcwNjMzOTgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0752636","name":"John P. Ryan","idIMDB":"nm0752636"},"actorId":"nm0752636","character":"Buzz Bronski","urlCharacter":"http://www.imdb.com/character/ch0136685","main":true},{"actorName":"Efrem Zimbalist Jr.","urlProfile":"http://www.imdb.com/name/nm0956544","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1NDk5NjY4MTheQTJeQWpwZ15BbWU2MDI4Mzg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1918","placeOfBirth":" New York City, New York, USA","height":"6' (1.83 m)","bio":"It's hardly surprising that the son of renowned Russian-born concert violinist Efrem Zimbalist Sr. (1889-1985) and Romanian-born opera singer Alma Gluck (1884-1938) would desire a performing career of some kind. Born in New York City on November 30, 1918, surrounded by people of wealth and privilege throughout his childhood, Efrem Zimbalist Jr. received a boarding school education. Acting in school plays, he later trained briefly at the Yale School of Drama but didn't apply himself enough and quit. As an NBC network radio page, he auditioned when he could and found minor TV and stock theatre parts while joining up with the Neighborhood Playhouse. Following WWII war service with the Army infantry in which he was awarded the Purple Heart after being wounded, a director and friend of the family, Garson Kanin, gave the aspiring actor his first professional role in his Broadway production of \"The Rugged Path\" (1945) which starred Spencer Tracy. With his dark, friendly, clean-scrubbed good looks and a deep, rich voice that could cut butter, Zimbalist found little trouble finding work. He continued with the American Repertory Theatre performing in such classics as \"Henry VIII\" and \"Androcles and the Lion\" while appearing opposite the legendary Eva Le Gallienne in \"Hedda Gabler\". Zimbalist then tried his hand as a stage producer, successfully bringing opera to Broadway audiences for the first time with memorable presentations of \"The Medium\" and \"The Telephone\". As producer of Gian Carlo Menotti's \"The Consul\", he won the New York Drama Critic's Award and the Pulitzer Prize for best musical in 1950. An auspicious film debut opposite Edward G. Robinson in House of Strangers (1949) brought little career momentum due to the untimely death of his wife Emily (a onetime actress who appeared with him in \"Hedda Gabler\" and bore him two children, Nancy and Efrem III) to cancer in 1950. Making an abrupt decision to abandon acting, he served as assistant director/researcher at the Curtis School of Music for his father and buried himself with studies and music composition. In 1954, Efrem returned to acting and copped a daytime television soap lead (Concerning Miss Marlowe (1954)). It was famed director Joshua Logan who proved instrumental in helping Zimbalist secure a Warner Bros. contract. Despite forthright second leads in decent films such as Band of Angels (1957) with Clark Gable and Yvonne De Carlo; Too Much, Too Soon (1958) starring Dorothy Malone and Errol Flynn; Home Before Dark (1958) with Jean Simmons and Rhonda Fleming; The Crowded Sky (1960) with Dana Andrews, Rhonda Fleming, Troy Donahue and Anne Francis; A Fever in the Blood (1961) opposite Angie Dickinson and (his best) Wait Until Dark (1967) with Audrey Hepburn, it was television that made the better use of his refined, unshowy acting style. His roles as smooth private investigator Stu Bailey on 77 Sunset Strip (1958) and dogged inspector Lewis Erskine on The F.B.I. (1965) would be his ultimate claims to fame. A perfect gentleman on and off camera, Zimbalist's severest critics tend to deem his performances bland and undernourished. Managing to override such criticisms, he maintained a sturdy career for nearly six decades. In 1991, he made fun of his all-serious reputation and pulled off a Leslie Nielsen-like role in the comedy parody Hot Shots! (1991). In addition to theater projects over the years, he has made fine use of his mellifluous baritone performing narrations and cartoon voiceovers, including that of Alfred the butler on a \"Batman\" animated series. In 2003, he completed his memoirs, entitled \"My Dinner of Herbs\". The father of three, grandfather of four and great-grandfather of three, he settled in Santa Barbara and later in Solvang, California with longtime second wife Stephanie until her death in 2007 of cancer. Their daughter, also named Stephanie (Stephanie Zimbalist), is the well-known actress who appeared with Pierce Brosnan in the Remington Steele (1982) television series, in which Zimbalist had a recurring role. He and his daughter also appeared on stage together in his later years, their first being \"The Night of the Iguana\". His eldest daughter Nancy died in 2012. Zimbalist died peacefully at his Solvang home of natural causes at the age of 95 on May 2, 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1NDk5NjY4MTheQTJeQWpwZ15BbWU2MDI4Mzg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0956544","name":"Efrem Zimbalist Jr.","idIMDB":"nm0956544"},"actorId":"nm0956544","character":"Alfred Pennyworth","urlCharacter":"http://www.imdb.com/character/ch0000204","main":true},{"actorName":"Robert Hastings","urlProfile":"http://www.imdb.com/name/nm0368561","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NjQ1NzIyNV5BMl5BanBnXkFtZTcwNDc3NTcxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1925","placeOfBirth":" Brooklyn, New York, USA","birthName":"Robert Francis Hastings","height":"5' 8½\" (1.74 m)","bio":"Bob Hastings got his show business start in radio after WWII as the voice of \"Archie Andrews\" in the show of the same name (a spin-off of the Archie Comics series) on the Mutual Broadcasting System. The good-looking Hastings made the transition to television smoothly in 1949 in early galactic-action series like Captain Video and His Video Rangers (1949) and Atom Squad (1953). His first recurring role was as a lieutenant on The Phil Silvers Show (1955) (aka \"Sgt. Bilko\"). Most of his career has been spent in television, and he's notable for roles such as Captain Binghamton's yes-man \"Lieutenant Elroy Carpenter\" on McHale's Navy (1962), one of the two Tommy Kelsey's on All in the Family (1971), and \"Captain Ramsey\" on General Hospital (1963). Hastings has also done much voice work, including that of \"The Raven\" on The Munsters (1964), \"Superboy\" on the The Superman/Aquaman Hour of Adventure (1967) cartoons in the 1960s and, in recent years, the voice of \"Commissioner Gordon\" on the animated Batman: The Animated Series (1992) cartoons.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NjQ1NzIyNV5BMl5BanBnXkFtZTcwNDc3NTcxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0368561","name":"Robert Hastings","idIMDB":"nm0368561"},"actorId":"nm0368561","character":"Commissioner James Gordon","urlCharacter":"http://www.imdb.com/character/ch0000248","main":true},{"actorName":"Robert Costanzo","urlProfile":"http://www.imdb.com/name/nm0182456","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNjE1NzUzMF5BMl5BanBnXkFtZTcwNDU0OTU0MQ@@._V1_UY44_CR25,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1942","placeOfBirth":" New York City, New York, USA","birthName":"Robert Jason Costanzo","bio":"Robert Costanzo was born on October 20, 1942 in New York City, New York, USA as Robert Jason Costanzo. He is an actor and producer, known for Total Recall (1990), Saturday Night Fever (1977) and Batman: Mask of the Phantasm (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNjE1NzUzMF5BMl5BanBnXkFtZTcwNDU0OTU0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0182456","name":"Robert Costanzo","idIMDB":"nm0182456"},"actorId":"nm0182456","character":"Detective Harvey Bullock","urlCharacter":"http://www.imdb.com/character/ch0000265","main":true},{"actorName":"Mark Hamill","urlProfile":"http://www.imdb.com/name/nm0000434","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3Njc5ODc4OV5BMl5BanBnXkFtZTYwNjY5MTU0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1951","placeOfBirth":" Oakland, California, USA","birthName":"Mark Richard Hamill","height":"5' 9\" (1.75 m)","bio":"Mark Hamill is best known for his portrayal of Luke Skywalker in the original Star Wars trilogy - Star Wars: Episode IV - A New Hope (1977), Star Wars: Episode V - The Empire Strikes Back (1980), and Star Wars: Episode VI - Return of the Jedi (1983) - a role he reprise in Star Wars: The Force Awakens (2015). Hamill also starred and co-starred in the films Corvette Summer (1978), The Big Red One (1980), and Kingsman: The Secret Service (2014). Hamill's extensive voice acting work includes a long-standing role as the Joker, commencing with Batman: The Animated Series (1992). Mark Richard Hamill was born in Oakland, California, to Virginia Suzanne (Johnson) and William Thomas Hamill, a captain in the United States Navy. He majored in drama at Los Angeles City College and made his acting debut on The Bill Cosby Show (1969). He played a recurring role (Kent Murray) on the soap opera General Hospital (1963) and co-starred on the comedy series The Texas Wheelers (1974). Robert Englund auditioned for a role in Apocalypse Now (1979) when he walked across the hall where auditions were taking place for George Lucas's Star Wars saga. After watching the auditions for a while, he realized that Hamill, his friend, would be perfect for the role of Luke Skywalker. He suggested to Hamill that he audition for the role; Hamill did, and won the role. Released on May 25, 1977, Star Wars: Episode IV - A New Hope (1977) was an enormous unexpected success and made a huge impact on the film industry. Hamill also appeared in The Star Wars Holiday Special (1978) and later starred in the successful sequels Star Wars: Episode V - The Empire Strikes Back (1980), and Star Wars: Episode VI - Return of the Jedi (1983). For both of the sequels, Hamill was honored with the Saturn Award for Best Actor given by the Academy of Science Fiction, Fantasy and Horror Films. He reprise the role of Luke Skywalker for the radio dramatizations of both \"Star Wars\" (1981) and \"The Empire Strikes Back\" (1983). For the radio dramatization of \"Return of the Jedi\" (1996), the role was played by a different actor. With the acquisition of Lucasfilm by the Walt Disney Company, this was announced that there will be more Star Wars films starting with Star Wars: The Force Awakens (2015), which was released on December 18, 2015. Hamill appeared in Star Wars: The Force Awakens (2015) and will continue to star in the current trilogy, alongside fellow Star Wars actors Harrison Ford and Carrie Fisher, reprising their roles as Luke Skywalker, Han Solo and Princess Leia Organa, respectively.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3Njc5ODc4OV5BMl5BanBnXkFtZTYwNjY5MTU0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000434","name":"Mark Hamill","idIMDB":"nm0000434"},"actorId":"nm0000434","character":"The Joker","urlCharacter":"http://www.imdb.com/character/ch0000180","main":true},{"actorName":"Arleen Sorkin","urlProfile":"http://www.imdb.com/name/nm0815071","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODgwMzQ0NF5BMl5BanBnXkFtZTYwMTM4NzIz._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 October 1955","placeOfBirth":" Washington, District of Columbia, USA","height":"5' 6\" (1.68 m)","bio":"Arleen Sorkin was born on October 14, 1955 in Washington, District of Columbia, USA. She is an actress and writer, known for Batman: Arkham Asylum (2009), Batman Beyond: Return of the Joker (2000) and Batman: Mask of the Phantasm (1993). She has been married to Christopher Lloyd since 1995. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODgwMzQ0NF5BMl5BanBnXkFtZTYwMTM4NzIz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0815071","name":"Arleen Sorkin","idIMDB":"nm0815071"},"actorId":"nm0815071","character":"Ms. Bambi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jane Downs","urlProfile":"http://www.imdb.com/name/nm0236185","urlPhoto":"","biography":{"dateOfBirth":"22 January 1935","placeOfBirth":" Bromley, Kent, England, UK","birthName":"Jane M. Downs","bio":"Jane Downs was born on January 22, 1935 in Bromley, Kent, England as Jane M. Downs. She was an actress, known for Batman: Mask of the Phantasm (1993), A Night to Remember (1958) and Emergency-Ward 10 (1957). She was married to Terence Alexander and Gerald Harper. She died on May 20, 2015 in London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0236185","name":"Jane Downs","idIMDB":"nm0236185"},"actorId":"nm0236185","character":"Additional Voices","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pat Musick","urlProfile":"http://www.imdb.com/name/nm0615730","urlPhoto":"","biography":{"dateOfBirth":"1 November 1956","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Patrice Anne Musick","bio":"Pat Musick was born on November 1, 1956 in St. Louis, Missouri, USA as Patrice Anne Musick. She is an actress, known for Mr. Peabody & Sherman (2014), An American Tail (1986) and Duckman: Private Dick/Family Man (1994). She was previously married to Jeffrey Whitman and Daniel Dexter Fee.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0615730","name":"Pat Musick","idIMDB":"nm0615730"},"actorId":"nm0615730","character":"Additional Voices","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vernee Watson","urlProfile":"http://www.imdb.com/name/nm0914937","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0Mjg0MDIzMV5BMl5BanBnXkFtZTcwNDM4MzAyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 January 1954","placeOfBirth":" North Trenton, New Jersey, USA","birthName":"Vernee Christell Watson","bio":"Vernee Watson was born on January 14, 1954 in North Trenton, New Jersey, USA as Vernee Christell Watson. She is an actress and director, known for Antwone Fisher (2002), Carter Country (1977) and Batman: Mask of the Phantasm (1993). She was previously married to Joe Duckett.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0Mjg0MDIzMV5BMl5BanBnXkFtZTcwNDM4MzAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0914937","name":"Vernee Watson","idIMDB":"nm0914937"},"actorId":"nm0914937","character":"Additional Voices","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0106364","urlIMDB":"http://www.imdb.com/title/tt0106364","business":{"budget":{"money":"$6,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$1,189,975","country":"USA","day":"26","month":"12","year":"1993","remarks":""}],"gross":[{"money":"$5,588,699","country":"USA","day":"06","month":"02","year":"1994","remarks":""},{"money":"$5,440,836","country":"USA","day":"30","month":"01","year":"1994","remarks":""},{"money":"$5,291,422","country":"USA","day":"23","month":"01","year":"1994","remarks":""},{"money":"$5,222,869","country":"USA","day":"17","month":"01","year":"1994","remarks":""},{"money":"$5,030,829","country":"USA","day":"09","month":"01","year":"1994","remarks":""},{"money":"$4,391,000","country":"USA","day":"02","month":"01","year":"1994","remarks":""},{"money":"$1,189,975","country":"USA","day":"26","month":"12","year":"1993","remarks":""}],"weekendGross":[{"money":"$104,725","country":"USA","day":"06","month":"02","year":"1994","remarks":"273 Screens"},{"money":"$140,844","country":"USA","day":"30","month":"01","year":"1994","remarks":"468 Screens"},{"money":"$50,043","country":"USA","day":"23","month":"01","year":"1994","remarks":"155 Screens"},{"money":"$123,135","country":"USA","day":"17","month":"01","year":"1994","remarks":"247 Screens"},{"money":"$336,144","country":"USA","day":"09","month":"01","year":"1994","remarks":"822 Screens"},{"money":"$1,406,291","country":"USA","day":"02","month":"01","year":"1994","remarks":""},{"money":"$1,189,975","country":"USA","day":"26","month":"12","year":"1993","remarks":""}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 16 min (76 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.33 : 1 (negative ratio)","1.85 : 1 (intended ratio)"],"camera":null,"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.9","filmingLocations":[{"location":"Warner Brothers Burbank Studios - 4000 Warner Boulevard, Burbank, California, USA"}],"rated":"PG","awards":[{"award":"Annie Awards 1994","titlesAwards":[{"titleAwardOutcome":"Nominated Annie","categories":[{"category":"Best Animated Film","names":[{"name":"Warner Bros. Animation","id":null,"role":null}]}]}]}],"votes":"31,752","type":"Movie","companyCreditsSimple":[{"idCompany":"co0072876","name":"Warner Bros. Animation"},{"idCompany":"co0064773","name":"Warner Bros. Family Entertainment"}],"keywords":{"keywords":["dc comics","police","joker","gotham","vigilante","archenemy","assassin","billionaire","on the run","old flame","night","cape","hero","playboy","crime fighter","murder","warner bros","dc animated universe","futuristic aircraft","batwing","flying man","rocket pack","masked superhero","caped superhero","batcave","hammer","gliding","metal hand","bare chested male","police detective","detective","orchestral music score","based on cartoon","crime spree","fight the system","batman joker","skyscraper","cruise ship","ocean liner","el train","monorail","grappling hook","laughing","oxygen tank","maniac","professional hit","mob hit","kicked in the crotch","man hits a woman","man punches a woman","man fights a woman","personal vendetta","loss of loved one","world's fair","theme park","abandoned amusement park","torture","debt","hospital","near death experience","destruction","fire","pyromaniac","jet pack","fighting in the air","apartment","regret","exploding house","escape attempt","attempted murder","interrogation","hired killer","survival","lawyer","embezzlement","hostage","paranoia","rescue","offscreen killing","camera","home invasion","letter","underwater scene","sewer","enforcer","fairground","socialite","engagement ring","hatred","eavesdropping","criminal","fear","righteous rage","disguise","bridge","umbrella","flat tire","mysterious killer","sword","necklace","secret identity","alter ego","shuriken","unrequited love","forensic evidence","super computer","englishman abroad","heir","gas grenade","serial killer","police officer","body landing on a car","1990s","corruption","bat signal","hitman","assassination attempt","conspiracy","cover up","double cross","cigarette smoking","cigar smoking","betrayal","doctor","nurse","hypodermic needle","injection","mental hospital","restaurant","binoculars","mafia","organized crime","mafia boss","mob boss","crime boss","model city","mobster","car crash","car accident","bat","bound and gagged","security guard","escape","counterfeit","money laundering","suitcase full of money","parking garage","disappear","race against time","falling from height","rooftop","jumping from a rooftop","jumping from height","newspaper headline","councilor","corrupt official","corrupt businessman","held at gunpoint","deception","ship","outrunning explosion","revolver","ex boyfriend ex girlfriend relationship","evil laughter","corpse","construction site","booby trap","dynamite","bomb","explosion","exploding airplane","exploding building","mercilessness","brutality","spit take","death","airplane","police chase","foot chase","spit in the face","urban setting","urban decay","social decay","purse snatcher","hit with a baseball bat","baseball bat","tooth knocked out","character repeating someone else's dialogue","character's point of view camera shot","subjective camera","extreme close up","stylized violence","police station","overturning car","mixed martial arts","electrocution","motorcycle","car truck chase","attempted robbery","beating","kicked in the stomach","kicked in the face","bodyguard","punched in the chest","punched in the face","head butt","jumping through a window","henchman","marriage proposal","wedding ring","thug","nonlinear timeline","origin of hero","bat plane","vigilantism","vigilante justice","masked vigilante","cityscape","darkness","loner","lightning","rainstorm","heavy rain","poison","fair","toxin","aerial shot","limousine driver","limousine","father daughter relationship","party","gadget car","gadgetry","fireplace","photograph","costumed hero","masked hero","masked man","investigation","scythe","revelation","tragic past","dark past","tragic hero","statue","kiss","cemetery","killing spree","anti hero","manor house","anti villain","villainess","female villain","mysterious villain","rampage","batmobile","femme fatale","star crossed lovers","purple strapless dress","gothic horror","wrongfully accused","driven to madness","sadist","dark future","one man crusade","retro","making love","keysi fighting method","warrior","smoke grenade","wounded man","helicopter","violence","jujitsu","fistfight","brawl","opening action scene","pistol","claw","ambush","throwing star","ski mask","hand to hand combat","rooftop fight","blood","chase","rooftop chase","pump action shotgun","shotgun","showdown","tough girl","disarming someone","robot","knife","tommy gun","machine gun","martial arts","fighting","fight","one against many","one man army","tough guy","action hero","strapless dress","sexy woman","evil man","foot popping kiss","masked villain","surrealism","killer clown","clown","clown makeup","clown face","flashback","false accusation","art deco","neo noir","black humor","cult film","crushed to death","black comedy","swat team","haunted by the past","double life","tragic villain","obsession","dark hero","miscarriage of justice","goth","anger","gothic","tragedy","based on comic book","super villain","psychotic","police commissioner","millionaire","mansion","insanity","good versus evil","gadget","fictional city","makeup","psychopath","mass murder","loss of father","evil clown","amusement park","superhero","based on comic","butler","mask","gangster","revenge","based on tv series","death of father","character name in title","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 05:53:46"}}