{"data":{"movies":[{"title":"Happy Gilmore","originalTitle":"","year":"1996","releaseDate":"19960216","directors":[{"name":"Dennis Dugan","id":"nm0240797"}],"writers":[{"name":"Tim Herlihy","id":"nm0379056"},{"name":"Adam Sandler","id":"nm0001191"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NjUxODg3Ml5BMl5BanBnXkFtZTcwNzcyODc5Mw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Family","Sport"],"plot":"A Hockey player wannabe finds out that he has the most powerful golf drive in history. He joins the P.G.A. tour to make some money to save grandma's house. The downside is that his hocky player mentality doesn't really go on the P.G.A. tour. Especially with the favorite to win the championship.","simplePlot":"A rejected hockey player puts his skills to the golf course to save his grandmother's house.","actors":[{"actorName":"Adam Sandler","urlProfile":"http://www.imdb.com/name/nm0001191","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyNzM2MjM1Ml5BMl5BanBnXkFtZTcwMDE5NjI3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1966","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Adam Richard Sandler","height":"5' 9½\" (1.77 m)","bio":"Adam Richard Sandler was born September 9, 1966 in Brooklyn, New York, to Judith (Levine), a teacher at a nursery school, and Stanley Alan Sandler, an electrical engineer. He is of Russian Jewish descent. At 17, he took his first step towards becoming a stand-up comedian when he spontaneously took the stage at a Boston comedy club. He found he was a natural comic. He nurtured his talent while at New York University (graduating with a Bachelor of Fine Arts degree in 1991) by performing regularly in clubs and at universities. During his freshman year, he snagged a recurring role as the Huxtable family's friend Smitty on The Cosby Show (1984). While working at a comedy club in L.A., he was \"discovered\" by Dennis Miller, who recommended him to Saturday Night Live (1975) producer Lorne Michaels and told him that Sandler had a big talent. This led to his being cast in the show in 1990, which he also wrote for in addition to performing. After Saturday Night Live (1975), Sandler went on to the movies, starring in such hit comedies as Airheads (1994), Happy Gilmore (1996), Billy Madison (1995) and Big Daddy (1999). He has also starred in Mr. Deeds (2002) alongside Winona Ryder; Eight Crazy Nights (2002), an animated movie about the Jewish festival of Chanukah; and Punch-Drunk Love (2002). He also writes and produces many of his own films and has composed songs for several of them, including The Wedding Singer (1998). Sandler has had several of his songs placed on the \"Billboard\" charts, including the classic \"The Chanukah Song\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyNzM2MjM1Ml5BMl5BanBnXkFtZTcwMDE5NjI3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001191","name":"Adam Sandler","nicknames":["Sandman"],"idIMDB":"nm0001191"},"actorId":"nm0001191","character":"Happy Gilmore","urlCharacter":"http://www.imdb.com/character/ch0009080","main":true},{"actorName":"Christopher McDonald","urlProfile":"http://www.imdb.com/name/nm0001520","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkyNDMxODc3M15BMl5BanBnXkFtZTgwNzQ3OTM2NDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 February 1955","placeOfBirth":" New York City, New York, USA","height":"6' 3\" (1.91 m)","bio":"Christopher McDonald was born and raised in New York City, New York, to Patricia, a real estate agent, and James R. McDonald, an educator. His breakout role was in Ridley Scott's Thelma and Louise (1991), followed shortly by playing Jack Barry in Robert Redford's Quiz show (1994). Other notable performances include Into Thin Air (1997) as John Krakauher and Tappy Timmons in Requiem for a Dream (2000) opposite Ellen Burstyn. Chris has co-starred in hit comedies Happy Gilmore, American Pie, Flubber and Leave it to Beaver. Harry's Law, Boardwalk Empire and Family Law highlight his television credits. Trained by legendary acting teacher Stella Adler and also at the Royal Academy of Dramatic Art, Chris has been singled out by the New York Times as one of the most prolific actor's in Hollywood. He has performed in over 100 films spanning thirty five years. His 40 stage credits include Billy Flynn in the Broadway production of Chicago and the 2013 hit, Lucky Guy opposite Tom Hanks. Since the loss of two siblings and a parent to cancer, Chris has been an active supporter of the Make a Wish foundation along with charities which help cancer research. He participates in celebrity fund raising events throughout the world. A graduate of Hobart and William Smith college in 1977, he is a principle donor for the building of their new performing arts center.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkyNDMxODc3M15BMl5BanBnXkFtZTgwNzQ3OTM2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001520","name":"Christopher McDonald","idIMDB":"nm0001520"},"actorId":"nm0001520","character":"Shooter McGavin","urlCharacter":"http://www.imdb.com/character/ch0009085","main":true},{"actorName":"Julie Bowen","urlProfile":"http://www.imdb.com/name/nm0100866","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMjI3ODI5M15BMl5BanBnXkFtZTcwNjIyNTA0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 March 1970","placeOfBirth":" Baltimore, Maryland, USA","birthName":"Julie Bowen Luetkemeyer","height":"5' 6\" (1.68 m)","bio":"Julie Bowen was born in Baltimore, Maryland, and is the middle daughter of Suzanne and John Luetkemeyer Jr., a real estate developer. Her early education was at Calvert School in Baltimore, and Garrison Forest School, Maryland. She moved on to St. George's School, Rhode Island and then attended Brown University, graduating with a BA in Renaissance Studies. During college Bowen acted in stage productions such as \"Guys and Dolls\" and \"Stage Door\". After graduation she relocated to New York and studied at the legendary Actors Studio. Success followed with a series of TV roles, and in 1996 she appeared as the love interest in Happy Gilmore (1996). Other supporting film roles followed. However, it was on television that she was destined to make the biggest impact, with strong turns in ER (1994), Ed (2000) and Boston Legal (2004), among others. From 2009 she has starred as Claire Dunphy in the hit series Modern Family (2009), for which she has won Emmy and Screen Actors Guild awards. Julie is married to Scott Phillips, a real-estate investor, and they have three sons: Oliver, and twins Gus and John.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMjI3ODI5M15BMl5BanBnXkFtZTcwNjIyNTA0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0100866","name":"Julie Bowen","idIMDB":"nm0100866"},"actorId":"nm0100866","character":"Virginia Venit","urlCharacter":"http://www.imdb.com/character/ch0009082","main":true},{"actorName":"Frances Bay","urlProfile":"http://www.imdb.com/name/nm0062844","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwODUxNzQ2NF5BMl5BanBnXkFtZTcwNzg2MjA3Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 January 1919","placeOfBirth":" Mannville, Alberta, Canada","birthName":"Frances Goffman","height":"5' (1.52 m)","bio":"Cute, tiny, and prolific little old lady character actress Frances Bay worked constantly in both films and TV shows alike after making her debut at the age of 59 in life with a small part in the comedy Foul Play (1978) in 1978. She frequently portrayed eccentric elderly women and good-hearted grandmothers in all kinds of pictures and television programs. Frances acted several times for David Lynch: she's Kyle MacLachlan's sweet doddery aunt in Blue Velvet (1986), a gruff, profane whorehouse madam in Wild at Heart (1990), and the spooky Mrs. Tremond in the cult TV series Twin Peaks (1990) and its spin-off feature Twin Peaks: Fire Walk with Me (1992). Frances popped up in two movies for director Stuart Gordon: she's a kindly witch in The Pit and the Pendulum (1991) and a fortune teller in Edmond (2005). Other notable film roles include a snippy librarian in The Attic (1980), a mysterious blind nun in the offbeat Nomads (1986), another librarian in In the Mouth of Madness (1994), and Adam Sandler's loving grandmother in the hit comedy Happy Gilmore (1996). Frances had the unique distinction of guesting on the final episodes of the TV shows Happy Days (1974), Who's the Boss? (1984), and Seinfeld (1989). Among the many TV series Bay had guest spots on are Charmed (1998), ER (1994), Matlock (1986), The X-Files (1993), Murder, She Wrote (1984), L'as de la crime (1991), L.A. Law (1986), Hill Street Blues (1981), Touched by an Angel (1994), The Golden Girls (1985), and Amazing Stories (1985). She won a Gemini Award for her performance in the Disney TV program Avonlea (1990). Frances was also in the music video for Jimmy Fallon's \"Idiot Boyfriend.\" In addition to her substantial movie and TV credits, Bay also acted in both Off-Broadway stage productions and regional theater; these plays include \"Finnegan's Wake,\" \"Grease,\" \"Genuis,\" \"The Caucasion Chalk Circle,\" \"Number Our Days,\" \"Uncommon Women,\" \"Sarcophagus,\" and \"The Pleasure of His Company.\" Frances won two DramaLogue Awards and was nominated for a Los Angeles Dramatic Critics' Award. In 2002 Bay was the unfortunate victim of an automobile accident which resulted in having part of her right leg amputated. Her husband Charles sadly died in 2002 as well. In real life Frances Bay was a very practical and unassuming woman with an avid love for jazz music.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwODUxNzQ2NF5BMl5BanBnXkFtZTcwNzg2MjA3Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0062844","name":"Frances Bay","idIMDB":"nm0062844"},"actorId":"nm0062844","character":"Grandma","urlCharacter":"http://www.imdb.com/character/ch0117552","main":true},{"actorName":"Allen Covert","urlProfile":"http://www.imdb.com/name/nm0184445","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MjI1ODE1Ml5BMl5BanBnXkFtZTYwODg1Mjkz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1964","placeOfBirth":" Palm Beach County, Florida, USA","birthName":"Allen Stephen Covert","height":"5' 9\" (1.75 m)","bio":"Allen Covert was born on October 13, 1964 in Palm Beach County, Florida, USA as Allen Stephen Covert. He is an actor and producer, known for Grandma's Boy (2006), Big Daddy (1999) and Anger Management (2003). He is married to Kathryn Covert. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MjI1ODE1Ml5BMl5BanBnXkFtZTYwODg1Mjkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0184445","name":"Allen Covert","idIMDB":"nm0184445"},"actorId":"nm0184445","character":"Otto","urlCharacter":"http://www.imdb.com/character/ch0009083","main":true},{"actorName":"Robert Smigel","urlProfile":"http://www.imdb.com/name/nm0806912","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNTMwNDQyOF5BMl5BanBnXkFtZTcwMjUwNTQ3MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 February 1960","placeOfBirth":" New York City, New York, USA","birthName":"Robert M. Smigel","height":"6' (1.83 m)","bio":"Robert Smigel was born on February 7, 1960 in New York City, New York, USA as Robert M. Smigel. He is a writer and producer, known for Saturday Night Live (1975), Late Night with Conan O'Brien (1993) and Hotel Transylvania (2012). He is married to Michelle Saks Smigel. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNTMwNDQyOF5BMl5BanBnXkFtZTcwMjUwNTQ3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0806912","name":"Robert Smigel","idIMDB":"nm0806912"},"actorId":"nm0806912","character":"IRS Agent","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bob Barker","urlProfile":"http://www.imdb.com/name/nm0054837","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MzQ1MDMzNV5BMl5BanBnXkFtZTYwMjczMjU0._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1923","placeOfBirth":" Darrington, Washington, USA","birthName":"Robert William Barker","height":"6' 1\" (1.85 m)","bio":"For 35 years Bob Barker had been the host of The Price Is Right (1972) game show. Not only is it the highest-rated daytime game show, it's also the longest-running game show in TV history, surpassing the prime-time hit What's My Line? (1950), which ran for 18 years. He also served the show's executive producer since 1987. Named the most popular game show host of all time in a national poll, he received the Lifetime Achievement Award for Daytime Television in 1999. Although he has graced our television screen for more than four decades, his career continues at full circle. In 1996 he made his motion picture debut in Universal Pictures' Happy Gilmore (1996), in which he played himself with Adam Sandler. His real acting debut, however, came when he was asked to play Mel Harris' father in NBC's Something So Right (1996). Another honor came when one of the most historic sites in the history of television, Stage 33 at CBS Television City in Los Angeles, was re-dedicated as the Bob Barker Studio in ceremonies following the taping of the 5,000th episode of \"The Price is Right\", on March 11, 1998. Barker is the first performer to whom CBS has ever dedicated a stage. Barker was born in Darrington, WA, and spent most of his youth on the Rosebud Indian Reservation in South Dakota, where his mother was a schoolteacher. His family eventually moved to Springfield, Missouri, where he attended high school and Drury College on a basketball scholarship. World War II interrupted his studies and he joined the US Navy, becoming a fighter pilot, but the war ended before he was assigned to a seagoing squadron. Following his discharge Barker returned to Drury and took a job at a local radio station to help finance his studies. It was there he discovered that what he did best was to host audience participation shows. After graduating summa cum laude with a degree in economics, he went to work for a radio station in Palm Beach, Florida. A year later he moved to Los Angeles, and within a week he was the host of his own radio program, \"The Bob Barker Show\". He made his debut in 1956 on national television as the host of the popular The New Truth and Consequences (1950). Ralph Edwards, the show's originator, had sold the show to NBC as a daytime strip, but he had not chosen a host. He auditioned other hosts in Hollywood and New York for weeks, but when he heard \"The Bob Barker Show\" on his car radio, he knew he had found the man for the job. Proving that Edwards had chosen him wisely, Barker hosted \"Truth or Consequences\" for an unbelievable 18 years, and he and Edwards remain close friends to this day. They drink a toast at lunch every December 21st to celebrate the day in 1956 when Edwards notified him that he was going to become the host of \"Truth or Consequences\". Barker has been twice named in the Guinness Book of World Records as television's \"Most Durable Performer,\" at 3,524 shows, and \"Most Generous Host in Television history\" for awarding $55 million in prizes on his various shows. During the ensuing years the $55-million figure has increased to more than $200 million. He has won 11 Emmys as a Game Show Host, more than any other performer, and 2 more as Executive Producer of \"The Price is Right\". He also was given the Lifetime Achievement Award in 1999, for a total of 14, and won 2 additional awards, for a total of 16 Emmys. He has also received the coveted Carbon Mike Award of the Pioneer of Broadcasters. In 1978 he developed \"The Bob Barker Fun & Games Show\", a series of personal appearances that attracted record-breaking audiences throughout the US and Canada. He also established the DJ&T Foundation in Beverly Hills, California, the purpose of which is to help control the dog and cat population. He is funding the foundation through his own resources to support low-cost or free spay/neuter clinics. This foundation is named in memory of his wife, Dorothy Jo, and his mother, Matilda (Tilly) Valandra, both of whom loved animals. Barker's work on behalf of animals has garnered him a long list of awards from prestigious humane organizations across the country. In fact, a columnist wrote that Bob has become a part-time television host and a full-time animal rights activist. However, he assures his audiences that there is room in his busy life for both television and animals.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MzQ1MDMzNV5BMl5BanBnXkFtZTYwMjczMjU0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0054837","name":"Bob Barker","idIMDB":"nm0054837"},"actorId":"nm0054837","character":"Bob Barker","urlCharacter":"http://www.imdb.com/character/ch0336784","main":true},{"actorName":"Richard Kiel","urlProfile":"http://www.imdb.com/name/nm0001423","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4MjI0NTA5OV5BMl5BanBnXkFtZTYwOTMzMTEz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 September 1939","placeOfBirth":" Detroit, Michigan, USA","birthName":"Richard Dawson Kiel","height":"7' 2\" (2.18 m)","bio":"Towering 7' 2\" tall actor who has cornered the market on playing giants, intimidating henchman, bayou swamp monsters and steel toothed villains! Kiel worked in numerous jobs including as a night club bouncer and a cemetery plot salesman, before breaking into film & TV in several minor roles in the late 1950s / early 1960s. Noted amongst these was the alien \"Kanamit\" in the classic The Twilight Zone (1959) episode \"To Serve Man\", and terrorizing Arch Hall Jr. while clad in a loincloth in the prehistoric caveman meets virile teenage drama Eegah (1962). Kiel turned up in two episodes of the classic horror TV series Kolchak: The Night Stalker (1974). On one occasion playing a Native American evil spirit with the ability to transform into various animals. On his second appearance, Kiel was unrecognizable as a Spanish moss covered, Louisiana swamp monster brought to life by a patient involved in deep sleep therapy. However, his biggest break came in 1977 when he was cast as the unstoppable, steel toothed henchman \"Jaws\" in the finest Roger Moore film of the Bond series The Spy Who Loved Me (1977). Such was Kiel's popularity with movie audiences, that his character was brought back for the next Bond outing Moonraker (1979). However, audiences were quite split on opinions when Kiel's \"Jaws\" character changes sides near the film's conclusion and assists 007, Roger Moore, in saving the Earth. Over the next few years, Kiel appeared in relatively non-demanding comedy or fantasy type films taking advantage of his physical stature and presence. Kiel then decided to try his hand behind the camera and co-wrote and produced, plus took the lead role, in the well received family movie The Giant of Thunder Mountain (1991). Demand for Kiel's unique attributes dropped very sharply in the 1990's, leading to only a handful of roles including reprising his \"Jaws\" character in the Matthew Broderick film Inspector Gadget (1999). In 2002, Kiel penned his informative autobiography entitled \"Making it BIG in the movies\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4MjI0NTA5OV5BMl5BanBnXkFtZTYwOTMzMTEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001423","name":"Richard Kiel","idIMDB":"nm0001423"},"actorId":"nm0001423","character":"Mr. Larson","urlCharacter":"http://www.imdb.com/character/ch0009087","main":true},{"actorName":"Dennis Dugan","urlProfile":"http://www.imdb.com/name/nm0240797","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDU4NTkzNV5BMl5BanBnXkFtZTYwNTQ5Mjk1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 September 1946","placeOfBirth":" Wheaton, Illinois, USA","height":"5' 8\" (1.73 m)","bio":"Dennis Dugan was born on September 5, 1946 in Wheaton, Illinois, USA. He is an actor and director, known for Happy Gilmore (1996), You Don't Mess with the Zohan (2008) and Big Daddy (1999). He is married to Sharon Dugan. He was previously married to Joyce Van Patten.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDU4NTkzNV5BMl5BanBnXkFtZTYwNTQ5Mjk1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0240797","name":"Dennis Dugan","nicknames":["Dugie"],"idIMDB":"nm0240797"},"actorId":"nm0240797","character":"Doug Thompson","urlCharacter":"http://www.imdb.com/character/ch0009089","main":true},{"actorName":"Joe Flaherty","urlProfile":"http://www.imdb.com/name/nm0280886","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3OTk1MTIzOF5BMl5BanBnXkFtZTcwODYyMjkyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 June 1941","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"Joseph O'Flaherty","height":"6' 1\" (1.85 m)","bio":"Joe Flaherty was born on June 21, 1941 in Pittsburgh, Pennsylvania, USA as Joseph O'Flaherty. He is an actor and writer, known for SCTV (1976), Une maison de fous (1990) and SCTV Network (1981). He was previously married to Judith.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3OTk1MTIzOF5BMl5BanBnXkFtZTcwODYyMjkyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0280886","name":"Joe Flaherty","idIMDB":"nm0280886"},"actorId":"nm0280886","character":"Jeering Fan","urlCharacter":"http://www.imdb.com/character/ch0535096","main":true},{"actorName":"Lee Trevino","urlProfile":"http://www.imdb.com/name/nm0005504","urlPhoto":"","biography":{"dateOfBirth":"1 December 1939","placeOfBirth":" Dallas, Texas, USA","birthName":"Lee Buck Trevino","bio":"Lee Trevino was born on December 1, 1939 in Dallas, Texas, USA as Lee Buck Trevino. He is an actor, known for Happy Gilmore (1996), Jack Benny's First Farewell Special (1973) and Miracle on the 17th Green (1999). He has been married to Claudia Bove since December 20, 1983. He was previously married to Claudia Fenley and Linda.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0005504","name":"Lee Trevino","nicknames":["Super Mex"],"idIMDB":"nm0005504"},"actorId":"nm0005504","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kevin Nealon","urlProfile":"http://www.imdb.com/name/nm0005265","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkyMDUzMjc4N15BMl5BanBnXkFtZTcwMzE3MDIwNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1953","placeOfBirth":" St. Louis, Missouri, USA","height":"6' 4\" (1.93 m)","bio":"Kevin Nealon was born on November 18, 1953 in St. Louis, Missouri, USA. He is an actor and writer, known for Weeds (2005), Saturday Night Live (1975) and Blended (2014). He has been married to Susan Yeagley since September 3, 2005. They have one child. He was previously married to Linda Dupree.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkyMDUzMjc4N15BMl5BanBnXkFtZTcwMzE3MDIwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005265","name":"Kevin Nealon","idIMDB":"nm0005265"},"actorId":"nm0005265","character":"Potter","urlCharacter":"http://www.imdb.com/character/ch0009088","main":true},{"actorName":"Verne Lundquist","urlProfile":"http://www.imdb.com/name/nm0526564","urlPhoto":"","biography":{"dateOfBirth":"17 July 1940","placeOfBirth":" Duluth, Minnesota, USA","birthName":"Merton Laverne Lundquist Jr.","bio":"Verne Lundquist was born on July 17, 1940 in Duluth, Minnesota, USA as Merton Laverne Lundquist Jr. He is an actor, known for The Last Boy Scout (1991), 1994 Winter Olympics Figure Skating Competition and Exhibition Highlights (1994) and 2013 Hyundai Sun Bowl (2013). He has been married to Nancy Webb since April 8, 1982. He was previously married to Kathy Vernon and Patricia.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0526564","name":"Verne Lundquist","idIMDB":"nm0526564"},"actorId":"nm0526564","character":"Announcer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jared Van Snellenberg","urlProfile":"http://www.imdb.com/name/nm0888006","urlPhoto":"","biography":{"dateOfBirth":"26 December 1980","placeOfBirth":" Vancouver, British Columbia, Canada","height":"5' 11\" (1.8 m)","bio":"Jared Van Snellenberg was born and raised in Vancouver, BC, Canada. He developed a strong interest in acting from a young age, and had started training in various local film and theatre courses by the age of 11. At the age of 14 he made his film debut as Adam Sandler's caddy in Happy Gilmore (1996), who was the first of three Saturday Night Live (1975) cast members with whom Jared has had the opportunity to work alongside in feature films (also Jon Lovitz in Rat Race (2001) and 'Darrel Hammond' in Agent Cody Banks (2003)). In 2002 Jared left the industry to pursue a career in academic psychology.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0888006","name":"Jared Van Snellenberg","idIMDB":"nm0888006"},"actorId":"nm0888006","character":"Happy's Waterbury Caddy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ken Camroux-Taylor","urlProfile":"http://www.imdb.com/name/nm0133400","urlPhoto":"","biography":{"bio":"Ken Camroux-Taylor is an actor, known for Happy Gilmore (1996), Bird on a Wire (1990) and This Boy's Life (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0133400","name":"Ken Camroux-Taylor","idIMDB":"nm0133400"},"actorId":"nm0133400","character":"Coach","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0116483","urlIMDB":"http://www.imdb.com/title/tt0116483","business":{"budget":{"money":"$12,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1998/\">1998</a>"},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1995/\">1995</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 32 min (92 min)"],"soundMix":["DTS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arriflex Cameras and Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.0","metascore":"31","filmingLocations":[{"location":"Pitt Meadows, British Columbia, Canada"}],"rated":"PG-13","awards":[{"award":"Kids' Choice Awards, USA 1997","titlesAwards":[{"titleAwardOutcome":"Nominated Blimp Award","categories":[{"category":"Favorite Movie","names":[]}]}]},{"award":"MTV Movie Awards 1996","titlesAwards":[{"titleAwardOutcome":"Won MTV Movie Award","categories":[{"category":"Best Fight","names":[{"name":"Adam Sandler","id":"nm0001191","role":null},{"name":"Bob Barker","id":"nm0054837","role":null}]}]},{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Best Comedic Performance","names":[{"name":"Adam Sandler","id":"nm0001191","role":null}]}]}]},{"award":"Razzie Awards 1997","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Actor","names":[{"name":"Adam Sandler","id":"nm0001191","role":null},{"name":"Bulletproof","id":"tt0115783","role":null}]}]}]},{"award":"The Stinkers Bad Movie Awards 1996","titlesAwards":[{"titleAwardOutcome":"Nominated Stinker Award","categories":[{"category":"Worst Actor","names":[{"name":"Adam Sandler","id":"nm0001191","role":null}]}]}]}],"votes":"162,768","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"},{"idCompany":"co0063786","name":"Brillstein-Grey Entertainment"},{"idCompany":"co0033486","name":"Robert Simonds Productions"}],"keywords":{"keywords":["golf","grandmother's house","golf ball","tournament","golfer","golf course","golf club","co written by actor","underdog","physical comedy","amputee","slapstick","ice hockey player","1990s","alligator","girl in panties","black panties","white panties","panties","mini dress","mini skirt","blonde","scantily clad female","cleavage","golf movie","finger gun","ice hockey","speaking in rhyme","zamboni","rivalry","mortgage","ice skater","ice rink","grandmother grandson relationship","golf tournament","ghost","foreclosure","fan","insult","fight","cult film","product placement","title spoken by character","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:37:24"}}