{"data":{"movies":[{"title":"Georgia","originalTitle":"","year":"1995","releaseDate":"19951208","directors":[{"name":"Ulu Grosbard","id":"nm0343260"}],"writers":[{"name":"Barbara Turner","id":"nm0877399"}],"runtime":"115 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWJiNjMwYzMtZWU5Yi00NGI0LTg5NGYtZDY4MWRiYjEwYTYzXkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1.jpg","countries":["USA","France"],"languages":["English","Hebrew"],"genres":["Drama","Music"],"plot":"Sadie is desperately looking up to her older sister Georgia who is a famous C&W artist. Sadie wants to be a famous artist like her sister, but is always doing everything wrong. Her desperate need to be accepted by her sister is constantly complicated by her drug and alcohol problems. Georgia lives a very ordered life with husband, house and children, and Sadie does everything to get her attention.","simplePlot":"Sadie is desperately looking up to her older sister Georgia who is a famous C&W artist. Sadie wants to be a famous artist like her sister, but is always doing everything wrong. Her ... ","actors":[{"actorName":"Jennifer Jason Leigh","urlProfile":"http://www.imdb.com/name/nm0000492","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MzU2NTg0Nl5BMl5BanBnXkFtZTcwMjcyNjY0MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1962","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Jennifer Lee Morrow","height":"5' 3\" (1.6 m)","bio":"Jennifer Jason Leigh was born Jennifer Lee Morrow in Los Angeles, California, the daughter of writer Barbara Turner and actor Vic Morrow. Her father was of Russian Jewish descent and her mother was of Austrian Jewish ancestry. She is the sister of Carrie Ann Morrow and half-sister of actress Mina Badie. Jennifer's parents divorced when she was two. Jennifer worked in her first film at the age of nine, in a nonspeaking role for the film Death of a Stranger (The Spy Who Never Was (1976)). At 14 she attended summer acting workshops given by Lee Strasberg and landed a role in the Disney TV movie Walt Disney's Wonderful World of Color: The Young Runaways (1978), and received her Screen Actors Guild membership in an episode of the TV series Baretta (1975) when she was 16. Jennifer performed in several TV movies and dropped out of Pacific Palisades High School six weeks short of graduation for her major role in the film Eyes of a Stranger (1981). Her first major success came as the female lead in Fast Times at Ridgemont High (1982). Jennifer was married to writer/director Noah Baumbach from 2005 to 2013, and the two have a son.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MzU2NTg0Nl5BMl5BanBnXkFtZTcwMjcyNjY0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000492","name":"Jennifer Jason Leigh","nicknames":["JJL"],"idIMDB":"nm0000492"},"actorId":"nm0000492","character":"Sadie Flood","urlCharacter":"http://www.imdb.com/character/ch0032918","main":true},{"actorName":"Mare Winningham","urlProfile":"http://www.imdb.com/name/nm0001858","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0ODU1NjgxMV5BMl5BanBnXkFtZTcwMDM2MTA4MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1959","placeOfBirth":" Phoenix, Arizona, USA","birthName":"Mary Megan Winningham","height":"5' 6\" (1.68 m)","bio":"Mary 'Mare' Megan Winningham is an actress and songwriter who has appeared in nearly 100 TV shows and feature films. She began her career in 1976 as a singer, and starred in numerous and diverse film roles before hitting it big as one of the original Brat Pack in Joel Schumacher's St. Elmo's Fire (1985) with Emilio Estevez, Andrew McCarthy, Demi Moore, Judd Nelson, and Ally Sheedy. Mare attended Chatsworth High School with Val Kilmer, James Rekart and Kevin Spacey, but she was bitten by the acting bug much earlier on. She had enjoyed drama and music since primary school, taking a particular interest in the guitar and drums. Since St. Elmo's Fire (1985), Mare has played some outstanding roles in a number of big films. She starred in the Tom Hanks comedy Turner & Hooch (1989). She has also starred in two feature films with Kevin Costner, The War (1994) and the western Wyatt Earp (1994), the latter directed by Lawrence Kasdan and co-starring Gene Hackman. Mare won a Best Supporting Actress Oscar nomination for her role opposite Jennifer Jason Leigh in Georgia (1995). Bad Day on the Block (1997) saw her starring opposite Charlie Sheen and she put in a superb performance in Brothers (2009), a war drama co-starring Tobey Maguire and Natalie Portman. Her myriad TV roles include ER (1994), Grey's Anatomy (2005), and 24 (2001) with Kiefer Sutherland.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0ODU1NjgxMV5BMl5BanBnXkFtZTcwMDM2MTA4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001858","name":"Mare Winningham","idIMDB":"nm0001858"},"actorId":"nm0001858","character":"Georgia Flood","urlCharacter":"http://www.imdb.com/character/ch0032919","main":true},{"actorName":"Ted Levine","urlProfile":"http://www.imdb.com/name/nm0505971","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NTE3MjEwMF5BMl5BanBnXkFtZTYwODkzNTkz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 May 1957","placeOfBirth":" Bellaire, Ohio, USA","birthName":"Frank Theodore Levine","height":"5' 11\" (1.8 m)","bio":"Born in Bellaire, Ohio, in May, 1957, he was among the last graduating class of the Windsor Mountain School in Lennox, Massachusetts. Attended Marlboro College in Vermont. Performed in summer stock and regional theatres in Vermont, Michigan and West Virginia before settling in Chicago and joining The Remains ensemble. Levine worked on stage at Remains, Wisdom Bridge, and The Goodman and Steppenwolf theaters throughout the 1980s before he began working in television and film.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NTE3MjEwMF5BMl5BanBnXkFtZTYwODkzNTkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0505971","name":"Ted Levine","idIMDB":"nm0505971"},"actorId":"nm0505971","character":"Jake","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Max Perlich","urlProfile":"http://www.imdb.com/name/nm0001611","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEyNzU1MzIzMV5BMl5BanBnXkFtZTgwOTU3MDk2MDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 March 1968","placeOfBirth":" Cleveland, Ohio, USA","height":"5' 4½\" (1.64 m)","bio":"Max Perlich was born on March 28, 1968 in Cleveland, Ohio, USA. He is known for his work on Blow (2001), Ferris Bueller's Day Off (1986) and Cliffhanger (1993). He is married to Jia Mae.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEyNzU1MzIzMV5BMl5BanBnXkFtZTgwOTU3MDk2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001611","name":"Max Perlich","idIMDB":"nm0001611"},"actorId":"nm0001611","character":"Axel Goldman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Doe","urlProfile":"http://www.imdb.com/name/nm0230335","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODUyNzM1NzY0NF5BMl5BanBnXkFtZTYwNjk5ODQ0._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 February 1953","placeOfBirth":" Decatur, Illinois, USA","birthName":"John Nommenson Duchac","bio":"John Doe was born on February 25, 1953 in Decatur, Illinois, USA as John Nommenson Duchac. He is an actor, known for The Bodyguard (1992), Great Balls of Fire! (1989) and The Good Girl (2002). He has been married to Gigi Blair since 1987. They have three children. He was previously married to Exene Cervenka.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODUyNzM1NzY0NF5BMl5BanBnXkFtZTYwNjk5ODQ0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0230335","name":"John Doe","idIMDB":"nm0230335"},"actorId":"nm0230335","character":"Bobby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John C. Reilly","urlProfile":"http://www.imdb.com/name/nm0000604","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MDEzMDkzOF5BMl5BanBnXkFtZTYwNzQzNzcy._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 May 1965","placeOfBirth":" Chicago, Illinois, USA","birthName":"John Christopher Reilly","height":"6' 2\" (1.88 m)","bio":"Character actor, dramatic leading man, or hilarious comic foil? With an astonishing range of roles already under his belt, John C. Reilly has played an eclectic host of rich characters to great effect over the years, from seedy ne'er-do-wells, to lovable, good-natured schlepps. The fifth of six children, John Christopher Reilly was born in Chicago, to a father of mostly Irish descent, and a Lithuanian-American mother, and was brought up on Chicago's tough Southwest territory. His father, also named John, ran an industrial linen supply company business. On the amateur stage from age eight, Reilly trained at the Goodman School of Drama and eventually became a member of Chicago's renowned Steppenwolf Theatre. His film break came with a small role in the Vietnam War drama Casualties of War (1989), wherein Brian De Palma liked his work so much during the early stages that he recast him in a major role by the start of shooting as a soldier bent on rape. Reilly gained momentum throughout the 1990s and showed his dazzling stretch of talent in such films as Days of Thunder (1990), Shadows and Fog (1991), What's Eating Gilbert Grape (1993) and The River Wild (1994). He became a major stock player in director Paul Thomas Anderson's films, while finding some of his best roles in Hard Eight (1996) as a compulsive gambler, Boogie Nights (1997) in which he played a narcissistic porn star, and in Magnolia (1999) as a compassionate policeman. He went on to earn further critical points for his role of the soldier sent to the front lines in Terrence Malick's war epic The Thin Red Line (1998). On stage, Reilly has wowed audiences in \"The Grapes of Wrath\" on Broadway, \"A Streetcar Named Desire\" and \"Othello\" at Steppenwolf, and earned an Outer Critics Circle Award and Tony nomination for \"True West\" alongside another impeccable character player Philip Seymour Hoffman. Reilly finally received the film recognition he deserved in 2002 with a slew of choice, high-profile parts in The Hours (2002), The Good Girl (2002), Gangs of New York (2002), and especially Chicago (2002) as the put-upon husband, Amos Hart, who is played for a patsy by murderous wife Roxie (Renée Zellweger). For this last part, he received both Golden Globe and Academy Award nominations for Best Supporting Actor. Since then his stock has risen considerably, and he has further widened his cinematic repertoire, appearing in everything from dramatic roles - We Need to Talk About Kevin (2011), Aviator (2004) and Carnage (2011) - to broader comic turns - Walk Hard: The Dewey Cox Story (2007), Talladega Nights: The Ballad of Ricky Bobby (2006), Step Brothers (2008), Cyrus (2010) and Cedar Rapids (2011). Most recently, he has voiced the lead in Disney's animated smash Wreck-It Ralph (2012). Reilly is married to producer Alison Dickey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MDEzMDkzOF5BMl5BanBnXkFtZTYwNzQzNzcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000604","name":"John C. Reilly","idIMDB":"nm0000604"},"actorId":"nm0000604","character":"Herman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jimmy Witherspoon","urlProfile":"http://www.imdb.com/name/nm0936761","urlPhoto":"","biography":{"dateOfBirth":"18 August 1921","placeOfBirth":" Gurdon, Arkansas, USA","bio":"Jimmy Witherspoon was born on August 18, 1921 in Gurdon, Arkansas, USA. He was married to Diana Williams. He died on September 18, 1997 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0936761","name":"Jimmy Witherspoon","nicknames":["Spoon"],"idIMDB":"nm0936761"},"actorId":"nm0936761","character":"Trucker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Carter","urlProfile":"http://www.imdb.com/name/nm0141682","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI2ODY1MjAzNF5BMl5BanBnXkFtZTgwMzc5ODQ1MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 September 1960","placeOfBirth":" London, England, UK","birthName":"Jason Brian Carter","height":"6' (1.83 m)","bio":"Best known to sci-fi fans for his role as Ranger Marcus Cole on \"Babylon 5\", Jason Carter, born in London on September 23, 1960, is a British stage, film and television actor. Leads in school plays and summers at the National Youth Theater of Great Britain led to three years at the London Academy of Music and Dramatic Art (LAMDA). In the Physical Theatre classes taught by Jane Gibson, who trained under Jacque le Coq in Paris, Jason found the acting and thinking tools that would inform his approach to his professional work. Graduating in 1981 after a three-month tour of Holland and Belgium playing Romeo in \"Romeo and Juliet\", Jason pursued his craft in a variety of roles. High points include playing Macbeth at Chichester Festival Theatre, three long runs in the London West End: \"The Sleeping prince\" with Omar Sharrif, Simon Gray's \"Melon\" with Alan Bates, Simon Gray's \"The Common Pursuit\" directed by the author, and Steven Berkoff's Royal National Theatre production of Oscar Wilde's \"Salome\". In British television, Jason starred in two series, a mini series, a number of TV movies and numerous guest star roles. Jason has enjoyed collaborating with many directors developing characters and evolving scenes. He worked closely with Jason Lehel whilst starring in \"Boiling Point\", Gil Cates JR. on \"The Mesmerist\", and Nick Ward on Working Title's \"Dakota Road\" for which, at the Festival du Cinema Britannique de Dinard, Jason received a commendation for his performance as \"Raif\" from chairman of the judges, Ben Kingsley. The director's chair is an as yet unrealized creative interest for Jason that he looks to pursue for the future in addition to his acting work. On American television Jason has had many roles, beginning with Connor, the hero's nemesis on the pilot episode of \"Viper\", and guest starring in many popular series including \"Beverley Hills 90210\", \"Angel\", \"Sentinel\", \"Lois and Clark\", and \"3rd Rock From The Sun\". When Jason auditioned for Marcus Cole on \"Babylon 5\", he had been told it was to guest star, and so was delighted when his surprised agent informed him it was a three-year contract and he had secured the role - a role that would change his life. Whilst making \"Babylon 5\", fine actor and dear friend, Richard Biggs suggested they partner up and develop fun classes to jointly share the craft they both loved. Richard and Jason would hold \"The Biggs and Carter Experience\" at conventions until Richard's death in 2004. In 2013, Jason can be found at international conventions celebrating the 20th anniversary of the \"Babylon 5\" pilot and on his public Facebook page, enjoying sharing both geeky humor, geeky fact, and geeky postulation.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI2ODY1MjAzNF5BMl5BanBnXkFtZTgwMzc5ODQ1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0141682","name":"Jason Carter","idIMDB":"nm0141682"},"actorId":"nm0141682","character":"Chasman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Bower","urlProfile":"http://www.imdb.com/name/nm0101005","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWFiZDM0OGItYzgyOS00N2I5LTgwYzYtNWJjZmMyMjZlODE5XkEyXkFqcGdeQXVyODQxMzk1NQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 January 1938","placeOfBirth":" Denver, Colorado, USA","birthName":"RalphThomas Bower","height":"5' 11\" (1.8 m)","bio":"Tom Bower grew up in Denver Colorado and thought he would have a career as an athlete, having played Varsity Baseball, Basketball, Golf, ran Track and just assumed a professional career would follow. Didn't quite work out that way, and so, his hobby of Acting seemed to be the next course of action. He immediately set off for New York City, following graduation and a season of Summer Stock at America's oldest Summer Stock Theatre, Elitche Garden's Summer Theatre, in Denver. Tom, at the ripe old age of 17, wasn't quite ready to take the City and Broadway by storm, but he was about to have a real adventure starting off with his enrollment at the American Academy of Dramatic Arts. Robert Redford, was in his class but no one really knew he was at that time, and Tom was even less well known. After a year and a half at the Academy, he shifted gears and began studying at John Cassavetes Shadows Workshop, and Tom's first film work ever was in Cassavetes first film; SHADOWS, shot in 1957. Returning home to Denver each Summer, Tom married his first wife and had a couple of kids. Straight jobs were necessary to provide for a young family and after running the gamut of all kinds of employment endeavors, Tom broke into the field of Private Investigation and that became his calling card for the next 15 years. During that time, he divorced and later married his true love Ursula, with whom he is now celebrating 47 years of wedded bliss. They have 4 Grandchildren and a wonderful life in Los Angeles. Some 166 feature films and television shows later along with 87 or so theatrical productions behind him, Tom now splits his time between acting and producing. He's also been the founder of three legitimate theatre companies including the MET Theatre, which included such associates as James Gammon, Tim Scott, Ed Harris, Amy Madigan, Holly Hunter, and Pulitzer Prize winning playwright, Beth Henley. Film work has afforded Tom and Urs the opportunity of travel to such far off places as China, Morocco, Poland, South Africa, Germany and oo-la-la, Paris, France, the U.K., Italy and Canada. Still going strong, Tom just completed filming LIGHT OF MY LIFE; a movie written, directed and starred in by Academy Award winner Casey Affleck. \"We've just now returned from the 45th Anniversary Reunion of the Waltons and the 1 year Anniversary of Waltons creator, Earl Hamner's passing, which was held in Earl's home town of Schuyler, Virginia. Also home of the Waltons Museum. Life goes on\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWFiZDM0OGItYzgyOS00N2I5LTgwYzYtNWJjZmMyMjZlODE5XkEyXkFqcGdeQXVyODQxMzk1NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0101005","name":"Tom Bower","idIMDB":"nm0101005"},"actorId":"nm0101005","character":"Erwin Flood","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Smokey Hormel","urlProfile":"http://www.imdb.com/name/nm0394782","urlPhoto":"","biography":{"bio":"Smokey Hormel is known for his work on The Straight Story (1999), Be Kind Rewind (2008) and Chuck & Buck (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0394782","name":"Smokey Hormel","idIMDB":"nm0394782"},"actorId":"nm0394782","character":"Leland","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jimmy Z.","urlProfile":"http://www.imdb.com/name/nm0951320","urlPhoto":"","biography":{"bio":"Jimmy Z. is an actor, known for Georgia (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0951320","name":"Jimmy Z.","idIMDB":"nm0951320"},"actorId":"nm0951320","character":"Clay","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony Marsico","urlProfile":"http://www.imdb.com/name/nm0551272","urlPhoto":"","biography":{"bio":"Tony Marsico is an actor, known for Road House (1989), She's So Lovely (1997) and Desperado (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0551272","name":"Tony Marsico","idIMDB":"nm0551272"},"actorId":"nm0551272","character":"Paul","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jamian Briar","urlProfile":"http://www.imdb.com/name/nm0108472","urlPhoto":"","biography":{"bio":"Jamian Briar is an actor, known for Georgia (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0108472","name":"Jamian Briar","idIMDB":"nm0108472"},"actorId":"nm0108472","character":"Andrew Flood","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rachel Rasco","urlProfile":"http://www.imdb.com/name/nm0711081","urlPhoto":"","biography":{"bio":"Rachel Rasco is an actress, known for Georgia (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0711081","name":"Rachel Rasco","idIMDB":"nm0711081"},"actorId":"nm0711081","character":"Mish Flood","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicole Donahoo","urlProfile":"http://www.imdb.com/name/nm0231924","urlPhoto":"","biography":{"bio":"Nicole Donahoo is an actress, known for Georgia (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0231924","name":"Nicole Donahoo","idIMDB":"nm0231924"},"actorId":"nm0231924","character":"Young Sadie Flood","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0113158","urlIMDB":"http://www.imdb.com/title/tt0113158","business":{"budget":null,"openingWeekend":[{"money":"$55,461","country":"USA","day":"10","month":"12","year":"1995","remarks":"3 Screens"}],"gross":[],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 55 min (115 min)"],"soundMix":["Dolby","Dolby SR"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Alpha Cine Labs, Seattle (WA), USA"],"filmLength":["3,301 m"],"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"6.5","metascore":"81","filmingLocations":[{"location":"Seattle, Washington, USA"}],"rated":"R","awards":[{"award":"Academy Awards, USA 1996","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Actress in a Supporting Role","names":[{"name":"Mare Winningham","id":"nm0001858","role":null}]}]}]},{"award":"Screen Actors Guild Awards 1996","titlesAwards":[{"titleAwardOutcome":"Nominated Actor","categories":[{"category":"Outstanding Performance by a Female Actor in a Supporting Role","names":[{"name":"Mare Winningham","id":"nm0001858","role":null}]}]}]},{"award":"Film Independent Spirit Awards 1996","titlesAwards":[{"titleAwardOutcome":"Won Independent Spirit Award","categories":[{"category":"Best Supporting Female","names":[{"name":"Mare Winningham","id":"nm0001858","role":null}]}]},{"titleAwardOutcome":"Nominated Independent Spirit Award","categories":[{"category":"Best Director","names":[{"name":"Ulu Grosbard","id":"nm0343260","role":null}]},{"category":"Best Female Lead","names":[{"name":"Jennifer Jason Leigh","id":"nm0000492","role":null}]},{"category":"Best Supporting Male","names":[{"name":"Max Perlich","id":"nm0001611","role":null}]}]}]},{"award":"Los Angeles Film Critics Association Awards 1995","titlesAwards":[{"titleAwardOutcome":"2nd place LAFCA Award","categories":[{"category":"Best Actress","names":[{"name":"Jennifer Jason Leigh","id":"nm0000492","role":null}]}]}]},{"award":"Montréal World Film Festival 1995","titlesAwards":[{"titleAwardOutcome":"Won Best Actress","categories":[{"category":"","names":[{"name":"Jennifer Jason Leigh","id":"nm0000492","role":null}]}]},{"titleAwardOutcome":"Won Grand Prix des Amériques","categories":[{"category":"","names":[{"name":"Ulu Grosbard","id":"nm0343260","role":null}]}]}]},{"award":"National Society of Film Critics Awards, USA 1996","titlesAwards":[{"titleAwardOutcome":"2nd place NSFC Award","categories":[{"category":"Best Actress","names":[{"name":"Jennifer Jason Leigh","id":"nm0000492","role":null}]}]}]},{"award":"New York Film Critics Circle Awards 1995","titlesAwards":[{"titleAwardOutcome":"Won NYFCC Award","categories":[{"category":"Best Actress","names":[{"name":"Jennifer Jason Leigh","id":"nm0000492","role":null}]}]}]}],"votes":"2,482","type":"Movie","companyCreditsSimple":[{"idCompany":"co0008195","name":"CiBy 2000"},{"idCompany":"co0022594","name":"Miramax"}],"keywords":{"keywords":["voyeurism","voyeur","sex in bed","coitus","copulation","girl in panties","black panties","panties","no panties","female rear nudity","female frontal nudity","female nudity","nudity","nude girl","nude","bare breasts","breasts","topless female nudity","scantily clad female","cleavage","country music","envy","sister sister estrangement","sister sister conflict","country western music","sister sister relationship","alcoholism","drug addiction","drug addict","singer","female singer","female protagonist","one word title","withdrawal","heroin","sibling rivalry","independent film","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 16:18:17"}}