{"data":{"movies":[{"title":"Babylon 5: Thirdspace","originalTitle":"","year":"1998","releaseDate":"19980719","directors":[{"name":"Jesús Salvador Treviño","id":"nm0872442"}],"writers":[{"name":"J. Michael Straczynski","id":"nm0833089"},{"name":"J. Michael Straczynski","id":"nm0833089"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwODAxNTM2MV5BMl5BanBnXkFtZTYwNjY4NDE5._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Drama","Sci-Fi"],"plot":"The crew of Babylon 5 discover a mysterious artifact of unknown origin. The artifact influences the minds of people aboard the station and endangers the lives of everyone aboard. Takes place during season 4 of the Babylon 5 TV series.","simplePlot":"The crew of Babylon 5 discover an ancient artifact floating in hyperspace.","actors":[{"actorName":"Bruce Boxleitner","urlProfile":"http://www.imdb.com/name/nm0000310","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MTc5OTQ0M15BMl5BanBnXkFtZTcwMjY1Mjg4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1950","placeOfBirth":" Elgin, Illinois, USA","birthName":"Bruce William Boxleitner","height":"6' 2\" (1.88 m)","bio":"As one of Hollywood's leading men, Bruce Boxleitner has starred in a major motion picture franchise, numerous feature films, several popular television series, produced a major network film and TV series, performed on Broadway, and authored two science fiction novels. Boxleitner received his formal acting training on stage. A native mid-westerner, he is an alumnus of Chicago's prestigious Goodman Theatre. In 1972, he starred in the Broadway production of Status Quo Vadis with Ted Danson. He then relocated to Los Angeles and quickly landed a guest spot on the legendary TV series The Mary Tyler Moore Show as well as numerous guest roles on series, including Hawaii 5-0, Beretta, Police Woman, and Gunsmoke. Boxleitner's big break occurred when he was cast opposite James Arness in the pilot for the epic TV series How the West Was Won. He went on to star in the CBS series Bring 'em Back Alive; mini-series East of Eden; and TV movie The Last Convertible. In 1982, Boxleitner was cast as the title role in Disney's cult film TRON which garnered him science fiction fans worldwide. However, it was in Boxleitner's four-year run for CBS's 'Scarecrow and Mrs. King', starring opposite Kate Jackson, which endeared him to fans everywhere and made him a household name. In 1994, Boxleitner joined the cast of the popular TV series Babylon 5 as John Sheridan, President of the Interstellar Alliance, a war hero-turned-diplomat at the helm of Earth Alliance Space Station in the year 2259. The show aired for five seasons. Boxleitner most recently starred with Jeff Bridges in TRON: Legacy, the popular motion picture sequel to TRON. The cast includes Garrett Hedlund and Olivia Wilde. In addition, Boxleitner reprised his role in TRON: Uprising on Disney's XD TV network, his first animated TV series. The multi-talented cast includes Elijah Wood, Mandy Moore, Lance Henriksen, and Paul Reubens. The original TRON recently celebrated its 30th anniversary. Several motion pictures include Gods and Generals with Robert Duvall, Jeff Daniels, Stephen Lang and Mira Sorvino; The Babe with John Goodman and Kelly McGillis; Kuffs with Christian Slater; and The Baltimore Bullet with James Coburn. Numerous TV movie credits include The Secret with Kirk Douglas; Perfect Family with Jennifer O'Neal and Joanna Cassidy; Double Jeopardy with Rachel Ward, Sally Kirkland and Sela Ward; Passion Flower with Barbara Hershey and Nicol Williamson; and Hallmark Channel movies, 'Love's Resounding Courage' and 'Falling in Love with the Girl Next Door'; among many others. The veteran actor has appeared in numerous recurring roles on TV series including GCB and Heroes, and has guest-starred on NCIS and Chuck, among others. A skilled horseman, Boxleitner utilized his talents in numerous Western TV series and films including Kenny Rogers television movie series that aired on CBS and NBC, starring opposite Kenny Rogers; 'Gunsmoke V: One Man's Justice' with James Arness (Arness' final film); CBS' remake of Red River with Gregory Harrison, James Arness and Laura Johnson; 'Wyatt Earp: Return to Tombstone' with Hugh O'Brian; and Down the Long Hills, based on legendary western author Louis L'Amour's novel of the same name. Boxleitner was inducted into the Hall of Great Western Performers at the National Cowboy and Western Heritage Museum in Oklahoma City in April 2012 honoring him for his illustrious career in western films. He is a two-time recipient of the Wrangler Award. In 2013, Boxleitner co-starred with Andie MacDowell and Dylan Neal in Hallmark Channel's first-ever prime-time series, Debbie Macomber's Cedar Cove to rave reviews and an average of 2 million viewers. The #1 rated cable program was renewed for a third season and is scheduled to premiere in the summer of 2015. In 1999, Boxleitner authored \"Frontier Earth\" and in 2001, its sequel \"Frontier Earth: Searcher\", published by The Berkley Publishing Group. Bruce Boxleitner resides in Los Angeles with his wife, publicist Verena King, and has three sons: Sam, Lee and Michael.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MTc5OTQ0M15BMl5BanBnXkFtZTcwMjY1Mjg4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000310","name":"Bruce Boxleitner","idIMDB":"nm0000310"},"actorId":"nm0000310","character":"Capt. John J. Sheridan","urlCharacter":"http://www.imdb.com/character/ch0012565","main":true},{"actorName":"Claudia Christian","urlProfile":"http://www.imdb.com/name/nm0160004","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU3OTY5MjM5Nl5BMl5BanBnXkFtZTgwMTkxODE0MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1965","placeOfBirth":" Glendale, California, USA","birthName":"Claudia Ann Christian","height":"5' 9\" (1.75 m)","bio":"Claudia Christian was born on August 10, 1965, in Glendale, California. Her family moved to Connecticut some afterwards. At age five, she was bitten by the acting bug when she played a Native American in a school play. After her family returned to California, she graduated high school at 16, and set out to start her acting career. She worked in a coffee house and then at a clothing store for two years before landing her first acting role on the soap Dallas (1978). In her next appearance, she played Kara in the television movie, Calendar Girl Murders (1984). Her big break came when she landed the part of \"Susan Ivanova\" on the science-fiction series Babylon 5 (1994). Her grandfather is a surgeon and her three older brothers are genetic engineers and veterinarians. Claudia enjoys listening to opera, painting, extreme sports, playing piano, collecting antiques and hosting dinner parties. She is fluent in French, Italian and German and enjoys acting in these languages. Claudia was voted \"sexiest woman in sci-fi\" by SFX Magazine in 1998.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU3OTY5MjM5Nl5BMl5BanBnXkFtZTgwMTkxODE0MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0160004","name":"Claudia Christian","idIMDB":"nm0160004"},"actorId":"nm0160004","character":"Susan Ivanova","urlCharacter":"http://www.imdb.com/character/ch0012568","main":true},{"actorName":"Mira Furlan","urlProfile":"http://www.imdb.com/name/nm0001245","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MDk1MTg1NF5BMl5BanBnXkFtZTYwODMxMjEz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1955","placeOfBirth":" Zagreb, Croatia, Yugoslavia","height":"5' 6\" (1.68 m)","bio":"A leading actress of theatre, film and TV in the former Yugoslavia, Mira Furlan emigrated to the U.S. with her husband, Goran Gajic, in November 1991, due to the intolerable political circumstances in her homeland. Ms. Furlan starred in the Warner Brothers TV-series Babylon 5 (1994) as \"Ambassador Delenn\" (Sci-Fi Universe Award for Best Supporting Actress in a Genre TV-series 1996 and 1997). Her other American credits include the TV-movie My Antonia (1995) directed by Joseph Sargent, the title roles in \"Sophocles Antigone\" at the Hudson Guild Theatre in Los Angeles (Dramalogue Theatre Award for Outstanding Performance in 1995) and Lorca's \"Yerma\" at The Indiana Repertory Theatre. She also appeared in Brecht's \"Baal\" at The Second Stage in Los Angeles and Shaw's \"Don Juan In Hell\" in which she co-starred with Edward Asner and Rene Auberjonois. Ms. Furlan is a member of The Actor's Studio. Ms. Furlan's film credits include leading roles in over 25 films. She co-starred in Emir Kusturica's Cannes award-winning and Oscar-nominated film When Father Was Away On Business (2000). Films include: Three For Happiness, (Grand Prix, Valencia Film Festival), Beauty Of Vice, In The Jaws Of Life, The Loves Of Blanka Kolak, Dear Video etc. In addition, Ms Furlan has appeared regularly on Yugoslav Television, playing leading roles in numerous series and TV-films. She has received all the highest awards in her former country, both for her stage and film work, including two Golden Arenas (Yugoslav Oscars) for Best Actress. In the former Yugoslavia, Mira was a member of the Croatian National Theatre and a frequent guest star at major theatres in the whole country. Favorite roles include: \"Natalya\" in \"A Month In The Country\", \"Mrs. Elliot\" in \"Alpha-Beta\", \"Celimene\" in \"The Misanthrope\", \"Judith\" in \"The Devil's Disciple\", \"Annabella\" in \"Tis Pity She's A Whore\", the title role in Euripides' \"Helen\", \"Lea\" in \"Dybbuk\", \"Isabelle\" in Corneille's \"L'Illusion Comique\", \"Yvette\" in \"Mother Courage\", \"Natasha\" in \"Three Sisters\" and \"Ophelia\" in 'Jiri Menzel''s production of \"Hamlet\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MDk1MTg1NF5BMl5BanBnXkFtZTYwODMxMjEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001245","name":"Mira Furlan","idIMDB":"nm0001245"},"actorId":"nm0001245","character":"Delenn","urlCharacter":"http://www.imdb.com/character/ch0012571","main":true},{"actorName":"Richard Biggs","urlProfile":"http://www.imdb.com/name/nm0081863","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1Nzg1MTE5OTleQTJeQWpwZ15BbWU4MDM1OTg0NTIx._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 March 1960","placeOfBirth":" Columbus, Ohio, USA","birthName":"Richard T. Biggs","height":"5' 10\" (1.78 m)","bio":"Richard Biggs had a somewhat unsettled childhood as he travelled between Air Force bases where his father was stationed. Because of his itinerant lifestyle he made few friends and changed schools often. When he was seventeen, and living at a missile base in North Dakota, he decided to change his plans for a medical career after playing the lead in a local theatrical production of 'The Wiz'. After that, bitten by the acting bug and never deterred by deafness in one ear, he went on to complete a Bachelor of Fine Arts (majoring in performing arts) at USC's School of Theatre, with the distinguished actor John Houseman as one of his drama teachers. He later went on to give his own acting classes at the Will Geer Theatricum Botanicum in Topanga Canyon. Like so many other aspiring performers, Richard had a tough time in his quest to get started in his chosen field. His chief difficulty lay in obtaining membership in the Screen Actor's Guild without experience, yet how was one to acquire experience without a union card ? Living in his car for much of this time, he made ends meet by playing small roles on stage, and, occasionally television. He also worked for a while as a telephone operator answering complaints for an LA waste disposal company. One of his local stage performances, as Romeo at the Ensemble Theatre, impressed an agent who took him on and landed him an audition for a part on the daytime soap opera Days of Our Lives (1965). Several auditions later, he got the part, and the SAG card as well. For most of his career on television, Richard played doctors, an irony which was probably not lost on him: Dr.Tomson in The Twilight Zone (1985), Dr. Lecksis in Beverly Hills, 90210 (1990), Dr.Milo Morton in \"Strong Medicine\", and, of course, Dr.Marcus Hunter, in 1295 episodes of 'Days of Our Lives', from 1985 to 1992. Richard had done his homework for the part by observing a real plastic surgeon in action. However, having played the same individual for such a lengthy period led him later to express doubts about the one-dimensional 'goody two-shoes' nature of the character, who he would have preferred a little 'rougher around the edges'. A far edgier and more complex part was that of Dr.Stephen Franklin, the chief medical officer of J. Michael Straczynski's cult sci-fi series Babylon 5 (1994). Richard played the humanly flawed, but mercurial character from 1994 to 1998 (also in three made-for-TV movies, and, briefly, in the short-lived spin-off series Crusade (1999), as part of a first-rate ensemble cast. His performances were often extremely compelling, particularly in the 'walkabout' episodes of season three, culminating with 'Shadow Dancing'. Post-Babylon, Richard played a detective in Any Day Now (1998), returned to soap opera as Clayton Boudreaux in Guiding Light (1952) and had a brief run as a scientist in the unsuccessful TV spin-off Tremors (2003). The character in his last series, Strong Medicine (2000), was killed off in the show because of the actor's tragic, untimely death at the age of 44. Richard Biggs was eulogised by Babylon 5's Straczysnky as a 'consummate professional' and 'quite simply, a terrific guy'.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1Nzg1MTE5OTleQTJeQWpwZ15BbWU4MDM1OTg0NTIx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0081863","name":"Richard Biggs","idIMDB":"nm0081863"},"actorId":"nm0081863","character":"Stephen Franklin, M.D.","urlCharacter":"http://www.imdb.com/character/ch0012580","main":true},{"actorName":"Jeff Conaway","urlProfile":"http://www.imdb.com/name/nm0001063","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxNTI1Njc2NF5BMl5BanBnXkFtZTcwMTgzMzE0NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 October 1950","placeOfBirth":" New York City, New York, USA","birthName":"Jeffery Charles William Michael Conaway","height":"6' 1½\" (1.87 m)","bio":"Jeff Conaway was born on October 5, 1950 in New York City, New York, USA as Jeffery Charles William Michael Conaway. He was an actor, known for Grease (1978), Taxi (1978) and Babylon 5 (1994). He was married to Kerri Young and Rona Newton-John. He died on May 27, 2011 in Encino, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxNTI1Njc2NF5BMl5BanBnXkFtZTcwMTgzMzE0NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001063","name":"Jeff Conaway","idIMDB":"nm0001063"},"actorId":"nm0001063","character":"Zack Allen","urlCharacter":"http://www.imdb.com/character/ch0012569","main":true},{"actorName":"Stephen Furst","urlProfile":"http://www.imdb.com/name/nm0299122","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNzU2OTgyMV5BMl5BanBnXkFtZTcwODg4NDcyMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 May 1955","placeOfBirth":" Norfolk, Virginia, USA","birthName":"Stephen Fuerstein","height":"5' 10\" (1.78 m)","bio":"Stephen Furst was born on May 8, 1955 in Norfolk, Virginia, USA as Stephen Fuerstein. He is an actor and director, known for Babylon 5 (1994), Animal House (1978) and St. Elsewhere (1982). He has been married to Lorraine Furst since June 13, 1976. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNzU2OTgyMV5BMl5BanBnXkFtZTcwODg4NDcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0299122","name":"Stephen Furst","idIMDB":"nm0299122"},"actorId":"nm0299122","character":"Vir Cotto","urlCharacter":"http://www.imdb.com/character/ch0012575","main":true},{"actorName":"Patricia Tallman","urlProfile":"http://www.imdb.com/name/nm0848191","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MzE5NzU0Nl5BMl5BanBnXkFtZTcwODY4MDEwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 September 1957","placeOfBirth":" Pontiac, Illinois, USA","height":"5' 8\" (1.73 m)","bio":"When she portrayed \"Lyta Alexander\" in the Hugo Award-winning sci-fi series Babylon 5 (1994), Patricia Tallman was the most powerful telepath in the universe. Seems fitting, considering that the actress knew she was going to be in show business at the early age of two. It was then that she first appeared with her father, Jerry, on his Midwest radio show, soloing on \"Bicycle Built for Two\". By age 15, Pat was performing in summer stock at the Red Barn Theatre in Saugatuck, Michigan, doing ten shows in 11 weeks. She soon spent all of her high school vacations in professional summer stock, and eventually chose Carnegie Mellon University to earn a BFA in its prestigious theater arts program. While other theater majors waited tables, Pat worked her way through college, performing in eighteen musicals at the Pittsburgh Civic Light Opera. Recognizing Pat's formidable talents, CMU presented her with an award for Outstanding Achievement in Acting. Immediately after college, Pat moved to New York City, where she landed a role in the long-running off-Broadway hit \"Big, Bad Burlesque\". She went on to score other parts on the New York stage, including her favorite, \"Rosalind\" in the Riverside Shakespeare Company's production of \"As You Like It\". Television roles began shortly thereafter, when Pat was cast in a recurring role on the CBS soap opera, Guiding Light (1952). This led to roles on virtually every New York-based daytime serial. Film roles were not far behind. George A. Romero contacted her to play a role in his feature Knightriders (1981), starring Ed Harris. This led to a long working relationship with him. Pat relocated to Los Angeles , where she again worked with Romero on Creepshow 2 (1987). The film she is perhaps best known for followed: George Romero and Tom Savini's remake of the 1968 cult classic, Night of the Living Dead (1990). The move to L.A. was a smart one, Pat discovered, as she was soon cast as undercover cop \"Christy Russell\" on NBC's Generations (1993), and as an evil, sexy swashbuckler in the Ring of the Musketeers (1992). Other films include Sweet Justice (1992), Benefit of the Doubt (1993), Austin Powers: International Man of Mystery (1997) and Austin Powers: The Spy Who Shagged Me (1999). Television shows include Star Trek: The Next Generation (1987), Star Runner (1990) (A USA Network pilot), Dark Skies (1996), Babylon 5 (1994) and \"The Universe and Harry Morgann\" (an independent pilot). Pat's other projects include starring in the science-fiction thriller Never Die Twice (2001) and playing one of the leads, Lt. Richmond, in two audio plays, \"Lives of the Cat\" and \"Anne Manx\". In addition, her voice can be heard in the cartoon \"Babylon 5\" parodies Babylon Park: Frightspace (1999) and Grudge Match (2000). Equally important to Patricia are her roles of mother to son her Julian, as well as her fund-raising activities for the children of Penny Lane. Through her tireless efforts within the science fiction community, Pat and her fans have contributed more than $250,000 to Penny Lane over the past several years, the bulk of which transformed the CARE Computer Lab dream into reality. Since 1996, Pat, her friends, family and fans have made a holiday happen for the Penny Lane kids, through the Be A Santa program. Dedicated Patricia Tallman fans make a hobby of trying to spot her in her many stunt performances. An extremely athletic and former fearless member of the Stunt Woman's Association of Motion Pictures, Pat has tumbled, slid and taken punches for the likes of Laura Dern (in Jurassic Park (1993)), Gates McFadden (in \"Star Trek: Generations\"), Geena Davis (in The Long Kiss Goodnight (1996)) and Laura Prepon (in Karla (2006)). Pat's roots as a stage actress have never left her, and she continues to tread the footlights in Los Angeles whenever film and TV work allow her the time. Her latest projects include Dead Air (2009), a psychological horror film directed by Corbin Bernsen, for which her performance is getting great reviews. Pat has a book out \"Pleasure Thresholds, Patricia Tallman's Babylon 5 Memoirs\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MzE5NzU0Nl5BMl5BanBnXkFtZTcwODY4MDEwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0848191","name":"Patricia Tallman","idIMDB":"nm0848191"},"actorId":"nm0848191","character":"Lyta Alexander","urlCharacter":"http://www.imdb.com/character/ch0012576","main":true},{"actorName":"Clyde Kusatsu","urlProfile":"http://www.imdb.com/name/nm0476226","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MjQ1NzYxOF5BMl5BanBnXkFtZTcwMDQ2Nzg1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 September 1948","placeOfBirth":" Honolulu, Hawaii, USA","height":"5' 5\" (1.65 m)","bio":"Clyde Kusatsu was born on September 13, 1948 in Honolulu, Hawaii, USA. He is an actor, known for Paradise Road (1997), The Interpreter (2005) and Midway (1976). He has been married to Gayle Shuffler since August 29, 1976. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MjQ1NzYxOF5BMl5BanBnXkFtZTcwMDQ2Nzg1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0476226","name":"Clyde Kusatsu","idIMDB":"nm0476226"},"actorId":"nm0476226","character":"Bill Morishi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shari Belafonte","urlProfile":"http://www.imdb.com/name/nm0004737","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNzY3ODM2M15BMl5BanBnXkFtZTYwNjIzNjkz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 September 1954","placeOfBirth":" New York City, New York, USA","height":"5' 5\" (1.65 m)","bio":"Shari Belafonte was born on September 22, 1954 in New York City, New York, USA. She is known for her work on Hotel (1983), The Player (1992) and Beyond Reality (1991). She has been married to Sam Behrens since December 31, 1989. She was previously married to Robert Harper.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNzY3ODM2M15BMl5BanBnXkFtZTYwNjIzNjkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004737","name":"Shari Belafonte","nicknames":["Pooch Behrens"],"idIMDB":"nm0004737"},"actorId":"nm0004737","character":"Elizabeth Trent","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Sanderson","urlProfile":"http://www.imdb.com/name/nm0761836","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NjIxMjMwN15BMl5BanBnXkFtZTcwMDk1NzgzOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 January 1944","placeOfBirth":" Memphis, Tennessee, USA","height":"5' 8\" (1.73 m)","bio":"Prolific and versatile character actor William Sanderson was born on January 10, 1944, in Memphis, Tennessee. His mother was an elementary school teacher and his father was a landscape designer. William served two years in the US Army. Following his military service he attended Southern Methodist University. He earned both a BBA degree and a JD law degree from Memphis State University. William went to New York to try his luck as an actor. He studied his craft with Herbert Berghof and William Hickey. Sanderson began his acting career in off-Broadway stage productions and appeared in several independent pictures. He gave a superbly lively and intense performance as vicious racist and escaped convict Jessie Lee Kane in the brutal exploitation feature Fight for Your Life (1977). William was likewise marvelous as gentle toymaker J.F. Sebastian in the fantastic science-fiction cult favorite Blade Runner (1982). He has played his fair share of loathsome bad guys (he refers to these particular characters as \"prairie scum\"), such as nasty lout Calvin in Raggedy Man (1981), lowlife hick Lee Dollarhide in Coal Miner's Daughter (1980) and weaselly criminal Snow in Lone Wolf McQuade (1983). Not surprisingly, considering his distinctive Southern drawl, he has also appeared in such westerns as the comedy Wagons East (1994), Crossfire Trail (2001), Monte Walsh (2003), Andersonville (1996), Gods and Generals (2003) and the acclaimed TV mini-series Lonesome Dove (1989) (one of several projects in which Sanderson has acted alongside Tommy Lee Jones). Sanderson gave a lovely and touching portrayal in a rare lead role as emotionally dysfunctional recovering alcoholic ukulele minstrel Stanley Myer in the poignant indie drama Stanley's Gig (2000). He achieved his greatest popularity, however, as flaky backwoodsman Larry on the hit sitcom Newhart (1982) on which he uttered the memorable catchphrase, \"I'm Larry. This is my brother Darryl and this is my other brother Darryl.\" More recently Sanderson had a terrific role as conniving hotel proprietor E.B. Farnum on the sensationally gritty cable western TV series Deadwood (2004). Among the TV shows William has done guest spots on are The Practice (1997), The Pretender (1996), ER (1994), The X-Files (1993), Walker, Texas Ranger (1993), Les anges de la ville (1993), Matlock (1986), Babylon 5 (1994), Married with Children (1987), The Twilight Zone (1985), Knight Rider (1982), Coach (1989), The Dukes of Hazzard (1979) and Starsky and Hutch (1975). He has also done voices for numerous cartoon characters, radio commercials and books on tape. Outside of his substantial film and TV credits, William has acted on stage in productions of such plays as \"The Taming of the Shrew,\" \"When Ya Comin' Back, Red Ryder?,\" \"Insect Comedy,\" \"To Kill a Mockingbird,\" \"Dutchman,\" \"Fishing,\" \"Authentic Life of Billy the Kid,\" \"Tobacco Road,\" and \"Scotch Rocks.\" William Sanderson lives in Burbank, California, with his wife Sharon Wix.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NjIxMjMwN15BMl5BanBnXkFtZTcwMDk1NzgzOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0761836","name":"William Sanderson","nicknames":["Bill"],"idIMDB":"nm0761836"},"actorId":"nm0761836","character":"Deuce","urlCharacter":"http://www.imdb.com/character/ch0012574","main":true},{"actorName":"Kip King","urlProfile":"http://www.imdb.com/name/nm0454966","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWRjZWQ5N2YtMjZiMy00MWI3LThiMGEtMzhhZjcyZjBkMjAxL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 August 1937","placeOfBirth":" Chicago, Illinois, USA","birthName":"Jerome Charles Kattan","bio":"Kip King was born on August 11, 1937 in Chicago, Illinois, USA as Jerome Charles Kattan. He was an actor and writer, known for A Night at the Roxbury (1998), The Smurfs (1981) and Westworld (1973). He was married to Hajnalka E. Biro. He died on July 15, 2010 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWRjZWQ5N2YtMjZiMy00MWI3LThiMGEtMzhhZjcyZjBkMjAxL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0454966","name":"Kip King","idIMDB":"nm0454966"},"actorId":"nm0454966","character":"Leo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Floyd Levine","urlProfile":"http://www.imdb.com/name/nm0505801","urlPhoto":"","biography":{"dateOfBirth":"23 February 1932","placeOfBirth":" New York, New York, USA","bio":"Floyd Levine was born on February 23, 1932 in New York, New York, USA. He is an actor, known for The Hangover (2009), Dog Day Afternoon (1975) and Norbit (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0505801","name":"Floyd Levine","idIMDB":"nm0505801"},"actorId":"nm0505801","character":"Alex","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeffrey Anderson-Gunter","urlProfile":"http://www.imdb.com/name/nm0027599","urlPhoto":"","biography":{"bio":"Jeffrey Anderson-Gunter was born in Jamaica. He is an actor, known for Naked Gun 33 1/3: The Final Insult (1994), Marked for Death (1990) and Only the Strong (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0027599","name":"Jeffrey Anderson-Gunter","idIMDB":"nm0027599"},"actorId":"nm0027599","character":"Merchant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Josh Coxx","urlProfile":"http://www.imdb.com/name/nm0185104","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNTcyMjAxN15BMl5BanBnXkFtZTgwNzU1ODA1NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1964","placeOfBirth":" Manhattan, New York City, New York, USA","height":"6' 2\" (1.88 m)","bio":"Josh Coxx is an American Actor and Director. He was born in New York City and graduated from the prestigious Actor Training Conservatory at S.U.N.Y. Purchase College alongside fellow classmate Edie Falco. His fellow alumni include Stanley Tucci, Wesley Snipes, Ving Rhames, Melissa Leo & Steven Weber. He is known for Strong Medicine (2000) Thor (2011) Babylon 5 (1994) He is also an avid Surfer and a Helicopter Rescue level 1 trained Scuba Diver.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNTcyMjAxN15BMl5BanBnXkFtZTgwNzU1ODA1NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0185104","name":"Josh Coxx","idIMDB":"nm0185104"},"actorId":"nm0185104","character":"Lt. David Corwin","urlCharacter":"http://www.imdb.com/character/ch0012585","main":true},{"actorName":"Judson Mills","urlProfile":"http://www.imdb.com/name/nm0005235","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MjMwNTgyOV5BMl5BanBnXkFtZTgwNDM2ODQ3ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 May 1969","placeOfBirth":" Washington, District of Columbia, USA","height":"6' (1.83 m)","bio":"Judson Mills was born in Washington, DC, and grew up in northern Virginia in a house built by George Washington. Washington was a young surveyor in the area and the home is a historical landmark. Mills grew up hunting and fishing, and was most interested in sports, particularly football. Judson attended High Mowing in Wilton, New Hampshire, a private school, for his junior and senior year. It is a Waldorf school and rich with history and the arts. Not until his senior year did he involve himself in the theater. He was pushed into performing in his first play and received a standing ovation for his relatively brief cameo. This approval met Judson's liking and he began pursuing a career in acting. Judson first attended Barry University, a liberal arts college in Miami, Florida, but quickly realized that training in New York was what he needed if he really wanted to succeed. He moved to Long Island with the intention of attending the prestigious American Academy of Dramatic Arts. He auditioned and was accepted. Only 250 people are accepted for the first year of their program, and of those, only 60 are asked back to the second, final year. After two years at AADA, and only two weeks before graduation, Mills was thrown. His bold, reckless personality would prove to be an asset as well as a handicap throughout his career. While being made an example of for his tardiness and absences was humbling, it also fueled his drive. Two weeks later As the World Turns (1956) called AADA looking for an actor for a summer romance storyline. They spoke to a faculty member who was a friend and fan who recommended him for the audition. Judson audition and gained the role Mills spent two and a half years on the show, laying the foundation for the rest of his career. He was then signed for an episode of Law & Order (1990). Realizing California had more career options, he left everything behind and moved to Hollywood. The cocky young actor landed a role in a made-for-TV movie starring Alyssa Milano and Jamie Luner shortly after arrival. But again, Mills brash attitude and wild personal life continued to be his worst enemies. Over the next decade, Mills appeared on upwards of 30 TV shows including NYPD Blue (1993), JAG (1995), Murder, She Wrote (1984), Beverly Hills, 90210 (1990), The X-Files (1993), and CSI: Miami (2002). He also broke into feature films, starting in independents like American Perfekt (1997) with Paul Sorvino, Robert Forester, Amanda Plummer, and David Thewlis, Joyride (1997) starring Tobey Maguire, 'Benicio DelToro', and Adam West. Judson's first starring role was as surfer/pitcher Hog Ellis, in the third installment in the Major League trilogy, Major League: Back to the Minors (1998). He also went on to work with such greats as Cuba Gooding Jr., in Chill Factor (1999), Sir Ian McKellen and Brendan Fraser in the Academy Award-nominated Gods and Monsters (1998), and Charlize Theron and Bill Paxton in Disney's Mighty Joe Young (1998). He also spent two years in Dallas with Chuck Norris filming the last 52 episodes of Walker, Texas Ranger (1993). Connection with the Norris family (Chuck, his brother Aaron, and son Eric) proved to be valuable when after finishing Walker, they continued working together filming the movie of the week The President's Man: A Line in the Sand (2002). The movie drew 16 million viewers opposite the Golden Globe Awards. Talk of a spin-off series was shelved due to 9-11. Judson lives in Los Angeles with his two sons, Jagger with wife Morgan and Dalton with ex-wife Julie. He is very close to his mother and father, who have been married nearly 40 years, as well as his brother and sister-in-law.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MjMwNTgyOV5BMl5BanBnXkFtZTgwNDM2ODQ3ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005235","name":"Judson Mills","nicknames":["J","Hollywood"],"idIMDB":"nm0005235"},"actorId":"nm0005235","character":"Delta Seven","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0121804","urlIMDB":"http://www.imdb.com/title/tt0121804","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 34 min (94 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.9","filmingLocations":[],"awards":[],"votes":"4,129","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0039264","name":"Babylonian Productions"},{"idCompany":"co0009512","name":"TNT"}],"keywords":{"keywords":["space opera","23rd century","telepathy","alien invasion","space station","outer space","alien technology","cult film","future","spacecraft","sequel","alien","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:00:29"}}