{"data":{"movies":[{"title":"Made in America","originalTitle":"","year":"1993","releaseDate":"19930528","directors":[{"name":"Richard Benjamin","id":"nm0000907"}],"writers":[{"name":"Marcia Brandwynne","id":"nm0105033"},{"name":"Nadine Schiff","id":"nm0771486"}],"runtime":"111 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjhmYzdlMmQtOWVlOC00NDI0LWFiN2YtMGE0ZTc1ZDJhOGMzL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA","France"],"languages":["English"],"genres":["Comedy"],"plot":"A young black woman discovers that her father was a sperm donor, and if that weren't bad enough, he's white.","simplePlot":"A young black woman discovers that her father was a sperm donor, and if that weren't bad enough, he's white.","actors":[{"actorName":"Whoopi Goldberg","urlProfile":"http://www.imdb.com/name/nm0000155","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4ODgzNjQwOV5BMl5BanBnXkFtZTYwNzczNzc0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1955","placeOfBirth":" New York City, New York, USA","birthName":"Caryn Elaine Johnson","height":"5' 5\" (1.65 m)","bio":"Whoopi Goldberg was born Caryn Elaine Johnson in the Chelsea section of Manhattan on November 13, 1955. Her mother, Emma (Harris), was a teacher and a nurse, and her father, Robert James Johnson, Jr., was a clergyman. Whoopi's recent ancestors were from Georgia, Florida, and Virginia. She worked in a funeral parlor and as a bricklayer while taking small parts on Broadway. She moved to California and worked with improv groups, including Spontaneous Combustion, and developed her skills as a stand-up comedienne. She came to prominence doing an HBO special and a one-woman show as Moms Mabley. She has been known in her prosperous career as a unique and socially conscious talent with articulately liberal views. Among her boyfriends were Ted Danson and Frank Langella. She was married three times and was once addicted to drugs. Goldberg first came to prominence with her starring role in The Color Purple (1985). She received much critical acclaim, and an Oscar nomination for her role and became a major star as a result. Subsequent efforts in the late 1980s were, at best, marginal hits. These movies mostly were off-beat to formulaic comedies like Pie voleuse (1987), The Telephone (1988) and Jumpin' Jack Flash (1986). She made her mark as a household name and a mainstay in Hollywood for her Oscar-winning role in the box office smash Ghost (1990). Whoopi Goldberg was at her most famous in the early 1990s, making regular appearances on Star Trek: The Next Generation (1987). She admitted to being a huge fan of the original Star Trek (1966) series and jumped at the opportunity to star in \"Star Trek: The Next Generation\". Goldberg received another smash hit role in Sister Act (1992). Her fish-out-of-water with some flash seemed to resonate with audiences and it was a box office smash. Whoopi starred in some highly publicized and moderately successful comedies of this time, including Made in America (1993) and Soapdish (1991). Goldberg followed up to her success with Sister Act 2: Back in the Habit (1993), which was well-received but did not seem to match up to the first. As the late 1990s approached, Goldberg seemed to alternate between lead roles in straight comedies such as Eddie (1996) and The Associate (1996), and took supporting parts in more independent minded movies, such as The Deep End of the Ocean (1999) and How Stella Got Her Groove Back (1998). Goldberg never forgot where she came from, hosting many tributes to other legendary entertainment figures. Her most recent movies include Rat Race (2001) and the quietly received Kingdom Come (2001). Goldberg contributes her voice to many cartoons, including The Pagemaster (1994) and Captain Planet and the Planeteers (1990), as Gaia, the voice of the earth. Alternating between big-budget movies, independent movies, tributes, documentaries, and even television movies (including Theodore Rex (1995)). Whoopi Goldberg is accredited as a truly unique and visible talent in Hollywood. Perhaps she will always be remembered as well for Comic Relief, playing an integral part in almost every benefit concert they had. Currently, Whoopi Goldberg is the center square in Hollywood Squares (1998) and frequently hosts the Academy Awards. She also is an author, with the book \"Book\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4ODgzNjQwOV5BMl5BanBnXkFtZTYwNzczNzc0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000155","name":"Whoopi Goldberg","nicknames":["Da Whoop","Shuttlehead"],"idIMDB":"nm0000155"},"actorId":"nm0000155","character":"Sarah Mathews","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ted Danson","urlProfile":"http://www.imdb.com/name/nm0001101","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwOTQzNDM3OF5BMl5BanBnXkFtZTcwODQ3MDgzMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1947","placeOfBirth":" San Diego, California, USA","birthName":"Edward Bridge Danson III","height":"6' 2\" (1.88 m)","bio":"Ted Danson is well known for his role as Sam Malone in the television series Cheers (1982). During the show's 11-year run, he was nominated nine times for an Emmy Award as Outstanding Lead Actor in a Comedy Series and won twice, in 1990 and 1993. The role also earned him a Golden Globe Award for Best Actor in a Comedy Series in 1989 and 1990. He and his wife, actress Mary Steenburgen, starred in and were executive producers of the CBS comedy series Ink (1996). Edward Bridge \"Ted\" Danson III was born in San Diego, California, to Jessica (MacMaster) and Edward Bridge Danson, Jr., who was an archaeologist and museum director. He has English, Scottish, and some German, ancestry. He was raised just outside Flagstaff, Ariz. Danson attended Stanford University, where he became interested in drama during his second year. In 1972, he transferred to Carnegie-Mellon University (formerly Carnegie Tech) in Pittsburgh. After graduation, he was hired as an understudy in Tom Stoppard's Off Broadway production of \"The Real Inspector Hound.\" Danson moved to Los Angeles in 1978 and studied with Dan Fauci at the Actor's Institute, where he also taught classes. Danson lives with his family in Los Angeles. He is a founding member of the American Oceans Campaign (AOC), an organization established to alert Americans to the life-threatening hazards created by oil spills, offshore development, toxic wastes, sewage pollution and other ocean abuses. In 1984, Danson received a Golden Globe Award for Best Actor for his performance in the television movie Something About Amelia (1984), in which he starred opposite Glenn Close. He also starred opposite Lee Remick in The Women's Room (1980). In 1986, he made his debut as a television producer with When the Bough Breaks (1986), in which he also starred. He later starred in the mini-series Gulliver's Travels (1996) and Thanks of a Grateful Nation (1998). Danson's numerous feature film credits include The Onion Field (1979), in which he made his debut as Officer Ian Campbell, Body Heat (1981), 3 Men and a Baby (1987), 3 Men and a Little Lady (1990), Cousins (1989), Dad (1989), Made in America (1993), Saving Private Ryan (1998), Mumford (1999), and Jerry and Tom (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwOTQzNDM3OF5BMl5BanBnXkFtZTcwODQ3MDgzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001101","name":"Ted Danson","idIMDB":"nm0001101"},"actorId":"nm0001101","character":"Halbert 'Hal' Jackson","urlCharacter":"http://www.imdb.com/character/ch0022804","main":true},{"actorName":"Will Smith","urlProfile":"http://www.imdb.com/name/nm0000226","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTczMzk1MjU1MV5BMl5BanBnXkFtZTcwNDk2MzAyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1968","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Willard Carroll Smith Jr.","height":"6' 2\" (1.88 m)","bio":"Willard Carroll \"Will\" Smith, Jr. (born September 25, 1968) is an American actor, comedian, producer, rapper, and songwriter. He has enjoyed success in television, film, and music. In April 2007, Newsweek called him \"the most powerful actor in Hollywood\". Smith has been nominated for five Golden Globe Awards, two Academy Awards, and has won four Grammy Awards. In the late 1980s, Smith achieved modest fame as a rapper under the name The Fresh Prince. In 1990, his popularity increased dramatically when he starred in the popular television series The Fresh Prince of Bel-Air. The show ran for six seasons (1990-96) on NBC and has been syndicated consistently on various networks since then. After the series ended, Smith moved from television to film, and ultimately starred in numerous blockbuster films. He is the only actor to have eight consecutive films gross over $100 million in the domestic box office, eleven consecutive films gross over $150 million internationally, and eight consecutive films in which he starred open at the number one spot in the domestic box office tally. Smith is ranked as the most bankable star worldwide by Forbes. As of 2014, 17 of the 21 films in which he has had leading roles have accumulated worldwide gross earnings of over $100 million each, five taking in over $500 million each in global box office receipts. As of 2014, his films have grossed $6.6 billion at the global box office. He has received Best Actor Oscar nominations for Ali and The Pursuit of Happyness. Smith was born in West Philadelphia, the son of Caroline (Bright), a Philadelphia school board administrator, and Willard Carroll Smith, Sr., a refrigeration engineer. He grew up in West Philadelphia's Wynnefield neighborhood, and was raised Baptist. He has three siblings, sister Pamela, who is four years older, and twins Harry and Ellen, who are three years younger. Smith attended Our Lady of Lourdes, a private Catholic elementary school in Philadelphia. His parents separated when he was 13, but did not actually divorce until around 2000. Smith attended Overbrook High School. Though widely reported, it is untrue that Smith turned down a scholarship to attend the Massachusetts Institute of Technology (MIT); he never applied to college because he \"wanted to rap.\" Smith says he was admitted to a \"pre-engineering [summer] program\" at MIT for high school students, but he did not attend. According to Smith, \"My mother, who worked for the School Board of Philadelphia, had a friend who was the admissions officer at MIT. I had pretty high SAT scores and they needed black kids, so I probably could have gotten in. But I had no intention of going to college.\" Smith started as the MC of the hip-hop duo DJ Jazzy Jeff & The Fresh Prince, with his childhood friend Jeffrey \"DJ Jazzy Jeff\" Townes as producer, as well as Ready Rock C (Clarence Holmes) as the human beat box. The trio was known for performing humorous, radio-friendly songs, most notably \"Parents Just Don't Understand\" and \"Summertime\". They gained critical acclaim and won the first Grammy awarded in the Rap category (1988). Smith spent money freely around 1988 and 1989 and underpaid his income taxes. The Internal Revenue Service eventually assessed a $2.8 million tax debt against Smith, took many of his possessions, and garnished his income. Smith was nearly bankrupt in 1990, when the NBC television network signed him to a contract and built a sitcom, The Fresh Prince of Bel-Air, around him. The show was successful and began his acting career. Smith set for himself the goal of becoming \"the biggest movie star in the world\", studying box office successes' common characteristics. Smith's first major roles were in the drama Six Degrees of Separation (1993) and the action film Bad Boys (1995) in which he starred opposite Martin Lawrence. In 1996, Smith starred as part of an ensemble cast in Roland Emmerich's Independence Day. The film was a massive blockbuster, becoming the second highest grossing film in history at the time and establishing Smith as a prime box office draw. He later struck gold again in the summer of 1997 alongside Tommy Lee Jones in the summer hit Men in Black playing Agent J. In 1998, Smith starred with Gene Hackman in Enemy of the State. He turned down the role of Neo in The Matrix in favor of Wild Wild West (1999). Despite the disappointment of Wild Wild West, Smith has said that he harbors no regrets about his decision, asserting that Keanu Reeves's performance as Neo was superior to what Smith himself would have achieved, although in interviews subsequent to the release of Wild Wild West he stated that he \"made a mistake on Wild Wild West. That could have been better.\" In 2005, Smith was entered into the Guinness Book of World Records for attending three premieres in a 24-hour time span. He has planned to star in a feature film remake of the television series It Takes a Thief. On December 10, 2007, Smith was honored at Grauman's Chinese Theatre on Hollywood Boulevard. Smith left an imprint of his hands and feet outside the world-renowned theater in front of many fans. Later that month, Smith starred in the film I Am Legend, released December 14, 2007. Despite marginally positive reviews, its opening was the largest ever for a film released in the United States during December. Smith himself has said that he considers the film to be \"aggressively unique\". A reviewer said that the film's commercial success \"cemented [Smith's] standing as the number one box office draw in Hollywood.\" On December 1, 2008, TV Guide reported that Smith was selected as one of America's top ten most fascinating people of 2008 for a Barbara Walters ABC special that aired on December 4, 2008. In 2008 Smith was reported to be developing a film entitled The Last Pharaoh, in which he would be starring as Taharqa. It was in 2008 that Smith starred in the superhero movie Hancock. Men in Black III opened on May 25, 2012 with Smith again reprising his role as Agent J. This was his first major starring role in four years. On August 19, 2011, it was announced that Smith had returned to the studio with producer La Mar Edwards to work on his fifth studio album. Edwards has worked with artists such as T.I., Chris Brown, and Game. Smith's most recent studio album, Lost and Found, was released in 2005. Smith and his son Jaden played father and son in two productions: the 2006 biographical drama The Pursuit of Happyness, and the science fiction film After Earth, which was released on May 31, 2013. Smith starred opposite Margot Robbie in the romance drama Focus. He played Nicky Spurgeon, a veteran con artist who takes a young, attractive woman under his wing. Focus was released on February 27, 2015. Smith was set to star in the Sci-Fic thriller Brilliance, an adaptation of Marcus Sakey's novel of the same name scripted by Jurassic Park writer David Koepp. But he left the project. Smith played Dr. Bennet Omalu of the Brain Injury Research Institute in the sports-drama Concussion, who became the first person to discover chronic traumatic encephalopathy (CTE) in a football player's brain. CTE is a degenerative disease caused by severe trauma to the head that can be discovered only after death. Smith's involvement is mostly due to his last-minute exit from the Sci-Fi thriller-drama Brilliance. Concussion was directed by Peter Landesman and-bead filmed in Pittsburgh, according to the Pittsburgh Tribune-Review. It received $14.4 million in film tax credits from Pennsylvania. Principal photography started on October 27, 2014. Actress Gugu Mbatha-Raw played his wife. Omalu served as a consultant. As of November 2015, Smith is set to star in the independent drama Collateral Beauty, which will be directed by David Frankel. Smith will play a New York advertising executive who succumbs to an deep depression after a personal tragedy. Nobel Peace Prize Concert December 11, 2009, in Oslo, Norway: Smith with wife Jada and children Jaden and Willow Smith married Sheree Zampino in 1992. They had one son, Trey Smith, born on November 11, 1992, and divorced in 1995. Trey appeared in his father's music video for the 1998 single \"Just the Two of Us\". He also acted in two episodes of the sitcom All of Us, and has appeared on The Oprah Winfrey Show and on the David Blaine: Real or Magic TV special. Smith married actress Jada Koren Pinkett in 1997. Together they have two children: Jaden Christopher Syre Smith (born 1998), his co-star in The Pursuit of Happyness and After Earth, and Willow Camille Reign Smith (born 2000), who appeared as his daughter in I Am Legend. Smith and his brother Harry own Treyball Development Inc., a Beverly Hills-based company named after Trey. Smith and his family reside in Los Angeles, California. Smith was consistently listed in Fortune Magazine's \"Richest 40\" list of the forty wealthiest Americans under the age of 40.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTczMzk1MjU1MV5BMl5BanBnXkFtZTcwNDk2MzAyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000226","name":"Will Smith","nicknames":["Fresh Prince","Mr. July"],"idIMDB":"nm0000226"},"actorId":"nm0000226","character":"Tea Cake Walters","urlCharacter":"http://www.imdb.com/character/ch0364270","main":true},{"actorName":"Nia Long","urlProfile":"http://www.imdb.com/name/nm0000505","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE0NjM4NDY3Ml5BMl5BanBnXkFtZTgwODI5Njg5MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 October 1970","placeOfBirth":" Brooklyn, New York, USA","birthName":"Nitara Carlynn Long","height":"5' 2\" (1.57 m)","bio":"Stunning pop culture icon, Hollywood leading lady and three-time NAACP award winner Nia Long returns to the big screen this fall in the highly anticipated Universal Pictures sequel The best man holiday (in theaters November 15th) where she reunites with original castmates Taye Diggs (\"Private Practice\"), Terrence Howard (Hustle & flow), Morris Chestnut (The brothers) and Harold Perrineau (\"Lost\"). Additionally in Spring 2014, Long will star in Tyler Perry's Single mom's club alongside Wendi McLendon- Covey (Bridesmaids), Tyler Perry (Madea) and Amy Smart (Crank). Early this year, Long joined the all-star cast of Showtime's \"House of Lies\" alongside Golden Globe Award winner Don Cheadle & Kristen Bell as \"Tamara,\" a business school classmate and former flame of Marty's (Don Cheadle) who has been hired by the same consulting firm Galweather Stearn after taking time off to raise a family. Long made her film debut in the poignant film portraying the social problems in inner-city Los Angeles, Boyz n the hood , and continued on to star in FRIDAY alongside Ice Cube and Chris Tucker as well as LOVE JONES which won the prestigious Audience Award at Sundance. Other notable film roles include Soul Food, Alfie opposite Jude Law, The Best man, Are We There Yet?, Big Momma's House 1 & 2 opposite Martin Lawrence, Stigmata, the Broken Hearts Club and Made in America. On the small screen, Long's portrayal of \"Officer Sasha Monroe\" on NBC's hit crime drama \"Third Watch\" awarded her two NAACP Image Awards for Outstanding Actress in a Drama series. Long's other TV accomplishments include \"The Fresh Prince of Bel-Air,\" \"Boston Legal,\" \"Judging Amy,\" and \"Big Shots.\" Long also voiced \"Roberta\" in the first season of the Fox hit \"the Cleveland Show.\" Making her directorial debut on Ashanti's music video \"Baby\" and Yolanda Adam's \"This Too Shall Pass,\" Nia continues her work behind the camera and is developing a feature film that centers on renowned world champion boxer and trainer Ann Wolfe. In addition to her film and TV work, Long's passion lies in serving her community. With her family roots planted in Trinidad, Grenada, and Barbados, Long's long term goals are to connect women in the US to those of the islands and to mentor young girls to regain their self-esteem. Additionally, Long lends her support to Black Girls Rock, an organization that promotes the arts for young women of color and encourages dialogue on the ways women of color are portrayed in the media. In 2012 she was named an official surrogate to the Barack Obama reelection campaign. A Brooklyn native, Long now calls Los Angeles home where she lives with her 12 year old son, Massai, 14 month old son, Kez and partner Ime Udoka, an Assistant Coach for the San Antonio Spurs. Long loves to cook organic farmer's market fresh meals adding a twist of her Trinidadian heritage. When she's not juggling between her career and motherhood, she enjoys staying active by doing pilates, boxing, hiking, and horseback riding. Long also finds pleasure in traveling and experiencing different cultures throughout the world. One of her favorite locations to visit is Jamaica, a place she calls her second home where she can reflect and refuel.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE0NjM4NDY3Ml5BMl5BanBnXkFtZTgwODI5Njg5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000505","name":"Nia Long","nicknames":["Nia"],"idIMDB":"nm0000505"},"actorId":"nm0000505","character":"Zora Mathews","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Rodriguez","urlProfile":"http://www.imdb.com/name/nm0735467","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNjY1NTQ4Nl5BMl5BanBnXkFtZTYwNTU2OTI4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 January 1955","placeOfBirth":" Culiacan, Sinaloa, Mexico","bio":"Friendly as all get-out, Latino stand-up comic Paul Rodriguez was born in Mexico but raised in East Los Angeles. After finishing his military service, he went to college on the GI bill with the idea of becoming an attorney, but developed an interest in comedy while taking elective courses. He honed his stand-up act at L.A.'s famous The Comedy Store while working as a doorman there, and got his break as an opening act for others at various concerts and universities and as a warm-up comic on Norman Lear's short-lived sitcom Gloria (1982) starring Sally Struthers. Lear was so impressed that he wrote and developed a sitcom specifically for Paul entitled a.k.a. Pablo (1984), which caught the public's eye only briefly. Other comedy series followed, however, including Trial and Error (1988) and Grand Slam (1990), and a few movies also came his way with D.C. Cab (1983) and Born in East L.A. (1987). Sticking to his Latino roots as the basis for his comedy, he has made an appealing crossover hit. He broke through the talk show venue with \"El Show de Paul Rodriguez\", which had a four-year run, and branched out into directing with the film A Million to Juan (1994), which he also co-wrote and starred in. More recently, he appeared with Paul Hogan in Crocodile Dundee III (2001) and had an atypical role in director Clint Eastwood's Blood Work (2002) as an arrogant, smarmy police detective. More recently, he has been visible (good or bad) in A Cinderella Story (2004), The World's Fastest Indian (2005) and Cloud 9 (2006). He also executive-produced and starred in the comedy concert film The Original Latin Kings of Comedy (2002). He has been seen everywhere on cable comedy showcases, including Paul Rodriguez: Behind Bars (1991), Crossing White Lines (1999), Paul Rodriguez Live!: I Need the Couch (1986) and Loco Slam (1994), all of which have helped him to become one of the best and best known Hispanic comics in the US. These days, Paul is known for his tireless charity work, which includes strong, avid support for the National Hispanic Scholarship Fund, Farm Aid, Leukemia Telethon, Project Literacy, and Housing Now, among many others.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNjY1NTQ4Nl5BMl5BanBnXkFtZTYwNTU2OTI4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0735467","name":"Paul Rodriguez","idIMDB":"nm0735467"},"actorId":"nm0735467","character":"Jose","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jennifer Tilly","urlProfile":"http://www.imdb.com/name/nm0000236","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQxNDI2MzA0N15BMl5BanBnXkFtZTYwOTcxOTI0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1958","placeOfBirth":" Harbor City, California, USA","birthName":"Jennifer Ellen Chan","height":"5' 7\" (1.7 m)","bio":"An actress who always attracts audiences' attention, Jennifer Tilly is by turns funny, sexy, compassionate, compelling and often all at once. Her breakthrough movie role tapped into all of those qualities failing singer Blanche \"Monica\" Moran in Steve Kloves' The Fabulous Baker Boys (1989) opposite brothers Jeff Bridges and Beau Bridges. A few years later, Jennifer earned an Academy Award nomination for her portrayal of the aspiring but hopelessly untalented actress Olive Neal in Woody Allen's Bullets Over Broadway (1994). She has become well-known to filmgoers for both major studio and independent films. In Tom Shadyac's blockbuster Liar Liar (1997), she kept pace with Jim Carrey. Her steamy performance opposite Gina Gershon helped make Lana Wachowski's and Lilly Wachowski's Bound (1996) a breakout indie success at the Sundance Film Festival and then in theatrical release. It also expanded Jennifer's already significant gay and lesbian following. She successfully cultivated another fan base with the revitalization of the \"Child's Play\" horror comedy franchise. For Ronny Yu's La fiancée de Chucky (1998), the filmmakers turned to Jennifer to create the character who would spark the series in a new direction. She met the challenge and established a new horror icon in Tiffany. This Halloween, in Rogue Pictures' all-new Le fils de Chucky (2004), written and directed by series creator Don Mancini, Jennifer again takes the popular series to the next level; she stars as Tiffany and as herself, the deadly doll's favorite actress, who soon becomes an unwitting hostess in more ways than one. Jennifer's pitch-perfect voiceover work as Tiffany is not the only instance of her being able to incarnate a character from the vocal chords out. Families know her distinctive cadences from the recent Disney hits Home on the Range (2004) (in which Jennifer voiced a new-age bovine), directed by Will Finn and John Sanford; The Haunted Mansion (2003) (in which Jennifer acted from the neck up only), directed by Rob Minkoff; and the Pixar blockbuster Monsters, Inc. (2001) (voicing Mike's love interest Celia), directed by Pete Docter, David Silverman and Lee Unkrich. She began her acting career as a teenager, putting herself through the theater program at Stephens College in Missouri by winning writing competitions. She then headed to Los Angeles, California. While she continued to act on the stage (earning a Dramalogue Award for her performance in \"Vanities\"), movies and television immediately came calling for the actress with the unique voice and visage. Over the years, Jennifer has made memorable appearances on some of television's best series, including Hill Street Blues (1981) (in a recurring dramatic role), Cheers (1982), Moonlighting (1985), It's Garry Shandling's Show. (1986) and Frasier (1993). In addition, she has been a favored guest on a number of talk shows, from The Tonight Show Starring Johnny Carson (1962) to The Arsenio Hall Show (1989) to (currently) The Tonight Show with Jay Leno (1992). Those interview segments have encouraged viewers to expect the unexpected from her interplay with the host and the studio audience. Her many films over a two-decade span include Neil Jordan's High Spirits (1988), Oliver Stone's The Doors (1991), Richard Benjamin's Made in America (1993), Roger Donaldson's The Getaway (1994), Joe Pytka's Let It Ride (1989), P.J. Castellaneta's Relax... It's Just Sex (1998), Michael Radford's Dancing at the Blue Iguana (2000), Peter Bogdanovich's The Cat's Meow (2001) (in which she played Louella Parsons). Jennifer Tilly has also continued to act on the stage. She won a Theater World Award for her performance in off-Broadway's \"One Shoe Off\" and starred on Broadway in the 2001 revival of \"The Women\" (which was later taped for, and broadcast on, PBS).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQxNDI2MzA0N15BMl5BanBnXkFtZTYwOTcxOTI0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000236","name":"Jennifer Tilly","nicknames":["The Unabombshell","Jenny"],"idIMDB":"nm0000236"},"actorId":"nm0000236","character":"Stacy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peggy Rea","urlProfile":"http://www.imdb.com/name/nm0713762","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMzM3NTAxMl5BMl5BanBnXkFtZTgwNDMyNDQ2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 March 1921","placeOfBirth":" Los Angeles, California, USA","birthName":"Margaret Rea","bio":"Peggy Rea was born on March 31, 1921 in Los Angeles, California, USA as Margaret Rea. She is known for her work on Grace Under Fire (1993), Made in America (1993) and Love Field (1992). She died on February 5, 2011 in Toluca Lake, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMzM3NTAxMl5BMl5BanBnXkFtZTgwNDMyNDQ2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0713762","name":"Peggy Rea","idIMDB":"nm0713762"},"actorId":"nm0713762","character":"Alberta","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clyde Kusatsu","urlProfile":"http://www.imdb.com/name/nm0476226","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MjQ1NzYxOF5BMl5BanBnXkFtZTcwMDQ2Nzg1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 September 1948","placeOfBirth":" Honolulu, Hawaii, USA","height":"5' 5\" (1.65 m)","bio":"Clyde Kusatsu was born on September 13, 1948 in Honolulu, Hawaii, USA. He is an actor, known for Paradise Road (1997), The Interpreter (2005) and Midway (1976). He has been married to Gayle Shuffler since August 29, 1976. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MjQ1NzYxOF5BMl5BanBnXkFtZTcwMDQ2Nzg1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0476226","name":"Clyde Kusatsu","idIMDB":"nm0476226"},"actorId":"nm0476226","character":"Bob Takashima","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Bowe","urlProfile":"http://www.imdb.com/name/nm0100762","urlPhoto":"","biography":{"dateOfBirth":"4 January 1964","placeOfBirth":" Los Angeles, California, USA","bio":"David Bowe has either appeared in or been the \"voice\" of literally hundreds of National Television and radio commercials! Beginning in 1979 as a teenager helping mom push the car out of the mud for AMC Family Wagon! Through 2016, where he continued in his 6th year as the Voice of IHOP! In between he has appeared in ads for Wendy's, Oscar Meyer, HoneyNut Cheerios, Bud Light, Eggo Waffles, Frosted Flakes, Kodak, Burger King, Ca Lottery, Jack in the Box, Blockbuster Video, Saturn Cars, Taquita Coolers not to mention the on camera spokesman for the launch of MCI friends & family and the first human to appear in the annual \"Bud Bowl\" campaign for the Super Bowl!! He has been \"heard\" by millions as the recognizable Voice of IHOP family restaurants for the past 6 & a half years! Before that recorded voice-overs for hundreds of TV & radio spots! Including, Buick, Diet Dr. Pepper, Intel, Best Buy, Cool from Nestea, AMC theaters, Old Milwaukee Beer, Comp USA and for over 10 years was one of the voices of Fred Meyer superstores located in the Pacific northwest! Not to mention over a hundred Motion Pictures and television appearances over the past 30 years!","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0100762","name":"David Bowe","idIMDB":"nm0100762"},"actorId":"nm0100762","character":"Teddy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeff Joseph","urlProfile":"http://www.imdb.com/name/nm0430617","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MDM4OTE3NF5BMl5BanBnXkFtZTgwNTA4NjA4NzE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"height":"5' 8\" (1.73 m)","bio":"Jeff Joseph was born in Roxbury, Massachusetts, USA. He is an actor and writer, known for Scrooged (1988), Roxanne (1987) and Made in America (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MDM4OTE3NF5BMl5BanBnXkFtZTgwNTA4NjA4NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0430617","name":"Jeff Joseph","idIMDB":"nm0430617"},"actorId":"nm0430617","character":"James","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rawley Valverde","urlProfile":"http://www.imdb.com/name/nm0885480","urlPhoto":"","biography":{"dateOfBirth":"1 January 1966","placeOfBirth":"","bio":"Rawley Valverde was born on January 1, 1966. He is an actor and producer, known for Santa Barbara (1984), Made in America (1993) and Nightmare Beach (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0885480","name":"Rawley Valverde","idIMDB":"nm0885480"},"actorId":"nm0885480","character":"Diego","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fred Mancuso","urlProfile":"http://www.imdb.com/name/nm0541561","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MzE0MDkxNV5BMl5BanBnXkFtZTgwNTE1MjQ5NzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1967","placeOfBirth":" Pittsburgh, Pennsylvania, USA","height":"6' 5\" (1.96 m)","bio":"Fred Mancuso is from Pittsburgh PA. One of four from a model-dancer mother and football playing engineer father. He comes from a creative and hard working family. He began singing, playing guitar, and acting at age 7. His father passed away when Fred was 12 from brain cancer. His mother worked and raised the four. He served in the US Air Force From 1986-1990 and was stationed in North Carolina until transferring to California to live with his brother in 1989. Fred's professional acting career began in 1990 when he was cast by John Frank Levey in \"Cain,\" a TV pilot with Maura Tierney, and William Morgan Sheppard, who became his mentor and coach along with actor Patrick Gorman. He was a series regular in the soap opera \"Dangerous women\"(1991) before filming 'Made in America'(1993)_ and 'Sudden Death'(1995)_. The muse then led him to stage working in Paris France on live action \"Buffalo Bill's Wild West show\" as a cowboy 1996. He returned to Los Angeles and in 1998 played \"Lee\" in the Sam Shepard play \"True west\", followed by \"Cymbeline\" with \"A Noise Within\" theater group where he interned in 1999, and the Shakespeare's \"As You Like it\" in Los Angeles with actor/ director Joel Swetow(2000). He was in rehearsals as \"Richard\" in the stage production of \"The Lion in Winter\" when September 11th 2001 happened. He enlisted that day in the US Army and left for basic training in January 2002. He participated in Operation Iraqi Freedom in 2003 with the 3rd infantry division, and following his US Army Special Forces training deployed to Iraq and Africa in 2007, 2008, 2009, and 2010. He was briefly married in 2006 and is the father of two sons born nine months apart. Both sons were born during deployments and had to overcome insurmountable odds at early ages, they are miraculous treasures, and his champions. Fred was forced to leave the Army and returned to LA and the craft in 2012. He recently filmed_'Christmas in the city'(2013)_ and played \"Finbar Skippins\" in the film_'Cockroaches'(2014)_. Fred is member of the \"The American Legion\" and the \"Veterans in Film in TV\" or \"VFT\" in Los Angeles. He continues to be outspoken encouraging vets to utilize the VA and other resources to follow their dreams and utilize a creative path in recovery from PTSD and other life/ service connected afflictions.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MzE0MDkxNV5BMl5BanBnXkFtZTgwNTE1MjQ5NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0541561","name":"Fred Mancuso","idIMDB":"nm0541561"},"actorId":"nm0541561","character":"Bruce","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charlene Fernetz","urlProfile":"http://www.imdb.com/name/nm0273127","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMDIzMTM1MV5BMl5BanBnXkFtZTcwODIwMDQ1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 March 1960","placeOfBirth":" Saskatchewan, Canada","height":"5' 8\" (1.73 m)","bio":"Charlene was born in 1960 on a large farm in the center of Saskatchewan, Canada, and studied Journalism at the British Columbia Institute of Technology; but in 1990 it was while doing regional theater in Portland, Oregon, that she caught the eye of a Manager from Los Angeles, and within months she was a guest on the Showtime series, \"Kurt Vonnegut's Monkey House,\" which took a Cable Ace Award. Shortly thereafter, she became a series regular on \"Street Justice,\" shot in Vancouver, Canada, and continued with another series in Toronto, \"The Mighty Jungle.\" Charlene was nominated for a Genie Award for Best Actress for the 1994 film, \"Harmony Cats,\" the Canadian equivalent of the Oscar. And soon after, she took home a Canadian Film Award, The Blizzard, for Best Supporting Actress for the film, \"Paris or Somewhere,\" in 1995. She played the 800-year-old, zany Aunt Zelda on the 1996 Disney movie, \"Sabrina the Teenage Witch,\" then took a hiatus to focus on family and other personal and charity endeavors. In 2004, she returned to film in \"Murder on the Yellow Brick Road\" and \"Seeking Fear,\" for which she won Best Actress at the NY Independent Film and Video Festival. Most recently she directed and co-produced 13 episodes of the children's safety show \"Keyeye.\" Still in editing, the show has already received notice from UNICEF for making an outstanding contribution to the cause of protecting children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMDIzMTM1MV5BMl5BanBnXkFtZTcwODIwMDQ1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0273127","name":"Charlene Fernetz","idIMDB":"nm0273127"},"actorId":"nm0273127","character":"Paula","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shawn Levy","urlProfile":"http://www.imdb.com/name/nm0506613","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTkyNjk4MTM0NF5BMl5BanBnXkFtZTcwNTA4MTQ5Mw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 July 1968","placeOfBirth":" Montreal, Quebec, Canada","bio":"Shawn Levy was born on July 23, 1968 in Montreal, Quebec, Canada. He is a producer and director, known for Stranger Things (2016), Real Steel (2011), and the Night at the Museum franchise. He is the founder and principal of 21 Laps Entertainment. He is married to Serena Levy and they have four daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTkyNjk4MTM0NF5BMl5BanBnXkFtZTcwNTA4MTQ5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0506613","name":"Shawn Levy","idIMDB":"nm0506613"},"actorId":"nm0506613","character":"Dwayne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lu Leonard","urlProfile":"http://www.imdb.com/name/nm0502691","urlPhoto":"","biography":{"dateOfBirth":"5 June 1926","placeOfBirth":" Long Beach, California, USA","birthName":"May Lou Price","bio":"Singer/comedy actress Lu Leonard was a plus-sized talent who came in an equally plus-sized package. Born May Lou Price in Long Beach, California on June 5, 1926, to vaudevillian parents, Lu (as she was called almost from birth) was on the road with her mom and dad as an infant. She was named after her father's sister Lulu. Her actress/mother, Amy Goodrich, was her father's second wife. Amy died in July of 1939 when Lou was only 13. Her father, \"Happy\" Hal Price, by this time had settled comfortably into Hollywood movies as a character player, finding hundreds of small roles in Republic and Monogram westerns. As a young singer and entertainer, Lu stuck with the business and advanced into more prominent roles as an adult. A short-lived marriage to another actor gave her the impetus to switch her stage moniker to \"Lu Leonard\", keeping the name even after their divorce. She eventually spent two decades in New York and brightened up Broadway with noticeable parts in \"The Pajama Game,\" \"Happiest Girl in the World,\" \"The Gay Life,\" \"Bravo Giovanni\" and \"Drat! The Cat.\" In between she went on tour with such shows as \"Plain and Fancy,\" \"The Music Man,\" \"Oliver!\" and \"Man of La Mancha.\" TV took advantage of Lu's hard-looking features and obesity after her return to the Southern California area, her fine sense of comic timing utilized in numerous guest appearances over the years. A good sport despite the fact that the laughs often came at her own expense, she was a lively, cheerful and fun-loving presence offstage in marked contrast to her somewhat hard, imposing character typecast. There were ups-and-downs and some lean years, but she tried to make the most of whatever she was given. She had a recurring role as William Conrad's wry, wise-cracking secretary in Jake and the Fatman (1987), in addition to guest parts on such series as \"Buffalo Bill\", \"Laverne & Shirley\" (1976) and \"Married... with Children\" (1987). Most of her stereotypical roles in films were small and low-brow in nature, but she did make one of her more memorable appearances in Micki + Maude (1984) really stand out. Lu's strongest fanbase came from her offbeat stage performances. She earned a devoted cult audience for her hatchet-faced prison matron in the campy L.A.-based musical spoof \"Women Behind Bars\" during the late 1980s and was a steady fixture in L.A. theater revues, musicals and comedy shows. Health problems (including diabetes) eventually set in and she left Hollywood in the mid-1990s, living primarily in Oregon. Lu eventually decided to move into the Motion Picture Country Home in Woodland Hills, California, where she spent her remaining years. She died of a heart attack on May 14, 2004 at age 77, and a bench in the Roddy McDowall garden at the Motion Picture Home has been dedicated in her memory.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0502691","name":"Lu Leonard","idIMDB":"nm0502691"},"actorId":"nm0502691","character":"Sperm Bank Nurse","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0107478","urlIMDB":"http://www.imdb.com/title/tt0107478","business":{"budget":{"money":"$22,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[],"gross":[{"money":"£5,012,291","country":"UK","day":"17","month":"10","year":"1993","remarks":""},{"money":"£4,423,231","country":"UK","day":"16","month":"09","year":"1993","remarks":""},{"money":"£823,233","country":"UK","day":"15","month":"08","year":"1993","remarks":""},{"money":"$60,000,000 (Worldwide)","country":"except","day":null,"month":null,"year":null,"remarks":null},{"money":"SEK","country":"6,042,864","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1992/\">1992</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 51 min (111 min)"],"soundMix":["Dolby SR"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA (color)"],"filmLength":["3,029 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"4.9","filmingLocations":[{"location":"Albany, California, USA"}],"rated":"PG-13","awards":[{"award":"The Stinkers Bad Movie Awards 1993","titlesAwards":[{"titleAwardOutcome":"Won Stinker Award","categories":[{"category":"Worst Actor","names":[{"name":"Ted Danson","id":"nm0001101","role":null}]}]},{"titleAwardOutcome":"Nominated Stinker Award","categories":[{"category":"Worst Actress","names":[{"name":"Whoopi Goldberg","id":"nm0000155","role":null}]}]}]}],"votes":"12,483","type":"Movie","companyCreditsSimple":[{"idCompany":"co0028557","name":"Canal+"},{"idCompany":"co0021592","name":"Regency Enterprises"},{"idCompany":"co0021159","name":"Alcor Films"}],"keywords":{"keywords":["woman","sperm donor","masturbation","single parent","interracial couple","african american","teenage girl","interracial relationship","single mother","artificial insemination","screwball comedy","irreverence","family relationships","white male black female relationship","tracking","teenager","surprise","self discovery","search","roots","race relations","paternity","mother daughter relationship","mistaken identity","identity","high school","dysfunctional family","culture clash","cross cultural relationship","comedy of manners","comedy of errors","class differences","car salesman","interracial romance","bicycle accident","biracial","sperm bank","motor car dealer","father daughter relationship","san francisco california","small shop"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:55:23"}}