{"data":{"movies":[{"title":"Clean Slate","originalTitle":"","year":"1994","releaseDate":"19940506","directors":[{"name":"Mick Jackson","id":"nm0413875"}],"writers":[{"name":"Robert King","id":"nm0455207"}],"runtime":"107 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU0NTkwMTQ0OF5BMl5BanBnXkFtZTcwNTYwMTUyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Mystery"],"plot":"Pogue is a private eye with a problem: every morning when he wakes up, he has total amnesia, waking up with a 'blank slate'. Since he is in the middle of a hot investigation and has a developing romance, this is less than convenient.","simplePlot":"A private eye who suffers total amnesia every 24h is deeply entangled in a complicated murder/theft case.","actors":[{"actorName":"Dana Carvey","urlProfile":"http://www.imdb.com/name/nm0001022","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNTE5NTQ5OF5BMl5BanBnXkFtZTcwOTkzNDgwMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 June 1955","placeOfBirth":" Missoula, Montana, USA","birthName":"Dana Thomas Carvey","height":"5' 8\" (1.73 m)","bio":"One of SNL's most talented alumni, comedian Dana Carvey reigned supreme during his six-season run creating some of the show's most memorable characters, including \"Church Lady\", \"Garth\" of Wayne & Garth fame, Grumpy Old Man and bodybuilding \"Hans\" of Hans & Franz notoriety. So it is quite bewildering that this sharp and witty writer, actor and impressionist failed to hatch a successful career in films as some of his SNL cohorts -- Mike Myers, Adam Sandler and Chris Farley -- left to do. The slightly-built, slightly dorky-looking funny guy was born in 1955 in Missoula, Montana, to Billie Dahl (McDonald) and Bud Carvey. He is of Norwegian, and smaller amounts of English, German, Swedish, and Irish, ancestry. Carvey was raised in San Carlos, California in typical middle class surroundings. His father taught high school business law and his mother, who was also a schoolteacher, had creative outlets as a painter and musician that inspired the young Dana. His gift for inducing laughter arrived at any early age. As young as 9 or 10, Dana was already mimicking characters he saw on TV, with one of his early icons being Jonathan Winters. His musical gifts came in the form of drums and guitar. While majoring in Communication Arts at San Francisco State, Dana sought out the comedy stage doing standard impressions of well-known personalities such as John Wayne, Howard Cosell and James Stewart. Within a few months he was beginning to win stand-up comedy awards. In time, however, he replaced his impersonations with self-created characterizations and such ripe forms as the Church (\"Isn't that special!\") Lady were the result. After playing various Bay Area comedy venues, Dana decided to relocate to Los Angeles in 1981 and give Hollywood a try. He quickly landed a development deal with NBC. While playing a straight foil to Mickey Rooney wasn't exactly his cup of tea, it did break him into series work as Rooney's grandson in the short-lived sitcom One of the Boys (1982). Mickey played a hip, energetic grandpa who is invited to move out of his retirement home and into the cool pad of his college-student grandson and his roommate (played by another up-and-comer, Nathan Lane). Dana joined the repertory company of Saturday Night Live (1975) in 1986, and the result was spectacular, helping to reverse the show's decline in popularity at the time. With his sharp, quicksilver characters and uncanny ability to exaggerate dead-on impersonations of the rich and famous -- from politicos George Bush and Ross Perot to entertainment's Johnny Carson, Woody Allen and Regis Philbin, Dana became the darling of the SNL set for six solid seasons. He was nominated six times for an Emmy Award, finally winning in 1993 for \"Outstanding Individual Performance in a Variety or Music Program\", and also won multiple American Comedy Awards. In the meantime he also sought out comedy film vehicles to extend his stardom, following the pathway of other successful post-SNL comics, but came up surprisingly short. In his first comedy vehicle Opportunity Knocks (1990), he unleashed his typical bag of tricks (dialects, impressions, etc.) in a tale about a con artist who falls for the daughter of one of his wealthy dupes. Audience reception was mild. Clean Slate (1994) was a retread of Bill Murray's earlier Groundhog Day (1993) about a detective who awakens every morning without any recall. Again, mild. Given a thankless role in The Road to Wellville (1994), which was not even his vehicle, the film Trapped in Paradise (1994) had him joining former SNL Jon Lovitz in another dispiriting comedy. Dana's best results on film came in tandem with Mike Myers in which the duo recreated their memorable \"party-on\" dudes Wayne and Garth from the famous SNL sketches. Wayne's World (1992) and its sequel Wayne's World 2 (1993) were box-office smashes, but it did not further Dana's film career. Other than guest cameos, his screen promise dematerialized, while his own self-titled TV comedy series, The Dana Carvey Show (1996), faltered as well. As its host, he reprised a number of his popular characters and introduced a slew of future comedians, including Steve Carell and Stephen Colbert, but the show was deemed too offensive and was canceled after only six airings. Dana's last film to date was the comedy vehicle The Master of Disguise (2002), which was executive-produced by Adam Sandler. Like most of his others, it fell flat and exited early from the theaters. Where Dana's brilliance IS captured is on the live comedy stage and in his numerous TV cable specials and standup concert appearances. To see Dana perform live is to witness an ideal blend of wit, style, personality and unrestrained, racy humor, something he was not afforded to do on film. He lives with wife Paula in Southern California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNTE5NTQ5OF5BMl5BanBnXkFtZTcwOTkzNDgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001022","name":"Dana Carvey","idIMDB":"nm0001022"},"actorId":"nm0001022","character":"Maurice L. Pogue","urlCharacter":"http://www.imdb.com/character/ch0444800","main":true},{"actorName":"Valeria Golino","urlProfile":"http://www.imdb.com/name/nm0000420","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MDAwMDk1N15BMl5BanBnXkFtZTYwNTAyNDk0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 October 1965","placeOfBirth":" Naples, Campania, Italy","height":"5' 7\" (1.7 m)","bio":"The second child of an Italian germanist and a Greek painter, Valeria Golino grew up in Naples until her parents parted. After three years in Athens with her mother and another three in Naples with her father, she began to work as a model. She left high school after her first movie and didn't study performing arts at all. In 1985 she got the leading role in Little Flames (1985) by Peter Del Monte and the next year won the Best Actress Award at the Venice Film Festival for A Tale of Love (1986). After some European co-productions (Dernier été à Tanger (1987), Les lunettes d'or (1987), Trois soeurs (1988)) she began to work in Hollywood (Big Top Pee-wee (1988)). She soon gained prominent roles in Rain Man (1988), Hot Shots! (1991) and Hot Shots! Part Deux (1993). Now she works in the US (Clean Slate (1994), An Occasional Hell (1996)), Europe (The King's Whore (1990), Immortal Beloved (1994)) and in Italy. too, especially with young directors (Come due coccodrilli (1994), Le acrobate (1997), Shooting the Moon (1998)). In 1994 she produced and acted in I sfagi tou kokora (1996) by Greek director Andreas Pantzis. Her voice is more appreciated in Hollywood (where she took speech therapy) than in Italy (where she is sometimes dubbed); in \"The Slaughter of the Cock\" she acts as a deaf and dumb woman. She speaks four languages: Italian, Greek, French and English. Her brother is a musician and their uncle Enzo Golino is a famous journalist.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MDAwMDk1N15BMl5BanBnXkFtZTYwNTAyNDk0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000420","name":"Valeria Golino","idIMDB":"nm0000420"},"actorId":"nm0000420","character":"Sarah Novak / Beth Holly","urlCharacter":"http://www.imdb.com/character/ch0444801","main":true},{"actorName":"James Earl Jones","urlProfile":"http://www.imdb.com/name/nm0000469","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNTg1MzMwM15BMl5BanBnXkFtZTcwNTQyMDgyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 January 1931","placeOfBirth":" Arkabutla, Mississippi, USA","height":"6' 1½\" (1.87 m)","bio":"James Earl Jones was born on January 17, 1931 in Arkabutla, Mississippi, USA. At an early age, he started to take dramatic lessons to calm himself down. It appeared to work as he has since starred in many films over a 40-year period, beginning with the Stanley Kubrick classic Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb (1964). He is probably best known for his role as Darth Vader in the original Star Wars trilogy (for the voice only, as the man in the Darth Vader suit was David Prowse, whose voice was dubbed because of his British West Country accent). He has appeared on the animated series The Simpsons (1989) three times and played Mufasa in The Lion King (1994). James Earl Jones returned as the voice of Darth Vader in Star Wars: Episode III - Revenge of the Sith (2005) and Rogue One (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNTg1MzMwM15BMl5BanBnXkFtZTcwNTQyMDgyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000469","name":"James Earl Jones","nicknames":["Todd"],"idIMDB":"nm0000469"},"actorId":"nm0000469","character":"John Dolby","urlCharacter":"http://www.imdb.com/character/ch0444803","main":true},{"actorName":"Kevin Pollak","urlProfile":"http://www.imdb.com/name/nm0001629","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjgzMzQzNzg0NF5BMl5BanBnXkFtZTcwMzI5NjY1OQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 October 1957","placeOfBirth":" San Francisco, California, USA","birthName":"Kevin Elliot Pollak","height":"5' 5\" (1.65 m)","bio":"Kevin Pollak was born in San Francisco in 1957, to Elaine (Klein) and Robert Pollak. A stand-up comedy performer at age 10, he turned professional comedian a decade later and was puttering around from city to city when film roles beckoned. Pollak refocused thereafter on acting in what would be a wise and profitable career move. Landing his first film role in George Lucas' Willow (1988), directed by Ron Howard, became the wind beneath his wings, and he has been sailing ever since. Critically noticed for his role in Avalon (1990), it was Rob Reiner's A Few Good Men (1992) that shot him up the credit's list. Adept at displaying smarmy and/or shady, smug characters, such showy roles in The Usual Suspects (1995) and Casino (1995) were his reward. He co-created and co-executive produced The Underworld (1997) along with actress/writer/partner/wife Lucy Webb. They also appeared together in the movies The Don's Analyst (1997) and Outside Ozona (1998). Not only starring in two of his own HBO stand-up comedy specials, Pollak returned to the live stand-up stage in 2001, headlining a sold out 20 city tour. Most recently, he co-starred with Bruce Willis and Matthew Perry in The Whole Ten Yards (2004), a sequel to the hit comedy The Whole Nine Yards (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjgzMzQzNzg0NF5BMl5BanBnXkFtZTcwMzI5NjY1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001629","name":"Kevin Pollak","idIMDB":"nm0001629"},"actorId":"nm0001629","character":"Rosenheim","urlCharacter":"http://www.imdb.com/character/ch0444804","main":true},{"actorName":"Michael Gambon","urlProfile":"http://www.imdb.com/name/nm0002091","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3OTc4MTgyN15BMl5BanBnXkFtZTcwNTAxNjA3Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 October 1940","placeOfBirth":" Cabra, Dublin, Ireland","birthName":"Michael John Gambon","height":"6' (1.83 m)","bio":"Sir Michael Gambon was born in Cabra, Dublin, Ireland, to Mary (Hoare), a seamstress, and Edward Gambon, an engineer. After joining the National Theatre, under the Artistic Directorship of Sir Laurence Olivier, Gambon went on to appear in a number of leading roles in plays written by Alan Ayckbourn. His career was catapulted in 1980 when he took the lead role in John Dexter's production of \"Galileo\". Since then, Gambon has regularly appeared at the Royal National Theatre and the RSC. Roles include, King Lear, Othello, Mark Anthony and Volpone. He was described by the late Sir Ralph Richardson as being \"The Great Gambon\" and he is now considered to be one of the British theatre's leading lights. He was made a CBE in 1992.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3OTc4MTgyN15BMl5BanBnXkFtZTcwNTAxNjA3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002091","name":"Michael Gambon","idIMDB":"nm0002091"},"actorId":"nm0002091","character":"Cornell","urlCharacter":"http://www.imdb.com/character/ch0444805","main":true},{"actorName":"Michael Murphy","urlProfile":"http://www.imdb.com/name/nm0614526","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MTIyNzAxMF5BMl5BanBnXkFtZTgwNjkzMTc5NTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1938","placeOfBirth":" Los Angeles, California, USA","birthName":"Michael George Murphy","height":"6' 1\" (1.85 m)","bio":"Michael Murphy was born in Los Angeles, California, to Georgia Arlyn (née Money), a teacher, and Bearl Branton Murphy, a salesman. After a hitch in the Marine Corps, Murphy attended the University of Arizona, Tuscon, and then went to U.C.L.A. to get his teaching credential. From 1962 to 1964, he taught high school English and drama in Los Angeles. Murphy's most notable appearance was as Woody Allen's best friend Yale, the self-tortured adulterer, in Allen's masterpiece Manhattan (1979). The two had acted together earlier in Martin Ritt's The Front (1976) and had become good friends. Surpisingly, despite the excellent performance Murphy gave in the film, Allen hasn't used him again. Murphy's career as a first-rate supporting player has continued for four decades, with major parts in Paul Mazursky's An Unmarried Woman (1978), which he calls \"the first of the whining yuppies,\" Peter Weir's L'année de tous les dangers (1982), and Oliver Stone's Salvador (1986). He also has worked with such significant directors as Elia Kazan in The Arrangement (1969), Tim Burton in Batman Returns (1992), and Paul Thomas Anderson in Magnolia (1999). Murphy recently co-starred in John Sayles' Silver City (2004), as a U.S. Senator who is the father of a gubernatorial candidate played by Oscar-winner Chris Cooper, standing-in for the pre-presidential George W. Bush. Murphy is perhaps best known for his long collaboration with director Robert Altman that stretches back to the beginning of his career. \"I was right out of the University of Arizona,\" Murphy reminisced during a 2004 interview, \"and a friend said, 'Go to Bob. He's using young guys for this Army thing.'\" Altman was directing the World War II television series Combat! (1962), and Altman cast him in the show without an audition. \"Bob took me under his wing. He told me, 'You're never going to be a movie star. But you'll do some interesting things.' Bob was maybe 35 years old when we met. He'd never play it safe. He has amazing fortitude and guts.\" In addition to Combat! (1962) and the Altman-directed TV movie Nightmare in Chicago (1964), Murphy has appeared in seven theatrical movies directed by Altman between 1968 and 1996: Countdown (1967), That Cold Day in the Park (1969), MASH (1970), Brewster McCloud (1970), McCabe & Mrs. Miller (1971), Nashville (1975), and Kansas City (1996). Murphy has also appeared in Altman's TV adaptation of Herman Wouk's play The Caine Mutiny Court-Martial (1988) and in two cable-TV mini-series for him: Tanner '88 (1988) and Tanner on Tanner (2004). About Altman, Murphy says, \"I adore the guy. If you're getting married or divorced, or someone dies, you want to talk to him about it. He's so strong, he sees the big picture. An extraordinary man.\" Murphy played the title role of Michigan Congressman Jack Tanner in Altman's ground-breaking HBO series Tanner '88 (1988), which was scripted by Garry Trudeau of \"Doonesbury\" fame. The fictional Tanner ran for president in the Democratic Party primaries of 1988, alongside George Bush (whom Murphy himself \"plays\" in Silver City (2004)), Michael Dukakis, Al Gore, and Pat Robertson, with some \"guest appearances\" by Ronald Reagan along the way. The \"candidate\" Tanner actually interacted on-camera with candidates Gary Hart, Bob Dole, and Jesse Jackson, and with the journalists Linda Ellerbee and Chris Matthews. During the progress of the series' eleven episodes, Tanner increasingly became alienated as the grueling political marathon went on. He was portrayed as an intellectual troubled by sound-bite politics and the public person he was compelled to create for the media-fueled electoral machine that vetted the candidates for the public at the other end of the cathode-ray tube. Tanner eventually realizes he lacks the all-consuming drive to be a successful presidential candidate under such a system. A caustic look at American politics from a liberal-left-anarchist point of view, \"Tanner '88\" won the prize for best television series at the Festival International de Programmes Audiovisuels in Cannes in the fall of 1988. The mini-series ranks among the best and most important of television programs. Altman-Murphy-Trudeau reprised Tanner with \"Tanner on Tanner\" (2004), in which the character did not run but commented on the political process and on the media circus accompanying the pursuit for the nation's highest office. About the new cable mini-series, Murphy says, \"Bob is showing the nastiness behind all campaigns. I don't think it's a polemic. In Bob's case, you vote for the Democrat, but be careful of what you ask for. Bob is very cynical.\" Despite decades of solid performances in a plethora of movies, Murphy remains anonymous to the public at large. Arriving in a limousine at the 2004 Toronto Film Festival premiere of Silver City (2004), he got out of the car and was unrecognized. When the publicists eventually realized he was a star of the film, Murphy was ordered back into the limousine so that he could exit it again, and the paparazzi could photograph him. \"I'm in this fun position where people don't really know who I am,\" Murphy said when recounting the incident. \"It's a good look at life. You get a perspective.\" In 1988, Michael Murphy married the co-star of his short-lived television show Hard Copy (1987), the actress Wendy Crewson. She has also appeared with her husband in Tanner '88 (1988) and in the theatrical films Folks! (1992) and Sleeping Dogs Lie (1998). They have two children, a daughter, Maggie Murphy, born in 1989, and a son, John (\"Jack\") Branton Murphy, born in 1992.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MTIyNzAxMF5BMl5BanBnXkFtZTgwNjkzMTc5NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0614526","name":"Michael Murphy","idIMDB":"nm0614526"},"actorId":"nm0614526","character":"Dr. Doover","urlCharacter":"http://www.imdb.com/character/ch0444806","main":true},{"actorName":"Jayne Brook","urlProfile":"http://www.imdb.com/name/nm0111632","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2MzE4MDQxNTFeQTJeQWpwZ15BbWU3MDYwMjk2NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1960","placeOfBirth":" Northbrook, Illinois, USA","birthName":"Jane Anderson","height":"5' 7\" (1.7 m)","bio":"Jayne Brook was born on September 16, 1960 in Northbrook, Illinois, USA as Jane Anderson. She is an actress, known for Gattaca (1997), Chicago Hope (1994) and Kindergarten Cop (1990). She has been married to John Terlesky since May 11, 1996. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2MzE4MDQxNTFeQTJeQWpwZ15BbWU3MDYwMjk2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0111632","name":"Jayne Brook","idIMDB":"nm0111632"},"actorId":"nm0111632","character":"Paula","urlCharacter":"http://www.imdb.com/character/ch0444807","main":true},{"actorName":"Vyto Ruginis","urlProfile":"http://www.imdb.com/name/nm0749490","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NjU5ODY5N15BMl5BanBnXkFtZTYwODk3NzAz._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 April 1956","placeOfBirth":" Wolverhampton, England, UK","birthName":"Vytautas Ruginis","bio":"Vyto Ruginis was born on April 17, 1956 in Wolverhampton, England as Vytautas Ruginis. He is an actor and producer, known for The Fast and the Furious (2001), Moneyball (2011) and The Devil's Advocate (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NjU5ODY5N15BMl5BanBnXkFtZTYwODk3NzAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0749490","name":"Vyto Ruginis","idIMDB":"nm0749490"},"actorId":"nm0749490","character":"Hendrix","urlCharacter":"http://www.imdb.com/character/ch0444808","main":true},{"actorName":"Olivia d'Abo","urlProfile":"http://www.imdb.com/name/nm0001882","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzkyNTE4N15BMl5BanBnXkFtZTgwNzk5MTIwNTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 January 1969","placeOfBirth":" Paddington, London, England, UK","birthName":"Olivia Jane d'Abo","height":"5' 5\" (1.65 m)","bio":"Olivia d'Abo was born on January 22, 1969 in Paddington, London, England as Olivia Jane d'Abo. She is an actress, known for The Wonder Years (1988), Conan the Destroyer (1984) and Point of No Return (1993). She was previously married to Patrick Leonard.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzkyNTE4N15BMl5BanBnXkFtZTgwNzk5MTIwNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001882","name":"Olivia d'Abo","idIMDB":"nm0001882"},"actorId":"nm0001882","character":"Judy","urlCharacter":"http://www.imdb.com/character/ch0444809","main":true},{"actorName":"Angela Paton","urlProfile":"http://www.imdb.com/name/nm0665708","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTM0Nzc3ODA5NF5BMl5BanBnXkFtZTcwNzMxMjUxOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 January 1930","placeOfBirth":" Brooklyn, New York City, New York, USA","bio":"Paton was described as a \"natural comic\" and one of the \"legends of the local stage\" of San Francisco. She is a veteran of the American Conservatory Theater (A.C.T.), and also one of A.C.T.'s leading actresses in its first few seasons. After leaving A.C.T. in the early 1970s, Paton and her husband founded and ran the Berkeley Stage Company for a number of years. Since then, she and her husband, theatre director Robert Goldsby, moved to Malibu, CA, where they lived until 2015. Paton appeared in 38 films and over 50 TV series. She also continued her decades-long run of regional theatre work across the country, including her 2014 role in the Broadway play, Harvey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTM0Nzc3ODA5NF5BMl5BanBnXkFtZTcwNzMxMjUxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0665708","name":"Angela Paton","idIMDB":"nm0665708"},"actorId":"nm0665708","character":"Shirley Pogue","urlCharacter":"http://www.imdb.com/character/ch0444810","main":true},{"actorName":"Mark Bringelson","urlProfile":"http://www.imdb.com/name/nm0109517","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTNhYjdmMzktYTMyOC00NjM1LWI5NmItMzY3YmY0YzZhMzdkL2ltYWdlXkEyXkFqcGdeQXVyMjQ1MjE1ODI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 October 1957","placeOfBirth":" Armour, South Dakota, USA","birthName":"Mark Alan Bringelson","height":"6' (1.83 m)","bio":"Mark Bringelson mostly directs, currently. He is a partner in the renegade indie production company, Moon Mile Run, which is based in Los Angeles. He works in many venues, including film, television, music video, theatre, opera, fashion, and media events. He is single, and resides in West Hollywood, California. He has an Art blog on tumblr, where he posts almost daily.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTNhYjdmMzktYTMyOC00NjM1LWI5NmItMzY3YmY0YzZhMzdkL2ltYWdlXkEyXkFqcGdeQXVyMjQ1MjE1ODI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0109517","name":"Mark Bringelson","idIMDB":"nm0109517"},"actorId":"nm0109517","character":"Bodyguard #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Meloni","urlProfile":"http://www.imdb.com/name/nm0005221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyODc0MTI2N15BMl5BanBnXkFtZTcwNDYwMjk3Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 April 1961","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Christopher Peter Meloni","height":"6' (1.83 m)","bio":"Blessed with a piercing, blue-eyed glint, brawny looks, cocky \"tough guy\" stance and effortless charisma, TV's Christopher Meloni has grabbed audiences' attention, male and female alike, finding breakthrough small screen stardom playing both sides of the law. Audiences first were taken in by his sexually arresting portrayal of a sociopathic killer in the gripping prison drama Oz (1997) on cable TV. Although his small screen roots were in 90s situation comedy, the network powers-that-be wisely discovered his power and allure as a dramatic star and quickly handed him his own prime-time crime series, Law & Order: Special Victims Unit (1999), as a not-quite-by-the-book crime detective. This one-two punch of \"Oz\" and \"Law & Order: SVU\" put Meloni, who seems to grow sexier with age, on the map and well on top, where he remains today. Christopher Peter Meloni was born on April 2, 1961, in Washington, D.C., the son of Cecile (Chagnon) and Robert Meloni, an endocrinologist. Of Italian and French-Canadian parentage, he attended St. Stephen's School and played quarterback for his high school team. Developing an interest in acting rather early in life, he attended the University of Colorado at Boulder following high school graduation. He initially majored in acting but wound up earning a degree in history in 1983. Acting won out in the long run, however, and Chris relocated to New York where he studied with acting guru Sanford Meisner at the renowned Neighborhood Playhouse. Supplementing his income during these lean years by taking advantage of his powerful physique (as construction worker, bouncer, personal trainer), Meloni worked his way up the acting ladder via parts in commercials. With a full head of hair in the early days, he broke into series TV in 1989, the first being the already-established cable football comedy 1st & Ten: The Championship (1984). In this sitcom, which was HBO's very first back in 1984, Chris played ex-con quarterback Vito Del Greco (aka \"Johnny Gunn\"). The series' star Delta Burke had already left the cast by the time Chris came aboard in its final season. A second sitcom arrived almost immediately with the stereotypical Italian family sitcom The Fanelli Boys (1990) featuring Chris as dim-eyed, skirt-chasing Frankie Fanelli, one of the four \"dees, dem and dos\" sons of Brooklynite widow Theresa Fanelli (Ann Morgan Guilbert). Despite a strong, boisterous cast, the show was painfully obvious and met an early demise. True to nature, Chris gave voice and added to the fun as a cocky, mooching high school teen who knows the \"how to's\" of attracting pretty girl dinos in the animated prehistoric series Dinosaurs (1991). He also made a manly mark in mini-movies with co-starring roles in such \"women\" dramas as In a Child's Name (1991) starring Valerie Bertinelli, Something to Live for: The Alison Gertz Story (1992), which top-lined Molly Ringwald, Without a Kiss Goodbye (1993) as the caring husband of Lisa Hartman, and the Connie Sellecca starrer A Dangerous Affair (1995). An interchangeable ability to convey both heartfelt sympathy and virile menace did not go by unnoticed. After minor parts on the big screen with Clean Slate (1994), Junior (1994) and Twelve Monkeys (1995), Chris drew strong notices in the featured role of gangster Johnnie Marzzone in the classic neo-noir Bound (1996), which earned cult status for its sexually-charged lesbian sub-storyline. A tough recurring part on \"NYPD Blue\", a typical mafia role in the mini-series The Last Don (1997) and another short-lived comedic series lead (Leaving L.A. (1997)) finally led to a big payoff in the brutal and brilliant cable series Oz (1997). Christopher's introduction to the Oz prison as bisexual psychopath Chris Keller was powerhouse casting and he drew immediate notice and critical applause into the show's second season. Unflinching in its blood-soaked presentation of life behind bars, Chris' raw animal magnetism was unparalleled on the show and his steamy, erotic couplings with another male prisoner on screen promoted him swiftly to gay icon status. Undaunted by the possible career-damaging effects that could occur, Chris' frank acceptance and acknowledgment was admirable indeed and his outright support of human rights causes earned him high marks. The father of two (daughter Sophia Eva Pietra (born March 23, 2001), and son Dante Amadeo (born January 2, 2004), he has been married since 1995 to production designer 'Sherman Williams' (The Dark Backward (1991)). Chris' sudden burst of cable notoriety earned him his own prime time NBC series. With the veteran \"Law & Order\" program developing a sister spin-off, Law & Order: Special Victims Unit (1999), Meloni raised the bar with his trenchant pairing with co-star Mariska Hargitay as partners of a special victims crime unit. Despite the show's reality-driven approach, Meloni and Hargitay's dynamite chemistry carried the show to a new level. Allowing their characters' more serious flaws to surface, Meloni, in particular, managed to convey Detective Stabler's private pain and personal turmoil with a raw poignancy. Both he and Hargitay have been honored with Emmy award nominations for their work here (she has won). Occasionally appearing on stage, Chris' theater credits include \"The Rainmaker\" (as Starbuck) (1998) and \"Comers\" (1998), both at the Williamstown Theatre Festival. He earned standout reviews as Eddie Carbone in Arthur Miller's \"A View from the Bridge,\" which he performed at Dublin's Gate Theatre in 2005. In 2006 he joined the campy proceedings at an Actors' Fund of America Benefit of the soap opera spoof \"Die, Mommie Die!\" starring drag illusionist and \"Oz\" alumnus Charles Busch. Going well over a decade's worth of service to the series that made him a household name, Meloni finally retired his TV detective in 2011. Throughout the show's run he continued to flaunt his humorous side, showing up on such parody shows as \"Mad TV\" and cracking up on the various night time TV haunts. On film he continues to shatter his dramatic image in such fare as The Souler Opposite (1998), Wet Hot American Summer (2001), Harold & Kumar Go to White Castle (2004) and its sequel Harold & Kumar Escape from Guantanamo Bay (2008). While he has not found outright stardom on the big screen (he has nominally played \"other man\" roles in such popular films as Runaway Bride (1999) and Nights in Rodanthe (2008)), Chris has more than proved his staying power since he left the popular series. More recently, he moved forward as a writer/producer/director/star of the comedy film Dirty Movie (2011), which also has in its cast \"L&O: SVU\" co-star Diane Neal. In addition, Chris supplied the voice of DC Comics classic character Hal Jordan (aka Green Lantern) in the animated movie Green Lantern: First Flight (2009). He also has held regular roles on the series True Blood (2008) in 2012 and Surviving Jack (2014) as well as strong cinematic parts in the Superman film Man of Steel (2013) and in Small Time (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyODc0MTI2N15BMl5BanBnXkFtZTcwNDYwMjk3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005221","name":"Christopher Meloni","idIMDB":"nm0005221"},"actorId":"nm0005221","character":"Bodyguard #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Timothy Scott","urlProfile":"http://www.imdb.com/name/nm0779850","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGRmY2U3MzMtMDYzNS00YTc4LWFhYmYtZmFmNDQ4MGFmYTNkXkEyXkFqcGdeQXVyMTI3MDk3MzQ@._V1_UY44_CR25,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 July 1937","placeOfBirth":" Detroit, Michigan, USA","birthName":"Timothy Christopher Scott","bio":"Tim Scott was tall and thin, who sometimes went unshaven, and because of this somewhat unsavory look he was often cast in westerns. He was born in Detroit, Michigan, but as a young boy moved with his family to Albuquerque, New Mexico. He loved the theater deeply and he became the co-founder of the \"New MET Theatre\" in Los Angeles, California, with one of his best friends, actor James Gammon. Tim died unexpectedly at the age of 57 from complications of lung cancer in Los Angeles, California, on 15 June 1995. He was a fabulous actor and is dearly missed by many.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGRmY2U3MzMtMDYzNS00YTc4LWFhYmYtZmFmNDQ4MGFmYTNkXkEyXkFqcGdeQXVyMTI3MDk3MzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0779850","name":"Timothy Scott","nicknames":["Tim"],"idIMDB":"nm0779850"},"actorId":"nm0779850","character":"Stanley","urlCharacter":"http://www.imdb.com/character/ch0444811","main":true},{"actorName":"Gailard Sartain","urlProfile":"http://www.imdb.com/name/nm0765605","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMjY4MzkwOV5BMl5BanBnXkFtZTYwNzY4MjQ3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1946","placeOfBirth":" Tulsa, Oklahoma, USA","height":"5' 8\" (1.73 m)","bio":"Graduated from the University of Tulsa with a BFA. A successful illustrator, Sartain's artistic credits range from record cover designs such as Leon Russell's \"Will O' the Wisp\" to illustrations for nationally published magazines. Sartain created and hosted Tulsa's first late night off-the-wall comedy program, \"Dr. Mazeppa Pompazoidi's Uncanny Film Festival and Camp Meeting\". Guest stars included Gary Busey and 'Jim \"Buck\" Millaway'. Following \"Dr. Mazeppa Pompazoidi's Uncanny Film Festival and Camp Meeting\", Sartain has maintained a successful acting career in television and motion pictures.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMjY4MzkwOV5BMl5BanBnXkFtZTYwNzY4MjQ3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0765605","name":"Gailard Sartain","idIMDB":"nm0765605"},"actorId":"nm0765605","character":"Judge Block","urlCharacter":"http://www.imdb.com/character/ch0444813","main":true},{"actorName":"Robert Wisdom","urlProfile":"http://www.imdb.com/name/nm0936298","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MjkyNTgwMV5BMl5BanBnXkFtZTgwOTE5NDg1MzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1953","placeOfBirth":" Washington, District of Columbia, USA","height":"6' 2\" (1.88 m)","bio":"Born and raised in Washington, DC. The middle child of three, born to Jamaican parents. Attended St. Alban's School in DC, then graduated from Columbia University in New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MjkyNTgwMV5BMl5BanBnXkFtZTgwOTE5NDg1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0936298","name":"Robert Wisdom","nicknames":["Bobby"],"idIMDB":"nm0936298"},"actorId":"nm0936298","character":"Mort","urlCharacter":"http://www.imdb.com/character/ch0444815","main":true}],"seasons":[],"idIMDB":"tt0109443","urlIMDB":"http://www.imdb.com/title/tt0109443","business":{"budget":{"money":"$18,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1993/\">1993</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 47 min (107 min)"],"soundMix":["Dolby Stereo"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA (color)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.6","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"PG-13","awards":[],"votes":"3,204","type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"},{"idCompany":"co0093750","name":"Zanuck Company, The"}],"keywords":{"keywords":["amnesia","map","men's room","tape recording","tape recorder","black bra","premarital sex","testimony","trial","deception","coin","bribe","party","doctor","los angeles california","murder witness","dog","private detective","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:23:35"}}