{"data":{"movies":[{"title":"Fantômes contre fantômes","originalTitle":"The Frighteners","year":"1996","releaseDate":"19960719","directors":[{"name":"Peter Jackson","id":"nm0001392"}],"writers":[{"name":"Fran Walsh","id":"nm0909638"},{"name":"Peter Jackson","id":"nm0001392"}],"runtime":"110 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGZlN2Q2NmYtODdjNi00NjJlLWI5NzYtN2Y5NjIzYWUxOWU5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["New Zealand","USA"],"languages":["English"],"genres":["Comedy","Fantasy","Horror"],"plot":"After a car accident in which his wife, Debra, was killed and he was injured, Frank Bannister develops psychic abilities allowing him to see, hear, and communicate with ghosts. After losing his wife, he then gave up his job as an architect, letting his unfinished \"dream house\" sit incomplete for years, and put these skills to use by befriending a few ghosts and getting them to haunt houses in the area to drum up work for his ghostbusting business; Then Frank proceeds to \"exorcise\" the houses for a fee. But when he discovers that an entity resembling the Grim Reaper is killing people, marking numbers on their forehead beforehand, Frank tries to help the people whom the Reaper is after!","simplePlot":"After a tragic car accident that kills his wife, a man discovers he can communicate with the dead to con people. However, when a demonic spirit appears, he may be the only one who can stop it from killing the living and the dead.","actors":[{"actorName":"Michael J. Fox","urlProfile":"http://www.imdb.com/name/nm0000150","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNzM0MjE4NF5BMl5BanBnXkFtZTcwMDkxMzEwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 June 1961","placeOfBirth":" Edmonton, Alberta, Canada","birthName":"Michael Andrew Fox","height":"5' 4½\" (1.64 m)","bio":"Michael J. Fox was born Michael Andrew Fox on June 9, 1961 in Edmonton, Alberta, Canada, to Phyllis Fox (née Piper), a payroll clerk, and William Fox. His parents moved their ten-year-old son, his three sisters, Kelli Fox, Karen, and Jacki, and his brother, Steven, to Vancouver, British Columbia, after his father, a sergeant in the Canadian Army Signal Corps, retired. It was during these years that Michael developed his desire to act. At age fifteen, he successfully auditioned for the role of a 10-year-old in a series called Leo and Me (1978). Gaining attention as a bright new star in Canadian television and movies, Michael realized his love for acting when he appeared on stage in \"The Shadow Box\". At age 18, he moved to Los Angeles and was offered a few roles in television series but early acting success ended fast when the roles stopped coming. For a while, he survived on boxes of macaroni and cheese. Then his agent called to tell him that he got the part of Alex P. Keaton on the situation comedy Family Ties (1982). He starred in the feature films Teen Wolf (1985), High School U.S.A. (1983), Poison Ivy (1985) and Back to the Future (1985).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNzM0MjE4NF5BMl5BanBnXkFtZTcwMDkxMzEwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000150","name":"Michael J. Fox","nicknames":["Mike"],"idIMDB":"nm0000150"},"actorId":"nm0000150","character":"Frank Bannister","urlCharacter":"http://www.imdb.com/character/ch0012784","main":true},{"actorName":"Trini Alvarado","urlProfile":"http://www.imdb.com/name/nm0000746","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMjI4NzI3OV5BMl5BanBnXkFtZTcwMTIxNTg2OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 January 1967","placeOfBirth":" New York City, New York, USA","height":"5' 7\" (1.7 m)","bio":"Trini Alvarado was born on January 10, 1967 in New York City, New York, USA. She is an actress, known for Fantômes contre fantômes (1996), Little Women (1994) and Little Children (2006). She is married to Robert McNeill. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMjI4NzI3OV5BMl5BanBnXkFtZTcwMTIxNTg2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000746","name":"Trini Alvarado","idIMDB":"nm0000746"},"actorId":"nm0000746","character":"Dr. Lucy Lynskey","urlCharacter":"http://www.imdb.com/character/ch0175115","main":true},{"actorName":"Peter Dobson","urlProfile":"http://www.imdb.com/name/nm0229930","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMDg3Nzc5NV5BMl5BanBnXkFtZTcwMjA3ODI4Nw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 July 1964","placeOfBirth":" Red Bank, New Jersey, USA","height":"6' 2\" (1.88 m)","bio":"Born in Red Bank New Jersey, Peter Dobson's illustrious acting career began at the Academy of Dramatic Arts, and the Lee Strasberg institute in New York City. Dobson went on to join the summer stock Royal Shakespeare Company in Monterey CA, and found his way to Los Angeles to began studying with acting coach Sandra Seacat. Within three years of landing in Los Angeles at the age of 21, Dobson landed his first starring role - after being chosen from a nation wide search - in the Tri-Star Pictures musical, \"Sing\", from the producers of \"Fame\" and \"Footloose\". This was followed by the critically acclaimed adaptation of Hubert Selby's \"Last Exit To Brooklyn\", and Neil Simon's \"The Marrying Man\". Director Robert Zemeckis cast Dobson in the title role of the short lived but highly acclaimed comedy TV series CBS's \"Johnny Bago\", which led to starring roles in numerous TV series and TV movies, including Michael Mann's \"Miami Vice\". A fan of Dobson's work, Mann then cast Dobson in the original version of \"HEAT\" in the highly acclaimed \"LA Takedown\". Other notable series include CBS's \"Lenny\", FOX's \"Party of Five\", HBO's \"Tales From The Crypt\" and \"Norma Jean and Marilyn\". He portrayed young Elvis Presley in Academy Award winning \"Forrest Gump\". Following that were Peter Jackson's cult classic \"The Frighteners\", and \"Drowning Mona\". With his growing popularity, Dobson was then offered the title role in the USA Network series \"Cover Me: The True Life of an FBI Family\". Following the series-run of \"Cover Me\", Dobson moved behind the camera. He Wrote and Produced the hilarious Sundance Film Festival favorite, his first film, \"Choose Life\". (A story about two hit men obsessed with the 80's pop group Wham!). He then went on to Produce his first feature \"Double Down\" starring himself and Jason Priestley. His second short film \"White Mule\", proved that Dobson is a force behind the camera as a Writer/Director, and was selected at 2013's Cannes Film Festival, among many others. And this has led to his upcoming Feature Film in Development, \"Exit 102: Asbury Park\" & Attaching Oscar nominated Cinematographer Dean Cundey. Most recently, Dobson is Exec. Producing and Starring in new TV Series in development \"Dirty Dead Con Men\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMDg3Nzc5NV5BMl5BanBnXkFtZTcwMjA3ODI4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0229930","name":"Peter Dobson","idIMDB":"nm0229930"},"actorId":"nm0229930","character":"Ray Lynskey","urlCharacter":"http://www.imdb.com/character/ch0175116","main":true},{"actorName":"John Astin","urlProfile":"http://www.imdb.com/name/nm0040014","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MjU3MzkxMF5BMl5BanBnXkFtZTYwOTEyMDI1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 March 1930","placeOfBirth":" Baltimore, Maryland, USA","birthName":"John Allen Astin","height":"5' 11\" (1.8 m)","bio":"Dark haired, usually mustachioed US actor with a cheeky grin who achieved pop culture status through his portrayal of the kooky patriarch \"Gomez Addams\" in the hit TV series The Addams Family (1964), John Astin was born March 30, 1930, in Baltimore, MD. He attended Johns Hopkins University and studied mathematics. However he discovered a passion for the theater and began performing in minor plays and doing voice-over work for commercials. He first got noticed in a small role in West Side Story (1961), then appeared in several other films before being cast as \"Gomez Addams\". While \"The Addams Family\" was initially a huge hit, its popularity petered out after two years, and Astin moved on to other work including the offbeat Bunny O'Hare (1971), playing a grizzled but not particularly bright gunfighter in the western spoof Evil Roy Slade (1972), an appearance in the Disney comedy Freaky Friday (1976) and dual roles in National Lampoon's European Vacation (1985). He has since lent his comedic talents to numerous appearances as \"Dr. Gangreen\" in several corny \"Killer Tomato\" movies, and has contributed his voice to recreate \"Gomez Addams\" in the animated series The Addams Family (1992), and then played \"Grandpa Addams\" in the short-lived TV series La nouvelle famille Addams (1998). In addition, Astin has contributed voices to several animated shows, and still regularly appears in films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MjU3MzkxMF5BMl5BanBnXkFtZTYwOTEyMDI1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0040014","name":"John Astin","idIMDB":"nm0040014"},"actorId":"nm0040014","character":"The Judge","urlCharacter":"http://www.imdb.com/character/ch0175117","main":true},{"actorName":"Jeffrey Combs","urlProfile":"http://www.imdb.com/name/nm0001062","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3Njg1NDEzN15BMl5BanBnXkFtZTcwNTk4Nzg5MQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1954","placeOfBirth":" Oxnard, California, USA","birthName":"Jeffrey Alan Combs","height":"5' 7\" (1.7 m)","bio":"Jeffrey Combs was born on September 9th, 1954 in Oxnard, California. He grew up in Lompoc, California with a plethora of siblings both older and younger. He attended the Pacific Conservatory of the Performing Arts in Santa Maria, and the Professional Actor's Training Program at the University of Washington in Seattle. He spent about four years in regional theater performing at the Old Globe Theatre in San Diego, the Arizona Theatre Company in Tucson, the California Shakespearean Festival, the Mark Taper Forum in Los Angeles and the South Coast Repertory in Costa Mesa among others. In 1980 he moved to Los Angeles, where he lives with his family. As a horror film leading actor, Combs is probably best known for portraying Herbert West in the cult horror film Re-Animator (1985). Re-Animator was based on H.P. Lovecraft's famous novel brought together by Stuart Gordon and Brian Yuzna, the producer and financier of the film. Combs stayed in the realm of cult films with both Gordon and Yuzna to return when making From Beyond (1986), and Bride of Re-Animator (1989) also from Lovecraft novels. He has also been in some supporting roles in _Pit and the Pendulum, The (1990) (V)_, the strange FBI Agent with Michael J. Fox in Fantômes contre fantômes (1996), I Still Know What You Did Last Summer (1998) and the remake of the William Castle thriller, House on Haunted Hill (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3Njg1NDEzN15BMl5BanBnXkFtZTcwNTk4Nzg5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001062","name":"Jeffrey Combs","idIMDB":"nm0001062"},"actorId":"nm0001062","character":"Milton Dammers","urlCharacter":"http://www.imdb.com/character/ch0012787","main":true},{"actorName":"Dee Wallace","urlProfile":"http://www.imdb.com/name/nm0908914","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3YmE4ZDAtYzFiOS00M2E3LThjMTItYzE1OWZhY2FiMTg2XkEyXkFqcGdeQXVyMjkxNzgyMDU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 December 1948","placeOfBirth":" Kansas City, Kansas, USA","birthName":"Deanna Lee Bowers","height":"5' 4\" (1.63 m)","bio":"This attractive, happy go lucky blonde actress, educated at the University of Kansas and a former ballet soloist, first broke into both TV and cinema screens in the mid 1970s and through her appearances in several well remembered horror and sci-fi films, and Dee quickly gained a cult following among the fantasy film fans. Poor Dee always seemed to be on the wrong side of some malevolent person or evil creature....she was pursued by a clan of cannibal killers in The Hills Have Eyes (1977), terrorized by a pack of werewolves in the superb The Howling (1981), got a break from the horror, as a sympathetic mom in the mega sci-fi hit E.T. the Extra-Terrestrial (1982), and nearly ends up lunch for a rabid St. Bernard in the heart stopping Cujo (1983). In the early 1980s, Wallace-Stone actually shared the screen several times with her then husband Christopher Stone before his unfortunate, early demise from a heart attack in October, 1995. However, typecasting Dee Wallace-Stone as a horror heroine does not do her justice, as unlike some other scream queens whose careers quickly faded, Dee has gone on to have a very busy and varied acting career, appearing in over 90 feature films to date! Her All-American looks and easy going demeanor has seen Dee often cast as a typical suburban mother, a sympathetic friend, or a trusted ally. Fans warm to her endearing smile and natural warmth, and Dee continues to find herself in constant demand in front of the camera, plus she has her own much visited website.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3YmE4ZDAtYzFiOS00M2E3LThjMTItYzE1OWZhY2FiMTg2XkEyXkFqcGdeQXVyMjkxNzgyMDU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0908914","name":"Dee Wallace","idIMDB":"nm0908914"},"actorId":"nm0908914","character":"Patricia Ann Bradley","urlCharacter":"http://www.imdb.com/character/ch0175114","main":true},{"actorName":"Jake Busey","urlProfile":"http://www.imdb.com/name/nm0000998","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjcwNTcwNDctZGRmZi00N2ZkLTk5YTUtYWY3ODEwNTk1ZDg4XkEyXkFqcGdeQXVyMjA4NTkwNjI@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 June 1971","placeOfBirth":" Los Angeles, California, USA","birthName":"William Jacob Busey","height":"6' 3\" (1.91 m)","bio":"Jake Busey is an American actor, musician and film producer. He is sometimes credited as \"Jacob Busey\". He is the son of actor Gary Busey. Busey was born in Los Angeles, and raised in Malibu, California. He spent his childhood on film sets and touring with bands in which his father played. He began considering his career choices at the age of five when he took up the two hobbies that grew into professions: acting and playing drums. His motion picture debut was in the 1978 film Straight Time (1978).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjcwNTcwNDctZGRmZi00N2ZkLTk5YTUtYWY3ODEwNTk1ZDg4XkEyXkFqcGdeQXVyMjA4NTkwNjI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000998","name":"Jake Busey","idIMDB":"nm0000998"},"actorId":"nm0000998","character":"Johnny Bartlett","urlCharacter":"http://www.imdb.com/character/ch0032453","main":true},{"actorName":"Chi McBride","urlProfile":"http://www.imdb.com/name/nm0564277","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2NDcyNTI1Ml5BMl5BanBnXkFtZTcwNTYyOTI4Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 September 1961","placeOfBirth":" Chicago, Illinois, USA","birthName":"Kenneth McBride","height":"6' 4½\" (1.94 m)","bio":"Chi McBride was born on September 23, 1961 in Chicago, Illinois, USA as Kenneth McBride. He is an actor and producer, known for The Terminal (2004), I, Robot (2004) and Boston Public (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2NDcyNTI1Ml5BMl5BanBnXkFtZTcwNTYyOTI4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0564277","name":"Chi McBride","idIMDB":"nm0564277"},"actorId":"nm0564277","character":"Cyrus","urlCharacter":"http://www.imdb.com/character/ch0012786","main":true},{"actorName":"Jim Fyfe","urlProfile":"http://www.imdb.com/name/nm0299474","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0Nzk2MjEzMV5BMl5BanBnXkFtZTgwNzgwNDIyMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"birthName":"James Michael Fyfe","bio":"Jim Fyfe was born as James Michael Fyfe. He is an actor and writer, known for Fantômes contre fantômes (1996), Moonlight Mile (2002) and Earth to Kids: A Guide to Products for a Healthy Planet (1990). He was previously married to Leslie Klein.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0Nzk2MjEzMV5BMl5BanBnXkFtZTgwNzgwNDIyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0299474","name":"Jim Fyfe","idIMDB":"nm0299474"},"actorId":"nm0299474","character":"Stuart, Bannister's Ghostly Assistant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Troy Evans","urlProfile":"http://www.imdb.com/name/nm0263283","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMjU3NjMyMl5BMl5BanBnXkFtZTgwMDUyMjE2NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 February 1948","placeOfBirth":" Missoula, Montana, USA","bio":"Troy Evans was born on February 16, 1948 in Missoula, Montana, USA. He is an actor, known for Ace Ventura: Pet Detective (1994), Piège en haute mer (1992) and ER (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMjU3NjMyMl5BMl5BanBnXkFtZTgwMDUyMjE2NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0263283","name":"Troy Evans","idIMDB":"nm0263283"},"actorId":"nm0263283","character":"Sheriff Walt Perry","urlCharacter":"http://www.imdb.com/character/ch0175159","main":true},{"actorName":"Julianna McCarthy","urlProfile":"http://www.imdb.com/name/nm0565197","urlPhoto":"","biography":{"dateOfBirth":"17 August 1929","placeOfBirth":" Erie, Pennsylvania, USA","bio":"Julianna McCarthy was born on August 17, 1929 in Erie, Pennsylvania, USA. She is an actress, known for Starship Troopers (1997), Fantômes contre fantômes (1996) and Bundy (2002). She was previously married to Michael Constantine.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0565197","name":"Julianna McCarthy","idIMDB":"nm0565197"},"actorId":"nm0565197","character":"Old Lady Bradley","urlCharacter":"http://www.imdb.com/character/ch0175160","main":true},{"actorName":"R. Lee Ermey","urlProfile":"http://www.imdb.com/name/nm0000388","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4Mzg5MjgzODleQTJeQWpwZ15BbWU3MDY4MDA5MDM@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 March 1944","placeOfBirth":" Emporia, Kansas, USA","birthName":"Ronald Lee Ermey","height":"6' (1.83 m)","bio":"A talented character actor known for his military roles, Ronald Lee Ermey was in the United States Marine Corps for 11 years. He rose to the rank of Staff Sergeant, and later was bestowed the honorary rank of Gunnery Sergeant by the Marine Corps, after he served 14 months in Vietnam and later did two tours in Okinawa, Japan. After injuries forced him to retire from the Corps, he moved to the Phillipines, enrolling in the University of Manila, where he studied Criminology and Drama. He appeared in several Filipino films before being cast as a helicopter pilot in Francis Ford Coppola's Apocalypse Now (1979). Due to his Vietnam experiences, Coppola also utilized him as a technical adviser. He got a featured role in Sidney J. Furie's Les boys de la compagnie C (1978), playing a drill instructor. Ermey worked with Furie again in Purple Hearts (1984). However, his most famous (or infamous) role came as Gunnery Sergeant Hartman in Stanley Kubrick's Full Metal Jacket (1987), for which he was nominated for a Golden Globe. He did win the best supporting actor award from The Boston Society of Film Critics. Since then, he has appeared in numerous character roles in such films as Leaving Las Vegas (1995), Se7en (1995) and Dead Man Walking (1995). However, Ermey prefers comedy to drama, and has a comedic role in Saving Silverman (2001). Ronald Lee Ermey continues to be one of the best character actors in the business, and you can bet that when his name appears in a movie's credits, he is going to be top notch in his role.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4Mzg5MjgzODleQTJeQWpwZ15BbWU3MDY4MDA5MDM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000388","name":"R. Lee Ermey","nicknames":["The Gunny"],"idIMDB":"nm0000388"},"actorId":"nm0000388","character":"Sgt. Hiles","urlCharacter":"http://www.imdb.com/character/ch0012785","main":true},{"actorName":"Elizabeth Hawthorne","urlProfile":"http://www.imdb.com/name/nm0370411","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzMxNjM0OTQ1MF5BMl5BanBnXkFtZTcwOTQwNzAxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 April 1947","placeOfBirth":" New Zealand","bio":"Elizabeth Hawthorne was born on April 30, 1947 in New Zealand. She is an actress, known for The Chronicles of Narnia: The Lion, the Witch and the Wardrobe (2005), 30 Days of Night (2007) and Underworld: Rise of the Lycans (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzMxNjM0OTQ1MF5BMl5BanBnXkFtZTcwOTQwNzAxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0370411","name":"Elizabeth Hawthorne","idIMDB":"nm0370411"},"actorId":"nm0370411","character":"Magda Rees-Jones","urlCharacter":"http://www.imdb.com/character/ch0175161","main":true},{"actorName":"Angela Bloomfield","urlProfile":"http://www.imdb.com/name/nm0089271","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTcwNmZiZTctMDYxNi00MDQ5LWE5MTYtMDlhODU5ODhjZTU2XkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 December 1972","placeOfBirth":" Auckland, New Zealand","bio":"Angela Bloomfield was born on December 16, 1972 in Auckland, New Zealand. She is an actress and director, known for Fantômes contre fantômes (1996), Shortland Street (1992) and Bonjour Timothy (1996). She has been married to Chris Houston since 2002. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTcwNmZiZTctMDYxNi00MDQ5LWE5MTYtMDlhODU5ODhjZTU2XkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0089271","name":"Angela Bloomfield","idIMDB":"nm0089271"},"actorId":"nm0089271","character":"Debra Bannister","urlCharacter":"http://www.imdb.com/character/ch0175162","main":true},{"actorName":"Desmond Kelly","urlProfile":"http://www.imdb.com/name/nm0446333","urlPhoto":"","biography":{"dateOfBirth":"1 January 1936","placeOfBirth":" Colombo, Sri Lanka","bio":"Desmond Kelly was born on January 1, 1936 in Colombo, Sri Lanka. He is an actor, known for Fantômes contre fantômes (1996), The Last Tattoo (1994) and The Landing (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0446333","name":"Desmond Kelly","idIMDB":"nm0446333"},"actorId":"nm0446333","character":"Harry Sinclair","urlCharacter":"http://www.imdb.com/character/ch0175163","main":true}],"seasons":[],"idIMDB":"tt0116365","urlIMDB":"http://www.imdb.com/title/tt0116365","business":{"budget":{"money":"$30,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$5,565,000","country":"USA","day":"21","month":"07","year":"1996","remarks":"1,669 Screens"},{"money":"£458,161","country":"UK","day":"26","month":"01","year":"1997","remarks":"105 Screens"},{"money":"DEM 26,052","country":"Germany","day":"04","month":"01","year":"1998","remarks":"10 Screens"}],"gross":[{"money":"$16,524,115","country":"USA","day":"01","month":"09","year":"1996","remarks":""},{"money":"$16,289,845","country":"USA","day":"25","month":"08","year":"1996","remarks":""},{"money":"$15,959,645","country":"USA","day":"18","month":"08","year":"1996","remarks":""},{"money":"$15,351,655","country":"USA","day":"11","month":"08","year":"1996","remarks":""},{"money":"$13,866,000","country":"USA","day":"04","month":"08","year":"1996","remarks":""},{"money":"$10,791,000","country":"USA","day":"28","month":"07","year":"1996","remarks":""},{"money":"$5,565,000","country":"USA","day":"21","month":"07","year":"1996","remarks":""},{"money":"$12,600,000 (Worldwide)","country":"except","day":null,"month":null,"year":null,"remarks":null},{"money":"ITL 513,282,000","country":"Italy","day":"08","month":"06","year":"1997","remarks":""},{"money":"ITL 375,773,000","country":"Italy","day":"01","month":"06","year":"1997","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1998/\">1998</a>"},{"money":"10,420","country":"Netherlands","day":"31","month":"12","year":"1998","remarks":""},{"money":"10,303","country":"Netherlands","day":"01","month":"01","year":"1998","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1995/\">1995</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 50 min (110 min)","2 hr 3 min (123 min) (director's cut) (USA)"],"soundMix":["DTS","DTS-Stereo"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex Cameras and Lenses"],"laboratory":["Film Unit, Avalon, New Zealand (color)"],"filmLength":["3,018 m (Sweden)","3,071 m"],"negativeFormat":["35 mm (Eastman)"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"7.1","filmingLocations":[{"location":"Camperdown Studios, Camperdown Road, Miramar, Wellington, New Zealand"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1997","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Horror Film","names":[]},{"category":"Best Actor","names":[{"name":"Michael J. Fox","id":"nm0000150","role":null}]},{"category":"Best Supporting Actor","names":[{"name":"Jeffrey Combs","id":"nm0001062","role":null}]},{"category":"Best Director","names":[{"name":"Peter Jackson","id":"nm0001392","role":null}]},{"category":"Best Writer","names":[{"name":"Fran Walsh","id":"nm0909638","role":null},{"name":"Peter Jackson","id":"nm0001392","role":null}]},{"category":"Best Music","names":[{"name":"Danny Elfman","id":"nm0000384","role":null}]},{"category":"Best Make-Up","names":[{"name":"Rick Baker","id":"nm0000711","role":null},{"name":"Richard Taylor","id":"nm0853050","role":null}]},{"category":"Best Special Effects","names":[{"name":"Wes Takahashi","id":"nm0847208","role":null},{"name":"Charlie McClellan","id":"nm0565740","role":null},{"name":"Richard Taylor","id":"nm0853050","role":null}]}]}]},{"award":"International Horror Guild 1997","titlesAwards":[{"titleAwardOutcome":"Nominated IHG Award","categories":[{"category":"Best Movie","names":[]}]}]},{"award":"Sitges - Catalonian International Film Festival 1996","titlesAwards":[{"titleAwardOutcome":"Won Best Special Effects","categories":[{"category":"","names":[{"name":"Richard Taylor","id":"nm0853050","role":null}]}]},{"titleAwardOutcome":"Nominated Best Film","categories":[{"category":"","names":[{"name":"Peter Jackson","id":"nm0001392","role":null}]}]}]}],"votes":"70,478","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"},{"idCompany":"co0046203","name":"WingNut Films"}],"keywords":{"keywords":["ghost","grim reaper","hell","fbi","black comedy","two word title","supernatural horror","serial killer","haunted house","architect","hospital","blood","bed","con artist","mansion","fence","soul","cemetery","funeral","loss of wife","death of wife","anti hero","false accusation","museum","car crash","scythe","widow","astral projection","title spoken by character","judge","female journalist","psychopathic cop","talking to a ghost","friendship","passing through a wall","shotgun","matricide","cult film","supernatural power","widower"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:52:59"}}