{"data":{"movies":[{"title":"Dracula: Dead and Loving It","originalTitle":"","year":"1995","releaseDate":"19951222","directors":[{"name":"Mel Brooks","id":"nm0000316"}],"writers":[{"name":"Mel Brooks","id":"nm0000316"},{"name":"Rudy De Luca","id":"nm0209918"}],"runtime":"88 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWQ0ZDFmYzMtZGMyMi00NmYxLWE0MGYtYzM2ZGNhMTE1NTczL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjM5ODMxODc@._V1.jpg","countries":["USA","France"],"languages":["English","German"],"genres":["Comedy","Fantasy","Horror"],"plot":"Another spoof from the mind of Mel Brooks. This time he's out to poke fun at the Dracula myth. Basically, he took \"Bram Stoker's Dracula,\" gave it a new cast and a new script and made a big joke out of it. The usual, rich English are attacked by Dracula and Dr. Van Helsing is brought in to save the day.","simplePlot":"Mel Brooks' parody of the classic vampire story and its famous film adaptations.","actors":[{"actorName":"Leslie Nielsen","urlProfile":"http://www.imdb.com/name/nm0000558","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MTE1NjM4N15BMl5BanBnXkFtZTYwNzI3MTI0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 February 1926","placeOfBirth":" Regina, Saskatchewan, Canada","birthName":"Leslie William Nielsen","height":"6' 1½\" (1.87 m)","bio":"Leslie William Nielsen was born in Regina, Saskatchewan, and raised in Tulita (formerly Fort Norman), Northwest Territories. His mother, Mabel Elizabeth (Davies), was Welsh. His father, Ingvard Eversen Nielsen, was a Danish-born Mountie and a strict disciplinarian. Leslie studied at the Academy of Radio Arts in Toronto before moving on to New York's Neighborhood Playhouse. His acting career started at a much earlier age when he was forced to lie to his father in order to avoid severe punishment. Leslie starred in over fifty films and many more television films. One of his two brothers became the Deputy Prime Minister of Canada. In 2002, he was made an Officer of the Order of Canada in recognition of his contributions to the film and television industries. Leslie Nielsen died at age 84 of complications from pneumonia on November 28, 2010.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MTE1NjM4N15BMl5BanBnXkFtZTYwNzI3MTI0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000558","name":"Leslie Nielsen","idIMDB":"nm0000558"},"actorId":"nm0000558","character":"Dracula","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter MacNicol","urlProfile":"http://www.imdb.com/name/nm0001493","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTI1MzMzMTA0MV5BMl5BanBnXkFtZTgwOTQ1ODE0NjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1954","placeOfBirth":" Dallas, Texas, USA","height":"5' 8\" (1.73 m)","bio":"Peter MacNicol was born on April 10, 1954 in Dallas, Texas, USA. He is an actor, known for Sophie's Choice (1982) and Ally McBeal (1997). He has been married to Martha Sue Cumming since October 11, 1986.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTI1MzMzMTA0MV5BMl5BanBnXkFtZTgwOTQ1ODE0NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001493","name":"Peter MacNicol","idIMDB":"nm0001493"},"actorId":"nm0001493","character":"Renfield","urlCharacter":"http://www.imdb.com/character/ch0002581","main":true},{"actorName":"Steven Weber","urlProfile":"http://www.imdb.com/name/nm0001836","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NTM4NjYwNV5BMl5BanBnXkFtZTcwNDc0MzY1Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1961","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Steven Robert Weber","height":"6' 1\" (1.85 m)","bio":"This Queens-born actor has certainly proven himself adept at everything from quirky comedy to flat-out melodrama. Born on March 4, 1961, to a Borscht Belt comic and a nightclub singer, Weber was already appearing in TV commercials by elementary school age. He later studied at the High School of the Performing Arts in New York and graduated from New York State University. The fair-haired, fair-skinned actor worked a series of menial jobs during his salad days as a struggling thespian (custodian, elevator operator, singing waiter) until earning his break on TV in a presentation of one of Mark Twain's stories. Quickly making his film debut in the popular comedy The Flamingo Kid (1984), he nabbed a running role on the soap opera As the World Turns (1956) a year later. On the set he met first wife Finn Carter, another co-star on the daytime drama. Steven stayed put for a year then went on to gain recognition in more offbeat and/or prestigious productions on film and primetime TV. He played a rock star in the thoroughly offbeat foreign-made film Los ángeles (1990) and showed real command as John F. Kennedy in the epic miniseries The Kennedys of Massachusetts (1990). That same year TV stardom came his way with the sitcom Wings (1990). Co-starring with Tim Daly as Brian Hackett, the looser, goofier more aimless half of the brotherly team who co-owned a one-plane, Nantucket-based airline, the actors' chemistry, not to mention a terrifically eclectic supporting cast, kept the show on a steady course for seven seasons. Easily typed now as a genial, lovable loser type, Weber faced the prospect of severe pigeon-holing. So during the show's off season, he started showing up in more serious roles. He suffered at the hands of the deranged Jennifer Jason Leigh in Single White Female (1992); appeared in a second chiller with The Temp (1993); and made a cameo in the highly depressing, award-winning Leaving Las Vegas (1995). He truly impressed both critics and audiences alike as the complex title character in Jeffrey (1995), a gay romantic film comedy, and then completely defied all odds by starring in an epic TV-movie version of Stephen King's horror classic The Shining (1997), seizing the role inherited from Jack Nicholson and brilliantly making it his own while earning a Saturn award for his chilling efforts. By the time \"Wings\" came to an end in 1997, Weber had divorced wife Finn (they had no children) and married actress/TV executive Juliette Hohnen. The couple married on July 9, 1995 and have since had two children, Jack and Alfie. Since then Steven has remained quite productive. He and Laura Linney were selected to play the TV-movie leads in the popular A.R. Gurney theater piece Love Letters (1999). While other TV series comebacks have fared less well, including the short runs of The Weber Show (2000) and The D.A. (2004), Steven bounced back in other venues. In 2002, he joined the cast of the smash Broadway musical \"The Producers,\" taking over the nebbish Matthew Broderick role. In 2004, he went to London to appear on stage with Kevin Spacey and Mary Stuart Masterson in \"National Anthems.\" Other plays over the years have included \"Throwing Your Voice,\" \"Something in the Air\" and \"Design for Living.\" In addition to giving voice occasionally to a few animated film and TV characters, he returned fruitfully to Stephen King territory in 2006 with two major TV projects.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NTM4NjYwNV5BMl5BanBnXkFtZTcwNDc0MzY1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001836","name":"Steven Weber","idIMDB":"nm0001836"},"actorId":"nm0001836","character":"Harker","urlCharacter":"http://www.imdb.com/character/ch0002556","main":true},{"actorName":"Amy Yasbeck","urlProfile":"http://www.imdb.com/name/nm0001865","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNjMyODk0MF5BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1962","placeOfBirth":" Cincinnati, Ohio, USA","birthName":"Amy Marie Yasbeck","height":"5' 7\" (1.7 m)","bio":"Amy Yasbeck was born on September 12, 1962 in Cincinnati, Ohio, USA as Amy Marie Yasbeck. She is an actress, known for The Mask (1994), Pretty Woman (1990) and Sacré Robin des Bois (1993). She was previously married to John Ritter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNjMyODk0MF5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001865","name":"Amy Yasbeck","idIMDB":"nm0001865"},"actorId":"nm0001865","character":"Mina","urlCharacter":"http://www.imdb.com/character/ch0002558","main":true},{"actorName":"Lysette Anthony","urlProfile":"http://www.imdb.com/name/nm0000771","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3ODAwMTkwMF5BMl5BanBnXkFtZTYwNzY3MDE1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 September 1963","placeOfBirth":" Fulham, London, England, UK","birthName":"Lysette Anne Chodzko","height":"5' 5½\" (1.66 m)","bio":"Lysette Anthony was born on September 26, 1963 in Fulham, London, England as Lysette Anne Chodzko. She is an actress and producer, known for Krull (1983), Dracula: Dead and Loving It (1995) and Look Who's Talking Now (1993). She was previously married to Simon Boswell, David Price and Luc Leestemaker.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3ODAwMTkwMF5BMl5BanBnXkFtZTYwNzY3MDE1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000771","name":"Lysette Anthony","idIMDB":"nm0000771"},"actorId":"nm0000771","character":"Lucy","urlCharacter":"http://www.imdb.com/character/ch0002563","main":true},{"actorName":"Harvey Korman","urlProfile":"http://www.imdb.com/name/nm0466327","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NDMzMzc5NV5BMl5BanBnXkFtZTcwMzA2NjM3MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 February 1927","placeOfBirth":" Chicago, Illinois, USA","birthName":"Harvey Herschel Korman","height":"6' 3½\" (1.92 m)","bio":"Harvey Korman was a lanky, popular TV comedy veteran with a flair for broad comic characterizations, who shone for a decade as leading man and second banana par excellence on The Carol Burnett Show (1967) but failed to find much success in his own projects. Harvey Herschel Korman was born in Chicago, Illinois, to Ellen (Blecher) and Cyril Raymond Korman, a salesman. His parents, both immigrants, were from Russian Jewish families. A persistent TV presence since the early 1960s, Korman's first big break was a stint as a featured performer on The Danny Kaye Show (1963), a lively musical variety series. Here Korman began working in the format which he would soon master--providing sturdy support to a multi-talented star in a wide variety of comedy sketches. Boasting large, expressive features and a wonderfully mutable voice, Korman could play a wide assortment of characters. Perhaps his first classic characterization was provided for The Flintstones (1960) wherein he was the distinctively snooty voice of The Great Gazoo, a little helmeted space man from the future consigned to the Earth's past in punishment for his crimes. Korman garnered four Emmys for his work with Carol Burnett over the years. Her show never recovered from his departure in 1977 to pursue other projects. Ironically Korman would never again find such a successful showcase for his talents though he certainly tried, appearing in several busted pilots and short-lived sitcoms. Like 'Dan Aykroyd', a later somewhat comparable talent, he fared best in sketch comedy. Almost exclusively a comic actor, he stretched a bit to play straight man Bud Abbott opposite Buddy Hackett's Lou Costello in the disappointing TV biopic Bud and Lou (1978). Korman also directed and/or produced sitcom episodes and TV comedy specials. An occasional actor in films, Korman made his feature debut with a supporting role in The Last of the Secret Agents? (1966). Several film roles followed until he gained his widest exposure with a major supporting role in 'Mel Brooks''s classic Western spoof Blazing Saddles (1974). Korman also fared well in Brooks' High Anxiety (1977) and History of the World: Part I (1981). Korman acted in two 1994 features: the blockbuster live-action version of The Flintstones (1994) (providing the voice of the Dictabird) and the poorly received but lavishly produced Radioland Murders (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NDMzMzc5NV5BMl5BanBnXkFtZTcwMzA2NjM3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0466327","name":"Harvey Korman","nicknames":["Mr.Happy Go-Lucky","Harv"],"idIMDB":"nm0466327"},"actorId":"nm0466327","character":"Dr. Seward","urlCharacter":"http://www.imdb.com/character/ch0002567","main":true},{"actorName":"Mel Brooks","urlProfile":"http://www.imdb.com/name/nm0000316","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzUzMjk5MzQ5Nl5BMl5BanBnXkFtZTgwNzk4Njc5NjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1926","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Melvin James Kaminsky","height":"5' 5\" (1.65 m)","bio":"Mel Brooks was born Melvin Kaminsky on June 28, 1926 in Brooklyn, New York. He served in WWII, and afterwards got a job playing the drums at nightclubs in the Catskills. Brooks eventually started a comedy act and also worked in radio and as Master Entertainer at Grossinger's Resort before going to television. He was a writer for, Your Show of Shows (1950) Caesar's Hour (1954) and wrote the Broadway show Shinbone Alley. He also worked in the creation of The 2000 Year Old Man (1975) and Get Smart (1965) before embarking on a highly successful film career in writing, acting, producing and directing. Brooks is famous for the spoofs of different film genres that he made such as Blazing Saddles (1974), History of the World: Part I (1981), Silent Movie (1976), Young Frankenstein (1974), Sacré Robin des Bois (1993), High Anxiety (1977), Dracula: Dead and Loving It (1995), and Spaceballs (1987).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzUzMjk5MzQ5Nl5BMl5BanBnXkFtZTgwNzk4Njc5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000316","name":"Mel Brooks","idIMDB":"nm0000316"},"actorId":"nm0000316","character":"Professor Van Helsing","urlCharacter":"http://www.imdb.com/character/ch0002557","main":true},{"actorName":"Mark Blankfield","urlProfile":"http://www.imdb.com/name/nm0087578","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMDQ5NTE3MV5BMl5BanBnXkFtZTcwNDU5NTk5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 May 1950","placeOfBirth":" Pasadena, Texas, USA","bio":"Mark Blankfield was born on May 8, 1950 in Pasadena, Texas, USA. He is an actor, known for Sacré Robin des Bois (1993), Dracula: Dead and Loving It (1995) and Jekyll and Hyde... Together Again (1982).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMDQ5NTE3MV5BMl5BanBnXkFtZTcwNDU5NTk5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0087578","name":"Mark Blankfield","idIMDB":"nm0087578"},"actorId":"nm0087578","character":"Martin","urlCharacter":"http://www.imdb.com/character/ch0226601","main":true},{"actorName":"Megan Cavanagh","urlProfile":"http://www.imdb.com/name/nm0146903","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4Mzg3NDc5N15BMl5BanBnXkFtZTYwMzM0ODE4._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 November 1960","placeOfBirth":" Chicago, Illinois, USA","bio":"Megan Cavanagh was born on November 8, 1960 in Chicago, Illinois, USA. She is an actress, known for A League of Their Own (1992), Jimmy Neutron: Boy Genius (2001) and Sacré Robin des Bois (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4Mzg3NDc5N15BMl5BanBnXkFtZTYwMzM0ODE4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0146903","name":"Megan Cavanagh","idIMDB":"nm0146903"},"actorId":"nm0146903","character":"Essie","urlCharacter":"http://www.imdb.com/character/ch0226602","main":true},{"actorName":"Clive Revill","urlProfile":"http://www.imdb.com/name/nm0720890","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODEwODI0N15BMl5BanBnXkFtZTcwNDMwODYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1930","placeOfBirth":" Wellington, New Zealand","birthName":"Clive Selsby Revill","height":"5' 7\" (1.7 m)","bio":"A grand, well-respected actor of stage, film and television, most people think New Zealander Clive Revill is British. Although most people think of the curly, red-haired gent as a comic eccentric best known for his sterling work on the musical stage, he has been highly regarded for his formidable dramatic work in Shakespearean roles. A man of many skills, Clive Selsby Revill was born on April 18, 1930, in Wellington, New Zealand, and educated at Rongotai College and Victoria University (Wellington). Once trained for a career as an accountant, he abruptly switched gears and made his stage debut in Auckland, New Zealand playing Sebastian in \"Twelfth Night\" in 1950. He then moved to England to study with the Old Vic School in London. While there he appeared at Stratford-on-Avon in mid-1950s presentations of \"Hamlet\", \"Love's Labour's Lost\", \"The Merchant of Venice\", \"Julius Caesar\" and \"The Tempest\", among others. Having made his Broadway debut back in 1952 with \"Mr. Pickwick\", he took a juicy chunk out of the Big Apple upon returning to New York in the 1960s with his critically lauded, Tony Award-nominated work in \"Irma La Douce\" and as \"Fagin\" in \"Oliver!\" He has delighted audiences for years with his larger-than-life musical roles, particularly in the Gilbert and Sullivan operettas \"The Mikado\" and \"The Pirates of Penzance\". Other have included \"Sherry\", \"Lolita\" and \"The Mystery of Edwin Drood\" -- replacing the late George Rose in the last mentioned after the actor's untimely death in 1988. Most adept at ethnic roles (he has played everything from Chinese to Russian), he has become legendary for his acute sense of comic timing and uncanny use of body language. Revill has reveled over the years playing delightfully pompous, hissable gents to the hilt. Making an inauspicious debut in an unbilled role in 1956, his more pronounced movie work includes Kaleidoscope (1966), The Assassination Bureau (1969), The Private Life of Sherlock Holmes (1970), Avanti! (1972), for which he received a Golden Globe nomination, The Legend of Hell House (1973), Mack the Knife (1989) and Sacré Robin des Bois (1993). Twice divorced, Revill has one daughter, Kate Selsby (aka Kate Selsby Revill), by his second marriage to Suzi Schor-Revill, and makes his home in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODEwODI0N15BMl5BanBnXkFtZTcwNDMwODYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0720890","name":"Clive Revill","idIMDB":"nm0720890"},"actorId":"nm0720890","character":"Sykes","urlCharacter":"http://www.imdb.com/character/ch0226603","main":true},{"actorName":"Chuck McCann","urlProfile":"http://www.imdb.com/name/nm0564841","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNTc1NTI4M15BMl5BanBnXkFtZTYwMzc5MDQ0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 September 1934","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"6' 3\" (1.91 m)","bio":"A third generation performer, Chuck McCann was already a show business veteran by age 11. By age 19, he had performed in nightclubs, made guest TV appearances, and was a semi-regular on The Steve Allen Show. Chuck's extensive career includes The Chuck McCann Show, Let's Have Fun Show, Little Orphan Annie, The World of Hans Christian Anderson, Herbie Rides Again, Men in Tights, Storyville. His credits also include creating, writing and starring in the popular children's shows Far Out Space Nuts, and Chuck McCann's Funstuff. Chuck now performs voices for several animated shows where he does the voices of Duckworth and The Beagle Boys for Ducktails, the series, and Ducktails: The Movie, Leatherneck on G.I. Joe, The Thing on Fantastic Four and Blizzard on Iron Man.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNTc1NTI4M15BMl5BanBnXkFtZTYwMzc5MDQ0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0564841","name":"Chuck McCann","nicknames":["Jack Frost","Jackie McCann"],"idIMDB":"nm0564841"},"actorId":"nm0564841","character":"Innkeeper","urlCharacter":"http://www.imdb.com/character/ch0226604","main":true},{"actorName":"Avery Schreiber","urlProfile":"http://www.imdb.com/name/nm0775213","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NDg2OTU5Nl5BMl5BanBnXkFtZTcwMDg5NDYwOA@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1935","placeOfBirth":" Chicago, Illinois, USA","bio":"His 1960s and 1970s partner on the comedy stage was Jack Burns, the slimmer, chatty, clean-cut, better-looking dunderhead. Avery Schreiber was the Oliver Hardy counterpart who bore the brunt of Burns' verbal drone. This rumpled, gap-toothed, hefty-sized master of the slow boil stood out among the crowd with his huge trademark walrus mustache, thick thatch of curly black hair, slim teddy bear eyes and mischievous grin. Together the pair became a staple of TV variety shows, mainstays on such classic entertainment as \"The Ed Sullivan Show,\" \"The Dean Martin Show\" and \"The Hollywood Palace.\" Born in 1935 in Chicago, Illinois, of modest means, Schreiber's father was a common laborer while his mother made do as a secretary. At 17 Schreiber enlisted in the Armed Services and eventually became a part of the All-Army Talent Show. This satisfaction of putting on variety shows and entertaining prompted his move into a career of comedy. Winning a scholarship to the Pasadena Playhouse, he instead decided to stay closer to home and attend night school at the University of Chicago while studying his craft at the Goodman Theatre. A cabaret show brought him to the attention of the renown improv troupe Second City in 1960, where he remained for five years developing sketches and characters. It was here that Schreiber met Burns, a former Boston news anchorman, in 1962. The Irish/Jewish duo began performing together on cruise ships and elsewhere. Jack Paar first introduced \"Burns & Schreiber\" to TV on his \"Tonight Show\" program in 1964. The duo's most identifiable skit was the \"taxi cab\" routine with Avery as a beleaguered cabbie at the mercy of Burns' relentlessly gabby and nonsensical customer, with Burns punctuating every conversation with a repeated \"Huh?...Huh?...Huh?\" Political satire was also a strong, popular platform for Schreiber both with Burns (the album \"The Watergate Comedy Hour\") and without. Schreiber was at his very best skewering politicos. Both trained actors, they also gave each other the freedom to work solo. Burns would repeat as Deputy Warren Ferguson on The Andy Griffith Show (1960) for a time and Schreiber was a regular as the broadly villainous Captain Mancini on My Mother the Car (1965), now better known as the Edsel of 60s TV shows. At their peak, they appeared as regulars on the summer replacement musical variety series Our Place (1967), then earned the right to front their own summer series with The Burns and Schreiber Comedy Hour (1973). It was hard to figure out who in this duo was the funnyman and who was the straightman although Avery was considered the more reactive of the two. Breaking up once in 1968 because they felt stale, they reteamed for a time in 1972, but split again later when Burns decided to leave the limelight and devote himself exclusively to writing. Schreiber continued providing guest comedy relief on \"Alice,\" \"The Rockford Files\" and \"The Dukes of Hazzard\" and sitting on game show panels. He also kept close ties to the stage throughout his career. Directing a Broadway revue entitled \"How to Be a Jewish Mother\" in 1967, he performed in (Second City) Paul Sills' production of \"Ovid's Metamorphosis.\" Schreiber also performed in productions of \"Hamlet,\" \"Showboat\" and \"Fiddler on the Roof.\" He last appeared on Broadway in \"Welcome to the Club\" in 1989, which was a short-lived Cy Coleman musical. Households knew him best for his various Doritos corn chip ads in a sundry of disguises (chef, sultan, pilot), all of them perturbed by people loudly crunching on the popular snack. In addition to acting, Schreiber taught improv theater in and out of his L.A.-based area. In 1994, Schreiber suffered a heart attack, aggravated by his diabetes. Although he survived triple by-pass surgery, he never fully recovered. He died at age 66 in Los Angeles of a heart attack and was survived by his wife of 40 years, Rochelle Isaacs, and their two children, Jenny and Joshua.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NDg2OTU5Nl5BMl5BanBnXkFtZTcwMDg5NDYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0775213","name":"Avery Schreiber","idIMDB":"nm0775213"},"actorId":"nm0775213","character":"Peasant on Coach","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cherie Franklin","urlProfile":"http://www.imdb.com/name/nm0291386","urlPhoto":"","biography":{"bio":"Cherie Franklin is known for her work on Doctor Dolittle (1998), Drag Me to Hell (2009) and Dracula: Dead and Loving It (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0291386","name":"Cherie Franklin","idIMDB":"nm0291386"},"actorId":"nm0291386","character":"Peasant on Coach","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ezio Greggio","urlProfile":"http://www.imdb.com/name/nm0339619","urlPhoto":"","biography":{"dateOfBirth":"7 April 1954","placeOfBirth":" Cossato, Piedmont, Italy","height":"5' 10¾\" (1.8 m)","bio":"Ezio Greggio was born on April 7, 1954 in Cossato, Piedmont, Italy. He is an actor and producer, known for The Silence of the Hams (1994), Y a-t-il un flic pour sauver l'humanité? (2000) and Giovanna's Father (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0339619","name":"Ezio Greggio","idIMDB":"nm0339619"},"actorId":"nm0339619","character":"Coach Driver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leslie S. Sachs","urlProfile":"http://www.imdb.com/name/nm0755169","urlPhoto":"","biography":{"bio":"Leslie S. Sachs is an actress, known for Dracula: Dead and Loving It (1995), The Flamingo Kid (1984) and Scorned (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0755169","name":"Leslie S. Sachs","idIMDB":"nm0755169"},"actorId":"nm0755169","character":"Usherette","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0112896","urlIMDB":"http://www.imdb.com/title/tt0112896","business":{"budget":{"money":"$30,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"£432,489","country":"UK","day":"13","month":"12","year":"1996","remarks":""},{"money":"£430,890","country":"UK","day":"08","month":"12","year":"1996","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1996/\">1996</a>"},{"money":"16,822","country":"Portugal","day":"01","month":"08","year":"1996","remarks":""},{"money":"9,220","country":"Portugal","day":"25","month":"07","year":"1996","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1995/\">1995</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 28 min (88 min)"],"soundMix":["Dolby","SDDS (8 channels)","Dolby SR"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Panaflex"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":["2,609 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5,8","filmingLocations":[{"location":"Culver Studios - 9336 W. Washington Blvd., Culver City, California, USA"}],"rated":"PG-13","awards":[],"votes":"31 699","type":"Movie","companyCreditsSimple":[{"idCompany":"co0178269","name":"Gaumont"},{"idCompany":"co0040620","name":"Castle Rock Entertainment"},{"idCompany":"co0000858","name":"Brooksfilms"}],"keywords":{"keywords":["dracula","vampire","insane asylum","spoof","human versus vampire","blood splatter","vampire comedy","19th century","written and directed by cast member","jumping through a window","breaking a mirror","drink thrown into someone's face","ball","dancing","covered in blood","grave","hung upside down","garlic","undead","poked in the eye","burned alive","park","dream sequence","fainting","hospital","corpse","doctor","grasshopper","spider","climbing through a window","shapeshifting","assistant","fiance fiancee relationship","father daughter relationship","opera","slave","face slap","character repeating someone else's dialogue","skull","blood on shirt","finger cut","spider web","stepping in shit","shadow","castle","cross","gypsy","village","sunset","horse carriage","transylvania","london england","bitten in the neck","order","immortality","wig","ship","seduction","pallor","1890s","theater","sanitarium","organ","maidservant","full moon","fangs","coachman","broken mirror","trance","love","hypnotism","eternal","bride","stabbed in the heart","loss of friend","insect","hypnosis","hammer","falling from height","falling down stairs","exploding body","enema","death","cleavage","brain","bat","autopsy","seductive dance","vampirism","vampire bite","cult film","coffin","blood","vampire bat","horror spoof","character name in title","intestines"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:53:23"}}