{"data":{"movies":[{"title":"Mickey's Surprise Party","originalTitle":"","year":"1939","releaseDate":"19390218","writers":[],"runtime":"5 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzdhOTIxYjctYTNmNS00NzE1LTk0OTktNDBlZjIwYzJiYmI5XkEyXkFqcGdeQXVyMDM0MzU2NA@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation","Short"],"plot":"Minnie is baking cookies. When she leaves for a short while, her dog Fifi accidentally drops popcorn kernels in the dough. Mickey and Pluto come over and visit with Minnie and Fifi. When Mickey notices that something is burning, Minnie remembers the cookies, which are popping popcorn out of them. Minnie is upset and lies on her sofa crying. Mickey goes out and buys a large amount of cookies. He comes back and shows them to her and she is overjoyed.","simplePlot":"Minnie is baking cookies. When she leaves for a short while, her dog Fifi accidentally drops popcorn kernels in the dough. Mickey and Pluto come over and visit with Minnie and Fifi. When ... ","actors":[{"actorName":"Walt Disney","urlProfile":"http://www.imdb.com/name/nm0000370","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMTUyNjc5OF5BMl5BanBnXkFtZTcwMjMwNjYwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 December 1901","placeOfBirth":" Chicago, Illinois, USA","birthName":"Walter Elias Disney","height":"5' 10\" (1.78 m)","bio":"Walter Elias Disney was born on December 5, 1901 in Chicago, Illinois, the son of Flora Disney (née Call) and Elias Disney, a Canadian-born farmer and businessperson. He had Irish, German, and English ancestry. Walt moved with his parents to Kansas City at age seven, where he spent the majority of his childhood. At age 16, during World War I, he faked his age to join the American Red Cross. He soon returned home, where he won a scholarship to the Kansas City Art Institute. There, he met a fellow animator, Ub Iwerks. The two soon set up their own company. In the early 1920s, they made a series of animated shorts for the Newman theater chain, entitled \"Newman's Laugh-O-Grams\". Their company soon went bankrupt, however. The two then went to Hollywood in 1923. They started work on a new series, about a live-action little girl who journeys to a world of animated characters. Entitled the \"Alice Comedies\", they were distributed by M.J. Winkler (Margaret). Walt was backed up financially only by Winkler and his older brother Roy O. Disney, who remained his business partner for the rest of his life. Hundreds of \"Alice Comedies\" were produced between 1923 and 1927, before they lost popularity. Walt then started work on a series around a new animated character, Oswald the Lucky Rabbit. This series was successful, but in 1928, Walt discovered that M.J. Winkler and her husband, Charles Mintz, had stolen the rights to the character away from him. They had also stolen all his animators, except for Ub Iwerks. While taking the train home, Walt started doodling on a piece of paper. The result of these doodles was a mouse named Mickey. With only Walt and Ub to animate, and Walt's wife Lillian Disney (Lilly) and Roy's wife Edna Disney to ink in the animation cells, three Mickey Mouse cartoons were quickly produced. The first two didn't sell, so Walt added synchronized sound to the last one, Steamboat Willie (1928), and it was immediately picked up. With Walt as the voice of Mickey, it premiered to great success. Many more cartoons followed. Walt was now in the big time, but he didn't stop creating new ideas. In 1929, he created the 'Silly Symphonies', a cartoon series that didn't have a continuous character. They were another success. One of them, Flowers and Trees (1932), was the first cartoon to be produced in color and the first cartoon to win an Oscar; another, Three Little Pigs (1933), was so popular it was often billed above the feature films it accompanied. The Silly Symphonies stopped coming out in 1939, but Mickey and friends, (including Minnie Mouse, Donald Duck, Goofy, Pluto, and plenty more), were still going strong and still very popular. In 1934, Walt started work on another new idea: a cartoon that ran the length of a feature film. Everyone in Hollywood was calling it \"Disney's Folly\", but Blanche Neige et les sept nains (1937) was anything but, winning critical raves, the adoration of the public, and one big and seven little special Oscars for Walt. Now Walt listed animated features among his ever-growing list of accomplishments. While continuing to produce cartoon shorts, he also started producing more of the animated features. Pinocchio (1940), Dumbo (1941), and Bambi (1942) were all successes; not even a flop like Fantasia (1940) and a studio animators' strike in 1941 could stop Disney now. In the mid 1940s, he began producing \"packaged features\", essentially a group of shorts put together to run feature length, but by 1950 he was back with animated features that stuck to one story, with Cendrillon (1950), Alice au pays des merveilles (1951), and Peter Pan (1953). In 1950, he also started producing live-action films, with Treasure Island (1950). These began taking on greater importance throughout the 50s and 60s, but Walt continued to produce animated features, including La belle et le clochard (1955), Sleeping Beauty (1959), and 101 Dalmatians (1961). In 1955, he even opened a theme park in southern California: Disneyland. It was a place where children and their parents could take rides, just explore, and meet the familiar animated characters, all in a clean, safe environment. It was another great success. Walt also became one of the first producers of films to venture into television, with his series Walt Disney's Wonderful World of Color (1954) which he began in 1954 to promote his theme park. He also produced The Mickey Mouse Club (1955) and Zorro (1957). To top it all off, Walt came out with the lavish musical fantasy Mary Poppins (1964), which mixed live-action with animation. It is considered by many to be his magnum opus. Even after that, Walt continued to forge onward, with plans to build a new theme park and an experimental prototype city in Florida. He never did finish those plans, however; in 1966, he developed lung cancer brought on by his lifelong chain-smoking. He died in the hospital on December 15, 1966 at age 65. But not even his death, it seemed, could stop him. Roy carried on plans to build the Florida theme park, and it premiered in 1971 under the name Walt Disney World. What's more, his company continues to flourish, still producing animated and live-action films and overseeing the still- growing empire started by one man: Walt Disney, who will never be forgotten.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMTUyNjc5OF5BMl5BanBnXkFtZTcwMjMwNjYwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000370","name":"Walt Disney","nicknames":["Uncle Walt"],"idIMDB":"nm0000370"},"actorId":"nm0000370","character":"Mickey Mouse","urlCharacter":"http://www.imdb.com/character/ch0000630","main":true},{"actorName":"Marcellite Garner","urlProfile":"http://www.imdb.com/name/nm0307732","urlPhoto":"","biography":{"dateOfBirth":"3 July 1910","placeOfBirth":" Redlands, California, USA","birthName":"Edna Marcellite Garner","bio":"Marcellite Garner was born on July 3, 1910 in Redlands, California, USA as Edna Marcellite Garner. She was an actress, known for Mickey's Rival (1936), The Birthday Party (1931) and Mickey Steps Out (1931). She was married to Harry Abraham Lincoln and Richard Bruce Wall. She died on July 26, 1993 in Grass Valley, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0307732","name":"Marcellite Garner","idIMDB":"nm0307732"},"actorId":"nm0307732","character":"Minnie Mouse","urlCharacter":"http://www.imdb.com/character/ch0000681","main":true},{"actorName":"Clarence Nash","urlProfile":"http://www.imdb.com/name/nm0621699","urlPhoto":"","biography":{"dateOfBirth":"7 December 1904","placeOfBirth":" Watonga, Oklahoma, USA","birthName":"Clarence Charles Nash","height":"5' 2\" (1.57 m)","bio":"Clarence Nash was born on December 7, 1904 in Watonga, Oklahoma, USA as Clarence Charles Nash. He was an actor, known for The Three Caballeros (1944), Mickey and the Beanstalk (1947) and Mickey's Christmas Carol (1983). He was married to Margaret Seamans. He died on February 20, 1985 in Glendale, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0621699","name":"Clarence Nash","nicknames":["Ducky","Charlie Nash"],"idIMDB":"nm0621699"},"actorId":"nm0621699","character":"Pluto","urlCharacter":"http://www.imdb.com/character/ch0027779","main":true}],"seasons":[],"idIMDB":"tt0168072","urlIMDB":"http://www.imdb.com/title/tt0168072","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["5 min (USA)"],"soundMix":["Mono"],"color":["Color (Technicolor)"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"6.6","filmingLocations":[],"awards":[],"votes":"184","type":"Movie","companyCreditsSimple":[{"idCompany":"co0098836","name":"Walt Disney Productions"}],"keywords":{"keywords":["popcorn","fifi","baking cookies","crying","baking","dog","golden gate international exposition 1939 1940","new york world's fair 1939 1940","expo film","world's fair","howling","cookie","burned food","advertisement","mouse","cartoon mouse","cartoon dog","anthropomorphism","anthropomorphic animal","pluto the character","reference to minnie mouse","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:37:04"}}