{"data":{"movies":[{"title":"A Perfect World","originalTitle":"","year":"1993","releaseDate":"19931124","directors":[{"name":"Clint Eastwood","id":"nm0000142"}],"writers":[{"name":"John Lee Hancock","id":"nm0359387"}],"runtime":"138 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjcyYmU1NzYtMmJiYy00NjJlLWE5ZjMtZWNkOWNjZmQ4MzIyXkEyXkFqcGdeQXVyNTI4MjkwNjA@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama","Thriller"],"plot":"After escaping from a Huntsville prison, convict Butch Haynes and his partner Terry Pugh kidnap a young boy, Philip Perry, and flee across Texas. As they travel together, Butch and Philip discover common bonds and suffer the abuses of the outside \"Perfect World.\" In pursuit is Texas Ranger \"Red\" Garnett and criminologist Sally Gerber.","simplePlot":"A kidnapped boy strikes up a friendship with his captor: an escaped convict on the run from the law, headed by an honorable U.S. Marshal.","actors":[{"actorName":"Kevin Costner","urlProfile":"http://www.imdb.com/name/nm0000126","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MDU1OTEyNF5BMl5BanBnXkFtZTgwNjI0MTk2MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 January 1955","placeOfBirth":" Lynwood, California, USA","birthName":"Kevin Michael Costner","height":"6' 1\" (1.85 m)","bio":"Kevin Michael Costner was born on January 18, 1955 in Lynwood, California, the third child of Bill Costner, a ditch digger and ultimately an electric line servicer for Southern California Edison, and Sharon Costner (née Tedrick), a welfare worker. His older brother, Dan, was born in 1950. A middle brother died at birth in 1953. His father's job required him to move regularly, which caused Kevin to feel like an Army kid, always the new kid at school, which led to him being a daydreamer. As a teen, he sang in the Baptist church choir, wrote poetry, and took writing classes. At 18, he built his own canoe and paddled his way down the rivers that Lewis & Clark followed to the Pacific. Despite his present height, he was only 5'2\" when he graduated high school. Nonetheless, he still managed to be a basketball, football and baseball star. In 1973, he enrolled at California State University at Fullerton, where he majored in business. During that period, Kevin decided to take acting lessons five nights a week. He graduated with a business degree in 1978 and married his college sweetheart, Cindy Costner. He initially took a marketing job in Orange County. Everything changed when he accidentally met Richard Burton on a flight from Mexico. Burton advised him to go completely after acting if that is what he wanted. He quit his job and moved to Hollywood soon after. He drove a truck, worked on a deep sea fishing boat, and gave bus tours to stars' homes before finally making his own way into the films. After making one soft core sex film, he vowed to not work again if that was the only work he could do. He didn't work for nearly six years, while he waited for a proper break. That break came with The Big Chill (1983), even though his scenes ended up on the cutting room floor -- he was remembered by director Lawrence Kasdan when he decided to make Silverado (1985). Costner's career took off after that.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MDU1OTEyNF5BMl5BanBnXkFtZTgwNjI0MTk2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000126","name":"Kevin Costner","idIMDB":"nm0000126"},"actorId":"nm0000126","character":"Robert 'Butch' Haynes","urlCharacter":"http://www.imdb.com/character/ch0013980","main":true},{"actorName":"Clint Eastwood","urlProfile":"http://www.imdb.com/name/nm0000142","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDc0MjY0OV5BMl5BanBnXkFtZTcwNzU1MDAxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1930","placeOfBirth":" San Francisco, California, USA","birthName":"Clinton Eastwood Jr.","height":"6' 4\" (1.93 m)","bio":"Perhaps the icon of macho movie stars, and a living legend, Clint Eastwood has become a standard in international cinema. Born May 31, 1930 in San Francisco, the elder of two children in a middle-class family, Eastwood stayed in high school until the comparatively late age of nineteen and worked menial jobs over a period of several years before enrolling at Los Angeles City College, from which he dropped out after two semesters to pursue acting. He found uncredited bit parts in such nondescript B-films as Revenge of the Creature (1955) and Tarantula (1955) during the mid-'50s while simultaneously digging swimming pools for a living, until he got his first breakthrough in the long-running TV series Rawhide (1959) with Eric Fleming. Though only a secondary player in the early seasons, Clint made the show his own by end of its run and became a recognizable face to television viewers around the country. Eastwood found much bigger and better things in Italy with the excellent spaghetti westerns A Fistful of Dollars (1964) and For a Few Dollars More (1965). But it was the third installment in the trilogy where he found one of his signature roles: The Good, the Bad and the Ugly (1966). The movie was a big hit and he became an instant international star. Clint's first American-made western, Hang 'Em High (1968), was yet again a success, and he followed it up with another starring role in Coogan's Bluff (1968) (the loose inspiration to the TV series McCloud (1970)) before playing second fiddle to Richard Burton in the World War II epic Where Eagles Dare (1968) and Lee Marvin in the bizarre musical Paint Your Wagon (1969). In Sierra torride (1970) and Kelly's Heroes (1970), Eastwood went in an experimental direction by combining tough-guy action with offbeat humor. 1971 proved to be one of his best years in film, if not the best. He starred in The Beguiled (1971) and the classic thriller Play Misty for Me (1971), but it was his role as the hard edge police inspector in Dirty Harry (1971) that gave Eastwood one of his signature roles and invented the loose-cannon cop genre that has been imitated even to this day. Eastwood did a fairly consistent quality of work thereafter with the road movies Thunderbolt and Lightfoot (1974) and The Gauntlet (1977), the Dirty Harry sequels Magnum Force (1973) and The Enforcer (1976), the westerns Joe Kidd (1972), High Plains Drifter (1973) and The Outlaw Josey Wales (1976) (his first of six onscreen collaborations with then live-in love Sondra Locke), and the fact-based thriller Escape from Alcatraz (1979). In 1978 he branched out into the comedy genre in Every Which Way But Loose (1978), which became the biggest hit of his career up to that time; taking inflation into account, it still is. In short, notwithstanding The Eiger Sanction (1975), the '70s were an uninterrupted continuation of success. Eastwood kicked off the '80s with Any Which Way You Can (1980), the blockbuster sequel to Every Which Way But Loose. The fourth Dirty Harry film, Sudden Impact (1983), was the highest-grossing film of the franchise and spawned the character's trademark catchphrase, \"Make my day\". Clint also starred in Bronco Billy (1980), Firefox (1982), Tightrope (1984), City Heat (1984), Pale Rider (1985) and Heartbreak Ridge (1986), all of which were solid hits, with Honkytonk Man (1982) being his only commercial failure of the period. In 1988 he did his fifth and final Dirty Harry movie, The Dead Pool (1988). Although it was a success overall, it did not have the box office punch the previous films had. About this time, with outright bombs like Pink Cadillac (1989) and The Rookie (1990), it became apparent that Eastwood's star was declining as it never had before. He then started taking on more personal projects, such as directing Bird (1988), a biopic of Charlie Parker, and starring in and directing White Hunter Black Heart (1990), an uneven, loose biopic of John Huston. Eastwood bounced back in a big way with his western Unforgiven (1992), which garnered the then 62-year-old his first ever Academy Award nomination (Best Actor) and win for Best Director. Following up with a quick hit, he took on the secret service in In the Line of Fire (1993), then accepted second billing to Kevin Costner in the interesting but poorly received drama A Perfect World (1993). Next up was a love story, The Bridges of Madison County (1995), where Clint surprised audiences with a sensitive performance, but it soon became apparent he was going backwards after his brief revival. Subsequent films were credible, but nothing really stuck out. Among them were the moderately well-received Absolute Power (1997) and Space Cowboys (2000) as well as the badly received True Crime (1999) and Blood Work (2002). But Eastwood surprised yet again, returning to the top of the A-list with the hugely successful boxing drama Million Dollar Baby (2004). The movie earned him an Oscar for Best Director and a Best Actor nomination for the second time. Behind the camera, he had big successes directing the multi-award-winners Mystic River (2003), Flags of Our Fathers (2006), Letters from Iwo Jima (2006) and Changeling (2008) which starred Angelina Jolie. His next starring vehicle, Gran Torino (2008), earned $30 million in its opening weekend, proving his box office appeal has not waned. Eastwood has managed to keep his extremely convoluted personal life top secret and never discusses his families with the media. He had a long time relationship with frequent co-star Locke and has at least eight children by at least six other women, although he has only been married twice. Clint Eastwood lives in Los Angeles and owns homes in Monterey, Northern California, Idaho and Hawaii.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDc0MjY0OV5BMl5BanBnXkFtZTcwNzU1MDAxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000142","name":"Clint Eastwood","idIMDB":"nm0000142"},"actorId":"nm0000142","character":"Chief Red Garnett","urlCharacter":"http://www.imdb.com/character/ch0013979","main":true},{"actorName":"Laura Dern","urlProfile":"http://www.imdb.com/name/nm0000368","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NzY0MDQxMF5BMl5BanBnXkFtZTcwNzMwMzcyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1967","placeOfBirth":" Saint John's Health Center, Santa Monica, Los Angeles County, California, USA","birthName":"Laura Elizabeth Dern","height":"5' 10½\" (1.79 m)","bio":"Laura Dern was born on February 10, 1967 in Los Angeles, the daughter of actors Bruce Dern and Diane Ladd. Dern was exposed to movie sets and the movie industry from infancy, and obtained several bit parts as a child. Her parents divorced when Dern was two and Dern lost contact with her father for several years as a result. Her parents' background and her own early taste of the moviemaking world soon convinced the young Dern to pursue acting herself. Like so many young actors, her decision may have been influenced by social awkwardness -- the child of 60s counterculture parents, she was steeped in Eastern mysticism and political radicalism, and was seen as an oddball by her more conservative classmates. Her gawky physical appearance didn't help - even before her teens, she had achieved most of her impressive 5' 10\" height, was rail-skinny (other than precociously wide hips), had huge feet and a slouching posture, and for all this was often teased by classmates. Perhaps the nine-year-old Dern found refuge by studying acting at the Lee Strasberg Theater Institute. The first success for the young Dern came in 1980, with a role in Adrian Lyne's Foxes (1980), a teen movie starring Jodie Foster. She followed this with several small parts, or parts in small movies, such as Ladies and Gentlemen, the Fabulous Stains (1982) and Teachers (1984), as a student who has an affair with a teacher. (Her mother objected to her active presence on movie sets at age thirteen, which required Dern to sue for emancipation so she could play her role in \"The Fabulous Stains\"). Her next roles, as the blind girl who befriends the deformed boy in Mask (1985), and as a teenaged girl whose sexual awakening collides with a mysterious older man in Smooth Talk (1985), gave her career an important boost. Dern appeared to have made it with a leading role in David Lynch's acclaimed Blue Velvet (1986), but it was four years before her next notable film, and this was the bizarre Wild at Heart (1990), also directed by Lynch. The following year, Dern starred in Rambling Rose (1991), which would become her signature performance, as a sexually-precocious, free-spirited young housemaid in the South in the 1930s. Dern earned an Oscar nomination for her performance, and so did her mother and co-star, Diane Ladd. Dern continues to win prominent roles on the big screen, often in smaller, highly-regarded human dramas such as October Sky (1999), I Am Sam (2001) and We Don't Live Here Anymore (2004), although she is perhaps most widely known for her repeat role as Ellie Sattler in the summer adventure movies Jurassic Park (1993) and Jurassic Park III (2001), or for her guest performance on Ellen (1994), as the woman to whom Ellen finally comes out as a lesbian. Dern's pre-teen gawkiness matured into lithe beauty, but this doesn't prevent Dern from fearlessly throwing herself into a wide variety of roles which are sometimes unflattering, an excellent example being her unflinchingly comic portrayal of an intensely annoying loser whose pregnancy becomes a social and political football in Citizen Ruth (1996). This results in Dern being one of the most interesting actors working in Hollywood today. Having previously dated such Hollywood talent as Treat Williams, Renny Harlin, Kyle MacLachlan, Jeff Goldblum and Billy Bob Thornton, Dern eventually married musician Ben Harper in 2005. Early in her career, Dern was roommate to Marianne Williamson, the spirituality guru. Dern attended two days of college at UCLA and one semester at USC.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NzY0MDQxMF5BMl5BanBnXkFtZTcwNzMwMzcyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000368","name":"Laura Dern","idIMDB":"nm0000368"},"actorId":"nm0000368","character":"Sally Gerber","urlCharacter":"http://www.imdb.com/character/ch0013981","main":true},{"actorName":"T.J. Lowther","urlProfile":"http://www.imdb.com/name/nm0412901","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NDc5OTYwOV5BMl5BanBnXkFtZTcwMzc5MTUyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 May 1986","placeOfBirth":" Salt Lake City, Utah, USA","bio":"T.J. Lowther was born on May 17, 1986 in Salt Lake City, Utah, USA. He is an actor, known for A Perfect World (1993), A Home of Our Own (1993) and Mad Love (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NDc5OTYwOV5BMl5BanBnXkFtZTcwMzc5MTUyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0412901","name":"T.J. Lowther","idIMDB":"nm0412901"},"actorId":"nm0412901","character":"Phillip 'Buzz' Perry","urlCharacter":"http://www.imdb.com/character/ch0561023","main":true},{"actorName":"Keith Szarabajka","urlProfile":"http://www.imdb.com/name/nm0843775","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDk4NzQzMDQ2N15BMl5BanBnXkFtZTcwNDc1NTA4Mg@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 December 1952","placeOfBirth":" Oak Park, Illinois, USA","height":"5' 8\" (1.73 m)","bio":"Keith Szarabajka was born on December 2, 1952 in Oak Park, Illinois, USA. He is an actor and writer, known for The Dark Knight (2008), Argo (2012) and A Perfect World (1993). He was previously married to Jennifer Jay Stewart.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDk4NzQzMDQ2N15BMl5BanBnXkFtZTcwNDc1NTA4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0843775","name":"Keith Szarabajka","idIMDB":"nm0843775"},"actorId":"nm0843775","character":"Terry Pugh","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leo Burmester","urlProfile":"http://www.imdb.com/name/nm0122238","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NTM1OTcwNl5BMl5BanBnXkFtZTcwNzE5OTMwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 February 1944","placeOfBirth":" Louisville, Kentucky, USA","birthName":"Bernard Leo Burmester","bio":"Leo appeared in thirty-seven films, thirty-two television appearances and nine Broadway plays. He just completed a part on M. O. N. Y. directed by Spike Lee for NBC, and the revival of The Fantasticks off Broadway. He was nominated for Best Actor in Robert Altman's Rattlesnake in a Cooler (1982) and won the New York Fanny award for Best supporting actor in Ah Wilderness at New York's Lincoln Center. Leo produced concerts for Save The Lakes, an environmental effort to protect New York City's water supply and along with his wife Lora Lee Ecobelli, produced Calm The Storm a concert to benefit the victims of Hurricane Katrina with over one hundred volunteers, and one hundred bands on five stages both indoor and out. Leo's Art work is featured in the documentary: Leo Burmester and The Literature of Junk, which won best documentary at the Westchester Film Festival, and he is featured in the May 2007 issue of Hudson Valley Magazine.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NTM1OTcwNl5BMl5BanBnXkFtZTcwNzE5OTMwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0122238","name":"Leo Burmester","idIMDB":"nm0122238"},"actorId":"nm0122238","character":"Tom Adler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Hewitt","urlProfile":"http://www.imdb.com/name/nm0382070","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWI1MWNlMWQtOWZkMi00MDA4LWI4ZjUtOTM0NGU3MDljYzQxXkEyXkFqcGdeQXVyNzcyNTI5Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Paul Hewitt is an actor, known for A Perfect World (1993), The Player (1992) and Ed (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWI1MWNlMWQtOWZkMi00MDA4LWI4ZjUtOTM0NGU3MDljYzQxXkEyXkFqcGdeQXVyNzcyNTI5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0382070","name":"Paul Hewitt","idIMDB":"nm0382070"},"actorId":"nm0382070","character":"Dick Suttle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bradley Whitford","urlProfile":"http://www.imdb.com/name/nm0925966","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NTIzNjc3Ml5BMl5BanBnXkFtZTYwNjgxNTA2._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1959","placeOfBirth":" Madison, Wisconsin, USA","height":"5' 11\" (1.8 m)","bio":"Bradley Whitford's credits in film, television and theater include work with some of the most noted writers, directors and playwrights in the arts, and constitute a career worthy of a Juilliard-trained actor -- which he is. But stardom is something else altogether, and it remained elusive, at least until 1999 and his appearance on NBC's acclaimed political drama, The West Wing (1999). Bradley Whitford was born in Madison, Wisconsin, to Genevieve Smith Whitford, a poet and writer, and George Van Norman Whitford. He studied theater and English literature at Wesleyan University and earned a master's degree in theater from the prestigious Juilliard Theater Center. Whitford's first professional performance was in the off-Broadway production of \"Curse of the Starving Class,\" with Kathy Bates. He also starred in the Broadway production of \"The West Wing\" creator Aaron Sorkin's \"A Few Good Men.\" His additional theater credits include \"Three Days of Rain\" at the Manhattan Theatre Club, \"Measure for Measure\" at the Lincoln Center, and the title role in \"Coriolanus\" at the Folger Shakespeare Theatre in Washington, D.C. Some of Whitford's most memorable performances include roles in such films as The Muse (1999) with Albert Brooks and Bicentennial Man (1999) with Robin Williams. He has also appeared in Scent of a Woman (1992), A Perfect World (1993), Philadelphia (1993), The Client (1994), My Life (1993), Red Corner (1997), Presumed Innocent (1990), and My Fellow Americans (1996). He also had a prominent supporting part in the horror thriller Get Out (2017), as a suspicious suburban father.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NTIzNjc3Ml5BMl5BanBnXkFtZTYwNjgxNTA2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0925966","name":"Bradley Whitford","nicknames":["Brad"],"idIMDB":"nm0925966"},"actorId":"nm0925966","character":"Bobby Lee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ray McKinnon","urlProfile":"http://www.imdb.com/name/nm0571964","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNzE3NjIwOV5BMl5BanBnXkFtZTcwMjgwNTg2Mw@@._V1_UY44_CR22,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 November 1957","placeOfBirth":" Adel, Georgia, USA","height":"6' 2\" (1.88 m)","bio":"Ray McKinnon was born on November 15, 1957 in Adel, Georgia, USA. He is an actor and writer, known for Rectify (2013), Deadwood (2004) and Mud (2012). He was previously married to Lisa Blount.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNzE3NjIwOV5BMl5BanBnXkFtZTcwMjgwNTg2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0571964","name":"Ray McKinnon","idIMDB":"nm0571964"},"actorId":"nm0571964","character":"Bradley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jennifer Griffin","urlProfile":"http://www.imdb.com/name/nm0341227","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNDE2MDcxNl5BMl5BanBnXkFtZTcwMjIwOTc1OQ@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"bio":"Jennifer Griffin is known for her work on Boyhood (2014), A Perfect World (1993) and Vanilla Sky (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNDE2MDcxNl5BMl5BanBnXkFtZTcwMjIwOTc1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0341227","name":"Jennifer Griffin","idIMDB":"nm0341227"},"actorId":"nm0341227","character":"Gladys Perry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leslie Flowers","urlProfile":"http://www.imdb.com/name/nm0283201","urlPhoto":"","biography":{"bio":"Leslie Flowers is an actress, known for A Perfect World (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0283201","name":"Leslie Flowers","idIMDB":"nm0283201"},"actorId":"nm0283201","character":"Naomi Perry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Belinda Flowers","urlProfile":"http://www.imdb.com/name/nm0283169","urlPhoto":"","biography":{"bio":"Belinda Flowers is an actress, known for A Perfect World (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0283169","name":"Belinda Flowers","idIMDB":"nm0283169"},"actorId":"nm0283169","character":"Ruth Perry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Darryl Cox","urlProfile":"http://www.imdb.com/name/nm0184981","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4NTE5MjM2NV5BMl5BanBnXkFtZTgwMDk1Nzg5NTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1955","placeOfBirth":" Wiesbaden, Hesse, Germany","bio":"Darryl Cox was born on April 8, 1955 in Wiesbaden, Hesse, Germany. He is known for his work on Arlington Road (1999), RoboCop (1987) and Bottle Rocket (1996). He was previously married to Susanne Ingels.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4NTE5MjM2NV5BMl5BanBnXkFtZTgwMDk1Nzg5NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0184981","name":"Darryl Cox","idIMDB":"nm0184981"},"actorId":"nm0184981","character":"Mr. Hughes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jay Whiteaker","urlProfile":"http://www.imdb.com/name/nm0925626","urlPhoto":"","biography":{"bio":"Jay Whiteaker is an actor, known for A Perfect World (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0925626","name":"Jay Whiteaker","idIMDB":"nm0925626"},"actorId":"nm0925626","character":"Billy Reeves","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Taylor Suzanna McBride","urlProfile":"http://www.imdb.com/name/nm0564376","urlPhoto":"","biography":{"bio":"Taylor Suzanna McBride is an actress, known for A Perfect World (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0564376","name":"Taylor Suzanna McBride","idIMDB":"nm0564376"},"actorId":"nm0564376","character":"Tinkerbell","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0107808","urlIMDB":"http://www.imdb.com/title/tt0107808","business":{"budget":{"money":"$30,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$8,075,582","country":"USA","day":"24","month":"11","year":"1993","remarks":"1 Screen"}],"gross":[{"money":"£4,092,432","country":"UK","day":"06","month":"02","year":"1994","remarks":""},{"money":"£3,034,130","country":"UK","day":"16","month":"01","year":"1994","remarks":""},{"money":"$104,000,000 (Worldwide)","country":"except","day":null,"month":null,"year":null,"remarks":null},{"money":"SEK","country":"15,686,800","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1993/\">1993</a>"},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1993/\">1993</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 18 min (138 min)","2 hr 5 min (125 min) (TV) (Germany)"],"soundMix":["Dolby Digital"],"color":["Color (Technicolor)"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":["3,787 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm"]},"rating":"7.5","filmingLocations":[{"location":"Steiner Ranch - 896 Sayers Road, Bastrop, Texas, USA"}],"rated":"PG-13","awards":[],"votes":"60,063","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."},{"idCompany":"co0010258","name":"Malpaso Productions"}],"keywords":{"keywords":["anti hero","prison","texas","on the run","violence","blood","texas ranger","little boy","halloween","criminologist","escaped convict","kidnapping","reference to casper the friendly ghost","halloween costume","blood splatter","manhunt","road movie","adult child bonding","gun violence","pistol","revolver","beating","punched in the nose","held at gunpoint","sniper","shotgun","sniper rifle","shot in the chest","double barreled shotgun","tough cop","cult film","mexican standoff","shooting","tragic ending","villain played by lead actor","tragic villain","tough guy","main character shot","modern western","ham radio","main character dies","child with gun","kidnapper kidnapped relationship","kitchen","dance","stolen money","sharpshooter","moral ambiguity","money","mask","male bonding","father figure","crime spree","armed robbery","anti villain","african american","abusive father","duct tape over mouth","directed by co star","birmingham alabama","nosebleed","man boy relationship","shot in the stomach","prison escape","cornfield","blockbuster","violence against a child","underwear","trick or treating","time machine","steak","sleeping in a car","road trip","pseudonym","postcard","police chief","pickle","mustard","mother son relationship","mobile home","misogynist","mirror","megaphone","jehovah's witness","jail break","inmate","hostage","helicopter","hamburger","gunshot wound","grandfather grandson relationship","gramophone","governor","goodbye","ghost costume","gay slur","fugitive","ford","feedback","fbi agent","farmer","dysfunctional family","duct tape","diner","crying","cowboy hat","corpse","cola","clothes theft","cleavage","cigarette smoking","car thief","car crash","car chase","break in","child driving a car","panhandle","missing father","sexism","child uses gun","father son relationship","1960s","fbi","death of friend","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:32:51"}}