{"data":{"movies":[{"title":"Operation Dumbo Drop","originalTitle":"","year":"1995","releaseDate":"19950728","directors":[{"name":"Simon Wincer","id":"nm0934578"}],"writers":[{"name":"James Morris","id":"nm0606611"},{"name":"Gene Quintano","id":"nm0704164"}],"runtime":"107 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU2NzQyNDQ0NV5BMl5BanBnXkFtZTcwNTk4NjIyMQ@@._V1.jpg","countries":["USA"],"languages":["English","Vietnamese"],"genres":["Action","Adventure","Comedy","Drama","Family","War"],"plot":"During the Vietnam War, a village that American forces are using to spy on the Ho Chi Minh Trail has its sacred elephant killed by the North Vietnamese Army because they were cooperating with the Americans. The villagers need an elephant for a ceremony that will occur within the week. Captain Sam Cahill, an easygoing man who is heading home, and his hotheaded replacement Captain TC Doyle scrounge up another elephant with the help of sneaky supply chief warrant officer David Poole, luckless farmboy Lawrence Farley, and short-timer Harvey Ashford, and transport it across South Vietnam to get it to the village on time, running into all sorts of transport problems, personality conflicts, and an NVA squad that wants the Americans out of the village.","simplePlot":"To keep the loyalty of a village during the Vietnam war, a U.S. Army officer and his unit struggle to deliver it a live elephant.","actors":[{"actorName":"Danny Glover","urlProfile":"http://www.imdb.com/name/nm0000418","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODM2MzQwN15BMl5BanBnXkFtZTcwMjY2OTI5MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1946","placeOfBirth":" San Francisco, California, USA","birthName":"Danny Lebern Glover","height":"6' 4\" (1.93 m)","bio":"Actor, producer and humanitarian Danny Glover has been a commanding presence on screen, stage and television for more than 25 years. Glover was born in San Francisco, California, to Carrie (Hunley) and James Glover, postal workers who were also active in civil rights. Glover trained at the Black Actors' Workshop of the American Conservatory Theater. It was his Broadway debut in Fugard's Master Harold...and the Boys, which brought him to national recognition and led director Robert Benton to cast Glover in his first leading role in 1984's Oscar®-nominated Best Picture Places in the Heart. The following year, Glover starred in two more Best Picture nominees: Peter Weir's Witness and Steven Spielberg's The Color Purple. In 1987, Glover partnered with Mel Gibson in the first Lethal Weapon film and went on to star in three hugely successful Lethal Weapon sequels. Glover has also invested his talents in more personal projects, including the award-winning To Sleep With Anger, which he executive produced and for which he won an Independent Spirit Award for Best Actor; Bopha!; Manderlay; Missing in America; and the film version of Athol Fugard's play Boesman and Lena. On the small screen, Glover won an Image Award and a Cable ACE Award and earned an Emmy nomination for his performance in the title role of the HBO movie Mandela. He has also received Emmy nominations for his work in the acclaimed miniseries Lonesome Dove and the telefilm Freedom Song. As a director, he earned a Daytime Emmy nomination for Showtime's Just a Dream. Glover's film credits range from the blockbuster Lethal Weapon franchise to smaller independent features, some of which Glover also produced. He co-starred in the critically acclaimed feature Dreamgirls directed by Bill Condon and in Po' Boy's Game for director Clement Virgo. He appeared in the hit feature Shooter for director Antoine Fuqua, Honeydripper for director John Sayles, and Be Kind, Rewind for director Michel Gondry. Glover has also gained respect for his wide-reaching community activism and philanthropic efforts, with a particular emphasis on advocacy for economic justice, and access to health care and education programs in the United States and Africa. For these efforts, Glover received a 2006 DGA Honor. Internationally, Glover has served as a Goodwill Ambassador for the United Nations Development Program from 1998-2004, focusing on issues of poverty, disease, and economic development in Africa, Latin America, and the Caribbean, and serves as UNICEF Ambassador. In 2005, Glover co-founded Louverture Films dedicated to the development and production of films of historical relevance, social purpose, commercial value and artistic integrity. The New York based company has a slate of progressive features and documentaries including Trouble the Water, which won the Grand Jury Prize at the 2008 Sundance Film Festival, Africa Unite, award winning feature Bamako, and most recent projects Uncle Boonmee Who Can Recall His Past Lives, and The Disappearance of McKinley Nolan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODM2MzQwN15BMl5BanBnXkFtZTcwMjY2OTI5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000418","name":"Danny Glover","idIMDB":"nm0000418"},"actorId":"nm0000418","character":"Capt. Sam Cahill","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ray Liotta","urlProfile":"http://www.imdb.com/name/nm0000501","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NzM5MjUwMF5BMl5BanBnXkFtZTYwNDM2NDky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1954","placeOfBirth":" Newark, New Jersey, USA","height":"6' (1.83 m)","bio":"Intense is the word for Ray Liotta. He specializes in psychopathic characters who hide behind a cultivated charm. Even in his nice guy roles in Field of Dreams (1989) and Operation Dumbo Drop (1995), you get the impression that something is smoldering inside of him. Liotta maintains a steady stream of work, completing multiple projects per year. Liotta was born in Newark, New Jersey, and was adopted by Mary (Edgar), a township clerk, and Alfred Liotta, an auto parts store owner. He studied acting at the University of Miami, where he became friends with Steven Bauer (Scarface (1983), Thief of Hearts (1984)). He spent his first years acting in TV: Another World (1964), a TV movie and several short-lived series. He broke into movies with the black comedy Something Wild (1986), which garnered him rave reviews. Originally unable to get a reading, he was recommended for the part by Melanie Griffith (then married to Bauer). After the success of \"Something Wild\" he received more offers in the \"psycho\" vein, but refused them to avoid being typecast. Instead, he made \"little movies\" like Dominick and Eugene (1988) (which earned him standing as an actor's actor) and Field of Dreams (1989) (whose success still surprises him). When he heard that Martin Scorsese was casting Goodfellas (1990), he lobbied hard for the part of Henry Hill. The film's huge success brought him wide popularity and enabled him to get star billing in future films (Article 99 (1992), Obsession fatale (1992), Unforgettable (1996)).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NzM5MjUwMF5BMl5BanBnXkFtZTYwNDM2NDky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000501","name":"Ray Liotta","idIMDB":"nm0000501"},"actorId":"nm0000501","character":"Capt. T.C. Doyle","urlCharacter":"http://www.imdb.com/character/ch0093878","main":true},{"actorName":"Denis Leary","urlProfile":"http://www.imdb.com/name/nm0001459","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MzM4NTA5OV5BMl5BanBnXkFtZTcwMTAxNjA3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1957","placeOfBirth":" Worcester, Massachusetts, USA","birthName":"Denis Colin Leary","height":"6' 2\" (1.88 m)","bio":"Denis Leary was born and raised in Worcester, Massachusetts, the son of Nora (Sullivan) and John Leary, Irish immigrants who had grown up together. His mother was a maid and his father was an auto mechanic. After a childhood in the 1960s, Leary went to Emerson College in Boston, where he tried his hand at acting and writing. He was a charter member of Emerson's Comedy Workshop, and taught at the college for five years after graduating. By that point, he had written several pieces for magazines and had worked at stand-up comedy for a time. In 1990, he and his wife, Ann Lembeck, flew to London to perform in the BBC's Paramount City. That weekend, Ann's water broke. Their planned weekend trip became a stay of months, and Denis, with not a whole lot to do in London, wrote a one-man comedy act. He brought friends in from the States, and they wrote songs to perform on stage. Leary, with Chris Phillips and Adam Roth on guitar, performed \"No Cure For Cancer\" at the Edinburgh International Arts Festival in Scotland. Despite some protests about the title, the show won the Critic's Award and the BBC Festival Recommendation. The next year, the show was moved to America, and it was eventually taped and broadcast on Showtime (Denis Leary: No Cure for Cancer (1992)). The show spawned a book, CD, cassette, and a videotape. It also started Leary's movie career. Since then, he has starred in several films and has had two of his own TV series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MzM4NTA5OV5BMl5BanBnXkFtZTcwMTAxNjA3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001459","name":"Denis Leary","idIMDB":"nm0001459"},"actorId":"nm0001459","character":"Lt. David Poole","urlCharacter":"http://www.imdb.com/character/ch0093880","main":true},{"actorName":"Doug E. Doug","urlProfile":"http://www.imdb.com/name/nm0234791","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMDMzMDQ4NV5BMl5BanBnXkFtZTcwNTM3ODcyMw@@._V1._CR774,194.64999389648438,1139,1120.0000305175781_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1970","placeOfBirth":" Brooklyn, New York, USA","birthName":"Douglas Bourne","bio":"Doug E. Doug was born on January 7, 1970 in Brooklyn, New York, USA as Douglas Bourne. He is an actor and producer, known for Cool Runnings (1993), Cosby (1996) and Shark Tale (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMDMzMDQ4NV5BMl5BanBnXkFtZTcwNTM3ODcyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0234791","name":"Doug E. Doug","idIMDB":"nm0234791"},"actorId":"nm0234791","character":"Sp4 Harvey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Corin Nemec","urlProfile":"http://www.imdb.com/name/nm0005269","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MjYwMTgxOF5BMl5BanBnXkFtZTgwMzM2MDE3NjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1971","placeOfBirth":" Little Rock, Arkansas, USA","birthName":"Joseph Charles Nemec IV","height":"6' (1.83 m)","bio":"Corin Nemec's name comes from his nickname, Corky, given to him as a child by his grandmother. He was born in Little Rock, Arkansas, and later moved to Atlanta. He now lives in California. His first acting parts were in the series Webster (1983) and Sidekicks (1986). He then got a part in Tucker: The Man and His Dream (1988), directed by Francis Ford Coppola, followed by lead roles in I Know My First Name Is Steven (1989) and My Son Johnny (1991), and the lead role in the TV series Parker Lewis Can't Lose (1990).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MjYwMTgxOF5BMl5BanBnXkFtZTgwMzM2MDE3NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005269","name":"Corin Nemec","nicknames":["Corky"],"idIMDB":"nm0005269"},"actorId":"nm0005269","character":"Sp5 Lawrence Farley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dinh Thien Le","urlProfile":"http://www.imdb.com/name/nm0494689","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NTk1NTYxNl5BMl5BanBnXkFtZTYwMzAxNzA3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Dinh Thien Le is an actor, known for Operation Dumbo Drop (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NTk1NTYxNl5BMl5BanBnXkFtZTYwMzAxNzA3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0494689","name":"Dinh Thien Le","idIMDB":"nm0494689"},"actorId":"nm0494689","character":"Linh","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tchéky Karyo","urlProfile":"http://www.imdb.com/name/nm0001409","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzMyNDQyN15BMl5BanBnXkFtZTYwMzgzODU3._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1953","placeOfBirth":" Istanbul, Turkey","birthName":"Baruh Djaki Karyo","height":"5' 10\" (1.78 m)","bio":"Born in Istanbul, Turkey, Tcheky Karyo grew up in Paris. He studied drama at the Cyrano Theatre and became a member of the Daniel Sorano Company, where he played numerous classical roles. He next joined the National Theatre of Strasbourg, where he starred in contemporary theatre as well as in such classical works as \"Tartuffe\", \"Macbeth\" and \"Othello.\" He is one of France's most popular actors. Nominated for a Cesar Award for his starring role in La balance (1982), Karyo received the prestigious Jean Gabin Prize in 1986 in recognition of his talent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzMyNDQyN15BMl5BanBnXkFtZTYwMzgzODU3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001409","name":"Tchéky Karyo","idIMDB":"nm0001409"},"actorId":"nm0001409","character":"Goddard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hoang Ly","urlProfile":"http://www.imdb.com/name/nm0527864","urlPhoto":"","biography":{"bio":"Hoang Ly is an actor, known for Operation Dumbo Drop (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0527864","name":"Hoang Ly","idIMDB":"nm0527864"},"actorId":"nm0527864","character":"Col. Nguyen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vo Trung Anh","urlProfile":"http://www.imdb.com/name/nm0030017","urlPhoto":"","biography":{"bio":"Vo Trung Anh is an actor, known for Operation Dumbo Drop (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0030017","name":"Vo Trung Anh","idIMDB":"nm0030017"},"actorId":"nm0030017","character":"Lt. Quang, NVA","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marshall Bell","urlProfile":"http://www.imdb.com/name/nm0068382","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzODI4NzU1NV5BMl5BanBnXkFtZTgwMzE2ODIwMjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 September 1942","placeOfBirth":" Tulsa, Oklahoma, USA","birthName":"Archibald Marshall Bell","height":"6' 1¼\" (1.86 m)","bio":"A tall, imposing character actor with a penetrating stare, Marshall Bell has provided excellent support in a variety of roles and genres. He was born in Tulsa, Oklahoma, on September 28, 1942, and had been working as a consultant, teaching senior executives how to improve their speaking skills, prior to starting an acting career relatively late in life. His connection was his wife, the veteran costume designer Milena Canonero, herself a winner of three Academy Awards and nominee for five more. He made his motion picture debut in the drama \"Birdy\", which was seen by enough people to effectively jump-start his career. One of his next few roles was one of his most infamous: the creepy Coach Schneider of \"A Nightmare on Elm Street Part 2: Freddy's Revenge\". But the role that really got him noticed was as resistance leader George / Kuato in \"Total Recall\" (the role re-united him with Arnold Schwarzenegger, as he'd played a hit man in the comedy \"Twins\"). Other substantial film roles include a frightening homeless man terrorizing Bill Paxton in the movie \"The Vagrant\", Gordies' emotionally distant father in \"Stand By Me\", and General Owen in the movie \"Starship Troopers\", re-uniting him with \"Total Recall\" director Paul Verhoeven. He's done many TV series, including 'G vs. E', 'Wiseguy', 'The X-Files', 'Tales from the Crypt', 'Hill Street Blues', 'House', and 'Deadwood'. He's also appeared in commercials and done voice-over work. A solid, reliable actor with an authoritative presence, Bell is a natural for playing \"tough guy\" roles, although movies like \"Airheads\" show him to be able to play comedy equally well. He continues to add many credits to his resume, including the critically acclaimed \"Capote\", the prisoner of war drama \"Rescue Dawn\", and the family film \"Nancy Drew\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzODI4NzU1NV5BMl5BanBnXkFtZTgwMzE2ODIwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0068382","name":"Marshall Bell","idIMDB":"nm0068382"},"actorId":"nm0068382","character":"Col. Pederson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Hong","urlProfile":"http://www.imdb.com/name/nm0393222","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0MTQxOTA4MF5BMl5BanBnXkFtZTgwODE1OTcyMjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1929","placeOfBirth":" Minneapolis, Minnesota, USA","height":"5' 10\" (1.78 m)","bio":"James Hong was born in Minneapolis, Minnesota, USA. He studied civil engineering at the University of Minnesota, but at some point along the way became interested in acting. He graduated from the University of Southern California and practiced for 1½ years as a road engineer with the County of Los Angeles. He took sick leaves and vacation time to do films. He finally quit engineering to focus on acting full time. He is one of the founders of the East-West Players, the oldest Asian American theater in Los Angeles. He served as president and charter member of the Association of Asian Pacific American Artists. Hong is one of the most prolific and well-recognized Asian-American character actors of movies and television. He currently lives in Los Angeles and is planning to produce and direct his own films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0MTQxOTA4MF5BMl5BanBnXkFtZTgwODE1OTcyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0393222","name":"James Hong","nicknames":["Jimmy"],"idIMDB":"nm0393222"},"actorId":"nm0393222","character":"Y B'ham","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Long Nguyen","urlProfile":"http://www.imdb.com/name/nm0629050","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MTc1OTI1Ml5BMl5BanBnXkFtZTYwNzE0NDMz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1958","placeOfBirth":" Nha-Trang, Vietnam","bio":"Long Nguyen was born in 1958 in Nha-Trang, Vietnam. He is known for his work on Seven Psychopaths (2012), Six Days Seven Nights (1998) and Journey from the Fall (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MTc1OTI1Ml5BMl5BanBnXkFtZTYwNzE0NDMz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0629050","name":"Long Nguyen","idIMDB":"nm0629050"},"actorId":"nm0629050","character":"Jhon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tim Kelleher","urlProfile":"http://www.imdb.com/name/nm0445551","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMjEwODE1N15BMl5BanBnXkFtZTgwNzM4MzY4ODE@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"bio":"Tim Kelleher was born in Bronx, New York, USA. He is an actor and director, known for Inception (2010), Seven Pounds (2008) and Independence Day (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMjEwODE1N15BMl5BanBnXkFtZTgwNzM4MzY4ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0445551","name":"Tim Kelleher","idIMDB":"nm0445551"},"actorId":"nm0445551","character":"C-123 Pilot","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott N. Stevens","urlProfile":"http://www.imdb.com/name/nm0828768","urlPhoto":"","biography":{"bio":"Scott N. Stevens is an actor, known for Almost Famous (2000), House of Sand and Fog (2003) and Turner & Hooch (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0828768","name":"Scott N. Stevens","idIMDB":"nm0828768"},"actorId":"nm0828768","character":"C-123 Co-Pilot","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kevin LaRosa","urlProfile":"http://www.imdb.com/name/nm0478985","urlPhoto":"","biography":{"bio":"Kevin LaRosa is known for his work on The Avengers (2012), American History X (1998) and Iron Man (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0478985","name":"Kevin LaRosa","idIMDB":"nm0478985"},"actorId":"nm0478985","character":"Irish - Huey Pilot #1","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0114048","urlIMDB":"http://www.imdb.com/title/tt0114048","business":{"budget":null,"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1994/\">1994</a>"},{"money":"Interscope","country":"Communications,","day":null,"month":null,"year":null,"remarks":null},{"money":"The Walt","country":"Disney","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 47 min (107 min)","1 hr 44 min (104 min) (Finland)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Lenses and Panaflex Cameras by Panavision"],"laboratory":["Technicolor, Hollywood (CA), USA (prints)"],"filmLength":["2,997 m"],"negativeFormat":["35 mm (Eastman)"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm (Eastman)"]},"rating":"4.9","filmingLocations":[{"location":"Chiang Mai, Thailand"}],"rated":"PG","awards":[],"votes":"7,164","type":"Movie","companyCreditsSimple":[{"idCompany":"co0008970","name":"Walt Disney Pictures"},{"idCompany":"co0030612","name":"Polygram Filmed Entertainment"},{"idCompany":"co0031772","name":"Interscope Communications"}],"keywords":{"keywords":["elephant","vietnam","liquid","child in danger","crow","lifting someone into the air","rescue","airlift","animal","cargo plane","based on true story","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 19:11:53"}}