{"data":{"movies":[{"title":"Austin Powers: International Man of Mystery","originalTitle":"","year":"1997","releaseDate":"19970502","directors":[{"name":"Jay Roach","id":"nm0005366"}],"writers":[{"name":"Mike Myers","id":"nm0000196"}],"runtime":"89 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTRhZTY0MDItY2I1Yi00MGE3LTk1ZDEtMjA0ZGZhNDQyNGU0XkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1.jpg","countries":["USA","Germany"],"languages":["English"],"genres":["Comedy","Crime"],"plot":"Austin Powers is a 60's spy who is cryonically frozen and released in the 1990's. The world is a very different place for Powers. Unfortunately for Austin, everyone is no longer sex-mad. Although he may be in a different decade, his mission is still the same. He has teamed up with Vanessa Kensington to stop the evil Dr. Evil, who was also frozen in the past. Dr. Evil stole a nuclear weapon and is demanding a payment of (when he realises its the 90's) 100 billion dollars. Can Austin Powers stop this madman? or will he caught up with Evil's henchman, with names like Alotta Fagina and Random Task? Only time will tell!","simplePlot":"A 1960s hipster secret agent is brought out of cryofreeze to oppose his greatest enemy in the 1990s, where his social attitudes are glaringly out of place.","actors":[{"actorName":"Mike Myers","urlProfile":"http://www.imdb.com/name/nm0000196","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MTM1MTM5Nl5BMl5BanBnXkFtZTcwNzA1OTM3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1963","placeOfBirth":" Scarborough, Ontario, Canada","birthName":"Michael John Myers","height":"5' 7½\" (1.71 m)","bio":"Michael John Myers was born in 1963 in Scarborough, Ontario, to Alice E. (Hind), an officer supervisor, and Eric Myers, an insurance agent. His parents were both English, and had served in the Royal Air Force and British Army, respectively. Myers' television career really started in 1988, when he joined Saturday Night Live (1975), where he spent six seasons. He brought to life many memorable characters, such as Dieter and Wayne Cambell. His major movies include Wayne's World (1992), Wayne's World 2 (1993), So I Married an Axe Murderer (1993), the Austin Powers movies and The Cat in the Hat (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MTM1MTM5Nl5BMl5BanBnXkFtZTcwNzA1OTM3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000196","name":"Mike Myers","idIMDB":"nm0000196"},"actorId":"nm0000196","character":"Austin Powers / Dr. Evil","urlCharacter":"http://www.imdb.com/character/ch0002425","main":true},{"actorName":"Elizabeth Hurley","urlProfile":"http://www.imdb.com/name/nm0000167","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NTEyMDA2N15BMl5BanBnXkFtZTYwNTY0OTkz._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1965","placeOfBirth":" Basingstoke, Hampshire, England, UK","birthName":"Elizabeth Jane Hurley","height":"5' 8\" (1.73 m)","bio":"Elizabeth Jane Hurley was born in Basingstoke, Hampshire, to Angela Mary (Titt), a teacher, and Roy Leonard Hurley, an army major. Wanting to be a dancer, Hurley went to ballet boarding school at 12, but soon returned home. When it came time to go to college, Hurley won a scholarship to the London Studio Centre which taught courses for dance and theater. Soon, Hurley wore the punk rock look with pink hair and a nose ring, but to get work, she had to change her image to one that was castable. After college, Hurley worked in the theater and made her screen debut in Aria (1987). Roles in Television and a film, Rowing with the Wind (1988), which included a young actor named Hugh Grant, soon followed. European films followed her appearance in the BBC serial Christabel (1988). Her film debut in a Hollywood movie was in the Wesley Snipes action drama Passenger 57 (1992). When Hugh Grant was picked up with Divine Brown, Hurley became headline news. Added to this was the fact that she was the model representing top cosmetics house Estée Lauder, and there was nowhere Hurley could go to get away from the press. In 1994, Hurley and Hugh Grant set up Simian Films in partnership with Castle Rock Entertainment. As Head of Development, Hurley found the script and produced her first film Extreme Measures (1996), which stars Hugh Grant.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NTEyMDA2N15BMl5BanBnXkFtZTYwNTY0OTkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000167","name":"Elizabeth Hurley","nicknames":["Liz"],"idIMDB":"nm0000167"},"actorId":"nm0000167","character":"Vanessa Kensington","urlCharacter":"http://www.imdb.com/character/ch0002427","main":true},{"actorName":"Michael York","urlProfile":"http://www.imdb.com/name/nm0001868","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NzgzNTg0OF5BMl5BanBnXkFtZTYwOTk3ODM1._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 March 1942","placeOfBirth":" Fulmer, Buckinghamshire, England, UK","birthName":"Michael York-Johnson","height":"5' 10½\" (1.79 m)","bio":"Michael York was born in Fulmer, England, 27 March 1942. He performed on stage with the National Youth Theatre in London's East End and on international tour. Other early acting experience came through the Oxford University Dramatic Society (he graduated Oxford 1964), the Dundee Repertory, and Laurence Olivier's National Theater Company - where he worked with Franco Zeffirelli, who gave him his film debut as Lucentio in La mégère apprivoisée (1967) and his breakthrough role as Tybalt in Romeo and Juliet (1968). He achieved early TV acclaim for his portrayal of Jolyon in The Forsyte Saga (1967). Other notable early movie roles include Brian Roberts in Cabaret (1972), Count Andrenyi in Murder on the Orient Express (1974) and D'Artagnan in several Musketeers films. He has starred in over 50 TV movies, continued stage work, starring on Broadway, made many spoken word recordings, written and lectured internationally. His autobiography (1993) was issued as \"Accidentally on Purpose\" in the U.S. and \"Travelling Player\" in Britain. He was in the hit The Omega Code (1999) with Catherine Oxenberg and Casper Van Dien. He had a great part in all of the \"Austin Powers\" films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NzgzNTg0OF5BMl5BanBnXkFtZTYwOTk3ODM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001868","name":"Michael York","idIMDB":"nm0001868"},"actorId":"nm0001868","character":"Basil Exposition","urlCharacter":"http://www.imdb.com/character/ch0002431","main":true},{"actorName":"Mimi Rogers","urlProfile":"http://www.imdb.com/name/nm0000211","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NDUyNDQ3N15BMl5BanBnXkFtZTcwOTk0MTMwNA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1956","placeOfBirth":" Coral Gables, Florida, USA","birthName":"Miriam Spickler","height":"5' 8½\" (1.74 m)","bio":"It's fair to say that after 20 years and over 50 film appearances, Mimi Rogers should be praised for her variety of roles and acting capabilities, not for a brief marriage to a Hollywood star. In the early 1980s she began to carve a niche for herself in Hollywood, appearing on television and in films. It was her role in Someone to Watch Over Me (1987) that got her noticed and was her springboard to stardom. Cemented by a marriage to Tom Cruise, an already established young actor, Mimi went on to appear in Hider in the House (1989), Desperate Hours (1990), and The Doors (1991). She appeared in a controversial movie analyzing religion in America, The Rapture (1991), which proved a hit and delighted audiences, creating many a debate over the film's subject material. She played a bored telephone exchange operator who swaps a sinful life of sex and swinging with other couples for a devout religious one, ending unexpectedly in disaster. Despite her successes, few meaty, interesting roles came her way in the '90s. Shooting Elizabeth (1992), opposite Jeff Goldblum, the family movie Mon ami Dodger (1994), Far from Home: The Adventures of Yellow Dog (1995), and Full Body Massage (1995) were just a few of the films that she appeared in. Working consistently, she rejuvenated her career in the unexpected hit Austin Powers: International Man of Mystery (1997), playing Miss Kensington, an attractive female agent of 1960s London and the mother of Elizabeth Hurley's character. Next, Mimi was seen in the big-screen remake of the '60s sci-fi TV series Lost in Space (1998) and several guest appearances on the hugely popular television series The X-Files (1993), playing a scheming FBI agent. A role in the Canadian indie-horror Ginger Snaps (2000) did her career no harm. Soon, she was opposite Geena Davis in The Geena Davis Show (2000) from 2000-01 and playing an extremely rich Manhattan socialite in the direct-to-video Cruel Intentions 2 (2000). More recently Mimi has appeared on cable television, including leading roles in Charms for the Easy Life (2002) (which she also executive produced) and Le coeur enseveli (2003) (a true-life disaster drama in which she played the Chief Superintendent of a mine). In 2004, she gave a revealing performance in The Door in the Floor (2004), a critical success. The Loop (2006), a Chicago-based sitcom, will soon be airing in America, featuring Mimi as a flirtatious office worker. Also in 2006, Mimi will be appearing in an original horror film, Penny Dreadful (2006), playing a psychiatrist in peril. In 2003, she married her longtime partner Chris Ciaffa, with whom she has a son and a daughter. A poker novice, Mimi also travels around competing in tournaments, some televised.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NDUyNDQ3N15BMl5BanBnXkFtZTcwOTk0MTMwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000211","name":"Mimi Rogers","idIMDB":"nm0000211"},"actorId":"nm0000211","character":"Mrs. Kensington","urlCharacter":"http://www.imdb.com/character/ch0029683","main":true},{"actorName":"Robert Wagner","urlProfile":"http://www.imdb.com/name/nm0001822","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MjU3NTk0MF5BMl5BanBnXkFtZTcwODAzODI0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1930","placeOfBirth":" Detroit, Michigan, USA","birthName":"Robert John Wagner","height":"5' 11\" (1.8 m)","bio":"Robert John Wagner, Jr. was born in Detroit, Michigan, to Thelma Hazel Alvera (Boe), a telephone operator, and Robert John Wagner, Sr., a traveling salesman. His paternal grandparents were German and his maternal grandparents were Norwegian. His family moved to Los Angeles when he was seven. Always wanting to be an actor, he held a variety of jobs while pursuing his goal, but it was while dining with his parents at a restaurant in Beverly Hills that he was \"discovered\" by a talent scout. After making his uncredited screen debut in The Happy Years (1950), Wagner was signed by 20th Century Fox, which carefully built him up toward stardom. He played romantic leads with ease, but it wasn't until he essayed the two-scene role of a shellshocked war veteran in With a Song in My Heart (1952) that studio executives recognized his potential as a dramatic actor. He went on to play the title roles in Prince Valiant (1954) and The True Story of Jesse James (1957), and portrayed a cold-blooded murderer in A Kiss Before Dying (1956). In the mid-'60s, however, his film career skidded to a stop after The Pink Panther (1963). Several years of unemployment followed before Wagner made a respectable transition to television as star of the lighthearted espionage series It Takes a Thief (1968) (1968-1970). He also starred in the police series Switch (1975), but Wagner's greatest success was opposite Stefanie Powers in the internationally popular Hart to Hart (1979), which ran from 1979 through 1984 and has since been sporadically revived in TV-movie form (a 1986 series, Lime Street (1985), was quickly canceled due to the tragic death of Wagner's young co-star, Samantha Smith). Considered one of Hollywood's nicest citizens, Robert Wagner has continued to successfully pursue a leading man career; he has also launched a latter-day stage career, touring with Stefanie Powers in the readers' theater presentation \"Love Letters\". He found success playing Number Two, a henchman to Dr. Evil in the blockbuster trilogy Austin Powers: International Man of Mystery (1997), Austin Powers: The Spy Who Shagged Me (1999), and Austin Powers in Goldmember (2002), and in 2007 he began playing Teddy, a recurring role on the hit CBS series Two and a Half Men (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MjU3NTk0MF5BMl5BanBnXkFtZTcwODAzODI0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001822","name":"Robert Wagner","nicknames":["RJ","The Brylcreem Kid"],"idIMDB":"nm0001822"},"actorId":"nm0001822","character":"Number Two","urlCharacter":"http://www.imdb.com/character/ch0002428","main":true},{"actorName":"Seth Green","urlProfile":"http://www.imdb.com/name/nm0001293","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MzI2ODkwN15BMl5BanBnXkFtZTcwMDYyNzMyOQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1974","placeOfBirth":" Overbrook Park, Philadelphia, Pennsylvania, USA","birthName":"Seth Benjamin Green","height":"5' 4\" (1.63 m)","bio":"Seth Green has starred in numerous films and television series including the Austin Powers trilogy, The Italian Job, Party Monster, Without a Paddle, Can't Hardly Wait, Old Dogs and dozens more, including starring roles in 2013's Sexy Evil Genius, The Story of Luke and 2014's Yellowbird. He's portraying Christopher Guest in Netflix's upcoming National Lampoon origin film, A Stupid and Futile Gesture. Green is the co-creator/executive producer/primary voice talent and a writer/director on Robot Chicken, 2010 & 2016 Emmy® Award-winner for Outstanding Short Format Animation Program. Green has voiced Chris Griffin on Family Guy since the series' inception and Leonardo on Nickelodeon's Teenage Mutant Ninja Turtles. Green has been singled out for many Emmy voiceover nominations for Adult Swim's Robot Chicken. The show, the network's highest-rated original program, and their specials have won numerous Annie Awards for writing and producing, including one for Green for directing. In 2012, Green and his partners created Stoopid Buddy Stoodios, a full-service animation studio with many other projects including: Crackle's SuperMansion, Adult Swim's Hot Streets and OMG! Earth and WWE's Camp WWE. Green has always been fascinated by space travel and has done a PSA for NASA, moderated NASA's first San Diego Comic-Con panel and designed the CASIS patch for the 2015 ISS U.S. National Laboratory missions for research to benefit life on Earth.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MzI2ODkwN15BMl5BanBnXkFtZTcwMDYyNzMyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001293","name":"Seth Green","idIMDB":"nm0001293"},"actorId":"nm0001293","character":"Scott Evil","urlCharacter":"http://www.imdb.com/character/ch0002420","main":true},{"actorName":"Fabiana Udenio","urlProfile":"http://www.imdb.com/name/nm0007197","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NzYyMjAyNV5BMl5BanBnXkFtZTgwODE4NTMzNTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 December 1964","placeOfBirth":" Buenos Aires, Argentina","height":"5' 7\" (1.7 m)","bio":"Fabiana Udenio was born in Buenos Aires, Argentina, and moved to Italy, where at the age of thirteen, was crowned \"Miss Teen Italy\", that same year Fabiana made her theatre debut as \"Miranda\" in \"The Tempest\" directed by Giorgio Streheler. Miss Udenio first came to this country to perform at the 1984 Los Angeles Summer Olympics Arts Festival, in that very famous edition of \"The Tempest\". She is best known for her role as \"Alotta Fagina\", a Bond girl parody in Austin Powers International Man of Mystery. Her film roles include playing the daughter of a World War II Resistance fighter (Barbara Bouchet) in the The Scarlet and the Black (1983), Italian foreign-exchange student Anna-Maria Mazarelli in Summer School (1987), the sunbather in the \"Sunblock 5000\" commercial within RoboCop 2 (1990), Dan Cain's only living girlfriend Francesca in Bride of Re-Animator (1990), as \"Alotta Fagina\" in Austin Powers: International Man of Mystery (1997), as \"Don Na\" in The Godson (1998), and Gabriella in Pauly Shore's film In The Army Now (1994). On television, Udenio had the recurring role of \"Giulietta\" on the ABC soap opera One Life to Live from 1985 to 1986, and was regular cast member in the syndicated drama Amazon (1999-2000). She has guest starred and had recurring roles on dozens of television shows, including Babylon 5, Baywatch, Full House, NYPD Blue, Quantum Leap, Cheers, Mad About You, Wings, The Magnificent Seven. She also had the recurring role on 90210 (2008-2011) of Atooza Shirazi. She had the recurring role as Elena Di Nola/Mutter in the critically acclaimed series Jane the Virgin (2015-2016). Fabiana is fluent in four languages. She was married to Robert MacLeod for four years. She filed for divorce on February 5, 2009, citing irreconcilable differences. They have a son called Adrian Raice.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NzYyMjAyNV5BMl5BanBnXkFtZTgwODE4NTMzNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0007197","name":"Fabiana Udenio","idIMDB":"nm0007197"},"actorId":"nm0007197","character":"Alotta Fagina","urlCharacter":"http://www.imdb.com/character/ch0002435","main":true},{"actorName":"Mindy Sterling","urlProfile":"http://www.imdb.com/name/nm0827565","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGMwOTBhMzgtOWI3MS00NjlkLWI3MjItNzdkMmY2ODcxNDAyXkEyXkFqcGdeQXVyMTEwOTU3NDk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1953","placeOfBirth":" Paterson, New Jersey, USA","birthName":"Mindy Lee Sterling","height":"5' 2½\" (1.59 m)","bio":"Mindy Sterling was born on July 11, 1953 in Paterson, New Jersey, USA as Mindy Lee Sterling. She is known for her work on Austin Powers: The Spy Who Shagged Me (1999), Austin Powers in Goldmember (2002) and Austin Powers: International Man of Mystery (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGMwOTBhMzgtOWI3MS00NjlkLWI3MjItNzdkMmY2ODcxNDAyXkEyXkFqcGdeQXVyMTEwOTU3NDk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0827565","name":"Mindy Sterling","idIMDB":"nm0827565"},"actorId":"nm0827565","character":"Frau Farbissina","urlCharacter":"http://www.imdb.com/character/ch0002432","main":true},{"actorName":"Paul Dillon","urlProfile":"http://www.imdb.com/name/nm0227051","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxODIzOTI5MV5BMl5BanBnXkFtZTcwMTQ2NTgwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Paul Dillon is an actor born in Joliet who began his career in show business in Chicago. His movie career began in 1994 with the movie Blink (1993) in which he played the role of Neal Booker. He played Patty O'Brien in Austin Powers: International Man of Mystery (1997), the most successful film in which he has a credited role. Dillon also has appeared on many hit TV series including NYPD Blue (1993), CSI: Miami (2002), The Guardian (2001), and his recurring role as Angelo in The Pretender (1996). Most recently, he had a guest appearance as Ezekiel in the new ABC drama Night Stalker (2005). Currently, he plays Gary in the play Rantoul and Die. He is also the founder and artistic director of the Bang Bang Spontaneous Theatre group.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxODIzOTI5MV5BMl5BanBnXkFtZTcwMTQ2NTgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0227051","name":"Paul Dillon","idIMDB":"nm0227051"},"actorId":"nm0227051","character":"Patty O'Brien","urlCharacter":"http://www.imdb.com/character/ch0039115","main":true},{"actorName":"Charles Napier","urlProfile":"http://www.imdb.com/name/nm0621008","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyODc4NjY0OF5BMl5BanBnXkFtZTcwNzk1NTg4Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 April 1936","placeOfBirth":" Mt. Union, Kentucky, USA","birthName":"Sr. Charles Whitnel Napier","height":"5' 11\" (1.8 m)","bio":"Lively character actor who usually plays bodybuilding military types and menacing bad guys. Charles Napier's roles have changed little since his debut in Russ Meyer's Cherry, Harry & Raquel! (1970). Napier went on appearing in other Meyer movies, including the homicidal Harry Sledge in Supervixens (1975) and also became a regular playing smaller roles for Jonathan Demme. His granite-like jaw and wide, gate-like grin have contributed to his many memorable portrayals of tough guys, notably the scheming intelligence officer up against Sylvester Stallone in Rambo: First Blood Part II (1985) and the short-tempered front man of the Good Ole Boys in The Blues Brothers (1980), where he delivers the masterful 'corn on the cob' line.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyODc4NjY0OF5BMl5BanBnXkFtZTcwNzk1NTg4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0621008","name":"Charles Napier","idIMDB":"nm0621008"},"actorId":"nm0621008","character":"Commander Gilmour","urlCharacter":"http://www.imdb.com/character/ch0002436","main":true},{"actorName":"Will Ferrell","urlProfile":"http://www.imdb.com/name/nm0002071","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMDIzMDEzNF5BMl5BanBnXkFtZTcwODcxMjE2Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1967","placeOfBirth":" Irvine, California, USA","birthName":"John William Ferrell","height":"6' 3\" (1.91 m)","bio":"John William Ferrell was born in Irvine, California, to Betty Kay (Overman), a teacher, and Roy Lee Ferrell, Jr., a musician. His parents were both originally from Roanoke Rapids, North Carolina. A graduate of the University of Southern California, Ferrell became interested in performing while a student at University High School in Irvine, where he made his school's daily morning announcements over the public address system in disguised voices. He started as a member of the Los Angeles comedy/improvisation group The Groundlings, where fellow cast members Ana Gasteyer, Maya Rudolph and former Saturday Night Live (1975) repertory players such as Laraine Newman, Jon Lovitz and Phil Hartman began their careers. It was there he met Chris Kattan and the two became good friends and both went on to Saturday Night Live (1975) later. He has also appeared on several television programs, including Strangers with Candy (1999), Grace Under Fire (1993) and Living Single (1993) during his time at The Groundlings. Will also lent his voice to the armless and legless dad of cartoon family \"The Oblongs\". In 1995 he became a feature cast member at Saturday Night Live (1975) during the show's rapid re-casting. He was declared quite possibly the worst cast member ever during his first season. However, his talents of impersonations and range of characters shot him forward to making him arguably the greatest Saturday Night Live (1975) cast member ever. During his seven year run he is one of the few cast members to ever be nominated for an Emmy for a performance and played George W. Bush during the 2000 elections. He's appeared in every Saturday Night Live (1975) movie since his premiere on the show in 1995. In 2002 he left Saturday Night Live (1975) and was the only cast member to ever receive a farewell from all the current cast members at the end of the season finale show. Since leaving the show Will has pursued a career in films. In 2000 he married and now lives in L.A.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMDIzMDEzNF5BMl5BanBnXkFtZTcwODcxMjE2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002071","name":"Will Ferrell","nicknames":["Wilf"],"idIMDB":"nm0002071"},"actorId":"nm0002071","character":"Mustafa","urlCharacter":"http://www.imdb.com/character/ch0002419","main":true},{"actorName":"Joann Richter","urlProfile":"http://www.imdb.com/name/nm0725286","urlPhoto":"","biography":{"bio":"Joann Richter is an actress, known for Austin Powers: International Man of Mystery (1997), Mystery Men (1999) and I Woke Up Early the Day I Died (1998). She has been married to Akiva Goldsman since June 6, 2014. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0725286","name":"Joann Richter","nicknames":["Jojo"],"idIMDB":"nm0725286"},"actorId":"nm0725286","character":"60s Model","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anastasia Sakelaris","urlProfile":"http://www.imdb.com/name/nm0757155","urlPhoto":"","biography":{"dateOfBirth":"18 November 1971","placeOfBirth":" Florida, USA","birthName":"Anastasia Nicole Sakelaris","bio":"Anastasia Sakelaris was born on November 18, 1971 in Florida, USA as Anastasia Nicole Sakelaris. She is an actress, known for Austin Powers: International Man of Mystery (1997), What Planet Are You From? (2000) and Alien Avengers (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0757155","name":"Anastasia Sakelaris","idIMDB":"nm0757155"},"actorId":"nm0757155","character":"60s Model","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Afifi Alaouie","urlProfile":"http://www.imdb.com/name/nm0012708","urlPhoto":"","biography":{"birthName":"Afifi Alaouie","height":"5' 7\" (1.7 m)","bio":"Afifi Alaouie was born in Liberia. She is an actress, known for Austin Powers: International Man of Mystery (1997), Under Siege 2: Dark Territory (1995) and Out for Justice (1991).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0012708","name":"Afifi Alaouie","idIMDB":"nm0012708"},"actorId":"nm0012708","character":"60s Model","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Monet Mazur","urlProfile":"http://www.imdb.com/name/nm0005195","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MjM3ODAzOF5BMl5BanBnXkFtZTcwMDEzNjA2Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 April 1976","placeOfBirth":" Los Angeles, California, USA","birthName":"Monet Happy Mazur","height":"5' 9\" (1.75 m)","bio":"Monet Mazur has been in the entertainment industry and acting professionally since 1993. Mazur grew up in Malibu and New York, the daughter of Ruby Mazur, a record industry artist, and Valerie Chasin, who was a fashion model in the late 60s and 70s. After small roles in TV and film, Mazur finally earned a spate of \"actress on the verge of stardom\" articles when she was cast in a meatier role as one of Johnny Depp's stoner cohorts in Blow (2001) where she first captured audiences attention. Mazur continued to register on the movie radar with a dramatic turn as Jennifer Lopez's abused sister-in-law in Angel Eyes (2001), and a starring role as a seductive con artist in the independent crime drama The Learning Curve (1999). Returning to lighter work, Monet starred alongside Josh Hartnett in the romantic comedy 40 Days and 40 Nights (2002). In 2002 Mazur landed her first well known starring role in the Warner Brother action film Torque (2004) with Ice Cube. She also worked along side Jane Fonda and Jennifer Lopez in the hit Sa mère ou moi! (2005) and achieved much notoriety for portraying Rolling Stone icon Anita Pallenberg in the British biopic Stoned (2005) about the life of Brian Jones. Among dozens of other films Mazur has sang and performed on many soundtracks and done guest vocals on numerous albums including Tricky, the upcoming Sneakerpunk record, and the Dust Brothers. She has performed with The Pussycat Dolls as well as fronted her own band Nancy Raygun that became Hollywood darlings in the music scene in early 2000. In 2008 the Sony studio movie produced by Adam Sandler's production company released the highly anticipated comedy The House Bunny (2008), where Monet played the villainous playboy bunny Cassandra. Monet presently lives Los Angeles with her husband screen writer and director Alex De Rakoff and their son Marlon.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MjM3ODAzOF5BMl5BanBnXkFtZTcwMDEzNjA2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005195","name":"Monet Mazur","idIMDB":"nm0005195"},"actorId":"nm0005195","character":"Mod Girl","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0118655","urlIMDB":"http://www.imdb.com/title/tt0118655","business":{"budget":{"money":"$17,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$9,548,111","country":"USA","day":"04","month":"05","year":"1997","remarks":"2,187 Screens"}],"gross":[{"money":"$53,868,030","country":"USA","day":"28","month":"09","year":"1997","remarks":""},{"money":"$53,844,716","country":"USA","day":"21","month":"09","year":"1997","remarks":""},{"money":"$53,756,328","country":"USA","day":"07","month":"09","year":"1997","remarks":""},{"money":"$53,705,042","country":"USA","day":"01","month":"09","year":"1997","remarks":""},{"money":"$53,586,412","country":"USA","day":"24","month":"08","year":"1997","remarks":""},{"money":"$53,455,567","country":"USA","day":"17","month":"08","year":"1997","remarks":""},{"money":"$53,280,458","country":"USA","day":"10","month":"08","year":"1997","remarks":""},{"money":"$53,073,687","country":"USA","day":"03","month":"08","year":"1997","remarks":""},{"money":"$52,817,067","country":"USA","day":"27","month":"07","year":"1997","remarks":""},{"money":"$52,428,058","country":"USA","day":"20","month":"07","year":"1997","remarks":""},{"money":"$51,877,181","country":"USA","day":"13","month":"07","year":"1997","remarks":""},{"money":"$50,978,277","country":"USA","day":"06","month":"07","year":"1997","remarks":""},{"money":"$49,981,181","country":"USA","day":"29","month":"06","year":"1997","remarks":""},{"money":"$48,548,047","country":"USA","day":"22","month":"06","year":"1997","remarks":""},{"money":"$46,043,157","country":"USA","day":"15","month":"06","year":"1997","remarks":""},{"money":"$42,884,395","country":"USA","day":"08","month":"06","year":"1997","remarks":""},{"money":"$39,281,393","country":"USA","day":"01","month":"06","year":"1997","remarks":""},{"money":"$35,070,898","country":"USA","day":"26","month":"05","year":"1997","remarks":""},{"money":"$27,507,435","country":"USA","day":"18","month":"05","year":"1997","remarks":""},{"money":"$19,496,896","country":"USA","day":"11","month":"05","year":"1997","remarks":""},{"money":"$9,548,111","country":"USA","day":"04","month":"05","year":"1997","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1997/\">1997</a>"},{"money":"6,521","country":"Netherlands","day":"31","month":"12","year":"1998","remarks":""},{"money":"6,491","country":"Netherlands","day":"01","month":"01","year":"1998","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1996/\">1996</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 34 min (94 min)","1 hr 29 min (89 min) (USA)","1 hr 8 min (68 min) (TV) (Turkey)"],"soundMix":["Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["2.00 : 1 (DVD version)","2.35 : 1"],"camera":["Panavision Camera and Lenses"],"laboratory":["Consolidated Film Industries (CFI), Hollywood (CA), USA (dailies)","DeLuxe, Toronto, Canada (prints)"],"filmLength":["2,650 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm"]},"rating":"7.0","metascore":"51","filmingLocations":[{"location":"Santa Clarita, California, USA"}],"rated":"PG-13","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1998","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best Fantasy Film","names":[]}]},{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Costumes","names":[{"name":"Deena Appel","id":"nm0032196","role":null}]}]}]},{"award":"Blockbuster Entertainment Awards 1998","titlesAwards":[{"titleAwardOutcome":"Nominated Blockbuster Entertainment Award","categories":[{"category":"Favorite Actor - Comedy","names":[{"name":"Mike Myers","id":"nm0000196","role":null}]},{"category":"Favorite Actress - Comedy","names":[{"name":"Elizabeth Hurley","id":"nm0000167","role":null}]}]}]},{"award":"MTV Movie Awards 1998","titlesAwards":[{"titleAwardOutcome":"Won MTV Movie Award","categories":[{"category":"Best Villain","names":[{"name":"Mike Myers","id":"nm0000196","role":null}]},{"category":"Best Dance Sequence","names":[{"name":"Mike Myers","id":"nm0000196","role":null}]}]},{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Best Movie","names":[]},{"category":"Best Comedic Performance","names":[{"name":"Mike Myers","id":"nm0000196","role":null}]}]}]},{"award":"Online Film & Television Association 1998","titlesAwards":[{"titleAwardOutcome":"Nominated OFTA Film Award","categories":[{"category":"Best First Feature Film","names":[{"name":"Jay Roach","id":"nm0005366","role":null}]}]}]}],"votes":"189,637","type":"Movie","companyCreditsSimple":[{"idCompany":"co0009948","name":"Capella International"},{"idCompany":"co0048779","name":"Eric's Boy"},{"idCompany":"co0043545","name":"Juno Pix"}],"keywords":{"keywords":["spy","spoof","fembot","bullet firing bra","hot tub","hairy chest","scene during end credits","outer space","breaking the fourth wall","time travel","product placement","las vegas nevada","actor playing multiple roles","cat","surrealism","cartoon on tv","reference to jimi hendrix","reference to frankenstein","cult film","1990s","agent","british","secret agent","1960s","free love","musical sequence in non musical work","seductive fembot","fem bot","british secret service","eye patch","explosion","nuclear threat","british army","shootout","soldier","factory","hotel","revenge","nightclub","assassination attempt","irish","female assassin","assassin","double entendre","gadgetry","gadget","female agent","absurd violence","robot","pistol","female spy","culture clash","single parent","male nudity","female nudity","actor playing both hero and villain","written by star","culture shock","jumping fish","bass","united nations","reference to princess diana","reference to prince charles","reference to margaret thatcher","reference to andy warhol","escape pod","texan stereotype","sex with a robot","bad pun","year 1967","fish out of water","implied nudity","garrote","pants around ankles","reanimation","reference to janis joplin","dental floss","reference to mama cass","burned alive","british stereotype","irish stereotype","unprotected sex","one night stand","twister the game","man with glasses","evil man","sphynx cat","knocked out","barefoot","condom reference","reference to liberace","reference to oprah winfrey","reference to lucky charms cereal","posing as husband and wife","punctuation in title","sexy agent","penis pump","korean","beavis and butt head","head in a toilet","gadget car","good versus evil","evil plot","femme fatale","first of series","reverse footage","tour","telescope","tank","photographer","penthouse apartment","model","marriage","man disguised as a woman","laughing","fish","disguise","dance","compact disc","airplane","hero from the past","summer of love","penis enlarger","invincible henchman","future shock","exploding head","android","desert eagle","james bond spoof","urination","8 track","loneliness","group therapy","psychedelia","father son relationship","run over by a steamroller","cryonics","retro style secret agent","trapdoor","casino","desert","spy spoof","london england","sexual overtones","sexual promiscuity","teeth","big boy statue","cryogenics","mother daughter relationship","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:32:37"}}