{"data":{"movies":[{"title":"The Story Lady","originalTitle":"","year":"1991","releaseDate":"19911209","directors":[{"name":"Larry Elikann","id":"nm0253605"}],"writers":[{"name":"Robert Zeschin","id":"nm0955150"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzY5NTEwNTAwOV5BMl5BanBnXkFtZTcwMzkxNDQzMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Family"],"plot":"When Grace comes to live with her daughter and son-in-law, she is eager to find a way to be useful in the community. She loves to read stories to children, and decides to read one on public access television. The response is so strong that a large company hears about it and offers her a television series. Her life becomes complicated as she is forced to make some serious decisions. Through it all, Grace is able to help a young mother realize that time is the most valuable gift she could give to her daughter.","simplePlot":"When Grace comes to live with her daughter and son-in-law, she is eager to find a way to be useful in the community. She loves to read stories to children, and decides to read one on public... ","actors":[{"actorName":"Jessica Tandy","urlProfile":"http://www.imdb.com/name/nm0001788","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NjUyODQzNV5BMl5BanBnXkFtZTcwNzA5ODgwMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1909","placeOfBirth":" Stoke Newington, London, England, UK","birthName":"Jessie Alice Tandy","height":"5' 4\" (1.63 m)","bio":"A beloved, twinkly blue-eyed doyenne of stage and screen, actress Jessica Tandy's career spanned nearly six and a half decades. In that course of time, she enjoyed an amazing film renaissance at age 80, something unheard of in a town that worships youth and nubile beauty. She was born Jessie Alice Tandy in London in 1909, the daughter of Jessie Helen (Horspool), the head of a school for mentally handicapped children, and Harry Tandy, a traveling salesman. Her parents enrolled her as a teenager at the Ben Greet Academy of Acting where she showed immediate promise. She was 16 when she made her professional bow as Sara Manderson in the play \"The Manderson Girls\", and was subsequently invited to join the Birmingham Repertory Theatre. Within a couple of years, Jessica was making a number of other debuts as well. Her first West End play was in \"The Rumour\" at the Court Theatre in 1929; her Gotham bow was in \"The Matriarch\" at the Longacre Theatre in 1930; and her initial film role was as a maid in The Indiscretions of Eve (1932). Jessica married British actor Jack Hawkins in 1932 after the couple had met performing in the play \"Autumn Crocus\" the year before. They had one daughter, Susan, before parting ways after eight years of marriage. An unconventional beauty with slightly stern-eyed and sharp, hawkish features, she was passed over for leading lady roles in films, thereby focusing strongly on a transatlantic stage career throughout the 1930s and 1940s. She grew in stature while enacting a succession of Shakespeare's premiere ladies (Titania, Viola, Ophelia, Cordelia). At the same time, she enjoyed personal successes elsewhere in such plays as \"French Without Tears\", \"Honour Thy Father\", \"Jupiter Laughs\", \"Anne of England\" and \"Portrait of a Madonna\". And then she gave life to Blanche DuBois. When Tennessee Williams' masterpiece \"A Streetcar Named Desire\" opened on Broadway on December 3, 1947, Jessica's name became forever associated with this entrancing Southern belle character. One of the most complex, beautifully drawn, and still sought-after femme parts of all time, she went on to win the coveted Tony award. Aside from introducing Marlon Brando to the general viewing public, \"Streetcar\" shot Jessica's marquee value up a thousandfold. But not in films. While her esteemed co-stars Brando, Kim Hunter and Karl Malden were given the luxury of recreating their roles in Elia Kazan's stark, black-and-white cinematic adaptation of A Streetcar Named Desire (1951), Jessica was devastatingly bypassed. Vivien Leigh, who played the role on stage in London and had already immortalized another coy, manipulative Southern belle on celluloid (Scarlett O'Hara), was a far more marketable film celebrity at the time and was signed on to play the delusional Blanche. To be fair, Leigh was nothing less than astounding in the role and went on to deservedly win the Academy Award (along with Malden and Hunter). Jessica would exact her revenge on Hollywood in later years. In 1942, she entered into a second marriage with actor/producer/director Hume Cronyn, a 52-year union that produced two children, Christopher and Tandy, the latter an actor in her own right. The couple not only enjoyed great solo success, they relished performing in each other's company. A few of their resounding theatre triumphs included the \"The Fourposter\" (1951), \"Triple Play\" (1959), \"Big Fish, Little Fish (1962), \"Hamlet\" (he played Polonius; she played Gertrude) (1963), \"The Three Sisters (1963) and \"A Delicate Balance.\" They supported together in films too, their first being The Seventh Cross (1944). In the film The Green Years (1946), Jessica, who was two years older than Cronyn, actually played his daughter! Throughout the 1950s, they built up a sturdy reputation as \"America's First Couple of the Theatre.\" In 1963, Jessica made an isolated film appearance in Alfred Hitchcock's classic The Birds (1963). Low on the pecking order at the time (pun intended), Hitchcock gave Jessica a noticeable secondary role and Jessica made the most of her brittle scenes as the high-strung, overbearing mother of Rod Taylor who witnesses horror along the California coast. It was not until the 1980s that Jessica (and Hume, to a lesser degree) experienced a mammoth comeback in Hollywood. Alongside Hume she delighted movie audiences in such enjoyable fare as Honky Tonk Freeway (1981), The World According to Garp (1982), Cocoon (1985) and *batteries not included (1987). In 1989, however, octogenarian Jessica was handed the senior citizen role of a lifetime as the prickly Southern Jewish widow who gradually forms a trusting bond with her black chauffeur in the genteel drama Driving Miss Daisy (1989). Jessica was presented with the Oscar, Golden Globe and British Film Awards, among others, for her exceptional work in the film that also won \"Best Picture\". Deemed Hollywood royalty now, she was handed the cream of the crop in elderly film parts and went on to win another Oscar nomination for Fried Green Tomatoes (1991) a couple of years later. Jessica also enjoyed some of her biggest stage hits (\"Streetcar\" notwithstanding) during her twilight years, earning two more Tony Awards for her exceptional work in \"The Gin Game\" (1977) and \"Foxfire\" (1982). Both co-starred her husband Hume and both were beautifully transferred by the couple to television. Diagnosed with ovarian cancer in 1990, Jessica bravely continued working with Emmy-winning distinction on television. She died of her illness on September 11, 1994. Her last two films, Nobody's Fool (1994) and Camilla (1994), were released posthumously.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NjUyODQzNV5BMl5BanBnXkFtZTcwNzA5ODgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001788","name":"Jessica Tandy","idIMDB":"nm0001788"},"actorId":"nm0001788","character":"Grace McQueen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephanie Zimbalist","urlProfile":"http://www.imdb.com/name/nm0000258","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNjkwNjQ3OV5BMl5BanBnXkFtZTcwMzg3NTMzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 October 1956","placeOfBirth":" New York City, New York, USA","height":"5' 5½\" (1.66 m)","bio":"Born in Manhattan and raised in Los Angeles, Stephanie grew up swimming, riding, playing tennis, dancing, diving, clowning around, doing chores, and living the normal life of a tomboy in the great expanse of the San Fernando Valley. As a very young amateur theatrical entrepreneur, she produced, wrote, and directed pieces in her little bedroom hallway, in the stable, and on neighbors' fireplace hearths, earning her the title, \"the boss\". But Stephanie's abiding love of theater was kindled at Brown Ledge Camp in Mallett's Bay, Vermont, where she acted, sang, and was nurtured in theater craft for six summers. Friends she made there count among her friends today. Eager to get on with it, she created her own independent project in her senior year at Foxcroft School in Middleburg, Virginia: she returned to Los Angeles to study acting, movement, voice, tap and ballet. After graduating cum laude from high school, Stephanie's ambitions led her to choose a professional drama school over university, and she spent a challenging time in New York \"getting a dose of it\". Returning to Los Angeles once again, she worked for her brother and sister-in-law's company, \"Correia Art Glass\", while she made the audition rounds. In time, she gave up packing glass to star in television movies, among them the Emmy Award-winning The Gathering (1977), Centennial (1978), The Golden Moment: An Olympic Love Story (1980) and Tomorrow's Child (1982), along with the occasional guest series role. After several such projects and two feature films - The Magic of Lassie (1978), with James Stewart, and The Awakening (1980), with Charlton Heston - Stephanie was offered the role of \"Laura Holt\" in the MTM series, Remington Steele (1982), which she played for five years with Pierce Brosnan and Doris Roberts on NBC. She appeared as Caroline? (1990) for Hallmark on CBS, which won three Emmys and earned her a Golden Globe nomination. Subsequently, Stephanie starred in The Story Lady (1991) with Jessica Tandy, Incident in a Small Town (1994) for CBS with Walter Matthau and Harry Morgan, and Stop the World, I Want to Get Off (1996), the musical, on A&E, to name a few of her more than thirty television movie appearances. Stephanie starred in Lifetime Television's 50th movie, Prison of Secrets (1997), followed by an episode of Touched by an Angel (1994), their highest-rated show to that date. She was happy to be back in the saddle, in Ventura and Ojai, no less, filming an independent movie with Dennis Hopper called The Prophet's Game (2000), followed by À la frontière du coeur (2001) in Saskatchewan, Malpractice (2001) in New Orleans, and another Touched by an Angel (1994). More recently, she spent a happy time guesting on Crossing Jordan (2001). Striving for excellence has always been very important to Stephanie, partly due to the standards set by her illustrious family. Alma Gluck, her grandmother, was one of the great sopranos of her day. Efrem Zimbalist Sr., her beloved grandfather, was a celebrated violinist, composer, and gifted teacher and director of the Curtis Institute of Music. Her aunt, Marcia Davenport, was a brilliant historical writer and novelist. Her wonderful father, Efrem Zimbalist Jr., is a prize-winning Broadway producer (Gian Carlo Menotti's \"The Consul\", \"The Medium\" and \"The Telephone\"), gifted composer, and celebrated actor (77 Sunset Strip (1958), The F.B.I. (1965), and many movies). His stunning \"Violin Sonata\" has been performed at several summer concert series. Her brother Efrem (\"Skip\") and his company, \"Active Interest Media\", publish several magazines. After debuting on stage in the musical \"Festival\" in 1979 at the Las Palmas Theater in Los Angeles with Gregory Harrison and Brian Stokes Mitchell, Stephanie appeared as \"Miranda\" in \"The Tempest\" with Anthony Hopkins and Brent Carver at the Mark Taper Forum. Other theater includes \"The Cherry Orchard\" at the Long Wharf Theater, \"Summer and Smoke\" and \"Barbarians\" at the Williamstown Theatre Festival, and the national tour of \"My One And Only\" with Tommy Tune. In 1989, she initiated a play to be written for her and Linda Purl, and directed by Jenny Sullivan - \"The Baby Dance\" by Jane Anderson - which they produced and starred in at the Pasadena Playhouse. The production moved to Williamstown and Long Wharf, and culminated in a critically-acclaimed run at the Lucille Lortel Theatre in New York City. She played \"Polly Peacham\" in \"The Threepenny Opera\" with Betty Buckley at Williamstown, and had a wonderful time with \"Tracy Lord\" in \"The Philadelphia Story\" at the Cleveland PlayHouse. In 1994, Stephanie took on the double roles of an Irish peasant and a New Bedford fisherman's wife in the original production of \"The Crimson Thread\" in Connecticut (which she co-produced), and the Pasadena Playhouse. A second tread on the L.A. boards under Jenny Sullivan's direction was the hilarious, tour de force turn as a nail-spitting media barracuda in the West Coast premiere of \"AdWars\" with the wonderful David Dukes (R.I.P.). At L.A.'s Coronet Theater for many months, Stephanie kicked up a lot of sand as the lovable dog in A.R. Gurney's \"Sylvia\". In 1998, she starred in the world premiere of Jane Martin's \"Mr. Bundy\" at the Humana Festival of Actors Theatre of Louisville, and happily played opposite Lucie Arnaz in \"Wonderful Town\" for the Reprise! series in L.A. Stephanie was thrilled to be reunited with her dear \"Baby Dance\" friends, John Bennett Perry and Jenny Sullivan for the Rubicon Theatre's award-winning, double run of \"The Rainmaker\". A dream came true, tackling the towering role of \"Terry\" in Warren Leight's knockout \"Side Man\" at the Guthrie Theater in Minneapolis, followed by a tour of \"Accomplice\" on the east coast (after a month's holiday in London, St. Petersberg, Moscow, Rostov [birthplace of her grandfather, Efrem Zimbalist Sr.], Istanbul, Athens, and sailing the Dodecanes!). For several springs now, Stephanie has opened the Tennessee Williams New Orleans Literary Festival with a reading of one of his plays at their Gala event - she's happily shared those boards with Alec Baldwin, Elizabeth Ashley, John Goodman, Patricia Neal, Linda Hart, and the charming Rex Reed. Having worked in New Orleans with the Festival and in Malpractice (2001) and made friends in Nola, the recent tragedies there hit especially hard. Stephanie had another dream come true, to play \"Varya\" in \"The Cherry Orchard\", with the added thrill of playing opposite one of her acting heroes, the amazing and delightful Alfred Molina. Recently, she played \"Ursula\" in Nicholas Wright's wonderful play, \"Vincent in Brixton\", at the Pasadena Playhouse. Also at the Rubicon Theatre, she's played in Brian Friel's \"Dancing at Lughnasa\", Jane Anderson's \"Defying Gravity\", and trod the boards with her father, Efrem Zimbalist Jr., for the first time, in Tennessee Williams's \"The Night of the Iguana\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNjkwNjQ3OV5BMl5BanBnXkFtZTcwMzg3NTMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000258","name":"Stephanie Zimbalist","idIMDB":"nm0000258"},"actorId":"nm0000258","character":"Julie Pollard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lisa Jakub","urlProfile":"http://www.imdb.com/name/nm0004356","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTAyOTYyMzExMl5BMl5BanBnXkFtZTcwODM0NTgwMw@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 December 1978","placeOfBirth":" Toronto, Ontario, Canada","height":"5' 8\" (1.73 m)","bio":"Lisa Jakub was born on December 27, 1978 in Toronto, Ontario, Canada. She is an actress and producer, known for Mrs. Doubtfire (1993), Independence Day (1996) and George Lucas in Love (1999). She has been married to Jeremy since June 2005.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTAyOTYyMzExMl5BMl5BanBnXkFtZTcwODM0NTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004356","name":"Lisa Jakub","idIMDB":"nm0004356"},"actorId":"nm0004356","character":"Alexandra Pollard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Gartin","urlProfile":"http://www.imdb.com/name/nm0308651","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNjg4MTg0Nl5BMl5BanBnXkFtZTcwMTYwMjMxNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 January 1968","placeOfBirth":" New York City, New York, USA","birthName":"Christopher Russell Gartin","height":"5' 9\" (1.75 m)","bio":"Chris Gartin was born on January 12, 1968 in New York City, New York, USA as Christopher Russell Gartin. He is an actor and producer, known for Black Swan (2010), Tremors II: Aftershocks (1996) and Transcendence (2014). He was previously married to Joanne Ahlfield.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNjg4MTg0Nl5BMl5BanBnXkFtZTcwMTYwMjMxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0308651","name":"Chris Gartin","idIMDB":"nm0308651"},"actorId":"nm0308651","character":"Scott","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tandy Cronyn","urlProfile":"http://www.imdb.com/name/nm0188853","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjMyMDI1MjA0Ml5BMl5BanBnXkFtZTcwMTY1NjYzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 November 1945","placeOfBirth":" Los Angeles, California, USA","bio":"Tandy Cronyn was born on November 26, 1945 in Los Angeles, California, USA. She is an actress, known for Guiding Light (1952), Il était une fois en Amérique (1984) and Le dernier rempart (1984).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjMyMDI1MjA0Ml5BMl5BanBnXkFtZTcwMTY1NjYzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0188853","name":"Tandy Cronyn","idIMDB":"nm0188853"},"actorId":"nm0188853","character":"Meg","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Masur","urlProfile":"http://www.imdb.com/name/nm0557956","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4MzU5NTQyOF5BMl5BanBnXkFtZTcwNjk5NzkyOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 November 1948","placeOfBirth":" New York City, New York, USA","height":"6' 1\" (1.85 m)","bio":"Masur has also been active in the theatre with increasing frequency. His Broadway debut was in The Changing Room by David Storey (1973). More recently, Masur returned to Broadway in Michael Frayn's Democracy (2004-05), and, among his many off-Broadway and regional theatre appearances, are recent major roles in A Feminine Ending by Sarah Treem (Playwrights Horizons - 2007), and Mike Leigh's Two Thousand Years (The New Group - 2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4MzU5NTQyOF5BMl5BanBnXkFtZTcwNjk5NzkyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0557956","name":"Richard Masur","idIMDB":"nm0557956"},"actorId":"nm0557956","character":"Norm Denton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ed Begley Jr.","urlProfile":"http://www.imdb.com/name/nm0000893","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1ODI0NDgxN15BMl5BanBnXkFtZTYwODU1MDcy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1949","placeOfBirth":" Los Angeles, California, USA","birthName":"Edward James Begley Jr.","height":"6' 4\" (1.93 m)","bio":"Ed Begley Jr. was born on September 16, 1949 in Los Angeles, California, USA as Edward James Begley Jr. He is an actor and producer, known for Ghostbusters (2016), St. Elsewhere (1982) and Pineapple Express (2008). He has been married to Rachelle Carson since August 23, 2000. They have one child. He was previously married to Ingrid Taylor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1ODI0NDgxN15BMl5BanBnXkFtZTYwODU1MDcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000893","name":"Ed Begley Jr.","idIMDB":"nm0000893"},"actorId":"nm0000893","character":"Otis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Luis Avalos","urlProfile":"http://www.imdb.com/name/nm0042757","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NzgzOTk0MV5BMl5BanBnXkFtZTYwMTEyMTk0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 September 1946","placeOfBirth":" Havana, Cuba","birthName":"Luis Ávalos","bio":"Luis Avalos was born on September 2, 1946 in Havana, Cuba as Luis Ávalos. He was an actor and director, known for The Electric Company (1971), The Ringer (2005) and Jungle 2 Jungle (1997). He died on January 22, 2014 in Burbank, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NzgzOTk0MV5BMl5BanBnXkFtZTYwMTEyMTk0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0042757","name":"Luis Avalos","idIMDB":"nm0042757"},"actorId":"nm0042757","character":"Mr. Riley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andre Rosey Brown","urlProfile":"http://www.imdb.com/name/nm0113012","urlPhoto":"","biography":{"dateOfBirth":"7 February 1956","placeOfBirth":" Rockford, Illinois, USA","height":"6' 4\" (1.93 m)","bio":"Andre Rosey Brown was born on February 7, 1956 in Rockford, Illinois, USA. He was an actor, known for Naked Gun 33 1/3: The Final Insult (1994), Space Jam (1996) and Tango & Cash (1989). He was married to Debra Lynn Loomis. He died on July 18, 2006 in Northridge, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0113012","name":"Andre Rosey Brown","nicknames":["Bigg Mann"],"idIMDB":"nm0113012"},"actorId":"nm0113012","character":"Security Guard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Champion","urlProfile":"http://www.imdb.com/name/nm0150693","urlPhoto":"","biography":{"bio":"Charles Champion is an actor, known for The Story Lady (1991), Out of the Dark (1988) and The Case of the Hillside Stranglers (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0150693","name":"Charles Champion","idIMDB":"nm0150693"},"actorId":"nm0150693","character":"Larry Freeman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ellen Crawford","urlProfile":"http://www.imdb.com/name/nm0186761","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxODM4NTMwOV5BMl5BanBnXkFtZTcwMDg0MTgxOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1951","placeOfBirth":" Normal, Illinois, USA","bio":"Ellen Crawford was born on April 29, 1951 in Normal, Illinois, USA. She is an actress, known for ER (1994), The Man from Earth (2007) and The War of the Roses (1989). She is married to Mike Genovese.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxODM4NTMwOV5BMl5BanBnXkFtZTcwMDg0MTgxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0186761","name":"Ellen Crawford","idIMDB":"nm0186761"},"actorId":"nm0186761","character":"Rita","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mary Pat Gleason","urlProfile":"http://www.imdb.com/name/nm0322325","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3ODEzMTQ4NF5BMl5BanBnXkFtZTcwNTkxMjYzNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Mary Pat Gleason is an actress and writer, known for 13 Going on 30 (2004), Basic Instinct (1992) and I Now Pronounce You Chuck & Larry (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3ODEzMTQ4NF5BMl5BanBnXkFtZTcwNTkxMjYzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0322325","name":"Mary Pat Gleason","idIMDB":"nm0322325"},"actorId":"nm0322325","character":"Receptionist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeanine Jackson","urlProfile":"http://www.imdb.com/name/nm0413642","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMzM4MjgzMV5BMl5BanBnXkFtZTcwNjYyNTYxOQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Jeanine Jackson is an actress, known for Election (1999), The Craft (1996) and Dragon rouge (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMzM4MjgzMV5BMl5BanBnXkFtZTcwNjYyNTYxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0413642","name":"Jeanine Jackson","idIMDB":"nm0413642"},"actorId":"nm0413642","character":"Mrs. Oberg","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jean Kasem","urlProfile":"http://www.imdb.com/name/nm0440488","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA5NzU5NzE1OF5BMl5BanBnXkFtZTcwNzA3NDExOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1954","placeOfBirth":" Portsmouth, New Hampshire, USA","birthName":"Jean Thompson","height":"5' 10\" (1.78 m)","bio":"Jean Kasem was born in 1954 in Portsmouth, New Hampshire, USA as Jean Thompson. She is an actress, known for Ghostbusters (1984), The Tortellis (1987) and The Story Lady (1991). She was previously married to Casey Kasem.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA5NzU5NzE1OF5BMl5BanBnXkFtZTcwNzA3NDExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0440488","name":"Jean Kasem","idIMDB":"nm0440488"},"actorId":"nm0440488","character":"Sensuous Witch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Mitz","urlProfile":"http://www.imdb.com/name/nm0594209","urlPhoto":"","biography":{"bio":"Michael Mitz was born in Milwaukee, Wisconsin, USA. He is an actor, known for Once in a Lifetime (1994), The Story Lady (1991) and Magic Kid II (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0594209","name":"Michael Mitz","idIMDB":"nm0594209"},"actorId":"nm0594209","character":"Ben Hodgkins","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0102988","urlIMDB":"http://www.imdb.com/title/tt0102988","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 34 min (94 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":["Consolidated Film Industries (CFI), Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.4","filmingLocations":[],"rated":"G","awards":[{"award":"Golden Globes, USA 1992","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Performance by an Actress in a Miniseries or Motion Picture Made for Television","names":[{"name":"Jessica Tandy","id":"nm0001788","role":null}]}]}]},{"award":"Retirement Research Foundation, USA 1992","titlesAwards":[{"titleAwardOutcome":"2nd place Wise Owl Award","categories":[{"category":"Television and Theatrical Film Fiction","names":[{"name":"Joseph B. Wallenstein","id":"nm0909010","role":null},{"name":"Michael Filerman","id":"nm0276871","role":"executive"},{"name":"Margery Nelson","id":"nm0625576","role":"executive"}]}]}]}],"votes":"326","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0164284","name":"Jones Programming Partners"},{"idCompany":"co0078843","name":"Michael Filerman Productions"},{"idCompany":"co0065874","name":"NBC Productions"}],"keywords":{"keywords":["daughter","children","contract","son in law","judge","public access television","mother","lawyer","christmas","school","new york city","library","courtroom","reading","camera","vcr","suburb","taxi","stage","running","audience","meeting","friendship","ice rink","decoration","suitcase","ponytail","laughter","drawing","fan mail","braids","photograph","voice over","surveillance camera","bridge","old lady","metropolis","tv camera","theft","traffic jam","play","grandfather clock","tv director","video cassette","uniform","ventriloquist","storyteller","singing","pianist","pet bird","police station","security guard","department store","christmas tree","movie set","santa claus","businesswoman","restaurant","horse and carriage","advertising agency","police officer","rocking chair","little boy","reference to hans christian andersen","video camera","remote control","microphone","tv studio","dressing room","monitor","little girl","tv show","paralegal","city park","present","siren","press","candle","reporter","arrest","tripod","x ray","anger","bear","dentist","applause","wheelchair","senior citizen","old woman","book","single parent","single mother","reading aloud","cookie","gingerbread man","school uniform","school play","girl","child","tv host","costume","children's show host","children's tv show host","watching tv","snowing","snow","christmas carol","mother daughter relationship","dollhouse","shoplifting","fish out of water","fairy tale","real life mother and daughter playing mother and daughter"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:05:50"}}