{"data":{"movies":[{"title":"Belles à mourir","originalTitle":"Drop Dead Gorgeous","year":"1999","releaseDate":"19990723","directors":[{"name":"Michael Patrick Jann","id":"nm0417794"}],"writers":[{"name":"Lona Williams","id":"nm0931185"}],"runtime":"97 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNzk3OTg2M15BMl5BanBnXkFtZTYwMTIyODc5._V1.jpg","countries":["Germany","USA"],"languages":["English"],"genres":["Comedy","Romance","Thriller"],"plot":"In a small Minnesota town, the annual beauty pageant is being covered by a TV crew. Former winner Gladys Leeman wants to make sure her daughter follows in her footsteps. Explosions, falling lights, and trailer fires prove that. As the Leemans are the richest family in town the police are pretty relaxed about it all. Despite everything, main rival (but nice) Amber Atkins won't be stopped. There could well be more death and disappointment to come.","simplePlot":"A small-town beauty pageant turns deadly as it becomes clear that someone will go to any lengths to win.","actors":[{"actorName":"Kirsten Dunst","urlProfile":"http://www.imdb.com/name/nm0000379","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NzkwNzM1MV5BMl5BanBnXkFtZTgwMzE2MTQ3MjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 April 1982","placeOfBirth":" Point Pleasant, New Jersey, USA","birthName":"Kirsten Caroline Dunst","height":"5' 6\" (1.68 m)","bio":"Kirsten Caroline Dunst is an American actress, who also holds German citizenship. She was born on April 30, 1982 in Point Pleasant, New Jersey, to parents Inez (née Rupprecht), who owned an art gallery, and Klaus Dunst, a medical services executive. She has a younger brother named Christian Dunst, born in 1987. Her father is German, from Hamburg, and her mother, who is American, is of German and Swedish descent. Her career began at the age of 3 when she started modeling and appearing in commercials. She made her feature film debut with an uncredited role at age 6 in the 'Oedipus Wrecks' segment of Woody Allen's 1989 film New York Stories (1989). She received her first film credit in The Bonfire of the Vanities (1990). Her family moved to Los Angeles in 1993, where her film career took off. In 1994, she made her breakthrough performance in Interview with the Vampire: The Vampire Chronicles (1994), alongside such stars as Brad Pitt and Tom Cruise. Her performance earned her a Golden Globe nomination, the MTV Award for Best Breakthrough Performance and the Saturn Award for Best Young Actress. In 1995, she was named one of People Magazine's 50 Most Beautiful People. Over the next few years, she made a string of hit movies including Little Women (1994), Jumanji (1995) and Small Soldiers (1998). In 2000, she received rave reviews for her role as \"Lux Lisbon\" in Sofia Coppola's independent film, The Virgin Suicides (1999) and proved her status as a leading actress in the comedy hit, Bring It On (2000). She also graduated from Notre Dame High School in Los Angeles in June of that year. In 2002, she landed one of her best known roles as Peter Parker's love interest, Mary Jane Watson, in Spider-Man (2002). She continued her role in Spider-Man 2 (2004) and Spider-Man 3 (2007). She went on to land roles in such films as Eternal Sunshine of the Spotless Mind (2004), the romantic comedy Wimbledon (2004), and in Cameron Crowe's Elizabethtown (2005). She also played the title character in Sofia Coppola's Marie Antoinette (2006). Dunst won the Best Actress Award at the 2011 Cannes Film Festival for her performance as Justine in Lars von Trier's Melancholia (2011). In 2012, she appeared in Walter Salles' film adaptation of Sur la route (2012) and the independent comedy Bachelorette (2012). She also has several films in production, including The Two Faces of January (2014). Her charity work includes designing a necklace to raise funds for the Elizabeth Glaser Pediatric AIDS Foundation as well as supporting various cancer charities.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NzkwNzM1MV5BMl5BanBnXkFtZTgwMzE2MTQ3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000379","name":"Kirsten Dunst","nicknames":["Kiki"],"idIMDB":"nm0000379"},"actorId":"nm0000379","character":"Amber Atkins","urlCharacter":"http://www.imdb.com/character/ch0014715","main":true},{"actorName":"Ellen Barkin","urlProfile":"http://www.imdb.com/name/nm0000289","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2OTk3MTgxNl5BMl5BanBnXkFtZTcwMTMxNDkxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 April 1954","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"Ellen Rona Barkin","height":"5' 6\" (1.68 m)","bio":"Offbeat, unconventionally pretty, and utterly mesmerizing, Ellen Barkin was born in 1954 in the Bronx, New York, to Evelyn (Rozin), a hospital administrator, and Sol Barkin, a chemical salesman. Her parents were both from Russian Jewish families. Raised in the South Bronx and Queens, New York area, she wanted to be an actress as early as her teens and was eventually accepted into Manhattan's High School of the Performing Arts. Barkin then attended Hunter College and received her degree after double majoring in history and drama. At one point she wanted to teach ancient history, but instead turned her thoughts back to her first love: acting. Barkin then continued her education at New York's Actor's Studio. Fearful of the auditioning process, she studied acting for seven years before finally landing her first audition. While continuing her studies, she worked as a waitress at the avant-garde Ocean Club. Performing off-Broadway in such plays \"Shout Across the River\" (1979), \"Extremities\" (1983), \"Fool for Love\" (1984) and \"Eden Court\" (1985), she was applauded across the board for her first film lead in Diner (1982) opposite Mickey Rourke and Daniel Stern, and pursued sexy tough-cookie status thereafter with such quirky roles in The Big Easy (1986) starring Dennis Quaid and Siesta (1987) with Irish actor Gabriel Byrne, whom she married in 1987 and separated from in 1993 after producing a son and daughter. She and Byrne divorced in 1999. With trademark squinting eyes and slightly off-kilter facial features, Barkin continued the fascination of her seamy/steamy girl-from-the-wrong-side-of-the-tracks status most notably opposite Al Pacino in the thriller Sea of Love (1989). In addition, she was well cast as Robert De Niro's abused wife in This Boy's Life (1993), and portrayed \"Calamity Jane\" in Wild Bill (1995) with earnest. Other impressionable offbeat projects included roles in Fear and Loathing in Las Vegas (1998), Belles à mourir (1999) and Mercy (2000). On TV, she was well-cast in the mini-movie Clinton and Nadine (1988) and won an Emmy award for her gripping performance in Before Women Had Wings (1997) opposite Oprah Winfrey as another abused wife who, in this case, turns her violent anger on her own daughters. In 2000, Barkin married billionaire Ronald O. Perelman, eleven years her senior and chairman of the Revlon company, and put her career relatively on hold, appearing sporadically in edgy films like She Hate Me (2004) and Palindromes (2004). Barkin and Perelman went through an acrimonious divorce in 2006. Just prior to her divorce in late 2005, Barkin ventured into independent film production with Applehead Pictures, a company she set up with her brother George Barkin, who is a scriptwriter and former editor-in-chief of National Lampoon and High Times, and former Independent Film Channel executive Caroline Kaplan. In her first major acting appearance since her divorce from Perelman, Barkin co-starred in Ocean's Thirteen (2007) with George Clooney, Matt Damon, Brad Pitt and former co-star Pacino. She followed up Ocean's with a supporting role in Antoine Fuqua's Brooklyn's Finest (2009), Happy Tears (2009) with Parker Posey and Demi Moore, and Twelve (2010). Recently, Barkin has produced features, including Letters to Juliet (2010) and Another Happy Day (2011) (she also starred in the latter project). On the small screen, she appeared in an episode of Modern Family (2009) and her new NBC show, The New Normal (2012), got a sneak peek during the Olympics. She lives with her two teenage children in Manhattan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2OTk3MTgxNl5BMl5BanBnXkFtZTcwMTMxNDkxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000289","name":"Ellen Barkin","idIMDB":"nm0000289"},"actorId":"nm0000289","character":"Annette Atkins","urlCharacter":"http://www.imdb.com/character/ch0014719","main":true},{"actorName":"Allison Janney","urlProfile":"http://www.imdb.com/name/nm0005049","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNjc2NzgxM15BMl5BanBnXkFtZTgwODQyMjM1MjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1959","placeOfBirth":" Dayton, Ohio, USA","birthName":"Allison Brooks Janney","height":"6' (1.83 m)","bio":"Allison Janney is an award-winning actress who has earned a solid reputation in stage productions and in many supporting roles on screen, and who more recently has become prominent by portraying one of the major characters in the popular TV series The West Wing (1999). Entertainment Weekly magazine describes Janney's screen presence as \"uncommonly beautiful and infinitely expressive\". As an actor, the magazine deems her to be \"one to watch\". Janney was born in Boston, Massachusetts, to Macy Brooks (Putnam), a former actress, and Jervis Spencer Janney, Jr., a real estate developer and jazz musician. While studying at Kenyon College, Janney answered a casting call for an on-campus play that was to be directed by Kenyon's most famous alumnus, the legendary actor Paul Newman. During her audition/interview, Janney played upon Newman's known passion for race car driving - she explained how she cut thirty minutes off of the 130 mile journey from her home town to the college. She got chosen for the play's cast. After earning her degree in drama, Janney took Joanne Woodward's suggestion to do further study at New York's Neighborhood Playhouse. She also studied at the Royal Academy of Dramatic Arts in London. Early in her career Janney got comedic roles in the soap operas As the World Turns (1956) and Guiding Light (1952). Later, she gave memorable movie performances in supporting roles in Belles à mourir (1999), 10 Things I Hate About You (1999), American Beauty (1999) and Nurse Betty (2000), and in the made-for-TV movie ...First Do No Harm (1997), among others. Among her stage work, Janney has played in a revival of Arthur Miller's \"A View From the Bridge\" on Broadway opposite Anthony LaPaglia, which earned her a Tony Award nomination, and a Drama League Award for outstanding artist for the 1997-98 season. She played in Noel Coward's \"Present Laughter\" opposite Frank Langella, which earned her the Outer Critics Circle Award and an Actors' Equity award. Janney also appeared in the New York Shakespeare Festival's production of \"The Taming of the Shrew\". In 1999 Janney became part of the original cast of the acclaimed TV series The West Wing (1999) where she played the President's press secretary who eventually gets promoted to the White House Chief of Staff. Her impressive work during the seven seasons of that renowned series earned her four Emmys and two SAG Awards. With her reputation becoming more broadly established during her work on \"The West Wing\" Janney won more substantive roles in feature films, in the acclaimed The Hours (2002) where she was Meryl Streep's lesbian lover, and in How to Deal (2003) where she played Mandy Moore's mother.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNjc2NzgxM15BMl5BanBnXkFtZTgwODQyMjM1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005049","name":"Allison Janney","idIMDB":"nm0005049"},"actorId":"nm0005049","character":"Loretta","urlCharacter":"http://www.imdb.com/character/ch0014720","main":true},{"actorName":"Denise Richards","urlProfile":"http://www.imdb.com/name/nm0000612","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNjYxNDU5OV5BMl5BanBnXkFtZTcwNTY5NDQwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1971","placeOfBirth":" Downers Grove, Illinois, USA","birthName":"Denise Lee Richards","height":"5' 6\" (1.68 m)","bio":"Denise Richards was born in Downers Grove, Illinois, the older of two daughters of Joni Lee, who owned a coffee shop, and Irv Richards, a telephone engineer. She has German, French-Canadian, Irish, English, and Welsh ancestry. She grew up in the Chicago area, until the family relocated to Oceanside, CA when Denise was 15. She began working as a model, and moved to L.A. after she graduated from high school. She landed parts in both TV and movies, and gave breakthrough performances in Starship Troopers (1997) with Casper Van Dien, Wild Things (1998) and The World Is Not Enough (1999), in which she plays a Bond Girl. She also was in Undercover Brother (2002) with Eddie Griffin and appeared in Scary Movie 3 (2003) with her now ex-husband, Charlie Sheen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNjYxNDU5OV5BMl5BanBnXkFtZTcwNTY5NDQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000612","name":"Denise Richards","nicknames":["Fluffy Girl"],"idIMDB":"nm0000612"},"actorId":"nm0000612","character":"Rebecca 'Becky' Ann Leeman","urlCharacter":"http://www.imdb.com/character/ch0014718","main":true},{"actorName":"Kirstie Alley","urlProfile":"http://www.imdb.com/name/nm0000263","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4Nzk3NTU4MV5BMl5BanBnXkFtZTYwNjQ4ODI4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 January 1951","placeOfBirth":" Wichita, Kansas, USA","birthName":"Kirstie Louise Alley","height":"5' 8\" (1.73 m)","bio":"Kirstie Alley was born on January 12, 1951 in Wichita, Kansas, USA as Kirstie Louise Alley. She is an actress and producer, known for Cheers (1982), Look Who's Talking (1989) and Veronica's Closet (1997). She was previously married to Parker Stevenson and Robert Alley.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4Nzk3NTU4MV5BMl5BanBnXkFtZTYwNjQ4ODI4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000263","name":"Kirstie Alley","idIMDB":"nm0000263"},"actorId":"nm0000263","character":"Gladys Leeman","urlCharacter":"http://www.imdb.com/character/ch0014721","main":true},{"actorName":"Sam McMurray","urlProfile":"http://www.imdb.com/name/nm0573481","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0OTUwNDM4MV5BMl5BanBnXkFtZTcwODIxMzM5OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 April 1952","placeOfBirth":" New York City, New York, USA","height":"6' 2\" (1.88 m)","bio":"Sam McMurray was born on April 15, 1952 in New York City, New York, USA. He is an actor and producer, known for Raising Arizona (1987), National Lampoon's Christmas Vacation (1989) and Belles à mourir (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0OTUwNDM4MV5BMl5BanBnXkFtZTcwODIxMzM5OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0573481","name":"Sam McMurray","idIMDB":"nm0573481"},"actorId":"nm0573481","character":"Lester Leeman","urlCharacter":"http://www.imdb.com/character/ch0014724","main":true},{"actorName":"Mindy Sterling","urlProfile":"http://www.imdb.com/name/nm0827565","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGMwOTBhMzgtOWI3MS00NjlkLWI3MjItNzdkMmY2ODcxNDAyXkEyXkFqcGdeQXVyMTEwOTU3NDk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1953","placeOfBirth":" Paterson, New Jersey, USA","birthName":"Mindy Lee Sterling","height":"5' 2½\" (1.59 m)","bio":"Mindy Sterling was born on July 11, 1953 in Paterson, New Jersey, USA as Mindy Lee Sterling. She is known for her work on Austin Powers: The Spy Who Shagged Me (1999), Austin Powers in Goldmember (2002) and Austin Powers: International Man of Mystery (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGMwOTBhMzgtOWI3MS00NjlkLWI3MjItNzdkMmY2ODcxNDAyXkEyXkFqcGdeQXVyMTEwOTU3NDk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0827565","name":"Mindy Sterling","idIMDB":"nm0827565"},"actorId":"nm0827565","character":"Iris Clark","urlCharacter":"http://www.imdb.com/character/ch0014722","main":true},{"actorName":"Brittany Murphy","urlProfile":"http://www.imdb.com/name/nm0005261","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MjM0MzMwNl5BMl5BanBnXkFtZTYwMTU4NDg1._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1977","placeOfBirth":" Atlanta, Georgia, USA","birthName":"Brittany Anne Bertolotti","height":"5' 3\" (1.6 m)","bio":"Brittany Murphy was born Brittany Anne Bertolotti on November 10, 1977 in Atlanta, Georgia, to Sharon Kathleen Murphy and Angelo Joseph Bertolotti. Her father's ancestry is Italian, and her mother is of Irish and Slovak descent. Her father moved the family back to Edison, New Jersey as a native New Yorker and to be closer to other siblings from previous marriages. While dining out one night in the presence of Hollywood royalty, Brittany at the age of 5 approached an adjoining table when Academy Award nominee Burt Reynolds and George Segal were seated. Brittany introduced herself to the Hollywood legends and confidently told them that someday she too would be a star. She comes from a long line of international musicians and performers with three half-brothers and a sister. Angelo Bertolotti was torn from their tight-knit family as a made-man with the Italian Mafia. The Senior Bertolotti, who coined the nickname of \"Britt\" for his daughter, was also an entrepreneur and diplomat for organized crime families and one of the first to be subjected to a RICO prosecution. Brittany's interests and well-being were always her father's first goal and objective. To distance his talented daughter from his infamous past, Angelo allowed Sharon to use her maiden for Brittany's, so that her shining star would not be overshadowed by a father's past, with the couple divorcing thereafter. Brittany began receiving accolades and applause in regional theater at the early age of 9. At the age of 13, Brittany landed several national commercials. She appeared on television and caught the attention of a personal manager and an agent. Soon, Brittany's mother Sharon turned full-time to being a \"Stage Mom\" where Angelo provided financial support throughout and their relationship is memorialized with a long and close history in pictures. The hopeful daughter and mother moved to Burbank, CA, where Brittany landed her first television role on Blossom (1990). Hearts and doors opened up for a starring role on Drexell's Class (1991), a short lived TV series. Brittany's big screen movie debut started with Clueless (1995), where she was co-starring with Alicia Silverstone. Britt soared, demonstrating her musical and artistic talents with dramatic and comedic roles landing a nomination for best leading female performance in the Young Artist Awards for her role in the television film David and Lisa (1998). Brittany garnered tremendous attention for her role in Girl, Interrupted (1999) with Academy Award winner Angelina Jolie. Brittany's band, \"Blessed Soul\" was growing with her as lead singer and Britt lent her vocal talents to the TV hit, cartoon sensation, King of the Hill (1997) as the voice of Luanne. Brittany is alleged to have been a witness in the case of the former Department of Homeland Security employee Julia Davis. According to Davis, Brittany and her fiancée Simon Monjack were then targeted for retaliation that included land and aerial surveillance and a threatened prosecution. Monjack was arrested and detained by the Bureau of Immigration and Customs Enforcement (ICE). Brittany and Simon confided in Alex Ben Block of the Hollywood Reporter, telling him in an interview that they were under surveillance by helicopters and their telephones have been wiretapped. This information was published by THR posthumously, in an article entitled \"The Last Difficult Days of Brittany Murphy.\" On December 20, 2009, Brittany Murphy died an untimely death. The LAPD and Los Angeles County Coroner closed the case within one hour, attributing her death to pneumonia and anemia. Five months after Brittany's unexpected demise, her husband Simon Monjack was found dead in the house he shared with Brittany. The chief/spokesperson at the Los Angeles County Dept of Coroner, Craig Harvey, stated that Simon also died from the same exact causes as his wife, namely pneumonia and anemia. Neither Brittany, nor Simon, were given a thorough and complete forensic autopsy for poisons. Brittany's father, Angelo \"AJ\" Bertolotti, is pursuing the investigation of the true reasons behind Brittany's and Simon's sudden demise, as he believes that the two were murdered. Abnormally high levels of heavy metals and poisons were discovered in Brittany's hair, tested by two other independent forensic labs with famed Pathologist, attorney Cyril Wecht concluded from the appearances, Brittany could have been murdered and should be exhumed. Her father Angelo is preparing court actions to ensure Brittany obtains justice.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MjM0MzMwNl5BMl5BanBnXkFtZTYwMTU4NDg1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005261","name":"Brittany Murphy","nicknames":["Britt"],"idIMDB":"nm0005261"},"actorId":"nm0005261","character":"Lisa Swenson","urlCharacter":"http://www.imdb.com/character/ch0014717","main":true},{"actorName":"Amy Adams","urlProfile":"http://www.imdb.com/name/nm0010736","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NjExMjI1OF5BMl5BanBnXkFtZTcwODc0MjY2OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 August 1974","placeOfBirth":" Vicenza, Veneto, Italy","birthName":"Amy Lou Adams","height":"5' 4\" (1.63 m)","bio":"Amy Lou Adams was born in Vicenza, Veneto, Italy, to American parents, Kathryn (Hicken) and Richard Kent Adams, a U.S. serviceman who was stationed at Caserma Ederle in Italy at the time. She was raised in a Mormon family of seven children in Castle Rock, Colorado, and has English, as well as smaller amounts of Danish, Swiss-German, and Norwegian, ancestry. Adams sang in the school choir at Douglas County High School and was an apprentice dancer at a local dance company, with the ambition of becoming a ballerina. However, she worked as a greeter at The Gap and as a Hooters hostess to support herself before finding work as a dancer at Boulder's Dinner Theatre and Country Dinner Playhouse in such productions as \"Brigadoon\" and \"A Chorus Line\". It was there that she was spotted by a Minneapolis dinner-theater director who asked her to move to Chanhassen, Minnesota for more regional dinner theater work. Nursing a pulled muscle that kept her from dancing, she was free to audition for a part in Belles à mourir (1999), which was filming nearby in Minnesota. During the filming, Kirstie Alley encouraged her to move to Los Angeles, where she soon won a part in the Fox television version of the film, Cruel Intentions (1999), in the part played in the film by Sarah Michelle Gellar, \"Kathryn Merteuil\". Although three episodes were filmed, the troubled series never aired. Instead, parts of the episodes were cobbled together and released as the direct-to-video Cruel Intentions 2 (2000). After more failed television spots, she landed a major role in Catch Me If You Can (2002), playing opposite Leonardo DiCaprio. But this did not provide the break-through she might have hoped for, with no work being offered for about a year. She eventually returned to television, and joined the short-lived series, Dr. Vegas (2004). Her role in the low-budget independent film Junebug (2005) (which was shot in 21 days) got her real attention, including an Academy Award nomination for Best Supporting Actress as well as other awards. The following year, her ability to look like a wide-eyed Disney animated heroine helped her to be chosen from about 300 actresses auditioning for the role of \"Giselle\" in the animated/live-action feature film, Enchanted (2007), which would prove to be her major break-through role. Her vivacious yet innocent portrayal allowed her to use her singing and dancing talents. Her performance garnered a Golden Globe Award nomination for Best Actress in a Motion Picture Musical or Comedy. Adams next appeared in the major production, Charlie Wilson's War (2007), and went on to act in the independent film, Sunshine Cleaning (2008), which premiered at the 2008 Sundance Film Festival. Her role as \"Sister James\" in Doubt (2008) brought her a second Academy Award nomination for Best Supporting Actress, as well as nominations for a Golden Globe, a Screen Actors Guild award, and a British Academy Film award. She appeared as Amelia Earhart in Night at the Museum: Battle of the Smithsonian (2009) and as a post-9/11 hot line counselor, aspiring writer, amateur cook and blogger in Julie & Julia (2009). In the early 2010s, she starred with Jason Segel in The Muppets (2011), with Philip Seymour Hoffman in Paul Thomas Anderson's The Master (2012), and alongside Clint Eastwood and Justin Timberlake in Trouble with the Curve (2012). She played reporter Lois Lane in Man of Steel (2013) and con artist Sydney Prosser in American Hustle (2013), before portraying real-life artist Margaret Keane in Tim Burton's biopic Big Eyes (2014). In 2016, she reprised her role as Lane in Batman v Superman: Dawn of Justice (2016), and headlined Denis Villeneuve's science fiction drama Arrival (2016) and Tom Ford's dark thriller Nocturnal Animals (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NjExMjI1OF5BMl5BanBnXkFtZTcwODc0MjY2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0010736","name":"Amy Adams","idIMDB":"nm0010736"},"actorId":"nm0010736","character":"Leslie Miller","urlCharacter":"http://www.imdb.com/character/ch0014716","main":true},{"actorName":"Laurie A. Sinclair","urlProfile":"http://www.imdb.com/name/nm0801665","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NDY3MjE3OV5BMl5BanBnXkFtZTcwNjE2NzkyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 November 1974","placeOfBirth":" Valparaiso, Indiana, USA","height":"5' 4\" (1.63 m)","bio":"Actress & model Laurie spent her youth in Minneapolis/St.Paul performing musical theater. Throughout her career, she's been seen in dozens of national commercial & print spots including Coca Cola, General Mills, & Kodak. She is also a professional AFTRA vocalist, & her voice can be heard on several TV shows throughout ABC/Disney. GH:NS featured her performance on 11 of 13 episodes for SOAPnet's first original series. She also performed the theme song for Blonde Charity Mafia on MTV in AUS, but was more notably heard on TV shows like Vampire Diaries, Law & Order, Dirt, Bionic Woman & Ghost Whisperer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NDY3MjE3OV5BMl5BanBnXkFtZTcwNjE2NzkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0801665","name":"Laurie A. Sinclair","nicknames":["Rie"],"idIMDB":"nm0801665"},"actorId":"nm0801665","character":"Michelle Johnson","urlCharacter":"http://www.imdb.com/character/ch0145023","main":true},{"actorName":"Shannon Nelson","urlProfile":"http://www.imdb.com/name/nm0005267","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NzUxMDk4OF5BMl5BanBnXkFtZTcwNDQ3OTU5OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Shannon Nelson is an actress and producer, known for Belles à mourir (1999), Cannabis Moms Club (2016) and Alice and the Monster (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NzUxMDk4OF5BMl5BanBnXkFtZTcwNDQ3OTU5OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005267","name":"Shannon Nelson","idIMDB":"nm0005267"},"actorId":"nm0005267","character":"Tess Weinhaus","urlCharacter":"http://www.imdb.com/character/ch0145024","main":true},{"actorName":"Tara Redepenning","urlProfile":"http://www.imdb.com/name/nm0714803","urlPhoto":"","biography":{"bio":"Tara Redepenning is an actress, known for Belles à mourir (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0714803","name":"Tara Redepenning","idIMDB":"nm0714803"},"actorId":"nm0714803","character":"Molly Howard","urlCharacter":"http://www.imdb.com/character/ch0145025","main":true},{"actorName":"Sarah Stewart","urlProfile":"http://www.imdb.com/name/nm0829816","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMTc4NTgzMF5BMl5BanBnXkFtZTYwNjYwNjAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 August 1977","placeOfBirth":" Oregon, USA","birthName":"Sarah Layannah","height":"5' (1.52 m)","bio":"Sarah Stewart was born on August 26, 1977 in Oregon, USA as Sarah Layannah. She is an actress, known for Belles à mourir (1999), Cruel and Usual (2008) and Los Dos Bros (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMTc4NTgzMF5BMl5BanBnXkFtZTYwNjYwNjAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0829816","name":"Sarah Stewart","nicknames":["Sarah Brynne"],"idIMDB":"nm0829816"},"actorId":"nm0829816","character":"Jenelle Betz","urlCharacter":"http://www.imdb.com/character/ch0145086","main":true},{"actorName":"Alexandra Holden","urlProfile":"http://www.imdb.com/name/nm0005016","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MjAyODQyMV5BMl5BanBnXkFtZTcwMDI2NTU0Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 April 1977","placeOfBirth":" Northfield, Minnesota, USA","height":"5' 7\" (1.7 m)","bio":"Alexandra Holden was born on April 30, 1977 in Northfield, Minnesota, USA. She is an actress, known for In a World... (2013), The Hot Chick (2002) and Dead End (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MjAyODQyMV5BMl5BanBnXkFtZTcwMDI2NTU0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005016","name":"Alexandra Holden","nicknames":["Alex"],"idIMDB":"nm0005016"},"actorId":"nm0005016","character":"Mary Johanson","urlCharacter":"http://www.imdb.com/character/ch0145026","main":true},{"actorName":"Brooke Elise Bushman","urlProfile":"http://www.imdb.com/name/nm0124274","urlPhoto":"","biography":{"bio":"Brooke Elise Bushman is an actress, known for Belles à mourir (1999) and Baby (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0124274","name":"Brooke Elise Bushman","idIMDB":"nm0124274"},"actorId":"nm0124274","character":"Tammy Curry","urlCharacter":"http://www.imdb.com/character/ch0145027","main":true}],"seasons":[],"idIMDB":"tt0157503","urlIMDB":"http://www.imdb.com/title/tt0157503","business":{"budget":{"money":"$15,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$3,986,269","country":"USA","day":"25","month":"07","year":"1999","remarks":"1,207 Screens"},{"money":"£465,730","country":"UK","day":"19","month":"09","year":"1999","remarks":"199 Screens"}],"gross":[{"money":"$10,561,238","country":"USA","day":"12","month":"09","year":"1999","remarks":""},{"money":"$10,504,469","country":"USA","day":"05","month":"09","year":"1999","remarks":""},{"money":"$10,291,980","country":"USA","day":"29","month":"08","year":"1999","remarks":""},{"money":"$10,041,747","country":"USA","day":"22","month":"08","year":"1999","remarks":""},{"money":"$9,898,464","country":"USA","day":"15","month":"08","year":"1999","remarks":""},{"money":"$9,542,885","country":"USA","day":"08","month":"08","year":"1999","remarks":""},{"money":"$7,991,044","country":"USA","day":"01","month":"08","year":"1999","remarks":""},{"money":"$3,986,269","country":"USA","day":"25","month":"07","year":"1999","remarks":""},{"money":"£1,260,142","country":"UK","day":"03","month":"10","year":"1999","remarks":""},{"money":"£961,980","country":"UK","day":"26","month":"09","year":"1999","remarks":""},{"money":"£465,730","country":"UK","day":"19","month":"09","year":"1999","remarks":""}],"weekendGross":[{"money":"£161,693","country":"UK","day":"03","month":"10","year":"1999","remarks":"199 Screens"},{"money":"£280,421","country":"UK","day":"26","month":"09","year":"1999","remarks":"201 Screens"},{"money":"£465,730","country":"UK","day":"19","month":"09","year":"1999","remarks":"199 Screens"}],"admissions":[{"money":"9,372","country":"Netherlands","day":"31","month":"12","year":"2000","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"27","month":"07","year":"1998","remarks":null},{"money":null,"country":null,"day":"11","month":"09","year":"1998","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 37 min (97 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Astro Video Services, Chicago (IL), USA","DeLuxe (prints)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm (Fuji)"]},"rating":"6.5","metascore":"28","filmingLocations":[{"location":"Jordan, Minnesota, USA"}],"rated":"PG-13","awards":[{"award":"Alpe d'Huez International Comedy Film Festival 2000","titlesAwards":[{"titleAwardOutcome":"Won Audience Award","categories":[{"category":"","names":[{"name":"Michael Patrick Jann","id":"nm0417794","role":null}]}]}]},{"award":"Karlovy Vary International Film Festival 1999","titlesAwards":[{"titleAwardOutcome":"Won FIPRESCI Prize - Special Mention","categories":[{"category":"","names":[{"name":"Michael Patrick Jann","id":"nm0417794","role":null}]}]},{"titleAwardOutcome":"Nominated Crystal Globe","categories":[{"category":"","names":[{"name":"Michael Patrick Jann","id":"nm0417794","role":null}]}]}]},{"award":"The Stinkers Bad Movie Awards 1999","titlesAwards":[{"titleAwardOutcome":"Nominated Stinker Award","categories":[{"category":"Worst Supporting Actress","names":[{"name":"Kirstie Alley","id":"nm0000263","role":null}]}]}]}],"votes":"27,992","type":"Movie","companyCreditsSimple":[{"idCompany":"co0046718","name":"New Line Cinema"},{"idCompany":"co0009948","name":"Capella International"},{"idCompany":"co0076287","name":"KC Medien"}],"keywords":{"keywords":["beauty pageant","small town","f rated","blonde","upskirt","cheerleader uniform","girl in panties","thong panties","white panties","red panties","panties","scantily clad female","cleavage","lingerie slip","family relationships","miss america song spoof","teen movie","arm amputation","stereotype","sign language","pedophile","mentally impaired","high school wrestling","farce","deaf","corruption","asian american","strauss also sprach zarathustra","swan","mock documentary","fake documentary","funeral","catfight","black comedy","trailer trash","what happened to epilogue","cadaver","undertaker","funny accent","mental retardation"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:09:20"}}