{"data":{"movies":[{"title":"Diabolique","originalTitle":"","year":"1996","releaseDate":"19960322","directors":[{"name":"Jeremiah S. Chechik","id":"nm0154819"}],"writers":[{"name":"Pierre Boileau","id":"nm0092267"},{"name":"Thomas Narcejac","id":"nm0092268"}],"runtime":"107 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmFmOWRkZWEtYWZlNC00MDQyLWFlODAtODdjNzU5MzY5ZGE3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Drama","Horror","Thriller","Mystery"],"plot":"The wife and mistress of a cruel school master collaborate in a carefully planned and executed attempt to murder him. The plan goes well until the body, which has been strategically dumped, disappears. The strain starts to tell on the two women as a retired police investigator who is looking into the disappearance on a whim begins to think that they know more than they are telling, and their mental state is not helped when their victim is seen, apparently alive and well by one of the pupils.","simplePlot":"The wife and mistress of the sadistic dean of an exclusive prep school conspire to murder him.","actors":[{"actorName":"Sharon Stone","urlProfile":"http://www.imdb.com/name/nm0000232","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDU1ODQwNF5BMl5BanBnXkFtZTcwOTc3MjQwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 March 1958","placeOfBirth":" Meadville, Pennsylvania, USA","birthName":"Sharon Yvonne Stone","height":"5' 8½\" (1.74 m)","bio":"Sharon Yvonne Stone was born and raised in Meadville, a small town in Pennsylvania, to Dorothy Marie (Lawson), an accountant and homemaker, and Joseph William Stone II, a factory worker. Her father was strict. She was the second of four children, and has English, German, Scottish, and Irish ancestry. At the age of 15, she studied in Saegertown High School, Pennsylvania and, at that same age, entered Edinboro State University of Pennsylvania, and graduated with a degree in creative writing and fine arts. She was a very smart girl, became a bookworm, and once was told that a suitable job for her (and her brains) was to become a lawyer. However, her first love was still the black-and-white movies, especially those featuring Fred Astaire and Ginger Rogers. So, the 17-year-old Sharon got herself into the Miss Crawford County and won the beauty contest. From working part-time as a McDonald's counter girl, she worked her way up to become a successful Ford model, both in TV commercials and print ads. In 1980, she made her film debut as an extra in Woody Allen's Stardust Memories (1980). Her first speaking part was in Wes Craven's horror movie, Deadly Blessing (1981). She struggled through many parts in B-movies, such as King Solomon's Mines (1985) and Action Jackson (1988). She was also married in 1984 to Michael Greenburg, the producer of MacGyver (1985), but they divorced two years later. She finally got her big break with a memorable supporting role in the popular Arnold Schwarzenegger movie Total Recall (1990), and also posed nude for Playboy, a daring move for a 32-year-old actress. But it worked; she was cast in the breakthrough role as a sociopath novelist, \"Catherine Tramell\", in Basic Instinct (1992). Her interrogation scene has become a classic in film history and her performance captivated everyone, from MTV viewers, who honored her with Most Desirable Female and Best Female Performance Awards, to a Golden Globe nomination for Best Actress. After she got famous, she didn't want to be typecast, so she played a victim in Sliver (1993), and, in Intersection (1994), she was the aloof, estranged wife of Richard Gere. Then she appeared in more aggressive roles, such as The Specialist (1994) with Sylvester Stallone and Mort ou vif (1995) with Gene Hackman. But it wasn't until she played a beautiful but drug-crazy trophy wife of Robert De Niro in Casino (1995) that she got far more than just fame and fortune--she also received the acknowledgment of the movie industry for her acting ability. She received her first Golden Globe and an Oscar nomination. She did a couple of films released the next year, teaming up with Isabelle Adjani in Diabolique (1996), and as a woman waiting for her death penalty in Last Dance (1996). In 1998, she married a newspaper editor,Phil Bronstein but they divorced later in 2004. She received her third Golden Globe nomination for The Mighty (1998), a film that her company, \"Chaos\", also co-executive produced. The next year, she played the title role in Gloria (1999) and entered her first comedic role in The Muse (1999), which gave her another Golden Globe nomination. Sharon Stone, a diva who thoroughly enjoys her hard-won stardom, is now a mother of three children: Roan, Laird and Quinn.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDU1ODQwNF5BMl5BanBnXkFtZTcwOTc3MjQwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000232","name":"Sharon Stone","idIMDB":"nm0000232"},"actorId":"nm0000232","character":"Nicole Horner","urlCharacter":"http://www.imdb.com/character/ch0015206","main":true},{"actorName":"Isabelle Adjani","urlProfile":"http://www.imdb.com/name/nm0000254","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMTEyNDUxOV5BMl5BanBnXkFtZTcwMjU3MDQyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 June 1955","placeOfBirth":" Paris, France","birthName":"Isabelle Yasmine Adjani","height":"5' 4¼\" (1.63 m)","bio":"Isabelle Yasmine Adjani was born in Gennevilliers, Hauts-de-Seine, a suburb of Paris, to Emma Augusta \"Gusti\" (Schweinberger) and Mohammed Adjani. Her father was a Kabyle Algerian, from Iferhounène, and her mother was a Bavarian German. She grew up speaking German fluently. After winning a school recitation contest, she began acting in amateur theater by the age of twelve. At the age of 14, she starred in her first motion picture, Le petit bougnat (1970). Adjani has appeared in 30 films since 1970. She holds the record for most César Award for Best Actress (5), which she won for Possession (1981), One Deadly Summer (1983) (aka \"One Deadly Summer\"), Camille Claudel (1988), Queen Margot (1994) (aka \"Queen Margot\") and La journée de la jupe (2008) (aka \"Skirt Day\"). She was also given a double Cannes Film Festival Best Actress Award in 1981. She also received two Academy Award nominations for Best Actress. She performs in French, English, Italian and German. Adjani was made a Chevalier de la Légion d'honneur in 2010.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMTEyNDUxOV5BMl5BanBnXkFtZTcwMjU3MDQyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000254","name":"Isabelle Adjani","idIMDB":"nm0000254"},"actorId":"nm0000254","character":"Mia Baran","urlCharacter":"http://www.imdb.com/character/ch0015207","main":true},{"actorName":"Chazz Palminteri","urlProfile":"http://www.imdb.com/name/nm0001590","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNjU4NTUzOV5BMl5BanBnXkFtZTgwMTY3MDMzMTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 May 1952","placeOfBirth":" New York City, New York, USA","birthName":"Calogero Lorenzo Palminteri","height":"6' 2½\" (1.89 m)","bio":"Bronx-born and raised Chazz Palminteri was a natural choice to continue the Italianate torch in film. In the tradition set forth in the 1970s by such icons as director Martin Scorsese and actors Robert De Niro, Al Pacino, John Cazale and Joe Pesci, Palminteri has brought grit, muscle and an evocative realism to the sidewalks of his New York neighborhood, violent as they are and were. Chazz was born Calogero Lorenzo Palmenteri in 1952 in the Bronx, New York, the son of Rose, a homemaker, and Lorenzo Palminteri, a bus driver. He grew up in a tough area of the Bronx, giving him the life lessons that would later prove very useful to his career. He graduated from Theodore Roosevelt High School and started out pursuing his craft in 1973 studying at the Actor's Studio. He appeared off-Broadway in the early 1980s while paying his dues as a bouncer and doorman in nightclubs, among other jobs. In 1986 he headed west and found that his ethnic qualifications was well-suited for getting tough-talker parts. Slick attorneys, unflinching hoods and hard-nosed cops were all part of his ethnic streetwise persona in such TV shows as Wiseguy (1987), Matlock (1986) and Hill Street Blues (1981). In films he started off playing a 1930s-style gangster in Sylvester Stallone's Oscar (1991). Although his roles were sharp, well-acted and with a distinct edge to them, there was nothing in them to show that he was capable of stronger leading parts. In 1988 he wrote for himself a play entitled \"A Bronx Tale,\" a powerful one-man stage commentary in which he depicted his bruising childhood in great detail, which included witnessing gangland slayings. Palminteri brought each and every character to life (18 in all) in this autobiographical piece -- his friends, enemies, even his own family. He showcased for years in both Los Angeles and New York, finally sparking the interest of his film idol, Robert De Niro. DeNiro, wanting to direct for the first time, saw the potential of this project and brought both it and the actor/writer to the screen. Palminteri played one of the flashier roles, Sonny, a gangster, in the movie version. An unknown film commodity at the time, Chazz had stubbornly refused to sell his stage property (the offers went into the seven figures) unless he was part of the package as both actor and screenwriter. DeNiro, who became his mentor, backed him up all the way, and the rest is history. A Bronx Tale (1993) earned strong reviews. At age 41 Palminteri had become an \"overnight\" star. Other important projects quickly fell his way. He received a well-deserved Oscar nomination the following year for his portrayal of a Runyonesque hit man in Woody Allen's hilarious jazz-era comedy Bullets Over Broadway (1994). He was on the right side of the law in both The Perez Family (1995), his first romantic lead, and then the classic crimer The Usual Suspects (1995). He played the ill-fated brute in Diabolique (1996) and wrote a second screenplay, Faithful (1996), in which he again plays a hit man, terrorizing both Cher and Ryan O'Neal. Though Palminteri was invariably drawn into a rather tight-fitting, often violent typecast, it has been a secure and flashy one that continues to run strong into the millennium. Surprisingly, the one obvious show he missed out on was HBO's The Sopranos (1999). True to form he has been more recently spotted in gritty urban settings playing a \"Hell's Kitchen\" cop in One Eyed King (2001) starring actor/producer Armand Assante; a pool hustler and mentor in Poolhall Junkies (2002); a mob boss in In the Fix (2005); a dirty cop in Running Scared (2006); the titular scam artist as Yonkers Joe (2008); a karaoke-loving Italian psychiatrist in Once More with Feeling (2009); and an abusive husband and father in Mighty Fine (2012). Occasionally he has lightened up a bit as in his recurring role as Shorty on Modern Family (2009)","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNjU4NTUzOV5BMl5BanBnXkFtZTgwMTY3MDMzMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001590","name":"Chazz Palminteri","idIMDB":"nm0001590"},"actorId":"nm0001590","character":"Guy Baran","urlCharacter":"http://www.imdb.com/character/ch0244332","main":true},{"actorName":"Kathy Bates","urlProfile":"http://www.imdb.com/name/nm0000870","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg1MTM3NjcyMF5BMl5BanBnXkFtZTcwMDI0NTk0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1948","placeOfBirth":" Memphis, Tennessee, USA","birthName":"Kathleen Doyle Bates","height":"5' 3\" (1.6 m)","bio":"Multi-talented Kathleen Doyle Bates was born on June 28, 1948, and raised in Memphis, Tennessee. She is the youngest of three girls born to Bertye Kathleen (Talbot), a homemaker, and Langdon Doyle Bates, a mechanical engineer. Her grandfather was author Finis L. Bates. Kathy has English, as well as Irish, Scottish, and German, ancestry, and one of her ancestors, an Irish emigrant to New Orleans, once served as President Andrew Jackson's doctor. Kathy discovered acting appearing in high school plays and studied drama at Southern Methodist University, graduating in 1969. With her mind firmly set, she moved to New York City in 1970 and paid her dues by working everything from a cash register to taking lunch orders. Things started moving quickly up the ladder after giving a tour-de-force performance alongside Christopher Walken at Buffalo's Studio Arena Theatre in Lanford Wilson's world premiere of \"Lemon Sky\" in 1970, but she also had a foreshadowing of the heartbreak to come after the successful show relocated to New York's off-Broadway Playhouse Theatre without her and Walken wound up winning a Drama Desk award. By the mid-to-late 1970s, Kathy was treading the boards frequently as a rising young actress of the New York and regional theater scene. She appeared in \"Casserole\" and \"A Quality of Mercy\" (both 1975) before earning exceptional reviews for her role of Joanne in \"Vanities\". She took her first Broadway curtain call in 1980's \"Goodbye Fidel,\" which lasted only six performances. She then went directly into replacement mode when she joined the cast of the already-established and highly successful \"Fifth of July\" in 1981. Kathy made a false start in films with Taking Off (1971), in which she was billed as \"Bobo Bates\". She didn't film again until Straight Time (1978), starring Dustin Hoffman, and that part was not substantial enough to cause a stir. Things turned hopeful, however, when Kathy and the rest of the female ensemble were given the chance to play their respective Broadway parts in the film version of Robert Altman's Come Back to the 5 & Dime, Jimmy Dean, Jimmy Dean (1982). It was a juicy role for Kathy and film audiences finally started noticing the now 34-year-old. Still and all, it was the New York stage that continued to earn Kathy awards and acclaim. She was pure textbook to any actor studying how to disappear into a role. Her characters ranged from free and life-affirming to downright pitiable. Despite winning a Tony Award nomination and Outer Critic's Circle Award for her stark, touchingly sad portrait of a suicidal daughter in 1983's \"'night, Mother\" and the Obie and Los Angeles Drama Critics Award for her powerhouse job as a romantic misfit in \"Frankie and Johnny in the Claire de Lune,\" Kathy had no box-office pull and was hardly a strong consideration when the roles finally went to film. Kathy Bates was forever losing out when her award-winning stage characters transferred to the screen. First Sissy Spacek took on her potent role as the suicidal Jessie Cates in 'night, Mother (1986), then Michelle Pfeiffer seized the moment to play her dumpy lover character in Frankie and Johnny (1991). It would take Oscar glory to finally rectify the injustice. It was her fanatical turn as the drab, chunky, porcine-looking psychopath Annie Wilkes, who kidnaps her favorite author (James Caan) and subjects him to a series of horrific tortures, that finally turned the tide for her in Hollywood. With the 1990 shocker Misery (1990), based on the popular Stephen King novel, Bates and Caan were pure box office magic. Moreover, Kathy captured the \"Best Actress\" Oscar and Golden Globe award, a first in that genre (horror) for that category. To add to her happiness she married Tony Campisi, also an actor, in 1991. Quality film scripts now started coming her way and the 1990s proved to be a rich and rewarding time for her. First, she and another older \"overnight\" film star, fellow Oscar winner Jessica Tandy, starred together in the modern portion of the beautifully nuanced, flashback period piece Fried Green Tomatoes (1991). She then outdid herself as the detached and depressed housekeeper accused of murdering her abusive husband (David Strathairn) in Dolores Claiborne (1995). Surprisingly, she was left out of the Oscar race for these two excellent performances. Not so, however, for her flashy political advisor Libby Holden in the movie Primary Colors (1998) and her quirky, liberal mom in About Schmidt (2002), receiving \"Best Supporting Actress\" nominations for both. She also turned in a somewhat brief but potent turn as Gertrude Stein in Woody Allen's Midnight in Paris (2011). Kathy has continued to work prolifically on TV as a multiple Emmy winner and nominee. She has also taken to directing a couple of TV-movies on the sly. She was nominated for a DGA award after helming an episode of \"Six Feet Under,\" in which she also had a recurring role. While some of her more recent movie parts have been unworthy of her talents, she has more than made up for it on TV playing everything from cruel-minded caricatures (Little Orphan Annie's Miss Hannigan) to common, decent every day folk in mini-movies. More recently she has done some eye-catching, offbeat turns on regular series such as The Office (2005), Harry's Law (2011) and especially American Horror Story (2011) for which she won an Emmy as Ethel Darling. Divorced from her husband since 1997, Kathy has been the Executive Committee Chair of the Actors Branch of the Academy of Motion Picture Arts and Sciences Board of Governors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg1MTM3NjcyMF5BMl5BanBnXkFtZTcwMDI0NTk0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000870","name":"Kathy Bates","nicknames":["Bobo"],"idIMDB":"nm0000870"},"actorId":"nm0000870","character":"Det. Shirley Vogel","urlCharacter":"http://www.imdb.com/character/ch0244382","main":true},{"actorName":"Spalding Gray","urlProfile":"http://www.imdb.com/name/nm0336960","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3Mzk3MDQ4Ml5BMl5BanBnXkFtZTcwMjc1OTAzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 June 1941","placeOfBirth":" Providence, Rhode Island, USA","birthName":"Spalding Rockwell Gray","bio":"Spalding Gray was born on June 5, 1941 in Providence, Rhode Island, USA as Spalding Rockwell Gray. He was an actor and writer, known for The Killing Fields (1984), Kate & Leopold (2001) and Beaches (1988). He was married to Kathleen Russo and Renée Shafransky. He died on January 10, 2004 in New York City, New York, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3Mzk3MDQ4Ml5BMl5BanBnXkFtZTcwMjc1OTAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0336960","name":"Spalding Gray","nicknames":["Spud or Spuddy"],"idIMDB":"nm0336960"},"actorId":"nm0336960","character":"Simon Veatch","urlCharacter":"http://www.imdb.com/character/ch0244383","main":true},{"actorName":"Shirley Knight","urlProfile":"http://www.imdb.com/name/nm0004309","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzk2ODIyMl5BMl5BanBnXkFtZTYwMTk5Mjc1._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 July 1936","placeOfBirth":" Goessel, Kansas, USA","birthName":"Shirley Enola Knight","bio":"Two time Academy Award® nominee, Golden Globe® Winner (3 time nominee), 3 time Emmy winner (7 time nominee); As Good as It Gets (1997), Paul Blart: Mall Cop (2009), Grandma's Boy (2006) Miss Knight was born in Gossell, Kansas the 5th of July 1936. She spent her young life in Mitchell, Kansas and later lived in Lyons, Kansas where she graduated from high school. She attended Phillips University, Enid, Oklahoma, Wichita State University, and has a Doctor of Fine Arts Degree from Lake Forest College. She began studying to be an opera singer at age eleven. After studying at the Pasadena Theatre School she began her film career in 1959. She then went to New York and began her theatre career. She studied acting with Jeff Corey and Lee Strasberg and is a member of The Actor's Studio. She has received many honors from her home state of Kansas, including the Kansan of the Year award in 2000 and the Governor's Distinguished Artist Award in 2007. Both were given to her by Governor Kathleen Sebelius. Miss Knight was married to the writer John R. Hopkins until his death in 1998. She has two daughters, Kaitlin Hopkins and Sophie C. Hopkins. Kaitlin is an actress-singer-director and Sophie a writer. Shirley lives in New York City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzk2ODIyMl5BMl5BanBnXkFtZTYwMTk5Mjc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004309","name":"Shirley Knight","idIMDB":"nm0004309"},"actorId":"nm0004309","character":"Edie Danziger","urlCharacter":"http://www.imdb.com/character/ch0244449","main":true},{"actorName":"Allen Garfield","urlProfile":"http://www.imdb.com/name/nm0307255","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0NTcyMDI0M15BMl5BanBnXkFtZTYwMTI1MjY2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1939","placeOfBirth":" Newark, New Jersey, USA","birthName":"Allen Goorwitz","bio":"New Jersey-born Allen Garfield was trained at the Actors Studio in New York City. He had a prolific career on the stage before making his film debut in 1968. His stocky build and nervous, jumpy mannerisms fit well with the weaselly criminals, lecherous villains and corrupt businessmen and politicians he excels in playing - a perfect example of which is the Beverly Hills police chief in 1987's Beverly Hills Cop II (1987). Midway through his career he reverted to his real name of Allan Goorwitz, but not long afterwards decided to stay with his stage name, and went back to Allen Garfield.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0NTcyMDI0M15BMl5BanBnXkFtZTYwMTI1MjY2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0307255","name":"Allen Garfield","idIMDB":"nm0307255"},"actorId":"nm0307255","character":"Leo Katzman","urlCharacter":"http://www.imdb.com/character/ch0251983","main":true},{"actorName":"Adam Hann-Byrd","urlProfile":"http://www.imdb.com/name/nm0002123","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMTU0MjYwMV5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 February 1982","placeOfBirth":" New York City, New York, USA","bio":"Adam Hann-Byrd was born on February 23, 1982 in New York City, New York, USA. He is an actor and writer, best known for his work on Jumanji (1995), The Ice Storm (1997), Halloween H20: 20 Years Later (1998), and as the title character in Jodie Foster's directorial debut, Little Man Tate (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMTU0MjYwMV5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002123","name":"Adam Hann-Byrd","idIMDB":"nm0002123"},"actorId":"nm0002123","character":"Erik Pretzer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Donal Logue","urlProfile":"http://www.imdb.com/name/nm0006610","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNzI1NjQxNl5BMl5BanBnXkFtZTcwMzE2MzI0Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1966","placeOfBirth":" Ottawa, Ontario, Canada","birthName":"Donal Francis Logue","height":"5' 11\" (1.8 m)","bio":"Donal Logue's versatility and talent makes him one of the most well respected and beloved actors today. Born in Ottawa, Canada, Logue moved all over the United States, from the Boston area as an infant to various towns on the Mexican border. He returned to Boston to attend Harvard University, where he majored in Intellectual History and discovered his love for the performing arts. While in college, he appeared in over thirty plays, worked for two summers in the American Repertory Theatre's Harvard/Radcliffe Summer Stock Company, and spent a short time doing theatre in England. After graduating, Logue joined the Cornerstone Theatre Company which developed community theatre in rural parts of the United States. From then on Logue dedicated himself to pursuing his passion for acting. In his 20 plus years in the industry, Logue has starred in films such as, The Tao of Steve, the story of a larger-than-life, philosophizing lothario, which debuted at the Sundance Film Festival, and won him a Special Jury Prize for Outstanding Performance. His other film credits include Sneakers, Gettysburg, Blade, Runaway Bride, Reindeer Games, The Million Dollar Hotel, Comic Book Villains with Michael Rapaport, Confidence, Just Like Heaven, and The Groomsmen with Ed Burns. Recently, Donal co-starred in Max Payne with Mark Wahlberg, as well as Charlie St. Cloud with Zac Ephron. He also appeared in Zodiac, directed by David Fincher, based on the Robert Graysmith books about the notorious Zodiac serial killer. Following the US release of Zodiac, he co-starred in Mark Steven Johnson's Ghost Rider with Nicolas Cage and Eva Mendes. Logue made his directorial debut with the independent film Tennis, Anyone?, which appeared at the US Comedy Arts Festival. He wrote, starred, and directed the film about two Hollywood has-beens who try and find meaning in their lives through a series of celebrity tennis tournaments. In television, Logue joined the cast of the NBC series \"LIFE\" about a former police officer who returns to the force after having been wrongly imprisoned for years. In 2007, he headlined the critically lauded ABC comedy \"The Knights of Prosperity\" in which a group of blue collar guys band together to plan a heist of Mick Jagger's New York City apartment. Prior to \"The Knights of Prosperity\" Logue starred in the Carsey-Warner produced show, \"Grounded for Life\" which aired for five seasons. He was also featured in a recurring role on \"ER\" as Sherry Stringfield's love interest. In 2010, Logue finished a critically acclaimed season on \"Terriers,\" a television series created by Ted Griffin and Shawn Ryan for FX. He begins production on the Marc Cherry pilot \"Hallelujah\" for ABC in March of 2011. Logue lives in Los Angeles and has two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNzI1NjQxNl5BMl5BanBnXkFtZTcwMzE2MzI0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006610","name":"Donal Logue","idIMDB":"nm0006610"},"actorId":"nm0006610","character":"Video Photographer #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Diana Bellamy","urlProfile":"http://www.imdb.com/name/nm0068690","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MzkxMjYzMF5BMl5BanBnXkFtZTcwMjQxODc2Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 September 1943","placeOfBirth":" Los Angeles, California, USA","birthName":"Diana Alice Bellamy","bio":"Plump and personable character actress Diana Alice Bellamy was born on September 19, 1943 in Los Angeles, California. Bellamy graduated with a master's degree in Fine Arts from Southern Methodist University in 1970. She began her acting career in puppet theater in her native Los Angeles. Diana had memorable small roles as a sassy whorehouse madam in \"Outrageous Fortune,\" a sharp-tongued secretary in \"Outbreak,\" and a sarcastic White House switchboard operator in \"Air Force One.\" Bellamy was very funny as the cranky Mrs. Pennington in \"The Nest\" and gave an excellent performance as Tim Daly's loyal secretary Grace Woods in \"Spellbinder.\" She had recurring parts as head nurse Maggie Poole on \"13 East\" and Mrs. Cha-Cha Rimba Starkey on \"Superhuman Samurai Syber-Squad.\" Among the many TV shows Diana made guest appearances on are \"Married with Children,\" \"Melrose Place,\" \"Nash Bridges,\" \"Wings,\" \"Murphy Brown,\" \"Baywatch,\" \"Quantom Leap,\" \"Alien Nation,\" \"Family Ties,\" \"Newhart,\" \"Hunter,\" \"The Fall Guy,\" \"Hill Street Blues,\" and \"T.J. Hooker.\" Outside of her film and television credits, Bellamy did a substantial amount of stage acting: She not only did three seasons with the Oregon Shakespeare Festival in Ashland, but also acted in productions of such plays as \"Sister Mary Ignatius Explains It All for You\" (as the title character), \"The House of Blue Leaves,\" and \"The Skin of Our Teeth.\" Despite suffering from cancer, diabetes, and blindness in the last five years of her life, Diana nonetheless continued to act: She portrayed the blind Principal Cecelia Hall on the TV series \"Popular,\" made a guest appearance on an episode of \"Diagnosis Murder,\" and played the crippled Mrs. Nichols in a stage production of \"The Ladies of the Corridor.\" Bellamy died at age 57 from cancer at her home in Valley Village, California on June 17, 2001.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MzkxMjYzMF5BMl5BanBnXkFtZTcwMjQxODc2Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0068690","name":"Diana Bellamy","idIMDB":"nm0068690"},"actorId":"nm0068690","character":"Ms. Vawze","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clea Lewis","urlProfile":"http://www.imdb.com/name/nm0507051","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzE4NTY5MTQ5Nl5BMl5BanBnXkFtZTcwMDIxMDIxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 July 1965","placeOfBirth":" Cleveland Heights, Ohio, USA","birthName":"Eraclea S. Lewis","height":"6' (1.83 m)","bio":"Clea Lewis was born on July 19, 1965 in Cleveland Heights, Ohio, USA as Eraclea S. Lewis. She is an actress, known for Ellen (1994), Ice Age: Dawn of the Dinosaurs (2009) and Ice Age: The Meltdown (2006). She has been married to Peter Ackerman since November 11, 2000. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzE4NTY5MTQ5Nl5BMl5BanBnXkFtZTcwMDIxMDIxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0507051","name":"Clea Lewis","idIMDB":"nm0507051"},"actorId":"nm0507051","character":"Lisa Campos","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"J.J. Abrams","urlProfile":"http://www.imdb.com/name/nm0009190","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MTE0NTkzMV5BMl5BanBnXkFtZTcwODEwNDU0OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 June 1966","placeOfBirth":" New York City, New York, USA","birthName":"Jeffrey Jacob Abrams","height":"5' 7\" (1.7 m)","bio":"J.J. Abrams was born on June 27, 1966 in New York City, New York, USA as Jeffrey Jacob Abrams. He is a producer and writer, known for Star Wars: The Force Awakens (2015), Lost (2004) and Super 8 (2011). He has been married to Katie McGrath since 1996. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MTE0NTkzMV5BMl5BanBnXkFtZTcwODEwNDU0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0009190","name":"J.J. Abrams","idIMDB":"nm0009190"},"actorId":"nm0009190","character":"Video Photographer #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"O'Neal Compton","urlProfile":"http://www.imdb.com/name/nm0174064","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2ODI5MDI5Nl5BMl5BanBnXkFtZTYwMDk5NTcy._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1951","placeOfBirth":" Sumter, South Carolina, USA","height":"6' 3\" (1.91 m)","bio":"O'Neal Compton was born on February 5, 1951 in Sumter, South Carolina, USA. He is an actor, known for Deep Impact (1998), Nell (1994) and Life (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2ODI5MDI5Nl5BMl5BanBnXkFtZTYwMDk5NTcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0174064","name":"O'Neal Compton","idIMDB":"nm0174064"},"actorId":"nm0174064","character":"Irv Danziger","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bingo O'Malley","urlProfile":"http://www.imdb.com/name/nm0641703","urlPhoto":"","biography":{"bio":"Bingo O'Malley is an actor, known for Out of the Furnace (2013), Super 8 (2011) and Love & Other Drugs (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0641703","name":"Bingo O'Malley","idIMDB":"nm0641703"},"actorId":"nm0641703","character":"Gannon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Liska","urlProfile":"http://www.imdb.com/name/nm0514093","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNjY3OTk0NF5BMl5BanBnXkFtZTcwMjU5MzY2Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Stephen Liska is an actor, known for Assassins (1995), Beverly Hills Cop II (1987) and Star Trek III: The Search for Spock (1984).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNjY3OTk0NF5BMl5BanBnXkFtZTcwMjU5MzY2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0514093","name":"Stephen Liska","idIMDB":"nm0514093"},"actorId":"nm0514093","character":"PHP Officer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0116095","urlIMDB":"http://www.imdb.com/title/tt0116095","business":{"budget":null,"openingWeekend":[{"money":"$5,524,055","country":"USA","day":"22","month":"03","year":"1996","remarks":""}],"gross":[{"money":"$35,300,000 (Worldwide)","country":"except","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1996/\">1996</a>"},{"money":"23,349","country":"Netherlands","day":"01","month":"01","year":"1997","remarks":""},{"money":"89,758","country":"Portugal","day":"31","month":"10","year":"1996","remarks":""},{"money":"80,907","country":"Portugal","day":"24","month":"10","year":"1996","remarks":""},{"money":"52,042","country":"Portugal","day":"10","month":"10","year":"1996","remarks":""},{"money":"28,890","country":"Portugal","day":"03","month":"10","year":"1996","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1995/\">1995</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 47 min (107 min)"],"soundMix":["SDDS","Dolby Digital"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Panaflex Gold II, Panavision Primo Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":["3,014 m"],"negativeFormat":["35 mm (Eastman EXR 200T 5293, EXR 500T 5296)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.3","filmingLocations":[{"location":"Allegheny County, Pennsylvania, USA"}],"rated":"R","awards":[{"award":"Australian Cinematographers Society 1997","titlesAwards":[{"titleAwardOutcome":"Won Award of Distinction","categories":[{"category":"Feature Productions Cinema","names":[{"name":"Peter James","id":"nm0416824","role":null}]}]}]},{"award":"Razzie Awards 1997","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst New Star","names":[{"name":"Sharon Stone","id":"nm0000232","role":null},{"name":"Last Dance","id":"tt0116827","role":null}]}]}]},{"award":"Yoga Awards 1997","titlesAwards":[{"titleAwardOutcome":"Won Yoga Award","categories":[{"category":"Worst Remake","names":[{"name":"Jeremiah S. Chechik","id":"nm0154819","role":null}]}]}]}],"votes":"11,448","type":"Movie","companyCreditsSimple":[{"idCompany":"co0033326","name":"ABC Productions"},{"idCompany":"co0027919","name":"Marvin Worth Productions"},{"idCompany":"co0033472","name":"Morgan Creek Productions"}],"keywords":{"keywords":["mistress","school","murder","reality show","erotic thriller","female nudity","nudity","gaslight","bisexual","rough sex","dysfunctional marriage","death in bathtub","priest","faculty","dead body in bathtub","cafeteria","death by drowning","lesbian relationship","video camera","murder in bathroom","telephoto lens","dead body in water","reference to lee harvey oswald","sunglasses","woman fainting","heart attack","cufflink","woman private detective","embezzlement","cancer survivor","16mm projector","sheriff's office","identifying dead body","nicotine gum","undercover policewoman","confession","algebra teacher","motel","mexican immigrant","dead body in car","wicker trunk","lap dog","sex education","french teacher","scotch whiskey","private school","wet underwear","lingerie slip","horror movie remake","foreign language adaptation","urination","teacher","spiked drink","shower curtain","rake","prayer","pool","murder plot","murder of husband","morgue","heart condition","guilt","female detective","emotional abuse","dining hall","contact lens","cheating husband","catholic","cafe","boarding house","bathtub","attempted murder","alcohol","remake","smoking","adultery","drowning","swimming pool","boarding school","domestic triangle","remake of french film","teaching","neo noir","based on novel","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:04:24"}}