{"data":{"movies":[{"title":"20,000 Leagues Under the Sea","originalTitle":"","year":"1997–","releaseDate":"1997","writers":[],"runtime":"158 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BODMzMDc5NTM4MV5BMl5BanBnXkFtZTcwNTAwMTU1MQ@@._V1.jpg","countries":["USA","Australia"],"languages":["English"],"genres":["Adventure","Romance","Sci-Fi"],"plot":"The year is 1886, when New England's fishing harbours are the scene for a \"creature of unknown origin\" destroying ships at sea. It is the job of Professor Pierre Arronax, a marine expert, and Ned Land, the iron-willed sailor, to learn the truth of the \"monster\" roaming the seas. The great novelist, Jules Verne, described this perilous journey to the darkest depths of the sea with Captain Nemo aboard the Nautilus.","simplePlot":"The year is 1886, when New England's fishing harbours are the scene for a \"creature of unknown origin\" destroying ships at sea. It is the job of Professor Pierre Arronax, a marine expert, ... ","actors":[{"actorName":"Michael Caine","urlProfile":"http://www.imdb.com/name/nm0000323","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzIwNTQ4Ml5BMl5BanBnXkFtZTYwMzE1MTUz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1933","placeOfBirth":" Rotherhithe, London, England, UK","birthName":"Maurice Joseph Micklewhite","height":"6' 1\" (1.85 m)","bio":"Michael Caine was born Maurice Joseph Micklewhite in London, to Ellen Frances Marie (Burchell), a charlady, and Maurice Joseph Micklewhite, a fish-market porter. He left school at 15 and took a series of working-class jobs before joining the British army and serving in Korea during the Korean War, where he saw combat. Upon his return to England he gravitated toward the theater and got a job as an assistant stage manager. He adopted the name of Caine on the advice of his agent, taking it from a marquee that advertised The Caine Mutiny (1954). In the years that followed he worked in more than 100 television dramas, with repertory companies throughout England and eventually in the stage hit, \"The Long and the Short and the Tall.\" Zulu (1964), the 1964 epic retelling of a historic 19th-century battle in South Africa between British soldiers and Zulu warriors, brought Caine to international attention. Instead of being typecast as a low-ranking Cockney soldier, he played a snobbish, aristocratic officer. Although \"Zulu\" was a major success, it was the role of Harry Palmer in The Ipcress File (1965) and the title role in Alfie (1966) that made Caine a star of the first magnitude. He epitomized the new breed of actor in mid-'60s England, the working-class bloke with glasses and a down-home accent. However, after initially starring in some excellent films, particularly in the 1960s, including Gambit (1966), Funeral in Berlin (1966), Play Dirty (1969), Battle of Britain (1969), Too Late the Hero (1970), The Last Valley (1971) and especially Get Carter (1971), he seemed to take on roles in below-average films, simply for the money he could by then command. There were some gems amongst the dross, however. He gave a magnificent performance opposite Sean Connery in The Man Who Would Be King (1975) and turned in a solid one as a German colonel in The Eagle Has Landed (1976). Educating Rita (1983) and Hannah and Her Sisters (1986) (for which he won his first Oscar) were highlights of the 1980s, while more recently Little Voice (1998), The Cider House Rules (1999) (his second Oscar) and Last Orders (2001) have been widely acclaimed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzIwNTQ4Ml5BMl5BanBnXkFtZTYwMzE1MTUz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000323","name":"Michael Caine","idIMDB":"nm0000323"},"actorId":"nm0000323","character":" Captain Nemo","urlCharacter":"http://www.imdb.com/character/ch0027258","main":true},{"actorName":"Patrick Dempsey","urlProfile":"http://www.imdb.com/name/nm0001131","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NzExNTAxN15BMl5BanBnXkFtZTcwNzA4MTU5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 January 1966","placeOfBirth":" Lewiston, Maine, USA","birthName":"Patrick Galen Dempsey","height":"5' 10½\" (1.79 m)","bio":"Patrick Dempsey has lived two charming but separate lives on film and television. From an exuberant, somewhat awkward charmer in college comedy films of the late 1980s and early 1990s, he has morphed spectacularly into a dreamy, wavy-haired television hunk of the new-age millennium and this seductive new image has since spilled off into romantic lead roles back on the large screen as a slightly offbeat, self-effacing Prince Charming type. Patrick Galen Dempsey was born on January 13, 1966 in Lewiston, Maine, to M. Amanda (Casson) and William Allen Dempsey. He is the youngest of three. His father, an insurance agent, and his mother, a school secretary, raised the children in Buckfield (Maine). His parents were both originally from Pennsylvania, and he has German, English, and Scottish ancestry (\"Dempsey\" was the surname of his step-grandfather). Patrick, who was diagnosed as dyslexic (he has to fully memorize his scripts), attended St. Dominic Regional High School but dropped out before graduating. Always interested in entertainment, Patrick studied juggling and entered several competitions. Acting was also a natural for him and, at age 15, he earned the role of the rebellious son in a Maine production of \"On Golden Pond\". Two years later, he won a prime role as David, the gay teen, in the Harvey Fierstein play \"Torch Song Trilogy\", spending several months touring the San Francisco area with the show. In between he, found supplementary gigs dancing and juggling. More opportunities came his way after winning the protagonist role of Neil Simon's \"Brighton Beach Memoirs\" that toured in 1984. Directed by the renowned comedy favorite Gene Saks, Dempsey started looking at the possibility of film work. He made his movie debut in the secondary part of a Catholic student in the 1960s-era school-age comedy Heaven Help Us (1985) starring \"Brat Pack\" actor Andrew McCarthy. More silliness followed with Sale boulot (1986) and a ripe turn in the socially aware television-movie Walt Disney's Wonderful World of Color: A Fighting Choice (1986) in which he played an epileptic teen who sues his parents (Beau Bridges and Karen Valentine) in order to have risky brain surgery. Around the same time, he found himself in a television series entitled Fast Times (1986), based on the ultimate school-age film Fast Times at Ridgemont High (1982), which made a star out of Sean Penn. Inheriting the Robert Romanus cool guy role of con artist Mike Damone, expectations were far too big and the television series died a quick death. However, his movie career got on a faster track and he scored well co-starring with the worldly Beverly D'Angelo in the movie In the Mood (1987), as a young man who makes headlines pursuing older women. Life resembled art that same year when Patrick married actress and drama coach Rocky Parker, who played a bit part in the film. He was 21 and she was 48. By this time, his trademark cuteness and appeal started taking shape. The youthful 21-year old Patrick played a nerd role next in the very funny high school comedy Can't Buy Me Love (1987) with Amanda Peterson. A movie favorite for many, Patrick had reached the peak of his early career popularity. He showed a more serious side in the World War II-era drama In a Shallow Grave (1988), which presented a Cyrano de Bergerac-like storyline with Patrick as the Christian de Neuvillette counterpart, but then he went straight back to familiar territory with the college-themed comedies Some Girls (1988) with Jennifer Connelly, Loverboy (1989), and Happy Together (1989). Stretching more in the 1990s, Patrick co-starred on stage in a 1991 production of \"The Subject Was Roses\" (playing the Martin Sheen film role) as the World War II soldier readjusting to civilian life with his parents (Dana Ivey and \"Frasier\" co-star John Mahoney). Films included the cross-country comedy-drama Coupe de Ville (1990), the action thriller Run (1991), Mobsters (1991), in which he made a stab at playing major Mafioso Meyer Lansky, Face the Music (1993) opposite \"Brat Pack\" femme Molly Ringwald, the title role in Bank Robber (1993), and the Mark Twain family-geared Ava's Magical Adventure (1998), co-directed by Patrick and wife Rocky. However, the couple divorced that same year. On television, Patrick played a young John Fitzgerald Kennedy in the miniseries J.F.K.: Reckless Youth (1993), Pierre Arronax in the television remake of 20,000 Leagues Under the Sea (1997), and Raskolnikov in a small screen version of Crime and Punishment (1998). The rest of the decade on film was less newsworthy with co-starring or featured movie roles in Hugo Pool (1997), Denial (1998), Life in the Fast Lane (1998) and Me and Will (1999). It was television that gave Patrick a shot in the arm as he progressed into the new millennium. A recurring role as Will's closeted sportscaster amour in the sitcom Will & Grace (1998) presented Patrick in a more mature, wry and sexier fashion. Another recurring role in Once and Again (1999) earned him a dramatic Emmy nomination in 2001 as Outstanding Guest Actor, and a third on The Practice (1997) was also extremely well-received. While the romantic comedy film Sweet Home Alabama (2002) opposite Reese Witherspoon really nailed the direction Dempsey was headed, the medical series Grey's Anatomy (2005), as neurosurgeon Dr. Derek Shepherd (aka \"Dr. McDreamy\"), gave distaff audiences the whole heartthrob package. The perfect vehicle to showcase his undeniable charisma and sharp talent for offbeat comedy, he is a two-time Golden Globe nominee and his popularity has absolutely skyrocketed. This reawakening has also swung the door open again on high-profile film offers, registering with the ladies once again in a number of light leading man parts, notably Enchanted (2007) and Made of Honor (2008). Off-camera, Dempsey married a second time in 1999, to make-up artist and Delux Beauty founder Jillian Dempsey. The couple have three children: daughter, Tallulah Fyfe (born 2002), and twin sons Darby Galen and Sullivan Patrick (born 2007). An avid sports car racer (he has participated in the Indianapolis and Daytona Beach events), he showed off a more humanitarian side when he started the Patrick Dempsey Center for Cancer Hope and Healing in his hometown of Lewiston after his mother developed ovarian cancer. Befittingly, he has produced a sexy men's fragrance line by Avon called \"Unscripted\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NzExNTAxN15BMl5BanBnXkFtZTcwNzA4MTU5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001131","name":"Patrick Dempsey","nicknames":["Dr. McDreamy"],"idIMDB":"nm0001131"},"actorId":"nm0001131","character":" Pierre Arronax","urlCharacter":"http://www.imdb.com/character/ch0237838","main":true},{"actorName":"Mia Sara","urlProfile":"http://www.imdb.com/name/nm0000214","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NDk3Njc3Nl5BMl5BanBnXkFtZTcwNjg2ODIyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1967","placeOfBirth":" Brooklyn Heights, New York, USA","birthName":"Mia Sarapochiello","height":"5' 4\" (1.63 m)","bio":"Mia Sara was born on June 19, 1967 in Brooklyn Heights, New York, USA as Mia Sarapochiello. She is an actress, known for Ferris Bueller's Day Off (1986), Legend (1985) and Timecop (1994). She has been married to Brian Henson since April 6, 2010. They have one child. She was previously married to Jason Connery.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NDk3Njc3Nl5BMl5BanBnXkFtZTcwNjg2ODIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000214","name":"Mia Sara","idIMDB":"nm0000214"},"actorId":"nm0000214","character":" Mara","urlCharacter":"http://www.imdb.com/character/ch0404893","main":true},{"actorName":"Bryan Brown","urlProfile":"http://www.imdb.com/name/nm0000986","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5ODUwNTMyMl5BMl5BanBnXkFtZTYwMTY0MDY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 June 1947","placeOfBirth":" Sydney, New South Wales, Australia","birthName":"Bryan Neathaway Brown","height":"6' 1\" (1.85 m)","bio":"Bryan Brown was born on June 23, 1947 in Sydney, New South Wales, Australia as Bryan Neathaway Brown. He is an actor and producer, known for Cocktail (1988), Australia (2008) and Along Came Polly (2004). He has been married to Rachel Ward since April 16, 1983. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5ODUwNTMyMl5BMl5BanBnXkFtZTYwMTY0MDY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000986","name":"Bryan Brown","idIMDB":"nm0000986"},"actorId":"nm0000986","character":" Ned Land","urlCharacter":"http://www.imdb.com/character/ch0018077","main":true},{"actorName":"Adewale Akinnuoye-Agbaje","urlProfile":"http://www.imdb.com/name/nm0015382","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzA5MTI5MF5BMl5BanBnXkFtZTgwMTUxMjcwOTE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 August 1967","placeOfBirth":" Islington, London, England, UK","birthName":"Adewale Rotimi O. C. E. Akinnuoye Agbaje","height":"6' 2\" (1.88 m)","bio":"Born and raised in London, England, Adewale Akinnuoye-Agbaje began his career as a model in Milan. He graduated with a masters degree in Law from London's prestigious Kings College, before moving to Los Angeles to make the transition to acting. Fluent in several languages, including English, Italian, Yoruba and Swahili, he is best known for his roles in the movies Congo (1995) and The Mummy Returns (2001), and the HBO series Oz (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzA5MTI5MF5BMl5BanBnXkFtZTgwMTUxMjcwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0015382","name":"Adewale Akinnuoye-Agbaje","nicknames":["Triple A","Wally"],"idIMDB":"nm0015382"},"actorId":"nm0015382","character":" Cabe Attucks","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Bach","urlProfile":"http://www.imdb.com/name/nm0045324","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1Mjg2MzM0OV5BMl5BanBnXkFtZTcwMDQ2NzMwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 June 1946","placeOfBirth":" Wales, UK","height":"6' 2\" (1.88 m)","bio":"John Bach was born on June 5, 1946 in Wales. He is known for his work on The Lord of the Rings: The Two Towers (2002), The Lord of the Rings: The Return of the King (2003) and The Chronicles of Narnia: Prince Caspian (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1Mjg2MzM0OV5BMl5BanBnXkFtZTcwMDQ2NzMwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0045324","name":"John Bach","idIMDB":"nm0045324"},"actorId":"nm0045324","character":" Thierry Arronax","urlCharacter":"http://www.imdb.com/character/ch0237838","main":true},{"actorName":"Nicholas Hammond","urlProfile":"http://www.imdb.com/name/nm0358749","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyMzM4NTgyMV5BMl5BanBnXkFtZTYwOTk3OTI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 May 1950","placeOfBirth":" Washington, District of Columbia, USA","height":"6' (1.83 m)","bio":"Nicholas Hammond was born on 15th May, 1950, in Washington DC. His parents, Col. Thomas W. Hammond and actress Eileen Bennett, married since 1945, already had one son, David (born in Paris in 1946). When Nicholas was 6 years old, the family moved to Europe. In 1959, his mother took him to see the musical \"My Fair Lady\" (with Julie Andrews) on stage in London. After seeing this show, Nicholas decided he wanted to be an actor. The family returned to the US when Nicholas was 10 years old. He landed his first part (a small role in movie Lord of the Flies (1963) shortly after that. Nicholas appeared on Broadway and on television before he landed the role of Friedrich in the hit movie The Sound of Music (1965). Nicholas made a visit to Australia in the mid 1980s but also did some acting while he was there. After a year, he realized he liked living in Australia and decided to stay. He lives in Sydney where he works as an actor, screenwriter, and director.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyMzM4NTgyMV5BMl5BanBnXkFtZTYwOTk3OTI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0358749","name":"Nicholas Hammond","nicknames":["Nicky"],"idIMDB":"nm0358749"},"actorId":"nm0358749","character":" Saxon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter McCauley","urlProfile":"http://www.imdb.com/name/nm0565518","urlPhoto":"","biography":{"dateOfBirth":"8 March 1950","placeOfBirth":" New Zealand","height":"6' 1½\" (1.87 m)","bio":"Peter McCauley was born on March 8, 1950 in New Zealand. He is an actor, known for The Lost World (1999), The Light Between Oceans (2016) and The Interview (1998). He is married to Catherine Wilkin.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0565518","name":"Peter McCauley","idIMDB":"nm0565518"},"actorId":"nm0565518","character":" Admiral McCutcheon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kerry Armstrong","urlProfile":"http://www.imdb.com/name/nm0035788","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjY2NjMwMDgxNF5BMl5BanBnXkFtZTYwNjIyNjg1._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 January 1958","placeOfBirth":" Melbourne, Victoria, Australia","birthName":"Kerry Michelle Armstrong","bio":"Kerry Armstrong was born on January 3, 1958 in Melbourne, Victoria, Australia as Kerry Michelle Armstrong. She is an actress, known for Lantana (2001), Prisoner: Cell Block H (1979) and SeaChange (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjY2NjMwMDgxNF5BMl5BanBnXkFtZTYwNjIyNjg1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0035788","name":"Kerry Armstrong","idIMDB":"nm0035788"},"actorId":"nm0035788","character":" Lydia Rawlings","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cecily Chun","urlProfile":"http://www.imdb.com/name/nm0161128","urlPhoto":"","biography":{"bio":"Cecily Chun is an actress, known for 20,000 Leagues Under the Sea (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0161128","name":"Cecily Chun","idIMDB":"nm0161128"},"actorId":"nm0161128","character":" Imei","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ken Senga","urlProfile":"http://www.imdb.com/name/nm0784251","urlPhoto":"","biography":{"bio":"Ken Senga is an actor, known for Muriel (1994), The Great Raid (2005) and The Man Who Sued God (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0784251","name":"Ken Senga","idIMDB":"nm0784251"},"actorId":"nm0784251","character":" Shimoda","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gerry Day","urlProfile":"http://www.imdb.com/name/nm0206410","urlPhoto":"","biography":{"bio":"Gerry Day is an actor, known for Street Fighter - L'ultime combat (1994), The Marine (2006) and 20,000 Leagues Under the Sea (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0206410","name":"Gerry Day","idIMDB":"nm0206410"},"actorId":"nm0206410","character":" Nitongu","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steven Grives","urlProfile":"http://www.imdb.com/name/nm0342708","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NjM1OTMwMV5BMl5BanBnXkFtZTcwNzY2NzgyNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 March 1951","placeOfBirth":" Lordsworth, Warwickshire, England, UK","bio":"Steven Grives was born on March 16, 1951 in Lordsworth, Warwickshire, England. He is an actor and director, known for Scooby-Doo (2002), Highlander II: The Quickening (1991) and A Nightmare on Elm Street 5: The Dream Child (1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NjM1OTMwMV5BMl5BanBnXkFtZTcwNzY2NzgyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0342708","name":"Steven Grives","idIMDB":"nm0342708"},"actorId":"nm0342708","character":" Garfield","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Boe Kaan","urlProfile":"http://www.imdb.com/name/nm0433937","urlPhoto":"","biography":{"bio":"Boe Kaan is an actress, known for 20,000 Leagues Under the Sea (1997) and Sea Patrol (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0433937","name":"Boe Kaan","idIMDB":"nm0433937"},"actorId":"nm0433937","character":" Ivanda","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Damian Monk","urlProfile":"http://www.imdb.com/name/nm0598212","urlPhoto":"","biography":{"bio":"Damian Monk is an actor, known for Babe, le cochon dans la ville (1998), Two Hands (1999) and Oscar and Lucinda (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0598212","name":"Damian Monk","idIMDB":"nm0598212"},"actorId":"nm0598212","character":" Dennison","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeff Dornan","urlProfile":"http://www.imdb.com/name/nm1693536","urlPhoto":"","biography":{"bio":"Jeff Dornan is an actor, known for Nim's Island (2008), Applause (2006) and 20,000 Leagues Under the Sea (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1693536","name":"Jeff Dornan","idIMDB":"nm1693536"},"actorId":"nm1693536","character":" American Scientist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gabriel Carr","urlProfile":"http://www.imdb.com/name/nm1693341","urlPhoto":"","biography":{"bio":"Gabriel Carr is an actor, known for 20,000 Leagues Under the Sea (1997) and Fat Pizza (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1693341","name":"Gabriel Carr","idIMDB":"nm1693341"},"actorId":"nm1693341","character":" Russian Scientist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Settle","urlProfile":"http://www.imdb.com/name/nm0786137","urlPhoto":"","biography":{"height":"6' 6\" (1.98 m)","bio":"Peter Settle is an actor, known for Broken Highway (1993), 20,000 Leagues Under the Sea (1997) and Hunter (1967).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0786137","name":"Peter Settle","idIMDB":"nm0786137"},"actorId":"nm0786137","character":" British Scientist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Scheidel","urlProfile":"http://www.imdb.com/name/nm1622775","urlPhoto":"","biography":{"bio":"Peter Scheidel is an actor, known for 20,000 Leagues Under the Sea (1997) and Mission: Impossible (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1622775","name":"Peter Scheidel","idIMDB":"nm1622775"},"actorId":"nm1622775","character":" Austrian Scientist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Duke Bannister","urlProfile":"http://www.imdb.com/name/nm0052394","urlPhoto":"","biography":{"bio":"Duke Bannister is an actor, known for Crocodile Dundee III (2001), 20,000 Leagues Under the Sea (1997) and Hunting (1991).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0052394","name":"Duke Bannister","idIMDB":"nm0052394"},"actorId":"nm0052394","character":" Scientist #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Pate","urlProfile":"http://www.imdb.com/name/nm0665311","urlPhoto":"","biography":{"dateOfBirth":"15 November 1952","placeOfBirth":" Santa Monica, California, USA","bio":"Christopher Pate was born on November 15, 1952 in Santa Monica, California, USA. He is known for his work on The Marsupials: The Howling III (1987), The Mango Tree (1977) and Natalie Wood - Le prix de la gloire (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0665311","name":"Christopher Pate","idIMDB":"nm0665311"},"actorId":"nm0665311","character":" Conductor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cal Rein","urlProfile":"http://www.imdb.com/name/nm0316379","urlPhoto":"","biography":{"dateOfBirth":"20 February 1970","placeOfBirth":" Melbourne, Victoria, Australia","height":"5' 9\" (1.75 m)","bio":"Cal Rein is an Australian actor in film and television appearing in a wide variety of roles in Australian and American productions. He has also worked in broadcasting and hosted a variety of live events and was the official host for the Miss Hawaiian Tropic Australia Pageant. He studied acting under coaches John Orcsik, Ken James and in Los Angeles at the Ivana Chubbuck Studio.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0316379","name":"Cal Rein","idIMDB":"nm0316379"},"actorId":"nm0316379","character":" Seaman","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[{"yearSeason":1997,"episodes":[{"episode":1,"title":"Episode #1.1","date":"1997","plot":"The year is 1886, when New England's fishing harbours are the scene for a \"creature of unknown origin\" destroying ships at sea. It is the job of Professor Pierre Arronax, a marine expert, and Ned Land, the iron-willed sailor, to learn the truth of the \"monster\" roaming the seas. The great novelist, Jules Verne, described this perilous journey to the darkest depths of the sea with Captain Nemo aboard the Nautilus.","idIMDB":"tt5846002"},{"episode":2,"title":"Episode #1.2","date":"1997","plot":"The year is 1886, when New England's fishing harbours are the scene for a \"creature of unknown origin\" destroying ships at sea. It is the job of Professor Pierre Arronax, a marine expert, and Ned Land, the iron-willed sailor, to learn the truth of the \"monster\" roaming the seas. The great novelist, Jules Verne, described this perilous journey to the darkest depths of the sea with Captain Nemo aboard the Nautilus.","idIMDB":"tt5846020"}]},{"yearSeason":1997,"episodes":[{"episode":1,"title":"Episode #1.1","date":"1997","plot":"The year is 1886, when New England's fishing harbours are the scene for a \"creature of unknown origin\" destroying ships at sea. It is the job of Professor Pierre Arronax, a marine expert, and Ned Land, the iron-willed sailor, to learn the truth of the \"monster\" roaming the seas. The great novelist, Jules Verne, described this perilous journey to the darkest depths of the sea with Captain Nemo aboard the Nautilus.","idIMDB":"tt5846002"},{"episode":2,"title":"Episode #1.2","date":"1997","plot":"The year is 1886, when New England's fishing harbours are the scene for a \"creature of unknown origin\" destroying ships at sea. It is the job of Professor Pierre Arronax, a marine expert, and Ned Land, the iron-willed sailor, to learn the truth of the \"monster\" roaming the seas. The great novelist, Jules Verne, described this perilous journey to the darkest depths of the sea with Captain Nemo aboard the Nautilus.","idIMDB":"tt5846020"}]}],"idIMDB":"tt0118248","urlIMDB":"http://www.imdb.com/title/tt0118248","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 38 min (158 min) (Brazil)","1 hr (60 min) (3 episodes)","2 hr 55 min (175 min) (DVD)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"5.7","filmingLocations":[{"location":"Australia"}],"awards":[],"votes":"1,217","type":"TV Mini-Series","companyCreditsSimple":[{"idCompany":"co0185466","name":"Frederick S. Pierce Company"},{"idCompany":"co0029011","name":"Village Roadshow Pictures Television"}],"keywords":{"keywords":["sea","jules verne","monster","captain nemo","tv mini series","two part tv movie","ship wreck","rescue","hostage","father daughter relationship","escape","steampunk","ocean","submarine","atlantis","giant squid","gadget","1860s","cyborg","underwater","based on novel","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 01:09:34"}}