{"data":{"movies":[{"title":"The Surgeon","originalTitle":"Exquisite Tenderness","year":"1995","releaseDate":"19951110","directors":[{"name":"Carl Schenkel","id":"nm0770918"}],"writers":[{"name":"Patrick Cirillo","id":"nm0162752"},{"name":"Bernard Sloane","id":"nm0806032"}],"runtime":"99 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NDA1MzU1NV5BMl5BanBnXkFtZTcwMTI2NDU4MQ@@._V1.jpg","countries":["USA","UK","Germany"],"languages":["English"],"genres":["Horror","Thriller"],"plot":"Dr. Julian Mater is suspended and gets his license revoked for performing experiments on dying patients in cellular regeneration. A couple of years later, he returns to the hospital that condemned his work to begin practicing his grizzly experiments once more.","simplePlot":"A small boy witnesses his brother being killed in surgery, grows up to become a monster with a scalpel.","actors":[{"actorName":"Isabel Glasser","urlProfile":"http://www.imdb.com/name/nm0322050","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNDk3NzE0NV5BMl5BanBnXkFtZTcwOTI3NDcyMQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 May 1958","placeOfBirth":"","bio":"Isabel Glasser was born on May 1, 1958. She is an actress, known for Forever Young (1992), Loving (1983) and Pure Country (1992).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNDk3NzE0NV5BMl5BanBnXkFtZTcwOTI3NDcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0322050","name":"Isabel Glasser","idIMDB":"nm0322050"},"actorId":"nm0322050","character":"Dr. Theresa McCann","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Remar","urlProfile":"http://www.imdb.com/name/nm0001664","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NzMwNjAyN15BMl5BanBnXkFtZTgwNDA5NTkyMDI@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1953","placeOfBirth":" Boston, Massachusetts, USA","birthName":"William James Remar","height":"5' 10\" (1.78 m)","bio":"James is a rugged, intense character player with leading man good looks. Having first gained recognition in 1979 as Ajax, in his second film, The Warriors (1979). That same year he garnered acclaim on Broadway with Richard Gere in the concentration camp drama \"Bent\". In a career spanning nearly four decades, James has run the gamut of roles and solid career choices. Ranging from the psychopaths, Dutch Schultz in 'Francis Copolla''s The Cotton Club (1984) and 'Albert Ganz' in Walter Hill's 48 Hrs. (1982) to Samantha's lover, the billionaire playboy, Richard Wright, in the HBO series Sex and the City (1998).\" James has also garnered roles which highlight a more vulnerable side, such as his guitarist who gets a break in the Oscar-winning short, Session Man (1991) or his artist who falls in love with a gargoyle come to life in the best segment of the horror anthology, Tales from the Darkside: The Movie (1990) and as Mary Louise Parker's lover in Boys on the Side. More recently James starred along side Michael C. Hall in the hit Showtime series Dexter (2006) where he played Dexter's wise, compassionate, adoptive father, Harry Morgan. Grey's Anatomy fans have recently enjoyed seeing James as Karev's long-lost Dad. While remaining active with top feature films James enjoys the distinction of being the only actor to die twice, as two different characters in Quentin Tarintino's smash hit Django Unchained. James won the 8th annual SAG award as a member of the Outstanding Comedy Ensemble for his work in Sex and the City. As a member of the ensemble cast of Dexter, James has been nominated for the SAG award and the Emmy. In recognition for his work in Sci-Fi Fantasy and Horror James was honored with the Saturn Lifetime Achievement Award in 2013.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NzMwNjAyN15BMl5BanBnXkFtZTgwNDA5NTkyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001664","name":"James Remar","idIMDB":"nm0001664"},"actorId":"nm0001664","character":"Dr. Benjamin Hendricks","urlCharacter":"http://www.imdb.com/character/ch0080948","main":true},{"actorName":"Sean Haberle","urlProfile":"http://www.imdb.com/name/nm0352221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ1NDQwNDU5OF5BMl5BanBnXkFtZTgwOTcyMzkwMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Sean Haberle is an actor, known for August Rush (2007), The Thomas Crown Affair (1999) and The Surgeon (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ1NDQwNDU5OF5BMl5BanBnXkFtZTgwOTcyMzkwMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0352221","name":"Sean Haberle","idIMDB":"nm0352221"},"actorId":"nm0352221","character":"Dr. Julian Matar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Boyle","urlProfile":"http://www.imdb.com/name/nm0001967","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0ODc5NTE4M15BMl5BanBnXkFtZTYwNjY3MTI0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 October 1935","placeOfBirth":" Norristown, Pennsylvania, USA","birthName":"Peter Lawrence Boyle Jr.","height":"6' 2\" (1.88 m)","bio":"A bold, blunt instrument of hatred and violence at the onset of his film career, Peter Boyle recoiled from that repugnant, politically incorrect \"working class\" image to eventually play gruff, gentler bears and even comedy monsters in a career that lasted four decades. He was born on October 18, 1935, in Norristown, Pennsylvania, to Alice (Lewis) and Francis Xavier Boyle. He eventually moved to Philadelphia, where his father was a sought-after local TV personality and children's show host. His paternal grandparents were Irish immigrants, and his mother was of mostly French and British Isles descent. Following a solid Catholic upbringing (he attended a Catholic high school), Peter was a sensitive youth and joined the Christian Brothers religious order at one point while attending La Salle University in Philadelphia. He left the monastery after only a few years when he \"lost\" his calling. Bent on an acting career, Boyle initially studied with guru Uta Hagen in New York. The tall (6' 2\"), hulking, prematurely bald actor wannabe struggled through a variety of odd jobs (postal worker, waiter, bouncer) while simultaneously building up his credits on stage and waiting for that first big break. Things started progressing for him after appearing in the national company of \"The Odd Couple\" in 1965 and landing TV commercials on the sly. In the late 60s he joined Chicago's Second City improv group and made his Broadway debut as a replacement for Peter Bonerz in Paul Sills' \"Story Theatre\" (1971) (Sills was the founder of Second City). Peter's breakout film role did not come without controversy as the hateful, hardhat-donning bigot-turned-murderer Joe (1970) in a tense, violence-prone film directed by John G. Avildsen. The role led to major notoriety, however, and some daunting supporting parts in T.R. Baskin (1971), Slither (1973) and as Robert Redford's calculating campaign manager in The Candidate (1972). During this time his political radicalism found a visible platform after joining Jane Fonda and Donald Sutherland on anti-war crusades, which would include the anti-establishment picture Steelyard Blues (1973). This period also saw the forging of a strong friendship with former Beatle John Lennon. Destined to be cast as monstrous undesirables throughout much of his career, he played a monster of another sort in his early film days, and thus avoided a complete stereotype as a film abhorrent. His hilarious, sexually potent Frankenstein's Monster in the cult Mel Brooks spoof Young Frankenstein (1974) saw him in a sympathetic and certainly more humorous vein. His creature's first public viewing, in which Boyle shares an adroit tap-dancing scene with \"creator\" Gene Wilder in full Fred Astaire regalia, was a show-stopping audience pleaser. Late 70s filmgoers continued to witness Boyle in seamy, urban settings with brutish roles in Taxi Driver (1976) and Hardcore (1979). At the same time he addressed several TV mini-movie roles with the same brilliant darkness such as his Senator Joe McCarthy in Tail Gunner Joe (1977), for which he received an Emmy nomination, and his murderous, knife-wielding Fatso in the miniseries remake of From Here to Eternity (1979). While the following decade found Peter in predominantly less noteworthy filming and a short-lived TV series lead as remote cop Joe Bash (1986), the 90s brought him Emmy glory (for a guest episode on The X-Files (1993)). Despite a blood clot-induced stroke in 1990 that impaired his speech for six months, he ventured on and capped his enviable career on TV wielding funny but crass one-liners in the \"Archie Bunker\" mold on the long-running sitcom Everybody Loves Raymond (1996). A major Emmy blunder had Boyle earning seven nominations for his Frank Barrone character without a win, the only prime player on the show unhonored. He survived a heart attack while on the set of \"Everybody Loves Raymond\" in 1999, but managed to return full time for the remainder of the series' run through 2005. Following a superb turn as Billy Bob Thornton's unrepentantly racist father in the sobering Oscar-winner Monster's Ball (2001), the remainder of his films were primarily situated in frivolous comedy fare such as The Adventures of Pluto Nash (2002), The Santa Clause 2 (2002), Scooby-Doo 2: Monsters Unleashed (2004), and The Santa Clause 3: The Escape Clause (2006), typically playing cranky curmudgeons. Boyle died of multiple myeloma (bone-marrow cancer) and heart disease at New York Presbyterian Hospital in 2006, and was survived by his wife Lorraine and two children. He was 71.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0ODc5NTE4M15BMl5BanBnXkFtZTYwNjY3MTI0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001967","name":"Peter Boyle","idIMDB":"nm0001967"},"actorId":"nm0001967","character":"Lt. McEllwaine","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Malcolm McDowell","urlProfile":"http://www.imdb.com/name/nm0000532","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMjQxNzczM15BMl5BanBnXkFtZTcwMTg3MTMwNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1943","placeOfBirth":" Horsforth, Yorkshire, England, UK","birthName":"Malcolm John Taylor","height":"5' 8½\" (1.74 m)","bio":"Malcolm John Taylor was born on June 13, 1943 in Leeds, England, to working-class parents Edna (McDowell), a hotelier, and Charles Taylor, a publican. His father was an alcoholic. Malcolm hated his parents' ways. His father was keen to send his son to private school to give him a good start in life, so Malcolm was packed off to boarding school at age 11. He attended the Tunbridge Boarding School and the Cannock House School in Eltham, Kent. At school, he was beaten with the slipper or cane every Monday for his wayward behavior. Whilst at school, he decided that he wanted to become an actor; it was also around this time that his love for race cars began. He attended the London Academy of Music and Dramatic Arts (LAMDA) to study acting. Meanwhile, he worked at his parents' pub but lost his job when the pub went bankrupt, his father drinking all the profits. He then had a variety of jobs, from coffee salesman to messenger. His first big-screen role was in Poor Cow (1967), although his two-minute scene was ultimately cut from the completed film. Soon after, he caught the attention of director Lindsay Anderson who cast him in the role of a rebellious student in his film If.... (1968). The film catapulted Malcolm to stardom in Britain but failed everywhere else. He was so enthusiastic about the film's success that he wanted to do another right away. He began writing what would become the semi-autobiographical O Lucky Man! (1973). Meanwhile, he starred as the infamous Alex DeLarge in Stanley Kubrick's controversial A Clockwork Orange (1971), a role that caused him to be typecast as a manic psychopathic villain. In early 1976, he spent nearly a year working on what would later be one of the most infamous films of all time, the semi-pornographic Caligula (1979), financed by Penthouse magazine founder Bob Guccione. Around that time, the British film industry collapsed, forcing him to flee to America to continue working. His first American film was Time After Time (1979). He then did Britannia Hospital (1982), the last part of Lindsay Anderson's working-class trilogy that started with If.... (1968). In the mid-1980s, the years of alcohol and drug abuse, including $1000 a week on cocaine, caught up with him. Years of abuse took its toll on him; his black hairs were now grey. Looking older than he really was, nobody wanted to cast him for playing younger roles. The big roles having dried up, he did many B-rated movies. The 1990s were kinder to him, though. In 1994, he was cast as Dr. Tolian Soran, the man who killed Captain James T. Kirk in Star Trek: Generations (1994). He was back on the track, playing villains again. He played another in the classic BBC miniseries Our Friends in the North (1996). Today, with more than 100 films under his belt, he is one of the greatest actors in America. He still does not have American citizenship, but he likes the no-nonsense American ways. He resides in the northern suburbs of Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMjQxNzczM15BMl5BanBnXkFtZTcwMTg3MTMwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000532","name":"Malcolm McDowell","nicknames":["Mick"],"idIMDB":"nm0000532"},"actorId":"nm0000532","character":"Dr. Stein","urlCharacter":"http://www.imdb.com/character/ch0056857","main":true},{"actorName":"Charles Dance","urlProfile":"http://www.imdb.com/name/nm0001097","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzY0Mjg4MzM0Ml5BMl5BanBnXkFtZTcwODc4NTIxNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1946","placeOfBirth":" Redditch, Worcestershire, England, UK","birthName":"Walter Charles Dance","height":"6' 3\" (1.91 m)","bio":"Charles Dance is an English actor, screenwriter, and film director. Dance typically plays assertive bureaucrats or villains. Some of his most high-profile roles are Tywin Lannister in HBO's Game of Thrones (2011), Guy Perron in The Jewel in the Crown (1984), Sardo Numspa in The Golden Child (1986), Dr. Jonathan Clemens in Alien 3 (1992), Benedict in Last Action Hero (1993), the Master Vampire in Dracula Untold (2014), Lord Havelock Vetinari in Terry Pratchett's Going Postal (2010) and Alastair Denniston in The Imitation Game (2014). He played the role of Tywin Lannister in HBO's Game of Thrones (2011), based on the Song of Ice and Fire novels by George R. R. Martin. In 1989, he played Bond creator Ian Fleming in Anglia Television's drama biography.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzY0Mjg4MzM0Ml5BMl5BanBnXkFtZTcwODc4NTIxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001097","name":"Charles Dance","idIMDB":"nm0001097"},"actorId":"nm0001097","character":"Dr. Ed Mittlesbay","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Beverly Todd","urlProfile":"http://www.imdb.com/name/nm0865119","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMjc1MTczMl5BMl5BanBnXkFtZTcwOTcxNTI4Mw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1946","placeOfBirth":" Chicago, Illinois, USA","bio":"Iconic actress Beverly Todd has distinguished herself on Broadway, the London stage, television and film. A People's Choice Award winner and a four-time nominee of the prestigious NAACP Image Award, Ms. Todd's work dates back to the 70's in film roles opposite her mentor Sidney Poitier in The Lost Man, They Call Me Mr. Tibbs, and Brother John. In the 80's she starred with Richard Pryor in Moving, Whoopi Goldberg in Clara's Heart, and Morgan Freeman in Lean on Me. She has a long list of television appearances including the PBS Television Special, Six Characters in Search of an Author, which was the first time the leading role of Stepdaughter was played by an actress of color, Roots, Don't Look Back opposite Louis Gossett, Jr., Lifetime's, Taken From Me, opposite Taraji P. Henson, Hope and Redemption, with major guest stars roles on Six Feet Under, Criminal Minds and Grey's Anatomy, to name a few. Recent credits in films include leads in Ava DuVernay's I Will Follow, Paul Haggis's Academy Award Best Picture winner Crash and Rob Reiner's The Bucket List. Beverly is starring in the soon to be released film Drive Me to Vegas and Mars, directed and written by Sidney J. Furie. Beverly is a youth advocate, conducting poetry workshops for delinquent boys, self-esteem workshops for at risk teen-age girls, and theatre programs for Inner City Junior High School Students.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMjc1MTczMl5BMl5BanBnXkFtZTcwOTcxNTI4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0865119","name":"Beverly Todd","idIMDB":"nm0865119"},"actorId":"nm0865119","character":"Nurse Burns","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Bailey-Gates","urlProfile":"http://www.imdb.com/name/nm0047538","urlPhoto":"","biography":{"bio":"Charles Bailey-Gates is an actor, known for Face à face (1992), The Surgeon (1995) and The Mouse (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0047538","name":"Charles Bailey-Gates","idIMDB":"nm0047538"},"actorId":"nm0047538","character":"Sgt. Ross","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Walter Olkewicz","urlProfile":"http://www.imdb.com/name/nm0647288","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MTM4NTc1OV5BMl5BanBnXkFtZTgwMjg1NzA5MzE@._V1_UY44_CR19,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 May 1948","placeOfBirth":" Bayonne, New Jersey, USA","bio":"Walter Olkewicz was born on May 14, 1948 in Bayonne, New Jersey, USA. He is an actor, known for The Client (1994), Grace Under Fire (1993) and Twin Peaks: Fire Walk with Me (1992).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MTM4NTc1OV5BMl5BanBnXkFtZTgwMjg1NzA5MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0647288","name":"Walter Olkewicz","idIMDB":"nm0647288"},"actorId":"nm0647288","character":"Dr. Meade","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mother Love","urlProfile":"http://www.imdb.com/name/nm0366354","urlPhoto":"","biography":{"dateOfBirth":"1953","placeOfBirth":"","bio":"Mother Love was born in 1953. She is known for her work on Kazaam (1996), Volcano (1997) and The Misery Brothers (1995). She has been married to Kennedy since October 8, 1972. They have one child.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0366354","name":"Mother Love","idIMDB":"nm0366354"},"actorId":"nm0366354","character":"Milly Putnam","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gregory West","urlProfile":"http://www.imdb.com/name/nm0922087","urlPhoto":"","biography":{"bio":"Gregory West is an actor, known for Class of 1999 II: The Substitute (1994), The Surgeon (1995) and Killer Caliber .32 (1967).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0922087","name":"Gregory West","idIMDB":"nm0922087"},"actorId":"nm0922087","character":"Tommy Beaton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Juliette Jeffers","urlProfile":"http://www.imdb.com/name/nm0420156","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3Mjk1NzM4OF5BMl5BanBnXkFtZTYwNjIzNDgy._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"bio":"Juliette Jeffers is known for her work on Lemon (2017), Play the Game (2009) and Nobel Son (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3Mjk1NzM4OF5BMl5BanBnXkFtZTYwNjIzNDgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0420156","name":"Juliette Jeffers","idIMDB":"nm0420156"},"actorId":"nm0420156","character":"Lisa Wilson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nancy Banks","urlProfile":"http://www.imdb.com/name/nm0052220","urlPhoto":"","biography":{"bio":"Nancy Banks is known for her work on The Help (2011), I Am Number Four (2011) and Mirror Mirror (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0052220","name":"Nancy Banks","idIMDB":"nm0052220"},"actorId":"nm0052220","character":"Loreen Ridgeway","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kim Robillard","urlProfile":"http://www.imdb.com/name/nm0732152","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTczOWQ5MzgtNmQ0My00YzQ2LTk3NTAtNDRmM2Q1NGI3N2RiXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1955","placeOfBirth":" Birmingham, Alabama, USA","height":"6' (1.83 m)","bio":"Kim Robillard is an actor known for RAINMAN (1988), DJANGO UNCHAINED (2012), TERMINATOR 3: RISE OF THE MACHINES (2003), Sal the Shrimp Guy on HART OF DIXIE and Mark Dantzler (the dirty parole officer) in KINDOM on DIRECTV. He has been in two Oscar winning movies and has appeared in over 60 feature films and television shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTczOWQ5MzgtNmQ0My00YzQ2LTk3NTAtNDRmM2Q1NGI3N2RiXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0732152","name":"Kim Robillard","idIMDB":"nm0732152"},"actorId":"nm0732152","character":"Dr. Eugene Kaiser","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Teryl Rothery","urlProfile":"http://www.imdb.com/name/nm0745186","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg3MzYzNjE0Ml5BMl5BanBnXkFtZTcwNjU5NDMxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 November 1962","placeOfBirth":" Vancouver, British Columbia, Canada","height":"5' 2\" (1.57 m)","bio":"A Vancouver, British Columbia, native, Teryl Rothery always knew she wanted to be an entertainer. She began her career as a dancer at age thirteen when she performed in her first musical, \"Bye Bye Birdie\". Her role in \"Annie Get Your Gun\" earned her a Most Outstanding Performer award with her theater company. Teryl has been working in TV & Movie industry for many years and has most recently seen success in the hit show Stargate SG-1 (1997). Over the years, Teryl has appeared on Au-delà du réel - l'aventure continue (1995), The X-Files (1993), First Wave (1998) and movies such as Masterminds (1997) with Patrick Stewart, Mr. Rice's Secret (2000) with David Bowie. When not working, Teryl enjoys walking, riding and roller blading. Teryl Rothery's feature film credits include Urban Safari (1996), Andre (1994) and The Surgeon (1995). She has appeared in the television movies Who Killed My Daughter (1995), Deceived by Trust: A Moment of Truth Movie (1995), She Stood Alone: The Tailhook Scandal (1995), For the Love of Nancy (1994) and The Man Who Wouldn't Die (1994) and has guest-starred on The X-Files (1993), L'as de la crime (1991), Robin's Hoods (1994), M.A.N.T.I.S. (1994) and Cobra (1993). Teryl has used her voice talents on many cartoon series including Exosquad (1993) and Ranma 1/2. On Stargate SG-1 (1997), Teryl plays the part of \"Dr. Janet Fraiser,\" Medical Officer for the Cheyenne Mountain Facility. Dr. Fraiser's skill and compassion enable her to face the most peculiar cases brought to her by SG-1 and all the other SG teams.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg3MzYzNjE0Ml5BMl5BanBnXkFtZTcwNjU5NDMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0745186","name":"Teryl Rothery","nicknames":["Turtle","Terlene","The Ever Ready Bunny"],"idIMDB":"nm0745186"},"actorId":"nm0745186","character":"Officer Pierson","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0109761","urlIMDB":"http://www.imdb.com/title/tt0109761","business":{"budget":{"money":"$CAD10,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"08","month":"07","year":"1993","remarks":null},{"money":null,"country":null,"day":"03","month":"09","year":"1993","remarks":null}],"copyrightHolder":"Copyright ©1994 Connexion Film Vertriebs und Produktions GmbH &amp; Co. KG. All rights reserved. (on print)"},"technical":{"runtime":["1 hr 40 min (100 min)","1 hr 39 min (99 min) (USA)"],"soundMix":["DTS-Stereo"],"color":["Black and White","Color"],"aspectRatio":["2.35 : 1"],"camera":["Clairmont Camera"],"laboratory":["Gastown Film Labs Ltd., Vancouver, Canada (film laboratory)","Consolidated Film Industries (CFI), Hollywood (CA), USA (color by) (as CFI)"],"filmLength":["2,709 m"],"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"4.8","filmingLocations":[{"location":"Vancouver, British Columbia, Canada"}],"rated":"R","awards":[],"votes":"564","type":"Movie","companyCreditsSimple":[{"idCompany":"co0009948","name":"Capella International"},{"idCompany":"co0053324","name":"Connexion Film"},{"idCompany":"co0346415","name":"Lollipop Productions"}],"keywords":{"keywords":["male frontal nudity","hospital","medical","regeneration","latex gloves","blood on face","blood","sewing needle","surgical mask","medical mask","blood on hands","needle","syringe","gun","hand gun","bullet","slasher flick","violence","male nudity","woman breaks high heel","foot closeup","camera shot of feet","female stockinged foot","pantyhose","underwater sex","brief female frontal nudity","skinny dipping","female frontal nudity","female nudity","bone saw","helicopter","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:34:38"}}