{"data":{"movies":[{"title":"Blown Away","originalTitle":"","year":"1994","releaseDate":"19940701","directors":[{"name":"Stephen Hopkins","id":"nm0394280"}],"writers":[{"name":"John Rice","id":"nm0723468"},{"name":"Joe Batteer","id":"nm0061337"}],"runtime":"121 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQyY2VjZDItOTFlOC00MzdhLWFhZmYtYmY4ZWJlOWJlMjY3XkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1.jpg","countries":["USA"],"languages":["English","Irish"],"genres":["Action","Crime","Drama","Thriller"],"plot":"Jimmy Dove works for the bomb squad in Boston and he is always the one who is on the tough jobs. One day he decides to quit the force and to become a teacher for the rookies of the squad. A few days later his former partner is killed by a bomb and Jimmy becomes suspicious that maybe this bomb could have been built by a former friend of himself. He begins to investigate and finds out that his worst nightmare has returned from his past.","simplePlot":"An Irish bomber escapes from prison and targets a member of the Boston bomb squad.","actors":[{"actorName":"Jeff Bridges","urlProfile":"http://www.imdb.com/name/nm0000313","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU1NjM4MDYzMl5BMl5BanBnXkFtZTcwMjIwMjMyMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 December 1949","placeOfBirth":" Los Angeles, California, USA","birthName":"Jeffrey Leon Bridges","height":"6' 1\" (1.85 m)","bio":"Jeffrey Leon Bridges was born on December 4, 1949 in Los Angeles, California, the son of well-known film and TV star Lloyd Bridges and his long-time wife Dorothy Dean Bridges (née Simpson). He grew up amid the happening Hollywood scene with big brother Beau Bridges. Both boys popped up, without billing, alongside their mother in the film The Company She Keeps (1951), and appeared on occasion with their famous dad on his popular underwater TV series Sea Hunt (1958) while growing up. At age 14, Jeff toured with his father in a stage production of \"Anniversary Waltz\". The \"troublesome teen\" years proved just that for Jeff and his parents were compelled at one point to intervene when problems with drugs and marijuana got out of hand. He recovered and began shaping his nascent young adult career appearing on TV as a younger version of his father in the acclaimed TV- movie Silent Night, Lonely Night (1969), and in the strange Burgess Meredith film Le 3eme oeil (1970). Following fine notices for his portrayal of a white student caught up in the racially-themed Halls of Anger (1970), his career-maker arrived just a year later when he earned a coming-of-age role in the critically-acclaimed ensemble film The Last Picture Show (1971). The Peter Bogdanovich- directed film made stars out off its young leads (Bridges, Timothy Bottoms, Cybill Shepherd) and Oscar winners out of its older cast (Ben Johnson, Cloris Leachman). The part of Duane Jackson, for which Jeff received his first Oscar-nomination (for \"best supporting actor\"), set the tone for the types of roles Jeff would acquaint himself with his fans -- rambling, reckless, rascally and usually unpredictable). Owning a casual carefree handsomeness and armed with a perpetual grin and sly charm, he started immediately on an intriguing 70s sojourn into offbeat filming. Chief among them were his boxer on his way up opposite a declining Stacy Keach in Fat City (1972); his Civil War-era conman in the western Bad Company (1972); his redneck stock car racer in The Last American Hero (1973); his young student anarchist opposite a stellar veteran cast in Eugene O'Neill's The Iceman Cometh (1973); his bank-robbing (also Oscar-nominated) sidekick to Clint Eastwood in Thunderbolt and Lightfoot (1974); his aimless cattle rustler in Rancho Deluxe (1975); his low-level western writer who wants to be a real-life cowboy in Hearts of the West (1975); and his brother of an assassinated President who pursues leads to the crime in Winter Kills (1979). All are simply marvelous characters that should have propelled him to the very top rungs of stardom...but strangely didn't. Perhaps it was his trademark ease and naturalistic approach that made him somewhat under appreciated at that time when Hollywood was run by a Dustin Hoffman, Robert De Niro and Al Pacino-like intensity. Neverthless, Jeff continued to be a scene-stealing favorite into the next decade, notably as the video game programmer in the 1982 science-fiction cult classic TRON (1982), and the struggling musician brother vying with brother Beau Bridges over the attentions of sexy singer Michelle Pfeiffer in The Fabulous Baker Boys (1989). Jeff became a third-time Oscar nominee with his highly intriguing (and strangely sexy) portrayal of a blank-faced alien in Starman (1984), and earned even higher regard as the ever-optimistic inventor Preston Tucker in Tucker: The Man and His Dream (1988). Since then Jeff has continued to pour on the Bridges magic on film. Few enjoy such an enduring popularity while maintaining equal respect with the critics. The Fisher King (1991), American Heart (1992), Fearless (1993), The Big Lebowski (1998) (now a cult phenomenon) and The Contender (2000) (which gave him a fourth Oscar nomination) are prime examples. More recently he seized the moment as a bald-pated villain as Robert Downey Jr.'s nemesis in Iron Man (2008) and then, at age 60, he capped his rewarding career by winning the elusive Oscar, plus the Golden Globe and Screen Actor Guild awards (among many others), for his down-and-out country singer Bad Blake in Crazy Heart (2009). Bridges next starred in TRON: Legacy (2010), reprising one of his more famous roles, and received another Oscar nomination for Best Actor for his role in the Western remake True Grit (2010). In 2014, he co-produced and starred in an adaptation of the Lois Lowry science fiction drama The Giver (2014). Jeff has been married since 1977 to non-professional Susan Geston (they met on the set of Rancho Deluxe (1975)). The couple have three daughters, Isabelle (born 1981), Jessica (born 1983), and Hayley (born 1985). He hobbies as a photographer on and off his film sets, and has been known to play around as a cartoonist and pop musician. His ancestry is English, and smaller amounts of Scots-Irish (Northern Irish), Irish, Swiss-German, and German.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU1NjM4MDYzMl5BMl5BanBnXkFtZTcwMjIwMjMyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000313","name":"Jeff Bridges","nicknames":["The Dude"],"idIMDB":"nm0000313"},"actorId":"nm0000313","character":"Dove","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tommy Lee Jones","urlProfile":"http://www.imdb.com/name/nm0000169","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNjc4MDc0OV5BMl5BanBnXkFtZTcwOTc5OTUwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1946","placeOfBirth":" San Saba, Texas, USA","height":"6' (1.83 m)","bio":"Tommy Lee Jones was born in San Saba, Texas, the son of Lucille Marie (Scott), a police officer and beauty shop owner, and Clyde C. Jones, who worked on oil fields. Tommy himself worked in underwater construction and on an oil rig. He attended St. Mark's School of Texas, a prestigious prep school for boys in Dallas, on a scholarship, and went to Harvard on another scholarship. He roomed with future Vice President Al Gore and played offensive guard in the famous 29-29 Harvard-Yale football game of '68 known as \"The Tie.\" He received a B.A. in English literature and graduated cum laude from Harvard in 1969. Following college, he moved to New York and began his theatrical career on Broadway in \"A Patriot for Me\" (1969). In 1970, he made his film debut in Love Story (1970). While living in New York, he continued to appear in various plays, both on- and off-Broadway: \"Fortune and Men's Eyes\" (1969); \"Four on a Garden\" (1971); \"Blue Boys\" (1972); \"Ulysses in Nighttown\" (1974). During this time, he also appeared on a daytime soap opera, One Life to Live (1968) as Dr. Mark Toland from 1971-75. He moved with wife Kate Lardner, granddaughter of short-story writer/columnist Ring Lardner, and her two children from a previous marriage, to Los Angeles. There he began to get some roles on television: Charlie's Angels (1976) (pilot episode); Smash-Up on Interstate 5 (1976); and The Amazing Howard Hughes (1977). While working on the movie Back Roads (1981), he met and fell in love with Kimberlea Cloughley, whom he later married. More roles in television--both on network and cable--stage and film garnered him a reputation as a strong, explosive, thoughtful actor who could handle supporting as well as leading roles. He made his directorial debut in The Good Old Boys (1995) on TNT. In addition to directing and starring in the film, he co-wrote the teleplay (with J.T. Allen). The film, based on Elmer Kelton's novel, is set in west Texas where Jones has strong family ties. Consequently, this story of a cowboy facing the end of an era has special meaning for him.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNjc4MDc0OV5BMl5BanBnXkFtZTcwOTc5OTUwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000169","name":"Tommy Lee Jones","nicknames":["TLJ","Tom"],"idIMDB":"nm0000169"},"actorId":"nm0000169","character":"Gaerity","urlCharacter":"http://www.imdb.com/character/ch0019071","main":true},{"actorName":"Suzy Amis","urlProfile":"http://www.imdb.com/name/nm0000751","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNDU4ODI5N15BMl5BanBnXkFtZTcwNjM4NTgwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1962","placeOfBirth":" Oklahoma City, Oklahoma, USA","birthName":"Susan Elizabeth Amis","height":"5' 8\" (1.73 m)","bio":"Born on January 5, 1962 in Oklahoma City, Oklahoma, Susan Elizabeth \"Suzy\" Amis first worked as a Ford model before she began acting in the 1980s. She made her film debut in the comedy film Fandango (1985), opposite Kevin Costner. After that, Amis next had roles in Rocket Gibraltar (1988), Where the Heart Is (1990), Rich in Love (1992) and The Ballad of Little Jo (1993). She later appeared in Blown Away (1994), The Usual Suspects (1995) and Titanic (1997) in which she played Rose DeWitt Bukater's granddaughter Lizzy Calvert. That same year, she starred opposite Tom Selleck in the television Western Last Stand at Saber River (1997) and appeared in the horror film Nadja (1994). Amis retired from acting after her last appearance in the science fiction action film Judgment Day (1999). In 2005, Amis founded Muse Elementary, a Reggio-inspired, independent, non-profit school in the Topanga, California area of Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNDU4ODI5N15BMl5BanBnXkFtZTcwNjM4NTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000751","name":"Suzy Amis","idIMDB":"nm0000751"},"actorId":"nm0000751","character":"Kate","urlCharacter":"http://www.imdb.com/character/ch0019072","main":true},{"actorName":"Lloyd Bridges","urlProfile":"http://www.imdb.com/name/nm0000978","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzNjM5NTQ4MV5BMl5BanBnXkFtZTYwMzgwMTM2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 January 1913","placeOfBirth":" San Leandro, California, USA","birthName":"Lloyd Vernet Bridges Jr.","height":"5' 11¾\" (1.82 m)","bio":"The star of many land and underwater adventures, Lloyd Vernet Bridges, Jr. was born on January 15, 1913 in San Leandro, California, to Harriet Evelyn (Brown) and Lloyd Vernet Bridges, Sr., who owned a movie theater and also worked in the hotel business. He grew up in various Northern California towns. His father wanted him to become a lawyer, but young Lloyd's interests turned to acting while at the University of California at Los Angeles. (Dorothy Dean Bridges, Bridges' wife of more than 50 years, was one of his UCLA classmates, and appeared opposite him in a romantic play called \"March Hares.\") He later worked on the Broadway stage, helped to found an off-Broadway theater, and acted, produced and directed at Green Mans ions, a theater in the Catskills. Bridges made his first films in 1936, and went under contract to Columbia in 1941. Allegations that Bridges had been involved with the Communist Party threatened to derail his career in the early 1950s, but he resumed work after an FBI clearance. Making the transition to television, Bridges became a small screen star of giant proportions by starring in Sea Hunt (1958), the country's most successful syndicated series. Trouper Bridges worked right to the end, winning even more new fans with his spoofy portrayals in the movies Airplane! (1980) and Hot Shots! (1991), and their respective sequels. Lloyd Bridges died at age 85 of natural causes on March 10, 1998.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzNjM5NTQ4MV5BMl5BanBnXkFtZTYwMzgwMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000978","name":"Lloyd Bridges","idIMDB":"nm0000978"},"actorId":"nm0000978","character":"Max","urlCharacter":"http://www.imdb.com/character/ch0450497","main":true},{"actorName":"Forest Whitaker","urlProfile":"http://www.imdb.com/name/nm0001845","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMDI3NTg2OV5BMl5BanBnXkFtZTcwNTgwMzg5Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1961","placeOfBirth":" Longview, Texas, USA","birthName":"Forest Steven Whitaker","height":"6' 2\" (1.88 m)","bio":"Forest Steven Whitaker has packaged a king-size talent into his hulking 6' 2\", 220 lb. frame. He won an Academy Award for his performance as Ugandan dictator Idi Amin in the 2006 film The Last King of Scotland (2006), and has also won a Golden Globe and a BAFTA. He is the fourth African-American male to win an Academy Award for Best Actor, following in the footsteps of Sidney Poitier, Denzel Washington, and Jamie Foxx. Whitaker was born on July 15, 1961 in Longview, Texas, to Laura Francis (Smith), a special education teacher, and Forest Steven Whitaker, an insurance salesman. His family moved to South Central Los Angeles in 1965. The athletically-inclined Whitaker initially found his way into college via a football scholarship. Later, however, he transferred to USC where he set his concentration on music and earned two more scholarships training as an operatic tenor. This, in turn, led to another scholarship at Berkeley with a renewed focus on acting and the performing stage. Whitaker made his film debut at the age of 21 in the raucous comedy Fast Times at Ridgemont High (1982) wherein he played, quite naturally, a footballer. He went on to play another sports-oriented student, a wrestler, in his second film Vision Quest (1985). He gained experience on TV as well with featured spots on such varied shows as Diff'rent Strokes (1978) and Cagney & Lacey (1981), not to mention the TV-movie Civil War epic North and South (1985) and its sequel. The movie that truly put him on the map was The Color of Money (1986). His one big scene as a naive-looking pool player who out-hustles Paul Newman's Fast Eddie Felson was pure electricity. This led to more visible roles in the \"A\" class films Platoon (1986), Stakeout (1987), and Good Morning, Vietnam (1987), which culminated in his breakout lead portrayal of the tortured jazz icon 'Charlie \"Bird\" Parker' in Clint Eastwood's passion project Bird (1988), for which Whitaker won the Cannes Film Festival award for \"best actor\" and a Golden Globe nomination. Whitaker continued to work with a number of well-known directors throughout the 1990s. While his \"gentle giant\" characters typically display innocence, indecision, and timidity along with a strong underlying humanity, he has certainly not shied away from the edgier, darker corners of life as his occasional hitmen and other menacing streetwise types can attest. Although in only the first section of the film, he was memorable as the IRA-captured British soldier whose bizarre relationship with a mysterious femme fatale serves as the catalyst for the critically-lauded drama The Crying Game (1992). Always a willing participant to push the envelope, he's gone on to enhance a number of lesser films. Among those was his plastic surgeon in Johnny Handsome (1989), gay clothing designer in Robert Altman's Ready to Wear (1994), alien hunter in Species (1995), absentee father confronted by his estranged son in Smoke (1995), and Mafia hitman who models himself after the samurai warrior in Ghost Dog, la voie du samouraï (1999), among many others. As would be expected, he's also had his share of epic-sized bombs, notoriously the L. Ron Hubbard sci-fi disaster Battlefield Earth (2000). On the TV front, he was the consulting producer and host of a revamped Rod Serling's cult series classic La treizième dimension (2002), which lasted a disappointing one season. In the early 1990s, Whitaker widened his horizons to include producing/directing and has since gained respect behind the camera as well. He started things off co-producing the violent gangster film A Rage in Harlem (1991), in which he co-starred with Gregory Hines and Robin Givens, and then made his successful directorial debut with the soulful Waiting to Exhale (1995), showcasing a legion of distaff black stars. He also directed co-star Whitney Houston's music video of the movie's theme song (\"Shoop Shoop\"). He also helmed the fluffy romantic comedy First Daughter (2004) with Katie Holmes and Michael Keaton. Whitaker also served as an executive producer on First Daughter. He had previously executive produced several made-for-television movies, most notably the 2002 Emmy-award winning Door to Door, starring William H. Macy. He produced these projects through his production company, Spirit Dance Entertainment, which he shut down in 2005 to concentrate on his acting career. In 2002, he co-starred in Joel Schumacher's thriller, Phone Booth, with Kiefer Sutherland and Colin Farrell. That year, he also co-starred with Jodie Foster in Panic Room. Whitaker's greatest success to date is the 2006 film, The Last King of Scotland. His performance earned him the 2007 Academy Award for Best Actor in a Leading Role, For that same role, he also received the Golden Globe Award, the Screen Actors Guild Award, a BAFTA Award, and many critical accolades. He has also received several other honors. In September 2006, the 10th Annual Hollywood Film Festival presented him with its \"Hollywood Actor of the Year Award,\" He was also honored at the Santa Barbara International Film Festival 2007, receiving the American Riviera Award. Previously, in 2005, the Deauville Festival of American Film paid tribute to him. In 2007, Forest Whitaker won the Cinema for Peace Award 2007. In 2007, Whitaker co-starred in The Great Debaters with fellow Oscar winner Denzel Washington, and in 2008, Whitaker played opposite Keanu Reeves in Street Kings and Dennis Quaid in Vantage Point. In 2009, Forest co-starred in the Warner Bros. film \"Where the Wild Things Are,\" directed by Spike Jonze, which was a mix of live-action, animation and puppetry as an adaptation of the Maurice Sendak classic children's book. Around the same time, he also starred in \"Repossession Mambo\", with Jude Law, \"Hurricane Season\", \"Winged Creatures\", and \"Powder Blue\". He appeared in the Olivier Dahan film \"My Own Love Song\", opposite Renée Zellweger, and was part of the Africa Movie Academy Awards in 2009, in Nigeria. He is married to former model Keisha Whitaker and has three children by her. His younger brothers Kenn Whitaker and Damon Whitaker are both actors as well. Forest was given a star on the Hollywood Walk in April of 2007. In November 2007, Whitaker was the creative mind behind DEWmocracy.com, a website that let people decide the next flavor of Mountain Dew in a \"People's Dew\" poll. He directed a short film and created the characters for the video game. Whitaker has done extensive humanitarian work, he has been involved with organizations like, Penny Lane, an organization that provides assistance to abused teenagers. PETA and Farm Sanctuary, organizations that protect animals' rights. Close friends with Neurosurgeon Dr. Keith Black, Forest has helped raise awareness and funds for Dr. Blacks research. During the last couple of years, he has become a spokesperson for Hope North Ugandan orphanage and Human Rights Watch. In the year 2001 Forest received a Humanitas Prize. He was recently honored by The City of Los Angeles with the Hope of Los Angeles Award. And his entire clan received the LA BEST Family Focus Award. Last year he joined forces with \"Idol Gives Back\" and \"Malaria No More\"; he has become a GQ Ambassador supporting and fundraising for Hope North. He was a Surrogate for Barrack Obama's campaign supporting him across the United States. Whitaker's multimedia company, Spirit Dance Entertainment, includes film, television and music production. He works closely with a number of charitable organizations, giving back to his community by serving as an Honorary Board Members for Penny Lane, an organization that provides assistance to abused teenagers, the Human Rights Watch and The Hope North organization.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMDI3NTg2OV5BMl5BanBnXkFtZTcwNTgwMzg5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001845","name":"Forest Whitaker","idIMDB":"nm0001845"},"actorId":"nm0001845","character":"Franklin","urlCharacter":"http://www.imdb.com/character/ch0450498","main":true},{"actorName":"Stephi Lineburg","urlProfile":"http://www.imdb.com/name/nm0512616","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNzQ5ODQxNV5BMl5BanBnXkFtZTcwMDIxOTMzMQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 November 1982","placeOfBirth":" Dover, New Jersey, USA","birthName":"Stephanie Marie Lineburg","height":"5' 2\" (1.57 m)","bio":"Stephi Lineburg was born on November 16, 1982 in Dover, New Jersey, USA as Stephanie Marie Lineburg. She is known for her work on Blown Away (1994), Ri¢hie Ri¢h (1994) and City by the Sea (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNzQ5ODQxNV5BMl5BanBnXkFtZTcwMDIxOTMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0512616","name":"Stephi Lineburg","idIMDB":"nm0512616"},"actorId":"nm0512616","character":"Lizzy","urlCharacter":"http://www.imdb.com/character/ch0450499","main":true},{"actorName":"John Finn","urlProfile":"http://www.imdb.com/name/nm0278125","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNzg1MTAyN15BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1952","placeOfBirth":" New York City, New York, USA","birthName":"John Joseph Finn","bio":"John Finn was born on September 30, 1952 in New York City, New York, USA as John Joseph Finn. He is an actor and director, known for Cold Case (2003), Catch Me If You Can (2002) and Glory (1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNzg1MTAyN15BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0278125","name":"John Finn","idIMDB":"nm0278125"},"actorId":"nm0278125","character":"Captain Roarke","urlCharacter":"http://www.imdb.com/character/ch0450500","main":true},{"actorName":"Caitlin Clarke","urlProfile":"http://www.imdb.com/name/nm0164680","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNDI1NTEyMl5BMl5BanBnXkFtZTgwNDY4NzIwMjE@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 May 1952","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"Catherine Ann Clarke","height":"5' 6\" (1.68 m)","bio":"Caitlin Clarke was born on May 3, 1952 in Pittsburgh, Pennsylvania, USA as Catherine Ann Clarke. She was an actress, known for Dragonslayer (1981), Blown Away (1994) and Crocodile Dundee (1986). She died on September 9, 2004 in Pittsburgh.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNDI1NTEyMl5BMl5BanBnXkFtZTgwNDY4NzIwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0164680","name":"Caitlin Clarke","idIMDB":"nm0164680"},"actorId":"nm0164680","character":"Rita","urlCharacter":"http://www.imdb.com/character/ch0450502","main":true},{"actorName":"Christofer de Oni","urlProfile":"http://www.imdb.com/name/nm1214659","urlPhoto":"","biography":{"bio":"Christofer de Oni is an actor, known for Blown Away (1994), Sea of Love (1989) and Revenge (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1214659","name":"Christofer de Oni","idIMDB":"nm1214659"},"actorId":"nm1214659","character":"Cortez","urlCharacter":"http://www.imdb.com/character/ch0450501","main":true},{"actorName":"Loyd Catlett","urlProfile":"http://www.imdb.com/name/nm0146178","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1OTYwNDMxNV5BMl5BanBnXkFtZTcwMDA2MDY1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 May 1953","placeOfBirth":" Lubbock, Texas, USA","height":"5' 11\" (1.8 m)","bio":"Former amateur and P.R.C.A. rodeo cowboy, events were Bareback Bronc, Saddle Bronc and Bull Riding. Originally from Texas, started with community theater and was cast for the part of Leroy in the film The Last Picture Show. Then came to L.A. to loop The Last Picture Show and never returned to Texas other than to make films. Started studying with various Acting workshops around L.A. and continues to do so today.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1OTYwNDMxNV5BMl5BanBnXkFtZTcwMDA2MDY1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0146178","name":"Loyd Catlett","nicknames":["The Legend"],"idIMDB":"nm0146178"},"actorId":"nm0146178","character":"Bama","urlCharacter":"http://www.imdb.com/character/ch0450503","main":true},{"actorName":"Ruben Santiago-Hudson","urlProfile":"http://www.imdb.com/name/nm0763650","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwODM2MzE0OF5BMl5BanBnXkFtZTYwNTk3ODI4._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 November 1956","placeOfBirth":" Lackawanna, New York, USA","birthName":"Ruben Santiago Jr.","bio":"Ruben Santiago-Hudson was born on November 24, 1956 in Lackawanna, New York, USA as Ruben Santiago Jr. He is an actor and writer, known for The Devil's Advocate (1997), American Gangster (2007) and Castle (2009). He is married to Jeannie Brittan. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwODM2MzE0OF5BMl5BanBnXkFtZTYwNTk3ODI4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0763650","name":"Ruben Santiago-Hudson","idIMDB":"nm0763650"},"actorId":"nm0763650","character":"Blanket","urlCharacter":"http://www.imdb.com/character/ch0450504","main":true},{"actorName":"Lucinda Weist","urlProfile":"http://www.imdb.com/name/nm0919333","urlPhoto":"","biography":{"dateOfBirth":"23 June 1963","placeOfBirth":" York, Pennsylvania, USA","bio":"Lucinda Weist was born on June 23, 1963 in York, Pennsylvania, USA. She is an actress, known for Blown Away (1994), Predator 2 (1990) and The Haunting of Seacliff Inn (1994). She was previously married to Jim Manera.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0919333","name":"Lucinda Weist","nicknames":["Cindy"],"idIMDB":"nm0919333"},"actorId":"nm0919333","character":"Nancy","urlCharacter":"http://www.imdb.com/character/ch0450505","main":true},{"actorName":"Brendan Burns","urlProfile":"http://www.imdb.com/name/nm0122601","urlPhoto":"","biography":{"bio":"Brendan Burns (Producer/Screenwriter/Actor) has worked extensively in film, television and the theater for the past 25 years, opposite such luminaries as Robert DeNiro, Tommy Lee Jones, Marisa Tomei, and Kathlene Quinlan, and Stephen Hopkins to name a few. Five-time Emmy Award-winning Executive Producer Edward_J._Scott is currently partnered with Burns in the film and television production company, Scott/Burns Productions. Paramount Pictures twice optioned Burn's original screenplay \"VTV\" with William Sackheim producing and Burns receiving the rewriting assignment. Burns developed \"The Atomic Veteran,\" a MOW based on the original play for Jaffe/Braunstein Films. Mr. Burns' original screenplay, \"Devil Jocks\" was optioned by James Keach and Emerald Eyes Productions with Burns executive producing. His story and treatment \"Hidden Valor: Women of the SOE,\" an epic mini-series, was first optioned by the producing team of Sanford/Pillsbury. As a stage producer, Brendan, through special arrangement with Joseph Papp, moved the Lincoln Center Production of Michael Dorn Moody's Obie Award-winning play, \"The Shortchanged Review\" to the Coronet Theatre in Los Angeles for its West Coast premiere. The production received wide acclaim from LA critics and went on to win eleven awards ranging from production design, performance, to two Best Production of the Year awards for Burns. Brendan was production manager and later co-producer of Arthur Miller's \"After the Fall\" by special arrangement with Mr. Miller himself. The production became the hottest ticket in town with Victor French and Julie Cobb heading the cast and Harris Yulin directing. The production received a host of honors including the LA Drama Critics Circle Best Actress award for Ms. Cobb and a nomination for Best Production of the Year. Burns served as executive in charge of the transformation of Stage Nine at Hollywood Center Studios into a four-hundred seat Equity theater. Under his guidance the facility became an Equity theater equipped for multiple-camera format to tape live stage productions. Mr. Burns produced and directed commercial spots for the Stage Nine Complex's maiden production of \"Gaslight,\" which aired on \"Charles Kuralt's America.\" As an actor, Brendan's feature films include, The Last Tycoon, written by Harold Pinter and directed by Elia Kazan, \"Raise the Titanic\" and \"Blown Away\" with Jeff Bridges and Tommy Lee Jones. Television credits include guest and co-starring roles in over sixty television series and movies, most prominently \"The Ordeal of Patty Hearst,\" \"Lanigan's Rabbi\" and \"Uncommon Valor.\" Brendan is familiar to audiences worldwide as District Attorney Glenn Richards appearing in over two hundred episodes of the Emmy Award- winning, internationally syndicated daytime drama \"The Young and the Restless.\" The Writers Zone, Clipper Group Entertainment, Vanishing Point Films and Edward Scott have retained Burns as a story consultant and screenplay analyst for film, prime-time and daytime television projects. Burns has served as a judge at the University of Southern California's Masters Thesis Play Writing Competition and currently serves on the advisory boards for both the Los Angeles Valley College Broadcasting and Theatre Arts Departments.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0122601","name":"Brendan Burns","idIMDB":"nm0122601"},"actorId":"nm0122601","character":"Kevin","urlCharacter":"http://www.imdb.com/character/ch0450507","main":true},{"actorName":"Tricia Heine","urlProfile":"http://www.imdb.com/name/nm0374333","urlPhoto":"","biography":{"bio":"Tricia Heine is known for her work on Spider-Man 2 (2004), The Fighter (2010) and The Proposal (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0374333","name":"Tricia Heine","idIMDB":"nm0374333"},"actorId":"nm0374333","character":"Connie","urlCharacter":"http://www.imdb.com/character/ch0450506","main":true},{"actorName":"Josh McLaglen","urlProfile":"http://www.imdb.com/name/nm0572137","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNTk4NzExMV5BMl5BanBnXkFtZTcwMzk5MzczNw@@._V1_UY44_CR10,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 February 1958","placeOfBirth":" Encino, California, USA","birthName":"Charles Josh McLaglen","bio":"Josh McLaglen was born on February 21, 1958 in Encino, California, USA as Charles Josh McLaglen. He is an assistant director and producer, known for Avatar (2009), Titanic (1997) and X-Men: Days of Future Past (2014). He has been married to Lisa A. Becker since February 19, 2000. They have four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNTk4NzExMV5BMl5BanBnXkFtZTcwMzk5MzczNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0572137","name":"Josh McLaglen","nicknames":["Zulu"],"idIMDB":"nm0572137"},"actorId":"nm0572137","character":"Prison Guard","urlCharacter":"http://www.imdb.com/character/ch0450508","main":true}],"seasons":[],"idIMDB":"tt0109303","urlIMDB":"http://www.imdb.com/title/tt0109303","business":{"budget":{"money":"$50,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$10,424,873","country":"USA","day":"03","month":"07","year":"1994","remarks":"1,862 Screens"}],"gross":[{"money":"£634,329","country":"UK","day":"11","month":"09","year":"1994","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1993/\">1993</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 1 min (121 min)"],"soundMix":["DTS","Dolby SR","DTS-Stereo"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm (Eastman EXR 200T 5293, EXR 500T 5296, EXR 500T 5298)"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"6.2","filmingLocations":[{"location":"Chelsea, Massachusetts, USA"}],"rated":"R","awards":[{"award":"MTV Movie Awards 1995","titlesAwards":[{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Best Villain","names":[{"name":"Tommy Lee Jones","id":"nm0000169","role":null}]},{"category":"Best Action Sequence","names":[]}]}]}],"votes":"23,947","type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"},{"idCompany":"co0078090","name":"Trilogy Entertainment Group"}],"keywords":{"keywords":["bomb","irish","prison","ireland","mit","hero","violinist","computer","flashback","terrorist","ship","revenge","stout the drink","irish whiskey","mercury","cape cod massachusetts","die hard scenario","last minute escape","belfast","independence day","pin the tail on the donkey","jig","stove","helicopter","crab","beach","kite flying","horoscope","retiree","wedding reception","funeral repast","human bomb","earphones","police lieutenant","roulette wheel","condom","motorcycle","engagement ring","pool of blood","child's birthday party","keyboard","vomit scene","disembowelment","cult film","handcuffs","villain","evil man","martial arts","mixed martial arts","explosion","husband wife relationship","rival","kiss","machine gun","good versus evil","disarming someone","fistfight","brawl","glock","semiautomatic pistol","pistol","gunfight","shootout","suspense","showdown","violence","tough guy","action hero","slow motion","lifting person in air","reference to michael bolton","concert","band shell","trolley","african american","janitor","vengeance","cuban american","big bang theory","extreme close up","anarchist","fishing","kite","reference to aretha franklin","reference to clarence thomas","mad bomber","camcorder","reference to t.s. eliot","body bag","reference to michael jackson","reference to u2","pigeon coop","marriage proposal","boston red sox","irish bar","guinness","rube goldberg machine","cambridge massachusetts","reference to statue of liberty","prison escape","fireworks","black and white scene","suicide","pager","step dancing","wedding","birthday party","exploding truck","exploding ship","terrorism","stalking","psychopath","obsession","double life","killing a dog","animal abuse","irish republican army","irish american","fenway park","gun","boston massachusetts","computer cracker","bombing","fourth of july","orchestra","title spoken by character","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:01:15"}}