{"data":{"movies":[{"title":"Don Quixote","originalTitle":"","year":"2000","releaseDate":"20000409","directors":[{"name":"Peter Yates","id":"nm0946811"}],"writers":[{"name":"Miguel de Cervantes y Saavedra","id":"nm0148859"},{"name":"John Mortimer","id":"nm0607876"}],"runtime":"120 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyODYzMzE3N15BMl5BanBnXkFtZTcwNjI1MzMzMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Adventure","Comedy","Romance","Drama"],"plot":"Adapted from the work of Miguel de Cervantes, this is the story of a hidalgo, fanatic for chivalry novels, who loses his sanity and believing to be a knight named Don Quixote de La Mancha, decides to go on imaginary adventures along with his friend, the simple farmer Sancho Panza, who becomes his squire. On their journeys, they rescue dames in distress in honorable acts and fight giants among other perils, with Don longing to be with the love of his life, lady Dulcinea, and Sancho waiting to be rewarded with an island where he's about to become a governor.","simplePlot":"Adapted from the work of Miguel de Cervantes, this is the story of a hidalgo, fanatic for chivalry novels, who loses his sanity and believing to be a knight named Don Quixote de La Mancha, ... ","actors":[{"actorName":"John Lithgow","urlProfile":"http://www.imdb.com/name/nm0001475","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzUyNDkzNF5BMl5BanBnXkFtZTcwNTMwNTU5MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 October 1945","placeOfBirth":" Rochester, New York, USA","birthName":"John Arthur Lithgow","height":"6' 4\" (1.93 m)","bio":"If \"born to the theater\" has meaning in determining a person's life path, then John Lithgow is a prime example of this truth. He was born in Rochester, New York, to Sarah Jane (Price), an actress, and Arthur Washington Lithgow III, who was both a theatrical producer and director. John's father was born in Puerto Plata, Dominican Republic, where the Anglo-American Lithgow family had lived for several generations. John moved frequently as a child, while his father founded and managed local and college theaters and Shakespeare festivals throughout the Midwest of the United States. Not until he was 16, and his father became head of the McCarter Theater in Princeton New Jersey, did the family settle down. But for John, the theater was still not a career. He won a scholarship to Harvard University, where he finally caught the acting bug (as well as found a wife). Harvard was followed by a Fulbright scholarship to study at the London Academy of Music and Dramatic Art. Returning from London, his rigorous dramatic training stood him in good stead, and a distinguished career on Broadway gave him one Tony Award for \"The Changing Room\", a second nomination in 1985 for \"Requiem For a Heavyweight\", and a third in 1988 for \"M. Butterfly\". But with critical acclaim came personal confusion, and in the mid 1970s, he and his wife divorced. He entered therapy, and in 1982, his life started in a new direction, the movies - he received an Academy Award nomination for his portrayal of Roberta Muldoon in The World According to Garp (1982). A second Oscar nomination followed for Terms of Endearment (1983), and he met a UCLA economics professor who became his second wife. As the decade of the 1990s came around, he found that he was spending too much time on location, and another career move brought him to television in the hugely successful series 3rd Rock from the Sun (1996). This production also played a role in bringing him back together with the son from his first marriage, Ian Lithgow, who has a regular role in the series as a dimwitted student.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzUyNDkzNF5BMl5BanBnXkFtZTcwNTMwNTU5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001475","name":"John Lithgow","nicknames":["Jiggles"],"idIMDB":"nm0001475"},"actorId":"nm0001475","character":"Don Quixote de La Mancha / Alonso Quixano","urlCharacter":"http://www.imdb.com/character/ch0026696","main":true},{"actorName":"Bob Hoskins","urlProfile":"http://www.imdb.com/name/nm0001364","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MTE0ODQyM15BMl5BanBnXkFtZTYwMTIyNTk1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1942","placeOfBirth":" Bury St. Edmunds, Suffolk, England, UK","birthName":"Robert William Hoskins","height":"5' 6\" (1.68 m)","bio":"Bob Hoskins was born on October 26, 1942, in Bury St. Edmund's, Suffolk, where his mother was living after being evacuated as a result of the heavy bombings. He is the son of Elsie Lillian (Hopkins), a nursery school teacher and cook, and Robert William Hoskins, Sr., who drove a lorry and worked as a bookkeeper. Growing up, Hoskins received only limited education and he left school at 15, but with a passion for language and literature instilled by his former English teacher. A regular theatre-goer, Hoskins dreamed of starring on stage, but before he could do so he had to work odd jobs for a long time to make ends meet. His acting career started out more by accident than by design, when he accompanied a friend to watch some auditions, only to be confused for one of the people auditioning, getting a script pushed into his hands with the message \"You're next\". He got the part and acquired an agent. After some stage success, he expanded to television with roles in television series such as Villains (1972) and Thick as Thieves (1974). In the mid-'70s, he started his film career, standing out when he performed alongside Richard Dreyfuss in John Byrum's Inserts (1975) and in a smaller part in Richard Lester's Royal Flash (1975). Hoskins broke through in 1978 in Dennis Potter's mini TV series, Pennies from Heaven (1978), playing \"Arthur Parker\", the doomed salesman. After this, a string of high-profile and successful films followed, starting with his true major movie debut in 1980's The Long Good Friday (1980) as the ultimately doomed \"Harold Shand\". This was followed by such works as The Cotton Club (1984), Mona Lisa (1986), which won him an Oscar nomination as well as a BAFTA award, Cannes Film Festival and Golden Globe), Who Framed Roger Rabbit (1988) (Golden Globe nomination), Mermaids (1990), Hook (1991), Nixon (1995), Le voyage de Felicia (1999) and Enemy at the Gates (2001). Hoskins always carefully balanced the riches of Hollywood with the labor of independent film, though leaned more towards the latter than the former. He worked at smaller projects such as Shane Meadows' debut 24 7: Twenty Four Seven (1997), in which he starred as \"Allen Darcy\". Besides this, he found time to direct, write and star in The Raggedy Rawney (1988), as well as direct and star in Rainbow (1995), and contributing to HBO's Tales from the Crypt (1989) and Tube Tales (1999). Suffering from Parkinson's disease in later years, Hoskins died of pneumonia at age 71 in a London hospital.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MTE0ODQyM15BMl5BanBnXkFtZTYwMTIyNTk1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001364","name":"Bob Hoskins","nicknames":["The Cockney Cagney"],"idIMDB":"nm0001364"},"actorId":"nm0001364","character":"Sancho Panza","urlCharacter":"http://www.imdb.com/character/ch0026697","main":true},{"actorName":"Isabella Rossellini","urlProfile":"http://www.imdb.com/name/nm0000618","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg0MjczMzg2NV5BMl5BanBnXkFtZTcwOTM1MjA1NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 June 1952","placeOfBirth":" Rome, Lazio, Italy","birthName":"Isabella Fiorella Elettra Giovanna Rossellini","height":"5' 8\" (1.73 m)","bio":"Isabella Rossellini, the Italian actress and model who has made her home in America since 1979 and holds dual Italian and American citizenship, was born cinema royalty when she made her debut on June 18, 1952 in Rome. She is the daughter of two legends, three-time Oscar-winning Swedish-born actress Ingrid Bergman and neo-realist master Italian director Roberto Rossellini. She was also the third wife of Oscar-winning director Martin Scorsese from 1979 to 1982 and the partner of legendary director David Lynch. She made her movie debut in Vincente Minnelli's Nina (1976), which starred her mother. She then made a couple of Italian pictures and worked as an American correspondent for Italian television network RAI before appearing in Taylor Hackford's Cold War drama White Nights (1985) in 1985. She followed that up with her most memorable role, as the abused chanteuse in Lynch's masterpiece Blue Velvet (1986), she earned an Independent Spirit Award for Best Female Lead. She then went on to win a Saturn Award for Best Supporting Actress, for her performance as Lisle, the mysterious socialite, forever in her youth in Death Becomes Her (1992). In 1997, she was nominated for an Emmy Award as Outstanding Guest Actress in a Drama Series for a guest appearance on Chicago Hope (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg0MjczMzg2NV5BMl5BanBnXkFtZTcwOTM1MjA1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000618","name":"Isabella Rossellini","idIMDB":"nm0000618"},"actorId":"nm0000618","character":"The Duchess","urlCharacter":"http://www.imdb.com/character/ch0042481","main":true},{"actorName":"Vanessa Williams","urlProfile":"http://www.imdb.com/name/nm0001853","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2OTI0NTQ4MV5BMl5BanBnXkFtZTcwODUyMjM2MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 March 1963","placeOfBirth":" Tarrytown, New York, USA","birthName":"Vanessa Lynn Williams","height":"5' 6\" (1.68 m)","bio":"Vanessa Lynn Williams was born in Millwood, New York, to Helen L. (Tinch) and Milton Augustine Williams, Jr., both music teachers. Vanessa and her brother grew up in suburban New York in comfortable surroundings. Vanessa sang and danced in school productions and signed her high school yearbook with a promise to \"see you on Broadway\". After winning a performing scholarship to Syracuse University, she left school and tried to make it in New York show business. She began entering beauty contests in 1984, eventually winning Miss New York and then becoming the first African-American Miss America. During her reign, some nude girl-girl photos, taken while she was in New York, surfaced in Penthouse magazine. Although the photos were taken before her beauty contest victories, she was forced to resign her crown. Many predicted that her future in show business was over. She went on to land a recording contract and released several albums, including \"The Comfort Zone\" and \"The Sweetest Days\". Vanessa made her film debut in 1986 in Under the Gun (1988) and appeared in the films The Pick-up Artist (1987), Another You (1991) and Harley Davidson and the Marlboro Man (1991). She starred opposite Arnold Schwarzenegger in Eraser (1996), opposite Laurence Fishburne and Andy Garcia in Hoodlum (1997) and the box office hit, Soul Food (1997). She also starred in Dance with Me (1998), Light It Up (1999), Shaft (2000), opposite Samuel L. Jackson and Johnson Family Vacation (2004). She starred recently in the independent features, My Brother (2006) and And Then Came Love (2007) (aka \"Somebody Like You\"). On television, Vanessa starred in such movies and mini-series as Stompin' at the Savoy (1992), The Kid Who Loved Christmas (1990), The Jacksons: An American Dream (1992), ABC's revival of Bye Bye Birdie (1995), Nothing Lasts Forever (1995), L'odyssée (1997), Don Quixote (2000) and Keep the Faith, Baby (2002), and she executive-produced and starred in Lifetime's The Courage to Love (2000) for Lifetime and the VH1 Original Movie, A Diva's Christmas Carol (2000). Her albums \"The Right Stuff\", \"The Comfort Zone and \"The Sweetest Days\" earned multiple Grammy nominations and have yielded the Academy Award-winning single \"Colors of the Wind\", from Disney's Pocahontas: The Musical Tradition Continues (1995). Her recordings also include two holiday albums, \"Star Bright\" and \"Silver & Gold\", \"Vanessa Williams Greatest Hits: The First Ten Years\" and \"Everlasting Love\", a romantic collection of love songs from the 1970's. In 1994, Vanessa took Broadway by storm when she replaced Chita Rivera in \"Kiss of the Spider Woman\", winning the hearts of critics and becoming a box-office sensation. She garnered rave reviews and was nominated for a Tony Award for the 2002 revival of \"Into the Woods\". She also headlined a limited special engagement of the classic, \"Carmen Jones\", at the Kennedy Center and starred in the Encore! Series staged concert production of \"St. Louis Woman\". She stars in ABC's critically-acclaimed hit series, Ugly Betty (2006), for which she has won or been nominated for numerous individual and ensemble awards, including the Emmy, SAG Award, Golden Globe and NAACP Image Awards. Vanessa achieved a career pinnacle, with a star on the Hollywood Walk of Fame for her accomplishments as a performer. Her charitable endeavors are many and varied, embracing and supporting such organizations as Special Olympics and many others.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2OTI0NTQ4MV5BMl5BanBnXkFtZTcwODUyMjM2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001853","name":"Vanessa Williams","nicknames":["Van","Ness","V"],"idIMDB":"nm0001853"},"actorId":"nm0001853","character":"Dulcinea / Aldonza","urlCharacter":"http://www.imdb.com/character/ch0039660","main":true},{"actorName":"Lambert Wilson","urlProfile":"http://www.imdb.com/name/nm0933727","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMTQ5NTg5Ml5BMl5BanBnXkFtZTgwOTQ5MTA3MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 August 1958","placeOfBirth":" Neuilly-sur-Seine, Hauts-de-Seine, France","height":"6' 2\" (1.88 m)","bio":"Lambert Wilson was born in Paris and studied acting at the Drama Centre in London. A fluent English speaker, he made his feature film debut at the age of twenty-two in Fred Zinnemann's Five Days One Summer (1981) starring opposite Sean Connery. He went on to work with many of France's most prestigious auteur directors, playing leads in Andrzej Zulawski's La Femme Publique, (1983), Véra Belmont's Rouge Baiser (1984), André Téchiné's Rendez-vous, (Official Selection at Cannes and winner of the Best Director Award, 1984), Luigi Comencini's La Storia (1985), Claude Chabrol's Le Sang des Autres (1987), Philippe de Broca's Chouans (1987) and Peter Greenaway's The Belly of an Architect (1987). He starred in his actor/director father Georges Wilson's feature film debut, La Vouivre (1988), and won the Jean Gabin Award for his performance in Denis Amar's Winter '54, (1989). Further film work includes James Ivory's Jefferson in Paris (1994) opposite Nick Nolte and Gwyneth Paltrow and John Duigan's The Leading Man, with Thandie Newton and John Bon Jovi (1996). He has made four films with Alain Resnais: Same Old Song (1997), Not on the Lips, 2003, Private Fears in Public Places, (2006) and You Ain't Seen Nothing Yet (2012) and has worked with Jacques Doillon in Trop (peu) d'amour, (1997), Deborah Warner in The Last September, with Maggie Smith, Fiona Shaw, Jane Birkin and Michael Gambon (1998) and starred in Raùl Ruiz's Combat d'amour en songe (2000). His more recent, English language work includes the Wachowski brothers' Matrix Reloaded and Matrix Revolutions (2001), Pitof's Catwoman (2004) with Halle Berry and Sharon Stone, Breck Eisner's Sahara, (2005), Michael Radford's Flawless (2006) with Demi Moore and Michael Caine, and Mathieu Kassovitz's Babylon A.D. (2007) with Vin Diesel and Charlotte Rampling. He has just starred in three international productions, Lulu Wang's Posthumous with Jack Huston and Britt Marling, Victor Levin's 5 to 7 with Anton Yelchin, Glenn Close and Frank Langella, and Suite Française, opposite Michelle Williams, Kristin Scott Thomas and Matthias Shoenaerts, all due for release in 2014. Highlights from his latter French filmography include: Valérie Lemercier's Palais Royal! (2004), Xavier Beauvois' Of Gods and Men, Cannes Official Selection and Winner, Grand Prize of the Jury (2009), Bertrand Tavernier The Princess of Montpensier (2009), Alain Chabat's Le Marsupilami (2011), Philippe Le Guay's Cycling with Moliere (2012). In the summer of 2013, he played the lead in Eric Lavaine's Barbecue, opposite Florence Foresti, Franck Dubosc, Guillaume de Tonquédec, Lionel Abelanski, Jérôme Commandeur, Valérie Crouzet, Sophie Duez et Lysiane Meis (2014). Lambert Wilson is a Chevalier and Officier des Arts et des Lettres and Chevalier and Officier de l'Ordre National du Merite.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMTQ5NTg5Ml5BMl5BanBnXkFtZTgwOTQ5MTA3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0933727","name":"Lambert Wilson","idIMDB":"nm0933727"},"actorId":"nm0933727","character":"Duke","urlCharacter":"http://www.imdb.com/character/ch0151809","main":true},{"actorName":"Amelia Warner","urlProfile":"http://www.imdb.com/name/nm0912396","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxNDQzMjU4NF5BMl5BanBnXkFtZTcwMDM3ODUyMw@@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1982","placeOfBirth":" Liverpool, Merseyside, England, UK","birthName":"Amelia Catherine Bennett","height":"5' 6\" (1.68 m)","bio":"Amelia Warner was born Amelia Catherine Bennett in Liverpool, England, the only child of English actress Annette Ekblom and Welsh actor Alun Lewis. Her uncle is Welsh actor Hywel Bennett. Relocating to London when she was 4 years old, she studied at the Royal Masonic School for Girls, and then (at 16) the College of Fine Arts. However, her schools did not approve of her taking so much time off for her acting work and so was forced to study for a while at a college in Belsize Park. She was \"discovered\" after she and her friends devised and acted out a play in Covent Garden where she was spotted by an agent and won a place at London Royal Court Theatre's Youth program. Warner had a string of television roles in TV dramas such as Casualty (1986) before making it big with Lorna Doone (2000) and the film Quills (2000), which both came out in the winter of 2000.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxNDQzMjU4NF5BMl5BanBnXkFtZTcwMDM3ODUyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0912396","name":"Amelia Warner","nicknames":["Millie"],"idIMDB":"nm0912396"},"actorId":"nm0912396","character":"Antonia","urlCharacter":"http://www.imdb.com/character/ch0151812","main":true},{"actorName":"Tony Haygarth","urlProfile":"http://www.imdb.com/name/nm0371304","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNDAwNzg3M15BMl5BanBnXkFtZTcwODI5NjUzOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1945","placeOfBirth":" Liverpool, England, UK","birthName":"George Anthony Haygarth","bio":"Instantly recognisable, often bearded Liverpudlian character actor who has been regularly featured on stage and screen in period productions, police dramas, sitcoms and soaps during a career spanning five decades. Extremely prolific and versatile, he has taken on just about any type of role, merrily alternating between bellicose, shifty, dependable, bucolic, curmudgeonly or avuncular types. His most prominent headliners have included PC Wilmot in the Yorkshire-based sitcom Rosie (1977) and the titular character of the sci-fi comedy Kinvig (1981) penned by Nigel Kneale. Occasional scene-stealing turns in support have included the deliriously mad Milo Renfield in Dracula (1979). Among innumerable other worthy supporting roles a list of standouts might comprise Gridley, the ruined chancery appellant in Bleak House (2005) ; Vic Snow in Where the Heart Is (1997) ; nouveau-riche timber merchant Melbury in The Woodlanders (1997) and the slightly seedy consular chauffeur Fidel Sanchez in Farrington of the F.O. (1986). He also voiced the slow-witted, mercilessly hen-pecked antagonist Mr. Tweedy in Aardman's animated feature Chicken Run (2000). Before claimed by the stage, Haygarth had briefly tried his luck at other fields of endeavour, including as a Torquay lifeguard and as a psychiatric nurse at Sefton Hospital in Liverpool. Having found his chosen vocation in repertory theatre he went from there to more distinguished roles with the Royal Shakespeare Company, the Old Vic and the National Theatre. He won the Clarence Derwent Award in 1996 for his part in the play \"Simpatico\" and in 2003 appeared with Zoë Wanamaker in \"His Girl Friday\" and alongside Kenneth Branagh in \"Edmond\". Starting in 2007, he appeared as Alfred Doolittle in Peter Hall's production of \"Pygmalion\", a performance described by the reviewer of The Telegraph as \"delightfully funny\" and \"scene-stealing\". Haygarth also sidelined as an author of plays and wrote a book of poetry entitled \"God wore Clogs\". In 2014, he was diagnosed with Alzheimer's disease and vascular dementia which sadly claimed his life three years later at the age of 72.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNDAwNzg3M15BMl5BanBnXkFtZTcwODI5NjUzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0371304","name":"Tony Haygarth","idIMDB":"nm0371304"},"actorId":"nm0371304","character":"Barber","urlCharacter":"http://www.imdb.com/character/ch0151811","main":true},{"actorName":"Peter Eyre","urlProfile":"http://www.imdb.com/name/nm0264235","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2ODExMjAwNV5BMl5BanBnXkFtZTgwNDE3NzUyMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 March 1942","placeOfBirth":" New York City, New York, USA","bio":"Peter Eyre was born on March 11, 1942 in New York City, New York, USA. He is an actor, known for From Hell (2001), Dragonslayer (1981) and The Remains of the Day (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2ODExMjAwNV5BMl5BanBnXkFtZTgwNDE3NzUyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0264235","name":"Peter Eyre","idIMDB":"nm0264235"},"actorId":"nm0264235","character":"Priest","urlCharacter":"http://www.imdb.com/character/ch0151807","main":true},{"actorName":"Lilo Baur","urlProfile":"http://www.imdb.com/name/nm0062430","urlPhoto":"","biography":{"dateOfBirth":"1958","placeOfBirth":" Switzerland","bio":"Lilo Baur was born in 1958 in Switzerland. She is an actress, known for Hell (2011), Bridget Jones: The Edge of Reason (2004) and The Devil's Arithmetic (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0062430","name":"Lilo Baur","idIMDB":"nm0062430"},"actorId":"nm0062430","character":"Teresa Panza","urlCharacter":"http://www.imdb.com/character/ch0151815","main":true},{"actorName":"James Purefoy","urlProfile":"http://www.imdb.com/name/nm0700856","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMTE1NTk1OF5BMl5BanBnXkFtZTYwOTE3OTI1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 June 1964","placeOfBirth":" Taunton, Somerset, England, UK","birthName":"James Brian Mark Purefoy","height":"6' 1\" (1.85 m)","bio":"James Brian Mark Purefoy was born and brought up in Taunton, Somerset, England, the son of Shirley (Taylor), who ran an employment agency, and Anthony Chetwynd Purefoy. After leaving school at the age of sixteen, he took a succession of different jobs, including working on a pig farm and as a porter at Yeovil District Hospital, before travelling and working extensively throughout Europe. At eighteen, James returned to college to take his A-Levels, one of which was Drama. It was there that he realised that this was something he felt inspired by and so applied for and was accepted onto the acting course at the Central School of Speech and Drama. Whilst playing the title role in \"Henry V\" in the first term of his final year at Central, he was seen by a casting director from the RSC and invited to join the company, immediately, in Stratford. Although initially asked only to play \"Ferdinand\" in Nicholas Hytner's production of \"The Tempest\", he left the RSC two years later having performed in eight productions and been directed by the likes of Adrian Noble, Roger Michell and Gene Saks playing, amongst other, \"Edgar\" in \"King Lear\" and \"Malcolm\" in \"Macbeth\". Over the next six years, he divided his time between theatre and television. In the theatre, he worked with Katie Mitchell on \"Women of Troy\" at the Gate; Matthew Warchus, Ken Stott and Jude Law on \"Death of a Salesman\" at the West Yorkshire Playhouse; Iain Glen on \"Hamlet\" at Bristol Old Vic; Bill Alexander in a critically-acclaimed season at Birmingham Rep, playing leading parts in \"The Servant\", \"The Way of the World\" and \"Macbeth\"; and with Simon Callow, Joseph Fiennes, Rupert Graves, and Helen McCrory, on \"Les Enfants du Paradis\", again for the RSC. As well as appearing in the BBC's landmark period drama, The Tenant of Wildfell Hall (1996), he has always chosen to do a wide variety of parts on television, to avoid being typecast. From the psychopathic rapist in BBC1's Calling the Shots (1993) with Lynn Redgrave to the fraudster \"Darius Guppy\" in LWT's \"The Prince\"; from the urbane observer \"Nick Jenkins\" in Channel 4's A Dance to the Music of Time (1997) to the sad stalker in Granada's series, Metropolis (2000), James has always managed to confound people's expectations of him. Over the last few years, he has been busy making feature films, on average at the rate of three a year. Early credits include \"Jedd Wainwright\" in Feast of July (1995) for \"Merchant Ivory\", and as the bisexual Irish baker, \"Brendan\" in Rose Troche's Bedrooms and Hallways (1998). From the alcoholic roustabout \"Tom Bertram\" in Mansfield Park (1999) to the wannabee \"Bond\" actor \"Carl Phipps\" in Maybe Baby (2000); the gambling, womanising \"Daniel\" in Women Talking Dirty (1999) with Helena Bonham Carter to the noble, enigmatic \"Prince Edward\" in Brian Helgeland's A Knight's Tale (2001). He has continued to surprise those who seek to pidgeon-hole him in his film career - always choosing to play parts that juxtapose strongly with the one he has just completed. Last year, he returned to the theatre to play the rake \"Ned Loveless\" in Trevor Nunn's acclaimed production of \"The Relapse\" at the National Theatre in London, before embarking on the biggest challenge he has yet faced - playing \"George\" in the big budget George and the Dragon (2004), with, among others, Michael Clarke Duncan, Val Kilmer, Piper Perabo and Patrick Swayze. This movie will be released in the summer of 2003. He lives alone in London.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMTE1NTk1OF5BMl5BanBnXkFtZTYwOTE3OTI1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0700856","name":"James Purefoy","idIMDB":"nm0700856"},"actorId":"nm0700856","character":"Sansón Carrasco","urlCharacter":"http://www.imdb.com/character/ch0028913","main":true},{"actorName":"Trevor Peacock","urlProfile":"http://www.imdb.com/name/nm0668807","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODkxMDQ0M15BMl5BanBnXkFtZTcwMzczMjUxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 May 1931","placeOfBirth":" Edmonton, London, England, UK","birthName":"Trevor Edward Peacock","bio":"Trevor Peacock was born on May 19, 1931 in Edmonton, London, England as Trevor Edward Peacock. He is an actor and writer, known for Six-Five Special (1957), Fred Claus (2007) and Quartet (2012). He is married to Tilly Tremayne. He was previously married to Iris Jones.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODkxMDQ0M15BMl5BanBnXkFtZTcwMzczMjUxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0668807","name":"Trevor Peacock","idIMDB":"nm0668807"},"actorId":"nm0668807","character":"Innkeeper","urlCharacter":"http://www.imdb.com/character/ch0151817","main":true},{"actorName":"Linda Bassett","urlProfile":"http://www.imdb.com/name/nm0060221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMzQ2ODkzMF5BMl5BanBnXkFtZTcwNjM1Mzk5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1950","placeOfBirth":" Pluckley, Kent, England, UK","bio":"Linda Bassett was born in the Kentish village of Pluckley - location for the television series The Darling Buds of May (1991). She was brought up in Pimlico, South London, by her typist mother and police officer father. She became interested in acting as a child when she was frequently taken to see plays in London, most notably at the Old Vic, the famous classical theater. On leaving school, Linda went to work at the Old Vic as an usherette and catering manager, before going to read English at Leeds University. However, she dropped out after a year and became involved in a local drama group which put on plays in community-based locations, such as schools. She regards this as her theatrical schooling, having had no formal training. She made her London stage debut at the age of thirty-two in 1982 and, in 1991, she joined the Royal Shakespeare Company. Although she was a well-regarded stage performer, it was the 1999 film version of the play East Is East (1999) (in which she had been an original stage cast member) which brought her to a larger audience and, throughout the 2000s, she has been a familiar face in a variety of films and television series. In the late 1980s, she returned to live in Pluckley.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMzQ2ODkzMF5BMl5BanBnXkFtZTcwNjM1Mzk5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0060221","name":"Linda Bassett","idIMDB":"nm0060221"},"actorId":"nm0060221","character":"Housekeeper","urlCharacter":"http://www.imdb.com/character/ch0151819","main":true},{"actorName":"Barry Stanton","urlProfile":"http://www.imdb.com/name/nm0822719","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4ODA1Mzk1Ml5BMl5BanBnXkFtZTgwNDQ5OTUyMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1940","placeOfBirth":"","bio":"Barry Stanton was born in 1940. He is an actor, known for Shanghai Knights (2003), The Madness of King George (1994) and A Kid in King Arthur's Court (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4ODA1Mzk1Ml5BMl5BanBnXkFtZTgwNDQ5OTUyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0822719","name":"Barry Stanton","idIMDB":"nm0822719"},"actorId":"nm0822719","character":"Chaplain - at the Duke's Feast","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alun Raglan","urlProfile":"http://www.imdb.com/name/nm0706511","urlPhoto":"","biography":{"height":"6' 4\" (1.93 m)","bio":"Alun Raglan was born in Wales. He is an actor, known for Gladiator (2000), Attila (2001) and Don Quixote (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0706511","name":"Alun Raglan","idIMDB":"nm0706511"},"actorId":"nm0706511","character":"Rodriguez","urlCharacter":"http://www.imdb.com/character/ch0151808","main":true},{"actorName":"Michael Feast","urlProfile":"http://www.imdb.com/name/nm0269923","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMTU5ODY0OF5BMl5BanBnXkFtZTcwNzg3NDAxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 November 1946","placeOfBirth":" Brighton, England, UK","bio":"Michael Feast was born on November 25, 1946 in Brighton, England. He is an actor and composer, known for Sleepy Hollow (1999), Penelope (2006) and Velvet Goldmine (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMTU5ODY0OF5BMl5BanBnXkFtZTcwNzg3NDAxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0269923","name":"Michael Feast","idIMDB":"nm0269923"},"actorId":"nm0269923","character":"Doctor","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0181212","urlIMDB":"http://www.imdb.com/title/tt0181212","business":{"budget":{"money":"$18,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"© 1999 Hallmark Entertainment Productions, LLC"},"technical":{"runtime":["2 hr (120 min)","2 hr 11 min (131 min) (3 parts) (Finland)"],"soundMix":["Dolby SR"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":["Technicolor, UK (processing)"],"filmLength":null,"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.2","filmingLocations":[{"location":"Andalucía, Spain"}],"awards":[{"award":"Primetime Emmy Awards 2000","titlesAwards":[{"titleAwardOutcome":"Nominated Primetime Emmy","categories":[{"category":"Outstanding Costumes for a Miniseries, Movie or a Special","names":[{"name":"Charles Knode","id":"nm0461262","role":"costume designer"},{"name":"Robert Worley","id":"nm0941512","role":"assistant costume designer"},{"name":"Graham Churchyard","id":"nm0161495","role":"costume supervisor"}]},{"category":"Outstanding Makeup for a Miniseries, Movie or a Special","names":[{"name":"Anne Spiers","id":"nm0818636","role":"chief makeup artist"},{"name":"Gillian Thomas","id":"nm0858878","role":null},{"name":"Mauro Meniconi","id":"nm0578797","role":null}]},{"category":"Outstanding Music Composition for a Miniseries, Movie or a Special","names":[{"name":"Richard Hartley","id":"nm0366880","role":null}]}]}]},{"award":"Screen Actors Guild Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated Actor","categories":[{"category":"Outstanding Performance by a Male Actor in a Television Movie or Miniseries","names":[{"name":"John Lithgow","id":"nm0001475","role":null}]}]}]}],"votes":"1,352","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0069955","name":"Hallmark Entertainment"}],"keywords":{"keywords":["sancho panza","don quixote","wine spatter","foreign language adaptation","gentleman","satire","based on novel","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:21:59"}}