{"data":{"movies":[{"title":"So This Is Romance?","originalTitle":"","year":"1997","releaseDate":"19980522","directors":[{"name":"Kevin W. Smith","id":"nm0808981"}],"writers":[{"name":"Kevin W. Smith","id":"nm0808981"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MTY1NDAwNF5BMl5BanBnXkFtZTcwOTgzMjAyMQ@@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"The story of a broke but talented composer, Mike, and his search for true love. The question is, how to find it, especially when your insecurities tends to make you jealous even when a girlfriend strokes your cat. Mike's alcoholic writer father who believes all his ills will be cured by finding his runaway wife, tells him there is only one thing that makes life worth living: \"the empress\"; perfect sex that goes on for days with a woman so beautiful you could cry. To Mike, however, the empress is love that lasts forever, not sex that lasts for days.","simplePlot":"The story of a broke but talented composer, Mike, and his search for true love. The question is, how to find it, especially when your insecurities tends to make you jealous even when a ... ","actors":[{"actorName":"Reece Dinsdale","urlProfile":"http://www.imdb.com/name/nm0227827","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMjQ0MTAzOV5BMl5BanBnXkFtZTgwMTc1NTM0MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1959","placeOfBirth":" Normanton, Yorkshire, England, UK","height":"5' 10\" (1.78 m)","bio":"Dinsdale was born in Normanton West Yorkshire, England in 1959. He trained at the Guildhall School of Music and Drama in the late seventies and early eighties. This eventually led to him being cast as Albert in the Partners in Crime (1983) series, making his first appearance in the episode The Secret Adversary (1983) in 1982. He continued in that role for two years. In 1984 director Mick Jackson writer Barry Hines cast him in their powerful nuclear war docudrama Threads (1984), as Jimmy Kemp, a soon to be father and husband to Karen Meagher's Ruth Beckett, who is killed when a nuclear bomb explodes over Sheffield, England. Interestingly that same year Dinsdale also starred in the Cold War drama Winter Flight (1984), in which he played a shy, introverted RAF man who falls in love with a feisty barmaid. Also in 1984 Dinsdale appeared in his first feature, the Maggie Smith comedy, A Private Function (1984). His largest role to date, however, came in 1985 as Matthew Willows when he co-starred with John Thaw in the British sitcom Home to Roost (1985). Dinsdale played Thaws unruly teen-aged son Matthew who comes to live with his estranged father after his mother put him out of the house. The core of the shows comedy came from constant clashing between Henry Willows (Thaw's character), who resented his son for imposing on his bachelor solitude, and Matthew adolescent antics which clashed with his father's conservatism. The show ran for five series between 1985 and 1990. Dinsdale co-starred in many other British television shows and mini series in the nineties. From 1990-1992 he co-starred in Haggard (1990), a comedy set in the late 1700s. In 1995 he starred in the mini-series Screen Two: Bliss (1995), and more recently he has co-starred in the British series Born and Bred (2002), The Chase (2006), and Dalziel and Pascoe (1996). Film roles have included 1995's _ID_, 1996's _Hamlet_, in which he played Guilderstern alongside Kenneth Branagh as Hamlet, and 1998's _So This Is Romance_. Privately Dinsdale resides with his wife, British actress Zara Turner, in Yorkshire, England. The couple have two children, a daughter Elwy, and a son Luca. Dinsdale is also a great supporter of Huddersfield Town Football Club. He presented the video 'Beyond the Touchline' that went behind the scenes at Huddersfield's former Leeds Road ground.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMjQ0MTAzOV5BMl5BanBnXkFtZTgwMTc1NTM0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0227827","name":"Reece Dinsdale","idIMDB":"nm0227827"},"actorId":"nm0227827","character":"Mike","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victoria Smurfit","urlProfile":"http://www.imdb.com/name/nm0810729","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMTg3NTIyMV5BMl5BanBnXkFtZTgwMjc3NTAxNjE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 March 1974","placeOfBirth":" Dublin, Ireland","height":"5' 8\" (1.73 m)","bio":"Victoria Smurfit was born on March 31, 1974 in Dublin, Ireland. She is an actress and producer, known for The Beach (2000), Bulletproof Monk (2003) and About a Boy (2002). She was previously married to Douglas Baxter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMTg3NTIyMV5BMl5BanBnXkFtZTgwMjc3NTAxNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0810729","name":"Victoria Smurfit","idIMDB":"nm0810729"},"actorId":"nm0810729","character":"Helen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clara Bellar","urlProfile":"http://www.imdb.com/name/nm0068755","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2JiYTI2YzItOTQyZC00M2MyLWJjZTItZTAxOWEzNmE1N2M0XkEyXkFqcGdeQXVyNTAzNTIyODI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1972","placeOfBirth":" Paris, France","bio":"Clara Bellar was born and raised in Paris, France. Other than French, she speaks English, German, Spanish, Italian, and Portuguese. Clara is a stage actress who came to the attention of French film director Eric Rohmer during her performance in Sleeping Beauty. This lead to a collaboration between Bellar and Rohmer in their co-writing of a film, Rendezvous in Paris. The film was based upon Clara's own life experiences. Rohmer cast her as the lead actress in his film. This led to her future roles in the films, Oranges Ameres, Romance and Rejection, and This Space Between Us, Sleepy Time Gal and David. As a stage actress, Clara produced and starred in A Flea In Her Ear at the Stages Theater Center in Hollywood. This play received the notable aware of the 2001 Ovation AWard for Best Translation and Adaptation and being named one of the Ten Best Productions of the Year in the Daily News. Acting in theater since 1989 her theater work also includes, Le Kabaret de la Derni re Chance; La Belle au Bois Dormant; Le Triangle de Cristal; Preparadise Sorry Now; L'Herbe Amore; in France and No Exit in England. A joint US/Brazilian production of Clowns Mudos was performed in Santa Monica, California. Her 2004 dual starring role as Shen Te, a prostitute and Shui Ta, her male cousin, set in 1920s China was performed in Venice, California. A singer, Bellar recorded an album in Portuguese, Meu Coração Brasileiro, in Rio de Janeiro, Brazil.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2JiYTI2YzItOTQyZC00M2MyLWJjZTItZTAxOWEzNmE1N2M0XkEyXkFqcGdeQXVyNTAzNTIyODI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0068755","name":"Clara Bellar","idIMDB":"nm0068755"},"actorId":"nm0068755","character":"Sarah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Hannah","urlProfile":"http://www.imdb.com/name/nm0001314","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4Nzk0NjA5OV5BMl5BanBnXkFtZTcwNjM2NDA4MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 April 1962","placeOfBirth":" East Kilbride, Scotland, UK","birthName":"John David Hannah","height":"5' 10\" (1.78 m)","bio":"John Hannah is the youngest child of his family, having two older sisters. Before he decided on a career as an actor, John was an apprentice electrician for four years. He gave up his work as an electrician after being accepted to the Royal Scottish Academy of Music and Drama in Glasgow. After years of struggling, he finally got his 'big break' when he was cast as Matthew in Four Weddings and a Funeral (1994). He currently lives in London with his wife Joanna Roth and their two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4Nzk0NjA5OV5BMl5BanBnXkFtZTcwNjM2NDA4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001314","name":"John Hannah","idIMDB":"nm0001314"},"actorId":"nm0001314","character":"Tony","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Finlay","urlProfile":"http://www.imdb.com/name/nm0277975","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MTc1MzExOV5BMl5BanBnXkFtZTcwNDI5MDkwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1926","placeOfBirth":" Farnworth, Lancashire, England, UK","birthName":"Francis Finlay","height":"5' 8\" (1.73 m)","bio":"One of Britain's finest products of the stage, film and TV, actor Frank Finlay, he with the dark and handsomely serious-to-mordant looks, was born on August 6, 1926, in Farnworth, England, the son of Josiah, a butcher, and Margaret Finlay. Of English, Irish and Scottish descent, Frank attended St. Gregory the Great School and then was actually training to follow in his father's footsteps as a butcher himself when his side interest in acting eventually won out. He became a member of the Farnworth Little Theatre and met his future wife, Doreen Shepherd, a fellow member at the same time. They married in 1954, had three children (two sons, one daughter) and were married for over 50 years until her death in 2005. Finlay began his professional career on the repertory stage with roles in The Guilford Theatre Company's 1957 productions of \"Jessica\" and \"The Telescope\". Graduating from the Royal Academy of Dramatic Art (RADA), he built up a strong and sturdy theatrical reputation at the Royal Court Theatre between 1958 and 1960 where he was seen to good advantage in such plays as \"Chicken Soup and Barley\", \"Sugar in the Morning\", \"Sergeant Musgrave's Dance\", \"Roots\", \"I'm Talking About Jerusalem\", \"The Happy Haven\" and \"Platonov\". Making his Broadway debut in \"The Epitaph of George Dillon\" in 1959, he also sparked a noteworthy professional association with Laurence Olivier at the National Theatre, the highlight being his intense but subtle portrayal of \"Iago\" to Olivier's \"Othello\" in 1964. Marking his film debut in a bit role in The Loneliness of the Long Distance Runner (1962), Finlay sandwiched in a steady stream of British film parts (including Private Potter (1962), Doctor in Distress (1963), Agent 8 3/4 (1964), The Comedy Man (1964), A Study in Terror (1965) (as \"Jack the Ripper\" Inspector Lestrade), The Jokers (1967), The Deadly Bees (1966) and Robbery (1967)) in between theatre assignments. His greatest film opportunity occurred when he was given the right by Olivier to recreate his Iago role opposite the legendary actor in the masterful film adaptation of Othello (1965). Finlay, Maggie Smith (as \"Desdemona\") and Joyce Redman (as \"Emilia\") all received Oscar and Golden Globe nominations for their illustrious \"supporting\" work of Olivier (who was also Oscar nominated). Frank went on to nab a \"Most Promising Newcomer\" nomination from the BAFTA committee as well. To date, this has been the actor's only Oscar recognition. Frank's film output, aside from his dashing role as \"Porthos\" for director Richard Lester in the ripe Dumas adaptation of The Three Musketeers (1973) (and its sequels The Four Musketeers: Milady's Revenge (1974) and The Return of the Musketeers (1989)), has been at an international level. Films include The Shoes of the Fisherman (1968), Cromwell (1970), The Molly Maguires (1970), Shaft in Africa (1973), The Wild Geese (1978), Murder by Decree (1979) (again as \"Inspector Lestrade\"), The Return of the Soldier (1982), La clef (1983) [The Key], Lifeforce (1985), Mountain of Diamonds (1991), So This Is Romance? (1997), Silent Cry (2002) and, most notably, the Oscar-winning WWII picture The Pianist (2002), directed by Roman Polanski, in which he portrayed the patriarch of a displaced Jewish family that included \"Best Actor\" son Adrien Brody. Classical television notice came in middle age with Frank's strong performances as \"Jean Valjean\" in the British TV mini-series \"Les Miserables\" (1967) and the title role in Casanova (1971). He also went on to win stellar praise and a BAFTA award for his chilling portrayal of \"Adolf Hitler\" in ITV Sunday Night Theatre: The Death of Adolf Hitler (1973). Finlay and Susan Penhaligon courted controversy in the drama series Bouquet of Barbed Wire (1976) and were reunited in further controversy the following year with its follow-up Another Bouquet (1977). More plentiful and prestigious BBC-TV work came with his roles as Shakespeare's \"Brutus\" and \"Shylock\", not to mention his award-winning performances as \"Voltaire\" and \"Sancho Panza\". In Count Dracula (1977), Finlay played \"Van Helsing\" to nemesis Louis Jourdan's velvety-voiced vampire; in A Christmas Carol (1984), he was the dour, shackled \"Jacob Marley\", who pays a ghostly visit to George C. Scott's crusty \"Ebenezer Scrooge\"; and in Eroica (2003), he portrayed composer \"Franz Josef Haydn\" alongside Ian Hart's \"Beethoven\". Most recently, Frank has been appearing in the mini-series Four Seasons (2008). Throughout his prolific career on TV and film, Frank has maintained on the stage given sterling performances in \"Much Ado About Nothing (as \"Dogberry\"), \"The Crucible\", \"Saturday Sunday Monday\", \"Filumena\", \"Amadeus\" (a most affecting Salieri), \"Mutiny\" (as \"Captain Bligh\"), \"Beyond Reasonable Doubt\" and as the rigid father in the 1992 period production of \"The Heiress\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MTc1MzExOV5BMl5BanBnXkFtZTcwNDI5MDkwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0277975","name":"Frank Finlay","idIMDB":"nm0277975"},"actorId":"nm0277975","character":"Mike's Dad","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Susannah York","urlProfile":"http://www.imdb.com/name/nm0948772","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NzIyMjAxN15BMl5BanBnXkFtZTcwMTU5NjQzNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 January 1939","placeOfBirth":" Chelsea, London, England, UK","birthName":"Susannah Yolande Fletcher","height":"5' 6½\" (1.69 m)","bio":"The lovely Susannah York, a gamin, blue-eyed, cropped blonde British actress, displayed a certain crossover star quality when she dared upon the Hollywood scene in the early 1960s. A purposefully intriguing, enigmatic and noticeably uninhibited talent, she was born Susannah Yolande Fletcher on January 9, 1939 in Chelsea, London, but raised in a remote village in Scotland. Her parents divorced when she was around 6. Attending Marr College, she trained for acting at London's Royal Academy of Dramatic Art, winning the Ronson Award for most promising student. She then performed classical repertory and pantomime in her early professional career. Making an impression on television in 1959 opposite Sean Connery in a production of \"The Crucible\" as Abigail Williams to his John Proctor, the moon-faced beauty progressed immediately to ingénue film roles, making her debut as the daughter of Alec Guinness in the classic war drama Tunes of Glory (1960). She emerged quickly as a worthy co-star with the sensitively handled coming-of age drama Loss of Innocence (1961), the more complex psychodrama Freud (1962), as a patient to Montgomery Clift's famed psychoanalyst, and the bawdy and robust 18th century tale Tom Jones (1963), with Susannah portraying the brazenly seductive Sophie, one of many damsels lusting after the bed-hopping title rogue Albert Finney. Susannah continued famously both here and in England in both contemporary and period drama opposite the likes of Warren Beatty, William Holden, Paul Scofield and Dirk Bogarde. Susannah was a new breed. Free-spirited and unreserved, she had no trouble at all courting controversy in some of the film roles she went on to play. She gained special notoriety as the child-like Alice in her stark, nude clinches with severe-looking executive Coral Browne in the lesbian drama The Killing of Sister George (1968). A few years later, she and Elizabeth Taylor traveled similar territory with X, Y and Zee (1972). Acting award ceremonies also began favoring her presence, winning the BAFTA film award as well as Oscar and Golden Globe nominations for her delusional Jean Harlow-like dance marathon participant in the grueling Depression-era film They Shoot Horses, Don't They? (1969). Her crazy scene in the shower with Oscar-winner Gig Young was particularly gripping and just one of many highlights in the acclaimed film. She also copped a Cannes Film Festival award for her performance in Images (1972) playing another troubled character barely coping with reality. On television, she was Emmy-nominated for her beautifully nuanced Jane Eyre (1970) opposite George C. Scott's Rochester. Susannah's film career started to lose ground into the 1970s as she continued her pursuit of challengingly offbeat roles as opposed to popular mainstream work. The film adaptations of Kurt Vonnegut Jr.'s Happy Birthday, Wanda June (1971) opposite Rod Steiger and Jean Genet's The Maids (1975) with Glenda Jackson were not well-received. Her performances in such films as Gold (1974), Conduct Unbecoming (1975) which starred another famous York (Michael York), That Lucky Touch (1975), Sky Riders (1976) and The Shout (1978) were overlooked, as were the films themselves. In the one highly popular movie series she appeared in, the box-office smashes Superman (1978) and its sequel Superman II (1980), she had literally nothing to do as Lara, the wife of Marlon Brando's Jor-El and birth mother of the superhero. While the actress continued to pour out a number of quality work assignments in films and television, she failed to recapture the glow of earlier star. Wisely, Susannah began extending her talents outside the realm of film acting. Marrying writer Michael Wells in 1960, she focused on her personal life, raising their two children for a time. The couple divorced in 1980. In the 1970s, she wrote the children's books \"In Search of Unicorns\" and \"Lark's Castle\". She also found time to direct on stage and wrote the screenplay to one of her film vehicles Falling in Love Again (1980). On stage Susannah performed in such one-woman shows as \"Independent State\", 'Picasso's Women\", \"The Human Voice\" and \"The Loves of Shakespeare's Women\", while entertaining such wide and varied theatre challenges as \"Peter Pan\" (title role), \"Hamlet\" (as Gertrude), \"Camino Real\", \"The Merry Wives of Windsor\", \"A Streetcar Named Desire\", \"Private Lives\", \"Agnes of God\" and the title role in \"Amy's View\". At age 67, Susannah showed up once again on film with a delightful cameo role in The Gigolos (2006), and seemed ripe for a major comeback, perhaps in a similar vein to the legendary Judi Dench, Maggie Smith and Helen Mirren. Sadly, it was not to be. Diagnosed with bone marrow cancer, the actress died in January 15, 2011, six days after her 72nd birthday. Her final films, Dark World (2008) and The Calling (2009), proved that she still possessed the magnetism of her earlier years.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NzIyMjAxN15BMl5BanBnXkFtZTcwMTU5NjQzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0948772","name":"Susannah York","idIMDB":"nm0948772"},"actorId":"nm0948772","character":"Mike's Mum","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rowena King","urlProfile":"http://www.imdb.com/name/nm0455242","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyOTk3MDE5N15BMl5BanBnXkFtZTgwMzI3MTkzOTE@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"December1970","placeOfBirth":" London, England, UK","bio":"Rowena King was born in December 1970 in London, England. She is an actress, known for The Bucket List (2007), Hamlet (1996) and Proof of Life (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyOTk3MDE5N15BMl5BanBnXkFtZTgwMzI3MTkzOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0455242","name":"Rowena King","idIMDB":"nm0455242"},"actorId":"nm0455242","character":"Moira","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maryam d'Abo","urlProfile":"http://www.imdb.com/name/nm0001881","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTgzNjYzNV5BMl5BanBnXkFtZTcwNDA3NDk0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 December 1960","placeOfBirth":" London, England, UK","height":"5' 6½\" (1.69 m)","bio":"Born in London, England and raised in European cities such as Paris and Geneva, Maryam d'Abo has rewarded audiences with her beauty and presence for over twenty years. Maryam first appeared in Xtro (1982), a gory horror film that is considered a cult entry in the genre. She appeared consistently throughout the mid-1980s in a variety of films, including two mini-series based on novels of author Sidney Sheldon: Master of the Game (1984) and If Tomorrow Comes (1986). She accepted \"Laughter in the Dark\" based on the Vladimir Nabokov novel. Her co-stars were Maximilian Schell and Mick Jagger. She thought it would be her big break, since it was a very challenging role, and she was in every scene. But financing fell through, and the film was never completed. The stress made her lose weight, and she appeared more mature. Which turned out to be just the right look for a classical cellist in her next film. Thus, her real big break came in the form of the James Bond film, The Living Daylights (1987). Maryam played Bond girl \"Kara Milovy\" opposite Timothy Dalton's \"James Bond\". The film gave her career a real jolt, and she found herself in leading roles throughout the early 1990s, in a variety of films. She based herself in both England and the USA, appearing in Shootfighter: Fight to the Death (1993) and the European horror movie Immortal Sins (1991). She played her hand in the erotic thriller genre, appearing in Tomcat: Dangerous Desires (1993), Tropical Heat (1993) and an episode of 'Red Shoe Diaries', featured on the video _Red Shoe Diaries 3: Another Woman's Lipstick (1993)(V)_. She starred in more films throughout the mid-1990s, opposite the late Margaux Hemingway in Double Obsession (1992), a remake: The Browning Version (1994), a romantic comedy called Solitaire for 2 (1995), and thrillers such as Timelock (1996) and Liaisons scandaleuses (1997). In 2002, Maryam drew on her experiences as a Bond Girl to write, produce and host Bond Girls Are Forever (2002), examining the culture and connotations of being a Bond girl, and the subsequent effects on a film career. This interesting documentary shed new light on the topic of James Bond films, and appeared on British and American television, whilst gaining a DVD release. Maryam strayed away from commercial features, opting to appear in a variety of television dramas, including: a TV mini series of Doctor Zhivago (2002) and Helen of Troy (2003). More recently, she appeared in San Antonio (2004), Evil Remains (2004), a movie filmed in France L'enfer (2005) and a direct-to-video sequel, The Prince & Me II: The Royal Wedding (2006). Maryam has displayed talent in a variety of genres, she continues to make guest appearances for her fans, and is likely to appear in more films. She also works on films with her husband director Hugh Hudson, whom she married in 2003. This striking blonde actress, a former Bond girl, holds her own up with the best of them.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTgzNjYzNV5BMl5BanBnXkFtZTcwNDA3NDk0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001881","name":"Maryam d'Abo","idIMDB":"nm0001881"},"actorId":"nm0001881","character":"Sara II","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Doreen Mantle","urlProfile":"http://www.imdb.com/name/nm0544140","urlPhoto":"","biography":{"dateOfBirth":"1 August 1926","placeOfBirth":" Cape Town, Cape Province, Union of South Africa","birthName":"Doreen J. Mantle","bio":"Doreen Mantle was born in August 1926 in Cape Town, South Africa and is a character actress who is probably best known for her role as Mrs Jean Warboys in One Foot in the Grave (1990-2000). She has appeared in many British television series from the 1960s to the present, such as The Duchess of Duke Street, The Wild House, Chalk, Casualty, The Bill, Doctors, Holby City, Love Soup and Jonathan Creek. She played lollipop lady Queenie in Jam & Jerusalem (2006-09). Mantle has worked extensively on the stage in such productions as My Fair Lady, Keep It in the Family, The Seagull and Hamlet. She also toured Britain in Billy Liar in the role of Florence Boothroyd and performed at the National Theatre in The Voysey Inheritance. In 1979 she was awarded the Laurence Olivier Award for Best Actress in a Supporting Role for her performance in Death of a Salesman. She has also done a great deal of radio work for BBC Radio 3, BBC Radio 4 and BBC World Service. Mantle played \"Mrs Shaemen\" in the film Yentl in 1983. In 2011 Mantle appeared in Coronation Street as the mother of Colin Fishwick whose identity was taken by John Stape.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0544140","name":"Doreen Mantle","idIMDB":"nm0544140"},"actorId":"nm0544140","character":"Clairvoyant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victoria Worsley","urlProfile":"http://www.imdb.com/name/nm0941636","urlPhoto":"","biography":{"bio":"Victoria Worsley is an actress, known for Archer's Goon (1992), So This Is Romance? (1997) and Blue Murder (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0941636","name":"Victoria Worsley","idIMDB":"nm0941636"},"actorId":"nm0941636","character":"Susan 'The Witch'","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Sterne","urlProfile":"http://www.imdb.com/name/nm0827664","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MzE5ODg2Ml5BMl5BanBnXkFtZTcwNTAxNzU1Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"David Stone","height":"5' 11\" (1.8 m)","bio":"David Sterne was born as David Stone. He is an actor, known for Harry Potter and the Goblet of Fire (2005), Pirates of the Caribbean: Dead Man's Chest (2006) and 300: Rise of an Empire (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MzE5ODg2Ml5BMl5BanBnXkFtZTcwNTAxNzU1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0827664","name":"David Sterne","nicknames":["Badger"],"idIMDB":"nm0827664"},"actorId":"nm0827664","character":"Murray","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kamilla Blanche","urlProfile":"http://www.imdb.com/name/nm0087130","urlPhoto":"","biography":{"bio":"Kamilla Blanche is an actress, known for What If It's Raining (1986), So This Is Romance? (1997) and Growing Pains (1992).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0087130","name":"Kamilla Blanche","idIMDB":"nm0087130"},"actorId":"nm0087130","character":"Alice","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fiona Mogridge","urlProfile":"http://www.imdb.com/name/nm0292125","urlPhoto":"","biography":{"dateOfBirth":"1972","placeOfBirth":"","height":"5' 7\" (1.7 m)","bio":"Fiona Mogridge was born in 1972. She is an actress, known for Grange Hill (1978), So This Is Romance? (1997) and Move It (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0292125","name":"Fiona Mogridge","idIMDB":"nm0292125"},"actorId":"nm0292125","character":"Julie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anna Livia Ryan","urlProfile":"http://www.imdb.com/name/nm0752412","urlPhoto":"","biography":{"bio":"Anna Livia Ryan is an actress, known for The Playboys (1992), The Wrong Sea (2005) and Stiff Upper Lips (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0752412","name":"Anna Livia Ryan","idIMDB":"nm0752412"},"actorId":"nm0752412","character":"Dianne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michelle Monks","urlProfile":"http://www.imdb.com/name/nm0598285","urlPhoto":"","biography":{"bio":"Michelle Monks is an actress, known for So This Is Romance? (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0598285","name":"Michelle Monks","idIMDB":"nm0598285"},"actorId":"nm0598285","character":"Esther","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0138063","urlIMDB":"http://www.imdb.com/title/tt0138063","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 35 min (95 min) (edited) (USA)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"5.4","filmingLocations":[],"awards":[],"votes":"132","type":"Movie","companyCreditsSimple":[{"idCompany":"co0051694","name":"Bloomsbury Films"}],"keywords":{"keywords":["composer","four word title","question mark in title","question in title","dating"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:52:59"}}