{"data":{"movies":[{"title":"Best of the Best 4: Without Warning","originalTitle":"","year":"1998","releaseDate":"19981020","directors":[{"name":"Phillip Rhee","id":"nm0722221"}],"writers":[{"name":"Phillip Rhee","id":"nm0722221"},{"name":"Fred Vicarel","id":"nm0895831"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1Mzg0MzY0OV5BMl5BanBnXkFtZTYwMzA3MzQ5._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Thriller"],"plot":"A group of Russian mobsters have stolen a huge supply of paper for printing U.S. currency, and are now flooding the market with conterfeit bills. When one of the mobsters decides to give herself in and hand over a data CD to the DA, she is shot and killed, but not before handing the disc to an unsuspecting Tommy Lee. Despite working with the police as a martial arts instructor, Lee doesn't go to the cops with the disc, but instead goes on the run, giving the mafia time to kidnap his daughter and hold as a hostage in exchange for return of the disc. Will Tommy ever see his daughter again?","simplePlot":"A group of Russian mobsters have stolen a huge supply of paper for printing U.S. currency, and are now flooding the market with conterfeit bills. When one of the mobsters decides to give ... ","actors":[{"actorName":"Phillip Rhee","urlProfile":"http://www.imdb.com/name/nm0722221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzczNTI1NzUyMl5BMl5BanBnXkFtZTgwMjY2Mjg1NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1960","placeOfBirth":" Seoul, Korea","height":"5' 10½\" (1.79 m)","bio":"Phillip Rhee is a master martial artist, actor and filmmaker best known for creating the \"BEST of the BEST\" film franchise with his producing partner and mentor Peter E. Strauss (Executive VP and Mandalay Pictures) and Frank Giustra, a Canadian Billionaire and founder of Lions Gate. The first \"Best of the Best\" starring academy award nominated actors, James Earl Jones, Eric Roberts, Louise Fletcher, Sally Kirkland and Chris Penn was distributed through Sony Pictures. \"Best of the Best 2\" through 20th Century Fox and \"Best of the Best 3\", directed and starring Rhee and Gina Gershon was picked up by Miramax, and the fourth installment of \"Best of the Best: Without Warning\", directed and starring Rhee and Ernie Hudson was also acquired by Miramax/Dimension Films. 2015 AMC Movie Review by Chief Editor John Campea chose \"Best of the Best\" as his favorite movie of all time. In 2015, \"Best of the Best\" was chosen by Fandango's 15 most inspirational sports movies of all time along with \"Rocky\". In 2010, Rhee partnered with former President of Warner Bros, Jim Miller and launched \"Stereo Pictures\" a 3D conversion technology studio based in L.A. and Korea, servicing major Hollywood studios and consumer electronic giants such as Samsung, LG and game developers Blizzard. Rhee, an avid martial artist holds a 6th degree black belt in Tae Kwon Do, 3rd degree in Hap Ki Do and Kendo and is one of the most sought after teachers in the world. His former students include the son of President, Ronald Reagan, Chairman of Warner Chappell, former Chairman of Fox, Chairman of ACI and numerous sports and film celebrities. Rhee speaks three languages and lives with his fashion designer wife, Amy and his son Sean.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzczNTI1NzUyMl5BMl5BanBnXkFtZTgwMjY2Mjg1NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0722221","name":"Phillip Rhee","idIMDB":"nm0722221"},"actorId":"nm0722221","character":"Tommy Lee","urlCharacter":"http://www.imdb.com/character/ch0023272","main":true},{"actorName":"Ernie Hudson","urlProfile":"http://www.imdb.com/name/nm0001368","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1ODMxNTc0N15BMl5BanBnXkFtZTgwMDIwODI2OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 December 1945","placeOfBirth":" Benton Harbor, Michigan, USA","birthName":"Earnest Lee Hudson","height":"6' (1.83 m)","bio":"As a child growing up in Benton Harbor, Michigan, Ernie Hudson wrote short stories, poems and songs, always thinking that his words might one day come to life on stage. After a short stint in the Marine Corps, he moved to Detroit where he became the resident playwright at Concept East, the oldest black theatre in the country. In addition, he enrolled at Wayne State University to further develop his writing and acting skills and found time to establish the Actors' Emsemble Theatre, where he and other talented young black writers directed and appeared in their own works. After graduating with a B.A. from Wayne State, he was rewarded a full scholarship to the M.F.A. program at the prestigious Yale School of Drama. While performing with the school's repertory company, he was asked to appear in the Los Angeles production of Lonne Elder III's musical \"Daddy Goodness,\" which led to his meeting Gordon Parks, who gave Hudson the costarring role in his first feature film, Leadbelly (1976). Unfortunately, all that followed \"Leadbelly\" was a year of \"bit parts and some harsh lessons about Hollywood,\" which led Hudson to enroll in another academic doctorate program at the University of Minnesota. He did not complete the program. Through his experience, he learned another vital lesson: \"There are those who spend their lives studying it and those who spend their lives doing it.\" Hudson definitely wanted to be in the second group. Keeping in mind this self-revelation, Hudson accepted the starring role of Jack Jefferson in the Minneapolis Theatre In The Round's production of \"The Great White Hope,\" a role that he put \"everything he had into,\" including shaving his head. A series of starring and guest roles followed on such television shows as Fantasy Island (1977), The Incredible Hulk (1978), Little House on the Prairie (1974), Diff'rent Strokes (1978), Taxi (1978), One Day at a Time (1975), Gimme a Break! (1981), The A-Team (1983) and Webster (1983), as well as costarring roles in the TV movies White Mama (1980) with Bette Davis, Roots: The Next Generations (1979), Women of San Quentin (1983), California Girls (1985), Mad Bull (1977) and Love on the Run (1985). Other feature film credits include The Jazz Singer (1980), The Main Event (1979), Spacehunter: Adventures in the Forbidden Zone (1983), Penitentiary II (1982), Going Berserk (1983), Joy of Sex (1984) and, of course, the mega-hit Ghostbusters (1984).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1ODMxNTc0N15BMl5BanBnXkFtZTgwMDIwODI2OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001368","name":"Ernie Hudson","idIMDB":"nm0001368"},"actorId":"nm0001368","character":"Detective Gresko","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tobin Bell","urlProfile":"http://www.imdb.com/name/nm0068551","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM5OTE1MjA3Nl5BMl5BanBnXkFtZTgwOTAxNjk4MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 August 1942","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Joseph H. Tobin Jr.","height":"5' 10½\" (1.79 m)","bio":"Tobin Bell is an American actor with a career in film, television and theater spanning three decades. He was born in Queens, New York and raised in Weymouth, Mass. His mother is the British actress Eileen Bell. He is perhaps best known for his role as the iconic villain \"Jigsaw\" in the Saw film series...for which he received MTV Award nominations in 2007 & 2009. He's a graduate of Boston University and has a Masters Degree in Education from Montclair State University. He studied acting with Sanford Meisner at the Neighborhood Playhouse and Lee Strasberg at the Actors Studio in New York. He is a lifetime member of The Actors Studio and a member of The Academy of Motion Picture Arts and Sciences.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM5OTE1MjA3Nl5BMl5BanBnXkFtZTgwOTAxNjk4MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0068551","name":"Tobin Bell","idIMDB":"nm0068551"},"actorId":"nm0068551","character":"Lukasz Slava","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thure Riefenstein","urlProfile":"http://www.imdb.com/name/nm0726167","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwMTU0MjkwNl5BMl5BanBnXkFtZTgwNzgxNTgxOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 October 1965","placeOfBirth":" Langenau, Germany","height":"5' 10½\" (1.79 m)","bio":"Thure Riefenstein is a German-Serbian born actor, writer and producer who started his career at German Broadway theaters such as the \"Berliner Ensemble\" or the \"Hamburger Schauspielhaus\" after graduating drama school. He is best known for playing strong and enigmatic heroes or villains in many Feature Films and TV Series worldwide. Riefenstein has worked with the finest directors such as Academy Winners Steven Soderbergh in Behind the Candelabra (2013), or Jan Sverák in Dark Blue World (2001). He played with Michael Douglas and Matt Damon, Guest-starred opposite Academy Award winner Timothy Hutton in Leverage (2008) or 'Tim Robbins\" in _\"The Brink (2015)_ . He is a lead in Les croisés (2001) opposite Academy Award nominees Armin Mueller-Stahl or in Baltic Storm (2003) opposite Golden Globe winners Donald Sutherland and Greta Scacchi . His acclaimed work for TV includes the International Emmy Award nominated French cloak & dagger movie Julie, chevalier de Maupin (2004), where he starred with Marisa Berenson, Pierre Arditi and Gottfried John. Riefenstein, received a \"Best Actor\" nomination for The Night a Village Vanished (2009), the official German entry for the International Emmy Awards in 2010. He starred as Detective Stefan Deuter in The TV series Kommissarin Lucas (2003), which received the Adolph Grimme Award nomination among others. Thure speaks four languages fluently and is highly versatile with many accents. He loves working on extreme characters such as \"Adolf Hitler\" in Die Machtergreifung (2012) or Trickster-Villains in action movies such as Jack Hunter and the Lost Treasure of Ugarit (2008), or as the dark, tormented Circus character \"Magnus\" opposite John Rhys-Davies and Deborah Kara Unger in the feature Sophie & Sheba (2010). He plays the gentle hero in romantic dramas as well as the \"quirky Artist\" in black comedies such as 666: In Bed with the Devil (2002). Thure believes any artist, any creative person should never stop working on his craft. His acting teachers include Doug Warhit, Tim Robbins & Cynthia Ettinger (Actors Gang), Dustin Hoffman (\"Masterclass\"), Sam Christensen, ACI, Michelle Danner, Kristen Linklater (NY), Nelia Veksel (Russia), Vlad Mugur (Romania). He also works as writer and director, is a graduate of the John Trubys masterclass in screen-writing, and won several awards for \"Lonely nights\" and \"God Is No Soprano\" (writer, director and producer). Riefenstein is a member of the Deutsche Filmakademie, Germany's Academy of Motion Pictures Arts and Sciences, and served as a juror for the International Emmy Awards and other film-festivals.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwMTU0MjkwNl5BMl5BanBnXkFtZTgwNzgxNTgxOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0726167","name":"Thure Riefenstein","idIMDB":"nm0726167"},"actorId":"nm0726167","character":"Yuri Slava","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jessica Collins","urlProfile":"http://www.imdb.com/name/nm0172385","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMjA1MzkyNF5BMl5BanBnXkFtZTgwNDA0NTI1NTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 April 1971","placeOfBirth":" Schenectady, New York, USA","birthName":"Jessica Lynn Capogna","height":"5' 7\" (1.7 m)","bio":"Jessica Collins was born on April 1, 1971 in Schenectady, New York, USA as Jessica Lynn Capogna. She is an actress, known for The Young and the Restless (1973), Catch Me If You Can (2002) and Loving (1983). She has been married to Michael Cooney since May 4, 2016. They have one child. She was previously married to Robert Tyler.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMjA1MzkyNF5BMl5BanBnXkFtZTgwNDA0NTI1NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0172385","name":"Jessica Collins","idIMDB":"nm0172385"},"actorId":"nm0172385","character":"Karina","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Lemmon","urlProfile":"http://www.imdb.com/name/nm0501422","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MTk1MjE4MF5BMl5BanBnXkFtZTcwNDA0ODAxNw@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 June 1954","placeOfBirth":" Los Angeles, California, USA","birthName":"Christopher Boyd Lemmon","height":"6' 1½\" (1.87 m)","bio":"Chris Lemmon was born on June 22, 1954 in Los Angeles, California, USA as Christopher Boyd Lemmon. He is known for his work on Duet (1987), Wishmaster (1997) and Thunder in Paradise (1994). He has been married to Gina Raymond since April 23, 1988. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MTk1MjE4MF5BMl5BanBnXkFtZTcwNDA0ODAxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0501422","name":"Chris Lemmon","idIMDB":"nm0501422"},"actorId":"nm0501422","character":"Jack Jarvis","urlCharacter":"http://www.imdb.com/character/ch0093379","main":true},{"actorName":"Paul Gleason","urlProfile":"http://www.imdb.com/name/nm0322339","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc1MzYwNjE1Nl5BMl5BanBnXkFtZTYwMDAyMTkz._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 May 1939","placeOfBirth":" Jersey City, New Jersey, USA","birthName":"Paul Xavier Gleason","height":"6' 0½\" (1.84 m)","bio":"Character actor Paul Gleason was adept at playing tough guys and white collar sleazebags, making his film debut in Winter A-Go-Go (1965). He made a name for himself portraying these unlikeable characters. A native of Jersey City, New Jersey, Gleason studied extensively at the Actor's Studio in New York City in the mid-60s with Lee Strasberg (his mentor) and was seen in a handful of Roger Corman productions before landing a a three-year role on the TV soap opera All My Children (1970). He appeared in over 60 films, with key roles in Trading Places (1983), Die Hard (1988), Miami Blues (1990), Boiling Point (1993) and Van Wilder: Party Liaison (2002). However, he is perhaps best remembered for his role as the no-nonsense principal \"Richard Vernon\" in The Breakfast Club (1985). He also guest-starred in numerous television series, including Hill Street Blues (1981), Dawson's Creek (1998) and Friends (1994). Gleason passed away of mesothelioma, a rare form of lung cancer at a Burbank, California hospital on May 29th 2006 at the age of 67.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc1MzYwNjE1Nl5BMl5BanBnXkFtZTYwMDAyMTkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0322339","name":"Paul Gleason","idIMDB":"nm0322339"},"actorId":"nm0322339","character":"Father Gil","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Art LaFleur","urlProfile":"http://www.imdb.com/name/nm0480869","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODY1Mjk4ODc4NF5BMl5BanBnXkFtZTYwMDY2MDAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1943","placeOfBirth":" Gary, Indiana, USA","height":"5' 11¾\" (1.82 m)","bio":"Art LaFleur was born on September 9, 1943 in Gary, Indiana, USA. He is an actor and writer, known for The Sandlot (1993), Field of Dreams (1989) and Cobra (1986).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODY1Mjk4ODc4NF5BMl5BanBnXkFtZTYwMDY2MDAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0480869","name":"Art LaFleur","idIMDB":"nm0480869"},"actorId":"nm0480869","character":"Big Joolie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sven-Ole Thorsen","urlProfile":"http://www.imdb.com/name/nm0861752","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MTI2OTg5OF5BMl5BanBnXkFtZTcwMzYyOTUwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 September 1944","placeOfBirth":" Copenhagen, Denmark","height":"6' 5\" (1.96 m)","bio":"Born in Denmark, Sven-Ole Thorsen has a remarkable sporting background as a champion bodybuilder, champion power-lifter, and karate black belt that made him an obvious choice for movies roles as \"muscle for hire.\" The hulking 6' 5\" actor first came to attention as one of Thulsa Doom's bodyguards... The hammer wielding Thorgrim, in the highly popular, Conan the Barbarian (1982). He came to Hollywood in 1985, appearing in nearly every Arnold Schwarzenegger film, including Predator (1987), Twins (1988), Red Heat (1988), and End of Days (1999). His other on screen appearances include Lethal Weapon (1987), Mort ou vif (1995), The Hunt for Red October (1990), On Deadly Ground (1994), and Gladiator (2000). Thorsen's extensive stunt work includes Bram Stoker's Dracula (1992), Bulletproof (1996), Eraser (1996), Soldier (1998) and Collateral (2004). On television, he has been seen in Baywatch (1989) and The A-Team (1983).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MTI2OTg5OF5BMl5BanBnXkFtZTcwMzYyOTUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0861752","name":"Sven-Ole Thorsen","nicknames":["Sven"],"idIMDB":"nm0861752"},"actorId":"nm0861752","character":"Boris","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jessica Huang","urlProfile":"http://www.imdb.com/name/nm1057134","urlPhoto":"","biography":{"bio":"Jessica Huang is an actress, known for Serenity (2005) and Best of the Best 4: Without Warning (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1057134","name":"Jessica Huang","idIMDB":"nm1057134"},"actorId":"nm1057134","character":"Stephanie Lee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jill Ritchie","urlProfile":"http://www.imdb.com/name/nm0728579","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0NjQ4MjIzM15BMl5BanBnXkFtZTYwODU4MzAz._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 March 1974","placeOfBirth":" Romeo, Michigan, USA","birthName":"Jill Susanne Ritchie","height":"5' 4\" (1.63 m)","bio":"Jill Ritchie grew up in Romeo, about an hour north of Detroit. She attended Romeo High School where she did lots of theatre. She attended DePaul University's Theatre School for a year before transferring to USC where she graduated with a B.A. in Theatre.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0NjQ4MjIzM15BMl5BanBnXkFtZTYwODU4MzAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0728579","name":"Jill Ritchie","idIMDB":"nm0728579"},"actorId":"nm0728579","character":"Mickey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ilia Volok","urlProfile":"http://www.imdb.com/name/nm0901679","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NzYzMDg3Ml5BMl5BanBnXkFtZTcwNDU4MzM2Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 November 1965","placeOfBirth":" Kiev, Ukrainian SSR","height":"6' 3\" (1.91 m)","bio":"Ilia Volok is a Soviet-born actor. He has appeared in over 90 films, television shows, and video games. He was born on November 1, 1965 in Kiev, Ukrainian SSR, Ukraine. He is known for his work on Indiana Jones and the Kingdom of the Crystal Skull (2008), Mission: Impossible - Ghost Protocol (2011) and The Curious Case of Benjamin Button (2008). Ilia was born in Kiev and for his education, he studied and graduated from Moscow Art Theatre School, where he took the acting class of Russian actor Aleksandr Kalyagin. Volok has appeared in more than 90 films and television programs. He starred as Vladimir Krasin in Air Force One and portrayed Master Org in Power Rangers Wild Force. Additionally, he has had recurring roles in General Hospital and The Young and the Restless. He guest starred in an episode of Friends in which reference was made to the Air Force One without mentioning him as one of its actors. Volok frequently performs on stage. He co-wrote, co-created, and starred as the title character in the comedy play Fakov in America. He plays a leading part in Cat's Paw, an Actors Studio project. The character Vladimir Kamarivsky in the Electronic Arts video game Battlefield 3 is modeled after and voiced by Volok. His life took an unexpected turn when after being a professional athlete (3rd place at the world championship in rowing with the Soviet Union team in Italy), and on his way to become a rowing coach, he left his native Kiev (Ukraine) to audition for one of the most prestigious acting colleges-the famous Moscow Art Theatre School. To the complete surprise of his friends and relatives, he passed a rigorous competition (200 hundred contestants per one spot) and was accepted to study under the direction of one of the top stars of Russian theatre and cinema - Alexander Kalyagin. Upon graduation he was invited to work in several top theatre companies the Moscow Art Theatre being one of them. But once again he changed the direction of his life, and with $300.00 in his pocket, without any knowledge of English, he came to America to pursue his dream of being a working Hollywood actor. The first jobs that came along had little to do with acting. He was cutting sandwiches and flipping chicken at a restaurant, and working at a cemetery as a funeral service attendant where he enjoyed quiet surroundings and fresh air (later he was promoted to selling cemetery plots). But finally in the fall of 1993 he got his acting break in the movie Hail Ceaser, playing opposite Samuel Jackson, Robert Downey Jr. and Michael Anthony Hall. To this date, he has appeared in over 110 films and television shows, including Air Force One, Oliver Stone's \"U-Turn\", \"Indiana Jones-4, David Fincher's \"The Curious Case of Benjamin Button\", \"The Soloist\", \"Six Feet Under\", \"Alias\", \"Friends\", \"Las Vegas\", \"Burn Notice\" and many others. Recent film credits include \"Water for Elephants\" starring Reese Witherspoon , \"Mission Impossible-4 with Tom Cruise, \"Abduction\" with Alfred Molina, directed by John Singleton, Upcoming \"GI JOE 2 with Bruce Willis and Dwayne Johnson-the Rock and \"Untitled James Gray Movie\" with Marion Cotillard and Joaquin Phoenix. Recent television includes a Guest Lead on \"Undercovers\", \"Supernatural\", \"Closer\", \"Chaos\" directed by Brett Ratner, and 37 episode arch as Karpov on \"General Hospital\". Among his LA Theater credits are \"Just a song at twilight\" at Write Act repertory company, \"Cat's paw\", produced by the Actor's Studio, \"Cassat and Degas\" at the Hudson theatre where he portrayed the French impressionist, Destiny's Calling at the Stelle Adler Theatre, \"Ferdinand\" by Vaclav Haveland \"Fakov in America\"- a 2-men show, which he co-wrote and co-produced with David Laird Scott. His ongoing one-man show \"Diary of a madman\" written by Nicolai Gogol and directed by Eugene Lazarev, received rave reviews. For more information on Ilia and \"Diary of a Madman\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NzYzMDg3Ml5BMl5BanBnXkFtZTcwNDU4MzM2Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0901679","name":"Ilia Volok","idIMDB":"nm0901679"},"actorId":"nm0901679","character":"Ilia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Garrett Warren","urlProfile":"http://www.imdb.com/name/nm0912836","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMzY1MzAxNl5BMl5BanBnXkFtZTYwOTkyNzgy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Garrett Warren has taught Martial Arts and Fight Choreography to such celebrities as Jessica Alba, Jada Pinkett Smith, Casper Van Dien, Alexa Davalos, Jaime Pressly, Clancy Brown, John Travolta, \"The Rock\" and Michael Biehn. He is responsible for getting such celebrities as Jaime Pressly, Denise Richards, Kate Hudson, Heather Locklear, Dania Ramirez, Wayne Gretzky and Janet Gretzky, Rick Yune, Eddie and Valerie Van Halen, and Casper Van Dien into shape as their Personal Trainer. He also holds a 5th Degree Blackbelt in Tae Kwon Do and has won 3 World Martial Arts Championships.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMzY1MzAxNl5BMl5BanBnXkFtZTYwOTkyNzgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0912836","name":"Garrett Warren","idIMDB":"nm0912836"},"actorId":"nm0912836","character":"Viktor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David 'Shark' Fralick","urlProfile":"http://www.imdb.com/name/nm0289716","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODE2OTQ0M15BMl5BanBnXkFtZTYwOTg5MTgy._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 October 1962","placeOfBirth":" Coral Gables, Florida, USA","height":"6' 3\" (1.91 m)","bio":"David 'Shark' Fralick was born on October 16, 1962 in Coral Gables, Florida, USA. He is known for his work on Uncle Sam (1996), Soultaker (1990) and Inferno (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODE2OTQ0M15BMl5BanBnXkFtZTYwOTg5MTgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0289716","name":"David 'Shark' Fralick","idIMDB":"nm0289716"},"actorId":"nm0289716","character":"Oleg","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Monte Rex Perlin","urlProfile":"http://www.imdb.com/name/nm0674194","urlPhoto":"","biography":{"dateOfBirth":"23 November 1956","placeOfBirth":" Henderson, Nevada, USA","bio":"Monte Rex Perlin was born on November 23, 1956 in Henderson, Nevada, USA. He is known for his work on Memento (2000), Mr. & Mrs. Smith (2005) and Indiana Jones and the Kingdom of the Crystal Skull (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0674194","name":"Monte Rex Perlin","idIMDB":"nm0674194"},"actorId":"nm0674194","character":"Sergi","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0130370","urlIMDB":"http://www.imdb.com/title/tt0130370","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"© 1998 Picture Securities, LTD."},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":null,"camera":["Panavision Cameras and Lenses"],"laboratory":["Consolidated Film Industries (CFI), Hollywood (CA), USA (color by) (as CFI)"],"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.0","filmingLocations":[{"location":"6th Street Viaduct, Los Angeles, California, USA"}],"rated":"R","awards":[],"votes":"882","type":"Video","companyCreditsSimple":[],"keywords":{"keywords":["on the run","hostage","martial arts","die hard scenario","last of series","part of series","kidnapping","pump action shotgun","shotgun","uzi","machine gun","blood","blood spatter","motorcycle gang","motorcycle","knife","knife throwing","store robbery","opening action scene","rescue","fugitive","duel","sword fight","sword","rapier","fencing","dojo","father daughter relationship","murder","gangster","russian mafia","gunfight","shootout","stick fight","showdown","martial arts master","martial artist","mixed martial arts","violence","hand to hand combat","combat","chop socky","fighting","fight","fistfight","brawl","beretta","pistol","tough guy","one against many","one man army","action hero","hero","sequel","repetition in title","fourth part","kung fu","taekwondo","hapkido","false money","motorcycle chase"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:09:09"}}