{"data":{"movies":[{"title":"The Adventures of Pinocchio","originalTitle":"","year":"1996","releaseDate":"19960726","directors":[{"name":"Steve Barron","id":"nm0006625"}],"writers":[{"name":"Sherry Mills","id":"nm0590188"},{"name":"Steve Barron","id":"nm0006625"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4ODU3NjQwNl5BMl5BanBnXkFtZTYwODU0NzI5._V1.jpg","countries":["UK","USA","France","Germany","Czech Republic"],"languages":["Italian","English"],"genres":["Adventure","Drama","Family","Fantasy","Musical"],"plot":"One of puppet-maker Geppetto's creations comes magically to life. This puppet, Pinocchio, has one major desire and that is to become a real boy someday. In order to accomplish this goal he has to learn to act responsibly. This film shows you the adventures on which he learns valuable lessons.","simplePlot":"One of puppet-maker Geppetto's creations comes magically to life. This puppet, Pinocchio, has one major desire and that is to become a real boy someday. In order to accomplish this goal he ... ","actors":[{"actorName":"Martin Landau","urlProfile":"http://www.imdb.com/name/nm0001445","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MzkxNzg0OF5BMl5BanBnXkFtZTcwNDUzOTc5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1928","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"6' 2\" (1.88 m)","bio":"Oscar-winning character actor Martin Landau was born on June 20, 1928 in Brooklyn, New York. At age 17, he was hired by the New York Daily News as a staff cartoonist and illustrator. In his five years on the paper, he served as the illustrator for Billy Rose's \"Pitching Horseshoes\" column. He also worked for cartoonist Gus Edson on \"The Gumps\" comic strip. Landau's major ambition was to act, and in 1951, he made his stage debut in \"Detective Story\" at the Peaks Island Playhouse in Peaks Island, Maine. He made his off-Broadway debut that year in \"First Love\". Landau was one of 2000 applicants who auditioned for Lee Strasberg's Actors Studio in 1955 - only he and Steve McQueen were accepted. Landau was a friend of James Dean and McQueen, in a conversation with Landau, mentioned that he knew Dean and had met Landau. When Landau asked where they had met, McQueen informed him he had seen Landau riding into the New York City garage where he worked as a mechanic on the back of Dean's motorcycle. He acted during the mid-1950s in the television anthologies Playhouse 90 (1956), Studio One in Hollywood (1948), The Philco-Goodyear Television Playhouse (1948), Kraft Theatre (1947), Goodyear Playhouse (1951) and Omnibus (1952). He began making a name for himself after replacing star Franchot Tone in the 1956 off-Broadway revival of Anton Chekhov's \"Uncle Vanya\", a famous production that helped put off-Broadway on the New York theatrical map. In 1957, he made a well-received Broadway debut in the play \"Middle of the Night\". As part of the touring company with star Edward G. Robinson, he made it to the West Coast. He made his movie debut in Pork Chop Hill (1959) but scored on film as the heavy in Alfred Hitchcock's classic thriller North by Northwest (1959), in which he was shot on top of Mount Rushmore while sadistically stepping on the fingers of Cary Grant, who was holding on for dear life to the cliff face. He also appeared in the blockbuster Cleopatra (1963), the most expensive film ever made up to that time, which nearly scuttled 20th Century-Fox and engendered one of the great public scandals, the Elizabeth Taylor-Richard Burton love affair that overshadowed the film itself. Despite the difficulties with the film, Landau's memorable portrayal in the key role of Rufio was highly favored by the audience and instantly catapulted his popularity. In 1963, Landau played memorable roles on two episodes of the science-fiction anthology series The Outer Limits (1963), \"The Bellero Shield\" and \"The Man Who Was Never Born\". He was Gene Roddenberry's first choice to play Mr. Spock on Star Trek (1966), but the role went to Leonard Nimoy, who later replaced Landau on Mission: Impossible (1966), the show that really made Landau famous. He originally was not meant to be a regular on the series, which co-starred his wife Barbara Bain, whom he had married in 1957. His character, Rollin Hand, was supposed to make occasional, though recurring appearances, on Mission: Impossible (1966), but when the producers had problems with star Steven Hill, Landau was used to take up the slack. Landau's characterisation was so well-received and so popular with the audience that he was made a regular. Landau received Emmy nominations as Outstanding Lead Actor in a Drama Series for each of the three seasons he appeared. In 1968, he won the Golden Globe award as Best Male TV Star. Eventually, he quit the series in 1969 after a salary dispute when the new star, Peter Graves, was given a contract that paid him more than Landau, whose own contract stated he would have parity with any other actor on the show who made more than he did. The producers refused to budge and he and Bain, who had become the first actress in the history of television to be awarded three consecutive Emmy Awards (1967-69) while on the show, left the series, ostensibly to pursue careers in the movies. The move actually held back their careers, and Mission: Impossible (1966) went on for another four years with other actors. Landau appeared in support of Sidney Poitier in They Call Me Mister Tibbs! (1970), the less successful sequel to the Oscar-winning In the Heat of the Night (1967), but it did not generate more work of a similar caliber. He starred in the television movie Welcome Home, Johnny Bristol (1972) on CBS, playing a prisoner of war returning to the United States from Vietnam. The following year, he shot a pilot for NBC for a proposed show, \"Savage\". Though it was directed by emerging wunderkind Steven Spielberg, NBC did not pick up the show. Needing work, Landau and Bain moved to England to play the leading roles in the syndicated science-fiction series Space: 1999 (1975). Landau's and Bain's careers stalled after Space: 1999 (1975) went out of production, and they were reduced to taking parts in the television movie The Harlem Globetrotters on Gilligan's Island (1981). It was the nadir of both their careers, and Bain's acting days, and their marriage, soon were over. Landau, one of the most talented character actors in Hollywood, and one not without recognition, had bottomed out career-wise. In 1983, he was stuck in low-budget sci-fi and horror movies like The Being (1983), a role far beneath his talent. His career renaissance got off to a slow start with a recurring role in the NBC sitcom Buffalo Bill (1983), starring Dabney Coleman. On Broadway, he took over the title role in the revival of \"Dracula\" and went on the road with the national touring company. Finally, his career renaissance began to gather momentum when Francis Ford Coppola cast him in a critical supporting role in his Tucker: The Man and His Dream (1988), for which Landau was nominated for an Academy Award as Best Supporting Actor. He won his second Golden Globe for the role. The next year, he received his second consecutive Best Supporting Actor Oscar nomination for his superb turn as the adulterous husband in Woody Allen's Crimes and Misdemeanors (1989). He followed this up by playing famed Nazi hunter Simon Wiesenthal in the TNT movie Max and Helen (1990). However, the summit of his post-\"Mission: Impossible\" carer was about to be scaled. He portrayed Bela Lugosi in Tim Burton's biopic Ed Wood (1994) and won glowing reviews. For his performance, he won the Best Supporting Actor Oscar. Martin Landau, the superb character actor, finally had been recognized with his profession's ultimate award. His performance, which also won him his third Golden Globe, garnered numerous awards in addition to the Oscar and Golden Globe, including top honors from the New York Film Critics Circle and the National Society of Film Critics. Landau continued to play a wide variety of roles in motion pictures and on television, turning in a superb performance in a supporting role in The Majestic (2001). He received his fourth Emmy nomination in 2004 as Outstanding Guest Actor in a Drama Series for Without a Trace (2002). Martin Landau was honored with his own star on the Hollywood Walk of Fame, located at 6801 Hollywood Boulevard.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MzkxNzg0OF5BMl5BanBnXkFtZTcwNDUzOTc5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001445","name":"Martin Landau","nicknames":["Marty"],"idIMDB":"nm0001445"},"actorId":"nm0001445","character":"Geppetto","urlCharacter":"http://www.imdb.com/character/ch0028761","main":true},{"actorName":"Jonathan Taylor Thomas","urlProfile":"http://www.imdb.com/name/nm0001795","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQwNjc0MTYwN15BMl5BanBnXkFtZTYwNzE3NzQz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 September 1981","placeOfBirth":" Bethlehem, Pennsylvania, USA","birthName":"Jonathan Taylor Weiss","height":"5' 6\" (1.68 m)","bio":"Jonathan Taylor Thomas was born Jonathan Taylor Weiss on September 8, 1981 in Bethlehem, Pennsylvania, to Claudine (Gonsalves) and Stephen Weiss. He has an older brother, Joel, and has Pennsylvania Dutch (German) and Portuguese ancestry. Growing up, he liked the music group Boyz II Men, and his favorite TV shows were Roseanne (1988) and Grace Under Fire (1993), but he also liked watching CNN news, to keep up to date with current events. One thing that Jonathan does not like is meat. He has been a vegetarian since he was four years old, and he doesn't use products that are tested on animals because he believes that it is wrong to hurt them. When Jonathan was four years old, his family moved from Bethlehem to Sacramento, California. At the age of seven, Jonathan was working as a model for print advertisements in Sacramento, and over the next few years, he appeared in TV commercials for Kelloggs cereal, Mattel toys and for many other products. By this time, Jonathan was ready for bigger roles, and in 1989, he landed the part of Greg Brady's son Kevin in the TV special The Bradys (1990). In 1990, he landed his biggest role yet, as Randy Taylor on Home Improvement (1991). Jonathan's audition went well, but what really gave him an edge over the other boys was that the casting directors thought that he looked a lot like his TV dad-to-be, Tim Allen. In 1991, Jonathan's parents divorced. He lived with his mother and his brother. He began work in feature length movies, as the voice of young Simba in Disney's The Lion King (1994), and as Ben Archer in Man of the House (1995) opposite Chevy Chase. Among his other movies are Tom and Huck (1995), The Adventures of Pinocchio (1996), Wild America (1997), and I'll Be Home for Christmas (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQwNjc0MTYwN15BMl5BanBnXkFtZTYwNzE3NzQz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001795","name":"Jonathan Taylor Thomas","nicknames":["JTT","Jon"],"idIMDB":"nm0001795"},"actorId":"nm0001795","character":"Pinocchio","urlCharacter":"http://www.imdb.com/character/ch0028096","main":true},{"actorName":"Geneviève Bujold","urlProfile":"http://www.imdb.com/name/nm0000991","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5OTY1NzkzOV5BMl5BanBnXkFtZTYwMjYzNTQ3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 July 1942","placeOfBirth":" Montréal, Québec, Canada","height":"5' 4\" (1.63 m)","bio":"Genevieve Bujold spent her first twelve school years in Montreal's oppressive Hochelaga Convent where opportunities for self-expression were limited to making welcoming speeches for visiting clerics. As a child she felt 'as if I were in a long dark tunnel trying to convince myself that if I could ever get out there was light ahead'. Caught reading a forbidden novel, she was handed her ticket out of the convent and she then enrolled in Montreal's free Conservatoire d'Art Dramatique. There she was trained in classical French drama and shortly before graduation was offered a part in a professional production of Beaumarchais' 'The Barber of Seville'. In 1965 while on a theatrical tour of Paris with another Montreal company, Rideau Vert, Bujold was recommended to director 'Alain Renais' (by his mother) who cast her opposite Yves Montand in The War Is Over (1966). She then made two other French films in quick succession, the Philippe de Broca cult classic King of Hearts (1966) and Louis Malle's The Thief of Paris (1967). She was also very active during 'this time in Canadian television where she met and married director 'Paul Almond' in 1967. They had one child and divorced in 1973. Two remarkable appearances - first as Shaw's Saint Joan on television in 12/67, then as Anne Boleyn in her Hollywood debut role Anne of the Thousand Days (1969), co-starring Richard Burton- introduced Bujold to American audiences and yielded Emmy and Oscar nominations respectively. Immediately after 'Anne', while under contract with Universal, she opted out of a planned _Mary, Queen of Scots_ ('it would be the same producer, the same director, the same costumes, the same me') prompting the studio to sue her for $750,000. Rather than pay, she went to Greece to film The Trojan Women (1971) with Katharine Hepburn. Her virtuoso performance as the mad seer Cassandra led critic Pauline Kael to prophesy 'prodigies ahead' but to assuage Universal, Bujold eventually returned to Hollywood to make _Earthquake_, co-starring Charlton Heston, which was a box office hit. A host of other films of varying quality followed, most notably _Obsession_, _Coma_, The Last Flight of Noah's Ark (1980), and Tightrope (1984), but she managed nevertheless to transcend the material and deliver performances with her trademark combination of ferocious intensity and childlike vulnerability. In the 1980s she found her way to director Alan Rudolphs nether world and joined his film family for three movies including the memorable Choose Me (1984). Highlights of recent work are her brave performance in the David Cronenberg film Faux-semblants (1988) and a lovely turn in the autumnal romance Les noces de papier (1990).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5OTY1NzkzOV5BMl5BanBnXkFtZTYwMjYzNTQ3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000991","name":"Geneviève Bujold","idIMDB":"nm0000991"},"actorId":"nm0000991","character":"Leona","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Udo Kier","urlProfile":"http://www.imdb.com/name/nm0001424","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxODE2MTgwM15BMl5BanBnXkFtZTYwMjYzNTky._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 October 1944","placeOfBirth":" Cologne, North Rhine-Westphalia, Germany","birthName":"Udo Kierspe","height":"5' 11\" (1.8 m)","bio":"Udo Kier was born October 14, 1944 in Cologne, Germany, during World War II. His entrance was just as dramatic as some of his roles. On the evening of his birth Udo's mother requested extra time with her new baby. The nurses had gathered all of the other babies and returned them to the nursery when the hospital was bombed. He and his mother were rescued from underneath the rubble. Udo didn't know much about his father. When Udo was 18 he moved to Britain in order to learn the English language. While there he took a few acting courses. He was eventually offered a role by director Michael Sarne as a gigolo in the film Road to Saint Tropez (1966). While the role was small, it was the beginning of his career in films. His first \"hit\" film was Mark of the Devil (1970) (Mark of the Devil). The film was rated \"V\" for violence and ticket buyers were offered vomit bags before the film started. It was banned in 31 countries but spawned two sequels (both without Kier). The film is notorious for its exploitation of sex and violence (the uncut version was remastered and re-released on video in 1997). Kier met director Paul Morrissey on an airplane trip. Morrissey offered him the lead role in the 3-D Flesh for Frankenstein (1973). It was this film, along with its sister film Blood for Dracula (1974), that made Udo a cult figure. Both Morrissey films are also known as Andy Warhol's Frankenstein and Dracula; however, Andy Warhol was not involved in the production or creation of the films. Both were rated X when released. One of Kier's most vivid memories from \"Flesh for Frankenstein\" was the infamous \"internal organ\" scene. Real animal organs were used that were left unrefrigerated on the set for several hours. Udo had to pull the organs out of a prop dummy with his bare hands and hold them up to his face. He has said he will never forget that smell. When this film was finished the cast and crew began immediately filming \"Blood for Dracula\". Udo remembers both of these films fondly and regards \"Dracula\" over \"Frankenstein\" as his favorite of the two (in 1996 both films were released by Criterion on DVD totally uncut). In the 1970s some of Kier's work included The Salzburg Connection (1972), The Story of O (1975) (The Story of O), Spermula (1976) and Trauma (1976) (House on Straw Hill). Much of his work has been dubbed with someone else's voice. In Suspiria (1977) there were some technical difficulties with the sound while his scene was shot. In the 1980s some of his work included Lulu (1980), The Strange Case of Dr. Jekyll and Miss Osbourne (1981) (The Blood of Dr Jekyll), The Island of the Bloody Plantation (1983) (Escape from Blood Plantation) and Seduction: The Cruel Woman (1985) (Seduction: The Cruel Woman). In the 1980s Kier did very little work outside of Europe. In the 1990s he had a lot more visibility in America and his breakthrough role was as Hans in My Own Private Idaho (1991) (the soundtrack includes the song that Udo performs in the film). Even Cowgirls Get the Blues (1993) reunited Kier with his friend Keanu Reeves yet again. Udo was cast as Pamela Anderson's sidekick in Barb Wire (1996) and played Ron Camp in Ace Ventura: Pet Detective (1994) opposite Jim Carrey. In the 1990s some of the films he was in included L'hôpital et ses fantômes (1994), For Love or Money (1993), Breaking the Waves (1996), The Adventures of Pinocchio (1996), Blade (1998) and Armageddon (1998). Over his 30-year career Udo has worked with several brilliant directors: Paul Morrissey, Charles Matton, Dario Argento, Gus Van Sant and Walerian Borowczyk. he continues to work often with Lars von Trier and is the godfather of Van Trier's child as well as a good friend. Von Trier is currently working on a film entitled Dimension which is a project that spans 30 years. Every year the cast and crew (including Udo) meet to shoot footage. The film will show the actors age 30 years without make-up or special effects. Approximately seen years of footage has already been shot. The premiere will take place in 2024! Kier's acting career ranges from art house films (Europa (1991)) to gore fests (Blackest Heart (1990) (German Chainsaw Massacre)) to television commercials. He says he loves horror films and wants to do more of them. He enjoys playing villains, as he feels it is more interesting because evil has no limits. Currently Udo lives in California and spends much of his time working in Europe, where he receives larger roles and more recognition.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxODE2MTgwM15BMl5BanBnXkFtZTYwMjYzNTky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001424","name":"Udo Kier","idIMDB":"nm0001424"},"actorId":"nm0001424","character":"Lorenzini","urlCharacter":"http://www.imdb.com/character/ch0043829","main":true},{"actorName":"Bebe Neuwirth","urlProfile":"http://www.imdb.com/name/nm0001564","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzOTUxODI1M15BMl5BanBnXkFtZTcwNTU3MjE3NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1958","placeOfBirth":" Princeton, New Jersey, USA","birthName":"Beatrice J. Neuwirth","height":"5' 4\" (1.63 m)","bio":"Beatrice \"Bebe\" Neuwirth is the daughter of Sydney Anne, an artist, and Lee Paul Neuwirth, a mathematician. Born and raised in Princeton, New Jersey, she started out as a dancer. Her New York career started out in \"A Chorus Line\". She won a Tony Award for her part in \"Sweet Charity\" and two Emmy Awards for Outstanding Supporting Actress in a Comedy Series for playing Lilith Sternin Crane of Cheers (1982).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzOTUxODI1M15BMl5BanBnXkFtZTcwNTU3MjE3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001564","name":"Bebe Neuwirth","idIMDB":"nm0001564"},"actorId":"nm0001564","character":"Felinet","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rob Schneider","urlProfile":"http://www.imdb.com/name/nm0001705","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDE4MTE0MF5BMl5BanBnXkFtZTcwOTYyOTM3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1963","placeOfBirth":" San Francisco, California, USA","birthName":"Robert Michael Schneider","height":"5' 7\" (1.7 m)","bio":"Robert Michael \"Rob\" Schneider (born October 31, 1963) is an American actor, comedian, screenwriter, and director. A stand-up comic and veteran of the NBC sketch comedy series Saturday Night Live (1975), Schneider has gone on to a successful career in feature films, including starring roles in the comedy films Deuce Bigalow: Male Gigolo (1999), The Hot Chick (2002), and Grown Ups (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDE4MTE0MF5BMl5BanBnXkFtZTcwOTYyOTM3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001705","name":"Rob Schneider","idIMDB":"nm0001705"},"actorId":"nm0001705","character":"Volpe","urlCharacter":"http://www.imdb.com/character/ch0417729","main":true},{"actorName":"Corey Carrier","urlProfile":"http://www.imdb.com/name/nm0140393","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyNjQ3ODYxMF5BMl5BanBnXkFtZTcwOTIxODgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 August 1980","placeOfBirth":" Middleboro, Massachusetts, USA","birthName":"Corey Thomas Carrier","height":"5' 7½\" (1.71 m)","bio":"Corey Carrier was born on August 20, 1980 in Middleboro, Massachusetts, USA as Corey Thomas Carrier. He is an actor, known for The Witches of Eastwick (1987), My Blue Heaven (1990) and Nixon (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyNjQ3ODYxMF5BMl5BanBnXkFtZTcwOTIxODgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0140393","name":"Corey Carrier","nicknames":["Core"],"idIMDB":"nm0140393"},"actorId":"nm0140393","character":"Lampwick","urlCharacter":"http://www.imdb.com/character/ch0044679","main":true},{"actorName":"Marcello Magni","urlProfile":"http://www.imdb.com/name/nm0536239","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MDE5NTk0OF5BMl5BanBnXkFtZTcwMzk0MDU1NA@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"bio":"Marcello Magni was born in Bergamo, Italy. He is known for his work on Nine (2009), The Adventures of Pinocchio (1996) and Mr. Turner (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MDE5NTk0OF5BMl5BanBnXkFtZTcwMzk0MDU1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0536239","name":"Marcello Magni","idIMDB":"nm0536239"},"actorId":"nm0536239","character":"Pastry shop baker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dawn French","urlProfile":"http://www.imdb.com/name/nm0294067","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NjQ3NDUyN15BMl5BanBnXkFtZTcwMDIzNTQyMw@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 October 1957","placeOfBirth":" Holyhead, Wales, UK","birthName":"Dawn Roma French","height":"5' (1.52 m)","bio":"Dawn French was born on October 11, 1957 in Holyhead, Wales as Dawn Roma French. She is an actress and writer, known for Coraline (2009), French and Saunders (1987) and Harry Potter and the Prisoner of Azkaban (2004). She has been married to Mark Bignell since April 20, 2013. She was previously married to Lenny Henry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NjQ3NDUyN15BMl5BanBnXkFtZTcwMDIzNTQyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0294067","name":"Dawn French","idIMDB":"nm0294067"},"actorId":"nm0294067","character":"Baker's wife","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Claxton","urlProfile":"http://www.imdb.com/name/nm0165487","urlPhoto":"","biography":{"bio":"Richard Claxton is an actor, known for Fever Pitch (1997), First Knight (1995) and The Adventures of Pinocchio (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0165487","name":"Richard Claxton","idIMDB":"nm0165487"},"actorId":"nm0165487","character":"Saleo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Griff Rhys Jones","urlProfile":"http://www.imdb.com/name/nm0722619","urlPhoto":"","biography":{"dateOfBirth":"16 November 1953","placeOfBirth":" Cardiff, Wales, UK","birthName":"Griffith Rhys Jones","height":"5' 8\" (1.73 m)","bio":"Griff Rhys Jones was born on November 16, 1953 in Cardiff, Wales as Griffith Rhys Jones. He is an actor and writer, known for Smith & Jones (1984), The Misadventures of Mr. Wilt (1990) and Charles Dickens & the Invention of Christmas (2007). He is married to Jo Jones. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0722619","name":"Griff Rhys Jones","idIMDB":"nm0722619"},"actorId":"nm0722619","character":"Tino","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Sessions","urlProfile":"http://www.imdb.com/name/nm0785938","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwOTgxOTU3Nl5BMl5BanBnXkFtZTcwNDI1MzkxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 January 1953","placeOfBirth":" Largs, Ayrshire, Scotland, UK","birthName":"John Gibb Marshall","bio":"Actor and comedian known for his various roles on film, TV and stage. He was born in Largs, Scotland, in 1953. He has an older brother and a twin sister. His debut film was The Sender (1982), a horror feature in which he played a patient. His next film was The Bounty (1984) with Mel Gibson and Anthony Hopkins. He has also appeared in Henry V (1989) and A Midwinter's Tale (1995), both directed by Kenneth Branagh, his friend and frequent collaborator. The two met at RADA in 1979. He continues to appear in Stella Street (1997) in which he plays a variety of middle-aged actors, alongside Phil Cornwell. One of his most memorable performances to date is the role of Dr. Prunesquallor in Gormenghast (2000), the BBC's lavish production of Mervyn Peake's novels \"Titus Groan\" and \"Gormenghast.\" Onstage, he has appeared in many productions and performed numerous one-man shows. His ability to improvise landed him a spot as the first regular contestant on Whose Line Is It Anyway? (1988). It was here that he showcased his great literary knowledge. He appeared on the BBC Radio 4 show \"Dead Man Talking,\" as various \"dead\" characters, including J. Robert Oppenheimer and Michelangelo.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwOTgxOTU3Nl5BMl5BanBnXkFtZTcwNDI1MzkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0785938","name":"John Sessions","idIMDB":"nm0785938"},"actorId":"nm0785938","character":"Professor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jean-Claude Drouot","urlProfile":"http://www.imdb.com/name/nm0238379","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmZlNzUyOTAtZjdjYi00MDEyLTllMjItYjU2MTAwMTA4YmVjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 December 1938","placeOfBirth":" Lessines, Belgium","birthName":"Jean-Claude Constant Nestor Gustave Drouot","bio":"Jean-Claude Drouot was born on December 17, 1938 in Lessines, Belgium as Jean-Claude Constant Nestor Gustave Drouot. He is an actor, known for Thierry la Fronde (1963), Le Bonheur (1965) and Nicholas and Alexandra (1971). He has been married to Claire Drouot since 1960. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmZlNzUyOTAtZjdjYi00MDEyLTllMjItYjU2MTAwMTA4YmVjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0238379","name":"Jean-Claude Drouot","idIMDB":"nm0238379"},"actorId":"nm0238379","character":"Magistrate","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jean-Claude Dreyfus","urlProfile":"http://www.imdb.com/name/nm0237835","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNTE1NzY1OV5BMl5BanBnXkFtZTYwMzg3NDky._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 February 1946","placeOfBirth":" Paris, France","bio":"Jean-Claude Dreyfus was born on February 18, 1946 in Paris, France. He is an actor, known for Delicatessen (1991), The City of Lost Children (1995) and Two Brothers (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNTE1NzY1OV5BMl5BanBnXkFtZTYwMzg3NDky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0237835","name":"Jean-Claude Dreyfus","idIMDB":"nm0237835"},"actorId":"nm0237835","character":"Foreman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Teco Celio","urlProfile":"http://www.imdb.com/name/nm0148081","urlPhoto":"","biography":{"bio":"Teco Celio is an actor, known for Three Colors: Red (1994), La crim' (1999) and Zoran, My Nephew the Idiot (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0148081","name":"Teco Celio","idIMDB":"nm0148081"},"actorId":"nm0148081","character":"Henchman","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0115472","urlIMDB":"http://www.imdb.com/title/tt0115472","business":{"budget":{"money":"$25,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$3,832,000","country":"USA","day":"28","month":"07","year":"1996","remarks":"1,779 Screens"}],"gross":[{"money":"$15,091,542","country":"USA","day":"27","month":"10","year":"1996","remarks":""},{"money":"$14,974,844","country":"USA","day":"13","month":"10","year":"1996","remarks":""},{"money":"$14,472,379","country":"USA","day":"29","month":"09","year":"1996","remarks":""},{"money":"$14,092,087","country":"USA","day":"22","month":"09","year":"1996","remarks":""},{"money":"$13,639,044","country":"USA","day":"15","month":"09","year":"1996","remarks":""},{"money":"$13,130,500","country":"USA","day":"08","month":"09","year":"1996","remarks":""},{"money":"$12,531,657","country":"USA","day":"01","month":"09","year":"1996","remarks":""},{"money":"$11,563,453","country":"USA","day":"25","month":"08","year":"1996","remarks":""},{"money":"$10,973,912","country":"USA","day":"18","month":"08","year":"1996","remarks":""},{"money":"$10,224,524","country":"USA","day":"11","month":"08","year":"1996","remarks":""},{"money":"$8,304,485","country":"USA","day":"04","month":"08","year":"1996","remarks":""},{"money":"$3,832,000","country":"USA","day":"28","month":"07","year":"1996","remarks":""},{"money":"¥132,354,100","country":"Japan","day":"19","month":"01","year":"1997","remarks":""},{"money":"¥105,019,500","country":"Japan","day":"05","month":"01","year":"1997","remarks":""},{"money":"¥73,739,700","country":"Japan","day":"29","month":"12","year":"1996","remarks":""},{"money":"¥39,648,400","country":"Japan","day":"22","month":"12","year":"1996","remarks":""},{"money":"ESP","country":"57,016,926","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1996/\">1996</a>"},{"money":"314,020","country":"France","day":"29","month":"10","year":"1996","remarks":""},{"money":"854,395","country":"Germany","day":"17","month":"11","year":"1996","remarks":""},{"money":"707,720","country":"Germany","day":"03","month":"11","year":"1996","remarks":""},{"money":"54,223","country":"Netherlands","day":"01","month":"01","year":"1997","remarks":""}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 32 min (92 min) (Argentina)","1 hr 34 min (94 min) (Germany)","1 hr 36 min (96 min) (USA)","1 hr 32 min (92 min) (France)","1 hr 30 min (90 min) (DVD edition) (Spain)"],"soundMix":["Dolby Digital","SDDS","Dolby SR"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Lenses and Panaflex Camera by Panavision"],"laboratory":["Barrandov Laboratore, Prague, Czech Republic","DeLuxe, Hollywood (CA), USA (prints)","Rank Film Laboratories, Denham, UK (prints)"],"filmLength":["2,587 m (Sweden)","2,627 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm"]},"rating":"5.3","filmingLocations":[{"location":"Cesky Krumlov, Czech Republic"}],"rated":"G","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1997","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Fantasy Film","names":[]},{"category":"Best Performance by a Younger Actor","names":[{"name":"Jonathan Taylor Thomas","id":"nm0001795","role":null}]}]}]},{"award":"Young Artist Awards 1997","titlesAwards":[{"titleAwardOutcome":"Won Young Artist Award","categories":[{"category":"Best Performance in a Voiceover - Young Artist","names":[{"name":"Jonathan Taylor Thomas","id":"nm0001795","role":null}]}]}]}],"votes":"4,278","type":"Movie","companyCreditsSimple":[{"idCompany":"co0046718","name":"New Line Cinema"},{"idCompany":"co0074787","name":"Savoy Pictures"},{"idCompany":"co0210345","name":"Twin Continental Films"}],"keywords":{"keywords":["transformation","human becoming an animal","young boy","slow motion","based on novel","independent film","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:32:51"}}