{"data":{"movies":[{"title":"Assassins","originalTitle":"","year":"1995","releaseDate":"19951006","directors":[{"name":"Richard Donner","id":"nm0001149"}],"writers":[{"name":"Lilly Wachowski","id":"nm0905152"},{"name":"Lana Wachowski","id":"nm0905154"}],"runtime":"132 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGY2OWI5ZjQtYjY0Zi00Y2M4LWEwMmMtOTJhODYxYTExNWZlL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1.jpg","countries":["France","USA"],"languages":["English","Dutch","Spanish"],"genres":["Action","Crime","Thriller"],"plot":"Robert Rath is a seasoned hitman who just wants out of the business with no back talk. But, as things go, it ain't so easy. A younger, peppier assassin named Bain is having a field day trying to kill said older assassin. Rath teams up with a computer hacker named Electra to defeat the obsessed Bain.","simplePlot":"Professional hit-man Robert Rath wants to fulfill a few more contracts before retiring but unscrupulous ambitious newcomer hit-man Miguel Bain keeps killing Rath's targets.","actors":[{"actorName":"Sylvester Stallone","urlProfile":"http://www.imdb.com/name/nm0000230","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTk3NDU2OV5BMl5BanBnXkFtZTcwNTA3MTI0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1946","placeOfBirth":" New York City, New York, USA","birthName":"Sylvester Gardenzio Stallone","height":"5' 9½\" (1.77 m)","bio":"This athletically built, dark-haired American actor/screenwriter/director may never be mentioned by old-school film critics in the same breath as, say, Richard Burton or Alec Guinness; however, movie fans worldwide have been flocking to see Stallone's films for over 30 years, making \"Sly\" one of Hollywood's biggest-ever box office draws. Sylvester Stallone was born on July 6, 1946, in New York's gritty Hell's Kitchen, to Jackie Stallone (née Labofish), an astrologer, and Frank Stallone, a beautician and hairdresser. His father was an Italian immigrant, and his mother's heritage is half French (from Brittany) and half German. The young Stallone attended the American College of Switzerland and the University of Miami, eventually obtaining a B.A. degree. Initially, he struggled in small parts in films such as the soft-core The Party at Kitty and Stud's (1970), the thriller Klute (1971) and the comedy Bananas (1971). He got a crucial career break alongside fellow young actor Henry Winkler, sharing lead billing in the effectively written teen gang film The Lords of Flatbush (1974). Further film and television roles followed, most of them in uninspiring productions except for the opportunity to play a megalomaniac, bloodthirsty race driver named \"Machine Gun Joe Viterbo\" in the Roger Corman-produced Death Race 2000 (1975). However, Stallone was also keen to be recognized as a screenwriter, not just an actor, and, inspired by the 1975 Muhammad Ali-Chuck Wepner fight in Cleveland, Stallone wrote a film script about a nobody fighter given the \"million to one opportunity\" to challenge for the heavyweight title. Rocky (1976) became the stuff of cinematic legends, scoring ten Academy Award nominations, winning the Best Picture Award of 1976 and triggering one of the most financially successful movie franchises in history! Whilst full credit is wholly deserved by Stallone, he was duly supported by tremendous acting from fellow cast members Talia Shire, Burgess Meredith and Burt Young, and director John G. Avildsen gave the film an emotive, earthy appeal from start to finish. Stallone had truly arrived on his terms, and offers poured in from various studios eager to secure Hollywood's hottest new star. Stallone followed Rocky (1976) with F.I.S.T. (1978), loosely based on the life of Teamsters boss \"Jimmy Hoffa\", and Paradise Alley (1978) before pulling on the boxing gloves again to resurrect Rocky Balboa in the sequel Rocky II (1979). The second outing for the \"Italian Stallion\" wasn't as powerful or successful as the first \"Rocky\"; however, it still produced strong box office. Subsequent films Nighthawks (1981) and Victory (1981) failed to ignite with audiences, so Stallone was once again lured back to familiar territory with Rocky III (1982) and a fearsome opponent in \"Clubber Lang\" played by muscular ex-bodyguard Mr. T. The third \"Rocky\" installment far outperformed the first sequel in box office takings, but Stallone retired his prizefighter for a couple of years as another mega-franchise was about to commence for the busy actor. The character of Green Beret \"John Rambo\" was the creation of Canadian-born writer David Morrell, and his novel was adapted to the screen with Stallone in the lead role in First Blood (1982), also starring Richard Crenna and Brian Dennehy. The movie was a surprise hit that polarized audiences because of its commentary about the Vietnam war, which was still relatively fresh in the American public's psyche. Political viewpoints aside, the film was a worldwide smash, and a sequel soon followed with Rambo: First Blood Part II (1985), which drew even stronger criticism from several quarters owing to the film's plotline about American MIAs allegedly being held in Vietnam. But they say there is no such thing as bad publicity, and \"John Rambo's\" second adventure was a major money spinner for Stallone and cemented him as one of the top male stars of the 1980s. Riding a wave of amazing popularity, Stallone called on old sparring partner Rocky Balboa to climb back into the ring to defend American pride against a Soviet threat in the form of a towering Russian boxer named \"Ivan Drago\" played by curt Dolph Lundgren in Rocky IV (1985). The fourth outing was somewhat controversial with \"Rocky\" fans, as violence levels seemed excessive compared to previous \"Rocky\" films, especially with the savage beating suffered by Apollo Creed, played by Carl Weathers, at the hands of the unstoppable \"Siberian Express\". Stallone continued forward with a slew of macho character-themed films that met with a mixed reception from his fans. Cobra (1986) was a clumsy mess, Over the Top (1987) was equally mediocre, Rambo III (1988) saw Rambo take on the Russians in Afghanistan, and cop buddy film Tango & Cash (1989) just did not quite hit the mark, although it did feature a top-notch cast and there was chemistry between Stallone and co-star Kurt Russell. Philadelphia's favorite mythical boxer moved out of the shadows for his fifth screen outing in Rocky V (1990) tackling Tommy \"Machine\" Gunn played by real-life heavyweight fighter Tommy Morrison, the great-nephew of screen legend John Wayne. Sly quickly followed with the lukewarm comedy Oscar (1991), the painfully unfunny Stop! Or My Mom Will Shoot (1992), the futuristic action film Demolition Man (1993), and the comic book-inspired Judge Dredd (1995). Interestingly, Stallone then took a departure from the gung-ho steely characters he had been portraying to stack on a few extra pounds and tackle a more dramatically challenging role in the intriguing Cop Land (1997), also starring Robert De Niro and Ray Liotta. It isn't a classic of the genre, but Cop Land (1997) certainly surprised many critics with Stallone's understated performance. Stallone then lent his vocal talents to the animated adventure story Antz (1998), reprised the role made famous by Michael Caine in a terrible remake of Get Carter (2000), climbed back into a race car for Driven (2001), and guest-starred as the \"Toymaker\" in the third chapter of the immensely popular \"Spy Kids\" film series, Spy Kids 3-D: Game Over (2003). Showing that age had not wearied his two most popular franchises, Stallone has most recently brought back never-say-die boxer Rocky Balboa to star in, well, what else but Rocky Balboa (2006), and Vietnam veteran Rambo (2008) will reappear after a 20-year hiatus to once again right wrongs in the jungles of Thailand. Love him or loathe him, Sylvester Stallone has built an enviable and highly respected career in Hollywood; plus, he has considerably influenced modern popular culture through several of his iconic film characters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTk3NDU2OV5BMl5BanBnXkFtZTcwNTA3MTI0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000230","name":"Sylvester Stallone","nicknames":["Sly","Michael","The Italian Stallion","Binky","Sly Stallone"],"idIMDB":"nm0000230"},"actorId":"nm0000230","character":"Robert Rath","urlCharacter":"http://www.imdb.com/character/ch0014235","main":true},{"actorName":"Antonio Banderas","urlProfile":"http://www.imdb.com/name/nm0000104","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyOTQ3NTYyNF5BMl5BanBnXkFtZTcwMTY2NjIzNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1960","placeOfBirth":" Málaga, Málaga, Andalucía, Spain","birthName":"José Antonio Domínguez Banderas","height":"5' 8½\" (1.74 m)","bio":"Antonio Banderas, one of Spain's most famous faces, was a soccer player until breaking his foot at the age of fourteen; he is now an international film star known for playing Zorro in the eponymous film series. He was born José Antonio Domínguez Banderas on August 10, 1960, in Málaga, Andalusia, Spain. His father, Jose Dominguez, was a policeman in the Spanish civil guards. His mother, Doña Ana Banderas Gallego, was a school teacher. Young Banderas was brought up a Roman Catholic. He wanted to play soccer professionally and made much success playing for his school team until the age of 14, albeit his dream ended when he broke his foot. At that time he developed a passion for theatre after seeing the stage production of 'Hair'. Banderas began his acting studies at the School of Dramatic Art in Málaga, and made his acting debut at a small theatre in Málaga. He was arrested by the Spanish police for performance in a play by Bertolt Brecht, because of political censorship under the rule of General Francisco Franco. Banderas spent a whole night at the police station, he had three or four such arrests while he was working with a small theatre troupe that toured all over Spain and was giving performances in small town theatres and on the street. In 1979, at the age of 19, he moved to Madrid in pursuit of an acting career. Being a struggling young actor, he also worked as a waiter and took small modeling jobs. At that time he joined the troupe at the National Theatre of Spain, becoming the youngest member of the company. Banderas's stage performances caught the attention of film director Pedro Almodóvar, who cast the young actor in his film debut Labyrinth of Passion (1982). Banderas and Almodovar joined forces in making innovative and sexually provocative movies during the 1980s. In 1984 Banderas made headlines in Spain with his performance as a gay man, making his first male-to-male on-screen kiss in Almodovar's La loi du désir (1987). Banderas's long and fruitful collaboration with Pedro Almodóvar eventually prepared him for international recognition that came with his work in the Academy Award-nominated film Women on the Verge of a Nervous Breakdown (1988). In 1991 he appeared as an object of Madonna's affection in Madonna: Truth or Dare (1991). In 1992 Banderas made his Hollywood debut with Les mambo kings (1992). Because he did not speak English at that time, his dialogue for the film was taught to him phonetically. Banderas shot to international fame with his sensitive performance as a lover of Tom Hanks' AIDS-infected lawyer in Philadelphia (1993), then played opposite Tom Cruise and Brad Pitt in Interview with the Vampire: The Vampire Chronicles (1994). Banderas further established himself as one of Hollywood's leading men after co-starring in Evita (1996) opposite Madonna in the title role. In 1998 he won acclaim for his portrayal of Zorro, opposite Anthony Hopkins and Catherine Zeta-Jones, in The Mask of Zorro (1998). For the role as Zorro Banderas took training with the Olympic national fencing team in Spain, and practiced his moves with real steel swords, then he used the lighter aluminum swords in the movie. He also took a month-long course of horse-riding before the filming. He later returned to the role in The Legend of Zorro (2005). In 1999 Banderas made his directorial debut in La tête dans le carton à chapeaux (1999), starring his wife, Melanie Griffith. He received critical acclaim for his portrayal of Mexican artist David Alfaro Siqueiros opposite Salma Hayek in Frida (2002). He voiced Puss in Boots in the Shrek franchise. Banderas established himself as internationally known Latin heartthrob with charismatic looks, and was chosen as one of the 50 most beautiful people in the world by the People magazine in 1996. He won numerous awards and nominations for his works in film, including three ALMA awards and three Golden Globe nominations, among many other. From 1996 to 2014, Banderas was married to American actress Melanie Griffith and the couple have one daughter Stella born in 1996. Outside of his acting profession, Banderas has been a passionate soccer fan and a staunch supporter of the Real Madrid Football Club. He shares time between his two residencies, one is in the United States, and one in the South of Spain.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyOTQ3NTYyNF5BMl5BanBnXkFtZTcwMTY2NjIzNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000104","name":"Antonio Banderas","idIMDB":"nm0000104"},"actorId":"nm0000104","character":"Miguel Bain","urlCharacter":"http://www.imdb.com/character/ch0014236","main":true},{"actorName":"Julianne Moore","urlProfile":"http://www.imdb.com/name/nm0000194","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDI1MjE2Ml5BMl5BanBnXkFtZTgwNDE0Nzk0MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 December 1960","placeOfBirth":" Fayetteville, North Carolina, USA","birthName":"Julie Anne Smith","height":"5' 3\" (1.6 m)","bio":"Julianne Moore was born Julie Anne Smith in Fort Bragg, North Carolina on December 3, 1960, the daughter of Anne (Love), a social worker, and Peter Moore Smith, a paratrooper, colonel, and later military judge. Her mother moved to the U.S. in 1951, from Greenock, Scotland. Her father, from Burlington, New Jersey, has German, Irish, German-Jewish, and English ancestry. Moore spent the early years of her life in over two dozen locations around the world with her parents, during her father's military career. She finally found her place at Boston University, where she earned her Bachelor of Fine Arts (B.F.A.) degree in acting from the School of the Performing Arts. After graduation (in 1983), She took the stage name \"Julianne Moore\" because there was another actress named \"Julie Anne Smith\". Julianne moved to New York and worked extensively in theater, including appearances off-Broadway in two Caryl Churchill plays, Serious Money and Ice Cream With Hot Fudge and as Ophelia in Hamlet at The Guthrie Theatre. But despite her formal training, Julianne fell into the attractive actress' trap of the mid-1980's: TV soaps and miniseries. She appeared briefly in the daytime serial The Edge of Night (1956) and from 1985 to 1988 she played two half-sisters Frannie and Sabrina on the soap As the World Turns (1956). This performance later led to an Outstanding Ingénue Daytime Emmy Award in 1988. Her subsequent appearances were in mostly forgettable TV-movies, such as Money, Power, Murder. (1989), The Last to Go (1991) and Cast a Deadly Spell (1991). She made her entrance into the big screen with 1990's Tales from the Darkside: The Movie (1990), where she played the victim of a mummy. Two years later, Julianne appeared in feature films with supporting parts in The Hand That Rocks the Cradle (1992) and the comedy The Gun in Betty Lou's Handbag (1992). She kept winning better and more powerful roles as time went on, including a small but memorable role as a doctor who spots Kimble Harrison Ford and attempts to thwart his escape in The Fugitive (1993). (A role that made such an impression on Steven Spielberg that he cast her in the Jurassic Park (1993) sequel without an audition in 1997). In one of Moore's most distinguished performances, she recapitulated her \"beguiling Yelena\" from Andre Gregory's workshop version of Chekhov's Uncle Vanya in Louis Malle's critically acclaimed Vanya on 42nd Street (1994). Director Todd Haynes gave Julianne her first opportunity to take on a lead role in Safe (1995). Her portrayal of Carol White, an affluent L.A. housewife who develops an inexplicable allergic reaction to her environment, won critical praise as well as an Independent Spirit Award nomination. Later that year she found her way into romantic comedy, co-starring as Hugh Grant's pregnant girlfriend in Nine Months (1995). Following films included Assassins (1995), where she played an electronics security expert targeted for death (next to Sylvester Stallone and Antonio Banderas) and Surviving Picasso (1996), where she played Dora Maar, one of the numerous lovers of Picasso (portrayed by her hero, Anthony Hopkins). A year later, after co-starring in Spielberg's The Lost World: Jurassic Park (1997), opposite Jeff Goldblum, a young and unknown director, Paul Thomas Anderson asked Julianne to appear in his movie, Boogie Nights (1997). Despite her misgivings, she finally was won over by the script and her decision to play the role of Amber Waves, a loving porn star who acts as a mother figure to a ragtag crew, proved to be a wise one, since she received both Golden Globe and Academy Award nominations. Julianne started 1998 by playing an erotic artist in The Big Lebowski (1998), continued with a small role in the social comedy Chicago Cab (1997) and ended with a subtle performance in Gus Van Sant's remake of Psycho (1960). 1999 had Moore as busy as an actress can be. She starred in a number of high-profile projects, beginning with Robert Altman's Cookie's Fortune (1999) , in which she was cast as the mentally challenged but adorable sister of a decidedly unhinged Glenn Close. A portrayal of the scheming Mrs. Cheveley followed in Oliver Parker's An Ideal Husband (1999) with a number of critics asserting that Moore was the best part of the movie. She then enjoyed another collaboration with director Anderson in Magnolia (1999) and continued with an outstanding performance in The End of the Affair (1999), for which she garnered another Oscar nomination. She ended 1999 with another great performance, that of a grieving mother in A Map of the World (1999), opposite Sigourney Weaver.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDI1MjE2Ml5BMl5BanBnXkFtZTgwNDE0Nzk0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000194","name":"Julianne Moore","nicknames":["Juli"],"idIMDB":"nm0000194"},"actorId":"nm0000194","character":"Electra","urlCharacter":"http://www.imdb.com/character/ch0058772","main":true},{"actorName":"Anatoli Davydov","urlProfile":"http://www.imdb.com/name/nm0205863","urlPhoto":"","biography":{"bio":"Anatoli Davydov is known for his work on Assassins (1995), The Hunt for Red October (1990) and Gorky Park (1983).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0205863","name":"Anatoli Davydov","idIMDB":"nm0205863"},"actorId":"nm0205863","character":"Nicolai Tashlinkov","urlCharacter":"http://www.imdb.com/character/ch0058780","main":true},{"actorName":"Muse Watson","urlProfile":"http://www.imdb.com/name/nm0002901","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjc4MzQ1OTEyNV5BMl5BanBnXkFtZTcwOTQyODU0Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 July 1948","placeOfBirth":" Alexandria, Louisiana, USA","birthName":"Robert Gravel","height":"6' 1\" (1.85 m)","bio":"Rugged character actor Muse Watson is an established stage actor and veteran screen performer with a host of widely varying characters to his name, ranging from the hook-wielding killer in \"I Know What You Did Last Summer\" (1997), to the gentle, cat-loving con in the Fox television suspense drama \"Prison Break\" (2005). From the good ole boy, Hank, in the Julia Roberts drama \"Something to Talk About\" to the quick to shoot mentor Mike Franks in \"NCIS\". Fifty five movies and over fifty five episodes of TV and Muse is going strong. His theater credits include Hamlet in \"Hamlet\", Stanley in \"A Streetcar Named Desire\", Pale in \"Burn This\", Cervantes in \"Man of La Mancha\", and directing \"Ain't MisBehavin\". Muse also gave an unforgettable performance with Jennifer Love Hewitt as a special guest on Saturday Night Live. Muse and his wife and daughter now divide their time between their home in Berea, Ky. and their \"hide-out\" in the foothills of the Smoky Mountains.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjc4MzQ1OTEyNV5BMl5BanBnXkFtZTcwOTQyODU0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002901","name":"Muse Watson","idIMDB":"nm0002901"},"actorId":"nm0002901","character":"Ketcham","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steve Kahan","urlProfile":"http://www.imdb.com/name/nm0434676","urlPhoto":"","biography":{"dateOfBirth":"1930","placeOfBirth":"","height":"6' 1½\" (1.87 m)","bio":"Kahan is the cousin of film writer, producer and director Richard Donner. Kahan may be best known for playing the bedraggled \"Captain Ed Murphy\" trying to keep Mel Gibson and Danny Glover in check in the \"Lethal Weapon\" series of films. He has appeared in several television series as recurring characters as well.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0434676","name":"Steve Kahan","idIMDB":"nm0434676"},"actorId":"nm0434676","character":"Alan Branch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kelly Rowan","urlProfile":"http://www.imdb.com/name/nm0746414","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwNjAzMDc2MV5BMl5BanBnXkFtZTgwMDc0NDA2MzE@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1965","placeOfBirth":" Ottawa, Ontario, Canada","height":"5' 7\" (1.7 m)","bio":"Kelly Rowan is best known for playing \"Kirsten Cohen\" on The O.C. (2003) for which she won a Prism award for best actress. She recently starred in and executive-produced The Good Times Are Killing Me (2009) with Rupert Graves. Her recent indie film credits include Jack and Jill vs. the World (2008) and Mount Pleasant (2006) (for which she was nominated for best supporting actress at the Vancouver Film Festival). She starred opposite Samuel L. Jackson in the Warner Bros./Mel Gibson- produced thriller One Eight Seven (1997). Other film credits include Assassins (1995) with Sylvester Stallone and Antonio Banderas and Hook (1991) for 'Steven Spielberg (I)'. Kelly seems to move effortlessly between the big and small screen. She starred in and executive-produced 8 jours pour mon fils (2006) and Au nom de ma fille (2007) (both nominated for Gemini awards for Best Television Movie in 2007). She also appeared in the first season of Boomtown (2002) for NBC, in addition to starring in The Truth About Jane (2000) with Stockard Channing, the mini-series A Girl Thing (2001) for Showtime, and the award-winning Anya's Bell (1999) for CBS. Kelly won critical acclaim and the Gemini Award for Best Actress in a Movie/Mini Series for her performance in the CBS movie Cauchemar en haute mer (1993) opposite Bruce Greenwood. Kelly also won a CTV International Achievement Award in 2005. When not on screen, Kelly is an active executive producer with her producing partner, Graham Ludlow. In 2007, they won a CFTPA indie award for outstanding independent producers for Au nom de ma fille (2007). They have also produced Soeurs de coeur (2007) for Lifetime and the CTV network.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwNjAzMDc2MV5BMl5BanBnXkFtZTgwMDc0NDA2MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0746414","name":"Kelly Rowan","idIMDB":"nm0746414"},"actorId":"nm0746414","character":"Jennifer, Electra's Neighbor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Reed Diamond","urlProfile":"http://www.imdb.com/name/nm0224703","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE0NjY4ODY1OF5BMl5BanBnXkFtZTcwNTY0MjM3Nw@@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 July 1967","placeOfBirth":" New York City, New York, USA","birthName":"Reed Edward Diamond","height":"6' 1\" (1.85 m)","bio":"Diamond was born and raised in New York City. He attended school at UNC-Chapel Hill and then went on to study acting at The Juilliard School in New York. His professional career began in 1990 with his co-starring role in the movie Memphis Belle (1990). Following that, he appeared on Broadway, and in many television movies, and guest-star roles on TV. He is probably best known for playing \"Detective Mike Kellerman\" on the critically acclaimed NBC television show Homicide: Life on the Street (1993). Diamond most recently guest-starred on television in, \"October Road,\" Ghost Whisperer (2005), Vanished (2006), Without a Trace (2002), Numb3rs (2005), Law & Order (1990), \"CSI\", Medium (2005), The West Wing (1999), Judging Amy (1999), Crossing Jordan (2001), and The Shield (2002). Some of his most notable movie credits include Good Night, and Good Luck. (2005), Spider-Man 2 (2004) and S.W.A.T. (2003). Diamond resides in Los Angeles with his wife, actress Marnie McPhail.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE0NjY4ODY1OF5BMl5BanBnXkFtZTcwNTY0MjM3Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0224703","name":"Reed Diamond","idIMDB":"nm0224703"},"actorId":"nm0224703","character":"Bob","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kai Wulff","urlProfile":"http://www.imdb.com/name/nm0943280","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNTE4Nzg3NF5BMl5BanBnXkFtZTgwMzA5MDQ2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"Kai Wulff is known for his work on General Hospital (1963), Assassins (1995) and ¡Three Amigos! (1986).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNTE4Nzg3NF5BMl5BanBnXkFtZTgwMzA5MDQ2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0943280","name":"Kai Wulff","idIMDB":"nm0943280"},"actorId":"nm0943280","character":"Remy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kerry Skalsky","urlProfile":"http://www.imdb.com/name/nm0803828","urlPhoto":"","biography":{"bio":"Kerry Skalsky is known for her work on Assassins (1995), Darkdrive (1997) and The X-Files Game (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0803828","name":"Kerry Skalsky","idIMDB":"nm0803828"},"actorId":"nm0803828","character":"Buyer with Remy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Douglas Haskins","urlProfile":"http://www.imdb.com/name/nm0368178","urlPhoto":"","biography":{"bio":"James Douglas Haskins is an actor, known for Assassins (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0368178","name":"James Douglas Haskins","idIMDB":"nm0368178"},"actorId":"nm0368178","character":"Buyer with Remy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Liska","urlProfile":"http://www.imdb.com/name/nm0514093","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNjY3OTk0NF5BMl5BanBnXkFtZTcwMjU5MzY2Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Stephen Liska is an actor, known for Assassins (1995), Beverly Hills Cop II (1987) and Star Trek III: The Search for Spock (1984).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNjY3OTk0NF5BMl5BanBnXkFtZTcwMjU5MzY2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0514093","name":"Stephen Liska","idIMDB":"nm0514093"},"actorId":"nm0514093","character":"Cop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Harms","urlProfile":"http://www.imdb.com/name/nm0363594","urlPhoto":"","biography":{"bio":"John Harms is an actor and producer, known for Assassins (1995), Lethal Weapon 3 (1992) and Lethal Weapon 4 (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0363594","name":"John Harms","idIMDB":"nm0363594"},"actorId":"nm0363594","character":"Cop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edward J. Rosen","urlProfile":"http://www.imdb.com/name/nm0741959","urlPhoto":"","biography":{"bio":"Edward J. Rosen is known for his work on Constantine (2005), Assassins (1995) and Lethal Weapon 2 (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0741959","name":"Edward J. Rosen","idIMDB":"nm0741959"},"actorId":"nm0741959","character":"Cemetery Caretaker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christina Orchid","urlProfile":"http://www.imdb.com/name/nm0649454","urlPhoto":"","biography":{"bio":"Christina Orchid is an actress, known for Assassins (1995), Lethal Weapon 4 (1998) and Sauvez Willy 2 (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0649454","name":"Christina Orchid","idIMDB":"nm0649454"},"actorId":"nm0649454","character":"Dowager","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0112401","urlIMDB":"http://www.imdb.com/title/tt0112401","business":{"budget":{"money":"$50,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1995/\">1995</a>"},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1995/\">1995</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 12 min (132 min)"],"soundMix":["SDDS","Dolby Digital"],"color":["Black and White","Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Panaflex Gold II, Panavision Primo Lenses","Panavision Panastar, Panavision Primo Lenses"],"laboratory":["Alpha Cine Labs, Seattle (WA), USA","Technicolor, Hollywood (CA), USA (prints)"],"filmLength":["3,637 m (Sweden)","3,597 m"],"negativeFormat":["35 mm (also horizontal) (Eastman EXR 50D 5245, EXR 500T 5298)"],"cinematographicProcess":["Spherical","VistaVision (visual effects)"],"printedFilmFormat":["35 mm"]},"rating":"6.3","filmingLocations":[{"location":"Casino de Puerto Rico, Avenida Juan Ponce De León, San Juan, Puerto Rico"}],"rated":"R","awards":[{"award":"Razzie Awards 1996","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Actor","names":[{"name":"Sylvester Stallone","id":"nm0000230","role":null},{"name":"Judge Dredd","id":"tt0113492","role":null}]}]}]},{"award":"The Stinkers Bad Movie Awards 1995","titlesAwards":[{"titleAwardOutcome":"Won Stinker Award","categories":[{"category":"Worst Actor","names":[{"name":"Sylvester Stallone","id":"nm0000230","role":null},{"name":"Judge Dredd","id":"tt0113492","role":null}]}]}]}],"votes":"65,467","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."},{"idCompany":"co0019968","name":"Silver Pictures"},{"idCompany":"co0116435","name":"Donner/Shuler-Donner Productions"}],"keywords":{"keywords":["rival","assassin","modem","russian","floppy disk","thief","hitman","computer","apple macintosh computer","internet","shot in the chest","gun with silencer","deception","cat and mouse","sociopath","sadist","neo noir","warrior","one man army","anti hero","pistol","machismo","death","crisis of conscience","damsel in distress","rescue","apartment","abandoned hotel","e mail","1990s","explosion","sniper rifle","black pantyhose","female stockinged legs","pantyhose","gun violence","gunslinger","hotel fight","opening action scene","suspense","mexican standoff","stylized violence","gun fu","dual wield","action hero","hero","woman with gun","woman with a gun","white bitch","vulnerable","vulnerability","voyeuristic","voyeurism","voyeur","vandalism","vandal","turning the tables","right to privacy","redheaded woman","radio controlled toy","predator turns victim","political propaganda","propaganda","pro choice","privacy","preachy","perverted","pervert","national rifle association","misanthropy","left wing politics","left wing","killers","killer vs killer","invasion of privacy","hypocrisy","home invasion","hidden camera","ginger","female thief","female impersonator","female impersonation","female criminal","evil woman","evil versus evil","evil man","defenselessness","day of the dead","cat lover","cat lady","bitch","assassination attempt","assassination","anti fur","animal in cast credits","one word title","violence","paranoia","kidnapping","thick accent","suit","suicide","silencer","shootout","seattle washington","rivalry","revenge","psychopath","police officer killed","police chase","one last job","murder","motel","money transfer","mexico","mercilessness","loss of friend","instant messaging","held at gunpoint","gas explosion","falling from height","faked death","escape from custody","double cross","detroit michigan","contract killer","carjacking","bulletproof vest","bulletproof glass","bank account","arm in cast","villain turns good","hotel","cemetery","bank","maine coon cat","woman in jeopardy","tough guy","on the run","love","hired killer","enemy","competition","bad guy","assassination plot","west indies","monorail","cat","caribbean","gun","diskette","computer cracker","chase","sniper","interpol","gunman","policewoman killing","cia","helicopter","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 16:15:09"}}