{"data":{"movies":[{"title":"Slow Burn","originalTitle":"","year":"2000","releaseDate":"20000912","directors":[{"name":"Christian Ford","id":"nm0285557"}],"writers":[{"name":"Christian Ford","id":"nm0285557"},{"name":"Roger Soffer","id":"nm0812143"}],"runtime":"97 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MjYzMzgzMF5BMl5BanBnXkFtZTcwNDg1NzgxMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Thriller"],"plot":"Two Americans, with their young daughter Trina, live in the northern Mexican desert, searching for family diamonds lost years before. Jump ahead, Trina's parents are mysteriously dead, and Trina, now grown, continues the search against the advice of Frank, an old family friend. Two gringo convicts, recently escaped from the Matamoros prison and headed for Texas, stumble upon the diamonds then find Trina and ask her for a ride. She realizes they've found the diamonds, keeps that from them, and tries to spirit the diamonds away. Various alliances form and break, one of the convicts tries to convince her to abandon her quest, and Frank watches from a distance.","simplePlot":"A distinguished explorer finds herself stranded in the Mexican desert with two escaped convicts and a stash of diamonds.","actors":[{"actorName":"Jennifer Ann Evans","urlProfile":"http://www.imdb.com/name/nm0262876","urlPhoto":"","biography":{"bio":"Jennifer Ann Evans is an actress, known for Slow Burn (2000), Scream of the Bikini (2009) and Repose (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0262876","name":"Jennifer Ann Evans","idIMDB":"nm0262876"},"actorId":"nm0262876","character":"Paulina McTeague","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stuart Wilson","urlProfile":"http://www.imdb.com/name/nm0934179","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NDQ2NTAwMV5BMl5BanBnXkFtZTYwMjk0MTI3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1946","placeOfBirth":" Guildford, Surrey, England, UK","birthName":"Stuart Conan Wilson","height":"6' (1.83 m)","bio":"Stuart Wilson was born in Guildford, Surrey in England, on December 25th, 1946. He went to thirteen different schools, as his father worked in the RAF and traveled around the world. After the RAF, his father worked as an engineer in the copper mines in Rhodesia. Stuart moved to London in the mid- Sixties and trained at RADA. After RADA, he began working in repertory in Liverpool and at the RSC. His career took off when he played \"Johann Strauss, Jr.\" in the The Strauss Family (1972), in which his character aged from 14 to 74. He continued to have a successful television career, playing various roles, including \"Vronsky\" in Anna Karenina (1977) and \"Major Jimmy Clarke\" in The Jewel in the Crown (1984). In the late 1980s, Stuart moved to Hollywood, where he landed roles in The Age of Innocence (1993) with Martin Scorsese, Lethal Weapon 3 (1992) and Roman Polanski's Death and the Maiden (1994). Stuart Wilson occasionally returns to the London stage and, in 2002, played \"Antony\" in \"Antony and Cleopatra\" at the RSC.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NDQ2NTAwMV5BMl5BanBnXkFtZTYwMjk0MTI3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0934179","name":"Stuart Wilson","idIMDB":"nm0934179"},"actorId":"nm0934179","character":"Frank Norris","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicole Fellows","urlProfile":"http://www.imdb.com/name/nm0271521","urlPhoto":"","biography":{"bio":"Nicole Fellows is an actress, known for Alien: Resurrection (1997), Slow Burn (2000) and Mad City (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0271521","name":"Nicole Fellows","idIMDB":"nm0271521"},"actorId":"nm0271521","character":"Trina, 11 Years","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Caprice Benedetti","urlProfile":"http://www.imdb.com/name/nm0070691","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyNjY5MDMzM15BMl5BanBnXkFtZTYwMDg2MjEz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"August1965","placeOfBirth":" Seattle, Washington, USA","height":"5' 10\" (1.78 m)","bio":"Caprice Benedetti was born in August 1965 in Seattle, Washington, USA. She is an actress, known for The Devil's Advocate (1997), Hitch (2005) and Practical Magic (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyNjY5MDMzM15BMl5BanBnXkFtZTYwMDg2MjEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0070691","name":"Caprice Benedetti","idIMDB":"nm0070691"},"actorId":"nm0070691","character":"Catalina McTeague","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Mulkey","urlProfile":"http://www.imdb.com/name/nm0611889","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzIyNjg1Ml5BMl5BanBnXkFtZTgwNzE2MzAyNjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 May 1948","placeOfBirth":" Viroqua, Wisconsin, USA","birthName":"Christian Homer Mulkey Jr.","height":"6' 1\" (1.85 m)","bio":"Chris Mulkey was born on May 3, 1948 in Viroqua, Wisconsin, USA as Christian Homer Mulkey Jr. He is an actor and producer, known for Whiplash (2014), Captain Phillips (2013) and First Blood (1982). He was previously married to Karen Landry and Lorraine M Smith.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzIyNjg1Ml5BMl5BanBnXkFtZTgwNzE2MzAyNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0611889","name":"Chris Mulkey","idIMDB":"nm0611889"},"actorId":"nm0611889","character":"Jacob McTeague","urlCharacter":"http://www.imdb.com/character/ch0093150","main":true},{"actorName":"Minnie Driver","urlProfile":"http://www.imdb.com/name/nm0000378","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0OTUxNDg1NV5BMl5BanBnXkFtZTcwODczMzc5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 January 1970","placeOfBirth":" Middlesex Hospital, London, England, UK","birthName":"Amelia Fiona J. Driver","height":"5' 10\" (1.78 m)","bio":"Amelia Fiona J. Driver was born January 31, 1970 in Finsbury Park, London. Her mother, Gaynor Churchward (née Millington), was a designer and former couture model, and her father, Charles Ronald \"Ronnie\" Driver, was a businessman. She has a sister, Kate Driver, who is a model and a producer. Minnie's mother was her father's mistress. Minnie's father's wife did not know about his second family. Her father was born in Swansea, Wales, of English, Scottish, and Irish descent, and her mother is English. Minnie was raised partly in Barbados. Her first major role was in the film Le cercle des amies (1995)opposite Chris O'Donnell and Colin Firth. In the next few years she had roles in films such has GoldenEye (1995), Sleepers (1996) and Grosse Pointe Blank (1997). In 1997 she starred in the popular and financially successful film Good Will Hunting (1997) opposite Matt Damon and Ben Affleck, who also wrote the screenplay for the film and received Oscars for their achievement. The film also earned Minnie an Oscar nomination for best actress in a supporting role. She had a noted recurring role on Will & Grace (1998) in 2003-2004 and also appeared in films such as An Ideal Husband (1999), Return to Me (2000), Mister Cash (2003), Ella Enchanted (2004), The Phantom of the Opera (2004), Delirious (2006) and Take (2007). She starred in the popular Tv-series The Riches (2007) opposite Eddie Izzard. She now stars in the NBC sitcom, \"About a Boy\" (2014) Minnie has been romantically linked with several of her co-stars, including Matt Damon and John Cusack. She was engaged to marry Josh Brolin before they broke up suddenly in 2001. In the last few years she has kept her private life, private. On March 13, 2008, during an appearance on The Tonight Show with Jay Leno (1992), she announced that she was expecting her first child. On September 5, 2008, she gave birth to a boy named Henry Story Driver. The name of the baby's father has not been revealed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0OTUxNDg1NV5BMl5BanBnXkFtZTcwODczMzc5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000378","name":"Minnie Driver","idIMDB":"nm0000378"},"actorId":"nm0000378","character":"Trina McTeague","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Spader","urlProfile":"http://www.imdb.com/name/nm0000652","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MTQ5NjY5Ml5BMl5BanBnXkFtZTgwMTY0NzU5MDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 February 1960","placeOfBirth":" Boston, Massachusetts, USA","birthName":"James Todd Spader","height":"5' 10\" (1.78 m)","bio":"James Todd Spader was born on February 7, 1960 in Boston, Massachusetts, the son of teachers Jean (Fraser) and Stoddard Greenwood \"Todd\" Spader. He attended Phillips Academy in Andover with director Peter Sellars; he dropped out in eleventh grade. He bused tables, shoveled manure, and taught yoga before landing his first roles. Spader's first major film role was as Brooke Shields' brother in the romance drama Endless Love (1981). Spader graduated from television movies to Brat Pack films, playing the scoundrel. In Sex, Lies, and Videotape (1989), he played a sexual voyeur who complicates the lives of three Baton Rouge residents. This performance earned him the Best Actor award at the Cannes Film Festival and led to bigger and more varied roles. His best known role is the colorful attorney Alan Shore on the David E. Kelley television series The Practice (1997) and its spin-off Boston Legal (2004). He won 3 prime time Emmy Awards in the Best Actor, Drama category for playing the same character Alan Shore in two different television series 'The Practice' and 'Boston Legal' out of the 4 nominations he received for the same between the years 2004-2008. He also received a Golden Globe and several Screen Actor Guild Award Best Actor nominations for reprising this role.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MTQ5NjY5Ml5BMl5BanBnXkFtZTgwMTY0NzU5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000652","name":"James Spader","nicknames":["Jimmy"],"idIMDB":"nm0000652"},"actorId":"nm0000652","character":"Marcus","urlCharacter":"http://www.imdb.com/character/ch0415167","main":true},{"actorName":"Josh Brolin","urlProfile":"http://www.imdb.com/name/nm0000982","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MzYyMjQ0Nl5BMl5BanBnXkFtZTcwMTA0ODkyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1968","placeOfBirth":" Santa Monica, California, USA","birthName":"Josh J. Brolin","height":"5' 10½\" (1.79 m)","bio":"Rugged features and a natural charm have worked for Josh Brolin, the son of actor James Brolin. He has recently seen a massive surge in his career, finding well-known roles such as a policeman, a hunter, and the President of the United States. Brolin was born February 12, 1968 in Santa Monica, California, to Jane Cameron (Agee), a Texas-born wildlife activist, and James Brolin. Josh was initially against the lifestyle of the entertainment business, in light of his parents' divorce, and both of them being actors. However, during junior year in high school, he took an acting class to see what it was like and played Stanley in \"A Streetcar Named Desire\" and became hooked. His first major screen role was as the older brother in the film The Goonies (1985), based on a story by Steven Spielberg. He then immediately moved on to work on television, taking roles on such series as Alien Private Eye (1988) and The Young Riders (1989). \"Private Eye\" was a chance for Brolin to play a detective. \"The Young Riders\" was set just before the Civil War, and was co-directed by Brolin's father, James Brolin. After The Young Riders (1989), Brolin moved back to the big screen, with mediocre success. He played a supporting role in The Road Killers (1994), but the film was not a success. He followed up with the crime film Gang in Blue (1996), the romantic film Bed of Roses (1996), the thriller film Nightwatch (1997), and appeared with his father in My Brother's War (1997). However, nothing truly stuck out, especially not the box office flop The Mod Squad (1999). The 2000s initially brought no significant change in Brolin's career. He appeared in the independent film Slow Burn (2000), the sci-if thriller Hollow Man (2000) and starred on the television series Mister Sterling (2003). In 2004, he married actress Diane Lane and are still together. It was not until 2007 that Brolin received much acclaim for his films. He took a supporting role in the Quentin Tarantino-written Grindhouse (2007) which was a two-part film accounting two horror stories. He also played two policemen that year: a corrupt officer \"Trupo\" in the crime epic American Gangster (2007), and an honest police chief in the emotional drama In the Valley of Elah (2007) which starred Tommy Lee Jones and was directed by Paul Haggis. However, it was his involvement in No Country for Old Men (2007) that truly pushed him into the limelight. The film, directed by the Coen brothers, was about a man (Brolin) who finds a satchel containing two million dollars in cash. He is pursued by an unstoppable assassin (Javier Bardem, who won an Oscar for his work) and his friend, a local sheriff (Tommy Lee Jones). The film won four Oscars, including Best Picture and Best Director. Brolin found high-profile work the next year, being cast as \"Supervisor Dan White\" in the film Milk (2008). His performance as the weak and bitter politician earned him an Oscar nomination, and Brolin received more praise for his fascinating portrayal of George W. Bush in the Oliver Stone film W. (2008). Despite the mediocre success of W. (2008), he was recognized as the best part of the film, and Milk (2008) was another triumph, critically and commercially. Brolin then acted in the smaller comedy Women in Trouble (2009) before landing a number of large roles in 2010. The first of these was the film based on the comic book figure Jonah Hex (2010). The film was a box office flop and critically panned, but Brolin also forged a second collaboration with legendary director Oliver Stone for Wall Street: Money Never Sleeps (2010). Brolin played a large role alongside such young stars as Carey Mulligan and Shia LaBeouf, and older thespians such as Michael Douglas, Eli Wallach, and Frank Langella. Brolin's character was Bretton James, a top banker in the film, and also the film's chief antagonist. Brolin also appeared in Woody Allen's London-based film You Will Meet a Tall Dark Stranger (2010) and a second collaboration with the Coen Brothers, which was a remake of True Grit (1969). Despite his earlier mediocre success and fame, Brolin has maintained a choosiness in his films and, recently, these choices have paid off profoundly. Hopefully, he continues this streak of good fortune that his talents have finally given him.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MzYyMjQ0Nl5BMl5BanBnXkFtZTcwMTA0ODkyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000982","name":"Josh Brolin","idIMDB":"nm0000982"},"actorId":"nm0000982","character":"Duster","urlCharacter":"http://www.imdb.com/character/ch0078694","main":true}],"seasons":[],"idIMDB":"tt0165477","urlIMDB":"http://www.imdb.com/title/tt0165477","business":{"budget":{"money":"$10,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"copyright MCMXCVIX Last Canteen, Inc."},"technical":{"runtime":["1 hr 37 min (97 min)"],"soundMix":null,"color":["Black and White","Color"],"aspectRatio":["1.37 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["35 mm (Eastman Kodak)"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"5.1","filmingLocations":[{"location":"Santa Clarita, California, USA"}],"rated":"R","awards":[{"award":"DVD Exclusive Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated Video Premiere Award","categories":[{"category":"Best Cinematography","names":[{"name":"Mark Vicente","id":"nm0895917","role":null}]}]}]}],"votes":"581","type":"Video","companyCreditsSimple":[{"idCompany":"co0069593","name":"Morlaw Films"},{"idCompany":"co0042650","name":"Blue Rider Pictures"},{"idCompany":"co0034161","name":"Two Drivers Productions Company"}],"keywords":{"keywords":["diamond","convict","desert","search","thirst","tent","breasts","little girl","nudity","compass","map","chest","treasure","scorpion","petroglyph","betrayal","scoped rifle","chained","burial","mother daughter relationship","gunfight","skeleton","murder","lust","pistol","desolation","on the run","shot to death","greed","escape","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 06:21:40"}}