{"data":{"movies":[{"title":"Father of the Bride Part II","originalTitle":"","year":"1995","releaseDate":"19951208","directors":[{"name":"Charles Shyer","id":"nm0796124"}],"writers":[{"name":"Albert Hackett","id":"nm0352443"},{"name":"Frances Goodrich","id":"nm0329304"}],"runtime":"106 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTEyNzg5NjYtNDU4OS00MWYxLWJhMTItYWU4NTkyNDBmM2Y0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Family","Romance"],"plot":"In this sequel to \"Father of the Bride\", George Banks must accept the reality of what his daughter's ascension from daughter to wife, and now, to mother means when placed into perspective against his own stage of life. As the comfortable family unit starts to unravel in his mind, a rapid progression into mid-life crisis is in his future. His journey to regain his youth acts as a catalyst for a kind of \"rebirth\" of his attitude on life when he and his wife, Nina, find how their lives are about to change as well.","simplePlot":"George Banks must deal not only with the pregnancy of his daughter, but also with the unexpected pregnancy of his wife.","actors":[{"actorName":"Steve Martin","urlProfile":"http://www.imdb.com/name/nm0000188","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY0ODYwNDM3OV5BMl5BanBnXkFtZTcwMTc3NjQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 August 1945","placeOfBirth":" Waco, Texas, USA","birthName":"Stephen Glenn Martin","height":"6' (1.83 m)","bio":"Steve Martin was born on August 14, 1945 in Waco, Texas, USA as Stephen Glenn Martin to Mary Lee (née Stewart; 1913-2002) and Glenn Vernon Martin (1914-1997), a real estate salesman and aspiring actor. He was raised in Inglewood and Garden Grove in California. In 1960, he got a job at the Magic shop of Disney's Fantasyland, and while there he learned magic, juggling, and creating balloon animals. At Santa Ana College, he took classes in drama and English poetry. He also took part in comedies and other productions at the Bird Cage Theatre, and joined a comedy troupe at Knott's Berry Farm. He attended California State University as a philosophy major, but in 1967 transferred to UCLA as a theatre major. His writing career began on The Smothers Brothers Comedy Hour (1967), winning him an Emmy Award. Between 1967 and 1973, he also wrote for many other shows, including The Glen Campbell Goodtime Hour (1969) and The Sonny and Cher Comedy Hour (1971). He also appeared on talk shows and comedy shows in the late 1960s and early 1970s. In 1972, he first appeared on The Tonight Show Starring Johnny Carson (1962), doing stand-up several times each year, and even guest hosting a few years later. In 1976, he served for the first time as guest-host on Saturday Night Live (1975). By 2016, he has guest-hosted 15 times, which is one less than Alec Baldwin's record, and also appeared 12 other times on SNL. In 1977, he released his first comedy album, a platinum selling \"Let's Get Small\". He followed it with \"A Wild and Crazy Guy\" (1978), which sold more than a million copies. Both albums went on to win Grammys for Best Comedy Recording. This is when he performed in arenas in front of tens of thousands of people, and begun his movie career, which was always his goal. His first major role was in the short film, The Absent-Minded Waiter (1977), which he also wrote. His star value was established in The Jerk (1979), which was co-written by Martin, and directed by Carl Reiner. The film earned more than $100 million on a $4 million budget. He also starred in Dead Men Don't Wear Plaid (1982), The Man with Two Brains (1983), and All of Me (1984), all directed by Reiner. To avoid being typecast as a comedian, he wanted do more dramatic roles, starring in Pennies from Heaven (1981), a film remake of Dennis Potter's 1978 series. Unfortunately, it was a financial failure. He also starred in John Landis's ¡Three Amigos! (1986), co-written by himself, opposite Martin Short and Chevy Chase. That year, he also appeared in the musical horror comedy, Little Shop of Horrors (1986) opposite Rick Moranis. Next year, he starred in Roxanne (1987), co-written by himself, and in John Hughes' Planes, Trains & Automobiles (1987), opposite John Candy. His other films include Parenthood (1989) and My Blue Heaven (1990), both opposite Moranis. In 1991, he wrote and starred in L.A. Story (1991), about a weatherman who searches meaning in his life and love in Los Angeles. It also starred his then-wife, Victoria Tennant. Same year, Father of the Bride (1991) was so successful that a 1995 sequel followed. During the 1990s, he continued to play more dramatic roles, in Grand Canyon (1991), playing a traumatized movie producer, in Leap of Faith (1992), playing a fake faith healer, in A Simple Twist of Fate (1994), playing a betrayed man adopting a baby, and in David Mamet's thriller The Spanish Prisoner (1997). Other, more comedic roles include in HouseSitter (1992) and The Out-of-Towners (1999), opposite Goldie Hawn, in Nora Ephron's Mixed Nuts (1994), and in Bowfinger (1999), written by himself and co-starring Eddie Murphy. After Bowfinger, he starred in Bringing Down the House (2003) and Cheaper by the Dozen (2003), both earning more than $130 million. He wrote and starred in Shopgirl (2005), and appeared in the sequel of Cheaper by the Dozen. After them, he appeared in The Pink Panther (2006) and The Pink Panther 2 (2009), which he both co-wrote, as Inspector Clouseau. He continues to do movies, more recently appearing in The Big Year (2011), Home (2015), and Love the Coopers (2015). Besides aforementioned, he has been an avid art collector since 1968, written plays, written for The New Yorker, written a well-received memoir (Born Standing Up), written a novel (An Object of Beauty; 2010), hosted the Academy Awards three times, released a Grammy award winning music album (The Crow: New Songs for the 5-String Banjo; 2009), and another album (Love Has Come For You; 2013) with Edie Brickell. Since 2007, he has been married to Anne Stringfield, with whom he has a daughter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY0ODYwNDM3OV5BMl5BanBnXkFtZTcwMTc3NjQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000188","name":"Steve Martin","idIMDB":"nm0000188"},"actorId":"nm0000188","character":"George Banks","urlCharacter":"http://www.imdb.com/character/ch0010834","main":true},{"actorName":"Diane Keaton","urlProfile":"http://www.imdb.com/name/nm0000473","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU5NjMwOTk2NV5BMl5BanBnXkFtZTYwODg1NzY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1946","placeOfBirth":" Los Angeles, California, USA","birthName":"Diane Hall","height":"5' 6½\" (1.69 m)","bio":"Diane Keaton was born Diane Hall in Los Angeles, California, to Dorothy Deanne (Keaton), an amateur photographer, and John Newton Ignatius \"Jack\" Hall, a civil engineer and real estate broker. Her ancestry includes Irish, English, German, and Scottish. Keaton studied Drama at Santa Ana College before dropping out to study at the Neighborhood Playhouse in New York. After appearing in summer stock for several months, she got her first major stage role in the Broadway rock musical \"Hair.\" As understudy to the lead, she gained attention by not removing any of her clothing. In 1970, Woody Allen cast her in his Broadway play \"Play It Again, Sam,\" which had a successful run. It was during this time that she became involved with Allen and appeared in a number of his films. The first one was Play It Again, Sam (1972), the screen adaptation of the stage play. That same year Francis Ford Coppola cast her as Kay in the Oscar-winning The Godfather (1972), and she was on her way to stardom. She reprized that role in the film's first sequel, The Godfather: Part II (1974). She then appeared with Allen again in Sleeper (1973) and Love and Death (1975). In 1977 she broke away from her comedy image to appear in the chilling Looking for Mr. Goodbar (1977), which won her a Golden Globe nomination. It was the same year that she appeared in what many regard as her best performance, in the title role of Annie Hall (1977), which Allen wrote specifically for her (her real last name is Hall, and her nickname is Annie), and what an impact she made. She won the Oscar and the British Award for Best Actress, and Allen won the Directors Award from the DGA. She started a fashion trend with her unisex clothes and was the poster girl for a lot of young males. Her mannerisms and awkward speech became almost a national craze. The question being asked, though, was, \"Is she just a lightweight playing herself, or is there more depth to her personality?\" For whatever reason, she appeared in but one film a year for the next two years and those films were by Allen. When they broke up she was next involved with Warren Beatty and appeared in his film Reds (1981), as the bohemian female journalist Louise Bryant. For her performance she received nominations for the Academy Award and the Golden Globe. For the rest of the 1980s she appeared infrequently in films but won nominations in three of them. Attempting to break the typecasting she had fallen into, she took on the role of a confused, somewhat naive woman who becomes the tool of Middle Eastern terrorists in The Little Drummer Girl (1984). To offset her lack of movie work, Diane began directing. She directed the documentary Heaven (1987), as well as some music videos. For television she directed an episode of the popular, but strange, Twin Peaks (1990). In the 1990s she began to get more mature roles, though she reprized the role of Kay Corleone in the third \"Godfather\" epic, The Godfather: Part III (1990). She appeared as the wife of Steve Martin in the hit Father of the Bride (1991) and again in Father of the Bride Part II (1995). In 1993 she once again teamed with Woody Allen in Manhattan Murder Mystery (1993), which was well received. In 1995 she received high marks for Unstrung Heroes (1995), her first major feature as a director.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU5NjMwOTk2NV5BMl5BanBnXkFtZTYwODg1NzY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000473","name":"Diane Keaton","nicknames":["Annie"],"idIMDB":"nm0000473"},"actorId":"nm0000473","character":"Nina Banks","urlCharacter":"http://www.imdb.com/character/ch0010835","main":true},{"actorName":"Martin Short","urlProfile":"http://www.imdb.com/name/nm0001737","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MDIyMDY1N15BMl5BanBnXkFtZTgwNzMzMDE5NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1950","placeOfBirth":" Hamilton, Ontario, Canada","birthName":"Martin Hayter Short","height":"5' 8\" (1.73 m)","bio":"Martin Short was born on March 26, 1950 in Hamilton, Ontario, Canada as Martin Hayter Short. He is an actor and writer, known for The Martin Short Show (1999), Frankenweenie (2012) and Mars Attacks! (1996). He was previously married to Nancy Dolman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MDIyMDY1N15BMl5BanBnXkFtZTgwNzMzMDE5NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001737","name":"Martin Short","nicknames":["Marty","Shorty"],"idIMDB":"nm0001737"},"actorId":"nm0001737","character":"Franck Eggelhoffer","urlCharacter":"http://www.imdb.com/character/ch0010839","main":true},{"actorName":"Kimberly Williams-Paisley","urlProfile":"http://www.imdb.com/name/nm0931090","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMzQxOTQzM15BMl5BanBnXkFtZTcwMjk5OTUxNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1971","placeOfBirth":" Rye, New York, USA","birthName":"Kimberly Payne Williams","height":"5' 5\" (1.65 m)","bio":"Kimberly Williams-Paisley was born on September 14, 1971 in Rye, New York, USA as Kimberly Payne Williams. She is an actress and director, known for According to Jim (2001), Father of the Bride (1991) and Father of the Bride Part II (1995). She has been married to Brad Paisley since March 15, 2003. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMzQxOTQzM15BMl5BanBnXkFtZTcwMjk5OTUxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0931090","name":"Kimberly Williams-Paisley","nicknames":["Kim"],"idIMDB":"nm0931090"},"actorId":"nm0931090","character":"Annie Banks-MacKenzie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Newbern","urlProfile":"http://www.imdb.com/name/nm0627624","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzc3NjczOTg4NV5BMl5BanBnXkFtZTgwODk3MDI5MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 December 1964","placeOfBirth":" Little Rock, Arkansas, USA","birthName":"George Young Newbern","height":"5' 10½\" (1.79 m)","bio":"George Newbern was born on December 30, 1964 in Little Rock, Arkansas, USA as George Young Newbern. He is an actor, known for Scandal (2012), Father of the Bride (1991) and Father of the Bride Part II (1995). He has been married to Marietta DePrima since 1990. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzc3NjczOTg4NV5BMl5BanBnXkFtZTgwODk3MDI5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0627624","name":"George Newbern","idIMDB":"nm0627624"},"actorId":"nm0627624","character":"Bryan MacKenzie","urlCharacter":"http://www.imdb.com/character/ch0010840","main":true},{"actorName":"Kieran Culkin","urlProfile":"http://www.imdb.com/name/nm0001085","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzODUyMTU5M15BMl5BanBnXkFtZTcwNTQ0ODk2Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1982","placeOfBirth":" New York City, New York, USA","birthName":"Kieran Kyle Culkin","height":"5' 5½\" (1.66 m)","bio":"Kieran Kyle Culkin was born September 30, 1982 in New York City, New York. He is the son of Christopher Culkin, a former stage and child actor, and Patricia Brentrup. He is the brother of Shane Culkin, Dakota Culkin, Macaulay Culkin, Quinn Culkin, Christian Culkin, and Rory Culkin. His mother, who is from North Dakota, is of German and Norwegian descent. His father, from Manhattan, has Irish, German, English, Swiss-German, and French ancestry. Culkin started working in 1990. He worked with his brother, Mac several times. His debut was playing Mac's cousin, Fuller, in Home Alone (1990). He went on to do lots of films on his own. He starred in Father of the Bride (1991) playing Steve Martin's young son. Then a few years later they offered him a special role in The Mighty (1998). After his wonderful performance, he went on to bigger movies like The Cider House Rules (1999) and Music of the Heart (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzODUyMTU5M15BMl5BanBnXkFtZTcwNTQ0ODk2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001085","name":"Kieran Culkin","idIMDB":"nm0001085"},"actorId":"nm0001085","character":"Matty Banks","urlCharacter":"http://www.imdb.com/character/ch0010838","main":true},{"actorName":"BD Wong","urlProfile":"http://www.imdb.com/name/nm0000703","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNTEyMjEyOF5BMl5BanBnXkFtZTcwNjAwNTMwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 October 1960","placeOfBirth":" San Francisco, California, USA","birthName":"Bradley Darryl Wong","height":"5' 4½\" (1.64 m)","bio":"BD Wong was born and raised in San Francisco, California. He made his Broadway debut in \"M. Butterfly.\" He is the only actor to be honored with the Tony Award, Drama Desk Award, Outer Critics Circle Award, Clarence Derwent Award, and Theater World Award for the same performance. He starred in the television series All-American Girl (1994), and has made guest appearances on Sesame Street (1969) and The X-Files (1993). He was in the off-Broadway musical revival of \"As Thousands Cheer\" and followed with a critically acclaimed performance as \"Linus\" in the revival of \"You're a Good Man, Charlie Brown,\" returned to SVU, and is now starring in the revival of Stephen Sondheim's \"Pacific Overtures.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNTEyMjEyOF5BMl5BanBnXkFtZTcwNjAwNTMwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000703","name":"BD Wong","idIMDB":"nm0000703"},"actorId":"nm0000703","character":"Howard Weinstein","urlCharacter":"http://www.imdb.com/character/ch0010841","main":true},{"actorName":"Peter Michael Goetz","urlProfile":"http://www.imdb.com/name/nm0324533","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg3ODQ5Njc0OF5BMl5BanBnXkFtZTcwMDk1ODQxMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1941","placeOfBirth":" Buffalo, New York, USA","bio":"Peter Michael Goetz was born on December 10, 1941 in Buffalo, New York, USA. He is an actor, known for My Girl (1991), Father of the Bride (1991) and Glory (1989). He has been married to Constance Fleurat since June 11, 1966. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg3ODQ5Njc0OF5BMl5BanBnXkFtZTcwMDk1ODQxMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0324533","name":"Peter Michael Goetz","idIMDB":"nm0324533"},"actorId":"nm0324533","character":"John MacKenzie","urlCharacter":"http://www.imdb.com/character/ch0160628","main":true},{"actorName":"Kate McGregor-Stewart","urlProfile":"http://www.imdb.com/name/nm0570033","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4MTc2MDQ3OV5BMl5BanBnXkFtZTcwMzcxOTEzMQ@@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1944","placeOfBirth":" New York City, New York, USA","bio":"Kate McGregor-Stewart was born on October 4, 1944 in New York City, New York, USA. She is known for her work on School of Rock (2003), Father of the Bride (1991) and The Addams Family (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4MTc2MDQ3OV5BMl5BanBnXkFtZTcwMzcxOTEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0570033","name":"Kate McGregor-Stewart","nicknames":["Sandy"],"idIMDB":"nm0570033"},"actorId":"nm0570033","character":"Joanna MacKenzie","urlCharacter":"http://www.imdb.com/character/ch0189356","main":true},{"actorName":"Jane Adams","urlProfile":"http://www.imdb.com/name/nm0011038","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NDg5NzQ3MF5BMl5BanBnXkFtZTcwNTUyMzcyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 April 1965","placeOfBirth":" Washington, District of Columbia, USA","height":"5' 5\" (1.65 m)","bio":"Jane Adams has performed theatre at the Seattle Repertory Theatre. The plays include \"Love Diatribe\", \"The Nice and the Nasty\", and \"Greetings From Elsewhere Cabaret\". She also performed in \"Careless Love\" at the Empty Space Theatre, \"Candide/Len Jenkin\" at the Pioneer Square Theatre\", \"Talking With\" at the Group Theatre and \"Camino Real\" at the Juilliard School. She won a Tony Award for best performance by an actress in a play for the Broadway play, \"An Inspector Calls\". She also won the Outer Critics Circle Award for best featured actress in a play in the Broadway play, \"I Hate Hamlet\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NDg5NzQ3MF5BMl5BanBnXkFtZTcwNTUyMzcyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0011038","name":"Jane Adams","idIMDB":"nm0011038"},"actorId":"nm0011038","character":"Dr. Megan Eisenberg","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eugene Levy","urlProfile":"http://www.imdb.com/name/nm0506405","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NTQ5NjA3Ml5BMl5BanBnXkFtZTYwMDgwMjQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 December 1946","placeOfBirth":" Hamilton, Ontario, Canada","height":"5' 10\" (1.78 m)","bio":"Eugene Levy is an award-winning actor, writer, and producer. He has appeared in more than 60 motion pictures to date, eight of which having topped the $100M mark. The box office success of films such as Bringing Down The House, Cheaper By the Dozen 2, and Father Of The Bride Part II have established him as one of Hollywood's most popular comedic actors. But it was the role of Noah Levenstein in the American Pie franchise that cemented his reputation as America's favorite Dad. Levy's most recent big-screen role was that of Dory's Dad in the Disney/Pixar smash Finding Dory, in which he stars alongside Ellen DeGeneres and Diane Keaton. The film has surpassed the $1B mark worldwide, and is on track to become one of the highest-grossing animated films of all time. Partnering with Christopher Guest, Levy earned critical acclaim for co-writing and co-starring in Best In Show, Waiting For Guffman, For Your Consideration, and A Mighty Wind. Levy has been nominated for and won countless awards for his films including a New York Film Critics Circle Award and a Grammy Award® for A Mighty Wind and a Golden Globe® nomination for Best In Show. Other films include Splash, Armed and Dangerous, Multiplicity, Club Paradise, and Serendipity. In 2013, Levy formed Not A Real Company Productions (with his son Daniel Levy and principals Andrew Barnsley and Fred Levy) to produce Schitt's Creek, a television series for CBC/ITV he co-created, co-executive produces, and co-stars in with Daniel Levy. The single-cam, character-driven comedy also stars Catherine O'Hara, Annie Murphy, and Chris Elliott. In 2016, Levy won Lead Actor in a Comedy at the Canadian Screen Awards and, as Executive Producer, the CSA for Best Comedy, an award he shared with Daniel Levy, among others. Schitt's Creek swept the Canadian Screen Awards, winning nine of a possible 10 categories. Levy also received the prestigious Legacy Award (along with co-star and long-time collaborator, Catherine O'Hara) from the Academy of Canadian Cinema & Television. Levy won two Emmys® for his writing on SCTV in addition to many other awards and nominations for his television work. Levy is a Member of the Order of Canada and a recipient of The Governor General's Performing Arts Award - the foremost honour presented for excellence in the performing arts.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NTQ5NjA3Ml5BMl5BanBnXkFtZTYwMDgwMjQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0506405","name":"Eugene Levy","nicknames":["Butch","Gene"],"idIMDB":"nm0506405"},"actorId":"nm0506405","character":"Mr. Habib","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rebecca Chambers","urlProfile":"http://www.imdb.com/name/nm0150427","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY0MDM0NTgzNl5BMl5BanBnXkFtZTgwMDUyMzQ2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"Rebecca Chambers is an actress, known for Father of the Bride Part II (1995), Prison Heat (1993) and Just in Time (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY0MDM0NTgzNl5BMl5BanBnXkFtZTgwMDUyMzQ2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0150427","name":"Rebecca Chambers","idIMDB":"nm0150427"},"actorId":"nm0150427","character":"Young Woman at Gym","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"April Ortiz","urlProfile":"http://www.imdb.com/name/nm0651074","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjhhZDRlMjYtNTliMi00NjM3LTgxZGQtOGFlMjNlZmY3YjQ1L2ltYWdlXkEyXkFqcGdeQXVyNzg5OTY3OQ@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"April Ortiz is known for her work on Father of the Bride (1991), Father of the Bride Part II (1995) and The Majestic (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjhhZDRlMjYtNTliMi00NjM3LTgxZGQtOGFlMjNlZmY3YjQ1L2ltYWdlXkEyXkFqcGdeQXVyNzg5OTY3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0651074","name":"April Ortiz","idIMDB":"nm0651074"},"actorId":"nm0651074","character":"Olivia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dulcy Rogers","urlProfile":"http://www.imdb.com/name/nm0736851","urlPhoto":"","biography":{"bio":"Dulcy Rogers is an actress and writer, known for Father of the Bride Part II (1995), Certain Guys (2000) and Rude Awakening (1989). She has been married to Diedrich Bader since May 25, 1997. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0736851","name":"Dulcy Rogers","idIMDB":"nm0736851"},"actorId":"nm0736851","character":"Ava","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kathy Anthony","urlProfile":"http://www.imdb.com/name/nm0030926","urlPhoto":"","biography":{"bio":"Kathy Anthony is an actress, known for Father of the Bride Part II (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0030926","name":"Kathy Anthony","idIMDB":"nm0030926"},"actorId":"nm0030926","character":"Beautician #2","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0113041","urlIMDB":"http://www.imdb.com/title/tt0113041","business":{"budget":{"money":"$30,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"£4,239,588","country":"UK","day":"17","month":"03","year":"1996","remarks":""},{"money":"£3,120,433","country":"UK","day":"19","month":"02","year":"1996","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1997/\">1997</a>"},{"money":"13,088","country":"Portugal","day":"07","month":"03","year":"1996","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1994/\">1994</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 46 min (106 min)"],"soundMix":["Dolby","Dolby Digital"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":null,"filmLength":["2,979 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.9","metascore":"49","filmingLocations":[{"location":"West Dayton Street & South Delacy Street, Pasadena, California, USA"}],"rated":"PG","awards":[{"award":"Golden Globes, USA 1996","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Performance by an Actor in a Motion Picture - Comedy or Musical","names":[{"name":"Steve Martin","id":"nm0000188","role":null}]}]}]},{"award":"American Comedy Awards, USA 1996","titlesAwards":[{"titleAwardOutcome":"Nominated American Comedy Award","categories":[{"category":"Funniest Actor in a Motion Picture (Leading Role)","names":[{"name":"Steve Martin","id":"nm0000188","role":null}]}]}]},{"award":"BMI Film & TV Awards 1996","titlesAwards":[{"titleAwardOutcome":"Won BMI Film Music Award","categories":[{"category":"","names":[{"name":"Alan Silvestri","id":"nm0006293","role":null}]}]}]}],"votes":"27,850","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005929","name":"Sandollar Productions"},{"idCompany":"co0019819","name":"Taylor-Made Productions"},{"idCompany":"co0057284","name":"The Meyers/Shyer Company"}],"keywords":{"keywords":["marriage","pregnancy","sequel","acting silly for a baby","1990s","second part","discovering one is pregnant","barking dog","woman in labor","mother daughter relationship","husband wife relationship","father daughter relationship","family relationships","breaking the fourth wall","baby born","pregnant daughter","love","expectant mother","expectant father","pregnant wife","giving birth","birth","parenthood","midlife crisis","labor","grandparent","elderly","childbirth","baby","stork","baby shower","sequel to remake","remake"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:41:45"}}