{"data":{"movies":[{"title":"The Witches","originalTitle":"","year":"1990","releaseDate":"19900824","directors":[{"name":"Nicolas Roeg","id":"nm0001676"}],"writers":[{"name":"Roald Dahl","id":"nm0001094"},{"name":"Allan Scott","id":"nm0778819"}],"runtime":"91 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1MDg5NzAyMV5BMl5BanBnXkFtZTgwNzU5Mzk4NjE@._V1.jpg","countries":["UK","USA"],"languages":["English"],"genres":["Adventure","Comedy","Fantasy","Horror","Mystery"],"plot":"A young boy, recently orphaned, is taken to England by his grandmother. At a hotel in which they are staying, a group of witches have gathered to prepare a plot to rid England of all children.","simplePlot":"A young boy stumbles onto a witch convention and must stop them, even after he has been turned into a mouse.","actors":[{"actorName":"Anjelica Huston","urlProfile":"http://www.imdb.com/name/nm0001378","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNTE1MTAyNDReQTJeQWpwZ15BbWU3MDk5NDI0Mjc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1951","placeOfBirth":" Santa Monica, California, USA","height":"5' 10\" (1.78 m)","bio":"Anjelica Huston was born on July 8, 1951 in Santa Monica, California, to prima ballerina Enrica \"Ricki\" (Soma) and director and actor John Huston. Her mother, who was from New York, was of Italian descent, and her father had English, Scottish, and Scots-Irish ancestry. Huston spent most of her childhood overseas, in Ireland and England, and in 1969 first dipped her toe into the acting profession, taking a few small roles in her father's movies. However, in that year her mother died in a car accident, at 39, and Huston relocated to the United States, where the tall, exotically beautiful young woman modeled for several years. While modeling, Huston had a few more small film roles, but decided to focus more on movies in the early 1980s. She prepared herself by reaching out to acting coach Peggy Feury and began to get roles. The first notable part was in Bob Rafelson's remake of the classic noir movie The Postman Always Rings Twice (1981) (in which Jack Nicholson, with whom Huston was living at the time, was the star). After a few more years of on-again, off-again supporting work, her father perfectly cast her as calculating, imperious Maerose, the daughter of a Mafia don whose love is scorned by a hit man (Nicholson again) in his film adaptation of Richard Condon's Mafia-satire novel Prizzi's Honor (1985). Huston won the Best Supporting Actress Oscar for her performance, making her the first person in Academy Award history to win an Oscar when a parent and a grandparent (her father and grandfather Walter Huston) had also won one. Huston thereafter worked prolifically, including notable roles in Francis Ford Coppola's -Gardens of Stone (1987), Barry Sonnenfeld's film versions of the Charles Addams cartoons The Addams Family (1991) and Addams Family Values (1993), in which she portrayed Addams matriarch Morticia, Wes Anderson's The Royal Tenenbaums (2001) and The Life Aquatic with Steve Zissou (2004). Probably her finest performance on-screen, however, was as Lilly, the veteran, iron-willed con artist in Stephen Frears' The Grifters (1990), for which she received another Oscar nomination, this time for Best Actress. A sentimental favorite is her performance as the lead in her father's final film, an adaptation of James Joyce's The Dead (1987) -- with her many years of residence in Ireland, Huston's Irish accent in the film is authentic. Endowed with her father's great height and personal boldness, and her mother's beauty and aristocratic nose, Huston certainly cuts an imposing figure, and brings great confidence and authority to her performances. She clearly takes her craft seriously and has come into her own as a strong actress, emerging from under the shadow of her father, who passed away in 1987. Huston married the sculptor Robert Graham in 1992, The couple lived in the Los Angeles area before Graham's death in 2008.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNTE1MTAyNDReQTJeQWpwZ15BbWU3MDk5NDI0Mjc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001378","name":"Anjelica Huston","nicknames":["Angel","Anjel"],"idIMDB":"nm0001378"},"actorId":"nm0001378","character":"Miss Eva Ernst / Grand High Witch","urlCharacter":"http://www.imdb.com/character/ch0022475","main":true},{"actorName":"Mai Zetterling","urlProfile":"http://www.imdb.com/name/nm0955195","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzOTk3ODg4Ml5BMl5BanBnXkFtZTcwNTUzNzAyOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 May 1925","placeOfBirth":" Västerås, Västmanlands län, Sweden","birthName":"Mai Elizabeth Zetterling","height":"5' 7\" (1.7 m)","bio":"Mai Zetterling was born in Sweden in 1925, and lived briefly in Australia while still a child. She's known as a director and actor and trained on the Stockholm repertory stage, she began appearing in war-era films starting in her teens. Following her debut in Lasse Maja (1941), she made quite an impact in the terminally dark Ingmar Bergman-written film Torment (1944) [known as Torment in the US and Frenzy in the UK], who went on to direct her in his Music in Darkness (1948) [Music in Darkness]. The international attention she received from her Bergman association led her to England where she debuted in the title role of Frieda (1947), a war drama co-starring David Farrar, Glynis Johns and Flora Robson. Developing modest sex symbol success, she went on to co-star opposite a number of handsome leading men throughout the post-war years in primarily dramatic works, including Dennis Price in The Bad Lord Byron (1949), Dirk Bogarde in Blackmailed (1951), Herbert Lom in The Ringer (1952), Richard Widmark in A Prize of Gold (1955), Tyrone Power in Abandon Ship (1957) (which was a variation on Hitchcock's Lifeboat (1944)), John Gregson in Faces in the Dark (1960), William Sylvester in The Devil Inside (1961), and Stanley Baker in The Man Who Finally Died (1963). Along the way she proved just as adaptable and sexy in smart comedy when she came between husband and wife Peter Sellers and Virginia Maskell in Only Two Can Play (1962). Mai abandoned acting in the mid-1960s and courted some controversy when she successfully began sitting in the director's chair. Divorced from Norwegian actor Tutte Lemkow in the early 1950s, she later wed writer David Hughes in 1958, who collaborated with her on a number of her directing ventures, which seemed ahead of their time. Obviously influenced by Bergman, the dark, sexy drama Loving Couples (1964) [Loving Couples] dealt with homosexual themes and featured nudity; Night Games (1966) [Night Games] revolved around sexual decadency and repression; and The Girls (1968) [The Girls], which had an all-star Swedish cast including Bibi Andersson and Harriet Andersson, expounded on women's liberation. She divorced her second husband in 1979. She had two children, Louis and Etienne, from her first marriage. Toward the end of her life, Mai made a return to film acting and is best remembered at this late stage for her nurturing and resilient grandmother in the film The Witches (1990) wherein she is forced to tangle with a particularly virulent ringleader Anjelica Huston to save her grandson from her coven of hags. Mai died of cancer in 1994.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzOTk3ODg4Ml5BMl5BanBnXkFtZTcwNTUzNzAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0955195","name":"Mai Zetterling","idIMDB":"nm0955195"},"actorId":"nm0955195","character":"Helga Eveshim","urlCharacter":"http://www.imdb.com/character/ch0212418","main":true},{"actorName":"Jasen Fisher","urlProfile":"http://www.imdb.com/name/nm0279557","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1OTc0ODU0NV5BMl5BanBnXkFtZTcwOTM1NTcwOA@@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 May 1980","placeOfBirth":" Chicago, Illinois, USA","birthName":"Jasen Lee Fisher","height":"6' (1.83 m)","bio":"Jasen Fisher was born on May 8, 1980 in Chicago, Illinois, USA as Jasen Lee Fisher. He is an actor, known for Hook (1991), The Witches (1990) and Parenthood (1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1OTc0ODU0NV5BMl5BanBnXkFtZTcwOTM1NTcwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0279557","name":"Jasen Fisher","idIMDB":"nm0279557"},"actorId":"nm0279557","character":"Luke Eveshim","urlCharacter":"http://www.imdb.com/character/ch0068375","main":true},{"actorName":"Rowan Atkinson","urlProfile":"http://www.imdb.com/name/nm0000100","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NDUzOTc3MV5BMl5BanBnXkFtZTcwNjcxMDkxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 January 1955","placeOfBirth":" Consett, County Durham, England, UK","birthName":"Rowan Sebastian Atkinson","height":"5' 11\" (1.8 m)","bio":"Rowan Sebastian Atkinson was born on 6 January, 1955, in Consett, Co. Durham, UK, to Ella May (Bainbridge) and Eric Atkinson. His father owned a farm, where Rowan grew up with his two older brothers, Rupert and Rodney. He attended Newcastle University and Oxford University where he earned degrees in electrical engineering. During that time, he met screenwriter Richard Curtis, with whom he wrote and performed comedy revues. Later, he co-wrote and appeared in Not the Nine O'Clock News (1979), which was a huge success and spawned several best-selling books. It won an International Emmy Award and the British Academy Award for \"Best Light Entertainment Programme of 1980.\" He won the \"British Academy Award\" and was named \"BBC Personality of the Year\" for his performing on Not the Nine O'Clock News (1979). Atkinson also appeared in several movies, including Dead on Time (1983), Pleasure at Her Majesty's (1976) (aka \"Monty Python Meets Beyond the Fringe\"), Never Say Never Again (1983), and The Tall Guy (1989). He played \"Mr. Bean\" in the TV series, Mr. Bean (1990) but, apart from that and Not the Nine O'Clock News (1979), he also appeared in several other series like The Black Adder (1982) and Funny Business (1992), etc. Atkinson enjoys nothing better than fast cars. He has been married to Sunetra Sastry since 1990, and they have two children, named Benjamin and Lily.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NDUzOTc3MV5BMl5BanBnXkFtZTcwNjcxMDkxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000100","name":"Rowan Atkinson","nicknames":["Row"],"idIMDB":"nm0000100"},"actorId":"nm0000100","character":"Mr. Stringer","urlCharacter":"http://www.imdb.com/character/ch0212421","main":true},{"actorName":"Bill Paterson","urlProfile":"http://www.imdb.com/name/nm0665473","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MzExMjI3OV5BMl5BanBnXkFtZTcwMDM2MDU1NA@@._V1._CR159,3.649993896484375,517,520_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 June 1945","placeOfBirth":" Glasgow, Scotland, UK","height":"5' 7½\" (1.71 m)","bio":"Bill Paterson was born on June 3, 1945 in Glasgow, Scotland. He is an actor and writer, known for The Killing Fields (1984), The Witches (1990) and The Adventures of Baron Munchausen (1988). He is married to Hildegard Bechtler. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MzExMjI3OV5BMl5BanBnXkFtZTcwMDM2MDU1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0665473","name":"Bill Paterson","idIMDB":"nm0665473"},"actorId":"nm0665473","character":"Mr. Jenkins","urlCharacter":"http://www.imdb.com/character/ch0212422","main":true},{"actorName":"Brenda Blethyn","urlProfile":"http://www.imdb.com/name/nm0000950","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMzMzMDkwNV5BMl5BanBnXkFtZTYwMzc2OTg0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1946","placeOfBirth":" Ramsgate, Kent, England, UK","birthName":"Brenda Anne Bottle","height":"5' 2\" (1.57 m)","bio":"After twenty years of hard work on stage and both television and film, there are not many other actresses who deserved the success, recognition and stardom which Brenda Blethyn has now achieved. Born in 1946 in Ramsgate, Kent, England, she started her career at British Rail in the 1960s. Saving money during her time there, she took a risk and enrolled herself at the at The Guildford School of Acting in Guildford, Surrey, England and then left her British Rail years behind. Her risk had paid off, by the mid-1970s she was working on stage, eventually joining the National Theatre Company in 1975. It was the 1980s, however that saw Brenda move onto the small screen when she appeared in a BBC2 Playhouse presentation called BBC2 Playhouse: Grown-Ups (1980), playing the character Gloria. Other work in television quickly followed and this kept her working throughout the 1980s. She still remained relatively unknown with the viewing public during the 1980s, despite her consistent work and superb acting abilities. It was not until the dawn of the 90s that her career took off. In 1990, she played the supporting cast member role of Mrs Jenkins in film based on the Roald Dahl novel The Witches (1990), with Anjelica Huston, Jane Horrocks and Mai Zetterling. Film work now became the order of the day in the early 90s, appearing in both A River Runs Through It (1992) and the television film Screen One: The Bullion Boys (1993). It was then back to a TV series in 1994, with Outside Edge (1994), working on this production for its two-year run. It is without a doubt that 1997 will be remembered as her biggest year to date. She was cast by her old friend Mike Leigh in the film Secrets & Lies (1996) as Cynthia Rose Purley, opposite highly talented Marianne Jean-Baptiste. The film received storming reviews and Blethyn won a BAFTA Film Award and subsequently received an Academy Award nomination for her role, along with Jean-Baptiste. Although Brenda came home from the Oscars empty handed, her profile in Hollywood and Britain soared as a result of the nomination and her appearance on The 69th Annual Academy Awards (1997). Film roles then came thick and fast following Secrets & Lies (1996). Brenda was nothing short of superb in Little Voice (1998). A second Academy Award nomination followed but once again she was the bridesmaid rather than the bride at the Oscars. Since 1996, she has found a new home in film and she has worked consistently in the medium.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMzMzMDkwNV5BMl5BanBnXkFtZTYwMzc2OTg0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000950","name":"Brenda Blethyn","idIMDB":"nm0000950"},"actorId":"nm0000950","character":"Mrs. Jenkins","urlCharacter":"http://www.imdb.com/character/ch0212423","main":true},{"actorName":"Charlie Potter","urlProfile":"http://www.imdb.com/name/nm0693241","urlPhoto":"","biography":{"bio":"Charles Potter is a former British child actor whose only notable role to date came as Bruno Jenkins in The Witches, a 1990 film based on the book of the same name by Roald Dahl. He has not acted since, and is now a barrister practicing commercial, public and administrative law at Blackstone Chambers in London.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0693241","name":"Charlie Potter","idIMDB":"nm0693241"},"actorId":"nm0693241","character":"Bruno Jenkins","urlCharacter":"http://www.imdb.com/character/ch0068376","main":true},{"actorName":"Jane Horrocks","urlProfile":"http://www.imdb.com/name/nm0001363","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzIxNjI5NV5BMl5BanBnXkFtZTYwMTIyODI0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 January 1964","placeOfBirth":" Rossendale Valley, Lancashire, England, UK","birthName":"Barbara Jane Horrocks","height":"5' 2\" (1.57 m)","bio":"Jane Horrocks was born January 18, 1964 in Rawtenstall, Lancashire, England, UK, she is the youngest of three children born to Barbara and John Horrocks. She attended Balladen County Primary School before she enrolled at Oldham College, and later, Royal Academy of Dramatic Art, among her classmates were Imogen Stubbs and Ralph Fiennes. Jane received great reviews for her performance in Life Is Sweet (1990), followed by her award-winning performance in \"The Rise and Fall of Little Voice\", a play directed by Jim Cartwright who had written the play in awe of Jane's singing impressions of Judy Garland, Shirley Bassey and Ethel Merman. The play was adapted into a film in which Jane reprised her role as Little Voice (1998). For her performance in the film, she was nominated a BAFTA Film Award, BSFC Award, British Independent Film Award, CFCA Award, Golden Globe, Golden Satellite Award, Screen Actors Guild Award, and SEFCA Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzIxNjI5NV5BMl5BanBnXkFtZTYwMTIyODI0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001363","name":"Jane Horrocks","idIMDB":"nm0001363"},"actorId":"nm0001363","character":"Miss Irvine","urlCharacter":"http://www.imdb.com/character/ch0022476","main":true},{"actorName":"Anne Lambton","urlProfile":"http://www.imdb.com/name/nm0483457","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2ODM1OTY1N15BMl5BanBnXkFtZTcwNjMyODgwMw@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 July 1954","placeOfBirth":" London, England, UK","birthName":"Anne Mary Gabrielle Lambton","bio":"Anne Lambton was born July 4, 1954 in London, England, to Bindy Lambton and Lord Antony Lambton. She started out as Andy Warhol's bodyguard after having been hired on a whim by his manager Fred Hughes. Anne was later asked by Warhol to star in his film Bad (1977). She declined when he proposed marriage. They never married but remained close confidantes until his death in 1987. Anne's first film appearances were in Sid and Nancy (1986). She played the role of Linda, the Siouxsie Sioux-esque dominatrix. She later appeared as the ever-so creepy witch at the beginning and throughout Nicolas Roeg's film adaptation of Roald Dahl's The Witches (1990).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2ODM1OTY1N15BMl5BanBnXkFtZTcwNjMyODgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0483457","name":"Anne Lambton","idIMDB":"nm0483457"},"actorId":"nm0483457","character":"Woman in Black","urlCharacter":"http://www.imdb.com/character/ch0212420","main":true},{"actorName":"Sukie Smith","urlProfile":"http://www.imdb.com/name/nm0810058","urlPhoto":"","biography":{"dateOfBirth":"23 September 1964","placeOfBirth":" Rochford, Essex, England, UK","bio":"Sukie Smith was born on September 23, 1964 in Rochford, Essex, England. She is an actress and composer, known for Topsy-Turvy (1999), The Witches (1990) and Lawless Heart (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0810058","name":"Sukie Smith","idIMDB":"nm0810058"},"actorId":"nm0810058","character":"Marlene","urlCharacter":"http://www.imdb.com/character/ch0212424","main":true},{"actorName":"Rose English","urlProfile":"http://www.imdb.com/name/nm0257673","urlPhoto":"","biography":{"bio":"Rose English is an actress and writer, known for The Witches (1990), Thriller (1979) and Surviving Picasso (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0257673","name":"Rose English","idIMDB":"nm0257673"},"actorId":"nm0257673","character":"Dora","urlCharacter":"http://www.imdb.com/character/ch0212425","main":true},{"actorName":"Jenny Runacre","urlProfile":"http://www.imdb.com/name/nm0750192","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MzEzMjQwOV5BMl5BanBnXkFtZTgwMDMxNTgxMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1943","placeOfBirth":" Cape Town, South Africa","height":"5' 10\" (1.78 m)","bio":"Jenny Runacre was born on August 18, 1946 in Capetown, South Africa, one of four girls in the family. The family moved to London when she was five, where Runacre developed an early love of movies, spending much time watching them in the local cinemas. She attended The Actor's Workshop in Notting Hill Gate, training in the Stanislavski System (also known as method acting). While attending the Actor's Workshop, Runacre was approached by fellow student (and future agent) Tom Busby with an intriguing offer. Busby was working as a runner for an American film production that was seeking fledgling English actresses to play opposite John Cassavetes in Husbands (1970), a movie to be shot the following year in London. The young actress was interested, underwent a grueling day of auditioning with Cassavetes, Ben Gazzara and Peter Falk, and was told six weeks later, rather to her surprise, that she was being offered the part of Mary Tynan in the movie. Cassavetes demanded a great deal from his performers, but Runacre rose to the occasion and delivered an intense, remarkable performance. Runacre spent six months traveling in Morocco after shooting \"Husbands\", and soon after her return joined the original London cast of \"Oh! Calcutta!\", first playing at The Roundhouse and later at the Royalty Theatre. After a year, Runacre left the cast and worked in a series of notable films featuring some of the great directors of the time, delivering fine performances in Pier Paolo Pasolini's The Canterbury Tales (1972), John Huston's The MacKintosh Man (1973), Robert Fuest's The Last Days of Man on Earth (1973), Michelangelo Antonioni's The Passenger (1975), and Derek Jarman's Jubilee (1978) (in which she starred as Elizabeth I and \"Bod\"). She was active in the theatre as well, and worked often in British television, perhaps the most notable of which was Brideshead Revisited (1981), in which Runacre plays Brenda Champion, Julia's rival for Rex's affection. In the 1990s Runacre returned to University, obtaining a Master's in Fine Art Practice at Central Saint Martin's College of Art and Design in London. Her career has since focused on the art world; she is currently a lecturer in residence, and has worked in installation art and experimental filmmaking. She continues to be involved in film and theatre, both directing and acting, when the right project presents itself.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MzEzMjQwOV5BMl5BanBnXkFtZTgwMDMxNTgxMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0750192","name":"Jenny Runacre","idIMDB":"nm0750192"},"actorId":"nm0750192","character":"Elsie","urlCharacter":"http://www.imdb.com/character/ch0212426","main":true},{"actorName":"Annabel Brooks","urlProfile":"http://www.imdb.com/name/nm0111863","urlPhoto":"","biography":{"dateOfBirth":"4 January 1958","placeOfBirth":"","birthName":"Annabel Joan Brooks","bio":"Annabel Brooks was born January 4, 1958 to Caroline Diana Todd and Robert Noel Brooks. She appeared in the several films of the 1980s and made her first on-screen appearance in the poorly received sci-fi horror, Nightflyers (1987). She had the role of Eliza. The same year, she appeared in A Handful of Dust (1988), and later, in The Witches (1990), as Nicola, a high-ranking witch.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0111863","name":"Annabel Brooks","idIMDB":"nm0111863"},"actorId":"nm0111863","character":"Nicola","urlCharacter":"http://www.imdb.com/character/ch0212427","main":true},{"actorName":"Emma Relph","urlProfile":"http://www.imdb.com/name/nm0718834","urlPhoto":"","biography":{"bio":"Emma Relph is an actress, known for The Witches (1990), Eureka (1983) and From a Far Country (1981).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0718834","name":"Emma Relph","idIMDB":"nm0718834"},"actorId":"nm0718834","character":"Millie","urlCharacter":"http://www.imdb.com/character/ch0212429","main":true},{"actorName":"Nora Connolly","urlProfile":"http://www.imdb.com/name/nm0175336","urlPhoto":"","biography":{"bio":"Nora Connolly is an actress, known for The Witches (1990), The Razor's Edge (1984) and Best (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0175336","name":"Nora Connolly","idIMDB":"nm0175336"},"actorId":"nm0175336","character":"Beatrice","urlCharacter":"http://www.imdb.com/character/ch0212430","main":true}],"seasons":[],"idIMDB":"tt0100944","urlIMDB":"http://www.imdb.com/title/tt0100944","business":{"budget":null,"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1988/\">1988</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 31 min (91 min)"],"soundMix":["Dolby Stereo"],"color":["Color (Eastmancolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Metrocolor, London, UK"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.8","filmingLocations":[{"location":"Cookham Dean, Berkshire, England, UK"}],"rated":"PG","awards":[{"award":"BAFTA Awards 1991","titlesAwards":[{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best Make Up Artist","names":[{"name":"Christine Beveridge","id":"nm0079705","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1991","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Actress","names":[{"name":"Anjelica Huston","id":"nm0001378","role":null}]},{"category":"Best Supporting Actress","names":[{"name":"Mai Zetterling","id":"nm0955195","role":null}]},{"category":"Best Performance by a Younger Actor","names":[{"name":"Jasen Fisher","id":"nm0279557","role":null}]},{"category":"Best Music","names":[{"name":"Stanley Myers","id":"nm0004368","role":null}]},{"category":"Best Make-Up","names":[{"name":"John Stephenson","id":"nm0827268","role":null},{"name":"The Creature Shop","id":null,"role":null}]}]}]},{"award":"Boston Society of Film Critics Awards 1991","titlesAwards":[{"titleAwardOutcome":"Won BSFC Award","categories":[{"category":"Best Actress","names":[{"name":"Anjelica Huston","id":"nm0001378","role":null},{"name":"The Grifters","id":"tt0099703","role":null}]}]}]},{"award":"Fantasporto 1991","titlesAwards":[{"titleAwardOutcome":"Nominated International Fantasy Film Award","categories":[{"category":"Best Film","names":[{"name":"Nicolas Roeg","id":"nm0001676","role":null}]}]}]},{"award":"Hugo Awards 1991","titlesAwards":[{"titleAwardOutcome":"Nominated Hugo","categories":[{"category":"Best Dramatic Presentation","names":[{"name":"Nicolas Roeg","id":"nm0001676","role":"director"},{"name":"Allan Scott","id":"nm0778819","role":"screenplay"},{"name":"Roald Dahl","id":"nm0001094","role":"based on the book by"}]}]}]},{"award":"Los Angeles Film Critics Association Awards 1990","titlesAwards":[{"titleAwardOutcome":"Won LAFCA Award","categories":[{"category":"Best Actress","names":[{"name":"Anjelica Huston","id":"nm0001378","role":null},{"name":"The Grifters","id":"tt0099703","role":null}]}]}]},{"award":"National Society of Film Critics Awards, USA 1991","titlesAwards":[{"titleAwardOutcome":"Won NSFC Award","categories":[{"category":"Best Actress","names":[{"name":"Anjelica Huston","id":"nm0001378","role":null},{"name":"The Grifters","id":"tt0099703","role":null}]}]}]}],"votes":"26,301","type":"Movie","companyCreditsSimple":[{"idCompany":"co0037360","name":"Lorimar Film Entertainment"},{"idCompany":"co0095015","name":"Jim Henson Company, The"},{"idCompany":"co0055122","name":"Jim Henson Productions"}],"keywords":{"keywords":["hotel","witch","mouse","little boy","convention","england","grande dame guignol","metamorphosis","villain turns good","chocolate","purple eyes","child hater","bald woman","death of parents","trapped in a painting","child turned into a mouse","villainess played by lead actress","overweight child","loss of mother","loss of father","hotel manager","good versus evil","transformation","conspiracy","witchcraft","wig","grandmother grandson relationship","black cat","death of father","death of mother","young boy","escape","eyeglasses","woman wearing a black negligee","mother son relationship","father son relationship","odor","mother daughter relationship","lifting a female into the air","child","kidnapping a child","blindfold","human becoming an animal","apple","fantasy sequence","fireworks","helium balloon","cheering crowd","pulling out a nose hair","comic book","woman wearing a one piece swimsuit","breaking a plate over husband's head","white room","fragmentation grenade","man carrying a woman","vignette form","visiting a grave","bell 47 sioux helicopter","hot water bottle","false eyelashes","woman dancing","man wearing a tuxedo","formal dinner party","close up of mouth","trunk","formula","gathering","wickedness","undercover","running","speech","coven","stage","applause","pet","pastry","sorceress","lane","uniform","candle","absurdism","mountain","snow","meat cleaver","scottish","restaurant","singing","upskirt","cuisine","underwear","staff","husband wife relationship","shrinking","foot chase","laughter","candy","mousetrap","pomposity","luggage","evaporation","norwegian","europe","concealment","magic","burping","spell","audience","abduction","bellhop","missing girl","small town","birthday cake","tree house","police officer","listening to radio","bicycling","cash","father daughter relationship","pigtails","native dress","panic","horse and wagon","pursuit","notebook","fear","delivery man","anger","money","scream","guest","taxi","pandemonium","ocean","cage","hysteria","bedridden","fainting","tears","cook","face mask","maid","baby stroller","police car","toad","braids","pet cat","magical potion","grimoire","subjective camera","cigar smoking","doctor","birthday present","chocolate bar","drawing","child's drawing","crying","search","hat","bedroom","accidental death","disappearance","no toes on foot","kidnapping","braided hair","belief in witches","missing finger","storytelling","painting","girl","little girl","old woman","hotel room","gloves","baldness","hand","talking animal","rich kid","rescue","norway","meeting","hiding","beach","baby carriage","eye","laser vision","hollow book","gluttony","gift","exploding body","birthday","vacation","mission","eavesdropping","disguise","diabetes","cruelty","treehouse","supernatural power","soup","snake","shoe","mask","kitchen","child in peril","cat","baby","yelling","based on book","based on novel","surprise ending","striptease","money falling through the air","cabin in the woods","school","school uniform","bicycle","radio","rubbing noses","missing person","policeman","police","missing child","orphan boy","family relationships","lifting someone into the air","elevator","cake","air conditioner","orphan","carriage"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 01:57:07"}}