{"data":{"movies":[{"title":"The Borrowers","originalTitle":"","year":"1997","releaseDate":"19980213","directors":[{"name":"Peter Hewitt","id":"nm0382072"}],"writers":[{"name":"Mary Norton","id":"nm0636260"},{"name":"Gavin Scott","id":"nm0779170"}],"runtime":"89 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MTI2NDY0N15BMl5BanBnXkFtZTcwNzk3NjQyMQ@@._V1.jpg","countries":["UK","USA"],"languages":["English"],"genres":["Adventure","Comedy","Family","Fantasy"],"plot":"The Borrowers are four-inch high \"little people\" who live under the floorboards. When the owner of the house they live in dies and evil realtor Ocious Potter wants to destroy the house to build luxury apartments on its place, they start to fight him with the help of the son of house owner, Pete.","simplePlot":"A secret family of four-inch people living inside the walls of a house must save their home from an evil real estate developer.","actors":[{"actorName":"John Goodman","urlProfile":"http://www.imdb.com/name/nm0000422","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MTIzODQ1M15BMl5BanBnXkFtZTcwNjI4Mzc1OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1952","placeOfBirth":" St. Louis, Missouri, USA","birthName":"John Stephen Goodman","height":"6' 2\" (1.88 m)","bio":"John Stephen Goodman is a U.S. film, television, and stage actor. He was born in St. Louis, Missouri, to Virginia Roos (Loosmore), a waitress and saleswoman, and Leslie Francis Goodman, a postal worker who died when John was a small child. He is of English, Welsh, and German ancestry. John is best known for his role as Dan Conner on the television series Roseanne (1988), which ran until 1997, and for which he won a Best Actor Golden Globe award in 1993. Goodman is also noted for appearances in the films of the Coen brothers, with prominent roles in Raising Arizona (1987), as an escaped convict, in Barton Fink (1991), as a congenial murderer, in The Big Lebowski (1998), as a volatile bowler, and in O Brother, Where Art Thou? (2000), as a cultured thief. Additionally, Goodman's voice work has appeared in numerous Disney films, including the voice for \"Sulley\" in Monsters, Inc. (2001). Having contributed to more than 50 films, Goodman has also won two American Comedy Awards and hosted Saturday Night Live (1975) fourteen times.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MTIzODQ1M15BMl5BanBnXkFtZTcwNjI4Mzc1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000422","name":"John Goodman","idIMDB":"nm0000422"},"actorId":"nm0000422","character":"Ocious P. Potter","urlCharacter":"http://www.imdb.com/character/ch0562311","main":true},{"actorName":"Mark Williams","urlProfile":"http://www.imdb.com/name/nm0931247","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1Mzc4NjA5OV5BMl5BanBnXkFtZTcwMDc5OTUwOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 August 1959","placeOfBirth":" Bromsgrove, Worcestershire, England, UK","height":"6' 1\" (1.86 m)","bio":"Mark Williams was born on August 22, 1959 in Bromsgrove, Worcestershire, England. He is an actor and writer, known for Harry Potter and the Goblet of Fire (2005), Harry Potter and the Chamber of Secrets (2002) and Harry Potter and the Prisoner of Azkaban (2004). He is married to Dianne Williams. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1Mzc4NjA5OV5BMl5BanBnXkFtZTcwMDc5OTUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0931247","name":"Mark Williams","idIMDB":"nm0931247"},"actorId":"nm0931247","character":"Exterminator Jeff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim Broadbent","urlProfile":"http://www.imdb.com/name/nm0000980","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY4ODgzMTg3MV5BMl5BanBnXkFtZTYwMDE4NTc0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 May 1949","placeOfBirth":" Lincoln, Lincolnshire, England, UK","birthName":"James Broadbent","height":"6' 2\" (1.88 m)","bio":"One of England's most versatile character actors, Jim Broadbent was born on May 24, 1949, in Lincolnshire, the youngest son of furniture maker Roy Laverick Broadbent and sculptress Doreen \"Dee\" (Findlay) Broadbent. Jim attended a Quaker boarding school in Reading before successfully applying for a place at an art school. His heart was in acting, though, and he would later transfer to the London Academy of Music and Dramatic Art (LAMDA). Following his 1972 graduation, he began his professional career on the stage, performing with the Royal National Theatre, the Royal Shakespeare Company, and as part of the National Theatre of Brent, a two-man troupe which he co-founded. In addition to his theatrical work, Broadbent did steady work on television, working for such directors as Mike Newell and Stephen Frears. Broadbent made his film debut in 1978 with a small part in Jerzy Skolimowski's The Shout (1978). He went on to work with Frears again in The Hit (1984) and with Terry Gilliam in Time Bandits (1981) and Brazil (1985), but it was through his collaboration with Mike Leigh that Broadbent first became known to an international film audience. In 1990 he starred in Leigh's Life Is Sweet (1990), a domestic comedy that cast him as a good-natured cook who dreams of running his own business. Broadbent gained further visibility the following year with substantial roles in Neil Jordan's The Crying Game (1992) and Mike Newell's Enchanted April (1991), and he could subsequently be seen in such diverse fare as Woody Allen's Bullets Over Broadway (1994), Widows' Peak (1994), Richard Loncraine's highly acclaimed adaptation of Shakespeare's Richard III (1995) and Little Voice (1998), the last of which cast him as a seedy nightclub owner. Appearing primarily as a character actor in these films, Broadbent took center stage for Leigh's Topsy-Turvy (1999), imbuing the mercurial W.S. Gilbert with emotional complexity and comic poignancy. Jim's breakthrough year was 2001, as he starred in three critically and commercially successful films. Many would consider him the definitive supporting actor of that year. First he starred as Bridget's dad (Colin Jones) in Bridget Jones's Diary (2001), which propelled Renée Zellweger to an Oscar nomination for Best Actress. Next came the multiple Oscar-nominated film (including Best Picture) Moulin Rouge (2001), for which he won a Best Supporting Actor BAFTA award for his scene-stealing performance as Harold Zidler. Lastly, came the small biopic Iris (2001), for which he won the Oscar for Best Supporting Actor as devoted husband John Bayley to Judi Dench's Iris Murdoch, the British novelist who suffered from Alzheimer's disease. The film hit home with Jim, since his own mother had passed away from Alzheimer's in 1995.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY4ODgzMTg3MV5BMl5BanBnXkFtZTYwMDE4NTc0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000980","name":"Jim Broadbent","idIMDB":"nm0000980"},"actorId":"nm0000980","character":"Pod Clock","urlCharacter":"http://www.imdb.com/character/ch0075604","main":true},{"actorName":"Celia Imrie","urlProfile":"http://www.imdb.com/name/nm0408309","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY2ODkzOTE2NF5BMl5BanBnXkFtZTgwNDAwODA2NDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1952","placeOfBirth":" Guildford, Surrey, England, UK","birthName":"Celia Diana Savile Imrie","height":"5' 5½\" (1.66 m)","bio":"Celia Diana Savile Imrie is an English actress. She is known for her appearances with Victoria Wood; including Claire in Pat and Margaret (1994), Philippa Moorcroft in Dinnerladies (1998-2000) and playing various characters in the sketch show Victoria Wood As Seen On TV (1985-87), including Miss Babs in the spoof soap opera sketches Acorn Antiques. She reprised the role of Miss Babs in Acorn Antiques: The Musical! in 2005, and won the Olivier Award for Best Supporting Performance in a Musical. Imrie's other television roles include Marianne Bellshade in Bergerac (1983), Diana Neal in After You've Gone (2007-08), Gloria Millington in Kingdom (2007-09), and Miss Kizlet in the 2013 Doctor Who season opener The Bells of Saint John. Her film appearances include Highlander (1986), Hilary and Jackie (1998), Bridget Jones's Diary (2001), Calendar Girls (2003), Bridget Jones: The Edge of Reason (2004), Imagine Me & You (2005), The Best Exotic Marigold Hotel (2012) and The Second Best Exotic Marigold Hotel (2015). She has been described as \"one of the most successful British actresses of recent decades\". Imrie was born in 1952 in Guildford, Surrey, the fourth of five children of Diana Elizabeth Blois (née Cator) and David Andrew Imrie, a radiologist. Her father was from Glasgow, Scotland. Imrie was educated at Guildford High School, an independent school for girls in her hometown of Guildford, followed by the Guildford School of Acting. Imrie's varied career spans films, television and radio drama, and the theatre. Her film credits include Nanny McPhee, Hilary and Jackie (playing Iris du Pré) and the 1997 film of The Borrowers where she played Homily Clock. Other films include Bridget Jones's Diary, Calendar Girls, Highlander and, as Fighter Pilot Bravo 5, in Star Wars: Episode I - The Phantom Menace. In 2004, Imrie played Doctor Imogen Reed in the schoolgirl thriller, Out of Bounds. In 2007 Imrie appeared in St Trinian's. Television series to feature Imrie include The Nightmare Man, Oranges Are Not the Only Fruit, Casualty, Absolutely Fabulous, \"Bergerac\",The Darling Buds of May and Upstairs, Downstairs. In the 2000 miniseries of Gormenghast, she played Lady Gertrude. She also had a guest appearance in an episode of the BBC Scotland sitcom Still Game in 2003, where she played a home help called Mrs Begg. She also appeared in the 2005 BBC television drama Mr. Harvey Lights a Candle, playing the part of a teacher taking an unruly party of pupils on a day-trip to Salisbury Cathedral. She starred in the BBC sitcom, After You've Gone, alongside Nicholas Lyndhurst and in the ITV1 drama Kingdom, with Stephen Fry. Her part in After You've Gone has, whilst being critically acclaimed, been described as \"criminally squandered\". In 2013 she guest starred in the BBC's Doctor Who where she played the villainous Miss Kizlet in the series opener The Bells of Saint John. Her radio work includes parts in BBC Radio 4's No Commitments, Adventures of a Black Bag, and Bleak Expectations. In early 2007, she narrated the book Arabella, broadcast over two weeks as the Book at Bedtime. In May 2016, she made her US television debut in the DC action-adventure series Legends of Tomorrow. Imrie is perhaps best known for her frequent collaborations with Victoria Wood, with whom she has appeared in TV programmes such as the sitcom Dinnerladies and sketch show Victoria Wood As Seen On TV. It was on the latter show in 1985 that she first played the infamous part of Miss Babs, owner of Acorn Antiques, a parody of the low budget British soap opera Crossroads. These sketches became such a British institution that the show was turned into a West End musical in 2005 starring most of the original cast (see the picture on the right). Imrie won an Olivier Award for her performance. The character has curly blonde hair, and is known for her frequent parodic flirtations with the customers, and her abuse of the housekeeper Mrs Overall (portrayed by Julie Walters). Imrie was the guest on Desert Island Discs on BBC Radio 4 on 13 February 2011. On 18 October 2013 she was awarded an honorary doctorate by the University of Winchester.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY2ODkzOTE2NF5BMl5BanBnXkFtZTgwNDAwODA2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0408309","name":"Celia Imrie","nicknames":["Impie","Ceals","Celia Impie"],"idIMDB":"nm0408309"},"actorId":"nm0408309","character":"Homily Clock","urlCharacter":"http://www.imdb.com/character/ch0075605","main":true},{"actorName":"Flora Newbigin","urlProfile":"http://www.imdb.com/name/nm0627657","urlPhoto":"","biography":{"bio":"Flora Newbigin is an actress, known for The Borrowers (1997), Perspective (2011) and Walking on the Moon (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0627657","name":"Flora Newbigin","idIMDB":"nm0627657"},"actorId":"nm0627657","character":"Arrietty 'Ett' Clock","urlCharacter":"http://www.imdb.com/character/ch0075606","main":true},{"actorName":"Tom Felton","urlProfile":"http://www.imdb.com/name/nm0271657","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzY5ODgxOTQyMl5BMl5BanBnXkFtZTgwNjM5Njc4NTE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 September 1987","placeOfBirth":" Epsom, Surrey, England, UK","birthName":"Thomas Andrew Felton","height":"5' 9\" (1.75 m)","bio":"Tom Felton was born in Epsom, Surrey, to Sharon and Peter Felton. He has been acting since he was 8 years old at the suggestion of an actress friend of his family who recognized Felton's theatrical qualities. Felton met with an agent, and two weeks later, after auditioning with over 400 other children, he landed an international commercial campaign and went abroad to work. A talented singer, he started singing in a church choir at the age of 7 and has been a member of four choirs at school. He declined an offer to join the Guildford Cathedral Choir. He is a keen sportsman enjoying football (soccer), ice skating, roller blading, basketball, cricket, swimming, and tennis. After working on Anna and the King (1999) with Jodie Foster, Tom received his big break in Harry Potter and the Sorcerer's Stone (2001) as Draco Malfoy, school boy rival to the titular character as played by Daniel Radcliffe. Tom managed to film the part of Draco in all eight \"Harry Potter\" movies while also having an active life outside the magical world it created. In between shoots he filmed independent horror movies The Disappeared (2008), Night Wolf (2010), and The Apparition (2012) with Twilight's Ashley Greene. It was directly after completing his filming on \"Harry Potter\" that he landed his roles in Rise of the Planet of the Apes (2011) and From the Rough (2013). His newest projects are In Secret (2013), Fangs of War (????) and Attachment. In between acting gigs, Tom still manages times with his music. He is one of the founding owners and talent of Six String Productions, a recording company devoted to signing young musical artists overlooked by the major recording industry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzY5ODgxOTQyMl5BMl5BanBnXkFtZTgwNjM5Njc4NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0271657","name":"Tom Felton","idIMDB":"nm0271657"},"actorId":"nm0271657","character":"Peagreen Clock","urlCharacter":"http://www.imdb.com/character/ch0461469","main":true},{"actorName":"Raymond Pickard","urlProfile":"http://www.imdb.com/name/nm0681759","urlPhoto":"","biography":{"dateOfBirth":"31 July 1982","placeOfBirth":" Liverpool, Merseyside, England, UK","bio":"Raymond Pickard was born on July 31, 1982 in Liverpool, Merseyside, England. He is an actor and producer, known for The Borrowers (1997), The Canterville Ghost (1996) and Brothers of the Head (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0681759","name":"Raymond Pickard","idIMDB":"nm0681759"},"actorId":"nm0681759","character":"Spud Spiller","urlCharacter":"http://www.imdb.com/character/ch0182214","main":true},{"actorName":"Bradley Pierce","urlProfile":"http://www.imdb.com/name/nm0682300","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ1Njc2NTE3M15BMl5BanBnXkFtZTgwMDY2MTA2MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 October 1982","placeOfBirth":"","height":"5' 5\" (1.65 m)","bio":"Bradley Pierce was born and raised in Arizona. He moved to southern California to begin acting at age 6 and has since appeared in various projects ranging from commercial and voiceover to television and film. He is known for voicing Chip in Disney's Beauty and the Beast and Tails in the Saturday morning cartoon series Sonic the Hedgehog. Other roles include Peter in Jumanji and a starring role as Pete Lender in The Borrowers with John Goodman. Pierce and appeared with Patty Duke and Melissa Gilbert in the TV film Cries from the Heart/Touch of Truth as an autistic child named Michael. Bradley has been involved with many charities throughout his life. He received a mayoral commendation from the City of San Diego for his work with \"Reading is Fundamental\" and worked for several years with the Los Angeles based \"Kids With A Cause\" helping initially as a youth ambassador, and eventually serving as spokesperson for a year. He has also worked with \"The Red Cross\" and \"Los Angeles Children's Hospital\". Bradley works with \"the Y\" (formerly known as the YMCA) as a counselor and outdoor skills instructor and is still an active cancer research advocate. Bradley Pierce is married to Shari Holmes since May 6th 2005. The couple have two sons named Gavin (Born Sept. 30 2005) and Dorian (Born July 14, 2008) and one Daughter Lorelai (Born January 20, 2014). In addition to acting Bradley is producing short films and new media \"Geek\" content with the production company \"ZFO Entertainment\", a company he started with his good friend and fellow actor J. Paul Zimmerman (Joey Zimmerman. They are primarily working as a press/media outlet, in addition to producing their own short film content. Their first short film \"Vultures\" is slated for release late 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ1Njc2NTE3M15BMl5BanBnXkFtZTgwMDY2MTA2MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0682300","name":"Bradley Pierce","idIMDB":"nm0682300"},"actorId":"nm0682300","character":"Pete Lender","urlCharacter":"http://www.imdb.com/character/ch0193846","main":true},{"actorName":"Aden Gillett","urlProfile":"http://www.imdb.com/name/nm0319010","urlPhoto":"","biography":{"dateOfBirth":"8 November 1958","placeOfBirth":" Aden, Yemen","height":"6' 2\" (1.88 m)","bio":"Aden Gillett was born on November 8, 1958 in Aden, Yemen. He is an actor, known for Shadow of the Vampire (2000), The House of Eliott (1991) and The Borrowers (1997). He has been married to Sara Stewart since October 18, 1992. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0319010","name":"Aden Gillett","idIMDB":"nm0319010"},"actorId":"nm0319010","character":"Joe Lender","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Doon Mackichan","urlProfile":"http://www.imdb.com/name/nm0533489","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4ODI3MDcyNl5BMl5BanBnXkFtZTcwMzczMzIxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"August1962","placeOfBirth":" London, England, UK","birthName":"Sarah-Doon Mackichan","height":"5' 9\" (1.75 m)","bio":"Doon Mackichan was born in August 1962 in London, England as Sarah-Doon Mackichan. She is an actress and writer, known for Smack the Pony (1999), The Borrowers (1997) and Toast of London (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4ODI3MDcyNl5BMl5BanBnXkFtZTcwMzczMzIxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0533489","name":"Doon Mackichan","idIMDB":"nm0533489"},"actorId":"nm0533489","character":"Victoria Lender","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hugh Laurie","urlProfile":"http://www.imdb.com/name/nm0491402","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDYzNjAzMTYwOF5BMl5BanBnXkFtZTcwMTc3NTcxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 June 1959","placeOfBirth":" Oxford, Oxfordshire, England, UK","birthName":"James Hugh Calum Laurie","height":"6' 2½\" (1.9 m)","bio":"Hugh was born in Oxford, England on June 11, 1959, to Patricia (Laidlaw) and William George Ranald Mundell \"Ran\" Laurie, a doctor, both of Scottish descent. He was educated at Eton and Cambridge. Son of an Olympic gold medalist in the sport, he rowed for the England youth team (1977) and for Cambridge (1980). He met Emma Thompson at Cambridge in 1978 when both joined \"Footlights\" and was introduced to Stephen Fry by Emma in 1980. Hugh is married and lives in Los Angeles. His wife and three children, who previously lived in London, are moving to Los Angeles to live with him. Besides acting and comedy, he has written the best-selling thriller The Gun Seller. A second novel, titled The Paper Soldier, is forthcoming.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDYzNjAzMTYwOF5BMl5BanBnXkFtZTcwMTc3NTcxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0491402","name":"Hugh Laurie","idIMDB":"nm0491402"},"actorId":"nm0491402","character":"Police Officer Steady","urlCharacter":"http://www.imdb.com/character/ch0376328","main":true},{"actorName":"Ruby Wax","urlProfile":"http://www.imdb.com/name/nm0915375","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEzMzc1MjY4NDJeQTJeQWpwZ15BbWU3MDE0ODMwMjg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 April 1953","placeOfBirth":" Evanston, Illinois, USA","birthName":"Ruby Wachs","height":"5' 2\" (1.57 m)","bio":"Ruby Wax was born on April 19, 1953 in Evanston, Illinois, USA as Ruby Wachs. She is known for her work on Ruby (1997), Ruby's American Pie (1999) and The Waiting Game (2001). She has been married to Ed Bye since May 16, 1988. They have three children. She was previously married to Trevor Walton and Andrew Porter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEzMzc1MjY4NDJeQTJeQWpwZ15BbWU3MDE0ODMwMjg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0915375","name":"Ruby Wax","idIMDB":"nm0915375"},"actorId":"nm0915375","character":"Town Hall Clerk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrew Dunford","urlProfile":"http://www.imdb.com/name/nm0242222","urlPhoto":"","biography":{"bio":"Andrew Dunford was born in England. He is an actor, known for La légende du pianiste sur l'océan (1998), Quills (2000) and The Borrowers (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0242222","name":"Andrew Dunford","idIMDB":"nm0242222"},"actorId":"nm0242222","character":"Dustbunny Binn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bob Goody","urlProfile":"http://www.imdb.com/name/nm0329586","urlPhoto":"","biography":{"bio":"Bob Goody is an actor and writer, known for Le cuisinier, le voleur, sa femme et son amant (1989), Le voleur de Venise (2006) and The Borrowers (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0329586","name":"Bob Goody","idIMDB":"nm0329586"},"actorId":"nm0329586","character":"Minty Branch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patrick Monckton","urlProfile":"http://www.imdb.com/name/nm0597649","urlPhoto":"","biography":{"dateOfBirth":"9 June 1947","placeOfBirth":" Hungary","bio":"Patrick Monckton was born on June 9, 1947 in Hungary. He is an actor, known for Keeping Mum (2005), The Borrowers (1997) and The Dark Crystal (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0597649","name":"Patrick Monckton","idIMDB":"nm0597649"},"actorId":"nm0597649","character":"Swag","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0118755","urlIMDB":"http://www.imdb.com/title/tt0118755","business":{"budget":{"money":"$29,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$6,075,079","country":"USA","day":"16","month":"02","year":"1998","remarks":"1,535 Screens"},{"money":"DEM 640,552","country":"Germany","day":"14","month":"12","year":"1997","remarks":"355 Screens"}],"gross":[{"money":"$22,359,293","country":"USA","day":"10","month":"05","year":"1998","remarks":""},{"money":"$22,301,008","country":"USA","day":"03","month":"05","year":"1998","remarks":""},{"money":"$22,188,266","country":"USA","day":"26","month":"04","year":"1998","remarks":""},{"money":"$22,047,877","country":"USA","day":"19","month":"04","year":"1998","remarks":""},{"money":"$21,806,489","country":"USA","day":"12","month":"04","year":"1998","remarks":""},{"money":"$21,578,472","country":"USA","day":"05","month":"04","year":"1998","remarks":""},{"money":"$21,231,001","country":"USA","day":"29","month":"03","year":"1998","remarks":""},{"money":"$20,601,297","country":"USA","day":"22","month":"03","year":"1998","remarks":""},{"money":"$19,008,365","country":"USA","day":"15","month":"03","year":"1998","remarks":""},{"money":"$17,270,127","country":"USA","day":"08","month":"03","year":"1998","remarks":""},{"money":"$14,533,004","country":"USA","day":"01","month":"03","year":"1998","remarks":""},{"money":"$11,232,084","country":"USA","day":"22","month":"02","year":"1998","remarks":""},{"money":"$6,075,079","country":"USA","day":"15","month":"02","year":"1998","remarks":""},{"money":"£7,457,014","country":"UK","day":"08","month":"02","year":"1998","remarks":""},{"money":"£7,335,794","country":"UK","day":"01","month":"02","year":"1998","remarks":""},{"money":"£7,119,740","country":"UK","day":"25","month":"01","year":"1998","remarks":""},{"money":"£6,871,887","country":"UK","day":"18","month":"01","year":"1998","remarks":""},{"money":"£6,504,140","country":"UK","day":"11","month":"01","year":"1998","remarks":""},{"money":"£5,885,986","country":"UK","day":"04","month":"01","year":"1998","remarks":""},{"money":"$24,000,000","country":"Worldwide","day":"11","month":"10","year":"1998","remarks":"except USA"},{"money":"$16,600,000","country":"Worldwide","day":"22","month":"02","year":"1998","remarks":"except USA"}],"weekendGross":[{"money":"$2,073,962","country":"USA","day":"08","month":"03","year":"1998","remarks":"1,581 Screens"},{"money":"$2,831,184","country":"USA","day":"01","month":"03","year":"1998","remarks":"1,606 Screens"},{"money":"$4,011,304","country":"USA","day":"22","month":"02","year":"1998","remarks":"1,593 Screens"},{"money":"$6,075,079","country":"USA","day":"15","month":"02","year":"1998","remarks":"1,535 Screens"},{"money":"£109,090","country":"UK","day":"08","month":"02","year":"1998","remarks":"238 Screens"},{"money":"£202,022","country":"UK","day":"01","month":"02","year":"1998","remarks":"288 Screens"},{"money":"£220,901","country":"UK","day":"25","month":"01","year":"1998","remarks":"302 Screens"},{"money":"£314,268","country":"UK","day":"18","month":"01","year":"1998","remarks":"344 Screens"},{"money":"£347,729","country":"UK","day":"11","month":"01","year":"1998","remarks":"380 Screens"},{"money":"£750,565","country":"UK","day":"04","month":"01","year":"1998","remarks":"396 Screens"}],"admissions":[{"money":"573,861 (France)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"203,252","country":"Germany","day":"29","month":"12","year":"1997","remarks":""},{"money":"136,456","country":"Germany","day":"22","month":"12","year":"1997","remarks":""},{"money":"181,284","country":"Netherlands","day":"31","month":"12","year":"1999","remarks":""},{"money":"180,546","country":"Netherlands","day":"31","month":"12","year":"1998","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"23","month":"09","year":"1996","remarks":null},{"money":null,"country":null,"day":"31","month":"01","year":"1997","remarks":null}],"copyrightHolder":"PolyGram Filmed Entertainment, Inc., 1997"},"technical":{"runtime":["1 hr 29 min (89 min)"],"soundMix":["Dolby Digital","SDDS (uncredited)","DTS (uncredited)"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":null,"filmLength":["2,446 m"],"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.8","filmingLocations":[{"location":"Ealing Town Hall, Ealing, London, England, UK"}],"rated":"PG","awards":[{"award":"BAFTA Awards 1998","titlesAwards":[{"titleAwardOutcome":"Nominated Alexander Korda Award for Best British Film","categories":[{"category":"","names":[{"name":"Tim Bevan","id":"nm0079677","role":null},{"name":"Eric Fellner","id":"nm0271479","role":null},{"name":"Rachel Talalay","id":"nm0003080","role":null}]}]},{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best Special Effects","names":[{"name":"Peter Chiang","id":"nm0156979","role":null}]}]}]},{"award":"Motion Picture Sound Editors, USA 1999","titlesAwards":[{"titleAwardOutcome":"Won Golden Reel Award","categories":[{"category":"Best Sound Editing - Foreign Feature","names":[{"name":"Peter Joly","id":"nm0427259","role":"supervising sound editor"},{"name":"Adrian Rhodes","id":"nm0722376","role":"sound effects editor"},{"name":"William Trent","id":"nm0872172","role":"adr editor"},{"name":"Danny Longhurst","id":"nm0519334","role":"dialogue editor"},{"name":"Ian Wilson","id":"nm0933511","role":"foley editor"}]}]}]},{"award":"Young Artist Awards 1999","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Performance in a Feature Film - Young Ensemble","names":[{"name":"Bradley Pierce","id":"nm0682300","role":null},{"name":"Hugh Laurie","id":"nm0491402","role":null},{"name":"Mark Williams","id":"nm0931247","role":null},{"name":"Flora Newbigin","id":"nm0627657","role":null}]},{"category":"Best Family Feature - Comedy","names":[]}]}]}],"votes":"16,908","type":"Movie","companyCreditsSimple":[{"idCompany":"co0030612","name":"Polygram Filmed Entertainment"},{"idCompany":"co0057311","name":"Working Title Films"}],"keywords":{"keywords":["child's point of view","house","real estate","lawyer","washing machine","wind up toy","roller skate","walnut","ceiling fan","zip line","bug spray","asking for directions","city hall","van","contraption","rube goldberg machine","electrical wire","chauffeured limousine","adhesive tape","child protagonist","mugshot","police station","waste basket","dustpan","wrench","sewer","peg","family in danger","milk","cheese","kitchen","marshmallow","flatulence","hound dog","orange juice","milk bottle","toaster","trapped in a freezer","ice cream","architectural model","crooked lawyer","tied up","store room","arrest","policeman","scene during end credits","scene during opening credits","little boy","boy","child in peril","drainpipe","rooftop","foam","electrocution","tape measure","light bulb","sneezing","factory","hiding under floorboards","bicycle","freezer","removal van","moving out","tin can","ginger","redhead","red hair","cell phone","breaking through a wall","safe","walkie talkie","refrigerator","watching tv","toy soldier","ice cube","dog feces","hammer","stethoscope","candle","vacuum cleaner","family home","brother sister relationship","mother daughter relationship","father daughter relationship","mother son relationship","father son relationship","husband wife relationship","two word title","miniature person","lifting person in air","slapstick comedy","last will and testament","family relationships","electric battery","tenant","friendship","eviction","affection","dog","exterminator","moving van","police","safecracker","deception","dairy","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:27:12"}}