{"data":{"movies":[{"title":"Pure Luck","originalTitle":"","year":"1991","releaseDate":"19910809","directors":[{"name":"Nadia Tass","id":"nm0850958"}],"writers":[{"name":"Francis Veber","id":"nm0891554"},{"name":"Herschel Weingrod","id":"nm0918339"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjgxMTk3Nl5BMl5BanBnXkFtZTYwODIyOTg5._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Comedy","Crime","Mystery"],"plot":"The daughter of a wealthy businessman has disappeared in Mexico, and all the efforts to find her have been unsuccessful. A psychologist, knowing that the girl has an ultra bad luck, persuades her father to send to Mexico one of his employees, an accountant with super bad luck, to find her. Perhaps he will be lucky, and his bad luck could help to find the unlucky girl...","simplePlot":"The daughter of a wealthy businessman has disappeared in Mexico, and all the efforts to find her have been unsuccessful. A psychologist, knowing that the girl has an ultra bad luck, ... ","actors":[{"actorName":"Martin Short","urlProfile":"http://www.imdb.com/name/nm0001737","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MDIyMDY1N15BMl5BanBnXkFtZTgwNzMzMDE5NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1950","placeOfBirth":" Hamilton, Ontario, Canada","birthName":"Martin Hayter Short","height":"5' 8\" (1.73 m)","bio":"Martin Short was born on March 26, 1950 in Hamilton, Ontario, Canada as Martin Hayter Short. He is an actor and writer, known for The Martin Short Show (1999), Frankenweenie (2012) and Mars Attacks! (1996). He was previously married to Nancy Dolman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MDIyMDY1N15BMl5BanBnXkFtZTgwNzMzMDE5NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001737","name":"Martin Short","nicknames":["Marty","Shorty"],"idIMDB":"nm0001737"},"actorId":"nm0001737","character":"Eugene Proctor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danny Glover","urlProfile":"http://www.imdb.com/name/nm0000418","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODM2MzQwN15BMl5BanBnXkFtZTcwMjY2OTI5MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1946","placeOfBirth":" San Francisco, California, USA","birthName":"Danny Lebern Glover","height":"6' 4\" (1.93 m)","bio":"Actor, producer and humanitarian Danny Glover has been a commanding presence on screen, stage and television for more than 25 years. Glover was born in San Francisco, California, to Carrie (Hunley) and James Glover, postal workers who were also active in civil rights. Glover trained at the Black Actors' Workshop of the American Conservatory Theater. It was his Broadway debut in Fugard's Master Harold...and the Boys, which brought him to national recognition and led director Robert Benton to cast Glover in his first leading role in 1984's Oscar®-nominated Best Picture Places in the Heart. The following year, Glover starred in two more Best Picture nominees: Peter Weir's Witness and Steven Spielberg's The Color Purple. In 1987, Glover partnered with Mel Gibson in the first Lethal Weapon film and went on to star in three hugely successful Lethal Weapon sequels. Glover has also invested his talents in more personal projects, including the award-winning To Sleep With Anger, which he executive produced and for which he won an Independent Spirit Award for Best Actor; Bopha!; Manderlay; Missing in America; and the film version of Athol Fugard's play Boesman and Lena. On the small screen, Glover won an Image Award and a Cable ACE Award and earned an Emmy nomination for his performance in the title role of the HBO movie Mandela. He has also received Emmy nominations for his work in the acclaimed miniseries Lonesome Dove and the telefilm Freedom Song. As a director, he earned a Daytime Emmy nomination for Showtime's Just a Dream. Glover's film credits range from the blockbuster Lethal Weapon franchise to smaller independent features, some of which Glover also produced. He co-starred in the critically acclaimed feature Dreamgirls directed by Bill Condon and in Po' Boy's Game for director Clement Virgo. He appeared in the hit feature Shooter for director Antoine Fuqua, Honeydripper for director John Sayles, and Be Kind, Rewind for director Michel Gondry. Glover has also gained respect for his wide-reaching community activism and philanthropic efforts, with a particular emphasis on advocacy for economic justice, and access to health care and education programs in the United States and Africa. For these efforts, Glover received a 2006 DGA Honor. Internationally, Glover has served as a Goodwill Ambassador for the United Nations Development Program from 1998-2004, focusing on issues of poverty, disease, and economic development in Africa, Latin America, and the Caribbean, and serves as UNICEF Ambassador. In 2005, Glover co-founded Louverture Films dedicated to the development and production of films of historical relevance, social purpose, commercial value and artistic integrity. The New York based company has a slate of progressive features and documentaries including Trouble the Water, which won the Grand Jury Prize at the 2008 Sundance Film Festival, Africa Unite, award winning feature Bamako, and most recent projects Uncle Boonmee Who Can Recall His Past Lives, and The Disappearance of McKinley Nolan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODM2MzQwN15BMl5BanBnXkFtZTcwMjY2OTI5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000418","name":"Danny Glover","idIMDB":"nm0000418"},"actorId":"nm0000418","character":"Raymond Campanella","urlCharacter":"http://www.imdb.com/character/ch0034343","main":true},{"actorName":"Sheila Kelley","urlProfile":"http://www.imdb.com/name/nm0445992","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NTkxMjI5NF5BMl5BanBnXkFtZTcwNDI4Mjc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1961","placeOfBirth":" Greensburg, Pennsylvania, USA","height":"5' 7\" (1.7 m)","bio":"When Sheila Kelley starred in and produced the film, Dancing at the Blue Iguana (2000), she prepared for the role of \"Stormy\" by learning how to striptease and pole dance. As a result, her body became long, lean and fit. She decided to take her knowledge of ballet, exercise and exotic dancing and combine them into a fitness dance workout for women called \"S Factor\"'. Kelley wrote \"The S Factor: Strip Workouts for Every Woman\" and has several \"S Factor\" exercise DVDs. Her roles on L.A. Law (1986), Sisters (1991), ER (1994) and The Sopranos (1999) and in films including Singles (1992), Matchstick Men (2003), Nurse Betty (2000) and One Fine Day (1996) have earned her respect, as an actress who is not afraid of embracing the power of her femininity. She is married to actor Richard Schiff, of The West Wing (1999), and has two children, Gus and Ruby. By: S Factor","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NTkxMjI5NF5BMl5BanBnXkFtZTcwNDI4Mjc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0445992","name":"Sheila Kelley","idIMDB":"nm0445992"},"actorId":"nm0445992","character":"Valerie Highsmith","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sam Wanamaker","urlProfile":"http://www.imdb.com/name/nm0910737","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNDgxMDc4MV5BMl5BanBnXkFtZTcwMTY4ODcwOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 June 1919","placeOfBirth":" Chicago, Illinois, USA","birthName":"Samuel Watenmaker","height":"5' 11½\" (1.82 m)","bio":"Actor and director Sam Wanamaker was born in Chicago, Illinois, to Ukrainian Jewish immigrants, Molly (Babell) and Maurice Wattenmaker, a tailor. He studied at Drake University, IA, then trained at Goodman Theatre, Chicago, worked with summer stock companies in Chicago as an actor and director, and made his London debut in 1952. In 1957, he was appointed director of the New Shakespeare Theatre, Liverpool, and in 1959 joined the Shakespeare Memorial Theatre company at Stratford-upon-Avon. He produced or directed several works at Covent Garden and elsewhere in the 1960s and 1970s, including the Shakespeare Birthday Celebrations in 1974. He worked both as director and actor in films and television, his appearances included The Spiral Staircase (1975), Private Benjamin (1980), Superman IV: The Quest for Peace (1987), and Baby Boom (1987). Married to Charlotte Holland, his daughter is actress Zoë Wanamaker.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNDgxMDc4MV5BMl5BanBnXkFtZTcwMTY4ODcwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0910737","name":"Sam Wanamaker","idIMDB":"nm0910737"},"actorId":"nm0910737","character":"Highsmith","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott Wilson","urlProfile":"http://www.imdb.com/name/nm0934113","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMjA2MDA4NF5BMl5BanBnXkFtZTgwNDM4MzMzNDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 March 1942","placeOfBirth":" Atlanta, Georgia, USA","height":"5' 10¾\" (1.8 m)","bio":"One chillingly infamous screen role for Scott Wilson in 1967 set the tone for an actor who went on to prove himself an invaluable character player for the past five decades. The Georgia-born native (Atlanta born and raised) was awarded a basketball scholarship following high school at Georgia's Southern Tech University to study architecture. Instead, Wilson hitchhiked to Los Angeles on a whim and hooked up one day with an actor he met in a bar who took him to one of his auditions. Allowed to audition himself by chance, Wilson lost the part but was absolutely hooked. Working an assortment of menial jobs, he studied for nearly five years while gaining experience in such local theater productions as \"The Importance of Being Earnest.\" Scott's fledgling career took off big time after being discovered by director Norman Jewison who cast him as a murder suspect in In the Heat of the Night (1967) starring Sidney Poitier and \"Best Actor\" Oscar winner Rod Steiger. If that weren't a sufficient beginning, Wilson immediately followed this with the co-lead role of murderer Richard Hickok in the stark and disturbing In Cold Blood (1967), a superlative adaptation of Truman Capote best-selling docu-novel. It didn't hurt that Scott himself had a startling resemblance to the real-life killer. Partnering up with Robert Blake as two ex-cons who are eventually executed for the senseless, brutal slaughter of an entire Kansas farm family, the critically acclaimed film put both men squarely on the movie map. Although a serious contender, out-and-out stardom did not come about for the quietly handsome, slightly forlorn-looking actor. Major roles in major pictures, however, did. Among Scott's early film work were Castle Keep (1969) and The Gypsy Moths (1969), both starring Burt Lancaster; The Grissom Gang (1971); Lolly-Madonna XXX (1973) (again with Steiger); The New Centurions (1972); The Great Gatsby (1974), in which he earned raves as the garage owner who shoots Robert Redford's title character to death in Gatsby's backyard swimming pool; The Ninth Configuration (1980), for which he received a Golden Globe nomination; The Right Stuff (1983); the Venice Film Festival winner L'année du soleil calme (1984) [A Year of the Quiet Sun]; Malone (1987) and Johnny Handsome (1989). TV also showed off Scott's dark, controlled intensity and wide range in later years, appearing in guest spots on such popular dramas as \"The X-Files\" and \"The Twilight Zone,\" and in a recurring role as Marg Helgenberger's unscrupulous mobster father in \"CSI.\" In minimovies Scott played everything from Elvis's father in Elvis and the Colonel: The Untold Story (1993) to a Wyoming governor in The Jack Bull (1999). Hardly one of Hollywood's flashiest good ol' boys, the taciturn, unassuming actor has preferred to remain discrete and let his performances do the talking. His output has been minimal compared with other character stars, but he has remained in the quality ranks nevertheless, mixing his standard penchant for darker movies with such family-oriented films as Shiloh (1996) and its 2006 sequel. Supporting the newer \"young guns\" these days, he appeared with Vince Vaughn in Clay Pigeons (1998) and Ryan Phillippe in The Way of the Gun (2000), and ended up one of serial killer Charlize Theron's victims in Monster (2003). Other strong showings on the big screen have included a lead part as a rockabilly star in Don't Let Go (2002) and his down-home patriarch in the superb ensemble art film Junebug (2005), a breakout hit with Academy voters. More recently, Scott has gained a following sporting a full grey beard and ponytailed as grizzled farm owner Hershel Greene in the cable series The Walking Dead: Webisodes (2011). Wilson resides in Los Angeles along with his wife of nearly four decades, Heavenly, an attorney and accomplished artist and writer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMjA2MDA4NF5BMl5BanBnXkFtZTgwNDM4MzMzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0934113","name":"Scott Wilson","idIMDB":"nm0934113"},"actorId":"nm0934113","character":"Frank Grimes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harry Shearer","urlProfile":"http://www.imdb.com/name/nm0733427","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNDg4MzA5OF5BMl5BanBnXkFtZTYwOTM3MDc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 December 1943","placeOfBirth":" Los Angeles, California, USA","birthName":"Harry Julius Shearer","height":"5' 6½\" (1.69 m)","bio":"Harry Shearer was born in 1943 in Los Angeles, California. His film debut was with Bud Abbott and Lou Costello in Abbott and Costello Go to Mars (1953), followed by The Robe (1953). Probably best known for his Saturday Night Live (1975) gigs, his NPR satire program \"Le Show\" and The Simpsons (1989), where he plays 21 characters. His best film may be This Is Spinal Tap (1984), where he played bass player Derek Smalls. There was also an episode on The Simpsons (1989) where he reprised this role. His film work includes Godzilla (1998), in which \"Simpsons\" cast members Hank Azaria and Nancy Cartwright also appeared. Shearer has also directed a film, Teddy Bears' Picnic (2002), in which he also stars.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNDg4MzA5OF5BMl5BanBnXkFtZTYwOTM3MDc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0733427","name":"Harry Shearer","idIMDB":"nm0733427"},"actorId":"nm0733427","character":"Monosoff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jorge Russek","urlProfile":"http://www.imdb.com/name/nm0750930","urlPhoto":"","biography":{"dateOfBirth":"4 January 1932","placeOfBirth":" Guaymas, Sonora, Mexico","bio":"Jorge Russek was born on January 4, 1932 in Guaymas, Sonora, Mexico. He is known for his work on The Wild Bunch (1969), Licence to Kill (1989) and Ámbar (1994). He died on July 30, 1998.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0750930","name":"Jorge Russek","idIMDB":"nm0750930"},"actorId":"nm0750930","character":"Inspector Segura","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rodrigo Puebla","urlProfile":"http://www.imdb.com/name/nm0699885","urlPhoto":"","biography":{"dateOfBirth":"13 March 1929","placeOfBirth":" San Diego de La Union, Guanajuato, Mexico","birthName":"Rodrigo Arredondo Puebla","bio":"Rodrigo Puebla was born on March 13, 1929 in San Diego de La Union, Guanajuato, Mexico as Rodrigo Arredondo Puebla. He was an actor, known for Romancing the Stone (1984), El Norte (1983) and Pure Luck (1991). He died on January 15, 1993 in Mexico City, Mexico.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0699885","name":"Rodrigo Puebla","idIMDB":"nm0699885"},"actorId":"nm0699885","character":"Fernando","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John H. Brennan","urlProfile":"http://www.imdb.com/name/nm0107323","urlPhoto":"","biography":{"bio":"John H. Brennan was born in Montréal, Québec, Canada. He is an actor, known for Les deux font la loi (1989), Another World (1964) and Pure Luck (1991).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0107323","name":"John H. Brennan","idIMDB":"nm0107323"},"actorId":"nm0107323","character":"Tyler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jorge Luke","urlProfile":"http://www.imdb.com/name/nm0525599","urlPhoto":"","biography":{"dateOfBirth":"1942","placeOfBirth":" Mexico City, Distrito Federal, Mexico","birthName":"Jorge Oscura Lango","bio":"Jorge Luke was born in 1942 in Mexico City, Distrito Federal, Mexico as Jorge Oscura Lango. He was an actor and director, known for Clear and Present Danger (1994), Salvador (1986) and Ulzana's Raid (1972). He was married to Gloria Palacios Guzman. He died on August 4, 2012 in Mexico City.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0525599","name":"Jorge Luke","idIMDB":"nm0525599"},"actorId":"nm0525599","character":"Pilot","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Abel Woolrich","urlProfile":"http://www.imdb.com/name/nm0941279","urlPhoto":"","biography":{"bio":"Abel Woolrich was an actor and producer, known for Apocalypto (2006), The Mask of Zorro (1998) and Vorace (1999). He died on May 12, 2006 in Mexico.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0941279","name":"Abel Woolrich","idIMDB":"nm0941279"},"actorId":"nm0941279","character":"Prisoner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patricia Gage","urlProfile":"http://www.imdb.com/name/nm0300833","urlPhoto":"","biography":{"dateOfBirth":"3 March 1940","placeOfBirth":" Glasgow, Scotland, UK","bio":"Patricia Gage was born on March 3, 1940 in Glasgow, Scotland. She was an actress, known for American Psycho (2000), As the World Turns (1956) and Rabid (1977). She was married to Paxton Whitehead. She died on January 31, 2010 in Niagara-on-the-Lake, Ontario, Canada.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0300833","name":"Patricia Gage","idIMDB":"nm0300833"},"actorId":"nm0300833","character":"Secretary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ariane Pellicer","urlProfile":"http://www.imdb.com/name/nm0671178","urlPhoto":"","biography":{"bio":"Ariane Pellicer is an actress and producer, known for Man on Fire (2004), Juro que te amo (2008) and Cachito de cielo (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0671178","name":"Ariane Pellicer","idIMDB":"nm0671178"},"actorId":"nm0671178","character":"Girl at Club","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexandra Vicencio","urlProfile":"http://www.imdb.com/name/nm0895875","urlPhoto":"","biography":{"bio":"Alexandra Vicencio is an actress, known for Deep Crimson (1996), Pure Luck (1991) and Sopa de pescado (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0895875","name":"Alexandra Vicencio","idIMDB":"nm0895875"},"actorId":"nm0895875","character":"Nurse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sharlene Martin","urlProfile":"http://www.imdb.com/name/nm0553057","urlPhoto":"","biography":{"bio":"Sharlene Martin Ludwig is a Vancouver, British Columbia-bred actress who made her debut as 'Melissa Martin' in the direct-to-video slasher flick Possession (1987). Changing her name to Sharlene, she guest-starred on an episode of the Canadian television drama Les deux font la loi (1989) before playing evil Tamara Mason in Friday the 13th Part VIII: Jason Takes Manhattan (1989). Most of Sharlene's television roles were on Vancouver-based series, such as Broken Badges (1990), The Hat Squad (1992), Street Justice (1991) and Two (1996). She had very small roles in major movies like Mystery Date (1991) and Pure Luck (1991). Her most prominent role was in the excellent thriller Breaking Point (1994), which starred Gary Busey, Kim Cattrall, and gay-male-porn star turned soap opera star, Jeff Griggs. Sharlene played Kim's co-worker at a store, and she almost fell prey to Jeff's charms. Her other roles included the television-movie The Comrades of Summer (1992), Cafe Romeo (1991) and Double Cross (1994). She married Vancouver businessman, Harald H. Ludwig in 1991. She gave birth to the couples first child, actor Alexander Ludwig, on May 7, 1992 and has since had three other children: Nicholas, Natalie and Sophia.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0553057","name":"Sharlene Martin","idIMDB":"nm0553057"},"actorId":"nm0553057","character":"Nurse","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0102729","urlIMDB":"http://www.imdb.com/title/tt0102729","business":{"budget":{"money":"$17,010,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1990/\">1990</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 36 min (96 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"5.7","filmingLocations":[{"location":"Vancouver, British Columbia, Canada"}],"rated":"PG","awards":[],"votes":"5,480","type":"Movie","companyCreditsSimple":[{"idCompany":"co0007038","name":"Sean Daniel Company"},{"idCompany":"co0031306","name":"Silver Lion Films"},{"idCompany":"co0005073","name":"Universal Pictures"}],"keywords":{"keywords":["luck","mexico","unlucky","fat suit","allergic reaction","title directed by female","vegetarian","clumsy","search for lost relative","private detective","bee sting","remake of french film","missing person","bee","remake","prison","search","accident","farce","missing","amnesia"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:34:06"}}