{"data":{"movies":[{"title":"Radioland Murders","originalTitle":"","year":"1994","releaseDate":"19941021","directors":[{"name":"Mel Smith","id":"nm0809321"}],"writers":[{"name":"George Lucas","id":"nm0000184"},{"name":"Willard Huyck","id":"nm0404754"}],"runtime":"108 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWRkYzc3YjYtNWY3Yy00Y2FmLTgyOTYtM2U2ZDg0MDA0MTIwXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Crime","Drama","Musical","Mystery","Romance"],"plot":"In 1939, WBN, a fourth radio network, is about to take to America's airwaves. As if the confusion of the premiere night wasn't enough, Penny Henderson, the owner's secretary, must deal with an unhappy sponsor, an overbearing boss and a soon-to-be ex-husband who desperately wants her back. As the broadcast begins, a mysterious voice breaks the broadcast and suddenly members of the cast turn up dead. It's up to her husband Roger, to find out whodunit as the police chase him through the halls of WBN.","simplePlot":"In 1939, WBN, a fourth radio network, is about to take to America's airwaves. As if the confusion of the premiere night wasn't enough, Penny Henderson, the owner's secretary, must deal with... ","actors":[{"actorName":"Brian Benben","urlProfile":"http://www.imdb.com/name/nm0000903","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMTQwNTQyNV5BMl5BanBnXkFtZTcwNjAyNjgwMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 June 1956","placeOfBirth":" Winchester, Virginia, USA","birthName":"Brian Edward Benben","height":"5' 6\" (1.68 m)","bio":"Charming, compactly built, extremely affable American actor Brian Edward Benben was born on June 18, 1956 in Winchester, Virginia, to Gloria Patricia (Coffman) and Peter Michael Benben, Sr., a produce buyer. His paternal grandparents were Polish. Deciding on an acting career while quite young, he started things out at age 17 performing in off-off-Broadway shows in New York. Such late 1970s theater works included \"Wild Oats,\" \"The Tooth of Crime,\" \"The Overcoat,\" \"Gossip\" \"A Moon for the Misbegotten\" and the role of Bottom in \"A Midsummer Night's Dream\". During his early 20s he began to pursue TV work and made an auspicious debut on the very serious side with the infamous The Gangster Chronicles (1981) in which his Michael Lasker character barely disguised that of real-life mobster Meyer Lansky. He also played a gay lover in the TV-movie drama American Playhouse: Family Business (1983) starring a straight-acting Milton Berle, and then portrayed Tom Hayden, the California senator who was once convicted, along with others, of inciting riots that disrupted the 1968 Democratic National Convention, in the re-dramatization of Conspiracy: The Trial of the Chicago 8 (1987). Brian also had supporting roles which also accentuated his serious side in the feature films Clean and Sober (1988), Dark Angel (1990) and Mortal Sins (1989). Regular series work came in the late 1980s playing a chauvinistic hospital resident who felt women had no place being surgeons on the short-lived medical drama Kay O'Brien (1986). But it was the sexually frank sitcom Dream On (1990) that catapulted Brian to stardom as the self-effacing, newly-divorced book editor Martin Tupper. The cable show, which took on a whimsical, if much more hormonal, Thurber-like feel, lasted six seasons. During that run he was given a choice starring part in the film Radioland Murders (1994). Had the series been on prime-time channel (it was on Fox briefly in 1995), his star-power might have illuminated even stronger. Nevertheless, this led to his second starring sitcom role in which he used his real name to play a news co-anchor on the very aptly-titled The Brian Benben Show (1998) for CBS. The show, in which he was co-executive producer, had a much shorter life than \"Dream On\". Since then Brian has maintained amenably on TV, particularly in mini-movies. He was found mixing it up with Diane Keaton in the irreverent Sister Mary Explains It All (2001), playing at odds with William Hurt in the drama The Flamingo Rising (2001) and returning to his mob roots in the mini-series Kingpin (2003), this time as a morally-tormented surgeon. On stage Brian took his initial Broadway bow in \"Slab Boys\" alongside Sean Penn, Kevin Bacon and Val Kilmer. Brian has been married since 1982 to actress Madeleine Stowe, who played his wife Ruth Lasker in the \"Gangster\" series. The couple have a daughter (May Theodora, born 1996) and own a working cattle ranch in Texas.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMTQwNTQyNV5BMl5BanBnXkFtZTcwNjAyNjgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000903","name":"Brian Benben","idIMDB":"nm0000903"},"actorId":"nm0000903","character":"Roger Henderson","urlCharacter":"http://www.imdb.com/character/ch0154648","main":true},{"actorName":"Mary Stuart Masterson","urlProfile":"http://www.imdb.com/name/nm0000524","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MTAxODk3NF5BMl5BanBnXkFtZTgwNTM1OTQyMDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1966","placeOfBirth":" New York City, New York, USA","height":"5' 4\" (1.63 m)","bio":"Mary Stuart Masterson started acting before the age of ten, when she appeared in The Stepford Wives (1975) in 1975 with her father. Afterwards, at the direction of her parents, Mary Stuart led a life outside of the limelight, attending school in New York. She appeared in a few productions at New York's Dalton School. At the age of 15, the young actress appeared on Broadway in Eva Le Gallienne's version of Alice In Wonderland. She played two parts, the Four of Hearts and the Small White Rabbit. She returned to films in 1985 with the role of Dani in Heaven Help Us (1985). For eight months afterwards, Mary Stuart attended New York University, where she studied anthropology.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MTAxODk3NF5BMl5BanBnXkFtZTgwNTM1OTQyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000524","name":"Mary Stuart Masterson","idIMDB":"nm0000524"},"actorId":"nm0000524","character":"Penny Henderson","urlCharacter":"http://www.imdb.com/character/ch0154649","main":true},{"actorName":"Ned Beatty","urlProfile":"http://www.imdb.com/name/nm0000885","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMzQ2Mzc3MF5BMl5BanBnXkFtZTYwMDIwMDM1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1937","placeOfBirth":" Louisville, Kentucky, USA","birthName":"Ned Thomas Beatty","height":"5' 7\" (1.7 m)","bio":"Stocky, genial-looking supporting actor Ned Beatty was once hailed by Daily Variety as the \"busiest actor in Hollywood\". Ned Thomas Beatty was born in Louisville, Kentucky, to Margaret (Fortney) and Charles William Beatty. He grew up fishing and working on farms. His hometown of St. Matthews, Kentucky, is hardly the environment to encourage a career in the entertainment industry, though, so when asked, \"How did you get into show business?\" Beatty responds, \"By hanging out with the wrong crowd.\" That \"crowd\" includes some of the industry's most prominent names, such as John Huston, Steven Spielberg, Robert Altman, Paul Newman, Richard Burton, Charlton Heston, Marlon Brando and Robert Redford. Beatty has garnered praise from both critics and peers as a dedicated actor's actor. He started as a professional performer at age ten, when he earned pocket money singing in gospel quartets and a barber shop. The big city and bright lights did not come easy, though. The first ten years of Beatty's career were spent at the Barter Theater in Abingdon, Virginia. He then moved on to the Erie Playhouse in Pennsylvania, the Playhouse Theater in Houston, Texas, and the prestigious Arena Stage Company in Washington, D.C. He was also a member of Shakespeare in Central Park, Louisville, Kentucky. Later, he appeared in the Broadway production of \"The Great White Hope\". At the Mark Taper Forum in Los Angeles, he won rave reviews when he starred in \"The Accidental Death of an Anarchist\". In 1971, Beatty was chosen by director John Boorman for the role of Bobby Trippe in the hit film/backwoods nightmare Deliverance (1972). Co-star Burt Reynolds and Beatty struck up a friendship together, and Ned has since been cast by Burt in several other films together, including White Lightning (1973), W.W. and the Dixie Dancekings (1975), and the abysmal Stroker Ace (1983). Ned's talents were also noticed by others in Hollywood and he was cast in many key productions of the 1970s turning in stellar performance, including an Academy Award nomination of Best Supporting Actor for his role in Network (1976). Beatty was also marvelous in Nashville (1975), under fire from a crazed sniper in The Deadly Tower (1975), an undercover FBI man in the action/comedy Silver Streak (1976), as Lex Luthor's bumbling assistant, Otis, in the blockbuster Superman (1978)... and he returned again with Gene Hackman to play Otis and Lex Luthor again in Superman II (1980). Beatty continued to remain busy throughout the 1980s with appearances in several big budget television productions including Les derniers jours de Pompéi (1984). However, the overall caliber of the productions in general did not match up to those he had appeared in during the 1970s. Nonetheless, Beatty still shone in films including The Big Easy (1986) and The Fourth Protocol (1987). Into the 1990s, Beatty's work output swung between a mixture of roles in family orientated productions (Gulliver's Travels (1996), Back to Hannibal: The Return of Tom Sawyer and Huckleberry Finn (1990), etc.) taking advantage of his \"fatherly\" type looks, but he could still accentuate a hard edge, and additionally was cast in Radioland Murders (1994) and Just Cause (1995). His many other films include The Toy (1982), All the President's Men (1976), Wise Blood (1979), Rudy (1993), Spring Forward (1999), Hear My Song (1991) -- for which he earned a Golden Globe nomination for Best Supporting Actor -- Prelude to a Kiss (1992), He Got Game (1998) and Cookie's Fortune (1999). Beatty's numerous television credits include three years on the NBC series Homicide: Life on the Street (1993), Streets of Laredo (1995), and The Boys (1993). Beatty received an Emmy Award nomination for Best Actor for his performance in Friendly Fire (1979) opposite Carol Burnett, and a Best Supporting Actor nomination for Family Channel's Last Train Home (1989). Other notable credits include The Wool Cap (2004), The Execution of Private Slovik (1974), A Woman Called Golda (1982), Pray TV (1982), the miniseries Robert Kennedy and His Times (1985), Lockerbie: A Night Remembered (1998) and T Bone N Weasel (1992). He also had a recurring role on Roseanne (1988) and performed musically on television specials for Dolly Parton and The Smothers Brothers. In 2001, Beatty returned to his theatrical roots starring in London's West End revival production of Tennessee Williams' \"Cat on a Hot Tin Roof\" with Brendan Fraser. He also appeared in the production on Broadway in 2003/2004 with Jason Patric and Ashley Judd. In 2006, Beatty completed three features to be released next year: The Walker (2007); a Paul Schrader film also starring Woody Harrelson, Kristin Scott Thomas, and Lily Tomlin; Paramount's Shooter (2007) starring Mark Wahlberg; and Charlie Wilson's War (2007), a Mike Nichols film with Tom Hanks, Philip Seymour Hoffman and Julia Roberts. Blessed with eight children, Beatty enjoys golf and playing the bass guitar. He gives himself until the age of 70 to become proficient at both. Also in the 21st century, Beatty turned out a terrific performance in the popular Where the Red Fern Grows (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMzQ2Mzc3MF5BMl5BanBnXkFtZTYwMDIwMDM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000885","name":"Ned Beatty","nicknames":["The busiest actor in Hollywood"],"idIMDB":"nm0000885"},"actorId":"nm0000885","character":"General Walt Whalen","urlCharacter":"http://www.imdb.com/character/ch0154650","main":true},{"actorName":"George Burns","urlProfile":"http://www.imdb.com/name/nm0122675","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDA0OTkxOV5BMl5BanBnXkFtZTYwODE1NTI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 January 1896","placeOfBirth":" New York City, New York, USA","birthName":"Nathan Birnbaum","height":"5' 7\" (1.7 m)","bio":"George Burns was born on January 20, 1896 in New York City, New York, USA as Nathan Birnbaum. He was an actor and producer, known for The George Burns and Gracie Allen Show (1950), Oh, God! (1977) and The Sunshine Boys (1975). He was married to Gracie Allen and Hannah Siegal. He died on March 9, 1996 in Beverly Hills, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDA0OTkxOV5BMl5BanBnXkFtZTYwODE1NTI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0122675","name":"George Burns","nicknames":["Nattie"],"idIMDB":"nm0122675"},"actorId":"nm0122675","character":"Milt Lackey","urlCharacter":"http://www.imdb.com/character/ch0154651","main":true},{"actorName":"Scott Michael Campbell","urlProfile":"http://www.imdb.com/name/nm0132843","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI1NzQ2MDM3N15BMl5BanBnXkFtZTgwMzEyMDIxOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 August 1971","placeOfBirth":" Missoula, Montana, USA","bio":"Scott Michael Campbell was born on August 14, 1971 in Missoula, Montana, USA. He is an actor and writer, known for Brokeback Mountain (2005), Push (2009) and Flight of the Phoenix (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI1NzQ2MDM3N15BMl5BanBnXkFtZTgwMzEyMDIxOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0132843","name":"Scott Michael Campbell","idIMDB":"nm0132843"},"actorId":"nm0132843","character":"Billy","urlCharacter":"http://www.imdb.com/character/ch0154652","main":true},{"actorName":"Brion James","urlProfile":"http://www.imdb.com/name/nm0001397","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5ODM3NzMyNl5BMl5BanBnXkFtZTYwMjAxOTYy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1945","placeOfBirth":" Redlands, California, USA","birthName":"Brion Howard James","height":"6' 3\" (1.91 m)","bio":"Brion James was born February 20, 1945, in Redlands, California, to Ida Mae (Buckelew) and Jimmy James. The family soon moved to Beaumont, California (between Los Angeles and Palm Springs), where his parents built and operated a movie theater, where stars such as Gene Autry would occasionally stop by. After graduating from Beaumont High School in 1962, Brion attended San Diego State University, majoring in theater arts. Upon graduation he moved to New York to study acting while working a variety of jobs to support himself in the early years. He also did a stint in the National Guard. He and fellow actor Tim Thomerson served in the army together and later made several films together. A veteran of over 100 television and 120+ movie roles, James is best remembered for roles such as the replicant Leon in Blade Runner (1982), Gen. Munro in The Fifth Element (1997), Big Teddy in Cabin Boy (1994), Max Jenke in The Horror Show (1989) (his personal favorite) as well as countless other parts in films like Southern Comfort (1981), The Player (1992), Tango & Cash (1989), 48 Hrs. (1982), Another 48 Hrs. (1990), Enemy Mine (1985) and Silverado (1985). Brion is survived by two brothers, Craig James of Scottsdale, Arizona, Chester James of Beaumont, California and their families.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5ODM3NzMyNl5BMl5BanBnXkFtZTYwMjAxOTYy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001397","name":"Brion James","idIMDB":"nm0001397"},"actorId":"nm0001397","character":"Bernie King","urlCharacter":"http://www.imdb.com/character/ch0154653","main":true},{"actorName":"Michael Lerner","urlProfile":"http://www.imdb.com/name/nm0503627","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMTA2ODU2M15BMl5BanBnXkFtZTcwOTQ2NDY1Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 June 1941","placeOfBirth":" Brooklyn, New York, USA","height":"5' 7\" (1.7 m)","bio":"Michael Lerner was born on June 22, 1941 in Brooklyn, New York, USA. He is an actor, known for Godzilla (1998), Barton Fink (1991) and X-Men: Days of Future Past (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMTA2ODU2M15BMl5BanBnXkFtZTcwOTQ2NDY1Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0503627","name":"Michael Lerner","idIMDB":"nm0503627"},"actorId":"nm0503627","character":"Lieutenant Cross","urlCharacter":"http://www.imdb.com/character/ch0154654","main":true},{"actorName":"Michael McKean","urlProfile":"http://www.imdb.com/name/nm0571106","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMzEwMDI4MF5BMl5BanBnXkFtZTYwMDY3NDA0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 October 1947","placeOfBirth":" New York City, New York, USA","birthName":"Michael John McKean","height":"6' (1.83 m)","bio":"Michael McKean was born on October 17, 1947 in New York City, New York, USA as Michael John McKean. He is an actor, known for Planes, Trains & Automobiles (1987), This Is Spinal Tap (1984) and Whatever Works (2009). He has been married to Annette O'Toole since March 20, 1999. He was previously married to Susan Russell.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMzEwMDI4MF5BMl5BanBnXkFtZTYwMDY3NDA0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0571106","name":"Michael McKean","idIMDB":"nm0571106"},"actorId":"nm0571106","character":"Rick Rochester","urlCharacter":"http://www.imdb.com/character/ch0154655","main":true},{"actorName":"Jeffrey Tambor","urlProfile":"http://www.imdb.com/name/nm0001787","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQxMzA3NzQzM15BMl5BanBnXkFtZTcwMTQxMDc3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1944","placeOfBirth":" San Francisco, California, USA","birthName":"Jeffrey Michael Tambor","height":"6' 1\" (1.85 m)","bio":"An incisive talent when it comes to playing bent, off-the-wall characters, Jeffrey Tambor has been captivating audiences for nearly four decades. Tambor was born and raised in San Francisco, to Eileen (Salzberg) and Michael Bernard Tambor, a flooring contractor. His family is Ashkenazi Jewish (from Hungary and Ukraine). He studied acting at San Francisco State University and earned his Bachelors of Arts degree there. Following his Masters at Wayne State University, he started building up his resume in repertory theater. He was first seen on episodic TV in the mid-'70s in both comedies (Taxi (1978), Barney Miller (1974)) and dramas (Kojak (1973), Starsky and Hutch (1975)). A large, somewhat looming fellow, his sly-eyed look and leering gaze, matched with a bright set of pearly teeth and stark pattern baldness, made him a natural for broad, warped comedy. The folks at Three's Company (1976) brought Jeffrey back time and time again, standing toe-to-toe with John Ritter and stealing many of their scenes with his noticeably bizarre gents. Before his \"Three's Company\" guest roles, he co-starred in the show's spin-off The Ropers (1979) with Norman Fell and Audra Lindley. He and Patty McCormack played the Ropers' chagrined neighbors. On the legitimate stage, he has been an earnest player over the years with performances in \"Sly Fox\" and \"Glengarry Glen Ross\" on Broadway in addition to roles in \"Measure for Measure,\" \"A Flea in Her Ear\" and \"The Seagull.\" On the side, Jeffrey has directed a number of stage productions and teaches acting in the Los Angeles area. Although not as well known for his film work, he made a strong dramatic impression in his film debut ...and justice for all. (1979), in which he played Al Pacino's half-crazed law partner. He went on to enhance a number of other movies including The Dream Chasers (1984), Mr. Mom (1983), Brenda Starr (1989), Radioland Murders (1994), Doctor Dolittle (1998), Pollock (2000). More recently he played the Mayor of Whoville in How the Grinch Stole Christmas (2000). Emmy-nominated for his quirky work on The Larry Sanders Show (1992), Jeffrey's fondness and talent for the weird and wacky has recently found a nesting roost. Quite at home amid the insanity in the series Arrested Development (2003), he recently copped another Emmy nomination as the patriarch of the highly dysfunctional Bluth family.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQxMzA3NzQzM15BMl5BanBnXkFtZTcwMTQxMDc3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001787","name":"Jeffrey Tambor","idIMDB":"nm0001787"},"actorId":"nm0001787","character":"Walt Whalen, Jr.","urlCharacter":"http://www.imdb.com/character/ch0154656","main":true},{"actorName":"Stephen Tobolowsky","urlProfile":"http://www.imdb.com/name/nm0864997","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTYyMTU5NzcyMF5BMl5BanBnXkFtZTcwNDYxNDk3Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 May 1951","placeOfBirth":" Dallas, Texas, USA","birthName":"Stephen Harold Tobolowsky","height":"6' 2\" (1.88 m)","bio":"Character actor Stephen Tobolowsky was born on May 30, 1951 in Dallas, Texas. Over the past three decades, Tobolowsky has racked up a lengthy list of roles in movies and television across many different genres. While Tobolowsky initially attended Southern Methodist University in Dallas, Texas with the intention of studying geology, he was quickly drawn in to acting there. He later attended the University of Illinois for one year. Tobolowsky worked primarily in theater during his early career, and wrote and directed a few plays including \"Two Idiots in Hollywood\" and \"True Stories\". His film career took off in the 1980s, though, thanks to roles in The Philadelphia Experiment (1984), Nobody's Fool (1986), Spaceballs (1987), and Mississippi Burning (1988). Since then, Tobolowsky has appeared in many popular movies including Bird on a Wire (1990), Basic Instinct (1992), Groundhog Day (1993), Radioland Murders (1994), Murder in the First (1995), Mr. Magoo (1997), The Insider (1999), Memento (2000), Freaky Friday (2003), Garfield (2004) and Wild Hogs (2007). He has also done a substantial amount of voice work, most recently taking on the role of Uncle Ubb in The Lorax (2012). Tobolowsky has been even more prolific in television over the past few decades. He's appeared on a diverse range of shows including Seinfeld (1989), Mad About You (1992), Chicago Hope (1994), The Practice (1997) and Curb Your Enthusiasm (2000), and has had recurring roles on CSI: Miami (2002), Deadwood (2004), Heroes (2006), Californication (2007) and Glee (2009). Tobolowsky is married to fellow actor Ann Hearn.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTYyMTU5NzcyMF5BMl5BanBnXkFtZTcwNDYxNDk3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0864997","name":"Stephen Tobolowsky","idIMDB":"nm0864997"},"actorId":"nm0864997","character":"Max Applewhite","urlCharacter":"http://www.imdb.com/character/ch0154657","main":true},{"actorName":"Christopher Lloyd","urlProfile":"http://www.imdb.com/name/nm0000502","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNzQ0ODgxOV5BMl5BanBnXkFtZTcwMTAxMDY0Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 October 1938","placeOfBirth":" Stamford, Connecticut, USA","birthName":"Christopher Allen Lloyd","height":"6' 1\" (1.85 m)","bio":"Christopher Lloyd was born on October 22, 1938 in Stamford, Connecticut, USA as Christopher Allen Lloyd. He is an actor, known for Back to the Future (1985), Back to the Future Part II (1989) and Back to the Future Part III (1990). He was previously married to Jane Walker Wood, Carol Vanek, Kay Tornborg and Catherine Boyd.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNzQ0ODgxOV5BMl5BanBnXkFtZTcwMTAxMDY0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000502","name":"Christopher Lloyd","nicknames":["Chris"],"idIMDB":"nm0000502"},"actorId":"nm0000502","character":"Zoltan","urlCharacter":"http://www.imdb.com/character/ch0154658","main":true},{"actorName":"Larry Miller","urlProfile":"http://www.imdb.com/name/nm0588777","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NzQxOTMwOF5BMl5BanBnXkFtZTcwNDc3NDIzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 October 1953","placeOfBirth":" Valley Stream, Long Island, New York, USA","height":"5' 11\" (1.8 m)","bio":"Larry Miller was born on October 15, 1953 in Valley Stream, Long Island, New York, USA. He is an actor and writer, known for Kiss Kiss Bang Bang (2005), 10 Things I Hate About You (1999) and The Nutty Professor (1996). He has been married to Eileen Conn since March 1993. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NzQxOTMwOF5BMl5BanBnXkFtZTcwNDc3NDIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0588777","name":"Larry Miller","idIMDB":"nm0588777"},"actorId":"nm0588777","character":"Herman Katzenback","urlCharacter":"http://www.imdb.com/character/ch0154659","main":true},{"actorName":"Anita Morris","urlProfile":"http://www.imdb.com/name/nm0606360","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyOTIwMzU2OV5BMl5BanBnXkFtZTYwMjY3MDk2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1943","placeOfBirth":" Durham, North Carolina, USA","birthName":"Anita Rose Morris","height":"5' 6\" (1.68 m)","bio":"Anita Rose Morris was born on March 14, 1943 in Durham, North Carolina, to Eloise (Chappell), who worked in the theater, and James Badgett Morris, a doctor. Among her many roles, the most prominent film role was as Carol Dodsworth in Ruthless People (1986), and for her sensual performance as Carla in the musical \"Nine\" opposite Raul Julia. While nominated for a Best Featuted Actress Tony Award as Carla, she lost to her co-star Liliane Montevecchi. Her signature number in \"Nine\" was \"A Call from the Vatican\", and she also sang \"Simple\", late in act two. She was scheduled to perform the former at the Tony Awards in 1982, but the television censors found her outfit too revealing. Her stage work began at the American Mime Theatre, and carried her to Broadway both for \"Nine\", \"Jesus Christ Superstar\", \"Seesaw\", \"The Magic Show\", \"Sugar Babies\" and \"The Best Little Whorehouse in Texas\". Morris' film work included The Hotel New Hampshire (1984), Absolute Beginners (1986) with David Bowie and James Fox, Ruthless People (1986) with Danny DeVito and Bette Midler, 18 Again! (1988) with George Burns and Charlie Schlatter, Bloodhounds of Broadway (1989) and Radioland Murders (1994), which was her final film role. During the 1980s and 1990s, she played guest roles in sitcoms and dramas, including Miami Vice (1984), Who's the Boss? (1984), Murder, She Wrote (1984), Cheers (1982), Matlock (1986), Melrose Place (1992), Tales from the Crypt (1989) and A Different World (1987). Anita Morris died at age 50 of ovarian cancer on March 2, 1994 in Los Angeles, California. She was interred at Maplewood Cemetery in Durham, North Carolina. Anita was married to actor and director Grover Dale. Their son is actor James Badge Dale.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyOTIwMzU2OV5BMl5BanBnXkFtZTYwMjY3MDk2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0606360","name":"Anita Morris","idIMDB":"nm0606360"},"actorId":"nm0606360","character":"Claudette Katsenback","urlCharacter":"http://www.imdb.com/character/ch0154660","main":true},{"actorName":"Corbin Bernsen","urlProfile":"http://www.imdb.com/name/nm0000929","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNDQ4Njk4OV5BMl5BanBnXkFtZTcwNjY0MDk4Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1954","placeOfBirth":" North Hollywood, Los Angeles, California, USA","birthName":"Corbin Dean Bernsen","height":"5' 10¾\" (1.8 m)","bio":"Corbin Bernsen made his initial mark on the seminal television series L.A. Law as opportunistic divorce lawyer \"Arnie Becker\" earning him multiple Emmy and Golden Globe nominations over the show's eight-year run. He proved along the way the role was not to be a dead-end stereotype, maintaining a steady career in both television and film over the course of three decades. Moreover, his intent devotion to his career and love for the craft has compelled him in recent years to climb into the producer/writer, and director's chair. Born in North Hollywood, California, on September 7, 1954, Corbin was raised in and around the entertainment business. The eldest of three children, his father film and television producer Harry Bernsen and mother, veteran actress Jeanne Cooper encouraged him to continue the family tradition. After high school he originally attended UCLA with the intention of pursuing law, but instead, he went on to receive a BFA in Theatre Arts and MFA in Playwriting. He worked on the Equity-waiver L.A. stage circuit as both actor and set designer, making his film debut as a bit player in his father's picture Three the Hard Way. He then set his sights on New York in the late 70s. In the early years he carved out a living as a carpenter building rooftop decks in NYC that still stand to this day. Then in 1983 he landed the role of \"Ken Graham\" on daytime's Ryan's Hope and he put his tool belt away. This break led to an exclusive deal with NBC and eventually the TV role in L.A. Law. The perks of his \"newly-found stardom\" on L.A. Law included a hosting stint on Saturday Night Live and the covers of numerous major magazines. Not one to settle for what he knew could be fleeting comfort, he worked diligently to parlay his small screen success into a diverse resume of feature film roles, both starring and supporting, often enjoying the challenge of portraying unsympathetic characters with an infusion of charm and likability. He co-starred as Shelley Long's egotistical husband in the reincarnation comedy Hello Again; played an equally vain Hollywood star in the musical comedy Bert Rigby, You're a Fool; and starred as a disorganized ringleader of a band of crooks in the bank caper Disorganized Crime. He capped the 1980s decade opposite Charlie Sheen and Tom Berenger in the box office hit Major League, which took advantage of his natural athleticism, playing ballplayer-cum-owner \"Roger Dorn\". Two sequels followed. Other notable feature film work includes the mystery thriller Shattered, directed by Wolfgang Peterson, which re-teamed him with Tom Berenger, Stephen Frears' Lay The Favorite, and a turn opposite Robert Downey Jr. in Shane Black's Kiss Kiss Bang Bang. On the TV front, he has appeared in many MOW's including Line of Fire: The Morris Dees Story as the famed civil rights attorney who founded the Southern Poverty Law Center. Topping it off, Corbin's title role in the horror/ thriller The Dentist for HBO had audiences developing a similar paranoia of tooth doctors as Anthony Perkins invoked decades before to motel clerks. As spurned husband-turned-crazed dentist \"Dr. Alan Feinstone\", Corbin reached cult horror status. The movie spawned a sequel in which he also served as a producer. Most recently, he has reunited with Dentist director Brian Yuzna on a slate of films exploring similar themes starting with \"The Plastic Surgeon.\" More recently Bernsen wrapped eight seasons on USA Network's hit series Psych as Henry Spencer playing James Roday's retired cop father who taught his \"fake psychic,\" crime solving son everything he knows. In 2006 he formed his own production company, Team Cherokee Productions to exert more creative control over his projects and begin exploring material both as writer, director and producer. Today that company has taken root as Home Theater Films, an early player in the Faith and Family film genre. The company has explored a wide variety of themes beginning with the film \"Rust\" which was distributed by Sony Pictures. With five other films under their belt, including \"25 Hill,\" \"Beyond the Heavens,\" \"Christian Mingle\" starring Lacey Chabert, and the upcoming \"Jesse and Naomi,\" Home Theater Films has firmly carved a niche and name in this lucrative genre. Corbin has been happily married (since 1988) to British actress Amanda Pays who most recently be seen on \"The Flash.\" They have appeared together in the sci-fi film Spacejacked and the TV-movies Dead on the Money and The Santa Trap, among others. The couple has four sons. Never one to become complacent or fall prey to the hype - a lesson learned from his mother - he still practices his carpenter skills at home as he continues to write, produce, and direct. Perseverance and dedication has played a large part in his continued success. Having a savvy take-charge approach hasn't hurt either -- characteristics worthy of many of the characters he's explored on screen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNDQ4Njk4OV5BMl5BanBnXkFtZTcwNjY0MDk4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000929","name":"Corbin Bernsen","idIMDB":"nm0000929"},"actorId":"nm0000929","character":"Dexter Morris","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rosemary Clooney","urlProfile":"http://www.imdb.com/name/nm0167041","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMDc2NjgwNF5BMl5BanBnXkFtZTYwMTE5OTM2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 May 1928","placeOfBirth":" Maysville, Kentucky, USA","birthName":"Rose Mary Clooney","height":"5' 6\" (1.68 m)","bio":"Rosemary Clooney was born in Maysville, Kentucky, to Marie Frances (Guilfoyle) and Andrew Joseph Clooney. She was one of five children. Her father was of Irish and German descent, and her mother was of Irish and English ancestry. She grew up in Maysville, where she and her sister Betty Clooney used to sing in her grandfather's mayoral election campaigns, which he won three times. She made her singing debut on Cincinnati radio station WLW in 1941 at 13. On WLW she worked with band leader Barney Rapp, who had also worked with Doris Day and Andy Williams at the same station. She attended high school at Our Lady of Mercy in Cincinnati. In 1946 she appeared with her sister in Atlantic City, New Jersey, at the Steel Pier with Tony Pastor's band. In 1949 she went solo and later appeared in White Christmas (1954), co-starring opposite Bing Crosby and Danny Kaye. Her first big hit was \"Come On A My House\" in 1951. She married José Ferrer in the 1950s and they had five children between 1955 and 1960. Her marriage to Ferrer was a tempestuous one and she had a nervous breakdown in 1968, but went on to resume her career in 1976. Her life was dramatized in a 1982 made-for-television form, which starred Clint Eastwood's then-girlfriend Sondra Locke. Her son Gabriel is married to singer Debby Boone, daughter of 1950s pop singer Pat Boone. Her brother, Nick Clooney, was an ABC news anchor in Cincinnati, and her nephew George Clooney has developed into one of the biggest movie stars of the 21st century. In 1968 she was standing in the Ambassdor Hotel in Los Angeles with Roosevelt Grier when Robert F. Kennedy was assassinated in the hotel kitchen after she had participated in his campaign rally. Her top hits include \"Hey There\" in 1954, \"Tenderly\", \"This Ole House\" and \"Half As Much\" in 1952.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMDc2NjgwNF5BMl5BanBnXkFtZTYwMTE5OTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0167041","name":"Rosemary Clooney","nicknames":["Rosie"],"idIMDB":"nm0167041"},"actorId":"nm0167041","character":"Anna","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0110939","urlIMDB":"http://www.imdb.com/title/tt0110939","business":{"budget":{"money":"$15,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$835,570","country":"USA","day":"23","month":"10","year":"1994","remarks":"844 Screens"}],"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1993/\">1993</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 48 min (108 min)"],"soundMix":["DTS"],"color":["Color (Eastmancolor)"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex Cameras, JDC Lenses"],"laboratory":["Rank Film Laboratories, Denham, UK"],"filmLength":null,"negativeFormat":["35 mm (Eastman EXR 100T 5248, EXR 200T 5293)"],"cinematographicProcess":["J-D-C Scope (anamorphic)"],"printedFilmFormat":["35 mm"]},"rating":"6.2","filmingLocations":[{"location":"Carolco Studios - 1223 North 23rd Street, Wilmington, North Carolina, USA"}],"rated":"PG","awards":[],"votes":"2,865","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"},{"idCompany":"co0071326","name":"Lucasfilm"}],"keywords":{"keywords":["radio network","sponsor","radio","director","writer","night","whodunit","two word title","character says i have a bad feeling about this","held at gunpoint","single engine airplane","hostage","killer","face slap","reference to harry houdini","cross dressing","reference to al jolson","interrogation","fall from height","reference to dolores del rio","police investigation","handcuffed","radio station manager","police detective","reference to william shakespeare","cleaning lady","police officer","reference to rudy vallee","singing cowboy","dressing room","reference to bing crosby","music conductor","water hose","megaphone","scream","rehearsal","sombrero","fainting","revolver","actress","yodeler","hanging","midget","suspect","comedian","poison","noose","baseball bat","actor","announcer","organist","panties","death","breasts","costume","typewriter","nudity","chorus line","trumpeter","applause","nylons","tears","bullwhip","accordion","riddle","dancing","musician","dancer","show business","pig","entertainer","photograph","sabotage","performer","live radio","orchestra","chorine","singing","radio studio","entertainment","audience","microphone","usher","rooftop","radio tower","script","music band","reporter","stage","year 1939","radio show","singer","backstage","electrocution","laughing gas","chicago illinois","1930s","spoof","radio program","cult film","husband wife relationship","family relationships","radioland","murder","indiana jones spoof scene","fire hose used as rope","radio station"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 21:56:01"}}