{"data":{"movies":[{"title":"Lionheart","originalTitle":"","year":"1990","releaseDate":"19910111","directors":[{"name":"Sheldon Lettich","id":"nm0504802"}],"writers":[{"name":"S.N. Warren","id":"nm0913028"},{"name":"Jean-Claude Van Damme","id":"nm0000241"}],"runtime":"108 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NDEyMjktODgyOC00NzYzLTk4ZjctYTc4NWQ4NjA2MGM4XkEyXkFqcGdeQXVyNDc2NjEyMw@@._V1.jpg","countries":["USA"],"languages":["English","Serbian"],"genres":["Action","Crime","Drama","Sport"],"plot":"Lyon Gaultier is a deserter in the Foreign Legion arriving in the USA entirely hard up. He finds his brother between life and death and his sister-in-law without the money needed to heal her husband and to maintain her child. To earn the money needed, Gaultier decides to take part in some very dangerous clandestine fights.","simplePlot":"Lyon Gaultier is a deserter in the Foreign Legion arriving in the USA entirely hard up. He finds his brother between life and death and his sister-in-law without the money needed to heal ... ","actors":[{"actorName":"Jean-Claude Van Damme","urlProfile":"http://www.imdb.com/name/nm0000241","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2OTE1Njg4NjVeQTJeQWpwZ15BbWU3MDAyNjU4MDM@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 October 1960","placeOfBirth":" Berchem-Sainte-Agathe, Brussels, Belgium","birthName":"Jean-Claude Camille François Van Varenberg","height":"5' 9¾\" (1.77 m)","bio":"Van Damme was born Jean-Claude Camille François Van Varenberg in Berchem-Sainte-Agathe, Brussels, Belgium, to Eliana and Eugène Van Varenberg, an accountant. \"The Muscles from Brussels\" started martial arts at the age of eleven. His father introduced him to martial arts when he saw his son was physically weak. At the age of 12, Van Damme began his martial arts training at Centre National De Karate (National Center of Karate) under the guidance of Master Claude Goetz in Ixelles, Belgium. Van Damme trained for 4 years and earned a spot on the Belgium Karate Team. He won the European professional karate association's middleweight championship as a teenager, and also beat the 2nd best karate fighter in the world. His goal was to be number one but got sidetracked when he left his hometown of Brussels. In 1976 at the age of sixteen, Jean-Claude started his Martial Arts fight career. Over the next 6-years, he competed in both full-contact and semi-contact matches. He debuted under his birth name of Jean Claude Van Varenberg. In his first match, Jean-Claude was staggered by a round-house kick thrown by fellow countryman, Toon Van Oostrum in Brussels, Belgium. Van Damme was badly stunned, but came back to knockout Van Oostrum moments later. In 1977, at the WAKO Open International in Antwerp, Belgium, Jean-Claude lost a decision to fellow team mate Patrick Teugels in a semi-contact match. At the 1978 Challenge De Espoirs Karate Tournament (1st Trials),Jean-Claude placed 2nd in the semi-contact division. He defeated twenty-five opponents during the week long tournament, but lost in the finals to Angelo Spataro from the Naha Club. Later in 1978, Jean-Claude lost a 3-round match for the Belgium Lightweight Championship (semi-contact) to his fellow team-mate to Patrick Teugels. In 1979, Jean-Claude traveled to the United States of America, to Tampa, Florida. In his first and only match against a United States opponent, Van Damme faced 'Sherman 'Big Train'Bergman', a kick-boxer from Miami Beach, Florida. For the first and only time in his career, Jean-Claude was knocked to the canvas after absorbing a powerful left hook from Bergman. However, Jean-Claude climbed off the canvas and with a perfectly timed ax-kick, knocked Bergman out in 56 seconds of the first round. Jean-Claude was a member of the Belgium team which competed on December 26, 1979 at the La Coupe Fancois Persoons Karate Tournament which was sanctioned by the Federation bruxelloise de Karate. Van Damme's final match victory enabled his team to win the European Team Karate Championship. In Full-Contact karate, Jean-Claude knocked out England's Micheal Heming in 46 seconds of the first round. In 1980, Van Damme knocked out France's Georges Verlugels in 2 rounds of a match fought under kick-boxing rules. Jean-Claude wanted to defeat his rival Patrick Teugels. At the Forest Nationals in Brussels, on March 8, 1980, Jean-Claude knocked Teugels down and Teugels suffered a nose injury and was unable to continue. Jean-Claude was awarded a first round victory. Jean-Claude retired from martial arts in 1982, following a knockout over Nedjad Gharbi in Brussels,Belgium. Jean-Claude posted a 18-1 (18 knockouts) Kickboxing record, and a Semi-Contact record of 41-4. He came to Hong Kong at the age of 19 for the first time and felt insured to do action movies in Hong Kong. In 1981 Van Damme moved to Los Angeles. He took English classes while working as carpet layer, pizza delivery man, limo driver, and thanks to Chuck Norris he got a job as a bouncer at a club. Norris gave Van Damme a small role in the movie Missing in Action (1984), but it wasn't good enough to get anybody's attention. Then in 1984 he got a role as a villain named Ivan in the low-budget movie No Retreat, No Surrender (1986). Then one day, while walking on the streets, Jean-Claude spotted a producer for Cannon Pictures, and showed some of his martial arts abilities which led to a role in Bloodsport (1988). But the movie, filmed in Hong Kong, was so bad when it was completed, it was shelved for almost two years. It might have never been released if Van Damme did not help them to recut the film and begged producers to release it. They finally released the film, first in Malaysia and France and then into the U.S. Shot on a meager 1.5 million dollar budget, it became a U.S box-office hit in the spring of 1988. It made about 30 million worldwide and audiences supported this film for its new sensational action star Jean-Claude Van Damme. His martial arts assets, highlighted by his ability to deliver a kick to an opponent's head during a leaping 360-degree turn, and his good looks led to starring roles in higher budgeted movies like Cyborg (1989), Lionheart (1990), Double Impact (1991) and Universal Soldier (1992). In 1994, he scored with his big breakthrough $100 million worldwide hit Timecop (1994). But in the meantime, his personal life was coming apart. A divorce, followed by a new marriage, followed by another divorce. It began to show up in his career when his projects began to tank at the box office - The Quest (1996), which he directed; Maximum Risk (1996) and Double Team (1997). The three films made less than $50 million combined. In 1999 he remarried his ex-wife Gladys Portugues and restarted his lost career to attain new goals. With help from his family he faced his problems and made movies like Replicant (2001), Derailed (2002), and In Hell (2003) which did averagely in box office terms, but he tried to give his fans the best, his acting in those movies got better, more emotional and each movie was basically in different action tones.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2OTE1Njg4NjVeQTJeQWpwZ15BbWU3MDAyNjU4MDM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000241","name":"Jean-Claude Van Damme","nicknames":["Muscles from Brussels","J.C."],"idIMDB":"nm0000241"},"actorId":"nm0000241","character":"Lyon","urlCharacter":"http://www.imdb.com/character/ch0523599","main":true},{"actorName":"Harrison Page","urlProfile":"http://www.imdb.com/name/nm0656188","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEzMzI1MzkwNDJeQTJeQWpwZ15BbWU4MDQ3NTk3NTEx._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 August 1941","placeOfBirth":" Atlanta, Georgia, USA","height":"5' 9\" (1.75 m)","bio":"Harrison Page was born on August 27, 1941 in Atlanta, Georgia, USA. He is an actor, known for Lionheart (1990), Sledge Hammer! (1986) and CPO Sharkey (1976). He has been married to Christina Giles since December 30, 1989. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEzMzI1MzkwNDJeQTJeQWpwZ15BbWU4MDQ3NTk3NTEx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0656188","name":"Harrison Page","idIMDB":"nm0656188"},"actorId":"nm0656188","character":"Joshua","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Deborah Rennard","urlProfile":"http://www.imdb.com/name/nm0719612","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4Nzg2NTA5NF5BMl5BanBnXkFtZTgwNTU3ODEyMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 November 1959","placeOfBirth":" Los Angeles County, California, USA","birthName":"Deborah Kathryn Rennard","bio":"Deborah Rennard was born on November 4, 1959 in Los Angeles County, California, USA as Deborah Kathryn Rennard. She is an actress and producer, known for Dallas (1978), Lionheart (1990) and Days of Our Lives (1965). She was previously married to Paul Haggis.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4Nzg2NTA5NF5BMl5BanBnXkFtZTgwNTU3ODEyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0719612","name":"Deborah Rennard","idIMDB":"nm0719612"},"actorId":"nm0719612","character":"Cynthia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lisa Pelikan","urlProfile":"http://www.imdb.com/name/nm0670852","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NzM0NTA4NF5BMl5BanBnXkFtZTcwNDkxNjI1NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 July 1954","placeOfBirth":" Berkeley, California, USA","bio":"Lisa Pelikan was born on July 12, 1954 in Berkeley, California, USA. She is an actress, known for 10,000 Days (2014). She was previously married to Bruce Davison and Robert Harper.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NzM0NTA4NF5BMl5BanBnXkFtZTcwNDkxNjI1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0670852","name":"Lisa Pelikan","idIMDB":"nm0670852"},"actorId":"nm0670852","character":"Helene","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ashley Johnson","urlProfile":"http://www.imdb.com/name/nm0424534","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk5Njc3NzgxOV5BMl5BanBnXkFtZTgwMzgyMjIzNzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1983","placeOfBirth":" Camarillo, California, USA","birthName":"Ashley Suzanne Johnson","height":"5' 5\" (1.65 m)","bio":"Ashley was born in Camarillo, California on August 9, 1983, to Cliff and Nancy Johnson. When she was 9 days old, her family packed up and moved to Michigan where her father was transferred (Ship captain of an exploration ship). They finally ended up moving to \"The Town That Time Forgot\" called Franklin. She lived there through most of her life, but now lives in Los Angeles, California. Ashley has an older brother named Chris who works on the hit CBS series The District (2000) and an older sister named Haylie Johnson, who is an actress and a musician. Her mother, Nancy Johnson, is an independent film producer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk5Njc3NzgxOV5BMl5BanBnXkFtZTgwMzgyMjIzNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0424534","name":"Ashley Johnson","nicknames":["Dasher"],"idIMDB":"nm0424534"},"actorId":"nm0424534","character":"Nicole Gaultier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian Thompson","urlProfile":"http://www.imdb.com/name/nm0859921","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MDExNzgwNF5BMl5BanBnXkFtZTcwMDc2NDYyNA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1959","placeOfBirth":" Ellensburg, Washington, USA","birthName":"Brian Thompson","height":"6' 3\" (1.91 m)","bio":"Brian Earl Thompson was born on August 28, 1959 in Ellensburg, Washington. Raised on the Columbia River in Longview, he learned the value of academics and athletics, as the son of two teachers and the second of six siblings. His interest in acting was first sparked during his senior year of high school with the role of the Russian ballet instructor, Boris Kolenkhov, in the comedy \"You Can't Take it With You\". Under the pretense of attending Central Washington University to play football and study business management, he quietly auditioned for every available play, treading the boards for a dozen school productions, from musicals and operas to the more lighthearted fare of Neil Simon. Earning a scholarship to the University of California-Irvine, he sailed through a three-year Master of Fine Arts program, learning from such theatrical luminaries as playwright Edward Albee, Robert Cohen and Jerzy Grotoswski, and supplementing his education through work with the Colorado Shakespeare Festival. He began to audition theatrically before graduation, and by that time, he had his SAG card, an agent and five professional credits, including James Cameron's The Terminator (1984), where he and Bill Paxton's clothes were forcibly removed by a naked Arnold Schwarzenegger. About a year after Arnold took Brian's clothes, Sylvester Stallone wanted a hack at Brian as well. After seven auditions and a screen test, Brian earned the right to get impaled on a meat hook, then burned alive, Stallone's Cobra (1986). This began a string of credits that has left Thompson in and around some of Hollywood's biggest and most projects. Brian has tackled two superhero roles as well: first, Conan the Librarian (1999), starring red in the title role, a PBS special to encourage kids to read. He also earned critical acclaim playing the larger-than-life role of Hercules in Jason and the Argonauts (2000). Probably the first role that demanded use of his classical background as well as his 6' 3\" muscled frame. Brian says that no gym can claim him as a member, and that his physique is kept honed by years of windsurfing and kitesurfing. Taking a curiously \"musical\" approach to his craft, the actor continually seeks fresh rhythms for each new role. Brian verifies his well-rounded nature with a resume that lists such special skills as martial arts (black belt Hapkido), piano and sushi rolling. He currently resides at home with his son Jordan and daughter Daphne.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MDExNzgwNF5BMl5BanBnXkFtZTcwMDc2NDYyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0859921","name":"Brian Thompson","idIMDB":"nm0859921"},"actorId":"nm0859921","character":"Russell","urlCharacter":"http://www.imdb.com/character/ch0144628","main":true},{"actorName":"Voyo Goric","urlProfile":"http://www.imdb.com/name/nm0330937","urlPhoto":"","biography":{"dateOfBirth":"1940","placeOfBirth":" Gacko, Bosnia and Herzegovina, Yugoslavia","birthName":"Vojislav Govedarica","height":"6' 1½\" (1.87 m)","bio":"Voyo Goric was born in 1940 in Gacko, Bosnia and Herzegovina, Yugoslavia as Vojislav Govedarica. He is known for his work on Rambo: First Blood Part II (1985), Lionheart (1990) and Nowhere to Run (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0330937","name":"Voyo Goric","nicknames":["Voja Krstarica","Voyo"],"idIMDB":"nm0330937"},"actorId":"nm0330937","character":"Sgt. Hartog","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michel Qissi","urlProfile":"http://www.imdb.com/name/nm0702680","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzU5NjcxNTQzN15BMl5BanBnXkFtZTgwMTM4NjQ5NzE@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1962","placeOfBirth":" Oujda, Morocco","birthName":"Mohammed Qissi","height":"6' 2\" (1.88 m)","bio":"When he was seven years old Michel Qissi began training in boxing. He soon met and befriended a young Jean-Claude Van Varenberg (Jean-Claude Van Damme) who was studying Shotokan Karate, and the two traded techniques in their systems. They grew up together and shared the same love of action films and dreamed of being action stars themselves one day. In 1982, Qissi and Jean-Claude went to Hollywood together to look for a career in action movies. landing their big break in 1986. After obtaining an interview with Menahem Golan of Cannon Pictures they secured a three-picture deal, the first of which was the highly successful Bloodsport. In Cyborg (1989), Qissi worked as Van Damme's personal trainer but had no part in the cast. In the picture, Kickboxer (1989), Qissi was working as a choreographer when he overheard the production crew say they needed a tall Asian-looking guy who had a background in Muay Thai. Qissi had studied Muay Thai years before in Thailand so he volunteered and got the part of Tong Po. Michel Qissi was not credited; however, he was dubbed as Tong Po and even given a make-up job to make him look Asian. His final picture with Van Damme was Lionheart (1990) (AWOL), playing a legionnaire sent to bring Van Damme back to the army. Since then, he returned to his role of Tong Po in the sequel Kickboxer 2: The Road Back (1991). Qissi also did a few of his own flicks including Terminator Woman (1993) which he directed; he also had a relative Jeanette Agaronoff as the writer for this movie. Extreme Force (2001) was a movie directed by him along side Hector Echavarria as once again looking just like Tong Po but under the moniker Kong Li.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzU5NjcxNTQzN15BMl5BanBnXkFtZTgwMTM4NjQ5NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0702680","name":"Michel Qissi","nicknames":["Tong Po"],"idIMDB":"nm0702680"},"actorId":"nm0702680","character":"Moustafa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George McDaniel","urlProfile":"http://www.imdb.com/name/nm0567404","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTc0MDE5OTU4MF5BMl5BanBnXkFtZTgwNjYzMjc1ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"George McDaniel is an actor, known for General Hospital (1963), This Is Spinal Tap (1984) and The Last Starfighter (1984).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTc0MDE5OTU4MF5BMl5BanBnXkFtZTgwNjYzMjc1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0567404","name":"George McDaniel","idIMDB":"nm0567404"},"actorId":"nm0567404","character":"Adjutant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eric Karson","urlProfile":"http://www.imdb.com/name/nm0440171","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjgzMjY4OTkyNV5BMl5BanBnXkFtZTcwODMyNDY2MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Eric Karson is a director and producer, known for Black Eagle (1988), The Octagon (1980) and Angel Town (1990).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjgzMjY4OTkyNV5BMl5BanBnXkFtZTcwODMyNDY2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0440171","name":"Eric Karson","idIMDB":"nm0440171"},"actorId":"nm0440171","character":"Doctor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ash Adams","urlProfile":"http://www.imdb.com/name/nm0011042","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWNiM2UxMmEtYjllNy00NzE2LTkzMDMtMDQ1ZmE4YTY2OGMzXkEyXkFqcGdeQXVyMTI0OTYxNDQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 February 1963","placeOfBirth":" Los Angeles, California, USA","birthName":"Jason Leland Adams","height":"5' 11\" (1.8 m)","bio":"Ash first came into the public eye in the 1980s on the hit ABC daytime drama \"Ryan's Hope\" where he spent three years in NYC as John Ryan. Adams went on to star in the two-hour pilot/MOW \"Thunder Boat Row\" for Stephen J. Cannell and ABC. He has guest-starred in many television shows including: \"Beverly Hills 90210\", \"The Young Riders\"(two-part episode/MOW as Jesse James)\"Renegade\" \"FBI: The Untold Stories\" \"Adam 12\" \"Acapulco Bay\"(125 episodes for fox/Televisa) \"VIP\" and the new \"Dragnet\". Feature films include: \"Striking Resemblance\" \"The Stranger\" \"Puppet Master 4\" \"Lionheart\" I'll love you forever...tonight and \"Original Intent\". Ash is a multi award winning Filmmaker who's first feature \"After the Past\" won the 2003 Audience choice award at the Malibu Int Film Festival. His second film, the Documentary \"The Distance\" was nominated for best Doc at the Ohio Independent film festival and won the 2006 Roving Eye Documentary film festival. \"The Distance\" was recently picked up for distribution by Image Entertainment. Adams is a life time member of the legendary Actors Studio and lives in the peoples republic of Malibu with his Basset Hound Mickey Rourke.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWNiM2UxMmEtYjllNy00NzE2LTkzMDMtMDQ1ZmE4YTY2OGMzXkEyXkFqcGdeQXVyMTI0OTYxNDQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0011042","name":"Ash Adams","idIMDB":"nm0011042"},"actorId":"nm0011042","character":"Francois","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William T. Amos","urlProfile":"http://www.imdb.com/name/nm0025323","urlPhoto":"","biography":{"bio":"William T. Amos is an actor, known for Lionheart (1990), American Me (1992) and The Naked Truth (1992).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0025323","name":"William T. Amos","idIMDB":"nm0025323"},"actorId":"nm0025323","character":"Drug Dealer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roz Bosley","urlProfile":"http://www.imdb.com/name/nm0098012","urlPhoto":"","biography":{"bio":"Roz Bosley is an actress, known for Lionheart (1990), Murder, She Wrote (1984) and Matlock (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0098012","name":"Roz Bosley","idIMDB":"nm0098012"},"actorId":"nm0098012","character":"Nurse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dennis Rucker","urlProfile":"http://www.imdb.com/name/nm0748497","urlPhoto":"","biography":{"dateOfBirth":"23 October 1946","placeOfBirth":" Dallas, Texas, USA","birthName":"Dennis Wayne Rucker","bio":"Dennis Rucker was born on October 23, 1946 in Dallas, Texas, USA as Dennis Wayne Rucker. He is an actor, known for An Officer and a Gentleman (1982), Lionheart (1990) and Coming Home (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0748497","name":"Dennis Rucker","idIMDB":"nm0748497"},"actorId":"nm0748497","character":"Irish Legionnaire","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Billy Blanks","urlProfile":"http://www.imdb.com/name/nm0087593","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTAxMDQyMl5BMl5BanBnXkFtZTYwMTA1OTU3._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 September 1955","placeOfBirth":" Erie, Pennsylvania, USA","height":"6' (1.83 m)","bio":"Muscular African American sports star, actor, media identity and inventor of the phenomenally popular \"Tae Bo\" fitness system, derived from his extensive martial arts training. Blanks was born in Eerie, Pennsylvania in 1955 amongst humble backgrounds and grew up as one of 15 children, battling dyslexia and tendon problems. However that didn't stop him from starting his martial arts training at age 14 and eventually achieving black belts in tae kwon do & several other arts, and winning numerous US martial arts tournaments. Blanks first popped up on movie screens in the mid 1980s in tough guy parts utilizing his athletic background and grim faced looks. Films roles included Tango & Cash (1989), Driving Force (1989) and Lionheart (1990). Things looked up in 1991, when Blanks scored the minor role of drug addicted running back \"Billy Cole\" in the explosive The Last Boy Scout (1991)....and further work followed often sharing lead billing in low budget - high action fare such as Talons of the Eagle (1992), TC 2000 (1993) and Sans pitié, ni pardon (1995). In the late 1990s, Billy's innovative and exciting \"Tae Bo\" workout routine swept around the world like wildfire, and propelled him into the position of one of the world's most recognizable and biggest selling fitness trainers. The remarkable Blanks continues to refine and promote his unique \"Tae Bo\" fitness system, and he operates the Billy Blanks World Training Center in Sherman Oaks, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTAxMDQyMl5BMl5BanBnXkFtZTYwMTA1OTU3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0087593","name":"Billy Blanks","nicknames":["Big Bill"],"idIMDB":"nm0087593"},"actorId":"nm0087593","character":"African Legionnaire","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0100029","urlIMDB":"http://www.imdb.com/title/tt0100029","business":{"budget":{"money":"$3,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"£283,848","country":"UK","day":"19","month":"10","year":"1990","remarks":""},{"money":"€2,745,637","country":"Germany","day":"22","month":"11","year":"1990","remarks":""},{"money":"309,944 (Spain)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"632,981","country":"West","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1989/\">1989</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 48 min (108 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panaflex Camera and Lenses by Panavision","Panavision Cameras and Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.1","filmingLocations":[{"location":"Argyle Hotel - 8358 Sunset Blvd., West Hollywood, California, USA"}],"rated":"R","awards":[],"votes":"26,167","type":"Movie","companyCreditsSimple":[{"idCompany":"co0042216","name":"Imperial Entertainment Corporation"},{"idCompany":"co0040268","name":"Guild"},{"idCompany":"co0005240","name":"Sunil"}],"keywords":{"keywords":["money","fighting","fight","foreign legion","insurance","ship","deserter","legionnaire","french foreign legion","north africa","niece","death","street fight","kilt","drawing","painting","business card","widow","training","sponsor","fight promoter","watching tv","crashing through a window","final showdown","class differences","walkie talkie","drowning","underwater scene","arrest","cheering crowd","scot","mansion","manipulation","binoculars","surveillance","basketball","videotape","money problems","nurse","doctor","hospital","landlord","apartment","threatened with a knife","switchblade","german","tattoo","thug","gang","underground parking garage","parking garage","elevator","bodyguard","security guard","bicycle","foot chase","chase","jogging","eavesdropping","ambassador","limousine","taxi","pay phone","homeless person","homeless man","homelessness","boiler room","port","barbed wire","military","frenchman","handcuffs","fugitive","on the run","awol","desertion","desert","car accident","machine gun","military jeep","stealing a car","letter","military duty","army base","mercenary","hamburger","general","embassy","eiffel tower paris","paris france","world trade center new york city","new york city","los angeles california","palm tree","disfigurement","jumping from a boat","melodrama","bilingualism","fish out of water","montage","department store","undressing","seductress","seduction","femme fatale","mysterious woman","homoeroticism","cigarette smoking","rich woman","benefactor","male rear nudity","underground fighting","fighter","bare butt","street life","beefcake","drug dealer","gasoline","1990s","muscleman","strongman","burn victim","dog","cat","machismo","black comedy","f word","ethnic slur","racial slur","n word","comic relief","friendship","sunglasses","man with a ponytail","broken ribs","head butt","beaten to death","burned to death","kicked in the crotch","kicked in the stomach","kicked in the face","punched in the chest","escape","loss of father","death of husband","revenge","murder","betrayal","two against many","warrior","deception","one man army","anti hero","double cross","neo noir","blood splatter","punched in the crotch","short haired female","male male hug","5 year old","sucker punch","happy ending","reference to the wizard of oz","setting man on fire","revenge motive","death of brother","brother in law sister in law relationship","needing money","gambling winnings","character says go to hell","person on fire","nickname","fur coat","taekwondo","tragedy","opening action scene","brawl","cult film","bare knuckle boxing","martial arts master","karate kick","mixed martial arts","roundhouse kick","tough guy","fistfight","showdown","duel","beating","swimming pool","boxer","broken rib","redemption","gladiator","street fighter","hand to hand combat","combat","fight club","interracial friendship","female villain","blood","bare chested male","attempted seduction","street gang","knife","baseball bat","military desertion","soldier","wisecrack humor","hit in the groin","karate","karate chop","underground tournament","martial arts tournament","alley fight","blonde","martial artist","action hero","hero","hit on the head","punched in the mouth","kicked in the leg","kickboxing","boxing","violence","illegal fistfight","stabbed in the leg","punched in the face","uncle niece relationship","two against one","single mother","punch to the ribs","prize fighter","play fight","one word title","mother daughter relationship","loss of husband","loss of brother","injured ribs","exploitation","ex prize fighter","drug deal","burnt face","burned alive","betting","bare knuckle fighting","martial arts","body landing on a car","death of father","independent film","title spoken by character","character name in title","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:24:44"}}