{"data":{"movies":[{"title":"8 Heads in a Duffel Bag","originalTitle":"","year":"1997","releaseDate":"19970418","directors":[{"name":"Tom Schulman","id":"nm0776114"}],"writers":[{"name":"Tom Schulman","id":"nm0776114"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NjU0NDc2Ml5BMl5BanBnXkFtZTcwMTM3NjYxMQ@@._V1.jpg","countries":["USA","UK"],"languages":["English","Spanish"],"genres":["Comedy","Crime"],"plot":"This is a very black comedy. A mob courier is hired to transport the heads of eight murder victims to a mob boss. However, the duffel bag gets mixed up with the bag of a college student who is off on a vacation in Mexico with his girlfriend and her parents. However, the mother is a recovering alcoholic whom everyone believes is delusional when she claims to have found heads.","simplePlot":"A mob bagman finds that his luggage, containing the proof of his gang's latest hit, has been switched.","actors":[{"actorName":"Joe Pesci","urlProfile":"http://www.imdb.com/name/nm0000582","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzc3MTcxNDYxNV5BMl5BanBnXkFtZTcwOTI3NjE1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1943","placeOfBirth":" Newark, New Jersey, USA","birthName":"Joseph Frank Pesci","height":"5' 4\" (1.63 m)","bio":"Compact Italian-American actor Joe Pesci was born February 9, 1943, in Newark, NJ, to Mary (Mesce), a part-time barber, and Angelo Pesci, a bartender and forklift driver. Pesci first broke into entertainment as a child actor and by the mid-50s was starring on the series \"Star Time Kids\". In the mid-'60s he released a record under the stage name of \"Joe Ritchie\" titled \"Little Joe Sure Can Sing\", and was also playing guitar with several bands, including Joey Dee and The Starliters. He even joined with friend Frank Vincent to start a vaudeville-style comedy act, but met with limited success (interestingly, Pesci and Vincent would later go on to co-star in several gangster films together, including Goodfellas (1990) and Casino (1995)) Pesci's first film role was as an uncredited dancer in Hey, Let's Twist! (1961) and then he had to wait another 15 years for a minor part in The Death Collector (1976). His work in the second film was seen by Robert De Niro, who convinced director Martin Scorsese to cast him as \"Joey LaMotta\" in the epic boxing film Raging Bull (1980), which really got him noticed in Hollywood. He played opposite Rodney Dangerfield in Easy Money (1983), was with buddy DeNiro again in Il était une fois en Amérique (1984), nearly stole the show as con man Leo Getz in Lethal Weapon 2 (1989) and scored a Best Supporting Actor Oscar playing the psychotic Tommy DeVito in \"Goodfellas\". His comedic talents shone again in the mega-popular Home Alone (1990), and he put in a terrific performance as co-conspirator David Ferrie in JFK (1991). Pesci was back again as Leo Getz for Lethal Weapon 3 (1992), and was still a bumbling crook in Home Alone 2: Lost in New York (1992), and had a minor role in the Robert De Niro-directed A Bronx Tale (1993). He was lured back by Scorsese to play another deranged gangster named Nicky (based on real-life hood Tony Spilotro [aka \"The Ant\"]) in the violent Casino (1995), and starred in the comedies 8 Heads in a Duffel Bag (1997) and Gone Fishin' (1997), although both failed to fire at the box office. He returned again as fast-talking con man Leo Getz in Lethal Weapon 4 (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzc3MTcxNDYxNV5BMl5BanBnXkFtZTcwOTI3NjE1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000582","name":"Joe Pesci","idIMDB":"nm0000582"},"actorId":"nm0000582","character":"Tommy","urlCharacter":"http://www.imdb.com/character/ch0024536","main":true},{"actorName":"Andy Comeau","urlProfile":"http://www.imdb.com/name/nm0173688","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyMzg5ODEwOV5BMl5BanBnXkFtZTgwODU3NDAxOTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 October 1970","placeOfBirth":" New Boston, New Hampshire, USA","height":"6' (1.83 m)","bio":"Andy Comeau was born on October 19, 1970 in New Boston, New Hampshire, USA. He is an actor and producer, known for One Hour Photo (2002), 8 Heads in a Duffel Bag (1997) and Huff (2004). He has been married to Dawn Lewis since 2007. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyMzg5ODEwOV5BMl5BanBnXkFtZTgwODU3NDAxOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0173688","name":"Andy Comeau","idIMDB":"nm0173688"},"actorId":"nm0173688","character":"Charlie","urlCharacter":"http://www.imdb.com/character/ch0024542","main":true},{"actorName":"Kristy Swanson","urlProfile":"http://www.imdb.com/name/nm0001785","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MDUxMjM5Ml5BMl5BanBnXkFtZTcwMzM0MjMyOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 December 1969","placeOfBirth":" Mission Viejo, California, USA","birthName":"Kristen Noel Swanson","height":"5' 6\" (1.68 m)","bio":"Kristy Swanson was born on December 19, 1969 in Mission Viejo, California, USA as Kristen Noel Swanson. She is an actress and producer, known for Dude, Where's My Car? (2000), Ferris Bueller's Day Off (1986) and Buffy the Vampire Slayer (1992). She has been married to Lloyd Eisler since February 7, 2009. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MDUxMjM5Ml5BMl5BanBnXkFtZTcwMzM0MjMyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001785","name":"Kristy Swanson","nicknames":["Swanie"],"idIMDB":"nm0001785"},"actorId":"nm0001785","character":"Laurie Bennett","urlCharacter":"http://www.imdb.com/character/ch0024537","main":true},{"actorName":"George Hamilton","urlProfile":"http://www.imdb.com/name/nm0001313","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNzU4ODg2NV5BMl5BanBnXkFtZTYwODkyMDY2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 August 1939","placeOfBirth":" Memphis, Tennessee, USA","birthName":"George Stevens Hamilton","height":"6' 1\" (1.85 m)","bio":"Noted these days for his dashing, sporting, jet-setter image and perpetually bronzed skin tones in commercials, film spoofs and reality shows, George Hamilton was, at the onset, a serious contender for dramatic film stardom. Born George Stevens Hamilton in Memphis, TN, on August 12, 1939, the son of gregarious Southern belle beauty Ann (Stevens) Potter Hamilton Hunt Spaulding, and her husband (of four), George W. \"Spike\" Hamilton, a touring bandleader. Moving extensively as a youth due to his father's work (Arkansas, Massachusetts, New York, California), young George got a taste of acting in plays while attending Palm Beach High School. With his exceedingly handsome looks and attractive personality, he took a bold chance and moved to Los Angeles in the late 1950s. MGM (towards the end of the contract system) saw in George a budding talent with photogenic appeal. It wasted no time putting him in films following some guest appearances on TV. His first film, a lead in Crime & Punishment, USA (1959), was an offbeat, updated adaptation of the Fyodor Dostoevsky novel. While the film was not overwhelmingly successful, George's heartthrob appeal was obvious. He was awarded a Golden Globe for \"Most Promising Newcomer\" as well as being nominated for \"Best Foreign Actor\" by the British Film Academy (BAFTA). This in turn led to an enviable series of film showcases, including the memorable Southern drama Home from the Hill (1960), which starred Robert Mitchum and Eleanor Parker and featured another handsome, up-and-coming George (George Peppard); Angel Baby (1961), in which he played an impressionable lad who meets up with evangelist Mercedes McCambridge; and Light in the Piazza (1962) (another BAFTA nomination), in which he portrays an Italian playboy who falls madly for American tourist Yvette Mimieux to the ever-growing concern of her mother Olivia de Havilland. Along with the good, however, came the bad and the inane, which included the dreary sudsers All the Fine Young Cannibals (1960) and By Love Possessed (1961) and the youthful spring-break romps Where the Boys Are (1960), which had Connie Francis warbling the title tune while slick-as-car-seat-leather George pursued coed Dolores Hart, and Looking for Love (1964), which was more of the same. Not yet undone by this mixed message of serious actor and glossy pin-up, George went on to show some real acting muscle in the offbeat casting of a number of biopics -- as Moss Hart in Act One (1963), an overly fictionalized and sanitized account of the late playwright (the real Moss should have looked so good!), as ill-fated country star Hank Williams in Your Cheatin' Heart (1964), and as the famed daredevil Evel Knievel (1971). The rest of the '60s and '70s, however, rested on his fun-loving, idle-rich charm that bore a close resemblance to his off-camera image in the society pages. As the 1960s began to unfold, he started making headlines more as a handsome escort to the rich, the powerful and the beautiful than as an acclaimed actor -- none more so than his 1966 squiring of President Lyndon Johnson's daughter Lynda Bird Johnson. He was also once engaged to actress Susan Kohner, a former co-star. Below-average films such as Doctor, You've Got to Be Kidding! (1967), A Time for Killing (1967) and The Power (1968) effectively ended his initially strong ascent to film stardom. From the 1970s on George tended to be tux-prone on standard film and TV comedy and drama, whether as a martini-swirling opportunist, villain or lover. A wonderful comeback for him came in the form of the disco-era Dracula spoof Love at First Bite (1979), which he executive-produced. Nominated for a Golden Globe as the campy neck-biter displaced and having to fend off the harsh realities of New York living, he continued on the parody road successfully with Zorro: The Gay Blade (1981) in the very best Mel Brooks tradition. This renewed popularity led to a one-year stint on Dynasty (1981) during the 1985-1986 season and a string of fun, self-mocking commercials, particularly his Ritz Cracker and (Toasted!) Wheat Thins appearances that often spoofed his overly tanned appearance. In recent times he has broken through the \"reality show\" ranks by hosting The Family (2003), which starred numerous members of a traditional Italianate family vying for a $1,000,000 prize, and participating in the second season of ABC's Dancing with the Stars (2005), where his charm and usual impeccable tailoring scored higher than his limberness. On the tube he can still pull off a good time, whether playing flamboyant publisher William Randolph Hearst in Rough Riders (1997), playing the best-looking Santa Claus ever in A Very Cool Christmas (2004), hosting beauty pageants or making breezy gag appearances. In 1989 he started a line of skin-care products and a chain of tanning salons. Married to actress/TV personality Alana Stewart from 1972 to 1975 (she later married and divorced rock singer Rod Stewart), the pair have a son, actor Ashley Hamilton, born in 1974. Another son, George Thomas Hamilton, born in 2000, came from his involvement with Kimberly Blackford.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNzU4ODg2NV5BMl5BanBnXkFtZTYwODkyMDY2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001313","name":"George Hamilton","nicknames":["Tanned One"],"idIMDB":"nm0001313"},"actorId":"nm0001313","character":"Dick Bennett","urlCharacter":"http://www.imdb.com/character/ch0024540","main":true},{"actorName":"Dyan Cannon","urlProfile":"http://www.imdb.com/name/nm0001007","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3Nzc3NTA5OV5BMl5BanBnXkFtZTYwOTY1MjI1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 January 1937","placeOfBirth":" Tacoma, Washington, USA","birthName":"Samile Diane Friesen","height":"5' 5\" (1.65 m)","bio":"Perhaps best known for her trademark curly blond tresses and her faithful appearances at L.A. Lakers basketball games, Dyan Cannon has enjoyed nearly fifty years in the entertainment industry. Born Samille Diane Friesen in Tacoma, Washington, Cannon had early dreams of becoming an actress. She made her screen debut with a small part in the critically acclaimed crime drama The Rise and Fall of Legs Diamond (1960). A short-lived television series called This Rebel Breed (1960) followed that same year. It was during this time that she caught the eye of one of Hollywood's favorite leading men, Cary Grant, who was 35 years her senior. The couple, a hotbed of Hollywood gossip, experienced an on-again, off-again relationship until marrying in 1965. Cannon left her acting career behind during her short-lived marriage to Grant and bore his daughter, Jennifer Grant, in 1966. Cannon and Grant were divorced in 1968, and she returned to the big screen in 1969 in the pop-culture classic Bob & Carol & Ted & Alice (1969), garnering an Academy Award nomination for Best Supporting Actress. A series of less-than-remarkable television and feature films followed in the early 1970s, but comedies proved her most successful medium. Cannon received another Academy Award nomination for Heaven Can Wait (1978), where she played a money-hungry, adulterous wife who hatches a plot to kill her husband only to find that another man has been reincarnated via her husband's body. The multi-talented Cannon, who is also a singer/songwriter, found success behind the camera as well as in front of it. In 1976, she produced, directed, wrote, and edited the short film Number One (1976), an Academy Award nominee for Best Short Film-Live Action. The tedious experience of wearing so many hats deterred her from writing and directing again until 1991, with the release of The End of Innocence (1990). She gave a strong and critically acclaimed performance in the picture, but it received a lukewarm response overall. The 1980s and 1990s found Cannon on the small screen more often than the big one, as she starred in several made-for-TV movies and made guest appearances in numerous series. Most notable was her recurring role on the hit show Ally McBeal (1997), where, in 1997-98, she played Judge Jennifer \"Whipper\" Cone in several episodes of the wacky comedy/drama. Though it's been 20 years since Cannon scored a major movie success and she's outgrown her sexpot image (early nude photos of the actress are still in circulation), she continues to find respectable roles in decent-though-not-great films, most recently Out to Sea (1997) with the aging comedy duo of Walter Matthau and Jack Lemmon; 8 Heads in a Duffel Bag (1997), That Darn Cat (1997) and Boynton Beach Club (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3Nzc3NTA5OV5BMl5BanBnXkFtZTYwOTY1MjI1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001007","name":"Dyan Cannon","nicknames":["Frosty"],"idIMDB":"nm0001007"},"actorId":"nm0001007","character":"Annette Bennett","urlCharacter":"http://www.imdb.com/character/ch0024539","main":true},{"actorName":"David Spade","urlProfile":"http://www.imdb.com/name/nm0005450","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3OTQxMzc0NV5BMl5BanBnXkFtZTgwNDA0NjA0OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1964","placeOfBirth":" Birmingham, Michigan, USA","birthName":"David Wayne Spade","height":"5' 7\" (1.7 m)","bio":"Comic brat extraordinaire David Spade was born on July 22, 1964, in Birmingham, Michigan, the youngest of three brothers. He is the son of Judith J. (Meek), a writer and editor, and Wayne M. Spade, a sales rep, and is of German, English, Irish, and Scottish descent. Raised in both Scottsdale (from age four) and Casa Grande, Arizona, he graduated with a degree in business from Arizona State University in 1986. A natural prankster most of his life, Spade was pushed immediately into stand-up comedy by friends and appeared in nightclubs and college campuses all over the country. A casting agent saw his routine at \"The Improv\" in Los Angeles and offered him a mischievous role in the film Police Academy 4: Citizens on Patrol (1987). In 1990, the diminutive, flaxen-haired comedian finally hit the big time as a regular cast member and writer on Saturday Night Live (1975). Slow at first in gaining acceptance on the show, his razor-sharp sarcasm eventually caught on by his second season, when he played a number of smart-aleck characters in a variety of sketches, including a highly disinterested airline steward who bids each passenger adieu with a very sardonic \"buh-bye\" and an irritating receptionist for Dick Clark Productions who greets each huge celebrity with an unknowing \"And you are . . . ?\" A master of the putdown, Spade's \"Hollywood Minute\" reporter also took cynical advantage of tabloid-worthy stars. Spade impersonated such luminaries as Michael J. Fox, Kurt Cobain and Tom Petty during his tenure. Following his SNL departure after six years, he spun off into a slapstick movie career, most noticeably as the scrawny, taciturn foil to SNL's wild and crazy big boy Chris Farley in Tommy Boy (1995) and Black Sheep (1996). The teaming of this unlikely but funny pair ended with Farley's death from a 1997 drug overdose. Since then, Spade has appeared in his own lukewarm vehicles, including Joe Dirt (2001) and Dickie Roberts: Former Child Star (2003). More recently he teamed with former SNL member Rob Schneider on the film The Benchwarmers (2006). Television has been more accepting over the years, with Spade earning an Emmy nomination as the droll, skirt-chasing secretary Dennis Finch on Just Shoot Me! (1997) and filling in after the untimely death of John Ritter on ABC's 8 Simple Rules (2002) as Katey Sagal's unprincipled nephew. More recently he was the star of the Comedy Central show The Showbiz Show with David Spade (2005) in 2005 wherein he more or less resurrected his obnoxious, razor-tongued gossipmonger from the old \"Hollywood Minute\" put-down segment on SNL, as well as co-starring in the adult-oriented ensemble sitcom Rules of Engagement (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3OTQxMzc0NV5BMl5BanBnXkFtZTgwNDA0NjA0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005450","name":"David Spade","idIMDB":"nm0005450"},"actorId":"nm0005450","character":"Ernie","urlCharacter":"http://www.imdb.com/character/ch0024538","main":true},{"actorName":"Todd Louiso","urlProfile":"http://www.imdb.com/name/nm0521974","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNDY1NjU0OV5BMl5BanBnXkFtZTgwNjk5MDY5ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1970","placeOfBirth":" Cincinnati, Ohio, USA","birthName":"Todd Scherer Louiso","height":"5' 8\" (1.73 m)","bio":"Todd Louiso graduated from the School for the Creative and Performing Arts in Cincinnati, Ohio. He attended the school from 4th grade until graduating in 1988. His father Jack Louiso was the Artistic Director of the school. His major in high school was Drama and Musical Theater. Graduated from NYU's film school in 1992.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNDY1NjU0OV5BMl5BanBnXkFtZTgwNjk5MDY5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0521974","name":"Todd Louiso","idIMDB":"nm0521974"},"actorId":"nm0521974","character":"Steve","urlCharacter":"http://www.imdb.com/character/ch0024541","main":true},{"actorName":"Anthony Mangano","urlProfile":"http://www.imdb.com/name/nm0542134","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjQxNzY4MzY5M15BMl5BanBnXkFtZTgwMjUzMjE5OTE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Anthony is an athletically built, dark-haired American actor who hails from Brooklyn, New York. He is an actor known for the films The Family, Inside Man, Point Break and Raising Helen. His first job in Hollywood was on the sitcom Different Strokes. He has guest starred on many shows including CSI and Castle. He has recurred on Person of Interest, Blue Bloods, NYPD Blue and Rescue Me. He has been on camera opposite everyone from Frank Sinatra to Robert De Niro.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjQxNzY4MzY5M15BMl5BanBnXkFtZTgwMjUzMjE5OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0542134","name":"Anthony Mangano","idIMDB":"nm0542134"},"actorId":"nm0542134","character":"Rico","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe Basile","urlProfile":"http://www.imdb.com/name/nm0059863","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMTgyMjAwOV5BMl5BanBnXkFtZTgwMDI5Mjk0OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1965","placeOfBirth":" Red Bank, New Jersey, USA","height":"6' 4\" (1.93 m)","bio":"Joe Basile was born on October 26, 1965 in Red Bank, New Jersey, USA. He is an actor and director, known for West End (2014), Tropic Thunder (2008) and 8 Heads in a Duffel Bag (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMTgyMjAwOV5BMl5BanBnXkFtZTgwMDI5Mjk0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0059863","name":"Joe Basile","idIMDB":"nm0059863"},"actorId":"nm0059863","character":"Benny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ernestine Mercer","urlProfile":"http://www.imdb.com/name/nm0580262","urlPhoto":"","biography":{"dateOfBirth":"25 March 1924","placeOfBirth":" Amarillo, Texas, USA","bio":"Ernestine Mercer was born on March 25, 1924 in Amarillo, Texas, USA. She was an actress, known for Casper (1995), 8 Heads in a Duffel Bag (1997) and Eight Days a Week (1997). She died on May 27, 2011 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0580262","name":"Ernestine Mercer","idIMDB":"nm0580262"},"actorId":"nm0580262","character":"Fern","urlCharacter":"http://www.imdb.com/character/ch0024543","main":true},{"actorName":"Frank Roman","urlProfile":"http://www.imdb.com/name/nm0738686","urlPhoto":"","biography":{"bio":"Born in Brooklyn, New York, Frank Roman, a Nuyorican Sephardic, migrated to Miami, Florida and with theatre, television and film credits to his name, he has become an exciting talent in Hollywood. Frank began his acting career as the lead in six theatrical productions from the East Coast to the West. He has starred in such stage hits as the famous musical \"The Fantasticks\" and Neil Simon's comedy \"California Suite.\" When Frank made \"the move\" to Los Angeles, he was quickly discovered by Mel Brooks, who starred him in his comedy Life Stinks (1991). The two funny men worked together again on two more Mel Brooks' comedies. With this solid comic endorsement, Frank made the transition to features. Soon thereafter, he found himself starring opposite other comedy greats such as Ellen DeGeneres in Mr. Wrong (1996), and Jack Lemmon and Walter Matthau in The Odd Couple II (1998). His film work has taken him to exotic locations such as Manila, Moscow, and, most recently, Rome, where he wrapped location shooting for the expected summer hit, Envy (2004). However, one of Frank's favorite memories was the strip search in Bucharest, Romania. (Frank considered this one of the perks in his contract.) Having guest-starred in more than 20 network shows, Frank has had the opportunity of working with some of TV's most accomplished actors...from Brian Dennehy in The Fighting Fitzgeralds (2001) to Jenna Elfman in Dharma & Greg (1997). But, Frank isn't limited to comedy, as he has demonstrated with his critically acclaimed dramatic performance in The X-Files (1993) during the show's Final Season \"John Doe\" episode as the devious Domingo Salmeron and as Cesar Rodriguez in \"Noriega: God's Favorite\". He has also had the opportunity to appear in other stablemate shows like NYPD Blue (1993), Diagnosis Murder (1993), ER (1994), Becker (1998), and Quantum Leap (1989). In 2003, he worked alongside Ben Stiller and Jack Black in Barry Levinson's new feature comedy Envy (2004). Also, he can be found in the recurring role of Reno on the NBC/Grammet sitcom In-Laws (2002), starring Dennis Farina and Jean Smart.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0738686","name":"Frank Roman","idIMDB":"nm0738686"},"actorId":"nm0738686","character":"Paco","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Howard George","urlProfile":"http://www.imdb.com/name/nm0313450","urlPhoto":"","biography":{"dateOfBirth":"10 January 1946","placeOfBirth":"","bio":"Howard George was born on January 10, 1946. He was an actor, known for 8 Heads in a Duffel Bag (1997), My Favorite Year (1982) and Earth vs. the Spider (2001). He died on September 28, 2015 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0313450","name":"Howard George","idIMDB":"nm0313450"},"actorId":"nm0313450","character":"Big Sep","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Platz","urlProfile":"http://www.imdb.com/name/nm0686949","urlPhoto":"","biography":{"dateOfBirth":"26 June 1955","placeOfBirth":" Fort Sill, Oklahoma, USA","height":"5' 7\" (1.7 m)","bio":"Tom Platz was born on June 26, 1955 in Fort Sill, Oklahoma, USA. He is an actor, known for Twins (1988), 8 Heads in a Duffel Bag (1997) and Book of Love (1990). He is married to Cha Nikito-Platz.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0686949","name":"Tom Platz","idIMDB":"nm0686949"},"actorId":"nm0686949","character":"Head of Hugo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Endre Hules","urlProfile":"http://www.imdb.com/name/nm0401352","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NTEyMTYxM15BMl5BanBnXkFtZTgwNjEwMTg0ODE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Endre was born and raised in Hungary. He studied music and acting at the famous Cellar Theatre in Budapest, and started writing plays, composing and directing there at the age of 17. He visited regularly Jerzy Grotowski's Laboratory Theatre in Poland, Eugenio Barba's International School of Theatrical Anthropology in Germany, and graduated from the prestigious National Academy of Theatre and Film Arts as a director. After directing at the National Theatres of Pecs and Szeged, as well as Television and Radio he moved to Paris, not entirely from his own volition, then to New York directing for the stage as well as teaching acting, writing and directing at conservatories, universities and workshops all over Europe, North America and Asia, including at New York University, Espace Acteur, Smith College, Bard College, University of Southern California, etc. His directing repertoire spanned from classics to musicals, original and experimental projects to improvisation, with plays by Shakespeare, Moliere, Calderon, Goldoni, Chekhov, Stoppard, Brecht, Pinter, Orton, Ibsen and Miller, among other places, at the Biennale die Paris, Williamstown Theatre Festival, La Mama, New York, the Los Angeles Theatre Center and the Shakespeare World Congress. From New York he moved to Los Angeles to try his hand in film. He became a Producing Fellow at the American Film Institute in Los Angeles, where he had written and produced several shorts. In the meantime he acted in several dozen Hollywood movies and television shows. He has written and sold a dozen feature scripts from comedies to dramas, thrillers, historical adventures, documentaries, and biopics before he finally got his chance to direct his first feature.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NTEyMTYxM15BMl5BanBnXkFtZTgwNjEwMTg0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0401352","name":"Endre Hules","idIMDB":"nm0401352"},"actorId":"nm0401352","character":"Head of Marty","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Calvin Levels","urlProfile":"http://www.imdb.com/name/nm0505226","urlPhoto":"","biography":{"dateOfBirth":"30 September 1954","placeOfBirth":" Cleveland, Ohio, USA","bio":"Calvin Levels was born on September 30, 1954 in Cleveland, Ohio, USA. He is an actor, known for Adventures in Babysitting (1987), Hellbound (1994) and The Atlanta Child Murders (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0505226","name":"Calvin Levels","idIMDB":"nm0505226"},"actorId":"nm0505226","character":"Head of Jamal","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0118541","urlIMDB":"http://www.imdb.com/title/tt0118541","business":{"budget":{"money":"$3,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$2,024,516","country":"USA","day":"20","month":"04","year":"1997","remarks":"1,553 Screens"}],"gross":[{"money":"$3,559,990","country":"USA","day":"04","month":"05","year":"1997","remarks":""},{"money":"$3,260,346","country":"USA","day":"27","month":"04","year":"1997","remarks":""},{"money":"$2,024,516","country":"USA","day":"20","month":"04","year":"1997","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1996/\">1996</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 35 min (95 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe, USA (color)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.3","metascore":"15","filmingLocations":[{"location":"Santa Ana, California, USA"}],"rated":"R","awards":[{"award":"Brussels International Festival of Fantasy Film (BIFFF) 1998","titlesAwards":[{"titleAwardOutcome":"Won Silver Raven","categories":[{"category":"","names":[{"name":"Tom Schulman","id":"nm0776114","role":null}]}]}]}],"votes":"8,215","type":"Movie","companyCreditsSimple":[{"idCompany":"co0001995","name":"Orion Pictures"},{"idCompany":"co0021421","name":"Rank Organisation, The"}],"keywords":{"keywords":["nude pantyhose","female stockinged soles","female stockinged feet","camera shot of feet","pantyhose","head","vacation","mexico","murder","duffel bag","airport","bare chested male bondage","digit in title","washing machine","torture","switched luggage","security","san diego california","police","newark new jersey","motel","maid","hotel","hitman","gunfire","grandmother","gangster","father daughter relationship","engagement","dog","coyote","bribery","blindness","baltimore maryland","airplane","switchblade","mafia","disembodied head","decapitation","cryogenics","independent film","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:51:51"}}