{"data":{"movies":[{"title":"Seven Girlfriends","originalTitle":"","year":"1999","releaseDate":"20000421","directors":[{"name":"Paul Lazarus","id":"nm0006996"}],"writers":[{"name":"Paul Lazarus","id":"nm0006996"},{"name":"Stephen Gregg","id":"nm0339613"}],"runtime":"99 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5ODc4MjA0MF5BMl5BanBnXkFtZTcwMDg0MjYyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"Jesse is charming, romantic, and he knows how to pop the question; he just can't face marriage. So, when he and Hannah split up during the same week that a former fiancée dies, he decides to figure things out. He visits each woman about whom he's been serious to ask what went wrong. His teen flame, an independent woman who sometimes sleeps with him, and a group of lesbians give him advice, as does Anabeth, dead but lively in his dreams. One ex remains furious, but with the help of her inventive colleague, the level-headed insomniac Laura, Jesse even gets to talk to her. It's on to Anabeth's funeral, where he'll see Hannah, and maybe grasp what has been eluding him.","simplePlot":"Jesse is charming, romantic, and he knows how to pop the question; he just can't face marriage. So, when he and Hannah split up during the same week that a former fiancée dies, he decides ... ","actors":[{"actorName":"Laura Leighton","urlProfile":"http://www.imdb.com/name/nm0500359","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MDAyNzQ3NF5BMl5BanBnXkFtZTcwNzcyNjY0MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 July 1968","placeOfBirth":" Iowa City, Iowa, USA","birthName":"Laura Diane Miller","height":"5' 4\" (1.63 m)","bio":"Laura Leighton was born on July 24, 1968 in Iowa City, Iowa, USA as Laura Diane Miller. She is an actress, known for Pretty Little Liars (2010), Melrose Place (1992) and Seven Girlfriends (1999). She has been married to Doug Savant since May 1998. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MDAyNzQ3NF5BMl5BanBnXkFtZTcwNzcyNjY0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0500359","name":"Laura Leighton","idIMDB":"nm0500359"},"actorId":"nm0500359","character":"Anabeth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tim Daly","urlProfile":"http://www.imdb.com/name/nm0004857","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NTY4NDUwOF5BMl5BanBnXkFtZTgwMTcyMTQ4MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 March 1956","placeOfBirth":" New York City, New York, USA","birthName":"James Timothy Daly","height":"6' (1.83 m)","bio":"Tim Daly was born on March 1, 1956 in New York City, New York, USA as James Timothy Daly. He is an actor and producer, known for Wings (1990), Private Practice (2007) and Superman (1996). He was previously married to Amy Van Nostrand.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NTY4NDUwOF5BMl5BanBnXkFtZTgwMTcyMTQ4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004857","name":"Tim Daly","idIMDB":"nm0004857"},"actorId":"nm0004857","character":"Jesse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Olivia d'Abo","urlProfile":"http://www.imdb.com/name/nm0001882","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzkyNTE4N15BMl5BanBnXkFtZTgwNzk5MTIwNTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 January 1969","placeOfBirth":" Paddington, London, England, UK","birthName":"Olivia Jane d'Abo","height":"5' 5\" (1.65 m)","bio":"Olivia d'Abo was born on January 22, 1969 in Paddington, London, England as Olivia Jane d'Abo. She is an actress, known for The Wonder Years (1988), Conan the Destroyer (1984) and Point of No Return (1993). She was previously married to Patrick Leonard.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzkyNTE4N15BMl5BanBnXkFtZTgwNzk5MTIwNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001882","name":"Olivia d'Abo","idIMDB":"nm0001882"},"actorId":"nm0001882","character":"Hannah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Neal Lerner","urlProfile":"http://www.imdb.com/name/nm0503638","urlPhoto":"","biography":{"bio":"Neal Lerner is an actor, known for Batman Returns (1992), The Visitor (2007) and Our Idiot Brother (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0503638","name":"Neal Lerner","idIMDB":"nm0503638"},"actorId":"nm0503638","character":"Manny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arye Gross","urlProfile":"http://www.imdb.com/name/nm0343325","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU2MjM2NjY4MV5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 March 1960","placeOfBirth":" Los Angeles, California, USA","height":"5' 8\" (1.73 m)","bio":"Extremely gifted character actor whose face is readily familiar to the public but they can often not remember why. He tends to turn minor supporting roles into perfect studies in human frailty, strength, passion, avarice or anything else demanded by the role. Born on March 17, 1960, in Los Angeles, Arye Gross attended the University of California at Irvine and went on to study acting at the Conservatory at South Coast Repertory. He then became a member of the South Coast Repertory resident company for three years. This was followed by a year with El Teatro Campesino under the direction of Luis Valdez. Gross has appeared in a number of stage productions with a variety of companies in the Los Angeles area, including LATC, Pasedena Playhouse, Odyssey Theater Ensemble, MET Theater and Stages Theater Center. Gross' extensive stage credits include \"La Bete\" for the Stages Theatre Center, \"Room Service\" for the Pasadena Playhouse, \"Three Sisters\" for the Los Angeles Theatre Center, \"Taming of the Shrew\" and \"Much Ado About Nothing\" for the Grove Shakespeare Festival, \"Troillus and Cressida\" for the Globe Playhouse and \"Screwball\" and \"Let's Play Two\" for the South Coast Repertory Theatre. His tour de force as the lackey sent to fetch famed singer Dixie Leonard (Bette Midler) for a TV show in For the Boys (1991) provided what would have been an otherwise mediocre film with all its pivotal moments upon which the story would turn. The most important growth of a character in that film turns out to be that of his who goes from a \"go-fer\" to his own man as a result of his tender encounter with Dixie as she tells him her life story. However, as usual, his performance appeared a seamless part of the whole. In another era, a great character actor such as Gross would be more widely appreciated and celebrated. Many viewers will recall his appearance as the wronged husband in Minority Report (2002) which demanded a change from a loving family man to a betrayed husband falling victim to murderous rage all within a few minutes time. Simply superb.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU2MjM2NjY4MV5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0343325","name":"Arye Gross","idIMDB":"nm0343325"},"actorId":"nm0343325","character":"Roman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adilah Barnes","urlProfile":"http://www.imdb.com/name/nm0055481","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNDY4MDk2NV5BMl5BanBnXkFtZTcwNzY3MTg2OQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 2\" (1.57 m)","bio":"Adilah Barnes is an award-winning actor with over 40 years of acting experience, Barnes is best known to television audiences for her role as Anne Marie on ABC's Roseanne for five seasons -still running in syndication. Barnes has been fortunate in landing roles that come close to who she really is - a woman of enormous strength, steadfastness and grit on a mission to teach us about life, history and the rewards of perseverance. Her role opposite Hilary Swank, as the infamous Ida B. Wells in HBO's Iron","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNDY4MDk2NV5BMl5BanBnXkFtZTcwNzY3MTg2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0055481","name":"Adilah Barnes","idIMDB":"nm0055481"},"actorId":"nm0055481","character":"High School Secretary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kathleen Freeman","urlProfile":"http://www.imdb.com/name/nm0293466","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NDM1NTQ1MV5BMl5BanBnXkFtZTcwNTEzMzkwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1919","placeOfBirth":" Chicago, Illinois, USA","height":"5' 8\" (1.73 m)","bio":"Kathleen Freeman's introduction to show business came very early in life. Her parents were vaudevillians, and she made her debut at age 2 in their act. Later she attended UCLA with intentions of becoming a pianist, but was bitten by the acting bug and never looked back. She gained experience on stage in various stock and repertory companies, and made her film debut in 1948. One of the most memorable character actresses in recent memory, her stocky build, incredibly expressive face and hearty laugh have kept audiences convulsed for decades, playing a variety of neighborhood gossips, busybodies and eccentrics. Memorable as Sister Mary Stigmata (\"The Penguin\"), Dan Aykroyd's and John Belushi's nemesis, in The Blues Brothers (1980). She was used as a comic foil by Jerry Lewis in many of his films, always to great advantage. She did much television work, playing in everything from The Dick Van Dyke Show (1961) to Gomer Pyle: USMC (1964) to Hogan's Heroes (1965) to Married with Children (1987), where she was the voice of Peg's monstrous but never-seen mother, Al Bundy's nemesis. She was working on Broadway in a production of \"The Full Monty\" when she died of lung cancer in 2001.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NDM1NTQ1MV5BMl5BanBnXkFtZTcwNTEzMzkwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0293466","name":"Kathleen Freeman","idIMDB":"nm0293466"},"actorId":"nm0293466","character":"Mrs. Hargrove","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lindsay Sloane","urlProfile":"http://www.imdb.com/name/nm0005441","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjY4ODkxN15BMl5BanBnXkFtZTcwMjc4NjE4MQ@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 August 1977","placeOfBirth":" Long Island, New York, USA","birthName":"Lindsay Sloane Leikin","height":"5' 4\" (1.63 m)","bio":"Admitting to her own lively nature as a child, Sloane took up acting as an outlet for her energy. She developed a real love for the art and signed with an agent at the tender age of 8. Sloane was a television series regular on Mr. Rhodes (1996) and had a recurring role on The Wonder Years (1988). She has also appeared on Dharma & Greg (1997), Working (1997) and My So-Called Life (1994), as well as the made-for-television movie, CBS Schoolbreak Special: Between Mother and Daughter (1995). Sloane's theater experience included \"Emperor's New Clothes\", \"Say Yo Ho Ho\", \"Rumors\" and \"Cabaret\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjY4ODkxN15BMl5BanBnXkFtZTcwMjc4NjE4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005441","name":"Lindsay Sloane","idIMDB":"nm0005441"},"actorId":"nm0005441","character":"Daphne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael B. Silver","urlProfile":"http://www.imdb.com/name/nm0006878","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NTU4MzA2NF5BMl5BanBnXkFtZTgwODI4NTYwODE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1967","placeOfBirth":" New York City, New York, USA","bio":"Born and raised in Manhattan, a graduate of Brown University, Michael comes from a long line of filmmakers. His grandfather, Oscar-winning screenwriter Sidney Buchman, ran Columbia Pictures under Harry Cohn throughout the 1930s and 1940s and wrote and produced such films as Mr. Smith Goes to Washington (1939), Here Comes Mr. Jordan (1941), The Talk of the Town (1942), The Awful Truth (1937) Sahara (1943), A Song to Remember (1945), Holiday (1938), Lost Horizon (1937), The Jolson Story (1946), Cleopatra (1934), Theodora Goes Wild (1936) and more than 20 others. He was blacklisted in 1951 but continued to write from Cannes until his death in 1975. Michael's sister, Amanda Silver, wrote The Hand That Rocks the Cradle (1992) and she and her husband, Rick Jaffa, wrote and produced Rise of the Planet of the Apes and Dawn of the Planet of the Apes, among others. They are currently writing Avatar 2, due 2016.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NTU4MzA2NF5BMl5BanBnXkFtZTgwODI4NTYwODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006878","name":"Michael B. Silver","idIMDB":"nm0006878"},"actorId":"nm0006878","character":"Joe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mimi Rogers","urlProfile":"http://www.imdb.com/name/nm0000211","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NDUyNDQ3N15BMl5BanBnXkFtZTcwOTk0MTMwNA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1956","placeOfBirth":" Coral Gables, Florida, USA","birthName":"Miriam Spickler","height":"5' 8½\" (1.74 m)","bio":"It's fair to say that after 20 years and over 50 film appearances, Mimi Rogers should be praised for her variety of roles and acting capabilities, not for a brief marriage to a Hollywood star. In the early 1980s she began to carve a niche for herself in Hollywood, appearing on television and in films. It was her role in Someone to Watch Over Me (1987) that got her noticed and was her springboard to stardom. Cemented by a marriage to Tom Cruise, an already established young actor, Mimi went on to appear in Hider in the House (1989), Desperate Hours (1990), and The Doors (1991). She appeared in a controversial movie analyzing religion in America, The Rapture (1991), which proved a hit and delighted audiences, creating many a debate over the film's subject material. She played a bored telephone exchange operator who swaps a sinful life of sex and swinging with other couples for a devout religious one, ending unexpectedly in disaster. Despite her successes, few meaty, interesting roles came her way in the '90s. Shooting Elizabeth (1992), opposite Jeff Goldblum, the family movie Mon ami Dodger (1994), Far from Home: The Adventures of Yellow Dog (1995), and Full Body Massage (1995) were just a few of the films that she appeared in. Working consistently, she rejuvenated her career in the unexpected hit Austin Powers: International Man of Mystery (1997), playing Miss Kensington, an attractive female agent of 1960s London and the mother of Elizabeth Hurley's character. Next, Mimi was seen in the big-screen remake of the '60s sci-fi TV series Lost in Space (1998) and several guest appearances on the hugely popular television series The X-Files (1993), playing a scheming FBI agent. A role in the Canadian indie-horror Ginger Snaps (2000) did her career no harm. Soon, she was opposite Geena Davis in The Geena Davis Show (2000) from 2000-01 and playing an extremely rich Manhattan socialite in the direct-to-video Cruel Intentions 2 (2000). More recently Mimi has appeared on cable television, including leading roles in Charms for the Easy Life (2002) (which she also executive produced) and Le coeur enseveli (2003) (a true-life disaster drama in which she played the Chief Superintendent of a mine). In 2004, she gave a revealing performance in The Door in the Floor (2004), a critical success. The Loop (2006), a Chicago-based sitcom, will soon be airing in America, featuring Mimi as a flirtatious office worker. Also in 2006, Mimi will be appearing in an original horror film, Penny Dreadful (2006), playing a psychiatrist in peril. In 2003, she married her longtime partner Chris Ciaffa, with whom she has a son and a daughter. A poker novice, Mimi also travels around competing in tournaments, some televised.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NDUyNDQ3N15BMl5BanBnXkFtZTcwOTk0MTMwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000211","name":"Mimi Rogers","idIMDB":"nm0000211"},"actorId":"nm0000211","character":"Marie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Katy Selverstone","urlProfile":"http://www.imdb.com/name/nm0783596","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTE4NDI4N15BMl5BanBnXkFtZTcwOTYwNTc5Mw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1966","placeOfBirth":" New York City, New York, USA","height":"5' 7\" (1.7 m)","bio":"Katy earned her BFA in acting at the prestigious Carnegie Mellon University. She began her career on stage in regional theaters and New York's Off-Broadway where she was privileged to be part of the development and premiere of Tony and Pulitzer Prize winning playwright Doug Wright's \"Quills\" at New York Theatre Workshop and Tony Award winner Steven Sater's \"Asylum\" at Naked Angels. Katy won a Fany award for Outstanding Broadway Debut in Arthur Miller's \"The Ride Down Mt. Morgan\" with Patrick Stewart and Frances Conroy. She has also been honored in Los Angeles with awards including two Garlands, the LA Weekly, two Dramalogues, and multiple nominations for the LA Drama Critics Circle and Ovation Awards for her work in \"Breaking the Code\", \"Golden Boy\", \"Scotland Road\", \"Indiscretions\", and \"Big Love\". While film fans may recognize Katy as the young Maggie Smith in Divine Secrets of the Ya-Ya Sisterhood (2002), she is a huge fan of independent film and was the Grand Jury's unanimous choice for Best Actress in a Feature at Outfest as \"Una\" in Laura Nix's \"The Politics of Fur\". From TV Katy is most known for her roles as \"Sienna\" in Seinfeld (1989), Drew's girlfriend \"Lisa\" on The Drew Carey Show (1995), and \"Darlene\" in MCI's \"Grammercy Press\" commercials, which she credits with putting her on the LA casting radar. She recently got to work with the amazing director Domenica Cameron-Scorcese on the short film \"Roots in Water\" which premiered at the Tribeca Film Festival in April 2010 and was shown in the 2010 Chicago International Film Festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTE4NDI4N15BMl5BanBnXkFtZTcwOTYwNTc5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0783596","name":"Katy Selverstone","idIMDB":"nm0783596"},"actorId":"nm0783596","character":"Peri","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alan F. Smith","urlProfile":"http://www.imdb.com/name/nm0807228","urlPhoto":"","biography":{"bio":"Alan F. Smith is an actor, known for Seven Girlfriends (1999), The Jamie Foxx Show (1996) and High Freakquency (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0807228","name":"Alan F. Smith","idIMDB":"nm0807228"},"actorId":"nm0807228","character":"Petruchio","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephanie Erb","urlProfile":"http://www.imdb.com/name/nm0258632","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MTkzODYyMV5BMl5BanBnXkFtZTcwNDAzNjYzOA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Stephanie Erb wanted to be an actress ever since watching Laurence Olivier's Hamlet on PBS when she was eight years old. Her training began at The Cleveland Playhouse and continued at SMU's acclaimed Theatre Program. Moving to NY after school led to years of jobs in the regional theatre circuit, including work at Arena Stage, Pittsburgh Public Theatre, Cleveland Playhouse, Cincinnati Playhouse in the Park, Dallas Shakespeare Festival, Utah Shakespeare Festival, Pennsylvania Centre Stage, and a tour of the US with John Houseman's Acting Company (Two Gents, Romeo and Juliet). She also holds degrees in English and Biology. Stephanie garners a lot of inspiration from both of her parents. Her father, the late American contemporary composer Donald Erb, encouraged her pursuit of the arts and was always a beacon of artistic integrity, perseverance and compassion. Her mother Lucille provided endless support and love which made it possible for her to pursue a quixotic business. Through all the ups and downs, her parents offered listening ears, and her very successful father would even mention from time to time, \"You know, I could have been a fireman and been just as happy.\" Upon moving to LA, Stephanie began working on TV and film and has been doing it ever since, performing a stint in the theatre whenever possible. Her first break in television was a guest star on the cult favorite, Star Trek: The Next Generation. She owes her film debut to Peter Weir, who cast her in Fearless with Jeff Bridges and Isabella Rossellini. Check out her resume for lists of other screen work which include recurring roles on Weeds, 24, Freaks and Geeks, as well as film appearances on such productions as The Ring, South Dakota, and Tenacious D in The Pick of Destiny. Stephanie lives in LA with her family and a turtle named Sir PB Shelley. She loves the work she does and hopes she is lucky enough to continue doing it forever.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MTkzODYyMV5BMl5BanBnXkFtZTcwNDAzNjYzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0258632","name":"Stephanie Erb","idIMDB":"nm0258632"},"actorId":"nm0258632","character":"Zoe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jessica Hecht","urlProfile":"http://www.imdb.com/name/nm0372961","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNDA3MzUxM15BMl5BanBnXkFtZTcwOTM1NTQ0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1965","placeOfBirth":" Princeton, New Jersey, USA","birthName":"Jessica Anne Hecht","height":"5' 8\" (1.73 m)","bio":"Jessica Hecht was born on June 28, 1965 in Princeton, New Jersey, USA as Jessica Anne Hecht. She is an actress, known for Sideways (2004), The Forgotten (2004) and Dan in Real Life (2007). She has been married to Adam Bernstein since July 2, 1995. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNDA3MzUxM15BMl5BanBnXkFtZTcwOTM1NTQ0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0372961","name":"Jessica Hecht","idIMDB":"nm0372961"},"actorId":"nm0372961","character":"Architect's Receptionist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Melora Hardin","urlProfile":"http://www.imdb.com/name/nm0002124","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNzAzODk5Ml5BMl5BanBnXkFtZTcwMjEyNTE2Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1967","placeOfBirth":" Houston, Texas, USA","birthName":"Melora Diane Hardin","height":"5' 7\" (1.7 m)","bio":"Melora Hardin was born on June 29, 1967 in Houston, Texas, USA as Melora Diane Hardin. She is an actress, known for The Office (2005), The Hot Chick (2002) and 17 Again (2009). She has been married to Gildart Jackson since 1997. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNzAzODk5Ml5BMl5BanBnXkFtZTcwMjEyNTE2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002124","name":"Melora Hardin","idIMDB":"nm0002124"},"actorId":"nm0002124","character":"Laura","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0177215","urlIMDB":"http://www.imdb.com/title/tt0177215","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"1999 Seven Girlfriends, LLC"},"technical":{"runtime":["1 hr 39 min (99 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"6.0","filmingLocations":[{"location":"Flagstaff, Arizona, USA"}],"rated":"R","awards":[{"award":"AngelCiti Film Festival 2000","titlesAwards":[{"titleAwardOutcome":"Won Diamond Halo Award","categories":[{"category":"Best Feature","names":[{"name":"Paul Lazarus","id":"nm0006996","role":null}]}]}]},{"award":"Casting Society of America, USA 2000","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Best Casting for Feature Film, Independent","names":[{"name":"Mark Teschner","id":"nm0856247","role":null}]}]}]},{"award":"Cinequest San Jose Film Festival 2000","titlesAwards":[{"titleAwardOutcome":"Won Audience Favorite Choice Award","categories":[{"category":"Narrative Feature","names":[{"name":"Paul Lazarus","id":"nm0006996","role":null}]}]}]},{"award":"Ft. Lauderdale International Film Festival 1999","titlesAwards":[{"titleAwardOutcome":"Won Jury Award","categories":[{"category":"Best World Premiere","names":[{"name":"Paul Lazarus","id":"nm0006996","role":null}]}]}]},{"award":"Temecula Valley International Film Festival 2000","titlesAwards":[{"titleAwardOutcome":"Won Viewer's Choice Award","categories":[{"category":"Best Feature Film","names":[{"name":"Paul Lazarus","id":"nm0006996","role":null}]}]}]},{"award":"WorldFest Houston 2000","titlesAwards":[{"titleAwardOutcome":"Won Gold Special Jury Award","categories":[{"category":"Independent Theatrical Feature Films - Comedy","names":[{"name":"Paul Lazarus","id":"nm0006996","role":null}]}]}]}],"votes":"1,020","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026332","name":"White Dwarf Productions"}],"keywords":{"keywords":["marriage","lesbian","funeral","watching television","vomiting","weeping man","crying man","episodic structure","cell phone","wreath","white board","sex on a horse","hug","ford mustang","diamond ring","cooking on car engine","carrot","woman on top","punched in the face","picnic","orchid","mustang convertible","jeep","horse","grand piano","fan","caught having sex","gay parent","womanizer","wedding","thirty something","telephone call","self centeredness","reunion","redemption","portland oregon","phoenix arizona","on the road","mother daughter relationship","love","los angeles california","humiliation","high school sweetheart","flashback","fiancee","fatal accident","dating","boyfriend girlfriend relationship","boise idaho","beach","bathroom","answering machine","anniversary","alarm","female nudity","pajamas","self discipline","pillow talk","wig","wake","unfaithful groom","umbrella","tree planting","theater","theatre people","telephone box","teacher","suspenders","sexual fantasy","sex in an office","scarf","san francisco california","salmon","road trip","restaurant","premature ejaculation","pregnant lesbian","piano","photograph","passionate kiss","party","pancake","open casket funeral","marriage proposal","lesbian mother","lesbian couple","lesbian baby shower","kitchen","kissing on a doorstep","jogger","insomnia","house building","hot air balloon","high school dance","freak accident","flower","flower shop","first love","fireplace","female frontal nudity","fantasy sequence","ex boyfriend ex girlfriend relationship","dysfunctional relationship","drinking","door bell","cowboy hat","cooking","convertible","construction site","coffin","clairvoyant","chef","champagne","casual sex","break up","best friend","bartender","baby shower","architect","actress","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:22:52"}}