{"data":{"movies":[{"title":"Mr. Saturday Night","originalTitle":"","year":"1992","releaseDate":"19920925","directors":[{"name":"Billy Crystal","id":"nm0000345"}],"writers":[{"name":"Billy Crystal","id":"nm0000345"},{"name":"Lowell Ganz","id":"nm0304665"}],"runtime":"119 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNTIzMDg3NF5BMl5BanBnXkFtZTcwMjgzODEyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama"],"plot":"Buddy Young was the comic's comic, beloved by everyone. Now, playing to miniscule crowds in nursing homes, it seems like everybody but Buddy realizes that he should retire. As Buddy looks for work in show business, he realizes that the rest of the world has forgotten the golden days of Buddy Young, and that there just may not be room in the business for an old comic like himself.","simplePlot":"The life of Buddy Young, a comic legend in flashbacks but an old man looking for work in the present.","actors":[{"actorName":"Billy Crystal","urlProfile":"http://www.imdb.com/name/nm0000345","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MjA4MjM4NV5BMl5BanBnXkFtZTcwMzE0MjcxNQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1948","placeOfBirth":" Yorkville, Manhattan, New York City, New York, USA","birthName":"William Edward Crystal","height":"5' 7\" (1.7 m)","bio":"Billy Crystal was born on March 14, 1948 in Long Beach, Long Island, New York. He is the youngest of three sons born to Helen (Gabler) and Jack Crystal. His father was a well-known concert promoter who co-founded Commodore Records and his mother was a homemaker. His family were Jewish immigrants from Russia, Austria, and Lithuania. With his father in the music business, Billy was no stranger to some of the top performers of the time. Legends such as Billie Holiday, Pee Wee Russell, and Eddie Condon regularly stopped by the Crystal household. At age 15, Billy faced a personal tragedy when his father died of a heart attack at the relatively young age of 54. This gave Billy a real appreciation of what his dad was able to accomplish while alive and what his mother did to keep the family together. Despite this tragedy, Billy was very upbeat and likable as a kid. He had a unique talent for making people laugh. With television becoming a new medium, Billy got his influence from shows like The Honeymooners (1955), and \"The Ed Sullivan Show\" and performers like Alan King, Ernie Kovacs and Jonathan Winters. He started doing stand-up comedy at the age of 16. However, his real dream was to be a professional baseball player. His idol growing up was Yankees outfielder Mickey Mantle. He spent long hours in the summers playing softball in the middle of Park Avenue with his brothers and his father, a former pitcher at St. John's University . At Long Beach High, Billy played second base and was varsity captain in his senior year. This earned him a baseball scholarship from Marshall University in West Virginia which he accepted. However, he would never end up playing a game as the baseball program was suspended during his freshman year. This would lead him to leave the university and move back to New York. He then enrolled at nearby Nassau Community College, majoring in theater. It was there that he met and fell in love with a dancer named Janice Goldfinger. They would get married in 1970 and have two daughters. Shortly after, Billy got accepted in New York University, where he majored in Film and TV Direction. While at NYU, he studied under legendary filmmaker Martin Scorsese. He also worked as house manager and usher on a production of \"You're A Good Man, Charlie Brown\". After receiving a Bachelor of Fine Arts from NYU in 1970, Billy temporarily worked as a substitute teacher until he was able to get gigs as a stand-up comic. He formed his own improv group, 3's Company, and opened for musicians like Barry Manilow. His impression of Howard Cosell interviewing Muhammad Ali became a huge hit with the audience. He left Long Beach for Hollywood in August of 1976 in the hopes of trying to land a role on a television series. It only took a year before he got his big break when he was chosen for the role of gay character Jodie Dallas on the controversial ABC sitcom Soap (1977). This would be the first time that an American TV show would feature an openly gay character as a regular. The show ran successfully for four seasons and helped to jump-start Billy's previously stagnant career. After Soap (1977) ended in 1981, Billy continued to do his stand-up routine, which was now attracting a larger audience with his growing celebrity status. During this time, he made many TV guest appearances and even hosted his own short-lived variety show, The Billy Crystal Comedy Hour (1982). He became a regular on Saturday Night Live (1975) in 1984 where his Fernando Lamas impression with the catchphrase \"You Look Mahvellous\" was a huge hit with viewers. This would lead to appearances in feature-length films such as Running Scared (1986) and Throw Momma from the Train (1987). In 1986, along with Whoopi Goldberg and Robin Williams, he started Comic Relief, an annual stand-up comedy show which helped to raise money for housing and medical care for the homeless. The show has since grown substantially with the continued support of all three comics. Billy's career would peak in the late 1980s and early 1990s. His roles in the blockbuster movies When Harry Met Sally... (1989) and City Slickers (1991) helped to establish himself as one of Hollwood's top movie stars. This star status was further validated when he was chosen to host the annual Oscars in 1990, an honor in which he would repeat seven more times. He made his big screen directorial debut in the 1992 film Mr. Saturday Night (1992), which was about a washed-up stand-up comic who refuses to retire. He also wrote, produced and starred in the film. Although the film was not a huge hit, it proved that Billy was much more than an actor and comedian. In the following years, Billy continued to act in, produce, and direct several films. He had his share of hits (Analyze This (1999), America's Sweethearts (2001)) and some flops (Fathers' Day (1997), My Giant (1998)). His role in as a therapist to mobster Robert De Niro in Analyze This (1999) earned him critical praise. In 2001, Billy parlayed his childhood love of baseball and Mickey Mantle into a feature film. The movie, 61* (2001), which premiered on HBO, centered on the relationship between Mantle and Roger Maris and their 1961 pursuit of Babe Ruth's home run record. The film for which Billy served as director and executive producer, garnered 12 Emmy nominations in all. Offscreen, Billy remains married to Janice Crystal and they have homes in California and New York. Both of his daughters are involved in the film business. Jennifer Crystal Foley is an aspiring actress, appearing in 61* (2001), while Lindsay Crystal is an aspiring filmmaker, creating and directing the documentary My Uncle Berns (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MjA4MjM4NV5BMl5BanBnXkFtZTcwMzE0MjcxNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000345","name":"Billy Crystal","nicknames":["Face"],"idIMDB":"nm0000345"},"actorId":"nm0000345","character":"Buddy Young Jr.","urlCharacter":"http://www.imdb.com/character/ch0221526","main":true},{"actorName":"David Paymer","urlProfile":"http://www.imdb.com/name/nm0001601","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NjAwOTA5MF5BMl5BanBnXkFtZTYwODU4MjA1._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 August 1954","placeOfBirth":" Oceanside, Long Island, New York, USA","birthName":"David Charles Paymer","height":"5' 7\" (1.7 m)","bio":"One of modern TV and moviedom's most sturdy and reliable character actors, David Paymer dreamed of being an actor from early childhood. Although he came from a traditional middle-class Jewish family that urged him to become a doctor or lawyer, Paymer felt more at home in the world of the thespian. At 14, he used a fake I.D. to see The Graduate, which starred a young Dustin Hoffman. He grew up in Oceanside, New York, where his father was in the scrap metal business. His mother, a homemaker, had fled Belgium with her family to escape the Nazis. When his father quit the scrap metal business to pursue music, it inspired young Paymer to give his acting dream a try. His aborted big break came when he was cast in the TV series, St. Elsewhere, as \"Dr. Wayne Fiscus\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NjAwOTA5MF5BMl5BanBnXkFtZTYwODU4MjA1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001601","name":"David Paymer","idIMDB":"nm0001601"},"actorId":"nm0001601","character":"Stan","urlCharacter":"http://www.imdb.com/character/ch0001935","main":true},{"actorName":"Julie Warner","urlProfile":"http://www.imdb.com/name/nm0000689","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NjA3Mjc3Nl5BMl5BanBnXkFtZTYwMjUzMzM1._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1965","placeOfBirth":" New York City, New York, USA","birthName":"Juliet Mia Warner","height":"5' 3\" (1.6 m)","bio":"Julie grew up on the Upper West Side of Manhattan. Her father, Neil Warner, was a musical arranger, who wrote jingles for products such as Tic-Tacs and Fig Newtons. Her mother, Naomi, is a freelance book agent. A 10-years younger brother, James, works for the New York City Parks Department. At 12, she attended the exclusive Dalton School, where she became friends with Mary Stuart Masterson. While there, an agent urged her to try out for a role in the movie Pretty Baby (1978). She didn't get it, but it did lead to a role on the soap Guiding Light (1952). She majored in theatre arts at Brown University and graduated in 1987. She worked as a waitress in Los Angeles, while seeking her acting break. In 1995, she married writer-director Jonathan Prince.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NjA3Mjc3Nl5BMl5BanBnXkFtZTYwMjUzMzM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000689","name":"Julie Warner","idIMDB":"nm0000689"},"actorId":"nm0000689","character":"Elaine","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Helen Hunt","urlProfile":"http://www.imdb.com/name/nm0000166","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1OTk1ODIwMV5BMl5BanBnXkFtZTcwMTA0MTIwOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 June 1963","placeOfBirth":" Culver City, California, USA","birthName":"Helen Elizabeth Hunt","height":"5' 7\" (1.7 m)","bio":"Helen Hunt began studying acting at the age of eight with her father, respected director and acting coach Gordon Hunt. A year later she made her professional debut and afterwards worked steadily in films, theatre and television.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1OTk1ODIwMV5BMl5BanBnXkFtZTcwMTA0MTIwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000166","name":"Helen Hunt","idIMDB":"nm0000166"},"actorId":"nm0000166","character":"Annie Wells","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mary Mara","urlProfile":"http://www.imdb.com/name/nm0544721","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NDMwNTkzOF5BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 September 1960","placeOfBirth":" Syracuse, New York, USA","bio":"Mary Mara's television credits include recurring roles on the series \"ER\" and guest-starring roles on \"Hope & Gloria\", \"NYPD Blue\" and \"Law & Order\". She has also appeared in the television films \"In the Blink of an Eye\", on the CBS Television Network, and \"Indictment\". Mara's feature film credits include \"Mr. Saturday Night\", \"True Colors\", \"Blue Steel\", \"Just Looking\", \"Love Potion #9\", with Sandra Bullock, and \"The Hard Way\", with Michael J. Fox. She has performed on stage in \"Kindertransport\", \"Dream of a Common Language\" and \"Mad Forest\" for the Manhattan Theatre Club in New York, as well as in a New York Shakespeare Festival production of \"Twelfth Night\", co-starring with Michelle Pfeiffer, Jeff Goldblum and Mary Elizabeth Mastrantonio. She also appeared with William Hurt in a Yale Repertory production of \"Ivanov\", directed by the head of the Moscow Arts Theater (who spoke no English). While attending San Francisco State University, Mara established the theater company HART (Haight Ashbury Repertory Theatre), where she honed her acting skills. She later transferred to the Yale School of Drama from which she was graduated with a master's degree in fine arts. Mara, a native of Syracuse, N.Y., splits her time between homes in Los Angeles and San Francisco.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NDMwNTkzOF5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0544721","name":"Mary Mara","idIMDB":"nm0544721"},"actorId":"nm0544721","character":"Susan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jerry Orbach","urlProfile":"http://www.imdb.com/name/nm0001583","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzY0Njg2MV5BMl5BanBnXkFtZTYwNjg2OTQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1935","placeOfBirth":" New York City, New York, USA","birthName":"Jerome Bernard Orbach","height":"6' 1½\" (1.87 m)","bio":"Jerry was born in the Bronx. His father, Leon, was a former vaudevillian actor, and his mother, Emily, was a radio singer. His family moved frequently and eventually settled in Waukegan, Illinois where he went to high school. The constant moving made him the new kid on the block and forced him to become \"a chameleon\" to blend in his new settings. He studied drama at the University of Illinois and at Northwestern. He then went to study acting in New York and got constant work in musicals. He slowly pushed to get acting roles in tv and movies, but was frequently overlooked because of his musical roots.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzY0Njg2MV5BMl5BanBnXkFtZTYwNjg2OTQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001583","name":"Jerry Orbach","idIMDB":"nm0001583"},"actorId":"nm0001583","character":"Phil Gussman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ron Silver","urlProfile":"http://www.imdb.com/name/nm0798779","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2ODUxOTI2Ml5BMl5BanBnXkFtZTYwOTIyNTA2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 July 1946","placeOfBirth":" New York City, New York, USA","birthName":"Ronald Arthur Silver","height":"5' 8½\" (1.74 m)","bio":"Ron Silver was born on July 2, 1946 in New York City, New York, USA as Ronald Arthur Silver. He was an actor and director, known for Ali (2001), Timecop (1994) and Reversal of Fortune (1990). He was married to Lynne Miller. He died on March 15, 2009 in New York City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2ODUxOTI2Ml5BMl5BanBnXkFtZTYwOTIyNTA2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0798779","name":"Ron Silver","idIMDB":"nm0798779"},"actorId":"nm0798779","character":"Larry Meyerson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sage Allen","urlProfile":"http://www.imdb.com/name/nm0021023","urlPhoto":"","biography":{"bio":"Sage Allen is an actress, known for Armageddon (1998), Conspiracy Theory (1997) and Ed (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0021023","name":"Sage Allen","idIMDB":"nm0021023"},"actorId":"nm0021023","character":"Mom","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Marsden","urlProfile":"http://www.imdb.com/name/nm0005189","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MDI4MzQ2MV5BMl5BanBnXkFtZTYwODM4MjEz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 January 1975","placeOfBirth":" Providence, Rhode Island, USA","birthName":"Jason Christopher Marsden","height":"5' 3\" (1.6 m)","bio":"With a career spanning more than 25 years, Jason Marsden has been affectionately referred to as that guy from that show. The seasoned actor has worked in film and television with the best and the brightest, including Ridley Scott (White Squall (1996)), Robert Downey Jr. (Ally McBeal (1997)), James Woods (Shark (2006)), Billy Crystal (Mr. Saturday Night (1992)), Jim Carrey (Fun with Dick and Jane (2005)), and countless others. With more than 150 credits to his name, Jason Marsden has definitely made a dent in the entertainment industry. Originally from Warwick, Rhode Island, Jason and his parents relocated to California when he was 11 years old. After just a few weeks of his new after-school activity--scene study and commercial training--the charismatic Jason was instantly signed by an agency and saturated with auditions for film, television, voice-over, commercials, and more. After turns on General Hospital (1963), Webster (1983), and Murphy Brown (1988), Jason was cast as \"Eddie Munster\" in the revamped The Munsters Today (1987), which ran for three seasons in syndication. From there, he appeared on Tales from the Crypt (1989), Anything But Love (1989), and Star Trek: The Next Generation (1987) before landing his second series regular role as Dash X on the series Eerie, Indiana (1991). His character actor appeal soon caught the attention of Billy Crystal, who cast him as a younger version of himself in the film Mr. Saturday Night (1992). For the next few years, Jason co-starred in numerous television shows, including Baywatch (1989), Blossom (1990), Star Trek: Deep Space Nine (1993). He starred in two more sitcoms after that. Almost Home (1993), with Brittany Murphy, and Tom (1994), which starred Tom Arnold. He was soon asked to recur on Full House (1987), as D.J.'s rich boyfriend, Nelson Burkhard. His teen-heartthrob status earned him another recurring gig for two years on the popular TGIF series Boy Meets World (1993). Shortly after, he joined the cast of Step by Step (1991) (which starred Suzanne Somers and Patrick Duffy) for its final two seasons. The silver screen soon called to Jason and, at age twenty, he was offered a role appearing opposite Jeff Bridges in White Squall (1996). On a production that spanned eight countries, he shared the screen with contemporaries Scott Wolf, Jeremy Sisto, Ryan Phillippe, and Balthazar Getty. Upon returning to the states, Jason propelled himself into more network television, appearing in episodes of The Jamie Foxx Show (1996), Ally McBeal (1997), Bram and Alice (2002), Even Stevens (2000), Just Shoot Me! (1997), and Shark (2006). It was his unforgettable guest-starring role as Kim on Will & Grace (1998), however, that earned him a place alongside Eric McCormack, Debra Messing, and Harry Connick Jr.. Somehow, among all of his on-camera work, Jason has also managed to amass over 100 credits behind the mike. He has lent his voice to some of animation's most beloved characters in cartoon series, feature films, radio programs, and more. Jason has played a wide range of roles--from the main male character in the English-language dub of the Academy Award-winning Spirited Away (2001), to the son of one of Disney's favorite dogs in A Goofy Movie (1995). At present, he is wrapping the first season of Hasbro's G.I. Joe: Renegades (2010) for the HUB network, The Fairly OddParents (2001) for Nickelodeon, and Garfield & Cie (2008) on Cartoon Network. If you're a video-game fan, you've probably heard Jason in such epic games as Fallout: New Vegas (2010), Star Wars: Knights of the Old Republic (2003), and the title role in Tak and the Power of Juju (2003). Jason is also a proud member of the Directors Guild of America. Having helmed the season finale of Nickelodeon's The Journey of Allen Strange (1997), he has subsequently directed numerous music videos as well as several short films. His latest short film, Locker 13 (2014) (starring Krista Allen and Rick Hoffman), earned official selection at Palm Springs Shorts Fest, the Phoenix Film Festival, the Nashville International Film Festival, and continues touring the 2010-2011 film-festival circuit. Back in the spotlight once again, Jason has recently appeared in several independent films including High Hopes (2006) (with David Faustino and Jason Mewes), Pizza Man (2011) (starring Frankie Muniz), and the much-anticipated Blue Like Jazz (2012), based on the famed novel, which just wrapped filming in Nashville, Tennessee. While working on his current projects, Jason is studying the Charles Conrad Method at the Steve Eastin Studio and enjoying the role he was born to play--a loving husband to his wife Christy Marsden and awesome dad of his son, Clark Otis.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MDI4MzQ2MV5BMl5BanBnXkFtZTYwODM4MjEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005189","name":"Jason Marsden","nicknames":["J-Mars","Jay"],"idIMDB":"nm0005189"},"actorId":"nm0005189","character":"Buddy - Age 15","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Weiner","urlProfile":"http://www.imdb.com/name/nm0918258","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMjEwNDM3OF5BMl5BanBnXkFtZTcwMTAyNTA0Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1975","placeOfBirth":" Los Angeles, California, USA","bio":"Michael Weiner was born in 1975 in Los Angeles, California, USA. He is an actor, known for Mr. Saturday Night (1992), Man of the Century (1999) and Cinderella II: Dreams Come True (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMjEwNDM3OF5BMl5BanBnXkFtZTcwMTAyNTA0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0918258","name":"Michael Weiner","idIMDB":"nm0918258"},"actorId":"nm0918258","character":"Stan - Age 18","urlCharacter":"http://www.imdb.com/character/ch0001935","main":true},{"actorName":"Larry Gelman","urlProfile":"http://www.imdb.com/name/nm0312475","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MzUzOTY1NF5BMl5BanBnXkFtZTgwMTc2NzEyMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1930","placeOfBirth":" Brooklyn, New York, USA","birthName":"Lawrence Sheldon Gelman","bio":"Larry Gelman was born on November 3, 1930 in Brooklyn, New York, USA as Lawrence Sheldon Gelman. He is an actor, known for Dreamscape (1984), Mr. Saturday Night (1992) and Tales from the Catholic Church of Elvis! (2009). He is married to Barbara.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MzUzOTY1NF5BMl5BanBnXkFtZTgwMTc2NzEyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0312475","name":"Larry Gelman","idIMDB":"nm0312475"},"actorId":"nm0312475","character":"Mr. Gimbel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kay Freeman","urlProfile":"http://www.imdb.com/name/nm0293468","urlPhoto":"","biography":{"bio":"Kay Freeman is an actress, known for Mr. Saturday Night (1992), Summerspell (1983) and Simon & Simon (1981).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0293468","name":"Kay Freeman","idIMDB":"nm0293468"},"actorId":"nm0293468","character":"Mrs. Gimbel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Howard Mann","urlProfile":"http://www.imdb.com/name/nm0542783","urlPhoto":"","biography":{"dateOfBirth":"20 June 1923","placeOfBirth":" New York City, New York, USA","birthName":"Howard Mendelsohn","bio":"Howard Mann was born on June 20, 1923 in New York City, New York, USA as Howard Mendelsohn. He was an actor, known for Malibu's Most Wanted (2003), Mr. Saturday Night (1992) and Blast of Silence (1961). He died on September 18, 2008 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0542783","name":"Howard Mann","idIMDB":"nm0542783"},"actorId":"nm0542783","character":"Stage Manager","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Julius Branca","urlProfile":"http://www.imdb.com/name/nm0104318","urlPhoto":"","biography":{"bio":"Julius Branca is an actor, known for Dahmer (2002), Mr. Saturday Night (1992) and Vultures (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0104318","name":"Julius Branca","idIMDB":"nm0104318"},"actorId":"nm0104318","character":"Stage Manager","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Liz Georges","urlProfile":"http://www.imdb.com/name/nm0313676","urlPhoto":"","biography":{"dateOfBirth":"28 May 1955","placeOfBirth":"","birthName":"Elizabeth Jeanne Georges","bio":"Liz Georges was born on May 28, 1955 as Elizabeth Jeanne Georges. She is an actress, known for As Told by Ginger (2000), Mighty Joe Young (1998) and Mr. Saturday Night (1992). She has been married to David Paymer since 1988. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0313676","name":"Liz Georges","idIMDB":"nm0313676"},"actorId":"nm0313676","character":"Script Girl","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0104928","urlIMDB":"http://www.imdb.com/title/tt0104928","business":{"budget":{"money":"$43,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1991/\">1991</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 59 min (119 min)"],"soundMix":["Dolby SR"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA (also prints)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.8","filmingLocations":[{"location":"Ambassador Hotel - 3400 Wilshire Boulevard, Los Angeles, California, USA"}],"rated":"R","awards":[{"award":"Academy Awards, USA 1993","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Actor in a Supporting Role","names":[{"name":"David Paymer","id":"nm0001601","role":null}]}]}]},{"award":"Golden Globes, USA 1993","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Performance by an Actor in a Motion Picture - Comedy or Musical","names":[{"name":"Billy Crystal","id":"nm0000345","role":null}]},{"category":"Best Performance by an Actor in a Supporting Role in a Motion Picture","names":[{"name":"David Paymer","id":"nm0001601","role":null}]}]}]},{"award":"American Comedy Awards, USA 1993","titlesAwards":[{"titleAwardOutcome":"Nominated American Comedy Award","categories":[{"category":"Funniest Actor in a Motion Picture (Leading Role)","names":[{"name":"Billy Crystal","id":"nm0000345","role":null}]}]}]},{"award":"Casting Society of America, USA 1993","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Best Casting for Feature Film, Comedy","names":[{"name":"Pam Dixon","id":"nm0228938","role":null}]}]}]},{"award":"Chicago Film Critics Association Awards 1992","titlesAwards":[{"titleAwardOutcome":"Nominated CFCA Award","categories":[{"category":"Most Promising Actress","names":[{"name":"Julie Warner","id":"nm0000689","role":null}]}]}]},{"award":"Political Film Society, USA 1993","titlesAwards":[{"titleAwardOutcome":"Nominated PFS Award","categories":[{"category":"Peace","names":[]}]}]},{"award":"Young Artist Awards 1993","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Young Actor Co-starring in a Motion Picture","names":[{"name":"Jason Marsden","id":"nm0005189","role":null}]}]}]}],"votes":"3,935","type":"Movie","companyCreditsSimple":[{"idCompany":"co0040620","name":"Castle Rock Entertainment"},{"idCompany":"co0130379","name":"Face Productions"},{"idCompany":"co0046718","name":"New Line Cinema"}],"keywords":{"keywords":["written and directed by cast member","new york city","talent agent","stand up comedy","audition","comedian","brother brother relationship","real tv show shown in fictional situation","period in title","day in title","abbreviation in title","directed by star","bloopers during credits","early television","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:32:09"}}