{"data":{"movies":[{"title":"Any Given Sunday","originalTitle":"","year":"1999","releaseDate":"19991222","directors":[{"name":"Oliver Stone","id":"nm0000231"}],"writers":[{"name":"Daniel Pyne","id":"nm0002417"},{"name":"John Logan","id":"nm0517589"}],"runtime":"162 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDk2YTQxZjUtYzJkYi00MTk4LTk4NDAtZmQ3ZGQwMDQxY2ZjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Sport"],"plot":"When a devastating hit knocks a professional football legend and quarterback Cap Rooney out of the game, a young, unknown third-stringer is called in to replace him. Having ridden the bench for years because of a string of bad luck stories and perhaps insufficient character, Willie Beaman seizes what may be his last chance, and lights up the field with a raw display of athletic prowess. His stunning performance over several games is so outstanding and fresh it seems to augur a new era in the history of this Miami franchise, and forces aging coach Tony D'Amato to reevaluate his time-tested values and strategies and begin to confront the fact that the game, as well as post-modern life may be passing him by. Adding to the pressure on D'Amato to win at any cost is the aggressive young President/Co-owner of the team, Christina Pagniacci, now coming into her own after her father's death. Christina's driving desire to prove herself in a male dominated world is intensified by her focus on the...","simplePlot":"A behind-the-scenes look at the life-and-death struggles of modern-day gladiators and those who lead them.","actors":[{"actorName":"Al Pacino","urlProfile":"http://www.imdb.com/name/nm0000199","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzg1ODAyNl5BMl5BanBnXkFtZTYwMjAxODQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1940","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Alfredo James Pacino","height":"5' 7\" (1.7 m)","bio":"One of the greatest actors in all of film history, Al Pacino established himself during one of film's greatest decades, the 1970s, and has become an enduring and iconic figure in the world of American movies. Alfredo James Pacino was born on April 25, 1940, in the Bronx, New York, to an Italian-American family. His parents, Rose (Gerardi) and Sal Pacino, divorced when he was young. His mother moved them into his grandparents' house. Pacino found himself often repeating the plots and voices of characters he had seen in the movies, one of his favorite activities. Bored and unmotivated in school, the young Al Pacino found a haven in school plays, and his interest soon blossomed into a full-time career. Starting on the stage, he went through a lengthy period of depression and poverty, sometimes having to borrow bus fare to make it to auditions. He made it into the prestigious Actors Studio in 1966, studying under legendary acting coach Lee Strasberg, creator of the Method Approach that would become the trademark of many 1970s-era actors. After appearing in a string of plays in supporting roles, Pacino finally succeeded with \"The Indian Wants the Bronx\", winning an Obie Award for the 1966-67 season. That was followed by a Tony Award for \"Does the Tiger Wear a Necktie?\". His first feature films made little departure from the gritty realistic stage performances that earned him respect: he played a drug addict in The Panic in Needle Park (1971) after his film debut in Me, Natalie (1969). What came next would change his life forever. The role of Michael Corleone in The Godfather (1972) was one of the most sought-after of the time: Robert Redford, Warren Beatty, Jack Nicholson, Ryan O'Neal, Robert De Niro and a host of others either wanted it or were mentioned for it, but director Francis Ford Coppola had his heart set on the unknown Italian Pacino for the role, although pretty much everyone else--from the studio to the producers to some of the cast members--did not want him. Though Coppola won out through slick persuasion, Pacino was in constant fear of being fired during the hellish shoot. Much to his (and Coppola's) relief, the film was a monster hit that did wonders for everyone's career, including Pacino's, and earned him his first Academy Award nomination for Best Supporting Actor. However, instead of taking on easier projects for the big money he could now command, Pacino threw his support behind what he considered tough but important films, such as the true-life crime drama Serpico (1973) and the tragic real-life bank robbery film Dog Day Afternoon (1975). He opened eyes around the film world for his brave choice of roles, and he was nominated three consecutive years for the \"Best Actor\" Academy Award. He faltered slightly with Bobby Deerfield (1977), but regained his stride with ...and justice for all. (1979), for which he received another Academy Award nomination for Best Actor. Unfortunately, this would signal the beginning of a decline in his career, which produced such critical and commercial flops as Cruising - La Chasse (1980) and Author! Author! (1982). Pacino took on another vicious gangster role and cemented his legendary status in the ultra-violent cult film Scarface (1983), but a monumental mistake was about to follow. Revolution (1985) endured an endless and seemingly cursed shoot in which equipment was destroyed, weather was terrible, and Pacino became terribly ill with pneumonia. Constant changes in the script also further derailed a project that seemed doomed from the start anyway. The Revolutionary War film is considered one of the worst films ever, not to mention one of the worst of his career, resulted in his first truly awful reviews and kept him off the screen for the next four years. Returning to the stage, Pacino has done much to give back and contribute to the theatre, which he considers his first love. He directed a film, The Local Stigmatic (1990), but it remains unreleased. He lifted his self-imposed exile with the striking Sea of Love (1989) as a hard-drinking policeman. This marked the second phase of Pacino's career, being the first to feature his now famous dark, owl eyes and hoarse, gravelly voice. Returning to the Corleones, Pacino made The Godfather: Part III (1990) and earned raves for his first comedic role in the colorful Dick Tracy (1990). This earned him another Academy Award nomination for Best Supporting Actor, and two years later he was nominated for Glengarry Glen Ross (1992). He went into romantic mode for Frankie and Johnny (1991). In 1992, he finally won the Academy Award for Best Actor for his amazing performance in Scent of a Woman (1992). A mixture of technical perfection (he plays a blind man) and charisma, the role was tailor-made for him, and remains a classic. The next few years would see Pacino becoming more comfortable with acting and movies as a business, turning out great roles in great films with more frequency and less of the demanding personal involvement of his wilder days. Carlito's Way (1993) proved another gangster classic, as did the epic crime drama Heat (1995) directed by Michael Mann and co-starring Robert De Niro, although they only had a few scenes together. He returned to the director's chair for the highly acclaimed and quirky Shakespeare adaptation Looking for Richard (1996). City Hall (1996), Donnie Brasco (1997) and The Devil's Advocate (1997) all came out in this period. Reteaming with Mann and then Oliver Stone, he gave two commanding performances in The Insider (1999) and Any Given Sunday (1999). In the 2000s, Pacino starred in a number of theatrical blockbusters, including Ocean's Thirteen (2007), but his choice in television roles (the vicious Roy Cohn in the HBO miniseries Angels in America (2003) and his sensitive portrayal of Jack Kevorkian, in the television movie You Don't Know Jack (2010)) are reminiscent of the bolder choices of his early career. Each television project garnered him an Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie. In his personal life, Pacino is one of Hollywood's most enduring and notorious bachelors, having never been married. He has a daughter, Julie Marie, with acting teacher Jan Tarrant, and a new set of twins with longtime girlfriend Beverly D'Angelo. His romantic history includes a long-time romance with \"Godfather\" co-star Diane Keaton. With his intense and gritty performances, Pacino was an original in the acting profession. His Method approach would become the process of many actors throughout time, and his unbeatable number of classic roles has already made him a legend among film buffs and all aspiring actors and directors. His commitment to acting as a profession and his constant screen dominance has established him as one of the movies' true legends. Pacino has never abandoned his love for the theater, and Shakespeare in particular, having directed the Shakespeare adaptation Looking for Richard (1996) and played Shylock in The Merchant of Venice (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzg1ODAyNl5BMl5BanBnXkFtZTYwMjAxODQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000199","name":"Al Pacino","nicknames":["Sonny"],"idIMDB":"nm0000199"},"actorId":"nm0000199","character":"Tony D'Amato","urlCharacter":"http://www.imdb.com/character/ch0009155","main":true},{"actorName":"Cameron Diaz","urlProfile":"http://www.imdb.com/name/nm0000139","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNTI5NzM4MV5BMl5BanBnXkFtZTcwMTI3ODY3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 August 1972","placeOfBirth":" San Diego, California, USA","birthName":"Cameron Michelle Diaz","height":"5' 8½\" (1.74 m)","bio":"A tall, strikingly attractive blue-eyed natural blonde, Cameron Diaz was born in 1972 in San Diego, the daughter of a Cuban-American father and an Anglo-German mother. Self described as \"adventurous, independent and a tough kid,\" Cameron left home at 16 and for the next 5 years lived in such varied locales as Japan, Australia, Mexico, Morocco, and Paris. Returning to California at the age of 21, she was working as a model when she auditioned for a big part in The Mask (1994). To her amazement and despite having no previous acting experience, she was cast as the female lead in the film opposite Jim Carrey. Over the next 3 years, she honed her acting skills in such low budget independent films as The Last Supper (1995); Feeling Minnesota (1996); and Head Above Water (1996). She returned to main stream films in My Best Friend's Wedding (1997), in which she held her own against veteran actress Julia Roberts. She earned full fledged star status in 1998 for her performance in the box office smash There's Something About Mary (1998). With her name near the top on virtually every list of Hollyood's sexiest actresses, and firmly established as one of filmdom's hottest properties and most sought after actresses, Cameron Diaz appears to possess everything necessary to become one of the super stars of the new century.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNTI5NzM4MV5BMl5BanBnXkFtZTcwMTI3ODY3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000139","name":"Cameron Diaz","nicknames":["Cami"],"idIMDB":"nm0000139"},"actorId":"nm0000139","character":"Christina Pagniacci","urlCharacter":"http://www.imdb.com/character/ch0009156","main":true},{"actorName":"Dennis Quaid","urlProfile":"http://www.imdb.com/name/nm0000598","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4ODk3NTcyMl5BMl5BanBnXkFtZTcwOTIwMTQxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1954","placeOfBirth":" Houston, Texas, USA","birthName":"Dennis William Quaid","height":"6' (1.83 m)","bio":"Dennis Quaid was born in Houston, Texas, to Juanita Bonniedale (Jordan), a real estate agent, and William Rudy Quaid, an electrician. He grew up in the Houston suburban city of Bellaire. He was raised a Baptist, and studied drama, Mandarin Chinese, and dance while a student at Bellaire High School. He continued study at the University of Houston, but dropped out before completing his degree. He moved to Los Angeles to pursue a film career where his brother, Randy Quaid, had already began to build a successful career. However, Dennis initially had trouble finding film roles, but began to gain notice when he appeared in Breaking Away (1979) and earned strong reviews for his role in The Right Stuff (1983). Aside from acting, Quaid is also a musician, and plays with his band, \"The Sharks\". He holds a flying license and is a five handicap golfer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4ODk3NTcyMl5BMl5BanBnXkFtZTcwOTIwMTQxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000598","name":"Dennis Quaid","idIMDB":"nm0000598"},"actorId":"nm0000598","character":"Jack 'Cap' Rooney","urlCharacter":"http://www.imdb.com/character/ch0009159","main":true},{"actorName":"James Woods","urlProfile":"http://www.imdb.com/name/nm0000249","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE5ODIxNTcxNV5BMl5BanBnXkFtZTgwMjQ2ODYzMDI@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1947","placeOfBirth":" Vernal, Utah, USA","birthName":"James Howard Woods","height":"5' 11\" (1.8 m)","bio":"James Woods is a leanly built, strangely handsome actor-producer-director with intense eyes and a sometimes untrustworthy grin, who has been impressing audiences for over three decades with his compelling performances. James Howard Woods was born on April 18th, 1947 in Vernal, Utah, the son of Martha A. (Smith) and Gail Peyton Woods, a United States Army intelligence officer who died during Woods' childhood. James is of Irish, English, and German descent. He grew up in Warwick, Rhode Island, with his mother and stepfather. He graduated from Pilgrim High School in 1965, near the top of his class. He earned a scholarship to the Massachusetts Institute of Technology; dropping out during his sophomore year in 1967, he then headed off to New York with his fraternity brother Martin Donovan to pursue aspirations to appear on the stage. After appearing in a handful of New York City theater productions, Woods scored his first film role in All the Way Home (1971) and followed that up with meager supporting roles in The Way We Were (1973) and The Choirboys (1977). However, it was Woods' cold-blooded performance as the cop killer in The Onion Field (1979), based on a Joseph Wambaugh novel, that seized the attention of movie-goers to his on-screen power. Woods quickly followed up with another role in another Joseph Wambaugh film adaptation, The Black Marble (1980), as a sleazy and unstable cable-T.V.-station owner in David Cronenberg's mind-bending and prophetic Vidéodrome (1983), as gangster Max Bercovicz in Sergio Leones mammoth epic Il était une fois en Amérique (1984), and scored a best actor Academy Award nomination as abrasive journalist Richard Boyle in Oliver Stone's gritty and unsettling Salvador (1986). There seemed to be no stopping the rise of this star as he continued to amaze movie-goers with his remarkable versatility and his ability to create such intense, memorable characters. The decade of the 1990s started off strongly with high praise for his role as Roy Cohn in the television production of Citizen Cohn (1992). Woods was equally impressive as sneaky hustler Lester Diamond who cons Sharon Stone in Casino (1995), made a tremendous H.R. Haldeman in Nixon (1995), portrayed serial killer Carl Panzram in Killer: A Journal of Murder (1995), and then as accused civil rights assassin Byron De La Beckwith in Ghosts of Mississippi (1996). Not to be typecast solely as hostile hoodlums, Woods has further expanded his range to encompass providing voice-overs for animated productions including Hercules (1997), Hooves of Fire (1999), and Stuart Little 2 (2002). Woods also recently appeared in the critically praised The Virgin Suicides (1999), in the coming-of-age movie Riding in Cars with Boys (2001), as a corrupt medico in Any Given Sunday (1999), and in the comedy-horror spoof Scary Movie 2 (2001). A remarkable performer with an incredibly diverse range of acting talent, Woods remains one of Hollywood's outstanding leading men.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE5ODIxNTcxNV5BMl5BanBnXkFtZTgwMjQ2ODYzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000249","name":"James Woods","nicknames":["Jimmy"],"idIMDB":"nm0000249"},"actorId":"nm0000249","character":"Dr. Harvey Mandrake","urlCharacter":"http://www.imdb.com/character/ch0009160","main":true},{"actorName":"Jamie Foxx","urlProfile":"http://www.imdb.com/name/nm0004937","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNjY1NDg3NF5BMl5BanBnXkFtZTgwNjA2MTg0MzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1967","placeOfBirth":" Terrell, Texas, USA","birthName":"Eric Marlon Bishop","height":"5' 9\" (1.75 m)","bio":"Jamie Foxx is an American actor, singer, and comedian. He won an Academy Award for Best Actor, BAFTA Award for Best Actor in a Leading Role, and Golden Globe Award for Best Actor in a Musical or Comedy, for his work in the 2004 biographical film Ray (2004). The same year, he was nominated for the Academy Award for Best Supporting Actor for his role in the action film Collateral (2004). Other prominent acting roles include the title role in the film Django Unchained (2012), the super villain Electro in The Amazing Spider-Man 2 (2014), and William Stacks in the 2014 version of Annie (2014). Jamie Foxx was born Eric Marlon Bishop in Terrell, Texas, to Louise Annette Talley and Darrell Bishop, who worked as a stockbroker and had later changed his name to Shahid Abdula. His mother was an adopted child. When her marriage to his father failed, his maternal grandparents, Mark and Estelle Talley, stepped in and, at age seven months, adopted Jamie too. He has said that he had a very rigid upbringing that placed him in the Boy Scouts and the church choir. During high school, he played quarterback for his high school team and was good enough that he got press in Dallas newspapers. He studied music in college. He released a music album in 1994, \"Peep This\", and sings the theme song for his 1999 movie, Any Given Sunday (1999). However, in 1989, his life changed when a girl friend challenged him to get up onstage at the Comedy Club. In fact, he says he took his androgynous stage name because he learned that women got preference for mike time on open stage nights. That led to his being cast in Roc (1991) and In Living Color (1990). Foxx had his own WB television show from 1996 to 2001, the sitcom The Jamie Foxx Show (1996), in which he played Jamie King Jr. Foxx is also a Grammy Award-winning musician, producing four albums which have charted highly on the US Billboard 200: Unpredictable (2005), which topped the chart, Intuition (2008), Best Night of My Life (2010), and Hollywood: A Story of a Dozen Roses (2015). In 2012, Foxx starred in the title role of the Quentin Tarantino written and directed Django Unchained. Foxx starred alongside his Ray co-star Kerry Washington, as well as Christoph Waltz, Leonardo DiCaprio and Samuel L. Jackson. In 2013, Foxx was cast as President James Sawyer in White House Down alongside Channing Tatum. The following year, Foxx appeared in The Amazing Spider-Man 2 as the villain Electro, and co-starred with Quvenzhané Wallis in Annie, Sony's Will Smith and Jay-Z produced update of the comic strip-turned-musical. He has two children, including Corinne Foxx, born in 1995, who lives with her mother.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNjY1NDg3NF5BMl5BanBnXkFtZTgwNjA2MTg0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004937","name":"Jamie Foxx","idIMDB":"nm0004937"},"actorId":"nm0004937","character":"Willie Beamen","urlCharacter":"http://www.imdb.com/character/ch0009158","main":true},{"actorName":"LL Cool J","urlProfile":"http://www.imdb.com/name/nm0005112","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1OTk3MDczM15BMl5BanBnXkFtZTgwMzM2MDc4ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 January 1968","placeOfBirth":" Bay Shore, Long Island, New York, USA","birthName":"James Todd Smith","height":"6' 1½\" (1.87 m)","bio":"L.L. Cool J was born James Todd Smith on January 14, 1968, in Bay Shore, Long Island, New York, the son of Ondrea Griffith and James Louis Smith, Jr. Todd, as he was called, did not have a very happy childhood. At the age of four, he saw his mother and grandfather shot by his own father. After they recovered from their injuries, his mother began to date a young physical therapist she met while in the hospital. The therapist treated Ondrea kindly, but for years he abused Todd physically and verbally, which resulted in Todd becoming a bully himself. It was during this period that he started wearing hats all the time (one of L.L. Cool J's trademarks is the fact that people never see him without a hat on--until recently). Fortunately, Ondrea finally discovered what this man was doing to her son and left him. As he grew older, Todd found a way to escape the effects of his abuse and his bullying attitude: hip-hop music. He fell in love with it at the age of nine, and by 11 he was writing lyrics and making his own songs with some DJ equipment his grandfather gave him. At 15, he and one of his best friends came up with his present stage name, L.L. Cool J, which means \"Ladies Love Cool James.\" In 1984, when L.L. was 16, he met Rick Rubin, a student at NYU, who gave him his big break in music. Rick really liked L.L.'s music and decided to try to get him a record deal. Together, they made the single \"I Need a Beat\" and sent it to an artist manager named Russell Simmons. Simmons loved the single, and, in the same year, Rick and Russell co-founded the famous Def Jam Recordings; L.L.'s debut album, \"Radio,\" released in 1985, after securing a distribution deal for Def Jam with Columbia/CBS Records, was the label's first long-playing release. Even today, L.L. is considered one of Def Jam's most prized possessions. 1985 was also the year L.L. started his acting career. He first appeared in Krush Groove (1985), which is a semi-biographical account of the early days of Def Jam Recordings. L.L. had a cameo appearance in the film. In 1986, L.L. also had a cameo appearance in the movie Wildcats (1986) and also wrote that movie's theme song. After that, L.L. took a break from film and concentrated more on his first love: music. His career took off, and after every one of his albums hit platinum-selling status, he was (and still is) regarded as one of the greatest hip-hop artists of all time. After a few years, he had small roles in a few other films, but was still better known for his music. All this changed in 1995. By this time he was a happily married 27-year-old with three children. His first starring film, Out-of-Sync (1995), had also been released. It didn't do very well at the box office, but it got him noticed by executives at NBC-TV, who wanted to give him a part in a sitcom they were going to air. This sitcom was In the House (1995), which showed L.L.'s acting ability; the show stayed on the air until 1999. He had been offered several films roles during the run of the show and decided to accept a part in Halloween H20: 20 Years Later (1998). Its success resulted in L.L. being cast in bigger and better film roles, and he has acted alongside actors such stars Whoopi Goldberg, Samuel L. Jackson, Jamie Lee Curtis, James Woods, Al Pacino, Omar Epps, Pam Grier, Stanley Tucci, and Dennis Quaid, to name a few. In 2000, he was finally rewarded for his acting talent. That year he won a Blockbuster Entertainment Award for the best supporting actor in the action film Deep Blue Sea (1999). Even though his film career has taken off, he hasn't forgotten his love of hip-hop music. In 1998, he was planning to retire from hip-hop and just concentrate on his film career, but he later decided to keep dividing his time between both fields. L.L. is not only known as one of the greatest MCs of all time, but he is also known as a great actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1OTk3MDczM15BMl5BanBnXkFtZTgwMzM2MDc4ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005112","name":"LL Cool J","nicknames":["Uncle L","The Future of the Funk","Nickelhead","LL","G.O.A.T.","Jack the Ripper","Mr. Smith"],"idIMDB":"nm0005112"},"actorId":"nm0005112","character":"Julian Washington","urlCharacter":"http://www.imdb.com/character/ch0009162","main":true},{"actorName":"Matthew Modine","urlProfile":"http://www.imdb.com/name/nm0000546","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3MzQyOTM5MF5BMl5BanBnXkFtZTgwNDg2Njk2OTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1959","placeOfBirth":" Loma Linda, California, USA","birthName":"Matthew Avery Modine","height":"6' 3½\" (1.92 m)","bio":"The youngest of seven, Matthew was born in Loma Linda, Ca, to Dolores (Warner), a bookkeeper, and Mark Alexander Modine, a drive-in theater manager. After graduating high school in Imperial Beach, Ca. Modine moved to NYC (1979). Matthew studied with Stella Adler at her Conservatory of Acting. While still a student of hers, he began landing starring roles in film, and later theatre and television. Matthew has worked with many of the most highly regarded directors including, Christopher Nolan, Oliver Stone, Sir Alan Parker, Stanley Kubrick, Robert Altman, Abel Ferrara, Alan J. Pakula, John Schlesinger, Tony Richardson, Robert Falls, Sir Peter Hall, Spike Lee, Tom DiCillo, Mike Figgis, Jonathan Demme and John Sayles. A partial list of his films include: The Dark Knight Rises (2012), Birdy (1984), Vision Quest (1985), Full Metal Jacket (1987), Married to the Mob (1988), Gross Anatomy (1989), Memphis Belle (1990), Pacific Heights (1990), Short Cuts (1993), The Browning Version (1994) and Any Given Sunday (1999). Matthew is the recipient of a Golden Globe Award, Venice Film Festival Volpi Cup and Golden Lion. Mary (2005), directed by Abel Ferrara, co-starring Juliette Binoche and Forest Whitaker, won the Special Jury Prize at the Venice Film Festival. Birdy won the Cannes Film Festival Gran Prix. Equinox (1992), directed by Alan Rudolph, received four Independent Spirit Award nominations including Best Actor and Best Film. For his work in television, Matthew was part of the Emmy winning Showtime series Weeds (2005). He has received Golden Globe and Emmy Award nominations for the M.O.W. What the Deaf Man Heard (1997) and HBO's Emmy winning And the Band Played On (1993). Modine has directed several distinguished short films: When I Was a Boy (1993), Smoking (1994), Ecce Pirate (1997), I Think I Thought (2008) and To Kill an American (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3MzQyOTM5MF5BMl5BanBnXkFtZTgwNDg2Njk2OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000546","name":"Matthew Modine","idIMDB":"nm0000546"},"actorId":"nm0000546","character":"Dr. Ollie Powers","urlCharacter":"http://www.imdb.com/character/ch0009163","main":true},{"actorName":"Jim Brown","urlProfile":"http://www.imdb.com/name/nm0000987","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MDUzNDU3NF5BMl5BanBnXkFtZTcwNzg3MTI0NA@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1936","placeOfBirth":" St. Simons Island, Georgia, USA","birthName":"James Nathaniel Brown","height":"6' 2\" (1.88 m)","bio":"Often mentioned as the greatest player in NFL history, this ruggedly handsome African American fullback for the Cleveland Browns first appeared on movie screens in the western Rio Conchos (1964), followed by a strong supporting role as convict commando \"Jefferson\" in the terrific WW2 action film The Dirty Dozen (1967). He was kept busy with additional on screen appearances in other fast paced films including Ice Station Zebra (1968), 100 Rifles (1969) and El Condor (1970). Brown's popularity grew during the boom of \"blaxploitation\" cinema in the early 1970s portraying tough \"no nonsense\" characters in Slaughter (1972), Black Gunn (1972) and Three the Hard Way (1974). His on-screen work in the latter part of the 1970s and 1980s was primarily centered around guest spots on popular TV shows such as CHiPs (1977) and Knight Rider (1982). However, Brown then resurfaced in better quality films beginning with his role as a fiery assassin in The Running Man (1987), he parodied the blaxploitation genre along with many other African-American actors in the comedy I'm Gonna Git You Sucka (1988), played an ex-heavyweight boxer in the sci-fi comedy Mars Attacks! (1996) and ironically played an ex-football legend in the Oliver Stone directed sports film Any Given Sunday (1999). Additionally, Jim Brown was a ringside commentator for the first six events of the Ultimate Fighting Championships from 1993 through to 1996. A bona fide legend in American sports and a successful actor, he continues to remain busy in front of the camera with recent appearances in various sports shows & TV productions.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MDUzNDU3NF5BMl5BanBnXkFtZTcwNzg3MTI0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000987","name":"Jim Brown","idIMDB":"nm0000987"},"actorId":"nm0000987","character":"Montezuma Monroe","urlCharacter":"http://www.imdb.com/character/ch0009165","main":true},{"actorName":"Lawrence Taylor","urlProfile":"http://www.imdb.com/name/nm0852753","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMTI4MDE3OF5BMl5BanBnXkFtZTcwNzYxNjc1Mg@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1959","placeOfBirth":" Williamsburg, Virginia, USA","birthName":"Lawrence Julius Taylor","height":"6' 3\" (1.91 m)","bio":"Lawrence Taylor was born on February 4, 1959 in Williamsburg, Virginia, USA as Lawrence Julius Taylor. He is an actor, known for The Waterboy (1998), When in Rome (2010) and LT: The Life & Times (2013). He has been married to Lynette since 2007. He was previously married to Maritza Cruz and Deborah Belinda Taylor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMTI4MDE3OF5BMl5BanBnXkFtZTcwNzYxNjc1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0852753","name":"Lawrence Taylor","nicknames":["L.T."],"idIMDB":"nm0852753"},"actorId":"nm0852753","character":"Luther 'Shark' Lavay","urlCharacter":"http://www.imdb.com/character/ch0009167","main":true},{"actorName":"Bill Bellamy","urlProfile":"http://www.imdb.com/name/nm0004740","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMTY4OTc2M15BMl5BanBnXkFtZTgwODg4NjI0MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 April 1965","placeOfBirth":" Newark, New Jersey, USA","height":"6' 2\" (1.88 m)","bio":"1 brother (deceased) - per TV series \"UnSung Hollywood - Bill Bellamy\" (S3 Ep7) Recently aired on TVOne as a repeat on 11/16/2016, It's a Documentary show which details archival film footage and personal, revealing interviews, about the lives and careers of some of the world's most highly talented but sometimes forgotten celebrities from the industry. Credits: Gary Anthony Williams (Narrator).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMTY4OTc2M15BMl5BanBnXkFtZTgwODg4NjI0MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004740","name":"Bill Bellamy","idIMDB":"nm0004740"},"actorId":"nm0004740","character":"Jimmy Sanderson","urlCharacter":"http://www.imdb.com/character/ch0084116","main":true},{"actorName":"Andrew Bryniarski","urlProfile":"http://www.imdb.com/name/nm0117420","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODI4NjA2OV5BMl5BanBnXkFtZTcwMzQ3OTQzOA@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1969","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Andrew Bryniarski","height":"6' 5½\" (1.97 m)","bio":"Andrew Bryniarski was born on February 13, 1969 in Philadelphia, Pennsylvania. The 6' 5\" is a former bodybuilder. He came to Hollywood for a short summer vacation to visit a friend, was spotted by a talent scout, who set up a screen test for Joel Silver, and all of a sudden he was acting alongside Bruce Willis and James Coburn in Hudson Hawk (1991). Since then, Andrew has worked with Al Pacino, James Woods, Michelle Pfeiffer, Halle Berry, and Cuba Gooding Jr. to mention just a few, as well as Hong Kong's best including Hark Tsui and Woo-Ping Yuen. His film work includes Pearl Harbor (2001), Tim Burton's Batman Returns (1992), Oliver Stone's Any Given Sunday (1999), Rollerball (2002), Scooby-Doo (2002), Street Fighter - L'ultime combat (1994), The Program (1993), and John Singleton's Higher Learning (1995). He also appeared on TV in FX's 44 Minutes: The North Hollywood Shoot-Out (2003), which received enormous ratings and broke several records. His other guest appearances on TV shows has included in L.A. Law (1986), Lois & Clark: The New Adventures of Superman (1993), Firefly (2002), Without a Trace (2002), and Burn Notice (2007). Andrew was included by Entertainment Weekly in 2003's \"It List\" of the top 100 creative people in Hollywood. He also starred in New Line's The Texas Chainsaw Massacre (2003), playing the killer known as 'Leatherface\". He reprised the role in The Texas Chainsaw Massacre: The Beginning (2006). He is involved in all outdoor activities from mountain climbing to horseback riding, and lives a healthy lifestyle, working out at the gym and practicing yoga.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODI4NjA2OV5BMl5BanBnXkFtZTcwMzQ3OTQzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0117420","name":"Andrew Bryniarski","nicknames":["Lattimer"],"idIMDB":"nm0117420"},"actorId":"nm0117420","character":"Patrick 'Madman' Kelly","urlCharacter":"http://www.imdb.com/character/ch0009164","main":true},{"actorName":"Lela Rochon","urlProfile":"http://www.imdb.com/name/nm0005375","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDAyODI5NzYyMV5BMl5BanBnXkFtZTYwMjQwMTc3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 April 1964","placeOfBirth":" Los Angeles, California, USA","birthName":"Lela Rochon Staples","height":"5' 9\" (1.75 m)","bio":"Lela Rochon was born on April 17, 1964 in Los Angeles, California, USA as Lela Rochon Staples. She is an actress and producer, known for Any Given Sunday (1999), Waiting to Exhale (1995) and Piège à Hong Kong (1998). She has been married to Antoine Fuqua since April 9, 1999. They have two children. She was previously married to Adolfo Quinones.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDAyODI5NzYyMV5BMl5BanBnXkFtZTYwMjQwMTc3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005375","name":"Lela Rochon","idIMDB":"nm0005375"},"actorId":"nm0005375","character":"Vanessa Struthers","urlCharacter":"http://www.imdb.com/character/ch0009166","main":true},{"actorName":"Lauren Holly","urlProfile":"http://www.imdb.com/name/nm0000452","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMDA0NDcyMl5BMl5BanBnXkFtZTgwNzE2ODkwODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 October 1963","placeOfBirth":" Bristol, Pennsylvania, USA","birthName":"Lauren Michael Holly","height":"5' 5\" (1.65 m)","bio":"Born in Bristol, Pennsylvania, the daughter of two college professors, Lauren grew up in the upstate New York town of Geneva. Her childhood was split between experiences that contrasted. She was privy to the shelter of growing up in a rural town and also exposed due to the erudite sophistication of her parents' academic careers. Lauren spent time traveling in Europe and lived for a year in London, where she studied languages and flute at the famed Sarah Siddons School. A graduate of Sarah Lawrence College in New York, Lauren credits her love of acting to her great-grandmother who bred a family tradition of \"treading the boards\" on the musical theatre stages of Liverpool and London. Lauren's breakthrough motion picture performance came in the New Line Cinema's box-office smash, Dumb & Dumber (1994), with Jim Carrey and Jeff Daniels. Lauren captured the hearts of audiences, as \"Mary Swanson\", the woman who drove Jim Carrey to follow her across the country to pledge his love. Next, she received glowing reviews for her performance in the Edward Burns drama, No Looking Back (1998), as a woman whose life in a small seaside community is turned upside down by the reappearance of her ex-boyfriend. Lauren's other film credits include Oliver Stone's \"Any Given Sunday,\" with Al Pacino, Cameron Diaz and Jamie Fox, Sydney Pollack's \"Sabrina,\" starring Harrison Ford, the action-drama \"Turbulence,\" co-starring Ray Liotta, the Miramax ensemble \"Beautiful Girls,\" a lead role in the Universal production of \"Dragon: The Bruce Lee Story,\" \"A Smile Like Yours,\" \"The Adventures of Ford Fairlane,\" the comedy \"Down Periscope,\" starring Kelsey Grammer, \"Entropy\" and \"The Last Producer,\" starring and directed by Burt Reynolds.In television, Lauren's credits are no less impressive. Lauren recently starred in 2 films for Hallmark. She also boasts three seasons as Director Jenny Shepard in CBS/Paramount Television's top-rated drama series NCIS. Lauren was seen in the TNT movie \"King of Texas,\" an adaptation of Shakespeare's \"King Lear,\" playing opposite Oscar winner Marcia Gay Harden and renowned actor Patrick Stewart, and in the NBC miniseries \"Jackie, Ethel, Joan: Women of Camelot,\" alongside Jill Hennessy and Leslie Stefanson. Additionally, Lauren starred as plastic surgeon Jeremy Hanlon on David E. Kelley's Emmy Award-nominated CBS drama, \"Chicago Hope,\" marking her second project with Kelley, following their successful collaboration on the critically acclaimed, Emmy Award-winning series, \"Picket Fences.\" Lauren has worked on numerous Independent films. These feature films include the political thriller \"Fatwa,\" in which she not only acted but also served as a producer, the Peter Schwaba penned and directed comedy \"Godfather of Green Bay,\" \"The Chumscrubber,\" an Arie Posen directed, independent film to be released by DreamWorks, \"Pleasure Drivers,\" directed by acclaimed cinematographer Andrej Sekula and co-starring Angus McFadden, a Lifetime movie \"Caught in the Act,\" which she also produced, and \"Chasing 3000\". Most recently, Lauren starred in \"You're So Cupid\" with Brian Krause and Jeremy Sumpter. Additional projects contributing to the broad and diverse body of motion picture work Lauren has compiled include the drama \"Colored Eggs\" with Faye Dunaway, the comedy \"Raising Flagg\" playing opposite Oscar winner Alan Arkin, the Darrell Roodt directed HBO thriller, \"Pavement\", co-starring Robert Patrick and Paramount Pictures', and \"What Women Want\" opposite Mel Gibson and Helen Hunt. In addition, Lauren served a lead role in Disney's Oscar winning animated motion picture \"Spirited Away\" as the voice of Chihiro's Mother. Coming up she will play a lead in \"Perfect Age of Rock and Roll,\" produced by Spike Lee. Lauren currently [march, 2014] makes her home in Toronto, Canada with her \"three kings\", sons Alexander, George, and Henry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMDA0NDcyMl5BMl5BanBnXkFtZTgwNzE2ODkwODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000452","name":"Lauren Holly","idIMDB":"nm0000452"},"actorId":"nm0000452","character":"Cindy Rooney","urlCharacter":"http://www.imdb.com/character/ch0009161","main":true},{"actorName":"Ann-Margret","urlProfile":"http://www.imdb.com/name/nm0000268","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMzM1NjMyN15BMl5BanBnXkFtZTYwODg1OTQ2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1941","placeOfBirth":" Valsjöbyn, Jämtlands län, Sweden","birthName":"Ann-Margret Olsson","height":"5' 3½\" (1.61 m)","bio":"Actress and singer Ann-Margret is one of the most famous sex symbols and actresses of the 1960s and beyond. She continued her career through the following decades and into the 21st century. Ann-Margret was born Ann-Margret Olsson in Valsjöbyn, Jämtland County, Sweden, to Anna Regina (Aronsson) and Carl Gustav Olsson, who worked for an electrical company. She came to America at age 6. She studied at Northwestern University and left for Las Vegas to pursue a career as a singer. Ann-Margret was discovered by George Burns and soon afterward got both a record deal at RCA and a film contract at 20th Century Fox. In 1961, her single \"I Just Don't Understand\" charted in the Top 20 of the Billboard Hot 100 Charts. Her acting debut followed the same year as Bette Davis' daughter in Frank Capra's Pocketful of Miracles (1961). She appeared in the musical State Fair (1962) a year later before her breakthrough in 1963. With Bye Bye Birdie (1963) and Viva Las Vegas (1964) opposite Elvis Presley, she became a Top 10 Box Office star, teen idol and even Golden Globe nominated actress. She was marketed as Hollywood's hottest young star and in the years to come got awarded the infamous nickname \"sex kitten.\" Her following pictures were sometimes ripped apart by critics (Bus Riley's Back in Town (1965) and The Swinger (1966)), sometimes praised (The Cincinnati Kid (1965)). She couldn't escape being typecast because of her great looks. By the late 1960s, her career stalled, and she turned to Italy for new projects. She returned and, by 1970, she was back in the public image with Hollywood films (R.P.M. (1970) opposite Anthony Quinn), Las Vegas sing-and-dance shows and her own television specials. She finally overcame her image with her Oscar-nominated turn in Mike Nichols' Carnal Knowledge (1971) and succeeded in changing her image from sex kitten to respected actress. A near-fatal accident at a Lake Tahoe show in 1972 only momentarily stopped her career. She was again Oscar-nominated in 1975 for Tommy (1975), the rock opera film of the British rock band The Who. Her career continued with successful films throughout the late 1970s and into the 1980s. She starred next to Anthony Hopkins in Magic (1978) and appeared in pictures co-starring Walter Matthau, Gene Hackman, Glenda Jackson and Roy Scheider. She even appeared in a television remake of Tennessee Williams's masterpiece play \"A Streetcar Named Desire\" in 1983. Another late career highlight for her was Grumpy Old Men (1993) as the object of desire for Jack Lemmon and Walter Matthau. She continues to act in movies today.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMzM1NjMyN15BMl5BanBnXkFtZTYwODg1OTQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000268","name":"Ann-Margret","nicknames":["Slugger"],"idIMDB":"nm0000268"},"actorId":"nm0000268","character":"Margaret Pagniacci","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aaron Eckhart","urlProfile":"http://www.imdb.com/name/nm0001173","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MTAyNzMzNF5BMl5BanBnXkFtZTcwMzQ5MzQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 March 1968","placeOfBirth":" Cupertino, California, USA","birthName":"Aaron Edward Eckhart","height":"6' (1.83 m)","bio":"Aaron Eckhart was born on March 12, 1968 in Cupertino, California, USA as Aaron Edward Eckhart. He is an actor and producer, known for The Dark Knight (2008), Battle Los Angeles (2011) and Olympus Has Fallen (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MTAyNzMzNF5BMl5BanBnXkFtZTcwMzQ5MzQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001173","name":"Aaron Eckhart","idIMDB":"nm0001173"},"actorId":"nm0001173","character":"Nick Crozier","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0146838","urlIMDB":"http://www.imdb.com/title/tt0146838","business":{"budget":{"money":"$55,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$13,584,625","country":"USA","day":"26","month":"12","year":"1999","remarks":"2,505 Screens"},{"money":"£400,578","country":"UK","day":"02","month":"04","year":"2000","remarks":"237 Screens"}],"gross":[{"money":"$75,530,832","country":"USA","day":"26","month":"03","year":"2000","remarks":""},{"money":"$75,463,929","country":"USA","day":"19","month":"03","year":"2000","remarks":""},{"money":"$75,346,214","country":"USA","day":"12","month":"03","year":"2000","remarks":""},{"money":"$75,168,700","country":"USA","day":"05","month":"03","year":"2000","remarks":""},{"money":"$74,982,297","country":"USA","day":"27","month":"02","year":"2000","remarks":""},{"money":"$74,873,512","country":"USA","day":"20","month":"02","year":"2000","remarks":""},{"money":"$74,554,758","country":"USA","day":"13","month":"02","year":"2000","remarks":""},{"money":"$73,866,223","country":"USA","day":"06","month":"02","year":"2000","remarks":""},{"money":"$72,343,586","country":"USA","day":"30","month":"01","year":"2000","remarks":""},{"money":"$70,175,963","country":"USA","day":"23","month":"01","year":"2000","remarks":""},{"money":"$66,903,873","country":"USA","day":"16","month":"01","year":"2000","remarks":""},{"money":"$59,218,170","country":"USA","day":"09","month":"01","year":"2000","remarks":""},{"money":"$45,752,119","country":"USA","day":"02","month":"01","year":"2000","remarks":""},{"money":"$20,630,471","country":"USA","day":"26","month":"12","year":"1999","remarks":""},{"money":"£1,423,879","country":"UK","day":"23","month":"04","year":"2000","remarks":""},{"money":"£1,036,320","country":"UK","day":"16","month":"04","year":"2000","remarks":""},{"money":"£797,781","country":"UK","day":"09","month":"04","year":"2000","remarks":""},{"money":"£400,578","country":"UK","day":"02","month":"04","year":"2000","remarks":""}],"weekendGross":[{"money":"$41,788","country":"USA","day":"26","month":"03","year":"2000","remarks":"122 Screens"},{"money":"$72,687","country":"USA","day":"19","month":"03","year":"2000","remarks":"237 Screens"},{"money":"$114,201","country":"USA","day":"12","month":"03","year":"2000","remarks":"368 Screens"},{"money":"$162,031","country":"USA","day":"05","month":"03","year":"2000","remarks":"509 Screens"},{"money":"$77,687","country":"USA","day":"27","month":"02","year":"2000","remarks":"245 Screens"},{"money":"$168,909","country":"USA","day":"20","month":"02","year":"2000","remarks":"375 Screens"},{"money":"$443,628","country":"USA","day":"13","month":"02","year":"2000","remarks":"1,031 Screens"},{"money":"$1,020,667","country":"USA","day":"06","month":"02","year":"2000","remarks":"1,557 Screens"},{"money":"$1,437,548","country":"USA","day":"30","month":"01","year":"2000","remarks":"2,012 Screens"},{"money":"$2,415,309","country":"USA","day":"23","month":"01","year":"2000","remarks":"2,201 Screens"},{"money":"$5,494,572","country":"USA","day":"16","month":"01","year":"2000","remarks":"2,505 Screens"},{"money":"$8,779,880","country":"USA","day":"09","month":"01","year":"2000","remarks":"2,505 Screens"},{"money":"$11,658,852","country":"USA","day":"02","month":"01","year":"2000","remarks":"2,505 Screens"},{"money":"$13,584,625","country":"USA","day":"26","month":"12","year":"1999","remarks":"2,505 Screens"},{"money":"£113,300","country":"UK","day":"16","month":"04","year":"2000","remarks":"149 Screens"},{"money":"£201,639","country":"UK","day":"09","month":"04","year":"2000","remarks":"236 Screens"},{"money":"£400,578","country":"UK","day":"02","month":"04","year":"2000","remarks":"237 Screens"}],"admissions":[{"money":"47,839","country":"Netherlands","day":"31","month":"12","year":"2001","remarks":""},{"money":"47,808","country":"Netherlands","day":"31","month":"12","year":"2000","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"25","month":"01","year":"1999","remarks":null},{"money":null,"country":null,"day":"17","month":"04","year":"1999","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["2 hr 42 min (162 min)","2 hr 36 min (156 min) (director's cut) (USA)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color (Technicolor)"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"6.8","metascore":"52","filmingLocations":[{"location":"Joe Robbie Stadium - 2269 NW 199th Street, Miami, Florida, USA"}],"rated":"R","awards":[{"award":"ALMA Awards 2000","titlesAwards":[{"titleAwardOutcome":"Won ALMA Award","categories":[{"category":"Outstanding Actress in a Feature Film","names":[{"name":"Cameron Diaz","id":"nm0000139","role":null}]}]}]},{"award":"Berlin International Film Festival 2000","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Berlin Bear","categories":[{"category":"","names":[{"name":"Oliver Stone","id":"nm0000231","role":null}]}]}]},{"award":"Black Reel Awards 2000","titlesAwards":[{"titleAwardOutcome":"Nominated Black Reel","categories":[{"category":"Theatrical - Best Supporting Actor","names":[{"name":"Jamie Foxx","id":"nm0004937","role":null}]}]}]},{"award":"Blockbuster Entertainment Awards 2000","titlesAwards":[{"titleAwardOutcome":"Won Blockbuster Entertainment Award","categories":[{"category":"Favorite Actress - Drama","names":[{"name":"Cameron Diaz","id":"nm0000139","role":null}]}]},{"titleAwardOutcome":"Nominated Blockbuster Entertainment Award","categories":[{"category":"Favorite Actor - Drama","names":[{"name":"Al Pacino","id":"nm0000199","role":null}]},{"category":"Favorite Supporting Actor - Drama","names":[{"name":"Jamie Foxx","id":"nm0004937","role":null}]}]}]},{"award":"BMI Film & TV Awards 2000","titlesAwards":[{"titleAwardOutcome":"Won BMI Film Music Award","categories":[{"category":"","names":[{"name":"Richard Horowitz","id":"nm0003281","role":null}]}]}]},{"award":"Cinema Audio Society, USA 2000","titlesAwards":[{"titleAwardOutcome":"Nominated C.A.S. Award","categories":[{"category":"Outstanding Achievement in Sound Mixing for a Feature Film","names":[{"name":"Patrick Cyccone Jr.","id":"nm0194195","role":"re-recording mixer"},{"name":"Michael Keller","id":"nm0445728","role":"re-recording mixer"},{"name":"Tom Fleischman","id":"nm0281530","role":"re-recording mixer"},{"name":"Peter J. Devlin","id":"nm0222818","role":"production mixer"}]}]}]},{"award":"Motion Picture Sound Editors, USA 2000","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing - Music (Foreign &amp; Domestic)","names":[{"name":"Bill Abbott","id":"nm0007935","role":"music/scoring editor"},{"name":"Denise Okimoto","id":"nm0645643","role":"music editor"},{"name":"Johnny Caruso","id":"nm0142310","role":"music/scoring editor"}]}]}]},{"award":"MTV Movie Awards 2000","titlesAwards":[{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Breakthrough Male Performance","names":[{"name":"Jamie Foxx","id":"nm0004937","role":null}]}]}]},{"award":"New York Film Critics Circle Awards 1999","titlesAwards":[{"titleAwardOutcome":"2nd place NYFCC Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Jamie Foxx","id":"nm0004937","role":null}]}]}]},{"award":"Teen Choice Awards 2000","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Film - Choice Hissy Fit","names":[{"name":"Cameron Diaz","id":"nm0000139","role":null}]}]}]}],"votes":"100,023","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."},{"idCompany":"co0119040","name":"Ixtlan"},{"idCompany":"co0001946","name":"Donners' Company"}],"keywords":{"keywords":["football","coach","trippy","in medias res","vomiting","breasts","pubic hair","male pubic hair","cd","quarrel between couple","snorting cocaine off a woman's breast","snorting cocaine","fellatio","oral sex","slow motion scene","telephoto lens","film camera","sports photographer","three word title","bar","solicitation","indecent proposal","propositioned for sex","alcohol","football movie","men's locker room","jock strap","male full frontal nudity","male rear nudity","bare chested male","critique of capitalism","drunkenness","drug abuse","bravery","prostitute","prostitution","race relations","ignorance","eye injury","bickering","bare butt","spit in the face","female slaps male","cocaine","vulgarity","self destructiveness","sports team","day in title","female nudity","title based on song","prescription drug abuse","male nudity","marriage","party girl","football team","american football","television","teamwork","success","corruption","institutional discrimination","eyeball","ensemble cast","injury","glamour","slap","professional sports","team play","egotism","medical ethics","ambition","journalism","violence","male frontal nudity","locker room","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:33:16"}}