{"data":{"movies":[{"title":"Guns and Lipstick","originalTitle":"","year":"1995","releaseDate":"19970827","directors":[{"name":"Jenö Hodi","id":"nm0388302"}],"writers":[{"name":"Jenö Hodi","id":"nm0388302"},{"name":"Greg Lewis","id":"nm0507239"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMTA0MTY4Ml5BMl5BanBnXkFtZTcwMDA0OTcxMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama"],"plot":"A female private investigator's latest client turns up murdered, and she is thrust into a deadly underworld of bi-sexual strippers, a Chinese Godfather with a taste for young girls and the hunt for one very elusive gem.","simplePlot":"A female private investigator's latest client turns up murdered, and she is thrust into a deadly underworld of bi-sexual strippers, a Chinese Godfather with a taste for young girls and the ... ","actors":[{"actorName":"Sally Kirkland","urlProfile":"http://www.imdb.com/name/nm0000476","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MDQ5MDEyNF5BMl5BanBnXkFtZTgwNzg4NTcxNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1941","placeOfBirth":" New York City, New York, USA","height":"5' 9\" (1.75 m)","bio":"Sally Kirkland, BEST Actress Oscar Nominee, Golden Globe winner, Independent Spirit Award winner and veteran of over 200 films. Feisty, hard-working, famously liberal, with the trademark blonde hair, actress Sally Kirkland has certainly made an indelible mark on Hollywood history. Born in New York City, her mother was the fashion editor at Vogue and LIFE magazine. Sally began her career on the off-Broadway circuit and trained under 'Lee Strasberg'. Sally Kirkland is a film, TV, and theater veteran since the 1960's and is probably best known for the film \"Anna,\" for which she garnered a Best Actress Oscar nomination and won the Best Actress Golden Globe, the Independent Spirit Award, and the LA Film Critic's Circle Award. Sally's first director in 1964 was Andy Warhol in \"13 Most Beautiful Women.\" Her 200 films also include: \"The Sting,\" \"The Way We Were,\" \"Coming Apart,\" \"Cold Feet,\" \"Best of the Best,\" \"Revenge,\" \"JFK,\" \"ED TV,\" \"Bruce Almighty\", \"Coffee Date\" and \"Archaeology of a Woman\". Her new films will include \"Buddy Solitaire\", \"Gnaw\" and \"The Most Hated Woman in America\" co-starring with Melissa Leo and Peter Fonda coming to Netflix. She was nominated for Best Actress in a TV movie by the Hollywood Foreign Press for \"The Haunted- A True Story.\" Her television credits include: guest starring on \"Criminal Minds,\" recurring on \"Head Case\" and \"the Simple Life.\" She guest starred on \"Resurrection Blvd,\" and in the TV movie, \"Another Woman's Husband.\" Sally had a recurring role on \"Felicity\" and \"Wasteland.\" She starred on the NBC movie, \"Brave New World.\" She starred in the TV movie, \"Song of Songs\"and was a series regular on the TV show \"Valley of the Dolls.\" She also starred in the TV movie, \"The Woman Who Loved Elvis.\" She played Barbara Healy on \"Roseanne.\" She starred in the TV movie, \"Heatwave\" and recurred as Tracy on \"Days of Our Lives.\" Sally is also an exhibited painter, poet, renowned acting coach and ordained minister.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MDQ5MDEyNF5BMl5BanBnXkFtZTgwNzg4NTcxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000476","name":"Sally Kirkland","idIMDB":"nm0000476"},"actorId":"nm0000476","character":"Danielle Roberts","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Evan Lurie","urlProfile":"http://www.imdb.com/name/nm0527093","urlPhoto":"","biography":{"dateOfBirth":"28 September 1954","placeOfBirth":" Worcester, Massachusetts, USA","bio":"Evan Lurie was born on September 28, 1954 in Worcester, Massachusetts, USA. He is an actor and writer, known for Hologram Man (1995), T-Force (1994) and Double Impact (1991).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0527093","name":"Evan Lurie","idIMDB":"nm0527093"},"actorId":"nm0527093","character":"Andy Harris","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wings Hauser","urlProfile":"http://www.imdb.com/name/nm0369567","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4OTQ4Nzk4OV5BMl5BanBnXkFtZTcwMjM1MTE3NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1947","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Gerald Dwight Hauser","height":"6' 2\" (1.88 m)","bio":"Wings Hauser married his young music and filmmaking partner, actress/filmmaker Cali Lili Hauser on June 12, 2012. Having often been compared to Richard Widmark for some of his \"mean\" roles, he has played a variety of equally remarkable roles in films and on TV. After a high-school career centered in sports (his name \"Wings\" is taken from the wing-back position he played in football), he chose to lean toward the arts - acting and music (including an album of his original music for RCA) - instead of pursuing professional sports. Having descended from an artistic and talented family, this choice was a heartfelt one. Wings is the son of writer/producer/actor Dwight Hauser, who worked on (amongst many other projects) the classic \"Whistler\" radio series. Son of the beautiful Geraldine Hauser, (who was the daughter of author Tom Thienes - \"Whimseys\" and others). He raised a child as a single father, having arrived in Hollywood \"with thirty dollars and a box of pampers\" - and actually earned his career accomplishments with hard work and dedication. Father of actor Cole Hauser.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4OTQ4Nzk4OV5BMl5BanBnXkFtZTcwMjM1MTE3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0369567","name":"Wings Hauser","idIMDB":"nm0369567"},"actorId":"nm0369567","character":"Michael","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Forster","urlProfile":"http://www.imdb.com/name/nm0001233","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYyNzczNDk0N15BMl5BanBnXkFtZTcwNzM4ODQ2NA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 July 1941","placeOfBirth":" Rochester, New York, USA","birthName":"Robert Foster","height":"5' 9½\" (1.77 m)","bio":"Robert Forster was born Robert Wallace Foster, Jr. in Rochester, New York, to Grace Dorothy (Montanarella) and Robert Wallace Foster, Sr., who worked as an elephant trainer and baking supply company executive. He is of English, Irish, and Italian descent. Forster first become interested in acting while attending Rochester's Madison High School, where he performed as a song-and-dance man in musical revues. After graduating in 1959, Forster attended Heidelberg College, Alfred University and the University of Rochester on football scholarships and continued to perform in student theatrical revues. After earning a BA in Psychology from Rochester in 1963, Forster took an apprenticeship at an East Rochester theater where he performed in such plays as \"West Side Story\". He moved to New York City in 1965, where his first big break came when he landed the lead in the two-character play \"Mrs. Dally Has a Lover\" opposite Arlene Francis. However, after the play ran its course work was hard to find in the theater. Forster returned to Rochester, where he worked as a substitute teacher and construction worker until an agent from 20th Century-Fox offered him a five-picture deal. His movie debut was a small part in the drama Reflections in a Golden Eye (1967), which starred Elizabeth Taylor and Marlon Brando. Forster went on to appear in small and minor roles alongside some top Hollywood actors in films like The Stalking Moon (1968) and Medium Cool (1969), and a large part in Justine (1969). Although he continued to act in feature films, he took the part of a hardboiled detective in the short-lived TV series Banyon (1971) Forster also appeared in notable parts in The Black Hole (1979), Avalanche (1978) and as the lead in the cult horror flick Alligator (1980), and played the part of a factory worker-turned-vigilante in the thriller Vigilante (1983). Forster also took the lead as a taxi driver in Walking the Edge (1985) by director Norbert Meisel. A series of action flicks followed, the most notable being The Delta Force (1986), starring Chuck Norris. By the late 1980s Forster's acting career had begun to slide, and he was getting less and less work; if there was any, he would be cast in small parts playing villains. Forster then began to work as a motivational speaker and an acting coach in Hollywood film schools. However, in the mid-'90s, Forster's career was resurrected by writer-director Quentin Tarantino, a big fan of Forster's early work, who offered him an audition for a part in his latest movie. After a seven-hour audition, Tarantino cast Forster in the role of the tough but sympathetic bail bondsman Max Cherry in Jackie Brown (1997), which netted him an Academy Award nomination and some nationwide recognition. His success landed him more high-profile starring roles, in such films as All the Rage (1999), Gus Van Sant's Psycho (1998)--a remake of Alfred Hitchcock's 1960 film--and Supernova (2000). Forster continues to act in many big-budget Hollywood productions, playing many charming characters who often steal the scene.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYyNzczNDk0N15BMl5BanBnXkFtZTcwNzM4ODQ2NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001233","name":"Robert Forster","nicknames":["Bob"],"idIMDB":"nm0001233"},"actorId":"nm0001233","character":"Captain Dimaggio","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Hong","urlProfile":"http://www.imdb.com/name/nm0393222","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0MTQxOTA4MF5BMl5BanBnXkFtZTgwODE1OTcyMjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1929","placeOfBirth":" Minneapolis, Minnesota, USA","height":"5' 10\" (1.78 m)","bio":"James Hong was born in Minneapolis, Minnesota, USA. He studied civil engineering at the University of Minnesota, but at some point along the way became interested in acting. He graduated from the University of Southern California and practiced for 1½ years as a road engineer with the County of Los Angeles. He took sick leaves and vacation time to do films. He finally quit engineering to focus on acting full time. He is one of the founders of the East-West Players, the oldest Asian American theater in Los Angeles. He served as president and charter member of the Association of Asian Pacific American Artists. Hong is one of the most prolific and well-recognized Asian-American character actors of movies and television. He currently lives in Los Angeles and is planning to produce and direct his own films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0MTQxOTA4MF5BMl5BanBnXkFtZTgwODE1OTcyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0393222","name":"James Hong","nicknames":["Jimmy"],"idIMDB":"nm0393222"},"actorId":"nm0393222","character":"Mr. Song","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jorge Rivero","urlProfile":"http://www.imdb.com/name/nm0729473","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY0MzE3YTctZjZmMi00MTVkLTg3YzEtODBiYjYyMDY1N2M2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 June 1938","placeOfBirth":" Mexico City, Distrito Federal, Mexico","birthName":"Jorge Pous Ribe","height":"6' 1½\" (1.87 m)","bio":"Very handsome and muscular Mexican leading man of Spanish origin, on-screen from the mid-1960s. Ironically, in his debut film he played a masked wrestler and his face was never shown. Rivero soon became a sex symbol and a major box-office star, and was called by Hollywood to star with John Wayne in Howard Hawks's Rio Lobo (1970). Since the 1980s he has worked only occasionally in Mexican films and soap operas -- he has lived in Southern California for more than a decade -- but shows up in international productions, sometimes billed as \"George Rivero.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY0MzE3YTctZjZmMi00MTVkLTg3YzEtODBiYjYyMDY1N2M2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0729473","name":"Jorge Rivero","idIMDB":"nm0729473"},"actorId":"nm0729473","character":"Brunner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Hallick","urlProfile":"http://www.imdb.com/name/nm0356535","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMzQxOTQwNl5BMl5BanBnXkFtZTYwNTkxNTQ1._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1941","placeOfBirth":" Buffalo, New York, USA","height":"6' 1\" (1.85 m)","bio":"Tom Hallick was born on June 13, 1941 in Buffalo, New York, USA. He is an actor, known for Gangster Squad (2013), Days of Our Lives (1965) and My Favorite Martian (1999). He has been married to Nadine since 2004. He was previously married to Pam Crawford.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMzQxOTQwNl5BMl5BanBnXkFtZTYwNTkxNTQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0356535","name":"Tom Hallick","idIMDB":"nm0356535"},"actorId":"nm0356535","character":"Alex Themopolis, Lawyer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Greg Lewis","urlProfile":"http://www.imdb.com/name/nm0507239","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGMyZjlkYmMtNTJhNS00OGNjLWE3MmQtM2RlNmRhNDdmNjY4XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"bio":"Greg Lewis is an actor and writer, known for K-PAX (2001), Frankie and Johnny (1991) and The Princess Diaries (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGMyZjlkYmMtNTJhNS00OGNjLWE3MmQtM2RlNmRhNDdmNjY4XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0507239","name":"Greg Lewis","idIMDB":"nm0507239"},"actorId":"nm0507239","character":"Pete","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sonny Landham","urlProfile":"http://www.imdb.com/name/nm0484739","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNzkyNzkzNV5BMl5BanBnXkFtZTYwMjg3MDc2._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 February 1941","placeOfBirth":" Canton, Georgia, USA","birthName":"William Landham","height":"6' 1½\" (1.87 m)","bio":"An actor with a powerful physique, booming voice and who has played several \"Native American\" characters, Sonny Landham first broke into mainstream film with a bit part as a police officer in Walter Hill's gang film The Warriors (1979), then other minor roles in Southern Comfort (1981) & Poltergeist (1982), before Walter Hill cast him in his first decent role as James Remar's gun happy, criminal partner in the high voltage hit 48 Hrs. (1982). Landham continued to turn up in high testosterone films of the mid 1980s including the action sci-fi film Predator (1987), alongside Sylvester Stallone in Lock Up (1989), and being hurled out a window by Carl Weathers in Action Jackson (1988). His career on screen wound down during the 1990s, but he still managed to crop up in several roles taking advantage of his strong physical presence.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNzkyNzkzNV5BMl5BanBnXkFtZTYwMjg3MDc2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0484739","name":"Sonny Landham","idIMDB":"nm0484739"},"actorId":"nm0484739","character":"Albino","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bobbie Phillips","urlProfile":"http://www.imdb.com/name/nm0004095","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTJkMmVkZTAtMDczNi00ZjQwLWE4NmMtMjYyNzQ1MTcwOTRjXkEyXkFqcGdeQXVyNDU3MTc5MjI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 1968","placeOfBirth":" Charleston, South Carolina, USA","birthName":"Bobbie J. Phillips","bio":"Bobbie Phillips is an actress, animal advocate, and a true Chameleon (1998); both on screen and off. Bobbie has portrayed a variety of characters in various genres throughout her career. Perhaps most widely recognized for her award winning role as sexy entomologist, Dr. Bambi Berenbaum on The X-Files: War of the Coprophages (1996); Phillips also received industry praise for her turn as Julie Costello on Steven Bochco's Murder One (1995); A genre favorite as the first female crow, \"Talon\", on The Crow (1998); Phillips left Hollywood in 2003 when she and her husband designed and built an award winning hotel and celebrity escape in Costa Rica. Bobbie returned to acting in 2014 based out of Toronto, Canada. Bobbie Phillips continues to create in her unique style on diverse projects and she always reinvents herself like a great actress should.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTJkMmVkZTAtMDczNi00ZjQwLWE4NmMtMjYyNzQ1MTcwOTRjXkEyXkFqcGdeQXVyNDU3MTc5MjI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004095","name":"Bobbie Phillips","idIMDB":"nm0004095"},"actorId":"nm0004095","character":"Felicia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Benedict","urlProfile":"http://www.imdb.com/name/nm0070801","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NzA0NjgwMl5BMl5BanBnXkFtZTcwNDczMTkyNA@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 September 1938","placeOfBirth":" Silver City, New Mexico, USA","height":"6' 4\" (1.93 m)","bio":"Paul Benedict was born on September 17, 1938 in Silver City, New Mexico, USA. He was an actor and director, known for The Jeffersons (1975), Guiding Light (1952) and The Addams Family (1991). He died on December 1, 2008 in Martha's Vineyard, Massachusetts, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NzA0NjgwMl5BMl5BanBnXkFtZTcwNDczMTkyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0070801","name":"Paul Benedict","idIMDB":"nm0070801"},"actorId":"nm0070801","character":"Mickey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ron Gilbert","urlProfile":"http://www.imdb.com/name/nm0003003","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTlmMjlhZTktNTFkZS00MGZhLTkyZWMtNjIyYWZkZGMxMjg0XkEyXkFqcGdeQXVyMTcxNDMwOTg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Ronald Franklyn Goldstein","height":"6' 0½\" (1.84 m)","bio":"Ron Gilbert's dad was a Russian Jew who migrated to the USA in 1919. His mom was a first generation Italian American. He was born in East Harlem (104 Street and 1st Avenue)in Manhattan and attended St Lucy's Parochial School where he was an altar boy. He attended Cardinal Hayes High School in the Bronx where he excelled in Track and football. After that had a scholarship to CCNY, where he boxed and wrestled.US Army heavyweight boxing champion in Fort Jackson,South Carolina He was always interested in acting and after his stint in US Army, he attended the American Academy of Dramatic Arts in New York City. After that he studied with Lee Strasberg is a lifetime member at the Actors Studio. He was married to Catherine Dickhaus for 3 years and has 2 children, Adam Frank and Lauren Snow. He has one other daughter Lea Norin, He also has 4 grandchildren Chase and Enzo (Adam's children) and Jack Snow and Alice(Lauren Snow's children). His son Adam who died in 2005 from a head injury He works out at Muscle Beach in Venice and usually rides his bike or motorcycle there.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTlmMjlhZTktNTFkZS00MGZhLTkyZWMtNjIyYWZkZGMxMjg0XkEyXkFqcGdeQXVyMTcxNDMwOTg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003003","name":"Ron Gilbert","nicknames":["Snooky"],"idIMDB":"nm0003003"},"actorId":"nm0003003","character":"Walker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe Estevez","urlProfile":"http://www.imdb.com/name/nm0261724","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyOTkzODk4Ml5BMl5BanBnXkFtZTcwODM2NDcyMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1946","placeOfBirth":" Dayton, Ohio, USA","birthName":"Joseph Estevez","height":"5' 7\" (1.7 m)","bio":"Joe Estevez' first time on the stage was as a 6-year-old playing the \"Evil Inn Keeper\" in a Christmas Nativity play, and as an actor he has never looked back. Born the last of ten children to an Irish immigrant mother and a Spanish immigrant father, Joe was raised in Dayton Ohio to be a factory worker but he had other plans for himself, and two hundred and thirty some films later Joe feels his decision was correct. For most actors the road is never easy, but through perseverance, faith and talent Joe has become an accomplished actor, and in Hollywood today he is one of the busiest actors for one reason: He is one of the best at what he does. Joe can be seen weekly on the T.V. series \"Hollywood Joe\" and as the host of the critically acclaimed Faith Film Festival in N.Y.C. And if you want to read about Joe, pick up a copy of his book \"Wiping off the Sheen\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyOTkzODk4Ml5BMl5BanBnXkFtZTcwODM2NDcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0261724","name":"Joe Estevez","idIMDB":"nm0261724"},"actorId":"nm0261724","character":"Sanders","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Amos","urlProfile":"http://www.imdb.com/name/nm0025293","urlPhoto":"","biography":{"dateOfBirth":"15 December 1958","placeOfBirth":" UK","birthName":"David Paul Amos","bio":"David Amos was born on December 15, 1958 in the UK as David Paul Amos. He is an actor and producer, known for Flipping (1997), Dancing at the Blue Iguana (2000) and The Takeover (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0025293","name":"David Amos","nicknames":["English Dave"],"idIMDB":"nm0025293"},"actorId":"nm0025293","character":"Evans","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cassie Yates","urlProfile":"http://www.imdb.com/name/nm0946720","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNTEzODI2MV5BMl5BanBnXkFtZTgwNjg5NTU1MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 March 1951","placeOfBirth":" Macon, Georgia, USA","bio":"Cassie Yates was born on March 2, 1951 in Macon, Georgia, USA. She is an actress, known for Convoy (1978), F.I.S.T. (1978) and The Osterman Weekend (1983).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNTEzODI2MV5BMl5BanBnXkFtZTgwNjg5NTU1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0946720","name":"Cassie Yates","idIMDB":"nm0946720"},"actorId":"nm0946720","character":"Shirley","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0155733","urlIMDB":"http://www.imdb.com/title/tt0155733","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 36 min (96 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"4.2","filmingLocations":[],"awards":[],"votes":"60","type":"Movie","companyCreditsSimple":[],"keywords":{"keywords":["stripper","prostitute","lesbianism","female nudity","villainess","strip club","private eye","private detective","nudity","murder","female detective","crime lord","bartender","based on novel","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:12:42"}}