{"data":{"movies":[{"title":"Houdini","originalTitle":"","year":"1998","releaseDate":"19981206","directors":[{"name":"Pen Densham","id":"nm0219720"}],"writers":[{"name":"Pen Densham","id":"nm0219720"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjAyODc3N15BMl5BanBnXkFtZTcwNDMxMDEzMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Biography","Drama","Romance"],"plot":"This biographical film tells the story of Harry Houdini, from his birth and immigration to the U.S., through his career in show business as first an escape artist and then a seance debunker, and finally his tragic death. We also see his relationship with wife Bess.","simplePlot":"The life and times of escape artist/magician Harry Houdini.","actors":[{"actorName":"Johnathon Schaech","urlProfile":"http://www.imdb.com/name/nm0000628","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NDY2NjkwNV5BMl5BanBnXkFtZTcwMjUwODIwNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1969","placeOfBirth":" Edgewood, Maryland, USA","height":"5' 11\" (1.8 m)","bio":"Johnathon Schaech was born on September 10, 1969 in Edgewood, Maryland, USA. He is an actor and writer, known for That Thing You Do! (1996), Legends of Tomorrow (2016) and Prom Night (2008). He has been married to Julie Solomon since July 24, 2013. They have one child. He was previously married to Jana Kramer and Christina Applegate.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NDY2NjkwNV5BMl5BanBnXkFtZTcwMjUwODIwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000628","name":"Johnathon Schaech","idIMDB":"nm0000628"},"actorId":"nm0000628","character":"Harry Houdini","urlCharacter":"http://www.imdb.com/character/ch0034364","main":true},{"actorName":"Stacy Edwards","urlProfile":"http://www.imdb.com/name/nm0250368","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MjQ1MDg0OV5BMl5BanBnXkFtZTcwMzMxMTUwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1965","placeOfBirth":" Glasgow, Montana, USA","bio":"Edwards was born in Glasgow, Montana, the daughter of an Air Force officer, and grew up all over the world, from Guam to Alabama. At 18, she received a scholarship to the Lou Conte Dance Studio in Chicago and began her performance career as a dancer and actress.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MjQ1MDg0OV5BMl5BanBnXkFtZTcwMzMxMTUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0250368","name":"Stacy Edwards","idIMDB":"nm0250368"},"actorId":"nm0250368","character":"Bess Houdini","urlCharacter":"http://www.imdb.com/character/ch0299362","main":true},{"actorName":"Paul Sorvino","urlProfile":"http://www.imdb.com/name/nm0000649","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNjkyMjk1OV5BMl5BanBnXkFtZTYwNjE1NjQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 April 1939","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"6' 2½\" (1.89 m)","bio":"Tall, dark and imposing American actor Paul Sorvino has made a solid career of portraying authority figures. He was born in Brooklyn, New York City. His mother, Angela (Renzi), was a piano teacher, of Italian descent. His father, Ford Sorvino, was an Italian immigrant who worked in a robe factory as a foreman. Paul originally had his heart set on a life as an opera singer. He was exposed to dramatic arts while studying at the American Musical and Dramatic Academy in New York. He furthered his studies with Sanford Meisner and eventually made his film debut in Where's Poppa? (1970). Sorvino suffered from severe asthma, and worked hard at mastering various breathing techniques to manage the illness. He wrote a best-selling book entitled \"How to Become a Former Asthmatic\". He also started the Sorvino Asthma Foundation based in New York City. Sorvino has appeared in a variety of film, TV and theatrical productions over the the last four decades. He received critical praise for his role in the Broadway play \"That Championship Season\", and played the role again in the 1981 film alongside Robert Mitchum and Martin Sheen. Other noteworthy performances during the 1980s and 1990s included a stressed-out police chief in Cruising - La Chasse (1980), Mike Hammer's cop buddy in I, the Jury (1982), \"Lips Manlis\" in Dick Tracy (1990) with James Caan and in a standout performance as mob patriarch \"Paul Cicero\" in the powerhouse Goodfellas (1990). Always keeping himself busy, Sorvino has performed in nearly 50 movies just in the past decade, including a dynamic and under-appreciated portrayal of Henry Kissinger in Nixon (1995), as \"Fulgencio Capulet\" in the updated Romeo + Juliet (1996) and in the Las Vegas thriller The Cooler (2003). Sorvino is the proud father of Academy Award-winning actress Mira Sorvino.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNjkyMjk1OV5BMl5BanBnXkFtZTYwNjE1NjQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000649","name":"Paul Sorvino","idIMDB":"nm0000649"},"actorId":"nm0000649","character":"Blackburn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rhea Perlman","urlProfile":"http://www.imdb.com/name/nm0674231","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDcxMDMwNV5BMl5BanBnXkFtZTYwNzAzNzE2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 March 1948","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Rhea Jo Perlman","height":"5' (1.52 m)","bio":"Rhea Perlman was born on March 31, 1948 in Brooklyn, New York City, New York, USA as Rhea Jo Perlman. She is an actress and producer, known for Cheers (1982), Matilda (1996) and The Sessions (2012). She has been married to Danny DeVito since January 28, 1982. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDcxMDMwNV5BMl5BanBnXkFtZTYwNzAzNzE2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0674231","name":"Rhea Perlman","idIMDB":"nm0674231"},"actorId":"nm0674231","character":"Esther","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Warner","urlProfile":"http://www.imdb.com/name/nm0001831","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMzg2Nzg1MjheQTJeQWpwZ15BbWU3MDk4Nzg0Mzg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1941","placeOfBirth":" Manchester, England, UK","height":"6' 2\" (1.88 m)","bio":"David Hattersley Warner was born July 29, 1941 in Manchester, England, to Ada Doreen (Hattersley) and Herbert Simon Warner. He has described his childhood as \"messy\". His father changed jobs often and moved from town to town. David attended eight schools and \"failed his exams at all of them\". His parents separated when he was a teenager and he only saw his mother again seven years later - on her deathbed. After a series of odd jobs, he was accepted at the Royal Academy of Dramatic Arts (RADA) where he was very unhappy. After RADA, he became a member of the Royal Shakespeare Company and got the part of Blifil in Tom Jones (1963). With the title role in Morgan! (1966) and a two-year stint as Hamlet with the RSC, Warner became a star at age 24. He has often played villains in such films as The Thirty-Nine Steps (1978), Time After Time (1979), Time Bandits (1981), TRON (1982) and Titanic (1997). He also appeared in Star Trek V: The Final Frontier (1989) and Star Trek VI: The Undiscovered Country (1991), two sequels to the popular Star Trek films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMzg2Nzg1MjheQTJeQWpwZ15BbWU3MDk4Nzg0Mzg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001831","name":"David Warner","idIMDB":"nm0001831"},"actorId":"nm0001831","character":"Sir Arthur Conan Doyle","urlCharacter":"http://www.imdb.com/character/ch0044825","main":true},{"actorName":"Mark Ruffalo","urlProfile":"http://www.imdb.com/name/nm0749263","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQyNzMzZTMtYjlkNS00YzFhLWFhMTctY2M4YmQ1NmRhODBkXkEyXkFqcGdeQXVyNjcyNzgyOTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1967","placeOfBirth":" Kenosha, Wisconsin, USA","birthName":"Mark Alan Ruffalo","height":"5' 8\" (1.73 m)","bio":"Mark Ruffalo was born in Kenosha, Wisconsin, to Marie Rose (Hebert), a stylist and hairdresser, and Frank Lawrence Ruffalo, a construction painter. His father's ancestry is Italian, and his mother is of half French-Canadian and half Italian descent. Mark moved with his family to Virginia Beach, Virginia, where he lived out most of his teenage years. Following high school, Mark moved with his family to San Diego and soon migrated north, eventually settling in Los Angeles. He took classes at the Stella Adler Conservatory and subsequently co-founded the Orpheus Theatre Company, an Equity-Waiver establishment, where he worked in nearly every capacity. From acting, writing, directing and producing to running the lights and building sets while building his resume. Bartending for nearly nine years to make ends meet and ready to give it all up, a chance meeting and resulting collaboration with playwright/screenwriter Kenneth Lonergan changed everything. Ruffalo won NY success in Lonergan's play \"This Is Our Youth\", which led to the male lead in Lonergan's film You Can Count on Me (2000), playing the ne'er-do-well brother of Laura Linney. The performance drew rave reviews and invited comparisons to an early Marlon Brando. Notable roles in The Last Castle (2001), XX/XY (2002), and Windtalkers (2002) followed, although in 2002 Ruffalo was diagnosed with an acoustic neuroma, a type of brain tumor. Though the tumor was benign, the resulting surgery led to a period of partial facial paralysis, from which he fully recovered. In 2003, Ruffalo scored leading roles alongside two popular female stars, playing a police detective opposite Meg Ryan in In the Cut (2003) and the love interest of Gwyneth Paltrow in the comedy View from the Top (2003). Though both films were high-profile box office disappointments, Ruffalo went on to four notable (if highly disparate) films in 2004 - We Don't Live Here Anymore (2004), Eternal Sunshine of the Spotless Mind (2004), 13 Going on 30 (2004), and Collateral (2004) - which solidified his ability to be both a popular leading man and an acclaimed ensemble player in either comedy or drama. After 2004, Ruffalo was consistently at work, with leads in popular Hollywood films and independent productions that continued to solidify him as one of film's most consistently strong actors: Just Like Heaven (2005), Les fous du roi (2006), Zodiac (2007), Reservation Road (2007), and The Brothers Bloom (2008). In 2010 Ruffalo achieved something of a breakthrough, by directing the indie film Sympathy for Delicious (2010), which won him the Special Jury Prize at the Sundance Film Festival, and co-starring as the sperm-donor father to lesbian couple Annette Bening and Julianne Moore in The Kids Are All Right (2010). His role in the idiosyncratic domestic comedy/drama earned him Academy Award, Independent Spirit Award, Screen Actors Guild, and BAFTA nominations for Best Supporting Actor. High-profile roles in Martin Scorsese's Shutter Island (2010) and 'Kenneth Longeran''s long-delayed Margaret (2011) followed before Ruffalo's appearance as Dr. Bruce Banner, aka The Hulk, in Joss Whedon's blockbuster The Avengers (2012). Garnering highly positive reviews for a role in which actors Eric Bana and Edward Norton could not find success in previous films made Ruffalo a box office star in addition to a critically-acclaimed actor. He is expected to reprise the role in the upcoming 2015 sequel, and reunited with former co-star Gywneth Paltrow in the sex-addiction comedy-drama Thanks for Sharing (2012); Ruffalo also will take the lead in Ryan Murphy's adaptation of Larry Kramer's AIDS-drama play The Normal Heart (2014). Ruffalo has been married to actress Sunrise Coigney since 2000; the couple have three children, a son and two daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MjMwNjAzNF5BMl5BanBnXkFtZTcwMzkyNDg1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0749263","name":"Mark Ruffalo","idIMDB":"nm0749263"},"actorId":"nm0749263","character":"Theo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Grace Zabriskie","urlProfile":"http://www.imdb.com/name/nm0951471","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MzI4ODkyOF5BMl5BanBnXkFtZTgwMTc5NDIzNTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 May 1941","placeOfBirth":" New Orleans, Louisiana, USA","birthName":"Grace Zabriskie Caplinger","height":"5' 4\" (1.63 m)","bio":"\"Amazing Grace\" Zabriskie was born in New Orleans, Louisiana. She wrote her own original poetry, then performed at coffee shops and various artist hangouts in Atlanta. She was also a wonderful silk-screen printmaker. She moved to Hollywood and made her acting debut in Norma Rae (1979). She went on to appear in over 80 movies. She gave an acclaimed performance as Mrs. Ames in East of Eden (1981), the adaptation of John Steinbeck's novel. Grace appeared in the highly acclaimed and Oscar-nominated An Officer and a Gentleman (1982) and The Big Easy (1986), set in her beloved New Orleans. She worked with producer and director David Lynch, and was a series regular in the cult favorite Twin Peaks (1990) as Sarah Palmer, the part with which she is most often identified. She also appeared in Lynch's Wild at Heart (1990) the same year. She has played a wide variety of roles, and gave a terrific performance in the Oscar-nominated Fried Green Tomatoes (1991) and showed great character depth as the lonely and despondent widow in The Passion of Darkly Noon (1995). Grace's more recent roles were in the zany Sparkler (1997) and in the big-name feature Sans motif apparent (2002), based on a short story by Dashiell Hammett. A woman of many talents, she is currently creating her own original paintings, unique sculptures and woodwork art that can be viewed in Los Angeles galleries. Her visual arts, which include creating lamps or \"sculptures with light\" as she calls them, are available from the L.A.-based ArtHaus.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MzI4ODkyOF5BMl5BanBnXkFtZTgwMTc5NDIzNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0951471","name":"Grace Zabriskie","nicknames":["Gracie"],"idIMDB":"nm0951471"},"actorId":"nm0951471","character":"Mrs. Weiss","urlCharacter":"http://www.imdb.com/character/ch0441302","main":true},{"actorName":"Ron Perlman","urlProfile":"http://www.imdb.com/name/nm0000579","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzAzMTEyOV5BMl5BanBnXkFtZTcwNjYwMzYwNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 April 1950","placeOfBirth":" New York City, New York, USA","birthName":"Ronald Francis Perlman","height":"6' 1\" (1.85 m)","bio":"Ron Perlman is a classically-trained actor who has appeared in countless stage plays, feature films and television productions. Ronald N. Perlman was born April 13, 1950 in Washington Heights, Manhattan, New York. His mother, Dorothy (Rosen), is retired from the City Clerk's Office. His father, Bertram \"Bert\" Perlman, now deceased, was a repairman and a drummer. His parents were both from Jewish families (from Hungary, Germany and Poland). With a career spanning over three decades, Perlman has worked alongside such diverse actors as Marlon Brando, Sean Connery, Dominique Pinon, Brad Dourif, Ed Harris, John Hurt, Jude Law, Christina Ricci, Federico Luppi, Sigourney Weaver, Michael Wincott and Elijah Wood to name a few. While he has never been a bankable star, Perlman has always had a large fanbase. He started out strong as Amoukar, one of the tribesmen in Jean-Jacques Annaud's Academy Award-winning film Quest for Fire (1981), for which he earned a Genie Award nomination. Perlman teamed up with Annaud again, this time as a hunchback named Salvatore in The Name of the Rose (1986). His first real breakthrough came later when he landed the role of the noble lion-man Vincent, opposite Linda Hamilton on the fantasy series Beauty and the Beast (1987). His work in this role earned him not only a Golden Globe Award but an underground fan following. Sadly the series was cancelled in its third season shortly after Hamilton's character's death. After that, he spent time doing supporting work on television and independent films such as Guillermo del Toro's debut Cronos (1993) (where a lifelong friendship and collaboration between the director and Perlman would blossom) as Angel and his first lead role as One in Jean-Pierre Jeunet's surreal The City of Lost Children (1995). His first real big role in a mainstream film came when Jeunet wanted him for the brutish Johner in his first Hollywood outing Alien: Resurrection (1997). Perlman has also used his distinctive voice to his advantage, appearing in many animated films/series, commercials and he is a video game fan favorite because of his work on such games as the Fallout series. It was not until much later he received worldwide fame when his good friend Guillermo del Toro helped him land the title role in the big-budget comic book movie Hellboy (2004). Del Toro fought the studio for four years because they wanted a more secure name, but he stood his ground and in 2004, after almost 25 years in and out of obscurity, Perlman became and household name and a sought out actor. Perlman has had one of the most offbeat careers in film, playing everything from a prehistoric ape-man to an aging transsexual and will always be a rarity in Hollywood. Other notable roles include the cunning Norman Arbuthnot in The Last Supper (1995), sniper expert Koulikov in Enemy at the Gates (2001), vampire leader Reinhardt in Blade II (2002), his reprisal of Hellboy in Hellboy II: The Golden Army (2008) and biker chief Clarence Morrow on the popular series Sons of Anarchy (2008). He currently resides in Los Angeles, California with his wife, Opal, and their two children, Blake and Brandon.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzAzMTEyOV5BMl5BanBnXkFtZTcwNjYwMzYwNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000579","name":"Ron Perlman","idIMDB":"nm0000579"},"actorId":"nm0000579","character":"Booking Agent","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karl Makinen","urlProfile":"http://www.imdb.com/name/nm0538625","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMjY0OTM4Nl5BMl5BanBnXkFtZTcwMDIzNTAzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 December 1970","placeOfBirth":" Queens, New York, USA","height":"6' 2\" (1.88 m)","bio":"Karl Edward Makinen Jr., born in Queens, New York to Marilyn and Karl Sr., (aka Detective Eddie Makinen NYPD) moved to Long Island at the age of two. Growing up fishing, swimming and boating on Lake Ronkonkoma gave him a great childhood. He and his three brothers Michael, Shawn and Josef did what most boys do, and gave their parents hell. Karl, the third of the four boys, seemed to need the majority of attention in the family and would love to act out his father yelling at his brothers to his great grandmother, producing the greatest laugh that could come from a 90 plus year old woman. After performing shows in his basement for the neighborhood kids and enjoying the laughs and reactions he created, Karl became involved in school plays. He performed the lead in Guys and Dolls, Fools, Dracula and many others, winning him the best actor award and a scholarship that he spent in New York City, going to HB studios with his actor high school friend Chris Franjola. After booking some extra work and being turned down for a few Broadway shows, Karl briefly contemplated his father's wishes of becoming one of New York's finest, but he and Chris ultimately decided it was time to get serious about acting and make the move to Hollywood. Disappointing his father's wishes, the two bought a one-way ticket to Los Angeles. Landing at LAX with less than two thousand dollars between them, nowhere to stay and not knowing anyone, they slowly made their way. Conversations in phone calls to his family were monopolized by his father insisting he should take the LAPD test and be a cop like his little brother Josef (Graduating class NYPD '93). After getting some small parts in B films, he finally quieted his father's pleas to become a cop, \"take the test, take the test, get on the list\" when he received a guest-starring role on his father's favorite show, NYPD Blue, playing Jimmy Clayton - cop killer in the first season. Karl continues to enjoy his acting career and has appeared in over thirty film and television roles, playing cops, bad guys and sometimes","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMjY0OTM4Nl5BMl5BanBnXkFtZTcwMDIzNTAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0538625","name":"Karl Makinen","idIMDB":"nm0538625"},"actorId":"nm0538625","character":"Jim Collins","urlCharacter":"http://www.imdb.com/character/ch0475339","main":true},{"actorName":"Judy Geeson","urlProfile":"http://www.imdb.com/name/nm0002096","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExODU1NTc4OF5BMl5BanBnXkFtZTcwMjg1NjgyNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1948","placeOfBirth":" Arundel, Sussex, England, UK","birthName":"Judith Amanda Geeson","height":"5' 4\" (1.63 m)","bio":"Born in Arundel, Sussex in 1948, Judy's father moved the family into London when she was 10 years old and enrolled her and sister Sally Geeson into the Corona Academy, Chiswick. Judy initially wanted to be a ballet dancer but had to change course when she suffered from terrible headaches as a result of some of the moves but acting had always been a great interest and she chose to pursue this, making in her first TV appearance in Dixon of Dock Green (1955) aged 12. Her first major film role was as wayward teenager Pamela Dare opposite Sidney Poitier in To Sir, with Love (1967) at the age of 18. After a very successful film run during the 1960s and 1970s Judy took a trip to the US in October 1984 choosing to stay on for a while. By May 1985 she had met and married Kristoffer Tabori and moved to California. However, the marriage had broken down by 1989. Despite this, Judy chose to stay in the US and she currently lives in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExODU1NTc4OF5BMl5BanBnXkFtZTcwMjg1NjgyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002096","name":"Judy Geeson","idIMDB":"nm0002096"},"actorId":"nm0002096","character":"Lady Doyle","urlCharacter":"http://www.imdb.com/character/ch0475336","main":true},{"actorName":"Frank McRae","urlProfile":"http://www.imdb.com/name/nm0574433","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyMTA4NDkyNTBeQTJeQWpwZ15BbWU3MDYxODEzMTg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 June 1942","placeOfBirth":" Memphis, Tennessee, USA","height":"6' 6\" (1.98 m)","bio":"African-American former NFL player, with plenty of height and built like an ox, has scored over 40 film appearances predominantly as tough thugs, authority figures or even successful comedy roles. McRae first came to attention playing a grinning jail inmate, \"Reed Youngblood\", helping Warren Oates escape in Dillinger (1973), and then quickly notched up minor tough guy roles in several films including Hard Times (1975), F.I.S.T. (1978) and Big Wednesday (1978). However, not to be typecast as a brute, McRae turned in some light-hearted & comedic performances in National Lampoon's Vacation (1983), *batteries not included (1987) and as a foul-mouthed mechanic in the hilarious Used Cars (1980). Also turned in quite funny performances in Loaded Weapon 1 (1993), and as Arnold Schwarzenegger's long-suffering police captain in Last Action Hero (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyMTA4NDkyNTBeQTJeQWpwZ15BbWU3MDYxODEzMTg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0574433","name":"Frank McRae","idIMDB":"nm0574433"},"actorId":"nm0574433","character":"Usher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Segal","urlProfile":"http://www.imdb.com/name/nm0001719","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3Mzc4NTQwM15BMl5BanBnXkFtZTcwMTc0MzY1Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1934","placeOfBirth":" Great Neck, Long Island, New York, USA","birthName":"George Segal Jr.","height":"5' 10½\" (1.79 m)","bio":"George Segal was born on February 13, 1934 in Great Neck, Long Island, New York, to Fannie Blanche (Bodkin) and George Segal, Sr., a malt and hop agent. All of his grandparents were Russian Jewish immigrants. After a stint in the military, he made his bones as a stage actor before being cast in his first meaty film role in The Young Doctors (1961). His turns in Ship of Fools (1965) and the eponymous King Rat (1965) in 1965 heralded the arrival of a major talent. He followed it up with his Oscar-nominated performance in Who's Afraid of Virginia Woolf? (1966), in which he more than held his own against Richard Burton and Elizabeth Taylor. Who's Afraid of Virginia Woolf? (1966) was a cultural phenomenon, the film that wrecked the MPDDA censorship code that had been in place since 1934, and a huge box office success to boot. By the early 1970s, appearances in such films as The Owl and the Pussycat (1970), Blume in Love (1973), Born to Win (1971) and The Hot Rock (1972) had made him a major star with an enviable reputation, just under the heights of the superstar status enjoyed by the likes of Paul Newman. He followed up A Touch of Class (1973) (a hit film for which his co-star Glenda Jackson won an Oscar) with his brilliant performance as the out-of-control gambler in Robert Altman's California Split (1974). At one time in the early 1970s, it seemed like George Segal would have a career like that enjoyed by his contemporary Jack Nicholson, that of an actor's actor equally adept at comedy and drama. Segal never made the leap to superstar status, and surprisingly, has never won a major acting award, the latter phenomenon being particularly surprising when viewed from the period 1973-4, when he reached the height of his career. It was at this point that Segal's career went awry, when he priced himself as a superstar with a seven-figure salary, but failed to come through at the box office. For example, The Black Bird (1975) was a failure, although his subsequent starring turn opposite of Jane Fonda, in Fun with Dick and Jane (1977), was a big hit that revitalized Jane Fonda's career. At the end of the decade, he dropped out of a movie that would have burnished his tarnished lustre as a star: Blake Edwards' 10 (1979). 10 (1979) made Dudley Moore a star, while Arthur (1981) made him a superstar in the 1980s, a lost decade for Segal. It was an example of a career burnout usually associated with the \"Oscar curse\" (his No Way to Treat a Lady (1968) co-star Rod Steiger, for example, was a great character actor whose career was run off the rails by the expectations raised by the Academy Award). George Segal has never won an Oscar, but more surprisingly, has only been nominated once, for Best Supporting Actor of 1966 for his role as \"Nick\" in Who's Afraid of Virginia Woolf? (1966). He gave a deft comic performance in Who Is Killing the Great Chefs of Europe? (1978) with Jacqueline Bisset and Robert Morley, which proved a modest box office success. For all practical purposes, even after the failures of The Black Bird (1975), and The Duchess and the Dirtwater Fox (1976), it seemed like Segal, with a few deft career choices, could reorient his career and deliver on the promise of his early period. That he didn't may be the unintended consequence of his focusing on comedy to the detriment of drama. The comedy A Touch of Class (1973) made him a million dollar-per-film movie star, and that's what he concentrated on. Segal began relying on his considerable charm to pull off movies that had little going for them other than their star, and it backfired on him. These films weren't infused with the outrageously funny, subversive comedy of Where's Poppa? (1970), a success from his first period that he enjoyed along with co-star Ruth Gordon and director Carl Reiner. When Segal first made it in the mid-1960s, he established his serious actor bona fides with a deal he cut with ABC-TV that featured him in TV adaptations of Broadway plays. He also played a very memorable \"Biff Loman\" in Death of a Salesman (1966), shining in performance in counterpoint to the vital presence that was Lee J. Cobb's \"Willy Loman\". It was a good life for an actor, and he took time to show off his banjo-playing skills by fronting the \"Beverly Hills Unlisted Jazz Band\", with which he cut several records. While the 1980s were mostly a career wasteland for Segal, he came back in the 1990s, using his flair for comedy as part of the ensemble cast of Just Shoot Me! (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3Mzc4NTQwM15BMl5BanBnXkFtZTcwMTc0MzY1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001719","name":"George Segal","idIMDB":"nm0001719"},"actorId":"nm0001719","character":"Beck","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emile Hirsch","urlProfile":"http://www.imdb.com/name/nm0386472","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNDU1MDU5OV5BMl5BanBnXkFtZTcwOTM5OTcyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 March 1985","placeOfBirth":" Palms, California, USA","birthName":"Emile Davenport Hirsch","height":"5' 6\" (1.68 m)","bio":"Emile Davenport Hirsch was born in Palms, California, to Margaret Esther (Davenport), a teacher and visual artist, and David M. Hirsch, an entrepreneur and producer. He grew up in Los Angeles and Santa Fe, New Mexico, and having been introduced to acting while still at school, he got his first acting job on TV at the age of 11 in an episode of Kindred: The Embraced (1996). More TV work followed until he made his Hollywood debut in The Dangerous Lives of Altar Boys (2002) and doesn't seem to have been out of work since.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNDU1MDU5OV5BMl5BanBnXkFtZTcwOTM5OTcyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0386472","name":"Emile Hirsch","nicknames":["Hirschy"],"idIMDB":"nm0386472"},"actorId":"nm0386472","character":"Young Houdini","urlCharacter":"http://www.imdb.com/character/ch0034364","main":true},{"actorName":"Curt Lowens","urlProfile":"http://www.imdb.com/name/nm0523142","urlPhoto":"","biography":{"dateOfBirth":"17 November 1925","placeOfBirth":" Allenstein, East Prussia, Germany [now Olsztyn, Warminsko-Mazurskie, Poland]","birthName":"Kurt Löwenstein","bio":"Curt Lowens was born on November 17, 1925 in Allenstein, East Prussia, Germany as Kurt Löwenstein. He is known for his work on General Hospital (1963), Angels & Demons (2009) and Two Women (1960).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0523142","name":"Curt Lowens","idIMDB":"nm0523142"},"actorId":"nm0523142","character":"Samuel Weiss","urlCharacter":"http://www.imdb.com/character/ch0475338","main":true},{"actorName":"Jack McGee","urlProfile":"http://www.imdb.com/name/nm0569079","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMzU5NDU1MV5BMl5BanBnXkFtZTcwNDczNjQ3NA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 February 1949","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"John J. McGee","height":"5' 5\" (1.65 m)","bio":"Jack McGee was born on February 2, 1949 in The Bronx, New York City, New York, USA as John J. McGee. He is an actor, known for The Fighter (2010), Moneyball (2011) and 21 (2008). He has been married to Stephanie since August 19, 1996.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMzU5NDU1MV5BMl5BanBnXkFtZTcwNDczNjQ3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0569079","name":"Jack McGee","idIMDB":"nm0569079"},"actorId":"nm0569079","character":"Street Vendor","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0159276","urlIMDB":"http://www.imdb.com/title/tt0159276","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 34 min (94 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"5.8","filmingLocations":[{"location":"Laramie Street, Warner Brothers Burbank Studios - 4000 Warner Boulevard, Burbank, California, USA"}],"rated":"UNRATED","awards":[{"award":"Primetime Emmy Awards 1999","titlesAwards":[{"titleAwardOutcome":"Won Primetime Emmy","categories":[{"category":"Outstanding Hairstyling for a Miniseries, Movie or a Special","names":[{"name":"Judy Crown","id":"nm0189806","role":"head hairstylist"}]}]},{"titleAwardOutcome":"Nominated Primetime Emmy","categories":[{"category":"Outstanding Makeup for a Miniseries, Movie or a Special","names":[{"name":"Matthew W. Mungle","id":"nm0612817","role":"special makeup artist"},{"name":"Deborah La Mia Denaver","id":"nm0218899","role":"makeup department head"},{"name":"John E. Jackson","id":"nm0413703","role":"prosthetic makeup artist"}]},{"category":"Outstanding Sound Editing for a Miniseries, Movie or a Special","names":[{"name":"William H. Angarola","id":"nm0029410","role":"supervising sound editor"},{"name":"Rick Hinson","id":"nm0385923","role":"sound editor"},{"name":"Anna MacKenzie","id":"nm0533271","role":"sound editor"},{"name":"Ray Spiess","id":"nm0818679","role":"sound editor"},{"name":"Mike Marchain","id":"nm0545343","role":"sound editor"},{"name":"Skip Adams","id":"nm0011361","role":"sound editor"},{"name":"Robert Guastini","id":"nm0345473","role":"sound editor"},{"name":"Cindy Rabideau","id":"nm0704872","role":"sound editor"},{"name":"Jeanette Surga","id":"nm0839609","role":"music editor"},{"name":"Zane D. Bruce","id":"nm0115601","role":"foley artist"},{"name":"Joseph T. Sabella","id":"nm0754677","role":"foley artist"}]}]}]},{"award":"Art Directors Guild 1999","titlesAwards":[{"titleAwardOutcome":"Nominated Excellence in Production Design Award","categories":[{"category":"Television Movie or Mini-Series","names":[{"name":"Jerry Wanek","id":"nm0910822","role":"production designer"},{"name":"John Bucklin","id":"nm0118706","role":"art director"},{"name":"Maia Javan","id":"nm0419473","role":"visual consultant"}]}]}]},{"award":"Motion Picture Sound Editors, USA 1999","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing - Television Movies of the Week - Sound Effects &amp; Foley","names":[]}]}]}],"votes":"408","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0078090","name":"Trilogy Entertainment Group"}],"keywords":{"keywords":["seance","escape artist","1920s","1910s","1900s","1890s","magic","medium","illusion"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:12:33"}}