{"data":{"movies":[{"title":"You Can't Take It with You","originalTitle":"","year":"1979","releaseDate":"19790516","directors":[{"name":"Paul Bogart","id":"nm0091575"}],"writers":[{"name":"Moss Hart","id":"nm0366454"},{"name":"George S. Kaufman","id":"nm0442151"}],"runtime":"97 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NzQ3NTE4N15BMl5BanBnXkFtZTgwMTkzNjQxMjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"Emmy winner Jean Stapleton and Academy Award winner Art Carney star in the Pulitzer Prize-winning comedy by George S. Kaufman and Moss Hart about a slightly daft family who do exactly as they please.","simplePlot":"Emmy winner Jean Stapleton and Academy Award winner Art Carney star in the Pulitzer Prize-winning comedy by George S. Kaufman and Moss Hart about a slightly daft family who do exactly as they please.","actors":[{"actorName":"Jean Stapleton","urlProfile":"http://www.imdb.com/name/nm0822958","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNTE1MzgyNl5BMl5BanBnXkFtZTcwMTkzMzE0NQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 January 1923","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Jeanne Murray","height":"5' 8\" (1.73 m)","bio":"Jean Stapleton was born Jeanne Murray in Manhattan, New York City, to Marie A. (Stapleton), an opera singer, and Joseph Edward Murray, a billboard advertising salesman. Her paternal grandparents were Irish. She was a cousin of actress Betty Jane Watson. Other relatives in show business were her uncle, Joseph E. Deming, a vaudevillian; and her brother Jack Stapleton, a stage actor. She graduated from Wadleigh High School, NYC, in 1939, and attended Hunter College. She worked as a secretary before becoming an actress. Stapleton made her stage debut at the Greenwood Playhouse, Peaks Island, Maine, in the summer of 1941, and her New York stage debut in \"The Corn Is Green\" (1948). She appeared on Broadway in the musicals \"Damn Yankees\" (1955) and \"Bells Are Ringing\" (1956), and later repeated her roles in the movie versions (Damn Yankees! (1958) and Bells Are Ringing (1960)). Her other Broadway roles included the original companies of \"Rhinoceros\" (1961) and \"Funny Girl\" (1964). Stapleton also played Abby Brewster in the 1986-87 revival of \"Arsenic and Old Lace\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNTE1MzgyNl5BMl5BanBnXkFtZTcwMTkzMzE0NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0822958","name":"Jean Stapleton","idIMDB":"nm0822958"},"actorId":"nm0822958","character":"Penny Sycamore","urlCharacter":"http://www.imdb.com/character/ch0021303","main":true},{"actorName":"Barry Bostwick","urlProfile":"http://www.imdb.com/name/nm0000960","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NjA4MDg0MV5BMl5BanBnXkFtZTgwNDY5MDgzNDE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1945","placeOfBirth":" San Mateo, California, USA","birthName":"Barry Knapp Bostwick","height":"6' 4\" (1.93 m)","bio":"Tall (6' 4\"), agile, energetic, and ever-so-confident as both actor and singer, especially on the award-winning Broadway stage, Barry Bostwick possesses that certain narcissistic poise, charm and élan that reminds one instantly (and humorously) of a Kevin Kline -- both were quite brilliant in their respective interpretations of The Pirate King in \"The Pirates of Penzance\". Yet, for all his diverse talents (he is a Golden Globe winner and was nominated for the Tony Award three times, winning once), Barry is indelibly caught in a time warp. Even today, 35 years after the fact, he is indelibly associated with the role of nerdy hero Brad Majors in the midnight movie phenomena The Rocky Horror Picture Show (1975). While it is extremely flattering to be a part of such a cult institution, Barry's acting legacy deserves much more than this. He was born Barry Knapp Bostwick on February 24, 1945, in San Mateo, California, one of two sons of Elizabeth \"Betty\" (Defendorf) and Bud Bostwick (Henry Bostwick), a city planner and actor. A student at San Mateo High School, he and his elder brother Peter use to put on musicals and puppet shows for the neighborhood kids. Barry attended San Diego's United States International University's School for the Performing Arts in 1967, and switched from music to drama during the course of his studies. He also worked occasionally as a circus performer, which would come in handy on the musical stage down the line. He subsequently moved to New York and attended the Graduate School of Arts and Sciences at New York University. Making his stage debut at age 22 in a production of \"Take Her, She's Mine,\" Barry performed in a number of non-musical roles in such productions of \"War and Peace\" (1968) and \"The Misanthrope (1968). Making his 1969 Broadway debut in \"Cock-a-Doodle Dandy\", which ran in tandem with \"Hamlet\" in which he was featured as Osric, it was his portrayal of the swaggering, leather jacket-wearing 50s \"bad boy\" Danny Zuko in the 1972 Broadway high-school musical smash \"Grease\" that put Barry's name prominently and permanently on the marquee signs. Originating the role, he was nominated for a Tony but lost out that year to the older generation (Phil Silvers for \"A Funny Thing Happened...\"). In the midst of all this star-making hoopla, Barry was also breaking into films with a minor role in Jennifer on My Mind (1971) and leading parts in the comedy spoofs Road Movie (1974) and The Wrong Damn Film (1975). It all paled after winning the role as Susan Sarandon's simp of a boyfriend in the The Rocky Horror Picture Show (1975), which featured a delicious Tim Curry camping it up as a transvestite monster-maker. The movie, based on the macabre 1973 British stage musical \"The Rocky Horror Show,\" packed the midnight movie houses with costumed fans replicating every move and, word and offering puns and props aplenty in recapturing the insanity of the show. While the \"Rocky\" association hit like a tornado, Barry ventured on and tried to distance himself. He created sparks again on Broadway, garnering a second Tony nomination for the comedy revival \"They Knew What They Wanted\" in 1976. He finally took home the trophy the following year for the musical \"The Robber Bridegroom\" (1977), which relied again on his patented bluff and bravado as a Robin Hood-like hero. Following top roles in the musicals \"She Loves Me\" and \"The Pirates of Penzance\", Barry turned rewardingly to film and TV. The two-part feature Movie Movie (1978), which played like an old-style double feature, was a great success, performing alongside esteemed actor George C. Scott. Barry excelled in both features, but especially the musical parody. He fared just as well on the smaller screen in TV movies, playing everything from historical icons (George Washington) to preening matinée idols (John Gilbert), and winning a Golden Globe for his role as a military officer in the epic miniseries War and Remembrance (1988). A variety of interesting roles followed in glossy, soap-styled fare, farcical comedies and period drama. A welcomed return to Broadway musicals in the form of \"Nick & Nora\" (he as sleuth Nick \"The Thin Man\" Charles) was marred when the glitzy production folded after only nine perfs. Instead, the prematurely grey-haired actor found steadier success in sitcoms as a smug comedy foil to Michael J. Fox playing Mayor Randall Winston for six seasons in Spin City (1996). He later enjoyed a recurring role as a dauntless attorney on Law & Order: Special Victims Unit (1999). Then again, Barry could be spotted pitching items in commercials or hamming it up in family-oriented Disneyesque entertainment in the \"Parent Trap\" and \"101 Dalmatian\" mold. In 1997, Bostwick was diagnosed with prostate cancer, and 10 days later had his prostate removed. The operation was successful and in 2004, he won the Gilda Radner Courage Award from the Roswell Park Cancer Institute. Just a year earlier he appeared on an episode of \"Scrubs\" as a patient also having prostate cancer. Barry married somewhat late in life. For a brief time he was wed to actress Stacey Nelkin (1987-1991), but has since become a father of two, Brian and Chelsea, with second wife Sherri Jensen Bostwick, an actress who appeared with Barry in the TV movie Praying Mantis (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NjA4MDg0MV5BMl5BanBnXkFtZTgwNDY5MDgzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000960","name":"Barry Bostwick","idIMDB":"nm0000960"},"actorId":"nm0000960","character":"Anthony Kirby, Jr.","urlCharacter":"http://www.imdb.com/character/ch0021299","main":true},{"actorName":"Blythe Danner","urlProfile":"http://www.imdb.com/name/nm0001100","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMDkzNTAyODdeQTJeQWpwZ15BbWU3MDY5ODEzMjQ@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 February 1943","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Blythe Katharine Danner","height":"5' 7\" (1.7 m)","bio":"Blythe Danner was born in Philadelphia, Pennsylvania, to Katharine (Kile) and Harry Earl Danner, a bank executive. She has German, as well as English and Irish, ancestry. Danner studied acting and got her degree from Bard College and began her career in Boston theater companies. By 25, she won the Theater World Award for her work in Molière's \"The Miser\", at Lincoln Center. She also won the 1970 Tony award for her role in \"Butterflies Are Free\". She made her film premiere in the same year in the television production of Dr. Cook's Garden (1971). For 25 years, she has been a regular performer at the Williamstown Summer Theater Festival. She has also been nominated for Tonys for performances in \"A Streetcar Named Desire\" and \"Betrayal\". Married to director Bruce Paltrow, she is the mother of two acting children, Gwyneth Paltrow and Jake Paltrow.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMDkzNTAyODdeQTJeQWpwZ15BbWU3MDY5ODEzMjQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001100","name":"Blythe Danner","nicknames":["Lalo"],"idIMDB":"nm0001100"},"actorId":"nm0001100","character":"Alice Sycamore","urlCharacter":"http://www.imdb.com/character/ch0021301","main":true},{"actorName":"Marla Gibbs","urlProfile":"http://www.imdb.com/name/nm0004958","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg3NTYzMzQ0MF5BMl5BanBnXkFtZTcwMjg5NDQwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 June 1931","placeOfBirth":" Chicago, Illinois, USA","birthName":"Margaret Theresa Bradley","height":"5' 8\" (1.73 m)","bio":"Armed with an acid dry wit and a full arsenal of sarcasm and sass, African-American character comedienne Marla Gibbs showed up on 70s TV with a bang in middle age (44). Landing the feisty maid role on the popular ground-breaking CBS comedy, The Jeffersons (1975), eventually led to her very own sitcom, 227 (1985), a decade later and international celebrity. A divorced mother with three children (Angela Elayne Gibbs, Dorian, Joseph) at the time of her initial success, it was a job transfer from Detroit to Los Angeles, while working as a United Airlines reservation clerk, that set up this more-than-welcome surprise and change of destiny. The Chicago native, who was born in 1931 and who married at age 13, was already a single mom before ever entertaining the thought of becoming a professional actress. Following high school, Marla attended Peters Business School (1950-1952) and toiled for a time as a receptionist and switchboard operator in the Detroit area. Eventually, she secured work with United Airlines. After moving to Southern California on a transfer, Marla gave acting a try and initially studied at the Mafundi Institute and Watts Writers Workshop, located in the Watts area of L.A. Bitten hard by the acting bug, she went on to appear in a number of local productions, including \"Medea\", \"The Amen Corner\" and \"The Gingerbread Lady\". After only a couple of minor film parts, including the \"blaxploitation\" film, Black Belt Jones (1974), she nabbed the role of \"Florence Johnston\". The maid was initially set up as a mere one-shot guest part but Marla showed the character's potential. And, so it came to be that \"Florence Johnston\" became THE scene-stealing foil to Sherman Hemsley's equally mouthy, money-minded \"George Jefferson\". Until the show became a certified hit, Marla cautiously kept her job with the Airlines. With wisecracks and Emmy nominations (totaling 5) a plenty, however, Marla never had to look back. The role of \"Florence\" was a natural for a spin-off series and it happened with the sitcom, Checking In (1981), in which the character becomes a housekeeper for a very swanky hotel. The show was harmed, however, by a writer's strike before it could gain a core audience. Fortunately for Marla, she was ushered right back into the Jefferson household following its quick demise (four episodes). Two months after the last \"Jeffersons\" episode aired in July of 1985, \"227\" was included in that year's fall schedule. Daughter Angela Elayne Gibbs produced an award-winning play by Christine Houston entitled \"227\", with Marla as the lead, at Marla's own local Crossroads Theatre, which the actress founded in 1981. The play was a solid hit and Marla wisely purchased the TV rights. Once \"The Jeffersons\" was over, she pushed for \"227\" as a sitcom vehicle. Producer Norman Lear gave it the green light and Marla settled right back in for another popular series ride (for NBC), this time as resident gossip \"Mary Jenkins\", whose demeanor was warmer and more approachable than the feisty \"Florence\" character. This series, which featured spitfire Jackée Harry as vampish neighbor, \"Sandra\", ran for five years. An eight-time NAACP Image Award winner, Marla has received several honors over the years, including Essence Woman of the Year. She has not carried a series since \"227\", but has been seen from time to time on other popular shows, including ER (1994), Cold Case (2003), Chappelle's Show (2003), Judging Amy (1999), Touched by an Angel (1994), The King of Queens (1998) and Dawson's Creek (1998). She has also had recurring roles on daytime (Passions (1999)) as well as prime-time (Pryor's Place (1984), The Hughleys (1998)) and gave a knowing portrayal as Natalie Cole's mother in the heart-warming TV movie, Lily in Winter (1994). In later years, Marla turned up again on the big screen with plucky roles in Up Against the Wall (1991), The Meteor Man (1993), Lost & Found (1999), Foolish (1999), Border to Border (1998), The Brothers (2001), and standout roles in The Visit (2000) and Stanley's Gig (2000). Elsewhere, Marla's voice has been heard on the animated TV series, 101 Dalmatians: The Series (1997) and, in addition to acting, sang the theme song to the film, Stanley's Gig (2000), \"In the Memory of You\", which will be included on a CD, entitled \"Scenes In Jazz\". Marla owned a jazz club for some time in South Central L.A. called \"Marla's Memory Lane, a jazz and supper club that ran from 1981 to 1999. She released her own CD of music, \"It's Never Too Late\", in May 2006, and co-wrote with Ray Colcord, the theme song to her starring series, 227 (1985). Marla's older sister, Susie Garrett, who co-starred on the hit sitcom, Punky Brewster (1984), died of cancer in 2002. Fully recovered after suffering a small aneurysm and stroke a few years ago, the actress recently performed in the comedy play, \"Boeing-Boeing\", in Kansas City, a role created on film by the equally sarcastic Thelma Ritter, back in the 1960s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg3NTYzMzQ0MF5BMl5BanBnXkFtZTcwMjg5NDQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004958","name":"Marla Gibbs","idIMDB":"nm0004958"},"actorId":"nm0004958","character":"Rheba","urlCharacter":"http://www.imdb.com/character/ch0021307","main":true},{"actorName":"Howard Hesseman","urlProfile":"http://www.imdb.com/name/nm0381606","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxOTkzNDg5NV5BMl5BanBnXkFtZTYwNTk1MTY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1940","placeOfBirth":" Lebanon, Oregon, USA","birthName":"George Howard Hesseman","height":"5' 10\" (1.78 m)","bio":"Howard Hesseman has been a leading counter-culture figure since the late 1960s. He was a member of the improv group, \"the Committee\", for ten years in the sixties and seventies. He has been a character actor for many years on different television shows since the 1960s, and took small parts in The Andy Griffith Show (1960), Dragnet 1967 (1967), Soap (1977) and Sanford and Son (1972). The role that brought him to prominence was Howard Johnson in the cult classic Billy Jack (1971). He has been active in movies and TV since. He was a frequent guest star on The Bob Newhart Show (1972), but the best was yet to come. He will perhaps be forever remembered on the classic series WKRP in Cincinnati (1978), as anti-disco DJ Dr. Johnny Fever. Also in the seventies, Hesseman appeared in a small part in The Sunshine Boys (1975), Tunnel Vision (1976), Silent Movie (1976) and The Big Bus (1976). After the cancellation of WKRP in Cincinnati (1978), he went on to star as the husband of Ann Romano in One Day at a Time (1975). After that series was cancelled, Hesseman starred in more cult classics, such as This Is Spinal Tap (1984), Doctor Detroit (1983), Police Academy 2: Their First Assignment (1985), (a role which he refused to play again) Clue (1985) and Flight of the Navigator (1986). He then got another part in television, this time as a teacher in the high school sitcom Head of the Class (1986). As Mr. Moore, he was insightful, funny and a pleasure to watch. Hesseman left the show in 1990 and has done a steady stream of television guest roles since. In 1987, he was in the star-studded Amazon Women on the Moon (1987), and, in 1991, he starred in the very strange film Rubin and Ed (1991). Since then, he has been in a handful of other films, including Gridlock'd (1997) with Tupac Shakur. His work in recent years concentrates mostly on television, where he takes mostly small guest roles, in shows like That '70s Show (1998), Touched by an Angel (1994), The Practice (1997) and Crossing Jordan (2001). Since his career began, Hesseman has gained a reputation as a quality and versatile character actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxOTkzNDg5NV5BMl5BanBnXkFtZTYwNTk1MTY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0381606","name":"Howard Hesseman","idIMDB":"nm0381606"},"actorId":"nm0381606","character":"Wilbur C. Henderson","urlCharacter":"http://www.imdb.com/character/ch0100734","main":true},{"actorName":"Polly Holliday","urlProfile":"http://www.imdb.com/name/nm0391072","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NDIwOTU0MF5BMl5BanBnXkFtZTcwMjAwMTExOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 July 1937","placeOfBirth":" Jasper, Alabama, USA","birthName":"Polly Dean Holliday","height":"5' 8\" (1.73 m)","bio":"The normally erudite, soft-spoken and well-mannered Alabama-born actress Polly Holliday had accumulated quite an extensive theater background by the time she hit it big on 70s TV as the brash, uninhibited, gum-cracking waitress Florence Jean Castleberry (Flo for short) on the popular sitcom Alice (1976). As a long and respected member of the Asolo Repertory Company in Sarasota, Florida, Polly had toiled long and hard to disguise her Southern twang while building up a sturdy classical reputation. At the same time, she taught music in the city's elementary schools. When she won the role of Flo in 1976, however, she let all four burners out as the scene-stealing Southern-baked hash-slinger who delightfully redefined trailer park trash. The two-time Golden Globe winner and Emmy-nominated actress hit it so big with fans (she introduced the catch phrase, \"Kiss mah grits!\" to the American vernacular) that she earned her own spin-off, aptly titled Flo (1980). The show barely lasted one season despite another Emmy-nomination for her. Polly lost major clout after the show's cancellation and, to avoid typecasting, she stayed out of the television limelight while appearing in regional theater. She won renewed respect and critical notice for her Amanda Wingfield in The Glass Menagerie, her Tony-nominated turn as Big Mama in Cat on a Hot Tin Roof, and for her part as the lonely small-town schoolteacher in Picnic in 1994. From time to time she has taken on flashy roles in both comic and dramatic films, such as the old crank who meets a freakish end in Gremlins (1984), and on TV wherein she briefly replaced Eileen Brennan in the series Private Benjamin (1981) after Ms. Brennan's near-fatal car accident in 1982. Though Polly never recaptured the dazzling success of her Alice (1976) years, she has continued at a healthy pace -- primarily in guest spots where she plays wise and opinionated mothers and grandmothers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NDIwOTU0MF5BMl5BanBnXkFtZTcwMjAwMTExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0391072","name":"Polly Holliday","idIMDB":"nm0391072"},"actorId":"nm0391072","character":"Miriam Kirby","urlCharacter":"http://www.imdb.com/character/ch0021311","main":true},{"actorName":"Beth Howland","urlProfile":"http://www.imdb.com/name/nm0398191","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MTIyODgzN15BMl5BanBnXkFtZTgwNjY2ODAwOTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 May 1941","placeOfBirth":" Boston, Massachusetts, USA","height":"5' 5\" (1.65 m)","bio":"Beth Howland was born on May 28, 1941 in Boston, Massachusetts, USA. She was an actress, known for Alice (1976), A Caribbean Mystery (1983) and You Can't Take It with You (1979). She was married to Charles Kimbrough and Michael J. Pollard. She died on December 31, 2015 in Santa Monica, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MTIyODgzN15BMl5BanBnXkFtZTgwNjY2ODAwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0398191","name":"Beth Howland","idIMDB":"nm0398191"},"actorId":"nm0398191","character":"Essie Carmichael","urlCharacter":"http://www.imdb.com/character/ch0021305","main":true},{"actorName":"Robert Mandan","urlProfile":"http://www.imdb.com/name/nm0541610","urlPhoto":"","biography":{"dateOfBirth":"2 February 1932","placeOfBirth":" Clever, Missouri, USA","height":"6' 1\" (1.85 m)","bio":"Robert Mandan was born on February 2, 1932 in Clever, Missouri, USA. He is an actor, known for Soap (1977), Zapped! (1982) and The Best Little Whorehouse in Texas (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0541610","name":"Robert Mandan","idIMDB":"nm0541610"},"actorId":"nm0541610","character":"Anthony Kirby","urlCharacter":"http://www.imdb.com/character/ch0021304","main":true},{"actorName":"Kenneth Mars","urlProfile":"http://www.imdb.com/name/nm0550318","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4ODQ1NTIwNF5BMl5BanBnXkFtZTcwMzIxOTQ3MQ@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1935","placeOfBirth":" Chicago, Illinois, USA","height":"6' 3\" (1.91 m)","bio":"Kenneth Mars was born on April 4, 1935 in Chicago, Illinois, USA. He was an actor, known for The Little Mermaid (1989), Butch Cassidy and the Sundance Kid (1969) and Young Frankenstein (1974). He was married to Barbara Newborn. He died on February 12, 2011 in Granada Hills, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4ODQ1NTIwNF5BMl5BanBnXkFtZTcwMzIxOTQ3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0550318","name":"Kenneth Mars","nicknames":["Kenny"],"idIMDB":"nm0550318"},"actorId":"nm0550318","character":"Mr. Kolenkhov","urlCharacter":"http://www.imdb.com/character/ch0021310","main":true},{"actorName":"Harry Morgan","urlProfile":"http://www.imdb.com/name/nm0604702","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4OTc3NzE5MF5BMl5BanBnXkFtZTcwMTc4NDMxNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1915","placeOfBirth":" Detroit, Michigan, USA","birthName":"Harry Bratsberg","height":"5' 6\" (1.68 m)","bio":"Harry Morgan was a prolific character actor who starred in over 100 films and was a stage performer. Known to a younger generation of fans as \"Col. Sherman T. Potter\" on M*A*S*H (1972). Also known for his commanding personality throughout his career, he tackled movies and television in a way no other actor would do it. Born Harry Bratsberg in Detroit, Michigan, to parents Henry Bratsberg, who immigrated from Norway, who was a mechanic, and Anna Olsen, a housewife who immigrated from Sweden. After graduating from Muskegon High School in Muskegon, Michigan, he took on a job as a salesman, before becoming a successful actor. In the many films, several of his most memorable movies, he appeared in were: in one of his firsts, The Omaha Trail (1942), in the next quarter of a century, he would also appear in The Ox-Bow Incident (1943), Wing and a Prayer (1944), State Fair (1945), Dragonwyck (1946), All My Sons (1948), Red Light (1949), Outside the Wall (1950), Dark City (1950) where he met future Dragnet 1967 (1967) co-star Jack Webb, who would be best friends until Webb's death, late in 1982, along with Appointment with Danger (1951). His films credits also include: High Noon (1952), The Glenn Miller Story (1954), Strategic Air Command (1955), among many others. He also co-starred with James Garner in Support Your Local Sheriff! (1969) and its sequel Support Your Local Gunfighter (1971). On television, he is fondly remembered as Spring Byington's jokingly, henpecked neighbor, \"Pete Porter\" on December Bride (1954), where he became the show's scene-stealer. It was also based on a popular radio show that it transferred into television. The show was an immediate success to viewers, which led him into starring his own short-lived spin-off series, Pete and Gladys (1960), which co-starred Cara Williams, who met Morgan in the movie, The Saxon Charm (1948). Morgan began his eight-year association with old friend, Jack Webb, and Universal, starting with Dragnet 1967 (1967), which he played Off. Bill Gannon. For the second time, like December Bride (1954) before this, it was an immediate hit, where it tackled a lot of topics. Dragnet was canceled in 1970, after a 4-season run, due to Morgan's best friend and co-star (Jack Webb) leaving the show to continue producing other shows, such as: Adam-12 (1968) and Emergency! (1972). Morgan would later work with Webb in both short-lived series, The D.A. (1971), opposite Robert Conrad and Hec Ramsey (1972), opposite Richard Boone. After those roles, Morgan ended his contract with both Universal and Mark VII, to sign with 20th Century Fox. Morgan's biggest role was that of a tough-talking, commanding, fun-loving, serious Army Officer, \"Col. Sherman T. Potter\" on M*A*S*H (1972), when he replaced McLean Stevenson, who left the show to unsuccessfully star in his own sitcom. For the third time, the show was still a hit with fans, and at 60, he was nominated for Emmies nine times and won his first and only Emmy in 1980, for Outstanding Supporting Actor. By 1983, M*A*S*H's series was getting very expensive, as well as with the cast, hence, CBS reduced it to 16 episodes. Despite M*A*S*H's finale in 1983, Morgan went on to star in a short-lived spin-off series After MASH (1983), co-starring Jamie Farr and William Christopher, from the original M*A*S*H (1972) series, without series' star Alan Alda. He also co-starred in 2 more short-lived series, as he was over 70, beginning with Blacke's Magic (1986) with Hal Linden and his final role with You Can't Take It with You (1987). That same year, he reprised his role, for a second time as \"Off. Bill Gannon\" in the film, Dragnet (1987), which starred Dan Aykroyd and Tom Hanks. Then, he guest-starred in several shows such as: The Twilight Zone (1985), Renegade (1992), The Jeff Foxworthy Show (1995), for the third time, he also reprised his \"Off. Bill Gannon\" role, supplying his voice on The Simpsons (1989). Towards the end of his acting career, as he reached 80, he had a recurring role as the older college professor on 3rd Rock from the Sun (1996), opposite John Lithgow. Afterwards, he retired from show business and lived with his family. Harry Morgan died on December 7, 2011, at age 96. On confirming his death, his son Charles, said that he had been recently treated for pneumonia. Morgan was also one of the oldest living Hollywood male actors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4OTc3NzE5MF5BMl5BanBnXkFtZTcwMTc4NDMxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0604702","name":"Harry Morgan","idIMDB":"nm0604702"},"actorId":"nm0604702","character":"Mr. DePinna","urlCharacter":"http://www.imdb.com/character/ch0100732","main":true},{"actorName":"Mildred Natwick","urlProfile":"http://www.imdb.com/name/nm0622450","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMzAwNDMyMF5BMl5BanBnXkFtZTcwNzg2NTMxOA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1905","placeOfBirth":" Baltimore, Maryland, USA","bio":"A disarming character lady quite capable of scene-stealing, Mildred Natwick was a well-rounded talent with distinctively dowdy features and idiosyncratic tendencies who, over a six-decade period, assembled together a number of unforgettable matrons on stage and (eventually) film and TV. Whimsical, feisty, loony, stern, impish, shrewish, quizzical, scheming -- she greatly enhanced both comedies and dramas and, thankfully, her off-centered greatness was captured perfectly on occasion by such film directors as John Ford, Alfred Hitchcock and Neil Simon. A short, plumpish, oval-eyed figure with a unique flowery, honey-glazed voice, Natwick was born on June 19, 1905 (some sources list 1908) to Joseph (a businessman) and and Mildred Marion Dawes Natwick. The Baltimore native graduated from both the Bryn Mawr School (in Baltimore) and also from Bennett College in Dutchess County, N.Y., where she majored in drama. Breaking into the professional field touring on stage, Miss Natwick joined the Vagabonds in the late 1920s, a non-professional group from Baltimore. She later became part of the renowned University Players at Cape Cod, Massachusetts, whose rising performers at the time included Henry Fonda, Margaret Sullavan and James Stewart. Natwick made her Broadway bow in the 1932 melodrama \"Carry Nation,\" directed by Blanche Yurka with Esther Dale in the title role. In the cast was Joshua Logan, whom she befriended and later corroborated with when he turned director. She then continued her momentum on 1930s Broadway with \"Amourette\" (1933), \"Spring in Autumn\" (1933), \"The Wind and the Rain\" (1934), \"The Distaff Side\" (1934) \"End of Summer\" (1936), \"Love from a Stranger\" (1936), \"The Star-Wagon\" (1937), \"Missouri Legend\" (1938), \"Stars in Your Eyes\" (1939) (directed by Logan), and \"Christmas Eve\" (1939). Natwick did not come to films until middle age (35) with the John Ford classic The Long Voyage Home (1940), in which she played a Cockney floozie. Despite her fine work in this minor part, she did not make another film until her landlady role five years later in The Enchanted Cottage (1945) supporting Dorothy McGuire and Robert Young. Not a great beauty by Hollywood standards, Natwick learned quickly in Hollywood that if she were to succeed, it would be as a character performer. Ford himself picked up on her versatility and used her repeatedly in several of his post-war classics -- 3 Godfathers (1948), She Wore a Yellow Ribbon (1949), and The Quiet Man (1952). Never abandoning the theater for long, Natwick excelled as Miss Garnett in George Bernard Shaw's \"Candida\" and as the buoyant medium in Noël Coward's \"Blithe Spirit\". As for the big screen, she was sporadically seen in such films as Yolanda and the Thief (1945), The Late George Apley (1947), A Woman's Vengeance (1948), The Kissing Bandit (1948), Cheaper by the Dozen (1950) and Against All Flags (1952). Making use of even the tiniest of roles, none of them did much to improve her stature in Hollywood. With her delicious turn, however, in Hitchcock's eccentric black comedy The Trouble with Harry (1955), which starred Shirley MacLaine (in her film debut), John Forsythe, Kris Kringle's Edmund Gwenn, little Jerry Mathers (of \"Leave It to Beaver\"), and another famous Mildred, Mildred Dunnock, Natwick enjoyed one of her best roles ever on film. This was followed by her scheming and furtive sorceress in the Danny Kaye vehicle The Court Jester (1955) in which she, Kaye and Glynis Johns participate in the memorable tongue-twisting \"The pellet with the poison's in the vessel with the pestle...\" comedy routine. This, in turn, led to a couple of more, albeit lesser, films, including Teenage Rebel (1956) and Tammy and the Bachelor (1957). Preferring the theatre to movies, MIldred received her first Tony nomination for her sharp, astute work in Jean Anouilh's \"Waltz of the Toredors\" in 1957 and recreated her character in a TV special. She seemed to move effortlessly from the classics (\"Medea,\" \"Coriolanus\") to chic comedy (\"Ladies in Retirement,\" \"The Importance of Being Earnest\"). Receiving great applause as the beleaguered, overly-winded mother in Neil Simon's \"Barefoot in the Park\" on Broadway in 1963, she transferred the role to film four years later. The cinematic Barefoot in the Park (1967) earned Mildred a well-deserved Oscar nomination for \"best supporting actress\". She switched things up again with Harold Pinter's theatrical \"Landscape,\" and then again in 1971 when she made her debut in a singing role in the John Kander-Fred Ebb musical, \"70, Girls, 70\" (1971) in which she earned a second Tony nomination. Her last Broadway show came as a replacement in \"Bedroom Farce\" in 1979. With only the slightest of gesture, look or tone of voice, Mildred's characters could speak volumes and she became an essential character player during the 1970s as an offbeat friend, relative or elderly on TV and film. She was awarded the Emmy for her playing of one of The Snoop Sisters (1972)_ alongside the equally delightful Helen Hayes in the short-lived TV series. Both played impish Jessica Fletcher-type mystery writers who solve real crimes on the sly. She also played Rock Hudson's quirky mother in McMillan & Wife (1971) and a notable dying grandmother in a guest appearance of the critically-lauded TV series drama Family (1976). Her final film came with a small regal role as Madame de Rosemonde in Dangerous Liaisons (1988) with Glenn Close, John Malkovich and Michelle Pfeiffer. Never married, Mildred was called \"Milly\" by close friends and family and was the first cousin of Myron 'Grim' Natwick, the creator of Betty Boop for the Max Fleischer cartoon studio and prime animator for Disney's Snow White character. She died of cancer at age 89 in New York City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMzAwNDMyMF5BMl5BanBnXkFtZTcwNzg2NTMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0622450","name":"Mildred Natwick","nicknames":["Milly"],"idIMDB":"nm0622450"},"actorId":"nm0622450","character":"Grand Duchess Olga Katrina","urlCharacter":"http://www.imdb.com/character/ch0021302","main":true},{"actorName":"Tim Reid","urlProfile":"http://www.imdb.com/name/nm0005347","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzcxNDk3ODIyNl5BMl5BanBnXkFtZTYwODE4MDc2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 December 1944","placeOfBirth":" Norfolk, Virginia, USA","birthName":"Timothy Lee Reid","height":"6' 2\" (1.88 m)","bio":"Tim Reid was born December 19, 1944 in Norfolk, Virginia and came from a troubled, impoverished childhood. He straightened out his life enough to attend Norfolk State College (now University) and graduate with a business administration degree. He worked for Du Pont in Chicago for a period of time in the late 60s and married his first wife Rita, whom he met at college. They had two children, Tim Reid II (born 1968) and Tori Reid (born 1971); both are currently involved in entertainment. His first taste of the limelight came around the turn of the 70s when he met an insurance agent named Tom Dreesen, and the two of them decided to form a nightclub act called \"Tim and Tom\". Within six years, both the team and his first marriage had dissolved. At this juncture, Tim decided to focus completely on acting, took up drama classes, and worked as a comic. TV and commercial work started coming his way, finding regular placements on a number of variety series that starred Frankie Avalon, The 5th Dimension singers Marilyn McCoo and Billy Davis Jr., and Richard Pryor in the late 70s. His biggest break, however, came after nabbing the cool and very hip role of \"Venus Flytrap\" on TV's WKRP in Cincinnati (1978). It is this radio disc jockey character for which Tim is still best known. Other TV series came his way, including Simon & Simon (1981) as Lt. Marcel \"Downtown\" Brown. Once firmly established, Tim started taking more control over his career. After fronting a number of series including Frank's Place (1987), Snoops (1989) and, most notably, Sister, Sister (1994), he and wife, Daphne Reid, co-founded their own production studio (New Millenium Studios), the first ever built in his native state of Virginia. The short-lived program Linc's (1998), starring both Tim and Daphne, was the first to come out of the studio. Over the years, Daphne has been a frequent partner to Tim both in front and behind the camera lens, as actress and co-producer. Toning down his slick facade over the years, the handsome, mustachioed actor has dedicated himself to films and other projects that have raised social issues as well as increase black awareness. More recently, in 2002, he released his film For Real (2003), which was made at his studio. It took an updated African-American spin on the \"Pygmalion\" story and starred Tim in the \"Henry Higgins\" role. The film opened the fifth anniversary of the Hollywood Black Film Festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzcxNDk3ODIyNl5BMl5BanBnXkFtZTYwODE4MDc2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005347","name":"Tim Reid","idIMDB":"nm0005347"},"actorId":"nm0005347","character":"Donald","urlCharacter":"http://www.imdb.com/character/ch0100744","main":true},{"actorName":"Eugene Roche","urlProfile":"http://www.imdb.com/name/nm0733929","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwOTgzMjg0MF5BMl5BanBnXkFtZTcwNjA4NTgyMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 September 1928","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Eugene Harrison Roche","bio":"Adept at both comedy and drama, character player Eugene Roche (sometimes billed as Gene Roche) had an extensive four-decade career. Born in Depression-era Boston the son of a Navy man, the moon-faced, intent-looking Roche started on radio at age 15 displaying his knack for character voices, both men and women. He enlisted in the U.S. Army following high school, then studied at Emerson College. Searching for work in summer stock and variety shows, he appeared in productions of \"Pal Joey\" with Bob Fosse and \"Point of No Return\" with Henry Fonda. Newly married at this time, he found classical stage parts to play in early 50s San Francisco, then headed for New York and began appearing in dramatic TV shows and commercials. He made his Broadway debut with \"Blood, Sweat and Stanley Poole\" starring Darren McGavin and went on to do \"The White House\" with Helen Hayes and \"Mother Courage\" with Anne Bancroft. Comedy became his forte on TV with showy recurring roles on Soap (1977),Night Court (1984), and Perfect Strangers (1986), while choice support parts came his way on film, including The Late Show (1977) and Foul Play (1978) -- some roles cantankerous, some lovable, some menacing. The father of nine children, three of his male offspring have opted for entertainment careers: Eamonn Roche and Brogan Roche are actors, and Sean Roche is an Emmy award-winning writer and producer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwOTgzMjg0MF5BMl5BanBnXkFtZTcwNjA4NTgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0733929","name":"Eugene Roche","idIMDB":"nm0733929"},"actorId":"nm0733929","character":"Paul Sycamore","urlCharacter":"http://www.imdb.com/character/ch0021306","main":true},{"actorName":"Paul Sand","urlProfile":"http://www.imdb.com/name/nm0761190","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNDY4MjYzMl5BMl5BanBnXkFtZTcwMTY5MzAyOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 March 1935","placeOfBirth":" Santa Monica, California, USA","birthName":"Paul Sanchez","height":"6' (1.83 m)","bio":"Paul Sand was born on March 5, 1935 in Santa Monica, California, USA as Paul Sanchez. He is an actor, known for The Main Event (1979), Chuck & Buck (2000) and The Hot Rock (1972).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNDY4MjYzMl5BMl5BanBnXkFtZTcwMTY5MzAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0761190","name":"Paul Sand","idIMDB":"nm0761190"},"actorId":"nm0761190","character":"Ed Carmichael","urlCharacter":"http://www.imdb.com/character/ch0021308","main":true},{"actorName":"Joyce Van Patten","urlProfile":"http://www.imdb.com/name/nm0887696","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI1MzMzNDIzNF5BMl5BanBnXkFtZTcwOTkwOTMyNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 March 1934","placeOfBirth":" New York City, New York, USA","birthName":"Joyce Benignia Van Patten","bio":"Adept at both comedy and drama, veteran actress Joyce Van Patten was born in New York City. Prodded by a typically assertive stage mother, Joyce and her equally famous older brother Dick Van Patten displayed natural talent and did quite well for themselves at an early age. Joyce was auditioning for modeling roles before reaching her first birthday, and by age eight, was appearing on radio and on Broadway in \"Love's Old Sweet Song\" by William Saroyan. One year later, she and Dick had bit roles in the film Reg'lar Fellers (1941) and appeared together in the play \"The Wind Is Ninety\" (1945). Following a relatively brief marriage to Thomas King at the age of 16 and the birth of their son Casey King a year later, Joyce grew into young adult roles and found parts in a number of popular plays including \"The Desk Set\" (1955) and \"A Hole in the Head\" (1957). She appeared with Dick in New York in \"The Male Animal\" (1953), \"The Tender Trap\" (1955), and \"Oh Men! Oh Women! (1955). Joyce downplayed her beauty for smart, cynical, earthier characters and specialized in wry comedy. Some of her other notable film appearances were in Fourteen Hours (1951), The Goddess (1958), I Love You, Alice B. Toklas! (1968), and Making It (1971), which also featured her brother Dick. Her career in television began to flourish with appearances on the TV daytime dramas As the World Turns (1956) and Young Dr. Malone (1958), The Danny Kaye Show (1963) for four seasons, The Good Guys (1968) for two seasons, and The Mary Tyler Moore Hour (1979) for one season, in addition to countless guest appearances on other comedy and drama series such as Judging Amy (1999), Desperate Housewives (2004), and The Good Wife (2009). Joyce has also been a wonderful presence in a number of popular shows on Broadway stage, including: \"Spoon River Anthology\". \"Same Time, Next Year\", \"I Oughta Be in Pictures\", \"The Supporting Cast\", \"Brighton Beach Memoirs\", \"Rumors\", \"Jake's Women\", \"Ring Round the Moon\" (1999), \"Taller Than a Dwarf\" (2000), \"Harvey\" (2003), \"The Oldest Profession\" (2004), and \"Rabbit Hole\" (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI1MzMzNDIzNF5BMl5BanBnXkFtZTcwOTkwOTMyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0887696","name":"Joyce Van Patten","idIMDB":"nm0887696"},"actorId":"nm0887696","character":"Miss Wellington","urlCharacter":"http://www.imdb.com/character/ch0100739","main":true}],"seasons":[],"idIMDB":"tt0195426","urlIMDB":"http://www.imdb.com/title/tt0195426","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 37 min (97 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["Video"],"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.4","filmingLocations":[],"awards":[{"award":"Primetime Emmy Awards 1979","titlesAwards":[{"titleAwardOutcome":"Won Primetime Emmy","categories":[{"category":"Outstanding Achievement in Lighting Direction (Electronic)","names":[{"name":"George Riesenberger","id":"nm0726350","role":"lighting consultant/lighting designer"},{"name":"Roy Barnett","id":"nm0055972","role":"director of photography 'E'"}]}]},{"titleAwardOutcome":"Nominated Primetime Emmy","categories":[{"category":"Outstanding Achievement in Technical Direction and Electronic Camerawork","names":[{"name":"Robert Jones","id":"nm0429141","role":"technical director"},{"name":"Barry Brown","id":"nm0113080","role":"cameraperson"},{"name":"Larry Heider","id":"nm0373962","role":"cameraperson"},{"name":"Wayne Orr","id":"nm0650623","role":"cameraperson"},{"name":"Hank Geving","id":"nm0315353","role":"cameraperson"},{"name":"Diane Biederbeck","id":"nm0081295","role":"cameraperson"},{"name":"Richard Price","id":"nm0696869","role":"cameraperson"},{"name":"Tom Karnowski","id":"nm1215545","role":"cameraperson"},{"name":"David Levisohn","id":"nm0506133","role":"cameraperson"}]}]}]}],"votes":"38","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0005035","name":"Warner Bros. Television"}],"keywords":{"keywords":["based on play"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 03:30:07"}}