{"data":{"movies":[{"title":"Ned Kelly","originalTitle":"","year":"2003","releaseDate":"20040326","directors":[{"name":"Gregor Jordan","id":"nm0429964"}],"writers":[{"name":"Robert Drewe","id":"nm0237722"},{"name":"John Michael McDonagh","id":"nm0567620"}],"runtime":"110 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmVjYzRkYjItODlmZS00OTEzLTliZjItYjMwOGRmMzhmY2RmXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1.jpg","countries":["Australia","UK","USA","France"],"languages":["English"],"genres":["Action","Adventure","Biography","Crime","History","Romance","Western"],"plot":"Though recognized for heroism as a lad, Ned Kelly can not escape the stigma of being the eldest of a brood sired by a known criminal. In days when an arrest equaled guilt and a conviction, his unfair imprisonment for horse thievery puts him steadfast, in the eyes of Victorian police, on the wrong side of things for life. With a sister unable to dissuade the unwanted advances of Constable Fitzpatrick, Ned, his brother Dan, and friends Joe Byrne and Steve Hart soon find themselves labeled \"an outlaw gang\" by the less-than-honorable constable. It's a designation they're apt to live up to after Ned's mother is unfairly arrested and sentenced to three years hard labor. In retaliation, the Kelly Gang strikes out against the oppressive Victorian government, with ultimately tragic results and passage into Australian folklore.","simplePlot":"An innocent man becomes one of the most wanted criminals the world has ever known.","actors":[{"actorName":"Heath Ledger","urlProfile":"http://www.imdb.com/name/nm0005132","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NTY0NzA4MF5BMl5BanBnXkFtZTYwMjE1MDE0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1979","placeOfBirth":" Perth, Western Australia, Australia","birthName":"Heath Andrew Ledger","height":"6' 1\" (1.85 m)","bio":"When hunky, twenty-year-old heart-throb Heath Ledger first came to the attention of the public in 1999, it was all too easy to tag him as a \"pretty boy\" and an actor of little depth. He spent several years trying desperately to sway this image, but this was a double-edged sword. Heath Ledger was born on the fourth of April 1979, in Perth, Western Australia, to Sally (Ramshaw), a teacher of French, and Kim Ledger, a mining engineer who also raced cars. As the story goes, in junior high school it was compulsory to take one of two electives, either cooking or drama. As Heath could not see himself in a cooking class he tried his hand at drama. Heath was talented, however the rest of the class did not acknowledge his talent. When he was seventeen he and a friend decided to pack up, leave school, take a car and rough it to Sydney. Heath believed Sydney to be the place where dreams were made or, at least, where actors could possibly get their big break. Upon arriving in Sydney with a purported sixty-nine cents to his name, Heath tried everything to get a break. His first real acting job came in a low-budget movie called Blackrock (1997), a largely unimpressive cliché; an adolescent angst film about one boy's struggle when he learns his best mate raped a girl. He only had a very small role in the film. After that small role Heath auditioned for a role in a T.V. show called Sweat (1996) about a group of young Olympic hopefuls. He was offered one of two roles, one as a swimmer, another as a gay cyclist. Heath accepted the latter because he felt to really stand out as an actor one had to accept unique roles that stood out from the bunch. It got him small notice, but unfortunately the show was quickly axed, forcing him to look for other roles. He was in Summer Bay (1988) for a very short period, in which he played a surfer who falls in love with one of the girls of Summer Bay. Then came his very brief role in Paws (1997), a film which existed solely to cash in on guitar prodigy Nathan Cavaleri's brief moment of fame, where he was the hottest thing in Australia. Heath played a student in the film, involved in a stage production of a Shakespeare play, in which he played \"Oberon\". A very brief role, this offered him a small paycheck but did nothing to advance his career. Then came Two Hands (1999). He went to the U.S. trying to audition for film roles, showcasing his brief role in Roar (1997) opposite then unknown Vera Farmiga. Then Australian director Gregor Jordan auditioned him for the lead in Two Hands (1999), which he got. An in your face Aussie crime thriller, Two Hands (1999) was outstanding and helped him secure a role in 10 Things I Hate About You (1999). After that, it seemed Heath was being typecast as a young hunk, which he did not like, so he accepted a role in a very serious war drama The Patriot (2000). What followed was a stark inconsistency of roles, Ledger accepting virtually every single character role, anything to avoid being typecast. Some met with praise, like his short role in Monster's Ball (2001), but his version of Ned Kelly (2003) was an absolute flop, which led distributors hesitant to even release it outside Australia. Heath finally had deserved success with his role in Brokeback Mountain (2005), for which he was nominated for an Oscar and a B.A.F.T.A. Ledger was found dead on January 22, 2008 in his apartment in the Manhattan neighborhood of SoHo, with a bottle of prescription sleeping pills near-by. It was concluded weeks later that he died of an accidental overdose of prescription drugs that included pain-killers, sleeping pills and anti-anxiety medication. After his death he received more than thirty posthumous awards for his portrayal as the psychopathic clown prince of crime in The Dark Knight (2008) (including the Oscar, S.A.G., B.A.F.T.A., and Golden Globe)","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NTY0NzA4MF5BMl5BanBnXkFtZTYwMjE1MDE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005132","name":"Heath Ledger","nicknames":["Heathy"],"idIMDB":"nm0005132"},"actorId":"nm0005132","character":"Ned Kelly","urlCharacter":"http://www.imdb.com/character/ch0027945","main":true},{"actorName":"Orlando Bloom","urlProfile":"http://www.imdb.com/name/nm0089217","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDkxMjQ3NV5BMl5BanBnXkFtZTcwMzQ3Mjc4MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 January 1977","placeOfBirth":" Canterbury, Kent, England, UK","birthName":"Orlando Jonathan Blanchard Bloom","height":"5' 11\" (1.8 m)","bio":"Orlando Jonathan Blanchard Bloom was born in Canterbury, Kent, England on January 13, 1977. His mother, Sonia Constance Josephine (Copeland), was born in Kolkata, India, to an English family then-resident there. The man he briefly knew as his father, Harry Bloom, was a legendary political activist who fought for civil rights in South Africa. But Harry died of a stroke when Orlando was only four years old. After that, Orlando and his older sister, Samantha Bloom, were raised by their mother and family friend, Colin Stone. When Orlando was thirteen, Sonia revealed to him that Colin is actually the biological father of Orlando and his sister; the two were conceived after an agreement by his parents, since Harry was then-unable to have children. Orlando attended St. Edmunds School in Canterbury but struggled in many courses because of dyslexia. He did embrace the arts, however, and enjoyed pottery, photography and sculpturing. He also participated in school plays and was active at his local theater. As a teen, Orlando landed his first job: he was a clay trapper at a pigeon shooting range. Encouraged by his mother, he and his sister began studying poetry and prose, eventually giving readings at Kent Festival. Orlando and Samantha won many poetry and Bible reciting competitions. Then Orlando, who always idolized larger-than-life characters, gravitated towards serious acting. At the age of 16, he moved to London and joined the National Youth Theatre, spending two seasons there and gaining a scholarship to train with the British American Drama Academy. Like many young actors, he also auditioned for a number of television roles to further his career, landing bit parts in British television shows Casualty (1986), Midsomer Murders (1997) and Smack the Pony (1999). He also appeared in the critically acclaimed movie Wilde (1997). He then attended the Guildhall School of Music and Drama. It was there, in 1998, that Orlando fell three stories from a rooftop terrace and broke his back. Despite fears that he would be permanently paralyzed, he quickly recovered and returned to the stage. As fate would have it, seated in the audience one night in 1999 was a director named Peter Jackson. After the show, he met with Orlando and asked him to audition for his new set of movies. After graduating from Guildhall, Orlando began work on the \"Lord of the Rings\" trilogy, spending 18 months in New Zealand bringing to life \"Legolas\", a part which made him a household name. Today, he is one of the busiest and most sought-after actors in the industry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDkxMjQ3NV5BMl5BanBnXkFtZTcwMzQ3Mjc4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0089217","name":"Orlando Bloom","nicknames":["Orli","OB"],"idIMDB":"nm0089217"},"actorId":"nm0089217","character":"Joseph Byrne","urlCharacter":"http://www.imdb.com/character/ch0048145","main":true},{"actorName":"Geoffrey Rush","urlProfile":"http://www.imdb.com/name/nm0001691","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MjkxNDU0NV5BMl5BanBnXkFtZTcwOTk3MDQ0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1951","placeOfBirth":" Toowoomba, Queensland, Australia","birthName":"Geoffrey Roy Rush","height":"5' 11½\" (1.82 m)","bio":"Geoffrey Roy Rush was born on July 6, 1951, in Toowoomba, Queensland, Australia, to Merle (Bischof), a department store sales assistant, and Roy Baden Rush, an accountant for the Royal Australian Air Force. His mother was of German descent and his father had English, Irish, and Scottish ancestry. He was raised in Brisbane, Queensland, after his parents split up. Rush attended Everton Park State High School during his formative years. His early interest in the theatre led to his 1971 stage debut at age 20 in \"Wrong Side of the Moon\" with the Queensland Theatre Company. Known for his classical repertory work over the years, he scored an unexpected hit with his Queensland role as Snoopy in the musical \"You're a Good Man, Charlie Brown\". A few years later he moved to France to study but subsequently returned to his homeland within a short time and continued work as both actor and director with the Queensland company (\"June and the Paycock,\" \"Aladdin,\" \"Godspell,\" \"Present Laughter,\" \"The Rivals\"). In the 1980s Rush became a vital member of the State Theatre Company of South Australia and showed an equally strong range there in such productions as \"Revenger's Tragedy,\" \"A Midsummer Night's Dream,\" \"Mother Courage...and Her Children,\" \"Blood Wedding,\" \"Pal Joey,\" \"Twelfth Night\" and as The Fool in \"King Lear\". Rush made an inauspicious debut in films with the feature Hoodwink (1981), having little more than a bit part, and didn't carry off his first major role until playing Sir Andrew Aguecheek in a movie production of Twelfth Night (1987). Yet, he remained a durable presence on stage with acclaimed productions in \"The Diary of a Madman\" in 1989 and \"The Government Inspector\" in 1991. Rush suffered a temporary nervous breakdown in 1992 due to overwork and anguish over his lack of career advancement. Resting for a time, he eventually returned to the stage. Within a few years film-goers finally began taking notice of Geoffrey after his performance in Children of the Revolution (1996). This led to THE role of a lifetime as the highly dysfunctional piano prodigy David Helfgott in Shine (1996). Rush's astonishing tour-de-force performance won him every conceivable award imaginable, including the Oscar, Golden Globe, British Film Award and Australian Film Institute Award. \"Shine\" not only put Rush on the international film map, but atypically on the Hollywood \"A\" list as well. His rather homely mug was made fascinating by a completely charming, confident and captivating demeanor; better yet, it allowed him to more easily dissolve into a number of transfixing historical portrayals, notably his Walsingham in Elizabeth (1998), Marquis de Sade in Quills (2000), and Leon Trotsky in Frida (2002). He's also allowed himself to have a bit of hammy fun in such box office escapism as Mystery Men (1999), House on Haunted Hill (1999), The Banger Sisters (2002), Finding Nemo (2003) and Pirates of the Caribbean: The Curse of the Black Pearl (2003). More than validating his early film success, two more Oscar nominations came his way in the same year for Quills (2000) (best actor) and Shakespeare in Love (1998) (support actor) in 2000. Geoffrey's amazing versatility continues to impress, more recently as the manic, volatile comedy genius Peter Sellers in the biopic The Life and Death of Peter Sellers (2004). Rush's intermittent returns to the stage have included productions of \"Marat-Sade,\" \"Uncle Vanya,\" \"Oleanna,\" \"Hamlet\" and \"The Small Poppies\". In 2009 he made his Broadway debut in \"Exit the King\" co-starring Susan Sarandon. His marriage (since 1988) to Aussie classical actress Jane Menelaus produced daughter Angelica (1992) and son James (1995). Menelaus, who has also performed with the State Theatre of South Australia, has co-starred on stage with Rush in \"The Winter's Tale\" (1987), \"Troilus and Cressida\" (1989) and \"The Importance of Being Earnest\" (as Gwendolyn to his Jack Worthing). She also had a featured role in his film Quills (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MjkxNDU0NV5BMl5BanBnXkFtZTcwOTk3MDQ0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001691","name":"Geoffrey Rush","idIMDB":"nm0001691"},"actorId":"nm0001691","character":"Superintendent Francis Hare","urlCharacter":"http://www.imdb.com/character/ch0048154","main":true},{"actorName":"Naomi Watts","urlProfile":"http://www.imdb.com/name/nm0915208","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMjY1NTA4OF5BMl5BanBnXkFtZTcwNjk3MDYwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 September 1968","placeOfBirth":" Shoreham, Kent, England, UK","birthName":"Naomi Ellen Watts","height":"5' 4½\" (1.64 m)","bio":"Naomi Ellen Watts was born on September 28, 1968 in Shoreham, England, to Myfanwy Edwards \"Miv\" (Roberts), an antiques dealer and costume/set designer, and Peter Watts (Peter Anthony Watts), the road manager to Pink Floyd. Her maternal grandfather was Welsh. Her father died when Naomi was seven and she began to follow her mother and her brother around England, until she was fourteen, when they settled in Australia, where her maternal grandmother was from. She coaxed her mother into letting her take acting class when they arrived. After bit parts in commercials, she landed her first role in For Love Alone (1986). Naomi met her best friend, Nicole Kidman, when they both auditioned for a bikini commercial and they shared a taxi ride home. In 1991, Naomi starred along Kidman in the sleeper-hit Flirting (1991) directed by John Duigan. Naomi continued her career by starring in the Australian Brides of Christ (1991) co-starring Oscar-winners Russell Crowe and Brenda Fricker. In 1993, she worked with John Duigan again in Wide Sargasso Sea (1993) and director George Miller in Gross Misconduct (1993). Tank Girl (1995), in 1995, an adaptation of the comic book was a cult hit, starred Naomi as \"Jet Girl\", but it didn't fare well at the box-office and didn't do much for her career as a whole. Watts continued to take insignificant parts in movies including the much forgotten film Children of the Corn: The Gathering (1996). It wasn't until David Lynch cast her in the critically acclaimed film Mulholland Drive (2001) that she began to become noticed. Her part as an aspiring actress showed her strong acting ability and wide range and earned her much respect, as much as to say by some that she was overlooked for a Oscar nomination that year. Stardom finally came to Naomi in the surprise hit The Ring (2002), which grossed over $100,000,000 at the box-office and starred Watts as a investigative reporter hunting down the truth behind several mysterious deaths seemingly caused by a video tape. While the movie did not fare well with the critics, it launched her into the spotlight. In 2003, she starred in Alejandro González Iñárritu's 21 Grams (2003) which earned her - what some say is a much overdue Oscar nomination and brought others to call her one of the best in her generation of actors. The same year, she was nominated for 21 Grams (2003), Naomi was chosen to play \"Ann Darrow\" in director Peter Jackson's King Kong (2005) which took her to New Zealand for a five month shoot. Watts completed her first comedy in I Heart Huckabees (2004) for director David O. Russell, playing a superficial spokes model - a break from her usual intense and dramatic roles she is known for. In 2005, she reprized her role as the protective-mother-reporter \"Rachel Keller\" in The Ring Two (2005). The movie, released in March, opened to $35,000,000 at the box office in the first weekend and established her as a box-office draw. Also in 2005, it was decided that her independent movie Ellie Parker (2001) would be re-released in late 2005 after its success at resurfacing at the Sundance Film Festival. The movie, which Naomi also produced, features her in the title role and is a bit biographical, but yet exaggerated take of the life of a struggling actress as she comes to Hollywood and encounters nightmares of the profession (it also features Watts' own beat-up Honda which she travels around in). In 2006, she starred with Edward Norton in Le voile des illusions (2006). In July of 2007, Naomi gave birth to a boy, Alexander Pete (Sasha Schreiber) in Los Angeles with Liev Schreiber. Since then her career choices have gathered even more critical acclaim with starring roles roles in German director Michael Haneke's American remake of his thriller Funny Games (2007), David Cronenberg's Eastern Promises (2007), and the action-thriller, The International (2009), released in February 2009. In mid-2008, Watts announced she was expecting her second child with Schreiber and gave birth to another boy, Samuel Kai Schreiber, in New York on December 13.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMjY1NTA4OF5BMl5BanBnXkFtZTcwNjk3MDYwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0915208","name":"Naomi Watts","nicknames":["Queen of Remakes"],"idIMDB":"nm0915208"},"actorId":"nm0915208","character":"Julia Cook","urlCharacter":"http://www.imdb.com/character/ch0047966","main":true},{"actorName":"Joel Edgerton","urlProfile":"http://www.imdb.com/name/nm0249291","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0ODI1ODk4NzdeQTJeQWpwZ15BbWU3MDkwNjkzOTY@._V1._SX214_SY317_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 June 1974","placeOfBirth":" Blacktown, New South Wales, Australia","height":"5' 11\" (1.8 m)","bio":"Joel Edgerton was born on June 23, 1974 in Blacktown, New South Wales, Australia, to Marianne and Michael Edgerton, who is a solicitor and property developer. His brother is filmmaker Nash Edgerton. He went to Hills Grammar School in the Western Suburbs of Sydney, and after leaving, he attended Nepean Drama School in 1994. Joel has done many projects on stage and off, but most people will recognize him from his work on the Australian television series The Secret Life of Us (2001), in which he played William McGill. This gave him his first big break through in the television industry. For this role, he was nominated in 2001 for an AFI Award. As well as \"The Secret Life of Us\", he has also appeared in other television projects such as The Three Stooges (2000), Dossa and Joe (2002), Secret Men's Business (1999), Never Tell Me Never (1998) and Saturn's Return (2001). Joel has done a lot of work on the theatrical stage having played King Henry in \"Henry V\", Prince Hal in \"Henry III\", and others including \"Road\", \"Third World Blues\" and \"Dead White Males\". As well as acting, he has also starred, co-written and produced the short movie Bloodlock (1998). His first international break came from when he played Uncle Owen Lars in Star Wars: Episode II - Attack of the Clones (2002). Since then, he has also starred in Ned Kelly (2003), King Arthur (2004), Star Wars: Episode III - Revenge of the Sith (2005) and Kinky Boots (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0ODI1ODk4NzdeQTJeQWpwZ15BbWU3MDkwNjkzOTY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0249291","name":"Joel Edgerton","idIMDB":"nm0249291"},"actorId":"nm0249291","character":"Aaron Sherritt","urlCharacter":"http://www.imdb.com/character/ch0048149","main":true},{"actorName":"Laurence Kinlan","urlProfile":"http://www.imdb.com/name/nm0455663","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MjYwNTAzN15BMl5BanBnXkFtZTcwOTg4MjgzNw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 February 1983","placeOfBirth":" Dublin, Ireland","height":"5' 7\" (1.7 m)","bio":"Laurence Kinlan was born on February 3, 1983 in Dublin, Ireland. He is an actor, known for L'Irlandais (2011), Ned Kelly (2003) and Breakfast on Pluto (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MjYwNTAzN15BMl5BanBnXkFtZTcwOTg4MjgzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0455663","name":"Laurence Kinlan","idIMDB":"nm0455663"},"actorId":"nm0455663","character":"Dan Kelly","urlCharacter":"http://www.imdb.com/character/ch0048147","main":true},{"actorName":"Philip Barantini","urlProfile":"http://www.imdb.com/name/nm0053028","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYzODAzODAxN15BMl5BanBnXkFtZTgwNTc5NjkyNTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 July 1980","placeOfBirth":" Liverpool, England, UK","height":"5' 9\" (1.75 m)","bio":"Philip Barantini was born on July 13, 1980 in Liverpool, England. He is an actor and producer, known for Ned Kelly (2003), Dream Team (1997) and Band of Brothers (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYzODAzODAxN15BMl5BanBnXkFtZTgwNTc5NjkyNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0053028","name":"Philip Barantini","nicknames":["Baras or P. Teeny"],"idIMDB":"nm0053028"},"actorId":"nm0053028","character":"Steve Hart","urlCharacter":"http://www.imdb.com/character/ch0048148","main":true},{"actorName":"Kerry Condon","urlProfile":"http://www.imdb.com/name/nm0174403","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NjgyNDU3OV5BMl5BanBnXkFtZTgwNzA4NDczNjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 January 1983","placeOfBirth":" Tipperary, Ireland","bio":"Kerry Condon was born on January 4, 1983 in Tipperary, Ireland. She is an actress, known for Unleashed (2005), Intermission (2003) and Avengers: Age of Ultron (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NjgyNDU3OV5BMl5BanBnXkFtZTgwNzA4NDczNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0174403","name":"Kerry Condon","idIMDB":"nm0174403"},"actorId":"nm0174403","character":"Kate Kelly","urlCharacter":"http://www.imdb.com/character/ch0048151","main":true},{"actorName":"Kris McQuade","urlProfile":"http://www.imdb.com/name/nm0574296","urlPhoto":"","biography":{"dateOfBirth":"1952","placeOfBirth":" Coffs Harbour, New South Wales, Australia","bio":"Kris McQuade was born in 1952 in Coffs Harbour, New South Wales, Australia. She is known for her work on Ballroom Dancing (1992), Ned Kelly (2003) and Skyways (1979).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0574296","name":"Kris McQuade","idIMDB":"nm0574296"},"actorId":"nm0574296","character":"Ellen Kelly","urlCharacter":"http://www.imdb.com/character/ch0499719","main":true},{"actorName":"Emily Browning","urlProfile":"http://www.imdb.com/name/nm0115161","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NzgzMjgwMF5BMl5BanBnXkFtZTcwODYzNDc1Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 December 1988","placeOfBirth":" Melbourne, Victoria, Australia","birthName":"Emily Jane Browning","height":"5' 2\" (1.57 m)","bio":"Australian actress Emily Browning was born in 1988 in Melbourne, Australia, to Shelley and Andrew Browning. She has two younger brothers. Her start in acting came after a classmate's father, involved in the acting business, noticed her \"acting all ditsy\" in a school play. Emily found an agent and was soon filming on location for the Hallmark TV-movie, The Echo of Thunder (1998). She received more roles from there, including parts in The Man Who Sued God (2001), opposite Billy Connolly, and Ned Kelly (2003), opposite Heath Ledger and Orlando Bloom. In that film, she had to hug Heath Ledger, and she said that all of her friends, who went to see the film, at the same time sent her a barrage of text messages about how lucky she was! Emily says she tries to avoid \"cheesy\" movies, and her big break came when she was on a press tour in LA for Ghost Ship (2002), that was filmed in Australia and released in America. In the same year, she won an Australian Film Institute Award for Best Young Actress, and was nominated for the same award, the next year. Emily received some scripts when she was in LA and sent in a video audition for A Series of Unfortunate Events (2004). She received a call and was asked to come to LA for a proper audition, which won her the part. She spent months in LA filming, for the second time acting opposite Billy Connolly. Emily said she enjoyed the experience of making a big budget film in America, and says that although she's not sure what is coming next, she's hoping to do some more Australian work.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NzgzMjgwMF5BMl5BanBnXkFtZTcwODYzNDc1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0115161","name":"Emily Browning","nicknames":["Em"],"idIMDB":"nm0115161"},"actorId":"nm0115161","character":"Grace Kelly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kiri Paramore","urlProfile":"http://www.imdb.com/name/nm0660924","urlPhoto":"","biography":{"bio":"Kiri Paramore is an actor, known for Ned Kelly (2003), Two Hands (1999) and Flirting (1991).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0660924","name":"Kiri Paramore","idIMDB":"nm0660924"},"actorId":"nm0660924","character":"Constable Fitzpatrick","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rachel Griffiths","urlProfile":"http://www.imdb.com/name/nm0341737","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3OTQzNzA0M15BMl5BanBnXkFtZTcwNTQ0ODkyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1968","placeOfBirth":" Melbourne, Victoria, Australia","height":"5' 9½\" (1.77 m)","bio":"Her mother, Anna Griffiths, is an art consultant. Her uncle is a Jesuit priest. Has two older brothers. One brother, Ben, is a ski instructor. Lived on the Gold Coast, Queensland until age five, then moved to Melbourne. Attended Star of the Sea Catholic Girls' College, did well at school and learned ballet. When she was 11, her father left home with an 18 year old woman. She hasn't seen him for years. Her mother was an art teacher at the time and raised the children alone. Has an Education Degree in dance and drama. Worked for the theatre company The Woolly Jumpers, in Geelong. Made famous by Muriel (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3OTQzNzA0M15BMl5BanBnXkFtZTcwNTQ0ODkyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0341737","name":"Rachel Griffiths","idIMDB":"nm0341737"},"actorId":"nm0341737","character":"Susan Scott","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Geoff Morrell","urlProfile":"http://www.imdb.com/name/nm0606255","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI5MDI3ODMwM15BMl5BanBnXkFtZTcwNDk4MDE2OA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 February 1958","placeOfBirth":" Sydney, New South Wales, Australia","bio":"Geoff Morrell was born on February 19, 1958 in Sydney, New South Wales, Australia. He is an actor, known for Ned Kelly (2003), Solitaire (2007) and Murder call, fréquence meurtre (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI5MDI3ODMwM15BMl5BanBnXkFtZTcwNDk4MDE2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0606255","name":"Geoff Morrell","idIMDB":"nm0606255"},"actorId":"nm0606255","character":"Robert Scott","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles 'Bud' Tingwell","urlProfile":"http://www.imdb.com/name/nm0863968","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTI2YmFmMmEtMzJiMC00NTczLTk0NjItOWMyMmI4Mjg1ZDE5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 January 1923","placeOfBirth":" Coogee, New South Wales, Australia","birthName":"Charles William Tingwell","height":"5' 9½\" (1.77 m)","bio":"Charles 'Bud' Tingwell was born on January 3, 1923 in Coogee, New South Wales, Australia as Charles William Tingwell. He was an actor and director, known for Homicide (1964), Emergency-Ward 10 (1957) and Breaker Morant (1980). He was married to Audrey Wilson. He died on May 15, 2009 in Melbourne, Victoria, Australia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTI2YmFmMmEtMzJiMC00NTczLTk0NjItOWMyMmI4Mjg1ZDE5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0863968","name":"Charles 'Bud' Tingwell","idIMDB":"nm0863968"},"actorId":"nm0863968","character":"Premier Graham Berry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Saskia Burmeister","urlProfile":"http://www.imdb.com/name/nm1044936","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMjQxMzMzNV5BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1985","placeOfBirth":" Australia","height":"5' 6½\" (1.69 m)","bio":"Saskia Burmeister was born on February 12, 1985 in Australia. She is an actress, known for Sea Patrol (2007), The Jammed (2007) and Ned Kelly (2003). She has been married to Jamie Croft since February 2008. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMjQxMzMzNV5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1044936","name":"Saskia Burmeister","idIMDB":"nm1044936"},"actorId":"nm1044936","character":"Jane Jones","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0277941","urlIMDB":"http://www.imdb.com/title/tt0277941","business":{"budget":null,"openingWeekend":[{"money":"$43,704","country":"USA","day":"28","month":"03","year":"2004","remarks":"22 Screens"},{"money":"£211,643","country":"UK","day":"28","month":"09","year":"2003","remarks":"213 Screens"}],"gross":[{"money":"$74,864","country":"USA","day":"04","month":"04","year":"2004","remarks":""},{"money":"$43,704","country":"USA","day":"28","month":"03","year":"2004","remarks":""},{"money":"£211,643","country":"UK","day":"28","month":"09","year":"2003","remarks":""},{"money":"$6,089,857","country":"Worldwide","day":"07","month":"11","year":"2003","remarks":"except USA"}],"weekendGross":[{"money":"$15,262","country":"USA","day":"04","month":"04","year":"2004","remarks":"18 Screens"},{"money":"$43,704","country":"USA","day":"28","month":"03","year":"2004","remarks":"22 Screens"},{"money":"£211,643","country":"UK","day":"28","month":"09","year":"2003","remarks":"213 Screens"}],"admissions":[],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"29","month":"04","year":"2002","remarks":null},null],"copyrightHolder":"Kelly Gang Films Pty Limited and Sunshine Films Limited"},"technical":{"runtime":["1 hr 50 min (110 min)"],"soundMix":["DTS","Dolby Digital"],"color":["Color (Cinevex)"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"6.5","metascore":"56","filmingLocations":[{"location":"Ballarat, Victoria, Australia"}],"rated":"R","awards":[{"award":"Australian Film Institute 2003","titlesAwards":[{"titleAwardOutcome":"Won AFI Award","categories":[{"category":"Best Production Design","names":[{"name":"Steven Jones-Evans","id":"nm0429497","role":null}]},{"category":"Best Costume Design","names":[{"name":"Anna Borghesi","id":"nm0096645","role":null}]}]},{"titleAwardOutcome":"Nominated AFI Award","categories":[{"category":"Best Direction","names":[{"name":"Gregor Jordan","id":"nm0429964","role":null}]},{"category":"Best Actor in a Leading Role","names":[{"name":"Heath Ledger","id":"nm0005132","role":null}]},{"category":"Best Actor in a Supporting Role","names":[{"name":"Orlando Bloom","id":"nm0089217","role":null}]},{"category":"Best Cinematography","names":[{"name":"Oliver Stapleton","id":"nm0822975","role":null}]},{"category":"Best Screenplay, Adapted from another Source","names":[{"name":"John Michael McDonagh","id":"nm0567620","role":null}]},{"category":"Best Editing","names":[{"name":"Jon Gregory","id":"nm0339856","role":null}]},{"category":"Best Sound","names":[{"name":"Gary Wilkins","id":"nm0929257","role":null},{"name":"Colin Miller","id":"nm0588124","role":null},{"name":"Adrian Rhodes","id":"nm0722376","role":null}]},{"category":"Best Achievement in Sound","names":[{"name":"Chris Burdon","id":"nm0121006","role":"re-recording mixer"},{"name":"De Lane Lea","id":null,"role":"post production company"}]}]}]},{"award":"Film Critics Circle of Australia Awards 2003","titlesAwards":[{"titleAwardOutcome":"Nominated FCCA Award","categories":[{"category":"Best Actor - Male","names":[{"name":"Heath Ledger","id":"nm0005132","role":null}]},{"category":"Best Supporting Actor - Male","names":[{"name":"Joel Edgerton","id":"nm0249291","role":null}]},{"category":"Best Screenplay - Adapted","names":[{"name":"John Michael McDonagh","id":"nm0567620","role":null}]},{"category":"Best Cinematography","names":[{"name":"Oliver Stapleton","id":"nm0822975","role":null}]}]}]},{"award":"IF Awards 2003","titlesAwards":[{"titleAwardOutcome":"Won IF Award","categories":[{"category":"Best Production Design","names":[{"name":"Steven Jones-Evans","id":"nm0429497","role":null}]}]},{"titleAwardOutcome":"Nominated IF Award","categories":[{"category":"Best Cinematography","names":[{"name":"Oliver Stapleton","id":"nm0822975","role":null}]}]}]},{"award":"Motion Picture Sound Editors, USA 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing in a Feature - Music - Feature Film","names":[{"name":"Gerard McCann","id":"nm0004216","role":"music editor"}]}]}]}],"votes":"22,323","type":"Movie","companyCreditsSimple":[{"idCompany":"co0002712","name":"Australian Film Commission, The"},{"idCompany":"co0023514","name":"Australian Film Finance Corporation (AFFC)"},{"idCompany":"co0054438","name":"Endymion Films"}],"keywords":{"keywords":["criminal","constable","police","horse","outlaw gang","arrest","ned kelly","outlaw","blood splatter","australia","new south wales","drinking blood","vengeance","steam engine","train station","irish music","sash","bulletproof vest","irish reel","marital infidelity","alibi","first person narration","bloody nose","reference to queen victoria","irish jig","monkey","mortgage","street brawl","police standoff","last stand","robbery","gun battle","revolver","flintlock rifle","musket","pistol","main character dies","main character shot","kissing while having sex","fistfight","gunfight","shootout at a train station","police shootout","sex in bed","opening action scene","australian western","villain arrested","villain played by lead actor","19th century","widow","watch","warrant","voice over narration","violence","underwater scene","twenty something","train","thief","stolen horse","stew","shooting a horse","saloon","revenge","rescue from drowning","rain","queen victoria colony australia","pursuit","protestant","prison","prison cell","parrot","murder in self defense","mother son relationship","lion","liar","lawman","knife","passionate kiss","killing a horse","injustice","interrogation","informer","informant","immigrant","husband wife relationship","horse riding","horse penis","horse and carriage","hitchhiking","funeral","childhood friend","friendship","football","flashback","flash forward","fire","female nudity","female frontal nudity","father son relationship","english","eagle","drinking","police corruption","circus","circus wagon","chinese immigrant","cattle","catholic","camel","brother sister relationship","brother brother relationship","bronc buster","exotic bird","bathtub","bank president","irish band","australian outback","aborigine","1880s","police officer killed","bushranger","folk hero","policeman","irish immigrant","cop killer","australian history","armor","target practice","poetic justice","horse thief","crime spree","1870s","suicide by gun","shot in the leg","shot in the head","shot in the face","shot in the eye","shot in the chest","shot in the back","shot in the arm","shootout","death","corpse","body armor","blood","betrayal","bank robbery","death of friend","independent film","based on novel","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:11:32"}}