{"data":{"movies":[{"title":"Hollywood Ending","originalTitle":"","year":"2002","releaseDate":"20020503","directors":[{"name":"Woody Allen","id":"nm0000095"}],"writers":[{"name":"Woody Allen","id":"nm0000095"}],"runtime":"112 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNTgwMjk4NV5BMl5BanBnXkFtZTYwMDAxODM3._V1.jpg","countries":["USA"],"languages":["English","Mandarin"],"genres":["Comedy","Romance"],"plot":"Val Waxman is a film director who was once big in the 1970's and 1980's, but has now has been reduced to directing TV commercials. Finally, he gets an offer to make a big film. But, disaster strikes, when Val goes temporarily blind, due to paranoia. So, he and a few friends, try to cover up his disability, without the studio executives or the producers knowing that he is directing the film blind.","simplePlot":"A director is forced to work with his ex-wife, who left him for the boss of the studio bankrolling his new film. But the night before the first day of shooting, he develops a case of psychosomatic blindness.","actors":[{"actorName":"Téa Leoni","urlProfile":"http://www.imdb.com/name/nm0000495","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NTQ1OTgyMV5BMl5BanBnXkFtZTcwNDQ1NDg1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 February 1966","placeOfBirth":" New York City, New York, USA","birthName":"Elizabeth Téa Pantaleoni","height":"5' 8\" (1.73 m)","bio":"Elizabeth Téa Pantaleoni was born in New York, on February 25, 1966. Her father, Anthony Pantaleoni, was a corporate lawyer, and her mother, Emily Patterson, was a dietitian and nutritionist. She is of Italian (from a paternal great-great-grandfather), Polish, English, Scottish, Irish, and German descent. Téa attended but did not complete studies at Sarah Lawrence College. She started out in acting as Lisa DiNapoli in Santa Barbara (1984) in 1989 and followed up with small roles in Switch (1991) and A League of Their Own (1992). In 1992 she starred in the short-lived sitcom Flying Blind (1992). In 1994 she appeared in Wyatt Earp (1994) opposite Kevin Costner and The Counterfeit Contessa (1994) opposite D.W. Moffett. In 1995 she starred opposite Will Smith and Martin Lawrence in the popular film Bad Boys (1995). She also had a guest appearance on Frasier (1993) that same year. She appeared in many successful films after that, such as Flirting with Disaster (1996), Deep Impact (1998), The Family Man (2000), Spanglish (2004), You Kill Me (2007) and most recently, she starred in the film Ghost Town (2008) opposite Greg Kinnear. Tea was married to television commercial producer Neil Joseph Tardio Jr. from 1991 to 1995. In 1997 she married actor David Duchovny, with whom she has two children: Daughter Madelaine West Duchovny (born April 24, 1999) and Son Kyd Miller Duchovny (born June 15, 2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NTQ1OTgyMV5BMl5BanBnXkFtZTcwNDQ1NDg1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000495","name":"Téa Leoni","idIMDB":"nm0000495"},"actorId":"nm0000495","character":"Ellie","urlCharacter":"http://www.imdb.com/character/ch0019610","main":true},{"actorName":"Bob Dorian","urlProfile":"http://www.imdb.com/name/nm0233646","urlPhoto":"","biography":{"bio":"Bob Dorian is an actor, known for Hollywood Ending (2002), Evil Dead (2013) and The Curse of the Jade Scorpion (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0233646","name":"Bob Dorian","idIMDB":"nm0233646"},"actorId":"nm0233646","character":"Galaxie Executive","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ivan Martin","urlProfile":"http://www.imdb.com/name/nm0552423","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3MTUzODA0OF5BMl5BanBnXkFtZTgwNzY5Mzc2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Ivan Martin is an actor and writer, known for Billions (2016), Money Monster (2016) and Chuck (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3MTUzODA0OF5BMl5BanBnXkFtZTgwNzY5Mzc2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0552423","name":"Ivan Martin","idIMDB":"nm0552423"},"actorId":"nm0552423","character":"Galaxie Executive","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gregg Edelman","urlProfile":"http://www.imdb.com/name/nm0248981","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NzM5NDE3Ml5BMl5BanBnXkFtZTgwMTEzNzQwMzE@._V1_UY44_CR19,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1958","placeOfBirth":" Chicago, Illinois, USA","bio":"Gregg Edelman was born on September 12, 1958 in Chicago, Illinois, USA. He is an actor, known for Spider-Man 2 (2004), Little Children (2006) and Crimes and Misdemeanors (1989). He has been married to Carolee Carmello since March 5, 1995. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NzM5NDE3Ml5BMl5BanBnXkFtZTgwMTEzNzQwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0248981","name":"Gregg Edelman","idIMDB":"nm0248981"},"actorId":"nm0248981","character":"Galaxie Executive","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Hamilton","urlProfile":"http://www.imdb.com/name/nm0001313","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNzU4ODg2NV5BMl5BanBnXkFtZTYwODkyMDY2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 August 1939","placeOfBirth":" Memphis, Tennessee, USA","birthName":"George Stevens Hamilton","height":"6' 1\" (1.85 m)","bio":"Noted these days for his dashing, sporting, jet-setter image and perpetually bronzed skin tones in commercials, film spoofs and reality shows, George Hamilton was, at the onset, a serious contender for dramatic film stardom. Born George Stevens Hamilton in Memphis, TN, on August 12, 1939, the son of gregarious Southern belle beauty Ann (Stevens) Potter Hamilton Hunt Spaulding, and her husband (of four), George W. \"Spike\" Hamilton, a touring bandleader. Moving extensively as a youth due to his father's work (Arkansas, Massachusetts, New York, California), young George got a taste of acting in plays while attending Palm Beach High School. With his exceedingly handsome looks and attractive personality, he took a bold chance and moved to Los Angeles in the late 1950s. MGM (towards the end of the contract system) saw in George a budding talent with photogenic appeal. It wasted no time putting him in films following some guest appearances on TV. His first film, a lead in Crime & Punishment, USA (1959), was an offbeat, updated adaptation of the Fyodor Dostoevsky novel. While the film was not overwhelmingly successful, George's heartthrob appeal was obvious. He was awarded a Golden Globe for \"Most Promising Newcomer\" as well as being nominated for \"Best Foreign Actor\" by the British Film Academy (BAFTA). This in turn led to an enviable series of film showcases, including the memorable Southern drama Home from the Hill (1960), which starred Robert Mitchum and Eleanor Parker and featured another handsome, up-and-coming George (George Peppard); Angel Baby (1961), in which he played an impressionable lad who meets up with evangelist Mercedes McCambridge; and Light in the Piazza (1962) (another BAFTA nomination), in which he portrays an Italian playboy who falls madly for American tourist Yvette Mimieux to the ever-growing concern of her mother Olivia de Havilland. Along with the good, however, came the bad and the inane, which included the dreary sudsers All the Fine Young Cannibals (1960) and By Love Possessed (1961) and the youthful spring-break romps Where the Boys Are (1960), which had Connie Francis warbling the title tune while slick-as-car-seat-leather George pursued coed Dolores Hart, and Looking for Love (1964), which was more of the same. Not yet undone by this mixed message of serious actor and glossy pin-up, George went on to show some real acting muscle in the offbeat casting of a number of biopics -- as Moss Hart in Act One (1963), an overly fictionalized and sanitized account of the late playwright (the real Moss should have looked so good!), as ill-fated country star Hank Williams in Your Cheatin' Heart (1964), and as the famed daredevil Evel Knievel (1971). The rest of the '60s and '70s, however, rested on his fun-loving, idle-rich charm that bore a close resemblance to his off-camera image in the society pages. As the 1960s began to unfold, he started making headlines more as a handsome escort to the rich, the powerful and the beautiful than as an acclaimed actor -- none more so than his 1966 squiring of President Lyndon Johnson's daughter Lynda Bird Johnson. He was also once engaged to actress Susan Kohner, a former co-star. Below-average films such as Doctor, You've Got to Be Kidding! (1967), A Time for Killing (1967) and The Power (1968) effectively ended his initially strong ascent to film stardom. From the 1970s on George tended to be tux-prone on standard film and TV comedy and drama, whether as a martini-swirling opportunist, villain or lover. A wonderful comeback for him came in the form of the disco-era Dracula spoof Love at First Bite (1979), which he executive-produced. Nominated for a Golden Globe as the campy neck-biter displaced and having to fend off the harsh realities of New York living, he continued on the parody road successfully with Zorro: The Gay Blade (1981) in the very best Mel Brooks tradition. This renewed popularity led to a one-year stint on Dynasty (1981) during the 1985-1986 season and a string of fun, self-mocking commercials, particularly his Ritz Cracker and (Toasted!) Wheat Thins appearances that often spoofed his overly tanned appearance. In recent times he has broken through the \"reality show\" ranks by hosting The Family (2003), which starred numerous members of a traditional Italianate family vying for a $1,000,000 prize, and participating in the second season of ABC's Dancing with the Stars (2005), where his charm and usual impeccable tailoring scored higher than his limberness. On the tube he can still pull off a good time, whether playing flamboyant publisher William Randolph Hearst in Rough Riders (1997), playing the best-looking Santa Claus ever in A Very Cool Christmas (2004), hosting beauty pageants or making breezy gag appearances. In 1989 he started a line of skin-care products and a chain of tanning salons. Married to actress/TV personality Alana Stewart from 1972 to 1975 (she later married and divorced rock singer Rod Stewart), the pair have a son, actor Ashley Hamilton, born in 1974. Another son, George Thomas Hamilton, born in 2000, came from his involvement with Kimberly Blackford.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNzU4ODg2NV5BMl5BanBnXkFtZTYwODkyMDY2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001313","name":"George Hamilton","nicknames":["Tanned One"],"idIMDB":"nm0001313"},"actorId":"nm0001313","character":"Ed","urlCharacter":"http://www.imdb.com/character/ch0019612","main":true},{"actorName":"Treat Williams","urlProfile":"http://www.imdb.com/name/nm0001852","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MzcwOTkzNV5BMl5BanBnXkFtZTcwMDc3NTA3MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 December 1951","placeOfBirth":" Rowayton, Connecticut, USA","birthName":"Richard Treat Williams","height":"5' 10\" (1.78 m)","bio":"Richard Treat Williams was born in Rowayton, Connecticut, to Marian (Andrew), who dealt in antiques, and Richard Norman Williams, a corporate executive. Educated at prep-school, he first made a serious commitment to his craft during his days at Pennsylvania's Franklin and Marshall College. Working summers with the nearby Fulton Repertory Theatre at Lancaster in the heart of Amish country, Williams performed the classics as well as contemporary dramas and musicals. After graduating, Williams--whose first name, incidentally, is a family surname on his mother's side--headed for Manhattan where he understudied the Danny Zuko role in \"Grease.\" After working in the The Andrews Sisters musical \"Over Here,\" he made his film debut as a cop in Deadly Hero (1975), then returned to \"Grease,\" this time in the starring role. While he took leaves for two small film roles, in The Ritz (1976) and The Eagle Has Landed (1976), it was his stage work in \"Grease\" that led to his cinematic breakthrough in Hair (1979). Spotted by director Milos Forman, Williams was asked to read for the role of Berger, the hippie. It took 13 auditions to land the part, but the film's release catapulted Williams into stardom. He then portrayed a GI on the make in Steven Spielberg's 1941 (1979) and starred in the romantic comedy Why Would I Lie? (1980) before tackling the role of Danny Ciello, the disillusioned New York City cop who blew the whistle on his corrupt colleagues in Sidney Lumet's Prince of the City (1981). He followed that with The Pursuit of D.B. Cooper (1981), in which he played the legendary plane hijacker who successfully eluded capture (by Robert Duvall); Flashpoint (1984), in which he and Kris Kristofferson starred as a pair of maverick border patrolmen who come upon a large cache of stolen money; Sergio Leone's Il était une fois en Amérique (1984), in which he played a Jimmy Hoffa-like labor organizer; and Smooth Talk (1985), a screen adaptation of Joyce Carol Oates' short story, \"Where Are You Going?\" Television viewers have seen Williams in a prestigious pair of dramas, Dempsey (1983), a three-hour story of the hard-living heavyweight champ, and John Erman's adaptation of Tennessee Williams' classic \"A Streetcar Named Desire,\" which pitted Williams' Stanley Kowalski against Ann-Margret's Blanche Dubois. Williams has also returned to Broadway sporadically -- first to appear in \"Once in a Lifetime\" while filming \"Hair,\" and in 1981 to play the role of the pirate king in \"The Pirates of Penzance.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MzcwOTkzNV5BMl5BanBnXkFtZTcwMDc3NTA3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001852","name":"Treat Williams","idIMDB":"nm0001852"},"actorId":"nm0001852","character":"Hal","urlCharacter":"http://www.imdb.com/character/ch0019611","main":true},{"actorName":"Woody Allen","urlProfile":"http://www.imdb.com/name/nm0000095","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MjU3MTI2MF5BMl5BanBnXkFtZTcwMDgxNTE4MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 December 1935","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Allan Stewart Konigsberg","height":"5' 5\" (1.65 m)","bio":"Woody Allen was born Allan Stewart Konigsberg on December 1, 1935 in Brooklyn, New York, to Nettie (Cherrie), a bookkeeper, and Martin Konigsberg, a waiter and jewellery engraver. His father was of Russian Jewish descent, and his maternal grandparents were Austrian Jewish immigrants. As a young boy, he became intrigued with magic tricks and playing the clarinet, two hobbies that he continues today. Allen broke into show business at 15 years when he started writing jokes for a local paper, receiving $200 a week. He later moved on to write jokes for talk shows but felt that his jokes were being wasted. His agents, Charles Joffe and Jack Rollins, convinced him to start doing stand-up and telling his own jokes. Reluctantly he agreed and, although he initially performed with such fear of the audience that he would cover his ears when they applauded his jokes, he eventually became very successful at stand-up. After performing on stage for a few years, he was approached to write a script for Warren Beatty to star in: Quoi de neuf, Pussycat? (1965) and would also have a moderate role as a character in the film. During production, Woody gave himself more and better lines and left Beatty with less compelling dialogue. Beatty inevitably quit the project and was replaced by Peter Sellers, who demanded all the best lines and more screen-time. It was from this experience that Woody realized that he could not work on a film without complete control over its production. Woody's theoretical directorial debut was in What's Up, Tiger Lily? (1966); a Japanese spy flick that he dubbed over with his own comedic dialogue about spies searching for the secret recipe for egg salad. His real directorial debut came the next year in the mockumentary Take the Money and Run (1969). He has written, directed and, more often than not, starred in about a film a year ever since, while simultaneously writing more than a dozen plays and several books of comedy. While best known for his romantic comedies Annie Hall (1977) and Manhattan (1979), Woody has made many transitions in his films throughout the years, transitioning from his \"early, funny ones\" of Bananas (1971), Love and Death (1975) and Everything You Always Wanted to Know About Sex * But Were Afraid to Ask (1972); to his more storied and romantic comedies of Annie Hall (1977), Manhattan (1979) and Hannah and Her Sisters (1986); to the Bergmanesque films of Stardust Memories (1980) and Interiors (1978); and then on to the more recent, but varied works of Crimes and Misdemeanors (1989), Husbands and Wives (1992), Mighty Aphrodite (1995), _Celebrity_ and Deconstructing Harry (1997); and finally to his films of the last decade, which vary from the light comedy of Scoop (2006), to the self-destructive darkness of Match Point (2005) and, most recently, to the cinematically beautiful tale of Vicky Cristina Barcelona (2008). Although his stories and style have changed over the years, he is regarded as one of the best filmmakers of our time because of his views on art and his mastery of filmmaking.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MjU3MTI2MF5BMl5BanBnXkFtZTcwMDgxNTE4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000095","name":"Woody Allen","idIMDB":"nm0000095"},"actorId":"nm0000095","character":"Val","urlCharacter":"http://www.imdb.com/character/ch0019609","main":true},{"actorName":"Debra Messing","urlProfile":"http://www.imdb.com/name/nm0005226","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjUzMjg3M15BMl5BanBnXkFtZTcwMTc0NDU5OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 August 1968","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Debra Lynn Messing","height":"5' 8\" (1.73 m)","bio":"Messing was born in the New York City borough of Brooklyn, the daughter of Jewish American parents, Sandra (née Simons), who has worked as a professional singer, banker, travel and real estate agent, and Brian Messing, a sales executive for a jewelry manufacturer. When Messing was three, she moved with her parents and her older brother, Brett, to East Greenwich, a small town outside Providence, Rhode Island. During her high school years, she acted (and sang) in a number of high school productions, including the starring role in the musical \"Annie\" and \"Fiddler On the Roof.\" Messing took lessons in dance, singing, and acting. In 1986, she was Rhode Island's Junior Miss and competed in Mobile, Alabama in the America's Junior Miss scholarship program. While her parents encouraged her dream of becoming an actress, they also urged her to complete a liberal arts education before deciding on acting as a career. Following their advice, she attended Brandeis University in Waltham, Massachusetts. In 1990, after graduating summa cum laude from Brandeis with a bachelor's degree in theater arts, Messing gained admission to the elite Graduate Acting Program (which accepts only about 15 new students annually) at New York University, where she earned a master's degree in fine arts after three years. In 1998, Messing played a lead role as the bio-anthropologist Sloan Parker on ABC's dramatic science fiction television series Prey. During this time her agent approached her with the pilot script for the television show Will & Grace. Messing was inclined to take some time off, but the script intrigued her, and she auditioned for the role of Grace Adler, beating out Nicollette Sheridan, who later guest-starred on the show as a romantic rival of Grace's. Will & Grace became a ratings success, and Messing gained renown. In 2002, she was named one of the \"50 Most Beautiful People in the World\" by People Magazine. TV Guide picked her as its \"Best Dressed Woman\" in 2003. Messing met her husband, Daniel Zelman (an actor and screenwriter), on their first day as graduate students at NYU. The two were married on September 3, 2000, and live in New York City. On April 7, 2004, Messing gave birth to their son, Roman Walker Zelman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjUzMjg3M15BMl5BanBnXkFtZTcwMTc0NDU5OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005226","name":"Debra Messing","idIMDB":"nm0005226"},"actorId":"nm0005226","character":"Lori","urlCharacter":"http://www.imdb.com/character/ch0019608","main":true},{"actorName":"Neal Huff","urlProfile":"http://www.imdb.com/name/nm0400223","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI1OTYyMDgyNV5BMl5BanBnXkFtZTcwOTI2MDA1NA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Neal Huff was born in New York City, New York, USA. He is an actor, known for The Grand Budapest Hotel (2014), Spotlight (2015) and Split (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI1OTYyMDgyNV5BMl5BanBnXkFtZTcwOTI2MDA1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0400223","name":"Neal Huff","idIMDB":"nm0400223"},"actorId":"nm0400223","character":"Commercial A.D.","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Rydell","urlProfile":"http://www.imdb.com/name/nm0753073","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMTQwNTMyMF5BMl5BanBnXkFtZTYwNTY0Mjg1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 March 1929","placeOfBirth":" New York City, New York, USA","birthName":"Mortimer H. Rydell","bio":"Mark Rydell was born on March 23, 1929 in New York City, New York, USA as Mortimer H. Rydell. He is known for his work on On Golden Pond (1981), The Cowboys (1972) and James Dean (2001). He was previously married to Esther Rydell and Joanne Linville.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMTQwNTMyMF5BMl5BanBnXkFtZTYwNTY0Mjg1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0753073","name":"Mark Rydell","idIMDB":"nm0753073"},"actorId":"nm0753073","character":"Al","urlCharacter":"http://www.imdb.com/character/ch0019613","main":true},{"actorName":"Douglas McGrath","urlProfile":"http://www.imdb.com/name/nm0569790","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMjYxODU4NV5BMl5BanBnXkFtZTYwMDk3Mjc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 February 1958","placeOfBirth":" New York City, New York, USA","bio":"Douglas McGrath was born on February 2, 1958 in New York City, New York, USA. He is a writer and actor, known for Emma (1996), Bullets Over Broadway (1994) and Infamous (2006). He has been married to Jane Read Martin since June 3, 1995. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMjYxODU4NV5BMl5BanBnXkFtZTYwMDk3Mjc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0569790","name":"Douglas McGrath","idIMDB":"nm0569790"},"actorId":"nm0569790","character":"Barbeque Guest","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephanie Roth Haberle","urlProfile":"http://www.imdb.com/name/nm0745029","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNzU2MDAyMV5BMl5BanBnXkFtZTgwNzQxNzQwMzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1963","placeOfBirth":" Boston, Massachusetts, USA","bio":"Stephanie Roth Haberle was born on January 7, 1963 in Boston, Massachusetts, USA. She is an actress, known for Philadelphia (1993), Crimes and Misdemeanors (1989) and Deconstructing Harry (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNzU2MDAyMV5BMl5BanBnXkFtZTgwNzQxNzQwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0745029","name":"Stephanie Roth Haberle","idIMDB":"nm0745029"},"actorId":"nm0745029","character":"Barbeque Guest","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Gerber","urlProfile":"http://www.imdb.com/name/nm0314086","urlPhoto":"","biography":{"bio":"Bill Gerber is an actor, known for Small Time Crooks (2000), Hollywood Ending (2002) and Celebrity (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0314086","name":"Bill Gerber","idIMDB":"nm0314086"},"actorId":"nm0314086","character":"Barbeque Guest","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roxanne Perry","urlProfile":"http://www.imdb.com/name/nm1166945","urlPhoto":"","biography":{"bio":"Roxanne Perry is an actress, known for Hollywood Ending (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1166945","name":"Roxanne Perry","idIMDB":"nm1166945"},"actorId":"nm1166945","character":"Barbeque Guest","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barbara Carroll","urlProfile":"http://www.imdb.com/name/nm1006690","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NzdlNWUtNWI2MS00YWZjLWEwNmItMGIyNDA3NjEzOTRhL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 January 1925","placeOfBirth":" Worcester, Massachusetts, USA","birthName":"Barbara Carole Coppersmith","bio":"Songwriter, pianist and composer, educated at the New England Conservatory. She made a USA tour with an instrumental trio, and was a pianist in night clubs and in the Broadway musical \"Me and Juliet\". She made many records. Joining ASCAP in 1956, her popular-song compositions include \"Barbara's Carol\", \"Just Plain Blue\", \"Lost In a Crowded Place\" and \"Fancy Pants\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NzdlNWUtNWI2MS00YWZjLWEwNmItMGIyNDA3NjEzOTRhL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1006690","name":"Barbara Carroll","nicknames":["Bobbie","The First Lady of Jazz Piano"],"idIMDB":"nm1006690"},"actorId":"nm1006690","character":"Carlyle Pianist","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0278823","urlIMDB":"http://www.imdb.com/title/tt0278823","business":{"budget":{"money":"$16,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$2,017,981","country":"USA","day":"05","month":"05","year":"2002","remarks":"765 Screens"},{"money":"€489,412","country":"Italy","day":"03","month":"11","year":"2002","remarks":"135 Screens"},{"money":"€384,595","country":"Spain","day":"20","month":"10","year":"2002","remarks":"108 Screens"}],"gross":[{"money":"$4,839,383","country":"USA","day":"23","month":"06","year":"2002","remarks":""},{"money":"$4,819,948","country":"USA","day":"16","month":"06","year":"2002","remarks":""},{"money":"$4,804,963","country":"USA","day":"09","month":"06","year":"2002","remarks":""},{"money":"$4,781,031","country":"USA","day":"02","month":"06","year":"2002","remarks":""},{"money":"$4,729,427","country":"USA","day":"27","month":"05","year":"2002","remarks":""},{"money":"$4,461,634","country":"USA","day":"19","month":"05","year":"2002","remarks":""},{"money":"$3,645,452","country":"USA","day":"12","month":"05","year":"2002","remarks":""},{"money":"$2,035,193","country":"USA","day":"05","month":"05","year":"2002","remarks":""},{"money":"$3,390,000","country":"France","day":"11","month":"06","year":"2002","remarks":""},{"money":"$2,904,000","country":"France","day":"04","month":"06","year":"2002","remarks":""},{"money":"$2,355,000","country":"France","day":"28","month":"05","year":"2002","remarks":""},{"money":"$1,356,000","country":"France","day":"21","month":"05","year":"2002","remarks":""},{"money":"€1,401,275","country":"Italy","day":"16","month":"01","year":"2003","remarks":""},{"money":"€1,130,692","country":"Italy","day":"17","month":"11","year":"2002","remarks":""},{"money":"€906,147","country":"Italy","day":"10","month":"11","year":"2002","remarks":""},{"money":"€532,592","country":"Italy","day":"03","month":"11","year":"2002","remarks":""},{"money":"€2,504,297","country":"Spain","day":"15","month":"04","year":"2003","remarks":""},{"money":"€2,214,890","country":"Spain","day":"24","month":"11","year":"2002","remarks":""},{"money":"€2,046,880","country":"Spain","day":"17","month":"11","year":"2002","remarks":""},{"money":"€1,816,630","country":"Spain","day":"10","month":"11","year":"2002","remarks":""},{"money":"€1,494,100","country":"Spain","day":"03","month":"11","year":"2002","remarks":""},{"money":"€967,580","country":"Spain","day":"27","month":"10","year":"2002","remarks":""},{"money":"€384,595","country":"Spain","day":"20","month":"10","year":"2002","remarks":""}],"weekendGross":[{"money":"$15,379","country":"USA","day":"23","month":"06","year":"2002","remarks":"75 Screens"},{"money":"$6,604","country":"USA","day":"16","month":"06","year":"2002","remarks":"11 Screens"},{"money":"$11,198","country":"USA","day":"09","month":"06","year":"2002","remarks":"27 Screens"},{"money":"$26,413","country":"USA","day":"02","month":"06","year":"2002","remarks":"113 Screens"},{"money":"$128,558","country":"USA","day":"27","month":"05","year":"2002","remarks":"113 Screens"},{"money":"$536,430","country":"USA","day":"19","month":"05","year":"2002","remarks":"605 Screens"},{"money":"$1,096,353","country":"USA","day":"12","month":"05","year":"2002","remarks":"772 Screens"},{"money":"$2,017,981","country":"USA","day":"05","month":"05","year":"2002","remarks":"765 Screens"},{"money":"€134,616","country":"Italy","day":"17","month":"11","year":"2002","remarks":"46 Screens"},{"money":"€227,327","country":"Italy","day":"10","month":"11","year":"2002","remarks":"90 Screens"},{"money":"€114,770","country":"Spain","day":"24","month":"11","year":"2002","remarks":"78 Screens"},{"money":"€161,230","country":"Spain","day":"17","month":"11","year":"2002","remarks":"77 Screens"},{"money":"€231,732","country":"Spain","day":"10","month":"11","year":"2002","remarks":"95 Screens"},{"money":"€369,528","country":"Spain","day":"03","month":"11","year":"2002","remarks":"109 Screens"},{"money":"€421,860","country":"Spain","day":"27","month":"10","year":"2002","remarks":"114 Screens"},{"money":"€384,595","country":"Spain","day":"20","month":"10","year":"2002","remarks":"108 Screens"}],"admissions":[{"money":"23,469","country":"Brazil","day":"10","month":"08","year":"2003","remarks":""},{"money":"697,997","country":"France","day":"18","month":"06","year":"2002","remarks":""},{"money":"652,004","country":"France","day":"11","month":"06","year":"2002","remarks":""},{"money":"558,541","country":"France","day":"04","month":"06","year":"2002","remarks":""},{"money":"452,882","country":"France","day":"28","month":"05","year":"2002","remarks":""},{"money":"260,804","country":"France","day":"21","month":"05","year":"2002","remarks":""},{"money":"6,476","country":"Netherlands","day":"31","month":"12","year":"2003","remarks":""},{"money":"6,212","country":"Netherlands","day":"31","month":"12","year":"2002","remarks":""},{"money":"525,983","country":"Spain","day":"15","month":"04","year":"2003","remarks":""},{"money":"445,574","country":"Spain","day":"24","month":"11","year":"2002","remarks":""},{"money":"411,775","country":"Spain","day":"17","month":"11","year":"2002","remarks":""},{"money":"397,165","country":"Spain","day":"14","month":"11","year":"2002","remarks":""},{"money":"380,503","country":"Spain","day":"10","month":"11","year":"2002","remarks":""},{"money":"310,659","country":"Spain","day":"03","month":"11","year":"2002","remarks":""},{"money":"237,256","country":"Spain","day":"31","month":"10","year":"2002","remarks":""},{"money":"77,370","country":"Spain","day":"20","month":"10","year":"2002","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"02","month":"04","year":"2001","remarks":null},null],"copyrightHolder":"copyright © 2002 Gravier Productions, Inc. (on print)"},"technical":{"runtime":["1 hr 52 min (112 min)"],"soundMix":["DTS (Mono)","Dolby Digital (Mono)","SDDS (Mono)"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Technicolor (color)","Technicolor, New York (NY), USA (dailies)","Technicolor, Hollywood (CA), USA (prints)"],"filmLength":["3,090 m (Finland)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.6","metascore":"46","filmingLocations":[{"location":"Central Park, Manhattan, New York City, New York, USA"}],"rated":"PG-13","awards":[{"award":"The Stinkers Bad Movie Awards 2002","titlesAwards":[{"titleAwardOutcome":"Nominated Stinker Award","categories":[{"category":"Worst On-Screen Couple","names":[{"name":"Woody Allen","id":"nm0000095","role":null}]}]}]}],"votes":"22,500","type":"Movie","companyCreditsSimple":[{"idCompany":"co0040938","name":"DreamWorks"},{"idCompany":"co0044777","name":"Gravier Productions"},{"idCompany":"co0000605","name":"Perdido Productions"}],"keywords":{"keywords":["self deprecating","director","studio","blind","psychosomatic blindness","blindness","two word title","written and directed by cast member","manhattan new york city","central park manhattan new york city","place name in title","directed by star","washed up star","temporary blindness","swimming pool","split screen","psychosomatic illness","psychiatrist","optometrist","new york skyline","neurosis","movie producer","movie business","mohawk haircut","medication","limousine","film executive","fiance fiancee relationship","female reporter","father son relationship","falling from height","ex husband ex wife relationship","brink of nervous breakdown","boyfriend girlfriend relationship","boxing gloves","blind man","bickering","audition","airfield","new york city","movie set","hollywood california","film set","filmmaking","filmmaker","california","actress","actor","screwball","metaphor","self mocking","film within a film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 16:14:36"}}