{"data":{"movies":[{"title":"Der Ausdruck der Hände","originalTitle":"","year":"1997","directors":[{"name":"Harun Farocki","id":"nm0267943"}],"writers":[{"name":"Harun Farocki","id":"nm0267943"}],"runtime":"30 min","countries":["Germany"],"languages":["German"],"genres":["Short"],"simplePlot":"","actors":[{"actorName":"Harun Farocki","urlProfile":"http://www.imdb.com/name/nm0267943","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjU4YmE4M2YtZjg0Ni00NzRlLTlmMzAtYzA0Zjk1YWFiNDk3XkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1_UY44_CR35,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 January 1944","placeOfBirth":" Neutitschein, Sudetenland [now Nový Jicín, Czech Republic]","birthName":"Harun El Usman Faroqhi","bio":"The German film director, screenwriter and media artist Harun Farocki was born on the 9th January 1944 in Nový Jicín [Neutitschein], at that time a part of Czechoslovakia annexed by the Third Reich. He was the son of an immigrated Indian doctor and a German woman. Farocki first studied Theatre, Sociology and Journalism at the 'Freie Universität (FU)' in West-Berlin. From 1966 to 1968 he studied at the new 'Deutsche Film- und Fernsehakademie Berlin (DFFB)' as part of their first generation which included students as diverse as future Hollywood-director Wolfgang Petersen, future feminist filmmaker Helke Sander and future RAF-terrorist Holger Meins. Influenced by Jean-Luc Godard and Bertolt Brecht Harun Farocki gradually developed his own unique style of non-narrative-filmmaking concerned with understanding, reflecting and confronting modern society. Since 1966 Farocki produced, wrote and directed more than 100 short and feature-length films for television and cinema, mostly documentaries and essay films, that analyzed social realities with a precise use of moving images that always included the political and sociological context involved in the creation of imagery. Since 1996 Farocki had numerous group and solo exhibitions in museums and galleries worldwide, for example at the 'MOMA' in New York, the 'MUMOK' in Vienna, the 'Jeu de Paume' in Paris and the 'Museum Ludwig' in Cologne, followed by retrospectives of his films at many institutions like the 'Tate Modern' in London or the 'Centre for Contemporary Art' in Warsaw. Farocki's participation in the prestigious \"documenta\" in 1997 and 2007 is an indication of the huge impact that his films and video installations had in the art context, but no less was his influence in the film world: Six of his films were presented in the 'Forum' of the 'Berlin International Film Festival' and two more films won awards at the 'Locarno International Film Festival' in 2003 and 2007. In 2009 the influential French magazine \"Cahiers du cinéma\" named Farocki's and Andrei Ujica's celebrated masterpiece Vidéogrammes d'une révolution (1992) one of the 10 most subversive films ever made. Farocki's life included writing about film and teaching media, too: From 1974 to 1984 he was the editor of the journal \"Filmkritik\", published in Munich. In 1998 he published the book \"Speaking about Godard\" (together with Kaja Silverman). From 1993 to 1999 Farocki was a visiting professor at the 'University of California Berkeley'. From 2000 to 2004 Farocki taught in Berlin at his former school 'DFFB' and at the 'University of the Arts'. In 2004 Farocki first became a visiting professor and then in 2006 a full professor at the 'Academy of Fine Arts' in Vienna. As a teacher Harun Farocki had a significant cinematic and intellectual influence on the development of the acclaimed \"Berlin School\" film movement. He himself co-wrote five celebrated feature films of its most prominent member Christian Petzold, who used to be his student and assistant. Harun Farocki was married to Ursula Lefkes from 1966 until her death in 1996. They had two children (twin daughters) together. In 2001 Antje Ehmann became his second wife and like Lefkes a frequent collaborator on his films. On July 30, 2014 Harun Farocki died at the age of 70 in his home near Berlin.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjU4YmE4M2YtZjg0Ni00NzRlLTlmMzAtYzA0Zjk1YWFiNDk3XkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0267943","name":"Harun Farocki","idIMDB":"nm0267943"},"actorId":"nm0267943","character":"Himself","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0268959","urlIMDB":"http://www.imdb.com/title/tt0268959","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["30 min (Germany)"],"soundMix":null,"color":["Black and White","Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.5","filmingLocations":[],"awards":[],"votes":"22","type":"Movie","companyCreditsSimple":[]}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 06:19:07"}}