{"data":{"movies":[{"title":"The Way of the Gun","originalTitle":"","year":"2000","releaseDate":"20000908","directors":[{"name":"Christopher McQuarrie","id":"nm0003160"}],"writers":[{"name":"Christopher McQuarrie","id":"nm0003160"}],"runtime":"119 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MjAwNTExNV5BMl5BanBnXkFtZTcwNzI4NjEyMQ@@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Action","Crime","Drama","Thriller"],"plot":"Two petty if violent criminals kidnap a girl being paid $1m to be a surrogate mother. As the baby is for a gangster the pair's demand for money sees several henchmen and assorted other ruthless characters head after them to Mexico. Bullets rather than talking are always going to settle this one.","simplePlot":"Two criminal drifters without sympathy get more than they bargained for after kidnapping and holding for ransom the surrogate mother of a powerful and shady man.","actors":[{"actorName":"Ryan Phillippe","urlProfile":"http://www.imdb.com/name/nm0000202","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NDk4ODg3MV5BMl5BanBnXkFtZTcwMzQyMjY5Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1974","placeOfBirth":" New Castle, Delaware, USA","birthName":"Matthew Ryan Phillippe","height":"5' 9\" (1.75 m)","bio":"Ryan Phillippe was born on September 10, 1974 in New Castle, Delaware, to Susan (Thomas), a nurse, and Richard Phillippe, a chemical technician. He has three sisters, Kirsten, Lindsay, and Katelyn, and attended New Castle Baptist Academy. Ryan's acting career began with the soap opera One Life to Live (1968). It was no small role. His character, Billy Douglas, was US daytime television's first gay teenager. Billy struggled with coming out issues and the town's anti-gay reactions. After several other television appearances and he began appearing in movies of his own, Nowhere (1997), White Squall (1996) I Know What You Did Last Summer (1997), Cruel Intentions (1999), Crash (2005), Flags of Our Fathers (2006), and Stop-Loss (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NDk4ODg3MV5BMl5BanBnXkFtZTcwMzQyMjY5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000202","name":"Ryan Phillippe","idIMDB":"nm0000202"},"actorId":"nm0000202","character":"Mr. Parker","urlCharacter":"http://www.imdb.com/character/ch0095328","main":true},{"actorName":"Benicio Del Toro","urlProfile":"http://www.imdb.com/name/nm0001125","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzODQ4NzU1N15BMl5BanBnXkFtZTcwOTUzMzc5Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 February 1967","placeOfBirth":" San Germán, Puerto Rico","birthName":"Benicio Monserrate Rafael Del Toro Sanchez","height":"6' 2\" (1.88 m)","bio":"Benicio Del Toro emerged in the mid-1990s as one of the most watchable and charismatic character actors to come along in years. A favorite of film buffs, Del Toro gained mainstream public attention as the conflicted but basically honest Mexican policeman in Steven Soderbergh's Traffic (2000). Born on February 19, 1967 in San Germán, Puerto Rico, Benicio is the son of lawyer parents Fausta Genoveva Sanchez Rivera and Gustavo Adolfo Del Toro Bermudez. His mother died when he was young, and his father moved the family to a farm in Pennsylvania. A basketball player with an interest in acting, he decided to follow the family way and study business at the University of California in San Diego. A class in acting resulted in his being bitten by the acting bug, and he subsequently dropped out and began studying with legendary acting teacher Stella Adler in Los Angeles and at the Circle in the Square Acting School in New York City. Telling his parents that he was taking courses in business, Del Toro hid his new studies from his family for a little while. During the late 1980s, he made several television appearances, most notably in an episode of Miami Vice (1984) and in the NBC miniseries Drug Wars: The Camarena Story (1990). Del Toro's big-screen career got off to a slower start, however--his first role was Duke the Dog-Faced Boy in Big Top Pee-wee (1988). However, things looked better when he landed the role of Dario, the vicious henchman in the James Bond film Licence to Kill (1989). Surprising his co-stars at age 21, Del Toro was the youngest actor ever to portray a Bond villain. However, the potential break was spoiled as the picture turned out to be one of the most disappointing Bond films ever; this was lost amid bigger summer competition. Benicio gave creditable performances in many overlooked films for the next several years, such as The Indian Runner (1991), Christopher Columbus: The Discovery (1992) and Money for Nothing (1993). His roles in Fearless (1993) and China Moon (1994) gained him more critical notices, and 1995 proved to be the first \"Year of Benicio\" as he gave a memorable performance in Swimming with Sharks (1994) before taking critics and film buffs by storm as the mumbling, mysterious gangster in The Usual Suspects (1995), directed by Bryan Singer. Del Toro won an Independent Spirit Award for Best Supporting Actor for the role in the Oscar-winning film. Staying true to his independent roots, he next gave a charismatic turn as cold-blooded gangster Gaspare Spoglia in The Funeral (1996) directed by Abel Ferrara. He also appeared as Benny Dalmau in Basquiat (1996), directed by artist friend Julian Schnabel. That year also marked his first truly commercial film, as he played cocky Spanish baseball star Juan Primo in The Fan (1996), which starred Robert De Niro. Del Toro took his first leading man role in Excess Baggage (1997), starring and produced by Alicia Silverstone. Hand-picked by Silverstone, Del Toro's performance was pretty much the only thing critics praised about the film, and showed the level of consciousness he was beginning to have in the minds of film fans. He took a leading role with his good friend Johnny Depp in Fear and Loathing in Las Vegas (1998), co-written and directed by the legendary Terry Gilliam. Gaining 40 pounds for the role of Dr. Gonzo, the drug-addicted lawyer to sportswriter Raoul Duke, Benicio immersed himself totally in the role. Using his method acting training so far as to burn himself with cigarettes for a scene, this was a trying time for Del Toro. The harsh critical reviews proved tough on him, as he felt he had given his all for the role and been dismissed. Many saw the crazed, psychotic performance as a confirmation of the rumors and overall weirdness that people seemed to place on Del Toro. Taking a short break after the ordeal, 2000 proved to be the second \"Year of Benicio\". He first appeared in The Way of the Gun (2000), directed by friend and writer Christopher McQuarrie. Then he went to work for actor's director Steven Soderbergh in Traffic (2000). A complex and graphic film, this nonetheless became a widespread success and Oscar winner. His role as conflicted Mexican policeman Javier Rodriguez functions as the movie's real heart amid an all-star ensemble cast, and many praised this as the year's best performance, a sentiment validated by a Screen Actor's Guild Award for \"Best Actor\". He also gave a notable performance in Snatch (2000) directed by Guy Ritchie, which was released several weeks later, and The Pledge (2001) directed by Sean Penn. Possessing sleepy good looks reminiscent of James Dean or Marlon Brando, Del Toro has often jokingly been referred to as the \"Spanish Brad Pitt\". With his newfound celebrity, Del Toro has become a sort of heartthrob, being voted one of People magazine's \"50 Most Beautiful People\" as well as \"Most Eligible Bachelors\". A favorite of film fans for years for his diverse and \"cool guy\" gangster roles, he is currently becoming a mainstream favorite respected for his acting skills and choices. So far very careful in his choices and who he works with, Del Toro can boast an impressive resume of films with some of the most influential and respected people in the film business.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzODQ4NzU1N15BMl5BanBnXkFtZTcwOTUzMzc5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001125","name":"Benicio Del Toro","nicknames":["Beno"],"idIMDB":"nm0001125"},"actorId":"nm0001125","character":"Harold Longbaugh","urlCharacter":"http://www.imdb.com/character/ch0014901","main":true},{"actorName":"Juliette Lewis","urlProfile":"http://www.imdb.com/name/nm0000496","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4Nzk1MDgyNV5BMl5BanBnXkFtZTYwNzQ3MDgy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 June 1973","placeOfBirth":" Los Angeles, California, USA","height":"5' 6\" (1.68 m)","bio":"Juliette Lewis has been recognized as one of Hollywood's most talented and versatile actors of her generation since she first stunned audiences and critics alike with her Oscar-nominated performance as \"Danielle Bowden\" in Cape Fear (1991). To date, she has worked with some of the most revered directors in the industry, including Martin Scorsese, Woody Allen, Lasse Hallström, Oliver Stone and Garry Marshall. Whether lending dramatic authenticity or a natural comedic flair to her roles, Lewis graces the screen with remarkable range and an original and captivating style. Lewis was born in Los Angeles, Californa, to Glenis (Duggan) Batley, a graphic designer, and Geoffrey Lewis, an actor. By the age of six, she knew she wanted to be a performer. At twelve, Lewis landed her first leading role in the Showtime miniseries Home Fires (1987). After appearing in several TV sitcoms including The Wonder Years (1988), she made her move to film, starring with Chevy Chase in National Lampoon's National Lampoon's Christmas Vacation (1989) and with Jennifer Jason Leigh in the drama Crooked Hearts (1991). At 16, Lewis starred opposite Brad Pitt in the critically acclaimed television movie Too Young to Die? (1990), catching the attention of Martin Scorsese, who cast her in his thriller Cape Fear (1991). Her powerful scenes with Robert De Niro captured the quiet complexities of adolescence and earned her an Oscar nomination and Golden Globe nomination for \"Best Supporting Actress\". Her auditorium scene with De Niro went down in movie history as one of cinema's classic scenes. Lewis next worked with Woody Allen in Husbands and Wives (1992), playing a self-assured college coed with a penchant for older men and, particularly, her married professor. She quickly followed suit with a succession of starring roles in a variety of blockbusters and critically acclaimed projects including Kalifornia (1993), Romeo Is Bleeding (1993), What's Eating Gilbert Grape (1993) and Natural Born Killers (1994), Oliver Stone's controversial media satire about two mass murderers who become legendary folk heroes. Lewis's other credits include the Nora Ephron comedy Mixed Nuts (1994), with Steve Martin and Adam Sandler; the sci-fi action film Strange Days (1995) with Ralph Fiennes and Angela Bassett; Quentin Tarantino's vampire tale From Dusk Till Dawn (1996) with George Clooney; The Evening Star (1996) with Shirley MacLaine; the Garry Marshall-directed The Other Sister (1999), and Todd Phillips' Old School (2003), co-starring opposite Luke Wilson, Vince Vaughn, and Will Ferrell as well as Starsky & Hutch (2004). In addition to her film career, Lewis has continued to add roles to her growing list of television credits with a performance in Showtime's My Louisiana Sky (2001), for which she secured an EMMY nomination, and a starring role in the Mira Nair-directed HBO's film Hysterical Blindness (2002), alongside Uma Thurman and Gena Rowlands. After a six-year hiatus from film to pursue her burgeoning music career exclusively, Lewis announced her return to acting with a handful of upcoming movies. Juliette starred alongside Ellen Page, Marcia Gay Harden, Kristen Wiig and Jimmy Fallon in the comedy Whip It (2009). The film was released by Fox Searchlight on October 2nd, 2009. Directed by Drew Barrymore, the film tells the story of an ex-beauty pageant contestant that leaves her crowns behind after joining a roller derby team. Lewis plays \"Iron Maven\", the star of a top derby team. Next, she joined the cast of the acclaimed European animated thriller Metropia (2009), as the voice of \"Nina\". She also appeared in the romantic comedy The Switch (2010), opposite Jennifer Aniston, Jason Bateman and Patrick Wilson. The film tells the story of a single mother (Aniston) who decides to have a child using a sperm donor. Juliette plays \"Debbie Epstein\", the best friend of Aniston's character. Lewis also appears in Sympathy for Delicious (2010), Mark Ruffalo's directorial debut. The film follows a paralyzed DJ, struggling to survive on the streets of LA who turns to faith healing and mysteriously develops the ability to cure the sick. Juliette plays \"Ariel\", costarring alongside Orlando Bloom, Mark Ruffalo and Laura Linney. The film took home the US Dramatic Special Jury Prize at the 2010 Sundance Film Festival. Most recently, Juliette Lewis appears in the indie-drama Conviction (2010), which stars Hilary Swank, Melissa Leo, Minnie Driver and Sam Rockwell. She plays \"Roseanna Perry\" in the true story of an unemployed single mother (Swank) who saw her brother begin serving a life sentence in 1983 for murder and robbery. The role has won Lewis praise from audiences and critics, alike, for her performance, with USA Today saying, \"Juliette Lewis has an indelible role\" and the San Francisco Chronicle saying \"Her character work should be studied in schools. Just remarkable\". In addition to Conviction (2010), Lewis also makes a cameo in Todd Phillips' comedy, Due Date (2010), starring Robert Downey Jr., Michelle Monaghan and Zach Galifianakis. Beginning in 2004, Juliette took a hiatus from acting to embark on a musical journey. After six years, two full length albums and countless high profile tours and festival gigs with her band, 'Juliette & the Licks', Juliette set out on a solo career. Releasing \"Terra Incognita\" last fall, the album has taken her all across the world from Europe to Japan to Turkey, Australia, North America and Canada. For more information on Juliette Lewis' music, please visit her MySpace page. Juliette Lewis resides in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4Nzk1MDgyNV5BMl5BanBnXkFtZTYwNzQ3MDgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000496","name":"Juliette Lewis","idIMDB":"nm0000496"},"actorId":"nm0000496","character":"Robin","urlCharacter":"http://www.imdb.com/character/ch0014900","main":true},{"actorName":"Taye Diggs","urlProfile":"http://www.imdb.com/name/nm0004875","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MjQwOTQzNV5BMl5BanBnXkFtZTYwMzE5Njc4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 January 1971","placeOfBirth":" Newark, New Jersey, USA","birthName":"Scott L. Diggs","height":"5' 10\" (1.78 m)","bio":"Taye Diggs was born in Newark, New Jersey, and was raised in Rochester, New York. He is the son of Marcia (Berry), a teacher and actress, and Andre Young, a visual artist. When he was a child, his mother married Jeffries Diggs, whose surname Taye took. He received a BFA degree in musical theater from Syracuse University. Taye made his show business debut in the ensemble cast of the five-time Tony Award winning play \"Carousel.\" Taye Diggs is the oldest of five. His two brothers are musicians, one sister is a dancer and the other is going to college to be a veterinarian.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MjQwOTQzNV5BMl5BanBnXkFtZTYwMzE5Njc4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004875","name":"Taye Diggs","idIMDB":"nm0004875"},"actorId":"nm0004875","character":"Jeffers","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicky Katt","urlProfile":"http://www.imdb.com/name/nm0441588","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0NzU0MDczMF5BMl5BanBnXkFtZTYwNzc0Mjkz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 May 1970","placeOfBirth":" South Dakota, USA","birthName":"Nicky Agustin Katt","height":"5' 10\" (1.78 m)","bio":"Nicky Katt has been acting since the age of 7, when he appeared on the TV series CHiPs (1977) in 1977. He continued to work steadily through the 1980s on shows like Quincy M.E. (1976), Father Murphy (1981), and V (1984) but did not fall into the trap of many child actors who became identified with one famous role because his child roles were as guest spots or, as in the case of Herbie, the Love Bug (1982), were canceled early on, or can't get work as adults and allow their lives to fall to pieces. In a way, Katt has had two careers. The one as the child actor of the late 1970s and early 1980s, and as the character actor of the 1990s who so often played the bully or thug. Extremely talented and at ease in front of a camera in the medium of either television or feature film, Katt has had a very impressive body of work for someone of his age and looks to gain much in the way of future stardom as the series Boston Public (2000) clearly exhibits his leading-man potential.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0NzU0MDczMF5BMl5BanBnXkFtZTYwNzc0Mjkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0441588","name":"Nicky Katt","idIMDB":"nm0441588"},"actorId":"nm0441588","character":"Obecks","urlCharacter":"http://www.imdb.com/character/ch0026782","main":true},{"actorName":"Geoffrey Lewis","urlProfile":"http://www.imdb.com/name/nm0507212","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MjM0MDU0MF5BMl5BanBnXkFtZTYwOTQ0NDky._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1935","placeOfBirth":" Plainfield, New Jersey, USA","birthName":"Geoffrey Bond Lewis","height":"5' 9\" (1.75 m)","bio":"Talented and highly capable character actor Geoffrey Lewis, with rustic (sometimes sour-faced) looks, grew up in Rhode Island but was moved out to California at the age of ten. Lewis was very keen on the dramatic arts at high school, but often preferred to put on his own one-man shows rather than participate in larger school productions. His drama teacher took note of his growing talent and referred him to the Plymouth Theater in Massachusetts, where he appeared in summer stock. Afterwards he appeared in several off-Broadway productions in New York City. After spending considerable time traveling, in both the United States and abroad, Lewis turned his attention back to his love of the dramatic arts, and scored his first minor movie role in The Culpepper Cattle Co. (1972) as a somewhat jovial but deadly cowhand. He then cropped up as gangster Harry Pierpont in Dillinger (1973) before beginning a long association with Clint Eastwood, starting off with High Plains Drifter (1973), then as kind-hearted thief Eddie Goody in Thunderbolt and Lightfoot (1974), as Clint's buddy Orville Boggs in Every Which Way But Loose (1978) and Any Which Way You Can (1980), then as a henpecked husband in Bronco Billy (1980), as Ricky Z in Pink Cadillac (1989), and in Midnight in the Garden of Good and Evil (1997). Equally busy on the small screen, he has guest-starred in dozens of episodes of high profile TV series. Additionally, he received a Golden Globe nomination for his performance in the series Flo (1980). Apart from his extensive film and TV exposure, Lewis is also a member of the rather unique musical/storytelling \"Celestial Navigations,\" along with award-winning composer songwriter Geoff Levin. Their performances have received terrific reviews from some of Hollywood's top actors and noted musicians, including Chick Corea. As Geoffrey Lewis approaches his seventh decade, nothing seems likely to slow down this multi-talented actor, storyteller and engaging entertainer!","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MjM0MDU0MF5BMl5BanBnXkFtZTYwOTQ0NDky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0507212","name":"Geoffrey Lewis","idIMDB":"nm0507212"},"actorId":"nm0507212","character":"Abner Mercer","urlCharacter":"http://www.imdb.com/character/ch0014903","main":true},{"actorName":"Dylan Kussman","urlProfile":"http://www.imdb.com/name/nm0476378","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzc2NTU1Ml5BMl5BanBnXkFtZTgwMDkyNzU2MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"A professional actor since 1985, Dylan got his big break as Richard Cameron in \"Dead Poets Society\". He has since appeared in numerous feature films, including \"Wild Hearts Can't Be Broken\", \"Jack Reacher\", \"Flight\", \"X2\", and \"The Way of the Gun\", and has worked alongside such cinematic luminaries as Cliff Robertson, James Caan, Cathy Bates, Benicio Del Toro, Brian Cox, Alfre Woodard, Sir Ian McCellan, Patrick Stewart, and the late Robin Williams. His television credits include appearances on \"Monk\", \"House\", \"Without A Trace\", \"Cold Case\", \"The X-Files\" and \"Drop Dead Diva\". A longtime screenwriter and member of the WGAW since 2005, he is the sole or contributing writer on \"Booth\", \"The Mayor of Castro Street\", \"The Ghost Inside\" and \"Mission Blacklist\", as well as being the writer, director, and star of the critically-acclaimed Web series \"The Steps\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzc2NTU1Ml5BMl5BanBnXkFtZTgwMDkyNzU2MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0476378","name":"Dylan Kussman","idIMDB":"nm0476378"},"actorId":"nm0476378","character":"Dr. Allen Painter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott Wilson","urlProfile":"http://www.imdb.com/name/nm0934113","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMjA2MDA4NF5BMl5BanBnXkFtZTgwNDM4MzMzNDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 March 1942","placeOfBirth":" Atlanta, Georgia, USA","height":"5' 10¾\" (1.8 m)","bio":"One chillingly infamous screen role for Scott Wilson in 1967 set the tone for an actor who went on to prove himself an invaluable character player for the past five decades. The Georgia-born native (Atlanta born and raised) was awarded a basketball scholarship following high school at Georgia's Southern Tech University to study architecture. Instead, Wilson hitchhiked to Los Angeles on a whim and hooked up one day with an actor he met in a bar who took him to one of his auditions. Allowed to audition himself by chance, Wilson lost the part but was absolutely hooked. Working an assortment of menial jobs, he studied for nearly five years while gaining experience in such local theater productions as \"The Importance of Being Earnest.\" Scott's fledgling career took off big time after being discovered by director Norman Jewison who cast him as a murder suspect in In the Heat of the Night (1967) starring Sidney Poitier and \"Best Actor\" Oscar winner Rod Steiger. If that weren't a sufficient beginning, Wilson immediately followed this with the co-lead role of murderer Richard Hickok in the stark and disturbing In Cold Blood (1967), a superlative adaptation of Truman Capote best-selling docu-novel. It didn't hurt that Scott himself had a startling resemblance to the real-life killer. Partnering up with Robert Blake as two ex-cons who are eventually executed for the senseless, brutal slaughter of an entire Kansas farm family, the critically acclaimed film put both men squarely on the movie map. Although a serious contender, out-and-out stardom did not come about for the quietly handsome, slightly forlorn-looking actor. Major roles in major pictures, however, did. Among Scott's early film work were Castle Keep (1969) and The Gypsy Moths (1969), both starring Burt Lancaster; The Grissom Gang (1971); Lolly-Madonna XXX (1973) (again with Steiger); The New Centurions (1972); The Great Gatsby (1974), in which he earned raves as the garage owner who shoots Robert Redford's title character to death in Gatsby's backyard swimming pool; The Ninth Configuration (1980), for which he received a Golden Globe nomination; The Right Stuff (1983); the Venice Film Festival winner L'année du soleil calme (1984) [A Year of the Quiet Sun]; Malone (1987) and Johnny Handsome (1989). TV also showed off Scott's dark, controlled intensity and wide range in later years, appearing in guest spots on such popular dramas as \"The X-Files\" and \"The Twilight Zone,\" and in a recurring role as Marg Helgenberger's unscrupulous mobster father in \"CSI.\" In minimovies Scott played everything from Elvis's father in Elvis and the Colonel: The Untold Story (1993) to a Wyoming governor in The Jack Bull (1999). Hardly one of Hollywood's flashiest good ol' boys, the taciturn, unassuming actor has preferred to remain discrete and let his performances do the talking. His output has been minimal compared with other character stars, but he has remained in the quality ranks nevertheless, mixing his standard penchant for darker movies with such family-oriented films as Shiloh (1996) and its 2006 sequel. Supporting the newer \"young guns\" these days, he appeared with Vince Vaughn in Clay Pigeons (1998) and Ryan Phillippe in The Way of the Gun (2000), and ended up one of serial killer Charlize Theron's victims in Monster (2003). Other strong showings on the big screen have included a lead part as a rockabilly star in Don't Let Go (2002) and his down-home patriarch in the superb ensemble art film Junebug (2005), a breakout hit with Academy voters. More recently, Scott has gained a following sporting a full grey beard and ponytailed as grizzled farm owner Hershel Greene in the cable series The Walking Dead: Webisodes (2011). Wilson resides in Los Angeles along with his wife of nearly four decades, Heavenly, an attorney and accomplished artist and writer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMjA2MDA4NF5BMl5BanBnXkFtZTgwNDM4MzMzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0934113","name":"Scott Wilson","idIMDB":"nm0934113"},"actorId":"nm0934113","character":"Hale Chidduck","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kristin Lehman","urlProfile":"http://www.imdb.com/name/nm0005138","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyODM4ODMxN15BMl5BanBnXkFtZTcwMzAxMjQ1NA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 May 1972","placeOfBirth":" New Westminster, British Columbia, Canada","height":"5' 6\" (1.68 m)","bio":"Canadian actress Kristin Lehman, who was born in New Westminster and grew up in Vancouver, has begun establishing herself in the United States after a relatively prosperous career North of the Border. Lehman played a poker sharpie called \"Miami\" in the American TV series \"Tilt\", an ESPN original set in Las Vegas' professional gambling demimonde. Recently, the unconventional beauty took over the lead female role on the Fox crime drama Killer Instinct (2005) from Marguerite Moreau, who appeared in the pilot. In this series, she plays San Francisco police detective \"Marcy Hess\", who teams up with a male detective, played by Johnny Messner, to solve bizarre crimes in the city known as \"Bagdad by the Bay\". Well-known in her native Canada, Lehman's TV credits include Century City (2004), Kevin Hill (2004), Poltergeist, les aventuriers du surnaturel (1996), Strange World (1999) and the mini-series Verdict in Blood (2002). She's appeared in the films The Chronicles of Riddick (2004) starring Vin Diesel and Judi Dench, The Way of the Gun (2000) with James Caan and Benicio Del Toro, Dog Park (1998) with Luke Wilson and Natasha Henstridge and Alaska (1996) with Thora Birch and Charlton Heston. She will appear in the soon-to-be-released film The Sentinel (2006) with fellow-Canandian Kiefer Sutherland. Lehman currently lives in Vancouver.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyODM4ODMxN15BMl5BanBnXkFtZTcwMzAxMjQ1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005138","name":"Kristin Lehman","idIMDB":"nm0005138"},"actorId":"nm0005138","character":"Francesca Chidduck","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Caan","urlProfile":"http://www.imdb.com/name/nm0001001","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NjkyNDQ3NV5BMl5BanBnXkFtZTcwNjY5NTQ0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1940","placeOfBirth":" The Bronx, New York, USA","birthName":"James Edmund Caan","height":"5' 9¼\" (1.76 m)","bio":"A masculine and enigmatic actor whose life and movie career have had more ups and downs than the average rollercoaster and whose selection of roles has arguably derailed him from achieving true superstar status, James Caan is New York-born and bred. He was born in the Bronx, to Sophie (Falkenstein) and Arthur Caan, Jewish immigrants from Germany. His father was a meat dealer and butcher. The athletically gifted Caan played football at Michigan State University while studying economics, holds a black belt in karate and for several years was even a regular on the rodeo circuit, where he was nicknamed \"The Jewish Cowboy\". However, while studying at Hofstra University, he became intrigued by acting and was interviewed and accepted at Sanford Meisner's Neighborhood Playhouse. He then won a scholarship to study under acting coach Wynn Handman and began to appear in several off-Broadway productions, including \"I Roam\" and \"Mandingo\". He made his screen debut as a sailor in Irma la Douce (1963) and began to impress audiences with his work in Red Line 7000 (1965) and the western El Dorado (1967) alongside John Wayne and Robert Mitchum. Further work followed in Journey to Shiloh (1968) and in the sensitive The Rain People (1969). However, audiences were moved to tears as he put in a heart-rending performance as cancer-stricken Chicago Bears running back Brian Piccolo in the highly rated made-for-TV film Brian's Song (1971). With these strong performances under his belt, Francis Ford Coppola then cast him as hot-tempered gangster Santino \"Sonny\" Corleone in the Mafia epic The Godfather (1972). The film was an enormous success, Caan scored a Best Supporting Actor nomination and, in the years since, the role has proven to be the one most fondly remembered by his legion of fans. He reprised the role for several flashback scenes in the sequel The Godfather: Part II (1974) and then moved on to several very diverse projects. These included a cop-buddy crime partnership with Alan Arkin in the uneven Freebie and the Bean (1974), a superb performance as a man playing for his life in The Gambler (1974) alongside Lauren Hutton, and pairing with Barbra Streisand in Funny Lady (1975). Two further strong lead roles came up for him in 1975, first as futuristic sports star \"Jonathon E\" questioning the moral fiber of a sterile society in Rollerball (1975) and teaming up with Robert Duvall in the Sam Peckinpah spy thriller The Killer Elite (1975). Unfortunately, Caan's rising star sputtered badly at this stage of his career, and several film projects failed to find fire with either critics or audiences. These included such failures as the hokey Harry and Walter Go to New York (1976), the quasi-western Comes a Horseman (1978) and the saccharine Chapter Two (1979). However, he did score again with the stylish Michael Mann-directed heist movie Thief (1981). He followed this with a supernatural romantic comedy titled Kiss Me Goodbye (1982) and then, due to personal conflicts, dropped out of the spotlight for several years before returning with a stellar performance under old friend Francis Ford Coppola in the moving Gardens of Stone (1987). Caan appeared back in favor with fans and critics alike and raised his visibility with the sci-fi hit Alien Nation (1988) and Dick Tracy (1990), then surprised everyone by playing a meek romance novelist held captive after a car accident by a deranged fan in the dynamic Misery (1990). The 1990s were kind to him and he notched up roles as a band leader in For the Boys (1991), another gangster in Honeymoon in Vegas (1992), appeared in the indie hit Bottle Rocket (1996) and pursued Arnold Schwarzenegger in Eraser (1996). The demand on Caan's talents seems to have increased steadily over the past few years as he is making himself known to a new generation of fans. Recent hot onscreen roles have included The Yards (2000), City of Ghosts (2002) and Dogville (2003). In addition, he finds himself at the helm of the hit TV series Las Vegas (2003) as casino security chief \"Big Ed\" Deline. An actor of undeniably manly appeal, James Caan continues to surprise and delight audiences with his invigorating performances.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NjkyNDQ3NV5BMl5BanBnXkFtZTcwNjY5NTQ0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001001","name":"James Caan","nicknames":["Jimmy"],"idIMDB":"nm0001001"},"actorId":"nm0001001","character":"Joe Sarno","urlCharacter":"http://www.imdb.com/character/ch0014902","main":true},{"actorName":"Henry Griffin","urlProfile":"http://www.imdb.com/name/nm0341213","urlPhoto":"","biography":{"bio":"Henry Griffin is an actor, known for The Way of the Gun (2000), Hamlet (2000) and The Price of Flowers (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0341213","name":"Henry Griffin","idIMDB":"nm0341213"},"actorId":"nm0341213","character":"P. Whipped","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Armando Guerrero","urlProfile":"http://www.imdb.com/name/nm0346161","urlPhoto":"","biography":{"dateOfBirth":"7 July 1952","placeOfBirth":" El Paso, Texas, USA","height":"5' 8\" (1.73 m)","bio":"Armando Guerrero was born on July 7, 1952 in El Paso, Texas, USA. He is known for his work on Man on the Moon (1999), Chute libre (1993) and Casa de mi Padre (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0346161","name":"Armando Guerrero","nicknames":["Mando"],"idIMDB":"nm0346161"},"actorId":"nm0346161","character":"Federale #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andres Orozco","urlProfile":"http://www.imdb.com/name/nm0650451","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MjM5ODkzOV5BMl5BanBnXkFtZTYwMTAyNDAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Andres Orozco is an actor and producer, known for The Way of the Gun (2000), Consejos (2008) and Yo Soy Tu Niña (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MjM5ODkzOV5BMl5BanBnXkFtZTYwMTAyNDAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0650451","name":"Andres Orozco","idIMDB":"nm0650451"},"actorId":"nm0650451","character":"Federale #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jan Hanks","urlProfile":"http://www.imdb.com/name/nm0360024","urlPhoto":"","biography":{"bio":"Jan Hanks is an actress, known for The Way of the Gun (2000), A Life Less Ordinary (1997) and The Runner (1999). She has been married to David Jensen since November 29, 1996.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0360024","name":"Jan Hanks","idIMDB":"nm0360024"},"actorId":"nm0360024","character":"Receptionist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"José Pérez","urlProfile":"http://www.imdb.com/name/nm0673526","urlPhoto":"","biography":{"dateOfBirth":"1940","placeOfBirth":" New York City, New York, USA","bio":"José Pérez was born in 1940 in New York City, New York, USA. He is an actor, known for The Mask of Zorro (1998), The Way of the Gun (2000) and Miami Blues (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0673526","name":"José Pérez","idIMDB":"nm0673526"},"actorId":"nm0673526","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0202677","urlIMDB":"http://www.imdb.com/title/tt0202677","business":{"budget":{"money":"$8,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$2,150,979","country":"USA","day":"10","month":"09","year":"2000","remarks":"1,515 Screens"},{"money":"£191,169","country":"UK","day":"19","month":"11","year":"2000","remarks":"141 Screens"},{"money":"€95,360","country":"Spain","day":"29","month":"09","year":"2002","remarks":"154 Screens"}],"gross":[{"money":"$6,047,856","country":"USA","day":"22","month":"10","year":"2000","remarks":""},{"money":"$5,997,771","country":"USA","day":"15","month":"10","year":"2000","remarks":""},{"money":"$5,834,567","country":"USA","day":"08","month":"10","year":"2000","remarks":""},{"money":"$5,596,579","country":"USA","day":"01","month":"10","year":"2000","remarks":""},{"money":"$5,225,573","country":"USA","day":"24","month":"09","year":"2000","remarks":""},{"money":"$4,253,728","country":"USA","day":"17","month":"09","year":"2000","remarks":""},{"money":"$2,150,979","country":"USA","day":"10","month":"09","year":"2000","remarks":""},{"money":"£358,446","country":"UK","day":"26","month":"11","year":"2000","remarks":""},{"money":"£191,169","country":"UK","day":"19","month":"11","year":"2000","remarks":""},{"money":"$324,922","country":"France","day":"14","month":"12","year":"2000","remarks":""},{"money":"€95,360","country":"Spain","day":"29","month":"09","year":"2002","remarks":""}],"weekendGross":[{"money":"$18,906","country":"USA","day":"22","month":"10","year":"2000","remarks":"79 Screens"},{"money":"$77,033","country":"USA","day":"15","month":"10","year":"2000","remarks":"204 Screens"},{"money":"$151,017","country":"USA","day":"08","month":"10","year":"2000","remarks":"372 Screens"},{"money":"$191,160","country":"USA","day":"01","month":"10","year":"2000","remarks":"405 Screens"},{"money":"$442,372","country":"USA","day":"24","month":"09","year":"2000","remarks":"822 Screens"},{"money":"$1,217,915","country":"USA","day":"17","month":"09","year":"2000","remarks":"1,565 Screens"},{"money":"$2,150,979","country":"USA","day":"10","month":"09","year":"2000","remarks":"1,515 Screens"},{"money":"£63,772","country":"UK","day":"26","month":"11","year":"2000","remarks":"116 Screens"},{"money":"£191,169","country":"UK","day":"19","month":"11","year":"2000","remarks":"141 Screens"},{"money":"€95,360","country":"Spain","day":"29","month":"09","year":"2002","remarks":"154 Screens"}],"admissions":[{"money":"20,518","country":"Spain","day":"29","month":"09","year":"2002","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"16","month":"09","year":"1999","remarks":null},{"money":null,"country":null,"day":"07","month":"12","year":"1999","remarks":null}],"copyrightHolder":"copyright MM Artisan Film Investors Trust"},"technical":{"runtime":["1 hr 59 min (119 min)","2 hr (120 min) (Spain)"],"soundMix":["Dolby Digital","SDDS","DTS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Moviecam Compact, Cooke S4 Lenses","Moviecam SL, Cooke S4 Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm (Kodak Vision 200T 5274, Vision 500T 5279)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm (Fuji F-CP 3519)"]},"rating":"6.7","metascore":"49","filmingLocations":[{"location":"Abandoned Gas Station, Skull Valley, Utah, USA"}],"rated":"R","awards":[],"votes":"28,127","type":"Movie","companyCreditsSimple":[{"idCompany":"co0014903","name":"Artisan Entertainment"},{"idCompany":"co0077965","name":"Aqaba Productions"}],"keywords":{"keywords":["criminal","surrogate mother","money","gangster","drifter","baby","mexico","kidnapping","ransom","watching television","attempted suicide","police shootout","female gunfighter","neo western","thrown from a car","business card","southern accent","pimp","hotel","sperm bank","federale","pulp fiction","poetic justice","tied to a bed","left for dead","character repeating someone else's dialogue","bilingual","unsubtitled foreign language","apartment","landlord","stalker","wrongful arrest","arrest","gun violence","injection","toilet","coffee","revelation","one against many","impalement","bare chested male","tattoo","shower","attempted murder","crying","screaming","disobeying orders","rescue","truck","interrogation","old man","paranoia","pay phone","phone book","massacre","offscreen killing","masked man","redemption","revenge","tragic ending","childbirth","videotape","organized crime","accountant","elevator","escape","mexican standoff","dual wield","stylized violence","2000s","conspiracy","diner","evacuation","eavesdropping","pregnant woman","sole black character dies cliche","convenience store","friendship","money launderer","enforcer","written by director","directorial debut","telephone call","no cell phone signal","walkie talkie","gas station","rifle","machine gun","shot through a window","shot through a wall","shot through a door","disarming someone","desert eagle","ak 47","tough guy","two man army","danger","extramarital affair","f word","product placement","gunslinger","existentialism","suspense","modern western","fugitive","on the run","bulletproof vest","nightclub","head butt","black comedy","blood on face","opening action scene","spit in the face","man punches a woman","fight","fistfight","shot in the arm","double cross","blood splatter","hypodermic needle","buttocks","labor pains","police station","telescopic rifle","police officer","gunshot wound","police arrest","binoculars","pump action shotgun","video cassette","sniper","playing cards","revolver","laundry","pursuit","gunfight","stretcher","ambulance","desert","gore","police car","tears","gunshot","scar","anger","brawl","siren","truck stop","face slap","security","hostage","service station","pregnant woman in jeopardy","voice over narration","older man younger woman relationship","cell phone","stealing a car","stalking","sonogram","sniper rifle","shotgun","shot in the throat","shot in the shoulder","shot in the crotch","shot in the chest","shoplifting","scheming wife","russian roulette","punched in the face","prostitute","police officer killed","pistol","old friend","murder","motel","kicked in the stomach","interview","innocent person killed","infidelity","husband wife relationship","held at gunpoint","gash on arm","father son relationship","double barreled shotgun","death","corpse","cigarette smoking","cheating wife","card game","car crash","car chase","butt slap","bullet proof vest","brothel","blood on shirt","bleeding to death","betrayal","beating","bar","bagman","bag of money","ambush","interracial relationship","suicide","shot to death","shot in the stomach","shot in the neck","shot in the leg","shot in the foot","shot in the back","pistol whip","deception","blood","torture","gun","deceit","cult film","bullet wound","anti hero","doctor","pregnancy","bodyguard","shootout","fragments of glass","gay slur","violence","sperm donor","showdown","neo noir","independent film","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:25:50"}}