{"data":{"movies":[{"title":"Boat Trip","originalTitle":"","year":"2002","releaseDate":"20030321","directors":[{"name":"Mort Nathan","id":"nm0622240"}],"writers":[{"name":"Mort Nathan","id":"nm0622240"},{"name":"William Bigelow","id":"nm0988951"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNzQ4MjczMV5BMl5BanBnXkFtZTYwNjEzNTk5._V1.jpg","countries":["USA","Germany"],"languages":["English","Swedish","Spanish"],"genres":["Comedy"],"plot":"Jerry and Nick are two best buddies whose love lives have hit rock bottom, Jerry's especially, having just vomited all over his fiancée on a hot air balloon trip prior to proposing to her. To escape their troubles and find women, they book a trip on board a cruise-liner, unaware the travel agent has just played a horrid trick on them in retaliation for Nick offending his secret gay lover. And that's the trick; it's a gay cruise-liner for gay men to meet and mingle. Slowly but surely, the two main characters begin to realize this and in turn get into a lot of humorous predicaments.","simplePlot":"Two straight men mistakenly end up on a \"gays only\" cruise.","actors":[{"actorName":"Cuba Gooding Jr.","urlProfile":"http://www.imdb.com/name/nm0000421","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMzk4NjQ2Ml5BMl5BanBnXkFtZTYwNzc3ODI4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 January 1968","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"Cuba M. Gooding Junior","height":"5' 10\" (1.78 m)","bio":"Cuba Gooding Jr. was born on January 2, 1968, in The Bronx, New York. His mother, Shirley (Sullivan), was a backup singer for The Sweethearts. His father, Cuba Gooding, was the lead vocalist for the R&B group The Main Ingredient, which had a hit with the song \"Everybody Plays The Fool\". His paternal grandfather was from Barbados. Cuba's father moved the family to Los Angeles in 1972, only to leave them a few years later. Despite this setback, Cuba was able to maintain a positive outlook and overachieved throughout school. He attended four different high schools and was elected class president in three of them. While at high school, Cuba met and fell in love with Sara Kapfer, whom he later lived with for seven years before tying the knot in March 1994. Following high school, Cuba studied Japanese martial arts for three years before turning his focus toward acting. Early on, he landed guest starring roles on shows like Hill Street Blues (1981) and MacGyver (1985). His first major role was in the 1991 box office surprise Boyz n the Hood (1991). He followed this success with supporting roles in major films like A Few Good Men (1992), Lightning Jack (1994) and Outbreak (1995). In 1996, Cuba was cast as an arrogant but loyal football player in the Tom Cruise-Cameron Crowe film Jerry Maguire (1996). The film became a huge box office smash and earned Cuba an Academy Award for Best Supporting Actor. His \"Show Me The Money\" line in the movie became a nationwide catchphrase. The role elevated him to superstar status, as many of Hollywood's top producers began to \"show him the money\" to appear in their films. Since Jerry Maguire (1996), Cuba has managed to keep busy with a wide range of roles alongside many of Hollywood's biggest stars. Most recently, he won critical support for his portrayal of a mentally handicapped man in the heartwarming film Radio (2003), another movie about football. In 2002, he was given a star on the Hollywood Walk of Fame. He resides in Studio City, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMzk4NjQ2Ml5BMl5BanBnXkFtZTYwNzc3ODI4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000421","name":"Cuba Gooding Jr.","idIMDB":"nm0000421"},"actorId":"nm0000421","character":"Jerry Robinson","urlCharacter":"http://www.imdb.com/character/ch0019048","main":true},{"actorName":"Horatio Sanz","urlProfile":"http://www.imdb.com/name/nm0764445","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU0MjIyOTQwNl5BMl5BanBnXkFtZTcwNjQ1OTQ2Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1969","placeOfBirth":" Santiago, Chile","height":"5' 8\" (1.73 m)","bio":"Horatio Sanz was born on June 4, 1969, in Santiago, Chile, and raised in Chicago, Illinois. He was one of the Upright Citizen Brigade's founding members and performed with Chicago's Second City comedy troupe. When he joined the cast of Saturday Night Live (1975) as a featured player at the beginning of the 24th season (September 26, 1998), he became the long-running sketch comedy show's first Latino cast member. He appeared along with fellow featured players Jimmy Fallon and Chris Parnell, and after only one season, the three were promoted to cast members. On the show, Horatio played the characters Frankie Hilbert on the sketch \"Boston Teens\", pothead Gobi on the recurring sketch \"Jarret's Room\", and A/V teacher Mr. Banglian on \"Wake Up, Wakefield.\" Horatio has had many minor but memorable roles in movies since 1994. However, his big break came in 2003 with his first starring role in the movie Boat Trip (2002), in which he appeared along with Cuba Gooding Jr. and Vivica A. Fox. He continued to star on Saturday Night Live (1975) until 2007.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU0MjIyOTQwNl5BMl5BanBnXkFtZTcwNjQ1OTQ2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0764445","name":"Horatio Sanz","nicknames":["Roger","Raj"],"idIMDB":"nm0764445"},"actorId":"nm0764445","character":"Nick Ragoni","urlCharacter":"http://www.imdb.com/character/ch0019051","main":true},{"actorName":"Roselyn Sanchez","urlProfile":"http://www.imdb.com/name/nm0761052","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDYyYjM0MWItMTIwYy00NTE0LTliZjItYzVhMTcwYTQ0YzczL2ltYWdlXkEyXkFqcGdeQXVyNzIyNDYwNTg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 April 1973","placeOfBirth":" San Juan, Puerto Rico","height":"5' 5\" (1.65 m)","bio":"Roselyn Sanchez was born on April 2, 1973 in San Juan, Puerto Rico. She is an actress, known for Rush Hour 2 (2001), Without a Trace (2002) and The Game Plan (2007). She has been married to Eric Winter since November 29, 2008. They have one child. She was previously married to Gary Stretch.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDYyYjM0MWItMTIwYy00NTE0LTliZjItYzVhMTcwYTQ0YzczL2ltYWdlXkEyXkFqcGdeQXVyNzIyNDYwNTg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0761052","name":"Roselyn Sanchez","nicknames":["Popi","Ros"],"idIMDB":"nm0761052"},"actorId":"nm0761052","character":"Gabriella","urlCharacter":"http://www.imdb.com/character/ch0031481","main":true},{"actorName":"Vivica A. Fox","urlProfile":"http://www.imdb.com/name/nm0000407","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxNDM2NDU1MF5BMl5BanBnXkFtZTgwMTc5MTQ2NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1964","placeOfBirth":" South Bend, Indiana, USA","birthName":"Vivica Anjanetta Fox","height":"5' 7\" (1.7 m)","bio":"Vivica A. Fox was born in South Bend, Indiana, on July 30, 1964, and is the daughter of Everlyena, a pharmaceutical technician, and William Fox, a private school administrator. She is of Native American and African-American descent and is proud of her heritage. She is a graduate of Arlington High School in Indianapolis, Indiana, and, after graduating, moved to California to attend college. Vivica went to Golden West College and graduated with an Associate Art degree in Social Sciences. While in California, she started acting professionally, first on soap operas, such as Generations (1989), Days of Our Lives (1965) and The Young and the Restless (1973). In another early role, she played Patti LaBelle's fashion designer daughter, \"Charisse Chamberlain\", on the NBC-TV series, Out All Night (1992). Her first big break was in the film, Independence Day (1996), along with Will Smith, and also Set It Off (1996). She has earned critical acclaim for her portrayal of \"Maxine\" in the 1997 motion picture, Soul Food (1997), which netted her MTV Movie Award and NAACP Image Award nominations. In 2000, she was casted in the medical drama, City of Angels (2000), as \"Dr. Lillian Price\". She has had roles in many other movies ever since, such as: Teaching Mrs. Tingle (1999), Two Can Play That Game (2001) and Kill Bill: Vol. 1 (2003). In 2004, Fox was in an episode of Punk'd (2003), where her pregnant friend pretended to go into labor, but they became angry when a paramedic appeared to care more about taking pictures than delivering the baby. Vivica also took another television role, from 2004 to 2006, as she starred in the drama series, 1-800-Missing (2003), on the Lifetime Television Network. In 2007, she was a contender on Dancing with the Stars (2005) and stayed until she was voted off in the fourth week. In 1998, Vivica A. Fox married singer Christopher Harvest (aka Sixx-Nine), whom she later divorced in June 2002. She also dated rapper 50 Cent, however this was a brief relationship.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxNDM2NDU1MF5BMl5BanBnXkFtZTgwMTc5MTQ2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000407","name":"Vivica A. Fox","nicknames":["Angie"],"idIMDB":"nm0000407"},"actorId":"nm0000407","character":"Felicia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maurice Godin","urlProfile":"http://www.imdb.com/name/nm0324070","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY4ODAxNzQ1OF5BMl5BanBnXkFtZTcwNTMzMDAzMQ@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"bio":"Maurice Godin was born in Toronto, Canada and is currently a resident of the United States. For over thirty years, he has been acting in theatre, television and film. He received four years of classical conservatory training at Ryerson Theatre School in Toronto after which he completed an apprenticeship at the Shaw Festival in Canada. He continued his actor training with international teachers and coaches at the Stratford Shakespearean Festival where he had the privilege of working with some of the foremost international stage directors. His theatre career has taken him from coast to coast across Canada where he has starred in the major theaters of almost every province, including the prestigious Shaw Festival and the Stratford Shakespearean Festival, where he garnered critical acclaim for his portrayal of Arturo Ui in Brecht's The Resistible Rise of Arturo Ui. Some of his numerous theatre credits include Mercutio in Romeo and Juliet, D'Artagnan in The Three Musketeers, Constantin in The Seagull, Puck in A Midsummer Night's Dream and Rochester in Jane Eyre. Maurice has also performed extensively in Musical Theatre most notably in the roles of the Emcee in Cabaret, the Master in Godspell, Joey Evans in Pal Joey, Herschel Blackwell in Fire and in an award-winning performance of Screamin' John in John Gray's Rock and Roll. He recently returned to the Stratford stage to give a much lauded performance as Edmund in King Lear, starring Christopher Plummer. Among his many television credits, Godin has guest-starred on The Practice, Ally McBeal, Friends, Outer Limits and Sienfeld. Maurice has also played recurring characters on Poltergeist, Third Rock from the Sun, Spin City, First Monday and Spin City. He has been a series regular on Café Americain, Life with Roger, and Working. His feature film work includes such Canadian films as White Room, Salt Water Moose, Double Take, and an unforgettable film location in the beautiful city of Prague where he was fortunate enough to portray George Bizet in Bizet's Dream. He played the flamboyant role of Hector in the film Boat Trip and has just recently completed guest star work On Medical Investigation, House, Vegas as well as a comic turn as Wesley the bumbling burglar in the film Chestnut (Hero of Central Park) Godin is currently working on a novel inspired by a childhood raised in an Acadian household. He lives in Studio City with his lovely wife Paula and their two cats Abigail and Emily. Maurice spends his free time drawing, writing music and designing and building wooden furniture.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY4ODAxNzQ1OF5BMl5BanBnXkFtZTcwNTMzMDAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0324070","name":"Maurice Godin","idIMDB":"nm0324070"},"actorId":"nm0324070","character":"Hector","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roger Moore","urlProfile":"http://www.imdb.com/name/nm0000549","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3Njg5MDkxNl5BMl5BanBnXkFtZTYwNjczMzU0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 October 1927","placeOfBirth":" Stockwell, London, England, UK","birthName":"Roger George Moore","height":"6' 1\" (1.85 m)","bio":"Roger Moore will perhaps always be remembered as the man who replaced Sean Connery in the James Bond series, arguably something he never lived down. Roger George Moore was born on October 14, 1927 in Stockwell, London, England, the son of Lillian (Pope) and George Alfred Moore, a policeman. He first wanted to be an artist, but got into films full time after becoming an extra in the late 1940s. Moore also served in the British military during the Second World War. He came to the United States in 1953. Suave, extremely handsome, and an excellent actor, he received a contract with Metro-Goldwyn-Mayer. His initial foray met with mixed success, with movies like Diane (1956) and Interrupted Melody (1955), as well as The Last Time I Saw Paris (1954). Moore went into television in the 1950s on series such as Ivanhoe (1958) and The Alaskans (1959), but probably received the most recognition from Maverick (1957), as cousin Beau. He received his big breakthrough, at least internationally, as The Saint (1962). The series made him a superstar and he became very successful thereafter. Moore ended his run as the Saint, and was one of the premier stars of the world, but he was not catching on in America. In an attempt to change this, he agreed to star with Tony Curtis on ITC's The Persuaders! (1971), but although hugely popular in Europe, it did not catch on in the United States and was canceled. Just prior to making the series, he starred in The Man Who Haunted Himself (1970), which proved there was far more to Moore than the light-hearted roles he had previously accepted. He was next offered and accepted the role of James Bond, and once audiences got used to the change of style from Connery's portrayal, they also accepted him. Live and Let Die (1973), his first Bond movie, grossed more outside of America than Diamonds Are Forever (1971); Connery's last outing as James Bond. He went on to star in another six Bond films, before bowing out after A View to a Kill (1985). He was age 57 at the time the film was made and was looking a little too old for Bond - it was possibly one film too many. In between times, there had been more success with appearances in films such as That Lucky Touch (1975), Shout at the Devil (1976), The Wild Geese (1978), Escape to Athena (1979) and ffolkes (1980). Despite his fame from the Bond films and many others, the United States never completely took to him until he starred in The Cannonball Run (1981) alongside Burt Reynolds, a success there. After relinquishing his role as Bond, his work load tended to diminish a little, though he did star in the American box office flop Fire, Ice & Dynamite (1990), as well as the comedy Bullseye! (1990), with Michael Caine. He did the overlooked comedy Bed & Breakfast (1991), as well as the television movie The Man Who Wouldn't Die (1994), and then the major Jean-Claude Van Damme flop The Quest (1996). Moore then took second rate roles such as Spice World (1997), and the American television series The Dream Team (1999). Although his film work may have slowed down, he is still very much in the public eye, be it appearing on television chat shows or hosting documentaries. Roger Moore was appointed Commander of the Order of the British Empire on December 31, 1998 in the New Years Honours for services to UNICEF, and was promoted to Knight Commander of the same order on June 14, 2003 in the Queen's Birthday Honours for services to the charities UNICEF and Kiwanis International.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3Njg5MDkxNl5BMl5BanBnXkFtZTYwNjczMzU0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000549","name":"Roger Moore","idIMDB":"nm0000549"},"actorId":"nm0000549","character":"Lloyd Faversham","urlCharacter":"http://www.imdb.com/character/ch0019049","main":true},{"actorName":"Lin Shaye","urlProfile":"http://www.imdb.com/name/nm0005417","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmNjOWY2NjItY2MxMy00M2QxLWIzNWYtMWM5YzNiZTM5MDZiL2ltYWdlXkEyXkFqcGdeQXVyMjE5NTgzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 October 1943","placeOfBirth":" Detroit, Michigan, USA","birthName":"Linda Shaye","height":"5' 2\" (1.57 m)","bio":"Lin attended the University of Michigan, where she was an Art History major, although acting in as many University productions as possible, including \"Bye Bye Birdie\" and \"On The Town\". After U of M, she attended Columbia University School of the Arts, and acquired a Master of Fine Arts degree in Acting. She stayed in New York upon graduation and worked in numerous off- and off-off- Broadway productions, as well as Lincoln Center and Broadway. She has studied with some of the finest: Uta Hagen, Stella Adler and Lee Strasberg. Lin is a lifetime member of the Actor's Studio.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmNjOWY2NjItY2MxMy00M2QxLWIzNWYtMWM5YzNiZTM5MDZiL2ltYWdlXkEyXkFqcGdeQXVyMjE5NTgzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005417","name":"Lin Shaye","idIMDB":"nm0005417"},"actorId":"nm0005417","character":"Sonya the Coach","urlCharacter":"http://www.imdb.com/character/ch0143678","main":true},{"actorName":"Victoria Silvstedt","urlProfile":"http://www.imdb.com/name/nm0005429","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTIyNTUzMjM0MF5BMl5BanBnXkFtZTYwMTA4OTI1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 September 1974","placeOfBirth":" Skelleftehamn, Västerbottens län, Sweden","birthName":"Karen Victoria Silverstedt","height":"5' 10½\" (1.79 m)","bio":"Just shy of six feet tall with crystal blue eyes and flaxen blonde hair, this ambitious glamazon from a quiet town in the north of Sweden has dreams of acting after a few more years of modeling. Victoria has graced the pages of Playboy magazine as Miss December 1996, and has just been named the 1997 Playboy's Playmate of the Year. She has also skied competitively in the giant slalom as a lithe Swedish athlete. In 1993, Victoria was the first runner-up in the Miss Sweden beauty pageant, and went on to represent Sweden in the Miss World contest. There, Victoria met a modeling agent from Paris and has been modeling ever since.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTIyNTUzMjM0MF5BMl5BanBnXkFtZTYwMTA4OTI1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005429","name":"Victoria Silvstedt","idIMDB":"nm0005429"},"actorId":"nm0005429","character":"Inga","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ken Hudson Campbell","urlProfile":"http://www.imdb.com/name/nm0132637","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NzkwNDA4OV5BMl5BanBnXkFtZTcwNTM2MDg2Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 June 1962","placeOfBirth":" USA","height":"6' 4\" (1.93 m)","bio":"Ken Hudson Campbell was born on June 5, 1962 in the USA. He is known for his work on Groundhog Day (1993), Armageddon (1998) and Home Alone (1990).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NzkwNDA4OV5BMl5BanBnXkFtZTcwNTM2MDg2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0132637","name":"Ken Hudson Campbell","idIMDB":"nm0132637"},"actorId":"nm0132637","character":"Tom","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zen Gesner","urlProfile":"http://www.imdb.com/name/nm0315143","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNTAzNzk1OF5BMl5BanBnXkFtZTYwMDUwNDEz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 June 1970","placeOfBirth":" Van Nuys, California, USA","birthName":"Zen Brant Gesner","height":"5' 11½\" (1.82 m)","bio":"Zen Gesner was born on June 23, 1970 in Van Nuys, California, USA as Zen Brant Gesner. He is an actor and producer, known for All My Children (1970), Dumb & Dumber (1994) and Shallow Hal (2001). He has been married to Cynthia Farrelly Gesner since 1995. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNTAzNzk1OF5BMl5BanBnXkFtZTYwMDUwNDEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0315143","name":"Zen Gesner","idIMDB":"nm0315143"},"actorId":"nm0315143","character":"Ron","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Bumiller","urlProfile":"http://www.imdb.com/name/nm0120301","urlPhoto":"","biography":{"dateOfBirth":"25 March 1956","placeOfBirth":" San Francisco, California, USA","bio":"William Bumiller was born on March 25, 1956 in San Francisco, California, USA. He is an actor, known for Species (1995), Boat Trip (2002) and Guiding Light (1952).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0120301","name":"William Bumiller","idIMDB":"nm0120301"},"actorId":"nm0120301","character":"Steven","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Noah York","urlProfile":"http://www.imdb.com/name/nm1239230","urlPhoto":"","biography":{"bio":"Noah York is an actor, known for Boat Trip (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1239230","name":"Noah York","idIMDB":"nm1239230"},"actorId":"nm1239230","character":"Perry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Roundtree","urlProfile":"http://www.imdb.com/name/nm0745780","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMjIzOTUyMV5BMl5BanBnXkFtZTYwMjA2MDQ3._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1942","placeOfBirth":" New Rochelle, New York, USA","height":"6' 2\" (1.88 m)","bio":"Richard Roundtree was a leading man in many \"blaxploitation\" movies in the 1970s. He is best known for his role as John Shaft in Shaft (1971), and starred in its two sequels as well. As the 1970s and 1980s progressed he starred more in low-budget movies. He was in a few occasional high-profile, if a tad offbeat, films. Among his more notable work in that period were Escape to Athena (1979), City Heat (1984) and the socially conscious but badly received Game for Vultures (1979). Roundtree has been active in movies these days. He became popular again in the 1990s with his role in Se7en (1995), and was well received for reprising his role as the classic hero, and Samuel L. Jackson's uncle, in the 2000 remake of the film that made him a star, Shaft (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMjIzOTUyMV5BMl5BanBnXkFtZTYwMjA2MDQ3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0745780","name":"Richard Roundtree","idIMDB":"nm0745780"},"actorId":"nm0745780","character":"Felicia's Dad","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bob Gunton","urlProfile":"http://www.imdb.com/name/nm0348409","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MzY0MTQzM15BMl5BanBnXkFtZTcwMTM0ODYxNw@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 November 1945","placeOfBirth":" Santa Monica, California, USA","birthName":"Robert Patrick Gunton Jr.","height":"6' 2\" (1.88 m)","bio":"Bob Gunton was born on November 15, 1945 in Santa Monica, California, USA as Robert Patrick Gunton Jr. He is an actor, known for The Shawshank Redemption (1994), Argo (2012) and 24 (2008). He has been married to Carey Pitts since August 26, 2006. He was previously married to Annie McGreevey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MzY0MTQzM15BMl5BanBnXkFtZTcwMTM0ODYxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0348409","name":"Bob Gunton","idIMDB":"nm0348409"},"actorId":"nm0348409","character":"Boat Captain","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jennifer Gareis","urlProfile":"http://www.imdb.com/name/nm0004947","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNTkzMTg5Nl5BMl5BanBnXkFtZTcwOTU1NzkyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 August 1970","placeOfBirth":" Lancaster, Pennsylvania, USA","height":"5' 6\" (1.68 m)","bio":"Jennifer Gareis was born on August 1, 1970 in Lancaster, Pennsylvania, USA. She is an actress, known for Amour, gloire et beauté (1987), The 6th Day (2000) and Miss Congeniality (2000). She has been married to Bobby Ghassemieh since March 7, 2010. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNTkzMTg5Nl5BMl5BanBnXkFtZTcwOTU1NzkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004947","name":"Jennifer Gareis","idIMDB":"nm0004947"},"actorId":"nm0004947","character":"Sheri","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0285462","urlIMDB":"http://www.imdb.com/title/tt0285462","business":{"budget":{"money":"$20,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$3,815,075","country":"USA","day":"23","month":"03","year":"2003","remarks":"1,714 Screens"},{"money":"£425,325","country":"UK","day":"06","month":"10","year":"2002","remarks":"256 Screens"},{"money":"€492,756","country":"Spain","day":"17","month":"08","year":"2003","remarks":"233 Screens"}],"gross":[{"money":"$8,586,376","country":"USA","day":"04","month":"05","year":"2003","remarks":""},{"money":"$8,525,095","country":"USA","day":"27","month":"04","year":"2003","remarks":""},{"money":"$8,389,919","country":"USA","day":"20","month":"04","year":"2003","remarks":""},{"money":"$8,160,423","country":"USA","day":"13","month":"04","year":"2003","remarks":""},{"money":"$7,779,149","country":"USA","day":"06","month":"04","year":"2003","remarks":""},{"money":"$6,729,131","country":"USA","day":"30","month":"03","year":"2003","remarks":""},{"money":"$3,815,075","country":"USA","day":"23","month":"03","year":"2003","remarks":""},{"money":"£838,039","country":"UK","day":"13","month":"10","year":"2002","remarks":""},{"money":"£425,325","country":"UK","day":"06","month":"10","year":"2002","remarks":""},{"money":"$5,872,571","country":"Worldwide","day":"07","month":"11","year":"2003","remarks":"except USA"},{"money":"$441,285","country":"Russia","day":"27","month":"07","year":"2003","remarks":""},{"money":"€1,777,220","country":"Spain","day":"07","month":"09","year":"2003","remarks":""},{"money":"€1,577,000","country":"Spain","day":"31","month":"08","year":"2003","remarks":""},{"money":"€1,181,280","country":"Spain","day":"24","month":"08","year":"2003","remarks":""},{"money":"€568,128","country":"Spain","day":"17","month":"08","year":"2003","remarks":""}],"weekendGross":[{"money":"$38,661","country":"USA","day":"04","month":"05","year":"2003","remarks":"42 Screens"},{"money":"$66,272","country":"USA","day":"27","month":"04","year":"2003","remarks":"76 Screens"},{"money":"$138,810","country":"USA","day":"20","month":"04","year":"2003","remarks":"103 Screens"},{"money":"$208,213","country":"USA","day":"13","month":"04","year":"2003","remarks":"208 Screens"},{"money":"$439,138","country":"USA","day":"06","month":"04","year":"2003","remarks":"602 Screens"},{"money":"$1,691,121","country":"USA","day":"30","month":"03","year":"2003","remarks":"1,803 Screens"},{"money":"$3,815,075","country":"USA","day":"23","month":"03","year":"2003","remarks":"1,714 Screens"},{"money":"£230,857","country":"UK","day":"13","month":"10","year":"2002","remarks":"243 Screens"},{"money":"£425,325","country":"UK","day":"06","month":"10","year":"2002","remarks":"256 Screens"},{"money":"€87,650","country":"Spain","day":"07","month":"09","year":"2003","remarks":"134 Screens"},{"money":"€226,184","country":"Spain","day":"31","month":"08","year":"2003","remarks":"225 Screens"},{"money":"€257,150","country":"Spain","day":"24","month":"08","year":"2003","remarks":"230 Screens"},{"money":"€492,756","country":"Spain","day":"17","month":"08","year":"2003","remarks":"233 Screens"}],"admissions":[{"money":"451,627","country":"Brazil","day":"17","month":"08","year":"2003","remarks":""},{"money":"405,732","country":"Brazil","day":"10","month":"08","year":"2003","remarks":""},{"money":"355,159","country":"Brazil","day":"03","month":"08","year":"2003","remarks":""},{"money":"239,791","country":"Brazil","day":"27","month":"07","year":"2003","remarks":""},{"money":"124,706","country":"Brazil","day":"20","month":"07","year":"2003","remarks":""},{"money":"55,706","country":"Germany","day":"23","month":"02","year":"2003","remarks":""},{"money":"13,730","country":"Netherlands","day":"31","month":"12","year":"2003","remarks":""},{"money":"389,314","country":"Spain","day":"07","month":"09","year":"2003","remarks":""},{"money":"117,770","country":"Spain","day":"17","month":"08","year":"2003","remarks":""}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"ApolloMedia GmbH &amp; Co. 5. Filmproduktion KG and IWP International West Pictures GmbH &amp; Co. Erste Produktions KG"},"technical":{"runtime":["1 hr 34 min (94 min)","1 hr 37 min (97 min) (unrated) (USA)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arriflex Cameras"],"laboratory":["DeLuxe"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"4.9","metascore":"18","filmingLocations":[{"location":"Magic Media Company, Cologne, North Rhine-Westphalia, Germany"}],"rated":"R","awards":[{"award":"BET Awards 2002","titlesAwards":[{"titleAwardOutcome":"Nominated BET Award","categories":[{"category":"Best Actress","names":[{"name":"Vivica A. Fox","id":"nm0000407","role":null},{"name":"Kingdom Come","id":"tt0246002","role":null},{"name":"Two Can Play That Game","id":"tt0269341","role":null}]}]}]},{"award":"Dallas-Fort Worth Film Critics Association Awards 2004","titlesAwards":[{"titleAwardOutcome":"Nominated DFWFCA Award","categories":[{"category":"Worst Film","names":[]}]}]},{"award":"Razzie Awards 2004","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Actor","names":[{"name":"Cuba Gooding Jr.","id":"nm0000421","role":null},{"name":"The Fighting Temptations","id":"tt0191133","role":null},{"name":"Radio","id":"tt0316465","role":null}]},{"category":"Worst Director","names":[{"name":"Mort Nathan","id":"nm0622240","role":null}]}]}]},{"award":"The Stinkers Bad Movie Awards 2003","titlesAwards":[{"titleAwardOutcome":"Won Stinker Award","categories":[{"category":"Most Painfully Unfunny Comedy","names":[]}]},{"titleAwardOutcome":"Nominated Stinker Award","categories":[{"category":"Worst Supporting Actor","names":[{"name":"Roger Moore","id":"nm0000549","role":null}]},{"category":"Worst Actor","names":[{"name":"Cuba Gooding","id":"nm0328949","role":null},{"name":"The Fighting Temptations","id":"tt0191133","role":null},{"name":"Radio","id":"tt0316465","role":null}]},{"category":"Worst On-Screen Couple","names":[{"name":"Cuba Gooding Jr.","id":"nm0000421","role":null},{"name":"The Fighting Temptations","id":"tt0191133","role":null},{"name":"Radio","id":"tt0316465","role":null}]}]}]}],"votes":"27,231","type":"Movie","companyCreditsSimple":[{"idCompany":"co0071430","name":"Motion Picture Corporation of America (MPCA)"},{"idCompany":"co0001893","name":"International West Pictures (IWP)"},{"idCompany":"co0063447","name":"ApolloMedia Distribution"}],"keywords":{"keywords":["gay","hot air balloon","rejecting a marriage proposal","vomiting on someone","talking to a dog","runaway groom","interrupted wedding","left at the altar","jumping from an airplane","gay man","poker game","fat man","vacation","mistaken for gay","gay character","gay kiss","sweden","swedish woman","skydiving","ocean","interracial friendship","sun tanning","misunderstanding","mouth to mouth resuscitation","lifeboat","helicopter","piano playing","hispanic","interracial relationship","african american protagonist","two word title","catfight","pretending to be gay","homosexuality","blow job","gay stereotype","banana","dog","massage","crude humor","gay cruise","ejaculation","fire extinguisher","cruise ship","sex","erection","dance instructor","oral sex","death of mother","travel agent","f rated","light airplane","post it note","playing poker","poker","fighting over a parking space","travel agency","card game","gay interest","parachute","female coach","coach","bikini","mountain cabin","cabin","mountain","airplane","passenger","talking to the camera","fire truck","firefighter","crossdressing","ocean liner","objection at wedding","best friend","priest","bulldog","pet dog","suntan","wedding","suntan lotion","lie","saving a life","rescue from drowning","deep throat","baseball bat","ex boyfriend ex girlfriend relationship","break up","mechanic","flare gun","binoculars","life raft","man in drag","dancing","disco","marriage proposal","drunkenness","helicopter crash","swedish","parking lot","interracial romance","african american","vomit","fellatio","gay slur","swimming pool"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:32:35"}}