{"data":{"movies":[{"title":"Shen Zhen gong lu qiang che sha ren an zhi: Liu mo nu","originalTitle":"","year":"1996","releaseDate":"19960524","directors":[{"name":"Tin Yiu Ma","id":"nm0994364"}],"writers":[{"name":"Sa-Fai Wong","id":"nm0939316"}],"runtime":"89 min","countries":["Hong Kong"],"languages":["Cantonese","Mandarin"],"genres":["Crime"],"simplePlot":"","actors":[{"actorName":"Sing Chen","urlProfile":"http://www.imdb.com/name/nm0151080","urlPhoto":"","biography":{"dateOfBirth":"17 March 1940","placeOfBirth":" Singapore","bio":"Sing Chen was born on March 17, 1940 in Singapore. He is known for his work on New Fists of Fury (1976), Double Impact (1991) and Bruce Li the Invincible Chinatown Connection (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0151080","name":"Sing Chen","idIMDB":"nm0151080"},"actorId":"nm0151080","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sau Han Chung","urlProfile":"http://www.imdb.com/name/nm1326617","urlPhoto":"","biography":{"bio":"Sau Han Chung is an actress, known for Ji dou shou xing (1996) and Shen Zhen gong lu qiang che sha ren an zhi: Liu mo nu (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1326617","name":"Sau Han Chung","idIMDB":"nm1326617"},"actorId":"nm1326617","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ka-Kui Ho","urlProfile":"http://www.imdb.com/name/nm0387322","urlPhoto":"","biography":{"dateOfBirth":"14 March 1951","placeOfBirth":" Kowloon City, Hong Kong, British Crown Colony","height":"6' (1.83 m)","bio":"Ka-Kui Ho was born on March 14, 1951 in Kowloon City, Hong Kong, British Crown Colony. He is known for his work on Riki-Oh: The Story of Ricky (1991), Prison on Fire (1987) and La secte du lotus blanc (1992). He died on January 27, 2015 in Hong Kong.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0387322","name":"Ka-Kui Ho","idIMDB":"nm0387322"},"actorId":"nm0387322","character":"Victim","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rong Rong Le","urlProfile":"http://www.imdb.com/name/nm2644503","urlPhoto":"","biography":{"bio":"Rong Rong Le is an actress, known for Ji dou shou xing (1996), Erotic Nightmare (1999) and Nan yang di yi xie jiang (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2644503","name":"Rong Rong Le","idIMDB":"nm2644503"},"actorId":"nm2644503","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Suet-Man Lee","urlProfile":"http://www.imdb.com/name/nm0498303","urlPhoto":"","biography":{"bio":"Suet-Man Lee is an actress, known for Yi tan zhao yao jing zhi ying shao ming ce (1996), Da nei mi tan: Zhi ling ling xing xing (1996) and Qi yue shi san zhi long po (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0498303","name":"Suet-Man Lee","idIMDB":"nm0498303"},"actorId":"nm0498303","character":"Cheung Fung","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yuen Man Leung","urlProfile":"http://www.imdb.com/name/nm1317036","urlPhoto":"","biography":{"bio":"Yuen Man Leung is an actress, known for Too Many Ways to Be No. 1 (1997), Man Wanted (1995) and Lao ni mei (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1317036","name":"Yuen Man Leung","idIMDB":"nm1317036"},"actorId":"nm1317036","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Diana Pang","urlProfile":"http://www.imdb.com/name/nm0659381","urlPhoto":"","biography":{"dateOfBirth":"10 November 1972","placeOfBirth":" Changsha, Hunan, China","bio":"Diana Peng is a renowned professional actress and dancer in Hong Kong and Mainland China. As the youngest Congressman from the arts, she has many prominent memberships and commissioned works which include: membership with the Standing Committee of the 10th All-China Young Politician Federation, China Zhi Gong Party Central Sports Committee Member, Honored Chairman of the China Health Assist-Poverty Project Association, Vice-Chairman of the World Association of Chinese, Chairman of the judging panel for the Miss World Finals, Vice Chairman of judging panel of the Miss World Traveling Ambassador, Visiting Professor of the Shanghai Modern Leadership Institution, Honorary Member of the Top 100 Lifetime Achiever Award of China, and Honorary Member of the Top 100 of China Charming Ladies. Ms. Peng is also the \"Ambassador of Love\" of the Chinese Women's Development Foundation, the \"Environmental Protection Ambassador\" of the International Association of Environmental Protection Organization, the \"Special Ambassador\" of the \"World AIDS Charity Events\", the Chinese New Socialist Countryside Program Mulan Cultural Celebrity, the China QuHu International Confucius Cultural Holiday Celebrity, the Ambassador of the China Guanghua Science and Technology Foundation - Golden Dragon Technology Innovation Development Fund. Diana Peng was born in Changsha, Hunan Province. She realized her love for the arts while she was a child. She entered the Ballet School at the Affiliated Middle School of Beijing Dance College when she was 8 years old. After graduation, she joined National Ballet of China and quickly distinguished herself as the youngest and the best dancer in the troupe. Afterward, she went to the United States where she began studying film acting and dance at the world renowned Juilliard School. She was the first Chinese student to ever to be awarded a full scholarship. During her 8-year study in the United States, she was awarded champion of the \"Miss Asia International\" three times, as well as \"Miss China USA and \"Miss Chinese USA\". Over the following years Diana Peng continued in areas of film and TV, dance, and singing. She performed in many drama series and played various roles such as party members, soldiers and the police. In 1995, Diana Peng successfully portrayed \"Linna\" as the leading actress in Ang Lee's film \"Chinese Chocolate\" (aka \"Landing\"), which won \"The Best Art Film\" at the 46th Berlin Film Festival and \"The Best Film\" at the Montreal World Film Festival. In 2000, Diana Peng was the leading actress in a special drama for the National Day Celebration, called \"Drive the Train to Beijing\" and it won the \"Fifty Year Project\" Award by the Ministry of Publicity. She was the first Hong Kong actress to receive such an award. In 2004, Diana Peng landed in Hollywood, taking the leading role in a historical Film called \"Huangpu Soldier\" which won \"Best Film Story\", \"Best Film Scenario\", \"Best Music\" and \"Outstanding Film Achievement\" at the Hollywood international Film Star Awards. In 2006, Diana Peng portrayed an honest soldier in the film \"Zhang Side\", and this film won the \"Fifty Year Project\" of the Ministry of Publicity, \"The Best Story Film\" at the China Film Huabiao Awards, \"Best Film Story\" at the Changchun International Film Festival and \"Best Film Story\" at the China Film Baihua Awards. In 2009, \"Lovely China,\" a large scale patriotic feature film in which Diana Peng performed the leading role, was selected as one of the four leading greeting movies for the 6oth National Day. In 2012, Diana Peng directed and played the leading role in the red epic movie \"Nanniwan\" that called for the spirit of self-reliance and hard work, State Administration of Radio, Film and Television recommended it as a major tribute movie to the 18th Congress of the Standing Committee. In her still young career, Diana Peng has performed leading roles in many films, including: Kung Fu Baby, Nanniwan, Chinese Chocolate, Drive the Train to Beijing, Zhang Side, Huangpu Soldier, Nightmare, Huo Yuanjia, Gambler King II, Wolf Kiss, Black Gold Empire, Five Lucky Guys, Oriental Train, Cold Law, Hard to Regret, SHH Files, Lucky from Heaven, Dangerous Task, 15 Billion Internet Killer and many others. She has also performed leading roles in drama series including: Deep Calm, The Last Knight, Guandong Hero, Hero, Fire of Life, Tian Long Ba Bu, Asian Detective Di Renjie, Refuse the Doomsday, General Shilang, Legend Hu Xueyan, Legend Gobuli, Dream Valley, Happy is Fine, Warning, Sky of West, Feeling Line, Red Warning, Divorce and Remarriage , Countryside E-mail, among others. Diana Peng was not limited to film and TV. She has also led in many stage shows, such as: The Night of He and She, Mozart, Swan Lake, Sleeping Beauty, Romeo and Juliet, Honglou Dream, and Yang Guifei. Diana contributes to charitable causes and international culture exchange programs and as a result, she has received honors from the Government and the Chinese society. Diana Peng has been providing for the entire education costs of 14 poor students in Jintang County, Sichuan Province, for thirteen years now since 1996. From 2001 to 2010, Diana Peng donated RMB1,500,000 to the Sichang Provincial Kanggu Hospital and founded the \"Diana Peng Heart Fund\", which has provided the means to cure numerous patients over the years. She generously donated to the \"Land of Love - Mother Water Cellar\" project, which helped the many poor families of Northwest out plight and poverty. Diana Peng donated RMB1,000,000 to the More Love Foundation to establish \"Diana Peng Special Fund,\" a special fund that will assist disabled people of coal production accidents and work for children's welfare.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0659381","name":"Diana Pang","idIMDB":"nm0659381"},"actorId":"nm0659381","character":"Man Nap","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shu-Kei Wong","urlProfile":"http://www.imdb.com/name/nm0939328","urlPhoto":"","biography":{"dateOfBirth":"25 February 1967","placeOfBirth":" Hong Kong, British Crown Colony","bio":"Shu-Kei Wong was born on February 25, 1967 in Hong Kong, British Crown Colony. He is an actor, known for Tou qing nan nu (1997), Yu pu tuan zhi yin xing wu dao (1999) and Sex and the Emperor (1994). He has been married to Maple Hui since 2003. They have one child.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0939328","name":"Shu-Kei Wong","idIMDB":"nm0939328"},"actorId":"nm0939328","character":"Cheung Kin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joey Oi Ching Yeung","urlProfile":"http://www.imdb.com/name/nm1328490","urlPhoto":"","biography":{"bio":"Joey Oi Ching Yeung is an actress, known for Nan yang di yi xie jiang (1996), Bloody Friday (1996) and Shen Zhen gong lu qiang che sha ren an zhi: Liu mo nu (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1328490","name":"Joey Oi Ching Yeung","idIMDB":"nm1328490"},"actorId":"nm1328490","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0284483","urlIMDB":"http://www.imdb.com/title/tt0284483","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 29 min (89 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"8.0","filmingLocations":[],"awards":[],"votes":"21","type":"Movie","companyCreditsSimple":[]}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 01:29:34"}}