{"data":{"movies":[{"title":"Chiens des neiges","originalTitle":"Snow Dogs","year":"2002","releaseDate":"20020118","directors":[{"name":"Brian Levant","id":"nm0505152"}],"writers":[{"name":"Jim Kouf","id":"nm0467942"},{"name":"Tommy Swerdlow","id":"nm0842476"}],"runtime":"99 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0NzU5MTk1Ml5BMl5BanBnXkFtZTYwOTc4OTc2._V1.jpg","countries":["Canada","USA"],"languages":["English"],"genres":["Adventure","Comedy","Family","Sport"],"plot":"When Miami dentist Ted Brooks learns that his birth mother has passed away and that he was named in her will, he travels to Alaska to claim his inheritance. Rather than the large chunk of change that many people would expect, Ted instead receives his mother's pack of rowdy sled dogs and her property. Although the dogs seemingly have it in for Ted, he decides to keep the dogs and race them in the local race, the Arctic Challenge, spiting a mountain man who wants the dogs. What follows is a comedy detailing Ted's adventures in learning to run the sled dogs.","simplePlot":"When a Miami dentist inherits a team of sled dogs, he's got to learn the trade or lose his pack to a crusty mountain man.","actors":[{"actorName":"Cuba Gooding Jr.","urlProfile":"http://www.imdb.com/name/nm0000421","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMzk4NjQ2Ml5BMl5BanBnXkFtZTYwNzc3ODI4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 January 1968","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"Cuba M. Gooding Junior","height":"5' 10\" (1.78 m)","bio":"Cuba Gooding Jr. was born on January 2, 1968, in The Bronx, New York. His mother, Shirley (Sullivan), was a backup singer for The Sweethearts. His father, Cuba Gooding, was the lead vocalist for the R&B group The Main Ingredient, which had a hit with the song \"Everybody Plays The Fool\". His paternal grandfather was from Barbados. Cuba's father moved the family to Los Angeles in 1972, only to leave them a few years later. Despite this setback, Cuba was able to maintain a positive outlook and overachieved throughout school. He attended four different high schools and was elected class president in three of them. While at high school, Cuba met and fell in love with Sara Kapfer, whom he later lived with for seven years before tying the knot in March 1994. Following high school, Cuba studied Japanese martial arts for three years before turning his focus toward acting. Early on, he landed guest starring roles on shows like Hill Street Blues (1981) and MacGyver (1985). His first major role was in the 1991 box office surprise Boyz n the Hood (1991). He followed this success with supporting roles in major films like A Few Good Men (1992), Lightning Jack (1994) and Outbreak (1995). In 1996, Cuba was cast as an arrogant but loyal football player in the Tom Cruise-Cameron Crowe film Jerry Maguire (1996). The film became a huge box office smash and earned Cuba an Academy Award for Best Supporting Actor. His \"Show Me The Money\" line in the movie became a nationwide catchphrase. The role elevated him to superstar status, as many of Hollywood's top producers began to \"show him the money\" to appear in their films. Since Jerry Maguire (1996), Cuba has managed to keep busy with a wide range of roles alongside many of Hollywood's biggest stars. Most recently, he won critical support for his portrayal of a mentally handicapped man in the heartwarming film Radio (2003), another movie about football. In 2002, he was given a star on the Hollywood Walk of Fame. He resides in Studio City, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMzk4NjQ2Ml5BMl5BanBnXkFtZTYwNzc3ODI4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000421","name":"Cuba Gooding Jr.","idIMDB":"nm0000421"},"actorId":"nm0000421","character":"Ted Brooks","urlCharacter":"http://www.imdb.com/character/ch0022851","main":true},{"actorName":"James Coburn","urlProfile":"http://www.imdb.com/name/nm0000336","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNTg3Njg4M15BMl5BanBnXkFtZTcwOTI1ODE1NA@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 August 1928","placeOfBirth":" Laurel, Nebraska, USA","birthName":"James Harrison Coburn Jr.","height":"6' 2\" (1.88 m)","bio":"Lanky, charismatic and versatile actor with an amazing grin that put everyone at ease, James Coburn studied acting at UCLA, and then moved to New York to study under noted acting coach Stella Adler. After being noticed in several stage productions, Coburn appeared in a handful of minor westerns before being cast as the knife-throwing, quick-shooting Britt in the John Sturges mega-hit The Magnificent Seven (1960). Sturges remembered Coburn's talents when he cast his next major film project, The Great Escape (1963), where Coburn played the Australian POW Sedgewick. Regular work now came thick and fast for Coburn, including appearing in Major Dundee (1965), the first of several films he appeared in directed by Hollywood enfant terrible Sam Peckinpah. The next two years were a key period for Coburn, with his performances in the wonderful 007 spy spoof Our Man Flint (1966) and the eerie Dead Heat on a Merry-Go-Round (1966). Coburn followed up in 1967 with a Flint sequel, In Like Flint (1967), and the much underrated political satire The President's Analyst (1967). The remainder of the 1960s was rather uneventful for Coburn. However, he became associated with martial arts legend Bruce Lee and the two trained together, traveled extensively and even visited India scouting locations for a proposed film project, but Lee's untimely death (Coburn, along with Steve McQueen, was a pallbearer at Lee's funeral) put an end to that. The 1970s saw Coburn appearing again in several strong roles, starting off in Peckinpah's Pat Garrett & Billy the Kid (1973), alongside Charles Bronson in the Depression-era Hard Times (1975) and as a disenchanted German soldier on the Russian front in Peckinpah's superb Cross of Iron (1977). Towards the end of the decade, however, Coburn was diagnosed with rheumatoid arthritis, which severely hampered his health and work output for many years. After conventional treatments failed, Coburn turned to a holistic therapist, and through a restructured diet program, made a definite improvement. By the 1990s he was once again appearing regularly in both film and TV productions. No one was probably more surprised than Coburn himself when he was both nominated for, and then won, the Best Supporting Actor Award in 1997 for playing Nick Nolte's abusive and alcoholic father in Affliction (1997). At 70 years of age, Coburn's career received another shot in the arm, and he appeared in another 14 films, including Chiens des neiges (2002) and The Man from Elysian Fields (2001), before his death from a heart attack in November of 2002. Coburn's passions in life included martial arts, card playing and enjoying fine Cuban cigars!","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNTg3Njg4M15BMl5BanBnXkFtZTcwOTI1ODE1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000336","name":"James Coburn","idIMDB":"nm0000336"},"actorId":"nm0000336","character":"Thunder Jack","urlCharacter":"http://www.imdb.com/character/ch0022852","main":true},{"actorName":"Sisqó","urlProfile":"http://www.imdb.com/name/nm0005437","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NjI0NTM2Nl5BMl5BanBnXkFtZTYwNDY4OTc2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 November 1978","placeOfBirth":" Baltimore, Maryland, USA","birthName":"Mark Althavean Andrews","height":"5' 5\" (1.65 m)","bio":"This distinctive silver-haired singer established his performing credentials as a founding member of highly successful urban R&B quartet Dru Hill, who enjoyed transatlantic hits in the late 90s with singles such as 'How Deep Is Your Love' and 'These Are The Times'. The four members of Dru Hill set up their own Dru World Order production company in 1999 in order to facilitate the recording of their own solo projects. Sisqo was the first member to branch out, releasing Unleash The Dragon the same November. The risque lead-off single, 'Thong Song', was only one of many provocative tracks on an album which dealt candidly with sex and the male psyche. The production expertise of Babyface helped forge an impressive whole out of a diverse range of styles, including up tempo dance tracks ('Got To Get It'), mid-tempo R&B ('Your Love Is Incredible') and romantic ballads (the Elton John / Tim Rice composition 'Enchantment Passing Through').","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NjI0NTM2Nl5BMl5BanBnXkFtZTYwNDY4OTc2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005437","name":"Sisqó","nicknames":["Dragon"],"idIMDB":"nm0005437"},"actorId":"nm0005437","character":"Dr. Rupert Brooks","urlCharacter":"http://www.imdb.com/character/ch0022854","main":true},{"actorName":"Nichelle Nichols","urlProfile":"http://www.imdb.com/name/nm0629667","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk4OTUxMTU0OV5BMl5BanBnXkFtZTYwNzY4OTc2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1932","placeOfBirth":" Robbins, Illinois, USA","birthName":"Grace Nichols","height":"5' 5\" (1.65 m)","bio":"Nichelle Nichols was born Grace Nichols on December 28, 1932 in Robbins, Illinois. She began her show business career at age 16 as a singer with Duke Ellington in a ballet she created for one of his compositions and later sang with his band. After switching to acting, she was twice nominated for the Sarah Siddons Award for best actress in \"The Blacks\" and \"Kicks and Company\". Her film debut found her dancing with Sammy Davis Jr. in Porgy and Bess (1959). A guest appearance on The Lieutenant (1963) led to an offer from Gene Roddenberry to join the cast of Star Trek (1966). Her best known role on the series is communications officer Lieutenant Nyota Uhura. She later repeated her role in a string of successful Star Trek films: Star Trek: The Motion Picture (1979), Star Trek II: The Wrath of Khan (1982), Star Trek III: The Search for Spock (1984), Star Trek IV: The Voyage Home (1986), Star Trek V: The Final Frontier (1989), and Star Trek VI: The Undiscovered Country (1991). Invited to join the board of directors of the National Space Institute, NASA asked her to participate in its astronaut recruitment programme for the space shuttle project. Three of her recruits were on the ill-fated Challenger mission. For her work, she received NASA's distinguished Public Service Award. She has a consultant firm, Women in Motion Inc. through which she produced and starred in the Smithsonian Institution's National Air and Space Museum film \"What's in It for Me?\". With all this, she has not neglected her singing making a series of video albums the latest being \"Nichelle Nichols: Live at Disneyland\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk4OTUxMTU0OV5BMl5BanBnXkFtZTYwNzY4OTc2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0629667","name":"Nichelle Nichols","idIMDB":"nm0629667"},"actorId":"nm0629667","character":"Amelia","urlCharacter":"http://www.imdb.com/character/ch0422131","main":true},{"actorName":"M. Emmet Walsh","urlProfile":"http://www.imdb.com/name/nm0001826","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNjgyNzgwMl5BMl5BanBnXkFtZTcwODA2MTM0OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1935","placeOfBirth":" Ogdensburg, New York, USA","birthName":"Michael Emmet Walsh","height":"5' 10\" (1.78 m)","bio":"Wonderfully talented, heavyset character actor (from New York, but regularly playing Southerners) M. Emmet Walsh has made a solid career of playing corrupt cops, deadly crooks, and zany comedic roles since the early 1970s. Michael Emmet Walsh was born in Ogdensburg, to Agnes Katharine (Sullivan) and Harry Maurice Walsh, a customs agent. He is of Irish descent. Walsh first appeared in a few fairly forgettable roles both on TV and onscreen before cropping up in several well remembered films, including a courtroom police officer in What's Up, Doc? (1972), as the weird Dickie Dunn in Slap Shot (1977), and as a loony sniper hunting Steve Martin in The Jerk (1979). On-screen demand heated up for him in the early 1980s with attention-grabbing work in key hits, including Brubaker (1980), Reds (1981), and as Harrison Ford's police chief in the futuristic thriller Blade Runner (1982). Walsh then turned in a stellar performance as the sleazy, double-crossing private detective in the Joel Cohen and Ethan Coen film noir Blood Simple. (1984), and showed up again for the Coens as a loud-mouthed sheet-metal worker bugging Nicolas Cage in the hilarious Raising Arizona (1987). As Walsh moved into his fifties and beyond, Hollywood continued to offer him plenty of work, and he has appeared in over 50 movies since passing the half-century mark. His consistent ability to turn out highly entertaining portrayals led film critic Roger Ebert to coin the \"Stanton-Walsh Rule,\" which states that any film starring Walsh or Harry Dean Stanton has to have some merit. And the \"M\" stands for Michael!","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNjgyNzgwMl5BMl5BanBnXkFtZTcwODA2MTM0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001826","name":"M. Emmet Walsh","idIMDB":"nm0001826"},"actorId":"nm0001826","character":"George","urlCharacter":"http://www.imdb.com/character/ch0422134","main":true},{"actorName":"Graham Greene","urlProfile":"http://www.imdb.com/name/nm0001295","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMTM3OTQyM15BMl5BanBnXkFtZTcwNzYxNTcyMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 June 1952","placeOfBirth":" Six Nations Reserve, Ontario, Canada","height":"5' 10½\" (1.79 m)","bio":"Graham Greene was born on June 22, 1952 in Six Nations Reserve, Ontario, Canada. He is an actor, known for The Green Mile (1999), Dances with Wolves (1990) and Die Hard with a Vengeance (1995). He has been married to Hilary Blackmore since December 20, 1990.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMTM3OTQyM15BMl5BanBnXkFtZTcwNzYxNTcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001295","name":"Graham Greene","idIMDB":"nm0001295"},"actorId":"nm0001295","character":"Peter Yellowbear","urlCharacter":"http://www.imdb.com/character/ch0053371","main":true},{"actorName":"Brian Doyle-Murray","urlProfile":"http://www.imdb.com/name/nm0236519","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5Njc3MjgzNF5BMl5BanBnXkFtZTcwNzIyMTM0OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1945","placeOfBirth":" Chicago, Illinois, USA","birthName":"Brian Murray","height":"5' 8½\" (1.74 m)","bio":"Brian Doyle-Murray was born on October 31, 1945 in Chicago, Illinois, USA as Brian Murray. He is an actor and writer, known for Groundhog Day (1993), Caddyshack (1980) and Wayne's World (1992). He has been married to Christina Stauffer since August 28, 2000.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5Njc3MjgzNF5BMl5BanBnXkFtZTcwNzIyMTM0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0236519","name":"Brian Doyle-Murray","idIMDB":"nm0236519"},"actorId":"nm0236519","character":"Ernie","urlCharacter":"http://www.imdb.com/character/ch0422135","main":true},{"actorName":"Joanna Bacalso","urlProfile":"http://www.imdb.com/name/nm0045214","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGEyNDc2NGEtOThmYy00ZGIwLWE0ZmUtY2Q0MzFiY2M0NTNmXkEyXkFqcGdeQXVyMjQ2NTkwMTA@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1976","placeOfBirth":" Cebu, Philippines","height":"5' 8\" (1.73 m)","bio":"Joanna Bacalso was born on August 10, 1976 in Cebu, Philippines. She is an actress, known for Dude, Where's My Car? (2000), Chiens des neiges (2002) and Bedazzled (2000). She has been married to Matthew Garel since 1998. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGEyNDc2NGEtOThmYy00ZGIwLWE0ZmUtY2Q0MzFiY2M0NTNmXkEyXkFqcGdeQXVyMjQ2NTkwMTA@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0045214","name":"Joanna Bacalso","idIMDB":"nm0045214"},"actorId":"nm0045214","character":"Barb","urlCharacter":"http://www.imdb.com/character/ch0422136","main":true},{"actorName":"Jean Michel Paré","urlProfile":"http://www.imdb.com/name/nm1022023","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxNjE2NjM5ODleQTJeQWpwZ15BbWU2MDQ1ODk3Ng@@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"bio":"Jean Michel Paré is an actor, known for Journey to the Center of the Earth (2008), 300 (2006) and Chiens des neiges (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxNjE2NjM5ODleQTJeQWpwZ15BbWU2MDQ1ODk3Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1022023","name":"Jean Michel Paré","idIMDB":"nm1022023"},"actorId":"nm1022023","character":"Olivier","urlCharacter":"http://www.imdb.com/character/ch0422138","main":true},{"actorName":"Michael Bolton","urlProfile":"http://www.imdb.com/name/nm0093428","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMjg5MDQyN15BMl5BanBnXkFtZTcwODc4NDE5Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 February 1953","placeOfBirth":" New Haven, Connecticut, USA","birthName":"Michael Bolotin","height":"5' 9\" (1.75 m)","bio":"Michael Bolton, the multiple Grammy Award-winning Singer, Songwriter and Social Activist, who has sold more than 65 million albums and singles worldwide, continues to tour the world every year, all while writing, recording and taping for a wide array of projects spanning music, film, television and branded entertainment. Bolton remains committed to humanitarian causes, especially through the Michael Bolton Charities as well as other philanthropic organizations. Known for his soulful voice and poignant lyrics, his timeless charm and good looks have also earned him a spot in several \"People Magazine's Sexiest Man\" issues, including \"Sexiest Man Alive.\" Michael became a viral sensation in The Lonely Island's Emmy nominated video, \"Captain Jack Sparrow\" that launched on Saturday Night Live and has racked up nearly 160 million views on YouTube. He then partnered with Funny Or Die to release a spoof on the cult-classic Office Space. Bolton continued his comedic appearances in several episodes of CBS's hit series Two and a half Men, the hit Fox network show Glee, HBO's hit series Last Week Tonight with John Oliver, and has ongoing campaigns with American Greetings. In his recent autobiography, \"The Soul of it All\" (Hachette/Center Street), Bolton states he is just teeing off on the back nine of his career. In recognition of his artistic achievements, Michael won 2 Grammys for Best Pop Male Vocal Performance (nominated four times), 6 American Music Awards, and a Star on the Hollywood Walk of Fame. As a songwriter, he has earned over 24 BMI & ASCAP Awards, including Songwriter of the Year, 9 Million-Air awards, and the Hitmakers Award from the Songwriters Hall of Fame. Internationally renowned, Michael has recorded and performed with musical icons that have inspired and influenced his own career. He joined Luciano Pavarotti on stage in a highly praised rendition of \"Vesti La Giubba,\" and pays homage to the Italian tenor when performing the aria \"Nessun Dorma\" at each of his concerts while on tour. He has sung with Placido Domingo, Jose Carreras and Renee Fleming and played guitar with BB King. Bolton earned a Grammy-nomination for \"Georgia on my Mind,\" and was invited to sing the classic song to Ray Charles when Ray was honored at the International Jazz Hall of Fame Awards in 1997. A diverse and prolific songwriter, Bolton has worked with some of the greatest songwriters and producers of our time, including Lady Gaga, Diane Warren, Desmond Child, David Foster, Walter Afanasieff, Kenneth \"Babyface\" Edmonds, John \"Mutt\" Lange, Dann Huff, A.R. Rahman, Phil Ramone, and Ne Yo, among others. He is one of the very few artists to have co-written with the legendary Bob Dylan, resulting in the mega hit, \"Steel Bars.\" Michael has penned songs that have been recorded and performed by a diverse list of over 100 artists, ranging from country western legend Conway Twitty to hip hop superstar Kanye West featuring Jay Z and John Legend. Other greats who have performed Bolton's songs include Mark Anthony, Wynonna Judd, Joe Cocker, Peabo Bryson, Kenny Rogers, and Patti LaBelle. Michael has written #1 hit singles impacting the careers of artists such as Laura Branigan (\"How Am I Supposed to Live Without You\"), KISS (\"Forever\"), Barbra Streisand (\"We're Not Making Love Anymore\"), Cher (\"I Found Someone\"), and Kenny G (\"By the Time this Night is Over\"). Michael has always balanced a love for writing new songs with a passion for covering the classics. On his breakthrough album The Hunger, Bolton authored the #1 single \"That's What Love is All About\" and sang his chart topping version of Otis Redding's \"(Sittin' On) the Dock of the Bay,\" which was a hit on 4 radio formats. That album was certified double Platinum and shipped 4 million copies worldwide. To date, Michael has seen 9 studio albums rank in the Top Ten, with 9 #1 singles. His most recent album Songs of Cinema, a selection of iconic film soundtrack songs, was released alongside an original Netflix production Michael Bolton's Big Sexy Valentine's Day Special, which ranked among the network's top fifty best comedies upon debut. Bolton's signature success was seized with the album Soul Provider, selling more than 12.5 million copies world-wide, and showcasing several chart-toppers including the #1 hit single \"How Am I Supposed to Live Without You,\" which earned Michael his first Grammy. This pivotal album also includes the hit singles \"When I'm Back on My Feet\" Again,\" \"How Can We Be Lovers,\" \"Soul Provider,\" and of course the Grammy-nominated \"Georgia on My Mind.\" Soon after, Bolton released the #1 album Time, Love & Tenderness, which has sold over 16 million copies world-wide, and features his Grammy Award-winning vocal performance of the #1 blockbuster hit \"When A Man Loves a Woman.\" This album also produced the hit singles: \"Love Is a Wonderful Thing,\" \"Time, Love and Tenderness\" and \"Missing You Now,\" as well as the Dylan co-write \"Steel Bars.\" Bolton followed this up with a collection of soulful classics on Timeless, delivering the hit singles \"To Love Some Somebody\" and \"Reach Out I'll Be There.\" Timeless sold over 7 million copies worldwide. From his next album The One Thing came Michael's massive single \"Said I Loved You...But I Lied,\" which spent 12 weeks at #1 on the AC charts and earned him another Grammy-nomination. Michael has always been attracted to a wide array of musical categories, from Sinatra favorites (Bolton Swings Sinatra), to classical arias (My Secret Passion), which achieved #1 on the classical charts for 6 consecutive weeks. His most recent studio album features an authentic approach to Motown and soulful classics, as well as original songs written in the same vein. Michael's songs and performances have been featured in numerous television and film soundtracks, including the Oscar-nominated theme song \"Go the Distance\" from Walt Disney's blockbuster animated film Hercules and the recent Russell Crowe film Fathers & Daughters. He also executive produced the documentary Terror at Home addressing Domestic Violence in America, and was Emmy-nominated for writing the title song \"Tears of The Angels\". Michael is completing a feature-length documentary, Gotta Keep Dreamin about the 21st Century Renaissance of Detroit. Bolton was first drawn to Detroit to explore Hitsville USA, the roots of his greatest musical influences, but what he realized there was so much more. Told through the eyes of Michael's own discovery over the course of filming for 3 years, the film celebrates the golden age of Detroit - featuring its native entertainment legends like Francis Ford Coppola, Jerry Bruckheimer, Aretha Franklin, Smokey Robinson, Alice Cooper and many more - and reveals the landscape of the new Detroit being built by entrepreneurial moguls Dan Gilbert, Michael Ilitch, Big 3 as well as young innovators across new industries. The comeback of Detroit is poised to be the greatest turnaround story of American history. This is the story of the American Dream. For his dedication to social activism, Michael has been honored with several Humanitarian awards - including the Martin Luther King Award granted by the Congress of Racial Equality (C.O.R.E.), the Lewis Hine Award from The National Child Labor Committee, the Muhammed Ali Humanitarian Award, the Ellis Island Medal of Honor from the National Ethnic Coalition of Organizations, and the Frances Preston Lifetime Achievement Award. Michael is especially proud of the initiatives carried out by his own foundation, the The Michael Bolton Charities, now in its 24th Year of advocating on behalf of women and children at risk.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMjg5MDQyN15BMl5BanBnXkFtZTcwODc4NDE5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0093428","name":"Michael Bolton","idIMDB":"nm0093428"},"actorId":"nm0093428","character":"Himself - Special Appearance","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Pouliotte","urlProfile":"http://www.imdb.com/name/nm1114998","urlPhoto":"","biography":{"bio":"Jason Pouliotte is an actor, known for Chiens des neiges (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1114998","name":"Jason Pouliotte","idIMDB":"nm1114998"},"actorId":"nm1114998","character":"Sneed Brother #1","urlCharacter":"http://www.imdb.com/character/ch0422140","main":true},{"actorName":"David Boyce","urlProfile":"http://www.imdb.com/name/nm1027195","urlPhoto":"","biography":{"bio":"David Boyce is an actor, known for Saw IV (2007), The Recruit (2003) and Chiens des neiges (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1027195","name":"David Boyce","idIMDB":"nm1027195"},"actorId":"nm1027195","character":"Sneed Brother #2","urlCharacter":"http://www.imdb.com/character/ch0422140","main":true},{"actorName":"Frank C. Turner","urlProfile":"http://www.imdb.com/name/nm0003964","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3MDAzNTQ2M15BMl5BanBnXkFtZTgwOTE1NjczMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 June 1951","placeOfBirth":" Wainwright, Alberta, Canada","birthName":"Francis Charles Turner","height":"6' (1.83 m)","bio":"Frank C. Turner is an actor and iconographer born in Wainwright, Alberta and now living in Port Coquitlam, British Columbia. He received his theatrical training at the University of Alberta, graduating in 1975 with a BFA. For the first few years after graduation he acted in theatres across western Canada and Ontario. In 1983 he moved to Vancouver, BC and has worked mainly in film since then. His favourite credits include, Air Bud (1997), Air Bud: Golden Receiver (1998), Air Bud 3 (2000), Un chien du tonnerre (2002), La nouvelle famille Addams: Addams Family Feud (1999), Lonesome Dove: The Outlaw Years (1995), Cats & Dogs (2001), Chiens des neiges (2002) and The Duke (1999). Frank has previously performed the GKC - GBS debate in Calgary, St. Paul, Minnesota, and on Apostle of Common Sense with EWTN. In 1991 he began studying iconography under Vladislav Andreyev. He has completed about 50 icons in the Byzantine tradition for individuals and churches in the Vancouver area. A frequent attendee of the Mount Angel Iconography Institute where he studied with Charles Rohrbacher, Mary Katsilometes, and Cathy Sievers; more recently he studied with Father Gianluca Busi from Bologna, spending six weeks there in 2007. He gives private instruction in iconography. Along with Chris Kielsinki and Michal Janek, Frank was a founding member of Epiphany Sacred Arts Guild, and has served as its president for four years. He also served on the curriculum advisory board of Living Waters College, soon to be opened in Derwent, Alberta.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3MDAzNTQ2M15BMl5BanBnXkFtZTgwOTE1NjczMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003964","name":"Frank C. Turner","idIMDB":"nm0003964"},"actorId":"nm0003964","character":"Neely","urlCharacter":"http://www.imdb.com/character/ch0422141","main":true},{"actorName":"Ron Small","urlProfile":"http://www.imdb.com/name/nm0806523","urlPhoto":"","biography":{"bio":"Ron Small is an actor, known for Chiens des neiges (2002), Duets (2000) and Wilder Days (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0806523","name":"Ron Small","idIMDB":"nm0806523"},"actorId":"nm0806523","character":"Arthur","urlCharacter":"http://www.imdb.com/character/ch0422142","main":true},{"actorName":"Alison Matthews","urlProfile":"http://www.imdb.com/name/nm0559925","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzU5MzUwMzQ4OV5BMl5BanBnXkFtZTgwMjU5MDgyMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Alison Matthews is an actress, known for Final Destination 2 (2003), Ghost in the Shell: S.A.C. 2nd GIG - Individual Eleven (2005) and Ghost in the Shell: Stand Alone Complex - The Laughing Man (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzU5MzUwMzQ4OV5BMl5BanBnXkFtZTgwMjU5MDgyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0559925","name":"Alison Matthews","idIMDB":"nm0559925"},"actorId":"nm0559925","character":"TV Reporter","urlCharacter":"http://www.imdb.com/character/ch0422143","main":true}],"seasons":[],"idIMDB":"tt0281373","urlIMDB":"http://www.imdb.com/title/tt0281373","business":{"budget":{"money":"$35,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$23,708,174","country":"USA","day":"20","month":"01","year":"2002","remarks":"2,302 Screens"},{"money":"£331,432","country":"UK","day":"02","month":"06","year":"2002","remarks":"313 Screens"},{"money":"€396,564","country":"Italy","day":"03","month":"11","year":"2002","remarks":"96 Screens"},{"money":"$24,307","country":"Poland","day":"11","month":"08","year":"2002","remarks":"30 Screens"}],"gross":[{"money":"$81,150,692","country":"USA","day":"09","month":"06","year":"2002","remarks":""},{"money":"$81,134,747","country":"USA","day":"02","month":"06","year":"2002","remarks":""},{"money":"$81,110,575","country":"USA","day":"27","month":"05","year":"2002","remarks":""},{"money":"$81,047,105","country":"USA","day":"19","month":"05","year":"2002","remarks":""},{"money":"$80,962,682","country":"USA","day":"12","month":"05","year":"2002","remarks":""},{"money":"$80,855,043","country":"USA","day":"05","month":"05","year":"2002","remarks":""},{"money":"$80,721,601","country":"USA","day":"28","month":"04","year":"2002","remarks":""},{"money":"$80,536,237","country":"USA","day":"21","month":"04","year":"2002","remarks":""},{"money":"$80,297,737","country":"USA","day":"14","month":"04","year":"2002","remarks":""},{"money":"$79,978,474","country":"USA","day":"07","month":"04","year":"2002","remarks":""},{"money":"$79,418,425","country":"USA","day":"31","month":"03","year":"2002","remarks":""},{"money":"$79,071,721","country":"USA","day":"24","month":"03","year":"2002","remarks":""},{"money":"$78,753,031","country":"USA","day":"17","month":"03","year":"2002","remarks":""},{"money":"$77,413,283","country":"USA","day":"10","month":"03","year":"2002","remarks":""},{"money":"$75,521,473","country":"USA","day":"03","month":"03","year":"2002","remarks":""},{"money":"$72,626,533","country":"USA","day":"24","month":"02","year":"2002","remarks":""},{"money":"$68,115,878","country":"USA","day":"17","month":"02","year":"2002","remarks":""},{"money":"$59,914,940","country":"USA","day":"10","month":"02","year":"2002","remarks":""},{"money":"$51,127,496","country":"USA","day":"03","month":"02","year":"2002","remarks":""},{"money":"$38,811,967","country":"USA","day":"27","month":"01","year":"2002","remarks":""},{"money":"$23,708,174","country":"USA","day":"20","month":"01","year":"2002","remarks":""},{"money":"£2,837,355","country":"UK","day":"14","month":"07","year":"2002","remarks":""},{"money":"£2,698,604","country":"UK","day":"07","month":"07","year":"2002","remarks":""},{"money":"£2,550,184","country":"UK","day":"30","month":"06","year":"2002","remarks":""},{"money":"£2,410,511","country":"UK","day":"23","month":"06","year":"2002","remarks":""},{"money":"£2,182,144","country":"UK","day":"16","month":"06","year":"2002","remarks":""},{"money":"£1,857,945","country":"UK","day":"09","month":"06","year":"2002","remarks":""},{"money":"£331,432","country":"UK","day":"02","month":"06","year":"2002","remarks":""},{"money":"€1,314,652","country":"Italy","day":"09","month":"02","year":"2003","remarks":""},{"money":"€1,245,268","country":"Italy","day":"01","month":"12","year":"2002","remarks":""},{"money":"€1,131,281","country":"Italy","day":"24","month":"11","year":"2002","remarks":""},{"money":"€943,102","country":"Italy","day":"17","month":"11","year":"2002","remarks":""},{"money":"€698,706","country":"Italy","day":"10","month":"11","year":"2002","remarks":""},{"money":"€405,701","country":"Italy","day":"03","month":"11","year":"2002","remarks":""},{"money":"$24,307","country":"Poland","day":"11","month":"08","year":"2002","remarks":""},{"money":"SGD 291,679","country":"Singapore","day":"13","month":"06","year":"2002","remarks":""},{"money":"€1,127,520","country":"Spain","day":"10","month":"08","year":"2002","remarks":""}],"weekendGross":[{"money":"$5,992","country":"USA","day":"09","month":"06","year":"2002","remarks":"18 Screens"},{"money":"$14,864","country":"USA","day":"02","month":"06","year":"2002","remarks":"35 Screens"},{"money":"$39,687","country":"USA","day":"27","month":"05","year":"2002","remarks":"53 Screens"},{"money":"$54,817","country":"USA","day":"19","month":"05","year":"2002","remarks":"107 Screens"},{"money":"$84,741","country":"USA","day":"12","month":"05","year":"2002","remarks":"125 Screens"},{"money":"$88,615","country":"USA","day":"05","month":"05","year":"2002","remarks":"183 Screens"},{"money":"$139,757","country":"USA","day":"28","month":"04","year":"2002","remarks":"198 Screens"},{"money":"$179,773","country":"USA","day":"21","month":"04","year":"2002","remarks":"253 Screens"},{"money":"$242,037","country":"USA","day":"14","month":"04","year":"2002","remarks":"307 Screens"},{"money":"$317,507","country":"USA","day":"07","month":"04","year":"2002","remarks":"331 Screens"},{"money":"$245,103","country":"USA","day":"31","month":"03","year":"2002","remarks":"346 Screens"},{"money":"$189,807","country":"USA","day":"24","month":"03","year":"2002","remarks":"330 Screens"},{"money":"$581,859","country":"USA","day":"17","month":"03","year":"2002","remarks":"719 Screens"},{"money":"$1,448,312","country":"USA","day":"10","month":"03","year":"2002","remarks":"1,364 Screens"},{"money":"$2,305,529","country":"USA","day":"03","month":"03","year":"2002","remarks":"1,802 Screens"},{"money":"$3,337,801","country":"USA","day":"24","month":"02","year":"2002","remarks":"2,194 Screens"},{"money":"$6,704,229","country":"USA","day":"17","month":"02","year":"2002","remarks":"2,286 Screens"},{"money":"$7,178,790","country":"USA","day":"10","month":"02","year":"2002","remarks":"2,454 Screens"},{"money":"$10,199,650","country":"USA","day":"03","month":"02","year":"2002","remarks":"2,454 Screens"},{"money":"$13,079,373","country":"USA","day":"27","month":"01","year":"2002","remarks":"2,440 Screens"},{"money":"$23,708,174","country":"USA","day":"20","month":"01","year":"2002","remarks":"2,302 Screens"},{"money":"£39,682","country":"UK","day":"14","month":"07","year":"2002","remarks":"151 Screens"},{"money":"£108,421","country":"UK","day":"07","month":"07","year":"2002","remarks":"251 Screens"},{"money":"£113,502","country":"UK","day":"30","month":"06","year":"2002","remarks":"258 Screens"},{"money":"£188,814","country":"UK","day":"23","month":"06","year":"2002","remarks":"294 Screens"},{"money":"£212,036","country":"UK","day":"16","month":"06","year":"2002","remarks":"299 Screens"},{"money":"£561,897","country":"UK","day":"09","month":"06","year":"2002","remarks":"312 Screens"},{"money":"£331,432","country":"UK","day":"02","month":"06","year":"2002","remarks":"313 Screens"},{"money":"€1,362","country":"Italy","day":"09","month":"02","year":"2003","remarks":"3 Screens"},{"money":"€91,700","country":"Italy","day":"01","month":"12","year":"2002","remarks":"85 Screens"},{"money":"€156,150","country":"Italy","day":"24","month":"11","year":"2002","remarks":"94 Screens"},{"money":"€210,940","country":"Italy","day":"17","month":"11","year":"2002","remarks":"107 Screens"},{"money":"€247,117","country":"Italy","day":"10","month":"11","year":"2002","remarks":"115 Screens"},{"money":"$24,307","country":"Poland","day":"11","month":"08","year":"2002","remarks":"30 Screens"}],"admissions":[{"money":"768,718","country":"Germany","day":"10","month":"11","year":"2002","remarks":""},{"money":"667,361","country":"Germany","day":"03","month":"11","year":"2002","remarks":""},{"money":"450,414","country":"Germany","day":"27","month":"10","year":"2002","remarks":""},{"money":"194,091","country":"Germany","day":"20","month":"10","year":"2002","remarks":""},{"money":"239,789","country":"Netherlands","day":"31","month":"12","year":"2003","remarks":""},{"money":"229,588","country":"Netherlands","day":"31","month":"12","year":"2002","remarks":""},{"money":"253,302","country":"Spain","day":"10","month":"08","year":"2002","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"29","month":"01","year":"2001","remarks":null},null],"copyrightHolder":"Copyright © 2002 Disney Enterprises, Inc. All Rights Reserved (on print)"},"technical":{"runtime":["1 hr 39 min (99 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm (Kodak Vision 2383)"]},"rating":"5.1","metascore":"29","filmingLocations":[{"location":"Calgary, Alberta, Canada"}],"rated":"PG","awards":[{"award":"ASCAP Film and Television Music Awards 2003","titlesAwards":[{"titleAwardOutcome":"Won ASCAP Award","categories":[{"category":"Top Box Office Films","names":[{"name":"John Debney","id":"nm0002201","role":null},{"name":"The Scorpion King","id":"tt0277296","role":null}]}]}]}],"votes":"21,211","type":"Movie","companyCreditsSimple":[{"idCompany":"co0008970","name":"Walt Disney Pictures"},{"idCompany":"co0127668","name":"Kerner Entertainment Company"},{"idCompany":"co0071144","name":"Galapagos Productions"}],"keywords":{"keywords":["dog","sled dog","race","dentist","inheritance","alaska","cheese","dog movie","biracial","adoptive mother","adoptive father","heir","culture clash","competition","adoption","rescue","mother son relationship","lost in woods","african american","dog actor","adopted son","small town","dog sled","talking animal","reconciliation","father son relationship","based on book"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:43:14"}}