{"data":{"movies":[{"title":"The Hunted","originalTitle":"","year":"2003","releaseDate":"20030314","directors":[{"name":"William Friedkin","id":"nm0001243"}],"writers":[{"name":"David Griffiths","id":"nm0341656"},{"name":"Peter Griffiths","id":"nm0341735"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MjI4ODg2NV5BMl5BanBnXkFtZTcwMzI0NjgyMQ@@._V1.jpg","countries":["USA"],"languages":["English","Serbo-Croatian"],"genres":["Action","Crime","Drama","Thriller"],"plot":"In the green woods of Silver Falls, Oregon, Aaron Hallam, a trained assassin AWOL from the Special Forces, keeps his own brand of wildlife vigil. After Hallam brutally slew four deer hunters in the area, FBI Special Agent Abby Durrell turns to L.T. Bonham-- the one man who may be able to stop him. At first L.T. resists the mission. Snug in retirement, he's closed off to his past, the years he spent in the Special Forces training soldiers to become skilled killers. But when he realizes that these recent slaying is the work of a man he trained, he feels obligated to stop him. Accepting the assignment under the condition that he works alone, L.T. enters the woods, unarmed--plagued by memories of his best student and riddled with guilt for not responding to Aaron's tortured letters to him as he began to slip over the edge of sanity. Furious as he is with his former mentor for ignoring his pleas for help, Aaron knows that he and L.T. share a tragic bond that is unbreakable. And, even as ...","simplePlot":"An FBI deep-woods tracker captures a trained assassin who has made a sport of hunting humans.","actors":[{"actorName":"Tommy Lee Jones","urlProfile":"http://www.imdb.com/name/nm0000169","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNjc4MDc0OV5BMl5BanBnXkFtZTcwOTc5OTUwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1946","placeOfBirth":" San Saba, Texas, USA","height":"6' (1.83 m)","bio":"Tommy Lee Jones was born in San Saba, Texas, the son of Lucille Marie (Scott), a police officer and beauty shop owner, and Clyde C. Jones, who worked on oil fields. Tommy himself worked in underwater construction and on an oil rig. He attended St. Mark's School of Texas, a prestigious prep school for boys in Dallas, on a scholarship, and went to Harvard on another scholarship. He roomed with future Vice President Al Gore and played offensive guard in the famous 29-29 Harvard-Yale football game of '68 known as \"The Tie.\" He received a B.A. in English literature and graduated cum laude from Harvard in 1969. Following college, he moved to New York and began his theatrical career on Broadway in \"A Patriot for Me\" (1969). In 1970, he made his film debut in Love Story (1970). While living in New York, he continued to appear in various plays, both on- and off-Broadway: \"Fortune and Men's Eyes\" (1969); \"Four on a Garden\" (1971); \"Blue Boys\" (1972); \"Ulysses in Nighttown\" (1974). During this time, he also appeared on a daytime soap opera, One Life to Live (1968) as Dr. Mark Toland from 1971-75. He moved with wife Kate Lardner, granddaughter of short-story writer/columnist Ring Lardner, and her two children from a previous marriage, to Los Angeles. There he began to get some roles on television: Charlie's Angels (1976) (pilot episode); Smash-Up on Interstate 5 (1976); and The Amazing Howard Hughes (1977). While working on the movie Back Roads (1981), he met and fell in love with Kimberlea Cloughley, whom he later married. More roles in television--both on network and cable--stage and film garnered him a reputation as a strong, explosive, thoughtful actor who could handle supporting as well as leading roles. He made his directorial debut in The Good Old Boys (1995) on TNT. In addition to directing and starring in the film, he co-wrote the teleplay (with J.T. Allen). The film, based on Elmer Kelton's novel, is set in west Texas where Jones has strong family ties. Consequently, this story of a cowboy facing the end of an era has special meaning for him.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNjc4MDc0OV5BMl5BanBnXkFtZTcwOTc5OTUwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000169","name":"Tommy Lee Jones","nicknames":["TLJ","Tom"],"idIMDB":"nm0000169"},"actorId":"nm0000169","character":"L.T. Bonham","urlCharacter":"http://www.imdb.com/character/ch0015404","main":true},{"actorName":"Benicio Del Toro","urlProfile":"http://www.imdb.com/name/nm0001125","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzODQ4NzU1N15BMl5BanBnXkFtZTcwOTUzMzc5Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 February 1967","placeOfBirth":" San Germán, Puerto Rico","birthName":"Benicio Monserrate Rafael Del Toro Sanchez","height":"6' 2\" (1.88 m)","bio":"Benicio Del Toro emerged in the mid-1990s as one of the most watchable and charismatic character actors to come along in years. A favorite of film buffs, Del Toro gained mainstream public attention as the conflicted but basically honest Mexican policeman in Steven Soderbergh's Traffic (2000). Born on February 19, 1967 in San Germán, Puerto Rico, Benicio is the son of lawyer parents Fausta Genoveva Sanchez Rivera and Gustavo Adolfo Del Toro Bermudez. His mother died when he was young, and his father moved the family to a farm in Pennsylvania. A basketball player with an interest in acting, he decided to follow the family way and study business at the University of California in San Diego. A class in acting resulted in his being bitten by the acting bug, and he subsequently dropped out and began studying with legendary acting teacher Stella Adler in Los Angeles and at the Circle in the Square Acting School in New York City. Telling his parents that he was taking courses in business, Del Toro hid his new studies from his family for a little while. During the late 1980s, he made several television appearances, most notably in an episode of Miami Vice (1984) and in the NBC miniseries Drug Wars: The Camarena Story (1990). Del Toro's big-screen career got off to a slower start, however--his first role was Duke the Dog-Faced Boy in Big Top Pee-wee (1988). However, things looked better when he landed the role of Dario, the vicious henchman in the James Bond film Licence to Kill (1989). Surprising his co-stars at age 21, Del Toro was the youngest actor ever to portray a Bond villain. However, the potential break was spoiled as the picture turned out to be one of the most disappointing Bond films ever; this was lost amid bigger summer competition. Benicio gave creditable performances in many overlooked films for the next several years, such as The Indian Runner (1991), Christopher Columbus: The Discovery (1992) and Money for Nothing (1993). His roles in Fearless (1993) and China Moon (1994) gained him more critical notices, and 1995 proved to be the first \"Year of Benicio\" as he gave a memorable performance in Swimming with Sharks (1994) before taking critics and film buffs by storm as the mumbling, mysterious gangster in The Usual Suspects (1995), directed by Bryan Singer. Del Toro won an Independent Spirit Award for Best Supporting Actor for the role in the Oscar-winning film. Staying true to his independent roots, he next gave a charismatic turn as cold-blooded gangster Gaspare Spoglia in The Funeral (1996) directed by Abel Ferrara. He also appeared as Benny Dalmau in Basquiat (1996), directed by artist friend Julian Schnabel. That year also marked his first truly commercial film, as he played cocky Spanish baseball star Juan Primo in The Fan (1996), which starred Robert De Niro. Del Toro took his first leading man role in Excess Baggage (1997), starring and produced by Alicia Silverstone. Hand-picked by Silverstone, Del Toro's performance was pretty much the only thing critics praised about the film, and showed the level of consciousness he was beginning to have in the minds of film fans. He took a leading role with his good friend Johnny Depp in Fear and Loathing in Las Vegas (1998), co-written and directed by the legendary Terry Gilliam. Gaining 40 pounds for the role of Dr. Gonzo, the drug-addicted lawyer to sportswriter Raoul Duke, Benicio immersed himself totally in the role. Using his method acting training so far as to burn himself with cigarettes for a scene, this was a trying time for Del Toro. The harsh critical reviews proved tough on him, as he felt he had given his all for the role and been dismissed. Many saw the crazed, psychotic performance as a confirmation of the rumors and overall weirdness that people seemed to place on Del Toro. Taking a short break after the ordeal, 2000 proved to be the second \"Year of Benicio\". He first appeared in The Way of the Gun (2000), directed by friend and writer Christopher McQuarrie. Then he went to work for actor's director Steven Soderbergh in Traffic (2000). A complex and graphic film, this nonetheless became a widespread success and Oscar winner. His role as conflicted Mexican policeman Javier Rodriguez functions as the movie's real heart amid an all-star ensemble cast, and many praised this as the year's best performance, a sentiment validated by a Screen Actor's Guild Award for \"Best Actor\". He also gave a notable performance in Snatch (2000) directed by Guy Ritchie, which was released several weeks later, and The Pledge (2001) directed by Sean Penn. Possessing sleepy good looks reminiscent of James Dean or Marlon Brando, Del Toro has often jokingly been referred to as the \"Spanish Brad Pitt\". With his newfound celebrity, Del Toro has become a sort of heartthrob, being voted one of People magazine's \"50 Most Beautiful People\" as well as \"Most Eligible Bachelors\". A favorite of film fans for years for his diverse and \"cool guy\" gangster roles, he is currently becoming a mainstream favorite respected for his acting skills and choices. So far very careful in his choices and who he works with, Del Toro can boast an impressive resume of films with some of the most influential and respected people in the film business.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzODQ4NzU1N15BMl5BanBnXkFtZTcwOTUzMzc5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001125","name":"Benicio Del Toro","nicknames":["Beno"],"idIMDB":"nm0001125"},"actorId":"nm0001125","character":"Aaron Hallam","urlCharacter":"http://www.imdb.com/character/ch0015405","main":true},{"actorName":"Connie Nielsen","urlProfile":"http://www.imdb.com/name/nm0001567","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwOTQ5NTc3OTVeQTJeQWpwZ15BbWU4MDY4MDc1MDYx._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 July 1965","placeOfBirth":" Elling, Frederikshavn, Denmark","birthName":"Connie Inge-Lise Nielsen","height":"5' 10½\" (1.79 m)","bio":"Danish beauty Connie Nielsen consistently lights up the screen with an eclectic bevy of film roles. She was born in Frederikshavn, Denmark, to a mother who worked as an insurance clerk, and a father, Bent Nielsen, who was a bus driver. Nielsen began her acting career working alongside her mother on the local revue and variety scene. At 18, she headed to Paris to continue her pursuit of acting, which led her to further work and study in Rome and Milan. In addition to being an accomplished actress, Nielsen is also a trained singer, dancer and is fluent in English, German, Danish, Swedish, French and Italian. She resides in New York. However, it was Nielsen's portrayal of \"Princess Lucilla\", opposite Russell Crowe's Maximus in Ridley Scott's Academy Award-winning Gladiator (2000), which first garnered a mass appeal. She won Best Actress Awards from the Danish Academy Awards and from the San Sebastian Film Festival for her role in the Danish drama Brothers (2004) (aka Brothers), which was released by Focus Features and IFC Films. She then appeared in the World War II epic The Great Raid (2005) opposite Benjamin Bratt, Joseph Fiennes and James Franco for director John Dahl and produced by Miramax; the dramatic thriller Return to Sender (2004) directed by Bille August, which premiered at The Toronto Film Festival in 2004; and the black comedy The Ice Harvest (2005) with John Cusack, Billy Bob Thornton and Randy Quaid, directed by Harold Ramis for Focus Features. In 2003, Nielsen starred as an industrial spy in a corporate war in the critically acclaimed suspense thriller Demonlover (2002), directed by Olivier Assayas and co-starring Chloë Sevigny and Gina Gershon. Her other lead roles range from The Hunted (2003) by director William Friedkin (with Tommy Lee Jones and Benicio Del Toro; to Basic (2003) by director John McTiernan (opposite John Travolta and Samuel L. Jackson); to One Hour Photo (2002) where she starred opposite Robin Williams; to Mission to Mars (2000) opposite Gary Sinise, Tim Robbins and Don Cheadle; to The Devil's Advocate (1997) starring Al Pacino and Keanu Reeves. Additionally, Nielsen has received a Best Actress Award from the Empire Awards for her role in Gladiator (2000), and has given unforgettable performances as a German heroin junkie in Permanent Midnight (1998) opposite Ben Stiller and as an unmatronly Texas mother in Rushmore (1998) opposite Bill Murray. Other film credits include Innocents (2000) (aka The Innocents) opposite Jean-Hugues Anglade, Voyage (1993) with Rutger Hauer and Eric Roberts.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwOTQ5NTc3OTVeQTJeQWpwZ15BbWU4MDY4MDc1MDYx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001567","name":"Connie Nielsen","idIMDB":"nm0001567"},"actorId":"nm0001567","character":"Abby Durrell","urlCharacter":"http://www.imdb.com/character/ch0015406","main":true},{"actorName":"Leslie Stefanson","urlProfile":"http://www.imdb.com/name/nm0005462","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMjA4NDA0OV5BMl5BanBnXkFtZTYwNjAwNDE0._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 May 1971","placeOfBirth":" Fargo, North Dakota, USA","birthName":"Leslie Ann Stefanson","height":"5' 11½\" (1.82 m)","bio":"Leslie Stefanson was born on May 10, 1971 in Fargo, North Dakota, USA as Leslie Ann Stefanson. She is an actress, known for Unbreakable (2000), The General's Daughter (1999) and As Good as It Gets (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMjA4NDA0OV5BMl5BanBnXkFtZTYwNjAwNDE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005462","name":"Leslie Stefanson","idIMDB":"nm0005462"},"actorId":"nm0005462","character":"Irene Kravitz","urlCharacter":"http://www.imdb.com/character/ch0360751","main":true},{"actorName":"John Finn","urlProfile":"http://www.imdb.com/name/nm0278125","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNzg1MTAyN15BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1952","placeOfBirth":" New York City, New York, USA","birthName":"John Joseph Finn","bio":"John Finn was born on September 30, 1952 in New York City, New York, USA as John Joseph Finn. He is an actor and director, known for Cold Case (2003), Catch Me If You Can (2002) and Glory (1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNzg1MTAyN15BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0278125","name":"John Finn","idIMDB":"nm0278125"},"actorId":"nm0278125","character":"Ted Chenoweth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"José Zúñiga","urlProfile":"http://www.imdb.com/name/nm0959242","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MTYyMTM5MF5BMl5BanBnXkFtZTgwOTM0OTU0ODE@._V1_UY44_CR21,0,32,44_AL_.jpg","biography":{"height":"5' 8½\" (1.74 m)","bio":"Born in Honduras, José moved to New York City at the age of 7. His first film was RIDING THE RAILS. Jose rode on freight trains and lived in homeless shelters during the 4 months of filming. When he returned to NYC his then agent secured him an audition for ALIVE directed by Frank Marshall.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MTYyMTM5MF5BMl5BanBnXkFtZTgwOTM0OTU0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0959242","name":"José Zúñiga","idIMDB":"nm0959242"},"actorId":"nm0959242","character":"Bobby Moret","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ron Canada","urlProfile":"http://www.imdb.com/name/nm0133474","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNDc2ODQ0NF5BMl5BanBnXkFtZTgwNDUwMTgxMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 May 1949","placeOfBirth":" New York City, New York, USA","height":"5' 10\" (1.78 m)","bio":"Ron Canada was born on May 3, 1949 in New York City, New York, USA. He is an actor and producer, known for Wedding Crashers (2005), National Treasure (2004) and Cinderella Man (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNDc2ODQ0NF5BMl5BanBnXkFtZTgwNDUwMTgxMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0133474","name":"Ron Canada","idIMDB":"nm0133474"},"actorId":"nm0133474","character":"Harry Van Zandt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Pellegrino","urlProfile":"http://www.imdb.com/name/nm0671032","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MDc0Mjg4N15BMl5BanBnXkFtZTcwOTMyNTUyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1965","placeOfBirth":" Los Angeles, California, USA","birthName":"Mark Ross Pellegrino","height":"6' 1\" (1.85 m)","bio":"Mark Pellegrino was born on April 9, 1965 in Los Angeles, California, USA as Mark Ross Pellegrino. He is an actor and producer, known for The Big Lebowski (1998), National Treasure (2004) and The Number 23 (2007). He has been married to Tracy Pellegrino since October 30, 2008. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MDc0Mjg4N15BMl5BanBnXkFtZTcwOTMyNTUyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0671032","name":"Mark Pellegrino","idIMDB":"nm0671032"},"actorId":"nm0671032","character":"Dale Hewitt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jenna Boyd","urlProfile":"http://www.imdb.com/name/nm0101799","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NzQ3Mzg0M15BMl5BanBnXkFtZTgwMTgzMzQ0NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1993","placeOfBirth":" Bedford, Texas, USA","birthName":"Jenna Michelle Boyd","height":"5' 4\" (1.63 m)","bio":"Born in Bedford, Texas, on March 4, 1993, the multi-talented Jenna Boyd has been \"on the go\" in her life since the age of 2. Her mother, Debbie, entered Jenna into a modeling search when she was two years old. Her enthusiasm and sweet nature captured the hearts of agents who informed her mother to send Jenna to agencies. Soon enough, Jenna was appearing in commercials and print ads, and was cast as one of the young kids in The Barney Show. A few years later, the family moved to Atlanta, Georgia, because of work commitments involving Jenna's father, Mike, who now flies for Delta Air. Jenna's agent in Atlanta urged Debbie to temporarily move to Los Angeles, California, to audition. It worked, and Jenna was quickly cast in the TV shows CSI: Crime Scene Investigation (2000), Just Shoot Me! (1997), Titus (1999), and Six Feet Under (2001). Jenna also appeared in the feature TV-movie Mary Christmas (2002) where she played the lead character, Felice. Jenna's first foray into film was a small part in The Exorcist (1973) director William Friedkin's The Hunted (2003) where she played daughter to Benicio Del Toro's character; the film also stars Tommy Lee Jones. She then appeared in Sam Weisman's Dickie Roberts: Former Child Star (2003) playing star David Spade's \"adopted\" daughter Sally. Jenna's biggest breakthrough came in Ron Howard's (Night Shift (1982), Apollo 13 (1995)) 2003 film The Missing (2003), where she received critical acclaim for her haunting portrayal of Dot Gilkenson, daughter of Cate Blanchett's character. (This was Jenna's second time working with Tommy Lee Jones.) Besides acting, Jenna Boyd is also an award-winning skater. On the ice as early as 5:15 in the morning, Jenna's determination in her skating has already led her to master the double jump move, which is very successful for the 11-year old (her favorite skater is Tara Lipinski). Despite the hectic schedule of juggling skating, school (she's a straight-A student) and acting, Jenna is gifted and strong enough to handle it all. Jenna's other hobbies include running a spy club with her friends, horseback riding, attending church, making homemade perfumes and spending time with her brother, Cayden, who is also an up-and-coming actor (last seen in Clint Eastwood's 2003 film Mystic River (2003) as the son to the Tim Robbins character). Jenna Boyd currently resides in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NzQ3Mzg0M15BMl5BanBnXkFtZTgwMTgzMzQ0NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0101799","name":"Jenna Boyd","nicknames":["Jen"],"idIMDB":"nm0101799"},"actorId":"nm0101799","character":"Loretta Kravitz","urlCharacter":"http://www.imdb.com/character/ch0015407","main":true},{"actorName":"Aaron DeCone","urlProfile":"http://www.imdb.com/name/nm1002614","urlPhoto":"","biography":{"dateOfBirth":"30 October 1975","placeOfBirth":" Portland, Oregon, USA","bio":"Aaron DeCone was born on October 30, 1975 in Portland, Oregon, USA. He is an actor, known for The Hunted (2003) and Love Is Strange (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1002614","name":"Aaron DeCone","idIMDB":"nm1002614"},"actorId":"nm1002614","character":"Stokes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carrick O'Quinn","urlProfile":"http://www.imdb.com/name/nm0642359","urlPhoto":"","biography":{"bio":"Carrick O'Quinn is known for his work on 24 (2001), The Dark Knight Rises (2012) and Captain America: The First Avenger (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0642359","name":"Carrick O'Quinn","idIMDB":"nm0642359"},"actorId":"nm0642359","character":"Kohler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lonny Chapman","urlProfile":"http://www.imdb.com/name/nm0152452","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWRjYmZjZmMtYWZjMS00N2UwLWI2YTYtNjRmOTE3ZWE5NzYwL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1920","placeOfBirth":" Tulsa, Oklahoma, USA","birthName":"Lon Leonard Chapman","bio":"Utilitarian actor Lonny Chapman remains one of those highly familiar character faces to which you can't quite place the name. While he appeared in over 30 films and well over 300 TV programs over a five-decade career, the theater remained his first and foremost passion and for which he is best remembered. From 1973 until his death 34 years later, he was artistic director of the Group Repertory Theatre (GRT), a North Hollywood non-profit acting organization for which he also served as producer, writer, director and actor. It was a place to which scores and scores of L.A.-based actors would, and did, call \"home\". The facility, which is still running today, was renamed the Lonny Chapman Group Repertory Theatre (LCGRT) in 1999 in loving tribute. He was born Lon Leonard Chapman on October 1, 1920, in Tulsa, Oklahoma, but grew up in the city of Joplin, Missouri. His interest in acting started while fairly young. Following his graduations from Joplin High School (1938) and Joplin Junior College (1940), the athletically-inclined Lonny attended the University of Oklahoma on a track scholarship. The bombing of Pearl Harbor, however, interrupted his college studies, joining the Marines the very next day. He saw major action in the South Pacific, including Guadalcanal. During his 5-year tour of duty, he contracted malaria; frequent recurrences would plague him the rest of his life. The track star returned to his Oklahoma college following war duty and graduated with a BFA in Drama in 1947. While at college Lonny became best friends with actor Dennis Weaver, who was also a talented track-and-field athlete and fellow drama student. The two young hopefuls hitchhiked together to New York City where they began their respective careers. Within a year (1948) Lonny was appearing as \"Wiley\" in the Chicago company of \"Mister Roberts\", directed by Joshua Logan. The year after that, he made his Broadway debut in \"The Closing Door\", directed by Lee Strasberg. During this time, he also established strong ties with the prestigious Group Theatre and Actors Studio. It was at the Actors Studio that he forged lifelong friendships with director Mark Rydell, and character actors Martin Landau, R.G. Armstrong, Pat Hingle and Logan Ramsey, among others. Arguably, the peak of Lonny's early stage career occurred in 1950, when he co-starred in the award-winning drama \"Come Back, Little Sheba\", William Inge's first play to be produced on Broadway. Art imitated life in this case as Lonny portrayed the second lead role of \"Turk\", a college student and star athlete. Coincidentally, friend Dennis Weaver became his understudy and eventually took over the role. Starring Tony winners Shirley Booth and Sidney Blackmer, only Ms. Booth went on to recreate her role in the film version for which she won the Oscar. Lonny, who had yet to make a movie, was replaced by the already-established Richard Jaeckel as \"Turk\" in the film version. Lonny continued to solidify his reputation on Broadway with \"The Chase\" (1952), produced and directed by José Ferrer and starring Actors Studio exponents Kim Stanley and Kim Hunter; \"Whistler's Grandmother\" (1952), co-starring Josephine Hull; \"The Ladies of the Corridor\" (1953), directed by renowned \"Group Theatre\" member Harold Clurman; and the Horton Foote-penned \"The Traveling Lady\" (1954), again starring Ms. Stanley. Elsewhere, he earned excellent notices as \"Tom\" opposite Franchot Tone's \"Joe\" in a revival of William Saroyan's \"The Time of Your Life\" and as the \"Gentleman Caller\" in the first national tour of \"The Glass Menagerie\" starring Helen Hayes. By this time, Lonny had begun appearing on early TV, making his debut in an episode of Captain Video and His Cartoon Rangers (1956). His first film was a featured role in the tuneful Doris Day/Frank Sinatra drama Young at Heart (1954) in which he shared secondary scenes with Elisabeth Fraser. Actor Studio preeminent Elia Kazan took a strong liking to Lonny as an actor and looked for no one else to play the role of \"Roy\", the auto mechanic, in the classic John Steinbeck film East of Eden (1955), which catapulted James Dean to cult status. Kazan then gave Lonny a plum role in his film Baby Doll (1956). In the late 1950s, Chapman began to show promise as a mover and shaker in the theater. In 1959, and for eight seasons following, he and co-founder Curt Conway devoted their summer seasons to the Cecilwood Theatre in Fishkill, New York, where he directed over 80 productions and performed in nearly thirty. Those up-and-comers who received their Equity union card under his guidance included Barbra Streisand, Dustin Hoffman and Robert Duvall. As a playwright, Lonny saw two of his own works produced off-Broadway -- \"The Buffalo Skinner\" and \"Cry of the Raindrop\". Lonny migrated to Los Angeles in the 1960s in order to pursue film and TV roles and, along with Martin Landau, helped form the West branch of the Actors Studio out there. His gritty look, trademark dusky voice, earnest demeanor and solid Midwest upbringing was his meal ticket for getting Hollywood work. Tailor-made for earthy, blue-collar roles, he was most at home playing unpretentious folk. One would be hard-pressed to see him donning tie and tails in highly elegant settings when he obviously appeared more at home in a plaid shirt with rolled up sleeves or, at the most, a tweed sport coat with loose tie. He provided stark authenticity to a number of westerns, crimers and small-town dramas. In Alfred Hitchcock's The Birds (1963), he portrayed the concerned diner operator who tends to Tippi Hedren's head wound after her first gull attack. He subsequently played a secondary but pivotal role in director/friend Mark Rydell's picture The Reivers (1969) set in Mississippi with Steve McQueen, and also one of Sally Field's chauvinistic bosses in the down-home drama Norma Rae (1979). He showed remarkable versatility with a top, change-of-pace supporting part in the early Woody Allen comedy classic Take the Money and Run (1969). In 1973, he formed the Group Repertory Theatre and served as its first and only artistic director (until his death). Under his strong leadership, the non-profit organization staged over 350 productions, 45 of which were world premieres of original works. Sean Penn and Jennifer Tilly are former members of the company. Quite visible on TV, he appeared to good advantage in prime-time programming. Headlining one TV series that never got firmly off the ground, The Investigator (1958), in which he played a private detective, he also co-starred with William Shatner and Jessica Walter in the \"Law and Order\" precursor For the People (1965). During the 60s, 70s and 80s, the gruff, bushy-browed actor could always be spotted somewhere on a topnotch crime show (Perry Mason (1957), The Defenders (1961) (recurring role), Judd for the Defense (1967), Mission: Impossible (1966), Mannix (1967), Ironside (1967), Quincy M.E. (1976), Matlock (1986)). He was given just as much footage sitting tall in the saddle in various western series (Laredo (1965), The Rifleman (1958), The Virginian (1962), Bonanza (1959)). He also appeared more than a few times on Gunsmoke (1955) and McCloud (1970), which starred his good friend Dennis Weaver. One particular highlight was his patriarchal role in an above-par TV-movie adaptation of The Rainmaker (1982) co-starring Tommy Lee Jones and Tuesday Weld. A modest, down-to-earth kind of guy with a generous heart and spirit who preferred not to call attention to himself, Chapman was a sturdy film and TV presence over the years playing a hefty number of heroes, villains, boss types and confidantes. Although he worked consistently throughout the years, he never found the one role that might have moved him up the pecking order and propel him to the very top of the character echelon. In the twilight of his film career, he showed eerie countenance in his elderly watchman role in Nightwatch (1997), and last graced the screen as an octogenarian in Reindeer Games (2000), directed by John Frankenheimer and The Hunted (2003), directed by William Friedkin. The last few years of his life were marred by failing health and the increasingly frail actor had to eventually be placed in a Sherman Oaks (California) care facility. He died there of complications from pneumonia and heart disease a little more than a week after his 87th birthday, on October 12, 2007. He was survived by his steadfast wife (of nearly 65 years), the former Erma Dean Gibbons, and their son Wyley Dean.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWRjYmZjZmMtYWZjMS00N2UwLWI2YTYtNjRmOTE3ZWE5NzYwL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0152452","name":"Lonny Chapman","idIMDB":"nm0152452"},"actorId":"nm0152452","character":"Zander","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rex Linn","urlProfile":"http://www.imdb.com/name/nm0513010","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzcwMjA3Ml5BMl5BanBnXkFtZTcwNzcyMjQ4MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1956","placeOfBirth":" Spearman, Texas, USA","birthName":"Rex Maynard Linn","height":"6' 4\" (1.93 m)","bio":"Rex Linn was born on November 13, 1956 in Spearman, Texas, USA as Rex Maynard Linn. He is an actor and producer, known for CSI: Miami (2002), Django Unchained (2012) and Cliffhanger (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzcwMjA3Ml5BMl5BanBnXkFtZTcwNzcyMjQ4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0513010","name":"Rex Linn","idIMDB":"nm0513010"},"actorId":"nm0513010","character":"Powell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eddie Velez","urlProfile":"http://www.imdb.com/name/nm0892455","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDA3NjAwNjEyOF5BMl5BanBnXkFtZTcwNzcyMDM1OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1958","placeOfBirth":" New York City, New York, USA","birthName":"Edwin Velez","height":"5' 11\" (1.8 m)","bio":"Eddie Velez was born on June 4, 1958 in New York City, New York, USA as Edwin Velez. He is an actor and producer, known for Traffic (2000), White Chicks (2004) and Repo Man (1984). He has been married to Catharine Grace since 1990. He was previously married to Edna.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDA3NjAwNjEyOF5BMl5BanBnXkFtZTcwNzcyMDM1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0892455","name":"Eddie Velez","idIMDB":"nm0892455"},"actorId":"nm0892455","character":"Richards","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexander MacKenzie","urlProfile":"http://www.imdb.com/name/nm0533399","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzMwODAxMTg2OV5BMl5BanBnXkFtZTcwMDMzNTQ5Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Alexander Lambert Bewkes","bio":"Alexander MacKenzie was born as Alexander Lambert Bewkes. He is an actor and producer, known for The Hunted (2003), Bucksville (2011) and Dancing on the Edge (2011). He has been married to Victoria MacKenzie since June 18, 2004. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzMwODAxMTg2OV5BMl5BanBnXkFtZTcwMDMzNTQ5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0533399","name":"Alexander MacKenzie","nicknames":["Sandy"],"idIMDB":"nm0533399"},"actorId":"nm0533399","character":"Sheriff","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0269347","urlIMDB":"http://www.imdb.com/title/tt0269347","business":{"budget":{"money":"$55,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$13,482,638","country":"USA","day":"16","month":"03","year":"2003","remarks":"2,516 Screens"},{"money":"£394,122","country":"UK","day":"08","month":"06","year":"2003","remarks":"280 Screens"},{"money":"$83,129","country":"Argentina","day":"13","month":"05","year":"2003","remarks":"26 Screens"},{"money":"€416,569","country":"Italy","day":"06","month":"04","year":"2003","remarks":"259 Screens"},{"money":"€734,324","country":"Spain","day":"30","month":"03","year":"2003","remarks":"282 Screens"}],"gross":[{"money":"$34,238,611","country":"USA","day":"26","month":"05","year":"2003","remarks":""},{"money":"$34,195,533","country":"USA","day":"18","month":"05","year":"2003","remarks":""},{"money":"$34,103,521","country":"USA","day":"11","month":"05","year":"2003","remarks":""},{"money":"$33,989,161","country":"USA","day":"04","month":"05","year":"2003","remarks":""},{"money":"$33,918,009","country":"USA","day":"27","month":"04","year":"2003","remarks":""},{"money":"$33,779,394","country":"USA","day":"20","month":"04","year":"2003","remarks":""},{"money":"$33,363,202","country":"USA","day":"13","month":"04","year":"2003","remarks":""},{"money":"$32,137,611","country":"USA","day":"06","month":"04","year":"2003","remarks":""},{"money":"$29,222,759","country":"USA","day":"30","month":"03","year":"2003","remarks":""},{"money":"$23,390,799","country":"USA","day":"23","month":"03","year":"2003","remarks":""},{"money":"$13,482,638","country":"USA","day":"16","month":"03","year":"2003","remarks":""},{"money":"£682,406","country":"UK","day":"15","month":"06","year":"2003","remarks":""},{"money":"£394,122","country":"UK","day":"08","month":"06","year":"2003","remarks":""},{"money":"$10,782,486","country":"Worldwide","day":"07","month":"11","year":"2003","remarks":"except USA"},{"money":"$243,527","country":"Argentina","day":"24","month":"06","year":"2003","remarks":""},{"money":"$234,264","country":"Argentina","day":"17","month":"06","year":"2003","remarks":""},{"money":"$218,777","country":"Argentina","day":"10","month":"06","year":"2003","remarks":""},{"money":"$195,617","country":"Argentina","day":"03","month":"06","year":"2003","remarks":""},{"money":"$167,396","country":"Argentina","day":"27","month":"05","year":"2003","remarks":""},{"money":"$147,330","country":"Argentina","day":"20","month":"05","year":"2003","remarks":""},{"money":"$83,129","country":"Argentina","day":"13","month":"05","year":"2003","remarks":""},{"money":"€874,341","country":"Italy","day":"27","month":"04","year":"2003","remarks":""},{"money":"€859,640","country":"Italy","day":"21","month":"04","year":"2003","remarks":""},{"money":"€713,068","country":"Italy","day":"13","month":"04","year":"2003","remarks":""},{"money":"€416,569","country":"Italy","day":"06","month":"04","year":"2003","remarks":""},{"money":"$449,939","country":"Russia","day":"27","month":"07","year":"2003","remarks":""},{"money":"€1,521,460","country":"Spain","day":"13","month":"04","year":"2003","remarks":""},{"money":"€1,269,328","country":"Spain","day":"06","month":"04","year":"2003","remarks":""},{"money":"€734,324","country":"Spain","day":"30","month":"03","year":"2003","remarks":""}],"weekendGross":[{"money":"$20,381","country":"USA","day":"26","month":"05","year":"2003","remarks":"42 Screens"},{"money":"$51,282","country":"USA","day":"18","month":"05","year":"2003","remarks":"120 Screens"},{"money":"$105,956","country":"USA","day":"11","month":"05","year":"2003","remarks":"205 Screens"},{"money":"$48,894","country":"USA","day":"04","month":"05","year":"2003","remarks":"145 Screens"},{"money":"$67,878","country":"USA","day":"27","month":"04","year":"2003","remarks":"213 Screens"},{"money":"$188,932","country":"USA","day":"20","month":"04","year":"2003","remarks":"456 Screens"},{"money":"$670,405","country":"USA","day":"13","month":"04","year":"2003","remarks":"1,090 Screens"},{"money":"$1,855,035","country":"USA","day":"06","month":"04","year":"2003","remarks":"1,685 Screens"},{"money":"$3,616,241","country":"USA","day":"30","month":"03","year":"2003","remarks":"2,244 Screens"},{"money":"$6,510,154","country":"USA","day":"23","month":"03","year":"2003","remarks":"2,517 Screens"},{"money":"$13,482,638","country":"USA","day":"16","month":"03","year":"2003","remarks":"2,516 Screens"},{"money":"£102,386","country":"UK","day":"15","month":"06","year":"2003","remarks":"247 Screens"},{"money":"£394,122","country":"UK","day":"08","month":"06","year":"2003","remarks":"280 Screens"},{"money":"$9,263","country":"Argentina","day":"24","month":"06","year":"2003","remarks":"23 Screens"},{"money":"$15,487","country":"Argentina","day":"17","month":"06","year":"2003","remarks":"26 Screens"},{"money":"$23,160","country":"Argentina","day":"10","month":"06","year":"2003","remarks":"27 Screens"},{"money":"$28,221","country":"Argentina","day":"03","month":"06","year":"2003","remarks":"26 Screens"},{"money":"$20,066","country":"Argentina","day":"27","month":"05","year":"2003","remarks":"26 Screens"},{"money":"$64,201","country":"Argentina","day":"20","month":"05","year":"2003","remarks":"26 Screens"},{"money":"$83,129","country":"Argentina","day":"13","month":"05","year":"2003","remarks":"26 Screens"},{"money":"€4,304","country":"Italy","day":"27","month":"04","year":"2003","remarks":"6 Screens"},{"money":"€94,143","country":"Italy","day":"21","month":"04","year":"2003","remarks":"40 Screens"},{"money":"€158,831","country":"Italy","day":"13","month":"04","year":"2003","remarks":"111 Screens"},{"money":"€148,400","country":"Spain","day":"13","month":"04","year":"2003","remarks":"160 Screens"},{"money":"€346,874","country":"Spain","day":"06","month":"04","year":"2003","remarks":"272 Screens"},{"money":"€734,324","country":"Spain","day":"30","month":"03","year":"2003","remarks":"282 Screens"}],"admissions":[{"money":"141,488","country":"Argentina","day":"24","month":"06","year":"2003","remarks":""},{"money":"123,724","country":"Argentina","day":"17","month":"06","year":"2003","remarks":""},{"money":"100,039","country":"Argentina","day":"10","month":"06","year":"2003","remarks":""},{"money":"86,369","country":"Argentina","day":"03","month":"06","year":"2003","remarks":""},{"money":"73,521","country":"Argentina","day":"27","month":"05","year":"2003","remarks":""},{"money":"59,988","country":"Argentina","day":"20","month":"05","year":"2003","remarks":""},{"money":"25,829","country":"Argentina","day":"13","month":"05","year":"2003","remarks":""},{"money":"19,934","country":"Brazil","day":"24","month":"04","year":"2003","remarks":""},{"money":"54,064","country":"Germany","day":"20","month":"04","year":"2003","remarks":""},{"money":"66,748","country":"Italy","day":"06","month":"04","year":"2003","remarks":""},{"money":"54,739","country":"Netherlands","day":"31","month":"12","year":"2003","remarks":""},{"money":"321,622","country":"Spain","day":"26","month":"09","year":"2003","remarks":""},{"money":"266,606","country":"Spain","day":"06","month":"04","year":"2003","remarks":""},{"money":"150,696","country":"Spain","day":"30","month":"03","year":"2003","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"05","month":"03","year":"2001","remarks":null},{"money":null,"country":null,"day":"16","month":"06","year":"2001","remarks":null}],"copyrightHolder":"Paramount Pictures Corporation"},"technical":{"runtime":["1 hr 34 min (94 min)"],"soundMix":["DTS","Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Consolidated Film Industries (CFI), Hollywood (CA), USA (answer print)","DeLuxe, Hollywood (CA), USA (dailies)"],"filmLength":["2,590 m (Sweden)"],"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Digital Intermediate (2K) (master format) (some scenes)","Spherical (source format)"],"printedFilmFormat":["35 mm (Kodak Vision 2383)"]},"rating":"6.0","metascore":"40","filmingLocations":[{"location":"Blue Heron Paper Company - 419 Main Street, Oregon City, Oregon, USA"}],"rated":"R","awards":[{"award":"Golden Trailer Awards 2003","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Best Horror/Thriller","names":[]},{"category":"Best Action","names":[]}]}]}],"votes":"37,101","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005323","name":"Lakeshore Entertainment"},{"idCompany":"co0049706","name":"Alphaville Films"}],"keywords":{"keywords":["special forces","hunter","fbi","capture","combat","oregon","hunting","vomiting","manhunt","blood splatter","british columbia","bar","handcuffs","older man younger man relationship","military uniform","subtitled scene","massacre","sniper","u.s. army","honor","gore","violence","bloody spray","flashback","knife","basic training","snow","dart gun","commando","haunted by the past","nightmare","showdown","escape","one man army","mutilation","long knife","stabbed in the stomach","duel","swimming","war buddy","f word","shot in the head","karate","fistfight","brawl","gunfight","shootout","pistol","sniper rifle","tough guy","hand to hand combat","suspense","yugoslavian army","sole black character dies cliche","sewer","serial killer","postcard","obscene finger gesture","naturist","mass grave","martial arts","machine gun","hood","fugitive","ex soldier","ethnic cleansing","cat","bicycle","biblical quote","war veteran","survivalist","skate park","post traumatic stress disorder","pacific northwest","ex boyfriend ex girlfriend relationship","arrowhead","2000s","1990s","strangulation","stabbed in the leg","stabbed in the face","stabbed in the chest","stabbed in the arm","throat slitting","shot to death","shot in the back","severed leg","severed foot","severed arm","jumping off a bridge","impalement","death","corpse","car chase","stabbed in the throat","shot in the forehead","blood","rogue soldier","bridge","police officer killed","knife throwing","animal trap","tracking","light rail train","kosovo","forest","utility tunnel","helicopter","river","swat team","fountain","car accident","balkan","yugoslavia","portland oregon","murder","police chase","waterfall","knife fight","stabbing","wolf","auto theft","booby trap","chase","dismemberment","cabin","falling from height","military training","death of friend"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:42:34"}}