{"data":{"movies":[{"title":"If These Walls Could Talk 2","originalTitle":"","year":"2000","releaseDate":"20000305","directors":[{"name":"Jane Anderson","id":"nm0026862"},{"name":"Martha Coolidge","id":"nm0004838"}],"writers":[{"name":"Jane Anderson","id":"nm0026862"},{"name":"Sylvia Sichel","id":"nm0796359"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4MjcyMjE1M15BMl5BanBnXkFtZTcwMjMzNTcxMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Romance"],"plot":"Semi-follow up of the first \"If These Walls Could Talk\" with three segments set in the same house, but with different occupants which spans nearly 40 years. While the first film delt with women and the topic of abortion, this deals with women and the topic of lesbianism.","simplePlot":"Trio of stories about lesbian couples in three different decades.","actors":[{"actorName":"Vanessa Redgrave","urlProfile":"http://www.imdb.com/name/nm0000603","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MjE0OTgzNF5BMl5BanBnXkFtZTcwOTQ3ODMwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 January 1937","placeOfBirth":" Greenwich, London, England, UK","height":"5' 11\" (1.81 m)","bio":"On January 30, 1937, renowned theatre actor Michael Redgrave was performing in a production of Hamlet in London. During the curtain call, the show's lead, Laurence Olivier, announced to the audience: \"tonight a great actress was born\". This was in reference to his co-star's newborn daughter, Vanessa Redgrave. Vanessa was born in Greenwich, London, to Michael Redgrave and Rachel Kempson, both thespians. Three quarters of a century after her birth (despite numerous ups and down) this rather forward expectation has definitely been lived up to with an acclaimed actress that has won (among many others) an Academy Award, two Emmys, two Golden Globes, two Cannes Best Actress awards, a Tony, a Screen Actors Guild award, a Laurence Olivier theatre award and a BAFTA fellowship. Growing up with such celebrated theatrical parents, great expectations were put on both herself, her brother Corin Redgrave and sister Lynn Redgrave at an early age. Shooting up early and finally reaching a height just short of 6 foot, Redgrave initially had plans to dance and perform ballet as a profession. However she settled on acting and entered the Central School of Speech and Drama in 1954 and four years later made her West End debut. In the decade of the 1960s she developed and progressed to become one of the most noted young stars of the English stage and then film. Performances on the London stage included the classics: 'A Touch of Sun', 'Coriolanus', 'A Midsummer's Night Dream', 'All's Well that Ends Well', 'As You Like It', 'The Lady from the Sea', 'The Seagull' and many others. By the mid 1960s, she had booked various film roles and matured into a striking beauty with a slim, tall frame and attractive face. In 1966 she made her big screen debut as the beautiful ex-wife of a madman in an Oscar nominated performance in the oddball comedy Morgan! (1966), as well as the enigmatic woman in a public park in desperate need of a photographer's negatives in the iconic Blow-Up (1966) and briefly appeared in an unspoken part of Anne Boleyn in the Best Picture winner of the year A Man for All Seasons (1966). She managed to originate the title role in \"The Prime of Miss Jean Brodie\" the same year on the London stage (which was then adapted for the big screen a few years later, but Maggie Smith was cast instead and managed to win an Oscar for her performance). Her follow up work saw her play the lead in the box office hit adaptation Camelot (1967), a film popular with audiences but dismissed by critics, and her second Academy Award nominated performance as Isadora Duncan in the critically praised Isadora (1968). Her rise in popularity on film also coincided with her public political involvement, she was one of the lead faces in protesting against the Vietnam war and lead a famous march on the US embassy, was arrested during a Ban-the-Bomb demonstration, publicly supported Yasar Arafat's Palestine Liberation Organization (PLO) and fought for various other human rights and particularly left wing causes. Despite her admirably independent qualities, most of her political beliefs weren't largely supported by the public. In 1971 after 3 films back to back, Redgrave suffered a miscarriage (it would have been her fourth, after Natasha Richardson, Joely Richardson and Carlo Gabriel Nero) and a break up with her then partner and father of her son, Franco Nero. This was around the same time her equally political brother Corin introduced her to the Workers Revolutionary Party, a group who aimed to destroy capitalism and abolish the monarchy. Her film career began to suffer and take the back seat as she became more involved with the party, twice unsuccessfully attempting to run as a party member for parliament, only obtaining a very small percentage of votes. In terms of her film career at the time, she was given probably the smallest part in the huge ensemble who-dunnit hit, Murder on the Orient Express (1974) and given another thankless small part as Lola Deveraux in the Sherlock Holmes adventure The Seven-Per-Cent Solution (1976). After a celebrated Broadway debut, she created further controversy in 1977 with her involvement in two films, firstly in Julia (1977) where she acted opposite Jane Fonda as a woman fighting Nazi oppression and narrated and featured in the documentary The Palestinian (1977) where she famously danced holding a Kalashnikov rifle. She publicly stated her condemnation of what she termed \"Zionist hudlums\", which outraged Jewish groups and as a result a screening of her documentary was bombed and Redgrave was personally threatened by the Jewish Defense League (JDL). Julia (1977) happened to be a huge critical success and Redgrave herself was nominated for a Best Supporting Actress Oscar, but Jewish support groups demanded her nomination to be dropped and at the event of the Academy Awards burned effigies of Redgrave and protested and picketed. Redgrave was forced to enter the event via a rear entrance to avoid harm and when she won the award she famously remarked on the frenzy causes as \"Zionist hoodlums\" which caused the audience to audibly gasp and boo. The speech reached newspapers the next morning and her reputation was further damaged. It came as a surprise when CBS hired her for the part of real life Nazi camp survivor Fania Fenelon in Playing for Time (1980), despite more controversy and protesting (Fenelon herself didn't even want Redgrave to portray her) she won an Emmy for the part and the film was one of the highest rating programs of the year. Her follow up film work to her Oscar had been mostly low key but successful, performances in films such as Yanks (1979), Agatha (1979), The Bostonians (1984), Wetherby (1985) and Prick Up Your Ears (1987) further cemented her reputation as a fine actress and she received various accolades and nominations. However mainly in the 1980s, she focused on TV films and high budget mini-series as well as theatre in both London and New York. She made headlines in 1984 when she sued the Boston Symphony Orchestra for $5 million for wrongful cancellation of her contract because of her politics (she also stated her salary was significantly reduced in Agatha (1979) for the same reason). She became more mainstream in the 1990s where she appeared in a string of high profile films but the parts often underused Redgrave's abilities or they were small cameos/5-minute parts. Highlights included Howards End (1992), Little Odessa (1994), Mission: Impossible (1996) and Cradle Will Rock (1999), as well as her leading lady parts in A Month by the Lake (1995) and Mrs Dalloway (1997). In 2003 she finally won the coveted Tony award for her performance in 'The Long Day's Journey Into Night' and followed up with another two Tony nominated performances on Broadway, her one woman show 'The Year of Magical Thinking' in 2007 and 'Driving Miss Daisy' in 2010 which not only was extended due to high demand, but was also transferred to the West End for an additional three months in 2011. Vanessa continues to lend her name to causes and has been notable for donating huge amounts of her own money for her various beliefs. She has publicly opposed the war in Iraq, campaigned for the closure of Guantanamo Bay, supported the rights of gays and lesbians as well as AIDs research and many other issues. She released her autobiography in 1993 and a few years later she was elected to serve as a UNICEF Goodwill Ambassador. She also famously declined the invitation to be made a Dame for her services as an actress. Many have wondered the possible heights her career could have reached if it wasn't for her outspoken views, but being a celebrity and the artificial lifestyle usually attached doesn't seem to interest Redgrave in the slightest. Vanessa has worked with all three of her children professionally on numerous occasions (her eldest daughter, Natasha Richardson tragically died at the age of 45 due to a skiing accident) and in her mid 70s she still works regularly on television, film and theatre, delivering time and time again great performances.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MjE0OTgzNF5BMl5BanBnXkFtZTcwOTQ3ODMwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000603","name":"Vanessa Redgrave","idIMDB":"nm0000603"},"actorId":"nm0000603","character":"Edith Tree","urlCharacter":"http://www.imdb.com/character/ch0511567","main":true},{"actorName":"Marian Seldes","urlProfile":"http://www.imdb.com/name/nm0783033","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MjE4MDI5NF5BMl5BanBnXkFtZTYwMzk0Nzcy._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 August 1928","placeOfBirth":" New York City, New York, USA","birthName":"Marian Hall Seldes","height":"5' 9\" (1.75 m)","bio":"Tony Award-winner Marian Hall Seldes, one of the premier stage actresses in America, was born on August 23, 1928 in Manhattan, New York, to writer and journalist Gilbert Seldes, and his socialite wife, the former Alice Wadhams Hall. Her paternal grandparents were Russian Jewish immigrants, and her mother was from an Episcopalian family with deep roots in the United States. Marian studied drama at the Neighborhood Playhouse with Sanford Meisner and dance with Martha Graham. She honed her craft with the legendary Broadway diva, Katharine Cornell, with whom she appeared in the play, \"That Lady\", in the 1949-50 season. Seldes, herself, taught acting at The Juilliard School from 1967 to 1991 and at Fordham University's Lincoln Center campus since 2002. Her students include Oscar-winners William Hurt, Kevin Kline and Robin Williams, Emmy Award-winners Kelsey Grammer and Laura Linney, and Tony Award-winner Patti LuPone. She made her Broadway debut, in 1948, in Robinson Jeffers' adaptation of \"Medea\", with acting great Judith Anderson giving a legendary performance as Euripides' scorned heroine in a production directed by John Gielgud, who also played \"Jason\". It began a career that lasted 59 years: She last appeared on Broadway in 2007 in Terrence McNally's \"Deuce\". Along the way, she was nominated for a Tony Award five times, winning on her first nod for Edward Albee's A Delicate Balance (1973). Seldes has long been associated with Albee, appearing in three of his plays, starting with \"Tiny Alice\" in 1962. (Albee's Pulitzer Prize-winning \"Three Tall Women\", which starred Seldes, did not play the Great White Way but appeared off-Broadway.) Seldes also has had an extensive career in movies, television and radio, playing everything from Emily Brontë in the 1952 TV movie, Our Sister Emily (1952), to Lucas McCain's dead wife in The Rifleman (1958) episode, The Rifleman: The Vision (1960) in 1960, to First Lady Eleanor Roosevelt in Truman (1995) to Mr. Big's mother on Sex and the City (1998). She also has done extensive work as a radio actress, appearing on the CBS Radio Mystery Theater, from 1974 to 1982. Her first marriage to Julian Claman, by whom she had a daughter, ended in divorce in 1961. She was married to screenwriter Garson Kanin from 1990 until his death in 1999. In 2010, Marian Seldes received a Tony Lifetime Achievement Award for her great career in the theater as befits her reputation as one of America's greatest stage performers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MjE4MDI5NF5BMl5BanBnXkFtZTYwMzk0Nzcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0783033","name":"Marian Seldes","idIMDB":"nm0783033"},"actorId":"nm0783033","character":"Abby Hedley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Giamatti","urlProfile":"http://www.imdb.com/name/nm0316079","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc0MDAzMTU4N15BMl5BanBnXkFtZTcwNzA0NzcwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 June 1967","placeOfBirth":" New Haven, Connecticut, USA","birthName":"Paul Edward Valentine Giamatti","height":"5' 9\" (1.75 m)","bio":"Paul Giamatti is an American actor who has worked steadily and prominently for over twenty years, and is best known for leading roles in the films American Splendor (2003), Sideways (2004), and Le monde de Barney (2010) (for which he won a Golden Globe), and supporting roles in the films Cinderella Man (2005), The Illusionist (2006), and San Andreas (2015). Paul Edward Valentine Giamatti was born June 6, 1967 in New Haven, Connecticut, and is the youngest of three children. His mother, the former Toni Marilyn Smith, was an actress before marrying. His father, Bart Giamatti (Angelo Bartlett Giamatti), was a professor of Renaissance Literature at Yale University, and went on to become the university's youngest president (in 1986, Bart was appointed president of baseball's National League. He became Commissioner of Baseball on April 1, 1989 and served for five months until his untimely death on September 1, 1989. He was commissioner at the time Pete Rose was banned from the game). Paul's father also wrote six books. Paul's older brother, Marcus Giamatti, is also an actor. His sister, Elena, designs jewelry. His ancestry is Italian (from his paternal grandfather), German, English, Dutch, Scottish, and Irish. Paul graduated from Choate Rosemary Hall prep school, majored in English at Yale, and obtained his Master's Degree in Fine Arts, with his major in drama from the Yale University School of Drama. His acting roots are in theatre, from his college days at Yale, to regional productions (Seattle, San Diego and Williamstown, Massachusetts), to Broadway.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc0MDAzMTU4N15BMl5BanBnXkFtZTcwNzA0NzcwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0316079","name":"Paul Giamatti","idIMDB":"nm0316079"},"actorId":"nm0316079","character":"Ted Hedley","urlCharacter":"http://www.imdb.com/character/ch0345492","main":true},{"actorName":"Elizabeth Perkins","urlProfile":"http://www.imdb.com/name/nm0001610","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MjQ3MDY5MF5BMl5BanBnXkFtZTcwMjI2MjgzNA@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1960","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Elizabeth Ann Perkins","height":"5' 8\" (1.73 m)","bio":"Elizabeth Ann Perkins was born on November 18, 1960, in the borough of Queens, New York, and was raised in Vermont. Her mother, Jo Williams, was a concert pianist and drug treatment counselor, and her father, James Perkins, was a businessman, farmer, and writer. She is of Greek and English descent. Perkins studied acting at Chicago's Goodman School of Drama at DePaul University for three years, then launched her professional career with a co-starring gig in the touring company of Neil Simon's Brighton Beach Memoirs (1986). Seasoned, she returned to New York in the spring of 1984 to make her Broadway debut as a replacement in the Simon play. As a stage actress, she has trod the boards with Playwrights Horizon, the Ensemble Studio, The New York Shakespeare Festival, and, back in Chcago, with the Steppenwolf Theater. She found time out to marry the Chicago actor Terry Kinney. Her first major film role was in the underwhelming screen adaptation of David Mamet's \"Sexual Perversity in Chicago,\" which was turned into a Rob Lowe/Demi Moore star vehicle retitled About Last Night... (1986). Perkins sparkled as the grown woman interested in Tom Hanks in Big (1988), but her career was spotty and she never gained the traction to bring her the stardom that seemed to be within her grasp. In 1991, Perkins starred with Kevin Bacon in He Said, She Said (1991) (thus giving her a Bacon Factor of exactly 1) but, sadly, for such a talented actress, her biggest box-office hit has proven to be The Flintstones (1994), in which she portrayed Wilma. Perkins made her television debut in For Their Own Good (1993), a 1993 TV movie based on the true story of a woman who underwent mandatory sterilization to work in a chemical plant. She starred in the NBC comedy series Battery Park (2000) produced by Gary David Goldberg (who recently directed her in Must Love Dogs (2005) in a supporting role to her good friend Diane Lane), and HBO's If These Walls Could Talk 2 (2000). Her other TV work includes Babilônia 2000 (1999), Rescuers: Stories of Courage: Two Women (1997), and From the Earth to the Moon (1998) in an episode directed by Sally Field. Perkins divorced Kinney and now is married to the cinematographer Julio Macat. Recently, she starred in John Patrick Shanley's black comedy \"Four Dogs and a Bone\" at Los Angeles' Geffen Playhouse. She also has a starring role in the series Weeds (2005) for Showtime. Her talent, personality, and good looks keep her steadily employed, and it wouldn't be surprising if now, on the other side of 40, she makes a breakthrough and does some major work commensurate with her early promise.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MjQ3MDY5MF5BMl5BanBnXkFtZTcwMjI2MjgzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001610","name":"Elizabeth Perkins","idIMDB":"nm0001610"},"actorId":"nm0001610","character":"Alice Hedley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jenny O'Hara","urlProfile":"http://www.imdb.com/name/nm0641266","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNjU2MzA0NV5BMl5BanBnXkFtZTcwNjEyNDc0NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1942","placeOfBirth":" Sonora, California, USA","birthName":"Patricia Joanne O'Hara","bio":"Jenny O'Hara was born on February 24, 1942 in Sonora, California, USA as Patricia Joanne O'Hara. She is an actress and director, known for Mystic River (2003), Devil (2010) and Matchstick Men (2003). She has been married to Nick Ullett since July 20, 1986. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNjU2MzA0NV5BMl5BanBnXkFtZTcwNjEyNDc0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0641266","name":"Jenny O'Hara","idIMDB":"nm0641266"},"actorId":"nm0641266","character":"Marge Carpenter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marley McClean","urlProfile":"http://www.imdb.com/name/nm0565703","urlPhoto":"","biography":{"dateOfBirth":"30 March 1987","placeOfBirth":" Calabasas, California, USA","birthName":"Marley Sarah Lynn McClean","bio":"Marley McClean was born on March 30, 1987 in Calabasas, California, USA as Marley Sarah Lynn McClean. She is an actress, known for Serenity (2005), If These Walls Could Talk 2 (2000) and Slums of Beverly Hills (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0565703","name":"Marley McClean","idIMDB":"nm0565703"},"actorId":"nm0565703","character":"Maggie Hedley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Donald Elson","urlProfile":"http://www.imdb.com/name/nm0255703","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2NTUwNzQwMV5BMl5BanBnXkFtZTYwNzQ5Nzky._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 March 1923","placeOfBirth":" Chicago, Illinois, USA","height":"6' 1\" (1.85 m)","bio":"Donald Elson was raised in the Los Angeles suburb of Inglewood, just a \"whoop and a holler\" from Hollywood. He was a young college student at the outbreak of WWII. After serving in the Air Force, he attended the Columbia Radio School of Broadcasting on the GI Bill and pursued a career as a radio announcer at stations in Texas and Oklahoma before returning to college. He graduated from the University of Southern California with a BA degree in Theatre Arts in 1949 and headed to New York. Elson became a successful Broadway actor, appearing in \"Inherit The Wind,\" \"Desire Under the Elms,\" \"Peter Pan,\" \"Threepenny Opera\" and numerous off-Broadway productions. He returned to Hollywood in the early 1960s, \"saddling up\" in a string of Film and TV Westerns. His skill and craftsmanship have enabled him to portray a wide variety of characters. Why is that craggy face so \"gol'durn\" familiar? Because we've seen it a thousand times in movies, television series, anthologies and Movies of the Week as well as countless television commercials.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2NTUwNzQwMV5BMl5BanBnXkFtZTYwNzQ5Nzky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0255703","name":"Donald Elson","idIMDB":"nm0255703"},"actorId":"nm0255703","character":"Sam","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Susan Mosher","urlProfile":"http://www.imdb.com/name/nm0608680","urlPhoto":"","biography":{"bio":"Susan Mosher is an actress and writer, known for Un mariage trop parfait (2001), If These Walls Could Talk 2 (2000) and View from the Top (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0608680","name":"Susan Mosher","idIMDB":"nm0608680"},"actorId":"nm0608680","character":"Nurse June","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lisa Welti","urlProfile":"http://www.imdb.com/name/nm0920649","urlPhoto":"","biography":{"dateOfBirth":"16 September 1965","placeOfBirth":" Inglewood, California, USA","birthName":"Lisa Kim Welti","bio":"Lisa Welti was born on September 16, 1965 in Inglewood, California, USA as Lisa Kim Welti. She is an actress, known for Stuck (2008), If These Walls Could Talk 2 (2000) and Don't Sleep Alone (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0920649","name":"Lisa Welti","idIMDB":"nm0920649"},"actorId":"nm0920649","character":"Nurse Trish","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jill Brennan","urlProfile":"http://www.imdb.com/name/nm0107314","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MzEwMDMzMV5BMl5BanBnXkFtZTcwMzI5MjEzMg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Jill Brennan is an actress and producer, known for If These Walls Could Talk 2 (2000), When Billie Beat Bobby (2001) and Boston Legal (2004). She has been married to Jim Lincoln since June 15, 2002.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MzEwMDMzMV5BMl5BanBnXkFtZTcwMzI5MjEzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0107314","name":"Jill Brennan","idIMDB":"nm0107314"},"actorId":"nm0107314","character":"Nurse Betty","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"C.J. Bates","urlProfile":"http://www.imdb.com/name/nm0060867","urlPhoto":"","biography":{"bio":"C.J. Bates is an actress, known for If These Walls Could Talk 2 (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0060867","name":"C.J. Bates","idIMDB":"nm0060867"},"actorId":"nm0060867","character":"Nurse Murphy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michelle Williams","urlProfile":"http://www.imdb.com/name/nm0931329","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNTQ2NTk3MV5BMl5BanBnXkFtZTcwNjExNDQzNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1980","placeOfBirth":" Kalispell, Montana, USA","birthName":"Michelle Ingrid Williams","height":"5' 4\" (1.63 m)","bio":"A small-town girl born and raised in rural Kalispell, Montana, Michelle Ingrid Williams is the daughter of Carla Ingrid (Swenson), a homemaker, and Larry Richard Williams, a commodity trader and author. Her ancestry is Norwegian, as well as German, British Isles, and other Scandinavian. She was first known as bad girl Jen Lindley in the television series Dawson's Creek (1998). She appeared in the comedy film Dick - Les coulisses de la présidence (1999), which was a parody of the Watergate Scandal along with Kirsten Dunst, as well as Prozac Nation (2001) with Christina Ricci. Since then, Michelle has worked her way into the world of independent films such as The Station Agent (2003), Imaginary Heroes (2004), and The Baxter (2005). But her real success happened in 2005 when she starred in Ang Lee's Brokeback Mountain (2005) as Alma Beers Del Mar. A woman who realizes her husband is in love with another man. Her talent shown in Brokeback Mountain (2005) landed her an Academy Award nomination for Best Supporting Actress. In 2011, she received her first lead role Academy Award nomination for Blue Valentine (2010). She followed this in 2012 with a lead role Academy Award nomination for My Week with Marilyn (2011). Michelle has a daughter, Matilda, with late Australian actor Heath Ledger.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNTQ2NTk3MV5BMl5BanBnXkFtZTcwNjExNDQzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0931329","name":"Michelle Williams","idIMDB":"nm0931329"},"actorId":"nm0931329","character":"Linda","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chloë Sevigny","urlProfile":"http://www.imdb.com/name/nm0001721","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3ODUwMTc1NDFeQTJeQWpwZ15BbWU4MDk1MjE2Nzkx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1974","placeOfBirth":" Springfield, Massachusetts, USA","birthName":"Chloë Stevens Sevigny","height":"5' 8\" (1.73 m)","bio":"Known in the mid to late nineties for her status as a fashion impresario and \"it girl,\" with over a dozen art house films to her credit, Chloe Sevigny also stands out as one of the most prominent queens of contemporary independent cinema. Originally hailing from Darien, Connecticut, Sevigny attributes weekend trips into nearby New York City in her teens as an important early saving grace from her super rich and stuffy hometown. It was on one such trip at the age of eighteen, that Sevigny was spotted on the street by a fashion editor for Sassy magazine. Impressed by her flair for street fashion, the editors of the progressive teen mag asked Sevigny to intern in their offices which led to a few modeling jobs with both Sassy and x-girl, the urban clothing line created by Sonic Youth front woman Kim Gordon. At this time Sevigny also spent a lot of her time watching the skateboarders who convened in New York's Tompkins square park. It was here that she met young aspiring director Harmony Korine, and a friendship ensued, resulting in her being cast as the lead in Korine and Larry Clark's collaboration Kids (1995). At around the same time Sevigny snagged the cover of Interview magazine, and even inspired writer Jay McInerney to write a piece about her for The New Yorker in which he hailed her the new \"it girl.\" The late nineties saw Sevigny continuing her acting career with a string of independent films, among them Trees Lounge (1996), Palmetto (1998), and Whit Stillman's homage to early 80s yuppiedom The Last Days of Disco (1998). In 1997 Sevigny and Korine teamed up again to make Gummo (1997), in which Sevigny both starred and acted as chief costume designer. It was in 2000 however that Sevigny's career made a turn towards more mainstream recognition when her portrayal of Lana Tisdel in Boys Don't Cry (1999) garnered her an Oscar nod at the age of twenty-five. Known for signing on to projects based on her interest in a good script rather than a hefty price tag, one of Sevigny's most recent roles, making the climb from indie princess to A list actress, should see her surprising both audiences and Hollywood alike with roles in interesting and thoughtful projects.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3ODUwMTc1NDFeQTJeQWpwZ15BbWU4MDk1MjE2Nzkx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001721","name":"Chloë Sevigny","idIMDB":"nm0001721"},"actorId":"nm0001721","character":"Amy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nia Long","urlProfile":"http://www.imdb.com/name/nm0000505","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE0NjM4NDY3Ml5BMl5BanBnXkFtZTgwODI5Njg5MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 October 1970","placeOfBirth":" Brooklyn, New York, USA","birthName":"Nitara Carlynn Long","height":"5' 2\" (1.57 m)","bio":"Stunning pop culture icon, Hollywood leading lady and three-time NAACP award winner Nia Long returns to the big screen this fall in the highly anticipated Universal Pictures sequel The best man holiday (in theaters November 15th) where she reunites with original castmates Taye Diggs (\"Private Practice\"), Terrence Howard (Hustle & flow), Morris Chestnut (The brothers) and Harold Perrineau (\"Lost\"). Additionally in Spring 2014, Long will star in Tyler Perry's Single mom's club alongside Wendi McLendon- Covey (Bridesmaids), Tyler Perry (Madea) and Amy Smart (Crank). Early this year, Long joined the all-star cast of Showtime's \"House of Lies\" alongside Golden Globe Award winner Don Cheadle & Kristen Bell as \"Tamara,\" a business school classmate and former flame of Marty's (Don Cheadle) who has been hired by the same consulting firm Galweather Stearn after taking time off to raise a family. Long made her film debut in the poignant film portraying the social problems in inner-city Los Angeles, Boyz n the hood , and continued on to star in FRIDAY alongside Ice Cube and Chris Tucker as well as LOVE JONES which won the prestigious Audience Award at Sundance. Other notable film roles include Soul Food, Alfie opposite Jude Law, The Best man, Are We There Yet?, Big Momma's House 1 & 2 opposite Martin Lawrence, Stigmata, the Broken Hearts Club and Made in America. On the small screen, Long's portrayal of \"Officer Sasha Monroe\" on NBC's hit crime drama \"Third Watch\" awarded her two NAACP Image Awards for Outstanding Actress in a Drama series. Long's other TV accomplishments include \"The Fresh Prince of Bel-Air,\" \"Boston Legal,\" \"Judging Amy,\" and \"Big Shots.\" Long also voiced \"Roberta\" in the first season of the Fox hit \"the Cleveland Show.\" Making her directorial debut on Ashanti's music video \"Baby\" and Yolanda Adam's \"This Too Shall Pass,\" Nia continues her work behind the camera and is developing a feature film that centers on renowned world champion boxer and trainer Ann Wolfe. In addition to her film and TV work, Long's passion lies in serving her community. With her family roots planted in Trinidad, Grenada, and Barbados, Long's long term goals are to connect women in the US to those of the islands and to mentor young girls to regain their self-esteem. Additionally, Long lends her support to Black Girls Rock, an organization that promotes the arts for young women of color and encourages dialogue on the ways women of color are portrayed in the media. In 2012 she was named an official surrogate to the Barack Obama reelection campaign. A Brooklyn native, Long now calls Los Angeles home where she lives with her 12 year old son, Massai, 14 month old son, Kez and partner Ime Udoka, an Assistant Coach for the San Antonio Spurs. Long loves to cook organic farmer's market fresh meals adding a twist of her Trinidadian heritage. When she's not juggling between her career and motherhood, she enjoys staying active by doing pilates, boxing, hiking, and horseback riding. Long also finds pleasure in traveling and experiencing different cultures throughout the world. One of her favorite locations to visit is Jamaica, a place she calls her second home where she can reflect and refuel.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE0NjM4NDY3Ml5BMl5BanBnXkFtZTgwODI5Njg5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000505","name":"Nia Long","nicknames":["Nia"],"idIMDB":"nm0000505"},"actorId":"nm0000505","character":"Karen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Natasha Lyonne","urlProfile":"http://www.imdb.com/name/nm0005169","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyMzc2MTE2MzheQTJeQWpwZ15BbWU4MDUwNTY0ODYx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1979","placeOfBirth":" New York City, New York, USA","height":"5' 3½\" (1.61 m)","bio":"Natasha Lyonne is an American stage, film, and television actress. As a young child, she was signed by the Ford Modeling Agency and, at the age of six, was cast as a role in Pee-Wee's Playhouse. Natasha remained busy with appearances in almost 30 films over the next 10 years, including some starring roles in independent films. Lyonne is perhaps best-known for her roles in the \"American Pie\" films as the wise-cracking \"Jessica\". After a hiatus in 2008, due to well-documented health and legal struggles, Lyonne returned to work, As a young child, she was signed by the Ford Modeling Agency and, at the age of six, she was cast as \"Opal\" on Pee-wee's Playhouse (1986), which was quickly followed by film appearances in Heartburn (1986), written by Nora Ephron, directed by Mike Nichols; A Man Called Sarge (1990); and Dennis the Menace (1993), with Walter Matthau and Christopher Lloyd. At the age of 16, Woody Allen cast her as his and Goldie Hawn's daughter in Everyone Says I Love You (1996), alongside Julia Roberts, Edward Norton, Natalie Portman, which led to appearances in almost 30 films over the next 10 years, including starring roles in the independent films Slums of Beverly Hills (1998) and But I'm a Cheerleader (1999). Lyonne's other films included Detroit Rock City (1999); Scary Movie 2 (2001); The Grey Zone (2001), directed by Tim Blake Nelson; James Mangold's Kate & Leopold (2001); Party Monster (2003); Die, Mommie, Die! (2003) and Blade: Trinity (2004), as well as TV appearances on shows including NBC's Will & Grace (1998). Lyonne is perhaps best-known for her roles in the \"American Pie\" films as the wise-cracking \"Jessica\". After a short hiatus in 2008, due to well-documented health and legal struggles, Lyonne returned to work, making her New York stage debut in the award-winning New Group production of Mike Leigh's \"Two Thousand Years\" and in the films The Immaculate Conception of Little Dizzle (2009) and Goyband (2008). Since then, Lyonne has steadily worked in the New York theatre scene, in film and on television. Films include All About Evil (2010) with Thomas Dekker; Abel Ferrara's 4:44 Last Day on Earth (2011) with Willem Dafoe; and upcoming projects Girl Most Likely (2012) (aka \"Imogene\") with Kristen Wiig, Darren Criss, Matt Dillon and Annette Bening; The Rambler (2013) with Dermot Mulroney; Clutter (2013) with Carol Kane and Kathy Najimy; He's Way More Famous Than You (2013), written by Halley Feiffer and directed by Michael Urie, with Ben Stiller and Jesse Eisenberg. TV appearances include the hit series, New Girl (2011) and Law & Order: Special Victims Unit (1999). On stage, she was in the original cast of Nora Ephron and Delia Ephron's award-winning \"Love, Loss, and What I Wore\" with Samantha Bee, Tyne Daly, Katie Finneran and Rosie O'Donnell and in the original cast in Los Angeles at Geffen Playhouse with Tracee Ellis Ross, Carol Kane and Rita Wilson. She received rave reviews in Kim Rosenstock's \"Tigers Be Still\", directed by Sam Gold, with Reed Birney, Halley Feiffer, John Magaro at the Roundabout Theatre Company and returned this past season to the New Group stage with Ethan Hawke, Gordon Clapp and Daphne Rubin-Vega in Tommy Nohilly's \"Blood From a Stone\". Most recently, she participated in New Group's benefit performance of \"Women Behind Bars\", with Charles Busch, Josh Hamilton, Cynthia Nixon, Rhea Perlman and Rosie O'Donnell. Natasha was born Natasha Bianca Lyonne Braunstein in New York City, New York, to Ivette (Buchinger) and Aaron Braunstein, who is a talk radio host, boxing promoter, and race car driver. She is from a Jewish family. Her maternal grandparents, originally from Hungary, were Holocaust survivors who moved to Paris, France, where Natasha's mother was born.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyMzc2MTE2MzheQTJeQWpwZ15BbWU4MDUwNTY0ODYx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005169","name":"Natasha Lyonne","idIMDB":"nm0005169"},"actorId":"nm0005169","character":"Jeanne","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0206036","urlIMDB":"http://www.imdb.com/title/tt0206036","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 36 min (96 min)"],"soundMix":["Dolby"],"color":["Black and White (archive footage)","Color"],"aspectRatio":["1.33 : 1","1.85 : 1 (intended ratio)"],"camera":null,"laboratory":["FotoKem Laboratory, Burbank (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"7.1","filmingLocations":[{"location":"1972 Canyon Drive, Hollywood, Los Angeles, California, USA"}],"rated":"R","awards":[{"award":"Golden Globes, USA 2001","titlesAwards":[{"titleAwardOutcome":"Won Golden Globe","categories":[{"category":"Best Performance by an Actress in a Supporting Role in a Series, Miniseries or Motion Picture Made for Television","names":[{"name":"Vanessa Redgrave","id":"nm0000603","role":null}]}]}]},{"award":"Primetime Emmy Awards 2000","titlesAwards":[{"titleAwardOutcome":"Won Primetime Emmy","categories":[{"category":"Outstanding Supporting Actress in a Miniseries or a Movie","names":[{"name":"Vanessa Redgrave","id":"nm0000603","role":null}]}]},{"titleAwardOutcome":"Nominated Primetime Emmy","categories":[{"category":"Outstanding Casting for a Miniseries, Movie or a Special","names":[{"name":"John Papsidera","id":"nm0660667","role":"casting executive"}]},{"category":"Outstanding Made for Television Movie","names":[{"name":"Suzanne Todd","id":"nm0865297","role":"executive producer"},{"name":"Jennifer Todd","id":"nm0865189","role":"executive producer"},{"name":"Ellen DeGeneres","id":"nm0001122","role":"executive producer"},{"name":"Mary Kane","id":"nm0437391","role":null}]},{"category":"Outstanding Writing for a Miniseries or a Movie","names":[{"name":"Jane Anderson","id":"nm0026862","role":null}]}]}]},{"award":"Screen Actors Guild Awards 2001","titlesAwards":[{"titleAwardOutcome":"Won Actor","categories":[{"category":"Outstanding Performance by a Female Actor in a Television Movie or Miniseries","names":[{"name":"Vanessa Redgrave","id":"nm0000603","role":null}]}]}]},{"award":"Casting Society of America, USA 2000","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Best Casting for TV Movie of the Week","names":[{"name":"John Papsidera","id":"nm0660667","role":null}]}]}]},{"award":"Columbus International Film & Video Festival 2000","titlesAwards":[{"titleAwardOutcome":"Won Bronze Plaque Award","categories":[{"category":"Social Issues","names":[]}]}]},{"award":"Directors Guild of America, USA 2001","titlesAwards":[{"titleAwardOutcome":"Nominated DGA Award","categories":[{"category":"Outstanding Directorial Achievement in Movies for Television","names":[{"name":"Martha Coolidge","id":"nm0004838","role":null}]}]}]},{"award":"GLAAD Media Awards 2001","titlesAwards":[{"titleAwardOutcome":"Won GLAAD Media Award","categories":[{"category":"Outstanding TV Movie","names":[]}]}]},{"award":"Image Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated Image Award","categories":[{"category":"Outstanding Actress in a Television Movie, Mini-Series or Dramatic Special","names":[{"name":"Nia Long","id":"nm0000505","role":null}]}]}]},{"award":"L.A. Outfest 2001","titlesAwards":[{"titleAwardOutcome":"Won Screen Idol Award","categories":[{"category":"Female","names":[{"name":"Vanessa Redgrave","id":"nm0000603","role":null}]}]}]},{"award":"Online Film & Television Association 2000","titlesAwards":[{"titleAwardOutcome":"Nominated OFTA Television Award","categories":[{"category":"Best Supporting Actress in a Motion Picture or Miniseries","names":[{"name":"Vanessa Redgrave","id":"nm0000603","role":null}]}]}]},{"award":"Paris International Lesbian and Feminist Film Festival 2000","titlesAwards":[{"titleAwardOutcome":"Won Audience Award","categories":[{"category":"Best Film","names":[{"name":"Jane Anderson","id":"nm0026862","role":null},{"name":"Martha Coolidge","id":"nm0004838","role":null},{"name":"Anne Heche","id":"nm0000162","role":null}]}]}]},{"award":"PGA Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated PGA Award","categories":[{"category":"Outstanding Producer of Long-Form Television","names":[]}]}]},{"award":"Satellite Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Satellite Award","categories":[{"category":"Best Performance by an Actress in a Miniseries or a Motion Picture Made for Television","names":[{"name":"Vanessa Redgrave","id":"nm0000603","role":null}]}]}]}],"votes":"5,661","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0005861","name":"HBO Films"},{"idCompany":"co0050544","name":"Team Todd"}],"keywords":{"keywords":["lesbian","lesbian bar","college","feminism","lesbian couple","lesbianism","bar","feminist","dancing","women dancing together","listening to music","kiss","singing","marijuana","binding breasts","tomboy","lesbians wanting child","death of partner","lesbian interest","lesbian mother","female removes her clothes","bare breasts","loss of girlfriend","headstand","dance","bathroom","female nudity","pregnant lesbian","work out","sexual identity","scene during end credits","pot smoking","pajamas","movie theatre","little girl","lesbian sex","lesbian kiss","laptop","gynecologist","girlfriend girlfriend relationship","girl gang","female bartender","billiards","archive footage","lesbian parenthood","nudity","sperm bank","butch","stroke","hospital","college student","2000s","house","f rated","bartender","african american","gay parent","old woman","death of loved one","year 2000","title directed by female","trying to get pregnant","wanting to have children","watching a movie","bereavement","death","year 1972","year 1961","artificial insemination","old woman old woman relationship","memory","kitchen","neighbor","true love","taunting","talking to an animal","protest sign","pregnancy test","playground","photograph","nurse","nephew","motorcycle","medication","hippie","gynecological exam","grief","falling off a ladder","episodic structure","cigarette smoking","birdhouse","1970s","1960s","homoparentality","homosexual"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 21:41:51"}}