{"data":{"movies":[{"title":"A Walk to Remember","originalTitle":"","year":"2002","releaseDate":"20020125","directors":[{"name":"Adam Shankman","id":"nm0788202"}],"writers":[{"name":"Nicholas Sparks","id":"nm0817023"},{"name":"Karen Janszen","id":"nm0418321"}],"runtime":"101 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU3NTYxM2MtNjViMS00YmNlLWEwM2MtYWI2MzgzNTkxODFjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Romance"],"plot":"In Beaufort, North Carolina, a prank on a student goes terribly wrong and puts the student in the hospital. Landon Carter, a popular student with no defined plans for the future, is held responsible and forced to participate in after-school community service activities as punishment, which include starring as the lead in the school play. Also participating in these activities is Jamie Sullivan, the reverend's daughter who has great ambitions and nothing in common with Landon. When Landon decides he wants to take his activities seriously, he asks Jamie for help and begins to spend most of his time with her. But he starts to develop strong feelings for her, something he did not expect to do. The two start a relationship, much to the chagrin of Landon's old popular friends and Jamie's strict reverend father. But when a heart-breaking secret becomes known that puts their relationship to the test, it is then that Landon and Jamie realize the true meaning of love and fate.","simplePlot":"The story of two North Carolina teens, Landon Carter and Jamie Sullivan, who are thrown together after Landon gets into trouble and is made to do community service.","actors":[{"actorName":"Shane West","urlProfile":"http://www.imdb.com/name/nm0922342","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYzMzMxMjcxNF5BMl5BanBnXkFtZTcwMjE2MDg0OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1978","placeOfBirth":" Baton Rouge, Louisiana, USA","birthName":"Shannon Bruce Snaith","height":"6' (1.83 m)","bio":"Shane West was born Shannon Bruce Snaith in 1978 in Baton Rouge, Louisiana, the son of Leah (Launey), a lawyer, and Don Snaith, a drugstore owner. Shane began to pursue an acting career at the age of fifteen, gaining bit parts on various television shows, but it was not until 1999 when West appeared in ABC's Once and Again (1999) that he got his major breakthrough. Aside from catapulting to teen heart-throb status with the success of the show, West has made his mark on the screen within such films as Liberty Heights (1999) and Whatever It Takes (2000). He starred opposite Mandy Moore in the hit teen romance A Walk to Remember (2002), played Tom Sawyer in the action film The League of Extraordinary Gentlemen (2003), and then depicted the short life of musician Darby Crash in the biopic What We Do Is Secret (2007). From 2010 to 2013, he starred as Michael on the show \"Nikita\" (2010)_, and since 2014, has played John Alden on the show \"Salem\" (2014)_. Aside from acting, West continues the musical traditions of his family (his parents were both were musicians when he was young) with his band, Average Jo, for which he writes and plays guitar. Shane's father was born in Jamaica, of mostly English and Sephardi Jewish descent. Shane's mother is from a Cajun (French) family from Louisiana.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYzMzMxMjcxNF5BMl5BanBnXkFtZTcwMjE2MDg0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0922342","name":"Shane West","idIMDB":"nm0922342"},"actorId":"nm0922342","character":"Landon Carter","urlCharacter":"http://www.imdb.com/character/ch0012635","main":true},{"actorName":"Mandy Moore","urlProfile":"http://www.imdb.com/name/nm0601553","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NTEzNDgzOF5BMl5BanBnXkFtZTcwNTMwNjk4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1984","placeOfBirth":" Nashua, New Hampshire, USA","birthName":"Amanda Leigh Moore","height":"5' 10\" (1.78 m)","bio":"Amanda Leigh Moore was born in Nashua, New Hampshire, on April 10, 1984, to Stacy (Friedman), a former news reporter, and Don Moore, an airline pilot. During her childhood, her family moved to Orlando, Florida, where she was raised. She has Russian Jewish (from her maternal grandfather), English, and some Scottish and Irish, ancestry. After seeing the musical \"Oklahoma!\", she decided that she wanted to pursue a career in singing. As a child, she performed the National Anthem at several athletic events around her hometown of Orlando, Florida, and became known as the \"National Anthem girl\". At the ripe age of 14, while she was recording in a studio in Orlando, a Fed-Ex worker who happened to be passing through heard her and was interested in her talent. He happened to know someone at Sony as well. Moore worked on cutting a demo and shortly thereafter signed a record deal with Sony 550 Music. At 15, her first record \"So Real\" was released. Her first tour was with the Backstreet Boys. As her touring and recording schedule demanded more of her time, Moore withdrew from Bishop Moore Catholic High School in Orlando and opted for a tutor/correspondence. She has stated that her education is important to her and says that the fact that she wants to go to college motivates her to continue with her schooling. Though Moore's record sales were not up in the ranks of Britney Spears or Christina Aguilera, she has proved to be a formidable talent both in singing and in acting, and snagged an MTV Movie Award in June 2002 for her first feature film role in A Walk to Remember (2002). Her biggest dream, though, is to perform on Broadway someday.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NTEzNDgzOF5BMl5BanBnXkFtZTcwNTMwNjk4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0601553","name":"Mandy Moore","idIMDB":"nm0601553"},"actorId":"nm0601553","character":"Jamie Sullivan","urlCharacter":"http://www.imdb.com/character/ch0012634","main":true},{"actorName":"Peter Coyote","urlProfile":"http://www.imdb.com/name/nm0001075","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2NjYwOTczNF5BMl5BanBnXkFtZTgwMzA3MzgwMjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1941","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Rachmil Pinchus Ben Mosha Cohon","height":"6' 3\" (1.91 m)","bio":"Peter Coyote was born on October 10, 1941 in Manhattan, New York City, New York, USA as Rachmil Pinchus Ben Mosha Cohon. He is an actor, known for E.T. the Extra-Terrestrial (1982), A Walk to Remember (2002) and Sphere (1998). He was previously married to Stefanie Pleet and Marilyn McCann.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2NjYwOTczNF5BMl5BanBnXkFtZTgwMzA3MzgwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001075","name":"Peter Coyote","idIMDB":"nm0001075"},"actorId":"nm0001075","character":"Reverend Sullivan","urlCharacter":"http://www.imdb.com/character/ch0012637","main":true},{"actorName":"Daryl Hannah","urlProfile":"http://www.imdb.com/name/nm0000435","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MjUyMzMxOF5BMl5BanBnXkFtZTcwNjEzNjI5Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 December 1960","placeOfBirth":" Chicago, Illinois, USA","birthName":"Daryl Christine Hannah","height":"5' 10\" (1.78 m)","bio":"Daryl Christine Hannah was born and raised in Chicago, Illinois. She is the daughter of Susan Jeanne (Metzger), a schoolteacher and later a producer, and Donald Christian Hannah, who owned a tugboat/barge company. Her stepfather was music journalist/promoter Jerrold Wexler. Her siblings are Page Hannah, Don Hannah and Tanya Wexler. She has Norwegian, Scottish, Irish, English, and German ancestry. Daryl graduated from the University of Southern California School of Theatre. She practiced ballet with Maria Tallchief and studied drama at Chicago's Goodman Theatre. In her twenties, she played keyboard and sang backup for Jackson Browne. Hannah, a tall (5' 10\") blond beauty, with haunting blue-green eyes, was a natural for show biz. She started with small roles, such as a student in The Fury (1978) and as Kim Basinger's kid sister in Hard Country (1981). Daryl's breakout role was as the acrobatic, beautiful replicant punk android Pris in Blade Runner (1982); Pris was the vixen who wanted to live beyond her allotted years and risked the wrath of the title character. Showing her versatility, from there she portrayed a mermaid, Madison, who falls in love with Tom Hanks's character in Ron Howard's zany comedy Splash (1984), and a Cro-Magnon in The Clan of the Cave Bear (1986). Hannah played Roxanne in the eponymous Steve Martins contemporary take on the Cyrano de Bergerac story, and co-starred as Elle Driver in Quintin Tarantino's box office hit Kill Bill: Vol. 2 (2004). Hannah has been a consistent, strong supporter of independent cinema, both acting in and producing many films, starring in such indie films as John Sayles's Casa de los babys (2003) as well as his political satire Silver City (2004). She worked on several films with the revered Robert Altman, including The Gingerbread Man (1998), as well as several films with the Polish Brothers including Northfork (2003) and Jackpot (2001). Daryl starred in the experimental improvised Michael Radford film Dancing at the Blue Iguana (2000) and made As a filmmaker, Hannah wrote, directed, and produced an award winning short film, entitled The Last Supper (1995). Hannah also directed, produced and shot the documentary Strip Notes (2002) which was inspired while researching her role for Dancing at the Blue Iguana (2000) that was shown on HBO and UK's Channel 4. Daryl is in the process of shooting a documentary on Human Trafficking and has traveled undercover to South East Asia to document this atrocity and has become and advocates raising awareness and ending slavery. She has made over 40 video blogs for various websites including her popular dhlovelife.com. She designed dhlovelife.com (online since 2005) her website dedicated to sharing solutions on how to live more harmoniously with the planet and all other living things. Daryl has been passionate, committed and effective advocate for a more ethical relationship with each other and all life on the Planet. She has produced, hosted and shot numerous environmental awareness/ health documentaries, TV appearances and is a frequent speaker on both the conservative and progressive news. Hannah has been a greening consultant for events such as the Virgin Music Festival, attended by over 150,000 people. Her many speaking engagements include keynote speeches at the UN Climate Change Summit, UN Global Business Conference on the environment,, Natural and Organic Products Expo, LOHAS and numerous national and international universities, conferences and events. She has written articles on self sufficiency and sustainability for many magazines and has done a plethora of interviews on the topic in thousands of publications. The site features weekly five-minute inspirational video blogs which Daryl produces and films. There are daily news updates, alerts, community and access to goods and services. She is a member of the World Future Council, sits on the boards of the Sylvia Earle Alliance, Mission Blue, Eco America, Environmental Media Association (EMA), The Somaly Mam Foundation, and the Action Sports Environmental Coalition, She is the founder of the Sustainable Biodiesel Alliance (SBA).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MjUyMzMxOF5BMl5BanBnXkFtZTcwNjEzNjI5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000435","name":"Daryl Hannah","idIMDB":"nm0000435"},"actorId":"nm0000435","character":"Cynthia Carter","urlCharacter":"http://www.imdb.com/character/ch0012636","main":true},{"actorName":"Lauren German","urlProfile":"http://www.imdb.com/name/nm0314514","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNjY0NTA0Ml5BMl5BanBnXkFtZTgwMTUxMTMyNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 November 1978","placeOfBirth":" Huntington Beach, California, USA","birthName":"Lauren Christine German","height":"5' 7\" (1.7 m)","bio":"Lauren German was born on November 29, 1978 in Huntington Beach, California. German attended the prominent Actor's Studio and attended USC. Lauren also trained as a dancer at the Orange County High School of the Arts (a.k.a. OCHSA). She's known for her roles on the hit TV series, 7th Heaven (1996), and made her film debut in Down to You (2000). She starred, opposite Shane West and Mandy Moore, in the 2001 sleeper hit, A Walk to Remember (2002). She's also known as Agent \"Lori Weston\" in the television series. Hawaii Five-0 (2010), \"Beth\" in the 2007 film, Hostel: Part II (2007), and \"Eva\" in 2011 film, The Divide (2011). She starred in the NBC drama, Chicago Fire (2012), as \"Leslie Shay\", from 2012 to 2014. In 2016, she will be starring in Lucifer (2015) as LAPD homicide detective \"Chloe Decker\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNjY0NTA0Ml5BMl5BanBnXkFtZTgwMTUxMTMyNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0314514","name":"Lauren German","idIMDB":"nm0314514"},"actorId":"nm0314514","character":"Belinda","urlCharacter":"http://www.imdb.com/character/ch0437280","main":true},{"actorName":"Clayne Crawford","urlProfile":"http://www.imdb.com/name/nm0186728","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMDY5ODQ5M15BMl5BanBnXkFtZTgwMzM2NzIzODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1978","placeOfBirth":" Clay, Alabama, USA","height":"6' (1.83 m)","bio":"Clayne Crawford was born on April 20, 1978 in Clay, Alabama, USA. He is an actor and director, known for A Walk to Remember (2002), Wristcutters: A Love Story (2006) and The Perfect Host (2010). He is married to Sunshine Kiki Brown.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMDY5ODQ5M15BMl5BanBnXkFtZTgwMzM2NzIzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0186728","name":"Clayne Crawford","idIMDB":"nm0186728"},"actorId":"nm0186728","character":"Dean","urlCharacter":"http://www.imdb.com/character/ch0452705","main":true},{"actorName":"Al Thompson","urlProfile":"http://www.imdb.com/name/nm0859824","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MzE5ODczNF5BMl5BanBnXkFtZTcwNjIzOTkxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10½\" (1.79 m)","bio":"Al Thompson is an actor and producer, known for A Walk to Remember (2002), The Royal Tenenbaums (2001) and Love Don't Cost a Thing (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MzE5ODczNF5BMl5BanBnXkFtZTcwNjIzOTkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0859824","name":"Al Thompson","idIMDB":"nm0859824"},"actorId":"nm0859824","character":"Eric","urlCharacter":"http://www.imdb.com/character/ch0437286","main":true},{"actorName":"Paz de la Huerta","urlProfile":"http://www.imdb.com/name/nm0209289","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQ2OTk1NTczNF5BMl5BanBnXkFtZTcwMjEwNzIyNQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 September 1984","placeOfBirth":" New York City, New York, USA","height":"5' 8\" (1.73 m)","bio":"Paz de la Huerta was born and raised in New York City, to a Spanish-born father and a Minneapolis, Minnesota-born mother. She has been acting since the age of four, having trained at the SoHo Children's Acting Studio. Aside from acting, Paz is a skilled artist, designer, and writer who enjoys listening to punk rock music. She resides in Tribeca, New York, with her mother and sister.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQ2OTk1NTczNF5BMl5BanBnXkFtZTcwMjEwNzIyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0209289","name":"Paz de la Huerta","idIMDB":"nm0209289"},"actorId":"nm0209289","character":"Tracie","urlCharacter":"http://www.imdb.com/character/ch0220850","main":true},{"actorName":"Jonathan Parks Jordan","urlProfile":"http://www.imdb.com/name/nm0430036","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NDk2MDA5M15BMl5BanBnXkFtZTYwMzQxMzcy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1979","placeOfBirth":" South Carolina, USA","bio":"Jonathan Parks Jordan was born in 1979 in South Carolina, USA. He is an actor, known for The Notebook (2004), A Walk to Remember (2002) and Shadrach (1998). He has been married to Tara Tolle since March 23, 2006. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NDk2MDA5M15BMl5BanBnXkFtZTYwMzQxMzcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0430036","name":"Jonathan Parks Jordan","idIMDB":"nm0430036"},"actorId":"nm0430036","character":"Walker","urlCharacter":"http://www.imdb.com/character/ch0452704","main":true},{"actorName":"Matt Lutz","urlProfile":"http://www.imdb.com/name/nm0527593","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzExMTg5Nzk5OV5BMl5BanBnXkFtZTcwMTg5NzAzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 October 1978","placeOfBirth":" Anderson, Indiana, USA","birthName":"Matthew Christopher Lutz","height":"5' 11\" (1.8 m)","bio":"Matt Lutz was born on October 15, 1978 in Anderson, Indiana, USA as Matthew Christopher Lutz. He is an actor, known for A Walk to Remember (2002), Sudden Death! (2010) and Bringing Down the House (2003). He was previously married to Christy Hall.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzExMTg5Nzk5OV5BMl5BanBnXkFtZTcwMTg5NzAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0527593","name":"Matt Lutz","idIMDB":"nm0527593"},"actorId":"nm0527593","character":"Clay Gephardt","urlCharacter":"http://www.imdb.com/character/ch0040178","main":true},{"actorName":"David Andrews","urlProfile":"http://www.imdb.com/name/nm0028625","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzODM0OTQxMl5BMl5BanBnXkFtZTgwMjMyNTQ5NjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 November 1952","placeOfBirth":" Baton Rouge, Louisiana, USA","birthName":"Stanley David Andrews","bio":"David Andrews, born and raised in Baton Rouge, Louisiana, graduated summa cum-laude from Louisiana State University, before going on to study law at Duke University and earning his degree from Stanford Law School. After becoming a member of the California bar and practicing law for a short time, he took what he calls a \"hard right\", deciding to leave the legal profession for an acting career. Now a 35-year industry veteran, David Andrews has worked with some of Hollywood's top directors and Oscar-winning actors, and has been singled out by critics for his work on both stage and screen. A highly versatile actor and consummate professional, David's roles have run the gamut in films such as World War Z, Apollo 13, Fight Club, Hannibal, Walk to Remember, The Conspirator, Cherry 2000, and Fair Game, in which he was singled out for his powerful portrayal of Scooter Libby. On television, David has starred as a series regular on JAG, The Monroes, Mann & Machine, The Antagonist, HBO's 12 Miles of Bad Road, and the BBC's Pulaski, for which he received an ACE Award nomination for Best Actor in the title role. In addition to a very long list of guest starring roles, David has recurred on numerous series: Netflix' hit series House of Cards, Justified, Murder in the First, The Catch, Crisis, The Whispers, Necessary Roughness, CSI, Covert Affairs, Brothers and Sisters, Surface, Dragnet, and Murder One. He is currently recurring as Sam Vincent on USA's soon-to-be released series Shooter. MOW/mini-series projects, to name just a few, include HBO's Band of Brothers and From the Earth to the Moon, for which he earned a SAG Award for Outstanding Ensemble Performance and critical acclaim for his performance as astronaut Frank Borman. David recently finished co-writing his second feature film script, Bushido, a action/adventure tale of self discovery set in Japan amidst the chaos and destruction of the final days of WWII.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzODM0OTQxMl5BMl5BanBnXkFtZTgwMjMyNTQ5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0028625","name":"David Andrews","nicknames":["Wheels"],"idIMDB":"nm0028625"},"actorId":"nm0028625","character":"Mr. Kelly","urlCharacter":"http://www.imdb.com/character/ch0437279","main":true},{"actorName":"David Lee Smith","urlProfile":"http://www.imdb.com/name/nm0807900","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MDQwODYwNF5BMl5BanBnXkFtZTcwMDU4NzAzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 September 1963","placeOfBirth":" Birmingham, Alabama, USA","bio":"David Lee Smith grew up in Birmingham, Alabama, where he graduated from Banks High School. He went on to graduate from the University of Alabama and later earned a Master of Fine Arts degree from SMU.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MDQwODYwNF5BMl5BanBnXkFtZTcwMDU4NzAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0807900","name":"David Lee Smith","idIMDB":"nm0807900"},"actorId":"nm0807900","character":"Dr. Carter","urlCharacter":"http://www.imdb.com/character/ch0437283","main":true},{"actorName":"Xavier Hernandez","urlProfile":"http://www.imdb.com/name/nm1197269","urlPhoto":"","biography":{"bio":"Xavier Hernandez is an actor, known for A Walk to Remember (2002) and Happy Campers (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1197269","name":"Xavier Hernandez","idIMDB":"nm1197269"},"actorId":"nm1197269","character":"Luis","urlCharacter":"http://www.imdb.com/character/ch0437277","main":true},{"actorName":"Marisa Miller","urlProfile":"http://www.imdb.com/name/nm0588902","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMjQ2NTYxN15BMl5BanBnXkFtZTcwMzYyNjY5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 July 1962","placeOfBirth":" Los Angeles, California, USA","birthName":"Marisa Anne Miller","height":"5' 6\" (1.68 m)","bio":"Marisa Miller was born in Santa Monica, California to actor/writer/producer, Mark Miller I and journalist Beatrice Ammidown (Miller). She is the sister of actress, Penelope Ann Miller, social worker, Savannah Miller, and the late music producer, Gabe Miller. She studied acting at Sarah Lawrence College and Wesleyan University. After college, she moved to New York City, where she worked in the theatre. Her early life was influenced by her father's career as a television and stage actor, as well as the many cultural icons her mother interviewed while working at the Los Angeles Times and Life Magazine. While her main acting film credits are for off-beat comedic roles, she has consistently remained active in classical theatre. In the past few years, starting with a story editing job with her father, she has been enlisted to adapt biographies for the screen and been commissioned to work with writing partners on both comedies and historical dramas . She lives in Los Angeles with her husband, writer and proprietor, Jonathan Berzer. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMjQ2NTYxN15BMl5BanBnXkFtZTcwMzYyNjY5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0588902","name":"Marisa Miller","idIMDB":"nm0588902"},"actorId":"nm0588902","character":"Ms. Garber","urlCharacter":"http://www.imdb.com/character/ch0437281","main":true},{"actorName":"Paula Jones","urlProfile":"http://www.imdb.com/name/nm0428999","urlPhoto":"","biography":{"bio":"Paula Jones is an actress, known for A Walk to Remember (2002), That Darn Cat (1997) and Jack Be Nimble (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0428999","name":"Paula Jones","idIMDB":"nm0428999"},"actorId":"nm0428999","character":"Sally","urlCharacter":"http://www.imdb.com/character/ch0437288","main":true}],"seasons":[],"idIMDB":"tt0281358","urlIMDB":"http://www.imdb.com/title/tt0281358","business":{"budget":{"money":"$11,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$12,177,488","country":"USA","day":"27","month":"01","year":"2002","remarks":"2,411 Screens"},{"money":"£246,860","country":"UK","day":"15","month":"09","year":"2002","remarks":"263 Screens"},{"money":"AUD 435,609","country":"Australia","day":"03","month":"07","year":"2002","remarks":"129 Screens"},{"money":"€106,386","country":"Italy","day":"01","month":"09","year":"2002","remarks":"66 Screens"},{"money":"€237,072","country":"Spain","day":"16","month":"11","year":"2003","remarks":"144 Screens"}],"gross":[{"money":"$41,227,069","country":"USA","day":"28","month":"04","year":"2002","remarks":""},{"money":"$41,167,564","country":"USA","day":"21","month":"04","year":"2002","remarks":""},{"money":"$41,090,572","country":"USA","day":"14","month":"04","year":"2002","remarks":""},{"money":"$40,969,807","country":"USA","day":"07","month":"04","year":"2002","remarks":""},{"money":"$40,729,890","country":"USA","day":"31","month":"03","year":"2002","remarks":""},{"money":"$40,522,960","country":"USA","day":"24","month":"03","year":"2002","remarks":""},{"money":"$40,348,627","country":"USA","day":"17","month":"03","year":"2002","remarks":""},{"money":"$39,975,162","country":"USA","day":"10","month":"03","year":"2002","remarks":""},{"money":"$39,331,021","country":"USA","day":"03","month":"03","year":"2002","remarks":""},{"money":"$38,173,310","country":"USA","day":"24","month":"02","year":"2002","remarks":""},{"money":"$35,960,066","country":"USA","day":"17","month":"02","year":"2002","remarks":""},{"money":"$30,297,954","country":"USA","day":"10","month":"02","year":"2002","remarks":""},{"money":"$23,325,402","country":"USA","day":"03","month":"02","year":"2002","remarks":""},{"money":"$12,177,488","country":"USA","day":"27","month":"01","year":"2002","remarks":""},{"money":"£433,546","country":"UK","day":"22","month":"09","year":"2002","remarks":""},{"money":"£246,860","country":"UK","day":"15","month":"09","year":"2002","remarks":""},{"money":"AUD 1,852,087","country":"Australia","day":"30","month":"09","year":"2002","remarks":""},{"money":"AUD 435,609","country":"Australia","day":"03","month":"07","year":"2002","remarks":""},{"money":"€284,009","country":"Italy","day":"08","month":"09","year":"2002","remarks":""},{"money":"€171,118","country":"Italy","day":"01","month":"09","year":"2002","remarks":""},{"money":"€45,410","country":"Italy","day":"18","month":"08","year":"2002","remarks":""},{"money":"€237,072","country":"Spain","day":"16","month":"11","year":"2003","remarks":""}],"weekendGross":[{"money":"$40,816","country":"USA","day":"28","month":"04","year":"2002","remarks":"72 Screens"},{"money":"$51,186","country":"USA","day":"21","month":"04","year":"2002","remarks":"73 Screens"},{"money":"$76,139","country":"USA","day":"14","month":"04","year":"2002","remarks":"85 Screens"},{"money":"$129,650","country":"USA","day":"07","month":"04","year":"2002","remarks":"180 Screens"},{"money":"$156,745","country":"USA","day":"31","month":"03","year":"2002","remarks":"215 Screens"},{"money":"$109,084","country":"USA","day":"24","month":"03","year":"2002","remarks":"145 Screens"},{"money":"$196,388","country":"USA","day":"17","month":"03","year":"2002","remarks":"242 Screens"},{"money":"$451,221","country":"USA","day":"10","month":"03","year":"2002","remarks":"514 Screens"},{"money":"$843,429","country":"USA","day":"03","month":"03","year":"2002","remarks":"863 Screens"},{"money":"$1,568,462","country":"USA","day":"24","month":"02","year":"2002","remarks":"1,306 Screens"},{"money":"$3,918,586","country":"USA","day":"17","month":"02","year":"2002","remarks":"1,936 Screens"},{"money":"$5,542,525","country":"USA","day":"10","month":"02","year":"2002","remarks":"2,311 Screens"},{"money":"$8,836,201","country":"USA","day":"03","month":"02","year":"2002","remarks":"2,420 Screens"},{"money":"$12,177,488","country":"USA","day":"27","month":"01","year":"2002","remarks":"2,411 Screens"},{"money":"£84,892","country":"UK","day":"22","month":"09","year":"2002","remarks":"221 Screens"},{"money":"£246,860","country":"UK","day":"15","month":"09","year":"2002","remarks":"263 Screens"},{"money":"AUD 179,656","country":"Australia","day":"17","month":"07","year":"2002","remarks":"124 Screens"},{"money":"AUD 366,957","country":"Australia","day":"10","month":"07","year":"2002","remarks":"129 Screens"},{"money":"AUD 435,609","country":"Australia","day":"03","month":"07","year":"2002","remarks":"129 Screens"},{"money":"€39,446","country":"Italy","day":"08","month":"09","year":"2002","remarks":"29 Screens"},{"money":"€237,072","country":"Spain","day":"16","month":"11","year":"2003","remarks":"144 Screens"}],"admissions":[{"money":"74,048","country":"Germany","day":"03","month":"11","year":"2002","remarks":"opening week"}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"06","month":"04","year":"2001","remarks":null},{"money":null,"country":null,"day":"27","month":"05","year":"2001","remarks":null}],"copyrightHolder":"Original score © 2002 Sockeye Music, Inc. (BMI)"},"technical":{"runtime":["1 hr 41 min (101 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color (Technicolor)"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex Cameras, JDC Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA (processing and prints)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic) (Fuji F-CP 3519D)"]},"rating":"7.4","metascore":"35","filmingLocations":[{"location":"Atkinson, North Carolina, USA"}],"rated":"PG","awards":[{"award":"Giffoni Film Festival 2002","titlesAwards":[{"titleAwardOutcome":"Won Artistic Director's Award","categories":[{"category":"","names":[{"name":"Adam Shankman","id":"nm0788202","role":null}]}]}]},{"award":"MTV Movie Awards 2002","titlesAwards":[{"titleAwardOutcome":"Won MTV Movie Award","categories":[{"category":"Breakthrough Female Performance","names":[{"name":"Mandy Moore","id":"nm0601553","role":null}]}]}]},{"award":"Phoenix Film Critics Society Awards 2003","titlesAwards":[{"titleAwardOutcome":"Nominated PFCS Award","categories":[{"category":"Best Live Action Family Film","names":[]}]}]},{"award":"Teen Choice Awards 2002","titlesAwards":[{"titleAwardOutcome":"Won Teen Choice Award","categories":[{"category":"Film - Choice Breakout Performance, Actress","names":[{"name":"Mandy Moore","id":"nm0601553","role":null}]},{"category":"Film - Choice Chemistry","names":[{"name":"Mandy Moore","id":"nm0601553","role":null},{"name":"Shane West","id":"nm0922342","role":null}]}]},{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Film - Choice Actress, Drama/Action Adventure","names":[{"name":"Mandy Moore","id":"nm0601553","role":null}]}]}]}],"votes":"170,057","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."},{"idCompany":"co0008059","name":"Pandora Cinema"},{"idCompany":"co0062957","name":"DiNovi Pictures"}],"keywords":{"keywords":["student","punishment","school","community service","reverend","north carolina","hospital","practical joke","school play","prank","ambition","minister","high school girl","high school boy","teen drama","four word title","crutches","urination","security guard","balcony","book","character repeating someone else's dialogue","character says i love you","yearbook","nurse","doctor","tattoo","docks","date","piano","prank gone wrong","nicholas sparks","underage drinking","priest's daughter","bittersweet","tearjerker","singing","outsider","loner","bully comeuppance","restaurant","car radio","school bus","cemetery","fainting","wheelchair","acting musician","library","car accident","car crash","american muscle","wet t shirt","wet pants","rescue","police chase","montage","car chase","what happened to epilogue","wedding","ends with wedding","flashlight","ex boyfriend ex girlfriend relationship","widower","police officer","ex husband ex wife relationship","police car","director","script","escape","deception","passionate kiss","chick flick","clique","jock","2000s","gospel","gospel choir","choir","church","chapel","high school principal","high school teacher","high school student","scene during opening credits","revelation","tragedy","cult film","interracial friendship","priest","preacher","friendship","slow motion scene","revenge","punched in the face","teenage boy","peer pressure","initiation rite","juvenile delinquent","bad boy","love at first sight","forbidden love","near death experience","teaching someone to dance","single parent","single father","voice over narration","paralysis","jumping from height","teen angst","redemption","opposites attract","melodrama","intimate","reference to aristotle","accident victim","teenage daughter","teen movie","teenage love","teenage girl","father son estrangement","stage play","kiss","ambulance","dating","swing","sweetheart","rebel","high school","christian","christianity","wedding ceremony","terminal illness","teenager","teenage rebellion","star gazing","sports car","small town","single mother","mother son relationship","mobbing","miracle","marriage proposal","male bonding","jealousy","high school sweethearts","high school drama","first love","first kiss","father son reunion","father son relationship","father daughter relationship","faith","ex girlfriend","driving","dead mother","dancing","dance lesson","crutch","coming of age","comet","church service","cafeteria","butterfly","bully","boyfriend girlfriend relationship","bible","best friend","cancer","basketball","evangelical christianity","sweater","self confidence","teen rebel","teen romance","tutor","star crossed lovers","life changing","drama club","outcast","marriage","telescope","leukemia","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 01:58:28"}}