{"data":{"movies":[{"title":"The Last Castle","originalTitle":"","year":"2001","releaseDate":"20011019","directors":[{"name":"Rod Lurie","id":"nm0527109"}],"writers":[{"name":"David Scarpa","id":"nm0769227"},{"name":"David Scarpa","id":"nm0769227"}],"runtime":"131 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MTY0MjU3M15BMl5BanBnXkFtZTYwMzkwOTc5._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Drama","Thriller"],"plot":"When three star General Irwin is transferred to a maximum security military prison, its warden, Colonel Winter, can't hide his admiration towards the highly decorated and experienced soldier. Irwin has been stripped of his rank for disobedience in a mission, but not of fame. Colonel Winter, who runs the prison with an iron fist, deeply admires the General, but works with completely different methods in order to keep up discipline. After a short while, Irwin can feel Winter's unjust treatment of the inmates. He decides to teach Winter a lesson by taking over command of the facility and thus depriving him of his smug attitude. When Winter decides to participate in what he still thinks of as a game, it may already be too late to win.","simplePlot":"A court-martialed general rallies together 1200 inmates to rise against the corrupt system that put him away.","actors":[{"actorName":"Robert Redford","urlProfile":"http://www.imdb.com/name/nm0000602","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1Nzc5MzQyMV5BMl5BanBnXkFtZTcwNjQ5OTA0Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1936","placeOfBirth":" Santa Monica, California, USA","birthName":"Charles Robert Redford Jr.","height":"5' 10½\" (1.79 m)","bio":"Charles Robert Redford, Jr. was born on August 18, 1936, in Santa Monica, California, to Martha (Hart), from Texas, and Charles Robert Redford, an accountant for Standard Oil, who was originally from Connecticut. He is of English, Scottish, Cornish, and Irish ancestry. Robert's mother died in 1955, the year after he graduated from high school. Robert was a scrappy kid who stole hubcaps in school and lost his college baseball scholarship at the University of Colorado because of drunkenness. After leaving UoC, he spent some time drifting across America, spending a time working in the California oil fields. Having saved enough he moved to Europe studying art in Paris and Florence.Back in the States he decided on a career as a theatrical designer in New York. Enrolling at the American Academy of Dramatic Art he turned to acting making his stage debut in 'Tall Story'. In 1962 he was signed for the stage production of 'Barefoot in the Park' which was a smash hit but it wasn't until 5 years later when it was filmed that he became an important star. Television and stage experience coupled with all-American good looks led to movies and television roles. His breakthrough role was \"The Sundance Kid\" in Butch Cassidy and the Sundance Kid (1969), when the actor was 32. The Way We Were (1973) and The Sting (1973), both in 1973, made Redford the number one box office star for the next three years. Redford used his clout to advance environmental causes and his riches to acquire Utah property, which he transformed into a ranch and the Sundance ski resort. In 1980, he established the Sundance Institute for aspiring filmmakers. Its annual film festival has become one of the world's most influential. Redford's directorial debut, Ordinary People (1980), won him the Academy Award as Best Director in 1981. He waited eight years before getting behind the camera again, this time for the screen version of John Nichols' acclaimed novel of the Southwest, The Milagro Beanfield War (1988). He scored with critics and fans in 1992 with the Brad Pitt film A River Runs Through It (1992), and again, in 1994, with Quiz Show (1994), which earned him yet another Best Director nomination. Lola Van Wagenen (consumer activist), born in 1940, dropped out of college to marry Redford on September 12, 1958. They divorced in 1985 after having four children, one of whom died of sudden infant death syndrome (SIDS). Daughter Shauna Redford, born November 15, 1960, is a painter who married Eric Schlosser on October 5, 1985, in Provo, UT. Her first child, born in January 1991, made Redford a grandfather. Son James Redford (aka Jamie Redford), a screenwriter, was born May 5, 1962. Daughter Amy Redford, an actress; was born October 22, 1970. Redford also has a brother named William.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1Nzc5MzQyMV5BMl5BanBnXkFtZTcwNjQ5OTA0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000602","name":"Robert Redford","nicknames":["Bob"],"idIMDB":"nm0000602"},"actorId":"nm0000602","character":"Lt. Gen. Eugene Irwin","urlCharacter":"http://www.imdb.com/character/ch0014661","main":true},{"actorName":"James Gandolfini","urlProfile":"http://www.imdb.com/name/nm0001254","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDY4NDMzN15BMl5BanBnXkFtZTcwNDkzNDE5NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1961","placeOfBirth":" Westwood, New Jersey, USA","birthName":"James Joseph Gandolfini Jr.","height":"6' 0½\" (1.84 m)","bio":"James Gandolfini was born in Westwood, New Jersey, to Santa (Penna), a high school lunchlady, and James Joseph Gandolfini, Sr., a bricklayer and head school janitor. His parents were both of Italian origin. Gandolfini began acting in the New York theater. His Broadway debut was in the 1992 revival of \"A Streetcar Named Desire\" with Jessica Lange and Alec Baldwin. James' breakthrough role was his portrayal of Virgil the hitman in Tony Scott's True Romance (1993), but the role that brought him worldwide fame and accolades was as complex Mafia boss Tony Soprano in HBO's smash hit series The Sopranos (1999). He died unexpectedly of a heart attack in 2013 while vacationing in Italy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDY4NDMzN15BMl5BanBnXkFtZTcwNDkzNDE5NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001254","name":"James Gandolfini","nicknames":["Jim","Jimmy"],"idIMDB":"nm0001254"},"actorId":"nm0001254","character":"Col. Winter","urlCharacter":"http://www.imdb.com/character/ch0014660","main":true},{"actorName":"Mark Ruffalo","urlProfile":"http://www.imdb.com/name/nm0749263","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MjMwNjAzNF5BMl5BanBnXkFtZTcwMzkyNDg1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1967","placeOfBirth":" Kenosha, Wisconsin, USA","birthName":"Mark Alan Ruffalo","height":"5' 8\" (1.73 m)","bio":"Mark Ruffalo was born in Kenosha, Wisconsin, to Marie Rose (Hebert), a stylist and hairdresser, and Frank Lawrence Ruffalo, a construction painter. His father's ancestry is Italian, and his mother is of half French-Canadian and half Italian descent. Mark moved with his family to Virginia Beach, Virginia, where he lived out most of his teenage years. Following high school, Mark moved with his family to San Diego and soon migrated north, eventually settling in Los Angeles. He took classes at the Stella Adler Conservatory and subsequently co-founded the Orpheus Theatre Company, an Equity-Waiver establishment, where he worked in nearly every capacity. From acting, writing, directing and producing to running the lights and building sets while building his resume. Bartending for nearly nine years to make ends meet and ready to give it all up, a chance meeting and resulting collaboration with playwright/screenwriter Kenneth Lonergan changed everything. Ruffalo won NY success in Lonergan's play \"This Is Our Youth\", which led to the male lead in Lonergan's film You Can Count on Me (2000), playing the ne'er-do-well brother of Laura Linney. The performance drew rave reviews and invited comparisons to an early Marlon Brando. Notable roles in The Last Castle (2001), XX/XY (2002), and Windtalkers (2002) followed, although in 2002 Ruffalo was diagnosed with an acoustic neuroma, a type of brain tumor. Though the tumor was benign, the resulting surgery led to a period of partial facial paralysis, from which he fully recovered. In 2003, Ruffalo scored leading roles alongside two popular female stars, playing a police detective opposite Meg Ryan in In the Cut (2003) and the love interest of Gwyneth Paltrow in the comedy View from the Top (2003). Though both films were high-profile box office disappointments, Ruffalo went on to four notable (if highly disparate) films in 2004 - We Don't Live Here Anymore (2004), Eternal Sunshine of the Spotless Mind (2004), 13 Going on 30 (2004), and Collateral (2004) - which solidified his ability to be both a popular leading man and an acclaimed ensemble player in either comedy or drama. After 2004, Ruffalo was consistently at work, with leads in popular Hollywood films and independent productions that continued to solidify him as one of film's most consistently strong actors: Just Like Heaven (2005), Les fous du roi (2006), Zodiac (2007), Reservation Road (2007), and The Brothers Bloom (2008). In 2010 Ruffalo achieved something of a breakthrough, by directing the indie film Sympathy for Delicious (2010), which won him the Special Jury Prize at the Sundance Film Festival, and co-starring as the sperm-donor father to lesbian couple Annette Bening and Julianne Moore in The Kids Are All Right (2010). His role in the idiosyncratic domestic comedy/drama earned him Academy Award, Independent Spirit Award, Screen Actors Guild, and BAFTA nominations for Best Supporting Actor. High-profile roles in Martin Scorsese's Shutter Island (2010) and 'Kenneth Longeran''s long-delayed Margaret (2011) followed before Ruffalo's appearance as Dr. Bruce Banner, aka The Hulk, in Joss Whedon's blockbuster The Avengers (2012). Garnering highly positive reviews for a role in which actors Eric Bana and Edward Norton could not find success in previous films made Ruffalo a box office star in addition to a critically-acclaimed actor. He is expected to reprise the role in the upcoming 2015 sequel, and reunited with former co-star Gywneth Paltrow in the sex-addiction comedy-drama Thanks for Sharing (2012); Ruffalo also will take the lead in Ryan Murphy's adaptation of Larry Kramer's AIDS-drama play The Normal Heart (2014). Ruffalo has been married to actress Sunrise Coigney since 2000; the couple have three children, a son and two daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MjMwNjAzNF5BMl5BanBnXkFtZTcwMzkyNDg1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0749263","name":"Mark Ruffalo","idIMDB":"nm0749263"},"actorId":"nm0749263","character":"Yates","urlCharacter":"http://www.imdb.com/character/ch0014662","main":true},{"actorName":"Steve Burton","urlProfile":"http://www.imdb.com/name/nm0123733","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NjQxMTA4Ml5BMl5BanBnXkFtZTYwNTY0NjIz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1970","placeOfBirth":" Indianapolis, Indiana, USA","birthName":"Jack Stephen Burton","height":"5' 10\" (1.78 m)","bio":"Steve Burton was born on June 28, 1970 in Indianapolis, Indiana, USA as Jack Stephen Burton. He is an actor and director, known for General Hospital (1963), The Last Castle (2001) and The Young and the Restless (1973). He has been married to Sheree Gustin since January 16, 1999. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NjQxMTA4Ml5BMl5BanBnXkFtZTYwNTY0NjIz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0123733","name":"Steve Burton","nicknames":["\"Stone Cold\" Steve"],"idIMDB":"nm0123733"},"actorId":"nm0123733","character":"Capt. Peretz","urlCharacter":"http://www.imdb.com/character/ch0014663","main":true},{"actorName":"Delroy Lindo","urlProfile":"http://www.imdb.com/name/nm0005148","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzOTg3NDQ5OF5BMl5BanBnXkFtZTYwMzA3NTY2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1952","placeOfBirth":" Eltham, London, England, UK","height":"6' 4\" (1.93 m)","bio":"On the stage and on the big screen, Delroy Lindo projects a powerful presence that is almost impossible to ignore. Alhough it was not his first film role, his portrayal of the bipolar numbers boss West Indian Archie in Spike Lee's Malcolm X (1992) is what first attracted attention to Lindo's considerable talents. Since then, his star has slowly been on the rise. The son of Jamaican parents, Lindo was born and raised in Lewisham, England, United Kingdom, until his teens when he and his mother, a nurse, moved to Toronto, Ontario, Canada. A little later, they moved to the United States, where Lindo would graduate from the American Conservatory Theater in San Francisco. After graduation, Lindo landed his first film role, that of an Army sergeant in More American Graffiti (1979). However, he did not appear in another film for ten years. In the meantime, Lindo worked on stage and, in 1982, debuted on Broadway in \"Master Harold and the Boys\" directed by the play's author, Athol Fugard. In 1988, Lindo earned a Tony nomination for his portrayal of Harald Loomis in Joe Turner's Come and Gone. Though he was obviously a talented actor with a bright future, Lindo's career stalled. Wanting someone more aggressive and appreciative of his talents, Lindo changed agents (he'd had the same one through most of his early career). It was a smart move, but it was director Spike Lee who provided the boost Lindo's career needed. The director was impressed enough with Lindo to cast him as patriarch Woody Carmichael in Lee's semi-autobiographical comedy Crooklyn (1994). For Lindo, 1996 was a big year. He landed major supporting roles in six features, including a heavy in Barry Sonnenfeld's Get Shorty (1995), another villainous supporting role in Lee's Clockers (1995), and still another bad guy in Feeling Minnesota (1996). Lest one believe that Lindo is typecast into forever playing drug lords and gangsters, that year he also played baseball player Leroy \"Satchel\" Paige in the upbeat Soul of the Game (1996) (a.k.a. Baseball in Black and White), for which he won a NAACP Image Award nomination. Since then, the versatile Lindo has shown himself equally adept at playing characters on both sides of the law. In 1997, he played an angel opposite Holly Hunter in Danny Boyle's offbeat romantic fantasy A Life Less Ordinary (1997) and, in 2009, a vengeful cop in an episode of Law & Order: Special Victims Unit (1999). Lindo graduated from San Francisco State University in 2004 with a degree in Cinema.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzOTg3NDQ5OF5BMl5BanBnXkFtZTYwMzA3NTY2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005148","name":"Delroy Lindo","idIMDB":"nm0005148"},"actorId":"nm0005148","character":"Gen. Wheeler","urlCharacter":"http://www.imdb.com/character/ch0014665","main":true},{"actorName":"Paul Calderon","urlProfile":"http://www.imdb.com/name/nm0129538","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY2NzY5MDI5Nl5BMl5BanBnXkFtZTcwNDIzNjMzMw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1959","placeOfBirth":" Puerto Rico","bio":"Paul Calderon was born in 1959 in Puerto Rico. He is an actor, known for Pulp Fiction (1994), One Life to Live (1968) and 21 Grams (2003). He is married to Cathy. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY2NzY5MDI5Nl5BMl5BanBnXkFtZTcwNDIzNjMzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0129538","name":"Paul Calderon","idIMDB":"nm0129538"},"actorId":"nm0129538","character":"Dellwo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sam Ball","urlProfile":"http://www.imdb.com/name/nm0050458","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MjcxNzk5M15BMl5BanBnXkFtZTYwMzIxODE1._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1973","placeOfBirth":" Bunker Hill, West Virginia, USA","height":"6' (1.83 m)","bio":"Sam Ball was born on June 29, 1973 in Bunker Hill, West Virginia, USA. He is an actor, known for 13 Going on 30 (2004), One Life to Live (1968) and The Last Castle (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MjcxNzk5M15BMl5BanBnXkFtZTYwMzIxODE1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0050458","name":"Sam Ball","idIMDB":"nm0050458"},"actorId":"nm0050458","character":"Duffy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeremy Childs","urlProfile":"http://www.imdb.com/name/nm1003874","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc3MzNkN2QtODdlZS00ZGU1LWE1MmQtMTcyOGUzNjk4NWZkL2ltYWdlXkEyXkFqcGdeQXVyMjI4NjA1MTA@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"bio":"Jeremy Childs is an actor and producer, known for The Last Castle (2001), Country Strong (2010) and Closer to God (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc3MzNkN2QtODdlZS00ZGU1LWE1MmQtMTcyOGUzNjk4NWZkL2ltYWdlXkEyXkFqcGdeQXVyMjI4NjA1MTA@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1003874","name":"Jeremy Childs","idIMDB":"nm1003874"},"actorId":"nm1003874","character":"Cutbush","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clifton Collins Jr.","urlProfile":"http://www.imdb.com/name/nm0004286","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3ODQwMTg2Ml5BMl5BanBnXkFtZTcwMDE3OTU2OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1970","placeOfBirth":" Los Angeles, California, USA","birthName":"Clifton Craig Collins Jr.","height":"5' 8\" (1.73 m)","bio":"An acting chameleon who can easily lose himself in the life of his film and television characters, Clifton Collins Jr. is a native Angeleno who grew up destined to become a part of the Latino entertainment industry. His great-grandparents on his mother's side were a Mexican trumpet player and Spanish dancer who formed a traveling family act, and his grandfather was well-known character actor Pedro Gonzalez Gonzalez, most famous for his humorous sidekick roles in 1950s/1960s John Wayne westerns (he played the excitable hotel keeper in Rio Bravo (1959)) and in sitcoms. His uncle and aunt dabbled in the business at one point as well. While his famous grandfather was unable to break out of the old unflattering Latino stereotypes, Collins Jr. has done Pedro proud in the new millennium. Playing everything from policemen to boxers to serial killers, he has managed to transcend the typical racial trappings of his grandfather's era and play flesh-and-blood, three-dimensional characters. It was not always that way. Born short, lean and mean on June 16, 1970, he started his career in 1988 using his real name of Collins, but two years later began billing himself as \"Clifton Gonzales-Gonzales\" as a tribute to his aged grandfather and his early accomplishments. Pedro, who died in 2006, lived long enough to witness his grandson's achievements. Toiling in typical \"barrio\" roles at the beginning of his career, Collins Jr. found himself stuck in bit parts either as a struggling blue-collar worker or urban thug. In the mid-1990s, he began to search out and wing standout roles that enabled him to break the confines of the Latino stereotype. He slowly moved up in billing, even in mediocre material such as the futuristic prison film Fortress (1992) and the mindless 1970s rock-era comedy The Stöned Age (1994). His breakout role as Cesar, the vicious student and gangbanger in One Eight Seven (1997) opposite Los Angeles substitute teacher Samuel L. Jackson, set him on the right path. This led to a mesmerizing collection of other portrayals, both good-guy and bad-guy, in such films as The Replacement Killers (1998), The Wonderful Ice Cream Suit (1998) and Tigerland (2000). His versatility finally tested, he played everything from a gay Mexican hitman in the critically acclaimed Traffic (2000) to a psychological profiler for the FBI in the mainstream actioner Profession profiler (2004). A number of top guest appearances came his way on such series as NYPD Blue (1993) and La treizième dimension (2002) and he had recurring roles on Resurrection Blvd. (2000) and Alias (2001). A monumental shift forward in his career happened recently with his hypnotic portrayal of killer Perry Smith, the object of writer Truman Capote's obsession, in the art-house favorite Capote (2005). Decades ago, Robert Blake played the same part in the gripping Capote book-to-film In Cold Blood (1967). This heralded achievement has enabled Collins to move into the co-producer's chair of late, notably for Rampage: The Hillside Strangler Murders (2006), in which he inhabits the role of serial killer Kenneth Bianchi. Obviously, there is plenty more in the works for this major talent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3ODQwMTg2Ml5BMl5BanBnXkFtZTcwMDE3OTU2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004286","name":"Clifton Collins Jr.","idIMDB":"nm0004286"},"actorId":"nm0004286","character":"Cpl. Ramon Aguilar","urlCharacter":"http://www.imdb.com/character/ch0014664","main":true},{"actorName":"George W. Scott","urlProfile":"http://www.imdb.com/name/nm0779187","urlPhoto":"","biography":{"bio":"George W. Scott is an actor, known for The Last Castle (2001), Sympathy for Delicious (2010) and Honeybee (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0779187","name":"George W. Scott","idIMDB":"nm0779187"},"actorId":"nm0779187","character":"Thumper","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian Goodman","urlProfile":"http://www.imdb.com/name/nm0329023","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNzI1MTgyOV5BMl5BanBnXkFtZTcwOTQ4OTY5MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1963","placeOfBirth":" USA","bio":"Brian Goodman was born in 1963 in the USA. He is an actor and director, known for Catch Me If You Can (2002), The Fast and the Furious: Tokyo Drift (2006) and Rizzoli & Isles (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNzI1MTgyOV5BMl5BanBnXkFtZTcwOTQ4OTY5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0329023","name":"Brian Goodman","idIMDB":"nm0329023"},"actorId":"nm0329023","character":"Beaupre","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Irby","urlProfile":"http://www.imdb.com/name/nm0409831","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNjYyNDkyNTBeQTJeQWpwZ15BbWU4MDIxNzgzMzcx._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 November 1972","placeOfBirth":" Palm Springs, California, USA","birthName":"Michael Clinton Irby","bio":"Michael Irby is an American actor and producer. He was born November 16, 1972 in Palm Springs, California USA. He is most known for his portrayal of Charles Grey on The Unit (2006-2009). Other credits include True Detective (2015), Almost Human (2014), Law Abiding Citizen (2009), Flightplan (2005), and Fast Five (2011). He will be in the upcoming NBC television series Taken (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNjYyNDkyNTBeQTJeQWpwZ15BbWU4MDIxNzgzMzcx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0409831","name":"Michael Irby","nicknames":["Irby"],"idIMDB":"nm0409831"},"actorId":"nm0409831","character":"Enriquez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Military","urlProfile":"http://www.imdb.com/name/nm0587494","urlPhoto":"","biography":{"bio":"Frank Military is a producer and writer, known for NCIS: Los Angeles (2009), The Unit (2006) and NCIS (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0587494","name":"Frank Military","idIMDB":"nm0587494"},"actorId":"nm0587494","character":"Doc Lee Bernard","urlCharacter":"http://www.imdb.com/character/ch0014666","main":true},{"actorName":"Maurice Bullard","urlProfile":"http://www.imdb.com/name/nm1035158","urlPhoto":"","biography":{"bio":"Maurice Bullard is an actor, known for The Last Castle (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1035158","name":"Maurice Bullard","idIMDB":"nm1035158"},"actorId":"nm1035158","character":"Sgt. McLaren","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nick Kokich","urlProfile":"http://www.imdb.com/name/nm1002758","urlPhoto":"","biography":{"bio":"Nick Kokich is an actor and assistant director, known for The Last Castle (2001), The United States of Leland (2003) and The Alamo (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1002758","name":"Nick Kokich","idIMDB":"nm1002758"},"actorId":"nm1002758","character":"Pvt. Niebolt","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0272020","urlIMDB":"http://www.imdb.com/title/tt0272020","business":{"budget":{"money":"$72,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$7,088,213","country":"USA","day":"21","month":"10","year":"2001","remarks":"2,262 Screens"},{"money":"£161,862","country":"UK","day":"06","month":"01","year":"2002","remarks":"158 Screens"},{"money":"€191,764","country":"Spain","day":"02","month":"06","year":"2002","remarks":"65 Screens"}],"gross":[{"money":"$18,208,078","country":"USA","day":"16","month":"12","year":"2001","remarks":""},{"money":"$18,134,738","country":"USA","day":"09","month":"12","year":"2001","remarks":""},{"money":"$18,116,027","country":"USA","day":"02","month":"12","year":"2001","remarks":""},{"money":"$18,076,985","country":"USA","day":"25","month":"11","year":"2001","remarks":""},{"money":"$17,924,798","country":"USA","day":"18","month":"11","year":"2001","remarks":""},{"money":"$17,403,764","country":"USA","day":"11","month":"11","year":"2001","remarks":""},{"money":"$15,941,255","country":"USA","day":"04","month":"11","year":"2001","remarks":""},{"money":"$12,951,350","country":"USA","day":"28","month":"10","year":"2001","remarks":""},{"money":"$7,088,213","country":"USA","day":"21","month":"10","year":"2001","remarks":""},{"money":"£161,862","country":"UK","day":"06","month":"01","year":"2002","remarks":""},{"money":"€53,663","country":"Italy","day":"04","month":"08","year":"2002","remarks":""},{"money":"€35,633","country":"Italy","day":"28","month":"07","year":"2002","remarks":""},{"money":"€699,835","country":"Spain","day":"10","month":"08","year":"2002","remarks":""},{"money":"€439,550","country":"Spain","day":"09","month":"06","year":"2002","remarks":""},{"money":"€191,764","country":"Spain","day":"02","month":"06","year":"2002","remarks":""}],"weekendGross":[{"money":"$68,528","country":"USA","day":"16","month":"12","year":"2001","remarks":"211 Screens"},{"money":"$10,894","country":"USA","day":"09","month":"12","year":"2001","remarks":"41 Screens"},{"money":"$17,908","country":"USA","day":"02","month":"12","year":"2001","remarks":"68 Screens"},{"money":"$63,308","country":"USA","day":"25","month":"11","year":"2001","remarks":"129 Screens"},{"money":"$220,245","country":"USA","day":"18","month":"11","year":"2001","remarks":"297 Screens"},{"money":"$774,145","country":"USA","day":"11","month":"11","year":"2001","remarks":"924 Screens"},{"money":"$1,740,647","country":"USA","day":"04","month":"11","year":"2001","remarks":"1,813 Screens"},{"money":"$3,626,006","country":"USA","day":"28","month":"10","year":"2001","remarks":"2,270 Screens"},{"money":"$7,088,213","country":"USA","day":"21","month":"10","year":"2001","remarks":"2,262 Screens"},{"money":"£161,862","country":"UK","day":"06","month":"01","year":"2002","remarks":"158 Screens"},{"money":"€5,884","country":"Italy","day":"04","month":"08","year":"2002","remarks":"3 Screens"},{"money":"€13,517","country":"Italy","day":"28","month":"07","year":"2002","remarks":"3 Screens"},{"money":"€167,400","country":"Spain","day":"09","month":"06","year":"2002","remarks":"66 Screens"},{"money":"€191,764","country":"Spain","day":"02","month":"06","year":"2002","remarks":"65 Screens"}],"admissions":[{"money":"3,384,797","country":"USA","day":"31","month":"12","year":"2001","remarks":""},{"money":"8,570","country":"Brazil","day":"09","month":"06","year":"2002","remarks":"20 screens"},{"money":"254,888","country":"Germany","day":"31","month":"12","year":"2001","remarks":""},{"money":"238,455","country":"Germany","day":"16","month":"12","year":"2001","remarks":""},{"money":"188,404","country":"Germany","day":"09","month":"12","year":"2001","remarks":""},{"money":"100,622","country":"Germany","day":"02","month":"12","year":"2001","remarks":"opening week"},{"money":"4,169","country":"Netherlands","day":"31","month":"12","year":"2002","remarks":""},{"money":"150,858","country":"Spain","day":"10","month":"08","year":"2002","remarks":""},{"money":"93,686","country":"Spain","day":"09","month":"06","year":"2002","remarks":""},{"money":"39,776","country":"Spain","day":"02","month":"06","year":"2002","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"19","month":"03","year":"2001","remarks":null},null],"copyrightHolder":"DreamWorks LLC"},"technical":{"runtime":["2 hr 11 min (131 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color (Technicolor)"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Panaflex Platinum, Panavision Primo, C- and E-Series Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA (prints)"],"filmLength":["3,594 m (Sweden)","3,662 m (Spain)"],"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm"]},"rating":"6.9","metascore":"43","filmingLocations":[{"location":"Nashville, Tennessee, USA"}],"rated":"R","awards":[{"award":"ALMA Awards 2002","titlesAwards":[{"titleAwardOutcome":"Nominated ALMA Award","categories":[{"category":"Outstanding Supporting Actor in a Motion Picture","names":[{"name":"Clifton Collins Jr.","id":"nm0004286","role":null}]}]}]},{"award":"GoldSpirit Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated GoldSpirit Awards","categories":[{"category":"Best Horror Soundtrack","names":[{"name":"Jerry Goldsmith","id":"nm0000025","role":null}]}]}]},{"award":"World Stunt Awards 2002","titlesAwards":[{"titleAwardOutcome":"Won Taurus Award","categories":[{"category":"Best Fire Stunt","names":[{"name":"Jacob Chambers","id":"nm0150345","role":null},{"name":"Kevin L. Jackson","id":"nm0413747","role":null},{"name":"Gary Guercio","id":"nm0345898","role":null},{"name":"Tad Griffith","id":"nm0341498","role":null},{"name":"Chuck Hosack","id":"nm0395894","role":null},{"name":"Jason Rodriguez","id":"nm0718264","role":null}]}]},{"titleAwardOutcome":"Nominated Taurus Award","categories":[{"category":"Best Aerial Work","names":[{"name":"Kevin LaRosa","id":"nm0478985","role":null},{"name":"Matthew Taylor","id":"nm0852868","role":null},{"name":"Christopher J. Tuck","id":"nm0875760","role":null}]},{"category":"Best Stunt Coordinator and/or 2nd Unit Director: Sequence","names":[{"name":"Mic Rodgers","id":"nm0734747","role":null}]}]}]}],"votes":"59,017","type":"Movie","companyCreditsSimple":[{"idCompany":"co0040938","name":"DreamWorks"},{"idCompany":"co0021936","name":"Robert Lawrence Productions"}],"keywords":{"keywords":["general","prison","colonel","military","three star general","respect","military prison","soldier","discipline","disobedience","veteran","vietnam war veteran","die hard scenario","chess piece","handcuffs","warrior","baton","shield","betting","letter","knife","protest","cigarette smoking","improvised weapon","person on fire","fire","voice over narration","mentor","fight the system","pistol","death of protagonist","dereliction of duty","shot in the chest","explosion","basketball","bare chested male","prison fight","jail cell","sword","korean war veteran","ex marine","heavy rain","laundry room","cafeteria","machine gun","killed by a propeller","catapult","war hero","shotgun","exploding helicopter","burn scar","laundry","military artifact","garrison","prisoner revolt","helicopter pilot","apache helicopter","hanoi","rules","military manual","rock","electrical burn","retirement","prison visitation","criminal","hand job","bookkeeper","verdict","blockhouse","wager","bet","american soldier","bulldozer","battlefield","self respect","mason","west point","sadist","military officer","shooting","rifle","arrest","pow camp","iraq","rain","war college","hero","congressional medal of honor","purple heart","helicopter crash","american football","poker the card game","gambler","suicide","solitary confinement","grandfather grandson relationship","father son relationship","u.s. marine corps","salute","telephone call","telephone","marksman","investigation","manipulation","fight","reference to ulysses s. grant","u.s. army","violence","beating","pow","prisoner of war","prisoner","death","dehumanization","leadership","court martial","stutter","snitch","sadism","rubber bullet","prison yard","prison labor","prison guard","military memorabilia","martinet","informant","father daughter relationship","corporal punishment","sadistic warden","convict","chess","shot to death","shot in the head","shot in the back","sergeant","private","lieutenant general","corporal","captain","gambling","trebuchet","sacrifice","murder","corruption","marine hymn","slingshot","helicopter","molotov cocktail","american flag","double agent","honor","prison warden","stone wall","man on fire","water cannon","patriotism","prison riot","secret plan"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:27:38"}}