{"data":{"movies":[{"title":"Confessions of an Ugly Stepsister","originalTitle":"","year":"2002","releaseDate":"20020310","directors":[{"name":"Gavin Millar","id":"nm0587669"}],"writers":[{"name":"Gregory Maguire","id":"nm0536579"},{"name":"Gene Quintano","id":"nm0704164"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMTUxMjcxNl5BMl5BanBnXkFtZTYwMjM0NjA3._V1.jpg","countries":["Canada","Luxembourg"],"languages":["English"],"genres":["Animation","Action","Adventure","Comedy","Drama","Family","Fantasy","Musical"],"plot":"In this variation on Cinderella, Margarethe Fisher Van Den Meer is a former lady of means who had to accept a position as housekeeper, but manages to spike her Master Schoenmacker's drink and marry him; alas his shipment of priceless tulips turns worthless overnight, so their last chance is to marry of one of either's daughters, hopefully to the prince for whom the Dowager Queen Maria de Medici throws a great ball. Both Iris Fisher -who is in love with painter Casper for whose master she sat as a model- and Clara Van Den Meer make a good impression...","simplePlot":"A look at the classic \"Cinderella\" story from the perspective of one of her 'ugly' stepsisters","actors":[{"actorName":"Stockard Channing","urlProfile":"http://www.imdb.com/name/nm0000330","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyOTc0NDQ4NV5BMl5BanBnXkFtZTYwODYyMjA0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1944","placeOfBirth":" New York City, New York, USA","birthName":"Susan Williams Antonia Stockard","height":"5' 3\" (1.6 m)","bio":"One of Broadway and Hollywood's cleverer talents who tends to shine a smart, cynical light on her surroundings, Stockard Channing was born Susan Williams Antonia Stockard on February 13, 1944, in New York City, to a Catholic family, with English and Irish ancestry. The daughter of Lester Napier Stockard, a well-to-do shipping executive, and Mary Alice (née English) Stockard, her father died when she was 16 and left her a sizable estate. She grew up in Brooklyn and attended the prolific Chapin School in NYC, then later attended the Madeira School, a Virginia boarding school for girls. She studied at Radcliffe College where she majored in both literature and history before graduating summa cum laude in 1965. In 1964, at the age of 20, she married the first of four husbands, Walter Channing Jr., a businessman whose last name she kept as part of her own stage moniker after their divorce four years later. Stockard made her stage debut in a production of \"The Investigation\" at the experimental Theatre Company of Boston in 1966. She went on to play a number of offbeat roles with the company. She eventually migrated to New York where she took her first Broadway bow as a chorus member and understudy in the musical version of \"Two Gentlemen of Verona\" in 1971. Two years later she would take over the prime role of Julia in the L.A. national company. Other theater roles during this time included \"Adaptation/Next\" (1970) \"Arsenic and Old Lace\" (1970), \"Play Strindberg\" (1971) and \"No Hard Feelings\" (1973). Somewhat plaintive yet unique-looking, the dark-haired actress began first appearing in pictures with small parts in the dark comedy The Hospital (1971) and the edgy Barbra Streisand fantasy-drama Up the Sandbox (1972). Taking on the top female lead as an heiress and potential victim of shysters Jack Nicholson and Warren Beatty in Mike Nichols' comedy The Fortune (1975), the film, despite its male star power, would not become the star-making hit for Channing as initially hoped and Channing. Her next two films (The Big Bus (1976) and Sweet Revenge (1976)) faded away even quicker. Earlier, however, she hit a home with the TV-movie The Girl Most Likely to... (1973), a clever black comedy written by Joan Rivers wherein Stockard played a former ugly duckling-turned-beauty (à la plastic surgery) who knocks off the men who formerly mistreated her. This was Channing at her smart and cynical best, traits that would carry her far in Hollywood. At the age of 33(!), she was handed the feisty role of high school teen Betty Rizzo in the box-office film version of the hit musical Grease (1978) starring Olivia Newton-John and John Travolta. While long in the tooth for such a role (as were others), Stockard's sly performance earned her the People's Choice Awards for Favorite Motion Picture Supporting Actress. This popular film clinched her place as a top-ranking contender. As a result, she was handed two sitcom vehicles within a year on CBS: Stockard Channing in Just Friends (1979), as a newly-separated wife starting life anew in another city (L.A.), and The Stockard Channing Show (1980), which again cast her as a divorced lady trying to find herself again in L.A. Neither made her a TV star. Both failed to catch on and lasted but a few months. Stalled at a critical juncture in her career, Stockard decided to return to her first love -- the theater. With \"Vanities\", \"Absurd Person Singular\" and \"As You Like It\" (as Rosalind) already on her resume, she earned fine notices on Broadway with the musical \"They're Playing Our Song\" replacing Lucie Arnaz in 1980, then garnered rave reviews in the part of the mother of a developmentally disabled child in the New Haven production of Peter Nichols' \"A Day in the Death of Joe Egg\" in 1982. She repeated her role on Broadway a few years later (the title now shortened to \"Joe Egg\") and copped the 1985 Tony Award for Best Actress in a Play. Subsequent Tony nominations came her way for her offbeat work in \"The House of Blue Leaves\" (1986); \"Six Degrees of Separation\" (1991) (for which she also won an Off-Broadway Obie), \"Four Baboons Adoring the Sun\" (1992); and for her Eleanor of Aquitaine in \"The Lion in Winter\" in 1999. Award-worthy projects came her way on TV as well. Nominated for an Emmy for the CBS miniseries Echoes in the Darkness (1987), she also won a CableACE Award for her work in Tidy Endings (1988). In film, she received Oscar and Golden Globe nominations when her stage triumph, Six Degrees of Separation (1993), was turned into a film and also received the London Film Critics Circle Award for Best Actress in the film _Business of Strangers, The (2001). In 1999, Stockard became a recurring member of the cast of The West Wing (1999) as First Lady Abigail Bartlet. Audiences were so drawn to her shrewd, classy character that producers wisely started featuring her regularly into the third season. In 2002 she won both Emmy and SAG awards for this role, as well as a second Emmy that same year for her supporting turn as Judy Sheppard in The Matthew Shepard Story (2002), a docudrama about the gay-bashing murder of young Matthew Shepard. Stockard thought she finally found sitcom success with the series Out of Practice (2005) and was even Emmy-nominated for her role as a sharp-tongued but caring doctor. As luck would have it, she again couldn't find a core audience and the show lasted but a mere season. Stockard continues to excel in sly, worldly roles that combine a dark wit with an even darker cynical edge. True to form, she recently completed a picture aptly titled Multiple Sarcasms (2010). Divorced four times, including one to writer/producer David Debin, she has no children. She has been in a long-term relationship with cinematographer Daniel Gillham since 1988. A sister, Lesly Stockard Smith, became mayor of Palm Beach in 2000.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyOTc0NDQ4NV5BMl5BanBnXkFtZTYwODYyMjA0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000330","name":"Stockard Channing","idIMDB":"nm0000330"},"actorId":"nm0000330","character":"Margarethe Fisher Van Den Meer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Azura Skye","urlProfile":"http://www.imdb.com/name/nm0005439","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NDkzNjU3MV5BMl5BanBnXkFtZTgwMDgyNDY0NzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 November 1981","placeOfBirth":" Northridge, Los Angeles, California, USA","birthName":"Azura Dawn Storozynski","height":"5' 7\" (1.7 m)","bio":"Azura Skye was born on November 8, 1981 in Northridge, Los Angeles, California, USA as Azura Dawn Storozynski. She is an actress, known for Bandits (2001), 28 Days (2000) and Dragon rouge (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NDkzNjU3MV5BMl5BanBnXkFtZTgwMDgyNDY0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005439","name":"Azura Skye","idIMDB":"nm0005439"},"actorId":"nm0005439","character":"Iris Fisher","urlCharacter":"http://www.imdb.com/character/ch0166335","main":true},{"actorName":"Trudie Styler","urlProfile":"http://www.imdb.com/name/nm0836548","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNzMyMTQzMV5BMl5BanBnXkFtZTYwMTQ1OTI4._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 January 1954","placeOfBirth":" Bromsgrove, Worcestershire, England, UK","bio":"Trudie Styler was born on January 6, 1954 in Bromsgrove, Worcestershire, England. She is an actress and producer, known for Snatch (2000), Lock, Stock and Two Smoking Barrels (1998) and Filth (2013). She has been married to Sting since August 20, 1992. They have four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNzMyMTQzMV5BMl5BanBnXkFtZTYwMTQ1OTI4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0836548","name":"Trudie Styler","idIMDB":"nm0836548"},"actorId":"nm0836548","character":"Fortune Teller","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emma Poole","urlProfile":"http://www.imdb.com/name/nm0690832","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNDg4NTE1Nl5BMl5BanBnXkFtZTYwNzgyMTcy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Emma Poole was born in London, England. She is an actress, known for Everything We Are (2006), Soho Square (2000) and Ella and the Mothers (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNDg4NTE1Nl5BMl5BanBnXkFtZTYwNzgyMTcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0690832","name":"Emma Poole","idIMDB":"nm0690832"},"actorId":"nm0690832","character":"Ruth Fisher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jenna Harrison","urlProfile":"http://www.imdb.com/name/nm0365650","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjlmNzA3OTEtY2U4MS00NjI2LWJmMDEtM2UyMzhlYThkZmVmL2ltYWdlXkEyXkFqcGdeQXVyMjAwODA4MjI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1981","placeOfBirth":" UK","height":"5' 7\" (1.7 m)","bio":"Jenna Harrison is a British actress, she was born and raised in Gorleston, Norfolk, England. Jenna's career on screen came about while at sixth form college. Actor 'Adrian Rawlins' suggested she audition for the feature film 'My Brother Tom' co- starring Ben Whishaw. Jenna won the role. Roles in television and film followed including 'The Cambridge Spies' for the BBC, independent feature 'Telling Lies' with Jason Flemyng, and submarine drama 'Submerged' starring Sam Neil. Other television works include: 'Endeavour' (ITV), 'Jonothan Creek Christmas Special' (BBC), 'Rosemary and Thyme' (ITV), and 'The Impressions Show' (BBC). She has played leading roles in adaptations of 'Stranded' and 'Confessions of an Ugly Stepsister' for Hallmark and '12 Days of Terror' for CBS. Theatre roles include playing 'Charlotte Goodall' in 'Night of the Iguana' at the West End's Lyric Theatre with Woody Harrelson. Most recently Jenna has starred in Sci Fi thriller 'Chimera' opposite Kathleen Quinlan and Henry Ian Cusick and 'Servants Quarters' a psychological drama to be released in 2016.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjlmNzA3OTEtY2U4MS00NjI2LWJmMDEtM2UyMzhlYThkZmVmL2ltYWdlXkEyXkFqcGdeQXVyMjAwODA4MjI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0365650","name":"Jenna Harrison","idIMDB":"nm0365650"},"actorId":"nm0365650","character":"Clara Van Den Meer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jonathan Pryce","urlProfile":"http://www.imdb.com/name/nm0000596","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NTQ3OTcwNl5BMl5BanBnXkFtZTgwNTE2MDU2ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1947","placeOfBirth":" Holywell, Flintshire, Wales, UK","birthName":"John Price","height":"6' (1.83 m)","bio":"From Holywell to Hollywood, Jonathan Pryce, CBE is a critically acclaimed and award winning actor from North Wales, internationally regarded as the one of greatest ones both on stage and screen. Renowned for his immense versatility and powerful presence he has transcended the industry, effortlessly moving between Hollywood studio films and the classical West End in a range of work that also includes bold independent cinema and the Broadway musical. He has created some of the most memorable characters in cinema and for over forty years been on the wish list of many of the worlds most notorious and accomplished directors as 'Someone they must work with'. Jonathan, after graduating from the world famous RADA in London, began his career in the 1970's at the hugely influential Liverpool Everyman Theatre which grounded his politics and talent and helped attract a legacy of brave individual artists that have since been through their doors. From his definitive performance as Hamlet, he made his breakthrough screen performance in Terry Gilliam's masterpiece Brazil (1985). The phrase an 'Actors Actor' is often overused but with Jonathan Pryce I can think of no better fitting tribute because what that means to the industry is - here is a talent people want to watch and people want to work with. His choices can be considered as bold as they should be as well as always truthful that give life to characters multi-layered and always exciting, where it can be even hard to believe that he is just one man. As in his stage course that includes notable performances such as in \"Hamlet\", \"The Merchant of Venice\", \"The Goat or Who is Sylvia?\", \"The Taming of the Shrew\", \"Miss Saigon\", \"Oliver\", \"Comedians\" and \"King Lear\", Jonathan Pryce's range of staggering portrayals full of generously euphoric delight has also been expressed in films such as Brazil (1985), Glengarry Glen Ross (1992), The Age of Innocence (1993), Carrington (1995), Evita (1996), Behind the Lines (1997), Tomorrow Never Dies (1997), Very Annie Mary (2001), Unconditional Love (2002) and Pirates of the Caribbean: Dead Man's Chest (2006) as well as in mesmerizing TV roles such as in Roger Doesn't Live Here Anymore (1981), Game of Thrones (2011), My Zinc Bed (2008), Wolf Hall (2015) and Taboo (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NTQ3OTcwNl5BMl5BanBnXkFtZTgwNTE2MDU2ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000596","name":"Jonathan Pryce","idIMDB":"nm0000596"},"actorId":"nm0000596","character":"Master Schoenmacker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matthew Goode","urlProfile":"http://www.imdb.com/name/nm0328828","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MzY2NjE0Nl5BMl5BanBnXkFtZTYwMDkxMDY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 April 1978","placeOfBirth":" Exeter, Devon, England, UK","birthName":"Matthew William Goode","height":"6' 2\" (1.88 m)","bio":"Matthew William Goode (born 3 April 1978) is an English actor. His films include Chasing Liberty (2004), Match Point (2005), Imagine Me and You (2006), Brideshead Revisited (2008), Watchmen (2009), A Single Man (2009), Leap Year (2010), Stoker (2013) and The Imitation Game (2014). Goode also starred in in the final season of Downton Abbey and in the CBS legal drama The Good Wife as Finley \"Finn\" Polmar from 2014 to 2015. Goode was born in Exeter, Devon. His father is a geologist and his mother, Jennifer, is a nurse and amateur theatre director. Goode is the youngest of five children with a brother, two half brothers, and a half sister, television presenter Sally Meen, from his mother's previous marriage. He grew up in the village of Clyst St. Mary, near Exeter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MzY2NjE0Nl5BMl5BanBnXkFtZTYwMDkxMDY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0328828","name":"Matthew Goode","nicknames":["Goodey"],"idIMDB":"nm0328828"},"actorId":"nm0328828","character":"Casper","urlCharacter":"http://www.imdb.com/character/ch0148512","main":true},{"actorName":"David Westhead","urlProfile":"http://www.imdb.com/name/nm0922751","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MDE1NzMwN15BMl5BanBnXkFtZTcwMjU0OTI2MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1963","placeOfBirth":" UK","bio":"David Westhead studied drama at Bristol University before going on to RADA,from where he graduated in 1987. He was offered understudy roles with the Royal Shakespeare Company but turned them down as he was convinced he had a job with Edinburgh's Traverse Theatre. In the event this fell through and he joined the grandly named Actors' Touring Company,which toured but in which three men played all the roles. Since then he has indeed performed with the Royal Shakespeare Company but in leading roles,as well as in virtually all the television murder mystery series in Britain. In 2002 he and two colleagues founded Wilton Pictures,a production company specialising in making documentaries. Also a lecturer in drama it was whilst he was teaching in South Africa that he met a group of disadvantaged youngsters with potential as photographers. Consequently,along with professional photographer John Cole - who,like David,lives in Brighton - he set about putting them on an eight week crash course in photography,enabling them to make a professional living from it. The exhibition of their work,entitled Wembley To Soweto was exhibited at London's South Bank in July 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MDE1NzMwN15BMl5BanBnXkFtZTcwMjU0OTI2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0922751","name":"David Westhead","idIMDB":"nm0922751"},"actorId":"nm0922751","character":"Van Den Meer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Malcolm Tierney","urlProfile":"http://www.imdb.com/name/nm0862939","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NzUwODkxOF5BMl5BanBnXkFtZTcwOTMwNjAyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 February 1938","placeOfBirth":" Manchester, England, UK","bio":"Malcolm Tierney was born on February 25, 1938 in Manchester, England. He was an actor, known for Braveheart (1995), The Saint (1997) and Lovejoy (1986). He was married to Andrea Schinko. He died on February 18, 2014 in the UK.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NzUwODkxOF5BMl5BanBnXkFtZTcwOTMwNjAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0862939","name":"Malcolm Tierney","idIMDB":"nm0862939"},"actorId":"nm0862939","character":"Van Stolk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Dexter","urlProfile":"http://www.imdb.com/name/nm0223316","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTE1NjEzMl5BMl5BanBnXkFtZTgwNTQwMjg2NzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Mark Dexter is a British actor, classically trained at the Royal Academy of Dramatic Art in London. Dexter's early successes were on stage, in particular with two high-profile productions of Tennessee Williams plays, beginning with Sam Mendes' 1995 Olivier Award winning production of The Glass Menagerie at the Donmar Warehouse, in which he played The Gentleman Caller. Since then, Dexter has moved primarily into film and television. Among an extensive list of British TV credits, he is probably best known in his home country for playing Timothy Gray in the 1950s set ITV crime drama The Bletchley Circle opposite screen wife Anna Maxwell Martin, and for the devious Sun Hill CPS lawyer Matt Hinckley in ITV's The Bill, a role he played from 2006-07. Between October 2008 and January 2009, Dexter made regular appearances in America on NBC, playing the role of Samuel Tuffley in eight episodes of Crusoe, a major 12-part mini-series. In December 2012 in the UK Dexter appeared as the principal villain 'Sir Arthur Donaldson' in the opening episode of the BBC's Victorian crime drama 'Ripper Street'.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTE1NjEzMl5BMl5BanBnXkFtZTgwNTQwMjg2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0223316","name":"Mark Dexter","idIMDB":"nm0223316"},"actorId":"nm0223316","character":"The Prince","urlCharacter":"http://www.imdb.com/character/ch0480480","main":true},{"actorName":"Helen Lindsay","urlProfile":"http://www.imdb.com/name/nm0512229","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3ODMyMzc4N15BMl5BanBnXkFtZTYwODI0NjA3._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1929","placeOfBirth":" Coimbatore, India","birthName":"Helen Jane Charley","height":"5' 5½\" (1.66 m)","bio":"Helen Lindsay was born in 1929 in Coimbatore, India as Helen Jane Charley. She is an actress, known for Mission: Impossible (1996), Darling (1965) and The Wedding Date (2005). She was previously married to Alan Pickford.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3ODMyMzc4N15BMl5BanBnXkFtZTYwODI0NjA3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0512229","name":"Helen Lindsay","idIMDB":"nm0512229"},"actorId":"nm0512229","character":"Dowager Queen Maria de Medici","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Janine Horsburgh","urlProfile":"http://www.imdb.com/name/nm1141590","urlPhoto":"","biography":{"birthName":"Janine Wilson","height":"5' 9¼\" (1.76 m)","bio":"Janine Horsburgh was born as Janine Wilson. She is an actress, known for JCVD (2008), Bride Flight (2008) and Belle du Seigneur (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1141590","name":"Janine Horsburgh","idIMDB":"nm1141590"},"actorId":"nm1141590","character":"The Tutor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ann Overstall Comfort","urlProfile":"http://www.imdb.com/name/nm0173797","urlPhoto":"","biography":{"dateOfBirth":"27 January 1939","placeOfBirth":" Liverpool, England, UK","height":"5' 6\" (1.68 m)","bio":"Ann Overstall Comfort was born on January 27, 1939 in Liverpool, England. She is an actress, known for Hysteria (2011), Le voleur de Venise (2006) and 8 ½ Women (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0173797","name":"Ann Overstall Comfort","idIMDB":"nm0173797"},"actorId":"nm0173797","character":"Dame Pruyn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Bearne","urlProfile":"http://www.imdb.com/name/nm0063999","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2E5NTQxOTItYWZlOC00OTM4LThjY2EtN2E4Y2FjNTlmM2EzL2ltYWdlXkEyXkFqcGdeQXVyMTIzNjg5ODg@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"bio":"Chris Bearne is an actor and producer, known for Mortdecai (2015), Renaissance (2006) and Put Down (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2E5NTQxOTItYWZlOC00OTM4LThjY2EtN2E4Y2FjNTlmM2EzL2ltYWdlXkEyXkFqcGdeQXVyMTIzNjg5ODg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0063999","name":"Chris Bearne","idIMDB":"nm0063999"},"actorId":"nm0063999","character":"Doctor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pieter Riemens","urlProfile":"http://www.imdb.com/name/nm0726263","urlPhoto":"","biography":{"bio":"Pieter Riemens is an actor, known for The Merchant of Venice (2004), An American Werewolf in Paris (1997) and Twin Sisters (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0726263","name":"Pieter Riemens","idIMDB":"nm0726263"},"actorId":"nm0726263","character":"Merchant","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0267384","urlIMDB":"http://www.imdb.com/title/tt0267384","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.9","filmingLocations":[{"location":"Luxembourg"}],"awards":[],"votes":"829","type":"TV Episode","seasonInfo":{"tvSerie":{"name":"The Wonderful World of Disney","id":"tt0132666"},"season":"Season 5","episode":"Episode 8"},"companyCreditsSimple":[{"idCompany":"co0054762","name":"Alliance Atlantis Communications"},{"idCompany":"co0022758","name":"Delux Productions"},{"idCompany":"co0068909","name":"Glass Slipper Productions"}],"keywords":{"keywords":["cinderella","retelling","fairy tale","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:03:46"}}