{"data":{"movies":[{"title":"How to Go Out on a Date in Queens","originalTitle":"","year":"2006","releaseDate":"20060728","directors":[{"name":"Michelle Danner","id":"nm0200403"}],"writers":[{"name":"Richard Vetere","id":"nm0895387"},{"name":"Richard Vetere","id":"nm0895387"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BODgzMTMyNzY2Ml5BMl5BanBnXkFtZTcwODg1MzMzMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"Three relationships turn sour during dinner at a popular eatery: A self-proclaimed dating expert persuades his friend, who lost his young wife three years earlier, to go out on a date, which turns out to be disastrous; the restaurant's manager learns that her boyfriend is going to bet their entire savings on the Super Bowl that night instead of proposing to her; and a bookie takes his mistress out for dinner and tells her that he is being targeted by the Russian Mafia.","simplePlot":"A self-proclaimed dating expert tries to get his best friend, who lost his wife two years earlier, back into the dating scene, with disastrous results.","actors":[{"actorName":"Jason Alexander","urlProfile":"http://www.imdb.com/name/nm0004517","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNzMyMDY1OV5BMl5BanBnXkFtZTcwMDU3NjYyMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 September 1959","placeOfBirth":" Newark, New Jersey, USA","birthName":"Jason Scott Greenspan","height":"5' 4¼\" (1.63 m)","bio":"Jason Greenspan adopted the stage name Jason Alexander while still in high school in New Jersey. He was soon appearing in Broadway plays and movies, then in the hit TV series, Seinfeld (1989), from 1990 to 1998. Alexander also directs and produces films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNzMyMDY1OV5BMl5BanBnXkFtZTcwMDU3NjYyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004517","name":"Jason Alexander","nicknames":["Jay","Pretzel Boy"],"idIMDB":"nm0004517"},"actorId":"nm0004517","character":"Johnny","urlCharacter":"http://www.imdb.com/character/ch0119388","main":true},{"actorName":"Ruth Barrie","urlProfile":"http://www.imdb.com/name/nm1250650","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzEyMDk3NF5BMl5BanBnXkFtZTcwMjkxNzczMQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 January 1939","placeOfBirth":" Manchester, England, UK","height":"5' 1½\" (1.56 m)","bio":"Ruth Barrie was born on January 31, 1939 in Manchester, England. She is known for her work on How to Go Out on a Date in Queens (2006), Good Time Max (2007) and The Great Venice Robbery (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzEyMDk3NF5BMl5BanBnXkFtZTcwMjkxNzczMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1250650","name":"Ruth Barrie","idIMDB":"nm1250650"},"actorId":"nm1250650","character":"Stan's Mother","urlCharacter":"http://www.imdb.com/character/ch0333049","main":true},{"actorName":"Carlos M. Castillón","urlProfile":"http://www.imdb.com/name/nm1101522","urlPhoto":"","biography":{"dateOfBirth":"23 September 1982","placeOfBirth":" Los Angeles, California, USA","bio":"Carlos M. Castillón was born on September 23, 1982 in Los Angeles, California, USA. He is known for his work on Iron Man (2008), Man of Steel (2013) and Iron Man 2 (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1101522","name":"Carlos M. Castillón","idIMDB":"nm1101522"},"actorId":"nm1101522","character":"Jose","urlCharacter":"http://www.imdb.com/character/ch0119398","main":true},{"actorName":"Cliff Bemis","urlProfile":"http://www.imdb.com/name/nm0069856","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDk1ZjFiZmUtZThhYS00ZGMxLTg1NWEtNWQyNDg0YjhkNzU5XkEyXkFqcGdeQXVyMjI4NDAwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 May 1948","placeOfBirth":" Amherst, Ohio, USA","birthName":"Clifford Oliver Bemis","height":"6' 1\" (1.85 m)","bio":"Grew up on a dairy farm outside of Cleveland, in rural Elyria, OH. Cliff was a 1966 graduate of Clearview High School in Lorain, OH, and has been inducted into the CHS Distinguished Alumni Hall of Fame. He has established the Cliff Bemis Music Theatre Scholarship at Baldwin-Wallace College in Berea, OH, from which he graduated in 1970. He is also the recipient of the 1998 Alumni Merit Award. While in college, he was an active member in Alpha Tau Omega fraternity, and was inducted into the Omicron Delta Kappa Honorary Fraternity. He built an extensive and varied career in Cleveland, OH, performing musical theatre, opera, with the Cleveland Opera Co., as well as the related fields of commercial acting which included jingle singing, voice-overs, on-camera and industrial films. He also narrated with the Cleveland Orchestra for their Young People's Concerts. Cliff was one of the original cast members of the musical \"Jacques Brel Is Alive And Well And Living in Paris,\" which played for over two years on Playhouse Square in Cleveland. That show is widely recognized as the show which helped save this historic theatre district. For seven seasons, he was a regular guest artist at The Cleveland Play House. He was also a regular singer of the National Anthem for the Cleveland Indians, Browns, and Cavaliers, as well as the Cleveland National Air Show. In 1987, while performing on stage together at Kenley Players, Cliff met and became friends with actor Robby Benson (star of \"One on One,\" and the voice of the Beast in \"Beauty and the Beast,\") and his wife actress/singer Karla DeVito. They encouraged Cliff to move to LA, which he did, where he continued to build upon his career. Cliff has appeared in over 70 different TV shows including \"Law and Order, SVU,\" \"White Collar,\" \"Arliss,\" \"Married With Children,\" \"Dallas,\" \"Newhart,\" \"Beverly Hills 90210,\" \"Cheers,\" \"Coach,\" and \"Murder She Wrote\" to name a few, and was featured in the films \"Pink Cadillac\" with Clint Eastwood, \"Distinguished Gentlemen\" with Eddie Murphy, and \"Naked Gun 2 1/2.\" He co-starred in \"Reunited,\" starring Julie Hagerty of \"Airplane\" fame, starred opposite Lucie Arnaz in \"Wonderful Town,\" and co-starred opposite Gregory Harrison (Trapper John, MD.) and June Lockhart of \"Lassie\" fame in the TV movie, \"Au Pair II,\" shot on location in Prague in the Czech Republic. Cliff made his Hollywood Bowl debut, performing in the concert version of the musical \"Mame,\" starring Michelle Lee, John Schneider, Christine Ebersole, Fred Willard, and Alan Thicke. He originated the role of Ezekiel Foster/Mr. Snoring Man in Irving Berlin's \"White Christmas,\" in San Francisco, Los Angeles, Detroit, two years on Broadway and in 2011 at the Paper Mill Playhouse in Millburn, NJ. In the early 1990's, Cliff began his reign as the TV spokesperson for the IHOP restaurant chain. For ten years \"Cliff from IHOP\" was recognized all over the country, appearing in all of the TV ads, as well as making personal appearances for IHOP all over the USA and Canada, where he autographed over 75,000 \"Cliff at IHOP\" pictures. A long time supporter of law enforcement, in particular the California Highway Patrol, he is a Lifetime Member in the CHP 11-99 Foundation, and an Honorary Member of the California Association of Highway Patrolmen. Also served on the Board of Directors for the Firefighters Quest for Burn Survivors, and is an Honorary Deputy Sheriff in the Ventura County Sheriff's Department. For ten years, Cliff was also a volunteer during the Christmas holidays at The White House, serving on a team which prepares this historic home for the holidays, and met both Presidents and First Ladies Bush and Clinton on several different occasions. Cliff's musical interests have resulted in three recordings, including a Christmas CD titled \"Christmas Eve,\" featuring his vocal talents on the traditional music of the season. He has also released three instrumental CDs of favorite hymns titled \"Hear My Prayer, Vol. I, II and III.\" He resides in NYC, where he continues his acting and singing career. To find out more about Cliff and his family, adventures, and to purchase his CDs, visit his Website at www.cliffbemis.com.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDk1ZjFiZmUtZThhYS00ZGMxLTg1NWEtNWQyNDg0YjhkNzU5XkEyXkFqcGdeQXVyMjI4NDAwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0069856","name":"Cliff Bemis","idIMDB":"nm0069856"},"actorId":"nm0069856","character":"Radio Announcer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Cirigliano","urlProfile":"http://www.imdb.com/name/nm0162733","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NDIxNjgyNl5BMl5BanBnXkFtZTcwMTQ4NTgwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"John Cirigliano is known for his work on Faster (2010), Psycho Beach Party (2000) and Deterrence (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NDIxNjgyNl5BMl5BanBnXkFtZTcwMTQ4NTgwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0162733","name":"John Cirigliano","idIMDB":"nm0162733"},"actorId":"nm0162733","character":"The Birdman","urlCharacter":"http://www.imdb.com/character/ch0333047","main":true},{"actorName":"Brian T. Clancey","urlProfile":"http://www.imdb.com/name/nm2239875","urlPhoto":"","biography":{"bio":"Brian T. Clancey is an actor, known for How to Go Out on a Date in Queens (2006), Living with Uncle Ray (2006) and A Second Chance (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2239875","name":"Brian T. Clancey","idIMDB":"nm2239875"},"actorId":"nm2239875","character":"Bartender","urlCharacter":"http://www.imdb.com/character/ch0333046","main":true},{"actorName":"Michelle Danner","urlProfile":"http://www.imdb.com/name/nm0200403","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MzAyNDMyM15BMl5BanBnXkFtZTgwNjY4MzY4MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Michelle Danner is a world renowned acting coach, film and stage director, author, and teacher. Michelle has taught acting for the last 24 years and has worked with many A-List Actors privately and on set including: Chris Rock, Gerard Butler, Seth MacFarlane, Melanie Brown, Jamie Lynn Sigler, Penelope Cruz, Verne Troyer, Grant Bowler, Kate Del Castillo, Michael Pena, Isla Fisher, Common, Salma Hayek, Chris Martin, Brian McKnight, James Franco, Marcia Cross, Christian Slater, Catherine Bell, Zooey Deschanel, Gabrielle Union, Justin Chatwin, Jennifer Coolidge,Justine Wadell, Rob Estes, Rick Fox, Henry Cavill and Michelle Rodriguez and many others. Voted favorite acting coach by Backstage readers, teaching remains a passion. She was brought in for her expert coaching on the WB show The Starlet and was featured with Andy Richter on The Tonight Show with Conan O'Brien. Michelle trained extensively in Paris and New York with Stella Adler and Uta Hagen. She was the Managing Director of the Larry Moss Studio since it's inception in Los Angeles for 20 years. She is the Founding Director of Edgemar Center for the Arts and raised $1.3 million to construct the two theaters and the art gallery at the Center. At the opening ceremony, Steven Spielberg commented, \"Here we have a venue that can turn out some extremely experienced, daring and resourceful artists.\" She is currently serving as Artistic Director and teaches ongoing classes at the Michelle Danner Studio, housed at Edgemar. Her seminars are taught internationally in South America, Europe, Toronto, Vancouver, Dubai, New York, Sydney and Australia. She has taught in several cities including: Johannesburg, Cape Town, Istanbul, Paris, and Moscow. Michelle has directed and acted in over thirty plays and musicals in New York and Los Angeles. Her favorite acting credits include Tennessee William's The Rose Tattoo, which garnered LA Weekly critic's pick and five Dramalogue awards including best actress; House of Yes, Bright Ideas, Ibsen's Ghosts the world premiere of One White Crow. Her highlights at Edgemar have been pioneering new works that include The Night of the Black Cat, a world premiere and winner of the 2005 Best Musical of the Year at the Los Angeles Music Awards. She directed the world premiere of Mental the Musical, winner of several 17th Annual TicketHolder awards for acting and musical score. She wrote and directed the world premiere of You're on the Air, an improv based comedy which is in development to become a movie. She directed the west coast premiere of Hello Herman by John Buffalo Mailer and co-directed Jane Fonda in the Court of Public Opinion starring Anne Archer. Michelle also produced and acted in the award-winning short film Dos Corazones, which premiered at the Nashville Film Festival and went on to win Best Cinematography & Audience Favorite at the Malibu Film Festival. In 2006, she made her feature film directing debut How to go Out on a Date in Queens which was nominated and won four L.A. Film Awards including Best Director. It starred Jason Alexander, Esai Morales, Ron Perlman, Kimberly Williams, Rob Estes and Alison Eastwood. Her production company, All in Films, has several projects in the works: You're on the Air, The Bandit Hound II, and The Will To... In April 2011, she completed Hello Herman starring Norman Reedus (AMC's The Walking Dead), Martha Higareda, and Garrett Backstrom. The film premiered at the Hollywood Film Festival to a sold out audience and had its international premiere at the Monaco Charity Film Festival where it won the award for social relevance. It opened nationwide in June 2013 and was distributed on VOD in 100 million homes across the U.S. by Warner Brothers. She is putting the finishing touches on her acting book, The Golden Box, which will be released in the fall of2015. Her latest film, The Bandit Hound, is in post production and slated to be released in the fall of 2015.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MzAyNDMyM15BMl5BanBnXkFtZTgwNjY4MzY4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0200403","name":"Michelle Danner","idIMDB":"nm0200403"},"actorId":"nm0200403","character":"Laura","urlCharacter":"http://www.imdb.com/character/ch0119396","main":true},{"actorName":"Brian Drillinger","urlProfile":"http://www.imdb.com/name/nm0237925","urlPhoto":"","biography":{"dateOfBirth":"27 June 1960","placeOfBirth":" Brooklyn, New York, USA","bio":"Brian Drillinger was born on June 27, 1960 in Brooklyn, New York, USA. He is an actor and producer, known for Brighton Beach Memoirs (1986), I Shot a Man in Vegas (1995) and The Sound of Football (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0237925","name":"Brian Drillinger","idIMDB":"nm0237925"},"actorId":"nm0237925","character":"Stan","urlCharacter":"http://www.imdb.com/character/ch0119393","main":true},{"actorName":"Christine Dunford","urlProfile":"http://www.imdb.com/name/nm0242226","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEzNzk3NDA2N15BMl5BanBnXkFtZTgwMTc2OTk1ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Christine Mary Dunford","bio":"Born in the Bronx and trained at the Juilliard School, Ms. Dunford began her theater career in NYC. Upon graduating from Juilliard, she was cast in Joseph Papp's NY Shakespeare Festival production of Two Gentlemen of Verona at the Delacorte Theater in Central Park. Ms. Dunford spent the next two years working at Mr. Papp's Public Theater in the American premiere of Serious Money (both the off-Broadway & Broadway runs) and in the lead role of Love's Labors Lost, directed by Gerald Freedman. Other NY stage appearances include Infidelities at Primary Stages and the title role in Tamara. On the West Coast, Ms. Dunford starred with Ed Begley, Jr. in David Mamet's Cryptogram at the Geffen Playhouse, and in the Bottom's Dream Theater Company productions of Losing Venice and 7 Blow Jobs, and was directed by fellow Juilliard alum Keith David in The Shadow Box at the Edgemar Theater. Since moving to Los Angeles, Ms. Dunford has appeared in over 100 episodes of television, both as a series regular (Good Sports, Hudson Street with Tony Danza, Something So Right with Jere Burns, Bob with Bob Newhart, and The Secret Lives of Men with Brad Whitford) and as a guest star (Law & Order LA, Harry's Law, Two and a Half Men, Boston Legal, Seinfeld, Frasier, Til Death, Without a Trace and others). She also co-starred with Jon Lovitz in the live broadcast of the FOX comedy special: The Jon Lovitz Show. On film, Ms. Dunford was recently seen in American Dream, the indie award-winner directed by J. Walker Smmith, and Hello Herman, written by John Buffalo Mailer. She starred opposite Peter Fonda in the Oscar-nominated Ulee's Gold, and in Love & Basketball, Date in Queens (opposite Jason Alexander), Reversal of Fortune, Slaves of NY, and the award-winning shorts Dos Corazones and Lost People of Mountain Village, which was written and directed by the creators of The Wonder Years, Carol Black and Neal Marlens. Ms. Dunford is also a playwright, and was invited to perform her series of monologues, Out Loud, at HBO's Aspen Comedy Festival as well as at the Edgemar Theater in Los Angeles. She performed another solo show, Toucan in the Bronx, at the Improv in Los Angeles. In addition to her work on camera and stage, Ms. Dunford is a voice artist on several animated series as well as television and radio commercials. She provides narration for documentary films and museum installments, and does voice work for video and online games such as Mass Effect, Lord of the Rings, Civilizations, Dawn of War, Hitman, Everquest, Warhammer, XCOM & others.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEzNzk3NDA2N15BMl5BanBnXkFtZTgwMTc2OTk1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0242226","name":"Christine Dunford","idIMDB":"nm0242226"},"actorId":"nm0242226","character":"Ann Marie","urlCharacter":"http://www.imdb.com/character/ch0119394","main":true},{"actorName":"Jodie Edwards","urlProfile":"http://www.imdb.com/name/nm3237094","urlPhoto":"","biography":{"bio":"Jodie Edwards is an actress, known for How to Go Out on a Date in Queens (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3237094","name":"Jodie Edwards","idIMDB":"nm3237094"},"actorId":"nm3237094","character":"Girl on Bench","urlCharacter":"http://www.imdb.com/character/ch0333045","main":true},{"actorName":"Rob Estes","urlProfile":"http://www.imdb.com/name/nm0004900","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMTIyMjg4M15BMl5BanBnXkFtZTgwNDU2NjExMTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1963","placeOfBirth":" Norfolk, Virginia, USA","birthName":"Robert Alan Estes","height":"5' 11\" (1.8 m)","bio":"Rob Estes was born on July 22, 1963 in Norfolk, Virginia, USA as Robert Alan Estes. He is an actor and director, known for 90210 (2008), Melrose Place (1992) and Silk Stalkings (1991). He has been married to Erin Bolte since June 15, 2010. They have one child. He was previously married to Josie Bissett.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMTIyMjg4M15BMl5BanBnXkFtZTgwNDU2NjExMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004900","name":"Rob Estes","idIMDB":"nm0004900"},"actorId":"nm0004900","character":"Artie","urlCharacter":"http://www.imdb.com/character/ch0119390","main":true},{"actorName":"Alison Eastwood","urlProfile":"http://www.imdb.com/name/nm0002055","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MTQxMjc2OF5BMl5BanBnXkFtZTcwMDA2NTEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 May 1972","placeOfBirth":" Santa Monica, California, USA","height":"5' 8\" (1.73 m)","bio":"Alison Eastwood was born on May 22, 1972 in Santa Monica, California, USA. She is an actress and director, known for Midnight in the Garden of Good and Evil (1997), Tightrope (1984) and Absolute Power (1997). She has been married to Stacy Poitras since March 15, 2013. She was previously married to Kirk Fox.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MTQxMjc2OF5BMl5BanBnXkFtZTcwMDA2NTEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002055","name":"Alison Eastwood","idIMDB":"nm0002055"},"actorId":"nm0002055","character":"Karen","urlCharacter":"http://www.imdb.com/character/ch0119389","main":true},{"actorName":"Eric Gorman","urlProfile":"http://www.imdb.com/name/nm3060960","urlPhoto":"","biography":{"bio":"Eric Gorman is an actor, known for How to Go Out on a Date in Queens (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3060960","name":"Eric Gorman","idIMDB":"nm3060960"},"actorId":"nm3060960","character":"Towtruck Driver","urlCharacter":"http://www.imdb.com/character/ch0333044","main":true},{"actorName":"Alexandra Guarnieri","urlProfile":"http://www.imdb.com/name/nm2226227","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNTA4MjQ1OF5BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Born in Paris, Alexandra moved to the US at age 11. She speaks 4 languages fluently (French, Spanish, Italian, and English). She graduated Summa Cum Laude from Columbia University with a degree in Political Science. Upon graduation, Alexandra spent several years working in television, first at CNN then MSNBC. After spending 3 years as the Managing Director of the New York Theater Company she moved to Los Angeles. Currently, Alexandra is co-founder and managing director of Edgemar Center for the Arts. Alexandra co-produced the movie \"How To Go On A Date In Queens\" (Best Picture, Director, Actor, and Supporting Actor: LA Indie Awards). She has been the driving force behind many productions, including the widely popular French Cabaret show, \"Night of the Black Cat\" (Best Musical: 2006 LA Music Awards) and the ongoing series, Scene Bites (featured in Daily Variety). In 2007, Alexandra produced the critically acclaimed play by Henry Jaglom, \"Always but Not Forever.\" Later that year she was associate producer of the world premier musical, \"Mental.\" In addition, Alexandra produced the cutting edge political comedy \"You're On The Air,\" the world premier, zany comedy, \"Desperate Writers\" and the musical tribute to Quincy Jones and his humanitarian work. She is finishing up a successful year-long run of Henry Jaglom's runaway hit \"45 Minutes from Broadway\", in addition to reviving the highly popular \"Black Cat Cabaret\", now renamed \"Tick Tock Cabaret\", opening October 2010. She is producing \"Hello Herman\" written by John Buffalo Mailer which is in production for a feature film. Alexandra is an active member in the community. She has created and shaped various outreach programs for underprivileged children, teens, and the elderly. With a passion for art, she also curates the Edgemar Center for the Arts Art Gallery.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNTA4MjQ1OF5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2226227","name":"Alexandra Guarnieri","idIMDB":"nm2226227"},"actorId":"nm2226227","character":"Coatcheck Girl","urlCharacter":"http://www.imdb.com/character/ch0333043","main":true},{"actorName":"Diana Horowitz","urlProfile":"http://www.imdb.com/name/nm1370964","urlPhoto":"","biography":{"bio":"Diana Horowitz is an actress, known for How to Go Out on a Date in Queens (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1370964","name":"Diana Horowitz","idIMDB":"nm1370964"},"actorId":"nm1370964","character":"Hands / Water 1","urlCharacter":"http://www.imdb.com/character/ch0333042","main":true}],"seasons":[],"idIMDB":"tt0270417","urlIMDB":"http://www.imdb.com/title/tt0270417","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"05","month":"12","year":"2000","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.85 : 1 (intended ratio)"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.5","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[],"votes":"349","type":"Movie","companyCreditsSimple":[{"idCompany":"co0185464","name":"Lady Marmalade Music"}],"keywords":{"keywords":["dating","bet","restaurant","mistress","bookie","russian mafia","super bowl","gambling","infidelity","location in title","queens new york city","new york city","based on play","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:14:27"}}