{"data":{"movies":[{"title":"The Muppets Celebrate Jim Henson","originalTitle":"","year":"1990","releaseDate":"19901121","directors":[{"name":"Don Mischer","id":"nm0592687"}],"writers":[{"name":"Jerry Juhl","id":"nm0432075"},{"name":"Sara Lukinson","id":"nm0525701"}],"runtime":"47 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmUwOWE3OTUtNTczNi00OThhLThhOTEtZDU2NDk4NmRjMGIwXkEyXkFqcGdeQXVyNDUxNjc5NjY@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Documentary","Animation","Action","Biography","Comedy","Family","Music"],"plot":"'s classic Muppets put on a tribute to their creator, but also ponder the question: Who was he? To help them figure that out are some of Jim's human friends, as well as some rare clips from the Henson legacy.","simplePlot":"While prepare a tribute to the late , they learn about the life and career of the renowned puppeteer/film maker.","actors":[{"actorName":"Jim Henson","urlProfile":"http://www.imdb.com/name/nm0001345","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMzI3MjAwM15BMl5BanBnXkFtZTcwODIzMDk1OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 September 1936","placeOfBirth":" Greenville, Mississippi, USA","birthName":"James Maury Henson","height":"6' 1\" (1.85 m)","bio":"Jim Henson never thought that he would make a name of himself in puppetry; it was merely a way of getting himself on television. The vehicle that achieved it was Sam and Friends (1955), a late-night puppet show that was on after the 11:00 news in Washington DC. It proved to be very popular and inspired Jim to continue using puppets for his work. He made many commercials, developing the signature humor that Henson Productions is known for. A key reason for the success of his puppets is that Jim realized he didn't need to hide puppeteers behind a structure when they were in front of a camera. All he had to do was instruct the camera operators to focus on the puppets and keep the puppeteers out of the frame. This allowed the puppets to dominate the image and make them more lifelike. This work on puppets and television would lead to separate projects that had different goals. The first one was his work on the The Jimmy Dean Show (1963) with the character Rowlf the Dog, the oldest clearly identified character that Henson Productions still uses. This show provided an income that allowed Jim to work on a pet project. That project was Time Piece (1965), a surrealistic short about time which was nominated for best live-action short Oscar. Henson shot to prominence when he was approached to use his muppets for the revolutionary educational show Sesame Street (1969). The show was a smash hit and his characters have become staples on public television. Unforetunately, this also led to Henson being typecast as only an entertainer for children. He sought to disprove that by being part of the initial crew of Saturday Night Live (1975), but his style and that of the creative staff simply didn't jibe. It was this circumstance that encouraged him to develop a variety show format that had the kind of sophisticated humor that \"Sesame Street (1969)\" didn't work with. No American broadcaster was interested, but British producer Lew Grade was. This led to The Muppet Show (1976). It initially struggled both in the ratings and in the search for guest stars, but in the second season it became a smash hit and would eventually become the most widely watched series in television history. Hungry for a new challenge, Henson made The Muppet Movie (1979), defying the popular industry opinion that his characters would never work in a movie. The film became a hit and spawned a series of features which included the moody fantasy The Dark Crystal (1982), which was a drastic and bold departure from the amiable tone of his previous work. The most successful TV work in the 1980s was Fraggle Rock (1983), a fantasy series specifically designed to appeal to as many cultural groups as possible. During this time he also established the Creature Shop, a puppet studio that became renowned for being as brilliant with puppetry as ILM was at special effects. When he died all too soon in 1990, he was indisputably one of the geniuses of puppetry. More importantly, he was a man who achieved his phenomenal success while still retaining his social conscience and artistic integrity as his work in promoting environmentalism and his brilliant The Storyteller (1987) series respectively attest to.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMzI3MjAwM15BMl5BanBnXkFtZTcwODIzMDk1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001345","name":"Jim Henson","idIMDB":"nm0001345"},"actorId":"nm0001345","character":"Himself / Kermit the Frog / Rowlf / Dr. Teeth / Swedish Chef / Waldorf / Ernie / Guy Smiley / Link Hogthrob / Jim Henson Muppet / Mahna Mahna / Convincing John / Bugsy Them / Cantus / Muppet Newsman / Sam","urlCharacter":"http://www.imdb.com/character/ch0000604","main":true},{"actorName":"Harry Belafonte","urlProfile":"http://www.imdb.com/name/nm0000896","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MTEzNjA1NF5BMl5BanBnXkFtZTcwMzgxMDUwMg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 March 1927","placeOfBirth":" New York City, New York, USA","birthName":"Harold George Belafonte Jr.","height":"6' 2\" (1.88 m)","bio":"Harold George Belafonte was born in New York City. He attended George Washington High School, where he was on the track team. In 1944 he left high school and joined the Navy. His wife, Julie Robinson, was a featured dancer in Katherine Dunham's dance troupe. Both Harry and Julie were, and still are, extremely active in the civil rights struggle.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MTEzNjA1NF5BMl5BanBnXkFtZTcwMzgxMDUwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000896","name":"Harry Belafonte","idIMDB":"nm0000896"},"actorId":"nm0000896","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carol Burnett","urlProfile":"http://www.imdb.com/name/nm0000993","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE2OTQxODkyMV5BMl5BanBnXkFtZTYwODM5MzQz._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1933","placeOfBirth":" San Antonio, Texas, USA","birthName":"Carol Creighton Burnett","height":"5' 6½\" (1.69 m)","bio":"The entertainment world has enjoyed a five-decade love affair with comedienne/singer Carol Burnett. A peerless sketch performer and delightful, self-effacing personality who rightfully succeeded Lucille Ball as the carrot-topped \"Queen of Television Comedy,\" it was Burnett's traumatic childhood that set the stage for her comedy. Carol's rags-to-riches story started out in San Antonio, Texas, on April 26, 1933, where she was born to Jodie and Louise Burnett, both of whom suffered from acute alcoholism. As a child, she was left in the care of a beloved grandmother, who shuttled the two of them off to Hollywood, California, where they lived in a boarding house and shared a great passion for the Golden Age of movies. The plaintive, loose-limbed, highly sensitive Carol survived her wallflower insecurities by grabbing attention as a cut-up at Hollywood High School. A natural talent, she attended the University of California and switched majors from journalism to theater. Scouting out comedy parts on TV and in the theater, she first had them rolling in the aisles in the mid-1950s performing a lovelorn novelty song called \"I Made a Fool of Myself Over John Foster Dulles\" (then Secretary of State) in a nightclub act. This led to night-time variety show appearances with Jack Paar and Ed Sullivan and where the career ball really started rolling. Carol's first big TV breaks came at age 22 and 23 as a foil to a ventriloquist's dummy on the already-established The Paul Winchell Show (1950) in 1955, and as Buddy Hackett's gawky girlfriend on the short-lived sitcom Stanley (1956). She also developed an affinity for game shows and appeared as a regular on one of TV earliest, Stump the Stars (1947) in 1958. While TV would bring Carol fans by the millions, it was Broadway that set her on the road to stardom. She began as the woebegone Princess Winnifred in the 1959 Broadway musical \"Once Upon a Mattress\" which earned her first Tony Award nomination. [She would later appear in three TV adaptations - Once Upon a Mattress (1964), Once Upon a Mattress (1972) and The Wonderful World of Disney: Once Upon a Mattress (2005).] This, in turn, led to the first of an armful of Emmy Awards as a repertoire player on the popular variety series The Garry Moore Show (1958) in 1959. Burnett invented a number of scene-stealing characters during this time, most notably her charwoman character. With the phenomenal household success of the Moore show, she moved up quickly from second banana to headliner and appeared in a 1962 Emmy-winning special Julie and Carol at Carnegie Hall (1962) co-starring close friend Julie Andrews. She earned the Outer Critics Circle Award for the short-lived musical \"Fade Out, Fade In\" (1964); and made her official film debut opposite Bewitched (1964) star Elizabeth Montgomery and Dean Martin in the lightweight comedy Who's Been Sleeping in My Bed? (1963). Not surprisingly, fellow redhead Lucille Ball, who had been Carol's treasured idol growing up, subsequently became a friend and mentor to the rising funny girl. Hilarious as a guest star on The Lucy Show (1962), Carol appeared as a painfully shy (natch) wallflower type who suddenly blooms in jaw-dropping fashion. Ms. Ball was so convinced of Carol's talent that she offered Carol her own Desilu-produced sitcom, but Burnett had her heart set on fronting a variety show. With her own team of second bananas, including character crony Harvey Korman, handsome foil Lyle Waggoner, and lookalike \"kid sister\" type Vicki Lawrence, the The Carol Burnett Show (1967) became an instant sensation, and earned 22 Emmy Awards during its 11-year run. It allowed Carol to fire off her wide range of comedy and musical ammunition--whether running amok in broad sketch comedy, parodying movie icons such as Gloria Swanson, Shirley Temple, Vivien Leigh or Joan Crawford, or singing/gushing alongside favorite vocalists Jim Nabors, Steve Lawrence, Peggy Lee, Sammy Davis Jr., Ella Fitzgerald and Mel Tormé. She managed to bring in huge stars not known at all for slapstick comedy, including Rock Hudson and even then-Governor Ronald Reagan while providing a platform for such up-and-coming talent as Bernadette Peters and The Pointer Sisters In between, Carol branched out with supporting turns in the films Pete 'n' Tillie (1972), The Front Page (1974) and Robert Altman's A Wedding (1978). Her program, whose last episode aired in March of 1978, was the last truly successful major network variety show to date. Carol took on new challenges to display her unseen dramatic mettle, and accomplished this amazingly in TV-movie showcases. She earned an Emmy nomination for her gripping portrayal of anti-Vietnam War activist Peg Mullen in Friendly Fire (1979), and convincingly played a woman coming to terms with her alcoholism in Life of the Party: The Story of Beatrice (1982). Neither character bore any traces of the usual Burnett comedy shtick. Though she proved she could contain herself for films, Carol was never able to acquire crossover success into movies, despite trouper work in The Four Seasons (1981), Annie (1982) (as the hammy villainess Miss Hannigan), and Noises Off... (1992). The last two roles had been created onstage by Broadway's Dorothy Loudon. Carol would return from time to time to the stage and concert forums with productions of \"Plaza Suite\", \"I Do! I Do\", \"Follies\", \"Company\" and \"Putting It Together\". A second Tony nomination came for her comedy work in \"Moon Over Buffalo\" in 1995. Carol has made frequent appearances on her own favorite TV shows too, such as Password All-Stars (1961) (along with Elizabeth Montgomery, Carol was considered one of the show's best players) and the daytime soaper, All My Children (1970). During the early 1990s, Carol attempted a TV comeback of sorts, with a couple of new variety formats in Carol & Company (1990) and The Carol Burnett Show (1991), but neither could recreate the magic of the original. She has appeared, sporadically, on various established shows such as \"Magnum, P.I.,\" \"Touched by an Angel,\" \"Mad About You\" (for which she won an Emmy), \"Desperate Housewives,\" \"Law & Order: Special Victims Unit (Emmy nomination), \"Hawaii Five-0,\" \"Glee\" and \"Hot in Cleveland.\" Befitting such a classy clown, she has received a multitude of awards over time, including the 2003 Kennedy Center Honors and the Presidential Medal of Freedom in 2005. She was inducted into the Television Hall of Fame in 1985. Her personal life has been valiant--tears in between the laughs. Married three times, her second union with jazz-musician-turned-variety-show-producer Joe Hamilton produced three daughters. Eldest girl, Carrie Hamilton, an actress and former teen substance abuser, tragically died of lung and brain cancer at age 38. Shortly before Carrie's death, mother and daughter managed to write a play, together, entitled \"Hollywood Arms\", based on Carol's 1986 memoir, \"One More Time\". The show subsequently made it to Broadway. Today, at age 80 plus, Carol has been seen less frequently but still continues to make appearances, especially on TV. Most recently she has guested on the shows \"Hot in Cleveland\" and the new \"Hawaii Five-0\". As always she signs off a live appearance with her signature ear tug (acknowledging her late grandmother), reminding us all, between the wisecracks and the songs, how glad and lucky we all are to still have some of \"this time together\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE2OTQxODkyMV5BMl5BanBnXkFtZTYwODM5MzQz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000993","name":"Carol Burnett","idIMDB":"nm0000993"},"actorId":"nm0000993","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ray Charles","urlProfile":"http://www.imdb.com/name/nm0153124","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5Nzk0NDcyMV5BMl5BanBnXkFtZTYwNDg3OTU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 September 1930","placeOfBirth":" Albany, Georgia, USA","birthName":"Raymond Charles Robinson","height":"5' 9\" (1.75 m)","bio":"A tragic fate may have given this visionary a heightened sensitivity, perception, awareness, even expansion to his obvious musical gifts that he may have never touched upon had he not suffered from his physical affliction. Whatever it was, Ray Charles revolutionized American music and was catapulted to legendary status by the time he died in Beverly Hills at age 73. Born to Aretha and Baily Robinson, an impoverished Albany, Georgia, family that moved to Greenville, Florida while he was still an infant. It was not a cause for joy and celebration. His father soon abandoned the family and his baby brother, George Robinson, drowned in a freak washtub accident. Ray himself developed glaucoma at the age of five and within two years had lost his sight completely. A singer in a Baptist choir, he developed a love and feel for rhythms and studied music at the State School for Deaf and Blind Children, showing which brought out his talent and ear for playing various instruments, including the piano and clarinet. An orphan by his early teens, Ray joined a country band at age 16 called The Florida Playboys. He moved to Seattle in 1948 where he and Southern guitarist Gossady McGee formed the McSon Trio. With an emphasis on easy-styled jazz, Ray also played in bebop sessions on the sly. He departed from the McSon Trio and signed with Los Angeles-based Swing Time Records, becoming the pianist for rhythm and blues great Lowell Fulson and his band. Atlantic Records eventually picked him up. Along the road he would add composer, writer and arranger to his formidable list of talents. Ray's first R&B hit was \"Confession Blues\" in Los Angeles in 1949. In 1951, he had his first solo chart buster with \"Baby Let Me Hold Your Hand\". His amazing versatility and raw, soulful delivery quickly caught on with audiences and helped put Atlantic Records on the map. Hits like \"Mess Around\", \"Things I Used to Do\", \"A Fool for You\", \"I've Got a Woman\", \"Drown in My Own Tears\", and especially \"What'd I Say\" in 1959, pushed gospel and R&B to a wider crossover audience. He made a move into the country music arena--unheard of for a black singer--in the 1960s, doing soulful spins on Hank Williams and Eddy Arnold tunes. In 1960, he left Atlantic and signed with ABC-Paramount. Under ABC-Paramount, hits poured out during this peak time with \"I Can't Stop Loving You\", \"Hit the Road Jack\", \"Busted\" and his beloved signature song \"Georgia On My Mind\". His landmark 1962 album \"Modern Sounds in Country and Western Music\" brought a new swinging style to country music. From there, he traveled a mainstream route--from interpreting songs from The Beatles (\"Eleanor Rigby\") to appearing in \"Diet Pepsi\" ads (\"You Got the Right One, Baby, Uh-huh!\"). He also showed up sporadically in films, playing himself in the movie Ballad in Blue (1965) and guest-starring in The Blues Brothers (1980) with Dan Aykroyd and John Belushi. A television musical variety favorite with his trademark dark sunglasses and dry humor, he worked alongside such musical legends as Ella Fitzgerald and Barbra Streisand on their very special evenings of song. It is hard to believe that with everything he accomplished, Ray also had to deal with a longstanding heroin problem. In the mid-1960s, he was arrested for possession of heroin and marijuana and revealed that he had been addicted for nearly two decades. By 1965, he had completely recovered. The man who lived life on the edge was divorced twice and had 12 children both in and outside his marriages. At the time of his death from liver disease in 2004, he was working on a recording project of duets with such performers as Willie Nelson, Bonnie Raitt, B.B. King, Elton John and Norah Jones. This collaboration entitled \"Genius Loves Company\" led to an incisive win at the Grammy Awards--eight posthumous trophies including \"Album of the Year\" and \"Record of the Year\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5Nzk0NDcyMV5BMl5BanBnXkFtZTYwNDg3OTU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0153124","name":"Ray Charles","nicknames":["The Genius of Soul","Brother Ray","The High Priest"],"idIMDB":"nm0153124"},"actorId":"nm0153124","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Denver","urlProfile":"http://www.imdb.com/name/nm0000135","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNjM1MDczMV5BMl5BanBnXkFtZTcwNTY4ODAzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1943","placeOfBirth":" Roswell, New Mexico, USA","birthName":"Henry John Deutschendorf Jr.","height":"5' 10\" (1.78 m)","bio":"His birth occurred on Friday, December 31st, 1943, as the son of an Air Force officer, Denver was constantly moved from state to state and country to country. It was in Tucson, Arizona, that his grandmother gave him his first acoustic guitar, a gift that would prove an icebreaker when meeting other students at the many new schools in which he was placed. After settling with his family in Fort Worth, Texas, Denver ran away to California for a short time. He returned to Texas and graduated from high school, but soon returned to California on a more permanent basis. He began performing at Leadbetter's night club in West Los Angeles but had a major career breakthrough when he was selected to replace the departing Chad Mitchell of The Chad Mitchell Trio. He remained with that organization until 1968 when he struck out on his own. From 1969 through 1975, Denver was the top-selling recording artist, appearing on both country and pop charts alike. His peak year was 1975, during which he was awarded the Country Music Association's Entertainer of the Year in addition to being selected as the American Guild of Variety Artists' Singing Star of the Year. During this period, he tried his hand at acting, appearing as Deputy Dewey Cobb in a 1973 episode of McCloud (1970) and hosting Day of the Bighorn (1974), an ecologically-minded television special. His most memorable role came in 1977 when he starred opposite George Burns in the hit comedy, Oh, God! (1977). Following this, his record sales began to decline, and he made fewer movies and television specials. He became something of a political activist, with his main focus being on environmental issues. He was killed on Sunday, October 12th, 1997, (505 years after Christopher Columbus' discovery of North America) when the plane he was piloting crashed into Monterey Bay. John Denver's lifetime: 19,616 days (2,802 weeks & 2 days).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNjM1MDczMV5BMl5BanBnXkFtZTcwNTY4ODAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000135","name":"John Denver","idIMDB":"nm0000135"},"actorId":"nm0000135","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steven Spielberg","urlProfile":"http://www.imdb.com/name/nm0000229","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NjAzNzE1MV5BMl5BanBnXkFtZTYwNTk0ODc0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1946","placeOfBirth":" Cincinnati, Ohio, USA","birthName":"Steven Allan Spielberg","height":"5' 7½\" (1.71 m)","bio":"Undoubtedly one of the most influential film personalities in the history of film, Steven Spielberg is perhaps Hollywood's best known director and one of the wealthiest filmmakers in the world. Spielberg has countless big-grossing, critically acclaimed credits to his name, as producer, director and writer. Steven Allan Spielberg was born in 1946 in Cincinnati, Ohio, to Leah Frances (Posner), a concert pianist and restaurateur, and Arnold Spielberg, an electrical engineer who worked in computer development. His parents were both born to Russian Jewish immigrant families. Steven spent his younger years in Haddon Township, New Jersey, Phoenix, Arizona, and later Saratoga, California. He went to California State University Long Beach, but dropped out to pursue his entertainment career. He gained notoriety as an uncredited assistant editor on the classic western Wagon Train (1957). Among his early directing efforts were Battle Squad (1961), which combined World War II footage with footage of an airplane on the ground that he makes you believe is moving. He also directed Escape to Nowhere (1961), which featured children as World War Two soldiers, including his sister Anne Spielberg, and The Last Gun (1959), a western. All of these were short films. The next couple of years, Spielberg directed a couple of movies that would portend his future career in movies. In 1964, he directed Firelight (1964), a movie about aliens invading a small town. In 1967, he directed Slipstream (1967), which was unfinished. However, in 1968, he directed Amblin' (1968), which featured the desert prominently, and not the first of his movies in which the desert would feature so prominently. Amblin' also became the name of his production company, which turned out such classics as E.T. the Extra-Terrestrial (1982). Spielberg had a unique and classic early directing project, Duel (1971), with Dennis Weaver. In the early 1970s, Spielberg was working on TV, directing among others such series as Rod Serling's Night Gallery (1969), Marcus Welby, M.D. (1969) and Columbo: Murder by the Book (1971). All of his work in television and short films, as well as his directing projects, were just a hint of the wellspring of talent that would dazzle audiences all over the world. Spielberg's first major directorial effort was The Sugarland Express (1974), with Goldie Hawn, a film that marked him as a rising star. It was his next effort, however, that made him an international superstar among directors: Jaws (1975). This classic shark attack tale started the tradition of the summer blockbuster or, at least, he was credited with starting the tradition. His next film was the classic Close Encounters of the Third Kind (1977), a unique and original UFO story that remains a classic. In 1978, Spielberg produced his first film, the forgettable I Wanna Hold Your Hand (1978), and followed that effort with Used Cars (1980), a critically acclaimed, but mostly forgotten, Kurt Russell\\\\Jack Warden comedy about devious used-car dealers. Spielberg hit gold yet one more time with Raiders of the Lost Ark (1981), with Harrison Ford taking the part of Indiana Jones. Spielberg produced and directed two films in 1982. The first was Poltergeist (1982), but the highest-grossing movie of all time up to that point was the alien story E.T. the Extra-Terrestrial (1982). Spielberg also helped pioneer the practice of product placement. The concept, while not uncommon, was still relatively low-key when Spielberg raised the practice to almost an art form with his famous (or infamous) placement of Reece's Pieces in \"E.T.\" Spielberg was also one of the pioneers of the big-grossing special-effects movies, like \"E.T.\" and \"Close Encounters\", where a very strong emphasis on special effects was placed for the first time on such a huge scale. In 1984, Spielberg followed up \"Raiders\" with Indiana Jones and the Temple of Doom (1984), which was a commercial success but did not receive the critical acclaim of its predecessor. As a producer, Spielberg took on many projects in the 1980s, such as The Goonies (1985), and was the brains behind the little monsters in Gremlins (1984). He also produced the cartoon An American Tail (1986), a quaint little animated classic. His biggest effort as producer in 1985, however, was the blockbuster Back to the Future (1985), which made Michael J. Fox an instant superstar. As director, Spielberg took on the book The Color Purple (1985), with Whoopi Goldberg and Oprah Winfrey, with great success. In the latter half of the 1980s, he also directed Empire of the Sun (1987), a mixed success for the occasionally erratic Spielberg. Success would not escape him for long, though. The late 1980s found Spielberg's projects at the center of pop-culture yet again. In 1988, he produced the landmark animation/live-action film Who Framed Roger Rabbit (1988). The next year proved to be another big one for Spielberg, as he produced and directed Always (1989) as well as Indiana Jones and the Last Crusade (1989), and Back to the Future Part II (1989). All three of the films were box-office and critical successes. Also, in 1989, he produced the little known comedy-drama Dad (1989), with Jack Lemmon and Ted Danson, which got mostly mixed results. Spielberg has also had an affinity for animation and has been a strong voice in animation in the 1990s. Aside from producing the landmark \"Who Framed Roger Rabbit\", he produced the animated series Tiny Toon Adventures (1990), Animaniacs (1993), Pinky and the Brain (1995), Freakazoid! (1995), Pinky, Elmyra & the Brain (1998), Family Dog (1993) and Toonsylvania (1998). Spielberg also produced other cartoons such as The Land Before Time (1988), We're Back! A Dinosaur's Story (1993), Casper (1995) (the live action version) as well as the live-action version of The Flintstones (1994), where he was credited as \"Steven Spielrock\". Spielberg also produced many Roger Rabbit short cartoons, and many Pinky and the Brain, Animaniacs and Tiny Toons specials. Spielberg was very active in the early 1990s, as he directed Hook (1991) and produced such films as the cute fantasy Joe Versus the Volcano (1990) and An American Tail: Fievel Goes West (1991). He also produced the unusual comedy thriller Arachnophobia (1990), Back to the Future Part III (1990) and Gremlins 2: The New Batch (1990). While these movies were big successes in their own right, they did not quite bring in the kind of box office or critical acclaim as previous efforts. In 1993, Spielberg directed Jurassic Park (1993), which for a short time held the record as the highest grossing movie of all time, but did not have the universal appeal of his previous efforts. Big box-office spectacles were not his only concern, though. He produced and directed Schindler's List (1993), a stirring film about the Holocaust. He won best director at the Oscars, and also got Best Picture. In the mid-90s, he helped found the production company DreamWorks, which was responsible for many box-office successes. As a producer, he was very active in the late 90s, responsible for such films as The Mask of Zorro (1998), Men in Black (1997) and Deep Impact (1998). However, it was on the directing front that Spielberg was in top form. He directed and produced the epic Amistad (1997), a spectacular film that was shorted at the Oscars and in release due to the fact that its release date was moved around so much in late 1997. The next year, however, produced what many believe was one of the best films of his career: Saving Private Ryan (1998), a film about World War Two that is spectacular in almost every respect. It was stiffed at the Oscars, losing best picture to Shakespeare in Love (1998). Spielberg produced a series of films, including Evolution (2001), Hantise (1999) and Shrek (2001). he also produced two sequels to Jurassic Park (1993), which were financially but not particularly critical successes. In 2001, he produced a mini-series about World War Two that definitely *was* a financial and critical success: Band of Brothers (2001), a tale of an infantry company from its parachuting into France during the invasion to the Battle of the Bulge. Also in that year, Spielberg was back in the director's chair for A.I. Artificial Intelligence (2001), a movie with a message and a huge budget. It did reasonably at the box office and garnered varied reviews from critics. Spielberg has been extremely active in films there are many other things he has done as well. He produced the short-lived TV series SeaQuest 2032 (1993), an anthology series entitled Amazing Stories (1985), created the video-game series \"Medal of Honor\" set during World War Two, and was a starting producer of ER (1994). Spielberg, if you haven't noticed, has a great interest in World War Two. He and Tom Hanks collaborated on Shooting War (2000), a documentary about World War II combat photographers, and he produced a documentary about the Holocaust called Eyes of the Holocaust (2000). With all of this to Spielberg's credit, it's no wonder that he's looked at as one of the greatest ever figures in entertainment.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NjAzNzE1MV5BMl5BanBnXkFtZTYwNTk0ODc0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000229","name":"Steven Spielberg","idIMDB":"nm0000229"},"actorId":"nm0000229","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Oz","urlProfile":"http://www.imdb.com/name/nm0000568","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NTM4ODA0OV5BMl5BanBnXkFtZTYwODMxMjQ0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1944","placeOfBirth":" Hereford, England, UK","birthName":"Frank Richard Oznowicz","height":"6' 2\" (1.88 m)","bio":"Frank Richard Oznowicz was born in Hereford, England to puppeteers Frances and Isidore Oznowicz. His family moved to Montana in 1951, eventually settling in Oakland, California. As a teenager, he worked as an apprentice puppeteer at Children's Fairyland amusement park. He is one of the primary puppeteers responsible for the development of Jim Henson's Sesame Street (1969) and _\"The Muppet Show\" (1976)_ as well as over 75 other Muppet productions. 'George Lucas' originally contacted Henson to play the part of Yoda in Star Wars: Episode V - The Empire Strikes Back (1980), but he recommended Oz for the part instead. He developed the character's trademark syntax, returning to voice and puppet the Jedi Master in Star Wars: Episode VI - Return of the Jedi (1983) and Star Wars: Episode I - The Phantom Menace (1999). He voiced the CGI character in Star Wars: Episode II - Attack of the Clones (2002) and Star Wars: Episode III - Revenge of the Sith (2005), supporting the transition of the character's rendering to digital. In 2011, the Blu-Ray edition of The Phantom Menace replaced the puppet Yoda with CGI to match the other prequel films. He began a career of behind-the-camera puppet and live action filmmaking by co-directing The Dark Crystal (1982) with Henson. He went on to direct The Muppets Take Manhattan (1984), Little Shop of Horrors (1986), Dirty Rotten Scoundrels (1988), What About Bob? (1991), The Indian in the Cupboard (1995), Bowfinger (1999), The Score (2001), The Stepford Wives (2004) and Death at a Funeral (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NTM4ODA0OV5BMl5BanBnXkFtZTYwODMxMjQ0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000568","name":"Frank Oz","idIMDB":"nm0000568"},"actorId":"nm0000568","character":"Himself / Miss Piggy / Fozzie Bear / Animal / Bert / Grover / Cookie Monster","urlCharacter":"http://www.imdb.com/character/ch0000531","main":true},{"actorName":"Dave Goelz","urlProfile":"http://www.imdb.com/name/nm0324397","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMzg3NzQyMF5BMl5BanBnXkFtZTgwMzE5MDAyNzE@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1946","placeOfBirth":" Los Angeles, California, USA","birthName":"David Charles Goelz","height":"5' 10\" (1.78 m)","bio":"A longtime puppet designer and performer, Goelz was picked up by Jim Henson and company to design Muppets for various television projects in the early 70's. By the time Jim Henson and Frank Oz were beginning work on \"The Muppet Show\", they managed to convince Dave to come work as a puppeteer. He soon began to perform and develop such memorable characters as the Great Gonzo and Dr. Bunsen Honeydew. He has gone on to become a principal Muppeteer and one of the major talents of the Jim Henson Company.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMzg3NzQyMF5BMl5BanBnXkFtZTgwMzE5MDAyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0324397","name":"Dave Goelz","idIMDB":"nm0324397"},"actorId":"nm0324397","character":"The Great Gonzo / Zoot the Sax Player / Dr. Bunsen Honeydew / Beauregarde / Boober Fraggle","urlCharacter":"http://www.imdb.com/character/ch0040025","main":true},{"actorName":"Jerry Nelson","urlProfile":"http://www.imdb.com/name/nm0625456","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTg1NjEzNjU4NF5BMl5BanBnXkFtZTcwNzYxOTEzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 July 1934","placeOfBirth":" Tulsa, Oklahoma, USA","bio":"Puppeteer, actor, musician, and master of voices, Jerry Nelson originally joined Henson & Company as a temporary replacement for Frank Oz, who had been drafted into the armed services in the 60's. He later re-joined the crew as a full-time performer in the 70's, and has since been heavily involved in almost every major Muppet project, including Sesame Street (1969), The Muppet Show (1976), Fraggle Rock (1983) and feature films. Memorable characters include \"The Count\", \"Herry Monster\", \"Mumford the Magician\", \"Robin the Frog\", \"Crazy Harry\" and \"Gobo\". Come the late 1990s, Nelson has begun to focus more on his musical career but continues his involvement in The Muppets.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTg1NjEzNjU4NF5BMl5BanBnXkFtZTcwNzYxOTEzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0625456","name":"Jerry Nelson","idIMDB":"nm0625456"},"actorId":"nm0625456","character":"Ma Bear / Robin the Frog / Camila / Lew Zealand / Floyd / Crazy Harry / Lewis Kazagger / Penguin / The Count / Herry Monster / Frazzle","urlCharacter":"http://www.imdb.com/character/ch0116127","main":true},{"actorName":"Richard Hunt","urlProfile":"http://www.imdb.com/name/nm0402611","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg3NDM0NzQzMV5BMl5BanBnXkFtZTgwMDk4MTY4NzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 August 1951","placeOfBirth":" Bronx, New York, USA","bio":"Richard Hunt did not have a face known to many -- his voice was known more than anything else. He was a major stronghold behind Jim Henson's \"Muppets\". 'Scooter', 'Janice', 'Sweetums' and a few others, were some of the \"Muppets\" that Richard was a performer and puppeteer of. He helped pave the way for Jim Henson and his company from the 1970s through the early 90s, until his surprising death in 1992 of AIDS.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg3NDM0NzQzMV5BMl5BanBnXkFtZTgwMDk4MTY4NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0402611","name":"Richard Hunt","idIMDB":"nm0402611"},"actorId":"nm0402611","character":"Scooter / Statler / Sweetums / Janice / Beaker","urlCharacter":"http://www.imdb.com/character/ch0000674","main":true},{"actorName":"Steve Whitmire","urlProfile":"http://www.imdb.com/name/nm0926209","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNDM3NzE0MV5BMl5BanBnXkFtZTgwMDk4MDAyNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 September 1958","placeOfBirth":" Atlanta, Georgia, USA","birthName":"Steven Lawrence Whitmire","height":"6' 4\" (1.93 m)","bio":"Steve Whitmire was born on September 24, 1958 in Atlanta, Georgia, USA as Steven Lawrence Whitmire. He is an actor, known for The Muppets (2011), The Muppet Christmas Carol (1992) and The Dark Crystal (1982). He has been married to Melissa Whitmire since June 1978.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNDM3NzE0MV5BMl5BanBnXkFtZTgwMDk4MDAyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0926209","name":"Steve Whitmire","nicknames":["Kermit"],"idIMDB":"nm0926209"},"actorId":"nm0926209","character":"Kermit the Frog / Rizzo the Rat / Bean Bunny / Wembley Fraggle / Whoopie Cushions","urlCharacter":"http://www.imdb.com/character/ch0000604","main":true},{"actorName":"Kevin Clash","urlProfile":"http://www.imdb.com/name/nm0165159","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0OTAyMTE2N15BMl5BanBnXkFtZTcwNTY0MTUzNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 September 1960","placeOfBirth":" Baltimore, Maryland, USA","birthName":"Kevin Jeffrey Clash","height":"6' (1.83 m)","bio":"Kevin Clash was born on September 17, 1960 in Baltimore, Maryland, USA as Kevin Jeffrey Clash. He is an actor and producer, known for Labyrinth (1986), Teenage Mutant Ninja Turtles (1990) and Sesame Street (1969). He was previously married to Genia Loving.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0OTAyMTE2N15BMl5BanBnXkFtZTcwNTY0MTUzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0165159","name":"Kevin Clash","nicknames":["Elmo"],"idIMDB":"nm0165159"},"actorId":"nm0165159","character":"Clifford / Elmo / Hoots the Owl","urlCharacter":"http://www.imdb.com/character/ch0000652","main":true},{"actorName":"Kathryn Mullen","urlProfile":"http://www.imdb.com/name/nm0612020","urlPhoto":"","biography":{"dateOfBirth":"10 February 1940","placeOfBirth":" New York City, New York, USA","bio":"Kathryn Mullen was born on February 10, 1940 in New York City, New York, USA. She is an actress, known for The Dark Crystal (1982), Fraggle Rock (1983) and Between the Lions (1999). She is married to Michael K. Frith.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0612020","name":"Kathryn Mullen","idIMDB":"nm0612020"},"actorId":"nm0612020","character":"Joy Buzzer Cushions / Mokey Fraggle","urlCharacter":"http://www.imdb.com/character/ch0115953","main":true},{"actorName":"Caroll Spinney","urlProfile":"http://www.imdb.com/name/nm0818973","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0OTgxMDk1MV5BMl5BanBnXkFtZTcwMDI0NzkxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 December 1933","placeOfBirth":" Waltham, Massachusetts, USA","birthName":"Caroll Edwin Spinney","height":"5' 9½\" (1.77 m)","bio":"Caroll Spinney was born on December 26, 1933 in Waltham, Massachusetts, USA as Caroll Edwin Spinney. He is an actor, known for Sesame Street (1969), Follow That Bird (1985) and Night at the Museum: Battle of the Smithsonian (2009). He has been married to Debra Spinney since 1979. He was previously married to Janice Spinney.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0OTgxMDk1MV5BMl5BanBnXkFtZTcwMDI0NzkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0818973","name":"Caroll Spinney","idIMDB":"nm0818973"},"actorId":"nm0818973","character":"Big Bird / Oscar the Grouch","urlCharacter":"http://www.imdb.com/character/ch0000685","main":true},{"actorName":"Pam Arciero","urlProfile":"http://www.imdb.com/name/nm0033841","urlPhoto":"","biography":{"dateOfBirth":"8 May 1954","placeOfBirth":" Honolulu, Hawaii, USA","birthName":"Pamela F. Arciero","bio":"Pam Arciero was born on May 8, 1954 in Honolulu, Hawaii, USA as Pamela F. Arciero. She is known for her work on Between the Lions (1999), Sesame Street (1969) and A Muppets Christmas: Letters to Santa (2008). She has been married to Anthony Stephen Lanza since October 11, 1980.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0033841","name":"Pam Arciero","idIMDB":"nm0033841"},"actorId":"nm0033841","character":"Muppet Performer","urlCharacter":"http://www.imdb.com/character/ch0033324","main":true}],"seasons":[],"idIMDB":"tt0251874","urlIMDB":"http://www.imdb.com/title/tt0251874","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["47 min","1 hr 18 min (78 min) (Canada)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"8.8","filmingLocations":[],"awards":[{"award":"Primetime Emmy Awards 1991","titlesAwards":[{"titleAwardOutcome":"Won Primetime Emmy","categories":[{"category":"Outstanding Editing for a Miniseries or a Special - Multi-Camera Production","names":[{"name":"David Gumpel","id":"nm0347974","role":"editor"},{"name":"Girish Bhargava","id":"nm0080259","role":"editor"}]}]},{"titleAwardOutcome":"Nominated Primetime Emmy","categories":[{"category":"Outstanding Achievement in Music Direction","names":[{"name":"Larry Grossman","id":"nm0343675","role":"music director"},{"name":"Jamie Lawrence","id":"nm1491575","role":"principal arranger"},{"name":"Paul McKibbons","id":"nm0571726","role":"principal arranger"},{"name":"Torrie Zito","id":"nm0957277","role":"principal arranger"}]},{"category":"Outstanding Variety, Music or Comedy Program","names":[{"name":"Don Mischer","id":"nm0592687","role":"producer"},{"name":"Martin G. Baker","id":"nm0048744","role":"co-producer"},{"name":"David J. Goldberg","id":"nm1029722","role":"co-producer"}]},{"category":"Outstanding Writing in a Variety or Music Program","names":[{"name":"Jerry Juhl","id":"nm0432075","role":"writer"},{"name":"Sara Lukinson","id":"nm0525701","role":"writer"},{"name":"Bill Prady","id":"nm0695080","role":"writer"}]}]}]}],"votes":"202","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0006707","name":"Don Mischer Productions"},{"idCompany":"co0055122","name":"Jim Henson Productions"},{"idCompany":"co0013021","name":"Walt Disney Television"}],"keywords":{"keywords":["tribute","puppetry","puppet","puppeteer","filmmaking","filmmaker","the muppets","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 19:44:32"}}