{"data":{"movies":[{"title":"Foodfight!","originalTitle":"","year":"2012","releaseDate":"20130212","directors":[{"name":"Lawrence Kasanoff","id":"nm0440415"}],"writers":[{"name":"Lawrence Kasanoff","id":"nm0440415"},{"name":"Joshua Wexler","id":"nm0923312"}],"runtime":"91 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzNzI3MzMyN15BMl5BanBnXkFtZTgwMzU0OTk1MDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation","Action","Comedy","Family","Fantasy"],"plot":"When the supermarket closes at night, the contents inside come to life! The shop becomes a living world for Dex Dogtective and all other creatures inside it at night time. However, with the new Brand X coming into the store, things take a turn for the worst.","simplePlot":"The evil Brand X joins a supermarket that becomes a city after closing time.","actors":[{"actorName":"Charlie Sheen","urlProfile":"http://www.imdb.com/name/nm0000221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyNDQ5Nzk2OF5BMl5BanBnXkFtZTcwODU4MTU5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 September 1965","placeOfBirth":" New York City, New York, USA","birthName":"Carlos Irwin Estevez","height":"5' 10\" (1.78 m)","bio":"Charlie Sheen was born Carlos Irwin Estévez on September 3, 1965, in New York City. His father, actor Martin Sheen (born Ramon Antonio Gerard Estevez), was at the time just breaking into the business, with performances on Broadway. His mother, Janet Sheen (née Templeton), was a former New York art student who had met Charlie's father right after he had moved to Manhattan. Martin and Janet had three other children, Emilio Estevez, Renée Estevez, and Ramon Estevez, all of whom became actors. His father is of half Spanish and half Irish descent, and his mother, whose family is from Kentucky, has English and Scottish ancestry. At a young age, Charlie took an interest in his father's acting career. When he was nine, he was given a small part in his dad's movie The Execution of Private Slovik (1974). In 1977, he was in the Philippines where his dad suffered a near-fatal heart attack on the set of Apocalypse Now (1979). While at Santa Monica High School, Charlie had two major interests: acting and baseball. Along with his friends, which included Rob Lowe and Sean Penn, he produced and starred in several amateur Super-8 films. On the Vikings baseball team, he was a star shortstop and pitcher. His lifetime record as a pitcher was 40-15. His interest and skill in baseball would later influence some of his movie roles. Unfortunately, his success on the baseball field did not translate to success in the classroom, as he struggled to keep his grades up. Just a few weeks before his scheduled graduation date, Charlie was expelled due to poor attendance and bad grades. After high school, Charlie aggressively pursued many acting roles. His first major role was as a high school student in the teen war film Red Dawn (1984). He followed this up with relatively small roles in TV movies and low-profile releases. His big break came in 1986 when he starred in Oliver Stone's Oscar winning epic Platoon (1986). He drew rave reviews for his portrayal of a young soldier who is caught in the center of a moral crisis in Vietnam. The success of Platoon (1986) prompted Oliver Stone to cast Charlie in his next movie Wall Street (1987) alongside his father and veteran actor Martin Sheen. The movie with its \"Greed is Good\" theme became an instant hit with viewers. Shortly after, Stone approached Charlie about the starring role in his next movie, Born on the Fourth of July (1989). When Tom Cruise eventually got the part, Sheen ended up hearing the news from his brother Emilio Estevez and not even getting as much as a call from Stone. This led to a fallout, and the two have not worked together since. The fallout with Stone, however, did nothing to hurt Charlie's career in the late 1980s and early '90s, as he continued to establish himself as one of the top box office draws with a string of hits that included Young Guns (1988), Major League (1989), and Hot Shots! (1991). However, as the mid-'90s neared, his good fortune both personally and professionally, soon came to an end. Around this time, Charlie, who had already been to drug rehab, was beginning to develop a reputation as a hard-partying, womanizer. In 1995, the same year he was briefly married to model Donna Peele, he was called to testify at the trial of Hollywood madam Heidi Fleiss. At the trial, while under oath he admitted to spending nearly $50,000 on 27 of Fleiss' $2,500-a-night prostitutes. His downward spiral continued the following year when his ex-girlfriend Brittany Ashland filed charges claiming that he physically abused her. He was later charged with misdemeanor battery to which he pleaded no contest and was given a year's suspended sentence, two years' probation and a $2,800 fine. He finally hit rock bottom in May 1998 when he was hospitalized in Thousand Oaks, California, following a near-fatal drug overdose. Later that month, he was ordered back to the drug rehab center, which he had previously left after one day. During this stretch, Charlie's film career began to suffer as well. He starred in a series of box office flops that included The Arrival (1996) and Shadow Conspiracy (1997). However as the 1990s came to end, so did Charlie's string of bad luck. In 2000, Charlie, now clean and sober, was chosen to replace Michael J. Fox on the ABC hit sitcom Spin City (1996). Though his stint lasted only two seasons, Charlie's performance caught the eye of CBS executives who in 2003 were looking for an established star to help carry their Monday night lineup of sitcoms that included Everybody Loves Raymond (1996). The sitcom Two and a Half Men (2003) starred Charlie as a swinging, irresponsible womanizer whose life changes when his nephew suddenly appears on his doorstep. The show became a huge hit, breathing much needed life into Charlie's fading career. Charlie's personal life also appeared to be improving. In 2002, he married actress Denise Richards, whom he first met while shooting the movie Good Advice (2001). In March 2004, they had a daughter, Sam, and it was announced shortly after that Denise was pregnant with the couple's second child. By all reports, the couple seemed to be very happy together. However, like all of Charlie's previous relationships, the stability did not last long. In March of 2005, Denise, who was six-months pregnant, filed for divorce, citing irreconcilable differences. She gave birth to a second daughter, Lola, in June of that same year. Their divorce became final in late 2006.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyNDQ5Nzk2OF5BMl5BanBnXkFtZTcwODU4MTU5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000221","name":"Charlie Sheen","nicknames":["The Machine","Good Time Charlie","Chuckles","The Warlock from Mars"],"idIMDB":"nm0000221"},"actorId":"nm0000221","character":"Dex Dogtective","urlCharacter":"http://www.imdb.com/character/ch0145157","main":true},{"actorName":"Hilary Duff","urlProfile":"http://www.imdb.com/name/nm0240381","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5OTU1NzIzNF5BMl5BanBnXkFtZTcwMTg3MjM3Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 September 1987","placeOfBirth":" Houston, Texas, USA","birthName":"Hilary Erhard Duff","height":"5' 2\" (1.57 m)","bio":"Hilary Erhard Duff was born on September 28, 1987 in Houston, Texas, to Susan Duff (née Cobb) and Robert Erhard Duff, a partner in convenience store chain. When Hilary was six, she had been traveling in the Cechetti Ballet with her sister Haylie Duff but decided she wanted to fulfill her dream of acting. Her first part was in the mini-series True Women (1997), but her first starring role was as \"Ellie\" in The Soul Collector (1999), for which she won a Best Performance in a TV Movie or Pilot (Supporting Young Actress) Young Artist Award. Hilary also starred in Casper Meets Wendy (1998) in 1998, in which she played the young witch \"Wendy\". Success came again as she took the role of the starring title character \"Lizzie McGuire\" in the #1 hit Disney Channel series Lizzie McGuire (2001). \"Lizzie\" was extremely successful and spawned The Lizzie McGuire Movie (2003). The Lizzie McGuire Movie (2003) was released to theaters on May 2nd, 2003, grossing an impressive US$42 million domestically. Hilary also appeared in Agent Cody Banks (2003) in 2003. Additionally, Hilary is storming the music charts, with singles \"So Yesterday\" and \"Come Clean\" settling nicely into the top 40. Hilary's first album, \"Metamorphosis\", debuted at #2 on the Billboard 200, and eventually ascended to #1 in the following weeks. To date, it has sold more than 2 million copies. Although she toured the USA in support of \"Metamorphosis\", Hilary hasn't discarded her film career. A Cinderella Story (2004), co-starring Chad Michael Murray, hit theaters on July 19th. The Perfect Man (2005) and Raise Your Voice (2004) opened in 2005. Hilary was the 2004 international spokesperson of \"Kids With A Cause\", a charity organization that specializes in poverty-stricken children. Her other film credits include Cheaper by the Dozen (2003), Human Nature (2001), Cadet Kelly (2002) and True Women (1997). Hilary continues guest-starring on TV shows, filming movies, recording albums and doing television concerts.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5OTU1NzIzNF5BMl5BanBnXkFtZTcwMTg3MjM3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0240381","name":"Hilary Duff","nicknames":["Hil"],"idIMDB":"nm0240381"},"actorId":"nm0240381","character":"Sunshine Goodness","urlCharacter":"http://www.imdb.com/character/ch0026685","main":true},{"actorName":"Eva Longoria","urlProfile":"http://www.imdb.com/name/nm0519456","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MTE1NjMwOV5BMl5BanBnXkFtZTgwODg2MzUwMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 March 1975","placeOfBirth":" Corpus Christi, Texas, USA","birthName":"Eva Jacqueline Longoria","height":"5' 2\" (1.57 m)","bio":"Eva Longoria was born in Corpus Christi, Texas, to Ella Eva (Mireles) and Enrique Longoria, Jr. The youngest of four sisters who grew up on a ranch near Corpus Christi, Longoria attended Texas A&M University-Kingsville, where she received a Bachelor of Science degree in Kinesiology. After graduating from college, she entered a talent contest that brought her to Los Angeles, where she was spotted and subsequently signed by a theatrical agent. After landing roles on Amour, gloire et beauté (1987), General Hospital (1963) and co-starring on Beverly Hills, 90210 (1990), she auditioned for and won the role of \"Isabella\" on the popular series, The Young and the Restless (1973). After Y&R, Eva Longoria became well known worldwide thanks to Desperate Housewives (2004) where she plays adulteress \"Gabrielle Solis\". She also has a contract with L'Oreal and has been named one of the most beautiful people. A passionate advocate of education she founded The Eva Longoria Foundation which helps Latinas build better futures for themselves and their families through education and entrepreneurship and earned a Masters in Chicano Studies presenting her thesis on \"Success STEMS From Diversity: The Value of Latinas in STEM Careers.\" Eva has also contributed writing to publications on the subject of education.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MTE1NjMwOV5BMl5BanBnXkFtZTgwODg2MzUwMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0519456","name":"Eva Longoria","idIMDB":"nm0519456"},"actorId":"nm0519456","character":"Lady X","urlCharacter":"http://www.imdb.com/character/ch0145158","main":true},{"actorName":"Wayne Brady","urlProfile":"http://www.imdb.com/name/nm0103750","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MzM1NjEyMl5BMl5BanBnXkFtZTcwMjExMDM2NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 June 1972","placeOfBirth":" Columbus, Georgia, USA","birthName":"Wayne Alphonso Brady","height":"6' (1.83 m)","bio":"Wayne Brady was born in Columbus, Georgia and lived in Orlando, Florida. At 16, Brady had already decided on a career in the military. Little did he know that a chance performance in a high school play would garner him not only rave reviews but also permanently alter his long-range plans. Soon, he was heavily involved in the central Florida theater community, performing in numerous stage productions including \"A Chorus Line\", \"Fences\", \"A Raisin in the Sun\", \"Jesus Christ Superstar\" and \"I'm Not Rappaport\". Brady moved to Las Vegas and then to Los Angeles in 1996, where he began working in theater and television. He performed at the prestigious Mark Taper Forum in its production of \"Blade to the Heat\". He also garnered guest starring roles in such television series as NBC's I'll Fly Away (1991) and The Home Court (1995) and In the Heat of the Night (1988) for CBS. Currently, Brady is busy hosting the VH-1 series, Vinyl Justice (1998), which premieres in August. Brady has also been honored with several nominations for his work in theater, including Best Actor in a Musical for \"Cotton Patch Gospel\" at the distinguished Edyth Bush Theatre. He was named Sak Theatre's 1992 Rookie of the Year for TheatreSports/Improv.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MzM1NjEyMl5BMl5BanBnXkFtZTcwMjExMDM2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0103750","name":"Wayne Brady","idIMDB":"nm0103750"},"actorId":"nm0103750","character":"Daredevil Dan","urlCharacter":"http://www.imdb.com/character/ch0145162","main":true},{"actorName":"Christopher Lloyd","urlProfile":"http://www.imdb.com/name/nm0000502","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNzQ0ODgxOV5BMl5BanBnXkFtZTcwMTAxMDY0Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 October 1938","placeOfBirth":" Stamford, Connecticut, USA","birthName":"Christopher Allen Lloyd","height":"6' 1\" (1.85 m)","bio":"Christopher Lloyd was born on October 22, 1938 in Stamford, Connecticut, USA as Christopher Allen Lloyd. He is an actor, known for Back to the Future (1985), Back to the Future Part II (1989) and Back to the Future Part III (1990). He was previously married to Jane Walker Wood, Carol Vanek, Kay Tornborg and Catherine Boyd.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNzQ0ODgxOV5BMl5BanBnXkFtZTcwMTAxMDY0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000502","name":"Christopher Lloyd","nicknames":["Chris"],"idIMDB":"nm0000502"},"actorId":"nm0000502","character":"Mr. Clipboard","urlCharacter":"http://www.imdb.com/character/ch0145159","main":true},{"actorName":"Chris Kattan","urlProfile":"http://www.imdb.com/name/nm0441592","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTEzOTU5OV5BMl5BanBnXkFtZTcwOTg2ODY3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 October 1970","placeOfBirth":" Los Angeles, California, USA","birthName":"Christopher Lee Kattan","height":"5' 5½\" (1.66 m)","bio":"Christopher Lee Kattan was born in Sherman Oaks, California, to model Hajni Joslyn and actor Kip King. Chris moved to Mt. Baldy when he turned five, and resided there until the age of fifteen, when he moved to Bainbridge Island, Washington for high school. After he graduated from high school, Chris moved to the L.A. area to join up with the improv/sketch comedy group \"The Groundlings\". He became a featured player on Saturday Night Live (1975) in March of 1996, and a cast member in September of the same year. He remained on the show until May 2003. Chris lives in the Los Angeles area.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTEzOTU5OV5BMl5BanBnXkFtZTcwOTg2ODY3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0441592","name":"Chris Kattan","idIMDB":"nm0441592"},"actorId":"nm0441592","character":"Polar Penguin","urlCharacter":"http://www.imdb.com/character/ch0145160","main":true},{"actorName":"Larry Miller","urlProfile":"http://www.imdb.com/name/nm0588777","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NzQxOTMwOF5BMl5BanBnXkFtZTcwNDc3NDIzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 October 1953","placeOfBirth":" Valley Stream, Long Island, New York, USA","height":"5' 11\" (1.8 m)","bio":"Larry Miller was born on October 15, 1953 in Valley Stream, Long Island, New York, USA. He is an actor and writer, known for Kiss Kiss Bang Bang (2005), 10 Things I Hate About You (1999) and The Nutty Professor (1996). He has been married to Eileen Conn since March 1993. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NzQxOTMwOF5BMl5BanBnXkFtZTcwNDc3NDIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0588777","name":"Larry Miller","idIMDB":"nm0588777"},"actorId":"nm0588777","character":"Vlad Chocool","urlCharacter":"http://www.imdb.com/character/ch0145167","main":true},{"actorName":"Edward Asner","urlProfile":"http://www.imdb.com/name/nm0000799","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MDI4ODk5NF5BMl5BanBnXkFtZTcwMzg3ODQ3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 November 1929","placeOfBirth":" Kansas City, Missouri, USA","birthName":"Eddie Asner","height":"5' 7\" (1.7 m)","bio":"Ed Asner is a television legend, the winner of seven acting Emmy Awards (which puts him tied with Mary Tyler Moore, both of whom rank second to their \"Mary Tyler Moore (1970) Show\" co-star, Cloris Leachman who has nine). In all, he has been nominated 20 times for an Emmy Award, with 17 nods for a Primetime Emmy and three for a Daytime award. (All of his wins were for Primetime.) As well as being one of the most outstanding and most respected actors of his generation, equally adept at comedy as he is at drama, Asner also made a name for himself as a trade unionist and a political activist. He served two terms as president of the Screen Actors Guild, from 1981-1985, during which he criticized former SAG President Ronald Reagan, then the president of a greater concern, for his Central American policy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MDI4ODk5NF5BMl5BanBnXkFtZTcwMzg3ODQ3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000799","name":"Edward Asner","idIMDB":"nm0000799"},"actorId":"nm0000799","character":"Mr. Leonard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jerry Stiller","urlProfile":"http://www.imdb.com/name/nm0005467","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNjA1NzgzNV5BMl5BanBnXkFtZTYwODY4ODQ0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 June 1927","placeOfBirth":" New York City, New York, USA","birthName":"Gerald Isaac Stiller","height":"5' 4\" (1.63 m)","bio":"As the short, hypertensive male counterpart of the stellar husband-and-wife comedy team \"Stiller & Meara\", Jerry Stiller and wife Anne Meara were on top of the comedy game in the 1960s, a steady and hilarious presence on television variety, notably The Ed Sullivan Show (1948), on which they appeared 36 times. Decades later, his career was revitalized in the role of the raucous, gasket-blowing Frank Costanza on the sitcom classic Seinfeld (1989). Jerry Stiller was born in the Unity Hospital in Brooklyn, New York City, New York, to Bella (Citron) and William Stiller, a bus driver. His paternal grandparents were Jewish immigrants from Galicia, and his mother was a Polish Jewish immigrant, from Frampol. Stiller was, in the beginning, a drama major at the University of Syracuse. Though he had played rather uneducated, blue-collar sorts for most of his career, he received a Bachelor of Science in Speech and Drama before making his 1951 acting debut on stage with Burgess Meredith in \"The Silver Whistle\". While a member of the improvisational team The Compass Players (the company later evolved into the well-known Second City troupe), he met Anne. They married in 1954 and began touring together on the national club circuit while giving new and inventive meaning to the term spousal comedy. After well over a decade of fame together, they decided to pursue individual successes and both found it. A Broadway favorite in such shows as \"Hurlyburly\", \"The Ritz\" (he later recreated his role on film), \"The Golden Apple\", \"Three Men on a Horse\", \"What's Wrong with This Picture\" and \"The Three Sisters\", Stiller even appeared with Kevin Kline and Blythe Danner as Dogberry in William Shakespeare's \"Much Ado About Nothing\" in 1988. Musicals were not out of his range, either, as he created the role of Launce in \"Two Gentlemen of Verona\" and co-starred as Nathan Detroit in a production of \"Guys and Dolls\". Although he kept afloat on television as a 1970s regular on The Paul Lynde Show (1972) and Joe and Sons (1975), he had some rocky years and Anne's pilot fizzled when they reunited for a possible \"Stiller & Meara\" sitcom. Then came eight seasons as Frank Costanza and his character star was reborn. Nominated for a 1997 Emmy Award and the recipient of the 1998 American Comedy Award, Stiller found back-to-back sitcom hits with The King of Queens (1998) as the irascible Arthur Spooner. He has also appeared in a number of his successful son, Ben Stiller's, comedy pictures including Heavy Weights (1995) and Zoolander (2001). Daughter Amy Stiller is also a thriving actress. He and Anne have written, performed and produced award-winning radio commercials together for such products as Blue Nun Wine, United Van Lines and Amalgamated Bank, among others. His autobiography \"Married to Laughter\" came out in 2000.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNjA1NzgzNV5BMl5BanBnXkFtZTYwODY4ODQ0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005467","name":"Jerry Stiller","idIMDB":"nm0005467"},"actorId":"nm0005467","character":"General X","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christine Baranski","urlProfile":"http://www.imdb.com/name/nm0004724","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMTYwMDUyM15BMl5BanBnXkFtZTcwNTk1MzQxMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 May 1952","placeOfBirth":" Buffalo, New York, USA","birthName":"Christine Jane Baranski","height":"5' 8½\" (1.74 m)","bio":"Christine Baranski was born on May 2, 1952 in Buffalo, New York, USA as Christine Jane Baranski. She is an actress, known for The Good Wife (2009), How the Grinch Stole Christmas (2000) and Cybill (1995). She was previously married to Matthew Cowles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMTYwMDUyM15BMl5BanBnXkFtZTcwNTk1MzQxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004724","name":"Christine Baranski","idIMDB":"nm0004724"},"actorId":"nm0004724","character":"Hedda Shopper","urlCharacter":"http://www.imdb.com/character/ch0028814","main":true},{"actorName":"Lawrence Kasanoff","urlProfile":"http://www.imdb.com/name/nm0440415","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NDk2MDg5MF5BMl5BanBnXkFtZTcwNDk3NDY3NA@@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1959","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Lawrence Alan Kasanoff","bio":"As Chairman and Chief Executive Officer of Threshold Entertainment Group, Lawrence Kasanoff is a renowned producer in the world of film, television, live stage, animation, and technological advances in the next generation of entertainment, both domestically and overseas. With an expertise in developing dynamic content for the most recognizable brands in entertainment, Kasanoff is a forward thinking entrepreneur who has established a competitive advantage with innovative ways to top the market and find success in both the creative and business side of the industry. Under his Threshold Entertainment Group banner, Kasanoff oversees the company's subsidiaries which include Threshold Entertainment, Threshold Animation Studios and Blackbelt TV. As a producer or studio head, Kasanoff has raised well over a billion dollars in the film business. He and his executive team have been instrumental in the production of over 250 feature films, including Dirty Dancing, and the Academy Award® winning Best Picture, Platoon. Collectively, in the music world, they hold over 200 Gold and Platinum Records, and have worked with several of the world's biggest artists, including Michael Jackson, The Rolling Stones and Guns 'n Roses. Kasanoff and Threshold Entertainment Group have been profiled in The New York Times, The Wall St. Journal, USA Today, Time Magazine, Wired, Maxim and Playboy and have been featured on CNN, FOX News, ABC World News Tonight, CNBC, The Howard Stern Show and more. As an Executive Producer, Kasanoff made such box-office smash hits as James Cameron's True Lies, starring Arnold Schwarzenegger. As president and co-founder of Lightstorm Entertainment, Kasanoff supervised production, marketing, publicity and merchandising for the four time Academy Award® winning film, Terminator 2: Judgment Day. He produced two films, Blue Steel and Strange Days, with Academy Award® winning director, Kathryn Bigelow. Kasanoff's most prominent and widely regarded success of his intellectual property management model is Mortal Kombat. He produced all Mortal Kombat media including the two number one box office hit films, Mortal Kombat and Mortal Kombat: Annihilation. Kasanoff also produced a Mortal Kombat live action television series, an animated series, platinum selling soundtracks, a Radio City Music Hall Live Stage show and live tour. The Mortal Kombat franchise has grossed approximately $5 billion. Kasanoff overseas all facets of Threshold Entertainment, which produces live action feature films and then produces that intellectual property on multiple media platforms. The company currently has several films in the pipeline, focused largely on sci-fi, fantasy and action genres. Threshold Animation Studios develops computer generated animated films, television series, and location based entertainment, largely based on some of the world's biggest brands, including Star Wars, Lego, Marvel, and Star Trek. Through a unique technology alliance with IBM, Threshold built one of the most advanced digital production facilities in the world. Threshold Animation Studios productions include Lego Star Wars: The Empire Strikes Out, which received a 2013 Annie Award nomination for Best Children Television Production; The Amazing Adventures of Spider-Man theme park 3D ride film for Universal Studios Florida; Star Trek: Borg Invasion 4D location based entertainment film for the Las Vegas Hilton and Justice League: Alien Invasion 3D for Warner Brothers Movie World. Threshold's Marvel Superheroes 4D is a first of its kind, immersive, 360 degree dome, 4D (stereoscopic 3D plus physical effects) show now playing in its third year in Madame Tussauds London. Using unique, proprietary technology, Threshold is currently producing a 360 degree animated underwater dome experience for Hainan Ocean Paradise in China. Threshold Animation Studios continues to innovate, develop and build unique 4D theaters and immersive experiences based on the world's biggest brands. Blackbelt TV, which Kasanoff founded and runs, is a worldwide (67 countries) sports and entertainment, action based, TV Channel. It airs, 24/7, programming featuring martial arts fights (Boxing, MMA, Muay Thai and more), movies, Hollywood celebrities, TV series, video games and lifestyle. Pretty, fun girls called Fight Jocks host the network. It's motto: Kicks! Flicks! & Chicks! Kasanoff holds an MBA from the Wharton School of Business and a BA from Cornell University.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NDk2MDg5MF5BMl5BanBnXkFtZTcwNDk3NDY3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0440415","name":"Lawrence Kasanoff","nicknames":["Larry Kasanoff"],"idIMDB":"nm0440415"},"actorId":"nm0440415","character":"Cheasel T. Weasel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harvey Fierstein","urlProfile":"http://www.imdb.com/name/nm0001213","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU1MzgzOTI3Nl5BMl5BanBnXkFtZTcwNzE3MjU4Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 June 1954","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"6' 2½\" (1.89 m)","bio":"Harvey Fierstein was born on June 6, 1954 in Brooklyn, New York City, New York, USA. He is an actor and writer, known for Mrs. Doubtfire (1993), Independence Day (1996) and Mulan (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU1MzgzOTI3Nl5BMl5BanBnXkFtZTcwNzE3MjU4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001213","name":"Harvey Fierstein","idIMDB":"nm0001213"},"actorId":"nm0001213","character":"Fat Cat Burglar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cloris Leachman","urlProfile":"http://www.imdb.com/name/nm0001458","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwNTM4NjI4NzleQTJeQWpwZ15BbWU2MDkxMTg0NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 April 1926","placeOfBirth":" Des Moines, Iowa, USA","height":"5' 5½\" (1.66 m)","bio":"The record-breaking actress set a record when at age 82, she appeared on Dancing with the Stars (2005). Cloris Leachman was born on April 30, 1926 in Des Moines, Iowa to Berkeley Claiborne \"Buck\" Leachman and the former Cloris Wallace. Her father's family owned a lumber company, Leachman Lumber Co. She is of Czech (from her maternal grandmother) and English descent. After graduating from high school, Leachman attended Illinois State University and Northwestern University, where she majored in drama. After winning the title of Miss Chicago 1946 (as part of the Miss America pageant), she acted with the Des Moines Playhouse before moving to New York. Leachman made her credited debut in 1948 in an episode of The Ford Theatre Hour (1948) and appeared in many television anthologies and series before becoming a regular on The Bob & Ray Show (1951) in 1952. Her movie debut was memorable, playing the doomed blonde femme fatale Christina Bailey in Robert Aldrich's classic noir Kiss Me Deadly (1955). Other than a role in Rod Serling's movie The Rack (1956) in support of Paul Newman, Leachman remained a television actress throughout the 1950s and the 1960s, appearing in only two movies during the latter decade, The Chapman Report (1962) and Butch Cassidy and the Sundance Kid (1969). Though she would win an Oscar for Peter Bogdanovich's adaptation of Larry McMurtry's The Last Picture Show (1971) and appear in three Mel Brooks movies, it was in television that her career remained and her famed was assured in the 1970s and into the second decade of the new millennium. Leachman was nominated five times for an Emmy Award playing Phyllis Lindstrom, Mary Tyler Moore's landlady and self-described best friend on Mary Tyler Moore (1970) and on the spin-off series Phyllis (1975). She won twice as Best Supporting Actress in a comedy for her \"Mary Tyler Moore\" gig and won a Golden Globe Award as a leading performer in comedy for \"Phyllis\", but her first Emmy Award came in the category Outstanding Single Performance by an Actress in a Leading Role in 1973 for the television movie A Brand New Life (1973). She also won two Emmy Awards as a supporting player for Malcolm in the Middle (2000). She was married to director-producer George Englund from 1953 to 1979. They had five children together.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwNTM4NjI4NzleQTJeQWpwZ15BbWU2MDkxMTg0NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001458","name":"Cloris Leachman","idIMDB":"nm0001458"},"actorId":"nm0001458","character":"Brand X Lunch Lady","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Haylie Duff","urlProfile":"http://www.imdb.com/name/nm0240380","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwODMzNzczMF5BMl5BanBnXkFtZTcwMDg5MDQyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 February 1985","placeOfBirth":" Houston, Texas, USA","birthName":"Haylie Katherine Duff","height":"5' 2½\" (1.59 m)","bio":"Haylie Duff was born on February 19, 1985 in Houston, Texas, USA as Haylie Katherine Duff. She is an actress and producer, known for Napoleon Dynamite (2004), Material Girls (2006) and The Real Girl's Kitchen (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwODMzNzczMF5BMl5BanBnXkFtZTcwMDg5MDQyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0240380","name":"Haylie Duff","nicknames":["Hayls"],"idIMDB":"nm0240380"},"actorId":"nm0240380","character":"Sweetcakes","urlCharacter":"http://www.imdb.com/character/ch0137036","main":true},{"actorName":"Shelley Morrison","urlProfile":"http://www.imdb.com/name/nm0607314","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MTk2MjcwOV5BMl5BanBnXkFtZTYwOTgyMjY1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1936","placeOfBirth":" New York City, New York, USA","birthName":"Rachel Mitrani","height":"5' 5\" (1.65 m)","bio":"Despite remaining on the periphery of character stardom all these years, New York-born character actress Shelley Morrison has had a long and varied career since the early 60s. She started out on TV in such popular shows as The Farmer's Daughter (1963) and Laredo (1965), making a career out of an assortment of ethnic roles. In films she played Indian squaws in Three Guns for Texas (1968) and Mackenna's Gold (1969), as well as minor Hispanic roles in Castle of Evil (1966), Man and Boy (1971) and Troop Beverly Hills (1989). While most people remember her with fondness as the adorably shy but spirited \"Sister Sixto\" who had problems mastering English (Shelley did in real life as well, as Spanish is her native language) in The Flying Nun (1967) starring Sally Field, today's audiences have been relishing her turnabout performance as the vinegary El Salvadorean housekeeper, \"Rosario\", the only character who doesn't mince words with Megan Mullally's socialite boss in another sitcom Will & Grace (1998). Shelley's acting roots are firmly entrenched in the theatre, having performed, produced and directed hosts of plays over the years in Los Angeles, New York and abroad. Dampening the enjoyment of her renewed TV success, however, has been recent battles with cancer which is now in remission.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MTk2MjcwOV5BMl5BanBnXkFtZTYwOTgyMjY1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0607314","name":"Shelley Morrison","idIMDB":"nm0607314"},"actorId":"nm0607314","character":"Lola Frutola","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0249516","urlIMDB":"http://www.imdb.com/title/tt0249516","business":{"budget":{"money":"$45,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"£20,440","country":"UK","day":"17","month":"06","year":"2012","remarks":""},{"money":"RUR 53,266","country":"Russia","day":"06","month":"05","year":"2012","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/2000/\">2000</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 31 min (91 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"1.7","filmingLocations":[],"rated":"PG","awards":[],"votes":"5,352","type":"Movie","companyCreditsSimple":[{"idCompany":"co0137060","name":"C47 Productions"},{"idCompany":"co0150906","name":"Lions Gate Family Entertainment"},{"idCompany":"co0035366","name":"Natural Image"}],"keywords":{"keywords":["troubled production","food","supermarket","femme fatale","pun","innuendo","scene during end credits","product","disappearance","stereotype","marriage proposal","punctuation in title","one word title","exclamation point in title","fight","computer animation","robot","club","singing","dream sequence","airplane","sidekick","love","mascot","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:35:18"}}