{"data":{"movies":[{"title":"Un amour infini","originalTitle":"Jewel","year":"2001","releaseDate":"20010207","directors":[{"name":"Paul Shapiro","id":"nm0788610"}],"writers":[{"name":"Bret Lott","id":"nm0521496"},{"name":"Susan Cooper","id":"nm0178402"}],"runtime":"120 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTBiODY1MTYtODk5Zi00NWIzLTliNmMtODMzMjE3ZTU5OTc4XkEyXkFqcGdeQXVyMTIxOTk5MzY@._V1.jpg","countries":["Canada","UK","USA"],"languages":["English"],"genres":["Drama"],"plot":"In the 1940s a 40-year-old woman with four healthy children gives birth to a girl with Down syndrome.","simplePlot":"In the 1940s a 40-year-old woman with four healthy children gives birth to a girl with Down syndrome.","actors":[{"actorName":"Farrah Fawcett","urlProfile":"http://www.imdb.com/name/nm0000396","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE3OTAzMTQ3OF5BMl5BanBnXkFtZTcwODkyMDU4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 February 1947","placeOfBirth":" Corpus Christi, Texas, USA","birthName":"Farrah Leni Fawcett","height":"5' 6\" (1.68 m)","bio":"Farrah Fawcett is a true Hollywood success story. A native of Texas, she was the daughter of Pauline Alice (Evans), a homemaker, and James Fawcett, an oil field contractor. She was a natural athlete, something that her father encouraged, and she attended a high school with a strong arts program. She attended University of Texas in Austin, graduating with a degree in Microbiology, but only wanted to be an actress. Winning a campus beauty contest got her noticed by an agent, who encouraged her to pursue acting. After graduating, she moved to Los Angeles and her healthy, all-American blond beauty was immediately noticed. She quickly got roles in various television commercials for such products as Ultra-Brite toothpaste, and Wella Balsam shampoo, and also made appearances in some TV series. In 1968, she met another Southerner, actor Lee Majors, star of the popular TV series The Big Valley (1965), on a blind date set up by their publicists. He became very taken with her and also used his own standing to promote her career. In 1969, she made her film debut in Love Is a Funny Thing (1969). The next year, she appeared in the film adaptation of the Gore Vidal bestselling novel Myra Breckinridge (1970). The shooting was very unpleasant, with much feuding on the set, and Farrah was embarrassed by the finished film, which was a major failure. But Farrah was undamaged and continued to win roles. In 1973, she and Majors married, and the following year, she won a recurring role in the crime series Harry O (1973). She had her first taste of major success when she won a supporting role in the science fiction film Logan's Run (1976). She came to the attention to the highly successful producer Aaron Spelling, who was impressed by her beauty and vivacious personality. That won her a role in the TV series Charlie's Angels (1976). She played a private investigator who works for a wealthy and mysterious businessman, along with two other glamorous female detectives, played by Kate Jackson and Jaclyn Smith. The show immediately became the most popular series on television, earning record ratings and a huge audience. All three actresses became very popular, but Farrah became by far the best known. She won People's Choice Award for Favorite Female Performer in a New TV program in 1977. Her lush, free-wheeling, wavy blond hair also became a phenomenon, with millions of women begging their hairstylists to give them \"The Farrah,\" as her hairstyle was called. Fawcett was also a savvy businesswoman, and she received 10% profit from the proceeds of her famous poster in a red swimsuit. It sold millions and she became the \"It Girl\" of the 1970s. Fawcett was America's sweetheart and found herself on every celebrity magazine and pursued by photographers and fans. While she enjoyed the success and got along well with her co-stars (both of whom were also of Southern origin), she found the material lightweight. Also, the long hours she worked were beginning to take a toll on her marriage to Majors, who found himself eclipsed by her popularity. So the following year, when the show was at its peak, she left to pursue a movie career. Charlie's Angels producers sued her, and the studios shied away from her, and she lost out on the lead role in the hit feature film Foul Play (1978) to Goldie Hawn. Eventually, she and the Charlie's Angels producers reached a settlement, where she would make guest appearances on the series. As a result of the negative publicity and some poor script choices, her career briefly hit a slow spot. In addition, she and Majors separated in 1979. She had starring roles in Somebody Killed Her Husband (1978), Sunburn (1979), and Saturn 3 (1980) (which she did a topless scene in), but all three failed financially. She appeared in the Burt Reynolds chase comedy The Cannonball Run (1981), which was successful financially, but it was met not only with bad reviews but also with bad publicity when Farrah's stunt double Heidi Von Beltz was involved in a stunt that went horribly wrong and left her a quadriplegic. Farrah's feature film career came to a halt, and she and Majors were drifting apart. In 1981, she met Ryan O'Neal, a friend of her husband's, and they began became friends and spent a great deal of time together. He also encouraged her to go back to television and she received good reviews in the well-received miniseries \"Murder in Texas\" (1981). In 1982, she filed for divorce, which Majors readily agreed to. Soon, she and O'Neal were a couple and moved in together. She set on sights on becoming a serious dramatic actress. She took over for Susan Sarandon in the stage play \"Extremities\" where she played a rape victim who turns the tables on her rapist. That, in turn, led her to her major comeback when she starred in the searing story of a battered wife in The Burning Bed (1984), based on a true story. It garnered a very large audience, and critics gave her the best reviews she had ever received for her heartfelt performance. She was nominated for both an Emmy and Golden Globe and also became involved in helping organizations for battered women. The following year, she and O'Neal became the parents of a son, 'Redmond O'Neal'. She tried to continue her momentum with a starring role in the feature film adaptation of Extremities (1986), and while she garnered a Golden Globe nomination, the film, itself, was not a hit. She continued to seek out serious roles, appearing mainly on television. She scored success again in Small Sacrifices (1989), again based on a true crime. Portraying an unhappy woman who is so obsessed with the man she loves that she shoots her children to make herself available and disguises it as a carjacking, Farrah again won rave reviews and helped draw a large audience, and was nominated for an Emmy again. Shortly afterwards, she and O'Neal co-starred in Good Sports (1991), playing a couple who co-star in a sports news program, but O'Neil's performance was lambasted and only 9 episodes were aired. In 1995, she surprised her fans by posing for \"Playboy\" at the age of 48, it became the magazine's best-selling issue of that decade. Her relationship with O'Neal was deteriorating, however, and in 1997, they broke up. The breakup took a toll, and she posed for Playboy again at the age of 50. To promote it, she appeared on Late Show with David Letterman (1993) and gave a rambling interview, sparking rumors of drug use. That same year, however, she made another comeback in The Apostle (1997), playing the neglected wife of a Pentacostal preacher, played by Robert Duvall. Both stars were praised and the film became a surprise hit. She also began dating James Orr, who had directed her earlier in the feature film Man of the House (1995). An incident occurred between them in 1998, and Farrah suffered injuries. The scandal drew nationwide headlines, especially after the tabloids published photos of Farrah with her injuries. The authorities compelled Fawcett to testify against Orr in court, and he was found guilty of assault and given a minimum sentence. Embarrassed, she lowered her profile and her career lost momentum, but she continued to work in television and films. She and O'Neal also started seeing each other again when he was diagnosed with leukemia. The new millennium brought her highs and lows. In 2000, she acted with Richard Gere in Robert Altman's film Dr. T & the Women (2000). Her son Redmond has had problems with drug abuse and has been in and out of jail. In 2001, she lost her only sister to cancer. In 2004, she received her third Emmy nomination for her performance in The Guardian (2003), and she starred in her own reality show titled \"Chasing Farrah\" in 2005 along with Ryan O'Neal, but that ended after only 7 episodes. That same year, she was devastated when her beloved mother died. In 2006, producer Aaron Spelling died, and she famously reunited with her Charlie's Angels co-stars Kate Jackson and Jaclyn Smith at the Emmys in a tribute to him. She looked tan and healthy, but soon, she was diagnosed with anal cancer. She asked her friend Alana Stewart to accompany her and videotape her during her doctor's visits. Those video journals resulted in the documentary \"Farrah's Story,\" co-executive produced by Fawcett. It aired in 2009, and viewers were shocked to see Farrah with a shaved head and in a continuous state of pain. Ryan O'Neal and Alana Stewart were constantly by her side, and her Charlie's Angels co-stars Kate Jackson and Jaclyn Smith also visited her, marking the final time that all three original angels appeared together on television. The documentary became a ratings success, and it earned a Emmy nomination as Outstanding Nonfiction Special. On June 25, 2009 Farrah lost her battle with cancer and passed away at aged 62. She left the bulk of her estate to her only son Redmond, and her trust fund allowed for the creation of The Farrah Fawcett Foundation, which provides funding for cancer research and prevention. Alana Stewart is the president of the Foundation and Jaclyn Smith's husband Dr. Brad Allen is one of the Board of Directors. Ryan O'Neal and Farrah's nephew Greg Walls are also on the Advisory Board, keeping alive her legacy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE3OTAzMTQ3OF5BMl5BanBnXkFtZTcwODkyMDU4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000396","name":"Farrah Fawcett","idIMDB":"nm0000396"},"actorId":"nm0000396","character":"Jewel Hilburn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patrick Bergin","urlProfile":"http://www.imdb.com/name/nm0000920","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NDkwNjc2M15BMl5BanBnXkFtZTYwMjc4MzQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1951","placeOfBirth":" Dublin, Ireland","birthName":"Patrick Connolly Bergin","height":"6' 4\" (1.93 m)","bio":"Patrick Bergin was born on February 4, 1951 in Dublin, Ireland as Patrick Connolly Bergin. He is an actor, known for Patriot Games (1992), Sleeping with the Enemy (1991) and Lawnmower Man 2: Beyond Cyberspace (1996). He has been married to Paula Frazier since 1992. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NDkwNjc2M15BMl5BanBnXkFtZTYwMjc4MzQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000920","name":"Patrick Bergin","idIMDB":"nm0000920"},"actorId":"nm0000920","character":"Leston Hilburn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cicely Tyson","urlProfile":"http://www.imdb.com/name/nm0001807","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4OTM1MDczN15BMl5BanBnXkFtZTcwNDI5NzcyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1924","placeOfBirth":" New York City, New York, USA","height":"5' 3½\" (1.61 m)","bio":"Cicely Tyson was born in Harlem, New York City, where she was raised by her devoutly religious parents, from the Caribbean island of Nevis. Her mother, Theodosia, was a domestic, and her father, William Tyson, was a carpenter and painter. She was discovered by a fashion editor at Ebony magazine and, with her stunning looks, she quickly rose to the top of the modeling industry. In 1957, she began acting in Off-Broadway productions. She had small roles in feature films before she was cast as Portia in The Heart Is a Lonely Hunter (1968). Four years later, Cicely was nominated for an Academy Award for Best Actress for her sensational performance in the critically acclaimed film Sounder (1972). In 1974, she went on to portray a 110-year-old former slave in The Autobiography of Miss Jane Pittman (1974), which earned her two Emmy Awards. She also appeared in the television miniseries Roots (1977), King (1978) and A Woman Called Moses (1978). While Cicely has not appeared steadily onscreen because of her loyalty to only portray strong, positive images of Black women, she is without a doubt one of the most talented, beautiful actresses to have ever graced the stage and screen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4OTM1MDczN15BMl5BanBnXkFtZTcwNDI5NzcyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001807","name":"Cicely Tyson","idIMDB":"nm0001807"},"actorId":"nm0001807","character":"Cathedral","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ashley Wolfe","urlProfile":"http://www.imdb.com/name/nm2827289","urlPhoto":"","biography":{"bio":"Ashley Wolfe is an actress, known for Un amour infini (2001) and Mr. Blue Sky (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2827289","name":"Ashley Wolfe","idIMDB":"nm2827289"},"actorId":"nm2827289","character":"Brenda Kay Hilburn - Age 16","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robin Dunne","urlProfile":"http://www.imdb.com/name/nm0242903","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM3OTA4NTE1Nl5BMl5BanBnXkFtZTgwMTc2MTk1MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1976","placeOfBirth":" Toronto, Ontario, Canada","height":"5' 9½\" (1.77 m)","bio":"Robin Dunne was born on November 19, 1976 in Toronto, Ontario, Canada. He is an actor and writer, known for Sanctuary (2008), Species III (2004) and Cruel Intentions 2 (2000). He has been married to Farrah Aviva since July 2016. He was previously married to Heidi Lenhart.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM3OTA4NTE1Nl5BMl5BanBnXkFtZTgwMTc2MTk1MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0242903","name":"Robin Dunne","idIMDB":"nm0242903"},"actorId":"nm0242903","character":"Wilman Hilburn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Donaldson","urlProfile":"http://www.imdb.com/name/nm0232145","urlPhoto":"","biography":{"dateOfBirth":"1953","placeOfBirth":" Midland, Ontario, Canada","bio":"Peter Donaldson was born in 1953 in Midland, Ontario, Canada. He was an actor, known for De beaux lendemains (1997), Deeply (2000) and Mars à table! (1999). He was married to Sheila McCarthy. He died on January 8, 2011 in Toronto, Ontario.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0232145","name":"Peter Donaldson","idIMDB":"nm0232145"},"actorId":"nm0232145","character":"Nathan White","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Laura Mercer","urlProfile":"http://www.imdb.com/name/nm0580281","urlPhoto":"","biography":{"bio":"Laura Mercer is an actress, known for Un amour infini (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0580281","name":"Laura Mercer","idIMDB":"nm0580281"},"actorId":"nm0580281","character":"Brenda Kay Hilburn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kelly Harms","urlProfile":"http://www.imdb.com/name/nm0363596","urlPhoto":"","biography":{"dateOfBirth":"27 April 1974","placeOfBirth":" Barrhead, Alberta, Canada","height":"6' 0½\" (1.84 m)","bio":"Born and raised in Alberta, Kelly's family are originally from Bellevue, Iowa. A self confessed Civil War buff, Kelly makes frequent trips to battle sites across the States.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0363596","name":"Kelly Harms","idIMDB":"nm0363596"},"actorId":"nm0363596","character":"Burton Hilburn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ron Payne","urlProfile":"http://www.imdb.com/name/nm0668421","urlPhoto":"","biography":{"bio":"Ron Payne was born in Canada. He is known for his work on Serendipity (2001), Uncle Buck (1989) and Land of the Dead - Le territoire des morts (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0668421","name":"Ron Payne","idIMDB":"nm0668421"},"actorId":"nm0668421","character":"Dr. Basket","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kristin Booth","urlProfile":"http://www.imdb.com/name/nm0095746","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzgxMjE4MTQ1MV5BMl5BanBnXkFtZTgwODA0MDI5NzE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1974","placeOfBirth":" Kitchener, Ontario, Canada","height":"5' 5\" (1.65 m)","bio":"Kristin Booth is a versatile performer experienced in film, television and theatre. Booth's feature film credits include several Toronto International Film Festival film selections, including Defendor: héros ou zéro (2009) and This Beautiful City (2007); as well as the heist thriller, Foolproof (2003), opposite Ryan Reynolds, On the Line (2001), Detroit Rock City (1999), Gossip (2000), Cruel Intentions 2 (2000) and Kardia (2006). Kristin won her first Gemini Award in 2005, for her guest performance in the ReGenesis (2004) episode, ReGenesis: Spare Parts (2004). She received her second Gemini Award nomination, for her portrayal of \"Connie Lewis\", in the new CBC series, M.V.P. (2008), which also aired on ABC Soapnet. Other television include: American Wife (2010), TNT's six-part mini-series, The Company (2007), opposite Chris O'Donnell and Alessandro Nivola, Prairie Giant: The Tommy Douglas Story (2006), Kaw (2007), Une ville en danger (2003), Salem Witch Trials (2002), The Hunt for the Unicorn Killer (1999), A Tale of Two Bunnies (2000), Un amour infini (2001) and Sleep Murder (2004), opposite Jason Priestley. She has also had lead roles in the series, The Newsroom (2004), Daring & Grace: Teen Detectives (2000), and has guest-starred in various series, including Supernatural (2005), 1-800-Missing (2003), This Is Wonderland (2004), Haute finance (1996), Nikita (1997), Puppets Who Kill (2002) and Show Me Yours (2004), among others. Kristin also starred in the pilot, My Best Friend's Girl (2008), for CBS. On stage, Kristin appeared with the prestigious \"Soulpepper Theatre Company\", garnering rave reviews for her portrayal of \"Olivia\" in \"Twelfth Night\". She was welcomed back to the company to play the title role in Ferenc Molnár's \"Olympia\". Most recently, Kristin appeared in her recurring role on The Border (2008), guest-starred on Rookie Blue (2010) for ABC, Flashpoint (2008) for CBS and CTV (third Gemini nomination), and The Listener (2009) for NBC and CTV. She also appeared in two independent Canadian features, At Home by Myself... with You (2009), for which she was nominated for a 2010 ACTRA award and Crackie (2009). Next up for this busy actor, starring opposite Olympia Dukakis and Brenda Fricker, in Thom Fitzgerald's feature film, Cloudburst (2011). Ms. Booth also voices the lead character in the animated series, Producing Parker (2009), alongside Kim Cattrall (Fourth Gemini Nomination). She recently starred, opposite Alyssa Milano, in Lifetime's Sundays at Tiffany's (2010), based on the book by NYT best-selling author, James Patterson, and portrays Ethel Kennedy in the controversial mini-series, Les Kennedy (2011), opposite Greg Kinnear, Katie Holmes, Tom Wilkinson and Barry Pepper.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzgxMjE4MTQ1MV5BMl5BanBnXkFtZTgwODA0MDI5NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0095746","name":"Kristin Booth","nicknames":["Kristi"],"idIMDB":"nm0095746"},"actorId":"nm0095746","character":"Annie Hilburn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Natalie Radford","urlProfile":"http://www.imdb.com/name/nm0705537","urlPhoto":"","biography":{"bio":"Natalie Radford is an actress, known for Darcy's Wild Life (2004), Superstar (1999) and P.T. Barnum (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0705537","name":"Natalie Radford","idIMDB":"nm0705537"},"actorId":"nm0705537","character":"Raylene Hilburn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sonia Lynn Kerr","urlProfile":"http://www.imdb.com/name/nm0449804","urlPhoto":"","biography":{"bio":"Sonia Lynn Kerr is an actress, known for Un amour infini (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0449804","name":"Sonia Lynn Kerr","idIMDB":"nm0449804"},"actorId":"nm0449804","character":"Brenda Kay Hilburn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexis Vandermaelen","urlProfile":"http://www.imdb.com/name/nm0888807","urlPhoto":"","biography":{"bio":"Alexis Vandermaelen is an actress, known for Un amour infini (2001), The Moving of Sophia Myles (2000) and Movin' On (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0888807","name":"Alexis Vandermaelen","idIMDB":"nm0888807"},"actorId":"nm0888807","character":"Annie Hilburn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rachel Skarsten","urlProfile":"http://www.imdb.com/name/nm0803896","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjcyNjc0Mzg5OF5BMl5BanBnXkFtZTgwMDcxNTM0NzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 April 1985","placeOfBirth":" Toronto, Ontario, Canada","height":"5' 10\" (1.78 m)","bio":"Rachel Alice Marie Skarsten was born April 23, 1985 to Mary Aileen Self Skarsten and Dr. Stan Skarsten. She has a younger brother Jonathan Skarsten, six years her junior whom she regards as her best friend. At the age of nine, her father died suddenly of pancreatic cancer. Rachel danced for the Royal Academy of Dance for 12 years, earning her Elementary Level with distinction in 1999. After an injury to her ankle, Rachel was forced to give up dance and turned to sports. She played at the highest level of competitive female hockey as a goalie for the Leaside Wildcats in Toronto, where in 2002 she won the Toronto City Championships in a shootout. At 17 she won a major role - that of superhero Black Canary/Dinah Lance - in the WB series \"Birds of Prey\", after being discovered by Producer Brian Robins. After the show was canceled, she moved home from Los Angles eager to take a hiatus from acting, to graduate high school and pursue an undergraduate degree. After graduating from Earl Haig Secondary School in the top 10% of her class, and being named an Ontario Scholar, she was accepted into the prestigious Canadian Queen's University. There she completed a double major in English Literature and Classical History. After graduation, she backpacked around Western Europe for four months with friends. She moved back to Los Angeles in the spring of 2008. She is a qualified lifeguard who feels most comfortable in the water, and is happy to be near the ocean in Santa Monica.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjcyNjc0Mzg5OF5BMl5BanBnXkFtZTgwMDcxNTM0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0803896","name":"Rachel Skarsten","nicknames":["Rachie"],"idIMDB":"nm0803896"},"actorId":"nm0803896","character":"Raylene Hilburn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kyle Fairlie","urlProfile":"http://www.imdb.com/name/nm0265621","urlPhoto":"","biography":{"birthName":"James Kyle Fairlie","bio":"Kyle Fairlie was born in Toronto, Ontario, Canada as James Kyle Fairlie. He is an actor, known for Adventures of Sonic the Hedgehog (1993), Look Who's Talking Now (1993) and One Week (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0265621","name":"Kyle Fairlie","nicknames":["Kap"],"idIMDB":"nm0265621"},"actorId":"nm0265621","character":"Burton Hilburn","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0245182","urlIMDB":"http://www.imdb.com/title/tt0245182","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"2000 Brenda Kay Productions Inc. (An Alliance Atlantis Company)"},"technical":{"runtime":["2 hr (120 min) (including commercials) (USA)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.3","filmingLocations":[{"location":"1116 King St. W., Toronto, Ontario, Canada"}],"awards":[{"award":"Directors Guild of Canada 2002","titlesAwards":[{"titleAwardOutcome":"Nominated DGC Team Award","categories":[{"category":"Outstanding Achievement in a Television Movie/Mini-Series","names":[{"name":"Paul Shapiro","id":"nm0788610","role":"Director"},{"name":"Steve Webb","id":"nm0916304","role":"1st Assistant Director"},{"name":"Pix Black","id":"nm0085470","role":"2nd Assistant Director"},{"name":"Sarah Buell","id":"nm0119153","role":"3rd Assistant Director"},{"name":"Helene C. Valinsky","id":"nm0884741","role":"Production Manager"},{"name":"Brian Backman","id":"nm0003873","role":"Production Assistant"},{"name":"Michael T. Burgess","id":"nm0121328","role":"Production Assistant"},{"name":"Munaf Husain","id":"nm0403971","role":"Production Assistant"},{"name":"Michael Lynch","id":"nm0528403","role":"Production Assistant"},{"name":"Barbara McCullam","id":"nm0567100","role":"Production Assistant"},{"name":"Ron McKenzie","id":"nm2436577","role":"Production Assistant"},{"name":"Michel Poirier","id":"nm0688555","role":"Production Assistant"},{"name":"Donna Demers","id":"nm0218338","role":"Production Accountant"},{"name":"B.E. Sharp","id":"nm0789004","role":"Production Accountant"},{"name":"Natalie Fokes","id":"nm1469459","role":"1st Assistant Accountant"},{"name":"Breigh Radford","id":"nm1442510","role":"2nd Assistant Accountant"},{"name":"Kristine Child","id":"nm0157468","role":"3rd Assistant Accountant"},{"name":"Anne Jurenas-Polyak","id":"nm0432904","role":"3rd Assistant Accountant"},{"name":"Robin Brinsmead","id":"nm0734255","role":"Location Manager"},{"name":"Craig McLaren","id":"nm0572204","role":"Assistant Location Manager"},{"name":"Laurance Wiese","id":"nm0927591","role":"Assistant Location Manager"},{"name":"Mario Mercuri","id":"nm0580503","role":"Location Scout"},{"name":"Guy Lalande","id":"nm0482350","role":"Production Designer"},{"name":"David Ferguson","id":"nm0272410","role":"Art Director"},{"name":"Vladislav Fyodorov","id":"nm0299529","role":"2nd Assistant Art Director"},{"name":"Mary O'Dell","id":"nm1137535","role":"3rd Assistant Art Director"},{"name":"Fiona Paterson","id":"nm0665487","role":"1st Assistant Picture Editor"},{"name":"Fred Brennan","id":"nm0107287","role":"Supervising Sound Editor"},{"name":"Etoile Stewart","id":"nm0829375","role":"1st Assistant Sound Editor"},{"name":"Brent Pickett","id":"nm0681878","role":"2nd Assistant Sound Editor"},{"name":"Robert Warchol","id":"nm0911331","role":"SFX Editor"},{"name":"Michele Cook","id":"nm0991262","role":"ADR Editor"}]}]}]},{"award":"Humanitas Prize 2001","titlesAwards":[{"titleAwardOutcome":"Nominated Humanitas Prize","categories":[{"category":"90 Minute or Longer Network Category","names":[{"name":"Susan Cooper","id":"nm0178402","role":null}]}]}]}],"votes":"209","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0054762","name":"Alliance Atlantis Communications"},{"idCompany":"co0037022","name":"Citadel Entertainment"},{"idCompany":"co0103800","name":"Grosvenor Park Productions"}],"keywords":{"keywords":["down syndrome","1940s","mentally handicapped","special school","special needs school","school","disability","disabled child","disabled girl","teaching assistant","mentally disabled","interracial friendship","interracial relationship","moving","childbirth","teenage girl","little girl","california","mississippi","brother sister relationship","father daughter relationship","mother daughter relationship","husband wife relationship","role played by multiple actors","younger version of character","family relationships","african american","housekeeper","1960s","female protagonist","one word title","based on true story","based on novel","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:07:11"}}