{"data":{"movies":[{"title":"Snow White: The Fairest of Them All","originalTitle":"Snow White","year":"2001","releaseDate":"20020317","directors":[{"name":"Caroline Thompson","id":"nm0003031"}],"writers":[{"name":"Jacob Grimm","id":"nm0342278"},{"name":"Wilhelm Grimm","id":"nm0342303"}],"runtime":"93 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzQ5NTI2OF5BMl5BanBnXkFtZTcwODEyNjMyMQ@@._V1.jpg","countries":["Canada","USA","Germany"],"languages":["English"],"genres":["Adventure","Family","Fantasy"],"plot":"Born from a drop of blood in a flutter of apple blossoms, and framed in ebony, a young girl named Snow White becomes the blessing of a loving peasant couple, John and Josephine. But with her birth comes a curse and the end of her mother's life. Left alone with an infant daughter, John braves a brutal winter in search of food for his starving angel. Salvation comes unexpectedly when the father's tears melt the frozen tomb of a bewitched creature, the Green-Eyed One. In thanks, the insinuating beast grants John three wishes: nourishment for Snow White, a kingdom in which to raise his family and a queen by his side. But John's cause for celebration is short-lived. For the Green-Eyed One has devious plans for the well-being of his own family. Owing his loathsome spellcasting daughter, Elspeth, a long-awaited wish, he encourages her desires for appointment to the throne. A kingdom to rule is hers for the waiting, the new King John is hers for the belittling and a luscious little ...","simplePlot":"Snow White's mother dies during childbirth, leaving baby Snow and father John for dead on an icy field, who then receives a visit from one of Satan's representatives, granting him three wishes.","actors":[{"actorName":"Miranda Richardson","urlProfile":"http://www.imdb.com/name/nm0001669","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NzM2ODE5N15BMl5BanBnXkFtZTcwNzAyMDc0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 March 1958","placeOfBirth":" Southport, Lancashire, England, UK","birthName":"Miranda Jane Richardson","height":"5' 5\" (1.65 m)","bio":"Miranda Richardson was born in Southport, Lancashire, England on March 3, 1958, to Marian Georgina (Townsend) and William Alan Richardson, a marketing executive. She has one sister, eight years her senior. Her parents and sister are not involved in the performing arts. At an early age she performed in school plays, having shown a talent and desire to \"turn herself into\" other people. She has referred to it as \"an emotional fusion; you think yourself into them\". This mimicry could be of school friends or film stars. She left school (Southport High School for Girls) at the age of 17, and originally intended becoming a vet. She also considered studying English literature in college, but decided to concentrate on drama and enrolled at the Bristol Old Vic Theatre School (as did many well-known British actors). After three years she graduated and moved into repertory theatre. She became affiliated with the Library Theatre in Manchester in 1979, where she became an assistant stage manager. She obtained her Equity card, and after several regional productions, first appeared on the London stage (Moving at Queens Theatre) in 1981. British television roles soon followed, and then film. Since then, Miranda has moved into the international arena, and has made films in America, France and Spain. Television work (on both sides of the Atlantic) continues, as does some stage work. Her roles are diverse, but powerful and engaging. She has been quoted as stating \"what I basically like is doing things I haven't done before\" and this continually comes through in the variety of roles she has played in her career. She is also selective in the roles she takes, being uninterested in performing in the standard Hollywood fare, and preferring more offbeat roles. She was approached to play the Glenn Close role in Fatal Attraction (1987), but found it \"regressive in its attitudes\". Her attitude is summed up by a quote from an interview that appeared in the New York Times (Dec 27 1992): \"I would rather do many small roles on TV, stage or film than one blockbuster that made me rich but had no acting. And if that's the choice I have to make, I think I've already made it\". According to \"1994 Current Biography Yearbook\", she resides in South London with her two Siamese cats, Otis and Waldo. She has now moved to West London. Her hobbies include drawing, walking, gardening, fashion, falconry, and music. She, by her own admission, is a loner and lives rather modestly. An actor who studied with Ms Richardson at the Bristol Old Vic Theatre in the late 1970s described her as \"a strong minded, specially gifted, rather pretty young woman who enjoys wearing jewelry. She wore toe rings, which in the late 1970s and especially in England, were a rarity and considered rather racy.\" He also remarked on her drive, even then, to be an actress of the highest caliber.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NzM2ODE5N15BMl5BanBnXkFtZTcwNzAyMDc0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001669","name":"Miranda Richardson","idIMDB":"nm0001669"},"actorId":"nm0001669","character":"Queen Elspeth","urlCharacter":"http://www.imdb.com/character/ch0047796","main":true},{"actorName":"Tom Irwin","urlProfile":"http://www.imdb.com/name/nm0410464","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4Njc0MTE2MF5BMl5BanBnXkFtZTYwNjQ0MTk2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1956","placeOfBirth":" Peoria, Illinois, USA","birthName":"Thomas Edward Irwin","bio":"A native of Illinois, Tom Irwin attended Illinois State University. After graduation, he joined the prestigious Steppenwolf Theatre Company of Chicago. The renowned ensemble of artists - among them Laurie Metcalf, John Malkovich, Gary Sinise and Joan Allen - still work together as often as possible. Irwin has been involved in over 50 Steppenwolf productions as an actor or director. Highlights include: \"The Grapes of Wrath\", also Royal National Theatre; \"Balm in Gilead\", also Off-Broadway; \"My Thing of Love\", also Broadway; \"Frank's Wild Years\", with Tom Waits; \"Space\", also Off-Broadway. In the summer of 2002 he co-starred with Madonna in \"Up for Grabs\" at the Wyndam's Theatre in London. He has been on the faculty of The Goodman School of Drama at Depaul University and Columbia College in Chicago. In addition to his filmography credits, he has starred in many telefilms and was a series regular on My Life and Times (1991) and My So-Called Life (1994). Tom makes his home in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4Njc0MTE2MF5BMl5BanBnXkFtZTYwNjQ0MTk2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0410464","name":"Tom Irwin","idIMDB":"nm0410464"},"actorId":"nm0410464","character":"John","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vera Farmiga","urlProfile":"http://www.imdb.com/name/nm0267812","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NzMwNTc1MV5BMl5BanBnXkFtZTcwNDE2ODU2OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1973","placeOfBirth":" Clifton, New Jersey, USA","birthName":"Vera Ann Farmiga","height":"5' 7\" (1.7 m)","bio":"Vera Farmiga is an American actress who received an Academy Award nomination for Best Supporting Actress for her role in Up in the Air (2009) and a Primetime Emmy Award nomination for Outstanding Lead Actress in a Drama Series for her role in Bates Motel (2013). She was born Vera Ann Farmiga, the second of seven children, on August 6, 1973, in Clifton, New Jersey, USA, to Ukrainian parents. She did not speak English until the age of six, and was raised in the Ukrainian Catholic home of her mother, Luba (Spas), a schoolteacher, and her father, Michael Farmiga, a computer systems analyst. Her younger sister is actress Taissa Farmiga, who is 21 years her junior. She attended a Ukrainian Catholic school, then went to public school. Young Vera was a shy, nearsighted girl, who played piano and folk danced with a Ukrainian touring company in her teens. In 1991, she graduated from Hunterdon Central Regional High School. She initially dreamed of becoming an optometrist, but changed her mind, and studied acting at Syracuse University's School of Performing Arts, graduating in 1995. The following year, she began her professional acting career, making her Broadway debut as an understudy in the play \"Taking Sides\". Her stage credits included performances in \"The Tempest\", \"Good\", \"The Seagull\", and in a well-reviewed off-Broadway production of \"Second-Hand Smoke\" (1997). That same year, she made her television debut as the female lead, opposite a then-unknown Heath Ledger, in Fox's adventure series Roar (1997). In 1998, Farmiga made her big screen debut in the drama Return to Paradise (1998), then played the daughters of Christopher Walken in The Opportunists (2000) and Richard Gere in Autumn in New York (2000). She starred as a working-class mother struggling to keep her life and marriage together while hiding her drug addiction in Down to the Bone (2004), for which she was awarded Best Actress from the 2004 Sundance Film Festival and the Los Angeles Film Critics Association. Farmiga's acting talent shone in a range of characters, from her role as a senator's daughter in The Manchurian Candidate (2004), the wife of a mobster in Running Scared (2006), a humorous prostitute in Breaking and Entering (2006), and a police psychiatrist in The Departed (2006). In 2010, Farmiga received an Academy Award nomination for Best Actress in a Supporting Role for her performance in Up in the Air (2009). In 2011, she made her directorial debut with the drama Higher Ground (2011), in which she also appears in the leading role. Although the film had a limited release, Farmiga's direction and performance received attention at several festivals. In 2013, she began starring in the drama thriller series Bates Motel (2013), for which she received a Primetime Emmy Award nomination for Outstanding Lead Actress in a Drama Series in the first season. Farmiga was formerly married to actor Sebastian Roché, whom she met during production of Roar (1997). The two eloped to the Bahamas after the series ended in 1997. They separated in 2003 and subsequently divorced. On September 13, 2008, she married musician Renn Hawkey, with whom she has two children, son Fynn McDonnell (b. 2009) and daughter Gytta Lubov Hawkey (b. 2010). Farmiga lives with her family in Hudson Valley, New York. Her other activities, outside her acting profession, include reading, playing piano, boxing, jujitsu, and spending time with her pet angora goats.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NzMwNTc1MV5BMl5BanBnXkFtZTcwNDE2ODU2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0267812","name":"Vera Farmiga","idIMDB":"nm0267812"},"actorId":"nm0267812","character":"Josephine","urlCharacter":"http://www.imdb.com/character/ch0441891","main":true},{"actorName":"Kristin Kreuk","urlProfile":"http://www.imdb.com/name/nm0471036","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTI0NjczMjIwMV5BMl5BanBnXkFtZTYwNzYwNDIz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 December 1982","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"Kristin Laura Kreuk","height":"5' 4\" (1.63 m)","bio":"Kristin Kreuk was born in Vancouver, British Columbia, Canada, to Deanna Che, who is of Chinese ancestry, and Peter Kreuk, who is of Dutch descent. Her parents are landscape architects. She attended and graduated from Eric Hamber High School. Although she did some stage work in school, she focused more on her studies. She described herself as shy and boring. For her first professional work, she went to an open casting audition for Edgemont (2000), a teen-drama series aired on CBC television in Canada. She plays the role of \"Laurel Yeung\". Laurel was the last main character to be cast because the casting director was having a problem finding an actress. Fortunately, for them (and us), they found Kristin just in time. Her career was set to take off when she landed on the highly acclaimed WB television series, Smallville (2001). It follows the story of \"Clark Kent\" in his pre-Superman days in a small town of Smallville, Kansas. Kristin played the role of \"Lana Lang\", Clark Kent's object of desire before he meets \"Lois Lane\". Smallville (2001) proved to be a giant step for Kristin's acting career, as she landed several interviews with several magazines, including YM (Young and Modern) and Rolling Stone. She also did a commercial for Neutrogena, popular for its skin care products.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTI0NjczMjIwMV5BMl5BanBnXkFtZTYwNzYwNDIz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0471036","name":"Kristin Kreuk","idIMDB":"nm0471036"},"actorId":"nm0471036","character":"Snow White","urlCharacter":"http://www.imdb.com/character/ch0026716","main":true},{"actorName":"Clancy Brown","urlProfile":"http://www.imdb.com/name/nm0000317","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxODY3NjAzMF5BMl5BanBnXkFtZTcwMTQ5MjYwNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1959","placeOfBirth":" Urbana, Ohio, USA","birthName":"Clarence J. Brown III","height":"6' 2½\" (1.89 m)","bio":"A tall, wavy-haired US actor with a deep, resonant voice, Clancy Brown has proved himself a versatile performer with first-class contributions to theater, feature films, television series and even animation. Clarence J. Brown III was born in 1959 in Urbana, Ohio, to Joyce Helen (Eldridge), a concert pianist, conductor, and composer, and Republican congressman Clarence J. \"Bud\" Brown, Jr., who helped manage the Brown Publishing Company, the family-owned newspaper started by Clancy's grandfather, Congressman Clarence J. Brown. Clancy spent much of his youth in close proximity to Washington, D.C. He plied his dramatic talents in the Chicago theater scene before moving onto feature film with a sinister debut performance bullying Sean Penn inside a youth reformatory in Bad Boys (1983). He portrayed Viktor the Monster in the unusual spin on the classic Frankenstein story in The Bride (1985), before scoring one of his best roles to date as the evil Kurgan hunting fellow immortals Christopher Lambert and Sean Connery across four centuries of time in Highlander (1986). Brown played a corrupt American soldier in the Walter Hill-directed hyper-violent action film Extreme Prejudice (1987), another deranged killer in Shoot to Kill (1988) and a brutal prison guard, who eventually somewhat \"befriends\" wrongfully convicted banker Tim Robbins, in the moving The Shawshank Redemption (1994). His superb vocal talents were in demand, and he contributed voices to animated series, including Mortal Kombat: Defenders of the Realm (1995), Street Sharks (1994), Gargoyles (1994) and Superman (1996). Brown then landed two more plum roles, one as a \"tough-as-nails\" drill sergeant in the science fiction thriller Starship Troopers (1997), and the other alongside Robin Williams in the Disney comedy Flubber (1997). The video gaming industry took notice of Clancy's vocal abilities, too, and he has contributed voices to several top selling video games, including Crash Bandicoot: The Wrath of Cortex (2001), Lands of Lore III (1999), Star Wars: Bounty Hunter (2002) and Crash Nitro Kart (2003). His voice is also the character of cranky crustacean Mr. Eugene H. Krabs in the highly successful SpongeBob SquarePants (1999) animated series and films, and he contributed voices to The Batman (2004), Jackie Chan Adventures (2000) and Justice League (2001) animated series. A popular and friendly personality, Clancy Brown continues to remain busy both through his vocal and acting talents in Hollywood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxODY3NjAzMF5BMl5BanBnXkFtZTcwMTQ5MjYwNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000317","name":"Clancy Brown","idIMDB":"nm0000317"},"actorId":"nm0000317","character":"The Granter of Wishes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vincent Schiavelli","urlProfile":"http://www.imdb.com/name/nm0001704","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MzA5OTY2M15BMl5BanBnXkFtZTYwODMwMjk1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 November 1948","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Vincent Andrew Schiavelli","height":"6' 5\" (1.96 m)","bio":"Vincent Schiavelli, selected in 1997 by Vanity Fair as one of the best character actors in America, had made over 120 film and television appearances. He studied acting at NYU's Theatre Program. Aside from his acting career, Vincent was the author of three cookbooks, and has written numerous articles on food for magazines and newspapers. In 2001, he received the James Beard Journalism Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MzA5OTY2M15BMl5BanBnXkFtZTYwODMwMjk1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001704","name":"Vincent Schiavelli","nicknames":["The Man with the Sad Eyes"],"idIMDB":"nm0001704"},"actorId":"nm0001704","character":"Wednesday","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"José Zúñiga","urlProfile":"http://www.imdb.com/name/nm0959242","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MTYyMTM5MF5BMl5BanBnXkFtZTgwOTM0OTU0ODE@._V1_UY44_CR21,0,32,44_AL_.jpg","biography":{"height":"5' 8½\" (1.74 m)","bio":"Born in Honduras, José moved to New York City at the age of 7. His first film was RIDING THE RAILS. Jose rode on freight trains and lived in homeless shelters during the 4 months of filming. When he returned to NYC his then agent secured him an audition for ALIVE directed by Frank Marshall.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MTYyMTM5MF5BMl5BanBnXkFtZTgwOTM0OTU0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0959242","name":"José Zúñiga","idIMDB":"nm0959242"},"actorId":"nm0959242","character":"Hector","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael J. Anderson","urlProfile":"http://www.imdb.com/name/nm0027199","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNDgwODE5MF5BMl5BanBnXkFtZTgwNTM0Nzc3MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1953","placeOfBirth":" Denver, Colorado, USA","height":"3' 7\" (1.09 m)","bio":"Michael Anderson was born in Huron, South Dakota, at 10:30 P.M., on Halloween night. Subject to a genetic anomaly known as Osteogenesis Imperfecta, he grew up in a wheelchair. After graduating high school, he traveled America, singing for tips and living in his car. For six years, he attended the University of Colorado where he majored in numerous subjects ranging from philosophy to microbiology. After college, he began working for Martin Marietta, trouble-shooting the N.A.S.A. computers in the ground-support system of the space shuttle. During this time, he made the documentary \"Little Mike,\" which won a silver medal in the International Film and Television Awards. Soon thereafter, he moved to New York City, where his film and television career began. For many years, Anderson was most well-known among fans of director David Lynch for his work as a backwards-talking dream figure on the cult favorite T.V. series Twin Peaks (1990). Anderson also worked with Lynch for the experimental performance piece Industrial Symphony No. 1: The Dream of the Brokenhearted (1990) and the T.V.-pilot-turned-feature film Mulholland Drive (2001). Anderson gained further recognition and success in recent years for his work on the H.B.O. series La caravane de l'étrange (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNDgwODE5MF5BMl5BanBnXkFtZTgwNTM0Nzc3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0027199","name":"Michael J. Anderson","idIMDB":"nm0027199"},"actorId":"nm0027199","character":"Sunday","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Warwick Davis","urlProfile":"http://www.imdb.com/name/nm0001116","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxNzk3MjA3Ml5BMl5BanBnXkFtZTcwOTAxNjA3Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 February 1970","placeOfBirth":" Epsom, Surrey, England, UK","birthName":"Warwick Ashley Davis","height":"3' 6\" (1.07 m)","bio":"English actor Warwick Davis was born in Epsom, Surrey, England, the son of Susan J. (Pain) and Ashley Davis, an insurance broker. Davis was born with the condition spondyloepiphyseal dysplasia congenital (SED), which caused his dwarfism. He was educated at City of London Freemen's School. When he was 11 years old, his grandmother heard a radio appeal for people under four feet tall to appear in Star Wars: Episode VI - Return of the Jedi (1983). A huge Star Wars fan, Davis auditioned successfully and was cast as an extra, playing an Ewok. Kenny Baker was cast as lead Ewok Wicket, but fell ill so George Lucas chose Davis to replace him. The film was a smash hit, and Davis went on to reprise his role as Wicket in further TV projects - The Ewok Adventure (1984) and Ewoks: The Battle for Endor (1985). Davis next big role came with a part specifically written for him, as the titular hero in Willow (1988). Other successes followed with roles in such projects as Prince Caspian and the Voyage of the Dawn Treader (1989) and two distinctly different film series - the 'Harry Potter' and 'Leprechaun' film series. In 2006, he appeared in a cameo role in Ricky Gervais and Stephen Merchant's hit sitcom Extras (2005), which led to the pair writing a series specifically for Davis, the comic mockumentary Life's Too Short (2011). Davis, along with his father-in-law Peter Burroughs, is also the director of an acting agency for very short and tall actors called Willow Management. He is married to Samantha Davis and they have a son and a daughter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxNzk3MjA3Ml5BMl5BanBnXkFtZTcwOTAxNjA3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001116","name":"Warwick Davis","idIMDB":"nm0001116"},"actorId":"nm0001116","character":"Saturday","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tyron Leitso","urlProfile":"http://www.imdb.com/name/nm0500739","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyMTk0NzQ4OV5BMl5BanBnXkFtZTYwOTQwNDky._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1976","placeOfBirth":" North Vancouver, British Columbia, Canada","bio":"Tyron Leitso was born on January 7, 1976 in North Vancouver, British Columbia, Canada. He is an actor, known for House of the Dead (2003), Les vies rêvées d'Erica Strange (2009) and Assault on Wall Street (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyMTk0NzQ4OV5BMl5BanBnXkFtZTYwOTQwNDky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0500739","name":"Tyron Leitso","idIMDB":"nm0500739"},"actorId":"nm0500739","character":"Prince Alfred","urlCharacter":"http://www.imdb.com/character/ch0040901","main":true},{"actorName":"Michael Gilden","urlProfile":"http://www.imdb.com/name/nm0318402","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MjQyMzcyNl5BMl5BanBnXkFtZTYwOTI1OTYy._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 September 1962","placeOfBirth":" Los Angeles, California, USA","height":"4' 6\" (1.37 m)","bio":"Michael Gilden was born on September 22, 1962 in Los Angeles, California, USA. He is known for his work on Pulp Fiction (1994), Star Wars: Episode VI - Return of the Jedi (1983) and Snow White: The Fairest of Them All (2001). He was married to Meredith Eaton and Elena Bertagnolli. He died on December 5, 2006 in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MjQyMzcyNl5BMl5BanBnXkFtZTYwOTI1OTYy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0318402","name":"Michael Gilden","idIMDB":"nm0318402"},"actorId":"nm0318402","character":"Monday","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark J. Trombino","urlProfile":"http://www.imdb.com/name/nm0873463","urlPhoto":"","biography":{"bio":"Mark J. Trombino is an actor, known for Snow White: The Fairest of Them All (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0873463","name":"Mark J. Trombino","idIMDB":"nm0873463"},"actorId":"nm0873463","character":"Tuesday","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Penny Blake","urlProfile":"http://www.imdb.com/name/nm0086688","urlPhoto":"","biography":{"bio":"Penny Blake is an actress, known for Snow White: The Fairest of Them All (2001), Once Upon a Christmas (2000) and Impossible n'est pas Noël (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0086688","name":"Penny Blake","idIMDB":"nm0086688"},"actorId":"nm0086688","character":"Thursday","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Martin Klebba","urlProfile":"http://www.imdb.com/name/nm0458514","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNzE5MzE2Nl5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 June 1969","placeOfBirth":" Troy, Michigan, USA","height":"4' (1.22 m)","bio":"Martin Klebba was born on June 23, 1969 in Troy, Michigan, USA. He is known for his work on Pirates of the Caribbean: Dead Men Tell No Tales (2017), Scrubs (2001) and Project X (2012). He has been married to Michelle Dilgard since June 18, 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNzE5MzE2Nl5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0458514","name":"Martin Klebba","nicknames":["Marty","Detroit"],"idIMDB":"nm0458514"},"actorId":"nm0458514","character":"Friday","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Campbell Lane","urlProfile":"http://www.imdb.com/name/nm0132655","urlPhoto":"","biography":{"dateOfBirth":"15 July 1935","placeOfBirth":" Montreal, Québec, Canada","birthName":"Campbell Francis Lane","bio":"Campbell Lane was born on July 15, 1935 in Montreal, Québec, Canada as Campbell Francis Lane. He was an actor, known for Cool Runnings (1993), Dreamcatcher (2003) and RoboCop: Alpha Commando (1998). He was married to Diane Lane. He died on January 30, 2014 in Vancouver, British Columbia, Canada.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0132655","name":"Campbell Lane","nicknames":["Cam"],"idIMDB":"nm0132655"},"actorId":"nm0132655","character":"Magistrate","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0255605","urlIMDB":"http://www.imdb.com/title/tt0255605","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 33 min (93 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.8","filmingLocations":[{"location":"Vancouver, British Columbia, Canada"}],"awards":[],"votes":"3,573","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0036184","name":"Babelsberg International Film Produktion"},{"idCompany":"co0069955","name":"Hallmark Entertainment"},{"idCompany":"co0076066","name":"Sextant Entertainment Group"}],"keywords":{"keywords":["snow white","daughter","wish","childbirth","fairy tale","f rated","witch","evil witch","color in title","two word title","witchcraft","widower","stepmother","single parent","prince","princess","poison apple","mission","mirror","loss of wife","fantasy life","dwarf","dead mother","compassion","bear","affection","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:46:59"}}