{"data":{"movies":[{"title":"The Mothman Prophecies","originalTitle":"","year":"2002","releaseDate":"20020125","directors":[{"name":"Mark Pellington","id":"nm0671210"}],"writers":[{"name":"Richard Hatem","id":"nm0368818"},{"name":"John A. Keel","id":"nm0444481"}],"runtime":"119 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjVmNDNjYWYtNzk0Mi00ZTU4LTljNDYtNDczZDE4NGMzZmQwXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Horror","Mystery","Thriller"],"plot":"John Klein is involved in a car accident with his wife, but while he is unharmed, his wife mentions a moth shaped creature appearing. After her death, John begins to investigate the secrets behind this mentioned Mothman. It takes him to a small town of Point Pleasant, West Virginia, where he discovers a connection with the same problem. Here he meets Connie Mills, while he continues to unravel the mystery of what the Mothman really is.","simplePlot":"A reporter is drawn to a small West Virginia town to investigate a series of strange events, including psychic visions and the appearance of bizarre entities.","actors":[{"actorName":"Richard Gere","urlProfile":"http://www.imdb.com/name/nm0000152","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NDQ2OTY4M15BMl5BanBnXkFtZTYwNTYyNjc4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 August 1949","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Richard Tiffany Gere","height":"5' 10\" (1.78 m)","bio":"Humanitarian and actor Richard Gere was born on August 31, 1949, in Philadelphia, the second of five children of Doris Ann (Tiffany), a homemaker, and Homer George Gere, an insurance salesman, both Mayflower descendants. Richard started early as a musician, playing a number of instruments in high school and writing music for high school productions. He graduated from North Syracuse Central High School in 1967, and won a gymnastics scholarship to the University of Massachusetts in Amherst, where he majored in philosophy. He left college after two years to pursue acting, landing a lead role in the London production of the rock musical \"Grease\" in 1973. The following year he would be in other plays, such as \"Taming of the Shrew.\" Onscreen, he had a few roles, and gained recognition in Looking for Mr. Goodbar (1977). Offscreen, he spent 1978 meeting Tibetans when he traveled to Nepal, where he spoke to many monks and lamas. Returning to the US, on Broadway he portrayed a concentration-camp prisoner in \"Bent,\" for which he received the 1980 Theatre World Award. Back in Hollywood, he played the title role in American Gigolo (1980), establishing himself as a major star; this status was reaffirmed by An Officer and a Gentleman (1982). In the early 1980s, Richard went to Honduras, Nicaragua and El Salvador (amidst ongoing wars and political violence); he traveled with a doctor and visited refugee camps. It is said that he was romantically linked with lovely Brazilian painter Sylvia Martins. In 1990 Richard teamed up with Julia Roberts to star in the blockbuster Pretty Woman (1990); his cool reserve was the perfect complement to Julia's bubbling enthusiasm. The film captured the nation's heart, and won the People's Choice award for Best Movie. Fans clamored for years for a sequel, or at least another pairing of Julia and Richard. They got that with Runaway Bride (1999), which was a runaway success (Richard got $12 million, Julia made $17 million, the box office was $152 million, which shows what happens when you give the public what it wants!). Offscreen, Richard and Cindy Crawford got married December 12, 1991 (they were divorced in 1995). Afterwards, Richard started dating actress Carey Lowell. They had a son, Homer James Jigme Gere, on February 6, 2000. Richard was picked by People magazine as one of the 50 Most Beautiful People in the world in 1991, and as their Sexiest Man Alive in 1999. He is an accomplished pianist and music writer. Above all, Richard is a humanitarian. He's a founding member of \"Tibet House,\" a nonprofit organization dedicated to the preservation of Tibetan culture. He has been an active supporter of \"Survival International\" for several years, a worldwide organization supporting tribal peoples, affirming their right to decide their own future and helping them protect their lives, lands and human rights (these tribes are global, including the natives of the Amazon, the Maasai of East Africa, the Wichi of Argentina, and others). In 1994 Richard went to London to open Harrods' sale, donating his £50,000 appearance fee to Survival. He has been prominent in their charity advertising campaigns.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NDQ2OTY4M15BMl5BanBnXkFtZTYwNTYyNjc4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000152","name":"Richard Gere","idIMDB":"nm0000152"},"actorId":"nm0000152","character":"John Klein","urlCharacter":"http://www.imdb.com/character/ch0012631","main":true},{"actorName":"David Eigenberg","urlProfile":"http://www.imdb.com/name/nm0251678","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTkwODc4ODQzNl5BMl5BanBnXkFtZTcwNTk3NzgyMQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 May 1964","placeOfBirth":" Manhasset, New York, USA","height":"5' 7½\" (1.71 m)","bio":"David was born on Long Island, New York, and has a younger sister named Betsy and an older sister named Helen, who is also a gifted actor. The family moved to Illinois when David was 4 and moved all around the suburbs of Chicago--Evanston, Northbrook, Aurora, and finally Naperville when the town was nothing more than a suburban farming town of 27,000 people. Going to public school all his years, he kicked around with the guys of his youth, many of which he still keeps up with. Every summer from the age of 12 on was a working summer, saving for college that only lasted 5 weeks, before he was kicked out. He met Ken Stien when he was 11. Ken was a local horseman who trained horses and riders alike. Being a transplant and a veteran like David's father, they all fit in together. Ken became a mentor and lifelong friend. Teenage drinking and mild drug abuse colored David's youth with several run-ins with the local police. Trouble followed him for many years before he got straight. Acting was somewhat of a natural progression. Working for the first time at the age of 12 in a community theater project, he landed a part, not in some cutesy kid story or clown play or happy happy show, but a production of Kurt Vonnegut's's \"Happy Birthday Wanda June\" directed by Dale Bowers. The piece was pretty risqué for a small town and walkouts abounded due to language and subject matter. The local critic was very taken by David's presence, and thus provided David's first and only positive review. A few more small local plays and musicals followed, but time and adolescence took him to different places. High school was typically unremarkable, less than average grades and anger was the menu for those years, leading to an undesired distinction of class clown in the class of '82, which upon receiving, he 'flipped off' the class and administration. The University of Iowa had accepted him, and he decided to pursue study in the field of social work. Moving back to Naperthrill, he moved into an apartment above an abandoned car dealership and took several different jobs--driving auto parts, doing road construction, and finally enlisting into the USMC reserves and letting that wash over him. The intense mandate laid before all recruits--that they must learn to toe the line and suck it up, and learn respect for others and then themselves--had a deep impact on him and followed him in all aspects of life. Dennis Rosa put him in the chorus of a Chicago hit musical, \"One Shining Moment\" starring Megan Mullally, Kevin Anderson and Alan Ruck. After the show's run, David had misgivings about his new profession and didn't quite feel accredited to be in it, having stumbled into the audition while the Chicago school district was on strike and he had no class. He applied and was accepted to the American Academy of Dramatic Arts. That decision took him to New York City. They were good days in the city, filled with a pace and energy he could now relate to, ironies abounded in the city, which had no time for its dead, nor patience for sentimentality. A friend simply 'by example' led him to sobriety. Reading plays and lacking of any real substantial work, it was years before anything of note came his way. Reading \"Six Degrees of Separation\" was the first time he discovered, like others, that John Guare had written a great play. He read for several parts first but it was the part of the nameless \"hustler\" that he knew he had to play and so \"serve\" this story. Years went by, little jobs in the theater followed, but most of the years were spent in east Harlem on 109th and 1st paying the bills with carpentry jobs and paint crews and then stumbling into a friendship with Al Noccella his partner in construction and beneficiary who kept him employed and ushered him out when it looked like the \"break\" had come. The character Steve in \"Sex and the City\" came after many auditions for many parts on the show and lasted for almost 5 years. At a USO gala event, he met Chrysti, an Army specialist, working the gate at Fort Monroe, Virginia and through a whole long, bizarre and weird series of events and lies, hooked his life to a woman that really meant the world to him.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTkwODc4ODQzNl5BMl5BanBnXkFtZTcwNTk3NzgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0251678","name":"David Eigenberg","idIMDB":"nm0251678"},"actorId":"nm0251678","character":"Ed Fleischman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bob Tracey","urlProfile":"http://www.imdb.com/name/nm0870430","urlPhoto":"","biography":{"dateOfBirth":"11 August 1923","placeOfBirth":" Rutherford, New Jersey, USA","birthName":"Robert Charles Michel","bio":"Bob Tracey was born on August 11, 1923 in Rutherford, New Jersey, USA as Robert Charles Michel. He was an actor, known for The Mothman Prophecies (2002), Only You (1994) and Darrow (1991). He was married to Marjorie Michel. He died on January 26, 2007 in Carnegie, Pennsylvania, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0870430","name":"Bob Tracey","idIMDB":"nm0870430"},"actorId":"nm0870430","character":"Cyrus Bills","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ron Emanuel","urlProfile":"http://www.imdb.com/name/nm0256045","urlPhoto":"","biography":{"bio":"Ron Emanuel is an actor, known for The Mothman Prophecies (2002), Autumn in New York (2000) and American Pastoral (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0256045","name":"Ron Emanuel","idIMDB":"nm0256045"},"actorId":"nm0256045","character":"Washington Post Reporter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Debra Messing","urlProfile":"http://www.imdb.com/name/nm0005226","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjUzMjg3M15BMl5BanBnXkFtZTcwMTc0NDU5OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 August 1968","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Debra Lynn Messing","height":"5' 8\" (1.73 m)","bio":"Messing was born in the New York City borough of Brooklyn, the daughter of Jewish American parents, Sandra (née Simons), who has worked as a professional singer, banker, travel and real estate agent, and Brian Messing, a sales executive for a jewelry manufacturer. When Messing was three, she moved with her parents and her older brother, Brett, to East Greenwich, a small town outside Providence, Rhode Island. During her high school years, she acted (and sang) in a number of high school productions, including the starring role in the musical \"Annie\" and \"Fiddler On the Roof.\" Messing took lessons in dance, singing, and acting. In 1986, she was Rhode Island's Junior Miss and competed in Mobile, Alabama in the America's Junior Miss scholarship program. While her parents encouraged her dream of becoming an actress, they also urged her to complete a liberal arts education before deciding on acting as a career. Following their advice, she attended Brandeis University in Waltham, Massachusetts. In 1990, after graduating summa cum laude from Brandeis with a bachelor's degree in theater arts, Messing gained admission to the elite Graduate Acting Program (which accepts only about 15 new students annually) at New York University, where she earned a master's degree in fine arts after three years. In 1998, Messing played a lead role as the bio-anthropologist Sloan Parker on ABC's dramatic science fiction television series Prey. During this time her agent approached her with the pilot script for the television show Will & Grace. Messing was inclined to take some time off, but the script intrigued her, and she auditioned for the role of Grace Adler, beating out Nicollette Sheridan, who later guest-starred on the show as a romantic rival of Grace's. Will & Grace became a ratings success, and Messing gained renown. In 2002, she was named one of the \"50 Most Beautiful People in the World\" by People Magazine. TV Guide picked her as its \"Best Dressed Woman\" in 2003. Messing met her husband, Daniel Zelman (an actor and screenwriter), on their first day as graduate students at NYU. The two were married on September 3, 2000, and live in New York City. On April 7, 2004, Messing gave birth to their son, Roman Walker Zelman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjUzMjg3M15BMl5BanBnXkFtZTcwMTc0NDU5OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005226","name":"Debra Messing","idIMDB":"nm0005226"},"actorId":"nm0005226","character":"Mary Klein","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Stoviak","urlProfile":"http://www.imdb.com/name/nm0832941","urlPhoto":"","biography":{"dateOfBirth":"5 October 1957","placeOfBirth":" Oak Ridge, Tennessee, USA","birthName":"Thomas Stoviak","height":"6' 1\" (1.85 m)","bio":"Tom Stoviak was born on October 5, 1957 in Oak Ridge, Tennessee, USA as Thomas Stoviak. He is an actor, known for The Mothman Prophecies (2002), She's Out of My League (2010) and Unstoppable (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0832941","name":"Tom Stoviak","nicknames":["Stov"],"idIMDB":"nm0832941"},"actorId":"nm0832941","character":"Real Estate Agent","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yvonne Erickson","urlProfile":"http://www.imdb.com/name/nm0109824","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg2MzI5OTkzMl5BMl5BanBnXkFtZTgwMDA1NjY5MTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Yvonne Erickson is an actress, known for The Mothman Prophecies (2002), The Dangerous Lives of Altar Boys (2002) and Ladder 49 (2004). She is married to Leo Erickson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg2MzI5OTkzMl5BMl5BanBnXkFtZTgwMDA1NjY5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0109824","name":"Yvonne Erickson","idIMDB":"nm0109824"},"actorId":"nm0109824","character":"Dr. McElroy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott Nunnally","urlProfile":"http://www.imdb.com/name/nm1119188","urlPhoto":"","biography":{"bio":"Scott Nunnally is an actor, known for The Mothman Prophecies (2002) and The Incredible Cases of Zara Gordon (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1119188","name":"Scott Nunnally","idIMDB":"nm1119188"},"actorId":"nm1119188","character":"Orderly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harris Mackenzie","urlProfile":"http://www.imdb.com/name/nm0533311","urlPhoto":"","biography":{"bio":"Harris Mackenzie is an actor, known for The Mothman Prophecies (2002) and Arlington Road (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0533311","name":"Harris Mackenzie","idIMDB":"nm0533311"},"actorId":"nm0533311","character":"TV Journalist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Will Patton","urlProfile":"http://www.imdb.com/name/nm0001599","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyOTEzNzMxMV5BMl5BanBnXkFtZTYwNTk2Njc3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 June 1954","placeOfBirth":" Charleston, South Carolina, USA","birthName":"William Rankin Patton","height":"5' 9½\" (1.77 m)","bio":"Will Patton was born in Charleston, South Carolina. His father, Bill Patton, is a playwright, acting/directing instructor, and Lutheran minister. Patton attended the North Carolina School of the Arts. He has won two OBIE awards for best actor for the off-Broadway plays, Sam Shepard's \"Fool for Love\" and the Public Theatre production of \"What Did He See?\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyOTEzNzMxMV5BMl5BanBnXkFtZTYwNTk2Njc3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001599","name":"Will Patton","idIMDB":"nm0001599"},"actorId":"nm0001599","character":"Gordon Smallwood","urlCharacter":"http://www.imdb.com/character/ch0067149","main":true},{"actorName":"Lucinda Jenney","urlProfile":"http://www.imdb.com/name/nm0421087","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NDcxMDU1OV5BMl5BanBnXkFtZTcwOTAzNzQwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 April 1954","placeOfBirth":" Long Island City, New York, USA","birthName":"Lucinda Kingsbury Jenney","bio":"Lucinda Jenney was born on April 23, 1954 in Long Island City, New York, USA as Lucinda Kingsbury Jenney. She is an actress, known for Rain Man (1988), Thelma & Louise (1991) and Thirteen Days (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NDcxMDU1OV5BMl5BanBnXkFtZTcwOTAzNzQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0421087","name":"Lucinda Jenney","idIMDB":"nm0421087"},"actorId":"nm0421087","character":"Denise Smallwood","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Laura Linney","urlProfile":"http://www.imdb.com/name/nm0001473","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMDc3Mzc2M15BMl5BanBnXkFtZTcwMjc5OTcyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1964","placeOfBirth":" New York City, New York, USA","birthName":"Laura Leggett Linney","height":"5' 7\" (1.7 m)","bio":"Laura Leggett Linney was born in New York City on February 5, 1964, into a theatre family. Her father was prominent playwright Romulus Linney, whose own great-grandfather was a congressman from North Carolina. Her mother, Miriam Anderson (Leggett), is a nurse. Although she did not live in her father's house (her parents having divorced when she was an infant), Linney's world revolved, in part, around his profession from the earliest age. She graduated from Brown University in 1986 and studied acting at Juilliard and the Arts Theatre School in Moscow and, thereafter, embarked on a career on the Broadway stage receiving favorable notices for her work in such plays as \"Hedda Gabler\" and \"Six Degrees of Separation\". Linney's film career began in the early 1990s with small roles in Lorenzo's Oil (1992) and Dave (1993). She landed the role of Mary Anne Singleton in the PBS film adaptations of Armistead Maupin's \"Tales of the City\" series, playing her in Armistead Maupin's Tales of the City (1993), Armistead Maupin's More Tales of the City (1998) and Chroniques de San Francisco (2001). Linney's first substantial big-screen role was as the ex-girlfriend of Richard Gere's character in Primal Fear (1996) and her superb performance brought her praise and a better selection of roles. Clint Eastwood chose Linney to play his daughter, another prominent role, in 1997's Absolute Power (1997), followed by another second billing in the following year's The Truman Show (1998). Always a strong performer, Linney truly came into her own after 2000, starting the decade auspiciously with her widely-praised, arguably flawless performance in You Can Count on Me (2000). She found herself nominated for an Academy Award for this, her first lead role, for which her salary had been $10,000. Linney won numerous critics' awards for her role as Sammy, a single mother whose life is complicated by a new boss and the arrival in town of her aimless brother. On the heels of this success came her marvelous turn as Bertha Dorset in The House of Mirth (2000), clearly the best performance in a film of strong performances. Since then, Linney has frequently been offered challenging dramatic roles, and always rises to the occasion, such as in Mystic River (2003), in which she worked again with Clint Eastwood, and Kinsey (2004), for which she received another Academy Award nomination.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMDc3Mzc2M15BMl5BanBnXkFtZTcwMjc5OTcyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001473","name":"Laura Linney","idIMDB":"nm0001473"},"actorId":"nm0001473","character":"Connie Mills","urlCharacter":"http://www.imdb.com/character/ch0012632","main":true},{"actorName":"Tom Tully","urlProfile":"http://www.imdb.com/name/nm0876452","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNzM3OTQ2OV5BMl5BanBnXkFtZTcwNzQwNzIzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Tom Tully was born in Chicago, Illinois, USA. He is an actor and writer, known for The Mothman Prophecies (2002), Salut l'ami, adieu le trésor (1981) and Porky's II (1983).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNzM3OTQ2OV5BMl5BanBnXkFtZTcwNzQwNzIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0876452","name":"Tom Tully","idIMDB":"nm0876452"},"actorId":"nm0876452","character":"Motel Manager","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zachary Mott","urlProfile":"http://www.imdb.com/name/nm0609446","urlPhoto":"","biography":{"bio":"Zachary Mott is an actor, known for The Mothman Prophecies (2002), Night of the Living Dead (1990) and The Bread, My Sweet (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0609446","name":"Zachary Mott","idIMDB":"nm0609446"},"actorId":"nm0609446","character":"Otto","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ann McDonough","urlProfile":"http://www.imdb.com/name/nm0568142","urlPhoto":"","biography":{"dateOfBirth":"21 April 1949","placeOfBirth":" USA","bio":"Ann McDonough was born on April 21, 1949 in the USA. She is an actress, known for The Mothman Prophecies (2002), Moonstruck (1987) and Lorenzo's Oil (1992). She is married to Jack Gilpin. They have three children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0568142","name":"Ann McDonough","idIMDB":"nm0568142"},"actorId":"nm0568142","character":"Lucy Griffin","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0265349","urlIMDB":"http://www.imdb.com/title/tt0265349","business":{"budget":{"money":"$32,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$11,208,851","country":"USA","day":"27","month":"01","year":"2002","remarks":"2,331 Screens"},{"money":"£762,516","country":"UK","day":"03","month":"03","year":"2002","remarks":"286 Screens"},{"money":"€759,713","country":"Italy","day":"26","month":"05","year":"2002","remarks":"275 Screens"}],"gross":[{"money":"$35,228,696","country":"USA","day":"17","month":"03","year":"2002","remarks":""},{"money":"$35,161,030","country":"USA","day":"10","month":"03","year":"2002","remarks":""},{"money":"$34,812,616","country":"USA","day":"03","month":"03","year":"2002","remarks":""},{"money":"$34,016,702","country":"USA","day":"24","month":"02","year":"2002","remarks":""},{"money":"$32,408,622","country":"USA","day":"17","month":"02","year":"2002","remarks":""},{"money":"$28,002,044","country":"USA","day":"10","month":"02","year":"2002","remarks":""},{"money":"$21,221,640","country":"USA","day":"03","month":"02","year":"2002","remarks":""},{"money":"$11,208,851","country":"USA","day":"27","month":"01","year":"2002","remarks":""},{"money":"£2,200,169","country":"UK","day":"24","month":"03","year":"2002","remarks":""},{"money":"£1,981,606","country":"UK","day":"17","month":"03","year":"2002","remarks":""},{"money":"£1,511,920","country":"UK","day":"10","month":"03","year":"2002","remarks":""},{"money":"£762,516","country":"UK","day":"03","month":"03","year":"2002","remarks":""},{"money":"€2,511,895","country":"Italy","day":"07","month":"07","year":"2002","remarks":""},{"money":"€2,478,616","country":"Italy","day":"30","month":"06","year":"2002","remarks":""},{"money":"€2,399,164","country":"Italy","day":"23","month":"06","year":"2002","remarks":""},{"money":"€2,276,901","country":"Italy","day":"16","month":"06","year":"2002","remarks":""},{"money":"€2,043,192","country":"Italy","day":"09","month":"06","year":"2002","remarks":""},{"money":"€1,458,241","country":"Italy","day":"02","month":"06","year":"2002","remarks":""},{"money":"€759,949","country":"Italy","day":"26","month":"05","year":"2002","remarks":""},{"money":"$223,363","country":"Russia","day":"04","month":"08","year":"2002","remarks":""},{"money":"€3,931,415","country":"Spain","day":"10","month":"08","year":"2002","remarks":""}],"weekendGross":[{"money":"$49,004","country":"USA","day":"17","month":"03","year":"2002","remarks":"66 Screens"},{"money":"$208,874","country":"USA","day":"10","month":"03","year":"2002","remarks":"273 Screens"},{"money":"$505,548","country":"USA","day":"03","month":"03","year":"2002","remarks":"524 Screens"},{"money":"$1,031,217","country":"USA","day":"24","month":"02","year":"2002","remarks":"818 Screens"},{"money":"$2,927,222","country":"USA","day":"17","month":"02","year":"2002","remarks":"1,410 Screens"},{"money":"$4,870,476","country":"USA","day":"10","month":"02","year":"2002","remarks":"2,275 Screens"},{"money":"$7,364,011","country":"USA","day":"03","month":"02","year":"2002","remarks":"2,331 Screens"},{"money":"$11,208,851","country":"USA","day":"27","month":"01","year":"2002","remarks":"2,331 Screens"},{"money":"£88,490","country":"UK","day":"24","month":"03","year":"2002","remarks":"140 Screens"},{"money":"£247,080","country":"UK","day":"17","month":"03","year":"2002","remarks":"233 Screens"},{"money":"£444,762","country":"UK","day":"10","month":"03","year":"2002","remarks":"277 Screens"},{"money":"£762,516","country":"UK","day":"03","month":"03","year":"2002","remarks":"286 Screens"},{"money":"€13,604","country":"Italy","day":"07","month":"07","year":"2002","remarks":"14 Screens"},{"money":"€40,782","country":"Italy","day":"30","month":"06","year":"2002","remarks":"27 Screens"},{"money":"€62,011","country":"Italy","day":"23","month":"06","year":"2002","remarks":"53 Screens"},{"money":"€121,368","country":"Italy","day":"16","month":"06","year":"2002","remarks":"110 Screens"},{"money":"€383,259","country":"Italy","day":"09","month":"06","year":"2002","remarks":"155 Screens"},{"money":"€398,293","country":"Italy","day":"02","month":"06","year":"2002","remarks":"257 Screens"}],"admissions":[{"money":"55,327","country":"Argentina","day":"17","month":"09","year":"2002","remarks":"27 screens"},{"money":"51,965","country":"Argentina","day":"10","month":"09","year":"2002","remarks":""},{"money":"268,183","country":"France","day":"30","month":"04","year":"2002","remarks":"281 screens"},{"money":"183,459","country":"France","day":"23","month":"04","year":"2002","remarks":"288 screens opening week"},{"money":"92,364","country":"Germany","day":"28","month":"04","year":"2002","remarks":""},{"money":"57,340","country":"Netherlands","day":"31","month":"12","year":"2002","remarks":""},{"money":"880,175","country":"Spain","day":"10","month":"08","year":"2002","remarks":""},{"money":"720,214","country":"Spain","day":"28","month":"03","year":"2002","remarks":""},{"money":"321,521","country":"Spain","day":"14","month":"03","year":"2002","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"24","month":"01","year":"2001","remarks":null},null],"copyrightHolder":"(2001) Lakeshore Entertainment Corp."},"technical":{"runtime":["1 hr 59 min (119 min)","2 hr 8 min (128 min) (Taiwan)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Panaflex Lightweight, Panavision Primo and Ultra Speed MKII Lenses","Panavision Panaflex Millennium XL, Panavision Primo and Ultra Speed MKII Lenses","Panavision Panaflex Platinum, Panavision Primo and Ultra Speed MKII Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA"],"filmLength":["3,254 m (Germany)"],"negativeFormat":["35 mm (Kodak Aerochrome II EIR 2443, Vision 200T 5274, Vision 500T 5279, Ektachrome 100D 5285)"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)"]},"rating":"6.5","metascore":"52","filmingLocations":[{"location":"Bentleyville, Pennsylvania, USA"}],"rated":"PG-13","awards":[{"award":"Fangoria Chainsaw Awards 2003","titlesAwards":[{"titleAwardOutcome":"3rd place Chainsaw Award","categories":[{"category":"Best Actress","names":[{"name":"Laura Linney","id":"nm0001473","role":null}]},{"category":"Best Supporting Actor","names":[{"name":"Will Patton","id":"nm0001599","role":null}]}]}]},{"award":"Motion Picture Sound Editors, USA 2003","titlesAwards":[{"titleAwardOutcome":"Won Golden Reel Award","categories":[{"category":"Best Sound Editing in a Feature - Music - Feature Film","names":[{"name":"Mark Jan Wlodarkiewicz","id":"nm0937258","role":"music editor"}]}]}]}],"votes":"65,718","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005323","name":"Lakeshore Entertainment"}],"keywords":{"keywords":["car accident","urban legend","death of wife","mothman","point pleasant west virginia","disaster","reporter","psychic","small town","telephone call","hospital","dream","brain tumor","cancer","journalist","warning","tumor","mysterious telephone call","mysterious voice","mysterious events","ringing telephone","ear bleeding","recounting a dream","strange happenings","car breakdown","character appears on tv","sketch","2 years later","three word title","bridge","wind chime","crying man","underwater scene","supernatural power","paranormal phenomena","obsession","premonition","omen","voice mail","ends with text","whispering","washington post the newspaper","traffic light","traffic jam","tow truck","time lapse photography","tear","sex on floor","sex in a closet","sex in car","seeing breath","running for your life","reports of strange events","pulling phone cable from the wall","prophesy of doom","police","police sergeant","police car","phone ringing","ohio","news broadcast","motel","man crying","magnetic resonance imaging","looking at oneself in a mirror","lipstick","hypothermia","hearing voices","frustration","extreme closeup","ecuador","earthquake","driving at night","dripping water","drawing","death by exposure","columbus ohio","christmas decorations","chicago illinois","cat scan","car falls into water","broken window","broken mirror","bright light","brain surgery","black out","spiritual creature","conspiracy theory","policewoman","cryptozoology","widower","product placement","airplane crash","governor","chemical plant","wreck","death of loved one","car wreck","hallucination","west virginia","precognition","christmas","based on supposedly true story","dead wife","bridge collapse","real estate agent","washington d.c.","glioblastoma","loss of wife","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 18:12:46"}}