{"data":{"movies":[{"title":"Bulletproof Monk","originalTitle":"","year":"2003","releaseDate":"20030416","directors":[{"name":"Paul Hunter","id":"nm0402995"}],"writers":[{"name":"Ethan Reiff","id":"nm0717550"},{"name":"Cyrus Voris","id":"nm0903456"}],"runtime":"104 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwODkxNzE4NzVeQTJeQWpwZ15BbWU3MDY5NDYwMzQ@._V1.jpg","countries":["USA","Canada"],"languages":["English","Tibetan","Panjabi","German"],"genres":["Action","Comedy","Fantasy","Romance"],"plot":"For 60 years a mysterious monk with no name has zigzagged the globe to protect an ancient scroll - a scroll that holds the key to unlimited power. Now the Monk must look for a new scrollkeeper. Kar is an unlikely candidate, a streetwise young man whose only interest is himself. But when he inadvertently saves the Bulletproof Monk from capture, the two become partners in a scheme to save the world from the scroll's most avid pursuer. Packed with spectacular special effects and martial arts action, the Monk, Kar, and a sexy Russian mob princess called Bad Girl must struggle to find, face, and fight the ultimate enemy.","simplePlot":"Based on the very underground comic book, a Tibetan monk becomes a mentor to a young street kid whom he can teach to protect a scroll.","actors":[{"actorName":"Yun-Fat Chow","urlProfile":"http://www.imdb.com/name/nm0000334","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1ODkzMDU4MF5BMl5BanBnXkFtZTYwODk0MzY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 May 1955","placeOfBirth":" Lamma Island, Hong Kong","birthName":"Chow Yun Fat","height":"6' 1\" (1.86 m)","bio":"Chow Yun Fat is a charismatic, athletically built and energetic Asian-born film star who first came to the attention of western audiences via his roles in the high-octane/blazing guns action films of maverick HK director John Woo. Chow was born in 1955 on the quiet island of Lamma, part of the then-British colony of Hong Kong, near its famous Victoria Harbour. His mother was a vegetable farmer and cleaning lady, and his father worked on a Shell Oil Company tanker. Chow's family moved to urban Hong Kong in 1965 and in early 1973, Chow attended a casting call for TVB, a division of Shaw Bros. productions. With his good looks and easy-going style, Chow was originally a heartthrob actor in non-demanding TV and film roles. However, his popularity increased with his appearance as white-suited gangster Hui Man-Keung in the highly popular drama TV series Shang Hai tan (1983). In 1985, Chow started receiving acclaim for his work and scored the Golden Horse (Best Actor) Award in Taiwan and another Best Actor Award from the Asian Pacific Film Festival for his performance in Hong Kong 1941 (1984). With these accolades, Chow came to the attention of Woo, who cast Chow in the fast-paced gangster film A Better Tomorrow (1986) (aka \"A Better Tomorrow\"). The rest, as they say, is history. The film was an enormous commercial success, and Chow's influence on young Asian males was not dissimilar to the adulation given to previous Asian film sensations such as Bruce Lee or Jackie Chan. Nearly every young guy in Hong Kong ran out and bought himself a \"Mark Coat,\" as they became known--a long, heavy woolen coat worn by Chow in the movie (although it is is actually very unsuited to Hong Kong's hot and humid climate). Further hard-edged roles in more John Woo crime films escalated Chow's popularity even higher, and fans all over the world flocked to see A Better Tomorrow II (1987) (aka \"A Better Tomorrow 2\"), The Killer (1989) (aka \"The Killer\"), and Hard Boiled (1992) (aka \"Hard Boiled\"). With the phenomenal global interest in the HK action genre, Chow was enticed to the United States and appeared in The Replacement Killers (1998) with Mira Sorvino, The Corruptor (1999) with Mark Wahlberg, and, for a change of pace, in the often-filmed romantic tale of Anna and the King (1999). Chow then returned to the Asian cinema circuit and starred in the critically lauded kung fu epic Crouching Tiger, Hidden Dragon (2000) (aka \"Crouching Tiger, Hidden Dragon\"). His wide appeal can be seen in his \"boy next door\" type of personality and his ability to play such a broad spectrum of roles from a comedic buffoon to a lovestruck Romeo to a trigger-happy professional killer. A highly entertaining and gifted actor with dynamic on-screen presence, Chow continues to remain in strong demand in many film markets.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1ODkzMDU4MF5BMl5BanBnXkFtZTYwODk0MzY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000334","name":"Yun-Fat Chow","nicknames":["Faat Tsai","Faat \"Gor\""],"idIMDB":"nm0000334"},"actorId":"nm0000334","character":"Monk With No Name","urlCharacter":"http://www.imdb.com/character/ch0016272","main":true},{"actorName":"Seann William Scott","urlProfile":"http://www.imdb.com/name/nm0005405","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjk1NTA1Ml5BMl5BanBnXkFtZTcwNjQyNjAwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1976","placeOfBirth":" Cottage Grove, Minnesota, USA","birthName":"Sean William Scott","height":"5' 11\" (1.8 m)","bio":"Seann William Scott was born in Cottage Grove, Minnesota, to Patricia Anne (Simons) and William Frank Scott, a factory worker. He was discovered at a talent competition in Los Angeles, and almost immediately was flown to New York by ABC to test for All My Children (1970). His face has also been seen from his basketball-playing appearance on a national Sunny Delight commercial and the recent American Express campaign with Magic Johnson. Seann was also seen on Something So Right (1996) for ABC. Seann shot a lead role in Aerosmith's music video, \"Hole in My Soul\" from the \"Nine Lives\" CD. Previously, Seann has worked with Mark-Paul Gosselaar (of Saved by the Bell (1989)) and Talia Shire (Rocky (1976)) on the NBC movie of the week, Born Into Exile (1997), and has had a recurring role in the Warner Brothers TV series, Unhappily Ever After (1995), as well as appearing on Sweet Valley High (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjk1NTA1Ml5BMl5BanBnXkFtZTcwNjQyNjAwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005405","name":"Seann William Scott","idIMDB":"nm0005405"},"actorId":"nm0005405","character":"Kar","urlCharacter":"http://www.imdb.com/character/ch0016271","main":true},{"actorName":"Jaime King","urlProfile":"http://www.imdb.com/name/nm0454809","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNDE1NTc0Nl5BMl5BanBnXkFtZTgwMDY1MTcyNDE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 April 1979","placeOfBirth":" Omaha, Nebraska, USA","height":"5' 8½\" (1.74 m)","bio":"Jaime King was born on April 23, 1979 in Omaha, Nebraska, USA. She is an actress and producer, known for Pearl Harbor (2001), Hart of Dixie (2011) and Sin City (2005). She has been married to Kyle Newman since November 23, 2007. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNDE1NTc0Nl5BMl5BanBnXkFtZTgwMDY1MTcyNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0454809","name":"Jaime King","idIMDB":"nm0454809"},"actorId":"nm0454809","character":"Jade","urlCharacter":"http://www.imdb.com/character/ch0040021","main":true},{"actorName":"Karel Roden","urlProfile":"http://www.imdb.com/name/nm0734558","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzEzMzAzNjMxM15BMl5BanBnXkFtZTcwNTk2NzM3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 May 1962","placeOfBirth":" Ceské Budejovice, Czechoslovakia [now Czech Republic]","height":"6' 1\" (1.85 m)","bio":"Karel Roden is an internationally known actor who was most recently seen in the United States in director Jaume Collet-Serra's \"Orphan,\" starring Vera Farmiga and Peter Sarsgaard, and in Guy Ritchie's \"RocknRolla,\" opposite Gerard Butler, Tom Wilkinson and Thandie Newton. His work can also be seen in such films as the hit comedy \"Mr. Bean's Vacation,\" starring Rowan Atkinson; Wayne Kramer's \"Running Scared,\" opposite Paul Walker and Vera Farmiga; Paul Greengrass' wildly successful \"The Bourne Supremacy,\" the second film in the franchise starring Matt Damon; Guillermo del Toro's comics-based action thrillers \"Hellboy\" and \"Blade II\"; \"Bulletproof Monk,\" starring Chow Yun-Fat and Seann William Scott; and \"15 Minutes,\" starring Robert De Niro and Edward Burns. Roden has been nominated several times and recently won a prestigious Czech Lion Award for Best Actor for his work in the film \"Guard No. 47,\" produced in his native country, the Czech Republic. He has acted in numerous Czech films, including \"Jménem krále\"; \"The Eye\"; \"Holka Ferrari Dino\"; \"Bathory\"; \"Little Girl Blue\"; \"Bestiar\"; \"Vaterland - Lovecký deník\"; and \"Wild Flowers.\" Roden has also acted in a variety of films produced throughout Europe, including France's \"Largo Winch,\" from director Jérôme Salle and starring Kristin Scott Thomas; Spain's \"The Abandoned,\" Poland's \"Summer Love\"; and the UK's \"Shut Up and Shoot Me\" and \"The Last Drop.\" He appeared as himself in Jan Nemec's documentary \"Late Night Talks with Mother.\" On the small screen, Roden has appeared in the US series \"The Philanthropist,\" the UK series \"MI-5\" and \"The Scarlet Pimpernel,\" and in countless Czech productions, including the series \"Trapasy\" and the telepic \"A Christmas Tale.\" A graduate of the Prague Dramatic Academy of Fine Arts, Roden hails from a long tradition of Czech actors: his younger brother, Marian, is also an actor, and both men followed in the footsteps of their father and grandfather. Roden's upcoming films include the horror thriller \"Andrassy Street 60.,\" opposite Talia Shire and Barry Corbin; the German period drama \"Habermann\"; and \"Alois Nebel,\" an animated feature from the Czech Republic.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzEzMzAzNjMxM15BMl5BanBnXkFtZTcwNTk2NzM3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0734558","name":"Karel Roden","idIMDB":"nm0734558"},"actorId":"nm0734558","character":"Strucker","urlCharacter":"http://www.imdb.com/character/ch0016273","main":true},{"actorName":"Victoria Smurfit","urlProfile":"http://www.imdb.com/name/nm0810729","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMTg3NTIyMV5BMl5BanBnXkFtZTgwMjc3NTAxNjE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 March 1974","placeOfBirth":" Dublin, Ireland","height":"5' 8\" (1.73 m)","bio":"Victoria Smurfit was born on March 31, 1974 in Dublin, Ireland. She is an actress and producer, known for The Beach (2000), Bulletproof Monk (2003) and About a Boy (2002). She was previously married to Douglas Baxter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMTg3NTIyMV5BMl5BanBnXkFtZTgwMjc3NTAxNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0810729","name":"Victoria Smurfit","idIMDB":"nm0810729"},"actorId":"nm0810729","character":"Nina","urlCharacter":"http://www.imdb.com/character/ch0016274","main":true},{"actorName":"Marcus Jean Pirae","urlProfile":"http://www.imdb.com/name/nm1070061","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmFmZjNiODAtODcwYi00MGE4LWJhOTgtZTNlODU0ZTY2MjQ4L2ltYWdlXkEyXkFqcGdeQXVyNTUxODIxNzg@._V1_UY44_CR10,0,32,44_AL_.jpg","biography":{"bio":"Marcus Jean Pirae first appeared in the British independent film 'Somnolence'. He came into the Hollywood arena after landing the role of \"Mr Fuktastik\" in MGM's 'Bulletproof Monk', produced by John Woo, starring opposite Chow Yun-Fat, Seann William Scott and Jaimie King. He was next seen in 'La Femme Musketeer' starring as Captain Villeroi, acting opposite Gerard Depardieu, John Rhys-Davies, Michael York and Nastasya Kinski. Shortly after, he began shooting another lead role, in the multi award winning indie feature film 'Stripped Down', closely followed by playing the part of Dr. Marshal Peters in 'Supernova' alongside Peter Fonda. He most recently played the role of 'Alan Campbell Johnson' in 'Viceroy's House' acting with Michael Gambon and Hugh Bonneville. Pirae currently resides in Los Angeles CA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmFmZjNiODAtODcwYi00MGE4LWJhOTgtZTNlODU0ZTY2MjQ4L2ltYWdlXkEyXkFqcGdeQXVyNTUxODIxNzg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1070061","name":"Marcus Jean Pirae","idIMDB":"nm1070061"},"actorId":"nm1070061","character":"Mr. Funktastic","urlCharacter":"http://www.imdb.com/character/ch0113358","main":true},{"actorName":"Mako","urlProfile":"http://www.imdb.com/name/nm0538683","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDYzODA3Nl5BMl5BanBnXkFtZTcwMDA0MjEzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1933","placeOfBirth":" Kobe, Japan","birthName":"Makoto Iwamatsu","height":"5' 4\" (1.63 m)","bio":"Born in Japan, Mako was living there with his grandparents while his parents studied art in the United States, when Japan and the U.S. went to war in 1941. His parents remained in the U.S., working for the Office of War Information, and, at the cessation of the conflict, were granted U.S. residency by Congress. Mako joined his parents in New York and studied architecture. He entered the U.S. Army in the early 1950s and acted in shows for military personnel, discovering a talent and love for the theatre. He abandoned his plans to become an architect and instead enrolled at the famed Pasadena Community Playhouse in California. Following his studies there, he appeared in many stage productions and on television. In 1966, he won an Academy Award nomination as Best Supporting Actor for his first film role, as the coolie Po-Han in The Sand Pebbles (1966). Only occasionally since have his roles reached the level of his talents, but he has worked steadily in feature films ever since. He appeared on Broadway in the leading role in Stephen Sondheim's \"Pacific Overtures\" and he co-founded and served as artistic director for the highly-acclaimed East-West Players theatre company in Los Angeles. After a long battle and illness from cancer, he passed away on the twenty first of July in 2006, at the age of 72. He was survived by his wife, Shizuko Hoshi, who co-starred in episodes of M*A*S*H (1972), as well, and his children and grand-children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDYzODA3Nl5BMl5BanBnXkFtZTcwMDA0MjEzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0538683","name":"Mako","idIMDB":"nm0538683"},"actorId":"nm0538683","character":"Mr. Kojima","urlCharacter":"http://www.imdb.com/character/ch0113359","main":true},{"actorName":"Roger Yuan","urlProfile":"http://www.imdb.com/name/nm0950619","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NTg0OTcxNF5BMl5BanBnXkFtZTgwMzU3MDYwMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 January 1961","placeOfBirth":" Carbondale, Illinois, USA","birthName":"Roger Winston Yuan","height":"5' 10\" (1.78 m)","bio":"Roger Yuan's career in the film industry has seen him wear many hats. As a martial arts fight trainer, action coordinator, actor, writer and producer, he has gained much acclaim. Having worked in US, UK, Hong Kong, China, Thailand and Indian \"Bollywood\" and Vietnam productions, he has cultivated a global appeal Roger has amassed a wide repertoire of expertise in various martial arts styles and unique physical training regimens and has trained the likes of Michelle Pfeiffer for Catwoman in Batman Returns, Rene Russo, John Cusack, Michael Madsen, Henry Cavill, Immortals, Jason Flemyng and Jennifer Lawrence for X Men:First Class, Keanu Reeves for 47 Ronin and Daniel Craig for Skyfall. Country singing star Tim McGraw is a recent client enlisting Roger to get him in shape for his 2012 \"Brothers of the Sun Summer Tour\". Roger has choreographed action for films such as Son of The Pink Panther, Death Becomes Her, Ella Enchanted, Black Dynamite, X Men: first Class, 47 Ronin and the 50th anniversary 007 film, Skyfall, Once Upon a Time in Vietnam, and Warcraft. Roger's acting debut came in Red Corner with Richard Gere. As an actor that does his own stunts, He won the respect of Hong Kong action luminaries Jackie Chan, Yuen Biao (Shanghai Noon), Sammo Hung, jet Li (Once Upon a Time in China and America), and Chow Yun Fat (Bulletproof Monk). And action directors Dee Dee Ku, Dion Lam, Hung Yan Yan and Steven Ching su Tung. Roger has also shaped comedic roles with action, he has lead roles in Warner Bros. Chandni Chowk to China, and sony's Black Dynamite. 2015 will see Roger in Crouching Tiger Hidden Dragon: the Green Destiny, playing Iron Crow, which director and action legend Master Yuen Woo Ping personally chose Roger for this lead role.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NTg0OTcxNF5BMl5BanBnXkFtZTgwMzU3MDYwMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0950619","name":"Roger Yuan","idIMDB":"nm0950619"},"actorId":"nm0950619","character":"Master Monk","urlCharacter":"http://www.imdb.com/character/ch0016275","main":true},{"actorName":"K.C. Collins","urlProfile":"http://www.imdb.com/name/nm0172220","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMzc4NTE1MF5BMl5BanBnXkFtZTgwMzgzODE0MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Christopher Carl Collins","height":"6' 2\" (1.88 m)","bio":"K.C. Collins was born as Christopher Carl Collins. He is known for his work on RoboCop (2014), Lost Girl (2010) and Bulletproof Monk (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMzc4NTE1MF5BMl5BanBnXkFtZTgwMzgzODE0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0172220","name":"K.C. Collins","nicknames":["Mezmo","K.C."],"idIMDB":"nm0172220"},"actorId":"nm0172220","character":"Sax","urlCharacter":"http://www.imdb.com/character/ch0113360","main":true},{"actorName":"Sean Bell","urlProfile":"http://www.imdb.com/name/nm0068511","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzMxNDU1MV5BMl5BanBnXkFtZTcwNDIzODcyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 December 1970","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Sean H. Bell","bio":"Sean Bell was born on December 22, 1970 in Toronto, Ontario, Canada as Sean H. Bell. He is an actor, known for Bulletproof Monk (2003), Against the Ropes (2004) and One Kill (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzMxNDU1MV5BMl5BanBnXkFtZTcwNDIzODcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0068511","name":"Sean Bell","idIMDB":"nm0068511"},"actorId":"nm0068511","character":"Diesel","urlCharacter":"http://www.imdb.com/character/ch0113361","main":true},{"actorName":"Kishaya Dudley","urlProfile":"http://www.imdb.com/name/nm1354894","urlPhoto":"","biography":{"bio":"Kishaya Dudley is known for her work on Bulletproof Monk (2003), Camp Rock (2008) and Roll Bounce (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1354894","name":"Kishaya Dudley","idIMDB":"nm1354894"},"actorId":"nm1354894","character":"DV","urlCharacter":"http://www.imdb.com/character/ch0113362","main":true},{"actorName":"Rob Archer","urlProfile":"http://www.imdb.com/name/nm1353738","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyODUzNTE1N15BMl5BanBnXkFtZTgwMDA5NzE2OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 6\" (1.98 m)","bio":"They didn't throw away the mold, when it came to Rob Archer. He broke it. At 6'6\", and 285 lbs. of solid, etched muscle, Archer moves like a comic book superhero come to life. As an actor, he moves smoothly between playing the recurring role of Bio-Man on \"Defiance\" [Seasons 1,2,3], the recurring role of Bruce on \"Lost Girl\" [Seasons 3, 4, 5] and the \"Lost Girl\" webisodes, four different characters on \"Warehouse 13,\" guest-starred as The Brain on \"XIII: The Series,\" Vernon Hicks in The Samaritan, and Buzz on Bulletproof Monk. Archer's credits also include \"Beauty and the Beast,\" Kickass2, \"Flashpoint,\" \"Alphas,\" and Repo Men. For the winter of 2015, Archer embodies what is becoming, according to Hitfix, this generation's premiere bogeymen: Krampus in A Christmas Horror Story, co-starring William Shatner, which premiered at Fantasia, 2015. Certainly this is bolstered by two awards from the 2015 After Dark Film Festival: Best Monster/Creature (Krampus) and best Villain (Krampus played by Rob Archer). Archer has just completed work on 22 Chaser, playing opposite Brian J. Smith (Sense8) and Raoul Trujillo (Sicario) and Operation Insanity where he takes on, literally, James Caan. Before that, he most recently appeared as the lead Navy Seal in Adam Sandlers, Pixels, trading lines with Josh Gad. Archer's career began as a stuntman/actor on \"Mutant X\" when he played the villain in the Season 2 finale. He was brought back to the series again in their third season and also appeared in Robocop. A consistent pattern emerged where producers took note of his acting and expanded his roles to keep him on screen longer. Beyond film and television, the video game world has discovered his potential. Archer's work for a major label video game will be announced in the near future. This is a natural evolution from his character 'The Conduit' in the GlassMonkey Studios comic book of the same name. The character of 'Conduit', harnesses energy as his power to combat evil, is drawn by the legendary artist Tony Gray, was modeled after Archer. As a spokesperson, Archer is not only the international ambassador for Mr Hyde for Pro Supps, from Professional Supplements, the world wide top tier sports nutrition company based out of the USA, he is also the face of the franchise.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyODUzNTE1N15BMl5BanBnXkFtZTgwMDA5NzE2OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1353738","name":"Rob Archer","nicknames":["Big Robbie"],"idIMDB":"nm1353738"},"actorId":"nm1353738","character":"Buzz","urlCharacter":"http://www.imdb.com/character/ch0084688","main":true},{"actorName":"Mauricio Rodas","urlProfile":"http://www.imdb.com/name/nm0734436","urlPhoto":"","biography":{"bio":"Mauricio Rodas is an actor, known for Bulletproof Monk (2003), Narc (2002) and Glitter (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0734436","name":"Mauricio Rodas","idIMDB":"nm0734436"},"actorId":"nm0734436","character":"Wicho","urlCharacter":"http://www.imdb.com/character/ch0113363","main":true},{"actorName":"Bayo Akinfemi","urlProfile":"http://www.imdb.com/name/nm1240779","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmM3ZDQxZDYtY2JmYS00ZmRlLWEwZjctODRkNTU2ZjJjMjg2XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Bayo Akinfemi is an actor and director, known for Bulletproof Monk (2003), Human Cargo (2004) and Far Cry 2 (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmM3ZDQxZDYtY2JmYS00ZmRlLWEwZjctODRkNTU2ZjJjMjg2XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1240779","name":"Bayo Akinfemi","idIMDB":"nm1240779"},"actorId":"nm1240779","character":"Shade","urlCharacter":"http://www.imdb.com/character/ch0113364","main":true},{"actorName":"Russell Yuen","urlProfile":"http://www.imdb.com/name/nm0004067","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MzM5MDQyM15BMl5BanBnXkFtZTcwMjcwMzI2Mg@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 October 1965","placeOfBirth":" Montreal, Quebec, Canada","height":"5' 8\" (1.73 m)","bio":"Toronto/Montreal-based Russell Yuen is one of Canada's busiest character actors. Like most actors Yuen spent his early career doing an assortment of jobs to make ends meet while he became established. Unlike most actors it wasn't waiting tables or serving drinks. A dedicated athlete, Yuen spent his time as a white water rescuer and rafting guide in Northern Quebec, ran a Nautilus facility and worked as a fitness trainer. Yuen is also an enthusiastic scuba diver, a mountain and ice-climber, an in-line skater, a mountain biker and a fencer. A former martial artist in Shaolin, Yuen used his stunt skills to move from bit parts, playing Asian gangsters and fighters, into meatier roles. His breakout opportunity came with The Red Violin and more feature film parts quickly followed for this versatile young actor whose skills range from action, to drama, to broad comedy. Other screen performances include Bulletproof Monk directed by John Woo, Owning Mahoney and Long Life, Happiness and Prosperity. He has appeared in Billy Ray's Shattered Glass, David Weaver's Indie feature Century Hotel; Between the Moon and Montevideo; Phillip Noyce's The Bone Collector, opposite Denzel Washington; David Mamet's The Heist; Ron Underwood's Pluto Nash, opposite Eddie Murphy, and Stephan Elliot's Eye Of The Beholder. Well known to Quebec audiences for his film work Yuen starred in the Quebec feature film Ballade des Dangereux, directed by Louis Saia. Yuen has an extensive list of television credits on both English and French projects and series. He was most recently featured on the popular French series Jack Carter, in the recurring role of impotent mobster \"Wong Phat\". He has a recurring role in Diva and other recent television credits include principal roles in: Relic Hunter; The Associates; A Touch of Hope; and The Adventures of Jules Verne. Television credits also include multiple appearances in Kung Fu:The Legend Continues, and roles in Urban Angel, Counterstrike, John Woo's Once A Thief, and PSI Factor. Fluently bilingual (French/English) Yuen maintains homes in both Toronto and Montreal. A fourth-generation Canadian, born and raised in the Montreal suburbs of St. Laurent and Pierrefond, with deep connections to Vancouver (all of his extended family live there still), Yuen was guided by his parents to become a doctor. However, his studies came to an abrupt halt when a chance Drama elective turned into a full-time pursuit. After studying Theatre at Concordia University, in the honors program, he quickly moved into film and television where he has found continuing success.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MzM5MDQyM15BMl5BanBnXkFtZTcwMjcwMzI2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004067","name":"Russell Yuen","idIMDB":"nm0004067"},"actorId":"nm0004067","character":"Brother Tenzin","urlCharacter":"http://www.imdb.com/character/ch0113365","main":true}],"seasons":[],"idIMDB":"tt0245803","urlIMDB":"http://www.imdb.com/title/tt0245803","business":{"budget":{"money":"$52,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$8,653,542","country":"USA","day":"20","month":"04","year":"2003","remarks":"2,955 Screens"},{"money":"£607,839","country":"UK","day":"20","month":"04","year":"2003","remarks":"322 Screens"},{"money":"ARS 100,544","country":"Argentina","day":"29","month":"07","year":"2003","remarks":"28 Screens"},{"money":"€660,337","country":"Spain","day":"15","month":"06","year":"2003","remarks":"274 Screens"}],"gross":[{"money":"$23,020,488","country":"USA","day":"26","month":"05","year":"2003","remarks":""},{"money":"$22,921,726","country":"USA","day":"18","month":"05","year":"2003","remarks":""},{"money":"$22,635,096","country":"USA","day":"11","month":"05","year":"2003","remarks":""},{"money":"$21,581,881","country":"USA","day":"04","month":"05","year":"2003","remarks":""},{"money":"$18,957,471","country":"USA","day":"27","month":"04","year":"2003","remarks":""},{"money":"$11,749,241","country":"USA","day":"20","month":"04","year":"2003","remarks":""},{"money":"£2,009,003","country":"UK","day":"11","month":"05","year":"2003","remarks":""},{"money":"£1,880,343","country":"UK","day":"04","month":"05","year":"2003","remarks":""},{"money":"£1,591,669","country":"UK","day":"27","month":"04","year":"2003","remarks":""},{"money":"£607,839","country":"UK","day":"20","month":"04","year":"2003","remarks":""},{"money":"$13,960,630","country":"Worldwide","day":"07","month":"11","year":"2003","remarks":"except USA"},{"money":"ARS 100,544","country":"Argentina","day":"29","month":"07","year":"2003","remarks":""},{"money":"€1,477,111","country":"Italy","day":"07","month":"09","year":"2003","remarks":""},{"money":"€670,108","country":"Italy","day":"21","month":"08","year":"2003","remarks":""},{"money":"$366,228","country":"Russia","day":"27","month":"07","year":"2003","remarks":""},{"money":"€2,097,613","country":"Spain","day":"13","month":"07","year":"2003","remarks":""},{"money":"€1,972,559","country":"Spain","day":"06","month":"07","year":"2003","remarks":""},{"money":"€1,728,787","country":"Spain","day":"29","month":"06","year":"2003","remarks":""},{"money":"€1,264,410","country":"Spain","day":"22","month":"06","year":"2003","remarks":""},{"money":"€660,337","country":"Spain","day":"15","month":"06","year":"2003","remarks":""}],"weekendGross":[{"money":"$60,268","country":"USA","day":"26","month":"05","year":"2003","remarks":"99 Screens"},{"money":"$90,636","country":"USA","day":"18","month":"05","year":"2003","remarks":"236 Screens"},{"money":"$605,502","country":"USA","day":"11","month":"05","year":"2003","remarks":"944 Screens"},{"money":"$1,474,624","country":"USA","day":"04","month":"05","year":"2003","remarks":"1,894 Screens"},{"money":"$4,402,635","country":"USA","day":"27","month":"04","year":"2003","remarks":"2,955 Screens"},{"money":"$8,653,542","country":"USA","day":"20","month":"04","year":"2003","remarks":"2,955 Screens"},{"money":"£40,010","country":"UK","day":"11","month":"05","year":"2003","remarks":"110 Screens"},{"money":"£124,874","country":"UK","day":"04","month":"05","year":"2003","remarks":"256 Screens"},{"money":"£437,928","country":"UK","day":"27","month":"04","year":"2003","remarks":"318 Screens"},{"money":"£607,839","country":"UK","day":"20","month":"04","year":"2003","remarks":"322 Screens"},{"money":"ARS 95,567","country":"Argentina","day":"29","month":"07","year":"2003","remarks":"28 Screens"},{"money":"€70,398","country":"Italy","day":"07","month":"09","year":"2003","remarks":"97 Screens"},{"money":"€289,844","country":"Italy","day":"17","month":"08","year":"2003","remarks":"124 Screens"},{"money":"€55,519","country":"Spain","day":"13","month":"07","year":"2003","remarks":"103 Screens"},{"money":"€136,473","country":"Spain","day":"06","month":"07","year":"2003","remarks":"204 Screens"},{"money":"€217,346","country":"Spain","day":"29","month":"06","year":"2003","remarks":"228 Screens"},{"money":"€351,783","country":"Spain","day":"22","month":"06","year":"2003","remarks":"263 Screens"},{"money":"€660,337","country":"Spain","day":"15","month":"06","year":"2003","remarks":"274 Screens"}],"admissions":[{"money":"23,972","country":"Argentina","day":"29","month":"07","year":"2003","remarks":""},{"money":"92,747","country":"Germany","day":"29","month":"06","year":"2003","remarks":""},{"money":"168,819 (Germany)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"20,660","country":"Netherlands","day":"31","month":"12","year":"2003","remarks":""},{"money":"448,328","country":"Spain","day":"13","month":"07","year":"2003","remarks":""},{"money":"420,229","country":"Spain","day":"06","month":"07","year":"2003","remarks":""},{"money":"366,993","country":"Spain","day":"29","month":"06","year":"2003","remarks":""},{"money":"268,004","country":"Spain","day":"22","month":"06","year":"2003","remarks":""},{"money":"135,704","country":"Spain","day":"15","month":"06","year":"2003","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"09","month":"03","year":"2002","remarks":null},null],"copyrightHolder":"© 2003 Metro-Goldwyn-Mayer Pictures Inc. in the United States, Canada, France and their territories, possessions and protectorates; Lakeshore Entertainment Group LLC throughout the world other than in the United States, Canada, France and their territories, possessions and protectorates"},"technical":{"runtime":["1 hr 44 min (104 min)"],"soundMix":["DTS","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Clairmont Camera"],"laboratory":["DeLuxe, USA (color)"],"filmLength":["2,842 m (Sweden)"],"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"5.5","metascore":"40","filmingLocations":[{"location":"Loblaws Warehouse, Toronto, Ontario, Canada"}],"rated":"PG-13","awards":[{"award":"Teen Choice Awards 2003","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie - Drama/Action Adventure","names":[]}]}]}],"votes":"43,233","type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"},{"idCompany":"co0005323","name":"Lakeshore Entertainment"},{"idCompany":"co0037759","name":"Mosaic Media Group"}],"keywords":{"keywords":["scroll","monk","tibetan","monastery","tibetan monk","nazi","time","fight","chase","martial arts","siren the alarm","nazi occultism","kiss","magical potion","violence","woman strangles man","woman breaks woman's neck","neck breaking","woman's neck broken","woman kills woman","villainess","woman kills man","tattoo","corpse","marquee","prophecy","supernatural power","punjabi","mercenary","exhibit","wheelchair","explosive","held at gunpoint","film projector","neon light","watching a movie","grandfather granddaughter relationship","police car","movie screen","theatre audience","police officer","newsstand","foot chase","newspaper headline","fall from height","shot to death","rite","teacher student relationship","fireplace","dancing","ritual","subtitles","german army","custom","massacre","soldier","mysticism","tradition","shrine","little boy","temple","butterfly","year 1943","chinese","training","gang","chrysalis","handcuffed","flying kick","blood splatter","blood","film within a film","fighting","two word title","tai chi","beretta","showdown","machine gun","mp 40 machine gun","knife fight","knife throwing","combat","catfight","the force","super powers","stick fight","bo staff","hand to hand combat","opening action scene","rooftop fight","mentor protege relationship","disarming someone","sai","punk","two man army","suspense","dodging bullets","slow motion scene","dual wield","stylized violence","sword cane","semiautomatic pistol","gun fu","gunfight","shootout","martial artist","martial arts master","mixed martial arts","brawl","tough girl","tough guy","action hero","hero","syringe","injection","bare chested male","fistfight","explosion","fall","man with no name","mountain","mountaintop monastery","abbey","exploding car","english subtitles in original","immortality","asia","buddy","desert eagle","based on comic book","subway station","secret scroll","russian mafia","execution","enlightenment","wire fu","tibet","street gang","redemption","pickpocket","movie theater","buddhist monk","buddhist monastery","buddhism","betrayal","torture","subway","projectionist","movie theatre","monkey","mansion","electrocution","chosen one","bullet time","helicopter","based on comic"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:39:19"}}