{"data":{"movies":[{"title":"Picture Claire","originalTitle":"","year":"2001","releaseDate":"20030814","directors":[{"name":"Bruce McDonald","id":"nm0567680"}],"writers":[{"name":"Semi Chellas","id":"nm0155069"}],"runtime":"91 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMjEyMzYyMF5BMl5BanBnXkFtZTcwNjcyOTQ1MQ@@._V1.jpg","countries":["Canada"],"languages":["English","French"],"genres":["Thriller"],"plot":"In Montreal, Claire Beaucage loses her belongings when her apartment burns on fire. She decides to travel to Toronto to move to her boyfriend's place, the photographer Billy Stuart. Speaking only French, she is mistakenly taken as Lily Warden, a woman that killed a smuggler in a coffee shop. The police chase Claire, who does not understand what is happening, while two sadistic criminals chases Lily, who is the second floor neighbor of Billy.","simplePlot":"A woman gets in way over her head when she's in the wrong place at the wrong time.","actors":[{"actorName":"Juliette Lewis","urlProfile":"http://www.imdb.com/name/nm0000496","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4Nzk1MDgyNV5BMl5BanBnXkFtZTYwNzQ3MDgy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 June 1973","placeOfBirth":" Los Angeles, California, USA","height":"5' 6\" (1.68 m)","bio":"Juliette Lewis has been recognized as one of Hollywood's most talented and versatile actors of her generation since she first stunned audiences and critics alike with her Oscar-nominated performance as \"Danielle Bowden\" in Cape Fear (1991). To date, she has worked with some of the most revered directors in the industry, including Martin Scorsese, Woody Allen, Lasse Hallström, Oliver Stone and Garry Marshall. Whether lending dramatic authenticity or a natural comedic flair to her roles, Lewis graces the screen with remarkable range and an original and captivating style. Lewis was born in Los Angeles, Californa, to Glenis (Duggan) Batley, a graphic designer, and Geoffrey Lewis, an actor. By the age of six, she knew she wanted to be a performer. At twelve, Lewis landed her first leading role in the Showtime miniseries Home Fires (1987). After appearing in several TV sitcoms including The Wonder Years (1988), she made her move to film, starring with Chevy Chase in National Lampoon's National Lampoon's Christmas Vacation (1989) and with Jennifer Jason Leigh in the drama Crooked Hearts (1991). At 16, Lewis starred opposite Brad Pitt in the critically acclaimed television movie Too Young to Die? (1990), catching the attention of Martin Scorsese, who cast her in his thriller Cape Fear (1991). Her powerful scenes with Robert De Niro captured the quiet complexities of adolescence and earned her an Oscar nomination and Golden Globe nomination for \"Best Supporting Actress\". Her auditorium scene with De Niro went down in movie history as one of cinema's classic scenes. Lewis next worked with Woody Allen in Husbands and Wives (1992), playing a self-assured college coed with a penchant for older men and, particularly, her married professor. She quickly followed suit with a succession of starring roles in a variety of blockbusters and critically acclaimed projects including Kalifornia (1993), Romeo Is Bleeding (1993), What's Eating Gilbert Grape (1993) and Natural Born Killers (1994), Oliver Stone's controversial media satire about two mass murderers who become legendary folk heroes. Lewis's other credits include the Nora Ephron comedy Mixed Nuts (1994), with Steve Martin and Adam Sandler; the sci-fi action film Strange Days (1995) with Ralph Fiennes and Angela Bassett; Quentin Tarantino's vampire tale From Dusk Till Dawn (1996) with George Clooney; The Evening Star (1996) with Shirley MacLaine; the Garry Marshall-directed The Other Sister (1999), and Todd Phillips' Old School (2003), co-starring opposite Luke Wilson, Vince Vaughn, and Will Ferrell as well as Starsky & Hutch (2004). In addition to her film career, Lewis has continued to add roles to her growing list of television credits with a performance in Showtime's My Louisiana Sky (2001), for which she secured an EMMY nomination, and a starring role in the Mira Nair-directed HBO's film Hysterical Blindness (2002), alongside Uma Thurman and Gena Rowlands. After a six-year hiatus from film to pursue her burgeoning music career exclusively, Lewis announced her return to acting with a handful of upcoming movies. Juliette starred alongside Ellen Page, Marcia Gay Harden, Kristen Wiig and Jimmy Fallon in the comedy Whip It (2009). The film was released by Fox Searchlight on October 2nd, 2009. Directed by Drew Barrymore, the film tells the story of an ex-beauty pageant contestant that leaves her crowns behind after joining a roller derby team. Lewis plays \"Iron Maven\", the star of a top derby team. Next, she joined the cast of the acclaimed European animated thriller Metropia (2009), as the voice of \"Nina\". She also appeared in the romantic comedy The Switch (2010), opposite Jennifer Aniston, Jason Bateman and Patrick Wilson. The film tells the story of a single mother (Aniston) who decides to have a child using a sperm donor. Juliette plays \"Debbie Epstein\", the best friend of Aniston's character. Lewis also appears in Sympathy for Delicious (2010), Mark Ruffalo's directorial debut. The film follows a paralyzed DJ, struggling to survive on the streets of LA who turns to faith healing and mysteriously develops the ability to cure the sick. Juliette plays \"Ariel\", costarring alongside Orlando Bloom, Mark Ruffalo and Laura Linney. The film took home the US Dramatic Special Jury Prize at the 2010 Sundance Film Festival. Most recently, Juliette Lewis appears in the indie-drama Conviction (2010), which stars Hilary Swank, Melissa Leo, Minnie Driver and Sam Rockwell. She plays \"Roseanna Perry\" in the true story of an unemployed single mother (Swank) who saw her brother begin serving a life sentence in 1983 for murder and robbery. The role has won Lewis praise from audiences and critics, alike, for her performance, with USA Today saying, \"Juliette Lewis has an indelible role\" and the San Francisco Chronicle saying \"Her character work should be studied in schools. Just remarkable\". In addition to Conviction (2010), Lewis also makes a cameo in Todd Phillips' comedy, Due Date (2010), starring Robert Downey Jr., Michelle Monaghan and Zach Galifianakis. Beginning in 2004, Juliette took a hiatus from acting to embark on a musical journey. After six years, two full length albums and countless high profile tours and festival gigs with her band, 'Juliette & the Licks', Juliette set out on a solo career. Releasing \"Terra Incognita\" last fall, the album has taken her all across the world from Europe to Japan to Turkey, Australia, North America and Canada. For more information on Juliette Lewis' music, please visit her MySpace page. Juliette Lewis resides in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4Nzk1MDgyNV5BMl5BanBnXkFtZTYwNzQ3MDgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000496","name":"Juliette Lewis","idIMDB":"nm0000496"},"actorId":"nm0000496","character":"Claire Beaucage","urlCharacter":"http://www.imdb.com/character/ch0114439","main":true},{"actorName":"Gina Gershon","urlProfile":"http://www.imdb.com/name/nm0000153","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNDA0MjQ2N15BMl5BanBnXkFtZTcwNDA3ODMwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1962","placeOfBirth":" Los Angeles, California, USA","birthName":"Gina L. Gershon","height":"5' 6¼\" (1.68 m)","bio":"Since making her uncredited debut as a dancer in Beatlemania (1981), Gina Gershon has established herself as a character actress and one of the leading icons of American camp. For it was fourteen years after her movie debut that Gina made movie history as the predatory bisexual who was the leading light of a Las Vegas leg-line in director Paul Verhoeven's kitsch classic Showgirls (1995). Exploding out of a plaster-of-Paris volcano clad in nothing but body makeup and a G-string, Gina Gershon obtained cinema immortality. After Showgirls (1995), she solidified her reputation, playing a lesbian sexpot in the Wachovski Bros' neo-noir Bound (1996). Gina Gershon was born in the Los Angeles suburb of Woodland Hills, the last in a brood of three kids. Her mother, Mickey (Koppel), worked as an interior decorator, and her father, Stanley Gershon, was a salesman and worked in the import/export business. Her paternal grandparents were from Russian Jewish families, and her maternal grandparents were born in Holland and Belgium, both of them to Jewish families from Poland. Gina was raised in the San Fernando Valley, and got the acting bug early, appearing at the age of seven in a school production of Bye Bye Birdie (1963). Because of her acting ambitions, her parents moved to Beverly Hills so Gina could attend Beverly Hills High, where she indulged her acting jones by appearing in a student production of The Music Man (1962). Her first love, she says, is singing. After graduating from high school in 1980, she attended Emerson College in Boston, but took a part in the musical \"Runaways\". She transferred to New York University, where her official biography says she studied philosophy and psychology, but she graduated from the Tisch School of the Arts, taking a bachelor of fine arts degree in drama in 1983. In New York City, while perfecting her craft, she co-founded the theater company Naked Angels with Helen Slater. Her big-screen breakthrough came with a part in the 1986 \"Brat Pack\" teenage hit Pretty in Pink (1986). She also had parts in the Tom Cruise vehicle Cocktail (1988) and Arnold Schwarzenegger's Red Heat (1988). Of this period, she says, \"One of my first gigs, a movie called Cocktail (1988), I found myself at 8 in the morning, in bed, practically naked, having to make out with Tom Cruise; hmmmm... movie business - so far, so good\". Citing Frank Sinatra's song \"My Way\" as an inspiration, she says that following Cocktail (1988), \"I was fortunate enough to play many diversified roles in film, television and stage. Not always to the liking of my managers and agents, but I always did what I wanted....\" She played Nancy Sinatra, Frank's first wife, in the TV miniseries Sinatra (1992). Gina Gershon became a celebrity in Showgirls (1995). The following year, Gershon solidified her claim on second-tier stardom playing the calculating lesbian \"Corky\" in the crime movie Bound (1995). She never did capitalize on her mid-1990s breakthrough, but Gershon is established as a character actress and is never out of work, unlike most of her female peers who started out in the industry at the same time. Though no classic beauty, the talented thespian remains gainfully employed while many actresses of her vintage are out of work as she is possessed of a unique look and smoldering sex appeal that comes across on camera. Gershon is versatile, too, as at home on stage as she is in front of the camera. After appearing in off-Broadway and regional theater productions, she made her Broadway debut as a replacement in Sam Mendes' revival of Cabaret (1972) in January 2001. For six months, she played the key role of \"Sally Bowles\", returning that October to reprise the role for another month. In 2008, she once again appeared on Broadway in the revival of the farce \"Boeing Boeing\" on Broadway, which won the Tony award for Best Revival. Gina Gershon also is a children's book writer. In 2008, Putmam Juvenile published her \"Camp Creepy Time\", a tale of a boy who discovers aliens at his summer camp, which she co-wrote with her brother, Dann Gershon. \"Camp Creepy Time\" recently was optioned by DreamWorks, which plans to turn it into a movie. In 2008, she also released \"In Search Of Cleo\", a CD featuring nine songs which she wrote or co-wrote.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNDA0MjQ2N15BMl5BanBnXkFtZTcwNDA3ODMwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000153","name":"Gina Gershon","idIMDB":"nm0000153"},"actorId":"nm0000153","character":"Lily Warden","urlCharacter":"http://www.imdb.com/character/ch0114440","main":true},{"actorName":"Mickey Rourke","urlProfile":"http://www.imdb.com/name/nm0000620","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MzYwNDA2MF5BMl5BanBnXkFtZTcwNDYzMjg4Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1952","placeOfBirth":" Schenectady, New York, USA","birthName":"Philip Andre Rourke Jr.","height":"5' 11\" (1.8 m)","bio":"Mickey Rourke was born Phillip Andre Rourke, Jr. on September 16, 1952, in Schenectady, New York, the son of Annette (Cameron) and Phillip Andre Rourke. His father was of Irish and German descent, and his mother was of French-Canadian, English, and German ancestry. When he was six years old, his parents divorced. A year later, his mother married Eugene Addis, a Miami Beach police officer, and moved to Miami Shores, Florida. After graduating from Horace Mann Junior High School, Rourke's family moved to a house located on 47th Street and Prairie Avenue in Miami Beach. In 1969 Rourke attended Miami Beach Senior High School, where he played second-string first baseman under coach Skip Berkman. He also acted in a school play, \"The Serpent,\" directed by legendary \"Teacher To The Stars\" Jay W. Jensen. In 1971 he graduated from Miami Beach Senior High School, and after working for a short time as a bus boy at the famed Forge Restaurant on Miami Beach, Rourke moved back to New York to seek out a career in acting. Rourke's teenage years were more aimed toward sports more than acting. He took up self-defense training at the Boys Club of Miami. It was there he learned boxing skills and decided on an amateur career. At the age of 12, Rourke won his first boxing match as an 118-pound bantamweight, defeating Javier Villanueva. Some of his early matches were fought as Andre Rourke. He continued his boxing training at the famed 5th Street Gym in Miami Beach,soon joining the Police Athletic League boxing program. In 1969 Rourke, now weighing 140 pounds, sparred with former World Welterweight champion Luis Rodriguez. Rodriguez was the number one-rated middleweight boxer in the world and was training for his match with world champion Nino Benvenuti. Rourke claims to have received a concussion in this sparring match. In 1971, at the Florida Golden Gloves, Rourke received another concussion from a boxing match. Doctors told him to take a year off and rest. In 1972 Rourke knocked out Ron Robinson in 18 seconds and John Carver in 39 seconds. On Aug. 20, 1973, Rourke knocked out 'Sherman \"Big Train\"' Bergman' in 31 seconds. Shortly after, Rourke decided to retire from amateur boxing. From 1964 to 1973, Rourke compiled an amateur boxing record of 27 wins (17 by knockout) and 3 defeats. At one point, he reportedly scored 12 consecutive first-round knockouts. As an amateur, Rourke had been friendly with pro-boxer Tommy Torino. When Rourke decided to return to boxing as a professional in 1991, Torino promoted some of Rourke's fights. Rourke was trained by former pro-boxer Freddie Roach at Miami Beach's 5th Street Gym and the Outlaw Boxing Club Gym in Los Angeles. He made $250 for his pro debut, but by the end of his second year of boxing, he had earned a million dollars. In June 1994, Rourke appeared on the cover of World Boxing Magazine. He sparred with world champions James Toney, John David Jackson, and Tommy Morrison. Rourke wished to have 16 professional fights and then fight for a world title. However, he retired in 1994 after eight bouts and never got his desired title fight. His boxing career resulted in severe facial injuries that required a number of operations to repair his damaged face. Rourke went back to acting but worked in relative obscurity until he won a Golden Globe Award for his role as Randy \"The Ram\" Robinson in The Wrestler (2008). He was nominated for Best Actor, as well, but lost.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MzYwNDA2MF5BMl5BanBnXkFtZTcwNDYzMjg4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000620","name":"Mickey Rourke","idIMDB":"nm0000620"},"actorId":"nm0000620","character":"Eddie","urlCharacter":"http://www.imdb.com/character/ch0076104","main":true},{"actorName":"Callum Keith Rennie","urlProfile":"http://www.imdb.com/name/nm0719678","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3MTUyMDczMl5BMl5BanBnXkFtZTgwOTk4MzI0OTE@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1960","placeOfBirth":" Sunderland, Tyne-and-Wear, England, UK","height":"5' 11\" (1.8 m)","bio":"Callum Keith Rennie was born in England, raised in Alberta, Canada and came late to acting - he discovered theatre in Edmonton at the age of 25. Starting out in university radio and working his way to the renowned Shaw Festival, Callum moved to Vancouver and quickly caught the eye of producers and directors. Currently he lives in Vancouver.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3MTUyMDczMl5BMl5BanBnXkFtZTgwOTk4MzI0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0719678","name":"Callum Keith Rennie","idIMDB":"nm0719678"},"actorId":"nm0719678","character":"Laramie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kelly Harms","urlProfile":"http://www.imdb.com/name/nm0363596","urlPhoto":"","biography":{"dateOfBirth":"27 April 1974","placeOfBirth":" Barrhead, Alberta, Canada","height":"6' 0½\" (1.84 m)","bio":"Born and raised in Alberta, Kelly's family are originally from Bellevue, Iowa. A self confessed Civil War buff, Kelly makes frequent trips to battle sites across the States.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0363596","name":"Kelly Harms","idIMDB":"nm0363596"},"actorId":"nm0363596","character":"Billy Stuart","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Camilla Rutherford","urlProfile":"http://www.imdb.com/name/nm0751950","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQwNDIzMDA2MF5BMl5BanBnXkFtZTcwOTQ3NjA4OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 September 1976","placeOfBirth":" Camden, London, England, UK","birthName":"Camilla Claude Rutherford","height":"5' 6\" (1.68 m)","bio":"Camilla grew up with her sisters in Holland Park. Her father was a writer for The Financial Times and her mother was a magistrate. She studied Maths at Newcastle University, and met her husband, Rufus Abbott, at a party in London. They had a traditional Roman Catholic wedding at St. George's Church in Campden Hill, and held the reception in the Orangerie. They have a son named Hector and a daughter named Maud.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQwNDIzMDA2MF5BMl5BanBnXkFtZTcwOTQ3NjA4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0751950","name":"Camilla Rutherford","idIMDB":"nm0751950"},"actorId":"nm0751950","character":"Cynthia Lacey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Stebbings","urlProfile":"http://www.imdb.com/name/nm0824220","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2OTkwMzc4MF5BMl5BanBnXkFtZTcwNjAzMDkyMQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 February 1971","placeOfBirth":" Vancouver, British Columbia, Canada","height":"6' (1.83 m)","bio":"Peter Stebbings holds an extensive acting career spanning over 20 years. A native of Vancouver, British Columbia, Canada, born on February 28, 1971, Peter's screen career began in 1989 after spending time cultivating his craft in theatre at age 12. He is perhaps best known to local audiences of his home country for his role in the television series Madison (1993), aired originally in the 1990s. Other notable Canadian productions include Haute finance (1996) and the post-apocalyptic Sci-Fi drama Jeremiah (2002). He played a sinister yet appealing werewolf neighbor in the horror feature Never Cry Werewolf (2008) starring opposite Nina Dobrev and Kevin Sorbo. He has made a substantial showing across numerous television series produced by Canada, including the crime/mystery drama Rabbit Fall (2007), Cra$h & Burn (2009), Les enquêtes de Murdoch (2008) and the fantasy crime-drama The Listener (2009). Peter has also appeared in the Harrison Ford, Liam Neeson historical film drama-thriller K-19: The Widowmaker (2002) and in the mythological epic Immortals (2011) starring Henry Cavill. Peter has also endeavored in writing, contributing a screenplay for the film Defendor: héros ou zéro (2009) in which he also directed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2OTkwMzc4MF5BMl5BanBnXkFtZTcwNjAzMDkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0824220","name":"Peter Stebbings","idIMDB":"nm0824220"},"actorId":"nm0824220","character":"Culver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tracy Wright","urlProfile":"http://www.imdb.com/name/nm0942897","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MTkwNDIwN15BMl5BanBnXkFtZTcwMTM5NjIyNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 December 1959","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Tracy Lauren Wright","height":"5' 5\" (1.65 m)","bio":"Tracy Wright was born on December 7, 1959 in Toronto, Ontario, Canada as Tracy Lauren Wright. She was an actress, known for Me and You and Everyone We Know (2005), Blindness (2008) and Trigger (2010). She was married to Don McKellar. She died on June 22, 2010 in Toronto.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MTkwNDIwN15BMl5BanBnXkFtZTcwMTM5NjIyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0942897","name":"Tracy Wright","idIMDB":"nm0942897"},"actorId":"nm0942897","character":"Detective Sweeney","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Raoul Bhaneja","urlProfile":"http://www.imdb.com/name/nm0080212","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzOTEyNjIyNl5BMl5BanBnXkFtZTgwMjc2ODE1MDI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 June 1974","placeOfBirth":" Manchester, England, UK","bio":"A British born Indo/Irish Canadian, Raoul has worked extensively on screen and on stage since his graduation from the prestigious National Theatre School of Canada in 1996. A classically trained actor his first feature film was Extraordinary Visitor (Toronto International Film Festival 1998) in the role of John The Baptist opposite Mary Walsh and Andy Jones. He has performed in features ranging from art house dramas such as Ararat (Atom Egoyan) to Hollywood thrillers like The Sentinel (Clark Johnson) to indie darlings such as Touch of Pink (Ian Rashid) and the recent romantic comedy The Right Kind of Wrong (Jeremiah Chechik). Upcoming features include the John Madden directed Miss Sloane opposite Jessica Chastain. On television he has had series leads and major recurring roles on both American and Canadian projects ranging from the cult hit Train 48 (Global TV) to The Dresden Files (Syfy) and Runaway (CW) and guest stars on Suits (USA), Beauty and The Beast (CBS), Rookie Blues (ABC) and 10 different projects with the Canadian Broadcasting Corporation. On stage he has extensively toured his one man show Hamlet (solo) and his Dora award nominated musical Life, Death and The Blues. In Toronto he has premiered a number of seminal new works and most recently produced and starred in the Toronto premiere of Pulitzer Prize winner Disgraced by Ayad Akhtar which broke box office records at The Panasonic Theatre. An accomplished musician he has lead his award winning blues band Raoul and The Big Time since 1998 and they continue to be active on tour and in the studio.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzOTEyNjIyNl5BMl5BanBnXkFtZTgwMjc2ODE1MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0080212","name":"Raoul Bhaneja","idIMDB":"nm0080212"},"actorId":"nm0080212","character":"Detective Lee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Reineke","urlProfile":"http://www.imdb.com/name/nm0717980","urlPhoto":"","biography":{"bio":"Gary Reineke is an actor, known for Spider (2002), Dieppe (1993) and The Grey Fox (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0717980","name":"Gary Reineke","idIMDB":"nm0717980"},"actorId":"nm0717980","character":"Pawnbroker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barbara Eve Harris","urlProfile":"http://www.imdb.com/name/nm0364458","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMzg3OTE3NV5BMl5BanBnXkFtZTcwMTUwMzQ0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 March 1959","placeOfBirth":" Tobago","birthName":"Barbara Evadney Reid-Hibbert","height":"5' 7\" (1.7 m)","bio":"Barbara Eve Harris was born in Trinidad and Tobago of Jamaican parents, and moved to Canada at the age of 6 with her family. Raised and educated in Ottawa, the national capital, she graduated from the University of Ottawa with a B.A. (concentration in Theatre and Philosophy). The initial plan was for Law School, but despite offers of admission, including scholarships, she followed her heart to be a performer instead. Though trained mainly as an actor, Barbara's professional career began with a dance role in New York City in \"Follies de Paris\", a Vegas style review. It was dancing that led to her film debut in \"Night Magic\", a fantasy musical shot in Montreal, Quebec. This first movie role also meant a return to acting, and led to a thriving film and television career of 25 years (to date). A recipient of several regional Canadian awards for acting, and a Gemini nomination for Best Actress In A Continuing Leading Dramatic Role (as Wanda Gibbs in \"Side Effects\"), she chose to expand her horizons and relocated to Los Angeles in 1998. Barbara's many starring roles span the range from tough U.S. Army Ranger Drill Instructor, Sgt. Rhodes (\"Dead Men Can't Dance\"), to grief stricken widow and mother, Janice Crosby, opposite Louis Gossett Jr. (\"In His Father's Shoes\"). The list of her credits now comprises 9 theatrical features; 20 television features; and over 100 episodic T.V. appearances including the role of FBI Agent Felicia Lang in the final 3 seasons of the hit series, \"Prison Break.\" One of Barbara's favorite perquisites of being an actor is the opportunity to travel. Aside from numerous locations within North America, she has enjoyed filming in the Philippines (\"Dead Men Can't Dance\"), New Zealand (\"The Nightmare Man\"), Hawaii (\"E.R.\"), and Bogota, Colombia, (\"Mental\"). Her fantasy gig? A dance/action/drama shot on location throughout Europe.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMzg3OTE3NV5BMl5BanBnXkFtZTcwMTUwMzQ0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0364458","name":"Barbara Eve Harris","idIMDB":"nm0364458"},"actorId":"nm0364458","character":"Patricia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elena Kudaba","urlProfile":"http://www.imdb.com/name/nm0473740","urlPhoto":"","biography":{"bio":"Elena Kudaba is an actress, known for Death Wish V: The Face of Death (1994), Picture Claire (2001) and Babycakes (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0473740","name":"Elena Kudaba","idIMDB":"nm0473740"},"actorId":"nm0473740","character":"Donut Lady","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Officer","urlProfile":"http://www.imdb.com/name/nm1031732","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMDgwOTg2OF5BMl5BanBnXkFtZTYwMjY3MjI0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Charles Officer is a director and actor, known for Nurse.Fighter.Boy (2008), Mighty Jerome (2010) and Urda/Bone (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMDgwOTg2OF5BMl5BanBnXkFtZTYwMjY3MjI0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1031732","name":"Charles Officer","idIMDB":"nm1031732"},"actorId":"nm1031732","character":"Cab Driver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dean McDermott","urlProfile":"http://www.imdb.com/name/nm0567506","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1OTU1MDk0NV5BMl5BanBnXkFtZTgwMTE2Njk2OTE@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 November 1966","placeOfBirth":" Toronto, Ontario, Canada","height":"6' 3\" (1.91 m)","bio":"Dean McDermott was born on November 16, 1966 in Toronto, Ontario, Canada. He is an actor and producer, known for Chopped Canada (2014), Open Range (2003) and Tori & Dean: Inn Love (2007). He has been married to Tori Spelling since May 7, 2006. They have five children. He was previously married to Mary Jo Eustace.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1OTU1MDk0NV5BMl5BanBnXkFtZTgwMTE2Njk2OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0567506","name":"Dean McDermott","idIMDB":"nm0567506"},"actorId":"nm0567506","character":"Attendant at the Station","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sonja Mills","urlProfile":"http://www.imdb.com/name/nm1312471","urlPhoto":"","biography":{"bio":"Sonja Mills is an actress, known for Entretiens avec ma future petite amie (2002), Picture Claire (2001) and My Summer Vacation (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1312471","name":"Sonja Mills","idIMDB":"nm1312471"},"actorId":"nm1312471","character":"Chalk Artist","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0263215","urlIMDB":"http://www.imdb.com/title/tt0263215","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"16","month":"10","year":"2000","remarks":null},{"money":null,"country":null,"day":"04","month":"12","year":"2000","remarks":null}],"copyrightHolder":"copyright 2001 Picture Claire Productions Inc., A Serendipity Point Films Company"},"technical":{"runtime":["1 hr 31 min (91 min)"],"soundMix":["Dolby Digital"],"color":["Black and White","Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe, Toronto, Canada"],"filmLength":null,"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.7","filmingLocations":[{"location":"Lower Bay Station, Toronto, Ontario, Canada"}],"rated":"R","awards":[{"award":"Cinéfest Sudbury 2001","titlesAwards":[{"titleAwardOutcome":"Won Best Ontario Feature","categories":[{"category":"","names":[{"name":"Bruce McDonald","id":"nm0567680","role":null}]}]}]}],"votes":"909","type":"Movie","companyCreditsSimple":[{"idCompany":"co0149544","name":"Alliance Atlantis Motion Picture Production"},{"idCompany":"co0016814","name":"Serendipity Point Films"}],"keywords":{"keywords":["chase","photographer","police","fire","watching television","montreal quebec","dead woman with eyes open","dead woman on floor","woman shot","garrote","woman strangles man","woman kills man","dragon puppet","chinese street celebration","billboard","poster","hanging from a balcony","undressing","pawnshop","union station","shoeless","shoes","women's bathroom","money","party","garbage bin","garbage collector","garbage truck","diamonds","bahamas","swimming","border crossing","passport","fantasy sequence","mirror","visa","broken glass","suitcase","cell phone","red shoes","informer","airline ticket","travel agent","running","train station","train","taxi driver","taxi","photo exhibit","darkroom","camera","art gallery","drug deal","policeman","suspect","strangulation","pursuit","witness","dog","fake passport","hiding","sunglasses","double cross","death","murder","corpse","dead body","playing pool","breaking and entering","oral sex","sex","topless female nudity","bare breasts","female frontal nudity","cigarette smoking","investigation","stakeout","shooting","blood","boyfriend girlfriend relationship","flashback","theft","thief","sidewalk art","street life","split screen","french canadian","kiss","subtitled scene","nudity","voice over narration","burning house","house on fire","prologue","postcard","photograph","fireman","arson","gun","mistaken identity","secret","drug dealer","toronto ontario canada","female nudity","neo noir","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:08:07"}}