{"data":{"movies":[{"title":"Une double vie","originalTitle":"The Pilot's Wife","year":"2002","releaseDate":"20020414","directors":[{"name":"Robert Markowitz","id":"nm0548740"}],"writers":[{"name":"Anita Shreve","id":"nm0795370"},{"name":"Anita Shreve","id":"nm0795370"}],"runtime":"89 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5ODcxOTY1MV5BMl5BanBnXkFtZTcwNTc2MjIyMQ@@._V1.jpg","countries":["Canada","USA"],"languages":["English"],"genres":["Drama"],"plot":"Kathryn is distraught at the news of her husband's death delivered by a stranger from the airline for whom he was a pilot. She starts however to uncover information which leads to her arrival in London for further investigation...and further devastation.","simplePlot":"Kathryn is distraught at the news of her husband's death delivered by a stranger from the airline for whom he was a pilot. She starts however to uncover information which leads to her ... ","actors":[{"actorName":"Christine Lahti","urlProfile":"http://www.imdb.com/name/nm0001441","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM0NTUyNTk1NV5BMl5BanBnXkFtZTcwODkyMDUzOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1950","placeOfBirth":" Birmingham, Michigan, USA","birthName":"Christine Ann Lahti","height":"5' 10\" (1.78 m)","bio":"Christine Lahti was born April 4, 1950 in Birmingham, Michigan, to Elizabeth Margaret (Tabar), a painter and nurse, and Paul Theodore Lahti, a surgeon. She is of half Finnish and half Austro-Hungarian descent. She studied fine arts at Florida State University and received a bachelors degree in drama from the University of Michigan. In New York, Christine worked as a waitress and did commercials before she found her breakthrough role in ...and justice for all. (1979) with Al Pacino. She received an Academy Award nomination for Best Supporting Actress for her performance in Swing Shift (1984) and won an Academy Award for Best Short Film, Live Action for Lieberman in Love (1995) in which she starred and directed. Throughout her acting career, Christine primarily focused on television, with performances in Chicago Hope (1994), and Law & Order: Special Victims Unit (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM0NTUyNTk1NV5BMl5BanBnXkFtZTcwODkyMDUzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001441","name":"Christine Lahti","idIMDB":"nm0001441"},"actorId":"nm0001441","character":"Kathryn Lyons","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Campbell Scott","urlProfile":"http://www.imdb.com/name/nm0001714","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MjgxNzM1MV5BMl5BanBnXkFtZTcwMzU2ODQ1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 July 1961","placeOfBirth":" New York City, New York, USA","birthName":"Campbell Whalen Scott","height":"5' 11\" (1.8 m)","bio":"Campbell Scott was born on July 19, 1961 in New York City, New York, USA as Campbell Whalen Scott. He is an actor and producer, known for The Amazing Spider-Man (2012), The Exorcism of Emily Rose (2005) and The Amazing Spider-Man 2 (2014). He has been married to Kathleen McElfresh since May 30, 2009. He was previously married to Anne Scott.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MjgxNzM1MV5BMl5BanBnXkFtZTcwMzU2ODQ1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001714","name":"Campbell Scott","idIMDB":"nm0001714"},"actorId":"nm0001714","character":"Robert Hart","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alison Pill","urlProfile":"http://www.imdb.com/name/nm0683467","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDMyMDkzMl5BMl5BanBnXkFtZTcwNjQ4ODgwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 November 1985","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Alison Courtney Pill","height":"5' 6½\" (1.69 m)","bio":"Alison is a Canadian born TV, film and theater actress. She was born in Toronto, Ontario. Her father, who is Estonian, is a financier. She attended Vaughan Road Academy, and decided she wanted to be an actor when she was age 10. She was a member of the Toronto Children's Chorus and was chosen to narrate one of their performances. From there, she gained a job narrating children's audio books. She achieved her first on-screen role as a background performer on Kung Fu: The Legend Continues (1993), after which, she got herself an agent. She was booking roles successfully from the age of 11. She later moved to New York to pursue roles in theater, where has enjoyed much success. She earned a Tony nomination for her performance in The Lieutenant of Inishmore. She is also very much enjoying life as a TV and film actress. Her breakthrough film role came with Scott Pilgrim vs. the World (2010). In 2012, she is playing Maggie Jordan in Aaron Sorkin's TV show The Newsroom (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDMyMDkzMl5BMl5BanBnXkFtZTcwNjQ4ODgwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0683467","name":"Alison Pill","nicknames":["Ali","Al"],"idIMDB":"nm0683467"},"actorId":"nm0683467","character":"Mattie Lyons","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kirsty Mitchell","urlProfile":"http://www.imdb.com/name/nm0593511","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MDQ1MDA4OF5BMl5BanBnXkFtZTgwMDc3MTA0OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1974","placeOfBirth":" Glasgow, Scotland, UK","birthName":"Kirsty Loretta Mitchell","height":"5' 8\" (1.73 m)","bio":"Kirsty Mitchell was born in Glasgow, Scotland. Along with her modeling career, Kirsty Mitchell trained at the prestigious Central School of Ballet in London and at the age of seventeen was crowned the coveted title of \"Miss Scotland\" before turning her focus on acting. Kirsty Mitchell was nominated for the 2011 Johnnie Walker® Blue Label Great Scot Award for her \"Outstanding Contribution to Entertainment\". Kirsty Mitchell's initial break-through performance came as Robert Duvall's daughter in the film A Shot at Glory (2000). Kirsty Mitchell starred in the very first IMAX produced drama The Legend of Loch Lomond (2001), and also recording lead vocals for the film's soundtrack. Kirsty Mitchell has made numerous appearances on both British and American television. Memorable roles include, the American mini-series Attila (2001) as the seductive \"Princess Honoria\" opposite fellow Scot Gerard Butler, as IRA courier \"Muire Boland\" starring alongside Campbell Scott and Christine Lahti in the CBS TV movie Une double vie (2002), and as therapist \"Dr Anita Forbes\" in the popular BBC series Holby City (1999). Kirsty Mitchell has also had starring performances on The Royal Today (2008), Monarch of the Glen (2000), Hollyoaks (1995), and Casualty (1986). Kirsty Mitchell's first motion capture performance came as Bond Girl, \"Natalya Simonova\" in the popular GoldenEye 007 (2010) video game. She also provided the voice of \"Gabriel\" for El Shaddai: Ascension of the Metatron (2011) video game, which was named one of \"2011 Best\". Kirsty Mitchell starred opposite Jason Isaacs in the critically acclaimed PBS Masterpiece Theatre mini-series Case Histories (2011), based on the popular Kate Atkinson novels. Kirsty Mitchell portrayed iconic warrior queen Boudica in the limited event series Barbarians Rising (2016) for The History Channel. This was the highest rated episode of the series, which was broadcast in over 185 territories around the world though the summer and into the fall of 2016. Kirsty Mitchell starred in the BBC crime series New Blood (2016), written by Anthony Horowitz, in which she portrayed a deadly assassin.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MDQ1MDA4OF5BMl5BanBnXkFtZTgwMDc3MTA0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0593511","name":"Kirsty Mitchell","idIMDB":"nm0593511"},"actorId":"nm0593511","character":"Muire Boland","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Heard","urlProfile":"http://www.imdb.com/name/nm0001334","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzczODkyNzY4OV5BMl5BanBnXkFtZTcwNTU0NjQzMQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 March 1945","placeOfBirth":" Washington, District of Columbia, USA","height":"5' 9¼\" (1.76 m)","bio":"John Heard is a very talented actor who established himself in the late 1970s and early '80s with roles in the movies Between the Lines (1977), Chilly Scenes of Winter (1979) (a.k.a. \"Head Over Heels\"), and Heart Beat (1981) (in which he played Jack Kerouac to Nick Nolte's Neal Cassady and Sissy Spacek's Carolyn Cassady) before giving a tour de force performance as a hideously wounded (both physically and psychologically) Vietnam veteran in Cutter's Way (1981) (a.k.a. \"Cutter and Bone\") opposite Jeff Bridges. He also shined as Reverend Dimmesdale (one of America's first religious hypocrites) in the 1979 PBS version of Nathaniel Hawthorne's The Scarlet Letter (1979). Both \"Chilly Scenes of Winter\" and Cutter's Way\" (originally released as \"Head Over Heels\" and \"Cutter and Bone\", respectively) had been re-released under new titles after failing in their first go-rounds, such was the quality of the films. The two re-releases helped redefine the practice by which major studios handled smaller, art house quality pictures by releasing them carefully to select theaters with bespoke marketing campaigns so they reached the proper audience. (Studios would later develop their own art film-independent film subsidiaries to handle such pictures, so they didn't \"fall through the cracks\" like the first releases of the two Heard films.) By the early 1980s John Heard seemed on his way to establishing himself as a major American actor if not on the path to movie stardom. At the time, there was joke that involved confusing Heard with John Hurt and William Hurt because of the similarity of their last names. At the time these contemporaries were considered equal in terms of their star power. That was 30 years ago. William Hurt (the erstwhile husband of Heard's \"Head Over Heels\" co-star Mary Beth Hurt) went on to win a Best Actor Oscar as well as enjoy leading man status as a movie star in the mid- to late-'80s before he flared out in the early 1990s. John Hurt become one of the most respected actors of his generation, nominated twice for the Academy Award. Among Heard's co-stars of his early endeavors, Bridges and Spacek also went on to win Oscars and Nolte has been a multiple nominee. In the early '80s it would not have been unreasonable to predict that Heard himself would become an Oscar winner or a multiple nominee. That didn't happen. (He did get nominated for an Emmy for his turn as a corrupt police detective on The Sopranos (1999).) Heard now is best known for his two turns as Macaulay Culkin's father in the Home Alone (1990) movies. In the 1980s he continued to work on A-List projects, playing the not-so-sympathetic son to Geraldine Page in The Trip to Bountiful (1985) (for which Page won her own Oscar) and Tom Hanks's adult rival in Big (1988) (for which Hanks won his first Oscar nomination), but this meant that by the latter part of the decade he had failed to establish himself as a leading man and was doing supporting roles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzczODkyNzY4OV5BMl5BanBnXkFtZTcwNTU0NjQzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001334","name":"John Heard","idIMDB":"nm0001334"},"actorId":"nm0001334","character":"Jack Lyons","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nigel Bennett","urlProfile":"http://www.imdb.com/name/nm0000911","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMTY2NzM5NF5BMl5BanBnXkFtZTcwMDA5MDYxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1949","placeOfBirth":" Wolverhampton, Staffordshire, England, UK","height":"6' 1\" (1.85 m)","bio":"An accomplished theatre actor, Mr. Bennett appeared on the British stage for fifteen years before moving to Canada in 1986. During this time, he starred in \"The Secret Diary of Adrian Mole\" at the Wyndhams Theatre in London's West End. He also performed in \"Ghosts\", \"Private Lives\" and \"Rookery Nook\" at such theaters as the Haymarket Theatre in Leicester, the Crucible Theatre, the Bristol Old Vic and the King's Head Theatre Club, as well as many seasons on the stages of Canterbury, Newcastle, Nottingham, Plymouth, Manchester, Liverpool and Sheffield in England. From 1992-1996, he starred as the powerful and seductive \"Lucien LaCroix\" in the Gemini-nominated television series, Le justicier des ténèbres (1992). In 1995, he received the prestigious Gemini Award for his role in the series, and it was on this show where he made his directorial debut. His feature film work includes co-starring with Gene Hackman in Narrow Margin (1990), The Outside Chance of Maximilian Glick (1988), a poignant drama that was voted Best New Film at both the Toronto Festival of Festivals and the Vancouver International Film Festival in 1988, Legends of the Fall (1994) starring Brad Pitt, Murder at 1600 (1997) starring Wesley Snipes, Mars à table! (1999), a science fiction feature that premiered at the 1998 Toronto Film Festival and The Skulls (2000) starring Craig T. Nelson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMTY2NzM5NF5BMl5BanBnXkFtZTcwMDA5MDYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000911","name":"Nigel Bennett","idIMDB":"nm0000911"},"actorId":"nm0000911","character":"Dick Somers","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sophie Hough","urlProfile":"http://www.imdb.com/name/nm1015001","urlPhoto":"","biography":{"dateOfBirth":"3 June 1995","placeOfBirth":"","height":"5' 7\" (1.7 m)","bio":"Sophie decided to be an actress when she was three-years-old and, after two years of negotiations with her reluctant parents, and them even trying to get former child superstar Donny Osmond to dissuade her, she finally prevailed and got her first job in Une double vie (2002). It was a wonderful experience working with Christine Lahti who inspired Sophie to want to be the best she can be in all she does. Two Canadian commercials followed. Then her parents, actor Adrian Hough and former British talent agent Marina Darling, moved the family to Vancouver Island, British Columbia. She is still working as an actress as well as pursuing excellent academic achievements and her hobbies: soccer, ballet, music, horse-riding and creating adventures with the fairies in her back garden with her sister, actress Rose Hough, and her baby brother William.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1015001","name":"Sophie Hough","nicknames":["The Soph"],"idIMDB":"nm1015001"},"actorId":"nm1015001","character":"Dierdre","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rick Burchill","urlProfile":"http://www.imdb.com/name/nm1152540","urlPhoto":"","biography":{"bio":"Rick Burchill is an actor, known for Une double vie (2002), Une mère sans défense (2005) and L'écho du mensonge (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1152540","name":"Rick Burchill","idIMDB":"nm1152540"},"actorId":"nm1152540","character":"Tierney","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Christoffel","urlProfile":"http://www.imdb.com/name/nm0160484","urlPhoto":"","biography":{"bio":"David Christoffel is known for his work on Maximum Risk (1996), She's Too Young (2004) and The River King (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0160484","name":"David Christoffel","idIMDB":"nm0160484"},"actorId":"nm0160484","character":"Sullivan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Shore","urlProfile":"http://www.imdb.com/name/nm0794911","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4NjkzMjgxODdeQTJeQWpwZ15BbWU3MDE2NDAwNDQ@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Christopher Shore is an actor and producer, known for Just Buried (2007), Poor Boy's Game (2007) and Touchée en plein coeur (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4NjkzMjgxODdeQTJeQWpwZ15BbWU3MDE2NDAwNDQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0794911","name":"Christopher Shore","idIMDB":"nm0794911"},"actorId":"nm0794911","character":"Martin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Donat","urlProfile":"http://www.imdb.com/name/nm0232195","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxODkxMDgzMV5BMl5BanBnXkFtZTgwNjU5MDg5MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1941","placeOfBirth":" Kentville, Nova Scotia, Canada","height":"6' 3\" (1.91 m)","bio":"Richard Donat was born on June 1, 1941 in Kentville, Nova Scotia, Canada. He is an actor, known for Haven (2010), The Weight of Water (2000) and Pit Pony (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxODkxMDgzMV5BMl5BanBnXkFtZTgwNjU5MDg5MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0232195","name":"Richard Donat","idIMDB":"nm0232195"},"actorId":"nm0232195","character":"Father Paul","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bruce McAllister","urlProfile":"http://www.imdb.com/name/nm1573608","urlPhoto":"","biography":{"bio":"Bruce McAllister is an actor, known for Une double vie (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1573608","name":"Bruce McAllister","idIMDB":"nm1573608"},"actorId":"nm1573608","character":"News Anchor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joseph Rutten","urlProfile":"http://www.imdb.com/name/nm0752135","urlPhoto":"","biography":{"dateOfBirth":"5 May 1931","placeOfBirth":" The Hague, Zuid-Holland, Netherlands","height":"5' 10\" (1.78 m)","bio":"His 60 year career as a professional performer included eight seasons at the Stratford Festival, three national tours with the Canadian Opera Company, over 30 productions at Neptune Theatre and countless other performances at theaters across Canada and the United States. He was a veteran of over 200 CBC Radio dramas and countless television and film performances. For his last performances, he appeared as Pope Calixtus in the feature film \"The Conclave\" and as Wilbur in the mobile device movie, \"The Electric Chair\". A life member of ACTRA, Rutten served as Branch Councillor for ACTRA Maritimes. Joseph was a good person who made a tremendous contribution to the performing arts.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0752135","name":"Joseph Rutten","nicknames":["Joe"],"idIMDB":"nm0752135"},"actorId":"nm0752135","character":"Old Fisherman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike Clattenburg","urlProfile":"http://www.imdb.com/name/nm0154104","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg4NTc4MTM5MF5BMl5BanBnXkFtZTgwOTAwMzMyMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Mike Clattenburg was born in Cole Harbour, Nova Scotia, Canada. He is a writer and director, known for Trailer Park Boys: The Movie (2006), Trailer Park Boys (2001) and Trailer Park Boys: Countdown to Liquor Day (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg4NTc4MTM5MF5BMl5BanBnXkFtZTgwOTAwMzMyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0154104","name":"Mike Clattenburg","idIMDB":"nm0154104"},"actorId":"nm0154104","character":"Television Reporter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Levert","urlProfile":"http://www.imdb.com/name/nm1022857","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NzQ2MDk1NV5BMl5BanBnXkFtZTgwMTc3NzM5MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Award winning actor Gary Levert was born on August 29,1958 in Sudbury, Ontario Canada to Jackie and Ed Levert. He and his family moved to Bathurst, New Brunswick when he was eight years old where he spent most of his formative years. Gary caught the bug for acting at an early age and has been hard at it ever since. Described as a chameleon-like actor Gary is well known to TV and film audiences north and south of the border and has amassed an impressive resume. Working on Moby Dick with William Hurt and Ethan Hawke, Bag of Bones with Pierce Brosnan, and Jesse Stone with Tom Selleck to name a few. Gary's most notable and critically acclaimed performance came with his 1st ACTRA Award in Trudeau II Maverick in the Making. He was presented with his second ACTRA Award for his work on the film, Heart of Rhyme, written and directed by Cory Bowles. He was also nominated for his third ACTRA Award for his compelling performance in Shandi Mitchell's, The Disappeared, along side Billy Campbell, Shawn Doyle and Brian Downy. Gary just wrapped on his first season in the TV drama, Le Clan directed by Jim Donovan for Radio Canada where he plays Damien Logan, an Irish Montrealer, as an organized crime Kingpin.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NzQ2MDk1NV5BMl5BanBnXkFtZTgwMTc3NzM5MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1022857","name":"Gary Levert","idIMDB":"nm1022857"},"actorId":"nm1022857","character":"Pilot","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0289390","urlIMDB":"http://www.imdb.com/title/tt0289390","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 29 min (89 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.6","filmingLocations":[{"location":"Nova Scotia, Canada"}],"rated":"PG-13","awards":[],"votes":"515","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0060306","name":"Lions Gate Films"},{"idCompany":"co0188462","name":"Lions Gate Television"},{"idCompany":"co0026995","name":"Lionsgate Television"}],"keywords":{"keywords":["based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:08:51"}}