{"data":{"movies":[{"title":"Sueño","originalTitle":"","year":"2005","releaseDate":"20050725","directors":[{"name":"Renée Chabria","id":"nm1462795"}],"writers":[{"name":"Renée Chabria","id":"nm1462795"}],"runtime":"108 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMzA5NTI4NV5BMl5BanBnXkFtZTcwMjg0MzgzMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama","Music","Romance"],"plot":"A Mexican immigrant new to Los Angeles enters into a love triangle with two very different women.","simplePlot":"A Mexican immigrant new to Los Angeles enters into a love triangle with two very different women.","actors":[{"actorName":"John Leguizamo","urlProfile":"http://www.imdb.com/name/nm0000491","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEyMjMxNDg5NF5BMl5BanBnXkFtZTcwNzczOTY4MQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1964","placeOfBirth":" Bogotá, Colombia","birthName":"John Alberto Leguizamo","height":"5' 7\" (1.7 m)","bio":"Fast-talking and feisty-looking John Leguizamo has continued to impress movie audiences with his versatility: he can play sensitive and naive young men, such as Johnny in Hangin' with the Homeboys (1991); cold-blooded killers like Benny Blanco in Carlito's Way (1993); a heroic Army Green Beret, stopping aerial terrorists in Executive Decision (1996); and drag queen Chi-Chi Rodriguez in To Wong Foo Thanks for Everything, Julie Newmar (1995). Arguably, not since ill-fated actor and comedian Freddie Prinze starred in the smash TV series Chico and the Man (1974) has a youthful Latino personality had such a powerful impact on critics and fans alike. Leguizamo was born July 22, 1964, in Bogotá, Colombia, to Luz and Alberto Leguizamo. He was four when his family emigrated to the United States. He was raised in Queens, New York, attended New York University and studied under legendary acting coach Lee Strasberg for only one day before Strasberg passed away. The extroverted Leguizamo started working the comedy club circuit in New York and first appeared in front of the cameras in an episode of Miami Vice (1984). His first film appearance was a small part in Cocaïne (1984), and he had minor roles in Casualties of War (1989) and Die Hard 2 (1990) before playing a liquor store thief who shoots Harrison Ford in Regarding Henry (1991). His career really started to soar after his first-rate performance in the independent film Hangin' with the Homeboys (1991) as a nervous young teenager from the Bronx out for a night in brightly lit Manhattan with his buddies, facing the career choice of staying in a supermarket or heading off to college and finding out that the girl he loves from afar isn't quite what he thought she was. The year 1991 was also memorable for other reasons, as he hit the stage with his show Mambo Mouth (1991), in which he portrayed seven different Latino characters. The witty and incisive show was a smash hit and won the Obie and Outer Circle Critics Award, and later was filmed for HBO, where it picked up a CableACE Award. He returned to the stage two years later with another satirical production poking fun at Latino stereotypes titled John Leguizamo: Spic-O-Rama (1993). It played in Chicago and New York, and won the Drama Desk Award and four CableACE Awards. In 1995 he created and starred in the short-lived TV series House of Buggin' (1995), an all-Latino-cast comedy variety show featuring hilarious sketches and comedic routines. The show scored two Emmy nominations and received positive reviews from critics, but it was canceled after only one season. The gifted Leguizamo was still keeping busy in films, with key appearances in Super Mario Bros. (1993), Romeo + Juliet (1996) and Spawn (1997). In 1998 he made his Broadway debut in John Leguizamo: Freak (1998), a \"demi-semi-quasi-pseudo-autobiographical\" one-man show, which was filmed for HBO by Spike Lee. Utilizing his distinctive vocal talents, he next voiced a pesky rat in Doctor Dolittle (1998) before appearing in the dynamic Spike Lee-directed Summer of Sam (1999) as a guilt-ridden womanizer, as the Genie of The Lamp in the exciting Arabian Nights (2000) and as Henri DE Toulouse Lautrec in the visually spectacular Moulin Rouge (2001). He also voiced Sid in the animated Ice Age (2002), co-starred alongside Arnold Schwarzenegger in Collateral Damage (2002) and directed and starred in the boxing film Undefeated (2003). Afterward, Leguizamo starred in the remake of the John Carpenter hit Assaut sur le central 13 (2005) and George A. Romero's long-awaited fourth \"Dead\" film, Land of the Dead - Le territoire des morts (2005). There can be no doubt that the remarkably talented Leguizamo has been a breakthrough performer for the Latino community in mainstream Hollywood, in much the same way that Sidney Poitier crashed through celluloid barriers for African-Americans in the early 1960s. Among his many strengths lies his ability to not take his ethnic background too seriously but also to take pride in his Latino heritage. He has opened many doors for his countrymen. A masterly and accomplished performer, movie audiences await Leguizamo's next exciting performance.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEyMjMxNDg5NF5BMl5BanBnXkFtZTcwNzczOTY4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000491","name":"John Leguizamo","nicknames":["Johnny Legs","John Leguizama"],"idIMDB":"nm0000491"},"actorId":"nm0000491","character":"Antonio","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ana Claudia Talancón","urlProfile":"http://www.imdb.com/name/nm0847799","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMTM4ODI4OV5BMl5BanBnXkFtZTgwNTMzMTk1ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 May 1980","placeOfBirth":" Cancun, Quintana Roo, Mexico","height":"5' 4¼\" (1.63 m)","bio":"Ana Claudia Talancon was born on May 1st, 1980 in Cancun, Mexico. Her first performance was in her home town Quintana Roo in Cancun. She studied acting in Cancun with the Cuban professor Albio Paz. She later went to Mexico City to continue her studies at the Acting Workshop of Héctor Mendoza and Raúl Quintanilla. She has starred in various soap operas such as 'Al norte del corazón', 'Señora','Romántica obsesión' (for which she won the Sol de Oro award in 1999 for Best New Actress) and 'Amor latino'. Her big screen debut in the role of Valentina in _ El cometa (1999)_ by Marisa Sistach, for which she was nominated for the Ariel award for Best New Actress. Her performance as Amelia in El crimen del padre Amaro (2002) with Gael García Bernal, gave her an international recognition.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMTM4ODI4OV5BMl5BanBnXkFtZTgwNTMzMTk1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0847799","name":"Ana Claudia Talancón","idIMDB":"nm0847799"},"actorId":"nm0847799","character":"Nina","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elizabeth Peña","urlProfile":"http://www.imdb.com/name/nm0001615","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1OTQ3MDAzOV5BMl5BanBnXkFtZTYwMjA0NTc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 September 1959","placeOfBirth":" Elizabeth, New Jersey, USA","birthName":"Elizabeth Maria Peña","height":"5' 2\" (1.57 m)","bio":"Elizabeth's love for the arts came naturally, as her father was a well-known playwright, actor, director and novelist, so its not hard to understand that by the time she was 8, Cuban-American Elizabeth Pena already had designs to become an actress. Born in New Jersey, raised in New York, Elizabeth's, and her sister, sister, Tania's parents, Mario and Estella Margarita Peña, had opened off-Broadway's Latin American Theatre Ensemble, and were more than encouraging. Elizabeth attended New York City's High School of the Performing Arts, now the Fiorello H. LaGuardia High School of Music and Art and Performing Arts, and found occasional work in repertory theatre and in television commercials. Her film debut in the independent Spanish-speaking feature, El Super (1979), and started her on a long line of independent and rebellious characters which showed plenty of independence. During the early 80s, she played everything - from a knife-threatening waitress to a disco queen, as she waited for her big break. The big break came in the 1990's form of 2 hugely successful films of different genres; one was the hugely popular comedy, Down and Out in Beverly Hills (1986), co-starring Bette Midler, Richard Dreyfuss and Nick Nolte, in which she stole many scenes as the sultry, politically-minded maid, \"Carmen\", who lusts for Nolte, and the other was the mystery, drama, Jacob's Ladder (1990) This propelled her to move to Los Angeles, where she continued to spice up both the big and small screen, including the part of Ritchie Valens' stepsister-in-law, in the well-received biopic, La Bamba (1987). Honors also came by Elizabeth's way, when she received the \"Independent Spirit\" and \"Bravo\" awards for the film, Lone Star (1996), and the \"ALMA Award\" for Tortilla Soup (2001). On TV, Elizabeth never found the one series role which could showcase her abilities fully. Co-starring roles in Tough Cookies (1986), I Married Dora (1987) and Shannon's Deal (1990) were short-lived. Elizabeth was married since 1994 married to Hans Rolla. The couple had 2 children; a son, Kælan, and a daughter, Fiona . She passed away 14 October, 2014, after a brief illness.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1OTQ3MDAzOV5BMl5BanBnXkFtZTYwMjA0NTc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001615","name":"Elizabeth Peña","idIMDB":"nm0001615"},"actorId":"nm0001615","character":"Mirabela","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nestor Serrano","urlProfile":"http://www.imdb.com/name/nm0785594","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MjUwMzYzM15BMl5BanBnXkFtZTcwMjEzOTM0Ng@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1955","placeOfBirth":" Bronx, New York, USA","height":"6' (1.83 m)","bio":"Nestor Serrano, a native New Yorker, started his acting career almost thirty years ago at Queens college, where he was studying computer science. Joining the drama club was his attempt to meet new people - what he found was a lifelong passion for the performing arts. Although Nestor has traveled all over the world, he still calls New York his home. He lives in Manhattan with his wife Debbie, his son Spike and two dogs, Blackie the yellow Lab and Elvis.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MjUwMzYzM15BMl5BanBnXkFtZTcwMjEzOTM0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0785594","name":"Nestor Serrano","idIMDB":"nm0785594"},"actorId":"nm0785594","character":"El Zorro","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"José María Yazpik","urlProfile":"http://www.imdb.com/name/nm0946962","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NzI4MjMxN15BMl5BanBnXkFtZTcwNTQ0NzM5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1970","placeOfBirth":" Mexico City, Distrito Federal, Mexico","bio":"Jose Maria lived his whole childhood in Mexico City until the age of 12 when he, along with his family, moved to San Diego, California. As soon as he concluded his high school studies, he moved to Tijuana, Mexico, to attend Law school, but in his first career year a personal experience saw him replace Laws for acting, so he applied to the most recognized acting academy in Mexico: CEA (Centro de Estudios de Actuacion de Televisa) where after inquiring in some average Soap Operas his big hit came in 1998 with his role on La vida en el espejo (1999), where he played a polemical, straight-looking homosexual. He's currently working (April - 2004) on Sueño (2005), starring John Leguizamo and Ana Claudia Talancón.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NzI4MjMxN15BMl5BanBnXkFtZTcwNTQ0NzM5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0946962","name":"José María Yazpik","idIMDB":"nm0946962"},"actorId":"nm0946962","character":"Pancho","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jsu Garcia","urlProfile":"http://www.imdb.com/name/nm0006987","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NzYzMTE5N15BMl5BanBnXkFtZTcwOTU3MDE5Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 October 1963","placeOfBirth":" New York City, New York, USA","birthName":"Jsu Garcia","height":"6' 1\" (1.85 m)","bio":"Born in New York City, Jsu Garcia was raised by his Cuban-born parents, who had fled their country for the promise of a better life in the US. Growing up on the streets of Newark, New Jersey, Garcia had to deal with a neighborhood of toughs. He became aware of his acting talents when a bully intended to mug him and steal his bicycle and the six-year-old Garcia broke into crocodile tears and so disheartened his assailant that he allowed Garcia to leave unharmed--and with his bike. \"It was then I knew I could act,\" Garcia remembers. His first break came when he auditioned for the TV show \"Fame\" (1982) and got the part. He then landed a role in Wes Craven's A Nightmare on Elm Street (1984), in which he appeared opposite Johnny Depp. This was followed by an appearance in Universal's Gotcha! (1985) opposite Anthony Edwards and Linda Fiorentino, and then in quick succession in features such as Wildcats (1986), Slaves of New York (1989), Vampire in Brooklyn (1995), Traffic (2000) and numerous others. In 2002 Garcia was in Randall Wallace's We Were Soldiers in which he portrays Mel Gibson's heroic buddy, the commander of a company fighting against the Viet Cong; and in Andrew Davis' Collateral Damage (2002), in which he plays a villainous Communist guerrilla who battles good guy Arnold Schwarzenegger. Garcia also played a major supporting role in Along Came Polly (2004), opposite Ben Stiller, Jennifer Aniston and Philip Seymour Hoffman for Jersey Films and Universal, as the hot salsa dancer. Garcia's most challenging role as \"Che Guevara\" came true for him in Andy Garcia's passionate Cuban story, \"The Lost City\", in which he received critical acclaim. Teaming up again with Steven Soderberg in 2007 in \"Che\" aka \"The Argentine\", Garcia starred opposite Benicio del Toro. Taking what he learned from some of Hollywood's greatest actors and directors, he joined with good friend and NY Times #1 bestselling author and spiritual teacher Dr. John-Roger, to create their production company Scott J-R Productions and their first full length feature, Spiritual Warriors. Inspired by Dr. John-Roger's bestselling book Spiritual Warrior, together they wrote and Executive Produced Spiritual Warriors, the movie. Garcia gathered his crew of ten and filmed on location in places such as Egypt, Jordan, and Syria, and finished filming in Los Angeles with a much larger crew. Spiritual Warriors screened in over 50 cities across 22 countries, and was officially selected for international film festivals in Toronto, Tel Aviv, Cairo, Cartagena, Beverly Hills and Hamburg. Garcia also heads up his company Gilgamesh LLC, and the current DVD distribution of Spiritual Warriors online. John-Roger and Garcia finished their second feature film in September 2010, as co-writers, co-producers, and co-directors on the project. 'The Wayshower' stars Eric Roberts, Peter Stormare and Sally Kirkland, and was filmed on location in Utah, Morocco, England, France, Spain and Peru. The Wayshower will tour film festivals and other private screenings from early 2011. Garcia has also graduated from Peace Theological Seminary and College of Philosophy with a Doctor of Spiritual Science (DSS) in 2008. His Practical Treatise (PT) is titled 'Living with a Spiritual Warrior', and explores the lessons he has learnt and blessings discovered in working closely with Dr. John-Roger for more than twenty years. Garcia currently lives in Los Angeles California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NzYzMTE5N15BMl5BanBnXkFtZTcwOTU3MDE5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006987","name":"Jsu Garcia","nicknames":["Jsu","Zeus"],"idIMDB":"nm0006987"},"actorId":"nm0006987","character":"Rafael","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rafael Simón","urlProfile":"http://www.imdb.com/name/nm1296467","urlPhoto":"","biography":{"dateOfBirth":"13 October 1973","placeOfBirth":" New York City, New York, USA","bio":"Born in New York City, Rafael Simón began his formal acting career when he entered the National Conservatory for the Dramatic Arts, Georgetown (Washington D.C.) in 1995, after studying Anthropology and Political Science at the University of Maryland. He continued his training at the Studio Theater Conservatory (D.C.). He debuted as an actor playing Leoncio in 'I Never Said I Was a Good Girl' with the Gala Theater Company (D.C.). Almost simultaneously he played Ramon in Terrence McNally's 'Love! Valour! Compassion!' at the Studio Theater (D.C.). He was cast in the short film 'Sin Ton Ni Sonia' (1998) directed by Carlos Sama (Mexico City). There he continued shaping his craft in institutions such as the Mexican Institute for the Fine Arts (IMBA), and Casa del Teatro. Simón played his first role in a feature film, alongside Steven Bauer (Scarface) and Yareli Arizmendi (Like Water for Chocolate), in master cinematographer Gabriel Beristain's directorial debut 'El Grito'. He relocated to Los Angeles and immediately joined the Cornerstone Theatre Company (L.A.) in their Mark Taper Forum original grand production of \"For Here or To Go\", directed by Bill Rauch. Created his production entity, StagescraperWorks, with theatrical and film production plans (2001). Rafael joined director Carlos Sama in the feature length version of 'Sin Ton Ni Sonia' (2001-2002). While developing his directorial skills, he participated in several short films, as well as filming his own.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1296467","name":"Rafael Simón","idIMDB":"nm1296467"},"actorId":"nm1296467","character":"Adón","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rick Simon","urlProfile":"http://www.imdb.com/name/nm1413485","urlPhoto":"","biography":{"bio":"Rick Simon is known for his work on Anima (2003), Sueño (2005) and The Bet (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1413485","name":"Rick Simon","idIMDB":"nm1413485"},"actorId":"nm1413485","character":"Jorge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alejandro Patiño","urlProfile":"http://www.imdb.com/name/nm0665620","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMjAzNTAxM15BMl5BanBnXkFtZTcwODI0OTMxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 8\" (1.73 m)","bio":"Alejandro Patino was born in Santa Maria California where family still resides His parents moved to Compton California where they opened a Market Deli from the late Sixties till early Eighties. He entered college as a Business Major and came out Acting & Dancing. He has been relentless in his pursuit of Acting goals, since then acquiring quite an extensive resume. His first ever film work came in the cult classic \"The Forbidden Zone\" Directed by Richard Elfman, that was the beginning.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMjAzNTAxM15BMl5BanBnXkFtZTcwODI0OTMxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0665620","name":"Alejandro Patiño","idIMDB":"nm0665620"},"actorId":"nm0665620","character":"Uncle Alfonso","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Omar Ruvalcaba-Rosas","urlProfile":"http://www.imdb.com/name/nm2646208","urlPhoto":"","biography":{"bio":"Omar Ruvalcaba-Rosas is an actor, known for Sueño (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2646208","name":"Omar Ruvalcaba-Rosas","idIMDB":"nm2646208"},"actorId":"nm2646208","character":"Juan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mario Arias Jr.","urlProfile":"http://www.imdb.com/name/nm2645512","urlPhoto":"","biography":{"bio":"Mario Arias Jr. was an actor, known for Sueño (2005). He died on November 6, 2011 in San Diego, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2645512","name":"Mario Arias Jr.","idIMDB":"nm2645512"},"actorId":"nm2645512","character":"Miguel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Erica Muñoz","urlProfile":"http://www.imdb.com/name/nm1483662","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxNjI3NzcyMF5BMl5BanBnXkFtZTgwMjM1MjkwNDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 4\" (1.63 m)","bio":"Born in Los Angeles, Erica Muñoz, started performing at 8 years old. After attending an open call for the Pulitzer Prize-winning musical, RENT, she was offered a role in the Broadway company. Despite being accepted into the prestigious California Institute of the Arts as a Voice Major, she chose instead to pursue her dream of acting on Broadway. After thriving on Broadway, Erica returned to Los Angeles. Soon after her return, she booked her first television job in the pilot episode of \"The Handler,\" starring opposite Joe Pantolione. She was invited, over 3,000 other candidates, to participate in CBS's Diversity Showcase, sponsored by CBS and the Screen Actors Guild, displaying minority talent in the entertainment industry. She is known for roles in the film \"Sueno,\" opposite the talented John Leguizamo and Elizabeth Pena, the popular CBS drama \"Jericho,\" opposite Skeet Ulrich and in the sketch comedy show, \"Acceptable TV\" on Vh1. In her latest work, Erica can be seen in the drama \"Days of Wrath\", opposite Laurence Fishburne and Wilmer Valderrama and most recently in Grey's Anatomy, again, opposite Valderrama as his sister.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxNjI3NzcyMF5BMl5BanBnXkFtZTgwMjM1MjkwNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1483662","name":"Erica Muñoz","idIMDB":"nm1483662"},"actorId":"nm1483662","character":"Ana","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Winston J. Rocha","urlProfile":"http://www.imdb.com/name/nm0733894","urlPhoto":"","biography":{"bio":"Winston J. Rocha is an actor, known for A Thousand Words (2012), The Million Dollar Hotel (2000) and Get Smart's Bruce and Lloyd Out of Control (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0733894","name":"Winston J. Rocha","idIMDB":"nm0733894"},"actorId":"nm0733894","character":"Papa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tobin Esperance","urlProfile":"http://www.imdb.com/name/nm1393538","urlPhoto":"","biography":{"dateOfBirth":"14 November 1979","placeOfBirth":" Vacaville, California, USA","height":"6' (1.83 m)","bio":"Tobin Esperance was born on November 14, 1979 in Vacaville, California, USA. He was previously married to Jennifer Esperance.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1393538","name":"Tobin Esperance","idIMDB":"nm1393538"},"actorId":"nm1393538","character":"Enrique","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alan Marco","urlProfile":"http://www.imdb.com/name/nm2765019","urlPhoto":"","biography":{"bio":"Alan Marco is an actor and producer, known for Brother (2000), Grand Theft Auto V (2013) and Silver Case (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2765019","name":"Alan Marco","idIMDB":"nm2765019"},"actorId":"nm2765019","character":"Victor","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0383648","urlIMDB":"http://www.imdb.com/title/tt0383648","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"11","month":"09","year":"2003","remarks":null},null],"copyrightHolder":"© 2004 Columbia TriStar Home Entertainment"},"technical":{"runtime":["1 hr 48 min (108 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.2","metascore":"40","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"PG-13","awards":[{"award":"Imagen Foundation Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Imagen Award","categories":[{"category":"Best Actor","names":[{"name":"John Leguizamo","id":"nm0000491","role":null}]}]}]}],"votes":"473","type":"Movie","companyCreditsSimple":[{"idCompany":"co0101416","name":"El Camino Pictures"},{"idCompany":"co0208127","name":"Home Artist Management"},{"idCompany":"co0040467","name":"La Tuna Films"}],"keywords":{"keywords":["mexican immigrant","love triangle","love","immigrant","mexican","reference to game boy","father son relationship","wish","veracruz mexico","fiance fiancee relationship","drums","bass guitar","giving a toast","npr","national public radio","air guitar","hallucination","necklace","psychic reading","tamale","auto mechanic","vegetarian","flowers","rehearsal","child welfare","cook","dog","busboy","burrito","taco","sombrero","animated scene","grandfather grandson relationship","family relationships","uncle nephew relationship","church","coffin","funeral","champagne","drink","drinking","bar","interview","radio show","older woman younger man relationship","brother brother relationship","stroke","doctor","hospital","photograph","earphones","truck driver","record player","recording","veterinarian","kiss","contest","talent contest","neighbor","single mother","freeze frame","machismo","nightclub","microphone","remote control","watching tv","father daughter relationship","friendship","friend","concert","apology","mirror","latin american","ambition","hope","boy","mother son relationship","animated credits","tears","crying","restaurant","cafe","eating","food","fired from the job","rags to riches","death","dancing","dancer","band","voice over narration","guitar","guitarist","musician","song","singing","singer","los angeles california","mexican american","death of mother"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:19:03"}}