{"data":{"movies":[{"title":"Employee of the Month","originalTitle":"","year":"2004","releaseDate":"20040117","directors":[{"name":"Mitch Rouse","id":"nm0745861"}],"writers":[{"name":"Mitch Rouse","id":"nm0745861"},{"name":"Jay Leggett","id":"nm0499343"}],"runtime":"97 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5ODk1OTY4OV5BMl5BanBnXkFtZTcwMTc2MzcyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama"],"plot":"\"Employee of the Month\" is about a guy whose day spirals from bad to worse when he gets fired from his dream job at the bank and is dumped by his fiancée Sara. David's best friend Jack tries to convince him it's for the best, but the opposite occurs when bank robberies and millions of dollars become part of his day from hell.","simplePlot":"\"Employee of the Month\" is about a guy whose day spirals from bad to worse when he gets fired from his dream job at the bank and is dumped by his fiancée Sara. David's best friend Jack ... ","actors":[{"actorName":"Matt Dillon","urlProfile":"http://www.imdb.com/name/nm0000369","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzk4NjI3NjQ0MF5BMl5BanBnXkFtZTgwMzE3NzI5NzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 February 1964","placeOfBirth":" New Rochelle, New York, USA","birthName":"Matthew Raymond Dillon","height":"6' (1.83 m)","bio":"Matt Dillon's successful film career has spanned over three decades and has showcased his wide range of dramatic and comedic talents. Dillon displayed his versatility with an arresting performance co-starring as a racist cop in the critically acclaimed Paul Haggis film Crash. This role earned him nominations for an Academy award, Golden Globe Award, Screen Actors Guild Award, Critics Choice Award, BAFTA Award and won him an Independent Spirit Award. In addition, the film earned him a Screen Actors Guild Award and a Critics Choice Award for Best Ensemble. As the New York Times' Film Critic A.O. Scott put it, \"He seems to be getting better with every film.\" He starred opposite Kate Hudson and Owen Wilson in Universal Pictures' comedy, You, Me and Dupree and in Factotum for which he received glowing reviews for portraying Charles Bukowski's alter ego when the film premiered at the Cannes Film Festival. From his breakthrough performance in The Outsiders to his hilarious turn as an obsessed private investigator in There's Something About Mary, he has proven himself to be one of the most diverse actors of his generation. In 1990 Dillon won an IFP Spirit Award for his gritty performance as a drug addict in Gus Van Sant's Drugstore Cowboy. From there he went on to star in such films as Ted Demme's Beautiful Girls opposite Uma Thurman and Natalie Portman, Cameron Crowe's Singles, In & Out with Kevin Kline, Kevin Spacey's Albino Alligator, Francis Ford Coppola's Rumble Fish, Garry Marshall's Flamingo Kid, Van Sant's To Die For with Nicole Kidman, and John McNaughton's Wild Things. He starred in Nothing But The Truth, opposite Kate Beckinsale and Vera Farmiga, Disney's Old Dogs, opposite John Travolta, Robin Williams and Kelly Preston, and the Screen Gems films Armored and Takers. Aside from being an accomplished actor, Dillon wrote, and made his feature film directorial debut with City of Ghosts, in which he also starred with Gérard Depardieu, Stellan Skarsgård, and James Caan. Prior to City of Ghosts, Dillon made his television directorial debut in 1997 with an episode of HBO's gritty prison drama Oz. Dillon's achievements continued with television appearances in an HBO adaptation of Irwin Shaw's Return To Kansas City and a part co-narrating the documentary Dear America: Letters From Home. Dillon's multi-talents have also landed him on stage starring on Broadway in The Boys In Winter as well as the PBS/American Playhouse production of The Great American Fourth Of July And Other Disasters. His recent film credits include the comedy Girl Most Likely opposite Annette Bening and Kristen Wiig; the drama Sunlight, Jr. opposite Naomi Watts, and the heist comedy The Art Of The Steal opposite Kurt Russell. Dillon most recently starred in M. Night Shyamalan's hit television event series Wayward Pines for FOX.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzk4NjI3NjQ0MF5BMl5BanBnXkFtZTgwMzE3NzI5NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000369","name":"Matt Dillon","idIMDB":"nm0000369"},"actorId":"nm0000369","character":"David Walsh","urlCharacter":"http://www.imdb.com/character/ch0024984","main":true},{"actorName":"Steve Zahn","urlProfile":"http://www.imdb.com/name/nm0001872","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NzI1NzgwOV5BMl5BanBnXkFtZTcwNDA4MDY3Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1967","placeOfBirth":" Marshall, Minnesota, USA","birthName":"Steven James Zahn","height":"5' 7¼\" (1.71 m)","bio":"Steve Zahn was born in Marshall, Minnesota, to Zelda, who worked at a YMCA, and Carleton Edward Zahn, a Lutheran pastor. His father is of German and Swedish descent and his mother is of German ancestry. Zahn's career kicked off in his native Minnesota when he crashed the audition of a local stage production of \"Biloxi Blues\" and won the lead role. Next trained at American Repertory Theatre in Cambridge, MA; then moved to New York City where he won a role touring for 13 months in national company of Tommy Tune-directed version of \"Bye Bye Birdie\". Back in New York, he played opposite Ethan Hawke in \"Sophistry\" at Playwright's Horizon, where Ben Stiller noticed him and cast him and Hawke in Reality Bites (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NzI1NzgwOV5BMl5BanBnXkFtZTcwNDA4MDY3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001872","name":"Steve Zahn","idIMDB":"nm0001872"},"actorId":"nm0001872","character":"Jack","urlCharacter":"http://www.imdb.com/character/ch0024985","main":true},{"actorName":"Christina Applegate","urlProfile":"http://www.imdb.com/name/nm0000775","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NDc2OTE2Nl5BMl5BanBnXkFtZTcwMTc4NDcxNg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 November 1971","placeOfBirth":" Hollywood, Los Angeles, California, USA","height":"5' 5\" (1.65 m)","bio":"Christina Applegate was born in Hollywood, Los Angeles, California, to record producer/executive Robert William Applegate and singer-actress Nancy Priddy. Her parents split-up shortly after her birth. She has two half-siblings from her father's re-marriage - Alisa (b. 10 October 1977) & Kyle (b. 15 July 1981). Alisa and Christina are best friends and even lived together while Alisa was going to college. Christina's mother took her along on all of her auditions and acting jobs. She made her acting debut at age five months, when her mother got her in a commercial for Playtex nursers. Her mother never remarried, but kept company with Stephen Stills. Christina still cherishes a guitar Stephen gave her when she was young. She played in a number of TV series before landing her breakout role in Married with Children (1987). Christina still studies jazz dance.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NDc2OTE2Nl5BMl5BanBnXkFtZTcwMTc4NDcxNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000775","name":"Christina Applegate","idIMDB":"nm0000775"},"actorId":"nm0000775","character":"Sara Goodwin","urlCharacter":"http://www.imdb.com/character/ch0069882","main":true},{"actorName":"Andrea Bendewald","urlProfile":"http://www.imdb.com/name/nm0070541","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5ODUxOTIyMV5BMl5BanBnXkFtZTYwNjkyODQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1970","placeOfBirth":" New York City, New York, USA","bio":"Andrea Bendewald was born on March 4, 1970 in New York City, New York, USA. She is an actress, known for Suddenly Susan (1996), Employee of the Month (2004) and One Night at McCool's (2001). She has been married to Mitch Rouse since August 19, 2001. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5ODUxOTIyMV5BMl5BanBnXkFtZTYwNjkyODQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0070541","name":"Andrea Bendewald","idIMDB":"nm0070541"},"actorId":"nm0070541","character":"Wendy","urlCharacter":"http://www.imdb.com/character/ch0069884","main":true},{"actorName":"Jay Leggett","urlProfile":"http://www.imdb.com/name/nm0499343","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTM2ODY5OTg3OF5BMl5BanBnXkFtZTgwMTAzMjU3MDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1963","placeOfBirth":" Tomahawk, Wisconsin, USA","birthName":"Jay Michael Leggett","bio":"Jay Leggett was born on August 9, 1963 in Tomahawk, Wisconsin, USA as Jay Michael Leggett. He was an actor and producer, known for Employee of the Month (2004), Another Day in Paradise (1998) and In Living Color (1990). He died on November 23, 2013 in Tomahawk.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTM2ODY5OTg3OF5BMl5BanBnXkFtZTgwMTAzMjU3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0499343","name":"Jay Leggett","idIMDB":"nm0499343"},"actorId":"nm0499343","character":"Dorff","urlCharacter":"http://www.imdb.com/character/ch0069886","main":true},{"actorName":"David Pasquesi","urlProfile":"http://www.imdb.com/name/nm0664727","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwMzkyNzU2NDleQTJeQWpwZ15BbWU4MDc0MTM1NDgx._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"David Pasquesi is an actor and writer, known for Veep (2012), Groundhog Day (1993) and Angels & Demons (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwMzkyNzU2NDleQTJeQWpwZ15BbWU4MDc0MTM1NDgx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0664727","name":"David Pasquesi","idIMDB":"nm0664727"},"actorId":"nm0664727","character":"Kyle Lacopa","urlCharacter":"http://www.imdb.com/character/ch0069887","main":true},{"actorName":"Peter Jason","urlProfile":"http://www.imdb.com/name/nm0419273","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMjcxOTE3NF5BMl5BanBnXkFtZTcwMzYyNTg5Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1944","placeOfBirth":" Hollywood, California, USA","birthName":"Peter Edward Ostling","height":"5' 11\" (1.8 m)","bio":"Excellent, prolific and versatile character actor Peter Jason was born on July 22, 1944, in Hollywood, CA, and grew up in Balboa. He attended Newport Beach Elementary School, Horace Ensign Junior High and Newport Harbor High School. He originally planned on being a football player, but fell in love with acting after playing the lead in a high school production of \"The Man Who Came to Dinner.\" Following his high school graduation he attended Orange Coast Junior College and did a season of summer stock at the Peterborough Playhouse in New Hampshire. He then studied as a drama major at the Carnegie Institute of Technology in Pittsburgh, PA. More stage work followed with the acting group the South Coast Repertory Company. He made his film debut in Howard Hawks' final film, Rio Lobo (1970) (which Jason says is one of his favorites). He worked with Orson Welles on the uncompleted The Other Side of the Wind as an actor, boom operator, prop man and even cook for the cast and crew. Jason has appeared in many films for director Walter Hill; he's especially memorable as the racist redneck bartender in 48 Hrs. (1982). He has also appeared in many films for director John Carpenter: he's very engaging as the jolly Dr. Paul Leahy in Prince of Darkness (1987) and was terrific as underground guerrilla army leader Gilbert in They Live (1988). Other notable roles include a sinister government agent in Dreamscape (1984), rugged Maj. G.F. Devin in Clint Eastwood's Heartbreak Ridge (1986), jerky detective Fedorchuk in Alien Nation (1988), a newspaper reporter in Seabiscuit (2003) and the U.S. president in Alien Apocalypse (2005). Jason recently had a recurring role as dissolute gambler Con Stapleton in the superbly gritty cable Western TV series Deadwood (2004). He also had a regular part as Capt. Skip Gleason on Mike Hammer, Private Eye (1997). Among the many TV shows Peter has done guest spots on are Desperate Housewives (2004), Sabrina, the Teenage Witch (1996), Nash Bridges (1996), Coach (1989), The Golden Girls (1985), Murder, She Wrote (1984), Married with Children (1987), Roseanne (1988), Dear John (1988), Quantum Leap (1989), Dr. Quinn, Medicine Woman (1993), B.J. and the Bear (1978), The Incredible Hulk (1978), Gunsmoke (1955) and Hawaii Five-O (1968). In addition to his substantial film and TV show credits, Jason has acted in over 150 plays and hundreds of TV commercials. An accomplished baritone vocalist, Jason has sung in such musical stage productions as \"The Music Man\" (this is one of his favorite plays), \"Stop the World, I Want to Get Off,\" \"The Roar of the Greasepaint\" and \"Threepenny Opera\" (as Mack the Knife). He's been married to his wife Eileen for 33 years. In his spare time he makes his own furniture with found, recycled wood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMjcxOTE3NF5BMl5BanBnXkFtZTcwMzYyNTg5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0419273","name":"Peter Jason","idIMDB":"nm0419273"},"actorId":"nm0419273","character":"Bill Gartin","urlCharacter":"http://www.imdb.com/character/ch0069888","main":true},{"actorName":"Paul Dooley","urlProfile":"http://www.imdb.com/name/nm0233209","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MTczMTYwOV5BMl5BanBnXkFtZTcwNjk4MzIzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1928","placeOfBirth":" Parkersburg, West Virginia, USA","birthName":"Paul Brown","height":"5' 10\" (1.78 m)","bio":"Dooley was a keen cartoonist as a youth and drew a strip for a local paper in Parkersburg, West Virginia. He joined the Navy before discovering acting while at college. Moving to New York, he soon found success as a regular on the stage. Also having an interest in comedy, Dooley was a stand-up comedian for five years, as well as having brief stints as a magician and as a clown. Not afraid of trying different areas of entertainment, he has also worked as a writer. After appearing in many movies, including most notably Popeye (1980), Dooley has appeared as recurrent characters on various shows, including My So-Called Life (1994), Dream On (1990), Grace Under Fire (1993), and Star Trek: Deep Space Nine (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MTczMTYwOV5BMl5BanBnXkFtZTcwNjk4MzIzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0233209","name":"Paul Dooley","idIMDB":"nm0233209"},"actorId":"nm0233209","character":"Reverend Ben Goodwin","urlCharacter":"http://www.imdb.com/character/ch0069889","main":true},{"actorName":"Noel Gugliemi","urlProfile":"http://www.imdb.com/name/nm0346595","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NjMwOTkxMF5BMl5BanBnXkFtZTcwNzc3OTMzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1970","placeOfBirth":" Santa Monica, California, USA","birthName":"Noel Albert Guglielmi","height":"5' 9\" (1.75 m)","bio":"Noel Gugliemi was born in 1970 in Santa Monica, California, USA as Noel Albert Guglielmi. He is an actor and producer, known for The Fast and the Furious (2001), The Dark Knight Rises (2012) and Training Day (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NjMwOTkxMF5BMl5BanBnXkFtZTcwNzc3OTMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0346595","name":"Noel Gugliemi","nicknames":["Noel G"],"idIMDB":"nm0346595"},"actorId":"nm0346595","character":"Chicken","urlCharacter":"http://www.imdb.com/character/ch0260861","main":true},{"actorName":"Dave Foley","urlProfile":"http://www.imdb.com/name/nm0004929","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE5MjgyODYxNV5BMl5BanBnXkFtZTcwMzQxNTU3MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 January 1963","placeOfBirth":" Toronto, Ontario, Canada","birthName":"David Scott Foley","height":"5' 8\" (1.73 m)","bio":"Dave Foley dropped out of an alternative high school to do stand-up comedy. He met Kevin McDonald at an improv class and, while employed as movie ushers, they began working as a comedy team. In 1984 they merged with another team to form \"The Kids in the Hall\". Foley made his film debut at 22 as the lead in the Canadian film High Stakes (1986).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE5MjgyODYxNV5BMl5BanBnXkFtZTcwMzQxNTU3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004929","name":"Dave Foley","nicknames":["Dave"],"idIMDB":"nm0004929"},"actorId":"nm0004929","character":"Eric","urlCharacter":"http://www.imdb.com/character/ch0069885","main":true},{"actorName":"Renee Albert","urlProfile":"http://www.imdb.com/name/nm0016579","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2OTEwNjQyMl5BMl5BanBnXkFtZTgwNzUzMjQ3MjE@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1964","placeOfBirth":" Duluth, Minnesota, USA","birthName":"Renee Christine Albert","height":"6' (1.83 m)","bio":"Renee Albert was born in Duluth, Minnesota. Her mother was a Medical Transcriptionist and her father was an Industrial Arts Teacher. She is an alumni of The Second City in Chicago. Other theater credits include The Goodman Theatre (Chicago) and Brave New Workshop (Minneapolis). She is a founding member of the Hollywood Accordian Club.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2OTEwNjQyMl5BMl5BanBnXkFtZTgwNzUzMjQ3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0016579","name":"Renee Albert","idIMDB":"nm0016579"},"actorId":"nm0016579","character":"Martha","urlCharacter":"http://www.imdb.com/character/ch0069890","main":true},{"actorName":"Enrique Almeida","urlProfile":"http://www.imdb.com/name/nm1376938","urlPhoto":"","biography":{"height":"5' 10\" (1.78 m)","bio":"ENRIQUE KORNHAUSER ALMEIDA BIO Enrique Kornhauser Almeida was born on June 2nd 1979 in Los Angeles. His parents, recent immigrants, struggled to make a living in the US forcing them to live on the \"wrong side of the tracks\". The movie theatre was the only affordable, safe outlet that the family was able to enjoy together. So they went every Sunday like clockwork. It was during this time that Enrique at a young age developed a passion for Cinema. After graduating high school Enrique knew where his heart lay. With no family or social connection to the film industry, he jumped in with both feet, taking acting and writing classes everywhere he could, eventually landing his first real acting gig on the Latin based TV-show PLACAS. Enrique has since appeared in many feature films such as BRUCE ALMIGHTY with Jim Carrey and Morgan Freeman, EMPLOYEE OF THE MONTH and GANGS OF THE DEAD. He's also had numerous guest star gigs on the hit TV shows CSI MIAMI, THE UNIT, DAYS OF OUR LIVES, LAS VEGAS, BOSTON LEGAL, THE SHIELD, MAD TV, THE MINDY PROJECT and many others. In 2004 he founded the production company Stonehenge Pictures and co-produced the movie SPLINTER with Edward James Olmos and Tom Sizemore. SPLINTER also marked Enrique's debut as a screenwriter. The script attracted a lot of attention because of the heartfelt portrayal of a ruthless, but broken gang member named Dreamer who is trying to come to terms with his brother's brutal death in a gang war. Unable to find a Latino actor who could pull such a multi-faceted role, Enrique decided to play Dreamer himself; he has since become one of the busiest young Latino actors in Southern California. He co-wrote and starred in two independent films that gained world-wide distribution and were screened at over twenty film festivals. The raving reviews for his portrayal of the dark drug lord Tiburon in HITTIN' THE BRICKS and his performance in the socially conscious character piece 25 TO LIFE of which he wrote as well only give a glimpse of his spectrum and abilities as an actor and writer.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1376938","name":"Enrique Almeida","idIMDB":"nm1376938"},"actorId":"nm1376938","character":"Ruben","urlCharacter":"http://www.imdb.com/character/ch0069891","main":true},{"actorName":"Mark Beltzman","urlProfile":"http://www.imdb.com/name/nm0069689","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NzM0MzI2MF5BMl5BanBnXkFtZTgwNDgyMjY2MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1960","placeOfBirth":"","height":"5' 8\" (1.73 m)","bio":"Mark Beltzman has been acting, writing, and directing for since 1981. He was a founding member of Improv Olympic in Chicago and of the legendary group, Barons Barracudas. Mark has worked and directed at the famed Second City in Chicago. He directed many improvisational and theatrical productions at Second City in Chicago and Los Angeles, including the Second City Alumni Jam. He was also instructor/director at The Second City Training Center, Improv Olympic West and the Upfront Comedy Showcase as well as All over the U.S., U.K., and France. His generosity of spirit and love for the art has influenced many young performers who continue to value him as a source of creativity and inspiration through personal contact and theater workshops. He continues to be a requested advisor, director and acting coach to some of the hottest young talent in the business. Mark's passion as a highly creative person and seasoned ensemble performer is to continue to create a body of work that reflects his level of integrity and commitment to quality. It is critical to him that the concepts of \"working together as a group\" and \"making each other look good\" are an integral part of any ensemble work. He encourages cast and crew to remove obstacles and to elevate the text to be the most important aspect of the creative process. Mark has also acquired a great deal of knowledge about the creative process of producing, writing and directing while performing in such notable productions as: Mo Money, Billy Madison, The Wedding Singer, Speed 2, Star Maps, Lovely and Amazing, and Employee of the Month, Factory, Seinfeld, Rosanne, Norm, Curb Your Enthusiasm, According to Jim, Cold Case, House, True Jackson VP, The Young and the Restless, and Pretty Little Liars. Mark's ability to create \"something from nothing\" is exemplified in the outreach program he created in 2006, called \"New Choice.\" Mark and a crew of established industry professionals go into the inner city and teach improvisational and filmmaking skills to the youth. New Choice is now a 501 (c) 3 not for profit, and continues to expand.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NzM0MzI2MF5BMl5BanBnXkFtZTgwNDgyMjY2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0069689","name":"Mark Beltzman","idIMDB":"nm0069689"},"actorId":"nm0069689","character":"Hank","urlCharacter":"http://www.imdb.com/character/ch0069892","main":true},{"actorName":"Brian Blondell","urlProfile":"http://www.imdb.com/name/nm0089050","urlPhoto":"","biography":{"bio":"Brian Blondell is known for his work on Blast from the Past (1999), Employee of the Month (2004) and Normal Life (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0089050","name":"Brian Blondell","idIMDB":"nm0089050"},"actorId":"nm0089050","character":"Paulo, the Waiter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Timothy Botka","urlProfile":"http://www.imdb.com/name/nm0098558","urlPhoto":"","biography":{"dateOfBirth":"10 October 1962","placeOfBirth":" Massachusetts, USA","bio":"John Timothy Botka, born October 10, 1962, the oldest of three children, was raised in Plainville, Massachusetts, the son of Sylvia and John Botka, amateur skaters. He attended King Philip Regional High School, graduating in 1981. Botka attended Chamberlayne Jr. College in Boston and graduated with an Associates degree. Prior to becoming an actor, Botka worked as a freelance graphic designer and photographer in Boston. Some of his work has been featured in Stuff Magazine. In 1984, on a whim, Botka auditioned for Stanley Kubrick's Full Metal Jacket. Unfortunately, he did not win a role but his taped audition landed in the 2008 TV documentary Stanley Kubrick's Boxes. In 1986 Botka moved to Los Angeles to further his career in advertising. Botka's first professional job came about when Joe Pytka cast him in a Miller Beer commercial with Peter Coyote. \"Think when you drink\", one of the first commercials to promote responsible drinking. More commercials would follow; Sprite (which featured one of his talents as a roller-skating waiter on a cruise ship), Chevy, GMC, and Blockbuster Video. His first television appearance was on the series Amen. Through the mid-to-late 90's, Botka continued to work on television and feature films; Apollo 13, Veronica's Closet (in which he played Todd, next door neighbor of Leo and Perry), End of Days, Watching Ellie, Without a Trace, Employee of the Month and on the Showtime series Brotherhood. In addition to his acting credits, Botka has also doubled for actors Chris O'Donnell and Christian Slater. In 2008, Botka landed a role in Tell Tale as a Police Officer alongside Josh Lucas. Directed by Michael Cuesta, Tell Tale premiered at the Tribeca Film Festival in 2009.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0098558","name":"John Timothy Botka","idIMDB":"nm0098558"},"actorId":"nm0098558","character":"Yuppie","urlCharacter":"http://www.imdb.com/character/ch0260865","main":true}],"seasons":[],"idIMDB":"tt0362590","urlIMDB":"http://www.imdb.com/title/tt0362590","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"16","month":"06","year":"2003","remarks":null},null],"copyrightHolder":"Copyright 2004 Employee Of The Month, LLC. All Rights Reserved"},"technical":{"runtime":["1 hr 37 min (97 min)","1 hr 37 min (97 min) (Argentina)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1 (letterbox)"],"camera":["Panavision Cameras and Lenses"],"laboratory":["FotoKem Laboratory, Burbank (CA), USA (color by) (as FotoKem)"],"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.2","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[],"votes":"8,668","type":"Movie","companyCreditsSimple":[{"idCompany":"co0107198","name":"Bob Yari Productions"},{"idCompany":"co0097514","name":"Bull's Eye Entertainment"},{"idCompany":"co0068448","name":"DEJ Productions"}],"keywords":{"keywords":["bank","engagement","hooker","bank robbery","black comedy","urination","flashback","fired from the job","bare breasts","con","faked death","female nudity","wig","watch","scene during end credits","ring","polaroid","molotov cocktail","match","loan","lesbian kiss","housekeeper","gay","disguise","bus","burn","bullet proof vest","stripper","shot in the head","shot in the chest","pistol whip","person on fire","hit by a bus","greed","double cross","death","car accident","burnt face","betrayal","bad luck","racial slur","ethnic slur","title appears in writing","dream sequence","555 phone number","strip club","lesbian","hotel room","gun","dentist","coroner","burned","bank vault","gay interest","title spoken by character","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:21:37"}}