{"data":{"movies":[{"title":"A Walk Among the Tombstones","originalTitle":"","year":"2014","releaseDate":"20140919","directors":[{"name":"Scott Frank","id":"nm0291082"}],"writers":[{"name":"Lawrence Block","id":"nm0088747"},{"name":"Scott Frank","id":"nm0291082"}],"runtime":"114 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NzY2MTg1M15BMl5BanBnXkFtZTgwODY2Njk4MTE@._V1.jpg","countries":["USA"],"languages":["English","Spanish","Urdu","Russian"],"genres":["Crime","Drama","Mystery","Thriller"],"plot":"Matt Scudder is a former cop now a private eye. He is asked by a drug dealer to find the men who kidnapped his wife. It seems like they killed her even after he paid them. Scudder refuses. But the man later goes to see him and tells him how his wife was killed. Scudder takes the job. He does some research and thinks the men he is looking for have done this more than once. And that everyone they grabbed is connected to a drug dealer. He was about to give up when they grab another girl and Scudder tries make sure she's returned alive.","simplePlot":"Private investigator Matthew Scudder is hired by a drug kingpin to find out who kidnapped and murdered his wife.","actors":[{"actorName":"Liam Neeson","urlProfile":"http://www.imdb.com/name/nm0000553","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MTQ3NzU1MV5BMl5BanBnXkFtZTgwMDE3Mjg0MzE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1952","placeOfBirth":" Ballymena, Co. Antrim, Northern Ireland, UK","birthName":"William John Neeson","height":"6' 4\" (1.93 m)","bio":"Liam Neeson was born on June 7, 1952 in Ballymena, Northern Ireland, UK, to Katherine (Brown), a cook, and Bernard Neeson, a school caretaker. Liam worked as a forklift operator for Guinness, truck driver, assistant architect and an amateur boxer. He had originally sought a career as a teacher by attending St. Mary's Teaching College, Newcastle. However, in 1976, Neeson joined the Belfast Lyric Players' Theater and made his professional acting debut in the play \"The Risen People\". After two years, Neeson moved to Dublin's Abbey Theater where he performed the classics. It was here that he was spotted by director John Boorman and was cast in the film Excalibur (1981) as Sir Gawain, his first high-profile film role. Through the 1980s Neeson appeared in a handful of films and British TV series - including The Bounty (1984), A Woman of Substance (1984), The Mission (1986), and Duet for One (1986) - but it was not until he moved to Hollywood to pursue larger roles that he began to get noticed. His turn as a mute homeless man in Suspect (1987) garnered good reviews, as did supporting roles in The Good Mother (1988) and High Spirits (1988) - though he also starred in the best-to-be-forgotten Satisfaction (1988), which also featured a then-unknown Julia Roberts - but leading man status eluded him until the cult favorite Darkman (1990), directed by Sam Raimi. From there, Neeson starred in Under Suspicion (1991) and Ethan Frome (1993), was hailed for his performance in Woody Allen's Husbands and Wives (1992), and ultimately was picked by Steven Spielberg to play Oskar Schindler in Schindler's List (1993). The starring role in the Oscar-winning Holocaust film brought Neeson Academy Award, BAFTA and Golden Globe nominations for Best Actor. Also in 1993, he made his Broadway debut with a Tony-nominated performance in \"Anna Christie\", in which he co-starred with his future wife Natasha Richardson. The next year, the two also starred opposite Jodie Foster in the movie Nell (1994), and were married in July of that year. Leading roles as the 18th century Scottish Highlander Rob Roy (1995) and the Irish revolutionary leader Michael Collins (1996) followed, and soon Neeson was solidified as one of Hollywood's top leading men. He starred in the highly-anticipated Star Wars: Episode I - The Phantom Menace (1999) as Qui-Gon Jinn, received a Golden Globe nomination for Kinsey (2004), played the mysterious Ducard in Christopher Nolan's Batman Begins (2005), and provided the voice for Aslan in The Chronicles of Narnia: The Lion, the Witch and the Wardrobe (2005). Neeson found a second surprise career as an action leading man with the release of Taken (2008) in early 2009, an unexpected box office hit about a retired CIA agent attempting to rescue his daughter from being sold into prostitution. However, less than two months after the release of the film, tragedy struck when Richardson suffered a fatal head injury while skiing and passed away days afterward. Neeson returned to high-profile roles in 2010 with two back-to-back big-budget films, Clash of the Titans (2010) and The A-Team (2010), and returned to the action genre with Unknown (2011), The Grey (2011), Battleship (2012) and Taken 2 (2012), as well as the sequel La colère des Titans (2012). Neeson was awarded Officer of the Order of the British Empire in the 1999 Queen's New Year's Honours List for his services to drama. He has two sons from his marriage to Richardson: Micheal Richard Antonio Neeson (born June 22, 1995) and Daniel Jack Neeson (born August 27, 1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MTQ3NzU1MV5BMl5BanBnXkFtZTgwMDE3Mjg0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000553","name":"Liam Neeson","idIMDB":"nm0000553"},"actorId":"nm0000553","character":"Matt Scudder","urlCharacter":"http://www.imdb.com/character/ch0305538","main":true},{"actorName":"Maurice Compte","urlProfile":"http://www.imdb.com/name/nm0173997","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMzY4NTMwNF5BMl5BanBnXkFtZTgwMTMzMzk2NjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Maurice Compte is an actor and director, known for A Walk Among the Tombstones (2014), End of Watch (2012) and All the Real Girls (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMzY4NTMwNF5BMl5BanBnXkFtZTgwMTMzMzk2NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0173997","name":"Maurice Compte","idIMDB":"nm0173997"},"actorId":"nm0173997","character":"Danny Ortiz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patrick McDade","urlProfile":"http://www.imdb.com/name/nm0567370","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY5NDM0NDAyNl5BMl5BanBnXkFtZTgwMjgzOTkzOTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1951","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"6' (1.83 m)","bio":"Patrick McDade was born on September 11, 1951 in Philadelphia, Pennsylvania, USA. He is an actor and executive, known for Silver Linings Playbook (2012), The Sixth Sense (1999) and A Walk Among the Tombstones (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY5NDM0NDAyNl5BMl5BanBnXkFtZTgwMjgzOTkzOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0567370","name":"Patrick McDade","idIMDB":"nm0567370"},"actorId":"nm0567370","character":"Bar Owner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Luciano Acuna Jr.","urlProfile":"http://www.imdb.com/name/nm5729373","urlPhoto":"","biography":{"height":"5' 11\" (1.8 m)","bio":"Luciano Acuna Jr. is known for his work on A Walk Among the Tombstones (2014), Teenage Mutant Ninja Turtles (2014) and Jason Bourne (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5729373","name":"Luciano Acuna Jr.","idIMDB":"nm5729373"},"actorId":"nm5729373","character":"Dominican Banger #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hans Marrero","urlProfile":"http://www.imdb.com/name/nm3450086","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwNjg5NjYxMV5BMl5BanBnXkFtZTgwNDY1Mzc0MjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Born in 1985 in Beaufort, South Carolina, Marrero's upbringing was defined by discipline and structure. Son of Dr. Myra Ancheta (United States Marine Corps Retired), former Marine Corps and Naval Officer, and Hans Marrero Sr. (United States Marine Corps Retired). Young Marrero was introduced to the world of disciplined martial arts at the early age of four. As his father was the Chief Instructor of hand-to-hand combat at Paris Island, Hans Jr. was quick to soak in the skills and combative intricacies of the family practice. Carrying on the legacy, Marrero went on to discover and train various forms of martial arts around the world including Kobushi-Sessen Jutsu, Shorinji-Kempo, Kyo Kushin, Kai-Kan, Aikido, Judo, Matsukazi-Ryu and Brazilian (Jiu-Jitsu). Eventually landing in Arizona, Han s became intrigued with a new sport just beginning to make it's way from the underground scene, Mixed Martial Arts. While attending college, Marrero decided to test his skills in the cage and, at 18 years old, his professional fighting career began. Headlining venues in various US states and other countries for 7 years Hans fought his way to a professional 13-3 kickboxing, 9-4 boxing, 26-8 MMA record. As an extremely well-rounded competitor, he gained plenty of attention in the fight world with his signature form of submission to quickly end most opponents; the Armbar. Using his experience and knowledge for even greater good, from 2003 to 2006 Hans also became senior instructor for the Police Combative Training Academy where he taught close quarter battle to law enforcement and military personnel. In addition, he also dedicated time to coaching a competitive mixed martial arts team. Realizing much success in the combat sports industry, Hans decided to apply his past experiences and physical abilities to follow his dream in film. Packing his bags and moving to New York, Marrero found a way to put his natural charm and charisma behind cameras. With his extensive Martial Arts experience and background, Marrero's acting career began with Lionsgate's sports drama, Warrior where he played MMA fighter Diego Santana, opponent to Tommy Conlon, played by Tom Hardy. From then, Marrero went on to land various films and TV shows such as A Walk Among the Tombstones, Person of Interest, Creed, Daredevil, The Blacklist, to name a few. Marrero's career has brought him out of the United States to countries such as China, Indonesia, Thailand and India. As an established performer, Marrero plans to pave his way into action directing and ultimately playing one of the ultimate villains on screen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwNjg5NjYxMV5BMl5BanBnXkFtZTgwNDY1Mzc0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3450086","name":"Hans Marrero","idIMDB":"nm3450086"},"actorId":"nm3450086","character":"Dominican Banger #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Laura Birn","urlProfile":"http://www.imdb.com/name/nm1285342","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNzg3NjY2MV5BMl5BanBnXkFtZTgwMzk3NjMzMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1981","placeOfBirth":" Helsinki, Finland","birthName":"Laura Eveliina Birn","height":"5' 6¼\" (1.68 m)","bio":"Laura Birn was born on April 25, 1981 in Helsinki, Finland as Laura Eveliina Birn. She is an actress, known for A Walk Among the Tombstones (2014), Purge (2012) and Heart of a Lion (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNzg3NjY2MV5BMl5BanBnXkFtZTgwMzk3NjMzMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1285342","name":"Laura Birn","idIMDB":"nm1285342"},"actorId":"nm1285342","character":"Leila Alvarez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Harbour","urlProfile":"http://www.imdb.com/name/nm1092086","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MDkxMTY2N15BMl5BanBnXkFtZTcwNTcxMjAyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1975","placeOfBirth":" New York, USA","height":"6' 2¾\" (1.9 m)","bio":"David Harbour is an American actor who has performed in film, television, and the theater. He is known for his role as CIA agent Gregg Beam in Quantum of Solace (2008), Shep Campbell in Revolutionary Road (2008), Van Hauser in End of Watch (2012) and Dexter Tolliver in Suicide Squad (2016). He also plays Chief Jim Hopper on the Netflix original series, Stranger Things (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MDkxMTY2N15BMl5BanBnXkFtZTcwNTcxMjAyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1092086","name":"David Harbour","idIMDB":"nm1092086"},"actorId":"nm1092086","character":"Ray","urlCharacter":"http://www.imdb.com/character/ch0495781","main":true},{"actorName":"Adam David Thompson","urlProfile":"http://www.imdb.com/name/nm4311436","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NjU0NDMzM15BMl5BanBnXkFtZTgwMzU1NzYzOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Adam David Thompson is an actor, known for A Walk Among the Tombstones (2014), Martha Marcy May Marlene (2011) and +1 (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NjU0NDMzM15BMl5BanBnXkFtZTgwMzU1NzYzOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4311436","name":"Adam David Thompson","idIMDB":"nm4311436"},"actorId":"nm4311436","character":"Albert","urlCharacter":"http://www.imdb.com/character/ch0495782","main":true},{"actorName":"Boyd Holbrook","urlProfile":"http://www.imdb.com/name/nm2933542","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NTIwMTE5M15BMl5BanBnXkFtZTcwODUxODgwNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 September 1981","placeOfBirth":" Prestonsburg, Kentucky, USA","birthName":"Robert Boyd Holbrook","height":"6' 2\" (1.88 m)","bio":"Boyd Holbrook is an American actor and fashion model. He has appeared in films such as Milk (2008), Out of the Furnace (2013), Gone Girl (2014), A Walk Among the Tombstones (2014), Run All Night (2015) and in the Netflix series Narcos. In 2007 Holbrook sent a screenplay to director Gus Van Sant, who was impressed enough to give him the role of Denton Smith for the movie Milk (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NTIwMTE5M15BMl5BanBnXkFtZTcwODUxODgwNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2933542","name":"Boyd Holbrook","idIMDB":"nm2933542"},"actorId":"nm2933542","character":"Peter Kristo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kim Rosen","urlProfile":"http://www.imdb.com/name/nm4611976","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MzA1MjgxOF5BMl5BanBnXkFtZTgwNDEwMTI3OTE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"Kim Rosen is an actress, writer, and editor. Kim holds a BFA from NYU's Tisch School of the Arts, and has also trained at ImprovBoston, The School of Visual Arts, and the Upright Citizens Brigade Theater. Kim is originally from Newton, Massachusetts just like a large number of other superb entertainment industry professionals.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MzA1MjgxOF5BMl5BanBnXkFtZTgwNDEwMTI3OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4611976","name":"Kim Rosen","idIMDB":"nm4611976"},"actorId":"nm4611976","character":"Waitress - Jenny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dan Stevens","urlProfile":"http://www.imdb.com/name/nm1405398","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NTY5OTI2MF5BMl5BanBnXkFtZTgwNDkzMzIxMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1982","placeOfBirth":" Croydon, Surrey, England, UK","birthName":"Daniel Jonathan Stevens","height":"6' (1.83 m)","bio":"Dan Stevens was born at Croydon in Surrey on 10th October 1982. His parents are teachers. He was educated at Tonbridge School and trained in acting at the National Youth Theatre of Great Britain. He studied English Literature at Emmanuel College, Cambridge. Whilst he was a Cambridge undergraduate, he acted in several student drama productions. He played the title role in the Marlowe Dramatic Society's production of William Shakespeare's play, \"Macbeth\". This was staged at the Cambridge Arts Theatre from Tuesday 26th February to Saturday 2nd March 2002. The cast also featured Rebecca Hall in the roles of Lady Macbeth and Hecate. During one of his university summer holidays in August 2003 he went to Slovakia where he filmed his scenes for the Hallmark production of Frankenstein (2004). Dan played the part of Henry Clerval and the mini-series was first broadcast on American television on 5th October 2004. Shortly after graduating from Cambridge Dan was nominated for an Ian Charleson award for his performance as Orlando in \"As You Like It\" at the Rose Theatre at Kingston in Surrey. \"As You Like It\" was directed by Peter Hall and ran from 30th November to 18th December 2004. This production for the Peter Hall Company subsequently went on a tour of America in the early months of 2005, playing at the Ahmanson Theatre in Los Angeles, the Curran Theater in San Francisco and the Harvey Theater at the Brooklyn Academy of Music in New York City. It featured Rebecca Hall in the role of Rosalind. Dan was reunited with the director Peter Hall when he played Claudio in a new production of the Shakespeare play, \"Much ado about Nothing\", for the Peter Hall Company at the Theatre Royal in Bath from 29th June to 6th August 2005. In February 2006 Dan played the parts of Marban and Maitland in a revival of Howard Brenton's controversial play, \"The Romans in Britain\", directed by Samuel West at the Crucible Theatre in Sheffield. Then in May 2006 he played Nick Guest, the protagonist in The Line of Beauty (2006). This three part television mini-series was adapted by Andrew Davies from the 2004 Booker prize winning novel by Alan Hollinghurst. The Line of Beauty (2006) is about Nick Guest's relationship with his university friend Toby Fedden. The story takes place in the 1980s. It is set against the backdrop of Margaret Thatcher's free market economic policies and the spread of the acquired immunity deficiency syndrome, (AIDS). These two social developments directly affect the characters in the story because Toby's father Gerald is a Conservative member of parliament and Nick is homosexual. Whilst The Line of Beauty (2006) was being broadcast on BBC television, Dan was appearing as Simon Bliss in the Noël Coward play, \"Hay Fever\". This play was staged at the Theatre Royal Haymarket in London from 11th April to 5th August 2006 and the cast also included Judi Dench in the role of Judith Bliss. At the end of the year Dan played Lord Holmwood in a television dramatization of Dracula (2006), which was broadcast on 28th December 2006. In 2007 Dan played the part of Michael Faber in Agatha Christie's Marple: Miss Marple: Nemesis (2007), an Agatha Christie adaptation with Geraldine McEwan in the role of Miss Jane Marple. He also featured in the cast of Maxwell (2007), a television drama about the famous newspaper magnate. Maxwell (2007) was first broadcast on British television on 4th May 2007. David Suchet played Robert Maxwell, and Dan took the part of Basil Brookes, one of the press baron's financial directors. Dan played the part of Edward Ferrars in a television dramatization of Jane Austen's novel, Sense & Sensibility (2008). This was broadcast in three episodes on BBC1 between Tuesday 1st and Sunday 13th January 2008. The novel was adapted for television by Andrew Davies, whom Dan had previously worked with on The Line of Beauty (2006). Davies felt that the part of Edward Ferrars was underdeveloped in the book, and so he deliberately added scenes not included in the novel to help draw out the character. So, for instance, we saw Edward out horse riding on the Norland estate and chopping logs at Barton Cottage. In the DVD audio commentary Dan joked that this was the best example of log chopping ever seen on British television! After Sense & Sensibility (2008), Dan featured in the cast of \"The Tennis Court\", a BBC Radio 4 Saturday play broadcast on 19th January 2008. He also played Nicky Lancaster in a revival of the Noël Coward play, \"The Vortex\", at the Apollo Theatre in London from Wednesday 20th February to Saturday 7th June 2008. This was another collaboration with the stage director, Peter Hall. Dan played the eponymous hero of \"Dickens Confidential\", a six part radio drama series set in the 1830s which imagines what might have happened if Charles Dickens had continued his career as a journalist. This was broadcast on BBC Radio 4 between Monday 9th June and Monday 14th July 2008. He played the part of Peregrine in 'Orley Farm', the BBC Radio 4 Classic Serial. This was a three part adaptation of the novel by Anthony Trollope broadcast between Sunday 28th December 2008 and Sunday 11th January 2009. A month later he played Duval in the BBC Radio 4 Woman's Hour drama, 'The Lady of the Camellias'. This was broadcast between Monday 2nd and Friday 6th February 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NTY5OTI2MF5BMl5BanBnXkFtZTgwNDkzMzIxMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1405398","name":"Dan Stevens","idIMDB":"nm1405398"},"actorId":"nm1405398","character":"Kenny Kristo","urlCharacter":"http://www.imdb.com/character/ch0495780","main":true},{"actorName":"Eric Nelsen","urlProfile":"http://www.imdb.com/name/nm2235173","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1OTUyMDk4MV5BMl5BanBnXkFtZTgwOTgwMzMzMDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 June 1991","placeOfBirth":" West Palm Beach, Florida, USA","bio":"Eric Nelsen was born on June 26, 1991 in West Palm Beach, Florida, USA. He is an actor and producer, known for A Walk Among the Tombstones (2014), Wakefield (2016) and Coming Through the Rye (2015). He has been married to Sainty Nelsen since November 29, 2013.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1OTUyMDk4MV5BMl5BanBnXkFtZTgwOTgwMzMzMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2235173","name":"Eric Nelsen","idIMDB":"nm2235173"},"actorId":"nm2235173","character":"Howie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jon Goracy","urlProfile":"http://www.imdb.com/name/nm2455423","urlPhoto":"","biography":{"bio":"Jon Goracy is known for his work on Lincoln (2012), The Night Of (2016) and Carrie (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2455423","name":"Jon Goracy","idIMDB":"nm2455423"},"actorId":"nm2455423","character":"Bag Boy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Razane Jammal","urlProfile":"http://www.imdb.com/name/nm3943919","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxODkzNTE1MV5BMl5BanBnXkFtZTgwNjM1MzY0OTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Razane Jammal began her acting at the age of 6 under the tutorship of Mme Choghig and Nagy Souraty. Her natural born talent was noticed and she was cast in practically every production at school and continued equally throughout her high school years. At the age of 15, Razane was scouted into the modeling world and her professional life spiraled and she was much in demand. She maintained focus on her studies and commendably managed to juggle between studying for her French Baccalaureat while working part-time as a model, traveling all around the Middle-East for big brand TV commercials such as Nivea, Lux, Showtime, Du, Maymouna, Mtc touch, Cadbury and many more. At the age of 18, she moved to London to continue her studies and enrolled for business management degree at the prestigious Kings College. Although intensively engrossed in obtaining a postgraduate degree which she completed with Honours, Razane never lost sight of what she really wanted, to become an actress. Every summer, she enrolled in demanding acting workshops such as the 'Cours Florent' in Paris, The 'RADA' in London and the 'NYFA' in New York. She also joined MOT modelling agency followed by BMA, which allowed her modelling career to take off again, this time in London. She was featured on many covers of local magazines and filmed numerous commercials. In 2009, she was cast in her first feature film role in, 'Carlos', directed by Olivier Assayas. After completing the film and finishing with her business management degree, she directed her full time attention to her acting training and joined the Actor's Temple in London with Gary Condez, where she trained in the Meisner Technique. In 2010, her career progression led her to move to Los Angeles to gain further acting training and widen her network. In 2011, she was cast as the lead role in the feature film, \"Djinn\" directed by Toby Hooper (Texas Chain Saw Massacre). The film was shot in Dubai and was released at the Abu Dhabi Film Festival in 2013. She was then cast in a supporting role in her third feature film,\"Flying Blind\", released in 2012 across Europe. Noticing her acting credits lacked comedy listing in 2012; Razane actively devised, wrote, produced and played the lead role of a light web comedy, \"Giselle\" (a Lebanese bimbo). This experience led her to be cast in the role of Joyce (Ditsy Secretary) in the web series \"Mamnou3\" (2012), and afterwards \"Mimi the mermaid\" (Hipster Mermaid). Razane was also cast as the queen in Kanye West's short film/art installation \"Cruel Summer\". In late 2012, Razane re-located to New York adding another base platform to her acting career. In 2013 she completed a movie with Scott Frank, \"A walk among the tombstones\", starring Liam Neeson and Dan Stevens. The movie is set to be released in September 2013. From February to June 2014, Razane re-located to Egypt to film an Egyptian Tv-series \"Emratoreyet Meen\" starring Hind Sabry. The show was aired during the month of Ramandan, July 2014. Having completed her work in Egypt, Razane then moved to France for the summer to film a movie with Robert Guediguian. The last part of the film is set to be filmed in Beirut in September 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxODkzNTE1MV5BMl5BanBnXkFtZTgwNjM1MzY0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3943919","name":"Razane Jammal","idIMDB":"nm3943919"},"actorId":"nm3943919","character":"Carrie Kristo","urlCharacter":"http://www.imdb.com/character/ch0495783","main":true},{"actorName":"Stephanie Andujar","urlProfile":"http://www.imdb.com/name/nm2837910","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDcxODQ4YTMtMTUwZC00NGFmLTk0YzUtN2MxY2NhODhkODEwL2ltYWdlXkEyXkFqcGdeQXVyMTYwOTc0NDI@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1986","placeOfBirth":" New York City, New York, USA","birthName":"Stephanie Lee Andujar","height":"5' 5\" (1.65 m)","bio":"Stephanie Andujar was born and raised in New York City. Even though Manhattan was the playground for her sister, younger brother and herself, Stephanie's parents put her into an after school program that would change the course of her life... Starring in theatre performances from 'The Wiz,' 'The Crucible,' 'The Good Woman of Setzuan,' to Television and Film including: 'Law & Order:SVU', the Academy Award winning film 'Precious', 'See Girl Run', NBC Nurse Drama 'Mercy' ...All while obtaining her Business Degree at Pace University in NYC. Stephanie's standout performance can be seen in Season 2 of 'Orange is the New Black,' as the Young Miss Rosa. \"Stephanie Andujar, who plays Young Rosa, is mesmerizing, and I want her to star in a prequel spinoff called Portrait of the Prisoner as a Young Bank Robber\" -Entertainment Weekly, Hillary Busis. In 2016 Stephanie Andujar created Andujar Productions with her family. Stephanie is executive producer, writer, & director on her upcoming comedy series \"StephA: One Woman Show.\" Along with her family, Stephanie put out a hit single \"Come Dance With Me Baila Conmigo, written by Stephanie, her mother Carmen,and produced by her brother Hector Andujar Jr. with the concept by her sister Melanie. Andujar continues to embody the spirit of each and every character she plays.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDcxODQ4YTMtMTUwZC00NGFmLTk0YzUtN2MxY2NhODhkODEwL2ltYWdlXkEyXkFqcGdeQXVyMTYwOTc0NDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2837910","name":"Stephanie Andujar","idIMDB":"nm2837910"},"actorId":"nm2837910","character":"Cashier","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0365907","urlIMDB":"http://www.imdb.com/title/tt0365907","business":{"budget":{"money":"$28,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$26,307,600","country":"USA","day":"23","month":"10","year":"2014","remarks":""}],"weekendGross":[{"money":"$4,192,785","country":"USA","day":"28","month":"09","year":"2014","remarks":"2,714 Screens"}],"admissions":[{"money":"87,821","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"(C) 2013 Tombstones Movie Holdings, LLC. All Rights Reserved."},"technical":{"runtime":["1 hr 54 min (114 min)"],"soundMix":["Datasat","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa Plus 4:3, Panavision Primo, B-, C--Series and Ultra Speed MKII Lenses","Red Epic, Panavision Primo and Ultra Speed MKII Lenses"],"laboratory":["Technicolor PostWorks, New York (NY), USA (digital intermediate)"],"filmLength":["3,132.1 m (6 reels)"],"negativeFormat":["Redcode RAW","SxS Pro"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Panavision (anamorphic) (source format)","ProRes 4:4:4 (2K) (source format)","Redcode RAW (5K) (source format) (some scenes)"],"printedFilmFormat":["35 mm (Kodak Vision 2383)","D-Cinema"]},"rating":"6.5","metascore":"57","filmingLocations":[{"location":"Green-Wood Cemetery, Brooklyn, New York City, New York, USA"}],"rated":"R","awards":[],"votes":"93,028","type":"Movie","companyCreditsSimple":[{"idCompany":"co0340618","name":"1984 Private Defense Contractors"},{"idCompany":"co0285648","name":"Cross Creek Pictures"},{"idCompany":"co0455577","name":"Da Vinci Media Ventures"}],"keywords":{"keywords":["drug dealer","violence","murder of wife","ex cop","revenge","alcoholic","kidnapping of wife","brooklyn new york city","psychopath","groundskeeper","ransom","body in a trunk","dismemberment","bound and gagged","death of wife","alcoholics anonymous","flashback","murder","investigation","private detective","new york city","written by director","based on novel","dea","suitcase of money","child with a gun","bag of money","tasered","innocent bystander","collateral damage","holding a handgun sideways","kicked in the head","cutting off breasts","clothes cut off","jumping to death","dental gag","sketch","twenty dollar bill","snuf audio","sound recording","mutilation","drug trafficker","duct tape gag","close up of eye","awakened by a phone","shoot out","climbing out a window","topless female nudity","female frontal nudity","blood splatter","stun gun","switchblade","faked death","mercy killing","electrocution","serial killer","counterfeit","homelessness","thug","gay slur","translator","torture","laundromat","character's point of view camera shot","subjective camera","character says i love you","tattoo","italian","mother daughter relationship","telephone","home invasion","brooklyn bridge","death of brother","father daughter relationship","psychological thriller","snuff film","loner","artist","painter","newspaper clipping","mentor","newspaper headline","hit with a hammer","blood","threatened with a knife","knife","rooftop","walkie talkie","machine gun","ex soldier","suspense","revolver","sniper","orphan","stalking","gulf war veteran","painting","nurse","held at gunpoint","brawl","fistfight","montage","basement","meat cleaver","deception","drug smuggler","abandoned apartment","money","hostage","rapist","attempted rape","rape","black eye","sadist","duct tape over mouth","taxi","cigarette smoking","waitress","f word","ethnic slur","racial slur","strangulation","redemption","dark hero","tough guy","anti hero","innocent person killed","accidental killing","police shootout","street shootout","falling down stairs","police chase","foot chase","1990s","shot through a window","shot in the back","neo noir","loneliness","urban setting","greenwood brooklyn new york city","sadism","husband wife relationship","death","wheelchair","apartment building","photograph","stabbed in the shoulder","stabbed to death","handcuffed to a pipe","butcher knife","dea agent","dripping blood","severed finger","sniper rifle","freeze frame","bulletproof vest","shot in the side","taser","cell phone","strangled to death","garrote","child in peril","unsubtitled foreign language","hit with a baseball bat","beating","kicked in the face","punched in the face","brother brother relationship","army veteran","drug addict","drawing","hospital","sickle cell anemia","being followed","body landing on a car","falling to death","tape recorder","suicide","severed leg","body in a dumpster","cemetery","van","slow motion scene","handcuffs","reference to sam spade","nude painting","homeless teenager","character repeating someone else's dialogue","corpse","pay phone","kidnapping","reformed alcoholic","alcoholism","bloody body of child","shot in the eye","shot in the leg","shootout","car crash","shot in the head","shot to death","shot in the chest","pistol","year 1999","year 1991","scene during opening credits","death of child","independent film","counterfeit currency","newspaper photograph","rum and coke","reading newspaper","close up of bare feet","sleeping on a sofa","y2k","urination","el train","convenience store","bartender","bird cage","dog","diner","library","breaking a mirror","reference to y2k","rain","bar"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:42:45"}}