{"data":{"movies":[{"title":"Gang of Roses","originalTitle":"","year":"2003","releaseDate":"20031010","directors":[{"name":"Jean-Claude La Marre","id":"nm0478713"}],"writers":[{"name":"Jean-Claude La Marre","id":"nm0478713"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4OTYzMjYwMl5BMl5BanBnXkFtZTcwNzg4NjQyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Drama","Western"],"plot":"All all-female gang of Old West bank robbers comes out of retirement to rescue a sister in peril.","simplePlot":"All all-female gang of Old West bank robbers comes out of retirement to rescue a sister in peril.","actors":[{"actorName":"Monica Calhoun","urlProfile":"http://www.imdb.com/name/nm0004793","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MjI5NzQ5Nl5BMl5BanBnXkFtZTcwNTU3OTI4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1971","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"5' 1\" (1.55 m)","bio":"Monica Calhoun was born on July 29, 1971 in Philadelphia, Pennsylvania, USA. She is an actress and producer, known for The Best Man Holiday (2013), Bagdad Cafe (1987) and The Best Man (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MjI5NzQ5Nl5BMl5BanBnXkFtZTcwNTU3OTI4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004793","name":"Monica Calhoun","idIMDB":"nm0004793"},"actorId":"nm0004793","character":"Rachel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lil' Kim","urlProfile":"http://www.imdb.com/name/nm0428591","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY2NDA5ODE1NV5BMl5BanBnXkFtZTcwOTk3NTk2MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1974","placeOfBirth":" Bedford-Stuyvesant, Brooklyn, New York City, New York, USA","birthName":"Kimberly Denise Jones","height":"4' 11\" (1.5 m)","bio":"Kimberly Denise Jones, was born on July 11, 1974, to parents Linwood Jones and Ruby Mae. She is of Native American and African American descent. Standing just 4 feet 11 inches tall Kimberly Jones seems much less than being just your average girl in the hood, but when \"Lil' Kim\" was introduced to the world she became known for her provocative over-the-top outfits, glamorous blonde hair-dos, pornographic attitude, sexy man-crazed looks, and a groundbreaking triumph that eventually secured her place as one of the few female rappers in a male-dominated industry. A native of Brooklyn, New York, Kimberly was born into a broken home, by age 9 her parents had filed for divorce, leaving her and older brother Christopher under the custody of their father. A rebellious child living under the strict rules of her dad, Kimberly and her father had constant fights, and eventually she ran away from home. As a teenager she lived with friends, drug-dealing boyfriends, and, occasionally, on the streets. After meeting her mentor and life saver Christopher Wallace, (Notorious B.I.G/Biggie Smalls), she began to clean up her life and it was Christopher who helped her develop a career in music. By then Kimberly had taken in the slogan \"Lil' Kim\" after her height and curbing her name to just Kim. With the help of Christopher she became the only female member of the short lived rap group Junior M.A.F.I.A. Their 1995 debut album Conspiracy debuted at #8 on the Billboard Hot 100 and garnered the hit singles \"Player's Anthem\" (#13) and \"Get Money\" (#17). Following the release, Lil' Kim appeared on records by Mona Lisa, the Isley Brothers, Total, and Skin Deep. And it was obvious that it was time for her to come out with her own solo album, and that's just what she did in 1996, with the release of \"Hard Core\". Lil' Kim's marketing campaign for the album was quite challenging - she was dressed in a skimpy bikini and furs in advertisements, as well as the album covers - but instead of resulting in criticism, the album became a hit, debuting at # 11 on the pop charts. The first single from the album, \"No Time\" a duet with Sean \"Puffy\" Combs, became a #1 rap single and #20 on the pop charts. A top ten single followed with \"Not Tonight\" (#6). But while Lil Kim's career was blossoming, her life was shattered along with the music world when her father like figure Notorious B.I.G. was murdered on March 9, 1997. Following that incident, Lil' Kim took a hiatus from recording her own music, but she still kept busy with a string of other projects. She was one of the featured performers of Puff Daddy's highly successful 1998 \"Bad Boy Tour\", and built her own business with the launch of Queen Bee Records, with Lil' Kim herself as CEO. Her long-awaited \"Notorious K.I.M.\" was released in the summer of 2000 under the Queen Bee record label and debuted at #1 on the Billboard R&B/Hip-Hop Charts. By then, she had lost weight but still kept the sexual techniques and provocative antics coming for fans that were hungry for more. She had also taken a shift into films debuting in the 1999 teen flick \"She's All That\" and playing Tina Parker in the 2002 comedy \"Juwanna Man\". In 2001 Lil Kim gained her first #1 hit on the Billboard Hot 100 in a remake of Patti Labelle's hit \"Lady Marmalade\" that collaborated her with singers Mya, Pink, and Christina Aguilera, the success awarded them a Grammy in 2002 for Best Pop Collaboration. Her third full-length album \"La Bella Mafia\" was released in 2003 debuting at #5 on the pop charts and earned her two more hits with \"The Jump Off\" (#17) and \"Magic Stick/feat.50Cent\" that shot to #2. Her album The Naked Truth released in September 2005 debuted at No. 6 on Billboard's Top 200 Album's chart and sold 109,000 copies during the first week of its release.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY2NDA5ODE1NV5BMl5BanBnXkFtZTcwOTk3NTk2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0428591","name":"Lil' Kim","nicknames":["Queen Bee"],"idIMDB":"nm0428591"},"actorId":"nm0428591","character":"Chastity","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stacey Dash","urlProfile":"http://www.imdb.com/name/nm0001107","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTMwNzY2MTQ4Ml5BMl5BanBnXkFtZTgwMzQ3NTgyMTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 January 1967","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"Stacey Lauretta Dash","height":"5' 5\" (1.65 m)","bio":"Stacey Dash was born in the Bronx, New York. Stacy knew that she wanted to act, and from an early age began to act professionally. She made regular appearances on The Cosby Show (1984), The Fresh Prince of Bel-Air (1990), and also St. Elsewhere (1982). At 21 she made her feature film debut in Enemy Territory (1987), which was quickly followed by Moving (1988), in which she played Richard Pryor's teenage daughter. Four years later she was in Mo' Money (1992), with Damon Wayans. In 1994 she starred with Mark Wahlberg in Renaissance Man (1994). In 1995 she did the provocative erotic thriller Illegal in Blue (1995) and later that year got her big break when was cast as Dionne in the hit comedy Clueless (1995). She went on to star in the UPN sitcom Clueless (1996) that was based on the movie, and which lasted for two years. During that time she completed Oliver Stone's Cold Around the Heart (1997) and also the independent film Personals (1999). After leaving \"Clueless\" in 1999, Stacey seems to be moving along nicely. She has recently appeared in The Painting (2001) and Paper Soldiers (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTMwNzY2MTQ4Ml5BMl5BanBnXkFtZTgwMzQ3NTgyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001107","name":"Stacey Dash","idIMDB":"nm0001107"},"actorId":"nm0001107","character":"Kim","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marie Matiko","urlProfile":"http://www.imdb.com/name/nm0559069","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2Nzk1NDExMl5BMl5BanBnXkFtZTcwOTA0MjUzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1970","placeOfBirth":" Los Angeles County, California, USA","birthName":"Marie Bernadette Gulmatico","height":"6' (1.83 m)","bio":"Marie Matiko was born on June 29, 1970 in Los Angeles County, California, USA as Marie Bernadette Gulmatico. She is an actress, known for The Art of War (2000), Date Movie (2006) and The Civilization of Maxwell Bright (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2Nzk1NDExMl5BMl5BanBnXkFtZTcwOTA0MjUzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0559069","name":"Marie Matiko","idIMDB":"nm0559069"},"actorId":"nm0559069","character":"Zang Li","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"LisaRaye McCoy","urlProfile":"http://www.imdb.com/name/nm0513964","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU4NTcxMTExNF5BMl5BanBnXkFtZTYwNjUyNTg1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 September 1966","placeOfBirth":" Chicago, Illinois, USA","height":"5' 6½\" (1.69 m)","bio":"LisaRaye McCoy-Misick was born September 23, 1966 in Chicago, Illinois. She is of African American and Native American descent and is proud of her heritage. She later attended Eastern Illinois University but she never really took the idea of a career in acting seriously until persuaded by an insistent roommate to attend a local audition in Chicago. Her screen debut was in the low-budget action movie Reasons (1996), she received numerous critical kudos despite the fact that the film went largely unseen. LisaRaye is known for possessing a charmingly seductive smile and a distinctively vibrant but laid-back personality. She first caught the eye of television viewers with an appearance on the popular television series In the House (1995). Though the movie never did find a distributor, director Monty Ross convinced the budding young actress to move out to L.A. during pilot season, and she soon landed minor roles on such shows as Martin (1992) and In the House (1995). She also made an appearance in rapper Tupac Shakur's final music video, her memorable appearance caught the eye of rapper/actor Ice Cube, which led to her being in the movie The Players Club (1998). Her memorable performance as a troubled stripper left a solid impression on audiences. Her appearances thus far were impressive, but LisaRaye's career truly began to ignite after her appearance in the movie The Wood (1999). In 2000, LisaRaye found her widest audience yet as the host of Source: All Access (2002), a popular series dedicated to exploring hip-hop culture. She quickly gained a loyal following with her winning smile and extensive knowledge of all things hip-hop. As film roles continued to roll in, she came across her biggest role to date in the 2002 film Civil Brand (2002). A harrowing look into life in women's prison, the film took home top awards at both the American Black Film Festival and The Urbanworld Film Festival. Soon following her little sister Da Brat into a career in music, LisaRaye next began collaborating with Benzino to record a song to be featured in the film Redemption (2004). 2003 proved an equally lucrative year for LisaRaye as she prepared for the release of the Barry Levinson comedy Envy (2004), the female-driven Western Guns and Roses (2000), and her new sitcom, All of Us (2003) which was ran from 2003-2007.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU4NTcxMTExNF5BMl5BanBnXkFtZTYwNjUyNTg1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0513964","name":"LisaRaye McCoy","nicknames":["LRaye"],"idIMDB":"nm0513964"},"actorId":"nm0513964","character":"Maria","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Macy Gray","urlProfile":"http://www.imdb.com/name/nm0004975","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjY2NTE5N15BMl5BanBnXkFtZTcwNjY3MDgzMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1967","placeOfBirth":" Canton, Ohio, USA","birthName":"Natalie Renee McIntyre","height":"6' (1.83 m)","bio":"Macy Gray was born on September 6, 1967 in Canton, Ohio, USA as Natalie Renee McIntyre. She was previously married to Tracey Hinds.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjY2NTE5N15BMl5BanBnXkFtZTcwNjY3MDgzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004975","name":"Macy Gray","idIMDB":"nm0004975"},"actorId":"nm0004975","character":"Black Haired Woman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Louis Mandylor","urlProfile":"http://www.imdb.com/name/nm0541909","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkzODQzNjQ3Nl5BMl5BanBnXkFtZTYwMjI4NDky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 September 1966","placeOfBirth":" Melbourne, Victoria, Australia","birthName":"Louis Theodosopoulos","bio":"Recently reprising his role in, my big Fat Greek Wedding 2, the 400 million dollar- grossing history-making comedy sequel, Mandylor's latest movies / Daylights End playing Lance Hendrickson's son in a Post apocalypse zombie infested world/ Mandylor also leads his expendable type crew through a high Octane action drama Titled HUNTED\", Mandylor also teams up with Creig Sheffer in chasing down the exciting Steven Segal in CODE OF HONOR a 2016 NEW RELEASE Sept by Sony. Some of Mandylor 's other credits are numerous hit television shows/ Grace Under Fire, Martial Law, the worldwide-loved Friends, episodes of CSI, Castle & NCSI..Mandylor's production company, has steadily raised the bar for independent filmmaking following the successful production of its first three award-winning feature films. Top HONORS at The AOF film festival not to mention the coveted best drama feature distinction and an array of best picture awards for In the eyes of a Killer. Mandylor has since produced and directed 8 films comprising of world wide sales and awards to accompany. Mandylor's latest film BLACKOUT has opened best seller at RED BOX 2016 and getting high acclaim.. With this momentum, At AFM 2016 Mandylor merged and Launched with Marc Clebanoff to steer a new fully funded and operational world wide sales-production company Odyssey Motion Pictures. With a slate of films set for 2016 and the release of DAYLIGHTD END Louis remains a sought after entity in HOLLYWOOD.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkzODQzNjQ3Nl5BMl5BanBnXkFtZTYwMjI4NDky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0541909","name":"Louis Mandylor","nicknames":["Louie"],"idIMDB":"nm0541909"},"actorId":"nm0541909","character":"Sheriff Shoeshine Michel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bobby Brown","urlProfile":"http://www.imdb.com/name/nm0113140","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NTI4NDY5M15BMl5BanBnXkFtZTcwNzIwMjY0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1969","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Robert Barisford Brown","height":"5' 10\" (1.78 m)","bio":"Bobby Brown was born on February 5, 1969 in Boston, Massachusetts, USA as Robert Barisford Brown. He has been married to Alicia Etheredge since June 18, 2012. They have two children. He was previously married to Whitney Houston.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NTI4NDY5M15BMl5BanBnXkFtZTcwNzIwMjY0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0113140","name":"Bobby Brown","nicknames":["B. Brown","Triple B"],"idIMDB":"nm0113140"},"actorId":"nm0113140","character":"Left Eye Watkins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jacinto Taras Riddick","urlProfile":"http://www.imdb.com/name/nm0725731","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MTc5NTc3OF5BMl5BanBnXkFtZTcwOTQ5MjU0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 August 1965","placeOfBirth":" Norfolk, Virginia, USA","height":"6' (1.83 m)","bio":"Jacinto Taras Riddick was born on August 13, 1965 in Norfolk, Virginia, USA. He is an actor, known for Cop Out (2010), Fresh (1994) and In the Cut (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MTc5NTc3OF5BMl5BanBnXkFtZTcwOTQ5MjU0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0725731","name":"Jacinto Taras Riddick","idIMDB":"nm0725731"},"actorId":"nm0725731","character":"Georgy Simone","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charity Hill","urlProfile":"http://www.imdb.com/name/nm0384118","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDk0OTgwOF5BMl5BanBnXkFtZTYwMjQ5Njky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 March 1975","placeOfBirth":" Fairfield, California, USA","bio":"Charity, a University of Southern California graduate, started her stage career at age 10 in Minneapolis, Minnesota with the world renowned Children's Theater Company. Having done seven consecutive seasons of over 3000 performances of more than 25 different productions at the Guthrie, Penumbra, Mixed Blood, Child's Play, and Children's theaters before the age of 18, Charity is a stage veteran. Her performances encompass everything from Jean Genee's six-hour epic The Screens (currently on file in the New York Film Library), to the Ovation Award-winning hit pop opera, 'Bare'. (voted Best Musical of the year). Charity began her television career with over 15 national commercials under her belt as well as a Miss Teen America title, while also performing with music sensations Prince, M.C. Hammer, and LL Cool J.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDk0OTgwOF5BMl5BanBnXkFtZTYwMjQ5Njky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0384118","name":"Charity Hill","idIMDB":"nm0384118"},"actorId":"nm0384118","character":"Little Suzie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jean-Claude La Marre","urlProfile":"http://www.imdb.com/name/nm0478713","urlPhoto":"","biography":{"bio":"Jean-Claude La Marre is a producer and actor, known for Brothers in Arms (2005), Color of the Cross (2006) and Malcolm X (1992).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0478713","name":"Jean-Claude La Marre","idIMDB":"nm0478713"},"actorId":"nm0478713","character":"Baby Face Malone","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Licia L. Shearer","urlProfile":"http://www.imdb.com/name/nm0790444","urlPhoto":"","biography":{"bio":"Licia L. Shearer is an actress and writer, known for How to Be a Player (1997), Gang of Roses (2003) and Radio Free Albemuth (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0790444","name":"Licia L. Shearer","idIMDB":"nm0790444"},"actorId":"nm0790444","character":"Sally","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Glenn Plummer","urlProfile":"http://www.imdb.com/name/nm0687625","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzgxNTQzNV5BMl5BanBnXkFtZTgwNzE0MzA0ODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1961","placeOfBirth":" Richmond, California, USA","birthName":"Glenn E. Plummer","height":"5' 7½\" (1.71 m)","bio":"On a foundation of talent, unbridled dedication and a passionate mindset, Glenn Plummer has enjoyed a successful acting career that spans almost two decades. He has starred in such feature films as: Saw II (2005), co-starring Donnie Wahlberg, Shawnee Smith, Dina Meyer and Beverley Mitchell; Dennis Hopper's Colors (1988), co-starring Sean Penn, Robert Duvall and Maria Conchita Alonso; Menace II Society (1993), co-starring Samuel L. Jackson, Larenz Tate and Anthony Johnson; Showgirls (1995), co-starring Elizabeth Berkley, Kyle MacLachlan and Gina Gershon; The Salton Sea (2002), co-starring Val Kilmer, Vincent D'Onofrio, Anthony LaPaglia and Luiz Guzman; Poolhall Junkies (2002), co-starring Christopher Walken, Chazz Palminteri and Alison Eastwood and the compelling drama South Central (1992) in the break out role of \"O.G.\" Bobby Johnson, one of Glenn's most memorable performances. It was largely this very moving role that helped solidify Glenn as a staple in the African-American film community. Experiencing much crossover success, Glenn took his abilities to cover a wide range of personas and delved into television. Appearing in such television movies and mini-series as, ABC's The Women of Brewster Place (1989) with Oprah Winfrey, Lynn Whitfield and Cicely Tyson; TNT's Heat Wave (1990), L.A.'s Watt's Riots of 1965, alongside Cicely Tyson, Blair Underwood, James Earl Jones and TNT's Reversible Errors (2004), with William H. Macy, Tom Selleck and Monica Potter, Glenn Plummer generated praise and accolades from critics alike for his performances in Showtime's Ruby's Bucket of Blood (2001), co-starring Angela Bassett, as well as his deep, thought-provoking exhibition in HBO's The Corner (2000), with T.K. Carter and Khandi Alexander. Before returning to the big screen, Glenn had a re-occurring role as \"Timmy Rawlins\" in the inaugural season of the Emmy/Golden Globes Award-Winning, television show ER (1994) including the 88-minute pilot. Currently, Glenn Plummer's projects include writing, directing (in his directorial debut), producing and starring in the upcoming horror film VooDoo Curse: The Giddeh (2006), co-starring Randy Brooks, Kira Madallo Sesay and Terry Bookhart.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzgxNTQzNV5BMl5BanBnXkFtZTgwNzE0MzA0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0687625","name":"Glenn Plummer","idIMDB":"nm0687625"},"actorId":"nm0687625","character":"Johnny Handsome","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Sherayko","urlProfile":"http://www.imdb.com/name/nm0792069","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NDc4NzI4Nl5BMl5BanBnXkFtZTgwNDQzMjgzMzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 October 1946","placeOfBirth":" Perth Amboy, New Jersey, USA","bio":"Peter Sherayko was born on October 8, 1946 in Perth Amboy, New Jersey, USA. He is known for his work on Tombstone (1993), Warlock (1989) and Death Wish 4: The Crackdown (1987). He is married to Susan Sherayko.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NDc4NzI4Nl5BMl5BanBnXkFtZTgwNDQzMjgzMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0792069","name":"Peter Sherayko","idIMDB":"nm0792069"},"actorId":"nm0792069","character":"Bartender #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sal Cardile","urlProfile":"http://www.imdb.com/name/nm1548435","urlPhoto":"","biography":{"bio":"Sal Cardile is an actor and art director, known for The Long Ride Home (2003), Gang of Roses (2003) and Ghost Rock (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1548435","name":"Sal Cardile","idIMDB":"nm1548435"},"actorId":"nm1548435","character":"Jeremiah","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0339091","urlIMDB":"http://www.imdb.com/title/tt0339091","business":{"budget":null,"openingWeekend":[{"money":"$26,282","country":"USA","day":"12","month":"10","year":"2003","remarks":"4 Screens"}],"gross":[{"money":"$30,497","country":"USA","day":"19","month":"10","year":"2003","remarks":""},{"money":"$26,282","country":"USA","day":"12","month":"10","year":"2003","remarks":""}],"weekendGross":[{"money":"$2,100","country":"USA","day":"19","month":"10","year":"2003","remarks":"3 Screens"},{"money":"$26,282","country":"USA","day":"12","month":"10","year":"2003","remarks":"4 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"01","month":"09","year":"2002","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 34 min (94 min) (USA)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"2.3","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[],"votes":"888","type":"Movie","companyCreditsSimple":[{"idCompany":"co0093790","name":"Sleeping Giant Productions"},{"idCompany":"co0036144","name":"Warning Films Inc."}],"keywords":{"keywords":["action violence","old west","long brown hair","brunette","wild west","street shootout","showdown","bar fight","fistfight","saloon","deputy","sheriff","cowgirl","cowboy","horse","small western town","fast draw","gunslinger","rifle","pistol","gunfight","shootout","female protagonist","gun violence","violence","bar shootout","female gunfighter"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:28:24"}}