{"data":{"movies":[{"title":"We Don't Live Here Anymore","originalTitle":"","year":"2004","releaseDate":"20040903","directors":[{"name":"John Curran","id":"nm0192845"}],"writers":[{"name":"Andre Dubus","id":"nm0239653"},{"name":"Larry Gross","id":"nm0343419"}],"runtime":"101 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MTA4MjAyMl5BMl5BanBnXkFtZTcwNjYyNjYyMQ@@._V1.jpg","countries":["USA","Canada"],"languages":["English"],"genres":["Drama","Romance"],"plot":"The movie is set in the Pacific Northwest; specifically, Washington state. We know this from a glimpse of a license plate, the craftsman architecture of the two houses, and the mature, rich landscapes in between. The setting, like the scrutiny of the four main character's lives, is defined by the narrowness of the camera's field-of view. The one commercial street in town is only seen in the reflection of a store window, a shot of a non-descript auto-yard, or the tunnel of a tree-lined suburban sidewalk. The lush, wooded landscape is understood as an immediate presence in the domestic and professional lives of the characters; a steep hill, railroad tracks, a rushing stream, and a path over an old steel bridge are revisited again and again by the characters in their capacities as lovers, parents and friends.","simplePlot":"An indiscretion between two close friends tears down their respective marriages.","actors":[{"actorName":"Mark Ruffalo","urlProfile":"http://www.imdb.com/name/nm0749263","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQyNzMzZTMtYjlkNS00YzFhLWFhMTctY2M4YmQ1NmRhODBkXkEyXkFqcGdeQXVyNjcyNzgyOTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1967","placeOfBirth":" Kenosha, Wisconsin, USA","birthName":"Mark Alan Ruffalo","height":"5' 8\" (1.73 m)","bio":"Mark Ruffalo was born in Kenosha, Wisconsin, to Marie Rose (Hebert), a stylist and hairdresser, and Frank Lawrence Ruffalo, a construction painter. His father's ancestry is Italian, and his mother is of half French-Canadian and half Italian descent. Mark moved with his family to Virginia Beach, Virginia, where he lived out most of his teenage years. Following high school, Mark moved with his family to San Diego and soon migrated north, eventually settling in Los Angeles. He took classes at the Stella Adler Conservatory and subsequently co-founded the Orpheus Theatre Company, an Equity-Waiver establishment, where he worked in nearly every capacity. From acting, writing, directing and producing to running the lights and building sets while building his resume. Bartending for nearly nine years to make ends meet and ready to give it all up, a chance meeting and resulting collaboration with playwright/screenwriter Kenneth Lonergan changed everything. Ruffalo won NY success in Lonergan's play \"This Is Our Youth\", which led to the male lead in Lonergan's film You Can Count on Me (2000), playing the ne'er-do-well brother of Laura Linney. The performance drew rave reviews and invited comparisons to an early Marlon Brando. Notable roles in The Last Castle (2001), XX/XY (2002), and Windtalkers (2002) followed, although in 2002 Ruffalo was diagnosed with an acoustic neuroma, a type of brain tumor. Though the tumor was benign, the resulting surgery led to a period of partial facial paralysis, from which he fully recovered. In 2003, Ruffalo scored leading roles alongside two popular female stars, playing a police detective opposite Meg Ryan in In the Cut (2003) and the love interest of Gwyneth Paltrow in the comedy View from the Top (2003). Though both films were high-profile box office disappointments, Ruffalo went on to four notable (if highly disparate) films in 2004 - We Don't Live Here Anymore (2004), Eternal Sunshine of the Spotless Mind (2004), 13 Going on 30 (2004), and Collateral (2004) - which solidified his ability to be both a popular leading man and an acclaimed ensemble player in either comedy or drama. After 2004, Ruffalo was consistently at work, with leads in popular Hollywood films and independent productions that continued to solidify him as one of film's most consistently strong actors: Just Like Heaven (2005), Les fous du roi (2006), Zodiac (2007), Reservation Road (2007), and The Brothers Bloom (2008). In 2010 Ruffalo achieved something of a breakthrough, by directing the indie film Sympathy for Delicious (2010), which won him the Special Jury Prize at the Sundance Film Festival, and co-starring as the sperm-donor father to lesbian couple Annette Bening and Julianne Moore in The Kids Are All Right (2010). His role in the idiosyncratic domestic comedy/drama earned him Academy Award, Independent Spirit Award, Screen Actors Guild, and BAFTA nominations for Best Supporting Actor. High-profile roles in Martin Scorsese's Shutter Island (2010) and 'Kenneth Longeran''s long-delayed Margaret (2011) followed before Ruffalo's appearance as Dr. Bruce Banner, aka The Hulk, in Joss Whedon's blockbuster The Avengers (2012). Garnering highly positive reviews for a role in which actors Eric Bana and Edward Norton could not find success in previous films made Ruffalo a box office star in addition to a critically-acclaimed actor. He is expected to reprise the role in the upcoming 2015 sequel, and reunited with former co-star Gywneth Paltrow in the sex-addiction comedy-drama Thanks for Sharing (2012); Ruffalo also will take the lead in Ryan Murphy's adaptation of Larry Kramer's AIDS-drama play The Normal Heart (2014). Ruffalo has been married to actress Sunrise Coigney since 2000; the couple have three children, a son and two daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MjMwNjAzNF5BMl5BanBnXkFtZTcwMzkyNDg1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0749263","name":"Mark Ruffalo","idIMDB":"nm0749263"},"actorId":"nm0749263","character":"Jack Linden","urlCharacter":"http://www.imdb.com/character/ch0024650","main":true},{"actorName":"Laura Dern","urlProfile":"http://www.imdb.com/name/nm0000368","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NzY0MDQxMF5BMl5BanBnXkFtZTcwNzMwMzcyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1967","placeOfBirth":" Saint John's Health Center, Santa Monica, Los Angeles County, California, USA","birthName":"Laura Elizabeth Dern","height":"5' 10½\" (1.79 m)","bio":"Laura Dern was born on February 10, 1967 in Los Angeles, the daughter of actors Bruce Dern and Diane Ladd. Dern was exposed to movie sets and the movie industry from infancy, and obtained several bit parts as a child. Her parents divorced when Dern was two and Dern lost contact with her father for several years as a result. Her parents' background and her own early taste of the moviemaking world soon convinced the young Dern to pursue acting herself. Like so many young actors, her decision may have been influenced by social awkwardness -- the child of 60s counterculture parents, she was steeped in Eastern mysticism and political radicalism, and was seen as an oddball by her more conservative classmates. Her gawky physical appearance didn't help - even before her teens, she had achieved most of her impressive 5' 10\" height, was rail-skinny (other than precociously wide hips), had huge feet and a slouching posture, and for all this was often teased by classmates. Perhaps the nine-year-old Dern found refuge by studying acting at the Lee Strasberg Theater Institute. The first success for the young Dern came in 1980, with a role in Adrian Lyne's Foxes (1980), a teen movie starring Jodie Foster. She followed this with several small parts, or parts in small movies, such as Ladies and Gentlemen, the Fabulous Stains (1982) and Teachers (1984), as a student who has an affair with a teacher. (Her mother objected to her active presence on movie sets at age thirteen, which required Dern to sue for emancipation so she could play her role in \"The Fabulous Stains\"). Her next roles, as the blind girl who befriends the deformed boy in Mask (1985), and as a teenaged girl whose sexual awakening collides with a mysterious older man in Smooth Talk (1985), gave her career an important boost. Dern appeared to have made it with a leading role in David Lynch's acclaimed Blue Velvet (1986), but it was four years before her next notable film, and this was the bizarre Wild at Heart (1990), also directed by Lynch. The following year, Dern starred in Rambling Rose (1991), which would become her signature performance, as a sexually-precocious, free-spirited young housemaid in the South in the 1930s. Dern earned an Oscar nomination for her performance, and so did her mother and co-star, Diane Ladd. Dern continues to win prominent roles on the big screen, often in smaller, highly-regarded human dramas such as October Sky (1999), I Am Sam (2001) and We Don't Live Here Anymore (2004), although she is perhaps most widely known for her repeat role as Ellie Sattler in the summer adventure movies Jurassic Park (1993) and Jurassic Park III (2001), or for her guest performance on Ellen (1994), as the woman to whom Ellen finally comes out as a lesbian. Dern's pre-teen gawkiness matured into lithe beauty, but this doesn't prevent Dern from fearlessly throwing herself into a wide variety of roles which are sometimes unflattering, an excellent example being her unflinchingly comic portrayal of an intensely annoying loser whose pregnancy becomes a social and political football in Citizen Ruth (1996). This results in Dern being one of the most interesting actors working in Hollywood today. Having previously dated such Hollywood talent as Treat Williams, Renny Harlin, Kyle MacLachlan, Jeff Goldblum and Billy Bob Thornton, Dern eventually married musician Ben Harper in 2005. Early in her career, Dern was roommate to Marianne Williamson, the spirituality guru. Dern attended two days of college at UCLA and one semester at USC.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NzY0MDQxMF5BMl5BanBnXkFtZTcwNzMwMzcyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000368","name":"Laura Dern","idIMDB":"nm0000368"},"actorId":"nm0000368","character":"Terry Linden","urlCharacter":"http://www.imdb.com/character/ch0024651","main":true},{"actorName":"Peter Krause","urlProfile":"http://www.imdb.com/name/nm0470244","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk4NjA5NDY5MV5BMl5BanBnXkFtZTcwMjU4MjgxNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 August 1965","placeOfBirth":" Alexandria, Minnesota, USA","height":"6' 1\" (1.85 m)","bio":"Peter William Krause was born on August 12, 1965 in Alexandria, Minnesota. Both his parents were teachers, and he has a sister and brother. He was raised in Roseville, Minnesota. He graduated in 1987 from Gustavus Adolphus College in St. Peter, Minnesota, with a degree in English literature. In 1990, he received a Master of Fine Arts degree in Acting from New York University's Graduate Acting Program at the Tisch School of the Arts. Krause's first role was in a horror movie Blood Harvest (1987). On Carol & Company (1990), he appeared opposite Carol Burnett and Richard Kind. It was an anthology comedy series, with actors playing different characters each week. After it ended in 1991, he guest starred on Seinfeld: The Limo (1992) as Tim, a white supremacist, and on Beverly Hills, 90210 (1990) in a recurring role. In 1995, he appeared in starring and recurring roles on two short-lived shows, The Great Defender (1995) and If Not for You (1995). He also guest starred on Ellen (1994), University Hospital (1995), Caroline in the City (1995), Brotherly Love (1995), The Drew Carey Show (1995) and Party of Five (1994). He also got a major recurring role as Cybill's son-in-law, Kevin Blanders on Cybill (1995). Around the same time, he also appeared in a romantic comedy Lovelife (1997) opposite Saffron Burrows, Bruce Davison and Carla Gugino, and in 3rd Rock from the Sun: A Friend in Dick (1997). In 1998, he appeared in three movies, including The Truman Show (1998). He also got a starring role on ABC's comedy Sports Night (1998), created by Aaron Sorkin. He played sports anchor Casey McCall, opposite Josh Charles, Felicity Huffman and Joshua Malina, until the show's cancellation in 2000. After \"Sports Night\", he got a another starring role, on HBO's Six Feet Under (2001), created by Alan Ball. He received three Emmy nominations for his role as funeral director Nate Fisher, the son of Ruth (Frances Conroy) and the brother of David (Michael C. Hall) and Claire (Lauren Ambrose). During a break from \"Six Feet\" in 2004, he also appeared in We Don't Live Here Anymore (2004) opposite Laura Dern and Mark Ruffalo and played a part on Broadway. After \"Six Feet\" ended in 2005, he appeared in the miniseries The Lost Room (2006) opposite Julianna Margulies and Elle Fanning as the lead Joe Miller and played the lead and produced the thriller Civic Duty (2006). In 2007, he got yet another lead on Dirty Sexy Money (2007) as the lawyer of one of New York City's wealthiest families, opposite Donald Sutherland, William Baldwin and Natalie Zea. Krause was also a producer on the show, but unfortunately it ended in 2009, after two seasons. After \"Dirty Sexy Money\" ended, Krause did not stay idle long, when he received the lead on Parenthood (2010) as Adam Braverman, opposite Lauren Graham, Craig T. Nelson and Bonnie Bedelia. \"Parenthood\" ended in 2015 after six seasons. In 2016, he was cast in ABC's crime drama, The Catch (2016), produced by Shonda Rhimes. He is playing a con artist, who is being chased by a private investigator (Mireille Enos'), whom he defrauded.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk4NjA5NDY5MV5BMl5BanBnXkFtZTcwMjU4MjgxNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0470244","name":"Peter Krause","idIMDB":"nm0470244"},"actorId":"nm0470244","character":"Hank Evans","urlCharacter":"http://www.imdb.com/character/ch0024652","main":true},{"actorName":"Naomi Watts","urlProfile":"http://www.imdb.com/name/nm0915208","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMjY1NTA4OF5BMl5BanBnXkFtZTcwNjk3MDYwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 September 1968","placeOfBirth":" Shoreham, Kent, England, UK","birthName":"Naomi Ellen Watts","height":"5' 4½\" (1.64 m)","bio":"Naomi Ellen Watts was born on September 28, 1968 in Shoreham, England, to Myfanwy Edwards \"Miv\" (Roberts), an antiques dealer and costume/set designer, and Peter Watts (Peter Anthony Watts), the road manager to Pink Floyd. Her maternal grandfather was Welsh. Her father died when Naomi was seven and she began to follow her mother and her brother around England, until she was fourteen, when they settled in Australia, where her maternal grandmother was from. She coaxed her mother into letting her take acting class when they arrived. After bit parts in commercials, she landed her first role in For Love Alone (1986). Naomi met her best friend, Nicole Kidman, when they both auditioned for a bikini commercial and they shared a taxi ride home. In 1991, Naomi starred along Kidman in the sleeper-hit Flirting (1991) directed by John Duigan. Naomi continued her career by starring in the Australian Brides of Christ (1991) co-starring Oscar-winners Russell Crowe and Brenda Fricker. In 1993, she worked with John Duigan again in Wide Sargasso Sea (1993) and director George Miller in Gross Misconduct (1993). Tank Girl (1995), in 1995, an adaptation of the comic book was a cult hit, starred Naomi as \"Jet Girl\", but it didn't fare well at the box-office and didn't do much for her career as a whole. Watts continued to take insignificant parts in movies including the much forgotten film Children of the Corn: The Gathering (1996). It wasn't until David Lynch cast her in the critically acclaimed film Mulholland Drive (2001) that she began to become noticed. Her part as an aspiring actress showed her strong acting ability and wide range and earned her much respect, as much as to say by some that she was overlooked for a Oscar nomination that year. Stardom finally came to Naomi in the surprise hit The Ring (2002), which grossed over $100,000,000 at the box-office and starred Watts as a investigative reporter hunting down the truth behind several mysterious deaths seemingly caused by a video tape. While the movie did not fare well with the critics, it launched her into the spotlight. In 2003, she starred in Alejandro González Iñárritu's 21 Grams (2003) which earned her - what some say is a much overdue Oscar nomination and brought others to call her one of the best in her generation of actors. The same year, she was nominated for 21 Grams (2003), Naomi was chosen to play \"Ann Darrow\" in director Peter Jackson's King Kong (2005) which took her to New Zealand for a five month shoot. Watts completed her first comedy in I Heart Huckabees (2004) for director David O. Russell, playing a superficial spokes model - a break from her usual intense and dramatic roles she is known for. In 2005, she reprized her role as the protective-mother-reporter \"Rachel Keller\" in The Ring Two (2005). The movie, released in March, opened to $35,000,000 at the box office in the first weekend and established her as a box-office draw. Also in 2005, it was decided that her independent movie Ellie Parker (2001) would be re-released in late 2005 after its success at resurfacing at the Sundance Film Festival. The movie, which Naomi also produced, features her in the title role and is a bit biographical, but yet exaggerated take of the life of a struggling actress as she comes to Hollywood and encounters nightmares of the profession (it also features Watts' own beat-up Honda which she travels around in). In 2006, she starred with Edward Norton in Le voile des illusions (2006). In July of 2007, Naomi gave birth to a boy, Alexander Pete (Sasha Schreiber) in Los Angeles with Liev Schreiber. Since then her career choices have gathered even more critical acclaim with starring roles roles in German director Michael Haneke's American remake of his thriller Funny Games (2007), David Cronenberg's Eastern Promises (2007), and the action-thriller, The International (2009), released in February 2009. In mid-2008, Watts announced she was expecting her second child with Schreiber and gave birth to another boy, Samuel Kai Schreiber, in New York on December 13.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMjY1NTA4OF5BMl5BanBnXkFtZTcwNjk3MDYwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0915208","name":"Naomi Watts","nicknames":["Queen of Remakes"],"idIMDB":"nm0915208"},"actorId":"nm0915208","character":"Edith Evans","urlCharacter":"http://www.imdb.com/character/ch0024649","main":true},{"actorName":"Sam Charles","urlProfile":"http://www.imdb.com/name/nm1542311","urlPhoto":"","biography":{"bio":"Sam Charles is an actor, known for We Don't Live Here Anymore (2004), Supervolcano (2005) and Stargate: Atlantis (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1542311","name":"Sam Charles","idIMDB":"nm1542311"},"actorId":"nm1542311","character":"Sean Linden","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ginger Broatch","urlProfile":"http://www.imdb.com/name/nm1477415","urlPhoto":"","biography":{"bio":"Ginger Broatch was born in Vancouver, British Columbia, Canada. She is an actress, known for Blade: Trinity (2004), We Don't Live Here Anymore (2004) and Desolation Sound (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1477415","name":"Ginger Broatch","idIMDB":"nm1477415"},"actorId":"nm1477415","character":"Natasha Linden","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jennifer Bishop","urlProfile":"http://www.imdb.com/name/nm8820720","urlPhoto":"","biography":{"bio":"Jennifer Bishop is an actress, known for We Don't Live Here Anymore (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm8820720","name":"Jennifer Bishop","idIMDB":"nm8820720"},"actorId":"nm8820720","character":"Sharon Evans","urlCharacter":"http://www.imdb.com/character/ch0024653","main":true},{"actorName":"Jennifer Mawhinney","urlProfile":"http://www.imdb.com/name/nm1696355","urlPhoto":"","biography":{"bio":"Jennifer Mawhinney is an actress, known for We Don't Live Here Anymore (2004), Virtuality (2009) and Whistler (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1696355","name":"Jennifer Mawhinney","idIMDB":"nm1696355"},"actorId":"nm1696355","character":"Audrey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Amber Rothwell","urlProfile":"http://www.imdb.com/name/nm0745336","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzNzUzNzc3MV5BMl5BanBnXkFtZTgwNzU1ODQyMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Amber Rothwell is an actress and producer, known for White Noise (2005), We Don't Live Here Anymore (2004) and Red Deer (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzNzUzNzc3MV5BMl5BanBnXkFtZTgwNzU1ODQyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0745336","name":"Amber Rothwell","idIMDB":"nm0745336"},"actorId":"nm0745336","character":"Lauren","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Meg Roe","urlProfile":"http://www.imdb.com/name/nm1690532","urlPhoto":"","biography":{"bio":"Meg Roe is known for her work on We Don't Live Here Anymore (2004), Riverworld (2010) and Tout pour la vérité (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1690532","name":"Meg Roe","idIMDB":"nm1690532"},"actorId":"nm1690532","character":"Lollipop Girl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim Francis","urlProfile":"http://www.imdb.com/name/nm1299388","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQwMWVhNjEtMWZkYy00OWQ5LWIyNzgtZjIwMjZlYjRmMjcwXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1965","placeOfBirth":" Grande Prairie, Alberta, Canada","bio":"Jim Francis was born on April 25, 1965 in Grande Prairie, Alberta, Canada. He is an actor and writer, known for We Don't Live Here Anymore (2004), The Final Cut (2004) and Two Married People (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQwMWVhNjEtMWZkYy00OWQ5LWIyNzgtZjIwMjZlYjRmMjcwXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1299388","name":"Jim Francis","idIMDB":"nm1299388"},"actorId":"nm1299388","character":"Joe Ritchie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marc Baur","urlProfile":"http://www.imdb.com/name/nm0061883","urlPhoto":"","biography":{"bio":"Marc Baur is an actor and director, known for We Don't Live Here Anymore (2004), Silhouette de la mort (1991) and Freeway II: Confessions of a Trickbaby (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0061883","name":"Marc Baur","idIMDB":"nm0061883"},"actorId":"nm0061883","character":"Plumber","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patrick Earley","urlProfile":"http://www.imdb.com/name/nm1693571","urlPhoto":"","biography":{"bio":"Patrick Earley is an actor and cinematographer, known for The Great Retro-Chic Revival (2005) and We Don't Live Here Anymore (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1693571","name":"Patrick Earley","idIMDB":"nm1693571"},"actorId":"nm1693571","character":"Jim","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0361309","urlIMDB":"http://www.imdb.com/title/tt0361309","business":{"budget":{"money":"$3,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$101,295","country":"USA","day":"15","month":"08","year":"2004","remarks":"7 Screens"},{"money":"£28,954","country":"UK","day":"19","month":"06","year":"2005","remarks":"48 Screens"}],"gross":[{"money":"$2,037,545","country":"USA","day":"24","month":"10","year":"2004","remarks":""},{"money":"$2,027,720","country":"USA","day":"17","month":"10","year":"2004","remarks":""},{"money":"$2,020,114","country":"USA","day":"10","month":"10","year":"2004","remarks":""},{"money":"$2,002,356","country":"USA","day":"03","month":"10","year":"2004","remarks":""},{"money":"$1,971,389","country":"USA","day":"26","month":"09","year":"2004","remarks":""},{"money":"$1,904,214","country":"USA","day":"19","month":"09","year":"2004","remarks":""},{"money":"$1,712,507","country":"USA","day":"12","month":"09","year":"2004","remarks":""},{"money":"$1,418,069","country":"USA","day":"05","month":"09","year":"2004","remarks":""},{"money":"$793,130","country":"USA","day":"29","month":"08","year":"2004","remarks":""},{"money":"$340,842","country":"USA","day":"22","month":"08","year":"2004","remarks":""},{"money":"$101,295","country":"USA","day":"15","month":"08","year":"2004","remarks":""},{"money":"£28,954","country":"UK","day":"19","month":"06","year":"2005","remarks":""}],"weekendGross":[{"money":"$6,311","country":"USA","day":"24","month":"10","year":"2004","remarks":"15 Screens"},{"money":"$3,489","country":"USA","day":"17","month":"10","year":"2004","remarks":"18 Screens"},{"money":"$11,879","country":"USA","day":"10","month":"10","year":"2004","remarks":"21 Screens"},{"money":"$16,933","country":"USA","day":"03","month":"10","year":"2004","remarks":"32 Screens"},{"money":"$38,940","country":"USA","day":"26","month":"09","year":"2004","remarks":"73 Screens"},{"money":"$100,792","country":"USA","day":"19","month":"09","year":"2004","remarks":"77 Screens"},{"money":"$196,389","country":"USA","day":"12","month":"09","year":"2004","remarks":"164 Screens"},{"money":"$483,429","country":"USA","day":"05","month":"09","year":"2004","remarks":"190 Screens"},{"money":"$352,711","country":"USA","day":"29","month":"08","year":"2004","remarks":"90 Screens"},{"money":"$192,472","country":"USA","day":"22","month":"08","year":"2004","remarks":"29 Screens"},{"money":"$101,295","country":"USA","day":"15","month":"08","year":"2004","remarks":"7 Screens"},{"money":"£28,954","country":"UK","day":"19","month":"06","year":"2005","remarks":"48 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"06","month":"04","year":"2003","remarks":null},null],"copyrightHolder":"© 2004 Front Street Pictures, Inc. All Rights Reserved (on print)"},"technical":{"runtime":["1 hr 41 min (101 min)"],"soundMix":["Dolby Digital","DTS","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"6.4","metascore":"66","filmingLocations":[{"location":"Vancouver, British Columbia, Canada"}],"rated":"R","awards":[{"award":"Boston Society of Film Critics Awards 2004","titlesAwards":[{"titleAwardOutcome":"Won BSFC Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Laura Dern","id":"nm0000368","role":null}]}]}]},{"award":"Deauville Film Festival 2004","titlesAwards":[{"titleAwardOutcome":"Nominated Grand Special Prize","categories":[{"category":"","names":[{"name":"John Curran","id":"nm0192845","role":null}]}]}]},{"award":"Film Independent Spirit Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Independent Spirit Award","categories":[{"category":"Best Cinematography","names":[{"name":"Maryse Alberti","id":"nm0016662","role":null}]}]}]},{"award":"Seattle Film Critics Awards 2004","titlesAwards":[{"titleAwardOutcome":"2nd place Seattle Film Critics Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Laura Dern","id":"nm0000368","role":null}]}]}]},{"award":"Sundance Film Festival 2004","titlesAwards":[{"titleAwardOutcome":"Won Waldo Salt Screenwriting Award","categories":[{"category":"","names":[{"name":"Larry Gross","id":"nm0343419","role":null}]}]},{"titleAwardOutcome":"Nominated Grand Jury Prize","categories":[{"category":"Dramatic","names":[{"name":"John Curran","id":"nm0192845","role":null}]}]}]}],"votes":"8,411","type":"Movie","companyCreditsSimple":[{"idCompany":"co0149567","name":"Front Street Pictures"},{"idCompany":"co0010172","name":"Front Street Productions"},{"idCompany":"co0053488","name":"Renaissance Films"}],"keywords":{"keywords":["infidelity","foursome","cheating","love quadrangle","extramarital affair","adultery","friend","teacher","marriage","children","writer","tears","drinking","college","camera","watching television","breasts","claim in title","sex with clothes on","woman on top","folk dance","sex outside","jogging","stitch in side","woman crying","woman smoker","man with glasses","writing","writer's block","wine","wedding ring","voice over narration","voice over inner thoughts","underwear","train","toy whale","teddy bear","summer school","stoplight","secret","scotch","sadness","river","rejection","reference to leo tolstoy","reference to charlie chan","recording","record player","reading","raking leaves","railroad crossing","quitting smoking","professor","pounding one's chest","portland oregon","poem","playing catch","planet","photographer","penis","party","pancake","pain","outer space","old friend","office","novel","new yorker","mother son relationship","mother daughter relationship","morality","money","mistress","lust","luck","lie","liar","letter of rejection","laziness","kitchen","kiss","gin","french","french cigarette","flashback","fish","fishing","fight","fetal alcohol syndrome","female nudity","fellatio","father son relationship","father daughter relationship","family relationships","egg roll","drunkenness","drink","drink thrown into someone's face","divorce","dessert","death","dancer","crying","credit card","convenience store","computer","competition","clog dancer","class","classroom","celebration","cat box","car","burning writing","burning novel","brushing teeth","boyfriend girlfriend relationship","beer","bed wetting","bar","banana split","anger","alarm clock","airport","sex in car","running","plumber","oregon","love rectangle","lobster","irish dance","husband wife relationship","group of friends","dancing","cigarette smoking","bicycle","aspiring writer","sex standing up","outdoor sex","friendship"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 22:48:34"}}