{"data":{"movies":[{"title":"The Scream Team","originalTitle":"","year":"2002","releaseDate":"20021011","directors":[{"name":"Stuart Gillard","id":"nm0318795"}],"writers":[{"name":"Robert Short","id":"nm0324271"},{"name":"Dan Berendsen","id":"nm0073504"}],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMTM0MDQ5OF5BMl5BanBnXkFtZTgwOTQzMTE0NzE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Family","Fantasy","Horror"],"plot":"Excentric Frank Carlyle ran a horror shop in small town Steeple Falls, which takes pride in and profit from its Halloween traditions. Frank's widower grandson Richard grudgingly returns there from Boston with his own kids, bright Ian and bratty Claire, to settle the inheritance. Ian discovers grandpa's house is really haunted, and not just, as legend holds, by historic owner Zachariah Kull, who was burned on the stake.","simplePlot":"Excentric Frank Carlyle ran a horror shop in small town Steeple Falls, which takes pride in and profit from its Halloween traditions. Frank's widower grandson Richard grudgingly returns ... ","actors":[{"actorName":"Mark Rendall","urlProfile":"http://www.imdb.com/name/nm0719321","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MzE4MDk2NF5BMl5BanBnXkFtZTcwNDgzODIzOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 October 1988","placeOfBirth":" Toronto, Ontario, Canada","height":"5' 9\" (1.75 m)","bio":"Mark Rendall was born in 1988 in Toronto, Canada. At the age of 10 he auditioned for Cameron Macintosh's Touring Musical Production of Oliver, and landed the role of \"Spider\", one of Fagin's pickpockets, as well as understudy for the character \"Oliver\", which he ended up playing a total of 26 times during its three month run. Since his theatrical debut, he has gone on to perform in a long list of lead and supporting roles in both film, and television. Titles include: 30 Days of Night, My One and Only, Charlie Bartlett, The Exploding Girl, Transporter The Series, Hannibal, Year of the Carnivore, Algonquin, The Birder, and many more. Mark is also known in the voice over world for his performance as \"Arthur\" the aardvark in the animated series of the same name. In 2010, Mark took a step back from acting to pursue another passion, taking two years off to complete an education in the art of fine woodworking and instrument building at OCAD U and The Canadian School of Lutherie. Now residing in Toronto and Los Angeles, Mark continues to pursue both of his passions, finding the balance between acting and instrument building.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MzE4MDk2NF5BMl5BanBnXkFtZTcwNDgzODIzOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0719321","name":"Mark Rendall","idIMDB":"nm0719321"},"actorId":"nm0719321","character":"Ian Carlyle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kat Dennings","urlProfile":"http://www.imdb.com/name/nm0993507","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNjk2NzA5Ml5BMl5BanBnXkFtZTcwNzIxMDcwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1986","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Katherine Victoria Litwack","height":"5' 4½\" (1.64 m)","bio":"Kat Dennings was born Katherine Victoria Litwack in Bryn Mawr, Pennsylvania, near Philadelphia, to Ellen (Schatz), a speech therapist and poet, and Gerald Litwack, a molecular pharmacologist. She is the youngest of five children. Her family is of Russian Jewish descent. Kat was predominantly home-schooled, graduating at the age of fourteen. Her family subsequently moved to Los Angeles, California to support Kat acting full-time. After work doing commercials, she began work in television, starting with a role on HBO's Sex and the City (1998), following up with roles on Raising Dad (2001), The Scream Team (2002), Everwood (2002), Without a Trace (2002) and ER (1994), among others. Kat made the move to the big screen with supporting roles in Raise Your Voice (2004), The 40-Year-Old Virgin (2005) and Big Momma's House 2 (2006). She later achieved a level of fame with roles in The House Bunny (2008) and Nick and Norah's Infinite Playlist (2008). Kat continues to act in feature films and is an avid video blogger. Since 2011, she has starred with Beth Behrs in the CBS television series 2 Broke Girls (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNjk2NzA5Ml5BMl5BanBnXkFtZTcwNzIxMDcwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0993507","name":"Kat Dennings","idIMDB":"nm0993507"},"actorId":"nm0993507","character":"Claire Carlyle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Bockstael","urlProfile":"http://www.imdb.com/name/nm0090720","urlPhoto":"","biography":{"bio":"Robert was born in Winnipeg, Manitoba, Canada. He attended Lacerte French School until 1969 when his family moved to Dar Es Salaam, Tanzania. He spent three years at the International School of Tanganyika. After high school in Ottawa Ontario, Robert began performing in musical theater and then children's touring theater. Following a long association with The Great Canadian Theatre Company in Ottawa where he acted in and directed main stage theater, Robert pursued a career in front of the camera beginning with guest appearances on series like Street Legal, Forever Knight and Counterstrike. By the early 1990's Robert landed a lead role as RCMP officer Brian Fletcher in the popular series North of 60. Several other leading and continuing series followed in rapid succession, often overlapping. Wind at my Back for Sullivan Entertainment, Our Hero for CBC, The Famous Jett Jackson for Disney, Nero Wolfe for A&E and others. A long list of feature films and television movies followed at the same time as Robert continued his parallel career as a very busy voice artist providing the voice of Robocop for the Marvel animated series as well as lead and recurring characters in Sailor Moon, The Adventures of Teddy Ruxpin, X men, Maxie's World, Super Mario Brothers, Dennis the Menace, Max and Ruby, Monster Force, Rupert the Bear and many more. Robert also wrote the screenplay for a short film entitled This One Night. He also wrote television series in development with Big Motion Pictures and Global Television. Robert makes his home in Ottawa, Ontario Canada where he coaches and instructs at The Acting Company.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0090720","name":"Robert Bockstael","idIMDB":"nm0090720"},"actorId":"nm0090720","character":"Richard Carlyle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eric Idle","urlProfile":"http://www.imdb.com/name/nm0001385","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzY4NTQwNDA4M15BMl5BanBnXkFtZTYwNTg5Njcz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 March 1943","placeOfBirth":" South Shields, Tyne and Wear, England, UK","height":"6' 1\" (1.86 m)","bio":"Eric Idle is an English comedian, actor, author, singer, playwright, director and songwriter. Co-creator of Monty Python on TV, stage and five films, including The Life of Brian and The Holy Grail, which latter he adapted for the stage with John Du Prez as Monty Python's Spamalot, winning the Tony Award for Best Musical in 2005, a Grammy, a Drama Desk Award, and playing for almost five years on Broadway. They also wrote the comic oratorio Not The Messiah, He's a Very Naughty Boy, in 2007, which played round the world and at The Hollywood Bowl and was filmed live at The Royal Albert Hall, and a musical play What About Dick? available soon on I Tunes. He created and directed the first mockumentary The Rutles for NBC, starred as Ko-Ko in the English National Opera version of The Mikado, in London and Houston, and appeared last year in The Pirates of Penzance in Central Park and in Not The Messiah at Carnegie Hall. He is also one of the conceiver's of the musical Seussical. In 2012 he appeared live in front of a billion people worldwide singing his song Always Look On the Bright Side of Life at the Closing Ceremony of the London Olympics. Last year he created, directed and appeared in the sold out final Monty Python reunion show One Down Five To Go at London's O2 Arena for ten nights, whose final performance was broadcast live round the world. He has also acted in several movies, such as Nuns On the Run, Splitting Heirs, Casper, Shrek The Third, and The Adventures of Baron Munchhausen and written two novels, The Greedy Bastard Diary and Pass The Butler a West End play.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzY4NTQwNDA4M15BMl5BanBnXkFtZTYwNTg5Njcz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001385","name":"Eric Idle","idIMDB":"nm0001385"},"actorId":"nm0001385","character":"Coffin Ed","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tommy Davidson","urlProfile":"http://www.imdb.com/name/nm0203508","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODMzMTA0NjI0OV5BMl5BanBnXkFtZTgwOTEwMDM1MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1963","placeOfBirth":" Washington, District of Columbia, USA","height":"5' 6\" (1.68 m)","bio":"Davidson started his career as a stand-up comedian in Washington DC, earning an ardent following with sheer hard work in various comedy clubs. As one of the cutting-edge, young stand-ups, he was spotted by major concert promoters, who booked him as the opening act for A-list touring acts, including Patti LaBelle, Kenny G and Luther Vandross. It wasn't long before he came to Hollywood and was performing stand-up at a number of clubs, including the Comedy Act Theatre, where he met Robert Townsend. This led to his first national television appearance, with a starring role in Partners in Crime (2005) and was the conduit to Keenen Ivory Wayans, who proved instrumental in Davidson's career by offering him an opportunity to audition and join the uniquely talented cast of the most adventurous prime-time variety show of its day, In Living Color (1990). He, Jamie Foxx, Jim Carrey and Damon Wayans made TV history with their originality. Tommy's impressive film debut was opposite Halle Berry in Strictly Business (1991). He immediately segued into select high-profile films, starring opposite Jada Pinkett Smith in the romantic comedy, Woo (1998) (New Line), and in the provocative urban comedy, Booty Call (1997) (Columbia Pictures). His credits include numerous feature film roles, from Spike Lee's Bamboozled (2000), where he received acclaim and praise for his turn as \"Womack/Sleep 'N Eats\", to Juwanna Mann (2002) (Morgan Creek Productions') and the pivotal cameo in Jim Carrey's Ace Ventura: When Nature Calls (1995), which has become a cult favorite. Davidson's hilarious impressions of Sammy Davis Jr., Michael Jackson and other icons have become infamous. His visibility on In Living Color (1990) led to three Showtime specials: \"On Strength of New York\", \"Illin' in Philly\" and \"Takin' it to DC\". His elasticity as a performer who delivers on both the big and small screen led to other projects like the lead in the Disney's animated series, The Proud Family (2001), and as a host on FOX's \"The NFL Show\", alongside football greats Michael Irvin and Tony Siragusa. Davidson also portrays the lead in Will Smith's up-and-coming animated series, \"Youngin's\" (2000). Tommy stars - along with 80 other star stand-ups - in I Am Comic (2010), opposite Tim Allen, Lewis Black, Sarah Silverman, Carlos Mencia, Jeff Foxworthy and Kathy Griffin. The film, which premiered on Showtime, is one of Netflix's surefire hits, enjoying a continual surge as a favorite with consumers. Davidson scored big with reviewers and audiences, alike, opposite Michael Jai White, in the critically-lauded spoof comedy, Black Dynamite (2009) (Sony Pictures), last year's big Sundance hit, which is currently being adapted as a cartoon for Adult Swim. He is receiving critical raves for a cameo in Ahmed Ahmed's award-winning documentary, Just Like Us (2010), a feature film masterpiece which is a cross-cultural study of stand-up comedy bridging all ethnicities. Tommy travels internationally selling out every venue in which he headlines.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODMzMTA0NjI0OV5BMl5BanBnXkFtZTgwOTEwMDM1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0203508","name":"Tommy Davidson","idIMDB":"nm0203508"},"actorId":"nm0203508","character":"Jumper","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kathy Najimy","urlProfile":"http://www.imdb.com/name/nm0001562","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MDg4MTEzNV5BMl5BanBnXkFtZTcwNDM5NDMwNA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 February 1957","placeOfBirth":" San Diego, California, USA","birthName":"Kathy Ann Najimy","height":"5' 6\" (1.68 m)","bio":"Kathy Najimy was born and raised in San Diego, California. She is the daughter of Samia (Massery) and Fred Najimy, a postal worker, both of Lebanese ancestry. Kathy attended Crawford High School, and began her film career in the early 1990s, with several minor roles. Kathy got her breakthrough screen role as \"Sister Mary Patrick\" in Sister Act (1992). She reprised this role in 1993 in Sister Act 2: Back in the Habit (1993). She is most notably known as the voice of \"Peggy Hill\" on King of the Hill (1997). Kathy lives in Los Angeles with her husband, actor/singer Dan Finnerty (the Dan Band) and their daughter, Samia Najimy Finnerty.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MDg4MTEzNV5BMl5BanBnXkFtZTcwNDM5NDMwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001562","name":"Kathy Najimy","idIMDB":"nm0001562"},"actorId":"nm0001562","character":"Mariah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kim Coates","urlProfile":"http://www.imdb.com/name/nm0167649","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NjU3NjcxNF5BMl5BanBnXkFtZTgwODAwNjkwMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 February 1958","placeOfBirth":" Saskatoon, Saskatchewan, Canada","height":"6' 0½\" (1.84 m)","bio":"Kim's film career began in 1991 with The Last Boy Scout. Two Warner Brothers' hits followed: Innocent Blood and The Client. Since that time he has starred in over forty films, including Academy Award winners Black Hawk Down directed by Ridley Scott, and Pearl Harbor directed by Michael Bay. Other films include Waterworld and Open Range with Kevin Costner, Grilled with Ray Romano, Silent Hill opposite Sean Bean, Hostage with Bruce Willis, Assault on Precinct 13, Unforgettable, Skinwalkers, and Hero Wanted. Kim returned to Entourage for it's final season as Carl Ertz, the sleazy movie Producer. His performance garnered so much attention in previous seasons that Ertz's return was a direct request. He appeared in a recurring role on CSI Miami. Other prominent guest starring television roles include CSI, CSI NY, Cold Case, and Prison Break. He has had roles in more than 20 MOW's including the NBC miniseries Hercules, and Disney's Scream Team. These dramatic turns on television have earned him Gemini nominations for Best Actor in a Featured Supporting Role for HBO's Dead Silence and Best Performance in a Guest Role Dramatic Series for The Outer Limits. In 2008 Kim starred in and executive produced the film The Poet. Before its wide release it won best picture and best director (Damian Lee) at the New York Staten Island Film festival. At the AOF International Film Festival in Pasadena, Kim received the Half Life Achievement Award for acting in 2009. Kim also won best actor for playing Steve Sorrano in King of Sorrow. Kim starred on Broadway as Stanley Kowalski in A Streetcar Named Desire, as the title role in Macbeth at the legendary Stratford Theatre, and has appeared in over fifty plays in North America. In the fall of 2010 Kim starred in the blockbuster 3D movie Resident Evil Afterlife, with Mila Jovovich. In 2011, Kim starred in Sacrifice, with Cuba Gooding Jr., A Little Help, with Jenna Fisher, Sinners and Saints and Robosapien. In 2012, Kim starred in the sports comedy Goon along side Seann William Scott, Live Schreiber and Jay Baruchel, for which Kim is nominated for Best Performance By An Actor In A Supporting Role at the 2013 Canadian Screen Awards. Goon was much lauded by international audiences and critics alike. The FX hit series Sons of Anarchy is going into its 6th season. Kim Coates is Tig Trager, the motorcycle club's sergeant at arms. Tig fears nothing, much like Kim throughout his career. Kim has 3 feature films opening in 2013; Rufus, Ferocious, The Dark Truth which Kim co-produced and starred in along side Forrest Whitaker and Andy Garcia, Kim is currently filming Crossing Lines in Prague with William Fichtner and Donald Sutherland. Kim currently resides in Los Angeles with his wife and their two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NjU3NjcxNF5BMl5BanBnXkFtZTgwODAwNjkwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0167649","name":"Kim Coates","idIMDB":"nm0167649"},"actorId":"nm0167649","character":"Zachariah Kull","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Reineke","urlProfile":"http://www.imdb.com/name/nm0717980","urlPhoto":"","biography":{"bio":"Gary Reineke is an actor, known for Spider (2002), Dieppe (1993) and The Grey Fox (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0717980","name":"Gary Reineke","idIMDB":"nm0717980"},"actorId":"nm0717980","character":"Grandpa Frank Carlyle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nigel Bennett","urlProfile":"http://www.imdb.com/name/nm0000911","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMTY2NzM5NF5BMl5BanBnXkFtZTcwMDA5MDYxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1949","placeOfBirth":" Wolverhampton, Staffordshire, England, UK","height":"6' 1\" (1.85 m)","bio":"An accomplished theatre actor, Mr. Bennett appeared on the British stage for fifteen years before moving to Canada in 1986. During this time, he starred in \"The Secret Diary of Adrian Mole\" at the Wyndhams Theatre in London's West End. He also performed in \"Ghosts\", \"Private Lives\" and \"Rookery Nook\" at such theaters as the Haymarket Theatre in Leicester, the Crucible Theatre, the Bristol Old Vic and the King's Head Theatre Club, as well as many seasons on the stages of Canterbury, Newcastle, Nottingham, Plymouth, Manchester, Liverpool and Sheffield in England. From 1992-1996, he starred as the powerful and seductive \"Lucien LaCroix\" in the Gemini-nominated television series, Le justicier des ténèbres (1992). In 1995, he received the prestigious Gemini Award for his role in the series, and it was on this show where he made his directorial debut. His feature film work includes co-starring with Gene Hackman in Narrow Margin (1990), The Outside Chance of Maximilian Glick (1988), a poignant drama that was voted Best New Film at both the Toronto Festival of Festivals and the Vancouver International Film Festival in 1988, Legends of the Fall (1994) starring Brad Pitt, Murder at 1600 (1997) starring Wesley Snipes, Mars à table! (1999), a science fiction feature that premiered at the 1998 Toronto Film Festival and The Skulls (2000) starring Craig T. Nelson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMTY2NzM5NF5BMl5BanBnXkFtZTcwMDA5MDYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000911","name":"Nigel Bennett","idIMDB":"nm0000911"},"actorId":"nm0000911","character":"Warner MacDonald","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edie Inksetter","urlProfile":"http://www.imdb.com/name/nm1141621","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQzMzM0ODM4MF5BMl5BanBnXkFtZTgwNDg1NjM2NzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"birthName":"Elizabeth Dyanne Inksetter","height":"5' 6\" (1.68 m)","bio":"Edie Inksetter was born in Thunder Bay, Ontario, Canada as Elizabeth Dyanne Inksetter. She is an actress, known for The Handmaid's Tale (2017), It (2017) and Shoot the Messenger (2016). She has been married to Stephanne Lardy since October 22, 2005. They have two children. She was previously married to Christian Potenza.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQzMzM0ODM4MF5BMl5BanBnXkFtZTgwNDg1NjM2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1141621","name":"Edie Inksetter","idIMDB":"nm1141621"},"actorId":"nm1141621","character":"Face","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zoie Palmer","urlProfile":"http://www.imdb.com/name/nm1235776","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NjExMzA1OF5BMl5BanBnXkFtZTYwNjQ5MjEz._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"height":"5' 6\" (1.68 m)","bio":"Zoie Palmer is an English-Canadian actress, born in Camborne, Cornwall, England, to parents of Irish and British descent. She earned her B.F.A. at York University in Toronto, Canada, in 2001; and has since been featured in a variety of film and television projects, including the critically acclaimed The Reagans (2003) as Patti Reagan and Out of the Ashes (2003) as Didi Goldstein; and starred as Abby in Devil's Perch (2005). Palmer has guest-starred in several television series, such as The CW action drama Nikita (2010) in the episode \"Girl's Best Friend\" as Anya Vimer; in the HBO Canada comedy Call Me Fitz (2010) episode \"Don of Differently Abled\" as Laura (2011); and the CTV crime drama The Listener (2009) episode \"The Shooting\" as Staff Sgt. McCoy (2012). She had a recurring role in the popular CTV music drama Ma vie de star (2004) as rock singer Patsy Sewer (2006-2007); was a co-lead in the Global drama The Guard (2008) as Carly Greig; and starred as Dr. Lauren Lewis in the groundbreaking Showcase supernatural drama Lost Girl (2010). Zoie plays the main role of The Android in the science fiction series Dark Matter (2015). Film work includes the award winning short Terminal Venus (2003) as Annabelle; horror thriller Devil (2010) as Cheryl; crime thriller Cold Blooded (2012) as officer Frances Jane; comedy Sex After Kids (2013) as Lou; and the fantasy adventure Patch Town (2014) as Bethany. In 2011, Zoie Palmer was nominated for \"Outstanding Performance - Female\" by ACTRA for her performance as Haley in The Untitled Work of Paul Shepard (2010). She was awarded \"Best Actor\" for \"Terminal Venus\" at the 2004 Baja Film Festival (Mexico), and the \"Gold Medallion Acting Award for Best Actress in a Feature Film\" for \"Cold Blooded\" by the 2012 BareBones International Film Festival (US). In 2014, Palmer received the \"Fan Choice Award for Favourite Canadian Screen Star\" by the Canadian Screen Awards.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NjExMzA1OF5BMl5BanBnXkFtZTYwNjQ5MjEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1235776","name":"Zoie Palmer","idIMDB":"nm1235776"},"actorId":"nm1235776","character":"Rebecca Kull","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tedde Moore","urlProfile":"http://www.imdb.com/name/nm0601925","urlPhoto":"","biography":{"bio":"Tedde Moore was born in Toronto, Ontario, Canada. She is an actress, known for A Christmas Story (1983), Murder by Decree (1979) and Mistletoe Over Manhattan (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0601925","name":"Tedde Moore","idIMDB":"nm0601925"},"actorId":"nm0601925","character":"Friendly Woman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott Wickware","urlProfile":"http://www.imdb.com/name/nm0927015","urlPhoto":"","biography":{"bio":"Scott Wickware is an actor, known for The Tuxedo (2002), Snow Cake (2006) and The Santa Clause (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0927015","name":"Scott Wickware","idIMDB":"nm0927015"},"actorId":"nm0927015","character":"Police Officer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Colleen Reynolds","urlProfile":"http://www.imdb.com/name/nm0721659","urlPhoto":"","biography":{"bio":"Colleen Reynolds is an actress, known for Pixels (2015), Loser (2000) and Welcome to Mooseport (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0721659","name":"Colleen Reynolds","idIMDB":"nm0721659"},"actorId":"nm0721659","character":"Concerned Guest","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kay Hawtrey","urlProfile":"http://www.imdb.com/name/nm0370443","urlPhoto":"","biography":{"dateOfBirth":"8 November 1926","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Katharine Mary Craven Hawtrey","height":"5' 8\" (1.73 m)","bio":"Kay Hawtrey was born on November 8, 1926 in Toronto, Ontario, Canada as Katharine Mary Craven Hawtrey. She is an actress, known for Vidéodrome (1983), Urban Legend (1998) and Funeral Home (1980). She was previously married to John Clark.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0370443","name":"Kay Hawtrey","idIMDB":"nm0370443"},"actorId":"nm0370443","character":"Librarian","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0313634","urlIMDB":"http://www.imdb.com/title/tt0313634","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"2002 Disney Enterprises, Inc."},"technical":{"runtime":["1 hr 40 min (100 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.9","filmingLocations":[{"location":"Main St. Unionville, Ontario, Canada"}],"awards":[],"votes":"666","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0035722","name":"Hartbreak Films"},{"idCompany":"co0008970","name":"Walt Disney Pictures"}],"keywords":{"keywords":["stake","halloween","small town","man on fire","ferris wheel","carnival","haunted house","reference to david copperfield","three word title","rhyme in title","fireball","explosion","punishment","ritual","gas","father son relationship","disney channel original movie","festival","single parent","afterlife","inventor","funeral","soul","ghost","fire","horror for children"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:59:02"}}