{"data":{"movies":[{"title":"Friday Night Lights","originalTitle":"","year":"2004","releaseDate":"20041008","directors":[{"name":"Peter Berg","id":"nm0000916"}],"writers":[{"name":"Buzz Bissinger","id":"nm0084334"},{"name":"David Aaron Cohen","id":"nm0169173"}],"runtime":"118 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMDI5MTM4Ml5BMl5BanBnXkFtZTcwNjA4MDcyMQ@@._V1.jpg","countries":["Germany","USA"],"languages":["English"],"genres":["Action","Drama","Sport"],"plot":"Odessa, Texas, is a small, town in Texas. Racially divided and economically dying, there is one night that gives the town something to live for: Friday Night. The Permian Panthers have a big winning tradition in Texas high school football, led by QB Mike Winchell and superstar tailback Boobie Miles, but all is not well, as Boobie suffers a career-ending injury in the first game of the season. Hope is lost among citizens in Odessa, and for the team, but Coach Gary Gaines, who believes that \"Perfection is being able to look your friends in the eye and know you did everything you could not to let them down\", is somehow able to help the team rise up from the ashes and make a huge season comeback. Now on their way to state, the Panthers must go out and be perfect, because they may never matter this much for the rest of their lives.","simplePlot":"Based on H.G. Bissinger's book, which profiled the economically depressed town of Odessa, Texas and their heroic high school football team, The Permian High Panthers.","actors":[{"actorName":"Billy Bob Thornton","urlProfile":"http://www.imdb.com/name/nm0000671","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxOTUwMDI0OF5BMl5BanBnXkFtZTcwNjIyNzkzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 August 1955","placeOfBirth":" Hot Springs, Arkansas, USA","birthName":"William Robert Thornton","height":"5' 10\" (1.78 m)","bio":"Billy Bob Thornton was born on August 4, 1955 in Hot Springs, Arkansas, to Virginia Roberta (Faulkner), a psychic, and William Raymond (Billy Ray) Thornton, an educator, high school history teacher, and basketball coach (now deceased). He is the older brother of James Donald (Jimmy Don) (born in 1958 and now deceased) and John David (born in 1969). He has been married six times and has four children: daughter Amanda Brumfield, with Melissa Lee Gatlin (now Parish); sons William and Harry, both with Pietra Dawn Cherniak; and daughter Bella with Connie Angland. Billy Bob began his artistic career as a musician, playing drums and singing in a band called Tres Hombres, which once opened for Hank Williams Jr.. In 1981, he moved to Los Angeles with childhood friend Tom Epperson to pursue an acting and writing career. On the side, Billy Bob also sought work as a singer and drummer. He and Epperson tried for years to sell their scripts but no one was buying. During those rough times, Billy Bob neglected his health and subsequently landed in the hospital with heart problems due to malnutrition. In 1992, Billy Bob starred in One False Move (1992), a movie he co-wrote with Epperson. The team finally received attention because of this work, which was very well received in Hollywood. His popularity increased steadily, especially after Sling Blade (1996) which he wrote, directed and in which he starred.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxOTUwMDI0OF5BMl5BanBnXkFtZTcwNjIyNzkzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000671","name":"Billy Bob Thornton","idIMDB":"nm0000671"},"actorId":"nm0000671","character":"Coach Gary Gaines","urlCharacter":"http://www.imdb.com/character/ch0012971","main":true},{"actorName":"Lucas Black","urlProfile":"http://www.imdb.com/name/nm0085407","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTAzNjEyMTkxN15BMl5BanBnXkFtZTcwMzc3NTc4Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 November 1982","placeOfBirth":" Speake, Alabama, USA","birthName":"Lucas York Black","height":"5' 9\" (1.75 m)","bio":"Lucas York Black was born on November 29, 1982, in Decatur, Alabama, to Jan (Keenum), an office worker, and Larry Black, a museum worker. Without any formal acting lessons, Lucas made his film debut with a small part in the Kevin Costner film The War (1994) at the age of 11. The small role helped him land his next job in the series American Gothic (1995). When the series went to North Carolina to cast its primary roles, the casting people in Wilmington remembered Lucas, and suggested him for the role of \"Caleb Temple.\" Although the series didn't last too long, Lucas's film career did. He was next seen in the sleeper hit Sling Blade (1996) and then in another dark film Ghosts of Mississippi (1996). A bit of Calvin Klein modeling and mainly school and sports occupied the rest of his spare time. He scored another summer hit with The X Files (1998) and finally got a lead role in the independent film La tête dans le carton à chapeaux (1999). Selective about his film roles, Lucas turned down an opportunity to star in the movie adaptation of The Horse Whisperer (1998) due to the request of having his accent altered. In 2000, he was seen with Matt Damon in All the Pretty Horses (2000). A good student, Lucas graduated from Speake High School, class of 2001, where he played football, basketball and a little bit of golf. He plans on studying fish biology, which would be probable since he is a highly active bass fisherman. After a small break, he will next be seen alongside Hollywood stars Jude Law and Natalie Portman in the drama Cold Mountain (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTAzNjEyMTkxN15BMl5BanBnXkFtZTcwMzc3NTc4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0085407","name":"Lucas Black","nicknames":["Lucky"],"idIMDB":"nm0085407"},"actorId":"nm0085407","character":"Mike Winchell","urlCharacter":"http://www.imdb.com/character/ch0012972","main":true},{"actorName":"Garrett Hedlund","urlProfile":"http://www.imdb.com/name/nm1330560","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NDM1NTMwNF5BMl5BanBnXkFtZTYwMTE0NTgz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 September 1984","placeOfBirth":" Roseau, Minnesota, USA","birthName":"Garrett John Hedlund","height":"6' 2½\" (1.89 m)","bio":"Born in Roseau, Minnesota, Garrett John Hedlund is the son of Kristi Anne (Yanish) and Robert Martin Hedlund. He has two older siblings, Nathaniel and Amanda. His father is of Swedish descent and his mother is of German and Norwegian ancestry. Garrett spent his early years growing up on a farm in a small town. When he was in the ninth grade, he moved to Scottsdale, Arizona, with his mother, and taking private acting lessons. After graduating from high school, he immediately moved to Los Angeles, California to pursue an acting career. One month later, he would landed the role of Achilles' cousin Patroclus in the major feature Troy (2004) opposite Brad Pitt. His next feature was Friday Night Lights (2004) starring Billy Bob Thornton, in which Garrett played a high school football player. He then landed a starring role opposite Mark Wahlberg in Four Brothers (2005), playing one of four brothers whose mother is murdered. He also starred opposite Jeff Bridges and Olivia Wilde in TRON: Legacy (2010), the long-awaited sequel to the science fiction cult classic TRON (1982).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NDM1NTMwNF5BMl5BanBnXkFtZTYwMTE0NTgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1330560","name":"Garrett Hedlund","idIMDB":"nm1330560"},"actorId":"nm1330560","character":"Don Billingsley","urlCharacter":"http://www.imdb.com/character/ch0012973","main":true},{"actorName":"Derek Luke","urlProfile":"http://www.imdb.com/name/nm1035682","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MTcxMDMwOF5BMl5BanBnXkFtZTgwODc2ODI2MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 April 1974","placeOfBirth":" Jersey City, New Jersey, USA","height":"5' 11\" (1.8 m)","bio":"Derek Luke was born on April 24, 1974 in Jersey City, New Jersey, USA. He is an actor, known for Captain America: The First Avenger (2011), Antwone Fisher (2002) and Glory Road (2006). He has been married to Sophia Adella Luke since 1998.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MTcxMDMwOF5BMl5BanBnXkFtZTgwODc2ODI2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1035682","name":"Derek Luke","idIMDB":"nm1035682"},"actorId":"nm1035682","character":"Boobie Miles","urlCharacter":"http://www.imdb.com/character/ch0012986","main":true},{"actorName":"Jay Hernandez","urlProfile":"http://www.imdb.com/name/nm0379596","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NjU3Mjg2NV5BMl5BanBnXkFtZTYwMzczMjQ3._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1978","placeOfBirth":" Montebello, California, USA","birthName":"Javier Manuel Hernandez Jr.","height":"5' 8½\" (1.74 m)","bio":"With talent, the requisite good looks, and plenty of on-screen charisma, Jay Hernandez was born in Montebello, California, to Isis (Maldonado), an accountant and secretary, and Javier Hernandez, Sr., a mechanic. He is of Mexican descent. Jay had a serendipitous experience that led to his career. While riding an elevator in a high-rise in his native Los Angeles, the young man was approached by talent manager Howard Tyner, who suggested Hernandez had what it took to have a successful career in Hollywood. In 1998, he made his TV series debut as \"Antonio Lopez\", one of the high school basketball players in the NBC Saturday morning teen sitcom, Hang Time (1995), and stayed with the show for two seasons. Departing NBC, Hernandez moved to MTV with the short-term role of pizza delivery guy \"Eddie\" on the popular late-night serial, Undressed (1999), before segueing to the big screen. In 2001, Hernandez co-starred with Kirsten Dunst in the teen romance, Crazy/Beautiful (2001), portraying stalwart, straight-A high school student \"Carlos Nunez\", whose plans to attend the US Naval Academy are threatened by his growing attraction to a self-destructive rich girl, (Kirsten Dunst). He next appeared in Disney's surprise hit film, The Rookie (2002), as high school baseball team captain Joaquin \"Wack\" Campos. He also had a supporting role in the video-game-ish actioner, Torque (2004). Also in 2004, he was in the action-packed drama, Ladder 49 (2004), as \"Keith Perez\", and in the other action-packed drama, Friday Night Lights (2004). In 2006, he next starred in Eli Roth's Hostel (2005), a brutal horror flick about two American college buddies (Hernandez and Derek Richardson) lured to an out-of-the-way hostel in a Slovakian town rumored to house desperate, but beautiful Eastern European women. Following their wrong heads, both Americans get trapped in a truly sinister situation that plunges them into the dark recesses of human nature.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NjU3Mjg2NV5BMl5BanBnXkFtZTYwMzczMjQ3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0379596","name":"Jay Hernandez","idIMDB":"nm0379596"},"actorId":"nm0379596","character":"Brian Chavez","urlCharacter":"http://www.imdb.com/character/ch0012975","main":true},{"actorName":"Lee Jackson","urlProfile":"http://www.imdb.com/name/nm1430960","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNjU2NjY5N15BMl5BanBnXkFtZTYwNDA4Mjgz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 February 1980","placeOfBirth":" Longview, Texas, USA","birthName":"Lee Arthur Jackson","height":"6' 3\" (1.91 m)","bio":"Lee Jackson was born on February 25, 1980 in Longview, Texas, USA as Lee Arthur Jackson. He is an actor, known for Friday Night Lights (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNjU2NjY5N15BMl5BanBnXkFtZTYwNDA4Mjgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1430960","name":"Lee Jackson","nicknames":["Lee J"],"idIMDB":"nm1430960"},"actorId":"nm1430960","character":"Ivory Christian","urlCharacter":"http://www.imdb.com/character/ch0012997","main":true},{"actorName":"Lee Thompson Young","urlProfile":"http://www.imdb.com/name/nm0949810","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1NjM5NTE5M15BMl5BanBnXkFtZTgwODU2MTgwMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 February 1984","placeOfBirth":" Columbia, South Carolina, USA","height":"5' 7¾\" (1.72 m)","bio":"Lee Thompson Young was born as the son of Velma Love and Tommy Scott Young. When he was in second grade his parents split up and he went to live with his mother. At age ten, he portrayed Dr. Martin Luther King in a play called \"A Night of Stars and Dreams\". That's when Lee decided he wanted to be an actor. After doing community theater for a while, he traveled to New York during the spring break of 1996 and got himself an agent. He moved to NY in June but it wasn't until next year that he got to audition for the part of Jett Jackson. Lee filmed the pilot. He found out in June 1998 from Disney that the show had been picked up.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1NjM5NTE5M15BMl5BanBnXkFtZTgwODU2MTgwMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0949810","name":"Lee Thompson Young","idIMDB":"nm0949810"},"actorId":"nm0949810","character":"Chris Comer","urlCharacter":"http://www.imdb.com/character/ch0012984","main":true},{"actorName":"Tim McGraw","urlProfile":"http://www.imdb.com/name/nm0005210","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjcyNTkyOTY4OV5BMl5BanBnXkFtZTcwODI2NzQ5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 May 1967","placeOfBirth":" Delhi, Louisiana, USA","birthName":"Samuel Timothy Smith","height":"6' (1.83 m)","bio":"Three-time Grammy Award winner Tim McGraw, the son of former major league reliever Tug McGraw, is a country music superstar who has sold over 40 million albums. Eleven of his album have debuted at No. 1 on the Billboard country album chart and he has had 21 hit No. 1 singles on the Billboard Hot Country 100 chart. He and his wife Faith Hill won Grammy Awards in 2001 and 2006 for their duos \"Let's Make Love\" and \"Like We Never Loved At All\". An aspiring actor, McGraw has appeared in eight movies between 2004 and 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjcyNTkyOTY4OV5BMl5BanBnXkFtZTcwODI2NzQ5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005210","name":"Tim McGraw","idIMDB":"nm0005210"},"actorId":"nm0005210","character":"Charles Billingsley","urlCharacter":"http://www.imdb.com/character/ch0012985","main":true},{"actorName":"Grover Coulson","urlProfile":"http://www.imdb.com/name/nm0183462","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzODkwNTAwOF5BMl5BanBnXkFtZTYwNjg3Mjgz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Born in Hubbard Texas November 2,1947, to parents, Grover and Odessa Coulson, Graduated from Dunbar High School, Ft. Worth Texas, 1966. The next year enrolled at Tarrant County Jr. college to study theater. After one semester he went into the Army for two years ,and upon discharge, returned to college to continue his studies in acting.. Learning of an audition at a community theater he met and audition for the very Talented writer, director, Johnny Simons, of the Internationally known ( Hip Pocket Theater ) and for the next 10 years worked, learned, and grew as an actor at H.P.T.,An interesting highlight. H.P.T. was the first theater company from Texas ever invited to perform at the Edinburgh theater Festival in Scotland.also the first theater company to preform at Queen Elizabeth Hall of London . An unexpected invited to audition for a play, \" In The Middle Of Nowhere \" at Dallas's Theater Three landing his first professional live theater acting job. During one performance of that show, the then artistic director of The Dallas Theater Center, Ken Bryant, saw his performance and invited Grover to audition for him at the Dallas Theater Center where he was cast in \"Prologue to All The Kings Men \",and for the next several years he worked between these two Dallas Theaters and Ft. Worth's, Jubilee Theater ,Stage West Theater & Hip Pocket Theater. After one show at H.P.T. Grover was approached by an agent who took him on as a client and on his first TV audition for the hit TV show \", Dallas\" was cast in his first television show opposite , Larry (J. R.) Hagman .. It was then he ,started to transition from stage to screen. In 2003 he auditioned for the movie \" Friday Night Lights\" directed by Peter Berg and landed the co-staring role,( L.V. Miles ). That role has to many acting opportunities, Life is good.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzODkwNTAwOF5BMl5BanBnXkFtZTYwNjg3Mjgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0183462","name":"Grover Coulson","idIMDB":"nm0183462"},"actorId":"nm0183462","character":"L.V. Miles","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Connie Britton","urlProfile":"http://www.imdb.com/name/nm0110168","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyODQ2NDIxN15BMl5BanBnXkFtZTcwNTY4ODM2MQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1967","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Constance Elaine Womack","height":"5' 8\" (1.73 m)","bio":"Connie Britton began playing country music fading sensation Rayna Jaymes in Nashville (2012) after having wrapped production for the five season long Friday Night Lights (2006) alongside Kyle Chandler. She previously appeared in Universal's Friday Night Lights (2004) -the movie- directed by Peter Berg and also starring Billy Bob Thornton; and Edward Burns' independent feature Looking for Kitty (2004). Britton was born Constance Elaine Womack in Boston, Massachusetts, to Linda Jane (Cochran) and Edgar Allen Womack, Jr., a physicist and energy company executive. She is of Irish, German, and English descent. Britton received accolades for her starring roles in Edward Burns' acclaimed independent films The Brothers McMullen (1995) and No Looking Back (1998). In the former, she captivated moviegoers with her portrayal of \"Molly\", the luminous wife of a cheating husband. This popular low-budget film went on to win the Grand Jury Prize at the Sundance Film Festival. After nearly canceling her audition with director Edward Burns, this last meeting of the day turned into the role that would launch her career. Born in Boston, Massachusetts, Britton moved to Lynchburg, Virginia, at the age of seven with her family, including her fraternal twin sister. She went on to attend Dartmouth College, where she majored in Asian studies and spent a term in Beijing, China. Upon graduation, she moved to New York, where she spent two years at the Neighborhood Playhouse studying with Sanford Meisner, and an additional two years performing in regional theater and off-Broadway productions. She moved to Los Angeles after the success of The Brothers McMullen (1995). She starred in ABC's Lost at Home (2003) opposite Mitch Rouse and Gregory Hines. Her other television credits include The Fighting Fitzgeralds (2001) opposite Brian Dennehy, a recurring role in the highly-acclaimed drama The West Wing (1999) and a starring role in the award-winning comedy Spin City (1996) opposite Michael J. Fox. Additionally, Britton starred in the recent feature films The Next Big Thing (2001) and One Eyed King (2001). In her free time, Britton, who resides in both New York and Los Angeles, enjoys hiking, yoga, and doing volunteer work.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyODQ2NDIxN15BMl5BanBnXkFtZTcwNTY4ODM2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0110168","name":"Connie Britton","idIMDB":"nm0110168"},"actorId":"nm0110168","character":"Sharon Gaines","urlCharacter":"http://www.imdb.com/character/ch0012978","main":true},{"actorName":"Connie Cooper","urlProfile":"http://www.imdb.com/name/nm0177959","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDgxMDMxMjAwNF5BMl5BanBnXkFtZTgwNTA3ODkyMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Connie Cooper received BS (Speech) and MA (Theatre Arts) degrees from Northwestern University in Evanston, Illinois. She worked continuously on stage, in Chicago and Houston, Texas, from 1972 through 1987. While working on stage in Chicago in 1987, she was cast in her first film role. Her scene, with Kevin Costner and Amy Madigan in Field of Dreams (1989), was cut from the original, but director Phil Alden Robinson included it in the Anniversary Edition DVD. Since 1987 Connie has alternated between stage and screen work. She has a legit singing voice (mezzo soprano - alto). Early in her career she played Fanny Brice in an Austin, Texas, production of \"Funny Girl\". She has played both Marta (early) and Joanne (2003) in \"Company\", and was in the original Houston stage production cast of \"Best Little Whorehouse in Texas\" in 1979. She received critical acclaim for her role as the quarterback's (Lucas Black) mom in Friday Night Lights (2004). Connie is also a very accomplished acting coach. She specializes in coaching on-camera acting, and young actors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDgxMDMxMjAwNF5BMl5BanBnXkFtZTgwNTA3ODkyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0177959","name":"Connie Cooper","idIMDB":"nm0177959"},"actorId":"nm0177959","character":"Mrs. Winchell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kasey Stevens","urlProfile":"http://www.imdb.com/name/nm1043473","urlPhoto":"","biography":{"bio":"Kasey Stevens was born in Shreveport, Louisiana, USA. She is an actress and producer, known for Friday Night Lights (2004), Stop-Loss (2008) and D.E.B.S. (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1043473","name":"Kasey Stevens","idIMDB":"nm1043473"},"actorId":"nm1043473","character":"Flippy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ryanne Duzich","urlProfile":"http://www.imdb.com/name/nm1721063","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDgxNzczN15BMl5BanBnXkFtZTcwNzYzMjgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 November 1983","placeOfBirth":" Galveston, Texas, USA","birthName":"Ryanne Elizabeth Duzich","height":"5' 6\" (1.68 m)","bio":"Ryanne Duzich was born on November 1, 1983 in Galveston, Texas, USA as Ryanne Elizabeth Duzich. She is an actress, known for Friday Night Lights (2004) and Kill Theory (2009). She has been married to Thomas L. Culberson since December 13, 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDgxNzczN15BMl5BanBnXkFtZTcwNzYzMjgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1721063","name":"Ryanne Duzich","idIMDB":"nm1721063"},"actorId":"nm1721063","character":"Melissa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Amber Heard","urlProfile":"http://www.imdb.com/name/nm1720028","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MjA1ODU0MV5BMl5BanBnXkFtZTgwNTczNTkwNjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 April 1986","placeOfBirth":" Austin, Texas, USA","birthName":"Amber Laura Heard","height":"5' 7\" (1.7 m)","bio":"Amber Laura Heard was born in Austin, Texas, to Patricia Paige (Parsons), an internet researcher, and David Clinton Heard, a contractor. She has English, Irish, Scottish, German, and Welsh ancestry. Heard appeared in the Academy Award-nominated film, North Country (2005), in which she played Charlize Theron's character in flashbacks. Her other early film credits include: Syrup (2013), Drive Angry (2011) 3D, The Joneses (2009), Never Back Down (2008), Alpha Dog (2006) and Friday Night Lights (2004). On television, Heard starred on The CW drama, Hidden Palms (2007), and had guest starring roles on Showtime's Californication (2007) and CBS's Criminal Minds (2005) In 2009, Heard starred in the box office hit, Zombieland (2009), opposite Woody Harrelson, Bill Murray and Jesse Eisenberg. She also starred in the suspense thriller, The Stepfather (2009), with Sela Ward, Dylan Walsh and Penn Badgley. In 2008, she garnered attention for her role in the comedic hit, Pineapple Express (2008), with Seth Rogen and James Franco. Heard received a 2008 Young Hollywood Award for her breakthrough performance in \"Pineapple Express\". She appeared in The Rum Diary (2011), opposite Johnny Depp, and John Carpenter's The Ward (2010), which premiered at the 2010 Toronto Film Festival. She also starred in the independent film, And Soon the Darkness (2010), in which she additionally served as a co-producer. Heard starred in Paranoia (2013), opposite Harrison Ford, Liam Hemsworth and Gary Oldman. The film was released by \"Relativity Media\" on August 16, 2013. She also starred in Robert Rodriguez's Machete Kills (2013), which was released by \"Open Road Films\" on March 4, 2013, and McG's 3 Days to Kill (2014), opposite Kevin Costner and Hailee Steinfeld, which was released in 2014. Additionally, her film All the Boys Love Mandy Lane (2006), which premiered at the 2006 Toronto Film Festival, was released by The Weinstein Co. in theaters in the fall of 2013. Heard resides in Los Angeles, where she is actively involved with Amnesty International. In 2015, she married actor Johnny Depp.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MjA1ODU0MV5BMl5BanBnXkFtZTgwNTczNTkwNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1720028","name":"Amber Heard","idIMDB":"nm1720028"},"actorId":"nm1720028","character":"Maria","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Morgan Farris","urlProfile":"http://www.imdb.com/name/nm1555417","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NTIzNjY2MV5BMl5BanBnXkFtZTYwOTAwODAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 April 1990","placeOfBirth":" Austin, Texas, USA","birthName":"Morgan Marie Farris","height":"5' 2\" (1.57 m)","bio":"Morgan Marie Farris was born April 7, 1990 in Georgetown, Texas. She lives in Georgetown with her parents and attends Georgetown High School. She plans to graduate in December 2007 and move to California to continue her acting career. Morgan has two sisters, Bailey and Madison. Morgan's debut was in the film Friday Night Lights at age thirteen. She is cited as saying that her inspiration comes from her best friend, Elizabeth Blankenship.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NTIzNjY2MV5BMl5BanBnXkFtZTYwOTAwODAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1555417","name":"Morgan Farris","idIMDB":"nm1555417"},"actorId":"nm1555417","character":"Jennifer Gaines","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0390022","urlIMDB":"http://www.imdb.com/title/tt0390022","business":{"budget":{"money":"$30,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$20,269,025","country":"USA","day":"10","month":"10","year":"2004","remarks":"2,667 Screens"}],"gross":[{"money":"$61,188,085","country":"USA","day":"26","month":"12","year":"2004","remarks":""},{"money":"$61,113,215","country":"USA","day":"19","month":"12","year":"2004","remarks":""},{"money":"$61,009,850","country":"USA","day":"12","month":"12","year":"2004","remarks":""},{"money":"$60,845,010","country":"USA","day":"05","month":"12","year":"2004","remarks":""},{"money":"$60,607,710","country":"USA","day":"28","month":"11","year":"2004","remarks":""},{"money":"$60,085,618","country":"USA","day":"21","month":"11","year":"2004","remarks":""},{"money":"$59,293,125","country":"USA","day":"14","month":"11","year":"2004","remarks":""},{"money":"$57,256,950","country":"USA","day":"07","month":"11","year":"2004","remarks":""},{"money":"$52,944,730","country":"USA","day":"31","month":"10","year":"2004","remarks":""},{"money":"$47,269,480","country":"USA","day":"24","month":"10","year":"2004","remarks":""},{"money":"$37,819,455","country":"USA","day":"17","month":"10","year":"2004","remarks":""},{"money":"$20,269,025","country":"USA","day":"10","month":"10","year":"2004","remarks":""}],"weekendGross":[{"money":"$30,680","country":"USA","day":"26","month":"12","year":"2004","remarks":"104 Screens"},{"money":"$62,385","country":"USA","day":"19","month":"12","year":"2004","remarks":"154 Screens"},{"money":"$116,155","country":"USA","day":"12","month":"12","year":"2004","remarks":"264 Screens"},{"money":"$179,265","country":"USA","day":"05","month":"12","year":"2004","remarks":"323 Screens"},{"money":"$292,405","country":"USA","day":"28","month":"11","year":"2004","remarks":"351 Screens"},{"money":"$537,105","country":"USA","day":"21","month":"11","year":"2004","remarks":"587 Screens"},{"money":"$1,259,520","country":"USA","day":"14","month":"11","year":"2004","remarks":"984 Screens"},{"money":"$2,975,065","country":"USA","day":"07","month":"11","year":"2004","remarks":"2,110 Screens"},{"money":"$4,085,440","country":"USA","day":"31","month":"10","year":"2004","remarks":"3,004 Screens"},{"money":"$6,947,460","country":"USA","day":"24","month":"10","year":"2004","remarks":"2,969 Screens"},{"money":"$12,216,880","country":"USA","day":"17","month":"10","year":"2004","remarks":"2,764 Screens"},{"money":"$20,269,025","country":"USA","day":"10","month":"10","year":"2004","remarks":"2,667 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"02","month":"02","year":"2004","remarks":null},null],"copyrightHolder":"MDBF Filmgesellschaft mbH &amp; Co. KG and Universal Studios"},"technical":{"runtime":["1 hr 58 min (118 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)"]},"rating":"7.3","metascore":"70","filmingLocations":[{"location":"Abilene, Texas, USA"}],"rated":"PG-13","awards":[{"award":"AFI Awards, USA 2005","titlesAwards":[{"titleAwardOutcome":"Won AFI Award","categories":[{"category":"Movie of the Year","names":[]}]}]},{"award":"ESPY Awards 2005","titlesAwards":[{"titleAwardOutcome":"Won ESPY","categories":[{"category":"Best Sports Movie","names":[]}]}]},{"award":"MTV Movie Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Breakthrough Male","names":[{"name":"Tim McGraw","id":"nm0005210","role":null}]}]}]},{"award":"Teen Choice Awards 2009","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice TV Actress: Drama","names":[{"name":"Minka Kelly","id":"nm1310368","role":null}]}]}]},{"award":"Teen Choice Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie: Drama","names":[]}]}]},{"award":"USC Scripter Award 2005","titlesAwards":[{"titleAwardOutcome":"Nominated USC Scripter Award","categories":[{"category":"","names":[{"name":"Peter Berg","id":"nm0000916","role":"screenwriter"},{"name":"Buzz Bissinger","id":"nm0084334","role":"screenwriter/author"},{"name":"David Aaron Cohen","id":"nm0169173","role":"screenwriter"}]}]}]},{"award":"Young Artist Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Family Feature Film - Drama","names":[]}]}]}],"votes":"49,143","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"},{"idCompany":"co0003687","name":"Imagine Entertainment"},{"idCompany":"co0120229","name":"Friday Night Lights LLC"}],"keywords":{"keywords":["texas","football","coach","high school football","odessa texas","football team","championship","small town","brief female nudity","brief teenager nudity","brief topless female nudity","brief nudity","shaky cam","underdog","football practice","football coach","poverty","sports team","day in title","domestic violence","quarterback","oil refinery","what happened to epilogue","underage drinking","uncle","ring","premarital sex","party","mother son relationship","medical examination","marriage","lord's prayer","locker room","knee injury","houston texas","hospital","friendship","father son relationship","fast food restaurant","drunkenness","crutches","college recruitment","coin toss","african american","1980s","teenager","student athlete","racism","oil","american football","based on true story","based on book"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:36:31"}}