{"data":{"movies":[{"title":"Out of Time","originalTitle":"","year":"2003","releaseDate":"20031003","directors":[{"name":"Carl Franklin","id":"nm0002083"}],"writers":[{"name":"David Collard","id":"nm1152581"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2UzM2IzYzAtNjUyYi00Zjk4LWI3ZjAtYjQyYzZiYjlkNGI4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama","Mystery","Thriller"],"plot":"Matt Whitlock, the police chief of the small town of Banyan Key, Florida, is separated from his wife, Alex, a police homicide detective in MIami. Matt's been having an affair with Ann Merai Harrison, a woman who's separated from her abusive husband, Chris, and who says that she has cancer. When her doctor tells her of a new expensive treatment, Matt decides to give her the nearly half a million dollars in an evidence lock up that he seized from a local drug bust. When Ann and her husband turn up dead only days after naming Chief Whitlock as beneficiary on a million dollar Life insurance policy, things start heating up for Whitlock as the evidence his wife Alex is gathering stacks up against him. And as if things couldn't get worse, the D.E.A. now want the drug money a.s.a.p. Anxiety runs high for Whitlock as he scrambles to figure out who has set him up and also recover half a million dollars all while trying not to break a sweat or draw any suspicions. He's a man who is way out of ...","simplePlot":"A Florida police chief must solve a vicious double homicide before he himself falls under suspicion.","actors":[{"actorName":"Denzel Washington","urlProfile":"http://www.imdb.com/name/nm0000243","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDU2Mzc3MV5BMl5BanBnXkFtZTcwNjAwNTE5OQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1954","placeOfBirth":" Mount Vernon, New York, USA","birthName":"Denzel Hayes Washington Jr.","height":"6' 1\" (1.85 m)","bio":"Denzel Washington is an American actor and filmmaker. He has received three Golden Globe awards, a Tony Award, and two Academy Awards: Best Supporting Actor for the historical war drama film Glory (1989) and Best Actor for his role as a corrupt cop in the crime thriller Training Day (2001). Denzel Hayes Washington, Jr. was born on December 28, 1954 in Mount Vernon, New York. He is the middle of three children of a beautician mother, Lennis (Lowe), from Georgia, and a Pentecostal minister father, Denzel Washington, Sr., from Virginia. After graduating from high school, Denzel enrolled at Fordham University, intent on a career in journalism. However, he caught the acting bug while appearing in student drama productions and, upon graduation, he moved to San Francisco and enrolled at the American Conservatory Theater. He left A.C.T. after only one year to seek work as an actor. His first paid acting role was in a summer stock theater stage production in St. Mary's City, Maryland. The play was \"Wings of the Morning\", which is about the founding of the colony of Maryland (now the state of Maryland) and the early days of the Maryland colonial assembly (a legislative body). He played the part of a real historical character, Mathias Da Sousa, although much of the dialogue was created. Afterwards he began to pursue screen roles in earnest. With his acting versatility and powerful sexual presence, he had no difficulty finding work in numerous television productions. He made his first big screen appearance in Carbon Copy (1981) with George Segal. Through the 1980s, he worked in both movies and television and was chosen for the plum role of Dr. Philip Chandler in NBC's hit medical series St. Elsewhere (1982), a role that he would play for six years. In 1989, his film career began to take precedence when he won the Oscar for Best Supporting Actor for his portrayal of Tripp, the runaway slave in Edward Zwick's powerful historical masterpiece Glory (1989). Washington has received much critical acclaim for his film work since the 1990s, including his portrayals of real-life figures such as South African anti-apartheid activist Steve Biko in Cry Freedom (1987), Muslim minister and human rights activist Malcolm X in Malcolm X (1992), boxer Rubin \"Hurricane\" Carter in The Hurricane (1999), football coach Herman Boone in Remember the Titans (2000), poet and educator Melvin B. Tolson in The Great Debaters (2007), and drug kingpin Frank Lucas in American Gangster (2007). Malcolm X and The Hurricane garnered him Oscar nominations for Best Actor, before he finally won that statuette in 2002 for his lead role in Training Day (2001). Through the 1990s, Denzel also co-starred in such big budget productions as The Pelican Brief (1993), Philadelphia (1993), Crimson Tide (1995), The Preacher's Wife (1996), and Courage Under Fire (1996), a role for which he was paid $10 million. He continued to define his onscreen persona as the tough, no-nonsense hero through the 2000s in films like Out of Time (2003), Man on Fire (2004), Inside Man (2006), and The Taking of Pelham 123 (2009). Cerebral and meticulous in his film work, he made his debut as a director with Antwone Fisher (2002); he also directed The Great Debaters (2007) and Fences (2016). In 2010, Washington headlined The Book of Eli (2010), a post-Apocalyptic drama. Later that year, he starred as a veteran railroad engineer in the action film Unstoppable (2010), about an unmanned, half-mile-long runaway freight train carrying dangerous cargo. The film was his fifth and final collaboration with director Tony Scott, following Crimson Tide (1995), Man on Fire (2004), Déjà Vu (2006) and The Taking of Pelham 1 2 3. He has also been a featured actor in the films produced by Jerry Bruckheimer and has been a frequent collaborator of director Spike Lee. In 2012, Washington starred in Flight (2012), for which he was nominated for an Academy Award for Best Actor. He co-starred with Ryan Reynolds in Sécurité rapprochée (2012), and prepared for his role by subjecting himself to a torture session that included waterboarding. In 2013, Washington starred in 2 Guns (2013), alongside Mark Walberg. In 2014, he starred in The Equalizer (2014), an action thriller film directed by Antoine Fuqua and written by Richard Wenk, based on the television series of same name starring Edward Woodward. During this time period, he also took on the role of producer for some of his films, including The Book of Eli and Safe House. In 2016, he was selected as the recipient for the Cecil B. DeMille Lifetime Achievement Award at the 73rd Golden Globe Awards. He lives in Los Angeles, California with his wife, Pauletta Washington, and their four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDU2Mzc3MV5BMl5BanBnXkFtZTcwNjAwNTE5OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000243","name":"Denzel Washington","nicknames":["D"],"idIMDB":"nm0000243"},"actorId":"nm0000243","character":"Matt Lee Whitlock","urlCharacter":"http://www.imdb.com/character/ch0336993","main":true},{"actorName":"Eva Mendes","urlProfile":"http://www.imdb.com/name/nm0578949","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MDQwMDI4NF5BMl5BanBnXkFtZTcwMjc1OTU1NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 March 1974","placeOfBirth":" Miami, Florida, USA","height":"5' 6\" (1.68 m)","bio":"Eva Mendes was born in Miami, Florida but raised in Los Angeles, California of Cuban-American heritage. In college, she began acting, studying underneath acting coach Ivana Chubbuck. This led to her desire to appear in feature films. Though taking many smaller roles in movies, she was little known until playing the girlfriend of Denzel Washington's character in Training Day (2001). Since then, she has been featured in a wider range of roles, from comedic to dramatic. These gave her the ability to work with many highly regarded directors, such as Robert Rodriguez (Once Upon a Time in Mexico (2003)), Carl Franklin (Out of Time (2003)), John Singleton (2 Fast 2 Furious (2003)), Antoine Fuqua (Training Day (2001)) and the Farrelly Bros. (Stuck on You (2003)). Eva has co-starred in an independent film, The Wendell Baker Story (2005) with Owen Wilson, Luke Wilson and Will Ferrell, with Luke Wilson directing. Before that, her biggest movie was Hitch (2005), a romantic comedy that had her playing opposite Will Smith. Along with acting, Eva is employed by Revlon Cosmetics as an international spokeswoman. She joins such elite actresses and models as Julianne Moore, Halle Berry and Cindy Crawford, who appear in Revlon's television and print ads. She is also a passionate supporter and active participant in Revlon's fight against breast cancer. Eva's goals are to improve her acting skills by working with such contemporary directors as Steven Soderbergh, Spike Jonze and Pedro Almodóvar, and learning from such renowned directors as Federico Fellini and Michelangelo Antonioni.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MDQwMDI4NF5BMl5BanBnXkFtZTcwMjc1OTU1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0578949","name":"Eva Mendes","idIMDB":"nm0578949"},"actorId":"nm0578949","character":"Alex Diaz Whitlock","urlCharacter":"http://www.imdb.com/character/ch0015005","main":true},{"actorName":"Sanaa Lathan","urlProfile":"http://www.imdb.com/name/nm0005125","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMjg0NDYyOF5BMl5BanBnXkFtZTcwNzA2Njg4Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 September 1971","placeOfBirth":" New York City, New York, USA","birthName":"Sanaa McCoy Lathan","height":"5' 7\" (1.7 m)","bio":"Sanaa Lathan, pronounced Sa-NAA, \"like Sinatra without the tra\", was born on September 19, 1971, in New York, as her actress mother Eleanor McCoy performed on Broadway with the likes of Eartha Kitt, and her director father Stan Lathan worked behind the scenes in television for PBS. She was exposed to the life of entertainment and stars at a very early age, which had a profound impact upon her life. As a child, she was nurtured in athletics and the arts, through training in Gymnastics and Dance. She later became a product of divorced parents, whom she remained closely connected to, by being shuttled to live between them, both, in New York and Los Angeles. Those loving, supportive parents, the extremes of the public schools of New York City and the riches of the 90210 Beverly Hills High, served to build, within Sanaa, a humble spirit, a competitive nature, and a full awareness of self. Being academically competitive and wanting to attain proficiency to become a successful professional, Sanaa began her college matriculation, attending the University of California at Berkeley in the liberal arts division, studying English. While an undergraduate, she continued to nurture the latent desire to express herself through the arts by performing with the \"Black Theatre Workshop\". Nearing the end of her college days with thoughts of what her next move would be, Sanaa considered the natural progression of an English major to law school, but her fate was sealed as she was encouraged to apply to the Masters program at the Yale School of Drama by a recruiter. Through the three years of the training and skill attainment that Yale provided, Sanaa was able to visualize how she could effectively combine her talents, giftedness and intelligence to express herself through this powerfully expressive art form called acting. She gained a love for the stage and the drama greats, like William Shakespeare, by performing in school productions such as \"Othello\", \"Romeo and Juliet\", \"The Winter's Tale\" and \"Twelfth Night\". Desiring to live in New York near her mom, she began her career performing in off-Broadway productions, such as \"Por' Knockers\" and \"A Movie Star Has to Be Born in Black and White\". After seeing her perform in a number of productions and realizing her skill and ambitions, her father counseled and encouraged her to move to California, to get into the hot-bed of action that Hollywood could provide her in the business. Reluctantly, she made the move and has not turned back. Upon her own initiative, without the help of her accomplished dad, she was able to get notable appearances in television on shows such as In the House (1995), Moesha (1996), NYPD Blue (1993), Family Matters (1989) and the made-for-TV movie, Miracle in the Woods (1997), playing the younger character opposite Della Reese. She even obtained television series regular roles in two very short-lived sitcoms -- Built to Last (1997), that never got national distribution, and the two seasons-canceled NBC sitcom called LateLine (1998), in the role of an aggressive talent broker for a network news show. Honing her skills and returning to her passion for the stage, Sanaa also performed at the South Coast Repertory Theatre in the play, \"Our Town\", as well as other productions, while pursuing her career in television and the movies. Her first movie role came in the action movie, Drive (1997), where she played the estranged wife (\"Carolyn Brody\"), opposite Kadeem Hardison. Other brief, but substantial roles, came in the vampire action movie, Blade (1998), where she played the mother (\"Vanessa Brooks\") of lead actor Wesley Snipes, and the comedy, Life (1999), playing the girlfriend (\"Daisy\"), opposite Martin Lawrence, and the comedy/drama, The Wood (1999), where she played the adult girlfriend (\"Alicia\"), opposite Omar Epps. This chance meeting with Epps provided the opportunity for them to build a friendship and real-life romantic relationship. Upon completion of The Wood (1999) shoot, Sanaa went to New York to join the ensemble cast for her meatiest role to date in the comedy/romantic drama movie, The Best Man (1999). She played the career eclectic yet strong girlfriend (\"Robin\") role, opposite her fellow The Wood (1999) costar, Taye Diggs. In 2000, she appeared in the limited release independent comedy/drama, Catfish in Black Bean Sauce (1999), where, again, she plays a girlfriend (\"Nina\"), this time in an interracial relationship opposite the writer/actor director, Chi Muoi Lo. Also in 2000, she lent her acting talents under the direction of her brother, Tendaji Lathan, in his award-winning film short, The Smoker (2000). She also appeared in the acclaimed romantic drama, Love & Basketball (2000), where she played the lead role (\"Monica\") opposite her real-life boyfriend, Omar Epps. Sanaa gave the performance of her life in this women- empowering breakthrough role, written by the film's director, Gina Prince-Bythewood. The acting was no problem, but the basketball was not a skill Sanaa possessed. Having never touched a basketball and without a guarantee of getting the part, Sanaa spent several months training, with her brother and friends, with her costar/boyfriend and finally with a professional coach to look like a professional ball player for this movie. Bythewood, realizing the awesome talent of Sanaa, had her audition for the lead role in her next film direction, the made-for-television HBO movie, Disappearing Acts (2000), based on the best-selling novel by renowned author Terry McMillan. Sanaa again nailed the role, gaining 20 extra pounds to better depict the character of the book. Sanaa has also begun to extend herself in the business by co-producing a yet-to-be-released movie with Queen Latifah. The Los Angles NAACP Theatrical Award Committee rewarded Sanaa with a nomination for Best Actress for her work in the production To Take Arms. In 2000, Sanaa received the NAACP Image honor nomination for Best Supporting Actress in a motion picture for her role in The Best Man (1999). In 2001, she received the NAACP Image Award nomination for Best Actress in a motion picture for her excellent performance in Love & Basketball (2000), she would go on to win this most coveted award. During the same year, she was also nominated for the Indie Spirit Award for her role in Love & Basketball (2000). Considering the lack of color in the awarding process of the Oscars and the Golden Globes in 2001, many black organizations choose to recognize their powerful performances in 2000 among people of color. Essence Magazine awarded Sanaa the OMAR for Best Actress. BET allowed fans to select winners for which Sanaa won Best Actress for her role in Love & Basketball (2000) in the motion picture category as well as Best Actress in the television movie or mini-series category for her role in Disappearing Acts. The online magazine Reelimagemagazine.com also allowed fans and an expert panel to select winners for its awards. Again Sanaa won Best Actress for her role in Love & Basketball (2000). Loved, admired and supported by her family, friends, fellow actors and fans, in addition to possessing that natural beauty, intelligence and gifted talent, Sanaa has the potential to sail over and above the ranks of other prominent stars. With limited-yet-growing roles or opportunities for African-Americans, in general, in film and women specifically, Sanaa is expected to break the barriers and forge her way into film history at an unprecedented and uninhibited style, both before and behind the camera, in the business. The name Sanaa means both \"work of art\" and \"beauty\" in Swahili -- how appropriate the name.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMjg0NDYyOF5BMl5BanBnXkFtZTcwNzA2Njg4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005125","name":"Sanaa Lathan","idIMDB":"nm0005125"},"actorId":"nm0005125","character":"Ann Merai Harrison","urlCharacter":"http://www.imdb.com/character/ch0015006","main":true},{"actorName":"Dean Cain","urlProfile":"http://www.imdb.com/name/nm0001002","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MzIwNTY3NF5BMl5BanBnXkFtZTgwMTc3MTEwMzE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1966","placeOfBirth":" Mt. Clemens, Michigan, USA","birthName":"Dean George Tanaka","height":"5' 11½\" (1.82 m)","bio":"Dean Cain was born Dean George Tanaka in Mount Clemens, Michigan, to actress Sharon Thomas Cain and Roger Tanaka. His mother married his adoptive father, director Christopher Cain, when Dean was three. Though he grew up in Malibu and attended Santa Monica High School, his career plans favored professional football over acting. While at Princeton, he completed a history major, dated Brooke Shields for two years, and set an NCAA record for interceptions in a season. After signing with the Buffalo Bills, a knee injury ended his pro career before it began. Though he had already played a part in his father's The Stone Boy (1984), he went through the usual route of commercials and tv-parts (notably, Beverly Hills, 90210 (1990) in 1990) before landing his break-through role as Superman/Clark Kent in the series Lois & Clark: The New Adventures of Superman (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MzIwNTY3NF5BMl5BanBnXkFtZTgwMTc3MTEwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001002","name":"Dean Cain","idIMDB":"nm0001002"},"actorId":"nm0001002","character":"Chris Harrison","urlCharacter":"http://www.imdb.com/character/ch0015007","main":true},{"actorName":"John Billingsley","urlProfile":"http://www.imdb.com/name/nm0082517","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3NTkzNzY4OV5BMl5BanBnXkFtZTgwMjE4Mzk5MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 May 1960","placeOfBirth":" Media, Pennsylvania, USA","height":"5' 9\" (1.75 m)","bio":"John Billingsley was born on May 20, 1960 in Media, Pennsylvania, USA. He is an actor, known for Star Trek: Enterprise (2001), The Man from Earth (2007) and White Oleander (2002). He is married to Bonita Friedericy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3NTkzNzY4OV5BMl5BanBnXkFtZTgwMjE4Mzk5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0082517","name":"John Billingsley","idIMDB":"nm0082517"},"actorId":"nm0082517","character":"Chae","urlCharacter":"http://www.imdb.com/character/ch0015008","main":true},{"actorName":"Robert Baker","urlProfile":"http://www.imdb.com/name/nm1151899","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MTU0NTgxMV5BMl5BanBnXkFtZTgwMTMwOTQ0NzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 October 1979","placeOfBirth":" Memphis, Tennessee, USA","height":"6' 2\" (1.88 m)","bio":"Robert Baker was born on October 15, 1979 in Memphis, Tennessee, USA. He is an actor and writer, known for Out of Time (2003), Indiana Jones and the Kingdom of the Crystal Skull (2008) and The Lone Ranger (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MTU0NTgxMV5BMl5BanBnXkFtZTgwMTMwOTQ0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1151899","name":"Robert Baker","nicknames":["Bo"],"idIMDB":"nm1151899"},"actorId":"nm1151899","character":"Tony Dalton","urlCharacter":"http://www.imdb.com/character/ch0100604","main":true},{"actorName":"Alex Carter","urlProfile":"http://www.imdb.com/name/nm0141450","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2MzU4MjMzMF5BMl5BanBnXkFtZTgwMDcxMzUyNzE@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 November 1964","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Alex Apostolopoulos","height":"6' (1.83 m)","bio":"Al grew up in Toronto, Canada and went to high school at Lawrence Park Collegiate Institute. After graduation, he followed his dream and left for Hollywood where he studied at The Beverly Hills Playhouse. He then returned to Canada to pursue his acting career where things took off and he appeared in several series and movies. He is now married with two or three girls. He moved back to the states a few years ago and is actively pursuing his career. He now lives in Santa Monica with his family and can be frequently seen running and biking along the beach.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2MzU4MjMzMF5BMl5BanBnXkFtZTgwMDcxMzUyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0141450","name":"Alex Carter","idIMDB":"nm0141450"},"actorId":"nm0141450","character":"Cabot","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Antoni Corone","urlProfile":"http://www.imdb.com/name/nm0139175","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4OTYyNzIwNl5BMl5BanBnXkFtZTcwNDI3NDkyOA@@._V1_UY44_CR9,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"When character actor Antoni Corone launched his screen career in the mid-'80s, producers immediately foresaw a perfect niche for him, and started casting him as rugged, slightly imposing and domineering types -- including club bouncers, security personnel, military men and officers of the law. He bowed with a slate of roles in 1986, including the telefilm Charley Hannah (1986), and eventually graduated to big-screen character actor with bit parts in such A-list Hollywood features as Blood and Wine (1996), Striptease (1996), Bad Boys II (2003) and Out of Time (2003). Corone rose to higher billing with a supporting turn in the Joaquin Phoenix / Mark Wahlberg crime saga We Own the Night (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4OTYyNzIwNl5BMl5BanBnXkFtZTcwNDI3NDkyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0139175","name":"Antoni Corone","idIMDB":"nm0139175"},"actorId":"nm0139175","character":"Deputy Baste","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Terry Loughlin","urlProfile":"http://www.imdb.com/name/nm0521761","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NDIyNjI1NV5BMl5BanBnXkFtZTYwMTE4MDEz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Terry Loughlin is an actor, known for October Sky (1999), Out of Time (2003) and The Punisher (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NDIyNjI1NV5BMl5BanBnXkFtZTYwMTE4MDEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0521761","name":"Terry Loughlin","idIMDB":"nm0521761"},"actorId":"nm0521761","character":"Agent Stark","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nora Dunn","urlProfile":"http://www.imdb.com/name/nm0004887","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNTkwNTY1M15BMl5BanBnXkFtZTcwMDg4MjQ4OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1952","placeOfBirth":" Chicago, Illinois, USA","height":"5' 5\" (1.65 m)","bio":"Nora Dunn got her start working at the famous Second City comedy troupe, where she was eventually spotted by Saturday Night Live (1975) casting directors, and she joined the SNL cast (among them Joan Cusack, Robert Downey Jr., Anthony Michael Hall, Jon Lovitz, Dennis Miller, Randy Quaid, Terry Sweeney, Danitra Vance, A. Whitney Brown and Al Franken) in the era that is generally considered the \"Dark Years\" in the history of SNL. Dunn graduated from the Art institute of Chicago and also studied at the Jean Sheldon Acting Workshop in San Francisco. In addition to her roles on television and film, she performs her critically acclaimed one-woman show in theaters around the country. She recently completed a screenplay that she will direct and is the author of a book, \"Nobody's Rib\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNTkwNTY1M15BMl5BanBnXkFtZTcwMDg4MjQ4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004887","name":"Nora Dunn","idIMDB":"nm0004887"},"actorId":"nm0004887","character":"Dr. Donovan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Murtaugh","urlProfile":"http://www.imdb.com/name/nm0615428","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NzY5ODU3Nl5BMl5BanBnXkFtZTcwMTE0MDQzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 October 1942","placeOfBirth":" Chicago, Illinois, USA","birthName":"James Francis Murtaugh","bio":"James Murtaugh was born on October 28, 1942 in Chicago, Illinois, USA as James Francis Murtaugh. He is an actor, known for How to Lose a Guy in 10 Days (2003), Vanilla Sky (2001) and Out of Time (2003). He has been married to Alice Heid since May 15, 1971. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NzY5ODU3Nl5BMl5BanBnXkFtZTcwMTE0MDQzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0615428","name":"James Murtaugh","idIMDB":"nm0615428"},"actorId":"nm0615428","character":"Dr. Frieland","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peggy Sheffield","urlProfile":"http://www.imdb.com/name/nm0790798","urlPhoto":"","biography":{"bio":"Peggy Sheffield is an actress and producer, known for Jeepers creepers - Le chant du diable (2001), Out of Time (2003) and Burning Bright (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0790798","name":"Peggy Sheffield","idIMDB":"nm0790798"},"actorId":"nm0790798","character":"Judy Anderson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Evelyn Brooks","urlProfile":"http://www.imdb.com/name/nm0111980","urlPhoto":"","biography":{"bio":"Evelyn Brooks was an actress and producer, known for Out of Time (2003), All About the Benjamins (2002) and The Crew (2000). She died on September 16, 2005 in Florida, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0111980","name":"Evelyn Brooks","idIMDB":"nm0111980"},"actorId":"nm0111980","character":"Judy's Mom","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eric Hissom","urlProfile":"http://www.imdb.com/name/nm1470183","urlPhoto":"","biography":{"bio":"Eric Hissom is an actor, known for Out of Time (2003), Macbeth: Folger Shakespeare Library Edition (2009) and Sheena (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1470183","name":"Eric Hissom","idIMDB":"nm1470183"},"actorId":"nm1470183","character":"Hotel Clerk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Hillmann","urlProfile":"http://www.imdb.com/name/nm0385092","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzEzODY0MDg3Nl5BMl5BanBnXkFtZTcwMjU2MTQ2OQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Los Angeles Drama Critics Circle Award winner, Tom Hillmann recurs on the CW's \"Star-Crossed\" as series regular, Grey Damon's father. A native New Yorker, Tom grew up on the sunny shores of the Atlantic coast, went to college in the heartland, then ventured west to Los Angeles. Early in his career while trying to break into the business, he supported himself with odd jobs including painting address numbers on street curbs, playing a Power Ranger at children's parties, and even endured a short stint as a drug test specimen taker. Hillmann studied with Peabody Award-winning director, Don Richardson at UCLA for a semester then was invited to his private class where he studied for several years. His recurring guest star role opposite David Caruso in \"CSI: Miami\" originated in the pilot cross-over episode in the original \"CSI: Crime Scene Investigation\" directed by Danny Cannon. Other TV credits include \"Army Wives\" (recurring as Dr. Adam Harwood,) \"Burn Notice,\" \"One Tree Hill,\" \"K-Ville,\" and \"Recount.\" In Los Angeles he has performed in numerous Equity theatre productions including lead roles in \"She Loves Me,\" \"Guys & Dolls,\" \"The 1940'S Radio Hour,\" \"Fiddler on the Roof,\" \"Into the Woods,\" \"See How They Run,\" \"A Christmas Carol,\" and \"The Traveling Lady.\" He is married with three children and enjoys traveling, the arts, and pursuing a healthy lifestyle.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzEzODY0MDg3Nl5BMl5BanBnXkFtZTcwMjU2MTQ2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0385092","name":"Tom Hillmann","idIMDB":"nm0385092"},"actorId":"nm0385092","character":"Living Gift Salesman","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0313443","urlIMDB":"http://www.imdb.com/title/tt0313443","business":{"budget":{"money":"$50,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$16,185,316","country":"USA","day":"05","month":"10","year":"2003","remarks":"3,076 Screens"},{"money":"£311,508","country":"UK","day":"28","month":"12","year":"2003","remarks":"236 Screens"},{"money":"€397,228","country":"Italy","day":"20","month":"06","year":"2004","remarks":"239 Screens"},{"money":"€83,686","country":"Netherlands","day":"23","month":"05","year":"2004","remarks":"30 Screens"}],"gross":[{"money":"$40,905,277","country":"USA","day":"30","month":"11","year":"2003","remarks":""},{"money":"$40,766,941","country":"USA","day":"23","month":"11","year":"2003","remarks":""},{"money":"$40,535,446","country":"USA","day":"16","month":"11","year":"2003","remarks":""},{"money":"$40,092,217","country":"USA","day":"09","month":"11","year":"2003","remarks":""},{"money":"$39,314,901","country":"USA","day":"02","month":"11","year":"2003","remarks":""},{"money":"$37,784,098","country":"USA","day":"26","month":"10","year":"2003","remarks":""},{"money":"$35,230,719","country":"USA","day":"19","month":"10","year":"2003","remarks":""},{"money":"$28,711,637","country":"USA","day":"12","month":"10","year":"2003","remarks":""},{"money":"$16,185,316","country":"USA","day":"05","month":"10","year":"2003","remarks":""},{"money":"£1,293,993","country":"UK","day":"11","month":"01","year":"2004","remarks":""},{"money":"£311,508","country":"UK","day":"28","month":"12","year":"2003","remarks":""},{"money":"€1,788,316","country":"Italy","day":"22","month":"08","year":"2004","remarks":""},{"money":"€1,553,659","country":"Italy","day":"25","month":"07","year":"2004","remarks":""},{"money":"€1,444,227","country":"Italy","day":"18","month":"07","year":"2004","remarks":""},{"money":"€1,321,761","country":"Italy","day":"11","month":"07","year":"2004","remarks":""},{"money":"€1,123,435","country":"Italy","day":"04","month":"07","year":"2004","remarks":""},{"money":"€397,228","country":"Italy","day":"20","month":"06","year":"2004","remarks":""},{"money":"€127,967","country":"Netherlands","day":"23","month":"05","year":"2004","remarks":""}],"weekendGross":[{"money":"$79,200","country":"USA","day":"30","month":"11","year":"2003","remarks":"155 Screens"},{"money":"$151,316","country":"USA","day":"23","month":"11","year":"2003","remarks":"260 Screens"},{"money":"$270,459","country":"USA","day":"16","month":"11","year":"2003","remarks":"351 Screens"},{"money":"$451,422","country":"USA","day":"09","month":"11","year":"2003","remarks":"506 Screens"},{"money":"$1,082,591","country":"USA","day":"02","month":"11","year":"2003","remarks":"1,096 Screens"},{"money":"$1,541,684","country":"USA","day":"26","month":"10","year":"2003","remarks":"1,565 Screens"},{"money":"$4,002,023","country":"USA","day":"19","month":"10","year":"2003","remarks":"2,344 Screens"},{"money":"$8,590,001","country":"USA","day":"12","month":"10","year":"2003","remarks":"3,076 Screens"},{"money":"$16,185,316","country":"USA","day":"05","month":"10","year":"2003","remarks":"3,076 Screens"},{"money":"£144,320","country":"UK","day":"11","month":"01","year":"2004","remarks":"189 Screens"},{"money":"£311,508","country":"UK","day":"28","month":"12","year":"2003","remarks":"236 Screens"},{"money":"€14,762","country":"Italy","day":"22","month":"08","year":"2004","remarks":"20 Screens"},{"money":"€73,837","country":"Italy","day":"25","month":"07","year":"2004","remarks":"40 Screens"},{"money":"€61,040","country":"Italy","day":"18","month":"07","year":"2004","remarks":"55 Screens"},{"money":"€98,472","country":"Italy","day":"11","month":"07","year":"2004","remarks":"92 Screens"},{"money":"€83,686","country":"Netherlands","day":"23","month":"05","year":"2004","remarks":"30 Screens"}],"admissions":[{"money":"63,710","country":"Germany","day":"14","month":"03","year":"2004","remarks":""}],"productionDates":{"money":null,"country":null,"day":"03","month":"06","year":"2002","remarks":null},"filmingDates":[{"money":null,"country":null,"day":"04","month":"06","year":"2002","remarks":null},null],"copyrightHolder":"© 2003 Metro-Goldwyn-Mayer Pictures Inc. (on print)"},"technical":{"runtime":["1 hr 45 min (105 min)","1 hr 54 min (114 min) (Toronto International) (Canada)"],"soundMix":["DTS","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA (prints)","EFILM Digital Laboratories, Hollywood (CA), USA (digital intermediate)","FotoKem Laboratory, Burbank (CA), USA"],"filmLength":["2,889 m (Sweden)"],"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"6.5","metascore":"63","filmingLocations":[{"location":"Boca Grande, Florida, USA"}],"rated":"PG-13","awards":[{"award":"American Black Film Festival 2004","titlesAwards":[{"titleAwardOutcome":"Won Best Performance by an Actress","categories":[{"category":"","names":[{"name":"Sanaa Lathan","id":"nm0005125","role":null}]}]}]},{"award":"BET Awards 2004","titlesAwards":[{"titleAwardOutcome":"Won BET Award","categories":[{"category":"Best Actor","names":[{"name":"Denzel Washington","id":"nm0000243","role":null}]}]},{"titleAwardOutcome":"Nominated BET Award","categories":[{"category":"Best Actress","names":[{"name":"Sanaa Lathan","id":"nm0005125","role":null}]}]}]},{"award":"Black Reel Awards 2004","titlesAwards":[{"titleAwardOutcome":"Won Black Reel","categories":[{"category":"Film: Best Actress","names":[{"name":"Sanaa Lathan","id":"nm0005125","role":null}]},{"category":"Best Film","names":[{"name":"Jesse Beaton","id":"nm0064106","role":null},{"name":"Neal H. Moritz","id":"nm0605775","role":null},{"name":"Damien Saccani","id":"nm1150777","role":null}]}]},{"titleAwardOutcome":"Nominated Black Reel","categories":[{"category":"Film: Best Actor","names":[{"name":"Denzel Washington","id":"nm0000243","role":null}]},{"category":"Film: Best Director","names":[{"name":"Carl Franklin","id":"nm0002083","role":null}]}]}]},{"award":"Image Awards 2004","titlesAwards":[{"titleAwardOutcome":"Nominated Image Award","categories":[{"category":"Outstanding Actor in a Motion Picture","names":[{"name":"Denzel Washington","id":"nm0000243","role":null}]},{"category":"Outstanding Supporting Actress in a Motion Picture","names":[{"name":"Sanaa Lathan","id":"nm0005125","role":null}]}]}]},{"award":"Teen Choice Awards 2004","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Breakout Movie Star - Female","names":[{"name":"Eva Mendes","id":"nm0578949","role":null},{"name":"2 Fast 2 Furious","id":"tt0322259","role":null},{"name":"Once Upon a Time in Mexico","id":"tt0285823","role":null},{"name":"Stuck on You","id":"tt0338466","role":null}]}]}]},{"award":"World Stunt Awards 2004","titlesAwards":[{"titleAwardOutcome":"Nominated Taurus Award","categories":[{"category":"Best High Work","names":[{"name":"Troy Brown","id":"nm0114840","role":null},{"name":"Robert Powell","id":"nm0667600","role":null}]}]}]}],"votes":"47,830","type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"},{"idCompany":"co0011134","name":"Original Film"},{"idCompany":"co0012893","name":"Monarch Pictures"}],"keywords":{"keywords":["florida","insurance","cancer","small town","life insurance policy","adultery","terminal cancer","miami florida","beneficiary","arson","police chief","briefcase of money","extramarital affair","crush phone with foot","shot in the leg","saved at the last second","woman kills a man","woman shoots a man","wife kills husband","wife shoots husband","escape out a window","escape through a bathroom window","grazed by a bullet","product placement","fight to the death","falling to death","husband wife relationship","hotel room","plainclothes officer","falling off a balcony","briefcase","squadroom","police investigation","555 phone number","eyewitness","composite sketch","cash","gps","tampering with evidence","telephone records","cellphone","pretend telephone call","marital separation","homicide detective","female police detective","obstruction of justice","life insurance beneficiary","wife beater","house on fire","character appears on front page of a newspaper","character appears in newspaper","33 year old","sexual role playing","months to live","2000s","title based on song","three word title","sex in bed","woman shot","interracial marriage","female gunfighter","gunfight","shootout","antihero","kiss","kissing while having sex","main character shot","violence","suspense","final showdown","revolver","beretta","six shooter","pistol","fistfight","police shootout","police chase","hotel fight","hotel","foot chase","neo noir","false accusation","burned body","falling from height","temptation","romantic triangle","quarterback","police artist","pen","morgue","morgue attendant","insurance fraud","florida keys","fishing","fingerprint","femme fatale","federal prosecutor","fax machine","ex husband ex wife relationship","embezzlement","duplicity","double cross","domestic violence","deus ex machina","cadaver","betrayal","burnt body","black cop","framed for murder","frame up","faked death","murder","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:32:12"}}