{"data":{"movies":[{"title":"The Heart Is Deceitful Above All Things","originalTitle":"","year":"2004","releaseDate":"20050119","directors":[{"name":"Asia Argento","id":"nm0000782"}],"writers":[{"name":"Laura Albert","id":"nm1380711"},{"name":"Asia Argento","id":"nm0000782"}],"runtime":"97 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWMyM2RhNzItYTdkYS00YWVkLWFhNWItZDgyZjNkZWIwNjg4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA","UK","France","Japan"],"languages":["English"],"genres":["Drama"],"plot":"The dysfunctional twenty-three-year-old Sarah takes her six-year-old natural son Jeremiah from the home of his beloved foster parents with the support of the social service to live with her. Along the years, the boy shares her insane and low lifestyle and is introduced to booze and drugs and mentally, physically and sexually abused by Sarah, her lovers and her religiously fanatic family.","simplePlot":"Seven-year-old Jeremiah is pulled from his foster home and thrown into a troubled life on the road with his teenage mother, Sarah.","actors":[{"actorName":"Asia Argento","urlProfile":"http://www.imdb.com/name/nm0000782","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MzkyNzY2NF5BMl5BanBnXkFtZTcwMjkwMDg2Ng@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 September 1975","placeOfBirth":" Rome, Lazio, Italy","birthName":"Asia Aria Maria Vittoria Rossa Argento","height":"5' 6\" (1.68 m)","bio":"Asia Argento was born in Rome, Italy, into a family of actors and filmmakers, both occupations which she has herself pursued. She made her debut when she was only nine years old in Sergio Citti's Sogni e bisogni (1985). In 1988 she had the leading role in Cristina Comencini's first film, Zoo, l'appel de la nuit (1988), and was part of the cast of The Church (1989), directed by Michele Soavi. The following year she played Nanni Moretti's daughter in Palombella rossa (1989) (also directed by Moretti). It was with Close Friends (1992), written and directed by Michele Placido, that Asia's career really took off and she was able to move on from playing very young girls to more mature, complex roles. The movie was well-received at the Cannes International Film Festival. In Trauma (1993), she worked for the first time with her father, famed Italian horror director Dario Argento (her mother is one of Argento's favorite actresses, Daria Nicolodi, playing an anorexic girl in search of her parents' killer. The Phantom of the Opera (1998) is the third film she has made with her father, the others being Trauma (1993) (filmed in the US) and Le syndrome de Stendhal (1996). Asia's absorbed, intense style of acting was well-used in Giuseppe Piccioni's Condannato a nozze (1993). In 1993 she co-starred in Carlo Verdone's Perdiamoci di vista (1994) in which she played Arianna, a physically disabled girl--an intricate, difficult role that won her the David di Donatello for best actress (1993-1994). She also had a featured role in the international cast of Queen Margot (1994), directed by Patrice Chéreau. In 1995 she worked with Michel Piccoli in Peter Del Monte's Traveling Companion (1996), which again won her a David di Donatello and a Grolla d'oro. In 1994 Asia turned her hand to directing and turned out two short films: \"Prospettive\" (an episode of the film DeGenerazione (1994)) and \"A ritroso\". In 1996 she directed a documentary on her father and, in 1998, one on cult director Abel Ferrara, Abel/Asia (1998), which won an award at the Rome Film Festival. In 1999 Asia made her feature-directing debut with Scarlet Diva (2000), in which she was the leading actress and author of the screenplay. The film was released in May 2000 in Italy and the rest of the world. It won an award at the Williamsburg Film Festival in Brooklyn, New York. In 2001, after directing a number of music videos, she gave birth to her first daughter, Anna Lou. In 2002 she starred in The Red Siren (2002) by Olivier Megaton with Jean-Marc Barr and the action thriller xXx (2002), directed by Rob Cohen, with Vin Diesel. Asia is also the author of a number of short stories published in many prestigious magazines such as \"Dynamo,\" \"L'Espresso,\" \"Sette,\" and \"Village,\" Her first novel, \"I Love You, Kirk,\" was published in Italy by Frassinelli Editrice in October 1999 and in France by Florent Massot in 2001.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MzkyNzY2NF5BMl5BanBnXkFtZTcwMjkwMDg2Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000782","name":"Asia Argento","nicknames":["Az","Silver Gems","Asiaargento23"],"idIMDB":"nm0000782"},"actorId":"nm0000782","character":"Sarah","urlCharacter":"http://www.imdb.com/character/ch0172871","main":true},{"actorName":"Jimmy Bennett","urlProfile":"http://www.imdb.com/name/nm1497548","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NjQwNjA0Ml5BMl5BanBnXkFtZTcwNDU1NTkzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1996","placeOfBirth":" Seal Beach, California, USA","birthName":"James Michael Bennett","height":"5' 7\" (1.7 m)","bio":"James 'Jimmy' Bennett was born on February 9, 1996 in Seal Beach, California. He has appeared in guest starring roles on The Guardian (2001), Judging Amy (1999), CSI: Crime Scene Investigation (2000) and recently Everwood (2002), and has been cast in some of the most successful productions in that decade. At age six Jimmy said he wanted to be on TV. This aspiration soon came true when he began booking commercials, doing nine in two years; major motion pictures weren't far from reality now. Jimmy has also enjoyed doing voice-over roles, a fun aspect of the television and movie industry. He has lent his voice to Rerun in I Want a Dog for Christmas, Charlie Brown (2003), Roo in Winnie the Pooh: Springtime with Roo (2004), Lonely Boy in The Polar Express (2004) and repeated as the voice of Roo, this time for Pooh's Heffalump Movie (2005). Jimmy completed Hostage (2005), a crime thriller starring Bruce Willis, and The Amityville Horror (2005), an update to the 1979 horror classic.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NjQwNjA0Ml5BMl5BanBnXkFtZTcwNDU1NTkzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1497548","name":"Jimmy Bennett","nicknames":["JB","Jimmy Two-Takes"],"idIMDB":"nm1497548"},"actorId":"nm1497548","character":"Young Jeremiah","urlCharacter":"http://www.imdb.com/character/ch0040406","main":true},{"actorName":"Kara Kemp","urlProfile":"http://www.imdb.com/name/nm1470802","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyNDg1MDExNl5BMl5BanBnXkFtZTcwNTM4ODgyMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Kara Kemp is an actress, known for The Heart Is Deceitful Above All Things (2004) and The Sleep Seeker (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyNDg1MDExNl5BMl5BanBnXkFtZTcwNTM4ODgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1470802","name":"Kara Kemp","idIMDB":"nm1470802"},"actorId":"nm1470802","character":"Social Worker #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brent Almond","urlProfile":"http://www.imdb.com/name/nm1471590","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwODMzOTU2MF5BMl5BanBnXkFtZTgwODMxMjExOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Brent Almond is known for his work on Masterminds (2016), High Noon and I'll Sleep When I'm Dead (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwODMzOTU2MF5BMl5BanBnXkFtZTgwODMxMjExOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1471590","name":"Brent Almond","idIMDB":"nm1471590"},"actorId":"nm1471590","character":"Cop #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Dwyer","urlProfile":"http://www.imdb.com/name/nm0245486","urlPhoto":"","biography":{"bio":"David Dwyer is an actor, known for The Blind Side (2009), October Sky (1999) and Remember the Titans (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0245486","name":"David Dwyer","idIMDB":"nm0245486"},"actorId":"nm0245486","character":"Cop #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kip Pardue","urlProfile":"http://www.imdb.com/name/nm0661164","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGY4OTY0ZjAtMDhjMS00NzJkLTk2MDMtMjgwZjkzNTcwYmIwL2ltYWdlXkEyXkFqcGdeQXVyMjI0MjQ0Mzc@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 September 1975","placeOfBirth":" Atlanta, Georgia, USA","birthName":"Kevin Ian Pardue","height":"6' 2\" (1.88 m)","bio":"Kip Pardue was born in Atlanta, Georgia on September 23, 1975. He grew up playing football and baseball and graduated from Dunwoody High School, located in Atlanta, Georgia in 1994. The next year he was recruited to play football by Yale University. He graduated in 1998 with a degree in Economics. Kip headed west afterwards and enjoyed a successful career as a model for Abercrombie & Fitch and Polo. Soon after he next turned to acting and landed TV roles on 7th Heaven (1996) and was cast as Josh Ford on the WB Hit Popular (1999) before the role was later re-cast. After making his film debut in the racy independent flick But I'm a Cheerleader (1999) and later Whatever It Takes (2000), Kip got his big break with his role in Remember the Titans (2000) with Denzel Washington. He then starred as Sylvester Stallone's Indy racing protégé in Driven (2001). Soon afterwards, Kip was named by Armani Exchange as one of the \"Top 10 Upcoming Actors\" and Variety claimed he was one of the \"10 to Watch\" for this year. With several new movies due out later, including The Rules of Attraction (2002), based on the Bret Easton Ellis novel, you can be sure his face won't be disappearing from the screen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGY4OTY0ZjAtMDhjMS00NzJkLTk2MDMtMjgwZjkzNTcwYmIwL2ltYWdlXkEyXkFqcGdeQXVyMjI0MjQ0Mzc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0661164","name":"Kip Pardue","idIMDB":"nm0661164"},"actorId":"nm0661164","character":"Luther","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeremy Renner","urlProfile":"http://www.imdb.com/name/nm0719637","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk2NDc2ODgzMF5BMl5BanBnXkFtZTcwMTMzOTQ4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1971","placeOfBirth":" Modesto, California, USA","birthName":"Jeremy Lee Renner","height":"5' 9\" (1.75 m)","bio":"Jeremy Lee Renner was born in Modesto, California, the son of Valerie (Tague) and Lee Renner, who managed a bowling alley. After a tumultuous yet happy childhood with his four younger siblings, Renner graduated from Beyer High School and attended Modesto Junior College. He explored several areas of study, including computer science, criminology, and psychology, before the theater department, with its freedom of emotional expression, drew him in. However, Renner recognized the potential in acting as much through the local police academy as through drama classes. During his second year at Modesto Junior College, Renner role-played a domestic disturbance perpetrator as part of a police-training exercise for an easy $50. Deciding to shift his focus away from schoolwork, Renner left college and moved to San Francisco to study at the American Conservatory Theater. From there he moved to Hawaii and, in 1993, to Los Angeles. In Los Angeles, Renner devoted himself to theater, most notably starring in and co-directing the critically acclaimed \"Search and Destroy.\" He pursued other projects during this time as well, landing his first film role in 1995's Alarme totale (1995). After several commercials and supporting roles in television movies and series, Renner captured the attention of critics with his gripping, complex portrayal of the infamous serial killer in the 2002 film Dahmer (2002). Renner's performance, which earned him an Independent Spirit Award nomination, is especially remarkable for painting a humane and sympathetic, yet deeply disturbing, portrait of the title character. In 2003, Renner took a break from small indie films to work on his first commercially successful movie, S.W.A.T. (2003), with Colin Farrell. In 2005, he played the leading role in Neo Ned (2005) as an institutionalized white supremacist in love with a black girl, winning the Palm Beach International Film Festival's best actor award. Renner's pivotal supporting roles in 2005's 12 and Holding (2005) and North Country (2005) earned him accolades from critics, and his 2007 turn in Take (2007) garnered him the best actor award at California's Independent Film Festival. Also in 2007, Renner played a leading role in the horror film 28 Weeks Later (2007) as well as a supporting role in the underrated Western epic The Assassination of Jesse James by the Coward Robert Ford (2007), with Casey Affleck, Brad Pitt, and Sam Rockwell. Renner's depiction of Jeffrey Dahmer in 2002 caught the attention of director Kathryn Bigelow, and, in 2008, she cast him in his most famous role as Sergeant First Class William James in The Hurt Locker (2008). Renner's performance as a single-minded bomb specialist scored him an Academy Award nomination for best actor. He also earned best actor nominations from the Independent Spirit Awards, the Screen Actors Guild, and the BAFTA Awards, as well as wins in this category from several film critics groups. In 2009, Renner starred in the short-lived TV series, The Unusuals (2009), and in 2010 he played the chilling but loyal criminal Jem in Ben Affleck bank-heist thriller The Town (2010). In the fall of 2010, Renner began filming Mission: Impossible - Ghost Protocol (2011). He has also since starred in The Avengers (2012), American Hustle (2013), and Kill the Messenger (2014). Renner's strengths as an actor derive not only from his expressive eyes but also from his ability to thoroughly embody the characters he portrays. His visceral depiction of these individuals captivates audiences and empowers him to steal scenes in many of his films, even when playing a minor role. Renner gravitates toward flawed, complicated, three-dimensional characters that allow him to explore new territory within himself. In addition to his work as an actor, Renner continues to cultivate his lifelong love of music. A singer, songwriter, and musician, he performed with the band Sons of Ben early in his career. Scenes in Love Comes to the Executioner (2006), North Country (2005), and The Assassination of Jesse James by the Coward Robert Ford (2007) briefly showcase Renner's singing talents. Despite traveling the world for film roles and, recently, as a United Nations Goodwill Peace Ambassador to raise awareness for mine-clearing efforts in Afghanistan, Renner remains close to his roots. In 2010, Modesto Junior College presented him the Distinguished Alumnus award in recognition of his body of work as an actor. He also headlined at a benefit for Modesto's Gallo Center for the Arts in the fall of 2010. Renner maintains a sense of humility and gratitude, even in the wake of his recent successes and recognition. He keeps himself grounded by renovating and restoring old and rundown iconic Hollywood homes, an enterprise he began back in his early days in Los Angeles. He values loyalty and a sense of both age and history, and enjoys the opportunity to help conserve these qualities in a town that favors the young and the new.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk2NDc2ODgzMF5BMl5BanBnXkFtZTcwMTMzOTQ4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0719637","name":"Jeremy Renner","nicknames":["Renni"],"idIMDB":"nm0719637"},"actorId":"nm0719637","character":"Emerson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Brian Alley","urlProfile":"http://www.imdb.com/name/nm0021289","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzk3MTAxNl5BMl5BanBnXkFtZTgwMjk1ODQyODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1965","placeOfBirth":" Knoxville, Tennessee, USA","height":"5' 11\" (1.8 m)","bio":"David Brian Alley is an actor known for Prison-Break-In (2015), Something, Anything (2014) and The Heart is Deceitful Above All Things (2004). He holds a BA and an MFA in Theatre Performance from The University of Tennessee, Knoxville, and an AA in Acting from The American Academy of Dramatic Arts West. David has appeared in over 40 productions with the Clarence Brown Theatre Company. He has also performed at PlayMaker's Repertory Company, The Mark Taper Forum, and The iO Theatre in Chicago. He was born and raised in Knoxville, Tennessee. He has two children, Devin, 9, and Caroline, 7.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzk3MTAxNl5BMl5BanBnXkFtZTgwMjk1ODQyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0021289","name":"David Brian Alley","idIMDB":"nm0021289"},"actorId":"nm0021289","character":"Doctor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lydia Lunch","urlProfile":"http://www.imdb.com/name/nm0526120","urlPhoto":"","biography":{"dateOfBirth":"2 June 1959","placeOfBirth":" Rochester, New York, USA","birthName":"Lydia Koch","bio":"Lydia Lunch was born on June 2, 1959 in Rochester, New York, USA as Lydia Koch. She is an actress, known for Fingered (1988), The Right Side of My Brain (1985) and The Heart Is Deceitful Above All Things (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0526120","name":"Lydia Lunch","idIMDB":"nm0526120"},"actorId":"nm0526120","character":"Social Worker #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ornella Muti","urlProfile":"http://www.imdb.com/name/nm0001560","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEwODQ0NTk0Nl5BMl5BanBnXkFtZTcwNTU3OTc1Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 March 1955","placeOfBirth":" Rome, Lazio, Italy","birthName":"Francesca Romana Rivelli","height":"5' 6¼\" (1.68 m)","bio":"Ornella Muti was born on March 9, 1955 in Rome, Lazio, Italy as Francesca Romana Rivelli. She is an actress, known for Flash Gordon (1980), Conte de la folie ordinaire (1981) and Trilogy: Two (2002). She was previously married to Federico Fachinetti and Alessio Orano.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEwODQ0NTk0Nl5BMl5BanBnXkFtZTcwNTU3OTc1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001560","name":"Ornella Muti","idIMDB":"nm0001560"},"actorId":"nm0001560","character":"Grandmother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dylan Sprouse","urlProfile":"http://www.imdb.com/name/nm0819851","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWE2YzEwOTktMzNhYS00OWViLThlZmItY2E0MjMwYjFlOTAwXkEyXkFqcGdeQXVyNjIyNzI4NDg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 August 1992","placeOfBirth":" Arezzo, Tuscany, Italy","birthName":"Dylan Thomas Sprouse","height":"5' 11\" (1.8 m)","bio":"Dylan Sprouse was born August 4, 1992, in Arezzo, Italy, to American parents, Melanie (Wright) and Matthew Sprouse. Sprouse has acted from the young age of six months and still acts to this day, residing in NYC after receiving his bachelors degree from NYU. Along with acting, Dylan owns a meadery and bar in Williamsburg, Brooklyn, serving as the master brewer of the business.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWE2YzEwOTktMzNhYS00OWViLThlZmItY2E0MjMwYjFlOTAwXkEyXkFqcGdeQXVyNjIyNzI4NDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0819851","name":"Dylan Sprouse","idIMDB":"nm0819851"},"actorId":"nm0819851","character":"Older Jeremiah","urlCharacter":"http://www.imdb.com/character/ch0040406","main":true},{"actorName":"Cole Sprouse","urlProfile":"http://www.imdb.com/name/nm0819850","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTgyODk1ODM1Ml5BMl5BanBnXkFtZTgwMjYwOTUxODE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 August 1992","placeOfBirth":" Arezzo, Tuscany, Italy","birthName":"Cole Mitchell Sprouse","height":"6' (1.83 m)","bio":"Cole Sprouse was born in Arezzo, Italy, to American parents, Melanie (Wright) and Matthew Sprouse. Cole began his acting career alongside his identical twin brother at the tender age of six months. From 1993 to 1998 the twins shared the role of Patrick Kelly, on ABC's hit series Grace Under Fire (1993), soon booking Julian in Adam Sandler's box office hit, Big Daddy (2000). During that same month, their second feature film, The Astronaut's Wife (1999), starring Johnny Depp and Charlize Theron, was also released. Cole appeared without his brother on the NBC series Friends (1994), portraying Ross's son, Ben Gellar, and, in the fall of 2003, both Cole and his brother again shared a lead role of Jeremiah in The Heart Is Deceitful Above All Things (2004). There following, Cole began starring alongside his twin in his own half-hour sitcom, The Suite Life of Zack and Cody (2005) on the Disney Channel. After wrapping his sixth year of the Disney program Cole chose to attend university at NYU, remaining absent from entertainment until he finished his education in 2015. Having graduated with honors, Cole returned and soon booked the role of Jughead in _\"Riverdale\" (2017)_ (gv).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTgyODk1ODM1Ml5BMl5BanBnXkFtZTgwMjYwOTUxODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0819850","name":"Cole Sprouse","idIMDB":"nm0819850"},"actorId":"nm0819850","character":"Older Jeremiah","urlCharacter":"http://www.imdb.com/character/ch0040406","main":true},{"actorName":"Peter Fonda","urlProfile":"http://www.imdb.com/name/nm0001228","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg4NTE5MTEwNl5BMl5BanBnXkFtZTgwMTQ0NDk3MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 February 1940","placeOfBirth":" New York City, New York, USA","birthName":"Peter Henry Fonda","height":"6' 2½\" (1.89 m)","bio":"Peter Henry Fonda was born in New York City, to legendary screen star Henry Fonda and New York socialite Frances Seymour Brokaw. He is the brother of actress Jane Fonda and the father of actress Bridget Fonda. His ancestry includes Dutch, English, Scottish, and distant French and Italian. Fonda made his professional stage debut on Broadway in 1961 in Blood, Sweat and Stanley Poole, for which he received rave reviews from the New York Critics, and won the Daniel Blum Theater World Award and the New York Critics Circle Award for Best New Actor. He began his feature film career in 1963, playing the romantic lead in Tammy and the Doctor and joined the ensemble cast of the World War II saga The Victors. Shortly thereafter, Fonda began what would become a famous association with Roger Corman, starring in Wild Angels, as the ultra-cool, iron-fisted leader of a violent biker gang, opposite Nancy Sinatra, Bruce Dern, and Diane Ladd. Fonda also starred in Corman's 1967 psychedelic film The Trip, also starring Dern and Susan Strasberg. Fonda's next project was the seminal 1969 anti-establishment film Easy Rider which he produced and co-scripted, receiving an Academy Award nomination for Best Original Screenplay. Fonda's acting credits also include the feature films Outlaw Blues, an expose of the country music business; Dirty Mary, Crazy Larry; Race with the Devil; Robert Rossen's Lilith; Split Image; Robert Wise's Two People; and the cult films Love and a .45 and Nadja. He appeared in Grace of My Heart, directed by Alison Anders, and John Carpenter's Escape from L.A., starring Kurt Russell. He also made a cameo appearance in Bodies, Heat & Motion, which starred his daughter Bridget. Fonda wowed audiences and won critical acclaim for his portrayal of Ulee Jackson, the taciturn beekeeper in the 1997 film Ulee's Gold, earning him both a Golden Globe Award for Best Actor and the New York Film Critics Award, as well as an Oscar nomination. Following this, he published his autobiography, Don't Tell Dad, and was then seen in the NBC movie The Tempest, for which he had been nominated for another Golden Globe Award for Best Actor in a Mini-Series. Fonda then appeared with Helen Mirren in the Showtime telefilm The Passion of Ayn Rand, where he won the Golden Globe for outstanding supporting actor in a mini-series or movie made for television and was nominated for both an Emmy and SAG Award. Fonda co-starred in Steven Soderbergh's 1997 film The Limey, which also starred Terrence Stamp and Lesley Ann Warren. Following this he appeared in Thomas and the Magic Railroad for director Britt Allcroft, starring Alec Baldwin. Fonda directed his first feature film, The Hired Hand, in 1971. A critically acclaimed western in which he also starred, the film debuted with a restored version at the 2001 Venice Film Festival; it then screened at the Toronto Film Festival before reopening in theaters in 2003. Other directing credits include the science fiction feature Idaho Transfer, starring Keith Carradine and Wanda Nevada in which he starred as a gambler who wins Brooke Shields in a poker game. Fonda co-starred in HBO's The Laramie Project, based on the true story of openly gay college student Matthew Shepard, killed in an act of senseless violence and cruelty, which attracted national attention. Fonda starred in The Maldonado Miracle directed by Salma Hayek for Showtime Networks, and was nominated for a Daytime Emmy Award for his role. Fonda also starred opposite Kris Kristofferson in Wooly Boys, which was released in March 2004, and the television drama Back When We Were Grownups, opposite Blythe Danner and Faye Dunaway. Fonda was seen in Soderbergh's Ocean's Twelve and can be seen in Mark Steven Johnson's Ghost Rider, opposite Nicolas Cage. Fonda's other projects include director Ron Maxwell's Civil War-era drama Copperhead, alongside actors Billy Campbell and Angus MacFadyen and The Ultimate Gift directed by Michael Landon Jr. Up next, Fonda can be seen in John McNaughton's The Harvest with Samantha Morton and Michael Shannon.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg4NTE5MTEwNl5BMl5BanBnXkFtZTgwMTQ0NDk3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001228","name":"Peter Fonda","idIMDB":"nm0001228"},"actorId":"nm0001228","character":"Grandfather","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Robinson","urlProfile":"http://www.imdb.com/name/nm1440281","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwODI4MDc0OV5BMl5BanBnXkFtZTgwMDU2NjYzMDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 October 1985","placeOfBirth":" Portland, Oregon, USA","birthName":"John C. Robinson","height":"5' 10½\" (1.79 m)","bio":"Likes snowboarding and plays lacrosse for his school. He was chosen out of 3000 children to play in the controversial film by Gus Van Sant which mirrors the Columbine school shootings called Elephant (2003). John took acting classes in Portland years prior to his acting debut in this movie. Coming up next for John is Lords of Dogtown (2005) a film that follows the surf and skateboarding trends that originated in Venice, California during the 1970s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwODI4MDc0OV5BMl5BanBnXkFtZTgwMDU2NjYzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1440281","name":"John Robinson","idIMDB":"nm1440281"},"actorId":"nm1440281","character":"Aaron","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lindy Maguire","urlProfile":"http://www.imdb.com/name/nm2295460","urlPhoto":"","biography":{"bio":"Lindy Maguire is an actress, known for The Heart Is Deceitful Above All Things (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2295460","name":"Lindy Maguire","idIMDB":"nm2295460"},"actorId":"nm2295460","character":"Girl","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0368774","urlIMDB":"http://www.imdb.com/title/tt0368774","business":{"budget":null,"openingWeekend":[{"money":"$10,000","country":"USA","day":"12","month":"03","year":"2006","remarks":"2 Screens"},{"money":"€74,050","country":"Italy","day":"20","month":"02","year":"2005","remarks":"54 Screens"}],"gross":[{"money":"$29,058","country":"USA","day":"30","month":"03","year":"2006","remarks":""},{"money":"$26,092","country":"USA","day":"26","month":"03","year":"2006","remarks":""},{"money":"$19,174","country":"USA","day":"19","month":"03","year":"2006","remarks":""},{"money":"$10,000","country":"USA","day":"12","month":"03","year":"2006","remarks":""},{"money":"$176,153","country":"Worldwide","day":"27","month":"02","year":"2005","remarks":"except USA"},{"money":"€133,540","country":"Italy","day":"27","month":"02","year":"2005","remarks":""},{"money":"€74,050","country":"Italy","day":"20","month":"02","year":"2005","remarks":""}],"weekendGross":[{"money":"$5,408","country":"USA","day":"26","month":"03","year":"2006","remarks":"3 Screens"},{"money":"$4,026","country":"USA","day":"19","month":"03","year":"2006","remarks":"2 Screens"},{"money":"$10,000","country":"USA","day":"12","month":"03","year":"2006","remarks":"2 Screens"},{"money":"€22,481","country":"Italy","day":"27","month":"02","year":"2005","remarks":"22 Screens"},{"money":"€74,050","country":"Italy","day":"20","month":"02","year":"2005","remarks":"54 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"21","month":"09","year":"2003","remarks":null},{"money":null,"country":null,"day":"16","month":"11","year":"2003","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 38 min (98 min)","1 hr 37 min (97 min) (USA)","1 hr 37 min (97 min) (Mar del Plata) (Argentina)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["16 mm"],"cinematographicProcess":["Super 16"],"printedFilmFormat":["35 mm (blow-up)"]},"rating":"6.6","metascore":"27","filmingLocations":[{"location":"Knoxville, Tennessee, USA"}],"rated":"R","awards":[{"award":"Italian National Syndicate of Film Journalists 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Silver Ribbon","categories":[{"category":"Best Actress (Migliore Attrice Protagonista)","names":[{"name":"Asia Argento","id":"nm0000782","role":null}]}]}]},{"award":"Women Film Critics Circle Awards 2006","titlesAwards":[{"titleAwardOutcome":"Won WFCC Award","categories":[{"category":"Hall of Shame","names":[]}]}]}],"votes":"5,476","type":"Movie","companyCreditsSimple":[{"idCompany":"co0133310","name":"Above All Things Inc."},{"idCompany":"co0082283","name":"Artist Film"},{"idCompany":"co0106019","name":"Metro Tartan Distribution Ltd."}],"keywords":{"keywords":["prostitute","child molester","female nudity","boy dressed as girl","child abuse","mother son relationship","foster home","f rated","written and directed by cast member","title directed by female","long title","sex","rape","pedophile","innocence lost","hallucination","drug addiction","child rape","troubled teen","18 wheeler","truck stop","truck driver","tennessee","religion","meth lab","knoxville tennessee","grocery store","fire","cross dressing","christianity","bible","road trip","religious upbringing","child molestation","autobiographical","foster family","police","policeman","police officer","stripper","social worker","psychologist","nurse","grandmother","grandfather","exotic dancer","doctor","based on true story"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 18:24:30"}}