{"data":{"movies":[{"title":"Layer Cake","originalTitle":"","year":"2004","releaseDate":"20050603","directors":[{"name":"Matthew Vaughn","id":"nm0891216"}],"writers":[{"name":"J.J. Connolly","id":"nm1129753"},{"name":"J.J. Connolly","id":"nm1129753"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MTE1OTAzOV5BMl5BanBnXkFtZTcwNDc2OTgyMQ@@._V1.jpg","countries":["UK"],"languages":["English","Romanian"],"genres":["Crime","Drama","Thriller"],"plot":"A successful cocaine dealer, who has earned a respected place among England's Mafia elite, plans an early retirement from the business. However, big boss Jimmy Price hands down a tough assignment: find Charlotte Ryder, the missing rich princess daughter of Jimmy's old pal Edward, a powerful construction business player and gossip papers socialite. Complicating matters are two million pounds' worth of Grade A ecstasy, a brutal Serbian gang and a whole series of double crossings. The title \"LAYER CAKE\" refers to the layers or levels anyone in business goes through in rising to the top. What is revealed is a modern underworld where the rules have changed. There are no 'codes', or 'families' and respect lasts as long as a line. Not knowing who he can trust, he has to use all his 'savvy', 'telling' and skills which make him one of the best, to escape his own. The ultimate last job, a love interest called Tammy, and an international drug ring threaten to draw him back into the 'cake mix'. ...","simplePlot":"A successful cocaine dealer gets two tough assignments from his boss on the eve of his planned early retirement.","actors":[{"actorName":"Daniel Craig","urlProfile":"http://www.imdb.com/name/nm0185819","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjk4NDU4MF5BMl5BanBnXkFtZTcwMDMyNjQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 March 1968","placeOfBirth":" Chester, Cheshire, England, UK","birthName":"Daniel Wroughton Craig","height":"5' 10\" (1.78 m)","bio":"Daniel Craig, one of British theatre's most famous faces, who waited tables as a struggling teenage actor with the National Youth Theatre, went on to star as \"James Bond\" in Casino Royale (2006), Quantum of Solace (2008), Skyfall (2012) and Spectre (2015). He was born Daniel Wroughton Craig on March 2, 1968, at 41 Liverpool Road, Chester, Cheshire, England. His father, Timothy John Wroughton Craig, was a merchant seaman turned steel erector, and then became landlord of the \"Ring O' Bells\" pub in Frodsham, Cheshire. His mother, Carol Olivia (Williams), was an art teacher. Craig is of English, as well as Welsh, Scottish, and Irish, ancestry. His parents split up in 1972, and young Daniel was raised with his older sister, Lea, in Liverpool, then in Hoylake, Wirral, in the home of his mother. His interest in acting was encouraged by visits to the Liverpool Everyman Theatre arranged by his mother. From the age of 6, Craig started acting in school plays, making his debut in the Frodsham Primary School production of \"Oliver!\", and his mother was the driving force behind his artistic aspirations. The first Bond movie he ever saw at the cinema was Roger Moore's Live and Let Die (1973); young Daniel Craig saw it with his father, so it took a special place in his heart. He was also a good athlete and was a rugby player at Hoylake Rugby Club. At the age of 14, Craig played roles in \"Oliver\", \"Romeo and Juliet\" and \"Cinderella\" at Hilbre High School in West Kirby, Wirral, UK. He left Hilbre High at 16 to audition at the National Youth Theatre's (NYT) troupe on their tour in Manchester in 1984. He was accepted and moved down to London. There, his mother and father watched his stage debut as \"Agamemnon\" in Shakespeare's \"Troilus and Cressida\". As a struggling actor with the NYT, he was toiling in restaurant kitchens and as a waiter. Craig performed with NYT on tours to Valencia, Spain, and to Moscow, Russia, under the leadership of director Edward Wilson. He failed at repeated auditions at the Guildhall, but eventually his persistence paid off, and in 1988, he entered the Guildhall School of Music and Drama at the Barbican. There, he studied alongside Ewan McGregor and Alistair McGowan, then later Damian Lewis and Joseph Fiennes, among others. He graduated in 1991, after a three-year course under the tutelage of Colin McCormack, the actor from the Royal Shakespeare Company. From 1992-1994, he was married to Scottish actress Fiona Loudon, their daughter, named Ella Craig, was born in 1992. Daniel Craig made his film debut in La puissance de l'ange (1992). His film career continued on television, notably the BBC2 serial Our Friends in the North (1996). He shot to international fame after playing supporting roles in Lara Croft: Tomb Raider (2001) and Road to Perdition (2002). He was nominated for his performances in the leading role in Layer Cake (2004), and received other awards and nominations. Craig was named as the sixth actor to portray \"James Bond\", in October of 2005, weeks after he finished his work in Munich (2005), where he co-starred with Eric Bana under the directorship of Steven Spielberg. Craig's reserved demeanor and his avoidance of the showbiz-party-red-carpet milieu makes him a cool \"007\". He is the first blond actor to play Bond, and also the first to be born after the start of the film series, and also the first to be born after the death of author Ian Fleming in 1964. Four of the past Bond actors: Sean Connery, Roger Moore, Timothy Dalton and Pierce Brosnan have indicated that Craig is a good choice as \"Bond\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjk4NDU4MF5BMl5BanBnXkFtZTcwMDMyNjQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0185819","name":"Daniel Craig","idIMDB":"nm0185819"},"actorId":"nm0185819","character":"XXXX","urlCharacter":"http://www.imdb.com/character/ch0012331","main":true},{"actorName":"Tom Hardy","urlProfile":"http://www.imdb.com/name/nm0362766","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODEyNjA4Nl5BMl5BanBnXkFtZTgwMTE4ODMyMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1977","placeOfBirth":" Hammersmith, London, England, UK","birthName":"Edward Thomas Hardy","height":"5' 9\" (1.75 m)","bio":"With his breakthrough performance as Eames in Christopher Nolan's science fiction thriller Inception (2010), English actor Tom Hardy has been brought to the attention of mainstream audiences worldwide. However, the versatile actor has been steadily working on both stage and screen since his television debut in the miniseries Band of Brothers (2001). After being cast in the World War II drama, Hardy left his studies at the prestigious Drama Centre in London and was subsequently cast as Twombly in Ridley Scott's Black Hawk Down (2001) and as the villain Shinzon in Star Trek: Nemesis (2002). Tom was born on September 15, 1977 in Hammersmith, London; his mother, Elizabeth Anne (Barrett), is an artist and painter, and his father, Edward Hardy, is a writer. He is of English and Irish descent. Hardy was brought up in East Sheen, London, and first studied at Reed's School. His education continued at Tower House School, then at Richmond Drama School, and subsequently at the Drama Centre London, along with fellow Oscar nominee Michael Fassbender. After winning a modeling competition at age 21, he had a brief contract with the agency Models One. Tom spent his teens and early twenties battling delinquency, alcoholism and drug addiction; after completing his work on Star Trek: Nemesis (2002), he sought treatment and has also admitted that his battles with addiction ended his 5-year marriage to Rachael Speed. Returning to work in 2003, Hardy was awarded the Evening Standard Most Promising Newcomer Award for his theatre performances in the productions of \"In Arabia, We'd All Be Kings\" and \"Blood\". In 2003, Tom also co-starred in the play \"The Modernists\" with Paul Popplewell, Jesse Spencer and Orlando Wells. During the next five years, Hardy worked consistently in film, television and theatre, playing roles as varied as Robert Dudley in the BBC's The Virgin Queen (2005), Bill Sikes in Oliver Twist (2007) and starring in \"The Man of Mode\" at the National Theatre. On the silver screen, he appeared in the crime thriller Layer Cake (2004) with Daniel Craig, Sofia Coppola's Marie Antoinette (2006), and the romp Scenes of a Sexual Nature (2006). In 2006, Hardy created \"Shotgun\", an underground theatre company along with director Robert Delamere, and directed a play, penned by his father for the company, called \"Blue on Blue\". In 2007, Hardy received a best actor BAFTA nomination for his touching performance as Stuart Shorter in the BBC adaptation of Alexander Masters' bestselling biography Stuart: A Life Backwards (2007). Hardy, hailed for his transformative character acting, was lauded for his emotionally and physically convincing portrayal in the ill-fated and warmhearted tale of Shorter, a homeless and occasionally violent man suffering from addiction and muscular dystrophy. The following year, he appeared as gay hoodlum Handsome Bob in the Guy Ritchie film RocknRolla (2008), but this would be his next transformation that would prove his extensive range and stun critics. In the film Bronson (2008), Hardy played the notorious Charles Bronson (given name, Michael Peterson), the \"most violent prisoner in Britain\". Bald, pumped-up, and outfitted with Bronson's signature strongman mustache, Hardy is unrecognizable and gives a harrowing performance that is physically fearless and psychologically unsettling. Director Nicolas Winding Refn breaks the fourth wall with Hardy retelling his tales directly to viewers as well as performing them outright before an audience of his own imagining. The performance mixes terrifying brutality, vaudevillian showmanship, wry humor, and an alarming amount of commitment, and won Hardy a British Independent Film Award for Best Actor. The performance got Hollywood's attention, and in 2009, Hardy was named one of Variety's \"10 Actors to Watch\". That year, he continued to garner praise for his starring role in The Take (2009), a four-part adaptation of Martina Cole's bestselling crime novel, as well as for his performance as Heathcliff in a version of Wuthering Heights (2009). Recent work includes the aforementioned breakthrough appearance in Inception (2010) alongside Leonardo DiCaprio, Joseph Gordon-Levitt, Cillian Murphy, Tom Berenger, Ken Watanabe, Michael Caine, Marion Cotillard and Ellen Page. The movie was released in July 2010 and became one of top 25 highest grossing films of all time, collecting eight Oscar nominations (including Best Picture) and winning four. Other films include Warrior (2011), opposite Joel Edgerton, the story of two estranged brothers facing the fight of a lifetime from director Gavin O'Connor, and This Means War (2012), directed by McG and co-starring Reese Witherspoon and Chris Pine. Tom also starred in the heralded Cold War thriller, La taupe (2011) with Colin Firth and Gary Oldman. Hardy rejoined Christopher Nolan for The Dark Knight Rises (2012); he played the villain role of Bane opposite Christian Bale, Anne Hathaway, Joseph Gordon-Levitt and Gary Oldman. Hardy's menacing physique and his character's scrambled, hard-to-distinguish voice became a major discussion point as the film was released. Outside of performing, Hardy is the patron for the charity \"Flack\", which is an organization to aid the recovery of the homeless in Cambridge. And in 2010, Hardy was named an Ambassador for The Prince's Trust, which helps disadvantaged youth. On the recent stage, he starred in the Brett C. Leonard play \"The Long Red Road\" in early 2010. Written for Hardy and directed by Philip Seymour Hoffman, the play was staged at Chicago's Goodman Theater. In 2015, Hardy starred as the iconic Mad Max in George Miller's reboot of his franchise, Mad Max: Fury Road (2015). He also collected a British Independent Film Award for his portrayal of both the Kray twins, Ronnie and Reggie, in Legend (2015), and an Oscar nomination for Best Supporting Actor for his role as John Fitzgerald in The Revenant (2015). He has an outlaw biker story among other projects in development. In 2010, Hardy became engaged to fellow English actress Charlotte Riley, whom he starred with in The Take (2009) and Wuthering Heights (2009), and is raising a young son, Louis, with ex-girlfriend Rachael Speed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODEyNjA4Nl5BMl5BanBnXkFtZTgwMTE4ODMyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0362766","name":"Tom Hardy","idIMDB":"nm0362766"},"actorId":"nm0362766","character":"Clarkie","urlCharacter":"http://www.imdb.com/character/ch0012332","main":true},{"actorName":"Jamie Foreman","urlProfile":"http://www.imdb.com/name/nm0286044","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzE3NDM2NjAzOF5BMl5BanBnXkFtZTcwMTk1NzkyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1958","placeOfBirth":" Bermondsey, London, England, UK","birthName":"Jamie L. Foreman","height":"5' 6\" (1.68 m)","bio":"Jamie Foreman was born on May 25, 1958 in Bermondsey, London, England as Jamie L. Foreman. He is an actor and writer, known for Layer Cake (2004), EastEnders (1985) and Sleepy Hollow (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzE3NDM2NjAzOF5BMl5BanBnXkFtZTcwMTk1NzkyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0286044","name":"Jamie Foreman","idIMDB":"nm0286044"},"actorId":"nm0286044","character":"Duke","urlCharacter":"http://www.imdb.com/character/ch0178594","main":true},{"actorName":"Sally Hawkins","urlProfile":"http://www.imdb.com/name/nm1020089","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODE4MDE0MDEzMl5BMl5BanBnXkFtZTgwNjI1NTU5MDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 April 1976","placeOfBirth":" Dulwich, London, England, UK","height":"5' 2\" (1.57 m)","bio":"Sally Hawkins was born in 1976 in Lewisham hospital, London, England, to Jacqui and Colin Hawkins, authors and illustrators of children's books. She is of English and Irish descent. Hawkins was brought up in Greenwich, in southeast London. She attended James Allen's Girls' School in Dulwich. She graduated from the Royal Academy of Dramatic Art in 1998. Hawkins' theatre appearances include Much Ado About Nothing (2000), A Midsummer Night's Dream (2000), Misconceptions (2001), Country Music (2004), and David Hare's adaptation of Federico García Lorca's play The House of Bernarda Alba in 2005. Hawkins made her first notable screen performance as Samantha in the 2002 Mike Leigh film All or Nothing (2002). She also appeared as Slasher in the 2004 film Layer Cake (2004). She played the role of Zena Blake in the BBC adaptation of Sarah Waters' novel, Tipping the Velvet (2002) in 2002. Her first major television role came in 2005, when she played Susan Trinder in the BAFTA-nominated BBC drama Fingersmith (2005), an adaptation of Sarah Waters' novel of the same name, in which she co-starred with Imelda Staunton, as she had in Vera Drake (2004). Since then she has gone on to star in another BBC adaptation, Patrick Hamilton's Twenty Thousand Streets Under the Sky. Hawkins appeared in three episodes of the BBC comedy series Little Britain (2003), in addition to Ed Reardon's Week on BBC Radio 4. She has also contributed to the BBC Radio 4 series Concrete Cow. In 2006, Hawkins returned to the stage, appearing at the Royal Court Theatre in Jez Butterworth's The Winterling. In 2007, she played the lead in a new film of Jane Austen's Persuasion, and followed this with her critically acclaimed performance in Happy-Go-Lucky (2008). Questions and a minor controversy arose when Hawkins was not nominated for an Academy Award for her performance as Poppy. It was the first year since 2000-01 that the winner of the Golden Globe for Best Actress in a Motion Picture Musical or Comedy was not nominated for an Academy Award, and the first year since 1995-96 that no one from the category was nominated. During 2006 she also made uncredited appearances in Richard Ayoade's Man to Man with Dean Learner where she played various uncredited roles from Personal Assistant to Wife of Steve Pising in various deleted scenes included on the DVD. Hawkins' 2009-10 films included Desert Flower (2009), Never Let Me Go (2010), and Happy Ever Afters (2009). In November 2010, she appeared on Broadway as Vivie in Mrs. Warren's Profession. In 2011, Hawkins appeared in Submarine (2010) and had a supporting role in the film adaptation of Jane Eyre (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODE4MDE0MDEzMl5BMl5BanBnXkFtZTgwNjI1NTU5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1020089","name":"Sally Hawkins","idIMDB":"nm1020089"},"actorId":"nm1020089","character":"Slasher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Burn Gorman","urlProfile":"http://www.imdb.com/name/nm1218607","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMzUzNDEyNF5BMl5BanBnXkFtZTcwMzYxMDY3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 September 1974","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Burn Hugh Winchester Gorman","height":"5' 9\" (1.75 m)","bio":"The youngest of four children, Burn was born in Hollywood but was brought up in London with his parents and sisters. Burn's father is a Professor of Linguistics at UCLA. In 2006 Burn and his wife Sarah, a teacher welcomed their son Max Hugh Gorman. Their daughter, Nell was born on January 25, 2009. Gorman has worked with the English National Opera, and he has also performed many readings, workshops and development work with the companies such as National Theatre Studio, Young Vic, Royal Court, Oxford Stage Company, Paines Plough, and Soho Theatre. Gorman was TV 1Xtra Human Beatbox Champion, and as a musician has appeared alongside Groove Armada, Neneh Cherry and Rodney P. He has also worked on videos with The Streets.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMzUzNDEyNF5BMl5BanBnXkFtZTcwMzYxMDY3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1218607","name":"Burn Gorman","idIMDB":"nm1218607"},"actorId":"nm1218607","character":"Gazza","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brinley Green","urlProfile":"http://www.imdb.com/name/nm2903328","urlPhoto":"","biography":{"bio":"Brinley Green is known for his work on Layer Cake (2004), Crush (2001) and Midsomer Murders (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2903328","name":"Brinley Green","idIMDB":"nm2903328"},"actorId":"nm2903328","character":"Nobby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Harris","urlProfile":"http://www.imdb.com/name/nm0364711","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0Njc1MTgyMV5BMl5BanBnXkFtZTcwNzc1MDkyMQ@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1949","placeOfBirth":" Grenada, British West Indies [now Grenada]","height":"6' 0¾\" (1.85 m)","bio":"George Harris was born on October 20, 1949 in Grenada, British West Indies. He is an actor and producer, known for Raiders of the Lost Ark (1981), Harry Potter and the Order of the Phoenix (2007) and Layer Cake (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0Njc1MTgyMV5BMl5BanBnXkFtZTcwNzc1MDkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0364711","name":"George Harris","idIMDB":"nm0364711"},"actorId":"nm0364711","character":"Morty","urlCharacter":"http://www.imdb.com/character/ch0178597","main":true},{"actorName":"Tamer Hassan","urlProfile":"http://www.imdb.com/name/nm1268748","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MTg4NTQ2N15BMl5BanBnXkFtZTcwNDE3MDMzNA@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 March 1968","placeOfBirth":" London, England, UK","height":"6' 2\" (1.88 m)","bio":"Having grown up in the South East of London, practicing his street-wise skills in boxing and football, Tamer showed his versatility from a very young age as an aspiring entrepreneur, turning his hand to sports clubs, restaurants and nightclubs. A chance encounter with his now Agent, lead Tamer to early television appearances, including; Eastenders, Casualty, The Bill and John Judge Deed. Tamer has starred in modern British classics, Calcium Kid with Orlando Bloom, The Football Factory alongside fellow Brit Actor and friend Danny Dyer, Layer Cake with Daniel Craig and his eye-opening and laugh-out-loud lead as, want-to-do-good gangster, Charlie, in Nick Love's now cult movie, The Business. Hassan has skillfully moved in and out of a plethora of feature and ensemble roles, including Kick Ass with Nicholas Cage, Christopher Nolan's Batman Begins, 50 Cent's Dead Man Running, Clash of The Titans alongside Ralph Fiennes and Liam Neeson and 2011's The Double with Richard Gere. Throughout 2012, Tamer has continued his relentless work-rate with several new humanitarian and film projects, both in Europe and across the pond. Most recently completing on Director Drew Hall's latest contribution to screen, Son's Of Liberty, due for release in early 2013.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MTg4NTQ2N15BMl5BanBnXkFtZTcwNDE3MDMzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1268748","name":"Tamer Hassan","nicknames":["Tam"],"idIMDB":"nm1268748"},"actorId":"nm1268748","character":"Terry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Colm Meaney","urlProfile":"http://www.imdb.com/name/nm0000538","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMDMzMTQ4N15BMl5BanBnXkFtZTcwMjMyNjQ0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 May 1953","placeOfBirth":" Dublin, Ireland","height":"5' 11\" (1.8 m)","bio":"Colm Meaney was born on May 30, 1953 in Dublin, Ireland. He is an actor, known for Star Trek: Deep Space Nine (1993), Con Air (1997) and Law Abiding Citizen (2009). He has been married to Ines Glorian since March 15, 2007. He was previously married to Bairbre Dowling.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMDMzMTQ4N15BMl5BanBnXkFtZTcwMjMyNjQ0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000538","name":"Colm Meaney","idIMDB":"nm0000538"},"actorId":"nm0000538","character":"Gene","urlCharacter":"http://www.imdb.com/character/ch0178598","main":true},{"actorName":"Marcel Iures","urlProfile":"http://www.imdb.com/name/nm0411903","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM0NTYwODM5OF5BMl5BanBnXkFtZTcwNjY1ODQzOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 August 1951","placeOfBirth":" Bailesti, Romania","bio":"Marcel Iures is one of Romania's most acclaimed stage and screen actors, having starred in more than two dozen features in his native country and twice being named its best actor. His American film credits include The Peacemaker starring George Clooney, Mission: Impossible (1996) starring Tom Cruise, and Interview with the Vampire: The Vampire Chronicles (1994) starring Cruise and Brad Pitt. Among his most noted Romanian films are The Last Messenger, The Oak (1992) (The Oak), Society's Pillars, Vacanta cea mare (1988) (The Big Holiday), The Duel and Romanian. He recently finished filming Amen (2002) for director Costa-Gavras.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM0NTYwODM5OF5BMl5BanBnXkFtZTcwNjY1ODQzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0411903","name":"Marcel Iures","idIMDB":"nm0411903"},"actorId":"nm0411903","character":"Slavo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Francis Magee","urlProfile":"http://www.imdb.com/name/nm0535837","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4ODQxMjgzNl5BMl5BanBnXkFtZTcwODg3MzMyOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1969","placeOfBirth":" Dublin, Ireland","height":"6' 1\" (1.85 m)","bio":"Francis Magee was raised in Ireland and on the Isle of Man. He spent eight years as a fisherman before becoming an actor and has also been a member of several music groups including Namoza - who released four singles and an album - and Disco D'Oro. He studied acting at the Poor School at London's Kings Cross and made his television debut as Liam Taylor in 'East Enders', a role he played on and off for two years. Since then he has been a regular face in many television series, notably 'No Angels' and 'City of Vice'.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4ODQxMjgzNl5BMl5BanBnXkFtZTcwODg3MzMyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0535837","name":"Francis Magee","idIMDB":"nm0535837"},"actorId":"nm0535837","character":"Paul the Boatman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dimitri Andreas","urlProfile":"http://www.imdb.com/name/nm0028222","urlPhoto":"","biography":{"height":"5' 10\" (1.78 m)","bio":"Dimitri Andreas is an actor and producer, known for Layer Cake (2004), Prince of Persia: The Sands of Time (2010) and Spy (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0028222","name":"Dimitri Andreas","idIMDB":"nm0028222"},"actorId":"nm0028222","character":"Angelo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kenneth Cranham","urlProfile":"http://www.imdb.com/name/nm0186469","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjE3Njg5Ml5BMl5BanBnXkFtZTcwNzc4MDcwOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1944","placeOfBirth":" Dunfermline, Fife, Scotland, UK","height":"5' 7\" (1.7 m)","bio":"Kenneth Cranham was born on December 12, 1944 in Dunfermline, Fife, Scotland. He is an actor, known for Maleficent (2014), Valkyrie (2008) and Layer Cake (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjE3Njg5Ml5BMl5BanBnXkFtZTcwNzc4MDcwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0186469","name":"Kenneth Cranham","idIMDB":"nm0186469"},"actorId":"nm0186469","character":"Jimmy Price","urlCharacter":"http://www.imdb.com/character/ch0178593","main":true},{"actorName":"Garry Tubbs","urlProfile":"http://www.imdb.com/name/nm1395778","urlPhoto":"","biography":{"bio":"Garry Tubbs is an actor, known for Layer Cake (2004), John Carter (2012) and Spirit Levels (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1395778","name":"Garry Tubbs","idIMDB":"nm1395778"},"actorId":"nm1395778","character":"Brian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nathalie Lunghi","urlProfile":"http://www.imdb.com/name/nm1508805","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5OTQ4NDA2Nl5BMl5BanBnXkFtZTcwMTQzNzMxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 August 1986","placeOfBirth":" London, England, UK","birthName":"Nathalie Kathleen Lunghi-Joffé","bio":"Nathalie Lunghi was born on August 26, 1986 in London, England as Nathalie Kathleen Lunghi-Joffé. She is an actress, known for Layer Cake (2004), The Things I Haven't Told You (2008) and The Palace (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5OTQ4NDA2Nl5BMl5BanBnXkFtZTcwMTQzNzMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1508805","name":"Nathalie Lunghi","idIMDB":"nm1508805"},"actorId":"nm1508805","character":"Charlie","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0375912","urlIMDB":"http://www.imdb.com/title/tt0375912","business":{"budget":{"money":"£4,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$81,706","country":"USA","day":"15","month":"05","year":"2005","remarks":"10 Screens"},{"money":"£1,090,561","country":"UK","day":"03","month":"10","year":"2004","remarks":"355 Screens"}],"gross":[{"money":"$2,338,695","country":"USA","day":"14","month":"08","year":"2005","remarks":""},{"money":"$2,334,271","country":"USA","day":"07","month":"08","year":"2005","remarks":""},{"money":"$2,327,087","country":"USA","day":"31","month":"07","year":"2005","remarks":""},{"money":"$2,312,497","country":"USA","day":"24","month":"07","year":"2005","remarks":""},{"money":"$2,277,736","country":"USA","day":"17","month":"07","year":"2005","remarks":""},{"money":"$2,217,435","country":"USA","day":"10","month":"07","year":"2005","remarks":""},{"money":"$2,111,758","country":"USA","day":"04","month":"07","year":"2005","remarks":""},{"money":"$1,975,680","country":"USA","day":"26","month":"06","year":"2005","remarks":""},{"money":"$1,806,685","country":"USA","day":"19","month":"06","year":"2005","remarks":""},{"money":"$1,564,616","country":"USA","day":"12","month":"06","year":"2005","remarks":""},{"money":"$1,166,704","country":"USA","day":"05","month":"06","year":"2005","remarks":""},{"money":"$243,991","country":"USA","day":"22","month":"05","year":"2005","remarks":""},{"money":"$81,706","country":"USA","day":"15","month":"05","year":"2005","remarks":""},{"money":"£4,287,343","country":"UK","day":"31","month":"10","year":"2004","remarks":""},{"money":"£3,937,500","country":"UK","day":"24","month":"10","year":"2004","remarks":""},{"money":"£3,385,670","country":"UK","day":"17","month":"10","year":"2004","remarks":""},{"money":"£2,408,829","country":"UK","day":"10","month":"10","year":"2004","remarks":""},{"money":"£1,090,561","country":"UK","day":"03","month":"10","year":"2004","remarks":""}],"weekendGross":[{"money":"$959","country":"USA","day":"14","month":"08","year":"2005","remarks":"5 Screens"},{"money":"$4,847","country":"USA","day":"07","month":"08","year":"2005","remarks":"7 Screens"},{"money":"$3,450","country":"USA","day":"31","month":"07","year":"2005","remarks":"7 Screens"},{"money":"$18,221","country":"USA","day":"24","month":"07","year":"2005","remarks":"24 Screens"},{"money":"$32,954","country":"USA","day":"17","month":"07","year":"2005","remarks":"40 Screens"},{"money":"$68,735","country":"USA","day":"10","month":"07","year":"2005","remarks":"58 Screens"},{"money":"$91,213","country":"USA","day":"04","month":"07","year":"2005","remarks":"109 Screens"},{"money":"$90,805","country":"USA","day":"26","month":"06","year":"2005","remarks":"98 Screens"},{"money":"$141,985","country":"USA","day":"19","month":"06","year":"2005","remarks":"145 Screens"},{"money":"$253,691","country":"USA","day":"12","month":"06","year":"2005","remarks":"196 Screens"},{"money":"$345,603","country":"USA","day":"05","month":"06","year":"2005","remarks":"200 Screens"},{"money":"$127,858","country":"USA","day":"22","month":"05","year":"2005","remarks":"28 Screens"},{"money":"$81,706","country":"USA","day":"15","month":"05","year":"2005","remarks":"10 Screens"},{"money":"£141,329","country":"UK","day":"31","month":"10","year":"2004","remarks":"159 Screens"},{"money":"£280,090","country":"UK","day":"24","month":"10","year":"2004","remarks":"222 Screens"},{"money":"£547,934","country":"UK","day":"17","month":"10","year":"2004","remarks":"301 Screens"},{"money":"£743,146","country":"UK","day":"10","month":"10","year":"2004","remarks":"357 Screens"},{"money":"£1,090,561","country":"UK","day":"03","month":"10","year":"2004","remarks":"355 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"30","month":"06","year":"2003","remarks":null},null],"copyrightHolder":"Columbia Pictures Industries, Inc."},"technical":{"runtime":["1 hr 45 min (105 min)"],"soundMix":["Dolby Digital","SDDS (US prints)","DTS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Moviecam Compact, Cooke Xtal Express Lenses"],"laboratory":["Framestore CFC, London, UK (digital film grading)"],"filmLength":["2,895 m (Norway)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","J-D-C Scope (anamorphic) (source format)"],"printedFilmFormat":["35 mm"]},"rating":"7.4","metascore":"73","filmingLocations":[{"location":"Newport Pagnell Service Area, M1 Motorway, Newport Pagnell, Buckinghamshire, England, UK"}],"rated":"R","awards":[{"award":"BAFTA Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Carl Foreman Award for the Most Promising Newcomer","categories":[{"category":"","names":[{"name":"Matthew Vaughn","id":"nm0891216","role":"director"}]}]}]},{"award":"British Independent Film Awards 2004","titlesAwards":[{"titleAwardOutcome":"Nominated Douglas Hickox Award","categories":[{"category":"","names":[{"name":"Matthew Vaughn","id":"nm0891216","role":null}]}]}]},{"award":"Empire Awards, UK 2005","titlesAwards":[{"titleAwardOutcome":"Won Empire Award","categories":[{"category":"Best British Director","names":[{"name":"Matthew Vaughn","id":"nm0891216","role":null}]}]},{"titleAwardOutcome":"Nominated Empire Award","categories":[{"category":"Best Newcomer","names":[{"name":"Sienna Miller","id":"nm1092227","role":null},{"name":"Alfie","id":"tt0375173","role":null}]},{"category":"Best Newcomer","names":[{"name":"Matthew Vaughn","id":"nm0891216","role":null}]},{"category":"Best British Film","names":[]},{"category":"Best British Actor","names":[{"name":"Daniel Craig","id":"nm0185819","role":null}]}]}]},{"award":"European Film Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Audience Award","categories":[{"category":"Best European Actor","names":[{"name":"Daniel Craig","id":"nm0185819","role":null},{"name":"Enduring Love","id":"tt0375735","role":null}]}]}]},{"award":"National Board of Review, USA 2005","titlesAwards":[{"titleAwardOutcome":"Won Special Recognition","categories":[{"category":"","names":[]}]}]},{"award":"St. Louis Film Critics Association, US 2005","titlesAwards":[{"titleAwardOutcome":"Nominated SLFCA Award","categories":[{"category":"Best Overlooked Film or Most Original, Artistically Innovative or Creative Film","names":[]}]}]},{"award":"World Soundtrack Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated World Soundtrack Award","categories":[{"category":"Discovery of the Year","names":[{"name":"Ilan Eshkeri","id":"nm1011065","role":null}]}]}]}],"votes":"139,207","type":"Movie","companyCreditsSimple":[{"idCompany":"co0014453","name":"Sony Pictures Classics"},{"idCompany":"co0165404","name":"Marv Films"}],"keywords":{"keywords":["drugs","cocaine","pill","serbian","cake","gangster","search","money","england","drug lord","drug dealer","police siren","telephone booth","woman wearing a string bikini","sex against a wall","breasts","directorial debut","blood splatter","ends with narration","begins with narration","police chase","foot chase","crashing through a gate","close up of eyes","dead body in a freezer","silencer","sniper rifle","repeated scene from a different perspective","zodiac boat","mob execution","watering a plant","hands tied behind back","duct tape gag","woman wearing black lingerie","women changing clothes","facial mask","cleaning a fish","trick question","awakened by a phone","arsenal","luger","public suicide","bare chested male","clothes iron","man eating a lollypop","woman panicing","gun pointed at face","lighting a cigar","gold cigarette lighter","pile of money","peep show","electronic scale","cutting cocaine","dust mask","voyeur","girl in panties","black panties","leg spreading","lust","nipples visible through clothing","fondling","no panties","scantily clad female","cleavage","woman shot in the forehead","construction elevator","communist insurgent","pontoon","ski mask","wearing a wire","motorboat","drug manufacturing","mirror","loudspeaker","pram","telescope","reference to faust","reference to goethe","book","library","cosmetic mask","room service","rooftop","duct tape over mouth","honorary citizen","weighing scales","dancing","dancer","burning someone","scalding someone","intensive care","prison dining room","prison guard","industrial chemistry","chemistry","rear entry sex","wealth","sunglasses","flowers","ironing","lollipop","subtitled scene","threat","golf tournament","locker room","trophy","hands tied behind one's back","crime lord","organized crime","tied up","stoned","interracial couple","african anglo","suicide by gunshot","gunshot","gun in mouth","argument","fight","mass murder","whiskey","beer","pharmaceutical industry","pharmacy","auto mechanic","truck","guilt","eye dilation","motorcycle helmet","burning clothing","license plate","motorcycle","binoculars","stakeout","underwear","underwater scene","swimming","microphone","hidden microphone","wiretapping","assassin","zurich switzerland","motel","drink","drinking","bar","shot through a pillow","blackmail","hotel","bank robbery","robbery","drug addiction","headless corpse","rifle","gun","beheading","explosion","lsd","dead body","theft","thief","cigarette lighter","cigarette smoking","homosexual","gay","reference to winston churchill","boyfriend girlfriend relationship","fear","policeman","police","hired killer","kidnapping","liar","lie","stalking","being followed","following someone","paranoia","father daughter relationship","cell phone","telephone call","restaurant","cafe","subjective camera","food in title","voice over narration","sex","snorting cocaine","sex in a bed","police car","pills","overhead camera shot","narrated by character","marijuana joint","land rover","hashish","female frontal nudity","missing drugs","drug use","drug trip","drug theft","drug supplier","drug runner","drug pusher","drug money","drug humor","drug deal","drug addict","crack head","cocaine production","bmw","bmw sedan","panties","lingerie","bra","shower","old friend","hippie","flashback","diner","dance","chase","shot through the mouth","self inflicted gunshot wound","torture","suv","set up","eavesdropping","police raid","murder","lost money","london england","junkie","informer","impersonating a police officer","confidence trick","black comedy","anti hero","amsterdam netherlands","1990s","nameless character","scam","neo noir","luxury car","liverpudlian","hitman","heist","flirtation","fish","female nudity","extortion","country club","accountant","tea","revenge","champagne","betrayal","sniper","shot in the head","shot in the forehead","severed head","drug overdose","deception","death","corpse","cheating on one's boyfriend","blood","beating","attempted murder","breaking the fourth wall","one last job","netherlands","warehouse","violence","swimming pool","suicide","silk stockings","shot in the chest","shot between the eyes","sex standing up","prison","pot smoking","nightclub","missing person","mansion","kingpin","hotel room","rain","headphones","greenhouse","freezer","flatiron","ecstasy the drug","double cross","cigar smoking","burn victim","bong","assassination","airport","drug dealing","based on novel","title spoken by character","surprise ending","1970s","greed","1960s"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 07:59:52"}}