{"data":{"movies":[{"title":"Lucky You","originalTitle":"","year":"2007","releaseDate":"20070504","directors":[{"name":"Curtis Hanson","id":"nm0000436"}],"writers":[{"name":"Eric Roth","id":"nm0744839"},{"name":"Curtis Hanson","id":"nm0000436"}],"runtime":"124 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzcyMzgwNzU2N15BMl5BanBnXkFtZTcwMDcyODYzMw@@._V1.jpg","countries":["USA","Germany","Australia"],"languages":["English","Spanish"],"genres":["Drama","Romance","Sport"],"plot":"In Las Vegas, Huck Cheever is a poker player, brilliant but also prone to let emotion take over. It's the week of the poker world series, and Huck must come up with the $10,000 entry fee, which he wins, loses, borrows, and loses - and even steals part of from Billie Offer, an earnest young woman who's new in town and who catches Huck's eye. By the time the tournament starts, Huck owes everyone. Complicating things is the arrival of Huck's father, whom Huck detests for having left his mother, a champion player in town to win. Can Huck learn to play poker the way he lives and to live the way he plays poker? Or is his only flush the sound of his life going down the toilet?","simplePlot":"A hotshot poker player tries to win a tournament in Vegas, but is fighting a losing battle with his personal problems.","actors":[{"actorName":"Phyllis Somerville","urlProfile":"http://www.imdb.com/name/nm0813902","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMTgwNzczMV5BMl5BanBnXkFtZTYwMjg3NjI1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1943","placeOfBirth":" Iowa City, Iowa, USA","bio":"Phyllis Somerville was born on December 12, 1943 in Iowa City, Iowa, USA. She is an actress, known for The Curious Case of Benjamin Button (2008), One Life to Live (1968) and Little Children (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMTgwNzczMV5BMl5BanBnXkFtZTYwMjg3NjI1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0813902","name":"Phyllis Somerville","idIMDB":"nm0813902"},"actorId":"nm0813902","character":"Pawnbroker","urlCharacter":"http://www.imdb.com/character/ch0265373","main":true},{"actorName":"Eric Bana","urlProfile":"http://www.imdb.com/name/nm0051509","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjcxMzI4OWItN2Y4NS00NDZjLWE3MDEtNTIwYWQyZjdiYjE2L2ltYWdlXkEyXkFqcGdeQXVyNzAxOTAyMDc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1968","placeOfBirth":" Melbourne, Victoria, Australia","birthName":"Eric Banadinovic","height":"6' 2½\" (1.89 m)","bio":"Eric Bana was born Eric Banadinovic on August 9, 1968, in Melbourne, Victoria, Australia. He is the younger of two brothers. His father, named Ivan Banadinovic, came from Zagreb, Croatia, and worked as a manager for Caterpillar Inc. His mother, named Eleanor Banadinovic, came from a German family and was a hairdresser. Young Bana grew up in suburban Melbourne. He was popular among his schoolmates for his talent of making comic impressions of his teachers. At that time, he was fond of Mel Gibson in Mad Max (1979) and also decided to become an actor. He moved to Sydney and worked odd jobs to support himself. In 1991, he began a career as a stand-up comedian, while working as a barman at Melbourne's Castle Hotel. In 1993, Bana made his television debut on Steve Vizard's Tonight Live with Steve Vizard (1990) talk show, then joined the Full Frontal (1993) TV-series. He gained popularity for making impressions of Arnold Schwarzenegger, Sylvester Stallone, Tom Cruse and \"Colombo\". In 1996, he started his own show titled Eric (1997), then launched a comedy series titled The Eric Bana Show Live (1997). The show was canceled for the lack of substantial audience, however, in 1997, Bana received the Logie Award for \"Most Popular Comedian\" for his work on The Eric Bana Show Live (1997). He made his film debut in Une maison de rêve (1997), in a supporting comic role. That same year, he was cast to portray Mark \"Chopper\" Read, the notorious Australian underworld figure. For the role, Bana gained 30 pounds, by eating junk food; he also spent a few days with Read in prison, in order to perfect his mimicry. Bana completely transformed himself into a bald, fat, disturbed criminal. He would arrive on the film set at four in the morning, spending several hours in makeup, being tattooed exactly like Read. Chopper (2000) became an international success and won three Australian Film Institute Awards. Bana won the Best Actor at the 2000 Stockholm Film Festival and also the AFI 2000 Best Actor Award. Then he co-starred in Black Hawk Down (2001), then starred in Hulk (2003). In 2002, he was cast as a Trojan \"Prince Hector\" in the historical epic Troy (2004), after being recommended by Brad Pitt, who admired Bana for his work in Chopper (2000). In 2005, Bana co-starred with Daniel Craig and Geoffrey Rush in the political drama Munich (2005) directed by Steven Spielberg. In 1995, he began dating Rebecca Gleeson, a publicist and daughter of Australian High Court Chief Justice Murray Gleeson. The following year, he was named \"Bachelor of the Year\" by Cleo Magazine, and won a trip for two to the United States. He invited Gleeson, and proposed to her during that romantic trip. In 1997, the two were married; their son, Klaus, was born in 1999, their daughter, Sophia, was born in 2002. He currently resides in Melbourne with his wife and their two children. Bana is a passionate supporter of Australian football.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjcxMzI4OWItN2Y4NS00NDZjLWE3MDEtNTIwYWQyZjdiYjE2L2ltYWdlXkEyXkFqcGdeQXVyNzAxOTAyMDc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0051509","name":"Eric Bana","idIMDB":"nm0051509"},"actorId":"nm0051509","character":"Huck Cheever","urlCharacter":"http://www.imdb.com/character/ch0028880","main":true},{"actorName":"Horatio Sanz","urlProfile":"http://www.imdb.com/name/nm0764445","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU0MjIyOTQwNl5BMl5BanBnXkFtZTcwNjQ1OTQ2Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1969","placeOfBirth":" Santiago, Chile","height":"5' 8\" (1.73 m)","bio":"Horatio Sanz was born on June 4, 1969, in Santiago, Chile, and raised in Chicago, Illinois. He was one of the Upright Citizen Brigade's founding members and performed with Chicago's Second City comedy troupe. When he joined the cast of Saturday Night Live (1975) as a featured player at the beginning of the 24th season (September 26, 1998), he became the long-running sketch comedy show's first Latino cast member. He appeared along with fellow featured players Jimmy Fallon and Chris Parnell, and after only one season, the three were promoted to cast members. On the show, Horatio played the characters Frankie Hilbert on the sketch \"Boston Teens\", pothead Gobi on the recurring sketch \"Jarret's Room\", and A/V teacher Mr. Banglian on \"Wake Up, Wakefield.\" Horatio has had many minor but memorable roles in movies since 1994. However, his big break came in 2003 with his first starring role in the movie Boat Trip (2002), in which he appeared along with Cuba Gooding Jr. and Vivica A. Fox. He continued to star on Saturday Night Live (1975) until 2007.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU0MjIyOTQwNl5BMl5BanBnXkFtZTcwNjQ1OTQ2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0764445","name":"Horatio Sanz","nicknames":["Roger","Raj"],"idIMDB":"nm0764445"},"actorId":"nm0764445","character":"Ready Eddie","urlCharacter":"http://www.imdb.com/character/ch0036723","main":true},{"actorName":"Drew Barrymore","urlProfile":"http://www.imdb.com/name/nm0000106","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyOTMzODIxM15BMl5BanBnXkFtZTcwODM2NTY5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1975","placeOfBirth":" Culver City, California, USA","birthName":"Drew Blyth Barrymore","height":"5' 4\" (1.63 m)","bio":"Since melting audiences' hearts - at the age of six - in Steven Spielberg's beloved sci-fi blockbuster, E.T. the Extra-Terrestrial (1982), Drew Barrymore has emerged as one of the most endearing and talented actresses of her generation. Drew Blyth Barrymore was born in Culver City, California, to actors John Drew Barrymore and Jaid Barrymore (née Ildiko Jaid Mako). Her father came from a long showbusiness legacy, as the son of actors John Barrymore and Dolores Costello, while her mother was the daughter of Hungarian refugees. Despite a troubled and much-publicized adolescence, and a string of \"bad girl\" parts in lurid crime dramas such as Poison Ivy (1992), Barrymore's star was officially on the rise during the mid-1990s, with notable appearances in Boys on the Side (1995), Woody Allen's Everyone Says I Love You (1996), and the game-changing horror hit Scream (1996). An eclectic mix of high-profile and low-key film projects followed - such as The Wedding Singer (1998), Ever After: A Cinderella Story (1998), Never Been Kissed (1999), Charlie's Angels (2000), Donnie Darko (2001), Riding in Cars with Boys (2001) and Confessions of a Dangerous Mind (2002) - proving to once-cynical audiences that Barrymore was not only a capable leading lady, but also a gifted and versatile actor. Next came headlining parts in Duplex (2003), 50 First Dates (2004), Fever Pitch (2005), Music and Lyrics (2007), Lucky You (2007), He's Just Not That Into You (2009), and the much-lauded Grey Gardens (2009), for which she earned Golden Globe and Screen Actors Guild awards for her portrayal of Edith Bouvier Beale. In 2009, Barrymore - whose production company, Flower Films, has spawned several lucrative features - made her long-awaited directional debut with the comedy-drama Whip It (2009), emerging as \"a sensitive director who knows how and when to let an emotional moment linger on the screen\" (TIME). Alongside a recurring guest spot - as the voice of Jillian - on the cult animated series Family Guy (1999), recent acting roles have included Everybody's Fine (2009), Going the Distance (2010), Big Miracle (2012), Blended (2014), and Miss You Already (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyOTMzODIxM15BMl5BanBnXkFtZTcwODM2NTY5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000106","name":"Drew Barrymore","nicknames":["D"],"idIMDB":"nm0000106"},"actorId":"nm0000106","character":"Billie Offer","urlCharacter":"http://www.imdb.com/character/ch0036722","main":true},{"actorName":"Joey Kern","urlProfile":"http://www.imdb.com/name/nm0449466","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY4NDU1OTU3M15BMl5BanBnXkFtZTgwNDI1NjAzMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 September 1976","placeOfBirth":" Kentucky, USA","height":"5' 10½\" (1.79 m)","bio":"Joey Kern studied at New York University where he earned a BFA in Drama. He then went on to train at the Royal Academy of Dramatic Arts in London. His professional acting career began on stage with various companies including the Atlantic Theater Company, New Group Theater and Theatre for a New Audience, where he played the title role of \"Troilus\" in William Shakespeare's \"Troilus and Cressida\". He then made his feature film debut in the indie flick The Virgin (1999), followed by a guest appearance in the HBO television series Sex and the City (1998). Next, he played a college boy in the feature film Super Troopers (2001), then landed small roles in three more indie films: Love the Hard Way (2001) starring Adrien Brody, XX/XY (2002) and Garmento (2002). His career took off when he landed lead roles in two films given wide release: Grind (2003) and Cabin Fever (2002). Kern has also appeared on ABC's Wonderland (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY4NDU1OTU3M15BMl5BanBnXkFtZTgwNDI1NjAzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0449466","name":"Joey Kern","idIMDB":"nm0449466"},"actorId":"nm0449466","character":"Billie's Admirer","urlCharacter":"http://www.imdb.com/character/ch0265380","main":true},{"actorName":"Debra Messing","urlProfile":"http://www.imdb.com/name/nm0005226","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjUzMjg3M15BMl5BanBnXkFtZTcwMTc0NDU5OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 August 1968","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Debra Lynn Messing","height":"5' 8\" (1.73 m)","bio":"Messing was born in the New York City borough of Brooklyn, the daughter of Jewish American parents, Sandra (née Simons), who has worked as a professional singer, banker, travel and real estate agent, and Brian Messing, a sales executive for a jewelry manufacturer. When Messing was three, she moved with her parents and her older brother, Brett, to East Greenwich, a small town outside Providence, Rhode Island. During her high school years, she acted (and sang) in a number of high school productions, including the starring role in the musical \"Annie\" and \"Fiddler On the Roof.\" Messing took lessons in dance, singing, and acting. In 1986, she was Rhode Island's Junior Miss and competed in Mobile, Alabama in the America's Junior Miss scholarship program. While her parents encouraged her dream of becoming an actress, they also urged her to complete a liberal arts education before deciding on acting as a career. Following their advice, she attended Brandeis University in Waltham, Massachusetts. In 1990, after graduating summa cum laude from Brandeis with a bachelor's degree in theater arts, Messing gained admission to the elite Graduate Acting Program (which accepts only about 15 new students annually) at New York University, where she earned a master's degree in fine arts after three years. In 1998, Messing played a lead role as the bio-anthropologist Sloan Parker on ABC's dramatic science fiction television series Prey. During this time her agent approached her with the pilot script for the television show Will & Grace. Messing was inclined to take some time off, but the script intrigued her, and she auditioned for the role of Grace Adler, beating out Nicollette Sheridan, who later guest-starred on the show as a romantic rival of Grace's. Will & Grace became a ratings success, and Messing gained renown. In 2002, she was named one of the \"50 Most Beautiful People in the World\" by People Magazine. TV Guide picked her as its \"Best Dressed Woman\" in 2003. Messing met her husband, Daniel Zelman (an actor and screenwriter), on their first day as graduate students at NYU. The two were married on September 3, 2000, and live in New York City. On April 7, 2004, Messing gave birth to their son, Roman Walker Zelman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjUzMjg3M15BMl5BanBnXkFtZTcwMTc0NDU5OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005226","name":"Debra Messing","idIMDB":"nm0005226"},"actorId":"nm0005226","character":"Suzanne Offer","urlCharacter":"http://www.imdb.com/character/ch0036724","main":true},{"actorName":"Delaine Yates","urlProfile":"http://www.imdb.com/name/nm0946738","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNTI0MTIwNV5BMl5BanBnXkFtZTcwODk4MDgzMQ@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"bio":"Delaine Yates is an actress, known for Lucky You (2007), Unthinkable (2010) and The City (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNTI0MTIwNV5BMl5BanBnXkFtZTcwODk4MDgzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0946738","name":"Delaine Yates","idIMDB":"nm0946738"},"actorId":"nm0946738","character":"Ginger","urlCharacter":"http://www.imdb.com/character/ch0133081","main":true},{"actorName":"Mykel Shannon Jenkins","urlProfile":"http://www.imdb.com/name/nm0420926","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ2MDI2OTE5Ml5BMl5BanBnXkFtZTcwNzA0NTIwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 July 1969","placeOfBirth":" Louisiana, USA","birthName":"Michael Shannon Jenkins","height":"5' 11\" (1.8 m)","bio":"Mykel Shannon Jenkins was born on July 3, 1969 in Louisiana, USA as Michael Shannon Jenkins. He is an actor and producer, known for Undisputed 3: Redemption (2010), Anonymous (2013) and The Gods (2015). He is married to Tracy Villemarette. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ2MDI2OTE5Ml5BMl5BanBnXkFtZTcwNzA0NTIwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0420926","name":"Mykel Shannon Jenkins","idIMDB":"nm0420926"},"actorId":"nm0420926","character":"Gary","urlCharacter":"http://www.imdb.com/character/ch0133082","main":true},{"actorName":"Robert Duvall","urlProfile":"http://www.imdb.com/name/nm0000380","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjk1MjA2Mjc2MF5BMl5BanBnXkFtZTcwOTE4MTUwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1931","placeOfBirth":" San Diego, California, USA","birthName":"Robert Selden Duvall","height":"5' 9½\" (1.77 m)","bio":"Veteran actor and director Robert Selden Duvall was born on January 5, 1931, in San Diego, CA, to Mildred Virginia (Hart), an amateur actress, and William Howard Duvall, a career military officer who later became an admiral. Duvall majored in drama at Principia College (Elsah, IL), then served a two-year hitch in the army after graduating in 1953. He began attending The Neighborhood Playhouse School of the Theatre In New York City on the G.I. Bill in 1955, studying under Sanford Meisner along with Dustin Hoffman, with whom Duvall shared an apartment. Both were close to another struggling young actor named Gene Hackman. Meisner cast Duvall in the play \"The Midnight Caller\" by Horton Foote, a link that would prove critical to his career, as it was Foote who recommended Duvall to play the mentally disabled \"Boo Radley\" in To Kill a Mockingbird (1962). This was his first \"major\" role since his 1956 motion picture debut as an MP was in Somebody Up There Likes Me (1956), starring Paul Newman. Duvall began making a name for himself as a stage actor in New York, winning an Obie Award in 1965 playing incest-minded longshoreman \"Eddie Carbone\" in the off-Broadway revival of Arthur Miller's \"A View from the Bridge\", a production for which his old roommate Hoffman was assistant director. He found steady work in episodic TV and appeared as a modestly billed character actor in films, such as Arthur Penn's The Chase (1966) with Marlon Brando and in Robert Altman's Countdown (1967) and Francis Ford Coppola's The Rain People (1969), in both of which he co-starred with James Caan. He was also memorable as the heavy who is shot by John Wayne at the climax of True Grit (1969) and was the first \"Maj. Frank Burns\", creating the character in Altman's Korean War comedy MASH (1970). He also appeared as the eponymous lead in George Lucas' directorial debut, THX 1138 (1971). It was Francis Ford Coppola, casting The Godfather (1972), who reunited Duvall with Brando and Caan and provided him with his career breakthrough as mob lawyer \"Tom Hagen\". He received the first of his six Academy Award nominations for the role. Thereafter, Duvall had steady work in featured roles in such films as The Godfather: Part II (1974), The Killer Elite (1975), Network (1976), The Seven-Per-Cent Solution (1976) and The Eagle Has Landed (1976). Occasionally this actor's actor got the chance to assay a lead role, most notably in Tomorrow (1972), in which he was brilliant as William Faulkner's inarticulate backwoods farmer. He was less impressive as the lead in Badge 373 (1973), in which he played a character based on real-life NYPD detective Eddie Egan, the same man his old friend Gene Hackman had won an Oscar for playing, in fictionalized form as \"Popeye Doyle\" in The French Connection (1971). It was his appearance as \"Lt. Col. Kilgore\" in another Coppola picture, Apocalypse Now (1979), that solidified Duvall's reputation as a great actor. He got his second Academy Award nomination for the role, and was named by the Guinness Book of World Records as the most versatile actor in the world. Duvall created one of the most memorable characters ever assayed on film, and gave the world the memorable phrase, \"I love the smell of napalm in the morning!\". Subsequently, Duvall proved one of the few established character actors to move from supporting to leading roles, with his Oscar-nominated turns in The Great Santini (1979) and Tender Mercies (1983), the latter of which won him the Academy Award for Best Actor. Now at the summit of his career, Duvall seemed to be afflicted with the fabled \"Oscar curse\" that had overwhelmed the careers of fellow Academy Award winners Luise Rainer, Rod Steiger and Cliff Robertson. He could not find work equal to his talents, either due to his post-Oscar salary demands or a lack of perception in the industry that he truly was leading man material. He did not appear in The Godfather: Part III (1990), as the studio would not give in to his demands for a salary commensurate with that of Al Pacino, who was receiving $5 million to reprise Michael Corleone. His greatest achievement in his immediate post-Oscar period was his triumphant characterization of grizzled Texas Ranger Gus McCrae in the TV mini-series Lonesome Dove (1989), for which he received an Emmy nomination. He received a second Emmy nomination and a Golden Globe for his portrayal of Soviet dictator Joseph Stalin in Stalin (1992), and a third Emmy nomination playing Nazi war criminal Adolf Eichmann in The Man Who Captured Eichmann (1996). The shakeout of his career doldrums was that Duvall eventually settled back into his status as one of the premier character actors in the industry, rivaled only by his old friend Gene Hackman. Duvall, unlike Hackman, also has directed pictures, including the documentary We're Not the Jet Set (1977), Angelo My Love (1983) and Assassination Tango (2002). As a writer-director, Duvall gave himself one of his most memorable roles, that of the preacher on the run from the law in The Apostle (1997), a brilliant performance for which he received his third Best Actor nomination and fifth Oscar nomination overall. The film brought Duvall back to the front ranks of great actors, and was followed by a Best Supporting Actor Oscar nod for A Civil Action (1998). Robert Duvall will long be remembered as one of the great naturalistic American screen actors in the mode of Spencer Tracy and his frequent co-star Marlon Brando. His performances as \"Boo Radley\" in To Kill a Mockingbird (1962), \"Jackson Fentry\" in Tomorrow (1972), \"Tom Hagen\" in the first two \"Godfather\" movies, \"Frank Hackett\" in Network (1976), \"Lt. Col. Kilgore\" in Apocalypse Now (1979), \"Bull Meechum\" in The Great Santini (1979), \"Mac Sledge\" in Tender Mercies (1983), \"Gus McCrae\" in Lonesome Dove (1989) and \"Sonny Dewey\" in The Apostle (1997) rank as some of the finest acting ever put on film. It's a body of work that few actors can equal, let alone surpass.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjk1MjA2Mjc2MF5BMl5BanBnXkFtZTcwOTE4MTUwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000380","name":"Robert Duvall","nicknames":["Bob"],"idIMDB":"nm0000380"},"actorId":"nm0000380","character":"L. C. Cheever","urlCharacter":"http://www.imdb.com/character/ch0028881","main":true},{"actorName":"Charles Martin Smith","urlProfile":"http://www.imdb.com/name/nm0001747","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDMxMDk2M15BMl5BanBnXkFtZTcwMzcxODYzMw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 October 1953","placeOfBirth":" Van Nuys, California, USA","height":"5' 5\" (1.65 m)","bio":"Charles Martin Smith is an American film actor, writer, and director. Born in Van Nuys, California, Smith was discovered by a talent agent while acting in a school play, usually a rare occurrence. After a few years of working in film, he landed the role of Terry \"The Toad\" Fields in George Lucas' 1973 film, American Graffiti (1973). The sequel, More American Graffiti (1979), did not have the success of the original, but he gained notice in The Buddy Holly Story (1978), Never Cry Wolf (1983) and the successful Starman (1984). Smith's career continued mainly in supporting roles, but he received good reviews for his work in The Untouchables (1987). While his career was largely unremarkable in the 1990s after appearing in less successful films, such as Speechless (1994) and I Love Trouble (1994), Smith turned in a well-regarded performance in the TV miniseries Larry McMurtry's Streets of Laredo (1995) and a minor role in the big budget Deep Impact (1998). He was also one of the directors of the TV series Space: Above and Beyond (1995), as well as the director of the initial episode (\"Welcome to the Hellmouth\") that launched the hit TV series Buffy the Vampire Slayer (1997). Since the mid-1990s, Smith has increasingly focused on his work behind the camera. He directed the feature film Air Bud (1997) (Disney), and two TV miniseries for Hallmark Entertainment, Roughing It (2002) and Icon (2005). He also wrote and directed the feature film, The Snow Walker (2003), for Lion's Gate Films, based on a story by Farley Mowat (Never Cry Wolf (1983)), which marked a return to the Arctic for Smith. He then wrote and directed the feature film Stone of Destiny (2008), for Infinity Features and Odeon Sky, the true story of four young Scottish students who broke into Westminster Abbey in London to take back a sacred Scottish relic. The film stars Charlie Cox, Kate Mara and Robert Carlyle, and was nominated for Best Picture by the Scottish BAFTAS. He now resides in Canada and continues to add to production, directing, acting, and writing credits in a career that has spanned over 35 years. His next film, Dolphin Tale (2011), for Alcon (The Blind Side (2009)) and Warner Brothers, which he also wrote and directed, stars Harry Connick Jr., Ashley Judd, Morgan Freeman, and Winter, the dolphin, who plays herself in the film. The movie is scheduled to be released Sept. 23, 2011 by WB.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDMxMDk2M15BMl5BanBnXkFtZTcwMzcxODYzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001747","name":"Charles Martin Smith","idIMDB":"nm0001747"},"actorId":"nm0001747","character":"Roy Durucher","urlCharacter":"http://www.imdb.com/character/ch0036727","main":true},{"actorName":"Robert Downey Jr.","urlProfile":"http://www.imdb.com/name/nm0000375","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1965","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Robert John Downey Jr","height":"5' 8½\" (1.74 m)","bio":"Robert Downey Jr. has evolved into one of the most respected actors in Hollywood. With an amazing list of credits to his name, he has managed to stay new and fresh even after over four decades in the business. Downey was born April 4, 1965 in Manhattan, New York, the son of writer, director and filmographer Robert Downey Sr. and actress Elsie Downey (née Elsie Ann Ford). Robert's father is of half Lithuanian Jewish, one quarter Hungarian Jewish, and one quarter Irish, descent, while Robert's mother was of English, Scottish, German, and Swiss-German ancestry. Robert and his sister, Allyson Downey, were immersed in film and the performing arts from a very young age, leading Downey Jr. to study at the Stagedoor Manor Performing Arts Training Center in upstate New York, before moving to California with his father following his parents' 1978 divorce. In 1982, he dropped out of Santa Monica High School to pursue acting full time. Downey Sr., himself a drug addict, exposed his son to drugs at a very early age, and Downey Jr. would go on to struggle with abuse for decades. Downey Jr. made his debut as an actor at the age of five in the film Pound (1970), written and directed by his father, Robert Downey Sr.. He built his film repertoire throughout the 1980s and 1990s with roles in Tuff Turf (1985), Weird Science (1985), True Believer (1989), and Wonder Boys (2000) among many others. In 1992, Downey received an Academy Award nomination and won the BAFTA (British Academy Award) for Best Actor for his performance in the title role of Chaplin (1992). In Robert Altman's Short Cuts (1993), he appeared as an aspiring film make-up artist whose best friend commits murder. In Oliver Stone's Natural Born Killers (1994), with Woody Harrelson and Juliette Lewis, Downey starred as a tabloid TV journalist who exploits a murderous couple's killing spree to boost his ratings. For the comedy Heart and Souls (1993), Downey starred as a young man with a special relationship with four ghosts. In 1995, Downey starred in Restoration (1995), with Hugh Grant, Meg Ryan and Ian McKellen, directed by Michael Hoffman. Also that year, he starred in Richard III (1995), in which he appears opposite his Restoration (1995) co-star McKellen. In 1997, Downey was seen in Robert Altman's The Gingerbread Man (1998), alongside Kenneth Branagh, Daryl Hannah and Embeth Davidtz; in One Night Stand (1997), directed by Mike Figgis and starring Wesley Snipes and Nastassja Kinski; and in Hugo Pool (1997), directed by his father, Robert Downey Sr. and starring Sean Penn and Patrick Dempsey. In September of 1999, Downey appeared in Black & White (1999), written and directed by James Toback, along with Ben Stiller, Elijah Wood, Gaby Hoffmann, Brooke Shields and Claudia Schiffer. In January of 1999, he starred with Annette Bening and Aidan Quinn in In Dreams (1999), directed by Neil Jordan. In 2000, Downey co-starred with Michael Douglas and Tobey Maguire in Wonder Boys (2000), directed by Curtis Hanson. In this dramatic comedy, Downey played the role of a bisexual literary agent. In 2001, Downey made his prime-time television debut when he joined the cast of the Fox-TV series Ally McBeal (1997) as attorney \"Larry Paul\". For this role, he won the Golden Globe Award for Best Performance by an Actor in a Supporting Role in a Series, Mini-Series or Motion Picture Made for Television, as well as the Screen Actors Guild Award for Outstanding Performance by a Male in a Comedy Series. In addition, Downey was nominated for an Emmy for Outstanding Supporting Actor in a Comedy Series. The actor's drug-related problems escalated from 1996 to 2001, leading to arrests, rehab visits and incarcerations, and he was eventually fired from Ally McBeal (1997). Emerging clean and sober in 2003, Downey Jr. began to rebuild his career. He marked his debut into music with his debut album, titled \"The Futurist\", on the Sony Classics Label on November 23rd, 2004. The album's eight original songs, that Downey wrote, and his two musical numbers debuting as cover songs revealed his sultry singing voice and his musical talents. Downey displayed his versatility in two different films in October 2003: the musical/drama The Singing Detective (2003), a remake of the BBC hit of the same name, and the thriller Gothika (2003) starring Halle Berry and Penélope Cruz. Downey starred in powerful yet humbling roles inspired by real-life accounts of some of history's most precious kept secrets, including Richard Linklater's A Scanner Darkly (2006) in 2006 co-starring Keanu Reeves, Winona Ryder and Woody Harrelson, and Fur: An Imaginary Portrait of Diane Arbus (2006) co-starring Nicole Kidman, a film inspired by the life of Diane Arbus, the revered photographer whose images captured attention in the early 1960s. These roles exhibited Downey's momentum from the previous year of 2005, in which he starred in the Academy Award®-nominated feature film Good Night, and Good Luck. (2005), directed by George Clooney and in Shane Black's action comedy Kiss Kiss Bang Bang (2005) co-starring Val Kilmer. In 2007, he co-starred in David Fincher's suspenseful _Zodiac (2007/I)_ alongside Jake Gyllenhaal and Mark Ruffalo, about the notorious serial killer who haunted San Francisco during the 1970s. In May 2008, Downey achieved critical acclaim and worldwide box office success for his starring role in Iron Man (2008), Jon Favreau's big-screen rendering of the Marvel comic book superhero. The film co-starred Gwyneth Paltrow, Jeff Bridges and Terrence Howard. In August of 2008, Downey starred with Ben Stiller and Jack Black in the comedy Tropic Thunder (2008), and went on to receive an Academy Award®-nomination for Best Supporting Actor for his, Kirk Lazarus. In December 2009, Downey starred in the action-adventure Sherlock Holmes (2009). The film, directed by Guy Ritchie, co-starred Jude Law and Rachel McAdams and earned Downey a Golden Globe for Best Performance by an Actor in a Motion Picture - Comedy or Musical in January of 2010. In early Summer 2010, Downey re-teamed with director Jon Favreau and reprised his role as \"Tony Stark/Iron Man\" in the hugely successful sequel to the original film, Iron Man 2 (2010), starring Gwyneth Paltrow, Scarlett Johansson, Samuel L. Jackson and Mickey Rourke. Downey next starred in Due Date (2010), a comedy directed by Todd Phillips, in which he plays the role of an expectant father on a road trip racing to get back in time for the birth of his first child. Due Date (2010), starring The Hangover (2009)'s Zach Galifianakis, was released in November 2010. Downey was honored by Time Magazine's \"Time 100\" in 2008, an annual list of the 100 most influential people in the world. His laurels include two Academy Award nominations, three Golden Globe wins, numerous other award nominations and wins, and tremendous popular and commercial success, particularly in his roles as Sherlock Holmes and Tony Stark (the latter of which he has so far played in Iron Man (2008), Iron Man 2 (2010), The Avengers (2012), Iron Man 3 (2013), and Avengers: Age of Ultron (2015). For three consecutive years, from 2012 to 2015, Downey has topped the Forbes list of Hollywood's highest-paid actors, making an estimated $80 million in earnings between June 2014 and June 2015. In 2005, Downey Jr. married Susan Downey, who gave birth to their son, Exton Elias Downey, on February 7, 2012. Downey also has another son, Indio Falconer Downey, born September 7, 1993, from his first marriage to Deborah Falconer, from whom he was officially divorced in 2004. Robert has jump-started the Team Downey Production Company with wife Susan Downey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000375","name":"Robert Downey Jr.","nicknames":["Bob","RDJ"],"idIMDB":"nm0000375"},"actorId":"nm0000375","character":"Telephone Jack","urlCharacter":"http://www.imdb.com/character/ch0036725","main":true},{"actorName":"Saverio Guerra","urlProfile":"http://www.imdb.com/name/nm0346089","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1OTk2Mjg2N15BMl5BanBnXkFtZTcwOTk4MTYzNA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1964","placeOfBirth":" Brooklyn, New York, USA","height":"5' 7\" (1.7 m)","bio":"Saverio Guerra was born on August 25, 1964 in Brooklyn, New York, USA. He is an actor and director, known for Show Me a Hero (2015), The Detour (2016) and Curb Your Enthusiasm (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1OTk2Mjg2N15BMl5BanBnXkFtZTcwOTk4MTYzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0346089","name":"Saverio Guerra","idIMDB":"nm0346089"},"actorId":"nm0346089","character":"Lester","urlCharacter":"http://www.imdb.com/character/ch0133080","main":true},{"actorName":"Danny Hoch","urlProfile":"http://www.imdb.com/name/nm0387773","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE4Njk3Nzc1OV5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 November 1970","placeOfBirth":" Brooklyn, New York City, New York, USA","bio":"Born and raised in New York City, Danny Hoch (rhymes with rock) attended the High School of Performing Arts where he began his studies in theatre. After studying in London and then working with a high-octane theatre troupe (Creative Arts Team) in NYC's jails and high schools, Mr. Hoch began to develop his unique brand of solo performance or monologues, where he portrays a dozen or so characters of all ages and backgrounds in one piece, usually 90 minutes long. These solo shows eventually became cult classics which were taped for HBO (Some People, 1995) and as a feature film (Jails, Hospitals & Hip-Hop 1998). Five of these tour-de forces have been performed all over the U.S. and the world, as well as other plays written by Mr. Hoch. Mr. Hoch's theatre work has garnered him several awards for both writing as well as performance, including the prestigious Guggenheim Fellowship, 2 OBIE's, a USA Ford Fellowship, a Creative Capital Award, the CalArts Alpert Award in Theatre, and several Sundance Institute Fellowships, where he developed his classic film Whiteboyz (1999), which was developed from a character in Jails, Hospitals & Hip-Hop (1998)_. In 2000 He founded the Hip-Hop Theater Festival to promote and support Hip-Hop Generation arts and artists, which is still in existence today. Having worked with such lauded theatre artists as Nilaja Sun, Eisa Davis, Will Power, Liza Colon-Zayas and Marc Bamuthi Joseph, he has also worked in film and television alongside such talents as Keanu Reeves, James Caan, Edie Falco, Boaz Yakin, Joaquin Phoenix, Margaret Cho, Paul Giamatti, Liev Schreiber, Jason Statham and Eric Bana, and has had the opportunity to work for directors such as Curtis Hanson, Steven Spielberg, John Turturro, Spike Lee, Darnell Martin, James Gray, Marc Levin and Terrence Malick. His writing has been published in the New York Times, Village Voice, The Nation, Harpers, American Theatre Magazine and several books, including an anthology of his work which is to be released in late 2013 by TCG. In addition to mastering scores of accents both regional and international, he also speaks fluent Spanish, and has performed his solo shows in 5 Latin American countries- in different accents (Dominican, Puerto Rican, Cuban, Mexican, Argentinian, Chilean and Castilian). It is reported that very few people know what his regular speaking voice actually sounds like. A bit of trivia: At the High School of Performing Arts, Danny Hoch went to High School with Jennifer Aniston, Eagle Eye Cherry, Marlon Wayans, Adrien Brody, Reno Wilson, Seth Gilliam, Curtis McClaren, Dondre Whitfield, Alex Desert, Carl Payne, Kirk Acevedo and Rory Cochrane. Last year he was seen on Broadway in a play by Woody Allen and Ethan Coen, alongside Steve Guttenberg, Marlo Thomas and Marc Linn-Baker.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE4Njk3Nzc1OV5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0387773","name":"Danny Hoch","idIMDB":"nm0387773"},"actorId":"nm0387773","character":"Bobby Basketball","urlCharacter":"http://www.imdb.com/character/ch0133079","main":true},{"actorName":"Kenny Cau","urlProfile":"http://www.imdb.com/name/nm2633219","urlPhoto":"","biography":{"bio":"Kenny Cau is an actor, known for Lucky You (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2633219","name":"Kenny Cau","idIMDB":"nm2633219"},"actorId":"nm2633219","character":"Chinese Restaurant Waiter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kelvin Han Yee","urlProfile":"http://www.imdb.com/name/nm0947172","urlPhoto":"","biography":{"bio":"Kelvin Han Yee is an American actor of Asian decent who's career spans over 30 years of film, television and theater. He was discovered by the American Conservatory Theatre working as a bouncer but then went on to act at regional theaters like Oregon Shakespeare Festival at Ashland, Berkeley Repertory Theater and The Huntington Theater. in 1985 he was cast in the first American movie shot in the People's Republic of China, as the all-American-Chinese teenager in A Great Wall, and has appeared in many films including Milk, Lucky You, The Island, Copycat, True Crime. On television he continues to demonstrate a great range of characters on shows like Chicago PD, Hawaii Five 0, The Mentalist, Lie To Me, Criminal Minds, Prison Break, 24, Chuck, Entourage, Accidentally On Purpose, Curb Your Enthusiasm, Nash Bridges and in Soap Operas. He has used his background to help others by mentoring incarcerated youths, bringing arts education to public schools and youth advocacy. He plays the guitar loudly and badly. He is passionate about food and enjoys cooking for his wife and his best friend; a rescued 60lb English Bulldog named Louie who is also an actor.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0947172","name":"Kelvin Han Yee","idIMDB":"nm0947172"},"actorId":"nm0947172","character":"Chico Banh","urlCharacter":"http://www.imdb.com/character/ch0101109","main":true}],"seasons":[],"idIMDB":"tt0338216","urlIMDB":"http://www.imdb.com/title/tt0338216","business":{"budget":{"money":"$55,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$2,710,445","country":"USA","day":"06","month":"05","year":"2007","remarks":"2,525 Screens"},{"money":"£56,346","country":"UK","day":"24","month":"06","year":"2007","remarks":"115 Screens"}],"gross":[{"money":"$5,755,286","country":"USA","day":"01","month":"07","year":"2007","remarks":""},{"money":"$5,727,530","country":"USA","day":"24","month":"06","year":"2007","remarks":""},{"money":"$5,686,531","country":"USA","day":"17","month":"06","year":"2007","remarks":""},{"money":"$5,666,145","country":"USA","day":"10","month":"06","year":"2007","remarks":""},{"money":"$5,616,175","country":"USA","day":"03","month":"06","year":"2007","remarks":""},{"money":"$5,594,754","country":"USA","day":"27","month":"05","year":"2007","remarks":""},{"money":"$5,490,689","country":"USA","day":"20","month":"05","year":"2007","remarks":""},{"money":"$2,710,445","country":"USA","day":"06","month":"05","year":"2007","remarks":""},{"money":"£56,346","country":"UK","day":"24","month":"06","year":"2007","remarks":""}],"weekendGross":[{"money":"$6,482","country":"USA","day":"01","month":"07","year":"2007","remarks":"20 Screens"},{"money":"$37,411","country":"USA","day":"24","month":"06","year":"2007","remarks":"140 Screens"},{"money":"$10,398","country":"USA","day":"17","month":"06","year":"2007","remarks":"18 Screens"},{"money":"$43,854","country":"USA","day":"10","month":"06","year":"2007","remarks":"40 Screens"},{"money":"$10,437","country":"USA","day":"03","month":"06","year":"2007","remarks":"36 Screens"},{"money":"$35,424","country":"USA","day":"27","month":"05","year":"2007","remarks":"60 Screens"},{"money":"$160,940","country":"USA","day":"20","month":"05","year":"2007","remarks":"345 Screens"},{"money":"$2,710,445","country":"USA","day":"06","month":"05","year":"2007","remarks":"2,525 Screens"},{"money":"£56,346","country":"UK","day":"24","month":"06","year":"2007","remarks":"115 Screens"}],"admissions":[{"money":"23,531","country":"Germany","day":"31","month":"07","year":"2007","remarks":""}],"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":[{"money":null,"country":null,"day":"28","month":"03","year":"2005","remarks":null},{"money":null,"country":null,"day":"14","month":"05","year":"2005","remarks":null}],"copyrightHolder":"Lonely Film Productions"},"technical":{"runtime":["2 hr 4 min (124 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA (prints)"],"filmLength":null,"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Fuji Eterna-CP 3513DI)","D-Cinema"]},"rating":"5.9","metascore":"49","filmingLocations":[{"location":"Lake Las Vegas, Henderson, Nevada, USA"}],"rated":"PG-13","awards":[{"award":"Australian Film Institute 2007","titlesAwards":[{"titleAwardOutcome":"Nominated AFI International Award","categories":[{"category":"Best Actor","names":[{"name":"Eric Bana","id":"nm0051509","role":null}]}]}]}],"votes":"18,653","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."},{"idCompany":"co0108864","name":"Village Roadshow Pictures"},{"idCompany":"co0086846","name":"Deuce Three Productions"}],"keywords":{"keywords":["poker","poker player","losing","reference to frederic chopin","reference to johannes brahms","celebrity playing himself","celebrity playing herself","father son reunion","watch","casino dealer","dyed hair","eating with chopsticks","reference to jack nicklaus","black eye","father son rivalry","vietnamese american","compulsive gambler","year 2003","pawnbroker","wedding ring","pawn ticket","texas hold 'em","reference to broderick crawford","armed guard","superstition","sister sister relationship","golf course","running","compulsion","slot machine","blackjack","chinese restaurant","motorcyclist","pick up line","watching tv","body language","volleyball","playing cards","addiction","golf","obsession","diner","singing","betting","motorcycle","nightclub","poker chip","jazz combo","bluff","singer","gambling","ring","digital camera","world series of poker","poker tournament","poker game","pawnshop","debt","casino","bet","surprise after end credits","las vegas nevada","gambler","father son relationship"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:48:09"}}