{"data":{"movies":[{"title":"Mysterious Skin","originalTitle":"","year":"2004","releaseDate":"20050624","directors":[{"name":"Gregg Araki","id":"nm0000777"}],"writers":[{"name":"Gregg Araki","id":"nm0000777"},{"name":"Scott Heim","id":"nm1721077"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMjQ4NzE5OF5BMl5BanBnXkFtZTcwNzkwOTkyMQ@@._V1.jpg","countries":["USA","Netherlands"],"languages":["English"],"genres":["Drama","Mystery"],"plot":"Brian Lackey is determined to discover what happened during an amnesia blackout when he was eight years old, and then later woke with a bloody nose. He believes he was abducted by aliens, and N. McCormick, a fellow player on Brian's childhood baseball team, may be the key as to exactly what happened that night. As Brian searches for the truth and tries to track him down, Neil McCormick takes up hustling and moves to New York, in attempts to forget childhood memories that haunt him. Together, the two of them uncover the terrible truth of the scars they share.","simplePlot":"A teenage hustler and a young man obsessed with alien abductions cross paths, together discovering a horrible, liberating truth.","actors":[{"actorName":"Chase Ellison","urlProfile":"http://www.imdb.com/name/nm0255175","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTExMDA4MjM2MV5BMl5BanBnXkFtZTgwOTUzOTAzMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 September 1993","placeOfBirth":" Reno, Nevada, USA","height":"5' 10\" (1.78 m)","bio":"Chase Ellison was born on September 22, 1993 in Reno, Nevada, USA. He is an actor, known for Mysterious Skin (2004), Wristcutters: A Love Story (2006) and That's What I Am (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTExMDA4MjM2MV5BMl5BanBnXkFtZTgwOTUzOTAzMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0255175","name":"Chase Ellison","idIMDB":"nm0255175"},"actorId":"nm0255175","character":"Neil","urlCharacter":"http://www.imdb.com/character/ch0016614","main":true},{"actorName":"George Webster","urlProfile":"http://www.imdb.com/name/nm1530280","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NDg1NTc2OV5BMl5BanBnXkFtZTgwNzUwODQxMTE@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 June 1994","placeOfBirth":" Bellflower, California, USA","height":"5' 5½\" (1.66 m)","bio":"George Webster was born on June 24, 1994 in Bellflower, California, USA. He is an actor, known for Mysterious Skin (2004), The Box (2013) and Final Witness (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NDg1NTc2OV5BMl5BanBnXkFtZTgwNzUwODQxMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1530280","name":"George Webster","idIMDB":"nm1530280"},"actorId":"nm1530280","character":"Brian","urlCharacter":"http://www.imdb.com/character/ch0101774","main":true},{"actorName":"Rachael Nastassja Kraft","urlProfile":"http://www.imdb.com/name/nm1441864","urlPhoto":"","biography":{"dateOfBirth":"17 April 1992","placeOfBirth":" Los Angeles, California, USA","height":"5' 3\" (1.6 m)","bio":"Rachael Nastassja Kraft was born on April 17, 1992 in Los Angeles, California. She has one brother, David, who was born in 2000. Rachael, or Rae, has been acting since the age of five, starting with commercials. She has performed in many musical theatre productions and the play J.B. at the Powerhouse Playhouse in Santa Monica. From there, she has appeared in many movies and most recently, Mysterious Skin (2004), with Joseph Gordon Levitt, Elizabeth Shue and Lisa Long.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1441864","name":"Rachael Nastassja Kraft","idIMDB":"nm1441864"},"actorId":"nm1441864","character":"Deborah","urlCharacter":"http://www.imdb.com/character/ch0254068","main":true},{"actorName":"Lisa Long","urlProfile":"http://www.imdb.com/name/nm0519076","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg2MDIyMDUyNl5BMl5BanBnXkFtZTgwNjc1MjAyMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Lisa Long is an actress and producer, known for Mysterious Skin (2004), Cast Away (2000) and Yes Man (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg2MDIyMDUyNl5BMl5BanBnXkFtZTgwNjc1MjAyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0519076","name":"Lisa Long","idIMDB":"nm0519076"},"actorId":"nm0519076","character":"Mrs. Lackey","urlCharacter":"http://www.imdb.com/character/ch0456932","main":true},{"actorName":"Chris Mulkey","urlProfile":"http://www.imdb.com/name/nm0611889","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzIyNjg1Ml5BMl5BanBnXkFtZTgwNzE2MzAyNjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 May 1948","placeOfBirth":" Viroqua, Wisconsin, USA","birthName":"Christian Homer Mulkey Jr.","height":"6' 1\" (1.85 m)","bio":"Chris Mulkey was born on May 3, 1948 in Viroqua, Wisconsin, USA as Christian Homer Mulkey Jr. He is an actor and producer, known for Whiplash (2014), Captain Phillips (2013) and First Blood (1982). He was previously married to Karen Landry and Lorraine M Smith.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzIyNjg1Ml5BMl5BanBnXkFtZTgwNzE2MzAyNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0611889","name":"Chris Mulkey","idIMDB":"nm0611889"},"actorId":"nm0611889","character":"Mr. Lackey","urlCharacter":"http://www.imdb.com/character/ch0092082","main":true},{"actorName":"Elisabeth Shue","urlProfile":"http://www.imdb.com/name/nm0000223","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5ODk5OTU3MV5BMl5BanBnXkFtZTcwNjM1NDUxMg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 October 1963","placeOfBirth":" Wilmington, Delaware, USA","birthName":"Elisabeth Judson Shue","height":"5' 2\" (1.57 m)","bio":"Elisabeth Shue was born in Wilmington, Delaware, to Anne Brewster (Wells), who worked for the Chemical Banking Corporation, and James William Shue, a lawyer and real estate developer. She is of German and English ancestry, including descent from Mayflower passengers. Shue's parents divorced while she was in the fourth grade. Owing to the occupational demands of her parents, Shue and her siblings found plenty of time to get into trouble in their suburban neighborhood, but Elisabeth soon enrolled in Wellesley College, an all-female institution which kept her out of trouble. During her studies, she found a way to make a little extra money by acting in television commercials. Elisabeth became a common sight in ads for Burger King, DeBeers diamonds, and Hellman's mayonnaise. In 1984, she landed a role in the The Karate Kid (1984) as the on-screen girlfriend of Ralph Macchio and a role as the teenage daughter of a military family in the short-lived series Call to Glory (1984). At this time, Shue got herself an acting coach and transferred to Harvard, where she began studying political science. She continued her acting work with Adventures in Babysitting (1987), Cocktail (1988), Soapdish (1991) and The Marrying Man (1991). Unfortunately, time was catching up with the impressive girl-next-door. Her brother Andrew Shue had almost eclipsed her own fame by landing a starring role in the hit TV series Melrose Place (1992). It was at this time that Elisabeth took a chance on a low-budget, high-risk project entitled Leaving Las Vegas (1995), directed by Mike Figgis. Her gutsy portrayal of a prostitute mixed up with a suicidal alcoholic paid off as she was recognized with a Best Actress nomination at the Academy Awards that year. This was the turning point of her career. What followed was a barrage of film roles, including The Saint (1997), Woody Allen's Deconstructing Harry (1997), Palmetto (1998) and Hollow Man (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5ODk5OTU3MV5BMl5BanBnXkFtZTcwNjM1NDUxMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000223","name":"Elisabeth Shue","nicknames":["Lisa"],"idIMDB":"nm0000223"},"actorId":"nm0000223","character":"Mrs. McCormick","urlCharacter":"http://www.imdb.com/character/ch0033554","main":true},{"actorName":"David Lee Smith","urlProfile":"http://www.imdb.com/name/nm0807900","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MDQwODYwNF5BMl5BanBnXkFtZTcwMDU4NzAzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 September 1963","placeOfBirth":" Birmingham, Alabama, USA","bio":"David Lee Smith grew up in Birmingham, Alabama, where he graduated from Banks High School. He went on to graduate from the University of Alabama and later earned a Master of Fine Arts degree from SMU.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MDQwODYwNF5BMl5BanBnXkFtZTcwMDU4NzAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0807900","name":"David Lee Smith","idIMDB":"nm0807900"},"actorId":"nm0807900","character":"Alfred","urlCharacter":"http://www.imdb.com/character/ch0268696","main":true},{"actorName":"Bill Sage","urlProfile":"http://www.imdb.com/name/nm0756083","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NDc4MzA2OF5BMl5BanBnXkFtZTgwMDkwNzUzMDI@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 April 1962","placeOfBirth":" New York City, New York, USA","bio":"Bill Sage was born on April 3, 1962 in New York City, New York, USA. He is an actor, known for Hap and Leonard (2016), We Are What We Are (2013) and EvenHand (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NDc4MzA2OF5BMl5BanBnXkFtZTgwMDkwNzUzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0756083","name":"Bill Sage","idIMDB":"nm0756083"},"actorId":"nm0756083","character":"Coach","urlCharacter":"http://www.imdb.com/character/ch0229659","main":true},{"actorName":"Riley McGuire","urlProfile":"http://www.imdb.com/name/nm1921293","urlPhoto":"","biography":{"bio":"Riley McGuire is an actress, known for Mysterious Skin (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1921293","name":"Riley McGuire","idIMDB":"nm1921293"},"actorId":"nm1921293","character":"Wendy","urlCharacter":"http://www.imdb.com/character/ch0134445","main":true},{"actorName":"Ryan Stenzel","urlProfile":"http://www.imdb.com/name/nm1921609","urlPhoto":"","biography":{"bio":"Ryan Stenzel is an actor, known for Mysterious Skin (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1921609","name":"Ryan Stenzel","idIMDB":"nm1921609"},"actorId":"nm1921609","character":"Stephen Zepherelli","urlCharacter":"http://www.imdb.com/character/ch0456933","main":true},{"actorName":"Joseph Gordon-Levitt","urlProfile":"http://www.imdb.com/name/nm0330687","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzOTg0NTkzNF5BMl5BanBnXkFtZTcwNTQ4MTcwOQ@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1981","placeOfBirth":" Los Angeles, California, USA","birthName":"Joseph Leonard Gordon-Levitt","height":"5' 9¼\" (1.76 m)","bio":"Joseph Leonard Gordon-Levitt was born February 17, 1981 in Los Angeles, California, to Jane Gordon and Dennis Levitt. Joseph was raised in a Jewish family with his late older brother, Dan Gordon-Levitt, who passed away in October 2010. His parents worked for the Pacifica Radio station KPFK-FM and his maternal grandfather, Michael Gordon, had been a well-known movie director. After working for several years as a child actor, Joseph became better known for starring on the hit television series 3rd Rock from the Sun (1996), for which he earned two Hollywood Reporter Young Star Awards. In addition, the show earned three Screen Actors Guild Award nominations for Outstanding Peformance by an Ensemble in a Comedy Series. Prior to his success on television, Joseph had already worked steadily in feature films, debuting in the Robert Redford film A River Runs Through It (1992). He won a Young Artist Award for the latter film. During the 1990s, he also co-starred in the films Angels in the Outfield (1994), The Juror (1996), Halloween H20: 20 Years Later (1998), and 10 Things I Hate About You (1999). Following his work on 3rd Rock from the Sun (1996), Joseph took time off from acting to attend Columbia University. In the early 2000s, he broke from the mold of his television and film comedy supporting roles by appearing in a string of intense dramatic roles, mostly in smaller, independent films such as Manic (2001), with Don Cheadle; Mysterious Skin (2004), for writer/director Gregg Araki; Rian Johnson's award-winning debut film, Brick (2005); Lee Daniels' Shadowboxer (2005); the crime drama The Lookout (2007), which marked Scott Frank's directorial debut; John Madden's Killshot (2008), with Diane Lane and Mickey Rourke; and the controversial drama Stop-Loss (2008), in which he starred with Ryan Phillippe, under the direction of Kimberly Peirce. By 2009, Joseph was officially established as one of the leading men of indie cinema with his Golden Globe-nominated role in the comedy-drama 500 Days of Summer (2009), for which he also received an Independent Spirit Award nod. He also adapted the Elmore Leonard short story Sparks into a 24-minute short film that he directed (Sundance Film Festival 2009). In 2010, he headlined the indie drama Hesher (2010) and also established himself as a mainstream star in Christopher Nolan's Inception (2010). Balancing both independent and Hollywood film, Joseph scored another Golden Globe nod for the cancer drama 50/50 (2011), directed by Jonathan Levine and also starring Seth Rogen, Anna Kendrick, and Bryce Dallas Howard. He worked again with director Nolan on The Dark Knight Rises (2012) (for which he received a People's Choice Award nomination for Favorite Movie Actor), and snagged leading roles in both Premium Rush (2012), directed by David Koepp, and Looper (2012), for which he reunited with his Brick director, Rian Johnson, and starred opposite Bruce Willis and Emily Blunt. Also in 2012, he played Abraham Lincoln's son Robert in Steven Spielberg's Oscar-nominated Lincoln (2012), with Daniel Day-Lewis and Sally Field. In 2013, Joseph Gordon-Levitt starred in his critically-acclaimed feature film directorial debut, Don Jon, from a script he wrote, opposite Scarlett Johansson and Julianne Moore. He was nominated for an Independent Spirit Award for \"Best First Screenplay\" for the film. Gordon-Levitt provided the voice of Jiro Horikoshi in the 2014 English-language version of Hayao Miyazaki's Academy Award-nominated animated feature The Wind Rises, and appeared in Robert Rodriguez and Frank Miller's Sin City: A Dame to Kill For (2014), in which he played Johnny, a character Miller created for the film. Gordon-Levitt founded and directs hitRECord, an open collaborative production. hitRECord creates and develops art and media collectively using their website where anyone with an internet connection can upload their records, download and remix others' records, and work on projects together. When the results of these RECords are produced and make money, hitRECord splits the profits 50/50 with everybody who contributed to the final production. hitRECord has published books, put out records, gone on tour and has screened their work at major festivals including Sundance and TIFF. \"RegularJOE\" (as he's known on the site) is leading the community of over 300, 000 artists in its biggest collaboration yet, a new take on a variety show called \"HitRecord on TV!\" The half hour series, which Gordon-Levitt hosts, premiered in January on Participant Media's new cable network, Pivot and has been renewed for a second season.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzOTg0NTkzNF5BMl5BanBnXkFtZTcwNTQ4MTcwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0330687","name":"Joseph Gordon-Levitt","nicknames":["Joe","Joey","JGL","Regular Joe"],"idIMDB":"nm0330687"},"actorId":"nm0330687","character":"Neil","urlCharacter":"http://www.imdb.com/character/ch0016614","main":true},{"actorName":"Richard Riehle","urlProfile":"http://www.imdb.com/name/nm0726223","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNDgyMDcwOV5BMl5BanBnXkFtZTgwODkwNjY0MTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1948","placeOfBirth":" Menomonee Falls, Wisconsin, USA","height":"5' 9\" (1.75 m)","bio":"Richard Riehle was born in Menomonee Falls, Wisconsin, to Mary Margaret (Walsh), a nurse, and Herbert John Riehle, an assistant postmaster. He is of German and Irish descent. Richard attended the University of Notre Dame, where he became heavily involved with the University Theatre. Appearing in such productions as \"Luther\", \"Antigone\", \"Rhinoceros\", \"Romeo and Juliet\", and \"How To Succeed In Business Without Really Trying\", he also took on the task of stage manager on many of these productions, and it was not unusual to find him helping to build the sets or manage the costumes during this period. Graduating with a B.A. (cum laude) in 1970, Richard traveled to Salzburg and Innsbruck to study German, a language in which he is fluent. Progressing to Academy of Dramatic Art in Rochester, Michigan, Richard has had extensive experience as a stage actor, as well as teaching acting, and made his Broadway debut in 1986 with \"Execution of Justice\". One of his major triumphs in the theatre has been alongside Kevin Spacey in the acclaimed 1999 revival of O'Neill's \"The Iceman Cometh\", in which he played the drunken, corrupt ex-cop Pat McGloin. Brief appearances in Rooster Cogburn, The Duchess and Dirtwater Fox, Joy Ride, and Twice in a Lifetime, as well as in such TV fare as Escape From Hell (1977), Joe Kennedy: The Forgotten Kennedy (1977), and the NBC series \"Hot Pursuit\" (1984) have disguised an expanding repertory theatre portfolio. Richard has also contributed to such diverse undertakings as Bay Area Radio's Eugene O'Neill Project (playing Smithers to Joe Morton's Brutis Jones in \"The Emperor Jones\") and the Adams-Jefferson Project of Carleton College, participating in a series of recordings of the correspondence between the two US Presidents. To this day, Richard has maintained his involvement in theatre workshops and encouraging the dramatic arts under the auspices of the Mark Taper Forum and A.S.K. However, since his scene-stealing cameo as the Quartermaster in 1989's Glory, with his trademark bushy mustache and heavyset frame, Richard has acquitted himself as one of the best, and busiest, character players on TV and in the movies.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNDgyMDcwOV5BMl5BanBnXkFtZTgwODkwNjY0MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0726223","name":"Richard Riehle","idIMDB":"nm0726223"},"actorId":"nm0726223","character":"Charlie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michelle Trachtenberg","urlProfile":"http://www.imdb.com/name/nm0005502","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNjQ3MTAxMl5BMl5BanBnXkFtZTcwNDI0OTQ3Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 October 1985","placeOfBirth":" New York City, New York, USA","birthName":"Michelle Christine Trachtenberg","height":"5' 7½\" (1.71 m)","bio":"Trachtenberg grew up in Brooklyn and started her acting career young; she began appearing in commercials at the age of 3. She continued to act and dance through her school years, making regular television appearances from the age of 10. She landed a recurring role in the kids' TV show The Adventures of Pete & Pete (1992) and starred in Harriet the Spy (1996), but it was her role as Buffy's sister Dawn from the fifth season of Buffy the Vampire Slayer (1997) that really brought her to worldwide attention, and all before she was 18 years old. More high profile TV and movie work followed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNjQ3MTAxMl5BMl5BanBnXkFtZTcwNDI0OTQ3Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005502","name":"Michelle Trachtenberg","idIMDB":"nm0005502"},"actorId":"nm0005502","character":"Wendy","urlCharacter":"http://www.imdb.com/character/ch0134445","main":true},{"actorName":"Brady Corbet","urlProfile":"http://www.imdb.com/name/nm1227232","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MDUwOTI4MF5BMl5BanBnXkFtZTcwOTgxMTI1NQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 August 1988","placeOfBirth":" Scottsdale, Arizona, USA","birthName":"Brady James Monson Corbet","height":"5' 9\" (1.75 m)","bio":"American actor Brady James Monson Corbet was born on August 17, 1988, in Scottsdale, AZ. Brady made his film debut as Mason Freeland in 2003's \"Thirteen\" and later had roles as Brian Lackey in \"Mysterious Skin\" and as Alan Tracy in \"Thunderbirds.\" He also has guest starred on the television shows \"Greetings From Tucson,\" \"Oliver Beene\" and \"The King Of Queens,\" but he is most known for his role as Derek Huxley on the fifth season of \"24.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MDUwOTI4MF5BMl5BanBnXkFtZTcwOTgxMTI1NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1227232","name":"Brady Corbet","idIMDB":"nm1227232"},"actorId":"nm1227232","character":"Brian","urlCharacter":"http://www.imdb.com/character/ch0101774","main":true},{"actorName":"Larry Marko","urlProfile":"http://www.imdb.com/name/nm0548570","urlPhoto":"","biography":{"bio":"Larry Marko is an actor, known for Mysterious Skin (2004), Body Heat (1981) and You Don't Mess with the Zohan (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0548570","name":"Larry Marko","idIMDB":"nm0548570"},"actorId":"nm0548570","character":"Old man with scar","urlCharacter":"http://www.imdb.com/character/ch0429412","main":true}],"seasons":[],"idIMDB":"tt0370986","urlIMDB":"http://www.imdb.com/title/tt0370986","business":{"budget":null,"openingWeekend":[{"money":"$17,425","country":"USA","day":"08","month":"05","year":"2005","remarks":"1 Screen"},{"money":"£39,382","country":"UK","day":"22","month":"05","year":"2005","remarks":"15 Screens"}],"gross":[{"money":"$697,181","country":"USA","day":"31","month":"07","year":"2005","remarks":""},{"money":"$661,987","country":"USA","day":"24","month":"07","year":"2005","remarks":""},{"money":"$619,735","country":"USA","day":"17","month":"07","year":"2005","remarks":""},{"money":"$570,692","country":"USA","day":"10","month":"07","year":"2005","remarks":""},{"money":"$508,378","country":"USA","day":"04","month":"07","year":"2005","remarks":""},{"money":"$417,188","country":"USA","day":"26","month":"06","year":"2005","remarks":""},{"money":"$335,791","country":"USA","day":"19","month":"06","year":"2005","remarks":""},{"money":"$276,629","country":"USA","day":"12","month":"06","year":"2005","remarks":""},{"money":"$210,682","country":"USA","day":"05","month":"06","year":"2005","remarks":""},{"money":"$68,850","country":"USA","day":"22","month":"05","year":"2005","remarks":""},{"money":"$45,795","country":"USA","day":"15","month":"05","year":"2005","remarks":""},{"money":"$17,425","country":"USA","day":"08","month":"05","year":"2005","remarks":""},{"money":"£39,382","country":"UK","day":"22","month":"05","year":"2005","remarks":""}],"weekendGross":[{"money":"$19,413","country":"USA","day":"31","month":"07","year":"2005","remarks":"13 Screens"},{"money":"$24,650","country":"USA","day":"24","month":"07","year":"2005","remarks":"19 Screens"},{"money":"$26,532","country":"USA","day":"17","month":"07","year":"2005","remarks":"18 Screens"},{"money":"$39,794","country":"USA","day":"10","month":"07","year":"2005","remarks":"17 Screens"},{"money":"$57,312","country":"USA","day":"04","month":"07","year":"2005","remarks":"19 Screens"},{"money":"$58,803","country":"USA","day":"26","month":"06","year":"2005","remarks":"19 Screens"},{"money":"$35,147","country":"USA","day":"19","month":"06","year":"2005","remarks":"14 Screens"},{"money":"$40,145","country":"USA","day":"12","month":"06","year":"2005","remarks":"13 Screens"},{"money":"$44,027","country":"USA","day":"05","month":"06","year":"2005","remarks":"12 Screens"},{"money":"$13,300","country":"USA","day":"22","month":"05","year":"2005","remarks":"1 Screen"},{"money":"$16,365","country":"USA","day":"15","month":"05","year":"2005","remarks":"1 Screen"},{"money":"$17,425","country":"USA","day":"08","month":"05","year":"2005","remarks":"1 Screen"},{"money":"£39,382","country":"UK","day":"22","month":"05","year":"2005","remarks":"15 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 45 min (105 min)","1 hr 47 min (107 min) (Sundance Channel Library Print) (USA)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Panaflex Gold II","Panavision Panaflex Platinum"],"laboratory":["Consolidated Film Industries (CFI), Hollywood (CA), USA (as CFI Color)"],"filmLength":["2,910 m (Portugal, 35 mm)"],"negativeFormat":["35 mm (Fuji Super F-500T 8572)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.7","metascore":"73","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"UNRATED","awards":[{"award":"Bergen International Film Festival 2004","titlesAwards":[{"titleAwardOutcome":"Won Jury Award","categories":[{"category":"","names":[{"name":"Gregg Araki","id":"nm0000777","role":null}]}]}]},{"award":"Brisbane International Film Festival 2005","titlesAwards":[{"titleAwardOutcome":"Won Interfaith Award","categories":[{"category":"","names":[{"name":"Gregg Araki","id":"nm0000777","role":null}]}]}]},{"award":"Chlotrudis Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Chlotrudis Award","categories":[{"category":"Best Adapted Screenplay","names":[{"name":"Gregg Araki","id":"nm0000777","role":null}]},{"category":"Best Movie","names":[]}]}]},{"award":"Film Critics Circle of Australia Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated FCCA Award","categories":[{"category":"Best Foreign Film - English Language","names":[{"name":"Gregg Araki","id":"nm0000777","role":null}]}]}]},{"award":"Film Independent Spirit Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Independent Spirit Award","categories":[{"category":"Best Director","names":[{"name":"Gregg Araki","id":"nm0000777","role":null}]}]}]},{"award":"Gijón International Film Festival 2004","titlesAwards":[{"titleAwardOutcome":"Nominated Grand Prix Asturias","categories":[{"category":"Best Feature","names":[{"name":"Gregg Araki","id":"nm0000777","role":null}]}]}]},{"award":"GLAAD Media Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated GLAAD Media Award","categories":[{"category":"Outstanding Film - Limited Release","names":[]}]}]},{"award":"Gotham Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Gotham Independent Film Award","categories":[{"category":"Breakthrough Actor","names":[{"name":"Joseph Gordon-Levitt","id":"nm0330687","role":null}]}]}]},{"award":"Rotterdam International Film Festival 2005","titlesAwards":[{"titleAwardOutcome":"Won MovieZone Award","categories":[{"category":"","names":[{"name":"Gregg Araki","id":"nm0000777","role":null}]}]}]},{"award":"Seattle International Film Festival 2005","titlesAwards":[{"titleAwardOutcome":"Won Golden Space Needle Award","categories":[{"category":"Best Director","names":[{"name":"Gregg Araki","id":"nm0000777","role":null}]},{"category":"Best Actor","names":[{"name":"Joseph Gordon-Levitt","id":"nm0330687","role":null}]}]}]},{"award":"Village Voice Film Poll 2005","titlesAwards":[{"titleAwardOutcome":"Nominated VVFP Award","categories":[{"category":"Best Performance","names":[{"name":"Joseph Gordon-Levitt","id":"nm0330687","role":null}]}]}]}],"votes":"58,591","type":"Movie","companyCreditsSimple":[{"idCompany":"co0011355","name":"Antidote Films (I)"},{"idCompany":"co0133312","name":"Desperate Pictures"},{"idCompany":"co0071294","name":"Fortissimo Films"}],"keywords":{"keywords":["gay male prostitute","male hustler","loss of innocence","buried memories","man boy relationship","homosexual rape","child molestation","pedophilia","repressed memory","male rape","bloody nose","post traumatic stress disorder","male teen prostitution","ephebophile","sexual abuse","sexual aberration","male prostitution","negligent mother","childhood trauma","humiliation","hand in pants","gay hustler","male nudity","homosexual","coming of age","alien","gay crush","childhood","scar","eight year old","childhood memory","new york","memory","hustler","blackout","baseball","alien abduction","glbt issues","eyeglasses","broken eyeglasses","child","tween girl","sexual ambiguity","recovered memory","snorting cocaine","argument with parent","unrequited love","unwanted sexual advances","seizure","gay bar","dead livestock","uses the word fag","obsession","leaving home","pot smoking","gay man straight man relationship","male male relationship","gay man straight woman relationship","reference to jan vermeer","disabled","amc gremlin","uses the word faggot","prostitution","prostitute","playground","singing","10 year old","taking a picture","child swearing","mustache","child's point of view","mother's boyfriend","playing a video game","crush","kiss","orgasm","brother sister relationship","family relationships","single parent","gay kid","shampoo","rape","anal rape","loss of dignity","emotional shock","sordidness","mistreatment","suffering","house","bus station","decadence","degradation","bitterness","moral corruption","subway ride","rejection","psychological trauma","perversion","boy","girl","teenage girl","revelation","cruelty","traumatic experience","pervert","corrupting a minor","depravity","sexual perversion","sexual corruption","corruption","dark past","dysfunctional family","boy with glasses","bed","abuse","present","gift","men's bathroom","whispering","dead cow","bar","karposi sarcoma","tracking device","toy","witch costume","motel","shower","pizza","fisting","investigation","beanbag","videotape","fast food restaurant","making faces","crutches","cripple","gargling","partner in crime","flashlight","sadness","cocaine","snowing","audio cassette","crawlspace","haunted house","reading","beating","tattoo","angel","station wagon","pipe smoking","gun","heavy rain","loudspeaker","drink","bed wetting","handball","porch swing","baseball announcer","lsd","running","mobile","christmas","vermeer painting","motel room","undressing","prank","regret","drawing","away in a manger","baseball card","rainstorm","male rear nudity","fireworks","men's toilet","cellar","ice cream","subconscious","cupcake","underwear","drunkenness","cruising","farmer","postcard","subjective camera","breaking and entering","subway","watching tv","sweater","mouthwash","beer","urination","blue light","breakfast cereal","rooftop","falling glass","crying","telephone call","snack food","upside down image","listening to music","little river kansas","halloween costume","umpire","bath","tape recorder","silent night","christmas tree","photo album","venereal disease","rid medicine","loft bed","bus","dream journal","friend","watching a movie","microphone","boy girl relationship","ejaculation","polaroid camera","atari","teddy bear","tears","birthday","bathtub","tv show in film","bicycle","drugs","face slap","photograph","inner title card","movie theatre","bottomless pit","smashing picture frame","trick or treating","target practice","money","cereal","drive in theatre","letter","eyesight","mugging","dog","university of california berkeley","violence","graffiti","snow","halloween","airplane ticket","modesto california","rocking chair","brighton beach new york","blood","little girl","scaffold","christmas eve","gay rape","food","college student","fainting","christmas carolling","voyeurism","christmas carol","devil costume","earphones","photographer","crabs","theft","guilt","sandwich shop","letter writing","climbing through a window","rain","grief","cigarette smoking","camaro","falling","gomorrahy","friendship","bedroom","bruise","inman kansas","library","hutchinson community college","swing set","tagging","drinking","new job","queer","community college","shyness","missing time","journal","lost","small town","little league baseball","baseball coach","nightmare","little league","homosexual kiss","gay kiss","ejaculation into someone's mouth","body part in title","anal fisting","overhead camera shot","voice over narration","underwater","trauma","teenage boy","student","stripping","soul mate","sorrow","search","pot pipe","paranoia","obscene finger gesture","nudity","nonlinear timeline","molestation","masturbation","male wearing makeup","kidnapping","hypnosis","hutchinson kansas","hanging upside down","gay","flashback","fellatio","drug use","dream","confronting the past","child abuse","baseball team","drug snorting","pedophile","haunted by the past","spit in the face","sexually transmitted disease","little boy","gay friend","child molester","bully","best friend","man boy love","nosebleed","underage drinking","single mother","oral sex","marijuana","gay slur","gay sex","father son relationship","condom","absent father","1990s","ufo","new york city","mother son relationship","kansas","false memory syndrome","coach","1980s","male prostitute","based on book","independent film","based on novel","borderline personality disorder","temporary muteness","crab lice","year 1991","year 1987","year 1983","year 1981"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:12:55"}}