{"data":{"movies":[{"title":"13 Going on 30","originalTitle":"","year":"2004","releaseDate":"20040423","directors":[{"name":"Gary Winick","id":"nm0935095"}],"writers":[{"name":"Josh Goldsmith","id":"nm0326092"},{"name":"Cathy Yuspa","id":"nm0951135"}],"runtime":"98 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MTI3ODEwNF5BMl5BanBnXkFtZTcwOTA4NDUyMQ@@._V1.jpg","countries":["USA"],"languages":["English","Portuguese"],"genres":["Comedy","Fantasy","Romance"],"plot":"After total humiliation at her thirteenth birthday party, Jenna Rink wants to just hide until she's thirty. Thanks to some wishing dust, Jenna's prayer has been answered. With a knockout body, a dream apartment, a fabulous wardrobe, an athlete boyfriend, a dream job, and superstar friends, this can't be a better life. Unfortunately, Jenna realizes that this is not what she wanted. The only one that she needs is her childhood best friend, Matt, a boy that she thought destroyed her party. But when she finds him, he's a grown up, and not the same person that she knew.","simplePlot":"A girl makes a wish on her 13th birthday and wakes up the next day as a 30-year-old woman.","actors":[{"actorName":"Jennifer Garner","urlProfile":"http://www.imdb.com/name/nm0004950","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA4MDgzMTc1Nl5BMl5BanBnXkFtZTcwNjQyMjIwNQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 April 1972","placeOfBirth":" Houston, Texas, USA","birthName":"Jennifer Anne Garner","height":"5' 8\" (1.73 m)","bio":"Jennifer Garner, who catapulted into stardom with her lead role on the television series Alias (2001), has come a long way from her birthplace of Houston, Texas. Raised in Charleston, West Virginia by her mother, Patricia Ann (née English), a retired teacher of English, and her father, William John Garner, a former chemical engineer, Jennifer is the middle sibling of three girls. She spent nine years of her adolescence studying ballet and describes her years in dance as ones characterized by determination rather than talent, being driven mostly by a love of the stage. Jennifer took this determination with her when she enrolled at Denison University as a chemistry major, a decision that was later changed to a drama major when she found that her passions for the stage were stronger than her love of science. New York attracted the young actress after college where she worked as a hostess while pursuing a career in film and television. Her most recent move has been to Los Angeles, a decision that led to a role on the television series Felicity (1998), where she met her future husband Scott Foley. The couple divorced in 2004. Jennifer appeared on the television series, Alias (2001), as \"Agent Sydney Bristow\", who works for the Central Intelligence Agency. For her work, Garner has received four consecutive Emmy nominations for Outstanding Lead Actress in a Drama Series. She has also received four Golden Globe nominations and won once, as well as received two Screen Actors Guild Award nominations, and won once. She has appeared in numerous other television production as well as such films as Elektra (2005), 13 Going on 30 (2004), Daredevil (2003), Pearl Harbor (2001) and Dude, Where's My Car? (2000). Aside from filming Alias (2001), Jennifer enjoys cooking, gardening, hiking, and inspired by her character on the series, kickboxing.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA4MDgzMTc1Nl5BMl5BanBnXkFtZTcwNjQyMjIwNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004950","name":"Jennifer Garner","idIMDB":"nm0004950"},"actorId":"nm0004950","character":"Jenna Rink","urlCharacter":"http://www.imdb.com/character/ch0012732","main":true},{"actorName":"Mark Ruffalo","urlProfile":"http://www.imdb.com/name/nm0749263","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MjMwNjAzNF5BMl5BanBnXkFtZTcwMzkyNDg1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1967","placeOfBirth":" Kenosha, Wisconsin, USA","birthName":"Mark Alan Ruffalo","height":"5' 8\" (1.73 m)","bio":"Mark Ruffalo was born in Kenosha, Wisconsin, to Marie Rose (Hebert), a stylist and hairdresser, and Frank Lawrence Ruffalo, a construction painter. His father's ancestry is Italian, and his mother is of half French-Canadian and half Italian descent. Mark moved with his family to Virginia Beach, Virginia, where he lived out most of his teenage years. Following high school, Mark moved with his family to San Diego and soon migrated north, eventually settling in Los Angeles. He took classes at the Stella Adler Conservatory and subsequently co-founded the Orpheus Theatre Company, an Equity-Waiver establishment, where he worked in nearly every capacity. From acting, writing, directing and producing to running the lights and building sets while building his resume. Bartending for nearly nine years to make ends meet and ready to give it all up, a chance meeting and resulting collaboration with playwright/screenwriter Kenneth Lonergan changed everything. Ruffalo won NY success in Lonergan's play \"This Is Our Youth\", which led to the male lead in Lonergan's film You Can Count on Me (2000), playing the ne'er-do-well brother of Laura Linney. The performance drew rave reviews and invited comparisons to an early Marlon Brando. Notable roles in The Last Castle (2001), XX/XY (2002), and Windtalkers (2002) followed, although in 2002 Ruffalo was diagnosed with an acoustic neuroma, a type of brain tumor. Though the tumor was benign, the resulting surgery led to a period of partial facial paralysis, from which he fully recovered. In 2003, Ruffalo scored leading roles alongside two popular female stars, playing a police detective opposite Meg Ryan in In the Cut (2003) and the love interest of Gwyneth Paltrow in the comedy View from the Top (2003). Though both films were high-profile box office disappointments, Ruffalo went on to four notable (if highly disparate) films in 2004 - We Don't Live Here Anymore (2004), Eternal Sunshine of the Spotless Mind (2004), 13 Going on 30 (2004), and Collateral (2004) - which solidified his ability to be both a popular leading man and an acclaimed ensemble player in either comedy or drama. After 2004, Ruffalo was consistently at work, with leads in popular Hollywood films and independent productions that continued to solidify him as one of film's most consistently strong actors: Just Like Heaven (2005), Les fous du roi (2006), Zodiac (2007), Reservation Road (2007), and The Brothers Bloom (2008). In 2010 Ruffalo achieved something of a breakthrough, by directing the indie film Sympathy for Delicious (2010), which won him the Special Jury Prize at the Sundance Film Festival, and co-starring as the sperm-donor father to lesbian couple Annette Bening and Julianne Moore in The Kids Are All Right (2010). His role in the idiosyncratic domestic comedy/drama earned him Academy Award, Independent Spirit Award, Screen Actors Guild, and BAFTA nominations for Best Supporting Actor. High-profile roles in Martin Scorsese's Shutter Island (2010) and 'Kenneth Longeran''s long-delayed Margaret (2011) followed before Ruffalo's appearance as Dr. Bruce Banner, aka The Hulk, in Joss Whedon's blockbuster The Avengers (2012). Garnering highly positive reviews for a role in which actors Eric Bana and Edward Norton could not find success in previous films made Ruffalo a box office star in addition to a critically-acclaimed actor. He is expected to reprise the role in the upcoming 2015 sequel, and reunited with former co-star Gywneth Paltrow in the sex-addiction comedy-drama Thanks for Sharing (2012); Ruffalo also will take the lead in Ryan Murphy's adaptation of Larry Kramer's AIDS-drama play The Normal Heart (2014). Ruffalo has been married to actress Sunrise Coigney since 2000; the couple have three children, a son and two daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MjMwNjAzNF5BMl5BanBnXkFtZTcwMzkyNDg1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0749263","name":"Mark Ruffalo","idIMDB":"nm0749263"},"actorId":"nm0749263","character":"Matt Flamhaff","urlCharacter":"http://www.imdb.com/character/ch0012733","main":true},{"actorName":"Judy Greer","urlProfile":"http://www.imdb.com/name/nm0339460","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MTAyMzMzMl5BMl5BanBnXkFtZTcwMDY2Mzc2NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 July 1975","placeOfBirth":" Detroit, Michigan, USA","birthName":"Judith Therese Evans","height":"5' 8\" (1.73 m)","bio":"Judy Greer was born and raised outside of Detroit, Michigan, as Judith Therese Evans. She is the daughter of Mollie Ann (née Greer), a hospital administrator and former nun, and Richard Evans, a mechanical engineer. She has German, Irish, English, Welsh, and Scottish ancestry. After training for nearly ten years in classical Russian ballet, Greer shifted her interest to acting and was accepted into Chicago's prestigious Theater School at DePaul University. After a variety of odd jobs during college, from telemarketer to oyster shucker, Greer landed her first on-screen role just three days after graduation -- a small part in the Jason Lee-David Schwimmer comedy Kissing a Fool (1998). She flew to Los Angeles for the film's premiere and never left. Greer quickly landed a role in the dark comedy Jawbreaker (1999), with Rose McGowan and Rebecca Gayheart. Greer starred as a school wallflower-turned-babe in a story about high school girls who accidentally kill their best friend and try to cover up the murder. She went on to play a news correspondent in David O. Russell's Three Kings (1999), landing a memorable opening love scene with George Clooney. Her performance caught the eye of Hollywood, and she appeared next in Mike Nichols's What Planet Are You From? (2000) as a flight attendant opposite Garry Shandling. Her television credits include a recurring role as Jason Bateman's assistant Kitty on Fox's Arrested Development (2003), as well as guest-starring roles on Love & Money (1999), Maggie Winters (1998), and Early Edition (1996). Greer starred opposite Jennifer Garner in Columbia Pictures' romantic comedy 13 Going on 30 (2004), directed by Gary Winick. Greer played an office colleague alongside Garner's character, with whom she shares a checkered past. She co-starred in writer-director M. Night Shyamalan's The Village (2004), opposite Joaquin Phoenix, Adrien Brody, Bryce Dallas Howard, Sigourney Weaver, and William Hurt. Set in 1897, the film revolves around a close-knit community that lives with the knowledge that a mythical race of creatures resides in the woods surrounding them. The Village (2004) was released July 30, 2004, by Touchtone Pictures. Greer also co-starred in director Wes Craven's Cursed (2005), a modern twist on the classic werewolf tale written by Kevin Williamson. The busy actress also landed a co-starring role opposite Orlando Bloom and Susan Sarandon in writer-director Cameron Crowe's Elizabethtown (2005). Greer will play the sister of Bloom's character and daughter of Sarandon's character. She also joined Jeff Bridges and Jeanne Tripplehorn in the independent film The Amateurs (2005) by writer-director Michael Traeger. The film revolves around a motley group of friends who band together to make an amateur porn film. Greer plays a young temptress at the local mattress store who secures a role in the movie by allowing the store to be used as a film location. Greer wrapped production in New York on a co-starring role opposite Tom McCarthy (\"The Station Agent\") in Danny Leiner's The Great New Wonderful (2005) for Serenade Films/Sly Dog Films. The dark comedy tells five different stories against the backdrop of an uncertain post-September 11 New York. The cast also includes Maggie Gyllenhaal, Edie Falco and Tony Shalhoub. She also appeared in writer-director Adam Goldberg's psychological drama I Love Your Work (2003), opposite Giovanni Ribisi. The film is about a fictional movie star (Ribisi) and his gradual meltdown and increasing obsession with a young film student and his girlfriend. The stellar cast also included Franka Potente, Christina Ricci, and Jason Lee and debuted at the 2003 Toronto International Film Festival. In the film, Greer plays Samantha, the personal assistant of Ribisi's character. Greer had a starring role as the female lead role in the comedy The Hebrew Hammer (2003) as the feisty, fearless Esther, who joins forces with an Orthodox Jewish Blaxploitation hero (Adam Goldberg) to save Hanukkah from an evil son of Santa Claus (Andy Dick). The Hebrew Hammer (2003) debuted at the 2003 Sundance Film Festival and premiered on Comedy Central followed by a theatrical release. She also appeared in Adaptation. (2002), from director Spike Jonze. In the film, Nicolas Cage stars as self-loathing writer Charlie Kaufman (and twin brother Donald) as he attempts to adapt the novel \"The Orchid Thief\" for the big screen. Greer played Alice, the waitress with whom he becomes obsessed -- the object of his fantasies. Greer turned in a scene-stealing comedic performance in Un mariage trop parfait (2001), with Jennifer Lopez and Matthew McConaughey, in which she played Penny, Lopez's sweet but ditsy assistant who tries hard, but often falls a little short. Equally adept at more dramatic roles, Greer gave a standout performance opposite Mel Gibson in What Women Want (2000), playing a suicidal file clerk rescued by the one man who can hear women's thoughts. Greer's pivotal scene with Gibson is the heart of the film. With a genuine gift for comedy and an engaging on-screen presence, Judy Greer has quickly become one of Hollywood's most captivating young talents. Having appeared in such diverse films as Jawbreaker (1999), What Women Want (2000), Un mariage trop parfait (2001), and Adaptation. (2002), as well as a number of upcoming feature film projects, Greer turns in scene-stealing performances opposite some of the industry's biggest stars.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MTAyMzMzMl5BMl5BanBnXkFtZTcwMDY2Mzc2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0339460","name":"Judy Greer","nicknames":["Greer"],"idIMDB":"nm0339460"},"actorId":"nm0339460","character":"Lucy Wyman","urlCharacter":"http://www.imdb.com/character/ch0012735","main":true},{"actorName":"Andy Serkis","urlProfile":"http://www.imdb.com/name/nm0785227","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNzI2OTA3Nl5BMl5BanBnXkFtZTYwNDIwNzA1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1964","placeOfBirth":" Ruislip, London, England, UK","birthName":"Andrew Clement G. Serkis","height":"5' 8\" (1.73 m)","bio":"Andrew Clement G. Serkis was born April 20, 1964, in Ruislip Manor, West London, England. He has three sisters and a brother. His father, Clement Serkis, an ethnic Armenian whose original family surname was \"Serkissian\", was a Medical Doctor working abroad, in Iraq; the Serkis family spent a lot of time traveling around the Middle East. For the first ten years of his life, Andy Serkis used to go backwards and forwards between Baghdad and London. His mother, Lylie (Weech), who is British-born, was busy working as a special education teacher of handicapped children, so Andy and his four siblings were raised with au pairs in the house. Young Andy Serkis wanted to be an artist; he was fond of painting and drawing, and visualized himself working behind the scenes in productions. He attended St. Benedict's School, a Roman Catholic School for boys at the Benedictine Abbey in London. Serkis studied visual arts at Lancaster University in the north-west of England. There, he became involved in mechanical aspects of the theatre and did stage design and set building for theatrical productions. Then, Serkis was asked to play a role in a student production, and made his stage debut in Barrie Keeffe's play, \"Gotcha\"; thereafter, he switched from stage design to acting, which was a real calling that transformed his life. Instead of going to an acting college, Serkis, in 1985, began his professional acting career at the Duke's Playhouse in Lancaster, where he was given an Equity card and performed in fourteen plays, one after another, as an apprentice of Jonathan Petherbridge. After that, he worked in touring theatre companies, doing it for no money, fueled by a sense of enthusiasm, moving to a new town every week. He has thus appeared in a host of popular plays and on almost every renowned British stage. In 1989, he appeared in a stage production of William Shakespeare's \"Macbeth\", so beginning his long association with the Royal Exchange Theatre, Manchester, where he would return many times, to appear in \"She Stoops to Conquer\", \"Your Home in the West\" and the \"True Nature of Love\", among other plays. In the 1990s, Serkis began to make his mark on the London stage, appearing at the Royal Court Theatre as \"The Fool\" in \"King Lear\", making his interpretation of \"The Fool\" as the woman that \"Lear\", a widower, could relate to - a man, in drag, as a Victorian musician. He also appeared as \"Potts\" in the hit play, \"Mojo\", playing in front of full houses and earning huge critical success. In 1987, Serkis made his debut on television, and he acted in several major British TV miniseries throughout the 1990s. In 1999, Andy Serkis landed the prize role of \"Gollum\" in Peter Jackson's epic film trilogy based on J.R.R. Tolkien's saga, \"The Lord of the Rings\". He spent four years in the part and received awards and nominations for his performance as \"Gollum\", a computer-generated character in The Lord of the Rings: The Return of the King (2003), which won 11 Oscars. \"Gollum\" was the collaborative team's effort around Serkis's work in performance capture - an art form based on CGI-assisted acting. Serkis's work was an interactive performance in a skin-tight CGI suit with markers allowing cameras to track and register 3D position for each marker. Serkis' every nuance was picked up by several cameras positioned at precisely calculated angles to allow for the software to see enough information to process the image. The images of Serkis' performances were translated into the digital format by animators at Weta Digital studio in New Zealand. There, his image was key-frame animated and then edited into the movie, Serkis did have one scene in \"The Return of the King\" showing how he originally had the ring, killing another hobbit to posses it after they found it during a fishing trip. He drew from his three cats clearing fur balls out of their throats to develop the constricted voice he produced for \"Gollum\" and \"Sméagol\", and it was also enhanced by sound editing in post-production. Serkis spent almost two years in New Zealand and away from his family, and much of 2002 and 2003 in post-production studios for large periods of time, due to complexity of the creative process of bringing the character of \"Gollum\" to the screen. Serkis had to shoot two versions for every scene; one version was with him on camera, acting with (chiefly) Elijah Wood and Sean Astin, which served both to show Wood and Astin the moves so that they could precisely interact with the movements of \"Gollum\", and to provide the CGI artists the subtleties of Gollum's physical movements and facial expressions for their manual finishing of the animated images. In the other version, he'd do the voice off-camera, as Wood and Astin repeated their movements as though \"Gollum\" were there with them; that take would be the basis for inserting the CGI Gollum used in the released movie. In post-production, Serkis was doing motion-capture wearing a skintight motion capture suit with CGI gear while acting as a virtual puppeteer redoing every single scene in the studio. Additional CGI rotomation was done by animators using the human eye instead of the computer to capture the subtleties of Serkis' performance. Serkis also used this art form in his performance as \"Kong\" in King Kong (2005), which won him a Toronto Film Critics Association Award (2005) for his unprecedented work helping to realize the main character in \"King Kong\", and a Visual Effects Society Award (2006) for Outstanding Animated Character in a Live Action Motion Picture. Apart from his line of CGI-driven characters, Serkis continued with traditional acting in several leading and supporting roles, such as his appearances as \"Richard Kneeland\" opposite Jennifer Garner in 13 Going on 30 (2004), and \"Alley\" opposite David Bowie in The Prestige (2006), among other film performances. On television, he starred as 'Vincent Van Gogh' in the sixth episode of Simon Schama's Power of Art (2006), the BBC2 series about artists. Serkis is billed as \"Capricorn\" in the upcoming adventure film, Coeur d'encre (2008). At the same time, he continued the development of performance capture while expanding his career into computer games. He starred as \"King Bothan\" in the martial arts drama, Heavenly Sword (2007), a Playstation 3 title, for which he provided a basis for his in-game face and also acts as a dramatic director on the project. Andy Serkis married actress and singer Lorraine Ashbourne, and the couple have three children: daughter Ruby Serkis (born in 1998), and two sons Sonny Serkis (born in 2000) and Louis George Serkis (born on 19 June 2004). Away from acting, Andy Serkis is an accomplished amateur painter. Since his school years at Lancaster, being so close to the Lake District, Serkis developed his other passion in life: mountaineering. He is pescetarian. Serkis has been active in charitable causes, such as The Hope Foundation, which provides essential life-saving medical aid for children suffering from Leukemia and children from countries devastated by war. In October 2006, he was a presenter at the first annual British Academy Video Games Awards at the Roundhouse, London. Andy Serkis lives with his family in North London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNzI2OTA3Nl5BMl5BanBnXkFtZTYwNDIwNzA1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0785227","name":"Andy Serkis","nicknames":["Gollum"],"idIMDB":"nm0785227"},"actorId":"nm0785227","character":"Richard Kneeland","urlCharacter":"http://www.imdb.com/character/ch0012734","main":true},{"actorName":"Kathy Baker","urlProfile":"http://www.imdb.com/name/nm0000834","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MTA4NTExNV5BMl5BanBnXkFtZTcwNjU0MDgzNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 June 1950","placeOfBirth":" Midland, Texas, USA","birthName":"Kathy Whitton Baker","height":"5' 6\" (1.68 m)","bio":"For someone who has made an award-winning impact in all three mediums (stage, film and TV), actress Kathy Baker has been strangely denied all-out stardom, yet continues to demonstrate her versatility in whatever material comes her way. The comely blonde was born Katherine Whitton Baker in Midland, Texas, the daughter of parents John Seawand Baker, a geologist and educator who taught at both the University of Paris and at Princeton, and Helene Andree Baker (née Whitton). Raised in New Mexico, she first took to the stage at age 10. Influenced by her French-born mother, Kathy attended the University of California at Berkeley and instead received her Bachelor of Arts degree in French in 1977. From there she went to Paris to study haute cuisine at the famed Cordon Bleu. She returned to the States originally to work as a pastry chef, but still discovered a smouldering desire to act and eventually joined San Francisco's Magic Theatre. There she appeared in the play \"The Man Who Killed the Buddha\" and gave a performance that drew the immediate attention of playwright Sam Shepard. 1983 was a banner year for Kathy. At the Magic Theatre, wherein she used the stage name of Kathy Whitton Baker, Shepard cast her in a leading role in one of his new plays, \"Fool for Love.\" The premiere garnered exceptional notices and the play (and Kathy) went to New York. She and co-star Ed Harris, won 1984 Obie Awards for their rich performances, as did playwright Shepard for directing. The production itself won the Obie for \"Best New American Play.\" That same year Kathy made a strong movie debut co-starring in The Right Stuff (1983) as the wife of astronaut Alan Shepard (played by Scott Glenn). Displaying an attractive intelligence in her performances, Kathy continued to make strides on the New York stage both in 1984's \"Desire Under the Elms\" and as a replacement for the Lemon character in the Obie-winning \"Aunt Dan and Lemon\" at Joseph Papp's Shakespeare Festival in 1986. Later in the decade, both Kathy and Morgan Freeman stole the thunder right from under star Christopher Reeve in the tense film drama Street Smart (1987) with Kathy delivering a grim, heartfelt performance as an ill-fated hooker to Freeman's feral pimp. Both perfs delivered a one-two punch and were applauded for their shocking realism. Each received their share of awards and plaudits; Kathy nabbed both the National Society of Critics and Boston Society of Critics awards, but was shamefully snubbed when it came to the Oscar race (Freeman was nominated, but lost). Throughout the rest of the decade Kathy continued to give spot-on performances in such quality films as Clean and Sober (1988), as a recovering addict; Permanent Record (1988), as a wife whose son commits suicide; Jacknife (1989), in which she was reunited with Ed Harris as the put-upon, plain-Jane sister of an alcoholic Vietnam vet; and Edward Scissorhands (1990) as a seemingly model housewife who has an uncontrollably flirtatious nature. Top-flight stardom seemed to be almost a given. With the new decade, however, the movie roles tendered out to her became less frequent or noteworthy so Kathy decided to focus outside her medium of choice and actively search for TV roles. The results were customarily expert. In the slightly quirky Picket Fences (1992), Kathy found a perfect fit taking on the role of small town mother and doctor Jill Brock. Running for four seasons, she was nominated for an Emmy each year and took home the trophy three of those four times for \"Outstanding Lead Actress in a Drama Series\". Into the millennium Kathy has maintained consistency with quality roles in the more recent releases Cold Mountain (2003) and The Jane Austen Book Club (2007). On TV she and Helen Mirren picked up supporting Emmy nods in the bittersweet Door to Door (2002), with Emmy-winning William H. Macy starring as a man with cerebral palsy. In 2001 she joined the cast of Boston Public (2000) as a manipulative mom (another Emmy nomination). Some of those episodes were directed by Steven Robman, whom she married in June of 2003. Kathy has two sons from a previous marriage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MTA4NTExNV5BMl5BanBnXkFtZTcwNjU0MDgzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000834","name":"Kathy Baker","idIMDB":"nm0000834"},"actorId":"nm0000834","character":"Bev Rink","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Phil Reeves","urlProfile":"http://www.imdb.com/name/nm0716277","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc2MDU2Njk1NV5BMl5BanBnXkFtZTgwODA0NTA1MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Phil Reeves is an actor and writer, known for 13 Going on 30 (2004), Election (1999) and About Schmidt (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc2MDU2Njk1NV5BMl5BanBnXkFtZTgwODA0NTA1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0716277","name":"Phil Reeves","idIMDB":"nm0716277"},"actorId":"nm0716277","character":"Wayne Rink","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sam Ball","urlProfile":"http://www.imdb.com/name/nm0050458","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MjcxNzk5M15BMl5BanBnXkFtZTYwMzIxODE1._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1973","placeOfBirth":" Bunker Hill, West Virginia, USA","height":"6' (1.83 m)","bio":"Sam Ball was born on June 29, 1973 in Bunker Hill, West Virginia, USA. He is an actor, known for 13 Going on 30 (2004), One Life to Live (1968) and The Last Castle (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MjcxNzk5M15BMl5BanBnXkFtZTYwMzIxODE1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0050458","name":"Sam Ball","idIMDB":"nm0050458"},"actorId":"nm0050458","character":"Alex Carlson","urlCharacter":"http://www.imdb.com/character/ch0096028","main":true},{"actorName":"Marcia DeBonis","urlProfile":"http://www.imdb.com/name/nm0213482","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMjM2MjYzMl5BMl5BanBnXkFtZTcwNjQzMzc3MQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1960","placeOfBirth":" USA","bio":"Marcia DeBonis was born on June 4, 1960 in the USA. She is known for her work on The Truman Show (1998), Letters to Juliet (2010) and 13 Going on 30 (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMjM2MjYzMl5BMl5BanBnXkFtZTcwNjQzMzc3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0213482","name":"Marcia DeBonis","idIMDB":"nm0213482"},"actorId":"nm0213482","character":"Arlene","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christa B. Allen","urlProfile":"http://www.imdb.com/name/nm1568512","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNjg3OTg4M15BMl5BanBnXkFtZTgwMjQ3NTgyNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 November 1991","placeOfBirth":" Wildomar, California, USA","birthName":"Christa Brittany Allen","height":"5' 5\" (1.65 m)","bio":"Christa B. Allen was born on November 11, 1991 in Wildomar, California, USA as Christa Brittany Allen. She is an actress, known for Revenge (2011), 13 Going on 30 (2004) and Youth in Revolt (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNjg3OTg4M15BMl5BanBnXkFtZTgwMjQ3NTgyNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1568512","name":"Christa B. Allen","idIMDB":"nm1568512"},"actorId":"nm1568512","character":"Young Jenna","urlCharacter":"http://www.imdb.com/character/ch0012732","main":true},{"actorName":"Sean Marquette","urlProfile":"http://www.imdb.com/name/nm0549826","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NTU0NjAyMV5BMl5BanBnXkFtZTgwODk3NDA0MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 June 1988","placeOfBirth":" Dallas, Texas, USA","bio":"Sean Marquette, born in Dallas, Texas, is successfully building a diverse and established career playing a variety of roles in television, film and animated series. Sean began his acting career starring as Jamie Martin on the Emmy award winning daytime soap, All My Children (ABC). Sean starred in 13 Going On 30 (Sony Pictures) with Jennifer Garner; Surviving Christmas (DreamWorks) with Ben Affleck; Seabiscuit (Universal) with Toby Maguire; series regular on hit animated series Foster's home for Imaginary Friends (Cartoon Network) and Rocket Power (Nick). Sean has recently guest starred on Still Standing (CBS) and is the voice of Spiderman in 'Ultimate Spiderman' Electronic video game (Activision). Sean has an impressive list of television credits to name a few, series regular on Hidden Hills (NBC) and guest starred on hit shows such as Without A Trace (CBS); Touched By An Angel (CBS); The Guardian (CBS); Judging Amy (CBS); Strong Medicine (Lifetime) and All My Children (ABC). Sean's upcoming projects include Grilled (New Line Cinema) film directed by Jason Ensler. Sean stars as Burt Reynold's son who is getting Bar Mitzvah'd and at the request of his father, \"becomes a man\", with the help of a 19 year-old call girl in the back of a limo, on the way to the ceremony. Sean is the youngest of the three Marquette brothers. Sean says his older brother Chris Marquette is his inspiration. Sometimes they audition for the same role. They help each other and enjoy the healthy competition. Acting soothes Sean's mind and body by allowing him to express himself. He feels what separates him from other actors is his ability not to limit himself when he acts. Sean's favorite actor is Tom Hanks because he comes across as a regular normal guy. He admires Johnny Depp's sense of style, Denzel Washington's down to earth demeanor, Benicio Del Toro, strong, silent type persona. Sean's favorite movie is The Pianist. His favorite role in a movie is Jim Carrey in Eternal Sunshine of the Spotless Mind In his spare time Sean enjoys reading, computers and movies. He successfully juggles school and his acting career. Sean participates in several charity events. His favorite pastimes are the pursuit of his Black Belt in Tae Kwon Do and beating his brothers in a game of Diablo on the computer. Sean's huge success on the animated series Fosters resulted in Sean presenting at the 2004 TEAM Awards Show and 32nd Annual Annie Awards. The Marquette brothers Sean, Christopher and Eric live in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NTU0NjAyMV5BMl5BanBnXkFtZTgwODk3NDA0MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0549826","name":"Sean Marquette","idIMDB":"nm0549826"},"actorId":"nm0549826","character":"Young Matt","urlCharacter":"http://www.imdb.com/character/ch0012733","main":true},{"actorName":"Kiersten Warren","urlProfile":"http://www.imdb.com/name/nm0912916","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwOTY5ODExNF5BMl5BanBnXkFtZTYwMjExMDAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 November 1965","placeOfBirth":" Iowa, USA","birthName":"Kiersten Nicolla Dale Warren","bio":"Kiersten Nicolla Dale Warren was born on November 4, 1965 in Iowa. The daughter of Southern Baptist missionaries, Kiersten performed in churches everywhere from Mexico to Manila. Though signing Bibles like a rock star was exhilarating, she eventually sought the spotlight of a secular stage. After modeling for four years in Tokyo for the likes of Kanebo Cosmetics, Fuji Film and Mr. Donut (formerly Happy Fun Sunshine Donut), Kiersten set her sights on acting. Starting with her on-screen debut in 1987, opposite Tom Selleck, in the Magnum, P.I. (1980) episode, Magnum, P.I.: The Aunt Who Came to Dinner (1987), Kiersten has worked with such stars as Faye Dunaway (Silhouette (1990)), John Cusack (Pushing Tin (1999)), Paul Giamatti (Duets (2000)), Ashley Judd (Divine Secrets of the Ya-Ya Sisterhood (2002)), Bruce Willis (The Astronaut Farmer (2006)), Marcia Gay Harden (Thomas Kinkade's Christmas Cottage (2008)), Peter O'Toole (Thomas Kinkade's Christmas Cottage (2008)) and the incomparable Bob Golic (Saved by the Bell: The College Years (1993)), whose acting advice to her was, \"When you tackle someone aim for the knees. It might end their career.\" Kiersten was nominated for a SAG award for Best Ensemble Cast. In 2006, her fragile/ferocious portrayal as Nora Huntington, the homewrecking, pot-stirring single mother on Desperate Housewives (2004), who saw the business end of a tragedy in the episode \"Bang\", helped bring in the highest ratings in the series' history since its premiere. In real life, Kiersten is a homemaking, pot-stirring mother of two.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwOTY5ODExNF5BMl5BanBnXkFtZTYwMjExMDAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0912916","name":"Kiersten Warren","idIMDB":"nm0912916"},"actorId":"nm0912916","character":"Trish Sackett","urlCharacter":"http://www.imdb.com/character/ch0501527","main":true},{"actorName":"Joe Grifasi","urlProfile":"http://www.imdb.com/name/nm0341055","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyODA3MTg1M15BMl5BanBnXkFtZTYwOTk3ODAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 June 1944","placeOfBirth":" Buffalo, New York, USA","birthName":"Joseph G. Grifasi","height":"5' 5¾\" (1.67 m)","bio":"Joe Grifasi was born on June 14, 1944 in Buffalo, New York, USA as Joseph G. Grifasi. He is an actor, known for The Deer Hunter (1978), Batman Forever (1995) and 13 Going on 30 (2004). He has been married to Jane Ira Bloom since 1974.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyODA3MTg1M15BMl5BanBnXkFtZTYwOTk3ODAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0341055","name":"Joe Grifasi","idIMDB":"nm0341055"},"actorId":"nm0341055","character":"Mr. Flamhaff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mary Pat Gleason","urlProfile":"http://www.imdb.com/name/nm0322325","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3ODEzMTQ4NF5BMl5BanBnXkFtZTcwNTkxMjYzNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Mary Pat Gleason is an actress and writer, known for 13 Going on 30 (2004), Basic Instinct (1992) and I Now Pronounce You Chuck & Larry (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3ODEzMTQ4NF5BMl5BanBnXkFtZTcwNTkxMjYzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0322325","name":"Mary Pat Gleason","idIMDB":"nm0322325"},"actorId":"nm0322325","character":"Mrs. Flamhaff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Susan Egan","urlProfile":"http://www.imdb.com/name/nm0250743","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzMjYzODI5ODJeQTJeQWpwZ15BbWU3MDI3MTM0Mzk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 February 1970","placeOfBirth":" Seal Beach, California, USA","birthName":"Susan Farrell Egan","height":"5' 4\" (1.63 m)","bio":"Susan Egan was born on February 18, 1970 in Seal Beach, California, USA as Susan Farrell Egan. She is an actress, known for Hercules (1997), Spirited Away (2001) and 13 Going on 30 (2004). She has been married to Robert Hartmann since June 26, 2005. They have two children. She has two daughters. There names are Nina and Isla. She was one of the first students to attend the Orange County High School of the Arts during its original incarnation at Los Alamitos High School. Served as Artistic Director at the Orange County High School of the Arts for school year 2002-2003. Originated the role of \"Belle\" in the Broadway production of Disney's Beauty and the Beast. Was nominated for Broadway's 1994 Tony Award as Best Actress (Musical) for originating the role of \"Belle\" in Disney's \"Beauty and the Beast.\" Enrolled at UCLA as an anthropology major, but dropped out to do the national tour of \"Bye Bye, Birdie\", with Tommy Tune. Welcomed her first child, Nina, with husband Robert Hartmann, on February 6th, 2007. Nina weighed 6 lbs 14 oz and measured 20.5 inches long. She was born a few days early, and was named after Robert's grandmother. Susan gave birth to a second daughter, Isla, on December 15, 2009. Appearing in the title role in the Broadway musical \"Thoroughly Modern Millie\". [February 2004] While performing in the revival of \"Bye, Bye Birdie\" with Tommy Tune he told her how much he loved the way she sang her first song and would often sing along with her as a vocal warm-up while he was in a costume change. The song was \"How Lovely To Be A Woman\". Although Egan considered that to be the greatest compliment she had ever received she could not get the image of Tune in his dressing room singing that song in his underwear out of her head.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzMjYzODI5ODJeQTJeQWpwZ15BbWU3MDI3MTM0Mzk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0250743","name":"Susan Egan","nicknames":["Su-Su","Susie","The Belle of Broadway","Sus"],"idIMDB":"nm0250743"},"actorId":"nm0250743","character":"Tracy Hansen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lynn Collins","urlProfile":"http://www.imdb.com/name/nm1211488","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0ODk5ODgzNV5BMl5BanBnXkFtZTcwMTUzNTM4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1977","placeOfBirth":" Houston, Texas, USA","birthName":"Viola Lynn Collins","height":"5' 8\" (1.73 m)","bio":"Viola Lynn Collins was born in Houston, Texas, to Patricia Lynn (Campbell) and Phillip Dean Collins. She attended the Juilliard School for Drama and had a great deal of Shakespearean training before being cast as \"Portia\" in \"The Merchant of Venice\". She also played \"Ophelia\" in a production of \"Hamlet\" in New York, and was \"Juliet\" in Peter Hall's \"Romeo and Juliet\" at the Ahmanson theatre in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0ODk5ODgzNV5BMl5BanBnXkFtZTcwMTUzNTM4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1211488","name":"Lynn Collins","idIMDB":"nm1211488"},"actorId":"nm1211488","character":"Wendy","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0337563","urlIMDB":"http://www.imdb.com/title/tt0337563","business":{"budget":{"money":"$37,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$21,054,238","country":"USA","day":"25","month":"04","year":"2004","remarks":"3,438 Screens"},{"money":"£1,184,273","country":"UK","day":"08","month":"08","year":"2004","remarks":"366 Screens"},{"money":null,"country":null,"day":"05","month":"11","year":"2004","remarks":"60 Screens"},{"money":"€209,969","country":"Spain","day":"22","month":"08","year":"2004","remarks":"210 Screens"}],"gross":[{"money":"$56,044,241","country":"USA","day":"27","month":"06","year":"2004","remarks":""},{"money":"$55,850,974","country":"USA","day":"20","month":"06","year":"2004","remarks":""},{"money":"$55,664,410","country":"USA","day":"13","month":"06","year":"2004","remarks":""},{"money":"$55,258,250","country":"USA","day":"06","month":"06","year":"2004","remarks":""},{"money":"$54,561,017","country":"USA","day":"30","month":"05","year":"2004","remarks":""},{"money":"$52,080,216","country":"USA","day":"23","month":"05","year":"2004","remarks":""},{"money":"$48,522,282","country":"USA","day":"16","month":"05","year":"2004","remarks":""},{"money":"$42,880,123","country":"USA","day":"09","month":"05","year":"2004","remarks":""},{"money":"$35,060,728","country":"USA","day":"02","month":"05","year":"2004","remarks":""},{"money":"$21,054,283","country":"USA","day":"25","month":"04","year":"2004","remarks":""},{"money":"£5,109,348","country":"UK","day":"05","month":"09","year":"2004","remarks":""},{"money":"£4,880,937","country":"UK","day":"29","month":"08","year":"2004","remarks":""},{"money":"£4,217,022","country":"UK","day":"22","month":"08","year":"2004","remarks":""},{"money":"£3,042,631","country":"UK","day":"15","month":"08","year":"2004","remarks":""},{"money":"£1,184,273","country":"UK","day":"08","month":"08","year":"2004","remarks":""},{"money":"$39,223,950 (Worldwide)","country":"except","day":null,"month":null,"year":null,"remarks":null},{"money":"€353,209","country":"Netherlands","day":"22","month":"08","year":"2004","remarks":""}],"weekendGross":[{"money":"$68,483","country":"USA","day":"27","month":"06","year":"2004","remarks":"85 Screens"},{"money":"$86,480","country":"USA","day":"20","month":"06","year":"2004","remarks":"120 Screens"},{"money":"$18,276","country":"USA","day":"13","month":"06","year":"2004","remarks":"193 Screens"},{"money":"$356,806","country":"USA","day":"06","month":"06","year":"2004","remarks":"423 Screens"},{"money":"$1,451,872","country":"USA","day":"30","month":"05","year":"2004","remarks":"1,164 Screens"},{"money":"$2,512,234","country":"USA","day":"23","month":"05","year":"2004","remarks":"2,028 Screens"},{"money":"$4,107,023","country":"USA","day":"16","month":"05","year":"2004","remarks":"2,656 Screens"},{"money":"$5,816,841","country":"USA","day":"09","month":"05","year":"2004","remarks":"3,158 Screens"},{"money":"$9,876,246","country":"USA","day":"02","month":"05","year":"2004","remarks":"3,453 Screens"},{"money":"$21,054,238","country":"USA","day":"25","month":"04","year":"2004","remarks":"3,438 Screens"},{"money":"£55,879","country":"UK","day":"05","month":"09","year":"2004","remarks":"173 Screens"},{"money":"£196,606","country":"UK","day":"29","month":"08","year":"2004","remarks":"285 Screens"},{"money":"£388,848","country":"UK","day":"22","month":"08","year":"2004","remarks":"354 Screens"},{"money":"£690,377","country":"UK","day":"15","month":"08","year":"2004","remarks":"366 Screens"},{"money":"£1,184,273","country":"UK","day":"08","month":"08","year":"2004","remarks":"366 Screens"},{"money":"€154,028","country":"Netherlands","day":"22","month":"08","year":"2004","remarks":"35 Screens"}],"admissions":[{"money":"188,203","country":"Brazil","day":"12","month":"09","year":"2004","remarks":""},{"money":"156,766","country":"Brazil","day":"05","month":"09","year":"2004","remarks":""},{"money":"113,989","country":"Brazil","day":"29","month":"08","year":"2004","remarks":""},{"money":"51,832","country":"Brazil","day":"22","month":"08","year":"2004","remarks":""},{"money":"151,864","country":"Germany","day":"26","month":"09","year":"2004","remarks":""},{"money":"468,669","country":"Germany","day":"19","month":"09","year":"2004","remarks":""},{"money":"232,676","country":"Germany","day":"12","month":"09","year":"2004","remarks":""},{"money":"33,000 (South","country":"Korea","day":"07","month":"11","year":"2004","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"03","month":"05","year":"2003","remarks":null},{"money":null,"country":null,"day":"31","month":"08","year":"2003","remarks":null}],"copyrightHolder":"© 2004 Revolution Studios Distribution Company, LLC (on print)"},"technical":{"runtime":["1 hr 38 min (98 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm (Kodak Vision 2383)"]},"rating":"6.1","metascore":"57","filmingLocations":[{"location":"Spring Street Towers - 650 S. Spring Street, Downtown, Los Angeles, California, USA"}],"rated":"PG-13","awards":[{"award":"MTV Movie Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Best Musical Performance","names":[{"name":"Jennifer Garner","id":"nm0004950","role":null},{"name":"Mark Ruffalo","id":"nm0749263","role":null}]}]}]},{"award":"People's Choice Awards, USA 2005","titlesAwards":[{"titleAwardOutcome":"Nominated People's Choice Award","categories":[{"category":"Favorite Movie Comedy","names":[]}]}]},{"award":"Teen Choice Awards 2004","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie - Date Movie","names":[]},{"category":"Choice Movie - Comedy","names":[]},{"category":"Choice Movie Actor - Comedy","names":[{"name":"Mark Ruffalo","id":"nm0749263","role":null}]},{"category":"Choice Movie Actress - Comedy","names":[{"name":"Jennifer Garner","id":"nm0004950","role":null}]},{"category":"Choice Movie Hissy Fit","names":[{"name":"Jennifer Garner","id":"nm0004950","role":null}]},{"category":"Choice Movie Blush","names":[{"name":"Jennifer Garner","id":"nm0004950","role":null}]},{"category":"Choice Movie Liplock","names":[{"name":"Jennifer Garner","id":"nm0004950","role":null},{"name":"Mark Ruffalo","id":"nm0749263","role":null}]},{"category":"Choice Movie Sleazebag","names":[{"name":"Judy Greer","id":"nm0339460","role":null}]},{"category":"Choice Movie Chemistry","names":[{"name":"Jennifer Garner","id":"nm0004950","role":null},{"name":"Mark Ruffalo","id":"nm0749263","role":null}]}]}]}],"votes":"127,712","type":"Movie","companyCreditsSimple":[{"idCompany":"co0003580","name":"Revolution Studios"},{"idCompany":"co0107045","name":"Thirteen Productions"}],"keywords":{"keywords":["wish","13th birthday","30 year old","year 1987","13 year old","birthday","party","friend","editor","birthday party","magazine editor","best friend","magazine","teenage girl","wedding","athlete","coming of age film","body swap","body transformation","13 year old girl","teenage boy","male female friendship","reference to bambi","reference to rick springfield","reference to madonna","reference to eminem","teen movie","chick flick","hate","nightgown","magical dust","dance scene","female tears","workplace rivalry","office job","stolen idea","pitch meeting","staff meeting","birthday wish","prank","blindfolded","dollhouse","closet","birthday girl","age in title","four word title","kiss","long brown hair","brunette","tween girl","hairy chest","bare chested male","do over","female protagonist","what if","comfort","taking a picture","school photo","manhattan new york city","makeup","kissing game","digit in title","camcorder","birthday present","blame","spontaneous choreography","thriller dance","competing businesses","greenwich village manhattan new york city","empire state building manhattan new york city","dance","central park manhattan new york city","thong","ends with wedding","new york city","teen angst","unrequited love","fish out of water","aging","altering history","turmoil","junior high school","time travel","new jersey","magazine format","friendship","estrangement","childhood friend","wish fulfillment","time travel romance","mud mask","striptease","photographer","mother daughter relationship","library","first love","fiance fiancee relationship","father daughter relationship","coming of age","co worker","taxi driver","business presentation","boyfriend girlfriend relationship","blindfold","betrayal","2000s","1980s","child as adult","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 01:52:29"}}