{"data":{"movies":[{"title":"Bridget Jones: The Edge of Reason","originalTitle":"","year":"2004","releaseDate":"20041119","directors":[{"name":"Beeban Kidron","id":"nm0452319"}],"writers":[{"name":"Helen Fielding","id":"nm0276144"},{"name":"Andrew Davies","id":"nm0203577"}],"runtime":"108 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTJlNWQxZjctYmE3ZS00OTc0LWE2M2ItNzQwNmYyMjU4NDNmXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["UK","France","Germany","Ireland","USA"],"languages":["English","German","Thai"],"genres":["Comedy","Drama","Romance"],"plot":"The story picks up four weeks after the first film, and already Bridget Jones is becoming uncomfortable in her relationship with Mark Darcy. Apart from discovering that he's a conservative voter, she has to deal with a new boss, strange contractor, and the worst vacation of her life.","simplePlot":"After finding love, Bridget Jones questions if she really has everything she's dreamed of having.","actors":[{"actorName":"Renée Zellweger","urlProfile":"http://www.imdb.com/name/nm0000250","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMzYwMDI2OF5BMl5BanBnXkFtZTgwMzg3NjYwMzE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1969","placeOfBirth":" Katy, Texas, USA","birthName":"Renée Kathleen Zellweger","height":"5' 3\" (1.6 m)","bio":"Renée Kathleen Zellweger was born on April 25, 1969, in Katy, Texas, USA. Her mother, Kjellfrid Irene (Andreassen), is a Norwegian-born former nurse and midwife, of Norwegian, Kven (Finnish), and Swedish descent. Her father, Emil Erich Zellweger, is a Swiss-born engineer. The two married in 1963. Renée has a brother named Drew Zellweger, a marketing executive born on February 15, 1967. Renée got interested in acting in high school while working on the drama club. She also took an acting class at the University of Texas (Austin), where she began looking towards acting as a career. After graduation, she wanted to continue acting, but Hollywood is a tough town to break into, so Renée decided to stay in Texas, and auditioned for roles around Houston, where she managed to grab roles in such films as Reality Bites (1994) and Empire Records (1995). While on the set for the sequel, Texas Chainsaw Massacre: The Next Generation (1994), she befriended Matthew McConaughey, another Hollywood up-and-comer. He was working on a project at the time that Renée was interested in, auditioned for, and won the role in the film Love and a .45 (1994), which earned her enough critical praise that she decided to move to Los Angeles. Another role in The Whole Wide World (1996) followed which led to her big break. Cameron Crowe was busy casting his next film, Jerry Maguire (1996), starring Tom Cruise. Crowe was considering such actresses as Cameron Diaz, Bridget Fonda, Winona Ryder, and Marisa Tomei, when he heard of Zellweger's performance in The Whole Wide World (1996). He auditioned Zellweger and was sure he'd found his Dorothy Boyd. Renée followed her huge success with a few small independent films and after receiving further critical praise, she felt confident enough to reenter the world of big-budget Hollywood films. She starred opposite Meryl Streep in the tear-jerker One True Thing (1998). She also took a role in Me, Myself & Irene (2000), opposite Jim Carrey, and soon after began dating Carrey. The two denied their relationship at first, but finally gave in and admitted it; today they are no longer together. Also in 2000, she starred in the title role in Nurse Betty (2000), where she won a Golden Globe for Best Actress in a Comedy/Musical. In 2001, she received even more critical and commercial success in the title role in Bridget Jones's Diary (2001). She received her first Academy Award nomination for her role, which was followed by her second Oscar-nominated role in the musical Chicago (2002). She then again wowed audiences with her fierce yet warm portrayal of Ruby Thewes in the film adaptation of Cold Mountain (2003), which won Zellweger an Oscar for Best Supporting Actress, which was her first Academy Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMzYwMDI2OF5BMl5BanBnXkFtZTgwMzg3NjYwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000250","name":"Renée Zellweger","nicknames":["Zelly"],"idIMDB":"nm0000250"},"actorId":"nm0000250","character":"Bridget Jones","urlCharacter":"http://www.imdb.com/character/ch0003174","main":true},{"actorName":"Gemma Jones","urlProfile":"http://www.imdb.com/name/nm0428121","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNjE1OTkzOV5BMl5BanBnXkFtZTgwNzc0MzU2MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 December 1942","placeOfBirth":" Marylebone, London, England, UK","birthName":"Jennifer R. Jones","height":"5' 6\" (1.68 m)","bio":"Gemma Jones was born on December 4, 1942 in Marylebone, London, England as Jennifer R. Jones. She is an actress, known for Bridget Jones's Diary (2001), Bridget Jones: The Edge of Reason (2004) and Sense and Sensibility (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNjE1OTkzOV5BMl5BanBnXkFtZTgwNzc0MzU2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0428121","name":"Gemma Jones","idIMDB":"nm0428121"},"actorId":"nm0428121","character":"Mum","urlCharacter":"http://www.imdb.com/character/ch0058355","main":true},{"actorName":"Jim Broadbent","urlProfile":"http://www.imdb.com/name/nm0000980","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY4ODgzMTg3MV5BMl5BanBnXkFtZTYwMDE4NTc0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 May 1949","placeOfBirth":" Lincoln, Lincolnshire, England, UK","birthName":"James Broadbent","height":"6' 2\" (1.88 m)","bio":"One of England's most versatile character actors, Jim Broadbent was born on May 24, 1949, in Lincolnshire, the youngest son of furniture maker Roy Laverick Broadbent and sculptress Doreen \"Dee\" (Findlay) Broadbent. Jim attended a Quaker boarding school in Reading before successfully applying for a place at an art school. His heart was in acting, though, and he would later transfer to the London Academy of Music and Dramatic Art (LAMDA). Following his 1972 graduation, he began his professional career on the stage, performing with the Royal National Theatre, the Royal Shakespeare Company, and as part of the National Theatre of Brent, a two-man troupe which he co-founded. In addition to his theatrical work, Broadbent did steady work on television, working for such directors as Mike Newell and Stephen Frears. Broadbent made his film debut in 1978 with a small part in Jerzy Skolimowski's The Shout (1978). He went on to work with Frears again in The Hit (1984) and with Terry Gilliam in Time Bandits (1981) and Brazil (1985), but it was through his collaboration with Mike Leigh that Broadbent first became known to an international film audience. In 1990 he starred in Leigh's Life Is Sweet (1990), a domestic comedy that cast him as a good-natured cook who dreams of running his own business. Broadbent gained further visibility the following year with substantial roles in Neil Jordan's The Crying Game (1992) and Mike Newell's Enchanted April (1991), and he could subsequently be seen in such diverse fare as Woody Allen's Bullets Over Broadway (1994), Widows' Peak (1994), Richard Loncraine's highly acclaimed adaptation of Shakespeare's Richard III (1995) and Little Voice (1998), the last of which cast him as a seedy nightclub owner. Appearing primarily as a character actor in these films, Broadbent took center stage for Leigh's Topsy-Turvy (1999), imbuing the mercurial W.S. Gilbert with emotional complexity and comic poignancy. Jim's breakthrough year was 2001, as he starred in three critically and commercially successful films. Many would consider him the definitive supporting actor of that year. First he starred as Bridget's dad (Colin Jones) in Bridget Jones's Diary (2001), which propelled Renée Zellweger to an Oscar nomination for Best Actress. Next came the multiple Oscar-nominated film (including Best Picture) Moulin Rouge (2001), for which he won a Best Supporting Actor BAFTA award for his scene-stealing performance as Harold Zidler. Lastly, came the small biopic Iris (2001), for which he won the Oscar for Best Supporting Actor as devoted husband John Bayley to Judi Dench's Iris Murdoch, the British novelist who suffered from Alzheimer's disease. The film hit home with Jim, since his own mother had passed away from Alzheimer's in 1995.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY4ODgzMTg3MV5BMl5BanBnXkFtZTYwMDE4NTc0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000980","name":"Jim Broadbent","idIMDB":"nm0000980"},"actorId":"nm0000980","character":"Dad","urlCharacter":"http://www.imdb.com/character/ch0003172","main":true},{"actorName":"James Faulkner","urlProfile":"http://www.imdb.com/name/nm0269077","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MDk2MTEyM15BMl5BanBnXkFtZTgwNDAzNzQ0MDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1948","placeOfBirth":" Hampstead, London, England, UK","birthName":"James Sebastian Faulkner","bio":"James Faulkner was born on July 18, 1948 in Hampstead, London, England as James Sebastian Faulkner. He is an actor and producer, known for Da Vinci's Demons (2013), Downton Abbey (2010) and Game of Thrones (2011). He is married to Kate. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MDk2MTEyM15BMl5BanBnXkFtZTgwNDAzNzQ0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0269077","name":"James Faulkner","idIMDB":"nm0269077"},"actorId":"nm0269077","character":"Uncle Geoffrey","urlCharacter":"http://www.imdb.com/character/ch0065223","main":true},{"actorName":"Celia Imrie","urlProfile":"http://www.imdb.com/name/nm0408309","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY2ODkzOTE2NF5BMl5BanBnXkFtZTgwNDAwODA2NDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1952","placeOfBirth":" Guildford, Surrey, England, UK","birthName":"Celia Diana Savile Imrie","height":"5' 5½\" (1.66 m)","bio":"Celia Diana Savile Imrie is an English actress. She is known for her appearances with Victoria Wood; including Claire in Pat and Margaret (1994), Philippa Moorcroft in Dinnerladies (1998-2000) and playing various characters in the sketch show Victoria Wood As Seen On TV (1985-87), including Miss Babs in the spoof soap opera sketches Acorn Antiques. She reprised the role of Miss Babs in Acorn Antiques: The Musical! in 2005, and won the Olivier Award for Best Supporting Performance in a Musical. Imrie's other television roles include Marianne Bellshade in Bergerac (1983), Diana Neal in After You've Gone (2007-08), Gloria Millington in Kingdom (2007-09), and Miss Kizlet in the 2013 Doctor Who season opener The Bells of Saint John. Her film appearances include Highlander (1986), Hilary and Jackie (1998), Bridget Jones's Diary (2001), Calendar Girls (2003), Bridget Jones: The Edge of Reason (2004), Imagine Me & You (2005), The Best Exotic Marigold Hotel (2012) and The Second Best Exotic Marigold Hotel (2015). She has been described as \"one of the most successful British actresses of recent decades\". Imrie was born in 1952 in Guildford, Surrey, the fourth of five children of Diana Elizabeth Blois (née Cator) and David Andrew Imrie, a radiologist. Her father was from Glasgow, Scotland. Imrie was educated at Guildford High School, an independent school for girls in her hometown of Guildford, followed by the Guildford School of Acting. Imrie's varied career spans films, television and radio drama, and the theatre. Her film credits include Nanny McPhee, Hilary and Jackie (playing Iris du Pré) and the 1997 film of The Borrowers where she played Homily Clock. Other films include Bridget Jones's Diary, Calendar Girls, Highlander and, as Fighter Pilot Bravo 5, in Star Wars: Episode I - The Phantom Menace. In 2004, Imrie played Doctor Imogen Reed in the schoolgirl thriller, Out of Bounds. In 2007 Imrie appeared in St Trinian's. Television series to feature Imrie include The Nightmare Man, Oranges Are Not the Only Fruit, Casualty, Absolutely Fabulous, \"Bergerac\",The Darling Buds of May and Upstairs, Downstairs. In the 2000 miniseries of Gormenghast, she played Lady Gertrude. She also had a guest appearance in an episode of the BBC Scotland sitcom Still Game in 2003, where she played a home help called Mrs Begg. She also appeared in the 2005 BBC television drama Mr. Harvey Lights a Candle, playing the part of a teacher taking an unruly party of pupils on a day-trip to Salisbury Cathedral. She starred in the BBC sitcom, After You've Gone, alongside Nicholas Lyndhurst and in the ITV1 drama Kingdom, with Stephen Fry. Her part in After You've Gone has, whilst being critically acclaimed, been described as \"criminally squandered\". In 2013 she guest starred in the BBC's Doctor Who where she played the villainous Miss Kizlet in the series opener The Bells of Saint John. Her radio work includes parts in BBC Radio 4's No Commitments, Adventures of a Black Bag, and Bleak Expectations. In early 2007, she narrated the book Arabella, broadcast over two weeks as the Book at Bedtime. In May 2016, she made her US television debut in the DC action-adventure series Legends of Tomorrow. Imrie is perhaps best known for her frequent collaborations with Victoria Wood, with whom she has appeared in TV programmes such as the sitcom Dinnerladies and sketch show Victoria Wood As Seen On TV. It was on the latter show in 1985 that she first played the infamous part of Miss Babs, owner of Acorn Antiques, a parody of the low budget British soap opera Crossroads. These sketches became such a British institution that the show was turned into a West End musical in 2005 starring most of the original cast (see the picture on the right). Imrie won an Olivier Award for her performance. The character has curly blonde hair, and is known for her frequent parodic flirtations with the customers, and her abuse of the housekeeper Mrs Overall (portrayed by Julie Walters). Imrie was the guest on Desert Island Discs on BBC Radio 4 on 13 February 2011. On 18 October 2013 she was awarded an honorary doctorate by the University of Winchester.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY2ODkzOTE2NF5BMl5BanBnXkFtZTgwNDAwODA2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0408309","name":"Celia Imrie","nicknames":["Impie","Ceals","Celia Impie"],"idIMDB":"nm0408309"},"actorId":"nm0408309","character":"Una Alconbury","urlCharacter":"http://www.imdb.com/character/ch0065222","main":true},{"actorName":"Dominic McHale","urlProfile":"http://www.imdb.com/name/nm0570357","urlPhoto":"","biography":{"bio":"Dominic McHale is an actor and writer, known for Bridget Jones: The Edge of Reason (2004), Bridget Jones's Diary (2001) and The Short Walk (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0570357","name":"Dominic McHale","idIMDB":"nm0570357"},"actorId":"nm0570357","character":"Bernard","urlCharacter":"http://www.imdb.com/character/ch0065245","main":true},{"actorName":"Colin Firth","urlProfile":"http://www.imdb.com/name/nm0000147","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMDMwMTI4MF5BMl5BanBnXkFtZTcwMzE2MzQxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1960","placeOfBirth":" Grayshott, Hampshire, England, UK","birthName":"Colin Andrew Firth","height":"6' 1½\" (1.87 m)","bio":"Colin Andrew Firth was born into an academic family in Grayshott, Hampshire, England. His mother, Shirley Jean (Rolles), was a comparative religion lecturer at the Open University, and his father, David Norman Lewis Firth, lectured on history at Winchester University College (formerly King Alfred's College) in Winchester, and worked on education for the Nigerian government. His grandparents were missionaries. His siblings Katie Firth and Jonathan Firth are also actors. Firth's first acting experience came in infant's school when he played \"Jack Frost\" in a Christmas pantomime. Three of his four grandparents were Methodist missionaries and he spent his early childhood in Nigeria, returning to England at age five where he entered a comprehensive school in Winchester. He spent two years at the Drama Centre London in Chalk Farm where he was \"discovered\" while playing \"Hamlet\" during his final term. His first professional role was as \"Bennet\" in the West End production of \"Another Country\". From this performance, he was chosen to play the character of \"Judd\" in the movie of the play. He went on to play a variety of character parts in both film and television. For his portrayal of \"Robert Lawrence\" in the 1989 TV production Tumbledown (1988), he received the Royal Television Society Best Actor award and also a BAFTA nomination. He also received a BAFTA nomination for \"Mr. Darcy\" in the 1995 TV version of Pride and Prejudice (1995). In 2011, he won the Oscar for Best Actor for his commanding leading role, playing British King George VI in The King's Speech (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMDMwMTI4MF5BMl5BanBnXkFtZTcwMzE2MzQxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000147","name":"Colin Firth","idIMDB":"nm0000147"},"actorId":"nm0000147","character":"Mark Darcy","urlCharacter":"http://www.imdb.com/character/ch0026817","main":true},{"actorName":"Donald Douglas","urlProfile":"http://www.imdb.com/name/nm0235028","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg3NzY0MDg1NF5BMl5BanBnXkFtZTgwOTAwMDIyMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 March 1933","placeOfBirth":" Falkirk, Stirlingshire, Scotland, UK","bio":"Mr Douglas was born on 7th March 1933 in Falkirk, Scotland, attending Falkirk High School and Edinburgh College of Art before enrolling at the Royal Academy of Dramatic Art in London . His earliest television parts were as the young hero in two adaptations of Walter Scott novels 'Redgauntlet' and 'Rob Roy' , the latter with a young Samantha Eggar, and has subsequently appeared in a vast array of roles, apart from the inevitable Scots 'go to' parts - 'Taggart', 'Monarch of the Glen' - but also in 'Middlemarch' as idealistic Dr Lydgate, 'Poldark' as the red coat captain anxious to trap Ross Poldark, a sinister charmer in 'Poirot: the ABC Murders' as well as continuing dramas like 'Kavanagh QC' and 'East Enders'. Having made his stage debut at the Glasgow Citizens Theatre and with wide experience in rep his stage roles include 'Absurd Person Singular' directed by its author Alan Ayckbourn at the Whitehall theatre, London and in 'Medea' with Dame Diana Rigg, both in London and on Broadway whilst he has played the key role of Colin Firth's father in all of the Bridget Jones films to date. Donald Douglas lives near Toulouse in France and one of his neighbours is Robin Ellis, who appeared with him in 'Poldark.'","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg3NzY0MDg1NF5BMl5BanBnXkFtZTgwOTAwMDIyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0235028","name":"Donald Douglas","idIMDB":"nm0235028"},"actorId":"nm0235028","character":"Admiral Darcy","urlCharacter":"http://www.imdb.com/character/ch0065255","main":true},{"actorName":"Shirley Dixon","urlProfile":"http://www.imdb.com/name/nm0228983","urlPhoto":"","biography":{"bio":"Shirley Dixon is an actress, known for Babel (2006), Bridget Jones: The Edge of Reason (2004) and United (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0228983","name":"Shirley Dixon","idIMDB":"nm0228983"},"actorId":"nm0228983","character":"Mrs. Darcy","urlCharacter":"http://www.imdb.com/character/ch0065224","main":true},{"actorName":"Neil Pearson","urlProfile":"http://www.imdb.com/name/nm0669345","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MjU1Nzg3NF5BMl5BanBnXkFtZTcwNTI3MjUxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 April 1959","placeOfBirth":" London, England, UK","bio":"Neil was born in South London, the eldest of three. He was educated at Woolverstone Hall, a boarding school in Suffolk, where he gained his first acting experience. He trained at the Central School for Speech and Drama and spent the 1980s in constant work in the theatre and playing small TV parts, especially in sitcoms such as That's Love (1988) and Chelmsford 123 (1988). His break came in 1990 as \"Dave\", in the award winning sitcom Drop the Dead Donkey (1990), and his success has been further established as the lead in the highly acclaimed TV police drama Between the Lines (1992). He still lives (alone) in South London and supports Spurs.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MjU1Nzg3NF5BMl5BanBnXkFtZTcwNTI3MjUxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0669345","name":"Neil Pearson","idIMDB":"nm0669345"},"actorId":"nm0669345","character":"Richard Finch","urlCharacter":"http://www.imdb.com/character/ch0003200","main":true},{"actorName":"Rosalind Halstead","urlProfile":"http://www.imdb.com/name/nm1310137","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExNTIxMDI0MDdeQTJeQWpwZ15BbWU4MDMxMTU3OTEx._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1984","placeOfBirth":" England, UK","height":"5' 10\" (1.78 m)","bio":"Rosalind Halstead trained as a dancer at The Central School of Ballet. After several stage appearances in her youth, with the National Youth Theatre and at the Edinburgh Festival, Rosalind first appeared on screen in Stephen Whittaker's Sons and Lovers, followed quickly by a guest role in the BBC's very successful Love Soup, written by David Renwick and produced by the late Verity Lambert. Rosalind has made her mark on screen in both film and TV and her credits to date include; Bridget Jones: The Edge of Reason, directed by Beeban Kidron, Stephen Frears' Mrs Henderson Presents, Elizabeth: The Golden Age, produced by Tim Bevan and Eric Fellner and directed by Shekhar Kapur, David Leland's Virgin Territory, Mammoth Screen's Wuthering Heights, directed by Coky Giedroyc, BBC's Sherlock, Endeavour and Marple both for ITV.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExNTIxMDI0MDdeQTJeQWpwZ15BbWU4MDMxMTU3OTEx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1310137","name":"Rosalind Halstead","idIMDB":"nm1310137"},"actorId":"nm1310137","character":"Receptionist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Luis Soto","urlProfile":"http://www.imdb.com/name/nm1259813","urlPhoto":"","biography":{"bio":"Luis Soto is an actor, known for An Education (2009), Bridget Jones: The Edge of Reason (2004) and MediEvil (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1259813","name":"Luis Soto","idIMDB":"nm1259813"},"actorId":"nm1259813","character":"Mexican Ambassador","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Brooke","urlProfile":"http://www.imdb.com/name/nm1623508","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NTE0OTkwMV5BMl5BanBnXkFtZTgwOTM0OTI0MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1978","placeOfBirth":" London, England, UK","height":"6' 1\" (1.85 m)","bio":"Tom Brooke was born in 1979. He trained at the London Academy of Music and Dramatic Art (LAMDA) and lives in London. He is best known for his roles as the angel Fiore in AMC/Amazon Prime's 'Preacher', Bill Wiggins in the BBC's 'Sherlock' and Thick Kevin in Richard Curtis' film 'Pirate Radio', starring Phillip Seymour Hoffman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NTE0OTkwMV5BMl5BanBnXkFtZTgwOTM0OTI0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1623508","name":"Tom Brooke","idIMDB":"nm1623508"},"actorId":"nm1623508","character":"Production Assistant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hugh Grant","urlProfile":"http://www.imdb.com/name/nm0000424","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MTgxOTk2Ml5BMl5BanBnXkFtZTcwNzMwMjYwMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1960","placeOfBirth":" Hammersmith, London, England, UK","birthName":"Hugh John Mungo Grant","height":"5' 11\" (1.8 m)","bio":"Hugh Grant, one of Britain's best known faces, has been equally entertaining on-screen as well as in real life, and has had enough sense of humor to survive a media frenzy. He is known for his roles in Four Weddings and a Funeral (1994), with Andie MacDowell, Notting Hill (1999), opposite Julia Roberts, and Music and Lyrics (2007), opposite Drew Barrymore, among his other works. He was born Hugh John Mungo Grant on September 9, 1960, in Hammersmith, London, United Kingdom. His mother, Fyvola Susan (MacLean), was a teacher. His father, James Murray Grant, was an artist and carpet salesman, and his grandfather was in the British Army during WWII. He is of mostly Scottish and English descent, with many recent ancestors who were prominent in the military. Young Grant was fond of literature and acting. He won a scholarship to Oxford, going up to New College in 1979. There he was involved in student drama, and considered a career as an art historian. After Oxford, he turned down a scholarship to do postgraduate studies in Art History at the Courtauld Institute in London, and focused on his acting career. In 1982, while still a student, Grant made his big screen debut in Privileged (1982) by director Michael Hoffman. Grant's breakthrough came with the leading role as Charles in Four Weddings and a Funeral (1994), opposite Andie MacDowell, a role which won him a Golden Globe Award, as well as a BAFTA Film Award for Best Actor. During the 1990s Grant established himself as a very original and resourceful actor. He played a string of characters projecting a positive mindset, showing how do you stay optimistic when you are actually worried about a cascade of troubles. Grant had his own experience as a survivor of an unfortunate episode in his private life, which he managed to overcome thanks to having a pretty damn good outlook on life. His forte is playing characters projecting warmth and sincere happiness, with his hallmark stuttering, albeit some accused him of reprising the same character he has been playing for the past two decades. Grant's ability to show his character development within a limited screen time shines in Love Actually (2003), with his witty portrayal of a Prime Minister whose personal insecurities become intertwined with his country's international affairs, a performance that earned him a nomination for European Audience Award. His screen presence and skillful understatement takes his characters beyond the written script, thanks to his mastery of timing and effortless style. Outside of his acting profession, Grant has been a good athlete, he played cricket and football in his younger years. He enjoys playing golf, frequently taking part in Pro-Am tournaments. He has been an avid art lover since his younger years, and has been collecting fine art, a passion he inherited from his father.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MTgxOTk2Ml5BMl5BanBnXkFtZTcwNzMwMjYwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000424","name":"Hugh Grant","idIMDB":"nm0000424"},"actorId":"nm0000424","character":"Daniel Cleaver","urlCharacter":"http://www.imdb.com/character/ch0003176","main":true},{"actorName":"Alba Fleming Furlan","urlProfile":"http://www.imdb.com/name/nm1746377","urlPhoto":"","biography":{"bio":"Alba Fleming Furlan is an actress, known for Bridget Jones: The Edge of Reason (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1746377","name":"Alba Fleming Furlan","idIMDB":"nm1746377"},"actorId":"nm1746377","character":"Girl in Rome","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0317198","urlIMDB":"http://www.imdb.com/title/tt0317198","business":{"budget":{"money":"$40,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$8,684,055","country":"USA","day":"14","month":"11","year":"2004","remarks":"530 Screens"},{"money":"£10,435,193","country":"UK","day":"14","month":"11","year":"2004","remarks":"504 Screens"},{"money":"€3,289,103","country":"Italy","day":"09","month":"01","year":"2005","remarks":"399 Screens"},{"money":"€870,378","country":"Netherlands","day":"14","month":"11","year":"2004","remarks":"109 Screens"}],"gross":[{"money":"$40,203,020","country":"USA","day":"16","month":"01","year":"2005","remarks":""},{"money":"$40,069,690","country":"USA","day":"09","month":"01","year":"2005","remarks":""},{"money":"$39,877,945","country":"USA","day":"02","month":"01","year":"2005","remarks":""},{"money":"$39,594,770","country":"USA","day":"26","month":"12","year":"2004","remarks":""},{"money":"$39,314,970","country":"USA","day":"19","month":"12","year":"2004","remarks":""},{"money":"$38,413,455","country":"USA","day":"12","month":"12","year":"2004","remarks":""},{"money":"$36,321,105","country":"USA","day":"05","month":"12","year":"2004","remarks":""},{"money":"$31,963,405","country":"USA","day":"28","month":"11","year":"2004","remarks":""},{"money":"$21,511,685","country":"USA","day":"21","month":"11","year":"2004","remarks":""},{"money":"$8,684,055","country":"USA","day":"14","month":"11","year":"2004","remarks":""},{"money":"£35,612,127","country":"UK","day":"09","month":"01","year":"2005","remarks":""},{"money":"£35,089,179","country":"UK","day":"02","month":"01","year":"2005","remarks":""},{"money":"£34,168,360","country":"UK","day":"26","month":"12","year":"2004","remarks":""},{"money":"£33,609,077","country":"UK","day":"19","month":"12","year":"2004","remarks":""},{"money":"£32,473,118","country":"UK","day":"12","month":"12","year":"2004","remarks":""},{"money":"£30,571,861","country":"UK","day":"05","month":"12","year":"2004","remarks":""},{"money":"£27,007,461","country":"UK","day":"28","month":"11","year":"2004","remarks":""},{"money":"£20,691,687","country":"UK","day":"21","month":"11","year":"2004","remarks":""},{"money":"£10,435,193","country":"UK","day":"14","month":"11","year":"2004","remarks":""},{"money":"€10,013,891","country":"Italy","day":"13","month":"03","year":"2005","remarks":""},{"money":"€9,363,542","country":"Italy","day":"30","month":"01","year":"2005","remarks":""},{"money":"€8,374,431","country":"Italy","day":"23","month":"01","year":"2005","remarks":""},{"money":"€6,491,114","country":"Italy","day":"16","month":"01","year":"2005","remarks":""},{"money":"€3,289,103","country":"Italy","day":"09","month":"01","year":"2005","remarks":""},{"money":"€4,980,630","country":"Netherlands","day":"23","month":"01","year":"2005","remarks":""},{"money":"€4,487,381","country":"Netherlands","day":"02","month":"01","year":"2005","remarks":""},{"money":"€3,757,083","country":"Netherlands","day":"12","month":"12","year":"2004","remarks":""},{"money":"€2,711,041","country":"Netherlands","day":"28","month":"11","year":"2004","remarks":""},{"money":"€870,378","country":"Netherlands","day":"14","month":"11","year":"2004","remarks":""}],"weekendGross":[{"money":"$73,660","country":"USA","day":"16","month":"01","year":"2005","remarks":"116 Screens"},{"money":"$123,760","country":"USA","day":"09","month":"01","year":"2005","remarks":"221 Screens"},{"money":"$131,755","country":"USA","day":"02","month":"01","year":"2005","remarks":"216 Screens"},{"money":"$67,220","country":"USA","day":"26","month":"12","year":"2004","remarks":"188 Screens"},{"money":"$331,500","country":"USA","day":"19","month":"12","year":"2004","remarks":"514 Screens"},{"money":"$1,114,155","country":"USA","day":"12","month":"12","year":"2004","remarks":"1,701 Screens"},{"money":"$2,761,455","country":"USA","day":"05","month":"12","year":"2004","remarks":"2,433 Screens"},{"money":"$6,231,960","country":"USA","day":"28","month":"11","year":"2004","remarks":"2,469 Screens"},{"money":"$10,044,890","country":"USA","day":"21","month":"11","year":"2004","remarks":"2,450 Screens"},{"money":"$8,684,055","country":"USA","day":"14","month":"11","year":"2004","remarks":"530 Screens"},{"money":"£217,915","country":"UK","day":"09","month":"01","year":"2005","remarks":"163 Screens"},{"money":"£284,144","country":"UK","day":"02","month":"01","year":"2005","remarks":"289 Screens"},{"money":"£81,733","country":"UK","day":"26","month":"12","year":"2004","remarks":"308 Screens"},{"money":"£517,953","country":"UK","day":"19","month":"12","year":"2004","remarks":"349 Screens"},{"money":"£863,219","country":"UK","day":"12","month":"12","year":"2004","remarks":"427 Screens"},{"money":"£1,696,588","country":"UK","day":"05","month":"12","year":"2004","remarks":"484 Screens"},{"money":"£3,009,954","country":"UK","day":"28","month":"11","year":"2004","remarks":"487 Screens"},{"money":"£5,047,315","country":"UK","day":"21","month":"11","year":"2004","remarks":"506 Screens"},{"money":"£10,435,193","country":"UK","day":"14","month":"11","year":"2004","remarks":"504 Screens"},{"money":"€649,090","country":"Italy","day":"30","month":"01","year":"2005","remarks":"235 Screens"},{"money":"€1,331,123","country":"Italy","day":"23","month":"01","year":"2005","remarks":"357 Screens"},{"money":"€2,177,639","country":"Italy","day":"16","month":"01","year":"2005","remarks":"428 Screens"},{"money":"€63,269","country":"Netherlands","day":"23","month":"01","year":"2005","remarks":"59 Screens"},{"money":"€126,217","country":"Netherlands","day":"02","month":"01","year":"2005","remarks":"102 Screens"},{"money":"€352,044","country":"Netherlands","day":"12","month":"12","year":"2004","remarks":"111 Screens"},{"money":"€585,059","country":"Netherlands","day":"28","month":"11","year":"2004","remarks":"111 Screens"},{"money":"€870,378","country":"Netherlands","day":"14","month":"11","year":"2004","remarks":"109 Screens"}],"admissions":[{"money":"2,237,329","country":"Germany","day":"28","month":"02","year":"2005","remarks":""},{"money":"2,223,788","country":"Germany","day":"30","month":"01","year":"2005","remarks":""},{"money":"2,205,277","country":"Germany","day":"23","month":"01","year":"2005","remarks":""},{"money":"2,163,862","country":"Germany","day":"16","month":"01","year":"2005","remarks":""},{"money":"2,082,257","country":"Germany","day":"09","month":"01","year":"2005","remarks":""},{"money":"500,282","country":"Germany","day":"05","month":"12","year":"2004","remarks":""},{"money":"1,637,688","country":"Italy","day":"13","month":"03","year":"2005","remarks":""},{"money":"1,526,569","country":"Italy","day":"30","month":"01","year":"2005","remarks":""},{"money":"1,361,979","country":"Italy","day":"23","month":"01","year":"2005","remarks":""},{"money":"264,314","country":"Norway","day":"30","month":"12","year":"2004","remarks":""},{"money":"253,088","country":"Norway","day":"23","month":"12","year":"2004","remarks":""},{"money":"154,201","country":"Norway","day":"29","month":"11","year":"2004","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"06","month":"10","year":"2003","remarks":null},{"money":null,"country":null,"day":"15","month":"02","year":"2004","remarks":null}],"copyrightHolder":"Universal Studios and StudioCanal and Miramax Film Corp."},"technical":{"runtime":["1 hr 48 min (108 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Framestore CFC, London, UK (digital intermediate)","Technicolor, London, UK"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Panavision (anamorphic) (source format)"],"printedFilmFormat":["35 mm"]},"rating":"5.9","metascore":"44","filmingLocations":[{"location":"Aldbury, Hertfordshire, England, UK"}],"rated":"R","awards":[{"award":"Golden Globes, USA 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Performance by an Actress in a Motion Picture - Comedy or Musical","names":[{"name":"Renée Zellweger","id":"nm0000250","role":null}]}]}]},{"award":"Empire Awards, UK 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Empire Award","categories":[{"category":"Best British Film","names":[]}]}]},{"award":"Jupiter Award 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Jupiter Award","categories":[{"category":"Best International Actress","names":[{"name":"Renée Zellweger","id":"nm0000250","role":null}]}]}]},{"award":"People's Choice Awards, USA 2005","titlesAwards":[{"titleAwardOutcome":"Nominated People's Choice Award","categories":[{"category":"Favorite Movie Comedy","names":[]},{"category":"Favorite Sequel","names":[]}]}]},{"award":"Teen Choice Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie Blush Scene","names":[{"name":"Renée Zellweger","id":"nm0000250","role":null}]},{"category":"Choice Movie Rockstar Moment","names":[{"name":"Renée Zellweger","id":"nm0000250","role":null}]}]}]},{"award":"Visual Effects Society Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated VES Award","categories":[{"category":"Outstanding Created Environment in a Live Action Motion Picture","names":[{"name":"Alex Hope","id":"nm0393944","role":null},{"name":"Jody Johnson","id":"nm0425400","role":null},{"name":"Pieter Warmington","id":"nm1837301","role":null}]}]}]}],"votes":"83,012","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"},{"idCompany":"co0047476","name":"StudioCanal"},{"idCompany":"co0022594","name":"Miramax"}],"keywords":{"keywords":["intern","prison","thailand","f rated","six word title","american actress playing british character","kissing while having sex","kiss","blonde woman","blonde","british woman","title directed by female","british comedy","female protagonist","reference to jane austen","urban setting","irreverence","chick flick","boyfriend girlfriend relationship","self doubt","opposites attract","old flame","betrayal","lesbian kiss","illegal drug","fountain","bra","lesbian","parachute","beach","airplane","new york city","dating","blockbuster","wedding","skiing","second part","reporter","premarital sex","marriage proposal","london england","law firm","germany","england","diary","bangkok thailand","attorney","sequel","based on novel","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 16:20:40"}}