{"data":{"movies":[{"title":"Resident Evil: Apocalypse","originalTitle":"","year":"2004","releaseDate":"20040910","directors":[{"name":"Alexander Witt","id":"nm0936838"}],"writers":[{"name":"Paul W.S. Anderson","id":"nm0027271"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NTUxMzk0Nl5BMl5BanBnXkFtZTcwNDQ1MDIzMw@@._V1.jpg","countries":["Germany","France","UK","Canada","USA"],"languages":["English"],"genres":["Action","Horror","Sci-Fi","Thriller"],"plot":"Alice awakens from a terrible sleep to find her worst fears realized--the bloodthirsty Undead, which she and the now-annihilated squad of elite military fought to destroy, have been unleashed on the city that surrounds the secret facility of the Umbrella Corporation. Discovering she was an Umbrella experiment, Alice has been bio-genetically enhanced with new strengths, senses and dexterity--and she will need them. In the heart of the ravaged Raccoon City, a small group of uninfected people, including Jill Valentine, a recently demoted member of Umbrella Corp's elite Special Tactics and Rescue Services team, and S.T.A.R.S team leader Carlos Oliveira, fight for their lives against swarms of Undead and the deadlier and faster Lickers. Running out of luck and resources, the group is rescued by Alice, and they begin to wage an exhilarating battle to survive and escape before the Umbrella Corporation erases its experiment from the face of the earth. Their only hope lies somewhere within ...","simplePlot":"Alice awakes in Raccoon City, only to find it has become infested with zombies and monsters. With the help of Jill Valentine and Carlos Olivera, Alice must find a way out of the city before it is destroyed by a nuclear missile.","actors":[{"actorName":"Milla Jovovich","urlProfile":"http://www.imdb.com/name/nm0000170","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA1Nzc4NjYwNV5BMl5BanBnXkFtZTcwNjA2NjY1Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 December 1975","placeOfBirth":" Kiev, Ukrainian SSR, USSR [now Ukraine]","birthName":"Militza Jovovich","height":"5' 8\" (1.73 m)","bio":"Milla Jovovich is an Ukrainian-born actress, supermodel, fashion designer, singer and public figure, who was on the cover of more than a hundred magazines, and starred in such films as The Fifth Element (1997), Ultraviolet (2006), and the Resident Evil (2002) franchise. Milica Bogdanovna Jovovich was born on December 17, 1975 in Kiev, Ukrainian SSR, Soviet Union (now in Ukraine). Her Serbian father, Bogdan Jovovich, was a medical doctor in Kiev. There, he met her mother, Galina Jovovich (née Loginova), a Russian actress. At the age of 5, in 1981, Milla emigrated with her parents from the Soviet Union, moving first to London, UK, then to Sacramento, California, and eventually settled in Los Angeles. There her parents worked as house cleaners for the household of director Brian De Palma. Her parents separated, and eventually divorced, because her father was arrested and spent several years in prison. Young Milla Jovovich was brought up by her single mother in Los Angeles. In addition to her native Russian, she also speaks Serbian and English. However, in spite of her cosmopolitan background, Milla was ostracized by some of her classmates, as a kid who emigrated from the Soviet Union amidst the paranoia of the Cold War. Many emotional scars had affected her behavior, but she eventually emerged as a resilient, multi-talented, albeit rebellious and risk-taking girl. She was coached by her actress mother since her childhood, first at home, then studied music, ballet, and acting in Los Angeles. She shot to international fame after she was spotted by the photographer Richard Avedon at the age of 11, and was featured in Revlon's \"Most Unforgettable Women in the World\" advertisements, and on the cover of the Italian fashion magazine 'Lei' which was her first cover shoot. She made her first professional model contract at the age of 12, and soon made it to the cover of 'The Face', 'Vogue', 'Cosmopolitan' and many other magazines. In 1994, she appeared on the cover of 'High Times' in the UK, at the age of 18. The total number of her magazine covers worldwide was over one hundred by 2004, and keeps counting. In 2004, she made $10.4 million, becoming the highest paid supermodel in the world. Milla appeared in ad campaigns for Chanel, Versace, Emporio Armani, Donna Karen, DKNY, Celine, P&K, H&H, and continues her role as the worldwide spokesmodel for L'Oreal. Thanks to their continued success with Milla, Giorgio Armani chose her to be the face of his fragrance, Night. In addition to Armani's fragrance, Milla was the face for Calvin Klein's Obsession and Christian Dior's Poison for over 10 years and has most recently become the new face for Donna Karan's Cashmere Mist fragrance, which debuts in August 2009. Milla continues to shoot with the fashion industry's most sought after photographers, including Peter Lindbergh, Mario Sorrenti, Craig McDean and Inez & Vinoodh. Milla made her acting debut in the Disney Channel movie The Night Train to Kathmandu (1988) and she made guest appearances on television series including Married with Children (1987) (in 1989 as a French exchange student), Guns of Paradise (1988) and Parker Lewis Can't Lose (1990). In 1988, at age 12, she made her film debut credited as Milla in a supporting role in Two Moon Junction (1988) by writer/director Zalman King. During the 1980s and early 1990s, she played several supporting roles as a teenage actress in film and on television, then starred in Return to the Blue Lagoon (1991). In 1997, she co-starred opposite Bruce Willis in the sci-fi blockbuster The Fifth Element (1997), then she starred as the title character of The Messenger: The Story of Joan of Arc (1999). In the early 2000s, Milla had a few years of uncertainty in her acting career due to the uneven quality of her films, as well as some hectic events in her private life. She appeared with Mel Gibson in Wim Wenders' The Million Dollar Hotel (2000) which premiered at the Berlin Film Festival. She went on to co-star with Wes Bentley and Sarah Polley in The Claim (2000) and in Ben Stiller's spoof of the world of models and high-fashion, Zoolander (2001). Milla achieved box office success in the U.S. and around the world with the action-packed thriller, Resident Evil (2002), based on the wildly popular video game, Resident Evil. It was written and directed by Paul W.S. Anderson. Milla reprised her role as the zombie slaying heroine, Alice, in Resident Evil: Apocalypse (2004), Resident Evil: Extinction (2007), Resident Evil: Afterlife (2010), and again in Resident Evil: Retribution (2012). A sixth resident Evil movie is in pre-production. She received glowing reviews opposite Oscar-winner Adrien Brody and Illeana Douglas in Dummy (2002) which premiered at the Toronto Film Festival. In the spring of 2006, Milla returned to the big screen as action heroine, Violet, in the futuristic film Ultraviolet (2006) directed by Kurt Wimmer. Focusing on her personal sense of style, her love of fashion led Milla and her friend and business partner, Carmen Hawk, to launch their Jovovich-Hawk clothing line, which achieved instant acclaim in the domestic and international fashion world. The fresh, unique line garnered the attention of red carpet watchers and fashion magazines, including American Vogue, who featured Jovovich-Hawk on their coveted list of \"10 Things to Watch Out for in 2005.\" A student of voice and guitar since she was very young, Milla began writing songs for her first record at the age of 15. Her first album, \"The Divine Comedy\", was released by EMI Records in 1994. Informed by her experiences as a child growing up as a Russian emigrant in the Red-bashing Reagan era, the introspective European-folkish debut drew favorable reviews for Milla's songwriting and performing. She continues to write music, and has had songs featured on several film soundtracks. She has been writing music and lyrics to her song-demos, playing her guitar and sampling other sounds from her computer, and allowing free download and remix of her songs from her website. Charitable work also plays a major part in Milla's life. She has served as Master of Ceremonies and co-chaired with Elizabeth Taylor for the amfAR and Cinema Against AIDS event at the Venice Film Festival, and has been heavily involved with The Ovarian Cancer Research Fund, as well as The Wildlands Project. For many years Milla Jovovich has been maintaining a healthier lifestyle, practicing yoga and meditation, trying to avoid junk food, and cooking for herself. Since she was a little girl, Milla has been writing a private diary, a habit she learned from her mother. She has been keeping a record of many good and bad facts of her life, her travels, her relationships, and all important ideas and events in her career, planning eventually to publish an autobiography. After dissolution of her two previous marriages, Milla Jovovich became engaged to film director Paul W.S. Anderson; their daughter, Ever Anderson, was born on November 3, 2007.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA1Nzc4NjYwNV5BMl5BanBnXkFtZTcwNjA2NjY1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000170","name":"Milla Jovovich","idIMDB":"nm0000170"},"actorId":"nm0000170","character":"Alice","urlCharacter":"http://www.imdb.com/character/ch0001091","main":true},{"actorName":"Sienna Guillory","urlProfile":"http://www.imdb.com/name/nm0347149","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTc1MTczOV5BMl5BanBnXkFtZTgwNjU4ODM2NTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 March 1975","placeOfBirth":" Kettering, Northamptonshire, England, UK","birthName":"Sienna Tiggy Guillory","height":"5' 6\" (1.68 m)","bio":"Sienna Guillory is the daughter of American folk guitarist Isaac Guillory and Tina Thompson, an English model. Guillory's parents encouraged her to express herself artistically as she was growing up and this led to her decision to become an actor. She was educated at Gresham's School, Holt, Norfolk, England and appeared in school plays. Her acting break came when she was 16, and was cast in the TV movie Riders (1993). To support her acting career, Guillory also took up modeling and appeared in campaigns for such high profile companies as Armani and Dolce & Gabbana, as well as gracing many magazine covers. Further acting success followed in TV and films. Projects include The Time Machine (2002), Love Actually (2003) and the 'Resident Evil' film series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTc1MTczOV5BMl5BanBnXkFtZTgwNjU4ODM2NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0347149","name":"Sienna Guillory","idIMDB":"nm0347149"},"actorId":"nm0347149","character":"Jill Valentine","urlCharacter":"http://www.imdb.com/character/ch0001093","main":true},{"actorName":"Oded Fehr","urlProfile":"http://www.imdb.com/name/nm0004912","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyNzkyOTMyOF5BMl5BanBnXkFtZTgwMzM0MDEwNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 November 1970","placeOfBirth":" Tel Aviv, Israel","height":"6' 1½\" (1.87 m)","bio":"Oded Fehr was born on November 23, 1970 in Tel Aviv, Israel. He is an actor, known for The Mummy (1999), The Mummy Returns (2001) and Resident Evil: Extinction (2007). He has been married to Rhonda Tollefson since December 22, 2000. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyNzkyOTMyOF5BMl5BanBnXkFtZTgwMzM0MDEwNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004912","name":"Oded Fehr","idIMDB":"nm0004912"},"actorId":"nm0004912","character":"Carlos Olivera","urlCharacter":"http://www.imdb.com/character/ch0001094","main":true},{"actorName":"Thomas Kretschmann","urlProfile":"http://www.imdb.com/name/nm0470981","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1Njc5MzE1OF5BMl5BanBnXkFtZTcwMTc1NDM4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 September 1962","placeOfBirth":" Dessau, German Democratic Republic [now Saxony-Anhalt, Federal Republic of Germany]","height":"5' 9¼\" (1.76 m)","bio":"Thomas Kretschmann was born in East Germany. Before becoming an actor, he was a swimmer. He has acted in several popular American movies, such as Resident Evil: Apocalypse (2004), The Pianist (2002), U-571 (2000), In Enemy Hands (2004), etc. He has three children, Nicolas, Stella and Sascha with his ex-girlfriend Lena.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1Njc5MzE1OF5BMl5BanBnXkFtZTcwMTc1NDM4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0470981","name":"Thomas Kretschmann","idIMDB":"nm0470981"},"actorId":"nm0470981","character":"Major Cain","urlCharacter":"http://www.imdb.com/character/ch0001116","main":true},{"actorName":"Sophie Vavasseur","urlProfile":"http://www.imdb.com/name/nm1070538","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MTA4MDU3N15BMl5BanBnXkFtZTcwNTk3ODEyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1992","placeOfBirth":" Dublin, Ireland","bio":"Sophie Vavasseur was born in 1992 in Dublin, Ireland. She is an actress, known for Resident Evil: Apocalypse (2004), Evelyn (2002) and Becoming Jane (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MTA4MDU3N15BMl5BanBnXkFtZTcwNTk3ODEyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1070538","name":"Sophie Vavasseur","idIMDB":"nm1070538"},"actorId":"nm1070538","character":"Angie Ashford","urlCharacter":"http://www.imdb.com/character/ch0001127","main":true},{"actorName":"Razaaq Adoti","urlProfile":"http://www.imdb.com/name/nm0012398","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg5MDExODAwN15BMl5BanBnXkFtZTgwMjYzMTAyNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 3\" (1.91 m)","bio":"Razaaq Adoti (a.k.a. Raz) was born in England to Nigerian parents. He started on the stage at age 17. While still in college, he was cast as Nathan Detroit in the National Youth and Music Theatre Company's (NYMT) production of Guys and Dolls. He earned his Bachelor of Arts degree in acting at the prestigious Central School of Speech and Drama. Upon graduation, he was signed by one of London's most reputable talent agencies. In 1997, he was cast in a major supporting role in Steven Spielberg's new epic, Amistad. After completing Amistad, he returned to London and worked on various television and film projects. In 2001, Adoti played the main antagonist in Ridley Scott's Black Hawk Down, Yousuf Dahir Mo'alim. Since then he has gone on to co-star in Resident Evil: Apocalypse, opposite Milla Jovovich, and most recently the movie Cover, directed by Bill Duke. Adoti's past television credits include Sky One's award-winning television drama Dream Team, BBC's BAFTA award-winning miniseries Holding On, ITV's award-winning television drama, Soldier Soldier and Channel 4's controversial miniseries Men Only.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg5MDExODAwN15BMl5BanBnXkFtZTgwMjYzMTAyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0012398","name":"Razaaq Adoti","idIMDB":"nm0012398"},"actorId":"nm0012398","character":"Sgt. Peyton Wells","urlCharacter":"http://www.imdb.com/character/ch0001142","main":true},{"actorName":"Jared Harris","urlProfile":"http://www.imdb.com/name/nm0364813","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDQ3MDYwM15BMl5BanBnXkFtZTcwNTE5MjQ1Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1961","placeOfBirth":" London, England, UK","birthName":"Jared Francis Harris","height":"5' 11¾\" (1.82 m)","bio":"Jared Francis Harris was born in London, England. He is the son of Irish actor Richard Harris and Welsh actress Elizabeth Harris (Elizabeth Rees), and brother of Damian Harris and Jamie Harris. Despite his lineage, Jared showed little interest in becoming an actor, until he was cast in a college production while attending North Carolina's Duke University (USA), where he studied drama and literature, in the early 1980s. After graduation, Jared returned to the UK where he attended Central School of Speech and Drama, along such future stars as Jason Isaacs and James Nesbitt. After graduation, Jared joined the Royal Shakespeare Company, performing in Mark Rylance's Hamlet, Romeo & Juliet, the Silent Woman and A Clockwork Orange. In 1989, he had his screen debut in The Rachel Papers (1989). In 1990, while on vacation in New York, Jared auditioned for the role of Hotspur in Henry IV part 1, which he played at the New York Shakespeare Festival. Still in New York, Jared appeared in the off-Broadway play Ecstasy, for which he won an Obie Award in 1992. In 1996, he won recognition by playing famous pop artist Andy Warhol in I Shot Andy Warhol (1996). After that success, Jared has gone on to many independent films, with a few titles being: Natural Born Killers (1994), Smoke (1995), Happiness (1998), Comment tuer le chien de son voisin (2000), Igby Goes Down (2002), B. Monkey (1998), Shadow Magic (2000) and VH1's Two of Us (2000) where he portrayed John Lennon. He has also starred in blockbusters movies, including: The Last of the Mohicans (1992), Mr. Deeds (2002), Resident Evil: Apocalypse (2004), The Curious Case of Benjamin Button (2008), Sherlock Holmes: A Game of Shadows (2011), Lincoln (2012). And has created memorable characters on such popular TV shows as: The Riches (2007), Fringe (2008), Mad Men (2007). Jared is married to Allegra Riggio, a well-known lighting designer and TV host.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDQ3MDYwM15BMl5BanBnXkFtZTcwNTE5MjQ1Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0364813","name":"Jared Harris","nicknames":["Hot Buns"],"idIMDB":"nm0364813"},"actorId":"nm0364813","character":"Dr. Ashford","urlCharacter":"http://www.imdb.com/character/ch0027972","main":true},{"actorName":"Mike Epps","urlProfile":"http://www.imdb.com/name/nm0258402","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MjEzOTQyNF5BMl5BanBnXkFtZTYwNjM1MjU0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1970","placeOfBirth":" Indianapolis, Indiana, USA","birthName":"Michael Elliot Epps","height":"6' 1\" (1.85 m)","bio":"Mike Epps was born on November 18, 1970 in Indianapolis, Indiana, USA as Michael Elliot Epps. He is an actor and producer, known for The Hangover (2009), Resident Evil: Apocalypse (2004) and The Hangover Part III (2013). He has been married to Mechelle McCain (I) since July 28, 2006. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MjEzOTQyNF5BMl5BanBnXkFtZTYwNjM1MjU0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0258402","name":"Mike Epps","idIMDB":"nm0258402"},"actorId":"nm0258402","character":"L.J.","urlCharacter":"http://www.imdb.com/character/ch0001106","main":true},{"actorName":"Sandrine Holt","urlProfile":"http://www.imdb.com/name/nm0002142","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0OTc5NjI1NzleQTJeQWpwZ15BbWU4MDMwNzYwNzEx._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1972","placeOfBirth":" London, England, UK","birthName":"Sandrine Ho","height":"5' 10\" (1.78 m)","bio":"Sandrine Holt made her feature film debut in Bruce Beresford's epic Black Robe (1991), which earned her a Genie Award nomination for Best Supporting Actress. She has starred in such films as Rapa Nui (1994), Dance Me Outside (1994) and Pocahontas: The Legend (1995). In addition, she co-starred with Jennifer Garner, Buck Henry and Amanda Peet in 1999 (1998), Giovanni Veronesi's Il mio West (1998) starring David Bowie and Harvey Keitel, Loving Jezebel (1999), Fast Food Fast Women (2000), The Mission (1994) and Century Hotel (2001). Most recently she appeared in Resident Evil: Apocalypse (2004) with Milla Jovovich and Oded Fehr, and Happy Hour (2003) with Anthony LaPaglia and Eric Stoltz. Her television credits include the lead role in the John Woo series Les repentis (1996) and guest appearances on New York Undercover (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0OTc5NjI1NzleQTJeQWpwZ15BbWU4MDMwNzYwNzEx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002142","name":"Sandrine Holt","nicknames":["Dreeny"],"idIMDB":"nm0002142"},"actorId":"nm0002142","character":"Terri Morales","urlCharacter":"http://www.imdb.com/character/ch0001117","main":true},{"actorName":"Matthew G. Taylor","urlProfile":"http://www.imdb.com/name/nm0007092","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTQ4MTY2Nl5BMl5BanBnXkFtZTYwOTA2ODgy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 6\" (1.98 m)","bio":"Matthew G. Taylor is a Canadian born Actor who has been a part of the Television and Film industry since 1998. He grew up in a Toronto suburb and attended College in Hamilton, Ontario, graduating in 1994. Matthew is an ex-police officer and has often been able to use his experiences on the force when performing. Matthew stands at 6 feet 7 inches, weighs 280 pounds and studied Martial Arts for many years. This has presented him with many unique opportunities to pursue in his Television and Film career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTQ4MTY2Nl5BMl5BanBnXkFtZTYwOTA2ODgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0007092","name":"Matthew G. Taylor","idIMDB":"nm0007092"},"actorId":"nm0007092","character":"Nemesis","urlCharacter":"http://www.imdb.com/character/ch0028644","main":true},{"actorName":"Zack Ward","urlProfile":"http://www.imdb.com/name/nm0911933","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4ODk0MDMwM15BMl5BanBnXkFtZTcwODMxNDc4Nw@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 August 1970","placeOfBirth":" Toronto, Ontario, Canada","height":"5' 10\" (1.78 m)","bio":"Zack Ward was born in 1970. He wanted to act, but his mom, an actress herself, wanted her son to be normal, and would not let him. Finally, his brother intervened, allowing Zack the chance to act. After a year of the small stuff, he got his first big audition for the '80s classic A Christmas Story (1983). About 300 kids showed up for the part (originally he was the sidekick, Grover), and he kept getting called back until it was him and one other redhead. He won the role. On the first set, in Cleveland, the director told him that he was to play the part of Scut Farcus instead of Grover. This was his breakthrough.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4ODk0MDMwM15BMl5BanBnXkFtZTcwODMxNDc4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0911933","name":"Zack Ward","idIMDB":"nm0911933"},"actorId":"nm0911933","character":"Nicholai Ginovaeff","urlCharacter":"http://www.imdb.com/character/ch0001107","main":true},{"actorName":"Iain Glen","urlProfile":"http://www.imdb.com/name/nm0322513","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NzU2NjI2MF5BMl5BanBnXkFtZTcwMzI1OTQ3Mw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 June 1961","placeOfBirth":" Edinburgh, Scotland, UK","height":"6' 1\" (1.85 m)","bio":"Iain Glen is a Scottish actor, he was born on June 24, 1961 in Edinburgh, Scotland. He was educated at the Edinburgh Academy, an independent school for boys (now co-educational), followed by the University of Aberdeen. He graduated from the Royal Academy of Dramatic Art, where he was the winner of the Bancroft Gold Medal. He has appeared onstage as \"Macbeth\" (Tron Theatre), \"Henry V\" (Royal Shakespeare Company), starred in \"Martin Guerre\" and in \"The Blue Room\" with Nicole Kidman. He also received much acclaim for his role in \"Silent Scream\". He and his wife, Susannah Harker (House of Cards (1990), Pride and Prejudice (1995), Ultraviolet (1998)) have a son, Finlay.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NzU2NjI2MF5BMl5BanBnXkFtZTcwMzI1OTQ3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0322513","name":"Iain Glen","idIMDB":"nm0322513"},"actorId":"nm0322513","character":"Dr. Isaacs","urlCharacter":"http://www.imdb.com/character/ch0001105","main":true},{"actorName":"Dave Nichols","urlProfile":"http://www.imdb.com/name/nm0629565","urlPhoto":"","biography":{"bio":"Dave Nichols is an actor, known for Resident Evil: Apocalypse (2004), Hardcore (1979) and Half Baked (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0629565","name":"Dave Nichols","idIMDB":"nm0629565"},"actorId":"nm0629565","character":"Captain Henderson","urlCharacter":"http://www.imdb.com/character/ch0028630","main":true},{"actorName":"Stefen Hayes","urlProfile":"http://www.imdb.com/name/nm1357243","urlPhoto":"","biography":{"bio":"Stefen Hayes is an actor, known for Resident Evil: Apocalypse (2004), The Shrine (2010) and Ecstasy (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1357243","name":"Stefen Hayes","idIMDB":"nm1357243"},"actorId":"nm1357243","character":"Yuri Loginova","urlCharacter":"http://www.imdb.com/character/ch0028017","main":true},{"actorName":"Geoffrey Pounsett","urlProfile":"http://www.imdb.com/name/nm0693785","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTIxOTIwNF5BMl5BanBnXkFtZTcwNjQ1OTUwOQ@@._V1_UY44_CR9,0,32,44_AL_.jpg","biography":{"height":"6' 2\" (1.88 m)","bio":"Geoffrey Pounsett is known for his work on Resident Evil: Apocalypse (2004), Total Recall (2012) and The Girlfriend Experience (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTIxOTIwNF5BMl5BanBnXkFtZTcwNjQ1OTUwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0693785","name":"Geoffrey Pounsett","idIMDB":"nm0693785"},"actorId":"nm0693785","character":"Mackenzie","urlCharacter":"http://www.imdb.com/character/ch0028016","main":true}],"seasons":[],"idIMDB":"tt0318627","urlIMDB":"http://www.imdb.com/title/tt0318627","business":{"budget":{"money":"$45,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$23,036,273","country":"USA","day":"12","month":"09","year":"2004","remarks":"3,284 Screens"},{"money":"£801,171","country":"UK","day":"10","month":"10","year":"2004","remarks":"283 Screens"},{"money":"€1,277,633","country":"Italy","day":"07","month":"11","year":"2004","remarks":"241 Screens"},{"money":"€25,699","country":"Netherlands","day":"16","month":"01","year":"2005","remarks":"29 Screens"},{"money":null,"country":null,"day":"05","month":"11","year":"2004","remarks":"171 Screens"}],"gross":[{"money":"$51,201,453","country":"USA","day":"31","month":"10","year":"2004","remarks":""},{"money":"$50,585,125","country":"USA","day":"24","month":"10","year":"2004","remarks":""},{"money":"$50,138,512","country":"USA","day":"17","month":"10","year":"2004","remarks":""},{"money":"$49,010,903","country":"USA","day":"10","month":"10","year":"2004","remarks":""},{"money":"$47,027,651","country":"USA","day":"03","month":"10","year":"2004","remarks":""},{"money":"$43,463,183","country":"USA","day":"26","month":"09","year":"2004","remarks":""},{"money":"$37,031,262","country":"USA","day":"19","month":"09","year":"2004","remarks":""},{"money":"$23,036,273","country":"USA","day":"12","month":"09","year":"2004","remarks":""},{"money":"£1,823,778","country":"UK","day":"24","month":"10","year":"2004","remarks":""},{"money":"£1,541,007","country":"UK","day":"17","month":"10","year":"2004","remarks":""},{"money":"£801,171","country":"UK","day":"10","month":"10","year":"2004","remarks":""},{"money":"$129,394,835 (Worldwide)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"€2,786,729","country":"Italy","day":"21","month":"11","year":"2004","remarks":""},{"money":"€2,334,961","country":"Italy","day":"14","month":"11","year":"2004","remarks":""},{"money":"€1,277,633","country":"Italy","day":"07","month":"11","year":"2004","remarks":""},{"money":"€35,026","country":"Netherlands","day":"16","month":"01","year":"2005","remarks":""}],"weekendGross":[{"money":"$81,302","country":"USA","day":"31","month":"10","year":"2004","remarks":"196 Screens"},{"money":"$240,795","country":"USA","day":"24","month":"10","year":"2004","remarks":"370 Screens"},{"money":"$673,272","country":"USA","day":"17","month":"10","year":"2004","remarks":"787 Screens"},{"money":"$1,253,117","country":"USA","day":"10","month":"10","year":"2004","remarks":"1,217 Screens"},{"money":"$2,310,267","country":"USA","day":"03","month":"10","year":"2004","remarks":"1,986 Screens"},{"money":"$4,035,512","country":"USA","day":"26","month":"09","year":"2004","remarks":"2,836 Screens"},{"money":"$8,656,591","country":"USA","day":"19","month":"09","year":"2004","remarks":"3,284 Screens"},{"money":"$23,036,273","country":"USA","day":"12","month":"09","year":"2004","remarks":"3,284 Screens"},{"money":"£107,966","country":"UK","day":"24","month":"10","year":"2004","remarks":"193 Screens"},{"money":"£416,252","country":"UK","day":"17","month":"10","year":"2004","remarks":"280 Screens"},{"money":"£801,171","country":"UK","day":"10","month":"10","year":"2004","remarks":"283 Screens"},{"money":"€250,227","country":"Italy","day":"21","month":"11","year":"2004","remarks":"138 Screens"},{"money":"€649,542","country":"Italy","day":"14","month":"11","year":"2004","remarks":"227 Screens"},{"money":"€25,699","country":"Netherlands","day":"16","month":"01","year":"2005","remarks":"29 Screens"}],"admissions":[{"money":"288,373","country":"Germany","day":"03","month":"10","year":"2004","remarks":""},{"money":"154,080","country":"Germany","day":"26","month":"09","year":"2004","remarks":""},{"money":"198,104","country":"Italy","day":"07","month":"11","year":"2004","remarks":""},{"money":"380,000 (South","country":"Korea","day":"14","month":"11","year":"2004","remarks":""},{"money":"167,000 (South","country":"Korea","day":"07","month":"11","year":"2004","remarks":""}],"productionDates":{"money":null,"country":null,"day":"03","month":"11","year":"2003","remarks":null},"filmingDates":[{"money":null,"country":null,"day":"06","month":"08","year":"2003","remarks":null},{"money":null,"country":null,"day":"10","month":"10","year":"2003","remarks":null}],"copyrightHolder":"© 2004 Davis Films/Impact (Canada) Inc./Constantin Film (UK) Limited"},"technical":{"runtime":["1 hr 34 min (94 min)","1 hr 38 min (98 min) (extended)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color (Technicolor)"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Framestore CFC (digital intermediate)","DeLuxe, London, UK (also prints)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Super 35 (source format)","Digital Intermediate (master format)"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"6,2","metascore":"35","filmingLocations":[{"location":"Northern Secondary School, Toronto, Ontario, Canada"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Make-Up","names":[{"name":"Paul Jones","id":"nm0428993","role":null}]}]}]},{"award":"Directors Guild of Canada 2005","titlesAwards":[{"titleAwardOutcome":"Nominated DGC Craft Award","categories":[{"category":"Outstanding Achievement in Sound Editing - Feature Film","names":[{"name":"Kevin Banks","id":"nm0052193","role":null},{"name":"Stephen Barden","id":"nm0002486","role":null},{"name":"Joe Bracciale","id":"nm0102675","role":null},{"name":"Lee de Lang","id":"nm0209508","role":null},{"name":"Craig Henighan","id":"nm0003357","role":null},{"name":"Jill Purdy","id":"nm0700829","role":null},{"name":"Nathan Robitaille","id":"nm0733255","role":null}]}]}]},{"award":"Genie Awards 2005","titlesAwards":[{"titleAwardOutcome":"Won Genie","categories":[{"category":"Best Achievement in Sound Editing","names":[{"name":"Craig Henighan","id":"nm0003357","role":null},{"name":"Steve Baine","id":"nm0047768","role":null},{"name":"Stephen Barden","id":"nm0002486","role":null},{"name":"Tony Lewis","id":"nm0507840","role":null},{"name":"Jill Purdy","id":"nm0700829","role":null},{"name":"Nathan Robitaille","id":"nm0733255","role":null}]}]},{"titleAwardOutcome":"Won Golden Reel Award","categories":[{"category":"","names":[{"name":"Paul W.S. Anderson","id":"nm0027271","role":null},{"name":"Jeremy Bolt","id":"nm0093337","role":null},{"name":"Don Carmody","id":"nm0138502","role":null}]}]},{"titleAwardOutcome":"Nominated Genie","categories":[{"category":"Best Achievement in Overall Sound","names":[{"name":"Dean Humphreys","id":"nm0401981","role":null},{"name":"Todd Beckett","id":"nm0065725","role":null},{"name":"David Lee","id":"nm0497112","role":null}]}]}]},{"award":"SOCAN Awards 2009","titlesAwards":[{"titleAwardOutcome":"Won SOCAN Award","categories":[{"category":"International Film Music Award","names":[{"name":"Jeff Danna","id":"nm0004582","role":null}]}]}]},{"award":"SOCAN Awards 2008","titlesAwards":[{"titleAwardOutcome":"Won SOCAN Award","categories":[{"category":"International Film Music Award","names":[{"name":"Jeff Danna","id":"nm0004582","role":null}]}]}]},{"award":"SOCAN Awards 2007","titlesAwards":[{"titleAwardOutcome":"Won SOCAN Award","categories":[{"category":"International Film Music Award","names":[{"name":"Jeff Danna","id":"nm0004582","role":null}]}]}]},{"award":"SOCAN Awards 2006","titlesAwards":[{"titleAwardOutcome":"Won SOCAN Award","categories":[{"category":"International Film Music Award","names":[{"name":"Jeff Danna","id":"nm0004582","role":null}]}]}]}],"votes":"160 243","type":"Movie","companyCreditsSimple":[{"idCompany":"co0167676","name":"Constantin Film Ltd."},{"idCompany":"co0014411","name":"Impact Pictures"}],"keywords":{"keywords":["monster","cover up","zombie apocalypse","nuclear explosion","explosion","killer dog","mutant","church","gatling gun","strong female character","strong female lead","action heroine","female protagonist","city","escape","undead","corporation","rescue","f rated","sexy woman","female hero","stick fight","sword fight","street shootout","police shootout","fistfight","hand to hand combat","nipple","upskirt","killing an animal","female reporter","legs","female gunfighter","disaster","exploding motorcycle","soldier","protector","video surveillance","knife throwing","taser","sodium hydroxide","sikorsky s 61 helicopter","whistle","weather forecast","trolley","tied to a chair","superhuman","fire","fire blanket","cure","crutches","convoy","cityscape","cement mixer","car crash","biohazard sign","corporate logo","urban setting","flashback","lasersight","desert eagle","megacorporation","one woman army","violence","girl","wound","tongue","telephone","surveillance camera","police","murder","impalement","human experimentation","hand grenade","gate","exploding helicopter","exploding car","doctor","cemetery","broken finger","anti virus","alley","mini skirt","killed by a dog","loss of friend","cannibalism","corporate crime","conspiracy","reverse footage","neck breaking","motorcycle","martial arts","handcuffs","bullet time","dark heroine","zombie child","stripper","stabbed in the head","shot in the chest","revolver","policewoman","policeman","pistol","helicopter pilot","helicopter crash","gun","dog","wheelchair","virus","tv reporter","tv news","subterranean","stained glass","sniper","shootout","school","rooftop","quarantine","police officer","one night","hospital","female nudity","father daughter relationship","child in peril","bridge","betrayal","animal attack","suicide","shot to death","shot in the head","shot in the forehead","falling from height","eaten alive","blood","shotgun","helicopter","survival horror","gore","resident evil","zombie","death of father","2000s","black screen","voice over narration","second part","sequel","based on video game","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 06:19:24"}}