{"data":{"movies":[{"title":"Babylon A.D.","originalTitle":"","year":"2008","releaseDate":"20080829","directors":[{"name":"Mathieu Kassovitz","id":"nm0440913"}],"writers":[{"name":"Maurice G. Dantec","id":"nm1175275"},{"name":"Mathieu Kassovitz","id":"nm0440913"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MzQxMzk0Nl5BMl5BanBnXkFtZTcwOTM3NDA3MQ@@._V1.jpg","countries":["France"],"languages":["English","Russian"],"genres":["Action","Adventure","Sci-Fi","Thriller"],"plot":"In a near future, the mercenary Toorop is hired by the powerful criminal Gorsky to take a woman named Aurora from a Noelite Convent in Central Asia to New York. In return, he will receive a large amount of money and a clear passport. Toorop joins Aurora and her guardian Sister Rebeka as they cross the dangerous Russian landscape chased by mercenaries that also want Aurora. On their journey, Toorop discovers that Aurora has special abilities and once in New York, they see on the news that the Noelite Convent has just been bombed. When Aurora discloses that she is a virgin and pregnant with twins, Toorop realizes that there is something sinister behind his mission and that he and Sister Rebeka are not part of Gorsky's plans.","simplePlot":"Veteran-turned-mercenary Toorop takes the high-risk job of escorting a woman from Russia to America. Little does he know that she is host to an organism that a cult wants to harvest in order to produce a genetically modified Messiah.","actors":[{"actorName":"Vin Diesel","urlProfile":"http://www.imdb.com/name/nm0004874","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNzA4MDYxN15BMl5BanBnXkFtZTcwOTI1MDAxOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1967","placeOfBirth":" Alameda County, California, USA","birthName":"Mark Sinclair","height":"5' 11¾\" (1.82 m)","bio":"Vin Diesel was born Mark Sinclair in Alameda County, California, along with his fraternal twin brother, Paul Vincent. He was raised by his astrologer/psychologist mother, Delora Sherleen (Sinclair), and adoptive father, Irving H. Vincent, an acting instructor and theater manager, in an artist's housing project in New York City's Greenwich Village. He never knew his biological father. His mother is white (with English, German, Scottish, and Irish ancestry), and his adoptive father is African-American; referring to his biological father's background, Diesel has said that he himself is \"definitely a person of colour\". His first break in acting happened by chance, when at the age of seven he and his friends broke into a theatre to vandalize it. A woman stopped them and offered them each a script and $20, on the condition that they would attend everyday after school. From there, Vin's fledgling career progressed from the New York repertory company run by his father, to the Off-Off-Broadway circuit. At age seventeen and already sporting a well-honed physique, he became a bouncer at some of New York's hippest clubs to earn himself some extra cash. It was at this time that he changed his name to Vin Diesel. Following high school, Vin enrolled as an English major at Hunter College, but dropped out after three years to go to Hollywood to further his acting career. Being an experienced theatre actor did not make any impression in Hollywood and after a year of struggling to make his mark, he returned to New York. His mother then gave him a book called \"Feature Films at used Car Prices\" by Rick Schmidt. The book showed him that he could take control of his career and make his own movies. He wrote a short film based on his own experiences as an actor, called Multi-Facial (1995), which was shot in less than three days at a cost of $3,000. Multi-Facial (1995) was eventually accepted for the 1995 Cannes Film Festival where it got a tumultuous reception. Afterwards, Vin returned to Los Angeles and raised almost $50,000 through telemarketing to fund the making of his first feature, Strays (1997). Six months after shooting, the film was accepted for the 1997 Sundance Film Festival, and although it received a good reception, it did not sell as well as hoped. Yet again Vin returned disappointed to New York only to receive a dream phone call. Steven Spielberg was impressed by Multi-Facial (1995) and wanted to meet Vin, leading him to be cast in Saving Private Ryan (1998). Multi-Facial (1995) earned Vin more work, when the director of The Iron Giant (1999) saw it and decided to cast Vin in the title role. From there, Vin's career has steadily grown, with him securing his first lead role as Richard B. Riddick in the sci-fi film Pitch Black (2000). The role has earned him a legion of devoted fans and the public recognition he deserves. Since then, he has headlined a series of blockbusters, often but not only centered on fast-driving motor vehicles: The Fast and the Furious (2001), xXx (2002), Baby-sittor (2005), Fast & Furious (2009), Fast Five (2011), Fast & Furious 6 (2013), and Furious 7 (2015). He also voiced Groot in Guardians of the Galaxy (2014) and starred in the lower-budgeted courtroom drama Jugez-moi coupable (2006), the latter directed by Sidney Lumet.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNzA4MDYxN15BMl5BanBnXkFtZTcwOTI1MDAxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004874","name":"Vin Diesel","idIMDB":"nm0004874"},"actorId":"nm0004874","character":"Toorop","urlCharacter":"http://www.imdb.com/character/ch0040402","main":true},{"actorName":"Michelle Yeoh","urlProfile":"http://www.imdb.com/name/nm0000706","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NTI0NDkzOF5BMl5BanBnXkFtZTcwMjYwMTIwNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1962","placeOfBirth":" Ipoh, Perak, Malaysia","birthName":"Yeoh Chu-Kheng","height":"5' 4\" (1.63 m)","bio":"Born as Yang Zi Qiong in the mining town of Ipoh, in West Malaysia, in the lunar year of the Tiger, Michelle is the daughter of Janet Yeoh and Yeoh Kian Teik, a lawyer and politician. She is of Han Chinese (Hokkien) descent, and spoke English and Malay before Chinese. A ballet dancer since age 4, she moved to London, England to study at the Royal Academy as a teenager. After a brief dance career, she won the Miss Malaysia beauty pageant title in her native country and the Miss Moomba beauty pageant title in Melbourne, Australia in the early 1980s. Her first on camera work was a 1984 commercial with martial arts star Jackie Chan. In 1985, she began making action movies with D&B Films of Hong Kong. She was first billed as Michelle Khan, then later, Michelle Yeoh. Never a trained martial artist, she relied on her dance discipline and her on-set trainers to prepare for her martial arts action scenes. She uses many dance moves in her films. She still does most of her own stunts and has been injured many times. Ironically, she still cannot read Chinese and she has to have Chinese script read to her. In 1988, she married wealthy D&B Films executive Dickson Poon and retired from acting. Even though they divorced in 1992, she is close to Poon's second wife and a godmother to Poon's daughter. When she returned to acting, she became very popular to Chinese audiences and she became known to western audiences through her co-starring roles in the James Bond film Tomorrow Never Dies (1997) and in the phenomenally successful Crouching Tiger, Hidden Dragon (2000) aka Crouching Tiger, Hidden Dragon' directed by Ang Lee. She turned down a role in a sequel to The Matrix (1999). She has her own production company, Mythical Films and has trained with the Shen Yang Acrobatic team for her role in Le talisman (2002), an English language film she is both starring in and producing. She hopes to use her company to discover and nurture new film-making talent. She also wants to act in roles that combine both action and deeper spiritual themes.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NTI0NDkzOF5BMl5BanBnXkFtZTcwMjYwMTIwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000706","name":"Michelle Yeoh","idIMDB":"nm0000706"},"actorId":"nm0000706","character":"Sister Rebeka","urlCharacter":"http://www.imdb.com/character/ch0102529","main":true},{"actorName":"Mélanie Thierry","urlProfile":"http://www.imdb.com/name/nm0858048","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxNjc2NzM5Nl5BMl5BanBnXkFtZTcwODAwNjc1NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 July 1981","placeOfBirth":" Saint-Germain-en-Laye, Yvelines, France","height":"5' 3\" (1.6 m)","bio":"Mélanie Thierry was born on July 17, 1981 in Saint-Germain-en-Laye, Yvelines, France. She is an actress, known for Babylon A.D. (2008), La légende du pianiste sur l'océan (1998) and La princesse de Montpensier (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxNjc2NzM5Nl5BMl5BanBnXkFtZTcwODAwNjc1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0858048","name":"Mélanie Thierry","idIMDB":"nm0858048"},"actorId":"nm0858048","character":"Aurora","urlCharacter":"http://www.imdb.com/character/ch0102530","main":true},{"actorName":"Lambert Wilson","urlProfile":"http://www.imdb.com/name/nm0933727","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMTQ5NTg5Ml5BMl5BanBnXkFtZTgwOTQ5MTA3MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 August 1958","placeOfBirth":" Neuilly-sur-Seine, Hauts-de-Seine, France","height":"6' 2\" (1.88 m)","bio":"Lambert Wilson was born in Paris and studied acting at the Drama Centre in London. A fluent English speaker, he made his feature film debut at the age of twenty-two in Fred Zinnemann's Five Days One Summer (1981) starring opposite Sean Connery. He went on to work with many of France's most prestigious auteur directors, playing leads in Andrzej Zulawski's La Femme Publique, (1983), Véra Belmont's Rouge Baiser (1984), André Téchiné's Rendez-vous, (Official Selection at Cannes and winner of the Best Director Award, 1984), Luigi Comencini's La Storia (1985), Claude Chabrol's Le Sang des Autres (1987), Philippe de Broca's Chouans (1987) and Peter Greenaway's The Belly of an Architect (1987). He starred in his actor/director father Georges Wilson's feature film debut, La Vouivre (1988), and won the Jean Gabin Award for his performance in Denis Amar's Winter '54, (1989). Further film work includes James Ivory's Jefferson in Paris (1994) opposite Nick Nolte and Gwyneth Paltrow and John Duigan's The Leading Man, with Thandie Newton and John Bon Jovi (1996). He has made four films with Alain Resnais: Same Old Song (1997), Not on the Lips, 2003, Private Fears in Public Places, (2006) and You Ain't Seen Nothing Yet (2012) and has worked with Jacques Doillon in Trop (peu) d'amour, (1997), Deborah Warner in The Last September, with Maggie Smith, Fiona Shaw, Jane Birkin and Michael Gambon (1998) and starred in Raùl Ruiz's Combat d'amour en songe (2000). His more recent, English language work includes the Wachowski brothers' Matrix Reloaded and Matrix Revolutions (2001), Pitof's Catwoman (2004) with Halle Berry and Sharon Stone, Breck Eisner's Sahara, (2005), Michael Radford's Flawless (2006) with Demi Moore and Michael Caine, and Mathieu Kassovitz's Babylon A.D. (2007) with Vin Diesel and Charlotte Rampling. He has just starred in three international productions, Lulu Wang's Posthumous with Jack Huston and Britt Marling, Victor Levin's 5 to 7 with Anton Yelchin, Glenn Close and Frank Langella, and Suite Française, opposite Michelle Williams, Kristin Scott Thomas and Matthias Shoenaerts, all due for release in 2014. Highlights from his latter French filmography include: Valérie Lemercier's Palais Royal! (2004), Xavier Beauvois' Of Gods and Men, Cannes Official Selection and Winner, Grand Prize of the Jury (2009), Bertrand Tavernier The Princess of Montpensier (2009), Alain Chabat's Le Marsupilami (2011), Philippe Le Guay's Cycling with Moliere (2012). In the summer of 2013, he played the lead in Eric Lavaine's Barbecue, opposite Florence Foresti, Franck Dubosc, Guillaume de Tonquédec, Lionel Abelanski, Jérôme Commandeur, Valérie Crouzet, Sophie Duez et Lysiane Meis (2014). Lambert Wilson is a Chevalier and Officier des Arts et des Lettres and Chevalier and Officier de l'Ordre National du Merite.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMTQ5NTg5Ml5BMl5BanBnXkFtZTgwOTQ5MTA3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0933727","name":"Lambert Wilson","idIMDB":"nm0933727"},"actorId":"nm0933727","character":"Darquandier","urlCharacter":"http://www.imdb.com/character/ch0102533","main":true},{"actorName":"Mark Strong","urlProfile":"http://www.imdb.com/name/nm0835016","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2MzAyMDc2NTheQTJeQWpwZ15BbWU3MDUzNTQyNjg@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 August 1963","placeOfBirth":" London, England, UK","birthName":"Marco Giuseppe Salussolia","height":"6' 2\" (1.88 m)","bio":"British actor Mark Strong, who played Jim Prideaux in the 2011 remake of La taupe (2011), is often cast as cold, calculating villains. But before he became a famous actor, he intended to pursue a career in law. Strong was born Marco Giuseppe Salussolia in London, England, to an Austrian mother and an Italian father. His father left the family not long after he was born, and his mother worked as an au pair to raise the boy on her own. Strong's mother had his name legally changed when he was young in order to help him better assimilate with his peers. Strong attended Wymondham College in Norfolk, and studied at the university level in Munich with the intent of becoming a lawyer. After a year, he returned to London to study English and Drama at Royal Holloway. He went on to further master his craft of at Bristol Old Vic Theatre School. Although Americans are most familiar with Strong's roles as Sinestro in Green Lantern (2011), mob boss Frank D'Amico in Kick-Ass (2010), and Lord Blackthorn in Sherlock Holmes (2009), British audiences know him from his long history as a television actor. He also starred in as numerous British stage productions, including plays at the Royal National Theatre and the RSC. His most prominent television parts include Prime Suspect 3 (1993) and Prime Suspect 6: The Last Witness (2003) as Inspector Larry Hall, and starring roles in the BBC Two dramas Our Friends in the North (1996) and The Long Firm (2004), the latter of which netted Strong a BAFTA nomination. He also played Mr. Knightley in the 1996 adaptation of Jane Austen's classic tale Emma (1996). Strong resides in London with his wife Liza Marshall, with whom he has two sons, the younger of which is the godson of his longtime friend Daniel Craig.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2MzAyMDc2NTheQTJeQWpwZ15BbWU3MDUzNTQyNjg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0835016","name":"Mark Strong","idIMDB":"nm0835016"},"actorId":"nm0835016","character":"Finn","urlCharacter":"http://www.imdb.com/character/ch0102535","main":true},{"actorName":"Jérôme Le Banner","urlProfile":"http://www.imdb.com/name/nm1544372","urlPhoto":"","biography":{"dateOfBirth":"26 December 1972","placeOfBirth":" Le Havre, France","height":"6' 3\" (1.91 m)","bio":"Jérôme Le Banner was born on December 26, 1972 in Le Havre, France. He is an actor, known for Babylon A.D. (2008), Astérix aux jeux olympiques (2008) and Bruc, the Manhunt (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1544372","name":"Jérôme Le Banner","nicknames":["Geronimo"],"idIMDB":"nm1544372"},"actorId":"nm1544372","character":"Killa","urlCharacter":"http://www.imdb.com/character/ch0102534","main":true},{"actorName":"Charlotte Rampling","urlProfile":"http://www.imdb.com/name/nm0001648","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MTgyMjIzMF5BMl5BanBnXkFtZTcwOTc3NTA0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1946","placeOfBirth":" Sturmer, Essex, England, UK","birthName":"Charlotte Tessa Rampling","height":"5' 6½\" (1.69 m)","bio":"Tessa Charlotte Rampling was born 5 February 1946 in Sturmer, England, to Isabel Anne (Gurteen), a painter, and Godfrey Lionel Rampling, an Olympic gold medalist, army officer, and colonel, who became a NATO commander. She was educated at Jeanne d'Arc Académie pour Jeunes Filles in Versailles, France and at the exclusive St. Hilda's school in Bushey, England. She was a model before entering films in Richard Lester's The Knack... and How to Get It (1965), followed by roles in Georgy Girl (1966) and Luchino Visconti's The Damned (1969). Rampling is best known for her role in Liliana Cavani's The Night Porter (1974), where she played a concentration camp survivor who is reunited with the Nazi guard (Dirk Bogarde) who tortured her throughout her captivity. In 1974, she co-starred with Sean Connery in John Boorman's science fiction adventure Zardoz (1974), with Robert Mitchum in Farewell, My Lovely (1975), with Woody Allen in his Stardust Memories (1980), and with Paul Newman in Sidney Lumet's The Verdict (1982). An actress always willing to take on bold and meaningful roles, Rampling had perhaps the most off-beat one in Nagisa Ôshima's 1986 comedy Max mon amour (1986) as Margaret, a woman in love with a chimpanzee. She has also voiced video games, such as The Ring.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MTgyMjIzMF5BMl5BanBnXkFtZTcwOTc3NTA0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001648","name":"Charlotte Rampling","nicknames":["The Legend"],"idIMDB":"nm0001648"},"actorId":"nm0001648","character":"The High Priestess","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gérard Depardieu","urlProfile":"http://www.imdb.com/name/nm0000367","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMDU4OTk5MF5BMl5BanBnXkFtZTYwNTUwODY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 December 1948","placeOfBirth":" Châteauroux, Indre, France","birthName":"Gérard Xavier Marcel Depardieu","height":"5' 10¾\" (1.8 m)","bio":"Gérard Depardieu was born in Châteauroux, Indre, France, to Anne Jeanne Josèphe (Marillier) and René Maxime Lionel Depardieu, who was a metal worker and fireman. Young delinquent and wanderer in the past, Depardieu started his acting career at the small traveling theatre \"Cafe de la Gare\", along with Patrick Dewaere and Miou-Miou. After minor roles in cinema, at last, he got his chance in Bertrand Blier's Going Places (1974). That film established a new type of hero in the French cinema and the actor's popularity grew enormously. Later, he diversified his screen image and became the leading French actor of the 80s and 90s. He was twice awarded a César as Best Actor for Le dernier métro (1980) and Cyrano de Bergerac (1990), also received an Oscar nomination for \"Cyrano\" and a number of awards at international film festivals. In 1996, he was distinguished by the highest French title of \"Chevalier du Légion d'Honneur\". He married Elisabeth Depardieu in 1971, and they divorced in 1996; she appeared with him in Jean de Florette (1986) and Manon of the Spring (1986); their children Guillaume Depardieu and Julie Depardieu are both actors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMDU4OTk5MF5BMl5BanBnXkFtZTYwNTUwODY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000367","name":"Gérard Depardieu","idIMDB":"nm0000367"},"actorId":"nm0000367","character":"Gorsky","urlCharacter":"http://www.imdb.com/character/ch0102531","main":true},{"actorName":"Joel Kirby","urlProfile":"http://www.imdb.com/name/nm0456164","urlPhoto":"","biography":{"dateOfBirth":"1964","placeOfBirth":"","height":"5' 10¾\" (1.8 m)","bio":"Joel Kirby was born in 1964. He is an actor, known for The League of Extraordinary Gentlemen (2003), Babylon A.D. (2008) and The Ghost Writer (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0456164","name":"Joel Kirby","idIMDB":"nm0456164"},"actorId":"nm0456164","character":"Dr. Newton","urlCharacter":"http://www.imdb.com/character/ch0102536","main":true},{"actorName":"Souleymane Dicko","urlProfile":"http://www.imdb.com/name/nm1304673","urlPhoto":"","biography":{"bio":"Souleymane Dicko is an actor and writer, known for Babylon A.D. (2008) and La chepor (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1304673","name":"Souleymane Dicko","idIMDB":"nm1304673"},"actorId":"nm1304673","character":"Jamal","urlCharacter":"http://www.imdb.com/character/ch0102537","main":true},{"actorName":"David Belle","urlProfile":"http://www.imdb.com/name/nm1042642","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MjQ1MjQwMV5BMl5BanBnXkFtZTcwODQ3ODQxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1973","placeOfBirth":" Fécamp, Seine-Maritime, France","height":"5' 10½\" (1.79 m)","bio":"David Belle is the founder of Parkour, an actor, film choreographer, and stunt coordinator. Belle was introduced to his acting career in a meeting with Hubert Koundé (\"La Haine\") and then in the play Pygmalion. Belle starred in \"Les gens du voyages\" and \"Un monde meilleur\", followed by \"L'Engrenages\" and \"Femme Fatale\", as well as \"Les rivières pourpres 2\", with Jean Reno. David was then contacted by Luc Besson to co-star as lead actor with Cyril Raffaelli in the action movie District 13, followed by the sequel District 13: Ultimatum.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MjQ1MjQwMV5BMl5BanBnXkFtZTcwODQ3ODQxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1042642","name":"David Belle","idIMDB":"nm1042642"},"actorId":"nm1042642","character":"Kid with Tattoos","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Radek Bruna","urlProfile":"http://www.imdb.com/name/nm1969393","urlPhoto":"","biography":{"dateOfBirth":"17 July 1973","placeOfBirth":" Litomysl, Czechoslovakia [now Czech Republic]","bio":"Radek Bruna was born on July 17, 1973 in Litomysl, Czechoslovakia. He is known for his work on The Bourne Identity (2002), Snowpiercer - le transperceneige (2013) and The Chronicles of Narnia: Prince Caspian (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1969393","name":"Radek Bruna","idIMDB":"nm1969393"},"actorId":"nm1969393","character":"Karl","urlCharacter":"http://www.imdb.com/character/ch0102538","main":true},{"actorName":"Jan Unger","urlProfile":"http://www.imdb.com/name/nm0881157","urlPhoto":"","biography":{"bio":"Jan Unger is an actor and producer, known for Babylon A.D. (2008), The Brothers Grimm (2005) and Les Misérables (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0881157","name":"Jan Unger","idIMDB":"nm0881157"},"actorId":"nm0881157","character":"Fight Promoter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Abraham Belaga","urlProfile":"http://www.imdb.com/name/nm2242168","urlPhoto":"","biography":{"bio":"Abraham Belaga is an actor, known for Robin Hood (2010), Babylon A.D. (2008) and Une vie meilleure (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2242168","name":"Abraham Belaga","idIMDB":"nm2242168"},"actorId":"nm2242168","character":"Assistant to High Priestess","urlCharacter":"http://www.imdb.com/character/ch0135202","main":true},{"actorName":"Gary Cowan","urlProfile":"http://www.imdb.com/name/nm0184561","urlPhoto":"","biography":{"bio":"Gary Cowan is an actor and producer, known for Babylon A.D. (2008), Immortel (ad vitam) (2004) and XIII (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0184561","name":"Gary Cowan","idIMDB":"nm0184561"},"actorId":"nm0184561","character":"Neolite Executive","urlCharacter":"http://www.imdb.com/character/ch0135203","main":true}],"seasons":[],"idIMDB":"tt0364970","urlIMDB":"http://www.imdb.com/title/tt0364970","business":{"budget":{"money":"$70,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$11,541,571","country":"USA","day":"31","month":"08","year":"2008","remarks":"3,390 Screens"},{"money":"£536,968","country":"UK","day":"31","month":"08","year":"2008","remarks":"311 Screens"},{"money":"RUR 73,715,234","country":"Russia","day":"31","month":"08","year":"2008","remarks":"480 Screens"}],"gross":[{"money":"$22,531,698","country":"USA","day":"16","month":"11","year":"2008","remarks":""},{"money":"$22,527,653","country":"USA","day":"09","month":"11","year":"2008","remarks":""},{"money":"$22,520,843","country":"USA","day":"02","month":"11","year":"2008","remarks":""},{"money":"$22,510,705","country":"USA","day":"26","month":"10","year":"2008","remarks":""},{"money":"$22,422,004","country":"USA","day":"12","month":"10","year":"2008","remarks":""},{"money":"$22,333,252","country":"USA","day":"05","month":"10","year":"2008","remarks":""},{"money":"$22,165,980","country":"USA","day":"28","month":"09","year":"2008","remarks":""},{"money":"$21,709,956","country":"USA","day":"21","month":"09","year":"2008","remarks":""},{"money":"$20,415,057","country":"USA","day":"14","month":"09","year":"2008","remarks":""},{"money":"$17,378,536","country":"USA","day":"07","month":"09","year":"2008","remarks":""},{"money":"$11,541,571","country":"USA","day":"31","month":"08","year":"2008","remarks":""},{"money":"£1,017,888","country":"UK","day":"07","month":"09","year":"2008","remarks":""},{"money":"£536,968","country":"UK","day":"31","month":"08","year":"2008","remarks":""},{"money":"RUR 145,641,261","country":"Russia","day":"28","month":"09","year":"2008","remarks":""},{"money":"RUR 141,719,860","country":"Russia","day":"21","month":"09","year":"2008","remarks":""},{"money":"RUR 138,154,950","country":"Russia","day":"14","month":"09","year":"2008","remarks":""},{"money":"RUR 124,101,247","country":"Russia","day":"07","month":"09","year":"2008","remarks":""},{"money":"RUR 73,715,234","country":"Russia","day":"31","month":"08","year":"2008","remarks":""}],"weekendGross":[{"money":"$2,284","country":"USA","day":"16","month":"11","year":"2008","remarks":"9 Screens"},{"money":"$3,977","country":"USA","day":"09","month":"11","year":"2008","remarks":"12 Screens"},{"money":"$6,577","country":"USA","day":"02","month":"11","year":"2008","remarks":"21 Screens"},{"money":"$11,473","country":"USA","day":"26","month":"10","year":"2008","remarks":"33 Screens"},{"money":"$60,290","country":"USA","day":"12","month":"10","year":"2008","remarks":"90 Screens"},{"money":"$102,555","country":"USA","day":"05","month":"10","year":"2008","remarks":"155 Screens"},{"money":"$226,208","country":"USA","day":"28","month":"09","year":"2008","remarks":"423 Screens"},{"money":"$754,936","country":"USA","day":"21","month":"09","year":"2008","remarks":"1,013 Screens"},{"money":"$1,864,585","country":"USA","day":"14","month":"09","year":"2008","remarks":"2,062 Screens"},{"money":"$4,180,570","country":"USA","day":"07","month":"09","year":"2008","remarks":"3,425 Screens"},{"money":"$11,541,571","country":"USA","day":"31","month":"08","year":"2008","remarks":"3,390 Screens"},{"money":"£161,179","country":"UK","day":"07","month":"09","year":"2008","remarks":"276 Screens"},{"money":"£536,968","country":"UK","day":"31","month":"08","year":"2008","remarks":"311 Screens"}],"admissions":[{"money":"894,463","country":"France","day":"30","month":"09","year":"2008","remarks":""},{"money":"40,885","country":"Netherlands","day":"31","month":"12","year":"2008","remarks":""}],"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":[{"money":null,"country":null,"day":"11","month":"12","year":"2006","remarks":null},null],"copyrightHolder":"Babylon A.D. SAS, Babylon Films Limited, StudioCanal, M6 Films"},"technical":{"runtime":["1 hr 30 min (90 min) (USA)","1 hr 26 min (86 min) (UK)","1 hr 41 min (101 min) (unrated)"],"soundMix":["Dolby Digital","DTS","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arricam LT, Panavision Primo Lenses","Arricam ST, Panavision Primo Lenses","Arriflex 435 Xtreme, Panavision Primo Lenses","Arriflex 535B, Panavision Primo Lenses"],"laboratory":["DuboiColor, France","Laboratoires LTC, Paris, France","Scanlab Film et Vidéo"],"filmLength":["2,754 m (Sweden)","2,782 m (Portugal, 35 mm)"],"negativeFormat":["35 mm (Kodak)","Video (HDTV)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Panavision (anamorphic) (source format) (some scenes)","Super 35 (source format)"],"printedFilmFormat":["35 mm (Kodak Vision 2383)"]},"rating":"5.6","metascore":"26","filmingLocations":[{"location":"Sweden"}],"rated":"PG-13","awards":[{"award":"World Soundtrack Awards 2009","titlesAwards":[{"titleAwardOutcome":"Nominated World Soundtrack Award","categories":[{"category":"Discovery of the Year","names":[{"name":"Atli Örvarsson","id":"nm0651414","role":null}]}]}]}],"votes":"83,992","type":"Movie","companyCreditsSimple":[{"idCompany":"co0353600","name":"Babylon"},{"idCompany":"co0086918","name":"MNP Entreprise"},{"idCompany":"co0047476","name":"StudioCanal"}],"keywords":{"keywords":["mercenary","new york","convent","pregnant","twin","future","asia","virgin","passport","veteran turned mercenary","russia","organism","host","harvest","cult","snowmobile jump","street shootout","road movie","prosthetic leg","car explosion","land rover","humvee","homing missile","retrieving lost memories","new york city","night cityscape","man wearing a towel","male in a shower","railroad bridge","flask of liquor","crossing the border","binoculars","mid air crash","air to surface missle","drone aircraft","polar bear","falling into frigid water","climbing a ships rope ladder","submarine breaching ice","bering strait","walking on ice","riding a train","caged animal","troitsk russia","cosmetic surgery","tunnel","armored car","wooden bridge","mi 24 hind helicopter","newscast","cooking","ak 47","poncho","earth viewed from space","starts with narration","hand to hand combat","gunfight","martial arts","kung fu","battle","virgin birth","closing eyes of dead person","woman shot","dying in childbirth","male in towel","head scar","man in towel","throwing money into the air","title ends with period","voice over narration","shower","flashback","face slap","protector","protection","zoom shot from space","whispering","walking in the rain","vehicle lifted by a helicopter","tear on cheek","taxi","street violence","sleeper hold","rule","product placement","nexis","newborn's cry","motorola","money roll","lasersight","interactive map","hummer","helium balloon","graffiti","frying pan","flying debris","flash forward","fistfight","electromagnet","countdown","coca cola","chaperone","ch 54 skycrane helicopter","caricature","canon","aurora borealis","art class","talking to the audience","stolichnaya vodka","death in childbirth","skiing","scientist","researcher","nun","mongolia","massacre","japanese","genetic alteration","wound","video surveillance","tv broadcast","train station","tracking device","tiger","tied to a bed","thrown from a boat","tattoo","tank","survival","suicide mission","submarine","strangulation","snowmobile","smuggling","shrapnel","shot to death","shot through a window","shot in the stomach","shot in the head","shot in the chest","shot in the back","shootout","scar","robot hand","rifle","religion","refugee camp","punched in the face","pregnancy","pistol","pain killer","neck brace","murder","motorcycle","missile","metal detector","memory","machine gun","jumping from height","injection","immaculate conception","ice","human trafficking","hologram","held at gunpoint","forest","father daughter relationship","falling through ice","falling from height","explosion","exploding car","exploding airplane","drowning","drone","driving through a wall","doctor","death","cyberpunk","corpse","cook","club","clone","chess","car crash","car chase","cage fighting","cabin","border","bomb","body landing on a car","bilingual","betrayal","bandage","back from the dead","artificial intelligence","airport","babylon babylonia","one man army","violence","genetic modification","escort","china","based on novel","dead woman with eyes open","bare chested male","period in title","place name in title","city name in title","acronym in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:23:00"}}