{"data":{"movies":[{"title":"The Muppets Go Hollywood","originalTitle":"","year":"1979","releaseDate":"19790516","directors":[{"name":"Stan Harris","id":"nm0365346"}],"writers":[{"name":"Don Hinkley","id":"nm0385807"},{"name":"Jerry Juhl","id":"nm0432075"}],"runtime":"60 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTBjMzE2MWQtYmMzMy00NWJmLTlmNDUtYjE5YmYxMDU4ZDZkXkEyXkFqcGdeQXVyNDUxNjc5NjY@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Family"],"simplePlot":"","actors":[{"actorName":"Frank Oz","urlProfile":"http://www.imdb.com/name/nm0000568","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NTM4ODA0OV5BMl5BanBnXkFtZTYwODMxMjQ0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1944","placeOfBirth":" Hereford, England, UK","birthName":"Frank Richard Oznowicz","height":"6' 2\" (1.88 m)","bio":"Frank Richard Oznowicz was born in Hereford, England to puppeteers Frances and Isidore Oznowicz. His family moved to Montana in 1951, eventually settling in Oakland, California. As a teenager, he worked as an apprentice puppeteer at Children's Fairyland amusement park. He is one of the primary puppeteers responsible for the development of Jim Henson's Sesame Street (1969) and _\"The Muppet Show\" (1976)_ as well as over 75 other Muppet productions. 'George Lucas' originally contacted Henson to play the part of Yoda in Star Wars: Episode V - The Empire Strikes Back (1980), but he recommended Oz for the part instead. He developed the character's trademark syntax, returning to voice and puppet the Jedi Master in Star Wars: Episode VI - Return of the Jedi (1983) and Star Wars: Episode I - The Phantom Menace (1999). He voiced the CGI character in Star Wars: Episode II - Attack of the Clones (2002) and Star Wars: Episode III - Revenge of the Sith (2005), supporting the transition of the character's rendering to digital. In 2011, the Blu-Ray edition of The Phantom Menace replaced the puppet Yoda with CGI to match the other prequel films. He began a career of behind-the-camera puppet and live action filmmaking by co-directing The Dark Crystal (1982) with Henson. He went on to direct The Muppets Take Manhattan (1984), Little Shop of Horrors (1986), Dirty Rotten Scoundrels (1988), What About Bob? (1991), The Indian in the Cupboard (1995), Bowfinger (1999), The Score (2001), The Stepford Wives (2004) and Death at a Funeral (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NTM4ODA0OV5BMl5BanBnXkFtZTYwODMxMjQ0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000568","name":"Frank Oz","idIMDB":"nm0000568"},"actorId":"nm0000568","character":"Animal / Fozzie Bear / Miss Piggy / Sam the Eagle","urlCharacter":"http://www.imdb.com/character/ch0000539","main":true},{"actorName":"Jerry Nelson","urlProfile":"http://www.imdb.com/name/nm0625456","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTg1NjEzNjU4NF5BMl5BanBnXkFtZTcwNzYxOTEzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 July 1934","placeOfBirth":" Tulsa, Oklahoma, USA","bio":"Puppeteer, actor, musician, and master of voices, Jerry Nelson originally joined Henson & Company as a temporary replacement for Frank Oz, who had been drafted into the armed services in the 60's. He later re-joined the crew as a full-time performer in the 70's, and has since been heavily involved in almost every major Muppet project, including Sesame Street (1969), The Muppet Show (1976), Fraggle Rock (1983) and feature films. Memorable characters include \"The Count\", \"Herry Monster\", \"Mumford the Magician\", \"Robin the Frog\", \"Crazy Harry\" and \"Gobo\". Come the late 1990s, Nelson has begun to focus more on his musical career but continues his involvement in The Muppets.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTg1NjEzNjU4NF5BMl5BanBnXkFtZTcwNzYxOTEzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0625456","name":"Jerry Nelson","idIMDB":"nm0625456"},"actorId":"nm0625456","character":"Floyd Pepper","urlCharacter":"http://www.imdb.com/character/ch0000706","main":true},{"actorName":"Richard Hunt","urlProfile":"http://www.imdb.com/name/nm0402611","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg3NDM0NzQzMV5BMl5BanBnXkFtZTgwMDk4MTY4NzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 August 1951","placeOfBirth":" Bronx, New York, USA","bio":"Richard Hunt did not have a face known to many -- his voice was known more than anything else. He was a major stronghold behind Jim Henson's \"Muppets\". 'Scooter', 'Janice', 'Sweetums' and a few others, were some of the \"Muppets\" that Richard was a performer and puppeteer of. He helped pave the way for Jim Henson and his company from the 1970s through the early 90s, until his surprising death in 1992 of AIDS.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg3NDM0NzQzMV5BMl5BanBnXkFtZTgwMDk4MTY4NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0402611","name":"Richard Hunt","idIMDB":"nm0402611"},"actorId":"nm0402611","character":"Janice / Pig / Scooter / Statler / Sweetums","urlCharacter":"http://www.imdb.com/character/ch0000534","main":true},{"actorName":"Dave Goelz","urlProfile":"http://www.imdb.com/name/nm0324397","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMzg3NzQyMF5BMl5BanBnXkFtZTgwMzE5MDAyNzE@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1946","placeOfBirth":" Los Angeles, California, USA","birthName":"David Charles Goelz","height":"5' 10\" (1.78 m)","bio":"A longtime puppet designer and performer, Goelz was picked up by Jim Henson and company to design Muppets for various television projects in the early 70's. By the time Jim Henson and Frank Oz were beginning work on \"The Muppet Show\", they managed to convince Dave to come work as a puppeteer. He soon began to perform and develop such memorable characters as the Great Gonzo and Dr. Bunsen Honeydew. He has gone on to become a principal Muppeteer and one of the major talents of the Jim Henson Company.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMzg3NzQyMF5BMl5BanBnXkFtZTgwMzE5MDAyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0324397","name":"Dave Goelz","idIMDB":"nm0324397"},"actorId":"nm0324397","character":"Pig / The Great Gonzo / Zoot","urlCharacter":"http://www.imdb.com/character/ch0116685","main":true},{"actorName":"Steve Whitmire","urlProfile":"http://www.imdb.com/name/nm0926209","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNDM3NzE0MV5BMl5BanBnXkFtZTgwMDk4MDAyNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 September 1958","placeOfBirth":" Atlanta, Georgia, USA","birthName":"Steven Lawrence Whitmire","height":"6' 4\" (1.93 m)","bio":"Steve Whitmire was born on September 24, 1958 in Atlanta, Georgia, USA as Steven Lawrence Whitmire. He is an actor, known for The Muppets (2011), The Muppet Christmas Carol (1992) and The Dark Crystal (1982). He has been married to Melissa Whitmire since June 1978.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNDM3NzE0MV5BMl5BanBnXkFtZTgwMDk4MDAyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0926209","name":"Steve Whitmire","nicknames":["Kermit"],"idIMDB":"nm0926209"},"actorId":"nm0926209","character":"Muppet Performer","urlCharacter":"http://www.imdb.com/character/ch0116687","main":true},{"actorName":"Kathryn Mullen","urlProfile":"http://www.imdb.com/name/nm0612020","urlPhoto":"","biography":{"dateOfBirth":"10 February 1940","placeOfBirth":" New York City, New York, USA","bio":"Kathryn Mullen was born on February 10, 1940 in New York City, New York, USA. She is an actress, known for The Dark Crystal (1982), Fraggle Rock (1983) and Between the Lions (1999). She is married to Michael K. Frith.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0612020","name":"Kathryn Mullen","idIMDB":"nm0612020"},"actorId":"nm0612020","character":"Muppet Performer","urlCharacter":"http://www.imdb.com/character/ch0116687","main":true},{"actorName":"Jim Henson","urlProfile":"http://www.imdb.com/name/nm0001345","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMzI3MjAwM15BMl5BanBnXkFtZTcwODIzMDk1OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 September 1936","placeOfBirth":" Greenville, Mississippi, USA","birthName":"James Maury Henson","height":"6' 1\" (1.85 m)","bio":"Jim Henson never thought that he would make a name of himself in puppetry; it was merely a way of getting himself on television. The vehicle that achieved it was Sam and Friends (1955), a late-night puppet show that was on after the 11:00 news in Washington DC. It proved to be very popular and inspired Jim to continue using puppets for his work. He made many commercials, developing the signature humor that Henson Productions is known for. A key reason for the success of his puppets is that Jim realized he didn't need to hide puppeteers behind a structure when they were in front of a camera. All he had to do was instruct the camera operators to focus on the puppets and keep the puppeteers out of the frame. This allowed the puppets to dominate the image and make them more lifelike. This work on puppets and television would lead to separate projects that had different goals. The first one was his work on the The Jimmy Dean Show (1963) with the character Rowlf the Dog, the oldest clearly identified character that Henson Productions still uses. This show provided an income that allowed Jim to work on a pet project. That project was Time Piece (1965), a surrealistic short about time which was nominated for best live-action short Oscar. Henson shot to prominence when he was approached to use his muppets for the revolutionary educational show Sesame Street (1969). The show was a smash hit and his characters have become staples on public television. Unforetunately, this also led to Henson being typecast as only an entertainer for children. He sought to disprove that by being part of the initial crew of Saturday Night Live (1975), but his style and that of the creative staff simply didn't jibe. It was this circumstance that encouraged him to develop a variety show format that had the kind of sophisticated humor that \"Sesame Street (1969)\" didn't work with. No American broadcaster was interested, but British producer Lew Grade was. This led to The Muppet Show (1976). It initially struggled both in the ratings and in the search for guest stars, but in the second season it became a smash hit and would eventually become the most widely watched series in television history. Hungry for a new challenge, Henson made The Muppet Movie (1979), defying the popular industry opinion that his characters would never work in a movie. The film became a hit and spawned a series of features which included the moody fantasy The Dark Crystal (1982), which was a drastic and bold departure from the amiable tone of his previous work. The most successful TV work in the 1980s was Fraggle Rock (1983), a fantasy series specifically designed to appeal to as many cultural groups as possible. During this time he also established the Creature Shop, a puppet studio that became renowned for being as brilliant with puppetry as ILM was at special effects. When he died all too soon in 1990, he was indisputably one of the geniuses of puppetry. More importantly, he was a man who achieved his phenomenal success while still retaining his social conscience and artistic integrity as his work in promoting environmentalism and his brilliant The Storyteller (1987) series respectively attest to.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMzI3MjAwM15BMl5BanBnXkFtZTcwODIzMDk1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001345","name":"Jim Henson","idIMDB":"nm0001345"},"actorId":"nm0001345","character":"Himself / Kermit the Frog / Dr. Teeth / Pig / Rowlf / Swedish Chef / Waldorf","urlCharacter":"http://www.imdb.com/character/ch0000604","main":true},{"actorName":"Peter Matz","urlProfile":"http://www.imdb.com/name/nm0560690","urlPhoto":"","biography":{"dateOfBirth":"6 November 1928","placeOfBirth":" Pittsburgh, Pennsylvania, USA","bio":"Peter Matz was born on November 6, 1928 in Pittsburgh, Pennsylvania, USA. He is known for his work on The Carol Burnett Show (1967), Torch Song Trilogy (1988) and Funny Lady (1975). He was married to Marilyn Lovell. He died on August 9, 2002 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0560690","name":"Peter Matz","idIMDB":"nm0560690"},"actorId":"nm0560690","character":"Orchestra leader","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Owens","urlProfile":"http://www.imdb.com/name/nm0654365","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNDIxMzk3NF5BMl5BanBnXkFtZTcwMjE4ODQ3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 May 1934","placeOfBirth":" Mitchell, South Dakota, USA","birthName":"Gary Bernard Altman","height":"6' 1\" (1.85 m)","bio":"Gary Owens was born on May 10, 1934 in Mitchell, South Dakota, USA as Gary Bernard Altman. He is known for his work on Rowan & Martin's Laugh-In (1967), Garfield and Friends (1988) and Roger Ramjet (1965). He was married to Arleta Lee Markell. He died on February 12, 2015 in Encino, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNDIxMzk3NF5BMl5BanBnXkFtZTcwMjE4ODQ3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0654365","name":"Gary Owens","idIMDB":"nm0654365"},"actorId":"nm0654365","character":"Himself - Announcer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Williams","urlProfile":"http://www.imdb.com/name/nm0931437","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NzI3MjM3OV5BMl5BanBnXkFtZTcwMzY3ODQ3MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 September 1940","placeOfBirth":" Bennington, Nebraska, USA","height":"5' 2\" (1.57 m)","bio":"Known for timeless classics such as \"We've Only Just Begun\", \"Rainy Days and Mondays\", \"Evergreen\", \"Just an Old Fashioned Love Song\" and \"Rainbow Connection\", Paul Williams is responsible for what will remain part of our popular culture for many years to come. His music has been recorded by some of the biggest names in the entertainment industry. Three Dog Night's versions of \"Just an Old Fashioned Love Song\", \"Out in the Country\" and \"Family of Man\" have sold millions of copies, worldwide. Karen Carpenter's rich vocals made \"We've Only Just Begun\", \"Rainy Days and Mondays\", \"Let Me Be the One\" and \"I Won't Last a Day Without You\", a part of our lives. Elvis Presley, Frank Sinatra, Ella Fitzgerald, Barbra Streisand, Willie Nelson, Kermit the Frog and Luther Vandross are among the hundreds of artists who have recorded Paul's songs. Neal McCoy recently recorded Paul's \"Party On\", while Diamond Rio recorded and took \"You're Gone\" to the top of the charts. The video for \"You're Gone\" became Pick of the Week on Country Music Television. In 1997, Paul went back into the recording studio and recorded his CD, \"Back to Love Again\", which includes remakes of some of Paul's more classic hits such as \"Rainbow Connection\" and \"I Won't Last a Day Without You\", as well as new songs which contain the same quality, passion and depth that was heard and felt in his hits from the past. Richard Carpenter and Graham Nash appear as guest artists on the album, bringing to it a richness and a quality all its own. Critics, fans and the most famous in the music industry have all had positive reactions and reviews to the album. No one sings a song like the songwriter who wrote it, and the same holds true for Paul's music. No one captures the emotion within the songs the way he can and does time and time again. Paul is one of the most celebrated songwriters of our time having won Academy, Grammy and Golden Globe Awards. His most recent accomplishments include his induction into the American Songwriters Hall of Fame. Paul's reputation as a motion picture songwriter took hold in 1973, with an Academy Award nomination for \"Nice to Be Around\" (co-written with John Williams) from Cinderella Liberty (1973). 1975 brought Paul's second nomination for the soundtrack from Brian De Palma's cult classic, Phantom of the Paradise (1974). He not only wrote the words and music and produced the album for the rock cantata, but also held the audience captive with his devious portrayal of the evil Swan. Paul went on to become the Music Supervisor for A Star Is Born (1976), bringing with it the challenge of working with three different composers to produce its award-winning score. Williams and Kenny Ascher won a Golden Globe Award for \"Best Motion Picture Score\". \"Evergreen\", co-written with Barbra Streisand, won the 1976 Oscar for \"Best Song of the Year\". In 1980, Paul was once again nominated by the Academy for the score from the box office smash hit, The Muppet Movie (1979), for \"Best Original Score\" as well as the song \"Rainbow Connection\" being nominated for \"Best Song\". \"The Muppet Movie\" soundtrack went on to win two Grammy Awards and became the biggest soundtrack album of the year, exceeding sales of one million units. Paul reunited with Henson Productions for the Disney feature film, The Muppet Christmas Carol (1992). He wrote and produced the songs for the soundtrack which brought with it yet another Grammy Award nomination for \"Best Musical Album for Children\". Paul's other film credits include the songs and score for Bugsy Malone (1976), which starred Jodie Foster and Scott Baio. \"Bugsy Malone\" continues to be a favorite of children's playhouses and theaters, worldwide. He co-wrote the title song for \"Flying Dreams\" from The Secret of NIMH (1982), which was recently recorded as a duet by Kenny Loggins and Olivia Newton-John, and has written songs for The End (1978), Rocky IV (1985) and Ishtar (1987). Paul collaborated with Jerry Goldsmith on the title song for The Sum of All Fears (2002). The song is featured in the beginning of the movie with a Latin translation and again at the end in English, performed by Electra recording artist, Yolanda Adams. This may very well be the first time in entertainment history where a song has been presented in a film in two different languages. Paul Williams began his career as an actor with his portrayal of a 12-year-old prodigy in The Loved One (1965), playing opposite Jonathan Winters. He is probably best-known for his roles as Little Enos in the \"Smokey and the Bandit\" movies, as well as the orangutan Virgil in Battle for the Planet of the Apes (1973). In 1995, Paul received stellar reviews for his starring role as a wheelchair-bound hostage in Headless Body in Topless Bar (1995). Paul is also remembered for his roles in Oliver Stone's The Doors (1991), People Like Us (1990) (the NBC miniseries based on the Dominick Dunne bestseller), as the fun-loving amphibian Gus in Frog (1987) and Frogs! (1993) and Freddie the Bomb in Solar Crisis (1990). He rarely passes up the opportunity to return to his early roots of acting and played an emergency room doctor in Roger Avary's The Rules of Attraction (2002). Paul is no stranger to the small screen. He has appeared on Picket Fences (1992), Dream On (1990), Honey, I Shrunk the Kids: The TV Show (1997), Boston Common (1996), Walker, Texas Ranger (1993) and Amour, gloire et beauté (1987). Many people are unaware that Paul has provided voice-overs for countless animated series, some of which include his role as the Penguin in Batman: The Animated Series (1992), and his recurring appearances in Phantom 2040 (1994). Having obtained his certification from UCLA as a drug and alcohol counselor, Paul is very active on the speaker's circuit across the country. Speaking from his personal experiences with his own addiction and the knowledge that he gained through his education and his experience as a counselor, Paul continues to touch the lives and hearts of many people whose lives have been affected by drug abuse and/or alcoholism. He is actively involved with the Musician's Assistance Program and is on the Board of Directors for Community High School, a sober high school in Nashville, Tennessee which offers the teens assistance with their recovery as well as the education that they both strive for and deserve. Paul has appeared on Prime Time Country (1996), The Geraldo Rivera Show (1987) and Primetime (1989), talking about the devastating effects of drugs and alcohol and the increased use of them amongst teens and pre-teens. Paul has been presented with the Global Arts Award from the Friendly House for his efforts on their behalf, the Spirit of Youth Award from the Pacific Boys Lodge for his efforts and contributions and the \"Celebration of Hope\" award given to him by Hazelden for his overall contribution in the recovery field. Recovery is not simply a field that Paul is active in, it is one that he is passionate about... this is just one way in which Paul gives of himself to others.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NzI3MjM3OV5BMl5BanBnXkFtZTcwMzY3ODQ3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0931437","name":"Paul Williams","idIMDB":"nm0931437"},"actorId":"nm0931437","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kenny Ascher","urlProfile":"http://www.imdb.com/name/nm0038502","urlPhoto":"","biography":{"dateOfBirth":"26 October 1944","placeOfBirth":" Washington, District of Columbia, USA","bio":"Kenny Ascher was born on October 26, 1944 in Washington, District of Columbia, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0038502","name":"Kenny Ascher","idIMDB":"nm0038502"},"actorId":"nm0038502","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Johnny Mathis","urlProfile":"http://www.imdb.com/name/nm0558922","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMjg2MTk0NV5BMl5BanBnXkFtZTYwMjc5NzM2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1935","placeOfBirth":" Gilmer, Texas, USA","birthName":"John Royce Mathis","height":"5' 7½\" (1.71 m)","bio":"He was the fourth of seven children born to Clement and Mildred Mathis. His father performed briefly in vaudeville and exposed all of the Mathis siblings to music. Before he entered his teens, young John received vocal lessons from Connie Cox in exchange for performing chores around her home. When he entered San Francisco State College he originally had planned to become a physical education instructor. At San Francisco State he broke classmate and basketball great Bill Russell's high jump record. While in college he began performing at a small local bar called The International Settlement, where he met performers Maya Angelou and Joan Weldon. Later performances at a club called The Blackhawk caught the attention of Columbia Records producer George Avakian. When Avakian called for Mathis to make his first recording, the young singer and then college track star had to make a unique decision: whether to record or to tryout for the 1956 Olympics held in Melbourne, Australia. He chose to make his first single \"Wonderful, Wonderful\". To date he has recorded over 100 albums with sales in excess of 180.0 million. More than 60 of his albums have been certified gold and/or platinum.\"Heavenly\"remained on the pop charts for 295 weeks. His 25th anniversary double LP stayed on the billboard top 100 album charts a record 490 weeks from its' release in 1981 until 1990. An avid golfer and gourmet cook, Mathis continues to record and perform at the world's most prestigious venues and has earned a permanent place in American music history.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMjg2MTk0NV5BMl5BanBnXkFtZTYwMjc5NzM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0558922","name":"Johnny Mathis","idIMDB":"nm0558922"},"actorId":"nm0558922","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rita Moreno","urlProfile":"http://www.imdb.com/name/nm0001549","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMzI4ODExM15BMl5BanBnXkFtZTcwNjkzNDEzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 December 1931","placeOfBirth":" Humacao, Puerto Rico","birthName":"Rosita Dolores Alverio","height":"5' 2½\" (1.59 m)","bio":"Rita Moreno has had a thriving acting career for the better part of six decades. One of the very few (and very first) performers to win an Oscar, an Emmy, a Tony and a Grammy, she was born Rosita Dolores Alverío in Humacao, Puerto Rico, on December 11, 1931, to seamstress Rosa María (Marcano) and farmer Francisco José \"Paco\" Alverío. She and her mother moved to New York City in 1937, where she began a professional career before reaching adolescence. The 11-year-old Rosita got her first movie experience dubbing Spanish-language versions of US films. Less than a month before her 14th birthday on November 22, 1945, she made her Broadway debut in the play \"Skydrift\" at the Belasco Theatre, costarring with Arthur Keegan and s young Eli Wallach. Although she would not appear again on Broadway for almost two decades, Rita Moreno, as she was billed in the play, had arrived professionally. The cover of the March 1, 1954, edition of \"Life Magazine\" featured a three-quarters, over-the-left-shoulder profile of the young Puerto Rican actress/entertainer with the provocative title \"Rita Moreno: An Actresses' Catalog of Sex and Innocence\". It was sexpot time, a stereotype that would plague her throughout the decade. If not cast as a Hispanic pepper pot, she could rely on being cast as another \"exotic\", such as her appearance on Father Knows Best (1954) as an exchange student from India. Because of a dearth of decent material, Moreno had to play roles in movies that she considered degrading. Among the better pictures she appeared in were the classic Singin' in the Rain (1952) and The King and I (1956). Director Robert Wise, who was chosen to co-direct West Side Story (1961) (the film version of the smash Broadway musical, a retelling of William Shakespeare's \"Romeo & Juliet\" with the warring Venetian clans the Montagues and Capulets re-envisioned as Irish/Polish and Puerto Rican adolescent street gangs, the Jets and the Sharks), cast Moreno as \"Anita\", the Puerto Rican girlfriend of Sharks' leader Bernardo, whose sister Maria is the piece's Juliet. However, despite her talent, roles commensurate with that talent were not forthcoming in the 1960s. The following decade would prove kinder, possibly because the beautiful Moreno had aged gracefully and could now be seen by filmmakers, TV producers and casting directors as something other than the spitfire/sexpot that Hispanic women were supposed to conform to. Ironically, it was in two vastly diverging roles--that of a $100 hooker in director Mike Nichols' brilliant realization of Jules Feiffer's acerbic look at male sexuality, Carnal Knowledge (1971) (1971), and Milly the Helper in the children's TV show The Electric Company (1971) (1971)--that signaled a career renaissance. Moreno won a 1972 Grammy Award for her contribution to \"The Electric Company\"'s soundtrack album, following it up three years later with a Tony Award as Best Featured Actress in a Musical for \"The Ritz\" (a role she would reprise in the film version, The Ritz (1976)). She then won Emmy Awards for The Muppet Show (1976) and The Rockford Files (1974). She has continued to work steadily on screen (both large and small) and on stage, solidifying her reputation as a national treasure, a status that was officially ratified with the award of the Presidential Medal of Freedom by President George W. Bush in June 2004.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMzI4ODExM15BMl5BanBnXkFtZTcwNjkzNDEzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001549","name":"Rita Moreno","idIMDB":"nm0001549"},"actorId":"nm0001549","character":"Herself - Host","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dick Van Dyke","urlProfile":"http://www.imdb.com/name/nm0001813","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMTAzMTk3OV5BMl5BanBnXkFtZTYwNzcwNzU2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1925","placeOfBirth":" West Plains, Missouri, USA","birthName":"Richard Wayne Van Dyke","height":"6' 1\" (1.85 m)","bio":"Dick Van Dyke was born Richard Wayne Van Dyke in West Plains, Missouri, to Hazel Victoria (McCord), a stenographer, and Loren Wayne Van Dyke, a salesman. His younger brother is entertainer Jerry Van Dyke. His ancestry includes English, Scottish, German, Swiss-German, and Dutch. Although he'd had small roles beforehand, Van Dyke was launched to stardom in the 1960 musical \"Bye-Bye Birdie\", for which he won a Tony Award, and, then, later in the movie based on that play, Bye Bye Birdie (1963). He has starred in a number of films throughout the years including Mary Poppins (1964), Chitty Chitty Bang Bang (1968) and Fitzwilly (1967), as well as a number of successful television series which won him no less than four Emmys and three made-for-CBS movies. After separating from his wife, Margie Willett, in the 1970s, Dick later became involved with Michelle Triola. Margie and Dick had four children born during the first ten years of their marriage: Barry Van Dyke; Carrie Beth van Dyke; Christian Van Dyke and Stacy Van Dyke, all of whom are now in their forties and married themselves. He has seven grandchildren, including Shane Van Dyke, Carey Van Dyke, Wes Van Dyke and Taryn Van Dyke (Barry's children) and family members often appear with him on Diagnosis Murder (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMTAzMTk3OV5BMl5BanBnXkFtZTYwNzcwNzU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001813","name":"Dick Van Dyke","idIMDB":"nm0001813"},"actorId":"nm0001813","character":"Himself - Host","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0329401","urlIMDB":"http://www.imdb.com/title/tt0329401","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr (60 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.4","filmingLocations":[{"location":"Ambassador Hotel - 3400 Wilshire Boulevard, Los Angeles, California, USA"}],"awards":[{"award":"Primetime Emmy Awards 1979","titlesAwards":[{"titleAwardOutcome":"Nominated Primetime Emmy","categories":[{"category":"Outstanding Achievement in Choreography","names":[{"name":"Anita Mann","id":"nm0542648","role":"choreographer"}]},{"category":"Outstanding Achievement in Tape Sound Mixing","names":[{"name":"Ed Greene","id":"nm0338742","role":"sound mixer"}]},{"category":"Outstanding Video Tape Editing for a Limited Series or a Special","names":[{"name":"Darryl Sutton","id":"nm1020681","role":null}]}]}]},{"award":"Directors Guild of America, USA 1980","titlesAwards":[{"titleAwardOutcome":"Nominated DGA Award","categories":[{"category":"Outstanding Directorial Achievement in Actuality","names":[{"name":"Stan Harris","id":"nm0365346","role":null}]}]}]}],"votes":"190","type":"TV Special","companyCreditsSimple":[{"idCompany":"co0108294","name":"Henson Associates (HA)"}],"keywords":{"keywords":["tv special","hollywood boulevard","los angeles california","beverly hills","the muppets","hollywood"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:23:59"}}