{"data":{"movies":[{"title":"Bee Movie","originalTitle":"","year":"2007","releaseDate":"20071102","directors":[{"name":"Steve Hickner","id":"nm0382769"},{"name":"Simon J. Smith","id":"nm0971239"}],"writers":[{"name":"Jerry Seinfeld","id":"nm0000632"},{"name":"Spike Feresten","id":"nm0272324"}],"runtime":"91 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDYxOTA4MF5BMl5BanBnXkFtZTcwMDE0MDUzMw@@._V1.jpg","countries":["USA","Australia"],"languages":["English"],"genres":["Animation","Adventure","Comedy","Family"],"plot":"When the bee Barry B. Benson graduates from college, he finds that he will have only one job for his entire life, and absolutely disappointed, he joins the team responsible for bringing the honey and pollination of the flowers to visit the world outside the hive. Once in Manhattan, he is saved by the florist Vanessa and he breaks the bee law to thank Vanessa. They become friends and Barry discovers that humans exploit bees to sell the honey they produce. Barry decides to sue the human race, with destructive consequences to nature.","simplePlot":"Barry B. Benson, a bee just graduated from college, is disillusioned at his lone career choice: making honey. On a special trip outside the hive, Barry's life is saved by Vanessa, a florist in New York City. As their relationship blossoms, he discovers humans actually eat honey, and subsequently decides to sue them.","actors":[{"actorName":"Jerry Seinfeld","urlProfile":"http://www.imdb.com/name/nm0000632","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMDkwMjM5NV5BMl5BanBnXkFtZTcwMzUxMTgxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1954","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Jerome Allen Seinfeld","height":"5' 11\" (1.8 m)","bio":"Jerry Seinfeld was born in Brooklyn, New York, the son of Betty (Hesney) and Kalman Seinfeld. His father was of Hungarian Jewish descent, while Jerry's maternal grandparents, Salha and Selim Hosni, were Syrian Jewish immigrants (from Aleppo). He moved with his family, including sister Carolyn, to suburban Massepequa, Long Island, at a young age. Jerry's dad, who had a terrific sense of humor, was a commercial sign maker. Jerry attended Oswego College in upstate New York but transferred to Queens College back in New York City. Developed interest in stand-up comedy after brief stints in college productions. Went straight from college graduation to amateur night tryout at New York's Catch a Rising Star, 1976. Continued to perform in local clubs and Catskill Mountain resorts until his career was boosted by an appearance on a Rodney Dangerfield HBO special, 1976. Career took off after first successful spot on The Tonight Show Starring Johnny Carson (1962), May 1981, at age 27. Appearances on Late Night with David Letterman (1982) and The Merv Griffin Show (1962) followed. Also appeared four times as Frankie on Benson (1979) sitcom. After he was abruptly fired from the show, he swore never to do another sitcom unless he had greater control. This opportunity emerged when he was invited to create a sitcom for NBC in 1989 and teamed with one-time stand-up colleague Larry David. Progression of \"The Seinfeld Chronicles\" into the long-running Seinfeld (1989) series phenomenon was ended by its co-creator and co-executive producer, Larry David. Still unmarried, he moved back to New York City into a new multimillion-dollar, multilevel apartment on Central Park West just down the street from his small bachelor studio on West 81st.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMDkwMjM5NV5BMl5BanBnXkFtZTcwMzUxMTgxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000632","name":"Jerry Seinfeld","nicknames":["Little Jerry"],"idIMDB":"nm0000632"},"actorId":"nm0000632","character":"Barry B. Benson","urlCharacter":"http://www.imdb.com/character/ch0033133","main":true},{"actorName":"Renée Zellweger","urlProfile":"http://www.imdb.com/name/nm0000250","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMzYwMDI2OF5BMl5BanBnXkFtZTgwMzg3NjYwMzE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1969","placeOfBirth":" Katy, Texas, USA","birthName":"Renée Kathleen Zellweger","height":"5' 3\" (1.6 m)","bio":"Renée Kathleen Zellweger was born on April 25, 1969, in Katy, Texas, USA. Her mother, Kjellfrid Irene (Andreassen), is a Norwegian-born former nurse and midwife, of Norwegian, Kven (Finnish), and Swedish descent. Her father, Emil Erich Zellweger, is a Swiss-born engineer. The two married in 1963. Renée has a brother named Drew Zellweger, a marketing executive born on February 15, 1967. Renée got interested in acting in high school while working on the drama club. She also took an acting class at the University of Texas (Austin), where she began looking towards acting as a career. After graduation, she wanted to continue acting, but Hollywood is a tough town to break into, so Renée decided to stay in Texas, and auditioned for roles around Houston, where she managed to grab roles in such films as Reality Bites (1994) and Empire Records (1995). While on the set for the sequel, Texas Chainsaw Massacre: The Next Generation (1994), she befriended Matthew McConaughey, another Hollywood up-and-comer. He was working on a project at the time that Renée was interested in, auditioned for, and won the role in the film Love and a .45 (1994), which earned her enough critical praise that she decided to move to Los Angeles. Another role in The Whole Wide World (1996) followed which led to her big break. Cameron Crowe was busy casting his next film, Jerry Maguire (1996), starring Tom Cruise. Crowe was considering such actresses as Cameron Diaz, Bridget Fonda, Winona Ryder, and Marisa Tomei, when he heard of Zellweger's performance in The Whole Wide World (1996). He auditioned Zellweger and was sure he'd found his Dorothy Boyd. Renée followed her huge success with a few small independent films and after receiving further critical praise, she felt confident enough to reenter the world of big-budget Hollywood films. She starred opposite Meryl Streep in the tear-jerker One True Thing (1998). She also took a role in Me, Myself & Irene (2000), opposite Jim Carrey, and soon after began dating Carrey. The two denied their relationship at first, but finally gave in and admitted it; today they are no longer together. Also in 2000, she starred in the title role in Nurse Betty (2000), where she won a Golden Globe for Best Actress in a Comedy/Musical. In 2001, she received even more critical and commercial success in the title role in Bridget Jones's Diary (2001). She received her first Academy Award nomination for her role, which was followed by her second Oscar-nominated role in the musical Chicago (2002). She then again wowed audiences with her fierce yet warm portrayal of Ruby Thewes in the film adaptation of Cold Mountain (2003), which won Zellweger an Oscar for Best Supporting Actress, which was her first Academy Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMzYwMDI2OF5BMl5BanBnXkFtZTgwMzg3NjYwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000250","name":"Renée Zellweger","nicknames":["Zelly"],"idIMDB":"nm0000250"},"actorId":"nm0000250","character":"Vanessa Bloome","urlCharacter":"http://www.imdb.com/character/ch0036171","main":true},{"actorName":"Matthew Broderick","urlProfile":"http://www.imdb.com/name/nm0000111","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NjA0MzM0OF5BMl5BanBnXkFtZTcwMDU5ODAxMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 March 1962","placeOfBirth":" New York City, New York, USA","height":"5' 8\" (1.73 m)","bio":"A slight comic actor chiefly known for his boyish charm, Matthew Broderick was born on March 21, 1962 in New York City, to Patricia Broderick (née Biow), a playwright and painter, and James Broderick, an actor. His father had Irish and English ancestry, and his mother was from a Jewish family (from Germany and Poland). Matthew initially took up acting at New York's upper-crust Walden School after being sidelined from his athletic pursuits (football and soccer) by a knee injury. His father got him his stage debut at age 17 in a workshop production of the play \"On Valentine's Day\". Matthew's career then accelerated with parts in two Neil Simon projects: the play \"Brighton Beach Memoirs\" (1982-83) and the feature film Max Dugan Returns (1983). Broderick reprised the role of Eugene in \"Biloxi Blues\" (1988), the second installment of the Simon trilogy, for both the Broadway production and the film adaptation (Biloxi Blues (1988)). For the third and final installment of the trilogy, he was replaced by Jonathan Silverman. In 1983, the same year as Max Dugan Returns (1983), Broderick had his first big-screen success in the light comedy WarGames (1983). Since then he has had his fair share of hits and misses, with some of his better films including Project X (1987) also starring Helen Hunt, whom he subsequently dated; Addicted to Love (1997); and Inspector Gadget (1999). Other films he has appeared in which may be known but not so much respected include Out on a Limb (1992) with his Ferris Bueller's Day Off (1986) co-star Jeffrey Jones; The Night We Never Met (1993); The Road to Wellville (1994); and The Cable Guy (1996) with Jim Carrey, which got him an MTV \"Best Fight\" award nomination; and the MTV film Election (1999) with Reese Witherspoon. In 1985 he was involved in a controversial car crash while driving in Ireland with his then fiancée Jennifer Grey. The crash killed a woman and her daughter. Broderick paid a small fine to the family of the victims. He broke his leg in the accident, which happened just as Ferris Bueller's Day Off (1986), his biggest hit, was coming out in the US. The box office success (but critical flop) and special effects blockbuster Godzilla (1998) gave Broderick his first action role (should any \"Godzilla\" sequels be planned, he is under contract for two more). He has occasionally returned to the stage in New York, either in revivals of old musical warhorses such as \"How To Succeed In Business Without Really Trying\" or in revivals of old \"show people\"plays, such as \"Night Must Fall\". In 1996 Broderick attempted to wear three hats as co-producer/director/actor in Infinity (1996), working very closely with his mother, who also wrote the screenplay. It was not a critical or commercial success, and he has not directed or produced since. Since May 1997 he has been married to actress Sarah Jessica Parker. He was previously engaged to both Helen Hunt and dated Lili Taylor. In 1999 he donned a trenchcoat for the children's film Inspector Gadget (1999), alongside Rupert Everett as the evil villain Claw. In March 2001 Broderick returned to Broadway in the musical smash \"The Producers\" (based on the 1968 Mel Brooks film of the same name). He was nominated for the Tony Award for Best Actor in a Musical, which he lost to his co-star, Nathan Lane.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NjA0MzM0OF5BMl5BanBnXkFtZTcwMDU5ODAxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000111","name":"Matthew Broderick","idIMDB":"nm0000111"},"actorId":"nm0000111","character":"Adam Flayman","urlCharacter":"http://www.imdb.com/character/ch0033135","main":true},{"actorName":"Patrick Warburton","urlProfile":"http://www.imdb.com/name/nm0911320","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNzc5OTExN15BMl5BanBnXkFtZTcwOTU0MzYwNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 November 1964","placeOfBirth":" Paterson, New Jersey, USA","birthName":"Patrick John Warburton","height":"6' 2½\" (1.89 m)","bio":"Patrick Warburton is known to many for the role of \"Puddy\" in the hit NBC comedy \"Seinfeld,\" the laconic, enigmatic, quirky Saab salesman and Elaine's boyfriend. Warburton starred for 7 seasons on the hit CBS comedy \"Rules of Engagement\" with David Spade, Oliver Hudson, and Megyn Price about two couples and their single friend, all at different stages in their relationships dealing with the complications of dating, commitment, and marriage. He is now set to star in NBC's newest sitcom series entitled \"Crowded,\" premiering Sunday, March 20th, about an empty nest couple (Warburton & Carrie Preston) who find out their adult daughters want to move back home with them. Patrick also played \"Guy\" in the international blockbuster comedy Ted and recently completed shooting the highly anticipated sequel Ted 2 where he reprises his role. Warburton starred on the ABC hit comedy \"Less than Perfect,\" as \"Jeb Denton,\" an opinionated network anchorman; and on the hit show \"NewsRadio\" as \"Johnny Johnson\" the unscrupulous business rival who takes over the station. Warburton starred in Disney's major motion picture, live action comedy Underdog, as the archenemy \"Cad,\" based on the 1964 cartoon television series. He is also perhaps the busiest voiceover artist in Hollywood for his many characters including the role of the paraplegic and over-zealous cop, \"Joe Swanson,\" on the hit comedy \"Family Guy.\" Warburton was the lead in the independent film The Civilization of Maxwell Bright, in which he stared as a vicious and self-destructive anti-hero who desperately needs to save his soul. The film won numerous festival awards in which Warburton captured Best Actor at the Beverly Hills Film Festival, New York VisionFest, and the Boulder International Film Festival. The film's other honors include Viewer's Choice at the Beverly Hills Film Festival, the Special Jury Award at WorldFest Houston and at the Florida Film Festival, Grand Jury Prize at the Florida Film Festival, and the Vision Award for David Beaird at WorldFest Houston. This festival favorite is essentially a modern re-telling of \"Beauty and the Beast\" that explores what happens when a modern Neanderthal is locked in close proximity with a kind and loving woman. Written and directed by David Beaird, The Civilization of Maxwell Bright co-stars Jennifer Tilly, Marie Matiko, Simon Callow and Eric Roberts. In addition, Warburton starred in the independent feature film I'll Believe You alongside Fred Willard, Thomas Gibson, and Chris Elliott, a comedy for young adults/teens about a hunt for an alleged alien living in a small town after a mysterious phone call is received on a radio broadcast. The film was released in April of 2007 to 1,500 theaters nationwide, quite the accomplishment for a small independent film. To complement his animated films, Warburton voiced the hit cartoon series \"Scooby-Doo! Mystery Incorporated\" and the animated feature Bee Movie with Jerry Seinfeld, Renée Zellweger, Uma Thurman and Oprah Winfrey. He played the character \"Rip Smashenburn\" in the UPN animated series \"Game Over,\" the voice of \"Brock Samson\" in the animated adult series \"The Venture Brothers,\" and the voice of \"Mr. Barkin\" on the Disney Channel's \"Disney's Kim Possible.\" He plays the character of Ian, \"the ultimate alpha-male,\" in the Sony animated film Open Season opposite Ashton Kutcher and Martin Lawrence. Playing in both regular theaters and Imax 3-D, it was a box office smash on its opening week as #1 and held top spots following its debut. Warburton's voice can also be heard alongside that of Sarah Michelle Geller, Sigourney Weaver, George Carlin, Andy Dick, and Freddie Prinze Jr. in the animated feature film Happily N'ever After, from the producers of Shrek, where he plays the voice of \"Prince Humperdink.\" As the voice of the \"Savior of the Universe\" in Disney's animated Saturday morning TV series \"Buzz Lightyear,\" Warburton's voice graced the big screen in the Disney animated film The Emperor's New Groove, Kronks New Groove and \"The Emperor's New School.\" Warburton started his television career appearing regularly on the CBS sitcom \"Dave's World,\" with Harry Anderson and Mesach Taylor and originally guest-starred on \"Seinfeld\" as the painted-faced New Jersey Devils' fan and Jerry's mechanic, only to become one of the show's funniest fixtures. He also did commercial spots for American Express (as the voice of \"Superman\" alongside Seinfeld), Cadillac, and M&Ms. Warburton starred in The Woman Chaser, which received critical acclaim at the prestigious New York Film Festival and The Sundance Film Festival, as well as opposite Sam Neill in The Dish, an Australian production about the first man on the moon. Barry Sonnenfeld directed Warburton in the Columbia Tri Star half-hour comedy \"The Tick,\" which continues to have a huge cult following since its release on DVD. The show gained its popularity with audiences due to its relaxed, adult-friendly comedy. \"The Tick\", in addition to the DVD, has released action figures, t-shirts, and Quaker Oat Life cereal boxes with \"The Tick\" character adorning the cover. He also paired up with Tim Allen in Sonnenfeld's feature films Big Trouble and Joe Somebody, and also appeared in Scream 3 and Men in Black 2. A native Californian, Patrick grew up in Huntington Beach and resides in Los Angeles with his wife Cathy and four children Talon, Alexandra (Lexie), Shane, and Gabriel. When talking about his children, Patrick's face lights up as he describes them as the ultimate joy and love of his life. With what little spare time he has, Patrick gets in a game of golf or tennis, does activities with his children, and spends time in his cabin on the Rogue River in Oregon with his family. Warburton also hosts the annual charity golf tournament \"Golf for Kids,\" a Celebrity Tournament to benefit St. Jude Children's Hospital each year in Palm Springs, CA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNzc5OTExN15BMl5BanBnXkFtZTcwOTU0MzYwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0911320","name":"Patrick Warburton","idIMDB":"nm0911320"},"actorId":"nm0911320","character":"Ken","urlCharacter":"http://www.imdb.com/character/ch0036348","main":true},{"actorName":"John Goodman","urlProfile":"http://www.imdb.com/name/nm0000422","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MTIzODQ1M15BMl5BanBnXkFtZTcwNjI4Mzc1OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1952","placeOfBirth":" St. Louis, Missouri, USA","birthName":"John Stephen Goodman","height":"6' 2\" (1.88 m)","bio":"John Stephen Goodman is a U.S. film, television, and stage actor. He was born in St. Louis, Missouri, to Virginia Roos (Loosmore), a waitress and saleswoman, and Leslie Francis Goodman, a postal worker who died when John was a small child. He is of English, Welsh, and German ancestry. John is best known for his role as Dan Conner on the television series Roseanne (1988), which ran until 1997, and for which he won a Best Actor Golden Globe award in 1993. Goodman is also noted for appearances in the films of the Coen brothers, with prominent roles in Raising Arizona (1987), as an escaped convict, in Barton Fink (1991), as a congenial murderer, in The Big Lebowski (1998), as a volatile bowler, and in O Brother, Where Art Thou? (2000), as a cultured thief. Additionally, Goodman's voice work has appeared in numerous Disney films, including the voice for \"Sulley\" in Monsters, Inc. (2001). Having contributed to more than 50 films, Goodman has also won two American Comedy Awards and hosted Saturday Night Live (1975) fourteen times.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MTIzODQ1M15BMl5BanBnXkFtZTcwNjI4Mzc1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000422","name":"John Goodman","idIMDB":"nm0000422"},"actorId":"nm0000422","character":"Layton T. Montgomery","urlCharacter":"http://www.imdb.com/character/ch0033137","main":true},{"actorName":"Chris Rock","urlProfile":"http://www.imdb.com/name/nm0001674","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyNjM5MjgyNzdeQTJeQWpwZ15BbWU3MDAzMzUyODc@._V1.._UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 February 1965","placeOfBirth":" Andrews, South Carolina, USA","birthName":"Christopher Julius Rock III","height":"5' 10\" (1.78 m)","bio":"Christopher Julius Rock was born in Andrews, South Carolina and raised in Bedford-Stuyvesant, Brooklyn, New York. He is the son of Rosalie (Tingman), a teacher and social worker for the mentally handicapped, and Julius Rock, a truck driver and newspaper deliveryman, whose own father was a preacher. Rock has been in stand-up comedy for several decades. He made his big screen debut in Beverly Hills Cop II (1987) and spent three years on the cast of Saturday Night Live (1975). He does commercials for 1-800 Collect and Nike and covered the presidential campaign for the show Politically Incorrect (1993). He lives in Alpine, New Jersey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyNjM5MjgyNzdeQTJeQWpwZ15BbWU3MDAzMzUyODc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001674","name":"Chris Rock","nicknames":["Chrissy"],"idIMDB":"nm0001674"},"actorId":"nm0001674","character":"Mooseblood","urlCharacter":"http://www.imdb.com/character/ch0037654","main":true},{"actorName":"Kathy Bates","urlProfile":"http://www.imdb.com/name/nm0000870","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg1MTM3NjcyMF5BMl5BanBnXkFtZTcwMDI0NTk0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1948","placeOfBirth":" Memphis, Tennessee, USA","birthName":"Kathleen Doyle Bates","height":"5' 3\" (1.6 m)","bio":"Multi-talented Kathleen Doyle Bates was born on June 28, 1948, and raised in Memphis, Tennessee. She is the youngest of three girls born to Bertye Kathleen (Talbot), a homemaker, and Langdon Doyle Bates, a mechanical engineer. Her grandfather was author Finis L. Bates. Kathy has English, as well as Irish, Scottish, and German, ancestry, and one of her ancestors, an Irish emigrant to New Orleans, once served as President Andrew Jackson's doctor. Kathy discovered acting appearing in high school plays and studied drama at Southern Methodist University, graduating in 1969. With her mind firmly set, she moved to New York City in 1970 and paid her dues by working everything from a cash register to taking lunch orders. Things started moving quickly up the ladder after giving a tour-de-force performance alongside Christopher Walken at Buffalo's Studio Arena Theatre in Lanford Wilson's world premiere of \"Lemon Sky\" in 1970, but she also had a foreshadowing of the heartbreak to come after the successful show relocated to New York's off-Broadway Playhouse Theatre without her and Walken wound up winning a Drama Desk award. By the mid-to-late 1970s, Kathy was treading the boards frequently as a rising young actress of the New York and regional theater scene. She appeared in \"Casserole\" and \"A Quality of Mercy\" (both 1975) before earning exceptional reviews for her role of Joanne in \"Vanities\". She took her first Broadway curtain call in 1980's \"Goodbye Fidel,\" which lasted only six performances. She then went directly into replacement mode when she joined the cast of the already-established and highly successful \"Fifth of July\" in 1981. Kathy made a false start in films with Taking Off (1971), in which she was billed as \"Bobo Bates\". She didn't film again until Straight Time (1978), starring Dustin Hoffman, and that part was not substantial enough to cause a stir. Things turned hopeful, however, when Kathy and the rest of the female ensemble were given the chance to play their respective Broadway parts in the film version of Robert Altman's Come Back to the 5 & Dime, Jimmy Dean, Jimmy Dean (1982). It was a juicy role for Kathy and film audiences finally started noticing the now 34-year-old. Still and all, it was the New York stage that continued to earn Kathy awards and acclaim. She was pure textbook to any actor studying how to disappear into a role. Her characters ranged from free and life-affirming to downright pitiable. Despite winning a Tony Award nomination and Outer Critic's Circle Award for her stark, touchingly sad portrait of a suicidal daughter in 1983's \"'night, Mother\" and the Obie and Los Angeles Drama Critics Award for her powerhouse job as a romantic misfit in \"Frankie and Johnny in the Claire de Lune,\" Kathy had no box-office pull and was hardly a strong consideration when the roles finally went to film. Kathy Bates was forever losing out when her award-winning stage characters transferred to the screen. First Sissy Spacek took on her potent role as the suicidal Jessie Cates in 'night, Mother (1986), then Michelle Pfeiffer seized the moment to play her dumpy lover character in Frankie and Johnny (1991). It would take Oscar glory to finally rectify the injustice. It was her fanatical turn as the drab, chunky, porcine-looking psychopath Annie Wilkes, who kidnaps her favorite author (James Caan) and subjects him to a series of horrific tortures, that finally turned the tide for her in Hollywood. With the 1990 shocker Misery (1990), based on the popular Stephen King novel, Bates and Caan were pure box office magic. Moreover, Kathy captured the \"Best Actress\" Oscar and Golden Globe award, a first in that genre (horror) for that category. To add to her happiness she married Tony Campisi, also an actor, in 1991. Quality film scripts now started coming her way and the 1990s proved to be a rich and rewarding time for her. First, she and another older \"overnight\" film star, fellow Oscar winner Jessica Tandy, starred together in the modern portion of the beautifully nuanced, flashback period piece Fried Green Tomatoes (1991). She then outdid herself as the detached and depressed housekeeper accused of murdering her abusive husband (David Strathairn) in Dolores Claiborne (1995). Surprisingly, she was left out of the Oscar race for these two excellent performances. Not so, however, for her flashy political advisor Libby Holden in the movie Primary Colors (1998) and her quirky, liberal mom in About Schmidt (2002), receiving \"Best Supporting Actress\" nominations for both. She also turned in a somewhat brief but potent turn as Gertrude Stein in Woody Allen's Midnight in Paris (2011). Kathy has continued to work prolifically on TV as a multiple Emmy winner and nominee. She has also taken to directing a couple of TV-movies on the sly. She was nominated for a DGA award after helming an episode of \"Six Feet Under,\" in which she also had a recurring role. While some of her more recent movie parts have been unworthy of her talents, she has more than made up for it on TV playing everything from cruel-minded caricatures (Little Orphan Annie's Miss Hannigan) to common, decent every day folk in mini-movies. More recently she has done some eye-catching, offbeat turns on regular series such as The Office (2005), Harry's Law (2011) and especially American Horror Story (2011) for which she won an Emmy as Ethel Darling. Divorced from her husband since 1997, Kathy has been the Executive Committee Chair of the Actors Branch of the Academy of Motion Picture Arts and Sciences Board of Governors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg1MTM3NjcyMF5BMl5BanBnXkFtZTcwMDI0NTk0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000870","name":"Kathy Bates","nicknames":["Bobo"],"idIMDB":"nm0000870"},"actorId":"nm0000870","character":"Janet Benson","urlCharacter":"http://www.imdb.com/character/ch0037655","main":true},{"actorName":"Barry Levinson","urlProfile":"http://www.imdb.com/name/nm0001469","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MjY5MjYzN15BMl5BanBnXkFtZTcwOTc1MTc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 April 1942","placeOfBirth":" Baltimore, Maryland, USA","height":"5' 11\" (1.8 m)","bio":"Barry Levinson was born in Baltimore, Maryland, to Violet (Krichinsky) and Irvin Levinson, who worked in furniture and appliance. He is of Russian Jewish descent. Levinson graduated from high school in 1960, attended college at American University in Washington, DC. He did well, but decided he wanted to go to Los Angeles. In LA, Levinson worked for the Oxford Company, studying acting, improvisation, and production; worked in comedy clubs, where he learned how to write; and began dating Valerie Curtin. In 1967, won a job writing for a local TV comedy show. He eventually performed his material on the show, winning a local Emmy. In the 70s, Levinson wrote for The Carol Burnett Show (1967) -- and won two Emmys in three years. Mel Brooks hired him for Silent Movie (1976), then, High Anxiety (1977). Levinson and Curtin married in 1975. They co-wrote: _...And Justice for All (1979)_, and other scripts. While Curtin performed in San Francisco, he wrote Diner (1982). MGM bought it and, with a budget of under $5 million, Levinson directed. Curtin and Levinson divorced in 1982. Levinson met Dianna Rhodes while he was filming Diner (1982). She lived in Baltimore, with her two children Patrick and Michelle Levinson. Levinson and Rhodes later married and had two more children, Sam Levinson and Jack Levinson. Proving himself as a director with The Natural (1984), he tackled his most ambitious project to that time in Rain Man (1988). Levinson went on to place his stamp on films like Good Morning, Vietnam (1987), and Bugsy (1991). After his many successes, Toys (1992) did poorly. Levinson had a hit with Disclosure (1994) in 1994, the same year the Levinsons moved to Marin County in Northern California to get away from the Hollywood scene.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MjY5MjYzN15BMl5BanBnXkFtZTcwOTc1MTc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001469","name":"Barry Levinson","idIMDB":"nm0001469"},"actorId":"nm0001469","character":"Martin Benson","urlCharacter":"http://www.imdb.com/character/ch0037657","main":true},{"actorName":"Larry King","urlProfile":"http://www.imdb.com/name/nm0005092","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0NjY4MTYyOF5BMl5BanBnXkFtZTYwOTc3NDg1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1933","placeOfBirth":" Brooklyn, New York, USA","birthName":"Lawrence Harvey Zeiger","height":"5' 9\" (1.75 m)","bio":"Larry King was born on November 19, 1933 in Brooklyn, New York, USA as Lawrence Harvey Zeiger. He is an actor, known for Larry King Now (2012), Larry King Live (1985) and PoliticKING with Larry King (2012). He has been married to Shawn Southwick since September 5, 1997. They have two children. He was previously married to Julie Alexander, Sharon Lepore, Alene Akins, Mickey Sutphin, Annette Kaye and Freda Miller.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0NjY4MTYyOF5BMl5BanBnXkFtZTYwOTc3NDg1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005092","name":"Larry King","idIMDB":"nm0005092"},"actorId":"nm0005092","character":"Bee Larry King","urlCharacter":"http://www.imdb.com/character/ch0153997","main":true},{"actorName":"Ray Liotta","urlProfile":"http://www.imdb.com/name/nm0000501","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NzM5MjUwMF5BMl5BanBnXkFtZTYwNDM2NDky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1954","placeOfBirth":" Newark, New Jersey, USA","height":"6' (1.83 m)","bio":"Intense is the word for Ray Liotta. He specializes in psychopathic characters who hide behind a cultivated charm. Even in his nice guy roles in Field of Dreams (1989) and Operation Dumbo Drop (1995), you get the impression that something is smoldering inside of him. Liotta maintains a steady stream of work, completing multiple projects per year. Liotta was born in Newark, New Jersey, and was adopted by Mary (Edgar), a township clerk, and Alfred Liotta, an auto parts store owner. He studied acting at the University of Miami, where he became friends with Steven Bauer (Scarface (1983), Thief of Hearts (1984)). He spent his first years acting in TV: Another World (1964), a TV movie and several short-lived series. He broke into movies with the black comedy Something Wild (1986), which garnered him rave reviews. Originally unable to get a reading, he was recommended for the part by Melanie Griffith (then married to Bauer). After the success of \"Something Wild\" he received more offers in the \"psycho\" vein, but refused them to avoid being typecast. Instead, he made \"little movies\" like Dominick and Eugene (1988) (which earned him standing as an actor's actor) and Field of Dreams (1989) (whose success still surprises him). When he heard that Martin Scorsese was casting Goodfellas (1990), he lobbied hard for the part of Henry Hill. The film's huge success brought him wide popularity and enabled him to get star billing in future films (Article 99 (1992), Obsession fatale (1992), Unforgettable (1996)).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NzM5MjUwMF5BMl5BanBnXkFtZTYwNDM2NDky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000501","name":"Ray Liotta","idIMDB":"nm0000501"},"actorId":"nm0000501","character":"Ray Liotta","urlCharacter":"http://www.imdb.com/character/ch0037659","main":true},{"actorName":"Sting","urlProfile":"http://www.imdb.com/name/nm0001776","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTI2NDcyNTk4OV5BMl5BanBnXkFtZTcwOTYyNjQ4NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 October 1951","placeOfBirth":" Wallsend, Newcastle upon Tyne, England, UK","birthName":"Gordon Matthew Thomas Sumner","height":"6' (1.83 m)","bio":"Sting was born Gordon Matthew Sumner on 2 October, 1951 in Wallsend, North Tyneside, Tyne and Wear, England, the eldest of four children of Audrey (Cowell), a hairdresser, and Ernest Matthew Sumner, an engineer and milkman. He received his name from a striped sweater he wore which looked like a bee. He grew up in the turmoil of the ship-building industry and wanted to become a musician very early. He played cruise ships, backing strippers in cabarets, and developed a love for the bass guitar. Having played in jazz/rock bands like \"Last Exit\" and other various groups, including a dixieland jazz group, he settled down with Stewart Copeland and Andy Summers for a decade-long tenure with the smashing rock trio, The Police. In 1984, he went on to record solo albums, and holds a reputation as one of the most literate songwriters and talented musicians in the world. He has also delved into acting, having starred in such films as Quadrophenia (1979), Radio On (1979), Plenty (1985), Julia and Julia (1987) (aka Julia and Julia), Dune (1984), Bring on the Night (1985) (a documentary about the formation of his Blue Turtles jazz group), most recently, Gentlemen Don't Eat Poets (1995), where he plays a bisexual, conniving butler. He received an honorary Doctorate of Music degree from Northumbria University in October 1992, and from Berklee College of Music in May 1994. He plays guitar, bass guitar, mandolin, piano, harmonica, saxophone and pan-flute, and he gave a name to his bass (Brian). Sting is married to film producer Trudie Styler, and has six children with Trudie and ex-wife, actress Frances Tomelty. Sting owns a Jacobian castle in Wiltshire, which he calls \"Lake House\", where he records his albums, as well as a place in London, an apartment in New York, a place on the beach in Malibu, California, and a Renaissance Florentine Villa called \"Palagio\" in Figline Valdarno, Tuscany, Italy. Along with his wife Trudie and a Brazilian Indian, he started the Rainforest Foundation in 1989 to help save rainforests.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTI2NDcyNTk4OV5BMl5BanBnXkFtZTcwOTYyNjQ4NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001776","name":"Sting","idIMDB":"nm0001776"},"actorId":"nm0001776","character":"Sting","urlCharacter":"http://www.imdb.com/character/ch0037660","main":true},{"actorName":"Oprah Winfrey","urlProfile":"http://www.imdb.com/name/nm0001856","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzODE3MzYxNF5BMl5BanBnXkFtZTYwMzEyNjc4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 1954","placeOfBirth":" Kosciusko, Mississippi, USA","birthName":"Orpah Gail Winfrey","height":"5' 6½\" (1.69 m)","bio":"Oprah Winfrey was born Orpah Gail Winfrey in Kosciusko, Mississippi, to Vernita Lee, a former maid, and Vernon Winfrey, a coal miner, barber, and city councilman. While Winfrey has been cited as the richest African American of the 20th century, she does not come from a rich, or even middle class, family. She was born in an economically troubled neighborhood and raised by a single-teenaged mother in the city of Milwaukee. Orpah, named after a biblical character, had a name no one could pronounce, so her family and friends starting calling her Oprah. Shortly after Oprah's birth, Vernita Lee left her daughter and traveled north. Oprah was then raised by her grandmother,Hatti Mae Lee. Oprah while being raised by her grandmother lived in terrible conditions. Oprah's only friends were farm animals,however even at that age Oprah had a very imaginative mind. Oprah would frequently give the animals dramatic parts and included them in games. This was perhaps where she had gotten the craze for acting, and would soon be seen in legendary masterpieces such as The Color Purple (1985). Oprah because of her grandmother's values, had religion and God instilled in herself at a very young age. Oprah because of her grandmother knew how to read,and write before the age of three. Oprah during church would recite poems,and verses from the bible. Soon the church, and the entire neighborhood knew she had a gift and was nicknamed,\"The Little Speaker\". This would soon prompt her to become a woman with a strong perspective, which millions across the world would want to have insight on. This prepared her for The Oprah Winfrey Show (1986). Due to her ability to read and write before the age of three, when enrolled in school she was often promoted several grades ahead of her age. Oprah at the age of six went to live with her mother, Vernita Lee. Vernita worked as a maid, so Oprah was often left alone at home with her cousins. Oprah due to her busy mother was paid little attention to at home, this is what prompted Oprah to started misbehaving and talking back to her mother. Vernita Lee then decided it was best Oprah live with her father in Nashville Tennessee. Oprah while living in Tennessee, found out her mother was pregnant and her mother requested for her to come back to Milwaukee to live with her mother and half-sister. When Oprah was nine she was raped by her nineteen year old cousin who was baby sitting her. This wouldn't be the only time she was sexually abused she would then be sexually abused by her cousin, a family friend,her mother's boyfriend, and her uncle during her stay in Milwaukee. Toward all these incidents, she never told a soul because the predators swore her to silence. At the age of thirteen Oprah ran away from home, this was due to her years of abuse and at the age of fourteen she became pregnant with an ill son who died shortly after birth. Oprah took the death of her son as she was given a second chance in life. Oprah's mother sent her to live once again with her father in Nashville,Tennessee. Oprah's father was very strict and made education the number-one priority for Oprah. Oprah attended Nashville East High School. Oprah during high-school wasn't precisely certain toward what she wanted to do, however she knew it was something with speaking or drama. Oprah was also elected school president and met with president Richard Nixon being apart of public speaking classes in her high-school. Oprah during the last year of high-school was rehearsing with her drama class when a local radio station, WVOL spotted her and asked her if she would like to read on radio. Oprah was then given a job reading the news on the radio. Oprah soon entered into a public speaking contest where the grand prize was a scholarship to Tennessee State University. Oprah won the contest and received a scholarship to Tennessee State University where she majored in Speech Communications and Performing Arts. Oprah during her college education was offered a job as a co-anchor on the CBS television station, she declined several times before she was convinced by her speech professor that it may be the ultimate step to launch her career. Oprah wanted to find work outside of Nashville Tennessee and was soon offered a job in Baltimore,Maryland. The job offer came up a few months before her graduation, she had to choose between the job and graduating, so she decided to choose the job in Maryland as the offer was very tempting. At the job in Maryland she wasn't a very good reporter and was shortly fired. Oprah's boss set her up as a talk show host on a morning talk show called, People Are Talking (1978). Immediately after the first show Oprah knew this is what she wanted to do for the rest of her life. Oprah strengthened the talk show for seven years and then she decided it was time to move on. In 1981 Oprah sent recorded tapes of the show to a talk-show in Chicago called A.M. Chicago. They immediately offered her the job and in September of 1985 she changed the name of the show to, \"The Oprah Winfrey Show\". The first broadcast of The Oprah Winfrey Show was on September 8,1986 it broadcast nationally. The Oprah Winfrey show first targeted woman, however soon due to controversial topics and intriguing topics Oprah brought on to the show it appealed to people of all genders,ethnics,and ages. Oprah promoted many things on her show such as books, movie releases all of which people were eager to know what her opinions were of them. Oprah helped broaden not just woman's point of view and significance but Oprah helped to realize that every human has an importance in this world. From it's first broadcast The Oprah Winfrey show went on to receive multiple Day Time Emmy Awards and several other prestigious awards.Winfrey expanded the Oprah Winfrey show and started releasing a monthly magazine which was called, O:The Oprah Magazine. The first issue was in 2000. The series finale of the Oprah Winfrey Show as on it's twenty-fifth season and it aired on May,25,2011. Concluding a segment of her career toward which she used as a device to inspire millions and help thousands to lead a better life. Oprah's made her debut as a film actress in the 1985 period drama film, The Color Purple. Oprah played a troubled housewife named Sofia. Oprah was nominated for an Academy Award for Best Supporting Actress. This movie went on to become a Broadway musical adaptation. In 1998 Oprah starred in the movie, Beloved which she also produced. Winfrey played the character Sethe who was a former slave. Winfrey has also acted in several movies such as Charlotte's Web (2006), Bee Movie (2007), and The Princess and the Frog (2009). Oprah Winfrey in 1998 received an Achievement Award from the National Academy of Television Arts and Sciences. In 2011 Oprah Winfrey received a Jean Hersholt Humanitarian Award from the Academy Of Motion Pictures Arts And Sciences. Oprah Winfrey will forever be remembered as an innovator through the landmarks she made, becoming the first female African American to host a television show. Inspiring millions of people across the world, discussing significant issues on her show such as equal rights toward genders,racism,poverty, and many others. Oprah will be seen as an icon someone who paved the way for others to become successful.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzODE3MzYxNF5BMl5BanBnXkFtZTYwMzEyNjc4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001856","name":"Oprah Winfrey","nicknames":["O","Deepak Oprah","Lady O"],"idIMDB":"nm0001856"},"actorId":"nm0001856","character":"Judge Bumbleton","urlCharacter":"http://www.imdb.com/character/ch0037661","main":true},{"actorName":"Larry Miller","urlProfile":"http://www.imdb.com/name/nm0588777","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NzQxOTMwOF5BMl5BanBnXkFtZTcwNDc3NDIzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 October 1953","placeOfBirth":" Valley Stream, Long Island, New York, USA","height":"5' 11\" (1.8 m)","bio":"Larry Miller was born on October 15, 1953 in Valley Stream, Long Island, New York, USA. He is an actor and writer, known for Kiss Kiss Bang Bang (2005), 10 Things I Hate About You (1999) and The Nutty Professor (1996). He has been married to Eileen Conn since March 1993. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NzQxOTMwOF5BMl5BanBnXkFtZTcwNDc3NDIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0588777","name":"Larry Miller","idIMDB":"nm0588777"},"actorId":"nm0588777","character":"Buzzwell","urlCharacter":"http://www.imdb.com/character/ch0037662","main":true},{"actorName":"Megan Mullally","urlProfile":"http://www.imdb.com/name/nm0005259","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4ODA3NjUyMF5BMl5BanBnXkFtZTcwNzUyMjk0Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 November 1958","placeOfBirth":" Los Angeles, California, USA","height":"5' 4\" (1.63 m)","bio":"Megan is an only child born in Los Angeles, California. Her mother, Martha, was a model, and her father, Carter Mullally Jr., was a contract player for Paramount. Megan first entered Northwestern University intending to study acting, but switched to English literature. However, she still ended up starring in several campus musicals, which gained attention from producers and prompted her to drop out of school. In 1985, she moved to Los Angeles with no particular success. But, in 1994, she co-starred in \"Grease\" with Rosie O'Donnell and, in 1995, in \"How To Succeed In Business\" with Matthew Broderick. Her star has been rising ever since.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4ODA3NjUyMF5BMl5BanBnXkFtZTcwNzUyMjk0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005259","name":"Megan Mullally","idIMDB":"nm0005259"},"actorId":"nm0005259","character":"Trudy","urlCharacter":"http://www.imdb.com/character/ch0037664","main":true},{"actorName":"Rip Torn","urlProfile":"http://www.imdb.com/name/nm0001800","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMTI5MTA5MV5BMl5BanBnXkFtZTYwMDE2Mjk2._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 February 1931","placeOfBirth":" Temple, Texas, USA","birthName":"Elmore Rual Torn Jr.","height":"5' 10\" (1.78 m)","bio":"Rip Torn was born Elmore Rual Torn, Jr. on February 6, 1931 in Temple, Texas. \"Rip\" is a family name, taken by generations of Torn men and bestowed on Elmore by his father, who was also called \"Rip\". Torn attended Texas A & M and the University of Texas, where he majored in animal husbandry. Extremely naïf when he was young, Torn hitchhiked to Hollywood with the idea of becoming a movie star; he wanted to make enough money in order to buy a ranch. Success did not come overnight, as he had hoped, and Torn had to work many odd jobs while occasionally being cast in television roles. He made his feature film debut in Elia Kazan's Baby Doll (1956) in a small part. Serious about learning his craft, he moved to New York City where he studied under Lee Strasberg at the Actors Studio. Torn also studied dance with Martha Graham. His serious acting career began on the small screen, where he made a name for himself in the Golden Age of Television; between 1957 and 1960, he appeared regularly on such prestigious live shows as Omnibus (1952) and Playhouse 90 (1956). Torn made his Broadway debut in Kazan's staging of Tennessee Williams' \"Sweet Bird of Youth\" on March 10, 1959, in support of Paul Newman, Sidney Blackmer and Geraldine Page, who would become his second wife. The play was a hit, closing on January 30, 1960 after 375 performances. He won a 1960 Tony Award nomination as Best Featured Actor in a Play and a Theater World award for his role as \"Tom, Jr.\", a role he recreated in the 1962 film. (Torn also starred as \"Boss Finley\" in a later television adaptation of the play). Torn earned a reputation as an actor's actor on stage, both Broadway and off-Broadway, as well as on screen. He continues to work in the New York theater despite his demanding TV and movie schedule as both an actor and director. He has won two Obie awards for his work off-Broadway, for Distinguished Performance in Norman Mailer's \"The Deer Park\" (for the 1966-1967 season), and for Distinguished Direction for \"The Beard\" (1967-1968). He has his own stage company, and directed his daughter Angelica Page(by Geraldine Page) in John Paul Alexander's \"Strangers in the Land of Canaan\" at the Actors Studio. Torn made his feature film directorial debut with The Telephone (1988). He has constantly been in demand as a character actor, in supporting, second lead and occasional lead roles. His best performance on film came in Payday (1973), and he was nominated for a best supporting actor Oscar for Cross Creek (1983). Most of Torn's roles have been in drama, though he is adept in comedy. His role in Albert Brooks' comedy Defending Your Life (1991) led to his being cast in The Larry Sanders Show (1992), on which he played talk show producer \"Artie\". Torn won six consecutive Emmy nominations for the role, winning once for Best Supporting Actor in a comedy series in 1996. Rip Torn was married to actress Ann Wedgeworth from 1956 to 1961, whom he divorced to marry Geraldine Page. They remained married until her death in 1987. Torn helped his cousin, Oscar-winner Sissy Spacek, to make her way as an actress, seeing to it that she was accepted by the Lee Strasberg's Actors Studio and then the Lee Strasberg Institute.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMTI5MTA5MV5BMl5BanBnXkFtZTYwMDE2Mjk2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001800","name":"Rip Torn","idIMDB":"nm0001800"},"actorId":"nm0001800","character":"Lou Lo Duca","urlCharacter":"http://www.imdb.com/character/ch0037665","main":true}],"seasons":[],"idIMDB":"tt0389790","urlIMDB":"http://www.imdb.com/title/tt0389790","business":{"budget":{"money":"$150,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$38,021,044","country":"USA","day":"04","month":"11","year":"2007","remarks":"3,928 Screens"},{"money":"£2,281,393","country":"UK","day":"16","month":"12","year":"2007","remarks":"435 Screens"},{"money":"$12,730","country":"Estonia","day":"16","month":"12","year":"2007","remarks":"2 Screens"},{"money":"RUR 73,015,099","country":"Russia","day":"04","month":"11","year":"2007","remarks":"482 Screens"}],"gross":[{"money":"$126,597,121","country":"USA","day":"10","month":"02","year":"2008","remarks":""},{"money":"$126,424,663","country":"USA","day":"03","month":"02","year":"2008","remarks":""},{"money":"$126,233,269","country":"USA","day":"27","month":"01","year":"2008","remarks":""},{"money":"$125,993,358","country":"USA","day":"20","month":"01","year":"2008","remarks":""},{"money":"$125,595,476","country":"USA","day":"13","month":"01","year":"2008","remarks":""},{"money":"$125,196,072","country":"USA","day":"06","month":"01","year":"2008","remarks":""},{"money":"$124,518,342","country":"USA","day":"30","month":"12","year":"2007","remarks":""},{"money":"$123,219,578","country":"USA","day":"23","month":"12","year":"2007","remarks":""},{"money":"$122,355,577","country":"USA","day":"16","month":"12","year":"2007","remarks":""},{"money":"$121,021,546","country":"USA","day":"09","month":"12","year":"2007","remarks":""},{"money":"$117,616,494","country":"USA","day":"02","month":"12","year":"2007","remarks":""},{"money":"$111,860,810","country":"USA","day":"24","month":"11","year":"2007","remarks":""},{"money":"$93,570,695","country":"USA","day":"18","month":"11","year":"2007","remarks":""},{"money":"$38,021,044","country":"USA","day":"04","month":"11","year":"2007","remarks":""},{"money":"£9,034,528","country":"UK","day":"03","month":"02","year":"2008","remarks":""},{"money":"£8,877,179","country":"UK","day":"27","month":"01","year":"2008","remarks":""},{"money":"£8,622,143","country":"UK","day":"20","month":"01","year":"2008","remarks":""},{"money":"£8,239,142","country":"UK","day":"13","month":"01","year":"2008","remarks":""},{"money":"£7,615,281","country":"UK","day":"06","month":"01","year":"2008","remarks":""},{"money":"£5,688,550","country":"UK","day":"30","month":"12","year":"2007","remarks":""},{"money":"£3,970,814","country":"UK","day":"23","month":"12","year":"2007","remarks":""},{"money":"£2,281,393","country":"UK","day":"16","month":"12","year":"2007","remarks":""},{"money":"RUR 190,547,275","country":"Russia","day":"02","month":"12","year":"2007","remarks":""},{"money":"RUR 187,890,181","country":"Russia","day":"25","month":"11","year":"2007","remarks":""},{"money":"RUR 184,073,958","country":"Russia","day":"18","month":"11","year":"2007","remarks":""},{"money":"RUR 166,285,805","country":"Russia","day":"11","month":"11","year":"2007","remarks":""},{"money":"RUR 73,015,099","country":"Russia","day":"04","month":"11","year":"2007","remarks":""}],"weekendGross":[{"money":"$139,690","country":"USA","day":"10","month":"02","year":"2008","remarks":"206 Screens"},{"money":"$150,457","country":"USA","day":"03","month":"02","year":"2008","remarks":"246 Screens"},{"money":"$200,101","country":"USA","day":"27","month":"01","year":"2008","remarks":"265 Screens"},{"money":"$331,262","country":"USA","day":"20","month":"01","year":"2008","remarks":"296 Screens"},{"money":"$300,799","country":"USA","day":"13","month":"01","year":"2008","remarks":"338 Screens"},{"money":"$443,220","country":"USA","day":"06","month":"01","year":"2008","remarks":"407 Screens"},{"money":"$941,772","country":"USA","day":"30","month":"12","year":"2007","remarks":"475 Screens"},{"money":"$567,949","country":"USA","day":"23","month":"12","year":"2007","remarks":"539 Screens"},{"money":"$760,196","country":"USA","day":"16","month":"12","year":"2007","remarks":"1,609 Screens"},{"money":"$2,606,153","country":"USA","day":"09","month":"12","year":"2007","remarks":"2,707 Screens"},{"money":"$4,444,798","country":"USA","day":"02","month":"12","year":"2007","remarks":"3,150 Screens"},{"money":"$11,813,502","country":"USA","day":"24","month":"11","year":"2007","remarks":"3,507 Screens"},{"money":"$14,008,444","country":"USA","day":"18","month":"11","year":"2007","remarks":"3,984 Screens"},{"money":"$38,021,044","country":"USA","day":"04","month":"11","year":"2007","remarks":"3,928 Screens"},{"money":"£136,842","country":"UK","day":"03","month":"02","year":"2008","remarks":"308 Screens"},{"money":"£228,288","country":"UK","day":"27","month":"01","year":"2008","remarks":"376 Screens"},{"money":"£322,275","country":"UK","day":"20","month":"01","year":"2008","remarks":"416 Screens"},{"money":"£446,738","country":"UK","day":"13","month":"01","year":"2008","remarks":"451 Screens"},{"money":"£856,922","country":"UK","day":"06","month":"01","year":"2008","remarks":"471 Screens"},{"money":"£1,080,701","country":"UK","day":"30","month":"12","year":"2007","remarks":"470 Screens"},{"money":"£958,896","country":"UK","day":"23","month":"12","year":"2007","remarks":"459 Screens"},{"money":"£2,281,393","country":"UK","day":"16","month":"12","year":"2007","remarks":"435 Screens"}],"admissions":[{"money":"287,861","country":"Germany","day":"16","month":"12","year":"2007","remarks":""},{"money":"456,744","country":"Netherlands","day":"31","month":"12","year":"2008","remarks":""},{"money":"278,771","country":"Netherlands","day":"31","month":"12","year":"2007","remarks":""},{"money":"295,373","country":"Norway","day":"17","month":"06","year":"2008","remarks":""},{"money":"286,710","country":"Norway","day":"22","month":"03","year":"2008","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"04","month":"10","year":"2005","remarks":null},null],"copyrightHolder":"DreamWorks Animation LLC"},"technical":{"runtime":["1 hr 31 min (91 min)"],"soundMix":["SDDS","Dolby Digital","DTS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Technicolor, Hollywood (CA), USA (prints)"],"filmLength":["2,477 m (Sweden)","2,503 m (Portugal, 35 mm)"],"negativeFormat":["Digital"],"cinematographicProcess":["Digital (source format)","Digital Intermediate (2K) (master format)","Spherical (source format)"],"printedFilmFormat":["35 mm (spherical) (Kodak Vision 2383)","D-Cinema"]},"rating":"6.1","metascore":"54","filmingLocations":[],"rated":"PG","awards":[{"award":"Golden Globes, USA 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Animated Film","names":[]}]}]},{"award":"Annie Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Annie","categories":[{"category":"Best Animated Feature","names":[]},{"category":"Best Animation Production Artist","names":[{"name":"Michael Isaak","id":"nm2324319","role":null}]},{"category":"Best Music in an Animated Feature Production","names":[{"name":"Rupert Gregson-Williams","id":"nm0340003","role":null}]},{"category":"Best Storyboarding in an Animated Feature Production","names":[{"name":"Athanassios Vakalis","id":"nm0883368","role":null}]},{"category":"Best Voice Acting in an Animated Feature Production","names":[{"name":"Patrick Warburton","id":"nm0911320","role":null}]}]}]},{"award":"Broadcast Film Critics Association Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Critics Choice Award","categories":[{"category":"Best Animated Feature","names":[]}]}]},{"award":"Houston Film Critics Society Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated HFCS Award","categories":[{"category":"Best Animated Film","names":[]}]}]},{"award":"International Film Music Critics Award (IFMCA) 2007","titlesAwards":[{"titleAwardOutcome":"Nominated IFMCA Award","categories":[{"category":"Best Original Score for an Animated Feature Film","names":[{"name":"Rupert Gregson-Williams","id":"nm0340003","role":null}]}]}]},{"award":"Kids' Choice Awards, USA 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Blimp Award","categories":[{"category":"Favorite Animated Movie","names":[]},{"category":"Favorite Voice from an Animated Movie","names":[{"name":"Jerry Seinfeld","id":"nm0000632","role":null}]}]}]},{"award":"Motion Picture Sound Editors, USA 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing - SFX, Foley, Dialogue &amp; ADR for Feature Film Animation","names":[{"name":"Michael Silvers","id":"nm0799011","role":"supervising sound editor"},{"name":"Will Files","id":"nm0276877","role":"supervising sound editor"},{"name":"Luke Dunn Gielmuda","id":"nm0317355","role":"supervising foley editor"},{"name":"J.J. George","id":"nm0313454","role":"supervising music editor"},{"name":"Scott Guitteau","id":"nm0347593","role":"sound editor"},{"name":"Kyrsten Mate","id":"nm0131144","role":"sound editor"},{"name":"Robert Shoup","id":"nm0795254","role":"sound editor"},{"name":"Shannon Mills","id":"nm0590185","role":"sound editor"},{"name":"Steve Slanec","id":"nm0805271","role":"adr editor"},{"name":"Kevin Crehan","id":"nm0187292","role":"music editor"}]}]}]},{"award":"Oklahoma Film Critics Circle Awards 2007","titlesAwards":[{"titleAwardOutcome":"Won OFCC Award","categories":[{"category":"Not-So-Obviously Worst Film","names":[]}]}]},{"award":"PGA Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated PGA Award","categories":[{"category":"Outstanding Producer of Animated Theatrical Motion Pictures","names":[{"name":"Jerry Seinfeld","id":"nm0000632","role":null},{"name":"Christina Steinberg","id":"nm0825730","role":null}]}]}]},{"award":"Satellite Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Satellite Award","categories":[{"category":"Best Youth DVD","names":[]}]}]},{"award":"Young Artist Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Family Feature Film (Animation)","names":[]}]}]}],"votes":"111,768","type":"Movie","companyCreditsSimple":[{"idCompany":"co0129164","name":"DreamWorks Animation"},{"idCompany":"co0224033","name":"Columbus 81 Productions"},{"idCompany":"co0069464","name":"Pacific Data Images (PDI)"}],"keywords":{"keywords":["meme","scatological humor","egg","dream sequence","bee","b movie","anti corporation","cgi animation","squashed bug","angry man","anthropomorphic insect","movie in title","insect in title","animal in title","surrealism","closing credits sequence","rose parade","joke","wish","unlikely hero","trust","tree","transformation","teamwork","sunset","sunrise","selfishness","secret life","second chance","regret","obsession","missing child","lying","leaf","lawsuit","insect","individualism","friendship","food","fly","flying","fantasy sequence","exploitation","escape","escape attempt","employer employee relationship","destiny","courage","computer animation","satire","redemption","multiple cameos","merchant","animate tree","alienation","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:38:05"}}