{"data":{"movies":[{"title":"Eros","originalTitle":"","year":"2004","releaseDate":"20050706","directors":[{"name":"Michelangelo Antonioni","id":"nm0000774"},{"name":"Steven Soderbergh","id":"nm0001752"}],"writers":[{"name":"Kar-Wai Wong","id":"nm0939182"},{"name":"Steven Soderbergh","id":"nm0001752"}],"runtime":"104 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MjQ2NTAzOV5BMl5BanBnXkFtZTcwMTg5NzgyMQ@@._V1.jpg","countries":["USA","Italy","Hong Kong","France","Luxembourg","UK"],"languages":["English","Italian","Mandarin"],"genres":["Drama","Romance"],"plot":"A three-part anthology film about love and sexuality: a menage-a-trois between a couple and a young woman on the coast of Tuscany; an advertising executive under enormous pressure at work, who, during visits to his psychiatrist, is pulled to delve into the possible reasons why his stress seems to manifest itself in a recurring erotic dream; and a story of unrequited love about a beautiful, 1960s high-end call girl in an impossible affair with her young tailor.","simplePlot":"Three short films -- one each from directors Michelangelo Antonioni, Steven Soderbergh and Wong Kar Wai -- address the themes of love and sex.","actors":[{"actorName":"Li Gong","urlProfile":"http://www.imdb.com/name/nm0000084","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MzMwMjc5NF5BMl5BanBnXkFtZTYwMDMyNzQz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1965","placeOfBirth":" Shenyang, Liaoning Province, China","height":"5' 7\" (1.7 m)","bio":"Born in Shenyang, grew up in Jinan, the daughter of an economics professor. Loved music from childhood, and dreamed of a singing career. After failing to gain entrance to China's top music school in 1985, applied for and was admitted to the Central Drama Academy in Beijing, from which she graduated in 1989. While still a student, was cast as the female lead in Le sorgho rouge (1987)(aka \"Red Sorghum\"), the initial directing effort by Yimou Zhang. China's best-known actress in the West, she was named Best Actress at the 49th Venice International Film Festival for her role in The Story of Qiu Ju (1992) (aka \"The Story of Qiu Ju\"). Made a series of successful films with Yimou Zhang, a collaboration that apparently ended with the breakup of their personal relationship in 1995 and Gong's subsequent marriage to a tobacco company executive.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MzMwMjc5NF5BMl5BanBnXkFtZTYwMDMyNzQz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000084","name":"Li Gong","idIMDB":"nm0000084"},"actorId":"nm0000084","character":"Miss Hua","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chen Chang","urlProfile":"http://www.imdb.com/name/nm0151654","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNDI0MDYzM15BMl5BanBnXkFtZTcwMTU0MTQwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 October 1976","placeOfBirth":" Taipei, Taiwan","height":"5' 10\" (1.78 m)","bio":"Chen Chang was born on October 14, 1976 in Taipei, Taiwan. He is an actor, known for Crouching Tiger, Hidden Dragon (2000), Red Cliff (2008) and The Assassin (2015). He has been married to Wen-ju Chuang since November 18, 2013.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNDI0MDYzM15BMl5BanBnXkFtZTcwMTU0MTQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0151654","name":"Chen Chang","idIMDB":"nm0151654"},"actorId":"nm0151654","character":"Zhang","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Feng Tien","urlProfile":"http://www.imdb.com/name/nm0284608","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTZhZGY1MWItMDUxZC00NjVhLTk4ZTQtYmYyZThiNWYxMGRjL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1928","placeOfBirth":" Hunan Province, China","birthName":"Tien Yu-Kun","height":"6' (1.83 m)","bio":"Feng Tien was born on June 4, 1928 in Hunan Province, China as Tien Yu-Kun. He was an actor and director, known for A Better Tomorrow (1986), The Chinese Connection (1972) and Eros (2004). He died on October 22, 2015 in Hong Kong, China.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTZhZGY1MWItMDUxZC00NjVhLTk4ZTQtYmYyZThiNWYxMGRjL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0284608","name":"Feng Tien","idIMDB":"nm0284608"},"actorId":"nm0284608","character":"Master Jin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chun-Luk Chan","urlProfile":"http://www.imdb.com/name/nm1741757","urlPhoto":"","biography":{"bio":"Chun-Luk Chan is an actress, known for Eros (2004), Infernal Affairs II (2003) and The Source of Love (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1741757","name":"Chun-Luk Chan","idIMDB":"nm1741757"},"actorId":"nm1741757","character":"Hua's Servant - Ying","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jianjun Zhou","urlProfile":"http://www.imdb.com/name/nm1273488","urlPhoto":"","biography":{"bio":"Jianjun Zhou is an actor, known for Eros (2004), Triad Election (2006) and Qing die (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1273488","name":"Jianjun Zhou","idIMDB":"nm1273488"},"actorId":"nm1273488","character":"Hua's Lover - Zhao","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wing Tong Sheung","urlProfile":"http://www.imdb.com/name/nm1742464","urlPhoto":"","biography":{"bio":"Wing Tong Sheung is an actor, known for Eros (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1742464","name":"Wing Tong Sheung","idIMDB":"nm1742464"},"actorId":"nm1742464","character":"Tailor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kim Tak Wong","urlProfile":"http://www.imdb.com/name/nm1745524","urlPhoto":"","biography":{"bio":"Kim Tak Wong is an actor, known for Eros (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1745524","name":"Kim Tak Wong","idIMDB":"nm1745524"},"actorId":"nm1745524","character":"Tailor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Siu Man Ting","urlProfile":"http://www.imdb.com/name/nm1745488","urlPhoto":"","biography":{"bio":"Siu Man Ting is an actor, known for Eros (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1745488","name":"Siu Man Ting","idIMDB":"nm1745488"},"actorId":"nm1745488","character":"Tailor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lai Fu Yim","urlProfile":"http://www.imdb.com/name/nm1742636","urlPhoto":"","biography":{"bio":"Lai Fu Yim is an actor, known for Eros (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1742636","name":"Lai Fu Yim","idIMDB":"nm1742636"},"actorId":"nm1742636","character":"Tailor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cheng You Shin","urlProfile":"http://www.imdb.com/name/nm1742465","urlPhoto":"","biography":{"bio":"Cheng You Shin is an actor, known for Eros (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1742465","name":"Cheng You Shin","idIMDB":"nm1742465"},"actorId":"nm1742465","character":"Tailor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wing Kong Siu","urlProfile":"http://www.imdb.com/name/nm1745463","urlPhoto":"","biography":{"bio":"Wing Kong Siu is an actor, known for Eros (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1745463","name":"Wing Kong Siu","idIMDB":"nm1745463"},"actorId":"nm1745463","character":"Tailor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kar Fai Lee","urlProfile":"http://www.imdb.com/name/nm1742189","urlPhoto":"","biography":{"bio":"Kar Fai Lee is an actor, known for Eros (2004), Dog Bite Dog (2006) and Missing (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1742189","name":"Kar Fai Lee","idIMDB":"nm1742189"},"actorId":"nm1742189","character":"Tailor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chi Keong Un","urlProfile":"http://www.imdb.com/name/nm1742572","urlPhoto":"","biography":{"bio":"Chi Keong Un is an actor, known for Eros (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1742572","name":"Chi Keong Un","idIMDB":"nm1742572"},"actorId":"nm1742572","character":"Hotel Concierge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Downey Jr.","urlProfile":"http://www.imdb.com/name/nm0000375","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1965","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Robert John Downey Jr","height":"5' 8½\" (1.74 m)","bio":"Robert Downey Jr. has evolved into one of the most respected actors in Hollywood. With an amazing list of credits to his name, he has managed to stay new and fresh even after over four decades in the business. Downey was born April 4, 1965 in Manhattan, New York, the son of writer, director and filmographer Robert Downey Sr. and actress Elsie Downey (née Elsie Ann Ford). Robert's father is of half Lithuanian Jewish, one quarter Hungarian Jewish, and one quarter Irish, descent, while Robert's mother was of English, Scottish, German, and Swiss-German ancestry. Robert and his sister, Allyson Downey, were immersed in film and the performing arts from a very young age, leading Downey Jr. to study at the Stagedoor Manor Performing Arts Training Center in upstate New York, before moving to California with his father following his parents' 1978 divorce. In 1982, he dropped out of Santa Monica High School to pursue acting full time. Downey Sr., himself a drug addict, exposed his son to drugs at a very early age, and Downey Jr. would go on to struggle with abuse for decades. Downey Jr. made his debut as an actor at the age of five in the film Pound (1970), written and directed by his father, Robert Downey Sr.. He built his film repertoire throughout the 1980s and 1990s with roles in Tuff Turf (1985), Weird Science (1985), True Believer (1989), and Wonder Boys (2000) among many others. In 1992, Downey received an Academy Award nomination and won the BAFTA (British Academy Award) for Best Actor for his performance in the title role of Chaplin (1992). In Robert Altman's Short Cuts (1993), he appeared as an aspiring film make-up artist whose best friend commits murder. In Oliver Stone's Natural Born Killers (1994), with Woody Harrelson and Juliette Lewis, Downey starred as a tabloid TV journalist who exploits a murderous couple's killing spree to boost his ratings. For the comedy Heart and Souls (1993), Downey starred as a young man with a special relationship with four ghosts. In 1995, Downey starred in Restoration (1995), with Hugh Grant, Meg Ryan and Ian McKellen, directed by Michael Hoffman. Also that year, he starred in Richard III (1995), in which he appears opposite his Restoration (1995) co-star McKellen. In 1997, Downey was seen in Robert Altman's The Gingerbread Man (1998), alongside Kenneth Branagh, Daryl Hannah and Embeth Davidtz; in One Night Stand (1997), directed by Mike Figgis and starring Wesley Snipes and Nastassja Kinski; and in Hugo Pool (1997), directed by his father, Robert Downey Sr. and starring Sean Penn and Patrick Dempsey. In September of 1999, Downey appeared in Black & White (1999), written and directed by James Toback, along with Ben Stiller, Elijah Wood, Gaby Hoffmann, Brooke Shields and Claudia Schiffer. In January of 1999, he starred with Annette Bening and Aidan Quinn in In Dreams (1999), directed by Neil Jordan. In 2000, Downey co-starred with Michael Douglas and Tobey Maguire in Wonder Boys (2000), directed by Curtis Hanson. In this dramatic comedy, Downey played the role of a bisexual literary agent. In 2001, Downey made his prime-time television debut when he joined the cast of the Fox-TV series Ally McBeal (1997) as attorney \"Larry Paul\". For this role, he won the Golden Globe Award for Best Performance by an Actor in a Supporting Role in a Series, Mini-Series or Motion Picture Made for Television, as well as the Screen Actors Guild Award for Outstanding Performance by a Male in a Comedy Series. In addition, Downey was nominated for an Emmy for Outstanding Supporting Actor in a Comedy Series. The actor's drug-related problems escalated from 1996 to 2001, leading to arrests, rehab visits and incarcerations, and he was eventually fired from Ally McBeal (1997). Emerging clean and sober in 2003, Downey Jr. began to rebuild his career. He marked his debut into music with his debut album, titled \"The Futurist\", on the Sony Classics Label on November 23rd, 2004. The album's eight original songs, that Downey wrote, and his two musical numbers debuting as cover songs revealed his sultry singing voice and his musical talents. Downey displayed his versatility in two different films in October 2003: the musical/drama The Singing Detective (2003), a remake of the BBC hit of the same name, and the thriller Gothika (2003) starring Halle Berry and Penélope Cruz. Downey starred in powerful yet humbling roles inspired by real-life accounts of some of history's most precious kept secrets, including Richard Linklater's A Scanner Darkly (2006) in 2006 co-starring Keanu Reeves, Winona Ryder and Woody Harrelson, and Fur: An Imaginary Portrait of Diane Arbus (2006) co-starring Nicole Kidman, a film inspired by the life of Diane Arbus, the revered photographer whose images captured attention in the early 1960s. These roles exhibited Downey's momentum from the previous year of 2005, in which he starred in the Academy Award®-nominated feature film Good Night, and Good Luck. (2005), directed by George Clooney and in Shane Black's action comedy Kiss Kiss Bang Bang (2005) co-starring Val Kilmer. In 2007, he co-starred in David Fincher's suspenseful _Zodiac (2007/I)_ alongside Jake Gyllenhaal and Mark Ruffalo, about the notorious serial killer who haunted San Francisco during the 1970s. In May 2008, Downey achieved critical acclaim and worldwide box office success for his starring role in Iron Man (2008), Jon Favreau's big-screen rendering of the Marvel comic book superhero. The film co-starred Gwyneth Paltrow, Jeff Bridges and Terrence Howard. In August of 2008, Downey starred with Ben Stiller and Jack Black in the comedy Tropic Thunder (2008), and went on to receive an Academy Award®-nomination for Best Supporting Actor for his, Kirk Lazarus. In December 2009, Downey starred in the action-adventure Sherlock Holmes (2009). The film, directed by Guy Ritchie, co-starred Jude Law and Rachel McAdams and earned Downey a Golden Globe for Best Performance by an Actor in a Motion Picture - Comedy or Musical in January of 2010. In early Summer 2010, Downey re-teamed with director Jon Favreau and reprised his role as \"Tony Stark/Iron Man\" in the hugely successful sequel to the original film, Iron Man 2 (2010), starring Gwyneth Paltrow, Scarlett Johansson, Samuel L. Jackson and Mickey Rourke. Downey next starred in Due Date (2010), a comedy directed by Todd Phillips, in which he plays the role of an expectant father on a road trip racing to get back in time for the birth of his first child. Due Date (2010), starring The Hangover (2009)'s Zach Galifianakis, was released in November 2010. Downey was honored by Time Magazine's \"Time 100\" in 2008, an annual list of the 100 most influential people in the world. His laurels include two Academy Award nominations, three Golden Globe wins, numerous other award nominations and wins, and tremendous popular and commercial success, particularly in his roles as Sherlock Holmes and Tony Stark (the latter of which he has so far played in Iron Man (2008), Iron Man 2 (2010), The Avengers (2012), Iron Man 3 (2013), and Avengers: Age of Ultron (2015). For three consecutive years, from 2012 to 2015, Downey has topped the Forbes list of Hollywood's highest-paid actors, making an estimated $80 million in earnings between June 2014 and June 2015. In 2005, Downey Jr. married Susan Downey, who gave birth to their son, Exton Elias Downey, on February 7, 2012. Downey also has another son, Indio Falconer Downey, born September 7, 1993, from his first marriage to Deborah Falconer, from whom he was officially divorced in 2004. Robert has jump-started the Team Downey Production Company with wife Susan Downey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000375","name":"Robert Downey Jr.","nicknames":["Bob","RDJ"],"idIMDB":"nm0000375"},"actorId":"nm0000375","character":"Nick Penrose","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alan Arkin","urlProfile":"http://www.imdb.com/name/nm0000273","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDk5Njc3MF5BMl5BanBnXkFtZTYwNjc5NDc0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1934","placeOfBirth":" New York City, New York, USA","birthName":"Alan Wolf Arkin","height":"5' 9½\" (1.77 m)","bio":"Alan Arkin is an Academy Award-winning American actor who is also an acclaimed director, producer, author, singer and composer. He was born Alan Wolf Arkin on March 26, 1934, in Brooklyn, New York. His family were Jewish immigrants from Russia and Germany. In 1946 the Arkins moved from Brooklyn to Los Angeles, California. His father, David I. Arkin, was an artist and writer, who worked as a teacher, and lost his job for merely refusing to answer questions about his political affiliation during the 1950s Red Scare. His father challenged the politically biased dismissal and eventually prevailed, but unfortunately it was after his death. His mother, Beatrice (Wortis) Arkin, a teacher, shared his fathers views. Young Arkin was fond of music and acting, he was taking various acting classes from the age of 10. He attended Franklin High School, in Los Angeles, then Los Angeles City College from 1951 - 1953, and Bennington College in Vermont from 1953 - 1954. He sang in a college folk-band, and was involved in a drama class. He dropped out of college to form the folk music group The Tarriers, in which Arkin was the lead singer and played guitar. He co-wrote the 1956 hit \"The Banana Boat Song\" - a Jamaican calypso folk song, which became better known as Harry Belafonte's popular version, and reached #4 on the Billboard chart. At that time Arkin was a struggling young actor who played bit parts on television and on stage, and made a living as a delivery boy, repairman, pot washer and baby sitter. From 1958 - 1968 he performed and recorded with the children's folk group, The Babysitters. He has also recorded an entire album for the Elektra label titled \"Folksongs - Once Over Lightly.\" In 1957 Arkin made his first big screen appearance as a lead singer with The Tarriers in Calypso Heat Wave (1957). Then he made his Off-Broadway debut as a singer in \"Heloise\" (1958). Next year he joined the Compass Theatre in St. Louis, Missouri. There he caught the eye of stage director Bob Sills and became the original member of the \"Second City\" troupe in Chicago. In 1961 Arkin made his Broadway debut in musical \"From the Second City\", for which he wrote lyrics and sketches, then starred as David Kolowitz in the Broadway comedy \"Enter Laughing\" (1963), for which he won a Tony Award. He starred in a Broadway musical \"From the Second City production, then returned to Broadway as Harry Berlin in \"Luv\" (1964). Arkin made his directorial debut with an Off-Broadway hit called \"Eh?\" (1966), which introduced the young actor, named Dustin Hoffman. He won a Drama Desk Award for his direction of the Off-Broadway production of \"Little Murders\" (1969), and another Drama Desk Award for \"The White House Murder Case\" (1970). He also directed the original version of Neil Simon's hilarious smash, \"The Sunshine Boys\" (1972), which ran over 500 performances. Arkin earned his first Academy Award nomination as Best Actor for his feature acting debut in a comedy The Russians Are Coming! The Russians Are Coming! (1966), by director Norman Jewison, co-starring as Lt. Rozanov, a Soviet submariner who is mistaken for a spy after his boat accidentally wrecks aground in New England. Arkin demonstrated his dramatic range as the psychopathic killer Roat in suspense film Wait Until Dark (1967), opposite Audrey Hepburn. He reinvented himself as the sensitive deaf-mute in The Heart Is a Lonely Hunter (1968), for which he received his second Academy Award nomination as Best Actor in the Leading role. He followed with what remained his best known role as Captain Yossarian in Catch-22 (1970), directed by Mike Nichols and based on the eponymous anti-war novel by Joseph Heller. In it Arkin arguably gave his strongest performance, however, his career suffered because the film initially did not live up to expectations. After a few years of directorial work on television, Arkin made a comeback with an impressive portrayal of doctor Sigmund Freud in The Seven-Per-Cent Solution (1976). In the early 1980s he acted in three movies that were family affairs, written by his wife, Barbara Dana, and co-starring his son, Adam Arkin. During the 1990s he turned out several notable performances, such as a bitter former baseball player in TNT's Cooperstown (1993), and as a hilarious psychiatrist opposite John Cusack in Grosse Pointe Blank (1997). He won raves for his portrayal of a divorced father who struggles to keep his kids enrolled in the Beverly Hills school system in Slums of Beverly Hills (1998). Arkin gave a brilliant performance opposite Robin Williams in Jakob le menteur (1999), a film about the Nazi occupation of Poland. He also returned to the New York stage co-starring with his son, Tony Arkin and Elaine May in \"Power Plays\", which he also co-authored. His most recent comeback as a heroin-snorting, sex-crazed, foul-mouthed grandfather in Little Miss Sunshine (2006), earned him his third Academy Award nomination for Best Performance by an Actor in a Supporting Role, and his first Academy Award. Alan Arkin has been a modern Renaissance man. In addition to his achievements as an actor, director, and producer, he made his mark as a singer-songwriter with his popular-song compositions \"Banana Boat Song\", \"Cuddle Bug,\" \"That's Me,\" and \"Best Time of the Year.\" Arkin also authored several books, including science-fiction and some children's stories, such as \"The Clearing\", \"The Lemming Condition\" and \"Cassie Loves Beethoven\" among his other publications. He is a father of three sons, Adam, Matthew, and Tony, and a grandfather of Molly Arkin. Alan Arkin has been a strong supporter of an organic way of living and also a proponent for preservation of the environment and natural habitat. He has been avoiding the show-biz-milieu and is known as an actor who does not really care about prestigious awards, but values having a good job and being acknowledged by his peers. In Arkin's own words he wants to \"Stay home for three months. Living as quietly as humanly possible.\" Arkin was given an Indian name, Grey Wolf, by his Native American friends in New Mexico.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDk5Njc3MF5BMl5BanBnXkFtZTYwNjc5NDc0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000273","name":"Alan Arkin","nicknames":["The Tarriers"],"idIMDB":"nm0000273"},"actorId":"nm0000273","character":"Dr. Pearl / Hal","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0343663","urlIMDB":"http://www.imdb.com/title/tt0343663","business":{"budget":null,"openingWeekend":[{"money":"$53,666","country":"USA","day":"10","month":"04","year":"2005","remarks":"12 Screens"},{"money":"€262,275","country":"Italy","day":"05","month":"12","year":"2004","remarks":"136 Screens"}],"gross":[{"money":"$188,248","country":"USA","day":"17","month":"07","year":"2005","remarks":""},{"money":"$186,463","country":"USA","day":"10","month":"07","year":"2005","remarks":""},{"money":"$179,160","country":"USA","day":"26","month":"06","year":"2005","remarks":""},{"money":"$176,854","country":"USA","day":"19","month":"06","year":"2005","remarks":""},{"money":"$175,349","country":"USA","day":"05","month":"06","year":"2005","remarks":""},{"money":"$168,974","country":"USA","day":"22","month":"05","year":"2005","remarks":""},{"money":"$167,372","country":"USA","day":"15","month":"05","year":"2005","remarks":""},{"money":"$163,141","country":"USA","day":"08","month":"05","year":"2005","remarks":""},{"money":"$160,427","country":"USA","day":"01","month":"05","year":"2005","remarks":""},{"money":"$147,375","country":"USA","day":"24","month":"04","year":"2005","remarks":""},{"money":"$115,334","country":"USA","day":"17","month":"04","year":"2005","remarks":""},{"money":"$53,666","country":"USA","day":"10","month":"04","year":"2005","remarks":""},{"money":"€631,043","country":"Italy","day":"19","month":"12","year":"2004","remarks":""},{"money":"€568,460","country":"Italy","day":"12","month":"12","year":"2004","remarks":""},{"money":"€265,004","country":"Italy","day":"05","month":"12","year":"2004","remarks":""}],"weekendGross":[{"money":"$213","country":"USA","day":"17","month":"07","year":"2005","remarks":"1 Screen"},{"money":"$6,008","country":"USA","day":"10","month":"07","year":"2005","remarks":"4 Screens"},{"money":"$1,269","country":"USA","day":"26","month":"06","year":"2005","remarks":"2 Screens"},{"money":"$538","country":"USA","day":"19","month":"06","year":"2005","remarks":"3 Screens"},{"money":"$1,022","country":"USA","day":"05","month":"06","year":"2005","remarks":"3 Screens"},{"money":"$343","country":"USA","day":"22","month":"05","year":"2005","remarks":"1 Screen"},{"money":"$3,178","country":"USA","day":"15","month":"05","year":"2005","remarks":"7 Screens"},{"money":"$686","country":"USA","day":"08","month":"05","year":"2005","remarks":"2 Screens"},{"money":"$3,757","country":"USA","day":"01","month":"05","year":"2005","remarks":"7 Screens"},{"money":"$15,783","country":"USA","day":"24","month":"04","year":"2005","remarks":"11 Screens"},{"money":"$34,711","country":"USA","day":"17","month":"04","year":"2005","remarks":"16 Screens"},{"money":"$53,666","country":"USA","day":"10","month":"04","year":"2005","remarks":"12 Screens"},{"money":"€14,768","country":"Italy","day":"19","month":"12","year":"2004","remarks":"14 Screens"},{"money":"€115,390","country":"Italy","day":"12","month":"12","year":"2004","remarks":"116 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 44 min (104 min)","1 hr 48 min (108 min) (Argentina)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arriflex 535B, Zeiss and Angenieux Lenses"],"laboratory":["FotoKem Laboratory, Burbank (CA), USA","Technicolor, Los Angeles (CA), USA"],"filmLength":null,"negativeFormat":["35 mm (Kodak) (Fuji)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Spherical (source format)"],"printedFilmFormat":["35 mm (spherical)"]},"rating":"6.0","metascore":"51","filmingLocations":[{"location":"Capalbio, Grosseto, Tuscany, Italy"}],"rated":"R","awards":[{"award":"Hollywood Film Awards 2004","titlesAwards":[{"titleAwardOutcome":"Won Hollywood Film Award","categories":[{"category":"Casting Director of the Year","names":[{"name":"Debra Zane","id":"nm0952918","role":null},{"name":"Ocean's Twelve","id":"tt0349903","role":null},{"name":"The Terminal","id":"tt0362227","role":null}]}]}]}],"votes":"5,287","type":"Movie","companyCreditsSimple":[{"idCompany":"co0126364","name":"Jet Tone Films"},{"idCompany":"co0070147","name":"Block 2 Pictures"},{"idCompany":"co0004038","name":"Roissy Films"}],"keywords":{"keywords":["psychiatrist","sexuality","pressure at work","anthology","tailor","sex","dream","masturbation","softcore","obsessive love","sensuality","intimate","dying young","doctor patient relationship","lovers reunited","master servant relationship","businessman","erotica","desire","nudity","directed by several directors","dominatrix","female nudity","sunbathing","siren","sewing machine","restaurant","psychologist","prostitute","paper airplane","italy","hand job","fornication","female full frontal nudity","euro trash","dressmaker","debt","couch","car","business report","bed","beach","bath","1950s"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:31:05"}}