{"data":{"movies":[{"title":"Kicking & Screaming","originalTitle":"","year":"2005","releaseDate":"20050513","directors":[{"name":"Jesse Dylan","id":"nm0245888"}],"writers":[{"name":"Leo Benvenuti","id":"nm1080144"},{"name":"Steve Rudnick","id":"nm0748874"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5Njk1MjEzMzZeQTJeQWpwZ15BbWU3MDY3NjY4MjE@._V1.jpg","countries":["USA"],"languages":["English","Italian"],"genres":["Comedy","Family","Romance","Sport"],"plot":"Family man Phil Weston, a lifelong victim of his father's competitive nature, takes on the coaching duties of a kids' soccer team, and soon finds that he's also taking on his father's dysfunctional way of relating...","simplePlot":"Family man Phil Weston, a lifelong victim of his father's competitive nature, takes on the coaching duties of a kids' soccer team, and soon finds that he's also taking on his father's dysfunctional way of relating...","actors":[{"actorName":"Will Ferrell","urlProfile":"http://www.imdb.com/name/nm0002071","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMDIzMDEzNF5BMl5BanBnXkFtZTcwODcxMjE2Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1967","placeOfBirth":" Irvine, California, USA","birthName":"John William Ferrell","height":"6' 3\" (1.91 m)","bio":"John William Ferrell was born in Irvine, California, to Betty Kay (Overman), a teacher, and Roy Lee Ferrell, Jr., a musician. His parents were both originally from Roanoke Rapids, North Carolina. A graduate of the University of Southern California, Ferrell became interested in performing while a student at University High School in Irvine, where he made his school's daily morning announcements over the public address system in disguised voices. He started as a member of the Los Angeles comedy/improvisation group The Groundlings, where fellow cast members Ana Gasteyer, Maya Rudolph and former Saturday Night Live (1975) repertory players such as Laraine Newman, Jon Lovitz and Phil Hartman began their careers. It was there he met Chris Kattan and the two became good friends and both went on to Saturday Night Live (1975) later. He has also appeared on several television programs, including Strangers with Candy (1999), Grace Under Fire (1993) and Living Single (1993) during his time at The Groundlings. Will also lent his voice to the armless and legless dad of cartoon family \"The Oblongs\". In 1995 he became a feature cast member at Saturday Night Live (1975) during the show's rapid re-casting. He was declared quite possibly the worst cast member ever during his first season. However, his talents of impersonations and range of characters shot him forward to making him arguably the greatest Saturday Night Live (1975) cast member ever. During his seven year run he is one of the few cast members to ever be nominated for an Emmy for a performance and played George W. Bush during the 2000 elections. He's appeared in every Saturday Night Live (1975) movie since his premiere on the show in 1995. In 2002 he left Saturday Night Live (1975) and was the only cast member to ever receive a farewell from all the current cast members at the end of the season finale show. Since leaving the show Will has pursued a career in films. In 2000 he married and now lives in L.A.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMDIzMDEzNF5BMl5BanBnXkFtZTcwODcxMjE2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002071","name":"Will Ferrell","nicknames":["Wilf"],"idIMDB":"nm0002071"},"actorId":"nm0002071","character":"Phil Weston","urlCharacter":"http://www.imdb.com/character/ch0018836","main":true},{"actorName":"Robert Duvall","urlProfile":"http://www.imdb.com/name/nm0000380","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjk1MjA2Mjc2MF5BMl5BanBnXkFtZTcwOTE4MTUwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1931","placeOfBirth":" San Diego, California, USA","birthName":"Robert Selden Duvall","height":"5' 9½\" (1.77 m)","bio":"Veteran actor and director Robert Selden Duvall was born on January 5, 1931, in San Diego, CA, to Mildred Virginia (Hart), an amateur actress, and William Howard Duvall, a career military officer who later became an admiral. Duvall majored in drama at Principia College (Elsah, IL), then served a two-year hitch in the army after graduating in 1953. He began attending The Neighborhood Playhouse School of the Theatre In New York City on the G.I. Bill in 1955, studying under Sanford Meisner along with Dustin Hoffman, with whom Duvall shared an apartment. Both were close to another struggling young actor named Gene Hackman. Meisner cast Duvall in the play \"The Midnight Caller\" by Horton Foote, a link that would prove critical to his career, as it was Foote who recommended Duvall to play the mentally disabled \"Boo Radley\" in To Kill a Mockingbird (1962). This was his first \"major\" role since his 1956 motion picture debut as an MP was in Somebody Up There Likes Me (1956), starring Paul Newman. Duvall began making a name for himself as a stage actor in New York, winning an Obie Award in 1965 playing incest-minded longshoreman \"Eddie Carbone\" in the off-Broadway revival of Arthur Miller's \"A View from the Bridge\", a production for which his old roommate Hoffman was assistant director. He found steady work in episodic TV and appeared as a modestly billed character actor in films, such as Arthur Penn's The Chase (1966) with Marlon Brando and in Robert Altman's Countdown (1967) and Francis Ford Coppola's The Rain People (1969), in both of which he co-starred with James Caan. He was also memorable as the heavy who is shot by John Wayne at the climax of True Grit (1969) and was the first \"Maj. Frank Burns\", creating the character in Altman's Korean War comedy MASH (1970). He also appeared as the eponymous lead in George Lucas' directorial debut, THX 1138 (1971). It was Francis Ford Coppola, casting The Godfather (1972), who reunited Duvall with Brando and Caan and provided him with his career breakthrough as mob lawyer \"Tom Hagen\". He received the first of his six Academy Award nominations for the role. Thereafter, Duvall had steady work in featured roles in such films as The Godfather: Part II (1974), The Killer Elite (1975), Network (1976), The Seven-Per-Cent Solution (1976) and The Eagle Has Landed (1976). Occasionally this actor's actor got the chance to assay a lead role, most notably in Tomorrow (1972), in which he was brilliant as William Faulkner's inarticulate backwoods farmer. He was less impressive as the lead in Badge 373 (1973), in which he played a character based on real-life NYPD detective Eddie Egan, the same man his old friend Gene Hackman had won an Oscar for playing, in fictionalized form as \"Popeye Doyle\" in The French Connection (1971). It was his appearance as \"Lt. Col. Kilgore\" in another Coppola picture, Apocalypse Now (1979), that solidified Duvall's reputation as a great actor. He got his second Academy Award nomination for the role, and was named by the Guinness Book of World Records as the most versatile actor in the world. Duvall created one of the most memorable characters ever assayed on film, and gave the world the memorable phrase, \"I love the smell of napalm in the morning!\". Subsequently, Duvall proved one of the few established character actors to move from supporting to leading roles, with his Oscar-nominated turns in The Great Santini (1979) and Tender Mercies (1983), the latter of which won him the Academy Award for Best Actor. Now at the summit of his career, Duvall seemed to be afflicted with the fabled \"Oscar curse\" that had overwhelmed the careers of fellow Academy Award winners Luise Rainer, Rod Steiger and Cliff Robertson. He could not find work equal to his talents, either due to his post-Oscar salary demands or a lack of perception in the industry that he truly was leading man material. He did not appear in The Godfather: Part III (1990), as the studio would not give in to his demands for a salary commensurate with that of Al Pacino, who was receiving $5 million to reprise Michael Corleone. His greatest achievement in his immediate post-Oscar period was his triumphant characterization of grizzled Texas Ranger Gus McCrae in the TV mini-series Lonesome Dove (1989), for which he received an Emmy nomination. He received a second Emmy nomination and a Golden Globe for his portrayal of Soviet dictator Joseph Stalin in Stalin (1992), and a third Emmy nomination playing Nazi war criminal Adolf Eichmann in The Man Who Captured Eichmann (1996). The shakeout of his career doldrums was that Duvall eventually settled back into his status as one of the premier character actors in the industry, rivaled only by his old friend Gene Hackman. Duvall, unlike Hackman, also has directed pictures, including the documentary We're Not the Jet Set (1977), Angelo My Love (1983) and Assassination Tango (2002). As a writer-director, Duvall gave himself one of his most memorable roles, that of the preacher on the run from the law in The Apostle (1997), a brilliant performance for which he received his third Best Actor nomination and fifth Oscar nomination overall. The film brought Duvall back to the front ranks of great actors, and was followed by a Best Supporting Actor Oscar nod for A Civil Action (1998). Robert Duvall will long be remembered as one of the great naturalistic American screen actors in the mode of Spencer Tracy and his frequent co-star Marlon Brando. His performances as \"Boo Radley\" in To Kill a Mockingbird (1962), \"Jackson Fentry\" in Tomorrow (1972), \"Tom Hagen\" in the first two \"Godfather\" movies, \"Frank Hackett\" in Network (1976), \"Lt. Col. Kilgore\" in Apocalypse Now (1979), \"Bull Meechum\" in The Great Santini (1979), \"Mac Sledge\" in Tender Mercies (1983), \"Gus McCrae\" in Lonesome Dove (1989) and \"Sonny Dewey\" in The Apostle (1997) rank as some of the finest acting ever put on film. It's a body of work that few actors can equal, let alone surpass.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjk1MjA2Mjc2MF5BMl5BanBnXkFtZTcwOTE4MTUwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000380","name":"Robert Duvall","nicknames":["Bob"],"idIMDB":"nm0000380"},"actorId":"nm0000380","character":"Buck Weston","urlCharacter":"http://www.imdb.com/character/ch0018838","main":true},{"actorName":"Mike Ditka","urlProfile":"http://www.imdb.com/name/nm0228491","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NzQwMTU5NV5BMl5BanBnXkFtZTYwOTk4OTY1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 October 1939","placeOfBirth":" Carnegie, Pennsylvania, USA","birthName":"Michael Dyczko","height":"6' 3\" (1.91 m)","bio":"Mike Ditka was born on October 18, 1939 in Carnegie, Pennsylvania, USA as Michael Dyczko. He is an actor, known for Blood Equity (2009), Second String (2002) and Mike Ditka Show (1982). He has been married to Diana Trantham since July 8, 1977. They have four children. He was previously married to Margery Ditka.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NzQwMTU5NV5BMl5BanBnXkFtZTYwOTk4OTY1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0228491","name":"Mike Ditka","nicknames":["Iron Mike"],"idIMDB":"nm0228491"},"actorId":"nm0228491","character":"Mike Ditka","urlCharacter":"http://www.imdb.com/character/ch0062727","main":true},{"actorName":"Kate Walsh","urlProfile":"http://www.imdb.com/name/nm0005532","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NDEzNzg3MV5BMl5BanBnXkFtZTcwNjI1Mzg2Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1967","placeOfBirth":" San Jose, California, USA","birthName":"Kathleen Erin Walsh","height":"5' 8½\" (1.74 m)","bio":"Kate Walsh was born in San Jose, California, on October 13, 1967. She grew up partly in San Jose and partly in Tucson, Arizona, later attending the University of Arizona, where she got involved in regional theater. She later moved to Chicago where she began working with the Piven Theatre Workshop and, later, the Chicago Shakespeare Repertory. She performed on National Public Radio in the production of the radio play \"Born Guilty\". Walsh later moved to New York City and joined the comedy troupe \"Burn Manhattan\", performing in a number of Off-Broadway plays. Her first major television appearance came on The Drew Carey Show (1995) where she portrayed Niki Fifer, Drew's girlfriend and a woman struggling with her weight. She went on to portray Carol Nelson in HBO's The Mind of the Married Man (2001) television series, and played Norm MacDonald's romantic interest in the sitcom Norm (1999). She continues to appear on television programs in supporting or bit parts.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NDEzNzg3MV5BMl5BanBnXkFtZTcwNjI1Mzg2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005532","name":"Kate Walsh","nicknames":["Katie","Katiekat","K-Town"],"idIMDB":"nm0005532"},"actorId":"nm0005532","character":"Barbara Weston","urlCharacter":"http://www.imdb.com/character/ch0018837","main":true},{"actorName":"Musetta Vander","urlProfile":"http://www.imdb.com/name/nm0888727","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmMyMjYxNTAtOGFlOC00NzRlLWE0ZWQtZDEwYjJjZjI1NDhlXkEyXkFqcGdeQXVyMTkzNzExMA@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1963","placeOfBirth":" Durban, South Africa","birthName":"Musetta van der Merwe","height":"5' 8\" (1.73 m)","bio":"A Dutch South African, Musetta Vander was raised without that most basic of modern conveniences--television! Radio programming, childhood books and weekend trips to the drive-in introduced her to the magical world of movies. It was not until the mid-'70s that South Africa finally got television, and the big black box in the family living room \"miraculously\" sprang to life. However, as the daughter of a ballet teacher, Musetta was no stranger to the entertainment world and debuted on stage at the age of four. Her childhood was filled with numerous dance performances including \"Giselle\", \"Coppelia\", \"The Student Prince\" and \"Showboat\", and, shortly after completing school, she qualified as a ballet teacher herself. After earning a BA in Communications and Psychology, she landed the plum job as anchor host for an MTV-like television show in South Africa. One day, a handsome visiting American, Jeff Celentano, spotted her on television, made her his bride, and whisked her off to the very place she had always dreamed of--Hollywood. Shortly after her arrival, she became part of the very world she used to host, appearing as the \"dream girl\" in more than 20 music videos for such top recording artists as Rod Stewart, Amy Grant, Tina Turner, Elton John and Chris Isaak. It was her critically acclaimed stage performance in the original South African play \"Soweto's Burning\", about the trials of an interracial friendship in that racially segregated country, that provided her transition to the big screen. Musetta has since performed in numerous feature films, including collaborating with her husband on Under the Hula Moon (1995) and Gunshy (1998). She has also worked alongside such screen veterans as Kevin Kline, Kenneth Branagh and Will Smith in Wild Wild West (1999), George Clooney and John Turturro in O Brother, Where Art Thou? (2000) and John Hurt and Louis Gossett Jr. in Monolith (1993). She's also added a slew of television credits to her arsenal, including guest appearances on the hit shows Star Trek: Voyager (1995), Stargate SG-1 (1997) and Buffy the Vampire Slayer (1997). Recently Musetta made a return to the stage, combining both her dance and acting background in an extremely successful adaptation of Molière's \"The Bourgeois Gentleman\" at the Pasadena Civic Auditorium.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmMyMjYxNTAtOGFlOC00NzRlLWE0ZWQtZDEwYjJjZjI1NDhlXkEyXkFqcGdeQXVyMTkzNzExMA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0888727","name":"Musetta Vander","idIMDB":"nm0888727"},"actorId":"nm0888727","character":"Janice Weston","urlCharacter":"http://www.imdb.com/character/ch0111419","main":true},{"actorName":"Dylan McLaughlin","urlProfile":"http://www.imdb.com/name/nm1563653","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNzc1MTQxOF5BMl5BanBnXkFtZTYwNDY0Mzky._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 December 1993","placeOfBirth":" La Mesa, California, USA","bio":"Dylan McLaughlin was born on December 2, 1993 in La Mesa, California, USA. He is an actor and director, known for Kicking & Screaming (2005), Georgia Rule (2007) and You've Got a Friend (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNzc1MTQxOF5BMl5BanBnXkFtZTYwNDY0Mzky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1563653","name":"Dylan McLaughlin","nicknames":["D-man"],"idIMDB":"nm1563653"},"actorId":"nm1563653","character":"Sam Weston","urlCharacter":"http://www.imdb.com/character/ch0018842","main":true},{"actorName":"Josh Hutcherson","urlProfile":"http://www.imdb.com/name/nm1242688","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4OTk0MjQ1OV5BMl5BanBnXkFtZTcwNTE3NjM3Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 October 1992","placeOfBirth":" Union, Kentucky, USA","birthName":"Joshua Ryan Hutcherson","height":"5' 7\" (1.7 m)","bio":"Joshua Ryan Hutcherson was born on October 12, 1992 in Union, Kentucky to Michelle Fightmaster Hutcherson, who worked for Delta Air Lines, and Chris Hutcherson, an EPA analyst. He has one younger brother, Connor Hutcherson. From the age of four, Josh knew that he wanted to be an actor. In order to pursue his goal, Josh and his family moved to Los Angeles when he was nine-years-old. In 2002, Josh landed his first acting role in the TV film, House Blend (2002), with Amy Yasbeck, Dan Cortese and Sean Faris. The same year, Josh was cast in the pilot, Becoming Glen (2002), but Fox did not order it to series (though, several years later, it was reconfigured as the short-lived series, The Winner (2007), starring Rob Corddry, and co-written/produced by Seth MacFarlane). Toward the end of 2002, Josh appeared on an episode of ER (1994). Josh made his big-screen debut, in 2003, with a bit part in the Oscar-nominated American Splendor (2003). His career began its measured ascent in 2005 with a supporting slot as one of Will Ferrell's kids in Kicking & Screaming (2005), a co-starring role in the indie hit Little Manhattan (2005), and another co-starring role in Zathura: A Space Adventure (2005), which was originally conceived as a sequel to Jumanji (1995). Despite underperforming at the box office, \"Zathura\" helped earned for Josh his first Young Artist Award for \"Leading Young Actor\". 2006 saw bigger returns for Josh's burgeoning film career with a role as one of Robin Williams' sons in the modest hit, RV (2006). The following year, he landed his first breakthrough role in Bridge to Terabithia (2007), the kid-approved adaptation of Katherine Paterson's novel that co-starred AnnaSophia Robb, whose career was also taking off at this time. Josh starred as Brendan Fraser's nephew in another family-film hit, Journey to the Center of the Earth (2008), and he had a smaller role in the Crash-like drama, Fragments (2008), though by now his face and name were being used in movie-marketing materials. Though it wasn't a hit, Josh's character in Cirque du Freak: The Vampire's Assistant (2009) served as a major plot device early in the story. In 2010, Josh co-starred in the critically-acclaimed film, The Kids Are All Right (2010), alongside Annette Bening, Julianne Moore, Mark Ruffalo, and Mia Wasikowska. The film received several awards and four Academy Award nominations, including Best Picture. Josh's performance as the youngest child in a family, led by two mothers, earned him acclaim from audiences and the industry, alike. Josh followed up with an expanded role in Journey 2: The Mysterious Island (2012), which saw Dwayne Johnson take over as the main character from Brendan Fraser. Between the star power and the allure of 3D, the sequel was a worldwide hit and a third installment is in development. With the announcement that he would portray the beloved \"Peeta Mellark\" in The Hunger Games (2012), the film adaptation of the best-selling novel written by Suzanne Collins, Josh became an instant celebrity. In the wake of the movie's massive worldwide success, Detention (2011), a horror/comedy that Josh made before \"The Hunger Games\", was released. Josh was also an executive producer on that feature. Before Josh reprises his role as \"Peeta\" in The Hunger Games: Catching Fire (2013), we will see him in the long-delayed remake of Red Dawn (2012); the omnibus 7 jours à la Havane (2012) (aka \"7 Days in Havana\") (Josh's segment was directed by Benicio Del Toro); The Forger (2012) opposite Lauren Bacall, Alfred Molina, and Hayden Panettiere; and the animated Epic (2013) from Ice Age (2002) co-director (and voice of \"Scrat\"), Chris Wedge.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4OTk0MjQ1OV5BMl5BanBnXkFtZTcwNTE3NjM3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1242688","name":"Josh Hutcherson","nicknames":["JHutch","Hutch"],"idIMDB":"nm1242688"},"actorId":"nm1242688","character":"Bucky Weston","urlCharacter":"http://www.imdb.com/character/ch0045985","main":true},{"actorName":"Steven Anthony Lawrence","urlProfile":"http://www.imdb.com/name/nm0493037","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NzU1ODk3OV5BMl5BanBnXkFtZTYwNTAyMTAz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 July 1990","placeOfBirth":" Fresno, California, USA","birthName":"Steven Anthony Lawrence","height":"5' 0½\" (1.54 m)","bio":"Steven Anthony Lawrence was born on July 19, 1990 in Fresno, California, USA. He is an actor, known for Cheaper by the Dozen (2003), Kicking & Screaming (2005) and The Cat in the Hat (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NzU1ODk3OV5BMl5BanBnXkFtZTYwNTAyMTAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0493037","name":"Steven Anthony Lawrence","idIMDB":"nm0493037"},"actorId":"nm0493037","character":"Mark Avery","urlCharacter":"http://www.imdb.com/character/ch0018839","main":true},{"actorName":"Jeremy Bergman","urlProfile":"http://www.imdb.com/name/nm0074799","urlPhoto":"","biography":{"dateOfBirth":"5 September 1992","placeOfBirth":" New Jersey, USA","bio":"Jeremy Bergman began his professional career at the age of three after it became apparent that he had a strong interest in musical theater. At that age, he booked his first of many commercials for Playskool, followed by many others, including Lysol, Campbell's Soup and Kellogg's. By the age of six he began his film and television career by booking the role of Young Snidley Whiplash in \"Dudley Do-Right\" starring Brendon Frasier. Soon to follow was the pilot episode of \"Law & Order: SVU\" and the role, for five seasons, of Charlie Yokas, son of Faith Yokas, on \"Third Watch.\" He can also be seen in the current film \"The Station Agent\" as Jacob. Bergman's dream of being on Broadway was finally realized when he played the role of Chip in \"Beauty and the Beast.\" He is presently in California shooting the new Will Ferrell film, tentatively titled \"Kicking and Screaming.\" Although Bergman loves being an actor, he is also an avid sports fan and athlete. He loves tennis, baseball, roller hockey and football.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0074799","name":"Jeremy Bergman","idIMDB":"nm0074799"},"actorId":"nm0074799","character":"Hunter","urlCharacter":"http://www.imdb.com/character/ch0045986","main":true},{"actorName":"Elliott Cho","urlProfile":"http://www.imdb.com/name/nm1477977","urlPhoto":"","biography":{"dateOfBirth":"25 September 1994","placeOfBirth":" Honolulu, Hawaii, USA","birthName":"Elliot Youngkyu Cho","bio":"Elliott Cho was born on September 25, 1994 in Honolulu, Hawaii, USA as Elliot Youngkyu Cho. He is an actor, known for Click (2006), Kicking & Screaming (2005) and Blades of Glory (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1477977","name":"Elliott Cho","idIMDB":"nm1477977"},"actorId":"nm1477977","character":"Byong Sun","urlCharacter":"http://www.imdb.com/character/ch0045987","main":true},{"actorName":"Erik Walker","urlProfile":"http://www.imdb.com/name/nm1387915","urlPhoto":"","biography":{"dateOfBirth":"10 June 1977","placeOfBirth":" The Bronx, New York, USA","bio":"Erik Walker was born on June 10, 1977 in The Bronx, New York, USA. He is known for his work on Edge of Tomorrow (2014), Men in Black 3 (2012) and Warcraft: The Beginning (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1387915","name":"Erik Walker","idIMDB":"nm1387915"},"actorId":"nm1387915","character":"Ambrose","urlCharacter":"http://www.imdb.com/character/ch0045988","main":true},{"actorName":"Dallas McKinney","urlProfile":"http://www.imdb.com/name/nm1248701","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NTk2Mjc2OF5BMl5BanBnXkFtZTcwMjgyODEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1992","placeOfBirth":" USA","height":"5' 7\" (1.7 m)","bio":"Dallas McKinney was born in 1992 in the USA. He is an actor, known for Kicking & Screaming (2005), White Oleander (2002) and Mr. Fix It (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NTk2Mjc2OF5BMl5BanBnXkFtZTcwMjgyODEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1248701","name":"Dallas McKinney","nicknames":["Dillis"],"idIMDB":"nm1248701"},"actorId":"nm1248701","character":"Connor","urlCharacter":"http://www.imdb.com/character/ch0045989","main":true},{"actorName":"Francesco Liotti","urlProfile":"http://www.imdb.com/name/nm1875374","urlPhoto":"","biography":{"bio":"Francesco Liotti is an actor, known for Kicking & Screaming (2005), Everybody Loves Raymond: The Last Laugh (2005) and Kicking & Screaming: From Rome to Hollywood (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1875374","name":"Francesco Liotti","idIMDB":"nm1875374"},"actorId":"nm1875374","character":"Gian Piero","urlCharacter":"http://www.imdb.com/character/ch0045990","main":true},{"actorName":"Alessandro Ruggiero","urlProfile":"http://www.imdb.com/name/nm1875298","urlPhoto":"","biography":{"bio":"Alessandro Ruggiero is an actor, known for Kicking & Screaming (2005), Europa riconosciuta (2004) and Rino Gaetano - Ma il cielo è sempre più blu (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1875298","name":"Alessandro Ruggiero","idIMDB":"nm1875298"},"actorId":"nm1875298","character":"Massimo","urlCharacter":"http://www.imdb.com/character/ch0045991","main":true},{"actorName":"Sammy Fine","urlProfile":"http://www.imdb.com/name/nm1496194","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNTg4MzY3M15BMl5BanBnXkFtZTcwNDg0ODkyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1993","placeOfBirth":" Los Angeles, California, USA","birthName":"Samuel Jacob Fine","height":"4' 11\" (1.5 m)","bio":"Sammy Fine was born on June 16, 1993 in Los Angeles, California, USA as Samuel Jacob Fine. He is an actor, known for Kicking & Screaming (2005), Weeds (2005) and American Dreams (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNTg4MzY3M15BMl5BanBnXkFtZTcwNDg0ODkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1496194","name":"Sammy Fine","idIMDB":"nm1496194"},"actorId":"nm1496194","character":"Jack","urlCharacter":"http://www.imdb.com/character/ch0045992","main":true}],"seasons":[],"idIMDB":"tt0384642","urlIMDB":"http://www.imdb.com/title/tt0384642","business":{"budget":{"money":"$45,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$20,159,925","country":"USA","day":"15","month":"05","year":"2005","remarks":"3,455 Screens"},{"money":"£240,452","country":"UK","day":"24","month":"07","year":"2005","remarks":"260 Screens"}],"gross":[{"money":"$52,580,895","country":"USA","day":"31","month":"07","year":"2005","remarks":""},{"money":"$52,375,530","country":"USA","day":"24","month":"07","year":"2005","remarks":""},{"money":"$52,114,550","country":"USA","day":"17","month":"07","year":"2005","remarks":""},{"money":"$51,784,030","country":"USA","day":"10","month":"07","year":"2005","remarks":""},{"money":"$51,444,155","country":"USA","day":"04","month":"07","year":"2005","remarks":""},{"money":"$50,995,180","country":"USA","day":"26","month":"06","year":"2005","remarks":""},{"money":"$50,450,160","country":"USA","day":"19","month":"06","year":"2005","remarks":""},{"money":"$49,619,995","country":"USA","day":"12","month":"06","year":"2005","remarks":""},{"money":"$47,720,545","country":"USA","day":"05","month":"06","year":"2005","remarks":""},{"money":"$34,196,720","country":"USA","day":"22","month":"05","year":"2005","remarks":""},{"money":"$20,159,925","country":"USA","day":"15","month":"05","year":"2005","remarks":""},{"money":"£615,675","country":"UK","day":"31","month":"07","year":"2005","remarks":""},{"money":"£240,452","country":"UK","day":"24","month":"07","year":"2005","remarks":""}],"weekendGross":[{"money":"$94,125","country":"USA","day":"31","month":"07","year":"2005","remarks":"176 Screens"},{"money":"$140,385","country":"USA","day":"24","month":"07","year":"2005","remarks":"216 Screens"},{"money":"$173,160","country":"USA","day":"17","month":"07","year":"2005","remarks":"234 Screens"},{"money":"$209,585","country":"USA","day":"10","month":"07","year":"2005","remarks":"262 Screens"},{"money":"$275,730","country":"USA","day":"04","month":"07","year":"2005","remarks":"303 Screens"},{"money":"$260,925","country":"USA","day":"26","month":"06","year":"2005","remarks":"355 Screens"},{"money":"$419,540","country":"USA","day":"19","month":"06","year":"2005","remarks":"482 Screens"},{"money":"$821,855","country":"USA","day":"12","month":"06","year":"2005","remarks":"754 Screens"},{"money":"$2,311,155","country":"USA","day":"05","month":"06","year":"2005","remarks":"1,827 Screens"},{"money":"$10,721,715","country":"USA","day":"22","month":"05","year":"2005","remarks":"3,470 Screens"},{"money":"$20,159,925","country":"USA","day":"15","month":"05","year":"2005","remarks":"3,455 Screens"},{"money":"£67,874","country":"UK","day":"31","month":"07","year":"2005","remarks":"239 Screens"},{"money":"£240,452","country":"UK","day":"24","month":"07","year":"2005","remarks":"260 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 35 min (95 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Technicolor Digital Intermediates (digital intermediate)","Technicolor, USA"],"filmLength":null,"negativeFormat":null,"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"5.6","metascore":"45","filmingLocations":[{"location":"Arcadia, California, USA"}],"rated":"PG","awards":[{"award":"New York Film Critics Circle Awards 1995","titlesAwards":[{"titleAwardOutcome":"3rd place NYFCC Award","categories":[{"category":"Best First Film","names":[{"name":"Noah Baumbach","id":"nm0000876","role":null}]}]}]},{"award":"Razzie Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Actor","names":[{"name":"Will Ferrell","id":"nm0002071","role":null},{"name":"Bewitched","id":"tt0374536","role":null}]}]}]},{"award":"Teen Choice Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie: Comedy","names":[]},{"category":"Choice Movie Actor: Comedy","names":[{"name":"Will Ferrell","id":"nm0002071","role":null},{"name":"Anchorman: The Legend of Ron Burgundy","id":"tt0357413","role":null}]},{"category":"Choice Movie Hissy Fit","names":[{"name":"Will Ferrell","id":"nm0002071","role":null}]},{"category":"Choice Movie Sleazebag","names":[{"name":"Will Ferrell","id":"nm0002071","role":null}]}]}]},{"award":"Young Artist Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Performance in a Feature Film - Supporting Young Actor","names":[{"name":"Steven Anthony Lawrence","id":"nm0493037","role":null}]}]}]}],"votes":"31,135","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"},{"idCompany":"co0037759","name":"Mosaic Media Group"}],"keywords":{"keywords":["soccer","suburb","slapstick comedy","child","book","shyness","shy boy","screaming","shouting","yelling","juice box","asian american","10 year old","boy","goalkeeper","glasses","boy with glasses","soccer coach","uniform","little boy","lesbian couple","interracial adoption","adoption","punctuation in title","ampersand in title","sports team","voice over narration","lesbian mother","flashback","family relationships","cigar smoking","destiny","snorricam","boys' soccer","worm","wager","uncle","track and field","toupee","tetherball","swimming pool","stepmother","sporting goods store","sewing","prologue","obsession","neighbor","merchant","marriage","love at first sight","lesbian","italian american","illinois","hospital","health food","grandfather","gay parent","fish tank","fireplace","farce","fake commercial","face slap","eyeglasses","dog","divorce","dart","competitiveness","coffee","coffeehouse","coach","chainsaw","campfire","butcher shop","birth","bird","barbecue","banquet","soccer football","father son relationship"]}}]},"about":{"version":"2.30.1","serverTime":"2017/04/15 19:46:26"}}