{"data":{"movies":[{"title":"My Baby's Daddy","originalTitle":"","year":"2004","releaseDate":"20040109","directors":[{"name":"Cheryl Dunye","id":"nm0243109"}],"writers":[{"name":"Eddie Griffin","id":"nm0341176"},{"name":"Coke Daniels","id":"nm1248013"}],"runtime":"86 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxOTIyMzQ1OF5BMl5BanBnXkFtZTcwMzQ0NTQyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"Lonnie, Dominic and 'G' are three bachelor buddies from the hood who, after a lifetime of hard-partying, are in for a crude awakening when their respective girlfriends all get pregnant at the same time. The fathers-to-be embark on an emotional journey while learning as much about themselves as they do about love and fatherhood.","simplePlot":"A trio of young men (Griffin, Anderson, and Imperioli) are forced to grow up quick when their girlfriends all become pregnant around the same time.","actors":[{"actorName":"Eddie Griffin","urlProfile":"http://www.imdb.com/name/nm0341176","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTQwNjkxNl5BMl5BanBnXkFtZTgwMzAxODkzMDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1968","placeOfBirth":" Kansas City, Missouri, USA","height":"5' 7\" (1.7 m)","bio":"Eddie Griffin was born on July 15, 1968 in Kansas City, Missouri, USA. He is known for his work on Malcolm & Eddie (1996), Undercover Brother (2002) and Deuce Bigalow: Male Gigolo (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTQwNjkxNl5BMl5BanBnXkFtZTgwMzAxODkzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0341176","name":"Eddie Griffin","idIMDB":"nm0341176"},"actorId":"nm0341176","character":"Lonnie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anthony Anderson","urlProfile":"http://www.imdb.com/name/nm0026364","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMjk3MzM1NV5BMl5BanBnXkFtZTcwNDU1MDg0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 August 1970","placeOfBirth":" Los Angeles, California, USA","height":"5' 10\" (1.78 m)","bio":"Anthony Anderson was born on August 15, 1970 in Los Angeles, California, USA. He is an actor and producer, known for The Departed (2006), Transformers (2007) and Me, Myself & Irene (2000). He has been married to Alvina Renee Stewart since September 11, 1999. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMjk3MzM1NV5BMl5BanBnXkFtZTcwNDU1MDg0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0026364","name":"Anthony Anderson","idIMDB":"nm0026364"},"actorId":"nm0026364","character":"G","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Imperioli","urlProfile":"http://www.imdb.com/name/nm0408284","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1Nzk2MDg2OV5BMl5BanBnXkFtZTcwNTk4NzQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1966","placeOfBirth":" Mount Vernon, New York, USA","birthName":"James Michael Imperioli","height":"5' 8\" (1.73 m)","bio":"Imperioli was born James Michael Imperioli in Mt. Vernon, New York on March 26, 1966. His film work began in the late 1980s. An early part that brought him recognition was in Martin Scorsese's Goodfellas (1990), as Spider, a local kid who works for the gangsters and has a run-in with a psychopathic mob soldier played by Joe Pesci. He worked throughout the 1990s in the New York independent film industry, especially as a regular in Spike Lee's movies, appearing in Jungle Fever (1991), Malcolm X (1992), Clockers (1995), Girl 6 (1996) and Summer of Sam (1999), generally playing working-class Italian-Americans from the \"outer boroughs.\" While rooted in the New York movie scene, Imperioli also worked in Hollywood in the mid-'90s, in the formulaic movies Bad Boys (1995) and Last Man Standing (1996). In 1999, Imperioli was cast in The Sopranos (1999) as Christopher Moltisanti, a low-ranking soldier in the Soprano crime organization whose family connections to street boss Tony Soprano move him up the ladder in the organization. Imperioli's multi-layered portrayal of such an unappealing character is a real highlight of the series and earned him an Emmy and a SAG award. Imperioli has long been active in the New York theater scene as well, having written, directed, produced or starred in numerous plays. He was a founder, along with Lili Taylor (his then-girlfriend and co-star in Household Saints (1993)) of the downtown theater company Machine Full. He has also written several episodes of \"The Sopranos\" and was a writer on Lee's \"Summer of Sam,\" which he also executive-produced. Although most famous for his prominent part in \"The Sopranos,\" Imperioli has worked on other television programs as well, including Law & Order (1990), New York Undercover (1994) and NYPD Blue (1993). He is married and has two children and one stepdaughter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1Nzk2MDg2OV5BMl5BanBnXkFtZTcwNTk4NzQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0408284","name":"Michael Imperioli","idIMDB":"nm0408284"},"actorId":"nm0408284","character":"Dominic","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paula Jai Parker","urlProfile":"http://www.imdb.com/name/nm0005294","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNTY5ODA0N15BMl5BanBnXkFtZTYwMjc2OTA2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 August 1969","placeOfBirth":" Cleveland, Ohio, USA","height":"5' 2\" (1.57 m)","bio":"Paula Jai Parker is from Cleveland, Ohio. She moved to Washington, D.C. in 1987 to study at Howard University. After graduating with a Bachelor of Arts degree, she moved to New York City and played a number of clubs. Her reputation as a comedian earned her a place on the FOX comedy program \"The Apollo Comedy Hour,\" filmed live at the legendary Apollo Theater. She left the show after one year to pursue a film career, taking memorable roles in the F. Gary Gray urban comedy Friday and earned a Cable ACE Award for her role in the HBO anthology presentation, Cosmic Slop. Parker returned to television in 1995 in the WB television series The Wayans Bros. opposite Shawn and Marlon Wayans. Throughout the 1990s, she appeared in several shows, including 1997's The Weird Al Show and David E. Kelley's Snoops in 1999. Between television projects, she appeared in a number of films, including the Million Man March docudrama Get on the Bus (1996), the urban comedy Sprung (1997), the Frankie Lymon biography, Why Do Fools Fall in Love (1998), the ensemble comedy 30 Years to Life (2001), Cover and in the comedy-drama, She Hate Me (2004). In 2000, Parker voiced the sophisticated matriarch Trudy Proud in the popular animated series The Proud Family. The series became a success, and has continued to be produced by Disney and gain a positive standing among television critics. Between voice sessions, Parker has continued to take supporting roles in films, in 2002's \"High Crimes\", 2003's Phone Booth and 2005's Hustle & Flow. She also starred in My Baby's Daddy. Parker was also featured in the television series Touched by an Angel. In 2006, Parker starred in the feature film The Genius Club for writer/director Tim Chey. Paula Jai Parker appeared in music video \"I Belong to You\" by singer Rome and in music video \"Follow My Lead\" by 50 Cent featuring Robin Thicke. In 1999, she made a cameo appearance in the music video \"I Really Like It\" by Harlem World with Tracy Bingham and Tia and Tamera Mowery. In 2001, Parker appeared in the music video for \"Girls, Girls, Girls\" by rapper and business mogul Jay-Z with fellow actresses Tamala Jones and Carmen Electra. Parker married Forrest Martin in 2004. The couple met on the set of Hustle & Flow. Forrest had just graduated with a Master of Fine Arts. They have one son. Paula is starring in a TV One Production, \"Hollywood Divas,\" to air later in 2014. Forrest, a writer and producer, and Paula as the director and actor, are collaborating on several projects including the TV series \"The White Sisters.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNTY5ODA0N15BMl5BanBnXkFtZTYwMjc2OTA2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005294","name":"Paula Jai Parker","idIMDB":"nm0005294"},"actorId":"nm0005294","character":"Rolonda","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joanna Bacalso","urlProfile":"http://www.imdb.com/name/nm0045214","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGEyNDc2NGEtOThmYy00ZGIwLWE0ZmUtY2Q0MzFiY2M0NTNmXkEyXkFqcGdeQXVyMjQ2NTkwMTA@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1976","placeOfBirth":" Cebu, Philippines","height":"5' 8\" (1.73 m)","bio":"Joanna Bacalso was born on August 10, 1976 in Cebu, Philippines. She is an actress, known for Dude, Where's My Car? (2000), Chiens des neiges (2002) and Bedazzled (2000). She has been married to Matthew Garel since 1998. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGEyNDc2NGEtOThmYy00ZGIwLWE0ZmUtY2Q0MzFiY2M0NTNmXkEyXkFqcGdeQXVyMjQ2NTkwMTA@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0045214","name":"Joanna Bacalso","idIMDB":"nm0045214"},"actorId":"nm0045214","character":"Nia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bai Ling","urlProfile":"http://www.imdb.com/name/nm0000499","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU1NjE4NTIzMl5BMl5BanBnXkFtZTYwNDU5ODY3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1966","placeOfBirth":" Chengdu, China","height":"5' 3\" (1.6 m)","bio":"Born in the city of Cheng Du in southern China, Bai Ling began her career at age of 14. She enlisted In the Chinese People's Liberation Army, where she spent three years in a performance troupe entertaining soldiers stationed in Tibet. She first gained the attention of audiences and critics alike when she won the coveted lead role opposite Richard Gere in Jon Avnet's Red Corner (1997). She received numerous accolades including the prestigious Breakthrough Performance Award from the National Board of Review. She also garnered the Discovery Star awarded by the Hollywood Women's Press Club for their Golden Apple Awards. While developing her remarkable facility with the English language, she has worked with such prestigious filmmakers as Oliver Stone in Nixon (1995), George Lucas in Star Wars: Episode III - Revenge of the Sith (2005), Barry Sonnenfeld in Wild Wild West (1999), Spike Lee in She Hate Me (2004), Andy Tennant in Anna and the King (1999), Ang Lee in The Wedding Banquet (1993), Alex Proyas in The Crow (1994) and Luc Besson' in )Taxi 3 (2003)_, in which she spoke French. She also starred in Terrence Malick's Broadway production of \"Sansho the Bailiff\". She dazzled audiences with her portrayal of the sexy, mysterious Achara in the hit TV series Lost (2004), and intrigued viewers with her seductive yet exhilarating role in HBO's Entourage (2004). Bai Ling was awarded the Asian Oscar for her brilliant performance in her first Hong Kong film 3 extrêmes (2004). It also earned her an additional tre major awards in the Far East. She received the Spirit Diversity Award by The Hollywood Motion Picture Association. Her film Southland Tales (2006), directed by Richard Kelly was in competition at the Cannes Film Festival. Bai starred in and executive-produced Shanghai Baby (2007). She has worked with Taylor Hackford in Love Ranch (2010), co-starring with Helen Mirren and Joe Pesci, and had a leading role in the Jason Statham action comedy Crank: High Voltage (2009) with costar with Jason Statham.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU1NjE4NTIzMl5BMl5BanBnXkFtZTYwNDU5ODY3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000499","name":"Bai Ling","idIMDB":"nm0000499"},"actorId":"nm0000499","character":"XiXi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marsha Thomason","urlProfile":"http://www.imdb.com/name/nm0859720","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAzMTYxNjQwM15BMl5BanBnXkFtZTcwODEzOTQwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 January 1976","placeOfBirth":" Manchester, England, UK","birthName":"Marsha Lisa Thomason","height":"5' 8\" (1.73 m)","bio":"Marsha Thomason was born and raised in Manchester, England. Her love for acting began after watching the musical \"Bugsy Malone\". Soon after, aged 12, she joined Oldham Theatre Workshop, where she performed many diverse stage plays, including \"Our Day Out\" by Willy Russell and \"Peace\" by Aristophanes. What began as a hobby soon helped her achieve her first professional acting job at the age of 14, when she starred in 8:15 from Manchester (1990) (BBC 1). Marsha took \"A\" levels in English Language, Media Studies and Theatre Studies before studying for her BA in English at Manchester Metropolitan University. While at university, Marsha won the role of Janice Lafferty in Prime Suspect 5: Errors of Judgement (1996) alongside Helen Mirren, and later the same year she appeared in Brazen Hussies (1996) with Julie Walters and Robert Lindsay. Many parts followed, including Sally in the BBC's popular series Pie in the Sky (1994). Aged 20, Marsha moved to London's Notting Hill to take the role of Shazza Pearce in Playing the Field (1998), in which she played a beer-swilling, drug-taking soccer player. This was a role close to her heart as a life-long Manchester City supporter. After the first season of the show Marsha also starred as Nurse Jacqui Richards in Where the Heart Is (1997). She appeared in both programs simultaneously for three years. At this point she was spotted by Red Productions and appeared in Love in the 21st Century (1999), a series of six adult morality tales. Marsha fulfilled a lifelong dream of starring in London's West End when she made her professional stage debut in \"Breath Boom\" at the Royal Court Theatre. The play was also the debut of Marsha's American accent, as her character was a 15-year-old prostitute from New York whose dream of acceptance was to belong to a girl gang. Marsha's first foray into feature film was the Working Title production Long Time Dead (2002), a British horror film also starring Lukas Haas and Alec Newman. Her career then took her to America where she has continued to work in films, with roles as diverse as Victoria in Black Knight (2001) starring Martin Lawrence, and Brandy in Miramax's My Baby's Daddy (2004). She returned to England for the independent feature Pure (2002), directed by Gillies MacKinnon. Considered her most ambitious role to date, Marsha played Vicki, a Cockney heroin-addicted prostitute. While still in England, Marsha returned to Red Productions for the first series of the critically acclaimed Burn It (2003). In 2002 Marsha was awarded Best Actress in Film at the BFM awards. She recently appeared in the Disney feature The Haunted Mansion (2003) in which she starred opposite Eddie Murphy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAzMTYxNjQwM15BMl5BanBnXkFtZTcwODEzOTQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0859720","name":"Marsha Thomason","idIMDB":"nm0859720"},"actorId":"nm0859720","character":"Brandy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bobb'e J. Thompson","urlProfile":"http://www.imdb.com/name/nm1442928","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc2NDYxODE0MV5BMl5BanBnXkFtZTcwOTk1NTk5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 February 1996","placeOfBirth":" Kansas City, Missouri, USA","bio":"Kicking off an impressive career in front of the camera at the tender age of five, Bobb'e J. Thompson rose to fame as a child actor well before his teens, initially with a small but colorful and energetic supporting role as the pint-sized Tupac in My Baby's Daddy (2003). He subsequently appeared in television and film efforts such as \"The Tracy Morgan Show\" (2004), Shark Tale (2004), \"That's So Raven\" (2004), and \"Joey\" (2005). Thompson contributed to OutKast mainstay Bryan Barber's offbeat, inventive musical drama Idlewild (2006), before teaming up with Vince Vaughn in the holiday comedy Fred Claus (2007). Thompson then starred in the acerbic farce hit comedy Role Models as the hilarious, wisecracking Ronnie Shields, for which he was nominated for Best Breakthrough Performance - Male at the 2009 MTV Movie Awards. 2009 is proving to be a break out year for Thompson. He appeared in Land of the Lost with Will Ferrell and the family comedy Imagine That, in which he plays a junior extortionist that hazes Eddie Murphy. Thompson is also a semi-regular on NBC's \"30 Rock,\" stealing scenes and showing perfect comic timing in his role as Tracy Jr., the son of Tracy Morgan's character. Not stopping, Nike recruited Thompson for multiple commercials as the fast-talking Lil Dez, who gives NBA greats Kobe Bryant and LeBron James a run for their money while babysitting. Alongside his film work, Thompson culled favorable attention for his prominent contributions to the youth-oriented urban dance video JammX Kids: Can't Dance Don't Want To, which afforded him the opportunity to show off his flair for urban music and footwork. Up next for Thompson is Snowmen with Ray Liotta and a hosting gig on the Cartoon Network show Bobb'e Says. Additionally, Reveille has entered into a talent holding deal with the 13-year-old. Reveille's first project with Thompson will be a half-hour scripted comedy. Reveille is a leading independent television studio with a major presence in scripted and unscripted television and digital entertainment. Reveille's scripted entertainment programming includes \"The Office\" (NBC), \"Ugly Betty\" (ABC), \"The Tudors\" (Showtime), and many more.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc2NDYxODE0MV5BMl5BanBnXkFtZTcwOTk1NTk5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1442928","name":"Bobb'e J. Thompson","idIMDB":"nm1442928"},"actorId":"nm1442928","character":"Tupac","urlCharacter":"http://www.imdb.com/character/ch0146182","main":true},{"actorName":"Dee Freeman","urlProfile":"http://www.imdb.com/name/nm0293360","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzNjQ2NDg2Nl5BMl5BanBnXkFtZTgwNzcxMDcwMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Dee Freeman is an actress and writer, known for Shameless (2011), Pretty the Series (2010) and Urban Teach Now (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzNjQ2NDg2Nl5BMl5BanBnXkFtZTgwNzcxMDcwMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0293360","name":"Dee Freeman","idIMDB":"nm0293360"},"actorId":"nm0293360","character":"Peaches","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Randy Sklar","urlProfile":"http://www.imdb.com/name/nm0804460","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzgxOTUyOTM0M15BMl5BanBnXkFtZTcwMTUxMTAyMw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 January 1972","placeOfBirth":" Saint Louis, Missouri, USA","height":"5' 9\" (1.75 m)","bio":"Randy Sklar was born on January 12, 1972 in Saint Louis, Missouri, USA. He is an actor and writer, known for Wild Hogs (2007), Bubble Boy (2001) and Rome Is Burning (2003). He is married to Amy Sklar. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzgxOTUyOTM0M15BMl5BanBnXkFtZTcwMTUxMTAyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0804460","name":"Randy Sklar","idIMDB":"nm0804460"},"actorId":"nm0804460","character":"Brotha Stylz #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Sklar","urlProfile":"http://www.imdb.com/name/nm0804448","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5OTkzMDA0OF5BMl5BanBnXkFtZTgwOTQ3MTU0ODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 January 1972","placeOfBirth":" Saint Louis, Missouri, USA","birthName":"Jason Nathan Sklar","height":"5' 8½\" (1.74 m)","bio":"Jason Sklar was born on January 12, 1972 in Saint Louis, Missouri, USA as Jason Nathan Sklar. He is an actor and writer, known for Wild Hogs (2007), Bubble Boy (2001) and Held Up (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5OTkzMDA0OF5BMl5BanBnXkFtZTgwOTQ3MTU0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0804448","name":"Jason Sklar","idIMDB":"nm0804448"},"actorId":"nm0804448","character":"Brotha Stylz #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Naomi Gaskin","urlProfile":"http://www.imdb.com/name/nm0309144","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY2NTczMjY4Ml5BMl5BanBnXkFtZTgwMzIxMjI2MzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Naomi Gaskin is an actress, known for Exit Wounds (2001), Love Come Down (2000) and My Baby's Daddy (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY2NTczMjY4Ml5BMl5BanBnXkFtZTgwMzIxMjI2MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0309144","name":"Naomi Gaskin","idIMDB":"nm0309144"},"actorId":"nm0309144","character":"Venus","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Denis Akiyama","urlProfile":"http://www.imdb.com/name/nm0015124","urlPhoto":"","biography":{"bio":"Denis Akiyama is an actor, known for Johnny Mnemonic (1995), Resident Evil: Afterlife (2010) and Pixels (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0015124","name":"Denis Akiyama","idIMDB":"nm0015124"},"actorId":"nm0015124","character":"Cha Ching","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fred Lee","urlProfile":"http://www.imdb.com/name/nm0497283","urlPhoto":"","biography":{"dateOfBirth":"10 July 1930","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"Frederick Mon-Quong Lee","height":"5' 5\" (1.65 m)","bio":"Fred Lee was born on July 10, 1930 in Vancouver, British Columbia, Canada as Frederick Mon-Quong Lee. He is known for his work on A Christmas Story (1983), The Art of War (2000) and The Tuxedo (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0497283","name":"Fred Lee","idIMDB":"nm0497283"},"actorId":"nm0497283","character":"Grandpa Bling Bling","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wynne Pon","urlProfile":"http://www.imdb.com/name/nm1534309","urlPhoto":"","biography":{"dateOfBirth":"1932","placeOfBirth":" Vancouver, British Columbia, Canada","bio":"Wynne Pon was born in 1932 in Vancouver, British Columbia, Canada. She was an actress, known for My Baby's Daddy (2004), SRAS - Alerte au virus mondial (2005) and Wonderfalls (2004). She died on March 24, 2011 in Toronto, Ontario, Canada.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1534309","name":"Wynne Pon","idIMDB":"nm1534309"},"actorId":"nm1534309","character":"Grandma Fung-Yu","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0332712","urlIMDB":"http://www.imdb.com/title/tt0332712","business":{"budget":null,"openingWeekend":[{"money":"$7,548,819","country":"USA","day":"11","month":"01","year":"2004","remarks":"1,447 Screens"}],"gross":[{"money":"$17,321,573","country":"USA","day":"14","month":"03","year":"2004","remarks":""},{"money":"$17,313,707","country":"USA","day":"07","month":"03","year":"2004","remarks":""},{"money":"$17,293,505","country":"USA","day":"29","month":"02","year":"2004","remarks":""},{"money":"$17,256,602","country":"USA","day":"22","month":"02","year":"2004","remarks":""},{"money":"$17,215,064","country":"USA","day":"16","month":"02","year":"2004","remarks":""},{"money":"$17,086,626","country":"USA","day":"08","month":"02","year":"2004","remarks":""},{"money":"$16,773,663","country":"USA","day":"01","month":"02","year":"2004","remarks":""},{"money":"$15,644,789","country":"USA","day":"25","month":"01","year":"2004","remarks":""},{"money":"$13,174,496","country":"USA","day":"18","month":"01","year":"2004","remarks":""},{"money":"$7,548,819","country":"USA","day":"11","month":"01","year":"2004","remarks":""}],"weekendGross":[{"money":"$4,018","country":"USA","day":"14","month":"03","year":"2004","remarks":"9 Screens"},{"money":"$14,154","country":"USA","day":"07","month":"03","year":"2004","remarks":"9 Screens"},{"money":"$27,171","country":"USA","day":"29","month":"02","year":"2004","remarks":"25 Screens"},{"money":"$27,258","country":"USA","day":"22","month":"02","year":"2004","remarks":"56 Screens"},{"money":"$91,698","country":"USA","day":"16","month":"02","year":"2004","remarks":"106 Screens"},{"money":"$161,213","country":"USA","day":"08","month":"02","year":"2004","remarks":"305 Screens"},{"money":"$774,147","country":"USA","day":"01","month":"02","year":"2004","remarks":"729 Screens"},{"money":"$2,033,788","country":"USA","day":"25","month":"01","year":"2004","remarks":"1,227 Screens"},{"money":"$4,433,788","country":"USA","day":"18","month":"01","year":"2004","remarks":"1,448 Screens"},{"money":"$7,548,819","country":"USA","day":"11","month":"01","year":"2004","remarks":"1,447 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"09","month":"09","year":"2002","remarks":null},{"money":null,"country":null,"day":"04","month":"11","year":"2002","remarks":null}],"copyrightHolder":"Miramax Film Corp."},"technical":{"runtime":["1 hr 26 min (86 min) (USA)","1 hr 28 min (88 min) (Argentina)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"4.5","metascore":"23","filmingLocations":[{"location":"Philadelphia, Pennsylvania, USA"}],"rated":"PG-13","awards":[],"votes":"3,175","type":"Movie","companyCreditsSimple":[{"idCompany":"co0022594","name":"Miramax"},{"idCompany":"co0063786","name":"Brillstein-Grey Entertainment"},{"idCompany":"co0076976","name":"Immortal Entertainment"}],"keywords":{"keywords":["fatherhood","talking baby","animal costume","rapper","break up","lesbian","boxer","baby","supermarket","house party","father daughter relationship","asian american","interracial romance","interracial friendship","lamaze class","italian american","african american","animated sequence","pregnant woman","three friends","three word title","title directed by female","boxing","philadelphia pennsylvania","new baby","parenthood","pregnant woman's water breaks","baby born","giving birth","childbirth","birth","home birth","woman in labor","expectant father","expectant mother","pregnant girlfriend","interracial sex","pregnancy"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 18:28:49"}}