{"data":{"movies":[{"title":"Monica la mitraille","originalTitle":"","year":"2004","releaseDate":"20040430","directors":[{"name":"Pierre Houle","id":"nm0396524"}],"writers":[{"name":"Luc Dionne","id":"nm0227992"},{"name":"Georges-Hébert Germain","id":"nm0314456"}],"runtime":"125 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3ODg2MDQ1N15BMl5BanBnXkFtZTgwMTYzODI4MDE@._V1.jpg","countries":["Canada"],"languages":["French"],"genres":["Drama"],"plot":"The oldest daughter of an impoverished Montreal family, Monique Sparvieri vows to find a way to get out of the ghetto in which she lives. Abandoned by Michael, the love of her life, Monique finds herself alone again when her second husband, Gaston, is sentenced to ten months in prison. While many other women her age are still dreaming of Prince Charming, Monique takes her own destiny in her hands. She and her new love, Gerald Simard, plan a series of bank robberies. Intoxicated by passion and success, Monique isn't afraid of anything and she wants to make sure that her children don't experience the same miserable upbringing as she did.","simplePlot":"The oldest daughter of an impoverished Montreal family, Monique Sparvieri vows to find a way to get out of the ghetto in which she lives. Abandoned by Michael, the love of her life, Monique... ","actors":[{"actorName":"Céline Bonnier","urlProfile":"http://www.imdb.com/name/nm0095053","urlPhoto":"","biography":{"dateOfBirth":"31 August 1965","placeOfBirth":" Lévis, Québec, Canada","bio":"Born on 31st August 1965 in Lévis, a suburb to the south of Quebec City, Céline Bonnier was the youngest of eight children, six boys and two girls. The family was brought up in an exceptionally liberal, cultured environment by mother Raymonde and father Irénée, a public sector administrator and serving politician in the mid-1970s. Encouraged by her parents to develop her imaginative side, she was entertaining the neighbors to impromptu routines in the local playground from the age of seven, which is how she discovered the 'high' that persuaded her to become an actor. Music featured largely in family life; she studied it at high school in Sainte-Foy, and can play several instruments, including the transverse flute and the accordion. She and some of her brothers had a flair for art, and she still sketches as a form of self-expression and particularly appreciates the work of the great painters. But her talent for acting led her high school drama teacher to recommend that she audition for the Conservatoire de théâtre in Quebec. Graduating in 1987, she joined Jacques Lessard's Théâtre Repère, where she met Robert Lepage who invited her to play the part of Konstanz in his 1991 production of Les Plaques tectoniques in both Montreal and the UK. She settled in Montreal, joining the theatre group Momentum under artistic director Jean-Frédéric Messier, with whom she has worked steadily to the present day, lately graduating to her own productions (Cholestérol gratuit, La Fête des morts). This theatrical output is interspersed with work at home and abroad for renowned stage directors such as Denis Marleau and Brigitte Haentjens. Meanwhile her film career, commencing with a screen version of Plaques tectoniques, Les, comprises a dozen films ranging in style from art-house to popular, under directors such as Louis Saïa, Charles Binamé, Éric Canuel and Marc-André Forcier. In contrast to many of her peers, her TV career is not saturated with long-running series and soaps, as she is critical of a lot of TV output, but her recent choices of TV drama (Tag, Le dernier chapitre) have earned her several awards. She has the ability to tackle difficult and uncompromising roles and remains determinedly indifferent to the star system, frequently changing her appearance for them. Céline Bonnier has worked with Roy Dupuis as an actor on several projects, from Million Dollar Babies (1994) to, more recently, Séraphin: un homme et son péché (2002), Le dernier chapitre (2002), Monica la mitraille (2004), and Les états-Unis d'Albert (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0095053","name":"Céline Bonnier","idIMDB":"nm0095053"},"actorId":"nm0095053","character":"Monica Sparvieri","urlCharacter":"http://www.imdb.com/character/ch0392761","main":true},{"actorName":"Roy Dupuis","urlProfile":"http://www.imdb.com/name/nm0001163","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUwMjg0ODk0Ml5BMl5BanBnXkFtZTcwMjk4MTY2Mw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 April 1963","placeOfBirth":" New Liskeard, Ontario, Canada","birthName":"Roy Michael Joseph Dupuis","height":"5' 11\" (1.8 m)","bio":"Roy Dupuis was born on April 21, 1963, in New Liskeard, Ontario. He spent a significant portion of his childhood (from early infancy until he was eleven years old) in Amos, which is in a region of Québec called Abitibi. For the next three years, he lived in Kapuskasing, Ontario, where he learned to speak English. His father (now deceased) was a traveling salesman for Canada Packers, a meat company (now part of Maple Leaf Foods). His mother is a piano teacher. He has a younger brother and an older sister. When he was fourteen, after his parents divorced, his mother moved the family to Sainte-Rose, Laval, Québec (in the greater Montréal area), where he finished high school. After high school, he studied acting in Montréal, at the National Theatre School of Canada (L'École nationale de théâtre du Canada), graduating in 1986. Acting was not Roy Dupuis' first career choice. He was studying physics in high school, but seeing Ariane Mnouchkine's film Molière (1978) interested him in acting. His entry into drama school was accidental. A friend had been invited to audition for admission to the National Theatre School of Canada, but her counterpart, who had also been invited to audition, changed his mind and backed out. She asked Roy Dupuis to take his place, and he agreed to help out and went along, posing as the original candidate. Although he himself was not really the one invited to audition, he impressed the school's director so much that she invited him to apply formally for admission to the school, and he was accepted. After his graduation in 1986, and a few years of successful experience acting in the theater, in 1988, he began to be offered substantial roles in films and TV. The relative anonymity that he enjoyed during those early years ended when 80% of the population of Québec watched the enormously-popular classic period serial drama Les filles de Caleb (1990) (Emilie), turning him into a celebrity overnight and gaining him several awards for his performance as Emilie's husband, Ovila Pronovost. His next major role was as a journalist in the Canadian TV series Scoop (1992), which ran for four seasons (1991 until 1995). In 1991 Dupuis also starred in his first major film role, as the gay hustler, Yves, in Jean Beaudin's internationally acclaimed Being at Home with Claude (1992), which was Canada's official selection at the 1992 Cannes Film Festival. Other leading roles in French followed, and increasingly English language roles too, including Becker in Planète hurlante (1995), his entry into mainstream US cinema. For the next five years, from 1996 to 2000, he spent most of his time in Toronto, making the TV series Nikita (1997-2001), which was shown in more than 50 countries around the world. When the final season finished production at the end of 2000, Roy returned to Montréal, for a few months' rest, before starting work again on French-Canadian projects made closer to home. The TV mini-series Le dernier chapitre (2002), about biker gang warfare, was filmed in French and English versions simultaneously. Then he teamed up again with \"Chili's Blues\" director Charles Binamé to star as in the romantic role of Alexis Labranche, the heroine's love interest, in a remake of another period Québec classic, Séraphin: un homme et son péché (2002), which became the province's highest-grossing film. In 2003, he participated in multiple projects, combining leading roles with occasional supporting roles. In Denys Arcand's The Barbarian Invasions (2003) (The Barbarian Invasions), which has enjoyed even greater international success than Jesus of Montreal (1989), Dupuis again played a minor part as a police drug-unit detective. Released in 2004 to 2005 were six more films in which he performed. His role as Alexandre in Mémoires affectives (2004) brought him his first major film-acting awards. He recently reprised the part of French-Canadian hockey hero Maurice \"Rocket\" Richard (for the third time) in the film The Rocket (2005) directed by Charles Binamé to large acclaim. He has also completed an independent film, That Beautiful Somewhere (2006), which is based on the 1992 novel \"Loon,\" by Bill Plumstead; screened in major film festivals beginning in August 2006, it was broadcast on Canadian pay television later in 2006 and opened in April 2006. Beginning in June 2006, he began filming the film _Shake Hands with the Devil (2006)_ on location in Kigali, Rwanda, a film about the Rwandan Genocide, in which Dupuis portrays Roméo Dallaire, being based on Dallaire's autobiographical memoir, in close consultation with Dallaire. The main filming finished in Halifax, Nova Scotia, in August 2006. After being screened at the Toronto International Film Festival on September 9, 2007, and the Atlantic Film Festival on September 13, it opens on September 28, 2007. In October 2006, in Québec, he began filming Emotional Arithmetic (2007), starring alongside Gabriel Byrne, Christopher Plummer, Susan Sarandon, and Max von Sydow. The film is the closing feature for the Toronto International Film Festival on September 15, 2007. Roy Dupuis lives in the countryside outside of Montréal. While, in the past, he enjoyed sky-diving and still enjoys golf, he has become more occupied with learning to sail and renovations on his home and sailboats. For over a decade, until June 2006, he actively supported the Mira Foundation, which provides guide dogs for visually-impaired children and adults and service dogs for those with other disabilities. A few years ago, he co-founded the Rivers Foundation to protect the rivers of Canada from exploitation by hydro-electric developments, serves as its co-president, and concentrates considerable time on developing it when he is not working professionally.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUwMjg0ODk0Ml5BMl5BanBnXkFtZTcwMjk4MTY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001163","name":"Roy Dupuis","idIMDB":"nm0001163"},"actorId":"nm0001163","character":"Gérald 'Gerry' Simard","urlCharacter":"http://www.imdb.com/character/ch0392762","main":true},{"actorName":"Patrick Huard","urlProfile":"http://www.imdb.com/name/nm0399088","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NjgwOTMyNl5BMl5BanBnXkFtZTcwNDE0MTczMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 January 1969","placeOfBirth":" Montréal, Québec, Canada","bio":"Patrick Huard is an actor, comedian, filmmaker, author, emcee, director and producer. Having recently celebrated his 20 years in the business and his 40th birthday, he has an impressive record of achievements to his credit. He has appeared in 15 feature films, including La Vie après l'Amour, Nez Rouge, Sur le Seuil, Maman Last Call, Monica la Mitraille, Cadavres, Bon Cop Bad Cop (for which he co-wrote the screenplay and which became one of biggest box office successes of all time in Canada), Funkytown, Starbuck (Quebec's most popular film in 2011, distributed in more than 20 countries) and Omertà, from screenwriter and director Luc Dionne. This film revisits the cult TV series 11 years after the end of its third season. Patrick was delighted to be able to work with the likes of Michel Côté, Rachelle Lefevre, Stéphane Rousseau and René Angelil on this film. Patrick Huard loves live performance. In March 2012, he made an eagerly anticipated return to the stage with his third one-man show entitled Le Bonheur, nearly 12 years after his last solo effort. Patrick is currently touring the province with this show. Previously, he presented two highly successful two comedy shows, 18 ans et plus and Face à Face. As well, he appeared in several Juste pour rire galas and in Eric Bogosian's play Talk Radio, doing some 1,200 shows and selling hundreds of thousands of tickets across Quebec. On television, Patrick has played all kinds of characters-guy guys, bad guys and even a drag queen-in such series as Music Hall, Cover Girl, Fortier, Au Nom de la Loi and Taxi 0-22 where he spent four seasons as Rogatien, his famous irascible taxi driver. For this role, he was honoured with the Artis trophy in 2008 and 2009 in the \"actor in a comedy program\" category. The public also showed their affection for Patrick, twice selecting him for the Male Personality of the Year trophy, in 2009 and 2010. In 2012, after his return to the stage, Patrick took part in TVA's hit show Star Académie. After making his mark in the 2009 edition for his amazing ability to share his knowledge, he was pleased to reprise his role as a performance teacher on the popular program. Patrick Huard has also hosted several Juste pour rire galas, the Gala de l'ADISQ, the Soirée des Jutra, a comedy series on Radio-Canada as well as several daily radio shows. Increasingly, Patrick Huard can also be found behind the camera. He produced and directed Taxi 0-22 (four seasons on TVA), in addition to videos, commercials, a documentary for Canal D, his first feature film, Les 3 P'tits Cochons [The Three Little Pigs], the biggest box office hit in Quebec in 2007, and Filière 13. In collaboration with Vidéotron and Sid Lee, Patrick also put his remarkable creativity and versatility to work for the mobile channel Lib tv, which is celebrating its first anniversary this summer. He serves as its ambassador, program director and coproducer (with his company, Jessie Films) in addition to working as designer, producer and actor. A forum of choice for local talent, Lib tv pushes the limits of creativity and experiments with new concepts. Since June 2011, the quirky programs on the new channel have been viewed nearly one million times, via illico mobile, illico web and illico TV.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NjgwOTMyNl5BMl5BanBnXkFtZTcwNDE0MTczMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0399088","name":"Patrick Huard","idIMDB":"nm0399088"},"actorId":"nm0399088","character":"Gaston Lussier","urlCharacter":"http://www.imdb.com/character/ch0392763","main":true},{"actorName":"Frank Schorpion","urlProfile":"http://www.imdb.com/name/nm0774891","urlPhoto":"","biography":{"bio":"Frank Schorpion was born in Winnipeg, Manitoba, Canada. He is known for his work on Arrival (2016), The Day After Tomorrow (2004) and The Art of War (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0774891","name":"Frank Schorpion","idIMDB":"nm0774891"},"actorId":"nm0774891","character":"Michael Burns","urlCharacter":"http://www.imdb.com/character/ch0407842","main":true},{"actorName":"Rémy Girard","urlProfile":"http://www.imdb.com/name/nm0320721","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NDI0NjgyNV5BMl5BanBnXkFtZTYwNzA5Nzky._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1950","placeOfBirth":" Jonquière, Quebec, Canada","bio":"Rémy Girard was born on August 10, 1950 in Jonquière, Quebec, Canada. He is an actor, known for The Barbarian Invasions (2003), Incendies (2010) and Les Bougon: C'est aussi ça la vie (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NDI0NjgyNV5BMl5BanBnXkFtZTYwNzA5Nzky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0320721","name":"Rémy Girard","idIMDB":"nm0320721"},"actorId":"nm0320721","character":"Maurice Morissette","urlCharacter":"http://www.imdb.com/character/ch0407843","main":true},{"actorName":"Isabelle Blais","urlProfile":"http://www.imdb.com/name/nm0086396","urlPhoto":"","biography":{"dateOfBirth":"1975","placeOfBirth":" Trois-Rivières, Québec, Canada","bio":"Born in 1975 and raised in Trois-Rivières, Isabelle Blais graduated from Montréal's 'Conservatoire d'art Dramatique' in 1997. A big break came for her in 1999 as she landed the part of Juliette in 'Roméo et Juliette'. Since then, she has worked consistently. On stage, she played Eliza Doolittle in 'Pygmalion' (1999), Eva in 'M. Puntila et son valet Matti' (2000), Hyacinte in 'Les Fourberies de Scapin' (2001), Ophelia in 'Hamlet' (2003). She also appeared in various films and TV shows both in French and English. At the beginning of 2003, she won a Masque (Quebec's theater award) as best actress for 'Au coeur de la rose', a Jutras as supporting actress for 'Québec-Montréal' and she earned a best actress Genie nomination for 'Savage Messiah'. That same year, she went to Cannes Film Festival to support the presentation of 'Les Invasions barbares'. In addition to her acting career, Blais is also lead singer and lyricist in rock band 'Caïman Fu'. Formed in 2000, the group produced a live mini-album in 2002 and their first full-length studio album in 2003.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0086396","name":"Isabelle Blais","idIMDB":"nm0086396"},"actorId":"nm0086396","character":"Sylvana Sparvieri","urlCharacter":"http://www.imdb.com/character/ch0407844","main":true},{"actorName":"Marc Labrèche","urlProfile":"http://www.imdb.com/name/nm0479745","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmQxNmU4NGEtMTNiNy00YTNlLWJjMDktZjNiZmYyMzJiYzkxXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 November 1960","placeOfBirth":" Montréal, Québec, Canada","bio":"Marc Labrèche was born on November 20, 1960 in Montréal, Québec, Canada. He is an actor and director, known for Le coeur a ses raisons (2005), L'âge des ténèbres (2007) and Whitewash (2013). He was previously married to Fabienne Dor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmQxNmU4NGEtMTNiNy00YTNlLWJjMDktZjNiZmYyMzJiYzkxXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0479745","name":"Marc Labrèche","idIMDB":"nm0479745"},"actorId":"nm0479745","character":"Théo Sparvieri","urlCharacter":"http://www.imdb.com/character/ch0407845","main":true},{"actorName":"Mario Jean","urlProfile":"http://www.imdb.com/name/nm0419864","urlPhoto":"","biography":{"dateOfBirth":"10 February 1965","placeOfBirth":" Chicoutimi, Québec, Canada","bio":"Mario Jean was born on February 10, 1965 in Chicoutimi, Québec, Canada. He is an actor and writer, known for The Rocket (2005), Monica la mitraille (2004) and Joyeux Calvaire (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0419864","name":"Mario Jean","idIMDB":"nm0419864"},"actorId":"nm0419864","character":"Bob Simard","urlCharacter":"http://www.imdb.com/character/ch0407846","main":true},{"actorName":"Hugolin Chevrette-Landesque","urlProfile":"http://www.imdb.com/name/nm0156748","urlPhoto":"","biography":{"bio":"Hugolin Chevrette-Landesque is an actor, known for I Killed My Mother (2009), Bon Cop Bad Cop (2006) and Simon les nuages (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0156748","name":"Hugolin Chevrette-Landesque","idIMDB":"nm0156748"},"actorId":"nm0156748","character":"Mario Sparvieri","urlCharacter":"http://www.imdb.com/character/ch0392761","main":true},{"actorName":"Julien Poulin","urlProfile":"http://www.imdb.com/name/nm0693625","urlPhoto":"","biography":{"dateOfBirth":"20 April 1946","placeOfBirth":" Montréal, Québec, Canada","bio":"Julien Poulin was born on April 20, 1946 in Montréal, Québec, Canada. He is an actor and director, known for Bob Gratton, ma vie/My Life (2007), Taking Lives (2004) and Camion (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0693625","name":"Julien Poulin","idIMDB":"nm0693625"},"actorId":"nm0693625","character":"Loignon enquêteur","urlCharacter":"http://www.imdb.com/character/ch0407847","main":true},{"actorName":"Sylvain Massé","urlProfile":"http://www.imdb.com/name/nm0557577","urlPhoto":"","biography":{"bio":"Sylvain Massé is known for his work on Planète hurlante (1995), Snake Eyes (1998) and La face cachée de la lune (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0557577","name":"Sylvain Massé","idIMDB":"nm0557577"},"actorId":"nm0557577","character":"Larry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anne Casabonne","urlProfile":"http://www.imdb.com/name/nm0142683","urlPhoto":"","biography":{"bio":"Anne Casabonne is an actress, known for Unité 9 (2012), La bataille géante de boule de neige (2015) and Monica la mitraille (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0142683","name":"Anne Casabonne","idIMDB":"nm0142683"},"actorId":"nm0142683","character":"Paula","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexis Bélec","urlProfile":"http://www.imdb.com/name/nm0067704","urlPhoto":"","biography":{"bio":"Alexis Bélec is an actor, known for Maelstrom (2000), 2 Seconds (1998) and Cadavre exquis première édition (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0067704","name":"Alexis Bélec","idIMDB":"nm0067704"},"actorId":"nm0067704","character":"Maréchal","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marie-Josée Gauthier","urlProfile":"http://www.imdb.com/name/nm0310292","urlPhoto":"","biography":{"bio":"Marie-Josée Gauthier is an actress, known for The Red Violin (1998), Thirty Two Short Films About Glenn Gould (1993) and If Looks Could Kill (1991).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0310292","name":"Marie-Josée Gauthier","idIMDB":"nm0310292"},"actorId":"nm0310292","character":"Marie-Ange","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Gow","urlProfile":"http://www.imdb.com/name/nm0332900","urlPhoto":"","biography":{"bio":"David Gow is an actor and writer, known for I'm Not There. (2007), The Barbarian Invasions (2003) and The Words (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0332900","name":"David Gow","idIMDB":"nm0332900"},"actorId":"nm0332900","character":"L'Irlandais","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0385878","urlIMDB":"http://www.imdb.com/title/tt0385878","business":{"budget":{"money":"$CAD7,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 2 min (122 min) (Québec) (Canada)","2 hr 5 min (125 min) (Ontario) (Canada)"],"soundMix":null,"color":null,"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.7","filmingLocations":[{"location":"Montréal, Québec, Canada"}],"awards":[{"award":"Genie Awards 2005","titlesAwards":[{"titleAwardOutcome":"Won Genie","categories":[{"category":"Best Screenplay, Adapted","names":[{"name":"Luc Dionne","id":"nm0227992","role":null},{"name":"Sylvain Guy","id":"nm0349847","role":null}]}]},{"titleAwardOutcome":"Nominated Genie","categories":[{"category":"Best Performance by an Actress in a Leading Role","names":[{"name":"Céline Bonnier","id":"nm0095053","role":null}]},{"category":"Best Achievement in Direction","names":[{"name":"Pierre Houle","id":"nm0396524","role":null}]},{"category":"Best Achievement in Music - Original Song","names":[{"name":"Lorraine Richard","id":"nm0723845","role":null},{"name":"Michel Cusson","id":"nm0193782","role":null},{"name":"Pierre Houle","id":"nm0396524","role":null}]},{"category":"Best Achievement in Art Direction/Production Design","names":[{"name":"Michel Proulx","id":"nm0698938","role":null}]},{"category":"Best Achievement in Costume Design","names":[{"name":"Michèle Hamel","id":"nm0357551","role":null}]},{"category":"Best Achievement in Sound Editing","names":[{"name":"Marcel Pothier","id":"nm0693101","role":null},{"name":"Natalie Fleurant","id":"nm0282178","role":null},{"name":"Guy Francoeur","id":"nm0290662","role":null},{"name":"Carole Gagnon","id":"nm0300960","role":null},{"name":"Antoine Morin","id":"nm0605498","role":null}]}]}]},{"award":"Jutra Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Jutra","categories":[{"category":"Best Actrice (Meilleure Actrice)","names":[{"name":"Céline Bonnier","id":"nm0095053","role":null}]},{"category":"Best Art Direction (Meilleure Direction Artistique)","names":[{"name":"Michel Proulx","id":"nm0698938","role":null}]},{"category":"Best Costume Design (Meilleurs Costumes)","names":[{"name":"Michèle Hamel","id":"nm0357551","role":null}]},{"category":"Best Hairstyling (Meilleure Coiffure)","names":[{"name":"Denis Parent","id":"nm1362718","role":null}]}]}]}],"votes":"438","type":"Movie","companyCreditsSimple":[{"idCompany":"co0030496","name":"Cité-Amérique"}],"keywords":{"keywords":["neo noir"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:48:51"}}