{"data":{"movies":[{"title":"Prisoner","originalTitle":"","year":"2007","releaseDate":"20070414","directors":[{"name":"David Alford","id":"nm0019207"},{"name":"Robert Archer Lynn","id":"nm1032297"}],"writers":[{"name":"David Alford","id":"nm0019207"},{"name":"Robert Archer Lynn","id":"nm1032297"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNDAxMzgyM15BMl5BanBnXkFtZTcwNTYyODk5Mg@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Thriller"],"plot":"Notorious Hollywood bad boy Darek Playto is captured by a mysterious Jailer while scouting a decrepit, abandoned prison for an upcoming film. Playto is a volatile visionary whose controversial reputation has earned him more than his fair share of enemies in the entertainment industry. In preparation for his upcoming feature film - a violent prison drama - Playto sets out to find the perfect surroundings in which to tell his brutal tale. Upon discovering a dilapidated prison that was once a notorious house of pain, it appears that Playto has found just such a location. But Playto isn't alone in this crumbling penitentiary, and upon being captured by the Jailer the director's only hope for escape is to answer a series of increasingly intimate questions concerning his art and his life.","simplePlot":"A Hollywood director is taken prisoner while scouting a remote prison.","actors":[{"actorName":"Julian McMahon","urlProfile":"http://www.imdb.com/name/nm0573037","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3Mzc2ODEyMF5BMl5BanBnXkFtZTYwODkwNTA0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 July 1968","placeOfBirth":" Sydney, New South Wales, Australia","birthName":"Julian Dana William McMahon","height":"6' 2½\" (1.89 m)","bio":"Julian Dana William McMahon was born in Sydney, Australia, the second of three children of Lady Sonia McMahon (née Sonia Rachel Hopkins) and Sir Billy McMahon, the longest continuously serving government minister in Australian history, serving over 21 years as a government minister before serving as Prime Minister of Australia from March 1971 to December 1972. Sir Billy died March 31, 1988, age 80, four months before Julian's 20th birthday, and Julian's mother, Lady (Sonia) McMahon, died of cancer, three days after the 22nd anniversary of her husband's passing, in Sydney, on April 2, 2010, age 77, with Julian and his two sisters at her bedside. Julian is of Irish and English descent. Julian started a Bachelor of Arts degree at the University of Wollongong, but after more time spent in the University bar than at classes, he became bored after one year and began a career in modeling, working primarily in commercials. In 1987, he began print modeling assignments in Los Angeles, New York, Milan, Rome and Paris. His appearance in a TV commercial promoting jeans in his home country made him popular enough to be cast as the lead in The Power, the Passion (1989), an Australian \"Dynasty\"-like series. After 18 months on \"The Power, The Passion,\" Julian then joined the cast of Summer Bay (1988), another successful Australian series, where he won a best actor award from a national magazine. McMahon later performed on stage, appearing in a musical version of \"Home and Away\" in Britain as well as in \"Love Letters\" in Sydney and Melbourne. After a lead role in the feature film Wet and Wild Summer! (1992) with Elliott Gould, he moved to Hollywood so that he could read for more American projects. In 1992, he was cast as Ian Rain on NBC's daytime drama Another World (1964). He left \"Another World\" after two years, in order to expand his range and experience, appearing in several Los Angeles stage productions. He also appeared in the feature film Magenta (1997) before landing the role of Agent John Grant on Profiler (1996) for four seasons, . In his free time, McMahon enjoys surfing, biking, and cooking. He is a fan of baseball, American football and basketball, and he collects classic books.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3Mzc2ODEyMF5BMl5BanBnXkFtZTYwODkwNTA0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0573037","name":"Julian McMahon","idIMDB":"nm0573037"},"actorId":"nm0573037","character":"Derek Plato","urlCharacter":"http://www.imdb.com/character/ch0040290","main":true},{"actorName":"Elias Koteas","urlProfile":"http://www.imdb.com/name/nm0000480","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEwMTEzODkzNF5BMl5BanBnXkFtZTcwMjI1NDAyMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 March 1961","placeOfBirth":" Montréal, Québec, Canada","height":"5' 10½\" (1.79 m)","bio":"Elias Koteas was born on March 11, 1961, in Montreal, Canada. Both his parents are of Greek descent. Elias attended Vanier College in Montreal before leaving to attend the American Academy of Dramatic Arts in New York City in 1981, of which he is a graduate. He also attended the Actors Studio in New York City, where he studied acting under Ellen Burstyn and Peter Masterson. His film debut was in One Magic Christmas (1985). He has also appeared on stage in \"Kiss of the Spider Woman,\" \"Death of a Salesman,\" \"Bent\" and \"The Cherry Orchard.\" In 1989 he was nominated for a Genie (Canada's Academy Award) for best actor in Malarek (1988), a true story in which he plays a troubled street-kid-turned reporter for a Canadian newspaper. A somewhat of a breakthrough role for Elias happened in 1990, when he got the role of vigilante Casey Jones in Teenage Mutant Ninja Turtles (1990) and its sequels. He is one of Canada's most popular actors and frequently appears in films by Canadian directors Atom Egoyan and David Cronenberg. It was Cronenberg's controversial movie Crash (1996) that had Cannes all abuzz in 1996. Elias played Vaughan, a self-appointed \"mad scientist\" with an unusual fetish--sexual delight in car crashes! The past two years have been busy ones for Koteas, adding six more roles to his resume. As Capt. James Staros, the commanding officer of Charlie Company in The Thin Red Line (1998), he brought sensitivity and compassion to his portrayal of a man who cared about the safety of his men--even at the risk of his own career. In 2000 he appeared in Lost Souls (2000), a thriller starring Winona Ryder, and starred on Broadway with Josh Brolin in the Sam Shepard play \"True West.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEwMTEzODkzNF5BMl5BanBnXkFtZTcwMjI1NDAyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000480","name":"Elias Koteas","idIMDB":"nm0000480"},"actorId":"nm0000480","character":"Jailer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dagmara Dominczyk","urlProfile":"http://www.imdb.com/name/nm0231436","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzOTMzMTg5NV5BMl5BanBnXkFtZTYwODIzMDEz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 July 1976","placeOfBirth":" Kielce, Swietokrzyskie, Poland","height":"5' 6\" (1.68 m)","bio":"Dagmara Dominczyk was born on July 17, 1976 in Kielce, Swietokrzyskie, Poland. She is an actress, known for The Count of Monte Cristo (2002), The Immigrant (2013) and Kinsey (2004). She has been married to Patrick Wilson since June 18, 2005. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzOTMzMTg5NV5BMl5BanBnXkFtZTYwODIzMDEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0231436","name":"Dagmara Dominczyk","idIMDB":"nm0231436"},"actorId":"nm0231436","character":"Olivia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Guiry","urlProfile":"http://www.imdb.com/name/nm0347509","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0Mzk4NTI4OV5BMl5BanBnXkFtZTYwMjI5NDY3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 October 1981","placeOfBirth":" Trenton, New Jersey, USA","birthName":"Thomas John Guiry","height":"5' 8\" (1.73 m)","bio":"Thomas Guiry was born October 12, 1981, in Trenton, New Jersey. His acting debut in a movie was in The Sandlot (1993), in 1993, when he was 11. This led to other films such as Lassie (1994), The Last Home Run (1996), Wrestling with Alligators (1998), Black Hawk Down (2001), and Justice (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0Mzk4NTI4OV5BMl5BanBnXkFtZTYwMjI5NDY3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0347509","name":"Tom Guiry","idIMDB":"nm0347509"},"actorId":"nm0347509","character":"Bob","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Alford","urlProfile":"http://www.imdb.com/name/nm0019207","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTExMTQyNTY2N15BMl5BanBnXkFtZTgwNTA1OTQzNjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 December 1964","placeOfBirth":" Nashville, Tennessee, USA","bio":"David Alford was born in Nashville and raised on his family farm in Adams, Tennessee. His father Ben Robert was a farmer and Methodist Minister. David graduated in a class of 49 students from nearby Jo Byrns High School. He attended his father's alma mater Martin Methodist College and then Austin Peay State University before training at The Juilliard School in New York from 1987-1991. David returned to Nashville in 1994 to found Mockingbird Theatre, which he served as Artistic Director until closing the company in 2004. He was Executive Artistic Director of Tennessee Repertory Theatre in Nashville from 2004-2006, and served as the company's first Artist-in-Residence the following year. David's passion for theatre and his rural roots led him to write, direct, and produce two theatre productions based on the history of his hometown, both of which are staged annually in Adams. His compilation of his father's writing, DANCE OF THE HOLY NOBODIES, was published by Martin Methodist College where he designed and taught a new Dramatic Arts Major from 2009-2014. He has two sons by his first wife. He and his second wife Kahle Alford split their time between New York and Tennessee.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTExMTQyNTY2N15BMl5BanBnXkFtZTgwNTA1OTQzNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0019207","name":"David Alford","idIMDB":"nm0019207"},"actorId":"nm0019207","character":"Principal Hamm","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rocky Carroll","urlProfile":"http://www.imdb.com/name/nm0140969","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwODg0OTA1MF5BMl5BanBnXkFtZTcwNTIwNjk1Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1963","placeOfBirth":" Cincinnati, Ohio, USA","birthName":"Roscoe Fulton Carroll","height":"5' 10\" (1.78 m)","bio":"A classically-trained actor with a deeply-rooted seed in theatre, Rocky Carroll has solidified his career in cinema, stage and television with varied and impressive performances. Born in Cincinnati, Ohio, as Roscoe Carroll, he attended the prestigious School for Creative and Performing Arts, graduating in 1981 at age 18. Pursuing an interest to expand his knowledge in acting, he went on to attend The Conservatory of Theatre Arts at Webster University in St. Louis. For his efforts he earned a BFA. Finally he decided to move to New York to test his acting mettle and started out doing Shakespeare. He graduated to television work after proving himself on the stage, appearing in such series as Chicago Hope (1994), Law & Order (1990), The Game (2006), Boston Legal (2004) and The West Wing (1999). It could be said that his most notable and perhaps breakthrough role, however, came when he was cast as Assisant Director Leon Vance on NCIS (2003). It was a role that reunited him with his \"Chicago Hope\" cast mate Mark Harmon. His character Vance would later be promoted to Director of NCIS after the death of Director Jenny Shepard, played by Lauren Holly. In 2009, he appeared in a spin-off of the series, NCIS: Los Angeles (2009), joining the process of establishing the Los Angeles-based NCIS office.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwODg0OTA1MF5BMl5BanBnXkFtZTcwNTIwNjk1Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0140969","name":"Rocky Carroll","idIMDB":"nm0140969"},"actorId":"nm0140969","character":"Studio Executive","urlCharacter":"http://www.imdb.com/character/ch0349744","main":true},{"actorName":"David Marshall","urlProfile":"http://www.imdb.com/name/nm1917726","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjI1MDE4OTAzNl5BMl5BanBnXkFtZTcwMzA2NTAzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1996","placeOfBirth":" Reno, Nevada, USA","bio":"David first lived in Plumas County, California. He moved to the Nashville area when he was five. An Elvis fan, he quickly convinced his parents to take him to Graceland. Now a fan of Julian McMahon, he hopes to visit Australia soon. In the meantime he enjoys riding his mini-motorcycle, arguing with his sister and trying to run a faster mile.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjI1MDE4OTAzNl5BMl5BanBnXkFtZTcwMzA2NTAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1917726","name":"David Marshall","idIMDB":"nm1917726"},"actorId":"nm1917726","character":"Young Derek","urlCharacter":"http://www.imdb.com/character/ch0040290","main":true},{"actorName":"Kim Raver","urlProfile":"http://www.imdb.com/name/nm0005339","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyMzg2NjM4NF5BMl5BanBnXkFtZTcwNDMzNjM0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 March 1969","placeOfBirth":" New York City, New York, USA","birthName":"Kimberly Jayne Raver","height":"5' 8\" (1.73 m)","bio":"Kim Raver was born on March 15, 1969 in New York City, New York, USA as Kimberly Jayne Raver. She is an actress and producer, known for 24 (2001), Night at the Museum (2006) and Third Watch (1999). She has been married to Manu Boyer since July 2000. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyMzg2NjM4NF5BMl5BanBnXkFtZTcwNDMzNjM0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005339","name":"Kim Raver","nicknames":["Kimmy"],"idIMDB":"nm0005339"},"actorId":"nm0005339","character":"Renee","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0460909","urlIMDB":"http://www.imdb.com/title/tt0460909","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 34 min (94 min) (Greece)","1 hr 35 min (95 min) (Argentina)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.0","filmingLocations":[{"location":"Tennessee, USA"}],"awards":[],"votes":"413","type":"Movie","companyCreditsSimple":[{"idCompany":"co0044390","name":"Fresh Produce Films"}],"keywords":{"keywords":["prison","director"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:21:51"}}