{"data":{"movies":[{"title":"The Astronaut Farmer","originalTitle":"","year":"2006","releaseDate":"20070223","directors":[{"name":"Michael Polish","id":"nm0689187"}],"writers":[{"name":"Mark Polish","id":"nm0689185"},{"name":"Michael Polish","id":"nm0689187"}],"runtime":"104 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NzkwMzA4NF5BMl5BanBnXkFtZTcwNDc0ODU0MQ@@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Adventure","Drama","Sci-Fi"],"plot":"Texan Charles Farmer left the Air Force as a young man to save the family ranch when his dad died. Like most American ranchers, he owes his bank. Unlike most, he's an astrophysicist with a rocket in his barn - one he's built and wants to take into space. It's his dream. The FBI puts him under surveillance when he tries to buy rocket fuel; the FAA stalls him when he files a flight plan - it's post-9/11, after all. His wife is angry when she finds out their bank is initiating foreclosure. Charlie fears failure and decides, precipitously, to launch. Are twenty-first century American dreams just a sign of insanity? Are those who believe in dreamers only fools?","simplePlot":"A NASA astronaut (Thornton), forced to retire years earlier so he could save his family farm, has never given up his dream of space travel and looks to build his own rocket, despite the government's threats to stop him.","actors":[{"actorName":"Billy Bob Thornton","urlProfile":"http://www.imdb.com/name/nm0000671","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxOTUwMDI0OF5BMl5BanBnXkFtZTcwNjIyNzkzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 August 1955","placeOfBirth":" Hot Springs, Arkansas, USA","birthName":"William Robert Thornton","height":"5' 10\" (1.78 m)","bio":"Billy Bob Thornton was born on August 4, 1955 in Hot Springs, Arkansas, to Virginia Roberta (Faulkner), a psychic, and William Raymond (Billy Ray) Thornton, an educator, high school history teacher, and basketball coach (now deceased). He is the older brother of James Donald (Jimmy Don) (born in 1958 and now deceased) and John David (born in 1969). He has been married six times and has four children: daughter Amanda Brumfield, with Melissa Lee Gatlin (now Parish); sons William and Harry, both with Pietra Dawn Cherniak; and daughter Bella with Connie Angland. Billy Bob began his artistic career as a musician, playing drums and singing in a band called Tres Hombres, which once opened for Hank Williams Jr.. In 1981, he moved to Los Angeles with childhood friend Tom Epperson to pursue an acting and writing career. On the side, Billy Bob also sought work as a singer and drummer. He and Epperson tried for years to sell their scripts but no one was buying. During those rough times, Billy Bob neglected his health and subsequently landed in the hospital with heart problems due to malnutrition. In 1992, Billy Bob starred in One False Move (1992), a movie he co-wrote with Epperson. The team finally received attention because of this work, which was very well received in Hollywood. His popularity increased steadily, especially after Sling Blade (1996) which he wrote, directed and in which he starred.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxOTUwMDI0OF5BMl5BanBnXkFtZTcwNjIyNzkzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000671","name":"Billy Bob Thornton","idIMDB":"nm0000671"},"actorId":"nm0000671","character":"Charles Farmer","urlCharacter":"http://www.imdb.com/character/ch0022833","main":true},{"actorName":"Virginia Madsen","urlProfile":"http://www.imdb.com/name/nm0000515","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUyMDcxNTU3N15BMl5BanBnXkFtZTcwMDAwNjQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1961","placeOfBirth":" Chicago, Illinois, USA","height":"5' 5\" (1.65 m)","bio":"One of the hottest stars of the mid-1980s, Virginia Madsen has since played a variety of roles that have cemented her reputation as a fantastic actress who can adapt to any part. Virginia was born in Chicago, Illinois, and belongs to an acting family -- with her brother, Michael Madsen, also an actor, and her mother, Elaine Madsen (née Melson), an Emmy-winning writer, poet, and producer. Her paternal grandparents were Danish, and her father, Calvin Madsen, was a firefighter. Audiences first caught a glimpse of her as \"Princess Irulan\" in the 1984 science fiction epic Dune (1984). She followed that up with Electric Dreams (1984); however, it was in 1986 that Virginia captured the hearts of the audience with an intense portrayal of a Catholic school girl who fell in love with a boy from a prison camp in Duncan Gibbins' Fire with Fire (1986). Virginia played the role of \"Lisa\" and her co-star was Craig Sheffer, who played Lisa's love interest, \"Joe Fisk\". Kari Wuhrer also made an appearance as Virginia's best friend, \"Gloria\". Fire with Fire (1986) was a low-budget production, starring a bunch of fresh faces who were till then-unknown to Hollywood. However, the movie was a success and elevated its three young stars overnight. Virginia has never looked back since. Not only did she receive amazing reviews for her Academy Award and Golden Globe nominated performance in Alexander Payne's hit film, Sideways (2004), but this Independent Spirit Award-winning actress has an illustrious resume of roles alongside the most notable and respected actors in the business. Also on Virginia's slate is her production company, with partner Karly Meola, called \"Title IX Productions\". Their first project was the documentary I Know a Woman Like That (2009), which previewed at the Phoenix Film Festival in April 2009 and premiered at the Chicago Film Festival in October 2009. The doc was directed by Virginia's mother, Elaine Madsen, about the lives of extraordinary women ages 64-94. Next in the company's lineup is the documentary Fighting Gravity (2010), about women ski jumpers' ongoing battle for the right to compete in the 2010 Winter Olympics. Title IX will team up with \"Empire 8 Productions\" and Vancouver-based \"Screen Siren\" on the project. The duo also has several projects in development that they're shopping around for financing including screenwriters Sebastian Gutierrez's screen adaptation of Martha O'Connor's novel \"The Bitch Posse\" and a remake of the 1984 film Electric Dreams (1984), in which Virginia appeared.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUyMDcxNTU3N15BMl5BanBnXkFtZTcwMDAwNjQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000515","name":"Virginia Madsen","nicknames":["Gina"],"idIMDB":"nm0000515"},"actorId":"nm0000515","character":"Audrey 'Audie' Farmer","urlCharacter":"http://www.imdb.com/character/ch0022834","main":true},{"actorName":"Max Thieriot","urlProfile":"http://www.imdb.com/name/nm1302735","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MTIzNDAwMV5BMl5BanBnXkFtZTgwNzY5OTgzMzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 October 1988","placeOfBirth":" Los Altos Hills, California, USA","birthName":"Maximillion Drake Thieriot","height":"5' 11\" (1.8 m)","bio":"Max Thieriot was born in 1988 in Los Altos Hills, California, and has two siblings. He was raised in Occidental, CA, and graduated from Sonoma Country Day School in 2002 and El Molino High School in 2006. He started acting when he took an improvisation class and modeled for GAP. He was also in two short films before making his big-screen debut in Catch That Kid (2004), opposite Kristen Stewart and Corbin Bleu. Max had a big role as one of the children protected by Vin Diesel's character in the hit comedy Baby-sittor (2005), and played the son of the title character in The Astronaut Farmer (2006). In the summer of 2007, he co-starred opposite Emma Roberts in Nancy Drew (2007), as Nancy's friend Ned Nickerson, and in 2008 played the younger version of Hayden Christensen's lead in Jumper (2008), as well as a 1930s hobo, Will Shepherd, in Kit Kittredge: An American Girl (2008). Max's early 2010s roles included Michael Stewart, the son of Julianne Moore's character, in the dramatic thriller Chloe (2009), and the lead role in Wes Craven's horror thriller My Soul to Take (2010). He also co-starred as the male lead, opposite Jennifer Lawrence, in another horror film, La maison au bout de la rue (2012). Max made his television series debut playing Norman Bates (Freddie Highmore)'s brother, Dylan Massett, on the A&E show Bates Motel (2013), which began its run in 2013. Max also plays Jack Hays in the History Channel mini-series Texas Rising (2015). In 2013, Max married Lexi Murphy, his long-time girlfriend. Max is the great-great grandson of Michael Henry de Young, who co-founded the San Francisco Chronicle in 1865. His father is from California and his mother is from Minnesota. Max is of German, English, Norwegian, Danish, Irish, Dutch Jewish, French Jewish, Scottish, and Northern Irish ancestry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MTIzNDAwMV5BMl5BanBnXkFtZTgwNzY5OTgzMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1302735","name":"Max Thieriot","nicknames":["Maxi"],"idIMDB":"nm1302735"},"actorId":"nm1302735","character":"Shepard Farmer","urlCharacter":"http://www.imdb.com/character/ch0022836","main":true},{"actorName":"Jasper Polish","urlProfile":"http://www.imdb.com/name/nm2523928","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMjYwNzM4MF5BMl5BanBnXkFtZTgwNTMxNzE0MTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 December 1997","placeOfBirth":" Los Angeles, California, USA","bio":"Jasper Polish was born on December 14, 1997 in Los Angeles, California, USA. She is an actress, known for The Astronaut Farmer (2006), Big Sur (2013) and Some Kind of Hate (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMjYwNzM4MF5BMl5BanBnXkFtZTgwNTMxNzE0MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2523928","name":"Jasper Polish","idIMDB":"nm2523928"},"actorId":"nm2523928","character":"Stanley Farmer","urlCharacter":"http://www.imdb.com/character/ch0166340","main":true},{"actorName":"Logan Polish","urlProfile":"http://www.imdb.com/name/nm2523920","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNDA2NjM3NF5BMl5BanBnXkFtZTgwODc1MDY3NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Logan Polish is an actress, known for The Astronaut Farmer (2006), For Lovers Only (2011) and Headlock (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNDA2NjM3NF5BMl5BanBnXkFtZTgwODc1MDY3NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2523920","name":"Logan Polish","idIMDB":"nm2523920"},"actorId":"nm2523920","character":"Sunshine Farmer","urlCharacter":"http://www.imdb.com/character/ch0166341","main":true},{"actorName":"Bruce Dern","urlProfile":"http://www.imdb.com/name/nm0001136","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMDE0MzAzOV5BMl5BanBnXkFtZTYwODQxMDQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1936","placeOfBirth":" Chicago, Illinois, USA","birthName":"Bruce MacLeish Dern","height":"6' (1.83 m)","bio":"Bruce Dern was born in Chicago, Illinois, to Jean (MacLeish) and John Dern, an attorney and utility chief. His paternal grandfather, George Henry Dern, served as Governor of Utah (1925-1933) and then U.S. Secretary of War (1933-1936). His ancestry includes German, English, Scottish, and Dutch. Bruce Dern had established himself as the movies' premier heavy, playing sociopaths, psychotics and just plain criminals by the time he was nominated for an Academy Award for Best Supporting Actor for Coming Home (1978). Some perceptive critics had noted that Dern was a finer actor than his roles generally allowed one to believe, repelled as one was by the neurotic persona that Dern was able to project and that casting directors capitalized on. Jack Nicholson, a close friend, claimed that Dern was the best of the new breed of actors who had been born just before World War II and were coming into their own in the 1970s. Unlike his screen image, Dern had come from a patrician background: his grandfather had been governor of Utah and a secretary of war under Franklin D. Roosevelt. When allowed to step out of his on-screen persona to assay the millionaire Tom Buchanan in the 1974 remake of The Great Gatsby (1974), he acquitted himself quite well. Some critics said that \"Gatsby\" would have been better if Dern rather than Robert Redford had played the title role. Others pointed to his fine work as Nicholson's brother in The King of Marvin Gardens (1972) to establish a case that he was an underappreciated and underutilized talent. By the time Dern appeared as the cuckolded Marine in \"Coming Home,\" a consensus had emerged that Dern was a fine actor. He won an Oscar nod for the role, then fell victim to the infamous \"Oscar curse\" that has claimed other winners, most famously in the case of 1969 Best Supporting Actor winner Gig Young, Dern's co-star in They Shoot Horses, Don't They? (1969). Dern, like Young before him, was determined to break out of supporting roles. Like Young, who had been cast repeatedly as a light comedian in his career, Dern had also become typecast, but as a psycho, surpassing even Anthony Perkins in those types of roles. Dern was determined to break out of the ghetto he had found himself in before \"Coming Home.\" He failed, and his career suffered. Up through his Oscar nomination, Dern had starred in 26 films in 11 years since graduating to steady employment in A-pictures with Waterhole #3 (1967). After the 1979 Oscar nod, he would appear in only a dozen feature films in the next 11 years, not counting TV movies. None of them brought him stardom or much acclaim, and his attempt at becoming a lead man, Middle Age Crazy (1980), flopped badly (he did received a nomination for Best Performance by a Foreign Actor at the 1981 Genie Awards, the Canadian equivalent of the Oscars, for his work in that picture). It was back to psychos, this time as a lead, in Tattoo (1981). The movie proved to be another flop, and his reputation was further damaged when he bragged that he had actually performed on-screen sexual intercourse with co-star Maud Adams, a boast that Adams heatedly denied. Dern's star was seriously dimmed. Although he landed a coveted role in the film adaptation of Jason Miller's Pulitzer Prize-winning play That Championship Season (1982), the film was a disappointment with critics and at the box office. He turned in a fine performance three years later in the TV movie Toughlove (1985), but overall, his career was floundering. Another psycho role, that of Uncle Bud in After Dark, My Sweet (1990), started buzz about another possible Best Supporting Oscar nod for him, but the film proved a box-office bust and the nomination never materialized. A predicted career renaissance for Dern faded, just as the careers of his ex-wife, Diane Ladd, and their daughter, Laura Dern, kicked into high gear. Since the 1990 high point of the second wave of his career, Dern has stayed steadily employed, but has never again generated much critical acclaim, nor made any inroads towards reclaiming his crown as the cinema's premier sociopath. A fine actor, who will be remembered most vividly for such psycho/killer roles such as the rustler leader who gunned down John Wayne in The Cowboys (1972), Dern's career serves as a cautionary tale for those actors who try to escape the ghetto of typecasting. While nothing restricts an actor's artistic development as much as typecasting, unless like a Duke Wayne they can turn that type into superstardom, trying to break out of the type can prove to be career suicide.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMDE0MzAzOV5BMl5BanBnXkFtZTYwODQxMDQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001136","name":"Bruce Dern","idIMDB":"nm0001136"},"actorId":"nm0001136","character":"Hal","urlCharacter":"http://www.imdb.com/character/ch0143808","main":true},{"actorName":"Mark Polish","urlProfile":"http://www.imdb.com/name/nm0689185","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4MjkyMDM5NF5BMl5BanBnXkFtZTcwMTg4OTk1MQ@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 October 1970","placeOfBirth":" El Centro, California, USA","bio":"Mark Polish was born on October 30, 1970 in El Centro, California, USA. He is an actor and writer, known for Twin Falls Idaho (1999), The Astronaut Farmer (2006) and Northfork (2003). He is married to Wendy Polish. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4MjkyMDM5NF5BMl5BanBnXkFtZTcwMTg4OTk1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0689185","name":"Mark Polish","idIMDB":"nm0689185"},"actorId":"nm0689185","character":"FBI Agent Mathis","urlCharacter":"http://www.imdb.com/character/ch0022838","main":true},{"actorName":"Jon Gries","urlProfile":"http://www.imdb.com/name/nm0340973","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NTkwNjg0NV5BMl5BanBnXkFtZTYwNzg2Njc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 June 1957","placeOfBirth":" Glendale, California, USA","birthName":"Jonathan Francis Gries","height":"5' 11\" (1.8 m)","bio":"Jon Gries was born on June 17, 1957 in Glendale, California, USA as Jonathan Francis Gries. He is an actor, known for Taken (2008), Napoleon Dynamite (2004) and Men in Black (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NTkwNjg0NV5BMl5BanBnXkFtZTYwNzg2Njc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0340973","name":"Jon Gries","idIMDB":"nm0340973"},"actorId":"nm0340973","character":"FBI Agent Killbourne","urlCharacter":"http://www.imdb.com/character/ch0022835","main":true},{"actorName":"Tim Blake Nelson","urlProfile":"http://www.imdb.com/name/nm0625789","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0ODkwNjM5M15BMl5BanBnXkFtZTcwNzQ3NjgyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 May 1964","placeOfBirth":" Tulsa, Oklahoma, USA","height":"5' 5\" (1.65 m)","bio":"Tim Blake Nelson was born on May 11, 1964 in Tulsa, Oklahoma, USA. He is an actor and director, known for O Brother, Where Art Thou? (2000), The Incredible Hulk (2008) and Lincoln (2012). He has been married to Lisa Benavides-Nelson since 1994. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0ODkwNjM5M15BMl5BanBnXkFtZTcwNzQ3NjgyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0625789","name":"Tim Blake Nelson","idIMDB":"nm0625789"},"actorId":"nm0625789","character":"Kevin Munchak","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sal Lopez","urlProfile":"http://www.imdb.com/name/nm0520199","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzE4ODk1NTMxNV5BMl5BanBnXkFtZTgwNTM4MDgxMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 November 1954","placeOfBirth":"","height":"5' 7\" (1.7 m)","bio":"Sal Lopez was born on November 8, 1954. He is known for his work on Full Metal Jacket (1987), Port Charles (1997) and American Me (1992).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzE4ODk1NTMxNV5BMl5BanBnXkFtZTgwNTM4MDgxMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0520199","name":"Sal Lopez","idIMDB":"nm0520199"},"actorId":"nm0520199","character":"Pepe Garcia","urlCharacter":"http://www.imdb.com/character/ch0022837","main":true},{"actorName":"J.K. Simmons","urlProfile":"http://www.imdb.com/name/nm0799777","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg2NTI5NzQ1MV5BMl5BanBnXkFtZTgwNjI1NDEwMDI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 January 1955","placeOfBirth":" Detroit, Michigan, USA","birthName":"Jonathan Kimble Simmons","height":"5' 10¾\" (1.8 m)","bio":"J.K. Simmons is an American actor. He was born Jonathan Kimble Simmons in Grosse Pointe, Michigan, to Patricia (Kimble), an administrator, and Donald William Simmons, a music teacher. He attended the Ohio State University, Columbus, OH; University of Montana, Missoula, MT (BA in Music). He had originally planned to be a singer and studied at the University of Montana to become a composer. He starred as Captain Hook and Mr. Darling opposite gymnastics champ Cathy Rigby in the Broadway and touring revivals of Peter Pan. He played Benny South-street in the 1992 Broadway revival of Guys and Dolls and can be heard on the cast recording. He did a commercial voice-over work, including the voice of the yellow M&M in the candy's TV ads. He appeared as police psychiatrist Emil Skoda on Law & Order (1990), Law & Order: Special Victims Unit (1999) and Law & Order: Criminal Intent (2001). As of 2011, has made five films with director Sam Raimi: For Love of the Game (1999); The Gift (2000); Spider-Man (2002); Spider-Man 2 (2004); and Spider-Man 3 (2007). He won many awards from 2005 to 2007 in Screen Actors Guild Awards. In 2014 won Oscar for Best Performance by an Actor in a Supporting Role. 2015 won a Golden Globe for his Best Performance as an Actor in a Supporting Role in a Motion Picture, BAFTA Film Awards Best Supporting Actor, Independent Spirit Awards Best Supporting Male.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg2NTI5NzQ1MV5BMl5BanBnXkFtZTgwNjI1NDEwMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0799777","name":"J.K. Simmons","idIMDB":"nm0799777"},"actorId":"nm0799777","character":"Jacobson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kiersten Warren","urlProfile":"http://www.imdb.com/name/nm0912916","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwOTY5ODExNF5BMl5BanBnXkFtZTYwMjExMDAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 November 1965","placeOfBirth":" Iowa, USA","birthName":"Kiersten Nicolla Dale Warren","bio":"Kiersten Nicolla Dale Warren was born on November 4, 1965 in Iowa. The daughter of Southern Baptist missionaries, Kiersten performed in churches everywhere from Mexico to Manila. Though signing Bibles like a rock star was exhilarating, she eventually sought the spotlight of a secular stage. After modeling for four years in Tokyo for the likes of Kanebo Cosmetics, Fuji Film and Mr. Donut (formerly Happy Fun Sunshine Donut), Kiersten set her sights on acting. Starting with her on-screen debut in 1987, opposite Tom Selleck, in the Magnum, P.I. (1980) episode, Magnum, P.I.: The Aunt Who Came to Dinner (1987), Kiersten has worked with such stars as Faye Dunaway (Silhouette (1990)), John Cusack (Pushing Tin (1999)), Paul Giamatti (Duets (2000)), Ashley Judd (Divine Secrets of the Ya-Ya Sisterhood (2002)), Bruce Willis (The Astronaut Farmer (2006)), Marcia Gay Harden (Thomas Kinkade's Christmas Cottage (2008)), Peter O'Toole (Thomas Kinkade's Christmas Cottage (2008)) and the incomparable Bob Golic (Saved by the Bell: The College Years (1993)), whose acting advice to her was, \"When you tackle someone aim for the knees. It might end their career.\" Kiersten was nominated for a SAG award for Best Ensemble Cast. In 2006, her fragile/ferocious portrayal as Nora Huntington, the homewrecking, pot-stirring single mother on Desperate Housewives (2004), who saw the business end of a tragedy in the episode \"Bang\", helped bring in the highest ratings in the series' history since its premiere. In real life, Kiersten is a homemaking, pot-stirring mother of two.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwOTY5ODExNF5BMl5BanBnXkFtZTYwMjExMDAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0912916","name":"Kiersten Warren","idIMDB":"nm0912916"},"actorId":"nm0912916","character":"Phyllis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rick Overton","urlProfile":"http://www.imdb.com/name/nm0653959","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjExMzExMF5BMl5BanBnXkFtZTcwNzU1OTQ2Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1954","placeOfBirth":" Forest Hills, Queens, New York, USA","birthName":"Richard Overton","height":"6' 4\" (1.93 m)","bio":"Raised in New Jersey and New York, Overton comes from a musical family. His father, Hal Overton, was Thelonious Monk's big band arranger as well as a music teacher at the Juilliard Institute. His mother, Nancy Overton aka Anne Swain Overton, sang in personal appearances as a member of The Chordettes, the girl group most famous for their singles \"Lollipop\" and \"Mr. Sandman\". Rick has dabbled in the music industry himself as he plays the harmonica occasionally with local blues bands. Rick began his stand-up career while in high school as one half of the comedy team \"Overton & Sullivan\" but eventually went solo as he broke in at the New York Improvisation in the early 1970s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjExMzExMF5BMl5BanBnXkFtZTcwNzU1OTQ2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0653959","name":"Rick Overton","idIMDB":"nm0653959"},"actorId":"nm0653959","character":"Arnold 'Arnie' Millard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Edson","urlProfile":"http://www.imdb.com/name/nm0002057","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NzYwNjEyNl5BMl5BanBnXkFtZTcwOTk2NDE1Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1954","placeOfBirth":" New Rochelle, New York, USA","height":"5' 11½\" (1.82 m)","bio":"The great character actor Richard Edson's first feature film role came in Jim Jarmusch's 1983 cult hit, Stranger Than Paradise (1984), where he played \"Eddie\", one of the main characters. Edson then had small, but memorable, roles in other big hits such as Desperately Seeking Susan (1985), John Hughes' Ferris Bueller's Day Off (1986), Oliver Stone's great Vietnam-movie Platoon (1986), Barry Levinson's Good Morning, Vietnam (1987) and, in 1989, Edson starred in Spike Lee's Do the Right Thing (1989). In 1993, he played \"Spike\", one of the evil King Koopa's henchmen, in Super Mario Bros. (1993) and, in 1995, he had a part in the engaging sci-fi thriller, Strange Days (1995). More recently, he has appeared in the remake of Starsky & Hutch (2004), the dubious horror-flick, Frankenfish (2004) and is currently starring with Tom Arnold in The Kid & I (2005). In addition to his film success, Edson has had a fascinating career in music, being the original drummer in the New York post-punk band, Sonic Youth, and spending three years as drummer for the rhythmic dance band, Konk. It was his involvement in Konk and the New York art scene that caught Jim Jarmusch's eye and led to his being cast in Stranger Than Paradise (1984). Edson currently lives in Los Angeles where, in addition to acting, he is very active in music, writing and photography.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NzYwNjEyNl5BMl5BanBnXkFtZTcwOTk2NDE1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002057","name":"Richard Edson","idIMDB":"nm0002057"},"actorId":"nm0002057","character":"Chopper Miller","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elise Eberle","urlProfile":"http://www.imdb.com/name/nm2195169","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0ODU2MDU5MV5BMl5BanBnXkFtZTgwMzMwMzMwNzE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1993","placeOfBirth":" Albuquerque, New Mexico, USA","birthName":"Elise K. Eberle","height":"5' 6\" (1.68 m)","bio":"Elise Eberle was born on March 6, 1993 in Albuquerque, New Mexico, USA as Elise K. Eberle. She is an actress, known for Salem (2014), Breathe In (2013) and The Astronaut Farmer (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0ODU2MDU5MV5BMl5BanBnXkFtZTgwMzMwMzMwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2195169","name":"Elise Eberle","idIMDB":"nm2195169"},"actorId":"nm2195169","character":"Madison Roberts","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0469263","urlIMDB":"http://www.imdb.com/title/tt0469263","business":{"budget":{"money":"$13,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$4,454,319","country":"USA","day":"25","month":"02","year":"2007","remarks":"2,155 Screens"}],"gross":[{"money":"$10,996,440","country":"USA","day":"22","month":"04","year":"2007","remarks":""},{"money":"$10,755,700","country":"USA","day":"01","month":"04","year":"2007","remarks":""},{"money":"$10,371,048","country":"USA","day":"18","month":"03","year":"2007","remarks":""},{"money":"$9,354,438","country":"USA","day":"11","month":"03","year":"2007","remarks":""},{"money":"$7,792,554","country":"USA","day":"04","month":"03","year":"2007","remarks":""},{"money":"$4,454,319","country":"USA","day":"25","month":"02","year":"2007","remarks":""}],"weekendGross":[{"money":"$26,369","country":"USA","day":"22","month":"04","year":"2007","remarks":"89 Screens"},{"money":"$35,374","country":"USA","day":"01","month":"04","year":"2007","remarks":"71 Screens"},{"money":"$527,128","country":"USA","day":"18","month":"03","year":"2007","remarks":"650 Screens"},{"money":"$1,015,921","country":"USA","day":"11","month":"03","year":"2007","remarks":""},{"money":"$2,212,155","country":"USA","day":"04","month":"03","year":"2007","remarks":""},{"money":"$4,454,319","country":"USA","day":"25","month":"02","year":"2007","remarks":"2,155 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"07","month":"09","year":"2005","remarks":null},null],"copyrightHolder":"Warner Bros. Entertainment Inc."},"technical":{"runtime":["1 hr 44 min (104 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Panaflex Gold II, Panavision Primo, C- and E-Series Lenses","Panavision Panaflex Millennium, Panavision Primo, C- and E-Series Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA (prints)"],"filmLength":["2,875 m (Portugal, 35 mm)"],"negativeFormat":["35 mm (Fuji Super F-64D 8522, Super F-250D 8562, Eterna 500T 8573)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Panavision (anamorphic) (source format)"],"printedFilmFormat":["35 mm (Fuji Eterna-CP 3513DI)"]},"rating":"6.3","metascore":"55","filmingLocations":[{"location":"Albuquerque, New Mexico, USA"}],"rated":"PG","awards":[],"votes":"20,112","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."},{"idCompany":"co0238159","name":"Spring Creek Pictures"},{"idCompany":"co0026920","name":"Polish Brothers Construction"}],"keywords":{"keywords":["rocket","bank","fbi","space travel","fuel","barn","faa","rancher","nasa","foreclosure","farmer","farm","ranch","astronaut","gym","woman","still images during end credits","story continued during end credits","orchestral music score","following a dream","bigger dreams","catalogue","bank foreclosure","children's book","child protective agency","intimidation","angel wings costume","street banner","cafe","licorice","ferris wheel","carnival ride","carnival","fairground","aerospace engineer","tv crew","tv reporter","tv camera","reference to dairy queen","reference to dunkin' donuts","advertising","supermarket","psychiatric evaluation","cattle","chicken","high school gym","school nurse","nurse","scene during end credits","reference to jay leno","times square manhattan new york city","junkyard","cell phone","telephone call","accident","loan officer","weapon of mass destruction","wmd","missile","rocketeer","homemade rocket","building a rocket","horse and wagon","horse riding","horse","fight","men's bathroom","basketball","brick thrown through a window","home schooling","illegal alien","federal bureau of investigation","pancake","hamster","oxygen","weightlessness","father in law son in law relationship","mailman","waitress","crutches","injury","broken leg","line dancing","dancing","dancer","patriot act","homeland security","space cowboy","pickup truck","eating","food","pilot","space capsule","spacesuit","coffin","judge","courtroom","court","investigation","lawyer","drink","drinking","beer","sheriff","graveyard","cemetery","photograph","classroom","class","student","teacher","federal aviation agency","u.s. air force","last will and testament","rain","death of grandfather","watching tv","suicide of father","suicide","death","e mail","computer","u.s. government","boy","banker","loan","mortgage","ex astronaut","retirement","grandfather granddaughter relationship","brother sister relationship","husband wife relationship","mother daughter relationship","mother son relationship","father daughter relationship","family relationships","square dance","horseshoes","funeral","easter egg hunt","county fair","teenage boy","girl","hospital","federal agent","wedding ring","school","outer space","money problems","grandfather grandson relationship","federal government","easter","ambition","aeronautics","texas","marriage","father son relationship","satire","death of father","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:18:41"}}