{"data":{"movies":[{"title":"Quelques jours en avril","originalTitle":"Sometimes in April","year":"2005","releaseDate":"20050319","directors":[{"name":"Raoul Peck","id":"nm0669704"}],"writers":[{"name":"Raoul Peck","id":"nm0669704"}],"runtime":"140 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NTA0MzM5MF5BMl5BanBnXkFtZTcwMDU4NTgyMQ@@._V1.jpg","countries":["France","USA","Rwanda"],"languages":["English","Kinyarwanda"],"genres":["Drama","History","War"],"plot":"Debra Winger, Oris Erhuero and Idris Elba star in this drama framed by the Rwandan genocide.","simplePlot":"Debra Winger, Oris Erhuero and Idris Elba star in this drama framed by the Rwandan genocide.","actors":[{"actorName":"Idris Elba","urlProfile":"http://www.imdb.com/name/nm0252961","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzEzMTI2NjEyNF5BMl5BanBnXkFtZTcwNTA0OTE4OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1972","placeOfBirth":" Hackney, London, England, UK","birthName":"Idrissa Akuna Elba","height":"6' 2¾\" (1.9 m)","bio":"An only child, Idris Elba was born and raised in Hackney, London, England. His father, Winston, is from Sierra Leone and worked at a Ford motor factory. His mother, Eve, is from Ghana and had a clerical duty. Idris attended school in Canning Town, where he first became involved in acting. He gained a place in the National Youth Music Theatre - thanks to a £1,500 Prince's Trust grant. He worked as a disc jockey in nightclubs under the nickname DJ Big Driis at age 19. However, he began auditioning for television roles in his early twenties. He has starred in both British and American productions. His first acting roles were on the soap opera Family Affairs (1997) and the television serial Ultraviolet (1998). His best known roles are as drug baron Russell \"Stringer\" Bell on the HBO series The Wire (2002) and as DCI John Luther on the BBC One series Luther (2010). He later starred in the films Daddy's Little Girls (2007), Prom Night (2008), RocknRolla (2008), The Unborn (2009) and Obsessed (2009). He also appeared in the films American Gangster (2007), Takers (2010), Thor (2011), Prometheus (2012), Pacific Rim (2013) and Thor: The Dark World (2013). Idris Elba was appointed Officer of the Order of the British Empire (OBE) by Queen Elizabeth II in the 2016 New Years Honours for his services to drama.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzEzMTI2NjEyNF5BMl5BanBnXkFtZTcwNTA0OTE4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0252961","name":"Idris Elba","nicknames":["DJ Big Driis"],"idIMDB":"nm0252961"},"actorId":"nm0252961","character":"Augustin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carole Karemera","urlProfile":"http://www.imdb.com/name/nm0439157","urlPhoto":"","biography":{"bio":"Carole Karemera is an actress, known for Quelques jours en avril (2005), Sounds of Sand (2006) and Black (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0439157","name":"Carole Karemera","idIMDB":"nm0439157"},"actorId":"nm0439157","character":"Jeanne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pamela Nomvete","urlProfile":"http://www.imdb.com/name/nm0634611","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMTgzMDc5M15BMl5BanBnXkFtZTgwNTgwOTM0MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"Pamela Nomvete was born in Ethiopia. She is an actress, known for Coronation Street (1960), Quelques jours en avril (2005) and Lettre d'amour zoulou (2004). She has been married to Collins Marimbe since August 23, 2002.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMTgzMDc5M15BMl5BanBnXkFtZTgwNTgwOTM0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0634611","name":"Pamela Nomvete","idIMDB":"nm0634611"},"actorId":"nm0634611","character":"Martine","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Oris Erhuero","urlProfile":"http://www.imdb.com/name/nm0258938","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM3NDIzNDQ4MF5BMl5BanBnXkFtZTgwNTA0MDQ0MzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 September 1968","placeOfBirth":" London, England, UK","height":"5' 11\" (1.8 m)","bio":"Born in London England birth sign Virgo, the oldest of 7 children of a much loved and respected Nigerian (Urohbo) family, in his childhood, Oris Erhuero, was accustomed to tagging along with his mother to her job at the National Theatre of London, where he was first intrigued to pursue the craft of the performing arts. In his early days, he was further inspired to follow a career in lights when he was attending the Beaufoy School, in Kennington Park, London, (later renamed Lilian Baylis School) where he not only successfully excelled academically, but also discovered his passion for acting. His parents were pleasantly pleased that his drama mentors were very encouraging, having been impressed by his presence and quickly developing skill, even as a youth. From that first spark, throughout his primary & secondary school days, on to University and beyond, he has used and continues to employ, his life experiences, classical Shakespearean training, natural athleticism and endless energy to further develop his love for and contribution to the arts, into a rewarding career encompassing many genres of the entertainment industry. Being a self-proclaimed \"citizen of the world, emboldened by strong roots,\" he has been blessed to have lived and traveled all over the world, cultivating a life's-riches of experiences from which to draw upon. He is a natural storyteller and sometimes, court jester, at heart, who always has a courteous charming word or humorous tale to tell. The wide range of roles that he has played have demonstrated his diversity as a performer from the stage of the west end in London to TV and big screen ,as is evidenced by his affinity for and ability with various dialects (American, British, African, European) as well as, his chameleon-like visual transformations, from incarnations such as \"Rongar\" to his portrayal of \"Honore in the critically Aclaimed HBO film \" sometimes In April \" and his very recent most talked about project\" The cursed ones\" Along with his numerous film credits, Oris has appeared in international Fashion campaigns and Runways in London, Newyork, Milan and Paris for the highest esteemed clients such as Etro, Armani,Gian Franco Ferre, Dior and Versachi as well as he just recently launched his luxury Jewellery and accessories Brand \"Oris Erhuero Couture\" . Oris is a proud, single-father of a beautiful daughter. On June 16, 2004, Oris was named father of the year by the National Fatherhood Inititive at the \"Golden Dad\" Awards held in Los Angeles. Being grounded from a spiritual perspective, Oris thoroughly enjoys and believes in \"giving back\" to the world community, and thus, is often involved in local community based or international humanitarian projects. Oris is a Martial Arts practitioner as well as a Buddhist in his personal life, and enjoys living and promoting a healthy & well-balanced lifestyle.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM3NDIzNDQ4MF5BMl5BanBnXkFtZTgwNTA0MDQ0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0258938","name":"Oris Erhuero","idIMDB":"nm0258938"},"actorId":"nm0258938","character":"Honoré","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fraser James","urlProfile":"http://www.imdb.com/name/nm0416508","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5MzQ2MDMwNV5BMl5BanBnXkFtZTgwMjQzMjAxOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Fraser James is an actor, known for Resident Evil: The Final Chapter (2016), Quelques jours en avril (2005) and Shopping (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5MzQ2MDMwNV5BMl5BanBnXkFtZTgwMjQzMjAxOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0416508","name":"Fraser James","idIMDB":"nm0416508"},"actorId":"nm0416508","character":"Xavier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Abby Mukiibi Nkaaga","urlProfile":"http://www.imdb.com/name/nm1880270","urlPhoto":"","biography":{"bio":"Abby Mukiibi Nkaaga is an actor, known for The Last King of Scotland (2006), Quelques jours en avril (2005) and The Silent Army (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1880270","name":"Abby Mukiibi Nkaaga","nicknames":["Nabbe"],"idIMDB":"nm1880270"},"actorId":"nm1880270","character":"Colonel Bagosora","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cleophas Kabasita","urlProfile":"http://www.imdb.com/name/nm1159358","urlPhoto":"","biography":{"bio":"Cleophas Kabasita is an actor and producer, known for Quelques jours en avril (2005), Kinyarwanda (2011) and Ezra (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1159358","name":"Cleophas Kabasita","nicknames":["Cleo"],"idIMDB":"nm1159358"},"actorId":"nm1159358","character":"Valentine","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Noah Emmerich","urlProfile":"http://www.imdb.com/name/nm0001187","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNjg4MzgxNV5BMl5BanBnXkFtZTcwMTQ5NTYzNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1965","placeOfBirth":" New York City, New York, USA","birthName":"Noah Nicholas Emmerich","height":"6' 3\" (1.91 m)","bio":"Noah Emmerich was born and raised in New York City, to Constance, a concert pianist, and André Emmerich, an art dealer and gallery owner. He attended Yale University, where he sang with the a capella group the Yale Spizzwinks. He attended NYU Film School where he wrote and directed an award winning short film called \"The Painter.\" Emmerich came to prominence with starring roles in the cult hit Beautiful Girls (1996) and the Jim Carrey blockbuster The Truman Show (1998). He is considered a real \"actor's actor,\" noted for his understated, subtle realism and his deep emotional presence on screen. His production company, Sandbox Entertainment, has a first-look production deal with New Line Cinema. His older brother is Toby Emmerich.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNjg4MzgxNV5BMl5BanBnXkFtZTcwMTQ5NTYzNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001187","name":"Noah Emmerich","idIMDB":"nm0001187"},"actorId":"nm0001187","character":"Lionel Quaid","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Debra Winger","urlProfile":"http://www.imdb.com/name/nm0000700","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNTQ2ODMwN15BMl5BanBnXkFtZTYwNjc5ODUz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1955","placeOfBirth":" Cleveland Heights, Ohio, USA","birthName":"Debra Lynn Winger","height":"5' 4\" (1.63 m)","bio":"Mary Debra Winger was born May 16, 1955 in Cleveland, Ohio, to Ruth (Felder), an officer manager, and Robert Jack Winger, a meat packer. She is from a Jewish family (originally from Austria-Hungary and the Russian Empire). Her maternal grandparents called her Mary, while her parents called her Debra (her father named her Debra after his favorite actress, Debra Paget). The family moved to California when Debra was five. She fell in love with acting in high school but kept it a secret from her family. She was a precocious teenager, having graduated high school at an early age of 15. She enrolled in college, majoring in criminology. She worked part-time in the local amusement park when she got thrown from a truck and suffered serious injuries and went temporarily blind for several months. She was in the hospital when she vowed to pursue her passion for acting. After she recovered, she abandoned college and studied acting. Like any struggling actor, she did commercials and guest-starred on 70s TV shows like Police Woman: Task Force: Cop Killer: Part 1 (1976) and Wonder Woman (1975) where she played Lynda Carter's little sister, Wonder Girl. She also made her feature film debut in the embarrassing soft-core porn film Slumber Party '57 (1976). (Years later on Inside the Actors Studio (1994), host James Lipton asked her to name her first film, and she refused to answer him.) Her next two films French Postcards (1979) and Thank God It's Friday (1978) did absolutely nothing for her career. When Sissy Spacek said no to playing the character Sissy in Urban Cowboy (1980), almost every young actress in Hollywood pursued the role. Debra won the role over a then-unknown Michelle Pfeiffer and gave a star-making performance as John Travolta's wife. Her handling of the mechanical bull made her a new kind of sex symbol. She would always remain grateful to her director James Bridges for threatening to quit the film if the studio didn't cast her. However, she followed it up with a flop, Cannery Row (1982). But, she became part of one of the top-grossing films of all time by providing her deep, throaty voice to the title character of E.T. the Extra-Terrestrial (1982) as a favor to the film's director Steven Spielberg (Note: IMDB cast list for E.T. indicates Pat Welsh as the voice for that character.). She also appeared in the film for a few seconds in the Halloween scene, where she is wearing a zombie mask and carrying a poodle. She received her first Academy Award nomination as Best Actress for the huge hit An Officer and a Gentleman (1982), where her on-screen love scenes with Richard Gere became just as legendary as her off-screen fights with him and with director Taylor Hackford. Debra's reputation as a great talent, as well as her reputation as a difficult actress grew with her next film, Terms of Endearment (1983), which not only earned her a second Oscar nomination as Best Actress but also won the Best Picture as well. She also earned the Best Actress Award from the National Society of Film Critics. Debra was at the top of her game and was the most sought-after actress in Hollywood, but she turned down quality roles and lucrative offers for three years. Some speculated that the reason was her romantic involvement with Bob Kerrey, then-governor of Nebraska, while others have stated it was her back problems. Whatever her reasons were, her career lost its heat. Her long-delayed film Mike's Murder (1984), reuniting her with her \"Urban Cowboy\" director James Bridges, didn't help matters either when it became a critical and financial flop. Debra tried to revive her career by starring in the big-budget comedy Legal Eagles (1986), but she disliked the film so much that she publicly stated that the director, Ivan Reitman, was one of the two worst directors she worked with, the other director being Taylor Hackford (An Officer and a Gentleman (1982)). She also walked out on her agency, CAA, but returned several years later. Her personal life made headlines when she left Bob Kerrey and eloped with Oscar-winning actor Timothy Hutton in 1986. In 1987, she gave birth to their son, Noah Hutton. She also starred in Black Widow (1987), which wasn't a hit, and acted alongside Hutton as a male angel in Made in Heaven (1987) which flopped. She followed that up by starring in another flop, Betrayed (1988), which featured a fleeting cameo by Hutton. She separated from Hutton in 1988 and they divorced in 1990, at which time she had two more bombs, Everybody Wins (1990) and The Sheltering Sky (1990). However, she relished the experience on The Sheltering Sky (1990) so much that she stayed in the Sahara desert long after filming wrapped. She came back to US and filmed a Steve Martin vehicle, Leap of Faith (1992), which did nothing for her career. But, she found love on the set of her next film, Wilder Napalm (1993) when she co-starred opposite Arliss Howard, who became her next husband. The film flopped but their marriage lasted. She received good notices for A Dangerous Woman (1993), but it was Shadowlands (1993) which finally brought her renewed respectability and her third Academy Award nomination as Best Actress. She followed that up with a forgettable comedy Forget Paris (1995). Then, she signed to do \"Divine Rapture\" with Marlon Brando and Johnny Depp in a small village in Ireland, but two weeks into filming, financing fell apart, and the film was never completed. Winger was never paid for her work, and neither were the poor villagers, and Winger said she was devastated for them. Now 40, Debra felt that there were no good roles for her and she concentrated on motherhood by having a second son, \"Babe Ruth Howard\", in 1997. Her six-year absence from films inspired a documentary by Rosanna Arquette titled Searching for Debra Winger (2002), which is about sexism and ageism in Hollywood. In 2001, she returned to acting in her husband's film Big Bad Love (2001), which she also co-produced. It renewed her love for acting, and she has ventured out into television as well by earning her first Emmy nomination as Best Actress for Dawn Anna (2005) directed by her husband. In 2008, she wrote a well-written book based on her personal recollections titled \"Undiscovered.\" And she followed that up by winning rave reviews as Anne Hathaway's mother in Jonathan Demme's Rachel Getting Married (2008). However, it wasn't enough to reignite her feature film career, so she ventured towards television in 2010 with a guest-starring role on \"Law and Order\", to a seven-episode stint on \"In Treatment\", to a two-part miniseries \"The Red Tent\" in 2014, to a regular role on \"The Ranch\" in 2016. Her television exposure reignited her feature film career, and she was cast in her first romantic lead in 22 years in \"The Lovers\" (2017). Nobody can deny that Debra Winger is one of the best American actresses ever. Her fans hope that Hollywood will finally reward her talent with a long-overdue Academy Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNTQ2ODMwN15BMl5BanBnXkFtZTYwNjc5ODUz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000700","name":"Debra Winger","idIMDB":"nm0000700"},"actorId":"nm0000700","character":"Prudence Bushnell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peninah Abatoni","urlProfile":"http://www.imdb.com/name/nm2421713","urlPhoto":"","biography":{"bio":"Peninah Abatoni is an actress, known for Quelques jours en avril (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2421713","name":"Peninah Abatoni","idIMDB":"nm2421713"},"actorId":"nm2421713","character":"Woman Refugee #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ashani Alles","urlProfile":"http://www.imdb.com/name/nm2424875","urlPhoto":"","biography":{"bio":"Ashani Alles is an actor, known for Quelques jours en avril (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2424875","name":"Ashani Alles","idIMDB":"nm2424875"},"actorId":"nm2424875","character":"Prosecutor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hope Azeda","urlProfile":"http://www.imdb.com/name/nm2426049","urlPhoto":"","biography":{"bio":"Hope Azeda is known for her work on Quelques jours en avril (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2426049","name":"Hope Azeda","idIMDB":"nm2426049"},"actorId":"nm2426049","character":"Brigitte","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Théogène Barasa","urlProfile":"http://www.imdb.com/name/nm2424998","urlPhoto":"","biography":{"bio":"Théogène Barasa is an actor, known for Quelques jours en avril (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2424998","name":"Théogène Barasa","idIMDB":"nm2424998"},"actorId":"nm2424998","character":"RAF Soldier #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dan Barlow","urlProfile":"http://www.imdb.com/name/nm2415727","urlPhoto":"","biography":{"bio":"Dan Barlow is an actor, known for Quelques jours en avril (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2415727","name":"Dan Barlow","idIMDB":"nm2415727"},"actorId":"nm2415727","character":"Belgian UN Soldier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Johannes Bausch","urlProfile":"http://www.imdb.com/name/nm2212495","urlPhoto":"","biography":{"dateOfBirth":"22 October 1968","placeOfBirth":" Stockholm, Sweden","height":"5' 11¼\" (1.81 m)","bio":"Johannes Bausch was born on October 22, 1968 in Stockholm, Sweden. He is an actor, known for Quelques jours en avril (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2212495","name":"Johannes Bausch","idIMDB":"nm2212495"},"actorId":"nm2212495","character":"UN Officer #1","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0400063","urlIMDB":"http://www.imdb.com/title/tt0400063","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 20 min (140 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Laboratoires GTC, Joinville, France"],"filmLength":null,"negativeFormat":["35 mm (Kodak Vision2 500T 5218, Vision 200T 5274, Vision Expression 500T 5284)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.9","filmingLocations":[{"location":"Kigali, Rwanda"}],"rated":"TV-MA","awards":[{"award":"Primetime Emmy Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Primetime Emmy","categories":[{"category":"Outstanding Music Composition for a Miniseries, Movie or a Special (Dramatic Underscore)","names":[{"name":"Bruno Coulais","id":"nm0006020","role":"music composer"}]}]}]},{"award":"AFI Awards, USA 2006","titlesAwards":[{"titleAwardOutcome":"Won AFI Award","categories":[{"category":"TV Program of the Year","names":[]}]}]},{"award":"Amanda Awards, Norway 2006","titlesAwards":[{"titleAwardOutcome":"Won Amanda","categories":[{"category":"Best DVD (Årets DVD)","names":[]}]}]},{"award":"Berlin International Film Festival 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Berlin Bear","categories":[{"category":"","names":[{"name":"Raoul Peck","id":"nm0669704","role":null}]}]}]},{"award":"Black Movie Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Black Movie Award","categories":[{"category":"Outstanding Television Movie","names":[{"name":"Raoul Peck","id":"nm0669704","role":null},{"name":"Joel Stillerman","id":"nm0830255","role":null},{"name":"Daniel Delume","id":"nm0217941","role":null}]}]}]},{"award":"Black Reel Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Black Reel","categories":[{"category":"Best Actor - Television","names":[{"name":"Idris Elba","id":"nm0252961","role":null}]},{"category":"Best Supporting Actor - Television","names":[{"name":"Oris Erhuero","id":"nm0258938","role":null}]},{"category":"Best Director - Television","names":[{"name":"Raoul Peck","id":"nm0669704","role":null}]},{"category":"Best Screenplay, Original or Adapted - Television","names":[{"name":"Raoul Peck","id":"nm0669704","role":null}]},{"category":"Outstanding Television or Mini-Series Film","names":[{"name":"Daniel Delume","id":"nm0217941","role":null}]}]}]},{"award":"Durban International Film Festival 2005","titlesAwards":[{"titleAwardOutcome":"Won Best Film","categories":[{"category":"","names":[{"name":"Raoul Peck","id":"nm0669704","role":null}]}]}]},{"award":"Image Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Image Award","categories":[{"category":"Outstanding TV Movie, Mini-Series or Dramatic Special","names":[]},{"category":"Outstanding Actor in a TV Movie, Mini-Series or Dramatic Special","names":[{"name":"Idris Elba","id":"nm0252961","role":null}]}]}]},{"award":"NAMIC Vision Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Vision Award","categories":[{"category":"Best Drama","names":[]},{"category":"Best Dramatic Performance","names":[{"name":"Idris Elba","id":"nm0252961","role":null}]}]}]},{"award":"Satellite Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Satellite Award","categories":[{"category":"Outstanding Motion Picture Made for Television","names":[]}]}]},{"award":"Television Critics Association Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated TCA Award","categories":[{"category":"Outstanding Achievement in Movies, Miniseries and Specials","names":[]}]}]}],"votes":"4,072","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0074582","name":"CINEFACTO"},{"idCompany":"co0005861","name":"HBO Films"},{"idCompany":"co0076352","name":"Velvet Film"}],"keywords":{"keywords":["woman takes off shoes","camera shot of feet","female stockinged soles","female stockinged legs","female stockinged feet","nude pantyhose","pantyhose","genocide","office","watching tv","sofa","swahili","month in title","dead children","widower","trial","survivor","suicide","murder","massacre","mass child killing","lorry","hand grenade","corpse","church","child murder","bloody body of child","school","blood","shot in the back","1990s","united nations mission","tutsi","teacher","slaughter","rwanda","roadblock","radio station","racism","political assassination","militia","mass murder","machete","hutu","hotel","ethnic cleansing","coup","civil war","africa"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:31:30"}}