{"data":{"movies":[{"title":"Manticore","originalTitle":"","year":"2005","releaseDate":"20051126","directors":[{"name":"Tripp Reed","id":"nm0715736"}],"writers":[{"name":"John Werner","id":"nm0921421"}],"runtime":"88 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNTc2MzAxM15BMl5BanBnXkFtZTcwNDM2MTIzMg@@._V1.jpg","countries":["USA"],"languages":["English","Arabic"],"genres":["Action","Fantasy","Horror","Sci-Fi","War"],"plot":"During Operation Iraqi Freedom, a US Army Squad is sent to a small Iraqi town to locate a missing news crew, only to find the residents of the town dead and a living weapon of mass destruction, a Manticore, awakened from its long slumber by a terrorist leader wanting to rid his land of the American invaders at any price.","simplePlot":"Commandos in Iraq looking for terrorists find a man-eating monster instead.","actors":[{"actorName":"Robert Beltran","urlProfile":"http://www.imdb.com/name/nm0000296","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIyODA3MjI3NF5BMl5BanBnXkFtZTgwODIyNjU2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1953","placeOfBirth":" Bakersfield, California, USA","birthName":"Robert Adame Beltran","height":"5' 10½\" (1.79 m)","bio":"Robert Adame Beltran was born in Bakersfield, California. He is the seventh of ten children, of Mexican-Native American ancestry, though Robert describes his heritage as Latindio. After finishing high school, he attended Fresno State College, where he graduated with a degree in theater arts. Beltran landed his first film role in Luis Valdez's Zoot Suit (1981) in 1981. One year later, he landed the role of Raoul in Paul Bartel's Eating Raoul (1982). Other appearances included Gaby: A True Story (1987), Nixon (1995) and another Paul Bartel film, Scenes from the Class Struggle in Beverly Hills (1989) among others. In the theater, he has appeared in productions for Luis Valdez's El Teatro Campesino, the LA Theater Center, the California Shakespeare Festival and others. Robert founded and serves as co-artistic director of the East LA Classic Theater Group, with a staff of professional actors. There, he played Hamlet and served as co-producer as well as director. Robert appeared in A Midsummer Night's Dream; King Henry IV; A Touch of the Poet; and The Price, among others. In 1995, he got the part of Commander Chakotay on Star Trek: Voyager (1995). At that time, he received a Nosotros Golden Eagle Award as best actor in a television series. Robert supports National Down Syndrome Society and lives in Los Angeles, California. In his political activity, Robert Beltran has engaged over recent years in a series of classical drama workshops mainly on Shakespeare with the LaRouche Youth Movement of the Democratic Party as well as participating in several Schiller Institute conferences speaking on the subject of classical drama, most recently on his 2003 staging of Clifford Odets' 1948 play \"The Big Knife\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIyODA3MjI3NF5BMl5BanBnXkFtZTgwODIyNjU2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000296","name":"Robert Beltran","idIMDB":"nm0000296"},"actorId":"nm0000296","character":"Sgt. Baxter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeff Fahey","urlProfile":"http://www.imdb.com/name/nm0001194","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyODQwNDgwMF5BMl5BanBnXkFtZTcwMjgzNTg2Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 November 1952","placeOfBirth":" Olean, New York, USA","height":"6' (1.83 m)","bio":"Jeff Fahey was born in Olean, New York, one of 13 children of Jane (Gallagher) and Francis Thomas Fahey, who worked in a clothing store. He is of Irish descent. His family moved to Buffalo when he was 10, where he attended Father Baker's High School. After graduation in 1972 he traveled around the world doing odd jobs. He was a crewman on a fishing boat, drove an ambulance in Germany, lived in a kibbutz in Israel and spent some time in India. He then returned to Buffalo and joined the Studio Arena Theatre. From there he went to New York City, where he studied with Myra Rastova, began doing off-Broadway theater and television soap operas. He started a production company and produced off-Broadway shows out of the Raft Theatre on Theatre Row. He first gained attention as a motion picture actor in Lawrence Kasdan's Silverado (1985), in which he played Brian Dennehy's deputy Tyree, a cold-blooded killer with a thirst for vengeance. He starred in the acclaimed live television play The Execution of Raymond Graham (1985) and the TNT mini-series \"44 Days\". He starred for over two years in the daytime serial One Life to Live (1968). He appeared in the Broadway revival of \"Brigadoon,\" toured with \"Oklahoma,\" performed in Paris in \"West Side Story\" and in London in \"Orphans\" with Albert Finney.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyODQwNDgwMF5BMl5BanBnXkFtZTcwMjgzNTg2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001194","name":"Jeff Fahey","idIMDB":"nm0001194"},"actorId":"nm0001194","character":"Kramer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chase Masterson","urlProfile":"http://www.imdb.com/name/nm0135895","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwODMzMDc5MV5BMl5BanBnXkFtZTgwNTU2MTQ4NjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 February 1963","placeOfBirth":" Colorado Springs, Colorado, USA","birthName":"Christianne Carafano","height":"5' 7\" (1.7 m)","bio":"Chase Masterson (born February 26, 1963 in Colorado Springs, Colorado) is perhaps best known as sexy casino girl \"Leeta\" on Star Trek: Deep Space Nine (1993) and \"Ivy Lief\" on General Hospital (1963), as well as being the featured guest star in the first Emmy Award-winning episode of ER (1994). Masterson was named one of the \"Hot Leading Ladies\" of Film in 2008 by \"Film Fetish\", one of the world's \"50 Sexiest Women\" by \"Femme Fatales Magazine\", the \"#1 Favorite Science Fiction Actress on Television\" in a \"TV Guide\" online readers poll, and one of the \"Top 20 People to Watch in Hollywood\" by \"Sci-Fi Universe Magazine\". She was also named \"Best Feature Film Producer\" by the LA Femme Film Festival for her work on Yesterday Was a Lie (2008). Masterson got her start as a child actress, singer, and dancer in Texas. After several theatre and film roles in her youth and teen years, she got her first big break in lead roles in the low budget thrillers In a Moment of Passion (1993) and Married People, Single Sex (1994) as well as Sacré Robin des Bois (1993) (in which she played Richard Lewis' girlfriend). Masterson originally auditioned for the one-time guest role of Jake Sisko's girlfriend \"Mardah\" in a 1994 episode of Star Trek: Deep Space Nine (1993), but was told that she was a bit too old to be romantically involved with the teenage Jake character. Director Avery Brooks has subsequently indicated at Trek conventions that he held off casting her because he \"didn't want [his] character's son to be with someone so sexy\", and that he hoped she would be brought on as a regular cast member (perhaps as a love interest for himself). The role of \"Leeta\" was then written for her (although she was apparently still required to audition for it), and she remained in the role for the final five years of the series' run. Prominent film roles include \"J.A.N.I.C.E. Em\" in Robotech: The Shadow Chronicles (2006) and the \"Singer\" in Yesterday Was a Lie (2008). Masterson hosted Sci-Fi Entertainment (1998) for the Syfy Channel in the 1990s and an Internet-based radio talk show for the website The Fandom in 2004-2005. She has also hosted \"Showtime: Nighttime\" and Encore's \"Starz On Demand\", and guest-hosted CNet Central (1996) and NBC's Saturday Night at the Movies (1974). Masterson is also a singer of jazz/torch songs and has received positive reviews for her music from magazines such as \"Film Score Monthly\" and \"Entertainment Today\". She has performed in USO tours for the Navy and the Marine Corps. Masterson has been actively involved in numerous charities worldwide, including Caring for Babies With AIDS, Homeboy Industries, Iris Ministries, and Youth With a Mission, and founded the G.E.N.I.U.S. charity umbrella organization which is supported by her licensed fan club. She donated proceeds from sales of a photo collection to the organization Operation Call Home, supplying phone cards to U.S. troops. Following a series of stalking incidents instigated by a man in Berlin, Masterson was the plaintiff in a highly controversial legal case in which the Ninth Circuit Court of Appeals ruled that user-account-based websites constitute \"interactive computer services\" under the Communications Decency Act and are therefore not liable for information published on them. The court also ruled that public figures are not entitled to the same privacy protection online as other individuals. The case precedent has since been used to indemnify websites such as Craigslist when used to advertise illegal services. Masterson also served as executive producer on the documentary film Through Your Eyes (2007) (about the world's only deaf-blind triplets) and has optioned the rights to the HarperCollins novel The Camel Bookmobile.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwODMzMDc5MV5BMl5BanBnXkFtZTgwNTU2MTQ4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0135895","name":"Chase Masterson","nicknames":["Leeta"],"idIMDB":"nm0135895"},"actorId":"nm0135895","character":"Ashley Pierce","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Heather Donahue","urlProfile":"http://www.imdb.com/name/nm0231946","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2ODE1NTcwMV5BMl5BanBnXkFtZTYwNzI4NzY2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 December 1974","placeOfBirth":" Upper Darby, Pennsylvania, USA","height":"5' 8\" (1.73 m)","bio":"Heather Donahue was born on December 22, 1974 in Upper Darby, Pennsylvania, USA. She is an actress and writer, known for The Blair Witch Project (1999), Boys and Girls (2000) and New Suit (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2ODE1NTcwMV5BMl5BanBnXkFtZTYwNzI4NzY2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0231946","name":"Heather Donahue","idIMDB":"nm0231946"},"actorId":"nm0231946","character":"Cpl. Keats","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Faran Tahir","urlProfile":"http://www.imdb.com/name/nm0846687","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNjM4NjQwM15BMl5BanBnXkFtZTcwODk4OTMyMw@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 February 1963","placeOfBirth":" Los Angeles, California, USA","birthName":"Faran Haroon Tahir","height":"5' 10\" (1.78 m)","bio":"Faran Haroon Tahir was born in Los Angeles, California while his parents were studying acting and directing at UCLA Theatre Department. He comes from a theatre family well-known in Pakistan and India. Both his parents are actors, directors and writers in Pakistan. Faran moved back to Los Angeles, California in 1980, when he was 17 years old. He received his Bachelor's degree from the University of California, Berkeley and his graduate degree from the Institute for Advanced Theatre Training at Harvard University. He has been nominated and has won many awards for his work in theatre and film.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNjM4NjQwM15BMl5BanBnXkFtZTcwODk4OTMyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0846687","name":"Faran Tahir","idIMDB":"nm0846687"},"actorId":"nm0846687","character":"Umari","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"A.J. Buckley","urlProfile":"http://www.imdb.com/name/nm0118568","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjc4MjY1MzYtOTc5Yy00NGU2LWFkNmUtMmE0MjE0ZjRlZjUyXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1978","placeOfBirth":" Dublin, Ireland","birthName":"Alan John Buckley","height":"5' 9\" (1.75 m)","bio":"A.J. Buckley was born on February 9, 1978 in Dublin, Ireland as Alan John Buckley. He is an actor and director, known for CSI: NY (2004), The Good Dinosaur (2015) and Happy Feet (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjc4MjY1MzYtOTc5Yy00NGU2LWFkNmUtMmE0MjE0ZjRlZjUyXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0118568","name":"A.J. Buckley","idIMDB":"nm0118568"},"actorId":"nm0118568","character":"Pvt. Sulley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeff M. Lewis","urlProfile":"http://www.imdb.com/name/nm1898118","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NzUyMzIwN15BMl5BanBnXkFtZTcwNjUxMTYzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 December 1981","placeOfBirth":" Seattle, Washington, USA","height":"6' (1.83 m)","bio":"Jeff M. Lewis was born on December 1, 1981 in Seattle, Washington, USA. He is known for his work on A Place of Our Own: Los Niños en Su Casa (2005), Lockup (2005) and Jarhead (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NzUyMzIwN15BMl5BanBnXkFtZTcwNjUxMTYzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1898118","name":"Jeff M. Lewis","idIMDB":"nm1898118"},"actorId":"nm1898118","character":"Ortiz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Gnolfo","urlProfile":"http://www.imdb.com/name/nm1232512","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NTY3NDQyOF5BMl5BanBnXkFtZTcwMDY3MTI5Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Richard Christopher Gnolfo","height":"5' 9\" (1.75 m)","bio":"Richard Gnolfo was born in Queens, New York, USA as Richard Christopher Gnolfo. He is a writer and actor, known for A Nanny for Christmas (2010), The Dog Who Saved Christmas Vacation (2010) and The Dog Who Saved Halloween (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NTY3NDQyOF5BMl5BanBnXkFtZTcwMDY3MTI5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1232512","name":"Richard Gnolfo","idIMDB":"nm1232512"},"actorId":"nm1232512","character":"John Busey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jonas Talkington","urlProfile":"http://www.imdb.com/name/nm1488513","urlPhoto":"","biography":{"dateOfBirth":"7 November 1976","placeOfBirth":" Indianapolis, Indiana, USA","height":"6' 1\" (1.85 m)","bio":"Jonas Talkington was born on November 7, 1976 in Indianapolis, Indiana, USA. He is known for his work on Lake Placid 2 (2007), Le contrat (2006) and Man with the Screaming Brain (2005). He has been married to Raina Georgieva since June 10, 2011. They have one child.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1488513","name":"Jonas Talkington","idIMDB":"nm1488513"},"actorId":"nm1488513","character":"Mouth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michail Elenov","urlProfile":"http://www.imdb.com/name/nm0253249","urlPhoto":"","biography":{"bio":"Michail Elenov is known for his work on Undisputed 2: Last Man Standing (2006), El Gringo (2012) and In Hell (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0253249","name":"Michail Elenov","idIMDB":"nm0253249"},"actorId":"nm0253249","character":"Fathi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Zlatarev","urlProfile":"http://www.imdb.com/name/nm1197031","urlPhoto":"","biography":{"dateOfBirth":"18 May 1971","placeOfBirth":" Sofia, Bulgaria","height":"6' 2\" (1.88 m)","bio":"George Zlatarev was born on May 18, 1971 in Sofia, Bulgaria. He is an actor, known for The Expendables 2 (2012), I Spit on Your Grave 2 (2013) and The Grey Zone (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1197031","name":"George Zlatarev","idIMDB":"nm1197031"},"actorId":"nm1197031","character":"Safa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Benjamin Burdick","urlProfile":"http://www.imdb.com/name/nm0120966","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTEwNjg4NzgzOF5BMl5BanBnXkFtZTgwMDE3ODc3NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Benjamin Burdick is an actor, known for Arrested Development (2003), The Soul Man (2012) and The Glades (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTEwNjg4NzgzOF5BMl5BanBnXkFtZTgwMDE3ODc3NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0120966","name":"Benjamin Burdick","idIMDB":"nm0120966"},"actorId":"nm0120966","character":"Ryan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Cory Davis","urlProfile":"http://www.imdb.com/name/nm1108894","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWY1NGUyMWYtNjZhZS00M2M1LTk4ZDgtNTg1MDIwNGI2MTUzXkEyXkFqcGdeQXVyODAzNDY4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Davis started his professional career as an actor after graduating from the prestigious Fiorello H. LaGuardia High School for the Performing Arts in New York City. In 1999, Davis moved to Los Angeles where he starred in award-winning, dramatic independent short films such as The Call and Let's Talk which aired on BET. Later, Davis starred in a recurring role as a fashion stylist for Forrester Creations on the popular daytime soap opera The Bold and the Beautiful. In 2003, Davis was cast to star alongside Lorenzo Lamas in the action film Raptor Island for the Syfy Channel. It was this film that sparked Michael's passion for the action genre which led him to star in multiple action films over three years for the Syfy Channel. While acting in a film in Bulgaria, Davis learned about the horrific crime of human trafficking during a fundraising event and traveled to various orphanages with the organization Face To Face Bulgaria to meet trafficking victims. Upon his return to the United States, Davis wrote the film Svetlana's Journey, based on the true story of a 13-year-old sex trafficking victim. Davis flew back to Sofia, Bulgaria, where he secured corporate funding and directed the film in a week with non-English-speaking Bulgarian actors. Upon completion of Svetlana's Journey, Davis helped organize fundraising events, generating thousands of dollars to provide financial support to a number of orphanages. Davis prolonged his stay in Sofia and toured the country screening Svetlana's Journey in 20 public schools and orphanages. In 2005, Svetlana's Journey aired on Bulgarian national television to more than two million viewers. Davis' work helped push Bulgaria's lawmakers to create their first ever anti-trafficking agency. In addition, Svetlana's Journey won Best Short Subject at the 2005 Hollywood Film Festival and Best Short Subject honors at the 2005 HDFEST Film Festival in Los Angeles. Davis was also honored runner-up for Best Director. In 2007, Davis produced and directed Cargo: Innocence Lost, a documentary that exposes the sex trade of children and women within the United States. Both films have been used by hundreds of national and international agencies, organizations, churches, and educational institutions. Davis, has worked with legislators, royalty, celebrities, and corporations to create social awareness. He is the recipient of the prestigious People to People International (founded by Dwight Eisenhower) Make a Difference award and has been covered by various broadcast and print media outlets including World News with Charles Gibson, CNN, NBC, ABC, KTLA, and Los Angeles Daily News, to name a few, bringing light to the issue. Davis is the founder of Artists United For Social Justice a non-profit organization with a mission that empowers activists to create and distribute multimedia content that educates the public, particularly youth, about human rights violations and social injustices. Davis is the CEO of Journey Film Group Inc., a film production company established in 2006 with a mission to create and distribute innovative content with topical, socially relevant themes.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWY1NGUyMWYtNjZhZS00M2M1LTk4ZDgtNTg1MDIwNGI2MTUzXkEyXkFqcGdeQXVyODAzNDY4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1108894","name":"Michael Cory Davis","idIMDB":"nm1108894"},"actorId":"nm1108894","character":"Pvt. Davis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edmund Druilhet","urlProfile":"http://www.imdb.com/name/nm1933472","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MTkxMzAyM15BMl5BanBnXkFtZTcwNzYzNTczMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 August 1964","placeOfBirth":" North Hollywood, California, USA","height":"5' 11\" (1.8 m)","bio":"Born on 17th August 1964, Producer of Feature film and creator of TV series, the brother of Tom Druilhet, Edmund currently resides in Manhattan Beach, California. He attended UCLA and USL. Has two children, Soleil and Paris. Past Body Building champion Mr. Southern America. Was V.P. of Sabeva International Distribution 2 years. Also a California Realtor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MTkxMzAyM15BMl5BanBnXkFtZTcwNzYzNTczMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1933472","name":"Edmund Druilhet","idIMDB":"nm1933472"},"actorId":"nm1933472","character":"Sargent Cohen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vlado Mihailov","urlProfile":"http://www.imdb.com/name/nm2268616","urlPhoto":"","biography":{"bio":"Vlado Mihailov is an actor, known for Boyka: Undisputed (2016), The Legend of Hercules (2014) and Infestation (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2268616","name":"Vlado Mihailov","idIMDB":"nm2268616"},"actorId":"nm2268616","character":"Mickey","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0417943","urlIMDB":"http://www.imdb.com/title/tt0417943","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"14","month":"06","year":"2004","remarks":null},{"money":null,"country":null,"day":"07","month":"07","year":"2004","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 28 min (88 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"3.7","filmingLocations":[{"location":"Sofia, Bulgaria"}],"awards":[],"votes":"808","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0057336","name":"Unified Film Organization (UFO)"},{"idCompany":"co0169785","name":"Sci Fi Pictures"},{"idCompany":"co0222010","name":"Secure Productions"}],"keywords":{"keywords":["u.s. army","ripped neck","iraq war","female soldier","female reporter","creature feature"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:14:12"}}