{"data":{"movies":[{"title":"Hoboken Hollow","originalTitle":"","year":"2006","releaseDate":"20070424","directors":[{"name":"Glen Stephens","id":"nm0827023"}],"writers":[{"name":"Glen Stephens","id":"nm0827023"}],"runtime":"98 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5Mzg5MDgwNV5BMl5BanBnXkFtZTcwNTA5MjA0MQ@@._V1.jpg","countries":["USA"],"languages":["English","French"],"genres":["Horror"],"plot":"As Trevor drifts through Texas on collision course with a nightmare he is still haunted by the evils of the war he recently returned from and a promise he failed to keep. When a stranger offers a ride, Trevor finds himself battling the brutal homegrown evil of the Broderick family at Hoboken Hollow,a remote West Texas ranch that many visit but few ever leave.","simplePlot":"As Trevor drifts through Texas on collision course with a nightmare he is still haunted by the evils of the war he recently returned from and a promise he failed to keep. When a stranger ... ","actors":[{"actorName":"Jason Connery","urlProfile":"http://www.imdb.com/name/nm0001064","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3OTA5NDQwNF5BMl5BanBnXkFtZTgwNzQ5NjMyMTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 January 1963","placeOfBirth":" London, England, UK","birthName":"Jason Joseph Connery","height":"6' (1.83 m)","bio":"Jason Connery has appeared in over 30 films, television movies and series, combined, since his breakthrough role as \"Robin Hood\" in the UK television series Robin Hood (1984) in 1985. The son of Sean Connery and Diane Cilento, Connery grew up in London and Scotland. He attended boarding school at Somerset, where he received a half-scholarship for swimming and held the under-16 freestyle record for the south of England. Connery's interest in acting developed while studying at the Gordonstoun School for Boys in the north of Scotland. He started the Inter-House Players Group - wherein two houses combine to put on one play each term. Connery also took on directing duties and directed fellow classmate Edward Wessex (aka Prince Edward) in \"Hotel Paradiso\". Connery was accepted to The Bristol Old Vic Drama School and, one year later, to Perth Repertory Company in Scotland. For six months, he did weekly repertory work, acted, and worked as the assistant stage manager in an effort to earn his Equity card. He worked hard, rehearsing one play by day and performing another by night, learning as much as he could along the way. His big break came in 1985 when he took over the role of \"Robin Hood\" in the popular UK television series \"Robin of Sherwood\" (1984). The role launched him to stardom in England and he remains a cult favorite with the show's passionate fans. He has since had starring roles in feature films including Return of the Thief of Baghdad (1999), Private Moments (2005), Wishmaster 3 - Au-delà des portes de l'enfer (2001), Requiem (2001), Shanghai Noon (2000), Bullet to Beijing (1995), Urban Ghost Story (1998) and Macbeth (1997). He has also starred in television movies (La légende de Merlin (1998) and The Secret Life of Ian Fleming (1990)) and series (Smallville (2001), Liberty's Kids: Est. 1776 (2002) and Shoebox Zoo (2004)). In 1996, he married actress Mia Sara and they have one son, Dashiell Connery. The couple divorced in 2002. He is most proud of his role as father to Dashiell Quinn Connery, whom he refers to as \"the most wonderful person I know\". Connery now resides in Los Angeles and spends every bit of free time with his son. Connery feels that, as an actor, he continues to grow because every job is a new and exciting challenge. He credits his mother and father, who inspire him in many ways, for his drive and his ability to survive and persevere in an unpredictable business. He is also inspired by live theatre - an inspirational journey unique to performance, in one moment, with one audience - that will never be duplicated. Most importantly, it is his son who inspires him to be a loving, nurturing human being and to hold close what is dear in life. Through affiliations with Coventry University's new filmmaking facility and the \"Independent Filmmakers Group\", he is working to educate and support the next generation of filmmakers. He recently wrapped Shoebox Zoo (2004) in the UK after two seasons and has completed three films in America - Hoboken Hollow (2006), The Far Side of Jericho (2006) and Night Skies (2007). After achieving success as an actor for two decades, Connery is working behind the cameras with his recently formed production company, \"Unconditional Entertainment\". The company, headed by Connery and Ricki Maslar, currently has several projects in development for film and television. \"Unconditional\" has announced Connery's directorial debut with the film Pandemic (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3OTA5NDQwNF5BMl5BanBnXkFtZTgwNzQ5NjMyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001064","name":"Jason Connery","idIMDB":"nm0001064"},"actorId":"nm0001064","character":"Trevor Lloyd","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"C. Thomas Howell","urlProfile":"http://www.imdb.com/name/nm0001367","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ3NjIxMTA2OF5BMl5BanBnXkFtZTgwNTAwNzQ2MDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 December 1966","placeOfBirth":" Los Angeles, California, USA","birthName":"Christopher Thomas Howell","height":"5' 10\" (1.78 m)","bio":"After an eye-catching performance in the teen coming-of-age epic The Outsiders (1983), ex-child rodeo star C. Thomas Howell was one of the most promising young actors in the mid 1980s. Christopher Thomas Howell was born in Los Angeles, California, to Candice (Webb) and Chris Howell, a professional bull rider turned stuntman. He started working in the film industry at the age of seven. In 1981, he was cast as Tyler in Steven Spielberg's E.T. The Extra Terrestrial. Shortly thereafter, he nabbed the lead in Francis Ford Coppola's classic The Outsiders, starring opposite the likes of Diane Lane, Patrick Swayze, Matt Dillon, and Tom Cruise. It was Howell's gripping performance as the tough, yet vulnerable Ponyboy Curtis that made him a household name virtually overnight. Earmarked as an up-and-coming actor, Howell's career soon skyrocketed with roles in films including the comedy Grandview, U.S.A. (1984), alongside Jamie Lee Curtis, and the violent Cold War invasion drama Red Dawn (1984). His career was not helped by the controversial racial comedy Soul Man (1986), which was not well-received. However, he did meet and fall in love with his co-star from that movie, Rae Dawn Chong, whom he later married. Whilst superstardom has eluded him, there's no doubting that Howell has been in consistent demand with film producers. He has notched up in excess of 90 feature film appearances. including starring roles in Side Out (1990), Gettysburg (1993), Baby Face Nelson (1996), Fatal Affair (1998), Asylum Days (2001) and Hoboken Hollow (2006). He played unpredictable Officer Bill \"Dewey\" Dudek in the TNT smash drama Series Southland and as the serial killer \"The Reaper\" on CBS' Criminal Minds. His recent television appearances include The Glades on A&E as well as Torchwood on the Starz Channel. He also appeared in Sony's The Amazing Spider-Man (2012). A budding film director, he has directed a number of films, including The Big Fall, Pure Danger and Edgar Rice Burroughs The Land That Time Forgot. Outside of his acting career, Howell is an accomplished team roper. Known as a friendly and likable person to fans, he lives with his wife Sylvie, and their three children Isabelle, Dashiell and Liam.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ3NjIxMTA2OF5BMl5BanBnXkFtZTgwNTAwNzQ2MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001367","name":"C. Thomas Howell","nicknames":["C.T.","Tommy"],"idIMDB":"nm0001367"},"actorId":"nm0001367","character":"Clayton Connelly","urlCharacter":"http://www.imdb.com/character/ch0078510","main":true},{"actorName":"Mark Holton","urlProfile":"http://www.imdb.com/name/nm0392625","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE5NzkxNzU3Nl5BMl5BanBnXkFtZTcwMDA1MTEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 April 1958","placeOfBirth":" Oklahoma City, Oklahoma, USA","birthName":"Mark Douglas Holton","bio":"Mark Holton was born on April 2, 1958 in Oklahoma City, Oklahoma, USA as Mark Douglas Holton. He is an actor, known for Pee-wee's Big Adventure (1985), Leprechaun (1993) and Gacy (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE5NzkxNzU3Nl5BMl5BanBnXkFtZTcwMDA1MTEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0392625","name":"Mark Holton","idIMDB":"nm0392625"},"actorId":"nm0392625","character":"Weldon Brodrick","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lin Shaye","urlProfile":"http://www.imdb.com/name/nm0005417","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmNjOWY2NjItY2MxMy00M2QxLWIzNWYtMWM5YzNiZTM5MDZiL2ltYWdlXkEyXkFqcGdeQXVyMjE5NTgzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 October 1943","placeOfBirth":" Detroit, Michigan, USA","birthName":"Linda Shaye","height":"5' 2\" (1.57 m)","bio":"Lin attended the University of Michigan, where she was an Art History major, although acting in as many University productions as possible, including \"Bye Bye Birdie\" and \"On The Town\". After U of M, she attended Columbia University School of the Arts, and acquired a Master of Fine Arts degree in Acting. She stayed in New York upon graduation and worked in numerous off- and off-off- Broadway productions, as well as Lincoln Center and Broadway. She has studied with some of the finest: Uta Hagen, Stella Adler and Lee Strasberg. Lin is a lifetime member of the Actor's Studio.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmNjOWY2NjItY2MxMy00M2QxLWIzNWYtMWM5YzNiZTM5MDZiL2ltYWdlXkEyXkFqcGdeQXVyMjE5NTgzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005417","name":"Lin Shaye","idIMDB":"nm0005417"},"actorId":"nm0005417","character":"Mrs. Brodrick","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Randy Spelling","urlProfile":"http://www.imdb.com/name/nm0005456","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA2NDEyNDg0OV5BMl5BanBnXkFtZTcwMTg1MzAzMQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1978","placeOfBirth":" Los Angeles, California, USA","birthName":"Randall Gene Spelling","bio":"Randy Spelling is son of legendary late Hollywood producer Aaron Spelling and his wife, Candy Spelling. He and his sister, actress Tori Spelling, grew up in Beverly Hills, CA where he attended Montclair College Prep. Randy made his television debut in 1992 on the Fox prime time series Beverly Hills, 90210 (1990) and later held a recurring role on the popular program. Randy went on to star in the NBC series Malibu Shores (1996) and NBC's hit soap opera Sunset Beach (1997). He also guest-starred on the WB series 7th Heaven (1996). After starring for three and a half years on Sunset Beach (1997), Randy transitioned into the record business and formed his own record label called Spellbound/Vocab Records. As CEO, he oversaw operations of A&R as well as the production, promotion, marketing and distribution departments. Spellbound/Vocab Records released albums for a number of platinum artists. While continuing his work in the music business, Randy made his feature film debut in the thriller Held for Ransom (2000) (Emmet/Furla Films) opposite Dennis Hopper and Zachery Ty Bryan. He went on to co-star in the indie cult hit Dorm Daze (2003) and also held a co-starring role in Pledge This! (2006) opposite Paris Hilton, Simon Rex, Paula Garcés, Sarah Carter and Carmen Electra. Randy next played a role in the soon-to-be released indie horror flick Dimples (2008) opposite Ashley Peldon and Madeline Zima and co-starred in the gritty indie horror Hoboken Hollow (2006) opposite C. Thomas Howell, Michael Madsen, Dennis Hopper, Lin Shaye and Jason Connery. Randy also starred in Michael Damian's critically-acclaimed directorial debut Hot Tamale (2006) co-starring Carmen Electra, Diora Baird, [error], Harland Williams and Jason Priestley, which won the Indie Spirit Best Picture Award at the 2006 Boston International Film Festival. Randy recently wrapped production on the environmentally-friendly independent feature Cosmic Radio (2007), due out in 2007, in which he co-stars with Michael Madsen, Rider Strong and Wes Studi. Following in his father's footsteps, Randy wrote a pilot for Paramount Television last year and is currently in development on a number of film and television projects that he will produce in 2007 and beyond. Randy is a producer on A&E's forthcoming (April) real-life series Sons of Hollywood (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA2NDEyNDg0OV5BMl5BanBnXkFtZTcwMTg1MzAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005456","name":"Randy Spelling","idIMDB":"nm0005456"},"actorId":"nm0005456","character":"Parker Hilton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dennis Hopper","urlProfile":"http://www.imdb.com/name/nm0000454","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNTQ5Nzg0OF5BMl5BanBnXkFtZTcwMDE2MDE4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 May 1936","placeOfBirth":" Dodge City, Kansas, USA","birthName":"Dennis Lee Hopper","height":"5' 9\" (1.75 m)","bio":"With an amazing cinematic career of more than five decades, Dennis Hopper was a multi-talented and unconventional actor/director, regarded by many as one of the true \"enfants terribles\" of Hollywood. Hopper was born on May 17, 1936 in Dodge City, Kansas, to Marjorie Mae (Davis) and James Millard Hopper. The young Hopper expressed interest in acting from a young age and first appeared in a slew of 1950s television series, including Medic (1954), Cheyenne (1955) and Sugarfoot (1957). His first film role was in Johnny Guitar (1954), which was quickly followed by roles in Rebel Without a Cause (1955), Giant (1956) and Gunfight at the O.K. Corral (1957). Hopper actually became good friends with James Dean and was shattered when Dean was killed in a car crash on September 30, 1955. Hopper portrayed a young Napoléon Bonaparte (!) in the star-spangled The Story of Mankind (1957) and regularly appeared on screen throughout the 1960s, often in rather undemanding parts, usually as a villain in westerns such as True Grit (1969) and Hang 'Em High (1968). However, in early 1969, Hopper, fellow actor Peter Fonda and writer Terry Southern, wrote a counterculture road movie script and managed to scrape together $400,000 in financial backing. Hopper directed the low-budget film, titled Easy Rider (1969), starring Fonda, Hopper and a young Jack Nicholson. The film was a phenomenal box-office success, appealing to the anti-establishment youth culture of the times. It changed the Hollywood landscape almost overnight and major studios all jumped onto the anti-establishment bandwagon, pumping out low-budget films about rebellious hippies, bikers, draft dodgers and pot smokers. However, Hopper's next directorial effort, The Last Movie (1971), was a critical and financial failure, and he has admitted that during the 1970s he was seriously abusing various substances, both legal and illegal, which led to a downturn in the quality of his work. He appeared in a sparse collection of European-produced films over the next eight years, before cropping up in a memorable performance as a pot-smoking photographer alongside Marlon Brando and Martin Sheen in Francis Ford Coppola's Vietnam War epic Apocalypse Now (1979). He also received acclaim for his work in both acting and direction for Garçonne (1980). With these two notable efforts, the beginning of the 1980s saw a renaissance of interest by Hollywood in the talents of Dennis Hopper and exorcising the demons of drugs and alcohol via a rehabilitation program meant a return to invigorating and provoking performances. He was superb in Rumble Fish (1983), co-starred in the tepid spy thriller The Osterman Weekend (1983), played a groovy school teacher in My Science Project (1985), was a despicable and deranged drug dealer in River's Edge (1986) and, most memorably, electrified audiences as foul-mouthed Frank Booth in the eerie and erotic David Lynch film Blue Velvet (1986). Interestingly, the offbeat Hopper was selected in the early 1980s to provide the voice of \"The StoryTeller\" in the animated series of \"Rabbit Ears\" children's films based upon the works of Hans Christian Andersen! Hopper returned to film direction in the late 1980s and was at the helm of the controversial gang film Colors (1988), which was well received by both critics and audiences. He was back in front of the cameras for roles in Super Mario Bros. (1993), got on the wrong side of gangster Christopher Walken in True Romance (1993), led police officer Keanu Reeves and bus passenger Sandra Bullock on a deadly ride in Speed (1994) and challenged gill-man Kevin Costner for world supremacy in Waterworld (1995). The enigmatic Hopper has continued to remain busy through the 1990s and into the new century with performances in The Night We Called It a Day (2003), The Keeper (2004) and Land of the Dead - Le territoire des morts (2005). As well as his acting/directing talents, Hopper was a skilled photographer and painter, having had his works displayed in galleries in both the United States and overseas. He was additionally a dedicated and knowledgeable collector of modern art and has one of the most extensive collections in the United States. Dennis Hopper died of prostate cancer on May 29, 2010, less than two weeks after his 74th birthday.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNTQ5Nzg0OF5BMl5BanBnXkFtZTcwMDE2MDE4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000454","name":"Dennis Hopper","idIMDB":"nm0000454"},"actorId":"nm0000454","character":"Sheriff Greer","urlCharacter":"http://www.imdb.com/character/ch0078512","main":true},{"actorName":"Michael Madsen","urlProfile":"http://www.imdb.com/name/nm0000514","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODA5NzY2N15BMl5BanBnXkFtZTYwNjc3NTI1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1958","placeOfBirth":" Chicago, Illinois, USA","birthName":"Michael Soren Madsen","height":"6' 2\" (1.88 m)","bio":"Michael Madsen's long career spans 25 years and more than 170 films in which he has played memorable characters in myriad box office hits, including: Kill Bill: Vol. 1 (2003), Kill Bill: Vol. 2 (2004) Sin City (2005), Hell Ride (2008), Die Another Day (2002), Donnie Brasco (1997), Species (1995), The Getaway (1994), Thelma & Louise (1991), and Free Willy (1993). Michael is notably recognized for his role as Mr. Blonde, in Quentin Tarantino's Reservoir Dogs (1992). Michael was born in Chicago, Illinois, to Elaine Madsen (née Melson), an Emmy-winning writer, producer, and poet, and Calvin Madsen, a firefighter. He is the brother of actress Virginia Madsen. His paternal grandparents were Danish. In recent years, Madsen has received Best Actor awards for his role in the Irish boxing film Strength and Honour, from the New York International Film Festival, the Boston Film Festival and the Downtown Los Angeles Film Festival. Madsen received the Golden Dolphin Award at the 25th Festroia Festival in Portugal, an award also given to veterans Kirk Douglas and Robert Mitchum. In 2012, Madsen was named President of the first annual Champs Elysees Film Festival in France which honored producer Harvey Weinstein. Recent television appearances include guest starring roles on The Mob Doctor (2012), Golden Boy (2013)and Blue Bloods (2010). Madsen is well recognized as an accomplished poet. His first book \"Burning In Paradise\" with a Foreword by Dennis Hopper, won the Independent Firecracker Award and was later translated into Norwegian. He has a world-wide following with his work, honored at International Poetry Festivals in Genoa, Italy and Mexico . He was recently the Guest of Honor at the Crossing Border Festival in Netherlands. His \"The Complete Poetic Works\" is an international bestseller. This was followed by his \"Signs of Life\" dedicated to Chris Penn. This unique work combined his new poetry with his own original photography. His next book of poetry \"American Badass\"was dedicated to the memory of the late David Carradine, his friend and Kill Bill co-star. His newest book \"Expecting Rain\" has a Foreword by Jerry Hopkins.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODA5NzY2N15BMl5BanBnXkFtZTYwNjc3NTI1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000514","name":"Michael Madsen","idIMDB":"nm0000514"},"actorId":"nm0000514","character":"J.T. Goldman","urlCharacter":"http://www.imdb.com/character/ch0078511","main":true},{"actorName":"Robert Carradine","urlProfile":"http://www.imdb.com/name/nm0001019","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzY0NjI1NDE0M15BMl5BanBnXkFtZTcwNjgwNzgyMg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 March 1954","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Robert Reed Carradine","height":"5' 11½\" (1.82 m)","bio":"Robert Carradine was born on March 24, 1954 in Hollywood, Los Angeles, California, USA as Robert Reed Carradine. He is an actor and producer, known for Django Unchained (2012), Revenge of the Nerds (1984) and Lizzie McGuire (2001). He has been married to Edith (Edie) Mani since January 7, 1990. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzY0NjI1NDE0M15BMl5BanBnXkFtZTcwNjgwNzgyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001019","name":"Robert Carradine","nicknames":["Bobby"],"idIMDB":"nm0001019"},"actorId":"nm0001019","character":"Thad Simmons","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Greg Evigan","urlProfile":"http://www.imdb.com/name/nm0263760","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MDI3MTI4OF5BMl5BanBnXkFtZTYwNDc4OTYy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 October 1953","placeOfBirth":" South Amboy, New Jersey, USA","birthName":"Gregory Ralph Evigan","height":"6' 3\" (1.91 m)","bio":"Born in South Amboy, New Jersey, Greg Evigan grew up in Sayreville. While in high school he won acclaim as Cornelius Hackl in Hello Dolly, which won the New Jersey High School Musical Contest. One month after graduating from Sayreville War Memorial High School in 1971, Greg auditioned for and won a part in the Broadway show \"Jesus Christ Superstar.\" He also joined the cast of a touring company, playing the lead in the musical \"Grease\". Since the mid-1970s, he has amassed over 100 acting credits. His two most famous television roles were, B.J. and the Bear (1978) and My Two Dads (1987). Both series were initially successful but suffered sharp ratings declines and only lasted three seasons. Evigan sang the opening theme on both series. He is also known for Tek Wars and Masquerade. His three children are also in the entertainment industry. His daughters Briana Evigan and Vanessa Evigan are actresses and his son Jason Evigan is a singer/songwriter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MDI3MTI4OF5BMl5BanBnXkFtZTYwNDc4OTYy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0263760","name":"Greg Evigan","idIMDB":"nm0263760"},"actorId":"nm0263760","character":"Tom Stockwell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dedee Pfeiffer","urlProfile":"http://www.imdb.com/name/nm0679410","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NTczOTIwMF5BMl5BanBnXkFtZTYwNzI2MjYz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1964","placeOfBirth":" Midway City, California, USA","birthName":"Dorothy D. Pfeiffer","height":"5' 5\" (1.65 m)","bio":"Dedee Pfeiffer was born on January 1, 1964 in Midway City, California, USA as Dorothy D. Pfeiffer. She is an actress and producer, known for For Your Love (1998), Chute libre (1993) and Cybill (1995). She was previously married to Kevin Ryan, Santiago A. Gomez and Gregory Fein.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NTczOTIwMF5BMl5BanBnXkFtZTYwNzI2MjYz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0679410","name":"Dedee Pfeiffer","idIMDB":"nm0679410"},"actorId":"nm0679410","character":"Rhonda Simmons","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jonathan Fraser","urlProfile":"http://www.imdb.com/name/nm0292167","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MzIzMjAyMF5BMl5BanBnXkFtZTcwNDUwMjkyMQ@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 November 1967","placeOfBirth":" Chicago, Illinois, USA","birthName":"Jonathan Fraser Regnery","bio":"Jonathan Fraser was born on November 1, 1967 in Chicago, Illinois, USA as Jonathan Fraser Regnery. He is an actor and writer, known for Swordfish (2001), Some Guy Who Kills People (2011) and Brotherhood of Blood (2007). He has been married to Kimberly Keim since August 11, 2006.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MzIzMjAyMF5BMl5BanBnXkFtZTcwNDUwMjkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0292167","name":"Jonathan Fraser","idIMDB":"nm0292167"},"actorId":"nm0292167","character":"Junior Broderick","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rudolf Martin","urlProfile":"http://www.imdb.com/name/nm0553020","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmJhY2ZlMTQtYTNhZS00NTY4LWEwMzItMzA0ZDVlNWI0ODg5L2ltYWdlXkEyXkFqcGdeQXVyMjg4NjEzMA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1967","placeOfBirth":" Berlin, Germany","height":"6' 1½\" (1.87 m)","bio":"Born and raised in West Berlin, Rudolf moved with his family from Berlin to Paris to Italy, arriving in the United States a short time after his high school graduation from the Universite de Paris. While studying at the Lee Strasberg Theatre Institute, he landed his first professional role in the Susan Seidelman short film The Dutch Master, which was nominated for a 1994 Academy Award. He went on to appear in the off-Broadway plays Murder In Disguise, The Dumb Waiter, and Front Page.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmJhY2ZlMTQtYTNhZS00NTY4LWEwMzItMzA0ZDVlNWI0ODg5L2ltYWdlXkEyXkFqcGdeQXVyMjg4NjEzMA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0553020","name":"Rudolf Martin","idIMDB":"nm0553020"},"actorId":"nm0553020","character":"Howie Beale","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe Stevens","urlProfile":"http://www.imdb.com/name/nm0828494","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODM4OTg0NjI1NF5BMl5BanBnXkFtZTgwNzIwMzU1MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"Joe Stevens is known for his work on True Grit (2010), What's Eating Gilbert Grape (1993) and Lone Star (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODM4OTg0NjI1NF5BMl5BanBnXkFtZTgwNzIwMzU1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0828494","name":"Joe Stevens","idIMDB":"nm0828494"},"actorId":"nm0828494","character":"Preston Hanks","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kingsly Martin","urlProfile":"http://www.imdb.com/name/nm0552637","urlPhoto":"","biography":{"dateOfBirth":"26 February 1982","placeOfBirth":" Smith County, Texas, USA","birthName":"Garrett Prudhomme","height":"5' 10\" (1.78 m)","bio":"Kingsly Martin began acting at the age of 9. He performed in school and community theatre for 8 years before focusing his attention to on camera performance. He booked his first paying job as an actor at the age of 17 in a commercial for Radica, USA casino games. He was paid $514.00 to say the line, \"Radical due.\" Kingsly landed his first feature film role in the winter of 1996 in the feature film \"All Night Boogie\" (formerly titled: \"The Wheel\"), directed by his now long-time friend Robert Murphy. Martin devised character name `Nikki' as the role was originally referred to as 'Tough Guy #2.' He later became a Producer on the project when Murphy needed help completing the film. He played author Charles Bukowski in the short film, \"The Princess of Parker Lane\" in the spring of 1997. In November 2001, Martin underwent a corrective eye surgery in Dallas, Texas to replace the damaged cornea in his right eye caused by Glaucoma. The surgery appeared to be a success, however, in the spring of 2002 complications arose. The retina in his eye detached and went undiscovered by doctors for 2 months. A post-operative surgery took place in the summer of that same year, but irrevocable damage had already taken place, leaving him with limited hand motion in one eye. After a brief stint in New York City, working on off-off-off-off Broadway plays, Martin returned to Texas in the Summer of 2003 to produce and star in the film, \"Faith & Bullets\" (formerly titled: \"Scars\"). After a six month search for a director, he stepped up to fill the slot. He subsequently shifted character roles in the film. Production of Faith & Bullets (2005) wrapped in the summer of 2004. Martin contributes his dedication to completing the project his girlfriend at the time, actress Leila Plummer and his junior high acting teacher Jo Ann Farabee's family. Jo Ann appeared in the film as the noisy neighbor Mrs. Boulderpotts. He suffered through a gambling addiction later that summer and into the fall, but he defeated the habit wit the help and support family and close professional friends Scott Osborn, Dave Kraft and David Stokey. He completed co-writing the buddy comedy script \"We've Got It\" in the spring of 2005. In March of 2005, Martin landed a co-starring role opposite C. Thomas Howell and Randy Spelling in the psychological thriller, \"Hoboken Hollow.\" The film is inspired by true events. He plays Andrew Gates, a transient that undergoes possibly the most disturbing torture scene in the thriller.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0552637","name":"Kingsly Martin","nicknames":["Kings","The Character King"],"idIMDB":"nm0552637"},"actorId":"nm0552637","character":"Andrew Gates","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Erick Nathan","urlProfile":"http://www.imdb.com/name/nm1063372","urlPhoto":"","biography":{"bio":"Erick Nathan is an actor and producer, known for Caged Animal (2010), King of the Avenue (2010) and Hoboken Hollow (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1063372","name":"Erick Nathan","idIMDB":"nm1063372"},"actorId":"nm1063372","character":"Archie Brubaker","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0455961","urlIMDB":"http://www.imdb.com/title/tt0455961","business":{"budget":{"money":"$1,100,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 38 min (98 min)","1 hr 30 min (90 min) (Argentina)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Sony HDW-F900"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":["HDCAM"],"printedFilmFormat":null},"rating":"3.8","filmingLocations":[{"location":"Menard, Texas, USA"}],"rated":"NOT RATED","awards":[],"votes":"1,014","type":"Movie","companyCreditsSimple":[{"idCompany":"co0151065","name":"Molding Clay Productions"}],"keywords":{"keywords":["texas","torture","slave ranch","redneck","rape","noose","murder","hitchhiker","hell","bondage"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 06:16:51"}}