{"data":{"movies":[{"title":"One Missed Call","originalTitle":"","year":"2008","releaseDate":"20080104","directors":[{"name":"Eric Valette","id":"nm0884659"}],"writers":[{"name":"Andrew Klavan","id":"nm0458461"},{"name":"Yasushi Akimoto","id":"nm0015340"}],"runtime":"87 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2NTk0OTcyMV5BMl5BanBnXkFtZTcwMzk1MDU1MQ@@._V1.jpg","countries":["Japan","USA","Germany"],"languages":["English"],"genres":["Horror","Mystery"],"plot":"After the death of their friend Shelley, Leann Cole receives a voice mail from the future of the date and time when she would die. On the scheduled day, Leann sees weird things and in the precise informed hour, Leann is attacked by a supernatural force on a footbridge over a train station while talking to her friend Beth Raymond. Beth meets Leann's boyfriend Brian, who also received a call, and witnesses his death on the street. When her roommate Taylor Anthony receives a call, Beth befriends Det. Jack Andrews, who tells her that his sister was the first victim of the phone call. They decide to investigate the connections of Jack's sister and find the name of Marie Layton, who apparently abused of her daughters. Jack and Beth run against time trying to save Beth from her fate.","simplePlot":"Several people start receiving voice-mails from their future selves - messages which include the date, time, and some of the details of their deaths.","actors":[{"actorName":"Shannyn Sossamon","urlProfile":"http://www.imdb.com/name/nm0815370","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNDIwODI3Nl5BMl5BanBnXkFtZTcwMDM0NDIzOQ@@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1978","placeOfBirth":" Honolulu, Hawaii, USA","birthName":"Shannon Marie Kahololani Sossamon","height":"5' 7\" (1.7 m)","bio":"Shannyn Sossamon, who credits her striking looks to a mix of English, French, Hawaiian, Dutch, Irish, Filipino, and German ancestry, was born Shannon Marie Kahololani Sossamon in Honolulu, Hawaii. At the age of one, Shannyn and her family moved to a new locale: Reno, Nevada. Her youth was spent at a dance studio. In 1995, she left her hometown the day after graduating from Galena High School, for Los Angeles, to pursue dance. She started deejaying as a hobby with her then boyfriend in the local clubs around town. Paying her bills every month were her appearances in commercials. Acting was not high on the young dancer's priority list, aside from a series of commercials, not for lack of interest but for the fact that she was content with her life in L.A. as it was. It was in 1999, when Shannyn was helping a friend D.J. at a birthday party for Gwyneth Paltrow that a new chapter began in her fairy tale life. Francine Maisler, a casting director known for such films as The Usual Suspects (1995), spotted Shannyn. Shortly thereafter Shannyn found herself with the backing of an influential Hollywood name and one very important audition... A Knight's Tale (2001). She determined she wanted the lead role and after six call backs, beat out the competition to play \"Lady Jocelyn\". Admittedly, the dancer turned actress knew little of her Australian costar Heath Ledger but the two became friends during filming. Since then, she appeared in the independent features Road to Nowhere (2010), directed by Monte Hellman and Man Without a Head for director Johnny Roc, as well as in Wristcutters: A Love Story (2006), with Patrick Fugit and Tom Waits, 40 Days and 40 Nights (2002) opposite Josh Hartnett, and The Rules of Attraction (2002) for director Roger Avary. Other credits include Kiss Kiss Bang Bang (2005), Life Is Hot in Cracktown (2009) and The Holiday (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNDIwODI3Nl5BMl5BanBnXkFtZTcwMDM0NDIzOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0815370","name":"Shannyn Sossamon","nicknames":["Shan"],"idIMDB":"nm0815370"},"actorId":"nm0815370","character":"Beth Raymond","urlCharacter":"http://www.imdb.com/character/ch0029740","main":true},{"actorName":"Edward Burns","urlProfile":"http://www.imdb.com/name/nm0122653","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MTU0NjIyMl5BMl5BanBnXkFtZTcwODc3OTc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 1968","placeOfBirth":" Woodside, Queens County, New York, USA","birthName":"Edward Fitzgerald Burns","height":"6' 1\" (1.85 m)","bio":"Edward Fitzgerald Burns was born January 29, 1968 in Woodside, Queens, New York. He is the second of three children of Molly (McKenna), who worked for the Federal Aviation Administration at Kennedy Airport, and Edward J. Burns, a police sergeant and active spokesperson for the New York Police Dept. He was raised Catholic, and is of Irish, and one eighth Swedish, descent. Edward, along with his older sister, Mary, and brother, Brian, were raised in Long Island. He attended Catholic Chaminade High School before transferring to a public high school. He went on to attend The State University of New York at Albany and Oneonta College in New York to major in English literature. During his junior year he transferred to Hunter College in Manhattan, studied filmmaking and began writing the first of many short films. Upon graduating, and through his father's connections, he secured a job at Entertainment Tonight (1981) (TV) in 1993 working at as a \"go-fer\". There he was able to finance and begin working on The Brothers McMullen (1995), a comedy focusing on the trials and tribulations facing three Irish-Catholic siblings. It was shot primarily in his parents' Long Island home with a cast of unknowns including Burns himself and his then-girlfriend Maxine Bahns. The feature was filmed over eight months' time with a reported budget of only $ 30,000. Rejected by a series of distributors, The Brothers McMullen (1995) bowed at Sundance, after Burns had given Robert Redford a copy of the film while working on ET. In 1995 his film won the festival's Grand Jury Prize, becoming one of the most successful independent efforts of the year. He then sold the film to 20th Century Fox's Searchlight Pictures. For his follow-up Burn's wrote and directed She's the One (1996), which retained much of McMullen's cast and crew, including girlfriend Maxine. He was also able to cast up-and-coming stars Jennifer Aniston and Cameron Diaz in pivotal roles, with original music from rocker Petty, Tom. Filmed with a larger budget of almost $3 million, the romantic comedy successfully premiered during the summer of 1996 . Burns soon began work on his third feature, _No Looking Back_, a romantic drama set in a coastal town's working-class community. Burn's career seemed to be flourishing, but his personal relationship with Bahns, to whom he became engaged, ended after eight years. During filming of No Looking Back (1998), there were reported romantic sightings with Burns and his co-star Lauren Holly. The relationship seemed to end when the film was released in 1998. That same year, Burns co-starred in the Steven Spielberg World War II epic Saving Private Ryan (1998). After that pivotal role in one of the greatest films of all time, Burns continued a good year, and a new relationship with Heather Graham. In an interview with USA Weekly Magazine, Heather stated they met in a bar in LA, exchanged numbers and had numerous conversations. Burns then flew back to New York and she flew to east to see him a month later. Soon after Burns and Heather were seen at many premieres and events. It was also reported that couple was living together. But their relationship ended after two years. Although they were dating during the filming of his next project 15 Minutes (2001) starring along side Robert De Niro, Burns attended the premiere with none other than Christy Turlington. While his next few films did not make much of a dent in the box office including his film Sidewalks of New York (2001), which co-starred Heather Graham. His relationship with Christy was getting hot and heavy. The couple got engaged in 2001. It was then reported their engagement was called off, but the couple reunited after a 7-month split. Burns and Christy finally married on June 7, 2003 and welcomed their first child Grace, later that year Grace, on October 25. Burns' most recent projects include writing and directing The Groomsmen (2006) and Purple Violets (2007). He welcomed his second child, son Finn, (Feb/2006) with wife Christy. Burns is committed to writing and directing his own films. He's not affected by his futile work and continues his own projects with poise. Tackling touchy relationship subjects and pioneering real-life matters. With his panoply of Woody Allen -like films, there is no doubt Edward Burns will continue to dazzle us with his undeniable talent while gaining the recognition he deserves as a great writer and director.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MTU0NjIyMl5BMl5BanBnXkFtZTcwODc3OTc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0122653","name":"Edward Burns","nicknames":["Eddie"],"idIMDB":"nm0122653"},"actorId":"nm0122653","character":"Det. Jack Andrews","urlCharacter":"http://www.imdb.com/character/ch0024886","main":true},{"actorName":"Ana Claudia Talancón","urlProfile":"http://www.imdb.com/name/nm0847799","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMTM4ODI4OV5BMl5BanBnXkFtZTgwNTMzMTk1ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 May 1980","placeOfBirth":" Cancun, Quintana Roo, Mexico","height":"5' 4¼\" (1.63 m)","bio":"Ana Claudia Talancon was born on May 1st, 1980 in Cancun, Mexico. Her first performance was in her home town Quintana Roo in Cancun. She studied acting in Cancun with the Cuban professor Albio Paz. She later went to Mexico City to continue her studies at the Acting Workshop of Héctor Mendoza and Raúl Quintanilla. She has starred in various soap operas such as 'Al norte del corazón', 'Señora','Romántica obsesión' (for which she won the Sol de Oro award in 1999 for Best New Actress) and 'Amor latino'. Her big screen debut in the role of Valentina in _ El cometa (1999)_ by Marisa Sistach, for which she was nominated for the Ariel award for Best New Actress. Her performance as Amelia in El crimen del padre Amaro (2002) with Gael García Bernal, gave her an international recognition.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMTM4ODI4OV5BMl5BanBnXkFtZTgwNTMzMTk1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0847799","name":"Ana Claudia Talancón","idIMDB":"nm0847799"},"actorId":"nm0847799","character":"Taylor Anthony","urlCharacter":"http://www.imdb.com/character/ch0052286","main":true},{"actorName":"Ray Wise","urlProfile":"http://www.imdb.com/name/nm0936403","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNTg0NDU5NF5BMl5BanBnXkFtZTcwNDQ5NTk3MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 August 1947","placeOfBirth":" Akron, Ohio, USA","birthName":"Raymond Herbert Wise","height":"5' 9½\" (1.77 m)","bio":"Raymond Herbert \"Ray\" Wise (born August 20, 1947) is an American actor. Some of his best-known roles include Leland Palmer in Twin Peaks (1990), henchman Leon C. Nash in RoboCop (1987), Jack Taggart Sr. in Jeepers Creepers II (2003), the Devil in the CW television series Reaper (2007), Donald Wadsworth in Suburban Gothic (2014). Wise was born in Akron, Ohio, graduated from Garfield High School in 1964 and attended Kent State University in Kent, Ohio. He is of Romanian descent on his mother's side.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNTg0NDU5NF5BMl5BanBnXkFtZTcwNDQ5NTk3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0936403","name":"Ray Wise","idIMDB":"nm0936403"},"actorId":"nm0936403","character":"Ted Summers","urlCharacter":"http://www.imdb.com/character/ch0094185","main":true},{"actorName":"Azura Skye","urlProfile":"http://www.imdb.com/name/nm0005439","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NDkzNjU3MV5BMl5BanBnXkFtZTgwMDgyNDY0NzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 November 1981","placeOfBirth":" Northridge, Los Angeles, California, USA","birthName":"Azura Dawn Storozynski","height":"5' 7\" (1.7 m)","bio":"Azura Skye was born on November 8, 1981 in Northridge, Los Angeles, California, USA as Azura Dawn Storozynski. She is an actress, known for Bandits (2001), 28 Days (2000) and Dragon rouge (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NDkzNjU3MV5BMl5BanBnXkFtZTgwMDgyNDY0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005439","name":"Azura Skye","idIMDB":"nm0005439"},"actorId":"nm0005439","character":"Leann Cole","urlCharacter":"http://www.imdb.com/character/ch0029738","main":true},{"actorName":"Johnny Lewis","urlProfile":"http://www.imdb.com/name/nm0507381","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2Mzc1MjgzOF5BMl5BanBnXkFtZTcwNzEyNDgzOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1983","placeOfBirth":" Los Angeles, California, USA","birthName":"Jonathan Kendrick Lewis","height":"5' 10½\" (1.79 m)","bio":"Born and raised in Los Angeles, California, the middle of three siblings, Johnny began performing from the age of 5 at a small performing arts school, making his debut as a Chanukah candle. Pursuing the acting profession, he appeared with success in many TV and film projects, handling both drama and comedy with finesse. Johnny was what used to be called a Renaissance Man. He was not only a superb actor, but excelled in the other arts as well. He was a prolific writer, poet and painter. He also was a philanthropist, donating hundreds of thousands of dollars to worthy causes, as well as being an active member of a number of charitable organizations. He had seen too many of his friends succumb to the curse of drug abuse, and so he became an outspoken advocate against drugs, using his celebrity status to speak to large groups of educators and law enforcement officials about the dangers of street and psychiatric drug abuse. He created friends everywhere he went. And he went everywhere. Europe, Asia, South America. He slept with natives in grass huts in Southeast Asia, and was the first white man allowed passage to a sacred lake in Laos. Of his many talents, one that he treasured was the mentoring of other artists. Many successful performers, some of whom have reached the top of their profession have ascribed their success to Johnny. His most recent work includes Sons of Anarchy (two seasons), Felon, The Runaways, 186 Dollars to Freedom and Lovely Molly. In late October 2011 he suffered head injuries from a motorcycle accident. Immediately thereafter his thinking and behavior took a serious turn for the worse. He was arrested on January 3, 2012 for allegedly trespassing at a neighbor's home. He was beaten violently in the head approximately 17 times before the police arrived, causing further injuries. In jail, following additional head injuries he was diagnosed by the prison medics as suffering from internal bleeding in the brain. Despite the diagnosis of Traumatic Brain Injury and despite never testing positive for drugs that year he was treated for psychosis and chemical dependency. Two more arrests followed, including near drowning (another traumatic brain incident). Symptoms of Traumatic Brain Injury include impaired judgement, sensitivity to light, and sudden inexplicable violent behavior. Typical of the misperception on the part of law enforcement officials was the often-quoted remark by the probation official who expressed that Johnny suffered from mental health issues as well as chemical dependency. Prior to his injuries Johnny had never had a brush with the law. And the toxicology report following his death revealed absolutely no drugs whatsoever in his system. In late May of 2012 the Santa Monica Superior Court allowed his admission to Ridgeview, a drug rehab center in Alta Dena, California. Though a drug rehab facility, the rest and quiet were a tonic for him, and he gradually, over the summer, regained himself. He wrote, in a journal entry, \"Felt more whole today. . .more complete. Like parts of myself had been stolen in my sleep and scattered all over the world and they've begun to return. So I think better, my thoughts aren't being sent off on their own.\" He began planning for a return to acting, via the stage, and spoke of possibly bringing Shakespeare to inner city kids. In August he tragically accepted the DA's offer to serve \"just a couple more days in jail,\" in exchange for his freedom. The \"couple days\" became nearly two months, during which he suffered additional abuse and a violent downturn in spirits and health. Finally released in late September, he died in sad and disturbing circumstances on September 26, 2012.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2Mzc1MjgzOF5BMl5BanBnXkFtZTcwNzEyNDgzOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0507381","name":"Johnny Lewis","idIMDB":"nm0507381"},"actorId":"nm0507381","character":"Brian Sousa","urlCharacter":"http://www.imdb.com/character/ch0111493","main":true},{"actorName":"Jason Beghe","urlProfile":"http://www.imdb.com/name/nm0000892","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1Mjc2MDQxN15BMl5BanBnXkFtZTcwMzAyMDgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 March 1960","placeOfBirth":" New York City, New York, USA","birthName":"Jason Deneen Beghe","height":"5' 10¾\" (1.8 m)","bio":"Jason Beghe was born on March 12, 1960 in New York City, New York, USA as Jason Deneen Beghe. He is an actor, known for Chicago P.D. (2014), The Next Three Days (2010) and Thelma & Louise (1991). He has been married to Angie Janu since 2000. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1Mjc2MDQxN15BMl5BanBnXkFtZTcwMzAyMDgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000892","name":"Jason Beghe","idIMDB":"nm0000892"},"actorId":"nm0000892","character":"Ray Purvis","urlCharacter":"http://www.imdb.com/character/ch0111492","main":true},{"actorName":"Margaret Cho","urlProfile":"http://www.imdb.com/name/nm0158632","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMTM0OTA3MV5BMl5BanBnXkFtZTgwNDc1NjM2NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 December 1968","placeOfBirth":" San Francisco, California, USA","birthName":"Margaret Moran Cho","height":"5' 5\" (1.65 m)","bio":"Margaret Cho was born Dec. 5, 1968 and raised in San Francisco. Her grandfather was a Methodist minister who ran an orphanage in Seoul during the Korean War. Ignoring the traditions of her patriarchal culture, her mother bravely resisted an arranged marriage in Korea and married Margaret's father who writes joke books - in Korean. What Margaret did know is that she didn't love being a kid. Racing toward adulthood to escape bullying, she began writing jokes for stand up at 14 and professionally performing at age 16. Getting picked on, and feeling disenfranchised, is a subject that's very near to Margaret's heart. She has become a sort of \"Patron Saint\" for Outsiders, speaking for them when they are not able to speak for themselves. Soon after starting her Stand Up career, Margaret won a comedy contest where first prize was opening for Jerry Seinfeld. She moved to Los Angeles in the early '90s and, still in her early twenties, hit the college circuit, where she immediately became the most booked act in the market and garnered a nomination for \"Campus Comedian of The Year.\" She performed over 300 concerts within two years. Arsenio Hall introduced her to late night audiences, Bob Hope put her on a prime time special and, seemingly overnight, Margaret Cho became a national celebrity. Her groundbreaking, controversial, and short-lived ABC sitcom, All-American Girl (1994) soon followed. Oddly, while chosen because of who she was-a non-conformist Korean American woman with liberal views-the powers-that-be then decided they wanted her to \"tone it down\" for the show. Challenging Margaret's feelings for both who she was and how she looked, she soon realized that though she was an Executive Producer, it was a battle she would not win. The experience was a traumatic one, bringing up unresolved feelings left over from childhood, and Margaret developed an eating disorder as a response to criticism about her body. She was so obsessive in her goal to try to be what she thought others wanted, she landed in the hospital with kidney failure. Through out a period of self-abuse, Margaret continued performing to sold-out audiences across the country in comedy clubs, theaters, and on college campuses, working to channel her anger in to something more positive. In 1999, her groundbreaking, off Broadway one-woman show, I'm The One That I Want, toured the country to national acclaim and was made into a best-selling book and feature film of the same name. After her experience with All-American Girl, Margaret wanted to make sure she would only have to answer to herself, making sure she was responsible for the distribution and sales of her film, taking a page from what music artist Ani DiFranco did with her Righteous Babe Records. The concert film, which garnered incredible reviews, broke records for most money grossed per print in movie history. In 2001, after the success of her first tour, Cho launched Notorious C.H.O., a smash-hit 37-city national tour that culminated in a sold-out concert at Carnegie Hall. Notorious C.H.O. was recorded and released as a feature film, hailed by the New York Times as \"Brilliant!\" Both films were acquired by Showtime Cable Networks, and produced by Margaret's production company, a testament to the success of Margaret's bold business model. In March of 2003, Margaret embarked on her third sold-out national tour, Revolution. It was heralded by the Chicago Sun Times as \"Her strongest show yet!\" and the CD recording was nominated for a Grammy for Comedy Album of the Year. In 2005, Cho released Assassin, which The Chicago Tribune crowed \"Packs passion in to each punch.\" The concert film premiered in select theaters and on the gay and lesbian premium channel Here! TV in late 2005. In 2007, Margaret hit the road with Cyndi Lauper, Debbie Harry and Erasure, along with indie faves The Dresden Dolls and The Cliks, to host the True Colors Tour, benefiting the Human Rights Campaign. A true entertainment pioneer, Margaret also created and starred in The Sensuous Woman, a live variety show featuring vaudevillian burlesque and comedy, which she took for an extended off-Broadway run in the fall. Margaret returned to TV in 2008 on the VH1 series, The Cho Show. The Cho Show followed Margaret, her real parents, and her eccentric entourage through a series of irreverent and outrageous experiences, shaped by Margaret's 'anything goes' brand of stand-up. It was beloved for the audience it was intended for, the ones who maybe don't quite fit in, who knew Margaret is one of them. The aptly titled Beautiful came next, exploring the good, bad and ugly in beauty, and the unattractive politicians and marketers who shape our world. The concert premiered in Australia at The Sydney Theater, marking the first time Margaret debuted a tour abroad. While touring through the US, the concert was filmed at the Long Beach theatre, aired as a special on Showtime in 2009, and then released as both a DVD and a book. In 2009 Margaret nabbed a starring role in the comedy/drama series Drop Dead Diva, airing on Lifetime. Margaret enjoys being part of a team, and not necessarily having the sole responsibility for keeping things afloat. Never one to shy away from a challenge, Margaret stepped right up to the proverbial plate when asked to do Season 11 of the #1 rated Dancing with the Stars. Paired with pro Louie Van Amstel, Margaret was on one of the show's most controversial seasons, dancing alongside Mike \"The Situation\" Sorrentino, David Hasselhoff, Jennifer Grey and Bristol Palin among others. Margaret got a very strong reaction to her Rainbow Dancing Dress during a time when the issue of bullying, especially among gay teens, was all over the media. 2010 culminated with another high honor, a second Grammy Award nomination for Comedy Album of the Year for Cho Dependent, her incredibly funny collection of music featuring collaborations with Fiona Apple, Andrew Bird, Grant Lee Phillips, Tegan & Sara, Ben Lee and more. The album received critical acclaim. Margaret self released Cho Dependent on her own Clownery Records, and was encouraged by the acclaim, as there are only a handful of people putting out albums of comedy music - \"Weird\" Al Yankovic, Flight of the Conchords, The Lonely Island, to name a few - but no women. While thrilled that her hard work was rewarded with the nomination, Margaret isn't finished with musical comedy yet, claiming to have more music in her. In 2011, Margaret released the live concert film of Cho Dependent, which also had its cable network debut on Showtime. Audiences who caught these performances live can attest that Cho hasn't lost any of her edge on Cho Dependent, her sixth live concert DVD. Shot at the Tabernacle in Atlanta, GA, Cho remains uncensored, but never unhinged, taking aim at the Palin family, her stint on Dancing With the Stars, smoking pot and living in a world with 'sexting.' The DVD is characteristically no-holds-barred Margaret and instantly a classic. Margaret is currently filming the sixth and final season on Drop Dead Diva. Cho returns as \"Teri\" Girl Friday to Brooke Elliott's \"Jane Bingham,\" whose body is inhabited by the soul of a vapid model sent back to earth after Heaven judges her as a \"zero-zero\" for having committed no good and no bad deeds. Drop Dead Diva is not only beloved on Lifetime, but by the many stars who have queued up to guest on the show, including Paula Abdul, Wanda Sykes, Rosie O'Donnell, Vivica Fox and Kim Kardashian. Not one to rest on her laurels, Margaret spent whatever free time she had crafting her all new stand-up show, the uproariously and aptly named Mother, which kicked off in September, 2012, including both a US and European tour. Paradox not lost, Margaret had to re-schedule some of the shows she had booked mid-September so she could attend the Emmy Awards with her mother. Nominated for a Primetime Emmy for Outstanding Guest Actress in a Comedy Series for her hilarious stint on 30 Rock as gender-bending North Korean leader Kim Jong Il. In 2014, Margaret filmed a pilot for FOX and was thrilled to be working with Tina Fey and the producing team from 30 Rock. The multi-camera comedy takes place at a women's college that has just opened its doors to men for the first time. While thrilled with her two Grammy and recent Emmy nod, Margaret has never turned away from the causes that are important to her. She is incredibly active in anti-racism, anti-bullying and gay rights campaigns, and has been recognized for her unwavering dedication. She was the recipient of the Victory Fund's 2008 Leadership Award and the first ever Best Comedy Performance Award at the 2007 Asian Excellence Awards. She also received the First Amendment Award from the ACLU of Southern California, and the Intrepid Award from the National Organization for Women (NOW). Throughout her career, she has been honored by GLAAD, American Women in Radio and Television, the Lambda Legal Defense and Education Fund, the National Gay and Lesbian Task Force (NGLTF), the Asian American Legal Defense and Education Fund (AALDEF), and PFLAG for making a significant difference in promoting equal rights for all, regardless of race, sexual orientation or gender identity. In June of 2011, Margaret was honored by LA Pride, receiving a Lifetime Achievement Award, recognizing an individual whose lifetime body of work has left a lasting major imprint on the LGBT community. Through her hard work, Margaret has had the opportunity to be heard, to extend her point of view and become regarded as a true pioneer in her field. She takes none of it for granted.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMTM0OTA3MV5BMl5BanBnXkFtZTgwNDc1NjM2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0158632","name":"Margaret Cho","idIMDB":"nm0158632"},"actorId":"nm0158632","character":"Det. Mickey Lee","urlCharacter":"http://www.imdb.com/character/ch0030640","main":true},{"actorName":"Meagan Good","urlProfile":"http://www.imdb.com/name/nm0328709","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGU4MDVkYmEtNzlhMC00MzRkLWE4MzItN2JmNGY5MDUxNDFjXkEyXkFqcGdeQXVyNzQwMzYyMTg@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 August 1981","placeOfBirth":" Panorama City, California, USA","birthName":"Meagan Monique Good","height":"5' 5\" (1.65 m)","bio":"Meagan Monique Good was born on 8 August 1981 in Panorama City, California, USA, to Tyra Wardlow-Doyle, who worked as her manager, and Leondis \"Leon\" Good, an LAPD officer. She began appearing on commercials at the age of four. Then she started guest-starring on series like The Parent 'Hood (1995), Touched by an Angel (1994), Moesha (1996), The Steve Harvey Show (1996) and The Division (2001). She also starred in Raising Dad (2001) with Bob Saget.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGU4MDVkYmEtNzlhMC00MzRkLWE4MzItN2JmNGY5MDUxNDFjXkEyXkFqcGdeQXVyNzQwMzYyMTg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0328709","name":"Meagan Good","nicknames":["Mz Good"],"idIMDB":"nm0328709"},"actorId":"nm0328709","character":"Shelley Baum","urlCharacter":"http://www.imdb.com/character/ch0051901","main":true},{"actorName":"Rhoda Griffis","urlProfile":"http://www.imdb.com/name/nm0341421","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNTc4ODU1MF5BMl5BanBnXkFtZTgwMzkyMjQ4NTE@._V1_UY44_CR10,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 January 1965","placeOfBirth":" Raleigh, North Carolina, USA","height":"5' 7\" (1.7 m)","bio":"Rhoda holds a BFA from the North Carolina School of the Arts. Acting onstage since the age of 7, she still \"charges her batteries\" in the theatre where she has conquered such roles as Lady MacBeth, Lady Anne and has appeared in Angels in America, Proof, Intimate Apparel, Collected Stories, Dinner with Friends and Dark at the Top of the Stairs to name a few. She enjoys every aspect of her career including film and television. Her popular character she played was Jacqueline Kennedy in Love Field (1992). She worked alongside with her good friend Emmy Rossum in Songcatcher (2000), as the wife of the coal company head (Steve Boles), Clementine McFarland. Her favorite role is the General's vixen wife, Lenore Baker, on the Lifetime series Army Wives (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNTc4ODU1MF5BMl5BanBnXkFtZTgwMzkyMjQ4NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0341421","name":"Rhoda Griffis","idIMDB":"nm0341421"},"actorId":"nm0341421","character":"Marie Layton","urlCharacter":"http://www.imdb.com/character/ch0217251","main":true},{"actorName":"Dawn Dininger","urlProfile":"http://www.imdb.com/name/nm0227716","urlPhoto":"","biography":{"bio":"Dawn Dininger is known for her work on X-Men: First Class (2011), A.I. Artificial Intelligence (2001) and 2012 (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0227716","name":"Dawn Dininger","idIMDB":"nm0227716"},"actorId":"nm0227716","character":"Monster Marie","urlCharacter":"http://www.imdb.com/character/ch0217252","main":true},{"actorName":"Ariel Winter","urlProfile":"http://www.imdb.com/name/nm1736769","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjM5Njg5M15BMl5BanBnXkFtZTgwMjY5NTQ4NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 January 1998","placeOfBirth":" Los Angeles, California, USA","birthName":"Ariel Winter Workman","height":"5' 1\" (1.55 m)","bio":"Ariel Winter is one of Hollywood's most promising young talents with notable roles both in both television and film. Ariel stars on ABC's critically acclaimed and Emmy® winning hit series, \"Modern Family (2009).\" Winter plays 'Alex Dunphy,' the brainy middle child in the Dunphy family, opposite Ty Burrell, Julie Bowen, Sarah Hyland and Nolan Gould. Winter also stars on Disney Jr. as the title character for the series \"Sofia the First (2013).\" The series follows Princess Sofia, an ordinary little girl who must adjust to royal life after her mother marries the king. The series spawned from the movie \"Sofia the First: Once Upon a Princess (2012).\" In March 2014, Ariel gave life to the voice of \"Penny Peterson\" in the animated film, \"Mr. Peabody & Sherman (2014).\" Other familiar voices in the film include Ty Burrell and Allison Janney. Ariel recently wrapped production on \"Truck Stop\" -- a 1970s based drama centered on the friendship between a kid with cerebral palsy and a troubled runaway, directed by Tony Aloupis. In 2009, Winter appeared in the thriller \"Duress (2009).\" opposite Martin Donovan. Other credits include playing \"Young Trixie\" in Warner Bros.' \"Speed Racer (2008),\" and the films \"The Chaperone (2011)\" opposite WWE star Paul Levesque (Triple H), \"Opposite Day (2009),\" \"Nic & Tristan Go Mega Dega (2010),\" and a lead role in the hit thriller \"One Missed Call (2008),\" where she plays the killer in the film. Previous television credits include the female lead in the television movie, \"Fred 2: Night of the Living Fred (2011)\" and the sequel to the hit film, \"Fred: The Movie (2010)\" on Nickelodeon, a recurring role on the final six episodes of the award winning drama \"ER (1994),\" guest-starring roles on hit TV shows Criminal Minds (2005),\" \"Crossing Jordan (2001),\" Nip/Tuck (2003)\" and \"Bones (2005).\" Winter also voiced \"Marina the Mermaid\" in the animated series, \"Jake and the Never Land Pirates (2011)\" for Disney Junior, \"Gretchen\" on Walt Disney's hit show \"Phineas and Ferb (2007)\" on Disney Channel, and has voiced characters in the hit animated film, \"Horton Hears a Who! (2008),\" and \"Bambi II (2006).\" Winter began her film career at age seven in director Shane Black's hit cult film, \"Kiss Kiss Bang Bang (2005),\" starring Val Kilmer, Robert Downey Jr. and Michelle Monaghan. Winter is an avid singer and young activist. She is involved in several charities and organizations such as the Creative Coalition, the Share Our Strength's No Kid Hungry, WWE's anti-bullying campaign Be A Star and GLSEN. Ariel Winter currently resides in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjM5Njg5M15BMl5BanBnXkFtZTgwMjY5NTQ4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1736769","name":"Ariel Winter","idIMDB":"nm1736769"},"actorId":"nm1736769","character":"Ellie Layton","urlCharacter":"http://www.imdb.com/character/ch0165856","main":true},{"actorName":"Sarah Jean Kubik","urlProfile":"http://www.imdb.com/name/nm2518364","urlPhoto":"","biography":{"bio":"Sarah Jean Kubik is an actress, known for One Missed Call (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2518364","name":"Sarah Jean Kubik","idIMDB":"nm2518364"},"actorId":"nm2518364","character":"Monster Ellie","urlCharacter":"http://www.imdb.com/character/ch0165856","main":true},{"actorName":"Raegan Lamb","urlProfile":"http://www.imdb.com/name/nm2360832","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDI2MjA3OV5BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Raegan Lamb is an actress, known for One Missed Call (2008) and The Lost & Found Family (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDI2MjA3OV5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2360832","name":"Raegan Lamb","idIMDB":"nm2360832"},"actorId":"nm2360832","character":"Laurel Layton","urlCharacter":"http://www.imdb.com/character/ch0174130","main":true},{"actorName":"Karen Beyer","urlProfile":"http://www.imdb.com/name/nm0079925","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NjE0NTMyMF5BMl5BanBnXkFtZTgwMTIyOTgyODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 2\" (1.57 m)","bio":"Karen is a proud member of SAG-AFTRA and Equity. She began her stage career as a ballerina at the age of 2, studying and performing with over a dozen dance companies throughout the Southeast. Dance evolved into musical theatre and after moving to Atlanta, Karen branched into film, television and radio. On stage, she is best known for her Southern roles and has worked in numerous theatres including: The Alliance Theatre, Theatrical Outfit, ART Station, Ansley Park Playhouse, Peachtree Playhouse, Stage Door and Actors' Express. She has been the resident choreographer at ART Station Theatre in Stone Mountain since 2001 and guest director since 2011. Karen works primarily in film and television.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NjE0NTMyMF5BMl5BanBnXkFtZTgwMTIyOTgyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0079925","name":"Karen Beyer","idIMDB":"nm0079925"},"actorId":"nm0079925","character":"Mrs. Ford","urlCharacter":"http://www.imdb.com/character/ch0217253","main":true}],"seasons":[],"idIMDB":"tt0479968","urlIMDB":"http://www.imdb.com/title/tt0479968","business":{"budget":{"money":"$27,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$12,511,473","country":"USA","day":"06","month":"01","year":"2008","remarks":"2,240 Screens"},{"money":"£432,327","country":"UK","day":"06","month":"04","year":"2008","remarks":"254 Screens"},{"money":"$9,839","country":"Estonia","day":"10","month":"02","year":"2008","remarks":"1 Screen"},{"money":"RUR 12,446,483","country":"Russia","day":"02","month":"03","year":"2008","remarks":"197 Screens"}],"gross":[{"money":"$26,876,529","country":"USA","day":"09","month":"03","year":"2008","remarks":""},{"money":"$26,812,746","country":"USA","day":"02","month":"03","year":"2008","remarks":""},{"money":"$26,713,496","country":"USA","day":"24","month":"02","year":"2008","remarks":""},{"money":"$26,598,370","country":"USA","day":"17","month":"02","year":"2008","remarks":""},{"money":"$26,555,249","country":"USA","day":"10","month":"02","year":"2008","remarks":""},{"money":"$26,436,711","country":"USA","day":"03","month":"02","year":"2008","remarks":""},{"money":"$26,073,315","country":"USA","day":"27","month":"01","year":"2008","remarks":""},{"money":"$24,940,422","country":"USA","day":"20","month":"01","year":"2008","remarks":""},{"money":"$20,493,337","country":"USA","day":"13","month":"01","year":"2008","remarks":""},{"money":"$12,511,473","country":"USA","day":"06","month":"01","year":"2008","remarks":""},{"money":"£924,675","country":"UK","day":"13","month":"04","year":"2008","remarks":""},{"money":"£432,327","country":"UK","day":"06","month":"04","year":"2008","remarks":""},{"money":"RUR 32,411,640","country":"Russia","day":"23","month":"03","year":"2008","remarks":""},{"money":"RUR 31,297,708","country":"Russia","day":"16","month":"03","year":"2008","remarks":""},{"money":"RUR 26,571,507","country":"Russia","day":"09","month":"03","year":"2008","remarks":""},{"money":"RUR 12,446,483","country":"Russia","day":"02","month":"03","year":"2008","remarks":""}],"weekendGross":[{"money":"$44,832","country":"USA","day":"09","month":"03","year":"2008","remarks":"82 Screens"},{"money":"$68,630","country":"USA","day":"02","month":"03","year":"2008","remarks":"123 Screens"},{"money":"$111,713","country":"USA","day":"24","month":"02","year":"2008","remarks":"188 Screens"},{"money":"$28,640","country":"USA","day":"17","month":"02","year":"2008","remarks":"41 Screens"},{"money":"$77,773","country":"USA","day":"10","month":"02","year":"2008","remarks":"122 Screens"},{"money":"$200,768","country":"USA","day":"03","month":"02","year":"2008","remarks":"275 Screens"},{"money":"$705,404","country":"USA","day":"27","month":"01","year":"2008","remarks":"803 Screens"},{"money":"$3,339,660","country":"USA","day":"20","month":"01","year":"2008","remarks":"1,925 Screens"},{"money":"$5,981,373","country":"USA","day":"13","month":"01","year":"2008","remarks":"2,240 Screens"},{"money":"$12,511,473","country":"USA","day":"06","month":"01","year":"2008","remarks":"2,240 Screens"},{"money":"£226,282","country":"UK","day":"13","month":"04","year":"2008","remarks":"252 Screens"},{"money":"£432,327","country":"UK","day":"06","month":"04","year":"2008","remarks":"254 Screens"}],"admissions":null,"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":[{"money":null,"country":null,"day":"17","month":"07","year":"2006","remarks":null},null],"copyrightHolder":"Equity Pictures Medienfonds GmbH &amp; Co. KG IV [de]"},"technical":{"runtime":["1 hr 27 min (87 min)"],"soundMix":["Dolby Digital","SDDS","DTS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arricam LT","Arricam ST"],"laboratory":["CineFilm Laboratory, Atlanta (GA), USA (dailies)","Technicolor, Hollywood (CA), USA (prints)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Spherical (source format)"],"printedFilmFormat":["35 mm","D-Cinema"]},"rating":"3.9","metascore":"24","filmingLocations":[{"location":"191 Peachtree Street, Atlanta, Georgia, USA"}],"rated":"PG-13","awards":[{"award":"Teen Choice Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie Actor: Horror/Thriller","names":[{"name":"Edward Burns","id":"nm0122653","role":null}]},{"category":"Choice Movie Actress: Horror/Thriller","names":[{"name":"Shannyn Sossamon","id":"nm0815370","role":null}]}]}]}],"votes":"27,492","type":"Movie","companyCreditsSimple":[{"idCompany":"co0054452","name":"Alcon Entertainment"},{"idCompany":"co0188221","name":"Missed Call Productions"},{"idCompany":"co0164688","name":"Kadokawa Pictures"}],"keywords":{"keywords":["death","voice mail","lifting someone into the air","telephone","telephone call","telephone call from self","teddy bear","supernatural power","screaming","murder","montage","flashback","chase","horror movie remake","title appears in writing","television show","television producer","telephone terror","stabbed in the eye","spirit","sister sister relationship","severed hand","pond","police station","police officer killed","police detective","phone video","peep hole","party","nanny cam","mysterious death","mother daughter relationship","library","knife","killer child","investigation","insect","impalement","hospital","hit by a train","hidden camera","hanged man","hallucination","ghost","funeral","fish tank","fire","falling from height","explosion","drowning","doll","deformity","death of sister","dead child","cut arm","crucifix","corpse","construction site","college student","choke to death","child in peril","child abuse","candy","burned with a cigarette","asthma inhaler","asthma attack","killing an animal","abusive mother","abandoned hospital","morgue","flashlight","cat","body bag","ambulance","exorcism","cell phone","remake of asian film","remake","remake of japanese film","death of friend","death of father","death of child","based on novel","number in title","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:40:38"}}