{"data":{"movies":[{"title":"Graves End","originalTitle":"","year":"2005","releaseDate":"20050422","directors":[{"name":"James Marlowe","id":"nm0549283"}],"writers":[{"name":"Rick Askew","id":"nm0039446"},{"name":"James Marlowe","id":"nm0549283"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MTMzMDE4OF5BMl5BanBnXkFtZTcwNzI0OTk0MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Thriller","Mystery"],"plot":"In Graves End, the four year-old son of the wealthy financier Tag Graves is kidnapped and the criminals demand a ransom of six million dollars. FBI agent Paul Rickman is assigned to the case that ends with the cruel death of the child and the disappearance of the requested amount. The kidnapper Luke Devilyn is arrested but is released after his trial due to fails in the evidences. He returns to Graves End, a place where the 666 dwellers welcome ex-cons rejected by other towns. When Luke Devilyn is found dead in the woods nearby the town, agent Rickman notes that the criminals that move to Graves End simply vanish, and he returns to the town for further investigation. He meets Sheriff Hooper and recognizes him from a case of bad temper and attitude with great repercussion in the past. Meanwhile, the psychopath Billy also comes to the town leaving a trail of blood behind.","simplePlot":"When society turns their back on reformed felons, the town of Graves End welcomes them but when the ex-cons disappear, FBI agent Paul Rickman comes looking for them and discovers more than he expected.","actors":[{"actorName":"Eric Roberts","urlProfile":"http://www.imdb.com/name/nm0000616","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MTk3OTgwM15BMl5BanBnXkFtZTcwODE1OTIwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1956","placeOfBirth":" Biloxi, Mississippi, USA","birthName":"Eric Anthony Roberts","height":"5' 10\" (1.78 m)","bio":"One of Hollywood's edgier, more intriguing characters running around and about for decades, Eric Anthony Roberts started life in Biloxi, Mississippi. He is the son of Betty Lou (Bredemus) and Walter Grady Roberts, one-time actors and playwrights. His siblings are actors Lisa Roberts Gillan and Julia Roberts, and he grew up in Atlanta, Georgia. He began his acting career at age 5 in a local theater company called the \"Actors and Writers Workshop\", founded by his late father. After his schooling at Grady High, he studied drama at age 17 in London for two years at the Royal Academy of Dramatic Arts, then returned to the States and continued his studies at the American Academy in New York. He made his NY stage debut in \"Rebel Women\" in 1976 at age 20 and appeared in regional productions, once playing the newspaper boy in a production of \"A Streetcar Named Desire\" starring Shirley Knight and Glenn Close. After appearing in such daytime soaps as Another World (1964) and How to Survive a Marriage (1974), his career began to shift fast forward when he copped a leading role in a major film. In King of the Gypsies (1978), based on Peter Maas' best-seller about a fracturing dynasty of New York City gypsies, he made his debut alongside an intimidating roster of stars including Judd Hirsch, Susan Sarandon, Shelley Winters and Sterling Hayden. Young Eric held his own expertly (winning a Golden Globe nomination) while his burning intensity and brooding charm marked sure signs of star potential. After this, he won the lead opposite Milo O'Shea in the 1980 stage production of \"Mass Appeal\". He suffered serious injuries in a car accident during his nascent film career but lost no fans by the time he returned to co-star with Sissy Spacek as a small-town stranger in Raggedy Man (1981). It was, however, his stark and frightening portrayal of two-bit hustler Paul Snider, the cast-off boyfriend who slays Playmate-turned-movie starlet Dorothy Stratten (played by Mariel Hemingway) in Star 80 (1983) that really put him on the movie map and earned him a second Golden Globe nomination. A wide range of fascinating, whacked-out roles were immediately offered to him on a silver plate. He played another dangerous streetwise hustler type in The Pope of Greenwich Village (1984) opposite fellow rebel Mickey Rourke; a cocky soda pop sales exec in the Australian comedy Coca-Cola kid (1985); appeared with more charm and restraint opposite Rosanna Arquette in the offbeat romantic comedy Nobody's Fool (1986) and topped his prolific period off with an Academy Award nomination as a young prison escapee hiding out with Jon Voight aboard an out-of-control train in the ultra-violent, character-driven action adventure Runaway Train (1985). Good things continued to happen when he was a replacement lead in the original run of \"Burn This\" and won a Theatre World Award for his 1988 Broadway debut. A risky, no-holds-barred actor, he was often guilty of overacting if given half the chance. His film career began to slide in the late 1980s, appearing in more quantity than quality pictures. A series of missteps led to unheralded appearances in such bombs as the karate-themed Best of the Best (1989); the NY urban thriller The Ambulance (1990); the action western Blood Red (1989), which took three years to release and is the only film Eric and his sister Julia Roberts appeared in together; and Rude Awakening (1989) when he filled in as a burned-out hippie opposite a Chong-less Cheech Marin. More under appreciated \"B\" filming came with the 1990s (Freefall (1994), Sensation (1994), The Nature of the Beast (1995), etc.), while also chewing the scenery with a number of mobster types in TV-movies, including one as \"Al Capone\". He soon began appearing as flashy secondary villains and creepies that showcased other stars instead, such as Final Analysis (1992) starring Richard Gere, Heaven's Prisoners (1996) top lining Alec Baldwin, and The Dark Knight (2008), part of the \"Batman\" series with Christian Bale and the late Heath Ledger. Eric's undeniable, unconventional talent would occasionally mesh with the perfect role. At the Sundance Film Festival in 1996, he received critical applause for his starring role as a man dying of AIDS in the uplifting and emotional film It's My Party (1996) and earned more honors as a writer marked for murder in the mob-themed story La Cucaracha (1998). He was also perfectly cast as one of the cold-blooded killers in the Emmy-nominated TV adaptation of Truman Capote's chiller In Cold Blood (1996). Eric continued to appear sporadically on TV in such dramatic series as Law & Order: Criminal Intent (2001), while sometimes showing a fun side as well in comedy (The King of Queens (1998)). His own series work included Less Than Perfect (2002) and, more recently, and in the cult program Heroes (2006) where promise for a longer participation ended with his character's death. Recovered from a long-standing cocaine problem, Eric wed, for the first time, actress/writer Eliza Roberts (nee Garrett). They have appeared in such films as Killer Weekend (2004) and Final Approach (2005). His daughter from a former relationship, Emma Roberts, is a newly popular and fast-rising \"tween\" actress from the series Unfabulous (2004) and has played youthful super-sleuth Nancy Drew (2007) on film. Eric's unpredictable, volatile nature which works so mesmerizing on screen has also led to troubling times off camera; his relationship with younger sis Julia Roberts has been seriously strained for quite some time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MTk3OTgwM15BMl5BanBnXkFtZTcwODE1OTIwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000616","name":"Eric Roberts","idIMDB":"nm0000616"},"actorId":"nm0000616","character":"Tarkington Alexander Graves / Tag","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steven Williams","urlProfile":"http://www.imdb.com/name/nm0931736","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwOTkwMjc0N15BMl5BanBnXkFtZTcwMzc1MDQ4Mg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1949","placeOfBirth":" Memphis, Tennessee, USA","height":"6' 2\" (1.88 m)","bio":"Steven Williams was born on January 7, 1949 in Memphis, Tennessee, USA. He is an actor and director, known for 21 Jump Street (1987), L.A. Heat (1996) and The Blues Brothers (1980).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwOTkwMjc0N15BMl5BanBnXkFtZTcwMzc1MDQ4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0931736","name":"Steven Williams","idIMDB":"nm0931736"},"actorId":"nm0931736","character":"Paul Rickman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Daniel Roebuck","urlProfile":"http://www.imdb.com/name/nm0736263","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmZiMTBlYTAtMTBiOS00ZjczLTg4ZGYtODk0MmFlYTNlYjBmXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1963","placeOfBirth":" Bethlehem, Pennsylvania, USA","birthName":"Daniel James Roebuck","height":"6' (1.83 m)","bio":"Having made his feature film debut starring in the teen comedy Cavegirl Daniel Roebuck quickly realized that there was only one direction to travel in his career. Up! Soon after Cavegirl, Roebuck established himself as one of the industry's youngest character actors with his haunting portrayal as the teenage killer, Samson in The River's Edge. Daniel Roebuck was born and raised in Bethlehem, Pennsylvania, A fan of movies and television from a very early age he was immediately drawn to the actors and comedians. As his obsession with performing grew his parents unwittingly fomented his future by gifting him with a cardboard TV on his seventh Christmas. At the age of 10, he started performing in talent shows doing impressions of movie stars he loved. He joined a local circus two years later and made his debut as one of the youngest clowns in the country. Roebuck's clown act eventually segued into a magic act and he performed that throughout Pennsylvania, New Jersey and New York. It was only a matter of time before Roebuck discovered the theater and from that point he never looked back. Over the next few years while still in Pennsylvania, Roebuck continued to hone his craft, acting in, directing, and even writing over 40 plays. He also began performing stand up comedy. Now, nearly 30 years later, Roebuck has amassed a substantial resume as an actor, writer and director. He has moved easily between all mediums having continued working on television, in movies and on the stage. His film credits are myriad, having starred in blockbusters like The Fugitive, US Marshals,and final Destination, as well as popular titles including Agent Cody Banks and it's sequel, That's What I Am, Money Talks, Flash Of Genius and so many more. Lately, Roebuck has enjoyed working in a number of horror movies - his favorite genre. He has collaborated with filmmaker Rob Zombie on Halloween, Halloween 2, Devil's Rejects, and Lords of Salem (as well as a commercial for AMDRO, the insecticide). He also appeared in Don Coscarelli's cult favorite Bubba Ho Tep as well as the director's Reggie's Tales and John Dies At The End. Daniel has also been a familiar face on television for nearly 3 decades, he was a regular for three seasons on the evergreen hit drama, Matlock, portraying attorney 'Cliff Lewis,\" the junior partner of the law firm headed by Andy Griffith's beloved character, 'Ben Matlock.' Interestingly, his landing the role was the fulfillment of a promise made several years earlier with his first appearance on \"Matlock\" in its inaugural season. At that time, Roebuck was told that Griffith had been so impressed with his work that he would be back as a regular on the show. It took five seasons, two more guest shots as different characters, and a change of networks, but Griffith kept his promise and Roebuck indeed became a series regular. He portrayed the irascible Rick Bettina on many episodes of Nash Bridges and in the fall of 2003 Daniel returned to series television as Pete Peterson, the gay owner of a local diner in A Minute With Stan Hooper. As a television guest star, Daniel has played countless characters. Some of his most memorable are a cop who literally turns into a pig on Grimm, a Romulan on Star Trek, Next Generation, a gun toting hostage taker on NYPD Blue, a cranky studio owner on Sonny With A Chance and a grieving father on Glee. He played other memorable roles on New Adventures of Old Christine, NCIS, Ghost Whisperer, CSI, Boston Legal, CSI Miami, Law And Order, Desperate Housewives and Hot in Cleveland. On the popular show, Lost, Roebuck portrayed the infamous Dr. Leslie Arzt, the aggravating science teacher whose explosive exit in the finale of the first season remains one of television's most surprising and talked about moments. He has starred in dozens of TV Movies. Perhaps his most famous turn was his critically acclaimed portrayal of Jay Leno in The Late Shift. He stepped into another pair of famous shoes when he played Garry Marshall in Behind The Camera; Mork and Mindy, The Unauthorized Story. Other Movies for television include A Family Lost, A Glimpse Of Hell, Murder At The Presidio, Shredderman Rules, A Borrowed Life, Quints and many others. Daniel's voice over work includes Christmas Is Here Again (a film he also produced),The Haunted World Of El Super Beasto and the groundbreaking video game, L.A. Noire. The theater remains Roebuck's first love and he has continued that passion in the Los Angeles area. He appeared in the world premiers of Sarcophagus and Crooks. He has also starred in No Time For Sergeants, Here Lies Jeremy Troy, Arsenic and Old Lace and The Man Who Came To Dinner among others. In 2006 Daniel founded THE Saint Francis Stage Company. Behind the camera, Roebuck has produced, written and directed/co-directed a number of documentaries including Halloween: The Happy Haunting of America and it's sequel as well as Goolians, Movieland Memories and a number of documentaries for the Monsterama series. Daniel has fulfilled nearly every dream of his childhood like appearing in Mad Magazine, becoming a toy and a Halloween mask and having his mug on a few trading cards. When not performing, Roebuck writes articles about Horror Movies, raises two children, teaches The Audition is the Job Experience and mentors young actors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmZiMTBlYTAtMTBiOS00ZjczLTg4ZGYtODk0MmFlYTNlYjBmXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0736263","name":"Daniel Roebuck","idIMDB":"nm0736263"},"actorId":"nm0736263","character":"Sheriff Hooper","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Valerie Mikita","urlProfile":"http://www.imdb.com/name/nm0586546","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NjUxMTM5Nl5BMl5BanBnXkFtZTgwNzY1MTMzNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Valerie Mikita was born in Mahanoy City, Pennsylvania. At the age of 4, her family moved to the Windy City, \"Chi-Town.\" This is where Valerie fell in love with Musical Theatre, and more importantly, found her own voice. During her senior year in High School, Valerie was recruited by a professional touring theatre company and began touring the U.S. showing off her insurmountable acting chops and those powerful vocal chords. Upon completion of the 2 year tour, Valerie ignited a newfound talent... singing The Star Spangled Banner at sporting events around the Midwest, like \"Friday Night Fights,\" on ESPN and dozens of \"Chicago Bulls\" games, which earned her the nickname, \"The National Anthem Girl.\" At the height of the Chicago Bulls popularity, she snagged the coveted position of featured lounge singer at Dennis Rodman's infamous nightclub, \"Illusions.\" To expand her versatility and range, she also sang with a cover band during that time... everything from Pop & Rock to Dance and Oldies... kicking it off with her \"Fabulous Baker Boys\" routine. This eventually led to dozens of radio and TV commercials, where Valerie caught the attention of a top Chicago producer who took her under his wing and created a sultry Pop/R&B album, which took her on a tour across the US, Canada & London. He called her the White Janet Jackson. All the while, Valerie continued pursuing her acting career, landing lead roles in over a dozen independent feature films, as well as local and national commercials, which led to hosting a local children's show called, \"@ Random,\" for 2 years. Valerie's big break into National TV, came with the internationally acclaimed, \"Jenny Jones Show.\" She became infamously known as the sexy, witty, anything goes, segment host/comedian/correspondent for a period of 5 years. She appeared live on stage and also traveled the country, interviewing every different kind of person...from celebrities to everyday folks who watched the show religiously. With the love of entertainment in her blood, Valerie moved to LA and immediately landed the lead in the independent comedy, \"Guy in Row Five,\" a recurring role on \"Overhaulin,\"for TLC, a pilot for the FX Network and another short film called, \"The Eye of Dan\". In 2006, Valerie starred opposite Eric Roberts & Steven Williams in the dramatic thriller, \"Graves End,\" and played a co-starring role on \"CSI.\" She can also be seen in the film, \"The Wayshower,\" with Jsu Garcia and Peter Stormare, where she plays a mental patient in an insane asylum. Taking a hiatus from acting, Valerie decided to concentrate on live trade show presenting and on-camera hosting. She can be seen regularly hosting a variety of commercials, infomercials and new media promo videos. Most recently, Valerie just finished filming a leading role in the first episode of a new show on the Investigation Discovery Network. Words that describe Valerie: Vivacious, Fearless, Edgy, Quick-witted, Funny as Hell, and 100% committed to her craft.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NjUxMTM5Nl5BMl5BanBnXkFtZTgwNzY1MTMzNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0586546","name":"Valerie Mikita","nicknames":["One Take Jake","Tiny Powerhouse"],"idIMDB":"nm0586546"},"actorId":"nm0586546","character":"Krissi Graves","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fairly Tull","urlProfile":"http://www.imdb.com/name/nm1502511","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNDE0NzYwMl5BMl5BanBnXkFtZTgwODQ0OTkyMDI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 May 1946","placeOfBirth":" Baton Rouge, Louisiana, USA","birthName":"Virginia Fairly Land","height":"4' 9\" (1.45 m)","bio":"Born in Baton Rouge, Louisiana, Fairly began her acting career in children's theatre at the age 8. She continued in theatre until she graduated from Louisiana State University with a degree in fashion and costume design. She married her high school sweetheart, Clyde Tull, who retired from the Army as a full Colonel and started a second career as an actor also. While he was on active duty, Fairly and Clyde lived and traveled all over the United States and the world. Along the way, she picked up smatterings of a number of languages and learned numerous accents. Fairly still loves to travel and keeps her passport current. While Clyde served in the Army, Fairly worked as a social worker specializing in foster care and adoptions, retail management, and real estate brokerage and management. Her largest real estate management project was a 1700 acre, ocean-front, historic district with housing units, office buildings, research facilities, 2 hospitals, and ground leases for Golden Gate Bridge. Fairly returned to her first passion, acting, in 1991. She worked in small regional theatres for several years before moving to Los Angeles in 2001 where she and Clyde are active in film, television, and commercials.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNDE0NzYwMl5BMl5BanBnXkFtZTgwODQ0OTkyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1502511","name":"Fairly Tull","idIMDB":"nm1502511"},"actorId":"nm1502511","character":"Maudy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edward Perotti","urlProfile":"http://www.imdb.com/name/nm1679209","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NTEyNDM0Nl5BMl5BanBnXkFtZTgwODUxMjE0MjE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 August 1965","placeOfBirth":" San Francisco, California, USA","height":"6' 3\" (1.91 m)","bio":"Edward Perotti was born on August 7, 1965 in San Francisco, California, USA. He is an actor, known for Graves End (2005), Kill Jane Doe (2010) and Richard III (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NTEyNDM0Nl5BMl5BanBnXkFtZTgwODUxMjE0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1679209","name":"Edward Perotti","idIMDB":"nm1679209"},"actorId":"nm1679209","character":"Doc","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sky Soleil","urlProfile":"http://www.imdb.com/name/nm1534043","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NzUzOTU2MV5BMl5BanBnXkFtZTgwODk1NTE3NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Sky Cameron Soleil","height":"6' (1.83 m)","bio":"Sky Soleil was born on September 14th, 1977 in Huntington Beach, CA. He is an actor and director, known for How My Dad Killed Dracula (2008), Homeless Man Under Pressure (2010) and Straight Outta Compton (2015). Sky obtained his Master's Degree in Fine Arts from the American Conservatory Theater (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NzUzOTU2MV5BMl5BanBnXkFtZTgwODk1NTE3NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1534043","name":"Sky Soleil","idIMDB":"nm1534043"},"actorId":"nm1534043","character":"Billy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nick Stellate","urlProfile":"http://www.imdb.com/name/nm1391796","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NDcwMjU0MV5BMl5BanBnXkFtZTgwOTEzOTU3MjE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 January 1967","placeOfBirth":" Bronx, New York, USA","birthName":"Nicholas Joseph Stellate","height":"5' 10\" (1.78 m)","bio":"Born in The Bronx projects, raised on Long Island and Westchester, New York. Nick's dreams became reality in 1997 when he got his SAG card. Followed shortly by worldwide recognition from doing a variety of voices on Pokémon (1997). He moved to Los Angeles in 1999, where his acting career began to blossom. He's worked with and become friends with some of his heroes like Eric Roberts, Mickey Rourke, Al Pacino, Viggo Mortensen, Tony Shaloub, Renee Zellwegger to name a few. Nick counts his blessings to be working. From 1990-2000, Nick used the stage / SAG name \"Nicholas James Tate.\" Which he dedicated to silent film star Harold Lloyd, as a tribute to Harold attending \"Tate University\" in one of his silent films. Nick's screen / stage credits changed to his birthname-Nick Stellate-as of 2001. Most of his credits prior to 2001, occured while he was living in New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NDcwMjU0MV5BMl5BanBnXkFtZTgwOTEzOTU3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1391796","name":"Nick Stellate","nicknames":["Nicky Nick","New York Nick"],"idIMDB":"nm1391796"},"actorId":"nm1391796","character":"Luke Devilyn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anthony Santucci","urlProfile":"http://www.imdb.com/name/nm1160245","urlPhoto":"","biography":{"bio":"Anthony Santucci is an actor and producer, known for Graves End (2005), The Unwilling (2007) and Kidschool (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1160245","name":"Anthony Santucci","idIMDB":"nm1160245"},"actorId":"nm1160245","character":"Tedesco","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe Wyka","urlProfile":"http://www.imdb.com/name/nm1679489","urlPhoto":"","biography":{"bio":"Joe Wyka is an actor, known for Graves End (2005) and She, the Ultimate Weapon (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1679489","name":"Joe Wyka","idIMDB":"nm1679489"},"actorId":"nm1679489","character":"Mark","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adam Del Rio","urlProfile":"http://www.imdb.com/name/nm1120246","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MjgwODQyM15BMl5BanBnXkFtZTYwMDAzNjgy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 May 1981","placeOfBirth":" San Francisco, California, USA","height":"6' (1.83 m)","bio":"Adam was born in Fremont, California. Fremont is located in the San Francisco bay area. He bounced around his younger years to Utah, and then back to San Francisco before ending up in Pacifica, California. Pacifica is where he did most of his growing up. Learning to surf and skateboard at an early age made this town a good place for him. In Terra Nova High school he ran cross country (a sport that rubbed off to this day) and played baseball, and basketball. He filled his days at Terra Nova participating in the drama club where his love of acting and stand-up-comedy was fed. At night he went to San Francisco (about a 20-minute drive) where he did stand up gigs. He left high school his junior year to pursue acting and stand up comedy. Shortly after he became friends with Rob Schneider. Rob helped motivate Adam to strongly pursue acting. The Hot Chick (2002) was the first time they were able to work together. Adam enjoys running, reading (mostly about the cosmos and theoretical physics), surfing, and of course acting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MjgwODQyM15BMl5BanBnXkFtZTYwMDAzNjgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1120246","name":"Adam Del Rio","nicknames":["Dwayne Dibbley"],"idIMDB":"nm1120246"},"actorId":"nm1120246","character":"Brian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Geno Carvalho","urlProfile":"http://www.imdb.com/name/nm1645215","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMTQyMTc5Ml5BMl5BanBnXkFtZTcwOTg5ODUzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Geno Carvalho is an actor, known for Tall Trees (2006), Graves End (2005) and Where Are You Going? Where Have You Been? (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMTQyMTc5Ml5BMl5BanBnXkFtZTcwOTg5ODUzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1645215","name":"Geno Carvalho","idIMDB":"nm1645215"},"actorId":"nm1645215","character":"Terry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Durand Ford","urlProfile":"http://www.imdb.com/name/nm1370680","urlPhoto":"","biography":{"bio":"Durand Ford is an actor and producer, known for Graves End (2005), Porndogs: The Adventures of Sadie (2009) and Day in Summer (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1370680","name":"Durand Ford","idIMDB":"nm1370680"},"actorId":"nm1370680","character":"Telephone Repair Worker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shawny Hoops","urlProfile":"http://www.imdb.com/name/nm2608100","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4OTk2NDM1NV5BMl5BanBnXkFtZTYwMDgyNDQy._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Shawny Hoops is an actress, known for Graves End (2005) and Nash Bridges (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4OTk2NDM1NV5BMl5BanBnXkFtZTYwMDgyNDQy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2608100","name":"Shawny Hoops","idIMDB":"nm2608100"},"actorId":"nm2608100","character":"Amanda","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dave Heintzelman","urlProfile":"http://www.imdb.com/name/nm2702448","urlPhoto":"","biography":{"bio":"Dave Heintzelman is known for his work on Graves End (2005) and War Path.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2702448","name":"Dave Heintzelman","idIMDB":"nm2702448"},"actorId":"nm2702448","character":"FBI Agent","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0419781","urlIMDB":"http://www.imdb.com/title/tt0419781","business":{"budget":{"money":"$1,930,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"05","month":"05","year":"2004","remarks":null},null],"copyrightHolder":"© 2005 GRAVES END, INC. (on print)"},"technical":{"runtime":["1 hr 30 min (90 min) (USA)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.3","filmingLocations":[{"location":"Ben Lomond, California, USA"}],"awards":[{"award":"Action on Film International Film Festival, USA 2005","titlesAwards":[{"titleAwardOutcome":"Won Action on Film Award","categories":[{"category":"Best Actor","names":[{"name":"Steven Williams","id":"nm0931736","role":null},{"name":"Marlowe-Pugnetti Company, The","id":null,"role":null}]}]},{"titleAwardOutcome":"2nd place Best in Show","categories":[{"category":"Best Picture","names":[{"name":"James Marlowe","id":"nm0549283","role":null},{"name":"Marlowe-Pugnetti Company, The","id":null,"role":null}]}]},{"titleAwardOutcome":"Nominated AOF/WAB Award","categories":[{"category":"Best Actor in a Leading Role","names":[{"name":"Eric Roberts","id":"nm0000616","role":null},{"name":"Marlowe-Pugnetti Company, The","id":null,"role":null}]}]}]},{"award":"Chicago Horror Film Festival 2005","titlesAwards":[{"titleAwardOutcome":"Won Jury Award","categories":[{"category":"Best Film","names":[{"name":"James Marlowe","id":"nm0549283","role":null}]}]}]},{"award":"Normal Indy Horror Film Festival 2005","titlesAwards":[{"titleAwardOutcome":"Won Best of Show","categories":[{"category":"","names":[{"name":"James Marlowe","id":"nm0549283","role":null}]}]},{"titleAwardOutcome":"Won Festival Prize","categories":[{"category":"Best Director","names":[{"name":"James Marlowe","id":"nm0549283","role":null}]},{"category":"Best Actor","names":[{"name":"Steven Williams","id":"nm0931736","role":null}]},{"category":"Best Actress","names":[{"name":"Fairly Tull","id":"nm1502511","role":null}]}]}]},{"award":"ShockerFest 2005","titlesAwards":[{"titleAwardOutcome":"Won Horror Genre Award","categories":[{"category":"Best Picture - Feature","names":[{"name":"James Marlowe","id":"nm0549283","role":null}]},{"category":"Best Actor - Feature","names":[{"name":"Steven Williams","id":"nm0931736","role":null}]}]}]}],"votes":"1,695","type":"Movie","companyCreditsSimple":[{"idCompany":"co0134250","name":"Marlowe/Pugnetti Company"},{"idCompany":"co0131137","name":"Marlowe-Pugnetti Company, The"}],"keywords":{"keywords":["violent death","suspense","revenge","plot twist"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:33:09"}}