{"data":{"movies":[{"title":"Mickey's Twice Upon a Christmas","originalTitle":"","year":"2004","releaseDate":"20041108","directors":[{"name":"Carole Holliday","id":"nm0390511"},{"name":"Matthew O'Callaghan","id":"nm0639965"}],"writers":[{"name":"Bill Motz","id":"nm0609600"},{"name":"Bob Roth","id":"nm0744793"}],"runtime":"68 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4ODk0MDg2NV5BMl5BanBnXkFtZTcwMTM2MzcyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation","Comedy","Family","Fantasy"],"plot":"Mickey and the gang team up for a new holiday adventure and for the first time ever they are all computer animated. There will be five mini films that include: Belles on Ice, Christmas:Impossible, Christmas Maximus, Donald's Gift, Mickey's Dog-Gone Christmas","simplePlot":"Sequel to Mickey's Once Upon a Christmas","actors":[{"actorName":"Wayne Allwine","urlProfile":"http://www.imdb.com/name/nm0021656","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMzAzODAzOF5BMl5BanBnXkFtZTcwMDQwMTk5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 February 1947","placeOfBirth":" Glendale, California, USA","birthName":"Wayne Anthony Allwine","bio":"Wayne Allwine was born on February 7, 1947 in Glendale, California, USA as Wayne Anthony Allwine. He is known for his work on Mickey, Donald, Goofy: The Three Musketeers (2004), Mickey's Christmas Carol (1983) and Who Framed Roger Rabbit (1988). He was married to Russi Taylor, Kim Knowlton, Karla Marie (Hokr) Carlsen and Alyson Page. He died on May 18, 2009 in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMzAzODAzOF5BMl5BanBnXkFtZTcwMDQwMTk5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0021656","name":"Wayne Allwine","idIMDB":"nm0021656"},"actorId":"nm0021656","character":"Mickey Mouse","urlCharacter":"http://www.imdb.com/character/ch0000630","main":true},{"actorName":"Tony Anselmo","urlProfile":"http://www.imdb.com/name/nm0030615","urlPhoto":"","biography":{"dateOfBirth":"18 February 1960","placeOfBirth":" Salt Lake City, Utah, USA","bio":"Tony Anselmo was born on February 18, 1960 in Salt Lake City, UT, and formed an early fascination with all things Disney sparked by a screening of Mary Poppins (1964) at the age of five. His family moved to Sunnyvale, in northern California, when he was seven, and he continued to actively study Disney and animation. He began drawing, built a light table of his own, and began creating animation with a Super 8 camera. He attended Marian A. Peterson High School in Sunnyvale, and began to cultivate his talents with night art classes at local colleges, and began regular correspondence with the artists who animated the Disney films, including Frank Thomas, Ollie Johnston, Eric Larson, and Milt Kahl. With the support and encouragement of his Disney Animation correspondents, Anselmo was able to attend California Institute of the Arts on a Disney Family Fellowship. He began his studies in the Character Animation Department at CalArts in the fall 1978. The school had a standard four-year degree program, but because of its close connection with the Disney Studio, the students' work was subject to the scrutiny of studio executives. Anselmo was selected to transfer to the Studio after only his second year. On September 1, 1980, he reported for work to the Disney Animation department in Burbank, CA. In subsequent years, Anselmo contributed to the animation of 20 Disney animated features, including The Black Cauldron (1985), The Little Mermaid (1989), Beauty and the Beast (1991), The Lion King (1994), Tarzan (1999), and The Emperor's New Groove (2000). One of the Disney stalwarts that Anselmo frequently encountered during his early days at Disney was Clarence Nash, the original voice of Donald Duck. Anselmo asked Nash to show him his vocal technique. From time to time, the two continued their informal \"training\" in performing Donald's dialogue. When Nash passed away on February 20, 1985, Anselmo inherited the role of Donald Duck as Nash had wished. Anselmo's first performance as Donald was on a television program titled DTV Valentine (1986) a special on The Disney Channel, and since then, Anselmo has voiced Donald hundreds of projects, including television, feature films, theme parks, and consumer products. Anselmo has also shared voice-over duties (with Russi Taylor) for Huey, Dewey, and Louie since 1999. He has voiced the nephews on Mickey Mouse Works (1999) and Mickey Mouse Works: Episode #2.1 (1999) (while Taylor voiced the nephews in DuckTales (1987), Mickey's Once Upon a Christmas (1999), and Mickey's Twice Upon a Christmas (2004), Mickey's Speedway USA (2000), and the remastered DuckTales: Remastered (2013),) He also lent his voice to minor characters in The Great Mouse Detective (1986), Mickey's Around the World in 80 Days (2005), and Phineas and Ferb (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0030615","name":"Tony Anselmo","idIMDB":"nm0030615"},"actorId":"nm0030615","character":"Donald Duck","urlCharacter":"http://www.imdb.com/character/ch0000719","main":true},{"actorName":"Jeff Bennett","urlProfile":"http://www.imdb.com/name/nm0071818","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTQwMjU2Ml5BMl5BanBnXkFtZTcwNDQwMzgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 October 1962","placeOfBirth":" Houston, Texas, USA","birthName":"Jeffrey Glenn Bennett","bio":"Jeff Bennett was born on October 2, 1962 in Houston, Texas, USA as Jeffrey Glenn Bennett. He is an actor, known for Johnny Bravo (1997), James Bond Jr. (1991) and Enchanted (2007). He has been married to Susan E. Welby since October 8, 1988. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTQwMjU2Ml5BMl5BanBnXkFtZTcwNDQwMzgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0071818","name":"Jeff Bennett","idIMDB":"nm0071818"},"actorId":"nm0071818","character":"Elf #1 / Elf #2 / Grouchy Man / Donner","urlCharacter":"http://www.imdb.com/character/ch0051980","main":true},{"actorName":"Jim Cummings","urlProfile":"http://www.imdb.com/name/nm0191906","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1Mzk5OTc4NV5BMl5BanBnXkFtZTcwOTE3NjUxNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1952","placeOfBirth":" Youngstown, Ohio, USA","birthName":"James Jonah Cummings","height":"5' 8\" (1.73 m)","bio":"Born James Jonah Cummings on November 3, 1952, he grew up in Youngstown, Ohio. Sooner or later, he moved to New Orleans. There, he designed Mardi Gras floats, was a singer, door-to-door salesman, and a Louisiana riverboat deckhand. Then Cummings moved to Anaheim, California, where he started his career playing Lionel from the program Dumbo's Circus (1985).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1Mzk5OTc4NV5BMl5BanBnXkFtZTcwOTE3NjUxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0191906","name":"Jim Cummings","idIMDB":"nm0191906"},"actorId":"nm0191906","character":"Blitzen","urlCharacter":"http://www.imdb.com/character/ch0051981","main":true},{"actorName":"Bill Farmer","urlProfile":"http://www.imdb.com/name/nm0267724","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MDY1NDY1MV5BMl5BanBnXkFtZTcwNDI4MDkwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 November 1952","placeOfBirth":" Pratt, Kansas, USA","bio":"Bill Farmer was born on November 14, 1952 in Pratt, Kansas, USA. He is an actor, known for Toy Story (1995), A Goofy Movie (1995) and Monsters, Inc. (2001). He has been married to Jennifer Wynne Farmer since 1985. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MDY1NDY1MV5BMl5BanBnXkFtZTcwNDI4MDkwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0267724","name":"Bill Farmer","idIMDB":"nm0267724"},"actorId":"nm0267724","character":"Goofy / Pluto","urlCharacter":"http://www.imdb.com/character/ch0027852","main":true},{"actorName":"Tress MacNeille","urlProfile":"http://www.imdb.com/name/nm0534134","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMTQ1NzY5N15BMl5BanBnXkFtZTcwMDY5NDUwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1951","placeOfBirth":" Chicago, Illinois, USA","birthName":"Teressa Claire Payne","height":"5' 4½\" (1.64 m)","bio":"Tress MacNeille is one of the most talented women in the voice-over industry to date. With her versatile talent has done the voices of Dot Warner from Animaniacs, Babs Bunny from Tiny Toon Adventures to being a featured singer in the Weird \"Al\" Yankovic song \"Ricky\", She has also appeared in a small part in the full-length motion picture \"Elvira Mistress of the Dark\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMTQ1NzY5N15BMl5BanBnXkFtZTcwMDY5NDUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0534134","name":"Tress MacNeille","idIMDB":"nm0534134"},"actorId":"nm0534134","character":"Daisy Duck","urlCharacter":"http://www.imdb.com/character/ch0000629","main":true},{"actorName":"Jason Marsden","urlProfile":"http://www.imdb.com/name/nm0005189","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MDI4MzQ2MV5BMl5BanBnXkFtZTYwODM4MjEz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 January 1975","placeOfBirth":" Providence, Rhode Island, USA","birthName":"Jason Christopher Marsden","height":"5' 3\" (1.6 m)","bio":"With a career spanning more than 25 years, Jason Marsden has been affectionately referred to as that guy from that show. The seasoned actor has worked in film and television with the best and the brightest, including Ridley Scott (White Squall (1996)), Robert Downey Jr. (Ally McBeal (1997)), James Woods (Shark (2006)), Billy Crystal (Mr. Saturday Night (1992)), Jim Carrey (Fun with Dick and Jane (2005)), and countless others. With more than 150 credits to his name, Jason Marsden has definitely made a dent in the entertainment industry. Originally from Warwick, Rhode Island, Jason and his parents relocated to California when he was 11 years old. After just a few weeks of his new after-school activity--scene study and commercial training--the charismatic Jason was instantly signed by an agency and saturated with auditions for film, television, voice-over, commercials, and more. After turns on General Hospital (1963), Webster (1983), and Murphy Brown (1988), Jason was cast as \"Eddie Munster\" in the revamped The Munsters Today (1987), which ran for three seasons in syndication. From there, he appeared on Tales from the Crypt (1989), Anything But Love (1989), and Star Trek: The Next Generation (1987) before landing his second series regular role as Dash X on the series Eerie, Indiana (1991). His character actor appeal soon caught the attention of Billy Crystal, who cast him as a younger version of himself in the film Mr. Saturday Night (1992). For the next few years, Jason co-starred in numerous television shows, including Baywatch (1989), Blossom (1990), Star Trek: Deep Space Nine (1993). He starred in two more sitcoms after that. Almost Home (1993), with Brittany Murphy, and Tom (1994), which starred Tom Arnold. He was soon asked to recur on Full House (1987), as D.J.'s rich boyfriend, Nelson Burkhard. His teen-heartthrob status earned him another recurring gig for two years on the popular TGIF series Boy Meets World (1993). Shortly after, he joined the cast of Step by Step (1991) (which starred Suzanne Somers and Patrick Duffy) for its final two seasons. The silver screen soon called to Jason and, at age twenty, he was offered a role appearing opposite Jeff Bridges in White Squall (1996). On a production that spanned eight countries, he shared the screen with contemporaries Scott Wolf, Jeremy Sisto, Ryan Phillippe, and Balthazar Getty. Upon returning to the states, Jason propelled himself into more network television, appearing in episodes of The Jamie Foxx Show (1996), Ally McBeal (1997), Bram and Alice (2002), Even Stevens (2000), Just Shoot Me! (1997), and Shark (2006). It was his unforgettable guest-starring role as Kim on Will & Grace (1998), however, that earned him a place alongside Eric McCormack, Debra Messing, and Harry Connick Jr.. Somehow, among all of his on-camera work, Jason has also managed to amass over 100 credits behind the mike. He has lent his voice to some of animation's most beloved characters in cartoon series, feature films, radio programs, and more. Jason has played a wide range of roles--from the main male character in the English-language dub of the Academy Award-winning Spirited Away (2001), to the son of one of Disney's favorite dogs in A Goofy Movie (1995). At present, he is wrapping the first season of Hasbro's G.I. Joe: Renegades (2010) for the HUB network, The Fairly OddParents (2001) for Nickelodeon, and Garfield & Cie (2008) on Cartoon Network. If you're a video-game fan, you've probably heard Jason in such epic games as Fallout: New Vegas (2010), Star Wars: Knights of the Old Republic (2003), and the title role in Tak and the Power of Juju (2003). Jason is also a proud member of the Directors Guild of America. Having helmed the season finale of Nickelodeon's The Journey of Allen Strange (1997), he has subsequently directed numerous music videos as well as several short films. His latest short film, Locker 13 (2014) (starring Krista Allen and Rick Hoffman), earned official selection at Palm Springs Shorts Fest, the Phoenix Film Festival, the Nashville International Film Festival, and continues touring the 2010-2011 film-festival circuit. Back in the spotlight once again, Jason has recently appeared in several independent films including High Hopes (2006) (with David Faustino and Jason Mewes), Pizza Man (2011) (starring Frankie Muniz), and the much-anticipated Blue Like Jazz (2012), based on the famed novel, which just wrapped filming in Nashville, Tennessee. While working on his current projects, Jason is studying the Charles Conrad Method at the Steve Eastin Studio and enjoying the role he was born to play--a loving husband to his wife Christy Marsden and awesome dad of his son, Clark Otis.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MDI4MzQ2MV5BMl5BanBnXkFtZTYwODM4MjEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005189","name":"Jason Marsden","nicknames":["J-Mars","Jay"],"idIMDB":"nm0005189"},"actorId":"nm0005189","character":"Max Goof","urlCharacter":"http://www.imdb.com/character/ch0022570","main":true},{"actorName":"Chuck McCann","urlProfile":"http://www.imdb.com/name/nm0564841","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNTc1NTI4M15BMl5BanBnXkFtZTYwMzc5MDQ0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 September 1934","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"6' 3\" (1.91 m)","bio":"A third generation performer, Chuck McCann was already a show business veteran by age 11. By age 19, he had performed in nightclubs, made guest TV appearances, and was a semi-regular on The Steve Allen Show. Chuck's extensive career includes The Chuck McCann Show, Let's Have Fun Show, Little Orphan Annie, The World of Hans Christian Anderson, Herbie Rides Again, Men in Tights, Storyville. His credits also include creating, writing and starring in the popular children's shows Far Out Space Nuts, and Chuck McCann's Funstuff. Chuck now performs voices for several animated shows where he does the voices of Duckworth and The Beagle Boys for Ducktails, the series, and Ducktails: The Movie, Leatherneck on G.I. Joe, The Thing on Fantastic Four and Blizzard on Iron Man.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNTc1NTI4M15BMl5BanBnXkFtZTYwMzc5MDQ0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0564841","name":"Chuck McCann","nicknames":["Jack Frost","Jackie McCann"],"idIMDB":"nm0564841"},"actorId":"nm0564841","character":"Santa Claus","urlCharacter":"http://www.imdb.com/character/ch0004985","main":true},{"actorName":"Clive Revill","urlProfile":"http://www.imdb.com/name/nm0720890","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODEwODI0N15BMl5BanBnXkFtZTcwNDMwODYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1930","placeOfBirth":" Wellington, New Zealand","birthName":"Clive Selsby Revill","height":"5' 7\" (1.7 m)","bio":"A grand, well-respected actor of stage, film and television, most people think New Zealander Clive Revill is British. Although most people think of the curly, red-haired gent as a comic eccentric best known for his sterling work on the musical stage, he has been highly regarded for his formidable dramatic work in Shakespearean roles. A man of many skills, Clive Selsby Revill was born on April 18, 1930, in Wellington, New Zealand, and educated at Rongotai College and Victoria University (Wellington). Once trained for a career as an accountant, he abruptly switched gears and made his stage debut in Auckland, New Zealand playing Sebastian in \"Twelfth Night\" in 1950. He then moved to England to study with the Old Vic School in London. While there he appeared at Stratford-on-Avon in mid-1950s presentations of \"Hamlet\", \"Love's Labour's Lost\", \"The Merchant of Venice\", \"Julius Caesar\" and \"The Tempest\", among others. Having made his Broadway debut back in 1952 with \"Mr. Pickwick\", he took a juicy chunk out of the Big Apple upon returning to New York in the 1960s with his critically lauded, Tony Award-nominated work in \"Irma La Douce\" and as \"Fagin\" in \"Oliver!\" He has delighted audiences for years with his larger-than-life musical roles, particularly in the Gilbert and Sullivan operettas \"The Mikado\" and \"The Pirates of Penzance\". Other have included \"Sherry\", \"Lolita\" and \"The Mystery of Edwin Drood\" -- replacing the late George Rose in the last mentioned after the actor's untimely death in 1988. Most adept at ethnic roles (he has played everything from Chinese to Russian), he has become legendary for his acute sense of comic timing and uncanny use of body language. Revill has reveled over the years playing delightfully pompous, hissable gents to the hilt. Making an inauspicious debut in an unbilled role in 1956, his more pronounced movie work includes Kaleidoscope (1966), The Assassination Bureau (1969), The Private Life of Sherlock Holmes (1970), Avanti! (1972), for which he received a Golden Globe nomination, The Legend of Hell House (1973), Mack the Knife (1989) and Sacré Robin des Bois (1993). Twice divorced, Revill has one daughter, Kate Selsby (aka Kate Selsby Revill), by his second marriage to Suzi Schor-Revill, and makes his home in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODEwODI0N15BMl5BanBnXkFtZTcwNDMwODYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0720890","name":"Clive Revill","idIMDB":"nm0720890"},"actorId":"nm0720890","character":"Narrator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Russi Taylor","urlProfile":"http://www.imdb.com/name/nm0853122","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1ODEwNTIxNV5BMl5BanBnXkFtZTcwNjA4ODkxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 May 1944","placeOfBirth":" Cambridge, Massachusetts, USA","birthName":"Russell Taylor","height":"5' 1\" (1.55 m)","bio":"Russi Taylor was born on May 4, 1944 in Cambridge, Massachusetts, USA as Russell Taylor. She is an actress, known for The Simpsons (1989), The Simpsons Movie (2007) and Babe, le cochon devenu berger (1995). She was previously married to Wayne Allwine.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1ODEwNTIxNV5BMl5BanBnXkFtZTcwNjA4ODkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0853122","name":"Russi Taylor","idIMDB":"nm0853122"},"actorId":"nm0853122","character":"Minnie Mouse / Huey / Dewey / Louie","urlCharacter":"http://www.imdb.com/character/ch0000681","main":true},{"actorName":"Alan Young","urlProfile":"http://www.imdb.com/name/nm0949241","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MTU1NDE1Ml5BMl5BanBnXkFtZTYwOTQwODk1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1919","placeOfBirth":" Tynemouth, Northumberland, England, UK","birthName":"Angus Young","height":"5' 10\" (1.78 m)","bio":"Alan Young was born in Northern England in 1919, but his Scots father moved the family to Edinburgh, Scotland, when Young was a toddler and then to Canada when Young was about 6 years old. As a boy, he suffered from severe asthma, which kept him bedridden for long periods of time but encouraged his love of radio. By age 13, Young had become a radio performer, and by age 17, he was writing and performing in his own radio show for the Canadian Broadcasting Corporation. The show was broadcast in the U.S. and led to an invitation to New York, initiating Young's career as an \"All-American boy,\" despite his non-American origins and a vestigial Scots accent. He became popular on American radio from 1944 to 1949 with his \"Alan Young Radio Show,\" but when radio began to lose its popularity and his show was canceled, Young decided to put together a comedy act and tour the U.S. theater circuit. After this experience, he wrote a television pilot for CBS in 1950, which resulted in The Alan Young Show (1950). The show was a well-received live revue that ran for 3 years, earned a couple of Emmy Awards, and garnered Young a star on the \"Walk of Fame.\" However, the strain of writing and performing a weekly show got to Young, and the quality of the show declined, leading to his departure from the show and its cancellation. In the meantime, based on his popularity on radio and television, Young had established a film career, starting with his debut in Margie (1946) followed by Chicken Every Sunday (1949), Mr. Belvedere Goes to College (1949), Aaron Slick from Punkin Crick (1952), Androcles and the Lion (1952), Gentlemen Marry Brunettes (1955), Tom Thumb (1958), and The Time Machine (1960). In the early 1960s, Young landed his best-known role, Wilbur Post, in the popular television series Mister Ed (1958), which ran for 5 years. Since then, Young has made a number of television and film appearances but is known primarily for his voice characterizations in cartoons, especially as Scrooge McDuck in DuckTales (1987).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MTU1NDE1Ml5BMl5BanBnXkFtZTYwOTQwODk1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0949241","name":"Alan Young","nicknames":["Al Young"],"idIMDB":"nm0949241"},"actorId":"nm0949241","character":"Uncle Scrooge McDuck","urlCharacter":"http://www.imdb.com/character/ch0027722","main":true},{"actorName":"Gregg Berger","urlProfile":"http://www.imdb.com/name/nm0074185","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNTk3MjUzNF5BMl5BanBnXkFtZTcwNzI2ODkwMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1950","placeOfBirth":" Saint Louis, Missouri, USA","bio":"Gregg Berger was born on December 10, 1950 in Saint Louis, Missouri, USA. He is an actor, known for Transformers: Devastation (2015), Final Fantasy XIII-2 (2011) and Garfield & Cie (2008). He is married to Dora Berger. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNTk3MjUzNF5BMl5BanBnXkFtZTcwNzI2ODkwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0074185","name":"Gregg Berger","idIMDB":"nm0074185"},"actorId":"nm0074185","character":"Additional Voices","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cork Hubbert","urlProfile":"http://www.imdb.com/name/nm0399155","urlPhoto":"","biography":{"dateOfBirth":"3 July 1952","placeOfBirth":" Pendleton, Oregon, USA","birthName":"Carl Hubbert","height":"4' 11\" (1.5 m)","bio":"Cork Hubbert was born on July 3, 1952 in Pendleton, Oregon, USA as Carl Hubbert. He was an actor, known for Legend (1985), Caveman (1981) and Under the Rainbow (1981). He died on September 28, 2003 in Venice, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0399155","name":"Cork Hubbert","idIMDB":"nm0399155"},"actorId":"nm0399155","character":"Additional Voices","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kellie Martin","urlProfile":"http://www.imdb.com/name/nm0005192","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NzY4NDU3Ml5BMl5BanBnXkFtZTcwNjkyMjUwMw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 October 1975","placeOfBirth":" Riverside, California, USA","birthName":"Kellie Noelle Martin","height":"5' 2\" (1.57 m)","bio":"Kellie Martin was born on October 16, 1975 in Riverside, California, USA as Kellie Noelle Martin. She is an actress and director, known for Life Goes On (1989), A Goofy Movie (1995) and ER (1994). She has been married to Keith Christian since May 15, 1999. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NzY4NDU3Ml5BMl5BanBnXkFtZTcwNjkyMjUwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005192","name":"Kellie Martin","idIMDB":"nm0005192"},"actorId":"nm0005192","character":"Additional Voices","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edie McClurg","urlProfile":"http://www.imdb.com/name/nm0566052","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMTY0NzEyMl5BMl5BanBnXkFtZTcwNDk1OTkxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 July 1951","placeOfBirth":" Kansas City, Missouri, USA","bio":"Edie McClurg began her performing career at age five with the oxymoronic Kansas City Rhythm Kids. She retired when the dance teacher was arrested on a morals charge for \"dating\" the tall and lissome, yet underage, star dancer in the troupe. That girl's big number culminated with a back-bend where Edie drank a soda upside down (of course). Edie has a Master of Science from Syracuse and taught radio at the University of Missouri/Kansas City for eight years. There she re-entered the entertainment field as a DJ, newswoman and producer for the NPR affiliate KCUR-FM. Her proudest moment was portraying John Ehrlichman in Conversation 26 of the NPR national broadcast of the Nixon Tape Transcripts. Thus did Edie contribute to the peaceful overthrow of the government of an unindicted co-conspirator. Her career-long devotion to satirical improvisation included an impressive tenure with The Groundlings. She went on to create original characters, performed on the daytime The David Letterman Show (1980): Mrs. Marv Mendenhall, Dot Duncan, Whirly June Pickens, Officer Jeanelle Archer, 105-year-old Edie, etc. TV has been a home to many of Edie's characters--on The Richard Pryor Show (1977); as Lucille Tarlek, wife of mega-obnoxious ad salesman Herb Tarlek on WKRP in Cincinnati (1978); and as Mrs. Poole on Valerie (1986). Her movie career growth paralleled her ten years with The Groundlings. Her first film was the teen horror favorite Carrie (1976). She did several John Hughes films, including Ferris Bueller's Day Off (1986), Planes, Trains & Automobiles (1987), She's Having a Baby (1988) and _Curly Sue (1990)_. Offbeat cult faves are Eating Raoul (1982), Elvira: Mistress of the Dark (1988), HBO's The Pee Wee Herman Show (1981) and Martin Mull's The History of White People in America (1985). In more mainstream films, she received a National Media Award for her portrayal of a mentally disabled woman in Bill: On His Own (1983), starring Mickey Rooney. She's acted for Robert Redford in A River Runs Through It (1992), for Oliver Stone in Natural Born Killers (1994), for Diane Keaton in Raccroche! (2000) and she was named Best Actress of the Chicago Alternative Film Festival for her portrayal of Unabomber Ted Kaczynski's mother. A few of Edie's most recent accomplishments: Fat Actress (2005)' Rude Lady in Restroom, David Spade's nasty neighbor in Dickie Roberts: Former Child Star (2003), Dana Carvey's mother in Sony Pictures' The Master of Disguise (2002), Jane Kaczmarek's friend in Malcolm in the Middle (2000), guest-starring on CSI: Crime Scene Investigation (2000), NBC's Providence (1999), WB's 7th Heaven (1996), Lea Thompson's mother on Caroline in the City (1995) and several animation roles for TV and in features, such as The Little Mermaid (1989), The Rugrats Movie (1998) and as Dr. Flora in A Bug's Life (1998). She also did the voice of a Midwestern minivan for Pixar's Cars (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMTY0NzEyMl5BMl5BanBnXkFtZTcwNDk1OTkxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0566052","name":"Edie McClurg","idIMDB":"nm0566052"},"actorId":"nm0566052","character":"Additional Voices","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0424279","urlIMDB":"http://www.imdb.com/title/tt0424279","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 8 min (68 min) (USA)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.7","filmingLocations":[],"rated":"G","awards":[{"award":"DVD Exclusive Awards 2005","titlesAwards":[{"titleAwardOutcome":"Won DVDX Award","categories":[{"category":"Best Original Score (for a DVD Premiere Movie)","names":[{"name":"Stephen James Taylor","id":"nm0853200","role":null}]}]},{"titleAwardOutcome":"Nominated DVDX Award","categories":[{"category":"Best Animated Character Performance (Voice and Animation in a DVD Premiere Movie)","names":[{"name":"Russi Taylor","id":"nm0853122","role":"voice"},{"name":"Marlon Nowe","id":"nm1761894","role":"supervising animator"}]},{"category":"Best Screenplay (for a DVD Premiere Movie)","names":[{"name":"Bill Motz","id":"nm0609600","role":null},{"name":"Bob Roth","id":"nm0744793","role":null},{"name":"Peggy Holmes","id":"nm0391996","role":null},{"name":"Chad Fiveash","id":"nm1241294","role":null},{"name":"James Patrick Stoteraux","id":"nm1008217","role":null},{"name":"Matthew O'Callaghan","id":"nm0639965","role":null},{"name":"Shirley Pierce","id":"nm0682473","role":null},{"name":"Jim Peronto","id":"nm2225741","role":null},{"name":"Carole Holliday","id":"nm0390511","role":null},{"name":"Michael Shipley","id":"nm0963386","role":null},{"name":"Jim Bernstein","id":"nm0963343","role":null},{"name":"Walt Disney Home Entertainment","id":null,"role":null}]}]}]},{"award":"Motion Picture Sound Editors, USA 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing in Direct to Video","names":[{"name":"Donald J. Malouf","id":"nm0540655","role":"supervising sound editor"},{"name":"Dan Yale","id":"nm0945149","role":"supervising foley editor"},{"name":"Thomas Whiting","id":"nm0926034","role":"supervising dialogue editor/supervising adr editor"},{"name":"Dominick Certo","id":"nm0148833","role":"music editor"},{"name":"Todd Toon","id":"nm0002477","role":"sound effects editor"},{"name":"G.W. Brown","id":"nm0113584","role":"dialogue editor"},{"name":"Lisa J. Levine","id":"nm0505878","role":"dialogue editor"},{"name":"Devon Heffley Curry","id":"nm0006935","role":"dialogue editor"},{"name":"Tammy Fearing","id":"nm0269881","role":"adr editor"},{"name":"Charles W. Ritter","id":"nm0728726","role":"foley editor"}]}]}]}],"votes":"2,502","type":"Video","companyCreditsSimple":[{"idCompany":"co0092035","name":"DisneyToon Studios"},{"idCompany":"co0008970","name":"Walt Disney Pictures"}],"keywords":{"keywords":["christmas","sequel","cartoon hippopotamus","computer animation","cartoon alligator","3d animation","snow","cartoon","cgi","alligator","ice skating","hippopotamus","dog","mouse","cgi animation","anthropomorphic animal","anthropomorphism","disney animated sequel","family relationships","cartoon mouse","cartoon duck","cartoon dog","storybook in opening shot","surrealism","pluto the character","goofy the character","second part","duck","reindeer","joy","grouch","friendship","christmas tree","christmas carol","celebration","scrooge mcduck","santa claus","reference to minnie mouse","huey dewey and louie","reference to daisy duck","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:35:38"}}