{"data":{"movies":[{"title":"Wah-Wah","originalTitle":"","year":"2005","releaseDate":"20060602","directors":[{"name":"Richard E. Grant","id":"nm0001290"}],"writers":[{"name":"Richard E. Grant","id":"nm0001290"}],"runtime":"120 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMTk2Njc0MV5BMl5BanBnXkFtZTcwODk4NDUzMQ@@._V1.jpg","countries":["UK","France","South Africa"],"languages":["English"],"genres":["Drama"],"plot":"Set at the end of the '60s, as Swaziland is about to receive independence from Great Britain, the film follows the young Ralph Compton, at 12, through his parents' traumatic separation, till he's 14. It is written and directed by Richard E Grant, and based on true events from Richard E Grant's childhood.","simplePlot":"Set at the end of the '60s, as Swaziland is about to receive independence from Great Britain, the film follows the young Ralph Compton, at 12, through his parents' traumatic separation, ... ","actors":[{"actorName":"Gabriel Byrne","urlProfile":"http://www.imdb.com/name/nm0000321","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMzE1ODA1Ml5BMl5BanBnXkFtZTcwODY3MjU5MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1950","placeOfBirth":" Dublin, Ireland","birthName":"Gabriel James Byrne","height":"5' 10\" (1.78 m)","bio":"Byrne was the first of six children, born in Dublin, Ireland. His father was a cooper and his mother a hospital worker. He was raised Catholic and educated by the Irish Christian Brothers. He spent five years of his childhood in a seminary training to be a Catholic priest. He later said, \"I spent five years in the seminary and I suppose it was assumed that you had a vocation. I have realized subsequently that I didn't have one at all. I don't believe in God. But I did believe at the time in this notion that you were being called.\" He attended University College Dublin, where he studied archeology and linguistics, and became proficient in Irish. He played football (soccer) in Dublin with the Stella Maris Football Club. Byrne worked in archeology after he left UCD but maintained his love of his language, writing Draíocht (Magic), the first drama in Irish on Ireland's national Irish television station, TG4, in 1996. He discovered his acting ability as a young adult. Before that he worked at several occupations which included being an archaeologist, a cook, a bullfighter, and a Spanish schoolteacher. He begin acting when he was 29. He began on stage at the Focus Theatre and the Abbey Theatre in Dublin, later he joined the Royal Court Theatre and the Royal National Theatre in London. Byrne came to prominence on the final season of the Irish television show The Riordans, later starring in the spin-off series, Bracken. He made his film début in 1981 as Lord Uther Pendragon in John Boorman's King Arthur epic, Excalibur. Byrne is featured as therapist Dr. Paul Weston in the critically acclaimed HBO series In Treatment (2008). In his return to theater in 2008, he appeared as King Arthur in Lerner and Loewe's Camelot with the New York Philharmonic which was featured in a PBS broadcast in the Live From Lincoln Center series in May of 2008. Byrne did not visit America until he was 37. In 1988, Byrne married actress Ellen Barkin with whom he has two children. The couple separated amicably in 1993 and divorced in 1999. Byrne resides in Brooklyn, New York. In November 2004, Byrne was appointed a UNICEF Ireland Ambassador. In 2007 Byrne was presented with the first of the newly created Volta awards at the 5th Jameson Dublin International Film Festival. This was for lifetime achievement in acting. He also received the Honorary Patronage of the University Philosophical Society, of Trinity College, Dublin on February 20, 2007. He was awarded an honorary degree in late 2007 by the National University of Ireland, Galway, in recognition of Byrne's \"outstanding contribution to Irish and international film\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMzE1ODA1Ml5BMl5BanBnXkFtZTcwODY3MjU5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000321","name":"Gabriel Byrne","idIMDB":"nm0000321"},"actorId":"nm0000321","character":"Harry Compton","urlCharacter":"http://www.imdb.com/character/ch0080003","main":true},{"actorName":"Emily Watson","urlProfile":"http://www.imdb.com/name/nm0001833","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzc5MjE0N15BMl5BanBnXkFtZTcwMzUyNTMzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 January 1967","placeOfBirth":" Islington, London, England, UK","birthName":"Emily Margaret Watson","height":"5' 8\" (1.73 m)","bio":"Emily Watson was born and raised in London, the daughter of Katharine (Venables), an English teacher, and Richard Watson, an architect. After a self-described sheltered upbringing, Watson attended university for three years in Bristol, studying English literature. She applied to drama school and was rejected on her first attempt. After three years of working in clerical and waitress jobs she was finally accepted. In 1992, she took a position with the Royal Shakespeare Company where she met her future husband, Jack Waters. Continuing stage work, Watson landed her first screen role as Bess McNeill in Breaking the Waves (1996) after Helena Bonham Carter pulled out of the role. For this initial foray into movies, Watson was nominated for an Academy Award. She continued to gain success in Britain in the leading roles in Metroland (1997) and The Mill on the Floss (1997), but her first popular film in the United States came in 1997 when she played Daniel Day-Lewis's long-suffering love interest in The Boxer (1997). In the next two years she won critical acclaim for her portrayal of cellist Jacqueline du Pré in Hilary and Jackie (1998) and landed a small part in the ensemble cast of Tim Robbins's Cradle Will Rock (1999). Critical acclaim and North American success came together for Watson in 1999 with the release of Angela's Ashes (1999), the film adaptation of Frank McCourt's bestselling book of the same name. She achieved top billing as Angela McCourt, the hardworking mother of several children and wife of a drunken husband in depression-era Ireland. After less-celebrated roles in 2000's Trixie (2000) and The Luzhin Defence (2000), Watson again returned to an ensemble cast in Robert Altman's Gosford Park (2001). Watson's status as a leading actress in major Hollywood productions was cemented in 2002 with her roles in Dragon rouge (2002), the third installment of Thomas Harris' Hannibal Lechter series; the futuristic Equilibrium (2002); and, most notably, in Paul Thomas Anderson's Punch-Drunk Love (2002), playing opposite Adam Sandler. While returning to the stage in 2002 and 2003 on both sides of the Atlantic, Watson has expressed interest in again working with Anderson. Emily Watson lives in London, England, UK, with her husband, Jack Waters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzc5MjE0N15BMl5BanBnXkFtZTcwMzUyNTMzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001833","name":"Emily Watson","idIMDB":"nm0001833"},"actorId":"nm0001833","character":"Ruby Compton","urlCharacter":"http://www.imdb.com/character/ch0121990","main":true},{"actorName":"Julie Walters","urlProfile":"http://www.imdb.com/name/nm0910278","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NDA2NjE0M15BMl5BanBnXkFtZTcwMjk2ODIyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1950","placeOfBirth":" Smethwick, West Midlands, England, UK","birthName":"Julia Mary Walters","height":"5' 3\" (1.6 m)","bio":"For decades, Brit actress and comedienne Julie Walters has served as a sturdy representation of the working class with her passionate, earthy portrayals on England's stage, screen and TV. A bona fide talent, her infectious spirit and self-deprecating sense of humor eventually captured the hearts of international audiences. The small and slender actress with the prominent cheekbones has yet to give an uninteresting performance. She was born Julia Mary Walters on February 22, 1950 in Smethwick, West Midlands, England, the youngest of three children and only daughter of Mary Bridget (O'Brien), an Irish-born postal clerk from County Mayo, and Thomas Walters, an English-born builder, from Birmingham. Convent schooled in Birmingham, she expressed an early desire to act. Her iron-willed mother had other ideas, however, and geared her towards a nursing career. Dutifully applying at Queen Elizabeth Hospital in Birmingham, Julie eventually gave up nursing when the pull to be an actress proved too strong. Studying English and Drama at Manchester Polytechnic, she subsequently joined a theatre company in Liverpool and apprenticed as a stand-up comic. A one-time company member of the Vanload improv troupe, she made her London stage debut in the aptly-titled comedy \"Funny Peculiar\" in 1975, and went on to develop a successfully bawdy act on the cabaret circuit. While at Manchester, Julie befriended aspiring writer/comedienne Victoria Wood and the twosome appeared together in sketch comedy. A couple of their works, \"Talent\" and \"Nearly a Happy Ending,\" transferred to TV and were accompanied by rave reviews. Eventually they were handed their own TV series, Wood and Walters (1981). In 1980, Julie scored a huge solo success under the theatre lights when she made her London debut in Willy Russell's \"Educating Rita.\" For her superlative performance she won both the Variety Critic's and London Critic's Circle Awards as the young hairdresser who vows to up her station in life by enrolling in a university. She conquered film as well when Educating Rita (1983) transferred to the big screen opposite Michael Caine as her Henry Higgins-like college professor, collecting a Golden Globe Award and Oscar nomination. Reuniting with Victoria Wood in 1984, the pair continue to appear together frequently on TV, most recently with the award-winning series Dinnerladies (1998). On stage Julie has impressed in a variety of roles ranging from the contemporary (\"Fool for Love,\" \"Frankie and Johnny at the Clair de Lune\") to the classics (\"Macbeth,\" \"The Rose Tattoo\" and \"All My Sons\"), winning the Olivier Award for the last-mentioned play. Following her success as Rita, she immediately rolled out a sterling succession of film femmes including her seedy waitress-turned-successful brothel-owner in Personal Services (1987); the unsophisticated, small-town wife of Phil Collins in Buster (1988); a boozy, man-chasing mum in Killing Dad or How to Love Your Mother (1990); and Liza Minnelli's abrasive tap student in Stepping Out (1991). Playing a wide variety of ages, she also mustered up a very convincing role as the mother of Joe Orton in the critically-acclaimed Prick Up Your Ears (1987). She capped her career in films as the abrasively stern but encouraging dance teacher in Billy Elliot (2000) which earned her a second Oscar nod and a healthy helping of quirky character parts, including her charming, charity-driven widow who poses à la natural in Calendar Girls (2003), and the maternal witch-wife Molly Weasley in the J.K. Rowling \"Harry Potter\" series. For her work on film and TV, the British Academy of Film and Television Arts has honored Julie five times, including four awards in a row (2001-2004). Married to Grant Roffey since 1997 after a 12-year relationship, the couple tend to a 70-acre organic farm they bought in Sussex. They have one child. Julie was honored with an OBE for her services to drama in 1999. A biography was published in 2003 entitled \"Julie Walters: Seriously Funny.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NDA2NjE0M15BMl5BanBnXkFtZTcwMjk2ODIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0910278","name":"Julie Walters","idIMDB":"nm0910278"},"actorId":"nm0910278","character":"Gwen Traherne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicholas Hoult","urlProfile":"http://www.imdb.com/name/nm0396558","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMTYxNzMzNF5BMl5BanBnXkFtZTcwMTU0NTcxOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 December 1989","placeOfBirth":" Wokingham, Berkshire, England, UK","birthName":"Nicholas Caradoc Hoult","height":"6' 2¾\" (1.9 m)","bio":"Nicholas Caradoc Hoult was born in Wokingham, Berkshire, England to parents Glenis and Roger Hoult. His great-aunt was one of the most popular actresses of her time, Dame Anna Neagle. He attended Sylvia Young Theatre School, a school for performing arts, to start acting as a career. Hoult has been acting since appearing in the film Intimate Relations (1996); his breakthrough role was in About a Boy (2002), where he starred as Marcus Brewer alongside Hugh Grant. In 2005, he starred in his first American film The Weather Man (2005) as Nicolas Cage's son. At age 17, he received recognition for starring as Tony Stonem in the BAFTAs-awarded British teen drama series Skins (2007) for two seasons until 2008. Later he played the role of Kenny Potter in the Oscar-nominated film A Single Man (2009) after being discovered by director Tom Ford. In late 2010, Nicholas Hoult was cast as Beast in X-Men: First Class (2011), and reprised his role in the X-Men franchise in later films X-Men: Days of Future Past (2014) and X-Men: Apocalypse (2016). He then starred as R in romance / horror zombie film Warm Bodies (2013) alongside Teresa Palmer. In 2015 he starred in Mad Max: Fury Road (2015), five years after he was cast as Nux due to some delays. Hoult will star in the upcoming historical and biographical film The Current War (2017), as Nikola Tesla, and in Rebel in the Rye (2017). His other roles include Silas in Equals (2015) opposite Kristen Stewart and Jack in Jack the Giant Slayer (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMTYxNzMzNF5BMl5BanBnXkFtZTcwMTU0NTcxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0396558","name":"Nicholas Hoult","nicknames":["Nick"],"idIMDB":"nm0396558"},"actorId":"nm0396558","character":"Ralph Compton - 14 years","urlCharacter":"http://www.imdb.com/character/ch0140450","main":true},{"actorName":"Miranda Richardson","urlProfile":"http://www.imdb.com/name/nm0001669","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NzM2ODE5N15BMl5BanBnXkFtZTcwNzAyMDc0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 March 1958","placeOfBirth":" Southport, Lancashire, England, UK","birthName":"Miranda Jane Richardson","height":"5' 5\" (1.65 m)","bio":"Miranda Richardson was born in Southport, Lancashire, England on March 3, 1958, to Marian Georgina (Townsend) and William Alan Richardson, a marketing executive. She has one sister, eight years her senior. Her parents and sister are not involved in the performing arts. At an early age she performed in school plays, having shown a talent and desire to \"turn herself into\" other people. She has referred to it as \"an emotional fusion; you think yourself into them\". This mimicry could be of school friends or film stars. She left school (Southport High School for Girls) at the age of 17, and originally intended becoming a vet. She also considered studying English literature in college, but decided to concentrate on drama and enrolled at the Bristol Old Vic Theatre School (as did many well-known British actors). After three years she graduated and moved into repertory theatre. She became affiliated with the Library Theatre in Manchester in 1979, where she became an assistant stage manager. She obtained her Equity card, and after several regional productions, first appeared on the London stage (Moving at Queens Theatre) in 1981. British television roles soon followed, and then film. Since then, Miranda has moved into the international arena, and has made films in America, France and Spain. Television work (on both sides of the Atlantic) continues, as does some stage work. Her roles are diverse, but powerful and engaging. She has been quoted as stating \"what I basically like is doing things I haven't done before\" and this continually comes through in the variety of roles she has played in her career. She is also selective in the roles she takes, being uninterested in performing in the standard Hollywood fare, and preferring more offbeat roles. She was approached to play the Glenn Close role in Fatal Attraction (1987), but found it \"regressive in its attitudes\". Her attitude is summed up by a quote from an interview that appeared in the New York Times (Dec 27 1992): \"I would rather do many small roles on TV, stage or film than one blockbuster that made me rich but had no acting. And if that's the choice I have to make, I think I've already made it\". According to \"1994 Current Biography Yearbook\", she resides in South London with her two Siamese cats, Otis and Waldo. She has now moved to West London. Her hobbies include drawing, walking, gardening, fashion, falconry, and music. She, by her own admission, is a loner and lives rather modestly. An actor who studied with Ms Richardson at the Bristol Old Vic Theatre in the late 1970s described her as \"a strong minded, specially gifted, rather pretty young woman who enjoys wearing jewelry. She wore toe rings, which in the late 1970s and especially in England, were a rarity and considered rather racy.\" He also remarked on her drive, even then, to be an actress of the highest caliber.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NzM2ODE5N15BMl5BanBnXkFtZTcwNzAyMDc0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001669","name":"Miranda Richardson","idIMDB":"nm0001669"},"actorId":"nm0001669","character":"Lauren Compton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zac Fox","urlProfile":"http://www.imdb.com/name/nm1687586","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMjk4NTUyMF5BMl5BanBnXkFtZTcwOTQzOTIyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1990","placeOfBirth":" Truro, Cornwall, England, UK","height":"5' 10\" (1.78 m)","bio":"Zac Fox was born on September 25, 1990 in Truro, Cornwall, England. He is an actor, known for Wah-Wah (2005), Walter's War (2008) and Love Written in Blood (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMjk4NTUyMF5BMl5BanBnXkFtZTcwOTQzOTIyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1687586","name":"Zac Fox","idIMDB":"nm1687586"},"actorId":"nm1687586","character":"Ralph Compton - 11 years old","urlCharacter":"http://www.imdb.com/character/ch0140450","main":true},{"actorName":"Celia Imrie","urlProfile":"http://www.imdb.com/name/nm0408309","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY2ODkzOTE2NF5BMl5BanBnXkFtZTgwNDAwODA2NDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1952","placeOfBirth":" Guildford, Surrey, England, UK","birthName":"Celia Diana Savile Imrie","height":"5' 5½\" (1.66 m)","bio":"Celia Diana Savile Imrie is an English actress. She is known for her appearances with Victoria Wood; including Claire in Pat and Margaret (1994), Philippa Moorcroft in Dinnerladies (1998-2000) and playing various characters in the sketch show Victoria Wood As Seen On TV (1985-87), including Miss Babs in the spoof soap opera sketches Acorn Antiques. She reprised the role of Miss Babs in Acorn Antiques: The Musical! in 2005, and won the Olivier Award for Best Supporting Performance in a Musical. Imrie's other television roles include Marianne Bellshade in Bergerac (1983), Diana Neal in After You've Gone (2007-08), Gloria Millington in Kingdom (2007-09), and Miss Kizlet in the 2013 Doctor Who season opener The Bells of Saint John. Her film appearances include Highlander (1986), Hilary and Jackie (1998), Bridget Jones's Diary (2001), Calendar Girls (2003), Bridget Jones: The Edge of Reason (2004), Imagine Me & You (2005), The Best Exotic Marigold Hotel (2012) and The Second Best Exotic Marigold Hotel (2015). She has been described as \"one of the most successful British actresses of recent decades\". Imrie was born in 1952 in Guildford, Surrey, the fourth of five children of Diana Elizabeth Blois (née Cator) and David Andrew Imrie, a radiologist. Her father was from Glasgow, Scotland. Imrie was educated at Guildford High School, an independent school for girls in her hometown of Guildford, followed by the Guildford School of Acting. Imrie's varied career spans films, television and radio drama, and the theatre. Her film credits include Nanny McPhee, Hilary and Jackie (playing Iris du Pré) and the 1997 film of The Borrowers where she played Homily Clock. Other films include Bridget Jones's Diary, Calendar Girls, Highlander and, as Fighter Pilot Bravo 5, in Star Wars: Episode I - The Phantom Menace. In 2004, Imrie played Doctor Imogen Reed in the schoolgirl thriller, Out of Bounds. In 2007 Imrie appeared in St Trinian's. Television series to feature Imrie include The Nightmare Man, Oranges Are Not the Only Fruit, Casualty, Absolutely Fabulous, \"Bergerac\",The Darling Buds of May and Upstairs, Downstairs. In the 2000 miniseries of Gormenghast, she played Lady Gertrude. She also had a guest appearance in an episode of the BBC Scotland sitcom Still Game in 2003, where she played a home help called Mrs Begg. She also appeared in the 2005 BBC television drama Mr. Harvey Lights a Candle, playing the part of a teacher taking an unruly party of pupils on a day-trip to Salisbury Cathedral. She starred in the BBC sitcom, After You've Gone, alongside Nicholas Lyndhurst and in the ITV1 drama Kingdom, with Stephen Fry. Her part in After You've Gone has, whilst being critically acclaimed, been described as \"criminally squandered\". In 2013 she guest starred in the BBC's Doctor Who where she played the villainous Miss Kizlet in the series opener The Bells of Saint John. Her radio work includes parts in BBC Radio 4's No Commitments, Adventures of a Black Bag, and Bleak Expectations. In early 2007, she narrated the book Arabella, broadcast over two weeks as the Book at Bedtime. In May 2016, she made her US television debut in the DC action-adventure series Legends of Tomorrow. Imrie is perhaps best known for her frequent collaborations with Victoria Wood, with whom she has appeared in TV programmes such as the sitcom Dinnerladies and sketch show Victoria Wood As Seen On TV. It was on the latter show in 1985 that she first played the infamous part of Miss Babs, owner of Acorn Antiques, a parody of the low budget British soap opera Crossroads. These sketches became such a British institution that the show was turned into a West End musical in 2005 starring most of the original cast (see the picture on the right). Imrie won an Olivier Award for her performance. The character has curly blonde hair, and is known for her frequent parodic flirtations with the customers, and her abuse of the housekeeper Mrs Overall (portrayed by Julie Walters). Imrie was the guest on Desert Island Discs on BBC Radio 4 on 13 February 2011. On 18 October 2013 she was awarded an honorary doctorate by the University of Winchester.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY2ODkzOTE2NF5BMl5BanBnXkFtZTgwNDAwODA2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0408309","name":"Celia Imrie","nicknames":["Impie","Ceals","Celia Impie"],"idIMDB":"nm0408309"},"actorId":"nm0408309","character":"Lady Riva Hardwick","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Julian Wadham","urlProfile":"http://www.imdb.com/name/nm0905554","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0Mjc4MTI4N15BMl5BanBnXkFtZTcwNTY2MzAyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 August 1958","placeOfBirth":" Ware, Hertfordshire, England, UK","birthName":"Julian Neil Rohan Wadham","height":"5' 11½\" (1.82 m)","bio":"Julian Wadham was born on August 7, 1958 in Ware, Hertfordshire, England as Julian Neil Rohan Wadham. He is an actor, known for The English Patient (1996), Exorcist: The Beginning (2004) and Outpost (2008). He was previously married to Shirley Cassedy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0Mjc4MTI4N15BMl5BanBnXkFtZTcwNTY2MzAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0905554","name":"Julian Wadham","idIMDB":"nm0905554"},"actorId":"nm0905554","character":"Charles Bingham","urlCharacter":"http://www.imdb.com/character/ch0032465","main":true},{"actorName":"Fenella Woolgar","urlProfile":"http://www.imdb.com/name/nm0941211","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MzA0OTI1Nl5BMl5BanBnXkFtZTgwMjg3MjIxNDE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 August 1969","placeOfBirth":" London, England, UK","height":"5' 6\" (1.68 m)","bio":"Fenella Woolgar was born on August 4, 1969 in London, England. She is an actress, known for Bright Young Things (2003), Doctor Who (2005) and Home Fires (2015). She has been married to Dr. Robert Harland since 2006. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MzA0OTI1Nl5BMl5BanBnXkFtZTgwMjg3MjIxNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0941211","name":"Fenella Woolgar","nicknames":["Nelly"],"idIMDB":"nm0941211"},"actorId":"nm0941211","character":"June Broughton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Matshikiza","urlProfile":"http://www.imdb.com/name/nm0559344","urlPhoto":"","biography":{"dateOfBirth":"26 November 1954","placeOfBirth":" Johannesburg, South Africa","bio":"John Matshikiza was born on November 26, 1954 in Johannesburg, South Africa. He was an actor and director, known for Cry Freedom (1987), Le souffle du démon (1992) and Yankee Zulu (1993). He died on September 15, 2008 in Johannesburg.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0559344","name":"John Matshikiza","idIMDB":"nm0559344"},"actorId":"nm0559344","character":"Dr. Zim Mzimba","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sid Mitchell","urlProfile":"http://www.imdb.com/name/nm0593730","urlPhoto":"","biography":{"dateOfBirth":"1981","placeOfBirth":" London, England, UK","bio":"Sid Mitchell was born in 1981 in London, England. He is an actor, known for Vera Drake (2004), Henry VIII (2003) and Cleanskin (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0593730","name":"Sid Mitchell","idIMDB":"nm0593730"},"actorId":"nm0593730","character":"Vernon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Carlisle","urlProfile":"http://www.imdb.com/name/nm0137629","urlPhoto":"","biography":{"dateOfBirth":"6 September 1935","placeOfBirth":" England, UK","birthName":"John Roxburgh Clark","bio":"John Carlisle was born on September 6, 1935 in England as John Roxburgh Clark. He was an actor, known for Emergency-Ward 10 (1957), New Scotland Yard (1972) and The Bunker (2001). He died on December 7, 2011 in London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0137629","name":"John Carlisle","idIMDB":"nm0137629"},"actorId":"nm0137629","character":"Sir Gifford Hardwick","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mathokoza Sibiya","urlProfile":"http://www.imdb.com/name/nm2741574","urlPhoto":"","biography":{"bio":"Mathokoza Sibiya is an actor, known for Wah-Wah (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2741574","name":"Mathokoza Sibiya","idIMDB":"nm2741574"},"actorId":"nm2741574","character":"Dozen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sindisiswe Nxumalo","urlProfile":"http://www.imdb.com/name/nm2742307","urlPhoto":"","biography":{"bio":"Sindisiswe Nxumalo is an actress, known for Wah-Wah (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2742307","name":"Sindisiswe Nxumalo","idIMDB":"nm2742307"},"actorId":"nm2742307","character":"Regina","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Richard","urlProfile":"http://www.imdb.com/name/nm0723857","urlPhoto":"","biography":{"bio":"Michael Richard is known for his work on Amelia (2009), Wah-Wah (2005) and Disgrace (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0723857","name":"Michael Richard","idIMDB":"nm0723857"},"actorId":"nm0723857","character":"Tobias","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0419256","urlIMDB":"http://www.imdb.com/title/tt0419256","business":{"budget":{"money":"$7,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$55,304","country":"USA","day":"14","month":"05","year":"2006","remarks":"26 Screens"},{"money":"£46,159","country":"UK","day":"04","month":"06","year":"2006","remarks":"45 Screens"}],"gross":[{"money":"$233,103","country":"USA","day":"25","month":"06","year":"2006","remarks":""},{"money":"$224,714","country":"USA","day":"18","month":"06","year":"2006","remarks":""},{"money":"$211,652","country":"USA","day":"11","month":"06","year":"2006","remarks":""},{"money":"$195,668","country":"USA","day":"04","month":"06","year":"2006","remarks":""},{"money":"$159,111","country":"USA","day":"28","month":"05","year":"2006","remarks":""},{"money":"$103,534","country":"USA","day":"21","month":"05","year":"2006","remarks":""},{"money":"$55,304","country":"USA","day":"14","month":"05","year":"2006","remarks":""},{"money":"£46,159","country":"UK","day":"04","month":"06","year":"2006","remarks":""}],"weekendGross":[{"money":"$3,181","country":"USA","day":"25","month":"06","year":"2006","remarks":"7 Screens"},{"money":"$9,449","country":"USA","day":"18","month":"06","year":"2006","remarks":"16 Screens"},{"money":"$6,716","country":"USA","day":"11","month":"06","year":"2006","remarks":"8 Screens"},{"money":"$23,641","country":"USA","day":"04","month":"06","year":"2006","remarks":"15 Screens"},{"money":"$45,169","country":"USA","day":"28","month":"05","year":"2006","remarks":""},{"money":"$26,799","country":"USA","day":"21","month":"05","year":"2006","remarks":"23 Screens"},{"money":"$55,304","country":"USA","day":"14","month":"05","year":"2006","remarks":"26 Screens"},{"money":"£46,159","country":"UK","day":"04","month":"06","year":"2006","remarks":"45 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"07","month":"06","year":"2004","remarks":null},{"money":null,"country":null,"day":"25","month":"07","year":"2004","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["2 hr (120 min) (USA)","2 hr (120 min) (Argentina)","1 hr 37 min (97 min) (Toronto International) (Canada)"],"soundMix":["Dolby Digital","DTS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["Laboratoires Éclair, Paris, France"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm"]},"rating":"6.9","metascore":"61","filmingLocations":[{"location":"Swaziland"}],"rated":"R","awards":[{"award":"AARP Movies for Grownups Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Movies for Grownups Award","categories":[{"category":"Best Actor","names":[{"name":"Gabriel Byrne","id":"nm0000321","role":null}]}]}]},{"award":"British Independent Film Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated British Independent Film Award","categories":[{"category":"Best Actress","names":[{"name":"Emily Watson","id":"nm0001833","role":null}]}]},{"titleAwardOutcome":"Nominated Douglas Hickox Award","categories":[{"category":"","names":[{"name":"Richard E. Grant","id":"nm0001290","role":null}]}]}]},{"award":"Irish Film and Television Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated IFTA Award","categories":[{"category":"Best Actor in a Feature Film","names":[{"name":"Gabriel Byrne","id":"nm0000321","role":null}]}]}]},{"award":"Prism Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Prism Award","categories":[{"category":"Feature Film - Limited Release","names":[]}]}]}],"votes":"2,691","type":"Movie","companyCreditsSimple":[{"idCompany":"co0133024","name":"Scion Films"},{"idCompany":"co0003770","name":"Loma Nasha"},{"idCompany":"co0139790","name":"Reeleyes Film"}],"keywords":{"keywords":["swaziland","cuckolded husband","alcoholic","unfaithful wife","stepmother","alcoholic father","child's point of view","divorced parents","cheating on husband","wife leaves husband","cheating wife","marriage breakdown","sex in car","british imperialism","cuckold","divorce","brain tumor","alcoholism","africa","death of father"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 05:57:43"}}