{"data":{"movies":[{"title":"Civic Duty","originalTitle":"","year":"2006","releaseDate":"20080911","directors":[{"name":"Jeff Renfroe","id":"nm1199954"}],"writers":[{"name":"Andrew Joiner","id":"nm1830055"}],"runtime":"98 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NDgwNjI0M15BMl5BanBnXkFtZTcwMzU1MDE1MQ@@._V1.jpg","countries":["UK","USA","Canada"],"languages":["English","Arabic"],"genres":["Drama","Thriller"],"plot":"Shortly after landing a job, Terry Allen is laid off, starts looking for another circa post September 11, 2001 media frenzy and paranoia with President George W. Bush stating that grief has turned to anger, anger to resolution, and that there are thousands of terrorists in over 60 countries ready to strike. With increasing reports of identity theft, the involvement of wealthy & educated foreigners in terrorist activities, Terry starts suspecting his new neighbor, a middle-easterner, who he stereotypes as 'raghead', 'camel jockey', and 'sand nigger'. His wife, Marla, does not share in his bigotry, but he believes that she has turned her attention from rock-stars to Jihadists. While looking for employment, as well as a loan to purchase a house, he also contacts the Federal Bureau of Investigation as he feels he has sufficient evidence that his new neighbor is structuring money, experimenting with chemicals, and associating with other middle-easterners for devious reasons.","simplePlot":"An American accountant bombarded with cable news and the media's obsession with terrorist plots in the post 9-11 world, receives a jolt when an unattached Islamic graduate student moves in next door.","actors":[{"actorName":"Peter Krause","urlProfile":"http://www.imdb.com/name/nm0470244","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk4NjA5NDY5MV5BMl5BanBnXkFtZTcwMjU4MjgxNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 August 1965","placeOfBirth":" Alexandria, Minnesota, USA","height":"6' 1\" (1.85 m)","bio":"Peter William Krause was born on August 12, 1965 in Alexandria, Minnesota. Both his parents were teachers, and he has a sister and brother. He was raised in Roseville, Minnesota. He graduated in 1987 from Gustavus Adolphus College in St. Peter, Minnesota, with a degree in English literature. In 1990, he received a Master of Fine Arts degree in Acting from New York University's Graduate Acting Program at the Tisch School of the Arts. Krause's first role was in a horror movie Blood Harvest (1987). On Carol & Company (1990), he appeared opposite Carol Burnett and Richard Kind. It was an anthology comedy series, with actors playing different characters each week. After it ended in 1991, he guest starred on Seinfeld: The Limo (1992) as Tim, a white supremacist, and on Beverly Hills, 90210 (1990) in a recurring role. In 1995, he appeared in starring and recurring roles on two short-lived shows, The Great Defender (1995) and If Not for You (1995). He also guest starred on Ellen (1994), University Hospital (1995), Caroline in the City (1995), Brotherly Love (1995), The Drew Carey Show (1995) and Party of Five (1994). He also got a major recurring role as Cybill's son-in-law, Kevin Blanders on Cybill (1995). Around the same time, he also appeared in a romantic comedy Lovelife (1997) opposite Saffron Burrows, Bruce Davison and Carla Gugino, and in 3rd Rock from the Sun: A Friend in Dick (1997). In 1998, he appeared in three movies, including The Truman Show (1998). He also got a starring role on ABC's comedy Sports Night (1998), created by Aaron Sorkin. He played sports anchor Casey McCall, opposite Josh Charles, Felicity Huffman and Joshua Malina, until the show's cancellation in 2000. After \"Sports Night\", he got a another starring role, on HBO's Six Feet Under (2001), created by Alan Ball. He received three Emmy nominations for his role as funeral director Nate Fisher, the son of Ruth (Frances Conroy) and the brother of David (Michael C. Hall) and Claire (Lauren Ambrose). During a break from \"Six Feet\" in 2004, he also appeared in We Don't Live Here Anymore (2004) opposite Laura Dern and Mark Ruffalo and played a part on Broadway. After \"Six Feet\" ended in 2005, he appeared in the miniseries The Lost Room (2006) opposite Julianna Margulies and Elle Fanning as the lead Joe Miller and played the lead and produced the thriller Civic Duty (2006). In 2007, he got yet another lead on Dirty Sexy Money (2007) as the lawyer of one of New York City's wealthiest families, opposite Donald Sutherland, William Baldwin and Natalie Zea. Krause was also a producer on the show, but unfortunately it ended in 2009, after two seasons. After \"Dirty Sexy Money\" ended, Krause did not stay idle long, when he received the lead on Parenthood (2010) as Adam Braverman, opposite Lauren Graham, Craig T. Nelson and Bonnie Bedelia. \"Parenthood\" ended in 2015 after six seasons. In 2016, he was cast in ABC's crime drama, The Catch (2016), produced by Shonda Rhimes. He is playing a con artist, who is being chased by a private investigator (Mireille Enos'), whom he defrauded.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk4NjA5NDY5MV5BMl5BanBnXkFtZTcwMjU4MjgxNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0470244","name":"Peter Krause","idIMDB":"nm0470244"},"actorId":"nm0470244","character":"Terry Allen","urlCharacter":"http://www.imdb.com/character/ch0385588","main":true},{"actorName":"Kari Matchett","urlProfile":"http://www.imdb.com/name/nm0558182","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMjAwOTE4OV5BMl5BanBnXkFtZTcwMDQwODMzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 March 1970","placeOfBirth":" Spalding, Saskatchewan, Canada","height":"5' 6\" (1.68 m)","bio":"Kari Matchett was born on March 25, 1970 in Spalding, Saskatchewan, Canada. She is an actress, known for Cube²: Hypercube (2002), Covert Affairs (2010) and Cypher (2002). She was previously married to T.W. Peacocke.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMjAwOTE4OV5BMl5BanBnXkFtZTcwMDQwODMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0558182","name":"Kari Matchett","idIMDB":"nm0558182"},"actorId":"nm0558182","character":"Marla Allen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Schiff","urlProfile":"http://www.imdb.com/name/nm0771493","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MDE5MzIwNF5BMl5BanBnXkFtZTYwNjgzMDI0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 May 1955","placeOfBirth":" Bethesda, Maryland, USA","height":"5' 10\" (1.78 m)","bio":"Richard was the middle of three sons born to Edward, a real estate lawyer, and Charlotte, a cable TV and publishing executive. His parents divorced when he was 12. He dropped out of high school but obtained an equivalency diploma. He tried studying at the City College of New York (CCNY) in 1973, but had no interest. After not bothering to show up for finals, he headed to Colorado where he cut firewood and lived a hippie life. He returned to New York in 1975 and started studying acting at CCNY and eventually was accepted into their theater program. He initially disliked acting and studied to be a director. He directed several off-Broadway plays, including \"Antigone\" with a then just-graduated Angela Bassett in 1983. He also met present wife, Sheila Kelley, during auditions for this play. The two married in 1996. In the mid-1980s, Richard says he conquered his fears and decided to take a stab at acting. He got several TV roles, but he was seen by Steven Spielberg in an episode of the TV drama High Incident (1996). Spielberg then cast him in The Lost World: Jurassic Park (1997) and his career has been on an upward climb ever since that has led to his co-starring role in The West Wing (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MDE5MzIwNF5BMl5BanBnXkFtZTYwNjgzMDI0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0771493","name":"Richard Schiff","idIMDB":"nm0771493"},"actorId":"nm0771493","character":"FBI Agent Tom Hilary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Khaled Abol Naga","urlProfile":"http://www.imdb.com/name/nm1178100","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ1MTg3OTQ1OV5BMl5BanBnXkFtZTgwNzA4OTY1OTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 November 1966","placeOfBirth":" Egypt","birthName":"Khaled Mohamed Sami Aboul Naga","height":"6' 4\" (1.93 m)","bio":"Khaled Abol Naga is a heart-throb pan-Arab Egyptian star and one of the new wave cinema generation making International groundbreaking and Award winning Egyptian & Arab Cinema. He is a multi-Award winning Actor/Producer of feature films from Egypt, as an actor he collected numerous Best Actor awards from Egypt, Arab & International Film Festivals since 2001, He starred Arabic speaking feature films in Egypt and the Arab world since his first award winning lead role in \"A Citizen, A Detective & A Thief\" 2001 by Egyptian acclaimed director Daoud Abdel Sayed. In a film festival in 2016 celebrating Arabic films submissions to the Oscars, he was honored for being the most submitted actor in Arabic films submissions to the Academy Award for Best Foreign Language Film (The Oscars). He is often tagged in western media as Egypt's \"Brad Pitt\" for his many career similarities with the latter, Also described as the next \"Omar Sharif\" specially after his American debut movie Civic Duty in 2007, he was also described as \"Egypt's International treasure\" for his unprecedented courage advocating for freedom & standing up against injustice in his home country Egypt, facing numerous nation wide defamation campaigns against him by the state owned and controlled media while continuing his regional and international award winning success. He also had a very celebrated and successful career across the Arab world TV networks as a TV & radio host in prime time shows from 1997 till 2005. Famous for his unexpected yet smart choices of scripts & roles, Mr Naga created a vast & diverse filmography with unprecedented wide acclaim from critics & audiences throughout the Arab & international film societies creating a unique phenomena in his generation of actors, almost all of his films has an \"exportable\" nature to other cultures. He created a special attention to his choices and subtle yet deep performances. Mr Naga has a record of having his films picked up by international film festivals, In 2009-2011 he was the common factor in the three award winning feature films out of Egypt. In 2013-2014 He set a record in winning almost ALL available 4 Best Actor awards of local film festivals in Egypt for his outstanding portrayal of an old man facing death in \" Villa 69 \" in addition to The Cairo International Film Festival Best Actor Award for \" Eyes of a thief \" (2015). Mr Naga as a producer since 2009, created with others a new wave of possibilities in the Egyptian independent film industry, from co-producing \"Heliopolis\" 2009 which went on to feature in over a dozen festivals in 2009, to the revolutionary production \"Microphone\" 2010 in which a new generation of photography DSLR Canon cameras were used; He is among a leading \"i Team Cairo\" that is becoming a seed of a new movement to help indie film making altogether coming out of the region. Mr Naga as a social and human rights activist has been one of the early outspoken icons from Egypt promoting social justice, freedom and democratic change to the Arab world in general and Egypt in specific, Mr Naga is playing a pivotal role in explaining to the world media and supporting the Egyptian Revolutions Jan 25'th 2011 and June 30'th 2012 till now. Mr Naga has a very admirable record of social & human rights (specially child rights) work and ongoing agenda, He is also appointed as a UNICEF Goodwill Ambassador since 2007 till today. --- more: Before his American debut in 2006's Civic Duty (2006) in which he gave an outstanding & compelling performance & very convincing portrayal of a very difficult character of Gabe Hassan, he made numerous films in his native Egypt. Here is how it all began ... Since his first major public appearance as a TV late night show host in 1999, It was only a matter of few roles and He became an Award winning star in Egypt and the Arab world, His background is as versatile as it can get, No wonder he's been nicknamed Superman! He studied Tele-communication Engineering and graduated with honors from Ain Shams University, one of the most prestigious Engineering schools in Egypt, meanwhile Water polo as his hobby grew fast to become almost a profession when he teamed up with Egypt's Water polo National team as its Goal Keeper, But it was his other passion of acting & singing at the Theatre Department of The American University in Cairo that grew with him gradually to become his chosen final career. Exchange of hobbies and professions happened several times to Khaled. First when Water polo became the main focus for him 1986-1989, then Spacecrafts! and Tele-Communications while researching it at The University of Surrey, UK in 1991, while playing Water polo for his varsity team in European tournaments where He started a parallel career of Fashion Catwalk Modeling back then. In 1999 another switch happened when he (as a famous young face & well established catwalk model in Egypt) was offered by chance! to Host a TV program at Nile Varity Channel as a part of a new TV pan-Arab Network inaugurated by state owned ERTU in Egypt. He became the talk of the town with his new fresh style and controversial ways. He hosted and interviewed all kinds of stars - Arab and international. Khaled left Nile Variety channel October 2000, joined MBC TV Network in June 2001.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ1MTg3OTQ1OV5BMl5BanBnXkFtZTgwNzA4OTY1OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1178100","name":"Khaled Abol Naga","nicknames":["Dodi"],"idIMDB":"nm1178100"},"actorId":"nm1178100","character":"Gabe Hassan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ian Tracey","urlProfile":"http://www.imdb.com/name/nm0870439","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MjU2OTQ2MF5BMl5BanBnXkFtZTcwNzc1NTgwOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 June 1964","placeOfBirth":" Vancouver Island, British Columbia, Canada","height":"5' 7\" (1.7 m)","bio":"Ian Tracey was born on June 26, 1964 in Vancouver Island, British Columbia, Canada. He is an actor and director, known for Da Vinci's Inquest (1998), Man of Steel (2013) and Insomnia (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MjU2OTQ2MF5BMl5BanBnXkFtZTcwNzc1NTgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0870439","name":"Ian Tracey","idIMDB":"nm0870439"},"actorId":"nm0870439","character":"Lieutenant Randall Lloyd","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vanesa Tomasino","urlProfile":"http://www.imdb.com/name/nm1500694","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI1MTc4MzU4OV5BMl5BanBnXkFtZTgwNzEzOTA3NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1981","placeOfBirth":" San Salvador, El Salvador","height":"5' 4\" (1.63 m)","bio":"Vanesa Maria Tomasino Rodríguez was born and raised in El Salvador, Central America. Her acting work includes: a supporting lead role in the Syfy TV Movie \"Chupacabra vs the Alamo\" alongside Erik Estrada and Julia Benson; A recurring role in the animated series'Martha Speaks'(Carolina); a lead role in 'A girl like me: The Gwen Araujo Story'(Directed by Agnieszka Holland); and the Hallmark TV movies 'Mr. Miracle' and 'The most wonderful time of the year.' Vanesa was also the host for the TV show world.beats and a radio personality for the Beat 94.5 FM in Vancouver,Canada. Vanesa has a Master's degree in Political Science and is currently a Political Science PhD candidate.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI1MTc4MzU4OV5BMl5BanBnXkFtZTgwNzEzOTA3NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1500694","name":"Vanesa Tomasino","nicknames":["Vane"],"idIMDB":"nm1500694"},"actorId":"nm1500694","character":"Bank Teller","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Laurie Murdoch","urlProfile":"http://www.imdb.com/name/nm0002799","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQyNjAxNjg4NV5BMl5BanBnXkFtZTcwOTk4NjU0OA@@._V1_UY44_CR29,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 April 1958","placeOfBirth":" New Westminster, British Columbia, Canada","bio":"Laurie Murdoch was born on April 15, 1958 in New Westminster, British Columbia, Canada. He is an actor, known for Spotlight (2015), The Core (2003) and Door to Door (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQyNjAxNjg4NV5BMl5BanBnXkFtZTcwOTk4NjU0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002799","name":"Laurie Murdoch","idIMDB":"nm0002799"},"actorId":"nm0002799","character":"Loan Officer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Roberds","urlProfile":"http://www.imdb.com/name/nm0004357","urlPhoto":"","biography":{"dateOfBirth":"18 January 1964","placeOfBirth":" Langley, British Columbia, Canada","height":"5' 7\" (1.7 m)","bio":"Michael Roberds was born on January 18, 1964 in Langley City, British Columbia, Canada. He began reading by the age of three. Roberds performed the role of Big Bird in the school play \"Christmas on Sesame Street\" at age five. He entertained his neighbors by reading them jokes at parties and quickly grew to enjoy the attention. Throughout his school career, he was active in theatre productions and began acting professionally in 1987 when he did his first television commercial for GM. He writes and performs sketches for David Chalk's Computer Show, in addition to roles on the mystery drama series Strange Luck and in \"Ernest Goes to School\" starring Jim Varney. He starred on Fox Family's \"The New Addams Family\" as Uncle Fester. His television guest appearances include Da Vinci's City Hall and Police Academy. Roberds is also a member of the comedy troupe \"Almost Midnight\".","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0004357","name":"Michael Roberds","idIMDB":"nm0004357"},"actorId":"nm0004357","character":"Post Office Clerk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Agam Darshi","urlProfile":"http://www.imdb.com/name/nm1570191","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTgzNjQ3M2EtNGVmMi00ZmEzLTlmMmEtYTExNGYwMmExYzJmL2ltYWdlXkEyXkFqcGdeQXVyODEyMzIxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Agamdeep Darshi","height":"5' 5½\" (1.66 m)","bio":"Agam Darshi was born Agamdeep Darshi in Birmingham, UK. At a very young age, she and her family moved to Canada. At the age of 14, she left home and moved to Calgary, to pursue a career of acting - which is her passion. Agam studied Theater and Fine Arts at the University of Calgary and earned a degree and photography. Agam is also a writer, artist, screenwriter, graphic-designer and producer and has written numerous plays and has worked on several film scripts, two of them are her independent films. As well as acting, in her spare time Agam loves to backpack and has already backpacked through Europe and Australia. Agam is best-known for her roles in Tru Calling (2003), The Dead Zone (2002), The L Word (2004), Sweet Destiny (2004) and, most recently, as \"Laura\" in the horror movie, Destination finale 3 (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTgzNjQ3M2EtNGVmMi00ZmEzLTlmMmEtYTExNGYwMmExYzJmL2ltYWdlXkEyXkFqcGdeQXVyODEyMzIxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1570191","name":"Agam Darshi","idIMDB":"nm1570191"},"actorId":"nm1570191","character":"Nurse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Brandon","urlProfile":"http://www.imdb.com/name/nm0007103","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MTE1Mzg4NF5BMl5BanBnXkFtZTcwMTA0MTIyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Mark Brandon is an actor and producer, known for Supernatural (2005), A Series of Unfortunate Events (2017) and Zoo (2015). He has been married to Joanne Brandon since 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MTE1Mzg4NF5BMl5BanBnXkFtZTcwMTA0MTIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0007103","name":"Mark Brandon","idIMDB":"nm0007103"},"actorId":"nm0007103","character":"Night Anchor Bret Anderson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brenda Crichlow","urlProfile":"http://www.imdb.com/name/nm0187764","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MTIwNTcwNl5BMl5BanBnXkFtZTcwMTY1NTgwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1967","placeOfBirth":" Vancouver, British Columbia, Canada","bio":"Brenda Crichlow was born on October 29, 1967 in Vancouver, British Columbia, Canada. She is known for her work on Fantastic Four (2005), Look Who's Talking (1989) and The Possession (2012). She is married to Rene Lessard. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MTIwNTcwNl5BMl5BanBnXkFtZTcwMTY1NTgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0187764","name":"Brenda Crichlow","idIMDB":"nm0187764"},"actorId":"nm0187764","character":"Day Anchor Tricia Wise","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Val Cole","urlProfile":"http://www.imdb.com/name/nm2091261","urlPhoto":"","biography":{"bio":"Val Cole is an actress, known for 2012 (2009), Aliens vs. Predator: Requiem (2007) and Civic Duty (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2091261","name":"Val Cole","idIMDB":"nm2091261"},"actorId":"nm2091261","character":"Morning Anchor Susan Harwood","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Docherty","urlProfile":"http://www.imdb.com/name/nm1638031","urlPhoto":"","biography":{"bio":"Mark Docherty is an actor, known for Watchmen (2009), 2012 (2009) and Littleman (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1638031","name":"Mark Docherty","idIMDB":"nm1638031"},"actorId":"nm1638031","character":"News Reporter Chad Winslow","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael St. John Smith","urlProfile":"http://www.imdb.com/name/nm0820605","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MzM4NjE5MF5BMl5BanBnXkFtZTcwODcyNzIzOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Michael St. John Smith is an actor and writer, known for I, Robot (2004), Shooter (2007) and The A-Team (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MzM4NjE5MF5BMl5BanBnXkFtZTcwODcyNzIzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0820605","name":"Michael St. John Smith","idIMDB":"nm0820605"},"actorId":"nm0820605","character":"Legal Analyst","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"P. Lynn Johnson","urlProfile":"http://www.imdb.com/name/nm0425927","urlPhoto":"","biography":{"bio":"P. Lynn Johnson is an actress, known for 50/50 (2011), Destination finale (2000) and Godzilla (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0425927","name":"P. Lynn Johnson","idIMDB":"nm0425927"},"actorId":"nm0425927","character":"Govenor Bradley","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0446298","urlIMDB":"http://www.imdb.com/title/tt0446298","business":{"budget":{"money":"$3,400,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$54,902","country":"USA","day":"06","month":"05","year":"2007","remarks":"56 Screens"}],"gross":[{"money":"$54,902","country":"USA","day":"06","month":"05","year":"2007","remarks":""}],"weekendGross":[{"money":"$54,902","country":"USA","day":"06","month":"05","year":"2007","remarks":"56 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"© 2006 Landslide Pictures, Inc."},"technical":{"runtime":["1 hr 38 min (98 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.3","metascore":"48","filmingLocations":[{"location":"Vancouver, British Columbia, Canada"}],"rated":"R","awards":[{"award":"Cairo International Film Festival 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Pyramid","categories":[{"category":"Best Film","names":[{"name":"Jeff Renfroe","id":"nm1199954","role":null}]}]}]},{"award":"Canadian Society of Cinematographers Awards 2008","titlesAwards":[{"titleAwardOutcome":"Won CSC Award","categories":[{"category":"Best Cinematography in Theatrical Feature","names":[{"name":"Dylan Macleod","id":"nm0533885","role":null}]}]}]},{"award":"Leo Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Leo","categories":[{"category":"Best Sound Editing in a Feature Length Drama","names":[{"name":"Gashtaseb Ariana","id":"nm0034658","role":null}]}]}]}],"votes":"3,167","type":"Movie","companyCreditsSimple":[{"idCompany":"co0361029","name":"Civic Duty Productions"},{"idCompany":"co0127149","name":"Intandem Films"},{"idCompany":"co0174261","name":"Landslide Pictures"}],"keywords":{"keywords":["neighbor","paranoia","accountant","kitchen","watching tv","tv news","tied to a chair","terrorism","terrorism prevention","suspicion","racial slur","photographer","nurse","mental institution","medication","loss of job","jealousy","husband wife relationship","hiding in a closet","gun","golf club","gas station","garbage dumpster","foot pursuit","fear","fbi agent","cynicism","car radio","blindfold","bank teller","air guitar","accidental shooting","accidental killing"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:53:17"}}