{"data":{"movies":[{"title":"A Scanner Darkly","originalTitle":"","year":"2006","releaseDate":"20060728","directors":[{"name":"Richard Linklater","id":"nm0000500"}],"writers":[{"name":"Philip K. Dick","id":"nm0001140"},{"name":"Richard Linklater","id":"nm0000500"}],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc2ZGI2MzEtODlkNC00MGQ4LTlkYjQtMDU0YTg1YTI0NDI1L2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation","Crime","Drama","Mystery","Sci-Fi","Thriller"],"plot":"In a totalitarian society in a near future, the undercover detective Bob Archor is working with a small time group of drug users trying to reach the big distributors of a brain-damaging drug called Substance D. His assignment is promoted by the recovery center New Path Corporation, and when Bob begins to lose his own identity and have schizophrenic behavior, he is submitted to tests to check his mental conditions.","simplePlot":"An undercover cop in a not-too-distant future becomes involved with a dangerous new drug and begins to lose his own identity as a result.","actors":[{"actorName":"Rory Cochrane","urlProfile":"http://www.imdb.com/name/nm0168262","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjczMzgwNzcwM15BMl5BanBnXkFtZTcwNDQ3MTg1OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 February 1972","placeOfBirth":" Syracuse, New York, USA","birthName":"Rory K. Cochrane","height":"6' (1.83 m)","bio":"Rory Cochrane was born in New York on February 28, 1972, but spent his childhood in England. He then returned to the United States and was educated in New York City and trained in the drama department of NYC's LaGuardia High School of Performing Arts. His first roles included a part in a docudrama about drugs on Saturday Night with Connie Chung (1989) in 1989 and an appearance in an episode of H.E.L.P. (1990) in 1990. He then made his film debut (with about fifteen seconds screen time) in A Kiss Before Dying (1991), followed by his first substantial role as Jeff Goldblum's son in Fathers & Sons (1992).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjczMzgwNzcwM15BMl5BanBnXkFtZTcwNDQ3MTg1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0168262","name":"Rory Cochrane","idIMDB":"nm0168262"},"actorId":"nm0168262","character":"Charles Freck","urlCharacter":"http://www.imdb.com/character/ch0012047","main":true},{"actorName":"Robert Downey Jr.","urlProfile":"http://www.imdb.com/name/nm0000375","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1965","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Robert John Downey Jr","height":"5' 8½\" (1.74 m)","bio":"Robert Downey Jr. has evolved into one of the most respected actors in Hollywood. With an amazing list of credits to his name, he has managed to stay new and fresh even after over four decades in the business. Downey was born April 4, 1965 in Manhattan, New York, the son of writer, director and filmographer Robert Downey Sr. and actress Elsie Downey (née Elsie Ann Ford). Robert's father is of half Lithuanian Jewish, one quarter Hungarian Jewish, and one quarter Irish, descent, while Robert's mother was of English, Scottish, German, and Swiss-German ancestry. Robert and his sister, Allyson Downey, were immersed in film and the performing arts from a very young age, leading Downey Jr. to study at the Stagedoor Manor Performing Arts Training Center in upstate New York, before moving to California with his father following his parents' 1978 divorce. In 1982, he dropped out of Santa Monica High School to pursue acting full time. Downey Sr., himself a drug addict, exposed his son to drugs at a very early age, and Downey Jr. would go on to struggle with abuse for decades. Downey Jr. made his debut as an actor at the age of five in the film Pound (1970), written and directed by his father, Robert Downey Sr.. He built his film repertoire throughout the 1980s and 1990s with roles in Tuff Turf (1985), Weird Science (1985), True Believer (1989), and Wonder Boys (2000) among many others. In 1992, Downey received an Academy Award nomination and won the BAFTA (British Academy Award) for Best Actor for his performance in the title role of Chaplin (1992). In Robert Altman's Short Cuts (1993), he appeared as an aspiring film make-up artist whose best friend commits murder. In Oliver Stone's Natural Born Killers (1994), with Woody Harrelson and Juliette Lewis, Downey starred as a tabloid TV journalist who exploits a murderous couple's killing spree to boost his ratings. For the comedy Heart and Souls (1993), Downey starred as a young man with a special relationship with four ghosts. In 1995, Downey starred in Restoration (1995), with Hugh Grant, Meg Ryan and Ian McKellen, directed by Michael Hoffman. Also that year, he starred in Richard III (1995), in which he appears opposite his Restoration (1995) co-star McKellen. In 1997, Downey was seen in Robert Altman's The Gingerbread Man (1998), alongside Kenneth Branagh, Daryl Hannah and Embeth Davidtz; in One Night Stand (1997), directed by Mike Figgis and starring Wesley Snipes and Nastassja Kinski; and in Hugo Pool (1997), directed by his father, Robert Downey Sr. and starring Sean Penn and Patrick Dempsey. In September of 1999, Downey appeared in Black & White (1999), written and directed by James Toback, along with Ben Stiller, Elijah Wood, Gaby Hoffmann, Brooke Shields and Claudia Schiffer. In January of 1999, he starred with Annette Bening and Aidan Quinn in In Dreams (1999), directed by Neil Jordan. In 2000, Downey co-starred with Michael Douglas and Tobey Maguire in Wonder Boys (2000), directed by Curtis Hanson. In this dramatic comedy, Downey played the role of a bisexual literary agent. In 2001, Downey made his prime-time television debut when he joined the cast of the Fox-TV series Ally McBeal (1997) as attorney \"Larry Paul\". For this role, he won the Golden Globe Award for Best Performance by an Actor in a Supporting Role in a Series, Mini-Series or Motion Picture Made for Television, as well as the Screen Actors Guild Award for Outstanding Performance by a Male in a Comedy Series. In addition, Downey was nominated for an Emmy for Outstanding Supporting Actor in a Comedy Series. The actor's drug-related problems escalated from 1996 to 2001, leading to arrests, rehab visits and incarcerations, and he was eventually fired from Ally McBeal (1997). Emerging clean and sober in 2003, Downey Jr. began to rebuild his career. He marked his debut into music with his debut album, titled \"The Futurist\", on the Sony Classics Label on November 23rd, 2004. The album's eight original songs, that Downey wrote, and his two musical numbers debuting as cover songs revealed his sultry singing voice and his musical talents. Downey displayed his versatility in two different films in October 2003: the musical/drama The Singing Detective (2003), a remake of the BBC hit of the same name, and the thriller Gothika (2003) starring Halle Berry and Penélope Cruz. Downey starred in powerful yet humbling roles inspired by real-life accounts of some of history's most precious kept secrets, including Richard Linklater's A Scanner Darkly (2006) in 2006 co-starring Keanu Reeves, Winona Ryder and Woody Harrelson, and Fur: An Imaginary Portrait of Diane Arbus (2006) co-starring Nicole Kidman, a film inspired by the life of Diane Arbus, the revered photographer whose images captured attention in the early 1960s. These roles exhibited Downey's momentum from the previous year of 2005, in which he starred in the Academy Award®-nominated feature film Good Night, and Good Luck. (2005), directed by George Clooney and in Shane Black's action comedy Kiss Kiss Bang Bang (2005) co-starring Val Kilmer. In 2007, he co-starred in David Fincher's suspenseful _Zodiac (2007/I)_ alongside Jake Gyllenhaal and Mark Ruffalo, about the notorious serial killer who haunted San Francisco during the 1970s. In May 2008, Downey achieved critical acclaim and worldwide box office success for his starring role in Iron Man (2008), Jon Favreau's big-screen rendering of the Marvel comic book superhero. The film co-starred Gwyneth Paltrow, Jeff Bridges and Terrence Howard. In August of 2008, Downey starred with Ben Stiller and Jack Black in the comedy Tropic Thunder (2008), and went on to receive an Academy Award®-nomination for Best Supporting Actor for his, Kirk Lazarus. In December 2009, Downey starred in the action-adventure Sherlock Holmes (2009). The film, directed by Guy Ritchie, co-starred Jude Law and Rachel McAdams and earned Downey a Golden Globe for Best Performance by an Actor in a Motion Picture - Comedy or Musical in January of 2010. In early Summer 2010, Downey re-teamed with director Jon Favreau and reprised his role as \"Tony Stark/Iron Man\" in the hugely successful sequel to the original film, Iron Man 2 (2010), starring Gwyneth Paltrow, Scarlett Johansson, Samuel L. Jackson and Mickey Rourke. Downey next starred in Due Date (2010), a comedy directed by Todd Phillips, in which he plays the role of an expectant father on a road trip racing to get back in time for the birth of his first child. Due Date (2010), starring The Hangover (2009)'s Zach Galifianakis, was released in November 2010. Downey was honored by Time Magazine's \"Time 100\" in 2008, an annual list of the 100 most influential people in the world. His laurels include two Academy Award nominations, three Golden Globe wins, numerous other award nominations and wins, and tremendous popular and commercial success, particularly in his roles as Sherlock Holmes and Tony Stark (the latter of which he has so far played in Iron Man (2008), Iron Man 2 (2010), The Avengers (2012), Iron Man 3 (2013), and Avengers: Age of Ultron (2015). For three consecutive years, from 2012 to 2015, Downey has topped the Forbes list of Hollywood's highest-paid actors, making an estimated $80 million in earnings between June 2014 and June 2015. In 2005, Downey Jr. married Susan Downey, who gave birth to their son, Exton Elias Downey, on February 7, 2012. Downey also has another son, Indio Falconer Downey, born September 7, 1993, from his first marriage to Deborah Falconer, from whom he was officially divorced in 2004. Robert has jump-started the Team Downey Production Company with wife Susan Downey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000375","name":"Robert Downey Jr.","nicknames":["Bob","RDJ"],"idIMDB":"nm0000375"},"actorId":"nm0000375","character":"James Barris","urlCharacter":"http://www.imdb.com/character/ch0012044","main":true},{"actorName":"Mitch Baker","urlProfile":"http://www.imdb.com/name/nm1488987","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NDY0Nzg1M15BMl5BanBnXkFtZTYwMzEwMjAz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Mitch Baker is an actor and writer, known for A Scanner Darkly (2006), Fast Food Nation (2006) and Idiocracy (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NDY0Nzg1M15BMl5BanBnXkFtZTYwMzEwMjAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1488987","name":"Mitch Baker","idIMDB":"nm1488987"},"actorId":"nm1488987","character":"Brown Bear Lodge Host","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Keanu Reeves","urlProfile":"http://www.imdb.com/name/nm0000206","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUxNDcwMTg4Ml5BMl5BanBnXkFtZTcwMjU4NDYyOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 September 1964","placeOfBirth":" Beirut, Lebanon","birthName":"Keanu Charles Reeves","height":"6' 1\" (1.86 m)","bio":"Keanu Charles Reeves, whose first name means \"cool breeze over the mountains\" in Hawaiian, was born September 2, 1964 in Beirut, Lebanon. He is the son of Patricia Taylor, a showgirl and costume designer, and Samuel Nowlin Reeves, a geologist. Keanu's father was born in Hawaii, of British, Portuguese, Native Hawaiian, and Chinese ancestry, and Keanu's mother is originally from England. After his parents' marriage dissolved, Keanu moved with his mother and younger sister, Kim Reeves, to New York City, then Toronto. Stepfather #1 was Paul Aaron, a stage and film director - he and Patricia divorced within a year, after which she went on to marry (and divorce) rock promoter Robert Miller and hair salon owner Jack Bond. Reeves never reconnected with his biological father. In high school, Reeves was lukewarm toward academics but took a keen interest in ice hockey (as team goalie, he earned the nickname \"The Wall\") and drama. He eventually dropped out of school to pursue an acting career. After a few stage gigs and a handful of made-for-TV movies, he scored a supporting role in the Rob Lowe hockey flick Youngblood (1986), which was filmed in Canada. Shortly after the production wrapped, Reeves packed his bags and headed for Hollywood. Reeves popped up on critics' radar with his performance in the dark adolescent drama, River's Edge (1986), and landed a supporting role in the Oscar-nominated Dangerous Liaisons (1988) with director Stephen Frears. His first popular success was the role of totally rad dude \"Ted Logan\" in Bill & Ted's Excellent Adventure (1989). The wacky time-travel movie became something of a cultural phenomenon, and audiences would forever confuse Reeves's real-life persona with that of his doofy on-screen counterpart. He then joined the casts of Ron Howard's comedy, Parenthood (1989) and Lawrence Kasdan's I Love You to Death (1990). Over the next few years, Reeves tried to shake the Ted stigma with a series of highbrow projects. He played a slumming rich boy opposite River Phoenix's narcoleptic male hustler in My Own Private Idaho (1991), an unlucky lawyer who stumbles into the vampire's lair in Bram Stoker's Dracula (1992), and Shakespearean party-pooper Don John in Much Ado About Nothing (1993). In 1994, the understated actor became a big-budget action star with the release of Speed (1994). Its success heralded an era of five years in which Reeves would alternate between small films, like Feeling Minnesota (1996) and The Last Time I Committed Suicide (1997), and big films like A Walk in the Clouds (1995) and The Devil's Advocate (1997). (There were a couple misfires, too: Johnny Mnemonic (1995) and Chain Reaction (1996).) After all this, Reeves did the unthinkable and passed on the Speed sequel, but he struck box-office gold again a few years later with the Wachowski siblings' cyberadventure, The Matrix (1999). Now a bonafide box-office star, Keanu would appear in a string of smaller films -- among them The Replacements (2000), The Watcher (2000), The Gift (2000), Sweet November (2001), and Hardball (2001) - before The Matrix Reloaded (2003) and Matrix Revolutions (2003) were both released in 2003. Since the end of The Matrix trilogy, Keanu has divided his time between mainstream and indie fare, landing hits with Something's Gotta Give (2003), The Lake House (2006), and Street Kings (2008). He's kept Matrix fans satiated with films such as Constantine (2005), A Scanner Darkly (2006), and The Day the Earth Stood Still (2008). And he's waded back into art-house territory with Ellie Parker (2005), Thumbsucker (2005), The Private Lives of Pippa Lee (2009), and Henry's Crime (2010). Most recently, as post-production on the samurai epic 47 Ronin (2013) waged on, Keanu appeared in front of the camera in Side by Side (2012), a documentary on celluloid and digital filmmaking, which he also produced. He also directed another Asian-influenced project, Man of Tai Chi (2013). In 2014, Keanu played the title role in the action revenge film John Wick (2014), which became popular with critics and audiences alike. He reprised the role in John Wick: Chapter 2 (2017), taking the now-iconic character to a better opening weekend and even more enthusiastic reviews than the first go-around.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUxNDcwMTg4Ml5BMl5BanBnXkFtZTcwMjU4NDYyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000206","name":"Keanu Reeves","nicknames":["The Wall","The One"],"idIMDB":"nm0000206"},"actorId":"nm0000206","character":"Bob Arctor","urlCharacter":"http://www.imdb.com/character/ch0012043","main":true},{"actorName":"Sean Allen","urlProfile":"http://www.imdb.com/name/nm0021043","urlPhoto":"","biography":{"bio":"Sean Allen is an actor, known for A Scanner Darkly (2006), Twice Upon a Christmas (2001) and Breaking the Surface: The Greg Louganis Story (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0021043","name":"Sean Allen","idIMDB":"nm0021043"},"actorId":"nm0021043","character":"Additional Fred Scramble Suit Voice","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cliff Haby","urlProfile":"http://www.imdb.com/name/nm0352316","urlPhoto":"","biography":{"bio":"Cliff Haby is an actor, known for A Scanner Darkly (2006) and The Underneath (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0352316","name":"Cliff Haby","idIMDB":"nm0352316"},"actorId":"nm0352316","character":"Voice from Headquarters","urlCharacter":"http://www.imdb.com/character/ch0456018","main":true},{"actorName":"Steven Chester Prince","urlProfile":"http://www.imdb.com/name/nm0697637","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzNjY2MjgwM15BMl5BanBnXkFtZTgwMDkyODk2NDE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"height":"6' 3\" (1.91 m)","bio":"Steven Chester Prince has a Bachelor of Arts degree from Southwest Texas State University. He began his career as an actor over twenty years ago. His television credits include recurring roles on Prison Break and Friday Night Lights and films roles that include The Alamo, The Ringer and A Scanner Darkly. Steve brings over 20 years of experience to TPSC Films as an actor, writer and producer. With acting credits in both television and feature films, Steve wrote the award winning script Divine Access, and co-wrote and produced Pineapple, which was distributed domestically by Maverick Entertainment Group. He also co-wrote and produced The Abduction of Jesse Bookman, which won the best picture award at The American Black Film Festival in 2009, and Burning Palms in 2010, which was praised for its performances by the cast including Zoe Saldana, Dylan McDermott, Nick Stahl, and Paz Vega. Steve moved on to team up with Brian Oliver and the Thompson family to create Cross Creek Pictures. During Steve's time as Vice President of Development, Cross Creek financed and produced Black Swan and The Woman in Black and began negotiations to finance and produce The Ides of March. Following his very successful tenure with Cross Creek Pictures, Steve joined The Traveling Picture Show Company as President of its independent film division, TPSC Films, in 2012, and has produced the horror film The Quiet Ones released by Lionsgate and A Walk Among The Tombstones starring Liam Neeson. Steve plays a pivotal role in guiding the strategic direction of TPSC Films, in locating and developing new projects, and actively producing all films under the TPSC Films banner.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzNjY2MjgwM15BMl5BanBnXkFtZTgwMDkyODk2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0697637","name":"Steven Chester Prince","nicknames":["Prince"],"idIMDB":"nm0697637"},"actorId":"nm0697637","character":"Cop","urlCharacter":"http://www.imdb.com/character/ch0456017","main":true},{"actorName":"Winona Ryder","urlProfile":"http://www.imdb.com/name/nm0000213","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NzM3MTc2NF5BMl5BanBnXkFtZTcwODMxNjA0NA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1971","placeOfBirth":" Winona, Minnesota, USA","birthName":"Winona Laura Horowitz","height":"5' 3½\" (1.61 m)","bio":"Winona Ryder was born Winona Laura Horowitz in Olmsted County, Minnesota, and was named after a nearby town, Winona, Minnesota. She is the daughter of Cynthia (Istas), an author and video producer, and Michael Horowitz, a publisher and bookseller. Her father's family is Russian Jewish and Romanian Jewish. She grew up in a ranch commune in Northern California which had no electricity. She is the goddaughter of Timothy Leary. Her parents were friends of Beat poet Allen Ginsberg and once edited a book called \"Shaman Woman Mainline Lady\", an anthology of writings on the drug experience in literature, which included one piece by Louisa May Alcott. Ryder would later play the lead role of Josephine March in the adaptation of this author's novel Little Women (1994). Ryder moved with her parents to Petaluma, California when she was ten and enrolled in acting classes at the American Conservatory Theater. At age 13, she had a video audition to the film Desert Bloom (1986), but did not get the role. However, director David Seltzer spotted her and cast her in Lucas (1986). When telephoned to ask how she would like to have her name appear on the credits, she suggested Ryder as her father's Mitch Ryder album was playing the background. Ryder was selected for the role of Mary Corleone in The Godfather: Part III (1990), but had to drop out of the role after catching the flu from the strain of doing the films Welcome Home, Roxy Carmichael (1990) and Mermaids (1990) back to back. She said she did not want to let everyone down by doing a substandard performance. She later made The Age of Innocence (1993), which was directed by Martin Scorsese, whom she believes to be \"the best director in the world\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NzM3MTc2NF5BMl5BanBnXkFtZTcwODMxNjA0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000213","name":"Winona Ryder","nicknames":["Noni"],"idIMDB":"nm0000213"},"actorId":"nm0000213","character":"Donna Hawthorne","urlCharacter":"http://www.imdb.com/character/ch0012045","main":true},{"actorName":"Natasha Valdez","urlProfile":"http://www.imdb.com/name/nm2301348","urlPhoto":"","biography":{"bio":"Natasha Valdez is an actress, known for A Scanner Darkly (2006) and 5 Souls (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2301348","name":"Natasha Valdez","idIMDB":"nm2301348"},"actorId":"nm2301348","character":"Waitress","urlCharacter":"http://www.imdb.com/character/ch0456015","main":true},{"actorName":"Mark Turner","urlProfile":"http://www.imdb.com/name/nm1104267","urlPhoto":"","biography":{"bio":"Mark Turner is an actor, known for A Scanner Darkly (2006), Idiocracy (2006) and Harold & Kumar Escape from Guantanamo Bay (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1104267","name":"Mark Turner","idIMDB":"nm1104267"},"actorId":"nm1104267","character":"Additional Hank Scramble Suit Voice","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Woody Harrelson","urlProfile":"http://www.imdb.com/name/nm0000437","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDc2ODc4MF5BMl5BanBnXkFtZTcwODk2MzAyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 July 1961","placeOfBirth":" Midland, Texas, USA","birthName":"Woodrow Tracy Harrelson","height":"5' 9½\" (1.77 m)","bio":"Academy Award-nominated and Emmy Award-winning actor Woodrow Tracy Harrelson was born on July 23, 1961 in Midland, Texas, to Diane Lou (Oswald) and Charles Harrelson. He grew up in Lebanon, Ohio, and, after receiving degrees in theater arts and English from Hanover College, had a brief stint in New York theater. He was soon cast as Woody on TV series Cheers (1982), which wound up being one of the most-popular TV shows ever and also earned Harrelson an Emmy for his performance in 1989. While he dabbled in film during his time on Cheers (1982), that area of his career didn't fully take off until towards the end of the show's run. In 1991, Doc Hollywood (1991) gave him his first widely-seen movie role, and he followed that up with White Men Can't Jump (1992), Indecent Proposal (1993) and Natural Born Killers (1994). More recently, Harrelson was seen in No Country for Old Men (2007), Zombieland (2009), 2012 (2009), and Friends with Benefits (2011), along with the acclaimed HBO movie Game Change (2012). In 2011, Harrelson snagged the coveted role of fan-favorite drunk Haymitch Abernathy in the big-screen adaptation of The Hunger Games (2012), which ended up being one of the highest-grossing movies ever at the domestic box office. Harrelson is set to reprise that role for the sequels, which are scheduled for release in November 2013, 2014 and 2015. Harrelson has received two Academy Award nominations, first for his role as controversial Hustler founder Larry Flynt in The People vs. Larry Flynt (1996) and then for a role in The Messenger (2009). He also received Golden Globe nominations for both of these parts. In 2016, he had a stand-out role as a wise teacher in the teen drama The Edge of Seventeen (2016). Harrelson was briefly married to Nancy Simon in the 80s, and later married his former assistant, Laura Louie, with whom he has three daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDc2ODc4MF5BMl5BanBnXkFtZTcwODk2MzAyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000437","name":"Woody Harrelson","idIMDB":"nm0000437"},"actorId":"nm0000437","character":"Ernie Luckman","urlCharacter":"http://www.imdb.com/character/ch0012046","main":true},{"actorName":"Chamblee Ferguson","urlProfile":"http://www.imdb.com/name/nm0272393","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1ODk1MDY5Nl5BMl5BanBnXkFtZTcwMTg4ODQ3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Chamblee Ferguson is an actor, known for A Scanner Darkly (2006), The Chase (1994) and Karma Police (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1ODk1MDY5Nl5BMl5BanBnXkFtZTcwMTg4ODQ3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0272393","name":"Chamblee Ferguson","idIMDB":"nm0272393"},"actorId":"nm0272393","character":"Medical Deputy #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Angela Rawna","urlProfile":"http://www.imdb.com/name/nm1543425","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4Mjk0ODQwMF5BMl5BanBnXkFtZTcwMTk3MDIzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Angela Rawna is an actress and producer, known for Boyhood (2014), A Scanner Darkly (2006) and Will to Kill (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4Mjk0ODQwMF5BMl5BanBnXkFtZTcwMTk3MDIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1543425","name":"Angela Rawna","idIMDB":"nm1543425"},"actorId":"nm1543425","character":"Medical Deputy #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eliza Stevens","urlProfile":"http://www.imdb.com/name/nm1659626","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NTc1MDI4NF5BMl5BanBnXkFtZTcwMjEwNzYyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Eliza Stevens is an actress, known for A Scanner Darkly (2006) and Fall to Grace (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NTc1MDI4NF5BMl5BanBnXkFtZTcwMjEwNzYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1659626","name":"Eliza Stevens","idIMDB":"nm1659626"},"actorId":"nm1659626","character":"Arctor's Daughter #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sarah Menchaca","urlProfile":"http://www.imdb.com/name/nm2313622","urlPhoto":"","biography":{"bio":"Sarah Menchaca is an actress, known for A Scanner Darkly (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2313622","name":"Sarah Menchaca","idIMDB":"nm2313622"},"actorId":"nm2313622","character":"Arctor's Daughter #2","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0405296","urlIMDB":"http://www.imdb.com/title/tt0405296","business":{"budget":{"money":"$8,700,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$391,672","country":"USA","day":"09","month":"07","year":"2006","remarks":""},{"money":"£242,990","country":"UK","day":"20","month":"08","year":"2006","remarks":"104 Screens"}],"gross":[{"money":"$5,501,616","country":"USA","day":"12","month":"10","year":"2006","remarks":""},{"money":"$5,480,996","country":"USA","day":"08","month":"10","year":"2006","remarks":""},{"money":"$5,476,327","country":"USA","day":"01","month":"10","year":"2006","remarks":""},{"money":"$5,469,745","country":"USA","day":"24","month":"09","year":"2006","remarks":""},{"money":"$5,451,647","country":"USA","day":"17","month":"09","year":"2006","remarks":""},{"money":"$5,414,097","country":"USA","day":"10","month":"09","year":"2006","remarks":""},{"money":"$5,365,339","country":"USA","day":"03","month":"09","year":"2006","remarks":""},{"money":"$5,281,537","country":"USA","day":"27","month":"08","year":"2006","remarks":""},{"money":"$5,159,136","country":"USA","day":"20","month":"08","year":"2006","remarks":""},{"money":"$4,968,071","country":"USA","day":"13","month":"08","year":"2006","remarks":""},{"money":"$4,669,454","country":"USA","day":"06","month":"08","year":"2006","remarks":""},{"money":"$4,091,960","country":"USA","day":"30","month":"07","year":"2006","remarks":""},{"money":"$3,238,799","country":"USA","day":"23","month":"07","year":"2006","remarks":""},{"money":"$1,868,905","country":"USA","day":"16","month":"07","year":"2006","remarks":""},{"money":"$391,672","country":"USA","day":"09","month":"07","year":"2006","remarks":""},{"money":"£561,707","country":"UK","day":"27","month":"08","year":"2006","remarks":""},{"money":"£242,990","country":"UK","day":"20","month":"08","year":"2006","remarks":""},{"money":"$7,659,918","country":"Worldwide","day":"17","month":"05","year":"2007","remarks":""},{"money":"$2,158,302","country":"Non-USA","day":"17","month":"05","year":"2007","remarks":""}],"weekendGross":[{"money":"$860","country":"USA","day":"08","month":"10","year":"2006","remarks":"10 Screens"},{"money":"$1,567","country":"USA","day":"01","month":"10","year":"2006","remarks":"12 Screens"},{"money":"$7,174","country":"USA","day":"24","month":"09","year":"2006","remarks":"25 Screens"},{"money":"$17,883","country":"USA","day":"17","month":"09","year":"2006","remarks":"42 Screens"},{"money":"$33,340","country":"USA","day":"10","month":"09","year":"2006","remarks":"62 Screens"},{"money":"$46,845","country":"USA","day":"03","month":"09","year":"2006","remarks":"52 Screens"},{"money":"$59,082","country":"USA","day":"27","month":"08","year":"2006","remarks":"79 Screens"},{"money":"$96,158","country":"USA","day":"20","month":"08","year":"2006","remarks":"125 Screens"},{"money":"$132,977","country":"USA","day":"13","month":"08","year":"2006","remarks":""},{"money":"$256,155","country":"USA","day":"06","month":"08","year":"2006","remarks":"224 Screens"},{"money":"$473,642","country":"USA","day":"30","month":"07","year":"2006","remarks":"263 Screens"},{"money":"$678,030","country":"USA","day":"23","month":"07","year":"2006","remarks":"219 Screens"},{"money":"$1,266,427","country":"USA","day":"16","month":"07","year":"2006","remarks":"216 Screens"},{"money":"$391,672","country":"USA","day":"09","month":"07","year":"2006","remarks":""},{"money":"£129,632","country":"UK","day":"27","month":"08","year":"2006","remarks":"101 Screens"},{"money":"£242,990","country":"UK","day":"20","month":"08","year":"2006","remarks":"104 Screens"}],"admissions":[],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"17","month":"05","year":"2004","remarks":null},{"money":null,"country":null,"day":"09","month":"06","year":"2004","remarks":null}],"copyrightHolder":"© 2006 Warner Bros. Entertainment Inc. (on print)"},"technical":{"runtime":["1 hr 40 min (100 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panasonic AG-DVX100"],"laboratory":["Swiss Effects, Zurich, Switzerland","Technicolor (color)"],"filmLength":["2,745 m"],"negativeFormat":["Video"],"cinematographicProcess":["DV (source format)","Digital Intermediate (master format)"],"printedFilmFormat":["35 mm"]},"rating":"7.1","metascore":"73","filmingLocations":[{"location":"California, USA"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Animated Film","names":[]}]}]},{"award":"Austin Film Critics Association 2007","titlesAwards":[{"titleAwardOutcome":"Won Austin Film Award","categories":[{"category":"","names":[{"name":"Richard Linklater","id":"nm0000500","role":null}]}]}]},{"award":"Chlotrudis Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Chlotrudis Award","categories":[{"category":"Best Adapted Screenplay","names":[{"name":"Richard Linklater","id":"nm0000500","role":null}]},{"category":"Best Supporting Actor","names":[{"name":"Robert Downey Jr.","id":"nm0000375","role":null}]}]}]},{"award":"Gold Derby Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Gold Derby Award","categories":[{"category":"Animated Feature","names":[]}]}]},{"award":"Golden Schmoes Awards 2006","titlesAwards":[{"titleAwardOutcome":"2nd place Golden Schmoes","categories":[{"category":"Best Animated Movie of the Year","names":[]}]},{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Trippiest Movie of the Year","names":[]},{"category":"Best Sci-Fi Movie of the Year","names":[]}]}]},{"award":"Golden Trailer Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Best Animation/Family","names":[]}]}]},{"award":"Hugo Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Hugo","categories":[{"category":"Best Dramatic Presentation - Long Form","names":[{"name":"Richard Linklater","id":"nm0000500","role":"screenplay/director"},{"name":"Philip K. Dick","id":"nm0001140","role":"based on the novel by"}]}]}]},{"award":"Indiewire Critics' Poll 2006","titlesAwards":[{"titleAwardOutcome":"3rd place ICP Award","categories":[{"category":"Best Supporting Performance","names":[{"name":"Robert Downey Jr.","id":"nm0000375","role":null}]},{"category":"Best Screenplay","names":[{"name":"Richard Linklater","id":"nm0000500","role":null}]}]}]},{"award":"International Cinephile Society Awards 2007","titlesAwards":[{"titleAwardOutcome":"Won ICS Award","categories":[{"category":"Best Animated Film","names":[]}]},{"titleAwardOutcome":"2nd place ICS Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Robert Downey Jr.","id":"nm0000375","role":null}]}]}]},{"award":"New York Film Critics Circle Awards 2006","titlesAwards":[{"titleAwardOutcome":"2nd place NYFCC Award","categories":[{"category":"Best Animated Film","names":[]}]}]},{"award":"Online Film Critics Society Awards 2007","titlesAwards":[{"titleAwardOutcome":"Won OFCS Award","categories":[{"category":"Best Animated Feature","names":[]}]}]},{"award":"Prism Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Prism Award","categories":[{"category":"Feature Film - Limited Release","names":[]}]}]},{"award":"The Stinkers Bad Movie Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Stinker Award","categories":[{"category":"Worst Supporting Actor","names":[{"name":"Woody Harrelson","id":"nm0000437","role":null}]},{"category":"Worst Animated Film","names":[]},{"category":"Worst On-Screen Hairstyle","names":[{"name":"Woody Harrelson","id":"nm0000437","role":null}]}]}]},{"award":"Toronto Film Critics Association Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated TFCA Award","categories":[{"category":"Best Animated Film","names":[]}]}]}],"votes":"92,580","type":"Movie","companyCreditsSimple":[{"idCompany":"co0106448","name":"Warner Independent Pictures (WIP)"},{"idCompany":"co0042682","name":"Thousand Words"},{"idCompany":"co0013349","name":"Section Eight"}],"keywords":{"keywords":["drugs","identity","substance d","undercover","sacrifice","code name","near future","drug user","california","corporation","schizophrenic","detective","undercover cop","trippy","beard","fast motion scene","philosophy","labor camp","moral dilemma","drug manufacturer","smoke ring","locker room","brainwashing","social commentary","false name","double cross","false accusation","regret","manipulation","insect","existentialism","aphid","convenience store","fast forward","unrequited love","secret identity","double life","dark past","suburbia","house","unemployment","slacker","infiltration","bathroom","toilet","drug supplier","stoner","betrayal","security camera","totalitarianism","informant","mass surveillance","electrocution","taser","blood splatter","unreliable narrator","beer","protester","hipster","dystopia","near death experience","junkie","drug addict","investigation","anti hero","virtuality","character's point of view camera shot","subjective camera","close up of eyes","dark hero","war on drugs","cult film","gay slur","f word","black comedy","cigar smoking","refrigerator","cigarette smoking","scene during opening credits","ambiguous ending","policewoman","female cop","written by director","friendship","hippie","anaheim california","voyeurism","voyeur","revolver","female psychologist","revelation","vomit","sports car","fast food restaurant","hammer","waitress","diner","cell phone","memory loss","hologram","office","police captain","loss of memory","police detective","femme fatale","police station","police car","police officer","video recording","conspiracy theorist","conspiracy","corporate conspiracy","map","corporate crime","body suit","evil corporation","nightmare","handcuffs","bare chested male","bare breasts","topless female nudity","security guard","schizophrenia","panic","fear","flashback","dog","bathtub","shower","vomiting","black humor","man with glasses","twitching","arrest","female frontal nudity","male frontal nudity","voice over narration","surrealism","ends with text","video surveillance","stuck accelerator","soda bottle","sheep","scramble suit","san diego california","megaphone","lawn mower","laughing","infestation","drug withdrawal","cornfield","claw hammer","choking","camouflage","booby trap","blood","bicycle","beret","american flag","pills","pill popping","marijuana joint","joint","hallucinogenic drug","drug use","drug capsule","cat","drug abuse","wine","undercover work","undercover operation","supervisor","speech","sin","rorschach inkblot","recording","psychologist","psychiatric examination","psychiatric evaluation","psychedelic","marijuana","jar","heimlich maneuver","fountainhead","flower","farm","dream","convertible","cocaine","car","bug","bug spray","brain","bed","surveillance","police","suicide attempt","female nudity","neo noir","silencer","shot in the head","premarital sex","pistol","pawn","paranoia","male nudity","head blown off","hallucination","fantasy sequence","drug war","drug rehabilitation","drug addiction","deception","death","car trouble","brain damage","split personality","drug dealer","rotoscoping","based on novel","title spoken by character","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:59:08"}}