{"data":{"movies":[{"title":"The Little Mermaid","originalTitle":"","year":"1974","releaseDate":"19870604","directors":[{"name":"Peter Sander","id":"nm1131488"}],"writers":[{"name":"Hans Christian Andersen","id":"nm0026153"},{"name":"Christine Larocque","id":"nm0488476"}],"runtime":"26 min","countries":["Canada"],"languages":["English"],"genres":["Animation","Short"],"plot":"Hans Christian Andersen's tale of the Little Mermaid who gave her life for the one she loved is brought to life with beautiful animation and narration by Richard Chamberlain.","simplePlot":"Hans Christian Andersen's tale of the Little Mermaid who gave her life for the one she loved is brought to life with beautiful animation and narration by Richard Chamberlain.","actors":[{"actorName":"Richard Chamberlain","urlProfile":"http://www.imdb.com/name/nm0000328","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NTczMjI5Nl5BMl5BanBnXkFtZTcwMzcwNTMwNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 March 1934","placeOfBirth":" Beverly Hills, Los Angeles, California, USA","birthName":"George Richard Chamberlain","height":"6' 1\" (1.85 m)","bio":"Richard Chamberlain became THE leading heartthrob of early 1960s TV. As the impeccably handsome Dr. Kildare, the slim, butter-haired hunk with the near-perfect Ivy-League charm and smooth, intelligent demeanor, had the distaff fans fawning unwavering over him throughout the series' run. While this would appear to be a dream situation for any new star, to Chamberlain it brought about a major, unsettling identity crisis. Born George Richard Chamberlain in Beverly Hills on March 31, 1934, he was the second son of Elsa Winnifred (von Benzon) (1902-1993) and Charles Axiom Chamberlain (1902-1984), a salesman. He has English and German ancestry. Richard experienced a profoundly unhappy childhood and did not enjoy school at all, making up for it somewhat by excelling in track and becoming a four-year letterman in high school and college. He also developed a strong interest and enjoyment in acting while attending Pomona College. Losing an initial chance to sign up with Paramount Pictures, the studio later renewed interest. Complications arose when he was drafted into the Army on December 7, 1956 for 16 months, serving in Korea. Chamberlain headed for Hollywood soon after his discharge and, in just a couple of years, worked up a decent resumé with a number of visible guest spots on such popular series as Gunsmoke (1955) and Mr. Lucky (1959). But it was the stardom of the medical series Dr. Kildare (1961) that garnered overnight female worship and he became a huge sweater-vested pin-up favorite. It also sparked a brief, modest singing career for the actor. The attention Richard received was phenomenal. True to his \"Prince Charming\" type, he advanced into typically bland, soap-styled leads on film befitting said image, but crossover stardom proved to be elusive. The vehicles he appeared in, Twilight of Honor (1963) with Joey Heatherton and Joy in the Morning (1965) opposite Yvette Mimieux, did not bring him the screen fame foreseen. The public obviously saw the actor as nothing more than a TV commodity. More interested in a reputation as a serious actor, Chamberlain took a huge risk and turned his back on Hollywood, devoting himself to the stage. In 1966 alone he appeared in such legit productions as \"The Philadelphia Story\" and \"Private Lives,\" and also showed off his vocal talents playing Tony in \"West Side Story\". In December of that year a musical version of \"Breakfast at Tiffany's\" starring Richard and Mary Tyler Moore in the sparkling George Peppard/Audrey Hepburn roles was headed for Broadway. It flopped badly in previews, however, and closed after only four performances. Even today it is still deemed one of Broadway's biggest musical disasters. An important dramatic role in director Richard Lester's Petulia (1968) led Richard to England, where he stayed and dared to test his acting prowess on the classical stage. With it, his personal satisfaction over image and career improved. Bravura performances as \"Hamlet\" (1969) and \"Richard II\" (1971), as well as his triumph in \"The Lady's Not for Burning\" (1972), won over the not-so-easy-to-impress British audiences. And on the classier film front, he ably portrayed Octavius Caesar opposite Charlton Heston's _Mark Antony_(1970)_ and Jason Robards' Brutus; composer Pyotr Ilyich Tchaikovsky in Ken Russell's grandiose The Music Lovers (1970) opposite Glenda Jackson; and Lord Byron alongside Sarah Miles_ in Lady Caroline Lamb (1972). While none of these three films were critical favorites, they were instrumental in helping to reshape Chamberlain's career as a serious, sturdy and reliable actor. With his new image in place, Richard felt ready to face American audiences again. While he made a triumphant Broadway debut as Reverend Shannon in \"The Night of the Iguana\" (1975), he also enjoyed modest box-office popularity with the action-driven adventure movies The Three Musketeers (1973) as Aramis and a villainous role in The Towering Inferno (1974), and earned cult status for the Aussie film The Last Wave (1977). On the television front, he became a TV idol all over again (on his own terms this time) as the \"King of 80s Mini-Movies\". The epic storytelling of The Count of Monte-Cristo (1975), The Thorn Birds (1983) and Shogun (1980), all of which earned him Emmy nominations, placed Richard solidly on the quality star list. He won Golden Globe awards for his starring roles in the last two miniseries mentioned. In later years the actor devoted a great deal of his time to musical stage tours as Henry Higgins in \"My Fair Lady\", Captain Von Trapp in \"The Sound of Music\" and Ebenezer Scrooge in \"Scrooge: The Musical\". Enormously private and having moved to Hawaii to avoid the Hollywood glare, at age 69 finally \"came out\" with a tell-all biography entitled \"Shattered Love,\" in which he quite candidly discussed the anguish of hiding his homosexuality to protect his enduring matinée idol image. Since then, he has accepted himself and shown to be quite a good sport in the process, appearing as gay characters in the film I Now Pronounce You Chuck & Larry (2007), and in TV episodes of Will & Grace (1998), Desperate Housewives (2004) and Brothers & Sisters (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NTczMjI5Nl5BMl5BanBnXkFtZTcwMzcwNTMwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000328","name":"Richard Chamberlain","idIMDB":"nm0000328"},"actorId":"nm0000328","character":"Narrator","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0404204","urlIMDB":"http://www.imdb.com/title/tt0404204","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["30 min","26 min (USA)"],"soundMix":["Mono (Western Electric Sound System)"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"8.1","filmingLocations":[],"awards":[],"votes":"54","type":"Movie","companyCreditsSimple":[{"idCompany":"co0032648","name":"Potterton Productions"},{"idCompany":"co0043149","name":"Reader's Digest"}],"keywords":{"keywords":["fairy tale"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 06:03:23"}}