{"data":{"movies":[{"title":"Locusts","originalTitle":"","year":"2005","releaseDate":"20050424","directors":[{"name":"David Jackson","id":"nm0002413"}],"writers":[{"name":"Doug Prochilo","id":"nm1856985"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMDQ3NjYzNV5BMl5BanBnXkFtZTcwNzYyMTkyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Sci-Fi","Horror","Drama","Thriller"],"plot":"Dr. Maddy Rierdon, an investigator for the Department of Agriculture, is the only person who can protect America from a deadly breed of bioengineered locusts.","simplePlot":"Dr. Maddy Rierdon, an investigator for the Department of Agriculture, is the only person who can protect America from a deadly breed of bioengineered locusts.","actors":[{"actorName":"Lucy Lawless","urlProfile":"http://www.imdb.com/name/nm0005128","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkyOTc1Nzc4OV5BMl5BanBnXkFtZTcwMzM4NDk4Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 March 1968","placeOfBirth":" Mount Albert, Auckland, New Zealand","birthName":"Lucille Francis Ryan","height":"5' 9½\" (1.77 m)","bio":"New Zealand icon Lucy Lawless, is most famously known for her role as \"Xena the Warrior Princess\". Lucy is married to producer Rob Tapert (Robert Gerard Tapert) and resides in New Zealand. They have two sons, Julius Robert Bay Tapert and Judah Miro Tapert, who were both born in New Zealand. Lucy also has a daughter, Daisy Lawless, from her first marriage to Garth Lawless. She was awarded an Order of Merit in the New Zealand Queen's Birthday Honor List in June 2004. Lucy, whose role as \"Xena in Xena: Warrior Princess\" made her a cult television star, has been involved with the Starship Foundation and has held a role on its board of trustees. She was awarded the Order of Merit for services to entertainment and the community. In 1995, Lucy landed the role of \"Xena: Warrior Princess\" in the show, Hercules: The Legendary Journeys (1995), in a three-story arc, that led to her own spin-off show, Xena: Warrior Princess (1995), for six seasons. Whilst she has been primarily known for her role on \"Xena: Warrior Princess\", Lucy has also appeared in the classic TV series, Battlestar Galactica (2004), in the semi-regular role of \"D'anna Biers\", amongst her other many and varied roles, including the hit Adam Sandler movie, Bedtime Stories (2008). Lucy was also in several made-for-TV movies including: Locusts (2005) and Vampire Bats (2005). She also lent her voice to the straight-to-video movies: Justice League: The New Frontier (2008) and Dragonlance: Dragons of Autumn Twilight (2008). During 2011, Lucy appeared in the \"No Ordinary Family\" as the mysterious \"Mrs. X\" and also appeared in the prequel to Spartacus: War of the Damned (2010), Spartacus: Gods of the Arena (2011) and \"Spartacus Vengeance\" as \"Lucretia\". Her most recent role was \"Caroline Platt\" in Jane Campion's Top of the Lake (2013), a BBC Mini-Series in New Zealand, with Holly Hunter and Elisabeth Moss. She plays the recurring character of \"Diane Lewis\" on NBC's Parks and Recreation (2009). She will play \"Velma Kelly\" in the Auckland Theatre Company's adaptation of \"Chicago: The Musical\", from 1-24 November 2013.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkyOTc1Nzc4OV5BMl5BanBnXkFtZTcwMzM4NDk4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005128","name":"Lucy Lawless","nicknames":["Unco, short for Uncoordinated","Luce","LL"],"idIMDB":"nm0005128"},"actorId":"nm0005128","character":"Maddy Rierdon","urlCharacter":"http://www.imdb.com/character/ch0066030","main":true},{"actorName":"John Heard","urlProfile":"http://www.imdb.com/name/nm0001334","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzczODkyNzY4OV5BMl5BanBnXkFtZTcwNTU0NjQzMQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 March 1945","placeOfBirth":" Washington, District of Columbia, USA","height":"5' 9¼\" (1.76 m)","bio":"John Heard is a very talented actor who established himself in the late 1970s and early '80s with roles in the movies Between the Lines (1977), Chilly Scenes of Winter (1979) (a.k.a. \"Head Over Heels\"), and Heart Beat (1981) (in which he played Jack Kerouac to Nick Nolte's Neal Cassady and Sissy Spacek's Carolyn Cassady) before giving a tour de force performance as a hideously wounded (both physically and psychologically) Vietnam veteran in Cutter's Way (1981) (a.k.a. \"Cutter and Bone\") opposite Jeff Bridges. He also shined as Reverend Dimmesdale (one of America's first religious hypocrites) in the 1979 PBS version of Nathaniel Hawthorne's The Scarlet Letter (1979). Both \"Chilly Scenes of Winter\" and Cutter's Way\" (originally released as \"Head Over Heels\" and \"Cutter and Bone\", respectively) had been re-released under new titles after failing in their first go-rounds, such was the quality of the films. The two re-releases helped redefine the practice by which major studios handled smaller, art house quality pictures by releasing them carefully to select theaters with bespoke marketing campaigns so they reached the proper audience. (Studios would later develop their own art film-independent film subsidiaries to handle such pictures, so they didn't \"fall through the cracks\" like the first releases of the two Heard films.) By the early 1980s John Heard seemed on his way to establishing himself as a major American actor if not on the path to movie stardom. At the time, there was joke that involved confusing Heard with John Hurt and William Hurt because of the similarity of their last names. At the time these contemporaries were considered equal in terms of their star power. That was 30 years ago. William Hurt (the erstwhile husband of Heard's \"Head Over Heels\" co-star Mary Beth Hurt) went on to win a Best Actor Oscar as well as enjoy leading man status as a movie star in the mid- to late-'80s before he flared out in the early 1990s. John Hurt become one of the most respected actors of his generation, nominated twice for the Academy Award. Among Heard's co-stars of his early endeavors, Bridges and Spacek also went on to win Oscars and Nolte has been a multiple nominee. In the early '80s it would not have been unreasonable to predict that Heard himself would become an Oscar winner or a multiple nominee. That didn't happen. (He did get nominated for an Emmy for his turn as a corrupt police detective on The Sopranos (1999).) Heard now is best known for his two turns as Macaulay Culkin's father in the Home Alone (1990) movies. In the 1980s he continued to work on A-List projects, playing the not-so-sympathetic son to Geraldine Page in The Trip to Bountiful (1985) (for which Page won her own Oscar) and Tom Hanks's adult rival in Big (1988) (for which Hanks won his first Oscar nomination), but this meant that by the latter part of the decade he had failed to establish himself as a leading man and was doing supporting roles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzczODkyNzY4OV5BMl5BanBnXkFtZTcwNTU0NjQzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001334","name":"John Heard","idIMDB":"nm0001334"},"actorId":"nm0001334","character":"Dr. Peter Axelrod","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dylan Neal","urlProfile":"http://www.imdb.com/name/nm0623604","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMDc2OTQ1N15BMl5BanBnXkFtZTgwMDA0NTU5OTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 October 1969","placeOfBirth":" Richmond Hill, Ontario, Canada","birthName":"Dylan J. Neal","height":"6' 2\" (1.88 m)","bio":"Dylan Neal was born in Richmond Hill, Ontario, Canada. Shortly thereafter, his family moved to Oakville, just west of Toronto, where he spent the remainder of his childhood. As a young student, he attended the prep school, Appleby College, where he was introduced to the game of squash. Dylan quickly fell in love with the sport and was soon playing for Canada at an international level. Toward the end of his teenage years, after many years of traveling across North America on the amateur squash circuit, Dylan decided a professional squash career was not for him. By that time, Dylan was attending Blakelock High School, where he was enrolled in the drama program. At the urging of his drama teacher, Dylan signed with a Toronto talent agent and began auditioning professionally. It didn't take long for Dylan to realize this was the direction his career would take. In 1992, Dylan moved to Los Angeles, where his career quickly took off. He lived in Los Angeles until 2006, when he and his family moved to Vancouver for production of the Lifetime television series 'Blood Ties'. In 2011, Dylan and his family returned to Los Angeles. Dylan Neal is a well-recognized face on television, having had series regular roles in eight American television series, including 'The Bold and the Beautiful', Aaron Spelling's 'Pacific Palisades', 'Hyperion Bay', and 'Blood Ties'. Dylan has had many major recurring roles, including his five-year stint on 'Dawson's Creek' playing Joshua Jackson's brother, Doug Witter, and as Aaron on 'Sabrina the Teenage Witch' opposite Melissa Joan Hart. He has had the good fortune of working with some of the biggest names in Hollywood and in 2012 was offered the male lead role of Jack Griffith opposite Andie MacDowell in the television series 'Cedar Cove'. The series is based on international best-selling author Debbie Macomber's series of books with the same name and premiered on the Hallmark Channel on July 20, 2013. Starting in 2014, Dylan began writing, executive producing and starring in a series of TV movies called The Gourmet Detective for The Hallmark Movies and Mysteries Channel. Dylan's career has allowed him to travel extensively for work, filming in such locations as Israel, Germany, China, the Caribbean, and throughout North America. In his downtime, Dylan enjoys spending as much time as he can with his family and friends. On occasion, he can also be spotted in his workshop, where, as an avid woodworker, he has for years re-created eighteenth- and nineteenth-century period furniture.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMDc2OTQ1N15BMl5BanBnXkFtZTgwMDA0NTU5OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0623604","name":"Dylan Neal","idIMDB":"nm0623604"},"actorId":"nm0623604","character":"Dan Dyrer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gregory Alan Williams","urlProfile":"http://www.imdb.com/name/nm0930707","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MDQ5ODE1NV5BMl5BanBnXkFtZTgwMzYwNDA5OTE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 June 1956","placeOfBirth":" Des Moines, Iowa, USA","bio":"Gregory Alan Williams was born on June 12, 1956 in Des Moines, Iowa, USA. He is an actor and writer, known for Baywatch (1989), Terminator Genisys (2015) and In the Line of Fire (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MDQ5ODE1NV5BMl5BanBnXkFtZTgwMzYwNDA5OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0930707","name":"Gregory Alan Williams","idIMDB":"nm0930707"},"actorId":"nm0930707","character":"General Miller","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike Farrell","urlProfile":"http://www.imdb.com/name/nm0268286","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwODYzNDIwOV5BMl5BanBnXkFtZTYwMzUyOTc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 February 1939","placeOfBirth":" St. Paul, Minnesota, USA","birthName":"Michael Joseph Farrell","height":"6' 3\" (1.91 m)","bio":"Mike is one of four children. His father, Joe, who died in 1956, was a carpenter at Hollywood studios. Mike attended grammar school with Natalie Wood and Ricky Nelson. He entered the Marines in the 1950s for two years. Later, he attended the University of California at Los Angeles and studied acting at the Jeff Corey Workshop. He started getting big parts in movies, which led to a regular role on Days of Our Lives (1965) and, ultimately, to M*A*S*H (1972). When M*A*S*H (1972) went off the air, he resisted series TV for many years until he was offered Providence (1999). In the meantime, he formed his own production company, which made the Robin Williams vehicle, Patch Adams (1998), based on Mike's own acquaintance with the doctor. Mike is very politically involved. He lobbied against the firing of gay teachers. He was outspoken about the US involvement in Ecuador in the 80s. He served as a member of California's Commission on Judicial Performance from February 2, 1998 to February 28, 2001.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwODYzNDIwOV5BMl5BanBnXkFtZTYwMzUyOTc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0268286","name":"Mike Farrell","idIMDB":"nm0268286"},"actorId":"nm0268286","character":"Lyle Rierden","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Natalija Nogulich","urlProfile":"http://www.imdb.com/name/nm0634101","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODc4MzAyOF5BMl5BanBnXkFtZTcwNDQyNjE2Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1950","placeOfBirth":" Chicago, Illinois, USA","birthName":"Natalija Nogulich","bio":"Natalija Nogulich, newly published author of her debut novel, \"One Woman's War,\" is currently writing Book 2 of the trilogy. She recently performed in the show finale of GLEE, an episode of Disney's new show , KC UNDERCOVER, and prior to that, the season finale of NCIS followed by an episode of Disney's Kickin' It, 2 Broke Girls and Criminal Minds. Ms. Nogulich was a regular recurring character in ABC series, Red Widow, as Russian mob wife, Elena Petrova, and appeared in HBO's biopic, Phil Spector, as Italian journalist, Giovanetta Ricci, directed by David Mamet; on Disney Channel in Wizards of Waverly Place Reunion with Ms. Nogulich as Carmela. Originally from Chicago, she was educated in Illinois and in Spain and Italy. Studying and traveling throughout Europe, she gained command of five languages. After receiving her B.A. from Lake Forest College, where she graduated Phi Beta Kappa, she went on to study and work with David Mamet at his St. Nicholas Theatre Company in Chicago. Later she was under the tutelage of Stella Adler and Michael Moriarty, both in New York and Los Angeles. Natalija was also a student of Kenneth McMillan until he inaugurated her teaching and directing career in Los Angeles. On Broadway, she starred in Hurlyburly, the Iceman Cometh, and Accomplice; as well as innumerable off-Broadway productions, including Restoration at New York Theatre Workshop in 2010. On Los Angeles stages, she has been seen at the Mark Taper Forum in Scenes from an Execution; in the title role of TAMARA; and won four Drama-Logue Acting Awards for: The Three Sisters, Hedda Gabler, the White Rose and Once in a Lifetime. Additionally, she starred in many regional productions throughout the United States, including the Pulitzer Prize Finalist, THE WAVERLY GALLERY at the Pasadena Playhouse, (for which she was awarded the \"Entertainment Today\" Best Supporting Actress Award), and George Bernard Shaw's MISALLIANCE at Center Stage in Baltimore. Natalija has done five David Mamet Films: Phil Spector, Spartan, Homicide, Things Change, the Water Engine, and As Jack Nicholson's Wife, Hoffa. She has completed over thirty films including: Incarnate, Sharkskin, the Hollow, Steal Big - Steal Little, Above Suspicion, an Eye for an Eye, the Glass Shield, the Chase, Postcards from the Edge, Blood in - Blood Out, the Guardian, Christmas Vacation, Four Friends, Stony Island and others. Ms. Nogulich did two indie films, I'll Melt With You, and Commentary which were in 2011 Sundance Film Festival. On Television she is most known for her role as Admiral Nechayev in STAR TREK - THE NEXT GENERATION; and she's done numerous movies for television including: Jane Doe 9, Locusts, Pizza My Heart, Growing Pains, Dying to Dance, the Sleepwalker Killing, Lazarus Man, and Has Recurred On Episodes Of: the West Wing, the Practice, the Pretender, Brooklyn Bridge, Tracy Takes On, to name a few. She has guested on many other shows including David Mamet's hit series, The Unit, Bones, Nip/tuck, the Closer, Huff, Crossing Jordan, Without a Trace, Charmed, the award winning 24; and many others. As Artistic Director of The Grace Players Theatre Company, which she founded in 1994, Ms. Nogulich produced and directed the West Coast Premiere of David Mamet's adaptation of Chekhov's The Three Sisters, which garnered four Drama-Logue Awards including Best Direction and Best Production. She directed the World Premiere of Jason Milligan's comedy Walking On the Moon; six One Act Festivals, and over twenty other projects featuring actors Joe Mantegna, W.H. Macy, George Segal, Frank Langella, Burt Reynolds, Marion Ross, Carol Kane, Lolita Davidovitch and others. In Washington D.C.she directed David Selby in his play Lincoln and James at the 1400-seat Lincoln Theatre in honor of the dedication of the first Monument to Afro-American soldiers of the Civil War. In 2000, she directed her own adaptation of Romeo and Juliet in the American Civil War at Davis Theatre in Illinois, and in 2001 she directed a production of her own adaptation of An Enemy of the People at the same theatre. In Los Angeles at the Egyptian Arena Theatre, she directed Supreme Therapy, a world premiere play written by Michael Davidson starring Ray Abruzzo of \"The Sopranos.\" In the fall of 2004 she directed and starred in the World Premiere of her own adaptation of Alexander Dumas' novel, \"Camille,\" entitled THE DAME OF NEW ORLEANS. In 2006 she compiled, edited and directed A Tribute to Eugene O'neilL; and helmed a revival of Burn This, starring members of her theatre company, The Grace Players. The Grace Players then produced a Shakespeare Festival honoring the Bard's Birthday which Ms. Nogulich directed. Other theatrical projects include A Holiday Potopourri, a benefit for the children of severely wounded American troops in Iraq. As a filmmaker, she wrote and directed a documentary short called \"Corporal Jake,\" about World War I Congressional Medal of Honor Recipient Jake Allex. It was filmed in Kentucky and Chicago and was produced by BGFilmz of Chicago. Natalija is Adjunct Professor at renowned Art Center College of Design in Pasadena where she teaches graduate and undergraduate Film Directing students. She also teaches Producers at AFI Conservatory in Los Angeles. She has been a Visiting Professor in the Theatre Department at Principia College, Notre Dame University and Cal Poly in San Luis Obispo, and has also taught at the Los Angeles Country High School for the Performing Arts. She is a Private Coach to Los Angeles actors and directors. Natalija Nogulich currently lives in Los Angeles, where she continues to act, write, teach and direct.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODc4MzAyOF5BMl5BanBnXkFtZTcwNDQyNjE2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0634101","name":"Natalija Nogulich","idIMDB":"nm0634101"},"actorId":"nm0634101","character":"Lorelei Wentworth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike Gomez","urlProfile":"http://www.imdb.com/name/nm0327059","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2NjUyNDc1M15BMl5BanBnXkFtZTcwNTExMTQzOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1951","placeOfBirth":" Dallas, Texas, USA","bio":"Mike Gomez was born on April 18, 1951 in Dallas, Texas, USA. He is known for his work on The Big Lebowski (1998), Yes Man (2008) and Heartbreak Ridge (1986).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2NjUyNDc1M15BMl5BanBnXkFtZTcwNTExMTQzOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0327059","name":"Mike Gomez","idIMDB":"nm0327059"},"actorId":"nm0327059","character":"Secretary Morales","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Esperanza Catubig","urlProfile":"http://www.imdb.com/name/nm0146400","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNzk5NTUyMV5BMl5BanBnXkFtZTcwNzc1NzkyMQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 April 1971","placeOfBirth":" San Francisco, California, USA","height":"5' 4\" (1.63 m)","bio":"Esperanza Catubig was born on April 7, 1971 in San Francisco, California, USA. She is an actress and producer, known for Clockstoppers (2002), Nico's Sampaguita (2012) and Dumbarton Bridge (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNzk5NTUyMV5BMl5BanBnXkFtZTcwNzc1NzkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0146400","name":"Esperanza Catubig","idIMDB":"nm0146400"},"actorId":"nm0146400","character":"Vivian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sam Temeles","urlProfile":"http://www.imdb.com/name/nm0848611","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MDk1NzMwM15BMl5BanBnXkFtZTgwMTk0NjE5NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Sam Temeles is an actor, known for Boston Legal (2004), Locusts (2005) and Free Radio (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MDk1NzMwM15BMl5BanBnXkFtZTgwMTk0NjE5NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0848611","name":"Sam Temeles","idIMDB":"nm0848611"},"actorId":"nm0848611","character":"Wyatt Reynolds","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Costello","urlProfile":"http://www.imdb.com/name/nm0182584","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0NDQzNDM5M15BMl5BanBnXkFtZTcwMDcyODk3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Mark Costello is an actor, known for Tribes (1990), My Last Day (2010) and Witness (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0NDQzNDM5M15BMl5BanBnXkFtZTcwMDcyODk3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0182584","name":"Mark Costello","idIMDB":"nm0182584"},"actorId":"nm0182584","character":"Director Rusk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Margaret Lawhon","urlProfile":"http://www.imdb.com/name/nm0492451","urlPhoto":"","biography":{"bio":"Margaret Lawhon is known for her work on Deja Vu (2006), Runaway Jury (2003) and Flakes (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0492451","name":"Margaret Lawhon","idIMDB":"nm0492451"},"actorId":"nm0492451","character":"Senator Clauson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Caroline McKinley","urlProfile":"http://www.imdb.com/name/nm1301031","urlPhoto":"","biography":{"bio":"Caroline McKinley is an actress, known for Deal (2008), Glory Road (2006) and Girl, Positive (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1301031","name":"Caroline McKinley","idIMDB":"nm1301031"},"actorId":"nm1301031","character":"Terry Axelrod","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"D.J. Dierker","urlProfile":"http://www.imdb.com/name/nm0201538","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5Njg4NTcxM15BMl5BanBnXkFtZTcwODA2MTgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Daniel Joseph Mance","bio":"Daniel Joseph Dierker is an actor and filmmaker from Denver, Colorado who has worked professionally in front of and behind the camera since 1995. After attending New York University's Film School at Tisch School of the Arts, Daniel enjoyed an acting career in film, television, theatre and radio, before rotating back behind the lens to become a professional camera operator, cinematographer, writer, and director.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5Njg4NTcxM15BMl5BanBnXkFtZTcwODA2MTgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0201538","name":"D.J. Dierker","idIMDB":"nm0201538"},"actorId":"nm0201538","character":"Jonas Hanauer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicolas Roye","urlProfile":"http://www.imdb.com/name/nm0747346","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyOTE3NjQ5MF5BMl5BanBnXkFtZTgwNDczNjA3MzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1977","placeOfBirth":" Lakewood, New Jersey, USA","height":"5' 8\" (1.73 m)","bio":"Graduated from the University of New Orleans in 1999 where he won \"Best Actor\" for his portrayal of 'Pale' in 'Burn This'. He followed up with performances as Sebastian in 'Twelth Night' and Nicholas Beckett in 'What the Butler Saw'. Nick is the son of an Italian mother and a Spanish father. Real mother, Lisa Ann Collura, passed away in 1985.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyOTE3NjQ5MF5BMl5BanBnXkFtZTgwNDczNjA3MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0747346","name":"Nicolas Roye","idIMDB":"nm0747346"},"actorId":"nm0747346","character":"Jimmy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Drew Seeley","urlProfile":"http://www.imdb.com/name/nm1192060","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NDUyNDU1OV5BMl5BanBnXkFtZTcwNTkzMjg4OQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 April 1982","placeOfBirth":" Ottawa, Ontario, Canada","birthName":"Andrew Michael Edgar Seeley","height":"5' 11\" (1.8 m)","bio":"Drew Seeley grew up in Toronto where he first fell in love with performing. At age 11, he was cast in Hal Prince's revival of Showboat and stayed with the production for a year. Two years later, he got his first guitar, began writing songs, and hasn't looked back since. In 2005 Drew started working with established producer Ray Cham and together they wrote \"Getcha Head in the Game\" for Disney's quadruple platinum High School Musical soundtrack. This garnered them an Emmy nomination in the \"Best Original Song and Lyrics\" category. In addition, Drew co-starred in the North American and Latin American tours of \"High School Musical: The Concert\" playing in 60,000 seat arenas. Drew's song and video \"Dance with Me\", from the platinum Cheetah Girls 2 soundtrack, can be seen on the Disney Channel and he also appeared in Belinda Peregrin's music video \"Ni Freud, Ni Tu Mama\". He wrote and performed music for the Disney Channel Original Movie \"Jump In!\" starring Corbin Bleu, and his spin on America's 'Magic' was released on the \"Wizards of Waverly Place\" soundtrack. Drew also made a guest appearance on the Chipmunks CD \"Undeniable\", singing Shake Your Groove Thing with Alvin and the gang. He has recently been on a national tour performing original music from his debut album 'The Resolution' Drew's acting career has included guest starring roles on One Tree Hill, Dawson's Creek, Guiding Light, and more recently, Warner Premiere's Another Cinderella Story in which he stars as pop star Joey Parker opposite Selena Gomez. Drew also co-wrote and performs 4 songs in the film. One of these songs, New Classic, enjoyed a slot on Radio Disney's Top 10 countdown for 2 months, and the music video has surpassed 3 million views on YouTube. In 2009, Drew tried his hand at Broadway, taking on the role of Prince Eric in 'The Little Mermaid'. He was part of the show through the end of it's run, and recorded an alternate version of Prince Eric's song 'Her Voice' which was released on the DisneyMania 7 album. The music video for 'Her Voice' can also now be seen on YouTube. Additionally, Drew starred alongside 30 Rock's Katrina Bowden in the Adam Sandler produced film, The Shortcut, reunited with HSM alum Lucas Grabeel for the rock musical, 'I Kissed A Vampire', and portrayed the title character in the Hallmark Channel original movie, 'Freshman Father'. The film, which is based on a true story, also includes 'Best at the Time', co-penned by Drew. Most recently, Drew starred in the TBS series, Glory Daze, playing an aspiring politician named Jason Wilson. Drew resides in sunny Los Angeles and spends as much time at the beach as possible.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NDUyNDU1OV5BMl5BanBnXkFtZTcwNTkzMjg4OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1192060","name":"Drew Seeley","nicknames":["Drew"],"idIMDB":"nm1192060"},"actorId":"nm1192060","character":"Willy","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0452640","urlIMDB":"http://www.imdb.com/title/tt0452640","business":{"budget":{"money":"$6,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 35 min (95 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.0","filmingLocations":[{"location":"New Orleans, Louisiana, USA"}],"rated":"TV-PG","awards":[],"votes":"1,202","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0135798","name":"VZS Productions"},{"idCompany":"co0094479","name":"Von Zerneck Sertner Films"}],"keywords":{"keywords":["locust","disaster movie","school bus","farm","destruction","airplane"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:13:55"}}