{"data":{"movies":[{"title":"The Last Time","originalTitle":"","year":"2006","releaseDate":"20070824","directors":[{"name":"Michael Caleo","id":"nm1003636"}],"writers":[{"name":"Michael Caleo","id":"nm1003636"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MDRhYjktMTcxZC00YTg3LTk1ZDktN2ZmZDc2ZmU3YzA2XkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama","Thriller"],"plot":"Ted Ryker is the top salesman in the New York office of a business machine company; the corporate stock lives by quarterly sales numbers, the competition is keen, and the economy may be in a downturn. Ted's company is marking time until a new product is ready - probably in a few months. Into the mix comes a new hire, a callow Midwesterner named Jamie, who's come East with his fiancée Belisa. Ted's a cynic - with a failed love in his past; he's profane, he's a lousy team player. He watches Jamie flounder, failing with presentation after presentation. Then, Ted finds a mutual attraction to Belisa. Where can this end?","simplePlot":"A salesman (Keaton) rediscovers a lust for life after falling for the fiancée of his new business partner (Fraser), a Midwest transplant finding his footing in New York City.","actors":[{"actorName":"Michael Keaton","urlProfile":"http://www.imdb.com/name/nm0000474","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NTE2MzczOF5BMl5BanBnXkFtZTYwNTM4MjYz._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 September 1951","placeOfBirth":" Coraopolis, Pennsylvania, USA","birthName":"Michael John Douglas","height":"5' 9\" (1.75 m)","bio":"Quirky, inventive and handsome American actor Michael Keaton first achieved major fame with his door-busting performance as fast-talking ideas man Bill Blazejowski, alongside a nerdish morgue attendant (Henry Winkler), in Night Shift (1982). He played further comedic roles in Mr. Mom (1983), Johnny Dangerously (1984), and Beetlejuice (1988), earned further acclaim for his dramatic portrayal of Bruce Wayne / Batman in Tim Burton's Batman (1989) and Batman Returns (1992), and since then, has moved easily between film genres, ranging from drama and romantic comedy to thriller and action. Keaton was born Michael John Douglas on September 5, 1951 in Coraopolis, Pennsylvannia, to Leona Elizabeth (Loftus), a homemaker, and George A. Douglas, a civil engineer and surveyor. He is of Irish, as well as English, Scottish, and German, descent. Michael studied speech for two years at Kent State, before dropping out and moving to Pittsburgh. An unsuccessful attempt at stand-up comedy led Keaton to working as a TV cameraman in a cable station, and he came to realize he wanted to work in front of the cameras. Keaton first appeared on TV in several episodes of Mister Rogers' Neighborhood (1968). He left Pittsburgh and moved to Los Angeles to begin auditioning for TV. He began cropping up in popular TV shows including Maude (1972) and The Mary Tyler Moore Hour (1979). Around this time, Keaton decided to use an alternative surname to remove confusion with better-known actor Michael Douglas. After reading an article on actress Diane Keaton, he decided that Michael Keaton sounded good. His next break was scoring a co-starring role alongside Jim Belushi in the short-lived comedy series Working Stiffs (1979), which showcased his comedic talent and led to his co-starring role in Night Shift (1982). Keaton next scored the lead in the comedy hits Mr. Mom (1983), Johnny Dangerously (1984) , Gung Ho (1986), the Tim Burton horror-comedy Beetlejuice (1988), and The Dream Team (1989). Keaton's career was given another major boost when he was again cast by Tim Burton, this time as the title comic book superhero, millionaire playboy / crime-fighter Bruce Wayne, in Batman (1989). Burton cast him because he thought that Keaton was the only actor who could portray someone who has the kind of darkly obsessive personality that the character demands. To say there were howls of protest by fans of the caped crusader comic strip is an understatement! Warner Bros. was deluged with thousands of letters of complaint commenting that comedian Keaton was the wrong choice for the Caped Crusader, given his prior work and the fact that he lacked the suave, handsome features and tall, muscular physicality often attributed to the character in the comic books. However, their fears were proven wrong when Keaton turned in a sensational performance, and he held his own on screen with opponent Jack Nicholson, playing the lunatic villain, \"The Joker\". Keaton's dramatic work earned widespread acclaim from critics and audiences alike, and Batman (1989) became one of the most successful films of the year. Keaton remained active during the 1990s, appearing in a wide range of films. Keen to diversify his work, Keaton starred as a psychotic tenant in Pacific Heights (1990), as a hard-working cop in One Good Cop (1991), and then donned the black cape and cowl once more for Batman Returns (1992). He remained in demand during the 1990s, appearing in a wide range of films, including the star-studded Shakespearian Much Ado About Nothing (1993), the drama My Life (1993), another Ron Howard comedy The Paper (1994), with sexy Andie MacDowell in Multiplicity (1996), twice in the same role, dogged Elmore Leonard character Agent Ray Nicolette, in Jackie Brown (1997) and Out of Sight (1998). He also played a killer in the mediocre thriller Desperate Measures (1998). In the 2000s, Keaton appeared in several productions with mixed success, including Live from Baghdad (2002), First Daughter (2004), and Herbie Fully Loaded (2005). He also provided voices for characters in the animated films Cars (2006), Toy Story 3 (2010), and Minions (2015). He returned to major film roles in the 2010s, co-starring in The Other Guys (2010), RoboCop (2014) and Need for Speed (2014). Also that year, Keaton starred alongside Zach Galifianakis, Edward Norton, Emma Stone, and Naomi Watts in Birdman or (The Unexpected Virtue of Ignorance) (2014), a film by 21 Grams (2003) and Biutiful (2010) director Alejandro González Iñárritu. In the film, Keaton plays Riggan Thomson, a screen actor, famous for playing the iconic titular superhero, who puts on a Broadway play based on a Raymond Carver short story, to regain his former glory. Keaton's critically praised lead performance earned him a Golden Globe Award for Best Actor in a Musical or Comedy, the Critics' Choice Award for Best Actor and Best Actor in a Comedy, and nominations for the Screen Actors Guild Award, British Academy Film Award, and Academy Award for Best Actor. In 2015, he played a journalist in Spotlight (2015), which, like Birdman, won the Academy Award for Best Picture. In 2016, he starred as Ray Kroc, the developer of McDonald's, in the drama The Founder (2016). He is a visiting scholar at Carnegie Mellon University.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NTE2MzczOF5BMl5BanBnXkFtZTYwNTM4MjYz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000474","name":"Michael Keaton","nicknames":["Michael Douglas"],"idIMDB":"nm0000474"},"actorId":"nm0000474","character":"Ted Riker","urlCharacter":"http://www.imdb.com/character/ch0231848","main":true},{"actorName":"Brendan Fraser","urlProfile":"http://www.imdb.com/name/nm0000409","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MjExMzY0M15BMl5BanBnXkFtZTgwNTMxOTg4MTI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 December 1968","placeOfBirth":" Indianapolis, Indiana, USA","birthName":"Brendan James Fraser","height":"6' 3\" (1.91 m)","bio":"Brendan James Fraser was born in Indianapolis, Indiana, to Canadian parents Carol Mary (Genereux), a sales counselor, and Peter Fraser, a journalist and travel executive. He is of Irish, Scottish, German, Czech, and French-Canadian ancestry. As his parents frequently moved, Brendan can claim affinity with Ottawa, Indianapolis, Detroit, Seattle, London and Rome. His early exposure to theatre, particularly in London, led him to Seattle's Cornish Institute. After graduation he found a minor role as Sailor #1 in River Phoenix's Dogfight (1991), then somewhat more substantial roles in Encino Man (1992) and School Ties (1992). He expresses a preference for playing \"fish out of water\" men. Five more years of supporting work led finally to the title role in George of the Jungle (1997), a role which fully utilized his charm and beefy good looks, as well as offering him a chance to show off his comic talents. He describes this role as the one which dramatically altered his career. Critical raves for his role in Gods and Monsters (1998) pointed to yet another dimension to his dramatic persona.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MjExMzY0M15BMl5BanBnXkFtZTgwNTMxOTg4MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000409","name":"Brendan Fraser","idIMDB":"nm0000409"},"actorId":"nm0000409","character":"Jamie Bashant","urlCharacter":"http://www.imdb.com/character/ch0266928","main":true},{"actorName":"Amber Valletta","urlProfile":"http://www.imdb.com/name/nm0005520","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMjMxMzU1NF5BMl5BanBnXkFtZTcwNDcyMDY4Mg@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1974","placeOfBirth":" Phoenix, Arizona, USA","birthName":"Amber Evangeline Valletta","height":"5' 9\" (1.75 m)","bio":"Amber Valletta was born in Phoenix, Arizona, USA as Amber Evangeline Valletta. She is an actress, producer and model. She began her career as a fashion model. Valletta was married to Olympic volleyball player Chip McCaw with whom she has a son, Auden. Valletta endorsed Democrat President Barack Obama for re-election in 2012. In July 2014, Valletta spoke out about her battle with drug and alcohol addiction.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMjMxMzU1NF5BMl5BanBnXkFtZTcwNDcyMDY4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005520","name":"Amber Valletta","idIMDB":"nm0005520"},"actorId":"nm0005520","character":"Belisa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Daniel Stern","urlProfile":"http://www.imdb.com/name/nm0827663","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NTcwNDcxMF5BMl5BanBnXkFtZTcwMTI3Mjc4Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1957","placeOfBirth":" Bethesda, Maryland, USA","birthName":"Daniel Jacob Stern","height":"6' 4\" (1.93 m)","bio":"Daniel Stern was born in Bethesda, Maryland, to a social worker father and a day care manager mother. He has been acting professionally since the age of seventeen. Following his high school graduation, he auditioned for the Washington Shakespeare Festival seeking a job as a lighting engineer but ended up as \"a strolling player with a lute\" in their production of \"As You Like It.\" Shortly thereafter, he made his way to New York where he \"took a couple of acting lessons\" and began to assemble an impressive portfolio of such off-Broadway credits as \"Split,\" \"Frankie and Annie,\" \"The Mandrake,\" and \"The Old Glory.\" In addition, director Peter Yates cast him as one of the four Indiana teenagers in the highly acclaimed film Breaking Away (1979). Variety in acting roles appeals to Stern. Following \"Breaking Away,\" he appeared in Woody Allen's Stardust Memories (1980), Claudia Weill's It's My Turn (1980) and John Schlesinger's Honky Tonk Freeway (1981) before returning to New York to appear off-Broadway in the two character play \"How I Got That Story,\" which led to critical acclaim and a starring role in Barry Levinson's Diner (1982). Other film credits include I'm Dancing as Fast as I Can (1982), Blue Thunder (1983), Hannah and Her Sisters (1986), The Boss' Wife (1986), The Milagro Beanfield War (1988), Born in East L.A. (1987) and D.O.A. (1988) In addition to his voice-over work on the series, Stern directed several episodes of the popular and critically acclaimed television comedy, The Wonder Years (1988).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NTcwNDcxMF5BMl5BanBnXkFtZTcwMTI3Mjc4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0827663","name":"Daniel Stern","idIMDB":"nm0827663"},"actorId":"nm0827663","character":"John Whitman","urlCharacter":"http://www.imdb.com/character/ch0356088","main":true},{"actorName":"Richard Kuhlman","urlProfile":"http://www.imdb.com/name/nm0474056","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0ODM1NDY5MV5BMl5BanBnXkFtZTcwNTY5NDUyMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Richard Kuhlman is an actor and director, known for Parenthood (1989), The Last Time (2006) and Adventures in Wonderland (1992).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0ODM1NDY5MV5BMl5BanBnXkFtZTcwNTY5NDUyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0474056","name":"Richard Kuhlman","idIMDB":"nm0474056"},"actorId":"nm0474056","character":"Arthur Crosby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexis Cruz","urlProfile":"http://www.imdb.com/name/nm0004850","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNTQyNDc4OV5BMl5BanBnXkFtZTgwNDQ2OTc3OTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1974","placeOfBirth":" The Bronx, New York, USA","height":"5' 8\" (1.73 m)","bio":"Alexis Cruz was born on September 29, 1974 in The Bronx, New York, USA. He is an actor, known for Stargate - La porte des étoiles (1994), Drag Me to Hell (2009) and Why Do Fools Fall in Love (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNTQyNDc4OV5BMl5BanBnXkFtZTgwNDQ2OTc3OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004850","name":"Alexis Cruz","idIMDB":"nm0004850"},"actorId":"nm0004850","character":"Alvarez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Neal McDonough","urlProfile":"http://www.imdb.com/name/nm0568180","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzODQyODIyMl5BMl5BanBnXkFtZTcwMjE2OTEyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1966","placeOfBirth":" Dorchester, Massachusetts, USA","height":"6' (1.83 m)","bio":"Neal McDonough was born on February 13, 1966 in Dorchester, Massachusetts, to Catherine (Bushe) and Frank McDonough, motel owners who were born in Ireland. He grew up in Barnstable, Massachusetts, graduated from Barnstable High School, and attended Syracuse University. He was a member of the Sigma Chi Fraternity and graduated with a Bachelor's degree in Fine Arts in 1988. McDonough frequently appeared as Captain Laser, inspiring young students to bring their studies to completion. Fron there, he trained for a short time at the London Academy of Music and Dramatic Art. McDonough has made many television and film appearances since 1991, including First Contact (1996), Minority Report (2002), Timeline (2003), Walking Tall (2004), The Guardian (2006) and Flags of Our Fathers (2006). His most recent television appearances include Band of Brothers (2001), Boomtown (2002) Desperate Housewives (2004), Medical Investigation (2004), Tin Man (2007) and Justified (2010). Neal's most prized accomplishment is his wife Ruve, whom he married in 2003. They live in Los Angeles, California with their four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzODQyODIyMl5BMl5BanBnXkFtZTcwMjE2OTEyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0568180","name":"Neal McDonough","idIMDB":"nm0568180"},"actorId":"nm0568180","character":"Hurly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Ragsdale","urlProfile":"http://www.imdb.com/name/nm0706619","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjE3MTAzMV5BMl5BanBnXkFtZTcwNTM2MzI3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 January 1961","placeOfBirth":" El Dorado, Arkansas, USA","birthName":"Robert William Ragsdale","bio":"Dark, wavy-haired, boyishly earnest, Williams Ragsdale graduated from Hendrix College in Conway, Arkansas studying religion and humanities before deciding to buckle down and become an actor. The acting bug began to tempt the handsome young actor while appearing in a few college plays and musicals on the sly. His parents actually gave him a graduation present in the form of tuition for the Drama Studio London's American school at Berkeley, California. His first taste of success came on stage playing Eugene, Neil Simon's autobiographical protagonist, in both \"Biloxi Blues\" and \"Broadway Bound.\" Reminding one easily of a young Jack Lemmon, Ragsdale's appeal came in a cute, accessible package and he clinched this likable image after being cast in the hugely successful teen horror flick Fright Night (1985) as a typical high school student convinced that vampires are living next door. Other less notable entries, including the sequel Fright Night Part 2 (1988) and Mannequin: On the Move (1991), came his way as a result. Since then, TV has been his medium of choice, with the cult series favorite \"Herman's Head\" adding to his momentum, not to mention brief runs in such series as _American Pie_, Brother's Keeper (1998) and \"Grosse Point\" (2000). He recently married.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjE3MTAzMV5BMl5BanBnXkFtZTcwNTM2MzI3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0706619","name":"William Ragsdale","idIMDB":"nm0706619"},"actorId":"nm0706619","character":"Rogers","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike Hagerty","urlProfile":"http://www.imdb.com/name/nm0002235","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTBlZTY1N2QtNjU4MS00NTg2LWEyOGQtYmQ1MTg3MDU2MzkyL2ltYWdlXkEyXkFqcGdeQXVyNDkzNTkyMw@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 May 1954","placeOfBirth":" Chicago, Illinois, USA","birthName":"Michael Gerard Hagerty","bio":"Mike Hagerty was born on May 10, 1954 in Chicago, Illinois, USA as Michael Gerard Hagerty. He is an actor, known for Wayne's World (1992), Overboard (1987) and Speed 2: Cruise Control (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTBlZTY1N2QtNjU4MS00NTg2LWEyOGQtYmQ1MTg3MDU2MzkyL2ltYWdlXkEyXkFqcGdeQXVyNDkzNTkyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002235","name":"Mike Hagerty","idIMDB":"nm0002235"},"actorId":"nm0002235","character":"Breckenridge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maree Cheatham","urlProfile":"http://www.imdb.com/name/nm0154763","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzU3MTE4MDEyM15BMl5BanBnXkFtZTgwNDE1NDIxMzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 June 1942","placeOfBirth":" Oklahoma, USA","height":"5' 5\" (1.65 m)","bio":"Maree Cheatham was born on June 2, 1942 in Oklahoma, USA. She is an actress, known for Beetlejuice (1988), The Haves and the Have Nots (2013) and Hart of Dixie (2011). She has been married to Robert Staron since November 22, 1998. She was previously married to William Arvin.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzU3MTE4MDEyM15BMl5BanBnXkFtZTgwNDE1NDIxMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0154763","name":"Maree Cheatham","idIMDB":"nm0154763"},"actorId":"nm0154763","character":"Gladys","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Jensen","urlProfile":"http://www.imdb.com/name/nm0003861","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3OTkzMzQ5MV5BMl5BanBnXkFtZTgwNTEwOTMxMTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 September 1952","placeOfBirth":" Pinckneyville, Illinois, USA","height":"5' 10\" (1.78 m)","bio":"Character actor David Jensen born in DuQuoin, Illinois. Studied theater at LSU with John Dennis and worked the early film work of Steven Soderbergh culminating with Schizopolis a low budget comedy in the spirit of Richard Lester and Bunuel. Known for The Mist, Midnight Special, Benjamin Buttons, Love Song for Bobby Long.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3OTkzMzQ5MV5BMl5BanBnXkFtZTgwNTEwOTMxMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003861","name":"David Jensen","idIMDB":"nm0003861"},"actorId":"nm0003861","character":"J.D. Wachowitz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Lerner","urlProfile":"http://www.imdb.com/name/nm0503627","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMTA2ODU2M15BMl5BanBnXkFtZTcwOTQ2NDY1Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 June 1941","placeOfBirth":" Brooklyn, New York, USA","height":"5' 7\" (1.7 m)","bio":"Michael Lerner was born on June 22, 1941 in Brooklyn, New York, USA. He is an actor, known for Godzilla (1998), Barton Fink (1991) and X-Men: Days of Future Past (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMTA2ODU2M15BMl5BanBnXkFtZTcwOTQ2NDY1Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0503627","name":"Michael Lerner","idIMDB":"nm0503627"},"actorId":"nm0503627","character":"Leguzza","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Caroline McKinley","urlProfile":"http://www.imdb.com/name/nm1301031","urlPhoto":"","biography":{"bio":"Caroline McKinley is an actress, known for Deal (2008), Glory Road (2006) and Girl, Positive (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1301031","name":"Caroline McKinley","idIMDB":"nm1301031"},"actorId":"nm1301031","character":"Madeline","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sam Nazarian","urlProfile":"http://www.imdb.com/name/nm1343092","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MTIwNTg1MV5BMl5BanBnXkFtZTYwNjY1NDUz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Sam Nazarian, multi-hyphenate film producer, real estate financier, hotelier and restaurateur, is the CEO of Element Films. Element is a film financing and production company which anticipates producing up to a dozen films per year budgeted under 15 million dollars. The venture currently has five films in different stages of production. One of the unique attributes to the company is all the players are under 35. Element is under the umbrella of SBE Entertainment,in which Nazarian is the Chairman and CEO, also includes SBE HotelGroup, Samy Boy Supper Clubs and 3Wall Development,LLC.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MTIwNTg1MV5BMl5BanBnXkFtZTYwNjY1NDUz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1343092","name":"Sam Nazarian","idIMDB":"nm1343092"},"actorId":"nm1343092","character":"Man #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Douglas M. Griffin","urlProfile":"http://www.imdb.com/name/nm0341174","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5OTk4ODk2NV5BMl5BanBnXkFtZTgwNDEzNjYxMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1966","placeOfBirth":" New Orleans, Louisiana, USA","height":"5' 11\" (1.8 m)","bio":"Douglas M. Griffin was born on November 17, 1966 in New Orleans, Louisiana, USA. He is an actor, known for Deepwater (2016), Maggie (2015) and Mr. Right (2015). He is married to Annie Poirier.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5OTk4ODk2NV5BMl5BanBnXkFtZTgwNDEzNjYxMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0341174","name":"Douglas M. Griffin","idIMDB":"nm0341174"},"actorId":"nm0341174","character":"Man #2","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0469689","urlIMDB":"http://www.imdb.com/title/tt0469689","business":{"budget":{"money":"$4,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$7,000,000","country":"USA","day":"02","month":"06","year":"2007","remarks":""},{"money":"$13,000,000","country":"worldwide","day":"17","month":"07","year":"2007","remarks":""},{"money":"$1,400,000","country":"Mexico","day":"10","month":"10","year":"2007","remarks":""}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 36 min (96 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex Cameras and Lenses"],"laboratory":["Consolidated Film Industries (CFI), Hollywood (CA), USA","The Post Group, Los Angeles, USA (dailies)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"6.2","metascore":"38","filmingLocations":[{"location":"New Orleans, Louisiana, USA"}],"rated":"R","awards":[],"votes":"3,095","type":"Movie","companyCreditsSimple":[{"idCompany":"co0119429","name":"Element Films"},{"idCompany":"co0031478","name":"Train A Comin' Productions Inc."}],"keywords":{"keywords":["nudity","female nudity"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 19:39:00"}}