{"data":{"movies":[{"title":"Rings","originalTitle":"","year":"2017","releaseDate":"20170203","directors":[{"name":"F. Javier Gutiérrez","id":"nm1279573"}],"writers":[{"name":"David Loucka","id":"nm0521649"},{"name":"Jacob Estes","id":"nm1096524"}],"runtime":"102 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU1NDAxNTg0MF5BMl5BanBnXkFtZTgwNzUxMjEwMTI@._V1.jpg","countries":["USA","Canada"],"languages":["English"],"genres":["Drama","Horror"],"plot":"Julia becomes worried about her boyfriend, Holt, when he explores the dark urban legend of a mysterious video said to kill the watcher seven days after viewing. She sacrifices herself to save her boyfriend and in doing so makes a horrifying discovery: there is a \"movie within the movie\" that no one has ever seen before.","simplePlot":"A young woman finds herself on the receiving end of a terrifying curse that threatens to take her life in seven days.","actors":[{"actorName":"Matilda Anna Ingrid Lutz","urlProfile":"http://www.imdb.com/name/nm4436761","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5ODU5MTI0MF5BMl5BanBnXkFtZTcwNzM4NjQ2OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Matilda Anna Ingrid Lutz was born in Milan, Italy. She is an actress, known for Rings (2017), Summertime (2016) and L'Universale (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5ODU5MTI0MF5BMl5BanBnXkFtZTcwNzM4NjQ2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4436761","name":"Matilda Anna Ingrid Lutz","idIMDB":"nm4436761"},"actorId":"nm4436761","character":"Julia","urlCharacter":"http://www.imdb.com/character/ch0522162","main":true},{"actorName":"Alex Roe","urlProfile":"http://www.imdb.com/name/nm1025139","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NDI2NDIwMV5BMl5BanBnXkFtZTgwMDYwMjk4ODE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"June1990","placeOfBirth":" Westminster, London, England, UK","birthName":"Alexander Michael Roe-Brown","height":"6' (1.83 m)","bio":"Alex Roe was born in June 1990 in Westminster, London, England as Alexander Michael Roe-Brown. He is an actor, known for The 5th Wave (2016) and Hot Summer Nights (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NDI2NDIwMV5BMl5BanBnXkFtZTgwMDYwMjk4ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1025139","name":"Alex Roe","idIMDB":"nm1025139"},"actorId":"nm1025139","character":"Holt","urlCharacter":"http://www.imdb.com/character/ch0522161","main":true},{"actorName":"Johnny Galecki","urlProfile":"http://www.imdb.com/name/nm0301959","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQ2ODY0MTIwMV5BMl5BanBnXkFtZTcwNDQ2NzMzMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 April 1975","placeOfBirth":" Bree, Flanders, Belgium","birthName":"John Mark Galecki","height":"5' 5\" (1.65 m)","bio":"John Mark Galecki was born in Bree, Belgium, to American parents; his father was stationed there while serving in the U.S. Air Force. When he was three years old, his family moved to Chicago, Illinois, where he grew up with his parents, Mary Lou and Richard Galecki, and siblings, sister Allison (1980) and brother Nick (1982). His father was of Polish descent, and his mother's ancestry is Irish and Italian. His mother was a mortgage consultant and his father became a teacher for blind veterans in a VA hospital outside of Chicago. When Galecki was sixteen, his father died in an accident. His mother recalled in an interview with People magazine that Galecki was a very artistic kid; at only 4 years old, he told her: \"Mom, I'm gonna be on T.V., and I don't mean when I grow up.\" Two years later, when their attempts to distract him with sports failed, Galecki's parents took him to open auditions at local theaters in Chicago. He landed his first role in \"Fiddler on the Roof,\" and more parts in other productions followed. By age 11, he was already known as an excellent actor in Chicago's theater scene evidenced by him receiving a Joseph Jefferson Citation nomination for portraying John Henry in \"The Member of the Wedding.\" In 1989 he was cast in his first movie, a holiday film called Prancer (1989), but his big break was in another Christmas movie as Chevy Chase's son Rusty Griswold, in National Lampoon's Christmas Vacation (1989). On the set, Chase took a liking to him, and Galecki recalled in a later interview that Chevy Chase showed him some tricks for comedic timing. By that time, his whole family had moved from Chicago to L.A. to support his career. But within 10 months they realized they missed Chicago too much, and moved back home. Galecki, still just 14, was under contract on a show with Robert Urich called \"American Dreamer (1990)\", so he stayed in L.A. Although he was living alone in a studio apartment, he never got into trouble and was a good kid. He recalled living alone in L.A. without adult supervision as \"not fun\" and \"quite intimidating and lonely, to be honest. But I've always been happiest when I'm working, so...\" He bought a motorcycle with a mirrored helmet so he could get to work and back, at Paramount studios. In 1991 Galecki was picked by Roseanne Barr to play her son in the made for T.V. movie Backfield in Motion (1991). She liked him so much she asked him to come on her sitcom for what started as a one-off appearance, but soon turned into the important recurring role of David Healy. His family was religious viewers of the show and he was somewhat intimidated at first to be working with his television heroes. However, before long, it was his heroes that praised him: Roseanne said he showed \"great vulnerability.\" John Goodman said: \"If he was one of those little stuffed bears at a carny, he'd have a Wuv me t-shirt on. People just want to take care of him.\" Galecki also became very close friends with co-star Sara Gilbert and the show's executive producer Eric Gilliland. After Roseanne (1988) he worked on a number of diverse roles, from funny Ira alongside Christopher Walken in the 1997 dark-comedy Suicide Kings (1997) to a drug-addicted student in 2003's Bookies (2003), and he played gay characters in Don Roos's Bounce (2000) and The Opposite of Sex (1998). He never stayed far from the television industry as he made guest appearances such as Laurie Freeman's younger lover in Norm (1999) (where he once again worked with Laurie Metcalf, his former Roseanne cast mate), as a golfer in My Name Is Earl (2005), as Hope & Faith (2003)'s younger brother in the sitcom of the same name, and as hilarious party-boy Trouty on My Boys (2006). In 2006 he returned to his theater roots as he took on the role of conflicted but sweet male escort Alex in Douglas Carter Beane's play \"The Little Dog Laughed,\" for which he received a 2007 Theatre World Award for Outstanding Browdway Debut. In 2007 he was back on the small screens, starring as Leonard Hofstadter in the sitcom The Big Bang Theory (2007). Not only was Chuck Lorre, a former producer for Roseanne, a producer of the new show, but Sara Gilbert and Laurie Metcalf both made guest appearances. Galecki is a self-admitted motorcycle \"nerd,\" and drives a Harley Davidson Softail Deluxe. Although he never went to college, he has said: \"I'm not dead! We should never stop learning. We should never stop absorbing,\" and so he learned how to play the cello in his early twenties. He likes traveling around the world, painting, music (he also plays bass), and hiking with his dog Vera. He always has been very private about his personal life and little is known about past relationships. It has only been confirmed that he dated actresses Laura Harris and Kaley Cuoco. He isn't on twitter, and Galecki once said, \"I don't understand the current frame of mind in our society that seems to say that any action is not of value until it's broadcast somehow.\" He still lives in Los Angeles but is often spotted in Chicago, where his siblings still live.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQ2ODY0MTIwMV5BMl5BanBnXkFtZTcwNDQ2NzMzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0301959","name":"Johnny Galecki","idIMDB":"nm0301959"},"actorId":"nm0301959","character":"Gabriel","urlCharacter":"http://www.imdb.com/character/ch0522158","main":true},{"actorName":"Vincent D'Onofrio","urlProfile":"http://www.imdb.com/name/nm0000352","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTE2MDkzNF5BMl5BanBnXkFtZTYwODUzMjcz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 June 1959","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Vincent Phillip D'Onofrio","height":"6' 3½\" (1.92 m)","bio":"Vincent Phillip D'Onofrio was born on June 30, 1959 in Brooklyn, New York, to Phyllis, a restaurant manager and server, and Gene D'Onofrio, a theater production assistant and interior designer. He is of Italian descent and has two older sisters. He studied at the Actors Studio and the American Stanislavski Theatre. Vincent D'Onofrio is known as an \"actor's actor\". The wide variety of roles he has played and the quality of his work have earned him a reputation as a versatile talent. His first paid role was in Off-Broadway's \"This Property Is Condemned\". He continued appearing in plays and worked as a bouncer, a bodyguard and a delivery man. In 1984, he made his Broadway debut in \"Open Admissions\", followed by work in numerous other stage plays. In 2012, D'Onofrio returned to teach at the Lee Strasberg Theater & Film Institute. As a film actor, D'Onofrio's career break came when he played a mentally unbalanced recruit in Full Metal Jacket (1987), directed by the renowned Stanley Kubrick. For this role D'Onofrio gained nearly 70 pounds. He had a major role in Dying Young (1991), and appeared prominently in the box-office smash Men in Black (1997) as the bad guy (Edgar \"The Bug\"). Other films of note in which he has appeared are Mystic Pizza (1988), JFK (1991), The Player (1992), Ed Wood (1994), The Cell (2000), The Break-Up (2006) and Jurassic World (2015). In 1996, D'Onofrio garnered critical acclaim along with co-star Renée Zellweger for The Whole Wide World (1996), which he helped produce. He also made a guest appearance in Homicide: Life on the Street: The Subway (1997), where he played an accident victim who could not be rescued and was destined to die. For this performance he won an Emmy nomination. In 2000, he both produced and starred in Steal This Movie (2000), a biopic of radical leader Abbie Hoffman. In 2001, D'Onofrio took the role which has likely given him his greatest public recognition: Det. Robert Goren, the lead character in the TV series Law & Order: Criminal Intent (2001). Goren is based on Sherlock Holmes but, instead of relying upon physical evidence like Holmes, D'Onofrio's character focuses on psychology to identify the perpetrators, whom he often draws into confessing or yielding condemning evidence. He played the part for 10 years. In his career D'Onofrio's various film characters have included a priest, a bisexual former porn star, a hijacker, a serial killer, Orson Welles, a space alien, a 1960s radical leader, a pulp fiction writer, an ingenious police investigator and Stuart Smalley's dope-head brother. His on-screen love interests have included Julia Roberts, Cameron Diaz, Renée Zellweger, Marisa Tomei, Tracey Ullman, Rebecca De Mornay and Lili Taylor. One of his latest roles is in Marvel's Daredevil (2015) as Daredevil's nemesis, Wilson Fisk. He lives in Manhattan with his wife and children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTE2MDkzNF5BMl5BanBnXkFtZTYwODUzMjcz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000352","name":"Vincent D'Onofrio","nicknames":["The Human Chameleon","Noffy"],"idIMDB":"nm0000352"},"actorId":"nm0000352","character":"Burke","urlCharacter":"http://www.imdb.com/character/ch0559211","main":true},{"actorName":"Aimee Teegarden","urlProfile":"http://www.imdb.com/name/nm1631435","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NjYzMDExMl5BMl5BanBnXkFtZTcwOTI1NjYxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1989","placeOfBirth":" Downey, California, USA","birthName":"Aimee Richelle Teegarden","height":"5' 7\" (1.7 m)","bio":"Aimee Richelle Teegarden, born October 10, 1989, is an American actress, model and producer. She starred as Julie Taylor in the NBC drama Friday Night Lights (2006) from 2006 to 2011. In 2011, she co-starred with Dennis Quaid in Martin Guigui's thriller Beneath the Darkness (2011). Later she plays Jenny Randall in the horror film Scream 4 (2011) and as Nova Prescott in the Disney film Prom (2011). In 2014, she starred as Emery Whitehill in The CW's short-lived science fiction romantic drama Star-Crossed (2014), and in 2017, she had a role in the horror sequel Rings (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NjYzMDExMl5BMl5BanBnXkFtZTcwOTI1NjYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1631435","name":"Aimee Teegarden","idIMDB":"nm1631435"},"actorId":"nm1631435","character":"Skye","urlCharacter":"http://www.imdb.com/character/ch0522159","main":true},{"actorName":"Bonnie Morgan","urlProfile":"http://www.imdb.com/name/nm0604507","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MzAyMjMzN15BMl5BanBnXkFtZTgwMTEwMzI0MjE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"bio":"Bonnie Morgan is a talented actress, a daring stunt woman and an extraordinary contortionist with an uncanny ability to bend herself to fit any role. The mad-capped redhead is an eccentric comedienne, yet she is most often cast to play dramatic, horrific monsters! In \"The Ring Two,\" she shocked horror fans with her terrifying and now infamous \"spider crawl\" performance as 'Samara,' chasing Naomi Watt's character out of the well. Bonnie has now taken over the iconic role of 'Samara' in the upcoming \"Rings 3,\" where she returns with a familiar video tape to strike terror once again. \"Rings 3,\" the latest in the $400 million horror franchise, will be released by Paramount on April 1st, 2016. In addition, Bonnie can be seen as 'Tree Witch' in Lionsgate's supernatural action film \"The Last Witch Hunter,\" starring Vin Diesel. In the 2012 hit Paramount thriller \"The Devil Inside,\" Bonnie terrified audiences as the demonically possessed 'Rosa,' showcasing both her acting and contortionist abilities in a role that was both physically and emotionally demanding. Bonnie grew up in a castle on a crest of the Hollywood Hills, raised by third-generation circus performers who also have a fantastic horror lineage. Bonnie's father Gary Morgan is an incredible stuntman/actor who played 'Billy' in the sci-fi classic \"Logan's Run\" and doubled the dog in \"Cujo,\" and her aunt Robbi Morgan played 'Annie,' Jason's first victim in \"Friday the 13th.\" Before she could walk, Bonnie's dad started teaching her acrobatics, and, as she grew, she showed a remarkable aptitude for trapeze, silks, stilts and tight rope. Expanding on her repertoire, she soon discovered her astounding powers as a contortionist at the tender age of nine. She began her acting career as a child, doing commercials and guest-starring on such family-favorite series as \"Blossom,\" \"The Nanny\" and \"Dr. Quinn Medicine Woman.\" She went on to follow in her father's footsteps, augmenting her acting career with stunts and creature characters in such films as \"Hellboy II: The Golden Army,\" where she marauded through the troll market; and \"Men in Black II,\" where a head-like appliance was placed on her behind - hence the moniker 'Jabba the Butt.' Bonnie's acting and contorting talents have also merged in such features as \"The Incredible Burt Wonderstone,\" marking her third film with Jim Carrey; \"National Lampoon's Transylmania\"; Steven Spielberg's \"Minority Report\" with Tom Cruise; and \"Piranha 3D\" where she was hilariously eaten alive through an inner tube. More recently, she appeared opposite Robert Englund in \"Fear Clinic,\" playing 'Paige,' a patient who perishes during the opening credits, yet haunts Englund's character throughout the story, eventually merging as Evil itself! Fearless and uniquely agile, Bonnie has also contributed her skills to daring stunts in such films as \"How The Grinch Stole Christmas,\" \"Fright Night\" and \"Peter Pan,\" also showcasing her acting talents in each film with roles as a Who, a vampire and a fairy, respectively. For the small screen, she partied on Showtime's \"Shameless,\" was broken and bent as the Terminator Rosie on \"Terminator: The Sarah Connor Chronicles,\" and was beaten to a pulp by Michelle Rodriguez in the short \"Sorority Pillow Fight.\" In \"Criminal Minds,\" she had a recurring role as a broken, tortured human marionette doll. She has also appeared on \"CSI: Crime Scene Investigation,\" \"Castle\" and \"It's Always Sunny in Philadelphia.\" Most recently, she contorted for Patrick Stewart in his Starz original series \"Blunt Talk.\" Bonnie's diverse appearances have ranged from Shakespearean troupes to Los Angeles-based circuses, in addition to opening for the legendary Paul McCartney in his Driving USA Tour. She was the opening act this past year for the Mistress of Darkness' \"Elvira's Big Top\" show at Knott's Scary Farm. She has performed in numerous Shakespeare productions, including the role of 'Gertrude' in \"Hamlet.\" Her favorite Shakespearean character is the clever, mischievous sprite 'Puck' in \"A Midsummer Night's Dream,\" which she has played in seven productions. She is also a regular performer at the historic and uber-exclusive Brookledge Theater in Hollywood, owned by the Magic Castle's Larsen Family. Bonnie and her family also perform annually at the Original Renaissance Pleasure Faire, and Bonnie has recently starred in and directed a Commedia del Arte with her family at the Faire, among other venues. Another feather in her cap is a Guinness World Record for her remarkable contortionist abilities! The Morgan Family is known for throwing legendary, by-invitation-only parties in their eccentric home, known as Morgan Castle, which sits high above Los Angeles on a peak in Laurel Canyon. Recent themes have been \"Back to the Future Prom,\" \"Jungle Boogie\" and \"Beatlemania,\" as well as the most epic New Year's Eve party to ring in 2015! Bonnie is also consistently in demand for commercials, becoming such famous characters as FLO-BOT in the Progressive Insurance commercials, the Kia Sock Monkey, the Comcast Robot, The Silk Soy Milk Cow, the Awkward Robot Butler for WINK, and a menacing creature in the #7000 Chemicals campaign.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MzAyMjMzN15BMl5BanBnXkFtZTgwMTEwMzI0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0604507","name":"Bonnie Morgan","idIMDB":"nm0604507"},"actorId":"nm0604507","character":"Samara","urlCharacter":"http://www.imdb.com/character/ch0003598","main":true},{"actorName":"Chuck David Willis","urlProfile":"http://www.imdb.com/name/nm3221619","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWQ5ZWI2YzQtNDFmMC00NDM4LThiOTgtMDFmNjE3YTA3MDA3L2ltYWdlXkEyXkFqcGdeQXVyMjA3NTU4NTM@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Chuck David Willis is an actor, known for Ant-Man (2015), Shakespeare ABC's It's Easy as 123 (2010) and Pure Country 2: The Gift (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWQ5ZWI2YzQtNDFmMC00NDM4LThiOTgtMDFmNjE3YTA3MDA3L2ltYWdlXkEyXkFqcGdeQXVyMjA3NTU4NTM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3221619","name":"Chuck David Willis","idIMDB":"nm3221619"},"actorId":"nm3221619","character":"Blue","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patrick R. Walker","urlProfile":"http://www.imdb.com/name/nm5604932","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWFjYjNiYzEtYzUzMi00NDgxLTllMWUtYzQxYjFiNTM3OGU4L2ltYWdlXkEyXkFqcGdeQXVyNDcwMzg4OTk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Patrick Walker","height":"5' 11\" (1.8 m)","bio":"Patrick R. Walker was born to Nicole Micheau and Patrick Walker Sr. on December 2, 1992, in Jacksonville, Florida. Although he was brought up in one of the roughest neighborhoods in Jacksonville, his negative surroundings motivated him in a positive way. At a very young age, Patrick made a commitment to himself that he would never get involved in a life of crime, drugs, or alcohol. He has stayed true to this commitment and remained focused on his dreams of becoming a positive role model, actor, writer, and producer. During high school, Patrick was voted senior class president, as well as a being the team captain, and standout of the track team. With his persistence and drive to succeed, Walker moved to Atlanta in August of 2011 to pursue his dream of becoming a famous Actor. He is consistently busy acting in major network television shows, as well as, writing, producing, and directing films. He was awarded three Best Actor awards in 2014. Walker also placed 3rd in the country at the College traveling film festival Campus Moviefest in 2014-15, for his short film, \"Caretaker.\" In addition, Walker's award winning short film, \"Caretaker\", has aired on Virgin Airlines in the months of November and December 2014. Walker is racking up an impressive resume in numerous television shows, independent films, and theatrical plays. His bright smile, attractive personality, and his love of the art is what drive him. There is no doubt that we will be seeing him do big things in the near future. His most recent accomplishment is being selected as one of the winners of the 2015 'Team Oscar' Competition. As part of this great honor, the six winners will deliver Oscar statuettes to celebrity presenters at the 87th Academy Awards® on Oscar Sunday, February 22, 2015, live on ABC. Patrick was raised in Jacksonville, FL by his mother, Nicole Micheau. He is also an older brother and positive role model to his four younger siblings: Jarett, Kalei, Jacobi, and Jarell.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWFjYjNiYzEtYzUzMi00NDgxLTllMWUtYzQxYjFiNTM3OGU4L2ltYWdlXkEyXkFqcGdeQXVyNDcwMzg4OTk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5604932","name":"Patrick R. Walker","idIMDB":"nm5604932"},"actorId":"nm5604932","character":"Jamal","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zach Roerig","urlProfile":"http://www.imdb.com/name/nm1813534","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMjc1MDc2OF5BMl5BanBnXkFtZTcwMDI3NTUwNA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1985","placeOfBirth":" Montpelier, Ohio, USA","birthName":"Zachary George Roerig","height":"5' 11\" (1.8 m)","bio":"Zachary George Roerig plays Matt Donovan on The Vampire Diaries, and is also known for his roles on TV series As The World Turns and One Life To Live. Roerig was born in Montpelier, Ohio to Daniel and Andrea Roerig in 1985. He attended Montpelier High school where he played both football and was also a wrestler. While he was growing up, Zach worked for his dad and grandpa at Fackler Mounuments, a place where they make gravestones. Zach also has a younger sister named Emily who was born in 1989. While Zach is technically bi-coastal, he will always consider New York his home. Roerig has a daughter with Alanna Turner.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMjc1MDc2OF5BMl5BanBnXkFtZTcwMDI3NTUwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1813534","name":"Zach Roerig","idIMDB":"nm1813534"},"actorId":"nm1813534","character":"Carter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Laura Wiggins","urlProfile":"http://www.imdb.com/name/nm2270016","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MjI5MzY1OF5BMl5BanBnXkFtZTgwNzE2MTIwNTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 August 1988","placeOfBirth":" Athens, Georgia, USA","birthName":"Laura Slade Wiggins","height":"5' 2\" (1.57 m)","bio":"Laura Wiggins was born on August 8, 1988 in Athens, Georgia, USA as Laura Slade Wiggins. She is an actress, known for Rings (2017), Shameless (2011) and Starving in Suburbia (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MjI5MzY1OF5BMl5BanBnXkFtZTgwNzE2MTIwNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2270016","name":"Laura Wiggins","nicknames":["Slade"],"idIMDB":"nm2270016"},"actorId":"nm2270016","character":"Faith","urlCharacter":"http://www.imdb.com/character/ch0522160","main":true},{"actorName":"Lizzie Brocheré","urlProfile":"http://www.imdb.com/name/nm1227053","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MjQ0NjM4OV5BMl5BanBnXkFtZTcwMzI3MTY2Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1985","placeOfBirth":" Paris, France","bio":"Lizzie Brocheré was born on March 22, 1985 in Paris, France. She is an actress, known for The Wedding Song (2008), Chacun sa nuit (2006) and Full Contact (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MjQ0NjM4OV5BMl5BanBnXkFtZTcwMzI3MTY2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1227053","name":"Lizzie Brocheré","idIMDB":"nm1227053"},"actorId":"nm1227053","character":"Kelly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karen Ceesay","urlProfile":"http://www.imdb.com/name/nm1957798","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNTQ4MDE4N15BMl5BanBnXkFtZTcwNDMyODk1OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Karen Renee Mauldin","bio":"Karen Ceesay was born as Karen Renee Mauldin. She is an actress, known for Last Vegas (2013), The Internship (2013) and Rings (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNTQ4MDE4N15BMl5BanBnXkFtZTcwNDMyODk1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1957798","name":"Karen Ceesay","idIMDB":"nm1957798"},"actorId":"nm1957798","character":"Flight Attendant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dave Blamy","urlProfile":"http://www.imdb.com/name/nm2817581","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MjY0NDAzM15BMl5BanBnXkFtZTgwMjU3NjQ3NzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Dave Blamy is an actor and director, known for The Taking of Deborah Logan (2014), War Room (2015) and Rings (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MjY0NDAzM15BMl5BanBnXkFtZTgwMjU3NjQ3NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2817581","name":"Dave Blamy","idIMDB":"nm2817581"},"actorId":"nm2817581","character":"First Officer","urlCharacter":"http://www.imdb.com/character/ch0522166","main":true},{"actorName":"Michael E. Sanders","urlProfile":"http://www.imdb.com/name/nm0761661","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwMjk0ODE1M15BMl5BanBnXkFtZTgwNzAyMDg5NzE@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 July 1969","placeOfBirth":" Kennesaw, Georgia, USA","birthName":"Michael Edwin Neil Sanders","height":"6' 1\" (1.85 m)","bio":"Born Michael Edwin Neil Sanders on July 20, 1969 in Smyrna, Georgia he is named after Michael Collins. Edwin \"Buzz\" Aldrin and Neil Armstrong, the first three astronauts to land on the moon. Michael, as his mother prefers him to be called, had a passion for three things as a young child: pro wrestling, stand-up comedy, and auctioneering. After serving four years in the United States Army, in 1998, Mike was headed to The Punchline Comedy Club in Atlanta, GA to pursue a career in stand up comedy. A year later, Mike made his debut on World Championship Wrestling (WCW) where he was affectionately known as \"Above Average\" Mike Sanders. He went on to become a one time cruiser-weight champion, WCW commissioner and leader of The Natural Born Thrillers. After his pro wrestling days, he pursued his love of being a stand-up comedian headlining comedy clubs throughout the US. Michael's passion to entertain did not stop there. He was given the opportunity to audition for Army Wives taking his first step into the acting arena. Not only did he impress casting to the point of offering him a role bigger than the one he auditioned for he captured the eye of several casting directors which lead to roles on Single Ladies and Drop Dead Diva with a guest star appearances on Necessary Roughness. His fast talking skills and experience gave Michael all he needed to go back to his roots and passion and step right into his role of the Auctioneer in Devil's Knot. In his spare time, he enjoys spending time with his children, Kenneth and Alexis, traveling and working out and yes he still enjoys southern auctioneering as his hobby.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwMjk0ODE1M15BMl5BanBnXkFtZTgwNzAyMDg5NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0761661","name":"Michael E. Sanders","nicknames":["Above Average"],"idIMDB":"nm0761661"},"actorId":"nm0761661","character":"Pilot","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Randall Taylor","urlProfile":"http://www.imdb.com/name/nm0853024","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MzYxMzEyNV5BMl5BanBnXkFtZTgwNjM3NjE3ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Randall Taylor is an actor living in Los Angeles known for the Television shows Homeland, House of Cards, The Vampire Diaries, The Red Road, Halt and Catch Fire, Drop Dead Diva, In the Heat of the Night and the Films The Founder, The Accountant, LBJ, Rings, Kill the Messenger, Anchorman II, A Sunday Horse, Robocop III and Rings. He holds a Masters Degree in Speech/Theater from Southern Illinois University and has worked in New York and Atlanta, as well as Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MzYxMzEyNV5BMl5BanBnXkFtZTgwNjM3NjE3ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0853024","name":"Randall Taylor","nicknames":["Randy"],"idIMDB":"nm0853024"},"actorId":"nm0853024","character":"Holt's Father","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0498381","urlIMDB":"http://www.imdb.com/title/tt0498381","business":{"budget":{"money":"$25,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$13,002,632","country":"USA","day":"05","month":"02","year":"2017","remarks":"2,931 Screens"},{"money":"€772,015","country":"Italy","day":"19","month":"03","year":"2017","remarks":"262 Screens"}],"gross":[{"money":"$27,780,085","country":"USA","day":"21","month":"03","year":"2017","remarks":""},{"money":"$27,773,168","country":"USA","day":"20","month":"03","year":"2017","remarks":""},{"money":"$27,766,716","country":"USA","day":"19","month":"03","year":"2017","remarks":""},{"money":"$27,722,325","country":"USA","day":"17","month":"03","year":"2017","remarks":""},{"money":"$27,704,688","country":"USA","day":"16","month":"03","year":"2017","remarks":""},{"money":"$27,701,223","country":"USA","day":"15","month":"03","year":"2017","remarks":""},{"money":"$27,696,187","country":"USA","day":"14","month":"03","year":"2017","remarks":""},{"money":"$27,690,560","country":"USA","day":"13","month":"03","year":"2017","remarks":""},{"money":"$81,876,348","country":"Worldwide","day":"23","month":"03","year":"2017","remarks":""},{"money":"$79,379,048","country":"Worldwide","day":"08","month":"03","year":"2017","remarks":""},{"money":"$81,772,406","country":"worldwide","day":"21","month":"03","year":"2017","remarks":""},{"money":"$81,856,498","country":"worldwide","day":"20","month":"03","year":"2017","remarks":""},{"money":"$81,766,716","country":"worldwide","day":"19","month":"03","year":"2017","remarks":""},{"money":"$80,527,330","country":"worldwide","day":"17","month":"03","year":"2017","remarks":""},{"money":"$80,509,693","country":"worldwide","day":"16","month":"03","year":"2017","remarks":""},{"money":"$80,506,228","country":"worldwide","day":"15","month":"03","year":"2017","remarks":""},{"money":"$80,501,192","country":"worldwide","day":"14","month":"03","year":"2017","remarks":""},{"money":"$79,432,621","country":"worldwide","day":"13","month":"03","year":"2017","remarks":""},{"money":"$53,992,321","country":"Non-USA","day":"23","month":"03","year":"2017","remarks":""},{"money":"$54,083,330","country":"Non-USA","day":"19","month":"03","year":"2017","remarks":""},{"money":"$52,805,005","country":"Non-USA","day":"12","month":"03","year":"2017","remarks":""},{"money":"€1,661,602","country":"Italy","day":"02","month":"04","year":"2017","remarks":""},{"money":"€1,446,848","country":"Italy","day":"26","month":"03","year":"2017","remarks":""}],"weekendGross":[{"money":"$62,028","country":"USA","day":"19","month":"03","year":"2017","remarks":"116 Screens"},{"money":"€107,345","country":"Italy","day":"02","month":"04","year":"2017","remarks":"114 Screens"},{"money":"€431,547","country":"Italy","day":"26","month":"03","year":"2017","remarks":"284 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"23","month":"03","year":"2015","remarks":null},{"money":null,"country":null,"day":"31","month":"05","year":"2015","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 42 min (102 min)"],"soundMix":["Dolby Atmos"],"color":["Color"],"aspectRatio":null,"camera":["Arri Alexa"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":["DCP"]},"rating":"4.5","metascore":"25","filmingLocations":[{"location":"East Mountain Studios, 2030 East Park Drive, Conyers, Georgia, USA"}],"rated":"PG-13","awards":[],"votes":"9,311","type":"Movie","companyCreditsSimple":[{"idCompany":"co0094798","name":"Macari/Edelstein"},{"idCompany":"co0108321","name":"Parkes+MacDonald Image Nation"},{"idCompany":"co0084207","name":"Vertigo Entertainment"}],"keywords":{"keywords":["sequel","seven days","curse","altered version of studio logo","hallucination","supernatural horror","investigation","death","deformed face","maggot","falling down a well","nosebleed","crawling out of a tv set","electrocution","death scene","vhs","video tape","sex scene","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 05:44:04"}}