{"data":{"movies":[{"title":"Sunshine","originalTitle":"","year":"2007","releaseDate":"20070727","directors":[{"name":"Danny Boyle","id":"nm0000965"}],"writers":[{"name":"Alex Garland","id":"nm0307497"}],"runtime":"107 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5Nzg2OTk2NF5BMl5BanBnXkFtZTYwNTc1ODM3._V1.jpg","countries":["UK","USA"],"languages":["English"],"genres":["Adventure","Sci-Fi","Thriller"],"plot":"50 years into the future, the Sun begins to die, and Earth is dying as a result. A team of astronauts is sent to revive the Sun - but the mission fails. Seven years later, a new team is sent to finish the mission as mankind's last hope.","simplePlot":"A team of international astronauts are sent on a dangerous mission to reignite the dying Sun with a nuclear fission bomb in 2057.","actors":[{"actorName":"Cillian Murphy","urlProfile":"http://www.imdb.com/name/nm0614165","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMjg1NzIyOV5BMl5BanBnXkFtZTYwMzg2Mjgy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1976","placeOfBirth":" Douglas, Cork, Ireland","height":"5' 9\" (1.75 m)","bio":"Striking Irish actor Cillian Murphy was born in Douglas, the oldest child of Brendan Murphy, who works for the Irish Department of Education, and a mother who is a teacher of French. He has three younger siblings. Murphy was educated at Presentation Brothers College, Cork. He went on to study law at University College Cork, but dropped out after about a year. During this time Murphy also pursued an interest in music, playing guitar in various bands. Upon leaving University, Murphy joined the Corcadorca Theater Company in Cork, and played the lead role in \"Disco Pigs\", amongst other plays. Various film roles followed, including a film adaptation of Disco Pigs (2001). However, his big film break came when he was cast in Danny Boyle's 28 Days Later... (2002), which became a surprise international hit. This performance earned him nominations for Best Newcomer at the Empire Awards and Breakthrough Male Performance at the MTV Movie Awards. Murphy went on to supporting roles in high-profile films such as Cold Mountain (2003) and Girl with a Pearl Earring (2003), and then was cast in two villain roles: Dr. Jonathan Crane, aka The Scarecrow, in Batman Begins (2005) and Jackson Rippner in Red Eye (2005). Although slight in nature for a villain, Murphy's piercing blue eyes helped to create creepy performances and critics began to take notice. Manhola Dargis of the New York Times cited Murphy as a \"picture-perfect villain\", while David Denby of The New Yorker noted he was both \"seductive\" and \"sinister\". Later that year, Murphy starred as Patrick \"Kitten\" Braden, an Irish transgender in search of her mother, in Neil Jordan's Breakfast on Pluto (2005), a film adaptation of the Pat McCabe novel. Although the film was not a box office success, Murphy was nominated for a Golden Globes for Best Actor in a Comedy or Musical and he won Best Actor for the Irish Film and Television Academy Awards. The following year, Murphy starred in Ken Loach's Le vent se lève (2006). The film was the most successful independent Irish film and won the Palm D'Or at the 2006 Cannes Film Festival. Murphy continued to take roles in a number of independent films, and also reprised his role as the Scarecrow in Christopher Nolan's The Dark Knight (2008). Nolan is known for working with actors in multiple films, and cast Murphy in Inception (2010), as Robert Fischer, the young heir of the multi-billion dollar empire, who was the target of DiCaprio's dream team. Murphy continues to appear in high profile films such as In Time (2011), Red Lights (2012), and The Dark Knight Rises (2012), the final film in Nolan's Batman trilogy. Murphy is married to Yvonne McGuinness, an artist. The couple has two sons, Malachy and Aran.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMjg1NzIyOV5BMl5BanBnXkFtZTYwMzg2Mjgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0614165","name":"Cillian Murphy","nicknames":["Cilly"],"idIMDB":"nm0614165"},"actorId":"nm0614165","character":"Robert Capa","urlCharacter":"http://www.imdb.com/character/ch0010631","main":true},{"actorName":"Michelle Yeoh","urlProfile":"http://www.imdb.com/name/nm0000706","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NTI0NDkzOF5BMl5BanBnXkFtZTcwMjYwMTIwNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1962","placeOfBirth":" Ipoh, Perak, Malaysia","birthName":"Yeoh Chu-Kheng","height":"5' 4\" (1.63 m)","bio":"Born as Yang Zi Qiong in the mining town of Ipoh, in West Malaysia, in the lunar year of the Tiger, Michelle is the daughter of Janet Yeoh and Yeoh Kian Teik, a lawyer and politician. She is of Han Chinese (Hokkien) descent, and spoke English and Malay before Chinese. A ballet dancer since age 4, she moved to London, England to study at the Royal Academy as a teenager. After a brief dance career, she won the Miss Malaysia beauty pageant title in her native country and the Miss Moomba beauty pageant title in Melbourne, Australia in the early 1980s. Her first on camera work was a 1984 commercial with martial arts star Jackie Chan. In 1985, she began making action movies with D&B Films of Hong Kong. She was first billed as Michelle Khan, then later, Michelle Yeoh. Never a trained martial artist, she relied on her dance discipline and her on-set trainers to prepare for her martial arts action scenes. She uses many dance moves in her films. She still does most of her own stunts and has been injured many times. Ironically, she still cannot read Chinese and she has to have Chinese script read to her. In 1988, she married wealthy D&B Films executive Dickson Poon and retired from acting. Even though they divorced in 1992, she is close to Poon's second wife and a godmother to Poon's daughter. When she returned to acting, she became very popular to Chinese audiences and she became known to western audiences through her co-starring roles in the James Bond film Tomorrow Never Dies (1997) and in the phenomenally successful Crouching Tiger, Hidden Dragon (2000) aka Crouching Tiger, Hidden Dragon' directed by Ang Lee. She turned down a role in a sequel to The Matrix (1999). She has her own production company, Mythical Films and has trained with the Shen Yang Acrobatic team for her role in Le talisman (2002), an English language film she is both starring in and producing. She hopes to use her company to discover and nurture new film-making talent. She also wants to act in roles that combine both action and deeper spiritual themes.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NTI0NDkzOF5BMl5BanBnXkFtZTcwMjYwMTIwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000706","name":"Michelle Yeoh","idIMDB":"nm0000706"},"actorId":"nm0000706","character":"Corazon","urlCharacter":"http://www.imdb.com/character/ch0010634","main":true},{"actorName":"Troy Garity","urlProfile":"http://www.imdb.com/name/nm0004949","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYxNzEwNjYwN15BMl5BanBnXkFtZTgwMjM2MjE5ODE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 July 1973","placeOfBirth":" Los Angeles, California, USA","birthName":"Troy O'Donovan Garity","height":"6' 2\" (1.88 m)","bio":"Troy Garity is an actor known for his diverse body of work. Though his breakout film performance came when he starred opposite Bruce Willis, Cate Blanchett and Billy Bob Thorton in Barry Levinson's \"Bandits\", he is perhaps best known for his role as Isaac in the \"Barbershop\" film franchise. A role he will reprise for the upcoming 2016 film. Garity earned both a Golden Globe and Independent Spirit Award nomination for his performance in the Showtime original film \"Soldier's Girl\". The film also garnered Garity a Peabody Award and the AFI award for excellence in film. Born in Santa Monica California, as a member of the Fonda family, acting was indeed in his blood. He attended the University of Colorado at Boulder and went on to study at The American Academy of Dramatic Arts in NYC. After graduation, Troy spent a year performing as a member of the Academy's famed repertory company. Some of Garity's other notable credits include the Danny Boyle sci-fi thriller \"Sunshine,\" \"Gangster Squad\" directed by Ruben Fleischer, and the critically acclaimed television series \"Boss\" directed by Gus Van Sant. Troy can been seen playing NFL agent Jason Antolotti in HBO's hit comedy series \"Ballers.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYxNzEwNjYwN15BMl5BanBnXkFtZTgwMjM2MjE5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004949","name":"Troy Garity","idIMDB":"nm0004949"},"actorId":"nm0004949","character":"Harvey","urlCharacter":"http://www.imdb.com/character/ch0010638","main":true},{"actorName":"Rose Byrne","urlProfile":"http://www.imdb.com/name/nm0126284","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4OTMxMDkwNV5BMl5BanBnXkFtZTcwOTQxOTg3NQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 July 1979","placeOfBirth":" Balmain, Sydney, New South Wales, Australia","birthName":"Mary Rose Byrne","height":"5' 6¼\" (1.68 m)","bio":"Rose Byrne was born in Balmain, Sydney, Australia. She is the daughter of Jane, a primary school administrator, and Robin Byrne, a semi-retired statistician and market researcher. She landed her first role in a movie, Dallas Doll (1994), when she was 15 years old. Since then, Rose has appeared in a variety of Australian televisions shows including Hartley, coeurs à vif (1994), Echo Point (1995), and the film Two Hands (1999) alongside Heath Ledger. After this, she appeared in various movies like The Date (1999), My Mother Frank (2000), and Clara Law's The Goddess of 1967 (2000) for which she obtained the Female Volpi Cup at the Venice Festival in 2000. Her first experience on a big-budget movie came when she played handmaiden, Dormé, to Natalie Portman, Padmé Amidala, in Star Wars: Episode II - Attack of the Clones (2002). In 2003, she starred, coincidentally, as Rose Mortmain in the adaptation of Dodie Smith's I Capture the Castle (2003). In 2004, she acted in Wicker Park (2004) with Diane Kruger and Josh Hartnett. Here, she heard Wolfgang Petersen was looking for an actress for Briseis in his next movie Troy (2004) with Brad Pitt, she got the part and was recognised as one of the most promising actresses in Hollywood. After Troy (2004), she played Edith in a TV adaptation of Casanova (2005). In September 2005, she started to act in Sunshine (2007), a Danny Boyle movie, where she plays the pilot in a space mission.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4OTMxMDkwNV5BMl5BanBnXkFtZTcwOTQxOTg3NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0126284","name":"Rose Byrne","nicknames":["Rosie"],"idIMDB":"nm0126284"},"actorId":"nm0126284","character":"Cassie","urlCharacter":"http://www.imdb.com/character/ch0010633","main":true},{"actorName":"Hiroyuki Sanada","urlProfile":"http://www.imdb.com/name/nm0760796","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MzY0NTM1Ml5BMl5BanBnXkFtZTcwNzQzNzMyMw@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 October 1960","placeOfBirth":" Tokyo, Japan","birthName":"Hiroyuki Shimosawa","height":"5' 6\" (1.68 m)","bio":"Hiroyuki Sanada was born on the 12th of October, 1960 in Tokyo. He made his film debut when he was 5 in Game of Chance (1965) (Shin'ichi Chiba played the lead role.) Sanada's father died when he was 11. Sanada joined Japan Action Club, organized and run by Sonny Chiba, when he was 12. Sanada first became famous as an action star for his role in The Shogun's Samurai (1978). He started his career as an action star but now is known as one of the most talented actors in Japan. From 1999 to 2000, Sanada played the fool in an English-language production of \"King Lear\" with members of the Royal Shakespeare Co as the first Japanese actor to play with the RSC. He received an honorary MBE (Member of the British Empire) for this work. He and Satomi Tezuka got divorced after their 7-year marriage in 1997.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MzY0NTM1Ml5BMl5BanBnXkFtZTcwNzQzNzMyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0760796","name":"Hiroyuki Sanada","nicknames":["Duke"],"idIMDB":"nm0760796"},"actorId":"nm0760796","character":"Kaneda","urlCharacter":"http://www.imdb.com/character/ch0010637","main":true},{"actorName":"Benedict Wong","urlProfile":"http://www.imdb.com/name/nm0938950","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MjQyNzU4MV5BMl5BanBnXkFtZTcwNTc2MjQxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1970","placeOfBirth":" Manchester, England, UK","height":"5' 10\" (1.78 m)","bio":"Benedict Wong was born in 1970 in Manchester, England. He is an actor and writer, known for Doctor Strange (2016), The Martian (2015) and Prometheus (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MjQyNzU4MV5BMl5BanBnXkFtZTcwNTc2MjQxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0938950","name":"Benedict Wong","idIMDB":"nm0938950"},"actorId":"nm0938950","character":"Trey","urlCharacter":"http://www.imdb.com/character/ch0047802","main":true},{"actorName":"Chris Evans","urlProfile":"http://www.imdb.com/name/nm0262635","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTg1OTQzMF5BMl5BanBnXkFtZTcwNjIyMjkyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1981","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Christopher Robert Evans","height":"6' (1.83 m)","bio":"Christopher Robert Evans began his acting career in typical fashion: performing in school productions and community theater. He was born in Boston, Massachusetts, the son of Lisa (Capuano), who worked at the Concord Youth Theater, and G. Robert Evans III, a dentist. His uncle is congressman Mike Capuano. Chris's father is of half German and half Welsh/English/Scottish ancestry, while Chris's mother is of half Italian and half Irish descent. He has an older sister, Carly Evans, and two younger siblings, a brother named Scott Evans, and a sister named Shana Evans. The family moved to suburban Sudbury when he was 11 years-old. Bitten by the acting bug in the first grade because his older sister, Carly, started performing, Evans followed suit and began appearing in school plays. While at Lincoln-Sudbury Regional High School, his drama teacher cited his performance as \"Leontes\" in \"The Winter's Tale\" as exemplary of his skill. After more plays and regional theater, he moved to New York and attended the Lee Strasberg Theater Institute. On the advice of friends, he landed an internship at a casting office and befriended a couple of the agents he regularly communicated with - one of whom later took him on as a client. The screen - not the stage - then became his focus; Evans soon began auditioning for feature films and television series. Evans made one of his first appearances on The Fugitive (2000) (CBS, 2000-2001), a remake of the 1960s series and feature film starring Harrison Ford. In the episode \"Guilt\", Evans played the son of a small-town sheriff who tries to exact revenge after Dr. Richard Kimble - incognito as a liquor store owner - refuses to sell him and his friends alcohol. After small roles in Cherry Falls (2000) and The Newcomers (2000) - two unknown low-budget features - Evans appeared in Boston Public (2000) (Fox, 2000-2004) as a murder suspect. He then appeared in his first major feature, Not Another Teen Movie (2001), a spoof on teen comedies wherein he played a jock who makes a bet that he can turn an unpopular and unkempt girl (Chyler Leigh) into prom queen. After filming a couple of television pilots he was confident would be successful - Just Married (2003) and Eastwick (2002) - he appeared in another listless teen comedy, The Perfect Score (2004), playing an average, ho-hum student who takes part in a plot to steal the SAT test. Hijinks naturally ensue. Then, Evans broke through to the Big Time, grabbing the lead in the kidnapping thriller, Cellular (2004), a suspenseful B movie with a cheesy gimmick - a random wrong number on his cell phone forces him into a high-stakes race to save an unknown woman's life. Despite an unassuming performance from Evans and Kim Basinger as the damsel in distress, Cellular (2004) failed to break any box office records or please a wide majority of critics. Evans then prepared himself for super stardom when he signed on to play Johnny Storm in Fantastic Four (2005), 20th Century Fox's long-awaited adaptation of the Marvel comic. Although the film was wildly uneven and disappointing, Evans nearly stole the show with his energetic, unfettered performance. In that year itself, Chris was noticed by critics and made it into magazine and Internet countdowns, scoring himself a third position of the hot body countdown from Gay.com and #18 on E! Television's 2006 101 Sexiest Celebrity Bodies. The year 2007 also proved to be one successful year for Chris, as he had two movies released around the world that same year, starting with the second installment of the Marvel franchise Fantastic Four. Chris received positive reviews for his performance. The Nanny Diaries (2007), where Evans played Harvard Hottie, showed his sensitive. The year 2008 saw Chris Evans' part of the movie Street Kings (2008), playing the character Detective Paul Diskant. The movie is about police officers trying to cover up their wrongdoings and audiences got to see a serious side of Chris. In the same year, Chris also worked on the movie The Loss of a Teardrop Diamond (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTg1OTQzMF5BMl5BanBnXkFtZTcwNjIyMjkyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0262635","name":"Chris Evans","nicknames":["Cevans"],"idIMDB":"nm0262635"},"actorId":"nm0262635","character":"Mace","urlCharacter":"http://www.imdb.com/character/ch0010632","main":true},{"actorName":"Cliff Curtis","urlProfile":"http://www.imdb.com/name/nm0193295","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk4ODc3NjQxOF5BMl5BanBnXkFtZTgwOTkyMjQ1ODE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 July 1968","placeOfBirth":" Rotorua, New Zealand","height":"6' 0½\" (1.84 m)","bio":"Cliff Curtis was born in Rotorua, New Zealand, on July 27, 1968. He is of New Zealand Maori descent (with Ngati Hauiti and Te Arawa tribal affiliations). He enrolled at the New Zealand Drama School, and then the Teatro Dmitri Scoula in Switzerland. After returning to New Zealand from Europe, he was cast in La leçon de piano (1993). Subsequent roles in New Zealand include the camp melodrama Desperate Remedies (1993), the grueling urban drama L'âme des guerriers (1994), and the lighthearted comedy Jubilee (2000). In Hollywood, Curtis has played a range of different roles and ethnicities in films. He plays a Colombian in Blow (2001), an Arab in Three Kings (1999) and The Insider (1999), a Latino in Training Day (2001) and Runaway Jury (2003), and a drug dealer of ambiguous ethnicity in Bringing Out the Dead (1999). However, he is probably best known for his role as Paikea's father Porourangi, in Paï (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk4ODc3NjQxOF5BMl5BanBnXkFtZTgwOTkyMjQ1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0193295","name":"Cliff Curtis","idIMDB":"nm0193295"},"actorId":"nm0193295","character":"Searle","urlCharacter":"http://www.imdb.com/character/ch0010635","main":true},{"actorName":"Mark Strong","urlProfile":"http://www.imdb.com/name/nm0835016","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2MzAyMDc2NTheQTJeQWpwZ15BbWU3MDUzNTQyNjg@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 August 1963","placeOfBirth":" London, England, UK","birthName":"Marco Giuseppe Salussolia","height":"6' 2\" (1.88 m)","bio":"British actor Mark Strong, who played Jim Prideaux in the 2011 remake of La taupe (2011), is often cast as cold, calculating villains. But before he became a famous actor, he intended to pursue a career in law. Strong was born Marco Giuseppe Salussolia in London, England, to an Austrian mother and an Italian father. His father left the family not long after he was born, and his mother worked as an au pair to raise the boy on her own. Strong's mother had his name legally changed when he was young in order to help him better assimilate with his peers. Strong attended Wymondham College in Norfolk, and studied at the university level in Munich with the intent of becoming a lawyer. After a year, he returned to London to study English and Drama at Royal Holloway. He went on to further master his craft of at Bristol Old Vic Theatre School. Although Americans are most familiar with Strong's roles as Sinestro in Green Lantern (2011), mob boss Frank D'Amico in Kick-Ass (2010), and Lord Blackthorn in Sherlock Holmes (2009), British audiences know him from his long history as a television actor. He also starred in as numerous British stage productions, including plays at the Royal National Theatre and the RSC. His most prominent television parts include Prime Suspect 3 (1993) and Prime Suspect 6: The Last Witness (2003) as Inspector Larry Hall, and starring roles in the BBC Two dramas Our Friends in the North (1996) and The Long Firm (2004), the latter of which netted Strong a BAFTA nomination. He also played Mr. Knightley in the 1996 adaptation of Jane Austen's classic tale Emma (1996). Strong resides in London with his wife Liza Marshall, with whom he has two sons, the younger of which is the godson of his longtime friend Daniel Craig.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2MzAyMDc2NTheQTJeQWpwZ15BbWU3MDUzNTQyNjg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0835016","name":"Mark Strong","idIMDB":"nm0835016"},"actorId":"nm0835016","character":"Pinbacker","urlCharacter":"http://www.imdb.com/character/ch0010636","main":true},{"actorName":"Paloma Baeza","urlProfile":"http://www.imdb.com/name/nm0046469","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MDE5NTg4NF5BMl5BanBnXkFtZTgwNjUxNDQ2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 May 1975","placeOfBirth":" London, England, UK","height":"5' 3\" (1.6 m)","bio":"Paloma - whose Christian name is the Spanish for 'Dove' - was born on May 1st 1975 in London. Her parents, an English mother and Mexican father were hippie musicians and, when Paloma was a baby they moved to live in Mexico City, where she stayed until she was nine and the parents separated. She returned to England with her mother, began acting in school plays and read English and Performing Arts at Bristol University. Since then she has appeared on the London stage and in several popular television dramas. She has also directed two short films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MDE5NTg4NF5BMl5BanBnXkFtZTgwNjUxNDQ2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0046469","name":"Paloma Baeza","idIMDB":"nm0046469"},"actorId":"nm0046469","character":"Capa's Sister","urlCharacter":"http://www.imdb.com/character/ch0213942","main":true},{"actorName":"Archie Macdonald","urlProfile":"http://www.imdb.com/name/nm2640903","urlPhoto":"","biography":{"bio":"Archie Macdonald is an actor, known for Sunshine (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2640903","name":"Archie Macdonald","idIMDB":"nm2640903"},"actorId":"nm2640903","character":"Child","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sylvie Macdonald","urlProfile":"http://www.imdb.com/name/nm2640975","urlPhoto":"","biography":{"bio":"Sylvie Macdonald is an actress, known for Sunshine (2007) and Never Let Me Go (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2640975","name":"Sylvie Macdonald","idIMDB":"nm2640975"},"actorId":"nm2640975","character":"Child","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chipo Chung","urlProfile":"http://www.imdb.com/name/nm1496158","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODg0MjgyNTMwOV5BMl5BanBnXkFtZTgwODg1OTM5MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1977","placeOfBirth":" Zimbabwe","bio":"Chipo Chung was born in 1977 in Zimbabwe. She is an actress, known for Sunshine (2007), In the Loop (2009) and Proof (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODg0MjgyNTMwOV5BMl5BanBnXkFtZTgwODg1OTM5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1496158","name":"Chipo Chung","idIMDB":"nm1496158"},"actorId":"nm1496158","character":"Icarus","urlCharacter":"http://www.imdb.com/character/ch0098246","main":true}],"seasons":[],"idIMDB":"tt0448134","urlIMDB":"http://www.imdb.com/title/tt0448134","business":{"budget":{"money":"£26,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$242,964","country":"USA","day":"22","month":"07","year":"2007","remarks":"10 Screens"},{"money":"£1,021,063","country":"UK","day":"08","month":"04","year":"2007","remarks":"407 Screens"},{"money":"$4,897","country":"Estonia","day":"29","month":"04","year":"2007","remarks":"1 Screen"},{"money":"RUR 6,380,964","country":"Russia","day":"15","month":"04","year":"2007","remarks":"65 Screens"}],"gross":[{"money":"$3,675,753","country":"USA","day":"18","month":"10","year":"2007","remarks":""},{"money":"$3,675,072","country":"USA","day":"14","month":"10","year":"2007","remarks":""},{"money":"$3,672,346","country":"USA","day":"07","month":"10","year":"2007","remarks":""},{"money":"$3,665,898","country":"USA","day":"30","month":"09","year":"2007","remarks":""},{"money":"$3,654,586","country":"USA","day":"23","month":"09","year":"2007","remarks":""},{"money":"$3,636,193","country":"USA","day":"16","month":"09","year":"2007","remarks":""},{"money":"$3,612,292","country":"USA","day":"09","month":"09","year":"2007","remarks":""},{"money":"$3,575,854","country":"USA","day":"02","month":"09","year":"2007","remarks":""},{"money":"$3,486,581","country":"USA","day":"26","month":"08","year":"2007","remarks":""},{"money":"$3,376,207","country":"USA","day":"19","month":"08","year":"2007","remarks":""},{"money":"$3,166,574","country":"USA","day":"12","month":"08","year":"2007","remarks":""},{"money":"$2,683,625","country":"USA","day":"05","month":"08","year":"2007","remarks":""},{"money":"$1,625,497","country":"USA","day":"29","month":"07","year":"2007","remarks":""},{"money":"$242,964","country":"USA","day":"22","month":"07","year":"2007","remarks":""},{"money":"£2,786,833","country":"UK","day":"22","month":"04","year":"2007","remarks":""},{"money":"£2,245,583","country":"UK","day":"15","month":"04","year":"2007","remarks":""},{"money":"£1,021,063","country":"UK","day":"08","month":"04","year":"2007","remarks":""},{"money":"AUD 1,787,461","country":"Australia","day":"02","month":"05","year":"2007","remarks":""},{"money":"RUR 26,547,348","country":"Russia","day":"27","month":"05","year":"2007","remarks":""},{"money":"RUR 17,255,338","country":"Russia","day":"22","month":"04","year":"2007","remarks":""},{"money":"RUR 6,380,964","country":"Russia","day":"15","month":"04","year":"2007","remarks":""}],"weekendGross":[{"money":"$1,479","country":"USA","day":"14","month":"10","year":"2007","remarks":"4 Screens"},{"money":"$2,658","country":"USA","day":"07","month":"10","year":"2007","remarks":"5 Screens"},{"money":"$4,831","country":"USA","day":"30","month":"09","year":"2007","remarks":"12 Screens"},{"money":"$10,849","country":"USA","day":"23","month":"09","year":"2007","remarks":"21 Screens"},{"money":"$11,544","country":"USA","day":"16","month":"09","year":"2007","remarks":"27 Screens"},{"money":"$23,572","country":"USA","day":"09","month":"09","year":"2007","remarks":"33 Screens"},{"money":"$61,709","country":"USA","day":"02","month":"09","year":"2007","remarks":"28 Screens"},{"money":"$47,992","country":"USA","day":"26","month":"08","year":"2007","remarks":"40 Screens"},{"money":"$94,615","country":"USA","day":"19","month":"08","year":"2007","remarks":"85 Screens"},{"money":"$180,704","country":"USA","day":"12","month":"08","year":"2007","remarks":"116 Screens"},{"money":"$448,386","country":"USA","day":"05","month":"08","year":"2007","remarks":"383 Screens"},{"money":"$1,262,996","country":"USA","day":"29","month":"07","year":"2007","remarks":"461 Screens"},{"money":"$242,964","country":"USA","day":"22","month":"07","year":"2007","remarks":"10 Screens"},{"money":"£236,706","country":"UK","day":"22","month":"04","year":"2007","remarks":"275 Screens"},{"money":"£443,368","country":"UK","day":"15","month":"04","year":"2007","remarks":"409 Screens"},{"money":"£1,021,063","country":"UK","day":"08","month":"04","year":"2007","remarks":"407 Screens"},{"money":"RUR 8,793,846","country":"Russia","day":"22","month":"04","year":"2007","remarks":"155 Screens"},{"money":"RUR 6,380,964","country":"Russia","day":"15","month":"04","year":"2007","remarks":"65 Screens"}],"admissions":[{"money":"180,142","country":"Germany","day":"06","month":"05","year":"2007","remarks":""},{"money":"144,609","country":"Germany","day":"29","month":"04","year":"2007","remarks":""},{"money":"77,380","country":"Germany","day":"22","month":"04","year":"2007","remarks":""},{"money":"24,271","country":"Netherlands","day":"31","month":"12","year":"2007","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"22","month":"08","year":"2005","remarks":null},null],"copyrightHolder":"Twentieth Century Fox Film Corporation and Dune Entertainment LLC in all territories except Brazil, Italy, Japan, Korea and Spain; TCF Hungary Film Rights Exploitation Limited Liability Company, Twentieth Century Fox Film Corporation and Dune Entertainment LLC in Brazil, Italy, Japan, Korea and Spain"},"technical":{"runtime":["1 hr 47 min (107 min)"],"soundMix":["Dolby Digital","SDDS","DTS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arricam ST, Hawk C-, V-Series, Zeiss Master Prime and Ultra Prime Lenses","Arriflex 235, Hawk C-, V-Series, Zeiss Master Prime and Ultra Prime Lenses","Arriflex 435 Xtreme, Hawk C-, V-Series, Zeiss Master Prime and Ultra Prime Lenses","Arriflex 765, Zeiss 765 Lenses"],"laboratory":["DeLuxe, London, UK (also prints)","The Moving Picture Company (MPC), London, UK (digital intermediate)"],"filmLength":["2,937 m (Portugal, 35 mm)","2,945 m (Sweden)"],"negativeFormat":["35 mm (Kodak Vision2 500T 5218)","65 mm (Kodak Vision2 500T 5218)"],"cinematographicProcess":["Arri 765 (source format) (one scene)","Digital Intermediate (2K) (master format)","Hawk Scope (anamorphic) (source format)","Super 35 (source format)"],"printedFilmFormat":["35 mm"]},"rating":"7.3","metascore":"64","filmingLocations":[{"location":"Hakberget, Gärdet, Stockholm, Stockholms län, Sweden"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Science Fiction Film","names":[]}]}]},{"award":"British Independent Film Awards 2007","titlesAwards":[{"titleAwardOutcome":"Won British Independent Film Award","categories":[{"category":"Best Technical Achievement","names":[{"name":"Mark Tildesley","id":"nm0863217","role":null}]}]},{"titleAwardOutcome":"Nominated British Independent Film Award","categories":[{"category":"Best Actor","names":[{"name":"Cillian Murphy","id":"nm0614165","role":null}]}]}]},{"award":"Empire Awards, UK 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Empire Award","categories":[{"category":"Best British Film","names":[]},{"category":"Best Sci-Fi/Fantasy","names":[]}]}]},{"award":"Evening Standard British Film Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Evening Standard British Film Award","categories":[{"category":"Best Film Score","names":[{"name":"John Murphy","id":"nm0614373","role":null},{"name":"Underworld","id":"nm1744868","role":null}]},{"category":"Best Technical Achievement","names":[{"name":"Chris Gill","id":"nm0318639","role":"editor"},{"name":"28 Weeks Later","id":"tt0463854","role":null}]},{"category":"Best Technical Achievement","names":[{"name":"Alwin H. Küchler","id":"nm0473696","role":"cinematographer"}]}]}]},{"award":"Golden Schmoes Awards 2007","titlesAwards":[{"titleAwardOutcome":"2nd place Golden Schmoes","categories":[{"category":"Best Sci-Fi Movie of the Year","names":[]}]},{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Most Underrated Movie of the Year","names":[]},{"category":"Trippiest Movie of the Year","names":[]},{"category":"Best Special Effects of the Year","names":[]}]}]},{"award":"International Film Music Critics Award (IFMCA) 2007","titlesAwards":[{"titleAwardOutcome":"Nominated IFMCA Award","categories":[{"category":"Best Original Score for a Fantasy/Science Fiction Film","names":[{"name":"John Murphy","id":"nm0614373","role":null},{"name":"Karl Hyde","id":"nm1592163","role":"as Underworld"},{"name":"Rick Smith","id":"nm1587208","role":"as Underworld"}]}]}]},{"award":"Irish Film and Television Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated IFTA Award","categories":[{"category":"Best Actor in a Lead Role in a Feature Film","names":[{"name":"Cillian Murphy","id":"nm0614165","role":null}]}]}]},{"award":"Las Vegas Film Critics Society Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Sierra Award","categories":[{"category":"Best Picture","names":[]}]}]},{"award":"London Critics Circle Film Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated ALFS Award","categories":[{"category":"British Director of the Year","names":[{"name":"Danny Boyle","id":"nm0000965","role":null}]}]}]},{"award":"Online Film & Television Association 2008","titlesAwards":[{"titleAwardOutcome":"Nominated OFTA Film Award","categories":[{"category":"Best Visual Effects","names":[{"name":"Richard Conway","id":"nm0176763","role":null},{"name":"Kieron Helsdon","id":"nm0375832","role":null},{"name":"Marian Mavrovic","id":"nm0561436","role":null},{"name":"Tom Wood","id":"nm0940054","role":null}]}]}]},{"award":"Satellite Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Satellite Award","categories":[{"category":"Best Art Direction &amp; Production Design","names":[{"name":"Mark Tildesley","id":"nm0863217","role":null},{"name":"Gary Freeman","id":"nm0293396","role":null},{"name":"Stephen Morahan","id":"nm0602460","role":null},{"name":"Denis Schnegg","id":"nm1270113","role":null}]}]}]}],"votes":"198,010","type":"Movie","companyCreditsSimple":[{"idCompany":"co0103974","name":"DNA Films"},{"idCompany":"co0136728","name":"Ingenious Film Partners"},{"idCompany":"co0016492","name":"Moving Picture Company (MPC)"}],"keywords":{"keywords":["bare chested male","spacecraft","surprise ending","cult film","sun","icarus","earth","astronaut","future","bomb","spaceship setting","melodrama","tech noir","space","trapped in space","2050s","lens flare","no survivors","reference to icarus","surgical instrument","science","religion","claustrophobia","scolding","fistfight","freezing to death","atheist","whispering","umbrella","sydney opera house","sunrise","splashed by wave","spacewalk","spaceship","sol","sabotage","nightmare","message home","incineration","garden","fight","dust","computer control","bright light","breaking a window","asteroid","airlock","religion versus science","scalpel","ultraviolet light","sunburn","leg wound","stabbed in the back","wrist slitting","self sacrifice","exploding ship","burned to death","blood","physics","saving the world mission","vacuum","suicide","star","spacesuit","murder","hologram","nuclear fusion","weightlessness","burnt body","scientist","natural disaster","fire","environmental disaster","end of the world","disaster","death","apocalypse","independent film","outer space","snowman","arm ripped off","studio logo segues into film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:15:44"}}