{"data":{"movies":[{"title":"The Librarian: Quest for the Spear","originalTitle":"","year":"2004","releaseDate":"20041205","directors":[{"name":"Peter Winther","id":"nm0936044"}],"writers":[{"name":"David N. Titcher","id":"nm0864435"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNjM3MzkxNF5BMl5BanBnXkFtZTcwMTU5ODkyMQ@@._V1.jpg","countries":["USA","Germany"],"languages":["English","French","Latin","Mongolian","Portuguese"],"genres":["Action","Adventure","Comedy","Drama","Fantasy","Romance","Thriller"],"plot":"Flynn, an over 30 \"professional student,\" is banned from more classes, since he already has 22 degrees. Unexpectedly hired by a mysterious library, he's soon pursuing a stolen artifact from the library, a pursuit taking him to far-off lands.","simplePlot":"Flynn, an over 30 \"professional student,\" is banned from more classes, since he already has 22 degrees. Unexpectedly hired by a mysterious library, he's soon pursuing a stolen artifact from... ","actors":[{"actorName":"Noah Wyle","urlProfile":"http://www.imdb.com/name/nm0001864","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTg5NzYxMV5BMl5BanBnXkFtZTcwMDE0MjU1Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1971","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Noah Strausser Speer Wyle","height":"6' 1\" (1.85 m)","bio":"Noah Wyle was born in Hollywood, California, to Marjorie (Speer), an orthopedic head nurse, and Stephen Wyle, an entrepreneur and electrical engineer. He is one of six children. His father's family was Russian Jewish. Noah had early support for his acting ambitions from his stepfather, film restorationist James C. Katz. He had small parts in high school productions (and won an award for a play he wrote). He participated in a Northwestern University theater program, and was hooked - acting rather than college after high school. After graduation he learned from acting teacher Larry Moss while living in a small apartment on Hollywood Boulevard. His first part was at age 17, in Blind Faith (1990), but after a few good roles he hit a dry spell for two years (no acting, waiting on tables). Then came A Few Good Men (1992) followed by another dry spell in which a return to restaurant work looked like a good option. Television shows seemed possible but Noah steered clear of these because of the 5-year contract commitment. Then came the script for the pilot of ER (1994), and the part of Dr. Carter looked very good. Three auditions later, he had the role.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTg5NzYxMV5BMl5BanBnXkFtZTcwMDE0MjU1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001864","name":"Noah Wyle","idIMDB":"nm0001864"},"actorId":"nm0001864","character":"Flynn Carsen","urlCharacter":"http://www.imdb.com/character/ch0046866","main":true},{"actorName":"Sonya Walger","urlProfile":"http://www.imdb.com/name/nm0907427","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MzMzMDU2MF5BMl5BanBnXkFtZTcwMzI5MDk2MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 June 1974","placeOfBirth":" London, England, UK","height":"5' 7\" (1.7 m)","bio":"Sonya Walger was born on June 6, 1974 in London, England. She is an actress, known for The Librarian: Quest for the Spear (2004), Her Evil Twin (2014) and 48 heures chrono (2012). She has been married to Davey Holmes since July 2009. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MzMzMDU2MF5BMl5BanBnXkFtZTcwMzI5MDk2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0907427","name":"Sonya Walger","idIMDB":"nm0907427"},"actorId":"nm0907427","character":"Nicole Noone","urlCharacter":"http://www.imdb.com/character/ch0060786","main":true},{"actorName":"Bob Newhart","urlProfile":"http://www.imdb.com/name/nm0627878","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MDE5NDcxOV5BMl5BanBnXkFtZTcwNTAxOTkwMg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 September 1929","placeOfBirth":" Oak Park, Illinois, USA","birthName":"George Robert Newhart","height":"5' 8\" (1.73 m)","bio":"Bob Newhart was born on September 5, 1929 in Oak Park, Illinois, USA as George Robert Newhart. He is an actor and writer, known for Newhart (1982), The Bob Newhart Show (1972) and Elf (2003). He has been married to Ginny Newhart since January 12, 1963. They have four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MDE5NDcxOV5BMl5BanBnXkFtZTcwNTAxOTkwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0627878","name":"Bob Newhart","idIMDB":"nm0627878"},"actorId":"nm0627878","character":"Judson","urlCharacter":"http://www.imdb.com/character/ch0047597","main":true},{"actorName":"Kyle MacLachlan","urlProfile":"http://www.imdb.com/name/nm0001492","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4Mzk3OTg3MF5BMl5BanBnXkFtZTYwMTk0MDkz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1959","placeOfBirth":" Yakima, Washington, USA","birthName":"Kyle Merritt McLachlan","height":"5' 11¼\" (1.81 m)","bio":"The \"boy next door, if that boy spent lots of time alone in the basement\", is how Rich Cohen described Kyle MacLachlan in a 1994 article for \"Rolling Stone\" magazine. That distinctly askew wholesomeness made MacLachlan a natural to become famous as the alter ego of twisted director David Lynch. MacLachlan was born and raised in Yakima, Washington, to Catherine Louise (Stone), a public relations director, and Kent Alan McLachlan, a lawyer and stockbroker. He has Scottish, English, Cornish, and German ancestry. MacLachlan graduated from the University of Washington in 1982. The darkly handsome actor made his feature film debut when he starred in the big-budget David Lynch adaptation of Frank Herbert's Dune (1984), but only enjoyed real success after appearing in a second Lynch project, the moody and perverse classic, Blue Velvet (1986). The following year saw MacLachlan appearing as an otherworldly FBI agent in the cult classic sci-fi film, The Hidden (1987). This turned out to be a sign of things to come, as MacLachlan soon took on another oddball G-man, \"Special Agent Dale Cooper\", on Lynch's cryptic ABC-TV series, Twin Peaks (1990), perhaps, along with Blue Velvet (1986), his most famous role. MacLachlan's remarkable work as Agent Cooper earned him a Golden Globe award and a pair of Emmy nominations, as well as steady work in television and films, including a part as Ray Manzarek in the Oliver Stone film, The Doors (1991), and villain \"Cliff Vandercave\" in the live action version of The Flintstones (1994). His career took a hit after he appeared in the infamous flop, Showgirls (1995). However, MacLachlan returned to prominence in the early 2000s with a re-occurring role on HBO's Sex and the City (1998), as well as a starring role in the TV movie, The Spring (2000), and a turn as \"Claudius\" in director Michael Almereyda's version of Hamlet (2000). MacLachlan later took advantage of his resemblance to Cary Grant, when he played the classic actor's spirit in Un soupçon de rose (2004). MacLachlan has remained a popular actor with independent filmmakers, and he has also been a familiar face on television, appearing on the ABC-TV shows, In Justice (2006) and Desperate Housewives (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4Mzk3OTg3MF5BMl5BanBnXkFtZTYwMTk0MDkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001492","name":"Kyle MacLachlan","idIMDB":"nm0001492"},"actorId":"nm0001492","character":"Edward Wilde","urlCharacter":"http://www.imdb.com/character/ch0060787","main":true},{"actorName":"Kelly Hu","urlProfile":"http://www.imdb.com/name/nm0005026","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4ODQ5NDMzOV5BMl5BanBnXkFtZTcwMjEzODA3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1968","placeOfBirth":" Honolulu, Hawaii, USA","birthName":"Kelly Ann Hu","height":"5' 5\" (1.65 m)","bio":"On February 13th, 1968, a girl of Chinese, English, and Hawaiian ancestry was born in Honolulu, Hawaii. Her father, Herbert, was a salesman and her mother, Juanita, worked many odd jobs to help support the family. She has one older brother, Glenn. She is a former Miss Teen USA, and modeled in Japan and Italy for several months before deciding to relocate to L.A. and try her hand at show business. She got her break on TV's Growing Pains (1985) in 1987 and never looked back.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4ODQ5NDMzOV5BMl5BanBnXkFtZTcwMjEzODA3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005026","name":"Kelly Hu","idIMDB":"nm0005026"},"actorId":"nm0005026","character":"Lana","urlCharacter":"http://www.imdb.com/character/ch0060788","main":true},{"actorName":"David Dayan Fisher","urlProfile":"http://www.imdb.com/name/nm1113959","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MDE2MDI3N15BMl5BanBnXkFtZTgwNjA4MzQ5NjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Born and raised in North London. David started acting at 28 years of age. He worked in numerous jobs before finding his passion. From a Pizza and Crepe chef to owner of a float tank center. He trained at Central School of Speech and Drama in west London. Improv. at Timber Theater company in Highgate, and Dangerous acting at the Actor Studio. Actor, Author, Artist & poet.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MDE2MDI3N15BMl5BanBnXkFtZTgwNjA4MzQ5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1113959","name":"David Dayan Fisher","idIMDB":"nm1113959"},"actorId":"nm1113959","character":"Rhodes","urlCharacter":"http://www.imdb.com/character/ch0060789","main":true},{"actorName":"Jane Curtin","urlProfile":"http://www.imdb.com/name/nm0004852","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNTAzMDUxMl5BMl5BanBnXkFtZTYwNjY0NTg0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1947","placeOfBirth":" Cambridge, Massachusetts, USA","birthName":"Jane Therese Curtin","height":"5' 5\" (1.65 m)","bio":"Jane Therese Curtin was born September 6th, 1947. Years later, a 27-year-old Jane Curtin auditioned for a comedy variety show. which turned out to be the the thing that would first expose her to fame, Saturday Night Live (1975). Jane won the audition against Mimi Kennedy, a tough competitor. Also in the same year (1975), she married Patrick Lynch. After her five-year run on SNL, Jane moved on, having a daughter named Tess in-between a new show with Susan Saint James titled Kate & Allie (1984), which was about two divorced women living in one house with their children. After Kate & Allie (1984) and several film roles, including Coneheads (1993), came 3rd Rock from the Sun (1996), a show about aliens living in Ohio and adjusting to Earth. In 2001, 3rd Rock ended production, and Jane eventually brought her talents to Broadway. She currently lives with her husband and her daughter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNTAzMDUxMl5BMl5BanBnXkFtZTYwNjY0NTg0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004852","name":"Jane Curtin","nicknames":["Janey"],"idIMDB":"nm0004852"},"actorId":"nm0004852","character":"Charlene","urlCharacter":"http://www.imdb.com/character/ch0060790","main":true},{"actorName":"Olympia Dukakis","urlProfile":"http://www.imdb.com/name/nm0001156","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0ODkwODk4M15BMl5BanBnXkFtZTcwODE0ODMxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1931","placeOfBirth":" Lowell, Massachusetts, USA","height":"5' 3\" (1.6 m)","bio":"Long a vital, respected lady of the classic and contemporary stage this grand lady did not become a household name and sought-after film actress until age 56 when she turned in a glorious, Oscar-winning perf as Cher's sardonic mother in the romantic comedy Moonstruck (1987). Since then movie (and TV) fans have discovered what the East coast theater-going audiences had uncovered decades before -- an acting treasure. Her adaptability to various ethnicities (Greek, Italian, Jewish, Eastern European, etc.), as well her chameleon-like versatility in everything from cutting edge comedy to stark tragedy, has kept her in high demand for the past 30 years as of one of Hollywood's topnotch character players. Olympia Dukakis was born on June 20, 1931, in Lowell, Massachusetts, the daughter of Greek immigrants, Alexandra (Christos), from the Peloponnese, and Constantine S. Dukakis, from Anatolia. She majored in physical therapy at Boston University, where she graduated with a BA. She practiced as a physical therapist during the polio epidemic. She later returned to her alma mater and entered the graduate program in performing arts and earned a Master of Fine Arts degree. Olympia found early success by distinguishing herself first on stage performing in summer stock and with several repertory and Shakespearean companies throughout the county. She made her Broadway debut as an understudy in \"The Aspern Papers\" at age 30, followed by very short runs in the plays \"Abraham Cochrane\" (1964) and \"Who's Who in Hell\" (1974). In 1999, she premiered a one-woman play \"Rose\", at the National Theatre in London and subsequently on Broadway in 2000. The play earned her an Outer Critics Circle Award and Drama Desk Award nomination and she continues to tour the country with it. Most recently she was seen on the New York stage in the Roundabout Theatre's production of \"The Milktrain Doesn't Stop Here Anymore\" (2011), in San Francisco in A.C.T.'s production of \"Vigil\" (2011) and as \"Prospera\" in \"The Tempest\" (2012) at Shakespeare & Co. She has performed in over 130 productions Off-Broadway and regionally at theatres including the Public Theatre, A.C.T., Shakespeare in the Park, Shakespeare & Co., and the Williamstown Summer Theatre Festival, where she also served as Associate Director. She will be seen again at Shakespeare & Co. in the summer of 2013 as the title role in \"Mother Courage and Her Children.\" Olympia married Yugoslav-American actor Louis Zorich in 1962. The New York-based couple went on to co-found The Whole Theatre Company in Montclair, New Jersey, and ran the company for 19 years (1971-1990). As actress, director, producer and teacher, she still found the time to raise their three young children. She also became a master instructor at New York University for fourteen years. She scored theater triumphs in \"A Man's a Man,\" for which she won an Off-Broadway Obie Award in 1962; several productions of \"The Cherry Orchard\" and \"Mother Courage\"; \"Six Characters in Search of an Author\"; \"The Rose Tattoo\"; \"The Seagull\"; \"The Marriage of Bette and Boo\" (another Obie Award); and, more notably, her many performances as the title role in \"Hecuba.\" A good portion of her successes was launched within the walls of her own theater company, which encouraged the birth of new and untried plays. Her prolific directing credits include many of the classics: \"Orpheus Descending,\" \"The House of Bernarda Alba,\" \"Uncle Vanya,\" and \"A Touch of the Poet,\" as well as the more contemporary (\"One Flew Over the Cuckoo's Nest\" and \"Kennedy's Children\"). She also adapted such plays as \"Mother Courage\" and \"The Trojan Women\" for the theater company. Over the duration of their marriage, she and her husband have experienced shared successes, appearing together in \"Long Day's Journey Into Night,\" \"Camino Real, \"The Three Sisters\" and \"The Seagull,\" among many others. Both are master interpreters of Chekhovian plays -- one of their more recent acting collaborations was in \"The Chekhov Cycle\" in 2003. Making an inauspicious debut in a bit role as a mental patient in Lilith (1964), she tended to gravitate toward off-the-wall films with various offshoots of the ethnic mother. She played mom to such leads as Dustin Hoffman in John and Mary (1969), Joseph Bologna in the cult comedy Made for Each Other (1971) and Ray Sharkey in The Idolmaker (1980). Interestingly, it was her scene-stealing work on Broadway in the comedy \"Social Security\" (1986) that caught director Norman Jewison's eye and earned her the Moonstruck (1987) movie role. The Academy Award win for Best Supporting Actress was the last of a stream of awards she earned for that part, including the American Comedy Award, Los Angeles Film Critics, and Golden Globe Award. From then on, silver-haired Olympia was first in line for a number of cream-of-the-crop matron roles: Steel Magnolias (1989), Dad (1989), Look Who's Talking (1989), The Cemetery Club (1993), Mr. Holland's Opus (1995) and Mother (1995). Her most recent film, Cloudburst (2011), has been a critical and audience darling, winning her several Best Actress awards and over 40 awards for Best Film at various Film Festivals around the world. On TV, she received high praise for her work especially for her sympathetic trans-gendered landlady in the acclaimed miniseries Armistead Maupin's Tales of the City (1993) and its sequels Armistead Maupin's More Tales of the City (1998) (Emmy Nominee) and Chroniques de San Francisco (2001). She was additionally seen in episodes of Bored to Death (2009), and TV movies The Last of the Blonde Bombshells (2000) (Judi Dench), Sinatra (1992) (Golden Globe Nominee), and The Messenger: The Story of Joan of Arc (1999) (Emmy Nominee). This work is among more than 40 other series, mini-series and guest starring roles she has accumulated over her long career. An ardent liberal and Democrat, she is the cousin of one-time presidential candidate Michael Dukakis. Moreover, she is a strong advocate of women's rights and environmental causes. Olympia published her best-selling autobiography \"Ask Me Again Tomorrow: A Life in Progress\" in 2003, an introspective chronicle full of her trademark candor and wry humor. She is also a figure on the lecture circuit covering topics as widespread as life in the theater to feminism, Alzheimer's, diabetes, and osteoporosis. A hardcore New Yorker, she still resides there with her husband. She has received the Lifetime Achievement Award from the Greek America Foundation and the National Arts Club Medal of Honor and is set to receive her star on the Hollywood Walk of Fame later this year.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0ODkwODk4M15BMl5BanBnXkFtZTcwODE0ODMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001156","name":"Olympia Dukakis","idIMDB":"nm0001156"},"actorId":"nm0001156","character":"Margie Carsen","urlCharacter":"http://www.imdb.com/character/ch0047599","main":true},{"actorName":"Lisa Brenner","urlProfile":"http://www.imdb.com/name/nm0004773","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNjYxNzYzNV5BMl5BanBnXkFtZTcwMDcyMDkyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1974","placeOfBirth":" Long Island, New York, USA","birthName":"Lisa Dawn Goldstein","height":"5' 4\" (1.63 m)","bio":"Lisa Brenner was born on February 12, 1974 in Long Island, New York, USA as Lisa Dawn Goldstein. She is an actress, known for The Patriot (2000), All My Children (1970) and Another World (1964). She has been married to Dean Devlin since July 4, 2003.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNjYxNzYzNV5BMl5BanBnXkFtZTcwMDcyMDkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004773","name":"Lisa Brenner","idIMDB":"nm0004773"},"actorId":"nm0004773","character":"Debra","urlCharacter":"http://www.imdb.com/character/ch0047601","main":true},{"actorName":"Mario Iván Martínez","urlProfile":"http://www.imdb.com/name/nm0555227","urlPhoto":"","biography":{"bio":"Mario Iván Martínez is an actor, known for Mañana es para siempre (2008), Les épices de la passion (1992) and Cronos (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0555227","name":"Mario Iván Martínez","idIMDB":"nm0555227"},"actorId":"nm0555227","character":"Professor Harris","urlCharacter":"http://www.imdb.com/character/ch0060791","main":true},{"actorName":"Clyde Kusatsu","urlProfile":"http://www.imdb.com/name/nm0476226","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MjQ1NzYxOF5BMl5BanBnXkFtZTcwMDQ2Nzg1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 September 1948","placeOfBirth":" Honolulu, Hawaii, USA","height":"5' 5\" (1.65 m)","bio":"Clyde Kusatsu was born on September 13, 1948 in Honolulu, Hawaii, USA. He is an actor, known for Paradise Road (1997), The Interpreter (2005) and Midway (1976). He has been married to Gayle Shuffler since August 29, 1976. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MjQ1NzYxOF5BMl5BanBnXkFtZTcwMDQ2Nzg1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0476226","name":"Clyde Kusatsu","idIMDB":"nm0476226"},"actorId":"nm0476226","character":"Head Monk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alejandra Gollas","urlProfile":"http://www.imdb.com/name/nm0960989","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjA3MzY4NV5BMl5BanBnXkFtZTgwNjcwNTYzODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1976","placeOfBirth":" Mexico City, Distrito Federal, Mexico","bio":"Alejandra Gollas was born in 1976 in Mexico City, Distrito Federal, Mexico. She is known for her work on Efectos secundarios (2006), The Librarian: Quest for the Spear (2004) and Weightwatch (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjA3MzY4NV5BMl5BanBnXkFtZTgwNjcwNTYzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0960989","name":"Alejandra Gollas","idIMDB":"nm0960989"},"actorId":"nm0960989","character":"Student #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"José Montini","urlProfile":"http://www.imdb.com/name/nm1355950","urlPhoto":"","biography":{"bio":"José Montini is an actor, known for La vecina (2015), Get the Gringo (2012) and Que viva Eisenstein! (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1355950","name":"José Montini","idIMDB":"nm1355950"},"actorId":"nm1355950","character":"Janitor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jessica Moreno","urlProfile":"http://www.imdb.com/name/nm1469607","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEzOTY1MDQ4NjFeQTJeQWpwZ15BbWU4MDkxNzgwOTcx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Jessica Moreno was born in Georgetown, Washington, District of Columbia, USA. She is an actress and producer, known for The Librarian: Quest for the Spear (2004), Black Dynamite (2009) and Club Dread (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEzOTY1MDQ4NjFeQTJeQWpwZ15BbWU4MDkxNzgwOTcx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1469607","name":"Jessica Moreno","idIMDB":"nm1469607"},"actorId":"nm1469607","character":"Jill","urlCharacter":"http://www.imdb.com/character/ch0060792","main":true},{"actorName":"Mauricio Llera","urlProfile":"http://www.imdb.com/name/nm1554838","urlPhoto":"","biography":{"bio":"Mauricio Llera is an actor, known for The Librarian: Quest for the Spear (2004), Barrio sin ley (2000) and Bienes raíces (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1554838","name":"Mauricio Llera","nicknames":["Mau LLera"],"idIMDB":"nm1554838"},"actorId":"nm1554838","character":"Sweater Guy","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0412915","urlIMDB":"http://www.imdb.com/title/tt0412915","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"©2004 ApolloProScreen Filmproduktion All Rights Reserved"},"technical":{"runtime":["1 hr 32 min (92 min)","1 hr 46 min (106 min) (extended) (USA)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["Video (HDTV)"],"cinematographicProcess":["HDCAM SR"],"printedFilmFormat":["Video (HDTV)"]},"rating":"6.2","filmingLocations":[{"location":"Equestrian statue of Charles IV, Plaza Manuel Tolsá, Mexico City, Distrito Federal, Mexico"}],"rated":"NOT RATED","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Television Presentation","names":[]},{"category":"Best Actor on Television","names":[{"name":"Noah Wyle","id":"nm0001864","role":null}]},{"category":"Best Supporting Actor on Television","names":[{"name":"Kyle MacLachlan","id":"nm0001492","role":null}]},{"category":"Best Supporting Actress on Television","names":[{"name":"Sonya Walger","id":"nm0907427","role":null}]}]}]},{"award":"Motion Picture Sound Editors, USA 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing in Television Long Form - Sound Effects &amp; Foley","names":[{"name":"Mark Friedgen","id":"nm0295049","role":"supervising sound editor"},{"name":"Bill Bell","id":"nm0068058","role":"sound effects editor"},{"name":"Bob Costanza","id":"nm0182418","role":"sound effects editor"},{"name":"Mike Dickeson","id":"nm0225456","role":"sound effects editor"},{"name":"Adriane Marfiak","id":"nm0546552","role":"sound effects editor"},{"name":"Gary Macheel","id":"nm0532573","role":"sound effects editor"},{"name":"Lou Thomas","id":"nm0859176","role":"sound effects editor"},{"name":"Richard S. Steele","id":"nm0824650","role":"sound effects editor"}]}]}]},{"award":"Visual Effects Society Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated VES Award","categories":[{"category":"Outstanding Compositing in a Broadcast Program","names":[{"name":"Greg Groenekamp","id":"nm0342875","role":null},{"name":"Joel Merritt","id":"nm0581422","role":null},{"name":"Mamie McCall","id":"nm0564662","role":null}]}]}]},{"award":"Writers Guild of America, USA 2006","titlesAwards":[{"titleAwardOutcome":"Nominated WGA Award (TV)","categories":[{"category":"Long Form - Original","names":[{"name":"David N. Titcher","id":"nm0864435","role":null}]}]}]}],"votes":"14,774","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0009512","name":"TNT"},{"idCompany":"co0003899","name":"Electric Entertainment"},{"idCompany":"co0137385","name":"ApolloProScreen Filmproduktion"}],"keywords":{"keywords":["library","martial arts","student","spear","librarian","fight","spear of destiny","colon in title","pandora's box","unlikely hero","pistol","violence","treasure map","treasure hunt","treasure hunter","first part","part of series","quest","brawl","fistfight","train","jungle","tough guy","action hero","adventure hero","hero","adventurer","sensuality","kiss","kissing while having sex","sex","femme fatale","elevator","amazon","airplane","bridge collapse","waterfall","waltz","video surveillance","university","university professor","thrown from an airplane","tattoo","stewardess","star gazing","slow motion scene","secret passage","pyramid","presumed dead","post it","portrait","pendulum","parachute","nerd","museum","mother son relationship","machete","love at first sight","kicked in the face","jumping from height","job interview","impalement","hotel room","girl fight","genius","geek","falling from height","ex marine","ex boyfriend","dance","conspiracy","condor","cgi","campfire","butterfly","business trip","burglary","buddhist temple","buddhist monk","bookworm","booby trap","blind date","bird cage","asian woman","archeologist","ancient sword","amazon river"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:58:16"}}