{"data":{"movies":[{"title":"Kinky Boots","originalTitle":"","year":"2005","releaseDate":"20060526","directors":[{"name":"Julian Jarrold","id":"nm0418982"}],"writers":[{"name":"Geoff Deane","id":"nm0213017"},{"name":"Tim Firth","id":"nm0278759"}],"runtime":"107 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5OTg0NDEyNV5BMl5BanBnXkFtZTcwNDQwOTMzMQ@@._V1.jpg","countries":["USA","UK"],"languages":["English"],"genres":["Comedy","Drama","Music"],"plot":"Charles Price may have grown up with his father in the family shoe business, but he never thought that he would take his father's place. Yet, the untimely death of his father places him in that position, only to learn that Price & Sons Shoes is failing. While in despair at his failed attempts to save the business, Charles has a chance encounter with the flamboyant drag queen cabaret singer, Lola. Her complaints about the inadequate footwear for her work combined with one of Charles' ex-employees, Lauren, leads to a suggestion to change the product to create a desperate chance to save the business: make men's fetish footwear. Lola is convinced to be their footwear designer and the transition begins. Now this disparate lot must struggle at this unorthodox idea while dealing with both the prejudice of the staff, Lola's discomfort in the small town and the selfish manipulation of Charles' greedy fiancée who cannot see the greater good in Charles' dream.","simplePlot":"A drag queen comes to the rescue of a man who, after inheriting his father's shoe factory, needs to diversify his product if he wants to keep the business afloat.","actors":[{"actorName":"Joel Edgerton","urlProfile":"http://www.imdb.com/name/nm0249291","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0ODI1ODk4NzdeQTJeQWpwZ15BbWU3MDkwNjkzOTY@._V1._SX214_SY317_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 June 1974","placeOfBirth":" Blacktown, New South Wales, Australia","height":"5' 11\" (1.8 m)","bio":"Joel Edgerton was born on June 23, 1974 in Blacktown, New South Wales, Australia, to Marianne and Michael Edgerton, who is a solicitor and property developer. His brother is filmmaker Nash Edgerton. He went to Hills Grammar School in the Western Suburbs of Sydney, and after leaving, he attended Nepean Drama School in 1994. Joel has done many projects on stage and off, but most people will recognize him from his work on the Australian television series The Secret Life of Us (2001), in which he played William McGill. This gave him his first big break through in the television industry. For this role, he was nominated in 2001 for an AFI Award. As well as \"The Secret Life of Us\", he has also appeared in other television projects such as The Three Stooges (2000), Dossa and Joe (2002), Secret Men's Business (1999), Never Tell Me Never (1998) and Saturn's Return (2001). Joel has done a lot of work on the theatrical stage having played King Henry in \"Henry V\", Prince Hal in \"Henry III\", and others including \"Road\", \"Third World Blues\" and \"Dead White Males\". As well as acting, he has also starred, co-written and produced the short movie Bloodlock (1998). His first international break came from when he played Uncle Owen Lars in Star Wars: Episode II - Attack of the Clones (2002). Since then, he has also starred in Ned Kelly (2003), King Arthur (2004), Star Wars: Episode III - Revenge of the Sith (2005) and Kinky Boots (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0ODI1ODk4NzdeQTJeQWpwZ15BbWU3MDkwNjkzOTY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0249291","name":"Joel Edgerton","idIMDB":"nm0249291"},"actorId":"nm0249291","character":"Charlie","urlCharacter":"http://www.imdb.com/character/ch0286372","main":true},{"actorName":"Chiwetel Ejiofor","urlProfile":"http://www.imdb.com/name/nm0252230","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA5MDEyMTY3Nl5BMl5BanBnXkFtZTgwODQ0MjcxMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 July 1977","placeOfBirth":" Forest Gate, London, England, UK","height":"5' 10\" (1.78 m)","bio":"English actor Chiwetel Ejiofor is renowned for his portrayal of Solomon Northup in 12 Years a Slave (2013), for which he received Academy Award and Golden Globe nominations, along with the BAFTA Award for Best Actor. He is also known for playing Okwe in Dirty Pretty Things (2002), the Operative in Serenity (2005), Lola in Kinky Boots (2005), Luke in Children of Men (2006), Dr. Adrian Helmsley in 2012 (2009) and Dr. Vincent Kapoor in The Martian (2015). Chiwetelu Umeadi Ejiofor was born on July 10, 1977 in Forest Gate, London, England, to Nigerian parents, Obiajulu (Okaford), a pharmacist, and Arinze Ejiofor, a doctor. Chiwetel attended Dulwich College in South-East London. By the age of 13 he was appearing in numerous school and National Youth Theatre productions and subsequently attended the London Academy of Music and Dramatic Arts. In 1996 Ejiofor caught the attention of Steven Spielberg who cast him in the critically acclaimed Amistad (1997) alongside Morgan Freeman and Anthony Hopkins. He has since been seen on the big screen in numerous features including Stephen Frears' Dirty Pretty Things (2002) (for which he won Best Actor at the British Independent Film Awards, the Evening Standard Film Awards, and the San Diego Film Critics Society Awards), Love Actually (2003), Woody Allen's Melinda and Melinda (2004), Kinky Boots (2005), Inside Man (2006), Children of Men (2006), American Gangster (2007), and Talk to Me (2007), for which his performance won him an Independent Spirit Award for Best Supporting Actor. Ejiofor has balanced his film and television commitments with a number of prestigious stage productions. In 2008 his performance in the title role of Michael Grandage's \"Othello\" at the Donmar Warehouse alongside Ewan McGregor was unanimously commended and won him best actor at the 2008 Olivier and Evening Standard Theatre Awards. He also received nominations in the South Bank Show Awards and the What's On Stage Theatregoers' Choice Awards in 2009. His other stage parts include Roger Michell's \"Blue/Orange\" in 2000 which received an Olivier Award for Best Play, and the same year Tim Supple's \"Romeo and Juliet\" in which Ejiofor took the title role. Following his television debut in 1996 in Screen Two: Deadly Voyage (1996), Ejiofor has complimented his film and theatre work on the small screen in productions including Murder in Mind (2001), created by the award-winning writer Anthony Horowitz, Trust (2003), Twelfth Night, or What You Will (2003), and Canterbury Tales (2003). His television appearance in 2006's hard hitting emotional drama Tsunami: The Aftermath (2006)alongside Toni Collette, Sophie Okonedo and Tim Roth earned him a nomination for a Golden Globe Award as well as an NAACP Image award. Ejiofor also appeared in such notable films as Endgame (2009), Channel 4's moving drama set in South Africa for which his performance earned him a Golden Globe nomination for Best Performance by an Actor in a Miniseries; Roland Emmerich's action feature 2012 (2009), opposite John Cusack, Danny Glover, and Thandie Newton; and Salt (2010), opposite Angelina Jolie and Liev Schreiber. In 2013, he starred in Half of a Yellow Sun (2013) and 12 Years a Slave (2013), receiving an Academy Award nomination for Best Actor for the latter film.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA5MDEyMTY3Nl5BMl5BanBnXkFtZTgwODQ0MjcxMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0252230","name":"Chiwetel Ejiofor","idIMDB":"nm0252230"},"actorId":"nm0252230","character":"Lola","urlCharacter":"http://www.imdb.com/character/ch0050092","main":true},{"actorName":"Sarah-Jane Potts","urlProfile":"http://www.imdb.com/name/nm0005322","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MDYyNTAxNF5BMl5BanBnXkFtZTYwMTM3Mzcy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 August 1976","placeOfBirth":" Bradford, West Yorkshire, England, UK","height":"5' 5\" (1.65 m)","bio":"Sarah-Jane Potts was born on August 30, 1976 in Bradford, West Yorkshire, England. She is an actress, known for Kinky Boots (2005), Holby City (1999) and The Chameleon (2015). She has been married to Joseph Millson since December 31, 2013. She was previously married to Tony Denman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MDYyNTAxNF5BMl5BanBnXkFtZTYwMTM3Mzcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005322","name":"Sarah-Jane Potts","idIMDB":"nm0005322"},"actorId":"nm0005322","character":"Lauren","urlCharacter":"http://www.imdb.com/character/ch0286375","main":true},{"actorName":"Nick Frost","urlProfile":"http://www.imdb.com/name/nm0296545","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3Mjg1MzU0M15BMl5BanBnXkFtZTcwNTM1MTE2MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 March 1972","placeOfBirth":" Hornchurch, Essex, England, UK","birthName":"Nicholas John Frost","height":"5' 8\" (1.73 m)","bio":"Nick Frost is an English actor, screenwriter and comedian. He is known for his work in the series of British comedic genre films The Three Flavours Cornetto trilogy, Shaun of the Dead (2004), Hot Fuzz (2007), and The World's End (2013). He also co-starred in Paul (2011), with frequent collaborator and friend Simon Pegg. Nicholas John \"Nick\" Frost is good friends with Simon Pegg and they have appeared alongside each other in several Movies. He resides with his half-Swedish wife, production executive Christina in St Margaret s, London. He previously lived in Fins-bury Park, which was also the filming location for Shaun of the Dead. In a 2005 interview, Frost stated that he was brought up as a Catholic. He is a supporter of West Ham United, as well as being a rugby player, formerly playing for Barking RFC. On 22 June 2011, Frost's wife gave birth to a son.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3Mjg1MzU0M15BMl5BanBnXkFtZTcwNTM1MTE2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0296545","name":"Nick Frost","idIMDB":"nm0296545"},"actorId":"nm0296545","character":"Don","urlCharacter":"http://www.imdb.com/character/ch0286376","main":true},{"actorName":"Linda Bassett","urlProfile":"http://www.imdb.com/name/nm0060221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMzQ2ODkzMF5BMl5BanBnXkFtZTcwNjM1Mzk5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1950","placeOfBirth":" Pluckley, Kent, England, UK","bio":"Linda Bassett was born in the Kentish village of Pluckley - location for the television series The Darling Buds of May (1991). She was brought up in Pimlico, South London, by her typist mother and police officer father. She became interested in acting as a child when she was frequently taken to see plays in London, most notably at the Old Vic, the famous classical theater. On leaving school, Linda went to work at the Old Vic as an usherette and catering manager, before going to read English at Leeds University. However, she dropped out after a year and became involved in a local drama group which put on plays in community-based locations, such as schools. She regards this as her theatrical schooling, having had no formal training. She made her London stage debut at the age of thirty-two in 1982 and, in 1991, she joined the Royal Shakespeare Company. Although she was a well-regarded stage performer, it was the 1999 film version of the play East Is East (1999) (in which she had been an original stage cast member) which brought her to a larger audience and, throughout the 2000s, she has been a familiar face in a variety of films and television series. In the late 1980s, she returned to live in Pluckley.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMzQ2ODkzMF5BMl5BanBnXkFtZTcwNjM1Mzk5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0060221","name":"Linda Bassett","idIMDB":"nm0060221"},"actorId":"nm0060221","character":"Melanie","urlCharacter":"http://www.imdb.com/character/ch0286377","main":true},{"actorName":"Jemima Rooper","urlProfile":"http://www.imdb.com/name/nm0740383","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5Nzk3MTY4MF5BMl5BanBnXkFtZTgwMTEwNzQyNjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 October 1981","placeOfBirth":" Hammersmith, London, England, UK","height":"5' 3\" (1.6 m)","bio":"She passed her 9 GCSEs with A* and A grades in between working for several terms away from school on the Famous Five. From there she went to 6th form college where she got 3 grade A levels and an academic prize in the Arts. Her parents are both freelance broadcasters and she has two cousins who are young film directors - one of them the promising Serbian director Stevan Filipovic.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5Nzk3MTY4MF5BMl5BanBnXkFtZTgwMTEwNzQyNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0740383","name":"Jemima Rooper","idIMDB":"nm0740383"},"actorId":"nm0740383","character":"Nicola","urlCharacter":"http://www.imdb.com/character/ch0286383","main":true},{"actorName":"Robert Pugh","urlProfile":"http://www.imdb.com/name/nm0700059","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzZiNjZiMGItNTQ2Yi00MGU3LWFjMTktNzlmNDFlYzA3MjY3XkEyXkFqcGdeQXVyMjk3NTUyOTc@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1950","placeOfBirth":" Aberdare, Glamorgan, Wales, UK","bio":"Robert Pugh grew up in a village called the Tynte, a small mining village set just outside Pontypridd, where Tom Jones was raised. The Tynte is a few miles in between Aberdare and Pontypridd about twenty miles north of Cardiff. He attended the Rose Buford acting school, from which he graduated in 1976.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzZiNjZiMGItNTQ2Yi00MGU3LWFjMTktNzlmNDFlYzA3MjY3XkEyXkFqcGdeQXVyMjk3NTUyOTc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0700059","name":"Robert Pugh","idIMDB":"nm0700059"},"actorId":"nm0700059","character":"Harold Price","urlCharacter":"http://www.imdb.com/character/ch0286381","main":true},{"actorName":"Ewan Hooper","urlProfile":"http://www.imdb.com/name/nm0393739","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWI2MWY0ZTctY2Y2Mi00OTk3LWIyM2QtOTNhMzU3NTAxZDdmXkEyXkFqcGdeQXVyMzAwOTU1MTk@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 October 1935","placeOfBirth":" Dundee, Tayside, Scotland, UK","bio":"Ewan Hooper was born on October 23, 1935 in Dundee, Tayside, Scotland. He is an actor and writer, known for Kinky Boots (2005), Dracula Has Risen from the Grave (1968) and Personal Services (1987).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWI2MWY0ZTctY2Y2Mi00OTk3LWIyM2QtOTNhMzU3NTAxZDdmXkEyXkFqcGdeQXVyMzAwOTU1MTk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0393739","name":"Ewan Hooper","idIMDB":"nm0393739"},"actorId":"nm0393739","character":"George","urlCharacter":"http://www.imdb.com/character/ch0286378","main":true},{"actorName":"Stephen Marcus","urlProfile":"http://www.imdb.com/name/nm0007154","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTM1M2IzOTMtNzE5Yi00MDhlLTg2NTYtYzZjMjcwYWFiNjdhL2ltYWdlXkEyXkFqcGdeQXVyMjA2NTU0ODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 June 1962","placeOfBirth":" Portsmouth, Hampshire, England, UK","birthName":"Stephen Mark Scott","height":"6' 4\" (1.93 m)","bio":"Stephen became an actor in 1984 after 3 years of training at Arts Educational Schools in London; he spent the first 6 months of his career touring round London parks and schools in \"Robin Hood & The Tree Trick\" which was quickly followed by his first film role as Moose in the cult film \"My Beautiful Laundrette\". After a few years working in Theatre, Commercials and supporting roles on TV he joined the cast of fledgling comedy \"Birds of a Feather\" as Dave, the lover of Sharon (Pauline Quirke). He was originally in 2 episodes but made such an impact with the fans that he was bought back for the third series. When he met Peter Richardson in Sarah Stockbridge's garden Peter asked him if he was available to do a day's work on \"The Glam Metal Detectives\" for the Comic Strip\", 1 day became 3 months and he played literally hundreds of characters. A year of commercials introduced him to director Peter Chelsom, Peter cast him right away as Gordon in \"Hear my Song\" opposite Ned Beatty. Then there were a couple of years getting great roles on British TV, in the likes of \"The Hot Dog Wars\", \"Dangerfield\" and \"Kavanagh QC\" and \"Our Friends in the North\" opposite Malcolm McDowell and Daniel Craig. His movie career was moving alongside this at quite a pace with roles opposite Timothy Dalton in \"The Beautician and the Beast\", Robert Englund in \"The Killer Tongue\" and Richard Harris in \"Savage Hearts\". In 1996 his agent set up a meeting on a small low budget movie with an unknown director named Guy Ritchie; Guy offered him the role of Nick the Greek in his movie \"Lock Stock and 2 Smoking Barrels\". 3 years later the film it was released and became the biggest British movie in the last 20 years and launched the careers of Nick Moran, Vinnie Jones, Guy Ritchie, Jason Statham, and Mathew Vaughn. \"Lock Stock and 2 Smoking Barrels\" led on to more movies and Hollywood started knocking on the door. Alan Parker had him do a small role in \"Angela's Ashes\", Philip Kaufman asked him to play Bouchon in \"Quills\" alongside Kate Winslett, Michael Caine, Joaquin Phoenix and Geoffrey Rush. Richard Eyre called on him twice, for \"Iris\" opposite Judy Dench and in \"Complete Female Stage Beauty\" with Clare Danes. This was followed by the role of Ted Ray in \"The Greatest Game Ever Played\" directed by Bill Paxton, Bill had seen his work and after speaking to his agent he called Stephen from his car phone (very Hollywood) and offered him the part. Then the role of Big Mike in Kinky Boots came along. Alongside a very successful movie career he did several TV series for the USA, Canada and the UK. \"Starhunter 2300\" in which he played Rudolpho De Luna, he played the co-lead in the BBC series \"Cavegirl\". he played Banjo and Broadman in the adaptations of Terry Prachett's \"Hogfather\" and \"The Colour of Magic\" for Sky TV, plus the two 20th anniversary episodes of \"Casualty\" and regular roles in \"Kingdom\" (with Stephen Fry) and \"Larkrise to Candleford\". More recently he has done two films with the Warchowski Brothers - \"Speed Racer\" and \"Ninja Assassin\". He is married to the most beautiful woman in the world, Sarah and they have 2 small dogs, Fry and Ronnie. He has 2 main hobbies, he loves to play golf (at which he is terrible) and he loves to coach American Football (which he does for the London Olympians). He also runs a guided walking tour taking in gangster film and real life locations.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTM1M2IzOTMtNzE5Yi00MDhlLTg2NTYtYzZjMjcwYWFiNjdhL2ltYWdlXkEyXkFqcGdeQXVyMjA2NTU0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0007154","name":"Stephen Marcus","idIMDB":"nm0007154"},"actorId":"nm0007154","character":"Big Mike","urlCharacter":"http://www.imdb.com/character/ch0286396","main":true},{"actorName":"Mona Hammond","urlProfile":"http://www.imdb.com/name/nm0358747","urlPhoto":"","biography":{"dateOfBirth":"1931","placeOfBirth":" Clarendon, Jamaica, British West Indies [now Jamaica]","birthName":"Mavis Chin","bio":"Mona Hammond was born Mavis Chin to a Chinese father and Jamaican mother. She came to Britain in 1959 on a scholarship to work with an architects firm but was soon involved in black theatre productions with contemporaries such as Lloyd and Barry Reckord and Charles Hyatt, under the name Mona Chin. In 1959 she won a scholarship to RADA. Initially known as a stage actress - she played Lady Macbeth in an all-black version of the Shakespeare play at London's Roundhouse in 1970 - she went to co-found the Talawa Theatre Group with fellow actresses Yvonne Brewster and Carmen Munroe. The group performs black versions of plays written for whites as well as staging original Afro-Caribbean productions. In 2005 she was awarded an O.B.E. for services to drama. Having played in the TV soap 'Eastenders' for some years she has a recurring occasional role as a white vicar's outspoken ex-mother-in-law in radio soap 'The Archers.'","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0358747","name":"Mona Hammond","idIMDB":"nm0358747"},"actorId":"nm0358747","character":"Pat","urlCharacter":"http://www.imdb.com/character/ch0286384","main":true},{"actorName":"Kellie Bright","urlProfile":"http://www.imdb.com/name/nm0109156","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTc3ODE0MF5BMl5BanBnXkFtZTcwODc2NTAwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 July 1976","placeOfBirth":" Brentwood, Essex, England, UK","birthName":"Kelly Denise Bright","height":"5' 1\" (1.55 m)","bio":"Kellie Bright was born on July 1, 1976 in Brentwood, Essex, England as Kelly Denise Bright. She is an actress, known for EastEnders (1985), The Upper Hand (1990) and Kinky Boots (2005). She has been married to Paul Stocker since July 5, 2014. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTc3ODE0MF5BMl5BanBnXkFtZTcwODc2NTAwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0109156","name":"Kellie Bright","idIMDB":"nm0109156"},"actorId":"nm0109156","character":"Jeannie","urlCharacter":"http://www.imdb.com/character/ch0286386","main":true},{"actorName":"Joanna Scanlan","urlProfile":"http://www.imdb.com/name/nm0768936","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MTgxMjMwN15BMl5BanBnXkFtZTcwNTY0MjkxOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 October 1961","placeOfBirth":" West Kirby, Merseyside, England, UK","birthName":"Joanna Marion Scanlan","height":"5' 1\" (1.55 m)","bio":"Joanna Scanlan was born on October 27, 1961 in West Kirby, Merseyside, England as Joanna Marion Scanlan. She is an actress and writer, known for Bridget Jones Baby (2016), The Thick of It (2005) and Getting On (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MTgxMjMwN15BMl5BanBnXkFtZTcwNTY0MjkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0768936","name":"Joanna Scanlan","idIMDB":"nm0768936"},"actorId":"nm0768936","character":"Trish","urlCharacter":"http://www.imdb.com/character/ch0286387","main":true},{"actorName":"Geoffrey Streatfeild","urlProfile":"http://www.imdb.com/name/nm1127608","urlPhoto":"","biography":{"dateOfBirth":"1975","placeOfBirth":" England, UK","height":"5' 11\" (1.8 m)","bio":"Geoffrey Streatfeild was born in 1975 in England. He is an actor, known for Rush (2013), Match Point (2005) and MI-5 (2015). He has been married to Nikki Amuka-Bird since September 2003.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1127608","name":"Geoffrey Streatfeild","idIMDB":"nm1127608"},"actorId":"nm1127608","character":"Richard Bailey","urlCharacter":"http://www.imdb.com/character/ch0286388","main":true},{"actorName":"Leo Bill","urlProfile":"http://www.imdb.com/name/nm1095324","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTU3NjEyNl5BMl5BanBnXkFtZTcwMjA1Njk1MQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 August 1980","placeOfBirth":" Warwickshire, England, UK","height":"6' (1.83 m)","bio":"Leo Bill was born on August 31, 1980 in Warwickshire, England. He is an actor, known for 28 Days Later... (2002), Alice in Wonderland (2010) and The Girl with the Dragon Tattoo (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTU3NjEyNl5BMl5BanBnXkFtZTcwMjA1Njk1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1095324","name":"Leo Bill","idIMDB":"nm1095324"},"actorId":"nm1095324","character":"Harry Sampson","urlCharacter":"http://www.imdb.com/character/ch0286397","main":true},{"actorName":"Gwenllian Davies","urlProfile":"http://www.imdb.com/name/nm0203738","urlPhoto":"","biography":{"birthName":"Sarah Gwenllian Davies","bio":"Gwenllian Davies was born in the UK as Sarah Gwenllian Davies. She was an actress, known for Kinky Boots (2005), Onegin (1999) and Mrs Caldicot's Cabbage War (2002). She died on July 24, 2007 in the UK.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0203738","name":"Gwenllian Davies","idIMDB":"nm0203738"},"actorId":"nm0203738","character":"Mrs. Cobb","urlCharacter":"http://www.imdb.com/character/ch0286389","main":true}],"seasons":[],"idIMDB":"tt0434124","urlIMDB":"http://www.imdb.com/title/tt0434124","business":{"budget":null,"openingWeekend":[{"money":"$77,529","country":"USA","day":"16","month":"04","year":"2006","remarks":"9 Screens"},{"money":"£623,163","country":"UK","day":"09","month":"10","year":"2005","remarks":"292 Screens"}],"gross":[{"money":"$1,819,454","country":"USA","day":"30","month":"07","year":"2006","remarks":""},{"money":"$1,811,338","country":"USA","day":"23","month":"07","year":"2006","remarks":""},{"money":"$1,798,440","country":"USA","day":"16","month":"07","year":"2006","remarks":""},{"money":"$1,781,471","country":"USA","day":"09","month":"07","year":"2006","remarks":""},{"money":"$1,765,398","country":"USA","day":"02","month":"07","year":"2006","remarks":""},{"money":"$1,734,569","country":"USA","day":"25","month":"06","year":"2006","remarks":""},{"money":"$1,692,769","country":"USA","day":"18","month":"06","year":"2006","remarks":""},{"money":"$1,627,333","country":"USA","day":"11","month":"06","year":"2006","remarks":""},{"money":"$1,505,547","country":"USA","day":"04","month":"06","year":"2006","remarks":""},{"money":"$1,349,623","country":"USA","day":"28","month":"05","year":"2006","remarks":""},{"money":"$1,089,805","country":"USA","day":"21","month":"05","year":"2006","remarks":""},{"money":"$860,512","country":"USA","day":"14","month":"05","year":"2006","remarks":""},{"money":"$616,158","country":"USA","day":"07","month":"05","year":"2006","remarks":""},{"money":"$405,196","country":"USA","day":"30","month":"04","year":"2006","remarks":""},{"money":"$218,574","country":"USA","day":"23","month":"04","year":"2006","remarks":""},{"money":"$77,529","country":"USA","day":"16","month":"04","year":"2006","remarks":""},{"money":"£3,003,284","country":"UK","day":"20","month":"11","year":"2005","remarks":""},{"money":"£2,919,076","country":"UK","day":"13","month":"11","year":"2005","remarks":""},{"money":"£2,588,087","country":"UK","day":"30","month":"10","year":"2005","remarks":""},{"money":"£2,122,342","country":"UK","day":"23","month":"10","year":"2005","remarks":""},{"money":"£1,505,295","country":"UK","day":"16","month":"10","year":"2005","remarks":""},{"money":"£623,163","country":"UK","day":"09","month":"10","year":"2005","remarks":""}],"weekendGross":[{"money":"$2,641","country":"USA","day":"30","month":"07","year":"2006","remarks":"12 Screens"},{"money":"$5,510","country":"USA","day":"23","month":"07","year":"2006","remarks":"13 Screens"},{"money":"$9,508","country":"USA","day":"16","month":"07","year":"2006","remarks":"17 Screens"},{"money":"$10,568","country":"USA","day":"09","month":"07","year":"2006","remarks":""},{"money":"$12,386","country":"USA","day":"02","month":"07","year":"2006","remarks":"24 Screens"},{"money":"$20,552","country":"USA","day":"25","month":"06","year":"2006","remarks":"31 Screens"},{"money":"$27,783","country":"USA","day":"18","month":"06","year":"2006","remarks":"52 Screens"},{"money":"$71,547","country":"USA","day":"11","month":"06","year":"2006","remarks":"95 Screens"},{"money":"$109,595","country":"USA","day":"04","month":"06","year":"2006","remarks":"105 Screens"},{"money":"$202,025","country":"USA","day":"28","month":"05","year":"2006","remarks":""},{"money":"$158,128","country":"USA","day":"21","month":"05","year":"2006","remarks":"110 Screens"},{"money":"$178,966","country":"USA","day":"14","month":"05","year":"2006","remarks":"86 Screens"},{"money":"$163,820","country":"USA","day":"07","month":"05","year":"2006","remarks":"63 Screens"},{"money":"$142,080","country":"USA","day":"30","month":"04","year":"2006","remarks":"40 Screens"},{"money":"$116,120","country":"USA","day":"23","month":"04","year":"2006","remarks":"26 Screens"},{"money":"$77,529","country":"USA","day":"16","month":"04","year":"2006","remarks":"9 Screens"},{"money":"£37,079","country":"UK","day":"20","month":"11","year":"2005","remarks":"83 Screens"},{"money":"£92,138","country":"UK","day":"13","month":"11","year":"2005","remarks":"140 Screens"},{"money":"£187,084","country":"UK","day":"30","month":"10","year":"2005","remarks":"195 Screens"},{"money":"£321,099","country":"UK","day":"23","month":"10","year":"2005","remarks":"249 Screens"},{"money":"£506,599","country":"UK","day":"16","month":"10","year":"2005","remarks":"284 Screens"},{"money":"£623,163","country":"UK","day":"09","month":"10","year":"2005","remarks":"292 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"22","month":"11","year":"2004","remarks":null},null],"copyrightHolder":"copyright © 2005 Price Productions Limited. (on print)"},"technical":{"runtime":["1 hr 47 min (107 min)"],"soundMix":["SDDS","Dolby Digital","DTS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["Technicolor, London, UK (prints)","DeLuxe"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"7.1","metascore":"57","filmingLocations":[{"location":"Wellingborough, Northamptonshire, England, UK"}],"rated":"PG-13","awards":[{"award":"Golden Globes, USA 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Performance by an Actor in a Motion Picture - Comedy or Musical","names":[{"name":"Chiwetel Ejiofor","id":"nm0252230","role":null}]}]}]},{"award":"Black Movie Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Black Movie Award","categories":[{"category":"Outstanding Performance by an Actor in a Leading Role","names":[{"name":"Chiwetel Ejiofor","id":"nm0252230","role":null}]}]}]},{"award":"Black Reel Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Black Reel","categories":[{"category":"Best Supporting Actor","names":[{"name":"Chiwetel Ejiofor","id":"nm0252230","role":null}]}]}]},{"award":"British Independent Film Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated British Independent Film Award","categories":[{"category":"Best Actor","names":[{"name":"Chiwetel Ejiofor","id":"nm0252230","role":null}]},{"category":"Best Screenplay","names":[{"name":"Geoff Deane","id":"nm0213017","role":null},{"name":"Tim Firth","id":"nm0278759","role":null}]}]},{"titleAwardOutcome":"Nominated Douglas Hickox Award","categories":[{"category":"","names":[{"name":"Julian Jarrold","id":"nm0418982","role":null}]}]}]},{"award":"Florida Film Festival 2006","titlesAwards":[{"titleAwardOutcome":"Won Audience Award","categories":[{"category":"Best International Feature","names":[{"name":"Julian Jarrold","id":"nm0418982","role":null}]}]}]},{"award":"London Critics Circle Film Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated ALFS Award","categories":[{"category":"British Actor of the Year","names":[{"name":"Chiwetel Ejiofor","id":"nm0252230","role":null}]}]}]}],"votes":"14,608","type":"Movie","companyCreditsSimple":[{"idCompany":"co0022594","name":"Miramax"},{"idCompany":"co0094401","name":"Harbour Pictures"},{"idCompany":"co0283185","name":"Price Productions"}],"keywords":{"keywords":["drag queen","homophobia","gender roles","gender bending","gender bender","gay slur","gay interest","gay bashing","stiletto heels","singing","high heels","crossdresser","shoe","model","boots","factory","northampton","family business","singer","small town","cabaret","flashback","fired from the job","soho london","musical number","outcast","new market","london england","layoff","wig","shoemaker","shoe store","shoe factory","shoe designer","pub","manufacturer","lost shoe","father son relationship","employer employee relationship","businessman","black man","arm wrestling","transvestite","milan italy","fiancee","fetish fashion","fashion show","small business","death of father","based on true story","redundancy","footwear","contract","bloody mary the drink","nightclub","bankruptcy","drunkenness","whip","weight training","underwear","train","song","sex","sewing machine","seaside","real estate developer","railway station","mortgage","microphone","metrosexual","marketing","make up","machinery","labor","homosexual","family relationships","drinking","dress","dressing room","dancing","dancer","craftsman","costume designer","computer","catwalk","cafe","burgundy","boxer","boardwalk","bar","female to male footsie playing","footsie under the table","website","waitress","waiter","vodka","urination","urinal","toast","telephone call","tears","montage","mirror","men's toilet","marriage","marriage engagement","lung cancer","lucky charm","landlady","knocked out","kiss","hermaphrodite","crying","coffin","cleaning lady","cinderella","cemetery","cell phone","burial","bra","bench","beggar","beach","apology"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:31:09"}}