{"data":{"movies":[{"title":"The Giver","originalTitle":"","year":"2014","releaseDate":"20140815","directors":[{"name":"Phillip Noyce","id":"nm0637518"}],"writers":[{"name":"Michael Mitnick","id":"nm2276729"},{"name":"Robert B. Weide","id":"nm0004332"}],"runtime":"97 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MTIxMjg2Ml5BMl5BanBnXkFtZTgwMjUyNzgwMjE@._V1.jpg","countries":["South Africa","Canada","USA"],"languages":["English"],"genres":["Drama","Romance","Sci-Fi"],"plot":"After The Ruin, a colorless equalitarian society is formed without memories and everyone follows rules established by the Chief Elder and the Elders. The population uses drugs to stay happy and on the day of the graduation, the teenagers leave their childhood and are assigned to a career chosen by the Elders. Jonas lives with his parents and has two best friends, Fiona and Asher, and he feels different from his friends. He is assigned to be the Receiver of Memories and he is trained by his mentor, The Giver, who gives memories of the world before The Ruin. Jonas learns emotions such as love and fear and the concept of family. When he discovers that the baby Gabriel that he loves as a brother will be eliminated, he decides to change his society but the Chief Elder will do anything to stop him.","simplePlot":"In a seemingly perfect community, without war, pain, suffering, differences or choice, a young boy is chosen to learn from an elderly man about the true pain and pleasure of the \"real\" world.","actors":[{"actorName":"Jeff Bridges","urlProfile":"http://www.imdb.com/name/nm0000313","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU1NjM4MDYzMl5BMl5BanBnXkFtZTcwMjIwMjMyMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 December 1949","placeOfBirth":" Los Angeles, California, USA","birthName":"Jeffrey Leon Bridges","height":"6' 1\" (1.85 m)","bio":"Jeffrey Leon Bridges was born on December 4, 1949 in Los Angeles, California, the son of well-known film and TV star Lloyd Bridges and his long-time wife Dorothy Dean Bridges (née Simpson). He grew up amid the happening Hollywood scene with big brother Beau Bridges. Both boys popped up, without billing, alongside their mother in the film The Company She Keeps (1951), and appeared on occasion with their famous dad on his popular underwater TV series Sea Hunt (1958) while growing up. At age 14, Jeff toured with his father in a stage production of \"Anniversary Waltz\". The \"troublesome teen\" years proved just that for Jeff and his parents were compelled at one point to intervene when problems with drugs and marijuana got out of hand. He recovered and began shaping his nascent young adult career appearing on TV as a younger version of his father in the acclaimed TV- movie Silent Night, Lonely Night (1969), and in the strange Burgess Meredith film Le 3eme oeil (1970). Following fine notices for his portrayal of a white student caught up in the racially-themed Halls of Anger (1970), his career-maker arrived just a year later when he earned a coming-of-age role in the critically-acclaimed ensemble film The Last Picture Show (1971). The Peter Bogdanovich- directed film made stars out off its young leads (Bridges, Timothy Bottoms, Cybill Shepherd) and Oscar winners out of its older cast (Ben Johnson, Cloris Leachman). The part of Duane Jackson, for which Jeff received his first Oscar-nomination (for \"best supporting actor\"), set the tone for the types of roles Jeff would acquaint himself with his fans -- rambling, reckless, rascally and usually unpredictable). Owning a casual carefree handsomeness and armed with a perpetual grin and sly charm, he started immediately on an intriguing 70s sojourn into offbeat filming. Chief among them were his boxer on his way up opposite a declining Stacy Keach in Fat City (1972); his Civil War-era conman in the western Bad Company (1972); his redneck stock car racer in The Last American Hero (1973); his young student anarchist opposite a stellar veteran cast in Eugene O'Neill's The Iceman Cometh (1973); his bank-robbing (also Oscar-nominated) sidekick to Clint Eastwood in Thunderbolt and Lightfoot (1974); his aimless cattle rustler in Rancho Deluxe (1975); his low-level western writer who wants to be a real-life cowboy in Hearts of the West (1975); and his brother of an assassinated President who pursues leads to the crime in Winter Kills (1979). All are simply marvelous characters that should have propelled him to the very top rungs of stardom...but strangely didn't. Perhaps it was his trademark ease and naturalistic approach that made him somewhat under appreciated at that time when Hollywood was run by a Dustin Hoffman, Robert De Niro and Al Pacino-like intensity. Neverthless, Jeff continued to be a scene-stealing favorite into the next decade, notably as the video game programmer in the 1982 science-fiction cult classic TRON (1982), and the struggling musician brother vying with brother Beau Bridges over the attentions of sexy singer Michelle Pfeiffer in The Fabulous Baker Boys (1989). Jeff became a third-time Oscar nominee with his highly intriguing (and strangely sexy) portrayal of a blank-faced alien in Starman (1984), and earned even higher regard as the ever-optimistic inventor Preston Tucker in Tucker: The Man and His Dream (1988). Since then Jeff has continued to pour on the Bridges magic on film. Few enjoy such an enduring popularity while maintaining equal respect with the critics. The Fisher King (1991), American Heart (1992), Fearless (1993), The Big Lebowski (1998) (now a cult phenomenon) and The Contender (2000) (which gave him a fourth Oscar nomination) are prime examples. More recently he seized the moment as a bald-pated villain as Robert Downey Jr.'s nemesis in Iron Man (2008) and then, at age 60, he capped his rewarding career by winning the elusive Oscar, plus the Golden Globe and Screen Actor Guild awards (among many others), for his down-and-out country singer Bad Blake in Crazy Heart (2009). Bridges next starred in TRON: Legacy (2010), reprising one of his more famous roles, and received another Oscar nomination for Best Actor for his role in the Western remake True Grit (2010). In 2014, he co-produced and starred in an adaptation of the Lois Lowry science fiction drama The Giver (2014). Jeff has been married since 1977 to non-professional Susan Geston (they met on the set of Rancho Deluxe (1975)). The couple have three daughters, Isabelle (born 1981), Jessica (born 1983), and Hayley (born 1985). He hobbies as a photographer on and off his film sets, and has been known to play around as a cartoonist and pop musician. His ancestry is English, and smaller amounts of Scots-Irish (Northern Irish), Irish, Swiss-German, and German.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU1NjM4MDYzMl5BMl5BanBnXkFtZTcwMjIwMjMyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000313","name":"Jeff Bridges","nicknames":["The Dude"],"idIMDB":"nm0000313"},"actorId":"nm0000313","character":"The Giver","urlCharacter":"http://www.imdb.com/character/ch0401225","main":true},{"actorName":"Meryl Streep","urlProfile":"http://www.imdb.com/name/nm0000658","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4Mjk5MDExOF5BMl5BanBnXkFtZTcwOTU1MTMyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 June 1949","placeOfBirth":" Summit, New Jersey, USA","birthName":"Mary Louise Streep","height":"5' 6\" (1.68 m)","bio":"Considered by many critics to be the greatest living actress, Meryl Streep has been nominated for the Academy Award an astonishing 20 times, and has won it three times. Meryl was born Mary Louise Streep in 1949 in Summit, New Jersey, to Mary Wolf (Wilkinson), a commercial artist, and Harry William Streep, Jr., a pharmaceutical executive. Her father was of German and Swiss-German descent, and her mother had English, Irish, and German ancestry. Meryl's early performing ambitions leaned toward the opera. She became interested in acting while a student at Vassar and upon graduation she enrolled in the Yale School of Drama. She gave an outstanding performance in her first film role, Julia (1977), and the next year she was nominated for her first Oscar for her role in The Deer Hunter (1978). She went on to win the Academy Award for her performances in Kramer vs. Kramer (1979) and Sophie's Choice (1982), in which she gave a heart-wrenching portrayal of an inmate mother in a Nazi death camp. A perfectionist in her craft and meticulous and painstaking in her preparation for her roles, Meryl turned out a string of highly acclaimed performances over the next decade in great films like Silkwood (1983); Out of Africa (1985); Ironweed (1987); and A Cry in the Dark (1988). Her career declined slightly in the early 1990s as a result of her inability to find suitable parts, but she shot back to the top in 1995 with her performance as Clint Eastwood's married lover in The Bridges of Madison County (1995) and as the prodigal daughter in Marvin's Room (1996). In 1998 she made her first venture into the area of producing, and was the executive producer for the moving ...First Do No Harm (1997). A realist when she talks about her future years in film, she remarked that \"...no matter what happens, my work will stand...\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4Mjk5MDExOF5BMl5BanBnXkFtZTcwOTU1MTMyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000658","name":"Meryl Streep","idIMDB":"nm0000658"},"actorId":"nm0000658","character":"Chief Elder","urlCharacter":"http://www.imdb.com/character/ch0398700","main":true},{"actorName":"Brenton Thwaites","urlProfile":"http://www.imdb.com/name/nm4154798","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMTY3MjE5NF5BMl5BanBnXkFtZTcwNzM3NjU2Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1989","placeOfBirth":" Cairns, Queensland, Australia","height":"5' 11¼\" (1.81 m)","bio":"Brenton Thwaites is an Australian actor. He played Luke Gallagher on the Fox8 teen drama series SLiDE (2011) and Stu Henderson on the Australian soap opera hit Summer Bay (1988). His films include Blue Lagoon: The Awakening (2012), Oculus (2013), Maleficent (2014), and The Giver (2014). He starred in Gods of Egypt (2016) and will headline Pirates of the Caribbean: Dead Men Tell No Tales (2017), with Johnny Depp. Brenton was born in Cairns, Queensland, to Fiona Middleton and Peter Thwaites.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMTY3MjE5NF5BMl5BanBnXkFtZTcwNzM3NjU2Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4154798","name":"Brenton Thwaites","idIMDB":"nm4154798"},"actorId":"nm4154798","character":"Jonas","urlCharacter":"http://www.imdb.com/character/ch0396139","main":true},{"actorName":"Alexander Skarsgård","urlProfile":"http://www.imdb.com/name/nm0002907","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNTgxNTk0M15BMl5BanBnXkFtZTcwNzM5Mjc1OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1976","placeOfBirth":" Stockholm, Stockholms län, Sweden","birthName":"Alexander Johan Hjalmar Skarsgård","height":"6' 4½\" (1.94 m)","bio":"Alexander Johan Hjalmar Skarsgård was born in Stockholm, Sweden and is the eldest son of famed actor Stellan Skarsgård. Among his siblings are actors Gustaf Skarsgård, Bill Skarsgård, and Valter Skarsgård. For most of his formative years, his father was an acclaimed actor in Europe but had not yet achieved the international fame that came after his star turn in Breaking the Waves (1996). Young Alexander was raised under modest circumstances in a working-class Swedish neighborhood as his parents wanted their children to have as normal an upbringing as possible. He began his acting career at the age of eight and continued working in films and on Swedish television until he turned sixteen and decided acting was not the career for him. Life under a microscope lost its charm and perhaps due to the influence of My Skarsgård, his physician mother, he stopped working as an actor, to continue his education. Instead of continuing college, at the age of nineteen, he entered compulsory military service (military conscription). He used the time to contemplate his future. He studied at the Leeds Metropolitan University then moved to New York where he enrolled at Marymount Manhattan College to study theatre. After six months in New York, a romantic entanglement lured him back to Sweden but the relationship was short-lived. Despite having a broken heart, Alexander decided to stay in Sweden and, with a bit of life experience under his belt, began his acting career again. He appeared in a number of Swedish productions and became a star in his native country but was interested in broadening his horizons and working outside of Sweden. A visit to Los Angeles landed him both an agent and a part in the Ben Stiller movie, Zoolander (2001). After that Alexander returned to Sweden where he continued honing his acting in film and theatrical productions including \"Who's Afraid of Virginia Woolf?\" and \"Bloody Wedding\". He also co-wrote and co-directed an award-winning short, Att döda ett barn (2003), (To Kill a Child), which was shown at both the Tribeca and Cannes Film Festivals. His first big break was with the miniseries Generation Kill (2008). Alexander spent seven months broiling in the desert of Namibia but it was well worth it. His portrayal of Marine Sgt. Brad \"Iceman\" Colbert astonished critics and audiences, alike. Thanks to the writer's strike, after completing Generation Kill (2008), he was cast in the role of \"Eric Northman\", a 1,000-year-old Viking vampire on the hit series, True Blood (2008). The series was created by Alan Ball, the man behind Six Feet Under (2001). True Blood (2008) was adapted from the \"Sookie Stackhouse' novels by Charlaine Harris' and rode to success on quality scripts, great acting and the public's obsession with the vampire genre. In addition to True Blood (2008), which begins its third season in 2010, Alexander has a number of film projects in the works including the remake of Straw Dogs (2011), Melancholia (2011), written and directed by Lars von Trier, action Sci-Fi film, Battleship (2012), and The East (2013), directed by Zal Batmanglij.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNTgxNTk0M15BMl5BanBnXkFtZTcwNzM5Mjc1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002907","name":"Alexander Skarsgård","nicknames":["Alex"],"idIMDB":"nm0002907"},"actorId":"nm0002907","character":"Father","urlCharacter":"http://www.imdb.com/character/ch0401227","main":true},{"actorName":"Katie Holmes","urlProfile":"http://www.imdb.com/name/nm0005017","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA2NjY5OTkzNl5BMl5BanBnXkFtZTcwMDE2NTkxNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1978","placeOfBirth":" Toledo, Ohio, USA","birthName":"Kate Noelle Holmes","height":"5' 9\" (1.75 m)","bio":"Born two months premature at four pounds, Kate Noelle Holmes made her first appearance on December 18, 1978, in Toledo, Ohio. She is the daughter of Kathleen Ann (Craft), a philanthropist, and Martin Joseph Holmes, Sr., a lawyer. She is of German, Irish, and English ancestry. Her parents have said that her strong-willed personality is probably from being born premature. Being the youngest in the Holmes clan, completing the family of three other sisters and one brother, Katie was always the baby. As a teenager, she began attending modeling school. When she was sixteen, her teacher invited her to go to a modeling competition with other girls from her class. She competed in the International Modeling and Talent Association by singing, dancing, and reciting a monologue from To Kill a Mockingbird (1962). By the end of that time in New York, Katie won many awards. But she said she didn't want to model because it wasn't challenging enough. So when she was seventeen, Katie went to Los Angeles to audition for movies. Luckily, on her second audition, she was cast in the movie, Ice Storm (1997), directed by Ang Lee. Katie's character was Libbets Casey, a rich New Yorker, who is pursued by two of the main characters. It was a small part, but it marked the beginning of her professional acting career. After the excitement of her first movie, Katie began sending in audition tapes for pilot shows. During that time, she was also starring in her all-girls Catholic high school musical, Damn Yankees, as Lola. After Kevin Williamson received her audition tape for his new show, Dawson's Creek (1998), the producers wanted her to come to Hollywood right away and read live for them. But because they wanted her to come on the opening night for Damn Yankees, Katie had to tell them she couldn't make it. Fortunately, the show's producers wanted her so much for that role, they rescheduled her callback and the result was she got the part as Joey Potter. During her first year with Dawson's Creek (1998), Katie was able to do two movies, Comportements troublants (1998) and Go (1999), and, for the former, she won Best Breakthrough Female Performance in the 1999 MTV Movie Awards. The following year, she starred next to Michael Douglas in Wonder Boys (2000), playing Hannah Green, a published author and a boarder at her teacher's (Douglas) house, who has a crush on him, and tries to seduce him. Her first leading role came in 2002, with Abandon (2002). She played a college student named Katie Burke, who is haunted by the mysterious disappearance of her boyfriend who vanished two years prior. With Dawson's Creek (1998) coming to a close after six years in May of 2003, it was a bittersweet thing for all the cast. Accustomed to being in North Carolina filming ten months out of a year, the cast members now had the opportunity to make more movies. Katie demonstrated this in October, when she had two new movies, Pieces of April (2003) and The Singing Detective (2003), coming out in that month alone. Pieces of April (2003) is a charming Thanksgiving movie about April (Holmes), the black sheep of her family, who wants to give her family the perfect dinner before her mother passes on. The Singing Detective (2003) is a dark musical where the main character (Robert Downey Jr.) is a writer in a hospital for skin conditions who writes a dark world of seduction and murder in his mind. Katie Holmes plays the kind Nurse Mills who tends to his every need. She also gets to lip sync and dance in this movie. In 2004, she starred in the romantic movie First Daughter (2004), in which she played the President's (Michael Keaton) daughter, Samantha, who wants to go to college without any Secret Service tagging along. In 2005, Holmes co-starred in Batman Begins (2005), where she played Rachel Dawes, a childhood sweetheart and love interest to Batman/Bruce Wayne.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA2NjY5OTkzNl5BMl5BanBnXkFtZTcwMDE2NTkxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005017","name":"Katie Holmes","idIMDB":"nm0005017"},"actorId":"nm0005017","character":"Mother","urlCharacter":"http://www.imdb.com/character/ch0415894","main":true},{"actorName":"Odeya Rush","urlProfile":"http://www.imdb.com/name/nm3843467","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NDIzNDIyOF5BMl5BanBnXkFtZTgwNzg3ODQyNzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1997","placeOfBirth":" Haifa, Israel","height":"5' 5\" (1.65 m)","bio":"Odeya Rush was born and raised in Haifa, Israel, along with her six brothers. She began acting at the age of 14 when she starred in \"The Odd Life of Timothy Green.\" She then went on to do \"The Giver\" alongside Jeff Bridges and Meryl Streep, and \"Goosebumps\" opposite Jack Black. At age 18, she wrote, directed and starred in her own short film called \"Thanks.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NDIzNDIyOF5BMl5BanBnXkFtZTgwNzg3ODQyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3843467","name":"Odeya Rush","idIMDB":"nm3843467"},"actorId":"nm3843467","character":"Fiona","urlCharacter":"http://www.imdb.com/character/ch0398672","main":true},{"actorName":"Cameron Monaghan","urlProfile":"http://www.imdb.com/name/nm1185747","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MDcyMjE4OF5BMl5BanBnXkFtZTgwOTgxMDkzMjE@._V1_UY44_CR9,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 August 1993","placeOfBirth":" Santa Monica, California, USA","birthName":"Cameron Riley Monaghan","height":"5' 11½\" (1.82 m)","bio":"Cameron Monaghan was born in Santa Monica, California, but he moved to Boca Raton, Florida when he was an infant. He spends his time on both coasts now because he has family in New York, Connecticut, Florida and Los Angeles. He was raised by an only parent, Diane Monaghan. Cameron's debut TV role as \"Winthrop Paroo\" in The Music Man (2003) was originally played by Ron Howard in The Music Man (1962). Cameron began his acting career at 5 years old in commercials. At age 7, he began appearing on stage as Stuart Little in \"Stuart Little\" and as Piglet in \"Winnie the Pooh\" at Little Palm Family Theatre in Boca.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MDcyMjE4OF5BMl5BanBnXkFtZTgwOTgxMDkzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1185747","name":"Cameron Monaghan","idIMDB":"nm1185747"},"actorId":"nm1185747","character":"Asher","urlCharacter":"http://www.imdb.com/character/ch0401226","main":true},{"actorName":"Taylor Swift","urlProfile":"http://www.imdb.com/name/nm2357847","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5ODI0NzIzNV5BMl5BanBnXkFtZTcwMzM0NjI2Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1989","placeOfBirth":" Reading, Pennsylvania, USA","birthName":"Taylor Alison Swift","height":"5' 10\" (1.78 m)","bio":"Taylor Alison Swift is a multi-Grammy award-winning American singer/songwriter who, in 2010 at the age of 20, became the youngest artist in history to win the Grammy Award for Album of the Year. In 2011 Swift was named Billboard's Woman of the Year. She also has been named the American Music Awards Artist of the Year, as well as the Entertainer of the Year for both the Country Music Association and the Academy of Country Music, among many other accolades. As of this writing, she is also the top-selling digital artist in music history. Taylor Alison Swift was born on December 13, 1989, in Reading, Pennsylvania, to Andrea (Finlay), a one-time marketing executive, and Scott Kingsley Swift, a financial adviser. Her ancestry includes German and English, as well as some Scottish, Irish, Welsh and 1/16th Italian. She was named after James Taylor, and her mother believed that if she had a gender neutral name it would help her forge a business career. Taylor spent most of her childhood on an 11-acre Christmas tree farm in Montgomery County, Pennsylvania. When she was nine years old the family moved to Wyomissing, PA, where she attended West Reading Elementary Center and Wyomissing Area Junior/Senior High School. Taylor spent her summers at her parents' vacation home at the Jersey shore. Her first hobby was English horse riding. Her mother put her in a saddle when she was nine months old and Swift later competed in horse shows. At the age of nine she turned her attention to musical theatre and performed in Berks Youth Theatre Academy productions of \"Grease\", \"Annie\", \"Bye Bye Birdie\" and \"The Sound of Music\". She traveled regularly to New York City for vocal and acting lessons. However, after a few years of auditioning in New York and not getting anything, she became interested in country music. At age 11, after many attempts, Taylor won a local talent competition by singing a rendition of LeAnn Rimes' \"Big Deal\", and was given the opportunity to appear as the opening act for Charlie Daniels at a Strausstown amphitheater. This interest in country music isolated Swift from her middle school peers. At age 12 she was shown by a computer repairman how to play three chords on a guitar, inspiring her to write her first song, \"Lucky You\". She had previously won a national poetry contest with a poem entitled \"Monster in My Closet\", but now began to focus on songwriting. She moved to Nashville at age 14, having secured an artist development deal with RCA Records. She left RCA Records when she was 15--the label wanted her to record the work of other songwriters and wait until she was 18 to release an album, but she felt ready to launch her career with her own material. At an industry showcase at Nashville's The Bluebird Café in 2005, Swift caught the attention of Scott Borchetta, a Dreamworks Records executive who was preparing to form his own independent record label, Big Machine Records. Taylor was one of the new label's first signings. Taylor released her debut album, \"Taylor Swift\", in October of 2006 and received generally positive reviews from music critics. The New York Times described it as \"a small masterpiece of pop-minded country, both wide-eyed and cynical, held together by Ms. Swift's firm, pleading voice\". Her single \"Our Song\" made her the youngest solo writer and singer of a #1 country song. The album sold 39,000 copies during its first week. In 2008 she released her second studio album, \"Fearless\". The lead single from the album, \"Love Story\", was released in September 2008 and became the second best-selling country single of all time, peaking at #4 on the Billboard Hot 100 chart. Four more singles were released throughout 2008 and 2009: \"White Horse\", \"You Belong with Me\", \"Fifteen\" and \"Fearless\". \"You Belong with Me\" was the album's highest-charting single, peaking at #2 on the Billboard Hot 100. The album debuted at #1 on the Billboard 200 Album Chart. It was the top-selling album of 2009 and brought Swift much crossover success. In September 2009 she became the first country music artist to win an MTV Video Music Award when \"You Belong with Me\" was named Best Female Video. Her acceptance speech was interrupted by rapper Kanye West, who had been involved in a number of other award show incidents. West declared Beyoncé Knowles's video for \"Single Ladies (Put a Ring on It)\", nominated in the same category, to be \"one of the best videos of all time\". When Beyoncé later won the award for Video of the Year, she invited Taylor onstage to finish her speech. In November 2009 Taylor Swift became the youngest ever artist, and one of only six women, to be named Entertainer of the Year by the Country Music Association. She released her third studio album in October 2010, \"Speak Now\", and wrote all the songs herself. She originally intended to call the album \"Enchanted\" but Scott Borchetta, her record label's CEO, felt the title did not reflect the album's more adult themes. Swift toured throughout 2011 and early 2012 in support of \"Speak Now\". As part of the 13-month, 111-date world tour, Swift played seven shows in Asia, 12 in Europe, 80 in North America and 12 in Australasia (three dates on the US tour were rescheduled after she fell ill with bronchitis). The stage show was inspired by Broadway musical theatre, with choreographed routines, elaborate set-pieces, pyrotechnics and numerous costume changes. Swift invited many musicians to join her for one-off duets during the North American tour. Appearances were made by James Taylor, Jason Mraz, Shawn Colvin, Johnny Rzeznik, Andy Grammer, Tal Bachman, Justin Bieber, Selena Gomez, Nicki Minaj, Nelly, B.o.B., Usher Raymond, Flo Rida, T.I., Jon Foreman, Jim Adkins, Hayley Williams, Hot Chelle Rae, Ronnie Dunn, Darius Rucker, Tim McGraw and Kenny Chesney. In May 2012 Taylor featured in B.o.B's song \"Both of Us\". Swift's fourth studio album, \"Red\", was released on October 22, 2012. She wrote nine of the album's 16 songs alone; the remaining seven were co-written with Max Martin, Liz Rose, Dan Wilson, Ed Sheeran and Gary Lightbody. Nathan Chapman served as the album's lead producer but Jeff Bhasker, Butch Walker, Jacknife Lee, Dann Huff and Shellback (aka Shellback) also produced individual tracks. Chapman has said he encouraged Swift \"to branch out and to test herself in other situations\". She has described the collaborative process as \"an apprenticeship\" that taught her to \"paint with different colors\". \"Red\" examines Swift's attraction to drama-filled relationships; she believes that, since writing the record, such relationships no longer appeal to her. Musically, while there is some experimentation with \"slick, electronic beats\", the pop sheen is limited to a handful of tracks sprinkled among more recognizably Swiftian fare. \"Rolling Stone\" enjoyed \"watching Swift find her pony-footing on Great Songwriter Mountain. She often succeeds in joining the Joni/Carole King tradition of stark-relief emotional mapping . . . Her self-discovery project is one of the best stories in pop.\" The Guardian described Swift as a \"Brünnhilde of a rock star\" and characterized \"Red\" as \"another chapter in one of the finest fantasies pop music has ever constructed\". \"USA Today\" felt that the \"engaging\" record saw Swift \"write ever-more convincingly--and wittily and painfully--about the messy emotions of a young twenty something nearing the end of her transition from girl to woman\". The \"Los Angeles Times\" noted the exploration of \"more nuanced relationship issues\" on \"an unapologetically big pop record that opens new sonic vistas for her\". As part of the \"Red\" promotional campaign, representatives from 72 worldwide radio stations were flown to Nashville during release week for individual interviews with Swift. She made television appearances on Ellen: The Ellen DeGeneres Show (2003), Good Morning America (1975), The View (1997), Late Show with David Letterman (1993), ABC News Nightline (1980) and 20/20: All Access Nashville with Katie Couric (2012). She performed at Los Angeles' MTV VMAs and London's Teen Awards, and will also perform at Nashville's CMA Awards, Frankfurt's MTV Europe Music Awards, Los Angeles' AMA Awards and Sydney's ARIA Music Awards. Swift offered exclusive album promotions through Target, Papa John's and Walgreens. She became a spokesmodel for Keds sneakers, released her sophomore Elizabeth Arden fragrance and continued her partnerships with Cover Girl, Sony Electronics and American Greetings, as well as her unofficial brand tie-ins with Ralph Lauren and Shellys. The album's lead single, \"We Are Never Ever Getting Back Together\", was released in August 2012. The song became Swift's first #1 on the US Billboard Hot 100 chart, recording the highest ever one-week sales figures for a female artist. Two further singles have since been released: \"Begin Again\" (country radio) and \"I Knew You Were Trouble\" (pop and international radio).In her career, as of May 2012, Swift has sold over 23 million albums and 54.5 million digital tracks worldwide. Taylor Swift is only beginning to emerge as an acting talent, having voiced the role of Audrey in the animated feature The Lorax (2012). She also made appearances in the theatrical release Valentine's Day (2010) and in an episode of CSI: Crime Scene Investigation (2000). She contributed two original songs to The Hunger Games (2012) soundtrack: \"Safe & Sound featuring The Civil Wars\" and \"Eyes Open\". Taylor released her fifth album, titled \"1989\", on October 27, 2014. This album is when she finally made the complete transition from country to pop. She says that she will not be going to any Country Music Award shows. The album is named after the year she was born, and is a sort of '80s-sounding album, in the sense that it's more electronic. In March 2015 she began dating Scottish Disc Jockey Calvin Harris after having met at the Brit Awards in February.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5ODI0NzIzNV5BMl5BanBnXkFtZTcwMzM0NjI2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2357847","name":"Taylor Swift","nicknames":["T-Swizzle","Tay","Tay-Tay"],"idIMDB":"nm2357847"},"actorId":"nm2357847","character":"Rosemary","urlCharacter":"http://www.imdb.com/character/ch0407708","main":true},{"actorName":"Emma Tremblay","urlProfile":"http://www.imdb.com/name/nm4590173","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNDA3Mjg0M15BMl5BanBnXkFtZTgwMTAxNTMzNTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Emma Tremblay is an actress, known for Elysium (2013), The Judge (2014) and The Giver (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNDA3Mjg0M15BMl5BanBnXkFtZTgwMTAxNTMzNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4590173","name":"Emma Tremblay","idIMDB":"nm4590173"},"actorId":"nm4590173","character":"Lilly","urlCharacter":"http://www.imdb.com/character/ch0476038","main":true},{"actorName":"Alexander Jillings","urlProfile":"http://www.imdb.com/name/nm6673560","urlPhoto":"","biography":{"bio":"Alexander Julian Jillings was born in Cape Town, South Africa in December 2012. He shares the role of Gabriel with his identical twin brother James David Jillings. He was 10 months old when he started on 'The Giver' and 13 months old on his last day on set. The scenes that he features in were so diverse that many locations were used in Cape Town and the Northern Cape.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6673560","name":"Alexander Jillings","idIMDB":"nm6673560"},"actorId":"nm6673560","character":"Gabriel 12 Months","urlCharacter":"http://www.imdb.com/character/ch0468459","main":true},{"actorName":"James Jillings","urlProfile":"http://www.imdb.com/name/nm6673561","urlPhoto":"","biography":{"bio":"James David Jillings was born in Cape Town, South Africa in December 2012. He shares the role of Gabriel with his identical twin brother Alexander Julian Jillings. He was 10 months old when he started on 'The Giver' and 13 months old on his last day on set. The scenes that he features in were so diverse that many locations were used in Cape Town and the Northern Cape.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6673561","name":"James Jillings","idIMDB":"nm6673561"},"actorId":"nm6673561","character":"Gabriel 12 Months","urlCharacter":"http://www.imdb.com/character/ch0468459","main":true},{"actorName":"Jordan Nicholas Smal","urlProfile":"http://www.imdb.com/name/nm6673562","urlPhoto":"","biography":{"bio":"Jordan Nicholas Smal is an actor, known for The Giver (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6673562","name":"Jordan Nicholas Smal","idIMDB":"nm6673562"},"actorId":"nm6673562","character":"Gabriel 3 Months","urlCharacter":"http://www.imdb.com/character/ch0468459","main":true},{"actorName":"Saige Fernandes","urlProfile":"http://www.imdb.com/name/nm6673563","urlPhoto":"","biography":{"bio":"Saige Fernandes is an actor, known for The Giver (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6673563","name":"Saige Fernandes","idIMDB":"nm6673563"},"actorId":"nm6673563","character":"Gabriel 6 Months","urlCharacter":"http://www.imdb.com/character/ch0468459","main":true},{"actorName":"Renate Stuurman","urlProfile":"http://www.imdb.com/name/nm1998656","urlPhoto":"","biography":{"bio":"Renate Stuurman is an actress, known for The Giver (2014), Meisie (2007) and La vraie vie d'Ella (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1998656","name":"Renate Stuurman","idIMDB":"nm1998656"},"actorId":"nm1998656","character":"Dinah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vanessa Cooke","urlProfile":"http://www.imdb.com/name/nm0177505","urlPhoto":"","biography":{"bio":"Vanessa Cooke is an actress and writer, known for The Giver (2014), The Salvation (2014) and Dr Lucille - La remarquable histoire de Lucille Teasdale (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0177505","name":"Vanessa Cooke","idIMDB":"nm0177505"},"actorId":"nm0177505","character":"Elder","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0435651","urlIMDB":"http://www.imdb.com/title/tt0435651","business":{"budget":{"money":"$25,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"HUF 18,769,719","country":"Hungary","day":"14","month":"09","year":"2014","remarks":""}],"gross":[{"money":"$43,838,601","country":"USA","day":"28","month":"09","year":"2014","remarks":""},{"money":"$31,526,000","country":"USA","day":"31","month":"08","year":"2014","remarks":""}],"weekendGross":[{"money":"$422,777","country":"USA","day":"28","month":"09","year":"2014","remarks":"702 Screens"},{"money":"$5,253,000","country":"USA","day":"31","month":"08","year":"2014","remarks":"2,805 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 37 min (97 min)"],"soundMix":["Dolby Digital"],"color":["Black and White","Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa XT, Hawk V-Lite and V-Plus Lenses"],"laboratory":["Technicolor PostWorks, New York (NY), USA","The Room, New York (NY), USA (digital intermediate)"],"filmLength":null,"negativeFormat":["Codex ARRIRAW (2.8K)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Hawk Scope (anamorphic) (source format)"],"printedFilmFormat":["35 mm","D-Cinema"]},"rating":"6.5","metascore":"47","filmingLocations":[{"location":"Cape Town, South Africa"}],"rated":"PG-13","awards":[{"award":"Denver Film Critics Society 2015","titlesAwards":[{"titleAwardOutcome":"Nominated DFCS Award","categories":[{"category":"Best Original Song","names":[]}]}]},{"award":"Heartland Film 2014","titlesAwards":[{"titleAwardOutcome":"Won Truly Moving Picture Award","categories":[{"category":"","names":[{"name":"Phillip Noyce","id":"nm0637518","role":null},{"name":"As Is Productions","id":null,"role":null},{"name":"Weinstein Company, The","id":null,"role":null}]}]}]},{"award":"Hollywood Music In Media Awards (HMMA) 2014","titlesAwards":[{"titleAwardOutcome":"Nominated HMMA Award","categories":[{"category":"Outstanding Music Supervision - Film","names":[{"name":"Dana Sano","id":"nm0762946","role":null}]},{"category":"Best Soundtrack Album","names":[]}]}]},{"award":"People's Choice Awards, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated People's Choice Award","categories":[{"category":"Favorite Dramatic Movie","names":[]}]}]},{"award":"The Joey Awards, Vancouver 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Joey Award","categories":[{"category":"Young Actress Age 9 or Younger in a Feature Film Leading Role","names":[{"name":"Emma Tremblay","id":"nm4590173","role":null}]}]}]}],"votes":"93,094","type":"Movie","companyCreditsSimple":[{"idCompany":"co0527717","name":"Asis Productions"},{"idCompany":"co0311606","name":"Canada Film Capital"},{"idCompany":"co0156293","name":"Department of Trade and Industry of South Africa"}],"keywords":{"keywords":["black and white segues into color","future","dystopia","memory","community","color","infanticide","based on young adult novel","totalitarianism","euthanasia","death of child","based on novel","elder","childhood","training","old man","truth","little boy","rules","baby","strong female character","rural setting","fictional war","murder","murder of a child","journey","palm tree","rebel","security","violence","medicine","puppy","repression","candle","festival","religion","celebration","applause","lightning","mountain","waterfall","monument","campfire","hypodermic needle","pursuit","machine gun","search","berlin wall","city park","soldier","lion","passion","greed","cruelty","snow sled","library","uniformity","audience","bride","groom","gun","elephant","hunter","polar bear","hospital","music band","teenage boy","wedding","tambourine","dancing","sailing boat","geneticist","aerial","little girl","automation","metropolis","prisoner","animal","loss","zebra","dream","monkey","bird","map","piano","sea","woods","trance","bee","winter","singing","running","time","crying","arena","teenage girl","uniform","gunshot","stage","fountain","infant","conformity","boundary","death","piano playing","reference to nelson mandela","open ended","voice over narration","apple","driving off a cliff","motorcycle","river","falling from height","desert","foot chase","injection","lethal injection","sled","snow","father daughter relationship","pilot","drone","battle","shot in the chest","punched in the face","dream sequence","flashback","hologram","lying","ceremony","bicycle","child in peril","friendship","brother sister relationship","mother son relationship","father son relationship","character repeating someone else's dialogue","black and white scene","film starts with text","secret","character name in title","book","tank","camel","bicycling","first kiss","death of daughter","close up of eyes","shot to death","occult","socialism","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 22:00:44"}}