{"data":{"movies":[{"title":"Skinwalkers","originalTitle":"","year":"2006","releaseDate":"20070810","directors":[{"name":"James Isaac","id":"nm0410494"}],"writers":[{"name":"James DeMonaco","id":"nm0218621"},{"name":"Todd Harthan","id":"nm2090107"}],"runtime":"110 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1OTIyNzc5OF5BMl5BanBnXkFtZTcwNjI1ODI1MQ@@._V1.jpg","countries":["Canada","USA","Germany"],"languages":["English"],"genres":["Action","Fantasy","Horror","Thriller"],"plot":"In accordance with the Navajos' legend, a thirteen year-old boy will finish with the curse of the powerful Skinwalkers, a.k.a. werewolves. The half-breed boy Timothy is raised by his human mother Rachel and protected by his Skinwalkers relatives since he was born. His grandmother Nana, his uncle Jonas, his cousin Katherine, her boyfriend Adam and their friend Doak have kept the secret about his bloodline and neither Timothy nor Rachel know the tragic curse. A couple of days before Timothy's thirteenth birthday, a pack of evil Skinwalkers that have tasted blood led by the evil Varek chases the boy while his family protects him.","simplePlot":"A 12 year old boy and his mother become the targets of two warring werewolf packs, each with different intentions and motives.","actors":[{"actorName":"Jason Behr","urlProfile":"http://www.imdb.com/name/nm0004736","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNDY5OTA3OF5BMl5BanBnXkFtZTgwNTU3NjEyNzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 December 1973","placeOfBirth":" Minneapolis, Minnesota, USA","birthName":"Jason Nathaniel Behr","height":"6' (1.83 m)","bio":"Jason Nathaniel Behr was born on December 30, 1973 in Minneapolis, Minnesota, to Patricia Ann (Steiner) and David Paul Behr. His ancestry includes Swiss-German, German, Austrian, Irish, English, and Danish. Jason began acting at the age of five, appearing in a number of theatrical productions, commercials, voice overs and modeling. Jason continued to perform throughout his school years. At the age of nineteen, following his graduation from Richfield Senior High School, Jason moved out to Los Angeles. Shortly after his arrival, Jason began a series of guest roles on popular television shows such as Step by Step (1991), JAG (1995), Buffy the Vampire Slayer (1997), 7th Heaven (1996) and Dawson's Creek (1998). In 1998, Jason made his film debut in the film Pleasantville (1998), starring Reese Witherspoon, Tobey Maguire and William H. Macy. This role was followed up by another role in the indie film Rites of Passage (1999), opposite James Remar and Dean Stockwell, where Jason garnered praised for his portrayal of a young homosexual male. Jason was cast in his first leading role on the television series Roswell (1999) playing \"Max Evans\". The show ran from 1999 to 2002. In 2001, Jason appeared alongside Kevin Spacey, Cate Blanchett and Judi Dench in The Shipping News (2001). The role earned him a Movieline Award for Standout performance. Jason continued to appear in indie films such as Happily Even After (2004), an independent film which premiered at the Tribeca Film Festival in New York City. More indie films followed, including Happily Even After (2004), Shooting Livien (2005), Man of God (2005), Senseless (2008) and The Tattooist (2007). In 2005, Jason starred opposite former \"Buffy\" star Sarah Michelle Gellar in the supernatural thriller The Grudge (2004). Most recently, Jason finished two unaired pilots for the Fox and NBC networks, respectively. He completed another indie film, 'The Last International Playboy\", which played at both the Slamdance and Gen Art film festivals and was released in select theaters on July 12, 2009. Jason married actress KaDee Strickland in 2006. The couple have a son, Atticus.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNDY5OTA3OF5BMl5BanBnXkFtZTgwNTU3NjEyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004736","name":"Jason Behr","nicknames":["Jay"],"idIMDB":"nm0004736"},"actorId":"nm0004736","character":"Varek / Caleb Talbot","urlCharacter":"http://www.imdb.com/character/ch0068442","main":true},{"actorName":"Elias Koteas","urlProfile":"http://www.imdb.com/name/nm0000480","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEwMTEzODkzNF5BMl5BanBnXkFtZTcwMjI1NDAyMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 March 1961","placeOfBirth":" Montréal, Québec, Canada","height":"5' 10½\" (1.79 m)","bio":"Elias Koteas was born on March 11, 1961, in Montreal, Canada. Both his parents are of Greek descent. Elias attended Vanier College in Montreal before leaving to attend the American Academy of Dramatic Arts in New York City in 1981, of which he is a graduate. He also attended the Actors Studio in New York City, where he studied acting under Ellen Burstyn and Peter Masterson. His film debut was in One Magic Christmas (1985). He has also appeared on stage in \"Kiss of the Spider Woman,\" \"Death of a Salesman,\" \"Bent\" and \"The Cherry Orchard.\" In 1989 he was nominated for a Genie (Canada's Academy Award) for best actor in Malarek (1988), a true story in which he plays a troubled street-kid-turned reporter for a Canadian newspaper. A somewhat of a breakthrough role for Elias happened in 1990, when he got the role of vigilante Casey Jones in Teenage Mutant Ninja Turtles (1990) and its sequels. He is one of Canada's most popular actors and frequently appears in films by Canadian directors Atom Egoyan and David Cronenberg. It was Cronenberg's controversial movie Crash (1996) that had Cannes all abuzz in 1996. Elias played Vaughan, a self-appointed \"mad scientist\" with an unusual fetish--sexual delight in car crashes! The past two years have been busy ones for Koteas, adding six more roles to his resume. As Capt. James Staros, the commanding officer of Charlie Company in The Thin Red Line (1998), he brought sensitivity and compassion to his portrayal of a man who cared about the safety of his men--even at the risk of his own career. In 2000 he appeared in Lost Souls (2000), a thriller starring Winona Ryder, and starred on Broadway with Josh Brolin in the Sam Shepard play \"True West.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEwMTEzODkzNF5BMl5BanBnXkFtZTcwMjI1NDAyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000480","name":"Elias Koteas","idIMDB":"nm0000480"},"actorId":"nm0000480","character":"Jonas Talbot","urlCharacter":"http://www.imdb.com/character/ch0098854","main":true},{"actorName":"Rhona Mitra","urlProfile":"http://www.imdb.com/name/nm0593961","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxNzM4NzE1OF5BMl5BanBnXkFtZTgwMTc2NzU5MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1976","placeOfBirth":" Paddington, London, England, UK","birthName":"Rhona Natasha Mitra","height":"5' 6\" (1.68 m)","bio":"Mitra was born in Paddington, London, England, the daughter of Nora Downey and Anthony Mitra, a cosmetic surgeon. She has an older and a younger brother. Her father is of Bengali Indian and English descent, and her mother is Irish. In 1984, when Mitra was eight, her parents divorced, and she was sent to boarding school. She spent several years at two different schools, including Roedean, but Mitra claims she was eventually expelled from both of them. Mitra's first main role came as Scott Wolf's illicit love interest on Party of Five (1994). In 2000, Mitra had a small, key role in the film Hollow Man (2000), as the rape victim of Kevin Bacon, an incident that drives his character insane. She had a main role in the medical drama Gideon's Crossing (2000), as \"Dr. Alejandra Ollie Klein\". Mitra then had roles in Ali G (2002); Sweet Home Alabama (2002); Stuck on You (2003), and leading roles in Highwaymen (2004) and Spartacus (2004). Mitra appeared in the final season of The Practice (1997) as \"Tara Wilson\", and continued that role into its spin-off Boston Legal (2004), but left not long into the second season. In 2005, Mitra played the role of \"Kit McGraw\" during Season 3 of Nip/Tuck (2003). Mitra then went on to appear in Skinwalkers (2006), The Number 23 (2007) and Shooter (2007). In 2008, Mitra starred in the lead role of the science fiction/action film Doomsday (2008) as \"Major Eden Sinclair\", and, in 2009, went on to star in Underworld: Rise of the Lycans (2009) as \"Sonja\", the daughter of the powerful vampire elder, \"Viktor\" (played by Bill Nighy). Mitra appeared as the live action model for \"Lara Croft\", the lead character in Eidos Interactive's Tomb Raider video game series. She was ranked #46 on the Maxim Hot 100 Women of 2001.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxNzM4NzE1OF5BMl5BanBnXkFtZTgwMTc2NzU5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0593961","name":"Rhona Mitra","idIMDB":"nm0593961"},"actorId":"nm0593961","character":"Rachel Talbot","urlCharacter":"http://www.imdb.com/character/ch0066620","main":true},{"actorName":"Natassia Malthe","urlProfile":"http://www.imdb.com/name/nm0853573","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjczNjk3NzkzNV5BMl5BanBnXkFtZTYwNDI0Nzk2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 January 1974","placeOfBirth":" Oslo, Norway","birthName":"Linn Natassia Malthe","height":"5' 5½\" (1.66 m)","bio":"Natassia Malthe was born on January 19, 1974 in Oslo, Norway as Linn Natassia Malthe. She is an actress and producer, known for This Means War (2012), Elektra (2005) and Lake Placid (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjczNjk3NzkzNV5BMl5BanBnXkFtZTYwNDI0Nzk2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0853573","name":"Natassia Malthe","nicknames":["Nadi"],"idIMDB":"nm0853573"},"actorId":"nm0853573","character":"Sonja","urlCharacter":"http://www.imdb.com/character/ch0090012","main":true},{"actorName":"Kim Coates","urlProfile":"http://www.imdb.com/name/nm0167649","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NjU3NjcxNF5BMl5BanBnXkFtZTgwODAwNjkwMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 February 1958","placeOfBirth":" Saskatoon, Saskatchewan, Canada","height":"6' 0½\" (1.84 m)","bio":"Kim's film career began in 1991 with The Last Boy Scout. Two Warner Brothers' hits followed: Innocent Blood and The Client. Since that time he has starred in over forty films, including Academy Award winners Black Hawk Down directed by Ridley Scott, and Pearl Harbor directed by Michael Bay. Other films include Waterworld and Open Range with Kevin Costner, Grilled with Ray Romano, Silent Hill opposite Sean Bean, Hostage with Bruce Willis, Assault on Precinct 13, Unforgettable, Skinwalkers, and Hero Wanted. Kim returned to Entourage for it's final season as Carl Ertz, the sleazy movie Producer. His performance garnered so much attention in previous seasons that Ertz's return was a direct request. He appeared in a recurring role on CSI Miami. Other prominent guest starring television roles include CSI, CSI NY, Cold Case, and Prison Break. He has had roles in more than 20 MOW's including the NBC miniseries Hercules, and Disney's Scream Team. These dramatic turns on television have earned him Gemini nominations for Best Actor in a Featured Supporting Role for HBO's Dead Silence and Best Performance in a Guest Role Dramatic Series for The Outer Limits. In 2008 Kim starred in and executive produced the film The Poet. Before its wide release it won best picture and best director (Damian Lee) at the New York Staten Island Film festival. At the AOF International Film Festival in Pasadena, Kim received the Half Life Achievement Award for acting in 2009. Kim also won best actor for playing Steve Sorrano in King of Sorrow. Kim starred on Broadway as Stanley Kowalski in A Streetcar Named Desire, as the title role in Macbeth at the legendary Stratford Theatre, and has appeared in over fifty plays in North America. In the fall of 2010 Kim starred in the blockbuster 3D movie Resident Evil Afterlife, with Mila Jovovich. In 2011, Kim starred in Sacrifice, with Cuba Gooding Jr., A Little Help, with Jenna Fisher, Sinners and Saints and Robosapien. In 2012, Kim starred in the sports comedy Goon along side Seann William Scott, Live Schreiber and Jay Baruchel, for which Kim is nominated for Best Performance By An Actor In A Supporting Role at the 2013 Canadian Screen Awards. Goon was much lauded by international audiences and critics alike. The FX hit series Sons of Anarchy is going into its 6th season. Kim Coates is Tig Trager, the motorcycle club's sergeant at arms. Tig fears nothing, much like Kim throughout his career. Kim has 3 feature films opening in 2013; Rufus, Ferocious, The Dark Truth which Kim co-produced and starred in along side Forrest Whitaker and Andy Garcia, Kim is currently filming Crossing Lines in Prague with William Fichtner and Donald Sutherland. Kim currently resides in Los Angeles with his wife and their two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NjU3NjcxNF5BMl5BanBnXkFtZTgwODAwNjkwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0167649","name":"Kim Coates","idIMDB":"nm0167649"},"actorId":"nm0167649","character":"Zo","urlCharacter":"http://www.imdb.com/character/ch0098855","main":true},{"actorName":"Sarah Carter","urlProfile":"http://www.imdb.com/name/nm0141931","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0NTU5MTY3OV5BMl5BanBnXkFtZTcwMjQ0NTY5NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 October 1980","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Sarah Sanguin Carter","height":"5' 4½\" (1.64 m)","bio":"Fresh out of Canada, Sarah Carter's career in Hollywood took off quickly, landing a string of series regular roles such as \"Madeleine Poe\", opposite James Woods, on CBS' Shark (2006), and \"Maggie\", on TNT's Steven Spielberg-produced Falling Skies (2011). With an education in fine arts and a background in musical theater, Sarah honors her love for the artistic process by spending as much time in the theater as her life will allow. She has been classically trained in theater, voice and dance at Ryerson University in Toronto. Sarah always leaves a memorable impression with her popular guest-starring and recurring roles, namely as \"Alicia Baker\" on the CW's Smallville (2001); as \"Wrenn Darcy\", opposite Peter Krause, Donald Sutherland, and Jill Clayburgh, in HBO's Dirty Sexy Money (2007); and as \"Cassie\" in the much-talked about _\"Entourage\" (2004) {The Sundance Kids (#2.7)_ episode of HBO's hit series, Entourage (2004). In film, Sarah has starred in several independent and studio pictures, including Haven (2004), Killing Zelda Sparks (2007), Berkeley (2005), The Weinstein Co.'s DOA: Dead or Alive (2006), New Line Cinema's Final Destination 2 (2003), and most recently, she appeared, opposite Rachel McAdams, as \"Diane\", Jessica Lange's home-wrecker, in SpyGlass Pictures' blockbuster, The Vow (2012). Having been classically trained in theater, voice and dance, she has portrayed some of history's most iconic characters, including \"Nina\" in Anton Chekhov's \"The Seagull\" and \"Viola\" in William Shakespeare's \"Twelfth Night\", and now works consistently with renowned director and coach, Larry Moss, with whom she has been work-shopping a production of Le Roi Jones/Amiri Baraka's, \"Dutchman\". Besides being a successful actor, Sarah has a parallel career as a singer/songwriter in her band, \"SanguinDrake\", where she goes by her full birth name, Sarah Sanguin Carter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0NTU5MTY3OV5BMl5BanBnXkFtZTcwMjQ0NTY5NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0141931","name":"Sarah Carter","idIMDB":"nm0141931"},"actorId":"nm0141931","character":"Katherine","urlCharacter":"http://www.imdb.com/character/ch0066621","main":true},{"actorName":"Tom Jackson","urlProfile":"http://www.imdb.com/name/nm0414103","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNDM4MzExOF5BMl5BanBnXkFtZTgwOTIwNTE3OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 October 1948","placeOfBirth":" One Arrow Reserve, Saskatchewan, Canada","birthName":"Thomas Dale Jackson","bio":"One of Canada's most popular actors, Tom Jackson is also well known as a humanitarian. He founded the annual Huron Carole fund-raising concerts in support of the Salvation Army. Jackson has been a popular folk-country singer in Canada for many years. In January 2000, Jackson was named to the Order of Canada, that country's highest civilian award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNDM4MzExOF5BMl5BanBnXkFtZTgwOTIwNTE3OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0414103","name":"Tom Jackson","idIMDB":"nm0414103"},"actorId":"nm0414103","character":"Will","urlCharacter":"http://www.imdb.com/character/ch0123288","main":true},{"actorName":"Matthew Knight","urlProfile":"http://www.imdb.com/name/nm1342743","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0ODc1NzA5Nl5BMl5BanBnXkFtZTYwMjk1Njc2._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 February 1994","placeOfBirth":" Los Angeles, California, USA","bio":"Matthew Knight was born on February 16, 1994 in Los Angeles, California, USA. He is an actor, known for The Grudge 3 (2009), The Grudge 2 (2006) and Ma Babysitter est un Vampire (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0ODc1NzA5Nl5BMl5BanBnXkFtZTYwMjk1Njc2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1342743","name":"Matthew Knight","idIMDB":"nm1342743"},"actorId":"nm1342743","character":"Timothy Talbot","urlCharacter":"http://www.imdb.com/character/ch0123289","main":true},{"actorName":"Rogue Johnston","urlProfile":"http://www.imdb.com/name/nm0426825","urlPhoto":"","biography":{"bio":"Rogue Johnston is known for his work on Skinwalkers (2006), Get Rich or Die Tryin' (2005) and Piece of Mind (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0426825","name":"Rogue Johnston","idIMDB":"nm0426825"},"actorId":"nm0426825","character":"Grenier","urlCharacter":"http://www.imdb.com/character/ch0123290","main":true},{"actorName":"Barbara Gordon","urlProfile":"http://www.imdb.com/name/nm0329876","urlPhoto":"","biography":{"bio":"Barbara Gordon is known for her work on Faux-semblants (1988), Cube²: Hypercube (2002) and Men with Brooms (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0329876","name":"Barbara Gordon","idIMDB":"nm0329876"},"actorId":"nm0329876","character":"Nana","urlCharacter":"http://www.imdb.com/character/ch0501415","main":true},{"actorName":"Shawn Roberts","urlProfile":"http://www.imdb.com/name/nm0731575","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MzEzMTQzOF5BMl5BanBnXkFtZTcwMjUzNDY4Mw@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 April 1984","placeOfBirth":" Stratford, Ontario, Canada","height":"5' 10\" (1.78 m)","bio":"The year 1994 marked the beginning of the career for Canadian actor Shawn Roberts. Born in Stratford, Ontario, Canada on April 2, Shawn lucked upon a life-changing break while he was portraying the part of the Wolf in a school play version of Little Red Riding Hood. Award-winning screenwriter Robert Forsyth, father of one of Shawn's friends, spotted Roberts while attending this play. Through Forsythe's efforts, Shawn was then recommended to a Toronto acting agency. He had a guest appearance on the TV series Sirènes (1993) in 1994 before landing a regular role in 1996 on the new series Émilie de la nouvelle lune (1998). Throughout the rest of the 1990s, Shawn generally remained on television, showing up on various series before striking gold with his first movie appearance. In 2000, he gained a part in the first X-Men (2000) movie, playing Rogue's boyfriend Cody. Since 2000, the career of Shawn Roberts thus balanced out appropriately well between television and film work.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MzEzMTQzOF5BMl5BanBnXkFtZTcwMjUzNDY4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0731575","name":"Shawn Roberts","idIMDB":"nm0731575"},"actorId":"nm0731575","character":"Adam Kilmer","urlCharacter":"http://www.imdb.com/character/ch0123291","main":true},{"actorName":"Lyriq Bent","urlProfile":"http://www.imdb.com/name/nm0072713","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQ2OTMwODIyOF5BMl5BanBnXkFtZTgwNDA4NzYzODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"After graduating college with high honors, Lyriq Bent originally began his career as a Computer Graphic Technician. Bent's plans, however, were short-lived as he decided to take up acting on a dare. Since then, his career has gained considerable momentum with numerous film and television appearances already under his belt. Bent's eclectic mix of roles and rising popularity has earned kudos in both his native Canada and the U.S. In addition to landing a co-starring role on Lifetime's drama series \"Angela's Eyes\" from the producers of Crash, Bent guest starred on the CBS series \"CSI: Miami\" opposite David Caruso, the UPN series \"Kevin Hill\" opposite Taye Diggs and USA Network's \"Kojak\" opposite Ving Rhames. Additionally, the versatile actor has had recurring roles on the CBS/Zoetrope series \"Platinum\", the ESPN/Disney series \"Playmakers\" and the hit E1/ABC series \"Rookie Blue\". Bent also appeared in Robert Townsend's multi-award winning television movie \"10,000 Black Men Named George\" and the CBC mini-series \"Guns\", winner of five Geminis, alongside Elisha Cuthbert and Colm Feore. Bent's success in film has also been burgeoning. His film credits include starring opposite Mark Wahlberg and Andrè 3000 in the John Singleton film \"Four Brothers\" and \"Take the Lead\" with Antonio Banderas and Alfre Woodard. Bent also co-starred in the smash horror films \"Saw II\" and \"Saw III\" and as the lead character in \"Saw IV\", which opened at #1 in the box office, grossing over $100 million worldwide. He has also appeared in \"Mother's Day\" with Rebecca De Mornay, Shawn Ashmore and Jaime King, \"Honey\" alongside Jessica Alba, \"Crime Spree\" with Gerard Depardieu and \"A Day Late and a Dollar Short\" based on the New York Times Bestseller by Terry McMillan, starring Whoopi Goldberg, Ving Rhames and Mekhi Phifer. Furthermore, Bent starred in director Michael Mabbott's critically acclaimed debut feature film, \"The Life and Hard Times of Guy Terrifico,\" which premiered at the 2005 Toronto International Film Festival, winning the award for Best First Canadian Feature Film. Most recently, Bent co-starred in \"Home Again\", the Official Selection of the 2012 Toronto International Film Festival and winner of the festival choice award by the British Academy of Film and Television Art's Festival. Most recently, Bent completed filming the BET/CBC mini-series \"Book of Negroes\" based on Lawrence Hill's best-selling novel, opposite Louis Gosset Jr., Cuba Gooding Jr., and Aunjanue Ellis. The project from Conquering Pictures, Out of Africa Entertainment and Entertainment One Television will air on BET Networks in the U.S. and CBC in Canada. Bent is also as passionate about sports as he is about acting. He is an avid golfer and enjoys playing basketball, baseball, and soccer, and is no stranger to his kitchen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQ2OTMwODIyOF5BMl5BanBnXkFtZTgwNDA4NzYzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0072713","name":"Lyriq Bent","idIMDB":"nm0072713"},"actorId":"nm0072713","character":"Doak","urlCharacter":"http://www.imdb.com/character/ch0123292","main":true},{"actorName":"Christine Brubaker","urlProfile":"http://www.imdb.com/name/nm0115377","urlPhoto":"","biography":{"bio":"Christine Brubaker is an actress and executive, known for Run the Wild Fields (2000), Skinwalkers (2006) and Killshot (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0115377","name":"Christine Brubaker","idIMDB":"nm0115377"},"actorId":"nm0115377","character":"Justine","urlCharacter":"http://www.imdb.com/character/ch0123293","main":true},{"actorName":"Roman Podhora","urlProfile":"http://www.imdb.com/name/nm0687999","urlPhoto":"","biography":{"bio":"Roman Podhora was born in Fernie, British Columbia, Canada. He is an actor, known for Chicago (2002), K-19: The Widowmaker (2002) and Final Destination 5 (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0687999","name":"Roman Podhora","idIMDB":"nm0687999"},"actorId":"nm0687999","character":"Ralph","urlCharacter":"http://www.imdb.com/character/ch0123294","main":true},{"actorName":"Wayne Ward","urlProfile":"http://www.imdb.com/name/nm0911916","urlPhoto":"","biography":{"bio":"Wayne Ward is an actor, known for Repo Men (2010), Skinwalkers (2006) and Elvis Meets Nixon (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0911916","name":"Wayne Ward","idIMDB":"nm0911916"},"actorId":"nm0911916","character":"Justine's Husband","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0461703","urlIMDB":"http://www.imdb.com/title/tt0461703","business":{"budget":null,"openingWeekend":[{"money":"$753,520","country":"USA","day":"12","month":"08","year":"2007","remarks":"745 Screens"}],"gross":[{"money":"$1,018,965","country":"USA","day":"26","month":"08","year":"2007","remarks":""},{"money":"$957,935","country":"USA","day":"19","month":"08","year":"2007","remarks":""},{"money":"$753,520","country":"USA","day":"12","month":"08","year":"2007","remarks":""}],"weekendGross":[{"money":"$11,546","country":"USA","day":"26","month":"08","year":"2007","remarks":"29 Screens"},{"money":"$103,137","country":"USA","day":"19","month":"08","year":"2007","remarks":"339 Screens"},{"money":"$753,520","country":"USA","day":"12","month":"08","year":"2007","remarks":"745 Screens"}],"admissions":null,"productionDates":{"money":null,"country":null,"day":"19","month":"09","year":"2005","remarks":null},"filmingDates":[{"money":null,"country":null,"day":"19","month":"09","year":"2005","remarks":null},null],"copyrightHolder":"Skinwalkers DCP Inc."},"technical":{"runtime":["1 hr 50 min (110 min)","1 hr 32 min (92 min) (cut) (USA)","1 hr 29 min (89 min) (DVD) (Germany)"],"soundMix":null,"color":["Color (Technicolor)"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Cine-Byte Digital, Toronto, Canada (digital intermediate)","DeLuxe, Toronto, Canada"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"4.6","metascore":"33","filmingLocations":[{"location":"Creemore, Ontario, Canada"}],"rated":"R","awards":[],"votes":"11,905","type":"Movie","companyCreditsSimple":[{"idCompany":"co0173285","name":"Lionsgate"},{"idCompany":"co0074863","name":"Constantin Film Produktion"},{"idCompany":"co0097422","name":"Stan Winston Productions"}],"keywords":{"keywords":["desert eagle","blood","birthday","13th birthday","uncle","transformation","chase","12 year old","half breed","bloodlust","werewolf","navajo indian","dead woman with eyes open","dead nurse","one word title","explosion","cousin cousin relationship","van","teenage boy","father son relationship","adolescent","sniper rifle","shotgun","shot to death","shot in the chest","shot in the arm","prologue","pistol","held at gunpoint","caged human","broken neck","woods","suicide","stabbed in the eye","slow motion scene","silver bullet","shot in the head","shot in the forehead","shot in the back","shootout","presumed dead","native american","mother son relationship","motel clerk","lycanthropy","hung upside down","hospital","halloween","filicide","father daughter relationship","exploding gasoline station","crucifixion","child with gun","child in peril","boyfriend girlfriend relationship","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:58:51"}}