{"data":{"movies":[{"title":"Checking Out","originalTitle":"","year":"2005","releaseDate":"20061219","directors":[{"name":"Jeff Hare","id":"nm0362799"}],"writers":[{"name":"Richard Marcus","id":"nm1661897"},{"name":"Allen Swift","id":"nm0842563"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0Mjk2NjAxMF5BMl5BanBnXkFtZTcwMDA2OTI3Nw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"A famed stage actor reunites his family for a party, and plans to commit suicide after-wards, unless they are able to convince him not to.","simplePlot":"A famed stage actor reunites his family for a party, and plans to commit suicide after-wards, unless they are able to convince him not to.","actors":[{"actorName":"Peter Falk","urlProfile":"http://www.imdb.com/name/nm0000393","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4ODUwNDE3MF5BMl5BanBnXkFtZTYwMjA1NTM0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1927","placeOfBirth":" New York City, New York, USA","birthName":"Peter Michael Falk","height":"5' 6\" (1.68 m)","bio":"Peter Michael Falk was born on September 16, 1927, in New York City, New York. At the age of 3, his right eye was surgically removed due to cancer. He graduated from Ossining High School, where he was president of his class. His early career choices involved becoming a certified public accountant, and he worked as an efficiency expert for the Budget Bureau of the state of Connecticut before becoming an actor. On choosing to change careers, he studied the acting art with Eva Le Gallienne and Sanford Meisner. His most famous role is that of the detective Columbo; however, this was not his first foray into acting the role of a detective. During a high school play, he stood in for such a role when the original student actor fell sick. He has been married twice, and is the father of two children:Catherine, a private detective in real life, and Jackie. He was diagnosed with dementia in 2008, which was most likely brought on by Alzheimer's disease, from which he died on June 23, 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4ODUwNDE3MF5BMl5BanBnXkFtZTYwMjA1NTM0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000393","name":"Peter Falk","idIMDB":"nm0000393"},"actorId":"nm0000393","character":"Morris Applebaum","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Laura San Giacomo","urlProfile":"http://www.imdb.com/name/nm0000624","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0NDg4NjEwN15BMl5BanBnXkFtZTcwODgxNzQ2Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 November 1962","placeOfBirth":" Hoboken, New Jersey, USA","birthName":"Laura A. San Giacomo","height":"5' 2\" (1.57 m)","bio":"Laura San Giacomo was born November 14, 1962 in West Orange, New Jersey, to MaryJo and John San Giacomo. She was raised in the nearby city of Denville. She went to Morris Knolls High School in Denville, where she got the acting bug and had the lead in several school plays. Laura got a Fine Arts degree, specializing in acting, at Carnegie Mellon School of Drama (Pittsburgh). After graduation, she moved to New York. During the late 1980s (1987-89) before starting her film career, she appeared on Spenser: For Hire (1985), Crime Story (1986), The Equalizer (1985), All My Children (1970) and Miami Vice (1984). Her breakout film was her first credited role in Steven Soderbergh's Sex, Lies, and Videotape (1989). The movie won the Cannes Film Festival's Grand Prize, the Palme d'Or. Laura received a Los Angeles Film Critics Association's New Generation Award and a Golden Globe nomination for her role. Next, she was Kit De Luca in Pretty Woman (1990) (1990) opposite Julia Roberts and Richard Gere. The film won the People's Choice Awards for Best Comedy and Best Film. On stage, Laura has appeared in many theater productions. She was on the Los Angeles stage in the Garry Marshall-Lowell Ganz production of \"Wrong Turn at Lungfish\", in \"North Shore Fish\" (WPA Theatre), in \"Three Sisters\" (Princeton/McCarter Theatre, New Jersey, 1992) and in \"Beirut\" (Off-Broadway, Westside Arts Theatre, New York City, 1987). She also starred in \"Italian American Reconciliation\" (Manhattan Theatre Club, New York City, 1988) and \"The Love Talker\" (Off-Broadway in 1988). In regional theater, Laura was in Shakespeare's \"The Tempest\", \"As You Like It\" and \"Romeo and Juliet\". She also starred in \"Crimes of the Heart\". During the early 1990s, she was busy making movies (Vital Signs (1990), Mr Quigley l'Australien (1990), Once Around (1991) (where she played Holly Hunter's sister), Under Suspicion (1991), Where the Day Takes You (1991) and Nina Takes a Lover (1994)). In 1994, she also appeared in Stephen King's television miniseries, The Stand (1994). During the mid 1990s, she also provided her voice to an animated series Gargoyles (1994). Offscreen, Laura got married to Cameron Dye in 1990 (and divorced in 1998). They had a son, Mason, in 1996. Having a child influenced Laura to make the transition to television. She started in the sitcom Just Shoot Me! (1997), which also starred George Segal (as her father, Jack), Wendie Malick, Enrico Colantoni and David Spade. Television gave her a more regular work schedule and less traveling. The series lasted for seven seasons and 148 episodes. She appeared in all of them together with the other four regular cast members. After Just Shoot Me! (1997) was canceled in 2003, Laura appeared infrequently on television and in feature films. She was the narrator for Snapped (2004), a true crime series. In 2005, she appeared in two feature films (Checking Out (2005) and Havoc (2005)). In 2006, she was reunited with her Just Shoot Me! (1997) co-star Enrico Colantoni in Veronica Mars (2004), where she played Harmony Chase for three episodes. In September 2006, she secured a starring role in Saving Grace (2007) as Grace's (Holly Hunter's) best friend, Rhetta Rodriguez. Laura continued to play the role through all three seasons.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0NDg4NjEwN15BMl5BanBnXkFtZTcwODgxNzQ2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000624","name":"Laura San Giacomo","idIMDB":"nm0000624"},"actorId":"nm0000624","character":"Flo Applebaum","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Paymer","urlProfile":"http://www.imdb.com/name/nm0001601","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NjAwOTA5MF5BMl5BanBnXkFtZTYwODU4MjA1._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 August 1954","placeOfBirth":" Oceanside, Long Island, New York, USA","birthName":"David Charles Paymer","height":"5' 7\" (1.7 m)","bio":"One of modern TV and moviedom's most sturdy and reliable character actors, David Paymer dreamed of being an actor from early childhood. Although he came from a traditional middle-class Jewish family that urged him to become a doctor or lawyer, Paymer felt more at home in the world of the thespian. At 14, he used a fake I.D. to see The Graduate, which starred a young Dustin Hoffman. He grew up in Oceanside, New York, where his father was in the scrap metal business. His mother, a homemaker, had fled Belgium with her family to escape the Nazis. When his father quit the scrap metal business to pursue music, it inspired young Paymer to give his acting dream a try. His aborted big break came when he was cast in the TV series, St. Elsewhere, as \"Dr. Wayne Fiscus\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NjAwOTA5MF5BMl5BanBnXkFtZTYwODU4MjA1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001601","name":"David Paymer","idIMDB":"nm0001601"},"actorId":"nm0001601","character":"Ted Applebaum","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Judge Reinhold","urlProfile":"http://www.imdb.com/name/nm0001662","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMDU1OTg4MV5BMl5BanBnXkFtZTcwMzUzMDA3OA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 May 1957","placeOfBirth":" Wilmington, Delaware, USA","birthName":"Edward Ernest Reinhold Jr.","height":"6' 1\" (1.85 m)","bio":"Educated at Mary Washington College & North Carolina School of the Arts; performed at various regional theatres, including Burt Reynolds' Dinner Theater in Jupiter, Florida before getting national exposure on TV in the 1970s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMDU1OTg4MV5BMl5BanBnXkFtZTcwMzUzMDA3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001662","name":"Judge Reinhold","idIMDB":"nm0001662"},"actorId":"nm0001662","character":"Barry Apple","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeffrey D. Sams","urlProfile":"http://www.imdb.com/name/nm0760254","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NzE2MzE4NF5BMl5BanBnXkFtZTcwMzUyNjgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 September 1966","placeOfBirth":" Cincinnati, Ohio, USA","bio":"Jeffrey D. Sams was born on September 1, 1966 in Cincinnati, Ohio, USA. He is an actor, known for Soul Food (1997), Waiting to Exhale (1995) and Fly by Night (1992). He has been married to Lisa Bourcier since April 18, 1998. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NzE2MzE4NF5BMl5BanBnXkFtZTcwMzUyNjgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0760254","name":"Jeffrey D. Sams","idIMDB":"nm0760254"},"actorId":"nm0760254","character":"Dr. Sheldon Henning","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shera Danese","urlProfile":"http://www.imdb.com/name/nm0199418","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1Mzk3ODQwN15BMl5BanBnXkFtZTcwMjE0MjU3NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1949","placeOfBirth":" Hartsdale, New York, USA","height":"5' 7\" (1.7 m)","bio":"Shera Danese was born on October 9, 1949 in Hartsdale, New York, USA. She is an actress, known for Risky Business (1983), John Q (2002) and Alpha Dog (2006). She was previously married to Peter Falk.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1Mzk3ODQwN15BMl5BanBnXkFtZTcwMjE0MjU3NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0199418","name":"Shera Danese","idIMDB":"nm0199418"},"actorId":"nm0199418","character":"Rhonda Apple","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mary Elizabeth Winstead","urlProfile":"http://www.imdb.com/name/nm0935541","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE3MTU2NjU0OF5BMl5BanBnXkFtZTgwNjgwNzgwNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 November 1984","placeOfBirth":" Rocky Mount, North Carolina, USA","height":"5' 8\" (1.73 m)","bio":"Mary Elizabeth Winstead is a gifted actress, known for her versatile work in a variety of film and television projects. Possibly most known for her role as Ramona Flowers in Scott Pilgrim vs. the World (2010), she has also starred in critically acclaimed independent films such as Smashed (2012), for which she received an Independent Spirit Award nomination, as well as genre fare like Destination finale 3 (2006) and Quentin Tarantino's Death Proof (2007). Winstead was born in Rocky Mount, North Carolina but largely raised in Sandy, Utah which is where she discovered a love for the performing arts. She grew up training to be a ballerina and attended the Joffrey Ballet School training program at the age of 12. It was also around this time that she began to pursue a career in acting and soon started working steadily in television and film. Winstead is also a recording artist and performs under the name \"Got a Girl\" alongside producer Dan the Automotor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE3MTU2NjU0OF5BMl5BanBnXkFtZTgwNjgwNzgwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0935541","name":"Mary Elizabeth Winstead","nicknames":["MEW","Mary"],"idIMDB":"nm0935541"},"actorId":"nm0935541","character":"Lisa Apple","urlCharacter":"http://www.imdb.com/character/ch0418708","main":true},{"actorName":"Dan Byrd","urlProfile":"http://www.imdb.com/name/nm0126004","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2Nzc3MTMyMV5BMl5BanBnXkFtZTgwNTM3NTEyNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 November 1985","placeOfBirth":" Marietta, Georgia, USA","height":"5' 9\" (1.75 m)","bio":"It was over a decade ago when Marietta, Georgia, resident Dan Byrd was first bitten by the acting bug. The then-8-year-old Byrd went to see a live performance of Andrew Lloyd Webber's \"The Phantom of the Opera\" on Broadway and was hooked. Now all grown up and living in Los Angeles, California, Byrd has seen his childhood dream through. His break came break in 1998 after countless local productions and commercials when Byrd--who attended Marietta city schools up until high school and was home schooled for the last four years of his education--was cast in the Lifetime Network television series Any Day Now (1998), starring Lorraine Toussaint. Byrd sometimes may be longing for sweet tea and Krispy Kreme donuts, but he looked forward to his starring role in Clubhouse (2004), a new television series about baseball that was canceled shortly after its debut on CBS.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2Nzc3MTMyMV5BMl5BanBnXkFtZTgwNTM3NTEyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0126004","name":"Dan Byrd","idIMDB":"nm0126004"},"actorId":"nm0126004","character":"Jason Apple","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony Todd","urlProfile":"http://www.imdb.com/name/nm0865302","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTI1Njc4NV5BMl5BanBnXkFtZTcwMDg4NzcyNg@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 December 1954","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Anthony Tiran Todd","height":"6' 5\" (1.96 m)","bio":"Perhaps best known for his chilling performance as \"Candyman\", the charismatic 6' 5\" actor Tony Todd has consistently turned in compelling performances since his debut in the fantasy film Sleepwalk (1986). Born in Washington, D.C., Todd spent two years on a scholarship at the University of Connecticut, which, in turn, led to a scholarship from the renowned Eugene O'Neill National Theatre Institute. It proved to be the foundation for intense stints at the Hartman Conservatory in Stamford, Connecticut and the Trinity Square Repertory Theatre Conservatory in Providence, Rhode Island. Todd appeared in dozens of classical and many experimental plays, yet still managed to find time to teach playwriting to high school students in the Hartford public school system. Todd's extensive credits exemplify his versatility. They include such film classics as The Rock (1996), The Crow (1994), Lean on Me (1989), Bird (1988), Night of the Living Dead (1990), Destination finale (2000), the multiple Academy Award winning Oliver Stone film Platoon (1986) and Le secret (2000), which was nominated and screened at the Cannes Film Festival. Todd's recent films include the independent film Silence (2002) and Final Destination 2 (2003). He has had prominent guest starring roles in numerous critically-acclaimed television series, including recurring on Boston Public (2000), For the People (2002) and The District (2000), as well as NYPD Blue (1993), Smallville (2001), Law & Order (1990), Crossing Jordan (2001), Homicide: Life on the Street (1993) and The X-Files (1993). Todd recurred on three incarnations of \"Star Trek\" and guest starred on Xena: Warrior Princess (1995) and episodes of CSI: Miami (2002) and Andromeda (2000). His television movies include starring roles in True Women (1997), Black Fox (1995), Butter (1998), Ivory Hunters (1990), Babylon 5: A Call to Arms (1999) and Control Factor (2003). Todd's considerable theatre credits include the world premiere of award-winning playwright August Wilson's \"King Hedley II\", where he originated the title role in Pittsburgh, Seattle and Boston. Variety commented: \"Todd's King Hedley dominates the stage. A sour-faced mix of rage and resolve, anger and vulnerability. Todd's Hedley was a memorable tour-de-force even on opening.\" He also received a coveted Helen Hayes nomination for his performance in Athol Fugard's \"The Captain's Tiger at La Jolla, the Manhattan Theatre Club and the Kennedy Center. Other theatre credits include \"Les Blancs\", \"Playboy of the West Indies\", \"Othello\", \"Zooman and the Sign\", award-winning playwright Keith Glover's \"Dark Paradise\", \"Aida\" (on Broadway), and most recently, \"Levee James\" for the prestigious Eugene O'Neill Playwrights Conference and The New Dramatist Guild.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTI1Njc4NV5BMl5BanBnXkFtZTcwMDg4NzcyNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0865302","name":"Tony Todd","idIMDB":"nm0865302"},"actorId":"nm0865302","character":"Manuel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alex Datcher","urlProfile":"http://www.imdb.com/name/nm0202131","urlPhoto":"","biography":{"dateOfBirth":"6 June 1962","placeOfBirth":" Chicago, Illinois, USA","birthName":"Cynthia Alex Datcher","bio":"Alex Datcher was born on June 6, 1962 in Chicago, Illinois, USA as Cynthia Alex Datcher. She is an actress, known for Passenger 57 (1992), Body Bags (1993) and Goode Behavior (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0202131","name":"Alex Datcher","idIMDB":"nm0202131"},"actorId":"nm0202131","character":"Raphaella","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Bowe","urlProfile":"http://www.imdb.com/name/nm0100762","urlPhoto":"","biography":{"dateOfBirth":"4 January 1964","placeOfBirth":" Los Angeles, California, USA","bio":"David Bowe has either appeared in or been the \"voice\" of literally hundreds of National Television and radio commercials! Beginning in 1979 as a teenager helping mom push the car out of the mud for AMC Family Wagon! Through 2016, where he continued in his 6th year as the Voice of IHOP! In between he has appeared in ads for Wendy's, Oscar Meyer, HoneyNut Cheerios, Bud Light, Eggo Waffles, Frosted Flakes, Kodak, Burger King, Ca Lottery, Jack in the Box, Blockbuster Video, Saturn Cars, Taquita Coolers not to mention the on camera spokesman for the launch of MCI friends & family and the first human to appear in the annual \"Bud Bowl\" campaign for the Super Bowl!! He has been \"heard\" by millions as the recognizable Voice of IHOP family restaurants for the past 6 & a half years! Before that recorded voice-overs for hundreds of TV & radio spots! Including, Buick, Diet Dr. Pepper, Intel, Best Buy, Cool from Nestea, AMC theaters, Old Milwaukee Beer, Comp USA and for over 10 years was one of the voices of Fred Meyer superstores located in the Pacific northwest! Not to mention over a hundred Motion Pictures and television appearances over the past 30 years!","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0100762","name":"David Bowe","idIMDB":"nm0100762"},"actorId":"nm0100762","character":"Allen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bob Bancroft","urlProfile":"http://www.imdb.com/name/nm0051619","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNTIyMjY2N15BMl5BanBnXkFtZTgwMjAyMTI5NzE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"bio":"Bob Bancroft grew up off the grid in the backwoods of Vermont, the son of a Harvard-educated lumberjack and tennis court builder, and a World War II Army nurse. Sometime in the 70's, he moved from a tent in the Green Mountains to a tiny apartment next to a Jello factory in Hollywood. He's been a breakfast chef at a restaurant billed as \"the home of 47 waffle varieties\", a waiter at an all-night deli, a delivery man for a blueprint supply shop, a newspaper writer, a magazine and book editor, and a ghostwriter for a celebrity gossip column. Audiences now know him from a string of film and television performances dating from the mid 80's - scientists and doctors, priests and killers, regular guys and nut jobs. He spent 3 years on CBS's Chicago Hope (1994), and was the nefarious Mr. Lutz on Disney's Zenon: Girl of the 21st Century (1999). Recent highlights include appearances on American Horror Story, Parks and Recreation, Castle, Glee, and many others. Yes, he's been featured on several Buzzfeed lists, but no, he's not the dad from ALF.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNTIyMjY2N15BMl5BanBnXkFtZTgwMjAyMTI5NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0051619","name":"Bob Bancroft","idIMDB":"nm0051619"},"actorId":"nm0051619","character":"Foyt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Luis Antonio Ramos","urlProfile":"http://www.imdb.com/name/nm0708696","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE2NzYzMjIzMV5BMl5BanBnXkFtZTcwNzk5NTM2NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Luis Antonio Ramos was born in San German, Puerto Rico. He is an actor and producer, known for Power (2014), Do the Right Thing (1989) and Martin (1992).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE2NzYzMjIzMV5BMl5BanBnXkFtZTcwNzk5NTM2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0708696","name":"Luis Antonio Ramos","idIMDB":"nm0708696"},"actorId":"nm0708696","character":"Luis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Galen Yuen","urlProfile":"http://www.imdb.com/name/nm0950724","urlPhoto":"","biography":{"bio":"Galen Yuen is an actor and writer, known for Rescue Dawn (2006), Crank: High Voltage (2009) and Kindergarten Cop (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0950724","name":"Galen Yuen","idIMDB":"nm0950724"},"actorId":"nm0950724","character":"Foreman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joey Gray","urlProfile":"http://www.imdb.com/name/nm1521645","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA1MDgwOTcxOF5BMl5BanBnXkFtZTgwOTg1ODE3OTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 December 1983","placeOfBirth":" New York City, New York, USA","bio":"Joey Gray first appeared in a number of national television commercials as a child actor. Years later, while studying at David Mamet's Atlantic Theater Company in New York, he was offered a small role in the cult film \"Party Monster.\" Shortly after, he moved to Los Angeles and found work on several notable television series, including \"7th Heaven,\" \"Weeds,\" and \"Desperate Housewives.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA1MDgwOTcxOF5BMl5BanBnXkFtZTgwOTg1ODE3OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1521645","name":"Joey Gray","idIMDB":"nm1521645"},"actorId":"nm1521645","character":"Dan","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0417532","urlIMDB":"http://www.imdb.com/title/tt0417532","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Mark Lane"},"technical":{"runtime":["1 hr 34 min (94 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.2","metascore":"44","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"PG-13","awards":[{"award":"Palm Beach International Film Festival 2005","titlesAwards":[{"titleAwardOutcome":"Won Best Actress","categories":[{"category":"","names":[{"name":"Laura San Giacomo","id":"nm0000624","role":null}]}]},{"titleAwardOutcome":"Won Best Director","categories":[{"category":"","names":[{"name":"Jeff Hare","id":"nm0362799","role":null}]}]}]},{"award":"Phoenix Film Festival 2005","titlesAwards":[{"titleAwardOutcome":"Won Copper Wing Award","categories":[{"category":"Best Picture","names":[{"name":"Jeff Hare","id":"nm0362799","role":null}]},{"category":"Best Screenplay","names":[{"name":"Richard Marcus","id":"nm1661897","role":null}]}]}]},{"award":"WorldFest Houston 2005","titlesAwards":[{"titleAwardOutcome":"Won Platinum Award","categories":[{"category":"Independent Theatrical Feature Films &amp; Videos - Comedy","names":[{"name":"Mark Stuart Lane","id":"nm0485465","role":null}]}]}]}],"votes":"580","type":"Movie","companyCreditsSimple":[{"idCompany":"co0082126","name":"Full Circle Studios"},{"idCompany":"co0165115","name":"Fully Attired Film Group LLC"}],"keywords":{"keywords":["suicide","actor","suicide thoughts","suicide of father","suicide contemplation","suicide by pills","shakespearean quotation","reference to shakespeare's the tempest","reference to william shakespeare","reference to shakespeare's hamlet","quoting shakespeare","painter","jew","jewish","jewish culture","interracial romance","interracial relationship","interracial marriage","interracial love","interracial love relationship","interracial kiss","hamlet spoof","gorilla","gorilla suit","eccentric","eccentric senior citizen","costume","contemplating suicide","car salesman","car dealer","black man","black man white woman relationship","black comedy","animal costume","african american","african american man","based on play"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:33:31"}}