{"data":{"movies":[{"title":"Because I Said So","originalTitle":"","year":"2007","releaseDate":"20070202","directors":[{"name":"Michael Lehmann","id":"nm0499724"}],"writers":[{"name":"Karen Leigh Hopkins","id":"nm0394212"},{"name":"Jessie Nelson","id":"nm0625458"}],"runtime":"102 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNjU4NTMzNl5BMl5BanBnXkFtZTcwNzk3NzI0MQ@@._V1.jpg","countries":["USA"],"languages":["English","Mandarin","Italian"],"genres":["Comedy","Romance"],"plot":"Daphne Wilder is a mother whose love knows no bounds or boundaries. She is the proud mom of three daughters: stable psychologist Maggie, sexy and irreverent Mae and insecure, adorable Milly - who, when it comes to men, is like psychotic flypaper. In order to prevent her youngest from making the same mistakes she did, Daphne decides to set Milly up with the perfect man. Little does Milly know, however, that her mom placed an ad in the on-line personals to find him. Comic mayhem unfolds as Daphne continues to do the wrong thing for the right reasons...all in the name of love. In a battle of strong wills, the mother-daughter dynamic is tested in all its fierce, wacky complexity. The girls help Daphne finally discover the truths and impossibilities of motherly love, all while trying to answer the questions: where does it begin and where should it end?","simplePlot":"A meddling mother tries to set her daughter up with the right man so her kid won't follow in her footsteps.","actors":[{"actorName":"Diane Keaton","urlProfile":"http://www.imdb.com/name/nm0000473","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU5NjMwOTk2NV5BMl5BanBnXkFtZTYwODg1NzY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1946","placeOfBirth":" Los Angeles, California, USA","birthName":"Diane Hall","height":"5' 6½\" (1.69 m)","bio":"Diane Keaton was born Diane Hall in Los Angeles, California, to Dorothy Deanne (Keaton), an amateur photographer, and John Newton Ignatius \"Jack\" Hall, a civil engineer and real estate broker. Her ancestry includes Irish, English, German, and Scottish. Keaton studied Drama at Santa Ana College before dropping out to study at the Neighborhood Playhouse in New York. After appearing in summer stock for several months, she got her first major stage role in the Broadway rock musical \"Hair.\" As understudy to the lead, she gained attention by not removing any of her clothing. In 1970, Woody Allen cast her in his Broadway play \"Play It Again, Sam,\" which had a successful run. It was during this time that she became involved with Allen and appeared in a number of his films. The first one was Play It Again, Sam (1972), the screen adaptation of the stage play. That same year Francis Ford Coppola cast her as Kay in the Oscar-winning The Godfather (1972), and she was on her way to stardom. She reprized that role in the film's first sequel, The Godfather: Part II (1974). She then appeared with Allen again in Sleeper (1973) and Love and Death (1975). In 1977 she broke away from her comedy image to appear in the chilling Looking for Mr. Goodbar (1977), which won her a Golden Globe nomination. It was the same year that she appeared in what many regard as her best performance, in the title role of Annie Hall (1977), which Allen wrote specifically for her (her real last name is Hall, and her nickname is Annie), and what an impact she made. She won the Oscar and the British Award for Best Actress, and Allen won the Directors Award from the DGA. She started a fashion trend with her unisex clothes and was the poster girl for a lot of young males. Her mannerisms and awkward speech became almost a national craze. The question being asked, though, was, \"Is she just a lightweight playing herself, or is there more depth to her personality?\" For whatever reason, she appeared in but one film a year for the next two years and those films were by Allen. When they broke up she was next involved with Warren Beatty and appeared in his film Reds (1981), as the bohemian female journalist Louise Bryant. For her performance she received nominations for the Academy Award and the Golden Globe. For the rest of the 1980s she appeared infrequently in films but won nominations in three of them. Attempting to break the typecasting she had fallen into, she took on the role of a confused, somewhat naive woman who becomes the tool of Middle Eastern terrorists in The Little Drummer Girl (1984). To offset her lack of movie work, Diane began directing. She directed the documentary Heaven (1987), as well as some music videos. For television she directed an episode of the popular, but strange, Twin Peaks (1990). In the 1990s she began to get more mature roles, though she reprized the role of Kay Corleone in the third \"Godfather\" epic, The Godfather: Part III (1990). She appeared as the wife of Steve Martin in the hit Father of the Bride (1991) and again in Father of the Bride Part II (1995). In 1993 she once again teamed with Woody Allen in Manhattan Murder Mystery (1993), which was well received. In 1995 she received high marks for Unstrung Heroes (1995), her first major feature as a director.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU5NjMwOTk2NV5BMl5BanBnXkFtZTYwODg1NzY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000473","name":"Diane Keaton","nicknames":["Annie"],"idIMDB":"nm0000473"},"actorId":"nm0000473","character":"Daphne Wilder","urlCharacter":"http://www.imdb.com/character/ch0020534","main":true},{"actorName":"Mandy Moore","urlProfile":"http://www.imdb.com/name/nm0601553","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NTEzNDgzOF5BMl5BanBnXkFtZTcwNTMwNjk4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1984","placeOfBirth":" Nashua, New Hampshire, USA","birthName":"Amanda Leigh Moore","height":"5' 10\" (1.78 m)","bio":"Amanda Leigh Moore was born in Nashua, New Hampshire, on April 10, 1984, to Stacy (Friedman), a former news reporter, and Don Moore, an airline pilot. During her childhood, her family moved to Orlando, Florida, where she was raised. She has Russian Jewish (from her maternal grandfather), English, and some Scottish and Irish, ancestry. After seeing the musical \"Oklahoma!\", she decided that she wanted to pursue a career in singing. As a child, she performed the National Anthem at several athletic events around her hometown of Orlando, Florida, and became known as the \"National Anthem girl\". At the ripe age of 14, while she was recording in a studio in Orlando, a Fed-Ex worker who happened to be passing through heard her and was interested in her talent. He happened to know someone at Sony as well. Moore worked on cutting a demo and shortly thereafter signed a record deal with Sony 550 Music. At 15, her first record \"So Real\" was released. Her first tour was with the Backstreet Boys. As her touring and recording schedule demanded more of her time, Moore withdrew from Bishop Moore Catholic High School in Orlando and opted for a tutor/correspondence. She has stated that her education is important to her and says that the fact that she wants to go to college motivates her to continue with her schooling. Though Moore's record sales were not up in the ranks of Britney Spears or Christina Aguilera, she has proved to be a formidable talent both in singing and in acting, and snagged an MTV Movie Award in June 2002 for her first feature film role in A Walk to Remember (2002). Her biggest dream, though, is to perform on Broadway someday.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NTEzNDgzOF5BMl5BanBnXkFtZTcwNTMwNjk4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0601553","name":"Mandy Moore","idIMDB":"nm0601553"},"actorId":"nm0601553","character":"Milly Wilder","urlCharacter":"http://www.imdb.com/character/ch0020531","main":true},{"actorName":"Gabriel Macht","urlProfile":"http://www.imdb.com/name/nm0532683","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA2ODkwMjc3MV5BMl5BanBnXkFtZTcwOTc4ODYwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 January 1972","placeOfBirth":" The Bronx, New York City, New York, USA","height":"6' (1.83 m)","bio":"Gabriel Macht is an American actor. He was born in the Bronx, New York, to Suzanne, a museum curator and archivist, and actor Stephen Macht. Gabriel has three siblings, and moved with his parents to California when he was young. Gabriel had his first success on screen when he was 8-years-old. He was nominated for a Best Young Motion Picture Actor Award for his performance in the movie Why Would I Lie? (1980). Briefly withdrawing from the business as a child, he returned as an adult with favorable roles that further developed his talents. After high school, Macht studied theatre at Carnegie Mellon School of Drama in Pittsburgh. Macht remains active in the theater and is involved with the Mad Dog Theater Company in New York where he performed the play \"To Whom It May Concern\" for the company at the Belgrade International Theatre Festival in 1997. His other theater credits include \"Steve Martin's Picasso at the Lapin Agile\" at Promenade Theater Off Broadway and Theater on the Square in San Francisco; Roger Kumble's \"Turnaround\" at the Coast Playhouse in Los Angeles; \"La Ronde\" directed by Joanne Woodward at Williamstown Theater Festival; \"What the Butter Saw\" directed by Joe Dowling at Arena Stage in Washington DC. On the big screen, Macht was seen in Edward Zwick's highly acclaimed, \"Love & Other Drugs\" where he starred opposite Jake Gyllenhaal and Anne Hathaway who were both nominated for Golden Globes® for their performances. Macht also starred in the comic book inspired film, \"The Spirit\" as the titular character opposite Samuel Jackson, Scarlett Johannson, and Eva Mendes directed by Frank Miller. He was previously seen in Robert De Niro's critically acclaimed film, \"The Good Shepherd\" with Matt Damon and Angelina Jolie. Macht's additional screen credits include the comic drama \"Middle Men\" with Giovanni Ribisi and Luke Wilson, the arctic thriller \"Whiteout\" with Kate Beckinsale, the romantic comedy \"Because I Said So\" with Diane Keaton; Joel Schumacher's \"Bad Company\" opposite Anthony Hopkins; \"The Recruit\" opposite Al Pacino and Colin Farrell; \"Behind Enemy Lines\" with Owen Wilson and Gene Hackman and \"American Outlaws\" where he first starred opposite Colin Farrell. His role in \"A Love Song for Bobby Long\" garnered Macht critical acclaim for his performance as the tormented writer, Lawson Pines' starring opposite John Travolta and Scarlett Johansson in the 2004 film. On television, Macht had guest starring roles on \"Sex and the City,\" and \"Spin City\" and was a regular on Steven Spielberg's supernatural drama for NBC \"The Others,\" and starred as William Holden in ABC's \"The Audrey Hepburn Story\". Macht is best known for his role as Harvey Specter in USA drama Suits (2011). He resides in New York, Los Angeles, and the Sunshine Coast, Australia. He is of Ashkenazi Jewish descent on both sides of his family.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA2ODkwMjc3MV5BMl5BanBnXkFtZTcwOTc4ODYwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0532683","name":"Gabriel Macht","idIMDB":"nm0532683"},"actorId":"nm0532683","character":"Johnny","urlCharacter":"http://www.imdb.com/character/ch0020535","main":true},{"actorName":"Tom Everett Scott","urlProfile":"http://www.imdb.com/name/nm0779866","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyMDU0NDA0OV5BMl5BanBnXkFtZTcwMDI0MzgyMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1970","placeOfBirth":" East Bridgewater, Massachusetts, USA","height":"6' 2\" (1.88 m)","bio":"Tom Everett Scott was born and raised in East Bridgewater, Massachusetts, the 3rd of 4 children of Cynthia (Pierce), an insurance saleswoman, and William Joseph Scott, who was a civil engineer. Tom spent his childhood in a \"nice house in the woods\", with a pond nearby, canoeing and camping. He acted in high school plays, but Tom planned to quit acting, and take a more serious look at the world. So, he enrolled in communications at Syracuse University in 1988. During his sophomore year he says \"I went down to the theater and saw everything going on-people jumping around being idiots-and I thought, 'This is my home. This is where I should be.'\" So, Tom switched his major to drama, and upon graduating, he moved to New York City. There, he waited tables, and eventually founded a theater company with 3 college buddies that they named \"aTheaterco\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyMDU0NDA0OV5BMl5BanBnXkFtZTcwMDI0MzgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0779866","name":"Tom Everett Scott","idIMDB":"nm0779866"},"actorId":"nm0779866","character":"Jason","urlCharacter":"http://www.imdb.com/character/ch0020536","main":true},{"actorName":"Lauren Graham","urlProfile":"http://www.imdb.com/name/nm0334179","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4OTQ0NTExMV5BMl5BanBnXkFtZTYwMDkyNDQz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 March 1967","placeOfBirth":" Honolulu, Hawaii, USA","birthName":"Lauren Helen Graham","height":"5' 9\" (1.75 m)","bio":"Lauren Graham was born in Honolulu, Hawaii, to Donna Grant and Lawrence Graham, a candy industry lobbyist. Her father was from New York and her mother was from the American South, and Lauren has Irish, English, and Scottish ancestry. She grew up in Northern Virginia, USA (Fairfax, Arlington, and Great Falls, VA) Graduate of Langley High School, McLean, VA Graduate of Barnard College with a Bachelor's Degree in English. Graduate of Southern Methodist University with a Master's Degree in Acting. She was raised by a single parent, her father. Her parents divorced when she was 5. Growing up she wanted to be a jockey but her height precluded it. She traveled extensively with her father during her childhood and discovered acting while in elementary school. Her resume includes theatre, film and television.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4OTQ0NTExMV5BMl5BanBnXkFtZTYwMDkyNDQz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0334179","name":"Lauren Graham","idIMDB":"nm0334179"},"actorId":"nm0334179","character":"Maggie","urlCharacter":"http://www.imdb.com/character/ch0020533","main":true},{"actorName":"Piper Perabo","urlProfile":"http://www.imdb.com/name/nm0005305","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NjU2MjIyMV5BMl5BanBnXkFtZTYwNDk5MDM1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1976","placeOfBirth":" Dallas, Texas, USA","birthName":"Piper Lisa Perabo","height":"5' 5½\" (1.66 m)","bio":"Piper Perabo was born in Dallas, Texas, to Mary Charlotte (Ulland), a physical therapist, and George William Perabo, a poetry professor. Her mother is of Norwegian descent and her father is of German, Irish, and English ancestry (the surname \"Perabo\" originates in Germany). After graduating college, Piper moved to New York and was cast in a short film called Single Spaced (1997). Her first big role came after that, where she played the girlfriend of a wannabe rapper in Whiteboys (1999). In 2000 she was cast in The Adventures of Rocky & Bullwinkle (2000) as FBI agent Karen Sympathy. However, the role that really got her recognized was in Coyote Ugly (2000). She played Violet Sanford aka \"Jersey,\" who moves to New York to pursue her dream of becoming a songwriter. In 2001, she starred in an independent Canadian movie called Lost and Delirious (2001), playing a boarding-school student who falls in love with another girl. The next year, she starred as a French exchange student in Slap Her, She's French! (2002). In 2003, she had a small role as the oldest daughter in Cheaper by the Dozen (2003), which also starred Steve Martin, Ashton Kutcher, and Bonnie Hunt. She has also appeared in The I Inside (2004), Perfect Opposites (2004), George and the Dragon (2004), Edison (2005), The Cave (2000), and 10th & Wolf (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NjU2MjIyMV5BMl5BanBnXkFtZTYwNDk5MDM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005305","name":"Piper Perabo","idIMDB":"nm0005305"},"actorId":"nm0005305","character":"Mae","urlCharacter":"http://www.imdb.com/character/ch0020532","main":true},{"actorName":"Stephen Collins","urlProfile":"http://www.imdb.com/name/nm0004834","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMzU0OTYxM15BMl5BanBnXkFtZTYwODgzNzIz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1947","placeOfBirth":" Des Moines, Iowa, USA","birthName":"Stephen Weaver Collins","height":"6' 0½\" (1.84 m)","bio":"Stephen Collins was born on October 1, 1947 in Des Moines, Iowa, USA as Stephen Weaver Collins. He is an actor, known for 7th Heaven (1996), Blood Diamond (2006) and All the President's Men (1976). He was previously married to Faye Grant and Marjorie Weinman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMzU0OTYxM15BMl5BanBnXkFtZTYwODgzNzIz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004834","name":"Stephen Collins","idIMDB":"nm0004834"},"actorId":"nm0004834","character":"Joe","urlCharacter":"http://www.imdb.com/character/ch0064414","main":true},{"actorName":"Ty Panitz","urlProfile":"http://www.imdb.com/name/nm1892830","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NjcwNDk1OF5BMl5BanBnXkFtZTcwMjgyOTkyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1999","placeOfBirth":" California, USA","height":"4' 10\" (1.47 m)","bio":"Ty Panitz was born on April 8, 1999 in California, USA. He is an actor, known for Because I Said So (2007), Yours, Mine & Ours (2005) and How to Eat Fried Worms (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NjcwNDk1OF5BMl5BanBnXkFtZTcwMjgyOTkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1892830","name":"Ty Panitz","idIMDB":"nm1892830"},"actorId":"nm1892830","character":"Lionel","urlCharacter":"http://www.imdb.com/character/ch0064415","main":true},{"actorName":"Matt Champagne","urlProfile":"http://www.imdb.com/name/nm0150623","urlPhoto":"","biography":{"bio":"Matt Champagne is an actor and writer, known for Because I Said So (2007), Dragonfly (2002) and Superhero Movie (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0150623","name":"Matt Champagne","idIMDB":"nm0150623"},"actorId":"nm0150623","character":"Eli","urlCharacter":"http://www.imdb.com/character/ch0064416","main":true},{"actorName":"Colin Ferguson","urlProfile":"http://www.imdb.com/name/nm0272399","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMzk3ODA4NV5BMl5BanBnXkFtZTcwNjQxNDgyMQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1972","placeOfBirth":" Montreal, Québec, Canada","height":"5' 11\" (1.8 m)","bio":"Colin Ferguson was born on July 22, 1972 in Montreal, Québec, Canada. He is an actor and producer, known for Eureka (2006), The Opposite of Sex (1998) and Because I Said So (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMzk3ODA4NV5BMl5BanBnXkFtZTcwNjQxNDgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0272399","name":"Colin Ferguson","idIMDB":"nm0272399"},"actorId":"nm0272399","character":"Derek","urlCharacter":"http://www.imdb.com/character/ch0064417","main":true},{"actorName":"Tony Hale","urlProfile":"http://www.imdb.com/name/nm0355024","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNjI2OTg1NV5BMl5BanBnXkFtZTcwODI2MTc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1970","placeOfBirth":" West Point, New York, USA","birthName":"Anthony R. Hale","height":"6' 1\" (1.85 m)","bio":"Tony Hale was born on September 30, 1970 in West Point, New York, USA as Anthony R. Hale. He is an actor and producer, known for Arrested Development (2003), Stranger Than Fiction (2006) and Veep (2012). He has been married to Martel Thompson since May 24, 2003. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNjI2OTg1NV5BMl5BanBnXkFtZTcwODI2MTc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0355024","name":"Tony Hale","idIMDB":"nm0355024"},"actorId":"nm0355024","character":"Stuart","urlCharacter":"http://www.imdb.com/character/ch0064418","main":true},{"actorName":"Sophina Brown","urlProfile":"http://www.imdb.com/name/nm1330166","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU5MGU0M2ItMjQ5MC00MzRkLThhMDEtNWJjNzRhZDhhMjFjXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1976","placeOfBirth":" Saginaw, Michigan, USA","bio":"Sophina Brown was born on September 18, 1976 in Saginaw, Michigan, USA. She is known for her work on Shark (2006), Numb3rs (2005) and Because I Said So (2007). She has been married to Henry Simmons since May 2010.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU5MGU0M2ItMjQ5MC00MzRkLThhMDEtNWJjNzRhZDhhMjFjXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1330166","name":"Sophina Brown","nicknames":["Sophia","Sophie"],"idIMDB":"nm1330166"},"actorId":"nm1330166","character":"Milly's Staff #1 / Matisse","urlCharacter":"http://www.imdb.com/character/ch0268900","main":true},{"actorName":"Karen Leigh Hopkins","urlProfile":"http://www.imdb.com/name/nm0394212","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDg4YmRmM2ItOGRjYS00MjVlLTlmZmItODNkNWY0MDEwM2EyXkEyXkFqcGdeQXVyNzQ4OTMyMDU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Karen Leigh Hopkins is an actress and writer, known for Stepmom (1998), Because I Said So (2007) and The Running Man (1987).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDg4YmRmM2ItOGRjYS00MjVlLTlmZmItODNkNWY0MDEwM2EyXkEyXkFqcGdeQXVyNzQ4OTMyMDU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0394212","name":"Karen Leigh Hopkins","idIMDB":"nm0394212"},"actorId":"nm0394212","character":"Milly's Staff #2 / Charlie","urlCharacter":"http://www.imdb.com/character/ch0268900","main":true},{"actorName":"Emily Maisano","urlProfile":"http://www.imdb.com/name/nm2503105","urlPhoto":"","biography":{"bio":"Emily Maisano is known for her work on Because I Said So (2007), Danny Collins (2015) and Fred Claus (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2503105","name":"Emily Maisano","idIMDB":"nm2503105"},"actorId":"nm2503105","character":"Milly's Staff #3","urlCharacter":"http://www.imdb.com/character/ch0268900","main":true},{"actorName":"Gerald Downey","urlProfile":"http://www.imdb.com/name/nm1042741","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTMwMTQyNTIyNl5BMl5BanBnXkFtZTgwMjE0NDkzMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 2\" (1.88 m)","bio":"Gerald Downey is an actor, known for Live Free or Die Hard (2007), Eagle Eye (2008) and Evan Almighty (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTMwMTQyNTIyNl5BMl5BanBnXkFtZTgwMjE0NDkzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1042741","name":"Gerald Downey","nicknames":["Gerry"],"idIMDB":"nm1042741"},"actorId":"nm1042741","character":"Cousin Dougy's Friend","urlCharacter":"http://www.imdb.com/character/ch0268944","main":true}],"seasons":[],"idIMDB":"tt0490084","urlIMDB":"http://www.imdb.com/title/tt0490084","business":{"budget":null,"openingWeekend":[{"money":"$13,122,865","country":"USA","day":"04","month":"02","year":"2007","remarks":"2,526 Screens"},{"money":"£400,987","country":"UK","day":"18","month":"02","year":"2007","remarks":"239 Screens"}],"gross":[{"money":"$42,674,040","country":"USA","day":"05","month":"04","year":"2007","remarks":""},{"money":"$42,640,890","country":"USA","day":"01","month":"04","year":"2007","remarks":""},{"money":"$42,304,410","country":"USA","day":"18","month":"03","year":"2007","remarks":""},{"money":"$41,615,740","country":"USA","day":"11","month":"03","year":"2007","remarks":""},{"money":"$40,444,925","country":"USA","day":"04","month":"03","year":"2007","remarks":""},{"money":"$38,269,240","country":"USA","day":"25","month":"02","year":"2007","remarks":""},{"money":"$34,311,515","country":"USA","day":"18","month":"02","year":"2007","remarks":""},{"money":"$25,805,720","country":"USA","day":"11","month":"02","year":"2007","remarks":""},{"money":"$13,122,865","country":"USA","day":"04","month":"02","year":"2007","remarks":""},{"money":"£861,030","country":"UK","day":"25","month":"02","year":"2007","remarks":""},{"money":"£400,987","country":"UK","day":"18","month":"02","year":"2007","remarks":""},{"money":"$69,485,490","country":"Worldwide","day":"12","month":"10","year":"2008","remarks":""},{"money":"$26,811,450","country":"Non-USA","day":"12","month":"10","year":"2008","remarks":""}],"weekendGross":[{"money":"$56,445","country":"USA","day":"01","month":"04","year":"2007","remarks":"124 Screens"},{"money":"$341,235","country":"USA","day":"18","month":"03","year":"2007","remarks":"452 Screens"},{"money":"$712,545","country":"USA","day":"11","month":"03","year":"2007","remarks":""},{"money":"$1,334,505","country":"USA","day":"04","month":"03","year":"2007","remarks":""},{"money":"$2,758,815","country":"USA","day":"25","month":"02","year":"2007","remarks":"1,936 Screens"},{"money":"$6,053,850","country":"USA","day":"18","month":"02","year":"2007","remarks":"2,446 Screens"},{"money":"$9,221,130","country":"USA","day":"11","month":"02","year":"2007","remarks":"2,529 Screens"},{"money":"$13,122,865","country":"USA","day":"04","month":"02","year":"2007","remarks":"2,526 Screens"},{"money":"£183,612","country":"UK","day":"25","month":"02","year":"2007","remarks":"224 Screens"},{"money":"£400,987","country":"UK","day":"18","month":"02","year":"2007","remarks":"239 Screens"}],"admissions":[{"money":"500,990","country":"Germany","day":"26","month":"08","year":"2007","remarks":""},{"money":"416,185","country":"Germany","day":"19","month":"08","year":"2007","remarks":""},{"money":"285,768","country":"Germany","day":"12","month":"08","year":"2007","remarks":""},{"money":"110,943","country":"Germany","day":"05","month":"08","year":"2007","remarks":""},{"money":"32,098","country":"Netherlands","day":"31","month":"12","year":"2007","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"12","month":"12","year":"2005","remarks":null},null],"copyrightHolder":"(2006) Gold Circle Films, LLC"},"technical":{"runtime":["1 hr 42 min (102 min) (USA)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":["2,773 m (Portugal, 35 mm)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.6","metascore":"26","filmingLocations":[{"location":"Downtown, Los Angeles, California, USA"}],"rated":"PG-13","awards":[{"award":"Razzie Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Actress","names":[{"name":"Diane Keaton","id":"nm0000473","role":null}]}]}]}],"votes":"33,310","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"},{"idCompany":"co0076476","name":"Gold Circle Films"}],"keywords":{"keywords":["meddling","psychologist","you can say that again joke","sobbing female","subtitled scene","the end","female chef","reference to tennessee williams","answering machine message","posing for a photograph","say cheese photography","caught having sex","pushy mother","female lead","brunette woman","two timing","three sisters","looking for love","argument","split screen telephone call","interfering mother","dog humping","following someone in a car","satnav","playing piano","scene before opening credits","guitarist","cake in the face","watching a movie","sing along","blowing out candles on a birthday cake","rock paper scissors","diamond necklace","2000s","four word title","giving a toast","birthday wish","mother's birthday","kiss on the lips","parent grown child relationship","smother mother","polka dot dress","reference to minnie mouse","dating","two suitors","manipulation","loss of voice","therapy session","female protagonist","woman with glasses","lingerie slip","thong","cell phone","chick flick","psychology","misunderstanding","matchmaker","insecurity","wedding reception","therapy","split screen","spa","single father","singing","restaurant","premarital sex","personal ad","musician","massage","love triangle","locker room","laryngitis","guitar","grandfather","fitting room","farce","dog","date","couch","computer","cheating on boyfriend","caterer","cake","breakup","birthday party","beach","balloon","architect","sister sister relationship","los angeles california","father son relationship","mother daughter relationship","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:06:47"}}