{"data":{"movies":[{"title":"Gargoyle","originalTitle":"","year":"2004","releaseDate":"20041026","directors":[{"name":"Jim Wynorski","id":"nm0691061"}],"writers":[{"name":"Anthony L. Greene","id":"nm0338668"},{"name":"Ion Ionescu","id":"nm0409578"}],"runtime":"87 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU3NTU4NDI3MF5BMl5BanBnXkFtZTcwMzYyOTIxMw@@._V1.jpg","countries":["USA","Romania","Canada"],"languages":["English","Romanian"],"genres":["Action","Fantasy","Horror","Sci-Fi"],"plot":"Two CIA agents are sent to Bucharest, Romania to solve a high profile kidnapping. But what they discover is something inexplicable. An evil gargoyle, once thought dead and banished forever, has returned with a vengeance.","simplePlot":"Two CIA agents are sent to Bucharest, Romania to solve a high profile kidnapping. But what they discover is something inexplicable. An evil gargoyle, once thought dead and banished forever, has returned with a vengeance.","actors":[{"actorName":"Michael Paré","urlProfile":"http://www.imdb.com/name/nm0001595","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDAzNDQxNjI1OF5BMl5BanBnXkFtZTcwMjA1OTE3NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1958","placeOfBirth":" Brooklyn, New York, USA","birthName":"Michael Kevin Pare","height":"6' 1\" (1.85 m)","bio":"Michael Kevin Paré was born on October 9, 1958 in Brooklyn, New York City, to Joan (Moroney) and Francis Paré, who owned print shops. His father died of leukemia when Paré was five, leaving his mother to raise their large family of children. Paré was working as a chef in New York City when an agent, Yvette Bikoff, convinced him to try acting. Paré's first starring role was as Tony Villcana on the television series The Greatest American Hero (1981). His well-known film roles were as Eddie Wilson in Eddie and the Cruisers (1983) and its sequel Eddie and the Cruisers II: Eddie Lives! (1989), as well as Streets of Fire (1984) and The Philadelphia Experiment (1984). Other films include Moon 44 (1990), Village of the Damned (1995), Bad Moon (1996), Hope Floats (1998) and The Virgin Suicides (1999). On television, Paré starred with Michael Beck on the CBS police drama Houston Knights (1987), as well as the short lived science fiction series Starhunter (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDAzNDQxNjI1OF5BMl5BanBnXkFtZTcwMjA1OTE3NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001595","name":"Michael Paré","idIMDB":"nm0001595"},"actorId":"nm0001595","character":"Ty \"Griff\" Griffin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sandra Hess","urlProfile":"http://www.imdb.com/name/nm0381524","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2ODE5MzgzMl5BMl5BanBnXkFtZTcwMzU4MjczMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 March 1968","placeOfBirth":" Zürich, Switzerland","height":"5' 7\" (1.7 m)","bio":"Sandra Hess was born in Zurich, Switzerland. She began modeling and working on television commercials when she was just 15. After completing high school, she entered the University of Zurich to study law but quickly decided it wasn't the right direction for her. She came alone to the US to pursue an acting career. Once settled in Los Angeles, she began taking acting classes. Her first break was in the hit comedy Encino Man (1992), playing a cavewoman to Brendan Fraser's caveman character. She later landed the lead role in Mortal Kombat: Annihilation (1997). She enjoyed the action aspects of that project and, since then, has found herself happily cast in other action roles, such as the lead in the telefilm Nick Fury: Agent of Shield (1998) (in which she played a villain), based on the Marvel comic, and guest spots in the series Lois & Clark: The New Adventures of Superman (1993), Sliders (1995) and SeaQuest 2032 (1993). Sandra has been a regular on Pensacola: Wings of Gold (1997), where she plays Alexandra \"Ice\" Jensen, one of the few women in the squadron and a member of the Nuggets with the \"Sharpshooters.\" In her infrequent free time, she enjoys yoga, working out, and hiking with Gracie, a stray dog she saved from the streets of Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2ODE5MzgzMl5BMl5BanBnXkFtZTcwMzU4MjczMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0381524","name":"Sandra Hess","idIMDB":"nm0381524"},"actorId":"nm0381524","character":"Jennifer Wells","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fintan McKeown","urlProfile":"http://www.imdb.com/name/nm0571654","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NDIxMjgxMF5BMl5BanBnXkFtZTYwNzUyMzgy._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Fintan McKeown is an actor, known for Waking Ned Devine (1998), Immortal Beloved (1994) and Mermaid Chronicles Part 1: She Creature (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NDIxMjgxMF5BMl5BanBnXkFtZTYwNzUyMzgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0571654","name":"Fintan McKeown","idIMDB":"nm0571654"},"actorId":"nm0571654","character":"Father Nikolai Soren","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kate Orsini","urlProfile":"http://www.imdb.com/name/nm1484198","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYwODQxNTYzN15BMl5BanBnXkFtZTgwNDUwNzEzOTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Hannah Katherine Orsini","bio":"Born and raised in Talladega, Alabama, Kate began performing in Equity stage musicals at age 12. She won a full scholarship to Vassar College, and graduated Phi Beta Kappa with a degree in Drama and French Literature. After living briefly in Paris and Manhattan, she relocated to Los Angeles to focus on writing and acting. With dozens of television guest star credits, independent film roles, and a successful screenwriting career, she considers herself lucky to get to do what she loves every single day.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYwODQxNTYzN15BMl5BanBnXkFtZTgwNDUwNzEzOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1484198","name":"Kate Orsini","idIMDB":"nm1484198"},"actorId":"nm1484198","character":"Dr. Christina Durant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tim Abell","urlProfile":"http://www.imdb.com/name/nm0008543","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTcxMjJlNDUtZThjMi00ZTc3LTliNmEtNjdjZWI5MTdkMDc0XkEyXkFqcGdeQXVyNTUzNzIxMg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 July 1958","placeOfBirth":" Manassas, Virginia, USA","birthName":"Timothy Shawn Abell","height":"5' 10\" (1.78 m)","bio":"An exciting, eclectic actor, Tim Abell is a man of his own making and when that making includes teaching ballroom dancing, horse training, writing, cooking, acting, producing and being a US Army Ranger with the 75th Ranger Regiment, you can see it is a formidable combination. From the Maryland and Virginia area, as a young man Tim took up martial arts and boxing. He found a respect for wildlife conservation and a love for the land while hunting and fishing with his elders. At the age of 17 he joined the army, and owing to outstanding leadership skills, was promoted during basic training. He advanced quickly, attending AIT, Airborne School and Ranger School, all at Fort Benning, Georgia. He was assigned to the 2nd Ranger Battalion, Ft. Lewis, Washington, as a Ranger after enduring the Ranger Indoctrination Program (RIP). Gaining further promotions, Tim also achieved a substantial number of awards due to his expertise in many varied fields. During his final year in the Army he served with the 3rd US Infantry, \"The Old Guard\", Caisson Platoon. Here he excelled as a horseman and played Robert E. Lee and Andrew Jackson, charging into battle on his trusty steed, in the US Army dramatic re-enactment of the History of the United States Torch Light Tattoo, at the Jefferson Memorial in Washington, DC, and a longer version called \"The Spirit of America\" performed in various places. After five years of service Tim left the army to go to college. Once there he was encouraged to join the Arthur Murray Dance Studio and was soon teaching class to support himself through college. It was here that Tim first got involved with the theatre. Just short of graduating he took the decision to leave college and head to Los Angeles, where he took classes with Jeff Corey while searching for that all-important break. Early on, after a series of low-budget films and many theatre projects, his break came, when April Webster recommended that Jerry Bruckheimer cast him in Soldier of Fortune (1997) as Benny Ray Riddle, a former Marine scout/sniper recruited by the Pentagon to work as part of a covert team. The syndicated series ran for two seasons. Then followed a series of films that made much of Tim's military experiences, including The Base (1999), where he starred opposite Mark Dacascos in a performance that had him compared to a young Willem Dafoe, and The Substitute: Failure Is Not an Option (2001) which also starred Treat Williams and Bill Nunn. Tim was to find himself starring with Dacascos again in the film adaptation of Lisa Gardner's book \"The Perfect Husband\". In Instinct to Kill (2001) Tim played psychotic killer Jim Beckett with Missy Crider as his long-suffering wife. Murder, She Wrote: The Last Free Man (2001) for CBS, saw a change of direction for Tim into historical costume drama, which was then followed by roles alongside James Caan and Daniel Stern in Jason Bloom's award-winning \"Dead Simple\" a.k.a Viva Las Nowhere (2001), and in the much acclaimed We Were Soldiers (2002) starring Mel Gibson. Guest-starring roles in the television series' CSI: Miami (2002), NCIS (2003) and JAG (1995) bought Tim face to face with David Caruso, Mark Harmon and David James Elliott. In recent projects Tim has been behind the camera as well as in front of it. He was co-producer on the multi-award-winning film Soldier of God (2005), directed by W.D. Hogan and produced by Mir Bahmanyar. To date, \"Soldier of God\" has won Best Feature Film awards for 2005 at The Deep Ellum Film Festival in Dallas, The Stratford upon Avon International Film Festival in England and The Berkley Film Festival in California. As well as being co-producer on \"Soldier of God\", Tim took on the emotional intensity of portraying the eponymous anti-hero, Rene. It was a tour de force for this talented actor. Tim also starred in and was associate producer on the Thadd Turner-written Miracle at Sage Creek (2005) starring David Carradine, Wes Studi, Michael Parks and Irene Bedard. Further films with Thadd Turner in 2006 will see Tim star alongside Shania Twain, Michael Madsen and Kris Kristofferson in _Buttermilk Sky (2007)_ and _Hard Ride, The (2007)_ . He has recently finished filming \"The Tom Campbell Water Story\", a.k.a \"Breathe\", in Florida and Santa Barbara, California. The film, directed by and starring Don Murray, is based on the true story of three scuba divers trapped in an underwater cave.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTcxMjJlNDUtZThjMi00ZTc3LTliNmEtNjdjZWI5MTdkMDc0XkEyXkFqcGdeQXVyNTUzNzIxMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0008543","name":"Tim Abell","idIMDB":"nm0008543"},"actorId":"nm0008543","character":"Lex","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Langlois","urlProfile":"http://www.imdb.com/name/nm0486610","urlPhoto":"","biography":{"bio":"William Langlois is known for his work on Ashley's Ashes (2010), Fire from Below (2009) and Bone Eater (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0486610","name":"William Langlois","idIMDB":"nm0486610"},"actorId":"nm0486610","character":"Inspector Zev Aslan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Petri Roega","urlProfile":"http://www.imdb.com/name/nm1816452","urlPhoto":"","biography":{"bio":"Petri Roega is an actor, known for Gargoyle (2004) and Chupacabra (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1816452","name":"Petri Roega","idIMDB":"nm1816452"},"actorId":"nm1816452","character":"Father Adrian Bodesti","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rene Rivera","urlProfile":"http://www.imdb.com/name/nm0729401","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1OTE0MDMyOV5BMl5BanBnXkFtZTgwOTgwODExMDI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Rene Rivera was born in San Antonio. He is a graduate of The Juilliard School in New York City, and is a member of The Actors Studio. He has worked extensively on Broadway, Off-Broadway, Regional Theatre across the United States, and Europe. He also works extensively in Films, and Television productions.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1OTE0MDMyOV5BMl5BanBnXkFtZTgwOTgwODExMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0729401","name":"Rene Rivera","idIMDB":"nm0729401"},"actorId":"nm0729401","character":"Gogol","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arthur Roberts","urlProfile":"http://www.imdb.com/name/nm0730838","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM5NTk1OTc2OF5BMl5BanBnXkFtZTgwODU0NTE0MDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1938","placeOfBirth":" New York City, New York, USA","height":"6' 2\" (1.88 m)","bio":"Arthur Roberts first fell in love with acting starring as Crichton in The Admirable Crichton at Fieldston, his New York City high school. The most beautiful girls in the class surrounding him after the curtain fell didn't hurt either!!! While Dean's List and on scholarship at Harvard, he found acting far more fun than studying pre-med - he thought, \" if I can just get them to pay me to do this...\" So off he went to learn his craft with the Harvard Summer Players with Faye Dunaway and Jane Alexander, and then Summer Stock all over the East Coast. At the Hampton Playhouse in New Hampshire, they paid $27 a week, which covered room and board. He then played the title roles in Mr. Roberts and Poor Richard in Pennsylvania, won the Barter Theatre award in a big New York competition for the famous Barter Theatre Virginia, did Streetcar Named Desire in Connecticut and Barefoot in the Park in Michigan, and starred in Neil Simon in Winter Rep in Buffalo and Pinter in Princeton. He got his Equity card playing in Othello with James Earl Jones and the New York Shakespeare Festival in Central Park. During all this, he got an MBA at NYU (a fallback option which thankfully he never used) with a prize-winning thesis \" On Why Good TV Series Stop Production and Go Off the Air.\" The prize money helped buy his first Chevy convertible, which he then drove down to Ft. Lauderdale, Florida to play the third lead, Lord Henry Darnley, husband and King to Inga Swenson's \"Mary,\" Queen of Scots in a pre-Broadway musical tryout. He then had a strong New York run playing Hank with the original cast of The Boys in the Band, starred on Broadway in the Tony-winning Borstal Boy, and won wide critical acclaim from all the New York critics as Karenin in Anna Karenina. On matinee days of Borstal Boy, he took great natural light headshots of fellow cast members with his Nikon and lifted his portrait photography hobby to a professional level. He starred in a wide range of intriguing independent films, enjoyed a run on the soap Secret Storm, did numerous commercials and print modeling for Wilhelmina. He sailed thru a Nova Scotia storm for Maxim Coffee - because he, the director and the DP were on deck sailing through rain, wind and storm, they were fine; the poor ad agency folk who mistakenly stayed below became quite seasick. Bodybuilding took him to walk the Bahamas beaches with a gorgeous bikini blonde for Bahamas Tourist Board TV and print ads. After traveling to Mexico, Greece and Europe, he came to LA in 1974 and soon guest starred in Starsky and Hutch, Barnaby Jones, The Rockford Files and enjoyed a run on General Hospital as James Duvall, the scientist who invented the Ice Princess at the height of the Luke and Laura excitement. He pitched for the General Hospital softball team and played celebrity tennis. Playing the title role in Not of This Earth proudly got him into The Academy of Motion Picture Arts and Sciences in 1988. This and other films, among them Revenge of the Ninja, rent worldwide and give him international recognition, as do the reruns of his many TV shows. He was a regular on the Lorenzo Lamas series Air America in 1998 -- 1999. He continues to work all over the world, shooting Gargoyle with Jim Wynorski in Bucharest, Romania, Hammerhead with William Forsythe and Hunter Tylo for Avi Lerner Nu Image six weeks in Bulgaria in 2004, the Nissan Versa product launch in Canada in 2006 and a commercial for Labatt's Canadian beer that was cast in LA and shot in Prague, Czech Republic -- go figure -- in 2007. On LA stages he has starred at the Mark Taper Forum, Los Angeles Theatre Center, and as Prospero in Shakespeare's The Tempest, a huge workout... it took five weeks to learn all the words. His most colorful recent credit was the sublime pleasure of working opposite Blythe Danner in \" I'll See You in My Dreams,\" Clips from that outrageous scene lead off his comedy demo reel. All the words were taken from a real-life speed dating situation A strong believer in the Greek ideal of mens sana in corpore sano - a sound mind in a sound body, he enjoys weight workouts, swimming, tennis, basketball, biking and hiking and absolutely loves playing beach volleyball in Manhattan Beach and Santa Monica. Often his group is the last one standing, the only people playing volleyball as far you can see up and down the beach, stopping only when it gets too cold or too dark, whichever comes first. An avid swimmer, he ran camp waterfronts in Maine during college summers and remembers the adventure of saving a sailor who overturned his catamaran in the Atlantic Ocean off Fire Island and was out way past where lifeguards would go... they said \" if you get in trouble out there, you're on your own... we won't come get you!!\" Arthur loves traveling and taking pictures on photo safaris to Kenya and Tanzania in 1999, in Thailand, Vietnam, and Hong Kong in 2000, Prague in 2007, a grand tour of China in 2008 - the Great Wall and shooting the Yangtze River Cruise were his favorites. Since then he toured Peru , Morocco, the Greek islands, Portugal and Spain. His absolute favorite for scenic photos was multi-colorful Italy: the Mediterranean hill towns of Cinque Terre and the incomparable experience of Venice. He has shared with his good friend and manager Phil Brock his love of framing and hanging the very best of his travel photos on the wall - so you live with your own self-made art. He loves cameras and helps friends pick out which one best to buy. He has taught Actors' Survival - How to Earn Your Living Acting -- at UCLA and Santa Monica College and enjoys giving powerful private coaching.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM5NTk1OTc2OF5BMl5BanBnXkFtZTgwODU0NTE0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0730838","name":"Arthur Roberts","idIMDB":"nm0730838"},"actorId":"nm0730838","character":"Bishop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Rohrer","urlProfile":"http://www.imdb.com/name/nm1827432","urlPhoto":"","biography":{"bio":"Jason Rohrer is an actor, known for Felix the Christ (2006), Gargoyle (2004) and Rounding Home (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1827432","name":"Jason Rohrer","idIMDB":"nm1827432"},"actorId":"nm1827432","character":"Richard Barrier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mihai Bisericanu","urlProfile":"http://www.imdb.com/name/nm0083945","urlPhoto":"","biography":{"dateOfBirth":"5 February 1962","placeOfBirth":" Bucharest, Romania","bio":"Mihai Bisericanu was born on February 5, 1962 in Bucharest, Romania. He is an actor, known for Second in Command (2006), Mi-e frica de lilieci (1997) and Sherlock (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0083945","name":"Mihai Bisericanu","idIMDB":"nm0083945"},"actorId":"nm0083945","character":"Gregor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bogdan Uritescu","urlProfile":"http://www.imdb.com/name/nm0881983","urlPhoto":"","biography":{"bio":"Bogdan Uritescu is known for his work on High Tension (2003), The Detonator (2006) and Second in Command (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0881983","name":"Bogdan Uritescu","idIMDB":"nm0881983"},"actorId":"nm0881983","character":"Zero","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Claudiu Trandafir","urlProfile":"http://www.imdb.com/name/nm0870946","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDcyNTZiNzItODNjNS00ZDUyLWFlOTctOTEyMGIwNTE2OGQwXkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1963","placeOfBirth":" Constanta, Romania","height":"6' 0¾\" (1.85 m)","bio":"Claudiu Trandafir was born in Constanta a town by the Romanian Black Sea Coast. Claudiu began acting as a teen. In 1989 he met and worked with playwright Caryl Churchill and director Mark Wing Davey in Bucharest, on the research, devising and developing the highly acclaimed original production of \"Mad Forest - a Play from Romania\" (1990). The play premiered at the Royal Court Theatre in London in June (1990) at Central School Of Speech and Drama, London, in September at the National Theatre in Bucharest and in October opened for a six weeks run at The Royal Court in London. He moved to London and attended the Acting course of Arts Educational Schools London(1991). He had his stage debut in London in Arts Threshold production of Peter Weis' \"The Investigation\" directed by Johnathan Chadwick (1993). On the returning to Romania (1994) he worked with the National Theatre of Craiova and toured the world with \"The Danaides\" directed by Silviu Purcarete(1996). He set up \"The 777 Theatre Company\" (1997), with the theatre director Theodor Cristian Popescu and produced and directed national premieres of: Mark Meddof's \"Children of a Lesser God\", Tony Kushner's \"Angels in America\", Biliana Srblianovic's \"A Belgrade Trilogy\". The productions opened on the best stages in Romania and were considered among the best at the time. He has numerous roles and appearances in American, British and Romanian film and TV productions. Author: Film Creep","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDcyNTZiNzItODNjNS00ZDUyLWFlOTctOTEyMGIwNTE2OGQwXkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0870946","name":"Claudiu Trandafir","idIMDB":"nm0870946"},"actorId":"nm0870946","character":"Boris","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cristi Groza","urlProfile":"http://www.imdb.com/name/nm1642378","urlPhoto":"","biography":{"bio":"Cristi Groza is known for her work on Amen (2002) and Gargoyle (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1642378","name":"Cristi Groza","idIMDB":"nm1642378"},"actorId":"nm1642378","character":"Ionut","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lewis Cojocar","urlProfile":"http://www.imdb.com/name/nm1000607","urlPhoto":"","biography":{"bio":"Lewis Cojocar is an assistant director and actor, known for Gargoyle (2004), Taboo (2002) and Straight Into Darkness (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1000607","name":"Lewis Cojocar","idIMDB":"nm1000607"},"actorId":"nm1000607","character":"Yuri","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0409999","urlIMDB":"http://www.imdb.com/title/tt0409999","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 27 min (87 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"3.6","filmingLocations":[{"location":"Romania"}],"rated":"R","awards":[],"votes":"877","type":"Video","companyCreditsSimple":[{"idCompany":"co0091470","name":"Avrio Filmworks"},{"idCompany":"co0017447","name":"Cinetel Films"},{"idCompany":"co0086772","name":"Lions Gate Entertainment"}],"keywords":{"keywords":["bucharest","kidnapping","gargoyle","cia","one word title","zoo","rock","ring","ransom","priest","monastery","impalement","graveyard","decapitation","crossbow","church","cave","castle","car chase","camera","blood","amusement park","1530s"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:25:11"}}