{"data":{"movies":[{"title":"The Cave","originalTitle":"","year":"2005","releaseDate":"20050826","directors":[{"name":"Bruce Hunt","id":"nm0402365"}],"writers":[{"name":"Michael Steinberg","id":"nm0825790"},{"name":"Tegan West","id":"nm0922359"}],"runtime":"97 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4MTQ1NjQ2Ml5BMl5BanBnXkFtZTcwNTkzMTMzMQ@@._V1.jpg","countries":["USA","Germany","Romania"],"languages":["English","Romanian"],"genres":["Adventure","Horror","Thriller"],"plot":"Decades after a rock church in communist Romania's Carpathians caved when an expedition caused a landslide and buried everyone, Dr. Nicolai's scientific team exploring the associated Templar Knights monster fighting-legend discovers a deep, flooded cave system and hires the brothers Jack and Tyler's brilliant divers team to explore it. Another explosion traps them, after finding a mysterious parasite turning all species carnivore, and later an independently evolved predator species. Jack may be infected and turning, but Tyler sticks with him, so the group splits, hunted by the monsters, which also fly.","simplePlot":"Bloodthirsty creatures await a pack of divers who become trapped in an underwater cave network.","actors":[{"actorName":"Cole Hauser","urlProfile":"http://www.imdb.com/name/nm0369513","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNTEzNDk2OV5BMl5BanBnXkFtZTgwNDYyMzQwMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1975","placeOfBirth":" Santa Barbara, California, USA","birthName":"Cole Kenneth Hauser","height":"6' 1\" (1.85 m)","bio":"Cole Hauser was born in Santa Barbara, California. He is the son of Cass Warner, who founded a film production company (Warner Sisters), and Wings Hauser, an actor. His grandfathers were screenwriters Dwight Hauser and Milton Sperling, and his maternal great-grandfather was film mogul Harry M. Warner, of Warner Bros. His father is of German, Irish, and Belgian (Walloon) descent, and his mother is from a Jewish family (from Austria, Russia, and Poland). He grew up in California, Oregon and Florida. Hauser has had a long and impressive career in acting. He made his big screen debut in \"School Ties\" where many other then up and coming actors had their starts. He next went on to star in Richard Linklater's Cult Classic \"Dazed and Confused.\" Other feature credits include \"Tigerland,\" for which Cole received an Independent Spirit Award nomination, \"White Oleander\" for which he received a Movieline breakthrough performance also, \"Hart's War,\" \"Tears of the Sun,\" \"Higher Learning,\" and \"Too Fast, Too Furious,\" to name a few. In 2014 Hauser will be seen in two anticipated projects. This spring he can be seen opposite Johnny Depp in the Warner Bros release of Transcendence (2014). Immediately following he will star in DirecTV's original drama \"Rogue\" opposite Thandie Newton. The show, in its second season has been a big draw for the network. Earlier this year he was seen in Antoine Fuqua's Olympus Has Fallen (2013), an action ensemble which included Aaron Eckhart, Gerald Butler and Morgan Freeman. Hauser lives outside of Los Angeles with his wife, photographer Cynthia Daniel, and three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNTEzNDk2OV5BMl5BanBnXkFtZTgwNDYyMzQwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0369513","name":"Cole Hauser","idIMDB":"nm0369513"},"actorId":"nm0369513","character":"Jack McAllister","urlCharacter":"http://www.imdb.com/character/ch0239346","main":true},{"actorName":"Eddie Cibrian","urlProfile":"http://www.imdb.com/name/nm0004827","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzc3MjI3OV5BMl5BanBnXkFtZTcwODg4NjE2Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1973","placeOfBirth":" Burbank, California, USA","birthName":"Edward Carl Cibrian","height":"6' 2\" (1.88 m)","bio":"Eddie Cibrian was born on June 16, 1973 in Burbank, California, USA as Edward Carl Cibrian. He is an actor, known for Third Watch (1999), Sunset Beach (1997) and The Cave (2005). He has been married to LeAnn Rimes since April 22, 2011. He was previously married to Brandi Glanville.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzc3MjI3OV5BMl5BanBnXkFtZTcwODg4NjE2Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004827","name":"Eddie Cibrian","idIMDB":"nm0004827"},"actorId":"nm0004827","character":"Tyler McAllister","urlCharacter":"http://www.imdb.com/character/ch0239347","main":true},{"actorName":"Morris Chestnut","urlProfile":"http://www.imdb.com/name/nm0004820","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NTIyNjk3MF5BMl5BanBnXkFtZTcwNDQyODQ3Mg@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1969","placeOfBirth":" Cerritos, California, USA","birthName":"Morris L. Chestnut","height":"6' (1.83 m)","bio":"A tall, handsome, and versatile American actor, Morris Chestnut was born in Cerritos, California, to Shirley (Wynn) and Morris Chestnut, Sr. He first came to be recognized by moviegoers starring as Ricky in Boyz n the Hood (1991), a role where he played a high school running back using his football skills to escape the violent surroundings of his South Central Los Angeles neighborhood. His half brother was played by Ice Cube who in the movie did not have the same motivation. Two years later, he landed a lead role in Civil Rights Drama The Ernest Green Story (1993), showing courage and perseverance as one of the Arkansas Nine high school students. He later starred in action films like Under Siege 2: Dark Territory (1995), G.I. Jane (1997) and Mission Alcatraz (2002) as well as the romantic comedies The Best Man (1999), The Brothers (2001), Two Can Play That Game (2001), and Breakin' All the Rules (2004). In 2004, he appeared in Anacondas: The Hunt for the Blood Orchid (2004) and Ladder 49 (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NTIyNjk3MF5BMl5BanBnXkFtZTcwNDQyODQ3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004820","name":"Morris Chestnut","idIMDB":"nm0004820"},"actorId":"nm0004820","character":"Top Buchanan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lena Headey","urlProfile":"http://www.imdb.com/name/nm0372176","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzIwMjIwNjg0M15BMl5BanBnXkFtZTgwOTI3MDEzMDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1973","placeOfBirth":" Hamilton, Bermuda","height":"5' 5½\" (1.66 m)","bio":"Lena Headey is a British actress. She was born in Bermuda to parents from Yorkshire, England, where she was raised. She is the daughter John Headey, a police officer, and his wife Sue. Headey is best known for her role as \"Cersei Lannister\" in Game of Thrones (2011) (2011-present) and The Brothers Grimm (2005), Possession (2002), and The Remains of the Day (1993). Headey stars as \"Queen Gorgo\", a heroic Spartan woman in the period film, 300 (2006), by director Zack Snyder. Headey was born in Hamilton, Bermuda, to British parents Sue and John Headey. Her father, a Yorkshire police cadet, was sent to Bermuda shortly before her birth. She was raised there, living by the ocean until she was five. Back in England, she was brought up in Yorkshire before moving to London in her teens. Headey had not gone to drama school before she became an actress. At the age of 17, Headey's performance in a one-off show in the company of six school friends caught the attention of a casting agent, who took a photo and asked her to audition. Eventually, Headey was cast in Waterland (1992), which became her big-screen debut. She honed her natural acting talent while filming and also took archery classes and horse training. She also took boxing classes in clubs in south London, where a former boxer had been teaching her to spar. During her film career, spanning over 15 years, Headey has shown her range in a variety of roles, playing characters from Amazon-type warriors and action-minded women in The Cave (2005) and The Brothers Grimm (2005), to a lesbian florist in Imagine Me & You (2005). Headey's film career has taken her all over the world. She was in India for the filming of Le livre de la jungle (1994), then in St. Petersburg, Russia, for filming Onegin (1999), and in Norway for filming of Aberdeen (2000). In 2005 Headey was filming in Romania and in Mexico, then spent four months in Prague, Czech Republic, where a forest was designed and built for filming The Brothers Grimm (2005), with Matt Damon and Heath Ledger. During 2006 Headey was in Canada for the filming of 300 (2006), then went to locations in Bulgaria for shooting The Contractor (2007), and Germany and in Czech Republic for the filming of Baron rouge (2008). She also played Gina McVey in the horror thriller The Broken (2008), and Elizabeth in Tell Tale (2009). In addition to her film-work, Heady appeared as Sarah Connor in a TV spin-off of the popular \"Terminator\" film franchise, the FOX's television series Terminator: The Sarah Connor Chronicles (2008). Outside of her acting profession, Headey continued taking boxing lessons in London. She is a vegetarian and also remains loyal to yoga, which she discovered during her work in India. She has never been back to her birthplace in Bermuda; she shares her time between her homes in London, England, and Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzIwMjIwNjg0M15BMl5BanBnXkFtZTgwOTI3MDEzMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0372176","name":"Lena Headey","idIMDB":"nm0372176"},"actorId":"nm0372176","character":"Dr. Kathryn Jennings","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Piper Perabo","urlProfile":"http://www.imdb.com/name/nm0005305","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NjU2MjIyMV5BMl5BanBnXkFtZTYwNDk5MDM1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1976","placeOfBirth":" Dallas, Texas, USA","birthName":"Piper Lisa Perabo","height":"5' 5½\" (1.66 m)","bio":"Piper Perabo was born in Dallas, Texas, to Mary Charlotte (Ulland), a physical therapist, and George William Perabo, a poetry professor. Her mother is of Norwegian descent and her father is of German, Irish, and English ancestry (the surname \"Perabo\" originates in Germany). After graduating college, Piper moved to New York and was cast in a short film called Single Spaced (1997). Her first big role came after that, where she played the girlfriend of a wannabe rapper in Whiteboys (1999). In 2000 she was cast in The Adventures of Rocky & Bullwinkle (2000) as FBI agent Karen Sympathy. However, the role that really got her recognized was in Coyote Ugly (2000). She played Violet Sanford aka \"Jersey,\" who moves to New York to pursue her dream of becoming a songwriter. In 2001, she starred in an independent Canadian movie called Lost and Delirious (2001), playing a boarding-school student who falls in love with another girl. The next year, she starred as a French exchange student in Slap Her, She's French! (2002). In 2003, she had a small role as the oldest daughter in Cheaper by the Dozen (2003), which also starred Steve Martin, Ashton Kutcher, and Bonnie Hunt. She has also appeared in The I Inside (2004), Perfect Opposites (2004), George and the Dragon (2004), Edison (2005), The Cave (2000), and 10th & Wolf (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NjU2MjIyMV5BMl5BanBnXkFtZTYwNDk5MDM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005305","name":"Piper Perabo","idIMDB":"nm0005305"},"actorId":"nm0005305","character":"Charlie","urlCharacter":"http://www.imdb.com/character/ch0018101","main":true},{"actorName":"Rick Ravanello","urlProfile":"http://www.imdb.com/name/nm0712262","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjc2MjYyMzQ3MV5BMl5BanBnXkFtZTgwMTg4NDc0MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 October 1967","placeOfBirth":" Cape Breton, Nova Scotia, Canada","birthName":"Richard Alexander Ravanello","height":"5' 10\" (1.78 m)","bio":"Rick Ravanello started his acting career back in 1996. Rick immediately started to earn many television and film roles which eventually lead to an audition that landed in the hands of Steven Spielberg of Dreamworks SKG. Mr. Spielberg quickly had Rick flown to Los Angeles where he met with Tom Hanks and Tony To. They discussed an upcoming project titled \"Band of Brothers\". Although Rick did not go on to film the mini-series, Mr. Spielberg offered Rick a deal to star in an upcoming Dreamworks television project. Since his arrival in L.A., Rick has since been very active. He earned a role in _Hart's War(2002)_ where he worked along side Bruce Willis in Prague, Czech Republic. \"The Cave\" put Rick back on screen with fellow \"Hart's War\" actor and friend Cole Hauser a couple of years later. Rick Ravanello has proved himself to be a very versatile performer with a range from character roles to the leading man. He has three younger brothers, Chris, Lawrence and Michael (Michael sustained a brain injury back in 1994 which has left him hospitalized since. Michael has since passed away). The loss of his youngest brother has been a life changer for him as he'll tell you. Rick has always been involved with many charitable groups ranging from those that support The United States Military to those supporting cancer patients and their families. He loves to play golf and is an avid practitioner of the Martial Arts. Muay Thai being his current passion. Rick resides in Southern California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjc2MjYyMzQ3MV5BMl5BanBnXkFtZTgwMTg4NDc0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0712262","name":"Rick Ravanello","idIMDB":"nm0712262"},"actorId":"nm0712262","character":"Briggs","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Daniel Dae Kim","urlProfile":"http://www.imdb.com/name/nm0196654","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQyNjcwODU4NV5BMl5BanBnXkFtZTgwNTI0MjYzMDI@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 August 1968","placeOfBirth":" Pusan, South Korea","birthName":"Dae-Hyun Kim","height":"5' 9\" (1.75 m)","bio":"Through the diversity of his roles on stage and screen, Daniel Dae Kim continues to expand our perceptions of the Asian-American man. In characters ranging from the King of Siam, a Shakespearean hero, a social worker for the Chicago needy, to a counter-terrorist agent, his work has consistently proven to transcend the historical barriers of race and stereotype. Daniel's most recent work on ABC's Lost (2004), is no exception. As \"Jin Soo Kwon\", a Korean businessman and reluctant enforcer for his father-in-law, his character transformed from an overprotective \"traditional\" husband to a man who re-learns how to live and love. His portrayal of this multi-faceted character signaled a breakthrough for primetime network television, and has helped make Lost (2004) a worldwide hit since its debut in 2004. Since then, both Daniel and the show have been widely recognized for their excellence. Sharing a 2006 Screen Actors Guild Award for Best Ensemble, the Korean-American actor's universal appeal was also recognized by \"People\" Magazine, which named him one of the \"Sexiest Men Alive\" in 2005, as well as \"TV Guide\", which recognized him as one of \"TV's Sexiest Men\" in 2006. In that same year, Daniel was individually honored with an AZN Asian Excellence Award, a Multicultural Prism Award and a Vanguard Award from the Korean American Coalition, all for Outstanding Performance by an Actor. In 2009, his recognition continues with the prestigious KoreAm Journal Achievement Award in the field of Arts and Entertainment. Born in Busan, South Korea and raised in New York and Pennsylvania, Daniel discovered acting while a student at Haverford College. Though briefly considering a career as an attorney, he decided to follow his true passion and moved to New York City, where he began his work on stage. There, he performed in classics such as \"Romeo and Juliet\", Anton Chekhov's \"Ivanov\" and Henrik Ibsen's \"A Doll's House\", as well as working with an improv comedy troupe. Despite his early success, however, he decided to deepen his dedication to the craft by studying at the Graduate Acting program at New York University's Tisch School of the Arts, where he earned a Master's Degree in Fine Arts in 1996. Upon graduation, Daniel's film career began in earnest with roles in The Jackal (1997), For Love of the Game (1999), The Hulk (2003), Spider-Man 2 (2004) and The Cave (2005), as well as the Academy Award-winner for Best Picture, Collision (2004). Most recently, he completed production on The Adjustment Bureau (2011), starring Matt Damon and directed by George Nolfi. On television, he's guest-starred on numerous shows, including CSI: Crime Scene Investigation (2000), ER (1994) and, for two seasons, 24 (2001) as CTU Agent \"Tom Baker\". In 2008, he also starred in the Emmy-nominated mini-series adaptation of Michael Crichton's The Andromeda Strain (2008). Kim has also complemented his television work by lending his voice talents to video games, creating characters in \"Saints Row\" 1 and 2, \"Scarface: The World Is Yours\", \"Tenchu\" and \"24\", as well as the animated TV series' Justice League (2001) Unlimited and Avatar: The Last Airbender (2005). Daniel rekindled his love for the stage by performing the role of the \"King of Siam\" in the iconic production, \"The King and I\", directed by Jeremy Sams, at London's world-renowned Royal Albert Hall. In 2010, Kim was cast as Chin Ho Kelly, a disgraced police officer who is recruited by Commander Steve McGarrett and Danny \"Danno\" Williams to work for the governor's task force \"Five-0\", in Hawaii Five-0 (2010). His cousin Kono Kalakaua joins them in the first season as an officer just finishing her training as a new addition to the Five-0 team. The show is launching the sixth season in September 2015. Though he spends time in Los Angeles and New York, Daniel spends most of the year in Honolulu, where he devotes his free time to a number of different charities, his restaurant and his family.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQyNjcwODU4NV5BMl5BanBnXkFtZTgwNTI0MjYzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0196654","name":"Daniel Dae Kim","nicknames":["DDK"],"idIMDB":"nm0196654"},"actorId":"nm0196654","character":"Alex Kim","urlCharacter":"http://www.imdb.com/character/ch0405860","main":true},{"actorName":"Kieran Darcy-Smith","urlProfile":"http://www.imdb.com/name/nm0201061","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDUwNDc2ODQ1OV5BMl5BanBnXkFtZTgwOTM1MTA1MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 June 1965","placeOfBirth":" Mona Vale, Sydney, New South Wales, Australia","bio":"Kieran Darcy-Smith was born on June 12, 1965 in Mona Vale, Sydney, New South Wales, Australia. He is an actor and director, known for Animal Kingdom (2010), The Cave (2005) and The Square (2008). He has been married to Felicity Price since January 7, 2006. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDUwNDc2ODQ1OV5BMl5BanBnXkFtZTgwOTM1MTA1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0201061","name":"Kieran Darcy-Smith","idIMDB":"nm0201061"},"actorId":"nm0201061","character":"Strode","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marcel Iures","urlProfile":"http://www.imdb.com/name/nm0411903","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM0NTYwODM5OF5BMl5BanBnXkFtZTcwNjY1ODQzOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 August 1951","placeOfBirth":" Bailesti, Romania","bio":"Marcel Iures is one of Romania's most acclaimed stage and screen actors, having starred in more than two dozen features in his native country and twice being named its best actor. His American film credits include The Peacemaker starring George Clooney, Mission: Impossible (1996) starring Tom Cruise, and Interview with the Vampire: The Vampire Chronicles (1994) starring Cruise and Brad Pitt. Among his most noted Romanian films are The Last Messenger, The Oak (1992) (The Oak), Society's Pillars, Vacanta cea mare (1988) (The Big Holiday), The Duel and Romanian. He recently finished filming Amen (2002) for director Costa-Gavras.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM0NTYwODM5OF5BMl5BanBnXkFtZTcwNjY1ODQzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0411903","name":"Marcel Iures","idIMDB":"nm0411903"},"actorId":"nm0411903","character":"Dr. Nicolai","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vlad Radescu","urlProfile":"http://www.imdb.com/name/nm0705486","urlPhoto":"","biography":{"dateOfBirth":"18 November 1952","placeOfBirth":" Bucharest, Romania","bio":"Vlad Radescu was born on November 18, 1952 in Bucharest, Romania. He is an actor, known for The Cave (2005), Muntii în flacari (1980) and At the Crossroads of Great Storms (1980).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0705486","name":"Vlad Radescu","idIMDB":"nm0705486"},"actorId":"nm0705486","character":"Dr. Bacovia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Simon Kunz","urlProfile":"http://www.imdb.com/name/nm0475336","urlPhoto":"","biography":{"bio":"Actor Simon Kunz was born in 1962, eight years after his American-born, England domiciled grandfather, the pianist Charlie Kunz, had a Top Twenty hit with Piano Medley 114. After leaving the Latymer School Simon read Theatre Studies at Warwick University and in 1984 became the drummer in the band the Locomotives. However, rather than follow Charlie into the music business he left the group after a year to concentrate on acting. On stage he appeared with the National Theatre (Brackenbury in 'Richard III'), the Oxford Stage Company (Oliver in 'As You Like It', Edgar in 'King Lear')in 'The Caretaker' at the Bristol Old Vic, 'Live Like Pigs' at the Royal Court and 'The Park' with the Royal Shakespeare Company, making his film debut in 'Four Weddings and a Funeral'. On television he has appeared in most of the populist dramas where he seems to have played rather more than his fair share of policemen - of all ranks - and lawyers.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0475336","name":"Simon Kunz","idIMDB":"nm0475336"},"actorId":"nm0475336","character":"Mike - Caver #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Kennedy","urlProfile":"http://www.imdb.com/name/nm0447986","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNzgxMzE4Nl5BMl5BanBnXkFtZTcwNjU0MTYzOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"David Kennedy was born David Mallett in 1964 and lived with his mother in Hornsey, North London before moving to Devon aged 5 with his mother and step father. He attended King Edward VI Comprehensive School in Totnes, Devon and lived in Bristol and Gloucester before returning to London in 1990 to study acting at Webber Douglas Academy of Dramatic Art. Since graduating from Webber Douglas in 1992 David has worked extensively in theatre, television and film.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNzgxMzE4Nl5BMl5BanBnXkFtZTcwNjU0MTYzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0447986","name":"David Kennedy","idIMDB":"nm0447986"},"actorId":"nm0447986","character":"Ian - Caver #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alin Panc","urlProfile":"http://www.imdb.com/name/nm1119249","urlPhoto":"","biography":{"dateOfBirth":"14 June 1973","placeOfBirth":" Hunedoara, Romania","height":"6' 0¾\" (1.85 m)","bio":"Alin Panc was born on June 14, 1973 in Hunedoara, Romania. He is an actor and writer, known for Ghost Rider: Spirit of Vengeance (2011), Assassination Games (2011) and The Cave (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1119249","name":"Alin Panc","idIMDB":"nm1119249"},"actorId":"nm1119249","character":"Razvan - Caver #3","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zoltan Butuc","urlProfile":"http://www.imdb.com/name/nm1117628","urlPhoto":"","biography":{"dateOfBirth":"2 July 1969","placeOfBirth":" Brasov, Romania","bio":"Zoltan Butuc was born on July 2, 1969 in Brasov, Romania. He is an actor, known for The Cave (2005), Seule contre tous (2010) and Sex Traffic (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1117628","name":"Zoltan Butuc","idIMDB":"nm1117628"},"actorId":"nm1117628","character":"Corvin - Caver #4","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian Steele","urlProfile":"http://www.imdb.com/name/nm0824498","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1OTMyOTU1MF5BMl5BanBnXkFtZTcwNjM2NjczNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"6' 7\" (2.01 m)","bio":"As a child, Brian Steele knew only two speeds: full throttle and off. Perpetually hyperactive and adventurous, young Brian constantly pushed boundaries and tested the patience of his parents and teachers. But Brian's boundless energy and ambition had no direction, growing up in small-town Highland, Michigan. But soon a few local Detroit television programs changed all that. Brian discovered \"Monster Week,\" The Ghoul, and Sir Graves Ghastly - fright fest-y shows whose creature-characters he found fascinating. Towering over classmates at an astounding 6'7\", Brian again found himself turning to onscreen icons for inspiration; watching over-the-top physical comedy by the Three Stooges and Laurel and Hardy helped him embrace his physical awkwardness. But lacking an outlet for his energy or any focus on a career, Brian had no direction. In 1985 he moved to the Florida Keys, hoping to discover his dreams there. But after two years working odd jobs like bagging groceries, working at a go-cart track, and on the docks at the local marina, Brian decided to move one more time. With only $700, a duffel bag full of clothes and a 10-speed bicycle, he bought a one-way ticket to Los Angeles. Brian's gamble paid off. L.A. loved him. Universal Studios Theme Park took one look at the awkward 24 year-old and knew exactly what to do with him; they hired him to perform as Frankenstein's monster. When Universal was searching for a man to don the suit for the television version of Harry and the Henderson's, they didn't have to look far. Brian was thrilled to be surrounded with cast mates who helped nurture his talents as an actor. Always patient and supportive with him as he became familiar with his new job responsibilities, the cast of HATH gave Brian the confidence to cultivate his craft. 48 episodes as Harry led to a role on NBC's sci-fi series, Earth 2. Brian learned quickly about the niche in Hollywood for \"creature actors.\" Glued, painted, Velcro-ed, snapped and harnessed into bodysuits and masks, Brian made a name for himself as the man who could bring monsters to life. Since 1997, he has played characters tailor made to scare audiences. That year, The Relic opened the door for Brian to work with Hollywood heavy-hitters. He breathed life into villains in the Underworld Trilogy and Blade: Trinity. He's worked with acclaimed directors Guillermo Del Toro (both Hellboy films) and M. Night Shayamalan (Lady in the Water). He's taken on creatures alongside Adrian Brody, Christian Bale and Tom Sizemore. The menacing bear Anthony Hopkins and Alec Baldwin battle in The Edge? That's Brian Steele. After over 20 years breathing life into characters onscreen, keeping each character fresh and new is easier said than done. But Brian \"enjoy(s) the challenge.\" In 2009, he got the opportunity to portray the T-600, Terminator Salvation's latest incarnation of the Terminator.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1OTMyOTU1MF5BMl5BanBnXkFtZTcwNjM2NjczNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0824498","name":"Brian Steele","nicknames":["CreatureBoy"],"idIMDB":"nm0824498"},"actorId":"nm0824498","character":"Creature Performer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0402901","urlIMDB":"http://www.imdb.com/title/tt0402901","business":{"budget":{"money":"$30,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$6,147,294","country":"USA","day":"28","month":"08","year":"2005","remarks":"2,195 Screens"},{"money":"£563,761","country":"UK","day":"28","month":"08","year":"2005","remarks":"276 Screens"},{"money":null,"country":null,"day":"13","month":"10","year":"2005","remarks":"15 Screens"}],"gross":[{"money":"$14,888,028","country":"USA","day":"02","month":"10","year":"2005","remarks":""},{"money":"$14,747,362","country":"USA","day":"25","month":"09","year":"2005","remarks":""},{"money":"$14,528,772","country":"USA","day":"18","month":"09","year":"2005","remarks":""},{"money":"$13,702,364","country":"USA","day":"11","month":"09","year":"2005","remarks":""},{"money":"$11,778,458","country":"USA","day":"04","month":"09","year":"2005","remarks":""},{"money":"$6,147,294","country":"USA","day":"28","month":"08","year":"2005","remarks":""},{"money":"£1,622,227","country":"UK","day":"11","month":"09","year":"2005","remarks":""},{"money":"£1,356,133","country":"UK","day":"04","month":"09","year":"2005","remarks":""},{"money":"£563,761","country":"UK","day":"28","month":"08","year":"2005","remarks":""},{"money":"$18,288,466 (Worldwide)","country":"except","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":"27","month":"10","year":"2005","remarks":""},{"money":null,"country":null,"day":"20","month":"10","year":"2005","remarks":""},{"money":null,"country":null,"day":"13","month":"10","year":"2005","remarks":""}],"weekendGross":[{"money":"$115,456","country":"USA","day":"02","month":"10","year":"2005","remarks":"225 Screens"},{"money":"$110,875","country":"USA","day":"25","month":"09","year":"2005","remarks":"242 Screens"},{"money":"$453,565","country":"USA","day":"18","month":"09","year":"2005","remarks":"750 Screens"},{"money":"$1,355,355","country":"USA","day":"11","month":"09","year":"2005","remarks":"1,871 Screens"},{"money":"$3,764,249","country":"USA","day":"04","month":"09","year":"2005","remarks":"2,195 Screens"},{"money":"$6,147,294","country":"USA","day":"28","month":"08","year":"2005","remarks":"2,195 Screens"},{"money":"£96,301","country":"UK","day":"11","month":"09","year":"2005","remarks":"162 Screens"},{"money":"£258,668","country":"UK","day":"04","month":"09","year":"2005","remarks":"276 Screens"},{"money":"£563,761","country":"UK","day":"28","month":"08","year":"2005","remarks":"276 Screens"}],"admissions":[{"money":"19,426 (Czech","country":"Republic","day":"27","month":"10","year":"2005","remarks":""},{"money":"13,426 (Czech","country":"Republic","day":"20","month":"10","year":"2005","remarks":""},{"money":"6,365 (Czech","country":"Republic","day":"13","month":"10","year":"2005","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"15","month":"04","year":"2004","remarks":null},null],"copyrightHolder":"Cineblue Internationale Filmproduktionsgesellschaft mbH &amp; Co. 1. Beteiligungs-KG"},"technical":{"runtime":["1 hr 37 min (97 min)","1 hr 33 min (93 min) (DVD) (Germany)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arricam LT, Zeiss Ultra Prime Lenses","Arriflex 235, Zeiss Ultra Prime Lenses","Sony HDC-F950, Fujinon Lens"],"laboratory":["DeLuxe, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm (Kodak Vision2 500T 5218, Vision 500T 5279)","Video (HDTV)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","HDCAM SR (1080p/24) (source format)","Super 35 (3-perf) (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383, Vision Premier 2393)"]},"rating":"5.1","metascore":"30","filmingLocations":[{"location":"Zarnesti, Romania"}],"rated":"PG-13","awards":[],"votes":"29,584","type":"Movie","companyCreditsSimple":[{"idCompany":"co0010568","name":"Screen Gems"},{"idCompany":"co0018947","name":"Cinerenta Medienbeteiligungs KG"},{"idCompany":"co0005323","name":"Lakeshore Entertainment"}],"keywords":{"keywords":["diver","parasite","flare","diving","cave","monster","romania","explosion","rebreather","video camera","transformation","tattoo","survival","sonar","skull","skeleton","scorpion","punched in the face","mutation","knife","infection","impalement","gash in the face","flashlight","directorial debut","cut arm","crushed to death","cpr","corpse","claw","burned alive","broken leg","bones","blood","biologist","swimwear","medical examination","fistfight","fire","fall","no ending","loss of brother","darkness","claustrophobic setting","underwater scene","scuba diving","loss of friend","helicopter","gate crashing","flamethrower","falling from height","cave in","brother brother relationship","2000s","1970s","monster movie","babe scientist","cavern","title spoken by character","surprise ending","church","eel","rock climbing","creature feature","body count"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:13:20"}}