{"data":{"movies":[{"title":"Painkiller Jane","originalTitle":"","year":"2005","releaseDate":"20051210","directors":[{"name":"Sanford Bookstaver","id":"nm0095424"}],"writers":[{"name":"John Harrison","id":"nm0365666"},{"name":"Don Keith Opper","id":"nm0649210"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmZjNDZmNWQtYWNhZC00ODZjLTk5MDAtNTg1YmFiMzIzYWVhXkEyXkFqcGdeQXVyNjMxODMyODU@._V1.jpg","countries":["USA","Canada"],"languages":["English"],"genres":["Action","Drama","Sci-Fi"],"plot":"After an army unit is exposed to a biochemical weapon, everyone is killed except one young woman. She not only recovers from the exposure but has developed the ability to recover from any type of injury within days. After discovering that the army is not trying to help cure her, but rather is experimenting on her to develop a serum to be used on other soldiers, she escapes. Obviously the army wants to hunt her down and get her back under their security.","simplePlot":"Jane, a young soldier, is exposed to a biochemical weapon that endows her with self-healing powers. She uses her abilities to fight crime while eluding the military.","actors":[{"actorName":"Emmanuelle Vaugier","urlProfile":"http://www.imdb.com/name/nm0891275","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDYxYWI2ZDQtODYyMC00NzI0LWFlM2UtYmJiMTVhOWVlYzE2XkEyXkFqcGdeQXVyMTY2MDkwNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 June 1976","placeOfBirth":" Vancouver, British Columbia, Canada","height":"5' 7\" (1.7 m)","bio":"Emmanuelle Vaugier is a Canadian actress, singer, and model. She began acting in grade school, after she was cast as an understudy in a play and had to fill in when the lead actor became ill. She modeled in Japan for three years. She made her acting debut in the 1995 made-for-TV movie drama, A Family Divided. She took up horseback riding in 2010; entered a Burbank, CA, horse show in which she placed third. She is involved with animal protection organizations including JIMI'S Angels and Best Friends Animal Society; she created Fluff-ball, an animal fundraiser event, to provide monetary support for the groups.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDYxYWI2ZDQtODYyMC00NzI0LWFlM2UtYmJiMTVhOWVlYzE2XkEyXkFqcGdeQXVyMTY2MDkwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0891275","name":"Emmanuelle Vaugier","nicknames":["Em"],"idIMDB":"nm0891275"},"actorId":"nm0891275","character":"Capt. Jane Elizabeth Browning","urlCharacter":"http://www.imdb.com/character/ch0031647","main":true},{"actorName":"Eric Dane","urlProfile":"http://www.imdb.com/name/nm0199312","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NDE1ODczMV5BMl5BanBnXkFtZTcwMzE2MDU1Mw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 November 1972","placeOfBirth":" San Francisco, California, USA","birthName":"Eric William Dane","height":"6' 1\" (1.85 m)","bio":"Eric Dane is an American actor known as \"Dr. Mark Sloan\" on Grey's Anatomy (2005) and as a co-star in Marley & Me (2008) and Valentine's Day (2010). He was born on November 9, 1972, in San Francisco, California, the older of two brothers. His father is an architect and interior designer based in San Francisco. His mother, Leah (Cohn), was a homemaker. His ancestry includes English, German, Finnish, Russian Jewish, and Austrian Jewish, and Eric had a Bar Mitzvah ceremony. Young Eric was a good athlete in high school. There, he started amateur stage work by playing \"Joe Keller\" in Arthur Miller's \"All My Sons\", and realized that this was all he wanted to do. He moved to Los Angeles and made his television debut in 1993 on The Wonder Years (1988). In his early career, he also played bit parts on the TV series Married with Children (1987) (1995), Silk Stalkings (1991) (1996) and Roseanne (1988) (1996). Dane played medical doctors more than once, first appearing as a \"Dr. Cooper\" in Gideon's Crossing (2000). From 2003-2004, he has been a recurrent guest star as \"Jason Dean\" in the hit show Charmed (1998). In 2006, he appeared as handsome \"Dr. Mark Sloan\", the plastic surgeon on the show Grey's Anatomy (2005). Dane landed his first leading role on the big screen in the German-made feature, Open Water 2: Adrift (2006). On October 29, 2004, in Las Vegas, Eric Dane married actress Rebecca Gayheart, who was previously engaged to producer/director Brett Ratner, the director of X-Men: L'affrontement final (2006). In it, Dane plays the character of \"Jamie Madrox\", the Multiple Man. Dane and Gayheart became the parents of a girl on March 3, 2010 in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NDE1ODczMV5BMl5BanBnXkFtZTcwMzE2MDU1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0199312","name":"Eric Dane","nicknames":["Dr. McSteamy"],"idIMDB":"nm0199312"},"actorId":"nm0199312","character":"Nick","urlCharacter":"http://www.imdb.com/character/ch0452057","main":true},{"actorName":"Richard Roundtree","urlProfile":"http://www.imdb.com/name/nm0745780","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMjIzOTUyMV5BMl5BanBnXkFtZTYwMjA2MDQ3._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1942","placeOfBirth":" New Rochelle, New York, USA","height":"6' 2\" (1.88 m)","bio":"Richard Roundtree was a leading man in many \"blaxploitation\" movies in the 1970s. He is best known for his role as John Shaft in Shaft (1971), and starred in its two sequels as well. As the 1970s and 1980s progressed he starred more in low-budget movies. He was in a few occasional high-profile, if a tad offbeat, films. Among his more notable work in that period were Escape to Athena (1979), City Heat (1984) and the socially conscious but badly received Game for Vultures (1979). Roundtree has been active in movies these days. He became popular again in the 1990s with his role in Se7en (1995), and was well received for reprising his role as the classic hero, and Samuel L. Jackson's uncle, in the 2000 remake of the film that made him a star, Shaft (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMjIzOTUyMV5BMl5BanBnXkFtZTYwMjA2MDQ3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0745780","name":"Richard Roundtree","idIMDB":"nm0745780"},"actorId":"nm0745780","character":"Colonel Watts","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Venus Terzo","urlProfile":"http://www.imdb.com/name/nm0856197","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MDAyODk1NV5BMl5BanBnXkFtZTgwNjYwNDIzMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 October 1967","placeOfBirth":" Montréal, Québec, Canada","height":"5' 4\" (1.63 m)","bio":"Venus Terzo was born on October 17, 1967 in Montréal, Québec, Canada. She is an actress, known for Ranma ½ (1989), Da Vinci's Inquest (1998) and It (1990).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MDAyODk1NV5BMl5BanBnXkFtZTgwNjYwNDIzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0856197","name":"Venus Terzo","idIMDB":"nm0856197"},"actorId":"nm0856197","character":"Carla Browning","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Walker Howard","urlProfile":"http://www.imdb.com/name/nm0907794","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0ODQ2MjUwN15BMl5BanBnXkFtZTcwNDE2MDQ4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Walker Howard is an actor and executive, known for Transformers: Revenge of the Fallen (2009), Dr. Dolittle 3 (2006) and The Even Stevens Movie (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0ODQ2MjUwN15BMl5BanBnXkFtZTcwNDE2MDQ4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0907794","name":"Walker Howard","idIMDB":"nm0907794"},"actorId":"nm0907794","character":"Blue","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Callum Keith Rennie","urlProfile":"http://www.imdb.com/name/nm0719678","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3MTUyMDczMl5BMl5BanBnXkFtZTgwOTk4MzI0OTE@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1960","placeOfBirth":" Sunderland, Tyne-and-Wear, England, UK","height":"5' 11\" (1.8 m)","bio":"Callum Keith Rennie was born in England, raised in Alberta, Canada and came late to acting - he discovered theatre in Edmonton at the age of 25. Starting out in university radio and working his way to the renowned Shaw Festival, Callum moved to Vancouver and quickly caught the eye of producers and directors. Currently he lives in Vancouver.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3MTUyMDczMl5BMl5BanBnXkFtZTgwOTk4MzI0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0719678","name":"Callum Keith Rennie","idIMDB":"nm0719678"},"actorId":"nm0719678","character":"Mitchell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tate Donovan","urlProfile":"http://www.imdb.com/name/nm0004883","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNzUxMTMwM15BMl5BanBnXkFtZTcwNDQ1Mzc1MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1963","placeOfBirth":" Tenafly, New Jersey, USA","birthName":"Tate Buckley Donovan","height":"6' (1.83 m)","bio":"Tate Buckley Donovan began making television appearances while still in his teens, most often cast as angst-ridden high schoolers in such made-for-TV films such as Not My Kid (1985) and Nutcracker: Money, Madness & Murder (1987). Donovan was born to a large family in Tenafly, New Jersey, the son of Eileen Frances (McAllister) and John Timothy Donovan, a surgeon. He is of Irish descent. Donovan moved to Los Angeles to be closer to the television industry while he attended college at USC, where he also met several fellow actors who became longtime friends, such as Grant Heslov and George Clooney, with whom he still parties with to this day (he also had a fairly substantial part in their smash film, Good Night, and Good Luck. (2005). Although not quite as active as his friend Clooney in the romantic arena, confirmed bachelor Donovan has been engaged to both film star Sandra Bullock and television icon Jennifer Aniston, and has dated a diverse group of women such as socialite Plum Sikes (2000), stage actress Whitney Allen (2001) and television actress Lauren Graham, whom he met when they both appeared in the play \"Once in a Lifetime\" at the Williamstown Theater Festival in 2002. After graduating from college, Donovan gained prominent notice for his portrayal of the charismatic yet self-centered co-pilot in the ensemble period drama Memphis Belle (1990). Prior to that, Donovan had appeared as the cocky elder camper in SpaceCamp (1986) and as a recovering drug addict in Clean and Sober (1988). His first leading role was in the charming but minor Love Potion No. 9 (1992), costarring Bullock, to whom he became engaged (their relationship ended in 1994). He then appeared in several independent features as sullen, withdrawn types before following up with a role in the Disney family comedy, Holy Matrimony (1994). He returned to Disney for perhaps his highest-profile effort to date, the animated Hercules (1997), for which he provided the voice for the adult version of the title character. His small-screen work has included a Cable ACE-nominated turn in the HBO series Vietnam War Story II (1988) (V). He joined the parade of film stars who turned to sitcoms, heading the cast of Partners (1995) opposite Jon Cryer. When that failed to catch on, he joined with his \"Memphis Belle\" co-stars Eric Stoltz and Reed Diamond to play three brothers in a memorable episode of NBC's Homicide: Life on the Street (1993) and had a recurring role as a client and potential love interest for Calista Flockhart's titular lawyer Ally McBeal (1997). Switching networks, he had a recurring role as a love interest opposite his then-girlfriend Jennifer Aniston in NBC's Friends (1994) and donned clerical garb to play the priest son of a large Irish Catholic family in the short-lived NBC drama Trinity (1998). More recently he has appeared as a guest star in several shows such as The Guardian (2001), as well as Mister Sterling (2003) and in the new show The O.C. (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNzUxMTMwM15BMl5BanBnXkFtZTcwNDQ1Mzc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004883","name":"Tate Donovan","idIMDB":"nm0004883"},"actorId":"nm0004883","character":"Dr. Graham Knight / Lucas Insley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paula Brancati","urlProfile":"http://www.imdb.com/name/nm1273957","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTgyNjE3M15BMl5BanBnXkFtZTcwODcyMzQ5OA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 June 1989","placeOfBirth":"","height":"5' 4\" (1.63 m)","bio":"Paula Brancati is a Canadian actress born in Markham, Ontario on June 6, 1989. During her high school years, Paula studied Improvisation and Musical Theatre with the CharActors Theatre Troupe. She also studied jazz and ballet at the AB Dance School. Her first break into screen acting began in 1999, marking the beginning of a career well over 10 years. Paula is best recognized for her roles on such television series \"Dark Oracle\" (2004-2006), \"Degrassi: The Next Generation\" (2007-2010) and \"Being Erica\" (2009-2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTgyNjE3M15BMl5BanBnXkFtZTcwODcyMzQ5OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1273957","name":"Paula Brancati","idIMDB":"nm1273957"},"actorId":"nm1273957","character":"Young Jane","urlCharacter":"http://www.imdb.com/character/ch0031647","main":true},{"actorName":"Elicia Mackenzie","urlProfile":"http://www.imdb.com/name/nm2129458","urlPhoto":"","biography":{"bio":"Elicia Mackenzie is an actress, known for How Do You Solve a Problem Like Maria? (2008), Painkiller Jane (2005) and Katie Chats (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2129458","name":"Elicia Mackenzie","idIMDB":"nm2129458"},"actorId":"nm2129458","character":"Young Carla","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Martin Cummins","urlProfile":"http://www.imdb.com/name/nm0192024","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1MTUwMzE4M15BMl5BanBnXkFtZTgwMjA3MjE5NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 November 1969","placeOfBirth":" North Delta, British Columbia, Canada","height":"5' 9\" (1.75 m)","bio":"Martin Cummins was born on November 28, 1969 in North Delta, British Columbia, Canada. He is an actor and director, known for Poltergeist, les aventuriers du surnaturel (1996), When Calls the Heart (2014) and Mr. Hockey: The Gordie Howe Story (2013). He has been married to Christine Wallace since July 12, 2013. He was previously married to Brandy Ledford.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1MTUwMzE4M15BMl5BanBnXkFtZTgwMjA3MjE5NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0192024","name":"Martin Cummins","idIMDB":"nm0192024"},"actorId":"nm0192024","character":"Sergeant Flynn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Conrad Whitaker","urlProfile":"http://www.imdb.com/name/nm0924252","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNjIxOTMwNV5BMl5BanBnXkFtZTgwMDU1MDk5NjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Conrad Whitaker was born in Rockmart, Georgia, USA and studied acting at The Stella Adler Academy in Hollywood, California. His first role was in the indie film Parasite (2004), shot on location in Oxford, England. He then had a string of roles on various television series including Supernatural (2005), Smallville (2001) and Rogue (2014), while living in Vancouver, BC Canada. Currently, he resides in Atlanta, Georgia where he recently filmed his role opposite Michael Keaton in the upcoming movie The Founder (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNjIxOTMwNV5BMl5BanBnXkFtZTgwMDU1MDk5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0924252","name":"Conrad Whitaker","idIMDB":"nm0924252"},"actorId":"nm0924252","character":"Homeboy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nels Lennarson","urlProfile":"http://www.imdb.com/name/nm0501971","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA4OTYyMDE2NV5BMl5BanBnXkFtZTcwNjU3NDUxMw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 October 1972","placeOfBirth":" Halifax, Nova Scotia, Canada","height":"6' (1.83 m)","bio":"Nels Lennarson was born on October 14, 1972 in Halifax, Nova Scotia, Canada. He is known for his work on The Cabin in the Woods (2012), Scary Movie (2000) and Horns (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA4OTYyMDE2NV5BMl5BanBnXkFtZTcwNjU3NDUxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0501971","name":"Nels Lennarson","idIMDB":"nm0501971"},"actorId":"nm0501971","character":"Agent Thorpe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aleks Paunovic","urlProfile":"http://www.imdb.com/name/nm0006820","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjc3NDI1ODIyOF5BMl5BanBnXkFtZTgwNTI0MTk1NjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1969","placeOfBirth":" Winnipeg, Manitoba, Canada","height":"6' 5\" (1.96 m)","bio":"Aleks Paunovic was born in Winnipeg, Manitoba to a Croatian mother and Serbian father. The result of this remarkable blend of bloodlines is the 6'5\" ruggedly handsome actor appearing on screens around the world at a rapidly escalating rate. Acting came to Aleks while he was onstage in his hometown playing in a heavy metal band, his livelihood since he was 16. Remarkably the role offered was one completely against type as it was that of Roddy McDowall's butler in the 1994 TV movie 'Heads'. Now bitten with the acting bug, Aleks combined his athleticism from his lifetime of boxing - he claims that he started boxing in the womb as all of the men in his family are boxers - and turned it into a very busy career as a stunt actor. In 2001 Aleks stopped in Vancouver on his way to Los Angeles with an impressive resume and ready to take on Hollywood when the most horrible event in America's recent history struck. 911 changed the way anyone could enter the states and so Aleks found himself a new home and career in busy Vancouver. Since coming to Vancouver Aleks has built an amazing resume with over 100 credits, most of which are lead and recurring roles like the one that he has on this hugely anticipated 4th season of 'Continuum'. Aleks credits three occurrences as the game-changers in his rocketing career: One was when the venerable acting coach Larry Moss called him out in front of 300 actors, telling him that he had massive talent and demanding to see his full range; another was when he respectfully declined an offer for a 4-episode-arc on a highly-rated TV series so that he could finish his run as 'Danny' in the play \"Danny and the Deep Blue Sea\" in a shaky old theatre to sold-out crowds. But the biggest catalyst in Aleks's career was when he fought three rounds of casting throughout all of Los Angeles and Vancouver to win the role of 'Tom', a developmentally disabled man accused of murder in 'Personal Effects' starring Ashton Kutcher, Michelle Pfieffer, and Kathy Bates. Aleks put on 65 pounds to perform the role, which was one of the most challenging and rewarding roles of his career so far. When you meet Aleks, or you watch him perform these difficult roles, you just know that with all of that leading man charisma there's star power in this man, and that you will be seeing a lot more of Aleks Paunovic.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjc3NDI1ODIyOF5BMl5BanBnXkFtZTgwNTI0MTk1NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006820","name":"Aleks Paunovic","idIMDB":"nm0006820"},"actorId":"nm0006820","character":"Sergeant Frizelle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Eklund","urlProfile":"http://www.imdb.com/name/nm1002664","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzEwODcwMDAyM15BMl5BanBnXkFtZTcwNTUxNjc1Ng@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Michael Eklund was born in Saskatoon, Saskatchewan, Canada. He is an actor and producer, known for The Call (2013), Watchmen (2009) and Eadweard (2015). He was previously married to Megan Bennett and Erin MacGilvray.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzEwODcwMDAyM15BMl5BanBnXkFtZTcwNTUxNjc1Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1002664","name":"Michael Eklund","idIMDB":"nm1002664"},"actorId":"nm1002664","character":"Dude","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Harmon","urlProfile":"http://www.imdb.com/name/nm2113653","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NDI3MzEzOV5BMl5BanBnXkFtZTcwMTM2OTc3Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1991","placeOfBirth":" Canada","height":"5' 9\" (1.75 m)","bio":"Richard Harmon was born on August 18, 1991 in Canada. He is an actor and producer, known for The 100 (2014), The Age of Adaline (2015) and If I Had Wings (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NDI3MzEzOV5BMl5BanBnXkFtZTcwMTM2OTc3Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2113653","name":"Richard Harmon","idIMDB":"nm2113653"},"actorId":"nm2113653","character":"Squeak","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0466391","urlIMDB":"http://www.imdb.com/title/tt0466391","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"11","month":"01","year":"2005","remarks":null},{"money":null,"country":null,"day":"04","month":"03","year":"2005","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.2","filmingLocations":[{"location":"Vancouver, British Columbia, Canada"}],"awards":[],"votes":"902","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0063682","name":"GEP Productions"},{"idCompany":"co0086887","name":"Insight Film Studios"},{"idCompany":"co0071026","name":"MGM Television"}],"keywords":{"keywords":["biochemical weapon","based on comic","vigilante","superheroine","marine","female protagonist","crime fighter"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:31:20"}}