{"data":{"movies":[{"title":"The Crazies","originalTitle":"","year":"2010","releaseDate":"20100226","directors":[{"name":"Breck Eisner","id":"nm0252135"}],"writers":[{"name":"Scott Kosar","id":"nm0466925"},{"name":"Ray Wright","id":"nm1242522"}],"runtime":"101 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMDU5OTg0NV5BMl5BanBnXkFtZTcwNDQ4MjcwMw@@._V1.jpg","countries":["USA","United Arab Emirates"],"languages":["English"],"genres":["Horror","Thriller"],"plot":"As a toxin begins to turn the residents of Ogden Marsh, Iowa into violent psychopaths, sheriff David Dutton tries to make sense of the situation while he, his wife, and two other unaffected townspeople band together in a fight for survival.","simplePlot":"About the inhabitants of a small Iowa town suddenly plagued by insanity and then death after a mysterious toxin contaminates their water supply.","actors":[{"actorName":"Timothy Olyphant","urlProfile":"http://www.imdb.com/name/nm0648249","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NzY0OTA2Ml5BMl5BanBnXkFtZTYwNDYzODgz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 May 1968","placeOfBirth":" Honolulu, Hawaii, USA","birthName":"Timothy David Olyphant","height":"6' (1.83 m)","bio":"From Timothy Olyphant's first screen appearances, such as his two-minute bit in The First Wives Club (1996), to \"Nicko\", whose presence at times dwarfed the island in A Perfect Getaway (2009), he has been a force to be reckoned with. Born in Hawaii, Timothy David Olyphant was raised in Modesto, California. He is the son of Katherine Lyon (Gideon) and John Vernon Bevan Olyphant, a college teacher who was also an executive at E & J Gallo Winery. He has an older brother, Andy, who is in A&R for Warner Bros. Records, and a younger brother, Matt Olyphant, who was the lead singer for the punk rock group, Fetish, and is also an artist. He is a descendant of the prominent Vanderbilt and Olyphant families of businesspeople, and his ancestry includes Russian Jewish (from a maternal great-grandfather), English, German, Scottish, Dutch, and Irish. Timothy quickly became Modesto's favorite son, competing as a pro swimmer and excelling at drawing. It was, by chance, that he enrolled in an acting course as an elective and decided to pursue an acting career. He took his family and headed to New York City, where he studied the craft and began auditioning for roles. From the beginning, he tried to choose diversified roles and take chances with every genre and always approached everything he did with commitment, humor and grace. Timothy is married to his college sweetheart, Alexis Knief, and, together, they raise three children, one son and two daughters in California. He has managed to keep his personal life out of the tabloids. He obviously has his priorities straight, as this is no easy task in Hollywood. Highlights of Olyphant's career include his riveting portrayal of \"Sheriff Seth Bullock\" in HBO's hit drama, Deadwood (2004). He now personifies intensity as complex Kentucky Marshal, \"Raylan Givens\", in FX's Justified (2010). On the big screen, in 2010's The Crazies (2010), he had the chance to infuse his character with doubts, fears and humaneness in an inhumane situation. Mr. Olyphant proved he could carry a major movie on his talent, alone. He recently appeared in I Am Number Four (2011), a Steven Spielberg sci-if thriller, in which Tim provided the adult mentorship, taking a back seat to the teen cast.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NzY0OTA2Ml5BMl5BanBnXkFtZTYwNDYzODgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0648249","name":"Timothy Olyphant","nicknames":["Olyphantastic"],"idIMDB":"nm0648249"},"actorId":"nm0648249","character":"David","urlCharacter":"http://www.imdb.com/character/ch0209223","main":true},{"actorName":"Radha Mitchell","urlProfile":"http://www.imdb.com/name/nm0593664","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU1MTUwMzYwM15BMl5BanBnXkFtZTgwNjEzODM3NTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 November 1973","placeOfBirth":" Melbourne, Victoria, Australia","birthName":"Radha Rani Amber Indigo Anunda Mitchell","height":"5' 5¾\" (1.67 m)","bio":"Radha Mitchell (born 12 November 1973) is an Australian actress. She started her career acting in various Australian TV series and movies, and later became known for her appearance in Hollywood films. Mitchell, a native of Melbourne, began acting when she was still in high school and had her professional debut on the popular Australian soap, Les voisins (1985) in 1994. Two years later, she made her film debut in the romantic comedy Love and Other Catastrophes (1996), in which she starred as a college student experiencing a messy breakup. The film proved to be fairly popular in Australia, but it wasn't until she was cast in High Art (1998) that Mitchell gained an introduction to a wider audience. The critical success of \"High Art\" made it possible for her to do more international work, and her increasing popularity was reflected by her subsequent casting in a number of projects. Among them were Pitch Black (2000), a sci-fi horror film in which Mitchell played a pilot whose ship crashes on a hostile planet, and Everything Put Together (2000), a drama where she plays a suburban woman shunned by her peers after the death of her baby. Her career continued with a diverse run of films, including Nobody's Baby (2001), Man on Fire (2004), Finding Neverland (2004), and landing the lead in Woody Allen's Melinda and Melinda (2004). Those last three films all hit the screens in 2004, and although kept working steadily, she never quite capitalized on the buzz she generated that year. Her other credits include Silent Hill (2006), Henry Poole Is Here (2008), Surrogates (2009) and The Crazies (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU1MTUwMzYwM15BMl5BanBnXkFtZTgwNjEzODM3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0593664","name":"Radha Mitchell","idIMDB":"nm0593664"},"actorId":"nm0593664","character":"Judy","urlCharacter":"http://www.imdb.com/character/ch0176609","main":true},{"actorName":"Joe Anderson","urlProfile":"http://www.imdb.com/name/nm1725848","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NTE4NjM3M15BMl5BanBnXkFtZTcwODk3NjgyMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1982","placeOfBirth":" England, UK","height":"5' 11¼\" (1.81 m)","bio":"Joe Anderson was born on March 26, 1982 in England. He is an actor, known for Across the Universe (2007), The Grey (2011) and The Crazies (2010). He is married to Elle.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NTE4NjM3M15BMl5BanBnXkFtZTcwODk3NjgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1725848","name":"Joe Anderson","idIMDB":"nm1725848"},"actorId":"nm1725848","character":"Russell","urlCharacter":"http://www.imdb.com/character/ch0179340","main":true},{"actorName":"Danielle Panabaker","urlProfile":"http://www.imdb.com/name/nm1263939","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNzc1NDA4OF5BMl5BanBnXkFtZTgwMzExMzQzMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 September 1987","placeOfBirth":" Augusta, Georgia, USA","birthName":"Danielle Nicole Panabaker","height":"5' 7\" (1.7 m)","bio":"Danielle Nicole Panabaker was born in Augusta, Georgia. Her younger sister, actress Kay Panabaker, starred in the TV series, Summerland (2004)(WB, 2004-05). Panabaker started acting at a summer camp, before joining community theater productions when she was 10-years-old. Panabaker moved to Naperville, IL, where she was a member of the Neuqua Valley High School speech team. At the age of 14, while most students her age were barely starting their high school career, she graduated. Panabaker followed her initial appearances in commercials with roles in television, including a part in the series, The Guardian (2001) (for which she won a Young Artist Award), as well as other television series, including Malcolm in the Middle (2000), Law & Order: Special Victims Unit (1999), Medium (2005), Summerland (2004), and the Disney Channel original movie, Stuck in the Suburbs (2004). She also appeared in the Lifetime Television productions Sex & the Single Mom (2003) and Mom at Sixteen (2005), as well as the well-reviewed miniseries, Empire Falls (2005). She considers \"Empire Falls\" to be her big break, as it gave her the confidence to pursue her career. In addition, Panabaker appeared in stage productions, with roles in musical theater, including \"West Side Story\", \"Pippin\", \"Once Upon A Time\", and \"Beauty Lou and the Country Beast\". In 2004, she starred in the ABC film, Searching for David's Heart (2004), alongside former co-Disney star Raviv Ullman. In 2005, Panabaker co-starred in two widely-released theatrical films, Sky High (2005) and Yours, Mine & Ours (2005). Her next role was in the film, Home of the Giants (2007), opposite Ryan Merriman and Haley Joel Osment. She also had a supporting role in the film, Mr. Brooks (2007), opposite Kevin Costner. In the Disney Channel original movie, Read It and Weep (2006), she plays \"Is\", an alternate version of \"Jamie\", who was played by her real-life sister, Kay Panabaker.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNzc1NDA4OF5BMl5BanBnXkFtZTgwMzExMzQzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1263939","name":"Danielle Panabaker","nicknames":["Grace"],"idIMDB":"nm1263939"},"actorId":"nm1263939","character":"Becca","urlCharacter":"http://www.imdb.com/character/ch0242638","main":true},{"actorName":"Christie Lynn Smith","urlProfile":"http://www.imdb.com/name/nm0807700","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3YjMwYzAtNTY3OC00M2M2LWJiZDUtMTQ2MzhkMzliM2YwL2ltYWdlXkEyXkFqcGdeQXVyMTc2MTI2Ng@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"March1969","placeOfBirth":" USA","height":"5' 5\" (1.65 m)","bio":"One word that instantly comes to mind when describing Christie Lynn's acting talent is versatile. With her natural beauty and strong emotional depth, Christie has been termed a chameleon for her ability to morph from character to another character. Equally adept at drama and comedy, she is now a veteran of over forty television series and a wonderful collection of films. Christie spent most of her childhood growing up in the small town of Orange Park, Florida. Her acting career started during high school, doing local commercials and industrials. But her love for acting began years earlier when, as a child, she would pretend to be Olivia Newton-John from the film, Grease (1978), and act out scenes with neighborhood friends. She earned her Screen Actors Guild card right out of high school by landing a guest spot on the television show, Super Force (1990), and followed it up with an even bigger guest-starring role on the series, Swamp Thing (1990), that had local casting directors taking notice of this young talent. Christie Lynn knew she had to move to Hollywood to pursue her love of acting and storytelling and that's what she did. She dove into acting classes with famed acting coaches Cameron Thor, Howard Fine, Jay R. Goldenberg, the renowned Uta Hagen, Eric Morris and the Los Angeles comedy troupe, \"The Groundlings\". Her hard work was quickly rewarded. Christie was snapped up to star in the soap opera, Forever (1996), that would take her on location to film in Mexico City for a year. With 160 episodes under her belt, she returned to Los Angeles and landed her first lead role in a television pilot, USMA West Point (1998). Christie then started to work consistently in television, guest-starring on many of Aaron Spelling's hit shows, like Beverly Hills, 90210 (1990), 7th Heaven (1996) and Charmed (1998). Her most recent television credits range from recurring roles on Bones (2005), Malcolm in the Middle (2000), General Hospital (1963) and Days of Our Lives (1965) to guest appearances on Justified (2010), Chase (2010), Castle (2009), Boston Legal (2004), House (2004), Three Rivers (2009), Saving Grace (2007), ER (1994), Las Vegas (2003), Monk (2002), Without a Trace (2002) and CSI: Crime Scene Investigation (2000), to name a few. Christie Lynn's film career started out with a bang in 2001, when she was hand-picked by the most prestigious casting directors in Hollywood, Jane Jenkins and Janet Hirshenson (A Beautiful Mind (2001), The Da Vinci Code (2006)) for the lead role of \"Susie Downey\", the perky church girl with a hidden secret, in the comedy, What Boys Like (2003) (aka \"What Boys Like\"). She followed that film with the role of \"Catherine Carter Corbin\", the demure Southern belle in Ted Turner's Civil War epic, Gods and Generals (2003), starring Robert Duvall, Stephen Lang and Jeff Daniels. Other film roles include the thriller, The Last Stop Cafe (2003), for which she was nominated for Best Actress at the Eerie Horror Film Festival for her role as a serial killer on the run. Christie then starred in the dark psychological drama, Inside Irvin (2004), portraying a tortured agoraphobic. She received rave reviews, the most complimentary of all from Todd Davis at CBS Radio, who said, \"Kudos to... actress Christie Lynn Smith, whose work here is worthy of Academy Award acknowledgment\". Soon after, Christie starred in Grace (2006), as one of only two characters in the award-winning short film. Actor/director Laurence Fishburne praised the film's \"sensitive, illuminating performances\". Christie's raw portrayal of the suicidal \"Rae\" also garnered her a Leading Actor Accolade film award in 2007 and a Best Actress nomination from the film festival Method Fest. In 2008, Christie took on her biggest and best role yet, becoming a new mom. She gave birth to her beautiful daughter, Abby Ryder, on March 14, 2008. After taking some time off to spend with her new baby and husband, actor John Fortson, Christie booked two films back to back. The first was the lead role of \"May Keifner\", the dry-witted, ballsy woman in the feature Ticket Out (2012), also starring Ray Liotta and Billy Burke. The film was produced by Oscar-nominated director Chris Noonan (Babe, le cochon devenu berger (1995) and Miss Potter (2006)). Christie then went straight into production on The Crazies (2010), the remake of the classic George A. Romero film, playing \"Deardra Farnum\", a protective mother living in a small town beset by death. The film is directed by Breck Eisner (Sahara (2005)) and produced by Michael Aguilar (The Departed (2006)). When Christie is not acting, she loves spending time with her family, practicing yoga, hiking, traveling, surfing, cooking, having afternoon tea and playing gin rummy - more specifically, beating her husband at gin rummy. Great things lie ahead for this beautiful, multi-talented chameleon who continues to create real and moving characters time and time again.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3YjMwYzAtNTY3OC00M2M2LWJiZDUtMTQ2MzhkMzliM2YwL2ltYWdlXkEyXkFqcGdeQXVyMTc2MTI2Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0807700","name":"Christie Lynn Smith","idIMDB":"nm0807700"},"actorId":"nm0807700","character":"Deardra Farnum","urlCharacter":"http://www.imdb.com/character/ch0180051","main":true},{"actorName":"Brett Rickaby","urlProfile":"http://www.imdb.com/name/nm0725434","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNjg2MjU0M15BMl5BanBnXkFtZTgwMDQ5MTY5MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 December 1964","placeOfBirth":" Shafer, Minnesota, USA","bio":"Born December 15, 1964, the son of a dairy farmer in Shafer, Minnesota (population 81), Brett Rickaby attended Chisago Lakes High School where, as a senior, he received a letter from a professor at the University of Minnesota in Duluth encouraging him to attend their theatre program. Taking this as a sign, he enrolled at UMD and did not get cast in a single production his first year. Briefly, he considered hanging it up to become a tree trimmer, but re-dedicated himself and was cast in seven full-scale productions his sophomore year. By his senior year (1987) he had won what is roughly the acting equivalent of Heisman Trophy, The National Irene Ryan Acting Award at the Kennedy Center in Washington, D.C. That fall he received a scholarship to attend New York University's MFA program with contemporaries and classmates Peter Krause (Six Feet Under (2001)), Camryn Manheim (The Practice (1997), Marcia Gay Harden (Pollock (2000)), Rainn Wilson (The Office (2005)) and Debra Messing (Will & Grace (1998)), and originated two plays with Pulitzer Prize-winning playwright and director Tony Kushner (Angels in America (2003)). Rickaby performed in numerous New York and regional theatre productions including The New York Shakespeare Festival, The Roundabout and The Actors Theatre of Louisville. In 1995, he was hired by Nicholas Hytner (The Madness of King George (1994)) to play Jigger Craigin in the National Tour of \"Carousel\" with Patrick Wilson (Hard Candy (2005)). In front of the camera, Rickaby has demonstrated a wide range of looks and sensibilities but is mostly known for playing a variety of psychopaths, sociopaths and other disturbed individuals.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNjg2MjU0M15BMl5BanBnXkFtZTgwMDQ5MTY5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0725434","name":"Brett Rickaby","idIMDB":"nm0725434"},"actorId":"nm0725434","character":"Bill Farnum","urlCharacter":"http://www.imdb.com/character/ch0180383","main":true},{"actorName":"Preston Bailey","urlProfile":"http://www.imdb.com/name/nm2259079","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5OTk1NjI1NF5BMl5BanBnXkFtZTgwODYyMTg4OTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 July 2000","placeOfBirth":" Portland, Oregon, USA","height":"5' 10\" (1.78 m)","bio":"Preston Bailey was born on July 25, 2000 in Portland, Oregon, USA. He is an actor, known for Dexter (2006), A Million Ways to Die in the West (2014) and It's Always Sunny in Philadelphia (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5OTk1NjI1NF5BMl5BanBnXkFtZTgwODYyMTg4OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2259079","name":"Preston Bailey","idIMDB":"nm2259079"},"actorId":"nm2259079","character":"Nicholas","urlCharacter":"http://www.imdb.com/character/ch0137324","main":true},{"actorName":"John Aylward","urlProfile":"http://www.imdb.com/name/nm0043891","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMDE5NDg2N15BMl5BanBnXkFtZTYwOTI0MDky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 November 1946","placeOfBirth":" Seattle, Washington, USA","bio":"John Aylward was born on November 7, 1946 in Seattle, Washington, USA. He is known for his work on The Crazies (2010), Armageddon (1998) and ER (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMDE5NDg2N15BMl5BanBnXkFtZTYwOTI0MDky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0043891","name":"John Aylward","idIMDB":"nm0043891"},"actorId":"nm0043891","character":"Mayor Hobbs","urlCharacter":"http://www.imdb.com/character/ch0447654","main":true},{"actorName":"Joe Reegan","urlProfile":"http://www.imdb.com/name/nm1235449","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNjI3ODkyNF5BMl5BanBnXkFtZTgwMDQ4MjkwNzE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"bio":"Joe will soon be seen in the feature film Outpost 37: Alien Outpost, directed by Emmy award winner, Jabbar Raisani. Outpost 37 tells a story of an elite unit of soldiers in the wake of a post-apocalyptic invasion. He is currently developing Craig Borten's, (writer of Dallas Buyer's Club), next feature film. Joe recently finished co-writing the film adaptation of the off Broadway play, Kid Champion, made famous by Christopher Walken during the 1970's. His previous feature credits include: the Sundance darling, I Melt With You, as part of a dynamic cast which included Carla Gugino, Thomas Jane, Jeremy Piven, Rob Lowe and BAFTA nominee Christian McKay. Joe's first experience with Sundance Film Festival was in 2005 where he made his debut starring in the Frank E. Flowers film Swallow, an Official Sundance Selection and multiple award-winning film. Immediately following the success of Swallow - Joe was cast in the controversial film titled Snuff Movie for cult director Bernard Rose. (Immortal Beloved). Joe played the memorable Pvt. Billy Babcock in George Romero's remake of The Crazies (directed by Breck Eisner). Joe's feature credits range from serious dramatic roles to action, broad comedy and genre. He has worked with a wide range of industry heavyweights including Academy Award winners Holly Hunter, Gary Sinese, Timothy Olyphant, Radha Mitchell, Annabella Sciorra -producers: Francis Ford Coppola, Rob Cohen, Neil Labute, and directors: Frank E. Flowers, Victor Salva, Eric Bross and Breck Eisner. Joe recently recurred on Chicago PD for NBC and in Luc Besson's, Taxi Brooklyn for NBC. Joe has recurred and done multi-episode arcs on the majority of prime-time's top ranked shows. Several of these include: CSI, CSI:NY, CSI:Miami , Cold Case, Without A Trace, The Whole Truth, Castle, Hawaii 5-0, NCIS, Criminal Minds, and the ABC pilot, Edgar Floats. His comedy TV credits include The Next Generation Wayans for BET and Hollywood Heights for Nickelodeon. Joe is recently wrapped filming CSI:Cyber opposite Patricia Arquette. Joe currently resides in Los Angeles and New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNjI3ODkyNF5BMl5BanBnXkFtZTgwMDQ4MjkwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1235449","name":"Joe Reegan","nicknames":["JR"],"idIMDB":"nm1235449"},"actorId":"nm1235449","character":"Pvt. Billy Babcock","urlCharacter":"http://www.imdb.com/character/ch0242640","main":true},{"actorName":"Glenn Morshower","urlProfile":"http://www.imdb.com/name/nm0607703","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI3MTU0MTE4N15BMl5BanBnXkFtZTgwNDYzNjIwMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 April 1959","placeOfBirth":" Dallas, Texas, USA","birthName":"Glenn Grove Bennett","height":"5' 10½\" (1.79 m)","bio":"Glenn Morshower was born on April 24, 1959 in Dallas, Texas, USA as Glenn Grove Bennett. He is an actor and producer, known for Bloodline (2015), Supergirl (2015) and Transformers: Dark of the Moon (2011). He has been married to Carolyn Elizabeth Lindsley since December 30, 1978. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI3MTU0MTE4N15BMl5BanBnXkFtZTgwNDYzNjIwMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0607703","name":"Glenn Morshower","idIMDB":"nm0607703"},"actorId":"nm0607703","character":"Intelligence Officer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Larry Cedar","urlProfile":"http://www.imdb.com/name/nm0147738","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NjQ5MDQxNl5BMl5BanBnXkFtZTgwNDYyOTM2MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1955","placeOfBirth":" Los Angeles County, California, USA","height":"6' (1.83 m)","bio":"Larry Cedar is an accomplished film, television, stage and voiceover artist. Admitted to Hastings Law School after earning his BA in Communication Studies, the course of his life was dramatically altered when he impulsively decided to audition for, and was accepted into, the MFA Theater program at UCLA. There he participated in and won the Hugh O'Brian Acting Competition award for Best Actor and as a result was signed to an exclusive one-year artist development contract with Universal Studios, where he subsequently appeared in his first television pilot. He went on to star in various projects for Walt Disney Studios, numerous episodics and several feature films, including a starring role opposite Rebecca De Mornay and Mary Gross in the Ivan Reitman-produced Feds (1988), as well as an unforgettable appearance opposite John Lithgow as \"The Creature on the Wing\" in the Steven Spielberg remake of Twilight Zone: The Movie (1983), directed by George Miller. Larry spent six years in New York starring in the award-winning PBS series Square One Television (1987) and later starred in 40 episodes of the Fox television series A.J.'s Time Travelers (1995) produced by Gianni Russo. An excellent singer, on stage he has portrayed Hoagy Carmichael in \"Hoagy, Bix, and Wolfgang Beethoven Bunkhaus\" at the Mark Taper Forum in Los Angeles, starred as \"Vernon\" opposite Lea Thompson in \"They're Playing Our Song\", and as \"Secretary Thompson\" in \"1776: The Musical\" opposite Roger Rees. An avid reader and monologist, he is currently developing a one-man show based on the works of one of his favorite authors, George Orwell. In 2003 he was nominated for two Los Angeles Theater Alliance \"Ovation\" awards for his performances in \"Anything Goes\" (as Lord Oakley) opposite Rachel York and \"She Loves Me\" (as Sipos, for which he ultimately won Best Featured Actor in a Musical). He also excels in the field of voiceovers, and in addition to lending his numerous vocal characterizations to hundreds of commercials, cartoon series, and video games, he specializes in the art of \"speed talking\". Demos of his voiceover work can be heard at www.disclaimerman.com. Larry currently recurs as \"Leon\", the opium-addicted card dealer and thief, in HBO's newest hit series, _\"Deadwood\" (2004/I)_ opposite Powers Boothe, Ricky Jay and Ian McShane. He most recently completed work opposite Keanu Reeves as the horrific \"Vermin Man\" (with special effects makeup by Stan Winston) in Constantine (2005), directed by Francis Lawrence.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NjQ5MDQxNl5BMl5BanBnXkFtZTgwNDYyOTM2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0147738","name":"Larry Cedar","idIMDB":"nm0147738"},"actorId":"nm0147738","character":"Ben Sandborn","urlCharacter":"http://www.imdb.com/character/ch0180903","main":true},{"actorName":"Gregory Sporleder","urlProfile":"http://www.imdb.com/name/nm0819440","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MDQyMzk0MF5BMl5BanBnXkFtZTcwMjg3NzkxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 April 1964","placeOfBirth":" USA","birthName":"Gregory Michael Sporleder","bio":"Gregory Sporleder was born on April 24, 1964 in the USA as Gregory Michael Sporleder. He is an actor and writer, known for The Rock (1996), Being John Malkovich (1999) and Black Hawk Down (2001). He has been married to Megan since 2001.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MDQyMzk0MF5BMl5BanBnXkFtZTcwMjg3NzkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0819440","name":"Gregory Sporleder","idIMDB":"nm0819440"},"actorId":"nm0819440","character":"Travis Quinn","urlCharacter":"http://www.imdb.com/character/ch0178001","main":true},{"actorName":"Mike Hickman","urlProfile":"http://www.imdb.com/name/nm0382750","urlPhoto":"","biography":{"bio":"Mike Hickman is known for his work on The Crazies (2010), The Spectacular Now (2013) and Hudson Taylor (1981).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0382750","name":"Mike Hickman","idIMDB":"nm0382750"},"actorId":"nm0382750","character":"Rory Hamill","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lisa K. Wyatt","urlProfile":"http://www.imdb.com/name/nm0943566","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMzk5MjE5OV5BMl5BanBnXkFtZTcwMTUxMDYzMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Lisa K. Wyatt is an actress and producer, known for The Office (2005), Donnie Darko (2001) and The Crazies (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMzk5MjE5OV5BMl5BanBnXkFtZTcwMTUxMDYzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0943566","name":"Lisa K. Wyatt","idIMDB":"nm0943566"},"actorId":"nm0943566","character":"Peggy Hamill","urlCharacter":"http://www.imdb.com/character/ch0181072","main":true},{"actorName":"Justin Welborn","urlProfile":"http://www.imdb.com/name/nm0919482","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MzI1NjI4Ml5BMl5BanBnXkFtZTgwODQzMDY0NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Justin Welborn is known for his work on The Final Destination (2009), The Crazies (2010) and The Signal (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MzI1NjI4Ml5BMl5BanBnXkFtZTgwODQzMDY0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0919482","name":"Justin Welborn","idIMDB":"nm0919482"},"actorId":"nm0919482","character":"Curt Hammil","urlCharacter":"http://www.imdb.com/character/ch0181073","main":true}],"seasons":[],"idIMDB":"tt0455407","urlIMDB":"http://www.imdb.com/title/tt0455407","business":{"budget":{"money":"$20,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$16,067,552","country":"USA","day":"28","month":"02","year":"2010","remarks":"2 Screens"},{"money":"£1,194,207","country":"UK","day":"28","month":"02","year":"2010","remarks":"345 Screens"}],"gross":[{"money":"$39,103,378","country":"USA","day":"16","month":"05","year":"2010","remarks":""},{"money":"$39,017,861","country":"USA","day":"09","month":"05","year":"2010","remarks":""},{"money":"$38,913,446","country":"USA","day":"02","month":"05","year":"2010","remarks":""},{"money":"$38,725,816","country":"USA","day":"25","month":"04","year":"2010","remarks":""},{"money":"$38,574,996","country":"USA","day":"18","month":"04","year":"2010","remarks":""},{"money":"$38,471,410","country":"USA","day":"11","month":"04","year":"2010","remarks":""},{"money":"$38,240,768","country":"USA","day":"04","month":"04","year":"2010","remarks":""},{"money":"$37,673,626","country":"USA","day":"28","month":"03","year":"2010","remarks":""},{"money":"$36,396,873","country":"USA","day":"21","month":"03","year":"2010","remarks":""},{"money":"$33,389,308","country":"USA","day":"14","month":"03","year":"2010","remarks":""},{"money":"$27,472,164","country":"USA","day":"07","month":"03","year":"2010","remarks":""},{"money":"$16,067,552","country":"USA","day":"28","month":"02","year":"2010","remarks":""},{"money":"£3,255,301","country":"UK","day":"21","month":"03","year":"2010","remarks":""},{"money":"£3,060,740","country":"UK","day":"14","month":"03","year":"2010","remarks":""},{"money":"£2,514,167","country":"UK","day":"07","month":"03","year":"2010","remarks":""},{"money":"£1,194,207","country":"UK","day":"28","month":"02","year":"2010","remarks":""}],"weekendGross":[{"money":"$57,042","country":"USA","day":"16","month":"05","year":"2010","remarks":"111 Screens"},{"money":"$66,816","country":"USA","day":"09","month":"05","year":"2010","remarks":"149 Screens"},{"money":"$132,353","country":"USA","day":"02","month":"05","year":"2010","remarks":"197 Screens"},{"money":"$126,642","country":"USA","day":"25","month":"04","year":"2010","remarks":"201 Screens"},{"money":"$62,571","country":"USA","day":"18","month":"04","year":"2010","remarks":"108 Screens"},{"money":"$103,229","country":"USA","day":"11","month":"04","year":"2010","remarks":"162 Screens"},{"money":"$256,394","country":"USA","day":"04","month":"04","year":"2010","remarks":"415 Screens"},{"money":"$724,623","country":"USA","day":"28","month":"03","year":"2010","remarks":"851 Screens"},{"money":"$1,488,393","country":"USA","day":"21","month":"03","year":"2010","remarks":"1,495 Screens"},{"money":"$3,680,940","country":"USA","day":"14","month":"03","year":"2010","remarks":"2,359 Screens"},{"money":"$7,078,851","country":"USA","day":"07","month":"03","year":"2010","remarks":"2,479 Screens"},{"money":"$16,067,552","country":"USA","day":"28","month":"02","year":"2010","remarks":"2,477 Screens"},{"money":"£82,645","country":"UK","day":"21","month":"03","year":"2010","remarks":"180 Screens"},{"money":"£252,353","country":"UK","day":"14","month":"03","year":"2010","remarks":"296 Screens"},{"money":"£673,551","country":"UK","day":"07","month":"03","year":"2010","remarks":"348 Screens"},{"money":"£1,194,207","country":"UK","day":"28","month":"02","year":"2010","remarks":"345 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"05","month":"03","year":"2009","remarks":null},null],"copyrightHolder":"©2010 Overture Films, LLC"},"technical":{"runtime":["1 hr 41 min (101 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arricam LT, Zeiss Master Prime Lenses","Arriflex 235, Zeiss Master Prime Lenses"],"laboratory":["CineFilm Laboratory, Atlanta (GA), USA","Company 3, Los Angeles (CA), USA (digital intermediate)","Technicolor, Hollywood (CA), USA (prints)"],"filmLength":["2,761 m (Portugal, 35 mm)"],"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Fuji Eterna-CP 3513DI)","D-Cinema"]},"rating":"6.5","metascore":"55","filmingLocations":[{"location":"Cordele, Georgia, USA"}],"rated":"R","awards":[{"award":"Empire Awards, UK 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Empire Award","categories":[{"category":"Best Horror","names":[]}]}]},{"award":"Fangoria Chainsaw Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Chainsaw Award","categories":[{"category":"Best Wide-Release Film","names":[]},{"category":"Best Supporting Actor","names":[{"name":"Joe Anderson","id":"nm1725848","role":null}]},{"category":"Best Makeup/Creature FX","names":[{"name":"Robert Hall","id":"nm0356042","role":null}]}]}]},{"award":"Fright Meter Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Fright Meter Award","categories":[{"category":"Best Horror Movie","names":[]},{"category":"Best Director","names":[{"name":"Breck Eisner","id":"nm0252135","role":null}]}]}]},{"award":"Golden Schmoes Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Best Horror Movie of the Year","names":[]}]}]},{"award":"People's Choice Awards, USA 2011","titlesAwards":[{"titleAwardOutcome":"Nominated People's Choice Award","categories":[{"category":"Favorite Horror Movie","names":[]}]}]},{"award":"Scream Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Scream Award","categories":[{"category":"Best Horror Actor","names":[{"name":"Timothy Olyphant","id":"nm0648249","role":null}]},{"category":"Best Horror Movie","names":[]}]}]},{"award":"Young Artist Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Performance in a Feature Film - Supporting Young Actor Ten and Under","names":[{"name":"Preston Bailey","id":"nm2259079","role":null}]}]}]}],"votes":"96,284","type":"Movie","companyCreditsSimple":[{"idCompany":"co0193414","name":"Overture Films"},{"idCompany":"co0132772","name":"Participant Media"},{"idCompany":"co0251916","name":"Imagenation Abu Dhabi FZ"}],"keywords":{"keywords":["rural setting","sheriff","deputy","survival","self sacrifice","house on fire","barn","pregnancy","car wash","quarantine","pitchfork","government coverup","iowa","army","hunter","biological weapon","baseball game","marsh","rifle","concentration camp","wheel boot","stabbed with a pitchfork","hazmat suit","humvee","morgue","trance","female doctor","harvester","satellite image","laundry drying on clothes line","nosebleed","nuclear explosion","bulletproof vest","bus","school bus","ghost town","no cellphone signal","jail cell","police car","helicopter","gas mask","baseball field","swimming pool","american midwest","mayor","death of boyfriend","teenager","boat","gasoline","combine harvester","stabbed in the hand","knife","held at gunpoint","friendship","autopsy","doctor","infection","disease","virus","epidemic","hanged woman","mouth sewn shut","tied to a chair","shot in the forehead","swamp","catatonia","country doctor","fight","death","escape","dead pilot","insanity","cult film","chain link fence","pump action shotgun","whistling","wooden match","double barreled shotgun","city on fire","ambiguous ending","fugitive","f word","chaos","blood on shirt","mushroom cloud","walkie talkie","keys","massacre","cigarette lighter","bottled water","gift shop","diner","circular saw","truck stop","gas station","roadblock","punched in the face","truck accident","overturning car","car accident","flat tire","strangulation","revenge","bound and gagged","execution","mutation","violence","riot","shootout","assault rifle","locker","computer","coffee","tank","firefighter","fire truck","ambulance","revolver","pistol","machine gun","military","u.s. army","high school","rescue","parachute","lake","hunting","farmer","cornfield","impalement","blood splatter","gash in the face","father son relationship","mother son relationship","family relationships","death of husband","boyfriend girlfriend relationship","burning car","cell phone","secretary","police officer shot in the chest","police officer shot","murder of a police officer","exploding car","hand over mouth","cover up","stabbed in the throat","stabbed in the chest","stabbed to death","police station","on the run","shot in the back","child murder","high school principal","murder of family","shot to death","shot in the chest","shot in the head","person on fire","shot through a window","stabbed in the shoulder","hiding in a closet","corpse","truck","explosion","face slap","funeral home","survival horror","satellite","set on fire","farm","blood","shotgun","small town","weird behavior","mortuary","skin sore","infectious disease","murder","arson","catatonic state","mania","child in peril","burned to death","fire","exposure to radiation","atomic explosion","husband wife relationship","female physician","contamination suit","shadowy figure","knife through hand","gore","flame thrower","semiautomatic rifle","handgun","car explosion","car wreck","cut off from the outside world","fugitive hero","biological weapon spill","contamination containment","genocide","us army as villain","anti military","homicidal maniac","dementia","remake","death of friend","death of father","surprise ending","zombie","pull the plug","sphygmanometer","open ended","disaster film","desert","bare chested male","eyes sewn shut","plane crash","scene during end credits","no opening credits","roomful of corpses","inexplicable behavior change","menace to community","horror movie remake","soldier"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 00:50:02"}}