{"data":{"movies":[{"title":"Just Like Heaven","originalTitle":"","year":"2005","releaseDate":"20050916","directors":[{"name":"Mark Waters","id":"nm0914134"}],"writers":[{"name":"Peter Tolan","id":"nm0865847"},{"name":"Leslie Dixon","id":"nm0228908"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0Njk2OTY2N15BMl5BanBnXkFtZTcwNTAxNjAzMQ@@._V1.jpg","countries":["USA"],"languages":["English","Spanish","Mandarin"],"genres":["Comedy","Fantasy","Romance"],"plot":"Elizabeth Masterson, a dedicated doctor in San Francisco, had almost no time for anything. When her sister with two kids set her up on a date, she gets into a tragic car crash and goes into a coma. Meanwhile, a landscape architect named David Abbott moves to San Francisco and, coincidentally, into Elizabeth's apartment for rent. While at the apartment, Elizabeth's spirit haunts him. She doesn't remember who she is, who her family is or what she did - All that she remembered was her apartment and where everything was. To settle the arguments, David agrees to figure out who Elizabeth really is. When they get close to figuring out who she is, they eventually find love with one another and as they finally know who she really is, they learn that fate really has put them both together.","simplePlot":"A lonely landscape architect falls for the spirit of the beautiful woman who used to live in his new apartment.","actors":[{"actorName":"Reese Witherspoon","urlProfile":"http://www.imdb.com/name/nm0000702","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDcxMDA5Ml5BMl5BanBnXkFtZTgwNDM1NTU5MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1976","placeOfBirth":" New Orleans, Louisiana, USA","birthName":"Laura Jeanne Reese Witherspoon","height":"5' 1½\" (1.56 m)","bio":"Laura Jeanne Reese Witherspoon was born on March 22, 1976 at Southern Baptist Hospital (now Memorial Medical Center) in New Orleans, Louisiana. She is the second child of Mary Elizabeth \"Betty\" (Reese) and Dr. John Draper Witherspoon, Sr. Her father was a military surgeon specializing in ear, nose and throat. Her mother was a Registered Nurse who later became a Ph.D in pediatric nursing. Reese spent the first four years of her life in Wiesbaden, Germany, where her father served as a lieutenant colonel in the US Army reserves. Shortly after, John moved the family back to the States, settling in Nashville, Tennessee. Reese was introduced to the entertainment industry at a very early age. At age 7, she began modeling. This led to appearances on several local television commercials. At age 11, she placed first in a Ten-State Talent Fair. In 1990, she landed her first major acting role in Robert Mulligan's The Man in the Moon (1991). Her role as a 14-year old tomboy earned her rave reviews. Roles in bigger films such as Jack the Bear (1993) and A Far Off Place (1993) followed shortly after. Following high school graduation in 1994 from Harpeth Hall, a Nashville all girls school, Reese decided to put her acting career on hold and attend Stanford University where she would major in English literature. However, her collegiate plans were shortly dashed when she accepted roles to star in two major motion pictures: Fear (1996) alongside Mark Wahlberg and Freeway (1996) with Kiefer Sutherland. Although neither film was a huge box-office success, they did help to establish Reese as a rising starlet in Hollywood and open the door for bigger and better film roles. Those bigger roles came in movies such as Pleasantville (1998), Election (1999) and Cruel Intentions (1999). Her breakthrough role came as Elle Woods in the 2001 comedy Legally Blonde (2001). The movie was huge box-office smash and established Reese as one of the top female draws in Hollywood. The next year, she scored a follow-up hit with Sweet Home Alabama (2002) which went on to gross over $100 million dollars at the box office. In 2006, she took home the best actress Oscar for her role as June Carter Cash in the Johnny Cash biopic Walk the Line (2005). In the late 2000s and early 2010s, Reese continued to star in more romantic comedies such as Tout... sauf en famille (2008) and How Do You Know (2010). In December 2010, she received a star on the Hollywood Walk of Fame. In the year 2014, she produced both Gone Girl (2014) and Wild (2014) for which she got nominated for best actress Oscar again for her role as Cheryl Strayed Off the screen, she was married to Ryan Phillippe from 1999 to 2007. They met at her 21st birthday party and subsequently worked together in Cruel Intentions (1999). They have two children: a daughter, Ava Elizabeth (born 9 September 1999) and a son, Deacon (born 23 October 2003). In March 2011, Reese remarried talent agent Jim Toth. She gave birth to a second son, Tennessee (born 27 September 2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDcxMDA5Ml5BMl5BanBnXkFtZTgwNDM1NTU5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000702","name":"Reese Witherspoon","idIMDB":"nm0000702"},"actorId":"nm0000702","character":"Elizabeth","urlCharacter":"http://www.imdb.com/character/ch0115159","main":true},{"actorName":"Mark Ruffalo","urlProfile":"http://www.imdb.com/name/nm0749263","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQyNzMzZTMtYjlkNS00YzFhLWFhMTctY2M4YmQ1NmRhODBkXkEyXkFqcGdeQXVyNjcyNzgyOTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1967","placeOfBirth":" Kenosha, Wisconsin, USA","birthName":"Mark Alan Ruffalo","height":"5' 8\" (1.73 m)","bio":"Mark Ruffalo was born in Kenosha, Wisconsin, to Marie Rose (Hebert), a stylist and hairdresser, and Frank Lawrence Ruffalo, a construction painter. His father's ancestry is Italian, and his mother is of half French-Canadian and half Italian descent. Mark moved with his family to Virginia Beach, Virginia, where he lived out most of his teenage years. Following high school, Mark moved with his family to San Diego and soon migrated north, eventually settling in Los Angeles. He took classes at the Stella Adler Conservatory and subsequently co-founded the Orpheus Theatre Company, an Equity-Waiver establishment, where he worked in nearly every capacity. From acting, writing, directing and producing to running the lights and building sets while building his resume. Bartending for nearly nine years to make ends meet and ready to give it all up, a chance meeting and resulting collaboration with playwright/screenwriter Kenneth Lonergan changed everything. Ruffalo won NY success in Lonergan's play \"This Is Our Youth\", which led to the male lead in Lonergan's film You Can Count on Me (2000), playing the ne'er-do-well brother of Laura Linney. The performance drew rave reviews and invited comparisons to an early Marlon Brando. Notable roles in The Last Castle (2001), XX/XY (2002), and Windtalkers (2002) followed, although in 2002 Ruffalo was diagnosed with an acoustic neuroma, a type of brain tumor. Though the tumor was benign, the resulting surgery led to a period of partial facial paralysis, from which he fully recovered. In 2003, Ruffalo scored leading roles alongside two popular female stars, playing a police detective opposite Meg Ryan in In the Cut (2003) and the love interest of Gwyneth Paltrow in the comedy View from the Top (2003). Though both films were high-profile box office disappointments, Ruffalo went on to four notable (if highly disparate) films in 2004 - We Don't Live Here Anymore (2004), Eternal Sunshine of the Spotless Mind (2004), 13 Going on 30 (2004), and Collateral (2004) - which solidified his ability to be both a popular leading man and an acclaimed ensemble player in either comedy or drama. After 2004, Ruffalo was consistently at work, with leads in popular Hollywood films and independent productions that continued to solidify him as one of film's most consistently strong actors: Just Like Heaven (2005), Les fous du roi (2006), Zodiac (2007), Reservation Road (2007), and The Brothers Bloom (2008). In 2010 Ruffalo achieved something of a breakthrough, by directing the indie film Sympathy for Delicious (2010), which won him the Special Jury Prize at the Sundance Film Festival, and co-starring as the sperm-donor father to lesbian couple Annette Bening and Julianne Moore in The Kids Are All Right (2010). His role in the idiosyncratic domestic comedy/drama earned him Academy Award, Independent Spirit Award, Screen Actors Guild, and BAFTA nominations for Best Supporting Actor. High-profile roles in Martin Scorsese's Shutter Island (2010) and 'Kenneth Longeran''s long-delayed Margaret (2011) followed before Ruffalo's appearance as Dr. Bruce Banner, aka The Hulk, in Joss Whedon's blockbuster The Avengers (2012). Garnering highly positive reviews for a role in which actors Eric Bana and Edward Norton could not find success in previous films made Ruffalo a box office star in addition to a critically-acclaimed actor. He is expected to reprise the role in the upcoming 2015 sequel, and reunited with former co-star Gywneth Paltrow in the sex-addiction comedy-drama Thanks for Sharing (2012); Ruffalo also will take the lead in Ryan Murphy's adaptation of Larry Kramer's AIDS-drama play The Normal Heart (2014). Ruffalo has been married to actress Sunrise Coigney since 2000; the couple have three children, a son and two daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MjMwNjAzNF5BMl5BanBnXkFtZTcwMzkyNDg1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0749263","name":"Mark Ruffalo","idIMDB":"nm0749263"},"actorId":"nm0749263","character":"David","urlCharacter":"http://www.imdb.com/character/ch0115160","main":true},{"actorName":"Donal Logue","urlProfile":"http://www.imdb.com/name/nm0006610","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNzI1NjQxNl5BMl5BanBnXkFtZTcwMzE2MzI0Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1966","placeOfBirth":" Ottawa, Ontario, Canada","birthName":"Donal Francis Logue","height":"5' 11\" (1.8 m)","bio":"Donal Logue's versatility and talent makes him one of the most well respected and beloved actors today. Born in Ottawa, Canada, Logue moved all over the United States, from the Boston area as an infant to various towns on the Mexican border. He returned to Boston to attend Harvard University, where he majored in Intellectual History and discovered his love for the performing arts. While in college, he appeared in over thirty plays, worked for two summers in the American Repertory Theatre's Harvard/Radcliffe Summer Stock Company, and spent a short time doing theatre in England. After graduating, Logue joined the Cornerstone Theatre Company which developed community theatre in rural parts of the United States. From then on Logue dedicated himself to pursuing his passion for acting. In his 20 plus years in the industry, Logue has starred in films such as, The Tao of Steve, the story of a larger-than-life, philosophizing lothario, which debuted at the Sundance Film Festival, and won him a Special Jury Prize for Outstanding Performance. His other film credits include Sneakers, Gettysburg, Blade, Runaway Bride, Reindeer Games, The Million Dollar Hotel, Comic Book Villains with Michael Rapaport, Confidence, Just Like Heaven, and The Groomsmen with Ed Burns. Recently, Donal co-starred in Max Payne with Mark Wahlberg, as well as Charlie St. Cloud with Zac Ephron. He also appeared in Zodiac, directed by David Fincher, based on the Robert Graysmith books about the notorious Zodiac serial killer. Following the US release of Zodiac, he co-starred in Mark Steven Johnson's Ghost Rider with Nicolas Cage and Eva Mendes. Logue made his directorial debut with the independent film Tennis, Anyone?, which appeared at the US Comedy Arts Festival. He wrote, starred, and directed the film about two Hollywood has-beens who try and find meaning in their lives through a series of celebrity tennis tournaments. In television, Logue joined the cast of the NBC series \"LIFE\" about a former police officer who returns to the force after having been wrongly imprisoned for years. In 2007, he headlined the critically lauded ABC comedy \"The Knights of Prosperity\" in which a group of blue collar guys band together to plan a heist of Mick Jagger's New York City apartment. Prior to \"The Knights of Prosperity\" Logue starred in the Carsey-Warner produced show, \"Grounded for Life\" which aired for five seasons. He was also featured in a recurring role on \"ER\" as Sherry Stringfield's love interest. In 2010, Logue finished a critically acclaimed season on \"Terriers,\" a television series created by Ted Griffin and Shawn Ryan for FX. He begins production on the Marc Cherry pilot \"Hallelujah\" for ABC in March of 2011. Logue lives in Los Angeles and has two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNzI1NjQxNl5BMl5BanBnXkFtZTcwMzE2MzI0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006610","name":"Donal Logue","idIMDB":"nm0006610"},"actorId":"nm0006610","character":"Jack","urlCharacter":"http://www.imdb.com/character/ch0073961","main":true},{"actorName":"Dina Spybey-Waters","urlProfile":"http://www.imdb.com/name/nm0005457","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM0NjE1NzMzMF5BMl5BanBnXkFtZTgwMzQ3Mjc2MDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 August 1965","placeOfBirth":" Columbus, Ohio, USA","birthName":"Dina Louise Spybey","bio":"A petite, stage-trained blonde adept at portraying naive or off-center characters, Dina Spybey Waters first came to prominence in and won a Daytime Emmy Award for the leading role of an underage teenager in the fact-based HBO special, Lifestories: Families in Crisis: Public Law 106: The Becky Bell Story (1992). In 2000, she married director Mark Waters and eventually changed her professional name to reflect their union. The two collaborated on several projects, including Freaky Friday (2003) and HBO First Look: Just Like Heaven (2005). In the latter film, she delivered one of her best performances as Reese Witherspoon's protective, married-with-kids sister, veering adroitly between her trademark high-pitched comedic energy and convincing emotional moments. Waters earned a B.F.A. in Acting from Ohio State University and an M.F.A. from Rutgers University, before beginning her career on stage. She had appeared in numerous Broadway and off-Broadway plays, including Alan Ball's \"Five Women Wearing the Same Dress\", for which she earned a Theatre World Award for Outstanding New Talent, \"Blue Light\" and \"The Shawl\", both directed by Sidney Lumet, and \"The Iceman Cometh\", opposite Kevin Spacey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM0NjE1NzMzMF5BMl5BanBnXkFtZTgwMzQ3Mjc2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005457","name":"Dina Spybey-Waters","idIMDB":"nm0005457"},"actorId":"nm0005457","character":"Abby","urlCharacter":"http://www.imdb.com/character/ch0006084","main":true},{"actorName":"Ben Shenkman","urlProfile":"http://www.imdb.com/name/nm0791570","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc4Nzg4OTQ1NV5BMl5BanBnXkFtZTcwOTU4NDMwNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 September 1968","placeOfBirth":" New York City, New York, USA","height":"6' 1\" (1.85 m)","bio":"Ben Shenkman was born on September 26, 1968 in New York City, New York, USA. He is an actor, known for Pi (1998), Requiem for a Dream (2000) and Blue Valentine (2010). He has been married to Lauren Greilsheimer since September 17, 2005.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc4Nzg4OTQ1NV5BMl5BanBnXkFtZTcwOTU4NDMwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0791570","name":"Ben Shenkman","idIMDB":"nm0791570"},"actorId":"nm0791570","character":"Brett","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jon Heder","urlProfile":"http://www.imdb.com/name/nm1417647","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDA0MjY5NTA1OV5BMl5BanBnXkFtZTcwOTk3Mjg4Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1977","placeOfBirth":" Fort Collins, Colorado, USA","birthName":"Jonathan Joseph Heder","height":"6' 2\" (1.88 m)","bio":"Jon Heder was born on October 26, 1977 in Fort Collins, Colorado, USA as Jonathan Joseph Heder. He is an actor and producer, known for Napoleon Dynamite (2004), Blades of Glory (2007) and Surf's Up (2007). He has been married to Kirsten Heder since November 23, 2002. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDA0MjY5NTA1OV5BMl5BanBnXkFtZTcwOTk3Mjg4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1417647","name":"Jon Heder","idIMDB":"nm1417647"},"actorId":"nm1417647","character":"Darryl","urlCharacter":"http://www.imdb.com/character/ch0006072","main":true},{"actorName":"Ivana Milicevic","urlProfile":"http://www.imdb.com/name/nm0587431","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAwNjY5MzYwNl5BMl5BanBnXkFtZTcwNDc0MDk4OA@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1974","placeOfBirth":" Sarajevo, Bosnia and Herzegovina","height":"5' 9\" (1.75 m)","bio":"Ivana Milicevic was born on April 26, 1974, in Sarajevo, Bosnia (part of Yugoslavia at that time), into an ethnic Croatian family. She is the daughter of Tonka and Damir Milicevic, and has a younger brother, Tomo Milicevic. The family emigrated to the United States, and young Ivana Milicevic was raised in Michigan. She attended Athens High school in Troy, Michigan, and worked as a model during her school years. She became a naturalized citizen of the United States. In 1992, Milicevic graduated from high school and moved to Los Angeles in pursuit of an acting career. She was a struggling stand-up comedienne, trying to win over crowds with her stories of the modeling business. In 1996, she made her film debut under the name Ivana Marina with a one-line role as a Former Girlfriend of Tom Cruise in Jerry Maguire (1996). In 1997, she followed up with a guest role on NBC's Seinfeld (1989) and made guest appearances on several other television shows, including Royal Pains (2009) and playing the love interest of John Casey on Chuck (2007). She played bit parts in Vanilla Sky (2001) and Love Actually (2003), among her many other cameo appearances. Milicevic capitalized on her experience as a comedienne in a supporting role as Russian model Roxana Milla Slasnikova in the romantic comedy Head Over Heels (2001). She appeared as a lookalike of Uma Thurman opposite Ben Affleck, trying to fool him into thinking she is Uma, in Paycheck (2003). In a departure from her one-dimensional roles, Milicevic showed her dramatic talent in a supporting role as Milla Yugorsky in a dark and gritty drama Running Scared (2006). In 2006, she started a recurring role on the CBS TV series Love Monkey (2006). In 2006, Milicevic made a big step forward in her career appearing as Valenka, one of three Bond girls in Casino Royale (2006), for which she did most of her scenes on locations in Prague and in London. She resides in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAwNjY5MzYwNl5BMl5BanBnXkFtZTcwNDc0MDk4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0587431","name":"Ivana Milicevic","idIMDB":"nm0587431"},"actorId":"nm0587431","character":"Katrina","urlCharacter":"http://www.imdb.com/character/ch0006076","main":true},{"actorName":"Caroline Aaron","urlProfile":"http://www.imdb.com/name/nm0000715","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzkyNTYxOF5BMl5BanBnXkFtZTcwNjE1OTI0Mw@@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 August 1952","placeOfBirth":" Richmond, Virginia, USA","birthName":"Caroline Sidney Abady","bio":"Caroline Aaron was born August 7, 1952 in Richmond, Virgnia. She attended American University in Washington, D.C., and studied performing arts. She made her debut film appearance in Robert Altman's Come Back to the 5 & Dime, Jimmy Dean, Jimmy Dean (1982). Since her debut in film, Caroline has made several appearances in both television and film.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzkyNTYxOF5BMl5BanBnXkFtZTcwNjE1OTI0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000715","name":"Caroline Aaron","idIMDB":"nm0000715"},"actorId":"nm0000715","character":"Grace","urlCharacter":"http://www.imdb.com/character/ch0073954","main":true},{"actorName":"Rosalind Chao","urlProfile":"http://www.imdb.com/name/nm0001034","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzYyMDc0ODc4MF5BMl5BanBnXkFtZTcwMDY3NTExOA@@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 September 1957","placeOfBirth":" Anaheim, California, USA","birthName":"Jialíng Zhào","height":"5' 6\" (1.68 m)","bio":"Rosalind Chao was born on September 23, 1957 in Anaheim, California, USA as Jialíng Zhào. She is an actress, known for What Dreams May Come (1998), I Am Sam (2001) and Freaky Friday (2003). She has been married to Simon Templeman since 1989. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzYyMDc0ODc4MF5BMl5BanBnXkFtZTcwMDY3NTExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001034","name":"Rosalind Chao","idIMDB":"nm0001034"},"actorId":"nm0001034","character":"Fran","urlCharacter":"http://www.imdb.com/character/ch0006083","main":true},{"actorName":"Ron Canada","urlProfile":"http://www.imdb.com/name/nm0133474","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNDc2ODQ0NF5BMl5BanBnXkFtZTgwNDUwMTgxMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 May 1949","placeOfBirth":" New York City, New York, USA","height":"5' 10\" (1.78 m)","bio":"Ron Canada was born on May 3, 1949 in New York City, New York, USA. He is an actor and producer, known for Wedding Crashers (2005), National Treasure (2004) and Cinderella Man (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNDc2ODQ0NF5BMl5BanBnXkFtZTgwNDUwMTgxMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0133474","name":"Ron Canada","idIMDB":"nm0133474"},"actorId":"nm0133474","character":"Dr. Walsh","urlCharacter":"http://www.imdb.com/character/ch0073955","main":true},{"actorName":"Willie Garson","urlProfile":"http://www.imdb.com/name/nm0308606","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0ODc4Mzg5MF5BMl5BanBnXkFtZTcwODc5OTM0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1964","placeOfBirth":" Highland Park, New Jersey, USA","birthName":"William Garson Paszamant","height":"5' 8\" (1.73 m)","bio":"Willie Garson was born on February 20, 1964 in Highland Park, New Jersey, USA as William Garson Paszamant. He is an actor and director, known for White Collar (2009), Groundhog Day (1993) and Being John Malkovich (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0ODc4Mzg5MF5BMl5BanBnXkFtZTcwODc5OTM0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0308606","name":"Willie Garson","idIMDB":"nm0308606"},"actorId":"nm0308606","character":"Maitre D'","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gabrielle Made","urlProfile":"http://www.imdb.com/name/nm0268124","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxMjk3NjE2OV5BMl5BanBnXkFtZTgwNDA3NjMxODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Ms. Made' is a Juilliard Graduate, with a range of experience in television, in motion pictures and on the New York stage, including performing Off-Broadway and On Broadway in the productions of The Miracle, Have Little, Have Much and Measure for Measure as \"Juliet\" at NYC's Lincoln Center, respectively. With both contemporary and classical theatre under her belt, Ms. Made' has played opposite television's elite on \"How to Get Away with Murder,\" \"Criminal Minds\" and on Amazon in \"Goliath,\" in addition to \"Harry's Law\" and \"24\" in recurring roles. Fluent in Spanish, Ms. Made' can be a chameleon and has played ethnically ambiguous roles including characters that are Middle Eastern, South American, Dominican, African American, African Carribean. Her agility comes from years in dance training-modern and tap, and music, with the added experience in stage combat. Sensitive, straight forward and focused, Ms. Made' is making her mark. Huge TV campaigns include Eye Love; Coast to Coast for Theatrical and VO, BBR for Commercials in LA and in NYC, Abrams Artists for On Camera and VO. Managed by More Zap across the board.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxMjk3NjE2OV5BMl5BanBnXkFtZTgwNDA3NjMxODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0268124","name":"Gabrielle Made","idIMDB":"nm0268124"},"actorId":"nm0268124","character":"Nurse Maria","urlCharacter":"http://www.imdb.com/character/ch0006095","main":true},{"actorName":"William Caploe","urlProfile":"http://www.imdb.com/name/nm1173656","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNjk1NDIyNV5BMl5BanBnXkFtZTgwNzM4OTcwMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Bill has always been an inspirational and one-of-a-kind figure. He grew up in a small bay area town in California called Castro Valley. He was one of three adopted children of George and Patricia Caploe. He and his siblings were introduced to the performing arts at a young age and willing fell into them. He played in band and orchestra in high school and enjoyed reading lots of science fiction. After graduating high school, he started acting in theater productions at Chabot College in Hayward CA. He later moved to San Francisco where he continued acting in many local productions and completed the 10 week summer congress at the renowned American Conservatory Theater. In 1992 he left California and played a number of key roles in many theater productions in Chicago. There, he met many friends that he has kept in touch with over the years. He enjoyed living away from the coast but eventually was drawn back. He moved to Los Angeles where he found a role in a television movie and a few parts in some major films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNjk1NDIyNV5BMl5BanBnXkFtZTgwNzM4OTcwMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1173656","name":"William Caploe","nicknames":["Billiam","Billy Boy"],"idIMDB":"nm1173656"},"actorId":"nm1173656","character":"Nurse Bill","urlCharacter":"http://www.imdb.com/character/ch0073956","main":true},{"actorName":"Shulie Cowen","urlProfile":"http://www.imdb.com/name/nm0184736","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNjY4MTcyMV5BMl5BanBnXkFtZTgwMDExMTYyOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 January 1969","placeOfBirth":" Evanston, Illinois, USA","bio":"Shulie Cowen was born on January 4, 1969 in Evanston, Illinois, USA. She is an actress and producer, known for 2 Broke Girls (2011), You Don't Mess with the Zohan (2008) and How I Met Your Mother (2005). She has been married to Kai Narezo since June 12, 2005.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNjY4MTcyMV5BMl5BanBnXkFtZTgwMDExMTYyOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0184736","name":"Shulie Cowen","idIMDB":"nm0184736"},"actorId":"nm0184736","character":"Nurse Jenny","urlCharacter":"http://www.imdb.com/character/ch0073957","main":true},{"actorName":"Billy Beck","urlProfile":"http://www.imdb.com/name/nm0065084","urlPhoto":"","biography":{"dateOfBirth":"26 May 1920","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Frank Billerbeck","bio":"Billy Beck was born on May 26, 1920 in Philadelphia, Pennsylvania, USA as Frank Billerbeck. He was an actor, known for Just Like Heaven (2005), Near Dark (1987) and House (1985). He died on June 29, 2011 in Glendale, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0065084","name":"Billy Beck","idIMDB":"nm0065084"},"actorId":"nm0065084","character":"Mr. Clarke","urlCharacter":"http://www.imdb.com/character/ch0073958","main":true}],"seasons":[],"idIMDB":"tt0425123","urlIMDB":"http://www.imdb.com/title/tt0425123","business":{"budget":{"money":"$58,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$16,408,718","country":"USA","day":"18","month":"09","year":"2005","remarks":"3,508 Screens"},{"money":"£1,201,381","country":"UK","day":"01","month":"01","year":"2006","remarks":"298 Screens"},{"money":"ARS 37,229","country":"Argentina","day":"03","month":"01","year":"2006","remarks":"30 Screens"},{"money":null,"country":null,"day":"01","month":"12","year":"2005","remarks":"14 Screens"},{"money":"€117,584","country":"Netherlands","day":"11","month":"12","year":"2005","remarks":"57 Screens"}],"gross":[{"money":"$48,318,130","country":"USA","day":"05","month":"03","year":"2006","remarks":""},{"money":"$48,291,624","country":"USA","day":"27","month":"11","year":"2005","remarks":""},{"money":"$48,120,780","country":"USA","day":"20","month":"11","year":"2005","remarks":""},{"money":"$47,957,366","country":"USA","day":"13","month":"11","year":"2005","remarks":""},{"money":"$47,832,640","country":"USA","day":"06","month":"11","year":"2005","remarks":""},{"money":"$47,636,113","country":"USA","day":"30","month":"10","year":"2005","remarks":""},{"money":"$47,295,484","country":"USA","day":"23","month":"10","year":"2005","remarks":""},{"money":"$46,274,251","country":"USA","day":"16","month":"10","year":"2005","remarks":""},{"money":"$43,621,756","country":"USA","day":"09","month":"10","year":"2005","remarks":""},{"money":"$38,424,283","country":"USA","day":"02","month":"10","year":"2005","remarks":""},{"money":"$29,818,607","country":"USA","day":"25","month":"09","year":"2005","remarks":""},{"money":"$16,408,718","country":"USA","day":"18","month":"09","year":"2005","remarks":""},{"money":"£5,054,262","country":"UK","day":"22","month":"01","year":"2006","remarks":""},{"money":"£4,537,254","country":"UK","day":"15","month":"01","year":"2006","remarks":""},{"money":"£3,506,691","country":"UK","day":"08","month":"01","year":"2006","remarks":""},{"money":"£1,201,381","country":"UK","day":"01","month":"01","year":"2006","remarks":""},{"money":"$50,758,439","country":"Worldwide","day":"05","month":"03","year":"2006","remarks":"except USA"},{"money":"$99,076,569","country":"Worldwide","day":"05","month":"03","year":"2006","remarks":""},{"money":"ARS 122,085","country":"Argentina","day":"10","month":"01","year":"2006","remarks":""},{"money":"ARS 37,229","country":"Argentina","day":"03","month":"01","year":"2006","remarks":""},{"money":null,"country":null,"day":"15","month":"12","year":"2005","remarks":""},{"money":null,"country":null,"day":"08","month":"12","year":"2005","remarks":""},{"money":null,"country":null,"day":"01","month":"12","year":"2005","remarks":""},{"money":"€141,534","country":"Netherlands","day":"11","month":"12","year":"2005","remarks":""}],"weekendGross":[{"money":"$97,661","country":"USA","day":"27","month":"11","year":"2005","remarks":"284 Screens"},{"money":"$143,401","country":"USA","day":"20","month":"11","year":"2005","remarks":"284 Screens"},{"money":"$89,057","country":"USA","day":"13","month":"11","year":"2005","remarks":"145 Screens"},{"money":"$130,998","country":"USA","day":"06","month":"11","year":"2005","remarks":"207 Screens"},{"money":"$192,346","country":"USA","day":"30","month":"10","year":"2005","remarks":"313 Screens"},{"money":"$568,220","country":"USA","day":"23","month":"10","year":"2005","remarks":"642 Screens"},{"money":"$1,499,811","country":"USA","day":"16","month":"10","year":"2005","remarks":"1,468 Screens"},{"money":"$3,453,588","country":"USA","day":"09","month":"10","year":"2005","remarks":"2,307 Screens"},{"money":"$6,128,180","country":"USA","day":"02","month":"10","year":"2005","remarks":"3,543 Screens"},{"money":"$9,621,591","country":"USA","day":"25","month":"09","year":"2005","remarks":"3,509 Screens"},{"money":"$16,408,718","country":"USA","day":"18","month":"09","year":"2005","remarks":"3,508 Screens"},{"money":"£266,663","country":"UK","day":"22","month":"01","year":"2006","remarks":"239 Screens"},{"money":"£619,330","country":"UK","day":"15","month":"01","year":"2006","remarks":"294 Screens"},{"money":"£934,650","country":"UK","day":"08","month":"01","year":"2006","remarks":"301 Screens"},{"money":"£1,201,381","country":"UK","day":"01","month":"01","year":"2006","remarks":"298 Screens"},{"money":"ARS 46,882","country":"Argentina","day":"10","month":"01","year":"2006","remarks":"30 Screens"},{"money":"ARS 37,229","country":"Argentina","day":"03","month":"01","year":"2006","remarks":"30 Screens"},{"money":"€117,584","country":"Netherlands","day":"11","month":"12","year":"2005","remarks":"57 Screens"}],"admissions":[{"money":"6,014 (Czech","country":"Republic","day":"15","month":"12","year":"2005","remarks":""},{"money":"4,312 (Czech","country":"Republic","day":"08","month":"12","year":"2005","remarks":""},{"money":"1,875 (Czech","country":"Republic","day":"01","month":"12","year":"2005","remarks":""},{"money":"475,308","country":"Germany","day":"25","month":"12","year":"2005","remarks":""},{"money":"151,568","country":"Germany","day":"04","month":"12","year":"2005","remarks":""},{"money":"25,503","country":"Switzerland","day":"14","month":"12","year":"2005","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"12","month":"11","year":"2004","remarks":null},null],"copyrightHolder":"Copyright © 2005 DreamWorks LLC"},"technical":{"runtime":["1 hr 35 min (95 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Panaflex Millennium XL2, Panavision Primo Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm (Kodak Vision 2383)"]},"rating":"6.7","metascore":"47","filmingLocations":[{"location":"Abandoned Planet, 518 Valencia St, San Francisco, California, USA"}],"rated":"PG-13","awards":[{"award":"Teen Choice Awards 2006","titlesAwards":[{"titleAwardOutcome":"Won Teen Choice Award","categories":[{"category":"Movies - Choice Chick Flick","names":[]}]},{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Movies - Choice Actor: Comedy","names":[{"name":"Jon Heder","id":"nm1417647","role":null},{"name":"The Benchwarmers","id":"tt0437863","role":null}]}]}]}],"votes":"85,594","type":"Movie","companyCreditsSimple":[{"idCompany":"co0040938","name":"DreamWorks"},{"idCompany":"co0108321","name":"Parkes+MacDonald Image Nation"}],"keywords":{"keywords":["apartment","spirit","architect","doctor","coma","car accident","workaholic","hospital","blind date","drink","fate","life support","hairy chest","bare chested male","supernatural power","product placement","mansion","race against time","tank top","male rear nudity","female doctor","photograph","waking up from a coma","montage","elevator","psychiatrist","screwball","transamerica pyramid","bench","chopping knife","reference to little orphan annie","tea party","tattoo","truck","trolley","old man","throwing a drink on someone","saving a life","husband wife relationship","underwear","coffee","bookstore clerk","male nudity","women's bathroom","cell phone","candle","friend","wind","subletting an apartment","rain","daydream","thong","cookie","kiss","guitar player","guitar","drinking","flashback","estate","flashing","scar","park","singing","musician","aura","ritual","singer","rite","sidewalk cafe","apparition","mouth to mouth resuscitation","punched in the face","meat cleaver","landscaping","cerebral hemorrhage","brother sister relationship","bed ridden","dry cleaners","watching tv","golden gate bridge","doctor patient relationship","girl","injection","x ray","mother daughter relationship","surgical stitches","hypodermic needle","ambulance","bare butt","nudity","patient","emergency","nurse","dream","bodily possession","snowglobe","soul mate","destiny","psychic","road accident","afterlife","loss of wife","catholic priest","shower","san francisco california","rooftop","refrigerator","out of body experience","key","friendship","flirting","dry cleaning","bar","widower","sister sister relationship","security guard","secret","rooftop garden","restaurant","real estate agent","aunt niece relationship","neighbor","loneliness","ghostbuster","flyer","first aid","smoke alarm","exorcism","drunkenness","priest","holy water","garden","bookstore","title based on song","independent film","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:10:32"}}