{"data":{"movies":[{"title":"Deja Vu","originalTitle":"","year":"2006","releaseDate":"20061122","directors":[{"name":"Tony Scott","id":"nm0001716"}],"writers":[{"name":"Bill Marsilii","id":"nm1319490"},{"name":"Terry Rossio","id":"nm0744429"}],"runtime":"126 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWUyNzk1OTEtODhlZC00NGMwLTk5MWMtZGY0YTIwMmY0MjFmXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1.jpg","countries":["USA","UK"],"languages":["English"],"genres":["Action","Sci-Fi","Thriller"],"plot":"A ferry filled with crewmen from the USS Nimitz and their families was blown up in New Orleans on Mardi Gras. BATF Doug Carlin is brought in to assist in the massive investigation, and gets attached to an experimental FBI surveillance unit, one that uses spacefolding technology to directly look back a little over four days into the past. While tracking down the bomber, Carlin gets an idea in his head: could they use the device to actually travel back in time and not only prevent the bombing but also the murder of a local woman whose truck was used in the bombing?","simplePlot":"After a ferry is bombed in New Orleans, an A.T.F. agent joins a unique investigation using experimental surveillance technology to find the bomber, but soon finds himself becoming obsessed with one of the victims.","actors":[{"actorName":"Denzel Washington","urlProfile":"http://www.imdb.com/name/nm0000243","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDU2Mzc3MV5BMl5BanBnXkFtZTcwNjAwNTE5OQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1954","placeOfBirth":" Mount Vernon, New York, USA","birthName":"Denzel Hayes Washington Jr.","height":"6' 1\" (1.85 m)","bio":"Denzel Washington is an American actor and filmmaker. He has received three Golden Globe awards, a Tony Award, and two Academy Awards: Best Supporting Actor for the historical war drama film Glory (1989) and Best Actor for his role as a corrupt cop in the crime thriller Training Day (2001). Denzel Hayes Washington, Jr. was born on December 28, 1954 in Mount Vernon, New York. He is the middle of three children of a beautician mother, Lennis (Lowe), from Georgia, and a Pentecostal minister father, Denzel Washington, Sr., from Virginia. After graduating from high school, Denzel enrolled at Fordham University, intent on a career in journalism. However, he caught the acting bug while appearing in student drama productions and, upon graduation, he moved to San Francisco and enrolled at the American Conservatory Theater. He left A.C.T. after only one year to seek work as an actor. His first paid acting role was in a summer stock theater stage production in St. Mary's City, Maryland. The play was \"Wings of the Morning\", which is about the founding of the colony of Maryland (now the state of Maryland) and the early days of the Maryland colonial assembly (a legislative body). He played the part of a real historical character, Mathias Da Sousa, although much of the dialogue was created. Afterwards he began to pursue screen roles in earnest. With his acting versatility and powerful sexual presence, he had no difficulty finding work in numerous television productions. He made his first big screen appearance in Carbon Copy (1981) with George Segal. Through the 1980s, he worked in both movies and television and was chosen for the plum role of Dr. Philip Chandler in NBC's hit medical series St. Elsewhere (1982), a role that he would play for six years. In 1989, his film career began to take precedence when he won the Oscar for Best Supporting Actor for his portrayal of Tripp, the runaway slave in Edward Zwick's powerful historical masterpiece Glory (1989). Washington has received much critical acclaim for his film work since the 1990s, including his portrayals of real-life figures such as South African anti-apartheid activist Steve Biko in Cry Freedom (1987), Muslim minister and human rights activist Malcolm X in Malcolm X (1992), boxer Rubin \"Hurricane\" Carter in The Hurricane (1999), football coach Herman Boone in Remember the Titans (2000), poet and educator Melvin B. Tolson in The Great Debaters (2007), and drug kingpin Frank Lucas in American Gangster (2007). Malcolm X and The Hurricane garnered him Oscar nominations for Best Actor, before he finally won that statuette in 2002 for his lead role in Training Day (2001). Through the 1990s, Denzel also co-starred in such big budget productions as The Pelican Brief (1993), Philadelphia (1993), Crimson Tide (1995), The Preacher's Wife (1996), and Courage Under Fire (1996), a role for which he was paid $10 million. He continued to define his onscreen persona as the tough, no-nonsense hero through the 2000s in films like Out of Time (2003), Man on Fire (2004), Inside Man (2006), and The Taking of Pelham 123 (2009). Cerebral and meticulous in his film work, he made his debut as a director with Antwone Fisher (2002); he also directed The Great Debaters (2007) and Fences (2016). In 2010, Washington headlined The Book of Eli (2010), a post-Apocalyptic drama. Later that year, he starred as a veteran railroad engineer in the action film Unstoppable (2010), about an unmanned, half-mile-long runaway freight train carrying dangerous cargo. The film was his fifth and final collaboration with director Tony Scott, following Crimson Tide (1995), Man on Fire (2004), Déjà Vu (2006) and The Taking of Pelham 1 2 3. He has also been a featured actor in the films produced by Jerry Bruckheimer and has been a frequent collaborator of director Spike Lee. In 2012, Washington starred in Flight (2012), for which he was nominated for an Academy Award for Best Actor. He co-starred with Ryan Reynolds in Sécurité rapprochée (2012), and prepared for his role by subjecting himself to a torture session that included waterboarding. In 2013, Washington starred in 2 Guns (2013), alongside Mark Walberg. In 2014, he starred in The Equalizer (2014), an action thriller film directed by Antoine Fuqua and written by Richard Wenk, based on the television series of same name starring Edward Woodward. During this time period, he also took on the role of producer for some of his films, including The Book of Eli and Safe House. In 2016, he was selected as the recipient for the Cecil B. DeMille Lifetime Achievement Award at the 73rd Golden Globe Awards. He lives in Los Angeles, California with his wife, Pauletta Washington, and their four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDU2Mzc3MV5BMl5BanBnXkFtZTcwNjAwNTE5OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000243","name":"Denzel Washington","nicknames":["D"],"idIMDB":"nm0000243"},"actorId":"nm0000243","character":"Doug Carlin","urlCharacter":"http://www.imdb.com/character/ch0398760","main":true},{"actorName":"Paula Patton","urlProfile":"http://www.imdb.com/name/nm1745736","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTY2MzczMl5BMl5BanBnXkFtZTcwNjEzNTUxOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 December 1975","placeOfBirth":" Los Angeles, California, USA","birthName":"Paula Maxine Patton","height":"5' 7¼\" (1.71 m)","bio":"Paula Patton was born in Los Angeles, California, to Joyce (Vanraden) and Charles Patton. Her father is African-American and her mother, who is caucasian, has German, English, and Dutch ancestry. Her family lived across the street from the 20th Century Fox lot when she was growing up and she was a fan of films from her earliest years. Her mother, who also appreciated good films, was a schoolteacher, and her father was a lawyer. Paula claims that as a girl she would escape by \"pretending to be someone else\" so it was not a surprise that she acted in high school plays at Hamilton Magnet Arts High School. Her favorite role was that of \"Abigail\" in \"The Crucible\". However, she went on to study film at the University of Southern California in a summer program, and won a 3-month assignment making documentaries for PBS. This led to her working as a production assistant for TV documentaries, and also for Howie Mandel's talk show. She progressed to actually producing documentary segments for Medical Diaries (2000) airing on Discovery Health Channel. Paula now professes that she liked what she was doing, but her dream remained the same as when she was small so she took acting lessons and shifted gears to become a performer. She was almost immediately successful and, within three years, had played parts in major features, Hitch (2005) and Idlewild (2006) and the female lead in Deja Vu (2006) opposite Denzel Washington.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTY2MzczMl5BMl5BanBnXkFtZTcwNjEzNTUxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1745736","name":"Paula Patton","idIMDB":"nm1745736"},"actorId":"nm1745736","character":"Claire Kuchever","urlCharacter":"http://www.imdb.com/character/ch0010027","main":true},{"actorName":"Val Kilmer","urlProfile":"http://www.imdb.com/name/nm0000174","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3ODIzMDA5Ml5BMl5BanBnXkFtZTcwNDY0NTU4Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1959","placeOfBirth":" Los Angeles, California, USA","birthName":"Val Edward Kilmer","height":"5' 11¾\" (1.82 m)","bio":"Val Kilmer was born in Los Angeles, California, to Gladys Swanette (Ekstadt) and Eugene Dorris Kilmer, who was a real estate developer and aerospace equipment distributor. His mother, born in Indiana, was from a Swedish family, and his father was from Texas. Val studied at Hollywood's Professional's School and, in his teens, entered Juilliard's drama program. His professional acting career began on stage, and he still participates in theater; he played Hamlet at the 1988 Colorado Shakespeare Festival. His film debut was in the 1984 spoof Top Secret! (1984), wherein he starred as blond rock idol Nick Rivers. He was in a number of films throughout the 1980s, including the 1986 smash Top Gun (1986). Despite his obvious talent and range, it wasn't until his astonishingly believable performance as Jim Morrison in Oliver Stone's The Doors (1991) that the world sat up and took notice. Kilmer again put his good baritone to use in the movie, performing all of the concert pieces. Since then, he has played two more American legends, Elvis Presley in True Romance (1993) and Doc Holliday in Tombstone (1993). In July 1994, it was announced that Kilmer would be taking over the role of Batman/Bruce Wayne from Michael Keaton.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3ODIzMDA5Ml5BMl5BanBnXkFtZTcwNDY0NTU4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000174","name":"Val Kilmer","idIMDB":"nm0000174"},"actorId":"nm0000174","character":"Agent Pryzwarra","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim Caviezel","urlProfile":"http://www.imdb.com/name/nm0001029","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2Nzk0MTY4MV5BMl5BanBnXkFtZTcwMjA3NTY5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 September 1968","placeOfBirth":" Mount Vernon, Washington, USA","birthName":"James Patrick Caviezel","height":"6' 2\" (1.88 m)","bio":"James Patrick Caviezel was born on September 26, 1968 in Mount Vernon, Washington. He was one of five children born to Margaret (Lavery), a former stage actress, and James Caviezel, a chiropractor. The Caviezels are a closely knit Catholic family. He is of Irish (mother) and Swiss and Slovak-Romansh (father) descent; the surname, \"Caviezel\", is Romansh. As a youngster, Jim was described as being \"very intense.\" His two main interests growing up were sports and religion. He was athletically gifted on the basketball court and dreamed of someday playing in the N.B.A. He was also instilled with Christianity at a very young age, attending Church regularly with his family. In 1984, he went to Mount Vernon High School but transferred to O'Dea High School after two years. The following spring, he transferred again to Burien Kennedy High School in Burien, Washington where he was a star on the basketball team and graduated in 1987. While at O'Dea and Kennedy, he stayed with family friends. Following high school Jim enrolled at Bellevue Community College where he again played on the basketball team. A foot injury in his sophomore season put an end to Jim's basketball career and his dreams of playing in the N.B.A. Shortly after this, he turned his focus toward acting. In 1990, he auditioned for a part in the independent film My Own Private Idaho (1991). He won a very small role as a foreign airline clerk after he told casting agents that he was a recent Italian immigrant. The following year, Jim moved to Los Angeles where he worked as a waiter between auditions. He landed small roles in Diggstown (1992) and Wyatt Earp (1994) and guest starring roles on The Wonder Years (1988) and Murder, She Wrote (1984). He continued to go relatively unnoticed in small roles and even thought about quitting acting until 1998 when he received critical recognition for his role as idealist Private Witt in The Thin Red Line (1998). The following year, he gained further recognition with roles in Ride with the Devil (1999) and Frequency (2000). In 2001, his role as Jennifer Lopez's love interest in Angel Eyes (2001) helped to establish him as a versatile actor and leading man. It wasn't until 2002 that Jim made his strong religious beliefs known. While filming High Crimes (2002), he refused to do any love scenes with on-screen wife Ashley Judd because it conflicted with his strong Catholic faith. It was also around this time when he was chosen by Mel Gibson to star as Jesus Christ in The Passion of the Christ (2004). The movie made headlines and broke box-office records around the world, becoming one of the highest grossing films of all time. Although the movie dealt with controversial matters, Caviezel's performance was acclaimed by both critics and viewers. Jim's next big role would be on the small screen. In 2011, he landed the lead role in the CBS crime drama Person of Interest (2011). The show instantly clicked with audiences, becoming one of the highest rated shows on television. From an outcast actor to a respected film star to a television star, James Caviezel is continuing to give his best to play challenging roles. Off screen, Jim lives with his wife, Kerri, a school teacher whom he met on a blind date in 1993 and married in 1996, and their adopted children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2Nzk0MTY4MV5BMl5BanBnXkFtZTcwMjA3NTY5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001029","name":"Jim Caviezel","nicknames":["Jimmy","JC"],"idIMDB":"nm0001029"},"actorId":"nm0001029","character":"Carroll Oerstadt","urlCharacter":"http://www.imdb.com/character/ch0010026","main":true},{"actorName":"Adam Goldberg","urlProfile":"http://www.imdb.com/name/nm0004965","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMjM2NTA2MF5BMl5BanBnXkFtZTgwNjUxMjM1MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 October 1970","placeOfBirth":" Santa Monica, California, USA","birthName":"Adam Charles Goldberg","height":"5' 11\" (1.81 m)","bio":"An actor with a talent for mining the neuroses of his characters for both comedic and dramatic effect and a filmmaker adept at exploring the philosophical questions at the heart of the human experience, Adam Goldberg has solidified his position as a versatile and unique talent. Goldberg was born in Santa Monica, California, to Donna (Goebel) and Earl Goldberg. His father is of Ashkenazi Jewish descent (from Russia, Lithuania, and Romania), while Adam's mother is a lapsed Catholic who has German, Mexican, Irish, French, and English ancestry. Goldberg made his feature film debut in 1991 as Billy Crystal's younger brother-in-law in Mr. Saturday Night (1992). Additional film credits include Steven Spielberg's Saving Private Ryan (1998) with Tom Hanks, Ron Howard's Edtv (1999), Richard Linklater's ode to 1970s high school life, Dazed and Confused (1993) as well as Waking Life (2001), John Singleton's Higher Learning (1995), Gregory Widen's The Prophecy (1995) opposite Christopher Walken, and lent his voice to George Miller's Babe, le cochon dans la ville (1998). A familiar presence on television, Goldberg's TV credits include Marcus Nispel's made-for-television film Frankenstein (2004) opposite Parker Posey, guest-starring appearances on Law & Order: Criminal Intent (2001), The Practice (1997), Will & Grace (1998), and a popular recurring role on Friends (1994). Additional credits include Au-delà du réel - l'aventure continue (1995), ER (1994), and NYPD Blue (1993). Goldberg also appeared on the big screen in Donald Petrie's How to Lose a Guy in 10 Days (2003) with Matthew McConaughey and Kate Hudson, Jonathan Kesselman's send-up The Hebrew Hammer (2003), D.J. Caruso's drug noir The Salton Sea (2002) with Val Kilmer, and Ron Howard's Academy Award-winning film A Beautiful Mind (2001) with Russell Crowe. Goldberg co-wrote and directed the feature I Love Your Work (2003), which was produced through his production company. The film, starring Giovanni Ribisi, Franka Potente, Christina Ricci and Joshua Jackson, with a cameo by Elvis Costello, is about the gradual meltdown of a fictional movie star. Goldberg also composed the film's original music with The Flaming Lips' drummer Steven Drozd. Goldberg starred in FOX's comedy, Head Cases (2005) as Shultz, a lawyer suffering from a explosive disorder who insinuates himself into the life of a fellow lawyer (played by Chris O'Donnell) recovering from a nervous breakdown. The two eventually join forces to start a law firm both to take on the cases of underdog clients who need their help, but just as importantly to try to keep each other sane. As a filmmaker, Goldberg wrote, directed and starred in the \"neo-noir\", Scotch and Milk (1998), which made its debut in 1998 at the Los Angeles Independent Film Festival, and was featured on the Sundance Channel series \"10 Best Films You May Never Seen.\" In addition, Goldberg directed, co-edited, and produced the comic documentary short, Running with the Bulls (2003) for the Independent Film Channel.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMjM2NTA2MF5BMl5BanBnXkFtZTgwNjUxMjM1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004965","name":"Adam Goldberg","idIMDB":"nm0004965"},"actorId":"nm0004965","character":"Denny","urlCharacter":"http://www.imdb.com/character/ch0495671","main":true},{"actorName":"Elden Henson","urlProfile":"http://www.imdb.com/name/nm0711805","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNzczMjE2Ml5BMl5BanBnXkFtZTcwNzg3MzUzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 August 1977","placeOfBirth":" Rockville, Maryland, USA","birthName":"Elden Ryan Ratliff","height":"5' 9\" (1.75 m)","bio":"Elden Henson (formerly billed as Elden Ratliff and Elden Ryan Ratliff) got his start in the business at age two, as a baby model. By the time he was six, he was appearing in numerous commercials; by age ten, he was on his way to becoming a successful child actor. By the time he started high school, John Burroughs High School in Burbank, California, he got his big break, starring in the three The Mighty Ducks (1992) movies as enforcer Fulton Reed. From there, he went on to get rave reviews as Max Kane, the seemingly slow-witted giant in Miramax's The Mighty (1998). Elden has since starred in Idle Hands (1999), She's All That (1999), and Showtime's A Gift of Love: The Daniel Huffman Story (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNzczMjE2Ml5BMl5BanBnXkFtZTcwNzg3MzUzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0711805","name":"Elden Henson","idIMDB":"nm0711805"},"actorId":"nm0711805","character":"Gunnars","urlCharacter":"http://www.imdb.com/character/ch0184086","main":true},{"actorName":"Erika Alexander","urlProfile":"http://www.imdb.com/name/nm0004697","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGJiNzQxM2YtNTI3Mi00YjYwLThlOGYtNjIwZTlhMDliNTA5XkEyXkFqcGdeQXVyNzMzODA1MTA@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1969","placeOfBirth":" Winslow, Arizona, USA","birthName":"Erika Rose Alexander","bio":"Erika Alexander was born on November 19, 1969 in Winslow, Arizona, USA as Erika Rose Alexander. She is an actress and writer, known for Living Single (1993), Deja Vu (2006) and Get Out (2017). She has been married to Tony Puryear since September 27, 1997.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTAxODY0MTI4N15BMl5BanBnXkFtZTcwMTkzNTcyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004697","name":"Erika Alexander","idIMDB":"nm0004697"},"actorId":"nm0004697","character":"Shanti","urlCharacter":"http://www.imdb.com/character/ch0184087","main":true},{"actorName":"Bruce Greenwood","urlProfile":"http://www.imdb.com/name/nm0339304","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYwMDI5MDM1Nl5BMl5BanBnXkFtZTYwODUyNjc4._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 August 1956","placeOfBirth":" Noranda, Québec, Canada","birthName":"Stuart Bruce Greenwood","height":"6' 0½\" (1.84 m)","bio":"Bruce Greenwood was born on August 12, 1956 in Noranda, Québec, Canada as Stuart Bruce Greenwood. He is an actor and producer, known for Star Trek (2009), I, Robot (2004) and Star Trek Into Darkness (2013). He has been married to Susan Devlin since 1985. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYwMDI5MDM1Nl5BMl5BanBnXkFtZTYwODUyNjc4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0339304","name":"Bruce Greenwood","idIMDB":"nm0339304"},"actorId":"nm0339304","character":"Jack McCready","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rich Hutchman","urlProfile":"http://www.imdb.com/name/nm0404475","urlPhoto":"","biography":{"bio":"Rich Hutchman is an actor, known for Deja Vu (2006), Crazy, Stupid, Love. (2011) and The Island (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0404475","name":"Rich Hutchman","idIMDB":"nm0404475"},"actorId":"nm0404475","character":"Agent Stalhuth","urlCharacter":"http://www.imdb.com/character/ch0184089","main":true},{"actorName":"Matt Craven","urlProfile":"http://www.imdb.com/name/nm0002023","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MTkyMzk4OF5BMl5BanBnXkFtZTgwMDI4NDAzNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1956","placeOfBirth":" Port Colborne, Ontario, Canada","birthName":"Matthew John Crnkovich","height":"5' 10\" (1.78 m)","bio":"Canadian-born actor Matt Craven is among the most sought after character actors of film and television today, starring in such blockbuster critically acclaimed films as the Academy-Award-nominated \"Crimson Tide\" and \"A Few Good Men\" and SAG Award nominated \"X-Men: First Class.\" Craven has starred opposite great Hollywood actors such as Denzel Washington, Gene Hackman, Helen Mirren, Maggie Gyllenhaal, Ethan Hawke, James Gandolfini, and Michael Caine, to name a few, and was recently seen starring in the hit ABC science fiction drama series \"Resurrection\" as Fred Langston, sheriff of Arcadia, Missouri, a town that's turned upside down as deceased loved ones return after death. Craven can also be seen starring in Roland Emmerich's film \"Stonewall,\" which chronicles a young man's political awakening and coming of age leading up to the Stonewall Riots (set for 2015 release) and \"Unless,\" based on the novel of the same name, opposite Academy-Award-nominated Catherine Keener, also set for a 2015 release. Originally from Ontario, Canada, Craven did not catch the acting bug until later in his years. Craven's father died six weeks after his birth, and he ultimately dropped out of high school to help support his mother and family. He found himself working odd jobs such as driving trucks and working maintenance for electrical companies. It wasn't until Craven was about 20 years old that his love for acting sparked when he found an ad in the local newspaper announcing auditions for a local production of Dracula. Craven auditioned, landed the role of Jonathan Harker, and from then on, never looked back. He found his true passion. Craven's first feature film was opposite Bill Murray in \"Meatballs\" as Hardware, one of Tripper Harrison's (Murray) counselors-in-training at Camp North Star, a cut-rate summer camp. This hilarious comedy was the start of Craven's career, especially in the comedy world. During this time, Murray took Craven under his wing and immediately started teaching him the fundamentals of improve and how to create and mold a character. Craven's second major project, the live action short \"Bravery in the Field\" was nominated for an Academy Award. In the following years, Craven moved on to star in three different sitcom pilots opposite the likes of Alan Arkin, Richard Lewis, Annie Potts and Holland Taylor. Moving away from the comedy scene, Craven's first major dramatic break came when he was cast in the drama/horror/mystery cult favorite, \"Jacob's Ladder,\" which follows a haunted Vietnam war veteran as he attempts to discover his past while suffering from a severe case of dissociation. Craven starred as Michael, a chemist in the Army's chemical warfare division where he worked on a drug that was secretly given to the veteran's unit. This critically acclaimed film raised Craven's career to a whole new level, proving his versatility as an actor, and truly gave him a taste of Hollywood stardom. Craven has since starred in massively popular feature films including \"Public Enemies,\" \"Disturbia,\" \"Déjà vu,\" \"The Life of David Gale,\" \"The Statement,\" \"Indian Summer,\" \"K2\" and \"Tin Men.\" On the small screen, Craven has worked exclusively with Graham Yost on HBO's acclaimed award winning series, \"From the Earth to the Moon\", \"The Pacific\", and \"Boomtown.\" Most recently on \"Justified\", he also starred on TNT's \"Nuremberg\" and \"Kingfish: A Story of Huey P. Long\", Steven Spielberg's \"High Incident\" and opposite Jeff Goldblum on NBC's \"Raines\". Truly a man of many talents, Craven has also made a successful impact in theater as well, as his first off-Broadway play was the award winning \"Blue Window,\" which was ultimately picked up and filmed for American Playhouse. He also successfully brought one of his favorite Canadian plays, \"The Crackwalker\" to be produced at The Hudson Guild Theater in New York City, starring himself, a young Joe Mantello (\"Wicked\") and Frances Fisher (\"Titanic\"). Additionally, Craven starred in the critically acclaimed American premiere of the German playwright, Franz Xaver Kroetz's \"The Nest.\" Off the screen, Craven is a strong supporter of \"One Heart Source,\" an organization designed to empower at risk children through education in Africa. He is also an avid golfer and is ranked third by Golf Digest in Hollywood's Top 100 Golfers. He also enjoys gardening, cooking and woodworking, and, most of all, spending time with his wife of over 25 years, Emmy-Award-winning Make Up Artist Sally Sutton, and their two children, Nicholas and Josephine.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MTkyMzk4OF5BMl5BanBnXkFtZTgwMDI4NDAzNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002023","name":"Matt Craven","idIMDB":"nm0002023"},"actorId":"nm0002023","character":"Minuti","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Donna W. Scott","urlProfile":"http://www.imdb.com/name/nm0779072","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxOTAxNTU2MF5BMl5BanBnXkFtZTcwNDEzODQ3Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Donna Wilson","bio":"Donna W. Scott, a native of North Carolina, attended the University of North Carolina at Greensboro where she majored in dance and communication. At a young age, Donna began competing in beauty pageants, accumulating numerous titles and made her state proud when she was crowned Miss North Carolina, USA. At the same time, she became a favorite of advertising agencies and did numerous television commercials, making her film debut at 18 in Rich Hall's Vanishing America (1986). Moving to New York, Donna became a successful model and studied acting at HB Studios. Her life changed when she landed a role in the blockbuster film Days of Thunder (1990) starring Tom Cruise and Robert Duvall. She later married the director, Tony Scott. Donna's versatility as an actor is apparent with diverse roles in MGM's Get Shorty (1995), Dark Breed (1996), a comedic turn in Austin Powers: International Man of Mystery (1997), Enemy of the State (1998), Idle Hands (1999), the Indy film Beat Boys Beat Girls (2003), the action-thriller Domino (2005), and the upcoming Disney film Deja Vu (2006). On television, Donna had recurring roles as \"Tamara Van Zant\" on Nash Bridges (1996) and \"Lieutenant Grace\" on Soldier of Fortune, Inc. (1997). Television guest starring roles include CSI: Crime Scene Investigation (2000), Tracey Takes On... (1996) and The District (2000). Currently, she can be seen in The N's new teen-oriented drama South of Nowhere (2005). Donna works tirelessly for several charitable organizations and was delighted to lend her support to Sojourn Services for Battered Women and Break the Cycle by appearing in VDAY West LA's benefit production of Eve Ensler's The Vagina Monologues. Donna's greatest joy is being a mom to twin 6-year-old boys Max and Frank.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxOTAxNTU2MF5BMl5BanBnXkFtZTcwNDEzODQ3Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0779072","name":"Donna W. Scott","idIMDB":"nm0779072"},"actorId":"nm0779072","character":"Beth","urlCharacter":"http://www.imdb.com/character/ch0184091","main":true},{"actorName":"Elle Fanning","urlProfile":"http://www.imdb.com/name/nm1102577","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0ODA1MjY5M15BMl5BanBnXkFtZTcwNzcwMDYzOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1998","placeOfBirth":" Conyers, Georgia, USA","birthName":"Mary Elle Fanning","height":"5' 9\" (1.75 m)","bio":"Mary Elle Fanning was born on the 9th of April 1998 in Conyers, Georgia, USA, to Heather Joy (Arrington) and Steven J. Fanning. Her mother played professional tennis, and her father, now an electronics salesman, played minor league baseball. She is of German, Irish, English, French, and Channel Islander descent. Elle's ascent into stardom began when she was almost three years old, when she played the younger version of her sister, Dakota Fanning's, character Lucy in the drama film I Am Sam (2001). She then played younger Dakota again in Taken (2002) as Allie, age 3. But her first big independent movie without her sister was in 2003's Daddy Day Care (2003) as Jamie. She then had two guest appearances on Judging Amy (1999) and CSI: Miami (2002). Elle was becoming more successful and she got another role, in 2004's The Door in the Floor (2004) with Kim Basinger. Her career kept improving, as she had two movies in 2005, Because of Winn-Dixie (2005) and I Want Someone to Eat Cheese With (2006). She has since starred in a number of prominent films, including The Curious Case of Benjamin Button (2008), Super 8 (2011), We Bought a Zoo (2011), and Maleficent (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0ODA1MjY5M15BMl5BanBnXkFtZTcwNzcwMDYzOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1102577","name":"Elle Fanning","nicknames":["Elbow"],"idIMDB":"nm1102577"},"actorId":"nm1102577","character":"Abbey","urlCharacter":"http://www.imdb.com/character/ch0184088","main":true},{"actorName":"Brian Howe","urlProfile":"http://www.imdb.com/name/nm0397788","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjhhYWRmNGUtOTZkZi00MjI5LWJiZGItMmM0M2VkNTQ0MzRlL2ltYWdlXkEyXkFqcGdeQXVyMDAyODEwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Brian Howe is an actor, known for The Newsroom (2012), The Pursuit of Happyness (2006) and Westworld (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjhhYWRmNGUtOTZkZi00MjI5LWJiZGItMmM0M2VkNTQ0MzRlL2ltYWdlXkEyXkFqcGdeQXVyMDAyODEwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0397788","name":"Brian Howe","idIMDB":"nm0397788"},"actorId":"nm0397788","character":"Medical Examiner","urlCharacter":"http://www.imdb.com/character/ch0218908","main":true},{"actorName":"Enrique Castillo","urlProfile":"http://www.imdb.com/name/nm0145049","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTYxMzUxMzc2OV5BMl5BanBnXkFtZTcwODcwOTcyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1949","placeOfBirth":" Calexico, California, USA","height":"5' 10\" (1.78 m)","bio":"Enrique Castillo was nominated for a SAG Award for his stand-out role in Showtime's wicked series \"Weeds\" where he plays the lethal Cesar. He guest starred on the CBS hit show \"NCIS\" and \"Outlaw\" opposite Jimmy Smits; and on the HBO series \"Enlightened\". Most recently starred in the in the film \"Kill The Dictator\" which broke box office records in the Dominican Republic. His in a gut wrenching performance in Fanny Veliz's indie film \"Homebound\" has earned critical acclaim. He recent guest starred in TNT \"Major Crimes\" in June of 2014. Enrique is most recognized for his film role of Montana in Taylor Hackford \"Blood In Blood Out\" where he played the inspirational (albeit terrifying) leader of the Mexican prison gang. When the film was released, The New York Times singled out Mr. Castillos's performance in their review. \"Mr. Chapa, Mr. Bratt and Mr. Borrego are excellent, as are the members of the large supporting cast, notably Enrique Castillo, who appears as the leader of San Quentin's Chicanos.\" In Japan a film critic said of his performance of Montana \"He plays the role with the wisdom of Torquemada and strength of a Sandinista warrior\" An accomplished actor/writer/director, Enrique began his career with Luis Valdez's Teatro Campesino in 1969. As part of the Teatro, Enrique participated in workshops with English theater director Peter Brook's theater group which included now Academy Award winner Helen Mirren. In the early 70's Enrique traveled with the Teatro to Paris when they represented the U.S. at the World Theater Festival. In 1978 Enrique made the move to Hollywood and was cast in the hit play \"Zoot Suit\", also created and directed by Luis Valdez, where he played the lead role of Henry Reyna opposite Edward James Olmos. Since then he has appeared in over 50 television shows and feature films, working with such notable film directors as Tony Scott, (\"Déjà Vu\") Taylor Hackford, (\"Blood In-Blood Out\") Stephen Frears (\"The Hi-Lo Country\") Wim Wenders (\"The End of Violence\") Gregory Nava (\"My Family\" and \"El Norte\") Oliver Stone (\"Nixon\") and Tim Burton (\"Mars Attacks\"). Mr. Castillo was one of the founding member of The Latino Theater Company in the mid 80's, where he starred in a variety of the company's productions and was also was a writer on two of the company's plays, Stone Wedding and the multi-award-winning play August 29. In the mid 90's Enrique adapted and directed the award-winning play \"The Last Angry Brown Hat\", written by Alfredo Ramos which toured to rave reviews for over four years. He then wrote and directed \"Veteranos: A Legacy of Valor\", a theater piece honoring the military contributions by Latinos in America's defense which had two national tours to standing ovations and much critical acclaim. Veteranos was awarded a special recognition by the Hispanic Congressional Caucus at and received the prestigious Imagen Award for Best Live Theatrical Production in Los Angeles, CA. Enrique has also written various screenplays including \"Yo Solo\" (I Alone), \"The Cobra\", \"Valley of The Dead\", \"Deerdancer\" and the screen version of The Last Angry Brown Hat. Valley of The Dead, the crime suspense thriller has been recently optioned by Concrete Images. Enrique He is also Executive Producer of HOLA! LA the only English-language TV talk show hosted by Latinas airing on CBS2/KCAL9.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTYxMzUxMzc2OV5BMl5BanBnXkFtZTcwODcwOTcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0145049","name":"Enrique Castillo","nicknames":["Kiki"],"idIMDB":"nm0145049"},"actorId":"nm0145049","character":"Claire's Father","urlCharacter":"http://www.imdb.com/character/ch0218910","main":true},{"actorName":"Mark Phinney","urlProfile":"http://www.imdb.com/name/nm0681005","urlPhoto":"","biography":{"bio":"Mark Phinney is an actor and writer, known for Deja Vu (2006), Two Days (2003) and Fat (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0681005","name":"Mark Phinney","idIMDB":"nm0681005"},"actorId":"nm0681005","character":"Agent Donnelly","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0453467","urlIMDB":"http://www.imdb.com/title/tt0453467","business":{"budget":{"money":"$75,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$20,574,802","country":"USA","day":"24","month":"11","year":"2006","remarks":"3,108 Screens"},{"money":"£1,098,295","country":"UK","day":"17","month":"12","year":"2006","remarks":"362 Screens"},{"money":"€246,522","country":"Netherlands","day":"17","month":"12","year":"2006","remarks":"70 Screens"}],"gross":[{"money":"$64,038,616","country":"USA","day":"01","month":"03","year":"2007","remarks":""},{"money":"$64,034,835","country":"USA","day":"25","month":"02","year":"2007","remarks":""},{"money":"$64,011,699","country":"USA","day":"18","month":"02","year":"2007","remarks":""},{"money":"$63,944,632","country":"USA","day":"11","month":"02","year":"2007","remarks":""},{"money":"$63,824,876","country":"USA","day":"04","month":"02","year":"2007","remarks":""},{"money":"$63,651,455","country":"USA","day":"28","month":"01","year":"2007","remarks":""},{"money":"$63,372,710","country":"USA","day":"21","month":"01","year":"2007","remarks":""},{"money":"$63,020,139","country":"USA","day":"14","month":"01","year":"2007","remarks":""},{"money":"$62,526,422","country":"USA","day":"07","month":"01","year":"2007","remarks":""},{"money":"$61,851,185","country":"USA","day":"31","month":"12","year":"2006","remarks":""},{"money":"$60,162,620","country":"USA","day":"24","month":"12","year":"2006","remarks":""},{"money":"$57,748,399","country":"USA","day":"17","month":"12","year":"2006","remarks":""},{"money":"$52,995,929","country":"USA","day":"10","month":"12","year":"2006","remarks":""},{"money":"$44,007,448","country":"USA","day":"03","month":"12","year":"2006","remarks":""},{"money":"$28,649,398","country":"USA","day":"24","month":"11","year":"2006","remarks":""},{"money":"£4,948,886","country":"UK","day":"14","month":"01","year":"2007","remarks":""},{"money":"£4,582,262","country":"UK","day":"07","month":"01","year":"2007","remarks":""},{"money":"£3,544,518","country":"UK","day":"31","month":"12","year":"2006","remarks":""},{"money":"£2,353,141","country":"UK","day":"24","month":"12","year":"2006","remarks":""},{"money":"£1,098,295","country":"UK","day":"17","month":"12","year":"2006","remarks":""},{"money":"€272,266","country":"Netherlands","day":"17","month":"12","year":"2006","remarks":""}],"weekendGross":[{"money":"$14,375","country":"USA","day":"25","month":"02","year":"2007","remarks":"39 Screens"},{"money":"$34,988","country":"USA","day":"18","month":"02","year":"2007","remarks":"69 Screens"},{"money":"$78,251","country":"USA","day":"11","month":"02","year":"2007","remarks":"146 Screens"},{"money":"$116,259","country":"USA","day":"04","month":"02","year":"2007","remarks":"224 Screens"},{"money":"$181,511","country":"USA","day":"28","month":"01","year":"2007","remarks":"274 Screens"},{"money":"$260,482","country":"USA","day":"21","month":"01","year":"2007","remarks":"348 Screens"},{"money":"$384,056","country":"USA","day":"14","month":"01","year":"2007","remarks":"365 Screens"},{"money":"$335,518","country":"USA","day":"07","month":"01","year":"2007","remarks":""},{"money":"$1,053,984","country":"USA","day":"31","month":"12","year":"2006","remarks":"655 Screens"},{"money":"$1,043,787","country":"USA","day":"24","month":"12","year":"2006","remarks":""},{"money":"$2,975,356","country":"USA","day":"17","month":"12","year":"2006","remarks":"1,985 Screens"},{"money":"$6,019,672","country":"USA","day":"10","month":"12","year":"2006","remarks":""},{"money":"$10,947,752","country":"USA","day":"03","month":"12","year":"2006","remarks":"3,108 Screens"},{"money":"$20,574,802","country":"USA","day":"24","month":"11","year":"2006","remarks":"3,108 Screens"},{"money":"£181,985","country":"UK","day":"14","month":"01","year":"2007","remarks":"184 Screens"},{"money":"£413,887","country":"UK","day":"07","month":"01","year":"2007","remarks":"244 Screens"},{"money":"£602,214","country":"UK","day":"31","month":"12","year":"2006","remarks":"358 Screens"},{"money":"£554,957","country":"UK","day":"24","month":"12","year":"2006","remarks":"367 Screens"},{"money":"£1,098,295","country":"UK","day":"17","month":"12","year":"2006","remarks":"362 Screens"},{"money":"€246,522","country":"Netherlands","day":"17","month":"12","year":"2006","remarks":"70 Screens"}],"admissions":[{"money":"1,148,537","country":"Germany","day":"21","month":"01","year":"2007","remarks":""},{"money":"377,289","country":"Germany","day":"31","month":"12","year":"2006","remarks":""},{"money":"109,395","country":"Netherlands","day":"31","month":"12","year":"2006","remarks":""}],"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":[{"money":null,"country":null,"day":"06","month":"02","year":"2006","remarks":null},null],"copyrightHolder":"Copyright ©2006 Touchstone Pictures and Jerry Bruckheimer, Inc."},"technical":{"runtime":["2 hr 6 min (126 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex 35 IIC, Panavision Primo Lenses","Arriflex 435 ES, Panavision Primo Lenses","Panavision Genesis HD Camera, Panavision Primo Lenses","Panavision Panaflex Platinum, Panavision Primo Lenses"],"laboratory":["Company 3, Los Angeles (CA), USA (digital intermediate)","FotoKem Laboratory, Burbank (CA), USA (processing)","Technicolor, Hollywood (CA), USA (prints)"],"filmLength":["3,460 m (Sweden)","3,490 m (Portugal, 35 mm)"],"negativeFormat":["35 mm (Kodak Vision2 100T 5212, Vision2 200T 5217, Vision2 Expression 500T 5229)","Video (HD)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","HDCAM SR (1080p/24) (source format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)","D-Cinema"]},"rating":"7.0","metascore":"59","filmingLocations":[{"location":"Castle Green Apartments - 99 S. Raymond, Pasadena, California, USA"}],"rated":"PG-13","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Science Fiction Film","names":[]}]}]},{"award":"Black Reel Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Black Reel","categories":[{"category":"Best Breakthrough Performance","names":[{"name":"Paula Patton","id":"nm1745736","role":null}]}]}]},{"award":"Nielsen/EDI Gold Reel Awards 2007","titlesAwards":[{"titleAwardOutcome":"Won International Gold Reel Award","categories":[{"category":"","names":[{"name":"Buena Vista International","id":null,"role":null}]}]}]},{"award":"World Soundtrack Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated World Soundtrack Award","categories":[{"category":"Soundtrack Composer of the Year","names":[{"name":"Harry Gregson-Williams","id":"nm0004581","role":null},{"name":"Shrek the Third","id":"tt0413267","role":null},{"name":"The Number 23","id":"tt0481369","role":null},{"name":"Flushed Away","id":"tt0424095","role":null}]}]}]},{"award":"World Stunt Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Taurus Award","categories":[{"category":"Best Fire Stunt","names":[{"name":"Chuck Picerni Jr.","id":"nm0681601","role":null},{"name":"Steve Picerni","id":"nm0681613","role":null},{"name":"Sean Graham","id":"nm0334302","role":null},{"name":"Monty Cox","id":"nm0185169","role":null},{"name":"Robert Powell","id":"nm0667600","role":null},{"name":"Scott Wilder","id":"nm0928627","role":null},{"name":"Jeffrey G. Barnett","id":"nm1095129","role":null},{"name":"Max Daniels","id":"nm0200034","role":null}]},{"category":"Best Work With a Vehicle","names":[{"name":"Kenny Endoso","id":"nm0256879","role":null},{"name":"Henry Kingi","id":"nm0455437","role":null},{"name":"Chuck Picerni Jr.","id":"nm0681601","role":null},{"name":"Charlie Picerni","id":"nm0681604","role":null},{"name":"Jalil Jay Lynch","id":"nm0528324","role":null},{"name":"Steve Picerni","id":"nm0681613","role":null},{"name":"Corey Michael Eubanks","id":"nm0262277","role":null},{"name":"John Cenatiempo","id":"nm0127362","role":null},{"name":"Billy D. Lucas","id":"nm0524085","role":null},{"name":"Gilbert B. Combs","id":"nm0173646","role":null}]}]}]}],"votes":"251,952","type":"Movie","companyCreditsSimple":[{"idCompany":"co0049348","name":"Touchstone Pictures"},{"idCompany":"co0026281","name":"Jerry Bruckheimer Films"},{"idCompany":"co0074212","name":"Scott Free Productions"}],"keywords":{"keywords":["atf","surveillance","atf agent","explosion","investigation","fbi agent","terrorist","sailor","murder","bridge","death","corpse","bomb","ferry boat","sousveillance","in medias res","gun under pillow","african american","refrigerator magnet","alternate timeline","die hard scenario","ginger cat","prayer","averting disaster","terrorism prevention","preventing a murder","woman in danger","setting a dead body on fire","murder by gunshot","describing what is seen","feeling one is being watched","boat explosion","two word title","following someone in a car","answering machine message","gunshot wound","backwards time travel","woman in bra","african american protagonist","tied up while barefoot","tied feet","tied to a chair","subjective camera","freeze frame","underwater scene","character repeating someone else's dialogue","punched in the face","man punching a woman","writing on a body","bare chested male","confession","interrogation","boat chase","swat team","dragging a body","stolen ambulance","bayou","hummer","shot through a door","note","reference to albert einstein","blackout","laser pointer","bourbon street","phone booth","restaurant","2000s","cemetery","talking to self in mirror","diary","shower","repeated event","repeated line","reference to snow white","reflection in a car mirror","race against time","ex marine","cat","father daughter relationship","duct tape over mouth","dying repeatedly","polaroid camera","streetcar","motorcycle","555 phone number","answering machine","driving in the wrong direction","death of partner","dock","rain","body bag","cell phone","cigarette smoking","fat tuesday","slow motion scene","altered version of studio logo","death of protagonist","blood splatter","alternate future","altering history","stolen car","severed arm","set on fire","scratching someone's face","murder of a police officer","patriotism","morgue","crushed by a car","held at gunpoint","flashback","finger cut off","falling in love","child murder","cardiac arrest","car crash","burned alive","broken windshield","body in a trunk","bag over head","bound and gagged","time travel","shot to death","shot in the shoulder","shot in the head","shot in the chest","shootout","severed finger","pistol","person on fire","mass murder","machine gun","death of daughter","hostage","hospital","hit by a car","gasoline","funeral","exploding car","exploding body","exploding boat","earring","crime scene","car chase","burnt body","blood","ambulance","car accident","terrorism","new orleans louisiana","death of friend","death of child","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:08:33"}}