{"data":{"movies":[{"title":"World Trade Center","originalTitle":"","year":"2006","releaseDate":"20060809","directors":[{"name":"Oliver Stone","id":"nm0000231"}],"writers":[{"name":"Andrea Berloff","id":"nm0075696"},{"name":"John McLoughlin","id":"nm2225418"}],"runtime":"129 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMzE5ODEwOV5BMl5BanBnXkFtZTcwMzM3MzIzMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","History","Thriller"],"plot":"On September, 11th 2001, after the terrorist attack to the World Trade Center, the building collapses over the rescue team from the Port Authority Police Department. Will Jimeno and his sergeant John McLoughlin are found alive trapped under the wreckage while the rescue teams fight to save them.","simplePlot":"Two Port Authority police officers become trapped under the rubble of the World Trade Center.","actors":[{"actorName":"Nicolas Cage","urlProfile":"http://www.imdb.com/name/nm0000115","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMDM4Nzk2MV5BMl5BanBnXkFtZTcwNTcwNjExOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1964","placeOfBirth":" Long Beach, California, USA","birthName":"Nicholas Kim Coppola","height":"6' (1.83 m)","bio":"Nicolas Cage was born Nicolas Kim Coppola in Long Beach, California, the son of comparative literature professor August Coppola (whose brother is director Francis Ford Coppola) and dancer/choreographer Joy Vogelsang. He is of Italian (father) and Polish, German, and English (mother) descent. Cage changed his name early in his career to make his own reputation, succeeding brilliantly with a host of classic, quirky roles by the late 1980s. Initially studying theatre at Beverly Hills High School (though he dropped out at seventeen), he secured a bit part in Fast Times at Ridgemont High (1982) -- most of which was cut, dashing his hopes and leading to a job selling popcorn at the Fairfax Theater, thinking that would be the only route to a movie career. But a job reading lines with actors auditioning for uncle Francis' Rumble Fish (1983) landed him a role in that film, followed by the punk-rocker in Valley Girl (1983), which was released first and truly launched his career. His one-time passion for method acting reached a personal limit when he smashed a street-vendor's remote-control car to achieve the sense of rage needed for his gangster character in The Cotton Club (1984). In his early 20s, he dated Jenny Wright for two years and later linked to Uma Thurman. After a relationship of several years with Christina Fulton, a model, they split amicably and share custody of a son, Weston Cage (b.1992). In 2004, he married Alice Kim Cage, with whom he has a son.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMDM4Nzk2MV5BMl5BanBnXkFtZTcwNTcwNjExOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000115","name":"Nicolas Cage","nicknames":["Nick"],"idIMDB":"nm0000115"},"actorId":"nm0000115","character":"John McLoughlin","urlCharacter":"http://www.imdb.com/character/ch0012439","main":true},{"actorName":"Maria Bello","urlProfile":"http://www.imdb.com/name/nm0004742","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NDE3NTAyOF5BMl5BanBnXkFtZTcwNTg0MDEwMg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1967","placeOfBirth":" Norristown, Pennsylvania, USA","birthName":"Maria Elaina Bello","height":"5' 5\" (1.65 m)","bio":"Maria Bello was born on 18 April, 1967 in Norristown, Pennsylvania, to Kathy, a nurse and teacher, and Joe Bello, a contractor. She is of Italian and Polish descent. Maria went to Villanova University, majoring in political science. She had every intention of becoming a lawyer, but she took an acting class during her senior year, just for fun. She discovered she was very good at it, and she was soon cast in small off-Broadway plays, such as \"The Killer Inside Me\", \"Small Town Gals With Big Problems\" and \"Urban Planning\". She later guest-starred on episodes of L'as de la crime (1991), Nowhere Man (1995), Misery Loves Company (1995) and Tandem de choc (1994). She got her big break when producers Kenny Lenhart and John J. Sakmar cast her in the spy show Mr. & Mrs. Smith (1996) as \"Mrs. Smith\" (they remembered her from her performance in a failed pilot that was a remake of the classic TV series 77 Sunset Strip (1958)). The show was canceled after eight weeks on the air. Then came a spot on ER (1994) as \"Dr. Anna Del Amico\", in which she guest-starred on the final three episodes of the third season. The show's producers were so impressed with her that they asked her back as a regular on the series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NDE3NTAyOF5BMl5BanBnXkFtZTcwNTg0MDEwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004742","name":"Maria Bello","idIMDB":"nm0004742"},"actorId":"nm0004742","character":"Donna McLoughlin","urlCharacter":"http://www.imdb.com/character/ch0012441","main":true},{"actorName":"Connor Paolo","urlProfile":"http://www.imdb.com/name/nm1269733","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNTIwODczM15BMl5BanBnXkFtZTgwOTk2MTIyMDI@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1990","placeOfBirth":" New York City, New York, USA","height":"5' 7\" (1.7 m)","bio":"Connor Paolo was born July 11, 1990 in New York City, New York, to Julia Mendelsohn, a vocal coach and classical pianist, and Colin Paolo, a writer. In 2006, he attended the professional performing arts school featured in the movie Fame. Then he began taking acting classes at the Lee Strasberg Theater Institute and now studies with Peggy Lewis. For several summers beginning in 2005, he has attended Appel Farm Arts and Music Center Summer Arts Camp located in Elmer, New Jersey. Paolo acting career began at the age of nine, with his first TV appearance on the soap opera All My Children. In 2002, he played Zachary Connor, a preteen murderer-rapist in an episode of Law & Order: Special Victims Unit. His motion picture debut was in 2003 Clint Eastwood's Oscar-nominated Mystic River, playing Young Sean. In 2004, Paolo got a recurring role in the daytime soap opera One Life To Live as Travis O'Connell. He also appear in the motion picture Alexander as Young Alexander. Paolo in 2006, made a second appearance on Law & Order: Special Victims Unit, as Teddy Winnock, a disturbed teenager (based on the real case of Justin Berry). His latest motion picture role was Steven McLoughlin in World Trade Center for Oliver Stone in 2006. He has also starred in two other films that are soon to be released in 2007: Warren Hardesty in Snow Angels, directed by David Gordon Green, and Ross Embry in Favorite Son, his first leading role in a movie. Paolo has a background in theatre, and commercials. He appeared on the Broadway stage in the hit musical The Full Monty and off-Broadway in the New York public theater production of Shakespeare's, Richard III. Paolo also played Bottom in an abridged production of Shakespeare's Midsummer Night's Dream.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNTIwODczM15BMl5BanBnXkFtZTgwOTk2MTIyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1269733","name":"Connor Paolo","idIMDB":"nm1269733"},"actorId":"nm1269733","character":"Steven McLoughlin","urlCharacter":"http://www.imdb.com/character/ch0052951","main":true},{"actorName":"Anthony Piccininni","urlProfile":"http://www.imdb.com/name/nm2153642","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNTY1MzMxNl5BMl5BanBnXkFtZTcwMTcyMTMzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Anthony Piccininni is an actor, known for World Trade Center (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNTY1MzMxNl5BMl5BanBnXkFtZTcwMTcyMTMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2153642","name":"Anthony Piccininni","idIMDB":"nm2153642"},"actorId":"nm2153642","character":"JJ McLoughlin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexa Gerasimovich","urlProfile":"http://www.imdb.com/name/nm2057769","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzgxNzM3MTE4M15BMl5BanBnXkFtZTgwMDU4MjAwMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 April 2002","placeOfBirth":" New York, USA","birthName":"Alexa Veronica Gerasimovich","height":"5' 2\" (1.57 m)","bio":"Alexa Gerasimovich was born on April 11, 2002 in New York, USA as Alexa Veronica Gerasimovich. She is an actress, known for World Trade Center (2006), Bella (2006) and All My Children (1970).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzgxNzM3MTE4M15BMl5BanBnXkFtZTgwMDU4MjAwMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2057769","name":"Alexa Gerasimovich","nicknames":["Lexi"],"idIMDB":"nm2057769"},"actorId":"nm2057769","character":"Erin McLoughlin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Morgan Flynn","urlProfile":"http://www.imdb.com/name/nm1468783","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MTU1NTM5OV5BMl5BanBnXkFtZTcwNTU2NzQwMg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1994","placeOfBirth":" California, USA","birthName":"Morgan Mykeala Flynn","bio":"Morgan Flynn was born on June 7, 1994 in California, USA as Morgan Mykeala Flynn. She is an actress, known for World Trade Center (2006), A Plumm Summer (2007) and Strong Medicine (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MTU1NTM5OV5BMl5BanBnXkFtZTcwNTU2NzQwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1468783","name":"Morgan Flynn","nicknames":["Morgs"],"idIMDB":"nm1468783"},"actorId":"nm1468783","character":"Caitlin McLoughlin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Peña","urlProfile":"http://www.imdb.com/name/nm0671567","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNzcxNTE5NV5BMl5BanBnXkFtZTcwOTE4MTMzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 January 1976","placeOfBirth":" Chicago, Illinois, USA","height":"5' 7\" (1.7 m)","bio":"Peña was born and raised in Chicago, to Nicolasa, a social worker, and Eleuterio Peña, who worked at a button factory. His parents were originally from Mexico, his mother from Charcas in San Luis Potosí and his father from Villa Purificación in Jalisco. After graduating from high school, he went to an open casting call for the Peter Bogdanovich feature To Sir, with Love II (1996), and to his surprise, beat out hundreds of other young men for a role. After relocating to Los Angeles Peña quickly booked a succession of roles in features including Star Maps, My Fellow Americans (1996) (opposite Jack Lemmon and James Garner), La Cucaracha (1998) (winner of the Best Picture in the Austin Film Festival), Bellyfruit (1999), and the Disney/Jerry Bruckheimer feature Gone in Sixty Seconds (2000). Michael Peña resides in Los Angeles where he plays bass guitar with his band, plays golf and boxes for relaxation.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNzcxNTE5NV5BMl5BanBnXkFtZTcwOTE4MTMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0671567","name":"Michael Peña","idIMDB":"nm0671567"},"actorId":"nm0671567","character":"Will Jimeno","urlCharacter":"http://www.imdb.com/character/ch0012444","main":true},{"actorName":"Armando Riesco","urlProfile":"http://www.imdb.com/name/nm1269976","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMTAxNTgwM15BMl5BanBnXkFtZTgwOTk1MDg1MTE@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 December 1977","placeOfBirth":" Mayaguez, Puerto Rico","bio":"Armando Riesco is a versatile NYC based actor with credits in film, TV, and the stage. He graduated from Northwestern University's theater department and has been working consistently in multiple genres with some of the best directors in the business, including Spike Lee, Oliver Stone, Steven Soderbergh, Jonathan Demme, and many others. He has appeared in over a dozen films (Garden State, Adult World, Bella, World Trade Center etc.), and regular, recurring, and guest starring spots on television (Power, The Family, Vinyl, Kings). He has voiced and done motion capture for several video games, most recently playing \"Mario Frigo\" in Avalanche Studios \"Just Cause 3\". His voice can also be heard in national and international publicity campaigns for major companies such as Macy's, Chase, Garnier, McDonalds, and many others. On stage he was most notably the title character in the Elliot Trilogy, which includes the Pulitzer Prize winning \"Water by the Spoonful\" by Quiara Hudes, for which he received a Lucille Lortel nomination for outstanding lead actor in a play. He is sought after for his unique portrayals of characters across the board. From anger fueled Marine, to hilarious trans-sexual, to bored, suburban, and supremely wealthy, Riesco has managed to submerge himself seamlessly into his roles. As a director and writer/producer, his 1st short \"Remember\" was an official selection at LA Shorts,The NYHBO Latino Film Festival, LALIFF, and the Soho Film Festival. His second short \"The Lost Flowers\" (2016) is on the festival circuit having premiered at the Rincón International Film Festival in PR. He is also in development for a film adaptation/translation of Romeo and Juliet starring Ruben Blades.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMTAxNTgwM15BMl5BanBnXkFtZTgwOTk1MDg1MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1269976","name":"Armando Riesco","idIMDB":"nm1269976"},"actorId":"nm1269976","character":"Antonio Rodrigues","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jay Hernandez","urlProfile":"http://www.imdb.com/name/nm0379596","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NjU3Mjg2NV5BMl5BanBnXkFtZTYwMzczMjQ3._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1978","placeOfBirth":" Montebello, California, USA","birthName":"Javier Manuel Hernandez Jr.","height":"5' 8½\" (1.74 m)","bio":"With talent, the requisite good looks, and plenty of on-screen charisma, Jay Hernandez was born in Montebello, California, to Isis (Maldonado), an accountant and secretary, and Javier Hernandez, Sr., a mechanic. He is of Mexican descent. Jay had a serendipitous experience that led to his career. While riding an elevator in a high-rise in his native Los Angeles, the young man was approached by talent manager Howard Tyner, who suggested Hernandez had what it took to have a successful career in Hollywood. In 1998, he made his TV series debut as \"Antonio Lopez\", one of the high school basketball players in the NBC Saturday morning teen sitcom, Hang Time (1995), and stayed with the show for two seasons. Departing NBC, Hernandez moved to MTV with the short-term role of pizza delivery guy \"Eddie\" on the popular late-night serial, Undressed (1999), before segueing to the big screen. In 2001, Hernandez co-starred with Kirsten Dunst in the teen romance, Crazy/Beautiful (2001), portraying stalwart, straight-A high school student \"Carlos Nunez\", whose plans to attend the US Naval Academy are threatened by his growing attraction to a self-destructive rich girl, (Kirsten Dunst). He next appeared in Disney's surprise hit film, The Rookie (2002), as high school baseball team captain Joaquin \"Wack\" Campos. He also had a supporting role in the video-game-ish actioner, Torque (2004). Also in 2004, he was in the action-packed drama, Ladder 49 (2004), as \"Keith Perez\", and in the other action-packed drama, Friday Night Lights (2004). In 2006, he next starred in Eli Roth's Hostel (2005), a brutal horror flick about two American college buddies (Hernandez and Derek Richardson) lured to an out-of-the-way hostel in a Slovakian town rumored to house desperate, but beautiful Eastern European women. Following their wrong heads, both Americans get trapped in a truly sinister situation that plunges them into the dark recesses of human nature.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NjU3Mjg2NV5BMl5BanBnXkFtZTYwMzczMjQ3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0379596","name":"Jay Hernandez","idIMDB":"nm0379596"},"actorId":"nm0379596","character":"Dominick Pezzulo","urlCharacter":"http://www.imdb.com/character/ch0012442","main":true},{"actorName":"Joe Starr","urlProfile":"http://www.imdb.com/name/nm2338652","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMTM3Mzc4MF5BMl5BanBnXkFtZTgwNTE3MDkxNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Joe Starr studied acting at the J. Beckson Studios in NYC while working as a profession Stand-up Comedian. It was an early successful audition that led to a recurring role on \"Important Things with Demitri Martin\". With the wide exposure on Comedy Central Joe Starr caught the attention of New York's biggest Casting Directors and was soon Guest Starring on some of the biggest shows on network TV (Blue Bloods & Gotham) . Joe Starr's body of work continued to grow and expanded into major motion pictures, working with such luminaries as Oliver Stone, Peter Jackson and Steven Spielberg. He can now be seen on the CBS sit-com \"Kevin Can Wait\" as Enzo and in the soon to be released motion picture \"The Bleeder\" along side Liev Schreiber.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMTM3Mzc4MF5BMl5BanBnXkFtZTgwNTE3MDkxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2338652","name":"Joe Starr","idIMDB":"nm2338652"},"actorId":"nm2338652","character":"Subway Rider","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jon Bernthal","urlProfile":"http://www.imdb.com/name/nm1256532","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNzA5MDg0OV5BMl5BanBnXkFtZTcwMTU2NjE0Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 September 1976","placeOfBirth":" Washington, District of Columbia, USA","height":"5' 11\" (1.8 m)","bio":"Jon Bernthal was born and raised in Washington D.C., the son of Joan (Marx) and Eric Bernthal, a lawyer. His grandfather was musician Murray Bernthal. Jon went to study at The Moscow Art Theatre School, in Moscow, Russia, where he also played professional baseball in the European professional baseball federation. While in Moscow, he was noticed by the director of Harvard University's Institute for Advanced Theatre Training at the American Repretory Theatre and was invited to obtain his M.F.A there. After graduating in 2002 he has performed in over 30 plays regionally and off-Broadway including many with his own award-winning theatre company Fovea Floods. He now lives in Venice, California with his dog, Boss.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNzA5MDg0OV5BMl5BanBnXkFtZTcwMTU2NjE0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1256532","name":"Jon Bernthal","idIMDB":"nm1256532"},"actorId":"nm1256532","character":"Christopher Amoroso","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Jimeno","urlProfile":"http://www.imdb.com/name/nm2223804","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc5ODc0MjI4NV5BMl5BanBnXkFtZTYwMjAwMzI3._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 November 1967","placeOfBirth":" Barranquilla, Colombia","bio":"William Jimeno was born on November 26, 1967 in Barranquilla, Colombia. He is an actor and writer, known for World Trade Center (2006), 15 Septembers Later (2016) and The Making of 'World Trade Center' (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc5ODc0MjI4NV5BMl5BanBnXkFtZTYwMjAwMzI3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2223804","name":"William Jimeno","idIMDB":"nm2223804"},"actorId":"nm2223804","character":"Port Authority Officer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nick Damici","urlProfile":"http://www.imdb.com/name/nm0198804","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NjQyMzg4Nl5BMl5BanBnXkFtZTcwNjE4MjYxOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Nick Damici is an actor and writer, known for Hap and Leonard (2016), The Stakelander (2016) and Dark Was the Night (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NjQyMzg4Nl5BMl5BanBnXkFtZTcwNjE4MjYxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0198804","name":"Nick Damici","idIMDB":"nm0198804"},"actorId":"nm0198804","character":"Lieutenant Kassimatis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jude Ciccolella","urlProfile":"http://www.imdb.com/name/nm0161980","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NzY2NzAzOV5BMl5BanBnXkFtZTcwMDc2OTkyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1947","placeOfBirth":" Burlington, Vermont, USA","birthName":"Richard Jude Ciccolella","height":"5' 10\" (1.78 m)","bio":"Jude was born in Burlington Vermont on March 11th, 1947. He spent his first three years in Middlebury Vermont where his father coached Football, Basketball and Baseball at Middlebury College. He then moved to Albany, New York, his hometown, where he would spend his formative years. After grade school at St. Catherine of Siena, He graduated from Christian Brothers Academy in 1965. He was an All City and All League first team selection in Football and Basketball, and was a member of the American Legion All Star team, and pitched in every All Star game all three years that he played. In Football he was voted the Most Valuable Player by the members of his HS team and was Captain of the Basketball team. Along with his father, Richard S. Ciccolella and his brother Thomas, Jude has been inducted into to the CBA Hall of Fame. Though as a kid Jude never participated in plays or learned to play a musical instrument and gave no obvious indication that he would make his living in the performing arts, looking back, there were signs along the way. Jude went to the movies a lot with his mother and father and his Aunt Jo, especially loving the swords and sandal epics, the sci-fi and horror films, and, of course, the westerns. He also would always have fantastic costumes designed by his mother for Halloween contests---the Pharaoh, the Monster, the Knight. He sang the tunes from the radio incessantly---trying to imitate the voices. Even in sports, it seemed to matter more that you stood at the plate like Henry Aaron, that you swung the bat like him---exactly---than whether you got a hit. Fantasy! Imitation! It was really at Brown University, though, that Jude discovered his vocation---something that, in hindsight, had been manifesting itself all along. Jude graduated from Brown with a BA in Philosophy and played football. But it was the theater department, headed by Jim Barnhill, that opened up the thespic world to Jude and pointed him toward his life goal. The campus band, Cool Clear Walter, which Jude fronted, was engendered by associations in the Theater Department-Terry Harkin (drums) and the Philosophy Department-Al Musgrave (lead guitar). After two years of social work in Albany, Jude went to Temple University in 1971 and received and MFA in Acting two years later. After a number of years in Philly writing songs, singing in pubs, doing plays, and supporting himself with stage hand work, it was time, finally---late in the game---to hit the BIG APPLE. Since he arrived, one of the lucky ones, he has earned his living on stage and screen for 35 years. For the first seven years it was tough---on call seven days a week while loading trucks to pay the bills---but there was always progress---a break here, a break there. Again, he was one of the lucky ones. He is a member of The Actors Studio and EST and is co-artistic director with Bill Bolender of The Eumenides Group, which has produced three plays in LA. He received a number of best actor awards for a short film (Last Call) which he co-produced with director Robert Bailey. The Jude Ciccolella Band has been playing for eight years in LA, playing the pop music of his generation and original stuff. He is also the composer and performer on five original CDs. Jude is married to the wonderful actress and award winning author Sylva Kelegian. They reside on the coast with their beloved dogs.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NzY2NzAzOV5BMl5BanBnXkFtZTcwMDc2OTkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0161980","name":"Jude Ciccolella","idIMDB":"nm0161980"},"actorId":"nm0161980","character":"Inspector Fields","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Martin Pfefferkorn","urlProfile":"http://www.imdb.com/name/nm0679357","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMTkyNTIzM15BMl5BanBnXkFtZTcwMzMyNjM3OA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Martin Pfefferkorn is an actor, known for World Trade Center (2006), I Sell the Dead (2008) and The Book of Life (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMTkyNTIzM15BMl5BanBnXkFtZTcwMzMyNjM3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0679357","name":"Martin Pfefferkorn","idIMDB":"nm0679357"},"actorId":"nm0679357","character":"Homeless Addict #1","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0469641","urlIMDB":"http://www.imdb.com/title/tt0469641","business":{"budget":{"money":"$63,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$18,730,762","country":"USA","day":"13","month":"08","year":"2006","remarks":""},{"money":"£1,667,589","country":"UK","day":"01","month":"10","year":"2006","remarks":"411 Screens"},{"money":"€1,585,000","country":"Italy","day":"16","month":"10","year":"2006","remarks":""},{"money":"€267,209","country":"Netherlands","day":"24","month":"09","year":"2006","remarks":"50 Screens"},{"money":"PHP 15,162,065","country":"Philippines","day":"22","month":"10","year":"2006","remarks":"50 Screens"}],"gross":[{"money":"$70,236,496","country":"USA","day":"15","month":"10","year":"2006","remarks":""},{"money":"$70,118,265","country":"USA","day":"08","month":"10","year":"2006","remarks":""},{"money":"$69,999,970","country":"USA","day":"01","month":"10","year":"2006","remarks":""},{"money":"$69,748,809","country":"USA","day":"24","month":"09","year":"2006","remarks":""},{"money":"$69,090,404","country":"USA","day":"17","month":"09","year":"2006","remarks":""},{"money":"$67,152,063","country":"USA","day":"10","month":"09","year":"2006","remarks":""},{"money":"$63,769,986","country":"USA","day":"03","month":"09","year":"2006","remarks":""},{"money":"$55,642,517","country":"USA","day":"27","month":"08","year":"2006","remarks":""},{"money":"$45,105,868","country":"USA","day":"20","month":"08","year":"2006","remarks":""},{"money":"$26,531,879","country":"USA","day":"13","month":"08","year":"2006","remarks":""},{"money":"£4,596,644","country":"UK","day":"22","month":"10","year":"2006","remarks":""},{"money":"£4,208,032","country":"UK","day":"15","month":"10","year":"2006","remarks":""},{"money":"£3,394,300","country":"UK","day":"08","month":"10","year":"2006","remarks":""},{"money":"£1,667,589","country":"UK","day":"01","month":"10","year":"2006","remarks":""},{"money":"€5,508,156","country":"Italy","day":"30","month":"06","year":"2007","remarks":""},{"money":"€267,976","country":"Netherlands","day":"24","month":"09","year":"2006","remarks":""},{"money":"PHP 33,812,064","country":"Philippines","day":"19","month":"11","year":"2006","remarks":""},{"money":"PHP 15,162,065","country":"Philippines","day":"22","month":"10","year":"2006","remarks":""}],"weekendGross":[{"money":"$92,591","country":"USA","day":"15","month":"10","year":"2006","remarks":"191 Screens"},{"money":"$64,526","country":"USA","day":"08","month":"10","year":"2006","remarks":"117 Screens"},{"money":"$157,514","country":"USA","day":"01","month":"10","year":"2006","remarks":"242 Screens"},{"money":"$371,149","country":"USA","day":"24","month":"09","year":"2006","remarks":"607 Screens"},{"money":"$1,041,893","country":"USA","day":"17","month":"09","year":"2006","remarks":"1,474 Screens"},{"money":"$2,565,386","country":"USA","day":"10","month":"09","year":"2006","remarks":"2,674 Screens"},{"money":"$5,884,341","country":"USA","day":"03","month":"09","year":"2006","remarks":"2,902 Screens"},{"money":"$6,473,299","country":"USA","day":"27","month":"08","year":"2006","remarks":"3,021 Screens"},{"money":"$10,901,350","country":"USA","day":"20","month":"08","year":"2006","remarks":"2,998 Screens"},{"money":"$18,730,762","country":"USA","day":"13","month":"08","year":"2006","remarks":""},{"money":"£182,470","country":"UK","day":"22","month":"10","year":"2006","remarks":"228 Screens"},{"money":"£431,227","country":"UK","day":"15","month":"10","year":"2006","remarks":"322 Screens"},{"money":"£865,249","country":"UK","day":"08","month":"10","year":"2006","remarks":"413 Screens"},{"money":"£1,667,589","country":"UK","day":"01","month":"10","year":"2006","remarks":"411 Screens"},{"money":"€267,209","country":"Netherlands","day":"24","month":"09","year":"2006","remarks":"50 Screens"},{"money":"PHP 15,162,065","country":"Philippines","day":"22","month":"10","year":"2006","remarks":"50 Screens"}],"admissions":[{"money":"499,357","country":"Brazil","day":"15","month":"10","year":"2006","remarks":""},{"money":"337,555","country":"Brazil","day":"08","month":"10","year":"2006","remarks":""},{"money":"154,259","country":"Brazil","day":"01","month":"10","year":"2006","remarks":""},{"money":"522,825","country":"Germany","day":"15","month":"10","year":"2006","remarks":""},{"money":"190,123","country":"Germany","day":"01","month":"10","year":"2006","remarks":""},{"money":"894,643","country":"Italy","day":"30","month":"06","year":"2007","remarks":""},{"money":"165,087","country":"Netherlands","day":"31","month":"12","year":"2006","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"19","month":"10","year":"2005","remarks":null},{"money":null,"country":null,"day":"10","month":"02","year":"2006","remarks":null}],"copyrightHolder":"Copyright © MMVI by KERNOS Filmproduktionsgesellschaft mbH &amp; Co. KG (on print)"},"technical":{"runtime":["2 hr 9 min (129 min)"],"soundMix":["Dolby Digital","SDDS","DTS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arriflex 435 ES, Panavision Primo and Hylén Lenses","Panavision Panaflex Lightweight, Panavision Primo Lenses","Panavision Panaflex Platinum, Panavision Primo and Hylén Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA","EFILM Digital Laboratories, Hollywood (CA), USA (digital intermediate)"],"filmLength":["3,563 m (Portugal, 35 mm)"],"negativeFormat":["35 mm (Kodak Vision2 200T 5217, Vision2 500T 5218, Ektachrome 100D 5285)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (spherical) (Kodak Vision 2383)","D-Cinema"]},"rating":"6.0","metascore":"66","filmingLocations":[{"location":"Ross Dock, Palisade Interstate Park, Fort Lee, New Jersey, USA"}],"rated":"PG-13","awards":[{"award":"Alliance of Women Film Journalists 2006","titlesAwards":[{"titleAwardOutcome":"Nominated EDA Award","categories":[{"category":"Best Screenplay Written by a Woman","names":[{"name":"Andrea Berloff","id":"nm0075696","role":null}]}]}]},{"award":"ALMA Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated ALMA Award","categories":[{"category":"Outstanding Actor - Motion Picture","names":[{"name":"Michael Peña","id":"nm0671567","role":null}]}]}]},{"award":"Casting Society of America, USA 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Best Feature Film Casting - Drama","names":[{"name":"Mary Vernieu","id":"nm0894611","role":null}]}]}]},{"award":"Hollywood Film Awards 2006","titlesAwards":[{"titleAwardOutcome":"Won Hollywood Film Award","categories":[{"category":"Director of the Year","names":[{"name":"Oliver Stone","id":"nm0000231","role":null}]}]},{"titleAwardOutcome":"Won Hollywood Movie of the Year","categories":[{"category":"","names":[{"name":"Oliver Stone","id":"nm0000231","role":null}]}]}]},{"award":"Irish Film and Television Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated IFTA Award","categories":[{"category":"Best Cinematography","names":[{"name":"Seamus McGarvey","id":"nm0568974","role":null}]}]}]},{"award":"Motion Picture Sound Editors, USA 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing in a Feature Film: Dialogue and Automated Dialogue Replacement","names":[{"name":"Wylie Stateman","id":"nm0823758","role":"supervising sound editor"},{"name":"Michael D. Wilhoit","id":"nm0928992","role":"supervising sound editor"},{"name":"Renee Tondelli","id":"nm0867123","role":"supervising sound editor"},{"name":"Laura Harris Atkinson","id":"nm0364979","role":"dialogue/adr editor"},{"name":"Michael Hertlein","id":"nm0002905","role":"dialogue/adr editor"},{"name":"Susan Kurtz","id":"nm0476057","role":"dialogue/adr editor"}]},{"category":"Best Sound Editing in Sound Effects and Foley for a Feature Film","names":[{"name":"Wylie Stateman","id":"nm0823758","role":"supervising sound editor"},{"name":"Michael D. Wilhoit","id":"nm0928992","role":"supervising sound editor"},{"name":"Harry Cohen","id":"nm0169420","role":"supervising sound editor"},{"name":"Ann Scibelli","id":"nm0778439","role":"supervising sound editor"},{"name":"Scott Curtis","id":"nm0193503","role":"supervising foley editor"},{"name":"Hector C. Gika","id":"nm0317696","role":"sound editor"},{"name":"Scott Wolf","id":"nm0937931","role":"sound editor"},{"name":"Branden Spencer","id":"nm0817876","role":"sound editor"},{"name":"Daniel R. Kerr","id":"nm0449671","role":"sound editor"},{"name":"Linda Lew","id":"nm0506708","role":"sound editor"},{"name":"Charlie Campagna","id":"nm2153148","role":"sound editor"},{"name":"Jeremy Pitts","id":"nm0686010","role":"sound editor"},{"name":"Mark Ormandy","id":"nm0650214","role":"sound editor"},{"name":"Robin Harlan","id":"nm0363230","role":"foley artist"},{"name":"Sarah Monat","id":"nm0597587","role":"foley artist"},{"name":"Jeffrey Wilhoit","id":"nm0928989","role":"foley artist"},{"name":"James Moriana","id":"nm0605321","role":"foley artist"}]}]}]},{"award":"National Board of Review, USA 2006","titlesAwards":[{"titleAwardOutcome":"Won Freedom of Expression Award","categories":[{"category":"","names":[]}]}]},{"award":"Utah Film Critics Association Awards 2006","titlesAwards":[{"titleAwardOutcome":"2nd place UFCA Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Maggie Gyllenhaal","id":"nm0350454","role":null},{"name":"Stranger Than Fiction","id":"tt0420223","role":null}]}]}]},{"award":"Yoga Awards 2007","titlesAwards":[{"titleAwardOutcome":"Won Yoga Award","categories":[{"category":"Worst Foreign Film","names":[{"name":"Oliver Stone","id":"nm0000231","role":null}]}]}]},{"award":"Young Artist Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Performance in a Feature Film - Supporting Young Actor","names":[{"name":"Connor Paolo","id":"nm1269733","role":null}]}]}]}],"votes":"69,391","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"},{"idCompany":"co0118437","name":"Double Feature Films"},{"idCompany":"co0010183","name":"Intermedia Films"}],"keywords":{"keywords":["terrorism","twin towers","based on true story","rescue","trapped","rubble","police","rescue team","terrorist","friend","building collapse","disaster","based on true events","music score features piano","rescue mission","fdny","vomiting","terror attack","three word title","cartoon on tv","wall street manhattan new york city","manhattan new york city","world trade center manhattan new york city","statue of liberty new york city","slow motion scene","port authority bus terminal manhattan new york city","flashback","empire state building manhattan new york city","disaster in new york","married to a police officer","watching tv","walkie talkie","underwear","tv news","train","traffic light","teenage boy","tattoo","subway","stretcher","street life","sleeping","skyscraper","shower","screaming","satellite","runaway","revenge","radio news","prayer","policeman","photograph","pentagon","pastor","paramedic","pain","new york city port authority","mother son relationship","mother daughter relationship","missing","marine","loudspeaker","locker room","listening to music","leg amputation","jumping off a building","reference to jesus christ","husband wife relationship","hispanic american","helmet","hammer","hallucination","gurney","gun","gunshot","reference to god","friendship","flashlight","fire","firetruck","fireman","fireball","ferry","father son relationship","father daughter relationship","family relationships","explosion","evacuation","emergency room","elevator","dying","drugstore","drawing","documentary footage","debris","death","day care center","darkness","cross","church","cell phone","caricature","car radio","bus","burning","brother sister relationship","blood","bible","barber shop","ambulance","alarm clock","airplane","african american","accountant","survival","courage","pregnant wife","police officer","military veteran","marriage","self sacrifice","search and rescue","pregnancy","nypd","hospital","family crisis","cave in","september 11 2001","new york city","death of friend"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:18:35"}}