{"data":{"movies":[{"title":"Lovewrecked","originalTitle":"Love Wrecked","year":"2005","releaseDate":"20060608","directors":[{"name":"Randal Kleiser","id":"nm0459170"}],"writers":[{"name":"Stephen Langford","id":"nm0486405"}],"runtime":"87 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1OTI1ODExOV5BMl5BanBnXkFtZTcwNzMyNzI0MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Adventure","Comedy","Romance"],"plot":"On a Caribbean cruise, Jenny is marooned on a beach with her rock and roll idol. Deliriously in love with the idea of time alone with him, she manages to hide the fact that they're a stone's throw away from their resort.","simplePlot":"On a Caribbean cruise, Jenny is marooned on a beach with her rock and roll idol. Deliriously in love with the idea of time alone with him, she manages to hide the fact that they're a stone's throw away from their resort.","actors":[{"actorName":"Amanda Bynes","urlProfile":"http://www.imdb.com/name/nm0004789","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc0OTY0NDk5MV5BMl5BanBnXkFtZTcwMTM1ODY3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 April 1986","placeOfBirth":" Thousand Oaks, California, USA","birthName":"Amanda Laura Bynes","height":"5' 8\" (1.73 m)","bio":"Amanda Laura Bynes was born on April 3, 1986, in Thousand Oaks, California, the youngest of three children of Lynn (Organ), a dental assistant, and Richard Bynes, a dentist. Her father is of Lithuanian, Irish, and Polish descent, and her mother is from an Ashkenazi Jewish family from Toronto. Amanda became interested in acting and performing from the age of three, when she would say her older sister Jillian's lines with her while she performed in plays. It was from then on that her family and friends knew that she would be a star someday. Her acting debut was in 1996, when she auditioned for and got the role as a newcomer on All That (1994). Right away, she became very popular as people enjoyed her acting in skits, especially Ask Ashley, where she played a little girl running an advice column who would get very angry every time she read a letter. In 1999, 13-year-old Amanda was given her own variety show, The Amanda Show (1999), in which she starred in all of the skits except Totally Kyle. In 2001, she co-starred with Frankie Muniz in Big Fat Liar (2002) as Kaylee, Jason's friend who helps him prove that he really did write the essay \"Big Fat Liar\" and regain his father's trust. It was also in 2001 that she began dating Taran Killam from The Amanda Show (1999) and Big Fat Liar (2002), who is four years and two days older than she is. She also won a Nickelodeon Kids' Choice Award and, at age 15, The Amanda Show (1999) ended its run. In 2002, she began co-starring with Jennie Garth in What I Like About You (2002) as Holly, a 16-year-old girl who moves in with her sister after their father decides to move to Japan. She also celebrated her Sweet 16th birthday and got her driver's license on April 3, 2002. In 2003, Amanda won two KCA Awards and starred as Daphne, a girl searching for her father, in What a Girl Wants (2003) with Colin Firth and Kelly Preston as her parents. She continued acting in What I Like About You (2002) and broke up with Taran. A prodigiously talented comedienne, on April 3, 2004, Amanda celebrated her 18th birthday on the 17th Annual KCA Awards, where she won an award for best actress for her role in What a Girl Wants (2003). She graduated from Thousand Oaks High School's independent study program on June 10, 2004, and filmed Lovewrecked (2005) in 2004.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc0OTY0NDk5MV5BMl5BanBnXkFtZTcwMTM1ODY3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004789","name":"Amanda Bynes","nicknames":["Chicky"],"idIMDB":"nm0004789"},"actorId":"nm0004789","character":"Jenny Taylor","urlCharacter":"http://www.imdb.com/character/ch0037339","main":true},{"actorName":"Chris Carmack","urlProfile":"http://www.imdb.com/name/nm1377001","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NTE4ODIxOF5BMl5BanBnXkFtZTcwNTU4NTMwNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 December 1980","placeOfBirth":" Washington, District of Columbia, USA","birthName":"James Christopher Carmack","height":"5' 11\" (1.8 m)","bio":"Chris Carmack was born on December 22, 1980 in Washington, District of Columbia, USA as James Christopher Carmack. He is an actor, known for Nashville (2012), The Butterfly Effect 3: Revelations (2009) and Beauty & the Briefcase (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NTE4ODIxOF5BMl5BanBnXkFtZTcwNTU4NTMwNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1377001","name":"Chris Carmack","idIMDB":"nm1377001"},"actorId":"nm1377001","character":"Jason Masters","urlCharacter":"http://www.imdb.com/character/ch0256715","main":true},{"actorName":"Jonathan Bennett","urlProfile":"http://www.imdb.com/name/nm1057932","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTZhZDc0NWEtNjU5My00ODc4LWE4YWQtNTM1YTRmYmQ5YzJlXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1981","placeOfBirth":" Rossford, Ohio, USA","birthName":"Jonathan D. Bennett","height":"6' 2\" (1.88 m)","bio":"Jonathan David Bennett was born in Rossford, Ohio, to RuthAnne (Mason) and Dr. David Paul Bennett. He headed straight to New York to pursue acting after graduating from the theater program at Otterbein. He was actually discovered by an agent while sitting on a train. Six months later he signed on to the iconic soap opera \"All My Children,\" playing J.R. Chandler. Since then Jonathan's career has been on fire. He has appeared in a slew of teen comedies, side-by-side with some of the biggest and brightest stars of their time including; \"Cheaper by the Dozen 2\" (with Steve Martin) and \"Lovewrecked\" (with Amanda Bynes). He also stepped into and took over the iconic role replacing Ryan Reynolds as Van Wilder in \"Van Wilder: Freshman Year.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTZhZDc0NWEtNjU5My00ODc4LWE4YWQtNTM1YTRmYmQ5YzJlXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1057932","name":"Jonathan Bennett","idIMDB":"nm1057932"},"actorId":"nm1057932","character":"Ryan Howell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jamie-Lynn Sigler","urlProfile":"http://www.imdb.com/name/nm0797464","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk0NzUxMzAzN15BMl5BanBnXkFtZTcwMjgwMjQ4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 May 1981","placeOfBirth":" Jericho, New York, USA","height":"5' 3\" (1.6 m)","bio":"Jamie-Lynn Sigler has been acting and singing since the age of 7. She got her start in New York regional theater, and has since starred in over two dozen theatrical productions including \"Annie,\" \"The Wizard of Oz,\" \"The Sound of Music,\" \"The Wiz,\" and \"Gypsy.\" In the summer of 2001, she starred in the touring production of Richard Rodgers and Oscar Hammerstein II's \"Cinderella,\" playing the lead opposite Eartha Kitt. Jamie made her Broadway debut starring as Belle in Disney's Broadway production of \"Beauty and the Beast\" from October of 2002 through February 2003. Beyond her theatrical appearances, she starred as Meadow Soprano in the critically acclaimed HBO original series The Sopranos (1999). For her work on the show, she received the 1999 and 2000 Hollywood Reporter Young Star Awards for Best Young Actress in a Dramatic Television Series and both 2001 and 2002 ALMA nominations. She also has a SAG Award for The Sopranos (1999) Best Ensemble Cast. Jamie has also starred as former Hollywood madam Heidi Fleiss in the USA Network's two-hour original movie Call Me: The Rise and Fall of Heidi Fleiss (2004). She recently completed her first feature film, Extreme Dating (2005), and starred in the music video for Mariah Carey's single, \"Through the Rain.\" Jamie, who battled an eating disorder in the late 1990s while starring on The Sopranos (1999), is now a spokesperson for the National Eating Disorders Association (www.nationaleatingdisorders.org). In 2002, she published her revealing autobiography, \"Wise Girl\" (Pocket Books) to rave reviews. A few years ago, she was paralyzed from the waist down for several days with Lyme Disease. Her recovery has given her a fresh outlook on her work and her life. Jamie is originally from Jericho (Long Island, New York) and currently resides in New York City. She married her manager, A.J. Discala, in July of 2003. However, that marriage has since ended.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk0NzUxMzAzN15BMl5BanBnXkFtZTcwMjgwMjQ4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0797464","name":"Jamie-Lynn Sigler","nicknames":["J-Lynn"],"idIMDB":"nm0797464"},"actorId":"nm0797464","character":"Alexis Manetti","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Susan Duerden","urlProfile":"http://www.imdb.com/name/nm0240267","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzczNTc3NTQwNF5BMl5BanBnXkFtZTYwNDQ1NDUy._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Susan Duerden is an award-winning feature film and television actress. Critically acclaimed for her artistic versatility, she is known for hard-hitting, emotionally charged roles and lighthearted comedy, alike. In addition to her on-screen roles, she has also played lead theatre roles on London's West End and internationally. British by birth, she now lives in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzczNTc3NTQwNF5BMl5BanBnXkFtZTYwNDQ1NDUy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0240267","name":"Susan Duerden","idIMDB":"nm0240267"},"actorId":"nm0240267","character":"Bree Taylor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fred Willard","urlProfile":"http://www.imdb.com/name/nm0929609","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMTQzMTc2MF5BMl5BanBnXkFtZTgwNjY5MjgyMTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1939","placeOfBirth":" Shaker Heights, Ohio, USA","height":"6' 2\" (1.88 m)","bio":"Fred Willard radiates a unique charm that has established him as one of the industry's most gifted comic actors, first coming to prominence as ambitious but dimwitted sidekick Jerry Hubbard to Martin Mull's smarmy talk-show host Barth Gimble in the devastating satirical series Fernwood Tonight (1977). A master of sketch comedy, he is most heralded for his quick wit and improvisational expertise. His 50 appearances in sketches on The Tonight Show with Jay Leno (1992) are indicative of his ability to transform any character into a unique comic portrayal. Fred recently completed a sold-out run of his one-man show, \"Fred Willard: Alone At Last!\" (with a cast of 12) and received two Los Angeles Artistic Director Awards, for Best Comedy and Best Production. He is an alumnus of The Second City and currently heads a sketch comedy workshop, The MoHo Group.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMTQzMTc2MF5BMl5BanBnXkFtZTgwNjY5MjgyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0929609","name":"Fred Willard","idIMDB":"nm0929609"},"actorId":"nm0929609","character":"Ben Taylor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jackie Long","urlProfile":"http://www.imdb.com/name/nm1382877","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMzIwMTMwOV5BMl5BanBnXkFtZTcwNTM2MjYzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 October 1981","placeOfBirth":" Pasadena, California, USA","bio":"Jackie Long was born on October 23, 1981 in Pasadena, California, USA. He is an actor and producer, known for Grand Theft Auto V (2013), Soul Men (2008) and Lovewrecked (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMzIwMTMwOV5BMl5BanBnXkFtZTcwNTM2MjYzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1382877","name":"Jackie Long","idIMDB":"nm1382877"},"actorId":"nm1382877","character":"Chase","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joey Kern","urlProfile":"http://www.imdb.com/name/nm0449466","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY4NDU1OTU3M15BMl5BanBnXkFtZTgwNDI1NjAzMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 September 1976","placeOfBirth":" Kentucky, USA","height":"5' 10½\" (1.79 m)","bio":"Joey Kern studied at New York University where he earned a BFA in Drama. He then went on to train at the Royal Academy of Dramatic Arts in London. His professional acting career began on stage with various companies including the Atlantic Theater Company, New Group Theater and Theatre for a New Audience, where he played the title role of \"Troilus\" in William Shakespeare's \"Troilus and Cressida\". He then made his feature film debut in the indie flick The Virgin (1999), followed by a guest appearance in the HBO television series Sex and the City (1998). Next, he played a college boy in the feature film Super Troopers (2001), then landed small roles in three more indie films: Love the Hard Way (2001) starring Adrien Brody, XX/XY (2002) and Garmento (2002). His career took off when he landed lead roles in two films given wide release: Grind (2003) and Cabin Fever (2002). Kern has also appeared on ABC's Wonderland (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY4NDU1OTU3M15BMl5BanBnXkFtZTgwNDI1NjAzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0449466","name":"Joey Kern","idIMDB":"nm0449466"},"actorId":"nm0449466","character":"Milo Dinsdale","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lance Bass","urlProfile":"http://www.imdb.com/name/nm0004726","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNzE2MTY3NF5BMl5BanBnXkFtZTcwMzMwMDE3OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 May 1979","placeOfBirth":" Laurel, Mississippi, USA","birthName":"James Lance Bass","height":"5' 9\" (1.75 m)","bio":"Lance Bass is the quintessential illustration of a highly successful and driven jack-of-all-trades: singer, host, actor, producer, writer, entrepreneur, philanthropist and cosmonaut. Beyond his fame as a member of the phenomenally successful group *NSYNC, where the group sold an impressive 60 million plus records worldwide, Bass has made himself a household name throughout the globe. With countless career highlights in music spanning the past 20 years, including multiple Grammy® nominations, two diamond RIAA awards, MTV Video Music Awards®, American Music Awards® and People's Choice Awards® to name a just a few, he has expanded his accomplishments into multiple entertainment mediums. Bass can currently be seen as a daily contributing panelist on The Meredith Vieira Show (2014), which he joined in September of 2015. In 2007, Bass lit up Broadway, starring as \"Corny Collins\" in the smash hit, \"Hairspray\", published his revealing memoir, \"Out of Sync\", and danced his way to the finals on season seven of ABC's hit competition show, Dancing with the Stars (2005). In 2003, he was inducted into the Mississippi Musician's Hall of Fame, making him the youngest person to ever receive this honor. In 2012, he joined Sirius XM and launched a pop culture daily radio show, called \"Dirty Pop\", with Lance Bass and, during the weekends, hosts their \"Pop2k Countdown\", where he can still be heard today. Building on his passion for film and documentaries, Bass has established himself as an acclaimed producer with titles like Kidnapped for Christ, where he was awarded the Audience Award for Documentary Feature during it's Slamdance premiere this past January and Mississippi I Am, which recently won Best Documentary at the Manhattan International Film Festival. This November, he is being recognized for his outstanding achievements at the Mississippi Film Festival with an encore screening of Mississippi I Am. Other producing credits include the Miramax film, On the Line (2001), where he not only served as Executive Producer, but was also the film's star and earned him the coveted Movieguide® Award for excellence in family-oriented programming. In 2005, he executive-produced Randal Kleiser's romantic comedy, Lovewrecked (2005), starring Amanda Bynes, Chris Carmack and Jamie-Lynn Sigler. He is also the recipient of the Golden Apple Award® as Male Film Discovery of 2001. While known for his success in music, including a #1 European dance single, in 2014, called \"Walking On Air\" and featuring newcomer Bella Blue, Bass has made numerous memorable guest appearances in film, television and as the animated voice in several popular children's cartoons. With his sights focused on hosting, Bass is preparing for his fifth consecutive year as co-host of the American Music Awards' Coca-Cola Red Carpet, has guest-anchored the KTLA Morning News in Los Angeles, filled in for Harvey Levin on TMZ and has become a frequent correspondent with the landmark entertainment show, Entertainment Tonight. As an entrepreneur, he founded Famous Yard Sale, which was inspired by his memories of weekend yard sales in his hometown of Laurel, Mississippi, where he reinvented the yard sale as a virtual auction marketplace for celebrities to donate their excess belongings and raise money for their favorite charities. This led him to create and executive produce the Lifetime series Celebrity Home Raiders. Currently, he has partnered up with Slavco and Daniel Tuskaloski, and TeliApp to create Sparxx, a social relationship and dating app specifically designed for the LGBT community with the goal of breaking the mold of conventional LGBT dating apps. Sparxx was designed to help men and women and their personally defined sexuality, find meaningful and long lasting relationships. Philanthropically, Lance remains active in various charitable organizations including serving on the Young Hollywood Board of the Environmental Media Association. He is also the National Youth Spokesperson for World Space Week, consistent with his interest in space travel. A fact that many are unaware of, Bass is a certified cosmonaut after several months of training in the Russian space program where Bass received cosmonaut certification and continued on to Houston's Johnson Space Center to take part in astronaut training. Additionally, Lance is a strong advocate for animals and has been a spokesperson for animal rescues all over the country, including directly working with Lucky Puppy, a dog rescue based in Los Angeles, CA. Bass currently resides in Los Angeles with his husband Michael Turchin, whom he married in 2014 and was featured as a wedding special on E! in early 2015.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNzE2MTY3NF5BMl5BanBnXkFtZTcwMzMwMDE3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004726","name":"Lance Bass","nicknames":["Lansten","Scoop","LBeezy"],"idIMDB":"nm0004726"},"actorId":"nm0004726","character":"Cell Phone Dan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kathy Griffin","urlProfile":"http://www.imdb.com/name/nm0004980","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTEyMjM3M15BMl5BanBnXkFtZTcwNzk2MTU5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 November 1960","placeOfBirth":" Chicago, Illinois, USA","birthName":"Kathleen Mary Griffin","height":"5' 4\" (1.63 m)","bio":"Kathy Griffin was raised in the near-west Chicago suburbs, in an Irish-American family. She has three older brothers and an older sister. When her parents retired to California, Kathy moved west with them after graduating from Oak Park River Forest High School and began trying to break into show business. She performed with the Groundlings and then paid her dues doing stand-up at various clubs until she was discovered. According to her brothers, as a kid, Kathy would circulate among the guests at parties and tell jokes. Kathy has a regular stand-up engagement at the Laugh Factory in L.A. and hosted the reality series Average Joe (2003). She stars in the Emmy winning reality series Kathy Griffin: My Life on the D-List (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTEyMjM3M15BMl5BanBnXkFtZTcwNzk2MTU5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004980","name":"Kathy Griffin","nicknames":["Queen of the D-list"],"idIMDB":"nm0004980"},"actorId":"nm0004980","character":"Belinda","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alfonso Ribeiro","urlProfile":"http://www.imdb.com/name/nm0005355","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTAzNzA3MTA4MV5BMl5BanBnXkFtZTcwNDgxODk1OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 September 1971","placeOfBirth":" Manhattan, New York City, New York, USA","height":"5' 7\" (1.7 m)","bio":"Alfonso Ribeiro was born in New York on September 21, 1971. Alfonso's family is from Trinidad & Tobago. Although rumor has been that he is of Dominican descent, he has stated in an interview that this is false. Neither he nor his family are from the Dominican Republic; they originate from Trinidad & Tobago. Ribeiro began his career when he debuted on the PBS show \"Oye Ollie.\" After getting the starring role in the Broadway musical \"The Tap Dance Kid\" Ribeiro was spotted by Michael Jackson who cast him in one of the singer's many Pepsi commercials of that decade. At the age of 10 Ribeiro dabbled as a musician, releasing singles such as \"Dance Baby,\" \"Not Too Young (To Fall In Love)\", \"Sneak Away With Me\" and \"Time Bomb\". It was about this time that he was cast as Ricky Schroder's best friend on the long-running series Silver Spoons (1982). He attended California State University at Los Angeles after the end of the series, and was later cast as Carlton Banks on the popular series The Fresh Prince of Bel-Air (1990). An avid race car driver, Ribeiro resides in Los Angeles where he participates in celebrity car races.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTAzNzA3MTA4MV5BMl5BanBnXkFtZTcwNDgxODk1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005355","name":"Alfonso Ribeiro","idIMDB":"nm0005355"},"actorId":"nm0005355","character":"Brent Hernandez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Connor Matheus","urlProfile":"http://www.imdb.com/name/nm0558585","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MTIyMDA2N15BMl5BanBnXkFtZTcwMjcxNDgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1993","placeOfBirth":" California, USA","bio":"Connor Matheus was born on August 6, 1993 in California, USA. He is an actor, known for The Polar Express (2004), May (2002) and Envy (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MTIyMDA2N15BMl5BanBnXkFtZTcwMjcxNDgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0558585","name":"Connor Matheus","idIMDB":"nm0558585"},"actorId":"nm0558585","character":"Otis Venable","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Suzanne Kent","urlProfile":"http://www.imdb.com/name/nm0448864","urlPhoto":"","biography":{"bio":"Suzanne Kent is an actress and director, known for History of the World: Part I (1981), Honey I Blew Up the Kid (1992) and White Fang (1991). She has been married to David Rosenberg since October 17, 1982. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0448864","name":"Suzanne Kent","idIMDB":"nm0448864"},"actorId":"nm0448864","character":"Cinderella Venable","urlCharacter":"http://www.imdb.com/character/ch0416246","main":true},{"actorName":"Caleb Moody","urlProfile":"http://www.imdb.com/name/nm0600452","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU0NjU2MjAxMl5BMl5BanBnXkFtZTcwMDY0NjAyOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Caleb Moody is an actor and producer, known for Infamous (2009), Infamous 2 (2011) and Lovewrecked (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU0NjU2MjAxMl5BMl5BanBnXkFtZTcwMDY0NjAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0600452","name":"Caleb Moody","idIMDB":"nm0600452"},"actorId":"nm0600452","character":"Coast Guard Officer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lou Erickson","urlProfile":"http://www.imdb.com/name/nm2835823","urlPhoto":"","biography":{"bio":"Lou Erickson is an actor, known for Lovewrecked (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2835823","name":"Lou Erickson","idIMDB":"nm2835823"},"actorId":"nm2835823","character":"Cruiser Captain","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0409011","urlIMDB":"http://www.imdb.com/title/tt0409011","business":{"budget":null,"openingWeekend":[{"money":"£223,400","country":"UK","day":"20","month":"05","year":"2007","remarks":"234 Screens"},{"money":"RUR 2,744,371","country":"Russia","day":"11","month":"06","year":"2006","remarks":""},{"money":"$2,899,991","country":"Thailand","day":"27","month":"08","year":"2006","remarks":""},{"money":"UAH 152,192","country":"Ukraine","day":"11","month":"06","year":"2006","remarks":""}],"gross":[{"money":"$478,070","country":"USA","day":"03","month":"09","year":"2006","remarks":""},{"money":"£387,143","country":"UK","day":"27","month":"05","year":"2007","remarks":""},{"money":"£223,400","country":"UK","day":"20","month":"05","year":"2007","remarks":""},{"money":"RUR 6,948,725","country":"Russia","day":"18","month":"06","year":"2006","remarks":""},{"money":"RUR 2,744,371","country":"Russia","day":"11","month":"06","year":"2006","remarks":""},{"money":"THB 4,800,003","country":"Thailand","day":"03","month":"09","year":"2006","remarks":""},{"money":"THB 2,899,991","country":"Thailand","day":"27","month":"08","year":"2006","remarks":""},{"money":"UAH 485,266","country":"Ukraine","day":"25","month":"06","year":"2006","remarks":""},{"money":"UAH 409,732","country":"Ukraine","day":"18","month":"06","year":"2006","remarks":""},{"money":"UAH 169,104","country":"Ukraine","day":"10","month":"06","year":"2006","remarks":""}],"weekendGross":[{"money":"£99,013","country":"UK","day":"27","month":"05","year":"2007","remarks":"235 Screens"},{"money":"£223,400","country":"UK","day":"20","month":"05","year":"2007","remarks":"234 Screens"},{"money":"RUR 1,501,571","country":"Russia","day":"18","month":"06","year":"2006","remarks":""},{"money":"RUR 2,744,371","country":"Russia","day":"11","month":"06","year":"2006","remarks":""},{"money":"THB 900,010","country":"Thailand","day":"03","month":"09","year":"2006","remarks":""},{"money":"THB 2,899,991","country":"Thailand","day":"27","month":"08","year":"2006","remarks":""},{"money":"UAH 17,731","country":"Ukraine","day":"25","month":"06","year":"2006","remarks":""},{"money":"UAH 83,362","country":"Ukraine","day":"18","month":"06","year":"2006","remarks":""},{"money":"UAH 152,192","country":"Ukraine","day":"11","month":"06","year":"2006","remarks":""}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"28","month":"06","year":"2004","remarks":null},null],"copyrightHolder":"© 2005 Media 8 Distribution IV"},"technical":{"runtime":["1 hr 27 min (87 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.9","filmingLocations":[{"location":"Cabrera, Dominican Republic"}],"rated":"PG-13","awards":[],"votes":"12,199","type":"Movie","companyCreditsSimple":[{"idCompany":"co0051264","name":"Media 8 Entertainment"},{"idCompany":"co0126492","name":"Bacon & Eggs"},{"idCompany":"co0156753","name":"Santo Domingo Film & Music Video"}],"keywords":{"keywords":["beach","love","resort","marooned","caribbean","scene during end credits","lightning","zodiac boat","cat fight","covered with ants","rival","massage","female in a shower","windsurfing","meteor shower","sea lion","woman wearing a red dress","life raft","boat party","lifeguard","skin diving","audience participation","wearing swim fins","dance performance","fake drowning","woman in a bikini","bare chested male","drink thrown in face","crowd surfing","male singer","kitchen","unrequited love","underwater scene","teenage girl","teenage crush","swimming pool","rock concert","rivalry","raft","mother daughter relationship","man overboard","love triangle","lost at sea","jealousy","father daughter relationship","fart joke","fall","fake accent","dolphin","deception","crutch","catfight","castaway","best friend","alarm clock","boyfriend girlfriend relationship","shipwreck","rock star","presumed dead","ocean","musician","media","lie","kiss","island","hotel","friendship","fish","concert","beach resort"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 19:46:41"}}