{"data":{"movies":[{"title":"Goldene Zeiten","originalTitle":"","year":"2006","releaseDate":"20060126","directors":[{"name":"Peter Thorwarth","id":"nm0861826"}],"writers":[{"name":"Peter Thorwarth","id":"nm0861826"},{"name":"Alexander M. Rümelin","id":"nm0749191"}],"runtime":"134 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE5MzgzNTkzNF5BMl5BanBnXkFtZTgwODQ0MDU3MTE@._V1.jpg","countries":["Germany"],"languages":["German","English","Russian"],"genres":["Comedy","Crime","Drama"],"plot":"Ingo organize a charity event for the local golf club. Special guest will be the Hollywood star Douglas Burnett. But who remembers what the aging star looks like today?","simplePlot":"Ingo organize a charity event for the local golf club. Special guest will be the Hollywood star Douglas Burnett. But who remembers what the aging star looks like today?","actors":[{"actorName":"Wotan Wilke Möhring","urlProfile":"http://www.imdb.com/name/nm0617852","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTQ2NDc0MV5BMl5BanBnXkFtZTcwNDQxNTgyMg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 May 1967","placeOfBirth":" Detmold, Germany","height":"6' 0½\" (1.84 m)","bio":"Wotan Wilke Möhring was born on May 23, 1967 in Detmold, Germany. He is an actor, known for The Experiment (2001), Who Am I (2014) and Pandorum (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTQ2NDc0MV5BMl5BanBnXkFtZTcwNDQxNTgyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0617852","name":"Wotan Wilke Möhring","idIMDB":"nm0617852"},"actorId":"nm0617852","character":"Ingo Schmitz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dirk Benedict","urlProfile":"http://www.imdb.com/name/nm0070767","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNTA5OTk2MV5BMl5BanBnXkFtZTYwMjY0ODU2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 March 1945","placeOfBirth":" Helena, Montana, USA","birthName":"Dirk Niewoehner","height":"5' 11\" (1.8 m)","bio":"Dirk Benedict was born in Montana on March 1st, 1945. He was raised in the country, far away from anything connected with movies or acting. He gathered his first experiences in acting (on a dare) in a college production of \"Showboat\" where he got the main part. His father, a lawyer, died when Dirk was 18, which was hard for him to take. While working on Georgia, Georgia (1972) in Sweden, he made the first contact with a macrobiotic diet and changed his eating habits drastically. He was 26 at that time. A few years later, doctors found that he had cancer of the prostate. He refused to accept the usual treatment and moved away to a secluded cottage. Dirk managed to cure himself from cancer by following the rules of his macrobiotic diet. When he got his part as \"Starbuck\" in Battlestar Galactica (1978), the doctors stated that he was in good health. Dirk's main successes were \"Battlestar Galactica\" and The A-Team (1983) in which he played \"Templeton - The Face - Peck\". He was formerly married to actress Toni Hudson and has two sons (George and Roland).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNTA5OTk2MV5BMl5BanBnXkFtZTYwMjY0ODU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0070767","name":"Dirk Benedict","idIMDB":"nm0070767"},"actorId":"nm0070767","character":"Douglas Burnett / John Striker / Horst Müller","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wolf Roth","urlProfile":"http://www.imdb.com/name/nm0745051","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NTAzMjI1MF5BMl5BanBnXkFtZTgwMTc5Njc5NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 August 1944","placeOfBirth":" Torgau, Saxony, Germany","birthName":"Wolf Egbert Klapproth","height":"6' 0½\" (1.84 m)","bio":"Wolf Roth was born on August 30, 1944 in Torgau, Saxony, Germany as Wolf Egbert Klapproth. He is an actor and writer, known for Das Erbe der Guldenburgs (1987), Fleisch (1979) and Goldene Zeiten (2006). He has been married to Barbara May since 1984. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NTAzMjI1MF5BMl5BanBnXkFtZTgwMTc5Njc5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0745051","name":"Wolf Roth","idIMDB":"nm0745051"},"actorId":"nm0745051","character":"Jürgen Matthies","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gennadi Vengerov","urlProfile":"http://www.imdb.com/name/nm0893092","urlPhoto":"","biography":{"dateOfBirth":"27 August 1959","placeOfBirth":" Vitebsk, Byelorussian SSR, USSR [now Belarus]","birthName":"Gennadi Aronovitch Markmann","height":"6' 1½\" (1.87 m)","bio":"Gennadi Vengerov was born on August 27, 1959 in Vitebsk (Belarus). After graduating from the Technical School for Architecture and Construction and a short-term employment as a construction engineer, he started his creative career as an announcer of the Vitebsk Regional Radio. He performed at the People's Theater in Vitebsk. In 1980 he was invited to be an actor at the professional scene to the Yakub Kolas Belarus National Academic Drama Theater. Following his military service in the Soviet Army in 1983 he entered the School-Studio (Institute of Higher Education) at the Moscow Art Theater for the course by professors Viktor Monyukov and Vladimir Bogomolov. In 1986, on his 4th course year, together with his course mate Mikhail Yefremov - they established «Sovremennik-2» Theater. In 1989 he was invited to the troop of Moscow Academic Mayakovsky Theater. Gennadi Vengerov continued his career in Germany in 1990 as an announcer of Deutsche Welle Radio and an actor of Dusseldorf Drama Theater. From 1995-2000 he has been an actor of Bochum Drama Theater. Since 2004 he has been actively filming in Russian cinema and TV projects, participated in theatrical productions in Moscow, as voice over talent he made audio records for documentaries, fictional films and advertisements. He is the brand voice of the Russian News Broadcasting Station - RSN and the Russian brand voice Euronews international channel. In 2009 he narrated TV-Show \"Men's Stories with Gennadi Vengerov\" on the Russian REN TV channel- During his career Gennadi Vengerov starred in more than 140 movies in Russia, USA, England, Austria and Germany. At various times he worked with Jude Law, James Cromwell, Sean Bean, Til Schweiger, Christian Slater, Ving Rhames, Mario Adorf, Colm Meaney, Franka Potente, Jan Josef Liefers, Klaus Löwitsch and other famous actors. He is widely known and recognized in Russia for the roles of blacksmith Vulkan (The Fighter series) and Major Volkov (Hour of Volkov series) and among German audience for the role businessman Viktor Strelnikov (Gute Zeiten, schlechte Zeiten).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0893092","name":"Gennadi Vengerov","idIMDB":"nm0893092"},"actorId":"nm0893092","character":"Sergej","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Zak","urlProfile":"http://www.imdb.com/name/nm0952215","urlPhoto":"","biography":{"dateOfBirth":"1959","placeOfBirth":"","height":"5' 9¾\" (1.77 m)","bio":"Mark Zak was born in 1959. He is an actor and cinematographer, known for Enemy at the Gates (2001), The Tourist (2010) and Bridge of Spies (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0952215","name":"Mark Zak","idIMDB":"nm0952215"},"actorId":"nm0952215","character":"Alexeji","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Birgit Stein","urlProfile":"http://www.imdb.com/name/nm0825406","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI4MTc3NjgzNV5BMl5BanBnXkFtZTgwMjAxNzU2MzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1971","placeOfBirth":" Germany","bio":"Birgit Stein was born in 1971 in Germany. She is an actress and producer, known for House of the Dead (2003), Amoklauf (1994) and Atomised (2006). She was previously married to Jürgen Prochnow.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI4MTc3NjgzNV5BMl5BanBnXkFtZTgwMjAxNzU2MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0825406","name":"Birgit Stein","idIMDB":"nm0825406"},"actorId":"nm0825406","character":"Francesca Matthies / Reiseverkehrskauffrau","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ludger Pistor","urlProfile":"http://www.imdb.com/name/nm0685598","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2Njg1MDA4MF5BMl5BanBnXkFtZTgwODg5MzY5MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 March 1959","placeOfBirth":" Recklinghausen, Germany","height":"6' 4\" (1.93 m)","bio":"Ludger Pistor was born on March 16, 1959 in Recklinghausen, Germany. He is an actor, known for Balko (1995), Inglourious Basterds (2009) and Casino Royale (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2Njg1MDA4MF5BMl5BanBnXkFtZTgwODg5MzY5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0685598","name":"Ludger Pistor","idIMDB":"nm0685598"},"actorId":"nm0685598","character":"Dieter Kettwig","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stefano Polzoni","urlProfile":"http://www.imdb.com/name/nm1648362","urlPhoto":"","biography":{"bio":"Stefano Polzoni is an actor, known for Goldene Zeiten (2006) and Alerte Cobra (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1648362","name":"Stefano Polzoni","idIMDB":"nm1648362"},"actorId":"nm1648362","character":"Giuseppe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mario Diaz","urlProfile":"http://www.imdb.com/name/nm0225019","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQwMTYwNjc1N15BMl5BanBnXkFtZTgwOTkyNzY2ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Mario Diaz is an actor, known for La La Land (2016), Feud (2017) and 2 Broke Girls (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQwMTYwNjc1N15BMl5BanBnXkFtZTgwOTkyNzY2ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0225019","name":"Mario Diaz","idIMDB":"nm0225019"},"actorId":"nm0225019","character":"Roberto","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Loretta Stern","urlProfile":"http://www.imdb.com/name/nm0827774","urlPhoto":"","biography":{"dateOfBirth":"16 September 1974","placeOfBirth":" Mainz, Rhineland-Palatinate, Germany","birthName":"Andrea Steinitz","height":"5' 7\" (1.7 m)","bio":"Loretta Stern, born as Andrea Steinitz, also known as Lori Stern, is a qualified musical actress. She has made her education in Hamburg. From 1996 till 1999 she was singer in the German pop-band \"Sqeezer\". Later she acted in German crime thrillers like \"Tatort\" and \"Soko\" and other shows and films. From 1997 till 1999 she was the host of the German youth magazine \"Bravo TV\". 2002 she founded, together with Clemens Süssenbach the jazz-band \"Stern & Süssenbach\". Since 1999 she hosts special report from the film festivals in Berlin and Cannes for the German/French TV station ARTE.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0827774","name":"Loretta Stern","idIMDB":"nm0827774"},"actorId":"nm0827774","character":"Jasmin / Giselle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexandra Neldel","urlProfile":"http://www.imdb.com/name/nm0625001","urlPhoto":"","biography":{"dateOfBirth":"11 February 1976","placeOfBirth":" Berlin, Germany","height":"5' 6¼\" (1.68 m)","bio":"Alexandra Neldel was born in 1976 in West Berlin, Germany. Her parents divorced when she was a child. His father is a hunter. It was always very hard for her to decide if she would be with her father or her mother. Maybe that is the reason why she decided to leave her parents and to live her own life at the age of 16. Yet, she has a very good relationship with her parents. After finishing \"Realschule\" in Berlin-Steglitz, she started to work as a dentists' assistant. She worked only one year as a dentists' assistant, but during this time she also worked as a hostess. In 1992 she was discovered by the boss of a German casting agency during a polo competition. Although Neldel had no experience in acting, she got a role in a German daily soap opera, Gute Zeiten, Schlechte Zeiten. After leaving Gute Zeiten, Schlechte Zeiten in 1999, Neldel starred in several German motion pictures and TV films, including Lammbock, Samba in Mettmann and Emmy-winning series Berlin, Berlin. She never really studied acting, her principle has always been \"learning by doing\". She always mentions in interviews that she never wanted to be an actress, it was not her dream to stand in front of the camera, she was completely satisfied with her life as a dentists' assistant. But now, she enjoys her work as an actress and it always makes her happy to give something to the audience. 2005 was the year of her breakthrough as an actress: she began to play the role of Lisa Plenske in the most successful German daily soap-opera ever. She left the series after 365 episodes. After her leaving, the majority of the audience turned aside from \"Verliebt in Berlin\", the series became rather unsuccessful. More than seven million German people watched the 365th episode of \"Verliebt in Berlin\", therefore it was a profitable production for German TV channel Sat1. In 2006 Neldel was \"best European soap actress\" and got the Rose d'Or (Golden Rose) Award. She is often considered as a sex-symbol , too - but she always refuses this kind of expression. She is also considered as a girls' girl: that means the majority of her fans are women. She never talks about her private life, one can never read home-stories about her, as she says, she wants to keep her private life. Nowadays she is one of the most successful actresses in Germany, she has many fans also in France, since her series \"Verliebt in Berlin\" was broadcast there as well: it was the most successful German series in France ever.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0625001","name":"Alexandra Neldel","nicknames":["Alex"],"idIMDB":"nm0625001"},"actorId":"nm0625001","character":"Melanie","urlCharacter":"http://www.imdb.com/character/ch0138987","main":true},{"actorName":"Bernd Herzsprung","urlProfile":"http://www.imdb.com/name/nm0381341","urlPhoto":"","biography":{"dateOfBirth":"22 March 1942","placeOfBirth":" Hamburg, Germany","height":"5' 9¼\" (1.76 m)","bio":"Bernd Herzsprung was born on March 22, 1942 in Hamburg, Germany. He is an actor, known for Soko, brigade des stups (1978), Freunde fürs Leben (1992) and Wild Rider Ltd. (1967). He was previously married to Barbara Engel.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0381341","name":"Bernd Herzsprung","idIMDB":"nm0381341"},"actorId":"nm0381341","character":"Klaus Scheurer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ingrid Steeger","urlProfile":"http://www.imdb.com/name/nm0824377","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDg0YjE0ODItOWVmYi00OTk5LWI0MTEtNGUwYzMwMzM5ZmU5L2ltYWdlXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 April 1947","placeOfBirth":" Berlin, Germany","birthName":"Ingrid Anita Stengert","height":"5' 2½\" (1.59 m)","bio":"Ingrid Steeger was born Ingrid Anita Stengert in Berlin, April 1st, 1947, as the third child to Kurt and Käthe Stengert, who already had son Udo and daughter Jutta. After school she worked as a secretary when she was discovered by photographer Frank Quade. Soon pinup photos of her appeared in numerous men's magazines, especially SEXY, where even today she is the girl with the most cover shots. She was elected Miss Filmfestival (Berlin 1968) and soon was into movies herself. Her early movies were cheap sex movies, mostly of the \"Report\" type. Not wanting to use her real name, because her father objected, and not yet having decided on a stage name, her first movie billed her as \"Ingrid Stengel\". Her \"very\" first movie deserves a special mention. Before the age of video, pornos for home viewing were Super 8 shorts and Ingrid starred uncredited in one of those, called \"Die perverse Herrin und ihre Opfer\" (\"The perverted Mistress and her Victims\"). This movie had long been forgotten, when at the height of her career Mike Hunter reissued it on video, retitled \"Ingrid Steeger's Porno Action\". She went to court to stop distribution and won. The same thing happened again when Beate Uhse distributed a collection of old naturalist shots of Ingrid, titled \"Ingrid - blutjung und verführerisch\" (\"Ingrid - youngblooded and tempting\"). Again she had to go to court to stop distribution. In addition to her movies, she was given small serious roles in TV-productions, where, strange as it seems, nobody seemed to know about her sex-films. Helmut Holger, one of her colleagues suggested her to director Michael Pfleghar, who was casting for a new TV comedy series called \"Klimbim\", a German version of the American show \"Rowan and Martin's Laugh In\". This show became her breakthrough. The public loved her in her new role as \"Klimbim-clown\", and decent pictures of her appeared in women's and teen's magazines. The readers of Germany's biggest teen magazine BRAVO awarded her the \"Otto\", BRAVO's top award, four times. (1975: Bronze, 1976 & 1977: Silver, 1978: Gold). It seemed that nobody could stop her now. She followed \"Klimbim\" with \"Zwei himmlische Töchter\" (\"Two Heavenly Daughters\"), another successful comedy series, and flopped badly with \"Susi\", a third one, all directed by Pfleghar. From then on it was downhill for her. She went to France to live with her actor-friend Jean-Paul Zehnacker, but they soon separated. Ingrid returned to Germany to become a mature, serious actress, in the vein of her idols Shirley MacLaine or Goldie Hawn, but the public wouldn't let her. The same public that once had forgiven her sexfilm-past wouldn't forget \"Klimbim\", though the series hadn't been shown for ages. Nearly every article on her began with \"Ingrid Steeger, ex-clown (\"Klimbim\"), will ...\". Michael Pfleghar couldn't help her either, because he ran into severe personal problems and committed suicide a few years later. Though Ingrid can act, her few serious roles were doomed from the start. In recent years she has concentrated on theater and played mostly boulevard comedies. In 1995 she starred in the Karl May summer theater in Bad Segeberg as Cowgirl Mona. Her private life has been rather chaotic too. Her marriages, liaisons and affairs are well chronicled and are always listed when she is seen with somebody new. 1) When starting in the movies she married cameraman Lothar Stickelbrucks in 1973, but they got divorced two years later. 2) She had an affair with director Michael Pfleghar, though neither one admitted it at that time. She even wanted to leave Germany to go to Hollywood with him (Rumour?). 3) Next was Peter Koenecke, who organized safari tours in Kenia. They planned to marry in 1979 and to move to Kenia together. Allegedly she even learned Swahili. 4) Next was French actor Jean-Paul Zehnacker, who starred with her in \"Susi\". She moved to live with him in France, but when love turned to frienship she returned to Germany 1984. 5) Next was Lothar Köllner (1985-1986), owner of a hifi-shop in Murnau, and she even obtained her driver's license at the age of 38 to see him more often. 6) Next was movie director Dr. Dieter Wedel (1988-1991), whom she shared with another woman. At least he starred her in his TV-series \"Wilder Westen inklusive\" and \"Der große Bellheim\", giving her a chance for some serious acting. 7) Then she met Red Indian Dakota Tom LaBlanc at a World Uranium Hearing and they got married in a rush in August 1992. Nobody gave them much of a chance, because Tom didn't speak German and she didn't speak much English. Most photos show them side by side, Tom having to wear Red Indian clothing with feather headdress for the photographers, holding Ingrid's dachshund and looking very uneasy. Nevertheless the press never accepted him. The couple was always referred to as \"Ingrid and her Indian\". Soon he spend most of his time in America, fighting for the rights of his people, and Ingrid was left at home. They divorced after three years in October 1995. 8) Next was Swiss actor Bernd Seebacher. Immediately following her divorce from Tom LaBlanc she fell in love with Bernd and August 1996 was set as the date for the wedding. The couple was shown in magazines, choosing rings and posing in their wedding dresses, but in the last possible moment the wedding was postponed. Unfortunately Ingrid had already sold her apartment in Munich to live with her husband in Switzerland. Now that she remained a foreigner, she had to leave the country. Her only true friend in all those years was her dachshund Felix. There is scarcely one private photo of Ingrid without her dog. When Felix was killed in France by a hit-and-run driver, she mourned a long time and finally got Felix II. This one even went on stage with her in \"Champagner-Complex\" and was said to have been the matchmaker when she first met Dieter Wedel. When Felix II had to be put to sleep in 1995, she didn't want another one, but Dieter Wedel kept up the tradition by presenting her a young dachshund called Lucky Luke.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDg0YjE0ODItOWVmYi00OTk5LWI0MTEtNGUwYzMwMzM5ZmU5L2ltYWdlXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0824377","name":"Ingrid Steeger","idIMDB":"nm0824377"},"actorId":"nm0824377","character":"Ulrike Scheurer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edda Fischer","urlProfile":"http://www.imdb.com/name/nm0278887","urlPhoto":"","biography":{"dateOfBirth":"1969","placeOfBirth":"","height":"5' 5¾\" (1.67 m)","bio":"Edda Fischer was born in 1969. She is an actress, known for Manta - Der Film (1991), Ballermann 6 (1997) and V (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0278887","name":"Edda Fischer","idIMDB":"nm0278887"},"actorId":"nm0278887","character":"Golfdame Valerie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hans Martin Stier","urlProfile":"http://www.imdb.com/name/nm0830105","urlPhoto":"","biography":{"dateOfBirth":"29 September 1950","placeOfBirth":" Bad Ems, Rhineland-Palatinate, Germany","height":"6' 2½\" (1.89 m)","bio":"Hans Martin Stier was born on September 29, 1950 in Bad Ems, Rhineland-Palatinate, Germany. He is an actor, known for Enemy at the Gates (2001), Wings of Desire (1987) and SOKO Köln (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0830105","name":"Hans Martin Stier","idIMDB":"nm0830105"},"actorId":"nm0830105","character":"Bauer Buschschulte","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0418657","urlIMDB":"http://www.imdb.com/title/tt0418657","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":[{"money":"35,000","country":"Germany","day":"26","month":"01","year":"2006","remarks":""}],"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 14 min (134 min) (Germany)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex Cameras and Lenses"],"laboratory":["CinePostproduction Bavaria Bild & Ton, Germany"],"filmLength":["3,694 m (Germany)"],"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.5","filmingLocations":[{"location":"Dortmund, North Rhine-Westphalia, Germany"}],"awards":[],"votes":"904","type":"Movie","companyCreditsSimple":[{"idCompany":"co0035336","name":"Westside Filmproduktion GmbH"},{"idCompany":"co0057092","name":"Senator Film Produktion"},{"idCompany":"co0169635","name":"3L Filmproduktion"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:21:18"}}