{"data":{"movies":[{"title":"SharkMan","originalTitle":"Hammerhead","year":"2005","releaseDate":"20050618","directors":[{"name":"Michael Oblowitz","id":"nm0643422"}],"writers":[{"name":"Monty Featherstone","id":"nm1935269"},{"name":"Howard Zemski","id":"nm1934904"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0OTk0Nzg3MF5BMl5BanBnXkFtZTcwNjY3ODc0MQ@@._V1.jpg","countries":["Aruba","USA","Germany"],"languages":["English","German"],"genres":["Horror","Sci-Fi"],"plot":"A scientist tries to save his son from cancer but his experiments turn him into a shark-man instead. A group of people from a pharmaceutical corporation are sent to the mad doctor's island to investigate his activities.","simplePlot":"A scientist tries to save his son from cancer but his experiments turn him into a shark-man instead. A group of people from a pharmaceutical corporation are sent to the mad doctor's island to investigate his activities.","actors":[{"actorName":"William Forsythe","urlProfile":"http://www.imdb.com/name/nm0001235","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MTkxMTMwM15BMl5BanBnXkFtZTYwNzkyNDMz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1955","placeOfBirth":" Bedford-Stuyvesant, Brooklyn, New York City, New York, USA","height":"5' 10\" (1.78 m)","bio":"Dynamically entertaining heavyset US actor with piercing eyes, William Forsythe has a superb talent for playing some truly unlikeable and downright nasty characters that dominate the films in which he appears! If you're cast as the \"hero\" against Forsythe's \"villain\", then you have your work cut out for you, as Forsthye's raw energy and menace on screen is second to none. He started out in a couple of minor film roles and guest appearance's in high-rated TV shows including CHiPs (1977), Hill Street Blues (1981) and T.J. Hooker (1982). He quickly moved into high-quality feature films, including playing a small-time hoodlum in Il était une fois en Amérique (1984), an hilariously funny performance as a bumbling jail escapee alongside John Goodman in the knockout Raising Arizona (1987) and as a renegade soldier in Extreme Prejudice (1987). The energetic Forsythe portrayed comic book villain \"Flattop\" in Dick Tracy (1990), was foolish enough to tangle with vengeful cop Steven Seagal in the hyper-violent Out for Justice (1991) and locked horns with ex-NFL linebacker Brian Bosworth in the biker action film Stone Cold (1991). With his expertise in playing icy villains, Forsythe was perfect to portray Prohibition mobster Al Capone in the short-lived '90s revival of the classic '60s crime show, The Untouchables (1993), and he continued the motif of playing edgy, nefarious individuals in the thought-provoking The Waterdance (1992), the oily film noir piece Things to Do in Denver When You're Dead (1995), as real-life mobster Sammy Gravano, aka \"The Bull\", in Gotti (1996) and supporting another ex-NFL player's foray into film acting, when L.A. Raider Howie Long debuted in Firestorm (1998). Forsythe has remained perpetually busy in the new century with a plethora of feature film, telemovie and TV series appearances, and developing a minor cult following amongst film fans for his attention grabbing dramatic skills - check out his performances in City by the Sea (2002), The Devil's Rejects (2005) and Halloween (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MTkxMTMwM15BMl5BanBnXkFtZTYwNzkyNDMz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001235","name":"William Forsythe","nicknames":["Bill"],"idIMDB":"nm0001235"},"actorId":"nm0001235","character":"Tom Reed","urlCharacter":"http://www.imdb.com/character/ch0073625","main":true},{"actorName":"Hunter Tylo","urlProfile":"http://www.imdb.com/name/nm0878950","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNTUxMzI4MV5BMl5BanBnXkFtZTYwOTk0MzA1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 July 1962","placeOfBirth":" Fort Worth, Texas, USA","birthName":"Deborah Jo Hunter","height":"5' 6\" (1.68 m)","bio":"Born Deborah Jo Hunter in Fort Worth, the native Texan is an accomplished equestrian with a degree in pre-med from Fordham University in New York. She was a top fashion model in the seventies and eighties, and began her acting career in Dallas, Texas doing plays such as \"Vanities\", \"The Marriage-Go-Round\", \"I Ought To Be in Pictures\", \"The Odd Couple\" and \"The Dining Room\". More recently, she appeared at the Beverly Hills Theater, in \"Rear Window\". In her early television career beginning in 1984, she landed 3 major contract roles, finally remaining with CBS's _\"The Bold and the Beautiful\" (1987) for the past 23 years, as \"Dr. Taylor Forrester\". She has appeared on numerous magazine covers. She has received many awards, and is consistently voted as \"Most Popular Actress\" in \"Soap Digest\" and \"CBS Daytime\". She has guest-starred on many prime-time shows, including Diagnosis Murder (1993), The Nanny (1993) and Zorro (1990), as well as movies for the Hallmark Channel, and mini-series such as The Maharaja's Daughter (1994), co-starring with Bruce Boxleitner and Ann Margaret. Hunter has twice been named as one of People Magazine's \"50 Most Beautiful People\" and has been the spokesperson for over 50 international products. She has done more than 500 commercials - her most notable as the \"Pantene Girl\". She is launching a skin care line, with an exclusive patented rejuvenating molecule, derived by cutting-edge technology, which she helped create. In her book, \"Making a Miracle\" (1999), Hunter recounts the trials and tribulations she endured after being fired from Melrose Place (1992) for becoming pregnant, and her daughter Katya's subsequent battle with a rare form of eye cancer, \"Retinoblastoma\", at the age of three-months-old. She has a sister, Elizabeth, and a brother, Cliff. She became pregnant very young, with a son, Christopher, who was born around 1980. In the mid-1980s, she met future husband Michael Tylo while they both worked on the soap All My Children (1970). They had a son, Michael (nicknamed Mickey), who was born around 1987. Although their marriage suffered some problems, they managed to overcome them. In the mid-1990s, Hunter reaffirmed her belief in Christianity, and has become an active Christian. Hunter is a public speaker, giving messages of encouragement and hope for parents and families of children facing fatal childhood illnesses. In October of 2007, Hunter's son, Michael E. Tylo II, died as a result of epilepsy. Hunter is known as an advocate for working mothers. In 1998, she won a landmark case setting a precedent for the Pregnancy Discrimination Act, after being fired from Melrose Place (1992) for becoming pregnant. Hunter also works with \"Retinoblastoma International\", and her own charity, \"Hunter's Chosen Child\". Hunter has studied acting with Gene Frankel in New York, actor Alan Arkin, as well as Roy London and Ivana Chubbuck, in Los Angeles. Hunter's skills include dialects, martial arts, gourmet cooking, kick-boxing, mountain biking, snowboarding, and horseback riding.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNTUxMzI4MV5BMl5BanBnXkFtZTYwOTk0MzA1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0878950","name":"Hunter Tylo","idIMDB":"nm0878950"},"actorId":"nm0878950","character":"Amelia Lockhart","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeffrey Combs","urlProfile":"http://www.imdb.com/name/nm0001062","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3Njg1NDEzN15BMl5BanBnXkFtZTcwNTk4Nzg5MQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1954","placeOfBirth":" Oxnard, California, USA","birthName":"Jeffrey Alan Combs","height":"5' 7\" (1.7 m)","bio":"Jeffrey Combs was born on September 9th, 1954 in Oxnard, California. He grew up in Lompoc, California with a plethora of siblings both older and younger. He attended the Pacific Conservatory of the Performing Arts in Santa Maria, and the Professional Actor's Training Program at the University of Washington in Seattle. He spent about four years in regional theater performing at the Old Globe Theatre in San Diego, the Arizona Theatre Company in Tucson, the California Shakespearean Festival, the Mark Taper Forum in Los Angeles and the South Coast Repertory in Costa Mesa among others. In 1980 he moved to Los Angeles, where he lives with his family. As a horror film leading actor, Combs is probably best known for portraying Herbert West in the cult horror film Re-Animator (1985). Re-Animator was based on H.P. Lovecraft's famous novel brought together by Stuart Gordon and Brian Yuzna, the producer and financier of the film. Combs stayed in the realm of cult films with both Gordon and Yuzna to return when making From Beyond (1986), and Bride of Re-Animator (1989) also from Lovecraft novels. He has also been in some supporting roles in _Pit and the Pendulum, The (1990) (V)_, the strange FBI Agent with Michael J. Fox in Fantômes contre fantômes (1996), I Still Know What You Did Last Summer (1998) and the remake of the William Castle thriller, House on Haunted Hill (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3Njg1NDEzN15BMl5BanBnXkFtZTcwNTk4Nzg5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001062","name":"Jeffrey Combs","idIMDB":"nm0001062"},"actorId":"nm0001062","character":"Dr. Preston King","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elise Muller","urlProfile":"http://www.imdb.com/name/nm0612117","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NjEyMDE0OV5BMl5BanBnXkFtZTcwMzM2MzcwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 August 1967","placeOfBirth":" Northbrook, Illinois, USA","height":"5' 6½\" (1.69 m)","bio":"Elise Muller grew up in Northbrook, a suburb of Chicago. Elise graduated from The University of Arizona with a B.F.A. in Acting/Directing. Shortly thereafter, she started modeling and acting in Chicago. After receiving the opportunity to model in Japan, she instead set out for Los Angeles to pursue acting. In Los Angeles, Elise was immediately booked for guest starring roles in shows such as \"Baywatch Nights\", Malibu, CA (1998) and Diagnosis Murder (1993). Her first starring role was for producer Roger Corman in the film Lola's Game (1998). Muller went on to star in other films around the world - from Canada to Bulgaria to the Czech Republic. These film credits include a number of science fiction films, comedies and thrillers. Elise appeared opposite Academy Award Winner Mo'Nique in the 20th Century Fox comedy Phat Girlz (2006). Elise worked with directors Jay and Mark Duplass on the film Baghead (2008), as they cast Muller to star as 'Catherine'. The film went to the Sundance Film Festival and was picked up by Sony Pictures Classics. Later, Elise was chosen as a Series Regular in the popular Cable Comedy Series Canoga Park (2007) where she played the role of an Attorney named 'Katherine.' Elise had a very unique childhood starting with infancy. A month before her birth, Elise's father, Lt. Stephen Peter Muller USMC, was tragically killed in action during the Vietnam War on July 2, 1967, and her mother, Jane Muller; raised her as a single parent. Jane Muller served as a Peace Corp volunteer and taught English in the Philippines. Having a tremendous love of film, Jane strongly influenced Elise as a child when Elise first began to dream of a career in acting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NjEyMDE0OV5BMl5BanBnXkFtZTcwMzM2MzcwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0612117","name":"Elise Muller","idIMDB":"nm0612117"},"actorId":"nm0612117","character":"Jane Harper","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arthur Roberts","urlProfile":"http://www.imdb.com/name/nm0730838","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM5NTk1OTc2OF5BMl5BanBnXkFtZTgwODU0NTE0MDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1938","placeOfBirth":" New York City, New York, USA","height":"6' 2\" (1.88 m)","bio":"Arthur Roberts first fell in love with acting starring as Crichton in The Admirable Crichton at Fieldston, his New York City high school. The most beautiful girls in the class surrounding him after the curtain fell didn't hurt either!!! While Dean's List and on scholarship at Harvard, he found acting far more fun than studying pre-med - he thought, \" if I can just get them to pay me to do this...\" So off he went to learn his craft with the Harvard Summer Players with Faye Dunaway and Jane Alexander, and then Summer Stock all over the East Coast. At the Hampton Playhouse in New Hampshire, they paid $27 a week, which covered room and board. He then played the title roles in Mr. Roberts and Poor Richard in Pennsylvania, won the Barter Theatre award in a big New York competition for the famous Barter Theatre Virginia, did Streetcar Named Desire in Connecticut and Barefoot in the Park in Michigan, and starred in Neil Simon in Winter Rep in Buffalo and Pinter in Princeton. He got his Equity card playing in Othello with James Earl Jones and the New York Shakespeare Festival in Central Park. During all this, he got an MBA at NYU (a fallback option which thankfully he never used) with a prize-winning thesis \" On Why Good TV Series Stop Production and Go Off the Air.\" The prize money helped buy his first Chevy convertible, which he then drove down to Ft. Lauderdale, Florida to play the third lead, Lord Henry Darnley, husband and King to Inga Swenson's \"Mary,\" Queen of Scots in a pre-Broadway musical tryout. He then had a strong New York run playing Hank with the original cast of The Boys in the Band, starred on Broadway in the Tony-winning Borstal Boy, and won wide critical acclaim from all the New York critics as Karenin in Anna Karenina. On matinee days of Borstal Boy, he took great natural light headshots of fellow cast members with his Nikon and lifted his portrait photography hobby to a professional level. He starred in a wide range of intriguing independent films, enjoyed a run on the soap Secret Storm, did numerous commercials and print modeling for Wilhelmina. He sailed thru a Nova Scotia storm for Maxim Coffee - because he, the director and the DP were on deck sailing through rain, wind and storm, they were fine; the poor ad agency folk who mistakenly stayed below became quite seasick. Bodybuilding took him to walk the Bahamas beaches with a gorgeous bikini blonde for Bahamas Tourist Board TV and print ads. After traveling to Mexico, Greece and Europe, he came to LA in 1974 and soon guest starred in Starsky and Hutch, Barnaby Jones, The Rockford Files and enjoyed a run on General Hospital as James Duvall, the scientist who invented the Ice Princess at the height of the Luke and Laura excitement. He pitched for the General Hospital softball team and played celebrity tennis. Playing the title role in Not of This Earth proudly got him into The Academy of Motion Picture Arts and Sciences in 1988. This and other films, among them Revenge of the Ninja, rent worldwide and give him international recognition, as do the reruns of his many TV shows. He was a regular on the Lorenzo Lamas series Air America in 1998 -- 1999. He continues to work all over the world, shooting Gargoyle with Jim Wynorski in Bucharest, Romania, Hammerhead with William Forsythe and Hunter Tylo for Avi Lerner Nu Image six weeks in Bulgaria in 2004, the Nissan Versa product launch in Canada in 2006 and a commercial for Labatt's Canadian beer that was cast in LA and shot in Prague, Czech Republic -- go figure -- in 2007. On LA stages he has starred at the Mark Taper Forum, Los Angeles Theatre Center, and as Prospero in Shakespeare's The Tempest, a huge workout... it took five weeks to learn all the words. His most colorful recent credit was the sublime pleasure of working opposite Blythe Danner in \" I'll See You in My Dreams,\" Clips from that outrageous scene lead off his comedy demo reel. All the words were taken from a real-life speed dating situation A strong believer in the Greek ideal of mens sana in corpore sano - a sound mind in a sound body, he enjoys weight workouts, swimming, tennis, basketball, biking and hiking and absolutely loves playing beach volleyball in Manhattan Beach and Santa Monica. Often his group is the last one standing, the only people playing volleyball as far you can see up and down the beach, stopping only when it gets too cold or too dark, whichever comes first. An avid swimmer, he ran camp waterfronts in Maine during college summers and remembers the adventure of saving a sailor who overturned his catamaran in the Atlantic Ocean off Fire Island and was out way past where lifeguards would go... they said \" if you get in trouble out there, you're on your own... we won't come get you!!\" Arthur loves traveling and taking pictures on photo safaris to Kenya and Tanzania in 1999, in Thailand, Vietnam, and Hong Kong in 2000, Prague in 2007, a grand tour of China in 2008 - the Great Wall and shooting the Yangtze River Cruise were his favorites. Since then he toured Peru , Morocco, the Greek islands, Portugal and Spain. His absolute favorite for scenic photos was multi-colorful Italy: the Mediterranean hill towns of Cinque Terre and the incomparable experience of Venice. He has shared with his good friend and manager Phil Brock his love of framing and hanging the very best of his travel photos on the wall - so you live with your own self-made art. He loves cameras and helps friends pick out which one best to buy. He has taught Actors' Survival - How to Earn Your Living Acting -- at UCLA and Santa Monica College and enjoys giving powerful private coaching.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM5NTk1OTc2OF5BMl5BanBnXkFtZTgwODU0NTE0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0730838","name":"Arthur Roberts","idIMDB":"nm0730838"},"actorId":"nm0730838","character":"Whitney Feder","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lydie Denier","urlProfile":"http://www.imdb.com/name/nm0219106","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxODkxMzE1Ml5BMl5BanBnXkFtZTgwODQzODUxMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 April 1964","placeOfBirth":" Saint-Nazaire, Loire-Atlantique, France","height":"5' 7\" (1.7 m)","bio":"Lydie Denier was raised in Martinique and attended school at the Lycee Shoelcher in Fort de France, Martinique. She became a model at 14 years old. Her big break through as an actress was when she played the role of Jane in the TV series Tarzán (1991) from 1991 till 1993. Her TV debut was on General Hospital (1963) back in 1989 playing the role of Yasmine Bernoudi. Lydie is also an accomplished artist. She paints acrylic on canvas and her work has been sold both in Europe and America. She is also a writer and a producer. Her film company is Pathway Pictures in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxODkxMzE1Ml5BMl5BanBnXkFtZTgwODQzODUxMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0219106","name":"Lydie Denier","idIMDB":"nm0219106"},"actorId":"nm0219106","character":"Doctor Mendoveko","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"G.R. Johnson","urlProfile":"http://www.imdb.com/name/nm1943669","urlPhoto":"","biography":{"birthName":"Gregory Roger Johnson","bio":"G.R. Johnson was born as Gregory Roger Johnson. He is an actor, known for SharkMan (2005), Over the GW (2007) and Aaron Bacon (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1943669","name":"G.R. Johnson","idIMDB":"nm1943669"},"actorId":"nm1943669","character":"Bernie Amos","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Antony Argirov","urlProfile":"http://www.imdb.com/name/nm1512977","urlPhoto":"","biography":{"bio":"Antony Argirov is an actor, known for War Correspondent (2008), The Russian Specialist (2005) and Zift (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1512977","name":"Antony Argirov","idIMDB":"nm1512977"},"actorId":"nm1512977","character":"Hammerhead","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mariya Ignatova","urlProfile":"http://www.imdb.com/name/nm1800101","urlPhoto":"","biography":{"height":"5' 4\" (1.63 m)","bio":"Mariya Ignatova is an actress, known for Branded (2012), Dyuzhina pravosudiya (2007) and SharkMan (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1800101","name":"Mariya Ignatova","idIMDB":"nm1800101"},"actorId":"nm1800101","character":"Julie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Velizar Binev","urlProfile":"http://www.imdb.com/name/nm0082870","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMjUwOTk3OF5BMl5BanBnXkFtZTcwNzYyMTIzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 March 1967","placeOfBirth":" Sofia, Bulgaria","birthName":"Velizar Nikolaev Binev","height":"5' 10¾\" (1.8 m)","bio":"Educated at National Academy of Theatrical and Cinema Arts - Sofia, Bulgaria 1991 Master of Arts. Spoken languages: Bulgarian, English and Russian.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMjUwOTk3OF5BMl5BanBnXkFtZTcwNzYyMTIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0082870","name":"Velizar Binev","nicknames":["Zarko"],"idIMDB":"nm0082870"},"actorId":"nm0082870","character":"Dr. Krause","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Atanas Srebrev","urlProfile":"http://www.imdb.com/name/nm1284482","urlPhoto":"","biography":{"dateOfBirth":"19 April 1971","placeOfBirth":"","height":"6' 0¾\" (1.85 m)","bio":"Atanas Srebrev (born April 19, 1971) is a Bulgarian actor of strong supporting-role quality who trained at the National Academy of Theater and Film Arts in Sofia, Bulgaria. His versatility includes playing American characters mostly in noticeable supporting roles that feature him as a respectable good guy or as formidable heavies. Across the course of the 2000s and 2010s, Srebrev has been in numerous films ranging from action, horror to Sci-Fi with titles such as Behind Enemy Lines II: Axis of Evil (2006) and Undisputed 2: Last Man Standing (2006). Srebrev's credits include a vast assortment of creature-horror projects such as Locusts: The 8th Plague (2005), Basilisk: The Serpent King (2006), Copperhead (2008), Monster Ark (2008), Infestation (2009) and Lake Placid 3 (2010) all with varying supporting and leading-type roles. Due to his secondary education in the United States, Srebrev's fluency in English has provided him with constant work in American films. Because of his level of English-speaking ability, Srebrev is recognized as being the first Bulgarian actor to make his own way in Hollywood.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1284482","name":"Atanas Srebrev","nicknames":["Nasco"],"idIMDB":"nm1284482"},"actorId":"nm1284482","character":"Erik Anderson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pavel Doychev","urlProfile":"http://www.imdb.com/name/nm0236256","urlPhoto":"","biography":{"bio":"Pavel Doychev is known for his work on Kombina (1982), SharkMan (2005) and Vernymi ostanemsya (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0236256","name":"Pavel Doychev","idIMDB":"nm0236256"},"actorId":"nm0236256","character":"Captain Sheldon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emil Markov","urlProfile":"http://www.imdb.com/name/nm0548612","urlPhoto":"","biography":{"bio":"Emil Markov is known for his work on Undisputed 2: Last Man Standing (2006), Return to House on Haunted Hill (2007) and East/West (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0548612","name":"Emil Markov","idIMDB":"nm0548612"},"actorId":"nm0548612","character":"Engineer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yoanna Boukovska","urlProfile":"http://www.imdb.com/name/nm0099407","urlPhoto":"","biography":{"dateOfBirth":"8 April 1977","placeOfBirth":" Sofia, Bulgaria","bio":"Yoanna Boukovska was born on April 8, 1977 in Sofia, Bulgaria. She is an actress, known for My Wee Nothing (2007), Dunav most (1999) and War Correspondent (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0099407","name":"Yoanna Boukovska","idIMDB":"nm0099407"},"actorId":"nm0099407","character":"Female 2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nikolai Iliev","urlProfile":"http://www.imdb.com/name/nm1783365","urlPhoto":"","biography":{"bio":"Nikolai Iliev is an actor, known for Return to House on Haunted Hill (2007), Command Performance (2009) and Mansquito (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1783365","name":"Nikolai Iliev","idIMDB":"nm1783365"},"actorId":"nm1783365","character":"Man","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0459392","urlIMDB":"http://www.imdb.com/title/tt0459392","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"Equity Pictures Medienfonds GmbH &amp; CO. KG II (de)"},"technical":{"runtime":["1 hr 32 min (92 min)","1 hr 28 min (88 min) (DVD) (Germany)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"3.0","filmingLocations":[{"location":"Bulgaria"}],"rated":"R","awards":[],"votes":"1,396","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0024720","name":"Nu Image / Millennium Films"},{"idCompany":"co0136722","name":"Equity Pictures Medienfonds GmbH & Co. KG II"},{"idCompany":"co0098277","name":"Active Entertainment"}],"keywords":{"keywords":["scientist","island","sharksploitation","animal attack","killer shark","creature feature","shark","mad scientist","laboratory","human experiment","helicopter","genetic engineering","boat","shark attack"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 07:59:20"}}