{"data":{"movies":[{"title":"Invincible","originalTitle":"","year":"2006","releaseDate":"20060825","directors":[{"name":"Ericson Core","id":"nm0179697"}],"writers":[{"name":"Brad Gann","id":"nm1048533"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NjI2ODA5MF5BMl5BanBnXkFtZTcwNjMyMTMzMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Biography","Drama","Sport"],"plot":"In the sumer of 1976, 30-year old Vince Papale is having a tough run of luck. He's been working as a substitute teacher for two days a week but has just found out that his job has been eliminated because of budget cuts. His wife gives up on him saying he'll never amount to anything and asks for a divorce. He works as a bartender and plays football with his friends. When the the new coach of the Philadelphia Eagles, Dick Vermeil, announces that he will hold open tryouts for the team, Vince reluctantly decides to give a try. Based on a true story.","simplePlot":"Based on the story of Vince Papale, a 30-year-old bartender from South Philadelphia who overcame long odds to play for the NFL's Philadelphia Eagles in 1976.","actors":[{"actorName":"Mark Wahlberg","urlProfile":"http://www.imdb.com/name/nm0000242","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MjYwNTE2M15BMl5BanBnXkFtZTYwNTI0NjI1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 June 1971","placeOfBirth":" Dorchester, Boston, Massachusetts, USA","birthName":"Mark Robert Michael Wahlberg","height":"5' 8\" (1.73 m)","bio":"American actor Mark Wahlberg is one of a handful of respected entertainers who successfully made the transition from teen pop idol to acclaimed actor. A Best Supporting Actor Oscar nominee for The Departed (2006) who went on to receive positive critical reviews for his performance in The Fighter (2010), Wahlberg also is a solid comedy actor, proven by his starring role in Ted (2012). Mark Robert Michael Wahlberg was born June 5, 1971 in a poor working class district, Dorchester, of Boston, Massachusetts. He is the son of Alma Elaine (Donnelly), a nurse's aide and clerk, and Donald Edward Wahlberg, a delivery driver. Wahlberg is the youngest of nine children. He is of Irish, Swedish (from his paternal grandfather), and more distant French-Canadian, English, and Scottish, descent. The large Wahlberg brood didn't have a lot growing up, especially after his parents divorced when he was eleven. The kids crammed into a three bedroom apartment, none of them having very much privacy. Mark's mother has said that after the divorce, she became very self-absorbed with her own problems. She has blamed herself for her son's subsequent problems and delinquency. Wahlberg dropped out of high school at age 14 (but later got his GED) to pursue a life of petty crime and drugs. He'd spend his days scamming and stealing, working on the odd drug deal before treating himself to the substances himself. The young man also had a violent streak - one which was often aimed at minorities. At age sixteen, he was convicted of assault against two Vietnamese men after he had tried to rob them. As a result of his assault conviction, he was sentenced to serve 50 days in prison at Deer Island penitentiary. Whilst there, he began working out to pass time and, when he emerged at the end of his sentence, he had gone from being a scrawny young kid to a buff young man. Wahlberg also credits jail time as being his motivation to improve his lifestyle and leave crime behind him. Around this time, his older brother Donnie Wahlberg had become an overnight teen idol as a member of the 1980s boy band New Kids on the Block. A precursor to the boy-band craze, the group was dominating the charts and were on top of their game. Mark himself had been an original member of the band but had backed out early on - uncomfortable with the squeaky clean image of the group. Donnie used his connections in the music business to help his little brother secure a recording contract, and soon the world was introduced to Marky Mark and the Funky Bunch, with Wahlberg as a bad-boy rapper who danced in his boxers. Despite a lack of singing ability, promoters took to his dance moves and a physique they knew teenage girls would love. Donnie scripted some easy songs for Mark, who collected a troupe of dancers and a DJ to become his \"Funky Bunch\" and \"Marky Mark and the Funky Bunch\" was born. His debut album, \"Music for the People\", was a smash hit, which was propelled along by the rapper's willingness to disrobe down to boxer-briefs on stage, not to mention several catchy tunes. Teenage girls thrilled to the rapping \"bad boy\". Record producer David Geffen saw in Wahlberg a cash-cow of marketing ability. After speaking to designer Calvin Klein, Marky Mark was set up as the designer's chief underwear model. His scantily clad figure soon adorned billboards across the nation. Ironically, while the New Kids on the Block's fame was dwindling as audiences tired of their syrupy lyrics, \"Marky Mark's\" bad boy image was becoming even more of a commodity. He was constantly in the headlines (often of the tabloids) after multiple scandals. In 1992, he released a book dedicated to his penis. Wahlberg was constantly getting into rumored fights, most memorably with Madonna and her entourage at a Los Angeles party. While things were always intense, they were relatively harmless and made for enjoyable reading for the public. However, when the story of his arrest for assault (and the allegations of racism) broke in the press, things took on a decidedly darker note. People were not amused. Soon after, while on a British talk show along with rapper Shabba Ranks, he got into even more trouble. After Ranks made the statement that gays should be crucified, Wahlberg was accused of condoning the comments by his silence. Marky Mark was suddenly surrounded by charges of brutality, homophobia and racial hatred. His second album, \"You Gotta Believe\", had not been faring well and, after the charges surfaced, it plummeted from the charts. Adding to the hoopla, Wahlberg was brought to court for allegedly assaulting a security guard. He was ordered to make amends by appearing in a series of anti-bias advertisements. Humbled and humiliated by his fall from grace in the music world, Wahlberg decided to pursue another angle, acting. He dropped the \"Marky Mark\" moniker and became known simply as Mark Wahlberg. His first big screen role came in Penny Marshall's Renaissance Man (1994). Despite the name change, many people snickered at the idea of the has-been rapper thinking he could make it as an actor. From the get-go, he was proving them wrong. In Renaissance Man (1994), he gave an utterly charming performance as a simple but sincere army recruit. What naysayers remained found it increasingly difficult to write Mark Wahlberg off as he delivered one fine performance after another. He blew them away in the controversial The Basketball Diaries (1995) and chilled them in Fear (1996) as every father's worst nightmare. The major turning point in Wahlberg's career came with the role of troubled porn star Dirk Diggler in Paul Thomas Anderson's Boogie Nights (1997). Since then, Wahlberg has chosen roles that demonstrate a wide range of dramatic ability, starring in critically acclaimed dramas such as Three Kings (1999) and The Perfect Storm (2000), popcorn flicks like Planet of the Apes (2001) and Contraband (2012), and even indies such as I Heart Huckabees (2004). Wahlberg was the executive producer of such television series as Boardwalk Empire (2010), In Treatment (2008) and the highly successful comedy Entourage (2004), which was partly based on his experiences in Hollywood. Wahlberg and his wife Rhea Durham have four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MjYwNTE2M15BMl5BanBnXkFtZTYwNTI0NjI1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000242","name":"Mark Wahlberg","nicknames":["Marky Mark","Monk D"],"idIMDB":"nm0000242"},"actorId":"nm0000242","character":"Vince Papale","urlCharacter":"http://www.imdb.com/character/ch0018027","main":true},{"actorName":"Greg Kinnear","urlProfile":"http://www.imdb.com/name/nm0001427","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNzE5MDM1NV5BMl5BanBnXkFtZTcwMTAzMjM3NA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 June 1963","placeOfBirth":" Logansport, Indiana, USA","birthName":"Gregory B. Kinnear","height":"5' 10\" (1.78 m)","bio":"Greg Kinnear was born on June 17, 1963, in Logansport, Indiana, USA to Edward Kinnear, a career diplomat with the US State Department, and Suzanne (Buck) Kinnear, a homemaker. Greg has two brothers--James, vice president-investments at Wachovia Securities in Arizona who was born in 1957, and Steve, a business manager with the Billy Graham Training Center in North Carolina who was born in 1959. His family moved often, including Lebanon and Greece. While a student in Athens, Greg first ventured into the role of talk show host with his radio show \"School Daze With Greg Kinnear.\" Returning to college in the States, he attended the University of Arizona in Tucson, graduating in 1985 with a degree in broadcast journalism. He headed out to Los Angeles, landing his first job as a marketing assistant with Empire Entertainment. He auditioned to be an MTV VJ, but was not selected and became an on-location reporter for the channel. He had bit parts on L.A. Law (1986) and Life Goes On (1989). He would later become the creator, co-executive producer, and host of Best of the Worst (1991), which aired from 1990 to 1991. His breakthrough was as first host of Talk Soup (1991) from 1994-1994, when he left the show for the NBC late-night talk show, Later (1994). In 1994, Kinnear had his first big screen role, as a talk show host in the Damon Wayans comedy Blankman (1994). In 1995 he won the role of David Larrabee in Sydney Pollack's remake of Billy Wilder's 1954 classic Sabrina (1995). Next was the lead in the 1996 comedy Dear God (1996). In 1997, Greg was cast in James L. Brooks's blockbuster comedy-drama As Good as It Gets (1997), receiving an Oscar nomination as best supporting actor. In his next film, the romantic comedy A Smile Like Yours (1997), he starred opposite Lauren Holly as part of a couple trying to have a baby. The film met with lukewarm reviews and a low box office. His next film, You've Got Mail (1998), struck gold. He played Meg Ryan's significant other, a newspaper columnist. Next he played Captain Amazing in Mystery Men (1999). His more recent films have Nurse Betty (2000), Loser (2000), and Someone Like You... (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNzE5MDM1NV5BMl5BanBnXkFtZTcwMTAzMjM3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001427","name":"Greg Kinnear","idIMDB":"nm0001427"},"actorId":"nm0001427","character":"Dick Vermeil","urlCharacter":"http://www.imdb.com/character/ch0018029","main":true},{"actorName":"Elizabeth Banks","urlProfile":"http://www.imdb.com/name/nm0006969","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMTcxNDU3NV5BMl5BanBnXkFtZTcwOTE0MzEzNw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1974","placeOfBirth":" Pittsfield, Massachusetts, USA","birthName":"Elizabeth Maresal Mitchell","height":"5' 4½\" (1.64 m)","bio":"Elizabeth Banks was born Elizabeth Mitchell in Pittsfield, a small city in the Berkshires in western Massachusetts near the New York border, on February 10, 1974. She is the daughter of Ann (Wallace), who worked in a bank, and Mark P. Mitchell, a factory worker. Elizabeth describes herself as having been seen as a \"goody two-shoes\" in her youth who was nominated for the local Harvest Queen. Banks left home to attend college at the University of Pennsylvania--from which she graduated Magna cum Laude--and went on to attend the Advanced Training Program at the prestigious American Conservatory Theater in San Francisco, graduating in 1996. She then moved to New York and worked in the theater, and began getting small roles in films and on television. Seeking more screen work, she moved to Los Angeles and was soon cast in supporting roles. She also had to change her last name, to Banks, in order to avoid confusion with actress Elizabeth Mitchell. Her breakthrough role was as Betty Brant, the secretary of the cantankerous newspaper tycoon in Sam Raimi's Spider-Man (2002). She followed up this performance with small roles in other movies: Swept Away (2002), Steven Spielberg's Catch Me If You Can (2002), Seabiscuit (2003) and The 40-Year-Old Virgin (2005). In 2003 she won the Exciting New Face Award at the Young Hollywood Awards. The winsome, beautiful Banks projected an exceptionally charming screen presence that drew comparisons to Audrey Hepburn, and Hollywood eventually began to take notice, Banks being cast in the lead in such films as Kevin Smith's Zack and Miri Make a Porno (2008) and in Oliver Stone's biopic of George W. Bush, W. (2008), as Laura Bush. In television Banks was a recurring guest star on Scrubs (2001) as Dr. Kim Briggs, the love interest of Zach Braff's J.D. In 2010 she was cast as Alec Baldwin's love interest in season four of 30 Rock (2006). Originally scheduled to appear in only four episodes, she was brought back as a recurring character for two more seasons, and earned Emmy nominations for Outstanding Guest Actress in a Comedy Series for two consecutive years. Banks has more recently appeared in such films as Our Idiot Brother (2011), Man on a Ledge (2012), What to Expect When You're Expecting (2012), People Like Us (2012), and Pitch Perfect (2012). She also won the coveted role as Effie Trinket in The Hunger Games (2012) and The Hunger Games: Catching Fire (2013). Banks married Max Handelman, a sports writer and producer, in 2003. They have two sons, Felix, who was born in March 2011, and Magnus, born in Nov. 2012, both by gestational surrogacy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMTcxNDU3NV5BMl5BanBnXkFtZTcwOTE0MzEzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006969","name":"Elizabeth Banks","idIMDB":"nm0006969"},"actorId":"nm0006969","character":"Janet Cantrell","urlCharacter":"http://www.imdb.com/character/ch0018028","main":true},{"actorName":"Kevin Conway","urlProfile":"http://www.imdb.com/name/nm0176723","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxNzgxODMwNTVeQTJeQWpwZ15BbWU3MDM3NTQyMzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 May 1942","placeOfBirth":" New York City, New York, USA","birthName":"Kevin John Conway","height":"5' 6\" (1.68 m)","bio":"Kevin Conway was born on May 29, 1942 in New York City, New York, USA as Kevin John Conway. He is an actor and director, known for One Life to Live (1968), Invincible (2006) and Mort ou vif (1995). He has been married to Mila Burnette since April 15, 1966.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxNzgxODMwNTVeQTJeQWpwZ15BbWU3MDM3NTQyMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0176723","name":"Kevin Conway","idIMDB":"nm0176723"},"actorId":"nm0176723","character":"Frank Papale","urlCharacter":"http://www.imdb.com/character/ch0145950","main":true},{"actorName":"Michael Rispoli","urlProfile":"http://www.imdb.com/name/nm0728346","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MTI2Mjc3OV5BMl5BanBnXkFtZTcwMzAxNjE5Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 November 1960","placeOfBirth":" Tappan, New York, USA","birthName":"Michael Vincent Rispoli","bio":"Michael Rispoli was born on November 27, 1960 in Tappan, New York, USA as Michael Vincent Rispoli. He is an actor and writer, known for Kick-Ass (2010), The Rum Diary (2011) and The Taking of Pelham 123 (2009). He is married to Madeline. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MTI2Mjc3OV5BMl5BanBnXkFtZTcwMzAxNjE5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0728346","name":"Michael Rispoli","idIMDB":"nm0728346"},"actorId":"nm0728346","character":"Max Cantrell","urlCharacter":"http://www.imdb.com/character/ch0145951","main":true},{"actorName":"Kirk Acevedo","urlProfile":"http://www.imdb.com/name/nm0009716","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MzE3MTU4NV5BMl5BanBnXkFtZTcwMTMyODYyNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 November 1971","placeOfBirth":" Brooklyn, New York, USA","birthName":"Kirk M. Acevedo","height":"5' 8½\" (1.74 m)","bio":"Born and raised in the Bronx, and spent most of his formative years hanging out in New York City, Kirk Acevedo, who is of Puerto Rican descent, received his BFA from SUNY Purchase and founded a theater company called The Rorschach Group. After guest-starring on several television shows like New York Undercover (1994) and Law & Order (1990), he landed his best-known role as Alvarez, a morose and violent prisoner struggling for redemption on HBO's notoriously gritty Oz (1997). Though he was nominated for a Cable Ace award and an ALMA award for his work on Oz (1997), it was Acevedo's role as Pvt. Tella in The Thin Red Line (1998) that won him an ALMA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MzE3MTU4NV5BMl5BanBnXkFtZTcwMTMyODYyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0009716","name":"Kirk Acevedo","idIMDB":"nm0009716"},"actorId":"nm0009716","character":"Tommy","urlCharacter":"http://www.imdb.com/character/ch0145952","main":true},{"actorName":"Dov Davidoff","urlProfile":"http://www.imdb.com/name/nm1359330","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODM5MTg2MzI3OF5BMl5BanBnXkFtZTYwNzM1MTg3._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Dov Davidoff is an actor and writer, known for Invincible (2006), Dov Davidoff: Filthy Operation (2010) and Chelsea Lately (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODM5MTg2MzI3OF5BMl5BanBnXkFtZTYwNzM1MTg3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1359330","name":"Dov Davidoff","idIMDB":"nm1359330"},"actorId":"nm1359330","character":"Johnny","urlCharacter":"http://www.imdb.com/character/ch0145953","main":true},{"actorName":"Michael Kelly","urlProfile":"http://www.imdb.com/name/nm0446672","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyOTMwNTM1MV5BMl5BanBnXkFtZTgwNzUxODA1NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 May 1969","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Michael Joseph Kelly","height":"5' 10\" (1.78 m)","bio":"Michael was born in Philadelphia but raised in Lawrenceville, Georgia by parents Michael and Maureen Kelly. He has two sisters, Shannon and Casey, and one brother, Andrew. He went to college at Coastal Carolina University in South Carolina with the original intention to study law, but changed his mind after taking an acting elective. In addition to acting, Michael is a musician and very athletic. He is a lifetime member of the Actor's Studio. He now lives and works out of New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyOTMwNTM1MV5BMl5BanBnXkFtZTgwNzUxODA1NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0446672","name":"Michael Kelly","idIMDB":"nm0446672"},"actorId":"nm0446672","character":"Pete","urlCharacter":"http://www.imdb.com/character/ch0145954","main":true},{"actorName":"Sal Darigo","urlProfile":"http://www.imdb.com/name/nm1065035","urlPhoto":"","biography":{"dateOfBirth":"17 October 1940","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"5' 10\" (1.78 m)","bio":"Sal Darigo was born in Philadelphia, Pennsylvania on 17 October 1940. He was a police officer in Philadelphia for 20 years from 1965 to 1985; and served four years in the United States Air Force from 1960 to 1964. He worked as playwright, actor, producer, director of one indie short.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1065035","name":"Sal Darigo","idIMDB":"nm1065035"},"actorId":"nm1065035","character":"Mick","urlCharacter":"http://www.imdb.com/character/ch0145955","main":true},{"actorName":"Nicoye Banks","urlProfile":"http://www.imdb.com/name/nm1072565","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MjQzNzYxNV5BMl5BanBnXkFtZTgwMjMwNTUwMDI@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"bio":"Nicoye Banks is known for his work on Green Zone (2010), Invincible (2006) and Focus (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MjQzNzYxNV5BMl5BanBnXkFtZTgwMjMwNTUwMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1072565","name":"Nicoye Banks","idIMDB":"nm1072565"},"actorId":"nm1072565","character":"TJ Banks","urlCharacter":"http://www.imdb.com/character/ch0145956","main":true},{"actorName":"Turron Kofi Alleyne","urlProfile":"http://www.imdb.com/name/nm2123247","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4NjI4MTczMDleQTJeQWpwZ15BbWU4MDcyOTcyMTkx._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Turron Kofi Alleyne is an actor, known for Invincible (2006), Red Hook Summer (2012) and Finding Her (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4NjI4MTczMDleQTJeQWpwZ15BbWU4MDcyOTcyMTkx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2123247","name":"Turron Kofi Alleyne","idIMDB":"nm2123247"},"actorId":"nm2123247","character":"Ronnie Sampson","urlCharacter":"http://www.imdb.com/character/ch0145957","main":true},{"actorName":"Cosmo DeMatteo","urlProfile":"http://www.imdb.com/name/nm2364277","urlPhoto":"","biography":{"bio":"Cosmo DeMatteo is an actor, known for Invincible (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2364277","name":"Cosmo DeMatteo","idIMDB":"nm2364277"},"actorId":"nm2364277","character":"Dean German","urlCharacter":"http://www.imdb.com/character/ch0145958","main":true},{"actorName":"Stink Fisher","urlProfile":"http://www.imdb.com/name/nm0279390","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNjk0ODk3Ml5BMl5BanBnXkFtZTcwNjQ3NzY5Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1970","placeOfBirth":" Cherry Hill, New Jersey, USA","height":"6' 2\" (1.88 m)","bio":"Stink Fisher was born on July 30, 1970 in Cherry Hill, New Jersey, USA. He is known for his work on The Lovely Bones (2009), Invincible (2006) and The Longest Yard (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNjk0ODk3Ml5BMl5BanBnXkFtZTcwNjQ3NzY5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0279390","name":"Stink Fisher","idIMDB":"nm0279390"},"actorId":"nm0279390","character":"Denny Franks","urlCharacter":"http://www.imdb.com/character/ch0145959","main":true},{"actorName":"Michael Mulheren","urlProfile":"http://www.imdb.com/name/nm0611820","urlPhoto":"","biography":{"height":"6' 2\" (1.88 m)","bio":"Michael Mulheren is an actor, known for Fool's Gold (2008), Invincible (2006) and Bringing Out the Dead (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0611820","name":"Michael Mulheren","idIMDB":"nm0611820"},"actorId":"nm0611820","character":"AC Craney","urlCharacter":"http://www.imdb.com/character/ch0145960","main":true},{"actorName":"Michael Nouri","urlProfile":"http://www.imdb.com/name/nm0636694","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNDQxMjI2NV5BMl5BanBnXkFtZTcwMjkxNTE2Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 December 1945","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Michael David Nouri","height":"6' 3\" (1.91 m)","bio":"Michael Nouri was born on December 9, 1945 in Washington, District of Columbia, USA as Michael David Nouri. He is an actor, known for Flashdance (1983), The Proposal (2009) and The Terminal (2004). He was previously married to Vicki Light and Lynn Goldsmith.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNDQxMjI2NV5BMl5BanBnXkFtZTcwMjkxNTE2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0636694","name":"Michael Nouri","idIMDB":"nm0636694"},"actorId":"nm0636694","character":"Leonard Tose","urlCharacter":"http://www.imdb.com/character/ch0145961","main":true}],"seasons":[],"idIMDB":"tt0445990","urlIMDB":"http://www.imdb.com/title/tt0445990","business":{"budget":{"money":"$40,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$17,031,122","country":"USA","day":"27","month":"08","year":"2006","remarks":"2,917 Screens"}],"gross":[{"money":"$57,789,574","country":"USA","day":"12","month":"11","year":"2006","remarks":""},{"money":"$57,689,970","country":"USA","day":"05","month":"11","year":"2006","remarks":""},{"money":"$57,530,763","country":"USA","day":"29","month":"10","year":"2006","remarks":""},{"money":"$57,375,922","country":"USA","day":"22","month":"10","year":"2006","remarks":""},{"money":"$57,276,091","country":"USA","day":"15","month":"10","year":"2006","remarks":""},{"money":"$57,011,536","country":"USA","day":"08","month":"10","year":"2006","remarks":""},{"money":"$56,322,748","country":"USA","day":"01","month":"10","year":"2006","remarks":""},{"money":"$54,696,472","country":"USA","day":"24","month":"09","year":"2006","remarks":""},{"money":"$51,121,579","country":"USA","day":"17","month":"09","year":"2006","remarks":""},{"money":"$45,500,634","country":"USA","day":"10","month":"09","year":"2006","remarks":""},{"money":"$38,068,213","country":"USA","day":"03","month":"09","year":"2006","remarks":""},{"money":"$17,031,122","country":"USA","day":"27","month":"08","year":"2006","remarks":""}],"weekendGross":[{"money":"$55,439","country":"USA","day":"12","month":"11","year":"2006","remarks":"118 Screens"},{"money":"$103,124","country":"USA","day":"05","month":"11","year":"2006","remarks":"227 Screens"},{"money":"$132,339","country":"USA","day":"29","month":"10","year":"2006","remarks":"299 Screens"},{"money":"$51,121","country":"USA","day":"22","month":"10","year":"2006","remarks":"119 Screens"},{"money":"$126,968","country":"USA","day":"15","month":"10","year":"2006","remarks":"215 Screens"},{"money":"$392,309","country":"USA","day":"08","month":"10","year":"2006","remarks":"551 Screens"},{"money":"$1,057,294","country":"USA","day":"01","month":"10","year":"2006","remarks":"1,357 Screens"},{"money":"$2,546,945","country":"USA","day":"24","month":"09","year":"2006","remarks":"2,331 Screens"},{"money":"$4,114,921","country":"USA","day":"17","month":"09","year":"2006","remarks":"2,830 Screens"},{"money":"$5,630,126","country":"USA","day":"10","month":"09","year":"2006","remarks":"2,987 Screens"},{"money":"$15,427,370","country":"USA","day":"03","month":"09","year":"2006","remarks":"2,921 Screens"},{"money":"$17,031,122","country":"USA","day":"27","month":"08","year":"2006","remarks":"2,917 Screens"}],"admissions":[],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"27","month":"07","year":"2005","remarks":null},null],"copyrightHolder":"Disney Enterprises, Inc."},"technical":{"runtime":["1 hr 45 min (105 min)"],"soundMix":["SDDS","DTS","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["Technicolor, Hollywood (CA), USA (prints)"],"filmLength":null,"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)","D-Cinema"]},"rating":"7.1","metascore":"63","filmingLocations":[{"location":"East Passyunk ave and South Juniper street Philadelphia, Pennsylvania, USA"}],"rated":"PG","awards":[{"award":"ESPY Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated ESPY","categories":[{"category":"Best Sports Movie","names":[]}]}]},{"award":"MTV Movie Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Best Kiss","names":[{"name":"Mark Wahlberg","id":"nm0000242","role":null},{"name":"Elizabeth Banks","id":"nm0006969","role":null}]}]}]}],"votes":"54,126","type":"Movie","companyCreditsSimple":[{"idCompany":"co0008970","name":"Walt Disney Pictures"},{"idCompany":"co0093869","name":"Mayhem Pictures"},{"idCompany":"co0160327","name":"Who's Nuts Productions"}],"keywords":{"keywords":["philadelphia eagles","tryouts","30 year old","bartender","football","south philadelphia","divorce","substitute teacher","teacher","ends with biographical notes","what happened to epilogue","football movie","rainstorm","new york giants football","loss of mother","cousin","hometown hero","ends with real life footage","watching football on tv","overhead camera shot","kiss on the lips","shut up with kiss","training camp","car won't start","wife leaves husband","character appears on tv","watching self on tv","appeared on tv news","jogging","reference to santa claus","determination","underdog","against the odds","money problems","rags to riches","one word title","giving a toast","snow","breaking furniture","parking lot","car breakdown","athletic training","running","african american","speech","chicken soup","bandage","picket line","illness","restaurant","cafe","factory closing","factory","pay phone","mirror","working class","neighbor","cincinnati bengals","playing pool","curfew","home movie","cross","sex","jukebox","labor strike","interview","microphone","tv reporter","tv announcer","mother daughter relationship","father daughter relationship","slow motion scene","father son relationship","mother son relationship","boyfriend girlfriend relationship","jealousy","tv camera","flash forward","fight","school principal","bar","family relationships","brother brother relationship","urination","beer","locker room","marriage","amateur football player","athlete","friendship","unemployment","football coach","lifting someone into the air","director also cinematographer","national football league","philadelphia pennsylvania","1970s","american football"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:32:57"}}