{"data":{"movies":[{"title":"Tarzan 2","originalTitle":"Tarzan II","year":"2005","releaseDate":"20050613","directors":[{"name":"Brian Smith","id":"nm0807531"}],"writers":[{"name":"Edgar Rice Burroughs","id":"nm0123194"},{"name":"Jim Kammerud","id":"nm0436851"}],"runtime":"72 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkxNjYzMTY1M15BMl5BanBnXkFtZTcwNTU3ODgyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation","Adventure","Comedy","Family"],"plot":"Set back when Tarzan was just a boy, this is the story of Tarzan's journey to self-discovery. When Tarzan begins to see that he is not like the other gorillas, his mother Kala assures him that these slight differences only make him stronger. But when these differences put Kala in danger, he decides everyone would be better off without him and runs away. He then finds himself in a dark desolate land called Dark Mountain where he meets a new friend who helps him discover that even though he does not possess the talents of an ape, he has his own unique set of jungle skills that make him even more amazing than any other creature so that he can finally see who he truly is.","simplePlot":"The tale of Tarzan's misadventures as a boy as he searches for his true identity and the meaning of family.","actors":[{"actorName":"Harrison Chad","urlProfile":"http://www.imdb.com/name/nm1144472","urlPhoto":"","biography":{"dateOfBirth":"17 July 1992","placeOfBirth":" New York City, New York, USA","bio":"Harrison Chad was born on July 17, 1992 in New York City, New York, USA. He is an actor, known for Dora l'exploratrice (2000), Tarzan 2 (2005) and Charlotte's Web 2: Wilbur's Great Adventure (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1144472","name":"Harrison Chad","idIMDB":"nm1144472"},"actorId":"nm1144472","character":"Tarzan","urlCharacter":"http://www.imdb.com/character/ch0007728","main":true},{"actorName":"George Carlin","urlProfile":"http://www.imdb.com/name/nm0137506","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODgzNTk0NV5BMl5BanBnXkFtZTcwNjU1MjY3MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1937","placeOfBirth":" New York City, New York, USA","birthName":"George Denis Patrick Carlin","height":"5' 9\" (1.75 m)","bio":"Born and raised by his mother in Manhattan, New York City. His parents divorced when he was two months. His mother (as well as his father) worked in marketing, where they met. The long hours the mother worked left the young George by himself for long hours every day, providing him (in his own words), the time he needed to think about various subjects, listen to radio, and practice his impersonations, that where acclaimed by his mother and coworkers since an early age. Carlin started out as a conventional comedian and had achieved a fair degree of success as a Bill Cosby style raconteur in nightclubs and on TV until the late 1960s, when he radically overhauled his persona. His routines became more insightful, introducing more serious subjects. As he aged, he became more cynic and bitter, unintentionally changing his stage persona again in a radical way throughout the 90s. This new George Carlin, usually referred to as the late George Carlin, is one of the most acclaimed and enjoyed by the public and critics. Carlin's forte is Lenny Bruce-style social and political commentary, spiced with nihilistic observations about people and religion peppered with black humor. He is also noted for his masterful knowledge and use of the English language. Carlin's notorious \"Seven Dirty Words\" comedy routine was part of a radio censorship case that made its way to the U.S. Supreme Court in 1978.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODgzNTk0NV5BMl5BanBnXkFtZTcwNjU1MjY3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0137506","name":"George Carlin","nicknames":["Georgie Porgie","Curious George"],"idIMDB":"nm0137506"},"actorId":"nm0137506","character":"Zugor","urlCharacter":"http://www.imdb.com/character/ch0257486","main":true},{"actorName":"Brad Garrett","urlProfile":"http://www.imdb.com/name/nm0004951","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMjYyMjYxNF5BMl5BanBnXkFtZTgwNzE0MDU3ODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 April 1960","placeOfBirth":" Woodland Hills, Los Angeles, California, USA","birthName":"Brad H. Gerstenfeld","height":"6' 8½\" (2.04 m)","bio":"Standing 6 feet 8-1/2 inches tall, Garrett grew up in Woodland Hills outside of Los Angeles. His father was a hearing aid specialist working in geriatrics and his mother was a housewife. Garrett spent a whopping six weeks at UCLA before going into stand-up comedy full time. He began performing his act at various Los Angeles comedy clubs, getting his start at the Ice House in Pasadena and the Improv in Hollywood. In 1984, he became the first $100,000 grand champion winner in the comedy category of Star Search (1983). This led to his first appearance, at age 23, on The Tonight Show Starring Johnny Carson (1962), making him one of the youngest comedians ever to perform on the show. In 1986, Garrett told a joke the talent booker warned him against and he hasn't been on the show since. Following his \"Tonight Show\" appearance, Garrett's career took off, garnering him headlining gigs at several national venues as well as opening spots for legends including Diana Ross and Liza Minnelli. He has headlined at Bally's Park Place and co-headlined with The Temptations at Trump Plaza. He has also worked at The Sands Hotel in Las Vegas with Frank Sinatra, Caesar's Palace with David Copperfield, and Smokey Robinson, Harrah's with Sammy Davis Jr. and The Beach Boys, and Radio City Music Hall with Julio Iglesias. In 1989, the Las Vegas Review Journal named him the Best Comedian working on the strip. Changing gears, he made his way into the world of television. He struck gold with Everybody Loves Raymond (1996). Apart from his supporting role in sitcoms, he has also done voice-overs and appeared in a few films. In 1998, Garrett made a real-life proposal to his then real-life girlfriend, Jill Diven, on the set of Everybody Loves Raymond (1996). Garrett currently resides in Hollywood, California with his two Labradors Retrievers, Gus and Mabel.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMjYyMjYxNF5BMl5BanBnXkFtZTgwNzE0MDU3ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004951","name":"Brad Garrett","idIMDB":"nm0004951"},"actorId":"nm0004951","character":"Uto","urlCharacter":"http://www.imdb.com/character/ch0257488","main":true},{"actorName":"Ron Perlman","urlProfile":"http://www.imdb.com/name/nm0000579","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzAzMTEyOV5BMl5BanBnXkFtZTcwNjYwMzYwNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 April 1950","placeOfBirth":" New York City, New York, USA","birthName":"Ronald Francis Perlman","height":"6' 1\" (1.85 m)","bio":"Ron Perlman is a classically-trained actor who has appeared in countless stage plays, feature films and television productions. Ronald N. Perlman was born April 13, 1950 in Washington Heights, Manhattan, New York. His mother, Dorothy (Rosen), is retired from the City Clerk's Office. His father, Bertram \"Bert\" Perlman, now deceased, was a repairman and a drummer. His parents were both from Jewish families (from Hungary, Germany and Poland). With a career spanning over three decades, Perlman has worked alongside such diverse actors as Marlon Brando, Sean Connery, Dominique Pinon, Brad Dourif, Ed Harris, John Hurt, Jude Law, Christina Ricci, Federico Luppi, Sigourney Weaver, Michael Wincott and Elijah Wood to name a few. While he has never been a bankable star, Perlman has always had a large fanbase. He started out strong as Amoukar, one of the tribesmen in Jean-Jacques Annaud's Academy Award-winning film Quest for Fire (1981), for which he earned a Genie Award nomination. Perlman teamed up with Annaud again, this time as a hunchback named Salvatore in The Name of the Rose (1986). His first real breakthrough came later when he landed the role of the noble lion-man Vincent, opposite Linda Hamilton on the fantasy series Beauty and the Beast (1987). His work in this role earned him not only a Golden Globe Award but an underground fan following. Sadly the series was cancelled in its third season shortly after Hamilton's character's death. After that, he spent time doing supporting work on television and independent films such as Guillermo del Toro's debut Cronos (1993) (where a lifelong friendship and collaboration between the director and Perlman would blossom) as Angel and his first lead role as One in Jean-Pierre Jeunet's surreal The City of Lost Children (1995). His first real big role in a mainstream film came when Jeunet wanted him for the brutish Johner in his first Hollywood outing Alien: Resurrection (1997). Perlman has also used his distinctive voice to his advantage, appearing in many animated films/series, commercials and he is a video game fan favorite because of his work on such games as the Fallout series. It was not until much later he received worldwide fame when his good friend Guillermo del Toro helped him land the title role in the big-budget comic book movie Hellboy (2004). Del Toro fought the studio for four years because they wanted a more secure name, but he stood his ground and in 2004, after almost 25 years in and out of obscurity, Perlman became and household name and a sought out actor. Perlman has had one of the most offbeat careers in film, playing everything from a prehistoric ape-man to an aging transsexual and will always be a rarity in Hollywood. Other notable roles include the cunning Norman Arbuthnot in The Last Supper (1995), sniper expert Koulikov in Enemy at the Gates (2001), vampire leader Reinhardt in Blade II (2002), his reprisal of Hellboy in Hellboy II: The Golden Army (2008) and biker chief Clarence Morrow on the popular series Sons of Anarchy (2008). He currently resides in Los Angeles, California with his wife, Opal, and their two children, Blake and Brandon.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzAzMTEyOV5BMl5BanBnXkFtZTcwNjYwMzYwNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000579","name":"Ron Perlman","idIMDB":"nm0000579"},"actorId":"nm0000579","character":"Kago","urlCharacter":"http://www.imdb.com/character/ch0080040","main":true},{"actorName":"Estelle Harris","urlProfile":"http://www.imdb.com/name/nm0364680","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM0NTY2MzI0Nl5BMl5BanBnXkFtZTcwOTMzMzIzMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1928","placeOfBirth":" New York City, New York, USA","birthName":"Estelle Nussbaum","height":"5' 2\" (1.57 m)","bio":"Estelle Harris was born on April 4, 1928 in New York City, New York, USA as Estelle Nussbaum. She is an actress, known for Toy Story 3 (2010), Toy Story 2 (1999) and Stand and Deliver (1988). She has been married to Sy Harris since 1954. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM0NTY2MzI0Nl5BMl5BanBnXkFtZTcwOTMzMzIzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0364680","name":"Estelle Harris","idIMDB":"nm0364680"},"actorId":"nm0364680","character":"Mama Gunda","urlCharacter":"http://www.imdb.com/character/ch0257493","main":true},{"actorName":"Glenn Close","urlProfile":"http://www.imdb.com/name/nm0000335","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwNDk5MTU2NTNeQTJeQWpwZ15BbWU3MDczNjEzMTM@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 March 1947","placeOfBirth":" Greenwich, Connecticut, USA","height":"5' 5\" (1.65 m)","bio":"Six time Academy Award-nominated actress Glenn Close was born and raised in Greenwich, Connecticut. She is the daughter of Elizabeth Mary Hester \"Bettine\" (Moore) and William Taliaferro Close (William Close), a prominent doctor. Both of her parents were from upper-class northeastern families. Glenn was often seen on Broadway until 1982 when she was cast in her award winning role as Jenny Fields in The World According to Garp (1982) alongside Robin Williams. For this role, a breakthrough in film for Close, she later went on to receive an Academy Award Nomination for Best Supporting Actress. The following year she was cast in the hit comedy The Big Chill (1983) for which she received a second Oscar Nomination, once again for Supporting Actress in the role of Sarah Cooper. In her third film, Close portrayed Iris Gaines a former lover of baseball player Roy Hobbs portrayed by Robert Redford, in one of the greatest sports films of all time, The Natural (1984). For a third and final time, Close was nominated for the Academy Award for Best Actress in a Supporting Role. Close went on to star in films like The Stone Boy (1984), Maxie (1985) and Jagged Edge (1985). In 1987 Close was cast in the box office hit Fatal Attraction (1987) for which she portrayed deranged stalker Alex Forrest alongside costars Michael Douglas and Anne Archer. For this role she was nominated for the Academy Award and Golden Globe for Best Actress. The following year Close starred in the Oscar Winning Drama Dangerous Liaisons (1988) for which she portrayed one of the most classic roles of all time as Marquise Isabelle de Merteuil, starring alongside John Malkovich and Michelle Pfeiffer. For this role she was nominated once again for the Academy Award and BAFTA Film Award for Best Actress. Close was favorite to win the coveted statue but lost to Jodie Foster for Les accusés (1988). Close had her claim to fame in the 1980s. Close starred on the hit Drama series Damages (2007) for which she has won a Golden Globe Award and two Emmy Awards. In her career Close has been Oscar nominated six times, won three Tonys, an Obie, three Emmys, two Golden Globes and a Screen Actors Guild Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwNDk5MTU2NTNeQTJeQWpwZ15BbWU3MDczNjEzMTM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000335","name":"Glenn Close","nicknames":["Glennie"],"idIMDB":"nm0000335"},"actorId":"nm0000335","character":"Kala","urlCharacter":"http://www.imdb.com/character/ch0007725","main":true},{"actorName":"Lance Henriksen","urlProfile":"http://www.imdb.com/name/nm0000448","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkwOTMyMDEzN15BMl5BanBnXkFtZTcwMjk4NTUyMg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1940","placeOfBirth":" New York City, New York, USA","birthName":"Lance James Henriksen","height":"5' 10¼\" (1.79 m)","bio":"An intense, versatile actor as adept at playing clean-cut FBI agents as he is psychotic motorcycle-gang leaders, who can go from portraying soulless, murderous vampires to burned-out, world-weary homicide detectives, Lance Henriksen has starred in a variety of films that have allowed him to stretch his talents just about as far as an actor could possibly hope. He played \"Awful Knoffel\" in the TNT original movie Evel Knievel (2004), directed by John Badham and executive produced by Mel Gibson. Henriksen portrayed \"Awful Knoffel\" in this project based on the life of the famed daredevil, played by George Eads. Henriksen starred for three seasons (1996-1999) on Millennium (1996), Fox-TV's critically acclaimed series created by Chris Carter (The X-Files (1993)). His performance as Frank Black, a retired FBI agent who has the ability to get inside the minds of killers, landed him three consecutive Golden Globe nominations for \"Best Performance by a Lead Actor in a Drama Series\" and a People's Choice Award nomination for \"Favorite New TV Male Star\". Henriksen was born in New York City. His mother, Margueritte, was a waitress, dance instructor, and model. His father, James Marin Henriksen, who was from Tønsberg, Norway, was a boxer and merchant sailor. Henriksen studied at the Actors Studio and began his career off-Broadway in Eugene O'Neill's \"Three Plays of the Sea.\" One of his first film appearances was as an FBI agent in Sidney Lumet's Dog Day Afternoon (1975), followed by parts in Lumet's Network (1976) and Prince of the City (1981). He then appeared in Steven Spielberg's Close Encounters of the Third Kind (1977) with Richard Dreyfuss and François Truffaut, Damien: Omen II (1978) and in Philip Kaufman's The Right Stuff (1983), in which he played Mercury astronaut Capt. Wally Schirra. James Cameron cast Henriksen in his first directorial effort, Piranha Part Two: The Spawning (1981), then used him again in The Terminator (1984) and as the android Bishop in the sci-fi classic Aliens (1986). Sam Raimi cast Henriksen as an outrageously garbed gunfighter in his quirky western Mort ou vif (1995). Henriksen has also appeared in what has developed into a cult classic: Kathryn Bigelow's Near Dark (1987), in which he plays the head of a clan of murderous redneck vampires. He was nominated for a Golden Satellite Award for his portrayal of Abraham Lincoln in the TNT original film The Day Lincoln Was Shot (1998). In addition to his abilities as an actor, Henriksen is an accomplished painter and potter. His talent as a ceramist has enabled him to create some of the most unusual ceramic artworks available on the art market today. He resides in Southern California with his wife Jane and their five-year-old daughter Sage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkwOTMyMDEzN15BMl5BanBnXkFtZTcwMjk4NTUyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000448","name":"Lance Henriksen","idIMDB":"nm0000448"},"actorId":"nm0000448","character":"Kerchak","urlCharacter":"http://www.imdb.com/character/ch0060411","main":true},{"actorName":"Brenda Grate","urlProfile":"http://www.imdb.com/name/nm0335989","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNzI0MDQ5Nl5BMl5BanBnXkFtZTcwMjcyMDIzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1988","placeOfBirth":" Camarillo, California, USA","birthName":"Brenda Marie Grate","height":"5' 7½\" (1.71 m)","bio":"Brenda Grate was born on December 28, 1988 in Camarillo, California, USA as Brenda Marie Grate. She is an actress and director, known for 'Twas the Night (2001), Odessa (2000) and Tarzan 2 (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNzI0MDQ5Nl5BMl5BanBnXkFtZTcwMjcyMDIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0335989","name":"Brenda Grate","idIMDB":"nm0335989"},"actorId":"nm0335989","character":"Terk","urlCharacter":"http://www.imdb.com/character/ch0007733","main":true},{"actorName":"Harrison Fahn","urlProfile":"http://www.imdb.com/name/nm1616586","urlPhoto":"","biography":{"height":"3' 5\" (1.04 m)","bio":"Harrison Fahn is known for his work on Ice Age: Dawn of the Dinosaurs (2009), Ice Age: The Meltdown (2006) and Tarzan 2 (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1616586","name":"Harrison Fahn","idIMDB":"nm1616586"},"actorId":"nm1616586","character":"Tantor","urlCharacter":"http://www.imdb.com/character/ch0007730","main":true},{"actorName":"Tiffany Evans","urlProfile":"http://www.imdb.com/name/nm1793169","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2OTA5OTczMl5BMl5BanBnXkFtZTYwODQzNzQz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 August 1992","placeOfBirth":" Bronx, New York City, New York, USA","bio":"Tiffany Evans was born on August 4, 1992 in Bronx, New York City, New York, USA. She is an actress, known for Diary of a Mad Black Woman (2005), Tarzan 2 (2005) and The 8th Annual Soul Train Christmas Starfest (2005). She has been married to Lorenzo Henderson since December 25, 2010. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2OTA5OTczMl5BMl5BanBnXkFtZTYwODQzNzQz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1793169","name":"Tiffany Evans","idIMDB":"nm1793169"},"actorId":"nm1793169","character":"Voice","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Connor Hutcherson","urlProfile":"http://www.imdb.com/name/nm1947985","urlPhoto":"","biography":{"dateOfBirth":"2 May 1996","placeOfBirth":" USA","birthName":"Connor Mason Hutcherson","bio":"Connor Hutcherson is a movie actor, family member and brother of fellow movie star Josh Hutcherson, most notable for his role in the Hunger Games franchise. Before fame, he provided his voice for the Tonka character in Tarzan II before turning 10 years old. In an amazing trivia, He appeared in the 2005 film Little Manhattan. His mother Michelle used to work for Delta Air Lines and his father, Chris, worked as an analyst for EPA. Comedian George Carlin also provided his voice for Tarzan II.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1947985","name":"Connor Hutcherson","idIMDB":"nm1947985"},"actorId":"nm1947985","character":"Tonka","urlCharacter":"http://www.imdb.com/character/ch0051084","main":true},{"actorName":"Mary Mouser","urlProfile":"http://www.imdb.com/name/nm1597268","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMjIyNjMwNl5BMl5BanBnXkFtZTcwNDE0NzE0Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 May 1996","placeOfBirth":" Pine Bluff, Arkansas, USA","birthName":"Mary Matilyn Mouser","height":"5' 3\" (1.6 m)","bio":"Mary Mouser was born on May 9, 1996 in Pine Bluff, Arkansas, USA as Mary Matilyn Mouser. She is known for her work on Body of Proof (2011), Alexander and the Terrible, Horrible, No Good, Very Bad Day (2014) and Frenemies (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMjIyNjMwNl5BMl5BanBnXkFtZTcwNDE0NzE0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1597268","name":"Mary Mouser","idIMDB":"nm1597268"},"actorId":"nm1597268","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Grace Rolek","urlProfile":"http://www.imdb.com/name/nm1728847","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI3MzgwNDU5OV5BMl5BanBnXkFtZTYwNDE0NjIz._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1997","placeOfBirth":"","height":"5' 0½\" (1.54 m)","bio":"Grace Rolek was born on October 10, 1997. She is known for her work on Cloudy with a Chance of Meatballs (2009), Kung Fu Panda: Secrets of the Furious Five (2008) and Horton Hears a Who! (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI3MzgwNDU5OV5BMl5BanBnXkFtZTYwNDE0NjIz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1728847","name":"Grace Rolek","idIMDB":"nm1728847"},"actorId":"nm1728847","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jennessa Rose","urlProfile":"http://www.imdb.com/name/nm1971725","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ0MDEwNjM4OV5BMl5BanBnXkFtZTgwOTYxMTEyMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1996","placeOfBirth":" La Jolla, California, USA","bio":"Jennessa Rose was born on April 4 in La Jolla, Ca and went to school in Del Mar/Carmel Valley until relocating to Los Angeles. She has appeared in numerous professional plays in Los Angeles, Orange County and San Diego. Jennessa also has done voiceover for many films, TV shows, radio and TV commercials. A singer,actress,voiceover actress and host. Jennessa is studying her improv and sketch comedy to broaden her acting skills and be able to take on all types of roles, she feels the improv is so important and lots of fun. She resides in Los Angeles now with her family and her dog, Maxie. Jennessa has a sister, Julianna Rose who is also an actress.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ0MDEwNjM4OV5BMl5BanBnXkFtZTgwOTYxMTEyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1971725","name":"Jennessa Rose","idIMDB":"nm1971725"},"actorId":"nm1971725","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"April Winchell","urlProfile":"http://www.imdb.com/name/nm0934589","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MzgwNjQ5MV5BMl5BanBnXkFtZTYwNDk0NTEz._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 January 1960","placeOfBirth":" New York City, New York, USA","birthName":"April Terri Winchell","height":"5' 4\" (1.63 m)","bio":"April Winchell was born on January 4, 1960 in New York City, New York, USA as April Terri Winchell. She is an actress, known for Antz (1998), Despicable Me 2 (2013) and Wander Over Yonder (2013). She has been married to John Foley since 2013. She was previously married to Mick Kuisel.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MzgwNjQ5MV5BMl5BanBnXkFtZTYwNDk0NTEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0934589","name":"April Winchell","idIMDB":"nm0934589"},"actorId":"nm0934589","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0437503","urlIMDB":"http://www.imdb.com/title/tt0437503","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":"27","month":"06","year":"2004","remarks":null},"filmingDates":null,"copyrightHolder":"Copyright 2005 Disney Enterprises, Inc. All rights reserved (on print)"},"technical":{"runtime":["1 hr 12 min (72 min)","1 hr 15 min (75 min) (Argentina)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.6","filmingLocations":[],"rated":"G","awards":[{"award":"Annie Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Annie","categories":[{"category":"Best Home Entertainment Production","names":[]}]}]},{"award":"DVD Exclusive Awards 2006","titlesAwards":[{"titleAwardOutcome":"Won DVDX Award","categories":[{"category":"Best Original Score (in a DVD Premiere Movie)","names":[{"name":"Mark Mancina","id":"nm0006183","role":null},{"name":"Dave Metzger","id":"nm1214866","role":null}]},{"category":"Best Original Song (in a DVD Premiere Movie)","names":[{"name":"Phil Collins","id":"nm0002015","role":"writer/performer"},{"name":"Walt Disney Home Entertainment","id":null,"role":null}]},{"category":"Best Visual Effects (in a DVD Premiere Movie)","names":[{"name":"Marvin Petilla","id":"nm0677520","role":null},{"name":"Walt Disney Home Entertainment","id":null,"role":null}]}]},{"titleAwardOutcome":"Nominated DVDX Award","categories":[{"category":"Best Overall Movie, Animated DVD Premiere","names":[{"name":"Walt Disney Pictures","id":null,"role":null}]},{"category":"Best Original Music Video","names":[{"name":"Tiffany Evans","id":"nm1793169","role":null},{"name":"20th Century Fox Home Entertainment","id":null,"role":null}]},{"category":"Best Animated Character Performance (Voice and Animation in a DVD Premiere Movie)","names":[{"name":"George Carlin","id":"nm0137506","role":"voice"},{"name":"Bernard Derriman","id":"nm0220615","role":"animator"},{"name":"Walt Disney Home Entertainment","id":null,"role":null}]},{"category":"Best Director (of a DVD Premiere Movie)","names":[{"name":"Brian Smith","id":"nm0807531","role":null},{"name":"Walt Disney Home Entertainment","id":null,"role":null}]},{"category":"Best Screenplay (for a DVD Premiere Movie)","names":[{"name":"Jim Kammerud","id":"nm0436851","role":null},{"name":"Brian Smith","id":"nm0807531","role":null},{"name":"Bob Tzudiker","id":"nm0879318","role":null},{"name":"Noni White","id":"nm0925276","role":null},{"name":"Walt Disney Home Entertainment","id":null,"role":null}]},{"category":"Best Original Song (in a DVD Premiere Movie)","names":[{"name":"Phil Collins","id":"nm0002015","role":"writer"},{"name":"Tiffany Evans","id":"nm1793169","role":"performer"},{"name":"Matthew Gerrard","id":"nm1720431","role":"producer/arranger"},{"name":"Walt Disney Home Entertainment","id":null,"role":null}]},{"category":"Best Original Song (in a DVD Premiere Movie)","names":[{"name":"Phil Collins","id":"nm0002015","role":"writer/performer"},{"name":"Walt Disney Home Entertainment","id":null,"role":null}]},{"category":"Best Editing (in a DVD Premiere Movie)","names":[{"name":"John Royer","id":"nm0747370","role":null},{"name":"Walt Disney Home Entertainment","id":null,"role":null}]}]}]},{"award":"Young Artist Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Performance in a Voice-Over Role - Young Actress","names":[{"name":"Brenda Grate","id":"nm0335989","role":null}]}]}]}],"votes":"6,221","type":"Video","companyCreditsSimple":[{"idCompany":"co0008970","name":"Walt Disney Pictures"},{"idCompany":"co0092035","name":"DisneyToon Studios"}],"keywords":{"keywords":["self discovery","jungle","gorilla","disney animated sequel","inbetwequel","turn of the century","1900s","20th century","1890s","19th century","vine","rescue","direct to video sequel to theatrical movie","jungle adventure","prequel","based on novel","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 06:17:29"}}