{"data":{"movies":[{"title":"Holiday Affair","originalTitle":"","year":"1955","releaseDate":"19551222","directors":[{"name":"Earl Eby","id":"nm0248297"}],"writers":[{"name":"John D. Weaver","id":"nm0915873"},{"name":"Isobel Lennart","id":"nm0501973"}],"runtime":"53 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjRmNzFjZTUtOTE3Ni00N2FiLTkxOWUtMzk2YTRlZDA5NjZmXkEyXkFqcGdeQXVyMjcyMDU4NA@@._V1.jpg","countries":[],"languages":["English"],"genres":["Comedy","Drama"],"plot":"Connie Ennis, widowed mother to young son Timmy, has avoided accepting the marriage proposal of her longtime boyfriend Carl. While he patiently awaits her saying \"yes,\" Connie clings to the memory of her late husband. By chance, a department store salesman enters her life and complicates matters when the two quickly fall in love. With two marriage proposals on the table, Connie is forced to make a final choice.","simplePlot":"Connie Ennis, widowed mother to young son Timmy, has avoided accepting the marriage proposal of her longtime boyfriend Carl. While he patiently awaits her saying \"yes,\" Connie clings to the... ","actors":[{"actorName":"Scott Brady","urlProfile":"http://www.imdb.com/name/nm0103722","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNDkxNjk2M15BMl5BanBnXkFtZTcwODUwOTU5Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 September 1924","placeOfBirth":" Brooklyn, New York, USA","birthName":"Gerard Kenneth Tierney","height":"6' 2\" (1.88 m)","bio":"He had the manly good looks and rugged appeal to make it to top stardom in Hollywood and succeeded quite well as a sturdy leading man of standard action on film and TV. Born in Brooklyn on September 13, 1924, Irish-American Scott Brady was christened Gerard Kenneth Tierney (called Jerry) by parents Lawrence and Maria Tierney. His father, chief of New York's aqueduct police force, had always had show business intentions and later did print work after retiring from the force. Both Scott's older and younger brothers, Lawrence Tierney and Edward Tierney went on to become actors as well. Lawrence's promising film noir \"bad guy\" career was sabotaged by a severe drinking disorder that led to numerous skirmishes with the law. Scott himself faced a narcotics charge in 1957 (charges were dropped, Scott maintained that he was framed) and later (1963) was involved in illegal bookmaking activities. Fortunately, Scott was more cool-headed and wound up avoiding the pitfalls that befell his older brother, making a very lucrative living for himself in Hollywood throughout the 1950s and early 1960s. Scott grew up in Westchester County and attended Roosevelt and St. Michael's High Schools. Like his older brother Lawrence, Scott he was an all-round athlete in school and earned letters for basketball, football and track and expressed early designs on becoming a football coach or radio announcer. Instead he enlisted before graduating from high school and served as a naval aviation mechanic overseas. During his term of duty he earned a light heavyweight boxing medal. He was discharged in 1946 and decided to head for Los Angeles where his older brother Lawrence was making encouraging strides as an actor. Toiling in menial jobs as a cabbie and day-time laborer, the handsome, blue-eyed looker was noticed having lunch in a café by producer Hal B. Wallis and offered a screen test. The test did not fare well but, not giving up, he enrolled in the Bliss-Hayden drama school under his G.I. Bill, studied acting, and managed to rid himself of his thick Brooklyn accent. He signed with a minor league studio, Eagle-Lion, and made his debut of sorts in the poverty-row programmer In This Corner (1948) utilizing his boxing skills from his early days in the service. He showed more promise with his second and third films Canon City (1948) and He Walked by Night (1948), the latter as a detective who aids in nabbing psychotic killer Richard Basehart. Scott switched over to higher-grade action stories for Fox and Universal over time. Westerns and crime stories would be his bread-winning genres with The Gal Who Took the West (1949) opposite Yvonne De Carlo and John Russell and Undertow (1949), with Russell again, being prime examples. He frequently switched from hero to heavy during his peak years. In one film he would romance a Jeanne Crain in The Model and the Marriage Broker (1951) or a Mitzi Gaynor in Bloodhounds of Broadway (1952), while in the next beat Shelley Winters to a pulp in Untamed Frontier (1952). A favorite pin-up hunk in his early years, he hit minor cult status as a bad hombre, The Dancin' Kid, in the offbeat western Johnny Guitar (1954). He and the other manly men, however, were somewhat overshadowed in the movie by the Freudian-tinged gunplay between Joan Crawford and Mercedes McCambridge. Other roles had him sturdily handling the action scenes while giving the glance over to such diverting female costars as Barbara Stanwyck, Mala Powers and Anne Bancroft. Scott would mark the same territory in TV -- westerns and crimers -- finding steadier work on the smaller screen into the 1960s. He starred as the title hero in the western series Shotgun Slade (1959). Stage too was a sporadic source of income with such productions as \"The Moon Is Blue\", \"Detective Story\" and \"Picnic\" under his belt before making his Broadway bow as a slick card sharpie opposite Andy Griffith in the short-lived musical \"Destry Rides Again\" in 1959. He later did the national company of the heavyweight political drama \"The Best Man\" with his portrayal of a senator. The seemingly one-time confirmed bachelor decided to settle down after meeting and marrying Mary Tirony in 1967 at age 43. Prior to this he had been linked with such luminous beauties as Gwen Verdon and Dorothy Malone. The couple had two sons. Parts dwindled down in size in later years and he gained considerable weight as he grew older and balder, but he still appeared here-and-there as an occasional character heavy or hard-ass cop in less-important movies such as Doctors' Wives (1971), $ (1971), The Loners (1972) and Wicked, Wicked (1973). Minor TV roles in mini-movies also came his way at a fair pace. Towards the end he was seen in such high-profile big-screen movies as The China Syndrome (1979) and Gremlins (1984). Scott had a collapse in 1981 and was diagnosed with pulmonary fibrosis, a progressive respiratory disease. He later relied on an oxygen tank. He died of the disease four years later and was interred at the Holy Cross Cemetery in Culver City, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNDkxNjk2M15BMl5BanBnXkFtZTcwODUwOTU5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0103722","name":"Scott Brady","idIMDB":"nm0103722"},"actorId":"nm0103722","character":"Steve Mason","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Phyllis Thaxter","urlProfile":"http://www.imdb.com/name/nm0857187","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA2MzI2MjQ0OF5BMl5BanBnXkFtZTcwMjE1ODcxOA@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 November 1919","placeOfBirth":" Portland, Maine, USA","birthName":"Phyllis Schuyler Thaxter","bio":"This warm and winning, very non-theatrical brunette was born Phyllis St. Felix Thaxter in Portland, Maine, on November 20, 1919. The daughter of Maine Supreme Court Justice Sidney Thaxter, her acting talent came from her mother's side, who was a one-time Shakespearean actress. Phyllis was educated for a time at St. Genevieve School in Montreal and back at Portland's Deering High School. She apprenticed in summer stock and had joined the Montreal Reperatory Theatre company by the time she made her Broadway debut at age 17 in \"What a Life!\" in 1939, the \"Henry Aldrich\" play. She went on to play a maid and to understudy the leading ingénue in \"There Shall Be No Night\" (1940), which starred America's premiere theatrical couple, Alfred Lunt and Lynn Fontanne, then understudied Dorothy McGuire in the hit dramatic play, \"Claudia\", later that year. She eventually played the title role both on Broadway and on the road, but lost out on the film role to McGuire. Hollywood films reached her sights a few years later with the MGM war film, Thirty Seconds Over Tokyo (1944), proving quite convincing as Van Johnson's noble wife. Similar to Margaret Sullavan, June Allyson, Dorothy McGuire and Teresa Wright, Phyllis was depended on as a stabilizing factor in melodramas and war pictures, often the dewy-eyed, altruistic wife, girlfriend or daughter waiting on the home-front. Other important films included the girl with a split personality in Bewitched (1945), and as a angst-ridden, teary-eyed bride-to-be in Week-End at the Waldorf (1945). She was dutifully wholesome as the daughter who reunites Spencer Tracy and Katharine Hepburn in the movie The Sea of Grass (1947) and evoked tears, yet again, as little Margaret O'Brien's mother in Tenth Avenue Angel (1948). So natural and unglamorous was she that she tended to blend into the woodwork while the flashier actresses often stole the thunder and the notices. Audiences did not always fully appreciate Phyllis's understated work. She finished out her MGM contract with Act of Violence (1949), ever-faithful to even the bad guy, this time psychotic gangster Robert Ryan. Phyllis moved to Warner Brothers in the 1950s and played more of the same. The ever-patient wife to a slew of top actors including shady boat skipper John Garfield in The Breaking Point (1950), an alcoholic Gig Young in Come Fill the Cup (1951) and law-abiding Gary Cooper in Springfield Rifle (1952), her nascent career at Warners was suddenly curtailed by illness. While visiting her family in Portland, she contracted a form of infantile paralysis. Fortunately, she recovered quickly but the ailment triggered the termination of her contract. Film roles were few and far between after this. Still displaying her built-in compassion and concern, her best-known part came with the touching but relatively minor role of farm wife \"Martha Kent\" in the highly popular Superman (1978) film series with the late Christopher Reeve as her adopted superhero son and Glenn Ford as her husband. She was also a steady guest star on TV with numerous dramatic appearances including The Twilight Zone (1959), The F.B.I. (1965), Cannon (1971), Medical Center (1969), Barnaby Jones (1973) and several TV movies. Married for nearly two decades to James T. Aubrey (1918-1994), who became president of CBS-TV before taking over MGM, they had three children--including Schuyler, who would become the actress Skye Aubrey. Following the couple's divorce in 1962, Phyllis married Gilbert Lea, who owned Tower Publishing Company in Portland. They eventually retired to Cumberland, Maine, where she involved herself in civic/community activities and dedicated herself to hospital volunteer work.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA2MzI2MjQ0OF5BMl5BanBnXkFtZTcwMjE1ODcxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0857187","name":"Phyllis Thaxter","idIMDB":"nm0857187"},"actorId":"nm0857187","character":"Connie Ennis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elliott Reid","urlProfile":"http://www.imdb.com/name/nm0717256","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MzcxMDQ1Ml5BMl5BanBnXkFtZTcwNjY3ODcyOA@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 January 1920","placeOfBirth":" New York City, New York, USA","birthName":"Edgeworth Blair Reid","height":"6' 2\" (1.88 m)","bio":"Elliott Reid was born on January 16, 1920 in New York City, New York, USA as Edgeworth Blair Reid. He was an actor and writer, known for Gentlemen Prefer Blondes (1953), Inherit the Wind (1960) and The Absent Minded Professor (1961). He died on June 21, 2013 in Studio City, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MzcxMDQ1Ml5BMl5BanBnXkFtZTcwNjY3ODcyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0717256","name":"Elliott Reid","nicknames":["Ted"],"idIMDB":"nm0717256"},"actorId":"nm0717256","character":"Carl Davis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Herbert Butterfield","urlProfile":"http://www.imdb.com/name/nm0125287","urlPhoto":"","biography":{"dateOfBirth":"28 October 1895","placeOfBirth":" Providence, Rhode Island, USA","bio":"Herbert Butterfield was born on October 28, 1895 in Providence, Rhode Island, USA. He was an actor, known for The House on Telegraph Hill (1951), Dangerous Assignment (1952) and Shield for Murder (1954). He died on May 2, 1957 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0125287","name":"Herbert Butterfield","idIMDB":"nm0125287"},"actorId":"nm0125287","character":"Grandpa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mary Adams","urlProfile":"http://www.imdb.com/name/nm0011195","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU2MmZmNmQtOWIyMC00ZDg1LWE5OWYtZmM0NzMyNTBlYzI4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1903","placeOfBirth":" Georgia, USA","bio":"Mary Adams was born in 1903 in Georgia, USA. She was an actress, known for Executive Suite (1954), Diary of a Madman (1963) and Blood of Dracula (1957). She died on November 30, 1973 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU2MmZmNmQtOWIyMC00ZDg1LWE5OWYtZmM0NzMyNTBlYzI4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0011195","name":"Mary Adams","idIMDB":"nm0011195"},"actorId":"nm0011195","character":"Grandma","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Baxter","urlProfile":"http://www.imdb.com/name/nm0062736","urlPhoto":"","biography":{"dateOfBirth":"8 April 1905","placeOfBirth":" Paris, France","height":"6' 1\" (1.85 m)","bio":"George Baxter was born on April 8, 1905 in Paris, France. He was an actor, known for Lili (1953), Marianne (1929) and Unknown World (1951). He was married to Anne Lewington. He died on September 10, 1976 in New York City, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0062736","name":"George Baxter","idIMDB":"nm0062736"},"actorId":"nm0062736","character":"Mr. Gow","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Cane","urlProfile":"http://www.imdb.com/name/nm0133802","urlPhoto":"","biography":{"dateOfBirth":"18 April 1899","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Charles Cannefax","bio":"Charles Cane was born on April 18, 1899 in St. Louis, Missouri, USA as Charles Cannefax. He was an actor, known for The Killing (1956), Dead Reckoning (1947) and Revenge of the Creature (1955). He died on November 30, 1973 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0133802","name":"Charles Cane","idIMDB":"nm0133802"},"actorId":"nm0133802","character":"Officer McClary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Bryar","urlProfile":"http://www.imdb.com/name/nm0117269","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTFmNjQ5NDMtNzMyYS00ZTU3LWFkZWEtMmYzZjU4YTc5MWJhL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 February 1910","placeOfBirth":" Manhattan, New York, USA","birthName":"Gabriel Paul Barrere","bio":"Paul Bryar was born on February 21, 1910 in Manhattan, New York, USA as Gabriel Paul Barrere. He was an actor, known for Butch Cassidy and the Sundance Kid (1969), Heart Like a Wheel (1983) and Funny Lady (1975). He was married to Claudia Bryar. He died on August 30, 1985 in Van Nuys, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTFmNjQ5NDMtNzMyYS00ZTU3LWFkZWEtMmYzZjU4YTc5MWJhL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0117269","name":"Paul Bryar","idIMDB":"nm0117269"},"actorId":"nm0117269","character":"Desk Sergeant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Olsen","urlProfile":"http://www.imdb.com/name/nm0647606","urlPhoto":"","biography":{"dateOfBirth":"19 September 1946","placeOfBirth":" Los Angeles, California, USA","birthName":"Christopher Robin Olsen","height":"5' 9½\" (1.77 m)","bio":"Christopher Olsen was born on September 19, 1946 in Los Angeles, California, USA as Christopher Robin Olsen. He is an actor, known for The Man Who Knew Too Much (1956), Bigger Than Life (1956) and The Tarnished Angels (1957).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0647606","name":"Christopher Olsen","idIMDB":"nm0647606"},"actorId":"nm0647606","character":"Timmy Ennis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Margaret O'Brien","urlProfile":"http://www.imdb.com/name/nm0639684","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NjY2Mzg1MV5BMl5BanBnXkFtZTYwMzQzNTc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 January 1937","placeOfBirth":" San Diego, California, USA","birthName":"Angela Maxine O'Brien","bio":"Born Angela Maxine O'Brien on January 15, 1937 in San Diego, California. Her film debut was one-minute shot in MGM's Babes on Broadway (1941). Her big moment came when she was cast in Journey for Margaret (1942). This film shot her into instant stardom and also resulted in Angela changing her name to Margaret. Throughout the 1940s Margaret was a major child star. Her unforgettable performance as \"Tootie\" in Vincente Minnelli's Meet Me in St. Louis (1944) won her an Academy Award as \"Outstanding Child Actress\" of her day. She gave brilliant performances in such films as The Canterville Ghost (1944), Our Vines Have Tender Grapes (1945), The Secret Garden (1949) and Little Women (1949). By the early 1950s Margaret had made a mint for MGM and earned a personal fortune. Then she brilliantly graduated into adolescent roles and she never retired from the screen. She also remained active on TV and on the dinner-theater circuit. She frequently is appearing at prestigious events as Celebrity Host or Guest Star and popular Public Speaker.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NjY2Mzg1MV5BMl5BanBnXkFtZTYwMzQzNTc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0639684","name":"Margaret O'Brien","idIMDB":"nm0639684"},"actorId":"nm0639684","character":"Intermission Guest","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Walter Brennan","urlProfile":"http://www.imdb.com/name/nm0000974","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNzA5NjE1MF5BMl5BanBnXkFtZTYwMTMxMTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 July 1894","placeOfBirth":" Lynn, Massachusetts, USA","birthName":"Walter Andrew Brennan","height":"6' (1.83 m)","bio":"In many ways the most successful and familiar character actor of American sound films and the only actor to date to win three Oscars for Best Supporting Actor, Walter Brennan attended college in Cambridge, Massachusetts, studying engineering. While in school he became interested in acting and performed in school plays. He worked some in vaudeville and also in various jobs such as clerking in a bank and as a lumberjack. He toured in small musical comedy companies before entering the military in 1917. After his war service he went to Guatemala and raised pineapples, then migrated to Los Angeles, where he speculated in real estate. A few jobs as a film extra came his way beginning in 1923, then some work as a stuntman. He eventually achieved speaking roles, going from bit parts to substantial supporting parts in scores of features and short subjects between 1927 and 1938. In 1936 his role in Come and Get It (1936) won him the very first Best Supporting Actor Academy Award. He would win it twice more in the decade, and be nominated for a fourth. His range was enormous. He could play sophisticated businessmen, con artists, local yokels, cowhands and military officers with apparent equal ease. An accident in 1932 cost him most of his teeth, and he most often was seen in eccentric rural parts, often playing characters much older than his actual age. His career never really declined, and in the 1950s he became an even more endearing and familiar figure in several television series, most famously The Real McCoys (1957). He died in 1974 of emphysema, a beloved figure in movies and TV, the target of countless comic impressionists, and one of the best and most prolific actors of his time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNzA5NjE1MF5BMl5BanBnXkFtZTYwMTMxMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000974","name":"Walter Brennan","idIMDB":"nm0000974"},"actorId":"nm0000974","character":"Intermission Guest","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Otto Kruger","urlProfile":"http://www.imdb.com/name/nm0472603","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNTg3MzIzMV5BMl5BanBnXkFtZTYwMjE4Njky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1885","placeOfBirth":" Toledo, Ohio, USA","height":"5' 9\" (1.75 m)","bio":"The grandnephew of South African pioneer and former president Paul Krüger, Otto Kruger trained for a musical career from childhood, but after enrolling in Columbia University he switched his career choice to acting. Making his Broadway debut in 1915, at 30, he shortly became a matinée idol of the day, specializing in sophisticated leading roles. He made his film debut in 1915 in The Runaway Wife (1915), but it was in the 1930s that Kruger's polished, urbane characterizations came into full swing. Although he occasionally played a hero, as in Corregidor (1943) he was often cast as the amoral villain or a charming but corrupt businessman (usually a banker), a task at which he excelled. Kruger was one of the industry's busiest character actors until a series of strokes brought about his retirement in the mid-1960s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNTg3MzIzMV5BMl5BanBnXkFtZTYwMjE4Njky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0472603","name":"Otto Kruger","idIMDB":"nm0472603"},"actorId":"nm0472603","character":"Himself - Host","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ken Carpenter","urlProfile":"http://www.imdb.com/name/nm0139392","urlPhoto":"","biography":{"dateOfBirth":"21 August 1900","placeOfBirth":" Avon, Illinois, USA","birthName":"Kenneth Lee Carpenter","bio":"Ken Carpenter was born on August 21, 1900 in Avon, Illinois, USA as Kenneth Lee Carpenter. He was an actor, known for Lux Video Theatre (1950), Forty Boys and a Song (1941) and Unusual Occupations (1947). He died on October 16, 1984 in Santa Monica, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0139392","name":"Ken Carpenter","idIMDB":"nm0139392"},"actorId":"nm0139392","character":"Himself - Announcer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0637729","urlIMDB":"http://www.imdb.com/title/tt0637729","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["53 min (including commercials) (USA)"],"soundMix":["Mono"],"color":["Black and White"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["Live"],"cinematographicProcess":null,"printedFilmFormat":null},"filmingLocations":[{"location":"Studio 2, Stage 1, NBC Studios - 3000 W. Alameda Avenue, Burbank, California, USA"}],"awards":[],"type":"TV Episode","seasonInfo":{"tvSerie":{"name":"Lux Video Theatre","id":"tt0042123"},"season":"Season 6","episode":"Episode 13"},"companyCreditsSimple":[{"idCompany":"co0259714","name":"J. Walter Thompson Agency"}],"keywords":{"keywords":["christmas"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 04:40:15"}}