{"data":{"movies":[{"title":"Trapped!","originalTitle":"","year":"2006","releaseDate":"2006","directors":[{"name":"Rex Piano","id":"nm0681247"}],"writers":[{"name":"Jason Preston","id":"nm1063872"},{"name":"Peter Sullivan","id":"nm0838289"}],"runtime":"88 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0NzgwMTc0Nl5BMl5BanBnXkFtZTcwNDQ4NDM3Mw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Thriller"],"plot":"A weekend vacation turns terrifying when computer scientist Samantha (Alexandra Paul) and her daughter are lured into the hands of a killer. Kidnapped and held hostage, Samantha is given a choice: she must use her expertise to help her captors carry out an unspeakable crime, or let her daughter die. Nothing is as it seems in this twisting thriller, where high-stakes and high-tech collide for an edge-of-your-seat movie experience that will keep you guessing until the very end!","simplePlot":"A weekend vacation turns terrifying when computer scientist Samantha (Alexandra Paul) and her daughter are lured into the hands of a killer. Kidnapped and held hostage, Samantha is given a ... ","actors":[{"actorName":"Alexandra Paul","urlProfile":"http://www.imdb.com/name/nm0000575","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNjMyODQ4OF5BMl5BanBnXkFtZTgwOTM2NTA0MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1963","placeOfBirth":" New York City, New York, USA","height":"5' 10\" (1.78 m)","bio":"Alexandra Paul was modeling when she decided to forego college at Stanford University and pursue acting. With lead roles in 75 feature films and television programs, she can also be seen in the award-winning documentary Who Killed the Electric Car? (2006). Internationally recognized for her 5-year starring role as \"Lt. Stephanie Holden\" in the hit series Baywatch (1989), Alexandra began her acting career in 1982 at age 18, starring in the highly rated telefilm Paper Dolls (1982). She was then cast in studio flicks like Stephen King's Christine (1983); American Flyers (1985) opposite Kevin Costner; 8 Million Ways to Die (1986) opposite Jeff Bridges and Andy Garcia; Dragnet (1987) opposite Tom Hanks and Dan Aykroyd, and Spy Hard (1996) with Leslie Nielsen. Alexandra hosted the extreme sports series Wild Waters on the Outdoor Life Network for 4 years, and hosted the WE network series Winning Women for two seasons. She co-hosted 150 episodes of the environmental TV talk show Earth Talk Today through 2008. Throughout the 1990s, Alexandra had regular roles in several television series: Baywatch (1989), Fox's Fire Co 132, Daytona Beach (pilot), and the last 8 episodes on Melrose Place (1992). She also filmed two movies in war-torn Croatia with Pierce Brosnan and did many independent films. In the first decade of the 21st Century, Alexandra starred in 11 movies on Lifetime Movie Network. She also played a lesbian 4 times, opportunities she appreciates since her identical twin sister is gay. In 2006, she shot 6 films, including a cameo in Borat:Cultural Learnings of America for Make Benefit Glorious Nation of Kazakhstan, and although her part was edited out, she remains in the DVD extras. From 2010 - 2017, Alexandra has shot independent movies and an online series. She is producing 2 movies, a movie based on the book Free The Animals with her producing partner, Nik Tyler; and The B Team, an action comedy starring 8 of her Baywatch castmates.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNjMyODQ4OF5BMl5BanBnXkFtZTgwOTM2NTA0MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000575","name":"Alexandra Paul","idIMDB":"nm0000575"},"actorId":"nm0000575","character":"Samantha","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicholas Turturro","urlProfile":"http://www.imdb.com/name/nm0878155","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNDM3NjQ0MV5BMl5BanBnXkFtZTcwNTYyMjc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 1962","placeOfBirth":" Queens, New York, USA","height":"5' 8\" (1.73 m)","bio":"The whole Turturro clan and their extended family seem to have gotten into the show biz act at one time or another. The youngest of three boys, including famous older brother (by five years) John Turturro, Nicholas Turturro was born on January 29, 1962, in Queens, New York, and grew up in its Rosedale section. He is the son of Italian-American parents, Katherine, a jazz singer, and Nicholas Turturro, a construction worker and carpenter. After attending various Catholic schools, he graduated and majored in theater at Adelphi University for two years, but left to marry Jami Biunno and help raise their child, Erica. The couple later divorced. While working as a doorman at the St. Moritz Hotel in New York City, Nick managed to find a job as both an extra and voice-over artist in Spike Lee's Do the Right Thing (1989) after brother John introduced Nick to Spike. Spike took an immediate interest in the rough-edged Nick and wrote a featured role for him in his next film Mo' Better Blues (1990) in which John and Nick played repugnant Jewish brothers and co-owners of a club. Both the brothers went on to appear together again in Lee's Jungle Fever (1991) and Nick also appeared in Lee's Malcolm X (1992). Nick branched out on his own after this and earned parts in the movies Federal Hill (1994) and Excess Baggage (1997), and garnered serious TV attention as rookie detective \"James Martinez\" on NYPD Blue (1993). His character was originally created as a foil to David Caruso star character, but he lost momentum after Caruso's early departure from the show. Still, he managed to hang around for seven seasons. Very dark in tone and complexion, the compact-framed Nick certainly has had a wealth of experience in mob drama, playing a young Al Capone in one guest appearance, and assorted mobster types in other TV-movies. Plenty of guest-starring roles have also come his way with episodes of Law & Order (1990), L.A. Law (1986) and The Twilight Zone (1985) and a recurring role on Third Watch (1999). He has lightened up on a rare occasion in such comedies as The Drew Carey Show (1995) and in a couple of failed pilots. On stage, Nick has appeared in \"Wild Goose\", \"The Resistible Rise of Arturo Ui\" (with John) \"Lusting After Popino's Wife\" and \"Siddown: Conversations With the Mob\". Nick's never strayed too far from the family fold. He's appeared in a number of John's projects over the years that have also occasionally featured cousin Aida Turturro (from The Sopranos (1999) fame). His mother has also appeared in a few films, as has John's wife and sons. Nick remarried a number of years ago.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNDM3NjQ0MV5BMl5BanBnXkFtZTcwNTYyMjc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0878155","name":"Nicholas Turturro","idIMDB":"nm0878155"},"actorId":"nm0878155","character":"Travis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dennis Christopher","urlProfile":"http://www.imdb.com/name/nm0160550","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1OTY5NTk3MF5BMl5BanBnXkFtZTcwMTAzMzM3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 December 1955","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Dennis Carrelli","height":"5' 11\" (1.8 m)","bio":"Dennis Christopher was born on December 2, 1955 in Philadelphia, Pennsylvania, USA as Dennis Carrelli. He is an actor, known for Django Unchained (2012), Breaking Away (1979) and Chariots of Fire (1981).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1OTY5NTk3MF5BMl5BanBnXkFtZTcwMTAzMzM3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0160550","name":"Dennis Christopher","idIMDB":"nm0160550"},"actorId":"nm0160550","character":"Adrien","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barbara Bain","urlProfile":"http://www.imdb.com/name/nm0000828","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzODg4NjI0N15BMl5BanBnXkFtZTYwNzUxNDI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 September 1931","placeOfBirth":" Chicago, Illinois, USA","birthName":"Mildred Fogel","height":"5' 9¼\" (1.76 m)","bio":"Barbara Bain was born in Chicago, graduating from the University of Illinois with a Bachelor's Degree in Sociology. She then relocated to New York City where she gained work as a dancer and high-fashion model. Ms. Bain studied with Martha Graham, permanently cementing her love of dance; however, it was with Lee Strasberg at the prestigious Actors Studio that she discovered her true first love - acting. She is probably best known for her work in the landmark television series Mission: Impossible (1966), created by Bruce Geller, where she created the pivotal role of Impossible Missions Force Agent \"Cinnamon Carter\", and, in the process, became the first actress in the history of television to receive three consecutive Emmy Awards for Best Dramatic Actress. Ms. Bain followed with the role of \"Dr. Helena Russell\" in the now classic British syndicated science fiction television series Space: 1999 (1975), created by Gerry Anderson and Sylvia Anderson. Her stage work has garnered her Los Angeles Critic's Circle and DramaLogue Awards for her work on Arthur Kopit's \"Wings\", Samuel Beckett's \"Happy Days\" and Eugène Ionesco's \"The Chairs\". Ms. Bain has worked on behalf of numerous charitable causes and is the founder of the Screen Actors Guild's \"BookPals\" Program which currently has some 300 of her colleagues reading to children in Los Angeles schools. Following the success of the program there, she helped the program to develop in other major cities throughout North America.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzODg4NjI0N15BMl5BanBnXkFtZTYwNzUxNDI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000828","name":"Barbara Bain","idIMDB":"nm0000828"},"actorId":"nm0000828","character":"Elizabeth Kramer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Burke","urlProfile":"http://www.imdb.com/name/nm0992221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDc3NzkzNF5BMl5BanBnXkFtZTgwMjAyODgyMjE@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"John Burke was born in Atlanta, Georgia, USA. He is an actor, known for The Amazing Spider-Man (2012), Sicario (2015) and R.I.P.D. (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDc3NzkzNF5BMl5BanBnXkFtZTgwMjAyODgyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0992221","name":"John Burke","idIMDB":"nm0992221"},"actorId":"nm0992221","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike Dopud","urlProfile":"http://www.imdb.com/name/nm0233304","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzOTgwOTAwM15BMl5BanBnXkFtZTcwODAwNTM4Mw@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1968","placeOfBirth":" Montreal, Quebec, Canada","height":"6' (1.83 m)","bio":"Mike Dopud is a man with presence. As an actor, his screen presence has a far different kind of impact than the kind he used to deliver as a professional athlete -- Both are hard-hitting and memorable. Dopud was born in Montreal, Canada, the second son of a Yugoslavian family. Mike speaks three languages fluently (English, French, and Serbian). Graduating with a degree in Physiology and International Business Administration from Southern Illinois University where he was a four-year letterman, Dopud went on to a pro-football career in the Canadian Football League that was cut short by a knee injury. After rehabilitating his knee, he found himself back on skates playing pro hockey in the Minor Leagues. Plagued by injury, his sports career ended abruptly. It wasn't long after Dopud had his first taste of the film industry on the hit television series The X-Files (1993). \"I was hooked.\" Dopud's talent, rugged good looks, and screen presence has also caught the attention of casting directors. His forty acting credits over the last few years has made this working actor someone to watch for and someone who is hard to miss. In the soon-to-be released King Rising - Au nom du Roi (2007), Dopud plays General Backler. Some of Dopud's other recent film credits include 300 (2006), White Noise (2005), BloodRayne (2005), Rollerball (2002), I Spy (2002), X-Men 2 (2003), I, Robot (2004), and Canada Russia '72 (2006). Dopud has had recurring roles on such shows as Smallville (2001), Battlestar Galactica (2004), Jeff Ltd. (2005), Stargate SG-1 (1997), and Millennium (1996). This fall, Mike can be seen on MTV playing the role of Don Harris on the new series Kaya (2007). His size and professional sports background landed Dopud regular stunt work while he steadily began building his acting resume. His \"day at the office\" in stunt work has included being set on fire, hit by a car, falling off buildings thrown through windows and down stairs, flying through walls, and more fight scenes than Mike Tyson has fought professional bouts. He's duked it out with Dwayne Johnson (Walking Tall (2004)), Jason Statham (Chaos (2005)), Vin Diesel (The Chronicles of Riddick (2004)), Jessica Alba (Dark Angel), Lucy Liu (Ballistic: Ecks vs. Sever (2002)), Jean-Claude Van Damme (Replicant (2001)), and the Charlestown Chiefs in the sequel to the cult classic One More Minute (1979): Slap Shot 2: Breaking the Ice (2002). Most recently Dopud has been nominated for a 2005 Taurus World Stunt Awards for Best High Work in the movie Walking Tall (2004). Dopud is also excited that he has returned to the stage most recently in the original plays: Rockets Red Glare and Of Diners and Buses. And Two Small Bodies. Gingham Dog.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzOTgwOTAwM15BMl5BanBnXkFtZTcwODAwNTM4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0233304","name":"Mike Dopud","idIMDB":"nm0233304"},"actorId":"nm0233304","character":"Ivan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Gibbon","urlProfile":"http://www.imdb.com/name/nm0316515","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4OTU0NzM5MjleQTJeQWpwZ15BbWU3MDg4OTE5ODQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 5\" (1.96 m)","bio":"Mark Gibbon is known for his work on The Chronicles of Riddick (2004), Man of Steel (2013) and Underworld Awakening (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4OTU0NzM5MjleQTJeQWpwZ15BbWU3MDg4OTE5ODQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0316515","name":"Mark Gibbon","idIMDB":"nm0316515"},"actorId":"nm0316515","character":"Zlatko","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clint Jung","urlProfile":"http://www.imdb.com/name/nm0432521","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI0NTE1Nzc3Nl5BMl5BanBnXkFtZTgwODc2OTQ3NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Clint Jung is an actor and producer, known for Music Within (2007), Jobs (2013) and Ray Donovan (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI0NTE1Nzc3Nl5BMl5BanBnXkFtZTgwODc2OTQ3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0432521","name":"Clint Jung","idIMDB":"nm0432521"},"actorId":"nm0432521","character":"Agent Hergott","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brandon Klock","urlProfile":"http://www.imdb.com/name/nm0459921","urlPhoto":"","biography":{"dateOfBirth":"26 February 1978","placeOfBirth":" Corpus Christi, Texas, USA","height":"5' 11\" (1.8 m)","bio":"Brandon Klock was born on February 26, 1978 in Corpus Christi, Texas, USA. He is a production manager and actor, known for Trapped! (2006), SLC Punk! (1998) and Starf*cker (2017).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0459921","name":"Brandon Klock","idIMDB":"nm0459921"},"actorId":"nm0459921","character":"Steven","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sazzy Lee Calhoun","urlProfile":"http://www.imdb.com/name/nm0129943","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNjA1MTc5NV5BMl5BanBnXkFtZTgwNzYyOTY0MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Sazzy Lee Calhoun, aka Sazzy Lee Varga, has been involved in the entertainment industry for years, as both actress & model and assistant Director. She's graced countless magazine covers and layouts across the globe, has numerous film & television credits including working alongside fellow Super model Rachael Hunter, Academy Award-winner Faye Dunaway & \"The Spy Who Shagged Me\" star, Robert Wagner. An author of \"Sazzy's Cookin\", she heats up a kitchen like no other! Contributing to the art world she creates large Pop Art pieces using her glamour images in a way that would make Warhol proud & are a collectors item. She web masters not only her site but also the http://www.tibetanphotoproject.com of which she is a co-founder.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNjA1MTc5NV5BMl5BanBnXkFtZTgwNzYyOTY0MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0129943","name":"Sazzy Lee Calhoun","idIMDB":"nm0129943"},"actorId":"nm0129943","character":"Bikini Babe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tatiana Maslany","urlProfile":"http://www.imdb.com/name/nm1137209","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg5NjE4NDgzMl5BMl5BanBnXkFtZTgwNzk5OTQwMjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 September 1985","placeOfBirth":" Regina, Saskatchewan, Canada","birthName":"Tatiana Gabrielle Maslany","height":"5' 4\" (1.63 m)","bio":"Tatiana Gabrielle Maslany was born September 22, 1985 in Regina, Saskatchewan, to Renate, a translator, and Dan, a woodworker. She graduated from Dr. Martin LeBoldus High school in 2003. She was a well respected student, and participated as often as possible in school productions. She is well known for her participation in the Canadian Improv Games. Maslany starred in the 2006 television movie, Booky Makes Her Mark (2006) along with Megan Follows and Stuart Hughes. She had supporting roles in the films Eastern Promises (2007) and The Vow (2012), and came to fame starring in the series Orphan Black (2013), playing a large number of clones. Maslany also had a large role in the 2015 film Woman in Gold (2015), playing a young version of Maria Altmann, Helen Mirren's character.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg5NjE4NDgzMl5BMl5BanBnXkFtZTgwNzk5OTQwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1137209","name":"Tatiana Maslany","nicknames":["Tat"],"idIMDB":"nm1137209"},"actorId":"nm1137209","character":"Gwen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeff Rector","urlProfile":"http://www.imdb.com/name/nm0714560","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMTEyNzMwNl5BMl5BanBnXkFtZTcwNzI0NzkwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1958","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Jeffrey A. Rector","height":"5' 10\" (1.78 m)","bio":"Jeff was born in St. Louis, Missouri, but actually grew up in Bloomfield Hills, Michigan. His family then relocated to Tarzana California where he graduated from Taft High School in the San Fernando Valley. After graduation, Jeff went to Valley College for a short term and then transferred and graduated from Moorpark College with an Associate of Arts degree. While at Moorpark College, he starred in several of the school plays, learned how to write, edit, direct and produce video productions through the telecommunications department and was a State and National Speech Champion on the schools award-winning intercollegiate speech team. In addition to working in the industry, Jeff is the President and Festival Director for the Burbank International Film Festival, a non-profit organization that supports, showcases and honors independent filmmaking. Through his strong ties and community service in the \"Media Capitol of the World\", Jeff was also elected by the Burbank City Council to serve on the board of the Burbank Cultural Arts Commission.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMTEyNzMwNl5BMl5BanBnXkFtZTcwNzI0NzkwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0714560","name":"Jeff Rector","idIMDB":"nm0714560"},"actorId":"nm0714560","character":"Agent Randall","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maggie Wagner","urlProfile":"http://www.imdb.com/name/nm0906000","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2MDkxMzQ1Nl5BMl5BanBnXkFtZTcwNTg3MzEzMQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 January 1966","placeOfBirth":" New York City, New York, USA","height":"5' 5\" (1.65 m)","bio":"Maggie Wagner was born on January 28, 1966 in New York City, New York, USA. She is an actress and writer, known for Working Girl (1988), One Fine Day (1996) and He Was a Quiet Man (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2MDkxMzQ1Nl5BMl5BanBnXkFtZTcwNTg3MzEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0906000","name":"Maggie Wagner","idIMDB":"nm0906000"},"actorId":"nm0906000","character":"Julie Kennedy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michelle Wolff","urlProfile":"http://www.imdb.com/name/nm0938294","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNDcyOTYzMV5BMl5BanBnXkFtZTcwOTAzNjAyOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Michelle Wolff is an actress, known for Evolution (2001), Unspeakable (2002) and Mango Kiss (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNDcyOTYzMV5BMl5BanBnXkFtZTcwOTAzNjAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0938294","name":"Michelle Wolff","idIMDB":"nm0938294"},"actorId":"nm0938294","character":"Dana","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0773313","urlIMDB":"http://www.imdb.com/title/tt0773313","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 28 min (88 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"3.9","filmingLocations":[{"location":"Turks and Caicos Islands"}],"awards":[],"votes":"173","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0102287","name":"ACH"},{"idCompany":"co0086989","name":"Regent Productions"},{"idCompany":"co0209195","name":"Christopher Filmcapital"}],"keywords":{"keywords":["shootout","hispanic cop","bound and gagged","fbi","abduction"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:55:57"}}