{"data":{"movies":[{"title":"Aliens vs. Predator: Requiem","originalTitle":"AVPR: Aliens vs Predator - Requiem","year":"2007","releaseDate":"20071225","directors":[{"name":"Colin Strause","id":"nm0833779"},{"name":"Greg Strause","id":"nm0833780"}],"writers":[{"name":"Shane Salerno","id":"nm0004307"},{"name":"Dan O'Bannon","id":"nm0639321"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NDY2NDUwM15BMl5BanBnXkFtZTYwNzQxMTA3._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Horror","Sci-Fi","Thriller"],"plot":"Following the events of Alien vs. Predator, and the maturation of the chestburster that erupted from the body of Scar (the Predator that defeated the Alien Queen) into an adult Predalien, the Predator scout ship crashes in the woods of Gunnison County. A local, Buddy Benson, and his son, Sam, are hunting in the forest and witness the crash, but they are chased and are implanted with alien embryos by facehuggers along with several homeless people living in the sewers. Meanwhile another Predator lands seeking out the Alien and destroying evidence of their presence on Earth. The dwellers of the town find themselves in the middle of a battlefield between the two deadly extraterrestrial creatures, and the small group of survivors splits between the leadership of Sheriff Eddie Morales and the bad-boy Dallas Howard. Both have different opinions about the best means to escape from the beings.","simplePlot":"Warring alien and predator races descend on a rural US town, where unsuspecting residents must band together for any chance of survival.","actors":[{"actorName":"Steven Pasquale","urlProfile":"http://www.imdb.com/name/nm1018679","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NTc4NDc3MV5BMl5BanBnXkFtZTcwMTM2MjIzMQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1976","placeOfBirth":" Hershey, Pennsylvania, USA","birthName":"Steven J. Pasquale","height":"5' 11\" (1.8 m)","bio":"Steven Pasquale was born on November 18, 1976 in Hershey, Pennsylvania, USA as Steven J. Pasquale. He is an actor and producer, known for Aliens vs. Predator: Requiem (2007), Rescue Me (2004) and Aurora Borealis (2005). He was previously married to Laura Benanti.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NTc4NDc3MV5BMl5BanBnXkFtZTcwMTM2MjIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1018679","name":"Steven Pasquale","idIMDB":"nm1018679"},"actorId":"nm1018679","character":"Dallas","urlCharacter":"http://www.imdb.com/character/ch0457968","main":true},{"actorName":"Reiko Aylesworth","urlProfile":"http://www.imdb.com/name/nm0043855","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NjU1MjM3MV5BMl5BanBnXkFtZTYwMDA5ODYz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 December 1972","placeOfBirth":" Chicago, Illinois, USA","height":"5' 4\" (1.63 m)","bio":"Reiko was born in Chicago, IL.. She and her younger brother were raised by their mother who worked in a methadone clinic and later ran a jail. When Reiko was 13 yrs. old, they met the man who would become her stepfather and would introduce her to acting and theater. The family soon moved to Springfield, IL briefly then on to Seattle, WA. where she spent most of her teen years. While attending the University of Washington, at age 19 she was scouted and cast in an ABC soap opera and flown to NYC. She soon fell in love with the city and decided to stay and pursue an acting career. While working in regional and off-Broadway theater, she supported herself by working many and various day jobs. By her mid twenties, she was able to live on her acting income but her breakthrough role came with the role of Michelle Dessler on the hit show 24. She has also had ongoing roles on ER, Lost, Damages, Hawaii 5-0 and has worked on many other television shows, films and plays. Her British husband Rob Clare is a well-respected Shakespeare teacher and director who received his doctorate from Oxford University and has taught at leading universities in the US and around the world. They have recently moved from NYC to the Los Angeles area, with their adopted son Andre who was born in Omaha, Nebraska in September 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NjU1MjM3MV5BMl5BanBnXkFtZTYwMDA5ODYz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0043855","name":"Reiko Aylesworth","idIMDB":"nm0043855"},"actorId":"nm0043855","character":"Kelly","urlCharacter":"http://www.imdb.com/character/ch0050788","main":true},{"actorName":"John Ortiz","urlProfile":"http://www.imdb.com/name/nm0651159","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzc5MzcyMV5BMl5BanBnXkFtZTgwMjYzOTg1NjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 May 1968","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"5' 8\" (1.73 m)","bio":"John Ortiz was born on May 23, 1968 in Brooklyn, New York City, New York, USA. He is an actor, known for Silver Linings Playbook (2012), Fast & Furious (2009) and American Gangster (2007). He is married to Jennifer Ortiz. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzc5MzcyMV5BMl5BanBnXkFtZTgwMjYzOTg1NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0651159","name":"John Ortiz","idIMDB":"nm0651159"},"actorId":"nm0651159","character":"Morales","urlCharacter":"http://www.imdb.com/character/ch0069345","main":true},{"actorName":"Johnny Lewis","urlProfile":"http://www.imdb.com/name/nm0507381","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2Mzc1MjgzOF5BMl5BanBnXkFtZTcwNzEyNDgzOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1983","placeOfBirth":" Los Angeles, California, USA","birthName":"Jonathan Kendrick Lewis","height":"5' 10½\" (1.79 m)","bio":"Born and raised in Los Angeles, California, the middle of three siblings, Johnny began performing from the age of 5 at a small performing arts school, making his debut as a Chanukah candle. Pursuing the acting profession, he appeared with success in many TV and film projects, handling both drama and comedy with finesse. Johnny was what used to be called a Renaissance Man. He was not only a superb actor, but excelled in the other arts as well. He was a prolific writer, poet and painter. He also was a philanthropist, donating hundreds of thousands of dollars to worthy causes, as well as being an active member of a number of charitable organizations. He had seen too many of his friends succumb to the curse of drug abuse, and so he became an outspoken advocate against drugs, using his celebrity status to speak to large groups of educators and law enforcement officials about the dangers of street and psychiatric drug abuse. He created friends everywhere he went. And he went everywhere. Europe, Asia, South America. He slept with natives in grass huts in Southeast Asia, and was the first white man allowed passage to a sacred lake in Laos. Of his many talents, one that he treasured was the mentoring of other artists. Many successful performers, some of whom have reached the top of their profession have ascribed their success to Johnny. His most recent work includes Sons of Anarchy (two seasons), Felon, The Runaways, 186 Dollars to Freedom and Lovely Molly. In late October 2011 he suffered head injuries from a motorcycle accident. Immediately thereafter his thinking and behavior took a serious turn for the worse. He was arrested on January 3, 2012 for allegedly trespassing at a neighbor's home. He was beaten violently in the head approximately 17 times before the police arrived, causing further injuries. In jail, following additional head injuries he was diagnosed by the prison medics as suffering from internal bleeding in the brain. Despite the diagnosis of Traumatic Brain Injury and despite never testing positive for drugs that year he was treated for psychosis and chemical dependency. Two more arrests followed, including near drowning (another traumatic brain incident). Symptoms of Traumatic Brain Injury include impaired judgement, sensitivity to light, and sudden inexplicable violent behavior. Typical of the misperception on the part of law enforcement officials was the often-quoted remark by the probation official who expressed that Johnny suffered from mental health issues as well as chemical dependency. Prior to his injuries Johnny had never had a brush with the law. And the toxicology report following his death revealed absolutely no drugs whatsoever in his system. In late May of 2012 the Santa Monica Superior Court allowed his admission to Ridgeview, a drug rehab center in Alta Dena, California. Though a drug rehab facility, the rest and quiet were a tonic for him, and he gradually, over the summer, regained himself. He wrote, in a journal entry, \"Felt more whole today. . .more complete. Like parts of myself had been stolen in my sleep and scattered all over the world and they've begun to return. So I think better, my thoughts aren't being sent off on their own.\" He began planning for a return to acting, via the stage, and spoke of possibly bringing Shakespeare to inner city kids. In August he tragically accepted the DA's offer to serve \"just a couple more days in jail,\" in exchange for his freedom. The \"couple days\" became nearly two months, during which he suffered additional abuse and a violent downturn in spirits and health. Finally released in late September, he died in sad and disturbing circumstances on September 26, 2012.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2Mzc1MjgzOF5BMl5BanBnXkFtZTcwNzEyNDgzOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0507381","name":"Johnny Lewis","idIMDB":"nm0507381"},"actorId":"nm0507381","character":"Ricky","urlCharacter":"http://www.imdb.com/character/ch0050791","main":true},{"actorName":"Ariel Gade","urlProfile":"http://www.imdb.com/name/nm1262166","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyMzE4ODE5NjFeQTJeQWpwZ15BbWU3MDMyMzMxMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 May 1997","placeOfBirth":" San Jose, California, USA","height":"5' 1\" (1.55 m)","bio":"Ariel Gade was born on May 1, 1997 in San Jose, California, USA. She is an actress, known for Aliens vs. Predator: Requiem (2007), Dark Water (2005) and Envy (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyMzE4ODE5NjFeQTJeQWpwZ15BbWU3MDMyMzMxMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1262166","name":"Ariel Gade","idIMDB":"nm1262166"},"actorId":"nm1262166","character":"Molly","urlCharacter":"http://www.imdb.com/character/ch0072458","main":true},{"actorName":"Kristen Hager","urlProfile":"http://www.imdb.com/name/nm1982266","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMjc1Nzc0Ml5BMl5BanBnXkFtZTgwMDU5ODgzODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 January 1984","placeOfBirth":" Red Lake, Ontario, Canada","bio":"Kristen Hager was born on January 2, 1984 in Red Lake, Ontario, Canada. She is an actress, known for Wanted (2008), Aliens vs. Predator: Requiem (2007) and Being Human (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMjc1Nzc0Ml5BMl5BanBnXkFtZTgwMDU5ODgzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1982266","name":"Kristen Hager","idIMDB":"nm1982266"},"actorId":"nm1982266","character":"Jesse","urlCharacter":"http://www.imdb.com/character/ch0054620","main":true},{"actorName":"Sam Trammell","urlProfile":"http://www.imdb.com/name/nm0870794","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MDUzNzg4NV5BMl5BanBnXkFtZTcwNTkwNjM1Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 1969","placeOfBirth":" New Orleans, Louisiana, USA","height":"5' 11\" (1.8 m)","bio":"Tony nominee Sam Trammell is most widely recognized for his starring role of Sam Merlotte in HBO's AFI award-winning series TRUE BLOOD. The Alan Ball created fantasy drama set ratings records for the network over its seven year run. Trammell currently guest stars on NBC's Golden Globe nominated dramedy, THIS IS US. This March, he can be seen in KONG: SKULL ISLAND. Trammell has also completed production on several indie films, including SAY YOU WILL opposite Michelle Forbes, ABOUT RAY with Naomi Watts, Susan Sarandon and Elle Fanning and LA GRAN PROMESA by Mexican filmmaker Jorge Ramirez Suarez. In 2014, Trammell co-starred in the hit drama THE FAULT IN OUR STARS, based on the best-selling novel, with Shailene Woodley and Laura Dern. He also co-wrote, co-produced and starred in the indie film ALL MISTAKES BURIED. In 2015, he co-starred with John Travolta in I AM WRATH. In 2016, he co-starred in IMPERIUM opposite Toni Collette, Daniel Radcliffe and Tracy Letts. On television, Trammell has appeared on numerous series, including CHILDREN'S HOSPITAL, DEXTER, as well as being a series regular on Barry Sonnenfeld's MAXIMUM BOB, TRINITY and Scott Rosenberg's short lived but cult hit GOING TO CALIFORNIA. A theater veteran, Trammell earned a Tony nomination and the Clarence Derwent Award for his role in AH WILDERNESS! at Lincoln Center. His extensive on and off Broadway, as well as regional credits, include KIT MARLOWE at The Public Theater, DEALER'S CHOICE at the Manhattan Theater Club, ANCESTRAL VOICES at Lincoln Center, MY NIGHT WITH REG with The New Group, ROPE with The Drama Dept, IF MEMORY SERVES at the Promenade Theater, OUR TOWN at Williamstown and RED MEMORIES at NY STAGE and FILM, among others. A native of Louisiana and West Virginia, Trammell graduated from Brown University and the Sorbonne with a Bachelor of Arts in Semiotics. He currently resides in Los Angeles with his family. He is an advocate for clean oceans and beaches and works with the non-profit organization Oceana.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MDUzNzg4NV5BMl5BanBnXkFtZTcwNTkwNjM1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0870794","name":"Sam Trammell","idIMDB":"nm0870794"},"actorId":"nm0870794","character":"Tim","urlCharacter":"http://www.imdb.com/character/ch0238441","main":true},{"actorName":"Robert Joy","urlProfile":"http://www.imdb.com/name/nm0431451","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MjMzNDIzMV5BMl5BanBnXkFtZTYwMTIxNjYz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 August 1951","placeOfBirth":" Montréal, Québec, Canada","height":"5' 10\" (1.78 m)","bio":"Robert Joy was born on August 17, 1951 in Montréal, Québec, Canada. He is an actor and producer, known for CSI: NY (2004), Land of the Dead - Le territoire des morts (2005) and The Hills Have Eyes (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MjMzNDIzMV5BMl5BanBnXkFtZTYwMTIxNjYz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0431451","name":"Robert Joy","idIMDB":"nm0431451"},"actorId":"nm0431451","character":"Col. Stevens","urlCharacter":"http://www.imdb.com/character/ch0180184","main":true},{"actorName":"David Paetkau","urlProfile":"http://www.imdb.com/name/nm0655959","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUzMDI0Njk5OF5BMl5BanBnXkFtZTgwOTk5NDU2MzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1972","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"David E. Paetkau","height":"5' 10\" (1.78 m)","bio":"David Paetkau was born on November 10, 1972 in Vancouver, British Columbia, Canada as David E. Paetkau. He is an actor and producer, known for Final Destination 2 (2003), Man of Steel (2013) and Flashpoint (2008). He has been married to Evangeline Duy since February 28, 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUzMDI0Njk5OF5BMl5BanBnXkFtZTgwOTk5NDU2MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0655959","name":"David Paetkau","idIMDB":"nm0655959"},"actorId":"nm0655959","character":"Dale","urlCharacter":"http://www.imdb.com/character/ch0238442","main":true},{"actorName":"Tom Woodruff Jr.","urlProfile":"http://www.imdb.com/name/nm0940430","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5ODU3NjEyNl5BMl5BanBnXkFtZTgwMzcwODkyMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1959","placeOfBirth":" Williamsport, Pennsylvania, USA","height":"6' 2\" (1.88 m)","bio":"Tom Woodruff Jr. was born in 1959 in Williamsport, Pennsylvania, USA. He is known for his work on AVP: Alien vs. Predator (2004), Aliens (1986) and The Terminator (1984).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5ODU3NjEyNl5BMl5BanBnXkFtZTgwMzcwODkyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0940430","name":"Tom Woodruff Jr.","idIMDB":"nm0940430"},"actorId":"nm0940430","character":"Alien","urlCharacter":"http://www.imdb.com/character/ch0027252","main":true},{"actorName":"Ian Whyte","urlProfile":"http://www.imdb.com/name/nm1613839","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MjU5MTc5NF5BMl5BanBnXkFtZTgwMDMwMDE5NDE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 September 1971","placeOfBirth":" Bangor, North Wales, UK","height":"7' 1\" (2.16 m)","bio":"Ian Whyte was born in Bangor, North Wales and brought up in Brighton. He received athletic scholarships to Iona College in New York and Clarion University in Pennsylvania as a basketball player and later distinguished himself with 80 caps for England over a nine year international basketball career. In 2004 his physical attributes, his mental toughness and flair for the theatrical made him the perfect man to play the part of the iconic Predator in Paul W. Anderson's Sci Fi action film Alien Vs. Predator, to critical acclaim. Ian went on to develop his reputation as a talented physical actor by performing stunts for Francis De La Tour as the 8' 6\" tall Madame Maxime, Head Mistress of the Beauxbatons Academy in Harry Potter and Goblet of Fire. In 2007 Ian reprised the role of the Predator in AVP: Requiem, again to critical acclaim and in 2010 the character of Madame Maxime in Harry Potter and the Deathly Hallows: Part 1. Ian continues to play fearsome horror, fantasy and science fiction characters created by the most talented industry designers and is highly regarded as one of the finest, most talented and dedicated costume actors in the business. He has also recently come to prominence playing dramatic parts, most notable in the as yet unreleased Harrigan directed by Vince Woods. A stylish, gritty police drama set against the dark backdrop of 1970's Britain and as the fearsome and sinister Gregor Clegane, \"The Mountain that Rides\" in the second season of HBO's award winning fantasy drama: Game of Thrones.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MjU5MTc5NF5BMl5BanBnXkFtZTgwMDMwMDE5NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1613839","name":"Ian Whyte","idIMDB":"nm1613839"},"actorId":"nm1613839","character":"Predator","urlCharacter":"http://www.imdb.com/character/ch0000867","main":true},{"actorName":"Chelah Horsdal","urlProfile":"http://www.imdb.com/name/nm1319098","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5ODA1NzI4Nl5BMl5BanBnXkFtZTgwNzAyOTY0MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1973","placeOfBirth":" Vancouver Island, British Columbia, Canada","birthName":"Chelah P. Horsdal","height":"5' 9\" (1.75 m)","bio":"Chelah grew up in the Vancouver community of Kitsilano. At eighteen, by-way of modeling, Chelah appeared in a couple of locally shot TV shows and commercials before packing her bags and moving to the Caribbean for a year. Upon returning home to Canada, Chelah took the long route back to acting...restaurant management, interior design, creative director of a magazine, event production, voice agent....until finally returning to acting in 2002. Chelah then committed herself to full-fledged study of her chosen craft at Lyric School of Acting and immersed herself as a student in all there was to read, watch & soak up. She has since appeared in multiple films, television movies, TV series & over 75 commercials. Highlights have been numerous but, at the top of the list, has been working with Sir Ben Kinsley, Mandy Patinkin, Laurie Metcalf, Jean Reno, Jennifer Love Hewitt, John Lithgow & Paul Dinello....the list goes on and on. Despite a busy work schedule, Chelah continues to study whenever she can find the time. Teachers Larry Moss, John Cassini, Ben Ratner & Ivana Chubbuck, among others, offer inspiration and new approaches for the moving target of art. Although often working out of town, Chelah continues to proudly call Vancouver home.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5ODA1NzI4Nl5BMl5BanBnXkFtZTgwNzAyOTY0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1319098","name":"Chelah Horsdal","idIMDB":"nm1319098"},"actorId":"nm1319098","character":"Darcy","urlCharacter":"http://www.imdb.com/character/ch0238443","main":true},{"actorName":"Meshach Peters","urlProfile":"http://www.imdb.com/name/nm1821330","urlPhoto":"","biography":{"dateOfBirth":"17 April 1996","placeOfBirth":" Oakville, Ontario, Canada","height":"5' 7\" (1.7 m)","bio":"Meshach Peters was born on April 17, 1996 in Oakville, Ontario, Canada. He is an actor, known for Night at the Museum (2006), Aliens vs. Predator: Requiem (2007) and The Boy Who Cried Werewolf (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1821330","name":"Meshach Peters","idIMDB":"nm1821330"},"actorId":"nm1821330","character":"Curtis","urlCharacter":"http://www.imdb.com/character/ch0238444","main":true},{"actorName":"Matt Ward","urlProfile":"http://www.imdb.com/name/nm2092422","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMjIzNzk2OV5BMl5BanBnXkFtZTgwNDY3MjE2MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Matt Ward is an actor, known for TRON: Legacy (2010), Charlie St. Cloud (2010) and Aliens vs. Predator: Requiem (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMjIzNzk2OV5BMl5BanBnXkFtZTgwNDY3MjE2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2092422","name":"Matt Ward","idIMDB":"nm2092422"},"actorId":"nm2092422","character":"Mark","urlCharacter":"http://www.imdb.com/character/ch0238445","main":true},{"actorName":"Michal Suchánek","urlProfile":"http://www.imdb.com/name/nm0837095","urlPhoto":"","biography":{"dateOfBirth":"27 October 1987","placeOfBirth":" Slovakia","height":"5' 10\" (1.78 m)","bio":"When Michal Suchanek was 12, he got his first break -- a part in the Nutcracker. Michal's career accelerated after he signed with Evangelista in Vancouver, and he received many offers to do commercials which were broadcast in Canada and the USA. Michal, born in Slovakia, also appeared on television programs, e.g., Sleepwalkers, X-Files and Hope Island. Television films are an important part of his resume: Zalinda's Story, Dirty Little Secret, Noah, Unconditional Love, and Y2K. Probably more important, Michal appeared in 'Edison: Wizard of Light' (HBO). For his outstanding role, he received an Emmy nomination. Success with awards continued as Michal was nominated for a Young Artist Award in connection with his performance in 'Aftershock: Earthquake in New York', mini-series produced by CBS. Michal's father, who holds a master's in performing arts, helps Michal and acts as his coach. When Michal isn't at work, he enjoys such things as computers, playing tennis, swimming, chess, snow skiing, and 'voice impersonations'. He resides in Los Angeles and Vancouver (B.C.) and is a citizen of Canada.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0837095","name":"Michal Suchánek","idIMDB":"nm0837095"},"actorId":"nm0837095","character":"Nick","urlCharacter":"http://www.imdb.com/character/ch0238446","main":true}],"seasons":[],"idIMDB":"tt0758730","urlIMDB":"http://www.imdb.com/title/tt0758730","business":{"budget":{"money":"$40,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$13,655,306","country":"USA","day":"30","month":"12","year":"2007","remarks":"2,611 Screens"},{"money":"$9,515,615","country":"USA","day":"23","month":"12","year":"2007","remarks":"2,563 Screens"},{"money":"£1,970,363","country":"UK","day":"20","month":"01","year":"2008","remarks":"399 Screens"},{"money":"$29,062","country":"Estonia","day":"30","month":"12","year":"2007","remarks":"3 Screens"},{"money":"PHP 18,357,161","country":"Philippines","day":"27","month":"01","year":"2008","remarks":"55 Screens"},{"money":"RUR 93,929,684","country":"Russia","day":"13","month":"01","year":"2008","remarks":"495 Screens"}],"gross":[{"money":"$41,797,066","country":"USA","day":"23","month":"03","year":"2008","remarks":""},{"money":"$41,794,328","country":"USA","day":"16","month":"03","year":"2008","remarks":""},{"money":"$41,790,114","country":"USA","day":"09","month":"03","year":"2008","remarks":""},{"money":"$41,781,028","country":"USA","day":"02","month":"03","year":"2008","remarks":""},{"money":"$41,763,488","country":"USA","day":"24","month":"02","year":"2008","remarks":""},{"money":"$41,736,249","country":"USA","day":"17","month":"02","year":"2008","remarks":""},{"money":"$41,668,854","country":"USA","day":"10","month":"02","year":"2008","remarks":""},{"money":"$41,564,088","country":"USA","day":"03","month":"02","year":"2008","remarks":""},{"money":"$41,455,951","country":"USA","day":"27","month":"01","year":"2008","remarks":""},{"money":"$41,288,750","country":"USA","day":"20","month":"01","year":"2008","remarks":""},{"money":"$40,383,929","country":"USA","day":"13","month":"01","year":"2008","remarks":""},{"money":"$37,054,994","country":"USA","day":"06","month":"01","year":"2008","remarks":""},{"money":"$30,485,443","country":"USA","day":"30","month":"12","year":"2007","remarks":""},{"money":"$9,515,615","country":"USA","day":"23","month":"12","year":"2007","remarks":""},{"money":"£4,420,884","country":"UK","day":"03","month":"02","year":"2008","remarks":""},{"money":"£3,724,016","country":"UK","day":"27","month":"01","year":"2008","remarks":""},{"money":"£1,970,363","country":"UK","day":"20","month":"01","year":"2008","remarks":""},{"money":"PHP 37,394,371","country":"Philippines","day":"16","month":"03","year":"2008","remarks":""},{"money":"PHP 36,871,541","country":"Philippines","day":"02","month":"03","year":"2008","remarks":""},{"money":"PHP 35,918,242","country":"Philippines","day":"17","month":"02","year":"2008","remarks":""},{"money":"PHP 33,556,180","country":"Philippines","day":"10","month":"02","year":"2008","remarks":""},{"money":"PHP 27,696,678","country":"Philippines","day":"03","month":"02","year":"2008","remarks":""},{"money":"PHP 18,357,161","country":"Philippines","day":"27","month":"01","year":"2008","remarks":""},{"money":"RUR 178,852,499","country":"Russia","day":"10","month":"02","year":"2008","remarks":""},{"money":"RUR 177,381,299","country":"Russia","day":"03","month":"02","year":"2008","remarks":""},{"money":"RUR 173,281,419","country":"Russia","day":"27","month":"01","year":"2008","remarks":""},{"money":"RUR 154,147,595","country":"Russia","day":"20","month":"01","year":"2008","remarks":""},{"money":"RUR 93,929,684","country":"Russia","day":"13","month":"01","year":"2008","remarks":""}],"weekendGross":[{"money":"$1,446","country":"USA","day":"23","month":"03","year":"2008","remarks":"5 Screens"},{"money":"$2,025","country":"USA","day":"16","month":"03","year":"2008","remarks":"7 Screens"},{"money":"$5,451","country":"USA","day":"09","month":"03","year":"2008","remarks":"19 Screens"},{"money":"$11,747","country":"USA","day":"02","month":"03","year":"2008","remarks":"30 Screens"},{"money":"$17,730","country":"USA","day":"24","month":"02","year":"2008","remarks":"40 Screens"},{"money":"$40,884","country":"USA","day":"17","month":"02","year":"2008","remarks":"76 Screens"},{"money":"$75,926","country":"USA","day":"10","month":"02","year":"2008","remarks":"136 Screens"},{"money":"$79,246","country":"USA","day":"03","month":"02","year":"2008","remarks":"165 Screens"},{"money":"$92,147","country":"USA","day":"27","month":"01","year":"2008","remarks":"151 Screens"},{"money":"$396,791","country":"USA","day":"20","month":"01","year":"2008","remarks":"410 Screens"},{"money":"$1,803,056","country":"USA","day":"13","month":"01","year":"2008","remarks":"1,378 Screens"},{"money":"$4,484,155","country":"USA","day":"06","month":"01","year":"2008","remarks":"2,617 Screens"},{"money":"$13,655,306","country":"USA","day":"30","month":"12","year":"2007","remarks":"2,611 Screens"},{"money":"$9,515,615","country":"USA","day":"23","month":"12","year":"2007","remarks":"2,563 Screens"},{"money":"£312,274","country":"UK","day":"03","month":"02","year":"2008","remarks":"374 Screens"},{"money":"£954,183","country":"UK","day":"27","month":"01","year":"2008","remarks":"402 Screens"},{"money":"£1,970,363","country":"UK","day":"20","month":"01","year":"2008","remarks":"399 Screens"},{"money":"PHP 21,308","country":"Philippines","day":"16","month":"03","year":"2008","remarks":"2 Screens"},{"money":"PHP 106,392","country":"Philippines","day":"02","month":"03","year":"2008","remarks":"5 Screens"},{"money":"PHP 1,656,023","country":"Philippines","day":"17","month":"02","year":"2008","remarks":"28 Screens"},{"money":"PHP 2,467,749","country":"Philippines","day":"10","month":"02","year":"2008","remarks":"42 Screens"},{"money":"PHP 7,212,900","country":"Philippines","day":"03","month":"02","year":"2008","remarks":"55 Screens"},{"money":"PHP 18,357,161","country":"Philippines","day":"27","month":"01","year":"2008","remarks":"55 Screens"}],"admissions":[{"money":"44,950","country":"Netherlands","day":"31","month":"12","year":"2008","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"30","month":"09","year":"2006","remarks":null},{"money":null,"country":null,"day":"20","month":"05","year":"2007","remarks":null}],"copyrightHolder":"© 2007 Twentieth Century Fox Film Corporation and Dune Entertainment LLC in all territories except Brazil, Italy, Japan, Korea and Spain; © 2007 TCF Hungary Film Rights Exploitation Limited Liability Company, Twentieth Century Fox Film Corporation and Dune Entertainment LLC in Brazil, Italy, Japan, Korea and Spain. (on print)"},"technical":{"runtime":["1 hr 34 min (94 min)","1 hr 42 min (102 min) (unrated) (USA)"],"soundMix":["Dolby Digital","DTS","SDDS (uncredited)"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe, USA (prints)","EFilm (digital intermediate)"],"filmLength":["2,560 m (Sweden)","2,572 m (Portugal, 35 mm)"],"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Digital Intermediate (4K) (master format)","Super 35 (3-perf) (source format)"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"4.7","metascore":"29","filmingLocations":[{"location":"2283 McAllister Avenue, Port Coquitlam, British Columbia, Canada"}],"rated":"R","awards":[{"award":"Golden Schmoes Awards 2007","titlesAwards":[{"titleAwardOutcome":"2nd place Golden Schmoes","categories":[{"category":"Biggest Disappointment of the Year","names":[]}]}]},{"award":"MTV Movie Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Best Fight","names":[]}]}]},{"award":"Razzie Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Prequel or Sequel","names":[]},{"category":"Worst Excuse for a Horror Movie","names":[]}]}]}],"votes":"96,486","type":"Movie","companyCreditsSimple":[{"idCompany":"co0000756","name":"Twentieth Century Fox Film Corporation"},{"idCompany":"co0022730","name":"Davis Entertainment"},{"idCompany":"co0132161","name":"Brandywine Productions"}],"keywords":{"keywords":["predator","alien","hunting","escape","forest","sheriff","sewer","human versus alien","alien creature","extraterrestrial alien","alien versus alien","school","playstation 2","based on comic book","based on graphic novel","nissan","ford motor company","dodge the car","honda","chevrolet","jeep cherokee","honda civic","honda accord","ford taurus","chevrolet cavalier","chevrolet caprice","pepsi","blood splatter","key","child murder","stabbed to death","stabbed in the forehead","shot to death","shot in the back","shot in the chest","shot in the forehead","alien space craft","veteran","power outage","indoor swimming pool","infanticide","death of loved one","death of girlfriend","lasersight","invisibility cloak","alien planet","falling down an elevator shaft","cover up","dismemberment","bloody body of child","green blood","alien hunter","alien artifact","murder","severed arm","second part","versus in title","prequel","acronym in title","violence","sadism","brutality","boyfriend girlfriend relationship","blood","parasite","human body alien host","alien breeding","mismatched bra and panties","girl in bra and panties","cult film","no opening credits","xenomorph","dark horse comics","wristwatch","mutation","hybrid","evacuation","estrangement","crash landing","alien technology","sporting goods store","small town","pregnancy","morgue","monster","homelessness","diner","colorado","brother brother relationship","air strike","stabbed in the shoulder","stabbed in the head","stabbed in the chest","stabbed in the back","shotgun","pregnant woman murdered","pistol","melting face","hanging upside down","head blown off","exploding head","exploding body","deception","death","cut into pieces","crushed head","bully","killing an animal","acid","tank","storm drain","spaceship crash","shot in the head","semiautomatic pistol","rat","nuclear explosion","m 16","hunting rifle","homeless woman","homeless man","helicopter crash","flashlight","ex convict","dog","deer","colonel","skinned alive","murder of a police officer","pizza delivery boy","nuclear bomb","night vision","night vision goggles","national guard","missing person","infrared vision","infestation","impalement","humvee","hospital","helicopter","gun store","government conspiracy","child in peril","crossover","gore","sequel","death of child","death of father","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:58:42"}}