{"data":{"movies":[{"title":"License to Wed","originalTitle":"","year":"2007","releaseDate":"20070703","directors":[{"name":"Ken Kwapis","id":"nm0477129"}],"writers":[{"name":"Kim Barker","id":"nm2184890"},{"name":"Tim Rasmussen","id":"nm0711422"}],"runtime":"91 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MTM2MjQ5NV5BMl5BanBnXkFtZTcwOTc3MDc0MQ@@._V1.jpg","countries":["USA","Australia"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"Sadie and Ben are in love, and although Ben suggests getting married in the Caribbean, Sadie has her heart set on a wedding at the family church, St. Augustine's. Ben says sure, and they meet with the pastor, Rev. Frank. The only date open for two years is three weeks away, and Frank insists the kids go through his marriage prep course. They're to write their own vows; he also demands chastity, bugs their apartment, initiates arguments, has them care for robot twins, creates friction between Ben and her family, and raises doubts in Sadie. Desperate, Ben looks for dirt on Frank. Can he undermine Frank's authority and keep Sadie's heart?","simplePlot":"A reverend puts an engaged couple through a grueling marriage preparation course to see if they are meant to be married in his church.","actors":[{"actorName":"Robin Williams","urlProfile":"http://www.imdb.com/name/nm0000245","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYzMjc2Mjg4MF5BMl5BanBnXkFtZTcwODc1OTQwNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 July 1951","placeOfBirth":" Chicago, Illinois, USA","birthName":"Robin McLaurin Williams","height":"5' 7\" (1.7 m)","bio":"Robin McLaurin Williams was born on Saturday, July 21st, 1951, in Chicago, Illinois, a great-great-grandson of Mississippi Governor and Senator, Anselm J. McLaurin. His mother, Laurie McLaurin (née Janin), was a former model from Mississippi, and his father, Robert Fitzgerald Williams, was a Ford Motor Company executive from Indiana. Williams had English, German, French, Welsh, Irish, and Scottish ancestry. Robin briefly studied political science before enrolling at Juilliard School to study theatre. After leaving Juilliard, he performed in nightclubs where he was discovered for the role of \"Mork, from Ork\", in an episode of Happy Days (1974). The episode, Happy Days: My Favorite Orkan (1978), led to his famous spin-off weekly TV series, Mork & Mindy (1978). He made his feature starring debut playing the title role in Popeye (1980), directed by Robert Altman. Williams' continuous comedies and wild comic talents involved a great deal of improvisation, following in the footsteps of his idol Jonathan Winters. Williams also proved to be an effective dramatic actor, receiving Academy Award nominations for Best Actor in a Leading Role in Good Morning, Vietnam (1987), Dead Poets Society (1989), and The Fisher King (1991), before winning the Academy Award for Best Actor in a Supporting Role in Good Will Hunting (1997). During the 1990s, Williams became a beloved hero to children the world over for his roles in a string of hit family-oriented films, including Hook (1991), Les aventures de Zak et Crysta dans la forêt de FernGully (1992), Aladdin (1992), Mrs. Doubtfire (1993), Jumanji (1995), Flubber (1997), and Bicentennial Man (1999). He continued entertaining children and families into the 21st century with his work in Robots (2005), Happy Feet (2006), Night at the Museum (2006), Night at the Museum: Battle of the Smithsonian (2009), Happy Feet 2 (2011), and Night at the Museum 3 (2014). Other more adult-oriented films for which Williams received acclaim include The World According to Garp (1982), Moscow on the Hudson (1984), Awakenings (1990), The Birdcage (1996), Insomnia (2002), One Hour Photo (2002), World's Greatest Dad (2009), and Boulevard (2014). On Monday, August 11th, 2014, Robin Williams was found dead at his home in Tiburon, California USA, the victim of an apparent suicide, according to the Marin County Sheriff's Department. A 911 call was received at 11:55 AM PDT, firefighters and paramedics arrived at his home at 12:00 PM PDT, and he was pronounced dead at 12:02 PM PDT.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYzMjc2Mjg4MF5BMl5BanBnXkFtZTcwODc1OTQwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000245","name":"Robin Williams","idIMDB":"nm0000245"},"actorId":"nm0000245","character":"Reverend Frank","urlCharacter":"http://www.imdb.com/character/ch0081018","main":true},{"actorName":"Mandy Moore","urlProfile":"http://www.imdb.com/name/nm0601553","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NTEzNDgzOF5BMl5BanBnXkFtZTcwNTMwNjk4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1984","placeOfBirth":" Nashua, New Hampshire, USA","birthName":"Amanda Leigh Moore","height":"5' 10\" (1.78 m)","bio":"Amanda Leigh Moore was born in Nashua, New Hampshire, on April 10, 1984, to Stacy (Friedman), a former news reporter, and Don Moore, an airline pilot. During her childhood, her family moved to Orlando, Florida, where she was raised. She has Russian Jewish (from her maternal grandfather), English, and some Scottish and Irish, ancestry. After seeing the musical \"Oklahoma!\", she decided that she wanted to pursue a career in singing. As a child, she performed the National Anthem at several athletic events around her hometown of Orlando, Florida, and became known as the \"National Anthem girl\". At the ripe age of 14, while she was recording in a studio in Orlando, a Fed-Ex worker who happened to be passing through heard her and was interested in her talent. He happened to know someone at Sony as well. Moore worked on cutting a demo and shortly thereafter signed a record deal with Sony 550 Music. At 15, her first record \"So Real\" was released. Her first tour was with the Backstreet Boys. As her touring and recording schedule demanded more of her time, Moore withdrew from Bishop Moore Catholic High School in Orlando and opted for a tutor/correspondence. She has stated that her education is important to her and says that the fact that she wants to go to college motivates her to continue with her schooling. Though Moore's record sales were not up in the ranks of Britney Spears or Christina Aguilera, she has proved to be a formidable talent both in singing and in acting, and snagged an MTV Movie Award in June 2002 for her first feature film role in A Walk to Remember (2002). Her biggest dream, though, is to perform on Broadway someday.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NTEzNDgzOF5BMl5BanBnXkFtZTcwNTMwNjk4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0601553","name":"Mandy Moore","idIMDB":"nm0601553"},"actorId":"nm0601553","character":"Sadie Jones","urlCharacter":"http://www.imdb.com/character/ch0115129","main":true},{"actorName":"John Krasinski","urlProfile":"http://www.imdb.com/name/nm1024677","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MzY3MjQ3OV5BMl5BanBnXkFtZTcwODI3NjQxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1979","placeOfBirth":" Newton, Massachusetts, USA","birthName":"John Burke Krasinski","height":"6' 3\" (1.91 m)","bio":"Tall, handsome American film and television star John Krasinski is probably best known for his role as sardonic nice guy \"Jim Halpert\" on NBC's popular TV series, The Office (2005), for which he won a 2007 and 2008 Screen Actors Guild Award for outstanding performance by an ensemble in a comedy series. Born John Burke Krasinski on October 20, 1979, in Newton, Massachussetts, USA, he is the youngest of three brothers. His mother, Mary Claire (Doyle), is a nurse, and his father, Ronald Krasinski, is an internist. His father is of Polish descent and his mother is of Irish ancestry. His first stage experience was starring in a satirical high school play, written and cast by B.J. Novak. Also good at sports, he played on the same Little League baseball team as B.J. Novak, now a writer and co-star on The Office (2005). After graduating from Newton South High School in 1997, Krasinski planned to be an English major and deferred his first semester of college to teach English in Costa Rica. He attended Brown University, graduating in 2001, as a playwright with honors, then studied at the Eugene O'Neill National Theatre Institute in Waterford, Connecticut. During the summer of 2000, he worked as a script intern on Late Night with Conan O'Brien (1993). Krasinski made his big screen debut in 2002, then played several small roles like \"Ben\" in Kinsey (2004), and \"Bob Flynn\" in Duane Hopwood (2005). He appeared as \"Corporal Harrigan\" in Jarhead (2005), by director Sam Mendes, then played a supporting role as \"Ben\" in The Holiday (2006), a romantic comedy by director Nancy Meyers. He is billed as the voice of \"Lancelot\" in Shrek the Third (2007). Krasinski co-starred opposite Robin Williams and Mandy Moore in the romantic comedy License to Wed (2007), as well as with George Clooney and Renée Zellweger in the football screwball comedy, Leatherheads (2008). He is also director and writer of Brief Interviews with Hideous Men (2009), a big screen adaptation of the eponymous collection of short stories by David Foster Wallace. Krasinski was featured in People Magazine's Sexiest Men Alive issue of 2006. He claims Los Angeles as his current home but travels to New York City and his hometown of Newton, MA, frequently.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MzY3MjQ3OV5BMl5BanBnXkFtZTcwODI3NjQxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1024677","name":"John Krasinski","idIMDB":"nm1024677"},"actorId":"nm1024677","character":"Ben Murphy","urlCharacter":"http://www.imdb.com/character/ch0122392","main":true},{"actorName":"Eric Christian Olsen","urlProfile":"http://www.imdb.com/name/nm0647638","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMDc3NzIxMl5BMl5BanBnXkFtZTcwMjY5MDkyMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1977","placeOfBirth":" Eugene, Oregon, USA","height":"6' 2\" (1.88 m)","bio":"Eric Christian Olsen was born on May 31, 1977 in Eugene, Oregon, USA. He is an actor and producer, known for NCIS: Los Angeles (2009), The Thing (2011) and Not Another Teen Movie (2001). He has been married to Sarah Wright since June 23, 2012. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMDc3NzIxMl5BMl5BanBnXkFtZTcwMjY5MDkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0647638","name":"Eric Christian Olsen","idIMDB":"nm0647638"},"actorId":"nm0647638","character":"Carlisle","urlCharacter":"http://www.imdb.com/character/ch0420295","main":true},{"actorName":"Christine Taylor","urlProfile":"http://www.imdb.com/name/nm0852132","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2ODAwODE5Nl5BMl5BanBnXkFtZTcwMjA4NjYyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1971","placeOfBirth":" Allentown, Pennsylvania, USA","birthName":"Christine Joan Taylor","height":"5' 6\" (1.68 m)","bio":"Christine Taylor was born on July 30, 1971 in Allentown, Pennsylvania, USA as Christine Joan Taylor. She is an actress, known for Dodgeball: A True Underdog Story (2004), Zoolander (2001) and The Wedding Singer (1998). She has been married to Ben Stiller since May 13, 2000. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2ODAwODE5Nl5BMl5BanBnXkFtZTcwMjA4NjYyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0852132","name":"Christine Taylor","idIMDB":"nm0852132"},"actorId":"nm0852132","character":"Lindsey Jones","urlCharacter":"http://www.imdb.com/character/ch0420297","main":true},{"actorName":"Josh Flitter","urlProfile":"http://www.imdb.com/name/nm1346160","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQzMDI0MzYzNl5BMl5BanBnXkFtZTgwOTc5NjcwMDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1994","placeOfBirth":" Ridgewood, New Jersey, USA","height":"5' 3\" (1.6 m)","bio":"Josh Flitter was born in Ridgewood NJ and grew up in Marlboro NJ. Josh was discovered by a local management company TM Talent when he was 5 years old and began to book commercials and small parts on various TV shows. Josh got a great break at the age of 8 when he auditioned for Bravos reality series \"Situation Comedy\" and was chosen out of hundreds of boys to play the lead of Stephen in \"Stephens Life\" . Sean Hayes and Todd Millner produced the series and Fred Savage directed. Josh was also cast as the youngest brother of 4 in \"My Life With Men\" for and ABC pilot which starred Wendi Malick. At the ripe age of 10, Josh auditioned for Bill Paxton who then directed him along with Shia LeBeouf in \"The Greatest Game Ever Played\". Josh was cast as Eddie Lowery , the pint sizes caddie to the amateur golfer Francis Ouimet portrayed by Shia Le Beouf. Josh was spotted by the great producer Jerry Weintraub while appearing on the Jay Leno show and Jerry personally called him to ask him to play the role of Corky in \" Nancy Drew\" starring Emma Roberts. Jerry said that he would re write the role for him if he took it and he did! After the success of Nancy Drew , Josh was offered many opportunities and landed the role of Mike, choir boy in \"License to Wed' opposite the great Robin Williams. While promoting the film on Larry King, Robin Williams said he never saw such comedy timing in a young kid like he did in Josh. Josh went on to appear in several episodics and feature films into his teen years. Josh recently graduated for SVA in New York City with his BFA in Directing. Josh continues to work when the opportunities arise and also studies and takes classes with the improv company ,The Upright Citizens Brigade.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQzMDI0MzYzNl5BMl5BanBnXkFtZTgwOTc5NjcwMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1346160","name":"Josh Flitter","idIMDB":"nm1346160"},"actorId":"nm1346160","character":"Choir Boy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"DeRay Davis","urlProfile":"http://www.imdb.com/name/nm1154986","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxODI1MDE1M15BMl5BanBnXkFtZTcwNDAxMjEzMQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"birthName":"Antoine DeRay Davis","height":"6' 2\" (1.88 m)","bio":"DeRay Davis was born in Chicago, Illinois, USA as Antoine DeRay Davis. He is an actor and writer, known for 21 Jump Street (2012), Wild 'N Out (2005) and Danse avec Raya (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxODI1MDE1M15BMl5BanBnXkFtZTcwNDAxMjEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1154986","name":"DeRay Davis","idIMDB":"nm1154986"},"actorId":"nm1154986","character":"Joel","urlCharacter":"http://www.imdb.com/character/ch0420299","main":true},{"actorName":"Peter Strauss","urlProfile":"http://www.imdb.com/name/nm0005471","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MjQ3MTc1MF5BMl5BanBnXkFtZTgwMjU1NTgwNDE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1947","placeOfBirth":" Croton-on-Hudson, New York, USA","birthName":"Peter Lawrence Strauss","height":"5' 11½\" (1.82 m)","bio":"Peter Strauss has focused on theater for the last few years. He recently performed the role of Leonardo da Vinci in \"Divine Rivalry\" at Hartford Stage, Ben Bradlee in \"Top Secret: The Battle for the Pentagon Papers\" for the New York Theater Workshop, Sigmund Freud in \"Sabina\" for Primary Stages and in \"The Outgoing Tide\" as an Alzheimer's patient for the Delaware Theater and Primary Stages in NY. Recent film roles are Warner Brothers' feature \"License to Wed\" with Robin Williams and as the U.S. President in Columbia's \"XXX: State of the Union,\" and two independent films \"Drawing Home\" and \"Sugar Baby.\" He completed the English voiceover for Albert Lamorisse's 1953 French film \"White Mane\" and as the narrator for Tracey Ullman's \"State of the Union\" series for Showtime. Strauss is well known for his long list of starring roles in motion pictures-for-television, including \"The Jericho Mile\" for which he won the Emmy Award for Outstanding Lead Actor in a Limited Series or Special. Strauss has also received Emmy Award nominations for his roles in the mini-series \"Rich Man, Poor Man\" and \"Masada\" as well as five Golden Globe Nominations. Strauss was born in New York City and grew up in Croton-on-Hudson, New York, where he was introduced to the theatre via the Croton Shakespeare Festival. His summers were spent with stock companies including the Pocono Playhouse in Pennsylvania and Ogunquit Playhouse in Maine. He attended the Hackley School for Boys in Tarrytown, New York and graduated from Northwestern University in 1969, committed to an acting career. He made his Broadway debut in Tom Griffin's \"Einstein and the Polar Bear\" in 1981. His other theatrical credits include the plays \"The Dance Next Door\", \"The Mind with the Dirty Man\" and \"The Trial of the Catonsville Nine\" at the Mark Taper Forum in Los Angeles and \"A Cry of Players\" at Baltimore's Center Stage. His feature film credits include Soldier Blue (1970), The Trial of the Catonsville Nine (1972), The Last Tycoon (1976), The Secret of NIMH (1982), Flight of Black Angel (1991) and Nick of Time (1995). Strauss' many television credits include starring in the TV films Young Joe, the Forgotten Kennedy (1977), Angel on My Shoulder (1980), A Whale for the Killing (1981), Heart of Steel (1983), Under Siege (1986), _Penalty Phase (1986) (TV)_, Proud Men (1987), 83 Hours 'Til Dawn (1990), Fugitive Among Us (1992), Men Don't Tell (1993), Thicker Than Blood (1994), Reunion (1980), The Yearling (1994), In the Lake of the Woods (1996), My Father's Shadow: The Sam Sheppard Story (1998), A Father's Choice (2000) and Murder on the Orient Express (2001), as well as the miniseries Tender Is the Night (1985), Kane & Abel (1985), Brotherhood of the Rose (1989), Trial: The Price of Passion (1992) and Texas Justice (1995). His latest mini-series appearances were Seasons of Love (1999), with Rachel Ward and Hume Cronyn, (which he executive-produced) and as La Hire in the CBS four-hour mini-series Joan of Arc (2005). Strauss starred for one season in the CBS drama series Moloney (1996) and the PAX drama series Body & Soul (2002). Strauss is married to actress Rachel Ticotin and lives in Ojai, California, where he also operates a commercial citrus enterprise that produces 440 tons of citrus per year.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MjQ3MTc1MF5BMl5BanBnXkFtZTgwMjU1NTgwNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005471","name":"Peter Strauss","idIMDB":"nm0005471"},"actorId":"nm0005471","character":"Mr. Jones","urlCharacter":"http://www.imdb.com/character/ch0420304","main":true},{"actorName":"Grace Zabriskie","urlProfile":"http://www.imdb.com/name/nm0951471","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MzI4ODkyOF5BMl5BanBnXkFtZTgwMTc5NDIzNTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 May 1941","placeOfBirth":" New Orleans, Louisiana, USA","birthName":"Grace Zabriskie Caplinger","height":"5' 4\" (1.63 m)","bio":"\"Amazing Grace\" Zabriskie was born in New Orleans, Louisiana. She wrote her own original poetry, then performed at coffee shops and various artist hangouts in Atlanta. She was also a wonderful silk-screen printmaker. She moved to Hollywood and made her acting debut in Norma Rae (1979). She went on to appear in over 80 movies. She gave an acclaimed performance as Mrs. Ames in East of Eden (1981), the adaptation of John Steinbeck's novel. Grace appeared in the highly acclaimed and Oscar-nominated An Officer and a Gentleman (1982) and The Big Easy (1986), set in her beloved New Orleans. She worked with producer and director David Lynch, and was a series regular in the cult favorite Twin Peaks (1990) as Sarah Palmer, the part with which she is most often identified. She also appeared in Lynch's Wild at Heart (1990) the same year. She has played a wide variety of roles, and gave a terrific performance in the Oscar-nominated Fried Green Tomatoes (1991) and showed great character depth as the lonely and despondent widow in The Passion of Darkly Noon (1995). Grace's more recent roles were in the zany Sparkler (1997) and in the big-name feature Sans motif apparent (2002), based on a short story by Dashiell Hammett. A woman of many talents, she is currently creating her own original paintings, unique sculptures and woodwork art that can be viewed in Los Angeles galleries. Her visual arts, which include creating lamps or \"sculptures with light\" as she calls them, are available from the L.A.-based ArtHaus.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MzI4ODkyOF5BMl5BanBnXkFtZTgwMTc5NDIzNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0951471","name":"Grace Zabriskie","nicknames":["Gracie"],"idIMDB":"nm0951471"},"actorId":"nm0951471","character":"Grandma Jones","urlCharacter":"http://www.imdb.com/character/ch0420306","main":true},{"actorName":"Roxanne Hart","urlProfile":"http://www.imdb.com/name/nm0366509","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ0MzM4Mzc0NV5BMl5BanBnXkFtZTcwNjIzNjEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 July 1952","placeOfBirth":" Trenton, New Jersey, USA","height":"5' 8\" (1.73 m)","bio":"Roxanne Hart was born July 27, 1952 in Trenton, New Jersey, to Joan Irene (McKee) and Edward J. Hart, Jr. Her father was a teacher who later became the school principal at Horace Greeley High School in Chappaqua, New York. Roxanne graduated from Greeley in 1969. She appeared in several Broadway productions before she made her film debut performance in The Verdict (1982). She played the part of Sally Doneghy. Since, she made appearances in a number of films, including Once Around (1991) with Holly Hunter, Showtime's made-for-television film Alone (1997) supporting an all-star cast ensemble, including, Hume Cronyn, James Earl Jones, Chris Cooper and Shelley Duvall. And The Good Girl (2002) starring Jennifer Aniston.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ0MzM4Mzc0NV5BMl5BanBnXkFtZTcwNjIzNjEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0366509","name":"Roxanne Hart","idIMDB":"nm0366509"},"actorId":"nm0366509","character":"Mrs. Jones","urlCharacter":"http://www.imdb.com/character/ch0420307","main":true},{"actorName":"Mindy Kaling","urlProfile":"http://www.imdb.com/name/nm1411676","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQ2OTUzNDU1MF5BMl5BanBnXkFtZTcwODQ2MTYyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 June 1979","placeOfBirth":" Cambridge, Massachusetts, USA","birthName":"Vera Chokalingam","height":"5' 4\" (1.63 m)","bio":"Mindy Kaling was born on June 24, 1979 in Cambridge, Massachusetts, USA as Vera Chokalingam. She is an actress and producer, known for The Office (2005), Inside Out (2015) and Wreck-It Ralph (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQ2OTUzNDU1MF5BMl5BanBnXkFtZTcwODQ2MTYyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1411676","name":"Mindy Kaling","idIMDB":"nm1411676"},"actorId":"nm1411676","character":"Shelly","urlCharacter":"http://www.imdb.com/character/ch0420308","main":true},{"actorName":"Angela Kinsey","urlProfile":"http://www.imdb.com/name/nm1526554","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzOTM0MzY4MF5BMl5BanBnXkFtZTgwODUxMjQ4NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 June 1971","placeOfBirth":" Lafayette, Louisiana, USA","birthName":"Angela Faye Kinsey","height":"5' 1\" (1.55 m)","bio":"Angela is an American actress. She was born in Louisiana, but raised from the age of 2 in Jakarta, Indonesia. Her father was working as a drilling engineer. During her time there, she attended the Jakarta International English School and learned to speak Indonesian. When she was age 14, her family returned to America and settled in Texas; where her parents were originally from. Angela attended Baylor University in Waco, Texas. She studied English and graduated in 1993. During her time there, she also participated in the Baylor in London program, which allowed her to experience theater in London, UK. She had been involved in theater throughout her schooling. After college, she gained an internship on the Conan O'Brien show. She took acting classes in New York, and then moved on to LA. She got involved with The Groundlings and Improv Olympic. She started out in commercials and got her first TV job on Step by Step (1991). Her breakthrough role came when she was cast as Angela in The Office (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzOTM0MzY4MF5BMl5BanBnXkFtZTgwODUxMjQ4NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1526554","name":"Angela Kinsey","idIMDB":"nm1526554"},"actorId":"nm1526554","character":"Judith the Jewelry Clerk","urlCharacter":"http://www.imdb.com/character/ch0420311","main":true},{"actorName":"Rachael Harris","urlProfile":"http://www.imdb.com/name/nm0006713","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNzQ3MDYzNl5BMl5BanBnXkFtZTgwODEzMTc2MTE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 January 1968","placeOfBirth":" Worthington, Ohio, USA","birthName":"Rachael Elaine Harris","height":"5' 1\" (1.55 m)","bio":"Rachael Harris was born on January 12, 1968 in Worthington, Ohio, USA as Rachael Elaine Harris. She is known for her work on The Hangover (2009), Diary of a Wimpy Kid (2010) and Lucifer (2015). She has been married to Christian Hebel since April 30, 2015. They have one child. She was previously married to Adam Paul.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNzQ3MDYzNl5BMl5BanBnXkFtZTgwODEzMTc2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006713","name":"Rachael Harris","idIMDB":"nm0006713"},"actorId":"nm0006713","character":"Janine","urlCharacter":"http://www.imdb.com/character/ch0420310","main":true},{"actorName":"Brian Baumgartner","urlProfile":"http://www.imdb.com/name/nm1580911","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzE2OTUyNV5BMl5BanBnXkFtZTYwMjQzMjgy._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 November 1972","placeOfBirth":" Atlanta, Georgia, USA","birthName":"Brian Bruce Baumgartner","height":"6' 1\" (1.85 m)","bio":"Brian Baumgartner was born on November 29, 1972 in Atlanta, Georgia, USA as Brian Bruce Baumgartner. He is an actor, known for The Office (2005), License to Wed (2007) and Tout... sauf en famille (2008). He has been married to Celeste Ackelson since April 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzE2OTUyNV5BMl5BanBnXkFtZTYwMjQzMjgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1580911","name":"Brian Baumgartner","idIMDB":"nm1580911"},"actorId":"nm1580911","character":"Jim","urlCharacter":"http://www.imdb.com/character/ch0420314","main":true},{"actorName":"Jess Rosenthal","urlProfile":"http://www.imdb.com/name/nm2197949","urlPhoto":"","biography":{"bio":"Jess Rosenthal is a producer and actress, known for This Is Us (2016), Fire with Fire (2012) and The Lies of Locke Lamora.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2197949","name":"Jess Rosenthal","idIMDB":"nm2197949"},"actorId":"nm2197949","character":"Jewelry Clerk","urlCharacter":"http://www.imdb.com/character/ch0420316","main":true}],"seasons":[],"idIMDB":"tt0762114","urlIMDB":"http://www.imdb.com/title/tt0762114","business":{"budget":{"money":"$35,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$10,422,258","country":"USA","day":"08","month":"07","year":"2007","remarks":"2,604 Screens"},{"money":"£268,016","country":"UK","day":"12","month":"08","year":"2007","remarks":"201 Screens"}],"gross":[{"money":"$43,799,818","country":"USA","day":"04","month":"10","year":"2007","remarks":""},{"money":"$43,792,641","country":"USA","day":"30","month":"09","year":"2007","remarks":""},{"money":"$43,745,954","country":"USA","day":"23","month":"09","year":"2007","remarks":""},{"money":"$43,663,263","country":"USA","day":"16","month":"09","year":"2007","remarks":""},{"money":"$43,528,027","country":"USA","day":"09","month":"09","year":"2007","remarks":""},{"money":"$43,345,166","country":"USA","day":"02","month":"09","year":"2007","remarks":""},{"money":"$43,107,771","country":"USA","day":"26","month":"08","year":"2007","remarks":""},{"money":"$43,016,065","country":"USA","day":"19","month":"08","year":"2007","remarks":""},{"money":"$42,893,457","country":"USA","day":"12","month":"08","year":"2007","remarks":""},{"money":"$42,678,633","country":"USA","day":"05","month":"08","year":"2007","remarks":""},{"money":"$41,707,459","country":"USA","day":"29","month":"07","year":"2007","remarks":""},{"money":"$38,495,133","country":"USA","day":"22","month":"07","year":"2007","remarks":""},{"money":"$17,838,076","country":"USA","day":"08","month":"07","year":"2007","remarks":""},{"money":"£895,745","country":"UK","day":"26","month":"08","year":"2007","remarks":""},{"money":"£719,521","country":"UK","day":"19","month":"08","year":"2007","remarks":""},{"money":"£268,016","country":"UK","day":"12","month":"08","year":"2007","remarks":""}],"weekendGross":[{"money":"$31,662","country":"USA","day":"30","month":"09","year":"2007","remarks":"77 Screens"},{"money":"$54,336","country":"USA","day":"23","month":"09","year":"2007","remarks":"125 Screens"},{"money":"$94,088","country":"USA","day":"16","month":"09","year":"2007","remarks":"211 Screens"},{"money":"$144,041","country":"USA","day":"09","month":"09","year":"2007","remarks":"234 Screens"},{"money":"$216,889","country":"USA","day":"02","month":"09","year":"2007","remarks":"303 Screens"},{"money":"$55,168","country":"USA","day":"26","month":"08","year":"2007","remarks":"103 Screens"},{"money":"$69,191","country":"USA","day":"19","month":"08","year":"2007","remarks":"94 Screens"},{"money":"$113,446","country":"USA","day":"12","month":"08","year":"2007","remarks":"135 Screens"},{"money":"$238,042","country":"USA","day":"05","month":"08","year":"2007","remarks":"305 Screens"},{"money":"$1,287,411","country":"USA","day":"29","month":"07","year":"2007","remarks":"1,610 Screens"},{"money":"$3,577,230","country":"USA","day":"22","month":"07","year":"2007","remarks":"2,525 Screens"},{"money":"$10,422,258","country":"USA","day":"08","month":"07","year":"2007","remarks":"2,604 Screens"},{"money":"£40,988","country":"UK","day":"26","month":"08","year":"2007","remarks":"113 Screens"},{"money":"£148,873","country":"UK","day":"19","month":"08","year":"2007","remarks":"199 Screens"},{"money":"£268,016","country":"UK","day":"12","month":"08","year":"2007","remarks":"201 Screens"}],"admissions":[{"money":"76,018","country":"Germany","day":"02","month":"09","year":"2007","remarks":""},{"money":"33,945","country":"Netherlands","day":"31","month":"12","year":"2007","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"16","month":"05","year":"2006","remarks":null},null],"copyrightHolder":"Warner Bros. Entertainment Inc. - U.S., Canada, Bahamas &amp; Bermuda; Village Roadshow Films (BVI) Limited - All Other Territories"},"technical":{"runtime":["1 hr 31 min (91 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color (Technicolor)"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Camera and Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":["2,416 m (Portugal, 35 mm)"],"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm (Fuji Eterna-CP 3513DI)"]},"rating":"5.3","metascore":"25","filmingLocations":[{"location":"Chicago, Illinois, USA"}],"rated":"PG-13","awards":[{"award":"Teen Choice Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie: Chick Flick","names":[]}]}]}],"votes":"33,172","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."},{"idCompany":"co0108864","name":"Village Roadshow Pictures"},{"idCompany":"co0033486","name":"Robert Simonds Productions"}],"keywords":{"keywords":["church","wedding","kiss","usa","wedding reception","talking to the camera","character says i love you","photographer","female photographer","nikon camera","episcopalian","wilhelm scream","priest","premarital counseling","minister","marriage proposal"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 01:03:53"}}