{"data":{"movies":[{"title":"Loaded","originalTitle":"","year":"2008","releaseDate":"20080325","directors":[{"name":"Alan Pao","id":"nm1284023"}],"writers":[{"name":"Kyle Kramer","id":"nm1436140"},{"name":"Corey Large","id":"nm1143429"}],"runtime":"98 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NjIxNDgzOV5BMl5BanBnXkFtZTcwMDE0NjQ2MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Crime","Drama","Thriller"],"plot":"A young, wealthy club kid's life spirals downward into an out-of-control world of drugs, sex and violence.","simplePlot":"A young, wealthy club kid's life spirals downward into an out-of-control world of drugs, sex and violence.","actors":[{"actorName":"Jesse Metcalfe","urlProfile":"http://www.imdb.com/name/nm0582462","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI3NTQ0NTY1Ml5BMl5BanBnXkFtZTgwMDEwNTIwNzE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 December 1978","placeOfBirth":" Carmel Valley, California, USA","birthName":"Jesse Eden Metcalfe","height":"5' 10\" (1.78 m)","bio":"Jesse Eden Metcalfe was born in Carmel Valley, California, to Nancy (DeMaio) and Jeff Metcalfe. He has Italian, Portuguese, English, French, and Irish ancestry. He was raised in Southeastern Connecticut. Metcalfe attended the Williams School, a private high school in New London, Connecticut. He pursued his higher education at New York University where he studied acting and film at the prestigious Tisch School of the Arts. Metcalfe first appeared on the small screen in NBC's daytime drama, 'Passions', but rose to fame on the mega-hit series, 'Desperate Housewives' playing teenage boy-toy, John Rowland. He's since been the lead in both studio and independent features. Best known for carrying Twentieth Century Fox's successful teen-comedy \"John Tucker Must Die\" and starring opposite Michael Douglas in \"Beyond A Reasonable Doubt\". 2011 saw Jesse cast in TNT's reboot of the iconic series, 'Dallas'. Playing the Christopher Ewing, son of Bobby Ewing (Patrick Duffy). Metcalfe is an avid art enthusiast and collector, plays both guitar and piano, enjoys basketball, boxing and weight training.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI3NTQ0NTY1Ml5BMl5BanBnXkFtZTgwMDEwNTIwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0582462","name":"Jesse Metcalfe","idIMDB":"nm0582462"},"actorId":"nm0582462","character":"Tristan Price","urlCharacter":"http://www.imdb.com/character/ch0166561","main":true},{"actorName":"Corey Large","urlProfile":"http://www.imdb.com/name/nm1143429","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1Nzc2NTk0MV5BMl5BanBnXkFtZTcwNDUyNjY3Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 October 1975","placeOfBirth":" Victoria, British Columbia, Canada","birthName":"Corey William Large","height":"6' 2\" (1.88 m)","bio":"Corey is from Victoria, British Columbia, Canada. He is a huge sports fan and his goal was to be a pro baseball player. An injury cut that short and led to his other love, acting. He moved to Vancouver at 21 and started getting roles right away. He currently resides in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1Nzc2NTk0MV5BMl5BanBnXkFtZTcwNDUyNjY3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1143429","name":"Corey Large","idIMDB":"nm1143429"},"actorId":"nm1143429","character":"Sebastian","urlCharacter":"http://www.imdb.com/character/ch0095473","main":true},{"actorName":"Monica Keena","urlProfile":"http://www.imdb.com/name/nm0444621","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxODA2OTYwM15BMl5BanBnXkFtZTYwNTIzNDA4._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 May 1979","placeOfBirth":" Brooklyn, New York, USA","birthName":"Monica C. Keena","height":"5' 1½\" (1.56 m)","bio":"Monica Keena was born in New Jersey on May 28, 1979, to Bill and Mary Keena and was little sister to Samantha, the Keenas' first daughter. Growing up, Monica shone in all things arts. Dance, singing, acting, and drawing. At 13, Keena enrolled in the prestigious LaGuardia school for acting and made it. At age 15, she had a small role in her first film, and that was followed by a series of TV movies, such as First Daughter (1999) and the A Promise Kept: The Oksana Baiul Story (1994). Monica starred in her first movie, Ripe (1996), at 16 and considers that her favorite role, as of now. In 1998, she premiered on the WB's Dawson's Creek (1998) as truth-telling \"Abby Morgan\" and later left the show when she \"got bored playing one character\". Today, Monica continues to make movies like Freddy vs. Jason (2003), Man of the House (2005), and Fifty Pills (2006). In her free time, she enjoys skating.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxODA2OTYwM15BMl5BanBnXkFtZTYwNTIzNDA4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0444621","name":"Monica Keena","nicknames":["Monikers"],"idIMDB":"nm0444621"},"actorId":"nm0444621","character":"Brooke","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nathalie Kelley","urlProfile":"http://www.imdb.com/name/nm2036142","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDk4MzU1NDUtMjE2Ny00MzQ3LTg0M2QtOTk5ZGY4YzgzZjRmL2ltYWdlXkEyXkFqcGdeQXVyMzQ3ODI0MDk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 March 1985","placeOfBirth":" Lima, Peru","height":"5' 6\" (1.68 m)","bio":"Born in Peru to a Peruvian mother and Argentine father, Nathalie immigrated to Sydney, Australia at 2 years old where she later attended the academically prestigious North Sydney Girls High School, whose alumni includes Nicole Kidman and Catherine Martin. She showed an a interest in acting at a young age and enrolled in summer classes at NIDA. One of her teachers was Australian actor Nick Bishop who, 10 years later, would play her love interest on the ABC show Body of Proof. As a teenager she spent her summers in Brazil where she immersed herself in Brazilian dance and learned to speak Portuguese fluently. When she was 18 years old she found herself living in São Paulo, Brazil, splitting her time between modeling for the agency L'Equipe and working with street children. The latter eventually convinced her to return to Australia and begin a degree in Political Science at the University Of New South Wales, majoring in Third World Development. During her studies Nathalie volunteered with and became very close to Aboriginal community in the inner city suburb of Redfern. It was during his time that Nathalie's big break came when she booked the lead role in the Brad Kern/ Aaron Spelling pilot 'Mermaid', for which she deferred her degree and moved to Los Angeles. A few months later she had booked a role in Fast and Furious Tokyo Drift as the lead female, Neela. For the role Nathalie learned Japanese in addition to drifting. The movie was followed by roles in films such as Take Me Home Tonight, during which time she also starred in Bruno Mars' first solo release 'Just The Way You Are\". Her role of Dani spanned 8 episodes over Season 2 of Body of Proof on ABC. And most recently Nathalie just wrapped a pilot for Lifetime titled Unreal. At the present moment Nathalie is writing and pitching a travel show. In 2012 Nathalie embarked on an ongoing collaboration with cult photographer Neil Krug. She is currently (in 2014) residing in Vancouver filming a new Series for Lifetime titled Unreal.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDk4MzU1NDUtMjE2Ny00MzQ3LTg0M2QtOTk5ZGY4YzgzZjRmL2ltYWdlXkEyXkFqcGdeQXVyMzQ3ODI0MDk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2036142","name":"Nathalie Kelley","idIMDB":"nm2036142"},"actorId":"nm2036142","character":"April","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chace Crawford","urlProfile":"http://www.imdb.com/name/nm2003700","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4Nzc3Njc0N15BMl5BanBnXkFtZTgwMjE0MDEzMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1985","placeOfBirth":" Lubbock, Texas, USA","birthName":"Christopher Chace Crawford","height":"5' 10\" (1.78 m)","bio":"Christopher Chace Crawford was born in Lubbock, Texas, the son of Dana (Plott), a teacher, and Chris Wayne Crawford, a dermatologist. He grew up in Plano, Texas, and has a younger sister, Candice Crawford Romo, who studied broadcast journalism and won the Miss Missouri USA title in 2008. Chace played football and golf in high school, and is a talented artist. He graduated from Trinity Christian Academy in 2003. Although he worked as a model in Dallas, he never pursued acting. He moved to Malibu, California, to attend Pepperdine University after high school where he was a member of the Sigma Nu fraternity. He struggled to identify a career path, vacillating between advertising, business and communications majors. Midway through his second year, his mother encouraged him to pursue acting. He credits her for initiating this move. She stated that \"it was a practical move,\" based on a career aptitude test he had taken in high school, which revealed he was best suited for a career in the performing arts. He was signed by the first talent agent that interviewed him and then committed full-time to acting studies. In 2006, Chace appeared in Lifetime's television movie Rendez-moi mon fils! (2006), where he plays the son of Gabrielle Anwar's character. That same year, he starred alongside Steven Strait, Taylor Kitsch, Sebastian Stan and Toby Hemingway in the horror/thriller movie, The Covenant (2006). The year 2007 was a big break for Chace. He became one of the leads in CW's drama, Gossip Girl (2007). Among his cast members on the show are Penn Badgley, Leighton Meester & Ed Westwick. In the year 2008, Chace was seen in the movie Loaded (2008), opposite Jesse Metcalfe. He also got involved in the independent movie, The Haunting of Molly Hartley (2008) with Haley Bennett. His other guest appearance includes a stint on the Family Guy (1999) episode Family Guy: The Former Life of Brian (2008). Other than being involved in more acting projects, the year 2008 proved to be an even better year for Chace as he won the Choice TV Breakout Star Male at the Teen Choice Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4Nzc3Njc0N15BMl5BanBnXkFtZTgwMjE0MDEzMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2003700","name":"Chace Crawford","nicknames":["Chace"],"idIMDB":"nm2003700"},"actorId":"nm2003700","character":"Hayden Price","urlCharacter":"http://www.imdb.com/character/ch0101608","main":true},{"actorName":"Johnny Messner","urlProfile":"http://www.imdb.com/name/nm0582257","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0ODI3NDk4MF5BMl5BanBnXkFtZTcwMDc2OTYyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 April 1970","placeOfBirth":" Syracuse, New York, USA","height":"6' 1\" (1.85 m)","bio":"Johnny Messner was born on April 11, 1970 in Syracuse, New York, USA. He is an actor, known for Tears of the Sun (2003), Running Scared (2006) and Anacondas: The Hunt for the Blood Orchid (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0ODI3NDk4MF5BMl5BanBnXkFtZTcwMDc2OTYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0582257","name":"Johnny Messner","idIMDB":"nm0582257"},"actorId":"nm0582257","character":"Javon","urlCharacter":"http://www.imdb.com/character/ch0161017","main":true},{"actorName":"Jimmy Jean-Louis","urlProfile":"http://www.imdb.com/name/nm1097515","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ5MDE0OTgwMF5BMl5BanBnXkFtZTgwMDg0NjY0MDI@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 August 1968","placeOfBirth":" Pétion-Ville, Haiti","height":"5' 11¼\" (1.81 m)","bio":"Jimmy led a simple life in a remote village in Haiti until the age of twelve, when he moved to Paris. He has worked in musical theatre in Spain, spending three years with a musical theater \"La Belle Epoque\", and has had a successful career as an international model. Jimmy moved to Los Angeles in 1998 and immediately started honing his chosen craft by lending his abilities to underground and independent films. That eventually led to him landing a role in Jean Claude Van Damme's \"Derailed\", which set the stage for subsequent roles with other Hollywood A-listers. He went on to shoot \"Tears of the sun\" with Bruce Willis and Monica Belluci, \"Hollywood Homicide\" with Harrison Ford and Josh Hartnet, \"Monster-in-law\" with Jane Fonda and Jennifer Lopez and \"The Miracle match\" with Patrick Stewart, Wes Bentley and Gerard Butler. He played the lead role in \"The Diary of a tired black man \" and in \"Phat Girlz\" starring opposite Oscar winner Monique Imes Jackson as her love interest. Jimmy portrayed the charismatic Rene \"the Haitian\" in the hit TV show \"Heroes\". With an international appeal, he's been working in many parts of the world including France, England, Indonesia, Ghana, Nigeria...making full use of his ability to speak 5 different languages. He received a best actor nomination in the movie \"Sinking Sand\" at the AMAA 2011, the equivalent of the African Oscars.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ5MDE0OTgwMF5BMl5BanBnXkFtZTgwMDg0NjY0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1097515","name":"Jimmy Jean-Louis","idIMDB":"nm1097515"},"actorId":"nm1097515","character":"Antonio","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vinnie Jones","urlProfile":"http://www.imdb.com/name/nm0005068","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTM5NDg2MV5BMl5BanBnXkFtZTgwNjYxNjc1ODE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1965","placeOfBirth":" Watford, Hertfordshire, England, UK","birthName":"Vincent Peter Jones","height":"6' 2\" (1.88 m)","bio":"Vincent Peter Jones was born on January 5, 1965 in Watford, England. He first came to public notice as a professional footballer, playing in the English Football League. Noted as one of soccer's hard men, he leaped to fame when a photographer, at a match, snapped him \"marking\" Newcastle United's Paul Gascoigne, by grabbing his testicles. He has played for Wimbledon, Leeds United, Sheffield United, Chelsea, and Queens Park Rangers. Internationally, he played for Wales, qualifying for that nationality through his grandparents. He made his first acting appearance in the British comedy/thriller, Lock, Stock and Two Smoking Barrels (1998), at age 33, although he had previous presented a video on football's hard men (for which he was censured by the Football Association). He starred in the blockbuster, X-Men: L'affrontement final (2006), as \"Cain Marko\", also known as \"The Juggernaut\". Prior to that, he played the scowling soccer coach illustrating both his likability and comedic side in Dreamworks' She's the Man (2006), with Amanda Bynes. Other projects include a lead role in Johnny Was (2006), starring Roger Daltrey, Eriq La Salle and Lennox Lewis, and he also appears in the independent feature, The Riddle (2007), starring Vanessa Redgrave and Derek Jacobi. Over the years, he has received a number of prestigious awards, which showcase his accomplishments as a talented actor. In 1997, he won Satellite TV's \"Personality of the Year\", from Satellite TV Europe Magazine. In 1998, GQ Magazine named Jones \"Man of the Year\". He was awarded Best Actor for Lock, Stock and Two Smoking Barrels (1998) at the Odeon Audience Awards and also won the award for Outstanding New Talent from the Sir James Carreras Award Variety Club of GB. Jones won Best Debut in 1999 for Lock, Stock and Two Smoking Barrels (1998) at Empire Magazine's \"The Awards 1999\" and was titled the Male Cigar Personality of the Year at the Millennium Cigar Awards. In 2001, he was named Best British Actor for Empire Magazine's \"The Awards 2001\". In 2002, Jones received the award for Best Supporting Actor for Night at the Golden Eagle (2001) at the New York Film Festival and, in 2005, he was honored with Best Newcomer for Slipstream (2005) at London's Sci-Fi Film Festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTM5NDg2MV5BMl5BanBnXkFtZTgwNjYxNjc1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005068","name":"Vinnie Jones","nicknames":["The Axe"],"idIMDB":"nm0005068"},"actorId":"nm0005068","character":"Mr.Black","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mitchell Baker","urlProfile":"http://www.imdb.com/name/nm1438289","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY5Mjg1Nzg4NV5BMl5BanBnXkFtZTYwMTI4ODky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Mitchell Baker is known for his work on In the Land of Women (2007), Poker Night (2014) and Kid Cannabis (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY5Mjg1Nzg4NV5BMl5BanBnXkFtZTYwMTI4ODky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1438289","name":"Mitchell Baker","idIMDB":"nm1438289"},"actorId":"nm1438289","character":"Damon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mary Christina Brown","urlProfile":"http://www.imdb.com/name/nm1731712","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2ODA4NDU3OTdeQTJeQWpwZ15BbWU4MDI0NjEwNTcx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Mary Christina Brown","height":"5' 5\" (1.65 m)","bio":"Mary Christina Brown is an American actress with a multicultural background of Dutch, Irish, English, Welsh, Native American from her father's side and South Korean and Japanese from her mother's side. She is also culturally influenced with the Filipino and Chinese culture from her stepmother. She was born in Fort Bragg, North Carolina. After moving around the country during her early childhood, she finally settled with her family in San Francisco at the age of seven. No matter where she lived she always held a passion for both the performing arts and martial arts. She booked her first commercial for Fox television at age seven and started modeling for print advertising campaigns shortly thereafter. She danced professionally all her life, varying from tap, jazz, modern, ballet, hip hop, and even traditional Hawaiian and Tahitian. Mary Christina is also classically trained in voice and played the violin and cello. While living in San Francisco and attending performing art schools (The Bennett Theatre Lab & Conservatory, A.C.T. Conservatory, School of the Arts High School, Young People's Musical Theater Company, to name a few), she decided to fully commit to her creative endeavors. After a short stint in Silicon Valley as a Network Technician and Internet Systems Engineer, Mary Christina decided to move to Los Angeles to pursue a career in the Arts and Entertainment industry. As an actress, Mary Christina combines all her talents, including her physical skills in yoga, dance, and martial arts to fully express and commit in subtle ways that brings life to the characters she portrays. Mary Christina has worked on different films playing a variety of characters across the spectrum. Some of her works are as follows: \"Blood and Bone\" playing Anastasia, a henchman alongside Julian Sands in the Michael Jai White action drama film and \"Dark Island\" playing Rachel Gant, a special ops soldier in the indie Sci-Fi Action Thriller with Jai Koutrae and Zero Kazama, \"Night of the Templar\" playing Japoniko, a mysterious minimalist swords woman seeking revenge acting opposite Norman Reedus, Udo Kier, and the late David Carradine and featured as Jasmine, a courtesan in \"The Man with the Iron Fists\" with Russell Crowe and in \"AWOL-72\" as Monica, an international undercover special agent with Luke Goss, Bokeem Woodbine and RZA. Most recently, Mary Christina worked on the Action Sci-Fi \"Max Steel\" and joined the international cast of Star World Asia, Asia's number one design TV show, The Apartment for its fourth season produced by Imagine Group in collaboration with Fox International Channels. She practices yoga and trains in dance, and different styles of martial arts.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2ODA4NDU3OTdeQTJeQWpwZ15BbWU4MDI0NjEwNTcx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1731712","name":"Mary Christina Brown","nicknames":["MC"],"idIMDB":"nm1731712"},"actorId":"nm1731712","character":"Lin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeff Chase","urlProfile":"http://www.imdb.com/name/nm0153779","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MzQwMTc1NF5BMl5BanBnXkFtZTcwMzQ0OTE5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 January 1968","placeOfBirth":" Paterson, New Jersey, USA","birthName":"Jeffrey L. Sniffen","height":"6' 7\" (2.01 m)","bio":"Born Jeffrey Lance Sniffen. Graduate of Passiac Valley Regional Valley Regional High School Little Falls NJ. Graduate of West Virginia University. Played football for the Mountaineers 1986-1991. Married to Kimberly 1991-2015 (Divorced). One son Cory Chase. Best Known for The Mechanic 2011, Mission Impossible 3, Star Trek 2009, 2013. Favorite Quote (unknown) \"If you are talking you are not listening.\" Best advice ever received.... Make your bed in the morning.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MzQwMTc1NF5BMl5BanBnXkFtZTcwMzQ0OTE5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0153779","name":"Jeff Chase","idIMDB":"nm0153779"},"actorId":"nm0153779","character":"Thug","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Taylor Cole","urlProfile":"http://www.imdb.com/name/nm1543157","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NDcyMTIwM15BMl5BanBnXkFtZTcwOTQzNzkzNA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1984","placeOfBirth":" Arlington, Texas, USA","birthName":"Taylor Quinn Cole","height":"5' 7\" (1.7 m)","bio":"Born and raised in Arlington, Texas, Taylor Cole had a fulfilling high school experience. Proving to be a gifted athlete, she played on her high school's volleyball team and traveled around the country with the Junior Olympics squad. Her stunning good looks also allowed her to travel around the world as a professional model doing photo shoots in Italy, France, Germany, Australia among many other countries. Taylor had recently relocated to New York City to pursue her modeling career further when the opportunity to guest-star in the pilot of Summerland (2004) arose. She was visiting her mother and step-dad (Shawn Christian) in Los Angeles when she landed an audition with the Summerland (2004) producers. She won them over and the recurring part became a regular role.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NDcyMTIwM15BMl5BanBnXkFtZTcwOTQzNzkzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1543157","name":"Taylor Cole","idIMDB":"nm1543157"},"actorId":"nm1543157","character":"Alex","urlCharacter":"http://www.imdb.com/character/ch0101574","main":true},{"actorName":"Shanna Collins","urlProfile":"http://www.imdb.com/name/nm1821051","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzczMzlmY2MtN2U3Ny00OGJkLThhM2ItNzI5NWIyZWVjZmJlXkEyXkFqcGdeQXVyMzk2NTY0OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1983","placeOfBirth":" Dallas, Texas, USA","birthName":"Shanna Dophalene Collins","height":"5' 8\" (1.73 m)","bio":"Shanna Collins was born on June 10, 1983 in Dallas, Texas, USA as Shanna Dophalene Collins. She is an actress, known for War of the Worlds (2005), Swingtown (2008) and Cinema Verite (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzczMzlmY2MtN2U3Ny00OGJkLThhM2ItNzI5NWIyZWVjZmJlXkEyXkFqcGdeQXVyMzk2NTY0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1821051","name":"Shanna Collins","idIMDB":"nm1821051"},"actorId":"nm1821051","character":"Jaime","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cameron Douglas","urlProfile":"http://www.imdb.com/name/nm0234979","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNjA1ODI0NF5BMl5BanBnXkFtZTcwNjMxODg0NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1978","placeOfBirth":" Santa Barbara, California, USA","birthName":"Cameron Morrell Douglas","height":"5' 11\" (1.8 m)","bio":"Cameron Douglas was born on December 13, 1978 in Santa Barbara, California, USA as Cameron Morrell Douglas. He is known for his work on It Runs in the Family (2003), Adam and Eve (2005) and Mr. Nice Guy (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNjA1ODI0NF5BMl5BanBnXkFtZTcwNjMxODg0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0234979","name":"Cameron Douglas","idIMDB":"nm0234979"},"actorId":"nm0234979","character":"Rick","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicole Eggert","urlProfile":"http://www.imdb.com/name/nm0001176","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NDY3NTc3M15BMl5BanBnXkFtZTYwNzU1MDA1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 January 1972","placeOfBirth":" Glendale, California, USA","birthName":"Nicole Elizabeth Eggert","height":"5' 2\" (1.57 m)","bio":"Nicole Eggert was born on January 13, 1972 in Glendale, California, USA as Nicole Elizabeth Eggert. She is known for her work on Charles in Charge (1984), Baywatch (1989) and Belle et dangereuse (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NDY3NTc3M15BMl5BanBnXkFtZTYwNzU1MDA1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001176","name":"Nicole Eggert","nicknames":["Nickel"],"idIMDB":"nm0001176"},"actorId":"nm0001176","character":"Allison Ryan","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0893406","urlIMDB":"http://www.imdb.com/title/tt0893406","business":{"budget":{"money":"$15,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"02","month":"10","year":"2006","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 38 min (98 min) (Netherlands)"],"soundMix":null,"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.6","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[],"votes":"2,647","type":"Movie","companyCreditsSimple":[{"idCompany":"co0109209","name":"Wingman Productions"},{"idCompany":"co0150217","name":"Tunnel Post"}],"keywords":{"keywords":["drugs","strip club","drug dealer","sex scene","female frontal nudity","female nudity","breasts","one word title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 05:44:36"}}