{"data":{"movies":[{"title":"Pandemic","originalTitle":"","year":"2007","releaseDate":"20070526","directors":[{"name":"Armand Mastroianni","id":"nm0557857"}],"writers":[{"name":"Bryce Zabel","id":"nm0007233"},{"name":"Jackie Zabel","id":"nm0951392"}],"runtime":"169 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5OTYxMjE5OV5BMl5BanBnXkFtZTcwNTUyMjE1MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Drama","Thriller"],"plot":"The bird flu virus spreads through Los Angeles as a doctor from the CDC races to find a vaccine.","simplePlot":"The bird flu virus spreads through Los Angeles as a doctor from the CDC races to find a vaccine.","actors":[{"actorName":"Tiffani Thiessen","urlProfile":"http://www.imdb.com/name/nm0005485","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjI3NTU2MjM5Ml5BMl5BanBnXkFtZTgwODQwNzM0NDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 January 1974","placeOfBirth":" Long Beach, California, USA","birthName":"Tiffany Amber Thiessen","height":"5' 5\" (1.65 m)","bio":"Tiffani-Amber Thiessen was born on January 23, 1974, in Long Beach, California, USA, to Frank Thiessen, a park designer, and Robyn Ernest, a homemaker. She grew up in Long Beach with her parents and her brothers, professional cyclist Todd (born August 1, 1968) and Schyler (born May 10, 1977). When Tiffani was 8, her uncle, Roger Ernest, suggested that she try acting and modeling. Soon afterward, she appeared in her first TV commercial, for Peaches and Cream Barbie. From there she started competing in several beauty pageants and, in 1987, she won the Miss Junior America pageant. She got her big break when she was cast as the popular cheerleader Kelly Kapowski on the NBC series Saved by the Bell (1989), which lasted for five years. But this was not at all the end of her career. Coinciding with the cancellation of the short-lived Saved by the Bell: The College Years (1993), she was cast as the bitchy, conniving vixen Valerie Malone on Aaron Spelling's long-running hit series Beverly Hills, 90210 (1990). Here, she played the constant enemy of Kelly Taylor, played by Jennie Garth, although in real life, the two are actually best friends. Tiffani also lived with co-star Brian Austin Green for several years. She stayed with the show until 1998 and then left to pursue her movie career. The result was two independent movies, followed by two comedies and then Hollywood Ending (2002), in which she starred alongside Woody Allen. She met actor Richard Ruccolo while guest starring as Marti in the hit sitcom Two Guys, a Girl and a Pizza Place (1998) where in 2001, the couple became engaged. During the fall of 2002, she hooked up with best friend Jennie's husband, Peter Facinelli, and Bill Bellamy on Fox's action/drama series, Fastlane (2002), where she starred as Billie Chambers, but the show was canceled after one season. In 2003, Tiffani broke off her engagement to Richard Ruccolo and in 2005, she married actor Brady Smith. The couple have two children, a daughter, Harper Smith (Harper Renn Smith) and a son, Holt Fisher Smith.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjI3NTU2MjM5Ml5BMl5BanBnXkFtZTgwODQwNzM0NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005485","name":"Tiffani Thiessen","nicknames":["Tiff"],"idIMDB":"nm0005485"},"actorId":"nm0005485","character":"Dr. Kayla Martin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"French Stewart","urlProfile":"http://www.imdb.com/name/nm0829390","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMTM1ODc1M15BMl5BanBnXkFtZTcwNTU2NjgyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1964","placeOfBirth":" Albuquerque, New Mexico, USA","birthName":"Milton French Stewart","height":"5' 10\" (1.78 m)","bio":"His mother is a homemaker and his step-father works in a technological laboratory. He is a graduate of the American Academy of Dramatic Arts with a B.F.A. in Theatre Arts. After graduation, he spent seven years touring in regional theatre. French, by the way, is his real name. It's a family name that's been used for generations. He's French number four.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMTM1ODc1M15BMl5BanBnXkFtZTcwNTU2NjgyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0829390","name":"French Stewart","idIMDB":"nm0829390"},"actorId":"nm0829390","character":"Dr. Carl Ratner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Faye Dunaway","urlProfile":"http://www.imdb.com/name/nm0001159","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4OTU5MDY0OV5BMl5BanBnXkFtZTYwNTc0MTM1._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 January 1941","placeOfBirth":" Bascom, Florida, USA","birthName":"Dorothy Faye Dunaway","height":"5' 7\" (1.7 m)","bio":"She is one of the great models who transitioned successfully into acting! \"Thomas Crown Affair\" being one of the greatest performances causing all to take notice! Playing intelligent women with ability to match her contemporary male powerful counterparts into in-depth presence of the changes appearing in time as images of histories \"Bonnie & Clyde\"; How Spirit and Mind transcend the age differences in \"Arizona Dreams\" as her \"performing a miracle\" for the great representation of France's historical continuance though \"The Messenger Jeanne D'arc ... \".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4OTU5MDY0OV5BMl5BanBnXkFtZTYwNTc0MTM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001159","name":"Faye Dunaway","nicknames":["Miss Faye"],"idIMDB":"nm0001159"},"actorId":"nm0001159","character":"Governor Lillian Schaefer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eric Roberts","urlProfile":"http://www.imdb.com/name/nm0000616","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MTk3OTgwM15BMl5BanBnXkFtZTcwODE1OTIwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1956","placeOfBirth":" Biloxi, Mississippi, USA","birthName":"Eric Anthony Roberts","height":"5' 10\" (1.78 m)","bio":"One of Hollywood's edgier, more intriguing characters running around and about for decades, Eric Anthony Roberts started life in Biloxi, Mississippi. He is the son of Betty Lou (Bredemus) and Walter Grady Roberts, one-time actors and playwrights. His siblings are actors Lisa Roberts Gillan and Julia Roberts, and he grew up in Atlanta, Georgia. He began his acting career at age 5 in a local theater company called the \"Actors and Writers Workshop\", founded by his late father. After his schooling at Grady High, he studied drama at age 17 in London for two years at the Royal Academy of Dramatic Arts, then returned to the States and continued his studies at the American Academy in New York. He made his NY stage debut in \"Rebel Women\" in 1976 at age 20 and appeared in regional productions, once playing the newspaper boy in a production of \"A Streetcar Named Desire\" starring Shirley Knight and Glenn Close. After appearing in such daytime soaps as Another World (1964) and How to Survive a Marriage (1974), his career began to shift fast forward when he copped a leading role in a major film. In King of the Gypsies (1978), based on Peter Maas' best-seller about a fracturing dynasty of New York City gypsies, he made his debut alongside an intimidating roster of stars including Judd Hirsch, Susan Sarandon, Shelley Winters and Sterling Hayden. Young Eric held his own expertly (winning a Golden Globe nomination) while his burning intensity and brooding charm marked sure signs of star potential. After this, he won the lead opposite Milo O'Shea in the 1980 stage production of \"Mass Appeal\". He suffered serious injuries in a car accident during his nascent film career but lost no fans by the time he returned to co-star with Sissy Spacek as a small-town stranger in Raggedy Man (1981). It was, however, his stark and frightening portrayal of two-bit hustler Paul Snider, the cast-off boyfriend who slays Playmate-turned-movie starlet Dorothy Stratten (played by Mariel Hemingway) in Star 80 (1983) that really put him on the movie map and earned him a second Golden Globe nomination. A wide range of fascinating, whacked-out roles were immediately offered to him on a silver plate. He played another dangerous streetwise hustler type in The Pope of Greenwich Village (1984) opposite fellow rebel Mickey Rourke; a cocky soda pop sales exec in the Australian comedy Coca-Cola kid (1985); appeared with more charm and restraint opposite Rosanna Arquette in the offbeat romantic comedy Nobody's Fool (1986) and topped his prolific period off with an Academy Award nomination as a young prison escapee hiding out with Jon Voight aboard an out-of-control train in the ultra-violent, character-driven action adventure Runaway Train (1985). Good things continued to happen when he was a replacement lead in the original run of \"Burn This\" and won a Theatre World Award for his 1988 Broadway debut. A risky, no-holds-barred actor, he was often guilty of overacting if given half the chance. His film career began to slide in the late 1980s, appearing in more quantity than quality pictures. A series of missteps led to unheralded appearances in such bombs as the karate-themed Best of the Best (1989); the NY urban thriller The Ambulance (1990); the action western Blood Red (1989), which took three years to release and is the only film Eric and his sister Julia Roberts appeared in together; and Rude Awakening (1989) when he filled in as a burned-out hippie opposite a Chong-less Cheech Marin. More under appreciated \"B\" filming came with the 1990s (Freefall (1994), Sensation (1994), The Nature of the Beast (1995), etc.), while also chewing the scenery with a number of mobster types in TV-movies, including one as \"Al Capone\". He soon began appearing as flashy secondary villains and creepies that showcased other stars instead, such as Final Analysis (1992) starring Richard Gere, Heaven's Prisoners (1996) top lining Alec Baldwin, and The Dark Knight (2008), part of the \"Batman\" series with Christian Bale and the late Heath Ledger. Eric's undeniable, unconventional talent would occasionally mesh with the perfect role. At the Sundance Film Festival in 1996, he received critical applause for his starring role as a man dying of AIDS in the uplifting and emotional film It's My Party (1996) and earned more honors as a writer marked for murder in the mob-themed story La Cucaracha (1998). He was also perfectly cast as one of the cold-blooded killers in the Emmy-nominated TV adaptation of Truman Capote's chiller In Cold Blood (1996). Eric continued to appear sporadically on TV in such dramatic series as Law & Order: Criminal Intent (2001), while sometimes showing a fun side as well in comedy (The King of Queens (1998)). His own series work included Less Than Perfect (2002) and, more recently, and in the cult program Heroes (2006) where promise for a longer participation ended with his character's death. Recovered from a long-standing cocaine problem, Eric wed, for the first time, actress/writer Eliza Roberts (nee Garrett). They have appeared in such films as Killer Weekend (2004) and Final Approach (2005). His daughter from a former relationship, Emma Roberts, is a newly popular and fast-rising \"tween\" actress from the series Unfabulous (2004) and has played youthful super-sleuth Nancy Drew (2007) on film. Eric's unpredictable, volatile nature which works so mesmerizing on screen has also led to troubling times off camera; his relationship with younger sis Julia Roberts has been seriously strained for quite some time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MTk3OTgwM15BMl5BanBnXkFtZTcwODE1OTIwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000616","name":"Eric Roberts","idIMDB":"nm0000616"},"actorId":"nm0000616","character":"Mayor Richard Dellasandro","urlCharacter":"http://www.imdb.com/character/ch0169472","main":true},{"actorName":"Vincent Spano","urlProfile":"http://www.imdb.com/name/nm0001759","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNTI4NjIwN15BMl5BanBnXkFtZTgwNjQ4MzQyNDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 October 1962","placeOfBirth":" Brooklyn, New York, USA","birthName":"Vincent M. Spano","height":"6' 1\" (1.85 m)","bio":"Born in Brooklyn, Vincent developed an interest in acting at a young age and was pursuing it professionally by age 14. A year later, he earned a co-starring role in the play \"The Shadow Box\" and a minor role in the movie The Double McGuffin came two years after that. At age 18, Spano was cast in The Black Stallion Returns after a long and intense audition process (which involved proving that the NYC boy could ride a horse). With this film, he was welcomed into Francis Coppola's Zoetrope family who produced the film. Directly following the profound and exciting experience in which he spent six months out of the country shooting in Italy, Morocco and Algeria, Spano returned home for what many consider to be his \"big break\" - the role of \"The Sheik\" in John Sayles' Italian-Catholic-boy-meets-Jewish-girl romance, Baby It's You. After the films' success, he was thrilled to have the opportunity once again to work with one of his favorite directors, Francis Coppola, in the role of Steve in Rumblefish. In less than a year, Spano had put three major films in the can and had certainly established his career as a \"serious\" film actor. To date, Spano has acted in more than 40 theatrical and television films and has made memorable guest appearances in some of the best shows on television. Spano has won several awards for his work over the years and was nominated as Best Actor for Cable's ACE Award for his role as \"baby mafia\" economic powerhouse Marc Ciuni in Showtime's Blood Ties. Spano was one of the youngest honorees at the Lake Arrowhead film festival, joining the ranks other noted honorees including; Joe Mantegna, Kirk Douglas, and Gena Rowlands. He continues to be recognized in Italy receiving multiple awards alongside great actors like Giancarlo Giannini & Joe Pesci.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNTI4NjIwN15BMl5BanBnXkFtZTgwNjQ4MzQyNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001759","name":"Vincent Spano","nicknames":["Vinnie"],"idIMDB":"nm0001759"},"actorId":"nm0001759","character":"Troy Whitlock","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bob Gunton","urlProfile":"http://www.imdb.com/name/nm0348409","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MzY0MTQzM15BMl5BanBnXkFtZTcwMTM0ODYxNw@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 November 1945","placeOfBirth":" Santa Monica, California, USA","birthName":"Robert Patrick Gunton Jr.","height":"6' 2\" (1.88 m)","bio":"Bob Gunton was born on November 15, 1945 in Santa Monica, California, USA as Robert Patrick Gunton Jr. He is an actor, known for The Shawshank Redemption (1994), Argo (2012) and 24 (2008). He has been married to Carey Pitts since August 26, 2006. He was previously married to Annie McGreevey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MzY0MTQzM15BMl5BanBnXkFtZTcwMTM0ODYxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0348409","name":"Bob Gunton","idIMDB":"nm0348409"},"actorId":"nm0348409","character":"Dr. Max Sorkosky","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Massee","urlProfile":"http://www.imdb.com/name/nm0557219","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDIyNjMwNTAxNl5BMl5BanBnXkFtZTgwNzI1Nzc2NTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 September 1952","placeOfBirth":" Kansas City, Missouri, USA","birthName":"Michael Groo Massee","bio":"Michael Massee was born on September 1, 1952 in Kansas City, Missouri, USA as Michael Groo Massee. He was an actor, known for Se7en (1995), The Crow (1994) and The Amazing Spider-Man 2 (2014). He was married to Ellen Sussdorf. He died on October 20, 2016 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDIyNjMwNTAxNl5BMl5BanBnXkFtZTgwNzI1Nzc2NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0557219","name":"Michael Massee","idIMDB":"nm0557219"},"actorId":"nm0557219","character":"Edward Vicente","urlCharacter":"http://www.imdb.com/character/ch0077902","main":true},{"actorName":"Shashawnee Hall","urlProfile":"http://www.imdb.com/name/nm0356101","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNzA4MzkwMl5BMl5BanBnXkFtZTcwNzEyMzk1Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 December 1961","placeOfBirth":" Savannah, Georgia, USA","birthName":"Shashawnee E. Hall","height":"6' 1\" (1.85 m)","bio":"Shashawnee Hall was born on December 27, 1961 in Savannah, Georgia, USA as Shashawnee E. Hall. He is an actor and producer, known for A Nightmare on Elm Street (1984), Bruce Almighty (2003) and Evan Almighty (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNzA4MzkwMl5BMl5BanBnXkFtZTcwNzEyMzk1Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0356101","name":"Shashawnee Hall","idIMDB":"nm0356101"},"actorId":"nm0356101","character":"Pete Sampson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Ramsey","urlProfile":"http://www.imdb.com/name/nm0709078","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0NTM2MDg3M15BMl5BanBnXkFtZTgwNjc0NzEzMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Stephen Ramsey is an actor, known for Minority Report (2002), G.I. Jane (1997) and S.W.A.T. (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0NTM2MDg3M15BMl5BanBnXkFtZTgwNjc0NzEzMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0709078","name":"Stephen Ramsey","idIMDB":"nm0709078"},"actorId":"nm0709078","character":"Gibby Smolak","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jo Champa","urlProfile":"http://www.imdb.com/name/nm0004818","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzE1NjQyMl5BMl5BanBnXkFtZTgwMTY5NzMwMDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 January 1968","placeOfBirth":" Long Branch, New Jersey, USA","birthName":"Rosina Jo Ciampa","bio":"Actress and model Jo Champa was born in Long Branch, New Jersey, to an American mother and an Italian father. At age seven, she relocated to Rome, Italy, where she was raised. Before the age of eighteen, Jo had already become one of Gianni Versace's favorite runway models. Additionally, she acted as a muse to iconic photographer Helmut Newton, starring in some of his most legendary photographs, which can be found in a permanent exhibit at the Museum in Berlin as well as in Newton's limited edition book, 'Sumo'. Jo has also been photographed many times by celebrated photographer Douglas Kirkland, and has appeared in a number of his illustrious books. Champa broke into the film industry at age eighteen with Claude d'Anna's French-Italian production, \"Salome'', which opened the Un Certain Regard section at the Cannes Film Festival. She went on to star in many significant Italian films including \"Dolce assenza\" by Claudio Sestieri, \"The Family\" by Ettore Scola, which earned an Oscar nomination in the category of Best Foreign Language, \"Le vie del Signore sono finite\" by Massimo Troisi, and \"Il sole buio\" by Damiano Damiani, to name but a few. She received continuous praise from European directors for bringing an exotic, alluring Mediterranean quality to the screen. At the peak of her career, Jo returned to the United States and starred in Steven Seagal's \"Out for Justice\", followed by Bernardo Bertolucci's masterpiece \"Little Buddha\", and then Jeremy Leven's \"Don Juan De Marco\", where she played opposite Marlon Brando and Johnny Depp. Most recently she was in \"Somewhere\", directed by Sophia Coppola. She has guest starred in a variety of television series' including Walker, Texas Ranger, Avvocati, and CSI: Miami to name a few. In Italy, she hosted the very successful fashion television show for RAI TV, titled \"Kermesse\". Champa also served as special contributing editor and columnist for Italian Vogue and L'Uomo Vogue. Italian Vogue defined her as \"an icon of Italian style. We love her because she is a refined and creative woman, a tireless supporter of Italian cinema and culture in the United States\". Not just a model and an actress, Champa has continued to produce, host, and organize many extraordinary events throughout her career. Amongst her accomplishments, Jo produced \"An Academy Tribute to Sophia Loren\" for the Academy of Motion Pictures and Sciences with special guest, Sophia Loren. Jo then produced the launch of the Andrea Bocelli Foundation at the Beverly Hilton Hotel in Beverly Hills, California, with a dinner and performance starring Andrea Bocelli. She produced the primetime special of that same event for Italian Sky TV. She also hosted and moderated a Special Evening for David and Susan Rockefeller at MOMA in New York, presenting Susan Rockefeller's remarkable documentary, \"Mission of Mermaids. Jo is known for partnering with many of the luxury designer brands she consults for, with the philanthropic goal of enhancing their visibility in Hollywood while raising money for a variety foundations including Race to Erase MS, the National Breast Cancer Coalition Fund, and the Carousel of Hope for Juvenile Diabetes. Other affiliations she has worked with include the Academy of Motion Pictures Museum, and the Leonardo Di Caprio Foundation event at Christie's in NY. Jo has worked for many years partnering with Alice Harris, \"Sweet Alice\", who is a renown community leader in Watts, Los Angeles, for her annual Christmas toy drive, benefitting those who suffer socioeconomic neglect and poverty. In fact, the Cambodian Children's Fund in Phnom Penh, Cambodia, named a special center after her called \"Jo's Kids\" honoring her incredible fundraising efforts. Champa has received numerous awards throughout her life for her accomplishments. At the Italian House of Representatives, in the presence of the Italian President of the Republic Giorgio Napolitano, Jo was conferred the \"Premio America - Fondazione Italia Usa\". A few years prior to this, together with Sofia Loren, she had achieved the \"Italians in the World Award,\". Jo was also awarded the \"Cinema Italian Style Award.\" Jo believes that \"helping others is the gateway to becoming a better person\". She has left a permanent imprint in the film an television industry that reaches far beyond the Unites States and Italy. She continues to inspire others and move forward with her humanitarian efforts, demonstrating first-hand what it means to truly make a difference. With her refined, impeccable style and her willingness to be the change, Jo Champa is truly an icon and in inspiration to everyone around her.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzE1NjQyMl5BMl5BanBnXkFtZTgwMTY5NzMwMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004818","name":"Jo Champa","idIMDB":"nm0004818"},"actorId":"nm0004818","character":"Aria Beutefeldt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Curtis Brown","urlProfile":"http://www.imdb.com/name/nm0193551","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNDMwOTc5Ml5BMl5BanBnXkFtZTcwNzc2ODMzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"April1957","placeOfBirth":" Bucks County, Pennsylvania, USA","bio":"Robert Curtis Brown has forged a career playing unique, diverse and interesting characters. This talented, Yale-trained actor has an intriguing, accessible screen presence and a depth of feeling and humor. The complexity that Robert brings to his characters may have its origins in his upbringing in Bucks County, Pennsylvania, his years at Yale College, his education at The Yale School of Drama or his experiences traveling the world for work and pleasure. Regardless, since his first professional role fresh out of Yale, Robert has tapped into the ability to embody the essence of whatever character he portrays. From his early work in New York with Joseph Papp, David Hare, Al Pacino, Martin Sheen, Kate Nelligan, John Landis, Eddie Murphy and Dan Aykroyd, Robert has been singled out for his ability to portray a broad range of characters. Robert has a sterling reputation as an actor from producers, directors and audiences across the country. In his three most recent feature films, It's Complicated (2009), Halloween II (2009) and The Men Who Stare at Goats (2009), Robert portrays three very different characters. In \"It's Complicated\", he plays \"Peter\", Meryl Streep's architect and friend who will introduce him to \"Adam\", played by Steve Martin. This funny romantic comedy includes an all-star cast, including Alec Baldwin and John Krasinski. \"Halloween 2\", directed by Rob Zombie, is a terrifying horror film in which Robert portrays the heart-wrenching father, of a murdered girl, who confronts Malcolm McDowell. Robert shares the screen with George Clooney, Jeff Bridges and Kevin Spacey in \"The Men Who Stare At Goats\", in which he portrays an Army General bent on staying ahead of the Russians! Robert has over 120 television and film roles to his credit including: \"President Kennedy\" in Big Love (2006), \"Warden Davis Ollenstein\" in CSI: NY (2004), \"Morgan Ride\" in Shark (2006), \"Miles Bainbridge\" in Big Time Rush (2009), \"Dan, The Weatherman\" in the Showtime series, Look (2010) and \"Vance Evans\" (Sharpay and Ryan's Dad) in the smash hit, \"High School Musical\" movies for Disney. Robert's acting work has extended beyond film and television and counts himself among the lucky actors who continue to work in the theatre. His long association with the South Coast Repertory and the Pasadena Playhouse are sources of great pride and artistic expression. Robert devotes his spare time to several charitable organizations including the \"Pediatric Aids Foundation\", \"Helping Hands for the Blind\" and his local schools. In his spare time, he plays softball, bike rides and enjoys gardening, scuba diving and traveling.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNDMwOTc5Ml5BMl5BanBnXkFtZTcwNzc2ODMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0193551","name":"Robert Curtis Brown","idIMDB":"nm0193551"},"actorId":"nm0193551","character":"Jack Hendler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dana Barron","urlProfile":"http://www.imdb.com/name/nm0057654","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NjAyMzYxN15BMl5BanBnXkFtZTYwOTMwNzky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 April 1966","placeOfBirth":" New York City, New York, USA","height":"5' 3\" (1.6 m)","bio":"Dana Barron was born on April 22, 1966 in New York City, New York, USA. She is an actress and producer, known for One Life to Live (1968), National Lampoon's Vacation (1983) and Happythankyoumoreplease (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NjAyMzYxN15BMl5BanBnXkFtZTYwOTMwNzky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0057654","name":"Dana Barron","idIMDB":"nm0057654"},"actorId":"nm0057654","character":"Lindsey Mastrapa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Renée Taylor","urlProfile":"http://www.imdb.com/name/nm0853041","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDM0OTA4Nl5BMl5BanBnXkFtZTcwOTc3ODk3OQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 March 1933","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"Renee Wexler","bio":"Renée Taylor was born in the Bronx, New York to Frieda (née Silverstein) and Charles Wexler. She worked as a comedian in the early 1960s at the New York City nightclub Bon Soir. Her opening act was a then unknown Barbra Streisand. She earned notice for her portrayal of Eva Braun in Mel Brooks's The Producers (1967), and continued to act in several film, television, and theater productions. However, despite an impressive, 50-year resume, she is better remembered as Sylvia Fine, the overbearing, classic Jewish mother of Fran Drescher's title character in The Nanny (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDM0OTA4Nl5BMl5BanBnXkFtZTcwOTc3ODk3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0853041","name":"Renée Taylor","idIMDB":"nm0853041"},"actorId":"nm0853041","character":"Kathryn Hadorn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ron Perkins","urlProfile":"http://www.imdb.com/name/nm0674052","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzODgyOTg1MV5BMl5BanBnXkFtZTcwMzMwMjEzMQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Ron Perkins is an actor, known for Spider-Man (2002), The Prestige (2006) and General Hospital (1963).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzODgyOTg1MV5BMl5BanBnXkFtZTcwMzMwMjEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0674052","name":"Ron Perkins","idIMDB":"nm0674052"},"actorId":"nm0674052","character":"Dr. Chuck Westley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kyle Searles","urlProfile":"http://www.imdb.com/name/nm1064095","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNDk3NzMzNF5BMl5BanBnXkFtZTcwODk5NjMzMQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 June 1985","placeOfBirth":" Houston, Texas, USA","birthName":"Kyle Evan Searles","height":"5' 11\" (1.8 m)","bio":"Kyle Searles was born on June 24, 1985 in Houston, Texas, USA as Kyle Evan Searles. He is an actor, known for 7th Heaven (1996), Pandemic (2007) and South of Nowhere (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNDk3NzMzNF5BMl5BanBnXkFtZTcwODk5NjMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1064095","name":"Kyle Searles","idIMDB":"nm1064095"},"actorId":"nm1064095","character":"Ames Smith","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0802821","urlIMDB":"http://www.imdb.com/title/tt0802821","business":{"budget":{"money":"$9,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 49 min (169 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.3","filmingLocations":[{"location":"Hollywood, Los Angeles, California, USA"}],"awards":[{"award":"Writers Guild of America, USA 2008","titlesAwards":[{"titleAwardOutcome":"Won WGA Award (TV)","categories":[{"category":"Long Form - Original","names":[{"name":"Bryce Zabel","id":"nm0007233","role":null},{"name":"Jackie Zabel","id":"nm0951392","role":null}]}]}]}],"votes":"1,009","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0069955","name":"Hallmark Entertainment"},{"idCompany":"co0045255","name":"Larry Levinson Productions"},{"idCompany":"co0010995","name":"Robert Halmi"}],"keywords":{"keywords":["virus","bird","latex gloves","medical","medical mask","mace spray","coughing","callousness","ex husband ex wife relationship","ex wife","other man","premiere","yacht","escaped convict","hostage rescue","taken as hostage","hostage","coworker relationship","coffee date","refusing to press charges","father son estrangement","husband wife estrangement","boy with a gun","child with a gun","hidden gun","gun","held at gunpoint","scarcity","pharmaceuticals","pharmaceutical","theft of pharmaceuticals","armed robbery","atm","centers for disease control","influenza","federal bureau of investigation","terminal illness","suspense","race against time","plague","medicine","epidemic","disease","disaster","disaster film","los angeles california","television reporter","stealing car","shot in the shoulder","redneck","quarantine","public speaking","protective custody","photographer","paramedic","news reporter","lungs","lung disease","kidnapping","flight attendant","escape","emigrant","drugstore","drug dealing","doctor patient relationship","deadly disease","dead dog","dead body on plane","dead bird","animated title sequence","passenger","surfing","state governor","shak","shack","salesman","police","plane","pandemic","mayor","los angeles international airport","jet","governor","dog","california","australia","airport","airplane","death of mother","death of father","death of friend","taxi driver","film premiere","asking someone out on a date","asking for a date","juice","telephone call","aunt niece relationship","taxi","surfer"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 09:10:16"}}