{"data":{"movies":[{"title":"Pretty Ugly People","originalTitle":"","year":"2008","releaseDate":"20080412","directors":[{"name":"Tate Taylor","id":"nm0853238"}],"writers":[{"name":"Tate Taylor","id":"nm0853238"}],"runtime":"99 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDcyNjg1MzkxOV5BMl5BanBnXkFtZTcwOTc4ODc3Mg@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"Former college chums gather for what they think is their fat friend's dying last days, but they instead find her celebrating the last few days before reaching her target weight loss at a mountain lodge with a subsequent hiking trip planned for them all. Though it's the woman's long-held dream journey that she wanted to take with her best friends, the others, largely, can't get over the feeling of being duped, with everyone's emotional baggage breaking out awkwardly all along their forced and uncomfortable three-day hike back to civilization.","simplePlot":"Lucy has always used food to escape life's problems, but when this self-titled \"fat friend\" lures her group of old college buddies to the Montana wilderness, she reveals a new self - skinny, beautiful and still flawed.","actors":[{"actorName":"Missi Pyle","urlProfile":"http://www.imdb.com/name/nm0701512","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NDc2MTk5NV5BMl5BanBnXkFtZTgwMDU3MTI4ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 November 1972","placeOfBirth":" Houston, Texas, USA","birthName":"Andrea Kay Pyle","height":"5' 11¾\" (1.82 m)","bio":"Missi Pyle was born on November 16, 1972 as Andrea Kay Pyle in Houston, Texas and was raised in Memphis, Tennessee. The daughter of Linda and Frank Pyle, she has four older siblings, sisters Debbie and Julie, and brothers Sam and Paul. Pyle attended the North Carolina School of the Arts and graduated in 1995. Since then, Pyle has had a significant career in many films and television series. She has also established in parallel a singing career as a member of the band Smith & Pyle with actress Shawnee Smith. Pyle has started an acting career playing a minor role in comedy film As Good as It Gets (1997) starring Jack Nicholson and Helen Hunt. Her following notable roles were in science fiction parody film Galaxy Quest (1999), Home Alone 4 (2002) where she played her first role as a villain, Tim Burton films Big Fish (2003) and Charlie and the Chocolate Factory (2005) starring Johnny Depp and Christopher Lee, Just My Luck (2006) starring Lindsay Lohan, and Soccer Mom (2008) where she had a double role. Pyle has also played guest roles in many television series such as Mad About You (1992) also starring Helen Hunt, Frasier (1993), Friends (1994) in the episode \"The One with Ross's Teeth\", Ally McBeal (1997), three episodes of Two and a Half Men (2003), three episodes of Boston Legal (2004), Grey's Anatomy (2005), two episodes Heroes (2006) and two episodes of The Mentalist (2008). Pyle is also an occasional voice actress, and has voiced characters in one episode of series Family Guy (1999) and two episodes of American Dad! (2005). Pyle began a career as a singer when she met Shawnee Smith in 2007 while filming an ABC comedy pilot. Pyle stated that her dream was to be in a rock band, and Smith gave her the opportunity by creating the country-rock band Smith & Pyle in Los Angeles, California. Their debut album \"It's OK to Be Happy\" was recorded in Joshua Tree, California and was released in 2008 under their own record label when they became business partners. Their first live performance was in Texas on January 18, 2008 and since then, the band performed in many other states, especially in West Virginia, until May 29, 2010 in California. In 2011, the actresses officially disbanded before their second album was completed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NDc2MTk5NV5BMl5BanBnXkFtZTgwMDU3MTI4ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0701512","name":"Missi Pyle","idIMDB":"nm0701512"},"actorId":"nm0701512","character":"Lucy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Melissa McCarthy","urlProfile":"http://www.imdb.com/name/nm0565250","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NjA3ODkyMl5BMl5BanBnXkFtZTgwNTU4Mzg5NjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 August 1970","placeOfBirth":" Plainfield, Illinois, USA","birthName":"Melissa Ann McCarthy","height":"5' 2\" (1.57 m)","bio":"Melissa McCarthy was born in Plainfield, Illinois, to Sandra and Michael McCarthy, a farmer. McCarthy began her performing career as a stand-up comedian in New York where she appeared at the famous clubs, Stand Up New York and The Improv. She worked on her acting skills at The Actors Studio and appeared in many stage productions in the city before moving to Los Angeles in the late-1990s. She made a number of TV and movie appearances before making her big breakthrough as Sookie in Gilmore Girls (2000). A steady stream of comedy performances followed, leading to her starring role in the sitcom Mike & Molly (2010). In the 2010s, McCarthy became known for her starring roles in the films Bridesmaids (2011), The Heat (2013), St. Vincent (2014), Spy (2015), and Ghostbusters (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NjA3ODkyMl5BMl5BanBnXkFtZTgwNTU4Mzg5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0565250","name":"Melissa McCarthy","idIMDB":"nm0565250"},"actorId":"nm0565250","character":"Becky","urlCharacter":"http://www.imdb.com/character/ch0407662","main":true},{"actorName":"Larry Sullivan","urlProfile":"http://www.imdb.com/name/nm0837942","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NjYwOTU2OV5BMl5BanBnXkFtZTgwNTIzMjAyNDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1970","placeOfBirth":" New Haven, Connecticut, USA","birthName":"Lawrence Edward Sullivan Jr.","height":"6' (1.83 m)","bio":"Larry Sullivan was born on September 10, 1970 in New Haven, Connecticut, USA as Lawrence Edward Sullivan Jr. He is an actor, known for Rush Hour (1998), Fracture (2007) and Straight Outta Compton (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NjYwOTU2OV5BMl5BanBnXkFtZTgwNTIzMjAyNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0837942","name":"Larry Sullivan","idIMDB":"nm0837942"},"actorId":"nm0837942","character":"Austin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Phillip David Lewis","urlProfile":"http://www.imdb.com/name/nm0507629","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNjQxMTIyMl5BMl5BanBnXkFtZTcwMjE5MDQ2OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 September 1968","placeOfBirth":" Uganda","birthName":"Phillip Akon Lewis","height":"5' 6\" (1.68 m)","bio":"Phillip David Lewis was born on September 4, 1968 in Uganda as Phillip Akon Lewis. He is an actor and director, known for The Suite Life of Zack and Cody (2005), The Suite Life on Deck (2008) and I Spy (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNjQxMTIyMl5BMl5BanBnXkFtZTcwMjE5MDQ2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0507629","name":"Phillip David Lewis","idIMDB":"nm0507629"},"actorId":"nm0507629","character":"Raye","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Josh Hopkins","urlProfile":"http://www.imdb.com/name/nm0005020","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNDMyNDM3MTVeQTJeQWpwZ15BcmVzdW1l._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1970","placeOfBirth":" Lexington, Kentucky, USA","birthName":"William Joshua Hopkins","height":"6' 2\" (1.88 m)","bio":"Josh Hopkins was born on September 12, 1970 in Lexington, Kentucky, USA as William Joshua Hopkins. He is an actor, known for Cougar Town (2009), The Perfect Storm (2000) and G.I. Jane (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNDMyNDM3MTVeQTJeQWpwZ15BcmVzdW1l._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005020","name":"Josh Hopkins","idIMDB":"nm0005020"},"actorId":"nm0005020","character":"George","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Noseworthy","urlProfile":"http://www.imdb.com/name/nm0005276","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmFiZDA5ZGYtZjU2YS00NWJkLTkzNTktYjQ0MWEwZjAxMTBlXkEyXkFqcGdeQXVyMzY3NTE1Njk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 December 1969","placeOfBirth":" Lynn, Massachusetts, USA","birthName":"John E. Noseworthy Jr.","height":"5' 8\" (1.73 m)","bio":"Born and raised in Massachusetts, Jack received his BFA from The Boston Conservatory. He began his career on stage in the national tour of the musical CATS. He made his Broadway debut in the original company of JEROME ROBBINS BROADWAY, played Mark in A CHORUS LINE, and opposite John Lithgow in SWEET SMELL OF SUCCESS. In addition to his New York stage work, he received the Los Angeles Drama Critics prize and a Drama-Logue Award as Best Actor for his starring role as Alan Strang in the Los Angeles production of EQUUS. He stared as Pip in the Utah Shake's production of GREAT EXPECTATIONS as well as Mr. Charles Bingley, in PRIDE & PREJUDICE. In January of 2017 he guest stared on \"Shades Of Blue\" opposite Ray Liotta, and is currently shooting the independent feature \"Band Night\". Jack played Alan deShields in the Lifetime miniseries \"Marilyn\". He played Bobby Kennedy in NatGeo's highest rated film, \"Killing Kennedy\" opposite Rob Lowe and Ginnifer Goodwin. He has completed the features\"10,000 Miles\", \"Julia\" \"Needlestick\" and \"Tio Papi\". He played \"Mordred\" in CAMELOT opposite Nathan Gunn at The Glimmerglass Festival, and recently shot the web pilot, IN PLAIN VIEW. He received rave reviews as Elliot in \"Two Point Oh\" Jeff Jackson's new play off Broadway at 59E59th St. in NYC, as well as narrating the Christopher Wheeldon Ballet, \"Carnival Of The Animals\" for NYCB. In the motion picture arena, he has worked with Jonathan Mostow five times, most recently in the Bruce Willis action thriller \"The Surrogates\", as well as, \"Breakdown,\" \"U-571,\" the FOX Network's pilot \"Them\" and his cameo in \"Terminator 3: Rise of the Machines\". Jack's other feature film credits include the independent favorites, \"Pretty Ugly People\" and \"Phat Girlz,\" as well as, \"Undercover Brother,\" \"Poster Boy,\" \"Unconditional Love,\" \"Event Horizon,\" \"The Brady Bunch Movie,\" \"Barb Wire,\" \"Trigger Effect,\" \"Cecil B. DeMented,\" \"Alive\" and \"Encino Man,\" his movie debut. On television: the Hallmark-Hall-Of-Fame western \"Aces 'N Eights\" \"ELVIS\" opposite Jonathan Rhys Meyers, played Sissy Spacek's son in \"A Place For Annie,\" and Anne Bancroft's obsession in \"Mrs. Cage.\" Other television credits include: \"Shades Of Blue\" \"CSI,\" \"The District,\" \"Law & Order,\" \"Law & Order: SVU,\" \"Crossing Jordan\" and \"Judging Amy\" (four episodes). He also has the distinction of being the series lead on MTV's first scripted series, \"Dead At 21.\" In March of 2016, Jack produced \"Arrabal\" at the Bi-Annual Ibero American Theatre Festival in Bogota, Colombia. \"Arrabal\" begins rehearsals in Cambridge, Ma at American Repertory Theatre on April 3rd, 2017. It opens on May 12th and runs thru June 18th. He previously optioned and produced \"Peter & I\" by Matte O'Brien and Matt Vinson. Jack created, directed and produced three benefits under the Voices For Change banner at Ars Nova, for John Kerry's presidential campaign.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmFiZDA5ZGYtZjU2YS00NWJkLTkzNTktYjQ0MWEwZjAxMTBlXkEyXkFqcGdeQXVyMzY3NTE1Njk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005276","name":"Jack Noseworthy","idIMDB":"nm0005276"},"actorId":"nm0005276","character":"Trevor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Octavia Spencer","urlProfile":"http://www.imdb.com/name/nm0818055","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MjcwMjcxNl5BMl5BanBnXkFtZTcwMjkwODg0Ng@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1970","placeOfBirth":" Montgomery, Alabama, USA","birthName":"Octavia Lenora Spencer","height":"5' 2\" (1.57 m)","bio":"Spencer is a native of Montgomery, Alabama, which she claims is the proverbial buckle of the Bible belt. She's the sixth of seven siblings and holds a BS in Liberal Arts from Auburn University. A \"closet\" lover of acting, this practical Alabamian knew that she'd someday work in the film industry, but never dreamed it would be in front of the camera. In 1995, acclaimed director Joel Schumacher changed all that by giving her a small part opposite Sandra Bullock in the hit film A Time to Kill, and Spencer was on her way. In 1996, she teamed up with Bullock again in Bullock's directorial debut of Making Sandwiches, a short film that premiered at the 1997 Sundance Film Festival. Spencer made her stage debut in Los Angeles and originated the role of \"LaSonia\" (pronounced lasagna) in famed writer/director Del Shore's, The Trials and Tribulations of a Trailer Trash Housewife, starring opposite veteran actors Beth Grant, Dale Dickey and David Steen (2003). The play garnered Spencer and her fellow cast mates critical acclaim and a bevy of awards. Since then, Spencer has continued to see success as an actor in both film and television, working alongside Hollywood's elite. In February 2009, she was lauded by Los Angeles Times publication: The Envelope, for her brief but memorable performance in the Will Smith drama Seven Pounds.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MjcwMjcxNl5BMl5BanBnXkFtZTcwMjkwODg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0818055","name":"Octavia Spencer","idIMDB":"nm0818055"},"actorId":"nm0818055","character":"Mary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Philip Littell","urlProfile":"http://www.imdb.com/name/nm0514472","urlPhoto":"","biography":{"bio":"Philip Littell is an actor and writer, known for Conversations with Other Women (2005), Everyone Who Hears This Story Gets Laid (2011) and Pretty Ugly People (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0514472","name":"Philip Littell","idIMDB":"nm0514472"},"actorId":"nm0514472","character":"Richard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Sanderson","urlProfile":"http://www.imdb.com/name/nm0761836","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NjIxMjMwN15BMl5BanBnXkFtZTcwMDk1NzgzOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 January 1944","placeOfBirth":" Memphis, Tennessee, USA","height":"5' 8\" (1.73 m)","bio":"Prolific and versatile character actor William Sanderson was born on January 10, 1944, in Memphis, Tennessee. His mother was an elementary school teacher and his father was a landscape designer. William served two years in the US Army. Following his military service he attended Southern Methodist University. He earned both a BBA degree and a JD law degree from Memphis State University. William went to New York to try his luck as an actor. He studied his craft with Herbert Berghof and William Hickey. Sanderson began his acting career in off-Broadway stage productions and appeared in several independent pictures. He gave a superbly lively and intense performance as vicious racist and escaped convict Jessie Lee Kane in the brutal exploitation feature Fight for Your Life (1977). William was likewise marvelous as gentle toymaker J.F. Sebastian in the fantastic science-fiction cult favorite Blade Runner (1982). He has played his fair share of loathsome bad guys (he refers to these particular characters as \"prairie scum\"), such as nasty lout Calvin in Raggedy Man (1981), lowlife hick Lee Dollarhide in Coal Miner's Daughter (1980) and weaselly criminal Snow in Lone Wolf McQuade (1983). Not surprisingly, considering his distinctive Southern drawl, he has also appeared in such westerns as the comedy Wagons East (1994), Crossfire Trail (2001), Monte Walsh (2003), Andersonville (1996), Gods and Generals (2003) and the acclaimed TV mini-series Lonesome Dove (1989) (one of several projects in which Sanderson has acted alongside Tommy Lee Jones). Sanderson gave a lovely and touching portrayal in a rare lead role as emotionally dysfunctional recovering alcoholic ukulele minstrel Stanley Myer in the poignant indie drama Stanley's Gig (2000). He achieved his greatest popularity, however, as flaky backwoodsman Larry on the hit sitcom Newhart (1982) on which he uttered the memorable catchphrase, \"I'm Larry. This is my brother Darryl and this is my other brother Darryl.\" More recently Sanderson had a terrific role as conniving hotel proprietor E.B. Farnum on the sensationally gritty cable western TV series Deadwood (2004). Among the TV shows William has done guest spots on are The Practice (1997), The Pretender (1996), ER (1994), The X-Files (1993), Walker, Texas Ranger (1993), Les anges de la ville (1993), Matlock (1986), Babylon 5 (1994), Married with Children (1987), The Twilight Zone (1985), Knight Rider (1982), Coach (1989), The Dukes of Hazzard (1979) and Starsky and Hutch (1975). He has also done voices for numerous cartoon characters, radio commercials and books on tape. Outside of his substantial film and TV credits, William has acted on stage in productions of such plays as \"The Taming of the Shrew,\" \"When Ya Comin' Back, Red Ryder?,\" \"Insect Comedy,\" \"To Kill a Mockingbird,\" \"Dutchman,\" \"Fishing,\" \"Authentic Life of Billy the Kid,\" \"Tobacco Road,\" and \"Scotch Rocks.\" William Sanderson lives in Burbank, California, with his wife Sharon Wix.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NjIxMjMwN15BMl5BanBnXkFtZTcwMDk1NzgzOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0761836","name":"William Sanderson","nicknames":["Bill"],"idIMDB":"nm0761836"},"actorId":"nm0761836","character":"Sam","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Allison Janney","urlProfile":"http://www.imdb.com/name/nm0005049","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNjc2NzgxM15BMl5BanBnXkFtZTgwODQyMjM1MjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1959","placeOfBirth":" Dayton, Ohio, USA","birthName":"Allison Brooks Janney","height":"6' (1.83 m)","bio":"Allison Janney is an award-winning actress who has earned a solid reputation in stage productions and in many supporting roles on screen, and who more recently has become prominent by portraying one of the major characters in the popular TV series The West Wing (1999). Entertainment Weekly magazine describes Janney's screen presence as \"uncommonly beautiful and infinitely expressive\". As an actor, the magazine deems her to be \"one to watch\". Janney was born in Boston, Massachusetts, to Macy Brooks (Putnam), a former actress, and Jervis Spencer Janney, Jr., a real estate developer and jazz musician. While studying at Kenyon College, Janney answered a casting call for an on-campus play that was to be directed by Kenyon's most famous alumnus, the legendary actor Paul Newman. During her audition/interview, Janney played upon Newman's known passion for race car driving - she explained how she cut thirty minutes off of the 130 mile journey from her home town to the college. She got chosen for the play's cast. After earning her degree in drama, Janney took Joanne Woodward's suggestion to do further study at New York's Neighborhood Playhouse. She also studied at the Royal Academy of Dramatic Arts in London. Early in her career Janney got comedic roles in the soap operas As the World Turns (1956) and Guiding Light (1952). Later, she gave memorable movie performances in supporting roles in Belles à mourir (1999), 10 Things I Hate About You (1999), American Beauty (1999) and Nurse Betty (2000), and in the made-for-TV movie ...First Do No Harm (1997), among others. Among her stage work, Janney has played in a revival of Arthur Miller's \"A View From the Bridge\" on Broadway opposite Anthony LaPaglia, which earned her a Tony Award nomination, and a Drama League Award for outstanding artist for the 1997-98 season. She played in Noel Coward's \"Present Laughter\" opposite Frank Langella, which earned her the Outer Critics Circle Award and an Actors' Equity award. Janney also appeared in the New York Shakespeare Festival's production of \"The Taming of the Shrew\". In 1999 Janney became part of the original cast of the acclaimed TV series The West Wing (1999) where she played the President's press secretary who eventually gets promoted to the White House Chief of Staff. Her impressive work during the seven seasons of that renowned series earned her four Emmys and two SAG Awards. With her reputation becoming more broadly established during her work on \"The West Wing\" Janney won more substantive roles in feature films, in the acclaimed The Hours (2002) where she was Meryl Streep's lesbian lover, and in How to Deal (2003) where she played Mandy Moore's mother.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNjc2NzgxM15BMl5BanBnXkFtZTgwODQyMjM1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005049","name":"Allison Janney","idIMDB":"nm0005049"},"actorId":"nm0005049","character":"Suzanne","urlCharacter":"http://www.imdb.com/character/ch0150024","main":true},{"actorName":"Stacy Yutuc","urlProfile":"http://www.imdb.com/name/nm1446566","urlPhoto":"","biography":{"bio":"Stacy Yutuc is an actress, known for Pretty Ugly People (2008), Night of the Dog (2005) and Burying Lana (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1446566","name":"Stacy Yutuc","idIMDB":"nm1446566"},"actorId":"nm1446566","character":"Flirty Flight Attendant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Allison Mackie","urlProfile":"http://www.imdb.com/name/nm0533492","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNDE1MjEyMF5BMl5BanBnXkFtZTgwNDE2NDI5MjE@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 January 1960","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Allison P. Mackie","height":"5' 5½\" (1.66 m)","bio":"Allison Mackie was born on January 25, 1960 in Philadelphia, Pennsylvania, USA as Allison P. Mackie. She is an actress, known for Péché originel (2001), Those People (2015) and Sliver (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNDE1MjEyMF5BMl5BanBnXkFtZTgwNDE2NDI5MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0533492","name":"Allison Mackie","idIMDB":"nm0533492"},"actorId":"nm0533492","character":"Bitter Flight Attendant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Amy Landers","urlProfile":"http://www.imdb.com/name/nm1484115","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1ODcxNzU1MV5BMl5BanBnXkFtZTgwODExMDgxNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Amy Landers is an actress, known for Our Very Own (2005), Pretty Ugly People (2008) and Jolene (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1ODcxNzU1MV5BMl5BanBnXkFtZTgwODExMDgxNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1484115","name":"Amy Landers","idIMDB":"nm1484115"},"actorId":"nm1484115","character":"Puffy Paint Flight Attendant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Drew Matthews","urlProfile":"http://www.imdb.com/name/nm1830771","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MDgwMTc2Ml5BMl5BanBnXkFtZTcwMDcyNTU0OQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"bio":"Drew Matthews is an actor, known for Pretty Ugly People (2008), House Broken (2009) and Protect and Serve (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MDgwMTc2Ml5BMl5BanBnXkFtZTcwMDcyNTU0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1830771","name":"Drew Matthews","idIMDB":"nm1830771"},"actorId":"nm1830771","character":"Boy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sean Daly","urlProfile":"http://www.imdb.com/name/nm0198507","urlPhoto":"","biography":{"bio":"Sean Daly is an actor and production designer, known for Sherlock Holmes (2009), Seven Psychopaths (2012) and Pretty Ugly People (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0198507","name":"Sean Daly","idIMDB":"nm0198507"},"actorId":"nm0198507","character":"Park Ranger","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0874425","urlIMDB":"http://www.imdb.com/title/tt0874425","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"$6,537","country":"USA","day":"05","month":"11","year":"2009","remarks":""},{"money":"$6,537","country":"Worldwide","day":"05","month":"11","year":"2009","remarks":""},{"money":"$6,537","country":"Worldwide","day":"18","month":"09","year":"2009","remarks":""}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 39 min (99 min) (original release) (USA)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.85 : 1 (DVD aspect ratio)"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.0","filmingLocations":[{"location":"East Glacier, Montana, USA"}],"rated":"R","awards":[{"award":"Central Florida Film Festival 2008","titlesAwards":[{"titleAwardOutcome":"Won Festival Prize","categories":[{"category":"Best Feature Film","names":[{"name":"Tate Taylor","id":"nm0853238","role":"director"},{"name":"Brunson Green","id":"nm0337676","role":"producer"}]}]}]},{"award":"Jackson Crossroads Film Festival 2008","titlesAwards":[{"titleAwardOutcome":"Won Audience Choice","categories":[{"category":"Audience Choice Award","names":[{"name":"Tate Taylor","id":"nm0853238","role":null}]}]}]}],"votes":"1,402","type":"Movie","companyCreditsSimple":[{"idCompany":"co0113016","name":"Harbinger Pictures"},{"idCompany":"co0190054","name":"Plump Pictures"}],"keywords":{"keywords":["hiking","lodge","montana","closeted gay","mistaken for gay","scattering ashes","beach","waves","death","bus crash","heart attack","sex scene","spaghetti","infidelity","satellite phone","argument","tranquilizer gun","tranquilizer dart","bear","virgin","scrambled eggs","ashes","hot spring","full moon","mushroom","marijuana","gay slur","bug spray","camping trip","triangle","reference to bill cosby","airplane","bus","cigarette smoking","hot dog","animated sequence","fast food","gay kiss","male nudity","male frontal nudity","antonyms in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 23:46:30"}}