{"data":{"movies":[{"title":"Nine Miles Down","originalTitle":"","year":"2009","releaseDate":"20120628","directors":[{"name":"Anthony Waller","id":"nm0909026"}],"writers":[{"name":"Everett De Roche","id":"nm0211193"},{"name":"Anthony Waller","id":"nm0909026"}],"runtime":"86 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODAzNzQyNF5BMl5BanBnXkFtZTcwODIyMjg2Mw@@._V1.jpg","countries":["UK","USA","Hungary","Australia"],"languages":["English"],"genres":["Horror","Mystery","Thriller"],"plot":"In the Sahara desert, a sandstorm batters a deserted drilling station. Thomas \"Jack\" Jackman a security patrolman, battles through the high winds to find out why all contact with the station has been lost. Originally built for gas exploration, and then abandoned, the site had recently been taken over by a multi-national research team intent on drilling deeper into the earth's crust than ever before.","simplePlot":"A security expert is sent to a remote scientific camp to investigate strange things that are happening.","actors":[{"actorName":"Adrian Paul","urlProfile":"http://www.imdb.com/name/nm0001600","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5MjM2NDQ1Ml5BMl5BanBnXkFtZTgwODM4ODE1MDE@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 May 1959","placeOfBirth":" London, England, UK","birthName":"Adrian Paul Hewett","height":"6' (1.83 m)","bio":"With over 30 films and 200 hours of television experience, versatility, discipline and a solid work ethic have been the underpinnings of Adrian's very successful 30-year acting career. Internationally recognized for his role as Duncan Macleod, in Highlander-The Series\", Adrian has also produced and directed both film and television projects. Born and raised in London, England, Adrian arrived in the United States in 1984, working as a choreographer and a model. After a year of taking acting classes with acting coaches, Ivana Chubbuck and Roy London, his first series role came on the ABC television show, The Colbys. This led to a role in the Broadway play, \"Bouncers\", in 1987, a guest role on the television show, Beauty and the Beast (1987) and his first film role in the film Last Rites (1988), with Tom Berenger. After a starring role in Roger Corman's,\" Masque of the Red Death \"(1989),he became a series regular in the second season of the television series \"War of the Worlds\"(1988), followed by four episode arc on the MGM, \"Dark Shadows\" series. Fast becoming known for his solid work ethic, CBS cast him as the lead in the television pilot, \"The Owl\" (1990). Although the series wasn't picked up, Adrian didn't stop working, guest starring on Angela Lansbury's \"Murder She Wrote\", and co starring opposite the up-and-coming Sandra Bullock in, \"Love Potion Number 9\". But it would be his next role that would bring him international recognition...that of \"Duncan MacLeod\" in the syndicated series, Highlander (1991-1997). During the 6 year run, Adrian directed four of the series' episodes, including the epic 100th episode, shot in Bordeaux France. Three of these episodes were voted in the top ten best of series for the 119 episode run. Although he was in demand when the series ended in 1997, Paul wanted to go back to his acting roots. After studying with renowned acting coach Larry Moss, he worked on John Landis' romantic comedy, \"Susan's Plan\", the action thriller, \"Dead Men Can't Dance\", and helped found Actors in Process, a theater group, where actors could meet weekly to showcase current work and receive positive critique from their peers. After two years, a production of an original play, \"Things Just Change\", was showcased at the Odyssey theater in Los Angeles, with Paul in the lead role. The success of the Highlander series however, was still current, leading Paul to be offered to star opposite Christopher Lambert in \"Highlander : Endgame\"(2000), to take over the franchise's lead position. Other films followed, including the now cult classic \"The Breed\" (2001), shot in Budapest, Hungary where Adrian met his future wife, Alexandra. In 2001, Lionsgate signed Adrian to a 3 picture deal, as well as to star in and executive produce the Sci Fi action thriller, \"Tracker\" (created by Gil Grant) for Lionsgate Television. With the advent of so many new media outlets however, the syndicated series was not renewed for a second season. Adrian continued to work on films such as \"Nemesis Game\" (Lionsgate) and \"Tides of War\", along with the Spelling Television and Paramount Pictures' hit TV series, \"Charmed\". This was the first time in thirteen years that Adrian had actually filmed again on US soil. In 2006 the Highlander Franchise was back again, this time filming in Lithuania, with Adrian starring in and Executive Producing, what would become his last sortie as Duncan Macleod, in \"Highlander :The Source\". After that came, \"The Legend of Roanoke\"(2007) and the Sci Fi Action Comedy \"The Immortal Voyages of Captain Drake\"(2009), a film in which Paul choreographed all the fight scenes. Always looking for interesting roles, Adrian found himself in Hungary and Tunisia, filming the Seven Arts production, \"Nine Miles Down\"(2009), that he now considers one of his most emotionally challenging roles. Next, he was off to London, in an out of character role, as a Conservative member of Parliament in the thriller, \"The Heavy \"(2010), with Gary Stretch, Stephen Rea and Christopher Lee. Also in 2010, Adrian co-founded his first production company Filmblips Inc. Since 2010, while working as an actor on several other films and TV movies, Adrian also wrote three screenplays, developed financial and artistic presentation packages for film and television, along with spearheading his charity, The Peace Fund, that he founded in 1997. Peace stands for Protect. Educate. Aid. Children. Everywhere. Over the past 17 years, Adrian has overseen the work of the fund in countries such as Romania, Bellarus, Niger, Hungary, Haiti, Cambodia, Thailand and the United States. In 2012, Adrian launched Peace Fund Radio that he co hosts with Ethan Dettanmaeir, with an estimated audience of between 1.8 and 2 million listeners a month. The innovative radio show, has been host to many celebrities with causes of their own and is the catalyst behind the Peace Fund's partnership and donation to bring computers into LAUSD schools. Through the radio shows influence the fund has also partnered with Kimberly Moore's,\" Adopt a Letter\" program to fulfill children's wishes at Christmas, brought books for libraries and lights for homes in El Salvador, along with connecting like minded charities to fulfill their initiatives. In 2015, Adrian helped launch his second production company, Radical Road, aimed at lower budget films, some of which Adrian is set to direct and act in. In 2016 Adrian has two movies, \"The Secret of Emily Blair\" and \"Stormageddon\", releasing and he is getting ready to direct his first feature, \"Chemical Influence\", a screenplay he wrote from an original script. Adrian also launched, \"The Sword Experience\" in 2016. Half day seminars of sword training, that include stage and real life combat and safety tips aimed at individuals, corporations, film, stage, re-enactment societies, martial artists and role playing groups. He is still married to Alexandra and they have two children together, Angelisa and Royce.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5MjM2NDQ1Ml5BMl5BanBnXkFtZTgwODM4ODE1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001600","name":"Adrian Paul","idIMDB":"nm0001600"},"actorId":"nm0001600","character":"Thomas 'Jack' Jackman","urlCharacter":"http://www.imdb.com/character/ch0242064","main":true},{"actorName":"Amanda Douge","urlProfile":"http://www.imdb.com/name/nm0234807","urlPhoto":"","biography":{"dateOfBirth":"December1976","placeOfBirth":" Melbourne, Australia","bio":"Amanda Douge was born in December 1976 in Melbourne, Australia. She is an actress, known for Nine Miles Down (2009), La saga des McGregor (1993) and That Eye, the Sky (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0234807","name":"Amanda Douge","idIMDB":"nm0234807"},"actorId":"nm0234807","character":"Kat","urlCharacter":"http://www.imdb.com/character/ch0242066","main":true},{"actorName":"Anthony Waller","urlProfile":"http://www.imdb.com/name/nm0909026","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4ODMyODA4M15BMl5BanBnXkFtZTcwMjAzODI3MQ@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 October 1959","placeOfBirth":" Lebanon","bio":"British citizen, Anthony Waller, was born in October 1959 in Beirut, Lebanon to English parents. He grew up both in the Middle East and England. As an 11 year-old, Anthony started experimenting with Super-8 film. While still in his early teens, three of his animated films were finalists in two international film competitions sponsored and televised by the BBC. In 1978, Waller was admitted to the UK's National Film School as the youngest ever student, where he studied until 1981. Director John Schlesinger awarded him the Shakespeare Scholarship 1981 with which he spent a year on attachment at Munich's HFF (Film and Television School) in Germany. In November 1981, Waller won 1st prize in the fiction category for his graduation short film, When the Rain Stops (1981), at the first International Festival of Film Schools in Munich. Waller stayed on in Germany for 8 years, initially working for German television as a vision mixer and editor. He subsequently directed and edited over 200 commercials, music videos and movie trailers, and co-founded the commercial production company, Cobblestone Pictures, in Hamburg in 1992. Waller also began composing music professionally in 1984 with a Christmas Carol he wrote for the German football team, FC Bayern. Since then, he has composed some of the jingles for the commercials he directed, including MB Games, Bahlsen, Baileys and notably Old Spice, the song of which was also sung by him and released as a Maxi CD by Intercord in 1993. Waller's first feature film was the thriller, Mute Witness (1995), filmed entirely in Moscow in 1993, and financed privately by himself and his co-producing partners. Filming was complicated by its coincidence with Russia's October revolution, a diphtheria outbreak, -23 degree temperatures, local mafia extortion and last minute cast changes. Despite these initial difficulties, Mute Witness (1995) was sold to Columbia TriStar as a completed movie, and was distributed worldwide in all major territories, and invited to 23 festivals, including the Cannes Film Festival, Courmayeur (Audience Award), Gerardmer (Audience and Grand Jury Award), Moscow (Audience Award), Birmingham (Grand Jury Award) Sundance, Toronto and Tokyo. It included a cameo performance by Sir Alec Guinness, shot 8 years earlier in 1985. In 1995, Waller co-founded the Amsterdam-based, Cometstone Pictures. In 1996, Cometstone's first production was An American Werewolf in Paris (1997), which Waller directed, co-wrote and executive produced. With a budget of $22 million, the movie was an entirely European co-production, sold to Hollywood Pictures in a negative pick-up deal for a Buena Vista release on Christmas Day 1997. Further projects Waller has directed are the psychological thriller, The Guilty (2000), and the supernatural thriller, Nine Miles Down (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4ODMyODA4M15BMl5BanBnXkFtZTcwMjAzODI3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0909026","name":"Anthony Waller","idIMDB":"nm0909026"},"actorId":"nm0909026","character":"Professor Borman","urlCharacter":"http://www.imdb.com/character/ch0242067","main":true},{"actorName":"Caroline Couret-Delegue","urlProfile":"http://www.imdb.com/name/nm2636495","urlPhoto":"","biography":{"bio":"After working in feature film production in Hollywood on movies such as \"Big Stan\" starring Rob Schneider, David Carradine and Jennifer Morrison, \"The Last Word\" with Winona Ryder and Wes Bentley (nominated for the Grand Jury prize at Sundance in 2008), \"The Chosen One\" starring Rob Schneider and Steve Buscemi, Caroline relocated to London to take on responsibilities at Seven Arts Pictures Plc. As Director of Development & Marketing she was responsible for the branding and packaging of all projects either for film markets or for film releases. On a corporate level, she re-branded the image of Seven Arts by leading the design of a new website and providing the sales teams with cutting edge communication tools. She was also involved with international sales and distribution of the Seven Arts' slate. Through her consulting company, Cherry Picked Pictures, she also worked in sales with International sales agent Aspect Film and production company Lunatique Films among other clients. Caroline joined AV Pictures as Sales & Acquisitions Director in September 2011 where she gained invaluable knowledge in deal structuring from the company's founder, Vic Bateman. The start of her relationship with Metrodome Group began with her representation of their in-house productions, and in May 2014 Caroline and Jezz Vernon, MD, announced the establishment of Metrodome International. Caroline is a French native based in London who speaks fluent French, English and Spanish. She holds two post graduate master degrees one in Chemistry from the University of Versailles and the second one in Business Management from the University Montesquieu, Bordeaux.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2636495","name":"Caroline Couret-Delegue","idIMDB":"nm2636495"},"actorId":"nm2636495","character":"Journalist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bruno Andreis","urlProfile":"http://www.imdb.com/name/nm4362707","urlPhoto":"","biography":{"bio":"Bruno Andreis is an actor, known for Nine Miles Down (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4362707","name":"Bruno Andreis","idIMDB":"nm4362707"},"actorId":"nm4362707","character":"Scientist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pierre Cognet","urlProfile":"http://www.imdb.com/name/nm4362692","urlPhoto":"","biography":{"bio":"Pierre Cognet is an actor, known for Nine Miles Down (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4362692","name":"Pierre Cognet","idIMDB":"nm4362692"},"actorId":"nm4362692","character":"Scientist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thierry Goron","urlProfile":"http://www.imdb.com/name/nm4362806","urlPhoto":"","biography":{"bio":"Thierry Goron is an actor, known for Nine Miles Down (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4362806","name":"Thierry Goron","idIMDB":"nm4362806"},"actorId":"nm4362806","character":"Scientist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adel Kallel","urlProfile":"http://www.imdb.com/name/nm4362732","urlPhoto":"","biography":{"bio":"Adel Kallel is an actor, known for Nine Miles Down (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4362732","name":"Adel Kallel","idIMDB":"nm4362732"},"actorId":"nm4362732","character":"Scientist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Attila Szûcs","urlProfile":"http://www.imdb.com/name/nm0844304","urlPhoto":"","biography":{"dateOfBirth":"18 October 1978","placeOfBirth":" Budapest, Hungary","bio":"Attila Szûcs was born on October 18, 1978 in Budapest, Hungary. He is known for his work on Spy (2015), Eragon (2006) and Max (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0844304","name":"Attila Szûcs","idIMDB":"nm0844304"},"actorId":"nm0844304","character":"Scientist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicholas Waller","urlProfile":"http://www.imdb.com/name/nm4362818","urlPhoto":"","biography":{"bio":"Nicholas Waller is an actor, known for Nine Miles Down (2009) and Biohazards (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4362818","name":"Nicholas Waller","idIMDB":"nm4362818"},"actorId":"nm4362818","character":"Scientist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kate Nauta","urlProfile":"http://www.imdb.com/name/nm1690331","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MDMwMjQ5OF5BMl5BanBnXkFtZTYwNzU0ODA3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1982","placeOfBirth":" Salem, Oregon, USA","birthName":"Kate Lynne Nauta","height":"5' 9\" (1.75 m)","bio":"Kate Nauta was born on April 29, 1982 in Salem, Oregon, USA as Kate Lynne Nauta. She is an actress, model and singer, best known for her role as Lola in Le transporteur II (2005). She also sang two of her songs for its soundtrack. She started modeling at age 15. At 17, she won the U.S. Elite Model Look contest and went on to the finals in Nice, Paris. The finals were won by Vika Sementsova from Ukraine. Kate also sings and write lyrics. She has worked with Lenny Kravitz and Naughty By Nature.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MDMwMjQ5OF5BMl5BanBnXkFtZTYwNzU0ODA3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1690331","name":"Kate Nauta","idIMDB":"nm1690331"},"actorId":"nm1690331","character":"JC","urlCharacter":"http://www.imdb.com/character/ch0242063","main":true},{"actorName":"David Story","urlProfile":"http://www.imdb.com/name/nm2632116","urlPhoto":"","biography":{"bio":"David Story is an actor, known for Nine Miles Down (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2632116","name":"David Story","idIMDB":"nm2632116"},"actorId":"nm2632116","character":"Dr. Varga","urlCharacter":"http://www.imdb.com/character/ch0456881","main":true},{"actorName":"Andrew Ryback","urlProfile":"http://www.imdb.com/name/nm3149604","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxODY1NTEzNl5BMl5BanBnXkFtZTcwMjkxMzc5MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Andrew Ryback is an actor, known for Nine Miles Down (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxODY1NTEzNl5BMl5BanBnXkFtZTcwMjkxMzc5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3149604","name":"Andrew Ryback","nicknames":["Mr. Monaco"],"idIMDB":"nm3149604"},"actorId":"nm3149604","character":"Chief Caswell","urlCharacter":"http://www.imdb.com/character/ch0456882","main":true},{"actorName":"Arcadiy Golubovich","urlProfile":"http://www.imdb.com/name/nm1795681","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNTg3OTExNl5BMl5BanBnXkFtZTgwMTY4MTU0NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Arcadiy Golubovich is a producer and actor, known for A Hologram for the King (2016), 99 Homes (2014) and High School (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNTg3OTExNl5BMl5BanBnXkFtZTgwMTY4MTU0NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1795681","name":"Arcadiy Golubovich","idIMDB":"nm1795681"},"actorId":"nm1795681","character":"Alex","urlCharacter":"http://www.imdb.com/character/ch0242068","main":true},{"actorName":"Yousef Amin","urlProfile":"http://www.imdb.com/name/nm2525875","urlPhoto":"","biography":{"dateOfBirth":"13 January 1965","placeOfBirth":" Jeddah, Saudi Arabia","height":"5' 10\" (1.78 m)","bio":"Yousef Amin was born on January 13, 1965 in Jeddah, Saudi Arabia. He is an actor and producer, known for Nine Miles Down (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2525875","name":"Yousef Amin","idIMDB":"nm2525875"},"actorId":"nm2525875","character":"Yousef","urlCharacter":"http://www.imdb.com/character/ch0242069","main":true}],"seasons":[],"idIMDB":"tt0812352","urlIMDB":"http://www.imdb.com/title/tt0812352","business":{"budget":{"money":"$22,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"21","month":"01","year":"2008","remarks":null},{"money":null,"country":null,"day":"21","month":"03","year":"2008","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 26 min (86 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex Cameras and Lenses"],"laboratory":["LISTO Videofilm, Vienna, Austria"],"filmLength":null,"negativeFormat":["35 mm (Fuji Super F-64D 8522, Eterna Vivid 160T 8543, Eterna 250D 8563, Eterna 500T 8573, Reala 500D 8592)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (3-perf) (source format)"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"5.5","filmingLocations":[{"location":"Budafoki Film Studios, Budapest, Hungary"}],"awards":[],"votes":"2,751","type":"Movie","companyCreditsSimple":[{"idCompany":"co0229527","name":"Silverback Films"},{"idCompany":"co0222343","name":"Gone to Hell"},{"idCompany":"co0135086","name":"A-Mark Entertainment"}],"keywords":{"keywords":["gas","desert","hell","male rear nudity","male nudity","investigation","missing person","sex","drilling hole","geologist","devil","hallucination","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 18:29:28"}}