{"data":{"movies":[{"title":"Sense & Sensibility","originalTitle":"","year":"2008–","releaseDate":"20080330","writers":[],"runtime":"59 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MDQ4ODU1NF5BMl5BanBnXkFtZTgwNjAyODkwMzE@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Drama","Romance"],"plot":"Widow Dashwood and her three unmarried daughters, Elinor, Marianne and Margaret, inherit only a tiny allowance. So they move out of their grand Sussex home to a more modest cottage in Devonshire. There, the prevailing ambition is to find suitable husbands for the girls. With help from wealthy neighbor Sir John Middleton, suitors for Elinor and Marianne are soon found, but not landed. They include dashing Willoughby, future vicar Edward Ferrars and retired colonial gentleman Colonel Brandon.","simplePlot":"Widow Dashwood and her three unmarried daughters, Elinor, Marianne and Margaret, inherit only a tiny allowance. So they move out of their grand Sussex home to a more modest cottage in ... ","actors":[{"actorName":"Dominic Cooper","urlProfile":"http://www.imdb.com/name/nm1002641","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2OTk2NDc1Ml5BMl5BanBnXkFtZTcwNTUyNzc4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 June 1978","placeOfBirth":" Greenwich, London, England, UK","birthName":"Dominic Edward Cooper","height":"5' 9½\" (1.77 m)","bio":"Dominic Edward Cooper was born and raised in Greenwich, London, England. His mother, Julie (Heron), is a nursery school teacher and a keen theater-goer. His father, Brian Cooper, is an auctioneer. They divorced when Dominic was age 5. His maternal great-grandfather was film enthusiast E.T. Heron, who published The Kinematograph Weekly. He has two older brothers, Nathan and Simon. He had a sister who died in a car accident when she was age 5, which happened before Dominic was born. He also has a half-sister from an extramarital affair by his father and a half-brother from his father's second marriage. He went to school in Kidbrooke, attending the Thomas Tallis School. He didn't know what to do afterwards and his girlfriend, at the time, suggested that he should apply to drama school. He did his training at the London Academy of Music and Dramatic Art. He performed in the end of year play 'Waiting For Godot' and this performance landed him the renowned agent Pippa Markham. He graduated in 2000 and started with a few minor roles in television and theater. In 2004, he landed a role at the National Theatre with 'The History Boys'. He originated the role of Dakin, as he was involved in the play from the very beginning. He played the role for two years on the stage and then, for the final time, in his breakthrough film role The History Boys (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2OTk2NDc1Ml5BMl5BanBnXkFtZTcwNTUyNzc4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1002641","name":"Dominic Cooper","idIMDB":"nm1002641"},"actorId":"nm1002641","character":" Willoughby","urlCharacter":"http://www.imdb.com/character/ch0030143","main":true},{"actorName":"Charity Wakefield","urlProfile":"http://www.imdb.com/name/nm1564421","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjFjNjM3NWEtYmI3MC00YWU1LWEwZjUtOWZlOTU2YjI4YmViL2ltYWdlXkEyXkFqcGdeQXVyMTU5OTc3OTI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"September1980","placeOfBirth":" Tunbridge Wells, Kent, England, UK","birthName":"Charity Rose Wakefield","height":"5' 5\" (1.65 m)","bio":"Charity Wakefield was born in September 1980 in Tunbridge Wells, Kent, England as Charity Rose Wakefield. She is an actress and producer, known for Wolf Hall (2015), The Player (2015) and Sense & Sensibility (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjFjNjM3NWEtYmI3MC00YWU1LWEwZjUtOWZlOTU2YjI4YmViL2ltYWdlXkEyXkFqcGdeQXVyMTU5OTc3OTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1564421","name":"Charity Wakefield","idIMDB":"nm1564421"},"actorId":"nm1564421","character":" Marianne Dashwood","urlCharacter":"http://www.imdb.com/character/ch0011444","main":true},{"actorName":"Hattie Morahan","urlProfile":"http://www.imdb.com/name/nm0602455","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NDY4ODE1Nl5BMl5BanBnXkFtZTcwOTA0MjAzOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1978","placeOfBirth":" Lambeth, London, England, UK","birthName":"Harriet Jane Morahan","height":"5' 8\" (1.73 m)","bio":"Hattie Morahan was born in London in 1978. Her father, Christopher Morahan, is a television and stage director, who is perhaps best known for his television adaptation of The Jewel in the Crown (1984). Her mother, Anna Carteret, is an actress whose most high profile role was that of Inspector Kate Longton, whom she played in the BBC police drama series Juliet Bravo (1980) between 1983 and 1985. Hattie was educated at the Frensham Heights School. Whilst she was at school people would recognize her mother because they had seen Anna on TV in Juliet Bravo. Hattie has said in interviews that for a long time she thought that Manchester was in India because her father was working for Granada but he kept going away to India. In 1995, when she was sixteen years old, her father cast her as Una Gwithiam in a television adaptation of The Peacock Spring (1996), which was broadcast on British television on 1st January 1996. Hattie studied English Literature at New Hall, Cambridge between 1997 and 2000. This Cambridge University college has since been renamed Murray Edwards College. Whilst she was at Cambridge, she acted in several student drama productions. Hattie played Snowball, the pig based on Trotsky, in a stage adaptation of George Orwell's novel, 'Animal Farm', at the ADC Theatre in Cambridge from 18th to 22nd November 1997. She returned to the ADC Theatre in February 1998 as part of the cast of 'Ticklebang', a new comedy written by Dylan Ritson, and she was part of the cast when the play was put on at the Edinburgh Fringe Festival in August 1998. In November 1998 Hattie decided to switch for the time being from acting to direction, and directed 'The Suicide', a play by Nikolay Erdman, at the ADC in Cambridge, with Blake Ritson, the brother of Dylan, as her assistant director. Hattie played the part of Catherine in Phillip Breen's production of Arthur Miller's modern classic, 'A View from the Bridge', at the ADC from 9th to 13th February, 1999. This production was re-staged at the National Student Drama Festival at Scarborough in April 1999 and Hattie won the best actress award at the festival. In July 1999 she played Cecily Cardew in an outdoor production of Oscar Wilde's classic comedy of manners, 'The Importance of being Earnest', with Phillip Breen as director and Blake Ritson in the role of Jack Worthing. This played at a number of outdoor venues in and around Cambridge. It was later staged at the ADC in Cambridge from 11th to 13th October 1999. Towards the end of her time at Cambridge, Hattie played Isabel in Pedro Calderon De la Barca's play, 'The Mayor of Zalamea', at the Cambridge Arts Theatre in the summer of 2000, and in that summer she graduated with a degree in English from Cambridge University. At this point, she was clear that she wanted to pursue a career in acting. Her parents recommended that she enroll at drama school. However, Hattie was eager to get started on her professional acting career. She made a deal with her parents that if she did not get much work in the next twelve months, she would follow their advice and go to drama school. As it turned out within a few months Hattie had won a contract with the Royal Shakespeare Company (RSC), and whilst she was there she was able to take advantage of the technical classes and voice coaching to improve her acting technique. Her first professional engagement was as one of the players in a production of 'Hamlet' directed by Steven Pimlott. This was staged first at the Swan Theatre in Stratford upon Avon from 31st March to 13th October 2001 and then at the Barbican Theatre in London from 6th December 2001 to 2nd April 2002. As well as her part as one of the players, Hattie also understudied the role of Ophelia. She was with the RSC for over a year and her other roles for the company included the part of Lucy in 'Love in a Wood', a Restoration comedy by William Wycherley which was staged at the Swan Theatre in Stratford between 12th April and 12th October 2001; Emela in 'The Prisoner's Dilemma' by David Edgar, which was performed at the Other Place in Stratford from 11th July to 13th October 2001; and Tracy, the hotel receptionist, in 'Night of the Soul', a new play written and directed by David Farr, which ran at the Barbican Pit in London from 19th April to 11th May 2002. After she had completed her time with the RSC, Hattie played the part of Elizabeth in a revival of Somerset Maugham's play 'The Circle' directed by Mark Rosenblatt. This production went on a tour of English regional theaters in the autumn of 2002 starting at the Malvern Theatre, (27th to 31st August), and finishing at the Arts Theatre in Cambridge, (21st to 26th October). In 2003 she played Elaine Harper in 'Arsenic and Old Lace' for Katharine Dore Management at the Strand Theatre in London from 14th February to 31st May, and Louise De la Valliere in 'Power', a new play written by Nick Dear, at the National Theatre in London from 3rd July to 29th October. In 2004 she played Ruby in Peter Flannery's play 'Singer' at the Tricycle Theatre in Kilburn from 10th March to 10th April. She appeared as Totty Vogel Downing, an expert on art fraud seconded to the unsolved case squad in one episode of New Tricks (2003), the popular BBC1 crime drama series, and she took part in a presentation of Eve Ensler's play, 'Necessary Targets', directed by Anna Carteret at the Arts Theatre in London on Sunday 10th October 2004 . Also in 2004, Hattie took part in a rehearsed reading of 'Othello' at the Globe Theatre in London and she played the part of a receptionist in 'Out of Time', a short film written by Dylan Ritson and directed by his brother Blake. However, Hattie's breakthrough as a stage actress was probably her performance in the title role in a 2004 revival of Euripides' play, 'Iphigenia at Aulis'. This was staged at the National Theatre in London and ran from 12th June to 7th September 2004. The play's director, Katie Mitchell, is a controversial figure in contemporary British theatre, but Hattie is an admirer of her work, and as it turned out 'Iphigenia at Aulis' was the start of a long running collaboration between the two women. In 2005 she played Beth Lucas, a regular character in the second season of the BBC3 medical drama, Bodies (2004), and she made a guest appearance in the radio version of Trevor's World of Sport (2003). She played Carrie, a media studies graduate interested in a career in talent management, who goes on a work placement at TS Sports Stars. The episode was entitled 'Work Experience' and it was broadcast by BBC Radio 4 on 29th November 2005. In the autumn she played Viola in a well received production of William Shakespeare 's play 'Twelfth Night' at the West Yorkshire Playhouse in Leeds. This production ran from 17th September to 22nd October 2005. In 2006 she played Penelope Toop in 'See How They Run' for ACT Productions in a tour of regional theaters starting at the Theatre Royal, Plymouth, (15th to 18th February 2006) and finishing at the Malvern Theatre, (4th to 8th April 2006). 'See How They Run' was directed by Douglas Hodge, a good friend of Hattie's fiancé, Blake Ritson. Also in 2006 she played Alice in a BBC Radio 4 production of David Hare's play, 'Plenty', broadcast on 30th September 2006, and in the summer of 2006 Hattie was reunited with Katie Mitchell, who directed her in Anton Chekhov's play 'The Seagull' at the National Theatre. The play ran from 17th June to 23rd September and Hattie won an Ian Charleston award for her performance as Nina in this play. Hattie was part of the cast in 'Asylum Monologues', an event organized by Actors for Human Rights, at Cambridge University on 18th October 2007. She was also busy filming various television and film projects in 2007. She played the part of Sister Clara in New Line Cinema's film of The Golden Compass (2007), which went on general release in Great Britain on 5th December 2007, as well as playing Gale Benson, the daughter of a Conservative member of parliament who becomes involved with the black power movement, in Roger Donaldson's film, The Bank Job (2008). The Bank Job (2008) went on general release in Britain on 29th February 2008. On television she was in two comedies made by Hat Trick productions, namely Outnumbered (2007) and Bike Squad (2008). She won widespread acclaim for her performance as Elinor Dashwood in Andrew Davies' adaptation of Jane Austen's novel, Sense & Sensibility (2008). This was broadcast on BBC1 between 1st and 13th January 2008. This television adaptation was inevitably compared with the 1995 Columbia Tristar film of the same book in which Emma Thompson had played Elinor, although in her preparation for the role Hattie had deliberately avoided watching the film again and decided not to think about Emma Thompson. Hattie won the best actress award at the Shanghai Television Festival for her performance as Elinor Dashwood. She appeared in several radio dramas in the first quarter of 2008, including 'What I think of my Husband', a radio play by Stephen Wakelam about Thomas Hardy's relationship with his second wife, Florence Dugdale. This was broadcast on BBC Radio 4 between 31st March and 4th April 2008, and featured excellent performances from both Nigel Anthony as Hardy and Hattie as Florence. She also played the part of Constance in a radio adaptation of Alfred Hitchcock's 1945 film Spellbound (1945). This was broadcast on BBC Radio 4 on Saturday 16th February 2008. Her co-star in this radio play was Benedict Cumberbatch, with whom she appeared in Martin Crimp's play, 'The City'. This play opened at the Royal Court Theatre in London on Thursday 24th April 2008 and ran until Saturday 7th June 2008. It was directed by Katie Mitchell, who also directed Hattie in 'Some Trace of Her', an experimental stage version of Fyodor Dostoevsky's novel, 'The Idiot'. This opened at the Cottesloe stage of the National Theatre in London on Wednesday 23rd July and ran until Tuesday 21st October 2008. She was also in the cast of Agatha Christie's Marple: A Pocket Full of Rye (2008), an Agatha Christie TV drama starring Julia McKenzie as Miss Marple, in which Hattie played Elaine Fortescue, the daughter of a murdered businessman. In the autumn of 2008 Hattie played the role of Jane again in the second series of the BBC1 situation comedy Outnumbered (2007). On Sunday 2nd November 2008 she returned to Cambridge University, where she gave a talk on her acting career at the Judith E. Wilson Drama Studio. She was one of the readers for 'Active Resistance to Propaganda' by Vivienne Westwood, the Royal Shakespeare Company's Alternative Christmas lecture, which was staged at Wilton's Music Hall in London on Sunday 16th December 2008. She also played the part of Mary in a revival of the T.S. Eliot play 'Family Reunion' at the Donmar Warehouse in London. This play opened on Thursday 20th November 2008 and ran until Saturday 10th January 2009. The play was in a very real sense a family reunion for Hattie since the cast included Hattie's mother Anna Carteret. In 2009 Hattie played Claire in 'Love Hate'. This was a short film about a charity worker who falls in love with a mysterious woman. It was written and directed by the Ritson brothers, and the cast also included Ben Whishaw, with whom Hattie had previously co-starred in stage productions of 'The Seagull' in 2006 and 'Some Trace of Her' in 2008. In the spring of 2009 Hattie returned to the National Theatre in London to play Kay Conway in 'Time and the Conways' by J.B.Priestley. The play opened on Tuesday 28th April 2009 and completed its run on Sunday 16th August 2009. Hattie played Elizabeth in Meredith Oakes' unusually entitled social comedy, 'Alex Tripped on my fairy', which was broadcast by BBC Radio 3 on Saturday 21st March 2009. She was one of the readers for an edition of the BBC Radio 3 show, 'Words and Music', which went out on Sunday 29th March 2009, and she also narrated a ten part dramatization of 'Lady Audley's Secret' by Mary Elizabeth Braddon. This was broadcast by BBC Radio 4 between Monday 20th April 2009 and Friday 1st May 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NDY4ODE1Nl5BMl5BanBnXkFtZTcwOTA0MjAzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0602455","name":"Hattie Morahan","idIMDB":"nm0602455"},"actorId":"nm0602455","character":" Elinor Dashwood","urlCharacter":"http://www.imdb.com/character/ch0011446","main":true},{"actorName":"Janet McTeer","urlProfile":"http://www.imdb.com/name/nm0005216","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk5MzQ3MDQxOF5BMl5BanBnXkFtZTcwOTU4OTI2Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 August 1961","placeOfBirth":" Newcastle, Tyne and Wear, England, UK","height":"6' 1\" (1.85 m)","bio":"Janet McTeer was born on August 5, 1961 in Newcastle, England, UK to parents Jean and Allan McTeer. She was raised in York from the age of 6. She attended Queen Anne Grammar School for Girls, where there was not much opportunity for drama. She became interested in acting at age 16, when she saw \"She Stoops to Conquer\" at the York Theater. She worked as a waitress at the same theater, where she once served a coffee to Gary Oldman. He suggested that she apply to attend the Royal Academy of Dramatic Art (RADA), where he had just finished studying. She successfully gained a place at RADA. After graduation, she began her career acting on stage by joining the Royal Exchange Theatre. Her on-screen film debut came in Half Moon Street (1986), an erotic thriller based on a novel by Paul Theroux. In 2000, she received her first Oscar nomination for Best Actress in a Leading Role for Tumbleweeds (1999). She was awarded Officer of the Order of the British Empire in the 2008 Queen's Birthday Honours List for her services to drama.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk5MzQ3MDQxOF5BMl5BanBnXkFtZTcwOTU4OTI2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005216","name":"Janet McTeer","idIMDB":"nm0005216"},"actorId":"nm0005216","character":" Mrs. Dashwood","urlCharacter":"http://www.imdb.com/character/ch0011447","main":true},{"actorName":"Lucy Boynton","urlProfile":"http://www.imdb.com/name/nm2377903","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NzA2NDc3N15BMl5BanBnXkFtZTgwNjA3MjI4NjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"January1994","placeOfBirth":" New York City, New York, USA","birthName":"Lucy Christabel Boynton","bio":"Lucy Boynton was born in January 1994 in New York City, New York, USA as Lucy Christabel Boynton. She is an actress, known for Sing Street (2016), Ballet Shoes (2007) and Rebel in the Rye (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NzA2NDc3N15BMl5BanBnXkFtZTgwNjA3MjI4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2377903","name":"Lucy Boynton","idIMDB":"nm2377903"},"actorId":"nm2377903","character":" Margaret Dashwood","urlCharacter":"http://www.imdb.com/character/ch0031096","main":true},{"actorName":"David Morrissey","urlProfile":"http://www.imdb.com/name/nm0607375","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NTM4NjQzMV5BMl5BanBnXkFtZTgwOTk3MTY3MTI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 June 1964","placeOfBirth":" Everton, Liverpool, England, UK","height":"6' 3\" (1.91 m)","bio":"David Morrissey started acting at Everyman's Youth Theatre in Liverpool, where he was born and raised. He made an auspicious debut in One Summer (1983), a series about two Liverpool runaways. Following a degree at RADA, he worked with the theatre company Cheek By Jowl. He has also worked at theatre such as the Manchester Royal Exchange and the National Theatre. He is married to novelist Esther Freud, the great-granddaughter of Sigmund Freud and daughter of artist Lucian Freud.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NTM4NjQzMV5BMl5BanBnXkFtZTgwOTk3MTY3MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0607375","name":"David Morrissey","idIMDB":"nm0607375"},"actorId":"nm0607375","character":" Colonel Brandon","urlCharacter":"http://www.imdb.com/character/ch0011451","main":true},{"actorName":"Linda Bassett","urlProfile":"http://www.imdb.com/name/nm0060221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMzQ2ODkzMF5BMl5BanBnXkFtZTcwNjM1Mzk5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1950","placeOfBirth":" Pluckley, Kent, England, UK","bio":"Linda Bassett was born in the Kentish village of Pluckley - location for the television series The Darling Buds of May (1991). She was brought up in Pimlico, South London, by her typist mother and police officer father. She became interested in acting as a child when she was frequently taken to see plays in London, most notably at the Old Vic, the famous classical theater. On leaving school, Linda went to work at the Old Vic as an usherette and catering manager, before going to read English at Leeds University. However, she dropped out after a year and became involved in a local drama group which put on plays in community-based locations, such as schools. She regards this as her theatrical schooling, having had no formal training. She made her London stage debut at the age of thirty-two in 1982 and, in 1991, she joined the Royal Shakespeare Company. Although she was a well-regarded stage performer, it was the 1999 film version of the play East Is East (1999) (in which she had been an original stage cast member) which brought her to a larger audience and, throughout the 2000s, she has been a familiar face in a variety of films and television series. In the late 1980s, she returned to live in Pluckley.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMzQ2ODkzMF5BMl5BanBnXkFtZTcwNjM1Mzk5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0060221","name":"Linda Bassett","idIMDB":"nm0060221"},"actorId":"nm0060221","character":" Mrs Jennings","urlCharacter":"http://www.imdb.com/character/ch0011449","main":true},{"actorName":"Mark Williams","urlProfile":"http://www.imdb.com/name/nm0931247","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1Mzc4NjA5OV5BMl5BanBnXkFtZTcwMDc5OTUwOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 August 1959","placeOfBirth":" Bromsgrove, Worcestershire, England, UK","height":"6' 1\" (1.86 m)","bio":"Mark Williams was born on August 22, 1959 in Bromsgrove, Worcestershire, England. He is an actor and writer, known for Harry Potter and the Goblet of Fire (2005), Harry Potter and the Chamber of Secrets (2002) and Harry Potter and the Prisoner of Azkaban (2004). He is married to Dianne Williams. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1Mzc4NjA5OV5BMl5BanBnXkFtZTcwMDc5OTUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0931247","name":"Mark Williams","idIMDB":"nm0931247"},"actorId":"nm0931247","character":" Sir John Middleton","urlCharacter":"http://www.imdb.com/character/ch0011448","main":true},{"actorName":"Claire Skinner","urlProfile":"http://www.imdb.com/name/nm0804218","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NjA2NTQ0NF5BMl5BanBnXkFtZTcwNjQ4MjUxNw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1964","placeOfBirth":" Hemel Hempstead, Hertfordshire, England, UK","birthName":"Claire L. Skinner","height":"5' 5\" (1.65 m)","bio":"Claire Skinner was born in 1964 in Hemel Hempstead, Hertfordshire, England as Claire L. Skinner. She is an actress, known for Sleepy Hollow (1999), Naked (1993) and Bridget Jones's Diary (2001). She has been married to Charlie Palmer since February 2001. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NjA2NTQ0NF5BMl5BanBnXkFtZTcwNjQ4MjUxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0804218","name":"Claire Skinner","idIMDB":"nm0804218"},"actorId":"nm0804218","character":" Fanny Dashwood","urlCharacter":"http://www.imdb.com/character/ch0031104","main":true},{"actorName":"Rosanna Lavelle","urlProfile":"http://www.imdb.com/name/nm1098145","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNTk5NTM0M15BMl5BanBnXkFtZTYwNDA1Nzcy._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 August 1979","placeOfBirth":" Lancashire, England, UK","bio":"Rosanna Lavelle was born on August 8, 1979 in Lancashire, England. She is an actress, known for Two Men Went to War (2002), Angel (2007) and Charlotte Gray (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNTk5NTM0M15BMl5BanBnXkFtZTYwNDA1Nzcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1098145","name":"Rosanna Lavelle","idIMDB":"nm1098145"},"actorId":"nm1098145","character":" Lady Middleton","urlCharacter":"http://www.imdb.com/character/ch0031127","main":true},{"actorName":"Dan Stevens","urlProfile":"http://www.imdb.com/name/nm1405398","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NTY5OTI2MF5BMl5BanBnXkFtZTgwNDkzMzIxMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1982","placeOfBirth":" Croydon, Surrey, England, UK","birthName":"Daniel Jonathan Stevens","height":"6' (1.83 m)","bio":"Dan Stevens was born at Croydon in Surrey on 10th October 1982. His parents are teachers. He was educated at Tonbridge School and trained in acting at the National Youth Theatre of Great Britain. He studied English Literature at Emmanuel College, Cambridge. Whilst he was a Cambridge undergraduate, he acted in several student drama productions. He played the title role in the Marlowe Dramatic Society's production of William Shakespeare's play, \"Macbeth\". This was staged at the Cambridge Arts Theatre from Tuesday 26th February to Saturday 2nd March 2002. The cast also featured Rebecca Hall in the roles of Lady Macbeth and Hecate. During one of his university summer holidays in August 2003 he went to Slovakia where he filmed his scenes for the Hallmark production of Frankenstein (2004). Dan played the part of Henry Clerval and the mini-series was first broadcast on American television on 5th October 2004. Shortly after graduating from Cambridge Dan was nominated for an Ian Charleson award for his performance as Orlando in \"As You Like It\" at the Rose Theatre at Kingston in Surrey. \"As You Like It\" was directed by Peter Hall and ran from 30th November to 18th December 2004. This production for the Peter Hall Company subsequently went on a tour of America in the early months of 2005, playing at the Ahmanson Theatre in Los Angeles, the Curran Theater in San Francisco and the Harvey Theater at the Brooklyn Academy of Music in New York City. It featured Rebecca Hall in the role of Rosalind. Dan was reunited with the director Peter Hall when he played Claudio in a new production of the Shakespeare play, \"Much ado about Nothing\", for the Peter Hall Company at the Theatre Royal in Bath from 29th June to 6th August 2005. In February 2006 Dan played the parts of Marban and Maitland in a revival of Howard Brenton's controversial play, \"The Romans in Britain\", directed by Samuel West at the Crucible Theatre in Sheffield. Then in May 2006 he played Nick Guest, the protagonist in The Line of Beauty (2006). This three part television mini-series was adapted by Andrew Davies from the 2004 Booker prize winning novel by Alan Hollinghurst. The Line of Beauty (2006) is about Nick Guest's relationship with his university friend Toby Fedden. The story takes place in the 1980s. It is set against the backdrop of Margaret Thatcher's free market economic policies and the spread of the acquired immunity deficiency syndrome, (AIDS). These two social developments directly affect the characters in the story because Toby's father Gerald is a Conservative member of parliament and Nick is homosexual. Whilst The Line of Beauty (2006) was being broadcast on BBC television, Dan was appearing as Simon Bliss in the Noël Coward play, \"Hay Fever\". This play was staged at the Theatre Royal Haymarket in London from 11th April to 5th August 2006 and the cast also included Judi Dench in the role of Judith Bliss. At the end of the year Dan played Lord Holmwood in a television dramatization of Dracula (2006), which was broadcast on 28th December 2006. In 2007 Dan played the part of Michael Faber in Agatha Christie's Marple: Miss Marple: Nemesis (2007), an Agatha Christie adaptation with Geraldine McEwan in the role of Miss Jane Marple. He also featured in the cast of Maxwell (2007), a television drama about the famous newspaper magnate. Maxwell (2007) was first broadcast on British television on 4th May 2007. David Suchet played Robert Maxwell, and Dan took the part of Basil Brookes, one of the press baron's financial directors. Dan played the part of Edward Ferrars in a television dramatization of Jane Austen's novel, Sense & Sensibility (2008). This was broadcast in three episodes on BBC1 between Tuesday 1st and Sunday 13th January 2008. The novel was adapted for television by Andrew Davies, whom Dan had previously worked with on The Line of Beauty (2006). Davies felt that the part of Edward Ferrars was underdeveloped in the book, and so he deliberately added scenes not included in the novel to help draw out the character. So, for instance, we saw Edward out horse riding on the Norland estate and chopping logs at Barton Cottage. In the DVD audio commentary Dan joked that this was the best example of log chopping ever seen on British television! After Sense & Sensibility (2008), Dan featured in the cast of \"The Tennis Court\", a BBC Radio 4 Saturday play broadcast on 19th January 2008. He also played Nicky Lancaster in a revival of the Noël Coward play, \"The Vortex\", at the Apollo Theatre in London from Wednesday 20th February to Saturday 7th June 2008. This was another collaboration with the stage director, Peter Hall. Dan played the eponymous hero of \"Dickens Confidential\", a six part radio drama series set in the 1830s which imagines what might have happened if Charles Dickens had continued his career as a journalist. This was broadcast on BBC Radio 4 between Monday 9th June and Monday 14th July 2008. He played the part of Peregrine in 'Orley Farm', the BBC Radio 4 Classic Serial. This was a three part adaptation of the novel by Anthony Trollope broadcast between Sunday 28th December 2008 and Sunday 11th January 2009. A month later he played Duval in the BBC Radio 4 Woman's Hour drama, 'The Lady of the Camellias'. This was broadcast between Monday 2nd and Friday 6th February 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NTY5OTI2MF5BMl5BanBnXkFtZTgwNDkzMzIxMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1405398","name":"Dan Stevens","idIMDB":"nm1405398"},"actorId":"nm1405398","character":" Edward Ferrars","urlCharacter":"http://www.imdb.com/character/ch0011445","main":true},{"actorName":"Mark Gatiss","urlProfile":"http://www.imdb.com/name/nm0309693","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNDIwNzg4NF5BMl5BanBnXkFtZTcwNTI0MTk4OQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 October 1966","placeOfBirth":" Sedgefield, England, UK","height":"6' 1\" (1.86 m)","bio":"Mark Gatiss is an accomplished author, actor and playwright. Originally from Sedgefield, he graduated from Bretton Hall Drama College with a BA (honors) in Theatre Arts. He was one-quarter of the award-winning comedy team The League of Gentlemen (1999), and became heavily involved in the post-television Doctor Who (1963) scene, having written a variety of novels and audio plays, together with a string of short supernatural/science-fiction films (most of which he appeared in). He also co-wrote three sketches for BBC2's \"Doctor Who (1963) Night\" in November 1999. When Doctor Who (2005) was re-imagined by Russell T. Davies and returned to television, Gatisss became part of the writing team. He had another major success as the co-creator of Sherlock (2010) for the BBC with Steven Moffat. He has co-written plays for the Edinburgh Festival and appeared in a number of theatre and radio shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNDIwNzg4NF5BMl5BanBnXkFtZTcwNTI0MTk4OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0309693","name":"Mark Gatiss","idIMDB":"nm0309693"},"actorId":"nm0309693","character":" John Dashwood","urlCharacter":"http://www.imdb.com/character/ch0011450","main":true},{"actorName":"Caroline Hayes","urlProfile":"http://www.imdb.com/name/nm0370930","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5ODUyNjk1NF5BMl5BanBnXkFtZTgwODU5MTk0MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Caroline Hayes is an English actress working and living in London. She has appeared on stage and television in the UK and Canada, most notably in the BBC series The Sins, alongside Pete Postlethwaite and Geraldine James, and Servants, another BBC series featuring Joe Absolom. She also starred in the highly acclaimed Donmar Warehouse production of The Real Thing by Tom Stoppard alongside Steven Dillane and Jennifer Ehle. In the North American market, she had a supporting role in two episodes of the Canadian science fiction TV series Starhunter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5ODUyNjk1NF5BMl5BanBnXkFtZTgwODU5MTk0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0370930","name":"Caroline Hayes","idIMDB":"nm0370930"},"actorId":"nm0370930","character":" Eliza","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Glover","urlProfile":"http://www.imdb.com/name/nm0323109","urlPhoto":"","biography":{"dateOfBirth":"24 September 1927","placeOfBirth":" London, England, UK","bio":"David Glover was born on September 24, 1927 in London, England. He was an actor, known for Conspiracy (2001), The Ipcress File (1965) and Edward II (1991). He died on February 16, 2015 in London.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0323109","name":"David Glover","idIMDB":"nm0323109"},"actorId":"nm0323109","character":" Foot","urlCharacter":"http://www.imdb.com/character/ch0153225","main":true},{"actorName":"Daisy Haggard","urlProfile":"http://www.imdb.com/name/nm0353579","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcyNTQxMDY2Nl5BMl5BanBnXkFtZTcwNDg0ODcyOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1978","placeOfBirth":" Scotland, UK","birthName":"Celia Daisy Morna Haggard","bio":"Daisy Haggard was born in 1978 in Scotland as Celia Daisy Morna Haggard. She is an actress and producer, known for Harry Potter and the Order of the Phoenix (2007), Harry Potter and the Deathly Hallows: Part 1 (2010) and I Give It a Year (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcyNTQxMDY2Nl5BMl5BanBnXkFtZTcwNDg0ODcyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0353579","name":"Daisy Haggard","idIMDB":"nm0353579"},"actorId":"nm0353579","character":" Miss Steele","urlCharacter":"http://www.imdb.com/character/ch0031133","main":true},{"actorName":"Anna Madeley","urlProfile":"http://www.imdb.com/name/nm0534777","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAzNTM3N2MtOTZjNy00YTYxLWFhZGUtM2IwODYyNTQ0NTY0XkEyXkFqcGdeQXVyMzE3OTU5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1977","placeOfBirth":" London, England, UK","bio":"Anna Madeley was born in 1977 in London, England. She is an actress, known for In Bruges (2008), Brideshead Revisited (2008) and Affinity (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAzNTM3N2MtOTZjNy00YTYxLWFhZGUtM2IwODYyNTQ0NTY0XkEyXkFqcGdeQXVyMzE3OTU5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0534777","name":"Anna Madeley","idIMDB":"nm0534777"},"actorId":"nm0534777","character":" Lucy Steele","urlCharacter":"http://www.imdb.com/character/ch0030205","main":true},{"actorName":"Leo Bill","urlProfile":"http://www.imdb.com/name/nm1095324","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTU3NjEyNl5BMl5BanBnXkFtZTcwMjA1Njk1MQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 August 1980","placeOfBirth":" Warwickshire, England, UK","height":"6' (1.83 m)","bio":"Leo Bill was born on August 31, 1980 in Warwickshire, England. He is an actor, known for 28 Days Later... (2002), Alice in Wonderland (2010) and The Girl with the Dragon Tattoo (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTU3NjEyNl5BMl5BanBnXkFtZTcwMjA1Njk1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1095324","name":"Leo Bill","idIMDB":"nm1095324"},"actorId":"nm1095324","character":" Robert Ferrars","urlCharacter":"http://www.imdb.com/character/ch0031108","main":true},{"actorName":"Morgan Overton","urlProfile":"http://www.imdb.com/name/nm2880372","urlPhoto":"","biography":{"bio":"Morgan Overton is an actor, known for Chuggington (2008), Chuggington: Badge Quest (2010) and Doctor Who (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2880372","name":"Morgan Overton","idIMDB":"nm2880372"},"actorId":"nm2880372","character":" Little Henry","urlCharacter":"http://www.imdb.com/character/ch0153226","main":true},{"actorName":"Tim McMullan","urlProfile":"http://www.imdb.com/name/nm0573406","urlPhoto":"","biography":{"dateOfBirth":"1963","placeOfBirth":" Lambeth, London, England, UK","birthName":"Timothy W V McMullan","bio":"Tim McMullan was born in 1963 in Lambeth, London, England as Timothy W V McMullan. He is an actor, known for Shakespeare in Love (1998), The Queen (2006) and The Fifth Element (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0573406","name":"Tim McMullan","idIMDB":"nm0573406"},"actorId":"nm0573406","character":" Mr Palmer","urlCharacter":"http://www.imdb.com/character/ch0031121","main":true},{"actorName":"Tabitha Wady","urlProfile":"http://www.imdb.com/name/nm0905632","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyMTkyNzIwN15BMl5BanBnXkFtZTgwNzg3NTQzMTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1976","placeOfBirth":" Bath, Avon, England, UK [now Bath and North East Somerset, England, UK]","bio":"Tabitha Wady was born in 1976 in Bath, Avon, England, UK [now Bath and North East Somerset, England, UK]. She is an actress, known for Doctors (2000), Kevin & Perry Go Large (2000) and Christie Malry's Own Double-Entry (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyMTkyNzIwN15BMl5BanBnXkFtZTgwNzg3NTQzMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0905632","name":"Tabitha Wady","idIMDB":"nm0905632"},"actorId":"nm0905632","character":" Charlotte Palmer","urlCharacter":"http://www.imdb.com/character/ch0031116","main":true},{"actorName":"Roy Holder","urlProfile":"http://www.imdb.com/name/nm0390332","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjYzODIwNjAyNV5BMl5BanBnXkFtZTgwMzQ2NTU3MTE@._V1_UY44_CR10,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 June 1946","placeOfBirth":" Birmingham, England, UK","birthName":"Roy Trevor Holder","bio":"Roy Holder was born on June 15, 1946 in Birmingham, England as Roy Trevor Holder. He is an actor, known for Pride & Prejudice (2005), Robin Hood (2010) and Romeo and Juliet (1968). He is married to Pauline Cox. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjYzODIwNjAyNV5BMl5BanBnXkFtZTgwMzQ2NTU3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0390332","name":"Roy Holder","idIMDB":"nm0390332"},"actorId":"nm0390332","character":" Thomas","urlCharacter":"http://www.imdb.com/character/ch0147896","main":true}],"seasons":[{"yearSeason":2008,"episodes":[{"episode":1,"title":"Episode #1.1","date":"6 Mar. 2009","plot":"When Mr. Dashwood dies, he leaves his Sussex estate Norland -undivided, as the law requires- to his first marriage son John. John's wife, Fanny, convinces him to deny, in the name of their only son Henry's inheritance, his widowed stepmother and her three daughters the generosity understood at pap's deathbed. When the heiress-in-law's brother Edward Ferrars visits, he proves a perfect, understanding gentleman mutually drawn to eldest daughter Elinor, but she's told mother Ferrars makes inheriting the vast family fortune conditional on marrying well. Once mother comes ...","idIMDB":"tt1257193","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmMxZjNiMTAtMmE4Ni00ZjcwLThlMjUtNDg5YjNiZjFkYjQ0XkEyXkFqcGdeQXVyNTQxMTIxMTk@._V1_UX200_CR0,0,200,112_AL_.jpg"},{"episode":2,"title":"Episode #1.2","date":"6 Mar. 2009","plot":"Charming, generous Willoughby quickly wins the Dashwoods' trust and favor as Marianne's suitor. Asked for his intentions by rival Colonel Brandon, he coldly relies they're good and retorts. When Brandon is called away from a joint trip with the Middletons on Delaford estate, Willoughby takes over and shows her his grand family home Allenham, unchaperoned in the absence of his aunt, who neglects it. Then he reports that his aunt is sending him to London, indefinitely. Edwars Ferrars' long overdue, unexpected visit is warmly welcomed, but he's gloomy and leaves soon. ...","idIMDB":"tt1257194","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg4NjBlMmEtMzA4MS00YjlhLTkwZGItMjVhMGYxNTY5MTY3XkEyXkFqcGdeQXVyNTQxMTIxMTk@._V1_UX200_CR0,0,200,112_AL_.jpg"},{"episode":3,"title":"Episode #1.3","date":"6 Mar. 2009","plot":"Colonel Brandon wounds but spares Willoughby, who married heiress Grey, in a duel. Later Brandon explains that while he was in colonial India, the doc seduced his first love in England and abandoned here with a daughter, now fifteen. Elinor is heartbroken herself that Edward Ferrars is engaged to Miss Lucy Steele. His haughty mother disinherits him in favor of elder brother Edward after sister Anne betrays that engagement. But new turns of events bring both sisters unexpected fortune.","idIMDB":"tt1257195","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGMzNmYyMjItNDRhYy00OGY2LWExZTktOGFlYjc0ZmU1NzFhXkEyXkFqcGdeQXVyNTQxMTIxMTk@._V1_UX200_CR0,0,200,112_AL_.jpg"}]},{"yearSeason":2008,"episodes":[{"episode":1,"title":"Episode #1.1","date":"6 Mar. 2009","plot":"When Mr. Dashwood dies, he leaves his Sussex estate Norland -undivided, as the law requires- to his first marriage son John. John's wife, Fanny, convinces him to deny, in the name of their only son Henry's inheritance, his widowed stepmother and her three daughters the generosity understood at pap's deathbed. When the heiress-in-law's brother Edward Ferrars visits, he proves a perfect, understanding gentleman mutually drawn to eldest daughter Elinor, but she's told mother Ferrars makes inheriting the vast family fortune conditional on marrying well. Once mother comes ...","idIMDB":"tt1257193","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmMxZjNiMTAtMmE4Ni00ZjcwLThlMjUtNDg5YjNiZjFkYjQ0XkEyXkFqcGdeQXVyNTQxMTIxMTk@._V1_UX200_CR0,0,200,112_AL_.jpg"},{"episode":2,"title":"Episode #1.2","date":"6 Mar. 2009","plot":"Charming, generous Willoughby quickly wins the Dashwoods' trust and favor as Marianne's suitor. Asked for his intentions by rival Colonel Brandon, he coldly relies they're good and retorts. When Brandon is called away from a joint trip with the Middletons on Delaford estate, Willoughby takes over and shows her his grand family home Allenham, unchaperoned in the absence of his aunt, who neglects it. Then he reports that his aunt is sending him to London, indefinitely. Edwars Ferrars' long overdue, unexpected visit is warmly welcomed, but he's gloomy and leaves soon. ...","idIMDB":"tt1257194","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg4NjBlMmEtMzA4MS00YjlhLTkwZGItMjVhMGYxNTY5MTY3XkEyXkFqcGdeQXVyNTQxMTIxMTk@._V1_UX200_CR0,0,200,112_AL_.jpg"},{"episode":3,"title":"Episode #1.3","date":"6 Mar. 2009","plot":"Colonel Brandon wounds but spares Willoughby, who married heiress Grey, in a duel. Later Brandon explains that while he was in colonial India, the doc seduced his first love in England and abandoned here with a daughter, now fifteen. Elinor is heartbroken herself that Edward Ferrars is engaged to Miss Lucy Steele. His haughty mother disinherits him in favor of elder brother Edward after sister Anne betrays that engagement. But new turns of events bring both sisters unexpected fortune.","idIMDB":"tt1257195","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGMzNmYyMjItNDRhYy00OGY2LWExZTktOGFlYjc0ZmU1NzFhXkEyXkFqcGdeQXVyNTQxMTIxMTk@._V1_UX200_CR0,0,200,112_AL_.jpg"}]}],"idIMDB":"tt0847150","urlIMDB":"http://www.imdb.com/title/tt0847150","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["57 min (1 Episode)","58 min (1 Episode)","59 min (1 Episode)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":["Arriflex 416, Cooke S4 and Zeiss Lightweight Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["16 mm (Fuji Super F-64D 8622, Eterna 250D 8663, Eterna 500T 8673)"],"cinematographicProcess":["Super 16"],"printedFilmFormat":["Video (HDTV)"]},"rating":"8.1","filmingLocations":[{"location":"Berkshire, England, UK"}],"rated":"UNRATED","awards":[{"award":"Primetime Emmy Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Primetime Emmy","categories":[{"category":"Outstanding Cinematography for a Miniseries or Movie","names":[{"name":"Sean Bobbitt","id":"nm0090312","role":null}]},{"category":"Outstanding Music Composition for a Miniseries, Movie or a Special (Original Dramatic Score)","names":[{"name":"Martin Phipps","id":"nm0681040","role":null}]}]}]},{"award":"BAFTA Awards 2009","titlesAwards":[{"titleAwardOutcome":"Nominated BAFTA TV Award","categories":[{"category":"Best Original Television Music","names":[{"name":"Martin Phipps","id":"nm0681040","role":null}]}]}]},{"award":"Broadcasting Press Guild Awards 2009","titlesAwards":[{"titleAwardOutcome":"Nominated Writer's Award","categories":[{"category":"","names":[{"name":"Andrew Davies","id":"nm0203577","role":null},{"name":"Little Dorrit","id":"tt1178522","role":null}]}]}]},{"award":"Costume Designers Guild Awards 2009","titlesAwards":[{"titleAwardOutcome":"Nominated CDG Award","categories":[{"category":"Outstanding Made for Television Movie or Miniseries","names":[{"name":"Michele Clapton","id":"nm0163449","role":null}]}]}]},{"award":"Online Film & Television Association 2008","titlesAwards":[{"titleAwardOutcome":"Nominated OFTA Television Award","categories":[{"category":"Best Music in a Motion Picture or Miniseries","names":[]}]}]},{"award":"Shanghai International TV Festival 2008","titlesAwards":[{"titleAwardOutcome":"Won Magnolia Award","categories":[{"category":"Best Performance by an Actress in a Television Film","names":[{"name":"Hattie Morahan","id":"nm0602455","role":null}]},{"category":"Best Directing for a Television Film","names":[{"name":"John Alexander","id":"nm1019500","role":null}]}]},{"titleAwardOutcome":"Nominated Magnolia Award","categories":[{"category":"Best TV Film","names":[{"name":"John Alexander","id":"nm1019500","role":null}]}]}]}],"votes":"7,728","type":"TV Mini-Series","companyCreditsSimple":[{"idCompany":"co0043107","name":"British Broadcasting Corporation (BBC)"}],"keywords":{"keywords":["cottage","colonel","empire fashion","london england","jane austen","tv mini series","unrequited love","sword fighting","sister sister relationship","secret engagement","romanticism","rainstorm","poetry","piano","party","mother daughter relationship","military officer","love","love triangle","loss of father","illegitimate child","horse","half brother","georgian","england","duel","drawing","doctor","dancing","country life","class differences","britain","19th century"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 04:25:21"}}