{"data":{"movies":[{"title":"Marley & Me","originalTitle":"","year":"2008","releaseDate":"20081225","directors":[{"name":"David Frankel","id":"nm0291205"}],"writers":[{"name":"Scott Frank","id":"nm0291082"},{"name":"Don Roos","id":"nm0740400"}],"runtime":"115 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU1OTg1MTc3OV5BMl5BanBnXkFtZTcwMjI0OTc5MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama","Family"],"plot":"After their wedding, newspaper writers John and Jennifer Grogan move to Florida. In an attempt to stall Jennifer's \"biological clock\", John gives her a puppy. While the puppy Marley grows into a 100 pound dog, he loses none of his puppy energy or rambunctiousness. Meanwhile, Marley gains no self-discipline. Marley's antics give John rich material for his newspaper column. As the Grogans mature and have children of their own, Marley continues to test everyone's patience by acting like the world's most impulsive dog.","simplePlot":"A family learns important life lessons from their adorable, but naughty and neurotic dog.","actors":[{"actorName":"Owen Wilson","urlProfile":"http://www.imdb.com/name/nm0005562","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzQ4ODYxMV5BMl5BanBnXkFtZTcwNDAwMTc2NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1968","placeOfBirth":" Dallas, Texas, USA","birthName":"Owen Cunningham Wilson","height":"5' 10½\" (1.79 m)","bio":"Self-proclaimed troublemaker Owen Wilson was born in Dallas, to Irish-American parents originally from Massachusetts. He grew up in Texas with his mother, Laura (Cunningham), a photographer; his father, Robert Andrew Wilson, an ad exec; and his brothers, Andrew Wilson (the eldest) and Luke Wilson (the youngest). Expelled from St. Mark's School of Texas (Dallas, TX) in the tenth grade, Wilson finished his sophomore year at Thomas Jefferson School and then headed to a military academy in New Mexico. He then attended the University of Texas at Austin, where he met his future mentor and friend, Wes Anderson. They wrote a screenplay, Bottle Rocket (1996), and sent it to their family friend, screenwriter L.M. Kit Carson, who sent it to producer Polly Platt, who gave it to James L. Brooks, who gave the Texans $5 million dollars to make it into a feature film. Despite critical praise, Bottle Rocket (1996) only grossed one million dollars. After making the film, Wilson moved to Hollywood, setting up house with his two brothers and Anderson. Fairly quickly, Owen found himself acting in a series of big budget films, such as The Cable Guy (1996), Hantise (1999), Anaconda (1997) and Breakfast of Champions (1999). This led to more work, such as Shanghai Noon (2000), Meet the Parents (2000) and Behind Enemy Lines (2001). He's known not only for his nose, which has been broken several times, but also for his 'free wheeling ways' with a script. He co-wrote the film The Royal Tenenbaums (2001) with his oft partner Wes Anderson. He has been romantically linked with singer Sheryl Crow.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzQ4ODYxMV5BMl5BanBnXkFtZTcwNDAwMTc2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005562","name":"Owen Wilson","nicknames":["O"],"idIMDB":"nm0005562"},"actorId":"nm0005562","character":"John","urlCharacter":"http://www.imdb.com/character/ch0456827","main":true},{"actorName":"Jennifer Aniston","urlProfile":"http://www.imdb.com/name/nm0000098","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjk1MjIxNjUxNF5BMl5BanBnXkFtZTcwODk2NzM4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 February 1969","placeOfBirth":" Sherman Oaks, California, USA","birthName":"Jennifer Joanna Aniston","height":"5' 4½\" (1.64 m)","bio":"Jennifer Aniston was born in Sherman Oaks, California, to actors John Aniston and Nancy Dow. Her father is Greek, and her mother was of English, Irish, Scottish, and Italian descent. Jennifer spent a year of her childhood living in Greece with her family. Her family then relocated to New York City where her parents divorced when she was nine. Jennifer was raised by her mother and her father landed a role, as \"Victor Kiriakis\", on the daytime soap Days of Our Lives (1965). Jennifer had her first taste of acting at age 11 when she joined the Rudolf Steiner School's drama club. It was also at the Rudolf Steiner School that she developed her passion for art. She began her professional training as a drama student at New York's School of Performing Arts, aka the \"Fame\" school. It was a division of Fiorello H. LaGuardia High School of Music and the Arts. In 1987, after graduation, she appeared in such Off-Broadway productions as \"For Dear Life\" and \"Dancing on Checker's Grave\". In 1989, she landed her first television role, as a series regular on Molloy (1989). She also appeared in The Edge (1992), Ferris Bueller (1990), and had a recurring part on Herman's Head (1991). By 1993, she was floundering. Then, in 1994, a pilot called \"Friends Like These\" came along. Originally asked to audition for the role of \"Monica\", Aniston refused and auditioned for the role of \"Rachel Green\", the suburban princess turned coffee peddler. With the success of the series Friends (1994), Jennifer has become famous and sought-after as she turns her fame into movie roles during the series hiatus.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjk1MjIxNjUxNF5BMl5BanBnXkFtZTcwODk2NzM4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000098","name":"Jennifer Aniston","nicknames":["Jen","Jenny"],"idIMDB":"nm0000098"},"actorId":"nm0000098","character":"Jenny","urlCharacter":"http://www.imdb.com/character/ch0393613","main":true},{"actorName":"Eric Dane","urlProfile":"http://www.imdb.com/name/nm0199312","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NDE1ODczMV5BMl5BanBnXkFtZTcwMzE2MDU1Mw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 November 1972","placeOfBirth":" San Francisco, California, USA","birthName":"Eric William Dane","height":"6' 1\" (1.85 m)","bio":"Eric Dane is an American actor known as \"Dr. Mark Sloan\" on Grey's Anatomy (2005) and as a co-star in Marley & Me (2008) and Valentine's Day (2010). He was born on November 9, 1972, in San Francisco, California, the older of two brothers. His father is an architect and interior designer based in San Francisco. His mother, Leah (Cohn), was a homemaker. His ancestry includes English, German, Finnish, Russian Jewish, and Austrian Jewish, and Eric had a Bar Mitzvah ceremony. Young Eric was a good athlete in high school. There, he started amateur stage work by playing \"Joe Keller\" in Arthur Miller's \"All My Sons\", and realized that this was all he wanted to do. He moved to Los Angeles and made his television debut in 1993 on The Wonder Years (1988). In his early career, he also played bit parts on the TV series Married with Children (1987) (1995), Silk Stalkings (1991) (1996) and Roseanne (1988) (1996). Dane played medical doctors more than once, first appearing as a \"Dr. Cooper\" in Gideon's Crossing (2000). From 2003-2004, he has been a recurrent guest star as \"Jason Dean\" in the hit show Charmed (1998). In 2006, he appeared as handsome \"Dr. Mark Sloan\", the plastic surgeon on the show Grey's Anatomy (2005). Dane landed his first leading role on the big screen in the German-made feature, Open Water 2: Adrift (2006). On October 29, 2004, in Las Vegas, Eric Dane married actress Rebecca Gayheart, who was previously engaged to producer/director Brett Ratner, the director of X-Men: L'affrontement final (2006). In it, Dane plays the character of \"Jamie Madrox\", the Multiple Man. Dane and Gayheart became the parents of a girl on March 3, 2010 in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NDE1ODczMV5BMl5BanBnXkFtZTcwMzE2MDU1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0199312","name":"Eric Dane","nicknames":["Dr. McSteamy"],"idIMDB":"nm0199312"},"actorId":"nm0199312","character":"Sebastian","urlCharacter":"http://www.imdb.com/character/ch0121945","main":true},{"actorName":"Kathleen Turner","urlProfile":"http://www.imdb.com/name/nm0000678","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NTQxOTczNF5BMl5BanBnXkFtZTYwNTQ5NTc4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1954","placeOfBirth":" Springfield, Missouri, USA","birthName":"Mary Kathleen Turner","height":"5' 8\" (1.73 m)","bio":"Kathleen Turner was born June 19, 1954 in Springfield, Missouri, to Patsy (Magee) and Allen Richard Turner, a U.S. Foreign Service officer. She graduated from American School in London in 1972. After the death of her father, the Turner family moved back to the United States where Kathleen later enrolled at Missouri State University for two years, and earned her Bachelor of Fine Arts degree from the University of Maryland Baltimore County (UMBC) in 1977. Kathleen made her film debut in Body Heat (1981), her role as the relentless Matty Waker brought her astronomical success, and is remembered as one of the sexiest roles in film history. After her initial success, Kathleen continued to flourish with performances in The Man with Two Brains (1983), Romancing the Stone (1984), The Jewel of the Nile (1985), Prizzi's Honor (1985), Peggy Sue Got Married (1986), The War of the Roses (1989), and Serial Mom (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NTQxOTczNF5BMl5BanBnXkFtZTYwNTQ5NTc4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000678","name":"Kathleen Turner","idIMDB":"nm0000678"},"actorId":"nm0000678","character":"Ms. Kornblut","urlCharacter":"http://www.imdb.com/character/ch0146341","main":true},{"actorName":"Alan Arkin","urlProfile":"http://www.imdb.com/name/nm0000273","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDk5Njc3MF5BMl5BanBnXkFtZTYwNjc5NDc0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1934","placeOfBirth":" New York City, New York, USA","birthName":"Alan Wolf Arkin","height":"5' 9½\" (1.77 m)","bio":"Alan Arkin is an Academy Award-winning American actor who is also an acclaimed director, producer, author, singer and composer. He was born Alan Wolf Arkin on March 26, 1934, in Brooklyn, New York. His family were Jewish immigrants from Russia and Germany. In 1946 the Arkins moved from Brooklyn to Los Angeles, California. His father, David I. Arkin, was an artist and writer, who worked as a teacher, and lost his job for merely refusing to answer questions about his political affiliation during the 1950s Red Scare. His father challenged the politically biased dismissal and eventually prevailed, but unfortunately it was after his death. His mother, Beatrice (Wortis) Arkin, a teacher, shared his fathers views. Young Arkin was fond of music and acting, he was taking various acting classes from the age of 10. He attended Franklin High School, in Los Angeles, then Los Angeles City College from 1951 - 1953, and Bennington College in Vermont from 1953 - 1954. He sang in a college folk-band, and was involved in a drama class. He dropped out of college to form the folk music group The Tarriers, in which Arkin was the lead singer and played guitar. He co-wrote the 1956 hit \"The Banana Boat Song\" - a Jamaican calypso folk song, which became better known as Harry Belafonte's popular version, and reached #4 on the Billboard chart. At that time Arkin was a struggling young actor who played bit parts on television and on stage, and made a living as a delivery boy, repairman, pot washer and baby sitter. From 1958 - 1968 he performed and recorded with the children's folk group, The Babysitters. He has also recorded an entire album for the Elektra label titled \"Folksongs - Once Over Lightly.\" In 1957 Arkin made his first big screen appearance as a lead singer with The Tarriers in Calypso Heat Wave (1957). Then he made his Off-Broadway debut as a singer in \"Heloise\" (1958). Next year he joined the Compass Theatre in St. Louis, Missouri. There he caught the eye of stage director Bob Sills and became the original member of the \"Second City\" troupe in Chicago. In 1961 Arkin made his Broadway debut in musical \"From the Second City\", for which he wrote lyrics and sketches, then starred as David Kolowitz in the Broadway comedy \"Enter Laughing\" (1963), for which he won a Tony Award. He starred in a Broadway musical \"From the Second City production, then returned to Broadway as Harry Berlin in \"Luv\" (1964). Arkin made his directorial debut with an Off-Broadway hit called \"Eh?\" (1966), which introduced the young actor, named Dustin Hoffman. He won a Drama Desk Award for his direction of the Off-Broadway production of \"Little Murders\" (1969), and another Drama Desk Award for \"The White House Murder Case\" (1970). He also directed the original version of Neil Simon's hilarious smash, \"The Sunshine Boys\" (1972), which ran over 500 performances. Arkin earned his first Academy Award nomination as Best Actor for his feature acting debut in a comedy The Russians Are Coming! The Russians Are Coming! (1966), by director Norman Jewison, co-starring as Lt. Rozanov, a Soviet submariner who is mistaken for a spy after his boat accidentally wrecks aground in New England. Arkin demonstrated his dramatic range as the psychopathic killer Roat in suspense film Wait Until Dark (1967), opposite Audrey Hepburn. He reinvented himself as the sensitive deaf-mute in The Heart Is a Lonely Hunter (1968), for which he received his second Academy Award nomination as Best Actor in the Leading role. He followed with what remained his best known role as Captain Yossarian in Catch-22 (1970), directed by Mike Nichols and based on the eponymous anti-war novel by Joseph Heller. In it Arkin arguably gave his strongest performance, however, his career suffered because the film initially did not live up to expectations. After a few years of directorial work on television, Arkin made a comeback with an impressive portrayal of doctor Sigmund Freud in The Seven-Per-Cent Solution (1976). In the early 1980s he acted in three movies that were family affairs, written by his wife, Barbara Dana, and co-starring his son, Adam Arkin. During the 1990s he turned out several notable performances, such as a bitter former baseball player in TNT's Cooperstown (1993), and as a hilarious psychiatrist opposite John Cusack in Grosse Pointe Blank (1997). He won raves for his portrayal of a divorced father who struggles to keep his kids enrolled in the Beverly Hills school system in Slums of Beverly Hills (1998). Arkin gave a brilliant performance opposite Robin Williams in Jakob le menteur (1999), a film about the Nazi occupation of Poland. He also returned to the New York stage co-starring with his son, Tony Arkin and Elaine May in \"Power Plays\", which he also co-authored. His most recent comeback as a heroin-snorting, sex-crazed, foul-mouthed grandfather in Little Miss Sunshine (2006), earned him his third Academy Award nomination for Best Performance by an Actor in a Supporting Role, and his first Academy Award. Alan Arkin has been a modern Renaissance man. In addition to his achievements as an actor, director, and producer, he made his mark as a singer-songwriter with his popular-song compositions \"Banana Boat Song\", \"Cuddle Bug,\" \"That's Me,\" and \"Best Time of the Year.\" Arkin also authored several books, including science-fiction and some children's stories, such as \"The Clearing\", \"The Lemming Condition\" and \"Cassie Loves Beethoven\" among his other publications. He is a father of three sons, Adam, Matthew, and Tony, and a grandfather of Molly Arkin. Alan Arkin has been a strong supporter of an organic way of living and also a proponent for preservation of the environment and natural habitat. He has been avoiding the show-biz-milieu and is known as an actor who does not really care about prestigious awards, but values having a good job and being acknowledged by his peers. In Arkin's own words he wants to \"Stay home for three months. Living as quietly as humanly possible.\" Arkin was given an Indian name, Grey Wolf, by his Native American friends in New Mexico.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDk5Njc3MF5BMl5BanBnXkFtZTYwNjc5NDc0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000273","name":"Alan Arkin","nicknames":["The Tarriers"],"idIMDB":"nm0000273"},"actorId":"nm0000273","character":"Arnie Klein","urlCharacter":"http://www.imdb.com/character/ch0124027","main":true},{"actorName":"Nathan Gamble","urlProfile":"http://www.imdb.com/name/nm1997480","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NzI4MjgwMF5BMl5BanBnXkFtZTgwNzU0MjA1MjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 January 1998","placeOfBirth":" Tacoma, Washington, USA","height":"5' 4\" (1.63 m)","bio":"Nathan Gamble was born on January 12, 1998 in Tacoma, Washington, USA. He is an actor, known for The Dark Knight (2008), The Mist (2007) and Marley & Me (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NzI4MjgwMF5BMl5BanBnXkFtZTgwNzU0MjA1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1997480","name":"Nathan Gamble","idIMDB":"nm1997480"},"actorId":"nm1997480","character":"Patrick","urlCharacter":"http://www.imdb.com/character/ch0115834","main":true},{"actorName":"Haley Bennett","urlProfile":"http://www.imdb.com/name/nm2247245","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDUwOTgzNjM1NV5BMl5BanBnXkFtZTgwNDk4MzM2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1988","placeOfBirth":" Fort Myers, Florida, USA","birthName":"Haley Loraine Keeling","height":"5' 8\" (1.73 m)","bio":"Haley Bennett was born Haley Loraine Keeling in Fort Myers, Florida, to Leilani (Dorsey) Bennett and Ronald Keeling. She was raised in a small town in Ohio, and moved to Los Angeles following high school in 2006. Soon after, Haley was introduced to a small agency, KSA, who sent her on a casting call for the film Music and Lyrics (2007). Haley made her film debut as pop-diva \"Cora Corman,\" opposite Drew Barrymore and Hugh Grant. Since then, she has continued to pursue film, rather than music, but has taken on other musical roles in films such as Shekhar Kapur's Passage (2009) and Outlaw Country (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDUwOTgzNjM1NV5BMl5BanBnXkFtZTgwNDk4MzM2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2247245","name":"Haley Bennett","nicknames":["Halo","Hales"],"idIMDB":"nm2247245"},"actorId":"nm2247245","character":"Lisa","urlCharacter":"http://www.imdb.com/character/ch0124028","main":true},{"actorName":"Ann Dowd","urlProfile":"http://www.imdb.com/name/nm0235652","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMTc0NzA0OV5BMl5BanBnXkFtZTcwMDIwMjk4OA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 January 1956","placeOfBirth":" Holyoke, Massachusetts, USA","bio":"Ann Dowd was born on January 30, 1956 in Holyoke, Massachusetts, USA. She is an actress, known for Compliance (2012), Side Effects (2013) and Marley & Me (2008). She has been married to Lawrence Arancio since 1984. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMTc0NzA0OV5BMl5BanBnXkFtZTcwMDIwMjk4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0235652","name":"Ann Dowd","idIMDB":"nm0235652"},"actorId":"nm0235652","character":"Dr. Platt","urlCharacter":"http://www.imdb.com/character/ch0146342","main":true},{"actorName":"Clarke Peters","urlProfile":"http://www.imdb.com/name/nm0676370","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2ODgwNDAxNF5BMl5BanBnXkFtZTcwNDc1MzMwNQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 April 1952","placeOfBirth":" New York City, New York, USA","birthName":"Peter Clarke","bio":"Clarke Peters was born on April 7, 1952 in New York City, New York, USA as Peter Clarke. He is an actor, known for The Wire (2002), Notting Hill (1999) and Marley & Me (2008). He is married to Penny. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2ODgwNDAxNF5BMl5BanBnXkFtZTcwNDc1MzMwNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0676370","name":"Clarke Peters","idIMDB":"nm0676370"},"actorId":"nm0676370","character":"Editor","urlCharacter":"http://www.imdb.com/character/ch0339619","main":true},{"actorName":"Finley Jacobsen","urlProfile":"http://www.imdb.com/name/nm3124890","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNzA2NDgzOF5BMl5BanBnXkFtZTcwMjU1NDcyOQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Finley Jacobsen is an actor, known for Olympus Has Fallen (2013), Marley & Me (2008) and Marmaduke (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNzA2NDgzOF5BMl5BanBnXkFtZTcwMjU1NDcyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3124890","name":"Finley Jacobsen","idIMDB":"nm3124890"},"actorId":"nm3124890","character":"Conor","urlCharacter":"http://www.imdb.com/character/ch0115835","main":true},{"actorName":"Lucy Merriam","urlProfile":"http://www.imdb.com/name/nm2519931","urlPhoto":"","biography":{"dateOfBirth":"13 July 2002","placeOfBirth":" New York City, New York, USA","bio":"Lucy Merriam was born on July 13, 2002 in New York City, New York, USA. She is an actress, known for Marley & Me (2008) and All My Children (1970).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2519931","name":"Lucy Merriam","idIMDB":"nm2519931"},"actorId":"nm2519931","character":"Colleen","urlCharacter":"http://www.imdb.com/character/ch0131950","main":true},{"actorName":"Bryce Robinson","urlProfile":"http://www.imdb.com/name/nm2258865","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE1OTYwODMyMF5BMl5BanBnXkFtZTgwNTQ3ODQyNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 December 1999","placeOfBirth":" Albuquerque, New Mexico, USA","height":"5' 8\" (1.73 m)","bio":"Bryce Robinson was born on December 16, 1999 in Albuquerque, New Mexico, USA. He is an actor, known for Marley & Me (2008), Valentine's Day (2010) and The Switch (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE1OTYwODMyMF5BMl5BanBnXkFtZTgwNTQ3ODQyNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2258865","name":"Bryce Robinson","idIMDB":"nm2258865"},"actorId":"nm2258865","character":"Patrick","urlCharacter":"http://www.imdb.com/character/ch0115834","main":true},{"actorName":"Ben Hyland","urlProfile":"http://www.imdb.com/name/nm3455970","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNTM1NzE0MV5BMl5BanBnXkFtZTgwNjEzMjU4NjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"birthName":"Benjamin Hyland","height":"5' 1\" (1.55 m)","bio":"Ben Hyland was born in Long Island, New York, USA as Benjamin Hyland. He is an actor, known for Marley & Me (2008), Somebody's Hero (2011) and The Strain (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNTM1NzE0MV5BMl5BanBnXkFtZTgwNjEzMjU4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3455970","name":"Ben Hyland","idIMDB":"nm3455970"},"actorId":"nm3455970","character":"Conor","urlCharacter":"http://www.imdb.com/character/ch0115835","main":true},{"actorName":"Sarah O'Kelly","urlProfile":"http://www.imdb.com/name/nm2328843","urlPhoto":"","biography":{"height":"5' 7\" (1.7 m)","bio":"Sarah O'Kelly is an actress, known for Marley & Me (2008), Immigration Tango (2010) and Centurion AD (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MTI0MDA5NV5BMl5BanBnXkFtZTcwNjg1NDM3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2328843","name":"Sarah O'Kelly","idIMDB":"nm2328843"},"actorId":"nm2328843","character":"Neighbor Mom","urlCharacter":"http://www.imdb.com/character/ch0339648","main":true},{"actorName":"Keith Hudson","urlProfile":"http://www.imdb.com/name/nm0399888","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDk3MjgyYjAtZTg2Mi00OTFlLTliYWQtMTIzMmFkNDMwNDdjXkEyXkFqcGdeQXVyMzg5NjEwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Keith Hudson is a native Floridian that booked his first professional acting job in High School. He is a two-year graduate of the Baron/Brown Studio in Los Angeles, California and studied Shakespeare at the British American Drama Academy at Balliol College in Oxford, England. Hudson has worked as a Professional Actor in numerous feature films, television shows, commercials, theater, voice overs, print, and as a professional spokesperson. He has been cast by directors, Edgar Wright, Steven Soderbergh, David Frankel, Rod Lurie, Eric Stolz, Susan Siedleman, and Michael Bay. Keith has shared scenes with actors Daniel Craig, George Clooney, Jon Hamm, Jim Carrey, Matt Dillon, Bruce Campbell, and Owen Wilson. Keith was the Kool Aid man for a series of national commercials and worked as a professional spokesman for Guiness Stout.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDk3MjgyYjAtZTg2Mi00OTFlLTliYWQtMTIzMmFkNDMwNDdjXkEyXkFqcGdeQXVyMzg5NjEwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0399888","name":"Keith Hudson","idIMDB":"nm0399888"},"actorId":"nm0399888","character":"Big Guy","urlCharacter":"http://www.imdb.com/character/ch0339622","main":true}],"seasons":[],"idIMDB":"tt0822832","urlIMDB":"http://www.imdb.com/title/tt0822832","business":{"budget":{"money":"$60,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$36,367,586","country":"USA","day":"28","month":"12","year":"2008","remarks":"3,480 Screens"},{"money":"£4,414,169","country":"UK","day":"15","month":"03","year":"2009","remarks":"467 Screens"},{"money":"BRL 2,604,880","country":"Brazil","day":"28","month":"12","year":"2008","remarks":"182 Screens"},{"money":"$30,516","country":"Estonia","day":"15","month":"03","year":"2009","remarks":"4 Screens"},{"money":"PHP 6,010,923","country":"Philippines","day":"08","month":"02","year":"2009","remarks":"34 Screens"}],"gross":[{"money":"$143,153,751","country":"USA","day":"30","month":"04","year":"2009","remarks":""},{"money":"$143,151,473","country":"USA","day":"26","month":"04","year":"2009","remarks":""},{"money":"$143,143,620","country":"USA","day":"19","month":"04","year":"2009","remarks":""},{"money":"$143,125,707","country":"USA","day":"12","month":"04","year":"2009","remarks":""},{"money":"$143,084,510","country":"USA","day":"05","month":"04","year":"2009","remarks":""},{"money":"$142,992,475","country":"USA","day":"29","month":"03","year":"2009","remarks":""},{"money":"$142,829,513","country":"USA","day":"22","month":"03","year":"2009","remarks":""},{"money":"$142,611,757","country":"USA","day":"15","month":"03","year":"2009","remarks":""},{"money":"$142,342,915","country":"USA","day":"08","month":"03","year":"2009","remarks":""},{"money":"$141,981,387","country":"USA","day":"01","month":"03","year":"2009","remarks":""},{"money":"$141,545,861","country":"USA","day":"22","month":"02","year":"2009","remarks":""},{"money":"$141,140,778","country":"USA","day":"15","month":"02","year":"2009","remarks":""},{"money":"$140,548,943","country":"USA","day":"08","month":"02","year":"2009","remarks":""},{"money":"$139,793,037","country":"USA","day":"01","month":"02","year":"2009","remarks":""},{"money":"$138,092,165","country":"USA","day":"25","month":"01","year":"2009","remarks":""},{"money":"$133,923,935","country":"USA","day":"18","month":"01","year":"2009","remarks":""},{"money":"$123,751,596","country":"USA","day":"11","month":"01","year":"2009","remarks":""},{"money":"$106,664,046","country":"USA","day":"04","month":"01","year":"2009","remarks":""},{"money":"$50,748,566","country":"USA","day":"28","month":"12","year":"2008","remarks":""},{"money":"£15,123,080","country":"UK","day":"26","month":"04","year":"2009","remarks":""},{"money":"£14,912,767","country":"UK","day":"19","month":"04","year":"2009","remarks":""},{"money":"£14,136,539","country":"UK","day":"12","month":"04","year":"2009","remarks":""},{"money":"£12,354,340","country":"UK","day":"05","month":"04","year":"2009","remarks":""},{"money":"£10,861,248","country":"UK","day":"29","month":"03","year":"2009","remarks":""},{"money":"£8,164,343","country":"UK","day":"22","month":"03","year":"2009","remarks":""},{"money":"£4,414,169","country":"UK","day":"15","month":"03","year":"2009","remarks":""},{"money":"$244,082,376","country":"Worldwide","day":"03","month":"05","year":"2009","remarks":""},{"money":"$100,928,625","country":"Non-USA","day":"03","month":"05","year":"2009","remarks":""},{"money":"BRL 11,088,467","country":"Brazil","day":"18","month":"01","year":"2009","remarks":""},{"money":"BRL 9,224,901","country":"Brazil","day":"11","month":"01","year":"2009","remarks":""},{"money":"BRL 6,593,882","country":"Brazil","day":"04","month":"01","year":"2009","remarks":""},{"money":"BRL 3,249,062","country":"Brazil","day":"28","month":"12","year":"2008","remarks":""},{"money":"PHP 11,348,132","country":"Philippines","day":"22","month":"02","year":"2009","remarks":""},{"money":"PHP 10,055,936","country":"Philippines","day":"15","month":"02","year":"2009","remarks":""},{"money":"PHP 6,010,923","country":"Philippines","day":"08","month":"02","year":"2009","remarks":""}],"weekendGross":[{"money":"$5,113","country":"USA","day":"26","month":"04","year":"2009","remarks":"15 Screens"},{"money":"$6,679","country":"USA","day":"19","month":"04","year":"2009","remarks":"21 Screens"},{"money":"$20,231","country":"USA","day":"12","month":"04","year":"2009","remarks":"48 Screens"},{"money":"$57,249","country":"USA","day":"05","month":"04","year":"2009","remarks":"89 Screens"},{"money":"$98,123","country":"USA","day":"29","month":"03","year":"2009","remarks":"129 Screens"},{"money":"$139,211","country":"USA","day":"22","month":"03","year":"2009","remarks":"190 Screens"},{"money":"$192,222","country":"USA","day":"15","month":"03","year":"2009","remarks":"222 Screens"},{"money":"$257,510","country":"USA","day":"08","month":"03","year":"2009","remarks":"297 Screens"},{"money":"$345,086","country":"USA","day":"01","month":"03","year":"2009","remarks":"314 Screens"},{"money":"$320,987","country":"USA","day":"22","month":"02","year":"2009","remarks":"304 Screens"},{"money":"$472,457","country":"USA","day":"15","month":"02","year":"2009","remarks":"334 Screens"},{"money":"$455,301","country":"USA","day":"08","month":"02","year":"2009","remarks":"450 Screens"},{"money":"$960,224","country":"USA","day":"01","month":"02","year":"2009","remarks":"1,022 Screens"},{"money":"$3,031,969","country":"USA","day":"25","month":"01","year":"2009","remarks":"2,036 Screens"},{"money":"$6,138,859","country":"USA","day":"18","month":"01","year":"2009","remarks":"2,952 Screens"},{"money":"$11,391,425","country":"USA","day":"11","month":"01","year":"2009","remarks":"3,478 Screens"},{"money":"$24,263,763","country":"USA","day":"04","month":"01","year":"2009","remarks":"3,505 Screens"},{"money":"$36,367,586","country":"USA","day":"28","month":"12","year":"2008","remarks":"3,480 Screens"},{"money":"£125,859","country":"UK","day":"26","month":"04","year":"2009","remarks":"297 Screens"},{"money":"£304,433","country":"UK","day":"19","month":"04","year":"2009","remarks":"374 Screens"},{"money":"£470,127","country":"UK","day":"12","month":"04","year":"2009","remarks":"402 Screens"},{"money":"£822,367","country":"UK","day":"05","month":"04","year":"2009","remarks":"433 Screens"},{"money":"£1,680,143","country":"UK","day":"29","month":"03","year":"2009","remarks":"484 Screens"},{"money":"£2,166,270","country":"UK","day":"22","month":"03","year":"2009","remarks":"476 Screens"},{"money":"£4,414,169","country":"UK","day":"15","month":"03","year":"2009","remarks":"467 Screens"},{"money":"BRL 920,030","country":"Brazil","day":"18","month":"01","year":"2009","remarks":"169 Screens"},{"money":"BRL 1,178,462","country":"Brazil","day":"11","month":"01","year":"2009","remarks":"172 Screens"},{"money":"BRL 2,048,128","country":"Brazil","day":"04","month":"01","year":"2009","remarks":"180 Screens"},{"money":"BRL 2,604,880","country":"Brazil","day":"28","month":"12","year":"2008","remarks":"182 Screens"},{"money":"PHP 551,388","country":"Philippines","day":"22","month":"02","year":"2009","remarks":"12 Screens"},{"money":"PHP 2,897,138","country":"Philippines","day":"15","month":"02","year":"2009","remarks":"29 Screens"},{"money":"PHP 6,010,923","country":"Philippines","day":"08","month":"02","year":"2009","remarks":"34 Screens"}],"admissions":[{"money":"1,199,844","country":"Brazil","day":"18","month":"01","year":"2009","remarks":""},{"money":"981,926","country":"Brazil","day":"11","month":"01","year":"2009","remarks":""},{"money":"670,412","country":"Brazil","day":"04","month":"01","year":"2009","remarks":""},{"money":"317,308","country":"Brazil","day":"28","month":"12","year":"2008","remarks":""},{"money":"180,450","country":"Netherlands","day":"31","month":"12","year":"2009","remarks":""}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"Twentieth Century Fox Film Corporation, Regency Entertainment (USA), Inc. and Dune Entertainment III LLC in the U.S. only; Twentieth Century Fox Film Corporation, Monarchy Enterprises S.a.r.l. and Dune Entertainment III LLC in all other territories except Brazil, Italy, Japan, Korea and Spain; TCF Hungary Film Right Exploitation Limited Liability Company, Twentieth Century Fox Film Corporation, Monarchy Enterprises S.a.r.l. and Dune Entertainment III LLC in Brazil, Italy, Japan, Korea and Spain"},"technical":{"runtime":["1 hr 55 min (115 min) (USA)"],"soundMix":["DTS","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arricam LT, Zeiss Ultra Prime and Angenieux Optimo Lenses","Arricam ST, Zeiss Ultra Prime and Angenieux Optimo Lenses","Arriflex 435, Zeiss Ultra Prime and Angenieux Optimo Lenses"],"laboratory":["Cineworks Digital Studios, Miami (FL), USA","DeLuxe, Hollywood (CA), USA","DeLuxe, New York (NY), USA (digital intermediate)"],"filmLength":["3,154 m (Portugal, 35 mm)","3,155 m (Sweden)"],"negativeFormat":["35 mm (Kodak Vision3 500T 5219)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)","D-Cinema"]},"rating":"7.1","metascore":"53","filmingLocations":[{"location":"Fort Lauderdale, Florida, USA"}],"rated":"PG","awards":[{"award":"BMI Film & TV Awards 2009","titlesAwards":[{"titleAwardOutcome":"Won BMI Film Music Award","categories":[{"category":"","names":[{"name":"Theodore Shapiro","id":"nm0788640","role":null}]}]}]},{"award":"Kids' Choice Awards, USA 2009","titlesAwards":[{"titleAwardOutcome":"Nominated Blimp Award","categories":[{"category":"Favorite Movie Actress","names":[{"name":"Jennifer Aniston","id":"nm0000098","role":null}]}]}]},{"award":"Teen Choice Awards 2009","titlesAwards":[{"titleAwardOutcome":"Won Teen Choice Award","categories":[{"category":"Choice Movie: Bromantic Comedy","names":[]}]},{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie Actress: Comedy","names":[{"name":"Jennifer Aniston","id":"nm0000098","role":null},{"name":"He's Just Not That Into You","id":"tt1001508","role":null}]},{"category":"Choice Movie Liplock","names":[{"name":"Owen Wilson","id":"nm0005562","role":null},{"name":"Clyde","id":"nm1271500","role":null}]}]}]},{"award":"Young Artist Awards 2009","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Performance in a Feature Film - Supporting Young Actor","names":[{"name":"Nathan Gamble","id":"nm1997480","role":null}]}]}]}],"votes":"121,757","type":"Movie","companyCreditsSimple":[{"idCompany":"co0017497","name":"Fox 2000 Pictures"},{"idCompany":"co0021592","name":"Regency Enterprises"},{"idCompany":"co0226011","name":"Sunswept Entertainment"}],"keywords":{"keywords":["dog","florida","dog movie","pet name in title","dog running on beach","dog swimming in ocean","labrador retriever","pet funeral","heavily pregnant mother","garage","south florida","quitting a job","pet owner relationship","pet as a gift","loss of pet","journalist","dog as a gift","dissatisfaction","death of pet","death of title character","punctuation in title","ampersand in title","happy birthday to you","ultrasound","trying to get pregnant","swimming pool","pregnancy test","positive pregnancy test","pet sitter","pennsylvania","obedience training","newspaper reporter","newspaper editor","newspaper columnist","newlywed couple","miscarriage","ireland","hungry dog","dog humping someone's leg","death of dog","beach","frat pack","based on true story","based on book","actor shares first name with character","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 05:02:55"}}