{"data":{"movies":[{"title":"Babylon 5: The Lost Tales","originalTitle":"","year":"2007","releaseDate":"20070731","directors":[{"name":"J. Michael Straczynski","id":"nm0833089"},{"name":"Sara Barnes","id":"nm0055771"}],"writers":[{"name":"J. Michael Straczynski","id":"nm0833089"},{"name":"J. Michael Straczynski","id":"nm0833089"}],"runtime":"75 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTAwMTYyMTM0NV5BMl5BanBnXkFtZTcwMDQ2Njc0MQ@@._V1.jpg","countries":["USA","Canada"],"languages":["English"],"genres":["Action","Adventure","Sci-Fi"],"plot":"It's the tenth anniversary of the Interstellar Alliance, and President Sheridan is on his way to Babylon 5 for the celebration.","simplePlot":"It's the tenth anniversary of the Interstellar Alliance, and President Sheridan is on his way to Babylon 5 for the celebration.","actors":[{"actorName":"Bruce Boxleitner","urlProfile":"http://www.imdb.com/name/nm0000310","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MTc5OTQ0M15BMl5BanBnXkFtZTcwMjY1Mjg4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1950","placeOfBirth":" Elgin, Illinois, USA","birthName":"Bruce William Boxleitner","height":"6' 2\" (1.88 m)","bio":"As one of Hollywood's leading men, Bruce Boxleitner has starred in a major motion picture franchise, numerous feature films, several popular television series, produced a major network film and TV series, performed on Broadway, and authored two science fiction novels. Boxleitner received his formal acting training on stage. A native mid-westerner, he is an alumnus of Chicago's prestigious Goodman Theatre. In 1972, he starred in the Broadway production of Status Quo Vadis with Ted Danson. He then relocated to Los Angeles and quickly landed a guest spot on the legendary TV series The Mary Tyler Moore Show as well as numerous guest roles on series, including Hawaii 5-0, Beretta, Police Woman, and Gunsmoke. Boxleitner's big break occurred when he was cast opposite James Arness in the pilot for the epic TV series How the West Was Won. He went on to star in the CBS series Bring 'em Back Alive; mini-series East of Eden; and TV movie The Last Convertible. In 1982, Boxleitner was cast as the title role in Disney's cult film TRON which garnered him science fiction fans worldwide. However, it was in Boxleitner's four-year run for CBS's 'Scarecrow and Mrs. King', starring opposite Kate Jackson, which endeared him to fans everywhere and made him a household name. In 1994, Boxleitner joined the cast of the popular TV series Babylon 5 as John Sheridan, President of the Interstellar Alliance, a war hero-turned-diplomat at the helm of Earth Alliance Space Station in the year 2259. The show aired for five seasons. Boxleitner most recently starred with Jeff Bridges in TRON: Legacy, the popular motion picture sequel to TRON. The cast includes Garrett Hedlund and Olivia Wilde. In addition, Boxleitner reprised his role in TRON: Uprising on Disney's XD TV network, his first animated TV series. The multi-talented cast includes Elijah Wood, Mandy Moore, Lance Henriksen, and Paul Reubens. The original TRON recently celebrated its 30th anniversary. Several motion pictures include Gods and Generals with Robert Duvall, Jeff Daniels, Stephen Lang and Mira Sorvino; The Babe with John Goodman and Kelly McGillis; Kuffs with Christian Slater; and The Baltimore Bullet with James Coburn. Numerous TV movie credits include The Secret with Kirk Douglas; Perfect Family with Jennifer O'Neal and Joanna Cassidy; Double Jeopardy with Rachel Ward, Sally Kirkland and Sela Ward; Passion Flower with Barbara Hershey and Nicol Williamson; and Hallmark Channel movies, 'Love's Resounding Courage' and 'Falling in Love with the Girl Next Door'; among many others. The veteran actor has appeared in numerous recurring roles on TV series including GCB and Heroes, and has guest-starred on NCIS and Chuck, among others. A skilled horseman, Boxleitner utilized his talents in numerous Western TV series and films including Kenny Rogers television movie series that aired on CBS and NBC, starring opposite Kenny Rogers; 'Gunsmoke V: One Man's Justice' with James Arness (Arness' final film); CBS' remake of Red River with Gregory Harrison, James Arness and Laura Johnson; 'Wyatt Earp: Return to Tombstone' with Hugh O'Brian; and Down the Long Hills, based on legendary western author Louis L'Amour's novel of the same name. Boxleitner was inducted into the Hall of Great Western Performers at the National Cowboy and Western Heritage Museum in Oklahoma City in April 2012 honoring him for his illustrious career in western films. He is a two-time recipient of the Wrangler Award. In 2013, Boxleitner co-starred with Andie MacDowell and Dylan Neal in Hallmark Channel's first-ever prime-time series, Debbie Macomber's Cedar Cove to rave reviews and an average of 2 million viewers. The #1 rated cable program was renewed for a third season and is scheduled to premiere in the summer of 2015. In 1999, Boxleitner authored \"Frontier Earth\" and in 2001, its sequel \"Frontier Earth: Searcher\", published by The Berkley Publishing Group. Bruce Boxleitner resides in Los Angeles with his wife, publicist Verena King, and has three sons: Sam, Lee and Michael.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MTc5OTQ0M15BMl5BanBnXkFtZTcwMjY1Mjg4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000310","name":"Bruce Boxleitner","idIMDB":"nm0000310"},"actorId":"nm0000310","character":"John Sheridan","urlCharacter":"http://www.imdb.com/character/ch0012565","main":true},{"actorName":"Tracy Scoggins","urlProfile":"http://www.imdb.com/name/nm0001712","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNDQ2MTQ3OV5BMl5BanBnXkFtZTgwMjcyMDQzOTE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1953","placeOfBirth":" Galveston, Texas, USA","birthName":"Tracy Dawn Scoggins","height":"5' 8\" (1.73 m)","bio":"Tracy Dawn Scoggins was born and raised in Dickinson, Texas. At age 16, she enrolled in Southwest Texas State, where she studied speech communications and physical education. After leaving college, she was hired by the Elite Modeling Agency and sent to New York City. After one year, she continued her modeling career with assignments in Italy, France and Germany. Later, she decided to return to the United States to study acting. She attended the Wynn Handman Studio and the Herbert Berghof Studio -- both well-known acting schools. After completing her training, she moved to Hollywood where she has become internationally known as a television and movie star. Today, she resides in Los Angeles, California and spends her free time developing workout videos, cycle riding, swimming and jogging.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNDQ2MTQ3OV5BMl5BanBnXkFtZTgwMjcyMDQzOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001712","name":"Tracy Scoggins","idIMDB":"nm0001712"},"actorId":"nm0001712","character":"Colonel Elizabeth Lochley","urlCharacter":"http://www.imdb.com/character/ch0012567","main":true},{"actorName":"Peter Woodward","urlProfile":"http://www.imdb.com/name/nm0940974","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExODUyNzAyMjheQTJeQWpwZ15BbWU3MDc5MTAxMjg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 January 1956","placeOfBirth":" London, England, UK","bio":"Peter Woodward was born into a family of actors. His father, Edward Woodward, brother Tim Woodward and sister Sarah Woodward, are all well-known British actors. Peter graduated from the Royal Academy of Dramatic Art (RADA) and then joined the Royal Shakespeare Company, starring in many of their productions including \"Winter's Tale\", \"Comedy of Errors\" and \"A Midsummer Night's Dream\". Peter has also played a wide range of major character roles in films and television including the role of the German \"Captain Stossel\" in the feature film The Brylcreem Boys (1998). As a member of the British Academy of Dramatic Combat, Peter is known in the film industry for his work as a Fight Arranger and also as a post production supervisor, writing the ADR dialogue for films including: 1492: Christophe Colomb (1992), 20,000 Leagues Under the Sea (1997), The Scarlet Tunic (1998), Les Misérables (1998) and Ossessione fatale (1991). Branching out, Peter recently formed a production company, \"TRIPAL PRODUCTIONS\", with his father Edward Woodward, and, for this company, Peter wrote and produced his first feature film The House of Angelo (1997), with his father, Edward, in the starring role as \"Angleo\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExODUyNzAyMjheQTJeQWpwZ15BbWU3MDc5MTAxMjg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0940974","name":"Peter Woodward","idIMDB":"nm0940974"},"actorId":"nm0940974","character":"Galen","urlCharacter":"http://www.imdb.com/character/ch0027076","main":true},{"actorName":"Alan Scarfe","urlProfile":"http://www.imdb.com/name/nm0769154","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1OTQ5NzI3NV5BMl5BanBnXkFtZTcwMzQzNzAzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 June 1946","placeOfBirth":" London, England, UK","height":"5' 10¾\" (1.8 m)","bio":"Alan Scarfe was born on June 8, 1946 in London, England. He is an actor, known for One Life to Live (1968), Lethal Weapon 3 (1992) and Seven Days (1998). He has been married to Barbara March since 1979. They have one child. He was previously married to Sara Botsford.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1OTQ5NzI3NV5BMl5BanBnXkFtZTcwMzQzNzAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0769154","name":"Alan Scarfe","idIMDB":"nm0769154"},"actorId":"nm0769154","character":"Father Cassidy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bruce Ramsay","urlProfile":"http://www.imdb.com/name/nm0708873","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NjM3NTgyOF5BMl5BanBnXkFtZTgwMTM1MDM0NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1966","placeOfBirth":" Montreal, Quebec, Canada","height":"5' 8\" (1.73 m)","bio":"Born and raised in Montreal, Ramsay's screen debut was opposite fellow Montrealer Elias Koteas in the film Malarek (1988). Ramsay and Koteas went on to appear in two other films together, Hit Me (1996), and Collateral Damage (2002). Ramsay's first lead in a major motion picture came when he was cast as Carlitos Paez in director Frank Marshall's film Alive (1993), the biographical survival drama based upon Piers Paul Read's 1974 book Alive: The Story of the Andes Survivors, which detailed the story of the Uruguayan rugby team that crashed into the Andes mountains. In 2011 Ramsay made his directorial debut with Hamlet (2011). Ramsay also produced, wrote the adaptation, and starred as Hamlet. Hamlet (2011) premiered in competition at the Vancouver Film Festival in 2012. More recently, Ramsay appeared as the jaded house boy Carlucci opposite Michael Douglas and Matt Damon in Behind the Candelabra (2013), directed by Steven Soderbergh about the last ten years in the life of pianist Liberace. Behind the Candelabra marked the second time that Ramsay had worked with Soderbergh. In 1995 Ramsay appeared in The Professional Man, part of The Showtime film noir series, Fallen Angels, starring opposite Peter Coyote, and Brendan Fraser.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NjM3NTgyOF5BMl5BanBnXkFtZTgwMTM1MDM0NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0708873","name":"Bruce Ramsay","nicknames":["Buck"],"idIMDB":"nm0708873"},"actorId":"nm0708873","character":"Simon Burke","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Teryl Rothery","urlProfile":"http://www.imdb.com/name/nm0745186","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg3MzYzNjE0Ml5BMl5BanBnXkFtZTcwNjU5NDMxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 November 1962","placeOfBirth":" Vancouver, British Columbia, Canada","height":"5' 2\" (1.57 m)","bio":"A Vancouver, British Columbia, native, Teryl Rothery always knew she wanted to be an entertainer. She began her career as a dancer at age thirteen when she performed in her first musical, \"Bye Bye Birdie\". Her role in \"Annie Get Your Gun\" earned her a Most Outstanding Performer award with her theater company. Teryl has been working in TV & Movie industry for many years and has most recently seen success in the hit show Stargate SG-1 (1997). Over the years, Teryl has appeared on Au-delà du réel - l'aventure continue (1995), The X-Files (1993), First Wave (1998) and movies such as Masterminds (1997) with Patrick Stewart, Mr. Rice's Secret (2000) with David Bowie. When not working, Teryl enjoys walking, riding and roller blading. Teryl Rothery's feature film credits include Urban Safari (1996), Andre (1994) and The Surgeon (1995). She has appeared in the television movies Who Killed My Daughter (1995), Deceived by Trust: A Moment of Truth Movie (1995), She Stood Alone: The Tailhook Scandal (1995), For the Love of Nancy (1994) and The Man Who Wouldn't Die (1994) and has guest-starred on The X-Files (1993), L'as de la crime (1991), Robin's Hoods (1994), M.A.N.T.I.S. (1994) and Cobra (1993). Teryl has used her voice talents on many cartoon series including Exosquad (1993) and Ranma 1/2. On Stargate SG-1 (1997), Teryl plays the part of \"Dr. Janet Fraiser,\" Medical Officer for the Cheyenne Mountain Facility. Dr. Fraiser's skill and compassion enable her to face the most peculiar cases brought to her by SG-1 and all the other SG teams.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg3MzYzNjE0Ml5BMl5BanBnXkFtZTcwNjU5NDMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0745186","name":"Teryl Rothery","nicknames":["Turtle","Terlene","The Ever Ready Bunny"],"idIMDB":"nm0745186"},"actorId":"nm0745186","character":"ISN reporter Ms. Chambers","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Keegan MacIntosh","urlProfile":"http://www.imdb.com/name/nm0532857","urlPhoto":"","biography":{"dateOfBirth":"2 June 1984","placeOfBirth":" British Columbia, Canada","bio":"Keegan MacIntosh was born on June 2, 1984 in British Columbia, Canada. He is an actor, known for Legends of the Fall (1994), Henry & Verlin (1996) and Intersection (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0532857","name":"Keegan MacIntosh","idIMDB":"nm0532857"},"actorId":"nm0532857","character":"Prince Regent Dius Vintari","urlCharacter":"http://www.imdb.com/character/ch0204393","main":true},{"actorName":"Craig Veroni","urlProfile":"http://www.imdb.com/name/nm0998268","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0NzQ4MjUyM15BMl5BanBnXkFtZTgwMzkwMDYwMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Craig Ian Veroni","height":"5' 10\" (1.78 m)","bio":"Craig was trained at the prestigious Studio 58 Theater School in Vancouver, Canada and has been a working professional for the past fourteen years. He has worked extensively in Film, Television, Radio, Theater, Animation and Commercials. Born in Cape Town, South Africa he emigrated to Canada with his family at the age of eight. They lived briefly in Toronto before moving to Vancouver, which has been home for Craig ever since. Growing up Craig was quite an athlete. He was a competitive swimmer and gymnast as well as competing in wrestling, volleyball and soccer in high school. He graduated high school from Port Moody Senior Secondary where his passion for acting began. He is also a Real Estate Specialist in Vancouver BC and licensed Real Estate Agent with Re/Max Masters Realty. Some hobbies and activities of his include keeping fit, swimming, hiking, kayaking, rock climbing, scuba diving, cycling, photography, travel and cooking.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0NzQ4MjUyM15BMl5BanBnXkFtZTgwMzkwMDYwMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0998268","name":"Craig Veroni","idIMDB":"nm0998268"},"actorId":"nm0998268","character":"Guard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Biggs","urlProfile":"http://www.imdb.com/name/nm0081863","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1Nzg1MTE5OTleQTJeQWpwZ15BbWU4MDM1OTg0NTIx._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 March 1960","placeOfBirth":" Columbus, Ohio, USA","birthName":"Richard T. Biggs","height":"5' 10\" (1.78 m)","bio":"Richard Biggs had a somewhat unsettled childhood as he travelled between Air Force bases where his father was stationed. Because of his itinerant lifestyle he made few friends and changed schools often. When he was seventeen, and living at a missile base in North Dakota, he decided to change his plans for a medical career after playing the lead in a local theatrical production of 'The Wiz'. After that, bitten by the acting bug and never deterred by deafness in one ear, he went on to complete a Bachelor of Fine Arts (majoring in performing arts) at USC's School of Theatre, with the distinguished actor John Houseman as one of his drama teachers. He later went on to give his own acting classes at the Will Geer Theatricum Botanicum in Topanga Canyon. Like so many other aspiring performers, Richard had a tough time in his quest to get started in his chosen field. His chief difficulty lay in obtaining membership in the Screen Actor's Guild without experience, yet how was one to acquire experience without a union card ? Living in his car for much of this time, he made ends meet by playing small roles on stage, and, occasionally television. He also worked for a while as a telephone operator answering complaints for an LA waste disposal company. One of his local stage performances, as Romeo at the Ensemble Theatre, impressed an agent who took him on and landed him an audition for a part on the daytime soap opera Days of Our Lives (1965). Several auditions later, he got the part, and the SAG card as well. For most of his career on television, Richard played doctors, an irony which was probably not lost on him: Dr.Tomson in The Twilight Zone (1985), Dr. Lecksis in Beverly Hills, 90210 (1990), Dr.Milo Morton in \"Strong Medicine\", and, of course, Dr.Marcus Hunter, in 1295 episodes of 'Days of Our Lives', from 1985 to 1992. Richard had done his homework for the part by observing a real plastic surgeon in action. However, having played the same individual for such a lengthy period led him later to express doubts about the one-dimensional 'goody two-shoes' nature of the character, who he would have preferred a little 'rougher around the edges'. A far edgier and more complex part was that of Dr.Stephen Franklin, the chief medical officer of J. Michael Straczynski's cult sci-fi series Babylon 5 (1994). Richard played the humanly flawed, but mercurial character from 1994 to 1998 (also in three made-for-TV movies, and, briefly, in the short-lived spin-off series Crusade (1999), as part of a first-rate ensemble cast. His performances were often extremely compelling, particularly in the 'walkabout' episodes of season three, culminating with 'Shadow Dancing'. Post-Babylon, Richard played a detective in Any Day Now (1998), returned to soap opera as Clayton Boudreaux in Guiding Light (1952) and had a brief run as a scientist in the unsuccessful TV spin-off Tremors (2003). The character in his last series, Strong Medicine (2000), was killed off in the show because of the actor's tragic, untimely death at the age of 44. Richard Biggs was eulogised by Babylon 5's Straczysnky as a 'consummate professional' and 'quite simply, a terrific guy'.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1Nzg1MTE5OTleQTJeQWpwZ15BbWU4MDM1OTg0NTIx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0081863","name":"Richard Biggs","idIMDB":"nm0081863"},"actorId":"nm0081863","character":"Stephen Franklin","urlCharacter":"http://www.imdb.com/character/ch0012580","main":true},{"actorName":"Peter Jurasik","urlProfile":"http://www.imdb.com/name/nm0432867","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMDkwNDU0Ml5BMl5BanBnXkFtZTcwNDk2MDcyNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1950","placeOfBirth":" Queens, New York, USA","height":"5' 10½\" (1.79 m)","bio":"Peter Jurasik began his professional career as a stage actor working in off Broadway productions in New York and later in tours and regional theaters up and down the east coast. In 1975, he moved to Los Angeles beginning a twenty five year run as a character actor continuing to act on stage, but additionally working in feature films, in nightclubs doing comedy and especially on television with hundreds of TV appearances in both comedies and dramas. Audiences seem to remember him best for his work on 'Hill Street Blues' as Sid and later in 'Babylon 5' as Londo. He has received awards for his work on both of these shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMDkwNDU0Ml5BMl5BanBnXkFtZTcwNDk2MDcyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0432867","name":"Peter Jurasik","idIMDB":"nm0432867"},"actorId":"nm0432867","character":"Londo Mollari","urlCharacter":"http://www.imdb.com/character/ch0012577","main":true},{"actorName":"Andreas Katsulas","urlProfile":"http://www.imdb.com/name/nm0441537","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzQ4MTU2Ml5BMl5BanBnXkFtZTYwOTI0NjI3._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 May 1946","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Andrew Constantine Katsulas","height":"6' (1.83 m)","bio":"Born in St. Louis, Missouri, Andreas from a working-class Greek-American family. Attracted from early childhood to being on stage when at 4 his mother took him to see a community theater performance, he took theatre as an extra-curricular activity in high school. He then majored in it at St. Louis University, where he worked his way through school doing things like waiting on tables. Next, after earning a drama fellowship, Katsulas received a Master's Degree in Theater Arts from one of the nation's top schools for the genre, Indiana University in Bloomington, Indiana. With never a doubt or hesitation, Andreas jumped right into the professional theater world, performing in plays in his native St. Louis with the Loretto-Hilton Repertory Theater. This was followed by work with the Theatre Company of Boston. After that, Katsulas moved to New York to some challenging off-off-Broadway theater at La Mama. This was followed by a fifteen-year heart and soul involvement with Peter Brook's International Theatre Company in Paris, performing around the world with a challenging combination of improvisational theater in every imaginable circumstance and space, and \"prepared\" theater pieces in traditional, as well as unconventional, theatrical spaces. Katsulas trod the boards from Lincoln Center in New York and The Kennedy Center in Washington, D.C., to the \"mean streets\" of Brooklyn and marketplaces in remote African Villages. There were performances from elite Theater Festivals in Iran, Avignon and Belgrade: in prisons & mental institutions; at rock quarries in Australia; on barrios in Venezuela; in sewage plants in Switzerland; winding through the streets of Venice, Italy; in the fields with farm workers in California, near the lakes of Minnesota with Native Americans, in sometimes extreme conditions like snow, rain, and intensive heat. During a hiatus from the stage, a part in Michael Cimino's The Sicilian (1987) brought Andreas to Los Angeles, after which he was immediately cast as Joey Venza in Ridley Scott's Someone to Watch Over Me (1987), then as Arthur, the chauffeur, in Blake Edwards's Sunset (1988). In early 2005, Andreas was diagnosed with inoperable lung cancer; he passed away a year later, in Los Angeles. He had lived there since 1986, and had hoped to return to working in the theater before his far-too-early death, just over three months shy of his 60th birthday.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzQ4MTU2Ml5BMl5BanBnXkFtZTYwOTI0NjI3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0441537","name":"Andreas Katsulas","idIMDB":"nm0441537"},"actorId":"nm0441537","character":"G'Kar","urlCharacter":"http://www.imdb.com/character/ch0012572","main":true},{"actorName":"Ally Warren","urlProfile":"http://www.imdb.com/name/nm0912714","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTFiMTY3ZTMtOGNhZS00ZDcyLTkxZDItYjE2NjliZGE0NjMxXkEyXkFqcGdeQXVyMjYzNzExMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Ally Warren was raised in Montreal, Canada. Her first acting part was as the Patridge in a Pear Tree in the Twelve Days of Christmas in grade one at Cedar Park Elementary School, in Pointe Claire Quebec. She studying acting formally with a variety of different teachers in a variety of different methods (or styles) including Master Classes in American Film Acting with Jeff Corey (Butch Cassidy and the Sundance Kid, The Actor's Studio Alum), Stanislavski Method with Alexei Batalov from the Moscow Art Theater (accomplished Russian Film and Konstantin Stanislavski's last protege) and attended the University of British Columbia in the BA/BFA acting programs. At UBC, during Summer Stock, Ally Directed the play \"The Virtuous Burglar\", a Nobel Peace Prize winning play by Italian, Dario Fo, on the Main Stage of the Frederic Wood Theatre with an ensemble cast of 9 actors including herself as the Second Burglar, Dario Fo's cameo role. Ally played \"The Steakbroker\" in 'The Food and I', a short film which won Special Jury Prize at Italy's Invideo Film Festival. She won Best Actress at the Persistence of Vision Film Festival for her portrayal of Gail, a cancer patient gone insane, in the short film The Tumor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTFiMTY3ZTMtOGNhZS00ZDcyLTkxZDItYjE2NjliZGE0NjMxXkEyXkFqcGdeQXVyMjYzNzExMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0912714","name":"Ally Warren","nicknames":["Ally"],"idIMDB":"nm0912714"},"actorId":"nm0912714","character":"Minbari","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0871427","urlIMDB":"http://www.imdb.com/title/tt0871427","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"13","month":"11","year":"2006","remarks":null},{"money":null,"country":null,"day":"24","month":"11","year":"2006","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 15 min (75 min) (USA)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.5","filmingLocations":[{"location":"Vancouver, British Columbia, Canada"}],"rated":"NOT RATED","awards":[],"votes":"3,428","type":"Video","companyCreditsSimple":[{"idCompany":"co0193718","name":"Lost Tales Films"},{"idCompany":"co0188057","name":"NS Pictures"},{"idCompany":"co0080422","name":"Warner Bros. Entertainment"}],"keywords":{"keywords":["space opera","23rd century","babylon babylonia","cult film","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 06:06:09"}}