{"data":{"movies":[{"title":"Sugarhouse","originalTitle":"","year":"2007","releaseDate":"20070824","directors":[{"name":"Gary Love","id":"nm0522327"}],"writers":[{"name":"Dominic Leyton","id":"nm2364947"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNTE0MzM5NF5BMl5BanBnXkFtZTgwNDYzMTA2MDE@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Crime","Thriller"],"plot":"Upper middle class employee Tom ventures into a derelict squatter building to buy a gun from D, a cocky but stupid, homeless crack-junkie, who meanly tries to extort above the agreed price. As D stole the gun from his macho dealer Hoodwink, the bully is on the warpath to get it back by beating up all his pushers in turn and order them to get it, anyhow. Tom's attempts to reason with Hoodwink or buy off his wrath only get him seriously abused. He and D gradually get to know what makes the other tick and digress for reasonable life.","simplePlot":"Upper middle class employee Tom ventures into a derelict squatter building to buy a gun from D, a cocky but stupid, homeless crack-junkie, who meanly tries to extort above the agreed price.... ","actors":[{"actorName":"Steven Mackintosh","urlProfile":"http://www.imdb.com/name/nm0533599","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNzkxODA5NV5BMl5BanBnXkFtZTcwMjI0MjY2OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 April 1967","placeOfBirth":" Cambridge, Cambridgeshire, England, UK","bio":"Steven Mackintosh was born on April 30, 1967 in Cambridge, Cambridgeshire, England. He is an actor, known for Lock, Stock and Two Smoking Barrels (1998), Underworld: Evolution (2006) and Underworld: Rise of the Lycans (2009). He has been married to Lisa Jacobs since 1989. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNzkxODA5NV5BMl5BanBnXkFtZTcwMjI0MjY2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0533599","name":"Steven Mackintosh","idIMDB":"nm0533599"},"actorId":"nm0533599","character":"Tom","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ashley Walters","urlProfile":"http://www.imdb.com/name/nm0910180","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MDgxNTI2NF5BMl5BanBnXkFtZTcwMDY0MjA1NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 June 1982","placeOfBirth":" London, England, UK","height":"5' 8½\" (1.74 m)","bio":"Ashley Walters was born on June 30, 1982 in London, England. He is an actor, known for Get Rich or Die Tryin' (2005), Bullet Boy (2004) and The Killing Gene (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MDgxNTI2NF5BMl5BanBnXkFtZTcwMDY0MjA1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0910180","name":"Ashley Walters","nicknames":["Asher D"],"idIMDB":"nm0910180"},"actorId":"nm0910180","character":"D","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andy Serkis","urlProfile":"http://www.imdb.com/name/nm0785227","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNzI2OTA3Nl5BMl5BanBnXkFtZTYwNDIwNzA1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1964","placeOfBirth":" Ruislip, London, England, UK","birthName":"Andrew Clement G. Serkis","height":"5' 8\" (1.73 m)","bio":"Andrew Clement G. Serkis was born April 20, 1964, in Ruislip Manor, West London, England. He has three sisters and a brother. His father, Clement Serkis, an ethnic Armenian whose original family surname was \"Serkissian\", was a Medical Doctor working abroad, in Iraq; the Serkis family spent a lot of time traveling around the Middle East. For the first ten years of his life, Andy Serkis used to go backwards and forwards between Baghdad and London. His mother, Lylie (Weech), who is British-born, was busy working as a special education teacher of handicapped children, so Andy and his four siblings were raised with au pairs in the house. Young Andy Serkis wanted to be an artist; he was fond of painting and drawing, and visualized himself working behind the scenes in productions. He attended St. Benedict's School, a Roman Catholic School for boys at the Benedictine Abbey in London. Serkis studied visual arts at Lancaster University in the north-west of England. There, he became involved in mechanical aspects of the theatre and did stage design and set building for theatrical productions. Then, Serkis was asked to play a role in a student production, and made his stage debut in Barrie Keeffe's play, \"Gotcha\"; thereafter, he switched from stage design to acting, which was a real calling that transformed his life. Instead of going to an acting college, Serkis, in 1985, began his professional acting career at the Duke's Playhouse in Lancaster, where he was given an Equity card and performed in fourteen plays, one after another, as an apprentice of Jonathan Petherbridge. After that, he worked in touring theatre companies, doing it for no money, fueled by a sense of enthusiasm, moving to a new town every week. He has thus appeared in a host of popular plays and on almost every renowned British stage. In 1989, he appeared in a stage production of William Shakespeare's \"Macbeth\", so beginning his long association with the Royal Exchange Theatre, Manchester, where he would return many times, to appear in \"She Stoops to Conquer\", \"Your Home in the West\" and the \"True Nature of Love\", among other plays. In the 1990s, Serkis began to make his mark on the London stage, appearing at the Royal Court Theatre as \"The Fool\" in \"King Lear\", making his interpretation of \"The Fool\" as the woman that \"Lear\", a widower, could relate to - a man, in drag, as a Victorian musician. He also appeared as \"Potts\" in the hit play, \"Mojo\", playing in front of full houses and earning huge critical success. In 1987, Serkis made his debut on television, and he acted in several major British TV miniseries throughout the 1990s. In 1999, Andy Serkis landed the prize role of \"Gollum\" in Peter Jackson's epic film trilogy based on J.R.R. Tolkien's saga, \"The Lord of the Rings\". He spent four years in the part and received awards and nominations for his performance as \"Gollum\", a computer-generated character in The Lord of the Rings: The Return of the King (2003), which won 11 Oscars. \"Gollum\" was the collaborative team's effort around Serkis's work in performance capture - an art form based on CGI-assisted acting. Serkis's work was an interactive performance in a skin-tight CGI suit with markers allowing cameras to track and register 3D position for each marker. Serkis' every nuance was picked up by several cameras positioned at precisely calculated angles to allow for the software to see enough information to process the image. The images of Serkis' performances were translated into the digital format by animators at Weta Digital studio in New Zealand. There, his image was key-frame animated and then edited into the movie, Serkis did have one scene in \"The Return of the King\" showing how he originally had the ring, killing another hobbit to posses it after they found it during a fishing trip. He drew from his three cats clearing fur balls out of their throats to develop the constricted voice he produced for \"Gollum\" and \"Sméagol\", and it was also enhanced by sound editing in post-production. Serkis spent almost two years in New Zealand and away from his family, and much of 2002 and 2003 in post-production studios for large periods of time, due to complexity of the creative process of bringing the character of \"Gollum\" to the screen. Serkis had to shoot two versions for every scene; one version was with him on camera, acting with (chiefly) Elijah Wood and Sean Astin, which served both to show Wood and Astin the moves so that they could precisely interact with the movements of \"Gollum\", and to provide the CGI artists the subtleties of Gollum's physical movements and facial expressions for their manual finishing of the animated images. In the other version, he'd do the voice off-camera, as Wood and Astin repeated their movements as though \"Gollum\" were there with them; that take would be the basis for inserting the CGI Gollum used in the released movie. In post-production, Serkis was doing motion-capture wearing a skintight motion capture suit with CGI gear while acting as a virtual puppeteer redoing every single scene in the studio. Additional CGI rotomation was done by animators using the human eye instead of the computer to capture the subtleties of Serkis' performance. Serkis also used this art form in his performance as \"Kong\" in King Kong (2005), which won him a Toronto Film Critics Association Award (2005) for his unprecedented work helping to realize the main character in \"King Kong\", and a Visual Effects Society Award (2006) for Outstanding Animated Character in a Live Action Motion Picture. Apart from his line of CGI-driven characters, Serkis continued with traditional acting in several leading and supporting roles, such as his appearances as \"Richard Kneeland\" opposite Jennifer Garner in 13 Going on 30 (2004), and \"Alley\" opposite David Bowie in The Prestige (2006), among other film performances. On television, he starred as 'Vincent Van Gogh' in the sixth episode of Simon Schama's Power of Art (2006), the BBC2 series about artists. Serkis is billed as \"Capricorn\" in the upcoming adventure film, Coeur d'encre (2008). At the same time, he continued the development of performance capture while expanding his career into computer games. He starred as \"King Bothan\" in the martial arts drama, Heavenly Sword (2007), a Playstation 3 title, for which he provided a basis for his in-game face and also acts as a dramatic director on the project. Andy Serkis married actress and singer Lorraine Ashbourne, and the couple have three children: daughter Ruby Serkis (born in 1998), and two sons Sonny Serkis (born in 2000) and Louis George Serkis (born on 19 June 2004). Away from acting, Andy Serkis is an accomplished amateur painter. Since his school years at Lancaster, being so close to the Lake District, Serkis developed his other passion in life: mountaineering. He is pescetarian. Serkis has been active in charitable causes, such as The Hope Foundation, which provides essential life-saving medical aid for children suffering from Leukemia and children from countries devastated by war. In October 2006, he was a presenter at the first annual British Academy Video Games Awards at the Roundhouse, London. Andy Serkis lives with his family in North London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNzI2OTA3Nl5BMl5BanBnXkFtZTYwNDIwNzA1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0785227","name":"Andy Serkis","nicknames":["Gollum"],"idIMDB":"nm0785227"},"actorId":"nm0785227","character":"Hoodwink","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adam Deacon","urlProfile":"http://www.imdb.com/name/nm0212563","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY3MjQ1Njg3OV5BMl5BanBnXkFtZTcwMTYyODM0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1983","placeOfBirth":" London, England, UK","height":"5' 5\" (1.65 m)","bio":"Adam Deacon is an actor and rapper from Hackney, East London. His father is from Morocco, and walked out on the family when Adam was just 2 years old. At the age of 12 Deacon began to act and trained at the Anna Scher Theatre. His early career included work with Y Touring Theatre Company, with whom he appeared in a number of tours including Cracked by Nicola Baldwin. Deacon co-starred in West 10 LDN, a Kidulthood-like TV program made by Noel Clarke. He has also starred as 'Bones' in an MTV show called Dubplate Drama. His next role was in 4.3.2.1, a heist movie, released in June 2010 which also starred Tamsin Egerton, Emma Roberts and Noel Clarke, who directed the film. Recently Adam co-wrote, co-directed and played the lead role in Anuvahood, which was released on March 18 2011. The film is described as, \"A pulls-no-punches, coming-of-age story, centering on one directionless hopeless 'shotter', who finds his true worth in the face of urban adversity.\" Adam has featured in various music videos including; Bashy's \"Who wants to be a millionaire\" and Chipmunk's Chip Diddy Chip. He is also a musician and musical performer most noted for his two tracks on the soundtrack to Adulthood. The tracks are: 'Adamhood' and 'On It 08'","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY3MjQ1Njg3OV5BMl5BanBnXkFtZTcwMTYyODM0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0212563","name":"Adam Deacon","idIMDB":"nm0212563"},"actorId":"nm0212563","character":"Ray","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Teddy Nygh","urlProfile":"http://www.imdb.com/name/nm1107048","urlPhoto":"","biography":{"dateOfBirth":"1979","placeOfBirth":" London, England, UK","bio":"Teddy Nygh was born in 1979 in London, England. He is an actor and director, known for Clash A' Da Tight 1's (2007), Riot from Wrong (2012) and Rwd/Fwd (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1107048","name":"Teddy Nygh","idIMDB":"nm1107048"},"actorId":"nm1107048","character":"Gary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tolga Safer","urlProfile":"http://www.imdb.com/name/nm1670700","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MTYzOTAyOV5BMl5BanBnXkFtZTcwODE2MjkwNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 June 1982","placeOfBirth":" London, England, UK","height":"5' 9\" (1.75 m)","bio":"Tolga Safer was born on June 26, 1982 in London, England. He is an actor, known for Harry Potter and the Goblet of Fire (2005), Spotless (2015) and New Blood (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MTYzOTAyOV5BMl5BanBnXkFtZTcwODE2MjkwNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1670700","name":"Tolga Safer","idIMDB":"nm1670700"},"actorId":"nm1670700","character":"Sef","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ade","urlProfile":"http://www.imdb.com/name/nm0011744","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjQ2Njk3NjYxNF5BMl5BanBnXkFtZTgwNDM5Nzc1OTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 11½\" (1.82 m)","bio":"Born in London, in the early seventies, Ade tried his hand at various trades; from selling shoes, tickets for concerts, managing bands, to publishing an international horse racing magazine. Ade was known by Guy Ritchie who cast him as Tyrone the getaway driver in Snatch (2000). He then set off on the European press jaunt & traveled to the United States to preview the movie, addressing the audience at Harry Knowles' 24hr film festival at The Alamo, Texas. Ade has since been involved with several other film and TV projects; notably as Infante in the Bond movie Casino Royale (2006) and Madonna's directorial debut Filth and Wisdom (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjQ2Njk3NjYxNF5BMl5BanBnXkFtZTgwNDM5Nzc1OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0011744","name":"Ade","idIMDB":"nm0011744"},"actorId":"nm0011744","character":"Paul","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tracy Whitwell","urlProfile":"http://www.imdb.com/name/nm0926605","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODkxYzZkOTctMTBhZC00ZmI3LTgxNjgtY2I0ZWQzYjdiNzEzXkEyXkFqcGdeQXVyMzE3OTU5Mg@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"bio":"Tracy Whitwell is an actress, known for Purely Belter (2000), Sugarhouse (2007) and The Knock (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODkxYzZkOTctMTBhZC00ZmI3LTgxNjgtY2I0ZWQzYjdiNzEzXkEyXkFqcGdeQXVyMzE3OTU5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0926605","name":"Tracy Whitwell","idIMDB":"nm0926605"},"actorId":"nm0926605","character":"Tanya","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Gressieux","urlProfile":"http://www.imdb.com/name/nm0340370","urlPhoto":"","biography":{"bio":"Stephen Gressieux is an actor, known for Sugarhouse (2007), Tea and Biscuits (2009) and Another Time, Another Place (1983).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0340370","name":"Stephen Gressieux","idIMDB":"nm0340370"},"actorId":"nm0340370","character":"Café Owner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sharnie Hobbs","urlProfile":"http://www.imdb.com/name/nm2361104","urlPhoto":"","biography":{"bio":"Sharnie Hobbs is an actress, known for Sugarhouse (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2361104","name":"Sharnie Hobbs","idIMDB":"nm2361104"},"actorId":"nm2361104","character":"Michela","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steven Robertson","urlProfile":"http://www.imdb.com/name/nm1017414","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MTE4MzI0M15BMl5BanBnXkFtZTYwMTMyMzI3._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1980","placeOfBirth":" Shetland Islands, Scotland, UK","height":"5' 8\" (1.73 m)","bio":"Born in Vidlin in the Shetland Islands, Steven Robertson overcame severe dyslexia to be named Student of the Year at Fife College in Kirkcaldy in recognition of his 'journey travelled'. After completing college he came to London to study drama at the Guildhall acting school, becoming the first Shetlander to be accepted there. In 2004 he was nominated for an Ian Charleson Award for his role in Chekhov's 'The Seagull' and has subsequently reached wider audiences with his film performances.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MTE4MzI0M15BMl5BanBnXkFtZTYwMTMyMzI3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1017414","name":"Steven Robertson","idIMDB":"nm1017414"},"actorId":"nm1017414","character":"Chris the Pinhead","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sharon D. Clarke","urlProfile":"http://www.imdb.com/name/nm0164995","urlPhoto":"","biography":{"dateOfBirth":"1966","placeOfBirth":" England, UK","birthName":"Sharon Deon Clarke","bio":"Sharon D. Clarke was born in 1966 in England as Sharon Deon Clarke. She is an actress, known for Holby City (1999), Beautiful People (1999) and The Darkest Universe (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0164995","name":"Sharon D. Clarke","idIMDB":"nm0164995"},"actorId":"nm0164995","character":"Crystal","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicole Kent","urlProfile":"http://www.imdb.com/name/nm2752159","urlPhoto":"","biography":{"dateOfBirth":"3 October 1990","placeOfBirth":" London, England, UK","birthName":"Nicole Shena Kent","height":"5' 6\" (1.68 m)","bio":"Nicole Kent was born in 1990. Nicole started on stage with dance and singing numbers and eventually moved to television. An accomplished young actress, she is a twin of Nathan Kent and daughter of Flor Kent, together they performed in several productions including Sugarhouse (2007), Egypt (2005), etc. Nicole is fluent in English and Spanish, she has a passion for singing and lives in London.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2752159","name":"Nicole Kent","nicknames":["Nicky"],"idIMDB":"nm2752159"},"actorId":"nm2752159","character":"Sef's Sister","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nathan Kent","urlProfile":"http://www.imdb.com/name/nm2740853","urlPhoto":"","biography":{"bio":"Nathan Kent is an actor, known for Sugarhouse (2007), French Exchange (2009) and Lift (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2740853","name":"Nathan Kent","idIMDB":"nm2740853"},"actorId":"nm2740853","character":"Sef's Brother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Flor Kent","urlProfile":"http://www.imdb.com/name/nm2740622","urlPhoto":"","biography":{"dateOfBirth":"22 August 1961","placeOfBirth":" Puerto La Cruz, Venezuela","height":"5' 7½\" (1.71 m)","bio":"Flor Kent was born on August 22, 1961 in Puerto La Cruz, Venezuela. She is an actress, known for Sugarhouse (2007), Saddam's Tribe: Bound by Blood (2007) and Alien Autopsy (2006). She has been married to David Kent since June 25, 1988. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2740622","name":"Flor Kent","idIMDB":"nm2740622"},"actorId":"nm2740622","character":"Sef's Mum","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0847526","urlIMDB":"http://www.imdb.com/title/tt0847526","business":{"budget":{"money":"£650,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"£17,793","country":"UK","day":"24","month":"08","year":"2007","remarks":"43 Screens"}],"gross":[{"money":"£36,335","country":"UK","day":"02","month":"09","year":"2007","remarks":""}],"weekendGross":[{"money":"£1,297","country":"UK","day":"02","month":"09","year":"2007","remarks":"2 Screens"},{"money":"£17,793","country":"UK","day":"26","month":"08","year":"2007","remarks":"43 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min) (UK)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":["Sony HDW-F900R, Zeiss DigiPrime Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":["HDCAM (1080p/25)"],"printedFilmFormat":null},"rating":"5.9","filmingLocations":[{"location":"London, England, UK"}],"rated":"R","awards":[],"votes":"1,179","type":"Movie","companyCreditsSimple":[{"idCompany":"co0009090","name":"Slingshot Productions"},{"idCompany":"co0132203","name":"Lunar Films"},{"idCompany":"co0187060","name":"Wolf Committee"}],"keywords":{"keywords":["bully","beating","male full back nudity","bare butt","male nudity","bloody nose","knife","male rear nudity","abuse"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:25:35"}}